{
  "nome_completo": "Abu Mansur ibn Tahir Al-Baghdadi",
  "nome_curto": "Al-Baghdadi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Baghdadi/",
  "data_nascimento": "about 980",
  "local_nascimento": "Baghdad, Iraq",
  "data_morte": "1037",
  "local_morte": null,
  "summary": "Al-Baghdadi was an Islamic mathematician who wrote about different systems of arithmetic in a work of great importance in the history of mathematics.",
  "biografia": "Al-Baghdadi\nis sometimes known as\nIbn Tahir.\nHis full name is Abu Mansur Abr al-Qahir ibn Tahir ibn Muhammad ibn Abdallah al-Tamini al-Shaffi al-Baghdadi. We can deduce from al-Baghdadi's last two names that he was descended from the Bani Tamim tribe, one of the Sharif tribes of ancient Arabia, and that he belonged to the Madhhab Shafi'i school of religious law. This school of law, one of the four Sunni schools, took its name from the teacher Abu 'Abd Allah as-Shafi'i\n(767\n-\n820)\nand was based on both the divine law of the Qur'an or Hadith and on human logical reasoning when no divine teachings were given.\nWe have a few details of al-Baghdadi's life. He was born and brought up in Baghdad but left that city to go to Nishapur\n(\nsometimes written Neyshabur in English\n)\nin the Tus region of northeastern Iran. He did not go to Nishapur alone, but was accompanied by his father who must have been a man of considerable wealth, for al-Baghdadi, without any apparent income himself, was able to spend a great deal of money on supporting scholarship and men of learning.\nAt this time Nishapur was, like the whole of the region around it, a place where there was little political stability as various tribes and religious groups fought with each other. When riots broke out in Nishapur, al-Baghdadi decided that he required a more peaceful place to continue his life as an academic so he moved to Asfirayin. This town was quieter and al-Baghdadi was able to teach and study in more peaceful surroundings. He was certainly considered as one of the great teachers of his time and the people of Nishapur were sad to lose the great scholar from their city.\nIn Asfirayin, al-Baghdadi taught for many years in the mosque. Always having sufficient wealth, he took no payment for his teachings, devoting his life to the pursuit of learning and teaching for its own sake. His writings were mainly concerned with theology, as we must assume were his teachings. However, he wrote at least two books on mathematics.\nOne,\nKitab fi'l-misaha\n, is relatively unimportant. It is concerned with the measurement of lengths, areas and volumes. The second is, however, a work of major importance in the history of mathematics. This treatise,\nal-Takmila fi'l-Hisab\n, is a work in which al-Baghdadi considers different systems of arithmetic. These systems derive from counting on the fingers, the\nsexagesimal\nsystem, and the arithmetic of the Indian numerals and fractions. He also considers the arithmetic of\nirrational\nnumbers and business arithmetic. In this work al-Baghdadi stresses the benefits of each of the systems but seems to favour the Indian numerals.\nSeveral important results in\nnumber theory\nappear in the\nal-Takmila\nas do comments which allow us to obtain information on certain texts of\nal-Khwarizmi\nwhich are now lost. We shall discuss the number theory results in more detail below, but first let us comment on the light which the\nal-Takmila\nsheds on the problem of why Renaissance mathematicians were divided into \"abacists\" and \"algorists\" and exactly what is captured by these two names. It seems clear that those using Indian numerals used an\nabacus\nand were then called \"abacists\". The \"algorists\" followed the methods of\nal-Khwarizmi\n's lost work which, contrary to what was originally thought, is not a work on Indian numerals but rather a work on finger counting methods. This becomes clear from the references to the lost work by al-Baghdadi.\nLet us now consider the number theory in\nal-Takmila\n. Al-Baghdadi gives an interesting discussion of\nabundant numbers\n,\ndeficient numbers\n,\nperfect numbers\nand\nequivalent numbers\n. Suppose that, in modern notation,\nS\n(\nn\n)\nS(n)\nS\n(\nn\n)\ndenotes the sum of the aliquot parts of\nn\nn\nn\n, that is the sum of its proper quotients. First al-Baghdadi defines perfect numbers\n(\nthose number\nn\nn\nn\nwith\nS\n(\nn\n)\n=\nn\nS(n) = n\nS\n(\nn\n)\n=\nn\n)\n, abundant numbers\n(\nthose number\nn\nn\nn\nwith\nS\n(\nn\n)\n>\nn\nS(n) > n\nS\n(\nn\n)\n>\nn\n)\n, and deficient numbers\n(\nthose number\nn\nn\nn\nwith\nS\n(\nn\n)\n<\nn\nS(n) < n\nS\n(\nn\n)\n<\nn\n)\n. Of course these properties of numbers had been studied by the ancient Greeks. Al-Baghdadi gives some elementary results and then states that\n945\nis the smallest odd abundant number, a result usually attributed to\nBachet\nin the early\n17\nth\ncentury.\nNicomachus\nhad made claims about perfect numbers in around\n100\nAD which were accepted, seemingly without question, in Europe up to the\n16\nth\ncentury. However, al-Baghdadi knew that certain claims made by\nNicomachus\nwere false. Al-Baghdadi wrote\n(\nsee for example\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nHe who affirms that there is only one perfect number in each power of\n10\nis wrong; there is no perfect number between ten thousand and one hundred thousand. He who affirms that all perfect numbers end with the figure\n6\nor\n8\nare right.\nNext al-Baghdadi goes on to define equivalent numbers, and appears to be the first to study them. Two numbers\nm\nm\nm\nand\nn\nn\nn\nare called equivalent if\nS\n(\nm\n)\n=\nS\n(\nn\n)\nS(m) = S(n)\nS\n(\nm\n)\n=\nS\n(\nn\n)\n. He then considers the problem: given\nk\nk\nk\n, find\nm\n,\nn\nm, n\nm\n,\nn\nwith\nS\n(\nm\n)\n=\nS\n(\nn\n)\n=\nk\nS(m) = S(n) = k\nS\n(\nm\n)\n=\nS\n(\nn\n)\n=\nk\n. The method he gives is a pretty one. He then gives the example\nk\n=\n57\nk = 57\nk\n=\n5\n7\n, obtaining\nS\n(\n159\n)\n=\n57\nS(159) = 57\nS\n(\n1\n5\n9\n)\n=\n5\n7\nand\nS\n(\n559\n)\n=\n57\nS(559) = 57\nS\n(\n5\n5\n9\n)\n=\n5\n7\n. However, he missed\n703\n, for\nS\n(\n703\n)\n=\n57\nS(703) = 57\nS\n(\n7\n0\n3\n)\n=\n5\n7\nas well.\nThe results that al-Baghdadi gives on\namicable numbers\nare only a slight variations on results given earlier by\nThabit ibn Qurra\n. In modern notation,\nm\nm\nm\nand\nn\nn\nn\nare amicable if\nS\n(\nn\n)\n=\nm\nS(n) = m\nS\n(\nn\n)\n=\nm\n, and\nS\n(\nm\n)\n=\nn\nS(m) = n\nS\n(\nm\n)\n=\nn\n.\nThabit ibn Qurra\n's theorem is as follows: for\nn\n>\n1\nn > 1\nn\n>\n1\n, let\np\nn\n=\n3.\n2\nn\n−\n1\np_{n} = 3.2^{n} -1\np\nn\n​\n=\n3\n.\n2\nn\n−\n1\nand\nq\nn\n=\n9.\n2\n2\nn\n−\n1\n−\n1\nq_{n} = 9.2^{2n-1} -1\nq\nn\n​\n=\n9\n.\n2\n2\nn\n−\n1\n−\n1\n. Then if\np\nn\n−\n1\np_{n-1}\np\nn\n−\n1\n​\n,\np\nn\np_{n}\np\nn\n​\n, and\nq\nn\nq_{n}\nq\nn\n​\nare\nprime\n, then\na\n=\n2\nn\np\nn\n−\n1\np\nn\na = 2^{n}p_{n-1}p_{n}\na\n=\n2\nn\np\nn\n−\n1\n​\np\nn\n​\nand\nb\n=\n2\nn\nq\nn\nb = 2^{n}q_{n}\nb\n=\n2\nn\nq\nn\n​\nare amicable numbers while\na\na\na\nis abundant and\nb\nb\nb\nis deficient.",
  "matematicos_citados_na_biografia": [
    "sexagesimal",
    "irrational",
    "number theory",
    "al-Khwarizmi",
    "abacus",
    "abundant numbers",
    "deficient numbers",
    "perfect numbers",
    "equivalent numbers",
    "Bachet",
    "Nicomachus",
    "amicable numbers",
    "Thabit ibn Qurra",
    "prime"
  ],
  "imagens": []
}