{
  "nome_completo": "Alain Connes",
  "nome_curto": "Alain Connes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Connes/",
  "data_nascimento": "1 April 1947",
  "local_nascimento": "Draguignan, Var, France",
  "data_morte": null,
  "local_morte": null,
  "summary": "Alain Connes is a French mathematician and theoretical physicist who works in operator algebras and noncommutative geometry.",
  "biografia": "Alain Connes\nwas born in Draguignan, a town near Cannes in the Provence- Alpes-Côte-d'Azur region of southeast France. He entered the École Normale Supérieure in Paris in\n1966\n, graduating in\n1970\n. After graduating, Connes became a researcher at the Centre National de la Recherche Scientifique. His thesis\nA classification of factors of type III\nwas on operator algebras, in particular on von Neumann algebras, and the work was supervised by\nJacques Dixmier\n. The thesis was presented to the École Normale Supérieure in\n1973\n.\nConnes spent the academic year\n1974\n-\n75\nat Queen's University in Ontario Canada. In\n1976\nhe was appointed a lecturer at the University of Paris VI, then he was promoted to professor. He spent the year\n1978\n-\n79\nat the Institute for Advanced Study at Princeton. He left the University of Paris VI in\n1980\nbut, the previous year, he had been appointed as professor at the Institut des Hautes Études Scientifiques at Bures-sur-Yvette. Connes still holds this professorship.\nIn\n1981\nConnes returned to the Centre National de la Recherche Scientifique, this time as its director of research. He held this post for eight years. Another position he was appointed to was professor at the Collège de France at Rue d'Ulm in Paris in\n1984\n. Connes currently holds both the position in the Institut des Hautes Études Scientifiques and the one in the Collège de France.\nConnes's work is on operator algebras and it is put in context by Moore\n[\n5\n]\n:-\nTo place Alain Connes's fundamental and pioneering contributions to operator algebras in context, recall that\nvon Neumann\nand Murray in the\n1930\ns and\n1940\ns were led by, among other things, the\nspectral theory\nof operators on Hilbert space, and by considerations of constructing mathematical models for\nquantum mechanical systems\n, to introduce what they called rings of operators - since renamed von Neumann algebras. ... One of the main problems has been and remains the classification of these algebras as intrinsic algebraic and\ntopological\nobjects.\nIn\n[\n5\n]\nMoore describes Connes' thesis as:-\n... already a major, stunning breakthrough in the classification problem.\nOne of the first major international distinctions for Connes was an invitation to give one of the invited lectures at the International Congress in Helsinki in\n1978\n. Four years later the award of a\nFields Medal\nto Connes was announced at a meeting of the General Assembly of the\nInternational Mathematical Union\nin Warsaw in early August\n1982\n. The Medal was not presented until the International Congress in Warsaw which could not be held in\n1982\nas scheduled and was delayed until the following year. Lectures on the work of Connes which led to his receiving the Medal were made at the\n1983\nInternational Congress. Araki, described Connes' contributions, see\n[\n2\n]\n:-\nHis most remarkable contributions are\n(1)\ngeneral classification and a structure theorem for factors of type III, obtained in his thesis\n(2)\nclassification of automorphisms of the hyperfinite factor, which served as a preparation for the next contribution\n(3)\nclassification of injective factors, and\n(4)\napplication of the theory of C*-algebras to foliations and\ndifferential geometry\nin general.\nAfter describing these contributions, Araki also notes other work of Connes such as his applications of operator algebras to differential geometry and his work on non-commutative integration theory which he published in\n1979\n.\nMoore, in\n[\n5\n]\n, sums up some of Connes' work:-\nTaken altogether Connes's work in the last decade on operator algebras and its applications has transformed the subject, and opened up entire new areas of research.\nConnes' recent work has been on noncommutative geometry and he published a major text on the topic in\n1994\n. He has studied applications to theoretical physics and his work is of major importance showing, in the words of Araki in\n[\n2\n]\n:-\n... the incredible power of Alain Connes and the richness of his contributions.\nConnes has received many awards for his work. In addition to the Fields Medal he was awarded the Prix Aimeé Berthé in\n1975\n, the Prix Pecot-Vimont in\n1976\n, the gold medal of the Centre National de la Recherche Scientifique in\n1977\n, the Prix\nAmpère\nfrom the\nAcadémie des Sciences\nin Paris in\n1980\nand in\n1981\nthe Prix de Electricité de France.\nHe was elected to the\nAcadémie des Sciences\nin\n1982\nbeing at that time only one of thirteen mathematicians in the Academy. He has been elected as a foreign member of the\nRoyal Danish Academy of Sciences\n(1980)\n, the\nNorwegian Academy of Sciences\n(1993)\nand the\nCanadian Academy of Sciences\n(1995)\n.\nConnes continues to hold the Léon Motchane Chair at the Institut des Hautes Études Scientifiques and the Chair of Analysis and Geometry in the Collège de France. In addition, in\n2003\nhe was appointed Distinguished Professor at Vanderbilt University, Tennessee, in the United States. He has continued to receive major honours such as the Clay Research Award, presented on\n24\nMay\n2000\nin Paris:-\n... for revolutionizing the field of operator algebras, for inventing modern non-commutative geometry, and for discovering that these ideas appear everywhere, including the foundations of theoretical physics.\nOn\n24\nJanuary\n2001\nthe\nRoyal Swedish Academy of Sciences\ndecided to award Connes their highly prestigious Crafoord Prize:-\n... for his penetrating work on the theory of operator algebras and for having been a founder of the non-commutative geometry.\nIn\n2004\nhe received the Gold Medal from the Centre National de la Recherche Scientifique. The announcement reads:-\nIn naming Connes the\n2004\nGold Medallist, the CNRS called him \"one of the greatest mathematicians of our time.\" Throughout his career, Connes has applied himself to solving mathematical problems arising from quantum physics and the theory of relativity. He revolutionized the theory of operator algebras and was a primary founder of a new branch of mathematics - noncommutative geometry.\nIn addition to these awards we note that Connes has been given honorary doctorates by Queen's University, Kingston, Ontario, Canada\n(1979)\n, the University of Rome Tor Vergata, Italy\n(1997)\n, and the University of Oslo, Norway\n(1999)\n. In addition to the academies mentioned above, he has been elected to the\nAmerican Academy of Arts and Sciences\n(1990)\n, the United States\nNational Academy of Sciences\n(1997)\n, and the\nRussian Academy of Sciences\n(2003)\n.",
  "matematicos_citados_na_biografia": [
    "Jacques Dixmier",
    "von Neumann",
    "spectral theory",
    "quantum mechanical systems",
    "topological",
    "Fields Medal",
    "International Mathematical Union",
    "differential geometry",
    "Ampère",
    "Académie des Sciences",
    "Royal Danish Academy of Sciences",
    "Norwegian Academy of Sciences",
    "Canadian Academy of Sciences",
    "Royal Swedish Academy of Sciences",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Russian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}