{
  "nome_completo": "Alan Baker",
  "nome_curto": "Alan Baker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baker_Alan/",
  "data_nascimento": "19 August 1939",
  "local_nascimento": "London, England",
  "data_morte": "4 February 2018",
  "local_morte": "Cambridge, England",
  "summary": "Alan Baker was an English mathematician, known for his work in number theory.",
  "biografia": "Alan Baker\nwas educated at Stratford Grammar School. From there, after winning a State Scholarship, he entered University College London where he studied for his B.Sc. He was awarded a B.Sc. with First Class Honours in Mathematics in\n1961\n. He moved on to Trinity College Cambridge where he was awarded an M.A. Continuing his research at Cambridge advised by\nHarold Davenport\n, Baker began publishing papers. In fact eight of his papers had appeared in print before he submitted his doctoral dissertation:\nContinued fractions of transcendental numbers\n(1962)\n;\nOn Mahler's classification of transcendental numbers\n(1964)\n;\nRational approximations to certain algebraic numbers\n(1964)\n;\nOn an analogue of Littlewood's Diophantine approximation problem\n(1964)\n;\nApproximations to the logarithms of certain rational numbers\n(1964)\n;\nRational approximations to the cube root of\n2\nand other algebraic numbers\n(1964)\n;\nPower series representing algebraic functions\n(1965)\n; and\nOn some Diophantine inequalities involving the exponential function\n(1965)\n. He received his doctorate from the University of Cambridge for his thesis\nSome Aspects of Diophantine Approximation\nin\n1965\n. In the same year he was elected a Fellow of Trinity College. He spent the academic year\n1964\n-\n65\nat the Department of Mathematics, University College London.\nFrom\n1964\nto\n1968\nBaker was a research fellow at Cambridge, then becoming Director of Studies in Mathematics, a post which he held from\n1968\nuntil\n1974\nwhen he was appointed Professor of Pure Mathematics. During his career at Cambridge he spent time in the United States, becoming a member of the Institute for Advanced Study at Princeton in\n1970\nand visiting professor at Stanford in\n1974\n. He also a visiting professor at the University of Hong Kong in\n1988\n, at the Eidgenössische Technische Hochschule Zürich in\n1989\n, and at the Mathematical Sciences Research Institute, Berkeley, California in\n1993\n.\nBaker was awarded a\nFields\nMedal in\n1970\nat the International Congress at Nice. This was awarded for his work on Diophantine equations. This is described by\nPaul Turán\nin\n[\n11\n]\n, who first gives the historical setting:-\nThe theory of transcendental numbers, initiated by\nLiouville\nin\n1844\n, has been enriched greatly in recent years. Among the relevant profound contributions are those of Alan Baker, Wolfgang M Schmidt, and Vladimir Gennadievich Sprindzuk. Their work moves in important directions which contrast with the traditional concentration on the deep problem of finding significant classes of finding functions assuming transcendental values for all non-zero algebraic values of the independent variable. Among these, Baker's have had the heaviest impact on other problems in mathematics. Perhaps the most significant of these impacts has been the application to\nDiophantine equations\n. This theory, carrying a history of more than one thousand years, was, until the early years of this century, little more than a collection of isolated problems subjected to ingenious ad hoc methods. It was\nAxel Thue\nwho made the breakthrough to general results by proving in\n1909\nthat all Diophantine equations of the form\nf\n(\nx\n,\ny\n)\n=\nm\nf (x, y) = m\nf\n(\nx\n,\ny\n)\n=\nm\nwhere m is an integer and f is an irreducible homogeneous binary form of degree at least three, with integer coefficients, have at most finitely many solutions in integers.\nTurán goes on to say that\nCarl Siegel\nand\nKlaus Roth\ngeneralised the classes of Diophantine equations for which these conclusions would hold and even bounded the number of solutions. Baker however went further and produced results which, at least in principle, could lead to a complete solution of this type of problem. He proved that for equations of the type\nf\n(\nx\n,\ny\n)\n=\nm\nf (x, y) = m\nf\n(\nx\n,\ny\n)\n=\nm\ndescribed above there was a bound\nB\nB\nB\nwhich depended only on\nm\nm\nm\nand the integer coefficients of\nf\nf\nf\nwith\nm\na\nx\n(\n∣\nx\n0\n∣\n,\n∣\ny\n0\n∣\n)\n≤\nB\nmax(|x_{0}|, |y_{0}|) ≤ B\nm\na\nx\n(\n∣\nx\n0\n​\n∣\n,\n∣\ny\n0\n​\n∣\n)\n≤\nB\nfor any solution\n(\nx\n0\n,\ny\n0\n)\n(x_{0}, y_{0})\n(\nx\n0\n​\n,\ny\n0\n​\n)\nof\nf\n(\nx\n,\ny\n)\n=\nm\nf (x, y) = m\nf\n(\nx\n,\ny\n)\n=\nm\n. Of course this means that only a finite number of possibilities need to be considered so, at least in principle, one could determine the complete list of solutions by checking each of the finite number of possible solutions.\nBaker also made substantial contributions to\nHilbert\n's seventh problem which asked whether or not\na\nq\na^{q}\na\nq\nwas transcendental when\na\na\na\nand\nq\nq\nq\nare algebraic.\nHilbert\nhimself remarked that he expected this problem to be harder than the solution of the\nRiemann\nconjecture. However it was solved independently by\nAleksandr Gelfond\nand\nTheodor Schneider\nin\n1934\nbut Baker\n(\n[\n6\n]\n)\n:-\n... succeeded in obtaining a vast generalisation of the\nGelfond\n-\nSchneider\nTheorem ... From this work he generated a large category of transcendental numbers not previously identified and showed how the underlying theory could be used to solve a wide range of Diophantine problems.\nTurán\n[\n11\n]\nconcludes with these remarks:-\nI remark that\n[\nBaker's\n]\nwork exemplifies two things very convincingly. Firstly, that beside the worthy tendency to start a theory in order to solve a problem it pays also to attack specific difficult problems directly. ... Secondly, it shows that a direct solution of a deep problem develops itself quite naturally into a healthy theory and gets into early and fruitful contact with significant problems of mathematics.\nAmong Baker's famous books are:\nTranscendental number theory\n(1975)\n,\nTranscendence theory : advances and applications\n(1977)\n,\nA concise introduction to the theory of numbers\n(1984)\n,\n(\nwith Gisbert Wüstholz\n)\nLogarithmic forms and Diophantine geometry\n(2007)\n, and\nA Comprehensive Course in Number Theory\n(2012)\n. We quote from the introduction to\nTranscendental number theory\n(1975)\n:-\nThe study of transcendental numbers... has now developed into a fertile and extensive theory, enriching widespread branches of mathematics. My aim has been to provide a comprehensive account of the recent major discoveries in the field. Classical aspects of the subject are discussed in the course of the narrative. Proofs in the subject tend... to be long and intricate, and thus it has been necessary to select for detailed treatment only the most fundamental results; moreover, generally speaking, emphasis has been placed on arguments which have led to the strongest propositions known to date or have yielded the widest application.\nRobert Tijdeman writes in a review of this book:-\nThe author has succeeded in his plan. This book gives a survey of the highlights of transcendental number theory, in particular of the author's own important contributions for which he was awarded a\nFields medal\nin\n1970\n. It is a very useful publication for mathematicians who want to obtain a general insight into transcendence theory, its techniques and its applicability. The style is extremely condensed, but there are many references for more detailed study. The presentation is very well done.\nThis book is also reviewed by Heini Halberstam\n(1926\n-\n2014)\nwho writes\n[\n7\n]\n:-\nWithin the space of a mere\n130\npages the author gives a panoramic account of modern transcendence theory, based on his own\nAdams\nPrize essay. The fact that this is now \"a fertile and extensive theory, enriching wide-spread branches of mathematics\" is due in large measure to the author himself, who was awarded in\n1970\na\nFields\nMedal\n(\nthe Nobel Prize of mathematics\n)\nfor his contributions. The prose is clear and economical yet interspersed with flashes of colour that convey a sense of personality; and each chapter begins with a helpful summary of the subsequent matter. The mathematical argument at all stages is highly condensed, as, indeed, is inevitable in a short research monograph covering so much ground. One might reproach the author for not having been more merciful to the beginner; but even a beginner can gain from the book a clear impression of what are the major achievements to date in this profoundly difficult field and which are the outstanding problems, while for others there is here a wealth of material for numerous fruitful study-groups.\nDon Redmond, reviewing Baker's\n1984\n\"Concise Introduction\", writes:-\nMany books do not live up to their titles, but this is one that definitely does. The book is very concise and would be a nice reference, since it covers the key points of a standard course, but the reviewer is not sure that one could use it as the sole textbook of a first course in number theory.\nDavid Singmaster, also reviewing the \"Concise Introduction\", writes\n[\n10\n]\n:-\nIntroductions to number theory are numerous, so any new introduction must be examined for novelty. This book is the material for a lecture course at the University of Cambridge. Consequently, \"concise\" is no exaggeration. ... Overall, the book is a marvel of condensation. This would be true even if all\n91\npages of text were devoted to the main material, but he has condensed further and uses about\n30\npages for his supplementary material. This contains the most useful summary of current number theory that I have seen. There is a competent index so one can locate the results. ... I would recommend this book to any serious undergraduate wanting a survey of the field, but I would warn him that the proofs require close attention. Anyone with some background in number theory will highly appreciate Baker's exposition of current knowledge\nYuri Bilu states in a review of Baker and Wüstholz's\n2007\nbook\nLogarithmic forms and Diophantine geometry\n:-\nThis long-awaited book is an introduction to the classical work of Baker, Masser and Wüstholz in a form suitable for both undergraduate and graduate students. ... This book is indeed an introduction. Its purpose is to teach principles while avoiding technicalities. This imposes certain limitations on the content. The authors treat in great detail the qualitative theory for the multiplicative group, but do not say much on the quantitative aspect, and only briefly mention abelian varieties. However, this book gives the necessary intuitive background to study the original journal articles of Baker, Masser, Wüstholz and others on the above-listed subjects.\nBaker also edited the important\nNew advances in transcendence theory\n(1988)\nand wrote the important survey with Gisbert Wüstholz entitled\nNumber theory, transcendence and Diophantine geometry in the next millennium\n. This is a survey of achievements and open problems in transcendence theory and related mathematics.\nIn\n1999\na conference was organised in Zürich to celebrate Baker's\n60\nth\nbirthday. Most of the lectures given at the meetings were published in\nA Panorama in Number Theory or The View from Baker's Garden\n(2002)\n. The Introduction to the book begins as follows:-\nThe millennium, together with Alan Baker's\n60\nth\nbirthday offered a singular occasion to organize a meeting in number theory and to bring together a leading group of international researchers in the field; it was generously supported by ETH Zürich together with the Forschungsinstitut für Mathematik. This encouraged us to work out a programme that aimed to cover a large spectrum of number theory and related geometry with particular emphasis on Diophantine aspects. ... The\nLondon Mathematical Society\nwas represented by its President, Professor Martin Taylor, and it sent greetings to Alan Baker on the occasion of his\n60\nth\nbirthday.\nIn\n[\n5\n]\nBaker makes remarks on the history of number theory, in particular on transcendental numbers. We quote from his paper:-\nWell, what does this tell us about the historical evolution of mathematics? First it is clear that a very important role has been played by a few key problems, centres of attraction, in Professor\nDieudonné\n's terminology. This may be more true of number theory than other branches of mathematics but I believe that all good work has been guided to some extent by such centres. The general trend of the particular field that I have been discussing is difficult to summarise, since it has involved in its development many novel twists and turns; but one obvious element in the evolution has been the successful blending, or fusion, of ideas from number theory and algebra with the progressively wider use of classical function theory. And it is this convergence of diverse concepts that forms the essential ingredient, I believe, in the creation of an active theory. According to Professor\nDieudonné\n, the study of transcendental numbers is only just on its way to becoming a \"method\". Given, however, the diverse nature of the problems which it has been instrumental in solving, there seems little doubt that it reached the latter stage several years ago, and it would appear, in fact that it is already on the path of becoming, in Professor\nDieudonné\n's language, a centre of radiation.\nHere are Baker's research interests as given on his University of Cambridge page\n[\n9\n]\n(\nconsulted in January\n2014)\n:-\nBaker's Theorem on the linear independence of logarithms of algebraic numbers has been the key to a vast range of developments in number theory over the past thirty years. Amongst the most significant are applications to the effective solution of Diophantine equations, to the resolution of class-number problems, to the theory of p-adic L-functions and especially, through works of Masser and Wüstholz, to many deep aspects of arithmetical algebraic geometry. The theory continues to be a source of much fruitful research to the present day.\nBaker has received many honours for his mathematical contributions in addition to the\n1970\nFields\nmedal. These include the award of the\nAdams\nprize from the University of Cambridge\n(1972)\nand election to the\nRoyal Society of London\n(1973)\n. He was awarded an honorary doctorate from Université Louis Pasteur Strasbourg\n(1998)\n, made an honorary fellow of University College London\n(1979)\n, a foreign fellow of the\nIndian Academy of Science\n(1980)\n, foreign fellow of the National Academy of Sciences India\n(1993)\n, a member of the Academia Europaea\n(1998)\n, and an honorary member of the\nHungarian Academy of Sciences\n(2001)\n.\nOutside of mathematics, Baker lists his interests as travel, photography and the theatre.",
  "matematicos_citados_na_biografia": [
    "Harold Davenport",
    "Fields",
    "Paul Turán",
    "Liouville",
    "Diophantine equations",
    "Axel Thue",
    "Carl Siegel",
    "Klaus Roth",
    "Hilbert",
    "Riemann",
    "Aleksandr Gelfond",
    "Theodor Schneider",
    "Gelfond",
    "Schneider",
    "Turán",
    "Fields medal",
    "Adams",
    "London Mathematical Society",
    "Dieudonné",
    "Royal Society of London",
    "Indian Academy of Science",
    "Hungarian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}