{
  "nome_completo": "Alan Mercer",
  "nome_curto": "Alan Mercer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mercer_Alan/",
  "data_nascimento": "22 August 1931",
  "local_nascimento": "Stocksbridge, Yorkshire, England",
  "data_morte": "9 July 2014",
  "local_morte": "Lancaster, England",
  "summary": "Alan Mercer was an English mathematician who made important contributions to the field of Operational Research.",
  "biografia": "Alan Mercer\nattended Penistone Grammar School in Penistone, Barnsley, South Yorkshire. This ancient school, founded in\n1392\n, has had many famous pupils over the years but, as far as this archive is concerned, the most notable was\nNicholas Saunderson\n. While at this school, Alan won an open scholarship to study mathematics at Sidney Sussex, University of Cambridge. Mercer first met Iris, who had also attended Penistone Grammar School, in January\n1950\n. At this meeting Iris congratulated Mercer for winning a scholarship to Cambridge. They married in\n1954\nand had two sons, Nicholas and Jonathan.\nMercer matriculated at Sidney Sussex in the autumn of\n1950\n. Early in his studies he was thinking about his future career and he began to make enquiries about where his study of the Mathematical Tripos might lead him\n[\n2\n]\n:-\nAlan went to the University Appointments Board in his first year in Cambridge and asked what a mathematician could do for a living. No answer was provided and he was told to return the next year, when he was asked what class of degree he had been awarded in Part\n1\n. Although that was a First, the only suggestions were Banking or Insurance. Disillusioned, but knowing what two Sidney Sussex students in the year ahead of him had done, he decided to stay on to take the Diploma in Mathematical Statistics. His supervisor was David Cox, who at the time was a young Assistant Lecturer. The first research Alan undertook was a statistical analysis of the counts on bull semen. The lengthy report contained a huge number of calculations performed with a hand-held Brunsviga calculator.\nDavid Roxbee Cox\n(\nborn\n1924)\nhad studied mathematics at Cambridge before obtaining a Ph.D. from the University of Leeds. From\n1950\nto\n1956\nworked at the Statistical Laboratory at the University of Cambridge. He later moved to Birkbeck College, University of London, and advised Mercer for a Ph.D. while there, but we shall return to this below.\nLeaving Cambridge, Mercer was appointed to the Field Investigation Group\n(\nOperational Research\n)\nof the National Coal Board in\n1954\n. The advertisement for the position stated that the person appointed would:-\n... study a wide variety of problems in production, planning and other activities. ... ability to handle data, to think objectively and to exercise a high degree of imagination and initiative essential.\nHis first publication was\nEstimation of the Number of Holes and Charge per Round in Tunnel Drivage\nwhich appeared in\nOperational Research Quarterly\nin March\n1957\n. By the time this paper appeared in print, Mercer had left the National Coal Board and had taken up a post with the Atomic Weapons Research Establishment at Aldermaston. He had left the Coal Board for a number of reasons. One was related to the work he was doing there, which he disliked because it involved projects that lasted several years. A second reason was his wife's health. This was not too good and it was thought that living in London was at least in part the cause of her problems. One has to remember that London in the\n1950\ns was badly affected with air pollution and, as a result, the Government passed the Clean Air Act in\n1956\n. This was the year that the Mercers went to Aldermaston in Berkshire which was at least\n60\nkm west of London. Mercer was at the Atomic Weapons Research Establishment when he submitted his paper\n(\nwith Cyril Samuel Smith who had been a colleague at the National Coal Board\n)\nA random walk in which the steps occur randomly in time\n(1959)\n. The paper was published with the permission of the National Coal Board.\nSee\nTHIS LINK\nfor details of the content of this paper.\nAt Aldermaston, Mercer had two roles in the Theoretical Physics Division\n[\n2\n]\n:-\nOne was to control a team developing Monte Carlo methods for weapon design, and thus he was one of a small team directly responsible for Britain's first hydrogen bomb. He did early pioneering work on the generation of pseudo-random numbers for high speed computers but the work was classified and he did not receive recognition for it. The other role was as operational research/statistical consultant to the whole Establishment. In this capacity he continued the stochastic processes work upon which\nFuchs\n, the atom spy, had been working at the time of his arrest, and he was responsible for the statistical work on the detection of underground nuclear explosions.\nWhile he was working at Aldermaston he also undertook research for a Ph.D. at Birkbeck College, University of London, advised by David Cox who had become a Reader there in\n1956\n. Mercer published\nSome simple duration-dependent stochastic processes\n(1959)\nand\nA queueing problem in which the arrival times of the customers are scheduled\n(1960)\ngiving his address in both as Birkbeck College, University of London and Atomic Weapons Research Establishment at Aldermaston. In both papers he writes:-\nI am indebted to Dr D R Cox for suggesting this problem and for his criticisms during the course of the work.\nSee\nTHIS LINK\nfor details of the content of these papers.\nMercer was awarded a Ph.D. by the University of London in\n1961\nfor his thesis\nSome Stochastic Processes with an Enumerable Infinity of States\n. Shortly after this, in\n1962\n, he left Aldermaston to take a position with Armour & Co Ltd, suppliers at Smithfield\n[\n1\n]\n:-\n... as the senior manager responsible for OR, statistics and data processing. Within eight months of joining the company, he had determined the company's data processing needs, ordered the computer and taken delivery of it, had a computer room built, recruited and trained systems analysts and programmers who in turn had programmed and implemented an ordering, inventory control and accounts receivable system.\nHe left this company in\n1964\nwhen he was appointed to Lancaster University's Department of Operational Research, the first such department in Britain. Lancaster was one of a number of new universities set up in the\n1960\ns and it had only been established in\n1964\n, so Mercer was one of the founding figures. The first students arrived at the university in October\n1964\nso Mercer had a major influence in determining the direction of the Department. In particular he was keen to see the Department have strong links with industry. For example one of his first tasks was to advise Allied Breweries on a quality control system for their Burton-on-Trent brewery. Other firms that he advised over the years include Tilcon, the premix concrete supplier, Burton's Biscuits, Imperial Chemical Industries, Gallaher, Wilkinson Sword, Unilever, Mars, Anheuser-Busch, Serck Services, Edmundsen Electrical, and International Computers. The Lancaster Department continues to have the aims with which it was founded as the current\n(2015)\ndescription shows:-\nThe Department of Management Science has one of the largest groups of operational research and systems teaching staff in Europe. Most of our faculty have previous industrial or public sector experience. We have a strong commitment to produce research of practical importance, capitalising on a tradition of collaborative research with industrial partners.\nMercer spent the rest of his career at Lancaster University. He played a major international role in operational research. For example he served on the Council of the Operational Research Society from\n1969\n. He was a founding editor of the European Journal of Operational Research from\n1975\n, a role he undertook jointly with two colleagues until\n1998\n. He had many other roles, for example, on the Social Science Research Council's Management and the Industrial Relations Committee\n(1972\n-\n76\nand\n1980\n-\n82)\n. He was vice-chairman and then chairman of the Industry and Employment Committee of the ESRC\n(1982\n-\n87)\nand a member of the OR Panel\n(1989\n-\n1994)\n. He also served on the Board of the Central Lancashire Development Corporation, the Warrington & Runcorn Development Corporation, Whitley Council for New Towns Staff, and the North West Economic Planning Council. He was the director of Buoymasters\n(\nLancaster\n)\nLimited, a Residents property management company, from\n1992\nto\n1997\n.\nHe retired from his chair at Lancaster University in\n1998\nbut continued to supervise his Ph.D. students. He also continued to give M.Sc. lecture courses and chaired most of the Department of Management Science PhD vivas for ten years after he retired.\nGraham Rand writes\n[\n2\n]\n:-\nAlan's last visit to the Department was in September\n2013\n, to take part in a day of celebration of\n50\nyears since Pat Rivett's appointment. He gave a typical, lengthy, speech, full of forthright opinions, which several alumni regarded as spellbinding. On Christmas Day I received an email from Alan. He had delayed opening his copy of 'Inside O.R.' until then, and found a report of the celebrations. Alan wrote: 'Page\n10\nincludes a photo of me, which is significant for two reasons. First, it includes the words Lancaster University, to which I devoted most of my life. Second, it is likely to be the last photo of me.' Alan was highly innovative, with a wide range of interests. He had an abrasive style that many will remember. Nevertheless, he made a huge contribution to O.R. in the UK, through his development of the Lancaster O.R. Department, and in Europe, through his editorship of the European Journal of Operational Research.",
  "matematicos_citados_na_biografia": [
    "Nicholas Saunderson",
    "Operational Research",
    "THIS LINK",
    "Fuchs"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}