{
  "nome_completo": "Thomas Arthur Alan Broadbent",
  "nome_curto": "Alan Broadbent",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Broadbent/",
  "data_nascimento": "31 May 1903",
  "local_nascimento": "Consett, County Durham, England",
  "data_morte": "27 January 1973",
  "local_morte": "Greenwich, England",
  "summary": "Alan Broadbent was a British mathematician who was editor of the Mathematical Gazette for many years.",
  "biografia": "Alan Broadbent\n's parents were George Thomas Broadbent and his wife Harriet. George Broadbent was the son of a Methodist minister who died in Consett, County Durham, while on a three year posting there. His wife and children, including George Broadbent, then spent the rest of their lives in Consett. George Broadbent's son Alan Broadbent, the subject of this biography, was known as Alan or later, sometimes as 'T.A.A.B.' He was born in Consett and attended the secondary school there where he was taught mathematics by Johnny Moore. Broadbent then attended Armstrong College in Newcastle-on-Tyne where he was taught by George William Caunt who was a lecturer there. Caunt was a particularly fine teacher who wrote texts such as\nThe elements of hydrostatics\n(1910)\n,\nAn introduction to the infinitesimal calculus; with applications to mechanics and physics\n(1914)\n, and\nElementary calculus\n(1939)\n. He did much to enthuse Broadbent both for the mathematics he taught and also for his greatly appreciated skills as a teacher. Broadbent was particularly impressed by Caunt's infinitesimal calculus textbook which he later championed in his own teaching.\nIn\n1921\nBroadbent matriculated at St John's College, Cambridge. There he studied the mathematical tripos and, after a couple of years, became a close friend of\nWilliam Hodge\nwho began studying at the same College. The two were almost exactly the same age, Broadbent being about two weeks older than\nHodge\n. Broadbent was an outstanding student and was First Class in both parts of the tripos\n[\n1\n]\n:-\nThe old-fashioned trick question of fiendish ingenuity which had characterized the Tripos in the nineteenth and early twentieth centuries, if not completely banished, had been reduced to size and formed the subject of part I ... The two years leading to part II were devoted to giving students a proper grounding in the modern ideas of mathematics, and for the specialist there was the optional schedule B of part II, in which advanced courses could be offered.\nBroadbent, who was taught by\nJ E Littlewood\nand F P White\n(\nwho lectured on projective geometry\n)\n, was awarded a star in Schedule B and, in\n1924\n, was awarded the St John's College Wright prize which is \"awarded to a candidate whose performance in the First Class in an Approved Examination is judged to have been of special merit\" and a Senior Fellowship by St John's College. He continued to undertake research at Cambridge for a further two years advised by\nJ E Littlewood\n. However, despite being extremely able, he felt that research was not his greatest strength but rather he felt that he should devote his career to being a teacher of mathematics. He felt that he lacked the creativity necessary to be a leading researcher and for Broadbent being a mediocre researcher would not have been acceptable. While undertaking research he had discovered a proof of\nHardy\n's convergence theorem which he published a few years later in\n1928\n. The paper, with title\nA proof of Hardy's Convergence Theorem\n, is in the\n1928\nJournal\nof the\nLondon Mathematical Society\n. Broadbent writes in the paper:-\nThe following proof of\nHardy\n's convergence theorem was discovered some time ago, independently of the similar proof by\nE B Elliott\n[\nJournal London Math. Soc,\n1\n(1926)\n,\n93\n-\n96]\n. In view of the importance of the theorem, the slightly more direct nature of this method may merit a short note.\nThere is no real evidence that Broadbent was right in feeling that he would not have made a leading researcher but, nevertheless, he decided to give up research at Cambridge and seek a lecturing position. We note, for instance, that his companion\nWilliam Hodge\n, who went on to become an exceptional mathematical researcher, was undertaking research in St John's College at the same time as Broadbent and left Cambridge at the same time after one year's research also feeling that he had made little progress. Broadbent was appointed as an assistant lecturer at the University of Reading in\n1926\n[\n7\n]\n:-\nThere he acquired the interests in literature, European history and bibliography which flourished for the rest of his life.\nBroadbent married Janet\n(\nNita\n)\nHodge in\n1930\n. She was the sister of his friend\nWilliam Vallance Douglas Hodge\nwho had lived in rooms in St John's College in\n1925\n-\n26\nwith Broadbent. She had been brought up in Edinburgh, Scotland. Nita and Alan Broadbent had two children; a son Richard\n(\nDick\n)\nborn in\n1933\nand a daughter Frances born in\n1940\n.\nAfter nine years at the University of Reading, in\n1935\nBroadbent was appointed as an Assistant Professor of Mathematics at the Royal Naval College, Greenwich. The professor at the Royal Naval College was\nLouis Melville Milne-Thomson\nwho had been appointed in\n1921\n.\nMilne-Thomson\nwas appointed to the Gresham Chair of Geometry at the Royal Naval College in\n1946\n. We note that this Chair is over\n400\nyears old, the first occupant being\nHenry Briggs\nin\n1596\n. When\nMilne-Thomson\nreached the age of\n65\nin\n1956\n, he retired from the Gresham Chair of Geometry and Broadbent was appointed to the Chair. This appointment was made, as all to this Chair are, by the City of London Corporation and Broadbent then joined a list of outstanding mathematicians who had been Gresham Professors of Geometry including\nIsaac Barrow\nand\nRobert Hooke\n. When\nMilne-Thomson\nretired in\n1956\n, Broadbent also became Professor of Mathematics at the Royal Naval College, Greenwich. He held this position until he retired in\n1967\nand he occupied the Gresham Chair of Geometry until\n1968\n[\n7\n]\n:-\nThroughout his\n32\nyears of service at Greenwich, Broadbent's teaching was primarily concerned with the mathematics courses for entrants to the Royal Corps of Naval Constructors and he will be remembered with gratitude and affection by generations of Naval Constructors. Outside his academic work he played a full part in the general running of the College and his wise counsel was readily available to his colleagues not only in administrative matters but also on individual personal problems.\nAt\nTHIS LINK\nwas have given extracts from nine of Broadbent's papers. Broadbent's  first paper was published in\n1930\nand the last in\n1971\n. These were all published in\nThe Mathematical Gazette\nand tell us much about Broadbent's ideas about teaching. Here is an extract from\n[\n4\n]\nwhich tells us about Broadbent's approach to his students:-\nFor many years I have made a habit of criticising severely the English used by my pupils; I have dealt with any lack of clarity or precision by abuse, ridicule, contempt, whatever mode of severe rebuke seemed most fitted to the offence and to the personality of the offender. Of course I suffer. My pupils soon learn to apply to me the canons by which I judge them; the slightest ambiguity in an examination question is detected and denounced, a lapse into jargon at the blackboard is pilloried without mercy. If in a moment of stress I endeavour to excuse myself by saying, \"Well, you know what I mean\", the excuse is not accepted; they reply, \"Of course we do, but that is no reason why you should not say what you mean\".\nIt is no coincidence that we have quoted from papers which all appeared in\nThe Mathematical Gazette.\nHe was a strong supporter of the\nMathematical Association\nand was the editor of its journal\nThe Mathematical Gazette\nfrom\n1931\nto\n1955\n.\nWilliam John Greenstreet\nhad resigned as editor in\n1930\nand\nE H Neville\nhad taken on the task on a temporary basis until Broadbent took it over in\n1931\n. His editorship made\n[\n8\n]\n:-\n... an outstanding contribution to mathematical journalism for the teaching profession, and to the whole reputation of the\nMathematical Association\nin particular.\nReflecting on his role as editor, Broadbent wrote\n[\n3\n]\n:-\nIt would be tasteless and unwise to attempt to discuss here the merits and demerits of the 'Gazette' from\n1930\nonwards. But some fairly general observations may be made on conduct and policy, on aspirations rather than on achievements. ... Speaking broadly, the review pages are the most important, and evidently the most widely read. The reviews must therefore be ample, carefully weighed and authoritative, and to them if necessary any other part of the 'Gazette' must be sacrificed. At the moment, publishing languishes, but it is hoped that we shall continue to have interesting and informative reviews in every number, and soon an increase in the number of books reviewed. The Notes should be mainly, though not exclusively, concerned with teaching points. Here it does not matter much about originality in the strict sense, a point which readers might do well to bear in mind. Someone sends a note about some property of the conic, a proof which he has worked out and has found to go down well with his class. It is printed, and what happens? Some reader, with that glow of conscious rectitude we all feel when exposing another's shortcomings, writes in this strain: \"Where can your illiterate contributor have received his so-called education, that he does not know that this proof is to be found in Modern geometry of the conic, by Messrs Blank and Blankdash, published in\n1897\nat the Press of the University of Bad Lands, Minn., and that I myself have used this very proof in my teaching for the last\n38\nyears.\" Seriously, it matters very little. As for Messrs Blank and Blankdash, very likely they took the proof from\nApollonius\nanyway. If it is good, and if it seems to be not widely known, then the 'Gazette' is the place for it, though of course priority will be gladly acknowledged if possible. ... The suggestion that there is too much high-brow material in the 'Gazette' causes me anxiety. But some of the blame, if there be any, lies on the shoulders of members themselves, since it is not unreasonable for an editor to confess his inability to publish those contributions which he never receives.\nAs well as editing this journal he reviewed a large number of books for that journal, sometimes under the name Thomas A A Broadbent, but mostly under his initials T.A.A.B. He wrote in\n[\n3\n]\n:-\nDuring the war, too many reviews bore the initials T. A. A. B. But most mathematicians were overworked and unable to spare time from national duties to perform less urgent tasks. In these circumstances it was thought better to make sure of calling attention to new books, even though the reviewer could obviously make no claim to be regarded as an expert critic.\nThis quote certainly shows Broadbent's modesty for his reviews of a wide range of books are quite superb; see extracts from several of these reviews throughout this archive\n(\nsee, for example, reviews of books by:\nE T Bell\n,\nA A Fraenkel\n,\nDavid Hilbert\n,\nLars Ahlfors\nand\nH T H Piaggio\n)\n. He was President of the\nMathematical Association\nfrom April\n1953\nto January\n1954\n. He gave his Presidential Address on\n4\nJanuary\n1954\nwhich was published as\n[\n4\n]\n. His address begins:-\nTo address this Association from the Presidential chair is a great honour; but the many famous predecessors have left a new President the difficult problem of finding a topic which they have not illuminated. My choice has been determined by the uniqueness of my position, for hitherto no one has been simultaneously your President and your Editor. It is possible to edit a mathematical periodical without knowing or learning much about mathematics; but one learns a great deal about mathematicians, and a little, at any rate, about the presentation of mathematics. I had thought of calling this address \"What I have learned in\n25\nyears\", but this suggestion aroused the criticisms, on the one hand, that many hours would be needed to cover the ground, and on the other, that the material would be exhausted in five minutes.\nIn addition to his enormous contributions to the\nMathematical Association\nwe should mention his equally important contributions to the\nLondon Mathematical Society\n. He served the Society as a member of the Council\n(\nfrom November\n1947\nto November\n1951)\n, as a Vice-President\n(1951\n-\n52)\n, and as an Honorary Auditor from\n1937\nto\n1963\n.\nNot all his publications were in\nThe Mathematical Gazette\n, for example he published\nThe concept of inequality\n(1961)\nin the\nBolletino della Unione Matematica Italiana\n. Here is Broadbent's own summary of this paper:-\nIdeas about 'less' and 'more' are as fundamental as ideas about precise equality, and should enter the teaching of mathematics at an early stage, leading to the notion of an equality as the boundary between two inequality domains.\nFinally we note that, after the paper arising from his time as a research student at Cambridge, he wrote two further research papers. One was\nThe convergence of iterative processes\n(1947)\nwhich he co-authored with\nLouis Goodstein\n. Broadbent and\nGoodstein\nhad been colleagues at Reading but Broadbent had moved to the Royal Naval College, Greenwich, over ten years before the paper was written. The other research article was\nStructural schemes for elliptic integrals\n(1971)\n. This article appears under the joint authorship of Broadbent and\nE H Neville\nbut in fact it was an article written by Broadbent based on some notes left by the late\nE H Neville\n(\nborn\n1\nJanuary\n1889\n, died\n22\nAugust\n1961)\nand entrusted to Broadbent who prepared them for publication.\nGoodstein\nwrites about Broadbent's skills\n[\n7\n]\n:-\nBroadbent's gift of language and his wide reading were perhaps even better represented in his public lectures than in anything he committed to print, and the fortunate few who heard him speak, for instance, on the mathematics in Alice in Wonderland\n(\nmany years before this became the fashionable topic it is today\n)\nwill know how brilliantly he constructed and delivered his lectures.\nLet us end by quoting\nEdwin Arthur Maxwell\n's thought from\n[\n8\n]\n. We note that\nE A Maxwell\nwas president of the\nMathematical Association\nin\n1960\n-\n61\n:-\nPerhaps only those who had the privilege of personal acquaintance will see what I mean when I say that outstanding characteristics were absolute kindliness and utter modesty, combined with complete authority and, when necessary, righteous wrath - a combination fully possible only when sympathy and integrity go hand in hand. Few men can have been more honest both in their thinking and in their speaking. We often talk about hating the sin while loving the sinner; it is certain that Alan Broadbent hated the sham while loving the shammer. ... Gifted by a voice that was both incisive and warm, he could express himself with the clarity and brevity of a real master of the English language.\nWhile on a summer holiday in\n1972\n, Broadbent suffered a heart-attack. He made a good recovery but was very frustrated since he was unable to work for some time. Back to his old self again by Christmas\n1972\n, he had a second heart-attack in January\n1973\nfrom which he died.",
  "matematicos_citados_na_biografia": [
    "William Hodge",
    "Hodge",
    "J E Littlewood",
    "Hardy",
    "London Mathematical Society",
    "E B Elliott",
    "William Vallance Douglas Hodge",
    "Louis Melville Milne-Thomson",
    "Milne-Thomson",
    "Henry Briggs",
    "Isaac Barrow",
    "Robert Hooke",
    "THIS LINK",
    "Mathematical Association",
    "William John Greenstreet",
    "E H Neville",
    "Apollonius",
    "E T Bell",
    "A A Fraenkel",
    "David Hilbert",
    "Lars Ahlfors",
    "H T H Piaggio",
    "Louis Goodstein",
    "Goodstein",
    "Edwin Arthur Maxwell",
    "E A Maxwell"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}