{
  "nome_completo": "Jean Paul Albert Badoureau",
  "nome_curto": "Albert Badoureau",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Badoureau/",
  "data_nascimento": "18 May 1853",
  "local_nascimento": "Paris, France",
  "data_morte": "20 July 1923",
  "local_morte": "Paris, France",
  "summary": "Albert Badoureau discovered 37 of the 75 non-prismatic uniform polyhedra in 1878 . These were in addition to the 22 known at the time (5 Platonic solids, 13 Archimedean solids, and 4 Kepler-Poinsot polyhedra ) . He is also famed for his work in geology and for being the mathematical advisor to Jules Verne.",
  "biografia": "Albert Badoureau\n's parents were the teacher Charles Léon Badoureau\n(1824\n-\n1898)\nand Joséphine Célestine Maria Heiller\n(\nborn\n1832\nin Paris\n)\n. Charles Badoureau, born\n16\nJanuary\n1824\nin Paris, was considered an excellent teacher, became the headmaster of the school and, in\n1885\n, received the Légion d'honneur in recognition of his work as school principal. Albert's paternal grandfather, Jean François Badoureau\n(1788\n-\n1881)\n, was also a teacher and headmaster of one of the leading schools in France, the Collège de Saint Jean de Beauvais in Paris. He also received the Légion d'honneur.\nBadoureau attended the Collège Chaptal, an excellent school which gave a five-year course teaching mathematics, physics, natural sciences, French language and literature, modern languages, history, geography, industrial and artistic drawing, religious instruction, music, gymnastics and military exercises. There was a sixth year which prepared students to take the entrance examinations for the Grandes Écoles in mathematics. The article\nTechnical and Scientific Education\nin the\nEdinburgh Review\nof\n1868\nstates:-\nThe boys from this school are almost uniformly successful in obtaining admission to the École Centrale des Arts et Manufactures, and a fair proportion of them pass the unusually difficult entrance examination of the École Polytechnique.\nHe was placed top of the list for entry to the Grandes Écoles and, in October\n1872\n, several newspapers noted his brilliance:-\nThis young man has a strange name - his name is Badoureau, a vaudeville name - but remember that name, and you will hear it repeated later ...\nHe was admitted to the École Normale Supérieure but two weeks later he entered the École Polytechnique on\n1\nNovember\n1872\n, giving his home address as\n16\nRue de la Victoire. His physical description in the records of the École Polytechnique is: Brown hair, High forehead, Medium nose, Grey eyes, Medium mouth, Round chin, Oval face, Height\n187\ncm.\nHe was one year older than\nHenri Poincaré\nwho became a student at the École Polytechnique in\n1873\n. Poincaré wrote a letter on\n17\nNovember\n1873\ndescribing the ceremony which took place when he was admitted at which Badoureau gave a speech of welcome. While he was a student at the École Polytechnique, Badoureau wrote the\n10\n-page paper\nNote sur le Problème des Partis appliqué aux Jeux de Calcul\nⓉ\n(\nNote on the partition problem applied to calculating games\n)\nwhich was published in volume\n27\nof the\nJournal\nof the École Polytechnique in\n1874\n. His introduction to the paper is as follows:-\nTwo players play a mathematical game together; their probabilities of winning depend on their respective abilities. We will assume that these probabilities can, for each of the players, also take all the values from\n0\nto\n1\n, because nothing is known about these probabilities when the two players have never played together.\nSuppose now that the two players have agreed in advance that the first to win N games will take both stakes; let us suppose that they have won respectively m and n games, m and n being less than N: they stop the game, and we ask how they should share the stake. It is clear that the success of the games played gives some information on the relative strength of the players, and it is by comparing this information with the number of games that each player still has to win, to have definitely won, that we will solve the problem posed.\nThis problem generalises the original problem studied by\nPascal\nand\nFermat\nwho had considered the case where the game depended purely on chance. This work by\nPascal\nand\nFermat\nprovided the bases for calculating probabilities, so Badoureau is generalising a very important problem. It is worth noting at this time that the theory of games remained one which fascinated Badoureau and he later published\nÉtude sur les jeux de hasard\nⓉ\n(\nStudy on games of chance\n)\n(1881)\n,\nÉtude sur les jeux de Baccarat\nⓉ\n(\nStudy of Baccarat games\n)\n(1881)\nand\nThéorie du whist\nⓉ\n(\nTheory of whist\n)\n(1885)\n; see\n[\n3\n]\n,\n[\n4\n]\nand\n[\n5\n]\n.\nBadoureau was ranked first in the examinations of\n1873\nout of\n273\nstudents, and first in the examinations of\n1874\nout of\n207\nstudents. He graduated from the École Polytechnique in\n1874\nand, in the same year, entered the École des Mines de Paris. His record shows him as a\n2\nnd class student on\n8\nJuly\n1875\n, a\n1\nst class student on\n31\nJuly\n1876\n, and\n1\nst class in the final examinations of\n3\nApril\n1878\n. He qualified as an engineer on\n11\nApril\n1878\n.\nOn\n25\nNovember\n1878\n, Badoureau presented a memoir to the\nAcadémie des Sciences\nentitled\nMémoire sur les figures isoscèles\nⓉ\n(\nMemoir on isosceles figures\n)\n. The author's extract was published in\nComptes Rendu de l'Académie des Sciences\n87\n(1878)\n,\n823\n-\n825\n, and the full version was published in the\nJournal\nof the École Polytechnique\n[\n1\n]\n. He describes himself on the paper as a mining engineer and begins his introduction as follows:-\nThe purpose of this Memoir, presented to the\nAcademy of Sciences\non\n25\nNovember\n1878\n, is to make known the result of geometrical research to which I was led by the study of the work of Bravais on symmetry and crystallography, and to Élie de Beaumont on the pentagonal grid. Some of the results which are exposed here had been previously obtained, without my knowledge, in\n1808\n, by Lidonne; in\n1819\n, by an anonymous contributor to the Annales de\nGergonne\n, and finally, in\n1862\n, by M\nCatalan\n, in a Memoir presented to the\nAcademy of Sciences\nand inserted in the Journal de l'École Polytechnique. Lidonne had only enumerated, under the name of Archimedean solids, some of the polyhedra studied later by\nGergonne\nand by M\nCatalan\n.\nHe calls the geometrical objects which he investigates 'figures isoscèles', noting that they were called 'polyèdres semi-réguliers' by Babinet and\nCauchy\nin\n1848\n, but today they are called 'uniform polyhedra'.\nCoxeter\n, Longuet-Higgins and Miller write\n[\n8\n]\n:-\nUniform polyhedra have regular faces meeting in the same manner at every vertex. Besides the five Platonic solids, the thirteen Archimedean solids, the four regular star-polyhedra of\nKepler\n(1619)\nand\nPoinsot\n(1810)\n, and the infinite families of prisms and antiprisms, there are at least fifty-three others, forty-one of which were discovered by Badoureau\n(1881)\nand Pitsch\n(1881)\n.\nBadoureau discovered\n37\nof the\n41\nreferred to above.\nWenninger\nwrites in\n[\n23\n]\n:-\nThirty-seven of them are due to Badoureau\n(1881)\nwho systematically considered each of the Platonic and Archimedean solids in turn with a view to finding regular polygons or regular stars on their facial planes or cutting through the interior of these solids.\nThis is a different approach from that of stellation.  If such a polygon is found, it is evident that its vertices coincide with some of the vertices of the related convex polyhedron. The planes of these polygons may intersect.\nIf portions of the solid are removed symmetrically, another uniform polyhedron may result. This process is called faceting, a sort of reverse of stellating. Stellating implies the addition of cells to a basic polyhedron which serves as a core.  Faceting implies the removal of cells, so that the basic polyhedron may still be imagined as a case or enclosing web for the new one.\nAlthough the list was complete when the article\n[\n8\n]\nwas written, it had not been proved that this was the case. In fact it was S P Sopov who showed in\n1970\nthat the list was complete and, five years later, John Skilling gave a new proof of completeness using a computer.\nThis remarkable work by Badoureau certainly merits his inclusion in this Archive, but as we shall relate below, he is also famous for his collaboration with Jules Verne. Let us continue to describe his career.\nIn\n1883\nBadoureau was assigned to Amiens in his role as a mining engineer. He continued to take an interest in mathematics and science, as a hobby rather than as part of his duties as an engineer. His interests were broad and he published on communication routes in cities in\nEssai sur le tracé rationnel des voies de communication dans les villes\nⓉ\n(\nEssay on the rational layout of communication routes in towns\n)\n(1882)\n, on the composition of the atmosphere in\nLa constitution des régions supérieurs de l'atmosphère\nⓉ\n(\nThe constitution of the upper regions of the atmosphere\n)\n(1884)\nbut he did, however, give talks and publish papers on mining such as his talk given to the Société Industrielle d'Amiens on\n27\nMarch\n1885\nentitled\nLe Charbon de terre: sa formation, son extraction, ses usages\nⓉ\n(\nCoal: its formation, its extraction, its uses\n)\nwhich was published in the same year.\nIn\n1889\nBadoureau published\nLes Sciences Expérimentales en\n1889\nⓉ\n(\nExperimental sciences in\n1889\n)\n. He states in the Preface:-\nIf there is an undisputed fact today, it is the absolute necessity for all industrialists to know the experimental sciences on which their work is based.\nThe 'La Bibliothèque des sciences et de l'industrie' was therefore to begin with an overview of the present state of experimental sciences. It is this account that we set out to write. Its publication will have the advantage of freeing the other volumes of the 'La Bibliothèque des sciences et de l'industrie' from some technical developments, which might have seemed a little difficult to some readers.\nThis work will first include an account of the properties of matter in the different states in which it occurs, an overview of experimental sciences and their most recent progress, and, finally, a very rapid review of the various industries and the very varied aid that they receive from science and return to it in their turn.\nSuch a synthesis of science and industry would require, to be successful, forces much superior to ours, and in the performance of this work we have often been nearly stopped by discouragement. If, in spite of our efforts, we do not succeed well, we will ask for the reader's indulgence, even because of the goodwill we show in tackling such a vast subject.\nMoreover, we have already dealt briefly with the same questions in a speech which we delivered at the Académie d'Amiens on\n11\nMarch\n1887\n, on the various objects of human intellectual activity\n(\nsciences, letters, arts, religion\n)\n, and in a glimpse at the sciences that we gave in a conference given on\n25\nApril\n1888\n, to the Société industrielle d'Amiens.\nWe will endeavour to traverse the vast field of science, as a volunteer whose mission it is to point out the positions conquered and the points on which researchers must concentrate their efforts.\nNo experiment will be cited, nor any complicated mathematical demonstration, and we will confine ourselves to stating certain facts or probable hypotheses, accompanying this exposition with a few mathematical formulas, which the readers will be able to pass without much inconvenience, if they deem it appropriate.\nIn the Introduction he tries to encourage a reader who does not have much mathematical knowledge to read the book, missing out the technical mathematics:-\nWe will even find in our book the sign of summation\n∑\n\\sum\n∑\n, the sign of differentiation\nd\nd\nd\nand the sign of integration\n∫\n\\int\n∫\n, and we apologise in advance for the obligation in which we find ourselves to introduce in a popularisation book like this one, symbols which do not yet have the right of citizenship in everyday language. We urge the readers to whom these signs would be frightening to be good enough not to reject far from them the volume which we put in their hands, but on the contrary to read it until the end while passing over the calculations, and while believing us then on the words. The word \"infinitely small\" is sometimes used in a mathematically inaccurate sense, to designate a quantity which is negligible alongside another quantity.\nIt was at the meetings of the Académie d'Amiens and the Société industrielle d'Amiens that Badoureau met Jules Verne. This resulted in Verne's book\nSans dessus dessous\nⓉ\n(\nTopsy-turvy\n)\n(1889)\nbeing based on the scientific information supplied by Badoureau. The story involves firing a gigantic cannon to change the axis of rotation of the earth. Badoureau and Verne corresponded about the mathematical details, discussing the size of the cannon, the use of multiple cannons, the force required of the explosive to create the necessary velocity of the cannonball etc. In Verne's story, the mathematician J-T Maston, is distracted and confuses metres and kilometres in the value of the earth's radius with predictable results! We cannot help thinking how Verne anticipated how the Americans lost the Mars Climate Orbiter in September\n1999\n(\nat a loss of $\n125\nmillion\n)\nbecause the Jet Propulsion Laboratory used metric units and Lockheed Martin Astronautics, who designed and built the spacecraft, used Imperial units. Returning to\nSans dessus dessous\nⓉ\n(\nTopsy-turvy\n)\nwe note that one of the main characters, Alcide Pierdeux, is a slightly fictionalised version of Badoureau himself. Badoureau seemed quite happy with this for often when writing to Verne he signed his letters \"Alcide Pierdeux.\"\nThe first edition of\nSans dessus dessous\nⓉ\n(\nTopsy-turvy\n)\ncontains an additional chapter as an appendix which contains the calculations Badoureau made. The chapter begins:-\nThe novel that we have just presented to the public rests, like all our previous works, on the most serious foundations, despite its ultra-fantastic appearances. After having designed the broad outlines, we asked our friend, M Badoureau, Mining Engineer, author of the learned exposition of 'Experimental Sciences', which has just appeared in the Quantin bookstore, the exact measurement of the various phenomena described in this novel. ...\nThis chapter was omitted from later editions, however, so few were able to read it. In\n2005\n, however, Badoureau's notes and observations that he sent to Verne were published in\n[\n19\n]\n. This mathematical work was more profitable than most, for Badoureau was paid\n2\n,\n500\nF for his contributions!\nOn\n26\nJuly\n1890\n, Badoureau made an ascent in a balloon from the city of Amiens. He wrote an account of the experience which was published on\n9\nAugust in the\nJournal d'Amiens\nin the form of a letter to Jules Verne signed Pierdeux. In this letter he makes some scientific observations, so the experience was not simply enjoyment although enjoy it he certainly did:-\nWere it not for the price of a climb, I would happily do it again every now and then, with or even without a conductor.\nOne reason for the high price was that Badoureau weighed\n106\nkilograms!\nIn the summer of\n1892\nhe made a two-month trip to Scandinavia which was, like the balloon trip, partly enjoyment and partly scientific. The science here involved a geological study. He gave a lecture to the Académie d'Amiens on\n26\nJanuary\n1894\n. You can read the introduction to his lecture at\nTHIS LINK\n.\nAfter the Introduction, he read the paper he had submitted to the Paris\nAcademy of Sciences\non\n27\nNovember\n1893\non the causes of the Scandinavian uplift. His conclusions are that the uplift is caused by the melting of the ice sheet which compressed it during the Ice Age and, the weight of ice being removed, the land rises.\nAfter he had delivered his lecture, the Secretary of the Academy spoke of the\n[\n11\n]\n:-\n... transforming power of beautiful nature! Scandinavia has changed how our learned colleague appears changed to us, it has filled his soul with poetry. - Now we are not used to seeing M Badoureau as a lyric. - You should have heard him speak to us with a new accent of the magnificent countries he visited.\nNot long after he returned from his Scandinavian trip, Badoureau received the Légion d'honneur presented to him by his own father. He married Adrienne Hélène Marguerite Elloy on\n27\nDecember\n1892\nin Le Crotoy. Twenty year old Marguerite was born on\n2\nApril\n1872\nto Gérard Emile Elloy and Anais Eloïse Guffroy. Marguerite and Albert Badoureau had a son, Yves Olaf René Emile Badoureau, born on\n25\nDecember\n1893\n. Interestingly, the name Olaf must have been the result of his father's Scandinavian trip. He studied at the École Polytechnique but was killed in action at the beginning of World War I when only\n20\nyears old. He was a second lieutenant in the Artillery but on\n26\nSeptember\n1914\n, carrying out orders which required him to be visible to the opposing forces a short distance away, he was shot and seriously wounded. He died from his wounds on\n22\nOctober\n1914\n. Like his father, grandfather and great-grandfather, Yves received the Légion d'honneur, but in his case it was posthumous.\nIn the year\n1892\n, Badoureau published a book about mining, namely\nLes Mines, les minières et les carrières\nⓉ\n(\nMines, miners and quarries\n)\n. His last book was\nCauseries philosophiques\nⓉ\n(\nPhilosophical talks\n)\n(1920)\n. In the Preface, he gives an overview of his previous work:-\nWe apologise first for this title which is a little too pretentious: these informal talks are only modest chatter, and, as a philosopher, we are only an old apprentice.\nPhilosophy sums up and crowns all human knowledge. Before we try to do it, we need to introduce ourselves to the reader. During our long career, we have published in particular: four Notes in the Proceedings of the\nAcademy of Sciences\n; in\n1878\non isosceles figures; in\n1884\non the upper light clouds of the atmosphere; in\n1890\non sedimentation; in\n1893\non the proofs and causes of the Scandinavian uplift; an article in the 'Revue Scientifique' in\n1890\non geometric space and algebraic spaces; a speech at the Amiens Academy the same year under a Greek title; and an article in the 'Revue Scientifique' in\n1891\non electricity and matter ... In\n1889\n,\n1892\n,\n1898\n, we published three editions of a volume on experimental science. In\n1889\n,\n1892\n, and even\n1898\n, we were young and a little too inclined to take our assumptions for granted. In\n1900\n, we had the pleasure of seeing some of them confirmed by the Congress of Physics. In\n1905\n, we published two articles in the 'Revue Scientifique' under the title: \"What is Mechanics?\". In\n1911\n, we published a booklet on the atmosphere, terrestrial and air traffic, where we exposed the history of the conquest of the air ...\nThe style suggests that Badoureau collected notes he had made over several years but, perhaps due to deteriorating health, did not combine them smoothly into a well-constructed text. Unlike 'Experimental Sciences', this work was not well received by the critics who considered it confused.\nWe have mentioned above Badoureau's theoretical work on probability and card games; he published papers on baccarat, whist and piquet. He was, however, not simply interested in the theory, for he was also somewhat addicted to playing these games. Theoretical skills did not help him in practice and he lost heavily which may explain his strong words\n[\n3\n]\n:-\nGambling is a major cause of loss of activity and time; it absolutely distorts ideas on the value of money and on the fair remuneration of labour and capital; it almost inevitably leads to extravagance and disorder. How many husbands seek hidden income in the game that allows them to meet hidden expenses! ... Gambling is very often the road to debauchery, dishonour and suicide; it is a social disease capable of destroying the habits of order, work and economy which make up France's fortune.\nSimilar strong statements are in his article\n[\n4\n]\nlook like coming from personal experience:-\nIn summary, baccarat is the most dangerous of all games, and the expansion it has had over the past few years, particularly in the casinos of thermal or maritime resorts, must be regarded as a public misfortune; the gambling halls of these establishments are real gambling dens open to all comers and the government would be doing essential moral work by closing them absolutely.\nIn\n1894\nBadoureau left Amiens and spent his last years in Paris.",
  "matematicos_citados_na_biografia": [
    "Henri Poincaré",
    "Pascal",
    "Fermat",
    "Académie des Sciences",
    "Academy of Sciences",
    "Gergonne",
    "Catalan",
    "Cauchy",
    "Coxeter",
    "Kepler",
    "Poinsot",
    "Wenninger",
    "THIS LINK"
  ],
  "imagens": [
    "badoureau.jpg"
  ]
}