{
  "nome_completo": "Albert of Saxony",
  "nome_curto": "Albert of Saxony",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Albert/",
  "data_nascimento": "1316",
  "local_nascimento": "Rickensdorf, Helmstedt, Lower Saxony (now Germany)",
  "data_morte": "8 July 1390",
  "local_morte": "Halberstadt, Saxony (now Germany)",
  "summary": "Albert of Saxony was a German mathematician who acted mainly as a transmitter of the mathematics of others.",
  "biografia": "Albert of Saxony\nis known under several different names. Others versions include\nAlbert of Helmstedt\n,\nAlbert of Rickmersdorf\nand the nickname\nAlbertucius\n, meaning 'little Albert', to distinguish him from Albert the Great. The first definite date that we know is Albert's degree of Master of Arts from the University of Paris in March\n1351\n. This still leaves a fairly wide range of possible dates for his birth, with most scholars arguing that he must have been born between\n1316\nand\n1320\n. It is fairly certain that Albert grew up in the Helmstedt district and, before studying in Paris, he visited a number of other places. It is believed that he visited Erfurt and perhaps Halberstadt and Magdeburg. He taught at Paris from\n1351\nto\n1362\nbecoming rector there for a term of six months beginning in June\n1353\n.\nThe rector of the University of Paris was head the teaching; it was an elected position of short duration. The University at this time was divided into four Nations: the French Nation was for students from a region including France\n(\nexcept the North\n)\n, Spain and Italy; the English Nation covered England, Scotland and Germany; the Norman Nation covered a small Norman region in the North of France; and the Piccardian Nation covered a region to the east of the Norman one. Despite being called the English Nation at this time, most of the students in this Nation were from Scotland or Germany\n(\nin fact its name was later changed to the German Nation\n)\n. Albert, being born in Lower Saxony, was in the English Nation: in fact he represented the English Nation on a number of occasions between\n1352\nand\n1362\n. In\n1358\nhe led the English Nation in negotiating with the Piccardian Nation the concerning the position of the border between the two Nations.\nDuring the ten years,\n1352\n-\n62\n, that Albert spent teaching in Paris he lectured on\nAristotle\n's\nPhysics\nand other works on natural philosophy. He was influenced by his famous colleague Jean Buridan\n(\nabout\n1300\n- after\n1358)\n. Buridan taught natural philosophy and logic at the University of Paris during the first half of Albert's time there.  Albert seems to have studied theology during these years, taking courses at the Sorbonne, but never took a degree in the subject. He left Paris in November\n1362\nbeing named prebend of the cathedral in Mainz. This position gave Albert an income from the cathedral estates. While visiting Avignon in July\n1363\nhe met with Rudolf IV, Duke of Austria, and seems to have taken on a diplomatic role with the Duke as an ambassador. He was with the Duke on a visit to Prague in April and May of\n1364\nand in September of the same year, he went back to Avignon as Austrian ambassador to try to persuade Pope Urban V to agree to the founding of the University of Vienna. He was only partially successful in his mission for, although Pope Urban V agreed to the founding of the University, he did not agree to the founding of a Theology Faculty since this would have provided competition with the Charles University of Prague which had been founded in\n1347\n. However, Albert did secure a papal bull to establish the faculties of Arts, Law and Medicine.\nThe University of Vienna was founded by Rudolf IV and his two brothers on\n12\nMarch\n1365\nbut Rudolf died a few months later in July. Albert was left to organise the setting up of the University which he did, modelling the Arts Faculty on the Paris model. He set up, like Paris, four Nations: Austria, Bohemia, Saxony and Hungary. He became the first rector of the University having won certain privileges for the staff and students such as exemption from taxes and military service. The University had its own dress code and its members were subject to University laws, rather than those of the state, which were carried out by the rector. Albert did not hold this position for very long for, on\n21\nOctober\n1366\n, he was appointed Bishop of Halberstadt, taking up this appointment in February of the following year. By the time he left Vienna, the Arts Faculty of the University was the only Faculty which had been set up.\nPerhaps one might think that an appointment as Bishop of Halberstadt would mean that from then on his life was directed towards spiritual matters but, rather the contrary, it now became directed towards politics. In\n1367\nAlbert joined Magnus the Duke of Brunswick-Lüneburg, Dietrich the Archbishop of Magdeburg, Valdemar the Prince of Anhalt, and others in a campaign against Gerhard of Berg the Bishop of Hildesheim. They were defeated in a battle at Dinklar, near Hildesheim, on\n3\nSeptember\n1367\n. After this unsuccessful military venture, Albert worked hard to form regional peace alliances. Pope Urban V died in\n1370\nand was succeeded by Pope Gregory XI, the last of the Avignon popes. Pope Gregory XI took vigorous measures against heresies, particularly in Germany, and he contacted the German Inquisitors in\n1372\nasking that they investigate a charge of determinism\n(\na belief that man has no free will and therefore is not responsible for his actions\n)\nwhich had been made against Albert. No charges were brought against Albert, however, who remained as Bishop of Halberstadt until his death in\n1390\n.\nThe reader of this biography might well be wondering by now why Albert is included in this archive for, except for mentioning that he taught natural philosophy while in Paris, we have not mentioned any other mathematical expertise. In fact Albert was mainly a transmitter of good mathematical ideas but he did contribute a great deal of his own to these. He wrote about the ideas of\nBradwardine\n,\nOckham\n,\nOresme\nand others. In all he published around\n30\ntexts, mostly produced during his years teaching in Paris, many of these being commentaries on the works of\nAristotle\n. The authors of\n[\n5\n]\nwrite:-\n... Albert was quite an independent thinker who sometimes combined the theories of his predecessors\n(\nespecially those of Buridan,\nOresme\n, and the English and Parisian masters\n)\nor chose to present problems in a didactic manner.\nHis books on logic are his best, particularly when he examined logical paradoxes. His three main works in this area are\nQuestiones logicales\nⓉ\n(\nInquiries into logic\n)\n,\nPerutilis Logica\nⓉ\n(\nUseful logic\n)\nand\nSophismta\nⓉ\n(\nSophistry\n)\n. The\nPerutilis Logica\nⓉ\n(\nInquiries into logic\n)\nis a logic handbook consisting of six parts: Propositions; Properties of Terms; Type of Propositions; Consequences and Syllogisms; Fallacies; and Insolubles and Obligations. Although the work shows influences from\nOckham\nand Buridan but one must always stress that Albert was an original thinker and in many places proposes ideas which are quite different from those of either of these two scholars. Let us give one example of his contributions to paradoxes. Jean Buridan had produced a logical fallacy by producing a folio on which the only words written were \"All statements on this folio are false.\" Many argued that the paradox was the result of self-reference but Albert showed that this was not the case. He gave the following example where there was no self-reference: \"The following sentence is true. The previous sentence is false.\" He also states that this can easily be extended to any number of sentences.\nHis work on natural philosophy is mostly contained in his commentaries on\nAristotle\n's\nPhysica\n, on his\nDe Caelo\n, on his\nDe generatione\n, on his\nDe Anima\n, on his\nMeteora\n, on his\nParva Naturalia\n, and on Sacrobosco's\nDe Sphaera\n. Albert also wrote a work of his own, the\nTractatus proportionum\n. His work on projectiles is, as all work was at that time, incorrect. Albert believed that a projectile fired horizontally will travel horizontally for a certain distance, then follow a curved path for a while, then fall vertically. During the first of these three phases the body moved by its own impetus, during the second phase gravity began to take effect, and in the final stage gravity only acted since impetus had died. This may be quite false but at least it approximates the path of a projectile more closely than do earlier theories. He was fond of making thought experiments. For example, he considered what would happen if a hole could be made though the Earth and a stone dropped down it. He concluded that the stone would pass the centre of the Earth then fall back towards the centre, continuing to oscillate about the centre in decreasing oscillations until the impetus in the stone was exhausted. While looking at his theory of projectiles, it is interesting to note that he also claimed that air could support a reasonably constructed machine in the same way as water can support a ship. Although not advocating that the Earth moved round the sun, he did at least show that the arguments that he been put forward to prove that the Earth must be stationary were fallacious. Certainly Albert believed that much could be explained by mathematics and he used his dynamical theory to attempt to explain natural phenomena such as earthquakes, tides and geology.\nPierre Duhem\nwrites\n[\n9\n]\n:-\nThe equilibrium of the earth and seas is the subject of a favourite theory of Albert's. The entire terrestrial element is in equilibrium when its centre of gravity coincides with the centre of the world. Moreover, the terrestrial mass has not everywhere the same density, so that its centre of gravity does not coincide with the centre of its figure. Thus the lightest part of the earth is more distant from the centre of gravity of the earth than the heaviest part. The erosion produced by rivers constantly draws terrestrial particles from the continents to the bosom of the sea. This erosion, which, by scooping out the valleys, has shaped the mountains, constantly displaces the centre of gravity of the terrestrial mass, and this mass is in motion to bring back the centre of gravity of the earth to the centre of its figure. Through this motion the submerged portions of the earth constantly push upwards the emerged parts, which are incessantly being eaten away and afterwards replaced by the submerged parts. At the beginning of the sixteenth century this theory of Albert's strongly attracted the attention of\nLeonardo da Vinci\n, and it was to confirm it that he devoted himself to numerous observations of fossils. Albert of Saxony, moreover, ascribed the\nprecession of the equinoxes\nto the similar very slow movement of the terrestrial element.\nAlbert's work on physics led him to a quite sophisticated idea of a mathematical limit. This occurs when he considered the question, which had worried scholars for centuries, of whether there is a maximum weight that Socrates can carry. He argued that for any weight less than this maximum weight, there must be a greater weight that Socrates could also carry.\nFinally let us note that he also wrote works on moral philosophy such as commentaries on\nAristotle\n's\nNicomachean Ethics\nand on his\nOeconomica\n.\nAlbert's influence on later scholars is described by Joél Biard\n[\n6\n]\n:-\nAlbert of Saxony's teachings on logic and metaphysics were extremely influential. Although Buridan remained the predominant figure in logic, Albert's 'Perutilis logica' was destined to serve as a popular text because of its systematic nature and also because it takes up and develops essential aspects of the Ockhamist position. But it was his commentary on\nAristotle\n's 'Physics' that was especially widely read. Many manuscripts of it can be found in France and Italy, in Erfurt and Prague. Thanks to Albert of Saxony, many new ideas raised in Parisian physics and cosmology in the later Middle Ages became widespread in Central Europe.",
  "matematicos_citados_na_biografia": [
    "Aristotle",
    "Bradwardine",
    "Ockham",
    "Oresme",
    "Pierre Duhem",
    "Leonardo da Vinci",
    "precession of the equinoxes"
  ],
  "imagens": [
    "albert.jpg"
  ]
}