{
  "nome_completo": "Albert Girard",
  "nome_curto": "Albert Girard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Girard_Albert/",
  "data_nascimento": "1595",
  "local_nascimento": "St Mihiel, France",
  "data_morte": "8 December 1632",
  "local_morte": "Leiden, Netherlands",
  "summary": "Albert Girard was a French mathematician and musician. His work on trigonometry is the first to use the abbreviations sin, cos, tan.",
  "biografia": "Albert Girard\nwas French but, being a member of the Reformed church, went as a religious refugee to the Netherlands. We do not know when he made this move, but we do know he was sad throughout his live that he was forced to live outside his native land. He attended the University of Leiden, where he studied mathematics, entering the University at the age of\n22\n. In fact his first interest was music and he played the lute professionally.\nJacob Golius\nwas about the same age as Girard but began studying mathematics at the University of Leiden some years earlier. Certainly by\n1616\nthe two were engaging in mathematical discussions and there is surviving correspondence from that time in which they are discussing scientific matters.\nGolius\nspent several years in Morocco and on tours of Syria and Arabic lands. He was appointed professor of mathematics at Leiden in\n1629\n(\nin addition to his Arabic professorship of\n1625)\n. When Constantijn Huygens\n(\nChristiaan Huygens\n' father\n)\nwrote a congratulatory note to\nGolius\non his mathematics appointment, he praised the work of Girard, particularly on refraction, which certainly suggests that the two had continued to exchange ideas. We know however that by the time Huygens wrote this letter, Girard was serving as an engineer in the army of the Prince of Orange, Frederick Henry of Nassau.\nGirard worked on algebra, trigonometry and arithmetic. He made a major contribution to mathematics by publishing various works by\nSimon Stevin\n. In\n1625\nhe prepared a revised edition of\nStevin\n's\nArithmétique\nⓉ\n(\nArithmetic\n)\nbut he also added to it translations from the Greek of Books\n5\nand\n6\nof\nDiophantus\n's\nArithmetica\nⓉ\n(\nArithmetic\n)\nas well as\nStevin\n's\nAppendice\nⓉ\n(\nAppendix\n)\n.\nStevin\nhad produced tables of sines, tangents and secants which were greatly improved by Girard who published his version in\n1626\n. In this work\nTrigonométrie\nⓉ\n(\nTrigonometry\n)\non trigonometry he made the first use of the abbreviations sin, cos, tan. He also gave formulas for the area of a spherical triangle. In algebra he had some early thoughts on the\nfundamental theorem of algebra\nwhich he stated in\nInvention Nouvelle en l'Algèbre\nⓉ\n(\nNew Inventions in Algebra\n)\n(1629)\n. Gray Funkhouser writes\n[\n7\n]\n:-\nThe first man who really has a place in the history of symmetric functions of roots of equations, a man who for clearness and grasp of material at hand in not only this topic but also in other phases of algebra could well hold his place a century later was Albert Girard ... his work on algebra is a little\n34\n-leaf pamphlet called 'Invention Nouvelle en l'Algèbre'\nⓉ\n(\nNew Inventions in Algebra\n)\n, published in\n1629\n. Girard gives the triangle later known as\nPascal's triangle\nand uses it as the basis for developing a theorem on symmetric functions, although he has no idea of them as such.\nGirard calls\nPascal\n's triangle the \"triangle of extraction\". He calls the sum of a group of numbers the \"first fraction\", the sum of the products of pairs of the numbers the \"second fraction\", etc. He then gives a theorem: If a group of numbers is given, the multitude of the products of each fraction can be expressed by the same row in the triangle of extraction as the multitude of numbers.\nHe gives an example of the equation\n(\nwhich we write in modern notation\n)\nx\n4\n=\n4\nx\n3\n+\n7\nx\n2\n−\n34\nx\n+\n24.\nx^{4} = 4x^{3} + 7x^{2} - 34x + 24.\nx\n4\n=\n4\nx\n3\n+\n7\nx\n2\n−\n3\n4\nx\n+\n2\n4\n.\nSince the highest power of the unknown is\n4\n, Girard states clearly that there are four roots \"neither more nor less\". He takes the even powers to the left, the odd powers to the right giving\nx\n4\n−\n7\nx\n2\n−\n24\n=\n4\nx\n3\n−\n34\nx\n.\nx^{4} - 7x^{2} - 24 = 4x^{3} - 34x.\nx\n4\n−\n7\nx\n2\n−\n2\n4\n=\n4\nx\n3\n−\n3\n4\nx\n.\nHe then says that the coefficients, with their proper signs, are\n4\n, -\n7\n, -\n34\n, -\n24\n. Then\n4\nis the first fraction, namely the sum of the roots, -\n7\nis the second fraction, namely the sum of all products of pairs of roots, -\n34\nis the third fraction, namely the sum of all products of three roots, -\n24\nis the fourth fraction, namely the product of the four roots. Following this he gives another example, namely\nx\n4\n−\n4\nx\n+\n3\n=\n0\nx^{4} - 4x + 3 = 0\nx\n4\n−\n4\nx\n+\n3\n=\n0\nwhich has two imaginary roots, and shows that the method still gives the right answer in this case.\nHe then looks at the sum of the roots, the sum of the squares of the roots, the sum of the cubes of the roots, etc. He writes:-\nIf the coefficients of the second, third, fourth terms etc. are\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\n, etc. then in an equation of any degree\nA\nA\nA\nwill be the sum of the roots;\nA\n2\n−\n2\nB\nA^{2} - 2B\nA\n2\n−\n2\nB\nwill be the sum of the squares of the roots;\nA\n3\n−\n3\nA\nB\n+\n3\nC\nA^{3} -3AB + 3C\nA\n3\n−\n3\nA\nB\n+\n3\nC\nwill be the sum of the cubes of the roots;\nA\n4\n−\n4\nA\n2\nB\n+\n4\nA\nC\n+\n2\nB\n2\n−\n4\nD\nA^{4} -4A^{2}B + 4AC + 2B^{2} -4D\nA\n4\n−\n4\nA\n2\nB\n+\n4\nA\nC\n+\n2\nB\n2\n−\n4\nD\nwill be the sum of the fourth powers of the roots.\nCharles Hutton\ngives a detailed account of the contents of\nInvention Nouvelle en l'Algèbre\nⓉ\n(\nNew Inventions in Algebra\n)\nin\n[\n8\n]\n. He explains that of the\n63\npages in the book,\n49\nare on arithmetic and algebra:-\n... and the rest on the measure of the superficies of spherical triangles and polygons, by him then lately discovered.\nAfter giving a detailed account of the\n49\npages on arithmetic and algebra,\nHutton\ngives this summary:-\nHe was the first person who understood the general doctrine of the formation of the coefficients of the powers, from the sums of their roots, and their products, etc\n.\nHe was the first who understood the use of negative roots in the solution of geometrical problems\n.\nHe was the first who spoke of the imaginary roots, and understood that every equation might have as many roots real and imaginary, and no more, as there are units in the index of the highest power. And he was the first who gave the whimsical name of quantities less than nothing to the negative\n.\nHe was the first who discovered the rules for summing the powers of the roots of any equation\n.\nWe should also mention his iterative approach to solving equations\n[\n1\n]\n:-\nWith the aid of trigonometric tables Girard solved equations of the third degree having three real roots. For those having only one root he indicated, beside\nCardano\n's rules, an elegant method of numerical solution by means of trigonometric tables and iteration.\nHe was the first to give a geometric interpretation of negative quantities, writing:-\nThe negative solution is explained in geometry by moving backward, and the minus sign moves back when the + advances.\nLike many mathematicians of his day Albert Girard was interested in military applications of mathematics and in particular studied fortifications. He translated several works on fortifications some from French to Flemish such as Samuel Marolois's\nFortification ou architecture militaire\nⓉ\n(\nFortification or military architecture\n)\nto which he also added material and revised the text. He did the same for the two-volume treatise\nGéométrie contenant la théorie et practique d'icelle. necessaire à la Fortification\nⓉ\n(\nGeometry: containing the theory and practice of it necessary for fortification\n)\n. Other works he translated from Flemish to French such as\nOeuvres de Henry Hondius\nⓉ\n(\nWorks of Henry Hondius\n)\n(1625)\n.\nIt appears that Girard spent some time as an engineer in the Dutch army although this was probably after he published his work on trigonometry.\nPierre Gassendi\n, writing on\n21\nJuly\n1629\nto his friend Nicholas de Peiresc, talks about Girard and refers to his position in the Dutch army\n[\n1\n]\n:-\n[\nI dined at the camp before Boisle-Roi with\n]\nAlbert Girard, an engineer now at the camp.\nOn his death he was described as an engineer rather than as a mathematician although, throughout his life, he himself always described himself as a mathematician. In the works of Stevin which he edited\n(\npublished after his death\n)\n, Girard says he is unhappy living in a foreign country with nobody to provide him with financial support to help him bring up his large family\n[\n1\n]\n:-\nHis widow, in the dedication of this work, is more precise. She is poor, with eleven orphans to whom their father has left only his reputation of having faithfully served and having spent all his time on research on the most noble secrets of mathematics.\nGirard worked on producing\nLes Oeuvres mathématiques de Simon Stevin augmentées par Albert Girard\nⓉ\n(\nThe Mathematical Works of Simon Stevin augmented by Albert Girard\n)\nbut died in\n1632\nbefore the work was published; this happened in\n1634\n. The dedication, signed by\nStevin\n's widow and children, contains the passage we quoted above. George Sarton writes\n[\n12\n]\n:-\nGirard was himself a great mathematician, and he added many observations of his own to the Stevinian text: these observations can be easily distinguished from the rest. Some works were translated by Tuning or Stevin, others were translated by himself and abbreviated; his own additions are always specifically mentioned as such. Hence the 'Oeuvres' can be used to study\nStevin\n's own thought, but one must be careful not to ascribe Girard's unmistakable interpolations to\nStevin\n.\nSarton notes that Girard wrote a \"strange commentary\" on\nStevin\n's ideas on the \"age of wisdom\". In particular, Sarton writes:-\nGirard's attack on the French language in a French book is certainly curious.\nGirard is also famed for being the first to formulate the\n(\nnow well-known\n)\ninductive definition\nf\nn\n+\n2\n=\nf\nn\n+\n1\n+\nf\nn\nf_{n+2} = f_{n+1} + f_{n}\nf\nn\n+\n2\n​\n=\nf\nn\n+\n1\n​\n+\nf\nn\n​\nfor the\nFibonacci sequence\n, and stating that the ratios of terms of the\nFibonacci\nsequence tend to the golden ratio, which appear in this\n1634\npublication.\nRobert Simson\nwrites in\n1753\n[\n13\n]\n:-\nThe first thing Albert Girard gives ... is a method of expressing the ratio of the segments of a line cut in extreme and mean proportion, by\nrational\nnumbers, that converge to the true ratio. For this purpose he takes the progression\n0\n,\n1\n,\n1\n,\n2\n,\n3\n,\n5\n,\n8\n,\n13\n,\n21\n, etc. every term of which is equal to the sum of the two terms that precede it: and says, any number in this progression has unto the following the same ratio\n[\nnearly\n]\nthat any other has to that, which follows it. Thus\n5\nhas to\n8\nnearly the same ratio, that\n8\nhas to\n13\n; consequently, any\n3\nnumbers next to one another as\n8\n,\n13\n,\n21\n, nearly express the segments of a line cut in extreme and mean proportion, and the whole line; so that\n13\n,\n21\n,\n34\nconstitute near enough an isosceles triangle, having the angle of a pentagon ... The second thing which Albert Girard mentions, is a way of exhibiting a series of rational fractions, that converge to the square root of any number proposed, and that very fast. He tells us nothing about the way of forming it, and gives the following two examples; namely he says that √\n2\nis equal nearly to\n577\n408\n\\Large\\frac{577}{408}\\normalsize\n4\n0\n8\n5\n7\n7\n​\n: or, if you would have it nearer,\n1393\n985\n\\Large\\frac{1393}{985}\\normalsize\n9\n8\n5\n1\n3\n9\n3\n​\n. His other example is of √\n10\n, which, he says, is nearly equal to\n1039681\n328776\n\\Large\\frac{1039681}{328776}\\normalsize\n3\n2\n8\n7\n7\n6\n1\n0\n3\n9\n6\n8\n1\n​\n. And these are ... at first sight, continued fractions of the same value.\nGirard cannot be credited with the invention of\ncontinued fractions\nas a result of his brilliant observations but again his genius shines through. In fact one is left with a little sadness that Girard's name is not today well-known yet one feels that things could have been different if he had taken the time to fully explain the things he obviously understood and also taken some time to push a little further some of his amazing insights. Jean Itard writes\n[\n1\n]\n:-\n[\nGirard was\n]\nalways pressed for time and generally lacking space, he was very stingy with words and still more so with demonstrations; thus, he very often suggested more than he demonstrated.",
  "matematicos_citados_na_biografia": [
    "Jacob Golius",
    "Golius",
    "Christiaan Huygens",
    "Simon Stevin",
    "Stevin",
    "Diophantus",
    "fundamental theorem of algebra",
    "Pascal's triangle",
    "Pascal",
    "Charles Hutton",
    "Hutton",
    "Cardano",
    "Pierre Gassendi",
    "Fibonacci sequence",
    "Fibonacci",
    "Robert Simson",
    "rational",
    "continued fractions"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}