{
  "nome_completo": "Albrecht Fröhlich",
  "nome_curto": "Albrecht Fröhlich",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frohlich/",
  "data_nascimento": "22 May 1916",
  "local_nascimento": "Munich, Germany",
  "data_morte": "8 November 2001",
  "local_morte": "Cambridge, England",
  "summary": "Albrecht Fröhlich was a German mathematician who made important contributions to group theory.",
  "biografia": "Albrecht Fröhlich\nwas known as Ali to his friends. His parents were Frida and Julius Fröhlich. The family were Jewish, and Albrecht was the youngest of three children. His sister Betti was born in\n1904\nand his brother Herbert was born one year later, both in the Black Forest town of Rexingen which was Frida and Julius's home town. Albrecht, therefore, was around eleven years younger than his brother and sister. After attending an elementary school, Albrecht became a pupil at the Wittlesbacher\nGymnasium\nin\n1926\n. Rather surprisingly he did not shine in mathematics at this high school, but rather it was in history and religion that he produced outstanding work. He certainly did well in mathematics and science but he was awarded poor marks for languages such as English and Latin.\nIn\n1933\nAlbrecht left the Gymnasium. His brother Herbert was now\n28\nyears old, had obtained his doctorate at the University of Munich for a thesis on the photoelectric effect in metals supervised by\nSommerfeld\n, and was completing his\nhabilitation\nthesis. Betti was married and living in Palestine. Political events which began in that year, however, would change completely the future course of the lives of the Fröhlich family. On\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. Albrecht joined a group of Jewish students with left wing views who openly opposed the Nazis. Soon he realised that opposition was impossible for his father was beaten up and he was arrested. As soon as he was released he went to the French Consulate and within hours he was safe in Alsace. His parents followed a few days later, joining him in Alsace. By this time Herbert had been appointed as a\nprivatdozent\nat the University of Freiburg, but he was dismissed under the Civil Service Law.\nAfter working in a chocolate factory in Alsace for a year Fröhlich, with his parents, went to Haifa in Palestine, a move which was possible since his sister lived there. He worked at a number of manual jobs to earn money to support himself and his parents. First he worked on roads, then as an electrician on the railways. His brother Herbert, after going to Physico-Technical Institute in Leningrad in\n1934\n, found that the political situation again forced him to escape. He went to England where from\n1935\nhe held an appointment as a lecturer in physics at the University of Bristol. When the war ended, he wrote to his brother in Haifa, suggesting that he come to England and study for a degree at Bristol. Perhaps we should pause for a moment and reflect that Fröhlich, the subject of this biography, was now nearly thirty years old, yet had no university education. At the age by which most mathematicians had produced their most innovative work, he had no formal school qualifications and still was undecided about what subject he should study at university. After first considering taking a degree in engineering, he soon settled on mathematics.\nOf course Herbert had to persuade Bristol to accept his brother, despite his lack of qualifications. Albrecht had to persuade the Palestinian authorities to let him leave, and he had to obtain a visa to go to Britain so this meant that he had to convince some officials that, although he was a railway electrician, he really had been accepted for university study. The difficulties were overcome but it was December\n1945\nbefore he reached Bristol to begin a course which had begun on\n1\nOctober. Despite the late start, Fröhlich made quite remarkable progress and began research working under Hans\nHeilbronn\nin\n1948\n. In fact a few years earlier\nHeilbronn\nhad a very similar experience to Fröhlich's brother, being dismissed under the Civil Service Law while an assistant in Germany. Fröhlich's thesis was in two parts, the first being completed by September\n1949\nand published as the paper\nThe representation of a finite group as a group of automorphisms on a finite Abelian group\n(1950)\n. The purpose behind the research was made clear by\nHirsch\nin a review:-\nInvestigations on the class-groups of self-conjugate\nalgebraic number fields\nhave led the author to consider the problem in what manner a given finite group G of order h can be represented as a group of automorphisms of an Abelian group A of order n. This problem is solved in the present paper under the restriction that\n(\nh, n\n)\n=\n1\n.\nThe second part of his thesis was published in\n1952\nas the paper\nOn the class group of relatively Abelian fields\n. The paper was reviewed by\nHeilbronn\nwho wrote:-\nThe author investigates the class-groups\n(\nin a wider sense\n)\nof abelian fields, using the fact that they form\n(\nwritten additively\n)\na representation module of the\nGalois group\nof a field. The necessary extension of\nrepresentation theory\nwas published by the author in a previous paper\n[\nThe representation of a finite group as a group of automorphisms on a finite Abelian group\n(1950)]\n.\nFröhlich married Ruth Brooks, who was a medical student at Bristol, in\n1950\n. Ruth qualified as a GP and had a career in that profession until she retired in\n1993\n. Before completing his doctoral studies, Fröhlich was appointed as an assistant lecturer at Leicester where he began teaching in\n1952\n. He was promoted to a lecturer in mathematics after one year, but moved to Keele in\n1952\n. His research progressed exceptionally well and he published five papers in\n1954\n:\nOn fields of class two; On the absolute class group of Abelian fields; A note on the class field tower; The generalization of a theorem of L Rédei's\n; and\nA remark on the class number of Abelian fields\n. An extract from a review of the first of these papers explains the concepts being studied:-\nIn the present paper the fields of at most class two over the rational field are studied, the class of a field being defined as the length of the central series of the\nGalois\ngroup. As a group of at most class two is the direct product of prime power groups of at most class two it is sufficient to study fields whose degree is a prime power.\nIn all five of these papers Fröhlich continued to build on the work of this doctoral thesis. His record was now sufficiently outstanding that in\n1955\n, only three years after completing his doctorate,  Fröhlich was appointed as a reader at King's College, London. He was interviewed for the post by a committee consisting of\nDavenport\n,\nMordell\nand\nSemple\n. He spent the rest of his career at King's College, being promoted to a professor in\n1962\nand served as Head of Department from\n1969\n. He retired in\n1981\n.\nBirch and Taylor write in\n[\n1\n]\n:-\n... one of Ali's really major contributions to mathematics was in\n1965\n, when he and\nIan Cassels\njointly organised the instructional conference in Brighton. He and\nCassels\ngave preliminary courses, respectively on local and global\nalgebraic number theory\nand; the main courses, on local class field theory and on global class field theory, were given by\nJ P Serre\nand\nJ Tate\n. ... The whole event was meticulously organised ... Before Brighton, class field theory was a recondite mystery known only to a few\n(\nin Britain, only a very few indeed\n)\n; after Brighton, it was a standard tool of mathematics, available to any professional.\nFröhlich's course was written up as\nLocal fields\nand occupied the first\n41\npages of the Proceedings. McCulloh, reviewing the paper, writes:-\nThis expository article develops the basic properties of\nDedekind\ndomains, in particular, the decomposition of primes, the different, the\ndiscriminant\n, and ramification groups. The method, systematically employed, is reduction to the local and/or complete case. In the process, many facts about complete discrete valuation rings are developed, such as the structure of unramified and tamely ramified extensions. A careful account is given of\nHerbrand\n's description of the change in the sequence of ramification groups when passing from a\nGalois\ngroup to a quotient group. ...\nThe organization is elegant and efficient, the style crisp and condensed. The beginner may be left in the dust. The experienced reader will find it worthwhile and pleasant.\nPerhaps the most remarkable fact from Fröhlich's remarkable career is that his most stunning result was published in\n1972\nwhen he was\n56\nyears old. This paper,\nArtin root numbers and normal integral bases for quaternion fields\n,  is described by the authors of\n[\n1\n]\nas:-\n... undoubtedly the high point of Ali's mathematical life; it related the algebraic\nGalois\nstructure of rings of integers to an analytic invariant in an entirely new and sensational way; it thrust him and his subject to the fore on the world stage; in particular he was invited to present his work at the International Congress of Mathematicians in\n1974\n.\nFurther developments leading on from this paper led to Fröhlich receiving the Senior Berwick Prize from the\nLondon Mathematical Society\nin\n1976\n. In the same year he was elected a Fellow of\nThe Royal Society\n. At the age of\n60\nFröhlich had made the type of breakthrough that most world leading mathematicians make at half this age.\nAfter he retired in\n1981\nFröhlich continued to publish outstanding research, and also some extremely important books. In\n1983\nhe published\nGalois module structure of algebraic integers\nwhich is described by Browkin in a review which begins as follows:-\nThe theory of\nGalois\nmodule structure of rings of algebraic integers has been developed by the author and others during the last twenty years, and the book under review contains a detailed survey of it. Section\n1\nof Chapter I contains a very clearly written history of this theory and an outline of the main problems and results. The rest of the book is more technical and demands from a reader much more effort. In Chapter I the author states most of the main results contained in the book. Their proofs are given in the subsequent chapters, in which the necessary tools for the proofs are also developed.\nThis was not the only book which he published in\n1983\n, for\nCentral extensions, Galois groups, and ideal class groups of number fields\nappeared in the same year, as did\nGauss sums and p-adic division algebras\nwith\nClassgroups and Hermitian modules\nbeing published in the following year. In\n1986\nhe published the book\nTame representations of local Weil groups and of chain groups of local principal orders\nhad his introductory textbook on algebraic number theory,\nAlgebraic number theory\n,  appeared in\n1993\nwritten jointly with M J Taylor.\nAmong the honours Fröhlich received, in addition to those mentioned above, were the\nLondon Mathematical Society\n's\nDe Morgan\nMedal and honorary degrees from Bordeaux and Bristol. He was elected to the\nHeidelberg Academy of Sciences\nin\n1982\nand received the \"Humboldt prize\" of the Humboldt Foundation in\n1992\n.\nWe end this brief look at Albrecht Fröhlich by quoting from\n[\n1\n]\nsome non-mathematical facts:-\nAli had a great capacity for enjoyment; as well as mathematics, things that he enjoyed included his family, music, eating ..., drinking coffee, and walking and talking. ... He was a family man through and through, taking great pride and joy in his children\n(\nand later grandchildren\n)\n... Despite his mathematical eminence, Ali was a very modest man; he was at times the archetypal absent-minded professor, but was always ready to join his family in laughing at himself at himself. despite his sense of fun and of the ridiculous, he was a warm and sensitive person ...",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Sommerfeld",
    "habilitation",
    "privatdozent",
    "Heilbronn",
    "Hirsch",
    "algebraic number fields",
    "Galois group",
    "representation theory",
    "Galois",
    "Davenport",
    "Mordell",
    "Semple",
    "Ian Cassels",
    "Cassels",
    "algebraic number theory",
    "J P Serre",
    "J Tate",
    "Dedekind",
    "discriminant",
    "Herbrand",
    "London Mathematical Society",
    "The Royal Society",
    "De Morgan",
    "Heidelberg Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}