{
  "nome_completo": "Aleksei Ivanovich Kostrikin",
  "nome_curto": "Aleksei Kostrikin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kostrikin/",
  "data_nascimento": "12 February 1929",
  "local_nascimento": "Bolshoi Morets, Yelan district, Volgograd, Russia",
  "data_morte": "22 September 2000",
  "local_morte": "Moscow, Russia",
  "summary": "Alexei Kostrikin was a Russian mathematician who worked in algebra and algebraic geometry.",
  "biografia": "Aleksei Kostrikin\nwas the tenth and youngest child of a peasant family\n[\n4\n]\n:-\nHis outstanding village schoolteachers imparted to him a love of knowledge and, in particular, mathematics.  In\n1947\nKostrikin entered Saratov State University.  Being one of the best students there, he was transferred in\n1951\nto the Department of Mechanics and Mathematics at Moscow State University from which he graduated in\n1952\n.\nAt Moscow State University he began a long-lived association with the young professor I R Shafarevich, only six years his senior, and also began his research interests in\np\np\np\n-groups and\nLie\nalgebras which were to dominate his research career.  Kostrikin worked with Shafarevich as a post-graduate at the\nSteklov\nMathematical Institute of the Academy of Sciences of the USSR and successfully submitted a candidate's dissertation\n(\nequivalent to a Ph.D.\n)\nthere in\n1956\n.\nKostrikin joined the staff of the\nSteklov\nInstitute in\n1956\nand continued his association with the\nSteklov\nInstitute for the rest of his career.  He also taught at the Faculty of Higher Algebra at Moscow State University beginning in\n1963\n, becoming the head in\n1977\nand serving in this capacity for\n23\nyears, from\n1977\nto\n2000\n.  Kostrikin was recognized as an outstanding teacher and mentor to many young mathematicians.  He supervised over\n30\ncandidates in the physical and mathematical sciences, including many who went on to distinguished careers in mathematics.  He maintained close relations with many of these graduate students and carried on joint work with many of them for years\n[\n4\n]\n:-\nDespite his illness, he continued working with graduate students up to the last days of his life.\nHe was both an excellent organizer and writer who, in\n1977\n, authored a widely-used textbook\nIntroduction to algebra\n(\nRussian\n)\nfor university students that has been translated into many languages. J L Brenner writes:-\nThis text, intended for\n19\n- or\n20\n-year old students, includes such topics as: general properties of mappings and of binary relations; some properties of simple groups; theory of representations; elements of the theory of finite fields; fields of algebraic numbers; as well as traditional subjects in a first course in algebra.\nMatrices, rings, fields, groups, polynomials, number theory, linear groups, and modules receive considerable attention. The rotation group SO\n(3)\neven has a section. Important results are given in examples in the text, and in\n200\nexercises\n(\nwith hints and indications\n)\n. Considering the youth of the university and pedagogical institute students to whom it is addressed, the book is both demanding and challenging. Also, abstraction for the sake of abstraction is wisely postponed; the concrete examples are more helpful at this stage.\nThis textbook was rewritten from scratch and republished in\n1994\n. Kostrikin writes in the Foreword about his ideas on algebra and how it should be taught. As it gives a good indication of Kostrikin's thoughts we give a fairly lengthy quote:-\nThe necessity of giving a unified presentation of standard course material in algebra, linear algebra and geometry has been felt for a long time. In any case, our textbook Introduction to algebra dating from almost\n20\nyears ago was considered from the very beginning only as the first step in an integrated approach. Algebra is a living branch of mathematics which possesses a significant attraction and is based on a small number of clear, intuitive foundations. The meaning of an algebraic concept can be of a number-theoretic or geometric nature, and frequently its roots lie in computational aspects of mathematics and in the solution of equations. The principles arising from such a historical understanding and the requirements needed in a modern university textbook in algebra remain generally accepted. The whole difficulty is in the realization of more or less known ideas. The natural evolution of the standard programs, both on behalf of unifying the courses in linear algebra and higher-dimensional analytic geometry, and on behalf of separating them and sprinkling elements of number theory into a course in algebra, are reflected in the pages of the present book, which has been based on the previously mentioned textbook of the same name, although considerably extended and divided into three parts for the convenience of readers. It is self-understood that the combination of these parts must certainly contain the stable core of these three courses, i.e., the minimum that every textbook should include.\nIn\n1980\nKostrikin co-authored another famous textbook\nLinear algebra and geometry\nwith\nYuri Ivanovich Manin\n. This book contains the following chapters:\nLinear spaces and linear mappings.\nThis chapter includes explanations of duality,\nLie algebras\n, the language of category theory, and exact sequences of functors.\nGeometric spaces with scalar product.\nThis chapter includes theory of orthogonalisation, self-conjugate transformations,\nWitt\ngroups, and\nClifford\nalgebras.\nAffine and projective geometry.\nThis chapter includes\nDesargues\n,\nPappus\n, and graded modules.\nTensor products.\nThis chapter includes symmetry and applications to quantum mechanics.\nIn the\n1950\n's, Kostrikin's research centred on the restricted\nBurnside\nproblem for groups of prime exponent.\nSee\nHistory of the Burnside problem\nHe made a major breakthrough in\n1952\nby proving finiteness for the case of\n2\ngenerators with an exponent of\n5\n.  By\n1958\n, he had developed and extended his 'sandwich' method so that he was able to prove the finiteness for any number of generators and any prime exponent.\n(\nIn\n1989\n,\nZelmanov\n, using ideas of Kostrikin among others, solved the restricted\nBurnside\nproblem for arbitrary exponent for which he later received a\nFields\nmedal.\n)\nIn the\n1960\n's, Kostrikin studied infinite-dimensional\nLie\nalgebras of\nCartan\ntype for finite characteristic and, with Shafarevich, formulated a conjecture describing all simple\nLie\np-algebras for characteristic\np\np\np\n>\n5\n.  This conjecture motivated research in the field for many years and was finally proved by R E Black and R L Wilson.\nTwo other problems to which Kostrikin contributed were\n[\n4\n]\n:-\n... the classification of finite-dimensional non-associative algebras whose automorphism group acts transitively on all non-zero elements ...\nand\n... the calculation of the number of unitary conservative complex polynomials and the determination of an upper bound in terms of\np\np\np\nfor the nilpotence class of a\nLie\nring having a fixed-point free automorphism of prime order.\nIn the\n1990\n's, Kostrikin discovered, with many young mathematicians, a theory of integral lattices in simple\nLie\nalgebras which are invariant under the\nKilling\nform.  These had unexpectedly rich applications to other areas such as representations of certain finite simple groups. He published\n(\njointly with P H Tiep\n)\nOrthogonal Decompositions and Integral Lattices\nin\n1994\n. Rudolf Scharlau begins a review of the work as follows:-\nThe book deals with certain \"concrete\" aspects of the representation theory of finite\n(\nalmost\n)\nsimple groups, namely with the realization of certain classes of these groups as automorphism groups of integral lattices and of related algebraic and combinatorial objects\n(\nroot systems, symplectic spreads\n)\n. The lattices are of a particular kind, embedded into a simple\nLie\nalgebra over C and endowed with the\nKilling\nform. The book consists almost exclusively of results obtained during the past\n15\nyears by a group of algebraists at Moscow University, which are presented here for the first time in book form.\nAmong the honours which were given to Kostrikin for his outstanding contributions we mention the State Prize of the USSR in\n1968\n, election to corresponding member of the\nAcademy of Sciences of USSR\nin\n1976\n, the Lomonosov Prize in\n1997\n, his invitation to address the International Congress of Mathematicians in Stockholm\n1962\nand also at the International Congress of Mathematicians in Nice\n1970\n.",
  "matematicos_citados_na_biografia": [
    "Lie",
    "Steklov",
    "Yuri Ivanovich Manin",
    "Lie algebras",
    "Witt",
    "Clifford",
    "Desargues",
    "Pappus",
    "Burnside",
    "History of the Burnside problem",
    "Zelmanov",
    "Fields",
    "Cartan",
    "Killing",
    "Academy of Sciences of USSR"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}