{
  "nome_completo": "Aleksandr Danilovic Aleksandrov",
  "nome_curto": "Aleksandr Aleksandrov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aleksandrov_Aleksandr/",
  "data_nascimento": "4 August 1912",
  "local_nascimento": "Volyn, Ryazan, Russia",
  "data_morte": "27 July 1999",
  "local_morte": "St Petersburg, Russia",
  "summary": "Aleksandr Danilovic Aleksandrov was a Russian mathematician and physicist who worked in geometry and a wide variety of areas of physics. He wrote many textbooks.",
  "biografia": "Aleksandr Danilovic Aleksandrov\n's father was the headmaster of a secondary school in St Petersburg and his mother was a teacher at the same school. In fact, although he was born in the village of Volyn, he lived in St Petersburg from a very young age. Of course this is not strictly true, since when Aleksandrov was two years old St Petersburg changed its name to Petrograd. Aleksandrov attended school in Petrograd but while he was at school the name of the city in which he lived changed yet again and so by the time he left school in\n1928\nit was a Leningrad school from which he graduated.\nWhen Aleksandrov left school he did not intend to study mathematics but rather his interests were in physics. Therefore when he entered Leningrad University in\n1929\nhe set out on a theoretical physics course in the Faculty of Physics. In\n1930\n, while still only\n18\nyears of age, he began original work on optics in the Optics Institute. However Aleksandrov was taught mathematics in the Faculty of Physics by B N\nDelone\n.\nDelone\n's interests in the geometry of numbers and the structure of crystals soon began to attract Aleksandrov at least as much as his work in physics which was supervised by V A Fok.\nIn\n1932\nAleksandrov moved from the Optics Institute to Physics Research Institute of Leningrad University where he worked on the theoretical side of the subject. He graduated with a degree in theoretical physics in\n1933\nand continued his research, working with two supervisors in Fok and\nDelone\n. The influence of these two are clearly seen in Aleksandrov's first few publications which appeared in\n1933\nand\n1934\nand represented research largely carried out while he was still an undergraduate.\nIn\n1933\nhe published\nA theorem on convex polyhedra\nand\nAn elementary proof of the existence of a centre of symmetry in a three-dimensional convex polyhedron\n. Then, in\n1934\n, he published a book\nMathematical foundations of the structural analysis of crystals\njointly written with\nDelone\nand N N Padurov. These first three works were all as a result of his mathematical work with Delone but also in\n1934\nhe published two physics papers on\nquantum mechanics\nOn the calculation of the energy of a bivalent atom by Fok's method\nand\nRemark on the commutation rule in Schrödinger's equation\n. His fourth work in\n1934\nwas on geometry in the area of his first three papers.\nWhile continuing to work at the Physics Research Institute, Aleksandrov began to teach in the Faculty of Mathematics and Mechanics from\n1933\n. Two years later he presented a thesis on geometry for a Master's degree which was on the topic of mixed volumes of convex bodies and he published six papers over the next couple of years on the results of this thesis. This work generalises classical problems in\ndifferential geometry\n. Aleksandrov's doctoral thesis\n(\nmore of a\nhabilitation\nthesis\n)\nwas presented in\n1937\nand in it he studied the topics of additive set functions and the geometrical theory of weak convergence.\nAleksandrov was appointed as Professor of Geometry at Leningrad University in\n1937\n. He was also appointed to the Steklov Mathematical Institute of the\nUSSR Academy of Sciences\nwhich, as a part of the\nSteklov\nInstitute of Physics and Mathematics had been set up in the early\n1920\ns. In\n1934\nthe\nSteklov\nMathematical Institute had been set up but moved to Moscow and\nDelone\n, Aleksandrov's supervisor, had moved with it to head the Algebra Department. In\n1940\nthe Leningrad Branch of the Mathematical Institute was founded and it had among its members Aleksandrov,\nKantorovich\n,\nLinnik\n, and\nFaddeev\n. However the Moscow part of the\nSteklov\nMathematical Institute was moved to Kazan at the beginning of World War II and, in\n1942\nAleksandrov went to Kazan to continue his research within the Mathematical Institute.\nIn\n1944\nAleksandrov returned to the University of Leningrad where he was Professor of Geometry. In\n1952\nhe became Rector of the University of Leningrad. It was a period in which he worked hard to recreate the mathematical activity in Leningrad which had been associated with the\nSt Petersburg Mathematical Society\n.\nThe\nSt Petersburg Mathematical Society\nwas founded in\n1890\nand was the third oldest mathematical society in Russia\n(\nMoscow\nfounded\n1867\nand the\nKharkov\nfounded\n1879\nare older\n)\n. It had ceased to exist in\n1917\ndue to the Revolution, but was recreated after initiatives from\nSteklov\nas the\nPetrograd Physical and Mathematical Society\nin\n1921\n. Both of Aleksandrov's supervisors, Fok and\nDelone\n, played major roles in the Physical and Mathematical Society. However the Society was again closed down due to political pressure. Then\nSmirnov\norganised the Leningrad Mathematical Seminar in\n1953\nwhich went some way to filling the gap left but both Aleksandrov and\nSmirnov\nworked hard to restart the Leningrad Mathematical Society. They succeeded in\n1959\nwhen the Leningrad Mathematical Society again began to hold meetings.\nIn\n1964\nAleksandrov left Leningrad and moved to Novosibirsk where he was appointed as Head of the Department of Geometry of the University of Novosibirsk. He also became Head of the Department of Geometry of the Mathematical Institute of the Siberian Branch of the\nUSSR Academy of Sciences\n.\nIn\n[\n9\n]\nand\n[\n10\n]\nAleksandrov's work in geometry is put into perspective:-\n[\nAleksandrov\n]\napproached the differential geometry of surfaces\n[\nby extending the notion of the objects studied\n]\n, extending the class of regular convex surfaces to the class of all convex surfaces ... . In order to solve concrete problems Aleksandrov had to replace the Gaussian geometry of regular surfaces by a much more general theory. In the first place the intrinsic properties\n(\ni.e. those properties that appear as a result of measurements carried out on the surface\n)\nof an arbitrary convex surface had to be studied, and methods found for the proof of theorems on the connection between intrinsic and exterior properties of convex surfaces. Aleksandrov constructed a theory of intrinsic geometry of convex surfaces on that basis. Because of the depth of this theory, the importance of its applications and the breadth of its generality, Aleksandrov comes second only to\nGauss\nin the history of the development of the theory of surfaces.\nAleksandrov's work in physics did not stop in his student days. He published on optics, quantum mechanics, and relativity. He often lectured on the history of mathematical ideas, a topic which greatly fascinated him. In addition he wrote encyclopaedia articles and wrote chapters on methodology.\nFinally let us note some of Aleksandrov's interests outside mathematics. He loved mountaineering and in fact it is noted in\n(\n[\n9\n]\nand\n[\n10\n]\n)\nthat he spent his fiftieth birthday on a mountaineering expedition to Pamir. His other interests, noted in\n(\n[\n4\n]\nand\n[\n5\n]\n)\n, include questions of education, morals, and other questions of community interest.\nAleksandrov received many awards for his major contributions to geometry. In\n1942\nhe received the State Prize for his work in geometry, then in\n1946\nhe was elected a Corresponding Member of the\nUSSR Academy of Sciences\n. In\n1951\nhe received the international\nLobachevsky\nPrize.",
  "matematicos_citados_na_biografia": [
    "Delone",
    "quantum mechanics",
    "differential geometry",
    "habilitation",
    "USSR Academy of Sciences",
    "Steklov",
    "Kantorovich",
    "Linnik",
    "Faddeev",
    "St Petersburg Mathematical Society",
    "Moscow",
    "Kharkov",
    "Petrograd Physical and Mathematical Society",
    "Smirnov",
    "Gauss",
    "Lobachevsky"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}