{
  "nome_completo": "Alexander Duncan Davidson Craik",
  "nome_curto": "Alex Craik",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Craik/",
  "data_nascimento": "25 August 1938",
  "local_nascimento": "Brechin, Angus, Scotland",
  "data_morte": "17 November 2019",
  "local_morte": "St Andrews, Fife, Scotland",
  "summary": "Alexander D D Craik was an expert on fluid mechanics writing many significant papers on the topic, but he was also interested in the history of mathematics, particularly Scottish mathematics, and wrote over 30 historical works.",
  "biografia": "Alex Craik\nwas the son of Alexander Craik\n(1896\n-\n1997)\n, who ran a small draper's shop in Brechin, and Mary Ford Wyllie Thomson\n(1902\n-\n1994)\n. Alexander and Mary Craik were married on\n10\nMay\n1933\nin the Cooperative Rooms, High Street, Brechin. On their Marriage Certificate, Alexander gives his address as\n107\nRiver Street, Brechin and his occupation as Trader\n(\nMaster\n)\nwhile Mary gives her address as\n13\nCity Road, Brechin and her occupation as Photographer's Assistant. Alex's name Davidson comes from his paternal grandfather Davidson Craik while the name Duncan comes from his maternal grandfather Duncan Thomson. Let me\n[\nEFR\n]\nadd as this point that I knew Alex for nearly\n60\nyears and it is difficult for me to refer to him in any way other than \"Alex\" but, to be consistent with our other biographies, I shall try to refer to him as \"Craik\" for at least most of this biography.\nCraik attended primary school in Brechin, continuing to study at Brechin High School from\n1950\nto\n1956\n. His academic record was outstanding and, while at the high school, he gained a high reputation as a cricketer. Don Shaw kindly sent us the following information:-\nAt Brechin High School in\n1955\nthe Mathematics class for Highers contained six pupils, four of whom went on to take Sixth Year Mathematics\n(\nat that time comprising Geometry, Elementary Analysis and Dynamics\n)\n: Alex Craik, Ian Currie, Marion Greig and Don Shaw. The mathematics teacher was David McGregor, and in the sixth year the headmaster, Sam Anderson, taught Geometry and Elementary Analysis, while Arthur Paterson, the science teacher, taught Dynamics.\nIn\n1956\nhe sat the University of St Andrews Bursary Competition and was awarded a Harkness Bursary of £\n100\nper annum, the highest award made to the very top male students. Later in the same year he entered the University of St Andrews where he missed out the first year mathematics class, going straight into Special Mathematics, the second year course. He performed exceptionally well in this class as he did in all his classes. At this time\nEdward Copson\nwas the Regius Professor of Mathematics and, among those who taught Craik, were\nDaniel Rutherford\n,\nDavid Borwein\nand Jim Tatchell. Craik wrote in May\n2019\nfollowing Tatchell's death:-\nI was a student in perhaps Jim Tatchell's first lecture course in St Andrews. As always, his lectures were remarkably clear and precise. He was an analyst of distinction.\nIn May-June\n1960\nCraik sat the honours examinations in Applied Mathematics. At this time honours students sat seven papers on the work of the two honours years at a single diet of examinations at the end of the second of their honours years. He sat the papers General Analysis, Geometry and Algebra\n(\na special paper for Applied Mathematics\n)\n, Statics, Dynamics, Fluid Dynamics, Quantum Mechanics and Relativity. He was awarded First Class Honours in Applied Mathematics.\nA picture of the Senior  Honours Class of\n1959\n/\n60\nis at\nTHIS LINK\n.\nAfter graduating from St Andrews, Craik went to Churchill College, Cambridge, to undertake research for his doctorate. He was supervised by\nBrooke Benjamin\nwho, at that time, was working partly in the Engineering Department and partly in the Applied Mathematics and Theoretical Physics Department. In\n1963\nCraik was appointed as a lecturer in the Department of Applied Mathematics, St Salvator's College, University of St Andrews. I\n[\nEFR\n]\ntook one of the first courses that he taught in session\n1963\n-\n64\n, namely 'Incompressible Fluids'. I kept the lecture notes I took throughout my career but, sadly, I binned them when I retired from teaching. He also gave a course on 'Compressible Fluids' but since I was doing a joint degree in Pure and Applied Mathematics, I only took the 'Incompressible Fluids' course. Craik was an excellent lecturer, delivering well-prepared and well thought out material.\nOn\n15\nJuly\n1964\n, Craik married Elizabeth Mary Farmer, the daughter of John Farmer and Annie Watson. Elizabeth had studied at Bell Baxter High School, Cupar, Fife, before entering the University of St Andrews to study Classics. She had then studied at Cambridge, after which she held a research post at Birmingham University before returning to St Andrews where she was appointed to the Department of Humanity\n(\nLatin\n)\n. Alex and Elizabeth Craik had two children: Peter Alexander Craik\n(\nborn\n1970)\nand Katharine Anne Craik\n(\nborn\n1972)\n.\nAt the time of his appointment to St Andrews, Craik was still working on his Ph.D. dissertation\nWind-generated waves in thin liquid films\nwhich he submitted to the University of Cambridge and was awarded a Ph.D. in\n1965\n. He published material from his thesis in a paper with the same title in\n1966\n. Craik gives the following acknowledgement in that paper:-\nI should like to thank Dr\nT Brooke Benjamin\nfor his guidance and helpful criticism throughout the course of this work.\nThe paper has the following Abstract:-\nIn the presence of an air stream, a uniform liquid film on a horizontal flat plate may be unstable to small disturbances, and waves may arise. In this paper the hydrodynamic stability of thin liquid films is examined both experimentally and theoretically. The experiments concern water films thinner than those which have been examined in the past. It is found that, when the film thickness is sufficiently 'small', a previously unknown type of instability occurs. The theoretical analysis explains this surprising phenomenon. Due to interaction of the mean airflow and small disturbances of the liquid-air interface, normal and tangential stress perturbations are produced at the liquid surface. It is shown that small wave-like disturbances become unstable when the joint influence of the component of normal stress in phase with the wave elevation and the component of tangential stress in phase with the wave slope is sufficient to overcome the 'stiffness' of the liquid surface due to gravity and surface tension. It is found that the destabilising role of the tangential stress component is dominant for very thin films, and that instability may occur whatever the velocity of the air stream, provided the film is made sufficiently thin.\nCraik made a visit to the University of California's Cecil H and Ida M Green Institute of Geophysics and Planetary Physics at La Jolla, California. He worked with several people at the Institute, in particular with John Miles, the Professor of Applied Mechanics and Geophysics. Three of the four papers Craik published in\n1968\nrelated to his research to La Jolla. The fourth paper is a joint paper with Frank Smith, Craik's first Ph.D. student. We list these four papers and give Craik's Acknowledgements in each in each of them.\n1\n.\nA note on the static stability of an elastico-viscous fluid\n(1968)\n. Acknowledgements:-\nI am grateful to Dr\nT Brooke Benjamin\nfor some helpful comments. This work was done during a visit to the University of California, Institute of Geophysics and Planetary Physics, La Jolla. This visit was supported by the National Science Foundation, by the Office of Naval Research and by a travel grant from the Sir James Caird Trust.\n2\n.\nResonant gravity-wave interactions in a shear flow\n(1968)\n. Acknowledgements:-\nI am grateful to Dr R E Kelly, Dr R E Davis, Professor J W Miles and Dr H Huppert, with whom I had numerous helpful discussions. This work was performed during a visit to the University of California, Institute of Geophysics and Planetary Physics, La Jolla, California. The visit was supported by the National Science Foundation, by the Office of Naval Research, and by a travel grant from the Sir James Caird Trust.\n3\n.\nWind-generated waves in contaminated liquid films\n(1968)\n. Acknowledgements:-\nI am grateful to Dr\nT Brooke Benjamin\nfor helpful discussions throughout the course of this work, and to Prof J W Miles and Mr F I P Smith for comments on an earlier draft of this paper. The manuscript was completed during a visit to the University of California, Institute of Geophysics and Planetary Physics, La Jolla, California. This visit was supported by the National Science Foundation, by the Office of Naval Research, and by a travel grant from the Sir James Caird Trust.\n4\n.\n(\nwith Frank I P Smith\n)\nThe stability of free-surface flows with viscosity stratification\n(1968)\n. Acknowledgements:-\nPart of this work was performed while one of us\n(\nFrank Smith\n)\nwas the recipient of an S.R.C. research studentship. The computations were carried out on the IBM\n1620\ncomputer of the University of St Andrews.\nIt is worth quoting the comments Craik made about the start of his career when he retired in September\n2003\n[\n9\n]\n:-\nI intended staying\n[\nin St Andrews\n]\nfor only a few years; but have remained for forty! ... There was no electronic computer of any kind in St Andrews; nor were there any Xerox copiers. Almost all letters, teaching material and research papers were written by hand and typed by a departmental secretary. Though the computer has revolutionised how mathematics is done, there have been many other advances too.\nCraik continued to publish high quality papers on wave motion and hydrodynamic stability. In\n1985\nhe published the book\nWave Interactions and Fluid Flows\nwhich incorporated much of his earlier research. For further information about this book including extracts from reviews, see\nTHIS LINK\n.\nBeginning in the\n1980\ns Alex Craik, George Phillips and myself\n[\nEFR\n]\nbegan teaching an undergraduate module on the History of Mathematics. The first time we gave the\n24\n-lecture course, we gave\n8\nlectures each and, in addition to giving our own lectures, we attended each other's lectures. Perhaps the 'MacTutor History of Mathematics Archive' would never have existed if Alex Craik had not been so helpful and encouraging to me at this time. He began publishing papers on the history of mathematics in the\n1990\ns beginning with\nJohn West in Scotland and Jamaica\n(1998)\n,\nCalculus and analysis in early\n19\nth century Britain: the work of William Wallace\n(1999)\nand\nGeometry versus analysis in early\n19\nth century Scotland: William Wallace, John Leslie and Thomas Carlyle\n(2000)\n. His publication list contains over\n30\nhigh quality papers on the history of mathematics particularly studying Scottish mathematicians of the eighteenth and nineteenth centuries. Of course being an expert on fluid mechanics, it was natural that he would also publish on the history of this area with papers such as:\nG G Stokes and his precursors on water wave theory\n(2003)\n,\nThe origins of water wave theory\n(2004)\n,\nThomas Young on fluid mechanics\n(2010)\nand\nLord Kelvin on fluid mechanics\n(2012)\n.\nIn\n[\n3\n]\nPeter Cameron writes about Craik's:-\n... paper in the 'American Mathematical Monthly' ... entitled \"Prehistory of Faà di Bruno's formula\". This formula gives the\nn\nn\nn\nth derivative of a composite function\nf\n(\ng\n(\nx\n)\n)\nf(g(x))\nf\n(\ng\n(\nx\n)\n)\n, in an analogous way to\nLeibniz\n's formula for the\nn\nn\nn\nth derivative of a product. It is particularly relevant to discrete mathematics, for two reasons: first, it applies to general formal power series over commutative rings with identity, no issues of convergence need to be considered; and second, the coefficients that arise are slightly disguised\nStirling\nnumbers\n(\nmuch as\nLeibniz\n's formula involves binomial coefficients\n)\n.\nFrancesco Faà di Bruno\n(1825\n-\n1888)\nis perhaps the only mathematician to be also a Roman Catholic saint. He was a student of\nCauchy\nand friend of\nHermite\n. He returned to Turin and devoted himself to work among the poor, for which he was canonised in\n1988\n. In his paper, Alex Craik describes several authors who had anticipated the formula to varying extents, and awards the palm of discovery to\nArbogast\nin\n1800\n. I recommend the paper to you.\nCraik's book on the history of mathematics is not specifically on either of the two areas we have just mentioned. It is\nMr Hopkins' Men: Cambridge Reform and British Mathematics in the Nineteenth Century\n(2008)\n. For more information about this book including extracts from the preface and from reviews, see\nTHIS LINK\n.\nIn\n1997\nElizabeth Craik was appointed as Professor of Classics at Kyoto University, Japan. She was the first woman, indeed, the first westerner, to be appointed a full professor in the Faculty of Letters at Kyoto. Alex Craik spent periods in Japan where he made many friends among the mathematicians, particularly the fluid dynamicist Hisashi Okamoto, and became interested in the history of Japanese mathematics. He wrote several papers with Hisashi Okamoto including\nA three-dimensional autonomous system with unbounded 'bending' solutions\n(2002)\nand\nA four-leaf chaotic attractor of a three-dimensional dynamical\nsystem\n(2015)\n.\nHe reviewed the book\nSacred Mathematics: Japanese Temple Geometry\nby Fukagawa Hidetoshi and Tony Rothman for the\nLondon Mathematical Society\n. At the end of his very positive review, Craik make the following comment, clearly based on his experience in Japan:-\nIn his Foreword,\nFreeman Dyson\ncomments on the scant recognition given in Japan to Fukagawa, and the lack of interest among Japanese academics, that first drove him to publish his work in English with help from\nDan Pedoe\n. But, in more recent years, there has been a resurgence of interest in traditional Japanese mathematics. Many Japanese mathematicians are now knowledgeable about, and proud of, their distinctive heritage. ... Is it not now the British, rather than the Japanese, who neglect their cultural heritage?\nMay I\n[\nEFR\n]\nadd the personal comment that after one of his trips to Japan, Alex told me how he loved watching sumo wrestling when he was in Japan.\nCraik died at his home in St Andrews after a short illness, leukamia having been diagnosed in July\n2019\n. Sally Mapstone, Principal of the University of St Andrews, wrote in\n[\n8\n]\n:-\nAlex was respected by staff and students as a fine lecturer and a thoughtful, supportive and very modest colleague. In\n1983\nhe was elected Fellow of the Royal Society of Edinburgh, in\n1987\nhe was awarded a Personal Chair at St Andrews and from\n1993\nto\n1995\nhe was President of the\nEdinburgh Mathematical Society\n.\nCraik's interests outside his mathematics and his family\n(\nincluding his four grandchildren Gregor, Stuart, Heather and Jamie\n)\nwere music\n(\nand he played classical guitar to a high standard\n)\n, travelling\n(\nespecially in Greece\n)\nand enjoyment of his large house and garden.\nMay I\n[\nEFR\n]\nadd a final comment saying how much I appreciated having Alex as a teacher, and as a colleague and friend for over\n50\nyears. After we both retired Alex would come to the Mathematical Institute, take the opportunity to talk to me about his latest research, often giving me a copy of one of his newly published papers, and would ask with interest about my latest MacTutor project. He was a great support and a very dear friend whom I miss greatly.\nI\n[\nJOC\n]\ntaught with Alex and shared some courses with him. Although he was an applied mathematician and I was pure, his approach to the areas we lectured on\n(\ncomplex analysis and differential equations\n)\nagreed very much with mine. I was able to write software to help him display the three dimensional solutions of differential equations and we cooperated on several topics in the history of mathematics. I valued him greatly as a colleague and will miss him very much.",
  "matematicos_citados_na_biografia": [
    "Edward Copson",
    "Daniel Rutherford",
    "David Borwein",
    "THIS LINK",
    "Brooke Benjamin",
    "T Brooke Benjamin",
    "Leibniz",
    "Stirling",
    "Francesco Faà di Bruno",
    "Cauchy",
    "Hermite",
    "Arbogast",
    "London Mathematical Society",
    "Freeman Dyson",
    "Dan Pedoe",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "craik.jpg"
  ]
}