{
  "nome_completo": "Alexander Morgan",
  "nome_curto": "Alexander Morgan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morgan_Alexander/",
  "data_nascimento": "21 August 1860",
  "local_nascimento": "Leith, Edinburgh, Scotland",
  "data_morte": "17 March 1946",
  "local_morte": "Edinburgh, Scotland",
  "summary": "Alexander Morgan was a Scotish mathematician who had an important influence on the development of education in Scotland.",
  "biografia": "Alexander Morgan\n's father was  William Morgan\n(\nborn in Lumphannan, Aberdeenshire about\n1822)\nwho gave his occupation as Ditcher\n(\noffice\n)\n. His mother was  Ann Morgan\n(\nborn Old Machan, Aberdeenshire about\n1831)\n.\nThe family moved from Leith to Aberdeen when Alexander was young and he received his early schooling and training as a pupil-teacher in that city attending the North Parish School, Aberdeen, and the Grammar School, Old Aberdeen. He returned to Edinburgh where he studied at the Church of Scotland Training College and the University of Edinburgh. He graduated from the University with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1886\n. His undergraduate career had been outstandingly successful and he was awarded the Sir David Baxter Scholarship in Mathematics, and the Neil-Arnott Bursary as the best student in his year in the Physical Laboratory. He also was awarded a B.Sc. degree from the University of Edinburgh.\nIn\n1888\nAlexander Morgan married Isabella Duthie\n(\nborn in Aberdeen in about\n1861)\n. They had sons William\n(\nborn about\n1892)\nand Alexander\n(\nborn about\n1896)\n.\nOn graduating M.A., Morgan was appointed a Lecturer in Mathematics at the Church of Scotland Training College, Edinburgh. In\n1897\nhe was awarded a D.Sc. by the University of Edinburgh for his thesis\nThe geometrical representation of elliptic integrals of the first kind\n.\nJohn Clark\nwrites in\n[\n1\n]\nabout Morgan's work at the Training College:-\nHis own personal influence with the students was very great and wholly good. There must be today\n[1947]\nhundreds of workers in the field of Education, in Scotland and elsewhere, who look back with feelings of lively gratitude to their association with Dr Morgan in the Training College, and with sincere affection too for the man himself.\nIn\n1903\nMorgan became Principal of the Church of Scotland Training College. He held this position until\n1920\nwhen the Provincial Training College was created from the union of the two Church Training Colleges. Morgan then became Director of Studies at the Provincial Training College until he retired in\n1925\n.\nJohn Clark\nwrites about Morgan's influence on Scottish Education\n[\n1\n]\n:-\nFor many years he took a prominent part in the counsels of the Education Institute, becoming President of the Institute in\n1911\n-\n12\n, and Convener of the\n1916\n-\n17\nReform Committee whose report had an important bearing on the Education Act of\n1918\n.\nAfter he retired in\n1925\n, Morgan continued to work hard for education. He served as Convener of the Business Committee of the General Council of the University of Edinburgh for several years. He also represented the General Council on the University Court from\n1932\nto\n1939\n. He also took on the role of Honorary Secretary of the Extra-Mural Adult Education Committee. For his great contributions to the University he was awarded an honorary LL.D. in\n1937\n.\nIn\n1888\nMorgan married Isobel Duthie; she died in\n1941\n. Their son, Lieutenant-General Sir William Duthie Morgan, K.C.B., was Commander-in-Chief Central Mediterranean Forces.\nMorgan joined the\nEdinburgh Mathematical Society\nin November\n1887\n. He was President during session\n1898\n-\n99\n. He submitted papers to the Society such as\n0\nn the Geometrical Representation of Elliptic Integrals of the First Kind\n(\nFriday\n12\nFebruary\n1897)\n. He was elected a fellow of the\nRoyal Society of Edinburgh\non\n4\nMay\n1896\n. He was proposed for the fellowship by\nGeorge Chrystal\n, Simon S Laurie,\nJohn Sturgeon Mackay\n, and\nPeter Guthrie Tait\n.\nMorgan's death was reported in\nThe Scotsman\non Tuesday\n19\nMarch\n1946\n:-\nDR ALEX MORGAN DEAD\nFormer Principal of Moray House\nPROMINENT EDUCATIONIST\nDr Alexander Morgan, O.B.K., M.A., F.R.S.E.. a former Principal and Director of Studies of Edinburgh Provincial Training College, Moray House, and for many years an outstanding figure in Scottish educational circles, died at his home in Edinburgh on Sunday night.\nUnder Dr Morgan's chairmanship, the Scottish Education Reform Committee\n(1916\n-\n17)\nissued a report which exerted a powerful influence on educational advances, including the Act of\n1918\n. His zest for education was great, but it was not confined in a narrow pedagogic channel, and the many teachers who passed into the schools of the country from Moray House had reason to be grateful for the wide culture and sympathies of an inspiring Principal. After his retirement from the Provincial Training College, his skill as an organiser and his experience as an administrator were freely put at the disposal of the General Council and the Court of the University of Edinburgh.\nA son of the late William Morgan, Leith, he was born at Leith in\n1860\n. His early education was received at North Parish Church School, Aberdeen, and Old Aberdeen Grammar School, and after a period as a pupil-teacher in Aberdeen he went through two years of professional training in the Church of Scotland Training College, Edinburgh.\nProceeding to Edinburgh University, he graduated M.A. with first class honours in mathematics and natural philosophy, and gained the Sir David Baxter Scholarship in mathematics and the Neil Arnott bursary as the most distinguished student of the year in the physical laboratory. Later he took the B.Sc. degree and in\n1897\nhe received the degree of D.Sc. for original investigation in mathematics, conferred for the first time for research in that department.\nImmediately after graduation in\n1886\nhe was appointed a lecturer in the Edinburgh Training College, became Principal in\n1903\n, and when the office of Director of Studies was created he combined the duties of that office with those of Principal. He was largely responsible for the closer connection established between that joint office and the University Chair of Education, and also for the institution of the Chair of Education. He retired in\n192\nS.\nUNIVERSITY SERVICES\nFrom\n1932\ntill\n1939\nDr Morgan was one of the assessors elected by the Genera Council to the Edinburgh University Court and before joining the Court he rendered valuable service for some years as Convener of the Business Committee of the General Council. In addition lo those services, the University was indebted to him for his laborious and fruitful researches into the University records, part of the results of which were published in the volume of Charters, Statutes, and Acts in\n1931\n, and for his work on the Extra-mural Committee. Dr Morgan was a strenuous worker in the cause of adult education and a voluminous writer on educational subjects. In\n1937\nthe University of Edinburgh conferred upon him the honorary degree of LLD.\nFor many years Dr Morgan was a leading member of the Educational Institute of Scotland, and was president in\n1912\n. He was a member of the Scottish Savings Committee and received the O.B.E. in\n1931\n. He was at one time chairman of the Morningside Ward Liberal Committee and was a member of the Scottish Liberal Club.\nDr Morgan's wife died in\n1941\n. Their son, Lieut. General Sir William Duthie Morgan, has had a distinguished war record. He succeeded Field-Marshal Sir Harold Alexander as Supreme Allied Commander, Mediterranean Theatre, last October, and is now C. in C. Central Mediterranean Forces.",
  "matematicos_citados_na_biografia": [
    "John Clark",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "George Chrystal",
    "John Sturgeon Mackay",
    "Peter Guthrie Tait"
  ],
  "imagens": []
}