{
  "nome_completo": "Alexis Claude Clairaut",
  "nome_curto": "Alexis Clairaut",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clairaut/",
  "data_nascimento": "7 May 1713",
  "local_nascimento": "Paris, France",
  "data_morte": "17 May 1765",
  "local_morte": "Paris, France",
  "summary": "Alexis Clairaut was a French mathematician who worked to confirm the Newton-Huygens belief that the Earth was flattened at the poles.",
  "biografia": "Alexis Clairaut\n's father, Jean-Baptiste Clairaut, taught mathematics in Paris and showed his quality by being elected to the\nBerlin Academy\n. Alexis's mother, Catherine Petit, had twenty children although only Alexis survived to adulthood.\nJean-Baptiste Clairaut educated his son at home and set unbelievably high standards. Alexis used\nEuclid\n's\nElements\nwhile learning to read and by the age of nine he had mastered the excellent mathematics textbook of Guisnée\nApplication de l'algèbre à la géométrie\nⓉ\n(\nApplication of algebra to geometry\n)\nwhich provided a good introduction to the differential and integral calculus as well as analytical geometry. In the following year, Clairaut went on to study\nde L'Hôpital\n's books, in particular his famous text\nAnalyse des infiniment petits pour l'intelligence des lignes courbes\nⓉ\n(\nInfinitesimal analysis for the understanding of curves\n)\n.\nFew people have read their first paper to an academy at the age of\n13\n, but this was the incredible achievement of Clairaut's in\n1726\nwhen he read his paper\nQuatre problèmes sur de nouvelles courbes\nⓉ\n(\nFour problems on new curves\n)\nto the\nParis Academy\n. Although we have already noted that Clairaut was the only one of twenty children of his parents to reach adulthood, he did have a younger brother who, at the age of\n14\n, read a mathematics paper to the Academy in\n1730\n. This younger brother died in\n1732\nat the age of\n16\n.\nClairaut began to undertake research on double curvature curves which he completed in\n1729\n. As a result of this work he was proposed for membership of the\nParis Academy\non\n4\nSeptember\n1729\nbut the king did not confirm his election until\n1731\n. In July\n1731\nClairaut became the youngest person ever elected to the\nParis Academy of Sciences\n. There he joined a small group, led by\nPierre Louis Maupertuis\n, who supported the natural philosophy of\nNewton\n.\nMaupertuis\nwas\n15\nyears older than Clairaut but despite this, at the age of\n33\n, he was also a young member of the\nAcademy\n.\nClairaut became close friends of\nMaupertuis\n, Voltaire, and du\nChâtelet\n. This was much more than a personal friendship since he did important work with both\nMaupertuis\nand du\nChâtelet\n. He helped the Marquise du\nChâtelet\ntranslate\nNewton\n's\nPrincipia\ninto French, a project which began before\n1745\nand continued until part of the book was published in\n1756\n. Many of Clairaut's own theories were added to the book, in addition to the translation of\nNewton\nby du\nChâtelet\n.\nTogether with\nMaupertuis\n, Clairaut visited Basel in\n1734\nto spend a few months studying with\nJohann Bernoulli\n. While in Basel, Clairaut became friends with\nSamuel König\nand, for many years, the two continued a useful scientific collaboration by correspondence.\nClairaut published some important work during the period\n1733\nto\n1743\n. He wrote the paper\nSur quelques questions de maximis et minimis\nⓉ\n(\nOn some questions of maxima and minima\n)\nin\n1733\non the\ncalculus of variations\n, written in the style of\nJohann Bernoulli\nand, in the same year, he published on the geodesics of\nquadrics\nof rotation again studying a topic to which\nJohann Bernoulli\nhad contributed. The following year Clairaut studied the\ndifferential equations\nnow known as 'Clairaut's differential equations' and gave a singular solution in addition to the general integral of the equations. In\n1739\nand\n1740\nhe published further work on the integral calculus, proving the existence of\nintegrating factors\nfor solving first order differential equations\n(\na topic which also interested\nJohann Bernoulli\n,\nReyneau\nand\nEuler\n)\n. In\n1742\nClairaut published an important work on dynamics but, in the following year, he turned his attention to the topic for which he is best known. He became interested in solving theoretical questions which followed on from the practical results of an expedition some years earlier.\nFrom\n20\nApril\n1736\nto\n20\nAugust\n1737\nClairaut had taken part in an expedition to Lapland, led by\nMaupertuis\n, to measure a degree of longitude. The expedition was organised by the\nParis Academy of Sciences\n, still continuing the programme started by\nCassini\n, to verify\nNewton\n's theoretical proof that the Earth is an oblate spheroid. In addition to\nMaupertuis\nand Clairaut, the group contained other young scientists such as Lemonnier,\nCamus\nand\nCelsius\n. The highly successful team were not without their critics\n[\n1\n]\n:-\nThis enthusiastic group accomplished its mission quickly and precisely, in an atmosphere of youthful gaiety for which some reproached them.\nIn\n1743\nClairaut published\nThéorie de la figure de la Terre\nⓉ\n(\nTheory of the shape of the Earth\n)\nconfirming the\nNewton\n-\nHuygens\nbelief that the Earth was flattened at the poles. The book was a theoretical study to support the experimental data on the shape of the Earth which the expedition to Lapland had gathered. The book was an important one in laying the foundations for the study of hydrostatics. It built on foundations due to\nNewton\nand\nHuygens\nwho had put forward the theory that the Earth was an oblate spheroid, and also on\nMaclaurin\n's work on tides which developed some background results in hydrostatics.\nAfter his work on\nThéorie de la figure de la Terre\nⓉ\n(\nTheory of the shape of the Earth\n)\nClairaut began to work on the three-body problem in\n1745\n, in particular on the problem of the moon's orbit. The first conclusions that he drew from his work was that\nNewton\n's theory of gravity was incorrect and that the inverse square law did not hold. In this Clairaut had the support of\nEuler\nwho, after learning of Clairaut's conclusions, wrote to him on\n30\nSeptember\n1747\n:-\nI am able to give several proof that the forces which act on the moon do not exactly follow the rule of\nNewton\n, and the one you draw from the movement of the\napogee\nis the most striking...\nClairaut, more confident with\nEuler\n's support, announced to the\nParis Academy\non\n15\nNovember\n1747\nthat the inverse square law was false. Rather remarkably, just before Clairaut made his announcement,\nd'Alembert\ndeposited a paper with the Academy which showed that his calculations agreed with those of Clairaut. Clairaut suggested that a term in\n1\nr\n4\n\\large\\frac{1}{r^{4}\\normalsize}\nr\n4\n1\n​\nneeded to be added and\nEuler\n(\nperhaps rather wisely\n)\nagreed that Clairaut had found the error in the inverse square law before he had.\nOf course, not all mathematicians at this time believed\nNewton\n's theory, some still believing in\nDescartes\n' vortex theories. The announcement that\nNewton\n's law was incorrect made many of\nDescartes\n' supporters overjoyed and even\nEuler\nreturned to\nDescartes\n' views. Some attacked Clairaut's announcement, for example\nBuffon\nwho used a metaphysical argument based on the simplicity of the inverse square law.\nHowever, by the spring of\n1748\n, Clairaut realised that the difference between the observed motion of the moon's apogee and the one predicted by the theory was due to errors coming from the approximations that were being made rather than from the inverse square law of gravitational attraction. Clairaut announced to the\nAcademy\non\n17\nMay\n1749\nthat his theory was now in agreement with the inverse square law. He then had a period of enjoying watching\nd'Alembert\nand\nEuler\nstruggle to repeat his calculations. Clairaut wrote to his friend\nGabriel Cramer\n[\n14\n]\n:-\n...\nd'Alembert\nand\nEuler\nhad no inkling of the stratagem that led me to my new results. The latter twice wrote to tell me that he had made fruitless efforts to find the same thing as I, and that he begged me to tell him how I arrived at them. I told him, more or less, what it was all about...\nEuler\nstill felt he did not properly understand what Clairaut had done so he tried to tempt him to write it up properly by having the\nSt Petersburg Academy\nset the problem of the moon's apogee as the prize topic for\n1752\n. Indeed his ploy worked and Clairaut submitted an essay which let\nEuler\nfully understand Clairaut's method.\nEuler\n, going well beyond the mark but showing how frustrated he had been not solving the problem himself, wrote to Clairaut that his results were:-\n... the most important and profound discovery that has ever been made in mathematics.\nClairaut published\nThéorie de la lune\nⓉ\n(\nTheory of the moon\n)\nin\n1752\nand this work, together with his lunar tables published two years later, completed his work on this particular problem.\nClairaut decided to apply his knowledge of the three-body problem to compute the orbit of\nHalley\n's comet and so predict the exact date of its return. This required much more accurate approximations than had the problem of the moon. He calculated to within a month the return in\n1759\nof\nHalley\n's comet to its perihelion\n(\nclosest point to the Sun\n)\n. He announced his result, that the perihelion would occur on\n15\nApril\n1759\n, to the Paris Academy on\n14\nNovember\n1758\n, while the actual date of perihelion turned out to be\n13\nMarch. When the comet appeared, only one month before the predicted date, Clairaut was given great public acclaim. There was a suggestion that the comet be renamed after Clairaut, and Clairaut was called the 'new\nThales\n'.\nClairaut improved his results when he used a different method in his prize winning paper submitted to the\nSt Petersburg Academy\nfor the\n1762\nprize. He was able to obtain the date of\n30\nMarch in this work which, given the complexity of the problem of taking the perturbations of Jupiter and Saturn into account, is remarkably good.\nA dispute arose between Clairaut and\nd'Alembert\nregarding this work on comets. Although the two had been reasonably friendly rivals up to about\n1747\n, after that relations deteriorated. When Clairaut wrote a review of\nd'Alembert\n's book containing lunar tables then, as Hankins writes\n[\n4\n]\n:-\nHe was not openly hostile, but adopted the condescending tone of a master instructing an able student; he praised\nd'Alembert\n's great analytical skill, but said his tables were of little use - at least compared to Clairaut's own tables.\nIn an attack on those who, like\nd'Alembert\n, concentrated on theory and neglected experiment, Clairaut wrote:-\nIn order to avoid delicate experiments or long tedious calculations, in order to substitute analytical methods which cost them less trouble, they often make hypotheses which have no place in nature; they pursue theories that are foreign to their object, whereas a little constancy in the execution of a perfectly simple method would have surely brought them to their goal.\nWhen\nd'Alembert\nattacked Clairaut's solution of the three-body problem as being too much based on observation and not, like his own work, based on theoretical results, Clairaut strongly attacked\nd'Alembert\nin the most bitter dispute of their lives. It is hard to judge which of the two great mathematicians was right, but Clairaut clearly won the public argument at the time, not least because his standing was so high after the remarkable prediction of the date of the return of\nHalley\n's comet.\nWe should also mention another topic to which Clairaut made important contributions, namely to the aberration of light. He had to have a thorough understanding of this topic from the time of the observations made by the Lapland expedition. He also had to make use of corrections due to aberration in his work on the planets and comets. He was particularly interested in the ideas of improving telescope design by using lenses made up of two different types of glass. Clairaut wrote some important memoirs on the topic, studying the theory as well as conducting optical experiments. This work was still incomplete at the time of his death.\nClairaut worked on a wide range of problems within mathematics. A geometry book\nElements de géometrie\nⓉ\n(\nElements of geometry\n)\nwas published in\n1741\nand a book on algebra\nElements d'algèbre\nⓉ\n(\nElements of algebra\n)\nwas published in\n1749\n. In the preface to\nElements de géometrie\nⓉ\n(\nElements of geometry\n)\nClairaut gives his aims in writing the book:-\nI intended to go back to what might have given rise to geometry; and I attempted to develop its principles by a method natural enough so that one might assume it to be the same as that of geometry's first inventors, attempting only to avoid any false steps that they might have had to take...\nThe algebra book was an even more scholarly work and took the subject up to the solution of equations of degree four. He tried, with great success, to show why the introduction of algebraic notation was necessary and inevitable. The book was used for teaching in French schools for many years.\nClairaut died at the age of\n52\nafter a brief illness. He was at the height of his powers and he had been honoured by being elected to the leading academies of the day. He had been elected to the\nRoyal Society of London\n, the\nAcademy of Berlin\n, the\nAcademy of St Petersburg\nand the Academies of Bologna and Uppsala.",
  "matematicos_citados_na_biografia": [
    "Berlin Academy",
    "Euclid",
    "de L'Hôpital",
    "Paris Academy",
    "Paris Academy of Sciences",
    "Pierre Louis Maupertuis",
    "Newton",
    "Maupertuis",
    "Academy",
    "Châtelet",
    "Johann Bernoulli",
    "Samuel König",
    "calculus of variations",
    "quadrics",
    "differential equations",
    "integrating factors",
    "Reyneau",
    "Euler",
    "Cassini",
    "Camus",
    "Celsius",
    "Huygens",
    "Maclaurin",
    "apogee",
    "d'Alembert",
    "Descartes",
    "Buffon",
    "Gabriel Cramer",
    "St Petersburg Academy",
    "Halley",
    "Thales",
    "Royal Society of London",
    "Academy of Berlin",
    "Academy of St Petersburg"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}