{
  "nome_completo": "Alfreds Arnolds Adolfs Meders",
  "nome_curto": "Alfreds Meders",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meders/",
  "data_nascimento": "1 October 1873",
  "local_nascimento": "Riga, Latvia",
  "data_morte": "28 June 1944",
  "local_morte": "Poznań, Poland",
  "summary": "Alfreds  Meders was a Latvian mathematician who worked on differential geometry and mathematical analysis.",
  "biografia": "Alfreds Meders\n' father was a school teacher who taught mathematics at a high school. Alfreds' family were of German origin and he was brought up with German as his first language. He graduated from high school in\n1890\nand went to Dorpat to study mathematics at the university there.\nDorpat university had been founded in\n1632\nby Gustavus II Adolphus of Sweden, but had been closed for nearly\n100\nyears before being reopened in\n1802\n. This was during the period when Estonia was controlled by Russia. The accession of Alexander III saw Russia make a much greater effort to increase Russian influence on Estonia. In\n1887\nRussian was made the language of instruction, instead of German and Estonian, and in\n1893\nwhile Meders studied at the University of Dorpat, the Russians made an effort to convert the establishment to a Russian one. The name of Dorpat\n(\nand of the university\n)\nwas changed to Tartu.\nAdolf Kneser\n, who had been taught by\nKronecker\nand written a thesis on algebraic functions and equations, was the professor at Dorpat. He greatly influenced Meders who graduated from Tartu University's Faculty of Physics and Mathematics in\n1895\n(\nnotice that Dorpat had changed its name to Tartu by this time\n)\n. In the same year of\n1895\n, Peirs Bohl became Head of the Departmant of Mathematics at Riga Polytechnic Institute, founded in\n1862\n, the only higher education institution in Latvia at the time. Two years later Meders was appointed to Riga Polytechnic Institute where at first he was an assistant of K Kupfer, but later became a\ndozent\n. We mentioned above how Dorpat became a Russian university in\n1893\n, and this happened three years later to Riga Polytechnic Institute. By the time Meders was appointed, therefore, all teaching at the Institute was in Russian.\nLeimanis\n, who was a student of Meders, writes in\n[\n2\n]\nthat he taught:-\n... as a beloved and outstanding teacher.\nIn\n1906\nMeders was awarded his masters degree from the University of St Petersburg.\nMeders worked on differential geometry and mathematical analysis. He often published papers written in German, in German journals. For example he published the following three papers in\nCrelle\n's Journal:\nÜber einige Arten Singularer Punkte von Raumkurven\nⓉ\n(\nAbout some types of singular points of space curves\n)\n(1896)\n;\nZur Theorie der singularen Punkte einer Raumkurve\nⓉ\n(\nOn the theory of singular points of a space curve\n)\n(1899)\n; and\nAnalytische Untersuchung singularer Punkte von Raumkurven\nⓉ\n(\nAnalytical study of singular points of space curves\n)\n(1910)\n. In\nMonatshefte für Mathematik\nⓉ\n(\nMathematical monthly\n)\nhe published:\nÜber die Determinante von Wronski\nⓉ\n(\nOn the determinant of Wronski\n)\n(1906)\n; and\nZur Differentiation bestimmter Integrale nach einem Parameter\nⓉ\n(\nOn differentiation of definite integrals with a parameter\n)\n(1911)\n.\nDuring World War I, Riga Polytechnic Institute was evacuated to Moscow. During\n1917\nthe Russian domination of Latvia ended and, after a brief period of German invasion, the country became independent in a proclamation made on\n18\nNovember\n1918\n. Within this new independent country there was a wish to quickly found a national university and the University of Latvia was founded in September\n1919\n. Meders was appointed as a professor at the University of Latvia from the time of its founding.\nMeders was also interested in the history of mathematics and he wrote an important paper\nDirekte und indirekte Beziehungen zwischen Gauss und der Dorpater Universität\nⓉ\n(\nDirect and indirect relationships between Gauss and the Tartu University\n)\nin\n1928\n. His interests went outside mathematics and he sometimes lectured on astronomy, meteorology and biology where he had a special interest in birds.\nThe German-Soviet Nonaggression Pact was signed in August\n1939\nand Latvia's fate was out of its own hands. Meders began teaching at the start of the academic year\n1939\n-\n40\n, but being of German origin he found himself on a list of people who were required to be repatriated to Germany. It was with great sadness that he left Latvia and Riga which had been his home.",
  "matematicos_citados_na_biografia": [
    "Adolf Kneser",
    "Kronecker",
    "dozent",
    "Leimanis",
    "Crelle"
  ],
  "imagens": []
}