{
  "nome_completo": "Alfred Young",
  "nome_curto": "Alfred Young",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young_Alfred/",
  "data_nascimento": "16 April 1873",
  "local_nascimento": "Widnes, Lancashire, England",
  "data_morte": "15 December 1940",
  "local_morte": "Birdbrook, Essex, England",
  "summary": "Alfred Young was an English mathematician who worked in group theory. Both Young diagrams and Young tableaux are named after him.",
  "biografia": "Alfred Young\n's father was Edward Young, described by Turnbull in\n[\n4\n]\nas:-\n... a prosperous Liverpool merchant and a Justice of the Peace for the county.\nAlfred was the first son of his father's second marriage. In\n1879\n, when Alfred was six years old, the family moved from Lancashire to Bournemouth. After being educated at home with a private tutor, who also taught the sons of Edward Young's first marriage, Alfred went to Monkton Combe school near Bath. It was at this school that the extent of Alfred's talents in mathematics were recognised. Encouraged by his teachers, he sat the Cambridge Scholarship examinations, winning a scholarship to Clare College.\nEntering Clare College in\n1892\n, Young combined sporting and academic interests. He was an excellent oarsman and as such he made his mark rowing during his first two years. At University he was described by one of his fellow students as:-\n... a shy, clever lad with great humility of spirit which so marked him in his youth ...\nBy his third year Young had begun to undertake research in mathematics and although this proved a good start to his mathematical career, it was not the best way to prepare for the Mathematical Tripos examinations. He was placed tenth\nWrangler\n(\ntenth in the First Class\n)\nin\n1895\n, the Senior Wrangler that year being\nBromwich\nwith\nWhittaker\nSecond Wrangler. Again a description of Young at this stage is interesting for he was said to be:-\n... the most original man of his year\n[\nwho\n]\nwould have occupied a higher place in the list had he directed his attention to the examination schedule ...\nIn\n1896\nYoung was placed in the Second Class of Part II of the Mathematical Tripos. He published his first paper\nThe irreducible concomitants of any number of binary quartics\nearly in\n1899\nin the\nProceedings of the London Mathematical Society\n. His second paper\nThe invariant syzygies of lowest degree of any number of quartics\nwas published in the following year.\nYoung was appointed as a lecturer in Selwyn College, Cambridge in\n1901\n. He remained in that post until\n1905\nwhen he was elected to a Fellowship at Clare College where he became Bursar. He married Edith Clara in\n1907\n. They did not have any children. In\n1908\nYoung was ordained and became a Curate at Christ Church, Hastings. In the same year he was awarded a Sc.D. from Cambridge for his outstanding contributions to mathematics. He was to become Parish Priest at Birdbrook, Essex in\n1910\nand lived for the rest of his life in this village\n25\nmiles east of Cambridge. Together with his wife he lived\n[\n4\n]\n:-\n... in a typical country rectory, set in an old world garden full of colour and of great charm, where a warm welcome awaited a visitor from Cambridge or elsewhere, young or old, who sought out in this secluded corner of Essex a master of abstract algebra, and found more than a mathematician, a friend.\nIn\n1926\nYoung began to lecture again at Cambridge. W L\nEdge\nattended Young's lecture course which began in January of that year.\nEdge\nwrote:-\nI remember\n(\nwho could forget?\n)\nvery well my experiences of attending his first lectures. This was only a course of one lecture a week for one term; you can see for yourself how much he got through ... Doubtless it is all standard work to you, but it will be interesting to see how the old warrior entered the lists again and what he considered should be given to his first hearers. I went along on\n19\nJanuary\n1926\n, in my third year, just two terms before my Tripos, to Clare. ... there were eleven of us and I was the only undergraduate who ventured. Others in the class were, I think,\nCooper\n, now at Belfast;\nBroadbent\n, now at Greenwich; L H Thomas, who got a Smith's Prize and a Trinity Fellowship and went to America;\nDirac\ncertainly ... I remember the tall clerical figure entering the room, and his surprise at so large an audience ... And so to linear transformations and\nAronhold\n's symbolic notation.... At the end of the last lecture in March, Young said that he was so pleased that people had turned up that he would lecture again in the following term. And he was surprised, and I very embarrassed, when no other members of the class but myself showed up in April. It was my Tripos term but I was not going to miss his lectures...\nYoung's work had, and continues to have, a major impact on the\ntheory of groups\n, in particular on\ngroup representations\n.\nTurnbull\nwrites\n[\n4\n]\n:-\nFrom the outset Young's rapid and skilful handling of symbolic algebra bore all the signs of genius.\nIn\n1900\nhe introduced 'Young tableau', the method for which he is best remembered. He wrote a series of papers\nOn quantitative substitutional analysis\nwhich arose out of the classical theory of invariants and contained his results in this area. I\n[\nEFR\n]\nhave just attended the conference Groups-St Andrews\n2001\nin Oxford where one of the main speakers was showing how he was using Young tableaux in his latest research.\nBurnside\n,\nFrobenius\nand\nWeyl\nsaw the power of Young's methods.\nBurnside\n, as referee of Young's papers, suggested how the papers could be written to emphasise their impact on group theory and he pointed Young towards the papers of\nFrobenius\nand\nSchur\n. Young did not read German easily and it was some years before he fully understood the work of\nFrobenius\n. This resulted in a delay in Young obtaining results on the representation theory of the symmetric group.\nFrobenius\nused Young tableaux for the first time in\n1903\nwhen he investigated representations of the symmetric group but it was not until\n1906\nthat Young learnt of\nFrobenius\n's applications of his methods. In\n1927\nYoung published further work now extending what\nFrobenius\nhad done and relating it to his own work. He introduced what he called 'standard forms' which improved the efficiency of his methods. He was very pleased to find\nFrobenius\nusing his ideas. He wrote:-\nI am delighted to find someone else really interested in the matter. The worst of modern mathematics is that it is now so extensive that one finds there is only about one person in the universe really interested in what you are...\nWeyl\nalso began to make use of Young's ideas and Young tableau appear in his famous book\nTheory of groups and quantum mechanics\n. In\n1934\nYoung realised the significance of the sequence in which the standard tableau can be written and the following year he again related his work to that of\nFrobenius\nand\nSchur\n. His ninth\n(\nand final\n)\npaper\nOn quantitative substitutional analysis\nwas published in\n1952\n, eleven years after his death.\nG de B Robinson\n, who edited this paper, writes in the introduction on Young's methods of working\n[\n8\n]\n:-\nYoung's habits of working were systematic and consistent throughout his life. Unable to devote his whole time to mathematics, he could lay down a piece of work and pick it up again after a lapse of time with little apparent loss of continuity. He worked on different aspects of what he called 'Substitutional analysis' and filled numerous folders designated\nA\n−\nZ\n,\nA\n2\n,\nA\nB\n,\n.\n.\n.\n,\n[\nA\nu\nx\nA\n]\n,\nB\n2\nA - Z, A^{2}, AB, ..., [Aux A], B^{2}\nA\n−\nZ\n,\nA\n2\n,\nA\nB\n,\n.\n.\n.\n,\n[\nA\nu\nx\nA\n]\n,\nB\n2\n, and BC. As a subject developed he would write a paper on it including material, it may be, from different folders, but destroying the final draft and typescript after the paper appeared in print. It appears, however, that he kept his folders intact throughout the greater part of\n50\nyears, though he only dated work done in the last few years of his life in any consistent manner.\nThe three folders\n[\nA\nu\nx\nA\nAux A\nA\nu\nx\nA\n]\n,\nB\n2\nB^{2}\nB\n2\nand\nB\nC\nBC\nB\nC\ncontain material he worked on during the last year of his life. The final folder\nB\nC\nBC\nB\nC\ncontains the beginnings of a project started two weeks before his death aimed at making a systematic study of the representation theory of subgroups of the symmetric group.\nWe should not give the impression that Young only contributed to group representations. He studied other mathematical topics and the breadth of his interests are illustrated by the fact that he was also an inventor. He invented an electric motor to pump water. In\n1918\nhe patented a generator which converted mechanical energy into high frequency electric currents which could be used for wireless telegraphy. He patented another generator in\n1919\nbut these were never developed commercially.\nAmong the honours that Young received for his mathematical contributions we should mention that in\n1931\nhe was awarded an honorary degree from the University of St Andrews and in\n1934\nhe was elected a Fellow of the\nRoyal Society of London\n.\nYoung's wife Edith gave details of his death. She wrote\n[\n1\n]\n:-\n... he was out with me on the Wednesday afternoon visiting in the Parish. He seemed as usual when suddenly after tea he was taken with a pain in the side. The doctor had him rushed off to hospital, operated on him but he never really came round and passed away on Sunday morning. I know it was what he would have wished - to die at his post.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Bromwich",
    "Whittaker",
    "Edge",
    "Cooper",
    "Broadbent",
    "Dirac",
    "Aronhold",
    "theory of groups",
    "group representations",
    "Turnbull",
    "Burnside",
    "Frobenius",
    "Weyl",
    "Schur",
    "G de B Robinson",
    "Royal Society of London"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}