{
  "nome_completo": "Alfréd Rényi",
  "nome_curto": "Alfréd Rényi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Renyi/",
  "data_nascimento": "30 March 1921",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "1 February 1970",
  "local_morte": "Budapest, Hungary",
  "summary": "Alfréd Rényi was a Hungarian mathematician who worked in probability theory, combinatorics, graph theory and number theory.",
  "biografia": "Alfréd Rényi\n's parents were Artur Rényi, a mechanical engineer and linguist of wide learning, and Barbara Alexander, the daughter of Bernát Alexander, the professor of philosophy and aesthetics at Budapest University. Both of Alfréd's parents were Jewish, a fact which, sadly, was highly significant for those living in Hungary through this period of anti-Semitic fervour. His paternal grandfather, Artur's father, was born in Germany with the family name of Rosenthal. However he left Germany and, after spending a while as a sheep farmer in Australia, settled in Hungary. He changed his name from Rosenthal to Rényi and made his fortune from a walking stick factory which he founded. One of Alfréd's uncles was Franz Gabriel Alexander, the famous psychoanalyst.\nAlfréd, his parents' only child, received a literary, rather than scientific, schooling at a\nGymnasium\nin Budapest. Throughout his life he had a love of literature and was fascinated by the works of the philosophers of ancient Greece. This, perhaps, was partly inherited from his mother and partly a result of his school education. He also began to take an interest in astronomy and this interest led him to take an interest in physics. To understand physics he had to master some difficult mathematics and it soon became clear to him that this was the right subject for him to study at university. Another factor in his move towards mathematics was his outstanding mathematics teacher at the Gymnasium,\nRózsa Péter\n. He graduated from the Gymnasium in\n1939\nas the best student in his year but, because of his Jewish parents, he was unable to study at Budapest University due to the racial laws imposed by the Hungarian state. However, he was still able to show his outstanding abilities by receiving an honorable mention in both a mathematics competition and in a Greek competition in the autumn of\n1939\n. At this stage Rényi began work at the Ganz Shipyard and Crane Factory. He was a labourer there for about six months until allowed to enter the University of Budapest in October\n1940\nto study mathematics and physics. His undergraduate lecturers included\nLipót Fejér\nand\nPaul Turán\nwho writes\n[\n19\n]\n:-\nI first met him in October or November of\n1941\nwhen he ... started regularly to attend a lecture series I held to June of\n1942\n. The main topic of discussion was number theory ...\nIn May\n1944\nRényi graduated from Budapest University but, in the following month, he was forced into a Fascist Labour Camp but somehow managed to escape\n[\n19\n]\n:-\nFortunately, his company was not taken from Hungary immediately. When the order to evacuate to the West did come, Rényi escaped, and lived in Budapest using false documents.\nHe obtained false papers and hid for six months managing to avoid capture. During this time his parents were held prisoners in the Budapest ghetto. Alfréd rescued them with an extreme act of bravery\n[\n20\n]\n:-\nAlfréd got hold of a soldier's uniform, walked into the ghetto, and marched his parents out. ... It requires familiarity with the circumstances to appreciate the skill and courage needed to perform these feats.\nTurán\nwrites\n[\n19\n]\n:-\nWhenever I met him during those days, I was amazed at his level-headedness and courage.\nNear the end of World War II in March\n1945\n, Rényi obtained a Ph.D. from the University of Szeged, with\nFrigyes Riesz\nas his thesis advisor, for a thesis on\nCauchy\n-\nFourier\nseries. Results from his doctoral thesis appeared in the paper\nOn the summability of Cauchy-Fourier series\n(1950)\n. He left Szeged after the award of his doctorate and returned to Budapest where he took on various statistics jobs. During his time in Budapest, he married Katalin Schulhof\n(1924\n-\n1969)\nin\n1946\n. They had one child, a daughter Zsuzsa born in\n1948\n. Katalin\n(\nknown also as Catherine or Kató\n)\nwas also a mathematician and wrote\n21\npapers, some with her husband. As well as undertaking research in analysis she was very successful in encouraging young university students in their research in all branches of mathematics. The\nJános Bolyai Mathematical Society\nawards the Kató Rényi Memorial Prize in her honour.\nRényi went to Russia as a postdoctoral student and, between October\n1946\nand June\n1947\n, worked with\nYuri Vladimirovich Linnik\non the theory of numbers, in particular working on the\nGoldbach conjecture\n[\n19\n]\n:-\nHis development during those months was nothing short of phenomenal. By an effort of the will, he had effaced his memories of the war years and of the forced-labour camp, to centre now on his work all the fiery energy of his youth and of his exceptional gifts of understanding and concentration.\nHe discovered methods described by\nTurán\nas:-\n... at present one of the strongest methods of\nanalytical number theory\n.\nThe results Rényi obtained in Russia were announced in the paper\nOn the representation of an even number as the sum of a single prime and a single almost-prime number\n(\nRussian\n)\n(1947)\n. L Schoenfeld summarises these results as follows:-\nA set of integers\nS\nS\nS\n, with the property that there exists an absolute constant\nK\nK\nK\nsuch that each\nx\nx\nx\nin\nS\nS\nS\nhas at most\nK\nK\nK\ndistinct prime factors, is called an almost-prime set. Each\nx\nx\nx\nin\nS\nS\nS\nis called an almost-prime number. The author indicates the proof, to be given in detail elsewhere, that each even integer is the sum of an almost-prime number\n(\ntaken from a fixed set\nS\nS\nS\n)\nand a prime number. He also states that he can prove that there exist infinitely many primes\np\np\np\nsuch that\np\n+\n2\np + 2\np\n+\n2\nis almost-prime\n(\nbeing in a fixed set\nS\n∗\nS^{*}\nS\n∗\n)\n. The first result, regarding the representation of an even number, is an approximation to the unproved\nGoldbach conjecture\nand supersedes an earlier proof of the same proposition by\nEstermann\n(1932)\nwhich made use of an unproved generalized\nRiemann\nhypothesis for all\nDirichlet\nL\nL\nL\n-series. The second result is an approximation to the conjecture of the existence of infinitely many\ntwin primes\nand is apparently a new result.\nIn the following year Rényi published full proofs of these results and, in addition, noted that his techniques also show that every odd number is the sum of a prime and twice an almost-prime and that for each fixed integer m\n(\npositive or negative\n)\nthere exists an infinity of primes\np\np\np\nsuch that\np\n+\nm\np + m\np\n+\nm\nis almost prime.\nOther papers published early in his career include:\nOn a Tauberian theorem of O Szász\n(1946)\n;\nIntegral formulae in the theory of convex curves\n(1947)\n;\nOn the minimal number of terms of the square of a polynomial\n(1947)\n;\nOn some new applications of the method of Academician I M Vinogradov\n(1947)\n;\n(\nwith\nYu V Linnik\n)\nOn certain hypotheses in the theory of Dirichlet characters\n(\nRussian\n)\n(1947)\n. After returning to Hungary he was appointed as a\nPrivatdocent\nand Assistant Professor in October\n1947\nat the University of Budapest. Between\n1949\nand October\n1950\nhe was an Extraordinary Professor at the university in Debrecen. He was elected to the\nHungarian Academy of Sciences\nin\n1949\nas a corresponding member, In\n1950\nhe was appointed as the Director of the new Institute of Applied Mathematics of the\nHungarian Academy of Sciences\n. In\n1952\n, in addition to his other roles, he was appointed as a professor at the Department of Probability and Statistics of\nEötvös Loránd\nUniversity in Budapest.\nRényi worked on\nprobability theory\nwhich was to be his main research topic throughout his life, but his interests were broad and also covered statistics, information theory, combinatorics, graph theory, number theory and analysis. His list of publications contains, remarkably,\n355\nitems.\nDavid Kendall\nwrites\n[\n1\n]\n:-\nIn the hands of writers like\nLinnik\n,\nErdős\nand Rényi, the theory of numbers is not clearly distinguished from the theory of probability. Each lends techniques to the other, and important problems lie along their common frontier. Thus, when Rényi is referred to as a great applied probabilist, this is partly because of his interests in probability applied to other parts of mathematics.\nHe published joint work with\nErdős\non random graphs, the most important being\nOn the evolution of random graphs\n(1960)\n, and also solved an outstanding conjecture concerning random space filling curves in\nOn a one-dimensional problem concerning random space filling\n(1958)\n. He also produced a number of outstanding books including\nThe calculus of probabilities\n(\nHungarian\n)\n(1954)\n.\nEugene Lukacs\nwrites:-\nProbability theory and its applications had been neglected in the curriculum of Hungarian universities until very recently when the author started to lecture regularly on these topics. He had therefore to prepare mimeographed notes for his students which lead, after repeated revisions, to the publication of the present book. It is thus the first modern Hungarian text book on probability theory and offers an excellent introduction into this field. ... It is regrettable that this book is useful only to Hungarian students; it would deserve to be added to the foreign language publications of the\nHungarian Academy of Sciences\n.\nIndeed in\n1962\na thoroughly revised and completely reorganized German edition was published under the title\nWahrscheinlichkeitsrechnung. Mit einem Anhang über Informationstheorie\n. A French edition appeared in\n1966\nand an English edition, containing three new sections, was published as\nProbability theory\nin\n1970\n. Another book, also published in\n1970\n, was\nFoundations of probability\n. This book developed a totally different approach to probability, based on the concept of conditional probability space, from any other book previously published on the topic. This approach was based on a new system of axioms which Rényi had invented and presented in a lecture to the International Congress of Mathematicians held in Amsterdam from\n2\nSeptember to\n9\nSeptember\n1954\n.\nKnown to his many friends and colleagues by the nickname of 'Buba,' he often remembered as the author of the anecdote:-\n... a mathematician is a machine for converting coffee into theorems\nTurán\ndeveloped the anecdote further by describing weak coffee as fit only for lemmas. Rényi was a famous raconteur remembered for many performances of his dialogue, which he addressed to his daughter, on the nature of mathematics. In this style he published\nDialoge über Mathematik\nⓉ\n(\nDialogues on mathematics\n)\n(1967)\nand\nLetters on probability\n(\nHungarian edition\n1969\n, English translation\n1972)\n. This work is a fascinating semi-popular, semi-historical account of some of the early ideas on probability. Rényi adopts the style of presentation as a collection of\n(\nfictitious\n)\nletters from\nPascal\nto\nFermat\n. He assumes that the replies have been lost. To give a flavour of\nDialoge über Mathematik\nⓉ\n(\nDialogues on mathematics\n)\nwe quote what Rényi has\nArchimedes\nsay to King Hieron\n[\n2\n]\n:-\nMathematics is like your daughter Helena, who suspects every time a suitor appears that he is not really in love with her, but is interested in her only because he wants to be the son-in-law of the king. She wants a husband who loves her for her own beauty, her wit and charm, and not for the wealth and power he can get by marrying her. Similarly, mathematics reveals its secrets only to those who approach it with pure love, for its own beauty. Those who do this are, of course, also rewarded with results of practical importance. But if somebody asks at each step \"What can I profit by this?\" he will not get far.\nRényi received many honours for his achievements and, had he not died at the tragically young age of\n48\n, he would have undoubtedly have received many more. He was twice awarded the Kossuth Prize by the Hungarian Government, was elected vice-president of the International Statistical Institute, served as he was secretary of the\nJános Bolyai Mathematical Society\n(1949\n-\n55)\n, and was invited to serve on the editorial boards of eight journals. After his sudden death, material was found for a book on which he was working\nDiary on information theory\n. Gyula Katona, using Rényi's notes for the rest of the book, completed it and it was published first in Hungarian, then in German in\n1982\n, and in English in\n1984\n, fourteen years after Rényi's death.\nDavid Kendall\nin\n[\n10\n]\ngives us a little more understanding into Rényi's ways of working. He was:-\n... a pure mathematician of massive achievements and towering stature in the classical fields of number theory and analysis. Rényi possessed also an inquisitive and dogged interest in all the phenomena of the world about him, and in all the scholarly activities of his colleagues, whether scientific or humane, and this unique combination of powers and interests enabled him to build up a research institute in which the criterion for acceptability of a subject for investigation was 'does there exits at least one mathematician with a genuine interest in this topic'? Once accepted as appropriate, however, the topic would be pursued in a thoroughly professional way; the argument would be followed wherever it led, and buttressed by whatever mathematical means seemed appropriate, however exotic or sophisticated.\nFinally let us quote\nTurán\nconcerning Rényi's leisure interests\n[\n19\n]\n:-\nRényi's zest for life was by no means exhausted in his many-sided intellectual activities and involvement in public affairs. He was fond of rowing and swimming in the Danube in summer and of skiing in winter. With his wife and daughter Zsuzsa he frequented concerts and theatres; at the parties they gave in their home, Rényi entertained his friends with witty anecdotes and with playing the piano. Those entering his study were welcomed by bookshelves jammed to the ceiling. The books, manuscripts and notes scattered on his desk made the visitor feel that he had entered the scene of creative, productive activity, an activity that Alfréd Rényi carried on unabated to the last day of his life.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Rózsa Péter",
    "Lipót Fejér",
    "Paul Turán",
    "Turán",
    "Frigyes Riesz",
    "Cauchy",
    "Fourier",
    "János Bolyai Mathematical Society",
    "Yuri Vladimirovich Linnik",
    "Goldbach conjecture",
    "analytical number theory",
    "Estermann",
    "Riemann",
    "Dirichlet",
    "twin primes",
    "Yu V Linnik",
    "Privatdocent",
    "Hungarian Academy of Sciences",
    "Eötvös Loránd",
    "probability theory",
    "David Kendall",
    "Linnik",
    "Erdős",
    "Eugene Lukacs",
    "Pascal",
    "Fermat",
    "Archimedes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}