{
  "nome_completo": "Alfred Loewy",
  "nome_curto": "Alfred Loewy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loewy/",
  "data_nascimento": "20 June 1873",
  "local_nascimento": "Rawitsch, Germany (now Rawicz, Poland)",
  "data_morte": "25 January 1935",
  "local_morte": "Freiburg im Breisgau, Germany",
  "summary": "Alfred Loewy was a German mathematician who worked on linear groups, the algebraic theory of differential equations and actuarial mathematics.",
  "biografia": "Alfred Loewy\n's father was Hermann Loewy and his mother was Lina Löwental. It was a Jewish family and Alfred was brought up in a strict orthodox manner. Alfred was born two years after the unification of Germany, and with that came full emancipation of Jews. It might have looked as if this was a good beginning, but sadly for the Loewy family anti-Semitism became an organized movement in Germany with its own political parties. Discrimination against Jewish families, especially those with an orthodox lifestyle, became widespread and Loewy would encountered increasing discrimination throughout his life.\nLoewy studied at the universities of Breslau, Munich, Berlin and Göttingen between\n1891\nand\n1895\n. He was awarded a doctorate by the University of Munich in\n1894\nfor his thesis\nÜber die Transformation einer quadratischen Form in sich selbst mit Anwendungen auf die Linien- und Kugelgeometrie\nⓉ\n(\nOn the transformation of a quadratic form in itself with applications to linear and spherical geometry\n)\nwhich he had written with C L Ferdinand\nLindemann\nand Gustav Bauer as his advisors. Then, from\n1897\n, Loewy taught at the University of Freiburg having submitted his\nhabilitation\nthesis. His work at that time concerned the theory of linear substitutions and he published two papers\nZur Theorie der linearen Substitutionen\nⓉ\n(\nOn the theory of linear substitutions\n)\nin\n1896\nand\n1897\n. He was appointed as an extraordinary professor at Freiburg in\n1902\n. This made him secure enough financially to marry and in that year he married Therese Neuburger. Loewy became an honorary ordinary professor at Freiburg in\n1916\nbefore his appointment as ordinary professor in\n1919\n. He was thesis advisor to a number of famous students, in particular\nWolfgang Krull\n, who  was awarded his doctorate in\n1922\n, and\nFriedrich Karl Schmidt\n, who was awarded his doctorate in\n1925\n. Other algebraists who spent some time in Freiburg working under Loewy are\nE Witt\n,\nBernhard Neumann\n,\nR Brauer\n,\nR Baer\n, and\nA Scholz\n.\nAnti-Semitism increased in Germany following the end of World War I. Anti-Semites joined forces with nationalists in attempting to blame the Jews for Germany's defeat. Increasing discrimination was not the only source of difficulty in Loewy's life. Already by\n1916\nhe had lost the sight of one eye. His eyesight began to fail completely from about\n1920\nand he became totally blind before his death after a failed operation in\n1928\nleft his other eye completely blind also. Despite these severe health problems Loewy continued to carry out his teaching duties. He could battle against blindness and against the hurt of anti-Semitism directed at him, but the final blow came in\n1933\nwhen anti-Semitism became part of the law of the land.  On\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law was passed that provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Loewy was forced to retire in\n1933\nunder the Civil Service Law.\nLoewy worked on linear\ngroups\n, the algebraic theory of\ndifferential equations\nand actuarial mathematics. He published\n70\npapers and a number of books. Among his papers published in\nMathematische Annalen\nare:\nÜber bilineare Formen mit conjugirt imaginären Variablen\nⓉ\n(\nOn bilinear forms with imaginary conjugate variables\n)\n(1898)\n;\nÜber die Charakteristik einer reelen quadratischen Form von nicht verschwindender Determinante\nⓉ\n(\nOn the characteristic of a real quadratic form with non-vanishing determinant\n)\n(1899)\n;\nZur Theorie der Gruppen linearer Substitutionen\nⓉ\n(\nOn the theory of groups of linear substitutions\n)\n(1900)\n;\nÜber eine besondere Gattung endlicher discreter Gruppen\n(1901)\n;\nZur Theorie der endlichen continuirlichen Transformationsgruppen\nⓉ\n(\nOn the theory of finite continuous transformation groups\n)\n(1901)\n; and\nÜber reduzible lineare homogene Differentialgleichungen\nⓉ\n(\nOn reducible linear homogeneous differential equations\n)\n(1903)\n. He also published papers\n(\nin German\n)\nin the\nTransactions of the American Mathematical Society\nsuch as:\nOn the reducibility of real groups of linear homogeneous substitutions\n(1903)\n;\nOn group theory, with applications to the theory of linear homogeneous differential equations\n(1904)\n; and\nOn completely reducible groups that belong to a group of linear homogeneous substitutions\n(1905)\n. He also edited German translations of works by\nAbel\n,\nFourier\n,\nCharles Sturm\nand\nÉtienne Pascal\n.\nAmong Loewy's most famous books are\nLehrbuch der Algebra\nⓉ\n(\nTextbook of algebra\n)\n(1915)\nand\nMathematik des Geld- und Zahlungsverkehrs\nⓉ\n(\nMathematics of money and payments\n)\n(1920)\n. The first of these was one of the first works to introduce into Germany the methodology, the terminology and the achievements of postulational analysis as it was being developed in the United States.\nLet us now mention the connection between Loewy and\nFraenkel\n. Loewy was\nFraenkel\n's uncle by marriage and he exerted a large influence on\nFraenkel\n's career in its early stages. It was Loewy who persuaded\nFraenkel\nto travel to Marburg to study under\nHensel\nand it was Loewy who had helped\nFraenkel\npublish his early work in\nCrelle\n's journal with a paper about the date of Easter. But the mathematical topics\nFraenkel\nstudied were also influenced by Loewy whose interest in the study of axiomatic systems encouraged a similar interest by\nFraenkel\n. The relationship worked both ways round, however, and Loewy's\nGrundlagen der Arithmetik\nⓉ\n(\nFoundations of arithmetic\n)\n, published in\n1915\n, was prepared with\nFraenkel\n's assistance. Loewy mentioned in this work that in the system of integers, the product of any two integers is zero, if and only if one of them is zero. Such ideas clearly influenced\nFraenkel\nto introduce the notion of a ring, and in particular zero-divisors in rings.",
  "matematicos_citados_na_biografia": [
    "Lindemann",
    "habilitation",
    "Wolfgang Krull",
    "Friedrich Karl Schmidt",
    "E Witt",
    "Bernhard Neumann",
    "R Brauer",
    "R Baer",
    "A Scholz",
    "groups",
    "differential equations",
    "Abel",
    "Fourier",
    "Charles Sturm",
    "Étienne Pascal",
    "Fraenkel",
    "Hensel",
    "Crelle"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}