{
  "nome_completo": "Alfred Tauber",
  "nome_curto": "Alfred Tauber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tauber/",
  "data_nascimento": "5 November 1866",
  "local_nascimento": "Pressburg (now Bratislava), Slovakia",
  "data_morte": "26 July 1942",
  "local_morte": "Theresienstadt, Germany (now Terezin, Czech Republic)",
  "summary": "Alfred Tauber was a Slovakian-born mathematician, known for his contribution to mathematical analysis and to the theory of functions of a complex variable.",
  "biografia": "Alfred Tauber\nstudied at the University of Vienna, beginning his course in\n1884\n. Although his main interests were in mathematics, he studied a wide range of topics including physics, philosophy and political economy. He undertook research for his doctorate being advised by Gustav von Escherich but he was also strongly influenced by\nEmil Weyr\n. He presented his doctoral thesis\nÜber einige Sätze der Gruppentheorie\nⓉ\n(\nOn several theorems of group theory\n)\nto the University of Vienna in\n1888\nand was awarded the degree. Tauber's intention was to publish his thesis but in fact this never happened. He continued to study at Vienna working towards his\nhabilitation\n. In\n1891\nhe completed his dissertation\nÜber den Zusammenhang des rellen und imaginären Teiles einer Potenzreihe\nⓉ\n(\nOn the relation of the real and imaginary part of a power series\n)\n. This was published as a\n40\npage paper in\nMonatsh. Math. Phys\n. in the same year and Tauber began to lecture in Vienna as a\nprivatdozent\n.\nHe lectured in Vienna on the theory of series, trigonometric series, and\npotential theory\n. He published papers such as\nÜber die Neumann'sche Methode des arithmetischen Mittels\nⓉ\n(\nOn Neumann's method of the arithmetic mean\n)\n(1894)\n,\nÜber das Poisson'sche und das demselben conjugierte Integral\nⓉ\n(\nOn Poisson's and the same integral conjugated\n)\n(1895)\n,\nÜber die Newton'sche Näherungsmethode\nⓉ\n(\nOn the Newtonian approximation method\n)\n(1895)\n, and\nDruckfehlerberichtigung: über das Poisson'sche und das demselben conjugierte Integral\nⓉ\n(\nMisprint correction: On Poisson's and the same integral conjugated\n)\n(1895)\n. In\n1895\nhe began to lecture on the mathematics of insurance. This was a topic which was of little interest to Tauber, yet he was still a privatdozent so needed to earn money and his lectures on the mathematics of insurance gave him a monthly salary. He was able to supplement his income still further in\n1899\nby giving lectures on the mathematics of insurance at the Technical University of Vienna. He was appointed as an Honorardozent at the Technical University in\n1901\n. Tauber's main income, however, came from his position as Head of Mathematics at the Phönix Insurance Company in Vienna.\nTauber's lack of success in being given a professorial position was certainly not due to any lack of mathematical ability, for he continued to publish a series of high quality papers. For example\nÜber das specielle Zweitheilungsproblem der hyperelliptischen Functionen\nⓉ\n(\nOn the special bipartition problem of hyperelliptic functions\n)\n(1896)\n,\nÜber das Potential einer Doppelbelegung\nⓉ\n(\nOn the potential of a double assignment\n)\n(1897)\n,\nEin Satz aus der Theorie der unendlichen Reihen\nⓉ\n(\nA theorem on infinite series\n)\n(1897)\n,\nÜber die Weierstrass'sche Function\nⓉ\n(\nOn the Weierstrass Function\n)\n(1897)\n,\nÜber einige Sätze der Potentialtheorie\nⓉ\n(\nA few remarks about potential theory\n)\n(1898)\n. Only in\n1908\ndid Tauber get a position as assistant lecturer at the University of Vienna, and at this stage he resigned at head of mathematics at the Phönix Insurance Company, although he remained as an advisor to the company over the next four years. For more on Tauber's work for the Phönix Insurance Company, see\n[\n4\n]\n.\nTauber's research was on function theory and potential theory. He obtained important results on divergent series and the name 'Tauberian Theorems'  was coined by\nHardy\nand\nLittlewood\n. This all came out of his work on\nAbel\n's limit theorem which dated back to\n1826\n. The conditions which Tauber gave to allow him to prove the converse of\nAbel\n's limit theorem on power series are now known as 'Tauberian conditions' and appeared in\nEin Satz aus der Theorie der unendlichen Reihen\nⓉ\n(\nA theorem on infinite series\n)\n(1897)\n. This is by far his most significant piece of work. Further major results in this area were obtained by\nNorbert Wiener\n. Of lesser importance is Tauber's work on\ndifferential equations\nand the\ngamma function\n, but let us give the title of one of his papers on this latter topic, namely\nüber die unvollständigen Gammafunktionen\n(1906)\n.\nAlthough, as we pointed out above, Tauber did not enjoy working on the mathematics of insurance, nevertheless he did produce important contributions to the area. In particular his papers\nÜber die Hypothekenversicherung\nⓉ\n(\nAbout  mortgage insurance\n)\n(1897)\nand\nGutachten für die sechste internationale Tagung der Versicherungswissenschaften\nⓉ\n(\nReport of the Sixth International Conference of Insurance Sciences\n)\n(1909)\ncontain his formulation of the Tisiko equation.\nHe was sent by the  Nazis to Theresienstadt concentration camp on\n28\nJune\n1942\n. Just after Tauber arrived the entire non-Jewish population of\n3\n,\n700\nof Theresienstadt was evacuated and he was one of\n53\n,\n000\ninhabitants of the camp. According to\n[\n4\n]\nhe was murdered on\n26\nJuly\n1942\n.",
  "matematicos_citados_na_biografia": [
    "Emil Weyr",
    "habilitation",
    "privatdozent",
    "potential theory",
    "Hardy",
    "Littlewood",
    "Abel",
    "Norbert Wiener",
    "differential equations",
    "gamma function"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}