{
  "nome_completo": "Alfredo Capelli",
  "nome_curto": "Alfredo Capelli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Capelli/",
  "data_nascimento": "5 August 1855",
  "local_nascimento": "Milan, Lombardo-Veneto (now Italy)",
  "data_morte": "28 January 1910",
  "local_morte": "Naples, Italy",
  "summary": "Alfredo Capelli was an Italian mathematician who worked on group theory and independently discovered Sylov's theorem.",
  "biografia": "Alfredo Capelli\nattended the University of Rome where, in the academic year\n1875\n-\n1876\n, he attended a course by\nGiuseppe Battaglini\non the theory of groups of substitutions. In this course\nBattaglini\nfollowed the approach given by\nCamille Jordan\nin his\nTraité des substitutions et des équations algebraique\nⓉ\n(\nTreatise on substitutions and  algebraic equations\n)\nwhich he published in\n1870\n.\nBattaglini\n[\n11\n]\n:-\n... advised the young Capelli to tackle problems on groups in his thesis. From this thesis sprang a huge memoir, appearing in the 'Giornale di matematiche' in\n1878\n.\nIn fact Capelli had published two notes on the theory of groups in the same journal two years earlier while he was working on his thesis supervised by\nBattaglini\n. These two notes, which were based on material from\nSerret\n's\nCours d'algèbre supérieure\nⓉ\n(\nCourse of higher algebra\n)\n, were entitled\nDimostrazione di due proprietà numeriche offerte dalla teoria delle sostituzioni permutabili con una sostituzione data\nⓉ\n(\nDemonstration of two numerical properties offered by the theory of permutations with substitution data\n)\nand\nIntorno ai valori di una funzione lineare di più variabili\nⓉ\n(\nOn the values  of a linear function of several variables\n)\n. His\n1878\npaper\nSopra l'isomorfismo dei gruppi di sostituzioni\nⓉ\n(\nOn the isomorphism of groups of substitutions\n)\nwas a major contribution of\n55\npages, essentially publishing the results from his thesis. It is a remarkable contribution which contains a proof of\nSylow\n's theorems and of Jordan's theorem on composition series. These were independent discoveries by Capelli since he was unaware of\nSylow\n's\n1872\npaper and\nNetto\n's\n1874\npaper where these results were first published. His proofs are interesting since they are quite different from those in\nSylow\n's and\nNetto\n's papers; in particular he gives a simpler proof of\nSylow\n's theorem. However, Capelli's paper also contains standard results later proved by\nFrobenius\nand\nBurnside\nwhich have been attributed to these later authors. Capelli's paper contains the following interesting observation on isomorphisms:-\nThe importance of the concept of isomorphism has already been emphasized and validated through applications, in such a way that, by reading the principles and considering the fertility of\nJordan\n's excellent treatise, I believed I had found in it the natural key for studying substitutions, especially when one does not wish to involve analysis.\nThe authors of\n[\n3\n]\ndiscuss why Capelli was unaware of\nSylow\n's results and why\nBurnside\nand other early\n20\nth\ncentury authors were unaware of Capelli's results about nilpotent groups and composition series.\nCapelli graduated from the University of Rome in\n1877\nand then continued to develop his mathematical skills working as\nFelice Casorati\n's assistant at the University of Pavia. He also spent time at the University of Berlin where he was influenced by\nKarl Weierstrass\nand\nLeopold Kronecker\n.\nCasorati\ncorresponded regularly with\nWeierstrass\nand had developed a strong link between Italian and German mathematicians so Capelli's visit to Berlin was a natural one in this context. Over this period, Capelli did not work on group theory but his interests had moved to the theory of algebraic forms. In\n1881\nhe was appointed as professor of Algebraic Analysis at the University of Palermo\n[\n4\n]\n:-\nIn\n1881\n, Capelli obtained the position of professor of algebra at the University of Palermo. There, he found a situation different from that in the rest of the Kingdom. In fact, in the mid-\n1870\ns, Sicily was still awaiting a sign of cultural renewal, while elsewhere in Italy, men such as\nCremona\n,\nBrioschi\n, and\nBetti\nwere almost concluding their radical reform of public education at all levels. In Palermo, the situation finally began to change in\n1878\nwith the arrival of\nCesare Arzelà\n(1847\n-\n1912)\n, who held the chair of algebra for two years, and of Capelli, who replaced\nArzelà\nwhen the latter moved to Bologna.\nIn\n1884\nCapelli published another major work on group theory\nSopra la composizione dei gruppi di sostituzioni\nⓉ\n(\nOn the composition of groups of substitutions\n)\n. In this he proved important results on nilpotent groups\n(\nalthough he did not use the term 'nilpotent group' which is modern\n)\n. In fact he gave what is today known as the '\nFrattini\nargument'. Why, one might ask is it not then known today as the 'Capelli argument'. In fact Capelli and\nFrattini\nhad both been students of\nBattaglini\n, with\nFrattini\ngraduating two years before Capelli. They had remained close friends sharing a common interest in group theory and communicating their results to each other. In\n1885\nFrattini\npublished\nIntorno alla generazione dei gruppi di operazioni\nⓉ\n(\nOn the generation of  groups of operations\n)\nand in this paper he defined the subgroup known today as the\nFrattini\nsubgroup. He also used the beautiful '\nFrattini\nargument', although he clearly stated that this was due to Capelli. Perhaps\nFrattini\nshould have used the term 'Capelli argument' himself as this would have guaranteed Capelli receiving credit. As it happens the name '\nFrattini\nargument' entered common use.\nWhile at Palermo, Capelli collaborated with Giovanni Garbieri\n(1847\n-\n1931)\nwho had succeeded\nGiusto Bellavitis\nat the University of Padua in\n1882\n. The results of their collaboration was the famous book\nCorso di analisi algebrica\nⓉ\n(\nCourse of algebraic analysis\n)\npublished in\n1886\n. Capelli had proved the theorem, known today as the\nRouché\n-Capelli theorem, which gives conditions for the existence of the solution of a system of linear equations. In\n1879\nFrobenius\ndefined the rank of a system of equations to be the maximal order of a nonzero minor. This left the concept of rank where it had long been, namely tied to the theory of\ndeterminants\n. In\n1886\nCapelli and Garbieri in\nCorso di analisi algebrica\nⓉ\n(\nCourse of algebraic analysis\n)\nshowed that a system of equations having rank k is equivalent to a triangular system with exactly k nonzero diagonal terms. Jean-Luc Dorier writes\n[\n1\n]\n:-\nIn their proof they applied a method of elimination using minors of the system as coefficients but, even if their approach used technical results of the theory of determinants, the new result they introduced pointed out an invariant linked to the rank which had nothing to do with determinants. This approach is very important in effective methods for solving systems of linear equations ...\nThen they pointed out, and proved, that the rank of the lines of a matrix is the same as the rank of its rows. They also showed that a system of equations is consistent if and only if the rank of the array of its coefficients is the same as the rank of the array augmented by the row of constant terms.\nIn\n1886\n, the year this book was published, Capelli entered the competition for the chair of algebra at the University of Naples. Filling chairs by competition was the standard method in Italy at this time. He was appointed and remained in Naples for the rest of his life. He published over\n80\npapers throughout his career so we can only mention a few examples to illustrate his contributions while in Naples. In\nSulla limitata possibilità di trasformazioni conformi nello spazio\nⓉ\n(\nOn the limited possibilities of conformal transformations of space\n)\n(1886)\n, Capelli gives a geometrical proof of\nLiouville\n's theorem on when conformal mappings are Möbius transformations. He published\nÜber die Zurückführung der Cayley'schen Operation W auf gewöhnliche Polar-Operationen\nⓉ\n(\nOn the recycling of Cayley's operation W on common polar operations\n)\nin\n1887\n, and then, in\nSur les opérations dans la théorie des formes algébraique\nⓉ\n(\nOn operations in the theory of algebraic forms\n)\n(1890)\n, Capelli gives generators for the centre of the enveloping algebra of the\nLie algebra\nG\nL\n(\nn\n)\nGL(n)\nG\nL\n(\nn\n)\n. In papers in\n1887\nand\n1890\n, Capelli introduced what became known as the 'Capelli identities' which involved equalities of differential operators. These played a major role in\nHermann Weyl\n's book\nThe Classical Groups\n. In\n1897\nCapelli, in a paper in the\nGiornale di matematiche\n, gave the following test for the symmetry of a polynomial:\nA necessary and sufficient condition for a polynomial to be symmetric is that it be unchanged by a cyclic interchange of all its variables, as well as by the cyclic interchange of all but one of its variables, the variables having the same relative positions in the two cycles.\nFinally we mention Capelli's\n1901\npaper\nSulla riduttibilità della funzione x\nn\n- A in un campo qualunque di razionalità\nⓉ\n(\nOn reducing the function x\nn\n- A in any rational field\n)\n.\nAs well papers, Capelli published a number of books. We have already mentioned his joint work with Giovanni Garbieri written in Palermo and published in\n1886\n. In the years he spent in Palermo, Capelli taught algebraic analysis for engineers. He gathered the content of the courses he had given on the subject in Palermo, and also those given later in Naples, and created the book\nIstituzioni di analisi algebrica\nⓉ\n(\nInstitutions of algebraic analysis\n)\n(\nfirst edition\n1894\n, second edition\n1898\n, third edition\n1902)\n. His other books include\nLezioni di algebra complementare ad uso degli aspiranti alla licenza universitaria Napoli\nⓉ\n(\nComplementary algebra lessons for use by candidates for the Naples university licence\n)\n(1895)\nand\nLezioni sulla teoria delle forme algebriche\nⓉ\n(\nLectures on the theory of algebraic forms\n)\n(1902)\n.\nCapelli continued to hold the chair of algebra in Naples until his death. In\n1894\n, on the death of\nBattaglini\n, Capelli took over the editorship of the\nGiornale di matematiche\nwhich, from that time on, became known as the\nGiornale di Matematiche di Battaglini\n. He continued in this role of editor until his death as the result of a heart attack in\n1910\n. He had been honoured with being elected to the\nAccademia nazionale dei Lincei\n, the Accademia nazionale dei Lombardo, the Accademia della Scienze di Napoli, and the Accademia della Scienze, Lettere e Belle Arti di Palermo.",
  "matematicos_citados_na_biografia": [
    "Giuseppe Battaglini",
    "Battaglini",
    "Camille Jordan",
    "Serret",
    "Sylow",
    "Netto",
    "Frobenius",
    "Burnside",
    "Jordan",
    "Felice Casorati",
    "Karl Weierstrass",
    "Leopold Kronecker",
    "Casorati",
    "Weierstrass",
    "Cremona",
    "Brioschi",
    "Betti",
    "Cesare Arzelà",
    "Arzelà",
    "Frattini",
    "Giusto Bellavitis",
    "Rouché",
    "determinants",
    "Liouville",
    "Lie algebra",
    "Hermann Weyl",
    "Accademia nazionale dei Lincei"
  ],
  "imagens": [
    "capelli.jpg"
  ]
}