{
  "nome_completo": "Ala al-Din Ali ibn Muhammed Ali Qushji",
  "nome_curto": "Ali Qushji",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Qushji/",
  "data_nascimento": "1403",
  "local_nascimento": "Samarkand, Timurid Empire, now Uzbekistan",
  "data_morte": "16 December 1474",
  "local_morte": "Constantinople, now Istanbul, Turkey",
  "summary": "Ali Qushji was an Islamic astronomer and mathematician, born in what is now Uzbekistan, who worked at observatories in Samarkand and Constantinople and whose results influenced Copernicus to produce his heliocentric system.",
  "biografia": "Ali Qushji\nwas the son of the royal falconer who trained birds such as falcons to catch pray. Let us begin by explaining that 'Ali Qushji' is basically a nickname meaning 'Ali the Falconer', the name Qushji having been given to the father of the subject of this biography. Although his name was Ala al-Din Ali ibn Muhammed, he is always known as Ali Qushji.\nSamarkand, the city where Ali Qushji was born, had been conquered by Tamerlane in\n1370\nand it became the capital of the Timurid Empire. Tamerlane was a patron of the arts and under his rule Samarkand became a centre for culture. Tamerlane died in\n1405\nand his son Shah Rukh, like his father a great patron of the arts and sciences, moved the capital of the Timurid Empire to Herat. Shah Rukh's son\nUlugh Beg\n, a grandson of Tamerlane, became the ruler of Samarkand in\n1409\n. Ali Qushji's father became\nUlugh Beg\n's falconer and Ali Qushji grew up in the atmosphere of culture, particularly mathematics and astronomy, around\nUlugh Beg\nwho was himself an outstanding mathematician and astronomer.\nUlugh Beg\nbuilt a Madrasa, a research and teaching institute, on Registan Square in Samarkand between\n1417\nand\n1420\n. Around sixty leading scholars were invited to the Madrasa by\nUlugh Beg\nwhere the leading teacher was\nQadi Zada al-Rumi\nand leading researcher was\nJamshid al-Kashi\n.\nUlugh Beg\nwas only\n17\nyears old when\nQadi Zada\n, who was\n46\nyears old, met him at Samarkand in\n1410\n.\nUlugh Beg\nwas far more interested in science and culture than in politics or military conquest but he was, nevertheless, deputy ruler of the whole empire and, in particular, sole ruler of the Mawaraunnahr region.\nQadi Zada\nbecame the leading teacher at\nUlugh Beg\n's Madrasa and he spend the rest of his life working there. He became one of Ali Qushji's teachers and\nUlugh Beg\n, who also taught at the Madrasa, became another. Ali Qushji was also taught by\nJamshid al-Kashi\nwho had been invited to the Madrasa by\nUlugh Beg\n. There is little doubt that\nal-Kashi\nwas the leading astronomer and mathematician at Samarkand and he was called the second\nPtolemy\nby an historian writing later in the same century. F Jamil Ragep writes\n[\n11\n]\n:-\nOne thing that seems to have been emphasised in the Samarqand School was the importance of the mathematical sciences. Biographical accounts of\nQadi Zada al-Rumi\n, for example, highlight his difficulties with his teacher al-Sayyid al-Sharlf al-Jurjani, who thought his student overly interested in mathematics at the expense of philosophy.\nJamshid al-Kashi\nis also noted for his embrace of the mathematical sciences, as we can see from his letters to his father, and\nUlugh Beg\n, like a number of Mongol/Turkic rulers, was predisposed to support the mathematical sciences; in addition, he himself became proficient in them. It was in this atmosphere that the young Ali Qushji was raised, and this seems to have had a profound effect upon his intellectual outlook.\nAfter his studies in Samarkand, Ali Qushji went to Kerman in Persia\n(\nnow in Iran\n)\n, where he conducted some research on storms in the Oman sea and wrote a work on this topic. Moving on, he reached Herat\n(\nnow in Afghanistan\n)\naround\n1423\n. Herat, under the rule of\nUlugh Beg\n's father, was, like Samarkand, a centre for scholarship with many leading artists, mathematicians and astronomers. There Ali Qushji taught astronomy, wrote a work about the Moon\n(\nExplanations on the Periods of the Moon\n)\nand another on mathematics. He then returned to Samarkand and presented\nExplanations on the Periods of the Moon\nto\nUlugh Beg\n. It is claimed that\nUlugh Beg\nfound the work so fascinating that he read the whole manuscript while standing up. He was certainly impressed with Ali Qushji's work and appointed him as an astronomer at the Samarkand Observatory, a vast observatory which was nearing completion at this time.\nThe Samarkand Observatory became the world-leading observatory of its day.\nUlugh Beg\nappointed around sixty astronomers to the observatory including Ali Qushji,\nQadi Zada al-Rumi\nand\nJamshid al-Kashi\n. It was not until\nTycho Brahe\nset up his observatory at Uraniborg about\n150\nyears later, that the world had a more impressive observatory than that at Samarkand. The Observatory was a three-storey cylindrical building covered with glazed tiles which had been designed to house three enormous astronomical instruments. The main instrument, a large part of which has survived, in now called the Fakhri sextant\n[\n15\n]\n:-\nThe so-called \"sextant\" obviously would have extended well above the ground ... and likely was closer to being a quadrant. ... the instrument \"was by far the largest meridian instrument ever built.\" Fragments of the curved measuring track have survived with markings for around\n20\ndegrees; this is about the highest point that observations likely would have been made. The \"sextant\" would have been used to measure the angle of elevation of major heavenly bodies, especially at the time of the winter and summer solstices. Light from the given body, passing through a controlled opening, would have shone on the curved track, which is marked very precisely with degrees and minutes. \"It could achieve a resolution of several seconds of arc - on the order of a six-hundredth of a degree ... . It is not clear whether more than the sun and moon could have been measured in this fashion, since planets, for example, would not have cast sufficient light. The observatory was equipped with a variety of other instruments, which probably accounted for the largest part of its scientific measurement.\nAli Qushji worked at the Samarkand Observatory until\n1449\nwhen, following a civil war,\nUlugh Beg\nwas assassinated.\nBeg\n's political skills were not up to his mathematical skills and, after his father's death in\n1447\n, he was unable to retain power despite being an only son. He was eventually put to death at Samarkand at the instigation of his own son Abd al-Latif. The Samarkand Observatory did not survive long after\nUlugh Beg\nwas assassinated as the building was destroyed, its contents were stolen and the astronomers were driven away. Ali Qushji left Samarkand and went to Herat where he had been working before he was employed at the Samarkand Observatory. He wrote works which he presented to the Timurid Sultan Abu Said. In\n1469\n, however, Abu Said was defeated by Uzun Hasan and Ali Qushji moved to Tabriz, the capital of the Qara Qoyunlu state in Azerbaijan. There he met the ruler of the Qara Qoyunlu state, Uzun Hasan, who asked Ali Qushji to go to Constantinople to act as a good will ambassador between himself and Mehmed II, who had captured Constantinople in\n1451\n. Mehmed II welcomed Ali Qushji, who arrived in Constantinople in\n1470\n, and offered him a position in Constantinople as a teacher at the Madrasa.\nThe position in Constantinople looked very attractive to Ali Qushji but he had promised Uzun Hasan that he would carry out his duty as a good will ambassador and return to Tabriz to report on his mission. He explained to Mehmed II\n[\n7\n]\n:-\nI would like to go back to Tabriz if you let me. The true reason of my existence here is to be the good-will Messenger of Akkoyunlu Ruler, Sultan Hasan. It is necessary for me before I accept the gracious invitation of my Sultan to turn back and inform the person who sent me here and who trusted me that I carried my duty with a good result ...\nThis was agreed and Ali Qushji returned to Tabriz and reported the success of his mission to Uzun Hasan. He then made preparations to move to Constantinople\n[\n5\n]\n:-\n... around\n1472\nAli Qushi, together with his family and students, left permanently for Constantinople ... When Ali Qushji and his entourage approached Constantinople, Sultan Mehmed sent a group of scholars to welcome them. Sources say that in crossing the Bosporus to Constantinople, a discussion ensued about the causes of its ebb and flow. Upon arrival in Constantinople, Ali Qushji presented his mathematical work 'al-Muhammadiyya fi al-hisab' to the sultan, which was named in his honour.\nOnce in Constantinople, Ali Qushji taught at the Sahn-i Thaman Madrasa. He was then made head of the Ayasofya Madrasa but his time in that role was short lived since he died suddenly two years after settling in Constantinople. He was buried in the cemetery of the Eyyub mosque. Despite his short time in Constantinople, he was highly successful there\n[\n5\n]\n:-\nIn this brief period Ali Qushji educated and influenced a large number of students, who, along with his writings, were to have an enormous impact on future generations.\nLet us now mention some of the many contributions to mathematics and astronomy that Ali Qushji made while working at the Samarkand Observatory and at the Constantinople Madrasas. We give information first about what must be considered his most important contribution, namely the belief that it was Ali Qushji's results that, indirectly, influenced\nCopernicus\nallowing him to put forward his heliocentric theory. This is argued convincingly in\n[\n11\n]\nand is now widely accepted. We give a few extracts from the introduction of\n[\n11\n]\nto explain how Ali Qushji may have had a vital role in the heliocentric revolution:-\nIn\n1973\n, Noel Swerdlow presented a new and significant reconstruction of how\nCopernicus\narrived at the heliocentric theory. This reconstruction was based upon several bits of newly-interpreted information, most importantly a set of notes in\nCopernicus\n's hand contained in an Uppsala University manuscript. These notes provided compelling evidence that\nCopernicus\nhad transformed\nPtolemy\n's epicyclic models of the planets into eccentric models as a first step in developing a Sun-centred astronomy. But this transformation depended upon a general proposition that one could indeed convert all the epicycle models into eccentric ones. Curiously,\nPtolemy\ndenied this, claiming in Book XII of the Almagest that this was possible only for the outer planets\n(\nMars, Jupiter, and Saturn\n)\nbut not the inner ones\n(\nMercury and Venus\n)\n. ...\n... it would seem that no one else recognised this until the fifteenth century. Swerdlow found what he believed to be the source for the propositions\nCopernicus\nneeded to begin his conversions, namely Book XII, Chapters I and\n2\nof\nRegiomontanus\n's 'Epitome of the Almagest'. In Chapter\n2\n,\nRegiomontanus\ngives a brief sketch and proof of the crucial theory for the inner planets, which would allow\nCopernicus\nto convert all the planets from epicyclic to eccentric models. Though\nCopernicus\nis sparing in his references and nowhere cites\nRegiomontanus\nfor these propositions, his use of the 'Epitome' is well-documented, and there would seem to have been no other European source that he could have depended upon.\nWhatever subsequent use was made of them,\nRegiomontanus\n's own motivation for including these propositions at the beginning of Book XII has remained unclear. ... What is especially odd about\nRegiomontanus\n's interest is that it is apparently so unprecedented. Neither in Europe nor in the Islamic world does this eccentric alternative alluded to by\nPtolemy\nseem to have generated much interest. And the motivation to extend this alternative to the lower planets, after being rejected by the great authority himself, is even more puzzling. Finally, there is the odd way in which\nRegiomontanus\npresents the two propositions. He himself gives no motivation - he just presents them. There is no mention of\nPtolemy\n, no statement that\nPtolemy\nwas wrong, no explanation of why\nPtolemy\nmade his mistake, no claim of credit.\nOne possibility is that\nRegiomontanus\ndoes not claim credit because he was not in fact the originator of the proposition. Indeed, it would seem, based on evidence presented in the sequel, that an older contemporary of\nRegiomontanus\nnamed Ali Qushji may well have been the discoverer of this crucial proposition and that\nRegiomontanus\nlearned of it either while in Italy or through the intermediation of Cardinal Bessarion , who had originally suggested to\nRegiomontanus\nand his collaborator\nGeorg Peurbach\nthat they write the 'Epitome'.\nMost readers of this journal will be acquainted with\nRegiomontanus\nand\nPeurbach\n, and perhaps even Bessarion, but Ali Qushji is most likely an unknown figure. This is regrettable since he is, at least in my opinion, one of the major figures in astronomy of the fifteenth century.\nThe work by Ali Qushji which contains these vital propositions is\nTreatise on the Eccentric Model Being Possible for the Two Lower Planets Just as for the Others\n. The article\n[\n11\n]\ncontains an English translation of Ali Qushji's paper, while the thesis\n[\n8\n]\ncontains another English translation with annotations.\nWe must now look to see why Ali Qushji is prepared to contradict\nPtolemy\n. He had rejected\nAristotle\n's approach to the philosophy of science and produced his own philosophical principles of the\n[\n5\n]\n:-\n... conception of existence, existents, nature, knowledge, and language. As for the mathematical sciences, Ali Qushji in general tried to free them from Hermetic-Pythagorean mysticism and to provide an alternative to Aristotelian physics as the basis for astronomy and optics.\nIt was this philosophy, which pervades all his work, which allowed him to suggest that\nPtolemy\nwas wrong and he could consider the possibility that the earth moved, in particular that it rotated. It also encouraged him to consider mathematics as a tool in understanding the physical world and not as an abstract subject of interest in its own right. As Mustapha Kara-Ali writes in\n[\n8\n]\n, Ali Qushji thought that:-\n... mathematical entities are not abstracted from sensory data, but are rather attained through human activity such as counting, ordering, comparing, etc.\nAlthough what we have described above may be the most important of Ali Qushji's contributions, we note that he was in fact a prolific author with interests in a wide range of topics. Today at least\n270\nmanuscript copies of his writings are extant covering works with\n43\ndistinct titles. There are\n13\ndistinct works on mathematics and astronomy,\n7\non theology and jurisprudence, and\n24\non literary topics especially grammar and linguistics. Before the recent discovery of his indirect influence on\nCopernicus\n, his most important work was considered to be a major work on Islamic philosophy which, in fact, is a commentary on a work by\nNasir al-Din al-Tusi\n(1201\n-\n1274)\n. Latin translations of Ali Qushji's\nTract on Arithmetic\nand his\nTract on Astronomy\nwere made by\nJohn Greaves\nand published in\n1650\n. Annotated English translations of the following two works by Ali Qushji are given by Mustapha Kara-Ali in\n[\n8\n]\n:\nTreatise on the Eccentric Model Being Possible for the Two Lower Planets\n; and\nTreatise Regarding the Solution to the Equant Problem\n.\nFinally, we note that he calculated the longitude of Constantinople as\n41\n°\n14\n', close to the modern value of\n41\n°\n01\n'. He was a major figure in assisting in compiling\nUlugh Beg\n's star catalogue, the\nZij-i Sultani\n. This was the most accurate star catalogue of its time and was only surpassed by the work of\nTycho Brahe\n150\nyears later. There is some doubt about the extent of Ali Qushji's contributions to the star catalogue, however, since he published\nSharh-i Zij Ulugh Beg\nwhich was a commentary on\nUlugh Beg\n's\nZij-i Sultani\nin which Ali Qushji made criticisms of it and pointed out some mistakes.\nLet us end with the following quote from\n[\n8\n]\n:-\nAli Qushji's views were debated for centuries after his death, and he exerted a profound influence on Ottoman-Turkish thought and scientific inquiry, in particular through the madrasa and its curriculum. His influence also extended to Central Asia and Iran, and it has been argued that he may well have had an influence, either directly or indirectly, upon early modern European science, to which his ideas bear a striking resemblance.",
  "matematicos_citados_na_biografia": [
    "Ulugh Beg",
    "Qadi Zada al-Rumi",
    "Jamshid al-Kashi",
    "Qadi Zada",
    "al-Kashi",
    "Ptolemy",
    "Tycho Brahe",
    "Beg",
    "Copernicus",
    "Regiomontanus",
    "Georg Peurbach",
    "Peurbach",
    "Aristotle",
    "Nasir al-Din al-Tusi",
    "John Greaves"
  ],
  "imagens": [
    "qushji.jpg"
  ]
}