{
  "nome_completo": "Anaximander of Miletus",
  "nome_curto": "Anaximander",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anaximander/",
  "data_nascimento": "611 BC",
  "local_nascimento": "Miletus near Söke, Turkey",
  "data_morte": "546 BC",
  "local_morte": null,
  "summary": "Anaximander of Miletus was a Greek scholar who first proposed that the sun, moon and planets revolved around the earth. he invented the gnomon of a sun-dial.",
  "biografia": "Little is known about the life of\nAnaximander of Miletus\nbut we do know a little through the writings of\nAristotle\n, Apollodorus, and Diogenes Laertius and others. We should emphasise that Apollodorus, although writing in the second century BC, was still\n500\nyears later than Anaximander\nwhile\nDiogenes wrote almost\n500\nyears after Apollodorus. Possible details of Anaximander from these sources suggest that he was the son of Praxiades and a pupil of\nThales\n. One ancient text states that\nThales\nwas related to Anaximander - possibly his uncle. He may have succeeded\nThales\nas head of his School of Philosophy in Miletus\n(\nas reported by Diogenes\n)\n. He is reported to have travelled widely, and founded a colony called Apollonia on the coast of the Black Sea\n[\n9\n]\n:-\nIt is also reported that he displayed solemn manners and wore pompous garments.\nNone of Anaximander's writings survive but we do know something about his works which were still available to\nAristotle\nand Apollodorus. His main writings are thought to have been\nOn Nature\n,\nOn the Fixed Stars\n,\nGeometric Surveying\n,\nSphere\n,\nMap of Greece\n, and\nMap of the World\n. The importance of his work is that he introduced scientific and mathematical principles into the study of astronomy and geography. One should not come away with the impression that this makes his ideas plausible in light of modern knowledge, but nevertheless the attempt to bring scientific and mathematical principles into areas which had been largely the domain of mysticism until that time must mean that Anaximander plays an important role in the development of science. Let us look at his ideas.\nAnaximander believed that the earth was a cylinder. If this seems a little strange, then we believe that his reasoning was that if one looked around one saw a circle, then he used a symmetry argument to argue that there was another circle with a cylinder between. He appears to have been the first person to argue that the sun, moon, planets and stars revolved around the earth so the sun which rose in the morning was the same sun that had disappeared on the evening of the preceding day. He saw each heavenly body as being a hole in an opaque circular wheel containing fire and encircling the earth. He also argued that the heavenly bodies were at different distances from the earth, but he was entirely wrong in believing that the stars were closer than any of the other heavenly bodies. He did, however, attempt to give the dimensions of the universe. The radius of the stars circles was\n9\ntimes the radius of the circle on top of the cylindrical earth, the radius of the moons circle was\n18\ntimes that of the earth, and the ratio of the sun's to the radius of the earth was\n27\n. For more details see\n[\n12\n]\n.\nIn Anaximander's model the earth is suspended in the middle of the circling heavenly bodies.  What then keeps it in place?\nAristotle\nwrites:-\nBut there are some who say that the earth stays where it is because of equality, such as among the ancients Anaximander. For that which is situated in the centre and at equal distances from the extremes, has no inclination whatsoever to move up rather than down or sideways; and since it is impossible to move in opposite directions at the same time, it necessarily stays where it is.\nWe also know that Anaximander attempted to give an explanation for how the universe came into being. His philosophy argued that all things arose from 'apeiron', the Boundless.\nAristotle\nwrites:-\nEverything has an origin or is an origin. The Boundless has no origin. For then it would have a limit. Moreover, it is both unborn and immortal, being a kind of origin. For that which has become has also, necessarily, an end, and there is a termination to every process of destruction.\nNow the universe was created from the Boundless:-\nA germ, filled with hot and cold, was separated off from the Boundless, then out of this germ a sphere of fire grew around the vapor that surrounds the earth, like a bark round a tree.\nThe sphere of fire split into several wheels which were then the wheels of the stars, moon, and sun.\nAnaximander discussed the origins of life, as well as the origins of the cosmos. He argued that the young earth was covered in seas, some of which began to dry out due to the heat of the sun. Life began in the mud of the seas as they dried out. The first animals had skin covered with spines but after they began to live on dry land, the heat of the sun gradually caused the animals to have fewer spines. He argued that man was not suited to live in this early world, so could only have arisen from the animals living on dry land after conditions became suitable. One would have to say that this is a remarkable achievement, again attempting to apply scientific and logical reasoning in an area where only mystical theories existed.\nIt appears that Anaximander was the first person to attempt to produce a map of the world. This map, of course, no longer exists, but it must have shown a circular earth - the top of the cylinder. It would have the Mediterranean Sea at its centre and show lands to the north and south, since this was the known world at the time.\nAnother first for Anaximander is the invention of the solar gnomon, see\n[\n19\n]\n. A special case of such a gnomon is the pointer on a sundial. The solar gnomon could be used to determine midday\n(\nthe time of shortest shadow\n)\n. Since at this time the sun was due south, the gnomon was used to find what we would call today 'the points of the compass'. Another aspect of his thought, having important implications for mathematics, is the dualism finite-infinite in his thoughts. This is discussed in detail in\n[\n6\n]\n.  We have discussed above both his attempts to measure the scale of the heavens and also to measure distances on earth with his attempts at maps. These are shown in\n[\n17\n]\nto be among the early Greek works that led to the modern study of trigonometry.",
  "matematicos_citados_na_biografia": [
    "Aristotle",
    "Thales"
  ],
  "imagens": [
    "anaximander.jpg"
  ]
}