{
  "nome_completo": "Anders Johan Lexell",
  "nome_curto": "Anders Lexell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lexell/",
  "data_nascimento": "24 December 1740",
  "local_nascimento": "Äbo, Sweden (now Turku, Finland)",
  "data_morte": "11 December 1784",
  "local_morte": "St Petersburg, Russia",
  "summary": "Anders Lexell made major contributions to spherical geometry and trigonometry.",
  "biografia": "Anders Lexell\nis sometimes known by the Russian version of his name which is Andrei Ivanovich Lexell. His father, Jonas Lexell, was a jeweller by trade but was also involved in politics as a local councillor. Anders' mother was Magdalena Catharina Björckegren. He was educated in Abo, attending the university there and graduating in\n1760\n. Three years later he was appointed assistant professor at Uppsala Nautical School and in\n1766\nhe became professor of mathematics there.\nIn\n1768\nLexell was invited to St Petersburg. The\nSt Petersburg Academy of Sciences\nhad been founded by Catherine I, the wife of Peter the Great, in\n1725\nand\nEuler\nhad worked there since\n1727\n. By this time\nEuler\nwas getting quite old, being\n62\nyears of age when the young mathematician Lexell arrived in\n1769\n. However, working in the same Academy as\nEuler\nand other high quality scientists was something which Lexell found exciting and enjoyable.\nEuler\ndiscussed research plans with Lexell and the other mathematicians at the Academy. They shared ideas while Lexell sometimes developed further ideas suggested by\nEuler\n, sometimes calculating tables, and compiling examples. For example Lexell is given full credit on the title page for his help with\nEuler\n's\n1772\npublication\nTheoria motuum lunae, nova methodo pertractata\nⓉ\n(\nThe theory of the motions of the moon: a new method of examination\n)\n.\nIn\n1771\nLexell was appointed professor of astronomy at the\nSt Petersburg Academy of Sciences\nand a few years later he was approached by the Swedish government trying to persuade him to return to Sweden. By this time Lexell had achieved quite a fine reputation as both a mathematician and astronomer and he was highly involved in the exciting work at the Academy. Knowing this, the Swedish government tried too attract him with back with a cleverly worked out offer. He would be appointed to a chair at the University of Abo immediately\n(\nthis was in\n1775)\nbut since he was so involved at work being undertaken at the\nSt Petersburg Academy\nhe would be allowed to remain there for five years to complete the work before returning to Abo. Despite the attractive proposition, Lexell was having none of it and turned it down in favour of staying permanently in St Petersburg.\nDespite wanting to remain in St Petersburg after\n1780\n, Lexell did in fact spend two years travelling through to the mathematical centres of excellence throughout Europe, in particular visiting Germany, France and England. He returned to St Petersburg in\n1782\nand, following\nEuler\n's death in\n1783\n, Lexell was appointed to succeed him to the chair of mathematics at the\nSt Petersburg Academy of Sciences\n. He did not hold this chair for very long since he died in the following year.\nLexell's work in mathematics is mainly in the area of analysis and geometry. Lexell made a detailed investigation of exact equations\ndifferential equations\n. His work here extended a necessary condition which had been discovered earlier by\nCondorcet\nand\nEuler\n. He also gave a proof which was not based on using the\ncalculus of variations\n. In addition Lexell developed a theory of\nintegrating factors\nfor differential equations at the same time as\nEuler\nbut, although it has often been thought that he learnt of the technique from\nEuler\n, the author of\n[\n2\n]\nargues that he independently discovered original methods to solve problems investigated by\nEuler\n.\nLexell did work in analysis on topics other than differential equations, for example he suggested a classification of\nelliptic integrals\nand he worked on the\nLagrange\nseries. He was also the first to develop a general system of polygonometry. This is a study of polygons similar to earlier work on triangles. It involves the solution of polygons given certain sides and angles between them, their mensuration, division by diagonals, circumscribing polygons around circles and inscribing polygons in circles. His work on this topic was continued by\nLhuilier\n.\nLexell made major contributions to spherical geometry and trigonometry. In fact trigonometry was the main tool used by Lexell in his work on polygonometry. Spherical geometry was a major tool in his astronomical studies.\nSpecific problems which Lexell studied in astronomy were his calculation of the solar\nparallax\nand his calculation of the orbits of several comets. One comet for which he calculated an orbit had been discovered by Messier. Lexell found that it had a period of five and a half years which made it the first comet to be discovered with a short period. He observed it pass close to Jupiter and its moons and since the moons were unaffected Lexell deduced that, despite the large size of comets, their mass was extremely low.\nWhen\nWilliam Herschel\ndiscovered a new body in the solar system on\n13\nMarch\n1781\n, Lexell computed its orbit which showed that it was a planet\n(\nlater named Uranus\n)\ntwice as far from the sun as Saturn, rather than a comet as had been thought at first. Although he did not predict the position of Neptune, as did\nAdams\nand\nLe Verrier\n, Lexell's initial calculations of the orbit of Uranus showed that it was being perturbed and he deduced that the perturbations were due to another more distant planet.",
  "matematicos_citados_na_biografia": [
    "St Petersburg Academy of Sciences",
    "Euler",
    "St Petersburg Academy",
    "differential equations",
    "Condorcet",
    "calculus of variations",
    "integrating factors",
    "elliptic integrals",
    "Lagrange",
    "Lhuilier",
    "parallax",
    "William Herschel",
    "Adams",
    "Le Verrier"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}