{
  "nome_completo": "Andor Kertész",
  "nome_curto": "Andor Kertész",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kertesz/",
  "data_nascimento": "19 February 1929",
  "local_nascimento": "Gyula, Hungary",
  "data_morte": "3 April 1974",
  "local_morte": "Budapest, Hungary",
  "summary": "Andor Kertész was a Hungarian mathematician who worked in the theory of Abelian groups, modules and  rings. He was also interested in the history of mathematics.",
  "biografia": "Andor Kertész\n's parents were Lajos Kertész\n(1899\n-\n1974)\nand his wife Mária Nyiri. Lajos taught singing and music at Gyula Primary School and was also a cantor of the Evangelical Reformed Church in Gyula. He was a prominent citizen organizing the cultural life of that small city which is located in the south eastern part of Hungary. Andor had two older brothers, Lajos Kertész\n(\nborn\n1925)\n, who became a pianist, and Gábor Kertész\n(\nborn\n1927)\n, who became an architect. Andor also had one younger brother Attila Ker     tész\n(\nborn\n1944)\nwho studied history and became a teacher.\nAndor Kertész attended elementary and secondary school in Gyula. Béla Csákány was ten years old when he entered the Roman Catholic\nGymnasium\n\"Karácsonyi János\" in Gyula in\n1942\nand there met, for the first time, Andor who was at that time thirteen years old. Csákány writes\n[\n1\n]\n:-\nWith some Calvinist classmates we sat in the first days as slightly uneasy newcomers on the benches of the Roman Catholic school, but soon became friendly the \"long-established\" Andor Kertész, then a\n13\n-year-old. We already knew him by name: he was a son of the local Reformed Church Cantor and had an excellent reputation. \"We want you to be also a good student like Bandi Kertész\", I was told by my parents when they sent me to the gymnasium. His talent was known throughout the city. For us he was, like for many of his later friends and colleagues, \"Bandi\" Kertész. He organized us immediately into the so-called \"small college\" that is, into the group of younger schoolboys of the Reformed Student Union.\nBandi Kertész organised the activities for the boys of the small college. Csákány writes\n[\n1\n]\n:-\n... once a week we came together for two or three hours and he entertained us with games appropriate for our age, with folk songs of various countries and he told us Bible stories with explanation. We proudly wore the mantle of service, the eight-pointed white \"Calvin star\", the badge of our union. On the vast courtyard of the Reformed Protestant culture house we played the inevitable football and other ball games that we had learned from Bandi. Here I introduced myself to ... Bandi's Bible competitions. Bandi would quote a Bible verse from the New Testament, and whoever was the fastest in finding the place in his own Bible got a point. Weekly he distributed four to five points and the competition - I even won twice - extended over an entire school year.\nAlthough his interests were broad, including music, history, philosophy and literature, Kertész chose to make his career in mathematics. In\n1947\nhe entered Kossuth Lajos University in Debrecen, Hungary, majoring in mathematics, physics and descriptive geometry. During his studies he won several contests in mathematics and was also awarded the Grünwald Géza Commemorative Prize for young researchers from the\nJános Bolyai Mathematical Society\nfor his findings in the fields of group theory and ring theory. His scientific career was substantially influenced by\nTibor Szele\n, one of the most outstanding Hungarian mathematicians, whose personality and achievements attracted Kertész' interest in modern algebra. Besides their professional cooperation, they also became close friends. In the Preface of his book on Artinian rings Kertész remembered his master as follows\n[\n4\n]\n:-\nOn completing this book I think with gratitude of my beloved teacher and friend, Professor\nTibor Szele\n. His fruitful mathematical activity and his selfless and humanistic attitude touched me deeply. It was our plan to write a book on Artinian rings together, but his premature death prevented us from doing this.\nHis first paper\nOn groups every subgroup of which is a direct summand\nwas published in\n1951\nand in the following year he published four papers, two of which were written jointly with\nTibor Szele\n. His two single author papers published in\n1952\nwere\nOn the decomposability of abelian p-groups into the direct sum of cyclic groups\nand\nOn fully decomposable abelian torsion groups\nwhile the two with\nTibor Szele\nwere\nOn abelian groups every multiple of which is a direct summand\nand\nOn the smallest distance of two lines in\n3\n-space\n.\nKertész graduated from Kossuth Lajos University in Debrecen in\n1952\nand continued to undertake research there. In\n1953\nhe married Ilona Tóth\n(\nborn\n1929)\n, a secondary school teacher of history and geography, the oldest of four children of Endre Tóth\n(1899\n-\n1970)\nand Ilona Pitze\n(1908\n-\n1997)\n. Andor and Ilona had two children, Andor Kertész\n(\nborn\n8\nMarch\n1956)\nand Gabriella Kertész\n(\nborn\n27\nDecember\n1959)\n, both of whom went on to be awarded doctorates and become academics. Kertész was transferred to the University of Szeged in\n1953\n. Béla Csákány, who had just begun his studies at Szeged, writes\n[\n1\n]\n:-\nWhen I was a student in the first year, I went boldly to Bandi's first scientific presentation in Szeged and he rejoiced when he saw me in the back row of the auditorium.\nCsákány states in\n[\n1\n]\nthat Kertész was moved to Szeged because Debrecen was known as the \"the Calvinist Rome\" and there was an attempt to reduce the influence of religion there so Kertész, an active member of the Reformed Church, was sent to Szeged. This move did not last long and soon Kertész was back in Debrecen. A positive aspect to this short stay in Szeged was that he got to know\nLászló Rédei\nwho held the Chair of Algebra and Number Theory there.\nKertész defended his thesis entitled\nOperator modules and semi-simple rings\nin\n1954\n. However, his advisor and collaborator\nTibor Szele\ndied in\n1955\n. After\nSzele\n's untimely death at the age of\n36\n, the supervision of Kertész' dissertation in modern algebra was continued by\nLászló Rédei\n, who was a member of the\nHungarian Academy of Sciences\n. In\n1957\nKertész defended his second dissertation\n(\nbearing the title\nOn the general theory of operator modules\n)\nand was awarded the degree \"Doctor of the Mathematical Sciences\"\n(\nthe highest academic degree in Hungary\n)\nat a remarkably young age.\nFrom\n1954\nhe taught at the Institute of Mathematics of the University of Debrecen, where he held the chair of Algebra and Number Theory from\n1960\nto\n1968\n. He was appointed full Professor in\n1963\n.\nIn\n1958\nBéla Csákány went to Moscow to work towards his doctorate advised by\nAlexandr Gennadievich Kurosh\n. While he was there, Kertész visited Moscow:-\nIn Moscow I met Bandi, when he gave a lecture in the famous Algebra Seminar of\nKurosh\n. It was a great honour for me that\nKurosh\ninvited even me to eat at his home in the evening where Kertész was also invited and, because he was just ending a visit to Moscow, also the Kiev group theorist\nLev Arkad'evich Kaluznin\n. ... We were greeted by our hosts the Kuroshs and Mrs Kurosh served us their delicious food and equally delicious wines.\nKertész' professional career was significantly shaped by two visiting professorships at the Martin Luther University Halle, East Germany, between\n1962\n-\n1964\nand\n1968\n-\n1971\n. He was invited to Halle by\nOtt-Heinrich Keller\n, the chair of mathematics at the Martin Luther University of Halle-Wittenberg. There Kertész established a research group for modern algebra which met international standards and attracted numerous disciples who later became renowned scholars at different universities throughout the world. In\n1969\nhe was elected as a member of the\nDeutsche Akademie der Naturforscher Leopoldina\n. In the same year he was awarded the Grand Prize of the\nHungarian Academy of Sciences\nfor his book\nVorlesungen über Artinsche Ringe\n. Timon Anderson, in a review of this book which was published in\n1968\n, writes:-\nRather than being a comprehensive account of the theory of Artinian rings, this book is an extremely well-written introduction to the theory of rings, with some applications to Artinian rings. From the pedagogical point of view, what is attractive about this book, besides its clarity, is the large number of exercises following each chapter and the careful development of the more important examples of rings. The development of the theory requires no previous knowledge of rings and it proceeds in the standard way via irreducible modules, the\nJacobson\nradical, and the density theorem for primitive rings. Then the results are sharpened for Artinian rings. Besides the classical\nWedderburn\ntheorems, there are discussions of complete reducibility of representations, semi-simplicity of group rings, and projective and injective modules. The treatment of some of the above topics is quite novel.\nHis intensive scholarly activity undermined his health and he died in\n1974\nin Budapest.\nHis main work is his book on Artinian rings, the German edition of which we have just mentioned. Its considerably enlarged English edition entitled\nLectures on Artinian Rings\nwas translated by Manfred Stern and edited by Richard Wiegandt with chapters written by Gerhard Betsch, Alfred Widiger and Richard Wiegandt. That\n14\nyears after his death the book appeared and became a standard work witnesses the lasting impact of his findings. In a review of the English edition, Iuliu Crivei writes:-\nThis book deals with the classical structure theory of associative rings, with special emphasis on Artinian rings. ... The book is self-contained. The presentation is very clear and at the end of each chapter many well-chosen exercises are given.\nKertész also authored a\n74\n-page textbook entitled\nEinführung in die transfinite Algebra\nⓉ\n(\nIntroduction to transfinite algebra\n)\nwhich was published in\n1975\n:-\nAn interesting and carefully written book, intended for students but containing some results not known to all professional mathematicians, illustrating the use of transfinite methods\n(\nchiefly\nZorn\n's Lemma\n)\nin algebra.\nIn the last years of his life he contributed to the historiography of mathematics. He was fascinated by the work of\nGeorg Cantor\n, the founder of set theory, who had been Professor at the University of Halle for several decades. Kertész made great efforts to pay tribute to the achievements of\nGeorg Cantor\nand, during his stay in Halle in\n1968\n, he took part in the\n50\nth anniversary celebrations of\nGeorg Cantor\n's death. After Kertész' death it was Manfred Stern, first a student of Kertész' in Halle and later followed him to Debrecen, who finished his manuscript on\nCantor\nwhich appeared in\n1983\nunder the title\nGeorg Cantor\n1845\n-\n1918\n, Schöpfer der Mengenlehre\nⓉ\n(\nGeorg Cantor\n1845\n-\n1918\n, creator of set theory\n)\n. Elliott Mendelson writes in a review:-\nThis monograph is based on a lecture given in\n1971\nin Halle on the\n125\nth anniversary of\nCantor\n's birth, three years before the author's untimely death at the age of forty-five. The emphasis is on\nCantor\n's set theory, but there is also a very sympathetic survey of his personality and his personal and academic life. There are much more extensive treatments elsewhere ... However, this book is distinguished by some interesting illustrations and, more importantly, by the warmth of the author's appreciation of his subject.\nBesides his four books he published\n66\npapers and more than hundred reviews. He acted as the editor-in-chief of the journal\nPublicationes Mathematicae\nand as an advisor of several further periodicals.\nHis main field of research was modern algebra, and within this, he focused on Abelian groups, the general theory of operator modules, ring theory and set theory, and he achieved significant findings in these fields. For example, his contribution to group theory and infinite Abelian groups have been cited in the standard works by\nLazarus Fuchs\n[\nInfinite Abelian Groups.\n2\nVolumes\n(\nAcademic Press, New York and London,\n1970\n,\n1973)]\n. They have also been applied in the seminal contributions by\nLászló Rédei\n[\nAlgebra\n(\nGeest and Portig, Leipzig,\n1959)]\n, Ernst-August Behrens\n[\nAlgebren\nⓉ\n(\nAlgebras\n)\n(\nBI Hochschultaschenbücher, Mannheim,\n1965)]\n,\nAleksandr G Kurosh\n[\nGruppentheorie\nⓉ\n(\nGroup theory\n)\n.\n2\nVolumes\n(\nAkademie-Verlag, Berlin,\n1970)]\n,\nOtto Szász\n[\nÜber artinsche Ringe\nⓉ\n(\nOn Artin rings\n)\n,\nBull. Acad. Polon. Sci\n11\n(1963)\n,\n351\n-\n354\n, and\nRadicals of Rings\n(\nAkadémiai, Kiadó, Budapest,\n1981)]\n, Lev Anatol'evich Skornyakov\n[\nGeneral Algebra\n(\nRussian\n)\n.\n2\nvolumes\n(\nNauka, Moscow,\n1990\n,\n1991)]\n, Ottó Steinfeld\n[\nQuasi-ideals In Rings and Semigroups\n(\nAkadémiai Kiadó, Budapest,\n1978)]\nas well as Barry J Gardner and Richard Wiegandt\n[\nRadical Theory of Rings\n(\nMarcel Decker, New York,\n2004)]\n.\nThe last words of the Preface to his book on\nCantor\nconcisely characterize both his relationship to mathematics and his own personality\n(\nsee A Kertész,\nGeorg Cantor\n1845\n-\n1918\n, Schöpfer der Mengenlehre\nⓉ\n(\nGeorg Cantor\n1845\n-\n1918\n, creator of set theory\n)\n, Acta Historia Leopoldina\n15\n(\nDeutsche Akademie der Naturforscher Leopoldina,\nHalle/Saale,\n1983)\n,\n10)\n:-\nShould the reader notice that behind the lines there are confessions of a mathematician who among the different aspects of mathematics highlights especially the humanistic and aesthetic ones, then I will be richly rewarded for my efforts.\nHe was an extraordinary teacher whose clear, convincing and rhetorically perfect lectures inspired and fascinated his audience. Let us quote just one example in order to illustrate how deeply his students were influenced by Kertész' personal and scholarly impact. Dinh Van Huynh, who published the joint paper\nÜber linksnoethersche Ringe, die linksartinsch sind\nⓉ\n(\nOn left-Noetherian rings, which are left-Artinian\n)\n(1976)\nwith Kertész, writes\n[\n5\n]\n:-\nFor me, however, he remained and still remains as a guiding star whose love and excitement about algebra brought and continues to bring light and encouragement to my research work ... At the time when I met him, I felt as if Professor Kertész were an angel sent by God to teach me mathematics. ... I still remember his excitement while talking at length about his joint work with Alfred Widiger describing the structure of Artinian rings for which the\nJacobson\nradical is Artinian as a ring\n(\ncf. A Kertész and A Widiger, Artinsche Ringe mit artinschem Radikal, J. Reine angew. Math.\n242\n(1970)\n,\n8\n-\n15\n. After thinking about it for a while I felt that, in the light of the\nWedderburn\n-\nArtin\nTheorem, this nice structure theorem could be obtained from a general and natural decomposition of Artinian rings. ... Inspiration stroke me and I finally obtained the desired theorem in\n1976\n... Indeed, I could not have thought of creating this theorem without those inspiring conversations while I was under his tutelage. I believe he would have been delighted to learn about my theorem that includes the main theorem from Kertész and Widiger\n(1970)\nas a special case. ... In my research career, I often imagine him smiling at me and sharing his delight on my success.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "János Bolyai Mathematical Society",
    "Tibor Szele",
    "László Rédei",
    "Szele",
    "Hungarian Academy of Sciences",
    "Alexandr Gennadievich Kurosh",
    "Kurosh",
    "Lev Arkad'evich Kaluznin",
    "Ott-Heinrich Keller",
    "Deutsche Akademie der Naturforscher Leopoldina",
    "Jacobson",
    "Wedderburn",
    "Zorn",
    "Georg Cantor",
    "Cantor",
    "Lazarus Fuchs",
    "Aleksandr G Kurosh",
    "Otto Szász",
    "Artin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}