{
  "nome_completo": "Andrei Andreevich Bolibrukh",
  "nome_curto": "Andrei Andreevich Bolibrukh",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bolibrukh/",
  "data_nascimento": "30 January 1950",
  "local_nascimento": "Moscow, USSR (now Russia)",
  "data_morte": "11 November 2003",
  "local_morte": "Moscow, Russia",
  "summary": "Andrei Bolibrukh was a Russian mathematician known for his work on ordinary differential equations and especially Hilbert's 21 st problem.",
  "biografia": "Andrei Andreevich Bolibrukh\n's father, Andrei Vlas'evich Bolibrukh, was a soldier reaching the rank of major by the end of World War II. His war service saw him suffer five wounds and receive seven awards. He continued to serve in the army, reaching the rank of lieutenant-general. Andrei Andreevich's mother, Tat'yana Ivanovna Pimanikhina, showed a talent for mathematics and entered college before marrying at nineteen and devoting herself to raising her son and his sister Tat'yana. Andrei Vlas'evich was posted to quite a number of different places as Andrei Andreevich was growing up and, as a consequence, the boy attended a variety of different schools in different parts of the country - mainly in Moscow, Tallin, and Kaliningrad. When he was six years old, the family were living in a forest in Belorussia and Andrei's father decided to prepare him to begin his schooling. Bolibrukh explained what happened\n(\nsee\n[\n1\n]\n)\n:-\nWhen I was six years old my father decided to prepare me for school. I could read, write and add numbers. My father decided to teach me mathematics. In particular he tried to explain to me how to calculate the area of a circle!! And I remember very well that I could not understand him. He told me, \"The area of the circle equals pi r squared. Do you understand?\" No, I answered, you say to write numbers, but what is an area? ... now I understand that he was not a mathematician and he could not say that area is a functional on the set of measurable figures with the following properties, etc. ...\nAlthough Andrei saw comparatively little of his father, who was busy working, he remembered happy holidays making trips by car or train to interesting places in the Baltic states. They also made trips around Kaliningrad and in the Crimea where he spent time fishing. His first interests were in literature and he loved the school theatre where between age eleven and fourteen he won prizes for recitation. A good mathematics teacher gave him an increasing interest in that subject from the age of twelve. By age fourteen he was making deep mathematical studies. In\n1965\nhe was a prize winner in the All-USSR Mathematics Olympiad organised for school children. Following this he went to a boarding school which was specially set up to educate scientifically talented children. This school, the Physics-Mathematics Boarding School no.\n45\n, was attached to Leningrad State University and was staffed by very fine teachers. Bolibrukh writes of his memories of his teachers, classmates and the excellent organisation of the school in\n[\n10\n]\n. Mathematics was not his only love, however, and while at this school he developed a love of modern art, poetry and continued his love of the theatre. He graduated from the school in\n1967\n, having won the gold medal, and entered the Mechanics and Mathematics Department of Moscow State University. This university was, he wrote\n[\n1\n]\n:-\n... maybe the best place to study mathematics throughout all the world.\nVolodya Leksin writes in\n[\n13\n]\nabout undergraduate years with Bolibrukh:-\nAndrei and I were fellow students in the Department of Mechanics and Mathematics from\n1967\nto\n1972\n. From our third year there\n(\nthat is, from Autumn\n1969)\nwe were in one group containing mainly students working in higher geometry and topology. Our research supervisor was\nMikhail Mikhailovich Postnikov\n. In those years he gave splendid lectures for the compulsory course in linear algebra, and when in the Autumn of\n1968\nhe offered a specialised seminar \"Algebraic topology and its applications\"\n(\nwhich started as a study group and then turned into a research group ...\n)\n, many students joined this seminar. ... Andrei kept a low profile among his extrovert and noisy contemporaries. At first I attributed this to his very courteous and considerate manner. But after a little contact with him during our study I realised that he was a man of very strong inner self-discipline, responsibility and precision. For example, he would write down in his notebook under the relevant date any obligation that he undertook\n(\nto the majority of the students this was unusual and surprising\n)\nand would fulfil it to the letter.\nBolibrukh graduated with his diploma\n(\nequivalent to a Master's Degree\n)\nin\n1972\nhaving written a thesis on calculations of the cobordism of manifolds with certain relations on the characteristic classes of their tangent bundles. He then began working towards his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nwith\nPostnikov\nas his advisor.\nPostnikov\n's research students joined\nL V Keldysh\n's seminar and\n[\n13\n]\n:-\n... we began to organize our workshops systematically in various parts of the Moscow countryside, combining topology, football or skiing depending on the season, anecdotes, serious conversations about life, and so on.\nAlexei Chernavskii recalls in\n[\n13\n]\nthat Bolibrukh was not quite as successful as one might have expected:-\nAndrei was an active and lively participant. He put his heart into everything that he tried to do, and he acted - it is hard to think of a better word - with precision.\n[\nHe gave the\n]\nimpression of a very lively energetic and pleasant young man, who sometimes suddenly seemed rather more mature than a first glance would have suggested. I have no doubt that Andrei was linguistically gifted: he easily solved various word puzzles ...\n[\nbut his\n]\nmathematical work was not being very successful, although his knowledge and understanding were no less than that of the other students. I can say now that the world of pure topology was not his world, it contained something dissonant with his very independent personality.\nBolibrukh had begun to take an interest in mathematical topics outside the area of the research he was undertaking for his Candidate's degree, attending an informal seminar organised by A V Chernavskii to study the multi-dimensional\nRiemann\n-\nHilbert\nproblem. As a consequence his Ph.D. studies changed direction, influenced by Chernavskii, and he completed research for his thesis\nOn the Fundamental Matrix of a Pfaffian System of Fuchsian Type\nin\n1975\n. He began working at the Moscow Institute of Physics and Technology but, rather surprisingly, it was two years after completing research for his thesis that Bolibrukh defended it at Moscow State University and was awarded his Candidate's Degree.\nCertainly his career was moving less rapidly than one might have expected. Dmitrii Viktorovich Anosov writes in\n[\n7\n]\nabout the following years:-\nI am not sure that even his closest friends really knew about his inner growth during about\n10\nyears after defending his PhD dissertation; all the more so since at that time he devoted a lot of attention to completely different things - for example, tribology, that is, the study of the influence of various types of friction on the work of mechanical systems. This was a useful activity connected with the applied orientation of the Moscow Institute of Physics and Technology and requiring a certain qualification, but it had nothing to do with linear differential equations in the complex domain. I met him on several occasions during that time and must confess that he did not then make a strong impression on me.\nDuring these years Andrei and his wife Nina started a family and his son, also called Andrei, and daughter Ekaterina were born.\nWhat appeared to be turning into a rather ordinary career for Bolibrukh changed dramatically in\n1989\nwhen he solved\nHilbert\n's\n21\nst\nproblem, also known as the\nRiemann\n-\nHilbert\nproblem. This problem, the\n21\nst\nin\nHilbert\n's famous list of problems which he gave in\n1900\nto set the mathematical scene for the\n20\nth\ncentury, is as follows:-\nDoes there exist a Fuchsian system of linear ordinary differential equations in the complex domain having prescribed singularities and monodromy group?\nHilbert\nbelieved that the question had a positive solution and the problem appeared settled in\n1908\nwhen\nJosip Plemelj\nproved this by giving a reduction of the problem to a known result. However, in around\n1980\n, it was discovered, by Golubeva, Leksin and others, that there was an error in\nPlemelj\n's reduction. It was still believed that what was required was a correction in\nPlemelj\n's method to give the expected positive answer but Bolibrukh produced a major surprise when he proved in\n1989\nthat certain prescribed conditions on the singularities led to a negative solution. This brilliant work constituted Bolibrukh's doctoral thesis\n(\nequivalent to a D.Sc. or\nhabilitation\n)\n, awarded in\n1991\n, and suddenly he went from being a rather ordinary mathematician to being a real star. We should make it clear that it was not simply that Bolibrukh had struck luck with one result. Rather from this time on he produced results of the highest quality. Quite why someone should blossom in this way at an unusually advanced age for a leading mathematician, it is hard to understand.\nHonours were quickly given to Bolibrukh for his extraordinary work. He was an invited lecturer at the International Congress of Mathematicians held in Zürich in\n1994\ngiving the lecture\nThe Riemann-Hilbert problem and Fuchsian differential equations on the Riemann sphere\n. From\n1990\nhis main work was done in the\nSteklov\nMathematical Institute and he became deputy director of the Institute in\n1996\n. In\n1994\nhe was elected a corresponding member of the\nRussian Academy of Sciences\n, becoming a full member three years later. The\nRussian Academy of Sciences\nawarded him their\nLyapunov\nPrize in\n1995\nand in\n2001\nhe received the State Prize of the Russian Federation. Moscow State University honoured him in\n1999\nwith the title of Honoured Professor.\nHonours were certainly not confined to Russia. He was invited to spend\n1995\n-\n97\nas a visiting professor at the University of Nice, and a similar invitation saw him spend\n1998\n-\n2002\na visiting professor at the University of Strasbourg. He became a member of the Executive Committee of the\nInternational Union of Mathematicians\nin\n2002\n. He was an invited speaker at numerous international conferences, often as a plenary speaker. Over a period of five years he gave talks at no less than\n31\ninternational conferences and, even more remarkably, gave a talk on a different topic at each one. Sadly, however, his health deteriorated and he was diagnosed with cancer. He underwent treatment in hospital over many months but when his health appeared to improve somewhat he left hospital and attended a conference to celebrate the\n100\nth\nanniversary of the birth\nAndrei Nikolaevich Kolmogorov\n[\n7\n]\n:-\n... he was optimistic, mixed in good spirits with the participants, made plans for his future research\n(\nnegotiations about medical treatment in France were nearing completion\n)\n, gave his talk brilliantly as usual, and immediately afterwards attended the unveiling of a memorial bust of\nL S Pontryagin\non Lenin Avenue.\nSadly the improvement was short-lived and he was hospitalised again. However, while in hospital he completed writing his last research paper, wrote the memoirs\n[\n11\n]\nand continued advising his students at the\nSteklov\nMathematical Institute. A year after he died, a conference in his honour was organized in Strasbourg, France.\nLet us record other aspects of Bolibrukh's career. M Butuzov, I V'yugin, R Gontsov and V Poberezhnyi write in\n[\n13\n]\nabout Bolibrukh's teaching:-\nAll of us, at different times, got to know Andrei during our second year at the Department of Mechanics and Mathematics. In those years he gave the specialized lecture course on the analytic theory of differential equations, vector bundles and the\nRiemann\n-\nHilbert\nproblem. Andrei was a wonderful lecturer. His style of presentation was precise and rigorous but accessible, and he would highlight the most important and beautiful points. He prepared his lectures thoroughly, and one of his courses was published as the book Fuchsian differential equations and\nholomorphic\nbundles, which is a good example of his style. After every lecture Andrei asked us, the youngest of his audience members, what we had not understood, and we stayed in the lecture room, sometimes for a whole hour, receiving not only answers to our questions but also improvised lectures on general topics. He lectured with great passion, becoming completely carried away by the material. Once during a lecture he even tore his shirt by accident. His engagement won over the audience and drew them to his subject. Therefore when we had to choose a research advisor we approached Andrei. He agreed, and we joined the group working on differential equations, and later, together with him, joined the newly formed dynamical systems group.\nOutside mathematics Bolibrukh's interests included tennis, literature, paintings, and the theatre.",
  "matematicos_citados_na_biografia": [
    "Mikhail Mikhailovich Postnikov",
    "Postnikov",
    "L V Keldysh",
    "Riemann",
    "Hilbert",
    "Josip Plemelj",
    "Plemelj",
    "habilitation",
    "Steklov",
    "Russian Academy of Sciences",
    "Lyapunov",
    "International Union of Mathematicians",
    "Andrei Nikolaevich Kolmogorov",
    "L S Pontryagin",
    "holomorphic"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}