{
  "nome_completo": "Andrei Andreyevich Markov",
  "nome_curto": "Andrei Andreyevich Markov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Markov/",
  "data_nascimento": "14 June 1856",
  "local_nascimento": "Ryazan, Russia",
  "data_morte": "20 July 1922",
  "local_morte": null,
  "summary": "A A Markov was a Russian mathematician who is is best known for his work in probability and for stochastic processes especially Markov chains.",
  "biografia": "Andrei Andreyevich Markov\n's mother was Nadezhda Petrovna, who was the daughter of a state worker, and his father was Andrei Grigorievich Markov, the son of a country deacon. Andrei Grigorievich Markov studied at a church seminary, then got a job as a clerk. The family moved to St Petersburg where Andrei Grigorievich served in the Forestry Department and then became a manager of various households and estates. Andrei Grigorievich married twice; with his first wife Nadezhda he had two sons and several daughters. Andrei Andreyevich was the oldest of the two boys while the younger was Vladimir. Although Vladimir died from tuberculosis at the age of\n25\n, he had already gained an international reputation as a mathematician.\nIn his early years Markov was in poor health and up to the age of ten he could only walk with the assistance of crutches. His secondary schooling was at St Petersburg\nGymnasium\nNo\n5\nwhere he showed outstanding talents for mathematics but performed rather poorly in other subjects. He wrote his first mathematics paper while at the Gymnasium but his results on integration of linear differential equations which were presented in the paper were not new. However, writing the paper did result in him meeting\nKorkin\nand\nZolotarev\n, two of the leading professors at the university. It was clear that mathematics was the right subject for Markov to study at university and, in\n1874\n, he entered the Physics and Mathematics Faculty of St Petersburg  University. There he enrolled in the seminar run by\nKorkin\nand\nZolotarev\nbut also attended lectures by\nChebyshev\n, the head of the mathematics department. These were particularly stimulating to Markov, since\nChebyshev\noften encouraged an atmosphere of research by posing new questions and problems for his students to investigate.\nMarkov graduated in\n1878\nhaving won the gold medal for submitting the best essay for the prize topic set by the faculty in that year -\nOn the integration of differential equations by means of\ncontinued fractions\n. He now wished to train to become a university professor and worked for his Master's degree over the next two years\n(\nthis was at a level equivalent to a doctorate\n)\n. He was awarded the degree in\n1880\nfor his thesis\nOn the binary quadratic forms with positive determinant\n. This thesis was outstanding\n[\n4\n]\n:-\nThis work, very highly esteemed by\nChebyshev\n, represents one of the finest achievements of the St Petersburg school of\nnumber theory\n, and perhaps even of all Russian mathematics. It is enough to recall the sorts of questions in the field of rational approximation which at that time preoccupied the most prominent number theorists of France and Germany, to appreciate how much deeper into the field Markov had penetrated. it is therefore perhaps not surprising that, although the dissertation was published immediately\n(\nin French in Mathematische Annalen\n)\n, it did not become generally absorbed by west European mathematicians, until from\n1910\nto the\n1920\ns the Berlin mathematicians\nFrobenius\nand\nRemak\nattempted to master the set of ideas contained in Markov's work.\nAfter submitting his master's thesis, Markov began to teach at St Petersburg University as a\nprivatdozent\nwhile working for his doctorate\n(\nequivalent to the\nhabilitation\n)\n. He was awarded his doctorate in\n1884\nfor his dissertation\nOn certain applications of continued fractions\n.\nMarkov had known Maria Ivanova Valvatyeva since they were children for she was the daughter of the owner of the estate which his father was managing. Markov had tutored Maria Ivanova in mathematics and later he proposed marriage to her. However Maria Ivanova's mother would not allow her daughter to marry the son of her estate manager until Markov had gained sufficient social status. In\n1883\nMaria Ivanova's mother agreed to the marriage which took place in that year.\nMarkov became an extraordinary professor at St Petersburg University in\n1886\nand an ordinary professor in\n1893\n.\nChebyshev\nproposed Markov as an adjunct of the\nRussian Academy of Sciences\nin\n1886\n. He was elected as an extraordinary member in\n1890\nand an ordinary academician in\n1896\n. He formally retired in\n1905\nbut continued to teach for most of his life.\nMarkov's early work was mainly in number theory and analysis, algebraic continued fractions, limits of integrals, approximation theory and the convergence of series. After\n1900\nMarkov applied the method of continued fractions, pioneered by his teacher\nPafnuty Chebyshev\n, to\nprobability theory\n[\n4\n]\n:-\nMarkov was the most elegant spokesman for\nChebyshev\n's ideas and directions of research in probability theory. Especially remarkable is his research relating to the theorem of\nJacob Bernoulli\nknown as the Law of Large Numbers, to two fundamental theorems of probability theory due to\nChebyshev\n, and to the method of least squares.\nHe also studied sequences of mutually dependent variables, hoping to establish the limiting laws of probability in their most general form. He proved the central limit theorem under fairly general assumptions. Markov is particularly remembered for his study of Markov chains, sequences of random variables in which the future variable is determined by the present variable but is independent of the way in which the present state arose from its predecessors.  This work founded a completely new branch of probability theory and launched the theory of stochastic processes. In\n1923\nNorbert Wiener\nbecame the first to treat rigorously a continuous Markov process. The foundation of a general theory was provided during the\n1930\ns by\nAndrei Kolmogorov\n.\nSergei Bernstein\n, who continued to develop the theory of Markov chains, wrote\n(\nsee for example\n[\n4\n]\n)\n:-\nA A Markov's classic course on the computation of probabilities, and his original memoirs, models of accuracy and clarity of exposition, contributed to a very large extent to the transformation of the theory of probability into one of the most perfected areas of mathematics, and to the wide dissemination of\nChebyshev\n's methods and directions of research. His profound analysis in the spirit of\nChebyshev\nof the dependencies among observed random phenomena allowed Markov to extend probability theory in an essential way through the introduction and investigation of dependent random quantities.\nMarkov was also interested in poetry and he made studies of poetic style - perhaps surprisingly\nKolmogorov\nhad similar interests. It is worth pointing out, however, that although Markov developed his theory of Markov chains as a purely mathematical work without considering physical applications, he did apply the ideas to chains of two states, namely vowels and consonants, in literary texts. His interest in poetry was not, therefore, an entirely separate interest from his mathematical work.\nAs a lecturer, Markov demanded much of his students\n[\n1\n]\n:-\nHis lectures were distinguished by an irreproachable strictness of argument, and he developed in his students that mathematical cast of mind that takes nothing for granted. He included in his courses many recent results of investigations, while often omitting traditional questions. The lectures were difficult, and only serious students could understand them. ... During his lectures he did not bother about the order of equations on the blackboard, nor about his personal appearance.\nMarkov lived through a period of great political activity in Russia and, having firm opinions, he became heavily involved. Maksim Gorky, the Russian short-story writer, novelist and left wing activist, was elected a member of the\nRussian Academy of Sciences\nin\n1902\n, but his election was soon withdrawn for political reasons on the Tsar's orders. Markov protested strongly and refused to accept honours awarded him on the following year. In June\n1907\nTsar Nicholas dissolved the Second Duma which had been elected with majority on the left. Markov repudiated his membership and might have expected to suffer severe consequences but the authorities chose not to make an example of an elderly and distinguished academician. In\n1913\nthe Romanov dynasty, which had been in power in Russia since\n1613\n, celebrated their\n300\nyears of power. This was not likely to improve their already weak position. Markov showed his disapproval of the celebration but holding celebrations of his own - he celebrated\n200\nyears of the Law of Large Numbers!  The Russian Revolution began early in\n1917\nas food supplies ran low. In September of that year Markov requested the Academy to send him to a disadvantaged town in the Russian interior. He was sent to Zaraisk, a small country town, where he taught mathematics in the secondary school without receiving any remuneration. He returned to St Petersburg but his health was now deteriorating and he had an eye operation. Although by\n1921\nhe was in such a bad way that he was hardly able to stand, yet he continued to lecture on probability at the university. His death in July\n1922\ncame after months of the most severe suffering.\nMarkov had a son\n(\nof the same name\n)\nwho was born on\n9\nSeptember\n1903\nand followed his father in also becoming a renowned mathematician.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Korkin",
    "Zolotarev",
    "Chebyshev",
    "continued fractions",
    "number theory",
    "Frobenius",
    "Remak",
    "privatdozent",
    "habilitation",
    "Russian Academy of Sciences",
    "Pafnuty Chebyshev",
    "probability theory",
    "Jacob Bernoulli",
    "Norbert Wiener",
    "Andrei Kolmogorov",
    "Sergei Bernstein",
    "Kolmogorov"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}