{
  "nome_completo": "Anna Margaret Mullikin",
  "nome_curto": "Anna Mullikin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mullikin/",
  "data_nascimento": "7 March 1893",
  "local_nascimento": "Baltimore, Maryland, USA",
  "data_morte": "24 August 1975",
  "local_morte": "Philadelphia, USA",
  "summary": "Anna Margaret Mullikin was an American mathematician who was one of the early investigators of point set theory.",
  "biografia": "Anna Mullikin\n's parents were William Lawrence Mullikin\n(1846\n-\n1915)\nand Sophia Ridgely Battee\n(1854\n-\n1921)\n. William, a leather hider and later a leather dealer, and his wife Sophia had four children. The eldest of the children, Mary Hester, was born in\n1884\n, followed by Richard Nicholas in\n1888\nand Caroline Battee two years later. Anna was the youngest of the four children and she attended Goucher College in Towson, Maryland, graduating in\n1915\n[\n2\n]\n:-\nShe displayed promise as a mathematician in her senior year by solving a problem on geometry in the 'American Mathematical Monthly'.\nHer two sisters had also attended Goucher College; Mary Hester graduating in\n1907\nand Caroline Battee in\n1913\n. All three sisters became high school teachers in public schools of Baltimore. Anna's brother, Richard Nicholas, was awarded an A.B. and a Ph.D. in chemistry from Johns Hopkins University after which he worked as a chemist for the Dupont Corporation.\nAnna Mullikin taught mathematics first at Science Hill School in Shelbyville, Kentucky, taking up the appointment in\n1915\nfollowing her graduation. Two years later she moved to Virginia where she became an instructor at the Mary Baldwin Seminary in Staunton. After one year she left teaching to begin graduate studies at the University of Pennsylvania in Philadelphia in October\n1918\n. She held a scholarship for the year\n1918\n-\n19\nduring which she completed work for a Master's Degree, graduating at the end of the academic year. Already during this year she had attended\nRobert Lee Moore\n's graduate class and made a remarkable start to her doctoral studies by discovering a counter-example which was to become the basis for the work of her doctoral dissertation. On\n25\nOctober\n1919\nRobert Moore\nread a paper by Mullikin to a meeting of the\nAmerican Mathematical Society\nheld at Columbia University.\nFrank Cole\nreported\n[\n3\n]\n:-\nIn one dimension no countably infinite collection of mutually exclusive closed point sets ever has a connected sum. One might rather naturally be inclined to believe that this proposition holds true also in two dimensions. Miss Mullikin shows by an example that this is, however, not the case\nIn\n1919\n-\n20\nshe continued her studies towards her doctorate under\nRobert Moore\n's supervision but, her scholarship having ended, she supported herself by teaching mathematics at Stevens School in Germantown, Philadelphia. In\n1920\nRobert Moore\nleft the University of Pennsylvania to take up an appointment as associate professor at the University of Texas. He arranged a position for Mullikin as an Instructor at the University of Texas for the session\n1920\n-\n21\n. The\nAmerican Mathematical Society\nmet again at Columbia University on\n28\nDecember\n1920\nand Mullikin, now at the University of Texas in Austin, attended the meeting and gave a lecture on\nCertain theorems concerning connected point sets\n. On\n26\nFebruary\n1921\nthe\nAmerican Mathematical Society\nmet again at Columbia University but this time neither Mullikin nor\nRobert Moore\nattended. However Mullikin's paper\nA necessary and sufficient condition that the sum of two bounded, closed and connected point sets should disconnect the plane\nwas read to the Society by title. It is clear that by this stage Mullikin had proved all the results which she would include in her thesis.\nLeaving Austin, Mullikin returned to the University of Pennsylvania after teaching for a year at the University of Texas. Although\nRobert Moore\nwas now at the University of Texas he continued to be Mullikin's thesis advisor. She again supported herself by teaching mathematics in\n1921\n-\n22\n, this time at Oak Lane Country Day School in Philadelphia. She submitted her dissertation\nCertain theorems relating to plane connected point sets\nto the University of Pennsylvania and defended it at a public examination in January\n1922\n. She was awarded the degree of Ph.D. at a ceremony in June of that year and her thesis was printed in the\nTransactions\nof the\nAmerican Mathematical Society\nin September\n1922\n. We note that the\nTransactions\nhad a policy not to publish doctoral theses so it is a tribute to the quality and importance of Mullikin's work that they agreed publication.\nZygmunt Janiszewski\n, who died in January\n1920\n, had proved similar results to Mullikin although her work was completely independent of his.\nMoore\npublished a paper\nConcerning the sum of a countable number of mutually exclusive continua in the plane\nin\nFundamenta Mathematicae\nin\n1924\nin which he wrote:-\nA proposition which is a logical consequence of these theorems of\nJaniszewski\n's has been recently established by Miss Anna M Mullikin in her Doctor's dissertation, which will appear soon in the 'Transactions' ... This paper had gone to the printers before either Miss Mullikin or I was aware that the proposition had already been proved. Apparently\nJaniszewski\n's paper is printed in Polish.\nMullikin's results have been highly significant in the development of the subject. The authors of\n[\n2\n]\nwrite that her paper's:-\n... impact on researchers became dramatically apparent in\n1924\nwith a half dozen references. Over the next several years, the dissertation would serve as a catalyst for international cooperation and competition between the schools of topology in the U.S. and Poland.\nIn\n[\n2\n]\na detailed account is given of the publications over many years which were consequences of Mullikin's work. In particular they mention contributions by\nStefan Mazurkiewicz\n,\nRaymond L Wilder\nand\nGordon Whyburn\n.\nIn\n1922\n-\n23\nMullikin taught at the William Penn High School for Girls in Philadelphia after which she was appointed to Germantown High School. We note that all her previous teaching appointments had been to girls' schools but Germantown High School was co-educational. In\n1952\nshe became head of the mathematics department at the school where she remained for the rest of her career, retiring in\n1959\n.\nTowards the end of her teaching career, Mullikin collaborated with Ethel L Grove, who had taught at Cuyahoga Heights High School in Cleveland, and Ewart L Grove, who taught at the University of Alabama, in writing textbooks. They produced three books:\nAlgebra and its Use, Book I\n(1956)\n;\nAlgebra and its Use, Book II\n(1956)\n; and\nBasic Mathematics\n(1961)\n.\nThe authors of\n[\n2\n]\ngive the following summary of Mullikin's contributions:-\nAnna Margaret Mullikin may be remembered as a mathematician, a teacher, a philanthropist, and a humanitarian. In mathematics, she was one of the earliest American researchers in point-set topology, advancing knowledge of connectedness in the plane and characterizations of\n2\n-manifolds in terms of connected sets, and contributing to an international collaboration among topologists in Poland and the United States. Although her only research was the doctoral dissertation, resulting in one published paper, it contained such deep results that all five theorems found application in subsequent investigations lasting another\n50\nyears.\nAs a high-school teacher Mullikin served as an excellent mentor and role model for all her students during a\n40\n-year teaching career. With a combination of firmness, patience, and kindness, she guided them both in mathematics and in the art of living. She identified and encouraged students of strong mathematical ability, taught a meticulous and orderly approach to mathematics to all her students, and tailored her lessons to the abilities of individual students. Although her pupils were unaware of her earlier research and some of them did not even know that she held a Ph.D., they benefited by experiencing firsthand a brilliant and serious mathematical mind at work. Perhaps this was especially true for her female students but all her students remember her with admiration and respect.\nAs a person Miss Mullikin was generous of spirit and purse, leaving a financial legacy which continues to benefit humanity. Although all of her immediate family died before she did, some of them prematurely, and her own health was poor for several years, she maintained an optimistic outlook, welcoming visitors graciously. Firm in her sense of how to do mathematics, how to teach, and how to live, she was patient, modest, and considerate in her relations with others.",
  "matematicos_citados_na_biografia": [
    "Robert Lee Moore",
    "Robert Moore",
    "American Mathematical Society",
    "Frank Cole",
    "Zygmunt Janiszewski",
    "Moore",
    "Janiszewski",
    "Stefan Mazurkiewicz",
    "Raymond L Wilder",
    "Gordon Whyburn"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}