{
  "nome_completo": "Anton Dimitrija Bilimovic",
  "nome_curto": "Anton Dimitrija Bilimovic",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bilimovic/",
  "data_nascimento": "20 July 1879",
  "local_nascimento": "Zhytomyr, Zhytomyrs'ka oblast, Ukraine",
  "data_morte": "17 September 1970",
  "local_morte": "Belgrade, Yugoslavia, now Serbia",
  "summary": "Anton Dimitrija Bilimovic wasa Ukranian-born mathematician who worked on a wide variety of both pure and applied mathematics.",
  "biografia": "Anton Dimitrija Bilimovic\n's father, Dimitri Bilimovic, was a medical doctor in the army. Anton attended elementary school in Vladimir, the main town of Vladimir Oblast, Russia, located on the Klyazma River about\n190\nkm east of Moscow. Later, he undertook training at the Kiev cadet corps. He completed his training in\n1896\nbefore moving to St Petersburg where he studied Latin and Greek at the Nikolayevsky engineering academy, named after Grand Duke Nicholas Nikolaevich of Russia. He left St Petersburg, returning to Kiev where he studied at the University. He graduated with the gold medal in\n1903\nand was awarded a Master's degree\n(\nequivalent to a doctorate\n)\nin\n1903\nfrom Kiev University for his thesis\nEquations of motion for conservative systems and its application\n. On\n25\nNovember\n1903\n, after the award of his Master's Degree, he was appointed as an assistant in the Department for Mechanics of Kiev University.\nBilimovic wanted to become a professor so he had to obtain a doctorate\n(\nsimilar to the German\nhabilitation\n)\n. He spent the year\n1905\n-\n06\nin Paris working with\nPaul Émile Appell\n. At this time\nAppell\nwas Dean of the Faculty of Science of the University of Paris and had an outstanding reputation for solving some of the hardest problems in mathematics and mechanics. Bilimovic then spent the following year\n1906\n-\n07\nat the University of Göttingen in Germany where he worked with\nDavid Hilbert\n. At this time\nHilbert\nwas undertaking research into integral equations, work which led him to develop functional analysis. After spending these two years abroad, Bilimovic returned to Ukraine and defended his doctoral thesis\nContact motion of rigid body, first part: Motion with one degree of freedom\nat the University of Odessa in\n1907\n. Following the successful examination, he was appointed as a\ndocent\nat Kiev University. He had begun publishing papers in\n1903\n, and his early works were on the theory of curves and surfaces. These papers were all written in Russian but, in\n1910\n, he published his first paper in German which was\n[\n1\n]\n:-\n... devoted to nonholonomic mechanics. In the paper\n[\n'Die Bewegungsleichungen konservativer Systeme mit linearen Bewegungsintegralen'\nⓉ\n(\nThe equations of motion of conservative systems with linear motion integrals\n)\n(1910)]\n, he considers the first integrals, which are linear with respect to velocities, as nonholonomic constraints. This idea permitted him to reduce a\ndynamical system\nwith\nn\nn\nn\ndegrees of freedom to a system with fewer degrees of freedom. At the end of this analysis, using the energy integral, he eliminated time in the differential equations of motion. In another paper\n[\npublished in\n1914]\n, he discovered a nonholonomic constraint and called this constraint a nonholonomic pendulum. In the same paper, he gave a method for construction of such a pendulum.\nIn\n1915\nhe was appointed as a full professor of mechanics at the Novorossisky University in Odessa. He remained there for five years before moving to Belgrade, the capital of Serbia, in\n1920\n. It was on\n20\nApril of that year that he was elected a professor in the Faculty of Philosophy at Belgrade University where he worked for the rest of his career. At first he was appointed as a 'contract professor' but on\n3\nNovember\n1926\nhe became a full professor of rational mechanics and applied mathematics\n[\n1\n]\n:-\nOne part of the life of Academician Anton Bilimovic, the longer and more important one, belongs to Belgrade, the\nSerbian Academy of Sciences\nand Arts and Belgrade University. In Belgrade he started a new life of university professor and scientist in the new milieu. He was working in Belgrade with the same mental energy as in his motherland Russia. We see that Serbia arduously accepted him. He was highly respected in Serbia.\nIn\n1929\nSerbia became part of Yugoslavia and Belgrade became the capital of the new country. At the University, Bilimovic was one of the founding members of the Belgrade school of mechanics. However, he took on a number of additional duties and positions in Belgrade. He taught mathematics at the Russian-Serbian\ngymnasium\nfrom\n1929\nto\n1936\n. He had been elected a corresponding member of the\nSerbian Academy of Sciences\nand Arts on\n18\nFebruary\n1925\nbut, on\n17\nFebruary\n1936\nhe became a full member. He was Secretary General of the Department of Natural Sciences and Mathematics of the Academy from\n1939\nto\n1940\n. He founded the Academy's mathematics journal in\n1932\nand, in\n1946\n, he was the main driving force behind the setting up of the Mathematics Institute of the\nSerbian Academy of Sciences\nand Arts.\nWe have already mentioned some of Bilimovic's mathematical contributions. His work, however, is extensive and varied\n[\n1\n]\n:-\nProfessor Bilimovic published\n138\nscientific works,\n22\nscientific papers,\n35\nbooks and textbooks, many of them with several editions,\n9\ntexts for popular use,\n15\nreviews and\n15\nreports. The main characteristic of his scientific opus is that he did not address only problems of one narrow scientific field, but Bilimovic also studied the problems of theory of curves and surface, rational mechanics, celestial mechanics and geophysics, nonanalytical functions and vector calculus. Especially in rational mechanics, he was occupied by phenomenological principles, motion of the rigid body around fixed point, dynamics of elastic bodies and equations of motion.\nLet us look at a few examples of the work he undertook while in Belgrade.\nSur le mouvement d'un corps solide avec un corps supplémentaire mobile\nⓉ\n(\nOn the movement of a solid body with a movable additional body\n)\n(1939)\nexamines the differential equations governing the motion of a system consisting of two rigid bodies\nA\nA\nA\nand\nB\nB\nB\nsubject to the constraint that the relative motion of\nB\nB\nB\nis specified as a function of the motion of\nA\nA\nA\n.\nÜber einen Sonderfall des Vierkörperproblems\nⓉ\n(\nA special case of the four-body problem\n)\n(1941)\nexamines the motion of four masses which are pairwise equal and each pair is initially symmetrically located and possesses symmetric initial velocities with respect to a line through the centre of mass of the system.\nA natural property of the differential equation of a conic section\n(\nSerbian\n)\n(1946)\ndiscusses some classical metric, intrinsic and projective relations for a conic section.\nPfaff's method in the geometrical optics\n(\nSerbian\n)\n(1946)\nderives the Hamiltonian equations in optics from Fermat's principle using vector notation.\nThe war years, during which most of the papers we have just mentioned were published, were difficult ones for Bilimovic with his Russian background. In March\n1941\nthe Yugoslav government, pressurised by the Axis powers, signed a pact with them. This led to the downfall of the Yugoslav government and the pact with the Axis countries was repudiated. Germany then invaded and quickly defeated Yugoslavia dividing it into a number of zones under German or Italian control. However, on\n22\nJune\n1941\nthe Germans broke their non-aggression pact with the Soviet Union and invaded that country. Bilimovic was now a Russian in Belgrade which was under German rule yet Germany was at war with the Soviet Union. He was suspended from his position at Belgrade University for the duration of the war but, after the war ended, he was able to take up his professorship again. He retired from his positions in the University of Belgrade on\n15\nFebruary\n1955\nbut continued to undertake research. He continued to publish articles even as he reached ninety years of age. His main interest during the years following his retirement was the theory of non-analytic functions. For example, although most of his papers were written in Serbo-Croatian, he published five papers in French during his retirement:\nApplication en hydromécanique de la mesure de déflexion d'analyticité d'une fonction nonanalytique\nⓉ\n(\nApplication in hydromechanics to the measurement of deviation of analyticity of a non-analytic function\n)\n(1956)\n;\nSur la déflexion d'une fonction non-analytique du quaternion par rapport à une fonction analytique\nⓉ\n(\nOn the deviation of a non-analytic function of the quaternion with respect to an analytical function\n)\n(1957)\n;\nSur les transformations des fonctions non analytiques\nⓉ\n(\nOn the transformation of non-analytic functions\n)\n(1958)\n;\nSur les lignes principales des fonctions non analytique\nⓉ\n(\nOn the main lines of non-analytic functions\n)\n(1960)\n; and\nSur les modes divers de traitement des fonctions complexes non analytique\nⓉ\n(\nOn the various modes of treatment of non-analytic complex functions\n)\n(1966)\n.\nHe published a book in\n1964\n(\nwhen he was\n85\nyears old\n)\nentitled\nOn a general phenomenological differential principle\n. Kazuo Takano writes in a review:-\nPfaff\n's linear form or\nPfaff\n's expression\n[\nare named\n]\nafter\nJohann Friedrich Pfaff\n, who founded the theory of such differential forms.\nPfaff\n's expression and\nPfaff\n's equations are closely related to other mathematical concepts, which occupy an important place in modern mathematics. Applications of integral invariants were made by\nHenri Poincaré\n,\nÉlie Cartan\nand\nGeorge Birkhoff\nfor the first time, and the relationships between the theory of integral invariants and\nPfaff\n's expression underlines the importance. On the other hand, the so-called Pfaff method in mechanics was presented for the first time by\nEdmund Taylor Whittaker\nin\n1904\n. The relation between\nPfaff\n's expression and differential equations in canonical form was established by George Prange and Ernst Schering. In his preface Bilimovic first gives the phenomenological interpretation of a principle of mechanics which is called\nPfaff\n's principle and the substance of which, in a different form, has been known for quite a long time. The applications of that principle have proved to be very convenient, its theory being, especially in recent time, evaluated very intensively. Then, he uses that principle for the formulation of a general phenomenological differential principle. The phenomenological derivation of that principle and the phenomenological interpretation of its procedure, i.e., its algorism, is the main purpose of this treatise.\nLet us end this article by quoting from\n[\n1\n]\nDorde Dukic's description of Bilimovic.\n[\nWe note that Dukic was a Ph.D. student at Belgrade at the time of Bilimovic's death\n]\n:-\nHe was a great example of how to become a good teacher and a good man. From his students he always required hard work and a deep understanding of the studied material. He did not like students whose hard work was consisting just of mental learning. He started and finished lessons exactly at a scheduled time. When once he was late for the lesson, he apologised and formulated the following theorem: \"Even when professor is late, there always will be a student who arrives later\". Just then one student entered the classroom. Professor Bilimovic said to students: \"Now, the theorem is proved.\"",
  "matematicos_citados_na_biografia": [
    "habilitation",
    "Paul Émile Appell",
    "Appell",
    "David Hilbert",
    "Hilbert",
    "docent",
    "dynamical system",
    "Serbian Academy of Sciences",
    "gymnasium",
    "Pfaff",
    "Johann Friedrich Pfaff",
    "Henri Poincaré",
    "Élie Cartan",
    "George Birkhoff",
    "Edmund Taylor Whittaker"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}