{
  "nome_completo": "Archytas of Tarentum",
  "nome_curto": "Archytas",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Archytas/",
  "data_nascimento": "about 428 BC",
  "local_nascimento": "Tarentum, Magna Graecia (now Taranto, Italy)",
  "data_morte": "about 350 BC",
  "local_morte": null,
  "summary": "Archytas was a Greek mathematician, statesman and philosopher who worked on the harmonic mean and the problem of duplicating the cube.",
  "biografia": "Archytas of Tarentum\nwas a mathematician, statesman and philosopher who lived in Tarentum in Magna Graecia, an area of southern Italy which was under Greek control in the fifth century BC. The Pythagoreans, who had at one stage been strong throughout Magna Graecia, were attacked and expelled until only the town of Tarentum remained a stronghold for them. Archytas led the Pythagoreans in Tarentum and tried to unite the Greek towns in the area to form an alliance against their non-Greek neighbours. He was commander in chief of the forces in Tarentum for seven years despite there being a law that nobody could hold the post for more than a year.\nPlato\n, who became a close friend, made his acquaintance while staying in Magna Graecia.\nHeath\nwrites in\n[\n4\n]\n:-\n... he is said, by means of a letter, to have saved\nPlato\nfrom death at the hands of Dionysius.\nIn fact\nPlato\nmade a number of trips to Sicily and it was on the third of these trips in\n361\nBC that he was detained by Dionysius II.\nPlato\nwrote to Archytas who sent a ship to rescue him. For more details on the relationship between Archytas and\nPlato\nconsult the interesting article\n[\n8\n]\n.\nGiven the above story and the conclusion that Archytas came after\nSocrates\n, it may seem strange to include him in works on pre-socratic philosophers as is done in\n[\n3\n]\n. This is done, however, because of the style of Archytas's philosophy rather than the strict chronology.\nArchytas was a pupil of\nPhilolaus\nand so was a firm supporter of the philosophy of\nPythagoras\nbelieving that mathematics provided the path to the understanding of all things. Although Archytas studied many topics, since he was a Pythagorean, mathematics was his main subject and all other disciplines were seen as dependent on mathematics. He claimed that mathematics was composed of four branches, namely geometry, arithmetic, astronomy and music. He also believed that the study of mathematics was important in other respects as a fragment of his writings that has been preserved shows\n(\nsee\n[\n3\n]\nor\n[\n6\n]\n)\n:-\nMathematicians seem to me to have excellent discernment, and it is not at all strange that they should think correctly about the particulars that are; for inasmuch as they can discern excellently about the physics of the universe, they are also likely to have excellent perspective on the particulars that are. Indeed, they have transmitted to us a keen discernment about the velocities of the stars and their risings and settings, and about geometry, arithmetic, astronomy, and, not least of all, music. These seem to be sister sciences, for they concern themselves with the first two related forms of being\n[\nnumber and magnitude\n]\n.\nThis fragment comes from the preface to one of his works which some claim was entitled\nOn Mathematics\nwhile others claim that it was entitled\nOn Harmonics\n. Certainly, coming after this quote, there is a discussion of pitch, frequency and a theory of sound. It does contain some errors but it is still a remarkable piece of work and formed the basis for the theory of sound in the writings of\nPlato\n.\nArchytas worked on the harmonic mean and gave it that name\n(\nit had been called sub-contrary in earlier times\n)\n. The reason he worked on this was his interest in the problem of\nduplicating the cube\n, finding the side of a cube with volume twice that of a given cube.\nHippocrates\nreduced the problem to finding two mean proportionals. Archytas solved the problem with a remarkable geometric solution\n(\nnot of course a\nruler and compass\nconstruction\n)\n.\nOne interesting innovation which Archytas brought into his solution of finding two mean proportionals between two line segments was to introduce movement into geometry. His method uses a semicircle rotating in three dimensional space and the curve formed by it cutting another three dimensional surface.\nWe know of Archytas's solution to the problem of duplicating the cube through the writings of\nEutocius\nof Ascalon. In these\nEutocius\nclaims to quote the description given in\nHistory of geometry\nby\nEudemus\nof Rhodes but the accuracy of the quotation is doubted by the authors of\n[\n10\n]\n.\nAnother interesting mathematical discovery due to Archytas is that there can be no number which is a geometric mean between two numbers in the ratio\n(\nn\n+\n1\n)\n:\nn\n(n+1) : n\n(\nn\n+\n1\n)\n:\nn\n. The most interesting thing about his proof is that it is close to that given by\nEuclid\nmany years later, and also that it quotes known theorems which would later appear in\nEuclid\n's\nElements\nBook VII.\nThe arguments just given led\nvan der Waerden\nto claim\n(\nsee for example\n[\n5\n]\n)\nthat many of the results which appear in Book VII of the\nElements\npredate Archytas. Clearly, he claims, there were some works, written many years before\nEuclid\nwrote the\nElements\n, which covered the same material. Archytas built on this earlier work and his discoveries are then largely those presented by\nEuclid\nin the\nElements\nBook VIII. Following these arguments of\nvan der Waerden\nit is now widely accepted that\nEuclid\nborrowed Archytas's work for Book VIII of the\nElements\n.\nArchytas is sometimes called the founder of mechanics and he is said to have invented two mechanical devices. One device was a mechanical bird\n[\n2\n]\n:-\nThe bird was apparently suspended from the end of a pivoted bar, and the whole apparatus revolved by means of a jet of steam or compressed air.\nAnother mechanical device was a rattle for children which was useful, in\nAristotle\n's words\n(\nsee for example\n[\n4\n]\n)\n:-\n... to give to children to occupy them, and so prevent them from breaking things about the house\n(\nfor the young are incapable of keeping still\n)\n.\nThis does seem a remarkably modern thought for an inventor in\n400\nBC! In fact this interest in applying mathematics is in contrast to the pure mathematical ideas of\nPlato\nand this contrast formed the basis for a poem written by the Polish author C K Norwid\n(1821\n-\n1883)\n. This fascinating poem is discussed and given in French translation by\nMarczewski\nin\n[\n9\n]\n.\nSimplicius\n, in his\nPhysics\n, quotes Archytas's view that the universe is infinite\n(\nin\nHeath\n's translation\n[\n4\n]\n)\n:-\nIf I were at the outside, say at the heaven of the fixed stars, could I stretch my hand or my stick outward or not? To suppose that I could not is absurd: and if I can stretch it out, that which is outside must be either body or space\n(\nit makes no difference which it is as we shall see\n)\n. We may then in the same way get to the outside of that again, and so on, asking on arrival at each new limit the same question; and if there is always a new place to which the stick may be held out, this clearly involves extension without limit. If now what so extends is body, the proposition is proved; but even if it is space, then, since space is that in which body is or can be, and in the case of eternal things we must treat that which potentially is as being, it follows equally that there must be body and space extending without limit.\nWhen it came to a philosophy of politics and\nethics\n, again Archytas based his ideas on mathematical foundations. He wrote\n(\nsee for example\n[\n3\n]\nor\n[\n6\n]\n)\n:-\nWhen mathematical reasoning has been found, it checks political faction and increases concord, for there is no unfair advantage in its presence, and equality reigns. With mathematical reasoning we smooth out differences in our dealings with each other. Through it the poor take from the powerful, and the rich give to the needy, both trusting in it to obtain an equal share...\nFinally we quote again from the writings of Archytas about his theory of how to learn. The fragment appears in\n[\n3\n]\nor\n[\n6\n]\n:-\nTo become knowledgeable about things one does not know, one must either learn from others or find out for oneself. Now learning derives from someone else and is foreign, whereas finding out is of and by oneself. Finding out without seeking is difficult and rare, but with seeking it is manageable and easy, though someone who does not know how to seek cannot find.",
  "matematicos_citados_na_biografia": [
    "Plato",
    "Heath",
    "Socrates",
    "Philolaus",
    "Pythagoras",
    "duplicating the cube",
    "Hippocrates",
    "ruler and compass",
    "Eutocius",
    "Eudemus",
    "Euclid",
    "van der Waerden",
    "Aristotle",
    "Marczewski",
    "Simplicius",
    "ethics"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}