{
  "nome_completo": "Arne Carl-August Beurling",
  "nome_curto": "Arne Beurling",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beurling/",
  "data_nascimento": "3 February 1905",
  "local_nascimento": "Gothenburg, Sweden",
  "data_morte": "20 November 1986",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "Arne Beurling was a Swedish mathematician who worked in harmonic analysis, complex analysis and potential theory.",
  "biografia": "Arne Beurling\n's father was Konrad Gustaf Verner Beurling\n(18\nSeptember\n1872\n-\n19\nFebruary\n1959)\n. He was a sea captain who owned land in Dalstand, west Sweden, where he used to go hunting and fishing. He was described as a small hot-tempered man who often used to dress in knickerbockers. It is said that when he fell out with someone he would tell them about the people he had shot. In\n1900\nKonrad married Elsa Eva Elisabet Raab\n(15\nMay\n1878\n-\n12\nMarch\n1957)\nthe daughter of the Jakob Carl-August Raab and Emma Christina Samuelsdotter. Jakob Raab, who had served in the military, was an expert in crop production and soil management. After marrying, Konrad abandoned his life as a seaman and became a property owner. Konrad and Elsa Beurling had two sons, Ake Gustaf Beurling, born on\n16\nMay\n1902\n, and Arne, the subject of this biography, born in February\n1905\n. In\n1908\nKonrad and Elsa were divorced and Elsa, who now called herself \"Baroness\", chose to again be known by her maiden name of Elsa Raab. Arne was brought up by his mother and her lady companion called Titti. Konrad remarried Anna Maria Ulrika Fredholm and they lived at Margreteberg not far from Vanersborg. His marriage, together with successful purchase and sales of property, saw him become wealthy. With his second wife, Konrad had a daughter Mary, born in\n1910\n. From\n1921\nuntil\n1957\nKonrad lived in Dalskog where he was able to enjoy his passion for hunting and fishing.\nAlthough Beurling was brought up by his mother, he spent time with his father and they would go hunting together. Beurling, like his father, had a fiery temper and could suddenly fly off into a rage. Although Beurling got on well with his father, nevertheless, given they both had a temper it is not surprising that they often had arguments and, it is said, sometimes physical fights. He attended a coeducational secondary school in Gothenburg and graduated in\n1924\n. His father Konrad was so confident at this stage that his son would become a professor that he told all his friends \"He is going to be a professor.\" In the year he graduated from high school, Beurling began studying at Uppsala University. After his first degree he undertook research with\nAnders Wiman\nas his thesis advisor. He was also strongly influenced by another of his teachers Erik Holmgren. In the middle of his studies he took a year out to go alligator hunting with his father in Panama. Beurling was certainly not reluctant to take this break in his studies. He was outdoorsman who loved adventures and sailing, and he loved the adventure to Panama with his father. Parts of his thesis were written in\n1929\n, in particular his proof of the\nDenjoy\nconjecture concerning asymptotic values of an\nentire function\n. However, he was not the first to publish a proof of this conjecture since\nLars Ahlfors\npublished his proof of the conjecture in\n1929\n.\nAhlfors\nwrote\n(\nsee for example\n[\n4\n]\n)\n:-\nIt is not unusual that the same mathematical idea will surface, independently, in several places, when the time is ripe. My habits at the time did not include regular checking of the periodicals, and I was not aware that the German mathematician Herbert Grötzsch had published papers based on ideas similar to mine, which he too could have used to prove the\nDenjoy\nconjecture. Neither could I have known that Arne Beurling had found a different proof in\n1929\nwhile hunting alligators in Panama. ... It is interesting that we all used essentially the same distortion theorem for conformal mapping.\nAt this stage, however, Beurling did not complete his doctorate but undertook compulsory military service in\n1930\n-\n31\n. During his service he distinguished himself as a cryptanalyst. The fact that\nAhlfors\nhad published the proof of the\nDenjoy\nconjecture delayed the submission of Beurling's thesis which had already been delayed by the year in Panama and the year of military service. However, he obtained a doctorate in\n1933\nwith an outstanding thesis\nÉtudes sur un problème de majoration\n. Beurling's thesis is described by\nAhlfors\nand\nCarleson\nas follows\n[\n6\n]\n:-\nIt was not a mere collection of interesting and important results, but also a whole programme for research in function theory in the broadest sense. As such it has been one of the most influential mathematical publications in recent times. ... Beurling's leading idea was to find new estimates for the harmonic measure by introducing concepts, and problems, which are inherently invariant under conformal mapping. The novelty in his approach was to apply the majorization to entities, mostly of a geometric character, which are not by themselves invariant, but whose extreme values, in one sense or another, possess this property. The method may have been used before, but not in this systematic manner.\nHe taught at Uppsala from\n1932\nto\n1954\nbecoming professor of mathematics there in\n1937\n. In\n1936\nhe married Britta Lisa Sofia Östberg\n(3\nNovember\n1907\n-\n25\nJuly\n1971)\n, the daughter of Henrik and Gerda Östberg. Arne and Britta Beurling had two children, Pher-Henrik Konrad Beurling born\n11\nDecember\n1936\n(\ndied\n26\nApril\n1962)\nand Christina born in\n1938\n. They were divorced in\n1940\n.\nDuring World War II, Beurling worked on cracking the German codes. Many other top mathematicians did similar work but details are still hard to obtain. Kjellberg writes in\n[\n8\n]\n:-\nBeurling was one of the most charming persons you could meet. He had a very strong feeling for justice and fair play. During World War II he decoded in two weeks\n(\nin summer\n1940)\nthe German G-Schreiber message code, so all German troop movements were known to the Swedish command.\nUlfving writes\n[\n10\n]\n:-\nIt is now known that Professor Arne Beurling was the man behind the breaking of the German Geheimschreiber. David Kahn writes in \"The Codebreakers\":\nQuite possibly the finest feat of cryptoanalysis performed during the Second World War was Arne Beurling's solution of the secret of the Geheimschreiber.\nArne Beurling's greatness is given by the fact he had at his disposal only the teleprinter tapes with the cipher text. He had no access to any machine. Everything had to be reconstructed, something which was done in a remarkably short time. It is known that he based his analysis on only\n24\nhours of traffic intercepted on\n25\nMay\n1940\n. A quick analysis showed that the first assumptions probably were correct. A check was made with the traffic intercepted on\n27\nMay. Two weeks later the construction principles for the cipher machine were solved. On the other hand it is not known how he set about it. That secret Arne Beurling took with him to the grave.\nWe have explained above that Beurling had a quick temper but we must not give the impression that he was not a kind human being. The following story, told in\n[\n3\n]\n, illustrates this:-\nIn\n1944\nBeurling, as soon as he heard that\nAhlfors\nhad come to Sweden, invited him to Uppsala. There he helped\nAhlfors\nrent a small room and gave him an office in the mathematics department. He showed hospitality in many other ways, too, and arranged teaching work, which remuneration was very welcome to the empty-pocketed\nAhlfors\n.\nAhlfors\nspent a lot of time in Uppsula during his wait. The discussions he engaged in there with Beurling laid the foundations for their future mathematical collaboration. Within a few years their joint work was producing significant results in complex analysis. During their time in Sweden, the\nAhlfors\nfamily underwent a devastating tragedy. Their small boy, Christoffer while playing at home, died of an electric shock. Lars was then on a lecture visit to Uppsala and heard the traumatic news first from Beurling. In Lars' words: \"Never in my life have I witnessed anybody handle such a difficult assignment with greater tact and compassion. It seemed to me that Arne's extraordinary sensitivity had raised our friendship to a level that I had not experienced before, and from that moment on, I have come to regard Arne as the personification of what true friendship can be.\" When Beurling died forty years later,\nAhlfors\nbegan his eulogy at Princeton with the words: \"Arne Beurling was the best friend I ever had.\"\nDuring the session\n1948\n-\n49\nBeurling was a visiting professor at Harvard in the United States. John Wermer writes\n[\n11\n]\n:-\nBeurling's lectures were like nothing else. He took up a large number of problems in pure an applied analysis, everything based on his own results. The participants were top level -\nLars Ahlfors\nwas there - except for a few rookies like me. We had to work hard, and we must have seemed amusingly naive to Beurling. \"You Harvard men seem to be afraid of integral signs,\" he exclaimed on one occasion.\nAfter the year at Harvard, he returned to Sweden. In\n1950\nhe married Karin Viola Lindblad\n(\nborn\n11\nMarch\n1920)\n, daughter of ironmonger Henric Lindblad and his wife Wanja Bengtsson; they had one child. Then, in\n1954\nhe emigrated permanently to the United States and became a professor at the Institute for Advanced Study at Princeton. He retired in\n1973\nand was named professor emeritus.\nBeurling worked on the theory of generalized functions,\ndifferential equation\n, harmonic analysis,\nDirichlet\nseries and\npotential theory\n. The concepts of energy and the\nDirichlet\nintegral took Beurling to a global axiomatic theory called the theory of\nDirichlet\nspaces for complex functions. Among his papers let us mention\nExceptional sets\n(1935)\n,\nSur les intégrales de Fourier absolument convergentes et leur application à une transformation fonctionelle\nⓉ\n(\nOn absolutely convergent Fourier integrals and their application to a functional transformation\n)\n(1938)\n,\nSur les spectres des fonctions\nⓉ\n(\nOn the spectra of functions\n)\n(1949)\n,\n(\nwith Ahlfors\n)\nOn the boundary correspondance under quasi-conformal map\n(1956)\n, and\n(\nwith Paul Malliavin\n)\nOn the closure of characters and the zeros of entire functions\n(1967)\n. Describing their work on this last mentioned paper, Malliavin writes\n[\n7\n]\n:-\nWe devoted half of the academic year\n1960\n-\n1961\nto this problem; very often I stayed at Beurling's house for a full night of cooperative work. I was made welcome there by Mrs Beurling, a former distinguished PhD student at Uppsala University, where she had been president of the association of graduate students. Mrs Beurling worked in a Chemistry lab at Princeton University. Although very occupied by her scientific work, she was kind enough to prepare a supper for our half night break. In June\n1961\nwe completed  all our results. I presented mimeographed notes of their proofs at the summer school in Harmonic Analysis, organized by\nPeter Lax\nat Stanford University in August\n1961\n. Nevertheless Beurling was not \"aesthetically\" satisfied with these proofs. It took us the fall quarter of\n1966\nat the Institute to write the final version which appeared in 'Acta'\n1967\n.\nLennart Carleson\nwas a research student of Beurling and completed his doctoral thesis in\n1950\n. He explained the way that Beurling worked\n[\n7\n]\n:-\nWe learned much on mathematical research through Beurling's seminars. They took place every second Tuesday,\n6\n-\n8\npm, when Beurling invariably would talk about his own work\n(\nhe did not read much\n)\n. The department was at Trädgardsgatan\n18\nand he would usually work at home in number\n12\nand at night. One should not believe that it all came by divine inspiration. His neighbours would tell how he walked back and forth\n(\nthe worst being that he sometimes stopped!\n)\n.\nBeurling received many honours for his outstanding contributions. He was elected to membership of the\nRoyal Swedish Academy of Sciences\n, the\nFinnish Academy of Sciences\n, the Royal Physiographical Society in Lund, Sweden, the\nDanish Academy of Sciences\n, and the\nAmerican Academy of Arts and Sciences\n. The\nSwedish Mathematical Society\nalso recognised his achievements by electing him to honorary membership. Among the prizes he was awarded we mention in particular the\nSwedish Academy of Sciences\nPrize in\n1937\nand again in\n1946\n, the\nCelsius\nGold Medal in\n1961\n(\nhe was the first recipient\n)\n, and the University of Yeshiva Science Award in\n1963\n. In\n1976\n-\n77\nthe\nMittag-Leffler\nInstitute in Stockholm held a \"Beurling Year\". It is interesting to note that Beurling had been offered the directorship of the\nMittag-Leffler\nInstitute before emigrating to the United States but had turned the offer down.\nThe authors of\n[\n6\n]\nwrite:-\nArne Beurling was a highly creative mathematician whose legacy will influence future mathematicians for many years to come, maybe even for generations. Anybody who was close to him was influenced by his strong personality and by his intense commitment to mathematics. He published very selectively and only when all details were resolved, and a sizable part of his work has never appeared in print. There are plans to publish his collected works in the near future, and they will include much that has not been previously available to the mathematical public. Beurling's personal friends and students will never forget his unquestioning loyalty and boundless generosity. His readiness to share his ideas was unselfish in the extreme.\nPaul Malliavin was strongly influenced by Beurling and his work. He gave a lecture\nArne Beurling - a visionary mathematician\n(\nin\n[\n7\n]\n)\nwhich he ended as follows:-\nIn my youth Beurling appeared to me more as a mathematician working on hard concrete problems than an abstract theory builder. Sixty years later Beurling appears now to me more as the key initiator of important theories than a problem solver. How can we explain this paradox? After having got sharp results, Beurling waited for their publication until he reached a proof which quoting his own words must be \"elementary and transparent\". This, sometimes strenuous, search for beauty in the proofs explains why, starting from concrete problems, Beurling reached basic general principles of universal applicability. The far reaching consequences of this Beurling's quest for Beauty illustrate magnificently the Unity of Mathematics and, by consequence, its transcendental Truth.\nYngve Domar, one of Beurling's students in the\n1940\ns, is quoted in\n[\n1\n]\nas follows:-\n... if the label\n[\nof genius\n]\nis to be put on anybody, then the right thing is to put it on Beurling. Beurling was a pioneer. He never based his results on what others did, but attacked new problems with fresh methods in a very powerful way. His powers of concentration were enormous, and he could keep lots in his head. When Beurling wrote a mathematical paper, even a short one, other mathematicians took up the thread and developed new theories based on his work.\nLennart Carleson\nwrote\n(\nsee for example\n[\n1\n]\n)\n:-\nBeurling had a complicated and passionate relationship to mathematics. It is said about\nNewton\nthat he looked at the universe as a cryptogram, created by God for the scientist to cryptanalyse. I think that was the way Beurling thought of mathematics. Only pure, beautiful theories were accepted: he had something of an artist's attitude when gauging his own work, and that of others. He took pride in presenting his results so that the way he discovered them was completely hidden. \"A magician does not reveal his tricks,\" he used to say.\nIt seems appropriate to end this short biography with words written by\nAhlfors\nabout Beurling in\nThe collected works of Arne Beurling\n(\nBirkhäuser, Boston,\n1989)\n:-\n... there was a streak of genius in everything he did.",
  "matematicos_citados_na_biografia": [
    "Anders Wiman",
    "Denjoy",
    "entire function",
    "Lars Ahlfors",
    "Ahlfors",
    "Carleson",
    "differential equation",
    "Dirichlet",
    "potential theory",
    "Peter Lax",
    "Lennart Carleson",
    "Royal Swedish Academy of Sciences",
    "Finnish Academy of Sciences",
    "Danish Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Swedish Mathematical Society",
    "Swedish Academy of Sciences",
    "Celsius",
    "Mittag-Leffler",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}