{
  "nome_completo": "Arthur Stanley Eddington",
  "nome_curto": "Arthur Eddington",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eddington/",
  "data_nascimento": "28 December 1882",
  "local_nascimento": "Kendal, Westmorland, England",
  "data_morte": "22 November 1944",
  "local_morte": "Cambridge, England",
  "summary": "Eddington made important contributions to the theory of general relativity.",
  "biografia": "Arthur Eddington\n's father, Arthur Henry Eddington, taught at a Quaker training college in Lancashire before moving to Kendal to become headmaster of Stramongate School. He died of typhoid in an epidemic which swept the country in\n1884\nbefore his son was two years old. Arthur Eddington's mother, Sarah Ann Shout, came from Darlington and, like her husband, was also from a Quaker family. On Arthur Henry Eddington's death she was left to bring up Arthur and his older sister with relatively little income. The family moved to Weston-super-Mare where at first Arthur was educated at home before spending three years at a preparatory school.\nIn\n1893\nArthur entered Brymelyn School in Weston-super-Mare which was mainly for boarders but he did not board at the school, being one of a small number of day pupils. The school provided a good education within the limited resources available to it and allowed Arthur to excel in mathematics and English literature. His progress through the school was rapid and he earned high distinction in mathematics. The level to which the school was able to take Arthur was, however, not very advanced and his good grounding in mathematics stopped short of reaching the differential and integral calculus.\nIn\n1898\nhe was awarded a scholarship of £\n60\na year for three years by Somerset County\n(\nWeston-super-Mare is now in Avon but it was at that time in Somerset\n)\n. Eddington had not reached sixteen years of age at the time, and so officially he was too young to enter university. It was a problem which was solved quickly, however, and did not cause him to delay his entry to Owens College, Manchester which he attended from\n1898\nto\n1902\n. In his first year of study Eddington took general subjects before spending the next three years studying mainly physics. Although on a physics course, Eddington attended the mathematics lectures, being greatly influenced by one of his mathematics teachers,\nHorace Lamb\n. Of course the financial position of his family meant that they were not able to provide him with financial support but his outstanding academic work allowed him to win a number of highly competitive scholarships to provide enough money to let him complete his B.Sc. course with First Class Honours in\n1902\n.\nHe was awarded a Natural Science scholarship of £\n75\na year to study at Trinity College, Cambridge, near the end of\n1901\n. Entering Trinity in\n1902\nhe received, in March\n1903\n, a Mathematics Scholarship of £\n100\na year instead of the Natural Science scholarship. At Trinity he was taught by\nE T Whittaker\n,\nA N Whitehead\nand\nE W Barnes\n. He became Senior\nWrangler\nin the Mathematical Tripos in\n1904\nand graduated with a M.A. in the following year. After graduating, he began a research project in the Cavendish Laboratory on thermionic emission but it appears not to have gone too well and he gave up the project. He began research in mathematics, also in\n1905\n, but this was no more successful than his work in physics although he was to make use of the ideas many years later when he applied these early research ideas in mathematics to an astronomy problem.\nBefore the end of\n1905\nEddington had made the move to astronomy with his appointment to a post at the Royal Observatory at Greenwich. Astronomy had been a topic of interest to him from an early age and he had been given a loan of a\n3\ninch telescope when less than\n10\nyears old which had heightened his interest. On being appointed to fill a vacancy at the Royal Observatory he was immediately involved with a research project which had been underway since\n1900\nwhen photographic plates of Eros had been taken over the period of a year. Eddington's first task was to complete the reduction of these photographic observations to determine an accurate value for the solar parallax.\nPlummer\nwrites in\n[\n18\n]\n:-\nHe had introduced his method of analysis of two star-drifts, and his prevailing interest in statistical stellar astronomy was concentrated on the systematic motions and distribution of the stars throughout his Greenwich years.\nEddington was a Smith's prize winner for an essay on the proper motions of stars in\n1907\n, and he was awarded a Trinity College Fellowship.\nGeorge Darwin\n, a son of Charles Darwin and Plumian professor of astronomy at Cambridge, died in December\n1912\n. In\n1913\nEddington was appointed to fill the vacant position of Plumian Professor of Astronomy. There were in fact two chairs of astronomy at Cambridge, the other being the Lowndean chair. Originally the Plumian chair covered the experimental side of the subject while the Lowndean chair covered the theoretical side. Although this distinction had become somewhat blurred over the years the appointment of Eddington was certainly seen as an appointment in experimental astronomy. However, the holder of the Lowndean chair died towards the end of\n1913\nand, in\n1914\n, Eddington became director of the Cambridge Observatory. In doing so he effectively took over responsibility for both theoretical and experimental astronomy at Cambridge. Shortly after his appointment as director of the Cambridge Observatory he was elected a Fellow of the\nRoyal Society\n.\nShortly after taking up his role of leading astronomy research at Cambridge, World War I broke out. As we noted above Eddington came from a Quaker tradition and, as a conscientious objector, he avoided active war service and was able to continue his research at Cambridge during the war years of\n1914\n-\n18\n. This was, however, not an easy time for him giving him a highly stressful period right at the beginning of his tenure of the Cambridge chair.\nEddington made important contributions to the theory of general relativity. His interest in this topic started in\n1915\nwhen he received papers by\nEinstein\nand by\nde Sitter\nwhich came to him via the\nRoyal Astronomical Society\n. He became interested in this theory, particularly since it provided an explanation for the previously noticed, but unexplained, advance of the perihelion of Mercury. He lectured on relativity at the\nBritish Association\nmeeting in\n1916\nand produced a major report on the topic for the Physical Society in\n1918\n.\nIn the following year Eddington led an eclipse expedition to Principe Island in West Africa. Its aim was to verify the bending of light passing close to the sun which was predicted by relativity theory. At that time such observations of stars close to the sun in the sky could only be made during a total eclipse. He sailed from England in March\n1919\nand by mid-May had his instruments set up on Principe Island. The eclipse was due to occur at two o'clock in the afternoon of\n29\nMay but that morning there was a storm with heavy rain. Eddington wrote\n(\nsee for example\n[\n6\n]\n)\n:-\nThe rain stopped about noon and about\n1\n.\n30\n... we began to get a glimpse of the sun. We had to carry out our photographs in faith. I did not see the eclipse, being too busy changing plates, except for one glance to make sure that it had begun and another half-way through to see how much cloud there was. We took sixteen photographs. They are all good of the sun, showing a very remarkable prominence; but the cloud has interfered with the star images. The last few photographs show a few images which I hope will give us what we need ...\nHe remained on Principe Island to develop the photographs and to try to measure the deviation in the stellar positions. The cloud made the plates of poor quality and hard to measure. On\n3\nJune he recorded in his notebook:-\n... one plate I measured gave a result agreeing with\nEinstein\n.\nThe results from the Africa expedition provided the first confirmation of Einstein's theory that gravity will bend the path of light when it passes near a massive star. Eddington wrote, in a parody of the\nRubaiyat\nof\nOmar Khayyam\n(\nsee for example\n[\n6\n]\n)\n:-\nOh leave the Wise our measures to collate\nOne thing at least is certain, light has weight\nOne thing is certain and the rest debate\nLight rays, when near the Sun, do not go straight.\nEddington lectured on relativity at Cambridge, giving a beautiful mathematical treatment of the topic. He used these lectures as a basis for his book\nMathematical Theory of Relativity\nwhich was published in\n1923\n.\nEinstein\nsaid that this work was:-\n... the finest presentation of the subject in any language.\nIn addition to his work in relativity theory Eddington also did important work on the internal structure of stars. He discovered the mass-luminosity relationship for stars, he calculated the abundance of hydrogen, and he produced a theory to explain the pulsation of Cepheid variable stars. His early research on this is contained in the important work\nThe Internal Constitution of Stars\n(1926)\n. Eddington had a long running argument with\nJames Jeans\nover the mechanism by which energy was created in stars. He wrote, correctly of course, that as to the process of generating energy:-\n... probably the simplest hypothesis ... is that there may be a slow process of annihilation of matter.\nJeans\n, however, favoured the theory that the energy was the result of contraction. Of course this is not entirely wrong since a star when it forms will initially heat up under the energy generated by contraction before nuclear reactions begin and then provide the energy source for most of the star's life.\nAmong Eddington's many books were philosophical works such as\nThe Nature of the Physical World\n(1928)\n,\nNew Pathways of Science\n(1935)\nand\nThe Philosophy of Physical Science\n(1939)\n. Eddington's rather unusual view of the importance of the history of a subject comes over in these works. He believed that familiarity with the history of a subject was a hindrance to creative research in that subject. The authors of this archive would have to register their strong disagreement with Eddington on this issue!\nEddington had a fascination with the fundamental constants of nature and produced some surprising numerical coincidences most of which were published after his death in\nFundamental Theory\n(1946)\n, a book prepared for publication by\nWhittaker\n. He writes in that book that his aim was to determine the relation between the sizes of different physical systems. Ronan writes\n[\n20\n]\n:-\nEddington, hard-headed mathematician and down-to-earth astronomer though he might be, possessed a mystical side to his nature and the last years of his life were spent in an attempt to construct a huge relativistic synthesis of the physical universe, an edifice in which the bricks would be subatomic and astronomical evidence of the observer and the mortar the underlying mathematical relationships between them.\nIn\n[\n9\n]\nKilmister\ndelves deeply into the ideas which led Eddington to the theories he put forward in\nFundamental Theory\nin attempting to unite quantum mechanics and general relativity.\nKilmister\nexplains how Eddington considered that epistemology is at the basis of physics, that physical laws and physical constants are the consequences of the condition of observation. It was\nDirac\n's\n1928\npaper on the wave equation of the electron which had first set Eddington on the path of seeking ways to unify quantum mechanics and general relativity.\nKilmister\nexplains how\nDirac\n's use of spinors had surprised Eddington and led him to study a generalisation of the\nDirac\nalgebra. His work on algebras which would give a symmetrical description of nature is also examined in\n[\n21\n]\n.\nEddington was knighted in\n1930\nand received the Order of Merit in\n1938\n. He received many other honours including gold medals from the Astronomical Society of the Pacific\n(1923)\n, the\nRoyal Astronomical Society\n(1924)\n, The National Academy of Washington\n(1924)\n, the French Astronomical Society\n(1928)\n, and the\nRoyal Society\n(1928)\n. In addition to election to the\nRoyal Society\n, he was elected to the\nRoyal Society of Edinburgh\n, the\nRoyal Irish Academy\n, the\nNational Academy of Sciences\n, the\nRussian Academy of Sciences\n, the\nBerlin Academy of Sciences\nand many others. He was invited to give the Bakerian Lecture of the\nRoyal Society of London\nin\n1926\nwhen he lectured on\nDiffuse matter in interstellar space\n.\nPlummer\nwrites in\n[\n18\n]\n:-\nTo his splendid equipment as a mathematical physicist he owed much ... A bold imagination was coupled with an exceptional knowledge of those features which are accessible to observation. ... To launch out into unknown seas, to be venturesome even at the risk of error, Eddington felt himself called, and the reward of the pioneer came to him. ... Simplicity and modesty were his outstanding characteristics ...\nEddington's achievements are summed up in\n[\n3\n]\nas follows:-\nHe was a gifted astronomer whose original theories and powers of mathematical analysis took his science a long way forward; he was a brilliant expositor of physics and astronomy, able to communicate the most difficult conceptions in the simplest and most fascinating language; and he was an able interpreter to philosophers of the significance of the latest scientific discoveries.",
  "matematicos_citados_na_biografia": [
    "Horace Lamb",
    "E T Whittaker",
    "A N Whitehead",
    "E W Barnes",
    "Wrangler",
    "Plummer",
    "George Darwin",
    "Royal Society",
    "Einstein",
    "de Sitter",
    "Royal Astronomical Society",
    "British Association",
    "Omar Khayyam",
    "James Jeans",
    "Jeans",
    "Whittaker",
    "Kilmister",
    "Dirac",
    "Royal Society of Edinburgh",
    "Royal Irish Academy",
    "National Academy of Sciences",
    "Russian Academy of Sciences",
    "Berlin Academy of Sciences",
    "Royal Society of London"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}