{
  "nome_completo": "Arthur Hinton Read",
  "nome_curto": "Arthur Read",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Read/",
  "data_nascimento": "12 October 1920",
  "local_nascimento": "Sydney, New South Wales, Australia",
  "data_morte": "2 December 1961",
  "local_morte": "Aonach Eagach, Glencoe, Scotland",
  "summary": "Arthur Hinton Read was brought up in St Andrews, worked at Bletchley Park during World War II and then joined the staff in the St Andrews University Mathematics Department. He was awarded a Ph.D. by Harvard for studies supervised by Ahlfors. He died in an avalanche in the Scottish Highlands.",
  "biografia": "Arthur Hinton Read\nwas the son of John Read\n(1884\n-\n1963)\nand Ida Suddards\n(1887\n-\n1981)\n. John Read, born in Maiden Newton, Dorset, England, had studied chemistry, been awarded a Ph.D. from the University of Zurich, and worked at Manchester and Cambridge before being appointed Professor of Organic Chemistry at the University of Sydney, Australia in\n1916\n. He sailed from Liverpool but the ship was involved in a collision and he had to make a second attempt. His second attempt to travel from Liverpool to Sydney, Australia, went by ship to New York, leaving Liverpool on\n9\nFebruary\n1916\n. From New York, he travelled to Chicago, then to San Francisco before sailing across the Pacific. Ida Suddards, born in Rawdon, Yorkshire, England, was a teacher who sailed from Liverpool to Sydney, Australia, via New York, leaving Liverpool on\n1\nOctober\n1916\n. John and Ida were married in St Andrew's Cathedral, Sydney on\n20\nNovember\n1916\n. On the marriage certificate, Ida gives her occupation as \"Inspectress of schools.\" They had two children, John Hinton Read\n(1917\n-\n2012)\n, born in Sydney, Australia,\n18\nNovember\n1917\nand known as Jan, and Arthur Hinton Read\n(1920\n-\n1961)\n, the subject of this biography. Let us at this point say just a little about Jan Read, the brother of Arthur\n[\n22\n]\n:-\nJan Read, who has died aged\n95\n, was a scientist, a film and television writer and a wine expert. He lived much of his life in Scotland and his many achievements included working on the classic sword-and-sandals adventure Jason and the Argonauts and persuading the BBC to make Dr Finlay's Casebook, which originally ran from\n1962\nto\n1971\n. Read worked on dozens of films and television shows and helped shape the popular perception not only of the avuncular country doctor, but also of the avuncular British bobby as co-creator of the character who became Dixon of Dock Green.\nJohn Read was appointed as Professor of Chemistry in the United College of St Salvator and St Leonards of the University of St Andrews. John, Ida and their two sons, sailed from Sydney on The Aberdeen Line Ship,\nDemosthenes\n, and after calling in the ports of Melbourne, Fremantle, Durban, Cape Town and Tenerife, arrived at Southampton, England, on\n5\nFebruary\n1923\n.\nArthur began his schooling in St Andrews. He became known around the town when he played Lady Katharine's page in the student procession. The Kate Kennedy procession celebrates the history of St Andrews and its university with characters in period dress parading round the town. The procession had begun in the\n15\nth century as a Spring Procession but had been banned in\n1881\n. It was revived in\n1926\nwith the approval of the Principal and the Senate. Because of his father's position as Professor of Chemistry, Arthur Read played the part of Kate's page in the procession, riding in the coach preceded by the historical pageant.\nLathallan School was founded in Colinsburgh, Fife, on\n17\nJanuary\n1930\nwith J H Nock as the headmaster. It was an independent boarding school for boys who wore short trousers, caps, and red and grey striped ties. Arthur Read became a pupil in\n1931\n[\n17\n]\n:-\nHe was good at all subjects but especially strong in Mathematics ... He was captain of Lathallan Rugby and Cricket in\n1934\nand Victor Ludorum in\n1932\n,\n1933\nand\n1934\n.\nArthur won the top scholarship to Marlborough College in\n1934\n. This prestigious  independent school had been founded in\n1843\nin Marlborough, Wiltshire, England for the education of the sons of Church of England clergy. In\n1939\nhe graduated from Marlborough College and won a Major Scholarship in Mathematics at St John's College, Cambridge. Not only did he show his outstanding mathematical talents but he quickly showed his outstanding qualities as a chess player. The Lent Term\n1940\nissue of\nThe Eagle,\nthe St John's College Magazine, states:-\nThe knock-out Chess Club competition was won by A H Read.\nBeing an outstanding mathematician and chess player meant that he was a natural choice to be recruited as a codebreaker at Bletchley Park during World War II. He had to put his undergraduate studies on hold and, from February\n1941\nuntil September\n1945\n, he undertook highly secretive work as a codebreaker. We have a note written in his own hand which states:-\nThe nature of this work should not be disclosed in print ...\nReturning to St John's College, Cambridge in September\n1945\n, he completed his studies and was awarded a B.A. by the University of Cambridge in\n1946\n. He then returned to Marlborough College as a mathematics master, teaching there from September\n1947\nto July\n1950\n. In\n1950\nhe was appointed by the Regius Professor of Mathematics,\nHerbert Westren Turnbull\n, as a Lecturer in Mathematics at the University of St Andrews; he took up the appointment in October of that year. Of course with Arthur Read's father being Professor of Chemistry in St Andrews, Arthur knew the Department of Mathematics in St Andrews well.\nTurnbull\nwas a keen mountaineer, as was his son Derwent Greville Turnbull, and it appears that it was through them that Arthur Read became interested in climbing. Derwent Greville Turnbull writes\n[\n24\n]\n:-\n[\nArthur\n]\nstarted climbing in\n1946\n, with a fruitless day looking for a pair of spectacles among the screes of Achaladair which he appeared to enjoy immensely, and continued with great zest, climbing mainly in Scotland and Norway.\nLet us note that when Arthur Read was appointed to the lectureship in St Andrews he only had an undergraduate degree in mathematics and had published no research papers. Although this may look very unusual by the standards of today, the disruption in education caused by World War II had created a quite different employment situation in the late\n1940\ns and early\n1950\ns. Although Read was appointed by\nTurnbull\n, he never served under him for\nTurnbull\nretired and\nE T Copson\nfilled the Regius Chair of Mathematics from October\n1950\n.\nDavid Borwein\nand\nRonald Mitchell\nwere also appointed as Lecturers in Mathematics at the University of St Andrews from\n1950\n, and Arthur Read,\nDavid Borwein\nand\nRon Mitchell\njoined\nDan Rutherford\nwho had been on the mathematics staff at St Andrews since\n1933\n. There were quite large mathematics classes with about\n60\nfirst year students,\n50\nsecond year students and\n25\nhonours students in\n1950\n-\n51\n, the first year Read taught in St Andrews. One of the best students in that year was\nJames Murray\nwho was in Junior Honours in\n1950\n-\n51\n.\nArthur Read's first mathematical publication was the book\nA Signpost to Mathematics\n(1951)\n. The Publisher gives the following description:-\nOf late years several books have been written about mathematics for the general reader. Sometimes the aim has been to intrigue the reader with mathematical problems which can be thrown into a practical form. Sometimes an attempt has been made to disentangle elementary mathematics from the detailed techniques by which they tend to be obscured in the ordinary school course. Yet again the object has been to glimpse the problem of higher mathematics.\nThe author of this little book has attempted something different still. Mr Read suspects that what the general reader most wants to know about mathematics is not what, say, the Tensor Calculus is all about, but rather what it is like to be a mathematician. The book is written, therefore, with a view to presenting some of the general principles which guide the mathematician in his thinking. Above all, it seeks to present mathematics as a developing subject, and the mathematician as one who is interested in finding things out for himself rather than following the work of others.\nArthur Read begins the book with the following comment:-\nThe mathematician who is unguarded enough to reveal himself as such at a social gathering is apt to be regarded with a feeling either of horror or of awe. If he should go on to mention the word \"Research\" he probably evokes the comment, \"Of course, I haven't the faintest idea how you can do research in mathematics.\" It is to the author of such a remark that this book is addressed.\nYou can read quotes from the book at\nTHIS LINK\n.\nRead quickly proved himself an outstanding lecturer.\nCopson\nwrites\n[\n6\n]\n:-\nHe rapidly proved himself a brilliant teacher. His students always found him kindly, sympathetic and willing to help, and many are now writing to express their gratitude.\nHis first research paper was\nThe solution of a functional equation\nwhich was published in the\nProceedings\nof the\nRoyal Society of Edinburgh\nin\n1952\n. Keen to gain more research experience, Read applied for leave of absence from the University of St Andrews so that he could undertake research at Harvard University. His visit was funded through a Carnegie Trust scholarship and U.S. Navy and Ordnance research contracts while he was at Harvard. He sailed from Southampton on the\nMauretania\nand arrived in New York on\n2\nSeptember\n1952\n. He gave his United States address as Department of Mathematics, Harvard University, Cambridge\n38\n, Massachusetts. Once at Harvard he enrolled for a Ph.D. and his research was supervised by\nLars Valerian Ahlfors\n. He made rapid progress with his research but also found time for other things.\nDuring the summers of\n1953\nand\n1954\nRead went climbing in the Canadian Rockies with the Harvard Mountaineering Club. The first was in July and August of\n1953\nand, once back at Harvard, he wrote a lengthy report of the expedition. In the first paragraph of the report he describes the area in which they climbed:-\n... the Columbia River flows northwards out of Lake Columbia for some hundreds of miles and then bends leftwards in a gigantic loop until it is flowing south towards the U.S. border. East of the loop stand the Canadian Rockies proper, penetrated by road and railway to Banff through the Kicking Horse Pass. Within the loop itself is an almost untrodden land of mountain, glacier and forest, and notable among the mountain ranges it contains is the Selkirk range, dominated by the massive Mount Sir Sanford which rises to\n11\n,\n500\nfeet. The little town of Golden stands at the point where the railway from the East emerges into the Columbia valley. From it a road runs northwards round the big bend of the river, keeping steadily to the right bank. Once across the river you are separated by miles of impenetrable forest, and countless roaring glacial tributaries of the Columbia, from the nearest bridge leading to civilisation.\nHe completed his research in a remarkably short time and was awarded a Ph.D. from Harvard University in June\n1954\nhaving submitted his thesis\nExternal Problems on Riemann Surfaces\n. Later in the summer of\n1954\n, Read climbed in the same general area as the previous year. In a party of eight, he spent three weeks climbing mountains around Mount Farnham in the Purcell Range.\nCopson\nwrites\n[\n6\n]\n:-\nOn his return to St Andrews, he played a full part in the life of the University, as lecturer, as Warden of Dean's Court, and as Regent.\nIn April\n1954\n, while still at Harvard, Read had agreed to join the Harvard Mountaineering Club\n1955\nKarakoram Expedition to climb in the Karakoram range on the India-Pakistan border. Read flew from Scotland to Pakistan in June\n1955\nto join the other five members of the expedition. Each had responsibilities before going and Read shared the responsibility of purchasing clothing and equipment. They spent two months on the mountains before returning to \"civilisation\" at the end of August.\nWhile studying at Harvard, Read had met Katharine Eaton\n(\nborn\n29\nJuly\n1930)\n, known as \"Kit\". They were married in Lincoln, Massachusetts, on\n29\nDecember\n1955\n. In St Andrews they made their home at\n53\nSouth Street. They had two children: Richard Eaton Read\n(\nborn in St Andrews on\n3\nSeptember\n1957)\nand Katharine Hallett Read\n(\nborn in St Andrews on\n5\nJuly\n1959\n, married Thomas Ross Villars in\n2001)\n. On\n14\nJune\n1958\nArthur Read and his son Richard Read sailed on the\nNewfoundland\nfrom Liverpool to Boston. After spending the summer at Harvard, Arthur, Kit and Richard returned to Scotland, sailing from Montreal, Canada to Greenock, Scotland, on the\nCarinthia\n, arriving on\n2\nOctober\n1958\n. They were having a house built at\n6\nWest Acres and moved there from their South Street home soon after arriving back in Scotland.\nArthur Read published three further papers:\nConjugate extremal problems of class p =\n1\n(1958)\n;\nA converse of Cauchy's theorem and applications to extremal problems\n(1958)\n; and\nHigher derivatives of analytic functions from the standpoint of topological analysis\n(1961)\n. Reviewing the\n1961\npaper Bonami writes\n[\n3\n]\n:-\nThe author gives a method of developing the theory of functions of a complex variable, leading, in particular, to a proof of the existence of the higher derivatives and of the\nTaylor\nexpansion without appeal to integration in the complex plane.\nRead's own introduction to the paper begins\n[\n21\n]\n:-\nOne of the remarkable features of classical complex variable theory is the indispensable part played by integration. As\nL V Ahlfors\nhas emphasised in his 'Complex Analysis', many fundamental properties of analytic functions, such as the existence of higher derivatives, have never been proved without resort to complex integrals or equivalent tools. The elementary proof by Eggleston and\nUrsell\nthat an analytic function is light and open makes certain important theorems, including those of\nRouché\nand\nHurwitz\n, independent of integration, and has led more recently to a topological proof of the continuity of the derivative of an analytic function. Other fundamental properties of analytic functions have remained inaccessible by methods of this kind. The present paper gives a development of complex variable theory which leads in particular to the existence of the higher derivatives and to the\nTaylor\nexpansion without any appeal to complex integration. It will be evident that other standard results can be derived directly from the theorems here proved.\nLet me\n[\nEFR\n]\nnow explain my own contacts with Arthur Read. I attended Madras College, St Andrews, and sat the University of St Andrews First Year Mathematics examinations in June\n1961\nwhile still at school. I began my university career at the University of St Andrews in the Second Year Mathematics Course, called Special Mathematics. There were\n83\nstudents in the class, seven of them first year students.\nDavid Borwein\ntaught an analysis course, Peter Fantham taught a course on abstract algebra, and Arthur Read taught the linear algebra course. It was my first introduction to linear transformations of vector spaces and I really loved it. Read's enthusiasm for the topic was infectious and he lectured with great clarity. I will always remember the morning of Monday\n4\nDecember\n1961\n. I was sitting in the Mathematics Classroom, looking forward to Dr Read's\n11\no'clock linear algebra lecture.\nCopson\n, with a very solemn expression, came into the classroom and told a stunned class that Arthur Read had died in an avalanche on the previous Saturday.\nArthur Read had gone climbing that Saturday with Philip Gribben, a physics lecturer at the University of St Andrews, and the mathematician Gordon Eric Latta\n(1923\n-\n2014)\n, who was on the faculty at Stanford University but had arrived in St Andrews in September\n1961\nto work with Arthur Read. The three had climbed Aonach Eagach, a difficult climb in the Glencoe region, and were on a ridge\n300\nft from the summit when the avalanche occurred. Phil Gribben explained what happened\n(\nsee\n[\n12\n]\nand\n[\n23\n]\n)\n:-\nAs we crossed an icy patch in a hollow the avalanche started at the summit, which had been swept by sleet and high winds all day. As snow and ice crashed down with a roar Professor Latta, who was at the end of the file, shouted a warning to us. We were about\n15\nft apart when it happened. I had walked off the patch when I heard Professor Latta shout. I dived to the side and it all went hurtling past me. I didn't even see Dr Read fall. As the avalanche fell I was battered with snow and lumps of ice. For a few seconds afterwards, in the sudden silence that followed, I thought Prof Latta had gone too. Then I saw him just above me covered with snow. We made our way down the mountain searching for Dr Read among the deep snow but could find no trace of him. Even then we hoped he might be alive. Immediately afterwards we summoned a rescue party from Glencoe and made a search with some help from Hamish McInnes and his two Alsatian dogs, but conditions were too much. It was freezing hard and snow was falling heavily at times.\nArthur Read's body was found on the Sunday in deep snow about\n300\nft below where the avalanche had struck. One cannot help thinking of Read's own words in the article \"This is why we go climbing\"\n[\n20\n]\n:-\nWhen the clouds come down on the winter mountains, and the wind blows, the body can go so numb with cold that even a man's resolution in seeking warmth and shelter can be frozen out of him. And if the weather worsens beyond expectation a relatively easy climb can become a struggle for life or death.\nThe Arthur Hinton Read Memorial Fund was set up in May\n1962\n. A letter, asking for contributions, begins:-\nThe family of the late Arthur Hinton Read is instituting a memorial fund from the income of which a prize will be awarded annually to a student of pure mathematics in the University of St Andrews.\nThe Arthur Hinton Read Memorial Prize continues to be awarded.\nAfter Arthur Read's death, Kit Read returned to Cambridge, Massachusetts, where she became a teacher at the independent Shady Hill School. At a Cambridge dinner party in\n1965\n, Kit met Theodore Dreier Jr, a medical doctor interested in music, writing poetry and painting. Kit invited Theodore to join her chamber music group; both played the cello. They married in\n1967\nand Dreier legally adopted Kit's two children, Richard Eaton Read and Katharine Hallett Read. Two more children, Elizabeth Low Dreier and Ruth Antoinette Dreier, were born in\n1967\nand\n1969\n.",
  "matematicos_citados_na_biografia": [
    "Herbert Westren Turnbull",
    "Turnbull",
    "E T Copson",
    "David Borwein",
    "Ronald Mitchell",
    "Ron Mitchell",
    "Dan Rutherford",
    "James Murray",
    "THIS LINK",
    "Copson",
    "Royal Society of Edinburgh",
    "Lars Valerian Ahlfors",
    "Taylor",
    "L V Ahlfors",
    "Ursell",
    "Rouché",
    "Hurwitz"
  ],
  "imagens": [
    "reid.jpg"
  ]
}