{
  "nome_completo": "Arthur Lyon Bowley",
  "nome_curto": "Arthur Bowley",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bowley/",
  "data_nascimento": "6 November 1869",
  "local_nascimento": "Bristol, England",
  "data_morte": "21 January 1957",
  "local_morte": "Fernhurst, Surrey, England",
  "summary": "Arthur Bowley was a leading statistician with an international reputation for his work on poverty. His expertise in mathematics meant that he played an important part in developing the mathematical basis of economics. He was a prolific author publishing many influential books.",
  "biografia": "Arthur L Bowley\nwas the son of James William Lyon Bowley\n(1826\n-\n1871)\nand Maria Johnson\n(1832\n-\n1915)\n. James Bowley, born in Southwark, Surrey on\n11\nDecember\n1826\n,\n[\n31\n]\n:-\n... first took employment in a smith's shop, then as a clerk in a drapery and in\n1846\n, after much private study, was appointed as assistant master at a Totteridge school. He clearly had great reserves of energy and self-discipline\n(\nqualities his son inherited\n)\nfor once installed in his teaching position he furthered his quest for greater learning by early morning study of the classics. Study of the classics was the first step towards ordination; he obtained a grant and received his Master's degree from Durham University in June\n1854\n.\nOn\n15\nJuly\n1856\n, James married Ann Elizabeth Jackson\n(1826\n-\n1861)\n, to whom he had been engaged for eight years, at St Philip, Dalston; they had three children James Lyon Bowley\n(\nborn\n1857)\n, Mary Elizabeth Bowley\n(\nborn\n1858)\nand Florence Ann Bowley\n(\nborn\n1859)\n. James became a curate in Lambeth and, at the\n1861\ncensus, he was living at\n5\nLansdown Terrace with his wife, son and two daughters. He gives is occupation as Chaplain at the Royal Naval School; he gave up the curacy after a disagreement with the vicar. His wife Ann died at Lambeth in the autumn of\n1861\n. James married Maria Johnson in the Parish Church in Tooting on\n17\nDecember\n1863\n. By this time James was living in Isleworth, being chaplain of the Naval College there but soon after his marriage the family moved to Bristol when James was appointed as vicar of St Philip and St Jacob. James and Maria Bowley had four children, all born in Bristol, Robert Lyon Bowley\n(\nborn\n1864)\n, Ellen Maria Bowley\n(\nborn\n1866)\n, Francis Bulmer Lyon Bowley\n(\nborn\n1868)\nand Arthur Lyon Bowley\n(\nborn\n1869)\n, the subject of this biography.\nJames Bowley died on\n1\nJanuary\n1871\nwhen Arthur was one year old. At the\n1871\nCensus, Maria Bowley is living at\n26\nKingsdown Parade with her stepson James Lyon Bowley and her four children. They have two servants, a nurse and a general domestic\n[\n31\n]\n:-\nThe family position would have been very difficult but for a sum of £\n2100\ncollected by the Mayor and local Bristol businessmen which was invested in breweries, ironworks and railway wagon works and produced an annual income of about £\n200\n. Maria was evidently an excellent household manageress for the children were well-fed, well-clothed and the household never in debt.\nWe have treated Arthur Bowley's background in some detail, particularly since it influenced his career being a factor in his research into poverty.\nIn\n1879\nJames Bowley began his education at Christ's Hospital School in Newgate Street London. This school, one of the oldest boarding schools in England, was founded in\n1552\nto provide:-\n... food, clothing, lodging and learning for fatherless children and other poor men's children. The children were not only cared for but prepared for future careers.\nThe school provided a strict religious education having the children clothed in traditional costume living in spartan conditions. This school was another strong influence on Bowley's character, giving him a life-long interest in social problems. He was an outstanding pupil\n[\n2\n]\n:-\nIn\n1886\nhe won the Tyson Gold Medal for mathematics and two years later, in his last year at school, he gained the Montefiore Prize for mathematics and classics, and also the Thompson Gold Medal for mathematics.\nHe was admitted as a pensioner to Trinity College, University of Cambridge, on\n20\nDecember\n1887\nand, having won a major scholarship to study the mathematical tripos, he matriculated at the start of the Michaelmas term, at the beginning of October\n1888\n. His mathematics master at Christ's Hospital had predicted that Bowley would be Senior\nWrangler\nin the mathematical tripos but poor health ended any chance of this achievement. The professors and tutors were so concerned about his poor health that they collected money to fund a trip to Egypt where they hoped the warm weather would aid his recovery. When he returned, however, he was still not well enough to continue his studies and he went to Bournemouth for a lengthy stay. Despite this major disruption to his studies, he still managed to be ranked\n10\nth Wrangler in the mathematical tripos examinations in\n1891\n, being awarded his BA in that year.\nFrom October\n1891\nto March\n1892\nBowley studied natural sciences in the Cavendish Laboratory and, at the same time, studied economics advised by Alfred Marshall\n(1842\n-\n1924)\nwho was Professor of Political Economy at Cambridge and had just published his influential text\nPrinciples of Economics\n(1890)\n. Marshall suggested that Bowley submit an essay for the\n1892\nCobden Essay Prize. He submitted\nAn Account of England's Foreign Trade in the Nineteenth Century\nwhich won the prize and became Bowley's first publication in\n1893\n.\nFor an extract from the Introduction of\nA Short Account of England's Foreign Trade in the Nineteenth Century\n(1893)\n, see\nTHIS LINK\n.\nIn\n1894\nhe won the Adam Smith Prize with a paper on changes in average wages. He delivered the Newmarch Lectures in\n1894\nand these formed the basis for his next publication\nWages in the United Kingdom in the Nineteenth Century: Notes for the Use of Students of Social and Economic Questions\n(1900)\n. For extracts from some reviews of this book, and many of Bowley's other books, see\nTHIS LINK\n.\nLet us say a little about the Newmarch Lectures. Following the death of William Newmarch\n(1820\n-\n1882)\n, the \"Newmarch Lectures on Economic Science illustrated by Statistics\" were set up with a memorial fund at University College London. The professor of economics could either give the lecture course, which was open to the public, or appoint a lecturer. The first external lecturer was\nFrancis Edgeworth\nin\n1891\n, and Bowley was appointed as Newmarch Lecturer for\n1894\n. Let us note that he was again invited to give the Newmarch Lectures in\n1927\nwhen he gave six lectures \"Tests and Trustworthiness of Public Statistics\" and in\n1928\nwhen he gave six lectures on \"Statistics.\"\nThe last decade of the\n1800\ns were highly successful years for Bowley but ones during which he was also teaching mathematics. From\n1892\nto\n1899\nhe taught mathematics first at Brighton College, then from\n1893\nat St John's School in Leatherhead. One of the addresses he gave while on the staff was on poverty and income distribution, a topic that he would continually return to throughout his career. The text of this talk was never published but it still exists as a handwritten manuscript. While at Leatherhead, he was appointed at a Lecturer in Statistics at the London School of Economics in\n1895\n. He gave his first lecture in October of that year, the month when the College opened. He would continue to teach at the London School of Economics until he retired in\n1936\n. Bowley's final mathematics school teaching appointment was at Clifton College in Bristol before he was appointed as a Lecturer in Mathematics at University College, Reading in\n1900\n.\nAt the London School of Economics, Bowley was promoted to Reader in\n1908\nand, in\n1915\n, he became a professor. He was a Lecturer in Mathematics at University College, Reading until\n1907\nwhen he was promoted to the Chair of Mathematics and Economics.\nLouis Mordell\n's reminiscences contain the amusing note:-\nAbout\n1912\n, I applied for a post at University College, Reading. The salary at such small places was\n120\npounds per annum. At larger places, e.g., University College and Kings College, London, the salary was\n150\npounds. Three of us were interviewed, and Professor Bowley, a statistician who was head of the department, appointed a Scotch football player. It is the irony of fate that many years afterwards, I was on the selection Committee of the\nRoyal Society\nwhen he was a Candidate. I did not hold his choice against him.\nBowley retained this Chair for six years but resigned in\n1913\nwhen he was appointed to the Chair of Statistics at the University of London. He retained a position at University College, Reading, however, being a Lecturer in Economics from\n1913\nto\n1919\n.\nBowley married Julia Hilliam\n(1871\n-\n1959)\nin St George's Church, Reading on\n26\nMarch\n1904\n. Julia, the daughter of Thomas Hilliam\n(1823\n-\n1901)\nand Catherine Hetley Roberts\n(1833\n-\n1916)\n, had been born in Spalding, Lincolnshire on\n15\nOctober\n1871\n. Bowley had met Julia, a talented woodcarver, when both were teaching at University College, Reading\n[\n33\n]\n:-\nShe was unwilling to give up a promising career for marriage but Bowley argued: \"We will labour truly for the commonweal ... I propose no unequal match where you should be merged in my work, though I hope you will inspire it. But where we should both be cultivating such talents as we may have, and cheering and helping each other. I at least, certainly need this support.\"\nArthur and Julia Bowley had three children: Ruth Hilliam Bowley\n(1907\n-\n2000)\n, Agatha Hilliam Bowley\n(1909\n-\n1995)\nand Marian Ellen Alberta Bowley\n(1911\n-\n2002)\n.\nA description of Bowley as a teacher is given in\n[\n2\n]\n:-\nThe immense quantity of his published work is indicated\n[\nwe list\n29\nbooks and he wrote around\n80\npapers\n]\n. All this was done while he was lecturing regularly to generations of students and giving detailed care to the work of post-graduate research workers. As a teacher it must be recognised that he was at his best with post-graduate students and with others undertaking advanced studies. With the undergraduate, groping his way in an endeavour to achieve a statistical frame of mind, Bowley assumed an ability to follow an argument that was not always justified. Whether the student should have taken this as a compliment is an open question, but certain it is that the pre-degree student often stumbled and even sometimes fell. There was perhaps a tendency for Bowley's lectures to develop on occasion into a confidential monologue addressed to the blackboard, as he chalked up line after line of formulae. The fact that intermediate steps were often omitted as being unnecessary did not help. Thus it was that those students who took statistics as a subordinate or voluntary subject were apt to become impatient; but those who were taking statistics as their main subject came sooner or later to realise that the necessity of helping themselves was itself a very real element in the education that Bowley provided and by them he soon became acknowledged as the very great man he was. The research worker found himself in a different position. In order to do research under Bowley, one needed already to be mentally prepared to reap the advantage of Bowley's mind. To such he was an invaluable guide and many men distinguished in public life, such as the late Lord Stamp and Lord Beveridge, have acknowledged their indebtedness to him.\nThe range and quantity of Bowley's work means that it would be difficult here to give a good indication of it. A C Darnell writes\n[\n31\n]\n:-\n[\nBowley was\n]\nan economic statistician of the highest rank. ... there was nothing he did that was without practical, or at least a potential practical, application.  ... all his work is concerned with the common theme of social enquiry with the goal of change for the better.\nMasashi Kondo\n[\n70\n]\nwrites:-\nAccording to Darnell, Bowley made three novel contributions to economics.  First, Bowley was a 'collector and compiler of economic statistics particularly on wages and national income', a field that Marshall argued was crucial. Second, he was a pioneer of statistical techniques in the social sciences, in the development of mathematical economics and econometric. Darnell placed high value on this particular field even though it was underestimated by Blaug.  Third, he was 'a pioneer of sampling techniques'.\nLet us quote from\n[\n61\n]\nconcerning one important part of his work:-\nThe\n1912\n-\n13\nsurvey was a result of his close involvement in the development of statistical methods for the purpose of social investigation. Bowley was familiar with the work being done at the Board of Trade. His first major contribution to the statistics of social investigation had been in the field of index numbers. This is the Bowley who in co-operation with G H Wood was between\n1898\nand\n1906\nconstructing the index of the movement of real wages on which economic historians have relied for so long. However, in the years immediately prior to his poverty surveys he was turning his professional attention to the mathematics of probability. ... Bowley's training made him someone very different and much rarer\n[\nthan others\n]\n, namely a person concerned with the application of academic mathematical studies to social statistics. He was not himself a creative mathematician; his originality lay in recognising how matters familiar to mathematicians could be used in social investigation, a field in which high-powered mathematicians were usually not interested. The fruits of his concern with the mathematics of probability were first expounded in\n1906\nat the meeting of the\nBritish Association\n, which by a stroke of irony was being held that year in York. He dealt with the technique of random sampling and the consequent calculation of standard deviations. ... At the heart of Bowley's practical innovation lay his wish to use the mathematics of probability to estimate the degree of error to be found in statistics. The beauty of the method of random sampling was that error had been deliberately built into the statistics in a controlled way, and could therefore be estimated.\nThe reader who would like to get a deeper knowledge of Bowley's contributions, will find a wealth of information in the extracts from reviews of his books which we give at\nTHIS LINK\n.\nBowley received many honours and awards for his outstanding contributions. He was awarded an honorary DSc by the University of Cambridge in\n1913\n, and an honorary DLitt by the University of Oxford in\n1943\n. In\n1922\n, he was elected a fellow of the British Academy. He was awarded a CBE in\n1937\nand knighted in\n1950\n. He served on the council of the Royal Economic Society. The\nRoyal Statistical Society\nawarded him the Guy Medal in Silver in\n1895\nand the Guy Medal in Gold in\n1935\n; he served as president of the\nRoyal Statistical Society\n1938\n-\n40\n. In\n1903\nhe became a member of the International Statistical Society, and in\n1933\nhelped to found the International Econometric Society, also serving as its president from\n1938\n-\n39\n.\nAlthough Bowley retired in\n1936\n, when World War II broke out in\n1939\nhe became director of the Oxford Institute of Statistics and devoted himself to war related research. He was an advisor to Sir William Beveridge in\n1941\nwhen he wrote his\nReport on Social Insurance and Allied Services\n. He retired for the second, and final, time in\n1944\nand the age of\n75\n.\nLet us end by quoting from\n[\n2\n]\nconcerning Bowley's personality:-\nIn personality, Bowley was somewhat shy and-retiring. He did not readily make close friends and his intimate friendship with Edwin Cannan over many years was an almost unique experience. Few of his students achieved the very rewarding privilege of his intimacy but those who did realised their exceptional good fortune. Bowley was the very soul of discretion and only in his last few years would he occasionally reveal to close friends the inner history of this or that event which at the time was a matter of wide speculation.\nIt was with Cannan in particular that he indulged his addiction to the bicycle. \"Cannan and I used our bicycles as more modern people use cars\". As early as\n1895\nwhen living at Leatherhead and lecturing at the London School of Economics \"I used to bicycle from and to Leatherhead on the Wednesday half holiday to lecture at\n5\n.\n0\n(\nor was it\n6\n.\n0\n?\n)\np.m.\" The following extract from a letter dated September\n12\nth,\n1906\nto Cannan shows Bowley in a typical frame of mind, \" ..., That's all I can say. I don't think the theory of any importance; all that counts is already in Marshall. The following problem is however of finite importance, I wish to go to Wirksworth\n(\na few miles north of Derby\n)\non September\n30\nth and return on October\n2\nnd. In both cases, I want from\n70\nto\n90\nmiles cycling on moderately secluded roads and a complementary express railway journey, e.g., Reading to Leicester and Derby to Wirksworth by road and Leicester to Derby by train. What is my route?\"\nF Y Edgeworth\n, who not infrequently joined Bowley and Cannan on their cycling trips, was prone to discuss mathematical questions as the trio rode along, and Cannan is reported to have said on one such occasion \"Bowley, let us go a little faster,\nEdgeworth\ncannot talk mathematics at more than eight miles an hour.\"\nTo know Bowley in his home was to know how much his family life meant to him. With his wife and daughters he shared great happiness and the gracious atmosphere of his home left a deep impression on all who knew it. It was a rare delight to see Bowley seated at his piano as he played Bach or Haydn with a real personal pleasure. In the last year or two of his life he took up weaving\n(\nat which Lady Bowley had long been expert\n)\nand for this purpose a skein of yarn had to be cut into a number of pieces of similar length. Even then he brought his professional interests to bear as he discussed with a visitor the significance of the standard deviation of a large number of lengths which ought to have been but were not identical.\nThere are several of Bowley's pre-\n1914\nstudents now retired who continue to acknowledge their debt to him, and in this they are joined by his later students and colleagues. He was held in high esteem by all who knew him - and indeed by those who knew him best with a deep affection. It was in recognition of his authority as a statistician and social investigator together with his greatness as a man that a large congregation, including many distinguished figures, attended on February\n11\nth,\n1957\nat St Martin-in-the-Fields the Memorial Service arranged jointly by the London School of Economics and the\nRoyal Statistical Society\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "THIS LINK",
    "Francis Edgeworth",
    "Louis Mordell",
    "Royal Society",
    "British Association",
    "Royal Statistical Society",
    "F Y Edgeworth",
    "Edgeworth"
  ],
  "imagens": [
    "bowley.jpg"
  ]
}