{
  "nome_completo": "Aryeh Dvoretzky",
  "nome_curto": "Aryeh Dvoretzky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dvoretzky/",
  "data_nascimento": "3 May 1916",
  "local_nascimento": "Khorol, Ukraine",
  "data_morte": "8 May 2008",
  "local_morte": "Jerusalem, Israel",
  "summary": "Aryeh Dvoretzky was a Ukrainian-born Israeli mathematician who worked in functional analysis, statistics and probability.",
  "biografia": "Aryeh Dvoretzky\n's family were Jewish. Aryeh was born in Khorol, a town roughly half way between Kiev and Kharkov, and he spent the first six years of his life there before his family emigrated to Palestine in\n1922\n. He attended the Hebrew Reali School in Haifa which had been founded just a few years earlier in protest against a decision to teach all exact sciences in German. The principal of the school was Dr Arthur Biram who developed the school greatly during the years that Dvoretzky was a pupil.\nAfter graduating from the Hebrew Reali School, Dvoretzky entered the Hebrew University of Jerusalem. This university, which opened in\n1925\n, had only awarded its first degrees a few years before Dvoretzky began his studies there. He was taught by, among others,\nMichael Fekete\nand\nAbraham Fraenkel\n.\nFekete\nwas a Hungarian mathematician who had emigrated to Palestine in\n1928\nand was promoted to a professor at the Hebrew University in the following year.\nFraenkel\n, who joined the university in\n1929\n, was its first dean of mathematics. Dvoretzky was awarded his Master's Degree by the Hebrew University in\n1937\nand continued to undertake research there for his doctorate advised by\nFekete\n. He was awarded his doctorate in\n1941\nfor his thesis\nStudies on general Dirichlet series\nbut before submitting this work he had already published a number papers in French, the first being\nSur les singularités des fonctions analytiques\nⓉ\n(\nOn the singularities of analytical functions\n)\n(1938)\n. In fact his thesis consisted of five chapters, the first three of which had been published as three separate papers in\nComptes Rendus\nof the Academy of Sciences in Paris.\nIn\n1940\nDvoretzky married Sarah Schneerson\n(1915\n-\n1972)\n, who was also born in Ukraine. Sarah had come with her family to Tel Aviv in\n1924\n, and studied philosophy and classical languages at the Hebrew University in Jerusalem receiving her Master's Degree in\n1938\n. She became a well-known translator of classical works into Hebrew. Aryeh and Sarah Dvoretzky had two children, a daughter Gina and a son Gideon who was killed on the Egyptian front in the Yom Kippur War of\n1973\n. After the award of his doctorate in\n1941\n, Dvoretzky was appointed to the teaching staff of the Hebrew University of Jerusalem. He was promoted to a full professorship in\n1951\n, becoming the first graduate of the Hebrew University to be appointed to a chair in that university. He took a full part in the running of the University being the Dean of the Faculty of Sciences in\n1955\n-\n1956\nand Vice President of the Hebrew University from\n1959\nto\n1961\n.\nDvoretzky made many research visits abroad, mainly to the United States but also to the Collège de France. He visited Columbia University, Purdue University, Stanford University, and the University of California at Berkeley as well as the Institute for Advanced Study in Princeton on two separate occasions. He first visit was during the academic years\n1948\n-\n1950\nand the second visit was in\n1957\n-\n1958\n. These visits were particularly significant for in\n1975\nhe founded the Institute for Advanced Studies of Jerusalem, modelled on the Institute for Advanced Study at Princeton. In March,\n1976\nDvoretzky wrote about the new Institute:-\nThe Institute is similar in concept to several existing Institutes of Advanced Study, notably the Princeton Institute. An IAS in Israel will fulfil a long-acknowledged need for an appropriate setting to encourage scientific and academic leadership, along with promoting the highest standard of research. The proliferation of universities in Israel, along with the overall trend toward mass higher education, has heightened the need for an IAS here in Israel. The inspiration and achievement of these Institutes are essential to strengthening and advancing Israel's scientific and academic landscape.\nHe also wrote:-\nThe Institute for Advanced Studies of Jerusalem aims for excellence. In Jerusalem we must have either an outstanding Institute or none at all.\nIn\n1960\n, he became the head of Rafael, the Israeli weapons development authority. He later became the chief scientist at the Israel Ministry of Defense. There is an interesting account in\n[\n1\n]\nof Dvoretzky's advice to the Israeli Prime Minister Levi Eshkol concerning the Palestinian refugee problem after the Six Day War in\n1967\n.\nLet us now look briefly at Dvoretzky's mathematical contributions. Joseph Yahav writes in\n[\n4\n]\nabout his early interest in analysis, then explains about his work on probability theory:-\nDvoretzky's interest in probability started in the early\n1940\ns; we see his work with\nTheodore Motzkin\nin the Duke Mathematical Journal, vol.\n14\n, \"A problem of arrangements,\" and in\n1946\n, the \"Lectures on the Theory of Probability\"\n(\nin Hebrew\n)\n. From\n1950\nhis publications were mainly in English. As mentioned, his main field of work was analysis and convexity theory. His best known fundamental result in this field is the Dvoretzky theorem, which was related by Vitali Milman to\nPaul Lévy\n's measure concentration phenomena and served as a starting point to modern\nBanach space\ntheory. At the same time, Dvoretzky was producing work on probability. His work \"On the Strong Stability of Sequence of Events\" was published in the Annals of Mathematical Statistics, vol.\n20\n, in\n1950\n. At this time he was cooperating with Shizuo Kakutani and\nPaul Erdős\n, working on\nBrownian motion\nin\nn\nn\nn\n-space. Throughout the years, Dvoretzky cooperated with\nErdős\n,\nJacob Wolfowitz\n,\nAbraham Wald\n,\nHerbert Robbins\nand Y S Chow in producing elegant and fundamental work in\nprobability theory\n.\nWe should say a little more about the Dvoretzky theorem. In\n1950\nDvoretzky published a joint paper with\nAmbrose Rogers\nentitled\nAbsolute and Unconditional Convergence in Normed Linear Spaces\n. In this paper they proved that, for a series of points in a\nBanach\nspace, absolute convergence is equivalent to unconditional convergence if and only if the\nBanach\nspace is finite-dimensional. This was an impressive paper since this result had been an open conjecture for twenty years. This result inspired\nAlexander Grothendieck\nwho produced a number of different proofs. One such proof appeared in\nGrothendieck\n's\n1956\npaper\nSur certaines classes de suites dans les espaces de Banach et le théorème de Dvoretzky-Rogers\nⓉ\n(\nOn certain classes of sequences in Banach spaces and the Dvoretzky-Rogers theorem\n)\nwhich also contained a number of important conjectures. In\n1959\nDvoretzky proved the conjecture by\nGrothendieck\nwhich today is known as Dvoretzky's theorem. Its proof, which depends on some intricate measure-theoretic arguments, is sketched in the paper\nA theorem on convex bodies and applications to Banach spaces\nand discussed in greater detail in\nSome results on convex bodies and Banach spaces\n(1960)\n. Keith Ball, reviewing\n[\n3\n]\n, writes:-\nIn\n1959\nA Dvoretzky proved that, for every positive e and every\nn\nn\nn\n, all normed spaces of sufficiently large dimension contain\nn\nn\nn\n-dimensional subspaces which are said to be within\ne\ne\ne\nof\nn\nn\nn\n-dimensional Euclidean space. ... Thus, all symmetric convex bodies of sufficiently large dimension have central sections, indistinguishable to the naked eye, from\nn\nn\nn\n-dimensional ellipsoids. Dvoretzky's theorem initiated an avalanche of work on finite-dimensional normed spaces, guided by the heuristic principle: \"All convex bodies behave like ellipsoids, and ever more so as the dimension increases.\" This principle runs completely counter to one's initial experience. As the dimension\nn\nn\nn\nincreases, cubes seem less and less like spheres. The ellipsoid of largest volume inside an\nn\nn\nn\n-dimensional cube is the obvious solid sphere, and occupies only a tiny fraction ... of the cube's volume. Nevertheless there are remarkable theorems embodying the heuristic principle and providing powerful tools for the study of high-dimensional geometry.\nMilman\n[\n3\n]\nwrites about the impact of Dvoretzky's theorem:-\nIt soon became clear that an outstanding breakthrough in Geometric Functional Analysis had been achieved.\nAmong his other work we must emphasise his important contributions to Brownian motion, already mentioned above, much of which was done in collaboration with Shizuo Kakutani and\nPaul Erdős\n. They wrote several papers on this topic including:\nDouble Points of Paths of Brownian Motion in n-Space\n(1950)\n,\nMultiple points of paths of Brownian motion in the plane\n(1954)\n,\nTriple points of Brownian paths in\n3\n-space\n(1957)\n,\nPoints of multiplicity c of plane Brownian paths\n(1958)\n, and\nNonincrease everywhere of the Brownian motion process\n(1961)\n. Later Dvoretzky wrote a number of single-author papers on Brownian motion including\nOn the oscillation of the Brownian motion process\n(1963)\nand\nPolygons on two-dimensional Brownian paths\n(1986)\n.\nNot only did Dvoretzky make a major contribution to mathematical research at the Hebrew University but he also was an excellent teacher\n[\n4\n]\n:-\nHe was considered one of the best teachers in the Hebrew University's Math Department, inspiring many students to take probability as their field of research.\nAmong many doctoral students that he advised at the Hebrew University we mention three who went on to a highly successful academic career;\nBranko Grünbaum\n, who wrote the thesis\nOn Some Properties of Minkowski Spaces\n(1957)\n,\nJoram Lindenstrauss\n, who wrote the thesis\nExtension of Compact Operators\n(1962)\n, and Aldo Joram Lazar, who wrote the thesis\nSpaces of Affine Functions on Simplexes\n(1968)\n.\nDvoretzky received many honours for his contributions. In particular we note that he was an invited speaker at the International Congress of Mathematicians held in Nice in\n1970\n. He was awarded the Israel Prize for Mathematics in\n1973\n. He was elected president of the\nIsrael Academy of Sciences and Humanities\nin\n1974\n, having been a founder member of the Academy, serving until\n1980\n. Later he became the eighth president of the Weizmann Institute of Science serving from\n1986\nto\n1989\n. In\n1996\nhe was awarded an honorary doctorate from Tel Aviv University. In\n2009\n, the\nEinstein\nInstitute of Mathematics at the Hebrew University established an annual lecture series in memory of Dvoretzky.",
  "matematicos_citados_na_biografia": [
    "Michael Fekete",
    "Abraham Fraenkel",
    "Fekete",
    "Fraenkel",
    "Theodore Motzkin",
    "Paul Lévy",
    "Banach space",
    "Paul Erdős",
    "Brownian motion",
    "Erdős",
    "Jacob Wolfowitz",
    "Abraham Wald",
    "Herbert Robbins",
    "probability theory",
    "Ambrose Rogers",
    "Banach",
    "Alexander Grothendieck",
    "Grothendieck",
    "Branko Grünbaum",
    "Joram Lindenstrauss",
    "Israel Academy of Sciences and Humanities",
    "Einstein"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}