{
  "nome_completo": "Asger Hartvig Aaboe",
  "nome_curto": "Asger Aaboe",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aaboe/",
  "data_nascimento": "26 April 1922",
  "local_nascimento": "Copenhagen, Denmark",
  "data_morte": "19 January 2007",
  "local_morte": "North Haven, Connecticut, USA",
  "summary": "Asger Aaboe was a Danish mathematician who is known for his contributions to the history of ancient Babylonian astronomy.",
  "biografia": "Asger Aaboe\n's father was an officer in the Danish Army whose family came from Egaa, a small village which lies on the banks of Aarhus bay to the north of Aarhus city centre. The 'aa' in both Aaboe and in Egaa means 'brook'\n[\n2\n]\n:-\n... as Asger once explained, his family name means 'one who lives by\n(\nboe\n)\nthe brook\n(\naa\n)\n'.\nHe attended the Ostre Borgerdyd Skole in Copenhagen, a famous school where J L Heiberg, who produced masterly editions of Greek mathematical and astronomical classics, had been headmaster from\n1884\nto\n1896\n. Aaboe graduated in\n1940\nand entered the University of Copenhagen.\nEarlier in the same year, on\n9\nApril, Germany had invaded Denmark.  Danish institutions continued to function relatively normally, however, as a result of the cooperative attitude of the Danish authorities. By the summer of\n1943\nthere was increasing hostility towards Germany and the Danish government was dissolved. However Aaboe was able to study mathematics, astronomy, physics, and chemistry at the University, being particularly influenced by his mathematics lecturer\nHarald Bohr\n. He graduated from Copenhagen with a Candidatus Magisterii in\n1947\nafter presenting a thesis\nThe Determination of Areas and Volumes in Antiquity, Especially in the Works of Archimedes\n. In\n1948\nhe went to the United States where he had been appointed to a visiting lectureship at Washington University in St Louis. There he met Joan Armstrong; they were married in\n1950\nand had four children, Kirsten, Anne, Erik, and Niels.\nLater in\n1948\nAaboe returned to Denmark to take up a position at Birkerod Statsskole where he was appointed Adjunkt in Mathematics. He remained there until\n1952\nwhen he emigrated to the United States on being offered a position as Instructor in Mathematics at Tufts University near Boston. In fact when Aaboe was appointed the institution was known as Tufts College, changing its name to Tufts University in\n1954\n.\nAaboe continued with his interest in the history of mathematics and published the paper\nAl-Kashi's iteration method for the determination of sin\n1\n°  in\n1954\n. In addition to holding the Instructorship at Tufts, he enrolled as a Ph.D. student at Brown University in Providence, Rhode Island, in\n1955\n. There was good reason for Aaboe to register for a Ph.D. at Brown University for although he became the only graduate student in the History of Mathematics Department, he became a student of the eminent historian of mathematics\nOtto Neugebauer\nwho had been Professor of the History of Mathematics at Brown University since\n1947\n. Steele writes\n[\n3\n]\n:-\nFew combinations of student and supervisor can have been as profitable as that between\nNeugebauer\nand Aaboe. When Aaboe first came to Brown,\nNeugebauer\nwas in the final stages of preparing his groundbreaking study of Babylonian mathematical astronomy, Astronomical Cuneiform Texts\n(1955)\n. This work would put research into Babylonian astronomy on a firm foundation through the publication and systematic analysis of more than three hundred texts found on cuneiform tablets held in the British Museum, the Oriental Institute at Chicago, the Louvre in Paris, the Staatliche Museen in Berlin, the Arkeoloji Müzeleri in Instanbul, and several smaller collections in Europe and the United States. It was natural, therefore, that Aaboe would work on Babylonian astronomy for his PhD.\nGiven\nNeugebauer\n's interests it will not be a surprise to learn that the title of Aaboe's doctoral thesis, submitted in\n1957\n, was\nOn BabyIonian Planetary Theories\n.\nNow\nNeugebauer\nwas not the only influence of Aaboe from his time at Brown University. The Assyriologist Abraham Sachs was also at Brown and had worked with\nNeugebauer\non Babylonian mathematical texts. Sachs had become interested in Babylonian astronomy and had gained access to hundreds of astronomical cuneiform tablets kept in the British Museum in London\n[\n3\n]\n:-\nSachs passed on to Aaboe a list of tablets that were clearly related to the mathematical astronomical texts published by\nNeugebauer\nbut did not appear to be part of the known systems of planetary or lunar theory. This list of tablets would provide the stimulus for much of Aaboe's research for the rest of his career.\nAaboe was promoted to Associate Professor at Tufts in\n1959\n, then two years later accepted an invitation to join the newly created Department of the History of Science and Medicine at Yale. In\n1962\nhe became an Associate Professor in both this department and also in the Mathematics Department at Yale. He was promoted to full Professor in both departments in\n1967\n, and ten years later became a professor in a third Yale department, namely the Department of Near Eastern Languages and Literatures. He remained in these professorial positions until he retired in\n1992\n.\nLet us now look at some of Aaboe's publications. In\n1963\nhe published\nOn a Greek qualitative planetary model of the epicyclic variety\n. O Schmidt writes in a review:-\nIn a Greek papyrus of the second century A.D. there is evidence of a planetary model of epicyclic type in which the planet travels on the epicycle in the opposite direction to that correctly adopted by\nPtolemy\n. In the paper under review it is shown that assuming the angular velocities of the centre of the epicycle and the angular velocities of the planet on the epicycle to be the same as those in Almagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n(\nand this is a very reasonable assumption\n)\n, a model of the above mentioned type can make neither Venus nor Mars retrograde.\nIn\n1964\nhe wrote the book\nEpisodes from the early history of mathematics\n. Steele writes\n[\n3\n]\n:-\nAaboe took this opportunity to write a history of mathematics text that was accessible to school-children and yet still dealt with the technical details of ancient mathematics. In carrying off this challenge Aaboe displayed his gift for explaining complicated matters in clear, charming, and witty prose. His success can be seen by the fact that the book has been translated into Swedish, Danish, Spanish, Turkish, Polish and Japanese.\nIt is a beautifully written book which the authors of this biography have read several times during their writing of articles for this archive.\nMore information about this book is given at\nTHIS LINK\n.\nIn\nSome Seleucid mathematical tables\n(\nExtended reciprocals and squares of regular numbers\n)\n(1965)\nAaboe looks at eight mathematical cuneiform tablets, three of which had not previously been published. In the same year he published\nOn period relations in Babylonian astronomy\nwhich made new conjectures based on texts that Abraham Sachs had found. In the following year he published the paper\nSome dateless computed lists of longitudes of characteristic planetary phenomena from the late-Babylonian period\nbased on fourteen texts kept in the British Museum. This source of texts also led to\nSome lunar auxiliary tables and related texts from the late Babylonian period\n(1968)\nwhile the paper\nTwo atypical multiplication tables from Uruk\npublished in the following year examined one previously unpublished paper and one which had been misidentified by\nNeugebauer\n. In\nA computed list of new moons for\n319\nB.C. to\n316\nB.C. from Babylon: B.M.\n40094\n(1969)\nhe gave photographs with a translation of a cuneiform tablet in the British Museum which gives the moment of conjunction of sun and moon each month over a three year period. Its interest lies mainly in its early date. He continued to publish papers on these topics throughout his life.\nIn\n2001\nAaboe published\nEpisodes from the early history of astronomy\n, a companion volume to his\n1964\nEpisodes from the early history of mathematics\n. J P Britton writes in a review :-\nThis slim, elegantly written volume by Asger Aaboe might have been more accurate titled 'Highlights of Planetary Theory from Babylon to\nKepler\n' since that is in fact its subject. ...\n[\nit\n]\nprovides a clear, authoritative, and frequently original introduction to the principal elements of planetary theory before\nNewton\n, which experts will find rewarding and novices accessible.\nMore information about this book is given at\nTHIS LINK\n.\nAaboe's wife Joan died in\n1990\nand he retired two years later. Steele writes\n[\n3\n]\n:-\nDespite his retirement in\n1992\n, Aaboe maintained his interest in Babylonian astronomy, continuing to publish important studies, and encouraging younger scholars in their work. I was fortunate to be one of the beneficiaries of Asger's encouragement, and spent several happy days staying with him in North Haven, discussing Babylonian astronomy, eating his fine home made bread, sailing on his boat, and listening to his stories of Sachs,\nNeugebauer\nand the other great scholars of Babylonian astronomy.\nHe remarried in\n2006\nto Izabela Zbikowska and died at his home in January of the following year after a brief illness.",
  "matematicos_citados_na_biografia": [
    "Harald Bohr",
    "Otto Neugebauer",
    "Neugebauer",
    "Ptolemy",
    "THIS LINK",
    "Kepler",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}