{
  "nome_completo": "August Leopold Crelle",
  "nome_curto": "August Crelle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Crelle/",
  "data_nascimento": "11 March 1780",
  "local_nascimento": "Eichwerder, (near Wriezen) Prussia (now Germany)",
  "data_morte": "6 October 1855",
  "local_morte": "Berlin, Prussia (now Germany)",
  "summary": "August Crelle was a German mathematician who founded an important mathematical journal.",
  "biografia": "August Crelle\n's father was a builder who had little in the way of income to be able to give his son a good education. Crelle was therefore largely self-taught, studying civil engineering. He then secured a job as a civil engineer in the service of the Prussian Government. He worked for the Prussian Ministry of the Interior on the construction and planning of roads and the one of the first railways in Germany\n(\ncompleted in\n1838)\nbetween Berlin and Potsdam.\nHad his family had the resources, then Crelle would have studied mathematics at university. He always had a love of the subject but earning money was a necessity for him. However, he was always one to be prepared to study on his own and indeed he spent a great deal of time working on mathematics. He achieved a remarkable level of mathematics considering that he had never been formally taught, and when he was\n36\nyears old he submitted a thesis\nDe calculi variabilium in geometria et arte mechanica usu\nⓉ\n(\nThe use of calculus in  geometry and mechanics\n)\nto the University of Heidelberg and was duly awarded a doctorate.\nCrelle was certainly not a great original mathematician, but he had three qualities which made him as important for the subject as any great researcher might have been. These three qualities were firstly his great enthusiasm for the subject, secondly his organisational ability, and thirdly his ability to spot exceptional talent in young mathematicians. This last gift is described in\n[\n1\n]\nas follows:-\nCrelle had a unique sensitivity to mathematical genius\nand in\n[\n12\n]\nas:-\nCrelle had an extraordinary intuition for judging the qualities of young talents, and for encouraging then with their research work.\nHe founded a journal devoted entirely to mathematics\nJournal für die reine und angewandte Mathematik\nin\n1826\n. Although not the first such journal, it was organised quite differently from journals that existed at that time since these other journals were basically reporting meetings of Academies and Learned Societies where papers were read. Crelle was very much in control of the journal, and he acted as editor-in-chief for the first\n52\nvolumes. He did not want an exclusive work but, as he put it in the first volume, a journal which:-\n... must endeavour to offer itself to a larger public so as to first and foremost ensure its longevity and the possibility to perfect itself.\nCrelle realised the importance of\nAbel\n's work and published several articles by him in this first volume, including his proof of the insolubility of the\nquintic equation\nby\nradicals\n. In fact\nAbel\nand\nSteiner\nhad strongly encouraged Crelle in his founding of the journal and\nSteiner\nwas also a major contributor to the first volume of Crelle's Journal.\nOther young mathematicians had their first papers published in Crelle's journal, largely due to his genius in spotting the importance of their research. In addition to\nAbel\n, mathematicians such as\nDirichlet\n,\nEisenstein\n,\nGrassmann\n,\nHesse\n,\nJacobi\n,\nKummer\n,\nLobachevsky\n,\nMöbius\n,\nPlücker\n,\nvon Staudt\n,\nSteiner\n, and\nWeierstrass\nall had their early works made famous by publication in Crelle's journal.\nIn\n1828\nCrelle left the service of the Prussian Ministry of the Interior and joined the Prussian Ministry of Education and Cultural Affairs. There he used his mathematical skills and connections, advising on policy for teaching mathematics in schools and technical colleges. He spent a spell in the summer of\n1830\nin France studying the teaching methods used by the French. He wrote a report on his return to Germany which praised highly the way that mathematics teaching was organised in France, but he was critical of the French having such a strong emphasis on the applications of mathematics rather than, what Crelle believed in, the importance of mathematical learning in its own right. Crelle wrote\n(\nsee for example\n[\n13\n]\n)\n:-\nThe real purpose of mathematics is to be the means to illuminate reason and to exercise spiritual forces.\nHowever, he became keen to bring the model of the École Polytechnique to Germany for this was the French route to train high quality teachers.\nOne of the outcomes of his involvement with teaching of mathematics in schools was that he published a large number of textbooks and published multiplication tables that went through many editions.\nWe have mentioned above Crelle's reaction to pure and applied mathematics. His original intention when he began his\nJournal für die reine und angewandte Mathematik\nwas, as the title indicates, to deal equally with both pure and applied mathematics. He changed his view of this equality of balance when he found it impossible to find applied mathematics articles of the same intellectual depth to those on pure mathematics. The solution was simple, even if it required a change in policy, and that was to have a second journal for more practical mathematics and this he moved to a second journal which he started in\n1829\n, the\nJournal für die Baukunst\n. This journal published\n30\nvolumes but ended its run in\n1851\n, a few years before Crelle's death.\nCrelle was elected to the\nBerlin Academy\nin\n1827\nwith the strong support of Alexander von Humboldt. In\n[\n5\n]\nEccarius looks at:-\n... the recommendations Crelle wrote for prospective members of the Academy\n[\nand\n]\nthe mathematical papers he read there, as well as the prize-problems he proposed and evaluated for the Academy ...\nWe should say a little about Crelle's personal character and lifestyle which also proved important in his successful ventures.\nAbel\nvisited Crelle in Berlin not long before\nJournal für die reine und angewandte Mathematik\nbegan publication.\nAbel\nwrote to\nHolmboe\nin January\n1826\n:-\nYou cannot imagine what an excellent man\n[\nCrelle\n]\nis, exactly as one should be, thoughtful and yet not horribly polite like so many people, quite honest, for that matter. I am with him on as good terms as I am with you or other very good friends.\nIn another letter, this time to Hansteen,\nAbel\nwrote\n(\nsee for example\n[\n12\n]\n)\n:-\nThere is at his place some kind of meeting where music is mainly discussed, of which unfortunately I do not understand much. I enjoy it all the same since I always meet there some young mathematicians with whom to talk. At Crelle's house there used to be a weekly meeting of mathematicians, but he had to suspend it because of a certain\n[\nMartin Ohm\n, the brother of\nGeorg Ohm\n]\nwith whom nobody could get along due to his terrible arrogance.",
  "matematicos_citados_na_biografia": [
    "Abel",
    "quintic equation",
    "radicals",
    "Steiner",
    "Dirichlet",
    "Eisenstein",
    "Grassmann",
    "Hesse",
    "Jacobi",
    "Kummer",
    "Lobachevsky",
    "Möbius",
    "Plücker",
    "von Staudt",
    "Weierstrass",
    "Berlin Academy",
    "Holmboe",
    "Martin Ohm",
    "Georg Ohm"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}