{
  "nome_completo": "Karl Friedrich August Gutzmer",
  "nome_curto": "August Gutzmer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gutzmer/",
  "data_nascimento": "2 February 1860",
  "local_nascimento": "Neu-Roddahn, near Neustadt an der Dosse, Prussia (now Germany)",
  "data_morte": "10 May 1924",
  "local_morte": "Halle, Germany",
  "summary": "August Gutzmer was a German mathematician who worked on differential equations.",
  "biografia": "August Gutzmer\n's parents were Carl August Friedrich Gutzmer, a master carpenter, and Wilhelmine Schultze. The family were members of the Evangelical Lutheran Church, and August was baptized into this church. From April\n1868\n, when he was eight years old, he lived in Berlin where he attended the Friedrichswerdersche\nGymnasium\n. He began his studies at this high school in\n1870\n, studying there for eleven years before taking his final examinations on\n28\nSeptember\n1881\n.\nGutzmer had not studied foreign languages at school so he did not gain the required passes in his final examinations to obtain university entrance. Nevertheless he was still able to attend mathematics lectures at Berlin Unversity despite not being registered as a student. During this time he also studied Latin with a private teacher to obtain the necessary qualifications to matriculate. On\n3\nApril\n1884\nhe took the Latin examination at the Sophien Realgymnasium in Berlin and, having obtained the necessary pass, he registered as a student at Berlin University on\n27\nth\nof that month.\nAmong those who lectured to Gutzmer in mathematics were\nL Kronecker\n,\nK Weierstrass\nand\nL Fuchs\n. This was right at the end of the \"golden period\" for mathematics in Berlin.\nKummer\nhad decided to retire in\n1883\nand had been replaced by\nFuchs\n.\nKronecker\ndied in\n1891\nand\nSchwarz\nsucceeded\nWeierstrass\none year later. Gutzmer, therefore studied with two of the three great Berlin mathematicians,\nKronecker\nand\nWeierstrass\n, in the last years of their careers. After completing his studies in\n1887\nhe began studying for his doctorate under the supervision of\nA Wangerin\nat Halle-Wittenberg. He submitted his theses\nÜber gewisse partielle Differentialgleichungen höherer Ordnung\nⓉ\n(\nOn certain partial differential equations of higher order\n)\nto the University of Halle-Wittenberg and was awarded his doctorate on\n13\nJanuary\n1893\n. A publication arising from his doctoral thesis\nÜber gewisse lineare Differentialgleichungen\nⓉ\n(\nOn certain linear differential equations\n)\nwas published in the\nJahresberichte der Deutschen Mathematiker vereinigung\nin\n1894\n.\nSoon after the award of his doctorate Gutzmer married Helene von Bannasch from Friedland, Kreis Beeskow. She owned a manor and Gutzmer was employed in the administration of the manor for the first year of his married life. However the manor was sold and the couple moved to Berlin where Gutzmer was an assistant at the Technischen Hochschule of Charlottenburg. Their first child, a daughter Irene, was born on\n25\nMay\n1894\n. From\n1\nOctober\n1894\nto\n9\nJanuary\n1895\nGutzmer was in the army but dismissed as being unfit for duty. He returned to his position at the Technischen Hochschule, but also worked during this period on his\nhabilitation\nthesis. He submitted his thesis\nZur Theorie der adjungierten Differentialgleichungen\nⓉ\n(\nOn the theory of adjoint differential equations\n)\nto the University of Halle-Wittenberg on\n23\nApril\n1896\nand worked there as a\nprivatdozent\nuntil March\n1899\n.\nHe was appointed as professor of mathematics at the University of Jena, holding this post from\n1899\nuntil\n1905\n. He also worked for the\nGerman Mathematical Society\nproducing yearly reports, for example:\nJahresversammlung der Deutschen Mathematiker-Vereinigung zu München,\n17\n-\n23\nSeptember\n1899\nⓉ\n(\nAnnual Meeting of the German Mathematical Society in Munich,\n17\n-\n23\nSeptember\n1899\n)\n;\nJahresversammlung der Deutschen Mathematiker-Vereinigung zu Aachen,\n16\n-\n23\nSeptember\n1900\nⓉ\n(\nAnnual Meeting of the German Mathematical Society in Aachen\n16\n-\n23\nSeptember\n1900\n)\n; and\nBericht über die Jahresversammlung in Breslau, vom\n18\nbis\n24\nSeptember\n1904\nⓉ\n(\nReport on the annual meeting in Wroclaw, between\n18\n-\n24\nSeptember\n1904\n)\n. During his time working at Jena he was offered a position on the Board of Education, but rejected so that he could continue teaching.\nOn\n3\nAugust\n1905\nGutzmer took up an appointment to an ordinary professorship at the University of Halle-Wittenberg. Although he undertook work advising the government through World War I, he remained at Halle being rector of the university during session\n1914\n-\n1915\n. He gave a rectorial address entitled\nZum Jubiläum der Logarithmen\nⓉ\n(\nThe anniversary of logarithms\n)\n.  He was asked to continue as rector for a second session, but by this time his health was deteriorating so he declined.\nHighly gifted as a teacher, showing infectious enthusiasm for his topic, Gutzmer taught courses on a wide variety of topics including differential and integral calculus, and analytic geometry at lower level. Among the advanced courses he taught we list: ordinary differential equations, analytic mechanics, calculus of variations, number theory, higher algebra, function theory and the theory of algebraic curves.\nGutzmer received many honours. He was elected to the\nGerman Academy of Scientists Leopoldina\nin\n1900\n, being elected president of this famous academy in\n1921\n. He was president of the Commission for Mathematical and Scientific Instruction from\n1904\nto\n1907\nand president of German Committee for Mathematical and Scientific Instruction from\n1908\nto\n1913\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "L Kronecker",
    "K Weierstrass",
    "L Fuchs",
    "Kummer",
    "Fuchs",
    "Kronecker",
    "Schwarz",
    "Weierstrass",
    "A Wangerin",
    "habilitation",
    "privatdozent",
    "German Mathematical Society",
    "German Academy of Scientists Leopoldina"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}