{
  "nome_completo": "Aurel Friedrich Wintner",
  "nome_curto": "Aurel Wintner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wintner/",
  "data_nascimento": "8 April 1903",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "15 January 1958",
  "local_morte": "Baltimore, Maryland, USA",
  "summary": "Aurel Wintner studied at Budapest and Leipzig. He spent most of his career in Johns Hopkins University in Baltimore, USA. He published on Number Theory, Differential Equations, Probability and Celestial Mechanics.",
  "biografia": "Aurel Wintner\n's father, Eduard Wintner, was a businessman who had lived in Rotterdam and has emigrated to Budapest while his mother, Charlotte Eugenie Hirshfeld, was from Vienna. Aurel attended school in Budapest, completing his school education there in\n1920\n.\nWintner's mathematical ability was recognised by one of his school teachers and, realising that he was capable of progressing much faster than the other pupils, arrangements were made to enable Wintner to use the mathematics library at the University of Budapest. This was a major influence in allowing him to discover his love of the subject, for at school it was not clear that he would continue to study science. The reason was that Wintner was extremely musical and showed great talent for the violin.\nAs he came towards the end of his school career in\n1920\nhe realised that he could not pursue both music and science. Many might have decided to aim for a scientific career and still keep the violin as a major hobby - in fact many of the mathematicians in this archive played the violin to a very high standard. Not so Wintner, for once he had made the decision for a scientific career he never played the violin again.\nAlthough being allowed to use the mathematics library at the University of Budapest was a major influence in directing his interests in that direction, there was another influence which pushed him towards astronomy. This came from his uncle, S Oppenheim, who was professor of mathematics at the University of Vienna. As a schoolboy Wintner had spent holidays in Vienna and had used his uncle's astronomy library.\nAfter leaving school Wintner entered the University of Budapest in\n1920\n. However, although he came from a fairly well-off family, this was a period of hyper-inflation and it became increasingly difficult for him to continue with his education. In\n1924\nhe withdrew from university by this time he had reached a level where he was undertaking research. During the years\n1924\nto\n1927\nhe published about\n20\npapers on astronomy and mathematics. The quality of the work that he was producing made a marked impression on the world of mathematics and\nLeon Lichtenstein\n, who taught at the University of Leipzig began to correspond with him on mathematical topics.\nLichtenstein\nbegan to encourage Wintner to consider studying for his doctorate.\nWintner entered the University of Leipzig to study for his doctorate in\n1927\n. During the following two years he served as assistant to\nLichtenstein\nas editor of\nMathematische Zeitschrift\nand also\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\n. Wintner always felt a great debt of gratitude towards\nLichtenstein\nfor supporting his studies and throughout his life Wintner kept a picture of\nLichtenstein\non the wall in his office.\nGeorge W Hill\nhad published an account of his lunar theory in\n1878\n.\nHill\n's methods used infinite matrices and series expansions which he assumed were convergent but gave no proof. Wintner wrote a number of papers putting\nHill\n's theory on a rigorous mathematical foundation.\nHe published the first proofs of the basic facts about\nHilbert spaces\nin\n1929\n, the year in which he was awarded his doctorate by the University of Leipzig. In fact at this time the development of Hilbert spaces had become particularly important for the study of quantum theory since this mathematics underlay the theory. This should have made Wintner's work of particularly topical interest but unfortunately for him mathematicians were developing their theories in terms of operators, following the approach of\nvon Neumann\n. This should not have meant that Wintner's approach via infinite matrices was not of great value but it had the effect that his contributions were not appreciated as they should have been. This in turn led to Wintner feeling bitter at his lack of recognition for his contribution.\nAfter completing his doctorate in\n1929\nWintner won an International Board Fellowship to enable him to study abroad. He made two important visits during\n1929\n-\n30\n, one to Rome where he worked with\nLevi-Civita\n, and the other to the observatory in Copenhagen where he worked with E Strömgren.\nWhile studying at Leipzig Wintner had been taught by\nHölder\n. This became more than just a relationship between teacher and pupil for in\n1930\nWintner married Irmgard Hölder,\nOtto Hölder\n's daughter. In the same year he accepted a post at Johns Hopkins University in the United States where he continued to be employed until his death. He spent the year\n1937\n-\n38\nat the Institute for Advanced Study at Princeton, also visiting Harvard during that period to work with\nG D Birkhoff\n. Wintner was awarded a Guggenheim Fellowship in\n1941\nwhich enabled him to visit Cambridge, Massachusetts. He had planned to write a book with\nNorbert Wiener\nduring this time but\nWiener\nwas involved with war work which meant their plans could not be carried through as they had intended. In\n1946\nWintner was appointed to a full professorship at Johns Hopkins University, a position which Wintner should have been offered many years before.\nIn\n1944\nhe became editor of the\nAmerican Journal of Mathematics\nhaving already been associate editor from\n1936\n. Clearly his editorial duties as\nLichtenstein\n's assistant in\n1927\n-\n29\nstood him in good stead, and editorial duties were clearly something which gave Wintner great satisfaction. He played an important role in developing the editorial policy of the\nAmerican Journal of Mathematics\nand, working with\nAndré Weil\n, he made major changes to the editorial policy from\n1953\nuntil his death, which resulted in significantly increasing the standard of the journal.\nWintner published on analysis,\nnumber theory\n,\ndifferential equations\nand\nprobability\n(\nwith several joint papers with\nNorbert Wiener\n)\n. These interests appear to be unconnected but this is in fact far from true. Although it is true that Wintner studied certain areas of mathematics for their own sake, he was led to these areas through his work in celestial mechanics.\nAlong with\nPoincaré\nand\nGeorge Birkhoff\n, he placed celestial mechanics on a more sound mathematical basis. These innovators were more concerned with the underlying theory, less concerned with quantitatively accurate prediction of celestial body motion. A study of certain astronomical equations led Wintner to consider almost periodic functions. Hartman, Wintner's student and then colleague, writes in\n[\n3\n]\nthat an interest in perturbations of planets and other related work:-\n... led Wintner to various interests: first, his interest in almost periodic functions as such; second, analytic number theory and summability; third, the asymptotic distributions of almost periodic functions; and finally, the theory of distribution functions as such. In this connection, Wintner used to like to point out the debt of\nanalytic number theory\nto dynamics, noting that in a certain sense the oldest Tauberian theorems date back to the dynamical work of Sundman and\nHadamard\n.\nWintner published\n437\npapers during his career and\n9\nmonographs. Of these monographs six were published after he emigrated to the United States. These were\nLectures on asymptotic distributions and infinite convolutions\n(1938)\n,\nAnalytical foundations of celestial mechanics\n(1941)\n,\nEratosthenian averages\n(1943)\n,\nTheory of measure in arithmetical semigroups\n(1944)\n,\nThe Fourier transforms of probability distributions\n(1947)\n, and\nAn arithmetical approach to ordinary\nFourier series\n(1945)\n. Of these monographs, those of\n1943\n,\n1944\nand\n1945\nwere published privately. Wintner\n[\n3\n]\n:-\n... took rather a dim view of American publishing houses which would not publish specialised monographs with limited sales. He felt that he proved his point by not losing money in this capacity as entrepreneur.\nAs to Wintner's character Sternberg writes in\n[\n1\n]\n:-\nWintner, a man of high moral principles, opposed direct government support of scholarly research, for fear of interference. He not only accepted considerable financial hardship by personally refusing such support but also was willing to forgo fruitful scientific collaboration in order to maintain his ideals.\nHartman, in\n[\n3\n]\n, writes of:-\n... the intensity and the great energy which\n[\nWintner\n]\nbrought to every task, mathematical and non-mathematical. ... in the last few years of his life he seemed to prefer working closely with one or two students to lecturing, but earlier in his career he gave inspiring lecture courses in which he transmitted his love and enthusiasm for mathematics.\nAs to his personal relations with students, he\n[\n3\n]\n:-\n... sought out the promising young students and offered them friendship, help and suggestions. On the other hand, he could be very abrupt in dropping these students if he decided that they did not work as hard as he thought they should.\nHis interests outside mathematics included hiking in the mountains but, in a similar way to never playing the violin past the age of\n17\n, he strongly believed that one should not have non-essential interests. As a result he had many friends among mathematicians, but few others. He died suddenly from a heart attack while still at the height of his mathematical productivity.",
  "matematicos_citados_na_biografia": [
    "Leon Lichtenstein",
    "Lichtenstein",
    "George W Hill",
    "Hill",
    "Hilbert spaces",
    "von Neumann",
    "Levi-Civita",
    "Hölder",
    "Otto Hölder",
    "G D Birkhoff",
    "Norbert Wiener",
    "Wiener",
    "André Weil",
    "number theory",
    "differential equations",
    "probability",
    "Poincaré",
    "George Birkhoff",
    "analytic number theory",
    "Hadamard",
    "Fourier series"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}