{
  "nome_completo": "James Balfour Lockhart",
  "nome_curto": "Balfour Lockhart",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lockhart/",
  "data_nascimento": "15 August 1886",
  "local_nascimento": "Cambuslang, Lanarkshire, Scotland",
  "data_morte": "27 January 1969",
  "local_morte": "Glenfarg Hospital, Perthshire, Scotland",
  "summary": "Balfour Lockhart graduated from Edinburgh University, his studies being interrupted by war service. He taught for most of his career at Edinburgh Academy, finishing as Head of Mathematics.",
  "biografia": "Balfour Lockhart\n's father was  Robert Mitchell Lockhart\n(\nborn in Prestonpans in\n1854\n; died in\n1937)\nwho was a railway goods clerk. His mother was  Janet Porter\n(\nborn in Darvel, Ayrshire about\n1852)\n. He had a younger sister Jeanie\n(\nborn about\n1888)\n.\nBalfour Lockhart attended Cambuslang Public School in Cambuslang between\n1891\nand\n1900\n, then attended Skerry's College in Glasgow. He showed such outstanding abilities that the College offered him a position as a tutor in their Edinburgh branch. He passed examinations of the Edinburgh University Preliminary Board, namely Higher Latin in September\n1911\n, then Lower Dynamics, Higher English, Mathematics, and French in April\n1912\n. He began reading for a degree in mathematics and natural philosophy at the University of Edinburgh in October\n1912\n, at age\n26\n, but after completing two years, World War I began and he enlisted for military service. During the first of his two years at university, October\n1912\nto June\n1913\n, he had studied Ordinary Mathematics, Natural Philosophy, and Chemistry. During\n1913\n-\n14\nhe studied Ordinary Political Economy, and Intermediate Honours Mathematics.\nAfter war service, which included periods spent in Gallipoli and Egypt, he resumed his studies at the University of Edinburgh in\n1919\n, taking Natural Philosophy\n(\nIntermediate Honours Heat and Electricity\n)\nand on the\n8\nth\nof July of the following year graduated M.A. with First Class Honours in Mathematics and Natural Philosophy. He also graduated with a B.Sc. in the same year. He declined the opportunity to undertake research in mathematics, and took up a commercial appointment. This, however, was not to his liking and he soon applied for a teaching post. In October\n1920\nhe was appointed as Mathematics Master at the Edinburgh Academy.\nHe married Agnes Russell Blyth in Kirkcaldy in\n1922\n.\nLockhart spent the rest of his career at the Edinburgh Academy, being promoted to Head of Mathematics in\n1940\n. He retired from teaching in\n1951\n.\nJames Lockhart was a member of the\nEdinburgh Mathematical Society\n, joining the Society in December\n1920\nimmediately after his appointment to the Edinburgh Academy. He served the Society as Treasurer for\n23\nyears from\n1927\nto\n1950\nhaving earlier served on the Committee. He was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1932\n, his proposers being\nSir Edmund T Whittaker\n,\nHerbert Westren Turnbull\n,\nCharles G Barkla\n,\nSir Charles Galton Darwin\n.\nAn obituary, written by S Read, appears in the\nRoyal Society of Edinburgh\nYear Book\n1970\n, pages\n33\n-\n34\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "Sir Edmund T Whittaker",
    "Herbert Westren Turnbull",
    "Charles G Barkla",
    "Sir Charles Galton Darwin",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}