{
  "nome_completo": "Banu Musa brothers",
  "nome_curto": "Banu Musa brothers",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Banu_Musa/",
  "data_nascimento": "about 800",
  "local_nascimento": "Baghdad, (now in Iraq)",
  "data_morte": "Iraq",
  "local_morte": null,
  "summary": "The Bana Musa brothers were Islamic mathematicians whose work is almost indistinguishable.",
  "biografia": "The\nBana Musa brothers\nwere were three brothers:\nJafar Muhammad ibn Musa ibn Shakir\n,\nAhmad ibn Musa ibn Shakir\nand\nal-Hasan ibn Musa ibn Shakir\n. They are almost indistinguishable but we do know that although they often worked together, they did have their own areas of expertise.\nThe three links above give details specific to each of the brothers but most of the information about them is on this page.\nJafar Muhammad worked mainly on geometry and astronomy while Ahmad worked mainly on mechanics and al-Hasan worked mainly on geometry. It is quite impossible to write separate biographies of the three brother, who are usually known as the Banu Musa, and we shall not attempt to do so.\nThe Banu Musa brothers were among the first group of mathematicians to begin to carry forward the mathematical developments begun by the ancient Greeks. It is therefore worth looking at the background to how Arabic mathematics came to fill this role.\nHarun al-Rashid became the fifth Caliph of the Abbasid dynasty on\n14\nSeptember\n786\n, not long after Musa ibn Shakir, the father of the Banu Musa brothers, was born. Harun ruled from his court in the capital city of Baghdad over the Islam empire which stretched from the Mediterranean to India. He brought culture to his court and tried to establish the intellectual disciplines which at that time were not flourishing in the Arabic world. An example of this change is seen in the life of Musa ibn Shakir, the father of the Banu Musa brothers, who was a robber in his youth but turned to science, becoming highly proficient in astronomy. It was during al-Rashid's reign that the first Arabic translation of\nEuclid\n's\nElements\ninto Arabic was made by al-Hajjaj. The first steps were being taken to allow Greek mathematics to spread through the Islam empire.\nAl-Rashid had two sons, the eldest was al-Amin while the younger was al-Ma'mun. Harun al-Rashid died in\n809\nand there was an armed conflict between his two sons. Al-Ma'mun won the armed struggle and al-Amin was defeated and killed in\n813\n. Following this, al-Ma'mun became Caliph and ruled the empire from Baghdad. Even before this time Musa ibn Shakir had become a close friend of al-Ma'mun and when Musa ibn Shakir died, al-Ma'mun became the guardian of the Banu Musa brothers. The brothers were given the best education in Baghdad, studying geometry, mechanics, music, mathematics and astronomy.\nAl-Ma'mun had continued the patronage of learning started by his father and had founded an academy called the House of Wisdom where Greek philosophical and scientific works were translated. He also built up a library of manuscripts, the first major library to be set up since that at Alexandria, collecting important works from Byzantium. In addition to the House of Wisdom, al-Ma'mun set up observatories in which Muslim astronomers could build on the knowledge acquired by earlier peoples.\nAl-Ma'mun recruited the most talented men for the House of Wisdom and appointed the Banu Musa brothers whose talents he had quickly come to appreciate. He also appointed\nal-Khwarizmi\n,\nal-Kindi\nand al-Hajjaj the first translator of\nEuclid\n's\nElements\ninto Arabic.\nHunayn\nibn Ishaq and later\nThabit ibn Qurra\nalso worked in the House of Wisdom with the Banu Musa brothers. Muhammad became a close friend of\nHunayn\n.\nIn\n833\nal-Ma'mun died and was succeeded by his brother al-Mu'tasim. The house of Wisdom continued to flourish under successive caliphs. Al-Mu'tasim died in\n842\nand was succeeded by al-Wathiq who, in turn, was succeed as Caliph in\n847\nby al-Mutawakkil. Under both these Caliphs internal arguments and rivalry arose between the scholars in the House of Wisdom and the Banu Musa brothers were certainly involved in this rivalry. The Banu Musa\n[\n4\n]\n:-\n... became enemies of the famous philosopher\nal-Kindi\nand caused him to lose favour with al-Mutawakkil, who ordered him to be beaten and allowed the brothers to confiscate his library.\nCertainly the atmosphere of culture and intellectual achievement was by now rather a thing of the past as al-Mutawakkil persecuted all non-orthodox and non-Muslim groups while he had synagogues and churches in Baghdad destroyed. Muhammad and Ahmad were certainly in favour with al-Mutawakkil who employed them in work related to the construction of canals for a new city of al-Djafariyya.\nWe now turn to the important mathematical contributions made by the Banu Musa brothers. As al-Dabbagh writes in\n[\n1\n]\n:-\nThe Banu Musa were among the first Arabic scientists to study the Greek mathematical works and to lay the foundation of the Arabic school of mathematics. They may be called disciples of Greek mathematics, yet they deviated from classical Greek mathematics in ways that were very important to the development of some mathematical concepts.\nThe most studied treatise written by the Banu Musa is\nKitab marifat masakhat al-ashkal\nⓉ\n(\nThe Book of the Measurement of Plane and Spherical Figures\n)\n. This work became well known through the translation into Latin by\nGherard\nof Cremona entitled\nLiber trium fratum de geometria\nⓉ\n(\nThe geometry book of the three brothers\n)\n. The treatise considers problems similar to those considered in the two texts by\nArchimedes\n, namely\nOn the measurement of the circle\nand\nOn the sphere and the cylinder\n.\nThere are many similarities in the methods employed by the Banu Musa and those employed by\nArchimedes\n. More significant, however, is the fact that there are also many differences which, although at first sight may not seem of major importance, yet were providing the first steps towards a new approach to mathematics. The Banu Musa apply the\nmethod of exhaustion\ninvented by\nEudoxus\nand used so effectively by\nArchimedes\n. However, they omitted that part of the method which involves considering polygons with\n2\nk\n2^{k}\n2\nk\nsides as\nk\nk\nk\ntends to infinity. Rather they chose to use a proposition which itself required this passage to infinity in its proof. This in itself may not have been a step forward for, as the author of\n[\n2\n]\nsuggests, this may have been due to a lack of understanding of the finer points of Greek geometric thinking. As used by the Banu Musa the \"method of exhaustion\" loses most of its subtlety and power.\nIn another aspect, however, the Banu Musa made a definite step forward. The Greeks had not thought of areas and volumes as numbers, but had only compared ratios of areas etc. The Banu Musa's concept of number is broader than that of the Greeks. For example they describe π as\n[\n2\n]\n:-\n... the magnitude which, when multiplied by the diameter of a circle, yields the circumference.\nIn the text areas as described as products of linear magnitudes, so the terminology of arithmetic is perhaps for the first time applied to the operations of geometry. The Banu Musa also introduce geometrical proofs which involve thinking of the geometric objects as moving. In particular they used kinematic methods to solve the classical problem of\ntrisecting an angle\n.\nIn astronomy the brothers made many contributions. They were instructed by al-Ma'mun to measure a degree of latitude and they made their measurements in the desert in northern Mesopotamia. They also made many observations of the sun and the moon from Baghdad. Muhammad and Ahmad measured the length of the year, obtaining the value of\n365\ndays and\n6\nhours. Observations of the star Regulus were made by the three brothers from their house on a bridge in Baghdad in\n840\n-\n41\n,\n847\n-\n48\n, and\n850\n-\n51\n.",
  "matematicos_citados_na_biografia": [
    "Jafar Muhammad ibn Musa ibn Shakir",
    "Ahmad ibn Musa ibn Shakir",
    "al-Hasan ibn Musa ibn Shakir",
    "Euclid",
    "al-Khwarizmi",
    "al-Kindi",
    "Hunayn",
    "Thabit ibn Qurra",
    "Gherard",
    "Archimedes",
    "method of exhaustion",
    "Eudoxus",
    "trisecting an angle"
  ],
  "imagens": [
    "banu_musa.jpg"
  ]
}