{
  "nome_completo": "Basil Cameron Rennie",
  "nome_curto": "Basil Rennie",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rennie/",
  "data_nascimento": "24 December 1920",
  "local_nascimento": "London, England",
  "data_morte": "15 November 1996",
  "local_morte": "Adelaide, Australia",
  "summary": "Basil Rennie was an English mathematician who moved to Australia and worked on topics in both pure and applied mathematics.",
  "biografia": "Basil Rennie\nalso wrote articles under the name of\nDavid Cameron.\nWe will explain below how he came to adopt this name for certain of his papers. He came from a family with a tradition of engineering and eventually he too would become interested in very practical applications of mathematics. He attended University College School, an excellent school which was founded as part of University College, London about\n100\nyears before Basil studied there. While a pupil there, he took the scholarship examinations to the University of Cambridge in\n1937\nand was awarded a Mathematical Scholarship for Peterhouse. Among the courses he attended at Cambridge during session\n1940\n-\n41\nwas\nQuantum mechanics\nby\nDirac\n. Rennie's lecture notes taken while attending this course still exist.\nRennie graduated with an MA from Cambridge in\n1941\n. Of course, although World War II had not started when he began his undergraduate studies, by\n1941\nthe war had already been taking place for two years. Rennie took a job with Rolls Royce Aero Engine division, then moved to the Austin Motor Works.\nSzekeres\nwrite\n[\n1\n]\n:-\nIn\n1943\nhe joined the Fleet Air Arm of the Royal Navy as a radio mechanic, and he served in the Pacific Fleet until the end of the war. This was his first contact with Australia, and he seems to have liked what he saw.\nAfter the war ended and Rennie's war service had ended, he returned to Cambridge to undertake research for his doctorate\n[\n1\n]\n.\nIt was at Peterhouse that he took up rowing, an activity which became a life-long interest.\nGiven the engineering background from which Rennie had come it is perhaps surprising that his research topic was lattice theory. He was awarded a doctorate in\n1949\nand parts of his dissertation were published at the paper\nLattices\nin the\nProceedings\nof the\nLondon Mathematical Society\nin\n1951\n. A fuller version of his thesis was published, also in\n1951\n, in the\n51\npage booklet\nThe theory of lattices\nwhich was published at his own expense. The paper was reviewed by\nGarrett Birkhoff\nwho wrote:-\nThe author defines a new topology\n(\nthe \"L-topology\"\n)\nin a lattice L, by taking as a basis of open sets, those convex sets S, whose intersection with any chain is an open set of the chain. He shows that if L is conditionally complete, star-convergence implies L-convergence. In a metric lattice, vx is continuous in the L-topology if and only if it is continuous on all chains; in this case\n(\n\"continuous metric lattice\"\n)\n, metric convergence is equivalent to L-convergence. In the lattice\nL\n(\nH\n)\nL(H)\nL\n(\nH\n)\nof closed subsets of a\nHausdorff\nspace, the empty set\n0\nis isolated if and only if H is compact; moreover, if H is locally compact, then L is a Hausdorff space in the L-topology. In any\nBanach\nlattice\nL\np\n,\np\n>\n1\nL_{p} , p > 1\nL\np\n​\n,\np\n>\n1\n, the L-topology is the metric topology; in any\nBanach\nlattice B, it is the star topology. Other theorems are proved and\n7\nunsolved problems stated.\nIn\n1950\nhe was offered a Senior Lectureship by A P Rowe, Vice-Chancellor of the University of Adelaide in South Australia. Rowe was trying to build a world-class university and recruit promising young academics into fairly senior positions to achieve his aims. However, as\nSzekeres\nwrites in\n[\n1\n]\n, Rennie accepted the offer for a rather different reason:-\nBasil Rennie's motives for moving to Adelaide had little to do with A P Rowe's dreams. What he perceived was a pleasant, somewhat rural, city with the placid Torrens river meandering peacefully through the backs of the University, just the right place to coach the rowing team of Prince Alfred College and to carry out experiments on a theoretically best shape of the hull of a sculling boat. He turned out to be an excellent teacher; his dry humour and total absence of formality or pompousness endeared him to his students\n(\nparticularly the bright ones\n)\n, who suddenly saw their classroom transformed into a little corner of Cambridge.\nSoon after he arrived in Adelaide, Rennie met Barbara Andrews who was a secretary in the Department of Engineering. They were married in\n1951\nand had two children, Alastair and Christopher.\nWe should recount how Rennie came to use the name David Cameron for some of his papers. First we should note that Rennie never looked to enhance his reputation - nothing could have been further from the way he looked at life. He was therefore happy to put certain ideas into the public domain without claiming any credit. He submitted a paper under an assumed name which was refereed by David Elliott. Elliott made some substantial suggestions and Rennie wanted to include him as an author of the paper. However Elliott did not feel that he should become a joint author but, as a compromise suggested that the paper be published under the pseudonym David Cameron, thus taking one of his names and one of Rennie's names. This Rennie accepted and continued to publish various articles under this name.\nTo understand the range of Rennie's interests, let us look at a few papers he published during the period\n1959\n-\n63\n. A reviewer writes about\nOn the strength of sand:-\nAssuming that an aggregate of identical, small, hard spheres arranged in the closest possible packing behaves in much the same way as a mass of dry sand, a theory is developed which describes the response of the aggregate to applied stresses and specifies conditions under which collapse takes place.\nIn\nOn dominated convergence\nhe proves a converse of\nLebesgue\n's theorem of dominated convergence and gives an application to\nFourier series\n. This paper was published in the\nJournal\nof the\nAustralian Mathematical Society\n, as were\nOn sequences of integrable functions\n(1962)\nand\nOn a class of inequalities\n(1963)\n. In this latter paper he shows that the problem of finding the best possible inequality in a certain class which involving\nk\nk\nk\nintegrals, is often equivalent to the problem of determining the convex hull of a related set of points in\nk\nk\nk\n-dimensional space. Returning somewhat to the algebraic interests of his doctoral thesis, he published\nRandom walks\nin\n1961\n. In this paper he counts a particular class of random walks on a lattice which do not pass twice through any point. The method involves a highly ingenious algebraic technique.\nIn\n1962\nRennie left the University of Adelaide and accepted a professorship in the Air Force Academy at Point Cook, Victoria. After four years in this post he moved to Townsville when he became the first professor of mathematics at Queensland University College. On\n20\nApril\n1970\n, two hundred years after Captain James Cook charted the eastern seaboard of Australia, Queensland University College became the James Cook University of North Queensland. Rennie held the chair of mathematics at this University until he retired in\n1986\n.\nOne of Rennie's most important contributions to Australian mathematics was when he set up the\nJames Cook Mathematical Notes\n. Chris Smyth\n(\nUniversity of Edinburgh\n)\nwas on the staff at James Cook University from\n1977\nto\n1984\nand now hosts a web site with copies of all of these\nNotes\n(\nsee www.maths.ed.ac.uk/cook/\n)\n. He writes:-\nThe James Cook Mathematical Notes were started by Basil Rennie in\n1975\n, when he was Head of the Department of Mathematics at the James Cook University of North Queensland, in Townsville, Australia. He was the editor and publisher, as well as the author of a great many of the articles. ...\nThe JCMN is mainly concerned with mathematical problems, and their solution. The journal was fed by a wide network of correspondents throughout the world. Easily the most famous was\nPaul Erdős\n, who came to Townsville to see Basil on many occasions. Problems are posed, and then usually, but not always, solved by correspondents in later issues, often in several different ways. Some of these problems turn out to be old chestnuts, but most are new. There are articles on the mathematics of navigation. There are also some historical notes, usually having some connection to James Cook, the man. And then there is the occasional off-beat quotation.\nMany of the articles in JCMN have no author's name attached. These were all written by Basil Rennie. But he also had a hand in many of the articles with other names attached! Sometimes, he would turn a correspondent's letter into an article, and attach their name. This process often entailed making non-trivial mathematical contributions to it!\nAfter Rennie retired in\n1984\nhe moved back to Adelaide from where he continued to produce the journal until his death in\n1996\n. After Rennie died the Notes ceased publication. After he retired, Rennie continued to publish on a wide variety of topics. For example in\nKeels for boats\n(1986)\nhe suggests the best design for the keel of a sailing boat is a 'tunnel keel' which allows as much water as possible to pass through. Also in\n1986\nhe published\nElectrical circuit tomography\nand\nThe square grid of unit resistors\nboth under the name David Cameron. In these he\n[\n1\n]\n:-\n... he offers a solution to the tomography problem\n(\nthat is, to find out about the inside of a system through measurements on the outside\n)\nfor electrical circuits with two-terminal linear components such as resistors.",
  "matematicos_citados_na_biografia": [
    "Dirac",
    "Szekeres",
    "London Mathematical Society",
    "Garrett Birkhoff",
    "Hausdorff",
    "Banach",
    "Lebesgue",
    "Fourier series",
    "Australian Mathematical Society",
    "Paul Erdős"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}