{
  "nome_completo": "Beatrice Muriel Hill Tinsley",
  "nome_curto": "Beatrice Tinsley",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tinsley/",
  "data_nascimento": "27 January 1941",
  "local_nascimento": "Chester, England",
  "data_morte": "23 March 1981",
  "local_morte": "New Haven, Connecticut, USA",
  "summary": "Beatrice Tinsley was an astronomer who was brought up in New Zealand. She did important work making mathematical models of galaxy evolution. She was the first woman professor of astronomy at Yale but died soon after her appointment at the age of 40 .",
  "biografia": "Beatrice Tinsley\nwas the daughter of Edward Owen Eustace Hill\n(1907\n-\n2001)\nand Jean O'Hagan Morton\n(1903\n-\n1968)\n. She was called \"Beetle\" by her family and friends. Edward Hill was born at Winterbourne Park, Bristol, England on\n30\nMarch\n1907\nbut the family moved to Wales when he was six years old. He studied history at Magdalen College Oxford and joined the Oxford Group which is a non-denominational revivalist Christian movement which aims to share with others four moral absolutes: honesty, purity, unselfishness, and love. He made trips to the United States, Canada, Denmark, Norway and South Africa. He visited the United States in\n1929\nand\n1934\nand on both occasions gave his address as Abergavenny, Monmouthshire, Wales. When in Canada he met Jean Morton who was also a member of the Oxford Group; he married her in Carlisle, England, on\n31\nAugust\n1937\n. She was born at Grey Fell, Penrith, Cumberland, England on\n2\nJuly\n1903\n, the daughter of Sir James Morton and Lady Beatrice Emily. She played the cello to a high standard and also was a writer. Edward and Jean Hill had their first child, a daughter Florence M R Hill known as Rowena, was born in Monmouthshire, Wales in\n1938\n.\nWorld War II started in September\n1939\nand Edward Hill became a staff captain in the infantry and later was promoted to major. During the war the family lived in Chester and their second child, Beatrice Muriel Hill, the subject of this biography, was born there in\n1941\n. She was born prematurely, probably caused by a terrifying air raid, and was not expected to live. She survived, but the war meant that food and coal was rationed and looking after a newly born child in the middle of winter was hard. The family employed Constance Gullidge as a nanny. Edward Hill wrote in\n[16]\nthat Nanny Gullidge:-\n... had been possibly the most important person in Beatrice's life.\nBeatrice's younger sister, Theodora J Hill, was born in Chester in\n1943\n. After World War II ended in\n1945\n, Edward Hill was demobbed and he returned to Wales\n[26]\n:-\nEdward and Jean began to consider moving overseas to escape post-war scarcity and rationing, bouts of whooping cough and chickenpox, and dissatisfaction with their extended families. Following a chance meeting with a New Zealand expatriate, in\n1946\nthe family emigrated to Christchurch ...\nAfter sailing to New Zealand, the Hill family settled in Christchurch in the autumn of\n1946\n. Edward Hill was ordained in Christchurch in\n1946\nand became a curate at St Mary's Merivale, in the suburb of Christchurch to the north of the city centre. As soon as the family arrived in Christchurch, Beatrice began attending the prep school attached to St Margaret's College, an independent girls' school founded on Anglican Christian values. After two years Edward Hill became a vicar of Southbridge by Lake Ellesmere; Southbridge is about\n60\nkm from Christchurch. After the family moved to Southbridge in\n1948\nBeatrice attended Southbridge Primary School, attached to Southbridge District High School. The Primary School, founded in\n1868\n, still exists today, but High School was replaced in\n1981\n.\nThe Hill family only spent two years in Southbridge before moving to New Plymouth where again Edward Hill was an Anglican vicar. Beatrice attended New Plymouth Central Primary School but soon moved for her secondary education to New Plymouth Girls' High School. The co-educational New Plymouth High School had opened in\n1885\nbut in\n1913\nNew Plymouth Girls' High School had split off as a separate institution. When Beatrice studied there the Girls' High School was flourishing under its head Annie Rose Allum. It had high academic standards and sport, music and the arts played important roles. Beatrice showed her outstanding potential, topped her class in every year at the school, and in addition won prizes in piano and violin. Mathematics was a hobby as well as a school subject and she also was keen on ballet and joined the pony club. She already had ambition as is clear from the verse she wrote describing the view looking out her bedroom window in New Plymouth:-\nI see the dainty blue sea lightly tipped with foam\nOver these wide waters I'd someday like to roam.\nThe three Hill girls grew up in a family with very strong religious values. Both Edward and Jean Hill had been members of the Oxford Group and continued to live by the Four Absolutes of that religious movement: Absolute Love, Absolute Purity, Absolute Honesty and Absolute Unselfishness\n[9]\n:-\nBeatrice grew up with religious and philosophical discussions around the dinner table, the big questions of life, death and the universe.\nWhile at New Plymouth Girls' High School, Beatrice, reacting against the intense family religious environment but still wishing to please her parents, began to look towards science as the answer to the fundamental questions of life. She joined the school astronomy club and found inspiration in\nFred Hoyle\n's book\nThe nature of the universe\n. The book, published in\n1950\n, is based on lectures\nHoyle\nhad given on BBC radio.\nEdward Hill resigned as a vicar in New Plymouth and approached the Junior Chamber of Commerce to stand for mayor of the city. Everard Gilmour had been mayor since\n1933\nand, in\n1953\n, Edward Hill stood against him and two other candidates. Despite being a newcomer to the city, Hill was elected and served for three years. He received Queen Elizabeth and the Duke of Edinburgh when they visited New Plymouth in\n1954\nand, during his three years as mayor\n[33]\n:-\n... the New Plymouth library and museum complex was approved, the fountain was installed in the Pukekura Park lake; parking meters were introduced and trams were replaced by trolley buses.\nIn\n1956\n, although Edward Hill was defeated in the mayoral election, he was elected to serve on the New Plymouth Borough Council. It was not only Beatrice's father who was achieving fame, her mother also had her first book published in\n1953\n. This book,\nWind May Blow\nby Jean O Hill, is set in England and New Zealand and promotes the author's high religious and moral values.\nIn\n1957\n, Beatrice Hill specialised in mathematics, physics and chemistry at New Plymouth Girls' High School. The head Annie Rose Allum had advised her to specialise in English but when she said how determined she was to study more mathematics, Annie Allum arranged for her to attend mathematics classes at New Plymouth Boys' High School. She was dux of the High School in\n1957\nand, being ranked one of the best ten students in New Zealand, she was awarded a Junior University Scholarship. With this achievement she followed her elder sister Rowena who had achieved similar honours in\n1954\nand went on the become a professor of English in Venezuela. Perhaps surprisingly, despite Beatrice's academic ambitions, she became engaged to a young man in\n1958\nbut terminated the engagement in the following year.\nShe began her university studies at the women's hostel Helen Connon Hall, Canterbury University in\n1958\n. This university had been established in Christchurch as University College in\n1873\nbased on the universities of Oxford and Cambridge in England but admitting women students from the start. It was renamed Canterbury University College in\n1933\n, and the name was changed to Canterbury University in\n1957\n, the year before Beatrice began her studies there. She took courses in mathematics, physics and chemistry in her first year but found she knew the material they covered already so she started to go further in all the topics reading books. In her second year she studied Pure Mathematics, Applied Mathematics and Physics. In a letter to her mother she wrote\n(\nsee, for example,\n[35])\n:-\nI want both: the maths to reason with and the physics to apply it to.\nIn March\n1959\nshe saw the book\nTheories of the Universe\nedited by Milton K Munitz in the University Bookshop. She bought the book and was fascinated to read the writings of\nPlato\n,\nAristotle\n,\nCopernicus\n,\nGalileo\n,\nKepler\n,\nNewton\n,\nWilliam Herschel\n,\nEinstein\n,\nHubble\n,\nEddington\n,\nHoyle\nand many more. She wrote to her mother saying\n[35]\n:-\nOne could more or less add to it oneself.\nLife wasn't all studying\n[9]\n:-\nHer student life was enriched by playing the violin in an orchestra, belonging to a philosophical debating club, the Socratic Society, and doing volunteer community work. She also had the good fortune to be able to use what was only the second computer to be imported into New Zealand, thus becoming familiar with an essential tool early in her short career.\nAt the Socratic Society, Beatrice met Brian Alfred Tinsley who was at that time studying for a Ph.D. in physics. Brian Tinsley, born in Wellington, New Zealand on\n23\nApril\n1937\n, was interested in atmospheric and space physics. Beatrice and Brian Tinsley were married at St Aidan's Church in Miramar, Wellington, on\n13\nMay\n1961\n. Beatrice graduated with a B.Sc. in\n1961\nand was awarded a Senior Scholarship to enable her to remain at Canterbury University to study for an M.Sc. Beatrice wanted to specialise in cosmology but this was not possible at Canterbury University and she was advised to study for an M.Sc. in physics.\nBeatrice and Brian Tinsley set up their home in the centre of Christchurch where Beatrice took on the traditional \"wife's role\" of shopping, preparing meals and cleaning the home. To bring in some extra money, she did some teaching at Christchurch Girls' High School, took on some paid tasks in the University Physics Department and even took private pupils. Somehow she was able to undertake all these tasks and still obtain top grades in all her courses. Her physics M.Sc. thesis\nTheory of the Crystal Field of Neodymium Magnesium Nitrate\nhad no relation to cosmology and her father writes in\n[16]\n:-\nFor this she gained first class honours, but, as soon as the thesis was complete, was agog to return to cosmology. Possibly because her work was not really interesting, she almost became disillusioned with research as such during that year, stating that she and Brian were both feeling they wanted to \"understand as much as possible about people\" and were afraid that taking up some specific line of research might cut them off from \"wider usefulness in the world.\" But nothing more was said about this once she returned to her own line of study.\nAlthough she may not have enjoyed working on physics, her work was outstanding. She was awarded an M.Sc. in\n1962\nand received the Haydon Prize for Physics, the Cook Memorial Prize, the Warwick House Prize, the Memorial Scholarship and a Postgraduate Scholarship.\nThe Graduate Research Center of the Southwest was officially opened on\n14\nFebruary\n1961\nin Dallas, Texas, United States. It was a privately funded, basic research institution, with the first facility the Laboratory of Earth and Planetary Science opened in\n1964\n. Brian Tinsley was appointed to a research position there and the family left New Zealand for Dallas in\n1963\n. Dallas seemed an excellent place for Beatrice since soon after she arrived she was able to attend the 'First Texas Symposium on Relativistic Astrophysics' held in Dallas\n16\n-\n18\nDecember\n1963\n. All the leading researchers were at the symposium and Beatrice was thrilled to see in person the people whose work she had read about. Robert Oppenheimer presented a paper on gravitational collapse and both Maarten Schmidt and Jesse Greenstein spoke about their recent discovery that quasars were high redshift compact objects.\nThe young couple wanted children but, when Beatrice failed to conceive, the doctors told her it was unlikely she could ever have a child. Beatrice Tinsley quickly found that there were no career opportunities for her in Dallas and she registered to study for a Ph.D. in the Astronomy Department of the University of Texas at Austin starting in September\n1964\n. Texas is vast and Austin is around\n200\nmiles from Dallas so she adopted the strategy of each week flying there on Tuesday and coming back by bus on Friday afternoon. She had to rent a room in Austin and fares and rent made this an expensive option but with no child and no research opportunities in Dallas, it was an option she felt she had to take.\nIn Austin her thesis advisor was Rainer Kurt Sachs who had come to the United States from Germany with his Jewish family in\n1937\nto avoid persecution. He was a mathematical physicist with an interest in general relativistic cosmology and astrophysics. Beatrice's research went extremely well and very rapidly. She had almost completed work on her thesis when the opportunity to adopt a baby came. Alan Roger was born in New Zealand to a relative of Brian Tinsley on\n28\nAugust\n1966\nand Beatrice went to New Zealand to collect the child and bring him back to Dallas. She submitted her thesis\nEvolution of galaxies and its significance for cosmology\nin January\n1967\nand was awarded a Ph.D. For more information about this thesis, see\nTHIS LINK\n.\nBeatrice felt that it was unfair to have Alan Roger as an only child, so the Tinsleys adopted a second child, Theresa Jean, born\n10\nMay\n1968\n. In fact Beatrice's mother had died on\n7\nMay\n1968\nand her funeral was held on the day Theresa Jean was born. The next few years were very difficult for Beatrice with two young children to care for but as always she seems to have coped remarkably well continuing studying papers, doing research, but also keeping up her musical interests joining the Richardson Symphony Orchestra and being involved in various charities.\nIn\n1969\nthe Research Center where Brian Tinsley worked became the University of Texas in Dallas. This did not change the fact that Beatrice Tinsley could not have a permanent position there because her husband was employed. In\n1967\nshe had delivered a lecture on the work she had undertaken for her Ph.D. at a conference in New York. There she had met James Gunn who worked at the California Institute of Technology. Gunn arranged a\n3\n-month appointment for Beatrice Tinsley at the California Institute of Technology in\n1972\n. She went to Pasadena with her two children and undertook research with a number of the astronomers there. Her remarkable abilities were quickly recognised by her collaborators and she was thrilled to be involved in intense collaborations which she had not previously experienced. For example she published the paper\nAn unbounded universe?\nin\n1974\nin collaboration with Richard Gott III, James Gunn and David Schramm. The Abstract reads:-\nA variety of arguments strongly suggest that the density of the universe is no more than a tenth of the value required for closure. Loopholes in this reasoning may exist, but if so, they are primordial and invisible, or perhaps just black.\nYou can see a list of some papers that Beatrice Tinsley published, with their Abstracts, at\nTHIS LINK\n.\nWith a growing reputation, Beatrice was now offered positions at several universities. The University of Maryland offered her an\n18\n-month appointment in\n1973\nbut her husband insisted she only signed up for six months. The family spent the six months living in Silver Springs near Washington with Beatrice working at the University of Maryland and Brian commuting to a job in Washington. Towards the end of\n1973\nshe accepted a half-time position as assistant professor at the University of Texas at Austin and, as she had done when working on her Ph.D., she did a weekly commute from Dallas.\nIn\n1974\nBeatrice was awarded the\nAnnie Jump Cannon\nAward, the first year it was awarded by the American Association of University Women with advice from the American Astronomical Society. Beatrice and Brian Tinsley were divorced on\n27\nAugust\n1974\nand, against her wishes, he was given custody of their two children. The summer of\n1974\nBeatrice spent travelling. First she visited the Institute of Theoretical Astronomy in Cambridge, England, which had been was founded by\nFred Hoyle\nin\n1967\n. Although her early work building mathematical models of galaxy evolution were originally controversial and almost ignored, by\n1974\nthey were receiving much attention and Beatrice said:-\nIt's funny to realise that my thesis work, which is now regarded as a useful step forward in astronomy, was generally regarded as impossible speculation at the time!\nIt is worth briefly looking at why her work was initially thought of as \"impossible speculation.\" She was building a mathematical model of galaxy evolution but, at this time, the data required for such models was poorly understood. What was the initial mass of gas from which a galaxy was built? How much of this gas formed long-lived dim stars which were not visible? The evolutionary history of stars was only just beginning to be understood and it was not known how much material from dying stars was recycled to form new stars. Tinsley appears to be the first to have the optimism to make mathematical models despite the poorly understood initial data.\nFrom the\n1940\ns to the\n1960\ns astronomers had argued between the big bang theory of the universe and the steady state theory. What was needed was observational tests to distinguish between them. This was Tinsley's aim with her mathematical models, to come up with observational tests to distinguish between different cosmological theories. Joann Eisberg write\n[11]\n:-\nShe was able to assemble a series of models that evolved into galaxies with photometric properties matching those presently observed, and the change in their colour and magnitude over cosmological timescales was substantial. She then calculated the evolutionary correction appropriate to several competing cosmologies and found that it reduced the difference between the magnitude-redshift relations that they predicted, making it harder to choose between them. Though this was not the model-testing result Tinsley first sought, it opened an intriguing possibility. ...\nThe paper\nWill the Universe Expand Forever?\nby Richard Gott III, James Gunn, David Schramm and Beatrice M Tinsley published by\nScientific American\nin\n1976\naims at explaining the use of mathematical models in a non-technical way. You can read the Introduction at\nTHIS LINK\n.\nTowards the end of\n1974\nBeatrice Tinsley accepted the position of associate professor at Yale University. She did not, however, take up the post immediately. Leaving her Dallas home on Christmas day\n1974\n, she went first to the California Institute of Technology to work with James Gunn. She then spent six months as an assistant research astronomer and lecturer at Lick Observatory before finally taking up her position at Yale University.\nAt Yale, together with help from colleagues, she organised the 'Yale International Conference on the Evolution of Galaxies and Stellar Populations' held in May\n1977\n. James Gunn said\n[8]\n:-\nIt was the single most important galaxy conference in the history of the subject. There has been no other similar conference.\nFollowing the conference, Beatrice Tinsley continued her fill her days with an incredible amount of research and pleasure. She proved herself an excellent teacher, produced a flood of top quality papers, invited many leading scientists to visit her department, continued to play chamber music, and sat on various Yale committees where she vigorously put forward her feminist views. Tragedy struck however when she was diagnosed with cancer in early\n1978\n. She had an operation for a melanoma on her left leg but doctors told her that all they could do was give her radiotherapy to prolong her life. The side effects of the treatment were severe but she continued to teach, undertake research and travel to conferences. In July\n1978\nBeatrice Tinsley was appointed as a full professor at Yale.\nBrian Tinsley had married again and in\n1979\nhe decided he could not cope with eleven year old Theresa Jean, and she was sent to live with Beatrice. This was an almost impossible situation for Beatrice who was suffering severely from the side effects of her cancer treatment. Her Yale colleague and collaborator Richard Larson moved into her apartment to care for her and Theresa Jean.\nBy November\n1980\nthe cancer had spread and she had a brain tumour which caused her to be partially paralysed. Unable to use her right hand, she taught herself to write with her left hand and continued to write papers until a few days before her death in March\n1981\n. Her funeral was held on\n28\nMarch\n1981\n, she was cremated and her ashes buried in Grove Street Cemetery. Sandra Faber wrote in\n[12]\n:-\nNo tribute to Beatrice Tinsley would be complete without emphasizing her strongly positive, even inspirational, impact on colleagues and students. Those around her were enlivened by Beatrice's obvious zest for her own scientific endeavours, a joy she never relinquished even during her long illness. Equally stimulating was her enthusiasm for research going on around her. Always interested in new results, she plied one with astute questions, all the while radiating appreciation and encouragement.\nMany tributes to Beatrice Tinsley have been made in the years following her death; we name a few of them. Minor planet\n3087\nBeatrice Tinsley discovered on\n30\nAugust\n1981\nhas been named for her. In\n1986\nthe American Astronomical Society established the Beatrice M Tinsley Prize. In\n2010\nMt Tinsley in Fiordland's\nKepler\nMountains, New Zealand was named for her. In\n2012\nthe Royal Astronomical Society of New Zealand established the Beatrice Hill Tinsley Lectures. In\n2019\nNew Zealand issued a Beatrice Hill Tinsley stamp in their 'New Zealand Space Pioneers' series and in\n2022\nthey issued another stamp in a 'Women Scientists' series. In October\n2019\nthe University of Canterbury opened the Beatrice Tinsley building for science staff and postgraduate students. Present were\n130\nguests including members of Beatrice Tinsley's family, some of whom travelled from the United States to be there.",
  "matematicos_citados_na_biografia": [
    "Fred Hoyle",
    "Hoyle",
    "Plato",
    "Aristotle",
    "Copernicus",
    "Galileo",
    "Kepler",
    "Newton",
    "William Herschel",
    "Einstein",
    "Hubble",
    "Eddington",
    "THIS LINK",
    "Annie Jump Cannon"
  ],
  "imagens": [
    "tinsley.jpg"
  ]
}