{
  "nome_completo": "Béla Kerékjártó",
  "nome_curto": "Béla Kerékjártó",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kerekjarto/",
  "data_nascimento": "1 October 1898",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "26 June 1946",
  "local_morte": "Gyöngyos, Hungary",
  "summary": "Béla Kerékjártó was a Hungarian mathematician who worked in topology.",
  "biografia": "Béla Kerékjártó\nis sometimes called Béla von Kerékjártó or, in French, Béla de Kerékjártó. He studied at the University of Budapest, being awarded his doctorate in\n1920\n. He\nhabilitated\nat the University of Szeged in\n1922\nbecoming a\nprivatdozent\n, then took up a scholarship which supported his study abroad. In the summer semester of\n1922\n, at the invitation of the University of Göttingen, he gave a course on\ntopology\nand the following semester a course titled\nMathematische Betrachtungen zur Kosmologie\nⓉ\n(\nMathematical considerations in Cosmology\n)\n. The first of these courses was enlarged into a book\nVorlesungen über Topologie\nⓉ\n(\nLectures on topology\n)\nwhich appeared in the series\nGrundlehren der Mathematischen Wissenschaften\nin\n1923\n. This work was the first of its kind and inspired much later research in this new branch of geometry.\nSolomon Lefschetz\nwas at that time writing his own famous monograph on topology in\n1924\nentitled\nL'analysis situs et la géométrie algébrique\nⓉ\n(\n'Analysis situs' and algebraic geometry\n)\nand he wrote a review\n(\npublished in\n1925)\nof Kerékjártó's book for the\nBulletin of the American Mathematical Society\n[\n4\n]\n:-\nThis production, from the pen of a young Hungarian mathematician, who is beginning to be known for his contributions to analysis situs, is welcome for several reasons. There are altogether too few books on the subject and one more is decidedly in place. It also gives under one cover a fairly complete treatment of the results obtained by\nBrouwer\nand his school on two dimensional topology, a useful thing indeed. The many and well chosen examples and figures are another good feature. For the sake of the average reader at least, we wish that the author had better amalgamated his material and introduced greater unity in his presentation. The Topologie will be especially useful to the reader familiar with point sets and wishing to learn more about their geometric applications, and also, say, in connection with\nVeblen\n's Colloquium Lectures.\nThe material in the book may be essentially classified into three groups:\n(\na\n)\nTopology of the plane and its curves, centering around the\nJordan\ncurve theorems and including such questions as invariance of dimensionality and regionality, structure of regions and their boundaries, the general closed curve, etc.\n(\nb\n)\nCombinatorial analysis situs of two-dimensional manifolds. The treatment of this part is less felicitous than\nVeblen\n's in Chapter II of his Lectures.\nThis is a pretty positive review from a leading expert. However, others had much more negative views.\nHans Freudenthal\nwrites\n[\n1\n]\n:-\n... everyone knew that Kerékjártó's 'Vorlesungen über Topologie' was not a good book and, therefore, nobody read it. The present author has held this opinion for many years and now feels obliged to make a closer examination of Kerékjártó's works. The book opens with a proof which is unintelligible and probably wrong. This, indeed, is the worst possible beginning, but it continues in the same way. The greater part of Kerékjártó's own contributions are hardly intelligible and most apparently wrong. The work of others is often taken over almost literally or in a way which proves that Kerékjártó had not really assimilated the material. The level of the book is far below that of topology at that time, and the organisation is chaotic. When referring to a concept, a notation, or an argument, he often quotes a proof, a page, or an entire chapter - but often the material quoted is not found where he cites it ...\nWhen considering the importance of the book, I\n[\nEFR\n]\nwould tend to put more weight on\nLefschetz\n's review written shortly after it was published than that of\nFreudenthal\nwritten fifty years later. Two specific comments relating to\nFreudenthal\n's opinions. First,\nHermann Weyl\nwrote that Kerékjártó's book completely changed his views on topology. Second, the index contains a reference to the mathematician\nErich Bessel-Hagen\n. Turning to the indicated page, there is no mention of\nBessel-Hagen\n. However, there is a diagram of a torus with large handles attached on the sides looking a bit like a face with oversized ears. In fact\nBessel-Hagen\nwas renowned for having large ears that stuck out of his head. Perhaps\nFreudenthal\nmissed the jokes!\nAfter Kerékjártó's visit to Göttingen in\n1922\n, in the following year he gave courses at the University of Barcelona entitled\nGeometry\nand\nThe theory of functions\n. He spent the years\n1923\n-\n24\nand\n1924\n-\n25\nas a visiting lecturer at Princeton where he gave courses on topology and on continuous groups. He left the United States, returning to Europe where he had an invitation to visit the Sorbonne in Paris. With his\nLessons on topology and its applications\nhe gained the respect of the most distinguished French mathematicians. His friendship with foreign mathematicians continued to deepen for the rest of his life.\nIn\n1925\n, Kerékjártó was appointed to full professorship of the Chair of Geometry and Descriptive Geometry at the University of Szeged. The Department of Mathematics at that time consisted of the Mathematical Seminary and the Institute of Descriptive Geometry. It had opened in Szeged in October\n1921\nafter the Treaty of Trianon had given Kolozsvár\n(\nnow Cluj\n)\nto Romania so the Hungarian University moved from Kolozsvár to Szeged. Before Kerékjártó's appointment, there were four members of staff in mathematics:\nFrigyes Riesz\n,\nAlfréd Haar\n, Rudolf Ortvay, who held the Chair of Mathematical Physics, and\nTibor Radó\n,\nHaar\n's assistant and the only assistant in the Department. Examples of paper Kerékjártó published during this time are\nOn a geometrical theory of continuous groups\n(1925)\nand\nOn a geometrical theory of continuous groups. II. Euclidean and hyperbolic groups of three-dimensional space\n(1927)\nboth in the\nAnnals of Mathematics\n. Kerékjártó remained in Szeged until\n1938\nand we have this nice description from Wilfred Kaplan who spent the academic year\n1936\n-\n37\nabroad. Kaplan writes that he went to Hungary to see \"Professor Bela von Kerékjártó.\" In a letter written on\n18\nJune\n1937\nhe wrote\n[\n2\n]\n:-\n... I went to the Hotel Gellert\n(\nby street-car\n)\nand found Professor Kerékjártó who greeted me in a very friendly fashion. He looks quite young, is tall, resembles Gary Cooper. ... We went to the Institute of Physics in the University of Budapest. Here I was introduced to a number of professors of mathematics and physics, gathered together for their monthly congress. ... Sunday morning I took a train to Gyöngyös and there transferred to a bus\n(\nof very odd primitive construction\n)\nby which I was transported to Matrafüred. Here I was greeted by Professor Kerékjártó, who had arrived the night before. ... We walked together along a path through the woods which led to the pension at which I was to stay. ... I give a picture of a full typical day. I awake at\n7\n.\n30\n, wash with cold water and go into the dining room for breakfast. ... At\n9\nI stroll over to Professor Kerékjártó's home. He has a little house here where he lives with his wife, son\n(9)\nand daughter\n(11)\n. The family greets me and we talk a bit in German. ... they are charming, informal people. Then Professor Kerékjártó and I have a long discussion about some mathematical problems\n(\nthese have been quite fruitful\n)\n. ...\nIn\n1938\n, Kerékjártó was appointed full professor at the University of Budapest. He was succeeded in Szeged by Gyula Szõkefalvi-Nagy, a distinguished geometer, founder of the theory of curves with maximal index, formerly professor of the Teacher's Training College in Szeged. Kerékjártó spent the rest of his career in Budapest which was sadly much shorter than it might have been since he died in\n1946\nat the age of\n47\n. While in Budapest, he seems to have had a difference of opinion with his colleague\nLipót Fejér\nwho once remarked:-\nWhat Kerékjártó says is only topologically equivalent to the truth.\nAn overview of Kerékjártó's contributions is given in\n[\n5\n]\n. We provide a fairly free translation. His most important scientific results were in the area of \"classical\" topology founded by\nPoincaré\nand\nBrouwer\nand in the theory of continuous groups. After the problem of classifying surfaces up to homeomorphism had been solved\n(\nand that for\nopen\nsurfaces resolved by Kerékjártó\n)\nit became possible to study more deeply the structure of the transformations of such surfaces. At the beginning of Kerékjártó's research there were two classic results in this area. The first was \"\nPoincaré\n's last geometric theorem\", later proved by\nG D Birkhoff\n, and the second was \"\nBrouwer\n's translation theorem\". Kerékjártó had earlier shown, in his book, the close relationship between these two theorems, and in an article in\nActa Universitatis szegediansis, Acta scientiarum mathematicarum\nin\n1928\n, he showed how they could have a common proof. This demonstration of the simultaneous proof of the two results united some widely separated areas of mathematics. In fact, while the first theorem played an important role in\nPoincaré\n's research in dynamics, the second was applied by\nBrouwer\nin the theory of continuous groups. Also in his later work he preferred to work in topological problems which were closely connected with problems of classical geometry, theory of functions, etc. The famous speech by\nHilbert\nat the International Congress in Paris had been of great importance to the development of topology. It had also given impetus to the development of the theory of continuous groups. The most beautiful results of this theory, in the case of dimension\n2\n, are due to Kerékjártó. It is enough to mention the topological characterisation of the homographic representations of the sphere and of the affine group of the plane, the foundations of complex projective geometry and theorems on the transitive groups of the line. It was these methods which also led to fundamental results on topology and Euclidean and hyperbolic geometry in\n3\ndimensions. He also studied the regular transformations of surfaces, which are closely connected to the above problems and which lead to interesting applications in dynamics. His expertise in this new branch of geometry, topology, was recognised in, among other ways, his being asked to write the chapter on 'Topology' in the\nEncyclopédie Francaise\n.\nHis final work was intended to be a series of five books, only two of which were written before his death. The first was written in Hungarian and published in\n1937\n. However a French translation was published in\n1955\nunder the title\nLes fondements de la géométrie Tome I. La construction élémentaire de la géométrie euclidienne\nⓉ\n(\nFundamentals of geometry; Volume I. The elementary construction of Euclidean geometry\n)\n. It receives high praise from H Busemann in a review:-\nFrom the very modest introduction one would never guess that this is one of the richest works on the foundations of geometry. The introduction states that the author essentially follows\nHilbert\n; it lists as major deviations only that angle does not appear as primitive concept, but is defined, and that the existence of motions\n(\nbased on congruence of segments\n)\nis postulated instead of the first congruence theorem for triangles. Actually, the book contains a wealth of unusual material. ... The exposition is meticulous and quite easily readable ...\nThe second volume\nThe Foundations of Geometry. Volume Two. Projective Geometry\nwas published in Hungarian in\n1944\n.\nE Lukacs\nbegins his review by writing:-\nThis is the second volume of a treatise on the foundations of geometry; the preceding volume dealt with Euclidean geometry. The classical projective geometry is developed in great detail so that this book can also be used as a text book. The author's aim is to give a foundation of projective geometry on which it is possible to build either Euclidean, hyperbolic or elliptic geometry. The greater part of the book is confined to the discussion of real projective geometry. The author avoids imaginary elements because, on the chosen axiomatic basis, their use could only mean a change in terminology. An analytical discussion of complex projective geometry is given separately.\nKerékjártó was honoured by being elected a corresponding member of the\nHungarian Academy of Sciences\nin\n1934\nand a full member of the Academy in\n1945\n. He was also an editor of\nActa Universitatis szegediansis, Acta scientiarum mathematicarum\nfrom\n1933\nuntil his death.\nThe authors of\n[\n5\n]\nend their obituary with these words:-\nDeath has taken Béla de Kerékjártó when he was still at his most creative. We do not know what plans he had in mind, but certainly his death has deprived mathematics of some really irreplaceable works.",
  "matematicos_citados_na_biografia": [
    "habilitated",
    "privatdozent",
    "topology",
    "Solomon Lefschetz",
    "Brouwer",
    "Veblen",
    "Jordan",
    "Hans Freudenthal",
    "Lefschetz",
    "Freudenthal",
    "Hermann Weyl",
    "Erich Bessel-Hagen",
    "Bessel-Hagen",
    "Frigyes Riesz",
    "Alfréd Haar",
    "Tibor Radó",
    "Haar",
    "Lipót Fejér",
    "Poincaré",
    "G D Birkhoff",
    "Hilbert",
    "E Lukacs",
    "Hungarian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}