{
  "nome_completo": "Benoît Lucien Albert Perthame",
  "nome_curto": "Benoît Perthame",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Perthame/",
  "data_nascimento": "23 June 1959",
  "local_nascimento": "Marcq-en-Baroeul, Hauts-de-France, France",
  "data_morte": null,
  "local_morte": null,
  "summary": "Benoît Perthame is a leading expert in partial differential equations and a pioneer in the field of mathematical biology",
  "biografia": "Benoît Perthame\nis the son of the financier Lucien Valere Perthame\n(1921\n-\n2009)\nand Charline Quiquempois\n(1928\n-\n1988)\n. Benoît was born and brought up in Marcq-en-Baroeul in the Hauts-de-France region of northern France; it is a suburb of Lille\n[\n5\n]\n:-\nThere was nothing to suggest that Benoît Perthame would embark on a scientific career - neither his family background nor the industrial lands of northern France where he grew up.\nHis favourite subjects at school were mathematics and physics and he had to make a decision where his main interests lie before entering university\n[\n7\n]\n:-\nAfter school, I hesitated between mathematics and physics, but I found mathematics more attractive, mainly because of my teachers and also because it was providing the tools to understand physics.\nIn\n1979\nhe entered the École Normale Supérieure in Paris. It was here that he developed a passion for mathematics. He explained\n[\n5\n]\n:-\nIt is an open environment, where people take an interest in both the theory and the raison d'être of mathematics. This mind-set has always attracted me.\nHe studied for his doctorate advised by\nPierre-Louis Lions\nand he was awarded the degree by the University Paris IX Dauphine in\n1983\nfor his Thèse de\n3\nème cycle, namely\nSur quelques problèmes de contrôle optimal et de théories cinétiques et leur approximation numérique\nⓉ\n(\nOn some problems of optimal control and kinetic theories and their numerical approximation\n)\n. Perthame gave the following abstract for the thesis:-\nThis thesis is divided into three parts where we study nonlinear partial differential equations.\nA. -\nHamilton\n-\nJacobi\nequations and optimal control.\nIn the first chapter, we are interested in the quasi-variational inequalities associated with the\nHamilton\n-\nJacobi\n-Eellmann equations. We give a condition ensuring the existence of a continuous solution. This makes it possible to study various problems related to impulse control of broadcasts: state constraints, strong regularity, ergodic control. In a second chapter, we give different extensions of the notion of viscosity solution of first order\nHamilton\n-\nJacobi\nequations in order to deal with the cases of Neumann conditions\n[\nnamed after\nCarl Neumann\n]\n, time-discontinuous Hamiltonians or discontinuous obstacles.\nB. - Transport equation and asymptotic problems.\nIn this part, we mainly study the radiative transfer equations and their approximation by a degenerate non-linear elliptical equation of the porous media type. Two types of techniques are used for this: the theory of accretive semi-groups in a general\nBanach\nspace or else compactness methods.\nC. - Implicit mesh adaptation in one-dimensional gas dynamics.\nWe approach the problem of the numerical calculation of discontinuities\n(\nshock\n)\nby adaptive mesh methods. The equations are implicitly discretised and coupled to an\n(\nimplicit\n)\nequation determining the new mesh.\nPierre-Louis Lions\nwas not only important for supervising Perthame's thesis but he also influenced his whole career. In the interview\n[\n7\n]\nPerthame explains this influence:-\nHis approach to mathematics is so clear, insightful and broad that it is difficult not to be influenced when working on PDEs. I can mention two aspects that I try to follow as much as I can. The first one is trying to choose problems coming from application and, the second one, trying to find, at least in a first step, a clear and accessible presentation avoiding technical issues and complicated terminologies.\nAfter the award of his doctorate in\n1983\n, Perthame was appointed as an Assistant Professor at the École Normale Supérieure. In\n1983\nthe first three of his papers were published, namely:\nInéquations quasi variationnelles et équations de Hamilton-Jacobi-Bellman\nⓉ\n(\nQuasi-variational inequalities and Hamilton-Jacobi-Bellman equations\n)\n;\nInéquations quasi-variationnelles et équations de Hamilton-Jacobi-Bellman dans\nR\nN\n\\mathbb{R}^{N}\nR\nN\nⓉ\n(\nQuasi-variational inequalities and Hamilton-Jacobi-Bellman equations in\nR\nN\n)\n; and\n(\nwith\nPierre-Louis Lions\n)\nUne remarque sur les opérateurs non linéaires intervenant dans les inéquations quasi-variationnelles\nⓉ\n(\nA remark on the nonlinear operators intervening in the quasi-variational inequalities\n)\n. In\n1987\nhe submitted his Thèse d'État in mathematics to the University Paris IX Dauphine. This is essentially similar to the\nhabilitation\nso,\n1988\n, he left Paris and became a Professor at the University of Orleans. In\n1989\nhe joined Inria, the Institut de recherche en informatique et automatique. It was in\n1967\nthat Inria was founded as part of an initiative by President Charles de Gaulle. It was initially set up in Rocquencourt, on a site previously occupied by NATO, with the aim of building up computer science in France and to form the foundation of European computer science research. In\n1993\nhe returned to Paris when he was appointed as a Professor at the Pierre et Marie Curie University\n(\nParis VI\n)\n. His research output was remarkable and he had over\n60\npapers in print or accepted for publication by\n1993\n, ten yeas after the award of his doctorate. His research up to that time is summarised in\n[\n9\n]\nas follows:-\nProfessor Perthame began to make first-class contributions to scalar conservation laws and various hyperbolic systems that can be reformulated in the phase space as kinetic equations. This approach provides a powerful tool for proving properties of the solutions, such as regularity in fractional\nSobolev\nspaces or application of compensated compactness. One of his major results has been the proof of existence of global weak solutions including vacuum for isentropic gas dynamics. During the\n80\n's, together with F Golse, R Sentis and\nP-L Lions\n, Professor Perthame discovered various compactness lemmas of fundamental importance, which initiated the modern theory of kinetic equations.\nPerthame's own description of his work up to the mid-\n1990\ns is given in the interview\n[\n10\n]\n:-\nI began my research in the field of stochastic control for a master thesis and then PhD, the field is vast and was emerging with the notion of viscosity solutions, it was a very active time for that field with many new ideas. After that I turned to questions motivated by kinetic physics\n(\nplasmas, fluids\n)\nand multi-scale analysis.\nHis outstanding research contributions soon led to Perthame being awarded major prizes. In\n1989\nhe was awarded the Peccot Prize from the College de France, in\n1992\nhe received the\nBlaise Pascal\nPrize from the\nFrench Academy of Sciences\nand, in the same year, the CISI Prize. He was only the second winner of this prize, first awarded in\n1991\nby the Compagnie Internationale de Services en Informatique\n(\nCISI\n)\nand the Société de Mathématiques Appliquées et Industrielles. It rewards research in the field of applied mathematics and numerical computation in engineering sciences carried out in France.\nIn\n1994\n, he was awarded the Silver Medal of the CNRS\n(\nthe French National Centre for Scientific Research\n)\n. He received the R Sacchi Landriani Prize from the Accademia Lombarda in\n1997\n. This prize, first awarded in\n1991\nand thereafter every two years, is to recognise important original contributions to the field of numerical methods for partial differential equations during the preceding five years; it is named in honour of the numerical analyst Giovanni Sacchi Landriani, who died in a motorcycle accident in\n1989\nat age\n31\n. Also in\n1997\nhe was awarded the Gold Medal of the CNRS. In the same year Perthame became a Professor in the Department of Mathematics and Applications of the École Normale Supéieure.\nIn\n1998\nPerthame became head of the M\n3\nN\n(\nMulti-Models and Numerical Methods\n)\nproject and the BANG\n(\nBiophysics, Numerical Analysis and Geophysics\n)\nproject, both at Inria. He was one of three who had given a series of lectures at a summer school which had been held in September\n1994\nin Saint-Malo; their lectures were published as the book\nModeling of collisions\n(1998)\n.\nYou can see more information about this book and Perthame's other books at\nTHIS LINK\n.\nIt was around this time that he started to become interested in applying his skills to solve problems from the biological sciences. He said\n[\n7\n]\n:-\nAt the end of the\n1990\n's I realised that there were many teams involved in all areas of physics but very few in problems of biology. That is why I decided to investigate the modelling questions in the various fields of life sciences. I discovered that the way to think in biology is very different from physics. Models are not well established; the mathematics should tell you about the qualitative behaviours rather than exact numbers and coefficients are not fixed\n(\nadaptation of organisms is important\n)\n. Behind these questions various theories emerge as pattern formation, waves, uncertainty quantification, instabilities and asymptotic theory because one always learns more from extreme cases than from the normal behaviour.\nIt was\n2002\nbefore biology publications by Perthame began to appear in print but by\n2004\naround half of his eleven papers were related to the life sciences while in\n2006\nall his papers were. He explained\n[\n7\n]\n:-\nMy idea was to find these problems coming from life sciences which lead to model written in terms of nonlinear PDEs which are not standard. In each of these fields I could find new challenging mathematical questions. It is clear that many\n(\nall\n)\nother areas of mathematics have also something to bring to biological modelling.\nPerthame's article\n[\n8\n]\non mathematical modelling in biological science begins as follows:-\nBiologists now have instruments that generate massive amounts of data: images, genomes and other signals of all types. They are therefore confronted with a new difficulty which consists in processing these data, cleaning them from measurement errors and representing them usefully. Mathematics first appears as a tool to achieve this goal. It does not matter what biophysical mechanisms produce these data, it is already a matter of visualising them effectively, just as experimental methods aim to predict observations in a context too complex for physical analysis.\nFor a longer extract from this article, see\nTHIS LINK\n.\nDarwin's theory of evolution became an area which he found especially fascinating\n[\n5\n]\n:-\nIt is one of the things I am most proud of. With evolution, whatever we do, there are mutations, variability - nothing is fixed. The biological approach differs greatly from traditional physics. For example, this theory leads to the modelling of resistance to treatments in order to better understand their mechanism. This all raises a wealth of questions.\nAsked which scientist had impressed him most, he replies\n[\n10\n]\n:-\nI often say that there are two remarkable results about Partial Differential Equations in the first half of\n20\nth century. The Lax-Milgram theorem\n[\nthis is\nPeter Lax\n]\ntells you that to theoretically solve an elliptic PDE is to build a\nHilbert\nspace, and to numerically solve it, you need to fill well that Hilbert space in finite dimension. The\nTuring\ninstability mechanism tells you that diffusion can destabilize a stable dynamical system.\nOn\n19\nNovember\n2019\nPerthame gave the lecture\nTuring and patterns in nature\nat the Hsu Shou-Chlien International Conference Center as part of the celebrations for the Tamkang University\n70\nth Anniversary Tamkang Clement and Carrie Chair. The Abstract of his lecture is as follows:-\nAlan Turing\nis most known for inventing cryptology and the decoding of the Enigma machine during the Second World War, thus founding the modern computer science. However, in\n1952\n, two years before he committed suicide, he published a remarkable mathematical paper in which he describes a surprising mechanism which explains how patterns are formed during morphogenesis and early development of organisms. He introduces the concept of morphogen, a notion which was unknown at that time, and his theory will be reproduced experimentally only decades later.\nTuring\nstructures are now observed in a number of natural phenomenon.\nLet us note some other presentations that Perthame has been invited to deliver. The Instituto Nacional de Matemática Pura e Aplicada was founded in\n1952\nand is based in Rio de Janeiro. A major conference was organised from\n3\n-\n14\nJune\n2002\nto celebrate the\n50\nth anniversary of its founding and Perthame was one of the invited lecturers giving the lecture\nThe Helmholtz equations and its high frequency limit\n. He was a plenary speaker at the International Council for Industrial and Applied Mathematics held on\n18\n-\n22\nJuly\n2011\nin the Vancouver Convention Centre in Vancouver, Canada. Three years later, he delivered the plenary talk\nSome mathematical aspects of tumour growth and therapy\nat the International Congress of Mathematicians held in Seoul, Korea, held\n13\nAugust to\n21\nAugust\n2014\n. He was a main speaker at the\n27\nth Nordic Congress of Mathematicians in the Aula Magna, Stockholm University celebrating the\n100\nth year of the Institut\nMittag-Leffler\nheld\n16\n-\n20\nMarch\n2016\n. He delivered the talk\nAdaptive evolution and concentrations in parabolic PDEs.\nAt the Hong Kong Institute for Advanced Study of the City University of Hong Kong, Perthame delivered the lecture\nSome Equations of Mathematical Biology\non\n23\nMay\n2019\n. Here is a report of the lecture which appeared in the\nHong Kong Institute for Advanced Study Newsletter\n4\n(\nSeptember\n2019)\n:-\nEquations of mathematical physics are numerous and define many basic principles of physics. In this talk, Professor Benoît Perthame, Professor of Mathematics at Sorbonne Université in Paris and the Director of the Laboratoire\nJacques-Louis Lions\n, discussed several topics from biology: ecology, neuroscience, cell movement, dynamics of tissue growth through some famous equations of mathematical physics. Professor Perthame elaborated the Fundamental Principle of Dynamics described by the\nNewton\nequations. In addition, he explained how\nMaxwell\n,\nBoltzmann\nand\nSchrödinger\nequations illustrate the fundamental principles of electromagnetism, rarefied flows, and quantum world. Professor Perthame shared his latest research result on Partial Differential Equations\n(\nPDEs\n)\n. In conclusion, he said that nonlinear PDEs have played an important role in a number of problems from biology as cell motion and cell colonies self-organisation, Darwinian evolution, modelling tumour growth and therapy, neural networks.\nPerthame has received many prizes and awards for his contributions to mathematical biology including the\nBlaise Pascal\nMedal in Mathematics from the European Academy of Sciences\n(2013)\n, and the French\nAcadémie des Sciences\nGrand Prix Inria\n(2015)\n. He was elected to the European Academy of Sciences in\n2016\nand to the French\nAcadémie des Sciences\nin\n2017\n.\nIn\n[\n5\n]\nPerthame give his vision of mathematics:-\nMathematics has founded many concepts that are of direct use to the economy. For example, a recent survey conducted by AMIES\n(\nAgency for mathematics in interaction with business and society\n)\nconcludes that it contributes directly to\n15\n% of France's GDP. However mathematics isn't just about solving problems, it is also developing theories with arguments, putting reasoning into place, finding intellectually-interesting concepts and providing substance - whilst solving the real questions of today's world.\nPerthame is married to Catherine Cintract, daughter of Henri and Michel Cintract. He said\n[\n10\n]\n:-\nMy main preoccupation is to keep some time from my research for my students, and to keep some time from my students for my family.\nIn the same interview he said his favourite book was\nGuns, germs and steel\nby Jared Diamond. He also said his favourite mathematical biology books were\nJim Murray\n's\nMathematical Biology\nand Jürgen Jost's\nMathematical Methods in Biology and Neurobiology\n, both of which he describes as 'remarkable'.\nLet us end this biography by quoting the testimonial from Panagiotis E Souganidis, the Charles H Swift Distinguished Service Professor, Department of Mathematics, The University of Chicago:-\nI have known Benoît for more than\n30\nyears. We completed our degrees about the same time and it has been a real pleasure to work with him in several different projects. He has had a remarkable career and produced outstanding and ground-breaking results in several areas of applied analysis. He is clearly one of the innovators. I am also impressed by his early decision to work in the emerging at the time area of mathematical biology. With his energy, abilities and perseverance he was able to create what I would call a school, whose work and influence has had already a major impact in this area.",
  "matematicos_citados_na_biografia": [
    "Pierre-Louis Lions",
    "Hamilton",
    "Jacobi",
    "Carl Neumann",
    "Banach",
    "habilitation",
    "Sobolev",
    "P-L Lions",
    "Blaise Pascal",
    "French Academy of Sciences",
    "THIS LINK",
    "Peter Lax",
    "Hilbert",
    "Turing",
    "Alan Turing",
    "Mittag-Leffler",
    "Jacques-Louis Lions",
    "Newton",
    "Maxwell",
    "Boltzmann",
    "Schrödinger",
    "Académie des Sciences",
    "Jim Murray"
  ],
  "imagens": [
    "perthame.jpg"
  ]
}