{
  "nome_completo": "Bernadette Perrin-Riou",
  "nome_curto": "Bernadette Perrin-Riou",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Perrin-Riou/",
  "data_nascimento": "1 August 1955",
  "local_nascimento": "Les Vans, Ardèche, France",
  "data_morte": null,
  "local_morte": null,
  "summary": "Bernadette Perrin-Riou is a French mathematician who has made important contributions to number theory. She was awarded the 1999 Ruth Lyttle Satter Prize from the American Mathematical Society.",
  "biografia": "Bernadette Perrin-Riou\nwas born in Les Vans, a small town about\n75\nkm northwest of Avignon. Both Perrin-Riou's parents had been born in Les Vans but, her mother being a physicist and her father a chemist working in Paris, the family moved to Neuilly-sur-Seine, within the Paris area. It was in Neuilly-sur-Seine that Bernadette and her two sisters were brought up. The family provided a highly academic environment in which all three girls quickly developed a love of science. Bernadette's two sisters became physicists, but she was turned on to mathematics by an inspiring teacher, Pascal Monsellier, when she was studying at the Lycée. From that time on, in addition to outstanding performances in all her high school subjects, she discovered the fascination of mathematics.\nIn\n1974\nPerrin-Riou entered the École Normale Supérieure de Jeunes Filles which is now part of the École Normale d'Ulm\n[\n2\n]\n:-\nHer class was very small, consisting of only twenty other women with whom she took all her classes. The small-scale, personal atmosphere was well suited to Perrin-Riou, and she found that she liked to delve deeply into subjects.\nPerrin-Riou completed her undergraduate studies in\n1977\nand began to undertake research. She was appointed as a research assistant at Pierre et Marie Curie University in Paris in\n1978\nshe worked towards her Thèse de\n3\nème cycle, advised by Georges Poitou. After the award of the degree from Université Paris-Sud XI in Orsay in\n1979\nshe continued to work towards a doctorate supervised by\nJohn Coates\nwho had been appointed to a professorship there in\n1978\n. During the period that she worked towards her doctorate she published several important works beginning with\nPlongements d'extensions galoisiennes\nⓉ\n(\nEmbeddings of Galois extensions\n)\n(1978)\n. In\n1979\nshe published the\n110\n-page\nPlongement d'une extension diédrale dans une extension diédrale ou quaternionienne\nⓉ\n(\nEmbedding a dihedral extension in a dihedral or quaternionic extension\n)\nin the Mathematical Publications of Orsay Series. Jack Sonn writes:-\nThis work is devoted to a study of the embedding problem over number fields involving dihedral and quaternion\nGalois\ngroups, which are distinguished by their violation of the\nHasse\nlocal-global principle.\nFurther publications on the same theme followed:\nPlongement d'extensions diédrales\nⓉ\n(\nEmbeddings of dihedral extensions\n)\n(1979)\n;\nPlongement d'une extension diédrale dans une extension diédrale ou quaternionienne\nⓉ\n(\nEmbedding a dihedral extension in a dihedral or quaternionic extension\n)\n(1980)\n;\nGroupe de Selmer d'une courbe elliptique à multiplication complexe\nⓉ\n(\nThe Selmer group of an elliptic curve with complex multiplication\n)\n(1981)\n; and\nDescente infinie et hauteur p-adique sur les courbes elliptiques à multiplication complexe\nⓉ\n(\nInfinite descent and  p-adic height on elliptic curves with complex multiplication\n)\n(1982)\n. She was awarded her doctorate in\n1983\nfor her thesis\nArithmetique des courbes elliptiques et théorie d'Iwasawa\nⓉ\n(\nArithmetic of elliptic curves and Iwasawa theory\n)\n. This thesis, which proves an algebraic analogue of the\np\np\np\n-adic Birch and Swinnerton-Dyer conjecture, was published in\n1984\n.\nIn\n1983\n, following the award of her doctorate, Perrin-Riou was appointed Maître de Conférences at the Pierre et Marie Curie University. In the autumn of that year she accepted an invitation to spend a year as a visiting professor at Harvard University\n[\n2\n]\n:-\nShe had never been to the United States and was quite excited about the opportunity to exchange ideas with a new community of mathematicians. Although she enjoyed the intellectual interchange at Harvard, she found that splitting her time between work and family was difficult. Her husband, also a mathematician, and her\n18\n-month-old son accompanied her on this trip, and the demands of family life left little time to socialise. The constant need to speak and work in English caused further stress. At the end of the year she was happy to return to France, continuing her research at the Pierre and Marie Curie University.\nIn\n1985\nPerrin-Riou's second child was born, another son. She began teaching at Université Paris VI and two years later her third son was born. She continued teaching and undertaking research, publishing papers such as\np-adic L-functions associated to a modular form and an imaginary quadratic field\n(1988)\n,\n(\nwith\nJohn Coates\n)\nOn p-adic L-functions attached to motives over\nQ\n\\mathbb{Q}\nQ\n(1989)\n,\nVariation of the p-adic L-function under isogeny\nⓉ\n(\nVariation of the p-adic L-function under isogeny\n)\n(1989)\n, and\nThéorie d'Iwasawa et hauteurs p-adiques\nⓉ\n(\nIwasawa theory and p-adic heights\n)\n(1992)\n. She published a fundamental paper in\n1994\n, namely\nThéorie d'Iwasawa des représentations p-adiques sur un corps local\nⓉ\n(\nIwasawa Theory p-adic representations of local bodies\n)\nin which she built an\nIwasawa\ntheory for crystalline\np\np\np\n-adic representations generalizing those well known for\nZ\np\n(\n1\n)\n\\mathbb{Z}_{p}(1)\nZ\np\n​\n(\n1\n)\nand the\nTate\nmodule of an ordinary good reduction elliptic curve.\nThe same year in which this fundamental\n80\n-page paper was published, she moved to Université Paris-Sud Orsay\n[\n2\n]\n:-\nAlthough Perrin-Riou enjoyed her teaching experience, it was very time consuming and made it difficult to continue her mathematical research, which she did remarkably well nonetheless. In\n1994\nshe obtained her present position at the University of Paris-Sud in Orsay. This position is almost exclusively a research position. Although she still teaches an occasional course and like the contact with students, she is freed from the constant time demands of teaching.\nAt the International Congress of Mathematicians at Zürich in\n1994\n, Perrin-Riou gave the invited address\np-adic L-functions\n. In the following year she published the important monograph\nFonctions L p-adiques des représentations p-adiques\nⓉ\n(\nOn p-adic functions L  of p-adic representations\n)\n. She wrote in the Preface:-\nThis book reflects research done over the past few years at the University of Pierre and Marie Curie.\nIn\n2000\nan English translation was published. The publisher describes the work as follows:-\nTraditionally, p-adic L-functions have been constructed from complex L-functions via special values and\nIwasawa\ntheory. In this volume, Perrin-Riou presents a theory of p-adic L-functions coming directly from p-adic\nGalois\nrepresentations\n(\nor, more generally, from motives\n)\n. This theory encompasses, in particular, a construction of the module of p-adic L-functions via the arithmetic theory and a conjectural definition of the p-adic L-function via its special values. Since the original publication of this book in French\n(\nin\n1995)\n, the field has undergone significant progress. These advances are noted in this English edition. Also, some minor improvements have been made to the text.\nThe work described in this text led to Perrin-Riou being awarded several major prizes. In\n1998\nshe was awarded the Charles-Louis de Saulses de Freycinet Prize from the\nAcadémie des Sciences\n. Then in\n1999\nshe received the Ruth Lyttle Satter Prize from the\nAmerican Mathematical Society\n, the fifth time the prize had been awarded. The citation for the award reads\n[\n1\n]\n:-\nThe\n1999\nSatter Prize is awarded to Bernadette Perrin-Riou in recognition of her number theoretical research on p-adic L-functions and\nIwasawa\ntheory. Her results on the p-adic Gross-Zagier Formula and the related Birch and Swinnerton-Dyer Conjectures have striking applications to the arithmetic of elliptic curves. Moreover, her foundational papers on p-adic representations and motives and on the\nBloch\n-\nKato\nConjectures provide a framework and route to these basic general problems about L-functions of motives. In particular, her work provides the link between\nKato\n's\nEuler\nSystem and p-adic L-functions. Her works have had a profound impact on the study of p-adic L-functions and\nIwasawa\ntheory, both in shaping it at present and in determining the direction in which it is moving.\nHere is a copy of her response\n[\n1\n]\n:-\nI am very grateful to the\nAmerican Mathematical Society\nfor awarding me the\n1999\nAmerican Mathematical Society\nRuth Lyttle Satter Prize, and I am both very happy and honoured. On this occasion I cannot help but think of some of the people who taught me mathematics: Pascal Monsellier, my high school teacher, with whom I discovered vector spaces, abstract algebraic structures, concrete plane and space isometry groups, as well as the epsilons and etas; and later\nRoger Godement\nand his course \"Le jardin des délices modulaires\"\nⓉ\n(\nThe garden of modular  delights\n)\n. George Poitou and\nJohn Coates\nthen introduced me to number theory,\nGalois\ncohomology, and elliptic curves. Eventually, I tried to extend the framework of elliptic curves using p-adic representations, which naturally led me to use Jean-Marc Fontaine's ring of periods. I was not aware that my work has had the influence stated in the citation, but I certainly had great pleasure in discovering and understanding mathematical objects and becoming \"intimate\" with them. On the other hand, sometimes I found it was rather frustrating not to be able to share this mathematics with more people. This may be because of the subject; not everyone in number theory can prove a theorem at the same time deep and easy to state! Since this is a prize for women, I should probably add a few words without any claim to generality. My parents both had a scientific education, and I never thought of any other studies. I never felt a serious difference with men during my professional career, but this may be just because I was too innocent and unaware of the problem. However, I am still shocked by the small number of girls - about one-third - in my son's high school science class.\nIn\n2001\nPerrin-Riou published another major text\nThéorie d'Iwasawa des Representations p-adiques Semi-Stables\nⓉ\n(\nIwasawa Theory of p-adic  semi-stable representations\n)\n. This monograph continues the work of her fundamental\n1994\npaper referred to above and provides a generalisation of that work to semi-stable\np\np\np\n-adic representations.",
  "matematicos_citados_na_biografia": [
    "John Coates",
    "Galois",
    "Hasse",
    "Iwasawa",
    "Tate",
    "Académie des Sciences",
    "American Mathematical Society",
    "Bloch",
    "Kato",
    "Euler",
    "Roger Godement"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}