{
  "nome_completo": "Keith William Morton",
  "nome_curto": "Bill Morton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morton/",
  "data_nascimento": "28 May 1930",
  "local_nascimento": "Ipswich, England",
  "data_morte": null,
  "local_morte": null,
  "summary": "Bill Morton is an English mathematician who worked on partial differential equations and their numerical analysis.",
  "biografia": "Bill Morton\n's parents were Keith Harvey Morton\n(1902\n-\n1933)\nand Muriel Violet Hubbard\n(1899\n-\n1934)\n. Keith and Muriel were married in\n1927\n. Sadly, Keith died in June\n1933\n, shortly after Bill's third birthday, and Muriel died a year later. He was brought up in Hadleigh, Suffolk by his mother's sister Blanche E M Hubbard who was married to Theophilus E Spooner. Later they moved to Colchester, Essex. Bill began his schooling at Hadleigh Bridge Street Primary in\n1935\n. Olive, a sister of his mother, who was married to Donald Ripper, and an older sister Emily Knights, provided some financial support during his schooling and were his official guardians. He spent five years at Hadleigh Bridge Street Primary, completing his studies there in\n1940\nand entering Sudbury Grammar School in that year. This was an ancient boys' grammar school founded in\n1491\n. It has now amalgamated with other local schools to form Sudbury Upper School.\nIn\n1948\n, the year when Morton completed his secondary education, national service was compulsory and he spent the year\n1948\n-\n49\nin the Royal Electrical and Mechanical Engineers. This consisted of technicians who maintained the army's equipment. Morton writes\n[\n4\n]\n:-\nOlive and her husband Donald Ripper provided me with a very welcome haven when I was doing my National Service training in radar at Stockport Technical College.\nAfter completing his National Service, Morton matriculated at Corpus Christi College, Oxford, where he studied mathematics. At Oxford, Morton attended lectures on quantum mechanics delivered by the South African\nJacobus Stephanus de Wet\n, known to all as Jack.\nDe Wet\nhad a Ph.D. from Princeton in theoretical physics and, after working at the University of Cape Town and the University of Pretoria, was appointed to a senior research fellowship at Balliol College of Oxford University in\n1947\n. John Johnston writes\n[\n2\n]\n:-\nMorton's long-standing inspiration from one of the greats in mathematics,\nDavid Hilbert\n, started when he was first introduced to\nHilbert spaces\nby\nJack de Wet\nwhilst studying quantum mechanics as a mathematics undergraduate at Oxford.\nHilbert\nis one of the most influential mathematicians of his time, and his famous address to the International Congress of Mathematicians in Paris in\n1900\n, where he announced a number of unsolved problems, was to Morton's mind 'crucial' in its plea that mathematics should always remain a single, undivided subject.\nIn\n1952\nMorton married Patricia Mary Pearson; they had two sons and two daughters. Morton graduated with a B.A. in\n1952\nand began working in the Theoretical Physics Division of the Atomic Energy Research Establishment at Harwell\n(\nwhich was in Berkshire at the time but, following boundary changes in\n1974\n, is now in Oxfordshire\n)\n. There he worked on Monte Carlo methods for nuclear criticality and published a number of papers in collaboration with\nJohn Michael Hammersley\nwho was Principal Scientific Officer at the Atomic Energy Research Establishment at Harwell at the time. These joint papers are:\nTransposed branching processes\n(1954)\n;\nPoor man's Monte Carlo\n(1954)\n;\nThe estimation of location and scale parameters from grouped data\n(1954)\n; and\nA new Monte Carlo technique: antithetic variates\n(1956)\n.\nPoor man's Monte Carlo\n, which includes a paper and a discussion, was published by the\nRoyal Statistical Society\nand reviewed by\nAlston Householder\nwho writes:-\nThis paper and the subsequent discussion relate chiefly to the art of applying Monte Carlo, and no brief summary can do justice to either. The basic thesis can be inferred from the title, that one does not necessarily need high speed machines to use Monte Carlo effectively. The authors first point out that only the name and not the method is new\n(\nthe discussion brings out that King Solomon was an early practitioner\n)\nand then discuss three problems: the critical size of a nuclear reactor, the test of a quantum hypothesis, and self-avoiding walks.\nAlston Householder\nalso reviewed the\n1956\npaper mentioned above and writes:-\n... the paper represents a major contribution to the study of Monte Carlo Methods.\nMorton also published the single-authored paper\nA generalisation of the antithetic variate technique for evaluating integrals\n(1957)\n.\nAs a consequence of his contributions to this area, Morton was invited by the\nCourant\nInstitute of Mathematical Sciences in New York to spend some time there. He took sabbatical leave from the Atomic Energy Authority in\n1959\nand went to the\nCourant\nInstitute. After spending time there, he was invited by the Courant Institute to undertake graduate studies there. Now at Harwell, Morton\n[\n2\n]\n:-\n... found it particularly enlightening to work with theoretical physicists, but his role was too much concerned with developing computing, and he wanted to get back to mathematics.\nHe therefore resigned his position at Harwell and, in\n1961\n, began studying for a Ph.D. at the Courant Institute while employed there as a Research Scientist. His thesis advisor was Harold Grad\n(1923\n-\n1986)\nwho had been a student of\nRichard Courant\n. Grad was Head of the Magnetohydrodynamics Department at the\nCourant\nInstitute and was a leading expert on applications of statistical mechanics to magnetohydrodynamics and to plasma physics. Morton was awarded a Ph.D. by New York University in\n1964\nfor his thesis\nFinite Amplitude Compression Waves in a Collision-Free Plasma\n. After completing his doctoral studies, in\n1964\nMorton was appointed as Head of Computing and Applied Mathematics at the Culham Laboratory which was operated by the United Kingdom Atomic Energy Authority. The Atomic Energy Authority had been created ten years earlier to undertake nuclear research for the UK government and, in\n1960\n, had opened the purpose-built nuclear fusion laboratory just south of Oxford. Morton worked at Culham until\n1972\nand during this time published, in collaboration with Robert D Richtmyer, published the book\nDifference methods for initial-value problems\n(1967)\n. Astri Sjöberg writes:-\nThe book is primarily written for users of difference methods, but it can be highly recommended to everyone interested in the subject.\nAt Culham, as in his earlier position at Harwell, Morton was pleased to work with theoretical physicists but again he felt that he was too involved in computing and wanted to have a larger involvement with mathematics. He was appointed to the Chair of Applied Mathematics at the University of Reading in\n1971\n, taking up the position in the following year. The paper\nStability and convergence in fluid flow problems. A discussion on numerical analysis of partial differential equations\nwhich he published in\n1971\ngives both a Culham and a University of Reading address for Morton. This paper, published by the\nRoyal Society of London\n, is an extremely valuable contribution to the area and we give the beginning of Morton's Introduction where he sets the scene:-\nOf all the partial differential equations which are solved numerically, those arising from fluid flow problems are certainly among the most important. Meteorology and oceanography, engineering flows of liquids and gases, aerodynamics and plasma physics are but some of the fields in which they occur and are being successfully solved. One may indeed expect a rapid expansion of this activity in the next few years as the solution of physically interesting two- and three-dimensional flows becomes a practical and economic proposition.\nThere is, however, a more pertinent reason for singling out this application area in discussing the numerical analysis of partial differential equations. This is that from the inception of the subject scientists attempting the solution of fluid flow problems have continuously made outstanding contributions to the subject's development. In particular, the detailed understanding of the behaviour of specific difference schemes and of various types of instability owes much to their work.\nEach particular field has its own complicating difficulties and the equations necessary to describe physically interesting phenomena are often formidable. It would therefore be inappropriate to work here with complete systems of realistic equations: instead it will be our aim to bring out some of the important points common to the whole class of fluid flow problems by using in each case the simplest model equations adequate for our purpose.\nMorton's work in this and many other papers, gained great insight into the flow of fluids. The results of his investigations have influenced a broad range of fields, from weather forecasting to the design of power stations and from the development of aircraft engines to the growth of scientific computing.\nMorton held the chair of Applied Mathematics at Reading from\n1972\nto\n1983\n[\n2\n]\n:-\n... he concentrated on graduate teaching, bringing his wide experience to bear on the MSc courses.\nWith his colleague Michael Baines, Morton founded the Institute for Computational Fluid Dynamics at the University of Reading. It gained a high international reputation, particularly though organising conferences. In March\n1982\nthe conference 'Numerical methods for fluid dynamics' was organised by Morton and his colleagues at the University of Reading. The conference Proceedings appeared in the same year edited by Morton and Baines. The first paper in the Proceedings is a\n32\n-page paper by Morton\nGeneralised Galerkin methods for steady and unsteady problems\n. The second conference in this series was held at the University of Reading in April\n1985\n. Again Morton and Baines edited the Proceedings but Morton had left the Chair of Applied Mathematics at Reading before this conference, being appointed as a Professorial Fellow of Balliol College, Oxford University in\n1983\n. He held this position until be retired in\n1997\nand during this time organised the 'Numerical methods for fluid dynamics' conference at Oxford in March\n1988\n, at Reading in April\n1992\nand at Oxford in April\n1995\n. After retiring, Morton was made Emeritus Professor at Oxford University, Emeritus Fellow at Balliol College, Oxford, and appointed as a part-time Professor of Mathematics at the University of Bath,\n1998\n-\n2005\n.\nWe should mention two important books he published:\n(\nwith David F Mayers\n)\nNumerical Solution of Partial Differential Equations: an introduction\n(1994\n,\n2\nnd\nedition\n2005)\n; and\nNumerical Solution of Convection-Diffusion Problems\n(1996)\n. G W Hedstrom, reviewing the first of these, writes:-\nThis book is a solid introduction to numerical methods for partial differential equations. The methods are primarily based on finite differences, although a brief introduction to finite elements is given. The book includes parabolic, hyperbolic, and elliptic equations, each section starting with an analysis of the behaviour of solutions of the partial differential equations. ... A very desirable feature of the book is that it goes beyond the usual investigation of the heat equation, the wave equation, and\nPoisson\n's equation. Numerical methods for linear problems with variable coefficients are discussed, as well as nonlinear problems.\nThe aim of the second of these books is set out in the Preface by Morton:-\nThe main aim of this book is to try to draw together all these ideas, to see how they overlap and how they differ, and to provide the reader with a useful and wide-ranging source of algorithmic concepts and techniques of analysis.\nMatin Stynes writes in a review:-\nTo a large extent, the book achieves these desirable objectives. It is a nice blend of analysis, numerical results and insightful commentary. A generous number of figures aid the reader's understanding, and the style is clear and elegant. The level of presentation is ideal for anyone with some knowledge of numerical analysis who wishes to learn about the solution of convection-diffusion problems.\nIn July\n2010\nthe\nLondon Mathematical Society\nawarded Morton their\nDe Morgan\nMedal. It was awarded to:-\n... Professor Keith William\n(\nBill\n)\nMorton of the University of Oxford in recognition of his seminal contributions to the field of numerical analysis of partial differential equations and its applications and for services to his discipline.\nThe President of the\nLondon Mathematical Society\n, Angus MacIntyre, said:-\nA hallmark of Professor Morton's work is the creation of original, elegant mathematics in the service of real-world applications. The\nLondon Mathematical Society\nis proud to honour a mathematician who has changed the way we look at the numerical analysis of partial differential equations through his world-leading research results, his vision and his dynamic leadership qualities.\nMorton, on receiving the\nDe Morgan\nMedal, replied:-\nIt was an immense pleasure to receive the\nDe Morgan\nMedal and a very rewarding moment in my career. I would like to thank the Prizes Committee, particularly for the award citation, which made me very proud.\nAnother honour which we should mention was Morton's invitation to deliver the\nDame Mary Cartwright\nLecture in February\n2001\n. He gave the lecture\nEvolution Operators and Numerical Modelling of Hyperbolic Equations\nin the Mathematical Institute, Oxford. To celebrate Morton's\n80\nth\nbirthday, the conference 'Bill Morton's\n80\nth\nBirthday Conference' was held in Oxford University on\n29\nMay\n2010\n.\nMorton joined the\nSociety of Industrial and Applied Mathematics\nin\n1963\n, and was elected the first President of the UK Section when it was formed in\n1997\n. He joined the Institute of Mathematics and its Applications in\n1964\nand was honoured by serving a period as its vice-president. Together with Michael James David Powell\n(1936\n-\n)\nhe founded the Journal of Numerical Analysis. In addition to his scientific work, Morton lists his interests as reading, real tennis, walking, gardening, and listening to music.",
  "matematicos_citados_na_biografia": [
    "Jacobus Stephanus de Wet",
    "De Wet",
    "David Hilbert",
    "Hilbert spaces",
    "Jack de Wet",
    "Hilbert",
    "John Michael Hammersley",
    "Royal Statistical Society",
    "Alston Householder",
    "Courant",
    "Richard Courant",
    "Royal Society of London",
    "Poisson",
    "London Mathematical Society",
    "De Morgan",
    "Dame Mary Cartwright",
    "Society of Industrial and Applied Mathematics"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}