{
  "nome_completo": "Bogdan Tadeusz Bojarski",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bojarski/",
  "data_nascimento": "13 June 1931",
  "local_nascimento": "Błaszki, Sieradz County, Łodz Province, Poland",
  "data_morte": "22 December 2018",
  "local_morte": "Warsaw, Poland",
  "summary": "Bogdan Bojarski was a Polish mathematician who made important contributions to the Beltrami equation and the theory of quasiconformal transformations. He served as director of the Institute of Mathematics of the University of Warsaw, as director of the Institute of Mathematical Sciences of the Polish Academy of Sciences, and as director of the Banach Centre.",
  "biografia": "Bogdan Bojarski\nwas the son of Wacław Bojarski and his wife Helena. Both Wacław and Helena were teachers at the local school in Błaszki, a small town in central Poland. He was brought up at a difficult time. He was eight years old and attending elementary school when Germany invaded Poland in\n1939\n. More than half the population of Błaszki were Jewish and were transported to labour camps by the occupying German troops in December\n1939\n. Education was difficult through the war years to\n1945\nbut after that, despite difficulties, Bogdan and other young children were enthusiastic for knowledge, education and reading.\nWhile he was studying at the secondary school, Bogdan obtained a copy of the\n1933\nbook\nThe Expanding Universe\nby\nArthur Eddington\n. He found it exciting and decided that he wanted to study physics and astronomy and learn more about the remarkable universe we all inhabit. He took the school leaving examinations in\n1948\nas an external student and, having passed successfully, later in\n1948\nhe began studying physics and astronomy at the University of Łódz. Things did not work out in quite the way he had expected\n[\n1\n]\n:-\nThe shock came with the laboratory work and introductory courses in chemistry and physics. I started to argue with the teaching assistants, I wanted to understand the discussed processes and experiments better and deeper, so I asked more and more questions. The answers I obtained didn't satisfy me, the arguments I was given didn't match, the introduced concepts were not clear enough, not precise, etc. On the whole all that created a feeling of confusion and disappointment in my mind.\nBojarski's university experience changed dramatically when he took Zygmunt Zahorski's course on real analysis. Zygmunt Zahorski\n(1914\n-\n1998)\nhad been studying in Warsaw for a Ph.D. advised by\nStefan Mazurkiewicz\nbut this had to stop with the outbreak of World War II. He went to Łódz and became\nBanach\n's assistant eventually being awarded a Ph.D. from the Jagiellonian University in Krakow in\n1946\nwith\nTadeusz Ważewski\nas his advisor. He was appointed as an extraordinary professor at the University of Łódz in\n1948\n. Zahorski taught the real analysis course following the style of\nEdmund Landau\n. The real numbers were defined by\nDedekind\ncuts and Zahorski gave detailed proofs of their arithmetic, continuity, and completeness properties. This was so different from the confusion and lack of clarity Bojarski had found in physics and chemistry, so he now had no doubt in his mind that he wanted to study mathematics. He worked as a junior assistant at the University of Łódz in\n1950\n-\n51\n, wrote a Master's thesis advised by Zygmunt Zahorski, and graduated in\n1951\n.\nThe year\n1951\nwas a time of political and economical stress in Poland which was, at that time, a satellite state of the Soviets. A boarder treaty between Poland and the Soviet Union saw Poland lose land with valuable coal deposits. Bojarski was one of a group of four students from the University of Łódz who decided that they wanted to go to Russia to study for their doctorates. His family, especially his mother Helena, did not want him to go to Russia. Little was known in Poland about life in Moscow and many contradictory views were circulating. However, in November\n1951\nthe group of Łódz students went to Moscow\n[\n1\n]\n:-\n... we arrived in Moscow in November\n1951\n, greedy for science, mathematics, and philosophical discussions about politics, literature, art, theatre, music ... and we found all that in the Moscow academic and student community despite, sometimes, poor accommodation and life conditions and various shortcomings.\nFor the first eighteen months he lived in university accommodation and was one of six students sharing a single room. This was compensated by excellent concerts, operas, theatre productions and a pleasant social life. The living conditions improved markedly in the summer of\n1953\nwhen he moved into newly built student accommodation with a room of his own. Academic activity also increased markedly with high quality lectures, seminars and personal contacts with the professors.\nAndrey Kolmogorov\nwas the supervisor of all the doctoral students so Bojarski got to know him even though he was not studying the mathematical topics of\nKolmogorov\n's group.\nKolmogorov\n, however, invited him to take part in the social activities that he organised for his group, swimming, walking in beautiful forests and country skiing in winter.\nBojarski began his Ph.D. studies at Moscow State University with\nDmitrii Evgenevich Menshov\nas his advisor. He said in the interview\n[\n1\n]\n:-\nMenshov\nwas a remarkable man and outstanding mathematician in real analysis and trigonometric series.\nDuring his first year in Moscow he attended\nMenshov\n's seminar on functions of a real variable which also involved\nNina Bari\n. He also attended seminars organised by\nIlya Nestorovich Vekua\non differential equations,\nNikolai Vladimirovich Efimov\non geometry and\nSergey Borisovich Stechkin\nwho worked on trigonometric series.\nFor Bojarski's description of working with\nMenshov\nand attending his seminar, see\nTHIS LINK\n.\nAfter undertaking research for a year, Bojarski decided he would like to change the topic he was working on. After discussions first with\nMenshov\nand then with\nKolmogorov\n, he changed to work with the Differential Equations group where his thesis advisor was\nIlya Nestorovich Vekua\n. He said\n[\n1\n]\n:-\nI was very glad, because it soon turned out that the decision was very good for me. With my background in real and complex analysis I quickly started to learn singular integral equations and related boundary value problems. I learned also about quasi-conformal mappings theory and the related\nBeltrami\nequation. It turned out that my studies under\nIlya Vekua\nwere very fruitful and continued for over two decades.\nIn\n1955\nBojarski submitted his thesis\nHomeomorphic Solutions of Beltrami Systems\n(\nRussian\n)\n. He published three papers in\n1955\n, one with the same title as his thesis and the other two being\nOn solutions of a linear elliptic system of differential equations in the plane\n(\nRussian\n)\nand\nOn a boundary problem for a system of elliptic first-order partial differential equations\n(\nRussian\n)\n.\nAfter the award of his candidate's degree, equivalent to a Ph.D., Bojarski returned to the University of Łódz for a short period. He returned to Moscow in\n1956\nwhere he worked at the University and at the\nV A Steklov\nInstitute of Mathematics until\n1959\n. In the winter of\n1957\nor\n1958\n[\n1\n]\n:-\nAndrey Kolmogorov\n, myself and four other young Polish mathematicians, my friends, we spent a week in the Tatra, high in the mountains, in Zakopane and around. The conditions were very hard: winter, frost, intensive snow falls, isolation. For a few days we were staying in a lonely hut high in a mountain valley, with nobody around, except us and an old woman, helping us with some food.\nKolmogorov\nwas sharing with us all the hardships of his life in these austere conditions. But there was always also some \"scientific\" component: in the evenings, after skiing or walking, or during meals or tea hours\n(\nnot much, but also some wine\n)\nwe also talked about mathematics. He was telling us about the theorems and concepts which he conceived or understood in his thoughts in the time between. And he was very proud of it, with the joy of a young man! Our impressions and what we all learned from\nKolmogorov\nduring those Tatra days are unforgettable for all our life.\nBojarski received the\nPolish Mathematical Society\n's Award for Young Mathematicians in\n1957\n. In\n1959\nhe received his habilitation from the\nV A Steklov\nInstitute of Mathematics in Moscow, spent some time at the Jagiellonian University in Krakow, then\nStanisław Mazur\n, the director of the Institute of Mathematics at the University of Warsaw, arranged for him to be appointed as a docent at the University of Warsaw.\nMazur\nhelped Bojarski, who was married by this time to Grazyna, find an apartment in Warsaw.\nBojarski's papers published between\n1955\nand\n1959\nwere outstanding. Paweł Strzelecki writes\n[\n9\n]\n:-\nIn the middle of the winter of\n1985\n-\n86\n, I read ... Bojarski's original works from the years\n1955\n-\n57\n. With crystal clarity I understood then that Bojarski did beautiful and completely innovative things in mathematics, things that fully justify\nHardy\n's phrase about what will be remembered someday. Bojarski's proof of the theorem on the existence and uniqueness of homeomorphic solutions of the\nBeltrami\nequation is short and clear, uses the latest achievements of mathematics at that time, has in the background geometry, complex and harmonic analysis, topology, and even a pinch of algebra, and above all ... that familiar feeling of how beautiful and simple it is.\n[\nI was\n]\nfull of respect and admiration ...\nThe authors of\n[\n3\n]\nwrite:-\nFrom the end of the\n1950\ns, Georgia\n(\nthen a Soviet republic\n)\nattracted Bogdan Bojarski not only for the great achievements of Georgian mathematicians. Up to early\n1960\ns, Bojarski visited his supervisor\nVekua\nin Tbilisi and presented an impressive talk on the stability of partial indices of the boundary value problem at the famous\nNikoloz Muskhelishvili\nseminar. He kept friendly contacts with Georgian mathematicians ... His favourite toast in a circle of friends was the dialog between two of them: \"Do you know Lenin?\" The answer was \"No\". \"Do you know Stalin?\" - \"No. But I do know Givi, Saba and have many other good friends\". Next, Bogdan would suggest drinking to the friends who we really know and who support each other.\nIn\n1962\n-\n63\n, Bojarski spent three semesters in the United States. He spent this time mostly at the\nCourant\nInstitute in New York, but also made short visits to Stanford University and the University of Chicago. In\n1963\nhe received the\nStefan Banach\nPrize from the\nPolish Mathematical Society\n. This prize had been awarded since\n1946\n, the first recipients being\nHugo Steinhaus\nand\nWacław Sierpiński\n. In\n1966\nhe was elected as a member of the\nPolish Mathematical Society\n. On\n9\nFebruary\n1968\nhe received the title of professor of mathematical sciences. In\n1969\nBojarski replaced\nStanisław Mazur\nas the director of the Institute of Mathematics of the University of Warsaw. He would continued to hold this position until\n1981\n.\nIn\n1973\nhe became a corresponding member of the\nPolish Academy of Sciences\n, becoming a full member in\n1986\n. It was during the\n1980\ns that Paweł Strzelecki began attending his lectures. He writes in\n[\n11\n]\n:-\nI remember the first time I met him. On the first Wednesday of October\n1984\n, at about\n8\n:\n30\nin the morning, Bogdan Bojarski entered one of the corner rooms on the seventh floor of the Palace of Culture, where a dozen or so male and female students of the then third year of the theoretical mathematics section at the University of Warsaw were waiting. He had a nondescript, grey-beige jacket, a worn and capacious leather briefcase, and glasses. He took a stack of papers out of the briefcase, definitely thicker than the notes needed for an hour and a half lecture, silently, thoughtfully, clearing his throat slightly, spread them out on the desk. And then he started talking.\nHis lecture was completely different from what we had experienced during the first two years of studies. Firstly, because in partial differential equations, the possibility of enjoying the beauty of a proof or a specific result usually requires breaking through a thicker layer of calculations than in many other parts of mathematics. Secondly, probably more importantly, because of Bojarski himself. His lectures were dominated by deep, anecdotal chaos. The inscriptions and calculations were rarely accompanied by clearly emphasised words such as definition, lemma, theorem, proof, organising the students' notes and attempts at thinking. He rarely erased the blackboard - when he ran out of space, he erased small windows in the thicket of inscriptions, wrote with different colours of chalk, sometimes between the lines. I don't think any of my lecturers at the University has ever heard so many silent, terrified sighs from the audience, such rolling of dejected eyes.\nBojarski, in a very paternalistic and suggestive way, was essentially telling us one thing throughout the entire semester - look, this is interesting, beautiful and important, and at the same time it can be so simple ... if only you put some effort into understanding it in your own way.\nAt first the reader of this quote might think that this is a description of an outstanding researcher who did not know how to lecture to undergraduates. This, however, would be quite wrong. Bojarski was a firm believer that a student would not understand mathematics by listening to a beautifully constructed lecture explaining how to do it. Rather the student would only understand mathematics if they worked out the details for themselves. What Bojarski tried to convey was an enthusiasm for doing mathematics and making students want to find proofs for themselves. He must have been very successful in this because many students attending his undergraduate lectures wanted to become researchers and, moreover, they wanted Bojarski to be their thesis advisor. The\nMathematics Genealogy Project\nlists\n20\nstudents who obtained a Ph.D. from the University of Warsaw or from the Institute of Mathematics of the Polish Academy of Sciences advised by Bojarski. The list, however, is incomplete, for example Krzysztof P Wojciechowski\n(1953\n-\n2008)\nis missing. See\n[\n12\n]\nfor the names of these students and the titles of their thesis. Many of these students are university professors who have themselves advised over\n60\nPhD. students.\nTadeusz Iwaniec\n, one of Bojarski's students, wrote\n[\n5\n]\n:-\nI consider myself lucky and proud to be Professor Bogdan Bojarski's former student. He never tutored me to become a routine mathematician, but prepared me to become an independent scholar. More importantly, he always believed in me and made me feel successful. I thank him for this. ... Bojarski's goal was not only to do research but also to serve the Department of Mathematics and the greater mathematical community. He became visible rather early as a gifted leader of the mathematical life at the University of Warsaw and\nPolish Academy of Sciences\n. Leadership was required from him and yet, in my personal experience, his passion and commitment to working with young scholars did not end. Passing knowledge and helping the young to achieve their own career is a thing that I have learnt from Professor Bojarski; nowadays it turns out well in my own interaction with young scholars from the United States, Italy, Finland and other countries. I think that unselfish devotion to the next generation is the noble duty and the highest responsibility every scientist should accept.\nIn\n1978\nCzesław Olech\n, the director of the Institute of Mathematical Sciences of the\nPolish Academy of Sciences\nand a leading expert in differential equations, was asked to express an opinion \"on granting Bogdan Bojarski the academic title of full professor\". He wrote\n(\nsee, for example,\n[\n9\n]\n)\n:-\nBogdan Bojarski is the author of works that have become a permanent part of the world of mathematics. ... In the Polish mathematical community, the position and role of Prof Bojarski is exceptional. The formal expression of this is his function as Director of the Institute of Mathematics of the University of Warsaw, Secretary, and currently Chairman of the Committee of Mathematics of the\nPolish Academy of Sciences\n, and many others. However, the actual reason for this opinion is that Professor Bojarski's interests in mathematics go beyond the scope of his personal research, that he is deeply involved in the general issues of Polish mathematics, that he is an exceptionally sensitive scientist, teacher, and educator.\nAfter being director of the Institute of Mathematics of the University of Warsaw from\n1969\nto\n1981\n, Bojarski was director of the Institute of Mathematics of the\nPolish Academy of Sciences\nfrom\n1986\nto\n2002\n. The\nBanach\nCentre had been set up by the Institute of Mathematics of the\nPolish Academy of Sciences\nin\n1972\nand\nCzesław Olech\nserved as its director for\n20\nyears from\n1972\nto\n1992\n[\n4\n]\n:-\nUnder the leadership of Prof\nCzesław Olech\n, the\nBanach\nCentre gained international recognition as a centre for mathematical cooperation, hosting mathematicians from all over the world. Prof Bogdan Bojarski took over as director in\n1993\nafter the termination of the original agreement between the Academies of Sciences. A new era of cooperation began, especially with the\nEuropean Mathematical Society\n. New forms of activity were introduced, such as condensed workshops, symposia and interdisciplinary meetings, as well as thematic semesters.\nBojarski served as director of the\nBanach\nCentre until\n2002\n. In\n2000\nhe became a corresponding member of the Polish Academy of Arts and Sciences, and in\n2004\na member of the European Academy of Sciences.\nPaweł Strzelecki writes about Bojarski's research contributions in\n[\n11\n]\n:-\nWhen I look at Bojarski's achievements and the fates of his students, I find numerous confirmations of\nCzesław Olech\n's above assessment. Bojarski's achievements include not only works devoted to the\nBeltrami\nequation and the theory of quasiconformal transformations\n(\non the plane and in higher dimensions\n)\n, but also later works on the theory of\nSobolev\nspaces, and finally works on global analysis, devoted to the neighbourhoods of the index theorem. Bojarski was a witness and participant in the emergence of one of the most important and profound areas of contemporary mathematics, where analysis and differential equations are applied in a global situation and find connections with geometry, topological, and algebraic properties of manifolds.\nThe authors of\n[\n3\n]\nlook in detail at Bojarski's impressive research papers. We give a short\n(\nedited\n)\nextract from their Conclusions:-\nIn general, he suggested rewriting the theory of generalised analytic functions in an invariant form. Bogdan Bojarski thought that this approach could be interesting not only in pure mathematics but could help us to understand the problems of modern theoretical physics. He named this conception 'Complex Geometry of the Real World'. When Bojarski was young his mind was occupied with the topological invariance of index. This led him to the famous\nAtiyah\n-\nSinger\nindex theorem. Bojarski's thoughts on this question were published in the paper 'On the index problem for systems of singular integral equations'\n(1965)\n. The scalar\nRiemann\n-\nHilbert\nproblem for a multiply connected domain was solved\n40\nyears after his seminal results in 'On generalised Hilbert boundary value'\n(\nRussian\n)\n(1960)\nand his Supplement to\nVekua\n's 'Generalised Analytic Functions'\n(1962)\n. These results of Bojarski were the basis of the complete solution given in\n2018\n. Although Bojarski did not address engineering problems directly, the boundary value problems considered by him have applications in continuum mechanics.\nIn addition to the awards from the\nPolish Mathematical Society\nmentioned above, he was awarded the Knight's Cross of the Order of Polonia Restituta in\n1974\n, and the Commander's Cross with Star of the Order of Polonia Restituta in\n1999\n. In\n2011\nhe received an honorary doctorate from the State University in Tbilisi, Georgia.\nHe died on\n22\nDecember\n2018\n(\nunfortunately the year of his death is wrongly given as\n2019\non his tombstone\n)\n. His funeral took place on\n10\nJanuary\n2019\nat the Military Cemetery in Warsaw's Powązki Cemetery.",
  "matematicos_citados_na_biografia": [
    "Arthur Eddington",
    "Stefan Mazurkiewicz",
    "Banach",
    "Tadeusz Ważewski",
    "Edmund Landau",
    "Dedekind",
    "Andrey Kolmogorov",
    "Kolmogorov",
    "Dmitrii Evgenevich Menshov",
    "Menshov",
    "Nina Bari",
    "Ilya Nestorovich Vekua",
    "Nikolai Vladimirovich Efimov",
    "Sergey Borisovich Stechkin",
    "THIS LINK",
    "Beltrami",
    "Ilya Vekua",
    "V A Steklov",
    "Polish Mathematical Society",
    "Stanisław Mazur",
    "Mazur",
    "Hardy",
    "Vekua",
    "Nikoloz Muskhelishvili",
    "Courant",
    "Stefan Banach",
    "Hugo Steinhaus",
    "Wacław Sierpiński",
    "Polish Academy of Sciences",
    "Tadeusz Iwaniec",
    "Czesław Olech",
    "European Mathematical Society",
    "Sobolev",
    "Atiyah",
    "Singer",
    "Riemann",
    "Hilbert"
  ],
  "imagens": [
    "bojarski.jpg"
  ]
}