{
  "nome_completo": "Børge Christian Jessen",
  "nome_curto": "Børge Jessen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jessen/",
  "data_nascimento": "19 June 1907",
  "local_nascimento": "Copenhagen, Denmark",
  "data_morte": "20 March 1993",
  "local_morte": "Copenhagen, Denmark",
  "summary": "Børge Jessen was a Danish mathematician best known for his work in analysis and in geometry.",
  "biografia": "Børge Jessen\n's parents were Hans Jessen\n(1865\n-\n1935)\n, a business manager, and Christine Vilhelmine Larsen\n(1875\n-\n1959)\n. Børge was the youngest of his parents' five children, namely: Sten Jørgen Jessen\n(1900\n-\n1981)\n; Inger Jessen\n(1902\n-\n1990)\n(\nwho married Alfred Johannes Rosenkrantz\n)\n; Bjørn Jessen\n(1903\n-\n1943)\n; Gert Andreas Jessen\n(1905\n-\n1971)\n; and Børge Christian Jessen\n(1907\n-\n1993)\n, the subject of this biography.\nJessen became fascinated by mathematics while at school in Copenhagen. He had two excellent teachers, Mrs Teilman and Julius Pál. He was taught by Pál in his first year at the Sankt Jørgens Gymnasium in Frederiksberg, Copenhagen. This school, founded in\n1858\n, had undergone a number of changes of name. It was called Henrik Madsens Skole from\n1904\nto\n1919\nwhen it became a state school called Sankt Jørgens Gymnasium. Julius Pál\n(1881\n-\n1946)\nwas a Hungarian who was born into a Jewish family and originally named Gyula Perl. He modified his name to a more Hungarian version in\n1909\n. He fled from the post-war problems of Hungary in\n1919\n, coming to Copenhagen as a teacher at the Sankt Jørgens Gymnasium. He was a friend of\nHarald Bohr\nand later became his assistant. He did excellent work on\nJordan\ncurves and the Kakeya problem. Jessen writes in\n[\n6\n]\n:-\n[\nI\n]\nfeel a great debt of gratitude toward him.\nCertainly Pal\n(\nhe dropped the accent on the \"a\" when he moved to Denmark\n)\nwas a demanding teacher who suggested to Jessen that he read the recently published four volume work on mathematical analysis\nLaerebog i matematisk analyse\nⓉ\n(\nTextbook of mathematical analysis\n)\nby\nHarald Bohr\nand Johannes Mollerup. This was a demanding task for a school pupil but Jessen had mastered large parts of this work before he graduated from the Sankt Jørgens Gymnasium in\n1925\n. Later in\n1925\nhe entered the University of Copenhagen where he aimed at specialising in mathematics but also took courses on physics, chemistry and astronomy.\nHaving studied\nLaerebog i matematisk analyse\nⓉ\n(\nTextbook of mathematical analysis\n)\n, Jessen knew most of the material offered for first year students, so he only took the mathematics courses by Johannes Hjelmslev\n(1873\n-\n1950)\nin geometry and by\nJakob Nielsen\nin rational mechanics. He went on to take a course by\nJakob Nielsen\non topology and courses by\nHarald Bohr\non number theory and complex analysis. By\n1929\n, when he was in the fourth year of his university studies, he had already seven papers in print\n(\nfive in Danish and two in German\n)\n:\nLøsning til Opgave\n14\n. Aarg.\n1926\nⓉ\n(\nSolution to Question\n14\n. Aug.\n1926\n)\n(1926)\n;\nTo Trekantsætninger\nⓉ\n(\nTwo triangular theorems\n)\n(1926)\n;\nBemaerkning om den Eulerske Polyedersaetning\nⓉ\n(\nNote on the Eulerian polyhedral phrase\n)\n(1928)\n;\nOm Delingslighed for maalelige Punktmængder\nⓉ\n(\nOn divisibility of measurable point quantities\n)\n(1929)\n;\nOm konvekse Kurvers Krumning\nⓉ\n(\nOn convex curvature\n)\n(1929)\n;\nÜber konvexe Punktmengen konstanter Breite\nⓉ\n(\nOn convex point sets of constant width\n)\n(1929)\n; and\nÜber monotone Funktionen\nⓉ\n(\nOn monotonous functions\n)\n(1929)\n. He had also read books by\nRené-Louis Baire\n,\nConstantin Carathéodory\n,\nHenri Lebesgue\n, and\nCharles de la Vallée Poussin\n. His progress had been so outstanding that\nHarald Bohr\nasked him to collaborate on joint work on the\nRiemann\nzeta-function which led to their joint paper\nOm Sandsynlighedsfordelinger ved Addition af konvekse Kurver\nⓉ\n(\nOn probability distributions by addition of convex curves\n)\n(1929)\n. Jessen wrote a Master's thesis\n(\nequivalent to a Ph.D.\n)\non the theory of almost periodic functions\n(\na topic which\nHarald Bohr\nhad initiated a few years earlier with three long papers\n)\nand graduated on\n22\nJune\n1929\n. Bernard Bru and Salah Eid write in\n[\n3\n]\n:-\nHe was invited to make a presentation to the seventh Congress of Scandinavian Mathematicians, held in Oslo from\n19\nto\n22\nAugust\n1929\n. Jessen presented his theory of integration in German and in a particularly clear way, a very nice exposition with a reproduction of\nHilbert\n's space-filling curve as it appeared in the original article of\n1891\n, which shows at first glance that measure is preserved, the curve preserving throughout construction a perfect symmetry between the two axes. Jessen did not state his two theorems which he undoubtedly considered marginal, but announced a\nFourier\ntheory for functions with a countable infinity of periods. The transactions of the congress were published in\n1930\n, so that at the proof stage Jessen could add a reference to\nDaniell\nof whom he had been informed meanwhile.\nA grant from the Carlsberg Foundation allowed Jessen to spend two months in Szeged, Hungary, later in\n1929\n, where he had lengthy discussions with\nFrigyes Riesz\n,\nAlfréd Haar\nand\nLipót Fejér\n. Moving to Göttingen for the academic year\n1929\n-\n30\n, he attended courses by\nDavid Hilbert\nand\nEdmund Landau\n. He submitted his\n3\n-part\n76\n-page doctoral thesis\nBidrag til Integralteorien for Funktioner af uendelig mange Variable\nⓉ\n(\nContribution to the integral theory for functions of infinitly many variables\n)\nto the University of Copenhagen and returned there to defend his thesis on\n1\nMay\n1930\n. This thesis\n(\nequivalent to an habilitation thesis\n)\nwas simply an improved version of the final chapter of his Master's thesis. An English version of the thesis, containing further developments of his results, was published in\nActa Mathematica\nin\n1934\nas a\n75\n-page paper with the title\nThe Theory of Integration in a Space of an Infinite Number of Dimensions\n.\nAfter a short trip to Paris, Jessen was appointed as a\ndocent\nat the Royal Veterinary and Agricultural School in Copenhagen in the autumn of\n1930\n. On\n29\nJanuary\n1931\nhe married Ellen Margrethe Charlotte Pedersen\n(21\nMay\n1903\n-\n29\nDecember\n1979)\nin Solbjerg Church in the Frederiksberg district of Copenhagen. Ellen Pedersen had trained as a mathematician and was the daughter of Peder Oluf Pedersen\n(1874\n-\n1941)\nand Maria Theodora Lihme\n(1871\n-\n1930)\n. P O Pedersen was an engineer and physicist who was rector of Den Polytekniske Læreanstalt\n(\nnow the Technical University of Denmark\n)\n.\nJessen was able to spend from April\n1933\nto June\n1934\non research leave funded by the Rockefeller Foundation. He went first to Cambridge, England, where he met\nG H Hardy\n,\nA S Besicovitch\n,\nL C Young\n, and\nGarrett Birkhoff\n(\nwho was in Cambridge working with\nPhilip Hall\non group theory\n)\n. On\n23\nSeptember\n1933\nJessen and his wife sailed from Southampton, England, to New York, USA, on the Cunard ship\nBerengaria\n. They arrived on\n29\nSeptember and went to the Institute for Advanced Study in Princeton. While at the Institute for Advanced Study he collaborated with\nSalomon Bochner\nand\nAurel Wintner\nleading to two joint papers\n(\none with each\n)\n[\n3\n]\n:-\nIn Princeton Jessen met\nAurel Wintner\n. Two more different mathematicians can hardly be imagined. Jessen was elegant, reserved, rigorous, scrupulous,\nWintner\nwas impassioned, a compulsive eater, overflowing with projects and works in progress, all done with great noise.\nWintner\nwas always interested in celestial mechanics and accordingly in almost periodic functions. For some time he had been studying the limiting laws of series of independent random variables of the type considered by\nSteinhaus\n, Jessen and others, what was called at the time the problem of infinite convolutions, on the line or in a finite-dimensional space.\nWintner\nhad obtained interesting results on the subject, which was one that Jessen had also come near to either alone or with\nHarald Bohr\n. Sometime in\n1934\n, probably in the spring, Jessen and\nWintner\ndecided to pool their experience and write an article \"Distribution functions and the Riemann zeta function\" ...\nWhile based at Princeton, Jessen also visited Harvard University, Yale University and Brown University. On\n4\nJune\n1934\nhe visited the Niagara Falls, crossing into Canada at that time.  On\n23\nJuly\n1934\n, along with his wife, he sailed on the Cunard ship\nGeorgic\nback to England, arriving in Liverpool. They were back in Denmark in time for Jessen to attend the\n8\nth Scandinavian Congress of Mathematicians in Stockholm\n14\n-\n18\nAugust\n1934\n.\nA happy event in\n1934\nbecame a tragedy; Christian Berg writes\n[\n2\n]\n:-\nBørge and Ellen had a son, Lars in\n1934\n, but tragically the boy became ill of meningitis at the age of two and was disabled.\nOn\n1\nJune\n1935\nJessen was appointed as Professor of Geometry at the Technical University of Denmark in Copenhagen. This had been Den Polytekniske Læreanstalt, but was known as Danmarks tekniske Højskole from\n1933\n. It had been founded in\n1829\nand modelled on the École Polytechnique in Paris. Johannes Hjelmslev, the professor at the University of Copenhagen, was due to retire in\n1940\nand Jessen applied to be his successor. In fact Jessen was the only applicant for the professorship. On\n9\nApril\n1940\n, however, German forces entered Denmark despite the country having declared itself neutral. The Danish government quickly surrendered but Denmark was not occupied by German troops at that time and the government remained in office becoming a Protectorate Government. At this point Jessen withdrew his application for Hjelmslev's professorship and Hjelmslev was persuaded to remain in post until the end of August\n1942\n. When Hjelmslev finally retired in\n1942\n, Jessen again applied for the position once more being the only applicant. Berg suggests in\n[\n2\n]\nthat the reason he was the only applicant was:-\n... probably because the other potential Danish applicants knew that they could not compete with him.\nIn\n1948\nJessen became head of the Department of Mathematics, a position he continued to hold until\n1967\n. During this time he played a major role in planning the H C Ørsted Institute which opened in\n1963\nto house mathematics, physics and chemistry.\nHe became more involved in administration following his election to the board of the Carlsberg Foundation in\n1950\n. He had already been elected to the\nRoyal Danish Academy of Sciences and Letters\nas early as\n1939\n. It was his role on the Carlsberg Foundation which gave him heavy duties, particularly from\n1955\nto\n1963\nwhen he served as chairman. This left him little time for research and indeed, between\n1952\nand\n1967\nhis only research publication was\nSome aspects of the theory of almost periodic functions\n, a paper in the\nProceedings of the International Congress of Mathematicians, Amsterdam,\n1954\nwhich was published in\n1957\n. Jessen also played a major role in the\nDanish Mathematical Society\n, being its secretary from\n1930\nto\n1942\n, serving on the board from\n1952\nto\n1958\n, the last four of these years as President of the Society. He also did editorial work, being editor of\nMatematisk Tidsskrift B\nⓉ\n(\nMathematics Journal B\n)\nfrom\n1935\nto\n1949\nand on the editorial board of\nActa Mathematica\nfrom\n1948\nto\n1988\n.\nThe International Congress of Mathematicians was held in Edinburgh, Scotland, in\n1958\n. Jessen addressed the Closing Session of the Congress. See\nTHIS LINK\n.\nChristian Berg was a student at the University of Copenhagen in the\n1960\ns. He tells us with first hand detail about Jessen as a teacher\n[\n2\n]\n:-\nIn\n1960\nthe curriculum in mathematics was changed, and Jessen taught the second year analysis course. It comprised the basic knowledge about\nFourier\nseries,\nLebesgue\nintegration and complex analysis, but Jessen also liked to include basic results like\nWeierstrass\n' approximation theorem,\nPeano\n's curve and\nWeierstrass\n' nowhere differentiable continuous function. The lectures were very well prepared, and the blackboard was used in an efficient way, from the upper left corner to the lower right corner. Complicated drawings were often made beforehand and hidden behind another blackboard, and already written formulas were modified with coloured chalk to save writing. It was an aesthetic experience to attend Jessen's lectures. The essential points were made clear, and after the lecture one had the impression that everything was easy and elegant. Jessen enjoyed including small anecdotes about the mathematicians behind a theorem, and he often circulated books from the library during the lectures, so we could look at a portrait of a famous mathematician or at a classical mathematical paper. When lecturing about\nJensen\n's inequality in convexity, he said jokingly that there were two mathematicians with the name of Jensen - the famous telephone engineer behind the formula, and himself when his name was misspelled. About\nWintner\nhe told us that his name was used for a physical unit: \"One\nWintner\nmeant\n100\ncigarettes a day\". Due to the increased number of students in the\n1960\ns a new system involving teaching assistants was introduced with success. Two teaching assistants per class were chosen among the second year students and appointed as \"fellow instructors\". They had to learn the material at the same time as they helped their fellow students. On Saturday morning Jessen met with the fellow instructors and prepared them for the material to be covered in the lectures and exercises for the following week. I had the privilege of being such a fellow instructor and learned a lot because Jessen could not refrain from telling us many extra things. He also told us that he used to throw away the solutions of the exercises when the year was over, so that he had to rediscover the solutions every year. In this way, he was reminded about the difficulties of the exercises. At the final exam Jessen was always very favourable towards the students. He liked to cite\nHarald Bohr\nfor having said that one should always give students a final grade that is a little higher than what they could expect. In that way they would always remember their years of study with joy. In addition to his teaching for the first or second year students, Jessen also gave courses for the students preparing for the Master's Degree. The lectures I followed were supported by handwritten notes of high quality distributed to the students. He liked to take up classical subjects such as conformal mapping, the Gamma function and the prime number theorem, where he could set a goal of obtaining a key result at the end.\nJessen retired in\n1977\n, giving the lecture\n[\n6\n]\n(\nFrom my years of learning\n)\nat a celebration in his honour held by the Department of Mathematics at the University of Copenhagen. His last years were tragic ones, for his wife Ellen died in\n1979\nand he became disabled due to Parkinson's. His eyesight and hearing both deteriorated and he suffered a further heavy blow when his son Lars died in\n1990\n. He then left his apartment in central Copenhagen and spent his final years in a rest home. He asked Christian Berg to find a good home for his extensive mathematical library which was mainly donated to Aalborg University.",
  "matematicos_citados_na_biografia": [
    "Harald Bohr",
    "Jordan",
    "Jakob Nielsen",
    "René-Louis Baire",
    "Constantin Carathéodory",
    "Henri Lebesgue",
    "Charles de la Vallée Poussin",
    "Riemann",
    "Hilbert",
    "Fourier",
    "Daniell",
    "Frigyes Riesz",
    "Alfréd Haar",
    "Lipót Fejér",
    "David Hilbert",
    "Edmund Landau",
    "docent",
    "G H Hardy",
    "A S Besicovitch",
    "L C Young",
    "Garrett Birkhoff",
    "Philip Hall",
    "Salomon Bochner",
    "Aurel Wintner",
    "Wintner",
    "Steinhaus",
    "Royal Danish Academy of Sciences and Letters",
    "Danish Mathematical Society",
    "THIS LINK",
    "Lebesgue",
    "Weierstrass",
    "Peano",
    "Jensen"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}