{
  "nome_completo": "Brahmagupta",
  "nome_curto": "Brahmagupta",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brahmagupta/",
  "data_nascimento": "598",
  "local_nascimento": "(possibly) Ujjain, India",
  "data_morte": "670",
  "local_morte": "India",
  "summary": "Brahmagupta was the foremost Indian mathematician of his time. He made advances in astronomy and most importantly in number systems including algorithms for square roots and the solution of quadratic equations.",
  "biografia": "Brahmagupta,\nwhose father was Jisnugupta, wrote important works on mathematics and astronomy. In particular he wrote\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\n, in\n628\n. The work was written in\n25\nchapters and Brahmagupta tells us in the text that he wrote it at Bhillamala which today is the city of Bhinmal. This was the capital of the lands ruled by the Gurjara dynasty.\nBrahmagupta became the head of the astronomical observatory at Ujjain which was the foremost mathematical centre of ancient India at this time. Outstanding mathematicians such as\nVarahamihira\nhad worked there and built up a strong school of mathematical astronomy.\nIn addition to the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nBrahmagupta wrote a second work on mathematics and astronomy which is the\nKhandakhadyaka\nⓉ\n(\n'edible bite' or 'morsel of food'\n)\nwritten in\n665\nwhen he was\n67\nyears old. We look below at some of the remarkable ideas which Brahmagupta's two treatises contain. First let us give an overview of their contents.\nThe\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\ncontains twenty-five chapters but the first ten of these chapters seem to form what many historians believe was a first version of Brahmagupta's work and some manuscripts exist which contain only these chapters. These ten chapters are arranged in topics which are typical of Indian mathematical astronomy texts of the period. The topics covered are: mean longitudes of the planets; true longitudes of the planets; the three problems of diurnal rotation; lunar eclipses; solar eclipses; risings and settings; the moon's crescent; the moon's shadow;\nconjunctions\nof the planets with each other; and conjunctions of the planets with the fixed stars.\nThe remaining fifteen chapters seem to form a second work which is major addendum to the original treatise. The chapters are: examination of previous treatises on astronomy; on mathematics; additions to chapter\n1\n; additions to chapter\n2\n; additions to chapter\n3\n; additions to chapter\n4\nand\n5\n; additions to chapter\n7\n; on algebra; on the gnomon; on meters; on the sphere; on instruments; summary of contents; versified tables.\nBrahmagupta's understanding of the number systems went far beyond that of others of the period. In the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nhe defined zero as the result of subtracting a number from itself. He gave some properties as follows:-\nWhen zero is added to a number or subtracted from a number, the number remains unchanged; and a number multiplied by zero becomes zero.\nHe also gives arithmetical rules in terms of fortunes\n(\npositive numbers\n)\nand debts\n(\nnegative numbers\n)\n:-\nA debt minus zero is a debt.\nA fortune minus zero is a fortune.\nZero minus zero is a zero.\nA debt subtracted from zero is a fortune.\nA fortune subtracted from zero is a debt.\nThe product of zero multiplied by a debt or fortune is zero.\nThe product of zero multipliedby zero is zero.\nThe product or quotient of two fortunes is one fortune.\nThe product or quotient of two debts is one fortune.\nThe product or quotient of a debt and a fortune is a debt.\nThe product or quotient of a fortune and a debt is a debt.\nBrahmagupta then tried to extend arithmetic to include division by zero:-\nPositive or negative numbers when divided by zero is a fraction the zero as denominator.\nZero divided by negative or positive numbers is either zero or is expressed as a fraction with zero as numerator and the finite quantity as denominator.\nZero divided by zero is zero.\nReally Brahmagupta is saying very little when he suggests that\nn\nn\nn\ndivided by zero is\nn\n/\n0\nn/0\nn\n/\n0\n. He is certainly wrong when he then claims that zero divided by zero is zero. However it is a brilliant attempt to extend arithmetic to negative numbers and zero.\nWe can also describe his methods of multiplication which use the place-value system to its full advantage in almost the same way as it is used today. We give three examples of the methods he presents in the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nand in doing so we follow Ifrah in\n[\n4\n]\n. The first method we describe is called \"gomutrika\" by Brahmagupta. Ifrah translates \"gomutrika\" to \"like the trajectory of a cow's urine\". Consider the product of\n235\nmultiplied by\n264\n. We begin by setting out the sum as follows:\n2 235\n6 235\n4 235\n----------\nNow multiply the\n235\nof the top row by the\n2\nin the top position of the left hand column. Begin by\n2\n×\n5\n=\n10\n, putting\n0\nbelow the\n5\nof the top row, carrying\n1\nin the usual way to get\n2 235\n6 235\n4 235\n----------\n 470\nNow multiply the\n235\nof the second row by the\n6\nin the left hand column writing the number in the line below the\n470\nbut moved one place to the right\n2 235\n6 235\n4 235\n----------\n 470\n 1410\nNow multiply the\n235\nof the third row by the\n4\nin the left hand column writing the number in the line below the\n1410\nbut moved one place to the right\n2 235\n6 235\n4 235\n----------\n 470\n 1410\n 940\nNow add the three numbers below the line\n2 235\n6 235\n4 235\n----------\n 470\n 1410\n 940\n----------\n 62040\nThe variants are first writing the second number on the right but with the order of the digits reversed as follows\n235 4\n 235 6\n 235 2\n----------\n 940\n 1410\n 470\n----------\n 62040\nThe third variant just writes each number once but otherwise follows the second method\n235\n----------\n 940 4\n 1410 6\n 470 2\n----------\n 62040\nAnother arithmetical result presented by Brahmagupta is his algorithm for computing square roots. This algorithm is discussed in\n[\n15\n]\nwhere it is shown to be equivalent to the\nNewton\n-\nRaphson\niterative formula.\nBrahmagupta developed some algebraic notation and presents methods to solve quardatic equations. He presents methods to solve indeterminate equations of the form\na\nx\n+\nc\n=\nb\ny\nax + c = by\na\nx\n+\nc\n=\nb\ny\n. Majumdar in\n[\n17\n]\nwrites:-\nBrahmagupta perhaps used the method of continued fractions to find the integral solution of an indeterminate equation of the type\na\nx\n+\nc\n=\nb\ny\nax + c = by\na\nx\n+\nc\n=\nb\ny\n.\nIn\n[\n17\n]\nMajumdar gives the original Sanskrit verses from Brahmagupta's\nBrahmasphuta siddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nand their English translation with modern interpretation.\nBrahmagupta also solves\nquadratic indeterminate equations\nof the type\na\nx\n2\n+\nc\n=\ny\n2\nax^{2} + c = y^{2}\na\nx\n2\n+\nc\n=\ny\n2\nand\na\nx\n2\n−\nc\n=\ny\n2\nax^{2} - c = y^{2}\na\nx\n2\n−\nc\n=\ny\n2\n. For example he solves\n8\nx\n2\n+\n1\n=\ny\n2\n8x^{2} + 1 = y^{2}\n8\nx\n2\n+\n1\n=\ny\n2\nobtaining the solutions\n(\nx\n,\ny\n)\n=\n(\n1\n,\n3\n)\n,\n(\n6\n,\n17\n)\n,\n(\n35\n,\n99\n)\n,\n(\n204\n,\n577\n)\n,\n(\n1189\n,\n3363\n)\n,\n.\n.\n.\n(x, y) = (1, 3), (6, 17), (35, 99), (204, 577), (1189, 3363), ...\n(\nx\n,\ny\n)\n=\n(\n1\n,\n3\n)\n,\n(\n6\n,\n1\n7\n)\n,\n(\n3\n5\n,\n9\n9\n)\n,\n(\n2\n0\n4\n,\n5\n7\n7\n)\n,\n(\n1\n1\n8\n9\n,\n3\n3\n6\n3\n)\n,\n.\n.\n.\nFor the equation\n11\nx\n2\n+\n1\n=\ny\n2\n11x^{2} + 1 = y^{2}\n1\n1\nx\n2\n+\n1\n=\ny\n2\nBrahmagupta obtained the solutions\n(\nx\n,\ny\n)\n=\n(\n3\n,\n10\n)\n,\n(\n161\n5\n,\n534\n5\n)\n,\n.\n.\n.\n(x, y) = (3, 10), (\\large\\frac{161}{5}\\normalsize , \\large\\frac{534}{5}\\normalsize ), ...\n(\nx\n,\ny\n)\n=\n(\n3\n,\n1\n0\n)\n,\n(\n5\n1\n6\n1\n​\n,\n5\n5\n3\n4\n​\n)\n,\n.\n.\n.\nHe also solves\n61\nx\n2\n+\n1\n=\ny\n2\n61x^{2} + 1 = y^{2}\n6\n1\nx\n2\n+\n1\n=\ny\n2\nwhich is particularly elegant having\nx\n=\n226153980\n,\ny\n=\n1766319049\nx = 226153980, y = 1766319049\nx\n=\n2\n2\n6\n1\n5\n3\n9\n8\n0\n,\ny\n=\n1\n7\n6\n6\n3\n1\n9\n0\n4\n9\nas its smallest solution.\nA example of the type of problems Brahmagupta poses and solves in the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nis the following:-\nFive hundred drammas were loaned at an unknown rate of interest, The interest on the money for four months was loaned to another at the same rate of interest and amounted in ten mounths to\n78\ndrammas. Give the rate of interest.\nRules for summing series are also given. Brahmagupta gives the sum of the squares of the first\nn\nn\nn\nnatural numbers as\n1\n6\nn\n(\nn\n+\n1\n)\n(\n2\nn\n+\n1\n)\n\\large\\frac{1}{6}\\normalsize n(n+1)(2n+1)\n6\n1\n​\nn\n(\nn\n+\n1\n)\n(\n2\nn\n+\n1\n)\nand the sum of the cubes of the first\nn\nn\nn\nnatural numbers as\n(\n1\n2\nn\n(\nn\n+\n1\n)\n)\n2\n(\\large\\frac{1}{2}\\normalsize n(n+1))^{2}\n(\n2\n1\n​\nn\n(\nn\n+\n1\n)\n)\n2\n. No proofs are given so we do not know how Brahmagupta discovered these formulae.\nIn the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\nBrahmagupta gave remarkable formulae for the area of a cyclic quadrilateral and for the lengths of the diagonals in terms of the sides. The only debatable point here is that Brahmagupta does not state that the formulae are only true for cyclic quadrilaterals so some historians claim it to be an error while others claim that he clearly meant the rules to apply only to cyclic quadrilaterals.\nMuch material in the\nBrahmasphutasiddhanta\nⓉ\n(\nCorrectly Established Doctrine of Brahma\n)\ndeals with solar and lunar eclipses, planetary conjunctions and positions of the planets. Brahmagupta believed in a static Earth and he gave the length of the year as\n365\ndays\n6\nhours\n5\nminutes\n19\nseconds in the first work, changing the value to\n365\ndays\n6\nhours\n12\nminutes\n36\nseconds in the second book the\nKhandakhadyaka\nⓉ\n(\n'edible bite' or 'morsel of food'\n)\n. This second values is not, of course, an improvement on the first since the true length of the years if less than\n365\ndays\n6\nhours. One has to wonder whether Brahmagupta's second value for the length of the year is taken from\nAryabhata I\nsince the two agree to within\n6\nseconds, yet are about\n24\nminutes out.\nThe\nKhandakhadyaka\nⓉ\n(\n'edible bite' or 'morsel of food'\n)\nis in eight chapters again covering topics such as: the longitudes of the planets; the three problems of diurnal rotation; lunar eclipses; solar eclipses; risings and settings; the moon's crescent; and conjunctions of the planets. It contains an appendix which is some versions has only one chapter, in other versions has three.\nOf particular interest to mathematics in this second work by Brahmagupta is the interpolation formula he uses to compute values of sines. This is studied in detail in\n[\n13\n]\nwhere it is shown to be a particular case up to second order of the more general\nNewton\n-\nStirling\ninterpolation formula.",
  "matematicos_citados_na_biografia": [
    "Varahamihira",
    "conjunctions",
    "Newton",
    "Raphson",
    "quadratic indeterminate equations",
    "Aryabhata I",
    "Stirling"
  ],
  "imagens": [
    "brahmagupta.jpg"
  ]
}