{
  "nome_completo": "Brian Griffiths",
  "nome_curto": "Brian Griffiths",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Griffiths_Brian/",
  "data_nascimento": "26 September 1927",
  "local_nascimento": "Horwich, Lancashire, England",
  "data_morte": "4 June 2008",
  "local_morte": "Southampton, England",
  "summary": "Brian Griffiths was a English mathematician who worked in topology and was a pioneer in the development of mathematical education.",
  "biografia": "Brian Griffiths\nattended Leigh grammar school, completing his school studies in\n1945\nand so just missing having to serve in World War II. He was an undergraduate at Manchester University where he studied mathematics and was awarded a B.Sc. He continued to undertake research at Manchester under the supervision of\nMax Newman\n. He was awarded an M.Sc. then in\n1952\na Ph.D. for his thesis\nLocal Topological Invariants\n. In his thesis he studied \"homotopy manifolds,\" homotopy analogues of the generalized manifolds which had earlier been investigated by\nRaymond Wilder\n. He published three papers based on the ideas in his thesis\nLocal topological invariants\n(1953)\n,\nA mapping theorem in \"local\" topology\n(1953)\n, and\nA contribution to the theory of manifolds\n(1954)\n.\nAfter the award of his doctorate, Griffiths was appointed to the University of Aberdeen. While in Aberdeen he met Catherine whom he later married; they had three children Hannah, Adam and Joe. He spent the years\n1956\n-\n58\nat the Institute for Advanced Study at Princeton. From Aberdeen, Griffiths went to the University of Bristol and then to the University of Birmingham. There he became a colleague of\nPeter Hilton\nand the two ran an in-service course for teachers of mathematics at Birmingham University in\n1961\n-\n62\n. The course looked at how classical mathematics was being presented in new ways in universities and discussed how such changes might change mathematics teaching in schools. This project led to\nHilton\nand Griffiths publishing\nA comprehensive textbook of classical mathematics\nin\n1970\n. Here are a few quotations from the book to illustrate what the authors were trying to do:-\nWe do not forget, however, that 'the most important existence theorem in mathematics is the existence of people'.\n... mathematical ideas are not communicated from mathematician to mathematician in extremely precise form ....\nOne of us believes ..., while the other believes the opposite: but both agree that it would be folly to insist here on a single viewpoint.\n... if the object of teaching is to communicate, rather than to give aesthetic satisfaction to the expositor, then we must be prepared to put pedagogical techniques above mere logic ....\n... whatever mathematics is, it is not the quest for absolute certainty.\nK E Hirst, reviewing the book, explains that the authors take a:-\n... second look at many ideas, albeit in different contexts, for those who have met them in school or as undergraduates. ... Thus a picture is painted of classical mathematics as a network of ideas, and of more recent developments as tools to make further connections and offer new insights, as well as having importance in their own right. ... As well as illuminating classical mathematics, the book also provides a way forward into more recent topics, clearly demonstrating that subjects like topology and modern algebra have firm classical roots, unlike many expositions which give the impression of self-contained inventions which have superseded older mathematics. __The authors attach considerable importance to the \"spiral approach\" whereby a given idea returns again and again as the context merits it. This is contrasted with many apparently linear expositions which, the authors emphasise, differ radically from the way in which ideas in mathematics are actually assimilated by mathematicians.\nBefore this book was published, Griffiths spent the year\n1963\n-\n64\nat the\nCourant\nInstitute in New York. He returned to England in\n1964\nto take up an appointment as Professor of Pure Mathematics at Southampton University. He was to continue to hold this post for\n28\nyears until he retired in\n1992\n. During these years he published articles on topology and also took a deep interest in mathematical education, publishing important and influential article on that topic. For example his work on topology included the text\nSurfaces\npublished by\nCambridge University Press.\nThe first English edition appeared in\n1976\n, with a German translation two years later. A second edition appeared in\n1981\nand Griffiths writes in the Preface:-\nSeveral reviewers and correspondents have shown a warm interest in the book and made suggestions for improving it; where possible I have altered the original text accordingly.\nThis tells us much about Griffiths, for few authors react in this fashion to criticisms of their work. In fact we can see more clearly why he reacted in this way when we read one of the reviews he wrote. In\n1980\nR E Edwards published\nA formal background to mathematics.\nGriffiths reviewed the book for the\nBulletin of the American Mathematical Society\nand we quote part of the review which gives considerable insight in Griffths own approach\n[\n2\n]\n:-\nBefore I can review this unusual book adequately, it is necessary to consider how academic mathematicians\n(\nsuch as readers of this Bulletin\n)\nhave gradually come to expect mathematics books to be written in a standard way. About a century ago, for example, books on Physics were appearing in Britain, written by confident authors who declared in enthusiastic Prefaces that their readers could now understand the mysteries of the Universe, God's handiwork, etc. By the\n1920\n's the style had changed and a different type of author would say in his Preface 'This book contains all that is necessary for the B.Sc. Examinations of ... '. In Mathematics, as well as Physics and other disciplines, the Enthusiast still writes, but he usually conforms to the American euphemism of the 'Reward Structure'; his readership may not be working for B.Sc. degrees, but they are in a hurry and want him to get cracking. They want the gold nuggets of the mathematical mine, without the view from the mountain, or disquisitions upon the systems fed by the gold. Among other things, therefore, they are unlikely to dwell on his Preface\n(\nespecially if it is long and complex\n)\n, and they expect a flow of information that is organised and assembled in a conventional way, to get to the point as quickly as possible. Of course, there is also an unspoken convention as to what this 'point' is, and the convention is reinforced by almost every new book that appears in the rapid growth of mathematics publishing during the past\n40\nyears. A few books appear which have a different 'point', and this is one of them. Like the early Physics books, it aims to put the gold nuggets of the mathematics into a synoptic view. It is a work of Mathematics Education, which is a more complex affair than 'just' Mathematics. ...\nAlso, and with humble diffidence, the author does something which is rarely if ever done elsewhere and looks at various books which deal with particular topics. He analyses statements made by them; and this type of criticism, if pursued more widely with similar courtesy and responsibility, could be good for us all for two reasons. First, the criticised authors can benefit because we have no process institutionalised in the mathematical community for deciding whether books are good or bad\n(\nthere is the writing of reviews, but these rarely deal with the detailed criticism that can come from usage of books, and it is a standard practice that reviewers do not criticise in the manner of\n(\nsay\n)\ndrama-critics\n)\n. Second, teachers or intending teachers need training in how to look at books, deluged as they are by publishers wanting them to adopt texts which, with a wrong choice, can result in heavy investment in an unsuitable book; yet few mathematics or education courses give any training in the skills of reading a book, let alone assessing it.\nWe give the titles of a few of his mathematical education article which give an overview of his interests in that topic:\nPure mathematicians as teachers of applied mathematicians\n(1968)\n;\nMathematics Education today\n(1975)\n; Successes and failures of mathematical curricula in the past two decades\n(1980)\n; Simplification and complexity in mathematics education\n(1983)\n;\nThe implicit function theorem: technique versus understanding\n(1984)\n;\nA critical analysis of university examinations in mathematics\n(1984)\n;\nCubic equations, or where did the examination question come from?\n(1994)\n;\nThe British Experience of Teaching Geometry since\n1900\n(1998)\n; and\nThe Divine Proportion, matrices and Fibonacci numbers\n(2008)\n.\nHis influence on mathematical education was certainly not restricted to his publications. He was deeply involved in the 'School Mathematics Project', he served as chairman of the 'Joint Mathematical Council', and chaired the steering group for the 'Low Attainers Mathematics Project' from\n1983\nto\n1986\n. This project became the 'Raising Achievement in Mathematics Project' in\n1986\nand he chaired this from its foundation to\n1989\n.\nOutside mathematics the Griffiths family suffered hardships and joys\n[\n1\n]\n:-\nDuring much of this time, Catherine and Brian faced difficult problems at home, for both their sons suffered from cystic fibrosis and required extensive care. The death of the younger son, Joe, prevented Brian from giving an invited talk on mathematics education to the\n1970\nInternational Congress of Mathematicians, and the elder, Adam, died when studying for a DPhil at Oxford. Nonetheless, the Griffiths were always generous hosts and took great care to see that newcomers to the department were comfortably settled in Southampton. Their house was always one of music. Catherine was a piano teacher and their daughter, Hannah, a cellist. However, only after retirement in\n1992\n, could Brian find time to practise his violin and play in a local string orchestra and two string quartets.\nA conference in Southampton on\n21\nJune\n2008\nwas dedicated to the memory of Griffiths who had died suddenly just over two weeks before. He was described in the programme as:-\nA fine mathematician, a good friend to mathematics education, and a supremely nice person always willing to share his expertise.",
  "matematicos_citados_na_biografia": [
    "Max Newman",
    "Raymond Wilder",
    "Peter Hilton",
    "Hilton",
    "Courant"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}