{
  "nome_completo": "Bronisław Knaster",
  "nome_curto": "Bronisław Knaster",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Knaster/",
  "data_nascimento": "22 May 1893",
  "local_nascimento": "Warsaw, Russian Empire (now Poland)",
  "data_morte": "3 November 1980",
  "local_morte": "Wrocław, Poland",
  "summary": "Bronisław Knaster was a Polish mathematician who was known for his work in point-set topology.",
  "biografia": "Bronisław Knaster\nwas born in Warsaw but at the time of his birth, Warsaw was not a major city of Poland since Poland had officially ceased to exist in\n1795\nwhen its lands were divided between Prussia, the Austrian Empire and the Russian Empire. In\n1893\nWarsaw was in the Vistula Province of the Russian Empire but, with Russia trying to eradicate Polish culture and language, it saw much unrest as Poles tried to assert their identity. Bronisław's father, Ludwik Knaster, was a much respected hospital doctor in Warsaw, the head of the therapeutic clinic at the 'Baby Jesus' hospital and president of the Association of Physicians.\nSchool education proved difficult for young Knaster who entered the first class of the Fourth Junior High School in\n1902\n. Beginning in autumn of\n1904\nthere were school strikes as pupils and their parents protested against school teaching being in Russian and pupils being even forbidden to speak Polish in school. When school strikes occurred, the Russian authorities reacted by closing the school and the Fourth Junior High School was closed. It appears that the Russian authorities were happy to close schools and keep illiteracy in Poland as high as possible. After a year being out of formal education, in January\n1906\nhe was admitted to the School of the Teachers' Association, and after it was closed by the authorities in\n1907\n, he was admitted as a student in the fifth grade of the Jan Kreczmar School. After the closure of this school in May\n1908\nand the arrest of many of its students, Knaster moved to the Second Boys Junior High School, at which he completed his school education in\n1911\nwith a silver medal. On his Russian matriculation certificate there is no Polish language, but he had passes in the following subjects\n(\nwith the grade out of\n5)\n: religion\n(5)\n, Russian language and literature\n(5)\n, philosophy\n(5)\n, Latin\n(4)\n, mathematics\n(5)\n, physics\n(5)\n, mathematical geography\n(5)\n, geography\n(4)\n, German\n(5)\n, French\n(5)\n, jurisprudence\n(5)\n. Despite the difficulties with his education we see that he graduated in\n1911\nwith excellent grades and looked for a university education.\nThe University of Warsaw, his home town university, should have been a natural choice but, like the schools, its teaching was in Russian and the staff were entirely Russian, so patriotic Poles boycotted it. As a consequence most Poles from Vistula Province at this time went abroad for their university education. Some went to Galicia where, although under Austrian control, Polish education still flourished. Knaster's father, however, had studied in Paris so it was natural for his son to follow suit. One might imagine that Paris was an ideal city for someone to obtain an outstanding mathematical education but at this stage Knaster was looking to follow his father and obtain a medical degree.\nIn his first year in Paris,\n1911\n-\n1912\n, before beginning his medical degree he studied physics, chemistry and natural science, passing the examinations in these topics and thus qualifying to enter the Faculty of Medicine. After two years studying medicine, sat and passed the examinations in March\n1914\n. During his studies in Paris, he met Maria Morska, who later became a well-known author and respected journalist writing under the pseudonym Mariusz Dawn. In July\n1914\nthey returned to Poland\n(\nstill of course a part of the Russian Empire\n)\nfor a holiday and intending to get married. By the end of July\n1914\n, however, France had begun mobilizing its troops and, on\n3\nAugust, Germany declared war on France. Returning to France was not possible but the three years he had spent in Paris were important ones for his education and he had become familiar with the French language and culture, both of which he loved. Knaster married Maria Morska in Dabrowa near Tarnów in October\n1914\n.\nKnaster took a job in the Judicial Department of the Commissariat of the Fourth Civil Guard District of the City of Warsaw. The German advance into Poland during World War I saw the Russians leave Warsaw in August\n1915\nand a German governor was installed. Germany, seeking to bring Poles onside, allowed a certain amount of restoration of Polish education and the Poles were allowed to organise a new Polish University of Warsaw. They did this in a remarkably short period of time and the university opened in November\n1915\n. Teaching was in Polish but, in order to keep control of the patriotic movement, the Germans only allowed\n50\nprofessors although the number of students were unlimited. Knaster enrolled and began studying logic under\nJan Lukasiewicz\nwho had been invited to the new University of Warsaw when it reopened. Quite quickly, however, he changed from logic to studying mathematics. Frequently asked later why he did not continue his medical studies, he liked to say that he made the change because of the purity of mathematical methods and the certainty of its results, which in his eyes was very different from medicine.\nMathematics in the new University of Poland was strong from the beginning.\nZygmunt Janiszewski\nled the new centre along with\nStefan Mazurkiewicz\n.\nWacław Sierpiński\njoined then in\n1918\n.\nKazimierz Kuratowski\nwrites in\n[\n1\n]\n:-\nAs early as\n1917\n[\nJaniszewski\nand\nMazurkiewicz\n]\nwere conducting a topology seminar, presumably the first in that new, exuberantly developing field. The meeting of that seminar, taken up to a large extent with sometimes quite vehement discussions between\nJaniszewski\nand\nMazurkiewicz\n, were a real intellectual treat for the participants.\nTo understand the remarkable mathematical environment that Knaster had entered we quote again from\nKazimierz Kuratowski\n[\n1\n]\n:-\nIn the first volume of\n[\nPolish Science: Its Needs, Organisation, and Development\n]\n, which appeared in\n1918\n,\nJaniszewski\npublished an article \"On the needs of mathematics in Poland\", which with amazing clarity and precision presented a blueprint for Polish mathematics. Janiszewski started out with the assumption that Polish mathematicians do not have to be satisfied with the role of followers and customers of foreign mathematical centres but can achieve an independent position for Polish mathematics. One of the best ways of achieving this goal, suggested Janiszewski, was for groups of mathematicians to concentrate on relatively narrow fields in which Polish mathematicians had common interests and - more importantly - had already made internationally important contributions. These areas included set theory, and the foundations of mathematics.\nThe first students to enter into this high powered mathematical environment were Knaster,\nKazimierz Kuratowski\nand\nStanisław Saks\n. Knaster's studies were interrupted, however, by the outbreak of the Polish-Soviet war of\n1920\n. An independent Poland had been declared on\n11\nNovember\n1918\nand the Treaty of Versailles of\n1919\ndefined much of the boundaries of the new Poland but left the problem of the eastern boundary vague. Poland looked to regain its lands in the east while the Soviets looked to expand to the west and regain lands they held prior to World War I. Border incidents took place during\n1919\nbut in March\n1920\na full scale war broke out when Polish troops advanced towards Kiev. A Soviet counter offensive saw their armies advance towards Warsaw in July\n1920\nand Knaster volunteered to service in the Polish army. He served as a corporal stretcher-bearer until November\n1920\nand was later decorated with the Legion Cross by Marshall Piludski. He paid a heavy price, however, for he contracted a rare form of malaria which caused him almost unbearable physical problems for ten years.\nBack at the University of Warsaw, Knaster continued to undertake research advised by\nStefan Mazurkiewicz\nand soon published his first papers. In\n1921\n, jointly with\nKazimierz Kuratowski\n, he published the paper\nSur les ensembles connexes\nⓉ\n(\nOn connected sets\n)\nand, in the following year, his paper, joint with Waclaw Sierpinski,\nSur une ensemble abstrait, dont chaque élément est un élément limite de chaque sous ensemble non dénombrable\nⓉ\n(\nOn an abstract set, each element of which is a limit of an uncountable subset\n)\n, was published. These papers were, respectively, in the second and the third volumes of the new Polish journal\nFundamenta Mathematicae\n. Knaster was interested in continua, defined technically as compact connected metric sets. Janusz Charatonik writes\n[\n5\n]\n:-\nThe first curiosities in the structure of continua were observed in\n1910\nby\nL E J Brouwer\nwho constructed the first example of an indecomposable continuum, i.e. a continuum which is not the union of two of its proper subcontinua. Two years later,\nZ Janiszewski\nannounced that there exists a curve containing no arc. Both these examples inspired Knaster and\nKuratowski\nto ask the question: Does there exist an indecomposable continuum whose every subcontinuum is also indecomposable? Obviously, any such a continuum, if it existed, could not contain an arc, so it had to differ substantially from any continuum known so far. Using very hard, complicated, and purely geometric methods, Knaster succeeded in constructing such an example. This was his Ph.D. thesis 'Un continu dont tout sou-continu est indécomposable'\nⓉ\n(\nA continuum of which every sub-continuum is indecomposable.\n)\n(1922)\n.\nKnaster received his doctorate in\n1923\n, becoming one of the first doctors of the new Polish University of Warsaw. With such outstanding results Knaster's future career looked set for the highest level. Instead of years of triumph, however, the next few years became more and more difficult due to the malaria he had contracted during the Polish-Soviet war. Quinine taken orally proved to be completely ineffective and the attacks of malaria began to come more and more often, and lasted longer and longer. Under these conditions, it was decided that he would feel better in the south, especially since a few months stay in a special sanatorium near Dresden did not help. In\n1924\nhe left for Italy, where he felt well enough to work. From then on, for the next few years, with short breaks, he lived, hoped to recover and worked there. The malaria, however, did not leave him while he lived in Italy, and his subsequent attacks gradually became so dangerous that over time they began to require that he received treatment in hospital. A pure piece of luck saved him: one day he picked up a newspaper which contained an article about the treatment of some varieties of malaria with intramuscular injections of quinine. Within a year around\n1930\nthe disease passed, leaving him, however, with a severely damaged body and he struggled with his health for the rest of life and was sometimes forced to take long stays away from home.\nThe problems with his health that we have just recounted might lead one to expect that his publication record in the nine years from\n1921\nto\n1930\nwould be much poorer that that from\n1930\nto\n1939\n. In fact a look at his papers shows that in fact the situation is quite the opposite with about three times as many papers in the first period than in the second. The answer lies in the fact that, because of his health problems, he was unable to teach and take on the many other duties that a university professor has to undertake. When his health was at its worst, all he was able to do was undertake research.\nHe\nhabilitated\nin\n1926\n, giving him the title of associate professor. He attended the International Congress of Mathematicians held in Bologna in September\n1928\nand gave two lectures\nSui punti regolari nelle curve di Jordan\nⓉ\n(\nOn regular points on Jordan curves\n)\nand\nDecomposizioni continue e semicontinue nell' Analysis situs\nⓉ\n(\nContinuous and semicontinuous decompositions in topology\n)\n. While at this Congress, the Polish mathematicians arranged for\nErnst Zermelo\nto make a lecture tour of Poland in\n1929\n. Knaster offered to have\nZermelo\nstay at his apartment while in Warsaw and\nZermelo\naccepted. In fact Knaster organised everything concerning the Warsaw visit. In his\n1930\nreport of his visit,\nZermelo\nsays he greatly appreciated the hospitality and discussions with Knaster. Knaster clearly greatly enjoyed\nZermelo\n's visit and the two corresponded between August\n1929\nand October\n1932\n. Knaster wrote:-\nI have grown so fond of your scientific points of view and of your further remarks and aphorisms that I miss you ...\nWith his health improving, Knaster had returned to Warsaw in early\n1929\nand began to run his advanced seminar in topology, taught courses, took on editorial duties and other organizational activities. He became an editor of the new series of\nMathematical Monographs\n, which was founded in\n1931\n. He attended the International Congress of Mathematicians held in Zurich in September\n1932\nand gave the lecture\nÜber unikohärente Kontinua\nⓉ\n(\nOn uncoherent continua\n)\n. Also at this Congress he delivered his colleague\nKarol Borsuk\n's lecture\nÜber die Zerlegung einer euklidischen n-dimensionalen Vollkugel in n Mengen\nⓉ\n(\nOn the decomposition of a Euclidean n-dimensional solid sphere in n dimensions\n)\n. We do not know why he delivered\nBorsuk\n's lecture, since\nBorsuk\nwas certainly at the Congress.\nWe quote from Roman Duda's biography\n[\n7\n]\n:-\nFriends recall that Knaster's favourite habit in the thirties was long evening walks, during which he liked to lead passionate disputes about mathematics but not only about mathematics. Outstanding musicality and great music culture, extensive literary reading, knowledge of the world resulting from his many years abroad, and above all a lively mind and sharp tongue made contacts with him refreshing and stimulating. Through his wife Maria he established close relations with the Skamander poetic group, and thanks to innate wit and intelligence and love of a lively and apt word, he won the admiration and friendship of Tuwim, Wittlin, Slonimski, eminent Polish poets and writers.\nOn\n1\nSeptember\n1939\nGermany invaded Poland and their forces rapidly advanced towards Warsaw. Knaster and his wife, and many of his fellow Poles, fled to the east to Lwów\n(\nnow Lviv in Ukraine\n)\n. On\n22\nSeptember, Russian troops entered Poland from the east, five days later Warsaw fell to the Germans and, following the Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union, Poland was partitioned between these two powers. The Polish University of Lwów, the Jan Kazimierz University, was at first allowed to continue as before by the Soviets but on\n18\nOctober\n1939\nthe Polish head of the university was replaced by a Ukrainian. On\n8\nJanuary\n1940\nthe Jan Kazimierz University was renamed the Ivan Franko Lviv State University and many of the Polish staff were replaced by Ukrainians and Russians. Knaster, however, was allowed to teach there and became a professor in the Chair of Geometry, headed by\nStanislaw Mazur\n.\nOn\n22\nJune\n1941\nGermany broke the non-aggression pact and invaded the Soviet Union. By July\n1941\nthey had captured Lwów and they closed the university. Many Polish staff of the university and their families were massacred by the Germans but Knaster and his wife survived. The German occupation of Poland resulted in Poles being packed into small spaces and as a consequence there was a typhus epidemic. Lice carrying typhus filled these confined spaces. A vaccine was produced in Rudolf Weigel's Institute in Lwów and this was now in great demand. Knaster was given the job of feeding lice at Rudolf Weigel's Institute in Lwów. He had the\n[\n6\n]\n:-\n... rather unusual job of spending several hours a day in the institute with a box of lice attached to his forearm\n[\nwhich\n]\nin those gloomy days was a rather good one.\nIn fact it meant that he was given an Identity Card stamped with \"Institute of Typhus\" which provided relative security for him. In\n1944\nthe Soviet forces again took Lwów and the Ukrainian University opened again. Knaster was offered his position as a professor in the Chair of Geometry but, after the new Polish borders were established following the end of World War II in\n1945\n, he decided to leave Lwów, which was no longer in Poland, and move to Cracow with its famous Jagiellonian University. He lectured there and assisted in restarting printing so that volume\n33\nof\nFundamenta Mathematicae\nwas published in December\n1945\n, an important symbol in the revival of Polish mathematics.\nNot only did the Polish universities in Cracow, Warsaw and Poznan reopen in late\n1945\nbut four new Polish universities in Wrocław, Lublin, Lódz and Torum opened. Knaster was now head hunted by all four of these new universities and offered professorships. This presented him with a hard choice but, after some deliberation, he decided to accept Wrocław\n[\n6\n]\n:-\nWhen Knaster came to Wrocław, he left behind\n52\nyears full of events and dramas, including a cruel war which brought the painful death of his mother and tragic death of his beloved wife. A mathematician of world renown, an energetic organiser of scientific life, an experienced mathematical editor - Knaster was a man of greatest importance for the new university. He married there Regina Szpalerska, the widow of an underground Home Army soldier, and soon devoted himself completely to didactical, organising and editorial tasks. He was not alone in that. Beside him there were also\nE Marczewski\n,\nH Steinhaus\n, and\nW Ślebodziński\n. These four men, \"the great four\", were pioneers of the Polish mathematical life in Wrocław.\nOne of Knaster's passions was editorial work. He was one of the founders of the Wrocław Scientific Society in\n1946\nand was a board member for many years. The Society published Series B and between\n1949\nand\n1978\nhe edited\n131\nvolumes in that series. He continued to publish high quality papers, especially in the\n1950\ns. Duda writes\n[\n6\n]\n:-\n... he was a deeply good man. He loved mathematics and university life above all and it sufficed, either for a student or college official, to reveal a similar passion to acquire his most vivid sympathy. Intolerable to a passive attitude of mind, he strongly favoured creative work of a very concrete type. Everywhere - in his garden, where he tried to get new sorts of roses, in editorial work, where he exhibited perfectionism difficult to meet, in music, which he liked to play for himself, in conversation, where he admired a sharp wit and verbal dispute, and above all in mathematics, his greatest love. Favouring creativity, he disliked history, philosophy and all kinds of reflection upon the past and dead. With all his sensitivity to a talent, he highly treasured a character in a man. He admired\nBertrand Russell\nand\nAlbert Einstein\n...\nAt age\n85\nhe suffered a cerebral haemorrhage and although he made a partial recovery, his last eighteen months were ones in which he suffered greatly, only speaking and moving with difficulty. He died at home in Wrocław.\nWe have said little of Knaster's outstanding mathematical contributions after the work for his thesis. We refer to\n[\n5\n]\nand\n[\n6\n]\nfor detailed information on this. We must, however, mention his procedure of fair division which he discovered in\n1945\nand published in\nSur le problème du partage pragmatique de H Steinhaus\nⓉ\n(\nOn a problem of pragmatic sharing by H Steinhaus\n)\n(1947)\nand in a joint paper with\nHugo Steinhaus\nSur le partage pragmatique\nⓉ\n(\nOn pragmatic sharing\n)\n(1947)\n. For some details of this division problem, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Jan Lukasiewicz",
    "Zygmunt Janiszewski",
    "Stefan Mazurkiewicz",
    "Wacław Sierpiński",
    "Kazimierz Kuratowski",
    "Janiszewski",
    "Mazurkiewicz",
    "Stanisław Saks",
    "L E J Brouwer",
    "Z Janiszewski",
    "Kuratowski",
    "habilitated",
    "Ernst Zermelo",
    "Zermelo",
    "Karol Borsuk",
    "Borsuk",
    "Stanislaw Mazur",
    "E Marczewski",
    "H Steinhaus",
    "W Ślebodziński",
    "Bertrand Russell",
    "Albert Einstein",
    "Hugo Steinhaus",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}