{
  "nome_completo": "John Bryce McLeod",
  "nome_curto": "Bryce McLeod",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McLeod/",
  "data_nascimento": "23 December 1929",
  "local_nascimento": "Aberdeen, Scotland",
  "data_morte": "20 August 2014",
  "local_morte": "Abingdon, near Oxford, England",
  "summary": "Bryce McLeod was a Scottish mathematician who worked on linear and nonlinear partial and ordinary differential equations.",
  "biografia": "Bryce McLeod\n's parents were John McLeod, an engineer, and Adeline Annie Bryce. John and Annie\n(\nthe name she was known by\n)\nwere married in the Rubislaw district of Aberdeen in\n1928\n. Their son John Bryce McLeod, the subject of this biography, was born on\n23\nDecember\n1929\nbut, as one would expect, his birth was not registered until January\n1930\n. He was educated in his home city of Aberdeen, first attending primary school there. When he was ten years old, shortly after World War II broke out, Bryce was on the point of moving from his primary school to Aberdeen Grammar School. However, the Grammar School was only operating on half the days since it was being used to train soldiers on the other half. Bryce's parents, afraid that their son's education would suffer, sent him to be taught by his grandfather when the pupils were not at school. His grandfather was by this time retired but he had been Head of Mathematics at Aberdeen Grammar School. \"Let's teach young Bryce some mathematics,\" he thought\n[\n4\n]\n:-\nApparently, this gentleman had lost track of what mathematics a\n10\n-year-old would have been exposed to, and he began the first lesson with algebra, completing linear equations in around\n15\nminutes, and then delving into the quadratic equation. Young Bryce, having seen nothing beyond arithmetic before, had, he later recalled, no idea what these x's and y's were about, but was too in awe of his grandfather to admit it. He went home with an assignment, and agonised for hours trying to determine what was going on. But when he returned the next day he was able to solve every quadratic equation his grandfather gave him.\nAfter this introduction to algebra from his grandfather, Bryce progressed rapidly in his schooling at Aberdeen Grammar School. He was an outstanding pupil and completed his secondary schooling much more rapidly than the norm. He graduated from the Grammar School in\n1945\nand, later in that year, he entered the University of Aberdeen at the age of sixteen. The University of Aberdeen Bursary Competition was an important event for those in their final year at high school and McLeod had sat the examination and had been awarded a top bursay. He graduated in\n1950\nwith First Class Honours in Mathematics and Natural Philosophy. We note that this degree was an M.A.\n(\nnot a B.A. as given in certain of the references below\n)\nsince the M.A. was, and still is, the traditional first arts degree in the Scottish system.\n[\nThe Scottish M.A. is equivalent in standard to the B.A.\n]\nMcLeod was awarded a scholarship from Aberdeen to study at Oxford University so, in\n1950\n, he matriculated at Christ Church, Oxford. At this time McLeod was aiming to become a school teacher.\nMcLeod spent two years at Christ Church, Oxford, working for his B.A. His tutor at the college was Theodore William Chaundy\n(1889\n-\n1966)\nwho was also a University Reader in Mathematics. During the time McLeod was studying for his Oxford B.A., Chaundy taught the courses 'Elementary differential equations and Legendre's functions' and 'Partial differential equations. Elliptic equations. Parabolic equations' and McLeod became fascinated with the topic. The rest of his mathematical career was influenced by the courses and tutorials given by Chaundy on differential equations. McLeod was awarded a First Class B.A. by the University of Oxford in\n1952\n.\nAfter obtaining his B.A. from Oxford, McLeod spent the year\n1952\n-\n53\nin Vancouver funded by a Rotary Foundation Fellowship from Aberdeen. This fellowship would have funded his studies anywhere in the world and he had asked advice from Chaundy about the best place to go. Chaundy suggested British Columbia, more because he had a daughter there than because of its mathematical standing. However, although it wasn't a top place for mathematics, nevertheless McLeod had a great year there and made many good contacts. Returning to England, he did two years National Service which, at that time, was compulsory. These years,\n1953\n-\n55\n, were spent as an Education Officer in the RAF, teaching physics and mechanics at the Royal Air Force Technical College at Henlow, Bedfordshire. He soon discovered, however, how little mathematics the men he was teaching knew but he found it a very worthwhile experience showing him that he had to adjust his teaching to suit his pupils. He also made some good friends in these two years.\nHe then returned to Oxford to undertake research for his D.Phil. advised by\nEdward Titchmarsh\n. During\n1955\n-\n56\nhe was a Harmsworth Senior Scholar of Merton College, Oxford. In\n1956\nhe married Eunice Martin Third; they had a daughter, Bridget, and three sons, Kevin, Callum and Patrick. While still undertaking research, McLeod was appointed as a Junior Lecturer in Mathematics at Oxford in\n1956\n, a position he held for two years. He was awarded a D.Phil. by Oxford in\n1958\nfor his thesis\nSome Problems in the Theory of Eigenfunction Expansions\n. This year of\n1958\nalso marks the time that his first paper was published, namely\nOn a functional equation\nwhich he wrote jointly was T W Chaundy who, as we have already noted, had been his tutor and had inspired him to work in this area. In\n1959\nhe had three papers published:\nOn four inequalities in symmetric functions\n;\nTwo expressions for the distribution of eigenvalues\n; and\n(\njointly with\nE C Titchmarsh\n)\nOn the asymptotic distribution of eigenvalues\n. These papers mark the beginnings of a long publication list and we note that MathSciNet lists\n156\npublished items for McLeod.\nIn\n1958\n, after completing the work for his D.Phil., McLeod was appointed as a lecturer in Mathematics at the University of Edinburgh. He spent two years in Edinburgh before being appointed as a fellow of Wadham College, Oxford in\n1960\n. At the same time he was appointed as a Lecturer in Mathematics at Oxford University. He was a Junior Proctor in\n1963\n-\n64\n. He held the fellowship at Wadham until\n1991\nand the University Lectureship until\n1988\nbut in\n1987\nhe accepted the University of Pittsburgh's offer of a research professorship, a position that meant he became a tenured full professor. This was a move to a place that McLeod knew well since he had spent several summers and sabbaticals in the United States where he spent most time at the University of Wisconsin and the University of Pittsburgh. Among the reasons he chose to leave Oxford to take up the appointment at Pittsburgh were the fact that he realised that his area of applied analysis was more appreciated in the USA than in Britain. Another reason was that, by\n1987\n, he realised that he faced mandatory retirement in a few years time in the UK but could continue teaching in the USA.\nSam Howison describes his approach to mathematics in\n[\n5\n]\nand\n[\n6\n]\n:-\nBryce considered himself a problem-solving mathematician rather than a builder of general theories. He liked to focus on a specific hard problem and to find something new to say about it that was at the same time rigorous, interesting and useful. He was, of course, fully au fait with modern techniques but he added to this a deep understanding in the style of the more classical tradition he had inherited from Chaundy, Titchmarsh and their predecessors. He solved problems with consummate skill  across an extraordinary range of areas as diverse as fluid mechanics, general relativity, plasma physics, mathematical biology, superconductivity,\nPainlevé\nequations, coagulation processes, nonlinear diffusion and pantograph equations, among many others.\nWhat better way to describe Mcleod's achievements in mathematics than to quote the citation for the Naylor Prize and Lectureship in Applied Mathematics which he received from the\nLondon Mathematical Society\nin\n2011\n:-\nThe Naylor Prize and Lectureship in Applied Mathematics is awarded to Professor J Bryce McLeod, FRS, of the University of Oxford, in recognition of his profound and versatile lifelong achievement in the analysis of nonlinear differential equations arising in mechanics, physics and biology, and of its lasting influence. Since the early\n1960\ns, McLeod has played an important role in this work. For example, in\n1962\nhe devised a proof, far ahead of its time, that an infinite system of coagulation - fragmentation equations has non-trivial solutions; in\n1971\n, his seminal paper with\nTosio Kato\non the asymptotic behaviour of functional differential equations broke completely new ground in what was then a new area; in\n1977\n, with Paul Fife he established that solutions to reaction-diffusion equations converge to travelling waves\n(\nthis now-classic paper has since been extended, in particular, by McLeod and others to an important\nintegral equation\nfrom mathematical neuroscience\n)\n; in\n1979\n, he devised an ingenious proof that Krasovskii's conjecture concerning the maximum slope of a water wave is false; in the\n1980\ns, his work with Stuart Hastings and others was among the first contributions to the rediscovery in modern times of the Painlevé transcendents; in fundamental work with Avner Friedman in\n1985\nhe proved that for reaction-diffusion equations with certain nonlinearities, solutions blow up in finite time and in\n1995\n, with Gero Friesecke, he showed that dynamics provides a mechanism which prevents the solution to a model of phase transformations from generating an infinitely fine microstructure. The list could go on. Bryce McLeod is an applied analyst with a terrific ability in problem solving. Over an extended period, he has made crucial contributions over a very broad range of topics by solving hard, specific problems, most arising in applications. His work is marked by power and virtuosity, transparency and elegance, and over the decades has been a source of inspiration to many young researchers.\nWe note that the Naylor Prize and Lectureship in Applied Mathematics is awarded in even numbered years in memory of V D Naylor:-\nThe grounds for the award may include work in, influence on, and contributions to applied mathematics and the applications of mathematics, and lecturing gifts.\nMcLeod gave the Naylor Lecture at the\nLondon Mathematical Society\nAnnual General Meeting on\n16\nNovember\n2012\n. The topic of his lecture was 'The Wedge Entry Problem'.\nMcLeod has written one book,\nClassical methods in ordinary differential equations. With applications to boundary value problems\njointly authored with Stuart P Hastings\n(\nthe author of the obituary\n[\n4\n]\n)\n. Here is an extract from Stephen Schecter's review of the book:-\nWhich excites you more, the problem you want to solve, or the method you envision using to solve it? For many of us, it's the method. We have techniques we love, and we like to use them, extend them, and show the world how great they are. This book is about the authors' favorite methods, which they call \"classical\", for solving nonlinear ODE boundary value problems. The methods include shooting\n(\ntheir most favorite\n)\n, using estimates to bound the solutions, rewriting differential equations as integral equations\n(\nto set up an iteration scheme, and to give a rigorous approach to asymptotic expansions\n)\n, and rewriting linear ODEs in self-adjoint form. Methods they don't like so much include fixed point arguments in function spaces, variational methods, unjustified asymptotic expansions, geometric singular perturbation theory, and Mel'nikov's method. The book covers a lot of problems that the authors treat using their favorite methods. For many of the problems they also discuss approaches using the methods they don't like, often giving introductions to these methods. In a number of cases their motivation for looking at a problem seems to be to see if a problem done another way can also be done their way, and to see if they have anything to add. ... The book is clearly and carefully written, with lots of complete proofs. Often, to improve clarity, the most general case is not attempted, as is appropriate in a book of this type. The authors say that their approach often gives more information than alternative approaches. They prove this by numerous examples. ... I would be happy to own this book. It is a summary by two distinguished mathematicians of the techniques they have found useful so that others can use them. More of us should write such books.\nThe article\n[\n7\n]\nis a review by McLeod of a text on\nGamma and Beta Functions, Legendre Polynomials, Bessel Functions\n. McLeod makes some general comments in this review which give an indication of his ideas about teaching these topics:-\nIf it is desired to introduce the special functions at such an early stage, with all the limitations and inadequacies that this implies, then this book may have something to say. But I should have thought that intending mathematicians would be well-advised to do a bit more analysis first, while non-mathematicians, interested presumably in applications, might become a bit impatient with the elaborate care with which the more elementary properties are proved and with the complete absence of some of the more advanced\n(\nand more useful\n)\nones.\nTo get an idea of McLeod's qualities as an undergraduate teacher, we cannot do better than to record some comments from University of Pittsburgh students:\n[\nMcLeod is\n]\nvery clear and always involves the class. His tests are very fair. ... If you do the homework and study that for the tests then you will do fine. Awesome and entertaining teacher! Take him by all means!\nVery organized, clear, and knowledgeable. His lectures are fast paced but always very interesting. Pay attention in class and do the homework and you will do well. Without a doubt, the best lecture class I've taken yet. He's a really funny guy too. McLeod is the MAN!\nOne of the best maths teachers I ever had. Very clear and crisp lectures. But he expects you to know the basics thoroughly and he moves through the lectures fast.\n[\nIt\n]\nseemed like the class was moving fast but never really covered any hard material which made the tests easy. He doesn't really care about doing homework at all.\nIn the interview\n[\n1\n]\nMcLeod gives some wonderful insights into his love of mathematics. He said:-\nMathematics is fun ... Whether it's delving into the mathematics itself or talking to other mathematicians about it ... it's fun. ... In my experience, that fun comes from not getting hold of one problem and spending your life digging deeper and deeper and deeper into that problem. It lies in keeping your mind open to what other people are doing. I never would have wanted to do anything else.\nMcLeod was the thesis advisor for many students at both Oxford and at Pittsburgh. Quite a number have become professors of mathematics. In\n1962\nIan Michael became McLeod's first research student. Ian describes his experiences with McLeod in\n[\n8\n]\n:-\nI remember Bryce as a patient and humane supervisor. At one point in his Naylor lecture of\n2012\nBryce emphasised the importance of asking questions. I hope that this has remained a feature of my later work as an Anglican priest, work which neither of us would have predicted in\n1962\n.\nWe have already mention that McLeod was awarded the Naylor Prize and Lectureship in Applied Mathematics by the\nLondon Mathematical Society\nin\n2011\n. He had, however, received a number of highly prestigious awards before that time. He was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1974\nand a fellow of the\nRoyal Society of London\nin\n1992\n. He received the\nWhittaker\nPrize from the\nEdinburgh Mathematical Society\nin\n1965\nand the Keith Medal and Prize from the\nRoyal Society of Edinburgh\nin\n1987\n.\nMcLeod retired from Pittsburgh in\n2007\nand, the family having kept their home in Abingdon during the twenty years they were in Pittsburgh, they were able to take up residence near Oxford again. In fact they had returned to Abingdon most summers during their twenty years in the United States and McLeod had maintained strong contacts with the Oxford Centre for Industrial and Applied Mathematics and the Oxford Centre for Nonlinear PDEs. McLeod spent the last years of his career at the latter Oxford Centre.\nLet us end with some tributes to McLeod. First one from Carson C Chow\n[\n3\n]\n:-\nBryce was an extraordinary mathematician and an even better human being. I had the fortune of being his colleague in the math department at the University of Pittsburgh. I will always remember how gracious and welcoming he was when I started. One of the highlights of my career was being invited to a conference in his honour in Oxford in\n2001\n. At the conference dinner, Bryce gave the most perfectly constructed speech I have ever heard. It was just like the way he did mathematics - elegantly and sublimely.\nSam Howison writes\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nMany, many people throughout the mathematical community remember Bryce with great fondness:  for his kindness and support for students and colleagues alike; for his intensely amused laughter or his rapt concentration on an explanation; for his zest for life and mathematics.\nJuan J Manfredi, mathematics professor at Pittsburgh, said\n[\n2\n]\n:-\nHe was a distinguished scientist and mathematician but he also was a great gentleman of mathematics. It was a pleasure to talk with him about mathematics. ... He was kind with everybody, even those who did not agree with him.",
  "matematicos_citados_na_biografia": [
    "Edward Titchmarsh",
    "E C Titchmarsh",
    "Painlevé",
    "London Mathematical Society",
    "Tosio Kato",
    "integral equation",
    "Royal Society of Edinburgh",
    "Royal Society of London",
    "Whittaker",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}