{
  "nome_completo": "Carl Wilhelm Oseen",
  "nome_curto": "C Wilhelm Oseen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oseen/",
  "data_nascimento": "17 April 1879",
  "local_nascimento": "Lund, Sweden",
  "data_morte": "7 November 1944",
  "local_morte": "Engelbrekts, Stockholm County, Sweden",
  "summary": "Wilhelm Oseen was a Swedish mathematician who worked in fluid dynamics.",
  "biografia": "C Wilhelm Oseen\nwas the son of Anders Theodor Oseen\n(1849\n-\n1907)\n, a grammar school teacher and headmaster, and Elisabeth Ulrika Hyltén-Cavallius\n(1850\n-\n1944)\n. Anders and Elisabeth\n(\nknown as Betty\n)\nwere married in Växjö in\n1874\n. Anders and Betty Oseen had six children: Anna Gundborg Vilhelmina Oseen\n(1876\n-\n1939)\n; Per Anders Arvid Oseen\n(1877\n-\n1912)\n; Carl Wilhelm Oseen\n(1879\n-\n1944)\n, the subject of this biography; Gertrud Severina Elisabeth Oseen\n(1881\n-\n1954)\n; Wendela Signhilda Charlotta Oseen\n(1884\n-\n1954)\n; and Knut Oskar Theodor Oseen\n(1885\n-\n1912)\n.\nWilhelm Oseen attended school in Halmstad, where he showed he had many talents. He loved both mathematics and history but found it very hard to decide which of these subjects he wanted to pursue at university. While attending school he wanted to learn more than his teachers were giving him, so he studied both history and mathematics on his own, going well beyond the school syllabus. Not wanting to make a choice between these topics, after graduating from the secondary school in Halmstad on\n5\nJune\n1896\n, he enrolled as a student at Lund University still keeping his options open.\nAt Lund University, where he enrolled on\n8\nSeptember\n1896\n, Oseen was taught mathematics by, among others,\nVictor Bäcklund\n. In\n[\n5\n]\nOseen describes Bäcklund's teaching:-\nBäcklund\ndevoted himself to his teaching duties with ardour and delight and he often talked about the pleasure his lectures had given him. During the time that the author\n(\nOseen\n)\nheard him\n(\nin the late\n1890\ns\n)\nBäcklund\ncarried a double burden. Outside of the regular four lectures a week he gave a beginner's course in mechanics with exercises, also four hours a week. His interest in his audience was manifested by, among other things, invitations to a yearly party where lobster was a standing ingredient.\nOseen graduated from Lund University with the degree Filosofie kandidat\n(\nequivalent to B.Sc.\n)\non\n14\nDecember\n1897\n. He continued his studies at Lund and was awarded the degree of Filosofie licentiat\n(\nperhaps between an M.Sc. and a Ph.D.\n)\non\n12\nApril\n1900\n. His first publication appeared in\n1900\n, namely\nOn the general mapping of geodesic circles of a surface through contact transformations\n(\nSwedish\n)\n. He spent the winter semester of\n1900\n-\n01\nat the University of Göttingen in Germany where he attended\nDavid Hilbert\n's lectures on partial differential equations. Both\nHilbert\nand\nFelix Klein\nwere strong influences on Oseen who published two further papers in\n1901\nand also a dissertation. The paper\nContribution to the theory of wave motion in currents\n(\nSwedish\n)\n(1901)\nwas reviewed by Emil Lampe\n(1840\n-\n1918)\nwho wrote that the paper:-\n... is a continuation of the investigations by H Hugoniot ... The paper only deals with the theories for perfect gases and makes repeated references to\nHelmholtz\n's lectures on the mathematical principles of acoustics, edited by A König and\nC Runge\n. The additions to Hugoniot's work refer to the expression for the propagation velocity of a wave when an adiabatic wave movement spreads over a slow current, and also to the propagation of a discontinuous wave in space. We also want to emphasise that an analytical derivation of the\nDoppler\nprinciple is given in the course of the investigation.\nH Hugoniot is Pierre-Henri Hugoniot\n(1851\n-\n1887)\nwho is remembered today in the\nRankine\n-Hugoniot conditions, the\nRankine\n-Hugoniot relations, the\nRankine\n-Hugoniot equation and several other concepts.\nIn his introduction to the paper\nÜber einige irreduzible Gruppen von Berührungstransformationen im Raume\nⓉ\n(\nOn some irreducible groups of contact transformations in space\n)\n(1901)\n, Oseen writes:-\nAs is well known, there are only three different types of finite continuous irreducible contact transformation groups on the plane. In contrast, the number of different types in\n3\n-space is considerably larger. Of these groups in space, three were first discovered by\nLie\nand are analogous to the groups on the plane ...\nScheffers\nalso identified all groups\n[\nof a certain type\n]\n...\nEngel\nhas also set up a strange\n14\n-membered, primitive group. Finally Kowalewski has shown that the two primitive groups mentioned are the only primitive groups of contact transformations in space. This paper contains the determination of some other classes of finite, continuous, irreducible groups of contact transformations in space. The classes examined include the two imprimitive groups set up by\nLie\nand also four, it appears, new groups. ... With four subgroups they are similar to\nLie\n's groups.\nOseen's\n1901\ndissertation is\nOn the finite, continuous, irreducible contact transformation groups in space\n(\nSwedish\n)\n. He continued to publish with two papers appearing in\n1902\n. He was awarded his Filosofie doktor\n(\nequivalent to a Ph.D.\n)\non\n29\nMay\n1903\n. He was appointed as a substitute professor of mathematics at the University of Lund on\n1\nDecember\n1904\nand held this position until\n1\nOctober\n1906\n. During this period, Oseen's publications were all in pure mathematics with the exception of three papers,\nContribution to the theory of wave motion in currents\n(\nSwedish\n)\n(1901)\n,\nContributions to the theory of wave motion in flows\n(\nSwedish\n)\n(1902)\nand\nOn a case of vortex motion in a fluid\n(\nSwedish\n)\n(1902)\n.\nIn Alfshög, Halland, Sweden, on\n30\nDecember\n1904\n, Oseen married Klara Charlotta Strandmark\n(\nborn\n18\nSeptember\n1879\nin Alfshög, died\n19\nDecember\n1943\nin Stockholm\n)\n. Klara was the daughter of Johan Edvard Strandmark, the headmaster of a High School, and Alida Vilhelmina Ewert. Wilhelm and Klara had four children, Birgitta Oseen, born\n4\nJanuary\n1906\n, Gunnel Oseen, born\n25\nJuly\n1907\n, Gärd Oseen, born\n9\nJuly\n1909\n, and Jurd Oseen, born\n3\nMarch\n1914\n. Tragically, Gärd died at the age of nine on\n14\nOctober\n1918\n.\nOseen's move to concentrate on applications of mathematics, particularly applications to fluids, after\n1906\nwas probably influenced by\nLudwig Prandtl\nwith whom he kept up a fairly regular correspondence\n[\n4\n]\n:-\n[\nOseen\n]\n, inspired by the work of the Dutch theoretical physicist\nH A Lorentz\n, posed an important problem regarding the movement of liquids. The new advance in\nLorentz\n's research was that he took into account the viscosity of the liquid. This had usually been neglected in previous work, mainly because it considerably complicated the mathematical model. Oseen further developed\nLorentz\n's study by considering, among other things, time-dependent fluid movements.\nHe published\nOn the theory of the movement of a viscous fluid\n(\nSwedish\n)\n(1907)\nbut also works on other applied topics such as\nOn Dirichlet\"s problem in the heat equation\n(\nSwedish\n)\n(1907)\nand\nOn the theory of the discontinuous movements of an electron\n(\nSwedish\n)\n(1907)\n. He began applying for a professorship in mechanics and mathematical physics at the University of Uppsala, using his most recent work on applications of mathematics to support his case. In the meantime, on\n13\nJuly\n1907\n, he was appointed to a post as a substitute professor of physics at the University of Lund.\nOn\n11\nSeptember\n1909\nhe took up the appointment as professor of mechanics and mathematical physics at the University of Uppsala. It was a position he held for the rest of his career. His inaugural lecture in Uppsala was entitled 'The question of the will of freedom, viewed from a scientific point of view', showing his lifelong interest in philosophy. In\n1911\nhe published\nÜber die Stokes'sche formel, und über eine verwandte Aufgabe in der Hydrodynamik\nⓉ\n(\nOn Stokes' formula and a related problem in hydrodynamics\n)\n. In this paper he addressed what is now known as\nStokes\n' Paradox.\nStokes\nhad produced a formula for the resistance experienced by a sphere moving at a constant, infinitely low speed in a viscous, incompressible fluid. This formula worked in three dimensions but produced contradictions when applied to\n2\n-dimensional flows.\nWe give some more information about Oseen's contributions to\nStokes\n' Paradox and also a short extract from his\n1911\npaper at\nTHIS LINK\n.\nOseen became one of the first Swedish scientists to accept\nNiels Bohr\n's atomic model.\nBohr\nvisited Oseen in Uppsala and, after he left, Oseen wrote to\nBohr\non\n10\nFebruary\n1912\n:-\nDear Friend\nI wish to thank you for your and your wife's visit here. You will understand what an inspiring it had on one who has not met a scientific colleague for over a year. Thanks also for both of your papers, which I read with great interest. If I pose a question concerning a-ray absorption, then please perceive this only as proof of my interest. Here is the question. Through your theory, a-ray absorption is brought into close connection with the question of ionisation by collision, for example the emission of secondary cathode rays. By your theory, how is it possible to explain hydrogen's exceptional status in this question? ... Weaker binding of the electrons?\nOnce again, thank you. My warmest greetings to your wife.\nYour friend, C W Oseen.\nWe note Oseen's comments about not having scientific colleagues at Uppsala.\nIn\n1921\nhe was elected to the\nRoyal Swedish Academy of Sciences\nand, in the same year, he proposed\nAlbert Einstein\nfor a Nobel prize. Every full professor in Sweden had the right to make nominations for Nobel prizes. Oseen became a member of the\nRoyal Swedish Academy of Sciences\n' Nobel Committee for Physics in\n1922\nand he was able to argue strongly for the Nobel prize for physics being awarded to\nEinstein\n. Given\nEinstein\n's standing today it is difficult to understand the problem of convincing the committee that\nEinstein\nwas worthy of the award. The theory of relativity, for which\nEinstein\nis best known today, was not considered well enough supported by experimental evidence by many scientists, both members of the committee and other scientists. Oseen presented the committee with a carefully, strongly, well-written document arguing that\nEinstein\nbe awarded the\n1921\nreserve prize for his\n1905\nwork on the photoelectric effect. Finally the committee was persuaded to make the award to\nEinstein\nin December\n1922\n(\nalthough in fact\nEinstein\ndid not attend the presentation ceremony since he was on a voyage to Japan\n)\n.\nAnother of Oseen's very influential papers was published around the time that he was making the case for\nEinstein\n's Nobel prize. On\n9\nMarch\n1921\nhe submitted his paper\nEine Methode, die Zustandsgleichung der beliebigen Flüssigkeiten oder Gasen exakt zu berechnen\nⓉ\n(\nA method to calculate the equation of state for diverse liquids and gases\n)\n. The paper, which was communicated by\nIvar Bendixson\nand\nHelge von Koch\n, begins as follows:-\nAnyone familiar with modern Swedish mathematics knows the place in which it takes the problem of representing an analytic function by some unified mathematical expression in the widest possible part of its existence realm. If I had to describe the history of this problem here, I should have to remember how\nMittag-Leffler\ndevoted almost all his energy to the solution of this Weierstrassian problem. Of his successors in this field I would primarily have to recall\nHelge von Koch\n, whose extension of the\nMittag-Leffler\nproblem is of fundamental importance for what follows. However, I do not want to talk about the mathematical details here. The purpose of these lines is to show how a straightforward application of the results obtained by the colleagues mentioned should be sufficient to obtain a mathematically exact and, I believe, physically useful method of solving the problem that has for several decodes been subject to the most zealous efforts of a great number of scholars. Their actual task has been to infer the equation of state for a gas or a liquid, whose atoms interact with each other through known, but largely arbitrary forces.\nAlthough the\n1920\nInternational Congress of Mathematicians was called 'International', it was a limited definition of International. Mathematicians from Germany, Austro-Hungary, Bulgaria and Turkey were excluded. This decision, based on the countries 'blamed' for World War I being excluded, was supported by most people but it was strongly opposed by a small number, most notably\nG H Hardy\nand\nG Mittag-Leffler\nneither of whom attended. Oseen played a role in restoring truly international relations at this difficult time by initiating the International Congresses for Applied Mechanics. An informal gathering organised by\nTheodore von Kármán\nand\nTullio Levi-Civita\nin Innsbruck in\n1922\nwas followed by the First International Congress of Applied Mechanics held in Delft in\n1924\n. Although this was a fully international meeting, the International Congress of Mathematicians in Toronto in\n1924\ndid not allow mathematicians from Germany, Austro-Hungary, Bulgaria and Turkey to attend. Nevertheless, Oseen attended the International Congress of Mathematicians in Toronto in\n1924\nbut did not lecture at the congress.\nHe published in German the important book\nNeuere Methoden Und Ergebnisse In Der Hydrodynamik\nⓉ\n(\nNewer Methods and Results in Hydrodynamics\n)\nin\n1927\n. We give a modified version of a short extract from the Preface to that book at\nTHIS LINK\n.\nWe have mentioned above Oseen's membership of the\nRoyal Swedish Academy of Sciences\nand, in particular, his membership of the Sciences' Nobel Committee for Physics. Let us note also that Oseen chaired the Nobel Committee for many years and also that he served as president of the\nRoyal Swedish Academy of Sciences\nin\n1934\n-\n35\n. He delivered the presidential address at the end of his term of office, giving the lecture\nPlato's idiom and mathematics\n. Oseen told his audience of his interest in philosophy in general and that\nPlato\nwas his favourite philosopher.\nOseen was a plenary speaker at the International Congress of Mathematicians in Oslo in\n1936\n. He delivered his lecture,\nProbleme der geometrischen Optik\nⓉ\n(\nProblems in geometric optics\n)\n, on the morning of Thursday\n16\nJuly\n1936\nwith\nErnst Lindelöf\nas chair of the session. We give an English version of the beginning of his lecture at\nTHIS LINK\n.\nTo gain a broader view of Oseen, we quote from\n[\n4\n]\n:-\nOseen's versatility was not limited to the field of physics. He successfully combined his early interest in history with his field of physics and adjacent fields through a number of biographical works. In addition to a large number of shorter life sketches of prominent Swedish scientists, including his teacher\nVictor Bäcklund\n, he wrote a larger biography of Johan Carl Wilcke. On an assignment from the\nRoyal Swedish Academy of Sciences\n, he edited the edition of Scheeles' abandoned paper that was published in\n1942\nto celebrate the\n200\nth anniversary of the chemist's birth. ...\nLiterature and art were also among Oseen's interests. He lectured on both classical and modern literature and was also a performing artist with a number of oil paintings, watercolours and drawings as a result.\nPupils and friends have spoken of Oseen's characteristic features and, in addition to his intellectual capacity and sharpness, they emphasised his willpower and work ability, which, among other things, showed itself in the laborious and complicated calculations which he quickly perceived as challenges. He asserted strongly the demand for freedom of thought and expression. The truth must be sought unconditionally. As an academic teacher, Oseen was inspiring through his engaging and interesting lectures.\nIn\n1982\n, the\nRoyal Swedish Academy of Sciences\ninaugurated a medal, designed by the sculptor Léo Holmgren and dedicated to the memory of Oseen. The medal's inscription was\nArcana umorum revelavit anisotropicorum\nⓉ\n(\nHe revealed the secrets of the anisotropic liquids\n)\n.",
  "matematicos_citados_na_biografia": [
    "Victor Bäcklund",
    "Bäcklund",
    "David Hilbert",
    "Hilbert",
    "Felix Klein",
    "Helmholtz",
    "C Runge",
    "Doppler",
    "Rankine",
    "Lie",
    "Scheffers",
    "Engel",
    "Ludwig Prandtl",
    "H A Lorentz",
    "Lorentz",
    "Stokes",
    "THIS LINK",
    "Niels Bohr",
    "Bohr",
    "Royal Swedish Academy of Sciences",
    "Albert Einstein",
    "Einstein",
    "Ivar Bendixson",
    "Helge von Koch",
    "Mittag-Leffler",
    "G H Hardy",
    "G Mittag-Leffler",
    "Theodore von Kármán",
    "Tullio Levi-Civita",
    "Plato",
    "Ernst Lindelöf"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}