{
  "nome_completo": "Calyampudi Radhakrishna Rao",
  "nome_curto": "Calyampudi Radhakrishna Rao",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rao/",
  "data_nascimento": "10 September 1920",
  "local_nascimento": "Hoovinna Hadagali, Karnataka State, India",
  "data_morte": "22 August 2023",
  "local_morte": "Buffalo, New York, USA",
  "summary": "C R Rao is an Indian-born mathematician and statistician who has worked most of his life in America. His statistical work has been applied in many fields.",
  "biografia": "Calyampudi Radhakrishna Rao\n's parents were C Daraiswamy Naidu\n(1879\n-\n1940)\n, a police inspector, and A Laxmikanthamma. He was the eighth of his parents' ten children, two of whom died as infants. We should explain that the name Rao is part of his given name - in fact all the male children in his family were named Rao. His other given name Radhakrishna comes from the god Krishna\n(\nwho was the eighth of his parents children and, for that reason, the custom was to name the eighth child after Krishna\n)\n. Only the boys in the family were given a school education, as was the tradition at the time, but this was rather disrupted by frequent moves that the family made as their father was transferred from one place to another. Calyampudi Radhakrishna completed his first two years schooling in Gudur, his next two in Nuzvid, and then grades\n6\nand\n7\nin Nandigama, all towns in the state of Andhra Pradesh. During these years CR, as we will call Calyampudi Radhakrishna Rao throughout this biography, saw little of his father who was totally absorbed in his work but his mother was a major influence\n[\n11\n]\n:-\n... in my younger days,\n[\nmy mother\n]\nwoke me up every day at four in the morning and lit the oil lamp for me to study in the quiet hours of the morning when the mind is fresh.\nIn\n1931\nCR's father retired and the family settled down in Visakhapatnam, on the coast of Andhra Pradesh. The family chose this city because of the excellent educational facilities that were available there for their children. CR studied there for ten years, first at high school, then mathematics, physics, and chemistry at the intermediate Mrs A V N College before attending Andhra University. At the intermediate college he won the Chandrasekara Iyer Scholarship in each of his two years. The School Magazine for\n1935\npublished his picture with the caption:-\nC Radhakrishna Rao who has won the Chandrasekara Scholarship this year. He has had the unique distinction of knocking off the most coveted prizes throughout his school career.\nCR spoke in the interview\n[\n5\n]\nabout the influence of his father:-\nWhen I was\n11\n, I could do complicated arithmetical problems without paper and pencil. My father appreciated my interest in mathematics and my good performance in school, and he thought that I should eventually get a degree in mathematics and proceed to do research to get a doctorate degree. He presented me with a book called 'Problems for Leelavathi', a collection of problems set by a mathematician for his daughter Leelavathi to solve. He asked me to work out\n5\nto\n10\nproblems in the book every day. I enjoyed solving these problems, which aroused further interest in me to pursue mathematics. Thus, my entry into mathematics resulted from the encouragement I received from my father and my own interest in solving mathematical problems.\nHe graduated M.A. with First Class Honours in Mathematics from Andhra University in\n1940\n. He applied for a research scholarship from Andhra University but his application was rejected on the grounds that it had been received after the deadline. At this stage, encouraged by his family, he decided to sit the competitive Indian Civil Service examinations but, being only twenty years old, he had to wait eighteen months before being allowed to take the examinations. He applied for job as a mathematician in an army survey unit to fill out the time before taking the Civil Service examinations. He was called to Calcutta for an interview but failed to get the job. However, this was a turning point for CR, for he stayed in the South Indian Hotel before his interview and there he met a young man who was being trained in statistics at the Indian Statistical Institute. CR had taken a course on\nprobability\nwhile studying for his Master's degree at Andhra University but he had never heard of the Indian Statistical Institute. The young man took CR to visit the Institute, at that time located in the Physics Department of Presidency College. It seemed to provide both a job and a chance to test whether he would like research so CR applied for the one-year training course in statistics.\nThe family were in some financial difficulties by this time since CR's father had died in the previous year. However, one of his brothers and his mother managed to finance him through the year at the Institute. The training course was rather a disappointment, taught by people with little understanding of statistical theory. However, there was the head of the Institute\nP C Mahalanobis\n, as well as other top researchers working at the Institute such as K Raghavan Nair, Samarendra Nath Roy and\nRaj Chandra Bose\n. CR began undertaking research with Nair and they published a joint paper\nConfounded designs for asymmetrical factorial experiments\n(1941)\n. In the following year he published six papers, four of them joint publications with Nair, for example\nA general class of quasi-factorial designs leading to confounded designs for factorial experiments\nand\nA note on partially balanced incomplete block designs\n.\nA few months after he began training at the Indian Statistical Institute, Calcutta University announced a new Master's degree in statistics. Lecturers at the University were the same statisticians working at the Institute and he took courses from K Raghavan Nair, Samarendra Nath Roy and\nRaj Chandra Bose\n. He was awarded the degree in\n1943\nwith First Class and the gold medal. His thesis was a major piece of work in four areas: the design of experiments, linear models, multivariate analysis, and the characterization of probability distributions. These would be the topics he continued to study throughout his career. As well as research in statistics, CR began to look at combinatorial problems with\nR C Bose\nand number theory problems with Sarvadaman Chowla.\nCR was appointed as a Technical Apprentice at the Indian Statistical Institute beginning in November\n1943\nand, a few months later, in June\n1944\n, he also worked as a part-time lecturer at Calcutta University. By the end of\n1946\nhe had over thirty papers in print\n[\n5\n]\n:-\nI continued my research on combinatorics with reference to design of experiments and wrote a number of papers, some jointly with\nR C Bose\nand S D Chowla. I developed a general theory of least squares without any assumptions on the concomitant variables. I found a test for redundancy of a specified set of variables in multivariate analysis.\nThe most significant result CR obtained during this period is now called the\nCramér\n-Rao inequality and gives a bound for the variance of an unbiased estimate of a parameter. It appears in his paper\nInformation and accuracy attainable in the estimation of statistical parameters\n(1945)\n. The significance of this paper can be seen from the fact that it was republished in S Kotz and N Johnson\n(\neds.\n)\n,\nBreakthroughs in Statistics:\n1889\n-\n1990\n(\nSpringer Verlag, New York, Berlin,\n1991)\n. In August\n1946\nCR boarded a ship sailing from Calcutta to England. He had been offered a position undertaking statistical work at the Anthropological Museum in Cambridge and he also registered as a research student at Cambridge University. His Ph.D. studies at King's College, Cambridge, were supervised by\nR A Fisher\n. CR worked at the Anthropological Museum every day and every evening he spent a few hours in\nFisher\n's genetics laboratory mapping the chromosomes of thousands of live mice. While at Cambridge CR wrote his influential paper\nLarge sample tests of statistical hypotheses concerning several parameters with applications to problems of estimation\nwhich was published in the Proceedings of the Cambridge Philosophical Society in\n1948\n. He was awarded his doctorate in\n1948\nfor his thesis\nStatistical Problems of Biological Classification\nwhich was examined by\nJohn Wishart\n.\nHe returned to Calcutta in August to his post at the Indian Statistical Institute. Soon after arriving, on\n9\nSeptember\n1948\n, he married Smt Bhargavi, a girl he had known from childhood; they had a daughter Tejaswini and a son Veerendra. CR was appointed as a Superintending Statistician on his return but a major grant to the Institute from the Indian government allowed the Institute to set up a Research and Training School and appoint professors, assistant professors and other academic grades. Those senior to CR,\nR C Bose\nand A Bhattacharya, left the Institute around this time. S N Roy was appointed to a professorship and CR to an assistant professorship. However, Roy left for the United States soon after his appointment and CR became a professor in July\n1949\nat the young age of\n28\n. The Institute was given authority to award its own degrees in\n1959\nand started up its own undergraduate programme. Being understaffed CR found himself doing quite a bit of undergraduate teaching but found that a rewarding experience. In\n1964\nhe became the director of the Research and Training School, and then in\n1972\nhe was appointed Director-Secretary of the Indian Statistical Institute. He was named Jawaharlal Nehru Professor in\n1976\n.\nLet us now look at some of the highly influential books CR has published. The first was\nAdvanced statistical methods in biometric research\n(1952)\nwhich he began writing while working for his doctorate at Cambridge. His aim, stated in the Preface, is:-\n... to present a number of statistical techniques, keeping in view the requirements of both the student who questions the basis of a particular method employed and the practical worker who seeks a recipe for the reduction of his data.\nHis next book\nLinear statistical inference and its applications\n(1965)\nwas more mathematical, and designed to be used for mathematical statistics courses in universities. He published\nComputers and the Future of Human Society\nin\n1970\n, and in the following year, jointly with Sujit Kumar Mitra, he published\nGeneralized inverse of matrices and its applications\n. R J Plemmons explains that they:-\n... present a general unified treatment of the concept of inversability of singular, and in general rectangular, matrices over the complex field. ... the material should make a good text for a one term course in matrix algebra or mathematical statistics.\nFurther books followed such as\nCharacterization Problems of Mathematical Statistics\n(\nRussian edition\n1972\n, English translation\n1973)\nwith A Kagan and\nYu V Linnik\n.\nIn\n1979\nCR left the Indian Statistical Institute, just before reaching the mandatory retirement age of sixty, and went to the United States where he was appointed to a University Professorship at the University of Pittsburgh. In\n1988\nhe moved to Pennsylvania State University in Pittsburgh where he was named Eberly Family Professor in Statistics. After retiring he became Emeritus Eberly Professor.\nBooks he published after moving to the United States include:\n(\nwith J Kleffe\n)\nEstimation of variance components and applications\n(1988)\n,\nStatistics and truth. Putting chance to work\n(1989)\n,\n(\nwith D N Shanbhag\n)\nChoquet-Deny type functional equations with applications to stochastic models\n(1994)\n,\n(\nwith H Toutenburg\n)\nLinear models. Least squares and alternatives\n(1995)\n, and\n(\nwith M B Rao\n)\nMatrix algebra and its applications to statistics and econometrics\n(1998)\n.\nC R Rao has received so many honours that it would be quite impossible to list them all. Here is a selection to give an impression of the high esteem that he is held in throughout the world. First we list some of the prizes and awards he has received: the S S Bhatnagar Prize of Council of Scientific and Industrial Research\n(1963)\n, the Guy Medal in Silver of the\nRoyal Statistical Society\n(1965)\n, awarded the title of Padma Bhushan by the Indian Government\n(1968)\n, received the Megnadh Saha Medal of the\nIndian National Science Academy\n(1969)\n, the Jagdish Chandra Bose Gold Medal of the Bose Institute\n(1979)\n, the Silver Plate of the Andhra Pradesh Academy of Sciences\n(1984)\n, The Times of India listed Rao as one of the top\n10\nIndian scientists of all time\n(1988)\n, awarded the\nSamuel S Wilks\nMemorial Award of the\nAmerican Statistical Association\n(1989)\n:-\nFor major contributions to the theory of multivariate statistics and applications of that theory to problems of biometry; for world wide activities as advisor to national and international organizations; for long time conscientious as a teacher, editor, author and founder of academic institutions; and for the great influence he has had on the applications of statistical thinking in different scientific disciplines, embodying over a career of more than\n40\nyears the spirit and ideals of\nSamuel S Wilks\n.\nOther awards include: the Mahalanobis Birth Centenary Gold Medal by the Indian Science Congress\n(1996)\n, the Distinguished Achievement Medal from the\nAmerican Statistical Association\n(1997)\n:-\n... for outstanding contributions to the development of methods, issues, concepts, and applications of environmental statistics ...\nthe Padma Vibhushan by the Government of India\n(2001)\n, the National Medal of Science\n(2002)\n, presented by President George W Bush on\n12\nJune at a ceremony in the White House:-\n... for his pioneering contributions to the foundations of statistical theory and multivariate statistical methodology and their applications, enriching the physical biological, mathematical, economic and engineering sciences ...\nthe\nSrinivasa Ramanujan\nMedal of the\nIndian National Science Academy\n(2003)\n, the International Mahalanobis Prize of the International Statistical Institute\n(2003)\n, and the Guy Medal in Gold of the\nRoyal Statistical Society\n(2011)\n:-\nIn the\n115\n-year history of\nRoyal Statistical Society\n, he is the\n34\nth\nrecipient of the award. He is the first Asian, first non-European and first non-American to receive the award.\nHe has been elected to the\nRoyal Society of London\n(1967)\n, the\nNational Academy of Sciences, USA\n(1995)\n, the\nAmerican Academy of Arts and Science\n, the\nIndian National Science Academy\n, the\nLithuanian Academy of Sciences\n, and the Third World Academy of Sciences. He was made an Honorary Member of the International Statistical Institute\n(1983)\n, the International Biometric Society\n(1986)\n, the\nRoyal Statistical Society\n(1969)\n, the\nFinnish Statistical Society\n(1990)\n, the Portuguese Statistical Society, the Institute of Combinatorics and Applications, and the World Innovation Foundation.\nHe has been awarded thirty-three honorary degrees by universities in eighteen countries, in six continents, including: Andhra University, India\n(1967)\n, Leningrad University, USSR\n(1970)\n, Delhi University, India\n(1973)\n, University of Athens, Greece\n(1976)\n, Osmania University, Hyderabad, India\n(1977)\n, Ohio State University, Columbus, USA\n(1979)\n, Universidad Nacional de San Marcos, Lima, Peru\n(1982)\n, University of the Philippines, Manila\n(1983)\n, University of Tampere, Finland\n(1985)\n, Indian Statistical Institute, India\n(1989)\n, Université de Neuchâtel, Switzerland\n(1989)\n, Colorado State University, Fort Collins, USA\n(1990)\n, University of Hyderabad, India\n(1991)\n, Agricultural University of Poznań, Poland\n(1991)\n, Slovak Academy of Sciences, Bratislava, Slovakia\n(1994)\n, University of Barcelona, Spain\n(1995)\n, University of Munich, Germany\n(1995)\n, Sri Venkateswara University, Tirupati, India\n(1996)\n, University of Guelph, Canada\n(1996)\n, University of Calcutta, India\n(2003)\n, University of Pretoria, South Africa\n(2004)\n, University of Rhode Island, Kingston, USA\n(2007)\n, and Jawaharlal Nehru Technological University, Kakinada, India\n(2011)\n.\nThe Journal of Quantitative Economics published a special issue in Rao's honour in\n1991\n. The preface gives the following tribute:-\nDr Rao is a very distinguished scientist and a highly eminent statistician of our time. His contributions to statistical theory and applications are well known, and many of his results, which bear his name, are included in the curriculum of courses in statistics at bachelor's and master's level all over the world. He is an inspiring teacher and has guided the research work of numerous students in all areas of statistics. His early work had greatly influenced the course of statistical research during the last four decades. One of the purposes of this special issue is to recognize Dr Rao's own contributions to econometrics and acknowledge his major role in the development of econometric research in India.\nC R Rao has served as president of five statistical societies: the Indian Econometric Society\n(1971\n-\n1976)\n; the International Biometric Society\n(1973\n-\n1975)\n; the Institute of Mathematical Statistics\n(1976\n-\n1977)\n; the International Statistical Institute\n(1977\n-\n1979)\n, and the Forum for Interdisciplinary Mathematics\n(1982\n-\n1984)\n.\nFinally we record that CR has many hobbies such as gardening, photography, cooking, and Indian classical dance. In Calcutta he played soccer and badminton with staff and students in the evenings. In the United Sates his relaxation is walking.",
  "matematicos_citados_na_biografia": [
    "probability",
    "P C Mahalanobis",
    "Raj Chandra Bose",
    "R C Bose",
    "Cramér",
    "R A Fisher",
    "Fisher",
    "John Wishart",
    "Yu V Linnik",
    "Royal Statistical Society",
    "Indian National Science Academy",
    "Samuel S Wilks",
    "American Statistical Association",
    "Srinivasa Ramanujan",
    "Royal Society of London",
    "National Academy of Sciences, USA",
    "American Academy of Arts and Science",
    "Lithuanian Academy of Sciences",
    "Finnish Statistical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}