{
  "nome_completo": "Marie Ennemond Camille Jordan",
  "nome_curto": "Camille Jordan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jordan/",
  "data_nascimento": "5 January 1838",
  "local_nascimento": "La Croix-Rousse, Lyon, France",
  "data_morte": "22 January 1922",
  "local_morte": "Paris, France",
  "summary": "Camille Jordan was highly regarded by his contemporaries for his work in algebra, group theory and Galois theory.",
  "biografia": "Camille Jordan\n's father, Esprit-Alexandre Jordan\n(1800\n-\n1888)\n, was an engineer who had been educated at the École Polytechnique. Camille's mother, Joséphine Puvis de Chavannes, was the sister of the famous painter Pierre Puvis de Chavannes who was the foremost French mural painter of the second half of the\n19\nth\ncentury. Camille's father's family were also quite well known; a grand-uncle also called Ennemond-Camille Jordan\n(1771\n-\n1821)\nachieved a high political position while a cousin Alexis Jordan\n(1814\n-\n1897)\nwas a famous botanist.\nJordan studied at the Lycée de Lyon and at the Collège d'Oullins. He entered the École Polytechnique to study mathematics in\n1855\n. This establishment provided training to be an engineer and Jordan, like many other French mathematicians of his time, qualified as an engineer and took up that profession.\nCauchy\nin particular had been one to take this route and, like\nCauchy\n, Jordan was able to work as an engineer and still devote considerable time to mathematical research. Jordan's doctoral thesis was in two parts with the first part\nSur le nombre des valeurs des fonctions\nⓉ\n(\nOn the number of function values\n)\nbeing on algebra. The second part entitled\nSur des periodes des fonctions inverses des intégrales des différentielles algebriques\nⓉ\n(\nOn the periods of inverse functions of the integrals of algebraic differentials\n)\nwas on integrals of the form\n∫\nu\nd\nz\n\\int   u dz\n∫\nu\nd\nz\nwhere\nu\nu\nu\nis a function satisfying an algebraic equation\nf\n(\nu\n,\nz\n)\n=\n0\nf (u, z) = 0\nf\n(\nu\n,\nz\n)\n=\n0\n. Jordan was examined on\n14\nJanuary\n1861\nby\nDuhamel\n,\nSerret\nand\nPuiseux\n. In fact the topic of the second part of Jordan's thesis had been proposed by\nPuiseux\nand it was this second part which the examiners preferred. After the examination he continued to work as an engineer, first at Privas, then at Chalon-sur-Saône, and finally in Paris.\nJordan married Marie-Isabelle Munet, the daughter of the deputy mayor of Lyon, in\n1862\n. They had eight children, two daughters and six sons.\nFrom\n1873\nhe was an examiner at the École Polytechnique where he became professor of analysis on\n25\nNovember\n1876\n. He was also a professor at the Collège de France from\n1883\nalthough until\n1885\nhe was at least theoretically still an engineer by profession. It is significant, however, that he found more time to undertake research when he was an engineer. Most of his original research dates from this period.\nJordan was a mathematician who worked in a wide variety of different areas essentially contributing to every mathematical topic which was studied at that time. The references\n[\n3\n]\n,\n[\n4\n]\n,\n[\n5\n]\n,\n[\n6\n]\nare to the four volumes of his complete works and the range of topics is seen from the contents of these. Volumes\n1\nand\n2\ncontain Jordan's papers on finite groups, Volume\n3\ncontains his papers on linear and multilinear algebra and on the theory of numbers, while Volume\n4\ncontains papers on the topology of polyhedra, differential equations, and mechanics.\nTopology\n(\ncalled\nanalysis situs\nat that time\n)\nplayed a major role in some of his first publications which were a combinatorial approach to symmetries. He introduced important topological concepts in\n1866\nbuilt on his knowledge of\nRiemann\n's work in topology but not the work by\nMöbius\nfor he was unaware of it. Jordan introduced the notion of\nhomotopy\nof paths looking at the deformation of paths one into the other. He defined a homotopy group of a surface without explicitly using\ngroup\nterminology.\nJordan was particularly interested in the theory of finite groups. In fact this is not really an accurate statement, for it would be reasonable to argue that before Jordan began his research in this area there was no theory of finite groups. It was Jordan who was the first to develop a systematic approach to the topic. It was not until\nLiouville\nrepublished\nGalois\n's original work in\n1846\nthat its significance was noticed at all.\nSerret\n,\nBertrand\nand\nHermite\nhad attended\nLiouville\n's lectures on\nGalois theory\nand had begun to contribute to the topic but it was Jordan who was the first to formulate the direction the subject would take.\nTo Jordan a group was what we would call today a\npermutation group\n; the concept of an abstract group would only be studied later. To give an illustration of the way he tried to build up groups theory we will say a little about his contributions to finite soluble groups. The standard way to define such groups today would be to say that they are groups whose composition factors are abelian groups. Indeed Jordan introduced the concept of a composition series\n(\na series of subgroups each normal in the preceding with the property that no further terms could be added to the series so that it retains that property\n)\n. The composition factors of a group\nG\nG\nG\nare the groups obtained by computing the factor groups of adjacent groups in the composition series. Jordan proved the Jordan-\nHölder\ntheorem, namely that although groups can have different composition series, the set of composition factors is an invariant of the group.\nAlthough the classification of finite abelian groups is straightforward, the classification of finite soluble groups is well beyond mathematicians today and for the foreseeable future. Jordan, however, clearly saw this as an aim of the subject, even if it was not one which might ever be solved. He made some remarkable contributions to how such a classification might proceed setting up a recursive method to determine all soluble groups of order\nn\nn\nn\nfor a given\nn\nn\nn\n.\nA second major piece of work on finite groups was the study of the general linear group over the field with\np\np\np\nelements,\np\np\np\nprime. He applied his work on classical groups to determine the structure of the\nGalois group\nof equations whose roots were chosen to be associated with certain geometrical configurations.\nHis work on group theory done between\n1860\nand\n1870\nwas written up into a major text\nTraité des substitutions et des équations algebraique\nⓉ\n(\nTreatise on substitutions and algebraic equations\n)\nwhich he published in\n1870\n. This treatise gave a comprehensive study of\nGalois theory\nas well as providing the first ever group theory book. For this work he was awarded the\nPoncelet\nPrize of the\nAcadémie des Sciences\n. The treatise contains the 'Jordan normal form' theorem for matrices, not over the complex numbers but over a finite field. He appears not to have known of earlier results of this type by\nWeierstrass\n. His book brought permutation groups into a central role in mathematics and, until Burnside wrote his famous group theory text nearly\n30\nyears later, this work provided the foundation on which the whole subject was built. It would also be fair to say that group theory was one of the major areas of mathematical research for\n100\nyears following Jordan's fundamental publication.\nJordan's use of the group concept in geometry in\n1869\nwas motivated by studies of crystal structure. He considered the classification of groups of Euclidean motions. His work had gained him a wide international reputation and both\nSophus Lie\nand\nFelix Klein\nvisited him in Paris in\n1870\nto study with him. Jordan's interest in groups of Euclidean transformations in three dimensional space influenced\nLie\nand\nKlein\nin their own theories of continuous and discontinuous groups.\nThe publication of\nTraité des substitutions et des équations algebraique\nⓉ\n(\nTreatise on substitutions and algebraic equations\n)\ndid not mark the end of Jordan's contribution to group theory. He went on over the next decade to produce further results of fundamental importance. He studied primitive permutation groups and proved a finiteness theorem. He defined the class of a subgroup of the symmetric group to be\nc\n>\n1\nc > 1\nc\n>\n1\nif\nc\nc\nc\nwas the smallest number such that the subgroup had an element moving\nc\nc\nc\npoints. His finiteness theorem showed that for a given\nc\nc\nc\nthere are only finitely many primitive groups with class\nc\nc\nc\nother than the symmetric and alternating groups.\nGeneralising a result of\nFuchs\non linear differential equations, Jordan was led to study the finite subgroups of the general linear group of\nn\n×\nn\nn \\times  n\nn\n×\nn\nmatrices\nover the complex numbers. Although there are infinite families of such finite subgroups, Jordan found that they were of a very specific group theoretic structure which he was able to describe.\nAnother generalisation, this time of work by\nHermite\non quadratic forms with integral coefficients, led Jordan to consider the special linear group of\nn\n×\nn\nn \\times  n\nn\n×\nn\nmatrices of determinant\n1\nover the complex numbers acting on the vector space of complex polynomials in\nn\nn\nn\nindeterminates of degree\nm\nm\nm\n.\nJordan is best remembered today among analysts and topologists for his proof that a simply closed curve divides a plane into exactly two regions, now called the\nJordan curve theorem\n. It was only his increased understanding of mathematical rigour which made him realise that a proof of such a result was necessary. He also originated the concept of functions of bounded variation and is known especially for his definition of the length of a curve. These concepts appears in his\nCours d'analyse de l'École Polytechnique\nfirst published in three volumes between\n1882\nand\n1887\n. The second edition appeared in\n1893\nwhile the Jordan curve theorem appeared in the third edition of the text which appeared between\n1909\nand\n1915\n.\nOf course by\n1882\n, when the first volume was published, Jordan was lecturing at the École Polytechnique and the book was written as a text for the students there. In some respects this is a little strange since it is a rigorous analysis text built on top of the attempts to put the topic on a firm foundation begun by\nCauchy\nand given considerable impetus by\nWeierstrass\n. However, the courses at the École Polytechnique were supposed to train students to become civil and military engineers and this does not seem to be the approach which one would take trying to teach applications of the calculus to engineers. There had been a tradition of rigorous analysis at the École Polytechnique begun, of course, by\nCauchy\nhimself. Jordan was aware that his work was at a level that would be somewhat inappropriate for engineering students for he once said to\nLebesgue\nthat he called it \"École Polytechnique analysis course\" since:-\n... one puts that on the cover to please the publisher...\nGispert-Chambaz in\n[\n7\n]\ncontrasts the way that topological concepts are treated by Jordan in the first and second editions of the book. In the first edition most of the topological concepts are dealt with in a supplement to Volume\n3\n. However between the editions Jordan had taught more advanced courses on analysis at the Collège de France and this may have influenced him to put set topology right up front in the second edition. In this respect one can see the second edition as setting a tone for analysis textbooks which continues today.\nAmong Jordan's many contributions to analysis we should also mention his generalisation of the criteria for the convergence of a\nFourier series\n.\nThe\nJournal de Mathématiques Pure et Appliquées\nwas a leading mathematical journal and played a very significant part in the development of mathematics throughout the\n19\nth\ncentury. It was usually known as the\nJournal de Liouville\nsince\nLiouville\nhad founded the journal in\n1836\n.\nLiouville\ndied in\n1882\nand in\n1885\nJordan became editor of the Journal, a role he kept for over\n35\nyears until his death.\nIn\n1912\nJordan retired from his positions. The final years of his life were saddened, however, because of World War I which began in\n1914\n. Between\n1914\nand\n1916\nthree of his six sons were killed in the war. Of his three remaining sons, Camille was a government minister, Édouard was a professor of history at the Sorbonne, and the third son was an engineer.\nAmong the honours given to Jordan was his election to the\nAcadémie des Sciences\non\n4\nApril\n1881\n. On\n12\nJuly\n1890\nhe became an officer of the Légion d'Honneur. He was the Honorary President of the International Congress of Mathematicians at Strasbourg in September\n1920\n.\nFinally we should note some rather confusing facts. Although given Jordan's work on matrices and the fact that the\nJordan normal form\nis named after him, the\nGauss\n-Jordan pivoting elimination method for solving the matrix equation\nA\nx\n=\nb\n\\bf{A}\\bf{x}= \\bf{b}\nA\nx\n=\nb\nis not. The Jordan of\nGauss\n-Jordan is Wilhelm Jordan\n(1842\nto\n1899)\nwho applied the method to finding squared errors to work on surveying.\nJordan algebras\nare called after the German physicist and mathematician\nPascual Jordan\n(1902\nto\n1980)\n.",
  "matematicos_citados_na_biografia": [
    "Cauchy",
    "Duhamel",
    "Serret",
    "Puiseux",
    "Topology",
    "Riemann",
    "Möbius",
    "homotopy",
    "group",
    "Liouville",
    "Galois",
    "Bertrand",
    "Hermite",
    "Galois theory",
    "permutation group",
    "Hölder",
    "Galois group",
    "Poncelet",
    "Académie des Sciences",
    "Weierstrass",
    "Sophus Lie",
    "Felix Klein",
    "Lie",
    "Klein",
    "Fuchs",
    "matrices",
    "Lebesgue",
    "Fourier series",
    "Gauss",
    "Pascual Jordan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}