{
  "nome_completo": "Carl Wilhelm Borchardt",
  "nome_curto": "Carl Borchardt",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borchardt/",
  "data_nascimento": "22 February 1817",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "27 June 1880",
  "local_morte": "Rudersdorf (near Berlin), Germany",
  "summary": "Carl Borchardt was a German mathematician who worked in a variety of areas in analysis. He edited Crelle's Journal for more than 30 years.",
  "biografia": "Carl Borchardt\nwas born into a Jewish family. His father, Moritz Borchardt, was a merchant who was very well off and a very respected member of the community. Carl's mother was Emma Heilborn. He was tutored privately by a number of outstanding tutors, the best known of whom were\nPlücker\nand\nSteiner\n. He studied at Berlin from\n1836\nunder\nDirichlet\nthen, in\n1839\n, he went to Königsberg and studied under\nBessel\n,\nFranz Neumann\nand\nJacobi\n. Certainly Borchardt was impressed with\nFranz Neumann\nand, much later, he was one of three mathematicians who proposed\nFranz Neumann\nfor external membership of the\nBerlin Academy\nin\n1853\n.\nBorchardt's doctoral work, on non-linear\ndifferential equations\n, was supervised by\nJacobi\nand submitted in\n1843\n. However, the thesis was not published and has since been lost.\nJacobi\nwas in poor health and it was agreed that he could spend a year in Italy convalescing. He went with Borchardt and they spent time in both Rome and Naples.\nDirichlet\nand\nSteiner\nwere also in Rome at the same time and it proved a useful time for Borchardt. The year\n1846\n-\n47\nhe spent in Paris where he met\nChasles\n,\nHermite\nand\nLiouville\n. He attended a course by\nLiouville\non doubly periodic functions and although\nLiouville\nintended to publish the notes which Borchardt took of his lectures, in the end they were not published due to a priority dispute between\nLiouville\nand\nHermite\n. Borchardt married Rosa Oppenheim and recently there has been speculation that after Borchardt's death, Rosa had a child with\nWeierstrass\n.\nBorchardt taught at the University of Berlin from\n1848\nwhen he was appointed as a\nPrivatdozent\n. He quickly became a close personal friend of\nWeierstrass\nand was one of the privileged few, along with\nSofia Kovalevskaya\n, whom\nWeierstrass\naddressed with the familiar 'Du' form. He succeeded\nCrelle\nas editor of\nCrelle\n's Journal in\n1856\n, a task he undertook until\n1880\ndespite not being in very good health. The correct title of the Journal was the\nJournal für die Reine und Angewandte Mathematik\nⓉ\n(\nJournal of Pure and Applied Mathematics\n)\nbut it had been known as\nCrelle\n's Journal up to the time Borchardt took over as editor. The journal was then often referred to as \"Borchardt's Journal\" or in France as \"Journal de M Borchardt\". After Borchardt's death, the\nJournal für die Reine und Angewandte Mathematik\nagain became known as\nCrelle\n's Journal.\nHe did important research on the arithmetic geometric mean continuing work in this area which had been begun by\nGauss\nand\nLagrange\n. In\n1881\nBorchardt published an algorithm for the arithmetic-geometric mean of two elements from\n(\ntwo\n)\nsequences, although it was actually first proposed by\nGauss\nin a letter to\nPfaff\nwritten in\n1800\n. Although\nGauss\n's letter is lost we know its contents through\nPfaff\n's reply which was published in\nGauss\n's\nComplete Works\nand indicates that\nGauss\nhad discovered the result. From this\n1881\npaper by Borchardt the name \"Borchardt algorithms\" has come into use to describe algorithms of this type.  Borchardt also generalised results of\nKummer\non equations determining the secular disturbances of the planets. A secular disturbance is one which is not periodic, but continually acts in the same direction. In fact this was his first contribution and was published in his first paper of\n1846\n. In this work he used\ndeterminants\nand\nSturm\nfunctions\n[\n1\n]\n:-\nIn several further papers Borchardt applied the theory of determinants to algebraic equations, mostly in connection with symmetric functions, the theory of elimination, and interpolation.\nAfter\nJacobi\n's death there was considerable speculation as to the exact role he had played in the theory of\nelliptic functions\n. This was partially answered when\nJacobi\n's letters to\nLagrange\nwere published by\nBertrand\nin\n1869\nbut the position was still somewhat confused as the letters from\nLagrange\nto\nJacobi\nwere not included in this work. Borchardt completed publishing the remaining parts of the correspondence in\n1875\nand\nJacobi\nwas then able to get full recognition for his contributions to the theory of elliptic functions made independent of those of\nAbel\n. Borchardt contributed to spreading the mathematical ideas introduced by\nJacobi\nbut he also spread\nJacobi\n's ideas on the way that universities should be organised, namely in a research oriented way.\nBorchardt's complete works, published in\n1888\n, contains\n25\npapers and, in addition to the topics discussed above, contains papers on maxima and on the theory of elasticity. Finally we note that the first of the eight volumes of\nJacobi\n's\nCollected Works\nwas edited by Borchardt and published in\n1881\n. Borchardt died before being able to edit further volumes which were edited by\nWeierstrass\n.",
  "matematicos_citados_na_biografia": [
    "Plücker",
    "Steiner",
    "Dirichlet",
    "Bessel",
    "Franz Neumann",
    "Jacobi",
    "Berlin Academy",
    "differential equations",
    "Chasles",
    "Hermite",
    "Liouville",
    "Weierstrass",
    "Privatdozent",
    "Sofia Kovalevskaya",
    "Crelle",
    "Gauss",
    "Lagrange",
    "Pfaff",
    "Kummer",
    "determinants",
    "Sturm",
    "elliptic functions",
    "Bertrand",
    "Abel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}