{
  "nome_completo": "Carl Gustav Jacob Jacobi",
  "nome_curto": "Carl Jacobi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jacobi/",
  "data_nascimento": "10 December 1804",
  "local_nascimento": "Potsdam, Prussia (now Germany)",
  "data_morte": "18 February 1851",
  "local_morte": "Berlin, Germany",
  "summary": "Carl Jacobi made basic contributions to the theory of elliptic functions. He carried out important research in partial differential equations of the first order and applied them to the differential equations of dynamics.",
  "biografia": "Carl Jacobi\ncame from a Jewish family but he was given the French style name Jacques Simon at birth. His father, Simon Jacobi, was a banker and his family were prosperous. Carl was the second son of the family, the eldest being Moritz Jacobi who eventually became a famous physicist. Moritz Jacobi has an entry in his own right in\n[\n1\n]\n. There was a sister, Therese Jacobi, and a third brother, Eduard Jacobi, who was younger than Carl. Eduard did not pursue an academic career, but followed instead his father's profession as a banker.\nJacobi's early education was given by an uncle on his mother's side, and then, just before his twelfth birthday, Jacobi entered the\nGymnasium\nin Potsdam. He had been well taught by his uncle and he had remarkable talents so in\n1817\n, while still in his first year of schooling, he was put into the final year class. This meant that by the end of the academic year\n1816\n-\n17\nhe was still only\n12\nyears old yet he had reached the necessary standard to enter university. The University of Berlin, however, did not accept students below the age of\n16\n, so Jacobi had to remain in the same class at the Gymnasium in Potsdam until the spring of\n1821\n.\nOf course, Jacobi pressed on with his academic studies despite remaining in the same class at school. He received the highest awards for Latin, Greek and history but it was the study of mathematics which he took furthest. By the time Jacobi left school he had read advanced mathematics texts such as\nEuler\n's\nIntroductio in analysin infinitorum\nⓉ\n(\nIntroduction to infinitesimal analysis\n)\nand had been undertaking research on his own attempting to solve\nquintic equations\nby\nradicals\n.\nJacobi entered the University of Berlin in\n1821\nstill unsure which topic he would concentrate on. He attended courses in philosophy, classics and mathematics for two years before realising that he had to make a definite decision between these subjects. He chose mathematics, but this did not mean that he could attend high level courses in mathematics for at this time the standard of university education in mathematics in Germany was rather poor. As he had done at the Gymnasium, Jacobi had to study on his own reading the works of\nLagrange\nand other leading mathematicians.\nBy the end of academic year\n1823\n-\n24\nJacobi had passed the examinations necessary for him to be able to teach mathematics, Greek, and Latin in secondary schools. Of course, one might have expected him to have problems obtaining a teaching position since, as we noted at the beginning of this article, he was Jewish. His brilliance appears to have been sufficient to allow this hurdle to be overcome for, in\n1825\n, he was offered a teaching post at the Joachimsthalsche Gymnasium, one of the leading schools in Berlin. He had submitted his doctoral dissertation to the University of Berlin even before he received the offer of the teaching post, and he was allowed to move quickly to work on his\nhabilitation\nthesis.\nJacobi presented a paper concerning iterated functions to the\nBerlin Academy of Sciences\nin\n1825\n. However, the referees did not consider the results worth publishing and indeed the paper was not published by the\nBerlin Academy\n. The paper was published eventually, for in\n1961\nit was published with a commentary in\n[\n6\n]\n. Biermann, the author of\n[\n6\n]\n, quotes the opinions of the original referees and criticises them strongly. Although this was not the best start for the young Jacobi, it did not hold him back for long and his publication record over the following years would be quite remarkable for both the number and quality of the works.\nAround\n1825\nJacobi changed from the Jewish faith to become a Christian which now made university teaching possible for him. By the academic year\n1825\n-\n26\nhe was teaching at the University of Berlin. However prospects in Berlin were not good so, after taking advice from colleagues, Jacobi moved to the University of Königsberg arriving there in May\n1826\n. There he joined\nFranz Neumann\n, who had also received his doctorate from Berlin in\n1825\n, and\nBessel\nwho was the professor of astronomy at Königsberg.\nJacobi had already made major discoveries in\nnumber theory\nbefore arriving in Königsberg. He now wrote to\nGauss\nto tell him of the results on cubic residues which he had obtained, having been inspired by\nGauss\n's results on\nquadratic\nand\nbiquadratic residues\n.\nGauss\nwas impressed, so much so that he wrote to\nBessel\nto obtain more information about the young Jacobi. But Jacobi also had remarkable new ideas about\nelliptic functions\n(\nas\nAbel\ndid quite independently and at much the same time\n)\n. On\n5\nAugust\n1827\nJacobi wrote to\nLegendre\nwho was the leading expert on the topic and this letter, together with\n22\nothers between Jacobi and\nLegendre\n, is given in\n[\n4\n]\n.\nLegendre\nimmediately realised that Jacobi had made fundamental advances in his favourite topic. One would have to say that\nLegendre\nreacted extremely well to the realisation that his position as the leading expert on elliptic functions had changed overnight with the new theory being developed not only by Jacobi, but also by\nAbel\n. Jacobi's promotion to associate professor on\n28\nDecember\n1827\nwas mainly due to the praise heaped on him by\nLegendre\n. In a letter, sent to Jacobi on\n9\nFebruary\n1828\n,\nLegendre\nwrote:-\nIt gives me great satisfaction to see two young mathematicians such as you and\n[\nAbel\n]\ncultivate with such success a branch of analysis which for such a long time has been my favourite topic of study but which had not been received in my own country as well as it deserves. By your works you place yourselves in the ranks of the best analysts of our era.\nIn\n1829\nJacobi met\nLegendre\nand other French mathematicians such as\nFourier\nand\nPoisson\nwhen he made a visit to Paris in the summer vacation. On the journey to Paris he had visited\nGauss\nin Göttingen. Jacobi's fundamental work on the theory of elliptic functions, which had so impressed\nLegendre\n, was based on four theta functions. His paper\nFundamenta nova theoria functionum ellipticarum\nⓉ\n(\nThe foundations of a new theory of elliptic functions\n)\npublished in\n1829\n, together with its later supplements, made fundamental contributions to this theory of elliptic functions. However, despite Jacobi's brilliant contributions to elliptic functions he did not have the field to himself. As we have noted above,\nAbel\nwas also making fundamental contributions and to some extent a competition had developed between the two.\nLegendre\nexpressed this clearly in a letter he wrote to Jacobi early in\n1829\n:-\nYou proceed so rapidly, gentlemen, in all these wonderful speculations that it is nearly impossible to follow you - particularly for an old man ... I congratulate myself that I have lived long enough to witness these magnanimous contests between two young equally strong athletes, who turn their efforts to the profit of the science whose limits they push back further and further.\nA few weeks after\nLegendre\nwrote this letter\nAbel\ndied. On\n11\nSeptember\n1831\nJacobi married Marie Schwinck then, a few months later in May\n1832\n, he was promoted to full professor after being subjected to a four hour disputation in Latin. Jacobi's reputation as an excellent teacher attracted many students. He introduced the seminar method to teach students the latest advances in mathematics. Jacobi had a major impact on these students and all others around him\n[\n1\n]\n:-\nSuch were Jacobi's forceful personality and sweeping enthusiasm that none of his gifted students could escape his spell: they were drawn into his sphere of thought, and soon represented a \"school\".\nC W Borchardt\n,\nE Heine\n,\nL O Hesse\n, F J Richelot,\nJ Rosenhain\n, and\nP L von Seidel\nbelonged to this circle; they contributed much to the dissemination not only of Jacobi's mathematical creations but also the new research-oriented attitude in university instruction. The triad of\nBessel\n, Jacobi, and\nFranz Neumann\nthus became the nucleus of a revival of mathematics at German universities.\nIn\n1833\nJacobi's older brother Moritz joined him in Königsberg where he set himself up as an architect. During the two years Moritz spent there he became more interested in physics and left Königsberg in\n1835\nwhen he was appointed to the chair of civil engineering at Dorpat. In\n1834\nJacobi received some work from\nKummer\nwho was at this time a teacher in a Gymnasium in Liegnitz. The article\n[\n20\n]\ndescribes how Jacobi immediately recognised\nKummer\n's mathematical talents.\nKummer\nhad made advances beyond what Jacobi had achieved on third-order\ndifferential equations\nand Jacobi wrote to his brother Moritz in\n1836\ndescribing how\nKummer\nhad managed to solve problems which had defeated him.\nIn\n1834\nJacobi proved that if a single-valued function of one variable is doubly periodic then the ratio of the periods is non-real. This result prompted much further work in this area, in particular by\nLiouville\nand\nCauchy\n.\nJacobi carried out important research in\npartial differential equations\nof the first order and applied them to the differential equations of dynamics. He also worked on\ndeterminants\nand studied the functional determinant now called the Jacobian. Jacobi was not the first to study the functional determinant which now bears his name, it appears first in a\n1815\npaper of\nCauchy\n. However Jacobi wrote a long memoir\nDe determinantibus functionalibus\nⓉ\n(\nFunctional determinants\n)\nin\n1841\ndevoted to this determinant. He proved, among many other things, that if a set of\nn\nn\nn\nfunctions in\nn\nn\nn\nvariables are functionally related then the Jacobian is identically zero, while if the functions are independent the Jacobian cannot be identically zero.\nIn\n[\n15\n]\nMcCleary describes one of Jacobi's most impressive results:-\nOne of the prettiest results in the global theory of curves is a theorem of Jacobi\n(1842)\n: The spherical image of the\nnormal\ndirections along a closed differentiable curve in space divides the unit sphere into regions of equal area. The statement of this theorem is an afterthought to a paper in which Jacobi responds to the published correction by\nThomas Clausen\n(1842)\nof an earlier paper by Jacobi\n(1836)\n.\nIn July\n1842\nJacobi and\nBessel\nattended the meeting of the\nBritish Association for the Advancement of Science\nin Manchester as representatives of Prussia. Jacobi's wife accompanied the two mathematicians. They returned to Königsberg via Paris where Jacobi lectured at the\nAcadémie des Sciences\n. In the following year Jacobi became unwell and diabetes was diagnosed. He was advised by his doctor to spend time in Italy where the climate would help him recover. However, Jacobi was not a wealthy man and\nDirichlet\n, after visiting Jacobi and discovering his plight, wrote to Alexander von Humboldt asking him to help obtain some financial assistance for Jacobi from Friedrich Wilhelm IV.\nWe should make a small digression to say why Jacobi was not a wealthy man despite having inherited a small fortune from his wealthy father. A severe business depression throughout Prussia\n(\nin fact it was a Europe wide depression\n)\n, had led to a bankruptcy in which Jacobi had lost all his money. Let us now return to\nDirichlet\nand Alexander von Humboldt's attempts to help obtain support for Jacobi's trip to Italy.\nJacobi had frequently corresponded with Alexander von Humboldt. The correspondence began in\n1828\nbut only after\n1839\ndid they correspond regularly and the\n44\nsurviving letters between the two men make fascinating reading\n(\nsee\n[\n5\n]\nand also\n[\n7\n]\n)\n.\nDirichlet\n's request to Friedrich Wilhelm IV, supported strongly by Alexander von Humboldt, was successful and Jacobi received a grant to allow him to spend time in Italy. He set off for Italy with\nBorchardt\nand\nDirichlet\nand, after stopping in several towns and attending a mathematical meeting in Lucca, they arrived in Rome on\n16\nNovember\n1843\n.\nSchläfli\nand\nSteiner\nwere also with them,\nSchläfli\nbeing their interpreter.\nThe climate in Italy did indeed help Jacobi to recover and he began to publish again, his health having prevented him working for some time before this. In fact Jacobi's interests in mathematics were very wide and while in Rome he took the opportunity to satisfy his interest in the history of mathematics working on manuscripts of\nDiophantus\n's\nArithmetica\nwhich were kept in the Vatican. Although his health had improved it was felt that the climate of Königsberg was too extreme for him to return there, so a dispensation was obtained from Friedrich Wilhelm IV to allow him to transfer to Berlin. He was given a supplement to his salary to help offset the higher costs of living in Berlin, and also to help him with his medical expenses.\nHe was in Berlin by June\n1844\nand although his health prevented him from giving frequent lecture courses, he did lecture at the University of Berlin. In\n[\n21\n]\na lecture course which he gave in\n1847\n-\n48\nis discussed by Pulte:-\nJacobi in his lectures on analytical mechanics\n(\nBerlin,\n1847\n-\n1848)\n... gave a detailed and critical discussion of\nLagrange\n's mechanics.\nLagrange\n's view that mechanics could be pursued as an axiomatic-deductive science forms the centre of Jacobi's criticism and is rejected on mathematical and philosophical grounds. ... Jacobi's criticism is motivated by a changed evaluation of the role of mathematics in the empirical sciences.\nIn\n[\n22\n]\nPulte shows that Jacobi only came to hold these views on analytical mechanics only later in his life, for earlier he had ignored the physical interpretation of mechanics in favour of a purely axiomatic and mathematical approach.\nBy\n1848\nconditions were bad in the German Confederation. Unemployment and crop failures had led to discontent and disturbances. The news that Louis-Philippe had been overthrown by an uprising in Paris in February\n1848\nled to revolutions in many states and fighting in Berlin. Republican and socialist feelings meant that the monarchy was in trouble. Jacobi made a political speech in the Constitutional Club in Berlin which managed to upset both the monarchists and the republicans. As a consequence Jacobi's request to be allowed to join the staff of the University of Berlin was refused by the Prussian government.\nBy the summer of\n1849\nthe revolution was completely defeated. The Prussian government, still feeling aggrieved at Jacobi, took away the supplement to his salary which allowed him to live in Berlin. He had to move, and chose the small town of Gotha. He lived there with his family and a few months later accepted a chair at the University of Vienna. The Prussian government suddenly realised what they would lose if they forced Jacobi to leave Prussia, so they made concessions which meant that Jacobi could lecture at the University of Berlin while his family remained in Gotha. It was not a good deal for Jacobi and the fact that he accepted it means that he was strongly attached to his own country.\nJacobi planned to spend the university vacations with his family and he spent the summer of\n1850\nwith them in Gotha. In January\n1851\nhe contracted influenza, then he contracted smallpox before he had regained his strength. He died a few days after contracting smallpox.\nScriba, in\n[\n1\n]\n, compares Jacobi with\nEuler\n:-\nJacobi and\nEuler\nwere kindred spirits in the way they created their mathematics. Both were prolific writers and even more prolific calculators; both drew a great deal of insight from immense algorithmical work; both laboured in many fields of mathematics\n(\nEuler\n, in this respect, greatly surpassed Jacobi\n)\n; and both at any moment could draw from the vast armoury of mathematical methods just those weapons which would promise the best results in the attack of a given problem.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Euler",
    "quintic equations",
    "radicals",
    "Lagrange",
    "habilitation",
    "Berlin Academy of Sciences",
    "Berlin Academy",
    "Franz Neumann",
    "Bessel",
    "number theory",
    "Gauss",
    "quadratic",
    "biquadratic residues",
    "elliptic functions",
    "Abel",
    "Legendre",
    "Fourier",
    "Poisson",
    "C W Borchardt",
    "E Heine",
    "L O Hesse",
    "J Rosenhain",
    "P L von Seidel",
    "Kummer",
    "differential equations",
    "Liouville",
    "Cauchy",
    "partial differential equations",
    "determinants",
    "normal",
    "Thomas Clausen",
    "British Association for the Advancement of Science",
    "Académie des Sciences",
    "Dirichlet",
    "Borchardt",
    "Schläfli",
    "Steiner",
    "Diophantus"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}