{
  "nome_completo": "Catherine Cassels Steele",
  "nome_curto": "Catherine Steele",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steele/",
  "data_nascimento": "17 September 1903",
  "local_nascimento": "West Calder, West Lothian, Scotland",
  "data_morte": "3 December 1995",
  "local_morte": "Lacy, Washington, USA",
  "summary": "Catherine Steele graduated from the University of St Andrews. She went on to a doctorate in Chemistry and studied at the University of Illinois and at Harvard. She taught for some time at a Horticultural College in Kent before returning to the USA.",
  "biografia": "Catherine Steele\n's father James Steele was the headmaster of the school in St Monance on the south coast of Fife.\nCatherine Steele began her primary schooling at West Calder at the age of five. In\n1911\nshe moved to St Monance in Fife where she continued her primary education. In\n1915\n, at age\n12\n, she began her secondary education at Waid Academy in Anstruther, Fife. She entered the University of St Andrews in\n1920\n. After graduating M.A. with First Class Honours in Mathematics and Natural Philosophy from the University of St Andrews in\n1924\nshe continued to study at St Andrews for a B.Sc. graduating with Special Distinction in Chemistry, Physics and Mathematics in\n1925\n. She joined the\nEdinburgh Mathematical Society\nin June\n1925\n. Despite her continued interest in mathematics, she had decided to undertake research in chemistry for her doctorate and after submitting her thesis she was awarded a Ph.D. in\n1928\n.\nSteele was awarded a Commonwealth Fellowship to allow her to travel to the United States to continue with her research in chemistry. She sailed to the United States on board S. S. Scythia, leaving Liverpool on\n30\nAugust\n1928\nand arriving in New York on\n8\nSeptember. She was based at the University of Illinois for two years and then for a year at Harvard where she lived in Edmund's Hall. During her time in the United States she met Louis Hamilton Bock whom she later married. After three years in the United States, Steele returned to Britain, taking up a post at the Horticultural College, Swanley, Kent.\nIn\n1934\nSteele married Louis Bock. Their wedding was reported in\nThe Scotsman\nin the following terms:-\nSTUDENT'S ROMANCE IN U.S\n.\nSt Andrews Graduate Married in University Chapel\nThe wedding took place in St Andrews University Chapel yesterday\n(23\nMay\n1934)\nof Dr Catherine Cassels Steele, eldest daughter of Mr James Steele,\n4\nJames's Grove, Kirkcaldy and of the late Mrs Steele, and Mr Louis Hamilton Bock Ph.D., of Bristol, Pennsylvania, U.S.A., who travelled over\n3000\nmiles for the occasion. Dr Steele a Ph.D. of St Andrews, met Dr Bock while she was in America lecturing and doing chemistry research work under the Commonwealth Fellowship. Since returning from America she has been lecturing at the Horticultural College, Swanley, Kent. Her father was formerly headmaster of St Monance School\n.\nThere was a large attendance of students at the wedding. The ceremony was performed by the Rev. John Begg, Skelmorlie, Ayrshire, and Mr Robert B D Steele, a student, acted as groomsman. The bridesmaids were Misses Effie and Maisie Steele, sisters of the bride. The bride wore a gown of parchment satin over pink, her filmy veil of bridal tulle being held in place by a Juliet cap of orange blossoms. She carried a bouquet of pale pink roses. The bridesmaids wore dresses of lemon lace and net, with green hats, and carried Victorian posies of sweet peas\n.\nFurther announcements in\nThe Scotsman\nreported the birth of two sons:-\nAt Philadelphia, USA, on\n20\nOctober\n1939\n, to Dr and Mrs L H Bock\n(\nCatherine C Steele\n)\n,\n127\nTyson Avenue, Glenside, Pennsylvania, a son.\nIn USA on\n27\nFebruary\n1942\n, to Dr and Mrs Louis Bock\n(\nCatherine C Steele\n)\n, Boyd Road, Huntington Valley, Pennsylvania, a son.\nIn\n1935\n, back in the United States, she became ill and had a thyroid operation at the Mayo Clinic in Rochester, Minnesota.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}