{
  "nome_completo": "Cathleen Synge Morawetz",
  "nome_curto": "Cathleen Morawetz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morawetz/",
  "data_nascimento": "5 May 1923",
  "local_nascimento": "Toronto, Canada",
  "data_morte": "8 August 2017",
  "local_morte": "New York City, New York, USA",
  "summary": "Cathleen Morawetz was a Canadian mathematician who worked on the  partial differential equations governing fluid flow, particularly those of mixed type occurring in transonic flow.",
  "biografia": "Cathleen Morawetz\nwas christened Cathleen Synge. Her father was\nJohn Lighton Synge\n, a mathematician who has a biography in this archive, while her mother, Eleanor Mabel Allen Synge, also had some training as a mathematician. Both Cathleen's parents were Irish but she was born in Toronto while her father held the position of assistant professor of mathematics at the University of Toronto. However, when she was two years old the family returned to Ireland when her father was appointed to the chair of Natural Philosophy at Dublin University. When Cathleen was seven years old the family returned to Toronto and it was in Toronto that she attended school.\nCathleen won a scholarship and entered the University of Toronto to study mathematics. Her parents both encouraged her interest in mathematics and science but her father jokingly said that if she became a mathematician:-\n... we might fight like the Bernoulli brothers.\nOf course the years that Cathleen spent as an undergraduate at Toronto was the time of World War II and she undertook war work in\n1943\n-\n44\nas a technical assistant. Returning to the University of Toronto she was awarded her B.A. degree in Mathematics in\n1945\n.\nCecilia Krieger\n, who taught Cathleen mathematics while she was an undergraduate, had been a family friend for many years. She strongly encouraged Cathleen continue her study of mathematics.\nCathleen married Herbert Morawetz, who was a chemist, on\n28\nOctober\n1945\n. She then went to Massachusetts Institute of Technology to study for her Master's Degree which was awarded in\n1946\n. At this stage she hesitated and considered whether she should pursue her mathematical studies further. There were few job opportunities for women with doctorates in mathematics and she considered taking a job in Bell Laboratories in New Jersey. However, strongly encouraged by\nCecilia Krieger\nto study for her doctorate, Morawetz went to New York University to undertake research.\nShe was asked to edit\nCourant\nand\nFriedrichs\nSupersonic Flow and Shock Waves\nand, by the time this task was completed, she was fascinated by transonic flow and associated phenomena. She wrote her doctoral thesis, which was supervised by\nFriedrichs\n, on the stability of a spherical implosion and was awarded her Ph.D. in\n1951\n. During this period Morawetz applied for US citizenship and she was granted this in\n1950\n. She was a research associate at the Massachusetts Institute of Technology for a short spell but returned to the\nCourant\nInstitute of Mathematical Sciences of New York University in\n1952\nas a research associate. Steady promotion there saw her become an assistant professor in\n1957\n, an associate professor in\n1960\n, and the a full professor in\n1965\n. In\n1966\n-\n67\nshe held a prestigious Guggenheim Fellowship.\nIn\n1978\nMorawetz became the associate director of the\nCourant\nInstitute of Mathematical Sciences a position which she held until\n1984\nwhen she was appointed Director of the\nCourant\nInstitute. With this appointment she became the first woman to hold this position, moreover she was the first woman to hold any comparable directorship within the mathematical sciences in the United States.\nShe was elected as President of the\nAmerican Mathematical Society\n, serving in this role in\n1995\n-\n96\n. On the announcement that she would become President the\nCourant\nInstitute issued a press release saying:-\nMorawetz is an outstanding mathematician, and has lond been one of the leading lights at our prestigious\nCourant\nInstitute.\n[\nWe\n]\nknow that the American Mathematical Society will benefit greatly by her considerable acumen and compelling leadership.\nThe article\n[\n2\n]\n, nominating her for that position, describes her remarkable research achievements:-\nIn a series of three significant papers in the late\n1950\ns, Cathleen Morawetz used\nfunctional analysis\ncoupled with ingenious new estimates for an equation of mixed type, i.e. with both elliptic and hyperbolic regions, to prove a striking new theorem for\nboundary value problems\nfor\npartial differential equations\n. This theorem was motivated by applications and leads to a startling practical prediction. Namely, if oe starts with a smooth, steady irrotational flow around an aerodynamic profile like a wing, then in general, if one changes the shape of the profile slightly, there cannot be a smooth, steady transonic flow around the purturbed profile. Morawetz's predictions have been confirmed subsequently through both actual experiments and careful numerical simulation which indicate the appearance of shock waves in the flow past the purturbed profile.\nIn the\n1960\ns Morawetz worked on the scattering of sound waves and electromagnetic waves striking objects. Morawetz showed that, for a medium with constant light speed outside a reflecting star-shaped object, high frequency waves are, asymptotically, streams of particles moving along the rays. During the\n1970\ns she extended this work to examine other solutions to the wave equation. She proved many important results relating to the non-linear wave equation. In her later work she continued to study shock waves and transonic flow.\nIn\n1998\nMorawetz was awarded the National Medal of Science. Established by the United States Congress in\n1959\nand first awarded to\nTheodore von K치rm치n\nin\n1962\n, it is the highest scientific honour which the United States can give. The citation for the award says that it was given to Morawetz:-\n... for pioneering advances in partial differential equations and wave propagation resulting in applications to aerodynamics, acoustics and optics.\nIn her speech accepting the National Medal of Science, Morawetz said:-\nThis is an occasion of great moment for me. I am filled with gratitude to all those, and there were a great many, who helped me over many years, and I am proud to be the first woman mathematician to receive the medal. My biggest wish would be that it could help move more women forward in mathematics, be it in grade school or graduate school.\nThe list of honours which Morawetz has received certainly does not stop at those already mentioned above. She has been awarded honorary degrees by Eastern Michigan University, Smith College, and Brown University in\n1982\n; Princeton University in\n1986\n; and Duke University, and New Jersey Institute of Technology in\n1988\n. In\n1993\nshe was named Outstanding Woman Scientist by the Association for Women in Science. In\n1997\nshe received the\nKrieger\n-\nNelson\nAward from the\nCanadian Mathematical Society\n. She has been elected a Fellow of the American Association for the Advancement of Science and a member of the\nAmerican Academy of Arts and Sciences\n. In addition she was the first woman member of the Applied Mathematics Section of the\nNational Academy of Sciences\n.\nIn\n2001\nMorawetz was made an honorary member of the\nLondon Mathematical Society\n. Then in\n2004\nshe received the Leroy P Steele Prize for Lifetime Achievement from the\nAmerican Mathematical Society\n:-\n... for greatly influencing mathematics in the broad sense throughout her long and distinguished career. In addition to her deep contributions to partial differential equations, transonic flow, and other areas of applied mathematics, she provided guidance and inspiration to colleagues and students alike. She also provided a remarkable measure of service to the mathematical community through her membership on many AMS committees and through her term as AMS President\n(1995\n-\n1997)\n. She dispatched her duties in these roles with excellence and did not merely serve; she provided leadership.\nIn\n2006\nMorawetz was awarded the\nBirkhoff\nPrize, a joint award of the\nAmerican Mathematical Society\nand the\nSociety for Industrial and Applied Mathematics\n:-\n...for her deep and influential work in partial differential equations, most notably in the study of shock waves, transonic flow, scattering theory, and conformally invariant estimates for the wave equation.\nIn reply she said:-\nIt is a totally unthought of and a wonderful surprise to receive the\nBirkhoff\nPrize. I am very, very grateful to the two societies, AMS and SIAM, for choosing me. There are many, many people whom I would have liked to thank for helping me over the years, but I would not have room for their names on this page. But one person stands out for supporting and encouraging me when I was between the crucial professional ages of twenty-three and thirty-five. I worked part-time on my Ph.D., part-time as a postdoc, and I had four children. That person was\nRichard Courant\n, the creator of the Courant Institute at New York University, where I have been a professor ever since.\nThe list of her remarkable achievements gives her own joke a deeper meaning:-\nMaybe I became a mathematician because I was so crummy at housework.",
  "matematicos_citados_na_biografia": [
    "John Lighton Synge",
    "Cecilia Krieger",
    "Courant",
    "Friedrichs",
    "American Mathematical Society",
    "functional analysis",
    "boundary value problems",
    "partial differential equations",
    "Theodore von K치rm치n",
    "Krieger",
    "Nelson",
    "Canadian Mathematical Society",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "London Mathematical Society",
    "Birkhoff",
    "Society for Industrial and Applied Mathematics",
    "Richard Courant"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}