{
  "nome_completo": "Cecilia Helena Payne-Gaposchkin",
  "nome_curto": "Cecilia Payne-Gaposchkin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Payne-Gaposchkin/",
  "data_nascimento": "10 May 1900",
  "local_nascimento": "Wendover, England",
  "data_morte": "7 December 1979",
  "local_morte": "Tewksbury, Massachusetts, USA",
  "summary": "Cecilia Payne-Gaposchkin was a British mathematician and astronomer who did important work for her Ph.D. at Radcliffe College of Harvard University. She showed that stars were composed almost entirely of hydrogen and helium but, although completely correct, it was rejected by astronomers at the time.",
  "biografia": "Cecilia Payne-Gaposchkin\n's was given the name Cecilia Helena Payne. She changed her name to Payne-Gaposchkin when she married Sergi Gaposchkin. For simplicity, we will use name Payne-Gaposchkin throughout this biography. Her parents were Edward John Payne\n(1844\n-\n1904)\nand Emma Leonora Helena Pertz. Edward Payne was a lawyer, musician and a scholar at the University of Oxford, only leaving his Oxford fellowship late in life to marry Emma Pertz. After marrying they settled down at Holywell Lodge in Wendover, where his ancestors had farmed the land. Although English, Edward Payne had been born in Russia. Emma Pertz, the daughter of Emma Wilkinson and Hermann Pertz, was German. She had a sister Florence who was a professional pianist. Edward Payne died when Cecilia was four years old. He was found drowned in a canal at Wendover and the circumstances of his death are unclear. Cecilia had a brother Humfry Payne\n(1902\n-\n1936)\nwho became an archaeologist, and a sister Leonora Florence Mary Payne\n(1904\n-\n1996)\n.\nWhen she was six years old, Cecilia began to attend a local school in Wendover which had just opened across the street from where she lived. The school was run by Elizabeth Edwards who provided a good education. Payne-Gaposchkin writes\n[\n1\n]\n:-\nIn six years that I spent at her school, Miss Edwards gave me a rich education. I sometimes think she taught me all I needed to know. At\n12\nI could speak French and German, had a basic knowledge of Latin and a full command of arithmetic. Geometry and algebra were part of our studies and I delighted especially in the solution of quadratic equations.\nHowever, there were problems. She was left-handed yet forced to write with her right hand. Also, from the time she was a young child, she was oppressed with a sense of living in a man's world. Cecilia was very musical and was a gifted pianist but music did not play a part in her school education.\nWhen Cecilia was twelve years old the family moved to London, mainly so that her brother Humfry could receive an education which would prepare him for attending an independent school. The school she attended, St Mary's College, Paddington, was very different from Miss Edwards' school in Wendover. It was a large Church of England school with a strong emphasis on religion, both in teaching and in attending chapel. She wrote\n[\n1\n]\n:-\nIt has taken me many decades to overcome the resentments and doubts engendered in a well-meaning but bigoted atmosphere.\nThe new school was a disappointment as far as mathematics and science were concerned. Already enjoying geometry and algebra, she had to go back to classes on long division. In her first year, there were no science lessons at all. From a very young age Payne-Gaposchkin had wanted to be a scientist, being at this time most interested in botany, but with no help from her school she turned to the books in her own home. These books had belonged to her relations who were mainly historians so there was little to interest her. However, she did find a copy of\nNewton\n's\nPrincipia\nwhich she began to study. Not, one would have to say, the best introduction to mathematics! When she reached second year, things improved with lessons on algebra and\nEuclid\n. A new science teacher, Dorothy Dalglish, saw that Payne-Gaposchkin wanted to learn more science than was in the few lessons given to second year pupils so she lent her physics books and took her to museums.\nIn\n1914\n, when she was\n14\nyears old, the First World War started. With a mother who had been born in Germany, Payne-Gaposchkin felt very uncomfortable. Perhaps even worse, her mathematics teacher Miss Dalglish became ill and left teaching. She wrote\n[\n1\n]\n:-\nThe next few years were a confused and unhappy time. I insisted that I must learn advanced mathematics and German\n(\nfor both would be necessary to a scientist\n)\n, and no other girl in the school had any such needs or requirements. ... Finally a kindly teacher tutored me in German. I undertook the study of calculus and coordinate geometry by myself, and mathematics took on a kind of mystical significance.\nHowever, eventually she was assigned to an unpleasant mathematics teacher who told her she would never become a scholar. The school told her to leave and go to another school. This, she said, was the greatest service they gave her.\nIn\n1918\nshe entered St Paul's Girls' School, Brook Green, Hammersmith where she was encouraged to study science. In addition, the school allowed her to develop her other passion of music. The music master was Gustav Holst, the famous composer, and he had Payne-Gaposchkin join the school orchestra, taught her to conduct, and urged her to become a musician. This was very tempting but in the end her love for science prevailed. She loved the physics taught by Ivy Pendlebury which included mechanics, dynamics, electricity and magnetism, light, thermodynamics and a little astronomy. Despite having only one year to prepare for the Cambridge Scholarship examination, starting from a rather poor background, in\n1919\nshe was awarded the Mary Eward Scholarship for Natural Sciences and began her university studies at Newnham College Cambridge in September\n1919\n. She had won the only open scholarship which was sufficiently valuable to cover all her expenses.\nAlthough the combination was unusual, Payne-Gaposchkin was allowed to study botany, physics and chemistry. She found botany a disappointment and was given no encouragement by her lecturers. Although she persevered with botany for a year she decided that she wanted to concentrate on physical science. She found physics a delight, particularly a lecture course on the atom by\nNiels Bohr\n. However, she wrote\n[\n1\n]\n:-\nHis discourse was rendered almost incomprehensible by his accent; there were endless references to what I recorded as 'soup groups', only later amended to 'subgroups'.\nThe event which turned Payne-Gaposchkin to astronomy was a lecture by\nArthur Eddington\n. See\nTHIS LINK\n.\nThe day after the lecture she gave up biology and concentrated on physics. She was allowed to attend all the astronomy lectures although she could not transfer to that subject since it was part of the Mathematical Tripos and she was on the Natural Sciences Tripos. However, she made physics her main subject and took all the astronomy courses she could. She began to make observations using the Newnham College Observatory. She was awarded a B.A. degree in\n1923\nperforming well despite spending most of her time on astronomy, a subject on which she was not examined. Thinking that she had no other option but to become a school teacher, she was taken to a lecture in London given by\nHarlow Shapley\n, the Director of the Harvard College Observatory. She spoke to\nShapley\nafter the lecture and he encouraged her to spend a year at Harvard College Observatory.\nEddington\nwrote a reference in which he said\n(\nsee for example\n[\n43\n]\n)\n:-\nShe has attained a wide knowledge of physical science including astronomy, and possesses the valuable qualities of energy and enthusiasm in her work ... I believe that she is the type of person who, given the opportunity, would devote her whole life to astronomy and she would not want to run away after a few years' training to get married.\nShe managed to gather sufficient financial support and, later in\n1923\nbecame a National Research Fellow at Harvard University in Cambridge, Massachusetts, becoming affiliated to the Harvard College Observatory. In the interview\n[\n8\n]\nshe explained how she came to undertake the work which led to her famous thesis, work which was not what\nShapley\nsuggested she undertook:-\n[\nShapley\n]\nwas very encouraging, very kind and helpful, and he was always interested in what everyone was doing and thinking. But I remember his saying to me after some months\n[\nof applying the ionization equation to spectra\n]\n, \"Why don't you get some little thing together and publish it?\" And I said, \"I don't want to do that, I should regard that as a confession of failure, I want to get this whole thing together.\" What really inspired me was the announcement which I had heard before I left Cambridge, England, on the subject of the\nAdams\nPrize for the following year - the subject was the study of matter at high temperatures. The person who told me this remarked that this of course was aimed at\nR H Fowler\n, because they wanted to get\nR H Fowler\nto write up his stuff. And I said to myself, \"I will write a paper on the observational study of matter at high temperatures,\" which words you will find on the title page of \"Stellar Atmospheres\" and that is the reason why it was there. I didn't expect to get the\nAdams\nPrize; I very much doubt whether a woman would be eligible. But I said to myself, \"At least I am going to make a contribution to the subject as good and as valuable as the theoretical paper somebody is going to write and get the prize with,\" So I was pretty ambitious, it seems funny now.\nHer results led her to the conclusion that hydrogen and helium were by far the most common elements in stars, a view which contradicted that of the time which believed that stars would have a similar composition to the Earth. A draft of her paper containing these results, in particular showing that hydrogen was a million times more abundant that the metals in stars, was sent to the leading astronomer Henry Norris Russell who replied that this was \"clearly impossible.\" Payne-Gaposchkin was correct but bowed to the view of the leading astronomer Russell and added the following:-\nThe enormous abundances derived for those elements in the stellar atmosphere are almost certainly not real. Probably the result may be considered, for hydrogen, as another aspect of its abnormal behaviour ...  and helium ... possibly deviates for similar reasons.\nShe received a Ph.D. from Radcliffe College in\n1925\nfor her thesis\nStellar atmospheres: A Contribution to the Observational Study of High Temperature in the Reversing Layers of Stars\nwhich was published as a book. After two years at Harvard Observatory on a fellowship she knew she wanted to stay there and was appointed as a research fellow. She held this position from\n1925\nto\n1927\nwhen she was appointed as Technical Assistant to\nHarlow Shapley\n. This was poorly paid and was in no way appropriate for her expertise and achievements but at least she was able to have a home of her own. For several of her achievements she received no credit having been persuaded not to publish. For example in\n1925\nshe detected the Stark effect in the spectra of the hottest stars but both Russell and\nShapley\nwere sceptical and she did not publish. She was also persuaded not to publish on interstellar absorption. Both were established a few years later by others. Jeremy Knowles, dean of the Harvard University's Faculty of Arts and Sciences in February\n2002\nwhen Payne-Gaposchkin's achievements were being celebrated, said\n(\nsee\n[\n39\n]\n)\n:-\nPayne-Gaposchkin's most dramatic scientific contribution was the discovery that hydrogen is millions of times more abundant than any other element in the universe. Every high school student knows that\nNewton\ndiscovered gravity, that Darwin discovered evolution, even that\nEinstein\ndiscovered relativity. But when it comes to the composition of our universe, the textbooks simply say that the most prevalent element in the universe is hydrogen. And no one ever wonders how we know. ... after the award of her doctorate, she lectured in the astronomy department, but her lectures were not listed in the course catalogue. She directed graduate research without status; she had no research leave; and her small salary was categorized by the department under 'equipment.' And yet she survived and flourished.\nShe published\nThe stars of high luminosity\nin\n1930\n.\nErnst Öpik\nwrote\n[\n24\n]\n:-\nWhen in\n1930\nI came on my first visit to Harvard Observatory, Miss Payne was there already for several years upon\nShapley\n's invitation. We became close friends, sharing our common interests in astronomy and music\n(\nincluding composition\n)\n, and many evenings were spent together, either in concert halls or at her home which she shared with Miss Frances Wright and where I played the piano - Beethoven, Musorgsky, and also my own creations.\nIn\n1931\nPayne-Gaposchkin became a US citizen, however tragic events in\n1932\n-\n33\nchanged her life. In summer\n1932\nAdelaide Ames, one of her close friends and a colleague at the Observatory, drowned in a canoeing accident. Then on two days in May\n1933\nshe learnt of the death of two close friends, Bill Waterford who had shared musical interests with her, was killed in a motorcycle accident in South Africa, and her closest friend at Newnham College, Betty Leaf, tragically died. She wrote\n[\n1\n]\n:-\nAdelaide and Betty - all that I was not, beautiful, delicate, beloved were dead and I was alive. My resolution to open my heart to the world had what I suppose was the inevitable result.\nShe planned a trip to visit the observatories of Northern Europe. Arriving first in England she was warned of the political situation in Germany, but she did not realise its significance. Continuing her trip, she went to Leyden, Copenhagen, Stockholm, all of which were pleasant visits but she wanted to make a more ambitious trip to Pulkova. She took a boat to Finland and a hydroplane flight from Helsinki to Reval. From there she went to the Fraunhofer Observatory in Tartu where, on saying she was going to Russia, she received a strong warning not to go. However, she went by train to Leningrad and then on to Pulkova. She wrote\n[\n1\n]\n:-\nI spent two weeks at Pulkova, and felt I had experienced a lifetime. The atmosphere of tension never lifted. It was not only the drab and squalid living conditions of the man who was the Director of one of the great Observatories. It was not only the scarcity of food ... Everyone was afraid - afraid to talk least they should be overheard.\nShe returned to Berlin and went on to Göttingen for a meeting of the Astronomische Gesellschaft but here too there was a tense atmosphere. She was approached by a young man, Sergei Gaposchkin, who was trying to become an astronomer but was struggling against Nazi persecution. After returning to the United States, she managed to arrange for Sergei Gaposchkin to obtain a visa. He arrived in the United States in November\n1933\nand in March\n1934\nCecilia Payne and Sergei Gaposchkin were married. They had three children, Edward\n(\nborn\n1935)\n, Katherine\n(\nborn\n1937)\nand Peter\n(\nborn\n1940)\n. From\n1935\nPayne-Gaposchkin began to produce joint papers with her husband and the first book which they jointly authors was\nVariable stars\n(1938)\n. In fact she appears to have around\n350\npublications in total.\nIn\n1943\nshe published\nThe Scholar and the World\nwhich gives a fascinating account of the way that Payne-Gaposchkin saw the world and how astronomy fitted into it. From the text it appears to have been written before the outbreak of World War II. We give an extract from the text at\nTHIS LINK\n.\nOne of the more important textbooks was\nIntroduction to astronomy\n(1954)\n. This book has great significance for me\n[\nEFR\n]\nsince I bought it when I was a student in the early\n1960\ns. I still have my copy and reproduce an extract from the Preface and Introduction at\nTHIS LINK\n.\nEventually Payne-Gaposchkin obtained a position more appropriate to her contributions. She was given the title of Astronomer in\n1938\nand shortly after, Phillips Astronomer at Harvard College Observatory. She held this position until\n1956\nwhen she was appointed Professor of Astronomy at Harvard University, the first woman to become a professor at Harvard. She served as Chair of the Department of Astronomy at Harvard University from\n1956\nto\n1960\nbecoming the first woman to serve as a department chair. In\n1965\nshe retired and, in the following year, was made Professor Emeritus at Harvard University. She did not stop her work on retirement, however, working at the Smithsonian Astrophysical Observatory from\n1967\nuntil her death in\n1979\n.\nPayne-Gaposchkin received many honours. She received the\nAnnie Jump Cannon\nPrize from the American Astronomical Society in\n1934\n, elected a member of the American Philosophical Society in\n1936\n, elected a member of the\nAmerican Academy of Arts and Sciences\nin\n1943\n, given an Award of Merit by Radcliffe College in\n1952\n, and awarded the Rittenhouse Medal by the Franklin Institute in\n1961\n. Several colleges awarded her an honorary D.Sc. degree: Wilson College\n(1942)\n; Smith College\n(1943)\n; Western College\n(1951)\n; Colby College\n(1958)\n; and the Women's Medical College of Philadelphia\n(1961)\n. In\n1976\nthe American Astronomical Society awarded her the Henry Norris Russell Prize:-\n...\nto commemorate a lifetime of pre-eminence in astronomical research.\nOn accepting this award, Payne-Gaposchkin said:-\nThe reward of the young scientist is the emotional thrill of being the first person in the history of the world to see something or to understand something. Nothing can compare with that experience... The reward of the old scientist is the sense of having seen a vague sketch grow into a masterly landscape.\nPayne-Gaposchkin and her husband travelled a lot in the\n1970\ns. They visited India, Japan, Hawaii, Trinidad and Tobago, Alaska, Egypt and Spain. She died of lung cancer which had been diagnosed in August\n1979\nafter returning from a trip with her husband which had gone from Tahiti to Australia to India and to Turkey before returning early to the United States.\nIn the year of her death she published a privately printed autobiography entitled\nThe Dyer's Hand.\nIt was republished in Katherine Haramundanis\n(\ned.\n)\n,\nCecilia Payne-Gaposchkin: An Autobiography and Other Recollections\n(\nCambridge University Press,\n1984)\n. We give some extracts from very interesting reviews of this work at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Newton",
    "Euclid",
    "Niels Bohr",
    "Arthur Eddington",
    "THIS LINK",
    "Harlow Shapley",
    "Shapley",
    "Eddington",
    "Adams",
    "R H Fowler",
    "Einstein",
    "Ernst Öpik",
    "Annie Jump Cannon",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}