{
  "nome_completo": "César-François Cassini de Thury",
  "nome_curto": "César-François Cassini de Thury",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cassini_de_Thury/",
  "data_nascimento": "17 June 1714",
  "local_nascimento": "Thury, near Clermont, Oise, France",
  "data_morte": "4 September 1784",
  "local_morte": "Paris, France",
  "summary": "César-François Cassini de Thury or Cassini III was a French geodesist who produced the first reliable maps of France.",
  "biografia": "César-François Cassini de Thury\nwas the son of\nJacques Cassini\nand the grandson of\nGiovanni Domenico Cassini\n. He is sometimes known as Cassini III. His mother, Suzanne-Françoise Charpentier, married\nJacques Cassini\nin\n1710\nand they had five children. César-François had two brothers; Dominique-Jean was the eldest and followed his father into the Chambre des Comptes, while Dominique-Joseph, César-François's younger brother, went on to a military career. He also had two sisters, Suzanne-Françoise and Elisabeth-Germaine. César-François was born at the family's Château at Thury which they used as a summer residence. He was brought up at the Paris Observatory, however, where his father had taken over as head around the time of his birth. It was in the Observatory that he received his education which was directed by his great uncle Jacques-Philippe Maraldi.\nCassini gained extremely valuable experience in assisting his father\nJacques Cassini\non his project to measure the perpendicular to the meridian from Saint-Malo to Strasbourg. The purpose of this project was to help settle the question regarding the shape of the Earth.\nNewton\nhad deduced from his theory of gravitation that the Earth would be flattened at the poles. Measurements by\nJacques Cassini\n, however, had supported the elongation theory, but there were others in France who supported the Newtonian view.\nMaupertuis\nwas one of the leading proponents of the theory that the Earth is flattened at the poles and the argument divided the\nAcadémie des Sciences\ninto two rival groups. In\n1733\nJacques Cassini\nand his son, assisted by other scientists, measured the perpendicular to the Paris meridian from Paris west to Saint-Malo. In the following year they surveyed the perpendicular to the meridian east of Paris, triangulating the area between Paris and Strasbourg.\nCésar-François Cassini, although only nineteen years old at the time, addressed the\nAcadémie des Sciences\nin\n1733\non the importance of the geodesic measurements he was carrying out with his father. The results of the survey seemed to support the views of\nJacques Cassini\nbut, after a while, the opponents to his theory in the Academy planned expeditions to Peru, led by\nBouguer\nand\nLa Condamine\n, in\n1735\n, and Lapland, under\nMaupertuis\nin\n1736\n, to measure the length of a meridian degree and to settle the argument. César-François Cassini on the other hand looked to extend the scope of the measurements which had been made in France and, in\n1735\n-\n36\n, he directed observations for a more general survey of the country. In truth, as Giovanni\nPoleni\npointed out in\n1733\n, the experimental error in the instruments used in these surveys was sufficient to make a decision between the two hypotheses impossible on the data available. In fact when\nMaupertuis\nreturned from the Lapland expedition in August\n1737\n, his data which strongly supported the flattening theory, was still not of sufficient accuracy to make the case certain.\nHad a proper statistical theory of errors been developed at that time, it would have been possible to give precise levels of probability to the theories and the flattening hypothesis would have been essentially confirmed. In fact the evidence was not strong enough to persuade\nJacques Cassini\n, who never conceded defeat, but it did convince César-François Cassini who made the difficult decision to change sides in the arguments and oppose his family's long held view. He now undertook a new survey of the meridian through Paris, setting up a large number of triangulation points in\n1739\n-\n40\nand undertaking the most accurate such survey to have been carried out up to that time. For example in Paris Cassini used the wooden belfry of the church of Saint-Pierre near the summit of Montmartre. To the south he used the tower of the medieval fortress of Montlhéry, and to the southeast the Malvoisine farmhouse roof served as an observation station. The Gothic church at Brie-Comte-Robert, the tower of the medieval fortress of Montjai, the Collégiale Chapel at Dammartin, and the church belfry of Saint-Martin-du-Terre were some of the other stations round Paris from which Cassini took observations.\nThe basic principle of surveying using triangulation was one which had been used for many years since it had been described by\nGemma Frisius\nin the\n16\nth\ncentury. It relied on the fact that if one built up a system of triangles, each successive one standing on one side of the previous one, then measuring the angles and finding an accurate distance for the length of just one side of one triangle was sufficient to give accurate measurements of the sides of all the triangles. The stations from which the observer took angular measurement of adjacent stations were the vertices of the triangles. Cassini's data supported the view that the Earth was flattened at the poles and he published his conclusions in\n1744\nin\nLa méridienne de l'Observatoire royal de Paris vérifiée dans toute l'étendue du royaume\nⓉ\n(\nThe meridian of the Royal Observatory of Paris checked throughout the kingdom\n)\n.\nIn\n1747\nCassini married Charlotte Drouin who was the daughter of Louis-François, Lord of Vandeuil. They had two children: a son, Jean-\nDominique Cassini\nborn in\n1748\n, who succeeded his father as Director of the Paris Observatory\n(\nand is sometimes known as Cassini IV\n)\n, and a daughter, Françoise-Elisabeth. In\n1748\nCassini, following in his father's footsteps, was appointed to the Chambre des Comptes, which was a financial court with administrative and legal duties relating to the King's accounts and in particular to the land owned by the Crown. He was also appointed to the office of King's Counsel.\nCassini's work on measuring the meridian was a minor one compared with his life-long work to survey France and produce an accurate map of the country. He began with a preliminary survey in\n1740\nwhen he reported that he had set up\n400\ntriangles on eighteen accurately measured bases and would use these to produce his first map of France. The map used the scale of\n1\n:\n870\n,\n000\nand consisted of\n18\nsheets. The\nAcadémie des Sciences\nannounced publication of the map in\n1745\nbut it only appeared over the period\n1746\n-\n47\n.\nDuring this period France was at war with Austria in a complicated argument resulting in the Wars of the Austrian succession. Cassini mapped the Netherlands and Flanders in\n1746\n-\n47\nwhile an indecisive campaign was being fought by the French in these lands against the Austrians. It seems a sad fact that throughout history showing that work is of military importance is a sure way to obtain funding. This is exactly what happened in this case for when Cassini showed his large scale maps of Flanders and the Netherlands to King Louis XV he immediately saw the military significance of high quality maps. He asked Cassini to produce maps of the whole of France drawn to the same scale, namely\n1\n:\n86\n,\n400\n. The plan made by Cassini was to produce the map in\n182\nsheets. He estimated the manpower required and the cost, telling the King that it would take\n20\nyears to complete the task. The money to finance the project was found, and Cassini began to train teams to undertake the work.\nBy\n1750\nsurveying was underway and it continued until\n1756\nwhen the French King withdrew his financial support. The reason was another war in which the French were involved, which started over an Austrian attempt to regain land lost in the Wars of the Austrian succession. The Seven Years War, however, was fought between the European countries as part of the struggle between Great Britain and France to control North America and other colonies. Wars are expensive and the French King needed all the money he could find. Cassini's expensive mapping project was one of the first casualties.\nCassini then approached the\nAcadémie des Sciences\nto help support his project to map France and to help him organise private funding for the project. The King allowed Cassini to set up an association which would fund the project, then have the rights to sell the map for thirty years. Fifty people, including the King and Madam de Pompadour, put up money to join the association which allowed the project to restart. Cassini was also able to raise money from many of the French provinces which were interested in obtaining the portion of the map relevant to their part of France.\nPerhaps with full support from the King, Cassini's estimate of twenty years to produce the map may have been close to the mark. In the event, given the difficulties, it took over thirty years to complete. In addition to the financial problems there were difficulties presented by local people who were highly suspicious of the surveyors who were erecting observation stations and using what to them seemed strange instruments. Related to these cartographic studies Cassini published\nGeometric description of the world\n(1775)\nand\nGeometric description of France\n(1783)\n. When Cassini died of smallpox in\n1784\nonly two of the\n182\nsheets of his map of France were still to be completed. The project was finished off by Cassini's son\nDominique Cassini\nwho had been helping his father with the project for the previous ten years.\nDespite many observations made by Cassini in his role as head of the Paris Observatory, his work in astronomy is of relatively little importance. In\n1771\nthe King made Cassini Director of the Observatory, creating the position of Director for the first time. The Directorship was to be a hereditary position and set up so that Cassini's son would succeed him, which he did in\n1784\n.\nTaton gives this summary of Cassini's achievements in\n[\n1\n]\n:-\nWhile he was a good geodesist and a talented cartographer, Cassini III was only a second-rate astronomer; and the name of this third representative of the Cassini dynasty at the Paris Observatory will remain associated with the first map of France produced according to modern principles.",
  "matematicos_citados_na_biografia": [
    "Jacques Cassini",
    "Giovanni Domenico Cassini",
    "Newton",
    "Maupertuis",
    "Académie des Sciences",
    "Bouguer",
    "La Condamine",
    "Poleni",
    "Gemma Frisius",
    "Dominique Cassini"
  ],
  "imagens": [
    "cassini_de_thury.jpg"
  ]
}