{
  "nome_completo": "Charles Louis Fefferman",
  "nome_curto": "Charles Fefferman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fefferman/",
  "data_nascimento": "18 April 1949",
  "local_nascimento": "Silver Spring, Maryland, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Charles Fefferman is an American mathematician who won a Fields Medal for work on partial differential equations and Fourier analysis. He was awarded the Wolf Prize in 2017 .",
  "biografia": "Charles Fefferman\n's parents were Arthur Stanley Fefferman\n(1918\n-\n2006)\nand Liselott Ruth Stern\n(1921\n-\n2008)\n. Arthur Fefferman was born in Brooklyn, New York, and was awarded a Master's Degree in economics from Columbia University in\n1941\n. He was appointed to the Treasury Department in Washington D.C. in\n1945\nand it was in Washington D.C. that his son Charles was born in\n1949\n. Arthur Fefferman studied for a doctorate in economics which he was awarded in\n1950\nfrom the New School for Social Research\n(\nnow New School University\n)\n. Liselott Stern was brought up in Germany where the schools she attended were keen on strict discipline but taught mathematics very badly. As a consequence she hated mathematics. Arthur Fefferman had enjoyed and excelled in mathematics at high school but had been told that it was not necessary for an economist and had not taken even a calculus course at university. However, he was extremely supportive of both his sons as they enthusiastically studied the subject. Charles has a younger brother Robert Fefferman who received his bachelor's degree in mathematics from the University of Maryland in\n1972\nand his Ph.D. from Princeton University in\n1975\nfor his thesis\nA Theory of Entropy in Fourier Analysis\n.\nFor more information about Fefferman's parents and his early years, see\nTHIS LINK\n.\nCharles Fefferman, known to his friends and colleagues as Charlie, was a child prodigy. He said\n[\n41\n]\n:-\nWhen I was a little boy I was interested in children's science: how rockets work and things like that, but I wasn't satisfied with simple explanations, so I checked a Physics textbook out of the public library and I couldn't understand anything. I was nine years old, and my father told me: \"Of course you can't understand this book, there's Mathematics in it!\" So I asked him if I could study Mathematics. I was in the fourth grade, and he bought me a\n4\nth grade Mathematics textbook. That was the beginning.\nIn fact he had mastered the calculus before the age of twelve. He explained how he got so rapidly to that level\n[\n41\n]\n:-\nI read the\n4\nth grade Mathematics textbook in a day or two. My father didn't believe me, so he asked me a few questions and realised that I understood. Then he bought me a\n5\nth grade textbook, and I read it in a day or two, and so on until I studied Calculus and that took longer than a day or two. But I was just a little boy studying Calculus so it was obvious that I had talent.\nThe Fefferman family were living in Silver Spring, Montgomery County, Maryland, a northern residential suburb of Washington, D.C. Fefferman's parents, realising that their twelve year old son had a remarkable talent for mathematics, took him to the University of Maryland, which was near their home, for tutoring. The story is related in\n[\n5\n]\n:-\nJim Hummel, an authority on complex variables, was sitting in his tiny office one morning in July\n1961\n. He got a phone call from the Feffermans. They had this avid\n6\nth grader who was consuming mathematics textbooks like candy. Would Professor Hummel talk with him? Professor Hummel would. So Mrs Fefferman drove Charlie from Silver Spring to College Park in their trusty Dodge. \"I wasn't scared,\" Charlie recalls, \"but I was really excited.\" Once a week for the rest of the summer, the two met for mathematical talk. Charlie was bright, indeed, so Hummel invited him back for the next summer. At a certain point during that second summer, Hummel realised that Charlie was a genuine mathematician, that he was already \"thinking like a mathematician.\" The point came when Charlie asked a searching question about the\nPeano\naxioms for integers.\nThe other university professors began to take an interest in the talented youngster. He entered Eastern Junior High in Takoma Park in\n1962\nbut never went to High School for he entered the University of Maryland in\n1963\nwhen he was fourteen years old. It required the university rules to be broken for someone so young to enter but, with difficulty, the professors managed to persuade the authorities to break their rules. In the same year his father left the government Office of Tax Analysis to become director of economic analysis for what became the American Council of Life Insurance. Charles was soon making a remarkable impression at the University of Maryland. After two weeks in John Horvath's calculus class it was clear that the material was far too elementary for Fefferman and he was put into John Brace's honours calculus course. At the age of\n15\n, when in his second year of study at the University of Maryland, he wrote his first mathematics paper\n[\n41\n]\n:-\nAt that time I had a wonderful professor of mathematical logic:\nCarol Karp\n, who was interested in what you might you say if you could speak in infinitely long sentences. There was a question about how many different things could be distinguished depending on what kind of infinity was in the infinitely long sentence. I was supposed to present a very complicated solution in class and I couldn't understand the very complicated proof, so I thought about my own proof and it turned out that it could be generalised. My professor was very supportive and said: \"Why don't you work this out and go further?,\" and then: \"Why don't you write it down?\" After that she said: \"Let's send it to a journal and see what happens,\" and it was accepted.\nThis is the paper\nCardinally maximal sets of non-equivalent order types\n(1967)\n.\nAt the University of Maryland, Fefferman took lots of mathematics and physics courses. However, his professors wanted to stretch the young boy and certainly the standard courses were not doing that so they gave him lots of problems and projects above the normal work of the class. Fefferman realised that he was receiving very special treatment with so many of the professors giving him personal tuition. He said\n[\n5\n]\n:-\nI think I was privileged to go there and I'll always be grateful to the mathematics department for doing a delicate job very well. The delicate part came because the members of the department could have pushed me too fast or, on the other hand, held me back. They didn't do either one. I believe they found exactly the right pace for my development.\nIn\n1966\n, at the age of\n17\n, he graduated with a B.S., with the highest distinction, majoring in Mathematics and Physics. He was awarded a\n3\n-year National Science Foundation Fellowship to undertake research. The High School he would have attended if he had not gone straight to University from Junior High was Montgomery Blair and, at this stage, the school presented him with an honorary diploma.\nAfter graduating from the University of Maryland, Fefferman undertook postgraduate work at Princeton University supervised by\nElias Stein\n. Fefferman was full of praise for his thesis advisor\n[\n41\n]\n:-\nMy thesis advisor,\nElias Stein\n, has had a tremendous influence on me; I think he was probably the best teacher of advanced mathematics in the world. He influenced me about what I learnt and formed my taste, and he taught me his spirit of optimism when facing hard problems.\nHe gives an example in the interview\n[\n37\n]\n:-\nI remember once he and I had to use some inequality of\nHardy\nand\nLittlewood\n. It was a little obscure and neither of us knew the proof. We went to the library\n(\nthis of course was long before the internet\n)\nand the complete works of\nHardy\nhad been checked out. I thought - checkmate, we have to wait till it comes back. But\nEli\nsaid, \"Never mind, if\nHardy\nand\nLittlewood\ncan prove it, then we can prove it too.\" We went back to his office and in a couple of hours we got the proof. That spirit that you can do it -\nEli\ncan give you that. There were many many other things he conveyed. He has a wonderful style of explaining maths in which almost all the effort of explaining goes into finding the right point of view and explaining the essence of the problem.\nFefferman was awarded his PhD in\n1969\nfor his thesis entitled\nInequalities for Strongly Regular Convolution Operators\n. He published two papers based on the material of his thesis,\nOn some singular convolution operators\n(1969)\nand\nInequalities for strongly singular convolution operators\n(1970)\n. In both of these papers Fefferman included the following acknowledgement:-\nI am deeply grateful to my adviser and teacher,\nE M Stein\n, for bringing these problems to my attention, and for his many helpful suggestions and criticisms.\nThese papers were not his first publications for, in addition to the paper mentioned above, he had already published\nA Radon-Nikodym theorem for finitely additive set functions\n(1967)\nand\nL\np\nL_{p}\nL\np\n​\nspaces over finitely additive measures\n(1968)\n, both appearing in the\nPacific Journal of Mathematics\n.\nWhile a graduate student at Princeton, Fefferman did have interests outside mathematics. In particular he was interested in politics and, when Senator Eugene McCarthy announced in November\n1967\nthat he would challenge Lyndon B Johnson in the Democratic primaries, Fefferman dabbled in his campaign. We note that McCarthy opposed American involvement in the Vietnam War. It is worth pointing out that Fefferman also supported George McGovern's campaign as the Democratic candidate for the\n1972\npresidential election.\nFefferman lectured at Princeton for the years\n1969\n-\n70\n. He moved to the University of Chicago in\n1970\nas an assistant professor and, one year later in\n1971\n, he was promoted to full professor there, earning him the distinction of becoming the youngest full professor ever appointed in the United States. He had a Alfred P Sloan Foundation Fellowship in\n1970\nand a NATO Postdoctoral Fellowship in\n1971\n. He had published five papers in\n1971\n, namely:\nOn the divergence of multiple Fourier series\n;\nCharacterizations of bounded mean oscillation\n;\nSome maximal inequalities\n;\nThe multiplier problem for the ball\n; and\nOn the convergence of multiple Fourier series\n. Also in\n1971\nhe was awarded the\nSalem\nPrize of\n5\n,\n000\nFrench Francs. This prize was established by the heirs of\nRaphael Salem\n, the French banker and famous mathematician, to be awarded to a young mathematician for outstanding work connected with the theory of\nFourier\nseries and related problems.\nIn\n1973\nFefferman returned to Princeton and, in October\n1974\n, he was introduced to Julie Anne Albert. She, like Feffermen, had been a child prodigy but Julie was a musical prodigy not a mathematical one. She had studied violin at the Juilliard School when she was only\n9\nyears of age and, when Feffermen met her, she was teaching music in a New York high school. They were married in\n1975\nand at that time Julie gave up her teaching career. They had two daughters, Nina Heidi Fefferman and Lainie Fefferman. Nina became a computational biologist who applies mathematics to model complex biological systems. Lainie studied music, was awarded a Ph.D. by Princeton, and is a nationally known composer.\nIn\n[\n5\n]\n, written after the birth of Nina but before the birth of Laine, Carl Bode writes:-\nThey live in a three-bedroom ranch style house; one small bedroom serves as Charlie's study. ... To stay in shape Charlie does Canadian air force exercises.\nIn\n1976\nhe was awarded the Alan T Waterman Award, being the first to receive this award. It is the United States' highest honorary award for scientists\n35\nyears of age or younger selected by the National Science Foundation. The award consisted of a medal and a grant of $\n50\n,\n000\na year for three years for advanced study or research at a U.S. institution of the recipient's choice. Feffermen remained at Princeton where, for three years, he was able to concentrate on research and not have teaching duties.\nFefferman contributed several innovations that revised the study of multidimensional complex analysis by finding correct generalisations of classical low-dimensional results. His work on partial differential equations,\nFourier\nanalysis, in particular convergence, multipliers, divergence, singular integrals and\nHardy\nspaces earned him a\nFields\nMedal at the International Congress of Mathematicians at Helsinki in\n1978\n. He had been a plenary speaker at the previous International Congress of Mathematicians held in Vancouver in August\n1974\nwhen he gave the lecture\nRecent Progress in Classical Fourier Analysis\n.\nIn\n1979\nFefferman described the way that he liked to work\n(\nsee\n[\n5\n]\n)\n:-\nI like to lie down on the sofa for hours at a stretch thinking intently about shapes, relationships and change - rarely about numbers as such. I explore idea after idea in my mind, discarding most. When a concept finally seems promising, I'm ready to try it out on paper. But first I get up and change the baby's diaper. ... New ideas are not easy to find. If you are lucky enough to be working on an idea which is actually right, it can take a long time before you know that it's right. Conversely, if you are going up a blind alley, it can also take a long time before you find out. You can end up saying \"Oops, I've been working for years on something wrong.\" A good mathematician must have the courage to take a lot of work and throw it away.\nFefferman described two topics that he worked on in a way that might be understood by non-mathematicians in\n[\n3\n]\n:-\nI would like to describe two of my contributions. The first is a connection between Kakeya sets and\nFourier\nanalysis. Kakeya sets are strange shapes in the plane. One can turn a\n1\n-inch-long needle through a full\n360\ndegrees, keeping the needle entirely inside a Kakeya set; yet the area of a Kakeya set is as small as you please.\nFourier\nanalysis is the study of how complicated vibrations break up into simple ones. For example, the complicated motion of a violin string is made up of a fundamental note, a first overtone, a second overtone, and so on. The sound of the violin string is degraded if the frequencies are removed. In part, that's because the violin string is one-dimensional. A photograph is a two-dimensional image, also built up from simple pieces analogous to the fundamental note and overtones of a string. Because a photo is two-dimensional, it may be out of focus yet come into sharp focus when its high frequencies are removed. That's because of the existence of Kakeya sets. I discovered this in the\n1970\ns. Kakeya sets in dimension higher than two continue to present challenging problems. The photos in this book are in perfect focus. Secondly, I've spent many years on mathematical problems about atoms. Any quantum mechanics textbook explains why one electron and one proton combine to make one hydrogen atom. The textbook won't tell you why a billion, billion, billion protons combine to make lots of hydrogen atoms. That's a much harder problem, which entails a lot of mathematics; the full solution isn't yet known. I made a contribution by reducing the problem to an estimate for the energy of the system.\nIn\n1984\nhe was appointed Herbert Jones Professor at Princeton. Fefferman was awarded the\nBergman\nPrize in\n1992\n. The citation from the awarding committee read\n(\nsee\n[\n4\n]\n)\n:-\nCharles Fefferman has made enormously important contributions to the study of the\nBergman\nkernel and has initiated much of the activity in the topic. ... Each of\n[\nthree of Fefferman's papers\n]\nis a 'tour-de-force', each contains not only results about the\nBergman\nkernel and its applications but each also develops highly original ideas and techniques which are of great importance...\nIn his reply Fefferman said\n[\n4\n]\n:-\nI am grateful to the selection committee for awarding me the\nBergman\nPrize.\nBergman\n's ideas have been a major influence in my work. They continue to provide deep, important problems for analysis.\nIn addition to the awards mentioned above, Fefferman had received many honours. These include election to the\nAmerican Academy of Arts and Sciences\n(1972)\n, election to the\nNational Academy of Science\nin\n1979\nand election to the American Philosophical Society in\n1989\n. He has received honorary degrees from the University of Maryland\n(1979)\n, Knox College\n(1981)\n, Bar-Ilan University\n(1985)\n, the University of Madrid\n(1990)\n, and the University of Warwick\n(2018)\n. In\n2008\nhe was awarded the\nBôcher\nMemorial Prize from the\nAmerican Mathematical Society\n[\n1\n]\n:-\n... for his many fundamental contributions to different areas of analysis, including his recent work on the\nWhitney\nextension problem. His important work in this area is contained in his papers 'A sharp form of Whitney's extension theorem', Annals of Math.\n161\n(2005)\n,\n509\n-\n577\n, and 'Whitney's extension problem for\nC\nm\nC^{m}\nC\nm\n', Annals of Math.\n164\n(2006)\n,\n313\n-\n359\n.\nIn his reply Fefferman said\n[\n1\n]\n:-\nI am grateful for my selection for the\nBôcher\nPrize and for the recognition of my work on\nWhitney\n's problem. That question and its close relatives have fascinated me for years. In solving them, I've had crucial help in the form of beautiful, highly original ideas due to several people.\nIn\n2009\nFefferman was made an honorary member of the\nLondon Mathematical Society\n. The citation reads\n[\n44\n]\n:-\nProfessor Charles Fefferman's contributions and ideas have had an impact on the development of modern analysis, differential equations, mathematical physics and geometry, with his most recent work including his sharp\n(\ncomputable\n)\nsolution of the\nWhitney\nextension problem.\nFefferman continues to work at Princeton and from\n1999\nto\n2002\nhe was Chair of the Department of Mathematics at Princeton University. In\n2012\n, in collaboration with C Robin Graham, he published the book\nThe Ambient Metric\n. The publisher's description is as follows:-\nThis book develops and applies a theory of the ambient metric in conformal geometry. This is a\nLorentz\nmetric in n +\n2\ndimensions that encodes a conformal class of metrics in n dimensions. The ambient metric has an alternate incarnation as the\nPoincaré\nmetric, a metric in n +\n1\ndimensions having the conformal manifold as its conformal infinity. In this realisation, the construction has played a central role in the AdS/CFT correspondence in physics.\nMichael G Eastwood writes in a review\n[\n21\n]\n:-\nThis monograph has been keenly anticipated for more than\n25\nyears! The publication of\n[\nC L Fefferman and C R Graham, 'Astérisque'\n1985\n, Numéro Hors Série,\n95\n-\n116]\ninitiated a revolution in the theory of local invariants on a conformal manifold just as\n[\nC L Fefferman, 'Adv. in Math.'\n31\n(2)\n(1979)\n,\n131\n-\n262]\nhad done on CR manifolds. ... Overall, this careful exposition has been well worth the wait!\nAs of October\n2023\n, Fefferman has around\n220\npublished items listed in MathSciNet. He has also made major contributions through his editorial work being on the editorial boards of: Communications in Partial Differential Equations; Advances in Mathematics; Revista Mat. Iberoamericana; Journal of Fourier Analysis and Applications; Proceedings of the National Academy of Sciences; and Journal d'Analyse. He has held Visiting Positions at many institutions including: Wilson Elkins Visiting Professorship, University of Maryland; California Institute of Technology; Courant Institute of Mathematical Sciences, New York University; University of Paris, France; Mittag-Leffler Institute, Djursholm, Sweden; Weitzmann Institute, Rehovot, Israel; Bar-Ilan University, Ramat-Gan, Israel; and University of Madrid, Spain. His relation with the mathematical community of Spain began when as a young professor at Chicago he became advisor to his first Ph.D. student who was Antonio Córdoba. The two became close friends, collaborated on various papers and the strong link with Spain was formed.\nIn\n2017\nFefferman was awarded the Wolf Prize. The citation ends as follows\n[\n12\n]\n:-\nCharles Fefferman is awarded the Wolf Prize for making major contributions to several fields, including several complex variables, partial differential equations and subelliptic problems. He introduced new fundamental techniques into harmonic analysis and explored their application to a wide range of fields including fluid dynamics, spectral geometry and mathematical physics. This had a major impact on regularity questions for classical equations such as the\nNavier\n-\nStokes\nequation and the\nEuler\nequation. He solved major problems related to the fine structure of solutions to partial differential equations.\nFor more details of the citation for the Wolf Prize, see\nTHIS LINK\n.\nIn\n2022\nFefferman was awarded the BBVA Frontiers of Knowledge award. Fefferman was nominated for the award by, among others, Antonio Córdoba, Professor Emeritus of Mathematical Analysis at the Universidad Autónoma de Madrid. In his nomination Córdoba wrote that Fefferman\n[\n40\n]\n:-\n... stands out as an all-rounder. The normal thing is for a mathematician to make fundamental contributions in one or two areas; Fefferman has made them in harmonic analysis, partial differential equations, problems in quantum mechanics, and in the field of fluid mechanics, where he came up with a result that suggested a whole new tack for understanding turbulence.It is this broad sweep that makes Fefferman such an exceptional mathematician.\nThe citation for the award states that Fefferman\n[\n40\n]\n:-\n... has introduced ground-breaking techniques to study the detailed structure of functions and the behaviour of solutions to partial differential equations, including those arising in fluid dynamics.\nIn an interview after hearing of the award, Fefferman explained that, for him, jumping between fields is second nature:-\nI have the feeling that I don't pick the problems, they pick me. I hear about a problem and it is so fascinating that I cannot stop thinking about it. If it happens to be in a field I have not worked in before but I think I have a chance to get involved and maybe do something, then I try.\nLet us end with the words of Fefferman's daughter Lainie Fefferman when graduating with a Ph.D. in music from Princeton University in\n2015\n[\n31\n]\n:-\nLainie Fefferman, who is receiving her Ph.D. in music composition, elected to have her father, Charles Fefferman, the Herbert E Jones Jr. '\n43\nUniversity Professor of Mathematics, present her hood as it was his love of music that inspired her path. The final chapters of Lainie Fefferman's dissertation examined recordings of the song cycle \"Winterreise\" by Austrian composer Franz Schubert, which was a beloved collection of her father's during her childhood. Recollections of him singing along to a recording of the song cycle are \"a treasured memory that kept me going through many long workdays,\" she said. \"Growing up, my dad showed me a passion for beautiful albums even before I knew I had any myself,\" said Lainie Fefferman, whose adviser was Paul Lansky, the William Shubael Conant Professor, Emeritus. \"My dad is a huge appreciator of beauty - in the elegance of good math and in the aesthetics of the world around him,\" she said. \"It is that aestheticizing of the world and that love of beauty I carry with me always, and it is one of the biggest ingredients in my voice as a composer. Strong, simple ideas - they're my passion now thanks to my lovely dad.\"",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Peano",
    "Carol Karp",
    "Elias Stein",
    "Hardy",
    "Littlewood",
    "Eli",
    "E M Stein",
    "Salem",
    "Raphael Salem",
    "Fourier",
    "Fields",
    "Bergman",
    "American Academy of Arts and Sciences",
    "National Academy of Science",
    "Bôcher",
    "American Mathematical Society",
    "Whitney",
    "London Mathematical Society",
    "Lorentz",
    "Poincaré",
    "Navier",
    "Stokes",
    "Euler"
  ],
  "imagens": [
    "fefferman.jpg"
  ]
}