{
  "nome_completo": "Charles Coffin Sims",
  "nome_curto": "Charles Sims",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sims/",
  "data_nascimento": "14 April 1937",
  "local_nascimento": "Elkhart, Indiana, USA",
  "data_morte": "23 October 2017",
  "local_morte": "St Petersburg, Florida, USA",
  "summary": "Charlie Sims was an American mathematician best known for his work in group theory and in particular for the discovery of one of the sporadic simple groups.",
  "biografia": "Charles Sims\nwas known to his friends and colleagues as Charlie. His parents were Ernest McPherson Sims\n(1883\n-\n1973)\nand Natalie Cornelia Coffin\n(1899\n-\n1987)\n. Ernest McPherson Sims, born in Indianapolis, Indiana, on\n1\nApril\n1883\n, was  the President and General Manager of a Metal Forming Company. He married Natalie Coffin on\n6\nMarch\n1936\nin Indianapolis, Marion, Indiana. Natalie Coffin, born in Indianapolis, Indiana, on\n12\nSeptember\n1899\n, was described as a housewife when Charles, the subject of this biography, was born. At this time the family were living at\n509\nLaurel Street, Elkhart, and Charles was born in Elkhart General Hospital. Two years later, on\n12\nSeptember\n1939\n, Charles' sister, Mary Jean Sims was born. At this time the family were living at\n1901\nGreenleaf Boulevard in Elkhart. At the time of the\n1940\nCensus, the family are still living in Greenleaf Boulevard, but at this time Natalie is described as Secretary of her husband's  Metal Forming Company.\nCharles Sims attended both Elementary and High School in his home town of Elkhart, Indiana. After graduating from High School, he entered the University of Michigan where he first obtained an undergraduate degree then continued to undertake research for a Ph.D. at Harvard University advised by\nJohn Thompson\n. He looked at the number of isomorphism class of groups of order\np\nn\np^{n}\np\nn\nwhich\nGraham Higman\nhad shown was\np\nA\nn\n3\np^{An^{3}}\np\nA\nn\n3\n, where\nA\nA\nA\n, depending on\np\np\np\nand\nn\nn\nn\n, satisfies\n2\n27\n−\no\n(\nn\n)\n≤\nA\n≤\n2\n15\n+\no\n(\nn\n)\n.\n\\large\\frac{2}{27}\\normalsize  - o(n) ≤ A ≤ \\large\\frac{2}{15}\\normalsize  + o(n).\n2\n7\n2\n​\n−\no\n(\nn\n)\n≤\nA\n≤\n1\n5\n2\n​\n+\no\n(\nn\n)\n.\nIn his thesis\nEnumerating p-groups\nSims improved this result to show\nA\n=\n2\n27\n+\nO\n(\nn\n−\n1\n3\n)\n.\nA = \\large\\frac{2}{27}\\normalsize  + O(n^{-\\large\\frac{1}{3}\\normalsize} ).\nA\n=\n2\n7\n2\n​\n+\nO\n(\nn\n−\n3\n1\n​\n)\n.\nHe was awarded a Ph.D. in\n1963\nand published a paper based on his thesis, and with the same title, in\n1965\n. G Zappa, in a review of the paper states:-\nThe proof is very complicated and is based on several interesting propositions.\nWhile at Harvard, Sims met Annette, born\n7\nOctober\n1941\n, when both were singing in the choir of Harvard-Epworth United Methodist Church on Massachusetts Avenue, Cambridge, Massachusetts. They later married in about\n1969\nand had two children, Mark Christopher Sims\n(\nborn on\n24\nDecember\n1971)\nand Amy Sims\n(\nlater Amy Novack\n)\n.\nAfter the award of his doctorate, Sims taught for a short while at the Massachusetts Institute of Technology before being appointed to Rutgers University, New Brunswick, New Jersey, in\n1965\n. Charles and Annette C Sims lived at first at\n52\nTerhune Road in Princeton, but later moved to Allenhurst, a small town on the Atlantic Coast near Asbury Park.\nSims' research soon turned to permutation groups and computational techniques in general. His second paper after the\n1965\npublication arising from his doctoral thesis, was\nOn the group\n(2\n,\n3\n,\n7\n;\n9)\n(1968)\nin which he was able to use a computer implementation of the\nTodd\n-\nCoxeter\ncoset enumeration algorithm to show a group to be infinite. He did this by proving the periodicity of the output of the algorithm. Sims' next paper was\nComputation of invariants in the theory of cyclotomic fields\n(1966)\n. In this paper he used an IBM\n7094\ncomputer to compute properties of the cyclotomic field of\np\nn\n+\n1\np^{n+1}\np\nn\n+\n1\nth roots of unity over the rationals for all primes up to\n4001\n. His next two papers were\nGraphs and finite permutation groups\nI\n(1967)\nand\nGraphs and finite permutation groups\nII\n(1968)\n. In these papers he produces:-\n...\n[\na\n]\nrelationship between transitive groups and graphs\n[\nwhich\n]\ngives new insight into known group-theoretic results and is applied to obtain new theorems about primitive groups which are not doubly transitive.\nIn\n1967\nSims made a major breakthrough when, working with Donald Higman, he discovered the previously unknown sporadic simple group now known as the Higman-Sims group. Using Donald Higman's theory of rank\n3\ngroups, they constructed this group as a rank\n3\nextension of the\nMathieu\ngroup\nM\n22\nM_{22}\nM\n2\n2\n​\n. The\nHigman\n-Sims group is a primitive permutation group of degree\n100\n, has order\n44\n352\n000\nand has rank\n3\n. They described the group in the paper\nA simple group of order\n44\n352\n000\nwhich appeared in\nMathematische Zeitschrift\nin\n1968\n.\nSims made another major breakthrough which he announced to the conference\nComputational Problems in Abstract Algebra\nheld in Oxford, England,\n29\nAugust to\n2\nSeptember\n1967\n. The conference proceedings, edited by\nJohn Leech\n, was published\n(\nafter a rather unfortunate delay\n)\nin\n1970\n. In the paper corresponding to his talk, Sims wrote:-\nOne of the oldest problems in the theory of permutation groups is the determination of the primitive groups of a given degree. During a period of several decades a great deal of effort was spent on constructing the permutation groups of low degree. For degrees\n2\nthrough\n11\nlists of all permutation groups appeared. For degrees\n12\nthrough\n15\nthe lists were limited to the transitive groups, while only the primitive groups of degrees\n16\nthrough\n20\nwere determined. ... The basic assumption of this paper is that it would be useful to extend the determination of the primitive groups of low degree and that with recent advances in group theory and the availability of electronic computers for routine calculations it is feasible to carry out the determination as far as degree\n30\nand probably farther. Ideally one would wish to have an algorithm sufficiently mechanical and efficient to be carried out entirely on a computer. Such an algorithm does not yet exist. The procedure outlined in this paper combines the use of a computer with more conventional techniques. ... The paper concludes with a short description of a computer program for finding the order and some of the structure of the group generated by a given set of permutations and with a list of the\n129\nprimitive groups of degree not exceeding\n20\n.\nThe computer program that Sims refers to in the final sentence is now known as an implementation of the\nSchreier\n-Sims algorithm, a linear time algorithm devised by Sims to find the order of a permutation group given generating permutations. The method allows other information about the permutation group to be found such as whether a given permutation is a member. The name of\nOtto Schreier\nis included since it is based on theory introduced by him. Sims writes in his\n1970\narticle:-\nA computer program of the type described has been written for the IBM\n7040\nat Rutgers. In its present form it can handle any group of degree\n50\nor less and can be of some use up to degree\n127\n.\nJoachim Neubüser\nwrites\n[\n4\n]\n:-\nI think that Charles silently followed the good old saying that the proof of a pudding is in its eating and that similarly the proof of an algorithm is in its use and he did indeed prove the existence of three sporadic simple groups by constructing them as permutation groups using his '\nSchreier\n-Sims' method.\nIn fact Sims announced the existence and uniqueness of Lyons' group at the conference\nFinite groups '\n72\nheld at the University of Florida, Gainesville, Florida,\n23\n-\n24\nMarch\n1972\n. At the conference\nComputational methods for representations of groups and algebras\nat the University of Essen, Essen,\n1\n-\n5\nApril\n1997\n, Sims and George Havas gave a presentation for this Lyons finite simple sporadic group. They stated:-\nWe give a presentation of the Lyons simple group together with information on a complete computational proof that the presentation is correct. This fills a long-standing gap in the literature on the sporadic simple groups. This presentation is a basis for various matrix and permutation representations of the group.\nIn\n1977\n, in collaboration with Jeffrey Leon, Sims proved the existence and uniqueness of a simple group generated by {\n3\n,\n4\n}-transpositions. This group, first conjectured to exist by Bernd Fischer in\n1971\n, is generated by a class of involutions such that the product of any non-commuting pair has order\n3\nor\n4\n.\nSims' outstanding research contributions were recognised in\n1972\nwhen he received the Rutgers University Board of Trustees Award for Excellence in Research.\nLet us look now at some contributions that Sims made to the teaching and administration at Rutgers University. He was the chair of the new Faculty of Arts and Sciences Mathematics Department from\n1982\nuntil\n1984\nand was the Associate Provost during\n1984\n-\n1988\n. His computer expertise was important to his service as Associate Provost for Computer Planning from\n1984\nto\n1987\nand later he served as Undergraduate Vice-Chair of the Mathematics Department from\n1992\nto\n1999\n. In this last mentioned role we quote from the introduction he wrote to \"News From the Undergraduate Program\" in three Mathematics Department Newsletters. On\n18\nFebruary\n1998\nSims wrote\n[\n6\n]\n:-\nThis issue of the newsletter is one of the longest since publication began five years ago. A lot is happening in the undergraduate program. There are job opportunities for full- and part-time recitation instructors. We continue to teach more and more students. There are important developments in our courses and in the instructional strategies used by our teachers. Finally the Word Wide Web is having a dramatic impact on the entire educational process, not just in mathematics but across all disciplines.\nOn\n3\nFebruary\n1999\nSims wrote\n[\n7\n]\n:-\nThis issue contains some good news and some bad news. For example, the department expects to receive a large grant from the National Science Foundation, there is a growing number of programs that involve undergraduates in mathematics research, and one of our tutorial assistant's had an important role in a Rutgers conference on teaching and learning. However, cheating on mathematics tests appears to be on the rise and the department does not have the resources needed to meet demand for certain kinds of mathematics courses. All of these topics deserve serious discussion.\nOn\n3\nMay\n1999\nSims wrote\n[\n8\n]\n:-\nSince I am stepping down as vice chair effective May\n31\n,\n1999\n, this is my last issue of the Newsletter. This issue summarizes the administrative changes taking place in the department. There are also descriptions of employment opportunities for undergraduates in the instructional program, reports of honours received by both students and faculty, and information about the effect of recent changes in our approach to teaching calculus.\nSims also organised conferences and workshops at Rutgers. For example he organised a 'Workshop on Symbolic Software for Mathematical Research' at Rutgers University held\n11\n-\n15\nMarch\n1991\n. His abstract, written shortly before the workshop took place, states:-\nA workshop will be held to bring together leading mathematicians and experts in the development of symbolic software. The goal of the workshop will be to identify areas of mathematical research which would benefit from improvements in symbolic software, to discuss the form that new software should take, and to explore the possibility of setting up a multi-national development project to produce symbolic software needed for mathematical research. The workshop will focus primarily, but not exclusively, on research in such fields of algebra as number theory, group theory, algebraic geometry, and commutative algebra. The workshop is in part a response to recommendations in a recent report to the National Science Foundation urging increased activity in the field of symbolic computation.\nSims wrote two books, the first being\nAbstract algebra: A computational approach\n(1984)\n. Boris Schein begins a review of the book as follows:-\nThis is a textbook for a one-year introductory course in abstract algebra with an emphasis on computation and algorithmic questions. However, it is not a book on applied algebra, and it is not a book on numerical linear algebra; the emphasis of the book is on exact computation. The goals of the book are to introduce students to the basic concepts and results of algebra, present the concept of an algorithm and discuss certain algebraic algorithms, show how computers can be used to solve algebraic problems and to provide a library of relevant computer programs, and to describe the APL computer language.\nThe second book is the monograph\nComputation with finitely presented groups\n(1994)\n. We present a summary of Sims' Preface and his Introduction. Here is an extract from the Preface:-\nIn\n1970\n, John Cannon,\nJoachim Neubüser\n, and I considered the possibility of jointly producing a single book which would cover all of computational group theory. A draft table of contents was even produced, but the project was not completed. It is a measure of how far the subject has progressed in the past\n20\nyears that it would now take at least four substantial books to cover the field, not including the necessary background material on group theory and the design and analysis of algorithms. In addition to a book like this one on computing with finitely presented groups, there would be books on computing with permutation groups, on computing with finite solvable groups, and on computing characters and modular representations of finite groups. Computational group theory was originated by individuals trained as group theorists. However, there has been a steadily increasing participation in the subject by computer scientists. There are two reasons for this phenomenon. First, group-theoretic algorithms, particularly ones related to permutation groups, were found to be useful in attacking the graph isomorphism problem, a central problem in theoretical computer science. Once computer scientists began looking at group-theoretic algorithms, it was natural for them to attempt to determine the complexity of these algorithms. Second, the techniques and data structures of computer science have proved valuable in improving existing group-theoretic algorithms and in developing new ones. This book is intended to be a graduate-level text. I have made a deliberate attempt to make the material accessible to students of both mathematics and computer science.\nHere is an extract from the Introduction:-\nThis book describes computational methods for studying subgroups and quotient groups of finitely presented groups. The procedures discussed belong to one of the oldest and most highly developed areas of computational group theory. In order to better understand the context for this material, it is useful to know something about computational group theory in general and its place within the area of symbolic computation. The mathematical uses of computers can be divided roughly into numeric and nonnumeric applications. Numeric computation involves primarily calculations in which real numbers are approximated by elements from a fixed set of rational numbers, called floating-point numbers. Such computation is usually associated with the mathematical discipline numerical analysis. Examples of numerical techniques are\nSimpson\n's rule for approximating definite integrals and\nNewton\n's method for approximating zeros of functions. One nonnumeric application of computers to mathematics is symbolic computation. Although it is impossible to give a precise definition, symbolic computation normally involves representing mathematical objects exactly and performing exact calculations with these representations. It includes efforts to automate many of the techniques taught to high school students and college undergraduates, such as the manipulation of polynomials and rational functions, differentiation and integration in closed form, and expansion in\nTaylor\nseries.\nJoachim Neubüser\nwrote a review of\nAbstract algebra: A computational approach\nand kindly sent us a copy. It can be read at\nTHIS LINK\n.\nSims retired from Rutgers University in\n2007\nand, with his wife Annette, went to live in St Petersburg, Florida\n[\n2\n]\n:-\nAfter retirement, Charles continued to help students learn mathematics by tutoring local children in St Petersburg. He was a devoted husband, brother, and father and active in church and church choirs throughout his life.\n[\nCharles and Annette\n]\nenjoyed their community, four dogs and cat, and spending time on Tampa Bay on their boat. Charles also collaborated with his sister Mary Jean on preserving family archives. He was a modest, kind, much-loved man who left lasting impressions on everyone he met or who benefited from his academic work.\nSims and his wife lived at\n2824\nCoffee Pot Boulevard Northeast in St Petersburg, a house with a balcony, palm trees in the garden, and a wonderful view looking over the water of Coffee Pot Bayou.\nIn\n2012\nthe\nAmerican Mathematical Society\nintroduced the Class of Fellows:-\nThe Fellows of the\nAmerican Mathematical Society\nprogram recognizes members who have made outstanding contributions to the creation, exposition, advancement, communication, and utilization of mathematics.\nCharles C Sims, The State University of New Jersey New Brunswick, was elected to the Inaugural Class of Fellows.\nLet us quote from a tribute written by Peter Cameron\n[\n1\n]\n:-\nSims was one of the most influential figures in computational group theory, but was much more besides. His name is attached to two sporadic simple groups; the one I know best, the Higman-Sims group, was found without any recourse to computation at all. It is a subgroup of index\n2\nin the automorphism group of a graph on\n100\nvertices, constructed from the\n22\n-point\nWitt\ndesign. The graph had been constructed earlier by Dale Mesner ... Indeed, from my point of view,\nHigman\nand Sims were the two people who introduced graph theory into the study of permutation groups. I was lucky enough to be in on the ground floor, beginning my doctoral studies in\n1968\n(\nthe year after the\nHigman\n-Sims group was found, though I wasn't yet in Oxford on that memorable occasion\n)\n. ... I first met Sims in the early\n1970\ns, when he came to a miniconference on permutation groups organised by\nPeter Neumann\n. One thing that I recall is that, at\nPeter\n's house, we were discussing perfect pitch; Charles pulled out his watch and asked me to put my ear to it and tell him the pitch of the tone.\n(\nAs I recall, the mechanism caused it to vibrate at\n360\nhertz.\n)\nSims died at the Marion and Bernard L Samson Nursing Center in St Petersburg, Florida. His funeral was held on Saturday,\n11\nNovember\n2017\n, at the Anderson McQueen Funeral Home located at\n2201\nDr Martin Luther King Street North, St Petersburg, Florida. It was followed by a committal service at The Church of the Beatitudes in St Petersburg.",
  "matematicos_citados_na_biografia": [
    "John Thompson",
    "Graham Higman",
    "Todd",
    "Coxeter",
    "Mathieu",
    "Higman",
    "John Leech",
    "Schreier",
    "Otto Schreier",
    "Joachim Neubüser",
    "Simpson",
    "Newton",
    "Taylor",
    "THIS LINK",
    "American Mathematical Society",
    "Witt",
    "Peter Neumann",
    "Peter"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}