{
  "nome_completo": "Charles Shirra Dougall",
  "nome_curto": "Charles Shirra Dougall",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dougall_Charles/",
  "data_nascimento": "3 September 1868",
  "local_nascimento": "Kippen, Stirlingshire, Scotland",
  "data_morte": "2 January 1930",
  "local_morte": "Stirling, Scotland",
  "summary": "Charles Shirra Dougall was a Scottish school teacher who became Rector of Dollar Academy.",
  "biografia": "Charles Shirra Dougall\n's father was  Robert Dougall\n(\nborn Glasgow\n1840)\nwho was a watch and clock maker as well as the local postmaster. His mother was  Jane Shirra\n(\nborn\n1850)\n. His parents married in Stirling on\n16\nOctober\n1864\n.\n[\n3\n]\nJohn Dougall had eight siblings:\nJohn Dougall\n(\nborn\n1867)\n, Annie\n(\nborn\n1870)\n, Jessie\n(\nborn\n1873)\n, Robert\n(\nborn\n1874)\n, Mary\n(\nborn\n1876)\n, James\n(\nborn\n1878)\n, Elizabeth\n(\nborn\n1880)\nand Norma\n(\nborn\n1899)\n.\nCharles' elder brother,\nJohn Dougall\nhad studied mathematics at the University of Glasgow a couple of years earlier. John, like Charles, achieved distinction during his undergraduate years and has a biography in this archive.\nCharles Dougall entered the University of Glasgow after having studied at the EC Normal College. In\n1887\n-\n88\nhe was placed\n11\nth\nin the Senior Division of Logic and Rhetoric. He came third in the Upper Juniors A Division in Mathematics in\n1888\n-\n89\n, then was the top student in the Middle B Division in\n1889\n-\n90\n. His performance in the written examinations in\n1889\n-\n90\nwas such that he received the Prize which was open to students of both A Division and B Division. In this year of great achievement, he was awarded the Junior Muir Bursary in Mathematics. Only at this stage did he begin to take Natural Philosophy classes, taking the First Year course in\n1890\n-\n91\n. In November\n1890\nhe received a distinction in Classical Literature. In April\n1891\nhe passed the examinations in Mental Philosophy and was highly placed in the examinations for the Senior English Literature course. He was ranked first in the Senior Mathematics Class of\n1891\n-\n92\nand, after being ranked first in the written examination, was awarded the Muir Senior Bursary in Mathematics. He was awarded the Cunninghame Gold Medal after coming top in the Upper Senior Mathematics class of\n1892\n-\n93\nand, in the following session, came top in the Higher Course in Natural Philosophy. Dougall was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy from the University of Glasgow in\n1894\n.\nFor details of Dougall's teaching career up to his appointment as Rector of the Dollar Institution, we quote from\n[\n2\n]\n:-\nIn\n1890\nMr Dougall was appointed Assistant Mathematical Master in Garnethill School, Glasgow, and two years later was transferred to Whitehill School, Dennistoun, where for six years he was at the head of the Mathematical Department. In\n1898\nhe was appointed to the Headmastership of Ewart High School, Newton Stewart, which is of the same class as Dollar Institution. There he acquired valuable experience, not only of the general work of a Higher Class School, but also of the special requirements of a school which aims to be conducted on modern lines.\nWe trust that Mr Dougall will never have cause to regret the step he has taken in coming to Dollar, and that the Governors and all well-wishers will have every ground for satisfaction in the choice which has been made of a Headmaster to our far-famed Academy.\nDougall's appointment as Rector of Dollar Institution, followed\nGeorge Thom\n's retirement due to ill health. The following by Bruce Baillie, former archivist at Dollar Academy, explains in details Dougall's contributions during his period as Rector of Dollar Institution:-\nMr Charles Dougall was Rector from\n1902\n-\n1923\n. Educated in the University of Glasgow, he took an MA in Mathematics and Natural Philosophy, along with an earlier Distinction in Classics. He was the Cunninghame Gold Medallist in\n1892\n, having held the Eglinton Fellowship in\n1890\n. His teaching career was based in the West of Scotland - as teacher of Mathematics in Garnethill School in Glasgow, Head of Mathematics in Whitehill School, Dennistoun, and finally as Headmaster of the Douglas Ewart High School in Newton Stewart. A noted Burns scholar, he published the Life and The Collected Poems of Burns. A vigorous Rector, he suffered badly during the First World War through overwork and breakdown. His son Charles was shot down by one of Richthofen's pilots, injured and imprisoned. His daughter Elizabeth, like her father, wrote poetry, and she married John Hogben, a former pupil, who became the proprietor of the Edinburgh Book Shop in George Street - a branch of Thin's - and they founded the Moray Press. There was a wide range of achievements during his Rectorship - The Dollar Magazine began in\n1902\n, the Cadet Corps in\n1903\n, girls' hockey in the same year and he himself raised funds for the boys' pavilion in\n1908\n; the science block was designed by Rowand Anderson and built in\n1910\n. The Quints were established in\n1911\n, and the Pipe Band in\n1913\n. There were aims to provide a swimming pool, but, surprisingly, not enough water. The walls to the south were lowered, and railings provided. The gates on Cairnpark Street at Academy Place were probably added at this time. The Institution became the Academy in\n1918\n, and a new school badge was approved by the Lord Lyon King of Arms. Girls' sports were established in\n1918\n. The cricket pitch\n(\nBowfold Park\n)\nwas bought by fund-raising to mark the Centenary of the school, and the War Memorial was put in place in\n1921\n. During Dougall's Rectorship, the Government introduced the National Pay Scale. The Academy was unable to pay its staff, and the Governors handed over the school to Clackmannanshire in\n1921\nand a new body of Governors was appointed by the County. Dougall resigned through ill health in\n1922\n, and died in Stirling in\n1930\n. His achievements suggest that he was an outstanding Headmaster, though the final comments by the Editor of the magazine in his retiral year give grudging acknowledgement of his spell in office.\nThis 'grudging acknowledgement' is the final sentence of\n[\n4\n]\nwhich reads:-\nMr Dougall, take him all in all, will go down in the history of the School as one of its foremost headmasters.\nTHIS LINK\ngives\n[\n4\n]\n, the complete obituary of C S Dougall in\nTbe Dollar magazine\n.\nIn the above quote by Bruce Baillie, reference is made to Dougall's expertise as a Burns scholar. He has two major publications on Burns, the first being\nThe Burns Country\nwhich he published in\n1904\n. The second is\nRobert Burns poems, epistles, songs, epigrams & epitaphs\n, a collection of Burns' work edited by Dougall. In addition he was a Freemason and addressed meetings on the topic of Burns. For example a report by the Glasgow Masonic Burns Club reads:-\n... on the\n31\nst  January,\n1919\n, a number of Brethren from various Lodges met in the Bath Hotel, Glasgow ...\n[\nT\n]\nhe Chair was taken by Brother J S Jamieson of Lodge St John, No.\n3\nbis, who, having outlined the purpose of the meeting, called upon Brother Charles S Dougall, M.A., rector of Dollar Academy, to give an address on 'Burns and Freemasonry'.\nDougall joined the\nEdinburgh Mathematical Society\nin January\n1897\nwhen teaching at Whitehill School in Glasgow. His brother,\nJohn Dougall\n, although only eighteen months older, had already been a member of the Society for twelve years. Charles Dougall remained a member of the Society throughout his life.\nFinally we give the notice which appeared in the press announcing his death:-\nDOUGALL.- At \"The Inclosure,\" Stirling, the residence of his sister, Mrs T B Ferguson, suddenly, on\n2\nJanuary\n1930\n, Charles Shirra Dougall, M.A., J.P., Rector Emeritus of Dollar Academy, and lately of\n23\nCargil Terrace, Edinburgh, second son of the late Robert Dougall, Kippen.",
  "matematicos_citados_na_biografia": [
    "John Dougall",
    "George Thom",
    "THIS LINK",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}