{
  "nome_completo": "Charles Hutton",
  "nome_curto": "Charles Hutton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hutton/",
  "data_nascimento": "14 August 1737",
  "local_nascimento": "Newcastle-upon-Tyne, England",
  "data_morte": "27 January 1823",
  "local_morte": "London, England",
  "summary": "Charles Hutton was an English mathematician who wrote arithmetic textbooks.",
  "biografia": "Charles Hutton\n's father, who was a supervisor in a colliery, was descended from a respectable Westmoreland family. Charles, the youngest of his parents sons, was born in Percy Street, Newcastle-on-Tyne. He was brought up in Newcastle where his father died when he was five years old, but his mother remarried the foreman of Old Long Benton pit whose name was Fraim. Charles suffered an unfortunate injury when he was seven years old. He became involved in a fight with some other children and his left elbow was dislocated. Had young Charles told his parents immediately it is probable that doctors could have done enough to allow it to heal over time. However, he kept it from his parents for long enough that by the time it was treated it was impossible to save him from a permanent disability. Without this injury it is almost certain that Charles would have followed in his brothers footsteps and, like his father and his stepfather, would have gone to work at the colliery. His parents decided that if he could not do manual work then they would send him to school to learn to read and write.\nRiddle tells us of Hutton's education in\n[\n7\n]\n:-\nHe was taught to read by an old woman who conducted a little school in the neighbourhood, and to write by a schoolmaster named Robson, near Benwell, a village near Newcastle; and he attended afterwards a school at Jesmond, kept by the Rev. Mr Ivison, a clergyman of the English Church; and on Mr Ivison's removal to a curacy in the county of Durham, Mr Hutton succeeded him in his school at Jesmond.\nIn fact Hutton did work for a short time at Old Long Benton colliery between the time Mr Ivison left the school and when Hutton succeeded him. He was so successful in this school in Jesmond that he soon moved to larger premises in the neighbourhood. At this stage Hutton began studying mathematics at evening classes at Mr James' school in Newcastle. In\n1760\nHutton opened the Mathematical School in Newcastle but he also taught at the main secondary school in the city. He was fortunate to have a number of private pupils from the local land owning families who helped further his career. Riddle tells us that\n[\n7\n]\n:-\n... his manners, as well as his talents, rendered him acceptable as a private teacher in the families of the higher classes.\nOn the other hand these \"higher class\" people benefited greatly from the high quality of teaching that Hutton provided. One such was Robert Shafto, whose children were taught by Hutton, who not only gave Hutton access to his extensive library but also persuaded him to begin publishing texts.\nHutton had some pupils who went on to become more famous than their schoolmaster. One such was John Scott who was born in Newcastle in\n1751\nand went on to be lord chancellor of England between\n1801\nand\n1827\n. King George IV made Scott Viscount Encombe and Earl of Eldon in\n1821\n. Another of Hutton's pupils was Elizabeth Surtees, from an important family of wealthy bankers in Newcastle, who later became John Scott's wife.\nEncouraged by Shafto, Hutton published his first textbook\nThe Schoolmaster's Guide, or a Complete System of Practical Arithmetic\nat Newcastle in\n1764\nwhich he dedicated to Robert Shafto. It was an elementary arithmetic text which was soon was adopted widely. He now saw his opportunity to educate schoolmasters and provide them with further mathematical training so he advertised in\n1766\nand\n1767\n(\nsee\n[\n5\n]\n)\n:-\nAny schoolmaster, in town or country, who is desirous of improvement in any branch of the mathematics, by applying to Mr Hutton, may be instructed.\nThe next textbook which Hutton published, again at Newcastle, was\nA Treatise on Mensuration\n. The book was, in his own words:-\n... adapted particularly to the uses of schools, mathematicians and mechanics.\nThomas Bewick, born in\n1753\n, was an apprentice in Newcastle when he undertook the illustrations in Hutton's\nA Treatise on Mensuration\n(1767\n-\n1770)\n. Bewick rediscovered the technique of wood engraving which he went on to establish as a major book illustrating technique but Hutton's book was his first assignment. Hutton certainly made an inspired choice in having Bewick illustrate his book. The fact that\n59\nschoolmasters from the Newcastle area subscribed to the text before its publication tells us that Hutton had by this time acquired an excellent reputation both as a teacher and as a writer of mathematical texts. Many later writers borrowed much material from this book.\nNot only was Hutton teaching and writing textbooks, but he also undertook a land survey of the area around Newcastle for the mayor and corporation of the city. In\n1770\nhe produced\nPlan of Newcastle and Gateshead\nwhich is now lodged in Newcastle City Library. Two years later he published\nThe Principles of Bridges\n, a treatise on the equilibrium of bridges.\nShafto persuaded Hutton to have greater ambitions than being a schoolmaster in Newcastle and when a competition for the position of professor of mathematics at the Royal Military Academy in Woolwich in London was announced, following the death of Mr Cowley, Hutton became one of the eleven competitors.\nMaskelyne\nwas one of the panel with the task of choosing the best candidate for the post and there was little doubt that Hutton showed himself to be a class above the rest in the several days of examinations; he was appointed on\n24\nMay\n1773\n. In the following year, on\n16\nJune, he became a Fellow of the\nRoyal Society\n. He later received an honorary degree from the University of Edinburgh.\nHutton became editor of the\nLadies' Diary\nin\n1773\nand continued to undertake his editorial duties for\n45\nyears until\n1818\n; there is information about his role as editor in\n[\n6\n]\n. Riddle writes in\n[\n7\n]\n:-\nThe editorship of the Ladies' Diary afforded him an opportunity of becoming acquainted with the talents and acquirements of many ingenious individuals, who were inproving themselves in science by endeavouring to solve the mathematical questions proposed in the Diary; ans as opportunity occurred, many of them were drawn by his kind discrimination from obscurity, and placed in situations in which they were eminently useful to society.\nIn\n1775\nhe published five volumes of extracts from the\nLadies' Diary\ndealing with:-\n... entertaining mathematical and poetical parts.\nHe now began to publish interesting papers in the\nPhilosophical Transactions of the Royal Society\n. In\n1776\nhe published\nA new and general method of finding simple and quickly converging series\nand two year later, in the same Transactions he published\nThe force of fired gunpowder and the velocity of cannon balls\n. He received the Copley Medal of the\nRoyal Society\nfor this\n1778\npaper. He also computed the mean density of the Earth based on\nMaskelyne\n's data from the mountain Schiehallion in\nAn Account of the Calculations made from the Survey and Measures taken at Schiehallion in order to ascertain the mean density of the Earth\n(1779)\n.\nIn\n1779\nHutton became foreign secretary of the\nRoyal Society\n. He held this position for four years before being forced to resign in\n1783\nby Sir Joseph Banks, who was president of the Society from\n1778\nto\n1820\n. It was an unfortunate affair which led to considerable controversy in the\nSociety\n. Banks claimed that Hutton had failed to carry out his duties efficiently, but many in the Society supported Hutton and felt that it was in fact Banks who had failed to manage the affairs of the Society competently. Banks was accused by Fellows of using excessive authority and of being \"despotic\".\nFrancis Maseres\nand\nNevil Maskelyne\nwere among Hutton's supporters, while many others wrote anonymous pamphlets in support of Hutton and critical of Banks.\nHutton continued to publish textbooks, treatises and papers. In\n1781\nhe published\nMathematical Tables\nfor the Board of Longitude. Further mathematical tables followed, one of which, published in\n1785\n, contains an important historical introduction. He had a stroke of good fortune which was to make him a rich man and we quote the episode as given in\n[\n5\n]\n:-\nIn\n1786\nHutton began to suffer from pulmonary disorders. The Royal Military Academy was situated near the river and dampness began to affect is chest; his predecessor Simpson had in fact died from a chest complaint. Hutton decided then to move, and bought land on the hill south of the river overlooking Woolwich. There he built himself a house and also others for letting. No sooner had he done this than it was decided to move the Academy from the damp riverside to the hilltop. A magnificent new building was erected, but, in the eyes of George III, its attractiveness was spoiled by the presence of Hutton's houses. These were therefore sold to the crown who promptly demolished them, leaving Hutton with a hefty profit from his speculation, sufficient to guarantee his financial future. Thus a physical disability turned him to mathematics and ill-health made him rich.\nHutton returned to publishing textbooks.\nThe Compendious Measurer\nappeared in\n1784\n,\nThe Elements of Conic Sections\nin\n1787\nand, in\n1795\n, his most famous work\nThe Mathematical and Philosophical Dictionary\nin two volumes. Baron writes in\n[\n1\n]\n:-\nAlthough it was criticised as unbalanced in content, unduly cautious in tone, and sometimes lacking judgement, the dictionary has served as a valuable source for historians of mathematics.\nHowever\nHowson\nwrites\n[\n5\n]\n:-\nIt is an excellent survey of mathematics, includes biographies of many mathematicians, and is a pioneer contribution to the history of mathematics.\nThe first volume looks at topics such as: arithmetic including discussion of square and cube roots, arithmetical and geometrical progressions, compound interest, double position and permutations and combinations; logarithms; algebra including the study of quadratic equations and the\nCardan\n-\nTartaglia\nmethod for cubic equations; geometry which follows the approach in\nEuclid\n's\nElements\n; surveying; and conic sections. The second volume contains\nNewton\n's approach to the differential and integral calculus.\nThe syllabus which was covered at The Royal Military Academy at Woolwich determined the contents of his textbook\nA course of mathematics for cadets of the Royal Military Academy\npublished from\n1798\nto\n1801\n. Hutton's fame as a writer of textbooks was such that even before this work appeared great things were expected of it as is indicated by the following pre-publication report in\nThe Monthly Magazine\nof August\n1798\n:-\nFrom Dr Hutton's talents and long experience in his profession, there is every reason to expect that this will not only be a most useful and valuable work, but will completely supersede every other of the same description.\nWritten to be a textbook for students at the Academy at Woolwich, it was also adopted by the United States Military Academy at West Point north of New York. This academy opened on\n4\nJuly\n1802\nand Hutton's book was immediately adopted for the first intake of cadets, remaining the standard text at the Academy until\n1823\n.\nHutton retired from his professorship at Woolwich in\n1807\nat the age of seventy on a pension of £\n500\nper year and went to live in Bedford Row, London. Shortly before his death he was consulted about the curves which should be adopted for the arches for the New London Bridge, the proposed structure having five semielliptical stone arches. Construction of the bridge began in\n1824\n, the year after Hutton's death. He had been married twice and was survived by two daughters and a son. Hutton was buried in the family vault at Charlton in Kent.\nBaron gives this assessment of Hutton's contributions in\n[\n1\n]\n:-\nHutton was an indefatigable worker and his mathematical contributions, if unoriginal, were useful and practical. Throughout his life, he contributed assiduously to scientific periodicals through notes, problems, criticism, and commentary.",
  "matematicos_citados_na_biografia": [
    "Maskelyne",
    "Royal Society",
    "Society",
    "Francis Maseres",
    "Nevil Maskelyne",
    "Howson",
    "Cardan",
    "Tartaglia",
    "Euclid",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}