{
  "nome_completo": "Charles Fox",
  "nome_curto": "Charles Fox",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fox/",
  "data_nascimento": "17 March 1897",
  "local_nascimento": "London, England",
  "data_morte": "30 April 1977",
  "local_morte": "Montreal, Canada",
  "summary": "Charles Fox was an English mathematician who worked on hypergeometric functions, integral transforms, integral equations, the theory of statistical distributions, and the mathematics of navigation.",
  "biografia": "Charles Fox\n's parents were Morris and Fanny Fox. Charles was brought up in London where he attended Coopers Company School in Bow Road, an ancient institution founded around\n1536\n. The headmaster of the school while Charles studied there was S Elford. While at this school, Charles won a scholarship to the City of London School situated on the Victoria Embankment. This progressive day school had been the first school in England to include science in its curriculum and to include scientific experiments as part of its teaching.\nEdwin Abbott\nhad been educated at this school and served as its headmaster for\n24\nyears but had retired many years before Fox studied there. Fox, again having won a scholarship, entered Sidney Sussex College Cambridge in\n1915\n. He achieved First Class Honours in both Part I of the Mathematical Tripos in\n1915\nand Part II in the following year. After sitting the Part II examinations in\n1917\n, he interrupted his studies to be part of the British Expeditionary Forces in France and was wounded in action in\n1918\n. After returning to Cambridge and completing his studies there, he was appointed as a Demonstrator and Lecturer in Mathematics in Imperial College, London, in\n1919\n.\nFox only remained at Imperial College for one year before being appointed as a Lecturer in Mathematics in Birkbeck College, part of the University of London, in\n1920\n. He had been appointed to this lectureship without having any mathematical publications and in fact he did not submit his first paper for publication until\n1925\n. This paper,\nA class of null series\n, was published in the\nProceedings\nof the\nLondon Mathematical Society\nin\n1926\n. He begins the paper as follows:-\nVarious\nSchlömilch\nseries, representing null functions, have been discovered by\nNielsen\n[1899]\n, who gave proofs of them by arguments similar to those by which the\nRiemann\n-\nLebesgue\nlemma is proved. The methods of contour integration, however, give extremely simple proofs of these results, and also give rise to many interesting results which, I believe, are new.\nHe submitted two further papers in June\n1925\n,\nThe Expression of Hypergeometric Series in Terms of Similar Series,\nand\nSome Further Contributions to the Theory of Null Series and Their Connexion with Null Integrals\nto the same\nProceedings\n; both were published in\n1927\nas was his next paper\nA Generalization of an Integral Equation Due to Bateman\nwhich he submitted in\n1926\n. Fox had useful discussions with\nGeorge Jeffery\nwho was the professor of Pure Mathematics at University College, London, and in his next paper\nThe Asymptotic Expansion of Generalized Hypergeometric Functions\n(1928)\nhe thanked\nGeorge Jeffery\nfor his assistance. Fox was awarded a D.Sc. by the University of London in\n1928\n.\nIn\n1932\nhe married Eileen Kaye in London; they had a son, Edward, and a daughter, Frances. He emigrated to Canada in\n1949\nto take up an appointment at McGill University. In\n1956\nhe was promoted to professor at McGill, a post he held until he retired in\n1967\n. His next eight years were spent as visiting professor at Sir George Williams University\n(\nnow Concordia University\n)\nMontreal where he continued to teach mathematics until he was close to\n80\nyears of age.\nFox's main contributions were on\nhypergeometric functions\n,\nintegral transforms\n,\nintegral equations\n, the theory of statistical distributions, and the mathematics of navigation. In the theory of\nspecial functions\nhe introduced an\nH\nH\nH\n-function with a formal definition. It is a type of generalisation of a hypergeometric function and related ideas can be found in the work of\nSalvatore Pincherle\n,\nHjalmar Mellin\n,\nBill Ferrar\n,\nSalomon Bochner\nand others. He wrote only one book\nAn introduction to the\ncalculus of variations\n(1950\n,\n2\nnd\nedition\n1963\n, reprinted\n1987)\n. He says in the Preface that he wrote it because:-\nDuring my many years of teaching at London University I felt that none of the existing texts covered the subject as I would like to teach it and so I undertook the task of writing one of my own.\nHow many texts have been written for this reason!\nPeter Hilton\n, in a review of the book, writes\n[\n1\n]\n:-\nOn the flyleaf of this book it is claimed that \"In this work the Calculus of Variations is developed both for its intrinsic interest and because of its wide and powerful applications to modern Mathematical Physics.\" It appears, however, that the author's main preoccupation is with the applications and that his interest in the Calculus of Variations derives from its applicability to physical problems rather than its intrinsic discipline. ... The book provides an excellent introduction to the subject for those primarily concerned with having available techniques and rules of procedure for tackling concrete problems, and a most exhaustive treatment of the classical problems of the Calculus of Variations\n(\ne.g. the brachistochrone, the surface of minimum resistance, the principle of least action\n)\nis among the best features of the book. However, for the student of pure mathematics, it does not seem to replace\nHadamard\n's 'Leçons sur le Calcul des Variations' or\nBliss\n's 'Calculus of Variations'\n(\nwhose mathematical content broadly coincides with its own\n)\n.\nL M Graves, however, gives a much more critical review:-\nThis book, designed as a text for undergraduate students, includes a large number of examples, and devotes chapters\n5\n,\n6\n, and\n7\nto applications to mechanics, relativity, and elasticity. Unfortunately, the meaning of terms used is often very vaguely conveyed, and proofs are often very unsatisfactory. The errors and defects are too numerous to mention in detail.\nAmong the honours that Fox received, we mention in particular that he was elected a Fellow of the\nRoyal Society of Canada\nin\n1961\nand was awarded an honorary LL.D. degree by Concordia University in\n1976\n.\nLet us end this biography with a quotation from\n[\n4\n]\n:-\nCharles Fox leaves behind him the memory of a quiet family man, an effective teacher of mathematics who made significant contributions to his field of expertise, and who inspired many of his colleagues and students to carry out independent researches for themselves. He will be remembered for his great intellectual gifts and research contributions, for his courtesy and kindliness and, above all, for his qualities of honesty and integrity.",
  "matematicos_citados_na_biografia": [
    "Edwin Abbott",
    "London Mathematical Society",
    "Schlömilch",
    "Nielsen",
    "Riemann",
    "Lebesgue",
    "George Jeffery",
    "hypergeometric functions",
    "integral transforms",
    "integral equations",
    "special functions",
    "Salvatore Pincherle",
    "Hjalmar Mellin",
    "Bill Ferrar",
    "Salomon Bochner",
    "calculus of variations",
    "Peter Hilton",
    "Hadamard",
    "Bliss",
    "Royal Society of Canada"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}