{
  "nome_completo": "Charles Hughes Terrot",
  "nome_curto": "Charles Hughes Terrot",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Terrot/",
  "data_nascimento": "19 September 1790",
  "local_nascimento": "Cuddalore, Tamil Nadu, India",
  "data_morte": "2 April 1872",
  "local_morte": "Stockbridge, Edinburgh, Scotland",
  "summary": "Charles Terrot was an amateur mathematician who became Bishop of Edinburgh. He wrote an early paper on complex numbers.",
  "biografia": "Charles Hughes Terrot\nwas the son of Elias Terrot, a Captain of the\n52\nnd\nRegiment in the Indian Army. His great grandfather, Monsieur de Terotte -- a protestant\n(\nHuguenot\n)\nexile from France -- had fled from La Rochelle and sought refuge in England on the revocation of the Edict of Nantes in\n1685\n.  Upon Elias's death at the siege of Bangalore in\n1790\n, Terrot's mother, Mary Fonteneau left India with her infant son and settled in Berwick. Young Terrot was placed under the care of the Revd John Fawcett of Carlisle and was educated at Carlisle Grammar School.\nIt was at Cambridge that Terrot earned a reputation for scholarship, particularly in mathematics. He entered Trinity College in\n1808\n, gaining his B.A. in\n1812\n, graduating with mathematical honours, despite disappointing Tripos examination results.\nThe problem had not been a lack of intellect, rather an unwillingness to apply it in tedious activity. From the\nRoyal Society of Edinburgh\n's\nProceedings\n, with information provided by\nKelland\n[\n1\n]\n:-\nThe fact is that Terrot's mind revolted at the drudgery of acquiring branches of the science\n[\nmathematics\n]\ntowards which he felt no inclination. It was characteristic of him to tread a small circle, but to tread it well; and he was constitutionally unfitted for stowing away in his memory, for temporary purposes, facts and figures in which he took no interest.\nFortunately for Terrot, he had had ample opportunity outwith the Tripos examinations to prove his abilities and on this basis he was elected a Fellow of Trinity College in\n1813\n. The same year he was ordained a deacon, with ordination to the priesthood following in\n1814\n. In\n1815\nhe settled in Haddington, taking up a position held previously by his uncle, the Revd William Terrot, as Minister of the Episcopal congregation.\nTerrot's move to Edinburgh took place in\n1817\n: he was to assist the Revd James Walker at St Peter's in Roxburgh Place. In\n1833\nTerrot joined two other clergy at St Paul's in York Place. During the next twenty years, his appointments grew in prestige: he was appointed Dean of Edinburgh and Fife in\n1837\n; Rector of St Paul's in\n1839\n; Pantonian Professor at the theological college, and Bishop of Edinburgh, in\n1841\nand Primus of the Scottish Episcopal Church in\n1857\n. He remained as Primus until\n1862\n, when a paralytic stroke forced his resignation. He married twice: his first wife, with whom he had fourteen children, left him a widower. According to\n[\n1\n]\nTerrot's eldest daughter accompanied\nFlorence Nightingale\nto the Crimea and for her service there she was awarded a Royal Red Cross.\nUnderstandably, Terrot sought relief from the heavy burden of his responsibilities. As\nKelland\nrecalled\n[\n1\n]\n, Terrot turned to mathematics for refuge: \"To mathematics, when harassed by the cares and vexations incident to his position, he had recourse as a retreat from irritating thoughts. His passion for the science was strong enough to take possession of his mind, and soothing enough to settle it down to repose.\" The extent of Terrot's reliance on mathematics and its implications, both beneficial and otherwise, were discussed by the Revd Walker -- whom Terrot had assisted at St Peter's -- in his biographical work,\nThree Churchmen\n(1893)\n. Walker writes\n[\n3\n]\n:-\nAbsorbed in the depths of original research, the bishop found that which can, it is said, be always found in the depths of the ocean, viz., calm, in the midst of storm.\nReaders will probably take very different views of Bishop Terrot's occasionally ardent devotion to mathematical study. Some will think that whenever he had any spare time for investigation and research it ought to have been devoted exclusively to professional subjects, such as the theological and biblical problems of the day. Others will hold that the one study was a help rather than a hindrance to the other; the occasional sub jection of the mind to the vigorous mathematical discipline being the best corrective of loose thinking and illogical reasoning. Those who take this view will believe that the bishop's addiction to mathematical research was an advantage to the Church as well as to himself; not only assuring him an occasional refuge from worry, but also maintaining in him that judicial frame of mind which never deserted him in the hottest controversies, and which extorted the admiration of his opponents.\nThe only evil effect of the bishop's mathematics was probably a little intolerance of the loose talk and inconsequential reasoning which often prevail in general society.\nApart from mathematics, Terrot spent time writing poetry and much of his leisure time while at Haddington was devoted to it. His poem\nHezekiah and Sennacherib, Or the Destruction of Sennacherib's Host\n-- about the destruction of Sennacherib's army before Jerusalem -- won him the Seatonian Prize in\n1816\n. He also had a love of architecture and enjoyed membership of the Architectural Society of Scotland.\nTerrot was elected a Fellow of the\nRoyal Society of Edinburgh\nin\n1840\n, proposed for fellowship by J D Forbes. Terrot's role in the Society was described by\nKelland\nthus\n[\n1\n]\n:-\nFor many years of his life he was one of the regular attendants at our meetings; and when not actively engaged in the work going on, he was an active listener, and, when occasion called for it, and unsparing critic. He had a real love for the Society. As he left the building for the last time, he expressed himself to the effect, that henceforth his heart would be with us, but that the work of his hands was done. The only part of the proceedings which he did not relish was the tea-drinking after the meeting.\nTerrot served as a Councillor for the Society\n(1841\n-\n1844)\nand as their Vice-President between\n1844\nand\n1860\n. Looking through the\nProceedings\n, there are numerous instances of the 'Right Rev. Bishop Terrot, Vice-President, in the Chair'.\nTerrot delighted in good conversation and, according to the Revd Walker, in Edinburgh he had developed a 'very high reputation as a talker of the Johnsonian type'. By this, Walker meant\n[\n3\n]\n:-\n... precision of thought and language, ready wit, repartee and love of argument -- all set off to advantage by a distinct voice and deliberate utterance. He\n[\nTerrot\n]\nwas also almost as impatient as Johnson himself was of twaddle and of pretence -- \"humdrum and humbug\" -- and thus to weak reasoners and pretentious talkers he appeared to be, and doubtless sometimes was, severe and sarcastic. But to men of like mind with himself -- deep and just thinkers and earnest talkers -- his conversation was very highly prized, and his society much courted.\nTerrot's contributions to the\nRoyal Society of Edinburgh\ncomprise the following papers\n(\nordered by date of communication to the Society\n)\n:\n1845\nOn the Sums of the Digits of Numbers\n1847\nAn Attempt to Elucidate and Apply Mr Warren's Doctrine Respecting the Square Root of Negative Quantities\n1848\nOn Algebraical Symbolism\n1849\nAn Attempt to Compare the Exact and Popular Estimates of Probability\n1850\nOn Probable Inference\n1853\nOn the Summation of a Compound Series, and its Application to a Problem in Probabilities\n1856\nOn the Possibility of Combining Two or More Independent Probabilities of the Same Event, so as to Form One Definite Probability\n1858\nOn the Average Value of Human Testimony\nAccording to\nKelland\nin\n[\n1\n]\n, Terrot's\n1856\npaper was his 'best contribution to mathematical science': it had inspired\nBoole\n's paper,\nOn the Application of the Theory of Probabilities to the Question of the Combination of Testimonies or Judgements\n, for which Boole was awarded the  RSE's Keith Prize in\n1858\n.\nThe\n1847\npaper, in which Terrot gives an early account of the theory of complex numbers, attracted the attention of\nP G Tait\nwhile still a schoolboy at the Edinburgh Academy.\nTait\ncopied out the paper into a manuscript book which he and\nMaxwell\nexchanged as schoolboys on mathematical topics. The paper was based on earlier work by the Revd John Warren\n(1796\n-\n1852)\n, a Fellow of Jesus College, Cambridge, who published his treatise in\n1828\n. While Warren should be credited with having established the fundamentals, Terrot surely deserves some recognition: he seems to have had a sound grasp of the mathematics involved, which he was able to apply in valid and novel ways, and it is through his paper that\nTait\nhad his first introduction to a relatively new mathematical discovery of huge import.\nCertainly, the\nRoyal Society of Edinburgh\nheld Terrot's mathematical researches in this area in the highest regard\n[\n1\n]\n:-\nThe subject ...  had been floating somewhat dimly before the eyes of mathematicians for half a century, and was just then beginning to assume a living form in the mind, and a living exponent, though a somewhat obscure one, in the writings of Sir\nW R Hamilton\n. It was not until six years later that the doctrine of\nQuaternions\nof the great master, as developed in his \"Lectures\", swallowed up in its vast amplitude all that had preceded it. Terrot accordingly must be considered as one of the pioneers of the science.\nThe Revd Walker believed that Terrot might have had a remarkable career in mathematics had he chosen to commit himself to it exclusively\n[\n3\n]\n:-\n... had he\n[\nTerrot\n]\ncared to devote himself to \"research,\" living chiefly on his fellowship, he might have made important discoveries in some branches of the higher mathematics, probably anticipating Sir\nWilliam Rowan Hamilton\nin his discovery of Quaternions. But he had other views; and doubtless he took the wiser course.\nAn obituary\n[\n5\n]\nin the British Medical Journal suggests that Terrot, at some stage, taught at the Edinburgh Academy:-\nSpencer Thomson, MD., Torquay ... Educated at the Edinburgh Academy, under the late Rev. Dr. Terrot, afterwards Bishop of Edinburgh.\nYet there is no evidence in the Academy's\nRegister\nto support such a theory: the three references to 'Terrot' in the\nRegister\nreveal only that Terrot had educated his children at the Academy between\n1825\nand\n1842\n. It seems unlikely, therefore, that Terrot was ever a member of staff at the Academy. Perhaps the obituarist had misinterpreted Terrot's influence on young Thomson. Terrot may have acted as a mentor or tutor to the boy since Thomson was in the same class at the Academy as one of Terrot's sons, Elias Charles, and he resided in the same street as the Terrot family, Northumberland Street. In Cassell's\nOld and New Edinburgh\n,\n[\n2\n]\na description is given of Northumberland Street and Bishop Terrot, as one of its residents:-\nIn the narrow and somewhat sombre thoroughfare named Northumberland Street have dwelt some people who were of note in their time. ... No.\n19\nin the same street was for some years the residence of the Right Rev. Charles Hughes Terrot, D.D., elected in\n1857\n'Primus' of the Scottish Episcopal Church, and whose quaint little figure, with shovel-hat and knee-breeches, was long familiar in the streets of Edinburgh. ... few men were more esteemed and respected by others than Dr. Terrot of the Episcopal Church.\nIt is possible that Terrot provided Thomson with private tuition in mathematics. From the time of his fellowship at Trinity, Terrot had supplemented his income by taking on pupils for private tuition.  Indeed, a substantial increase in salary had to be arranged so that Terrot no longer needed to tutor and could devote himself to his ecclesiastical duties\n[\n3\n]\n:-\nThe minute of the vestry states that ... so large an advance has been at once made to Mr. Terrot's salary, making it higher than any clergyman of the chapel ever received before with the view of securing his undivided attention to his duties of minister of the chapel.\nTerrot was known to have had a close association with Archdeacon William's successor as Rector of the Edinburgh Academy, Dr John Hannah\n(1818\n-\n1888)\nwho was a former Fellow of Lincoln College, Oxford. The Revd Walker describes Dr. Hannah as one of the Bishop's 'most intimate friends'. The two men lived near to each other and Dr. Hannah took great pleasure in familiarizing Terrot with 'Oxford forms of thought' at a time when the philosopher, Sir\nWilliam Hamilton\nwas promoting communication between Edinburgh and Oxford. The two were also connected through the  RSE: Hannah was elected a Fellow in March\n1848\n, having been proposed by Terrot in the January.\nTerrot died at Stockbridge in Edinburgh on\n2\nApril\n1872\n, aged eighty-two.",
  "matematicos_citados_na_biografia": [
    "Royal Society of Edinburgh",
    "Kelland",
    "Florence Nightingale",
    "Boole",
    "P G Tait",
    "Tait",
    "Maxwell",
    "W R Hamilton",
    "Quaternions",
    "William Rowan Hamilton",
    "William Hamilton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}