{
  "nome_completo": "Charles Alfred Coulson",
  "nome_curto": "Charles Coulson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coulson/",
  "data_nascimento": "13 December 1910",
  "local_nascimento": "Dudley, near Birmingham, England",
  "data_morte": "7 January 1974",
  "local_morte": "Oxford, England",
  "summary": "Charles Coulson 's main area of interest was molecular physical chemistry, but he contributed to many other areas.",
  "biografia": "Charles Coulson\n's mother was Annie Sincere Hancock, a headmistress and the daughter of an inventor. His father was Alfred Coulson who became Principal of Dudley Technical College and went on to become an inspector of technical colleges. Annie and Alfred Coulson had two children, twin sons Charles and John. The family were Methodists and Charles and his brother were brought up in a very religious home; Charles' whole attitude to life was dominated by his Christian upbringing.\nCharles was educated in Dudley up to the age of ten at which time his father joined the technical college inspectorate for south-west England and the family moved to Bristol. In Bristol he attended the XIV Preparatory School, winning a scholarship to attend Clifton College in\n1923\n. Five years later he won an entrance scholarship to Trinity College, Cambridge, where he studied the mathematical tripos before going on to also study the natural sciences tripos. He was a first class student in part two of both tripos examinations; mathematics in\n1931\nand natural science in the following year. Not only did he study a wide range of mathematical and scientific subjects but he also found time to play quite a bit of cricket and chess, being excellent at these two rather different games. He also became the leader of the Cambridge University Methodists.\nAfter graduating he was awarded a research scholarship and began research under\nR H Fowler\n. Later he undertook research on molecular orbital theory under J E Lennard-Jones. Winning a prize fellowship in\n1934\n, he was awarded his PhD in\n1936\n. In\n1938\nhe married Eileen Florence Burrett whom he had met since both were involved with the University Methodists. She was the daughter of a house furnisher from Leeds and was training at Cambridge to become a school teacher. Shortly after their marriage the couple moved to Dundee where Coulson was appointed as senior lecturer in mathematics at Queen's College, part of the University of St Andrews. As a devout Methodist, Coulson was a conscientious objector during World War II. During this period he was the only applied mathematician left on the staff, all the others being involved in war service.\nIn\n1941\nCoulson published\nWaves. A mathematical account of the common types of wave motion\nin the\nOliver and Boyd\nseries. I\n[\nEFR\n]\nown the seventh edition of May\n1955\n, reprinted in\n1958\n, which I purchased in the year I entered university. Coulson writes in the Preface of\nWaves:-\nThe object of this book is to consider from an elementary standpoint as many different types of wave motion as possible. In almost every case the fundamental problem is the same, since it consists in solving the standard equation of wave motion; the various applications differ chiefly in the conditions imposed upon these solutions. For this reason it is desirable that the subject of waves should be treated as one whole, rather than in several distinct parts; the present tendency is in this direction.\nClearly\nD E Rutherford\n, who taught applied mathematics at St Andrews, had assisted Coulson who expresses his thanks to him in the Preface. Let us indicate the contents of the\n156\npage book: The equation of wave motion; Waves on strings; Waves in membranes; Longitudinal waves in bars and springs; Waves in liquids; Sound waves; Electric waves; General considerations.\nIn\n1945\nCoulson was appointed as a lecturer in mathematics at University College, Oxford, where he was also a fellow at the Physical Chemistry Laboratory. He was appointed to the newly established chair of theoretical physics at King's College, London and took up the post in October\n1947\n. He had maintained his links with the St Andrews applied mathematicians and he published another text in the\nOliver and Boyd\nseries, this one first appearing in\n1948\n. Again I\n[\nEFR\n]\nown a copy of this text, this time the fifth edition of May\n1985\nreprinted in\n1961\n, which I purchased in my second year at university. Coulson thanks\nE T Copson\nin the Preface of the book for his help in preparing the text. He begins the Preface as follows:-\nThe author of a book on electricity must decide from the first whether his approach is mainly mathematical or physical; efforts at a satisfactory synthesis of the two have not hitherto proved very successful. The present book is intended to outline from the very beginning a consistent mathematical account of the phenomena of electricity and magnetism. In many aspects the field covered is similar to that of\nMaxwell\n's classical Treatise on Electricity and Magnetism. The present book differs from his in being much shorter, in assuming a working knowledge of vector notation, and in making use where necessary of the atomic viewpoint of modern physics.\nThe text itself begins:-\nThe fact that a piece of amber, when rubbed, will attract small particles of matter, was knows\n2500\nyears ago by\nThales of Miletus\n. From this simple experimental fact has developed the whole science of electrostatics, that is the properties of electricity at rest. Indeed, the very word electricity is derived from the Greek word for amber.\nCoulson left his chair in London in\n1952\nwhen he was appointed Rouse Ball Professor of Mathematics at the University of Oxford where he was also made a fellow of Wadham College. He delivered his inaugural lecture to the University on\n28\nOctober\n1952\non\nThe spirit of applied mathematics\n. He held this post for\n20\nyears and played a major role in the setting up of the Mathematical Institute there which opened in\n1963\n.\nIn\n1970\nCoulson underwent an operation for cancer of the prostate. He recovered and in\n1972\nhe left the Rouse Ball chair of mathematics to become professor of theoretical chemistry at Oxford. Sadly his health was deteriorating again at the time that he took up the chair, and when he had a hernia operation in July\n1973\nthe doctors discovered that the cancer had returned. He died from cancer in his home in Oxford.\nCoulson research record is amazing with over\n400\nresearch publications being listed in\n[\n2\n]\n. His main area of research was in molecular physical chemistry and some examples of his papers are:\nTwo-centre integrals occurring in the theory of molecular structure\n(1942)\n;\nNote on the random-walk problem\n(1947)\n;\nNotes on the secular determinant in molecular orbital theory\n(1950)\n;\nThe evaluation of integrals occurring in the theory of molecular structure\n(1951)\n;\nThe use of commutator relationships in determining Schrödinger wave functions\n(1965)\n; and\nMathematical models\n(1974)\n. The last of these papers, published in the\nBulletin of the Institute of Mathematics and its Applications\n, examines mathematical models for gravitation, killing bacteria by radiation, control of cancer cells in blood by radiation, the shape of keys, and the spread of rumours. In fact Coulson was elected President of the Institute of Mathematics and its Applications in\n1972\nand held this position until his death.\nCoulson was a talented expositor and this is demonstrated in all his works such as\nWaves\nand\nElectricity\nwhich we made special mention of above, and also his best-selling work\nValence\npublished in\n1952\n. Longuet-Higgins explained the clarity of Coulson's writing in the preface of the\n1974\nbook\nTheories of Molecules and Solids\ndedicated to the memory of Coulson:-\nAbove all I was impressed by the simplicity of Coulson's thinking and by his determination to make things so clear that even a novice could grasp the essential ideas.\nMany honours were thrust on Coulson for his outstanding contributions to mathematics and chemistry. He was elected to the\nRoyal Society of Edinburgh\nin\n1941\nand to the\nRoyal Society of London\nin\n1950\n. He was awarded the Davy medal from the\nRoyal Society\nin\n1970\n, and the\nFaraday\nand Tilden medals from the Chemical Society in\n1968\nand\n1969\nrespectively. He received a dozen honorary degrees.\nHowever, one must not think that, because Coulson undertook such a massive amount of scientific work, he would have no time for other activities. On the contrary he managed to fit into his life being on the central committee of the World Council of Churches from\n1962\nto\n1968\nand being chairman of Oxfam from\n1965\nto\n1971\n. Also\n[\n1\n]\n:-\nHis religious publications and television appearances made him well known to the public. He enjoyed a happy family life, and he and his wife opened their home to his students on many occasions. He was tall and imposing, and occasionally unconventional in his attire.",
  "matematicos_citados_na_biografia": [
    "R H Fowler",
    "D E Rutherford",
    "E T Copson",
    "Maxwell",
    "Thales of Miletus",
    "Royal Society of Edinburgh",
    "Royal Society of London",
    "Royal Society",
    "Faraday"
  ],
  "imagens": [
    "coulson.jpg"
  ]
}