{
  "nome_completo": "Charlotte Elvira Pengra",
  "nome_curto": "Charlotte Pengra",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pengra/",
  "data_nascimento": "30 May 1875",
  "local_nascimento": "Juda, Wisconsin, USA",
  "data_morte": "7 February 1916",
  "local_morte": "Brodhead, Wisconsin, USA",
  "summary": "Charlotte Pengra was the first woman to be awarded a Ph.D. in mathematics from the University of Wisconsin in 1901 , making her the sixth American woman to receive a doctorate in mathematics",
  "biografia": "Charlotte Pengra\nwas the daughter of Winfield Sherman Pengra\n(1847\n-\n1928)\nand Mary Ellen Preston\n(1853\n-\n1920)\n. Winfield Pengra had been born on\n2\nNovember\n1847\nin Sylvester, Wisconsin. He married Mary Preston on\n3\nSeptember\n1874\nin Juda, Wisconsin. Mary Ellen Preston had been born on\n2\nNovember\n1853\nin Jefferson, Green County, Wisconsin, the daughter of Nathaniel E Preston, born in England, and Charlotte Elizabeth Cook. Winfield and Mary Pengra had five children, Charlotte Elvira Pengra\n(1875\n-\n1916)\n, the subject of this biography who was known as \"Lottie\", Mabel Agnes Pengra\n(1877\n-\n1936)\n, Preston Winfield Pengra\n(1880\n-\n1910)\n, Delia Idell Pengra\n(1882\n-\n1956)\n, and Marshall Hylon Pengra\n(1885\n-\n1927)\n. All five of these children studied at the University of Wisconsin and were awarded their degrees in\n1887\n,\n1899\n,\n1902\n,\n1904\n, and\n1905\n, respectively. In\n1880\nthe family were living in Jefferson, Wisconsin with Winfield Pengra's occupation being recorded as farmer. Later Winfield Pengra became a bank manager and a mayor. In\n1900\nthe family were living in Madison, Wisconsin with Winfield Pengra's occupation being recorded as landlord. The family's address in Madison was\n801\nUniversity Avenue, Madison, Wisconsin.\nIn\n1893\nCharlotte Pengra graduated from Madison High School and later that year she entered the University of Wisconsin. Her main interest was in mathematics and this would become her major subject. When Pengra entered the University of Wisconsin, Charles Ambrose Van Velzer\n(1851\n-\n1945)\nwas Professor of Mathematics, Charles Sumner Slichter\n(1864\n-\n1946)\nwas Professor of Applied Mathematics, Ernest Brown Skinner\n(1863\n-\n1935)\nwas an Instructor in Mathematics, and\nEdward Burr Van Vleck\n(1863\n-\n1943)\nwas an Instructor in Mathematics. Although\nVan Vleck\nwas an Instructor at Madison only from\n1893\nto\n1895\n, he left in\n1895\nbut returned as a professor in\n1906\n. Let us give a few more details concerning the other members of the mathematics faculty.\nCharles Ambrose Van Velzer was born in Baldwinsville, New York, on\n2\nSeptember\n1851\n. He attended Cornell University from\n1872\nto\n1876\nwhen he graduated with a Bachelor of Science. He received first prize in mathematics at the intercollegiate contest in December of that year while he was an instructor at Cornell\n1876\n-\n1877\n. He was a graduate fellow at Johns Hopkins University\n1878\n-\n1881\nand became Instructor in Mathematics at the University of Wisconsin in\n1881\n. He was promoted to Assistant Professor in\n1883\nand to Professor in\n1885\n. That was the same year, Hillsdale College conferred on him an honorary doctorate. Van Velzer served as Chair of the Department of Mathematics at the University of Wisconsin\n1884\n-\n1894\nand continued as a Professor at the University of Wisconsin until\n1906\n. Charles Sumner Slichter was born in Saint Paul, Minnesota, on\n16\nApril\n1864\n. He attended Cornell University graduating with a Bachelor of Science in\n1885\n. He then studied at Northwestern University, being awarded a Master's Degree in\n1887\n. In\n1886\nhe came to the University of Wisconsin as an instructor in mathematics, became an assistant professor in\n1889\n, and in\n1892\nwas made Professor of Applied Mathematics. He was appointed dean of the University of Wisconsin graduate school in\n1920\nand continued to hold that position until he retired in\n1934\n. Ernest Brown Skinner\n(1863\n-\n1935)\nwas born in Redfield, Ohio, on\n12\nDecember\n1863\n. He graduated from Ohio University in\n1888\n, taught at Amity College in Iowa\n(1888\n-\n1891)\n, then undertook research at Clark University advised by\nWilliam Story\n. In\n1892\n, before completing work for a Ph.D., he came to the University of Wisconsin as an instructor and was promoted to assistant professor in\n1895\n. He took leave for a year to undertake research for a Ph.D. at the University of Chicago which he was awarded in\n1900\n. He was promoted to associate professor in\n1910\n, and to a full professor in\n1920\n. He continued as a Professor at the University of Wisconsin until his death in\n1935\n.\nIn\n1897\nPengra graduated with an honours B.S. degree having majored in mathematics with two minor subjects, economics and philosophy\n(\nsee\n[\n12\n]\n)\n. She wrote an excellent undergraduate thesis\nGeneral rational fractional linear transformations of plane curves\n. After graduating she was appointed as a Teacher of Science at Fox Lake High School, in Fox Lake, Wisconsin. After a year in Fox Lake she moved to become a teacher at Sparta High School, in Sparta, Wisconsin. On\n12\nMay\n1899\n, she wrote from Sparta to Charles Slichter inquiring about a possible fellowship for graduate study at the University of Wisconsin. In the letter Pengra\n[\n9\n]\n:-\n... indicated that she wanted a more complete college education for its own sake and because she would like to teach mathematics to students more advanced than in the high school. She indicated that she wanted to take a PhD, probably from Wisconsin, and that if she had the fellowship she would not teach again until she received the degree. Whereas the financial question was \"not very pressing,\" she wrote that if she did not get the fellowship she would stay in Sparta.\nPengra was awarded the fellowship and later in\n1899\nshe returned to the University of Wisconsin to begin undertaking research for a Ph.D. Now\nLinneaus Wayland Dowling\nhad been appointed as an instructor in mathematics at the University of Wisconsin in\n1895\nin the middle of Pengra's undergraduate career. In\n1898\nhe had been promoted to assistant professor of mathematics. He became Pengra's thesis advisor when she began her research in\n1899\n.\nDowling\nlater became\nFlorence Allen\n's thesis advisor and she gave this description of him in\n[\n2\n]\n:-\nProfessor\nDowling\n's instruction was characterised by an exceptional clarity of exposition which, with his magnetism, geniality of manner, and interest in his students, made him a universally popular and beloved teacher. He was a man of unusual breadth of interests: a talented musician, an eager and well-informed botanist, and a student of the humanities. His knowledge of the language and literature of Italy, where he studied under the geometer\nSegre\n, was exceptional; and he was an ardent reader and lover of poetry. These talents explain, in part, the bonds of sympathy that united him with so many colleagues and students. But above all his attraction was due to his personal qualities, his cheerful disposition and his kindly character. His influence in these private associations was no less great than in his admirable public service as a teacher, and he will long be remembered and missed by his friends.\nPengra was an assistant in the Department of Mathematics at the University of Wisconsin from\n1899\nto\n1901\nwhen awarded her Ph.D. for her thesis\nOn functions connected with special Riemann surfaces, in particular those for which p =\n3\n,\n4\n, and\n5\n. Her thesis was published in\n1904\nas\nOn the conformal representation of plane curves, particularly for the cases p =\n4\n,\n5\n, and\n6\n(\nsee\n[\n10\n]\n)\n.\nDuring the year\n1900\n-\n1901\n, Pengra met Arthur Robert Crathorne\n(1873\n-\n1946)\n. He had been born on\n26\nOctober in Scarborough, Yorkshire, England to parents Francis R Crathorne and Anne Harrison. The family had emigrated to the United States in\n1880\n. Arthur Crathorne had studied at the University of Illinois being awarded a B.S. in\n1898\n. After graduating, he taught at the University of Maine\n(1898\n-\n1900)\nand was then appointed as an Instructor in Mathematics at the University of Wisconsin.\nAfter the award of her Ph.D. in\n1901\n, Pengra was appointed as Head of Mathematics at Elgin High School in Elgin, Illinois. She taught there for three years then, on Tuesday,\n21\nJune\n1904\n, she married Arthur Crathorne in Madison\n[\n1\n]\n:-\nThis afternoon at\n4\n:\n00\no'clock at the residence of the parents, Mr and Mrs Winfield S Pengra,\n803\nUniversity Avenue, Madison, was celebrated the marriage of Miss Charlotte E Pengra to Arthur R Crathorne.\nShortly after they married the young couple sailed from Montreal to Liverpool to have a holiday in England before continuing to Göttingen, Germany. In Göttingen, Arthur Crathorne studied under\nDavid Hilbert\nand wrote his\n59\n-page doctoral thesis\nDas räumliche isoperimetrische Problem\nⓉ\n(\nThe spatial isoperimetric problem\n)\n; he was awarded his Ph.D. in\n1907\n. Charlotte Crathorne attended mathematics classes in Göttingen until the birth of the couple's first child Mary Preston Crathorne\n(1906\n-\n1984)\nin Göttingen on\n28\nNovember\n1906\n. On returning to the United States in\n1907\n, Arthur Crathorne accepted a position at the University of Illinois. Charlotte and Arthur Crathorne had two further children, Anne Harrison Crathorne\n(1910\n-\n1979\n, born in Madison on\n31\nJuly\n1909\n, and Arthur Robert Crathorne Jr\n(1912\n-\n1944)\n, born in Illinois on\n5\nJune\n1911\n.\nIn\n1909\nArthur Crathorne, together with his colleague Henry Lewis Rietz at the University of Illinois, published\nCollege Algebra\n. It proved very popular and ran to at least six editions. The review\n[\n15\n]\nexplains:-\nIts special claims on our notice are set forth in the Preface as:\n(\ni\n)\nThe method of reviewing the algebra of the secondary school;\n(\nii\n)\nthe selection and omission of material;\n(\niii\n)\nthe explicit statement of assumptions upon which the proofs are based;\n(\niv\n)\nthe applications of algebraic methods to physical problems. The book seems to us to be a sensible production, and teachers will find some of the sets of examples very useful.\nCharlotte's daughters report that their mother worked with her husband and Rietz on the production of this book but although the authors give acknowledgements to many in the work, she does not receive a mention.\nAt the age of\n37\nCharlotte Crathorne began to suffer from poor health. She died of breast cancer at the age of\n40\n. The\nChampaign Daily Gazette\nfrom Champaign, Illinois reported\n[\n8\n]\n:-\nWord has been received here of the death of Mrs Charlotte Crathorne, wife of Professor Arthur R Crathorne, of\n1113\nSouth Fourth Street, who passed away yesterday at the home of her parents, Mr and Mrs W S Pengra, at Broadhead, Wisconsin. Mrs Crathorne had been in falling health for some time and was recently taken to the home of her parents after spending months in St Luke's hospital in Chicago. ... Mrs Crathorne was a member of the Phi Beta Kappa sorority and was a patroness of the local chapter of Phi Kappa Sigma and past vice-president of the Association of Collegiate Alumnae. She was also a member of the Episcopal church.\nCharlotte Crathorne was buried in Mount Vernon Cemetery, Juda, Green County, Wisconsin.\nWe note that Arthur Robert Crathorne remarried in\n1917\nto Katherine Alberta Layton\n(1878\n-\n1971)\nand spent the rest of his career at the University of Illinois becoming a full professor in\n1935\n. In addition to writing a number of popular textbooks, Crathorne was a Ph.D. advisor to eight students at the University of Illinois.",
  "matematicos_citados_na_biografia": [
    "Edward Burr Van Vleck",
    "Van Vleck",
    "William Story",
    "Linneaus Wayland Dowling",
    "Dowling",
    "Florence Allen",
    "Segre",
    "David Hilbert"
  ],
  "imagens": [
    "pengra.jpg"
  ]
}