{
  "nome_completo": "Christine Mary Hamill",
  "nome_curto": "Christine Hamill",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamill/",
  "data_nascimento": "24 July 1923",
  "local_nascimento": "London, England",
  "data_morte": "24 March 1956",
  "local_morte": "Ibadan, Oyo State, Nigeria",
  "summary": "Christine Hamill was an English mathematician who specialised in group theory and finite geometry.",
  "biografia": "Christine Hamill\n's father was Philip Hamill\n(1883\n-\n1959)\nwho was born in Wolverhampton, West Midlands, to Irish parents, namely the customs officer Philip Hamill\n(\nSr\n)\nand his wife Annie. Philip\n(\nJr\n)\nbecame a medical doctor and a Fellow of the Royal College of Physicians. He married Louisa Maude Zehetmayr\n(1891\n-\n1963)\nin Isleworth, London in\n1918\n. Louisa was the daughter of the merchant Ferdinand Zehetmayr, born in Germany, and his wife Beatrice, born in Twickenham. London. Philip and Louisa Hamill had four children: Bernard John Hamill\n(1920\n-\n1996)\n, who became a management consultant; Olivia Ann Hamill\n(1921\n-\n2006)\n, who became a teacher; Christine Mary Hamill, the subject of this biography, and one younger boy.\nChristine studied first at St Paul's Girls' School where she won a foundation scholarship. This independent school in Hammersmith, West London, had been founded in\n1904\n. When Hamill studied there the head teacher was the classics scholar Ethel Strudwick\n(1880\n-\n1954)\n. Hamill moved to Perse School for Girls in Cambridge, a school which had been founded in\n1881\nto provide quality education for women. She was awarded a Caroline Turle scholarship to study at Newnham College, Cambridge in\n1942\n.\nAt Cambridge, Hamill was very successful in the mathematical tripos, becoming a\nWrangler\nin\n1945\nand achieving a distinction in Part III the following year. She had a special flair for Algebraic Geometry and, as soon as she had obtained her degree, began research in this subject at Cambridge working for her doctorate. In\n1948\nshe was awarded a Newnham research fellowship and, after submitting her thesis in\n1950\n, she was awarded her doctorate in\n1951\nfor her thesis\nThe Finite Primitive Collineation Groups which contain Homologies of Period Two\n.\nJ A Todd\nsupervised her research work at Cambridge and in\n[\n11\n]\nhe describes the work of her doctoral dissertation:-\nThis work contains a detailed study of the finite primitive collineation groups which contain homologies of period two. Starting with an analysis of the geometrical configuration formed by the centres and the invariant primes of the homologies, she was able, by a very thorough and careful investigation, to obtain, for each of the groups, the distribution of the operations in conjugate sets, and to make the nature of these operations clear.\nHamill published three papers based on her dissertation;\nOn a finite group of order\n576\nin\n1948\n;\nOn a finite group of order\n6\n,\n531\n,\n840\nin\n1951\n; and\nA collineation group of order\n2\n13\n.\n3\n5\n.\n5\n2\n.\n7\n2^{13}.3^{5}.5^{2}.7\n2\n1\n3\n.\n3\n5\n.\n5\n2\n.\n7\nin\n1953\n. These papers describe groups of order\n576\n,\n6531840\nand\n348364800\nrespectively, see the references\n[\n6\n]\n,\n[\n7\n]\nand\n[\n8\n]\n. Jack Semple, in the review\n[\n10\n]\nof the\n1951\npaper, writes:-\nThis paper, submitted for publication in June\n1948\nand only now appearing in print, contains the large body of fundamental results on which four other papers, already published before its appearance, were based ... The group G with which all these papers are concerned is a collineation group of\nS\n5\nS_{5}\nS\n5\n​\n, of order\n6\n,\n531\n,\n840\n... The main results of the paper are\n(\ni\n)\na complete and concise description of the configuration formed by the\n126\nvertices;\n(\nii\n)\nan analysis, remarkable for its simplicity and elegance, of the operations of the group, their classification into\n31\ntypes and\n34\nconjugate sets; and\n(\niii\n)\na similar analysis of the simple subgroup G' of G, of index\n2\n, of which the operations are generated by products of an even number of the\n126\nprojections.\nIn the\n1953\npaper, Hamill gives the following acknowledgement:-\nMy thanks are due to Dr\nTodd\nwho supervised my researches and who gave me much valuable advice, and to the referee who made many very helpful suggestions.\nTodd\n[\n11\n]\nassesses the importance of these papers:-\nThe groups concerned are of interest from various points of view, and the detailed results contained in her papers contain something of permanent value.\nW L Edge\nin\n[\n3\n]\nrefers to the papers as \"Miss Hamill's spectacular success.\" I\n[\nEFR\n]\nknew\nEdge\nquite well, and I can assure the reader that he did not give praise lightly - this is high praise indeed!\nFor more information on all four of Hamill's papers, see\nTHIS LINK\n.\nIn\n1950\n, the year before she received her doctorate, Hamill was offered an Assistant Lectureship in Mathematics at the University of Sheffield which she accepted. She was to spend four years at Sheffield being promoted to a Lecturer in Mathematics in\n1952\n.\nDouglas Northcott\n, who was appointed to the Town Trust Chair of Pure Mathematics at Sheffield in\n1952\n, writes\n[\n9\n]\n:-\nIn\n1950\n, Miss Hamill left Cambridge to become an assistant lecturer at Sheffield University and two years later she was promoted to a full lectureship. Her charm and friendliness soon made her on the best of terms with everyone. In her teaching, she combined lucidity of expression with a sympathetic understanding of the difficulties of the less able students. She held definite views on most matters and was not afraid to state her opinions but, even when she was being critical, she always had something constructive to offer. No head of a mathematics department could wish for a more loyal and helpful colleague.\nWhile an assistant lecturer at Sheffield, Hamill attended the\nEdinburgh Mathematical Society\n's St Andrews Colloquium held in St Andrews from\n18\nto\n28\nJuly\n1951\n. This was the first St Andrews Colloquium after a gap of thirteen years caused by World War II. The series of lectures given by\nDonald Coxeter\nwas of particular interest to her. In\n1952\nshe joined the\nMathematical Association\n. While at Sheffield, Hamill undertook research with Herbert D Deas, who was also a lecturer in mathematics at the University of Sheffield. They wrote the joint paper\nA note on the geometry of lattice planes\nwhich has the following Abstract:-\nThis note is an attempt to give a careful restatement of a well-known result in lattice geometry, the proof of the converse part of which does not appear to be so well known.\nIn fact the paper did not appear in print until\n1957\n, the year after Hamill died. It had been submitted to\nActa Crystallographica\non\n2\nAugust\n1955\nbut it was revised by Herbert Deas on\n8\nMarch\n1957\n, almost exactly a year after Hamill's death.\nIn\n1954\nHamill accepted a post as lecturer in the University of Ibadan in Nigeria. She sailed on the\nAukeon\nfrom Liverpool to Lagos, departing on\n14\nDecember\n1954\n. She had already earned a high reputation as a teacher both at Cambridge and at Sheffield and was said to have great talent at getting the best from weaker students. In Ibadan she quickly began to show the same lecturing talents giving lectures of great clarity.\nDouglas Northcott\nwrites\n[\n9\n]\n:-\nMiss Hamill left Sheffield in\n1954\nto join the staff of University College, Ibadan, as a lecturer. The pioneering spirit had caught her imagination and the work to be done in developing an educational system at University level in West Africa offered a challenge which she felt she had to accept.\nW L Edge\nwrites\n[\n3\n]\n:-\nDuring the long vacation of\n1955\nshe was home in Britain and attended, in addition to the St Andrews colloquium in July, the British Mathematical Colloquium at Exeter in September.\nTwo of the lecture courses at the St Andrews Colloquium were of particular interest to Hamill, namely\nPhilip Hall\n's course on\nSymmetric Functions in the Theory of Groups\nand\nMichael Atiyah\n's course on\nTopological Methods in Algebraic Geometry\n.\nOutside mathematics\n[\n1\n]\n:-\n... she had wide interests, was a keen dinghy sailor and took an active part in youth welfare.\nAfter four terms in Ibadan, Hamill contracted poliomyelitis and her death was rapid occurring only two days after she became ill.\nNorthcott\nwrites\n[\n9\n]\n:-\n... while on a short holiday on the Gold Coast she contracted polio and, in spite of the good medical facilities available, died within forty-eight hours.\n[\nit was\n]\nwas a tragedy which found her many friends quite unprepared. She always had such abundant energy that the idea of a severe illness, let alone a fatal one, was almost unbelievable. ... She will always be remembered and missed by those who knew her.\nTodd\nremarks\n[\n11\n]\n:-\n... she will be remembered for her natural and innate friendliness, for her complete sincerity, and for her strength of character, fortified by a firm Christian faith, and a sincere acceptance of all that that implied.\nShe died a few months before the day in July on which she was to have been married. She had planned to return to Britain in the summer of\n1956\nfor her marriage.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "J A Todd",
    "Todd",
    "W L Edge",
    "Edge",
    "THIS LINK",
    "Douglas Northcott",
    "Edinburgh Mathematical Society",
    "Donald Coxeter",
    "Mathematical Association",
    "Philip Hall",
    "Michael Atiyah",
    "Northcott"
  ],
  "imagens": [
    "hamill.jpg"
  ]
}