{
  "nome_completo": "Christian Kramp",
  "nome_curto": "Christian Kramp",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kramp/",
  "data_nascimento": "8 July 1760",
  "local_nascimento": "Strasbourg, France",
  "data_morte": "13 May 1826",
  "local_morte": "Strasbourg, France",
  "summary": "Christian Kramp was a French mathematician who worked on analysis and combinatorics. He introduced the factorial notation.",
  "biografia": "Christian Kramp\n's first name is often written as Chrétien. His father, Jean-Michel Kramp, was a teacher in the\nGymnasium\nat Strasbourg. The city of Strasbourg has, over a long period, been on the border of the French and German speaking regions and, as a consequence, has been fought over on several occasions. It has been a free city, a part of France and a part of Germany but in\n1760\n, when Kramp was born there, it had been part of France for over\n60\nyears and had enjoyed a long period of peace and prosperity. With both French and German spoken in the city, it was natural that Kramp was brought up to speak and write in both languages. His interests were broad while he studied at the Gymnasium in Strasbourg and he entered the University in that city, again taking a broad range of courses, but specialising in medicine.\nAfter graduating, he practised medicine in the Strasbourg region around where he lived, travelling to patients in a fairly wide area. The breadth of his interests, however, is seen since he published a work on aerostatics\n[\n1\n]\n:-\nIn\n1783\n, the year the Montgolfier brothers made the first balloon ascension, Kramp published in Strasbourg an account of aerostatics in which he treated the subject historically, physically, and mathematically. He wrote a supplement to this work in\n1786\n.\nThe works referred to in this quote are the\n2\n-volume\nGeschichte der Aerostatik, historisch, physisch and mathematisch ausgefuehrt\n(1783)\nand\nAnhang zu der Geschichte der Aerostatik\n(1786)\n. In\n1788\n, when he was twenty-eight years old, he went to Paris where he practised as a doctor. In\n1794\nhe moved to become a doctor and lecturer in obstetrics in Meisenheim and then in Zweibrücken. Two years later in\n1796\n, he became a medial doctor in Speyer. He did not give up his academic interests over this period, however, and he had submitted his thesis\nDe vi vitalistic arteriarum addita nova de febrium indole generalized conjectura\nⓉ\n(\nConjecture on the vitalistic arterial force added to the new version of the character of generalized fever\n)\nto the University of Strasbourg in\n1786\n. He also published a book on obstetrics and the article\nVersuch, die Sterblichkeitstafeln durch einfache Gleichungen zu bestimmen\nⓉ\n(\nSeeking to determine mortality tables by simple equations\n)\n(1787)\n. It is clear from this work on mortality tables that Kramp was intent on applying mathematical techniques in his medical research. However his interests certainly ranged outside medicine for, in addition to a number of medical publications and his books on aerostatics, he published in\n1793\na work on crystallography\nKrystallographie des Mineralreiches\nⓉ\n(\nCrystallography of minerals\n)\nwritten in collaboration with Karl Bekkerhinn.\nThe stability of French rule which we noted at the beginning of this biography, came to an end in\n1792\nwhen France went to war with Prussia and Austria. They suffered defeats and soon the allies invaded French territory, advancing towards Paris. However, by\n1794\nthe position was totally reversed with the French winning victories and France began to annex lands as their armies pushed east. In\n1795\nFrance annexed the Rhineland region in which Kramp was carrying out his medical work and after this he decided to give up his work as a medical doctor and was appointed as a teacher in Cologne at the École Centrale of the Département of the Ruhr. He maintained his broad interests, however, teaching mathematics, chemistry and experimental physics. The following years saw Kramp embrace mathematics more and more seriously. This was a period of French dominance under Napoleon and Kramp responded to the new political order by publishing books in French instead of German. Before he had published in German, for example his work on fevers\nFieberlehre, nach mechanischen Grundsätzen\nⓉ\n(\nFever on mechanical principles\n)\n(\nHeidelberg,\n1794)\n, and his critique of practical medicine\nKritik der praktischen Arzneikunde, mit Rücksicht auf die Geschichte derselben und ihre neuern Lehrgebäude\nⓉ\n(\nCritique of practical pharmacology, with regard to its history  and its more recent doctrine\n)\n(\nLeipzig,\n1795)\n.\nIt was around the turn of the century that he changed languages and published in French his most important astronomical work\nAnalyse des réfractions astronomiques et terrestres\nⓉ\n(\nAnalysis of astronomical and terrestrial refractions\n)\n(\nStrasbourg-Leipzig,\n1799)\n. The influence of the French Revolution is seen on the title page since the author is given as \"citizen Kramp\" and it was \"printed in the\n7\nth\nyear of the Republic\". In this work he tried to solve the problem of\nrefraction\nby making the simplifying assumption that the elasticity of air is proportional to its density. He followed this with the mathematical textbooks\nÉléments d'arithmétique\nⓉ\n(\nElements of arithmetic\n)\n(\nCologne-Paris,\n1801)\n, where again on the title page the author is given as \"citizen Kramp\" and the date is given as the\n9\nth\nyear of the Republic, and\nÉléments de géométrie\nⓉ\n(\nElements of geometry\n)\n(\nCologne,\n1806)\n, where now the author is C Kramp and there is no dating by year of the Republic. His treatise\nÉléments d'arithmétique universelle\nⓉ\n(\nElements of universal arithmetic\n)\n(\nCologne,\n1808)\nattempted to fuse ideas in the calculus of operations introduced by\nLouis Arbogast\nwith basic combinatorial techniques\n[\n1\n]\n:-\nHe thus strove to create an intimate union of differential calculus and ordinary algebra, as had\nLagrange\nin his last works.\nKramp was appointed professor of mathematics at Strasbourg, the town of his birth, in\n1809\n. He published his memoir on double refraction\nSur la double refraction de la chaux carbonatée\nⓉ\n(\nOn the double refraction of carbonate of lime\n)\nin\n1811\nand, in\n1820\n, he published\nEquations des nombres\nⓉ\n(\nEquations of numbers\n)\nwhich contains a new approximate method to solve numerical equations.\nKramp was friendly with, and learnt much mathematics from,\nCarl Friedrich Hindenburg\n. This was important both in influencing Kramp to undertake some important work in combinatorics, the topic for which\nHindenburg\nis most famed, and also for giving Kramp important outlets for his mathematical contributions in the various journals that\nHindenburg\npublished. As\nBessel\n,\nLegendre\nand\nGauss\ndid, Kramp worked on the generalised\nfactorial\nor\nγ function\nwhich applied to non-integers. His work on factorials is similar to, but independent of, that of\nJames Stirling\nand\nAlexandre Vandermonde\n. Kramp sent his work on factorials of non-integers to\nBessel\nwho was influenced by it. He did achieve one \"first\" in that he was the first to use the notation\nn\n!\nn!\nn\n!\nalthough he seems not to be remembered today for this widely used mathematical notation.\nIn fact Kramp did not use the term 'factorial' in his early work on this topic, which was around\n1798\n, but rather the term 'faculty'. However, in the preface to\nÉléments d'arithmétique universelle\nⓉ\n(\nElements of universal arithmetic\n)\n(1808)\nhe wrote:-\nI have given it the name 'faculty'.\nArbogast\nhas substituted the name 'factorial' which is clearer and more French. In adopting his idea I congratulate myself on paying homage to the memory of my friend.\nFurther on in the same work Kramp writes:-\nI use the very simple notation\nn\n!\nn!\nn\n!\nto designate the product of numbers decreasing from\nn\nn\nn\nto unity, i.e.\nn\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\n.\n.\n.\n3.2.1\nn(n - 1)(n - 2) ... 3 . 2 . 1\nn\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\n.\n.\n.\n3\n.\n2\n.\n1\n. The constant use in combinatorial analysis, in most of my proofs, that I make of this idea, has made this notation necessary.\nIt is a notation that has become standard in use today, but\nAugustus De Morgan\nwas highly critical of it in the\nPenny Cyclopaedia\n(1842)\n. In the article on 'symbols'\nDe Morgan\nwrote:-\nAmong the worst of barbarisms is that of introducing symbols which are quite new in mathematical, but perfectly understood in common language. Writers have borrowed from the Germans the abbreviation n! to signify\n1.2.3...\n(\nn\n−\n1\n)\n.\nn\n1 . 2 . 3 ... (n - 1) . n\n1\n.\n2\n.\n3\n.\n.\n.\n(\nn\n−\n1\n)\n.\nn\n, which gives their pages the appearance of expressing surprise and admiration that\n2\n,\n3\n,\n4\n, etc. should be found in mathematical results.\nKramp went further than simple factorials, however, in his article\nMémoire sur les facultés numériques\nⓉ\n(\nMemoir on numerical faculties\n)\npublished in\nGergonne\n's\nAnnales de Mathématiques\nin\n1812\n. Kramp writes:-\nI give the name of 'Faculties' to products whose factors are an arithmetic progression, such as\na\n(\na\n+\nr\n)\n(\na\n+\n2\nr\n)\n.\n.\n.\n[\na\n+\n(\nm\n−\n1\n)\nr\n]\na(a + r)(a + 2r)... [a + (m - 1)r]\na\n(\na\n+\nr\n)\n(\na\n+\n2\nr\n)\n.\n.\n.\n[\na\n+\n(\nm\n−\n1\n)\nr\n]\nand to designate such a product, I suggested the notation\na\nm\n/\nr\na_{m/r}\na\nm\n/\nr\n​\nThe faculties form a class of very elementary functions, when their exponent is an integer, either positive or negative; but, in all other cases, these functions become absolutely transcendent.\nI note that any numerical faculty whatever is always reduced to the very simple form\n1\nm\n/\n1\n=\n1.2.3...\nm\n1_{m/1} = 1.2.3 ... m\n1\nm\n/\n1\n​\n=\n1\n.\n2\n.\n3\n.\n.\n.\nm\nor that other simpler form m! if one wishes to adopt the notation that I used in my 'Éléments d'arithmétique universelle'\nⓉ\n(\nElements of universal arithmetic\n)\n.\nKramp was elected to the geometry section of the\nAcadémie des Sciences\nin\n1817\n. On the title page of\nÉléments de géométrie\nⓉ\n(\nElements of geometry\n)\n(1806)\nhe is listed as belonging to the Academy of Erfurt, the Academy of Rovérédo, the Literary Society of Mainz and the Mineralogical Society of Jena.\nMany letters written by Kramp survive and these show that he was a man with a great deal of confidence in his own abilities. If one wishes to be a little unkind this self-confidence could reasonably be described as boasting. However, he worked with tireless energy on a wide range of topics, making many worthwhile contributions.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "refraction",
    "Louis Arbogast",
    "Lagrange",
    "Carl Friedrich Hindenburg",
    "Hindenburg",
    "Bessel",
    "Legendre",
    "Gauss",
    "factorial",
    "γ function",
    "James Stirling",
    "Alexandre Vandermonde",
    "Arbogast",
    "Augustus De Morgan",
    "De Morgan",
    "Gergonne",
    "Académie des Sciences"
  ],
  "imagens": []
}