{
  "nome_completo": "Christian Sophus Juel",
  "nome_curto": "Christian Juel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Juel/",
  "data_nascimento": "25 January 1855",
  "local_nascimento": "Randers, Denmark",
  "data_morte": "24 January 1935",
  "local_morte": "Copenhagen, Denmark",
  "summary": "Christian Juel was a Danish mathematician, specializing in geometry.",
  "biografia": "Christian Juel\n's father, Andreas Peter Theodor Juel\n(1822\n-\n1856)\nwas a judge but Christian never knew him for he died before Christian was one year old. Andreas Juel was born on\n15\nJuly\n1822\nin Copenhagen, Denmark, and married Augusta Sofie Hanne Caroline Emilie Jürgensen in\n1853\n. Augusta was born on\n16\nOctober\n1829\nin Godthaab, Greenland. Christian was the eldest of his parents' two children having the younger sister Theodora Sophie Juel who was born in\n1856\n. When Christian was five years old his mother remarried Jakob Georg Christian Wulff\n(1827\n-\n1908)\n. Jakob and Augusta had five children: Joachimine Frederikke Stredtmann Wulff\n(\nborn\n1861)\n; Christian August Jürgensen Wulff\n(\nborn\n1862)\n; Johanne A Wulff\n(\nborn\n1865)\n; Hans Christian Carl Wulff\n(\nborn\n1866)\n; and Wilhelmine Amalie Wulff\n(\nborn\n1870)\n. The family lived in Svendborg, a coastal town in southern Funen Island, Denmark, and it was in this town that Christian was brought up. He was educated there, attending the Realschule in Svendborg. When he was fifteen years old he went to Copenhagen and, in the following year, he entered the Technical University of Copenhagen.\nHe studied at the Technical University from\n1871\nuntil\n1875\n, then he decided that technical studies were not to his liking and that he would prefer to study pure science in general and pure mathematics in particular. One reason for this was the influence of\nJulius Petersen\nwho taught at the Technical University from\n1871\nand at the University of Copenhagen from\n1877\n. In January\n1876\nJuel took the entrance examinations for the University of Copenhagen. He studied there with Adolph Steen\n(1816\n-\n1886)\n, the professor of mathematics, and\nHieronymus Georg Zeuthen\nwho was a\ndocent\n. We should note that this was a time when mathematics at Copenhagen was reaching a high point marked by the founding of the\nDanish Mathematical Society\nin Copenhagen in\n1873\n. The Society's first committee consisted of\nThorvald Thiele\n, who taught astronomy at the university, Steen, and\nZeuthen\n. Juel completed his Master's Degree at the University of Copenhagen in\n1879\n. Continuing with his doctoral studies at the University of Copenhagen he received a gold medal for a geometrical treatise in\n1881\nand was awarded his doctorate in\n1885\nfor a dissertation on geometry entitled\nContributions to the geometry of imaginary lines and imaginary planes\n(\nDanish\n)\n. Juel had spent sixteen years completing his university education and so, despite starting young, was\n30\nyears old before he received his doctorate.\nJuel worked for several years as a mathematics teacher and private tutor of mathematics before being appointed to the Polytechnic Institute in Copenhagen in\n1894\n. He was promoted to a full professorship there three years later. He also sometimes lectured at the University of Copenhagen. From\n1889\nto\n1915\nhe was editor of the\nMatematisk Tidsskrift,\ntaking over from\nZeuthen\nwho had been the editor from\n1871\nto\n1889\n. This was the first Danish mathematical journal and it had been founded in\n1859\n. However, at first it was a journal aimed at school teachers of mathematics but in\n1890\n, when Juel was editor, it was split into Series A containing school level mathematics, and Series B which was a scientific journal containing articles on advanced topics. Series B allowed articles in foreign languages and contributions from foreign mathematicians began to appear in the journal beginning at this time. On\n23\nJuly\n1902\n, Juel married Laura Thiele\n(\nborn\n26\nMay\n1873\nin Copenhagen, died\n21\nMarch\n1925)\na daughter of the professor of astronomy in Copenhagen,\nThorvald N Thiele\n, and his wife Marie M Trolle\n(1841\n-\n89)\n. Christian and Laura Juel had four children: Aase\n(\nborn\n28\nApril\n1903\n, married Vagn Vanggaard\n)\n, Sven\n(\nborn\n17\nJuly\n1904)\n, Ole\n(\nborn\n16\nMay\n1906\n, died\n21\nFebruary\n1914)\n, and Inger\n(\nborn\n17\nSeptember\n1909)\n. In\n1907\nJuel was appointed to a newly created chair of rational mechanics at the Polytechnic institute.\nHe made substantial contributions to\nprojective geometry\nand wrote an important book on the topic. Some of his papers, written in German, are\nÜber einige Grundgebilde der projectiven Geometrie\nⓉ\n(\nOn some primitive forms of projective geometry\n)\n(1890)\n,\nÜber die Parameterbestimmung von Punkten auf Curven zweiter und dritter Ordnung\nⓉ\n(\nOn the parameter determination of points on curves second and third order.\n)\n.\nEine geometrische Einleitung in die Theorie der logarithmischen und elliptischen Funktionen\nⓉ\n(\nA geometric introduction to the theory of logarithmic and elliptic functions\n)\n(1896)\n,\nÜber einen neuen Beweis der Kleinschen Relation zwischen den Singularitäten einer ebenen algebraischen Kurve\nⓉ\n(\nOn a new proof of Klein'ss relation between the singularities of a plane algebraic curve\n)\n(1905)\n,\nEinige Sätze über ebene, ein-und mehrteilige Elementarkurven vierter Ordnung\nⓉ\n(\nSome theorems on plane and multipart elementary curves of the fourth order\n)\n(1915)\n,\nEinleitung in die Theorie der Elementarflächen dritter Ordnung\nⓉ\n(\nIntroduction to the theory of elementary surfaces of the third order\n)\n(1915)\n, and\nÜber die Kongruenz zweiten Grades und die Kummersche Fläche\nⓉ\n(\nOn the congruence of the second degree and the Kummer surface\n)\n(1926)\n. Juel's programme of research extended certain theorems on real manifolds of algebraic geometry to non-algebraic manifolds, even to non-analytic manifolds provided the concepts are generalised in a suitable way. His approach is similar to that of\nvon Staudt\nbut goes beyond\nvon Staudt\n's in places. Although he was not alone in making these improvements, since\nCorrado Segre\nalso proved similar results, but there is no doubt that Juel's results were obtained independently of\nCorrado Segre\n. The book we referred to at the beginning of this paragraph was written in German and had the title\nVorlesungen über projektive Geometrie mit besonderer Berücksichtigung der v. Staudtschen Imaginärtheorie\nⓉ\n(\nLectures on projective geometry with special reference to von Staudt's Imaginary theory\n)\n(1934)\n.\nPatrick Du Val\nreviewed this text and we give the first part of his review\n[\n3\n]\n:-\nProfessor Juel has in this book provided a worthy successor to the classical treatise of\nReye\n, which supplies just those deficiencies which in\nReye\n's ex-position were most remarkable. Many readers must have felt that if all that projective geometry could tell us of a problem involving a cubic equation was that it has at least one solution, and not more than three, then projective geometry had not by any means justified its claims to replace the ordinary algebraic kind. This reproach Professor Juel has set himself\n(\nwith no less industry than ingenuity\n)\nto remove. The method, of course, is implicit in the previous works - it is\nvon Staudt\n's theory of imaginary elements.\nAbout the strict axiomatic foundations of the real projective geometry with which he begins, he is content to be brief, and to refer the reader to the German version of\nEnriques\n' 'Lezioni sulla geometria projettiva'. In essence, however, he allows himself purely projective axioms and an axiom of continuity, which, as is familiar, will suffice to build up what is from the algebraic point of view the coordinate geometry in the field of the real numbers and infinity.\nThe extension of this to the complex number field is not essentially different from that of\nvon Staudt\n; the elementary forms\n(\nrow of points, plane pencil of lines, pencil of planes, conic locus, conic\nenvelope\n, and quadratic regulus\n)\nare defined; also the linear congruence, as an aggregate of lines related in a certain way to an involution in a regulus, the relation being such that if the involution is hyperbolic the congruence consists just of all lines which meet both the double lines. Imaginary points, lines of the first kind, and planes are then defined as elliptic involutions in elementary forms combined with orientations, and lines of the second kind as elliptic linear congruences combined with orientations; the device used by some writers to avoid the somewhat artificial introduction of orientations, of using a cubic instead of a quadratic involution, is disregarded.\nSo far all is familiar, and the reader is inclined to wonder if there are not enough books about this sort of thing. But now mapping an imaginary line of the second kind on the congruence of real lines which defines it, the author proceeds to prove a mass of theorems about chains, points conjugate with respect to a chain, projectivities and \"symmetralities\"\n(\ni.e. anti-projectivities\n)\nin the form, of the kind which one could also prove by introducing a complex coordinate and mapping it on a sphere. He now returns to the classical matter and introduces coordinates by the algebra of \"Würfe\", explaining the meaning in algebraic terms of what he has done geometrically. But his objective clearly is to justify all the algebraically obvious results by purely geometrical reasoning; and though in the remainder of the work he continually uses algebraic terms and ideas, I think it is fair to say that all these could be omitted\n(\nat the cost of brevity and intelligibility\n)\nand the arguments would still stand.\nThe rest of the book follows the general lines of some portions of\nReye\n- by no means the whole, since hardly any solid geometry is attempted - with due regard to the refinements introduced by the use of imaginary elements. The main topics covered are problems leading to cubic and quartic equations in one variable, reduced to finding the intersections of two conics, of which in the first case one intersection is known; the two-dimensional chain, and its relations; anti-collineations; the projective metric, Euclidean and non-Euclidean; the quadratic transformation, the rational plane cubic, and the general plane cubic.\nJuel also worked on the theory of finite equal polyhedra and on oval surfaces. In\n1899\nhe published a paper on what he called \"graphical curves\" and thereby inaugurated the study of a new family of geometric objects. These objects, known as \"géométrie finie\" in French and \"geometrische Ordnungen\" in German, are surveyed in\n[\n4\n]\n(\nsee also\n[\n6\n]\n)\nand more details are given in the book by H Künneth and\nO Haupt\n,\nGeometrische Ordnungen\nⓉ\n(\nGeometrical orders\n)\n(1967)\n. In\n1914\nJuel introduced the concept of an elementary curve\n[\n1\n]\n:-\n... which is in the projective plane without straight-line segments and has the\ntopological\nimage of a circle and a tangent at every point. Outside these points a convex arc can be described on each side. Thus an elementary curve consists of an infinite number of convex arcs passing smoothly one into another.\nAlthough these ideas are clever, Juel did not treat them with care and his writings on this topic, although interesting, are less than precise and leave something to be desired.\nJuel served mathematics in other important ways. We have mentioned above that he was an editor of\nMatematisk Tidsskrift\nfor over\n25\nyears. He also wrote textbooks for school level mathematics as well as for university level mathematics courses. These include:\nVorlesungen über Mathematik für Chemiker\nⓉ\n(\nLectures on mathematics for chemists\n)\n(1890)\n;\nElementar stereometri\nⓉ\n(\nElementary stereometry\n)\n(1896)\n;\nAnalytisk stereometri\nⓉ\n(\nAnalytical stereometry\n)\n(1897)\n;\nRen og anvendt aritmetik\nⓉ\n(\nPure and applied arithmetic\n)\n(1902)\n; and\nForlaesinger over rational mekanik\nⓉ\n(\nIntroduction to rational mechanics\n)\n(1913\n;\n2\nnd\nenlarged edition\n1920)\n. The textbook on rational mechanics provided the foundation for those entering the teaching profession who studied at the Polytechnic institute.\nAmong the honours which he received was being elected to the\nDanish Academy of Sciences and Letters\nin\n1899\n, being elected to honorary membership of the\nMathematical Association\nin\n1925\n, then receiving an honorary degree from the University of Oslo four years later. Juel attended the International Congress of Mathematicians held in Bologna in September\n1928\n. He delivered the invited lecture 'Beispiele von Elementarkurven und Elementarflächen'\nⓉ\n(\nExamples of Elementary Curves and Elementary Surfaces\n)\nwhich was published as a\n20\n-page paper in the\nProceedings\nof the Congress.\nIn his final years Juel's eyesight deteriorated and he was only able to write his classic text\nVorlesungen über projektive Geometrie mit besonderer Berücksichtigung der v. Staudtschen Imaginärtheorie\nⓉ\n(\nLectures on projective geometry with special reference to von Staudt's  Imaginary theory\n)\n(1934)\nwith the help of his student David Fog.",
  "matematicos_citados_na_biografia": [
    "Julius Petersen",
    "Hieronymus Georg Zeuthen",
    "docent",
    "Danish Mathematical Society",
    "Thorvald Thiele",
    "Zeuthen",
    "Thorvald N Thiele",
    "projective geometry",
    "von Staudt",
    "Corrado Segre",
    "Patrick Du Val",
    "Reye",
    "Enriques",
    "envelope",
    "O Haupt",
    "topological",
    "Danish Academy of Sciences and Letters",
    "Mathematical Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}