{
  "nome_completo": "Christian Beyel",
  "nome_curto": "Christian Beyel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beyel/",
  "data_nascimento": "29 November 1854",
  "local_nascimento": "Zürich, Switzerland",
  "data_morte": "16 January 1941",
  "local_morte": "Zürich, Switzerland",
  "summary": "Christian Beyel was a Swiss mathematician who taught at ETH Zürich.",
  "biografia": "Christian Beyel\n's father, Christian Melchior Beyel, was a bookseller. Beyel junior studied at the Engineering Department of the Polytechnic from\n1872\n-\n1876\n. He worked as an engineer for the Swiss North-Eastern Railways\n(\nSchweizerische Nordostbahn\n)\nfor a year, but moved to Göttingen in\n1877\nin order to do further studies in mathematics. A year later he returned to the Polytechnic as the assistant of\nWilhelm Fiedler\nand Wilhelm Ritter. He also matriculated at the University of Zürich in\n1878\n, but seems to have left it soon after, according to the matriculation register\n[\n3\n]\n.\nIn January\n1882\nBeyel received his doctorate from the University of Zürich for his thesis\nCentrische Kollineation nter  Ordnung in der Ebene vermittelt durch Ähnlichkeitspunkte von Kreisen\nⓉ\n(\nCentric Collineation of nth order in the plane by means of similarity points of circles\n)\n; it was re-conferred to him on the occasion of its\n50\nth\nanniversary. In\n1883\nhe\nhabilitated\nat the Polytechnic, as\nPrivatdozent\n. He held his post until\n1834\n, lecturing mainly on geometry, in particular projective geometry. Beyel was a member of the German Mathematical Society.\nIn\n1889\nhe married Lydia Magdalena Schalch\n(1860\n-\n1946)\n. Their son Franz did a PhD in German literature and worked as a teacher in Basel. \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t Beyel was a prolific writer. His most important book, written in\n1922\n, is\nDer mathematische Gedanke in der Welt. Plaudereien und Betrachtungen eines alten Mathematikers\nⓉ\n(\nThe mathematical idea in the world. Chats and reflections of an old mathematician\n)\n, in which he writes about mathematical topics and mathematics in everyday life for lay people. Reprints of this book are still sold today; a review\n[\n4\n]\ndescribes it as 'a declaration of love to mathematics'. Beyel also wrote a number of geometry books, such as\nGeometrische Studien\nⓉ\n(\nGeometrical studies\n)\n(1886)\nand\nDarstellende Geometrie: Mit einer Sammlung von\n1800\nDispositionen zu Aufgaben aus der darstellenden Geometrie\nⓉ\n(\nDescriptive Geometry: With a collection of\n1800\ndispositions to tasks of descriptive geometry\n)\n(1901)\n. The latter is a concise collection of the basic principles of orthogonal parallel projection intended for students; it is based on Beyel's lectures\n[\n2\n]\n. Moreover, Beyel published numerous papers on geometry: Two examples are\nLVII Sätze über das orthogonale Dreieck\nⓉ\n(\n57\ntheorems on the orthogonal triangle\n)\n(1889)\nand\nDer kubische Kreis mit Doppelpunkt\nⓉ\n(\nThe cubic circle with double points\n)\n(1897)\n.\nIn addition to his mathematical publications he wrote several articles on the state of the cinema, on political issues, and against immoral literature. He was one of the founders of the\nSchweizerische Monatshefte für Politik und Kultur\nⓉ\n(\nSwiss monthly for Politics and Culture\n)\nfounded in\n1921\n. Its current name is \"Swiss Month\"\n(\nSchweizer Monat\n)\n. He regularly reviewed books for this publication.\nBeyel joined the organising committee of the first International Congress of Mathematicians in December\n1896\n, but he did not hold a particular position.",
  "matematicos_citados_na_biografia": [
    "Wilhelm Fiedler",
    "habilitated",
    "Privatdozent"
  ],
  "imagens": [
    "beyel.jpg"
  ]
}