{
  "nome_completo": "Chuan-Chih Hsiung",
  "nome_curto": "Chuan-Chih Hsiung",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hsiung/",
  "data_nascimento": "15 February 1915",
  "local_nascimento": "Shefong, Jiangsi, China",
  "data_morte": "6 May 2009",
  "local_morte": "Needham, Massachusetts, USA",
  "summary": "Chuan-Chih Hsiung was a Chinese-born American mathematician specialising in differential geometry.",
  "biografia": "Chuan-Chih Hsiung\ndescribes his ancestors in\n[\n2\n]\n:-\nFor many generations my ancestors lived in a small village called Shefong, which is about ten miles from Nanchang, the capital of the province of Jiangsi. The village was located in a picturesque setting, bordered by a shimmering lake in the front and short blue-shaded mountains in the rear.\nMy ancestors were all farmers until my grandfather's generation when his only brother and he studied the works of Confucius and other literary scholars. Unfortunately they died within two years of each other, both in their mid thirties. At that time, my father\n[\nMu-Han Hsiung\n]\n, the second of three sons, was only eight years old. Fortuitously, a distant uncle considered my father to be especially intelligent and decided to give him the education that my grandfather had received.\nMu-Han Hsiung received a good education at the Advanced School in Nanchang and there he studied mathematics from English textbooks. After four years of study he graduated and was appointed as vice-principal and mathematics teacher at the new Jiangsi Provincial First High School. Mu-Han Hsiung married Tu Shih and they had four sons and a daughter who was the youngest in the family. Chuan-Chih was the third of the four sons. The second of Mu-Han and Tu Shih's sons, C Y Hsiung, also went on the become a professor of mathematics writing books such as\nElementary theory of numbers\n(1992)\n. Chuan-Chih's family moved from Shefong to Nanchang when he was three years old. Chuan-Chih was taught mathematics by his father who gave him a great love of the subject. He graduated from the Jiangsi Provincial First High School in Nanchang and, after sitting a highly competitive university entrance examination, became a mathematics student at the National Chekiang University\n(\nfounded in\n1897)\nin Hangchow. He graduated in\n1936\nafter being taught by Professor Buchin Su. He began undertaking research in mathematics on topics suggested by Buchin Su. For example he published\nOn the curvature form and the projective curvatures of curves in space of four dimensions\n(1940)\n. In this Hsiung expresses certain invariants of curves in a space of four dimensions found by Buchin Su, and published by him in\n1937\n, in terms of double ratios of covariant points. Hsiung's paper\nOn the plane sections of the tangent surface of a space curve\n(1940)\nwas reviewed by Guy Grove of Michigan State University who wrote:-\nThis paper concerns itself with the study of the sections of the tangent developable surface of a twisted curve through the tangent line of the curve. The problem was previously studied by Buchin Su\n[(1933)\nand\n(1937)]\n, making use of certain osculants introduced by\nBompiani\n[(1926)]\n. It is found among other things that among the plane sections of the tangent surface there exists one and only one whose seven-point cuspidal cubic also has eight-point contact; there are only two sections for which the eight-point cubic through the cusp of the seven-point cuspidal cubic has nine-point contact with the plane section; as the sectioning plane revolves about the tangent line the locus of the cusp of the seven-point cuspidal cubic is a twisted cubic; the locus of the line of cusps of the six-point cuspidal cubics is a\nquadric\ncone; the locus of the cuspidal tangent is a cubic ruled surface having the tangent to the space curve as a triple line; the locus of the seven-point cuspidal cubic is a surface of order six.\nGuy Grove not only reviewed this paper but also Hsiung's papers\nSopra il contatto di due curve piane\n(1940)\n,\nThe canonical lines\n(1941)\n,\nA graphical construction of the sphere osculating a space curve\n(1941)\n,\nOn the curvature form and the projective curvatures of a space curve\n(1942)\n,\nAsymptotic ruled surfaces\n(1943)\n,\nProjective differential geometry of a pair of plane curves\n(1943)\n,\nTheory of intersection of two plane curves\n(1943)\n,\nAn invariant of intersection of two surfaces\n(1943)\n, and\nProjective invariants of a pair of surfaces\n(1943)\n. Grove was very impressed with Hsiung's mathematics and tried to arrange for him to come to Michigan State University to study for a doctorate. Hsiung had been keen to continue his education in the United States after he graduated but he had been prevented by the war. In\n1937\nwar had broken out between China and Japan. Chekiang province was in the front line for Japanese attacks and many people left the province and moved to safer areas further west. By\n1938\nthe Japanese occupied much of Chekiang province and Hsiung could not travel to the United States.\nAlthough we listed several of Hsiung's papers between\n1940\nand\n1943\nthere was one which we did not mention since it was rather different from the rest. This was joint work with his colleague Fu Traing Wang at the National University of Chekiang and involved a study of Tangrams, an ancient Chinese puzzle consisting of seven tiles which can be assembled into a variety of geometric and decorative forms. They proved in\n1942\nthat no more than\n13\ndifferent convex Tangrams can be formed.\nIn\n1943\nGrove arranged for Hsiung to become a teaching assistant at Michigan State University so that he would have sufficient financial support to work for his doctorate. However the war between Japan and China still made it impossible for Hsiung to travel to the United States. By this time China was receiving considerable support from the United States in its war effort but Japan still held most of eastern China. Only after Japan surrendered in May\n1945\nwas it possible for China to begin to try to reunite the country but by this time it looked as though a civil war with the Communists could not be avoided. Only in\n1946\nwas Hsiung able to leave China and begin working with Grove at Michigan State University. He was awarded his doctorate in\n1948\nfor his thesis\nRectilinear Congruences\n. In fact he had the distinction of becoming the first student to be awarded a Ph.D. by Michigan State University.\nAfter the award of his doctorate, Hsiung was appointed as an instructor at Michigan State University and held this for two years until\n1950\nafter which he spent the winter semester as a visiting lecturer at Northwestern University in Evanston.\nHassler Whitney\nthen invited Hsiung to become his research assistant at Harvard and Hsiung took up this position in the spring of\n1951\n. He wrote\n[\n2\n]\n:-\nI benefited very much from my visit to Harvard; I was able to learn the latest developments in mathematics.\nWhitney\nwent to the Institute for Advanced Study in the autumn of\n1952\nand Hsiung was offered an assistant professorship at Lehigh University in Bethlehem, Pennsylvania. The university had been founded in\n1865\nby Asa Packer, an industrialist and philanthropist, and Hsiung was to spend the rest of his career there. He was promoted to associate professor in\n1955\nand then full professor in\n1960\n. He retired, receiving the title professor emeritus, in\n1984\n.\nWe have already indicated the range of Hsiung's early work on projective geometry. After he had spent time in Harvard as\nWhitney\n's research assistant, he began studying more global geometry problems. Topics he then investigated include two-dimensional Riemannian manifolds with boundary\n(\nuniqueness and isoperimetic inequalities\n)\n, groups of conformal transformations of a compact Riemannian manifold, curvature and characteristic classes, complex structure, and isospectral almost-\nL\nL\nL\n-manifolds. His interests are illustrated by looking at the various textbooks he has published.\nA first course in differential geometry\npublished in\n1981\nwas reviewed by O Kowalski who writes that it:-\n... is designed as a course of classical\ndifferential geometry\nfor beginning graduate students or advanced undergraduate students. Unlike most classical books on the subject, more attention is paid to the relationship between local and global properties. In fact, the title of the book might well be A first course in differential and integral geometry.\nTwo further texts, written after he retired, are\nAlmost complex and complex structures\n(1995)\nand\nA first course in differential geometry\n(1997)\n. The first of these is a monograph which presents many of Hsiung's own results, in particular including his important work on the nonexistence of a complex structure on\nS\n6\nS^{6}\nS\n6\n. The second of these books has been reviewed by Man Chun Leung who writes:-\nThe book is designed to introduce differential geometry via the study of curves and surfaces in\nE\n3\n\\mathbb{E}^{3}\nE\n3\n. It begins with a review on point-set\ntopology\n, multi-dimensional calculus and linear algebra. With the fundamental material in place, the author discusses the theory of smooth curves, including the\nFrenet\nformulas, the isoperimetric inequality and the four-vertex theorem. Local theory of surfaces is presented, with the emphasis on fundamental forms, curvatures, ruled and minimal surfaces. The global theory of surfaces in\nE\n3\n\\mathbb{E}^{3}\nE\n3\nis studied in the last chapter. The central themes are the\nGauss\n-\nBonnet\nformula and uniqueness theorems for the\nMinkowski\nand\nChristoffel\nproblems. The author presents the discussion in a precise, direct and step-by-step manner. Most sections end with a carefully selected set of exercises, some of which supplement the content of the section. The book provides a solid introduction to differential geometry of curves and surfaces. It also includes many short and valuable remarks on the classical literature of the subject.\nThere is one very important contribution which Hsiung has made which we have not mentioned yet. This is his founding of the Journal of Differential Geometry in\n1967\n. He acted as editor-in-chief of the journal from the time of its foundation. Hsiung writes\n[\n2\n]\n:-\nUnder the influence of this journal, differential geometry has become a very active branch of mathematics, with scope far exceeding its former classical one.\nMan Chun Leung writes:-\nIt is not necessary to heap accolades upon this contribution - the journal has long been recognized as a forum of publication of the finest papers in differential geometry.",
  "matematicos_citados_na_biografia": [
    "Bompiani",
    "quadric",
    "Hassler Whitney",
    "Whitney",
    "differential geometry",
    "topology",
    "Frenet",
    "Gauss",
    "Bonnet",
    "Minkowski",
    "Christoffel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}