{
  "nome_completo": "Clarence Irving Lewis",
  "nome_curto": "Clarence Lewis",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lewis/",
  "data_nascimento": "12 April 1883",
  "local_nascimento": "Stoneham, Massachusetts, USA",
  "data_morte": "3 February 1964",
  "local_morte": "Menlo Park, California, USA",
  "summary": "Clarence Lewis was an American philosopher and  logician.",
  "biografia": "Clarence Lewis\n's parents were Irving Lewis\n(\nborn Pelham,\n18\nMarch\n1852)\nand Hannah Carlin Dearth\n(\ncalled Carrie\n)\n. In his autobiography\n[\n11\n]\nLewis wrote:-\nMy mother was a vital young woman - nineteen when I was born - of simple faith and with the love of life. She met the hard years with real courage, determined that, whatever might come, her children should have a healthy and normal childhood. She helped my father and me in making and tending the large garden which supplied our table ...\nHis father, Irving Lewis, was a shoemaker. However, he held left-wing views and after participating in a strike was blacklisted and could not get employment. Both Irving Lewis and his wife came from very poor families, so life was very hard.  Clarence Lewis was the oldest of his parents' five children having a sister Mina\n(\nborn\n16\nJune\n1885)\nand three brothers Edson\n(\nborn\n12\nDecember\n1887)\n, Raymond\n(\nborn\n16\nSeptember\n1890)\nand Paul\n(\nborn\n9\nJuly\n1893)\n. The young Irving, being the oldest of the children, was expected to help with the family finances and indeed he did from the age of seven\n[\n2\n]\n:-\nAt seven he had a long paper route and collected coal for the family from along the railroad tracks and at the railroad roundhouse where the fireboxes were dumped after a run.\nThe family moved to Bradford, in Essex County, Massachusetts, and there Lewis attended Bradford High School. He worked for four years at Pray's Sign Shop while at High School. In\n1897\nBradford was annexed to Haverhill and, after that, Lewis attended Haverhill High School. There he studied Latin, Greek, French, mathematics and physics. He worked at John J Page's Boot and Shoe Factory in Haverhill for three years. Having to work while at High School, certainly meant that he did not shine as much as he might otherwise have done and, although his outstanding abilities were recognised by his teachers, his grades were only good rather than outstanding. He applied to enter Harvard and they listened to the reports that his teachers wrote rather than his grades and accepted him. His teacher Alison Tuttle wrote\n(\nsee for example\n[\n2\n]\n)\n:-\nWe consider Mr C I Lewis one of our most worthy and capable young men. His ability is far above the average and I have never seen or heard anything to criticise in his character. He has been one of the leaders of his class in scholarship and would have stood much higher but for the fact of working so hard to get money to take him through school and into college.\nLewis had met Mabel Maxwell Graves\n(\nborn\n19\nMay\n1884\n, died\n18\nApril\n1987)\nat Haverhill High School. An excellent pupil, Mabel worked after graduating from Haverhill High School, putting aside all the money she could so that she could attend Mount Holyoke College.\nIn\n1902\nLewis graduated from Haverhill High School and entered Harvard. He had to find some way to pay his fees, however, so he worked in resort hotels during the summers and during term he earned money as a waiter in the Randall dining Hall at Harvard. This did not bring in enough money to cover all his expenses so he had to take leave of absence in\n1905\n-\n06\n. He spent the year teaching English at Quincy High School. He disliked this intensely but it did allow him to return to Harvard and graduate in\n1906\nwith an A.B. His main subjects had been philosophy, English and Economics. After graduating, Lewis was appointed as an instructor in English at the University of Colorado.\nLewis married Mabel Graves on\n1\nJanuary\n1907\n; they had four children, one dying while still a child, Irving Maxwell Lewis\n(1907\n-\n1913)\n, Margaret Maxwell Lewis\n(1912\n-\n1931)\n, David Edson Lewis\n(\nborn\n1915)\n, and Andrew Kittredge Lewis\n(\nborn\n1925)\n. Mabel graduated from Mount Holyoke College in\n1908\n. Lewis returned to Harvard in autumn\n1908\nto study for his Ph.D. advised by Ralph Barton Perry\n(1876\n-\n1957)\nbut he was greatly influenced by Josiah Royce\n(1855\n-\n1916)\nwho could not be his official supervisor since he had recently retired. Lewis took courses which discussed the work of\nGeorge Boole\n,\nGeorg Cantor\n,\nWilliam Clifford\n,\nLouis Couturat\n,\nRichard Dedekind\n,\nHermann von Helmholtz\n,\nDavid Hilbert\n,\nEdward Huntington\n,\nAlfred Kempe\n,\nLeopold Kronecker\n,\nChristine Ladd-Franklin\n, Hugh MacCall,\nCharles Peirce\n,\nHenri Poincaré\n,\nBertrand Russell\n, and\nErnst Schröder\n. Non-euclidean geometry and\nFelix Klein\n's 'Erlanger Programme' were also discussed. He was awarded a Ph.D. by Harvard in\n1910\nfor his thesis\nThe place of intuition in knowledge\n.\nIn\n1911\nLewis was appointed as an Instructor at the University of California at Berkeley and he was promoted to assistant professor three years later in\n1914\n. His first publications, which appeared at this time, include\nProfessor Santayana and Idealism\n(1912)\n,\nImplication and the Algebra of Logic\n(1912)\n,\nRealism and Subjectivism\n(1913)\n,\nInteresting Theorems in Symbolic Logic\n(1913)\n,\nA New Algebra of Implications and Some Consequences\n(1913)\n,\nThe Calculus of Strict Implication\n(1913)\n,\nThe Matrix Algebra for Implications\n(1914)\n, and\nA Too Brief Set of Postulates for the Algebra of Logic\n(1915)\n.\nExtracts from three of these papers are given at\nTHIS LINK\n.\nWe note that the paper\nA New Algebra of Implications and Some Consequences\nwas read at a meeting of the San Francisco Section of the\nAmerican Mathematical Society\non\n26\nOctober\n1912\n.\nDuring World War I, Lewis undertook some war work serving in the army but returned to his duties at Berkeley. In\n1918\nhe published the book\nA Survey of Symbolic Logic\nwhich he wrote so that his students at Berkeley might have a class textbook.\nThe Preface to\nA Survey of Symbolic Logic\nis given at\nTHIS LINK\n.\nThe book was reviewed by\nNorbert Wiener\nwho wrote\n[\n18\n]\n:-\nThis work ... fills an important hiatus in the literature of logistics and mathematical logic. These studies are of so recent an origin that there has been till now no opportunity to consolidate into a single treatise anything but their most simple and primitive aspects. Accordingly the student, after leaving the almost childishly simple Boolean algebra as presented in the writings of\nCouturat\nand del Ré, is immediately confronted with that forbidding monument of patience and research, the 'Principia Mathematica' of\nWhitehead\nand\nRussell\n. He encounters an unfamiliar symbolism, new methods, and a most exacting standard of rigour. It is only after he has become proficient in this new field that he can discern the fundamental unity underlying the investigations of\nBoole\n,\nDe Morgan\n,\nPeirce\n, and\nSchröder\n, on the one hand, and those of\nFrege\n,\nWhitehead\n, and\nRussell\n, on the other. Professor Lewis has written a work that completely bridges over the gap between the old and the new. He treats the history of symbolic logic in an impartial and comprehensive way, slighting neither the founders of the classical theory nor the principal innovators of the present day. After a good resume of the classical theory of equations and inequations, he proceeds to a parallel development of the foundations of the logic of propositions, propositional functions, and classes on the\nBoole\n-<\nPeirce\n-\nSchröder\nbasis and on that of the 'Principia', exhibiting both the formal identity of the two systems and the inadequacy of\nPeirce\n's enumerative method of defining universal and particular propositions in terms respectively of iterated logical multiplication and iterated logical addition. There is a mass of excellent detail work in this connection, so that this part of the book should prove useful as a glossary for those who desire to transfer statements from the\nPeirce\nsymbolism to that of\nRussell\nand vice versa.\nIn\n1920\nLewis returned to Harvard when he was appointed as a Lecturer. He was promoted to assistant professor in\n1921\n, to associate professor in\n1924\nand professor in\n1930\n. When Ralph Perry retired from the Edgar Pierce Chair in Philosophy at Harvard in\n1946\n, Lewis was named Edgar Pierce Professor. He held this chair until he retired in\n1953\n. During these years at Harvard he published a number of important books such as:\nMind and the World-Order: Outline of a Theory of Knowledge\n(1929)\n, in which he presented his ideas which grew out of his investigations in the field of exact logic and its application to mathematics;\n(\nwith Cooper Harold Langford\n)\nSymbolic Logic\n(1932)\n, which develops a modal system of \"strict implication\" for interpreting the logical force of \"if . . . then\"; and\nAn Analysis of Knowledge and Valuation\n(1946)\n. Reviewing this last mentioned book, which grew out of his Carus lectures at Berkeley in\n1945\n, John Curt Ducasse\n(1881\n-\n1969)\nwrites\n[\n8\n]\n:-\nProfessor Lewis' Carus lectures 'An Analysis of Knowledge and Valuation' comprise three books and an introduction. Their ultimate objective is to develop\n(\nin Book III\n)\nthe thesis that valuation is a form of empirical knowledge. The nature of empirical knowledge is the topic of Book II; that of a priori knowledge, of Book I. The treatment has the originality and technical expertness which have marked Lewis' earlier publications, and the book is undoubtedly one of the major modern contributions to basic philosophical theory. Any number of questions of fundamental importance are subjected in it to penetrating analysis. The book is tacitly addressed to technically equipped students of philosophy, although some pages here and there would be rewarding to the more thoughtful general reader. The style is lucid enough but it assumes interest on the reader's part in the questions discussed rather than makes any attempt to arouse it. The presentation is rather prolix, often repetitious, and devoid of dramatic quality. There are many places where greater terseness would have given more psychological punch to Lewis' contentions.\nWilliam Tuthill Parry\n(1908\n-\n1988)\n, who received a Ph.D. from Harvard in\n1932\nwith a thesis supervised by\nAlfred North Whitehead\n, attended lectures by Lewis. He writes in\n[\n17\n]\n:-\nLewis was a splendid teacher, conscientious, serious, always seeking the truth and seeking to convey it; never condescending and never pretending; not showy but with a wry wit and a salty humour. Basically, he was a good teacher because he was a careful scholar and a clear thinker, honest with himself and with his students. Many a graduate student who came to Harvard's philosophy department because of the repute of the University, the department, or some more famous professor, found the most lasting impression was that made by Lewis. One detail will give a hint of his probity. Having assigned his own book as a text, he told our class that, if we would bring the receipt from the bookstore, he would refund the amount of his royalty.\nAfter retiring from Harvard, Lewis spent one year lecturing at Princeton and then went to live in Menlo Park, California. This meant that Lewis and his wife were close to their grandchildren. During the ten years he spent there in retirement he did some teaching, namely at Stanford University, Michigan State University and the University of Southern California. During these years he gave the Woodbridge lectures at Columbia University in\n1954\n, the Powell lectures at Indiana University in\n1956\n, and the Honors College lectures at the Wesleyan University in\n1959\n.\nAmong the honours that Lewis received we mention his honorary doctorate from the University of Chicago in\n1941\n, the Butler gold medal from Columbia University in\n1950\n, and the $\n10\n,\n000\nprize for scholarship from the American Council of Learned Societies in\n1961\n.\nIn his last years Lewis suffered from a heart complaint which eventually led to his death. He had suffered a heart attack as early as\n1932\n(\nwhen he was only\n49\nyears old\n)\nbut he made a complete recovery and this did not in any way hinder his academic activities. The\n1932\nheart attack may have been, at least in part, the result of the death of his daughter a year earlier and in part due to overwork. Let us end by quoting the summary of his achievements from\n[\n17\n]\n:-\nLet us attempt to sum up the influence of Lewis's writing and teaching. He is the principal founder of the modern symbolic treatment of modal logic and theory of entailment. He contributed to the history of logic. His 'Survey'  was a pioneer textbook, and both of his logic books combined pedagogical value with important contributions to the subject. His contributions to philosophy of logic and to epistemology are important and influential. He has heightened the awareness of the interrelations between logic, epistemology, and value theory; and has made a strong case for cognitivism in valuation.\nFor more information about the different aspects of Lewis' work we have produced  list of over fifty papers which discuss the various topics - see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "George Boole",
    "Georg Cantor",
    "William Clifford",
    "Louis Couturat",
    "Richard Dedekind",
    "Hermann von Helmholtz",
    "David Hilbert",
    "Edward Huntington",
    "Alfred Kempe",
    "Leopold Kronecker",
    "Christine Ladd-Franklin",
    "Charles Peirce",
    "Henri Poincaré",
    "Bertrand Russell",
    "Ernst Schröder",
    "Felix Klein",
    "THIS LINK",
    "American Mathematical Society",
    "Norbert Wiener",
    "Couturat",
    "Whitehead",
    "Russell",
    "Boole",
    "De Morgan",
    "Peirce",
    "Schröder",
    "Frege",
    "Alfred North Whitehead"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}