{
  "nome_completo": "Czesław Olech",
  "nome_curto": "Czesław Olech",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Olech/",
  "data_nascimento": "22 May 1931",
  "local_nascimento": "Pińczów, Poland",
  "data_morte": "1 July 2015",
  "local_morte": "Warsaw, Poland",
  "summary": "Czesław Olech was a Polish mathematician who worked in differential equations and control theory.",
  "biografia": "Czesław Olech\nwas born in Pińczów, a town about\n60\nkm north east of Kraków and\n40\nkm south of Kielce. His father, who had trained as a forester, was a secondary school teacher of biology while his mother had also been a school teacher before her marriage. Czeslaw attended elementary school in Pińczów before continuing his education for four years in the Pińczów\nGymnasium\n. These were difficult years because of World War II. Poland had been an independent country since\n1919\nbut, at the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack - the Germans from the west and the Russians from the east - quickly defeated the Polish army and the district that Olech was living in was occupied by German forces. Despite this, teachers were able to keep the schools running and he was able to continue his education without interruptions. He showed a marked talent for mathematics so his father thought that he should have the benefit of a specialist mathematical school to complete his schooling. It was in Kielce that Olech attended the specialist mathematical school, entering the Stefan Zeromski High School there in\n1947\n. He graduated from the High School on\n13\nMay\n1949\n.\nAfter passing the maturity examination, Olech still had no very definite aims concerning the subjects he wanted to study. He writes\n[\n5\n]\n:-\nI chose mathematics since I was convinced that this was the direction that gave me the best chance of being accepted to study at a college, and so it was. Without difficulties, I was accepted to study mathematics at the Jagiellonian University of Kraków. At that time I did not expect a different future than that of a middle school mathematics teacher.\nHe embarked on a three-year course leading to a first degree in mathematics. In his first year he took three lecture courses: analysis by\nTadeusz Ważewski\n, algebra by\nAndrzej Turowicz\nand analytic geometry by Jacek Szarski.\nAndrzej Turowicz\nwas a Benedictine monk and Catholic priest who lived in the monastery at Tyniec, near Kraków. He had been a student of\nWażewski\n, obtaining his doctorate in\n1946\n. Jacek Szarski\n(1921\n-\n1980)\nhad also been a student of\nWażewski\n, obtaining his doctorate in\n1945\n. Olech enjoyed all three courses, which were well delivered, but he had special praise for\nWażewski\n's style of lecturing: the most vibrant of the three, and the class had to be very alert since he often addressed questions to his audience. Olech not only had excellent teachers, he also had some exceptionally talented fellow students. Three of these students, Zdzisław Opial\n(1930\n-\n1974)\n, Wlodzimierz Mlak\n(1931\n-\n1994)\n, and Jan Bochenek\n(1927\n-\n2009)\n, were soon appointed as assistants and went on to become professors of mathematics. After completing the three-year first degree, Olech was accepted onto the course leading to a Master's Degree\n(\nessentially equivalent to a doctorate\n)\n.\nStanisław  Gołąb\n(1902\n-\n1980)\nhad been a student of\nStanisław Zaremba\n, obtaining his doctorate in\n1931\n. He worked at the University of Science and Technology in Kraków and he offered Olech a job as his assistant. Olech accepted and began working for\nGołąb\non\n18\nAugust\n1952\n. He was assigned a desk in a large room where all the mathematics assistants worked. A few days after he started work he was given a problem to solve\n[\n5\n]\n:-\nI found a letter on the desk from Professor\nGołąb\n, with details of a task to be solved. I already had some experience in solving mathematical problems, and so I managed to solve it. I informed the Professor at the earliest opportunity that I had completed the task. He was not curious about the details, but he asked me to write out my solution, which of course I did. I did not hear anything more about it until after a long time I was told that money had been put into my bank account. I was amazed and I ask for what? ... After explanation of the mystery, I learned that I had published a joint work with Professor\nGołąb\nin 'Annales Polonici Mathematici'. Is it possible to think of a better surprise?... I received the award personally presented by His Magnificence the Rector, Zygmunt Kowalczyk.\nLet us add that the joint\nGołąb\n-Olech paper, entitled\nContribution à la théorie de la formule simpsonienne des quadratures approchées\nⓉ\n(\nContribution to the theory of approximate Simpson's quadrature formula\n)\n, was published in French and appeared in\n1954\n. Also note that the Rector of the University of Science and Technology, who presented Olech with his award, was the engineer and geologist Zygmunt Kowalczyk\n(1908\n-\n1985)\n. After being awarded a three-year scholarship to undertake research, Olech had to give up his position as an assistant at the University of Science and Technology. The first of these three years, however, was not to be spent undertaking research in mathematics but in attending lectures on Marxism-Leninism. This aspect of the doctoral course put some students off completing their doctorates, for example Olech's fellow student Jan Bochenek gave up his doctorate rather than study these lectures.\nOlech married Jadwiga Jastrzebska, who was a mathematician and teacher. They had five children: Teresa\n(\nborn\n1955)\n, Anna\n(\nborn\n1956)\n, Wanda\n(\nborn\n1959)\n, Barbara\n(\nborn\n1963)\n, and Janusz\n(\nborn\n1963)\n. He defended his doctoral thesis\nOn the asymptotic coincidence of sets filled up by integrals of two systems of ordinary differential equations\non\n26\nApril\n1958\n. He was not particularly happy with his thesis, however. He wrote\n[\n5\n]\n:-\nIn a short time I completed a doctoral thesis. It was not the best work among my achievements. The job I had to do was to \"glue\" two concepts together that do not really fit together very much. The job done, but the result did not impress, at least not the author. The work was published, and accepted as satisfying the conditions of the doctoral thesis. I successfully defended my doctorate, but the work had no further \"life\". At least I did not notice it.\nIn September\n1954\nWażewski\nand\nSolomon Lefschetz\nhad met at the International Congress of Mathematicians in Amsterdam.\nWażewski\nhad there presented his ideas of applying the topological notion of a retract to the study of the solutions of differential equations and\nLefschetz\nhad seen the idea as being one of the most significant advances in the study of differential equations. This led to\nLefschetz\ninviting Olech to spend a year in the United States. Olech spent the academic year\n1960\n-\n61\nat the Research Institute of Advanced Studies\n(\nRIAS\n)\nin Baltimore where Lefschetz was director. He arrived in October\n1960\n. He gave a lecture course on the method of retracts and its applications. It was a particularly successful year during which he made several contacts which led to collaborations. In particular he worked with Philip Hartman and they published the joint paper\nOn global asymptotic stability of solutions of differential equations\n(1962)\n. His friendship with Gary Meisters led to many joint publications, the first being\nLocally one-to-one mappings and a classical theorem on schlicht functions\n(1963)\n. During Olech's year at Princeton, Lawrence Markus lectured on problems of global stability of differential equations and Olech was able to generalise some of the results. This contribution was highly praised by\nLefschetz\n.\nReturning to Poland in\n1961\n, Olech worked on his\nhabilitation\nthesis which he submitted in the following year. This thesis,\nOn the global stability of an autonomous system on the plane\n, was published in the first volume of the journal\nContributions to Differential Equations\nin\n1963\n. He worked at the Institute of Mathematics of the\nPolish Academy of Sciences\nin Kraków, and taught both at the University of Science and Technology in Kraków and at the Jagiellonian University in Kraków. He was promoted to associate professor in\n1966\nand had a second research visit to the United States when he spent from January\n1967\nto April\n1968\nat Brown University. He became a full professor in\n1973\n.\nHowever, we mentioned above that Olech and his wife had five children. In fact the last two of these were twins born in\n1963\n. As his large family grew up he found that accommodation in Kraków was limited and he sought a move. Offers came from a number of different universities, in particular from Gdańsk, Katowice, and Gliwice. In\n1970\nhe chose to accept an offer to move to Warsaw and take on the role as director of the Institute of Mathematical Sciences of the\nPolish Academy of Sciences\nthere. He took up that position in July and in September of that year he was an invited speaker at the International Congress of Mathematicians in Nice. He became involved in plans to create an international mathematics research centre in Warsaw. This was finally agreed on\n13\nJanuary\n1972\nwhen the Stefan Banach International Mathematical Centre in Warsaw was founded. Olech became the first director of this International Mathematical Centre, a position he held until\n1991\n.\nIn\n1978\n, at the International Congress of Mathematicians in Helsinki, an invitation to hold the\n1982\nCongress in Warsaw was accepted. In\n1979\nOlech became a member of the Executive Committee of the International Mathematical Union. However, the political situation in Poland had serious repercussions for the Congress. A strike at the Gdańsk shipyard led by Lech Walesa forced concessions from the government. Walesa led the strong Solidarity trade union which increased in its power. The government decided to attempt to break Solidarity by introducing martial law in December\n1981\n. As a result of the political situation, the Executive Committee of the International Mathematical Union decided to postpone the Congress to\n1983\nbut to hold the General Assembly of International Mathematical Union in Warsaw, as had been planned, in August\n1982\n. Olech was chairman of the Polish Organizing Committee for the Congress which was responsible for all the arrangements. He reported to the General Assembly in August\n1982\nthat plans were going well, and the majority of invited speakers had accepted the invitation to deliver lectures.\nHowever, some delegates at the meeting expressed the view that the Congress could not take place as planned in\n1983\nif martial law was still in force. However\n[\n1\n]\n:-\nOlech took a definite stand. He stated that there were serious reasons for such a drastic decision as the introduction of martial law; that otherwise, more tragic developments were likely to have occurred. Thus, he maintained, one should not expect martial law to be suspended before the circumstances that had caused it to be introduced no longer obtained.\nAmerican delegates suggested that moral aspects should take precedent and the Congress should be cancelled. Olech replied\n[\n1\n]\n:-\nRefusing now to organise the Congress would be perhaps a comfortable decision from a moral point of view but also irresponsible and harmful to all those who are eager to attend the Congress and especially to invited speakers who accepted the invitation and are anxious to address the Congress. We cannot turn our back on the responsibility we took in\n1978\nsimply to avoid a morally uncomfortable decision.\nAfter further discussion during which Olech continued to argue strongly that the Congress should go ahead,\nFrank Adams\nproposed a motion: \"This Assembly will prefer that the Congress take place.\" The discussion that followed made it clear that, if a vote took place, the motion would pass but some would vote against\n[\n1\n]\n:-\nIn this situation Olech, who would have been the greatest personal winner, showed statesmanship. He said that the resolution introduced by Professor\nAdams\nshould not be voted on. The resolution would not be accepted unanimously, and this would put the Executive Committee in the situation that any decision it took would be against some members of the Union and might be dangerous for the future of the Union. A decision taken by the Executive Committee in November would not carry such a danger, since the Executive Committee members do not represent any country but only themselves as individuals.\nFrank Adams\nwithdrew his motion. Olech had not only succeeded in ensuring that the Congress go ahead as planned in\n1983\nbut he had also saved the International Mathematical Union from a damaging situation. At the opening ceremony of the Congress, which took place in the Palace of Culture on\n16\nAugust\n1983\n, Olech was elected President of the Warsaw Congress.\nThe speeches he gave on that occasion are available at\nTHIS LINK\nand at\nTHIS LINK\nAfter the Congress, Olech continued to hold major roles in Polish mathematics. He was president of the Board of Mathematics of the\nPolish Academy of Sciences\nin\n1987\n-\n89\nand president of the Scientific Council of the Institute of Mathematics of the\nPolish Academy of Sciences\nin\n1990\n-\n2002\n.\nTo give an indication of the range of Olech's mathematical contributions, we quote from\n[\n6\n]\n:-\nThe most important results in Professor Czeslaw Olech's scientific work have been in the qualitative theory of differential equations and in control theory. Many of them have already become part of the standard theory. The range of his interests, however, is much wider. It includes a number of other branches of mathematics, and his works are classified by Mathematical Reviews as including, among others, the area of linear and multilinear algebra, measure and integration theory, calculus of variations, convex and discrete geometry, operations research and general systems theory. He obtained significant results for vector measures and their applications in the theory of differential equations and the theory of optimal control. He also solved very important problems concerning autonomous systems on the plane with stable Jacobian matrix at each point of the plane and applied the Ważewski topological method in studying the asymptotic behaviour of solutions of differential equations. In the case of Czeslaw Olech's results one should not ask for the number of citations\n(\nalthough some of them have an impressive number\n)\n, because some of his results are already treated as being classic so do not require precise references.\nOlech has received many honours for his outstanding contributions to mathematics. He was elected a Corresponding Member of the\nPolish Academy of Sciences\nin\n1973\n, and a full member of the Academy in\n1983\n. He was elected to the\nPontifical Academy of Sciences\n(1986)\n, and the\nRussian Academy of Sciences\n(1988)\n. He was elected Vice-President of the\nEuropean Mathematical Society\n(1991\n-\n93)\n. He has been awarded: the State Prize of Poland\n1\nst\nClass\n(1976)\n; The Commander's Cross of the Order of Polonia Restituta\n(1984)\n; the Marin Drinov Gold Medal by the\nBulgarian Academy of Sciences\n(1979)\n; the Bernard Bolzano Gold Medal by the\nCzechoslovak Academy of Sciences\n(1981)\n; the\nStefan Banach\nMedal by the\nPolish Academy of Sciences\n(1992)\n; and the\nNicolaus Copernicus\nMedal by the\nPolish Academy of Sciences\n(2001)\n. He received the\nWładysław Orlicz\nMedal from the University of Poznań after delivering the\nOrlicz\nLecture there. He has received honorary degrees from Vilnius University\n(1989)\n, the Jagiellonian University in Kraków\n(2006)\n, and the University of Science and Technology in Kraków\n(2009)\n. He was made an honorary member of the\nUnion of Czech Mathematicians and Physicists\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Tadeusz Ważewski",
    "Andrzej Turowicz",
    "Ważewski",
    "Stanisław  Gołąb",
    "Stanisław Zaremba",
    "Gołąb",
    "Solomon Lefschetz",
    "Lefschetz",
    "habilitation",
    "Polish Academy of Sciences",
    "Frank Adams",
    "Adams",
    "THIS LINK",
    "Pontifical Academy of Sciences",
    "Russian Academy of Sciences",
    "European Mathematical Society",
    "Bulgarian Academy of Sciences",
    "Czechoslovak Academy of Sciences",
    "Stefan Banach",
    "Nicolaus Copernicus",
    "Władysław Orlicz",
    "Orlicz",
    "Union of Czech Mathematicians and Physicists"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}