{
  "nome_completo": "Dattatreya Ramachandra Kaprekar",
  "nome_curto": "D R Kaprekar",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kaprekar/",
  "data_nascimento": "17 January 1905",
  "local_nascimento": "Dahanu, India",
  "data_morte": "1986",
  "local_morte": "Devlali, India",
  "summary": "D R Kaprekar was a largely self-taught Indian mathematician who worked in in number theory.",
  "biografia": "D R Kaprekar\nwas born in Dahanu, a town on the west coast of India about\n100\nkm north of Mumbai. He was brought up by his father after his mother died when he was eight years old. His father was a clerk who was fascinated by astrology. Although astrology requires no deep mathematics, it does require a considerable ability to calculate with numbers, and Kaprekar's father certainly gave his son a love of calculating.\nKaprekar attended secondary school in Thane\n(\nsometime written Thana\n)\n, which is northeast of Mumbai but so close that it is essentially a suburb. There, as he had from the time he was young, he spent many happy hours solving mathematical puzzles. He began his tertiary studies at Fergusson College in Pune in\n1923\n. There he excelled, winning the\nWrangler\nR P Paranjpe Mathematical Prize in\n1927\n. This prize was awarded for the best original mathematics produced by a student and it is certainly fitting that Kaprekar won this prize as he always showed great originality in the number theoretic questions he thought up. He graduated with a B.Sc. from the College in\n1929\nand in the same year he was appointed as a school teacher of mathematics in Devlali, a town very close to Nashik which is about\n100\nkm due east of Dahanu, the town of his birth. He spent his whole career teaching in Devlali until he retired at the age of\n58\nin\n1962\n.\nThe fascination for numbers which Kaprekar had as a child continued throughout his life. He was a good school teacher, using his own love of numbers to motivate his pupils, and was often invited to speak at local colleges about his unique methods. He realised that he was addicted to number theory and he would say of himself:-\nA drunkard wants to go on drinking wine to remain in that pleasurable state. The same is the case with me in so far as numbers are concerned.\nMany Indian mathematicians laughed at Kaprekar's number theoretic ideas thinking them to be trivial and unimportant. He did manage to publish some of his ideas in low level mathematics journals, but other papers were privately published as pamphlets with inscriptions such as\nPrivately printed, Devlali\nor\nPublished by the author, Khareswada, Devlali, India\n. Kaprekar's name today is well-known and many mathematicians have found themselves intrigued by the ideas about numbers which Kaprekar found so addictive. Let us look at some of the ideas which he introduced.\nPerhaps the best known of Kaprekar's results is the following which relates to the number\n6174\n, today called Kaprekar's constant. One starts with any four-digit number, not all the digits being equal. Suppose we choose\n4637\n(\nwhich is the first four digits of EFR's telephone number!\n)\n. Rearrange the digits to form the largest and smallest numbers with these digits, namely\n7643\nand\n3467\n, and subtract the smaller from the larger to obtain\n4167\n. Continue the process with this number - subtract\n1467\nfrom\n7641\nand we obtain\n6174\n, Kaprekar's constant. Lets try again. Choose\n3743\n(\nwhich is the last four digits of EFR's telephone number!\n)\n.\n7433\n-\n3347\n=\n4086\n8640\n-\n0468\n=\n8172\n8721\n-\n1278\n=\n7443\n7443\n-\n3447\n=\n3996\n9963\n-\n3699\n=\n6264\n6642\n-\n2466\n=\n4176\n7641\n-\n1467\n=\n6174\nAgain we have obtained Kaprekar's constant. In fact applying Kaprekar's process to almost any four-digit number will result in\n6174\nafter at most\n7\nsteps\n(\nso our last example was one where the process has maximal length\n)\n. This was first discovered by Kaprekar in\n1946\nand he announced it at the Madras Mathematical Conference in\n1949\n. He published the result in the paper\nProblems involving reversal of digits\nin\nScripta Mathematica\nin\n1953\n. Clearly starting with\n1111\nwill yield\n0\nfrom Kaprekar's process. In fact the Kaprekar process will yield either\n0\nor\n6174\n. Exactly\n77\nfour digit numbers stabilize to\n0\nunder the Kaprekar process, the remainder will stabilize to\n6174\n. Anyone interested could experiment with numbers with more than\n4\ndigits and see if they stabilise to a single number\n(\nother than\n0)\n.\nWhat about other properties of digits which Kaprekar investigated? A Kaprekar number\nn\nn\nn\nis such that\nn\n2\nn^{2}\nn\n2\ncan be split into two so that the two parts sum to\nn\nn\nn\n. For example\n70\n3\n2\n=\n494209\n703^{2} = 494209\n7\n0\n3\n2\n=\n4\n9\n4\n2\n0\n9\n. But\n494\n+\n209\n=\n703\n. Notice that when the square is split we can start the right-hand most part with\n0\ns. For example\n999\n9\n2\n=\n99980001.\nB\nu\nt\n9998\n+\n0001\n=\n9999.\n9999^{2} = 99980001. But 9998 + 0001 = 9999.\n9\n9\n9\n9\n2\n=\n9\n9\n9\n8\n0\n0\n0\n1\n.\nB\nu\nt\n9\n9\n9\n8\n+\n0\n0\n0\n1\n=\n9\n9\n9\n9\n.\nOf course from this observation we see that there are infinitely many Kaprekar numbers\n(\ncertainly\n9\n,\n99\n,\n999\n,\n9999\n, ... are all Kaprekar numbers\n)\n. The first few Kaprekar numbers are:\n1\n,\n9\n,\n45\n,\n55\n,\n99\n,\n297\n,\n703\n,\n999\n,\n2223\n,\n2728\n,\n4879\n,\n4950\n,\n5050\n,\n5292\n,\n7272\n,\n7777\n,\n9999\n,\n17344\n,\n22222\n,\n38962\n,\n77778\n,\n82656\n,\n95121\n,\n99999\n,\n142857\n,\n148149\n,\n181819\n,\n187110\n,\n208495\n, ...\nIt was shown in\n2000\nthat Kaprekar numbers are in  one-one correspondence with the unitary divisors of\n1\n0\nn\n−\n1\n10^{n} - 1\n1\n0\nn\n−\n1\n(\nx\nx\nx\nis a unitary divisor of\nz\nz\nz\nif\nz\n=\nx\ny\nz = xy\nz\n=\nx\ny\nwhere\nx\nx\nx\nand\ny\ny\ny\nare coprime\n)\n. Of course we have looked at Kaprekar numbers to base\n10\n. The same concept is equally interesting for other bases. A paper by Kaprekar describing properties of these numbers is\n[\n3\n]\n.\nNext we describe Kaprekar's 'self-numbers' or 'Swayambhu'\n(\nsee\n[\n5\n]\n)\n. First we need to describe what Kaprekar called 'Digitadition'. Start with a number, say\n23\n. The sum of its digits are\n5\nwhich we add to\n23\nto obtain\n28\n. Again add\n2\nand\n8\nto get\n10\nwhich we add to\n28\nto get\n38\n. Continuing gives the sequence\n23\n,\n28\n,\n38\n,\n49\n,\n62\n,\n70\n, ...\nThese are all generated by\n23\n. But is\n23\ngenerated by a smaller number? Yes,\n16\ngenerates\n23\n. In fact the sequence we looked at really starts at\n1\n1\n,\n2\n,\n4\n,\n8\n,\n16\n,\n23\n,\n28\n,\n38\n,\n49\n,\n62\n,\n70\n, ...\nTry starting with\n29\n. Then we get\n29\n,\n40\n,\n44\n,\n52\n,\n59\n,\n73\n, ...\nBut\n29\nis generated by\n19\n, which in turn is generated by\n14\n, which is generated by\n7\n. However, nothing generates\n7\n- it is a self-number. The self-numbers are\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n20\n,\n31\n,\n42\n,\n53\n,\n64\n,\n75\n,\n86\n,\n97\n,\n108\n,\n110\n,\n121\n,\n132\n,\n143\n,\n154\n,\n165\n,\n176\n,\n187\n,\n198\n,\n209\n,\n211\n,\n222\n,\n233\n,\n244\n,\n255\n,\n266\n,\n277\n,\n288\n,\n299\n,\n310\n,\n312\n,\n323\n,\n334\n,\n345\n, ...\nNow Kaprekar makes other remarks about self-numbers in\n[\n5\n]\n. For example he notes that certain numbers are generated by more than a single number - these he calls junction numbers. He points outs that\n101\nis a junction number since it is generated by\n100\nand by\n91\n. He remarks that numbers exist with more than\n2\ngenerators. The possible digitadition series are separated into three types: type A has all is members coprime to\n3\n; type B has all is members divisible by\n3\nbut not by\n9\n; C has all is members divisible by\n9\n. Kaprekar notes that if x and y are of the same type\n(\nthat is, each prime to\n3\n, or each divisible by\n3\nbut not\n9\n, or each divisible by\n9)\nthen their digitadition series coincide after a certain point. He conjectured that a digitadition series cannot contain more than\n4\nconsecutive primes.\nReferences\n[\n4\n]\nand\n[\n6\n]\nlook at 'Demlo numbers'. We will not give the definition of these numbers but we note that the name comes from the station where he was changing trains on the Bombay to Thane line in\n1923\nwhen he had the idea to study numbers of that type.\nFor the final type of numbers which we will consider that were examined by Kaprekar we look at Harshad numbers\n(\nfrom the Sanskrit meaning \"great joy\"\n)\n. These are numbers divisible by the sum of their digits. So\n1\n,\n2\n, ...,\n9\nmust be Harshad numbers, and the next ones are\n10\n,\n12\n,\n18\n,\n20\n,\n21\n,\n24\n,\n27\n,\n30\n,\n36\n,\n40\n,\n42\n,\n45\n,\n48\n,\n50\n,\n54\n,\n60\n,\n63\n,\n70\n,\n72\n,\n80\n,\n81\n,\n84\n,\n90\n,\n100\n,\n102\n,\n108\n,\n110\n,\n111\n,\n112\n,\n114\n,\n117\n,\n120\n,\n126\n,\n132\n,\n133\n,\n135\n,\n140\n,\n144\n,\n150\n,\n152\n,\n153\n,\n156\n,\n162\n,\n171\n,\n180\n,\n190\n,\n192\n,\n195\n,\n198\n,\n200\n, ...\nIt will be noticed that\n80\n,\n81\nare a pair of consecutive numbers which are both Harshad, while\n110\n,\n111\n,\n112\nare three consecutive numbers all Harshad. It was proved in\n1994\nthat no\n21\nconsecutive numbers can all be Harshad numbers. It is possible to have\n20\nconsecutive Harshad numbers but one has to go to numbers greater than\n1\n0\n44363342786\n10^{44363342786}\n1\n0\n4\n4\n3\n6\n3\n3\n4\n2\n7\n8\n6\nbefore such a sequence is found. One further intriguing property is that\n2\n!,\n3\n!,\n4\n!,\n5\n!, ... are all Harshad numbers. One would be tempted to conjecture that\nn\n!\nn!\nn\n!\nis a Harshad number for every\nn\nn\nn\n- this however would be incorrect. The smallest factorial which is not a Harshad number is\n432\n!.\nThe self-numbers which are also Harshad numbers are:\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n20\n,\n42\n,\n108\n,\n110\n,\n132\n,\n198\n,\n209\n,\n222\n,\n266\n,\n288\n,\n312\n,\n378\n,\n400\n,\n468\n,\n512\n,\n558\n,\n648\n,\n738\n,\n782\n,\n804\n,\n828\n,\n918\n,\n1032\n,\n1098\n,\n1122\n,\n1188\n,\n1212\n,\n1278\n,\n1300\n,\n1368\n,\n1458\n,\n1526\n,\n1548\n,\n1638\n,\n1704\n,\n1728\n,\n1818\n,\n1974\n,\n2007\n,\n2022\n,\n2088\n,\n2112\n,\n2156\n,\n2178\n, ...\nNote that\n2007\n(\nthe year in which this article was written\n)\nis both a self-numbers and a Harshad number.\nHarshad numbers for bases other than\n10\nare also interesting and we can ask whether any number is a Harshad number for every base. The are only four such numbers\n1\n,\n2\n,\n4\n, and\n6\n.\nWe have taken quite a while to look at a selection of different properties of numbers investigated by Kaprekar. Let us finally give a few more biographical details. We explained above that he retired at the age of\n58\nin\n1962\n. Sadly his wife died in\n1966\nand after this he found that his pension was insufficient to allow him to live. One has to understand that this was despite the fact that Kaprekar lived in the cheapest possible way, being only interested in spending his waking hours experimenting with numbers. He was forced to give private tuition in mathematics and science to make enough money to survive.\nWe have seen how Kaprekar invented different number properties throughout his life. He was not well known, however, despite many of his papers being reviewed in\nMathematical Reviews\n. International fame only came in\n1975\nwhen Martin Gardener wrote about Kaprekar and his numbers in his 'Mathematical Games' column in the March issue of\nScientific American\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}