{
  "nome_completo": "David George Kendall",
  "nome_curto": "David Kendall",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kendall/",
  "data_nascimento": "15 January 1918",
  "local_nascimento": "Ripon, Yorkshire, England",
  "data_morte": "23 October 2007",
  "local_morte": "Cambridge, England",
  "summary": "David Kendall was a leading world authority on applied probability and data analysis.",
  "biografia": "David Kendall\nattended Ripon Grammar School and then entered Queen's College, Oxford. He was awarded his M.A. in\n1943\nbut he had already been involved in war work. During the years of World War II Kendall worked as an Experimental Officer with the Ministry of Supply from\n1940\nuntil the end of the war in\n1945\n. Other mathematicians such as\nRogers\nalso held similar posts with the Ministry of Supply.\nIn\n1946\nKendall was elected a fellow of Magdalen College, Oxford and appointed a lecturer in mathematics. He spent the academic year\n1952\n-\n53\nin the United States as a visiting lecturer at Princeton University. Then in\n1962\nKendall was appointed as Professor of Mathematical Statistics at the University of Cambridge. At the same time he was elected a fellow of Churchill College Cambridge. Kendall held this chair of mathematical statistics until he retired in\n1985\nand which time he became professor emeritus. He also became an Emeritus Fellow of Magdalen College, Oxford in\n1989\n.\nKendall is a leading world authority on applied\nprobability\nand data analysis. He has written on stochastic geometry and its applications, and the statistical theory of shape. His recent work includes two articles\nHow to look at objects in a five-dimensional shape space\n(1994\n-\n95)\nand\nThe Riemannian structure of Euclidean shape spaces: a novel environment for statistics\n(1993)\n.\nHe has received many honours and awards for his outstanding work in these areas of mathematical statistics including the Guy Medal in Silver of the\nRoyal Statistical Society\nin\n1955\nand the Gold Medal of the\nRoyal Statistical Society\nin\n1981\n. He was also awarded the\nWeldon\nMemorial Prize and Medal for Biometric Science from Oxford University in\n1974\nand Princeton University awarded him their\nWilks\nPrize in\n1980\n.\nAn exceptional lecturer, Kendall has been the\nLarmor\nLecturer at the Cambridge Philosophical Society in\n1980\n, the\nMilne\nLecturer at Wadham College, Oxford in\n1983\n, the Hoteling Lecturer at the University of North Carolina in\n1985\n, the Rietz Lecturer at the Institute of Mathematical Statistics in\n1989\nand the\nKolmogorov\nLecturer at the\nBernoulli\nSociety for Mathematical Statistics and Probability in\n1990\n.\nIn\n1964\n, Kendall was elected a fellow of the\nRoyal Society of London\nand served on the Council of that Society during\n1967\n-\n69\nand then for a second spell during\n1982\n-\n83\n. The\nRoyal Society\nawarded Kendall their\nSylvester\nMedal in\n1976\n. He was the\n56\nth\npresident of the\nLondon Mathematical Society\nduring\n1972\n-\n74\nand the\nLondon Mathematical Society\nawarded him their\nWhitehead\nPrize in\n1980\nand their\nDe Morgan\nMedal in\n1989\n.\nHowever it is not only the\nLondon Mathematical Society\nthat has elected Kendall to be their president. He has also been president of the\nBernoulli\nSociety for Mathematical Statistics and Probability in\n1975\nand of the Mathematics and Physics Sections of the\nBritish Association\nin\n1982\n. He has also received a number of honorary degrees to mark his outstanding contributions to statistics. For example he was elected an honorary member of the\nRomanian Academy of Sciences\nin\n1992\nand has received honorary degrees from the University of Paris René Descartes\n(1976)\nand the University of Bath\n(1986)\n.\nKendall has been joint editor of a number of important works, including\nMathematics in the Archaeological and Historical Sciences\n(1971)\n,\nStochastic Analysis\n(1973)\n,\nStochastic Geometry\n(1974)\n,\nAnalytic and Geometric Stochastics\n(1986)\n.",
  "matematicos_citados_na_biografia": [
    "Rogers",
    "probability",
    "Royal Statistical Society",
    "Weldon",
    "Wilks",
    "Larmor",
    "Milne",
    "Kolmogorov",
    "Bernoulli",
    "Royal Society of London",
    "Royal Society",
    "Sylvester",
    "London Mathematical Society",
    "Whitehead",
    "De Morgan",
    "British Association",
    "Romanian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}