{
  "nome_completo": "David Rees",
  "nome_curto": "David Rees",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rees_David/",
  "data_nascimento": "29 May 1918",
  "local_nascimento": "Abergavenny, Monmouthshire, Wales",
  "data_morte": "16 August 2013",
  "local_morte": "Exeter, England",
  "summary": "David Rees was a Welsh mathematician who worked on semigroups and on commutatiive algebra. During World War II he worked on cracking codes.",
  "biografia": "David Rees\n's parents were David Rees, a corn merchant, and Florence Gertrude Powell, who was always called Gertie. The Rees family had a traditional love of mathematics, and in fact David Rees's great-great-grandfather, Thomas Rees, was an early Welsh mathematician. David, the subject of this biography, was the the fourth of a family consisting of Thomas, Doris, Hilda, David and Kathleen. Together with two of his siblings he did mathematics at home for fun. He was educated at King Henry VIII grammar school in Abergavenny but poor health meant that he missed several months of schooling. Acute tonsillitis saw him confined to bed but this did not stop him learning mathematics for his mother went to the public library, armed with a list from her son, to borrow all the mathematics books she could find.\nRees completed his schooling in\n1936\nand when he was in his final year at King Henry VIII grammar school he won a scholarship to study mathematics at Sidney Sussex College, Cambridge. His undergraduate studies were supervised by Gordon Welchman\n(1906\n-\n1985)\n, a fellow of Sidney Sussex College, and Rees graduated in\n1939\nas Second\nWrangler\n. This means that he was awarded a First Class Degree and ranked second in the list. The First Wrangler in that year was\nHermann Bondi\n. Rees continued to study at Cambridge but, on\n1\nSeptember\n1939\n, German troops invaded Poland and Britain declared war on Germany two days later. The outbreak of war caused a complete disruption in Rees's university studies since he was quickly recruited to undertake war work at Bletchley Park, the British codebreaking centre in Buckinghamshire.\nThe Government Code and Cypher School had been set up following World War I and, when it looked as though war might become inevitable, the possibility of moving it to Bletchley Park was tested in September\n1938\n. During World War I decoding had been done by expert linguists but the Poles had made studies of the German Enigma machines and realised that mathematicians would be required to break these codes. The Government Code and Cypher School recruited Peter Twinn\n(1916\n-\n2004)\nin early\n1939\n, a mathematics graduate from Oxford who was undertaking physics research, followed by\nAlan Turing\n, and soon after this they were joined by Gordon Welchman. This took place before the outbreak of war while Rees was beginning his research career at Cambridge. There he attended a series of lectures by\nPhilip Hall\non semigroups and these lectures inspired him to produce deep results in this area. These first results appeared in the papers\nOn semi-groups\n(1940)\nand\nNote on semi-groups\n(1941)\n. They contain the concept known today as a Rees matrix semigroup which Rees defines and uses to classify completely\n0\n-simple semigroups. Mark Lawson writes\n[\n3\n]\n:-\nThis theorem is the first that any beginning student of semigroup theory meets and is one of the most influential results in the field.\nMeanwhile Welchman had been put in charge of Hut\n6\nat Bletchley Park which was responsible for breaking German Army and Air Force Enigma ciphers. He recruited mathematicians from the undergraduates and colleagues at Cambridge that he had known. He went to Rees and said\n[\n6\n]\n:-\nWe want you to go to this top-secret place to carry out vital work for the war effort but we are not going to tell you where it is.\nRees was happy to undertake this war work but replied:-\nFine, but if you are not going to tell me where it is, how am I going to find it?\nThis problem was quickly surmounted and Rees put his mathematical research on hold while he worked at Bletchley Park. Welchman had quickly realised that to make progress in deciphering messages they had to give up the idea of trying to decode individual messages and, instead, they had to examine the German communication network as a whole. They looked therefore at whole range of messages produced each day realising that a large amount of information about the German forces could be deduced without actually being able to decipher the individual messages. The way that the Enigma machines were set up each day by their German operators was that after being instructed which rotors and settings to use each day, they would select their own initial position for each rotor and send this as a three-letter indicator as the initial segment of their first message.\nJohn W Herivel\n(1918\n-\n2011)\n, like Rees, had been an undergraduate at Cambridge. He had been awarded a Kitchener Scholarship to study mathematics at Sidney Sussex College in\n1937\nand had also been tutored by Welchman. Herivel, who worked with Rees in Hut\n6\n, made the suggestion in February\n1940\nthat if the operators were lazy they might not move the rotors far from their position at the end of the last message sent on the previous day. If this were true, starting positions would all cluster round the last setting of the previous day and the code breakers in Hut\n6\nlooked to see if they could spot such clusters. They were trying to break what they called the 'Red' Enigma cipher, the one which was most significant since it was used by Luftwaffe officers communicating with the ground troops. At first no clustering was found but for several months they kept looking for this. Herivel said\n[\n5\n]\n:-\nRees was working on his own on the night shift in the Machine Room\n[\non the night of\n22\nMay\n1940\ntwelve days after Germany invaded France\n]\n, and noticed that among the many Enigma messages\n[\nsent on\n20\nMay\n]\nthere were several that were very close together. So he tried out various possibilities, and as the day shift came in he finally managed to break into the Red.\nThe deputy head of Hut\n6\nwas Stuart Milner-Barry\n(1906\n-\n1995)\n. He was not a mathematician but a Cambridge graduate in classics and moral sciences. He had been recruited by Welchman since he was one of the best chess players in Britain. Milner-Barry later spoke of the moment when Rees made the breakthrough\n[\n5\n]\n:-\nI can remember most vividly the roars of excitement, the standing on chairs and the waving of order papers which greeted the first breaking of Red by hand in the middle of the Battle of France. This first break into the Red was the greatest event of all because it was not only, in effect, a new key, which is always exciting, but because we did not then know whether our number was up altogether or not.\nThis was one of the most significant breakthroughs in cracking the Enigma codes, although Rees later said that,\n40\nyears after the event, he did not remember being the one to make the breakthrough.\nRees was seconded to the Enigma Research Section in late\n1941\nto help with the task of decoding the Abwehr Enigma code used by the German secret service. He was part of the team which cracked this code several months later.\nTuring\nhad designed an early computer called a \"bombe\" to help with the task of decoding Enigma messages.\nMax Newman\njoined the team at Bletchley Park in\n1942\nand he headed a section called the \"Newmanry\" which worked on the Colossus, a more advanced electronic computer. Rees joined the \"Newmanry\" where the Colossus reduced the time taken to decode a message from days to hours. He became friends with\nSandy Green\nwho also worked at the \"Newmanry\"; they later wrote a joint paper on semigroups. The work of these dedicated people at Bletchley Park played an enormously important role in shortening the duration of the war and, as a consequence, they saved many thousands of lives. Of course, their work was top secret and for many years nobody knew anything about their remarkable contributions to the war effort. Perhaps the fact that, shortly after the war ended, a team from Bletchley Park defeated the University of Oxford in a chess match, might have provided a clue that something rather special had been happening at Bletchley. Rees, who was a very fine chess player, was a member of the winning team.\nAt the end of the War,\nNewman\nwas appointed Fielden Professor of Mathematics at Manchester. Rees was appointed as an assistant lecturer in mathematics at the University of Manchester at the same time and assisted\nNewman\nin the pioneering work that led to the construction of the first mainframe computer. Rees was appointed as a lecturer at the University of Cambridge in\n1948\n, becoming a fellow of Downing College.\nDouglas Northcott\n, who had become interested in algebra while attending\nEmil Artin\nand\nClaude Chevalley\n's seminar in Princeton in\n1946\n-\n47\n, organised a seminar at Cambridge to study\nAndré Weil\n's book\nThe Foundations of Algebraic Geometry\n(1946)\n. This seminar had two major impacts on Rees's life. Firstly it gave him a love of commutative ring theory, a topic that he undertook research on for the rest of his life. Secondly, through\nNorthcott\n's seminar, he met another of the participants, the young mathematician Joan Sybil Cushen\n(25\nAugust\n1924\nto August\n2013)\nwho had written her thesis on\nalgebraic geometry\n(\n\"before\nGrothendieck\ngot his hands on it\" as she described it\n)\nin\n1951\nin London and returned to Cambridge to teach at Girton College.\nRees married Joan Cushen  in Cambridge on\n19\nth\nJune\n1952\n.  Joan Rees became a Lecturer in Mathematics at the University of Exeter. David and Joan Rees had four daughters:\n(\nSusan\n)\nMary Rees\n(\nborn September\n1953)\n, Rebecca Rees\n(\nborn December\n1955)\n, Sarah Elizabeth Rees\n(\nborn December\n1957)\n, and Deborah Rees\n(\nborn June\n1960)\n. Both Mary and Sarah became professors of mathematics; Mary at the University of Liverpool and Sarah at the University of Newcastle.\nBefore moving into the area of commutative ring theory, Rees had published two further papers on semigroups,\nOn the group of a set of partial transformations\n(1947)\nand\nOn the ideal structure of a semi-group satisfying a cancellation law\n(1948)\n. The first of these two papers is a major contribution to inverse semigroup theory, although the notion of an inverse semigroup had not been formalised at this time. Let us quote Mark Lawson concerning the second of these papers\n[\n3\n]\n:-\nTo understand the significance of this paper, it is worth bearing in mind that the most interesting question relating to cancellative monoids before then was whether they could be embedded in groups or not. This paper is treating cancellative monoids in their own right rather than as things to be embedded in groups. The key concept of the paper is that of uniformity and is a very early use of the notion of self-similarity in algebra; it may well be the first. Today, self-similarity is everywhere thanks to fractals but then it must have been much less well-known.\nRees then wrote two papers on non-associative algebras,\nLinear systems of algebras\n(1950)\nand\nThe nuclei of non-associative division algebras\n(1950)\nfollowed by his final semigroup paper\n(\nwritten in collaboration with\nSandy Green\n)\nOn semi-groups in which x\nr\n= x\n(1952)\n. In the first of these, written while he was still at Manchester, Rees writes:-\nI wish to express my indebtedness to Drs\nGraham Higman\nand\nWalter Ledermann\nfor many helpful suggestions in the preparation of this paper and for the considerable trouble they took in reading the final draft of the manuscript.\nThe influence of\nDouglas Northcott\non Rees is easily seen since his first two papers on commutative rings are written in collaboration with him, namely\nReductions of ideals in local rings\n(1954)\nand\nA note on reductions of ideals with an application to the generalized Hilbert function\n(1954)\n. In the first of these Rees and\nNorthcott\n[\n1\n]\n:-\n... introduced the concept of reduction of an ideal in a local ring.  Even in this\n21\nst  century, hardly a conference on commutative algebra passes without several mentions of reductions of ideals.\nOver the next years, Rees continued to produce a whole series of important papers on local rings. In particular he studied valuations associated with local rings and ideals, and made important contributions to the grade of an ideal. However, he left Cambridge in\n1958\nwhen he was appointed to the chair of Pure Mathematics at the University of Exeter. He served this university not only as head of pure mathematics but also Dean of Science and as deputy Vice-Chancellor. His administrative duties reduced, very markedly, the time he had available for mathematical research. However, after he retired in\n1983\n, his research activity increased greatly. For example, he only published two papers between\n1961\nand\n1978\n, but published seven papers between\n1985\nand\n1988\n.\nIn\n1982\nRees lectured at Nagoya University in Japan, giving a course 'The asymptotic theory of ideals' during the winter of\n1982\n-\n83\n. Rees produced duplicated lecture notes for those attending the course and copies were in circulation for several years. They formed the basis for the book\nLectures on the asymptotic theory of ideals\n(1988)\n. Stephen J McAdam, reviewing the book, begins with the following paragraph on the position of commutative ring theory and Rees's contribution to the subject\n[\n4\n]\n:-\nCommutative ring theory was born in the early part of this century, a child of\nEmmy Noether\nand\nWolfgang Krull\n(\nDavid Hilbert\nfilling in as grandpa\n)\n. It grew up on a tough block, living between algebraic number theory and algebraic geometry. Those two have always been bigger and brasher, and maybe tried to bully it a bit. Yet our hero held its ground, gracefully accepting the fact that it would probably never win the accolades afforded its more notorious companions, and secure in the knowledge that its elegance often encompassed surprising depth. The child quickly learned to be idealistic, although due to its mother's influence, most of its ideals are finitely generated. When it reached young adulthood, it accepted the guidance of some loving uncles, among them\nSamuel\nand\nNagata\n. Yet it is another uncle who most concerns us here, a man who might have been chosen for the part by central casting, he so well fits the role. Over the last thirty-five years, few people could hope to rival the influence which David Rees has had in commutative ring theory.\nMcAdam goes on the describe the book\n[\n4\n]\n:-\nIt is appropriate that this book appears at the time of Rees's retirement, for it is, to a large extent, a book of memories. However, while many of the basic ideas are old, they are generalized from dealing with powers of an ideal, to dealing with Noetherian filtrations. Also, some of the proofs are new. Furthermore the final chapters on a generalized degree formula for mixed multiplicities contain some new material. Reflecting its birth as a series of lectures ..., the text has a chatty style ...\nLouis J Ratliff Jr, reviewing the same book, writes:-\nThis is a delightful, nearly self-contained book that gives a crisp and clear introduction to the asymptotic theory of ideals.\nMany concepts are named after Rees which is a good indication of Rees's very significant influence on different areas of algebra. For example: the\nArtin\n-Rees lemma; Rees quotients; Rees-Sushkevich varieties; Rees algebras; Rees valuations; Rees polynomials; and Rees modules. Rees received many honours for his outstanding contributions. He was elected to the\nRoyal Society of London\nin\n1968\n, and served on its council from\n1979\nto\n1981\n. The\nLondon Mathematical Society\nawarded him their\nPolya\nPrize in\n1993\n. Conferences were organised to celebrate his\n70\nth\nbirthday and 'Commutative Algebra in Honour of David Rees's\n80\nth\nYear' was held in Exeter in August\n1998\n.\nLet us give a quote that tells us something of Rees's character\n[\n6\n]\n:-\nRees was an intensely shy, modest man who didn't indulge in small talk.\n[\nHe\n]\nwas never happier than when sitting in front of the television scribbling down algebraic equations to find a solution to some mathematical challenge he had set himself. He was not a practical man; he never got the hang of the washing machine or carving a joint of meat and found the period of having four teenage daughters at once rather terrifying.\nDavid and Joan Rees built up a rather remarkable mathematical library which they kept in their Exeter home. However, eventually, both David and Joan moved into a care home in Exeter and they disposed of their mathematical library. Their daughters Mary and Sarah made the following announcement in April\n2012\n:-\nDavid and Joan Rees ... are both reasonably well, but have moved out of the family home in Exeter into more suitable accommodation. The house will be sold in the summer and we have produced a rough catalogue of the mathematics books. As a family, we would like as many as possible of these books to be passed on personally to people who are interested in them. In time the collection covers about a hundred years: from the early twentieth to the early twenty-first century. So from the point of view of mathematical history, it is an interesting collection.\nDavid Rees died peacefully in hospital in Exeter aged\n95\n. Twelve days later, his wife Joan passed away peacefully in The Old Rectory aged\n89\nyears.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Hermann Bondi",
    "Alan Turing",
    "Philip Hall",
    "Turing",
    "Max Newman",
    "Sandy Green",
    "Newman",
    "Douglas Northcott",
    "Emil Artin",
    "Claude Chevalley",
    "André Weil",
    "Northcott",
    "algebraic geometry",
    "Grothendieck",
    "Graham Higman",
    "Walter Ledermann",
    "Emmy Noether",
    "Wolfgang Krull",
    "David Hilbert",
    "Samuel",
    "Nagata",
    "Artin",
    "Royal Society of London",
    "London Mathematical Society",
    "Polya"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}