{
  "nome_completo": "David Tweedie",
  "nome_curto": "David Tweedie",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tweedie_David/",
  "data_nascimento": "20 April 1865",
  "local_nascimento": "Swinton School House, Swinton, Berwickshire, Scotland",
  "data_morte": "22 March 1934",
  "local_morte": "Edinburgh, Scotland",
  "summary": "David Tweedie graduated from Edinburgh University and taught at George Watson's College in Edinburgh. He spent more than 30 years teaching in various institutions in Egypt.",
  "biografia": "David Tweedie\n's father was  George Tweedie\n(\nborn in Cleish, Kinross in\n1837\n; died in\n1905)\nwho was a schoolmaster, inspector of the poor and registrar. His mother was  Charlotte Lugton\n(\nborn in Duns, Berwickshire in\n1836\n; died in\n1909)\n. He was the oldest of his parents' nine children having younger siblings: Annie\n(\nborn\n1866)\n, Charles\n(\nborn\n1868)\n, Euphemia\n(\nborn\n1870)\n, George\n(\nborn\n1872)\n, Andrew\n(\nborn\n1873)\n, Charlotte\n(\nborn\n1875)\n, William\n(\nborn\n1877)\n, and Jessie\n(\nborn\n1879)\n.\nDavid Tweedie attended Swinton Parish School from\n1869\nto\n1879\n, then George Watson's School in Edinburgh for the two years\n1879\n-\n1881\n. He first matriculated at the University of Edinburgh in\n1881\nat the age of sixteen years.\nTweedie graduated from the University of Edinburgh in\n1886\nwith an M.A. with First Class Honours in Mathematics. He then continued to study there in the Faculty of Medicine for a B.Sc.\n(\nMath\n)\nwhich he was awarded in\n1887\n. He became a Mathematics Master at George Watson's College, Edinburgh. In March\n1892\nTweedie joined the Edinburgh Mathematical Society. He played a major role in the Society and was Honorary Treasurer from\n1895\nto\n1898\n. He continued to be a member of the Society, but his administrative role had to come to an end in\n1898\nsince he went to Egypt to work at the Ras-el-Tin Government School in Alexandria. Gamal Abdel Nasser, who went on to become President of Egypt, received his secondary education at this school around\n30\nyears later. Tweedie moved to the Government College in Cairo, then in\n1904\nto the Ministry of Public Instruction in Cairo.\nTweedie married Elizabeth Mary Inglis\n(\nborn in Dublin, Ireland in\n1871\n; died in\n1931)\non\n9\nAugust\n1905\nin Kildare, Ireland. They had two children, Rose\n(\nborn in Cairo, Egypt in\n1906)\nand George\n(\nborn in\n1907)\n. After Elizabeth died in\n1931\n, David Tweedie married Gladys Emily Jones in Edinburgh on\n28\nMarch\n1933\n.\nAfter being appointed as Lecturer in Mathematics at the Royal School of Engineering, Cairo in\n1915\n, Tweedie worked there until\n1923\n. In\n1905\n, the new buildings of the \"Royal School of Engineering\" bordering Giza Zoo and facing Orman Park, were completed. The Royal School of Engineering moved to this location in\n1905\nand this is where Tweedie taught. In October\n1908\n, study had been divided into two departments for Irrigation and Architecture with specialization in the final two years. However, in\n1916\nduring the time Tweedie lectured there, the school started to offer specialized studies in the final two years in five departments: Irrigation, Architecture, Municipal, Mechanical and Electrical Engineering.\nHere is a description of what lecturing in mathematics at the Royal School of Engineering, Cairo, was like at that time. It is taken from a review of a book by J I Craig who was also a mathematics lecturer there in the\n1920\ns:-\n[\nThe lecturer\n]\nhas to lecture to large classes, composed of students of very varying degrees of attainment. He has ... to satisfy \"the intrepid explorer, the average wayfarer, and the patient plodder\". Furthermore, he has ... to provide for students of mathematics who take the science as a branch of a liberal education, and others who learn the subject for use in their professions.\nIn\n1932\nTweedie moved to Llanwern, Newport, Monmouthshire.",
  "matematicos_citados_na_biografia": [],
  "imagens": []
}