{
  "nome_completo": "David Breyer Singmaster",
  "nome_curto": "David Singmaster",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Singmaster/",
  "data_nascimento": "14 December 1938",
  "local_nascimento": "Ferguson, St Louis, Missouri, USA",
  "data_morte": "13 February 2023",
  "local_morte": "London, England",
  "summary": "David Singmaster was an American mathematician who worked for most of his career in London, England. He was a leading expert on puzzles and recreational mathematics, and is particularly famed for his books on Rubik's Cube.",
  "biografia": "David Singmaster\nwas the son of James Arthur Singmaster\n(1908\n-\n1999)\n, born on\n7\nApril\n1908\nin Palmerton, Carbon, Pennsylvania, USA, and Marjorie Lowe Breyer\n(1910\n-\n1984)\n, born\n18\nOctober\n1910\nin Palmerton, Carbon, Pennsylvania, USA. James Singmaster received a bachelor's degree in chemistry from Williams College, Massachusetts in\n1929\n, and obtained an MBA from Harvard Business School in\n1931\n. He first worked for Mallinckrodt Chemical Company in Missouri and then moved to Bainbridge, Chenango, New York in\n1941\nto run the Borden Chemical Plant. Marjorie Breyer was a member of Phi Beta Kappa from Wellesley College, a private women's liberal arts college in Wellesley, Massachusetts.\nJames Singmaster married Marjorie Breyer on\n28\nNovember\n1931\nin Bronxville; they had four children, James A Singmaster III\n(\nage\n15\nat the\n1950\ncensus\n)\n, David B Singmaster\n(\nage\n11\nat the\n1950\ncensus\n)\n, the subject of this biography, Allan L Singmaster\n(\nage\n8\nat the\n1950\ncensus\n)\n, and Karen H Singmaster\n(\nless than a year old at the\n1950\ncensus\n)\n. Allan and Karen were born in Bainbridge, New York. Let us note at this point that David's older brother James went on to earn a Ph.D. from the University of California, while his younger sibling Allan was awarded an AB from Lehigh University and Karen attended Bennington College in Vermont.\nDavid Singmaster was brought up in Bainbridge, New York where he attended school. His father joined the Monsanto Chemical Company, initially as the organic sales representative for New York state, and eventually became the assistant to the vice-president of sales and marketing. He became a prominent citizen of Bainbridge, involved in many charities and serving on the Bainbridge Guilford school board. David's time at High School involved more than academic achievement. He wrote in February\n1958\n[\n4\n]\n:-\n[\nI was\n]\nAssistant Treasurer of my High School General Organization which had a yearly budget of $\n25\n,\n000\n... My duties included keeping books ... making monthly and quarterly reports and reconciling bank statements.\nIn\n1956\nSingmaster began his studies at the California Institute of Technology. He said\n[\n21\n]\n:-\nWhen I was at CALTEC I went there thinking I wanted to be a civil engineer and then I thought I wanted to be an organic chemist - I loved all those formulae for organic molecules.\nCALTEC has a house system and Singmaster was in Ricketts House. In\n1957\nhe was elected as a Ricketts House Officer, being one of two Athletic Managers. In February\n1958\nhe stood as a candidate for the position of ASCIT Treasurer. ASCIT is the Associated Students of the California Institute of Technology, the main body of undergraduate student government that complements the house system. He wrote in his statement\n[\n4\n]\n:-\nI feel that I am the best qualified candidate for the office of ASCIT Treasurer. As experience I cite the following: Assistant Treasurer of my High School General Organization which had a yearly budget of $\n25\n,\n000\n, approximately twice that of ASCIT. My duties included keeping books, in a manner similar to those of ASCIT, making monthly and quarterly reports and reconciling bank statements. \"Capitalist\" of Ricketts House, involving businesses grossing $\n2\n,\n500\nyearly, considerably more than a class budget. I feel that I have had probably more experience than any student in the handling of money matters on a large scale.\nThis report come from\nThe California Tech\nwhich lists Singmaster as the paper's Assistant Sports Editor. Despite this involvement in student affairs, Singmaster was not that happy at CALTEC. He described it as\n[\n21\n]\n:-\n... quite a provincial place, in Pasadena which is archetypal provincial America.\nAt the end of his third year at CALTEC he was thrown out for lack of academic ability. He was also caught picking locks! After working for a year, he started a second university career at the University of California, Berkeley in\n1960\n. His intention was to major in physics. He said\n[\n21\n]\n:-\nI found Berkeley much more interesting as you could imagine - this was\n1960\nand there was lots going on. And then I got married and I had an apartment just off Telegraph Avenue.\nSingmaster married Geralda Brighouse in Los Angeles, California on\n20\nDecember\n1960\n. Geralda, born in\n1940\n, was, like Singmaster, a mathematics student at Berkeley.\nUp to this point we have not seen much evidence that Singmaster would end up as a mathematician. He did find theoretical work in physics interesting but was not too keen on physics labs. His route into mathematics was through a housemate who was a friend of John Brillhart\n(1930\n-\n2022)\n. Brillhart was student of the number theorist\nD H Lehmer\nand they were writing a computer program to solve polyomino puzzles. This interested Singmaster who started reading books on number theory and taking more courses with the intention of becoming a joint mathematics-physics major. He took a set theory course given by\nJohn Kelley\n, a number theory course given by\nD H Lehmer\nand an algebra course on groups, rings and fields. He said\n[\n21\n]\n:-\nI thought, why have they been hiding these from us - they should be teaching this in High School.\nD H Lehmer\nposed a problem to his students: In how many ways can a number be written as the sum of consecutive numbers? For example\n9\ncan be written in two ways,\n2\n+\n3\n+\n4\nand\n4\n+\n5\n;\n11\ncan only be written in one way,\n5\n+\n6\n;\n15\ncan be written in three ways,\n1\n+\n2\n+\n3\n+\n4\n+\n5\n,\n4\n+\n5\n+\n6\n, and\n7\n+\n8\n;\n100\ncan be written in two ways,\n18\n+\n19\n+\n20\n+\n21\n+\n22\nand\n9\n+\n10\n+\n11\n+\n12\n+\n13\n+\n14\n+\n15\n+\n16\n. Singmaster showed that the number of ways of writing\nN\nN\nN\nas sum of consecutive positive integers is the number of odd factors of\nN\nN\nN\n(\nexcept\n1)\n. He won the prize of a copy of the textbook for the course which he treasured for the rest of his life.\nAfter Singmaster completed his undergraduate degree,\nD H Lehmer\nstrongly recommended him for graduate work saying that he was the best student in the class. Singmaster's first paper was published soon after he began his graduate studies. It is the paper\n[\n26\n]\n, published in\n1964\n, which begins:-\nSome time ago, the following problem occurred to me: which fits better, a round peg in a square hole or a square peg in a round hole? This can easily be solved once one arrives at the following mathematical formulation of the problem. Which is larger: the ratio of the area of a circle to the area of the circumscribed square or the ratio of the area of a square to the area of the circumscribed circle? One easily finds that the first ratio is\nπ\n4\n\\large\\frac{\\pi}{4}\\normalsize\n4\nπ\n​\nand that the second is\n2\nπ\n\\large\\frac{2}{\\pi}\\normalsize\nπ\n2\n​\n. Since the first is larger, we may conclude that a round peg fits better in a square hole than a square peg fits in a round hole. More recently, it occurred to me that the above question could be easily generalised to n dimensions. The remainder of this paper will be devoted to the following\nTheorem. The n-ball fits better in the n-cube than the n-cube fits in the n-ball if\nand only if n ≤\n8\n.\nSingmaster was an NSF Graduate Fellow, undertook research advised by\nD H Lehmer\nand was awarded a Ph.D. in\n1966\nfor his\n59\n-page thesis\nOn means of differences of consecutive integers relatively prime to m\n. His second paper,\nA Maximal Generalization of Fermat's Theorem\n, was published in\n1966\n. Singmaster and his wife then went to Beirut where he taught at the American University of Beirut. He wrote a joint paper with his wife entitled\nForbidden regions are convex\nwhich was published in\n1967\n. The paper has the Beirut address but contains the following note\n[\n29\n]\n:-\nThe first author\n[\nDavid Singmaster\n]\nwas an NSF Graduate Fellow at the University of California at the time of writing this paper.\nFor a short time Singmaster lived in Cyprus before being appointed in\n1970\nas a lecturer in the Department of Mathematics of the Polytechnic of the South Bank, London, England. This Polytechnic had been founded as the Borough Polytechnic Institute in\n1982\nbut had merged with the City of Westminster College\n(\nfounded in\n1918)\nand two other colleges to become the Polytechnic of the South Bank in\n1970\n. It became the London South Bank University in\n1992\n.\nIn the summer of\n1971\nSingmaster joined an underwater archaeological survey team led by the archaeologist Honor Frost trying to locate a mid-third century BC Marsala Punic Ship off the west coast of Sicily. Singmaster joined the team as the underwater photographer\n[\n31\n]\n:-\n... in\n1971\n[\nthe team\n]\ncontinued their systematic survey across the area. During a line survey on August\n7\nth the team photographer, David Singmaster, went a little off course to retrieve a stray marker, and that's when he discovered a bizarre, recently exposed timber poking out of the sand. Honor went over to investigate ...\n[\nSingmaster\n]\nhad found what\n[\nthe team\n]\nlater determined to be the sternpost of the vessel, recently exposed by the shifting sands, in just\n2\n.\n5\nmetres of water.\nWhile on this archaeological survey, he met Deborah De Vere White. She became his second wife in\n1972\n; they adopted a daughter Jessica in\n1976\n. Deborah had been born in Dublin, Ireland, in\n1942\n.\nBy the time that Singmaster was appointed to the Polytechnic of the South Bank he had become interested in mathematical puzzles in addition to number theory and combinatorics. He was reading and publishing in the\nFibonacci Quarterly\n, for example his\n1970\npaper\nSome counterexamples and problems on linear recurrence relations\nwas the first of several that he published there. By\n1975\nhe was looking at chessboard problems and published the paper\n[\n28\n]\nin the\nMathematics Magazine\n. The paper begins:-\nIn the January,\n1973\n, issue of this magazine, Richard Gibbs has restated the well-known fact that a\n2\nm ×\n2\nm chessboard, with two diagonally opposite corners deleted, cannot be covered by dominoes since the deleted squares are of the same colour. He then asked:\n(\na\n)\nCan a\n2\nm ×\n2\nm board be covered with dominoes if we remove any two squares of opposite colour?\n(\nb\n)\nCan a\n(2\nm +\n1)\n×\n(2\nm +\n1)\nboard be covered if we remove any square of the major\n(\nor corner\n)\ncolour?\nIt is well known and easily seen that an m × n rectangle can be covered with dominoes if and only if m or n is even. This led me to consider Gibbs' problem\n(\na\n)\nfor m ×\n2\nn boards and thence to consider his problem\n(\nb\n)\nfor\n(2\nm +\n1)\n×\n(2\nn +\n1)\nboards. Theorems\n1\nand\n3\nbelow answer these generalised problems affirmatively, except for the case when m =\n1\nin\n(\na\n)\n, in which case a further necessary and sufficient condition for covering is given as Theorem\n2\n.\nIt is not difficult to see that\n(\na\n)\nfails if we delete four squares, but I was rather delighted to find that\n(\nb\n)\nis also true if we remove any three squares, two of the major colour and one of the minor, provided m ≠\n0\nand n ≠\n0\n. This is proven as Theorem\n4\n. The extension of\n(\nb\n)\nto five squares fails.\nWhen Singmaster wrote this paper, he was spending the year\n1972\n-\n1973\nat the Istituto Matematico, Pisa, Italy supported by an Italian National Research Council research fellowship\n[\n17\n]\n:-\nMy wife and I spent a year in Italy, a country that we both love. In Italy there is a law that requires banks to spend\n2\n% of their profits on 'good works', which can be interpreted as publishing facsimiles of medieval manuscripts on mathematics. A few years before we arrived in Tuscany, the Cassa di Risparmio di Firenze published a facsimile of the magnificent illuminated manuscript of Filippo Calandri's 'Trattato di Arithmetica', Florence,\n1491\n. The manuscript is one of the treasures of the Biblioteca Riccardiana in Florence. It contains\n230\nminiatures in gold and silver, some attributed to the workshop of Botticelli, and many depicting recreational problems set against Italian cityscapes. The manuscript was commissioned by Lorenzo the Magnificent for the education of his son, Giuliano de' Medici, the future Pope Leo X. When Italian banks sponsor facsimiles and reprints, they tend to do so in limited numbers for presentation to visiting dignitaries and business associates. It took me thirty years to find my own copy of the Calandri facsimile, which finally turned up in a Florentine bookseller's catalogue.\nSingmaster had been elected to the\nLondon Mathematical Society\non\n15\nOctober\n1970\n, shortly after he arrived in London. In\n1976\nhe was elected as Meetings and Membership Secretary of the Society. It was in this capacity that he attended the International Congress of Mathematicians held in Helsinki\n15\n-\n23\nAugust\n1978\n. At the Congress he saw lots of Hungarian mathematicians playing with what they called the \"Hungarian Magic Cube\", now known as the Rubik Cube. He had dinner with\nJohn Conway\nand\nRoger Penrose\n, two mathematicians who were playing a major role in the Congress.\nJohn Conway\ndelivered the\n45\nminute invited address\nArithmetical operations on transfinite numbers\nto the 'Mathematical logic and foundations of mathematics' Section while\nRoger Penrose\ndelivered the one-hour plenary address\nThe complex geometry of the natural world\n. Both\nConway\nand\nPenrose\nhad worked out how to solve the Magic Cube\n[\n22\n]\n:-\nPenrose\ndid not believe anyone could do it without consulting a pocket full of notes and his coat pocket was full of envelopes with move diagrams written on them. He was amazed to discover that\nConway\ncould do it from memory - it only took him about\n3\n1\n2\n3\\large\\frac{1}{2}\\normalsize\n3\n2\n1\n​\nminutes. Everybody thought this was mind-boggling.\nConway\ngave me suggestions how you could study certain bits - ways you could study part of the structure of the cube - when I had managed to get a cube from one of the Hungarians. The Hungarians had discovered there were no customs regulations on cubes - they could bring them out and use them as worth more than hard currency. They could take Rubik Cubes abroad and trade them for books, even lodgings, etc. After about two weeks I had worked out a method of solving it.\nBack in London, Singmaster asked the Hungarian Embassy to help him get in touch with the inventor of the puzzle. This did not prove successful but soon after he was contacted by a Hungarian importer in London who had been told by the Embassy that Singmaster was interested in having the cubes available for sale in the UK. Sixty cubes were quickly sold to Singmaster's colleagues and he ordered sixty more which again were rapidly sold. He became a major distributor of the cube, set up a shop in London to sell it, and in\n1979\nstarted to write a book explaining the group theory which lay behind solving the cube. The abstract concepts of conjugates and commutators made much more sense, he felt, when one saw how these were fundamental in solving the cube.\nFor information concerning books Singmaster wrote about Rubik's Cube, including extracts from prefaces, reviews and publisher's information, see\nTHIS LINK\n.\nIn autumn\n1981\n, he began publishing\nCubic Circular\nwhich ran to eight issues. In the Spring\n1982\nissue he wrote\n[\n30\n]\n:-\nThe last few months have been very hectic as David Singmaster Ltd. has gotten launched. We had a stand at the London Toy Fair, I went to the Nuremberg Toy Fair and Jane Nankivell went to the Paris Toy Fair. I counted about\n50\nnew puzzles which will appear this year: A report on some of these will occupy most of this issue. There are many other new products which will have to wait for the next Circular. ... We are developing a great range of contacts in the puzzle industry and have begun to act as agents or manufacturers for several inventors. We can either arrange to manufacture on a small scale or pass on ideas to major producers such as Mèffert or Pentangle. At the moment, this is a new area of the business and we are feeling our way ...\nThe Rubik craze was fairly short lived, however, and by the winter of\n1982\nhe was already paying off staff at David Singmaster Ltd. Soon it had to close completely\n[\n30\n]\n:-\nUnfortunately I had a massive overdose of cubism in\n1982\n-\n83\n. David Singmaster Ltd. was closed down, and I lost a fair amount of money - more than I had made previously. This led to prolonged tax negotiations. ... I was teaching several extra courses in\n1983\n-\n84\n, including the geometry course which was being taught for the first time. I also spent a lot of time helping to rewrite a Department submission that had been rejected. I have also started on some other projects which have taken up much of my time. ... Fortunately, I was promoted to a Readership\n(\n= Research Professorship\n)\n, the first in my Faculty, as of September\n1984\nand this is giving me more time to get caught up. ... In a week, I am going to City College of New York for the Autumn term\n[\nof\n1985]\n.\nWe might think it is unusual for a mathematics lecturer to be setting up a company, but given Singmaster's financial activities at High School and at CALTEC which we mentioned above, it is not so surprising.\nSingmaster continued his interest in mathematical puzzles, becoming fascinated not only by the puzzles but increasingly with their history. For example in\n1985\nhe published\nPuzzles from the Greek Anthology\n,\nThe legal values of pi\n,\nSources in recreational mathematics\n, and\nComment on the history of Heronian triangles\n. Much of his work on puzzles over the following thirty years is contained in his book\nProblems for Metagrobologists: A Collection of Puzzles With Real Mathematical, Logical or Scientific Content\n(2016)\nand his impressive two volume\nAdventures in Recreational Mathematics\n(2020)\n.\nFor information about these books see\nTHIS LINK\n.\nHis Rubik Cube activities led to Singmaster becoming well known and he received many letters which he struggled to find time to answer. He also made radio and television appearances as a puzzle expert. He explained in the interview\n[\n13\n]\n:-\nIn November\n1981\n, I was on a\n45\nminute BBC TV show called 'The Adventure Game'. This was a series in which three hapless members of the public are recruited to go to a mythical planet where the inhabitants enjoy playing tricks on visitors. ... Some of the tricks are straightforward - when you turned on the water in the kitchen, the radio came on, so you tried turning on the radio to get water. There is a mole type who tries to mislead us - she asked me to open a wine bottle and gave me a corkscrew. I looked at it and responded: \"Ah, a left-handed corkscrew. I've just bought a bunch of these,\" and proceeded to open the wine. They cut this part out! Anyway, it was good fun trying to solve problems, but it goes so fast that one doesn't even see all the clues.\nIn June\n1998\nto November\n1999\n, I was a frequent panellist on 'Puzzle Panel', a BBC Radio Two half-hour programme. The chairman was Chris Maslanka and there would be three others selected from perhaps a dozen people that were used, mostly people with some puzzling connection who were puzzle contributors to various newspapers and magazines. We would each come with about two suitable puzzles which would be put to the panel. Chris would set a problem for the listeners and after the first programme, we would get solutions and further problems sent in by listeners. Unfortunately it was never put on at a good time. We enjoyed doing the programmes and got a respectable audience, but I think the BBC authorities couldn't understand what was going on!\nThe\nMathematical Gazetteer of the British Isles\nwas created by David Singmaster and was published in the Newsletter of the British Society for the History of Mathematics in\n2002\n. Later an extended version was on the website of the British Society for the History of Mathematics but it was removed in\n2007\nand has now been taken over by MacTutor; it is part of this website.\nYou can see it at\nTHIS LINK\n.\nSingmaster explains how he came to create the Mathematical Gazetteer:-\nFor some years I have been collecting information about where mathematicians were born, lived, worked, died, or are buried or commemorated.\nAs we mentioned above, the Polytechnic of the South Bank became the London South Bank University in\n1992\n. Singmaster became the Professor of Mathematics in the School of Computing, Information Systems and Mathematics. He took early retirement from teaching in\n1996\nbut continued to be extremely active in his many other activities as an honorary research fellow at University College London. He was elected professor emeritus at the London South Bank University in\n2020\n.\nFor Singmaster, distinguishing between work and recreation was difficult. When asked in\n2002\nhow he relaxed he said\n[\n13\n]\n:-\nI've taken early retirement in order to work on several books I am compiling: Sources in Recreational Mathematics; A Mathematical Gazetteer; Notes on the History of Science and Technology in London. I collect books on these fields and on cartoons, humour, and language. I spend a lot of time in libraries and bookshops and I deal in books on recreational mathematics. We go to theatre, art galleries, etc. and visit friends and be tourists.\nOne amazing result of these activities was his rediscovery in\n2007\nof\nDe Viribus Quantitatis\nby\nPacioli\nin the archives of the University of Bologna. This book, written around\n1500\n, had never been officially published and had sat for over\n500\nyears in Bologna. Singmaster said in the interview\n[\n17\n]\n:-\nI was one of the contributors to 'A Lifetime of Puzzles', a festschrift for\nMartin Gardner\n, published in\n2008\n. My subject was the first recreational mathematics book, written by\nLuca Pacioli\n, the friend and collaborator of\nLeonardo Da Vinci\n. 'De Viribus Quantitatis'\n(\nOn the Powers of Numbers\n)\nis regarded as the foundation of modern magic and numerical puzzles, and is believed to be the first documentation of magic tricks with cards and coins. There is quite an overlap between people who are interested in the history of magic, and those who specialise in recreational mathematics.\nPacioli\n's book is an early example of this overlapping interest, which can be found in many later books on puzzles, particularly if the magic depends on binary arithmetic.\nDavid Singmaster died on the morning of Monday\n13\nFebruary after a long illness. Snezana Lawrence writes\n[\n16\n]\n:-\nDavid was an extremely nice and generous person, a large, friendly, smiley figure, with a great capacity to think and play mathematically. He was one of a kind and will be sorely missed by all who knew him.\nLet us end with this quote from\n[\n34\n]\n:-\nDavid had a delight and a passion for sharing. A visit to his house was an adventure, and once you were there it was extraordinarily difficult to leave! It was packed, floor to ceiling, with books, puzzles, and games. 'Just one more thing' was his catchphrase, as he would first show, then watch you struggle with, then himself struggle in turn to remember how to solve a mechanical puzzle of one sort or another. His tongue would poke out, first on one side, then the other, then back again, as all the while he talked about the history of the item, and how it had come into his possession. He delighted in the struggle, and each time he succeeded in solving a puzzle again his joy was evident, and you were invited to share it with him.",
  "matematicos_citados_na_biografia": [
    "D H Lehmer",
    "John Kelley",
    "London Mathematical Society",
    "John Conway",
    "Roger Penrose",
    "Conway",
    "Penrose",
    "THIS LINK",
    "Pacioli",
    "Martin Gardner",
    "Luca Pacioli",
    "Leonardo Da Vinci"
  ],
  "imagens": [
    "singmaster.jpg"
  ]
}