{
  "nome_completo": "Denis Papin",
  "nome_curto": "Denis Papin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Papin/",
  "data_nascimento": "22 August 1647",
  "local_nascimento": "Blois, France",
  "data_morte": "26 August 1713",
  "local_morte": "London, England",
  "summary": "Denis Papin was a French inventor who worked on the steam engine and invented the pressure cooker and the paddle boat.",
  "biografia": "Denis Papin\n's father was also named Denis Papin so we will refer to him as Denis Papin Sr. Denis Papin Sr\n(\nborn\n21\nOctober\n1608\n, died\n1688)\nwas the eldest of the ten children of Jacques Papin and Jehanne Dufour. He became a royal counsellor and revenue collector for the district of Blois. Denis Papin Sr married Madeleine Pineau, whose family had a tradition of being medical practitioners, around\n1640\n. They had thirteen children with Denis, the subject of this biography, being their fourth child and eldest son. His date of birth is unknown and the date we have given,\n22\nAugust\n1647\n, is actually the date of his baptism. He was presented for baptism by his uncle, Isaac Papin who was\n26\nyears old at the time. The family were Huguenots, a French branch of Protestants, and were protected from persecution by the Edict of Nantes which was passed in\n1598\n.\nWhen he was six years old, Denis was put into the care of his uncle Nicolas Papin\n(\nborn\n22\nJanuary\n1625)\n. Nicolas Papin was a medical doctor in Saumur, about\n100\nkm west of Blois, and had married there in\n1647\nand had three children born in\n1648\n,\n1649\nand\n1653\n. In Saumur there was a Huguenot Academy and Denis studied at this school. In\n1661\n, he began his studies of medicine at the University of Angers which had colleges of Law, Theology, Arts and Medicine,and  attracted students from the whole of France. He graduated with a medical degree on\n4\nJune\n1669\nbut\n[\n13\n]\n:-\n... he came away with a low opinion both of the teaching and of his fellow students but considered it worthwhile to obtain the degree of M.D.\nAt this stage in his career, Papin intended to follow medicine so, after some months back in Blois, he went to Paris in\n1670\nto begin life as a medical doctor. However, he was much more interested in mathematics and mechanics than he was in medicine and soon he was bored with medicine. He looked for ways to become involved in mathematics and approached Marie Charron Colbert, the wife of the Controller-General of Finances, Jean-Baptiste Colbert. The Charron and the Papin families were both from Blois so Marie Colbert was an obvious person for Papin to approach looking for support. Now, from December\n1666\n, Colbert had been organising a small group of scholars to meet in the King's library.\nChristiaan Huygens\n, one of the leading scientists of his day, had been persuaded to work in Paris and was a leading member of Colbert's group. He was looking for an assistant so it was arranged for Papin to fill this role. He assisted\nHuygens\nwith air pump experiments from\n1671\nto\n1674\n, during which time he lived in\nHuygens\n's apartments in the Royal Library in Paris\n[\n8\n]\n:-\nUnder\nHuygens\n's supervision, Papin published a book, 'Nouvelles Expériences du Vuide'\n(\nParis,\n1674)\n, based on the experiments he had heard about during his apprenticeship. This included\nHuygens\n's design of the air-pump as well as many of his experiments with the instrument that he had performed since\n1668\n, including testing the reaction of animals and plants inside the pump and observing the barometer in the apparently vacuous receiver. Indeed, a section of Papin's book closely follows a lecture that\nHuygens\ndelivered to the\nAcadémie Royale\nin\n1668\n. Dismissive of the debates in which\nHuygens\nhad been involved, Papin preferred instead to improve the instrument and to narrate observations of natural phenomena occurring inside the rarefied space of the air-pump. Also in\n1674\n,\nBoyle\n, unaware of Papin's book, published a collection of short papers that included works about the 'hidden qualities of the air\" ...\nHuygens\nreceived\nBoyle\n's collection of papers in June\n1675\n, and in the following month Papin travelled to England with his own air-pump to engage directly with\nBoyle\n.\nHuygens\ngave Papin a letter of introduction to Henry Oldenburg, secretary of the\nRoyal Society\n. In the letter he asked Oldenburg to arrange for Papin to be introduced to\nBoyle\nand\nBrouncker\n. He also asked Oldenburg if he could find some way of letting Papin establish himself in England. Oldenburg arranged accommodation for Papin, organised for him to undertake temporary work as a tutor, and introduced him to\nBoyle\n. Papin joined the congregation of Huguenots in Threadneedle Street but, at this stage, he seemed to want to concentrate on learning English rather than on discussing science. Although the\nRoyal Society of London\nwas operating at this time, meetings were infrequent and\nBoyle\ndid not attend them. By the autumn of\n1675\n, however, Papin began to try to interest\nBoyle\nin his work. He did this by writing a number of papers with\nHuygens\nwhich he published in the\nTransactions\nof the\nRoyal Society\n. At a meeting of the\nRoyal Society\nin February\n1676\n, Oldenburg reported on both\nBoyle\n's experiments and those of Papin and some of the experiments were demonstrated at the Society meeting. Papin had invented a double-barrelled air pump which was particularly effective.\nBoyle\noffered Papin a position as his assistant and this was gladly accepted. The two began to carry out experiments but, after\nBoyle\nbecame ill, Papin carried on the work on his own\n[\n17\n]\n:-\nAccording to\nBoyle\n's own testimony, this is what Papin did: he designed and constructed the particular instrument used in these experiments; he operated the instrument, either by himself or with the assistance of other technicians; he measured and recorded almost all of the experimental phenomena; and he planned and organized a great part of the experiments to be per formed. Moreover, he composed at least a significant part, and possibly almost all, of the experimental reports.\nAnita McConnell writes\n[\n13\n]\n:-\nFrom July\n1676\nto February\n1679\n[\nPapin\n]\nworked closely with\nBoyle\non experiments connected with respiration, magnetism, air, and the chemistry of blood and various medicaments, which he described in his 'Continuation of New Experiments'\n(1680)\n.\nHe remained in this post until\n1679\nwhen he became\nRobert Hooke\n's assistant at the\nRoyal Society\n. In\n1679\nPapin invented the pressure cooker which he demonstrated to the\nRoyal Society\n[\n15\n]\n:-\nThe device exemplified the enormous elastic force that steam acquires when heated and confined. The properties of this digester for cooking and extracting gelatine from bones by high pressure steam contains all that is at present practised in the preparation of food by this method.\nHe published a work in English describing his digester in\n1681\n, namely\nA new digester or engine for softening bones, containing a description of its make and use\n. A French edition was published in Paris in\n1682\n. Papin was elected a Fellow of the\nRoyal Society\nin\n1680\nas a consequence of his excellent work with\nHooke\nand\nBoyle\n. His work for\nHooke\nseems to have been mainly as a low paid secretary and, on\n1\nMarch\n1681\n, Papin returned to France to work with\nHuygens\n.\nAlthough now established as a leading physicist, Papin did not entirely give up his interest in medicine for in\n1681\nhe wrote\nA Treatise on Painless Operations\n[\n7\n]\n:-\nIn it the author describes the different means which may be used to lull the sensibility of patients and to spare them the pain of operations.\nIn\n1681\nPapin left for Italy where he was director of experiments at the Accademia publicca di scienze in Venice until\n1684\n. There had been an attempt by Giovanni Ambrosio Sarotti to turn the Accademia in Venice into a Society modelled on the\nRoyal Society\nin London and the\nAcadémie Royale\nin Paris. Sarotti had met Papin in England at the time when Sarotti had been elected to the\nRoyal Society\nin\n1679\n. In fact when Sarotti had returned to Venice, he took with him one of Papin's air pumps. Sarotti had created a magnificent library which he opened for scholars to use on three days each week. One of these days was a Monday and in the evening the scholars would meet for discussions. Experiments were demonstrated at these meetings and mathematics was discussed. However, lack of financial support ended Sarotti's attempt to create a Venetian version of the\nRoyal Society\n. After leaving Italy, there were religious reasons why Papin could not return to France. He was a Calvinist, born into a Huguenot family, and after the Edict of Nantes which had granted religious liberty to the Huguenots was revoked by Louis XIV in\n1685\n, he became an exile.\nPapin returned to London in\n1684\nworking again with the\nRoyal Society\nuntil\n1687\n. He was appointed as temporary curator of experiments and over these years wrote many papers and gave many demonstrations of experiments at\nRoyal Society\nmeetings. Some of his papers were published in the\nPhilosophical Transactions\nof the\nRoyal Society\nbut most were preserved unpublished in the archives. In\n1687\nPapin left England and went to Hesse-Kassel where he was appointed professor of mathematics at the University of Marburg\n[\n13\n]\n:-\nProspects of a better life opened up in\n1687\nwith Papin's appointment as professor of mathematics at the University of Marburg, in Germany. There he was reunited with other Huguenots who had fled France, among them his cousin Marie Papin and her husband, Jacques Maliverne, likewise a professor at the university, who shortly died, leaving his widow to support their small daughter, Charlotte. Papin's desire to marry Marie was opposed by the local pastor on the grounds of consanguinity and only achieved, on\n1\nJanuary\n1691\n, by special dispensation from the landgrave of Hesse.\nHe held this post until\n1696\nwhen he worked for the Landgrave of Hesse-Kassel until\n1707\n. This time in Hesse-Kassel was not a successful one for Papin who found himself in disagreement with his colleagues. He returned to London, living in Westminster, having left his wife and step-daughter in Germany.\nWe should mention Papin's friendship with\nGottfried Leibniz\nand also the scientific controversy between the two. They met and became friends in the\n1670\ns when Papin was working with\nHuygens\n. At this time\nLeibniz\nwas a frequent visitor to\nHuygens\n' laboratory and so met Papin on a regular basis. Their scientific controversy occurs in an exchange of letters in\n1689\n-\n1691\n, beginning with a letter from\nLeibniz\nconcerning a paper by Papin which discusses the motion of freely falling bodies.\nLeibniz\nends his letter saying:-\nWe conclude against the Cartesians that quantity of motion should not always be conserved.\nThe way Papin reacted was both to reply with a letter but also to write further papers. The controversy was over\nvis viva\n, what today we call kinetic energy, but the correspondence covered many other topics as well. Further letters were exchanged in\n1692\n. Alberto Guillermo Ranea writes\n[\n14\n]\n:-\nFrom January to November,\n1692\n, they exchange about ten texts in which both\nLeibniz\nand Papin try to give the main points of their arguments. We may conjecture that these texts were intended to be published. But as\nLeibniz\nwas firmly opposed to Papin's intention of submitting the controversy to the scientific community, they remained unedited ... In November,\n1692\n, their correspondence suddenly stopped, presumably because of Papin's troubles with his new appointment in Marbourg. Nevertheless, they later intensively argue over vis motrix from July,\n1695\nuntil Papin's travel to Holland in\n1700\n. ... Papin repeats the grounds of his position throughout the controversy: if we are dealing with bodies which are raised to a certain height by a motion acquired through a previous descent from the same height, we cannot assume that these heights are proportional to the vires motrices, since the forces are diminished by the resistance they must overcome, and not by the distance they traverse.\nPapin is best known for his work as an inventor, particularly his work on the steam engine. We have already mentioned his invention of the pressure cooker and, in\n1690\nhe published his first work on the steam engine in\nDe novis quibusdam machinis\nⓉ\n(\nOn certain new machines\n)\n. The purpose of the steam engine was to raise water to a canal between Kassel and Karlshaven. He also used a steam engine to pump water to a tank on the roof of the palace to supply water for the fountains in the grounds. In\n1705\n, when\nLeibniz\nsent Papin a sketch of a steam engine, Papin began working on that topic again and wrote\nThe New Art of Pumping Water by using Steam\n(1707)\n. He designed a safety valve to prevent the pressure of steam building up to dangerous levels.\nOther inventions which Papin worked on were the construction of a submarine, an air gun and a grenade launcher. He tried to build up a glass industry in Hesse-Kassel and also experimented with preserving food both with chemicals and using a vacuum. In\n1707\nPapin built the first paddle boat and that same year he returned to London where he lived in obscurity and poverty until his death. Clearly he hoped to be employed by the\nRoyal Society\nwhen he returned to London in\n1707\nand he wrote many letters offering to present experiments to the Society.\nIsaac Newton\nwas, at this time, President of the\nRoyal Society\nand seems to have given no encouragement for Papin's reemployment. In addition, the Society was itself in financial difficulties and was not in a position to give Papin much in the way of financial assistance. Papin continued to write papers, for example he sent eleven papers to the\nRoyal Society\nin\n1711\n. These were read to the Society at their meetings but not published despite containing interesting ideas. One important idea he produced was his Hessian Bellows, a machine designed to produce blasts of air for melting ores. This idea became the basis of the blast furnace. The date given for his death is only a guess since no records seem to exist of his last years in London. His last known letter is dated\n23\nJanuary\n1712\n. The Society had voted to send him £\n10\nfor his services on\n4\nJanuary\n1712\nbut he had not received this payment at the time he wrote the letter on\n23\nJanuary. It is likely that, with no relatives or money known to those who found him after he died, they would have him buried in an unmarked grave.\nAs to Papin's character, Alberto Guillermo Ranea writes that he was\n[\n14\n]\n:-\n... a formidably obstinate character, a man incapable of conceding the least advantage to his adversary, a skilled expert in the rules and tricks of the art of disputing.\nAlthough Papin received little in the way of honours in his lifetime, mainly because the importance of his work was not understood until\n100\nyears after his death, nevertheless he has been honoured more recently in his native town of Blois where a bronze statue has been erected and one of the main streets is named after him. A Jean Monnet University building in St Étienne stands in the Rue Denis Papin. The Lycée Professionnel Denis Papin is in La Courneuve, not far from Blois. There is a Rue Papin in Paris as well as a Rue Denis Papin in Échirolles and in Bègles, near Bordeaux. In July\n2013\nthere were\n300\nyear celebrations of Papin's life at Chitenay in the Loir et Cher Department of France.",
  "matematicos_citados_na_biografia": [
    "Christiaan Huygens",
    "Huygens",
    "Académie Royale",
    "Boyle",
    "Royal Society",
    "Brouncker",
    "Royal Society of London",
    "Robert Hooke",
    "Hooke",
    "Gottfried Leibniz",
    "Leibniz",
    "Isaac Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}