{
  "nome_completo": "Dennis Parnell Sullivan",
  "nome_curto": "Dennis Sullivan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sullivan/",
  "data_nascimento": "12 February 1941",
  "local_nascimento": "Port Huron, Michigan, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Dennis Sullivan is an American mathematician known for his work on topology, both algebraic and geometric, and on dynamical systems. He has been awarded major mathematical prizes including the Wolf Prize and the Abel Prize.",
  "biografia": "Dennis Parnell Sullivan\nshould really be Dennis Parnell Sullivan III since both his father and grandfather were named Dennis Parnell Sullivan. His father, known as Dennis Parnell Sullivan Jr\n(1920\n-\n1978)\n, was born in Port Huron, Michigan, on\n27\nJuly\n1920\n. He worked for the Hexagon Tool and Engineering Company in Dearborn, Wayne, Michigan. Dennis Parnell Sullivan Jr married Rita Jane Treend\n(1922\n-\n2014)\nin Port Huron, St Clair, Michigan on\n25\nMarch\n1940\n. Rita was born on\n16\nJune\n1922\n, the daughter of Charles G Treend, the manager of a Department Store, and his wife Frances. Dennis and Rita Sullivan had two children, Dennis Parnell Sullivan\n(\nborn\n12\nFebruary\n1941\n, the subject of this biography\n)\nand Michael Francis Sullivan\n(\nborn\n22\nJuly\n1942)\n. Michael died on\n26\nJuly\n1957\nin Houston, Texas, at the age of fifteen after a long medical battle. Rita Sullivan filed for divorce on\n11\nSeptember\n1945\nand it was granted absolute on\n7\nAugust\n1946\n.\nAlthough Dennis Sullivan was born in Port Huron, Michigan, he was brought up by his mother in Houston, Texas, and has always considered himself a Texan. When his mother died in\n2014\n, her obituary stated\n[\n48\n]\n:-\nRita J Sullivan a long time Houstonian whose career spanned radio, television, advertising and real estate died Saturday morning August\n9\n,\n2014\n.\nHe attended school in Houston before entering Rice University, also in Houston, to study chemistry. He explained in\n[\n58\n]\nthat he applied to Rice University despite being advised not to by his high school teacher:-\nI was sort of a bad student in high school, in the sense that I didn't study. I think it's because I was actually near-sighted. I didn't know you were supposed to be able to see the blackboard. So when I told my teacher that I was applying to Rice University, which is a very good school right in Houston, Texas, where I lived, she said, \"You shouldn't apply there. You're not a good enough student.\"\nHe switched from chemistry to mathematics when he found that the mathematics courses he took were the most exciting of all the science courses\n[\n58\n]\n:-\nWe took a lot of science. I didn't know there were such things as mathematicians. And then, in my second-year math course, the professor,\n[\nthe late\n]\nGuy Johnson, was showing us a wonderful theorem in math that went way beyond the intellectual quality of things like equations and calculations, which is what I thought math was. And I was just very struck by it. Once you understand that deeper real mathematics, it's sort of amazingly clear what things mean. There's no ambiguity, whereas almost everything else is much woollier and murkier, compared with mathematics. There's some great comfort in that. That's what attracted me.\nThe professor that turned Sullivan into a mathematician was Guy Johnson Jr\n(1922\n-\n2017)\n. He had been awarded a Ph.D. from Rice University in\n1955\nfor his\n2\n-part thesis Part I:\nCollective Singularities of Families of Analytic Functions\n. Part II:\nRegions of Flatness for Analytic Functions and their Derivatives\nwritten with\nSzolem Mandelbrojt\nas his thesis advisor. Since this event was so crucial, we give more details. Guy Johnson\n[\n26\n]\n:-\n... drew a picture of a kidney-shaped swimming pool, and a round swimming pool. And he said, you could deform this kidney-shaped swimming pool into the round one. At each point, the distortion is by scaling. A little triangle at this point goes to a similar triangle at the other point. At every point, that's true. We have a formula for the mapping, because we're taking calculus, and we had a notation for discussing it, which we have been studying. But this was like a geometric picture. This mapping was essentially unique. And this was, the nature of this statement was totally different from any math statement I've ever seen before. It was, like, general, deep, and wow! And true! So then, within a few weeks, I changed my major to math.\nThere was a lesson he learnt while a mathematics major at Rice University which he felt was important for his approach to research\n[\n64\n]\n:-\n... we had a homework assignment that had one problem on it that no one could do so I just kept working on it for some reason. It was a very strange problem, and after two weeks I got it. But I wasn't the best student in the class, there were several really good students. It was then that I realised that if you really want to understand something, you have to keep plugging at it and you'll eventually understand it, and that's basically it. So then you have to find simple things that you can work with so you're not totally confused by complexity and information.\nSullivan was awarded a B.A. by Rice in\n1963\n. He married Kathleen Rose McGuire on\n10\nAugust\n1963\nin Harris, Texas. He then went to Princeton University to undertake graduate studies in mathematics. At Princeton his thesis advisor was\nWilliam Browder\nand Sullivan was awarded a Ph.D. in\n1966\nfor his thesis\nTriangulating Homotopy Equivalences\n. Anthony Phillips writes\n[\n44\n]\n:-\nWilliam Browder\n's students at that time were mining surgery theory for topological gold. Dennis' thesis was in this vein and led to his work on the Hauptvermutung\n(1967)\n.\nIt was this work which led to Sullivan receiving the\nOswald Veblen\nPrize in Geometry in\n1971\nfrom the\nAmerican Mathematical Society\n. The sixth award of this prize was made\n[\n61\n]\n:-\nTo Dennis P Sullivan for his work on the Hauptvermutung summarised in the paper 'On the Hauptvermutung for manifolds', Bulletin of the American Mathematical Society, volume\n73\n(1967)\n...\nAfter the award of his doctorate Sullivan was appointed to a NATO Fellowship at Warwick University in England. I\n[\nEFR\n]\nwas a research student at Warwick at this time and I remember many evenings when I played bridge with fellow research students while Dennis worked at an adjacent table writing mathematics papers. After holding the fellowship at Warwick, Sullivan held a Miller Fellowship at the University of California at Berkeley working on the\nAdams\nconjecture, K-theory, and étale homotopy. In\n1969\nhe went to the Massachusetts Institute of Technology as a Sloan Fellow of Mathematics where\n[\n40\n]\n:-\n... his work focused on what he named geometric topology\n(\nin particular the study of\nGalois\nsymmetry\n)\nand on the construction of minimal models for the rational homotopy type of manifolds, using differential forms.\nIn\n1970\nhe produced a set of notes entitled\nGeometric topology: localization, periodicity and Galois symmetry\n. In the same year he was an invited speaker at the International Congress of Mathematicians in Nice, France, where he gave the lecture\nGalois symmetry in manifold theory at the primes\n. The importance of this work can be clearly seen from the fact that in\n2005\n, thirty-five years after they were written, both the lecture notes and Sullivan's lecture to the Nice Congress were published by Springer-Verlag. John McCleary writes in a review of the\n2005\npublication\n[\n62\n]\n:-\nIn\n1970\n, Sullivan circulated a set of notes, the \"MIT notes\", introducing localisation and completion of topological spaces to homotopy theory, and other important concepts and constructions that have had a major influence on the development of topology. A version of the notes appeared as \"Genetics of homotopy theory and the Adams conjecture\"\n(1974)\n. Although it has been a long time since\n1970\n, their publication now is more than an historical exercise. ...\nC T C Wall\nwrote of the MIT notes, \"it is difficult to summarise Sullivan's work so briefly: the full philosophical exposition in\n(\nthe notes\n)\nshould be read.\" The exposition in the notes focuses on epistemological questions - in particular, what is the underlying algebraic nature of a manifold, and how can we know it? ... My old copy of the MIT notes included a photo of the author, barely recognisable after so much photocopying. The photos in the new book of the author and his children together with the Postscript give a rare insight into the development of deep mathematical ideas. The notes remain worth reading for the boldness of their ideas, the clear mastery of available structure they command, and the fresh picture they provide for geometric topology. The editor\n[\nAndrew Ranicki\n]\nmust be thanked for making the notes available to another generation of topologists.\nAt Berkeley a new building, Evans Hall, was completed in\n1971\nto house the Mathematics Department. Many thought it a decidedly unattractive design and the postgraduates decided to paint some walls to brighten up their environment. Sullivan wrote to Lee Mosher in\n2002\nexplaining the part he played\n[\n40\n]\n:-\nIn\n1971\nI was a guest of the University of California giving lectures in the Math Dept. At the same time there was a confrontation between the trustees and the graduate students et al. The latter planned to continue decorating the walls of the department by painting attractive murals and the trustees forbade it. At tea some students came up and invited me to join their painting the next day. I became enthusiastic when one bearded fellow\n[\nBill Thurston\n]\nshowed me an incredible drawing of an embedded curve in the triply punctured disk and asked if I thought this would be interesting to paint. I said, 'You bet,' and the next day we spent all afternoon doing it. As we transferred the figure to the wall it was natural and automatic to do it in terms of bunches of strands at a time - as an approximate foliation - and then connect them up at the end as long as the numbers worked out. Thus some years later in '\n76\nwhen Bill gave an impromptu\n3\n-hour lecture about his theory of surface transformations I absorbed it painlessly at a heuristic level after the experience of several hours of painting in '\n71\n.\nSullivan spent the academic year\n1973\n-\n74\nin France visiting the University of Paris-Orsay. At the end of this stay he was invited to become a permanent professor at the Institut des Hautes Études Scientifiques outside Paris and he took up this position in\n1974\n. At the IHÉS, Sullivan\n[\n33\n]\n:-\n... was a master at orchestrating activity and interest among visitors and was especially effective with young people. Recent\nFields\nMedalist\nCurtis McMullen\nis a good example of Sullivan's influence: Although\nMcMullen\nreceived his Ph.D. from Harvard, he was really Sullivan's student, and it was while visiting the IHÉS that\nMcMullen\ngot the idea for his thesis problem. Another example is\nGromov\n: It was Sullivan's invitation that first brought\nGromov\nto the IHÉS as a visitor in\n1977\n, three years after\nGromov\nhad gotten out of the Soviet Union.\nIn\n1981\nSullivan was appointed to the\nAlbert Einstein\nChair in Science at the Graduate Center of the City University of New York but continued to hold his professorship on a part-time basis at the Institut des Hautes Études Scientifiques\n[\n29\n]\n:-\nDuring the\n1980\ns the resources of the\n[\nAlbert Einstein\n]\nChair allowed the founding of a regular seminar in geometry and chaos theory that brought first-rank international scholars to CUNY\n[\nthe City University of New York\n]\nand New York City. Subsequently, the seminar has been supported by The Graduate Center, pursuing the connections between topology and the mathematical models of nature provided by quantum field theory and fluid mechanics.\nWriting about this seminar, Sullivan explained where the strong relationship between algebraic topology and quantum field theory arises\n[\n29\n]\n:-\nI am particularly interested in the method of algebraic topology which associates linear objects\n(\nhomology groups\n)\nto nonlinear objects with points\n(\nmanifolds...\n)\njust like quantum theory associates linear spaces of states to classical systems with points. The main character in algebraic topology is the nilpotent operator or boundary operator while in quantum field theory an important role is played by the nilpotent operators called Q and \"delta\" which encode whatever symmetry is present in the action of the particular theory and measure the obstruction to invariantly assign meaning to the integral over all paths. In algebraic topology there is a powerful idea, due first to Stasheff but going beyond his famous and elegant concept of an infinitely homotopy associative algebra, which allows one to live with slightly false algebraic identities in a new world where they become effectively true. In quantum field theory the necessity to regularise or cutoff which sometimes destroys, but only slightly, identities expressing various symmetries and structures may provide an opportunity to use this powerful idea from algebraic topology. Finally algebraic and geometric topology has always directed it efforts towards understanding in an algebraic way geometric objects like manifolds which are the classical models of spacetime, while quantum field theory often begins its specification of a particular theory with the classical action defined on the classical fields spread over spacetime and then proceeds to its algebraic algorithms.\nIn\n1996\nSullivan resigned from his professorship in Paris to take up a professorship in mathematics at the State University of New York at Stony Brook, continuing to hold his part-time position at the Graduate Center of the City University of New York. In session\n1998\n-\n99\nSUNY promoted Sullivan to Distinguished Professor. Their announcement reads as follows\n[\n1\n]\n:-\nDennis Parnell Sullivan, Department of Mathematics, Stony Brook, is one of the great mathematicians of our time and one of the most important topologists of the last\n100\nyears. He has contributed to several diverse areas of mathematics including topology, geometry and dynamics and complex analysis.\nSullivan has received other major honours. In addition to the\n1971\nOswald Veblen\nPrize in Geometry mentioned above, he received the\n1981\nPrix\nÉlie Cartan\nfrom the\nFrench Academy of Sciences\n, the\n1994\nKing Faisal International Prize for Science\n(\nmathematics\n)\n, and the Ordem Scientifico Nacional by the\nBrazilian Academy of Sciences\nin\n1998\n. He received the New York City Mayor's Award for Excellence in Science and Technology in\n1997\n. He was awarded the\n2004\nNational Medal of Science by President George W Bush at a ceremony in the White House\n[\n35\n]\n:-\nFor his achievements in mathematics, including solving some of the most difficult problems and creating entirely new areas of activity, and for uncovering striking, unexpected connections between seemingly unrelated fields.\nThe description of his contributions leading to the award of the Medal are described in\n[\n35\n]\n:-\nSullivan's early work was in homotopy theory and surgery, to which he brought a new, geometric point of view. His geometric insights led to many important results on the topology of manifolds. His theory of real and rational homotopy types, based on differential forms, has had profound applications, for example, to the topology of complex algebraic varieties. Sullivan has made important contributions to the study of foliations and dynamical systems. He has also proved foundational results on quasiconformal and\nLipschitz\nmanifolds, categories that are intermediate between the topological and smooth ones. During the\n1980\ns and\n1990\ns, he was responsible for the emergence of the field of conformal dynamics as a lively and important branch of mathematics straddling the traditional borders between pure and applied areas. In recent years, he launched the field of string topology.\nIn\n2006\nSullivan received the Leroy P Steele Prize for Lifetime Achievement from the\nAmerican Mathematical Society\n. The citation states\n[\n2\n]\n:-\nDennis Sullivan has made fundamental contributions to many branches of mathematics. Sullivan's theory of localisation and\nGalois\nsymmetry, propagated in his famous\n1970\nMIT\n[\nMassachusetts Institute of Technology\n]\nnotes, has been at the heart of many subsequent developments in homotopy theory. Sullivan used it to solve the\nAdams\nConjecture and the Hauptvermutung for combinatorial manifolds. Later Sullivan developed and applied rational homotopy theory to problems about closed geodesics, the automorphism group of a finite complex, the topology of\nKähler\nmanifolds, and the classification of smooth manifolds. He has reinvented himself several times, playing major or dominant roles in dynamical systems, Kleinian groups, and low dimensional topology. These brief remarks do not do justice to the scope of Sullivan's ideas and influence. Beyond the specific theories he has developed and the problems he has solved - and there are many significant ones not mentioned here - his uniform vision of mathematics permeates his work and has inspired those around him. For many years he was at the centre of the mathematical conversation at IHÉS\n[\nInstitut des Hautes Études Scientifiques\n]\n. Later he moved to New York where his weekly seminar remains an important feature of mathematical life in the City.\nHe received the Wolf Prize in Mathematics in\n2010\nfor his contributions to algebraic topology and conformal dynamics\n[\n60\n]\n:-\nDennis Sullivan has made fundamental contributions in many areas, especially in algebraic topology and dynamical systems. His early work helped lay the foundations for the surgery theory approach to the classification of higher dimensional manifolds, most particularly providing a complete classification of simply connected manifolds within a given homotopy type. He developed the notions of localisation and completion in homotopy theory and used this theory to prove the\nAdams\nconjecture\n(\nalso proved independently by\nQuillen\n)\n. Sullivan and\nQuillen\nintroduced the rational homotopy type of space. Sullivan showed that it can be computed using a minimal model of an associated differential graded algebra. Sullivan's ideas have had far-reaching influence and applications in algebraic topology. One of Sullivan's most important contributions was to forge the new mathematical techniques needed to rigorously establish the predictions of\nFeigenbaum\n's renormalisation as an explanation of the phenomenon of universality in dynamical systems. Sullivan's \"no wandering domains\" theorem settled the classification of dynamics for iterated rational maps of the Riemann sphere, solving a sixty-year-old conjecture by\nFatou\nand\nJulia\n. His work generated a surge of activity by introducing quasiconformal methods to the field and establishing an inspiring dictionary between rational maps and Kleinian groups of continuing interest. His rigidity theorem for Kleinian groups has important applications in\nTeichmüller\ntheory and for\nThurston\n's geometrisation programme for\n3\n-manifolds. His recent work on topological field theories and the formalism of string theory can be viewed as a by-product of his quest for an ultimate understanding of the nature of space and how it can be encoded in strange algebraic structures. Sullivan's work has been consistently innovative and inspirational. Beyond the solution of difficult outstanding problems, his work has generated important and active areas of research pursued by many mathematicians.\nSullivan continued to be awarded the most prestigious prizes. In\n2014\nhe was awarded the Balzan Prize for Mathematics\n(\nPure/Applied\n)\n[\n15\n]\n:-\nFor his major contributions to topology and the theory of dynamical systems, opening new perspectives for generations to come. For his exceptional results in many fields of mathematics, such as topology, geometry, the theory of Kleinian groups, analysis, and number theory.\nHe was elected a member of the\nNational Academy of Sciences\n(1983)\n, of the\nBrazilian National Academy of Sciences\n(1984)\n, and of the\nNew York Academy of Sciences\n(1984)\n. He was also elected a fellow of the\nAmerican Academy of Arts and Sciences\n(1991)\n, a corresponding member of the\nIrish Royal Academy\n(2012)\nand an honorary member of the\nLondon Mathematical Society\n(2013)\n. He has served the\nAmerican Mathematical Society\nas vice-president\n(1990\n-\n93)\n. He received honorary degrees from the University of Warwick\n(1983)\nand the École Normale Supérieure de Lyon\n(2001)\n. Another honour was the conference held at the CUNY Graduate Center in September\n2002\nto celebrate the\n20\nth anniversary of his appointment as the\nAlbert Einstein\nChair in Science at The City University of New York. He was elected a fellow of the\nAmerican Mathematical Society\nin\n2012\n.\nThe\nAbel\nPrize is recognised as the highest possible award to a mathematician. It was presented to Sullivan in\n2022\n[\n63\n]\n:\n... for his ground-breaking contributions to topology in its broadest sense, and in particular its algebraic, geometric and dynamical aspects.\nFor the Press Release and the Citation for this award, see\nTHIS LINK\n.\nSullivan is now married to the mathematician Moira Chas. She was awarded a Ph.D. from the Universidad Autónoma de Barcelona in\n1998\nfor her thesis\nMinimum Periods of Homeomorphisms of Orientable Surfaces\n. He has six children: Lori, Amanda, Michael, Tom, Ricardo and Clara. Michael Sullivan is a mathematician with a Ph.D. from the University of Texas at Austin in\n1992\nfor his thesis\nTopological dynamical systems and knot theory\n.\nLet us end by first quoting some thoughts from Sullivan from the interview\n[\n26\n]\n:-\nI could say something that I say to my graduate students: critical thinking is important. It's good to think critically, examine your beliefs, understand why they're commonly held, and then maybe, in certain circumstances, you have to modify them slightly, to make them work better. That's what has helped me understand mathematics better. For example, even what you learned from your masters, sometimes, it's their perspective. Having a perspective is excellent, which is kind of like a bias. It is good because it makes you more effective and you can put your energy in those directions, right? But then sometimes, it's not right. In some situations or some points of view, there's a different way to look at it. And this may help you make progress in a direction that was blocked with the previous perspective. This is not being critical in the sense of being negative, it's critical in the sense of examining. So critical thinking is, and I'm borrowing this from a wonderful interview of\nBertrand Russell\nin\n1952\n, he says a lot of very charming and very intelligent things, but he also emphasises this point that when you have a perspective, it sometimes allows you to make irrational rational decisions. So it's good to be critical, even of your own beliefs because it helps. That works in mathematics too.\nFinally quoting his thoughts from\n[\n64\n]\n:-\nThe word mathematics has a bad reputation.  Everyone says \"I'm very bad at mathematics\" but that's ridiculous. When they were five or six years old they were fine; they were exploring space and being curious. People who stay mathematicians are just the ones that got past the difficulties and are still interested in new discoveries because it is fascinating. Toddlers, for instance, aren't really playing, they're working, they're figuring out how things work. First, they do space and then they do numbers - they're starting, they're little mathematicians.",
  "matematicos_citados_na_biografia": [
    "Szolem Mandelbrojt",
    "William Browder",
    "Oswald Veblen",
    "American Mathematical Society",
    "Adams",
    "Galois",
    "C T C Wall",
    "Bill Thurston",
    "Fields",
    "Curtis McMullen",
    "McMullen",
    "Gromov",
    "Albert Einstein",
    "Élie Cartan",
    "French Academy of Sciences",
    "Brazilian Academy of Sciences",
    "Lipschitz",
    "Kähler",
    "Quillen",
    "Feigenbaum",
    "Fatou",
    "Julia",
    "Teichmüller",
    "Thurston",
    "National Academy of Sciences",
    "Brazilian National Academy of Sciences",
    "New York Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Irish Royal Academy",
    "London Mathematical Society",
    "Abel",
    "THIS LINK",
    "Bertrand Russell"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}