{
  "nome_completo": "Dmitrii Konstantinovich Faddeev",
  "nome_curto": "Dmitrii Konstantinovich Faddeev",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faddeev/",
  "data_nascimento": "30 June 1907",
  "local_nascimento": "Yukhnov, Smolensk, now Kaluga, Russia",
  "data_morte": "30 October 1989",
  "local_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "summary": "Dmitrii Faddeev was a Russian mathematician who worked mainly in algebra, and who made significant contributions to other areas such as number theory, function theory, geometry and probability.",
  "biografia": "Dmitrii Konstantinovich Faddeev\n's father, Konstantin Tikhonovich Faddeev, was an engineer and his mother, Lubov' Germanovna, was a doctor. Konstantin Tikhonovich's father had an estate in the small town of Yukhnov, about\n200\nkm south west of Moscow, and it was on this estate that Dmitrii Konstantinovich was born. Dmitrii Konstantinovich\ninherited his scientific ability from his father, who had been taught and advised by\nAleksei Nikolaevich Krylov\nat the Moscow Higher Technical School, while from his mother he inherited outstanding musical ability.\nIt was in St Petersburg that Dmitrii Konstantinovich\ngrew up, for it was there that his parents worked; Konstantin Tikhonovich worked at the famous Nevsky Metalworks, Mechanical and Shipbuilding Factory. In\n1914\nSt Petersburg was renamed Petrograd and it was there that the Russian Revolution began in\n1917\n. The city and its inhabitants suffered greatly through the Russian Civil War but when stability returned in\n1923\n, Faddeev began his studies in mathematics at Petrograd State University while, at the same time, studying music at the famous Petrograd Conservatory on Theatre Square. Despite his extraordinary talent for the piano, by the time Faddeev reached his third year of study, he realized that he had to choose between mathematics and music. He left the Conservatory, by this time renamed the Leningrad Conservatory since the city had been renamed Leningrad in\n1924\n, and concentrated fully on his mathematical studies. However, his love of music continued throughout his life and, the article written to celebrate his seventieth birthday records\n[\n4\n]\n:-\n... he is a fine pianist, his playing of Schumann's piano music is unforgettable. His friends recall musical evenings where he and the late Vladimir Ivanovich Smirnov played beautifully many striking pieces of chamber music for four hands.\nAt Leningrad State University\n(\nas Petrograd State University was renamed in\n1924)\n, Faddeev was taught, and was greatly influenced, by\nIvan Matveevich Vinogradov\nand\nBoris Nikolaevich Delone\n. After completing work for his diploma, he graduated in\n1928\n. However, this was a very difficult period in Russia, with independent thinkers persecuted and many academics in fear for their lives, and it was difficult for him to advance his career\n(\n[\n31\n]\nor\n[\n32\n]\n)\n:-\nAccording to Faddeev's own words, it was difficult to find a professional job upon graduation and he had to work with various organizations, including the Weights and Measures Department, where he became addicted to smoking because of long breaks between instrumental observations. However, later his willpower helped him give up this unhealthy habit. Here is a curious detail: that period of time was characterized by a practically total deficit, including that of paper; hence, Faddeev had to write his long calculations on the underside of wallpaper.\nIn\n1930\nFaddeev married the mathematics student Vera Nikolaevna Zamyatina\n(\nwho has a biography in this archive under her married name\nVera Nikolaevna Faddeeva\n)\n. They had three children, one of whom was\nLudwig Dmitrievich Faddeev\n(\nborn\n10\nMarch\n1934)\nwho was educated in the Faculty of Physics at Leningrad State University and went on to become an outstanding mathematician and theoretical physicist producing ideas and results which are at the forefront of today's research.\nLeaving the Weights and Measures Department in\n1930\n, Faddeev taught at various Leningrad schools and also for a time at the Polytechnic Institute and the Engineering Institute. He began teaching at Leningrad State University in\n1933\nand, in\n1935\n, he submitted his doctoral dissertation\n(\nequivalent to the\nhabilitation\n)\n. From\n1932\n, he also worked in the Mathematics Department at the\nSteklov\nInstitute of Physics and Mathematics of the\nUSSR Academy of Sciences\n; the Department was headed by\nVinogradov\n. The Mathematics Department had been set up as an separate department of the\nSteklov\nInstitute in\n1932\nand, two years later, it became a separate Institute, namely the\nSteklov\nMathematical Institute. At this stage the Institute moved from Leningrad to Moscow but, despite this, Faddeev continued to undertake joint work with others at the Institute. In\n1940\nthe Leningrad Department of the\nSteklov\nInstitute of Mathematics was founded and Faddeev worked there from that time on.\nIn\n1937\nFaddeev became a professor at Leningrad State University, taking on a more important leadership role since\nDelone\nhad moved to Moscow. In September\n1939\n, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. However, in June\n1941\nthe course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad, many people were evacuated from the city including Faddeev and his family. For the duration of the siege of Leningrad, Faddeev lived in Kazan, about\n800\nkm due east of Moscow and considered safe from the German invasion. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January\n1944\n. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit. Faddeev, and other academics, obtained such a permit and again Leningrad State University began to operate.\nMuch of Faddeev's early work had been done in collaboration with\nDelone\n, particularly the highly significant results he obtained on\nDiophantine equations\n. In\n[\n9\n]\nan overview of his research is given:-\nFaddeev's mathematical legacy is unusually diverse. His primary area was algebra, but he made significant contributions to other areas such as number theory, function theory, geometry and probability. Faddeev had a profound influence on the formation and development of numerical methods in mathematics, and the book 'Numerical methods in linear algebra' which he wrote with\nV N Faddeeva\n, has been a reference source for several generations of specialists.\nLet us now look at a more detailed description of some of his work. In\n[\n2\n]\nhis early results on Diophantine equations are described:-\nFaddeev's very first results in Diophantine equations were remarkable. He was able to extend significantly the class of equations of the third and fourth degree that admit a complete solution. When he was studying, for example, the equation\nx\n3\n+\ny\n3\n=\nA\nx^{3} + y^{3} = A\nx\n3\n+\ny\n3\n=\nA\n, Faddeev found estimates of the rank of the group of solutions that enabled him to solve the equation completely for all A ≤\n50\n. Until then it had been possible to prove only that there were non-trivial solutions for some A. For the equation\nx\n4\n+\nA\ny\n4\n=\n±\n1\nx^{4} + Ay^{4} = ±1\nx\n4\n+\nA\ny\n4\n=\n±\n1\nhe proved that there is at most one non-trivial solution; this corresponds to the basic unit of a certain purely imaginary field of algebraic numbers of the fourth degree and exists only when the basic unit is trinomial.\nIn\n1940\nFaddeev, in collaboration with\nDelone\n, published\n(\nin Russian\n)\nthe book\nTheory of Irrationalities of Third Degree\n. This work included the results on Diophantine equations described in the above quotation and a wealth of other material. James V Uspensky begins a review as follows:-\nThe purpose of this outstanding monograph is to present all that is known at the present time about cubic irrationalities and such problems in number theory as are intimately connected with them. The book for the most part consists of the original investigations of its authors, and even that which has been contributed by other investigators is presented from a new and original point of view. Two features are very characteristic of the mode of presentation: on the one hand the extensive use of geometrical considerations as a background for the true understanding of complicated situations which otherwise would remain obscure, and on the other hand, the care shown by the authors in inventing effective methods of solution, illustrated by actual application to numerical examples and to the construction of valuable tables.\nAlso early in his career, while collaborating with\nDelone\n, Faddeev studied\nGalois\ngroups. In particular he was interested in the inverse problem of\nGalois theory\n, namely given a particular group, classify the extensions of a given field with that group as its\nGalois\ngroup. In\n1990\nFaddeev, in collaboration with V V Ishkhanov and B B Lure, he published the Russian book\nThe embedding problem in Galois theory\nwhich was translated into English and the translation published by the\nAmerican Mathematical Society\nin\n1997\n. Faddeev's work on\nGalois\ngroups led him to the ideas of homological algebra independently of\nSamuel Eilenberg\nand\nSaunders Mac Lane\n. He introduced the idea of a cocycle and of relative homology\n(\nalthough he did not use either of these terms\n)\n. He went on to apply his homology theory to investigate algebras over fields of algebraic functions. In joint work with Zenon Ivanovich Borevich\n(1922\n-\n1995)\n, one of Faddeev's students, he began to examine integral representations of rings. Their joint work on this topic includes\nIntegral representations of quadratic rings\n(1960)\n, and\nRepresentations of orders with cyclic index\n(1965)\n.\nIn the above overview of Faddeev's contributions, there is reference to his highly significant work on computational mathematics. Much of this work was done in collaboration with his wife\nVera Nikolaevna Faddeeva\nbut his first few papers on this topic are single authored:\nOn certain sequences of polynomials which are useful for the construction of iteration methods for solving of systems of linear algebraic equations\n(1958)\n,\nOn over-relaxation in the solution of a system of linear equations\n(1958)\n, and\nOn the conditionality of matrices\n(1959)\n. MathSciNet lists around\n20\njoint publications by Faddeev and his wife on numerical analysis including their most famous, the book\nComputational methods of linear algebra\nwhich appeared in Russian in\n1960\n. They were awarded a State Prize for this remarkable monograph. It was translated into English and published in\n1963\n, the same year in which an enlarged and revised Russian version was published. Note that in\n1975\nthe two authors produced another major work summarizing work done on numerical linear algebra during the years\n1962\n-\n1974\n. Unfortunately the English translation of the\n1960\nmonograph left much to be desired and most reviewers comment on the deficiencies of the translation more than on the contents. However, J C P Miller\n[\n23\n]\ndoes note that the Russian book is an exceptional work:-\nThe original edition of this book in Russian is undoubtedly a very stimulating and valuable book, and translation into English is a very worthwhile task. The content of the book is comprehensive, with much material that does not appear to have been collected together previously.\nThere were, however, many other aspects of Faddeev's mathematical contributions in addition to his research\n[\n9\n]\n:-\nIn addition to a publication list of more than\n160\ntitles, Faddeev's career was marked by his interest in education. He was known for his many students, his contributions to the structuring of contemporary mathematical education, his creation of internationally-known scientific schools, and his outstanding textbooks.\nHe was one of the founders of the Mathematical Olympiads for school children and he put considerable effort into organizing these events. The first Mathematical Olympiad took place in Leningrad in\n1934\n. He produced a series of 'Problem' books aimed at pupils in various different years at high school. He also published, with the collaboration of Iliya Samuilovich Sominskii,\nProblems in Higher Algebra\n. This book was very popular, going through many\n(\nat least eleven\n)\neditions following its first publication in\n1951\n, and an English translation appeared in\n1965\n. H M Cundy, in a review of the English translation, writes\n[\n7\n]\n:-\nThis book consists of\n983\nproblems\n(209\npages\n)\n; hints to selected problems\n(37\npages\n)\n, mostly the briefest possible; and\n250\npages of solutions, ranging from mere answers to numerical problems to complete proofs ... The problems are grouped under seven heads: Complex Numbers,\nDeterminants\n, Linear Equations, Matrices, Polynomials and\nRational Functions\nof a single Indeterminate, Symmetric Functions, and Linear Algebra.\nD J Lewis writes\n[\n22\n]\n:-\nIt is obvious that this book will be a valuable source of problems for any teacher or examiner. It could be a useful adjunct text in courses treating such topics.\nAs well as these 'Problem' books, Faddeev produced textbooks such as\nLectures on algebra\n. This is an undergraduate text based on his lectures at Leningrad University. He also wrote the school textbooks\nElements of higher mathematics for school-children\nand\nAlgebra\n6\n-\n8\n. In the Preface to\nLectures on algebra\nhe explains his ideas about teaching abstract ideas:-\nI consider that abstract concepts must be introduced to the extent that their introduction succeeds in stimulating in the students the need to generalise or, at least, a realisation that it is possible to illustrate sufficiently general concepts by more concrete material.\nThe contents of this book are: Integers; Complex numbers; Elements of the algebra of polynomials; Matrices and determinants; Quadratic forms; Polynomials and functions; Congruences in a ring of polynomials and field extensions; Polynomials with integer coefficients. Polynomials over factorial rings; Distribution of roots of a polynomial; Elements of group theory; Symmetric polynomials; Vector spaces; Euclidean space and unitary space; Elements of tensor algebra; and Algebras.\nFaddeev received many honours including the order of Lenin in\n1967\nand the order of the Red Banner of Labour which he received on three separate occasions,\n1951\n,\n1957\n, and\n1975\n. In\n1964\nhe was elected a Corresponding Member of the Mathematics Section of the\nUSSR Academy of Sciences\n.",
  "matematicos_citados_na_biografia": [
    "Aleksei Nikolaevich Krylov",
    "Ivan Matveevich Vinogradov",
    "Boris Nikolaevich Delone",
    "Vera Nikolaevna Faddeeva",
    "Ludwig Dmitrievich Faddeev",
    "habilitation",
    "Steklov",
    "USSR Academy of Sciences",
    "Vinogradov",
    "Delone",
    "Diophantine equations",
    "V N Faddeeva",
    "Galois",
    "Galois theory",
    "American Mathematical Society",
    "Samuel Eilenberg",
    "Saunders Mac Lane",
    "Determinants",
    "Rational Functions"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}