{
  "nome_completo": "Domenico Montesano",
  "nome_curto": "Domenico Montesano",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montesano/",
  "data_nascimento": "22 December 1863",
  "local_nascimento": "Potenza, Basilicata, Italy",
  "data_morte": "1 October 1930",
  "local_morte": "Naples, Italy",
  "summary": "Domenico Montesano was an Italian mathematician who studied the theory of linear congruences and conic bilinear complexes.",
  "biografia": "Domenico Montesano\n's parents were Leonardo Antonio Montesano and the duchess Isabella Schiavone of Aragona. Isabella was Leonardo's second wife, his first wife having died at a young age. Leonardo and Isabella had nine children, five boys and four girls. Leonardo practised as a lawyer in Potenza and brought his family up strictly following the ways of the Kingdom of the Two Sicilies which existed until the unification of Italy in\n1860\n. It was a typical intellectual family of the time: all the sons were able to make the most of their talents having keen intelligence as well as integrity and modesty. Two of the boys followed their father to become lawyers, two became medical doctors and Domenico, the subject of this biography, became a professor of mathematics. The four girls, following the customs of the day, were educated only to high school standard and then cultivated the practice of certain home arts such as music, painting and embroidery. One of the two sons who took up medicine was Domenico's younger brother Giuseppe Ferruccio Montesano, born in Potenza on\n4\nOctober\n1868\n. He became one of the founders of psychology and child psychiatry in Italy.\nAfter attending schools in Potenza, Domenico entered the University of Rome in\n1880\nand, after studying under\nLuigi Cremona\nand\nGiuseppe Battaglini\n, graduated in\n1884\nwith the laureate. Italy was unified three years before Domenico was born and he grew up in a country that was coming to terms with this important event. Only in\n1871\ndid Rome become the capital of Italy and immediately efforts had been made to make the new capital a scientific centre of excellence. Top Italian mathematicians were offered positions there and Montesano's teachers\nBattaglini\nand\nCremona\nwere two of these. Given that\nBattaglini\nand\nCremona\nwere distinguished geometers, it is not surprising that Montesano's research was in geometry.\nAfter graduating he remained at the University of Rome for four years as an assistant. During these years he published works such as:\nSu la corrispondenza reciproca fra due sistemi dello spazio\nⓉ\n(\nOn the mutual correspondence between two space systems\n)\n(1885)\n;\nSu le correlazioni polari dello spazio rispetto alle quali una cubica gobba e polare a se stessa\nⓉ\n(\nOn the polar correlations of space with respect to which a cubic hump and polar herself\n)\n(1886)\n;\nSu certi gruppi di superficie di secondo grado\nⓉ\n(\nOn certain surface groups of the second degree\n)\n(1886)\n;\nSu i complessi di rette di secondo grado generati da due fasci proiettivi di complessi lineari\nⓉ\n(\nOn the complexes of straight lines of the second degree generated by two projective bundles of linear complexes\n)\n(1886)\n; and\nSu alcuni complessi di rette-Battaglini\nⓉ\n(\nOn some complexes of Battaglini lines\n)\n(1886)\n. He lectured on projective geometry and his lecture notes were published as\nLezioni di geometria proiettiva\nⓉ\n(\nLessons in projective geometry\n)\n(1887)\n. This book proved popular and it ran to several editions, for example by\n1905\na forth edition was published.\nBy\n1888\nMontesano had\n13\npublications and was in a strong position when he entered the competition for the chair of descriptive and projective geometry at the University of Bologna. He was ranked first by the referees and was appointed to the chair. In\n1893\nhe entered the competition for the chair of projective geometry at the University of Federico II at Naples. The referees appointed to make the decision were Ferdinando Aschieri,\nEugenio Bertini\n, Francesco Chizzoni, Vittorio Martinetti and\nGiuseppe Veronese\n. Five candidates were eligible to be considered for the chair, the other four being\nLuigi Berzolari\n, Alfonso Del Re,\nMario Pieri\nand Federico Amodeo. It proved a very close contest with Montesano coming out on top just ahead of\nBerzolari\n. Two years later, Montesano was promoted to ordinary professor of higher geometry at Naples. For many years he was also responsible for the teaching of higher mathematics at Naples.\nLet us note that filling the chair of descriptive and projective geometry at the University of Bologna, which Montesano vacated in\n1893\nwhen he went to Naples, remained unfilled until\n1896\nwhen a competition was held. Montesano was a referee in this competition which appointed\nFederigo Enriques\nwith\nMario Pieri\ncoming a close second. Montesano was also a referee for the competition for the chair at Turin in\n1901\nwhen\nGino Fano\nwas appointed. Again in\n1905\n, when competitions for two chairs at Padua were advertised, Montesano acted as a referee for both.\nMontesano's research was almost all in geometry, and he followed the lines of research that he had begun under the influence of his two teachers\nBattaglini\nand\nCremona\n. In particular he undertook much research on\nCremona\ntransformations. In\n1898\nMontesano published\nUna estensione del problema della proiettivita a gruppi di complessi e di congrunze lineari di rette\nⓉ\n(\nAn extension of the problem of the projectivity in groups of complex and congruent lines\n)\n. This is discussed by\nVirgil Snyder\nin\n[\n3\n]\nwho writes:-\nThe existence of irrational involutions of points in ordinary space was established by\nEnriques\n, and concrete examples of such were later given by Aprile. One of the unsolved problems of modern algebraic geometry is the determination of involutions of minimum order, in particular, to determine whether involutions of order two exist that are certainly irrational. Among the methods used in attacking this problem is the study of those birational involutorial transformations of space contained multiply in a linear line complex. An involution mapped on the general cubic variety of\nS\n4\nS_{4}\nS\n4\n​\nis probably an example; two series of such were given at the Bologna Congress of\n1928\n... . Here I wish to develop another case, which was first found incidentally by Montesano in connection with another problem.\nLet us note that Giorgio Antonio Aprile, mentioned by\nSnyder\nin the above quote, was a student of Montesano's at Naples, being awarded his laureate in\n1910\n.\nIn\n1907\n, in the Rendiconti di Napoli, Montesano published the paper\nSu nuovi tipi di superficie razionali di\n5\no\nordine\nⓉ\n(\nOn new types of rational surfaces of the\n5\nth order\n)\nshowing how to obtain a quintic surface with two consecutive skew double lines by quadratic transformation of a rational sextic. This is discussed in\n[\n4\n]\n.\nMontesano was honoured with election to the Royal Academy of Sciences of Naples. In\n1921\nhe became president of the Academy of Science, Physics and Mathematics of Naples. He was described as:-\n... an honest, conscientious man who was very well liked.",
  "matematicos_citados_na_biografia": [
    "Luigi Cremona",
    "Giuseppe Battaglini",
    "Battaglini",
    "Cremona",
    "Eugenio Bertini",
    "Giuseppe Veronese",
    "Luigi Berzolari",
    "Mario Pieri",
    "Berzolari",
    "Federigo Enriques",
    "Gino Fano",
    "Virgil Snyder",
    "Enriques",
    "Snyder"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}