{
  "nome_completo": "Donald Birkby Eperson",
  "nome_curto": "Donald Eperson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eperson/",
  "data_nascimento": "22 July 1904",
  "local_nascimento": "Gunnersbury, Middlesex, England",
  "data_morte": "13 May 2001",
  "local_morte": "Worthing, West Sussex, England",
  "summary": "Donald Eperson was an English schooteacher and clergyman who produced works on recreational mathematics.",
  "biografia": "Donald Eperson\n's father was Joseph William Eperson, a teacher who was born in July\n1876\nin Mansfield, Nottinghamshire. He married Anne Jassop Birkby, also a teacher, in October\n1901\nin Bradford, Yorkshire. She had been born in about\n1875\nin Bradford, Yorkshire. They had met while both were training to be teachers; Joseph studying at Westminster College and Anne at St Katharine's College. Both were very musical. Joseph William Eperson died in\n1966\nin Devon, England. Donald had a sister Doreen and, as children growing up in the London suburbs, they had happy times playing croquet. These years, before the start of World War I, were happy times and Donald enjoyed singing in the church choir. He writes in\n[\n1\n]\n:-\nEvery Sunday evening our family made music together: my mother accompanied on the piano the songs and hymns sung by my sister Doreen and myself, and my father would play the violin or join in the singing.\nHe write of his experiences at Colet Court Preparatory School in\n[\n2\n]\n:-\n... at a preparatory school, my mathematical education was soundly based on books such as 'A School Geometry' by Hall and Stevens, which was a revised version of the authors' 'Text Book of Euclid's Elements', used by my father in Victorian times.\nEuclid\n's axioms, definitions and postulates were far above the head of a nine-year old boy, whose enjoyment of mathematical activities was not stimulated by 'homework' consisting of the memorizing of theorems such as the 'Pons Asinorum'\nⓉ\n(\nThe asses' bridge: Euclid, Book\n1\n, proposition\n5\n)\n.\nFrom the preparatory school, Eperson entered selective independent St Paul's School, London, in\n1916\n. This school had been founded in\n1509\n\"to educate boys from all nations and countries regardless of race creed or social background.\" He had won a £\n100\na scholarship in\n1914\nwhich had covered fees for his final two years at Colet Court Preparatory School and also covered his first two years at the prestigious St Paul's School where he\n[\n2\n]\n:-\n... enjoyed writing Latin and Greek verses. This was probably because they were a kind of word puzzle whose solution depended upon finding words with simple rhythms that fitted into a musical framework of pentameters and hexameters.\nIn his first year at St Paul's, after explaining to his classics teacher why an eclipse of the moon can only occur when the moon is full, he was transferred from the Lower Classical Eighth Form to the Mathematical Eighth Form\n[\n2\n]\n:-\nHere, I worked on books such as Smith's 'Conic Sections' and Askwith's 'Analytical Geometry', whilst also finding an interest in\nRouse Ball\n's 'Mathematical Recreations and Essays'. The form master, Capt H R Pullinger, gave us introductory talks on new topics, and then left us mainly to our own activities. He never moved from his desk during the\n1\n1\n2\n1\\large\\frac{1}{2}\\normalsize\n1\n2\n1\n​\nhour lessons twice a day. We were also expected to do at least two hours of work at home each weekday evening. I was intrigued by\nPascal\n's Theorem and its dual,\nBrianchon\n's Theorem, and spent one summer holiday exploring the Theory of Duality in geometry and trying to find other theorems in which the interchange of the words 'point' and 'line' and the phrases 'lie on' and 'touch' led to pairs of dual theorems.\nWe note that Capt H R Pullinger is Henry Robert Pullinger who later became headmaster of the Royal Grammar School Worcester.\nEperson took part in other activities at the school too\n[\n1\n]\n:-\nEach Wednesday afternoon was devoted to sport - cricket in the summer term, and rugger in the other two terms: we had to travel to the playing fields within sight of Wormwood Scrubbs prison. I did not shine in either of these activities, but I enjoyed playing chess, for which I gained two prizes. Only once did I join the school team, playing against another London school, when my young opponent castled on the king's side, and allowed me to mate his king at once.  When Sir George Thomas, the national chess champion, came to the school to play simultaneously against about\n20\nboys playing black, I was one of the few boys that defeated him.\nIn\n1922\n-\n23\nhe sat the University Scholarship Examinations in Mathematics and entered Christ Church, Oxford, in the autumn of\n1923\nafter spending a summer holiday on Jersey with his family\n[\n2\n]\n:-\nMy tutor, Mr T W Chaundy, was a successor to the lecturer in Mathematics known as\nLewis Carroll\n. With some prize money I acquired a small library of books on the architecture of Oxford and of English Cathedrals. Many visits were made to village churches, cathedrals and abbeys by bicycle. I remember many lectures; in particular some on Cubic Curves, Cubic Surfaces, Professor Love's demonstration of the properties of gyroscopes using a bicycle wheel, and\nG H Hardy\n's lecture on Geometry where he covered himself from head to toe with chalk-dust and periodically came out with phrases such as \"It is obvious that....\".\nHardy\n's book, 'A Mathematician's Apology', has been my mathematical gospel ever since I read it. I share his belief that Mathematics is an Art in its own right, and a source of intellectual delight, closely associated with the beauty to be found in the visual arts and in music.\nWe note that T W Chaundy mentioned in this quote is Theodore William Chaundy\n(1889\n-\n1966)\nwho was a tutor at Christ Church from\n1912\nuntil he retired in\n1956\n. He was the author of\nThe differential calculus\n(1935)\nand\n(\nwith\nBryce McLeod\n)\nElementary differential equations\n(1969)\n. He was a specialist in the printing of mathematics and was a co-author of a book on that topic. Eperson graduated with a First Class degree from Oxford in\n1927\nand, in the same year, was appointed as a mathematics master at Sherborne School, Dorset, one of the best schools in England. He wrote\n[\n2\n]\n:-\nI trained myself by reading such books as 'The Teaching of Elementary Mathematics' by Godfrey and Siddons. A valuable asset was Boon's 'Companion to Elementary School Mathematics' and I soon began my own collection of notes on recreational topics, such as Magic Squares, Dissections and Number Puzzles. I soon learned the value in the classroom of 'side-tracking' from the appointed syllabus, and exploring topics such as\nPythagoras\n's connection between mathematics and music. In my spare time I organised visits to places of archaeological and architectural interest. I began to study for the General Ordination Examination and, after six months at Ripon Hall Theological College, was ordained Deacon in Salisbury Cathedral in\n1930\n.\nAs to his approach to teaching, he said\n[\n4\n]\n:-\nBy word and by example, I encouraged boys to investigate puzzles and problems on their own, and to enjoy their mathematical activities.\nEperson had a number of pupils at Sherborne who would become famous, the best known being\nAlan Turing\n. Eperson said\n[\n4\n]\n:-\nIn one sense he\n(\nTuring\n)\nwas difficult to teach, as he preferred to make his own independent investigations.\nHowever, Eperson deserves much credit for his ability to handle a pupil as talented yet unconventional as\nTuring\n. In fact, inspired by Eperson,\nTuring\nborrowed three books by\nLewis Carroll\nfrom the School library in November\n1930\n:\nThe Game of Logic\n,\nAlice in Wonderland\nand\nThrough the Looking Glass\n.\nIn\n1933\nEperson addressed the Annual General Meeting of the\nMathematical Association\n, delivering his talk\nLewis Carroll - mathematician\n.\nAfter he was ordained, Eperson acted as an assistant chaplain to Sherborne School in addition to his mathematics duties. However, in\n1938\nhe left Sherborne School when he accepted an offer from the Bishop of Salisbury, Dr Lovett, to be vicar of Charminster in Dorset and, in addition, to be the chaplain at Herrison Hospital. In September\n1939\n, Eperson married Phyllis M Perrett who had studied mathematics at Cambridge before being appointed to the Sherborne Girl's School. It was their musical interests that had brought them together having met singing madrigals at Sherborne. Epson continued his interest in mathematics and in\nDodgson\n, publishing\nThe Lewis Carroll Puzzle Book; containing over\n1\n,\n000\nposers from Alice in Wonderland and other books by Lewis Carroll\n(1948)\n. J C P Miller writes in a review\n[\n5\n]\n:-\nThis consists mainly of a number of \"Quizzes\" on various subjects - many of the questions, but not all, connected with\nLewis Carroll\nand his works. The mathematical part is short, but interesting: in it are some of\nDodgson\n's \"Pillow Problems\" and simpler \"Armchair Problems\". ... The whole collection has an unusual freshness to those not well acquainted with\nLewis Carroll\n's works-perhaps because both\nDodgson\nand compiler are mathematicians.\nEperson also produced works on places of interest such as\nThe Church of St Mary, Charminster\n(1944)\n.\nIn\n1951\nhe was appointed an Honorary Canon of Salisbury Cathedral but at this stage continued his duties as vicar of Charminster. However, in\n1953\nhe resigned his position in Charminster when he was appointed as Chaplain of Bishop Otter College in Chichester. This gave him the opportunity to teach again, both mathematics and divinity, while his wife became the warden of one of the women's hostels.  Bishop Otter College was a teacher training college, so Eperson was now having to show teachers how to teach mathematics. He writes\n[\n2\n]\n:-\n... there were few books for the guidance of training college lecturers when devising basic courses in mathematics.\n[\nIn\n1956\nan Inspector\n]\nvisited and invited the College to organise a supplementary one-year course for teachers who wished to improve their knowledge of mathematics and to teach the subject at secondary school. From\n1957\n-\n1964\nthe course attracted over\n70\nmen and women teachers. Volunteers on the course assisted me in an investigation into\nGoldbach's Conjecture\nthat every even number is the sum of two prime numbers, which yielded some interesting discoveries but no proof of the validity of the conjecture.\nIn his attempts to produce material to promote enjoyment and interest in mathematics as well as stimulating pupils, led him to make a number of films, for example\nAlice in Numberland\n,\nThe History of Pi\n, and\nThe History of Calculators\n. He continued his love of music, producing works such as\nO mortal man: anthem for five voices\n(1956)\n,\nLord of Mercy. A motet for five voices\n(1957)\nand\nTwo lute songs\n(1962)\n.\nIn\n1964\n, when he reached the age of\n60\n, Eperson retired from Bishop Otter College where he had, for some years, been a Principal Lecturer and Dean of Chapel. He taught for a term at a Secondary Modern School at Deal where he used his unpublished 'Mathematics for Pleasure' material. He wrote\n[\n4\n]\n:-\nThis\n[\nmaterial\n]\nwas the outcome of my work with college students suffering from 'mathophobia', for whom I devised activities, based upon traditional and 'modern' mathematics, that would stimulate their interest and convince them that elementary processes and ideas were not beyond their powers of comprehension. My belief is that, at every stage, mathematical activities can be as enjoyable as any other topic in the school curriculum. The material was never published, but the duplicated sheets were in great demand from over\n500\nteachers.\nAfter the term at Deal, he moved to Canterbury where he was appointed as senior lecturer in mathematics at Christ Church Canterbury, and a minor canon at Canterbury Cathedral. His address in Canterbury was the charming\n12\nPuckle Lane. In\n1969\nhe officially retired but became even more active in publishing material intended to intrigue, entertain and develop mathematical skills. He now began publishing a section entitled 'Puzzles, Pastimes, Problems' in\nMathematics in School\n, a publication of the\nMathematical Association\n, his first article being published in November\n1971\n. In addition, he published interesting mathematical items in\nThe Mathematical Gazette\n, and his 'Maths Teasers' were published regularly in the 'Maths Extra' issues of the Times Educational Supplement.\nFor a few of Eperson's Puzzles, Pastimes and Problems and some of his thoughts about teaching mathematics, see\nTHIS LINK\n.\nIn\n1988\n, when he was eighty four years old, Eperson published a book entitled\nPatterns in Mathematics\nwhich ran to five editions. This book, wrote Eperson, emphasised\n[\n2\n]\n:-\n... mathematics as a form of art which can be enjoyed by young and old alike, and containing hundreds of original puzzles and pastimes. Just as Rhythm is the basic element in all forms of Music, Pattern is the basic element in Mathematics that can give pleasure to everyone.\nHe was still living in Canterbury in\n1998\nbut with increasing frailty, both of himself and of his wife, they moved to Sussex, living at Hillrise,\n12\nTennyson Road, Worthing, West Sussex. By the year\n2000\n, he was ninety-six years old but still writing articles. He completed writing his autobiography\nMusic and Mathematics\nin March\n2001\nbut he did not live to see it published in the following year. His final article on\nLewis Carroll\nwas\nNo Ear for Music?\nwhich was, in fact on\nLewis Carroll\nand Sir Arthur Sullivan. It was published in the Spring issue of\nThe Carrollian,\nthe journal of The Lewis Carroll Society, at around the time of Eperson's death.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Rouse Ball",
    "Pascal",
    "Brianchon",
    "Lewis Carroll",
    "G H Hardy",
    "Hardy",
    "Bryce McLeod",
    "Pythagoras",
    "Alan Turing",
    "Turing",
    "Mathematical Association",
    "Dodgson",
    "Goldbach's Conjecture",
    "THIS LINK"
  ],
  "imagens": [
    "eperson.jpg"
  ]
}