{
  "nome_completo": "Dončo Dimovski",
  "nome_curto": "Dončo Dimovski",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dimovski/",
  "data_nascimento": "1 October 1954",
  "local_nascimento": "Bitola, Yugoslavia, now North Macedonia",
  "data_morte": null,
  "local_morte": null,
  "summary": "Dončo Dimovski is a Macedonian mathematician whose areas of interest include algebra and topology with applications to physics, statistics and computer science.",
  "biografia": "Dončo Dimovski\nwas born in Bitola, the second largest of the cities of Macedonia situated about\n15\nkm north of the border with Greece. We note that when Dimovski was born, Macedonia was officially part of the People's Federal Republic of Yugoslavia and was one of the six republics of the Yugoslav federation. In\n1963\nit was renamed the Socialist Republic of Macedonia, part of what was then named the Socialist Federal Republic of Yugoslavia. Macedonia declared independence in September\n1991\n, calling itself the Republic of Macedonia. Since June\n2018\nit has been agreed that the country will be called Northern Macedonia to distinguish it from the Macedonian region of Greece.\nIn was in Bitola that Dimovski completed both his primary and secondary education, graduating from the high school in\n1973\n. At the beginning of the academic year\n1973\n-\n74\nhe enrolled in the Faculty of Natural Sciences and Mathematics in the University of Skopje. This University had been founded in\n1946\nbut it was almost completely destroyed in an earthquake in\n1963\nand so the university that Dimovski entered was a large modern one completely rebuilt after the earthquake. His outstanding abilities in mathematics had been demonstrated during his school years in Bitola, so it was natural for him to enrol in the Mathematical Group of the Faculty of Natural Sciences and Mathematics.\nDimovski graduated in June\n1976\n, having competed the course in less than three years, continuing to demonstrate his outstanding abilities with an average grade of\n9\n.\n48\n. His undergraduate project had been supervised by Georgj Čupona who was interested in algebra, particularly in general algebraic systems and group theory and its generalisations. At the time that he was advising Dimovski, Čupona was working on representations of universal algebras and on quasigroups. Dimovski's project,\nAdditive semigroups of integers\n(\nMacedonian\n)\n, was an excellent piece of work and was published in\n1977\nby the\nMacedonian Academy of Sciences and Arts\n. In this work Dimovski studied decompositions of the semigroup of positive integers under addition.  He continued his studies at the University of Skopje, undertaking research for his Master's Degree advised by Smilka Zdravkovska.\nSmilka Zdravkovska was born in\n1947\nin Skopje. She won many mathematics prizes in the competitions she entered while at school. She studied at the University of Moscow from\n1964\nto\n1969\nand, returning to Skopje, she taught at the Mathematical Institute of the University while studying for her Master's degree. She went to England in January\n1971\nand, advised by\nFrank Adams\n, wrote the Ph.D. thesis\nTopological Objects in Homotopy Theory\n, being awarded the degree in\n1973\n. In January\n1974\nshe returned to the University of Skopje and, two years later, she began supervising Dimovski's Master's Degree. Dimovski worked as an associate at the Institute of Mathematics in Skopje in\n1976\nand\n1977\n. From\n1977\nto\n1980\nhe worked as an assistant at the Faculty of Mathematics. He submitted his thesis\nP-\n1\nlocalization-related CW-complexes\nand, in\n1979\n, he completed his master's degree in Mathematics with the defence of his thesis. We note that in September\n1979\nhis advisor Smilka Zdravkovska went to the United States where she later married\nAllen Shields\n.\nIn September\n1980\nDimovski enrolled in doctoral studies at the State University of New York at Binghamton, USA. His thesis advisor was Ross Geoghegan who had obtained his Ph.D. at Cornell University in\n1970\nwith the thesis\nTopological and Simplicial Properties of Function Spaces, and a Stability Theorem for Spaces of Homeomorphisms and Embeddings\n. Geoghegan was born in Dublin, Ireland, in\n1943\nand had studied at University College, Dublin, before undertaking research for his Ph.D. at Cornell. He was appointed to the State University of New York at Binghamton in\n1972\n. Dimovski submitted his Ph.D. thesis\nNon-simply connected Casson Handles\nand defended this doctoral dissertation in May\n1983\n. His dissertation was awarded a prize as the best in the year at the State University of New York at Binghamton. His\n160\n-page thesis was published in English in\n1984\nwith a Macedonian preface and summary. In fact, before submitting his thesis, Dimovski had published another paper, this one in English with a Macedonian summary, in\n1982\nentitled\nSome existence conditions for vector valued groups\n. This paper gave partial answers to questions asked by Georgj Čupona concerning the existence of finite\n(\nn\n,\nm\n)\n(n, m)\n(\nn\n,\nm\n)\n-groups and about the embeddability of commutative, cancellative\n(\nn\n,\nm\n)\n(n, m)\n(\nn\n,\nm\n)\n-semigroups in commutative\n(\nn\n,\nm\n)\n(n, m)\n(\nn\n,\nm\n)\n-groups, when\nm\nm\nm\nis not a divisor of\nn\nn\nn\n.\nReturning to Macedonia, Dimovski was appointed as an assistant professor in the Faculty of Mathematics and Natural Sciences of the University of Skopje in\n1984\n. He attended the fourth Yugoslav algebraic conference \"Algebra and logic\" held in Zagreb\n7\n-\n9\nJune\n1984\nand published the paper\nOn a class of vector-valued groups\nin the Proceedings of the conference, the paper being written jointly with Georgj Čupona. He published\nExamples of vector valued groups\nin the\n1985\nvolume of the\nMacedonian Academy of Sciences and Arts\nwhich only appeared in print in\n1987\n. He also attended the conference \"Algebra and Logic\", held in Cetinje, Montenegro,\n12\n-\n14\nJune\n1986\n, publishing two papers in the Proceeding of the Conference,\nFree vector-valued semigroups\nand\nOn\n(3\n,\n2)\n-groups\n. The first of these papers gave a combinatorial description of free vector-valued semigroups answering a question raised by Georgj Čupona in his\n1983\npaper in which he defined this class of semigroups. The second of these two papers is summarised by Dimovski as follows:-\nThe goal of this paper is to put together some known facts about\n(3\n,\n2)\n-groups. Some equivalent definitions for\n(3\n,\n2)\n-groups are given. It is mentioned that finite\n(3\n,\n2)\n-groups do not exist. An elementary proof that finite\n(3\n,\n2)\n-groups with less than\n12\nelements do not exist is given. At the end, it is shown that\n(3\n,\n2)\n-groups do exist, by giving a combinatorial description of a free\n(3\n,\n2)\n-group without generators. Such a group is countably infinite.\nDimovski was promoted to associate professor in\n1989\nand then, in\n1994\n, to full professor. In\n1990\nhe was a visiting professor at Cornell University in the United States from January to June, then moved to Carleton University in Ottawa, Canada, where he spent July, August and September. In addition to these\n1990\nresearch visits, he has made several others, visiting: the University of Michigan, Ann Arbor, USA; the University of Tennessee, Knoxville, USA; the Research Institute for Mathematical Sciences, Berkeley, USA; the\nStefan Banach\nMathematical Centre, Warsaw, Poland; Binghamton University, USA; the Mathematical Research Centre in Oberwolfach, Germany; the Mathematical Institute, Ljubljana, Slovenia; the University of Sofia, Bulgaria; the University of Warsaw, Poland; the University of Heidelberg, Germany; and Bangor University, Wales. In his career of\n40\nyears of teaching he lectured to graduate and postgraduate students at universities in Bitola, Štip and Priaština.\nHis scientific work includes: geometric and combinatorial topology\n(\nespecially\n4\n-manifolds, knots and clusters\n)\n; single parameter theory of fixed points; homogeneous compacts; dynamical systems; and algebra, topology and combinatorial vector value structures with applications to physics, statistics and computer science.\nFor his outstanding contributions, Dimovski was awarded the \"Goce Delčev\" state prize for\n1989\n, for the research results he had obtained in the fields of value vector algebra, topology and combinatorial structures. The Goce Delčev Award Board President said:-\n... the highest state award in Macedonia for outstanding scholarly contributions is a modest, but significant way of celebrating, promoting, and raising the awareness of the significance of academic work.\nDimovski is a Member of the Union of Mathematicians of Macedonia and its Management Board, the\nAmerican Mathematical Society\n, and the Balkan Mathematical Union and its Executive Board. On\n27\nMay\n2009\nhe was elected a full member of the\nMacedonian Academy of Sciences and Arts\n. In\n2014\nhe was named as one of the seven best scientists of the \"Saints Cyril and Methodius\" University of Skopje for his scientific achievements in\n2013\n.",
  "matematicos_citados_na_biografia": [
    "Macedonian Academy of Sciences and Arts",
    "Frank Adams",
    "Allen Shields",
    "Stefan Banach",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}