{
  "nome_completo": "Douglas Samuel Jones",
  "nome_curto": "Douglas Jones",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jones_Douglas/",
  "data_nascimento": "10 January 1922",
  "local_nascimento": "Corby, Northamptonshire, England",
  "data_morte": "26 November 2013",
  "local_morte": "Perth, Scotland",
  "summary": "Douglas Jones was an English mathematician known for his work in the field of electromagnetism. He spent many years as head of department at Dundee.",
  "biografia": "Douglas Jones\nwas the son of Jesse Dewis Jones\n(1887\n-\n1932)\nand Bessie Streather\n(1900\n-\n1992)\n. Jesse Jones, born in Little Harrowden, Northamptonshire, worked for Tarmac, a firm founded in\n1903\ndealing with road surfacing and building materials. Jesse married Bessie Streather\n(\nborn in Corby\n)\n, in Kettering, Northamptonshire, in\n1921\n. He became a general manager of Tarmac in the year Douglas was born and the family moved, first to Redcar, then to Bilston close to Wolverhampton where the Tarmac headquarters was situated. Douglas spent his childhood in Dale View, Wolverhampton Street, Bilston. He was the eldest of his parents' four children having a younger brother Gerald\n(\nborn\n1926\nand known as Jimy\n)\n, and two sisters Doris\n(\nknown as Dot\n)\nand Joyce\n(\nborn\n1929)\n.\nJesse Jones\n[\n16\n]\n:-\n... captained the village cricket team and played soccer for Nottingham Forest. He was also a keen gambler, playing cards\n(\nat which he invariably won\n)\nand attending greyhound race meetings\n(\nwhere he frequently lost\n)\n. He was also fond of horse racing, which he managed to attend more often than might be imagined because of his habit of working every day of the week including Sunday; this allowed him some flexibility in arranging time off.\nAfter World War I began, he enlisted on\n5\nJune\n1915\nand served in the Royal Fusiliers. He was severely wounded and, reaching the rank of Acting Corporal, he was discharged on\n24\nDecember\n1918\n. He was awarded the British War Medal and Victory Medal. Working for Tarmac he was manager of the works sports teams and, his wife being the club tennis champion, the whole family attended sports events whenever possible. Jesse recovered from pneumonia in\n1930\nbut contracted double pneumonia two years later and died on\n12\nJanuary\n1932\n, two days after Douglas's tenth birthday\n[\n16\n]\n:-\nJesse left behind the memory of a warm, loving, vigorous and kindly man, a house covered by an insurance policy, but no money; it had all gone on gambling but none on drink, for he was a strict teetotaller.\nFrom that time on, Bessie had to bring up her four children in extremely difficult circumstances. Douglas had attended Ettingshall Primary School from\n1927\nto\n1931\n. Leaving the Primary School he had begun his studies at the fee paying Wolverhampton Grammar School not long before the death of his father. The sudden change in his family's financial circumstances meant that he could only continue at the school if he won a scholarship but he was able to win a scholarship which, in addition to covering the fees, also gave him free lunches, free travel and a clothing allowance.  His brother and sisters became boarders at the Royal Wolverhampton School and their term-time expenses were completely covered. Of course Bessie still needed an income which she did as a shorthand teacher in the evenings and taking in lodgers to supplement her income.\nDespite the poverty, it was a happy childhood for the four children. Douglas excelled in Latin and Greek at the Grammar School and was advised to enter the Civil Service.  He took a full part in the school activities and became a Senior Prefect, House Captain, Captain of the Chess Team and the Cricket Team, and Vice Captain of the Soccer Team. Having obtained his School Certificate, he decided to spend one more year at the Grammar School to prepare for the Executive Class of the Civil Service. Competition for this was great and Douglas was not at all confident that he would make the grade so he decided to change from the Latin and Greek that he loved to mathematics. In some ways this was a strange choice since he was not fond of mathematics at school but his mother had enjoyed geometry at school and had persuaded her son to give it a try. At this stage he was still aiming at the Executive Class of the Civil Service.\nJones was still at school when World War II broke out in September\n1939\nand he had some military experience being in the Officers' Training Corps as part of his school activities. He now contributed to the war effort making gas masks and helping dig air raid shelters. Recruitment into the Civil Service stopped because of the war and Bessie suggested that her son should consider going to university. She had become a clerk and was earning more money than before but there was still no way she could support him through university. He took the examinations for the Mathematical Scholarship at Corpus Christi College, Oxford and was awarded the second scholarship. This would not have given him sufficient to attend Oxford University but he also won a Staffordshire Major Scholarship and was awarded a Kitchener Scholarship. He began his studies at Corpus Christi College, Oxford, but joined the Royal Air Force Volunteer Reserve in December\n1941\nand worked for the Signals Branch, later known as the Signals Radar Branch. He flew many missions in Boulton Paul Defiant planes sitting in the gun turret making measurements of German radar frequencies for jamming purposes\n[\n16\n]\n:-\nHis war service was recognised by the award of an MBE and by being Mentioned in Dispatches.\nBack at Oxford in\n1945\nhe attended lectures by\nHenry Whitehead\n, whom Jones described as the worst lecturer he ever experienced, and Ughtred Shuttleworth Haslam-Jones, whom he considered the best. Haslam-Jones\n(1903\n-\n1962)\nhad been a student of\nG H Hardy\nand had graduated with a D.Phil. in\n1928\nwith a thesis\nThe theory of functions of a complex variable\n. Jones' tutor was Frederick Bernard Pidduck\n(1885\n-\n1952)\nwho suggested that he try for a Commonwealth Fund Scholarship so that he could spend a year in the United States. Jones was successful and joined\nFreeman Dyson\n, the other successful candidate in\n1947\n. While still an undergraduate, Jones wrote\nNote on an electrostatic problem\nwhich was published in\n1948\n.\nGraduating from Oxford in\n1947\nwith an M.A., Jones spent the academic year\n1947\n-\n48\nat the Massachusetts Institute of Technology in the United States. Although his intention had been to work on electrical engineering advised by Julius Adams Stratton\n(1901\n-\n1994)\nhe discovered that Stratton was very busy and not interested in research students. He therefore studied courses on physics and, in particular, medical applications of physics\n[\n16\n]\n:-\nAt the end of this year Douglas went on a grand tour of the USA, visiting about\n40\nstates in the company of John Westcott\n(1920\n-\n2014)\n. It was a wonderful experience and he would have been tempted to seek a position had it not been for his desire to return to see his mother and the rest of the family. In addition, Douglas had secured an appointment as assistant lecturer at Manchester University\nWhen Jones was appointed to Manchester,\nSydney Goldstein\nwas head of the Mathematics Department. Also on the staff were\nMax Newman\n,\nJames Lighthill\nand\nAlan Turing\n.\nGoldstein\nleft Manchester in\n1950\nto become professor in Applied Mathematics and Chairman of the Department of Aeronautical Engineering at Technion in Haifa, Israel. At this time\nLighthill\nbecame the Beyer Professor of Applied Mathematics at Manchester. Jones published two papers in\n1950\n, namely\nDiffraction by a metal wedge at large angles\nwhich he coauthored with his Oxford tutor F B Pidduck, and\nNote on diffraction by an edge\nin which he wrote:-\nI wish to express my appreciation of some helpful comments by Professor\nS Goldstein\n.\nFor a complete list of Douglas Jones' publications, see\nTHIS LINK\n.\nOnce Jones' position in Manchester became permanent he was able to marry Ivy Styles on\n23\nSeptember\n1950\nin Bilston. Douglas and Ivy Jones had two children; Helen Elizabeth Jones\n(\nborn\n28\nMay\n1958)\nand Philip Andrew Jones\n(\nborn\n9\nFebruary\n1960)\n.\nIn\n1956\nJones spent time in New York at the\nCourant\nInstitute of Mathematical Sciences where he was a visiting professor. There he collaborated with\nMorris Kline\nand their joint work led to the important joint paper\nAsymptotic expansion of multiple integrals and the method of stationary phase\n(1958)\n. While he was in New York, Jones applied for the position of\nSimson\nProfessor of Mathematics at the University of Glasgow, Scotland, which would make whoever was appointed the head of the Department of Applied Mathematics, a new Department being set up by Glasgow. The other strong candidate for this position was\nIan Sneddon\nwho, after working in Glasgow, had taken up the chair of mathematics at the University College of North Staffordshire\n(\nwhich in\n1962\nbecame Keele University\n)\n.\nIan Sneddon\nwas appointed to the position in Glasgow in\n1956\nand this left the chair of mathematics at the University College of North Staffordshire vacant. Jones applied for this chair and was appointed, taking up position in\n1957\n[\n16\n]\n:-\nIt was at Keele that Douglas first showed his remarkable ability to balance outstanding leadership and commitment to administrative duties with mathematical research and scholarship. For a while as the head of department busily engaged in building on the work done by\nIan Sneddon\nto secure a lively and active department, and as Dean of Science from\n1959\nto\n1962\n, he continued his researches into high-frequency scattering and wrote his monumental\n807\n-page book 'The theory of electromagnetism'. This book alone would have cemented Douglas's reputation as world leader.\nFor extracts from reviews of Jones' books, see\nTHIS LINK\n.\nThe visit that Jones had made to the\nCourant\nInstitute of Mathematical Sciences in New York in\n1956\nhad been very successful and, in\n1962\n-\n63\nhe made a second, equally successful, visit. During this time he studied the problem of high-frequency diffraction by a circular disc which resulted in two important papers,\nDiffraction at high frequencies by a circular disc\n(1965)\nand\nDiffraction of a high-frequency plane electromagnetic wave by a perfectly conducting circular disc\n(1965)\n.\nQueen's College, Dundee, was at this time part of the University of St Andrews. Around\n1964\nthere was a move to found a Department of Applied Mathematics at Queen's College.\nNorrie Everitt\nwas the Baxter Professor of Mathematics in Dundee and head of the Department of Mathematics. Jones was appointed to the\nIvory\nChair of Applied Mathematics at Queen's College in\n1965\nand energetically began the task of building the Department of Applied Mathematics. For the first two years of his time in Dundee, Jones was on the staff of the University of St Andrews but on\n1\nAugust\n1967\nthe University of Dundee received its royal charter and became an independent university. Jones remained at Dundee for the rest of his career, holding the\nIvory\nChair for\n27\nyears until he retired in\n1992\n. He also served for a period as Dean of Science.\nA summary of Jones' contributions are given in\n[\n14\n]\n:-\nHis deep insight into the theory of electromagnetic waves and his development of new and exceptionally powerful mathematical techniques with which to study them has led to the resolution to problems of both practical and social importance. His work is fundamentally important to the design and performance of radar antennae in which it is necessary to optimise their receiving and transmitting characteristics. Douglas Jones also investigated the ways in which electromagnetic waves interact with objects having sharp edges. These studies are basic to the construction of stealth aircraft whose sharp geometrical shapes are designed to minimise the aircrafts radar signature.\nThere were other areas to which Jones made substantial contributions. One of these was mathematical biology where Jones had been influenced first by his experience at MIT in\n1947\n-\n48\nand then at Manchester where\nAlan Turing\nwas working on biological pattern formation. Together with\nBrian Sleeman\n, Jones published the textbook\nDifferential equations and mathematical biology\nin\n1983\n. For information about this book given by the publisher and for extracts from three reviews, see\nTHIS LINK\n.\nWe mentioned\nAlan Turing\n's influence on Jones in mathematical applications to biology but\nTuring\nalso gave Jones a deep interest in computers. When asked to address the Inter-University Committee on Computing's Colloquium in\n1983\nhe delivered\nFuture prospects\nin which he said\n[\n9\n]\n:-\n... when your kind invitation to address you was extended to me, the suggestion was made that I should attempt to assess where we were and peer into the murky bowl of the future to indicate the path we are about to tread. In the present foul political weather this is rather like batting when you can't see the other wicket let alone the bowler and since my only claim to distinction in computing is that I am one of the few people in this room who learned it from\nTuring\n, I am none too sure whether it is the game of cricket or tennis which engages us.\nJones wrote the two books\nAssembly Programming and the\n8086\nMicroprocessor\n(1988)\nand\n80\n×\n86\nAssembly Programming\n(1991)\n. For extracts from the Prefaces of these books see\nTHIS LINK\n.\nBrian Sleeman\nwrites in\n[\n16\n]\nabout Jones as his head of department:-\nOn my arrival I was immediately aware that teaching and scholarship in its widest form were of the highest priority. There was also no pressure on colleagues to write grant proposals but rather to pursue research for its own sake and to make original contributions. Douglas never directed the research of young staff but was always there to give encouragement and offer ideas. ... With regard to teaching back in Dundee, Douglas assigned lecturing duties that on the one hand one would enjoy and on the other he thought would be 'good for the soul'. ... he assigned to me a new course on approximation theory, which was being offered to the first graduate students on the new Numerical Analysis and Programming Masters Course. I knew absolutely nothing about approximation theory and thought that Douglas had made a mistake with the assignment. So, plucking up courage I decided to go and discuss the matter with him. After knocking on his door and waiting for the red light to turn blue, indicating entry, I was ushered in. 'Professor Jones,' I said, 'you have assigned the NAP course on approximation theory to me, but I know nothing about the subject.' His response was firm and short, 'Well you will do when you have given the course.'\nDouglas Jones made many other contributions to Mathematical Sciences. He served as chairman of the University Grants Council, and he was a founding member of the\nInstitute of Mathematics and its Applications\n, serving on the Council and as its President in\n1988\n.\nJones received many honours for his outstanding contributions. He was elected a fellow of the\nRoyal Society of Edinburgh\n(1967)\n, a fellow of the\nRoyal Society of London\n(1968)\n, awarded the Keith Prize by the\nRoyal Society of Edinburgh\n(1971\n-\n73)\n, given an Honorary DSc from the University of Strathclyde\n(1975)\n, awarded the Marconi Prize by the Institute of Electrical Engineers\n(1975)\n, made an Honorary Fellow of Corpus Christi College Oxford\n(1980)\n, awarded the Balthasar van der Pol Gold Medal by the International Union of Radio Science\n(1981)\n, awarded the Naylor Prize and Lectureship of the\nLondon Mathematical Society\n(1986)\n, elected a fellow of the Institution of Electrical Engineers\n(1989)\n, made a life member of the Institute of Electrical and Electronics Engineers\n(2013)\n.",
  "matematicos_citados_na_biografia": [
    "Henry Whitehead",
    "G H Hardy",
    "Freeman Dyson",
    "Sydney Goldstein",
    "Max Newman",
    "James Lighthill",
    "Alan Turing",
    "Goldstein",
    "Lighthill",
    "S Goldstein",
    "THIS LINK",
    "Courant",
    "Morris Kline",
    "Simson",
    "Ian Sneddon",
    "Norrie Everitt",
    "Ivory",
    "Brian Sleeman",
    "Turing",
    "Institute of Mathematics and its Applications",
    "Royal Society of Edinburgh",
    "Royal Society of London",
    "London Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}