{
  "nome_completo": "Walter Douglas Munn",
  "nome_curto": "Douglas Munn",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Munn/",
  "data_nascimento": "24 April 1929",
  "local_nascimento": "Kilbarchan, Renfrewshire, Scotland",
  "data_morte": "26 October 2008",
  "local_morte": "Troon, Scotland",
  "summary": "Douglas Munn was a Scottish mathematician who made important progress in semigroup theory.",
  "biografia": "Douglas Munn\nwas always known as Douglas, never using his first name of Walter. He did, however, always publish papers under the name \"W D Munn\". He was the son of Robert Tainsh Munn\n(3\nJanuary\n1893\n-\n23\nApril\n1945)\n, a railway official born in Johnstone, Renfrewshire, Scotland, and Elizabeth Stevenson\n(\nabout\n1897\n-\n1974)\nwho was a teacher. Robert Munn and Elizabeth Stevenson were married on\n22\nJuly\n1927\nin Linwood, Renfrewshire, Scotland. The witnesses to the marriage were David Stevenson and Agnes Stevenson. Douglas was the elder of his parent's two children having a younger sister Lesley. In\n[\n1\n]\nLesley writes about her family:-\nI was lucky to be brought up in a household where artistic creativity was taken for granted as simply part of everyday life. My parents, Robert and Elizabeth Munn, were both painters, he in watercolours, she in oils. Though neither was able to pursue a professional career as an artist\n(\nhe was a railway official, she a teacher\n)\n, they both worked to a high standard. As young adults both had been elected members of Paisley Art Institute, whose ranks included at one time such luminaries as Sir Muirhead Bone and Sir John Lavery. ... Douglas\n(\nmy senior and only sibling\n)\nhad a distinguished academic career as a \"pure mathematician\" - the kind, he would engagingly explain, who functioned with pencil and paper, and whose intellectual undertakings had no practical application whatsoever\n(\nbut had a strong aesthetic content\n)\n. My earliest memories are of his accomplished piano playing; already in his early teens he was composing piano music, much influenced by Chopin and hauntingly melodic. His music became more astringent as he grew older. A selection of his compositions is lodged in the Scottish Music Centre in Glasgow.\nYou can read a poem by Lesley Duncan about her brother Douglas at\nTHIS LINK\n.\nMuch of the following is taken from the article\n[\n4\n]\nJohn Howie\ngave me\n[\nEFR\n]\nafter Douglas died which closely follows his article\n[\n3\n]\n. John writes that Douglas was born in Troon, a town in South Ayrshire, Scotland, situated on the coast about eight miles north of Ayr. The same claim appears in\n[\n5\n]\n. The official records, however, state that Douglas was born in Kilbarchan, Renfrewshire, Scotland, which is where his parents were living at the time. Certainly the family moved from Kilbarchan to Troon where Douglas was brought up.\nDouglas attended Marr College, Troon, Scotland, a secondary school built around\n1935\non Dundonald Road, Troon, with money left in the will of Charles Kerr Marr. When Douglas studied there it was a direct-grant school run by a board of governors which, following Marr's wishes, gave free education to everyone irrespective of their background. The school is now the responsibility of South Ayrshire Council. After secondary schooling, Douglas proceeded to the University of Glasgow, where in\n1951\nhe graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy. When Douglas studied there\nThomas MacRobert\nheld the chair of mathematics, a position he had held since\n1927\n.\nThomas Graham\nwas lecturing at the University of Glasgow at this time. Douglas lived in Troon while an undergraduate at Glasgow but, with his student friends, often went to Glasgow on Saturday nights to hear the Scottish National Orchestra. In fact, in addition to his studies of mathematics and physics, he had taken courses on music and English while an undergraduate. He was awarded the Logan Prize as the outstanding arts graduate of the year\n1951\n.\nAs was not uncommon in Glasgow at that time, he transferred to Cambridge for postgraduate study. At St John's College Cambridge, he developed lifelong friendships with two other mathematics graduate students, Hans Liebeck and\nRoger Penrose\n. The syllabus in Glasgow had contained no abstract algebra, but in Cambridge he attended lectures by\nPhilip Hall\nand\nDavid Rees\n.\nRees\nhad by then ceased to work in semigroup theory\n(\nand\nSandy Green\n, another of the notable early contributors to the subject, had by then left Cambridge\n)\n, but Douglas's attention was drawn to\nRees\n's classical\n1940\npaper, and his interest was aroused. It was, however, his discovery of\nAl Clifford\n's work that finally won him over. His thesis,\nSemigroups and their algebras\n, earned him a Ph.D. in\n1955\n. A paper based on his thesis was published in\n1955\nand, in the same year, a joint paper\nA note on inverse semigroups\nwritten with\nRoger Penrose\n. The first of these has an Introduction which begins as follows:-\nIn the classical theory of representations of a finite group by matrices over a field F, the concept of the group algebra\n(\ngroup ring\n)\nover F is of fundamental importance. The chief property of such an algebra is that it is semisimple, provided that the characteristic of F is zero or a prime not dividing the order of the group. As a consequence of this, the representations of the algebra, and hence of the group, are completely reducible. In the present paper we discuss a more general concept, the algebra of a finite semigroup over a given field. Our main task is to find necessary and sufficient conditions for such an algebra to be semisimple, and to interpret some of the results of this investigation in terms of representation theory.\nThe paper also contains the following Acknowledgement:-\nI should like to express my gratitude to Dr D R Taunt for his encouragement and extremely helpful criticisms, and to thank Mr\nD Rees\nfor suggesting in the course of conversation the result of\n4\n.\n7\n. I am also indebted to the Carnegie and Cross Trusts for grants.\nThere followed a brief sojourn as a Scientific Officer in the Royal Scientific Naval Service in Cheltenham, where he was sent to GCHQ for his National Service. Norman Reilly writes about Douglas's contributions to GCHQ in\n[\n7\n]\n:-\nDouglas took the signing of the Official Secrets Act extremely seriously and never himself revealed anything of his work there. Such information as we have has been provided by GCHQ itself. He spent most of\n1955\nthere, returning as a consultant once or twice each year for periods of up to three months at a time until\n1963\n. He even established sufficient seniority to be eligible for\n1\nst class\n(\nas opposed to\n2\nnd class\n)\nrail fare to and from Troon, a true indicator of success when in government service! However, it was serious business at GCHQ, which describes itself on its web-site as \"an intelligence and security organisation\". It boasts of having discovered trap door functions, public key encryption and what is now known as RSA encryption, the main underpinning of the security of internet transactions, several years before such schemes were openly proposed in the USA. From discretionary release of retained GCHQ records by the GCHQ historian, it is evident that Douglas was engaged in \"trying to push the art\n[\nof using computers\n]\nto the limit and consider the limitations of the\n[\nthen\n]\npresent\n[\ncomputers\n]\nand\n[\nthe\n]\nrequirements of future computers\". His work \"engaged mathematical problems and problems that fringed into mathematical logic\". He understood the engineering limitations of the machines of the day and how to get around their logical constraints. It seems fair to say that his GCHQ activities kept him at the leading edge of computing developments.\nThe attraction of the academic life proved too strong to be resisted, and in January\n1956\nhe joined the faculty at his Alma Mater. What he did at GCHQ we are not allowed even to speculate\n(\nbut Norman Reilly did, see above!\n)\n, but he enjoyed the experience, and when he returned to academic life he did from time to time\n(\nmostly when facing a huge load of examination papers to mark\n)\ncomment that he might have been better to stay there.\nJohn Howie\nwrites in\n[\n5\n]\nthat Douglas did not stay junior at the University of Glasgow for long and:-\n...  in\n1966\nhe was appointed to the chair of mathematics in the fledgling University of Stirling, by which time he was also a Fellow of the\nRoyal Society of Edinburgh\n. I followed him a year later, and for the session\n1967\n-\n68\nwe were the mathematics department. We were the music department as well: no provision had been made for music, and the two of us had to take action. Munn, leading from the front, gave great encouragement to talented students in organising chamber music. I conducted a choir - with Munn as one of my basses.\nIn fact, apart from the seven year period\n(1966\n-\n73)\nat the University of Stirling, and various short periods of leave\n(\nnotably the Session\n1958\n-\n59\nspent with\nAl Clifford\nat Tulane University\n)\nhe worked at the University of Glasgow for all of his professional life. He was appointed\nThomas Muir\nProfessor of Mathematics in\n1973\n, holding this chair until he retired in\n1996\n.\nDouglas did his duty as a committee man, serving for four years on the Council of the\nLondon Mathematical Society\nand for a short period on the Council of the\nRoyal Society of Edinburgh\n, and taking his turn as President of the\nEdinburgh Mathematical Society\n(1984\n-\n85)\n. It is fair to say, however, that his heart was never really in that sort of thing, for it took him away from the two great enthusiasms of his life, pure mathematics and music. Those of us who have had the privilege of hearing him play the piano know of his skill and of how committed he was to music. All who have read his papers and heard his lectures know also of his ingenuity, of his exceptional gifts as an expositor and of his commitment to mathematics. One female mathematician, who perhaps had better remain anonymous, declared that she had fallen in love with Professor Munn long before she met him, just by reading his papers!\nIt is possible to discern certain phases in Douglas's mathematical output. His original interest, arising out of his Ph.D. work, was in semigroup algebras and matrix representations, though even then the work involved what might be called 'pure' semigroup theory. While that interest never entirely disappeared, it is clear that by the mid sixties he was concerned primarily with inverse and regular semigroups. The explicit description in\nA class of irreducible matrix representations of an arbitrary inverse semigroup\n(1961)\nof the minimum group congruence on an inverse semigroup, though foreshadowed by work of Vagner and\nRees\n, was a major step forward, and what is now called the Munn semigroup of a semilattice opened a complete new chapter in the study of inverse semigroups. A series of papers between\n1966\nand\n1973\nexploring these ideas gave rise to results that are now regarded as classical. Then in\n1974\nhe published his hugely influential paper on free inverse semigroups, laying the foundations of a graphical approach that is now part of the essential armoury of the modern practitioner. Throughout the seventies he continued to make crucial contributions to the understanding of regular and inverse semigroups. His discovery of Passman's books on infinite group rings brought about a further change in the main thrust of his work, and in the eighties, while still writing the occasional paper on pure semigroup theory, he returned to the study of semigroup algebras, publishing a series of remarkable papers linking semigroup properties to ring-theoretic properties of their algebras. It is clear that this phase is not yet at an end, and that we can hope for many more contributions. I\n[\nJohn Howie\n]\nwould like to end with an excerpt of a letter from Norman Reilly, Douglas's first PhD student. It reveals the quality of mind and level of commitment that lies behind Douglas's achievement:-\nWhen I entered first year at Glasgow University, I was already interested in mathematics, but just as interested in physics and chemistry. Douglas was one of my first year instructors and the contrast between his lectures and those in the other courses that I was taking was like night and day. He brought the same preparation and clarity to his undergraduate lectures then that he still demonstrates in his conference presentations. I have no doubt that that experience was an important factor in my subsequently choosing mathematics over the other sciences and for my later choice of Douglas as a supervisor.\nThe meticulous care with which he prepared his lectures was typical of how he approached all his tasks, especially the reading and writing of papers. Any paper that he read was considered in the minutest detail for every grain of insight that could be gleaned from it. Each of his own papers would go through many rewritings before reaching a level of presentation that he found acceptable. This was great training for a student and taught me the value of understanding papers thoroughly, not just the stated results, but also the why and the wherefore of their workings.\nOn visits to Troon, we would occasionally go for walks among the dunes along the front there. It seemed a great place to go when struggling with a piece of mathematics. However, he always gave me the impression that he did his best work on the train going up to Glasgow and back. I think that he did it in the margins of the Glasgow Herald!\nDouglas Munn married Clare\n(\nborn April\n1936)\n, an accomplished musician and piano teacher, Sydney, Australia, in\n1980\n. He had met Clare while on a visit to Sydney in the mid-nineteen seventies and, for the next few years, made regular trips to Sydney.\nMunn was one of its early directors of St Mary's Music School in Edinburgh and served for\n26\nyears, from\n1974\nto\n2000\n. Even when no longer formally involved with the school, Munn attended its concerts and continued to support it with enthusiasm. In retirement, he continued with mathematical research, and he showed great courage in his final illness, a five year struggle with cancer.\nMunn's mathematical contributions were summarised above\n(\ntaken from\nJohn Howie\n's description\n)\nbut we end by giving Norman Reilly's overview\n[\n7\n]\n:-\nHe published over eighty highly influential papers on semigroups and their algebras. Munn algebras, Munn graphs and Munn semigroups, just three of his many ideas, are known to all who work in these areas. His papers were renowned for the clarity of their exposition. He would revise them and polish them like a jeweller cutting and polishing a precious stone. He would not be satisfied until the results were optimal and shone to best advantage. His lectures, whether to research conferences or first year calculus classes, were similarly well crafted and shaped. His papers and lectures set a standard to which we all could aspire. The main focus of his work was on semigroup algebras and matrix representations of semigroups, though he also developed a strong interest in the more purely algebraic theory of semigroups about which he wrote many influential works. His very first published paper concerned semisimplicity of semigroup algebras. By that time, he had met\nGordon Preston\nwho told him about the class of inverse semigroups and Douglas's second published paper was about the axioms for inverse semigroups and appeared in the very same volume of the Proceedings of the Cambridge Philosophical Society as his first paper. This second paper was a joint work with\nRoger Penrose\n(\nlater Sir Roger Penrose\n)\n, who was interested in generalised inverses of matrices at the time. Both themes\n(\nsemigroup algebras and abstract theory\n)\npersisted in his work until his last few years when his interests seemed to return once again to his first love in semigroup algebras and he enjoyed a successful collaboration with Michael Crabb.\nSome highlights of Munn's mathematical research are described in more detail by John Fountain in\n[\n2\n]\n.\nYou can read\nJohn Howie\n's\nScotsman\nObituary of Douglas Munn at\nTHIS LINK\n.\nYou can read\nJohn Howie\nand Lesley Duncan's\nHerald\nObituary of Douglas Munn at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "John Howie",
    "Thomas MacRobert",
    "Thomas Graham",
    "Roger Penrose",
    "Philip Hall",
    "David Rees",
    "Rees",
    "Sandy Green",
    "Al Clifford",
    "D Rees",
    "Royal Society of Edinburgh",
    "Thomas Muir",
    "London Mathematical Society",
    "Edinburgh Mathematical Society",
    "Gordon Preston"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}