{
  "nome_completo": "Dudley Weldon Woodard",
  "nome_curto": "Dudley Woodard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Woodard/",
  "data_nascimento": "3 October 1881",
  "local_nascimento": "Galveston, Texas, USA",
  "data_morte": "15 July 1965",
  "local_morte": "Cleveland, Ohio, USA",
  "summary": "Dudley Woodard was an American mathematician and educator who was the second African-American to earn a PhD in Mathematics.",
  "biografia": "Dudley Woodard\n's parents were Dudley R Woodard\n(1858\n-\n1941)\nand Geneva Anderson\n(\nborn\n1865)\n. Dudley R Woodard, born in Atlanta, Georgia, worked as a Railway Mail Clerk. He married Geneva Anderson on\n8\nMarch\n1881\nin Galveston, Texas and their first child was Dudley Weldon Woodard, the subject of this biography. Dudley R Woodard married his second wife Lulu Worthy on\n7\nDecember\n1893\nin Pike, Georgia. He married his third wife Cora L Smith on\n10\nJune\n1896\n. He had several children with his second and third wives.\nDudley Woodard, the subject of this biography, was known as \"Dee.\" Although he grew up at a time when African Americans were segregated and had poor educational prospects, he stated later in life:-\nI do not recall feeling disadvantaged while growing up.\nThis can only mean that when he was a child his family supported him and made him feel that he had talents which, of course, he did. His father with a job as a Railway Mail Clerk was better off than most African Americans at this time. His primary and secondary education was in Texas, partly in Galveston and partly in San Antonio, Texas, where he was living when\n13\nyears old. In the\n1900\ncensus, Woodard is living in Galveston, but not with his family, for he is a boarder at the house of Shiloh Morgan on\n29\nth Street. The household consists of Morgan, his wife, their three sons, three daughters and five boarders. His father, married to Cora by the time of the\n1900\ncensus, was living in Austin. Texas. The data is a little confused since Woodard's father was born on\n20\nFebruary\n1858\nbut appears on the\n1900\ncensus form as being born in February\n1861\n. Perhaps he pretended to his new wife that he was three years younger than he actually was. Later in the year\n1900\n, Woodard moved to Ohio to study at Wilberforce College which had been founded by Methodists in\n1856\nto educate African Americans, particularly to train them as teachers. It is now Wilberforce University, achieving university status in\n1965\n.\nWoodard graduated from Wilberforce College in\n1903\nwith an A.B. in mathematics. He was admitted to the University of Chicago where he was awarded a B.S. in\n1906\nand an M.S. in the following year. His Master's thesis was entitled\nOn certain loci connected with the problem of two bodies\n. After the award of his Master's degree, Woodard was appointed to the Tuskegee Institute where he taught from\n1907\nto\n1914\n. The Tuskegee Institute, in Tuskegee, Alabama, had been founded in\n1881\nas the Tuskegee Normal School for Colored Teachers. The President of the Tuskegee Institute was Booker T Washington, at that time a prominent African American educationalist who argued for a industrial and technical type education for African Americans.\nA year after he began teaching at the Tuskegee Institute, Woodard married Gertrude Lee Hadnott in Birmingham, Jefferson County, Alabama on\n4\nAugust\n1908\n. Woodard's age on the Marriage License is is given as\n27\n(\nhe was actually still\n26)\nand Gertrude's age is given as\n25\n. They were married by Rev James Brown. On\n29\nJune\n1909\nDudley and Gertrude Woodard had a son Dudley Hadnott Woodard\n(1909\n-\n1996)\n. At the\n1910\ncensus Woodard is living in a rented house outside the town of Tuskegee with his wife Gertrude and new baby Dudley H. Note that in\n1900\nhis race is given as \"black\" but in\n1910\nas \"mulatto\"\n(\ni.e. mixed race\n)\n.\nWhile at Tuskegee, Woodard published\nNegro progress in a Mississippi town, being a study of conditions in Jackson, Mississippi\n(1909)\n,\nPractical Arithmetic\n(1911)\n, and\nThe Teaching of Geometry at Tuskegee\n(1913)\n. The book\nPractical Arithmetic\nshows that the Tuskegee Institute was following closely the industrial and business approach which Booker T Washington believed was the correct way to educate blacks. Here is the beginning of the 'Introductory Note' written by J R E Lee, the series editor:-\nIn presenting this volume the author endeavours to set forth matter which will give training and drill in all of the fundamental processes of arithmetic. The matter contained herein has all been taken by Mr D W Woodard, the author, from the industrial and business operations of the Institute. He has visited every department of the Institution, has examined all the books, and has had numerous conferences with every instructor. He has not found a single practical, workable operation in arithmetic that has not ben exemplified in some of the work connected with the Institution. The problems are therefore local in their setting. The Accounting Department, the Mechanical department with its various construction operations, and the Agricultural Department, through its planting, harvesting and productive endeavours, together with the various industries for the training of young women, have all furnished the material for the operations in this volume.\nThe title page gives the author as Dudley W Woodard, Head of Division of Mathematics, Tuskegee Normal and Industrial Institute. Woodard's Preface begins as follows:-\nThis book has been prepared in response to a long felt need of the students of the Tuskegee Normal and Industrial Institute. At this institution, the attempt is made to connect the arithmetic in a vital manner with the everyday interests and exercises of the students. The subject is presented as a necessary tool for doing certain things, for solving specific problems. Under this conception of the function of arithmetic, the course centres about the problems. Attention is called to the very large number of problems in which the data must be gathered at first hand by teacher and student. In fact, it is impossible to carry out the purposes of this book within the narrow confines of the classroom.\nIn\nThe Teaching of Geometry at Tuskegee\n, Woodard begins with an example of the character of geometry teaching at the Tuskegee Institute which again shows how education at the school was highly technical rather than academic:-\nOne day a group of Tuskegee students was engaged in putting the finishing touches to a new building on the Institute grounds. To one young man, who was learning the carpenter's trade, was assigned the work of laying some molding. For quite a while he pursued his work quickly and successfully. then his job led him to a certain corner of the building which deviated considerably from the usual right angle. What was he to do? Never before had he laid molding round such a corner. Now the problem consisted in finding the angle for cutting the molding so as to make a proper fit. Failing to think out the problem, the student by a trial and error method was finally able to make the molding fit as desired. But this trial and error method involved not only a loss of time but also a waste of material. This happened in Friday, a day on which this particular carpenter was wholly engaged in industrial work. According to the Tuskegee system, a \"day\" student in a week spends three days at his trade and three days in academic work, the \"trade\" days alternating with the \"academic\" days. On the day after the incident mentioned, the student reported the affair to his class in geometry. After he had attempted to give a statement of his difficulties, the class visited the scene of the event. Again the student explained the situation. Finally, a method was worked out on the spot whereby the molding could be cut without waste. But the method arrived at, while it eliminated all waste, was unsatisfactory in that it was very slow in operation. On the next \"academic\" day the problem was again discussed and referred for further discussion to a committee of three carpenters\n(\nstudents\n)\nwho were members of this class in geometry. This committee consulted the instructors in carpentry and all other available sources of information. Altogether three methods were propose for the task. A model representing the corner of the room was brought into the classroom together with pieces of molding, a saw, and the like. Each method was actually exhibited before the class and the geometrical principles concerned in each were thoroughly discussed.\nIn\n1914\n, Woodard left the Tuskegee Institute and became a teacher at Wilberforce College where he had himself studied as a student. On\n12\nSeptember\n1918\nhe completed a Registration Card in which he is described as follows: Height - Medium; Build - Slender; Colour of Eyes - Grey; Colour of Hair - Brown. He taught at Wilberforce until\n1920\nwhen he was appointed as a lecturer at Howard University. He served at Howard as Dean of the College of Arts and Sciences\n[\n4\n]\n:-\nIn the early\n1920\ns Dudley Woodard began taking advanced mathematics courses in the summer sessions at Columbia University. It then became clear that he was among the gifted mathematicians in the nation.\nIn\n1927\n, at the age of\n46\n, he took research leave from Howard University and enrolled in the Graduate School of the University of Pennsylvania to undertake research for a Ph.D. in mathematics. At the University of Pennsylvania, he was advised by John Robert Kline\n(1891\n-\n1955)\nwho had been a Ph.D. student of\nRobert Lee Moore\nand had been appointed to the University of Pennsylvania in\n1920\n. Woodard was awarded a Ph.D. on Wednesday,\n28\nJune\n1928\n, for his thesis\nOn Two-Dimensional Analysis Situs with Special Reference to the Jordan Curve Theorem.\nWe note that 'analysis situs' is the topic which today is called 'topology'. To get an idea of the content of the thesis we quote from the Introduction:-\nR L Moore\n, in his paper, \"On the Foundations of Plane Analysis Situs\", Transactions of the\nAmerican Mathematical Society\n, Volume\n17\n,\n1916\n, proposed three systems of axioms,\nS\n1\n,\nS\n2\n,\nS\n3\nS_{1}, S_{2}, S_{3}\nS\n1\n​\n,\nS\n2\n​\n,\nS\n3\n​\n, for the development of two-dimensional analysis situs. ... In Axiom\n8\n, which belongs to all three systems,\nMoore\nassumes that every simple closed curve is the boundary of at least one region, that is, that every simple closed curve defines a bounded connected set of connected exterior having further properties implied by certain other axioms of the three systems. The chief purpose of this investigation is to replace\nMoore\n's Axiom\n8\nby another axiom of such nature that no property of the simple closed curve is assumed. The\nJordan\ncurve theorem in its most general form appears as the fundamental theorem of the set of theorems. Two systems, I and II, are presented. It is proved that\n(1)\nall of\nMoore\n's theorems follow as consequences of each of the systems of axioms,\n(2)\nevery simple closed curve is the boundary of a set of points having all the properties of a region,\n(3)\nevery space satisfying the set designated as Axiom I is homeomorphic with the Euclidean plane and\n(4)\nthere exist spaces satisfying Axiom II that are \"neither metrical, descriptive, nor separable\". The proof of the\nJordan\ncurve theorem for spaces of the type described in\n(4)\nconstitutes perhaps the most interesting result in the development that follows. ... I wish to express my deep obligation to Dr J R Kline who suggested the problem and whose helpful criticism has been of inestimable value.\nWe note that with the award of a Ph.D., Woodard became the second African American to be awarded a Ph.D. in mathematics\n(\nthe first was\nElbert Frank Cox\nin\n1925)\n. He returned to Howard University in Washington D.C.. In the\nWashington, District of Columbia, City Directory\nof\n1929\nhe is listed as living at\n127\nWest Street North West with his wife Gertrude Woodard. His son by this time was\n20\nyears old and was no longer living with his parents.\nIn\n1929\nWoodard established a Master of Science programme in mathematics at Howard University. One of the first students on the course was William\nWaldron Schieffelin Claytor\n.\nClaytor\nhad entered Howard University in September\n1925\nwhere he was taught by Woodard. He graduated with a B.S. in mathematics in\n1929\n, joining the M.S. course in the first year that it ran. Advised by Woodard,\nClaytor\ntook the courses offered on group theory, topology, number theory, real analysis and complex analysis. He graduated with an M.S. in\n1930\n, one of the first students to be awarded an M.S. from Howard University.\nWoodard achieved other important things at Howard. He\n[\n9\n]\n:-\n... obtained the necessary resources and administrative support for a mathematics library, and sponsored visiting professorships and scholarly seminars. When he retired in\n1947\nas chairman of the department, he had led Howard's mathematics faculty through a quarter century of steady advancement. In an age of discrimination, Dudley Weldon Woodard had competed and triumphed in the face of overwhelming odds. Penn is proud to claim him among its most distinguished alumni.\nIn many ways he was the highest achieving African American in his day. He published two papers,\nOn two dimensional analysis situs with special reference to the Jordan Curve Theorem\nin the prestigious journal\nFundamenta Mathematicae\nin\n1929\nand the paper\nThe characterization of the closed N-cell\nin the equally prestigious journal\nTransactions of the American Mathematics Society\nin\n1937\n. These are considered the first mathematics papers by an African American to be published in a top class mathematics journal.\nWe get an idea of Woodard's character from the following quote\n[\n11\n]\n:-\nAmong his colleagues and students, Woodard excelled and was very popular as professor and as an administrator. Additionally, he was apparently highly respected by those who knew him in the mathematical sciences community.\nDeane Montgomery\n, former president of the\nAmerican Mathematical Society\nand the\nInternational Mathematical Union\ndescribed Woodard as, \"an extremely nice man, well-balanced personally.\"\nLeo Zippin\n, who was an internationally known specialist in Woodard's field, said that he was \"one of the noblest men I've ever known.\" Dr Woodard was not only a brilliant mathematician, but a man of high intelligence and dignity; he enjoyed life in spite of his racial environment. He used the phrase, \"black is beautiful\" in the\n1930\ns; he often ignored the \"colored\" signs and visited any men's room of his choice. He also ate at many \"nice\" restaurants and enjoyed the theatres of his choice in New York. He and his family once moved in what had been an all-white neighbourhood because it was aesthetically nice and it was near Howard.\nIn April\n1942\n, Woodard completed a Registration Form. At this time he was\n60\nyears old. He his described as a Negro,\n5\n'\n10\n\" tall,\n152\nlbs weight, Grey Hair, and Light Brown complexion.\nHe lived for nearly\n20\nyears after retiring and died in his home in Cleveland Ohio.\nThe National Association of Mathematicians honours Woodard with the\nClaytor\n-Woodard Lectures. For information about these lectures, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Robert Lee Moore",
    "R L Moore",
    "American Mathematical Society",
    "Moore",
    "Jordan",
    "Elbert Frank Cox",
    "Waldron Schieffelin Claytor",
    "Claytor",
    "Deane Montgomery",
    "International Mathematical Union",
    "Leo Zippin",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}