{
  "nome_completo": "Edmond Bour",
  "nome_curto": "Edmond Bour",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bour/",
  "data_nascimento": "19 May 1832",
  "local_nascimento": "Gray, Haute-Saône, France",
  "data_morte": "9 March 1866",
  "local_morte": "Paris, France",
  "summary": "Edmond Bour was a French mathematician and engineer who made  significant contributions to analysis, algebra, geometry and applied mechanics.",
  "biografia": "Edmond Bour\n's father was Joseph Bour and his mother was Gabrielle Jeunet. The family were not particularly well off but Edmond had a good education in Gray before going to Dijon to complete his education and to take the entrance examinations of the École Polytechnique.\nHaving been accepted for admission to the École Polytechnique, Bour entered in\n1850\n. His time there was one of the highest level of achievement and he graduated in\n1852\nin the first place. Bour continued his studies at the École des Mines in Paris and worked on a major paper\nSur l'intégration des équations différentielles de la mécanique analytique\nⓉ\n(\nOn the integration of the differential equations of analytical mechanics\n)\nwhich was read before the\nAcadémie des Sciences\non\n5\nMarch\n1855\nand published in the\nJournal de mathématiques pures et appliquées\n.\nWhile at the École des Mines Bour wrote two doctoral theses. Both were on celestial mechanics, one on the\nthree body problem\nand the other on the theory of attraction. Both were presented to the Faculté des Sciences in Paris on\n3\nDecember\n1855\nand were outstanding pieces of work. They were published twice, once in\n1855\nas a separate work, then again in\n1856\nin the Journal de l'École Polytechnique.\nBefore his theses were submitted, Bour was already qualified as a mining engineer. This was in July\n1855\nand he was appointed as professor of mechanics and mining at the École des Mines in Saint-Étienne. This was an appointment that he held for only a year before returning to Paris when he accepted a professorship at the École des Mines there. He also was appointed professor at the École Polytechnique. Bour had made a remarkable start to his career which was to reach even greater heights.\nHe received the mathematics prize of the\nAcadémie des Sciences\nin\n1861\nfor a paper\nThéorie de la déformation des surfaces\nⓉ\n(\nTheory of deformation of surfaces\n)\n. This work\n[\n1\n]\n:-\n... in line with the analogous studies of\nBonnet\nand\nCodazzi\n, contained several theorems on ruled surfaces and minimal surfaces; but in its printed version this work does not include the test for the integration of the problem's equations in the case of surfaces of revolution, which had enabled Bour to surpass the other competitors for the Academy's grand prize.\nThe one disappointment in Bour's short life was his failure to win election to the\nAcadémie des Sciences\nin April\n1862\nwhen\nBonnet\nwas elected in preference to Bour. Because of this Bour turned to concentrate entirely on the mechanics course that he was teaching at the École Polytechnique.\nBour made many significant contributions to analysis, algebra, geometry and applied mechanics despite his early death from an incurable disease. His remarkable achievements were cut short at the age of\n33\nand as a consequence Bour is hardly known in the history of mathematics whereas one feels that if he had been given the chance to continue his outstanding work he would today be remembered as one of the major figures in the subject.",
  "matematicos_citados_na_biografia": [
    "Académie des Sciences",
    "three body problem",
    "Bonnet",
    "Codazzi"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}