{
  "nome_completo": "Edmund Georg Hermann Landau",
  "nome_curto": "Edmund Landau",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Landau/",
  "data_nascimento": "14 Feb 1877",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "19 Feb 1938",
  "local_morte": "Berlin, Germany",
  "summary": "Landau gave the first systematic presentation of analytic number theory and wrote important works on the theory of analytic functions of a single variable.",
  "biografia": "Edmund Landau\n's father Leopold Landau was a gynaecologist who was both a patriotic German and someone who was politically active in support of the Jewish cause. Edmund Landau's mother, Johanna Jacoby, was from the Jacoby family of leading bankers. Edmund was born into a wealthy family who were well connected, so he grew up knowing the important people in Berlin. He was brought up in the Jewish faith and, like his father, came to be a German nationalist with Zionist beliefs. From a young age Edmund showed remarkable talents. There is a story that he was a child prodigy\n[\n3\n]\n:-\nLegend has it that at the age of three, when is mother forgot her umbrella in a carriage, he replied, \"It was number\n354\n,\" and the umbrella was quickly re-acquired.\nLandau attended the French Lycée in Berlin, graduating at the age of\n16\nwhich is two years earlier than was normal. He then studied mathematics at the University of Berlin. His doctoral work there was supervised by\nFrobenius\n, and Landau received his doctorate in\n1899\nfor a thesis on\nnumber theory\n. Landau was always interested in mathematical puzzles and even before he received his doctorate he had published two books on mathematical problems in chess. On\n9\nJune\n1900\nhe wrote a letter from Paris, where he was studying, to\nHilbert\ngiving an outline of his ideas for proving the prime ideal theorem for\nalgebraic number fields\n.\nHe submitted this\nhabilitation\nthesis in\n1901\n, only two years after his doctorate, consisted of his work on\nDirichlet\nseries, a topic in\nanalytic number theory\n.\nFrobenius\nwas somewhat critical of the area that Landau worked in, and remarked at times that Landau's work would cease to become important if the\nRiemann hypothesis\nwere proved. There is little doubt that\nFrobenius\nwas quite wrong in his assessment of Landau's mathematical talents, but this did not affect Landau's self-confidence in any way.\nLandau taught at the University of Berlin as a\nprivatdozent\nfrom\n1899\nuntil\n1909\n. During this period his publication list grew rapidly, so that by\n1904\nhis publications exceeded his age of\n27\nand by\n1909\nhe had nearly\n70\npapers in print. While at Berlin his ability to teach became clearly evident. He taught courses for beginners, which he did not have to do, and also lectured on his own speciality of number theory. In addition he gave lecture courses on the foundations of mathematics,\nirrational numbers\n, and set theory. Schappacher notes in\n[\n9\n]\nhowever:-\n... it should also be said that he tended not to have cordial relationships with his students, being rather an aloof person.\nIn\n1909\nhe was appointed to an ordinary professorship at Göttingen as successor to\nMinkowski\n. He had\nHilbert\nand\nKlein\nas colleagues at Göttingen until\nKlein\nretired in\n1913\n. The successor to\nKlein\nwas not easily found.\nCarathéodory\ncame and went in less than three years while he was followed by\nHecke\nwho also left quickly in\n1919\n. Landau worked hard to have\nSchur\nfill the chair but, against Landau's wishes,\nCourant\nwas appointed. However, despite his outstanding talents as both a teacher and researcher, Landau managed to annoy many of his colleagues at Göttingen with his somewhat arrogant manner. Segal writes in\n[\n3\n]\n:-\nLandau was also something of a cynical snob. The story is well known that he used to tell people who would ask for his address in Göttingen, \"You'll find it easily; it's the most splendid house in the city.\"\nWe give some examples of how he annoyed his colleagues. Usually it was because he privately, and often publicly, criticised their results, although one would have to say that Landau was extremely knowledgeable and was almost always mathematically correct\n[\n3\n]\n:-\nLandau was a mathematician of encyclopaedic knowledge of the literature in his special areas of expertise, meticulous to a fault, and always devoted to finding the simplest possible result.\nAfter\nKoebe\nand\nBieberbach\nhad disputed in\n1921\nthe significance of certain results each had published, Landau entered the argument the following year by writing a joint letter to the two of them in which he said that\nKoebe\nwas the more correct of the two, but still not correct enough. He also published simplified proofs of some theorems of\nBieberbach\n, and gave stronger results. Of course usually mathematicians are delighted to see others using their results to push forward, and consider it a compliment if someone publishes a new proof of their results, but it seems to be the arrogant way that Landau did such things that annoyed his colleagues. Landau also criticised proofs of theorems published by\nBlaschke\n, again saying that the proofs were unnecessarily complicated. One he claimed was trivial and another could be trivially deduced from a theorem of\nMittag-Leffler\n. A letter which\nBlaschke\nsent to\nBieberbach\nin\n1921\nends with the sentence:-\nWouldn't you like to free Göttingen from Landau?\nDespite having friends who were well informed as to what the Nazis might do if they came to power, Landau failed to recognise the danger. In\n1932\nhe was visited by a friend Fritz Rathenau who told him that if the Nazis gained control they would build concentration camps in which to put Jews. Landau is said to have replied\n[\n3\n]\n:-\nIn that case I should immediately reserve for myself a room with a balcony and a southern exposure.\nOn\n30\nJanuary\n1933\nthe National Socialist party led by Hitler did come to power in Germany and Fritz Rathenau's predictions soon came true. The Civil Service Law was passed on\n7\nApril\n1933\nwhich provided the means of removing Jewish teachers from the universities. In fact before any official work reached Göttingen from the Ministry, the Dean wrote to Landau on\n28\nApril asking him not to give his summer lecture courses and these were given instead by Landau's assistant. Having received no further advice from the university authorities, Landau decided to give his autumn lectures as advertised. Schappacher, in\n[\n10\n]\n, quotes a letter from Landau in which he described in unemotional terms what happened on the first day of lectures:-\nOn\n2\nNovember, about\n11\n.\n15\n, as I wished to leave my office and go to the large lecture theatre to begin my lecture, the entrance hall was filled with about\n80\nto\n100\nstudents who let me pass through unhindered. In the lecture hall was one person. Clearly therefore, there was a boycott with sentries at the door who had prevented\n(\nwithout force\n)\nthose students who wanted to work from setting foot in the lecture room.\nWhat happened - and it happened with the collaboration of many who were my pupils - leads me to believe that the only consequence must be my application to become emeritus or pensioned.\nTeichmüller\n, as leader of the students, had organised the boycott of Landau's lectures. In fact\nTeichmüller\nwent to Landau's office after the boycott and explained that it was not the work of any organised group. Landau then asked\nTeichmüller\nto put this in writing and he included it with his request to the Ministry that he be retired. Despite\nTeichmüller\n's assertions, it is believed that student members of the Sturmabteilung\n(\nStormtroopers\n)\norganised the boycott. Landau was given permission on\n19\nNovember to work at Groningen, in the Netherlands, and the permission was later extended to allow him to remain there for the winter semester. He was officially retired on\n7\nFebruary\n1934\n, moved to Berlin and after this only lectured outside Germany, spending some time in Cambridge and in Holland. He received full pay until\n1\nJuly\n1934\n, then a pension until his death from a heart attack. His widow continued to receive a pension but in March\n1939\nshe was informed that her pension would be terminated if she emigrated to the United States.\nLandau's main work was in analytic number theory and the distribution of\nprimes\n. He gave a proof of the\nprime number theorem\nin\n1903\nwhich was considerably simpler that the ones given in\n1896\nby\nVallée Poussin\nand\nHadamard\n. One consequence of his simpler proof was that it enabled him to obtain results concerning the distribution of prime ideals in algebraic number fields. His masterpiece of\n1909\nwas a treatise\nHandbuch der Lehre von der Verteilung der Primzahlen\nⓉ\n(\nHandbook of the theory of distribution of prime numbers\n)\na two volume work giving the first systematic presentation of analytic number theory. He also wrote important works on the theory of analytic functions of a single variable.\nDarstellung und Begründung einiger meuerer Ergebnisse der Funktiontheorie\nⓉ\n(\nDescription and justification of some results of complex analysis\n)\n[\n1\n]\n:-\n... contains a collection of interesting and elegant theorems of the theory of analytic functions of a single variable. Landau himself discovered some of the theorems and demonstrated others in a new and simpler fashion.\nSchoeneberg writes\n[\n1\n]\n:-\nWritten with the greatest care, Landau's books are characterised by argumentation which is complete, and as simple as possible. The necessary prerequisite knowledge is provided, and the reader is led securely, step by step, to the goal.\nLandau wrote over\n250\npapers on number theory which had a major influence on the development of the subject.",
  "matematicos_citados_na_biografia": [
    "Frobenius",
    "number theory",
    "Hilbert",
    "algebraic number fields",
    "habilitation",
    "Dirichlet",
    "analytic number theory",
    "Riemann hypothesis",
    "privatdozent",
    "irrational numbers",
    "Minkowski",
    "Klein",
    "Carathéodory",
    "Hecke",
    "Schur",
    "Courant",
    "Koebe",
    "Bieberbach",
    "Blaschke",
    "Mittag-Leffler",
    "Teichmüller",
    "primes",
    "prime number theorem",
    "Vallée Poussin",
    "Hadamard"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}