{
  "nome_completo": "Edmund Frederick Robertson",
  "nome_curto": "Edmund Robertson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robertson_Edmund/",
  "data_nascimento": "1 June 1943",
  "local_nascimento": "St Andrews, Fife, Scotland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Edmund F Robertson is known as one of the two originators of the four-yearly Groups St Andrews conferences and one of the two originators and developers of the MacTutor History of Mathematics Archive.",
  "biografia": "Edmund F Robertson\nwas the son of Edmund Josef Chojnacki\n(1912\n-\n1998)\nand Dorothy Mabel Warnes\n(1914\n-\n1994)\n. Edmund Chojnacki, born in Chelmza, Poland, had two younger brothers Léon\n(\nshot by the Germans in\n1939)\nand Czeslaw, and two sisters Stephania and Terésa. He was a County Council Employee in Warsaw but, in\n1937\n, with Poland fearing war with Russia and Germany, he became a member of the special plain clothes police force. On\n2\nnd September\n1939\n, when he heard that Britain had declared war against Germany, he left Warsaw, which was already under air attack, and made his way to Romania. He eventually made his way to Britain, via Yugoslavia, north Italy and France. He joined the expeditionary force to Norway, then returned to France. Making his way to Dunkirk he reached England in a small fishing boat. He was eventually sent with other Polish troops to Kinshaldy, near St Andrews in Scotland, to guard the east coast of Scotland in case of invasion from Norway. Dorothy Warnes' father was Frederick Warnes who had served in the Royal Navy then, after retiring, had joined H.M. Coastguard and was posted to St Andrews. Dorothy Warnes had arrived in St Andrews with her parents in\n1921\n. She attended Madras College, then worked for the Post Office. During World War II, she taught communication skills to service men and women.\nEdmund Robertson was born at\n1\nKinnessburn Terrace, St Andrews. He told the following story in\n[\n27\n]\n:-\nMy first educational memory is going with my mother to see the headmaster of Madras College to arrange to start school. We were told that there wasn't a place at the start of the session, and I'd have to start after the New Year. This was good news for me and, worried the headmaster might change his mind, I said \"Lets go Mummy\". I got my few months reprieve, then began my time at Madras Primary in the building to the right of the main South Street building. My years in primary education were in part spent at home since I had health problems which kept me off school for\n18\nmonths.\nFred Warnes, Edmund's grandfather, was a big influence when he was growing up. The two spent lots of time together; Fred taught Edmund to swim in the North Sea and they often went for bus trips. Some of the bus trips were \"mystery tours\" while others would be all day trips round Scotland. Trips to the north involved crossing the Tay by ferry from Newport since the Tay road bridge had not been built at that time.\nHe attended Madras College where the subjects he enjoyed best were science and mathematics. He was taught mathematics by John Macdonald, known to as \"Dr Jock\". Macdonald was an inspiring teacher, especially for the more able pupils. Robertson enjoyed chess and, in his first year in the secondary school joined the chess club. He said\n[\n27\n]\n:-\nI joined the chess club in my first year and played with my classmates. I remember that a group of sixth form pupils came to watch us play and one lad said to his friends \"You can't believe that these youngsters are playing the same game as us\". One of my greatest joys was beating that sixth form lad in the chess competition a few weeks later. I reached the final, losing to\nGavin Brown\n- later mathematician and vice-chancellor of the University of Sydney.\nAnother enjoyable time was taking part in a 'teachers versus pupils' chess match and winning against one of his teachers.\nRobertson graduated from Madras College in\n1961\nwinning the Tullis prize, the Sir William Robertson prize and being Dux in Science. While in his final year at Madras he had been accepted by the University of St Andrews. Taking the University Bursary Examination, he won a Taylor Thompson Bursary. Madras recommended that he sit the University of St Andrews First Year Mathematics examination while still at school, which he did and passed easily. This did, however, present him with some problems during his university studies since he took a joint degree in Mathematics and Applied Mathematics but was one year out of step with the two topics. He spoke about his undergraduate lecturers in\n[\n27\n]\n:-\nI was an undergraduate at the University of St Andrews, beginning my studies in\n1961\n. Peter Fantham and\nDavid Borwein\ntaught me in my first year. Lectures were in the Mathematics Classroom, one floor up at the east end of the quad. The organisation was somewhat less rigorous than today, with Peter Fantham making up the timetable on the back of his cigarette packet, usually\n(\nbut not always\n)\nbefore lectures were due to start. We got tutorial group notices saying \"Tutorial group\nn\nn\nn\nwill meet in week\nm\nm\nm\nwhere\nn\n+\nm\n=\n3\nm\no\nd\n4\nn + m = 3 \\mod 4\nn\n+\nm\n=\n3\nm\no\nd\n4\n.\" In addition to these two lecturers, I was taught pure mathematics by Willie Parnaby,\nDorothy Foster\n, Jim Tatchell,\nTom Blyth\n, and\nEdward Copson\n. I was taught applied mathematics by\nDan Rutherford\n,\nRon Mitchell\n, Jack Lambert and\nAlex Craik\namong others. I remember that a few weeks before my finals\nCopson\ncame into the classroom looking very flustered. He explained that they had forgotten to give the differential geometry course. We got a few lectures so we might have a chance at answering the exam questions which had been set by colleagues in Dundee.\nDuring his four years as an undergraduate, Robertson lived at home with his parents. He represented the university at chess and was involved in frequent matches against other clubs in the district. Although he studied for a joint Honours degree in Pure Mathematics and Applied Mathematics, his favourite courses were algebra topics, especially group theory. He enjoyed numerical analysis courses taught in the Applied Mathematics Department. In fact he complained to\nRon Mitchell\nthat his numerical analysis course had been too easy; it was only much later that he realised that the course was easy because\nRon Mitchell\nwas an outstanding lecturer. Peter Fantham's lecturers were somewhat chaotic but exciting, Jim Tatchell believed in rigorous hard analysis and set difficult examination questions, while Willie Parnaby taught with a nice mix of rigour and informality, and set examination questions with many hints at the solution.\nRobertson was awarded a B.Sc. with Honours in Pure and Applied Mathematics in\n1965\n. He had sought advice about the best place to undertake research for a Ph.D.\n[\n27\n]\n:-\nI went to see\nCopson\nto ask him for his advice about where I might apply to do research. \"They're building a new university in my home town of Coventry\", he said, \"and I'm really excited about it. Why don't you apply.\" I did and Rolf Schwarzenberger invited me to visit the new University of Warwick. When I got there it was a building site, but the Mathematics Institute was well away from the rest of the University on the other side of Gibbet Hill Road.\nHe also applied to the University of Oxford and visited the Mathematical Institute there. He was offered places at both Warwick and Oxford and decided to accept Warwick since, as a brand new university, it offered a marked contrast to the ancient St Andrews. Warwick had a one year M.Sc. degree with course work and thesis. He was advised by Roger Carter and took courses including Group Theory from Roger Carter, Representation Theory by\nSandy Green\n, and Homological Algebra from David Epstein. After examinations with two three-hour papers on each of two consecutive days, Robertson wrote an M.Sc. thesis on\nVarieties of Groups\n. He described some of his non-academic activities in\n[\n27\n]\n:-\nI really enjoyed my three years at Warwick. Being a new university, none of the undergraduates knew anything about running societies so it was up to us postgraduates to set up societies. I became the first president of the chess club and also the first president of the astronomy society. We played chess in the Coventry league against car firms such as \"Self changing gears\", and the Coventry police. I visited the police station so often that I worried people might think I had a criminal record. Most evenings four of us research students would play bridge or Mah-jongg.\nOnly those who did well enough in the M.Sc. could continue to a Ph.D. Some new members of staff were appointed to Warwick and Robertson worked with Stewart Stonehewer as his Ph.D. thesis advisor. He travelled up to the University of Newcastle to meet up with Stewart Stonehewer before the start of his second year and was given some infinite groups papers to read. He submitted his thesis\nClasses of Generalised Nilpotent Groups\nin\n1968\nand was examined by\nBrian Hartley\nas the internal examiner and Jim Roseblade as the external examiner.\nIn his final year as a postgraduate student, Robertson applied for several lectureships. A position was advertised at the University of St Andrews and he was interviewed for the post. He spoke about this in\n[\n27\n]\n:-\nI was interviewed for a lectureship in St Andrews. At the interview Jim Tatchell said \"You never took the course in\nLebesgue\nIntegration as an undergraduate. Have you corrected that deficiency now?\" I had to admit that I hadn't - and I still haven't! I was appointed and went to see\nCopson\nto find out what I'd be teaching in my first year. \"You did worst in Paper\n1\n(\nCalculus\n)\nin your finals,\" he said, \"so you'd better teach that.\" I did - and enjoyed teaching it. I was lucky - if Jim Tatchell had been head I'd have had to teach\nLebesgue\nintegration. It was strange becoming a lecturer in the place I'd been an undergraduate. All my lecturers were now my colleagues. Going into the coffee room for the first time was quite difficult. I was so grateful to\nNewby Curle\n, the professor of applied mathematics, who understood it was hard for me and went out of his way to be welcoming.\nAppointed as an Assistant Lecturer, Robertson was promoted to Lecturer in Pure Mathematics in\n1969\nand promoted to Senior Lecturer in Pure Mathematics in\n1984\n. When he was first appointed,\nEdward Copson\nwas head of the Department, but he retired in\n1969\nand Jim Tatchell became acting head for the year\n1969\n-\n70\n.\nJohn Howie\nwas appointed as Regius Professor of Mathematics and Head of the Pure Mathematics Department in\n1970\n.\nIn\n1970\n, Robertson married Helena Francesca Slebarski\n(\nborn\n1945)\n, the daughter of\nTadeusz Boleslaw Slebarski\nwho has a biography in this archive. They had two sons, Colin Edmund Robertson\n(\nborn\n1974)\nand David Anthony Robertson\n(\nborn\n1978)\n.\nOn joining the staff in Mathematics at St Andrews, Robertson had two colleagues, Mike Beetham who had written a\nTodd\n-\nCoxeter\ncoset enumeration program, and Colin Campbell who, advised by\nWillie Moser\n, had written an M.Sc. thesis on\nNathan Mendelsohn\n's modification of\nTodd\n-\nCoxeter\n. He became interested in computational group theory and when he heard that Ian D Macdonald, who had produced one of the cleverest ideas in computational group theory, the\np\np\np\n-Nilpotent-Quotient method, had moved from Australia to Stirling in Scotland, he invited him to lecture at St Andrews. They became good friends. Around the beginning of\n1979\nIan said that\nJoachim Neubüser\nhad produced a counter-example to the class breadth conjecture and he wished he could find out the details. Robertson suggested that he could invite\nNeubüser\nto come to St Andrews. He came in the summer of\n1979\nand lectured to a small group including David Johnson who came from Nottingham with his Ph.D. student. While\nNeubüser\nwas in St Andrews, Robertson asked him if he would be a main speaker if, with Colin Campbell, he organised a bigger conference in\n1981\n.\nNeubüser\nagreed, provided the dates were chosen to fit in with the German school holidays. In addition, Campbell and Robertson invited Sean Tobin and\nJim Wiegold\nto be main speakers and they agreed. With large numbers registering for the conference 'Groups St Andrews\n1981\n',\nNeubüser\nsaid we needed more than three main speakers so Derek Robinson was invited. The Groups St Andrews conferences have been held every four years since\n1981\n(\nexcept for a perturbation caused by COVID\n)\n.\nFor details of all the Groups St Andrews conferences, see\nTHIS LINK\n.\nRobertson's first work with Colin Campbell on computational group theory led to\nDonald Coxeter\ninviting them both to spend a month in Toronto in September\n1976\n. Campbell, Coxeter and Robertson wrote the paper\nSome families of finite groups having two generators and two relations\n(1977)\nwhich contained the \"\nF\na\n,\nb\n,\nc\nF^{a,b,c}\nF\na\n,\nb\n,\nc\nconjecture\". Robertson, working with George Havas and Dale Sutherland, nearly thirty years later, proved the conjecture to be true in\n2006\n.\nBeginning in\n1984\n, Robertson won major research grants; fifteen are listed on his CV. Grants from the SERC allowed the purchase of high powered computers. He was the Scientific coordinator for three major European Union grants: 'Using computer algebra'\n(1993\n-\n94)\nfunded cooperation between St Andrews, Aachen, Trento, five Hungarian Universities; 'Computational Group Theory'\n(1993\n-\n96)\nfunded cooperation between St Andrews, and ten other European Union centres of expertise; and 'Using computer algebra'\n(1994\n-\n96)\nfunded cooperation between St Andrews, RWTH Aachen in Germany, Universita degli studi di Trento in Italy,\nLorand Eotvos\nUniversity in Budapest, Hungary, the Technical University of Budapest in Hungary, Lajos Kossuth University in Debrecen Hungary, and the University of Miskolc in Hungary. These grants funded research assistants, travel, equipment and other expenses. They were all involved in the development of the computer algebra system GAP\n(\nGroups, Algorithms, Programming\n)\n, one of the two leading software packages for algebra and discrete mathematics world-wide.\nYou can read the final report on the 'Computational Group Theory' grant at\nTHIS LINK\n.\nCIRCA\n(\nCentre for Interdisciplinary Research in Computational Algebra\n)\nwas set up by Robertson in\n2000\nas a University of St Andrews Centre to oversee GAP development. He was Chairman of the International GAP Council from\n2003\nto\n2009\n.\nRobertson is one of the two originators and developers of the MacTutor History of Mathematics Archive, the other being\nJohn J O'Connor\n. Always using the history of mathematics as a small part of teaching any course, from the\n1980\ns he was involved in teaching the History of Mathematics module at the University of St Andrews. With\nJohn O'Connor\nhe developed the Mathematical MacTutor Tutorial System. They started development in\n1988\nand incorporated historical material into the system. In\n1994\nthe software was selected for the finals of the European Academic Software Award which took place in Heidelberg, Germany.\nJohn O'Connor\nsuggested putting the historical material onto the World Wide Web which had come into public use in\n1993\n. MacTutor won the European Academic Software Award.\nFor more information about the beginnings of MacTutor, see\nTHIS LINK\n.\nLet us give some quotes from articles about MacTutor. The Merlot review in\n2002\nstates\n[\n19\n]\n:-\nThis site is a rich and growing source of materials pertaining to the history of mathematics including biographies of mathematicians, mathematics in various cultures, time lines, famous curves\n(\nwith Java interactivity\n)\n, overview of math history, in-depth coverage of a large number of history topics, and more. Individual pages contain many cross-links and material is well written and useful for both casual and experienced users.\nBarnabas Hughes writes in\n2007\n[\n14\n]\n:-\nJohn J O'Connor\nand Edmund F Robertson of the School of Mathematics and Statistics at the University of St Andrews deserve the thanks of every teacher of mathematics who wishes to interest oneself or one's students in the history of mathematics.\nTony Mann writes in\n2011\n[\n24\n]\n:-\nMention must be made of the outstanding Web resource on the history of mathematics, the MacTutor archive, created and maintained by two mathematicians,\nJohn J O'Connor\nand Edmund F Robertson, at the University of St Andrews. This currently includes\n2\n,\n118\nbiographies and over\n4\n,\n000\npictures of mathematicians. It records about\n2\nmillion file accesses each week, which reflects its use worldwide. Such a reach must have been unimaginable when MacTutor was first conceived. There is no doubt that much of the work now taking place in the history of mathematics would be impossible without this archive: the use of history of mathematics in education, at the school and the undergraduate level, is so greatly facilitated by MacTutor that I believe the growth in interest in history in mathematics education could not have occurred without the archive.\nDaniel Ashlock writes in\n2020\n[\n2\n]\n:-\n... mathematics is the passport to a larger, richer world. The archive of mathematical biographies can make this real for students who have not yet mastered their first deeper mathematics. If you are a teacher, the MacTutor archive is a wonderful resource for enriching a maths class, for final written projects, and to give students a sense of the reach and scope of mathematics. You can simply have the students browse the archives, or you can use it to create ten-minute segments for class about interesting people.\nA list of some of the awards won by the MacTutor archive is at\nTHIS LINK\n.\nRobertson was promoted to a Senior Lecturer in Pure Mathematics at University of St Andrews in\n1984\n, then became a Professor of Mathematics in\n1995\n. He retired in\n2008\nand was made Professor Emeritus. He was head of the School of Mathematical and Computational Sciences from\n1997\nto\n2001\n. Duties outside the university included serving on the Scottish Mathematical Council\n1997\n-\n2004\n, being on the EPSRC Mathematics College\n1997\n-\n2010\n, sometimes as chairman, and being a Governor of Morrison's Academy, Crieff\n1999\n-\n2006\n. He was elected as Chairman of the Scientific Committee of the British Mathematical Colloquium in April\n2005\nserving until\n2008\n. The committee organises the scientific programme of the annual British mathematics conference. He was Chair of the History of Mathematics and Teaching of Mathematics Conference held in Tg Mures, Romania\n(2008)\n, Szeged, Hungary\n(2010)\n, Sárospatak, Hungary\n(2012)\n, Cluj-Napoca, Romania\n(2014)\n, Eger, Hungary\n(2016)\n, Miskolc, Hungary\n(2018)\n, Online\n(2020)\n, and Online\n(2022)\n.\nHe has published\n13\ntextbooks on various aspects of algebra, all written jointly with\nT S Blyth\n. He has been an editor of around\n20\nvolumes of conference proceedings.\nAwards include: Partnership Award for innovation in Mathematics Teaching\n(1992)\n; European Academic Software Award\n(1994)\n; American Computational Engineering and Science Award, Department of Energy of the United States of America\n(1995)\n; Best Mathematics Website Award, Scientific American\n(2002)\n; Merlot Award\n(2002)\n; Signum Pro Scientia Absoluta Vera, Hungarian Sciences Society\n(2008)\n; Comenius Medal, Societas Comeniana Hungarica\n(2012)\n; and the\nHirst\nPrize and Lectureship,\nLondon Mathematical Society\n(2015)\n.\nFor more information about the award of the\nHirst\nPrize to\nJohn O'Connor\nand Edmund Robertson, see\nTHIS LINK\n.\nRobertson was elected a Fellow of the\nRoyal Society of Edinburgh\nin\n1997\n. He has served on the Society's Selection Committee B\n7\n(\nmathematics and statistics\n)\n, and as an editor of the Society's\nProceedings A\n.",
  "matematicos_citados_na_biografia": [
    "Gavin Brown",
    "David Borwein",
    "Dorothy Foster",
    "Tom Blyth",
    "Edward Copson",
    "Dan Rutherford",
    "Ron Mitchell",
    "Alex Craik",
    "Copson",
    "Sandy Green",
    "Brian Hartley",
    "Lebesgue",
    "Newby Curle",
    "John Howie",
    "Tadeusz Boleslaw Slebarski",
    "Todd",
    "Coxeter",
    "Willie Moser",
    "Nathan Mendelsohn",
    "Joachim Neubüser",
    "Neubüser",
    "Jim Wiegold",
    "THIS LINK",
    "Donald Coxeter",
    "Lorand Eotvos",
    "John J O'Connor",
    "John O'Connor",
    "T S Blyth",
    "Hirst",
    "London Mathematical Society",
    "Royal Society of Edinburgh"
  ],
  "imagens": [
    "robertson_edmund.jpg"
  ]
}