{
  "nome_completo": "Eduard Weyr",
  "nome_curto": "Eduard Weyr",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weyr_Eduard/",
  "data_nascimento": "22 June 1852",
  "local_nascimento": "Prague, Bohemia (now Czech Republic)",
  "data_morte": "23 July 1903",
  "local_morte": "Zábori, Bohemia (now Czech Republic)",
  "summary": "Eduard Weyr was a Czech mathematician who was the discoverer of a certain canonical form for square matrices.",
  "biografia": "Eduard Weyr\n's father, František Weyr\n(1820\n-\n1889)\n, was born in Náchod to Jan Weyr\n(1791\n-\n1842)\nand Terezie Wanátková. František was a professor of mathematics at a realschule\n(\nsecondary school\n)\nin Prague from\n1855\n. He had married Marie Rumplová\n(1825\n-\n1889)\nin St Stephen's Church in the upper New Town of Prague on\n10\nJune\n1850\nand they had ten children. Two of the children were born before their marriage. Before examining Eduard's life in detail, let us briefly comment on all ten children. These were Karel Weyr\n(1844\n-\n1915)\n,\nEmil Weyr\n, who has a biography in this archive, Marie\n(1850\n-\n1923)\n, Eduard Weyr, the subject of this biography, Bedrich Weyr\n(1853\n-\n1908)\n, Anna\n(1854\n-\n1884)\n, Antonie\n(1856\n-\n1919)\n, Emilie\n(1858\n-\n1934)\n, Berta\n(1860\n-\n1927)\n, and Helen\n(1867\n-\n1955)\n. Karel, the eldest of the children, was rather different from his brothers and did not influence them greatly as they grew up. He became a financial controller and financial inspector. Bedrich, the one brother younger than the two mathematicians\nEmil\nand Eduard, studied chemistry at the Czech College of Technology\n(1871\n-\n1874)\nand at the University of Prague\n(1875\n-\n1878)\n. He became an expert in sugar refining becoming director of sugar refineries. Of the girls, Marie married Albin Sieber, the director of a sugar refinery in Zdice. Anna married August Johann Friedrich Seydler\n(1849\n-\n1891)\n, a distinguished theoretical physicist and astronomer who was a professor at the Charles University of Prague. Antonie married Rudolf Schuh\n(1848\n-\n1897)\n. Emilie married the architect and builder Josef Roesel\n(1855\n-\n1922)\n. Berta married the very wealthy wholesaler of sugar Leopold Brumlik\n(1849\n-\n1900)\n. The youngest daughter, Helen, lived with her brother\nEmil\nin Vienna for many years. Eventually she married Colonel Ernst Grünfeld\n(1860\n-\n1938)\n, the brother of the well-known pianist and composer Alfred Grünfeld\n(1852\n-\n1924)\n. We note that the family were German speaking and only spoke Czech as a second language.\nEduard was four years younger than his brother\nEmil Weyr\nwho also became a famous mathematician. He was baptised in St Stephen's Church in the Upper New Town of Prague where his parents had married. He grew up in a home where mathematics was talked about with great enthusiasm, both by his father and by his older brother. However, the salary of a school teacher was not large and with a big family to support, František could only bring up his children in relatively poor circumstances. To contribute to the family's finances, the Weyr family provided accommodation for students so when they sat down to eat there would be fifteen people around the table. Eduard attended the Trinity elementary school from\n1858\nto\n1861\n, then spent the year\n1861\n-\n62\nat the elementary school of Our Lady of the Snows. After these four years of elementary education he began his secondary schooling at the realschule in Mikulandska street in Prague where his father taught. His performance was outstanding and by\n1867\nhe had completed the fifth year. However, Eduard caught scarlet fever and missed most of his sixth year at school. The illness left its mark on him, in particular for the rest of his life he suffered frequently from headaches. Although because of the illness he did not graduate from high school, he had attended first and second year mathematics lectures at the Prague Polytechnic as a guest since the fifteen year old boy had not matriculated. Encouraged by his father and brother\nEmil\n, he was already undertaking research and wrote his first mathematics paper at the age of sixteen. The paper,\nErweiterungen des Satzes von Désargues nebst Anwendungen\nⓉ\n(\nExtensions of the theorems of Desargues and applications\n)\n, was published by the\nAustrian Academy of Sciences\nin Vienna, the\nKaiserliche Akademie der Wissenschaften in Wien\n.\nIn session\n1868\n-\n69\nhe matriculated at the Technical University of Prague where he spent two years training in construction machinery. As well as studying at the Technical University, he also studied mathematics at the Charles-Ferdinand University of Prague. One of his lecturers at the Technical University in Prague was Josef Solin\n(1841\n-\n1912)\n, who was a mathematician and engineer. Solin taught the course on the 'Geometry of Position' and the course on 'Graphical Statics' which Weyr attended. Another of his lecturers was Franz Josef Studnicka\n(1836\n-\n1903)\n, a mathematician and author of many high school and college mathematical textbooks who worked both at the Technical University and at the Charles-Ferdinand University. Studnicka gave a course on 'Analytical Mechanics' which Weyr attended. By the age of sixteen Weyr had already sent two mathematics papers to the\nAustrian Academy of Sciences\nin Vienna and, while he was a student, he published further mathematics papers in the\nSitzungsberichte\nof the Vienna Academy, in\nCrelle\n's\nJournal\n, and in the\nZeitschrift für Mathematik und Physik\n. The first volume of the\nJournal for the Cultivation of Mathematics and Physics\nof the\nUnion of Czech Mathematicians and Physicists\n, published in\n1872\n, contained a paper by Weyr on projective planes. After two years studying machine construction at the Technical University of Prague he transferred to the department of water and road construction. He also studied geodesy. In February\n1871\nEduard visited his brother\nEmil\nwho was in Milan in Italy at this time. The two brothers collaborated on a book on Projective Geometry.\nThe exceptional talents which Weyr showed in Prague led to him being awarded a state scholarship to continue to further advanced studies and, in October\n1872\n, he went to the University of Göttingen where he attended lectures by several mathematicians. The most important lecture course he attended was the\nTheory of Abelian Functions and the General Theory of Algebraic Equations\nby\nAlfred Clebsch\nbut this was cut short in November\n1872\n, only weeks after Weyr arrived, when\nClebsch\ndied suddenly of diphtheria. Weyr attended\nClebsch\n's funeral where he met\nFelix Klein\nfor the first time.\nKlein\ninvited Weyr to Erlangen but he decided to remain at the University of Göttingen where obtained his doctorate on\n28\nMay\n1873\nfor his thesis\nÜber Algebraische Raumcurven\n. While at Göttingen he attended lectures by the mathematician Ernst Christian Julius Schering\n(1833\n-\n1897)\nand by the astronomer Ernst Friedrich Wilhelm Klinkerfues\n(1827\n-\n1884)\n. In the following year he again won a state scholarship and in October\n1873\nhe went to Paris where he studied at the Faculté des Sciences and the College de France. He attended lectures by\nCharles Hermite\nand\nJoseph Alfred Serret\n. Karel Petr writes\n[\n14\n]\n:-\nHe met personally these famous mathematicians, who were perhaps the main motive for his journey to Paris. As ever his stay abroad was useful to him and it also meant that he got to know a number of outstanding mathematicians with whom he later corresponded.\nHe returned to Prague in the summer of\n1874\nwhere, on\n3\nNovember of that year, he submitted his\nhabilitation\nthesis on theory of\nelliptic functions\nto the Czech Polytechnic. He gave his inaugural lecture on\n28\nNovember entitled\nThe integration of algebraic differentials with respect to the elliptic integrals\n(\nCzech\n)\n. Also in\n1874\nthe second volume of his book, written jointly with his brother\nEmil Weyr\n, was published. It was subtitled\nTheory of curves of the second degree\n. His appointment as a\nPrivatdozent\nat the Technical University in Prague was confirmed by the Ministry of Culture and Education on\n10\nMarch\n1875\n. During the spring of\n1875\n, Weyr also served as an assistant to professor Karl Josef Küpper\n(1828\n-\n1900)\n, the professor of descriptive geometry at the Technical University of Prague. He lectured during session\n1875\n-\n76\ngiving the two courses\nThe theory of functions\n, and\nElliptic equations\n.\nIn the autumn of\n1874\nWeyr had been offered an extraordinary professorship at the newly founded University of Zagreb. However, he could not accept such a position due to the conditions that had been imposed on him when he accepted the two state scholarships. His brother\nEmil Weyr\nhad been an associate professor at the Czech Polytechnic from\n1872\nbut, on\n23\nSeptember\n1875\n, he became a full professor at the University of Vienna. Eduard Weyr took over his brother's lecturing duties at the Czech Polytechnic and on\n14\nJanuary\n1876\nhe was named as an associate professor at the Czech Polytechnic. With this appointment, Weyr now had a well established academic career with a good salary. Another role that\nEmil Weyr\nheld was that of Permanent Secretary to the\nUnion of Czech Mathematicians and Physicists\n. After he left for Vienna, his brother Eduard was elected as Permanent Secretary at a meeting of the Union on\n7\nNovember\n1875\n. He continued to hold this position for the rest of his life. He was also appointed as a Privatdozent at the Charles-Ferdinand University of Prague in\n1876\n. On\n10\nMay\n1876\nhe was elected an associate member of the\nRoyal Czech Learned Society\n. We note that this Society, founded in\n1784\n, was succeeded by the\nCzech Academy of Sciences and Arts\n(\nČeské Akademie Veda Umeni\n)\nin\n1890\nand by the\nCzechoslovak Academy of Sciences\nin\n1952\nand then, in\n1992\n, by the present Academy of Sciences of the Czech Republic. Josef Solin had been appointed as a full professor at the Prague Polytechnic in\n1876\nbut he handed his teaching duties over to Weyr in\n1878\nwhen he took on other positions in the Polytechnic including rector and dean. Also in\n1878\nthe third volume of\nEmil\nand Eduard Weyr's projective geometry book was published. We should note that\nEmil\nhad been the major contributor to the first two volumes but Eduard was the major contributor to the third volume. In the same year of\n1878\nhe was elected as a corresponding member of the Société des Sciences Physiques et Naturelles de Bordeaux.\nIn fact Weyr was offered a full professorship at the University of Innsbruck in\n1876\nand, later in the same year, he was offered a full professorship at the University of Czernowitz. He declined both offers. Weyr became a full professor at the Czech Polytechnic on\n15\nFebruary\n1881\n. The\n1\nst  Congress of Czech Physicians and Naturalists was held in Prague in the spring of\n1880\n. Both\nEmil Weyr\nand Eduard Weyr were invited to lecture at the Congress. The\n2\nnd\nCongress was held two years later and again both brothers were invited to lecture. In the winter semester of\n1885\n-\n6\nhe took study leave in Berlin where he attended the lecture courses of\nLeopold Kronecker\n,\nKarl Weierstrass\n, and\nLazarus Immanuel Fuchs\n. He was offered a chair at the University of Vienna in\n1890\nbut again declined the offer. In August\n1889\n, both Weyr's parents died, his father suffering a stroke thirteen days after the death of his mother; they were buried in the Olsanské Cemetery in Prague. On\n18\nJuly\n1890\nEduard Weyr married Leopoldina Pazderniková in the Church of St Ludmila in the Vinohrady district of Prague. Their marriage was short for Leopoldina died on\n30\nApril\n1895\n. After the death of his wife, Weyr's youngest sister Helen lived with him\n(\nas she had before his marriage\n)\n. On\n16\nOctober\n1897\nhe remarried, this time to Theresa\n(1869\n-\n1920)\nthe widow of Karlu Teige, a\ngymnasium\nprofessor and musician. Theresa had two children from her first marriage, Karel and Marii\n(\naged\n6\nand\n4\n, respectively\n)\n. Eduard and Theresa Weyr's marriage was also in the Church of St Ludmila in the Vinohrady district of Prague. After suffering from a bad dose of bronchitis he went to Nice in December\n1901\nto recover. After several visits to casinos in Monaco and Monte Carlo he felt better and returned home for Christmas. In\n1902\nhe was offered a full professorship at Charles-Ferdinand University of Prague but died from heart disease soon after being appointed. He had become ill again in the spring of\n1903\nbut by June had recovered sufficiently to go to his summer residence in Zábori. He was buried on\n26\nJuly in the local cemetery.\nEduard Weyr wrote geometrical papers and books mainly in projective geometry and\ndifferential geometry\n. Topics he studied include conic sections and quadrics, projective and synthetic geometry, geometrical affinities, differential geometry of curves, differential geometry of surfaces, and algebraic curves. See\n[\n16\n]\nfor details. He also worked on algebra, in particular studying linear algebra, matrices and hypercomplex systems. One of his most important results in algebra concerns bilateral equations, where Weyr generalised results of\nJames Joseph Sylvester\non the solution of unilateral equations. See\n[\n4\n]\nfor details. In\n1885\nhe discovered the Weyr matrix canonical form which outperforms the\nJordan\nnormal form in a number of mathematical situations. The authors of\n[\n2\n]\nwrite in the Introduction:-\n'Old habits die hard.' This maxim may help explain why the Weyr form has been almost completely overshadowed by its cousin, the\nJordan\ncanonical form. Most have never even heard of the Weyr form, a matrix canonical form discovered by the Czech mathematician Eduard Weyr in\n1885\n. In the\n2007\nedition of the 'Handbook of Linear Algebra', a\n1\n,\n400\n-page, authoritative reference on linear algebra matters, there is not a single mention of the Weyr form\n(\nor its associated Weyr characteristic\n)\n. But this canonical form is as useful as the\nJordan\nform, which was discovered by the French mathematician\nCamille Jordan\nin\n1870\n.\nThe authors of\n[\n2\n]\nalso explain in more detail where Weyr published the 'Weyr form' and put it into context:-\nThe Weyr form appears briefly in his\n1885\nComptes Rendus paper 'Répartition des matrices en espèces et formation de toutes les espèces'\nⓉ\n(\nDistribution of matrices in spaces and formations of all spaces\n)\nand in more detail in the much-longer 'Zur Theorie der bilinearen Formen'\nⓉ\n(\nOn the theory of bilinear forms\n)\n, in Monatsh. Math. Physik in\n1890\n. The latter paper is a wonderful piece of mathematics for its time, modern and clear even by today's standards. It is arguably the first paper in linear algebra, as distinct from matrix theory. It is interesting that Weyr cites the work of\nFrobenius\n,\nSylvester\n,\nCauchy\n, and\nHermite\nin canonical forms but never mentions\nJordan\nin this context! However, in his work on the history of mathematics, Brechenmacher notes that in the period\n1885\n-\n1890\nWeyr was the only mathematician on the European continent using\nCayley\nand\nSylvester\n's pioneering work on matrices. So, was Weyr aware of the\nJordan\nform? Our guess is probably not initially in the matrix setting -\nJordan\n's result appeared in the\n(\nnineteenth-century\n)\nlanguage of permutation group theory and did not evolve into the canonical matrix form of choice until the\n1930\ns. In the meantime, Weyr's form sank into obscurity. It would appear that Weyr himself never really appreciated the utility of his own form in commutativity problems ...\nResearch by Weyr on analysis deals particularly with infinite series and products, and with elliptic functions.\nIn\n1900\nWeyr was asked by a Committee of the\nUnion of Czech Mathematicians\nto write a calculus textbook. He published\nDifferential calculus\nin\n1902\n. This led to controversy with a young mathematician J V Pexider who sharply criticised Weyr's textbook. Jindrich Becvár and Ludek Zajicek give an interesting account of this episode in the paper\n[\n10\n]\nin the book\n[\n1\n]\n.\nWe have already mention certain honours given to Weyr. Other honours include election to honorary membership of the\nUnion of Czech Mathematicians and Physicists\non\n13\nDecember\n1884\n. He received the anniversary prize of the Royal Czech Society of Sciences in\n1889\nand, two years later, he was again honoured with the award of the anniversary prize. In\n1896\nhe was elected as a corresponding member of the Yugoslav Academy in Zagreb, and in\n1897\nas a full member of the\nMoscow Mathematical Society\n.",
  "matematicos_citados_na_biografia": [
    "Emil Weyr",
    "Emil",
    "Austrian Academy of Sciences",
    "Crelle",
    "Union of Czech Mathematicians and Physicists",
    "Alfred Clebsch",
    "Clebsch",
    "Felix Klein",
    "Klein",
    "Charles Hermite",
    "Joseph Alfred Serret",
    "habilitation",
    "elliptic functions",
    "Privatdozent",
    "Czech Academy of Sciences and Arts",
    "Czechoslovak Academy of Sciences",
    "Leopold Kronecker",
    "Karl Weierstrass",
    "Lazarus Immanuel Fuchs",
    "gymnasium",
    "differential geometry",
    "James Joseph Sylvester",
    "Jordan",
    "Camille Jordan",
    "Frobenius",
    "Sylvester",
    "Cauchy",
    "Hermite",
    "Cayley",
    "Union of Czech Mathematicians",
    "Moscow Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}