{
  "nome_completo": "Ernst Eduard Wiltheiss",
  "nome_curto": "Eduard Wiltheiss",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiltheiss/",
  "data_nascimento": "12 June 1855",
  "local_nascimento": "Worms, Germany",
  "data_morte": "7 July 1900",
  "local_morte": "Halle, Germany",
  "summary": "Eduard Wiltheiss was a German mathematician who made major contributions to the theory of abelian functions.",
  "biografia": "Eduard Wiltheiss\nwas born in Worms, which is a few km north of Mannheim. His father was Johann Georg Wiltheiss, a book binder, and his mother was Elisabeth Mohr. The family were members of the Evangelical Lutheran Church, and Eduard was baptized into this church. All of his school education took place in Worms, beginning with his primary education which began when he entered the elementary school of Worms starting from Easter\n1861\n. He moved from the elementary school to the\nGymnasium\nof Worms at Easter\n1866\nand he studied there until he took his final school examinations, his Abitur examinations, on\n28\nMarch\n1874\n.\nIn April\n1874\n, immediately following his\nAbitur\nexaminations, Wiltheiss entered the University of Giessen to study mathematics. At Giessen his lecturers included R Baltzer,\nM Pasch\nand\nP A Gordan\n.\nMoritz Pasch\nwas a geometer while\nPaul Gordan\nwas famed for his work in\ninvariant theory\n. However\nGordan\nhad undertaken research on abelian functions before becoming fascinated by invariant theory, and Wiltheiss went on to undertake research on that topic, making a major contribution to the theory of abelian functions. From Giessen Wiltheiss went to Berlin in\n1876\nto continue his mathematical studies. There he attended lectures by the three great mathematicians\nWeierstrass\n,\nKummer\n, and\nKronecker\n. At this time Berlin was the leading German university for mathematics, indeed it is fair to say that it was perhaps the best university in the world for a student to learn the deepest and most exciting approach to the subject. His doctoral studies on systems of hyperelliptic differential equations were supervised by\nWeierstrass\nand he submitted his thesis\nDie Umkehrung einer Gruppe von Systemen allgemeiner hyperelliptischer Differentialgleichungen\nⓉ\n(\nThe inversion of a group of systems of general hyperelliptic differential equations\n)\nto the University of Berlin. He graduated on\n5\nJuly\n1879\nand immediately began working on his\nhabilitation\nthesis.\nOn\n25\nApril\n1881\nWiltheiss presented his habilitation thesis\nBestimmung Abelscher Funktionen mit zwei Argumenten, bei denen complexe Multiplikationen stattfinden\nⓉ\n(\nDetermination of Abelian functions with two arguments, where complex multiplications take place\n)\nto the University of Halle and became a\nprivatdozent\nthere.\nHeine\nwas the consultant for the thesis. In November\n1886\n, after five years as a privatdozent, Wiltheiss was appointed as an extraordinary Professor of Mathematics in Halle. Soon after his appointment A\nWangerin\nwas appointed to succeed\nHeine\n, and over the next few years\nHermann Wiener\nand\nPaul Stäckel\njoined the staff at Halle, in the years\n1885\nand\n1891\nrespectively.\nThe\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\nwas founded in\n1890\nat a meeting of the Society of German Scientists and Physicians which took place in Bremen from\n15\nto\n20\nSeptember. Wiltheiss was a founder member of the\nGerman Mathematical Society\nalong with his colleague at Halle\nHermann Wiener\n, as were\nCantor\n,\nGordan\n,\nHilbert\n,\nKlein\n,\nMinkowski\n,\nStudy\nand\nHeinrich Weber\nwho all gave lectures at the Bremen meeting.\nThe research which Wiltheiss carried out was mostly in the area of abelian functions, in particular studying hyperelliptic functions and theta functions. Following his habilitation, he published papers such as\nÜber die complexe Multiplication hyperelliptischer Functionen zweier Argumente\nⓉ\n(\nOn the complex multiplication of hyperelliptic functions of two arguments\n)\n(1883)\n,\nÜber die partiellen Differentialgleichungen zwischen den Ableitungen der hyperelliptischen Thetafunctionen nach den Parametern und nach den Argumenten\nⓉ\n(\nOn the partial differential equations between the derivatives of the hyperelliptic Theta functions with the parameters and the arguments\n)\n(1885)\n,\nÜber-Thetafunctionen, die nach einer Transformation in ein Product von Thetafunctionen zerfallen\nⓉ\n(\nOn theta functions which split after a transformation into a product of theta functions\n)\n(1886)\n, and\nÜber eine partielle Differentialgleichung der Thetafunctionen zweier Argumente und über die Reihenentwicklung derselben\nⓉ\n(\nOn a partial differential equation of the two arguments for theta functions and via the series development thereof\n)\n(1887)\n. Over the next couple of years from\n1888\nto\n1890\nhis output of papers was very high, both in quality and quantity\n(\neight paper were published over this period\n)\n. However his health deteriorated and his final research paper was\nDie partiellen Differentialgleichungen der Abel'schen Thetafunctionen dreier Argumente\nⓉ\n(\nThe partial differential equations of the Abelian theta functions of three arguments\n)\n(1891)\n.\nWirtinger\nwrites that Wiltheiss produced many valuable single results, around which new theories developed\n[\n2\n]\n:-\nHope that he could still participate in their development was cut off by his illness.  Nevertheless his work secures a continuing place for him in the history of Abelian functions.\nWiltheiss predominantly lectured to students who were beginning their studies, on topics such as differential and integral calculus, geometry, and algebra.  In addition he taught some advanced courses such as\nelliptic functions\n, hyperelliptic functions, and invariant theory. W Lorey, who was an undergraduate at Halle at the end of Wiltheiss' career, presents this rather disturbing image of his last lecture:-\nFor the author of these lines it is a painful memory, as Wiltheiss tried to speak about determinants in his last lecture hour in May\n1892\nwith obvious energy before his two listeners.\nAlthough he had been suffering from ill health over a period of time, it was in this final semester of\n1892\nthat the effects of the illness became much more severe. At the end of May Wiltheiss underwent an operation in Jena but sadly it was not successful.  In the summer of\n1892\nhe took premature retirement on grounds of ill health. He died on\n7\nJuly\n1900\nin the mental hospital in Halle, and was buried in the North Cemetery in Halle three days later.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Abitur",
    "M Pasch",
    "P A Gordan",
    "Moritz Pasch",
    "Paul Gordan",
    "invariant theory",
    "Gordan",
    "Weierstrass",
    "Kummer",
    "Kronecker",
    "habilitation",
    "privatdozent",
    "Heine",
    "Wangerin",
    "Hermann Wiener",
    "Paul Stäckel",
    "German Mathematical Society",
    "Cantor",
    "Hilbert",
    "Klein",
    "Minkowski",
    "Study",
    "Heinrich Weber",
    "Wirtinger",
    "elliptic functions"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}