{
  "nome_completo": "Edward Thomas Copson",
  "nome_curto": "Edward Copson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Copson/",
  "data_nascimento": "21 August 1901",
  "local_nascimento": "Coventry, England",
  "data_morte": "16 February 1980",
  "local_morte": "St Andrews, Fife, Scotland",
  "summary": "Edward Copson was an expert on Complex Analysis and was Regius Professor of Mathematics at St Andrews from 1950 until 1969 .",
  "biografia": "Edward Copson\n's mother was Emily Read and his father was Thomas Charles Copson, a motor engineer and inventor who worked in Coventry. Educated at King Henry VIII School in Coventry, where he held an Entrance Scholarship, Copson then matriculated at St John's College, Oxford, in\n1919\nwhere he was greatly influenced by\nLove\nand\nHardy\n. He graduated with a B.A. with First Class Honours in Mathematics in\n1922\nand was appointed by\nWhittaker\nto a lecturing post in Edinburgh in the same year.\nWhittaker\ninterviewed Copson on the platform of Windemere station and offered him a lectureship in mathematics at the University of Edinburgh while on the train. How times have changed!\nCopson was awarded a D.Sc. by Edinburgh in\n1928\nand remained on the staff there until\n1930\n, when he was appointed Lecturer in Mathematics at the University of St Andrews under\nTurnbull\n. He married the elder of\nEdmund Whittaker\n's two daughters, Beatrice Mary Whittaker, in\n1931\n. Copson spent\n1934\nat the Royal Naval College in Greenwich, then returned to the University of St Andrews but this time to the chair of mathematics at Queen's College, Dundee\n(\nQueen's College was at that time part of the University of St Andrews and only became the University of Dundee in the\n1960\ns\n)\n. A lecturer in the department at the time wrote later\n(\nsee for example\n[\n2\n]\n)\n:-\nThe department at that time had a family atmosphere, decisions were taken during morning coffee, there were few official meetings, no teaching aids, no secretarial assistance, classes were small but teachers knew their students personally. Every member of the small staff might be called upon to lecture in any branch of mathematics, and Copson with his wide interests in mathematics was admirably suited to such an environment. Copson was generous in the help and advice he gave to new members of staff yet they were free to develop their interests both in teaching and research. Under Copson's leadership it was a most happy and successful department.\nIn\n1950\nhe was appointed to fill\nTurnbull\n's Regius Chair of Mathematics in St Andrews. He was Dean of Science in\n1950\n-\n53\nand was the first Master of the United College in\n1954\n-\n57\n. It was a difficult period to hold such posts for the university was deciding on the site for building a new science complex which led to very heated debates. The final decision to build on the North Haugh, rather than in the town centre, has certainly proved correct.\nA new Mathematical Institute was built on the North Haugh as part of the new science complex while Copson held the Regius Chair. The building work began on\n8\nSeptember\n1965\nand on this occasion Copson cut the first sod with a spade which was subsequently presented to him. It carries the inscription\n(\nwhich is now almost illegible\n)\n:-\nPRESENTED TO\nE. T. COPSON M.A. D.Sc. F.R.S.E. F.I.M.A.\nREGIUS PROFESSOR OF MATHEMATICS\nON THE OCCASION OF THE CUTTING OF THE FIRST SOD\nTO INAUGURATE THE NEW MATHEMATICS BUILDING\nNORTH HAUGH ST ANDREWS\n8\nth\nSEPTEMBER\n1965\nThe layout of the new building, and the name \"Mathematical Institute\", were due to Copson.\nCopson studied classical analysis, asymptotic expansions, differential and\nintegral equations\n, and applications to problems in theoretical physics. His first book was his most famous, namely\nThe theory of functions of a complex variable\n(1935)\n. It sold so well in the United States that he called an extension on his house in Buchanan Gardens, St Andrews, \"The American Wing\" since it was built with the profits. I\n[\nEFR\n]\nwas first invited to this house while I was an undergraduate, and I played my first game of croquet on the lawn in his beautiful garden.\nIn total Copson wrote six books, all of which demonstrate his great skill as an expositor. The second book was\nThe Mathematical Theory of Huygens' Principle\npublished in\n1939\nand written in collaboration with Bevan Baker.\nBateman\n, reviewing the book, wrote:-\nHuygens\n' geometrical construction... is first justified ... by\nPoisson\n's analytical solution of the equation of wave-motions. A discussion is then given of the ideas of\nFresnel\nand of the formula of\nHelmholtz\nwhich expresses these ideas in analytical form and gives the principle of\nHuygens\nfor periodic processes. The diffraction formulae of\nFresnel\nand\nStokes\nare then obtained.\nKirchhoff\n's famous formula is first derived from the formula of\nHelmholtz\nand then proved directly. ...The analogue of\nKirchhoff\n's formula, due to\nVolterra\n, is derived and an interesting account is given of a method, devised by\nMarcel Riesz\nand based on the theory of fractional integration, which provides a powerful method of solving initial value problems for equations like the wave equation. The rest of the book is devoted chiefly to the problem of diffraction. ... Chapter IV contains a good account of\nSommerfeld\n's theory of diffraction.\nAsymptotic expansions\n(1965)\nwas written because Copson was pressed to write a more major work on that subject to expand on a shorter work written in\n1943\nat the request of the Admiralty. In\n1968\nhe published\nMetric spaces\nwhich was based on lecture courses given at St Andrews, one of these courses I\n[\nEFR\n]\nwas fortunate enough to attend. Copson writes in the Preface:-\nThere are many books on functional analysis; and some of them seem to go over the preliminaries to the subject far too quickly. The aim here is to provide a more leisurely approach to the theory of the topology of metric spaces, a subject which is not only the basis of\nfunctional analysis\nbut also unifies many branches of classical analysis. The applications of the theory ... to problems in classical algebra and analysis show how much can be done without ever defining a normed vector space, a\nBanach space\nor a\nHilbert\nspace.\nIn\n1975\nhe published\nPartial differential equations\nwhich covers most of the classical techniques for first and second order linear partial differential equations, giving many examples and applications to physical problems.\nIn\n[\n1\n]\nthe flavour of his papers is nicely summed up:-\nHis published papers span more than half a century. His last\n(1978)\n, entitled \"Electrostatics in a gravitational field\" was relevant to the highly fashionable subject of Black Holes. It was typical of his work, very much on the borderline between mathematics and physical science, and exhibiting technical skill in classical analysis that is rare nowadays.\nCopson was honoured by election to the\nRoyal Society of Edinburgh\nin\n1924\nand was awarded the Keith Prize of the Society in\n1941\nfor an outstanding series of papers published in the Proceedings. He was Secretary of the Society from\n1945\nto\n1950\nand Vice-President from\n1950\nto\n1953\n. He also served the\nEdinburgh Mathematical Society\nbeing Secretary\n(1924\n-\n30)\n, editor of the Proceedings, and President on two occasions,\n1930\nand\n1954\n-\n55\n.\nAs a lecturer he was outstanding, he gave lectures of remarkable clarity\n[\n1\n]\n:-\nCopson was a good teacher, whether behind the rostrum with his general class or in tutorials or seminars with his honours or research students. His influence in and beyond St Andrews can be measured by the number of members of university departments, not all in mathematics, who were his pupils.\nTom Blyth\n, one of his students and then a colleague, wrote\n(\nsee for example\n[\n2\n]\n)\n:-\nHe firmly believed in the old Scottish tradition of the Professor lecturing on a sizeable part of the first-year syllabus: he did so entirely without notes, relying solely on his pocket diary to mark how far he had gone each day.\nHis students, always aware that their teacher was a master of his subject, nevertheless sometimes played practical jokes. By the\n1960\ns Copson was hard of hearing and wore a hearing aid. However he always turned it off when he lectured and alarm clocks were sometimes brought into the lecture room and would ring loudly at various times.\nAfter he retired in\n1969\n, Copson continued living in St Andrews. He still did some teaching, which he loved, and continued to write books and undertake research.",
  "matematicos_citados_na_biografia": [
    "Love",
    "Hardy",
    "Whittaker",
    "Turnbull",
    "Edmund Whittaker",
    "integral equations",
    "Bateman",
    "Huygens",
    "Poisson",
    "Fresnel",
    "Helmholtz",
    "Stokes",
    "Kirchhoff",
    "Volterra",
    "Marcel Riesz",
    "Sommerfeld",
    "functional analysis",
    "Banach space",
    "Hilbert",
    "Royal Society of Edinburgh",
    "Edinburgh Mathematical Society",
    "Tom Blyth"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}