{
  "nome_completo": "Edward Marczewski",
  "nome_curto": "Edward Marczewski",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Marczewski/",
  "data_nascimento": "15 November 1907",
  "local_nascimento": "Warsaw, Russian Empire (now Poland)",
  "data_morte": "17 October 1976",
  "local_morte": "Wrocław, Poland",
  "summary": "Edward Marczewski was a Polish mathematician who worked in measure theory, descriptive set theory, general topology, probability theory and universal algebra.",
  "biografia": "Edward Marczewski\nwas born\nSzpilrajn\nbut changed his name while hiding from Nazi persecution. We will call him Marczewski for this biography. He attended the Batory Secondary School in Warsaw, a school named after Stefan Batory who was king of Poland from\n1575\nto\n1586\n. He graduated from the school in\n1925\nand entered the Department of Mathematics and Physics of the University of Warsaw.\nAt the University of Warsaw he was taught by\nKuratowski\nwho was teaching the first year calculus course that Marczewski attended.\nKuratowski\nwrites in\n[\n1\n]\n:-\n... during the first tutorials in that subject\n[\ncalculus\n]\nhe attracted my attention by his extraordinary ingenuity. The audience then was exceptionally large\n(\nabout\n300\npersons\n)\n, the largest in the pre-war period; Marczewski was the best.\nKuratowski\ndirected Marczewski's studies and gave him much personal attention. However it was two other mathematicians at the University of Warsaw who influenced Marczewski more than\nKuratowski\n. These were\nMazurkiewicz\nand\nSierpiński\nwho interested Marczewski in\nmeasure theory\nand related topics. Remaining at the University of Warsaw to study for his doctorate under Sierpinski's supervision, he submitted his thesis in\n1932\n. He had remained interested in collaborating with\nKuratowski\nand, in the same year as his doctorate was awarded, a joint paper by Marczewski and\nKuratowski\nwas published in\nFundamenta Mathematicae\n.\nThis was the golden age of Polish mathematics. From very unpromising times up to World War I, with the recreation of the Polish nation at the end of that war, Polish mathematics entered a golden age. In\n1936\n, at the height of this remarkable explosion of mathematical talent, Marczewski wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nPoland always possessed great individuals, who worked, often with success, for the many, and not infrequently for whole institutions and sometimes for whole generations. But now it has among its mathematicians not only outstanding individuals but also a numerous, organised group of people whole-heartedly devoted to creative scientific work; it has its own school of mathematics.\nMarczewski was right, but sadly time were about to change. With the German invasion of Poland in\n1939\nthe intellectual life of the country was destroyed\n(\nor at least there was a concerted effort by the invaders to destroy Polish intellectual life\n)\n. Marczewski was visiting Lwów when it was occupied by the German army and here, as throughout Poland, intellectuals perished. For example A Lomnicki,\nS Ruziewicz\n, and W Stozek were three mathematicians from the Technical University of Lwów who were shot by a German firing squad in July\n1941\n.\nThen Marczewski returned to Warsaw, but in the capital things were equally difficult. Mathematics lecturers at the University of Warsaw who died around this time included S Kwietniewski and\nA Lindenbaum\nin\n1941\nand\nS Saks\nmurdered in November\n1942\n. For much of the war Marczewski survived in Warsaw suffering great hardships. However, near the end of the war he was captured and sent to a labour camp in Breslau, as the Germans called the town, but Wrocław to give it its Polish name.\nIn Wrocław, Marczewski was a prisoner of the Germans while the Russian forces besieged the city. The German defenders of Wrocław continued to resist even after the fall of Berlin. On\n6\nMay\n1945\nthe Russian forces captured Wrocław and Marczewski was set free. Perhaps the rather surprising turn of events was that he decided to remain in Wrocław and throw himself vigorously into the rebuilding of the university and educational system there.\nThe most important outcome which Marczewski worked for was the setting up of a Polish university in Wrocław. This he achieved with remarkable speed. On\n24\nAugust\n1945\n, only three weeks after the Potsdam Conference, the Polish government issued a decree to:-\n... convert the University and Technical University of Wrocław into Polish state academic institutions.\nLectures began at the new Polish University of Wrocław on\n15\nNovember\n1945\n. In addition to Marczewski, who was appointed as a professor,\nSteinhaus\nwas appointed as Dean of the Faculty of Mathematics, Physics and Chemistry. Marczewski later became rector of the University and served for four years in this role.\nThe\nPolish Mathematical Society\nwas equally quick to set up a new Wrocław section. At its first meeting following the end of the war in October\n1945\nit passed a resolution:-\n... to welcome delegates from the Society's new Section in Wrocław. The meeting considers the vigorous start of the Wrocław mathematical centre's activities, and the presence of its delegates not only as a manifestation of the return of the Western Territories to Poland, but also as a proof of the rebirth of Polish culture in those territories. The General Meeting considers it to be a matter of great importance that the Wrocław Section, under the direction of Professors\nB Knaster\n, E Marczewski, H\nSteinhaus\nand\nW Ślebodziński\nand in cooperation with the University and Technical University of Wrocław, should constitute one of the most active scientific centres radiating across the Western Territories.\nMarczewski founded the journal\nColloquium Mathematicum\nin\n1946\nin Wrocław, and he was its editor-in-chief for\n30\nyears. In\n1948\nthe Polish Mathematical Institute was set up, based mainly in Warsaw but having divisions in other cities. Marczewski was proposed as Deputy General Secretary of the Mathematical Institute. He was a cofounder of the Wrocław Centre of Excellence in Mathematics.\nWe should end by making comments on Marczewski's mathematics. His main work was in set theory,\ngeneral topology\n, and measure theory. In\n[\n6\n]\nthere is a bibliography of Marczewski's publications including\n94\nmathematical and\n47\nother research publications.\nIn\n[\n1\n]\nKuratowski\ndiscusses some of the mathematical contributions made by Marczewski:-\nHe obtained particularly interesting and frequently applied results on the duality between the notions of a set of the first category and a set of measure zero; and similarly - between a set with\nBaire\n's property and a measurable set. He also devoted much attention to analytic sets\n(\nSuslin sets\n)\n, operation\n(\nA\n)\nand uniformization ... . The great universality, elegance and simplicity of his proofs is a characteristic feature of his papers.\nKuratowski\nalso paid this fine tribute to Marczewski:-\n... he was a man of exceptional wisdom and exceptional kindness, which won him adherents and numerous friends.",
  "matematicos_citados_na_biografia": [
    "Kuratowski",
    "Mazurkiewicz",
    "Sierpiński",
    "measure theory",
    "S Ruziewicz",
    "A Lindenbaum",
    "S Saks",
    "Steinhaus",
    "Polish Mathematical Society",
    "B Knaster",
    "W Ślebodziński",
    "general topology",
    "Baire"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}