{
  "nome_completo": "Edward Troughton",
  "nome_curto": "Edward Troughton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Troughton/",
  "data_nascimento": "(baptised) 6 November 1753",
  "local_nascimento": "Corney, Cumberland, England",
  "data_morte": "12 June 1835",
  "local_morte": "London, England",
  "summary": "Edward Troughton was an English maker of scientific instruments.",
  "biografia": "Edward Troughton\n's father Francis Troughton was a farmer who had a brother John Troughton, born around\n1716\n, who was a maker of scientific instruments in London. Francis married Mary Stable and they had six children, the youngest being Edward, the subject of this biography. One of Edward's older brothers named John\n(\nafter his uncle\n)\nwas born in\n1739\nand so was entering a profession while Edward was still a small child. Edward's brother John, and another brother younger than John, went to London to be trained by their uncle in the profession of scientific instrument makers.\nEdward worked for his father when he was young. However, after the middle brother, who was apprenticed to John, died, Edward went to London in\n1773\nto become an apprentice mathematical instrument maker with his brother John Troughton. McConnell writes\n[\n2\n]\n:-\nAt this time John Troughton worked for other craftsmen, who brought their sextants and small astronomical quadrants to be divided in his workshop, for he enjoyed a high reputation in this difficult art, which was performed entirely by hand. Between\n1775\nand\n1778\nJohn constructed a dividing engine, on the lines of that recently designed by\nJesse Ramsden\n, by which he was able to increase both his accuracy and his rate of work.\nEdward Troughton took the science of instrument-making very seriously indeed and began to study the mathematical background necessary, as well as astronomy, so that he could understand precisely how the instruments were being used and the type of scientific discoveries that users of the instruments were hoping to make. Edward began to design and to build his own instruments. The business flourished and John was able to expand buying property outside London, as well as the established business of Benjamin Cole at the\nSign of the Orrery\n. This business had a shop at\n136\nFleet Street and behind the shop were workrooms where instruments could be constructed. Edward became a partner with his brother, and they traded as John and Edward Troughton at\nThe Sign of the Orrery\n. Soon after this, however, in\n1788\nJohn died and Edward Troughton ran the business on his own. He had been able to take on apprentices of his own from\n1784\nand soon attracted the most promising young men to work for him.\nTroughton soon established himself as the leading maker of instruments in England, for not only had his brother John died in\n1788\n, but also the other brilliant maker of scientific instruments\nRamsden\ndied in\n1800\n. Not only did he make great improvements in the design of existing instruments, but he also invented many new instruments. He began his instrument making career with instruments to aid navigation. For example, he designed the 'pillar' sextant, patented in\n1788\n, the dip sector, the marine barometer and the reflecting circle built in\n1796\n. Other instruments which he designed were for use in surveying. He designed the pyrometer, the mountain barometer and the large theodolites which were used in the American Coast Survey of\n1815\n, and base-line measuring apparatus. In fact these instruments were later used in surveys of Ireland and of India.\nTroughton's most famous instruments were astronomical ones. He made the Groombridge Transit Circle in\n1805\nand a six foot Mural Transit Circle in\n1810\nwhich was erected at the Observatory in Greenwich in\n1812\n. In\n1816\nhe made a ten-foot Transit Circle. He never produced any telescopes, however, and the reason for this was that he suffered from colour-blindness which was a defect which ran in his family. He did, however, make use of some of his own instruments to make astronomical observations. For example he observed the transit of Mercury across the disk of the sun in May\n1799\nand made careful, accurate observations which he published in the scientific literature.\nOne of Troughton's most important contributions was a method of dividing a circle. His paper on this,\nAn account of the method of dividing astronomical and other instruments by ocular inspection\nin the\nPhilosophical Transactions of the Royal Society\nin\n1809\nwon him the Copley medal of the\nRoyal Society\n. In\n[\n4\n]\nthis invention is described in detail and also put into context. Brooks writes:-\nThe development of the circular dividing engine in England is traced from Henry Hindley and\nJesse Ramsden\nthrough the improvements introduced by Ramsden's successors to the self-acting engine of William Simms. Particular emphasis is given to the invention, evolution and transmission of the methods used to achieve accuracy in dividing the wheel, ratcheting the teeth and matching them to the endless screw, and mounting the cutter. The procedures adopted by\nRamsden\nand Troughton for correcting initial dividing marks are also described.\nTroughton was elected a fellow of the\nRoyal Society\nin\n1810\nlargely due to the fact that he had been prepared to share his methods of dividing instruments which he had kept a closely guarded secret up to that time. That he was prepared to write up his methods for publication followed discussions which he had on the topic with\nNevil Maskelyne\n, the astronomer royal. He was also elected a Fellow of the\nRoyal Society of Edinburgh\nin\n1822\n. In\n1822\nhe published another work\nA comparison of the repeating circle of Borda with the altitude and azimuth circle\nin the\nMemoirs of the Royal Astronomical Society\n.\nAfter his brother John died, Edward ran the business alone until, in\n1826\n, because of failing health due to old age, he took on a new partner William Simms. Troughton described Simms as the best craftsman h knew, and Simms and his wife came to live with Troughton at his house in Fleet Street. Troughton was by this time over\n70\nyears old and was suffering from some of the ailments of old age such as rheumatism and lumbago. The firm continued to flourish, however, and they supplied George Everest with a number of instruments to conduct his survey of India.\n(\nMount Everest was renamed in George Everest's honour in\n1865)\n. Everest had spent\n25\nyears between\n1818\nand\n1843\nmaking a trigonometric survey of India, including measuring the\n11\n.\n5\ndegree arc of the meridian from the Himalayas to Cape Comorin, the most southerly point of the Indian subcontinent.\nCertainly being an instrument maker was not an easy task and one had to deal with customers with extremely high expectations. For example a dispute which Troughton became involved in towards the end of his life was with Sir James South who was President of the\nRoyal Astronomical Society\nfrom\n1829\nto\n1831\n. This dispute is described in detail in\n[\n5\n]\n.\nYou can see an account of the dispute at\nTHIS LINK\nwhere we quote from\n[\n5\n]\n.\nIt was a sad affair in which South, who had previously been friendly with Troughton, ended up trying to damage his reputation. In fact a court case was still in progress when Troughton died. Simms continued Troughton's internationally known business after Troughton died in\n1835\nat his home in Fleet Street.\nAs to Troughton's character and interests some information is given in\n[\n2\n]\n:-\nTroughton never married. His friends described him as a modest man, frugal in habit and somewhat careless in dress, who found relaxation in walking and fishing. Reading was the great pleasure of his later years; his library, auctioned by Sothebys after his death, testified to a broad sweep of interests beyond those related to his craft.",
  "matematicos_citados_na_biografia": [
    "Jesse Ramsden",
    "Ramsden",
    "Royal Society",
    "Nevil Maskelyne",
    "Royal Society of Edinburgh",
    "Royal Astronomical Society",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}