{
  "nome_completo": "Edward Cocker",
  "nome_curto": "Edward Cocker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cocker/",
  "data_nascimento": "1631",
  "local_nascimento": "England",
  "data_morte": "22 August 1676",
  "local_morte": "London, England",
  "summary": "Edward Cocker was an English scholar who was the author of an influential arithmetic text which ran to more than 100 editions.",
  "biografia": "Edward Cocker\nworked in London as an engraver, teaching writing and arithmetic. He also wrote poetry and was a skilful calligrapher with considerable artistic talent which enabled him to make a living producing copy-books.\nIn\n1657\nhe was living\n(\n[\n2\n]\n)\n:-\n... on the south side of St Paul's Churchyard, over against St Paul's Chain ... where he taught the art of writing and arithmetick in an extraordinary manner.\nIn\n1664\nhe moved Gutter Lane, still close to St Paul's Churchyard. Certainly he did not remain long at his new address since he is mentioned in letters of\nCollins\nto\nWallis\nin\n1666\nand\n1667\nand by that time he was living in Northampton. We do not know of his movements from this time until he was back in London in\n1674\n, when he started a public school near St George's Southwark.\nCocker produced over\n20\ncopybooks and, according to the expert A Heal:-\n... he delighted to embroider the books with fantastic creatures, exotic birds ... his knots and flourishes are wonderful pieces of exuberant penmanship.\nIn addition to the copy-books Cocker wrote\nCocker's Urania\nand\nCocker's Morals\n(1675)\ncomposed of rhyming couplets. In this last work he writes:-\nArithmetick let a man understand\nAnd after that, Geometry command.\nThen let him turn Astronomer and prove\nHow many Stars are fix'd, how many move.\nNext a Geographer Earth's Globe survey\nThe long-sought, unfound Longitude display.\nApollo's Lyre next let him take in hand,\nAnd all the high Soul-charming Aires command.\nYea, let him have all Arts, all are but smoke\nTo him that hath no money in his Poke.\nIn\n1664\nhe published\nTutor to writing and arithmetick\nwhich contained\n7\npages of text on calligraphy and\n49\npages on arithmetic. His most famous work, however, was\nCocker's Arithmetic\nwhich ran to more than\n100\neditions over a period of about\n100\nyears. It was published in\n1678\n, after Cocker's death, edited by John Hawkins. A phrase\naccording to Cocker\nwas common usage for many years, it meant\nabsolutely correct\n.\nThe editor of the\n1678\nfirst edition of\nCocker's Arithmetic\n, John Hawkins, wrote two books of his own,\nClavis Commercii\n(1689)\nand\nThe English School-master compleated\n(1692)\nas well as editing the third edition of\nJonas Moore\n's\nArithmetick\n(1688)\n. It has been claimed that he was the author, rather than Cocker, of\nCocker's Arithmetic\n.\nThe first to suggest that\nCocker's Arithmetic\nwas written by John Hawkins was\nDe Morgan\n. It was in\n1847\nthat\nDe Morgan\npublished his claim, giving a long list of reasons, stating:-\nI am perfectly satisfied that Cocker's Arithmetic is a forgery of Hawkins ...\nAmong his reasons was that Cocker's Preface says that he is now publishing the work, while Hawkin's Preface says that Cocker refused to publish. However some, such as Salmon\n[\n5\n]\n, defended Hawkins and argued against\nDe Morgan\n. For example he countered the point above by saying that Cocker's Preface must be genuine otherwise Hawkins would not have been so stupid to have the two Preface's contradict each other. The recent article\n[\n6\n]\n, which is a delight to read, argues convincingly that:-\nResearch now shows that there is little doubt that it was really Cocker's work.\nThe story is complicated by the fact that other books were to appear claiming to be by Cocker.\nCocker's Accomplish'd School-Master\nappeared in\n1696\nwhile\nCocker's English Dictionary\nappeared in\n1704\n. These are almost certainly not due to Cocker but were written to cash in on the high sales that Cocker's name produced.\nCocker died with\nno money in his Poke\nto quote his own phrase. As\nWallis\nwrites in\n[\n6\n]\n:-\nSubsequently he might well have suffered material loss in the Fire and have had the expense of successive removals. He may also have spent extravagantly. He possessed 'some choice Manuscripts, and a great Collection of Printed Authors in several Languages' ... In any event, he died in debt, 'within the rules' of the King's Bench Prison, which was situated in Southwark; the quoted phrase meant that the prisoner had purchased the right to live within a short distance of the prison. Cocker's move to Southwark was probably an enforced one, consequent on his committal for debt.",
  "matematicos_citados_na_biografia": [
    "Collins",
    "Wallis",
    "Jonas Moore",
    "De Morgan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}