{
  "nome_completo": "Edward Witten",
  "nome_curto": "Edward Witten",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Witten/",
  "data_nascimento": "26 August 1951",
  "local_nascimento": "Baltimore, Maryland, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Edward Witten is an American mathematician who won a Fields Medal for his work on quantum field theory.",
  "biografia": "Edward Witten\nwas born into a Jewish family. His mother was Lorraine W Witten while his father, Louis Witten, was a theoretical physicist specializing in gravitation and general relativity. His brother, Matt Witten, has achieved fame as a screenwriter and television producer.\nWitten studied at Brandeis University and received his B.A. in\n1971\n. From there he went to Princeton receiving his M.A. in\n1974\nand his Ph.D. in\n1976\n.\nAfter completing his doctorate, Witten went to Harvard where he was postdoctoral fellow during session\n1976\n-\n77\nand then a Junior Fellow from\n1977\nto\n1980\n. In September\n1980\nWitten was appointed professor of Physics at Princeton. He was awarded a MacArthur Fellowship in\n1982\nand remained as professor of Physics at Princeton until\n1987\nwhen he was appointed as a Professor in the School of Natural Sciences at the Institute for Advanced Study.\nBasically Witten is a mathematical physicist and he has a wealth of important publications which are properly in physics. However, as\nAtiyah\nwrites in\n[\n3\n]\n:-\nAlthough he is definitely a physicist\n(\nas his list of publications clearly shows\n)\nhis command of mathematics is rivalled by few mathematicians, and his ability to interpret physical ideas in mathematical form is quite unique. Time and again he has surprised the mathematical community by his brilliant application of physical insight leading to new and deep mathematical theorems.\nSpeaking at the\nAmerican Mathematical Society\nCentennial Symposium in\n1988\n, Witten explained the relation between geometry and theoretical physics:-\nIt used to be that when one thought of geometry in physics, one thought chiefly of classical physics - and in particular general relativity - rather than\nquantum physics\n. ... Of course, quantum physics had from the beginning a marked influence in many areas of mathematics -\nfunctional analysis\nand\nrepresentation theory\n, to mention just two. ... Several important influences have brought about a change in this situation. One of the principal influences was the recognition - clearly established by the middle\n1970\ns - of the central role of nonabelian gauge theory in elementary particle physics. The other main influence came from the emerging study of supersymmetry and string theory.\nIn his study of these areas of theoretical physics, Witten has achieved a level of mathematics which has led him to be awarded the highest honour that a mathematician can receive, namely a\nFields Medal\n. He received the medal at the International Congress of Mathematicians which was held in Kyoto, Japan in\n1990\n. The Proceedings of the Congress contains two articles describing Witten's mathematical work which led to the award. The main tribute is the article\n[\n3\n]\nby\nAtiyah\n, but\nAtiyah\ncould not be in Kyoto to deliver the address so the address at the Congress was delivered by\nFaddeev\n[\n5\n]\nwho quotes freely from\nAtiyah\n[\n3\n]\n.\nThe first major contribution which led to Witten's Fields Medal was his simpler proof of the positive mass conjecture which had led to a Fields Medal for\nYau\nin\n1982\n. Gawedzki and Soulé describe this work by Witten, which appeared in\n1981\n, in\n[\n9\n]\n:-\nThe proof ... employed in a subtle way the idea of supersymmetry. This became the centrepiece of many of Witten's subsequent works...\nOne of Witten's subsequent works was a paper which\nAtiyah\nsingles out for special mention in\n[\n3\n]\n, namely\nSupersymmetry and\nMorse\ntheory\nwhich appeared in the\nJournal of\ndifferential geometry\nin\n1984\n.\nAtiyah\nwrites that this paper is:-\n... obligatory reading for geometers interested in understanding modern quantum field theory. It also contains a brilliant proof of the classic\nMorse\ninequalities, relating critical points to\nhomology\n. ... Witten explains that \"supersymmetric quantum mechanics\" is just\nHodge\n-\nde Rham\ntheory. The real aim of the paper is however to prepare the ground for supersymmetric quantum field theory as the\nHodge\n-\nde Rham\ntheory of infinite dimensional\nmanifolds\n. It is a measure of Witten's mastery of the field that he has been able to make intelligent and skilful use of this difficult point of view in much of his subsequent work.\nSince this highly influential paper, the ideas in it have become of central importance in the study of differential geometry. Further new ideas of fundamental importance were introduced by Witten and described in\n[\n9\n]\n:-\nWitten subsequently gave a string interpretation of the elliptic genus and provided arguments for its rigidity ... Another piece of new mathematics stemmed from Witten's papers on global gravitational anomalies. ... In recent years, Witten focused his attention on\ntopological\nquantum field theories. These correspond to Lagrangians ... formally giving manifold invariants. Witten described these in terms of the invariants of\nDonaldson\nand\nFloer\n(\nextending the earlier ideas of\nAtiyah\n)\nand generalised the\nJones\nknot polynomial ...\nThe authors of\n[\n9\n]\nsum up Witten's contributions to mathematics:-\nAlthough mostly not in the form of completed proofs, Witten's ideas have triggered major mathematical developments by the force of their vision and their conceptual clarity, his main discoveries soon becoming theorems. His Fields Medal at the\n1990\nInternational Congress of Mathematicians acknowledged the growing impact of his work on contemporary mathematics.\nAtiyah, in\n[\n3\n]\n, expresses the same ideas in the following way:-\n... he has made a profound impact on contemporary mathematics. In his hands physics is once again providing a rich source of inspiration and insight in mathematics. Of course physical insight does not always lead to immediately rigorous mathematical proofs but it frequently leads one in the right direction, and technically correct proofs can then hopefully be found. This is the case with Witten's work. So far the insight has never let him down and rigorous proofs, of the standard we mathematicians rightly expect, have always been forthcoming.\nWitten has received an amazingly long list of awards, in addition to the Fields Medal, which shows the exceptionally high regard in which his contributions are held. He has been awarded honorary degrees from Brandeis University\n(1988)\n, the Hebrew University of Jerusalem\n(1993)\n, Columbia University, New York\n(1996)\n, the University of Southern California\n(2004)\n, Johns Hopkins University\n(2005)\n, and Harvard University\n(2005)\n. He has received the\nEinstein\nMedal from the Einstein Society of Berne, Switzerland\n(1985)\n, the Award for Physical and Mathematical Sciences from the\nNew York Academy of Sciences\n(1985)\n, the\nDirac\nMedal from the International Center for Theoretical Physics\n(1985)\n, the Alan T Waterman Award from the National Science Foundation\n(1986)\n, the Madison Medal from Princeton University\n(1992)\n, the New Jersey Pride Award\n(1996)\n, the Award of the Golden Plate from the American Academy of Achievement\n(1997)\n, the\nKlein\nMedal from Stockholm University\n(1998)\n, the Dannie Heineman Prize from the American Institute of Physics\n(1998)\n, the Nemmers Prize in Mathematics from Northwestern University\n(2000)\n, the Clay Research Award from the Clay Mathematics Institute\n(2001)\n, the Shalom Award from Americans for Peace Now\n(2002)\n, the National Medal of Science\n(2003)\n, the\nPythagoras\nAward from Crotone, Italy\n(2005)\n, the Harvey Prize from the Technion, Israel\n(2006)\n, the Poincaré Prize from the International Association Of Mathematical Physics\n(2006)\n, and the Crafoord Prize in Mathematics from The\nRoyal Swedish Academy of Sciences\n(2008)\n. He has been elected a Fellow of numerous academies and societies such as\nAmerican Academy of Arts and Sciences\n(1984)\n, the American Physical Society\n(1984)\n, the\nNational Academy of Sciences\n(1988)\n, the American Philosophical Society\n(1994)\n, the\nRoyal Society of London\n(1998)\n, the\nAcademy of Sciences of Paris\n(2000)\n, and the\nPontifical Academy of Sciences\n(2006)\n.",
  "matematicos_citados_na_biografia": [
    "Atiyah",
    "American Mathematical Society",
    "quantum physics",
    "functional analysis",
    "representation theory",
    "Fields Medal",
    "Faddeev",
    "Yau",
    "Morse",
    "differential geometry",
    "homology",
    "Hodge",
    "de Rham",
    "manifolds",
    "topological",
    "Donaldson",
    "Floer",
    "Jones",
    "Einstein",
    "New York Academy of Sciences",
    "Dirac",
    "Klein",
    "Pythagoras",
    "Royal Swedish Academy of Sciences",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Royal Society of London",
    "Academy of Sciences of Paris",
    "Pontifical Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}