{
  "nome_completo": "Edward Kasner",
  "nome_curto": "Edward Kasner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kasner/",
  "data_nascimento": "2 April 1878",
  "local_nascimento": "New York City, New York, USA",
  "data_morte": "7 January 1955",
  "local_morte": "New York City, New York, USA",
  "summary": "Edward Kasner was an American mathematician who worked on differential geometry.",
  "biografia": "Edward Kasner\n's parents, Fanny Ritterman and Bernard Kasner, were born in Austria in\n1843\nand\n1841\nrespectively. They emigrated to the United States in the late\n1860\ns, settling in New York. They had eight children, Edward being the sixth child with older siblings Annie, Marcus, Alexander, Lottie and Adolf. Edward's\n[\n4\n]\n:-\n... affection and loyalty\n[\nfor his family\n]\nover the years formed one of the cornerstones of his character.\nHe was brought up in New York where he attended Public School No\n2\nin lower Manhattan\n(\nclose to his home\n)\n[\n4\n]\n:-\nFinding elementary school arithmetic an insufficient challenge to his ability, the boy Kasner obtained an algebra text and would often occupy himself during the arithmetic lesson by solving simultaneous quadratics on his slate ...\nHe completed this stage of his education in\n1891\nat the age of thirteen. He received the gold medal from the elementary school for the best overall performance as well as numerous other top awards for excellence. Then, in\n1891\n, he entered the College of the City of New York. This school, founded as the Free Academy of the City of New York in\n1847\n, provided both high school and degree level education. Accepting children of immigrants and of the poor solely on academic merit, it provided free education in its buildings in Lexington Avenue and\n23\nrd\nStreet in New York City. Kasner was awarded a B.S. in\n1896\nhaving studied a range of subjects including mathematics, astronomy, logic, physics, and political science. He received awards in all these subjects and was awarded the gold medal in mathematics.\nHaving completed his first degree, Kasner went to Columbia University for his graduate studies. He was awarded a Master's degree in\n1897\nand continued to work towards his doctorate advised by\nFrank Nelson Cole\n, who had been appointed to a professorship at Columbia in\n1895\n. At this time it was unusual for an American to study for a doctorate in the United States - Germany was the preferred place for Americans to go for graduate studies.\nCole\n, who had studied for several years with\nFelix Klein\nin Leipzig, was able to use this experience in advising Kasner who was awarded his Ph.D. in\n1899\nfor his thesis\nThe Invariant Theory of the Inversion Group: Geometry upon a Quadric Surface\n. He became one of the first people to be awarded a Ph.D. in mathematics by Columbia University. The thesis was published in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1900\n.\nAlthough he had been awarded a doctorate without making the usual visit to Germany, Kasner did not totally break with tradition for he spent the year\n1899\n-\n1900\nin Göttingen attending courses by\nFelix Klein\nand\nDavid Hilbert\n. He returned to New York after the year abroad and was appointed as a mathematics tutor at Barnard College, which had been affiliated to Columbia University from its founding in\n1889\n. In\n1904\nhe was invited to address the International Congress of Arts and Sciences meeting at St Louis. This Congress was organised as part of the Louisiana Purchase Exposition\n(\nSt Louis World's Fair\n)\nput on to celebrate the\n100\nth\nanniversary of Louisiana Territory becoming a US State. Kasner gave the lecture\nPresent Problems of Geometry\nand was delighted to have\nHenri Poincaré\n, another of the speakers at the Congress, in the audience. He became an Instructor in Mathematics at Barnard College in\n1905\n, and was promoted to adjunct professor in the following year. He held this post until\n1910\nwhen he was appointed as a full professor at Columbia University. In\n1937\nhe was named\nRobert Adrain\nProfessor of Mathematics at Columbia. He held this Chair until he retired in\n1949\nwhen he was named\nAdrain\nProfessor Emeritus.\nJesse Douglas\n, Kasner's most famous student, undertook research at Columbia between\n1916\nand\n1920\n. He summarises Kasner's main research contributions as follows\n[\n4\n]\n:-\nKasner's principal mathematical contributions were in the field of geometry, chiefly\ndifferential geometry\n. His basic mental outlook and equipment, imaginative, intuitive, concrete, visual, fitted him most naturally for work in this branch of mathematics. He observed that many propositions in mathematical physics, in analysis, in algebra, had an essence that was purely geometrical, and could be stated entirely in terms of spatial relations without reference to other concepts peculiar to the special subject, such as force, mass, time, or number. His program was then to distill this geometric essence, and to analyze it from various points of view, particularly with regard to any interesting problems that might be suggested in this way. A rough subdivision of Kasner's scientific career might be made into four periods according to his dominant interest at the time: Differential-Geometric Aspects of Dynamics\n(1905\n-\n1920)\n, Geometric Aspects of the\nEinstein\nTheory of Relativity\n(1920\n-\n1927)\n, Polygenic Functions\n(1927\n-\n1940)\n, Horn Angles\n(1940\n-\n1955)\n.\nIn\n[\n4\n]\nDouglas\nrelates an interesting account of Saturday afternoon excursions Kasner organised for his research students:-\nWe ... would meet Kasner at the Fort Lee ferry and take the ride to the Jersey shore, then the trolley car to the top of the Palisades. On the way to the woods we might stop to buy some cookies; these were to consume with the tea which Kasner brewed in a pot, dug up from its hiding place under a log, where it had been left at the end of the previous excursion. It was amusing that Kasner could direct us unerringly to this cache in spite of the absence of any markers that we could notice. Water was obtained by Kasner from a nearby stream, and heated over a fire built from dead branches and leaves which we had gathered. Around this we would then sit through the afternoon, conversing about our teaching at Columbia, about mathematical research, and about random topics of interest. As the sun faded and darkness began to fall, Kasner would arise at the psychological moment signalled by a halt in the conversation, and carefully extinguish the fire with some water kept in reserve - we then knew it was time to start for home.\nKasner is best remembered today for the term 'googol' and for his remarkable book\nMathematics and the Imagination\n(1940)\nco-authored with James R Newman. We quote Kasner's description of where the term googol came from as given in\nMathematics and the Imagination\n:-\nWords of wisdom are spoken by children as least as often by scientists. The name \"googol\" was invented by a child\n(\nDr Kasner's nine-year-old nephew\n)\nwho was asked to think up a name for a very big number, namely,\n1\nwith a hundred zeros after it. He was very certain that this number was not infinite, and therefore equally certain that it had to have a name. At the same time that he suggested \"googol\" he gave a name for a still larger number: \"Googolplex.\" A googolplex is much larger than a googol, but is still finite, as the inventor of the name was quick to point out. It was suggested that a googolplex should be\n1\n, followed by writing zeros until you get tired. This is a description of what would happen if one actually tried to write a googolplex, but different people get tired at different times and it would never do to have Carnera a better mathematician than Dr\nEinstein\n, simply because he had more endurance. The googolplex then, is a specific finite number, with so many zeros after the\n1\nthat the number is a googol. A googolplex is much bigger than a googol. You will get some idea of the size of this very large but finite number from the fact that there would not be enough room to write it, if you went to the farthest star, touring all the nebulae and putting down zeros every inch of the way.\nThe web search engine, perhaps the most well-known web page, called Google is simply a misspelling of googol.\nIn\nMathematics and the Imagination\nthe authors aim:-\n... to show by its very diversity something of the character of mathematics, of its bold, untrammeled spirit, of how, as both an art and a science, it has continued to lead the creative faculties beyond even imagination and intuition.\nHerbert Turnbull\ngives an indication of the contents of the book in his review\n[\n9\n]\n:-\nIt is packed with information and deals with all the elementary ingredients of mathematics, number, shape, line, series, pattern, infinity, paradox, chance, change, with copious and entertaining visual aids: and the treatment is refreshing. The book is at once a collection of mathematical puzzles and surprises, a pleasantly written history of mathematical thought, and a real attempt to bring before the interested but unprofessional reader the characteristic findings of mathematicians.\nI B Cohen, like all the reviewers referenced below, is full of praise for the book and writes:-\n... it is the best account of modern mathematics that we have. It is written in a graceful style, combining clarity of exposition with good humour\nG W Dunnington realised a few months after publication of the book that it was a big hit:-\nThis volume has already taken its place among the current best sellers. Apparently it has succeeded in communicating to the layman something of the pleasure experienced by the creative mathematician in difficult problem solving.\nE T Bell\nwrites a year after the book was published:-\nThis is a highly successful popular presentation of certain ideas of modern mathematics. It departs from the usual trite popularizations of mathematics ... we trust that it will have a long and prosperous career. It is something new, of its own kind, in the popularization of mathematics.\nIndeed\nBell\nwas right and the book continues to be popular more than\n70\nyears after its first publication.\nWe should note Kasner's talents as a teacher at all levels. He was often invited to talk about mathematics in elementary schools and high schools. He was able to get across deep mathematical ideas with a careful selection of problems which brought out the flavour of mathematical research to children at an early stage in their education. As a university lecturer to undergraduates he excelled, again getting an intuitive understanding across without undue rigour. He often claimed \"Rigour is for dull people\" but as\nDouglas\npoints out\n[\n4\n]\n:-\n... he was not in any sense careless in his scientific work or its presentation; he simply believed in such a degree of accuracy as was sufficient for the clear comprehension of the theory or problem at hand. Anything more than this he regarded as affectation, positively harmful in its tendency to block the road to that clear insight into essentials, and view of related problems, which he considered paramount.\nFor his graduate students, who included\nJoseph Ritt\n,\nJesse Douglas\nand John De Cicco, Kasner put on his famous Seminar in Differential Geometry\n[\n4\n]\n:-\nI think it may truly be said that nearly every mathematician who arose in the New York area during the first half of this century - whether his main interest was differential geometry or not - attended this seminar at some time during his course of study, and derived from it illumination and inspiration.\nKasner received many honours. He was vice-president of the American Association for the Advancement of Science in\n1906\n, and vice-president of the\nAmerican Mathematical Society\nin\n1906\n. The greatest honour he received was election to the\nNational Academy of Sciences\nin\n1917\n. The University of Columbia celebrated its bicentenary in\n1954\nand, as part of these celebrations, they gave Kasner an honorary doctorate on\n31\nOctober during\n[\n4\n]\n:-\n... a most impressive ceremony in the Cathedral of St John the Divine, near the campus.\nBy this time he was already seriously ill, having suffered a stroke in July\n1951\n. Following receiving his honorary degree, his health steadily declined and he died six months later.\nDouglas\nends his biography of Kasner by pointing out that he:-\n... began his mathematical career at the turn of the century, America occupied a minor position in world mathematics. If today this position is patently a leading one, then some significant portion of the credit must be assigned to the work and influence of Edward Kasner.",
  "matematicos_citados_na_biografia": [
    "Frank Nelson Cole",
    "Cole",
    "Felix Klein",
    "American Mathematical Society",
    "David Hilbert",
    "Henri Poincaré",
    "Robert Adrain",
    "Adrain",
    "Jesse Douglas",
    "differential geometry",
    "Einstein",
    "Douglas",
    "Herbert Turnbull",
    "E T Bell",
    "Bell",
    "Joseph Ritt",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}