{
  "nome_completo": "Edwin Bidwell Wilson",
  "nome_curto": "Edwin Wilson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilson_Edwin/",
  "data_nascimento": "25 April 1879",
  "local_nascimento": "Hartford, Connecticut, USA",
  "data_morte": "28 December 1964",
  "local_morte": "Brookline, Massachusetts, USA",
  "summary": "Edwin Wilson was an American mathematician and statistician who worked in many different areas.",
  "biografia": "Edwin Wilson\n's father, Edwin Horace Wilson, was a teacher in a secondary school. His mother was Jane Amelia Bidwell. Wilson attended Harvard University, graduating with a A.B. in\n1899\n. He then decided to work for his doctorate at Yale and there he was a student of\nGibbs\n.\nWilson graduated from Yale with a Ph.D. in\n1901\nand, in the same year, a textbook which he had written on vector analysis was published.\nVector analysis\n(1901)\nwas based on\nGibbs\n's lectures and\n[\n1\n]\n:-\nThis beautiful work, published when Wilson was only twenty-two years old, had a profound and lasting influence on the notation for and the use of vector analysis.\nWilson was appointed an Instructor at Yale in\n1900\nand, after being awarded his doctorate, Wilson went to Paris where he studied at the École Polytechnique, the Sorbonne and the Collège de France during\n1902\n-\n3\n. On returning to the United States he continued to teach mathematics as an Instructor at Yale. He became interested in the foundations of geometry, particularly in projective and\ndifferential geometry\nand he published a paper\nThe so-called foundations of geometry\nin\n1903\nwhich criticised\nHilbert\n's approach to geometry.\nIn\n1906\nWilson was appointed as an assistant professor at Yale, then in\n1907\nhe was appointed associate professor at the Massachusetts Institute of Technology. In\n1911\nhe was promoted to full professor. Wilson had been inspired by\nGibbs\nto work on mathematical physics and he began to write papers on mechanics and the theory of relativity. In\n1912\nWilson published the first American advanced calculus text\n[\n1\n]\n:-\n... a comprehensive text on advanced calculus that was the first really modern book of its kind in the United States.\nHolding a post of professor of physics at the Massachusetts Institute of Technology, he was appointed as Head of the Department of Physics there in\n1917\n. World War I had seen another move in Wilson's research interests for he had undertaken war work which involved aerodynamics and this led him to study the effects of gusts of wind on a plane. In\n1920\nhe published his third major text\nAeronautics\nand gathered round him a group of students working on this topic.\nWilson had already worked in a number of quite distinct areas and his work on aeronautics did not become the major topic for the rest of his career. Not long after the publication of his important text on\nAeronautics\nhis interests moved again, this time towards\nprobability\nand statistics.\nHe did not study statistics for its own, however, but he was interested in applying statistics both to astronomy and to biology. He was the first to study confidence intervals, later rediscovered by\nNeyman\n. In\n1922\nWilson left the Massachusetts Institute of Technology to become Professor of Vital Statistics at the Harvard School of Public Health. He continued to hold this post until he retired in\n1945\n, when he became professor emeritus. After he retired, Wilson spent a year in Glasgow, Scotland when he was Stevenson lecture on Citizenship. From\n1948\nhe was a consultant to the Office of Naval Research in Boston.\nGridgeman and\nMac Lane\nin\n[\n1\n]\nsum up Edwin Wilson's contributions as follows:-\nWilson exhibited a constructively critical mind, quick to expose flaws and errors. Each of his books was an effective and timely exposition of a major subject, and his best papers made lasting impressions. He contributed to many disciplines other than his specialities, including epidemiology, socially, and economics. His greatest originality may have been reached in his papers on statistics - which, interestingly, was a subject he did not explore deeply until middle age.\nWilson received many honours. He was a member of the\nNational Academy of Sciences\nand he served as vice-president during\n1949\n-\n53\n. He was elected a Fellow of the\nRoyal Statistical Society\nof London, and he was a member of the\nAmerican Statistical Association\n, serving as president in\n1929\n. He was also a member of the\nAmerican Academy of Arts and Sciences\n, again serving as president during\n1927\n-\n31\n. Finally we record his membership of the American Philosophical Society.",
  "matematicos_citados_na_biografia": [
    "Gibbs",
    "differential geometry",
    "Hilbert",
    "probability",
    "Neyman",
    "Mac Lane",
    "National Academy of Sciences",
    "Royal Statistical Society",
    "American Statistical Association",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}