{
  "nome_completo": "Efim Isaakovich Zelmanov",
  "nome_curto": "Efim Zelmanov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zelmanov/",
  "data_nascimento": "7 September 1955",
  "local_nascimento": "Khabarovsk, USSR (now Russia)",
  "data_morte": null,
  "local_morte": null,
  "summary": "Efim Zelmanov is a Russian-born American mathematician best known for  his solution of the restricted Burnside problem.",
  "biografia": "Efim Zelmanov\nattended Novosibirsk State University, obtaining his Master's degree in\n1977\n. On being awarded this degree he was appointed to the staff at Novosibirsk State University and taught there while continuing with his own research. He received his Ph.D. from Novosibirsk State University in\n1980\nhaving had his research supervised by Shirshov and Bokut.\nThe thesis he presented for his Ph.D. was on nonassociative algebra. In particular his work completely changed the whole of the subject of\nJordan\nalgebras by extending results from the classical theory of finite dimensional\nJordan\nalgebras to infinite dimensional\nJordan\nalgebras. Zelmanov described this work on\nJordan\nalgebras in his invited lecture to the International Congress of Mathematicians at Warsaw in\n1983\n.\nIn\n1980\nZelmanov was appointed as a Junior Researcher at the Institute of Mathematics of the\nUSSR Academy of Sciences\nat Novosibirsk. On the award of his doctorate\n(\nhabilitation\n)\nin\n1985\n, he was promoted to Senior Researcher. He was promoted again at the Institute of Mathematics of the\nUSSR Academy of Sciences\nin\n1986\n, this time becoming a Leading Researcher.\nIn\n1987\nZelmanov solved one of the big open questions in the theory of\nLie algebras\n. He proved that the\nEngel\nidentity\na\nd\n(\ny\n)\nn\n=\n0\nad(y)^{n} = 0\na\nd\n(\ny\n)\nn\n=\n0\nimplies that the algebra is necessarily nilpotent. This was a classical result for finite dimensional Lie algebras but Zelmanov solved a big open problem when he proved that the result also held for infinite dimensional Lie algebras.\nIn\n1990\nZelmanov was appointed a professor at the University of Wisconsin-Madison in the United States. He held this appointment until\n1994\nwhen he was appointed to the University of Chicago. In\n1995\nhe spent the year at Yale University.\nThe results mentioned above on\nJordan\nalgebras and\nLie\nalgebras would have guaranteed Zelmanov a place as one of the great algebraists of the\n20\nth\ncentury. However, in\n1991\n, Zelmanov went on to settle one of the most fundamental results in the theory of groups which had occupied group theorists throughout the\n20\nth\ncentury. He solved the restricted\nBurnside problem\n.\nIn\n1994\nZelmanov was awarded a\nFields Medal\nfor this work at the International Congress of Mathematicians in Zürich in\n1994\n. Let me explain the background to the restricted Burnside problem, the solution of which was the main reason for the award of the Medal, and also explain how Zelmanov, not a group theorist by training, came to solve one of the most fundamental questions in group theory.\nIn\n1902\nBurnside\nfirst asked whether a finitely generated group in which every element has finite order, is finite. This problem is known as the General Burnside problem. The Burnside problem asks whether, for fixed\nd\nd\nd\nand\nn\nn\nn\n, the group\nB\n(\nd\n,\nn\n)\nB(d, n)\nB\n(\nd\n,\nn\n)\nhaving\nd\nd\nd\ngenerators and in which every element satisfies\nx\nn\n=\n1\nx^{n} = 1\nx\nn\n=\n1\n, is finite. It is really easy to show the\nB\n(\nd\n,\n2\n)\nB(d, 2)\nB\n(\nd\n,\n2\n)\nis finite.\nBurnside\nhimself showed that\nB\n(\nd\n,\n3\n)\nB(d, 3)\nB\n(\nd\n,\n3\n)\nis finite, Sanov showed\nB\n(\nd\n,\n4\n)\nB(d, 4)\nB\n(\nd\n,\n4\n)\nis finite and\nMarshall Hall\nshowed\nB\n(\nd\n,\n6\n)\nB(d, 6)\nB\n(\nd\n,\n6\n)\nis finite.\nBy the\n1930\ns no real progress had been made on either of these problems and the Restricted Burnside problem was formulated\n(\nand so named by\nMagnus\n)\n. It asks whether, for fixed\nd\nd\nd\nand\nn\nn\nn\n, there is a largest finite\nd\nd\nd\ngenerator group in which every element satisfies\nx\nn\n=\n1\nx^{n} = 1\nx\nn\n=\n1\n. This is equivalent to saying that a positive solution to the Restricted\nBurnside\nproblem would show that there are only finitely many finite\nfactor groups\nof\nB\n(\nd\n,\nn\n)\nB(d, n)\nB\n(\nd\n,\nn\n)\n.\nThe General\nBurnside\nproblem was shown to have a negative solution by Golod in\n1964\n. In\n1968\nNovikov\nand\nAdian\nshowed that the\nBurnside\nproblem was false for large\nn\nn\nn\n. The greatest early contribution to the Restricted\nBurnside\nproblem was by\nHall\nand\nHigman\nin\n1956\nwhere they showed that, if the\nSchreier\nconjecture holds, then the Restricted Burnside problem has a positive solution if it could be proved for all\nprime\npowers\nn\nn\nn\n. The\nSchreier\nconjecture, that the outer automorphism groups of finite\nsimple groups\nare\nsoluble\n, was shown to be true as a consequence of the classification of finite simple groups.\nMagnus\nhad reduced the case of the Restricted\nBurnside\nproblem for\nn\nn\nn\nprime to a question about whether Lie algebras satisfying an\nEngel\ncondition are locally nilpotent.\nKostrikin\n, in\n1959\n, proved that such Lie algebras were indeed locally nilpotent. However\nKostrikin\n's proof is not entirely satisfactory and a corrected version only appeared much later.\nWhen Zelmanov began to work on the Restricted\nBurnside\nproblem there were two major difficulties in pushing what had been achieved for\nn\n=\np\nn = p\nn\n=\np\nto\nn\n=\np\nk\nn = p^{k}\nn\n=\np\nk\n. Firstly, there was no reduction of the problem to\nLie\nalgebras with the\nEngel\ncondition. This Zelmanov achieved in\n1989\n.\nZelmanov next set about proving that a\nLie\nalgebra with an\nEngel\ncondition was locally nilpotent. This he achieved in two papers, the first dealing with odd prime characteristic and the second dealing with\nn\n=\np\nk\nn = p^{k}\nn\n=\np\nk\nwhich corresponds to Lie algebras of characteristic\n2\n. Shalev writes in\n[\n3\n]\n:-\nHis stunning proof ... combines an amazing technical capability with highly original ideas from various disciplines. The proof uses a deep structure theory for\n(\nquadratic\n)\nJordan\nalgebras, previously developed by McCrimmon and Zelmanov, as well as divided powers and other tools; it also relies on the joint work of\nKostrikin\nand Zelmanov, which establishes the local nilpotency of the so-called sandwich algebras. While\nLie\nalgebras have long been considered a natural playground in the context of the Restricted Burnside problem, the appearance of\nJordan\nalgebras is unprecedented and quite surprising.\nAt the Groups-St Andrews conference at Galway, Ireland in\n1993\n, of which I\n[\nEFR\n]\nwas a joint organiser, Zelmanov was one of the main speakers and he gave a series of five lectures on\nNil rings methods in the theory of\nnilpotent groups\n. His lectures were beautifully constructed, models of clarity, showing what had been achieved and presenting many glimpses of possible directions for future research. Filled with humour, they were all delivered with Zelmanov's infectious twinkle in his eyes.\nIn addition to the Fields Medal, Zelmanov has received other honours for his outstanding work. He received the Collège de France Medal in January\n1992\nand the Andre Aizenstadt Prize in May\n1996\n.\nZelmanov held a professorship at Yale University from\n1995\nto\n2002\n. During his last year at Yale he was elected to the National Academy of Sciences, becoming the youngest member in the Academy's mathematics division. In\n2002\nhe left Yale and went to the University of California, San Diego, where he was appointed to the Rita L Atkinson Endowed Chair in Mathematics. At the time of his appointment, James Bunch, chair of mathematics at the University of California, San Diego, said:-\nProfessor Zelmanov is one of the top mathematicians in the world and he will play an important role in furthering the international reputation and tradition of excellence of UCSD's mathematics department. He is also an outstanding teacher and I expect him to be an exceptional role model for our students.\nJeffrey Remmel, associate dean of the UCSD's Division of Physical Sciences and the former chair of mathematics who recruited Zelmanov to UCSD said:-\nProfessor Zelmanov's presence at UCSD ensures that we have one of the leading research groups in algebra and representation theory in the country. In addition, he is a superb lecturer and thesis advisor. He will help the mathematics department attract the best young researchers and graduate students in the field of algebra and will have a profound effect on the next generation of mathematics students at UCSD.\nInterestingly, Zelmanov occupied the same office at the University of California, San Diego, as had earlier been occupied by Fields Medal winners\nShing-Tung Yau\nand\nMichael Freedman\n.\nZelmanov's contribution to mathematics goes far beyond his remarkable research and teaching achievements, however, being an editor or on the editorial board of more than ten major mathematics journals, including\nThe Annals of Mathematics\n,\nThe Journal of Algebra\nand\nThe Journal of the American Mathematical Society\n.",
  "matematicos_citados_na_biografia": [
    "Jordan",
    "USSR Academy of Sciences",
    "habilitation",
    "Lie algebras",
    "Engel",
    "Lie",
    "Burnside problem",
    "Fields Medal",
    "Burnside",
    "Marshall Hall",
    "Magnus",
    "factor groups",
    "Novikov",
    "Adian",
    "Hall",
    "Higman",
    "Schreier",
    "prime",
    "simple groups",
    "soluble",
    "Kostrikin",
    "nilpotent groups",
    "Shing-Tung Yau",
    "Michael Freedman"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}