{
  "nome_completo": "Egnatio Pellegrino Rainaldi Danti",
  "nome_curto": "Egnatio Danti",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Danti/",
  "data_nascimento": "April 1536",
  "local_nascimento": "Perugia (now Italy)",
  "data_morte": "19 October 1586",
  "local_morte": "Alatri (now Italy)",
  "summary": "Egnatio Danti was an Italian Dominican who made contributions to architecture, geography and astronomy.",
  "biografia": "Egnatio Danti\nwas given the name\nPellegrino Danti\nwhen he was baptised on\n29\nApril\n1536\nand only took on the name Egnatio\n(\noften written Ignazio\n)\nwhen he entered the Dominican Order in\n1555\n. The situation, however, is slightly more complicated than that for his grandfather was called Pier Vincenzo Rainaldi. As we mention below, Pier Vincenzo Rainaldi was an outstanding scholar and his friends gave him the nickname Dante\n(\nor Danti\n)\nafter the brilliant author of the\nDivine Comedy\n. The name stuck, and Pier Vincenzo's son Guilio also became known as Danti. For simplicity, we shall use the name Egnatio Danti throughout this article.\nEgnatio was born into a family of artists and scholars with mathematical talents. Both his father, Guilio Danti, and grandfather, Pier Vincenzo Rainaldi\n(\nDanti\n)\n, were goldsmiths and architects who had written works on art. His father, made little gold statues and also constructed astronomical and surveying instruments, while his grandfather had translated\nJohannes de Sacrobosco\n's astronomy text of\n1220\n,\nTractatus de Sphaera\n, into Italian. Pier Vincenzo Rainaldi\n(\nDanti\n)\nhad a brother Giovanni Battista Rainaldi\n(\nDanti\n)\nwho made contributions to mathematics and mechanics. Egnatio also had an aunt named Teodora who had written a work on\nEuclid\n's\nElements\nand also books on art. It was indeed a very talented family.\nEgnatio's brother Vincenzo, who was six years older, became famous as a sculptor who was strongly influenced by Michelangelo. His best known work is the group of figures depicting the beheading of John the Baptist above the south portal of the Baptistery in Florence. Vincenzo was also interested in architecture and, in the family tradition, wrote a fifteen volume work on the theory of art. As he grew up Egnatio was taught the fundamentals of painting, architecture, and astronomy by his father and his aunt. He was frequently in artists studios and there he studied the manuals that they used for the mathematical theory of perspective, developing a special love for mathematics. He also grew up in a family endowed with considerable literary skills which he soon learnt. It was natural that he should look to publish works himself and indeed he has at least nine important works to his credit.\nAt the age of\n18\n, on\n7\nMarch\n1555\n, Egnatio Danti entered the Dominican Order having already attended courses at the University of Perugia. As a Dominicans he continued to study philosophy and theology but he became increasingly interested in the study of mathematics, astronomy, and cartography. In\n1562\nhe was asked by Cosimo I de' Medici, the second duke of Florence, to prepare maps and a huge terrestrial globe which is still preserved. Since Danti's brother Vincenzo was a sculptor at Cosimo's court, it is likely that it was this family connection which secured Danti this assignment. The maps were hung on the walls in the Palazzo Vecchio in Florence.\nYou can see pictures of Danti's maps of Italy at\nTHIS LINK\nand of Southern Europe at\nTHIS LINK\nand Northern Europe at\nTHIS LINK\n.\nIn\n1566\nPope Pius V requested that Danti use his architect's skills to design Santa Croce, the church of the Dominican monastery at Bosco Marengo near Alessandria. Pius V had been born at Bosco Marengo so it was a project of great importance to him and, as well as the church, he asked Danti to design the monastery at Bosco Marengo. Danti designed the church as a Latin cross with a dome over the crossing. The side aisles were divided into chapels. Danti's design of the monastery cloisters was particularly fine.\nCosimo became first grand duke of Tuscany in\n1569\nand he appointed Danti to be professor of mathematics at Pisa. In\n1571\nhe made a request of the Dominican Order that Danti be allowed to live at the convent of the Santa Maria Novella in Florence. The reason for this request was that Cosimo wanted his sons Francis and Ferdinand, and the sons of other important families, to be given a good mathematical education, and what better person to undertake such a teaching role than Danti. Francis, Cosimo's eldest son, was\n30\nyears old at the time and certainly did not appreciate the mathematical lessons Danti gave at the Medici Palace. When Cosimo died in April\n1574\n, Francis became the second grand duke of Tuscany. Soon he decided to rid himself of his former mathematics teacher and in\n1575\nDanti was told he had\n24\nhours to leave Tuscany. Danti had been working on a major project at the time of Cosimo's death, being he was in charge of the construction of canals to join Florence to both the Mediterranean Sea and the Adriatic Sea. When Danti was forced to leave Florence this project, which was still at the planning stage, was abandoned.\nDuring his time in Tuscany Danti had continued his interest in astronomy and in particular he had designed a number of astronomical instruments. Two of his instruments were set up in the church of Santa Maria Novella in Florence to make accurate determinations of the vernal\nequinox\nso that he could determine the error in the calendar. In order to calibrate the astronomical year Danti had to calculate accurately the height of the noon sun, which he achieved by making a small hole in the round window of the church to act as a camera obscura. Later he made another hole higher up the south facing facade of the church and, to allow the light to strike this hole, he had to cut a slot in the vault of the church which can still be seen today.\nIn\n1574\n, using his various instruments, Danti detected the\n11\nday error in the calendar when he calculated the vernal equinox to have fallen on\n11\nMarch rather than on\n22\nMarch as it should for the calendar to be in step with the seasons. From that time on Danti became a leading figure in pressing for calendar reform and although his name is not associated with the final decisions on the Gregorian calendar, he was one of the most important people to bring it about. As well as designing astronomical instruments, he also published several works containing descriptions of them. He built other instruments, namely ones to indicate the wind direction both while in Florence, and later also in Bologna, and also made a surveying instrument called the radio latino.\nAfter leaving Tuscany, as Francis required, Danti moved to Bologna in\n1575\n. In the following year the Senate of Bologna appointed him Professor of Mathematics at the university. From\n1577\nDanti accepted a commission from Ghisilieri, the Governor of his native city of Perugia, to map the area around Perugia but this only took him away from Bologna for short periods and during this period he continued with his duties at the University of Bologna. While he lived in Bologna, Danti continued his interest in astronomical instruments and he built a gnomon at the cathedral. After completing his mapping of the Perugia area, he accepted a commission from Pope Gregory XIII to map the Papal states.\nIn\n1580\nGregory XIII appointed Danti as Papal Cosmographer and Mathematician and so he went to Rome where he also served on the commission to reform the calendar. He undertook a range of other tasks in Rome including being in charge of the painters working on the Vatican and preparing plans for the repair of the Claudian harbour at Portus, which had been built originally by the emperor Claudius I in the first century AD.\nHe ended his career back in the church being appointed Bishop of Alatri in Campagna in\n1583\n. It was an appointment made by Pope Gregory XIII in appreciation of the work which Danti had undertaken for him in Rome. Although he only lived for a further three years after this appointment he is highly respected for the work he accomplished in this role during that time.\nThe first edition of\nTrattato dell' Uso, e della fabbrica dell' astrolabio con l'aggiunta del planisfero il Planisferio del Roias\nwas published by Danti in\n1569\n, while the second edition appeared\n1578\n. It was the first book to be published in Italy on the astrolabe. The second edition contains a description of the instruments he built on the church of Santa Maria Novella in Florence. The first edition contains the earliest known picture of woman using a scientific instrument. The work\nLa sfera tradotta da Pier Vincenzo Danto ... e comentata da Frate Ignazio\n(1571)\nwas Danti's commentary on his grandfather's Italian translation of\nSacrobosco\n's\nSphere\nwhich we referred to near the beginning of this article.\nAmong Danti's mathematical publications are editions of some of\nEuclid\n's works, in particular he published an Italian translation of\nEuclid\n's optical treatise under the title\nLa prospettiva di Euclide tradotta e annotata\nin\n1573\n. The next work by Danti we mention is\nUsus et tractatio gnomonis magni, quem Bononiae ipse in Divi Petroni templo conferit anno domini\n1576\nwhich was published in Bologna but contains no date of publication. It was probably published around\n1577\nor\n1578\nand it contains a description of the gnomon he designed and used on Santa Petronio in Bologna in\n1576\n. In\nLe scienze mathematiche ridotte in tavole\n(1577)\nDanti produced a compendium of mathematical knowledge including a summary of the fifteen books\n(\nnow all lost except the first\n)\nby his brother Vincenzo.\nDanti's description of a machine he made to measure the wind appears in\nAnemographia. In anemoscopium verticale instrumentum ostensorem ventum. His accessit ipsium instrumenti constructio\n(1578)\n. One of Danti's most interesting publications was\nLe due regole della prospettiva pratica di m. Iacomo Barozzi da Vignola\n(1583)\nwhich is his commentary on Vignola's perspective rules.\nIn his introduction to this work Danti wrote a brief history of perspective:-\n... we know of no book or written document which has come down to us from ancient practitioners, although they were mot excellent, as is convincingly shown by the descriptions of the stage scenery they made, which was much prized both in Athens among the Greeks and in Rome among the Latins. But in our own time, among those who have left something of note in this art, the earliest, and one who wrote with best method and form, was Messer Pietro della\nFrancesca\ndal Borgo Sansepolcro, from whom we have today three books in manuscript, most excellently illustrated; and whoever wants to know how excellent they are should look to Daniele Barbaro, who has transcribed a great part of them in his book on Perspective.\nFinally, among Danti's publications, we mention\nTrattato del radio latino\n(1586)\nwhich is Danti's work describing his surveying instrument. This book appeared in the year in which Danti died. The other task he undertook just before his death was to travel to Rome, at the request of Pope Sixtus, to assist the architect Domenico Fontana, who had become architect to the papacy when Sixtus was elected, in moving the Egyptian obelisk from its place in the circus of the Vatican. The obelisk had been brought to Rome in the\n1\nst\ncentury AD and Danti and Fontana erected it in\n1586\nwhere it now stands in the centre of St Peter's Square in the Vatican. After his return from this trip to Rome, Danti contracted pneumonia from which he died.",
  "matematicos_citados_na_biografia": [
    "Johannes de Sacrobosco",
    "Euclid",
    "THIS LINK",
    "equinox",
    "Sacrobosco",
    "Francesca"
  ],
  "imagens": [
    "danti.jpg"
  ]
}