{
  "nome_completo": "Emanuel Czuber",
  "nome_curto": "Emanuel Czuber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Czuber/",
  "data_nascimento": "19 January 1851",
  "local_nascimento": "Prague, Bohemia (now Czech Republic)",
  "data_morte": "22 August 1925",
  "local_morte": "Gnigl, near Salzburg, Austria",
  "summary": "Emanuel Czuber was a Czech mathematician who studied was probability theory and related areas.",
  "biografia": "Emanuel Czuber\n's name is sometimes written as sometimes\nCubr\n. He graduated from a German secondary school\n(\nRealschule\n)\nin\n1869\nand continued his studies at the German Technical University at Prague. There he played an active part in the Association for Free Lectures on Mathematics which was a student association and the predecessor of the\nUnion of Czech Mathematicians and Physicists\n. From\n1872\nto\n1874\n, while he was still a student, he acted as an assistant to Karel Koristka. He continued at the same position in\n1875\n. He submitted his\nhabilitation\nthesis on practical geometry\n(\ngeodesy\n)\nto the Technical University at Prague in\n1876\nand obtained the right to lecture. From\n1875\nto\n1886\nhe taught at the Second German Realschule in Prague. He married Johanna Liebleina in\n1878\nand their daughter Berta, born in\n1879\n, married the younger brother of Franz Ferdinand d'Este, the successor to Austrian throne, in\n1909\n. Sadly she died in\n1916\n.\nCzuber was appointed as an ordinary professor\n(\nequivalent to full professor in today's American system\n)\nat the German Technical University in Brno in\n1886\n. In the academic year\n1890\n-\n91\nhe was a Rector of the university. After the end of the academic year\n1890\n-\n91\nhe took up an appointment as an ordinary professor at the Technical University in Vienna. The position became vacant when Anton Winckler applied for retirement and, although Czuber was not the first choice to fill the chair, other people who were put forward such as Moriz Allé and then\nEmil Weyr\nwere not interested in accepting it. Czuber was Rector in the academic year\n1894\n-\n95\nand continued to hold the position of professor at Technical University of Vienna up to\n1921\nwhen he retired.\nAmong the topics Czuber studied was\nprobability theory\nand related areas, contributing in\n1900\nto the\nEncyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of Mathematical Sciences\n)\n. In fact he wrote the first papers with original results on the probability theory in the Czech region. A large part of his studies, however, was devoted to questions concerning actuarial mathematics. He wrote several books\n(\nin German\n)\nsuch as\nTheorie der Beobachtungsfehler\nⓉ\n(\nTheory of observational errors\n)\n(1891)\n,\nDie entwicklung der Wahrschinlichkeitstheorie und ihre Anwendungen\nⓉ\n(\nWorking with probability theory and its applications\n)\n(1898)\n,\nDie Wahrschinlichkeitsrechnung und ihre Anwendungen auf Fehlerausgleichung . Statistik und Lebensversicherung\nⓉ\n(\nProbability theory and its applications to error evaluation equation, statistics and life insurance\n)\n(\nfirst edition\n1903\n, second edition\n1908\n, reprinted\n1968)\n,\nDie statistische Forschungsmethoden\nⓉ\n(\nStatistical research tethods\n)\n(1921)\n,\nDie philosophischen Grundlagen der Wahrschinlichkeitsrechnung\nⓉ\n(\nThe philosophical foundations of probability theory\n)\n(1923)\n, and\nMathematische Bevölkerungstheorie\nⓉ\n(\nMathematical population Theory\n)\n(1923)\n.\nFor several years he was an editor of\nTechnische Blätter\nfrom\n1876\nto\n1886\n. He also wrote some textbooks, for example\nLehrbuch über Differential- und Integralrechnung\nⓉ\n(\nA textbook on calculus\n)\n(1898)\nand\nEinführung in die höhere Mathematik\nⓉ\n(\nIntroduction to higher mathematics\n)\n(1909)\n. He translated a textbook\nCalcul des probabiliés\nⓉ\n(\nCalculus of probabilities\n)\nwhich had been written by Franz A Meyer. On the other hand his book\nWahrscheinlichkeiten und Mittelwerte\nⓉ\n(\nProbabilities and averages\n)\n(1884)\nwas translated into French, although the translation was not published until\n1902\n. As an author he was active right up to the end of his life.\nHe was honoured many times: at the age of\n48\nhe was a \"court advisor\"\n(\na special title typical for Austro-Hungarian Empire\n)\n. He also received an honorary degree from the Technical University in Munich in\n1918\n.",
  "matematicos_citados_na_biografia": [
    "Union of Czech Mathematicians and Physicists",
    "habilitation",
    "Emil Weyr",
    "probability theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}