{
  "nome_completo": "Émile Léonard Mathieu",
  "nome_curto": "Émile Mathieu",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mathieu_Emile/",
  "data_nascimento": "15 May 1835",
  "local_nascimento": "Metz, France",
  "data_morte": "19 October 1890",
  "local_morte": "Nancy, France",
  "summary": "Emile Mathieu is remembered especially for his discovery ( in 1860 and 1873) of five sporadic simple groups named after him.",
  "biografia": "Émile Mathieu\nis remembered especially for his discovery\n(\nin\n1860\nand\n1873)\nof five sporadic\nsimple groups\nnamed after him. These were studied in his thesis on transitive functions.\nÉmile Mathieu was born into a family of minor civil servants. His father, Nicolas Mathieu, was a cashier at the Tax Office of the city. His mother, Amélie Antoinette Aubertin, was from Metz while her brother, Pierre Aubertin, the uncle of our mathematician, had attended the École Polytechnique, was a colonel of artillery and the director of a foundry which made cannons. Émile Mathieu was brought up in Metz, and he attended school at the Lycée de Metz in that town. He excelled at school, first in classical studies showing remarkable abilities in Latin and Greek compositions. However, once he had met mathematics when he was in his teenage years, it became the only subject which he wanted to pursue. We mentioned above that his uncle Pierre Aubertin had studied at the École Polytechnique and he advised Émile on preparing himself for the entrance examinations which he took successfully in\n1854\n.\nEntering the École Polytechnique in Paris his progress was almost unbelievable, even given the remarkable achievements of the brilliant mathematicians in this archive who also attended this institution. It took Mathieu only eighteen months to complete the whole course which he had finished by\n1856\n. At this stage he was set on a military career but shortly after completing his studies he resigned his commission in the army and he continued to study for a doctorate. First he had to get a Bachelor's Degree which he had not taken since he thought that was not necessary when he intended to follow a military career. For this degree he presented his paper\nNouveaux théorèmes sur les équations algébriques\nⓉ\n(\nNew theorems on algebraic equations\n)\nwhich was examined by\nJean-Marie Duhamel\n. He had already published this paper in\n1856\nin the\nNouvelles annales de mathématiques\n.  By March\n1859\nhe had been awarded his Docteur ès Sciences by the Faculty of Science in Paris for his thesis\nSur le nombre de valeurs que peut acquérir une fonction quand on y permute ses lettres de toutes les manières possibles\nⓉ\n(\n5792\n, On the number of values that a function can acquire when its letters are exchanged in all possible ways\n)\non transitive functions, the work which led to his initial discovery of sporadic simple groups. He defended his thesis before the examining committee consisting of\nGabriel Lamé\n(\nchairman\n)\n,\nJoseph Liouville\nand\nJoseph Alfred Serret\non\n28\nMarch. Mathieu published the results from his thesis in two papers\nMémoire sur le nombre de valeurs que peut acquérir une fonction quand on y permute ses variables de toutes les manières possibles\nⓉ\n(\nMemoir on the number of values that a function can acquire when its variables are switched in all possible ways\n)\n(1860)\nand\nMémoire sur l'étude des fonctions de plusieurs quantités, sur la manière de les former et sur les substitutions qui les laissent invariables\nⓉ\n(\nThesis on the study of the functions of several variables, on the manner of forming them, and on the substitutions which leave them invariate\n)\n(1861)\nboth of which were published in\nLiouville\n's\nJournal de mathématiques pures et appliquées\n.\nIn the first of these papers, Mathieu showed the existence of an infinite family of\n3\n-transitive groups of degree\np\n+\n1\np + 1\np\n+\n1\nand of order\np\n(\np\n2\n−\n1\n)\np(p^{2} - 1)\np\n(\np\n2\n−\n1\n)\n. This generalised a discovery made by\nCauchy\nin\n1846\nwhen he discovered the\n3\n-transitive group of degree\n5\nof order\n120\nwhich one obtains as the\np\n=\n5\np = 5\np\n=\n5\ncase of Mathieu's infinite series. The really important paper was, however, the second of these papers in which, starting with a transitive group\nH\nH\nH\nof degree\nn\nn\nn\n, he attempted to construct a doubly transitive group\nG\nG\nG\nof degree\nn\n+\n1\nn + 1\nn\n+\n1\nwhich contained a subgroup isomorphic to\nH\nH\nH\n, namely the subgroup of permutations fixing the\n(\nn\n+\n1\n)\n(n+1)\n(\nn\n+\n1\n)\nst  letter. If he was successful in this construction, he went on to try to construct a\n3\n-transitive group. Of course this is not always possible but Mathieu claimed that, with an algorithm he had found to construct multiply transitive groups, he could construct a\n5\n-transitive group of degree\n12\n, and a\n5\n-transitive group of degree\n24\n. These are the groups now known as\nM\n12\nM_{12}\nM\n1\n2\n​\nand\nM\n24\nM_{24}\nM\n2\n4\n​\nbut it was only in\n1873\nthat Mathieu exhibited his groups in the paper\nSur la fonction cinq fois transitive de\n24\nquantités\nⓉ\n(\nOn the five-times transitive  function of\n24\nvariables\n)\n.\nPierre Duhem\nexplains how, after publishing these papers, Mathieu was highly regarded\n[\n4\n]\n:-\nIn April,\n1862\n, the\nParis Academy of Sciences\nhad to elect a member in the section of geometry.\nLamé\nwho at the time was dean of the section asked that the name of Émile Mathieu be placed on the list of candidates. Nor was\nLamé\nalone with his opinion in the Academy;\nLiouville\nfully approved it. This honour conferred upon a young man of not yet twenty-seven years of age who had not taken any steps to solicit such distinction was indeed a brilliant promise for the future. Who would then have predicted that he who so early received this promise was to die at the age of fifty-five, after a life wholly consecrated to the advance of science without being admitted by the Academy even among the number of its correspondents?\nProgress as remarkable as that achieved by Mathieu would seem to put him in the ideal position to obtain a university appointment, even though he had failed to be elected to the\nAcadémie des Sciences\n, but this was not forthcoming. Feeling he would stand a better chance of a university position if he changed to undertake research in applied mathematics, he did so. He wrote\n[\n4\n]\n:-\nNot having found the encouragement I had expected for my researches in pure mathematics, I gradually inclined toward applied mathematics, not for the sake of any gain that I might derive from them, but in the hope that the results of my investigations would more engage the interest of scientific men.\nSadly, his move to applied mathematics did not result in the advantages for which he hoped. He took on work as a private tutor of mathematics and he continued in this role for ten years. He also taught special mathematics classes in the lycée Charlemagne, the lycée Saint-Louis, and the lycée de Metz. He did suffer an illness in\n1863\nwhen he went back to live with his mother while he recovered. In\n1866\nLamé\nbecame ill and requested the Minister of Public Instruction, Victor Duruy, that Mathieu be allowed to take over his teaching at the Sorbonne. Mathieu presented to the Minister a list of recommendations signed by\nJoseph Alfred Serret\n,\nJean Victor Poncelet\n,\nJean-Marie Duhamel\n,\nJoseph Liouville\n,\nMichel Chasles\n,\nCharles Delaunay\n, and\nVictor Puiseux\n. Despite this support from the leading mathematicians of the day, the Faculty of Science preferred to appoint\nCharles Auguste Briot\n.\nDespite these setbacks, in\n1867\nMathieu received acknowledgement of the importance of his research with the award of a gold medal at the Congress of the Scientific Societies. At around the same time\nJoseph Bertrand\npublished his\nReport on the progress of mathematical analysis\nwhich contains the following reference to Mathieu's work:-\nM E Mathieu has studied far more fully than had been done before, the idea of transitive functions, first introduced by\nCauchy\n, and his memoir deserves quite special mention, on account both of the importance of the new results it contains and of the ingenious form of the proofs. Other memoirs by M Mathieu, relating to mathematical physics, give evidence, like his algebraical researches, of acute penetration and broad learning. An account of these memoirs will be given in another report, whose author, I trust, will heartily join me in calling attention to a young man who truly possesses the gifts of a mathematician, but has so far, in spite of the estimation in which he is held by all, remained outside the sphere to which his remarkable investigations ought to gain him ready access.\nAs compensation for being passed over in this way, the Minister proposed Mathieu give a supplementary course at the Faculty of Science in\n1867\n-\n68\nso that his teaching ability could be judged. Duruy wrote to Mathieu\n(\nsee for example\n[\n3\n]\n)\n:-\nUnder close supervision by the illustrious scholars who make up the Faculty, young professors come to try out their abilities, show what they are capable of, and consequently, bring themselves to the attention of the administration so that one day they might officially enter into higher education. I seek the men and the means of discovering which among those have not yet performed, it is to give to all who show promise the means of changing hope to certainty or, in case of failure, to spare the administration an unhappy choice.\nMathieu chose as topics for his course the methods of integration in mathematical physics, the theory of numbers and the algebraic resolution of the equations. His course was not a great success. The dean of the Faculty of Science, Henri Milne-Edwards, arranged for Mathieu's lecture course to be in an inconvenient room outside the Sorbonne, in premises belonging to the 'Association philotechnique'. The report on the course noted that the number of students who attended declined rapidly. It added the following\n(\nsee for example\n[\n3\n]\n)\n:-\nM Mathieu is evidently a learned young man, but he does not seem to possess, to a mediocre degree, the other qualities which make a professor. He has little flair, his speech is hesitant; he does not know how to impose himself on his audience, to whom he constantly turns his back. Judging by what I heard, his methods are correct, but a little narrow. In short, it is of little interest.\nDiscouraged by this report and realising that he had little chance of a position in Paris, Mathieu sought a position in the provinces. He was appointed as a professor of mathematics at Besançon in March\n1869\nand, on\n9\nOctober\n1871\nhe married Marie Joséphine Guisse\n(\nborn\n1849)\nin Sainte-Ruffine in the Moselle. Earlier in that year, in the February of\n1871\n, he had sought a position in Nancy. Before we look at the letter he wrote in application, we need to look briefly at the events which had taken place. The Franco-Prussian war had caused major changes to the university system. Germany had captured Strasbourg after a\n50\n-day siege during the Franco-Prussian war of\n1870\n-\n71\nand annexed the city. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in\n1872\n. Xavier Dagobert Bach\n(1813\n-\n1885)\n, the professor at Strasbourg before the war, lost his position and was appointed as professor of pure mathematics at Nancy. As a consequence, the chair of mathematics at Nancy, which had been held by Nicolas Renard\n(1823\n-\n1880)\n, was split in two and Renard was appointed to the chair of applied mathematics at Nancy. Mathieu, wishing a position closer to Lorraine wrote to the dean of the Faculty of Science of Nancy, the naturalist Dominique Alexandre Godron\n(1807\n-\n1880)\n, seeking a chair:-\nI am from Metz as also is my wife; all our parents live in Lorraine; life would therefore be more agreeable in Nancy than in any of the other cities in which faculties are situated. There is the question, at the present time, of a faculty which could compete with advantage against the neighboring German universities. If these ideas are to be taken into account, the scientific qualifications of the professors should be taken into account, and you would perhaps have one more position for me to be accepted.\nAlthough there is no direct criticism of Renard in Mathieu's letter, one must assume that he is saying that, in the circumstances, Nancy needs someone of higher quality than Renard. Certainly Renard believed that Mathieu was trying to have him sent to Besançon so that he could have the chair of Applied Mathematics at Nancy. He absolutely refused to move and Mathieu remained at Besançon where he was appointed to the chair of Pure Mathematics in December\n1871\n. In December\n1873\nXavier Bach retired from the chair of Pure Mathematics at Nancy and, after five years teaching at Besançon, Mathieu moved to Nancy to take up Bach's chair there. He held this chair until his death in\n1890\n.\nHowever, Mathieu still longed to obtain a position in Paris. Shortly after he arrived in Nancy, he tried to obtain a chair at the Sorbonne or the Collège de France but without success. In\n1885\nhe applied for the chair of celestial mechanics at the Collège de France which had become vacant on the death of\nJoseph Serret\n. His remarkable sequence of near misses continued when he was placed second to Maurice Lévy\n(1838\n-\n1910)\nfor this position. A few months later, in September of\n1885\n, he applied for the chair of differential and integral calculus at the Sorbonne which became vacant on the death of\nJean-Claude Bouquet\n. After the chair was left vacant for a year it was filled by\nÉmile Picard\n. In early\n1886\nMathieu was disappointed in his hopes of being awarded the chair of calculus of probabilities and mathematical physics at the Sorbonne held until then by Gabriel Lippmann who, in that year, became Professor of Experimental Physics.\nLamé\nretired in\n1862\nafter he became deaf but his chair was not filled until\n1886\n. It was a chair that Mathieu had hoped to obtain ever since he was asked to substitute for\nLamé\nbut again he was disappointed. He wrote:-\nSince\n19\nyears ago when that illustrious engineer of Mines,\nLamé\n, proposed to me to substitute for him in his chair of mathematical physics, I hoped constantly to obtain this chair. I am currently the only mathematical physicist in France. However, when this chair finally became vacant, a faculty committee has chosen another candidate\n[\nHenri Poincaré\n]\n.\nThere is no doubt who Mathieu blamed for his lack of success, namely\nCharles Hermite\n. In June\n1887\n, Mathieu made this very clear when he wrote:-\nUnder the Republic, the Ministers of Public Instruction having completely lost interest in the questions of higher education, M\nHermite\n, who, before the expulsion of the Jesuits, spent all his afternoons in their house in the Rue des Postes\n(\nno doubt the Sainte-Geneviève school\n)\n, introduced successively into the professorial chairs of the Sorbonne all his friends, his son-in-law\n(\nÉmile Picard\n)\nand his nephew at the age of\n26\nyears. Never has such a scandal occurred in the University under royal governments.\nAlthough one has to feel extremely sorry for Mathieu, who was undoubtedly a mathematician of the very highest calibre, nevertheless, the archives examined by the authors of\n[\n3\n]\nshow that Mathieu had difficult relations with his colleagues, lacked zeal in his teaching duties and was a poor lecturer. There are phrases such as \"embarrassing lecture, badly articulated, painful to hear.\"\nMathieu's main work, after his initial interest in pure mathematics, was in mathematical physics although he did do some important work on the\nhypergeometric function\n. As Grattan-Guinness writes in\n[\n1\n]\n:-\nAlthough Mathieu showed great promise in his early years, he never received such normal signs of approbation as a Paris chair or election to the\nAcadémie des Sciences\n. From his late twenties his main efforts were devoted to the then unfashionable continuation of the great French tradition of mathematical physics, and he extended in sophistication the formation and solution of\npartial differential equation\nfor a wide range of physical problems.\nPerhaps had Mathieu continued to follow up his remarkable discoveries in group theory, he might have achieved more fame and better posts in his lifetime. However, the evidence suggests that it was his lack of teaching skills that told most against him.\nSome of his earliest work in mathematical physics was related to his study of light and he looked at the surfaces of vibrations arising from\nFresnel\nwaves. He also worked on the polarisation of light where he highlighted some weaknesses in\nCauchy\n's results on the topic. He worked on\npotential theory\napplied to elasticity, heat diffusion, and the vibration of bells, a very hard problem. Mathieu studied fluids, in particular examining capillary forces. He also studied magnetic induction and the\nthree body problem\nwhere he applied his work to the perturbations of Jupiter and Saturn.\nIn addition to being remembered for the Mathieu groups, he is also remembered for the Mathieu functions. He discovered these functions, which are special cases of hypergeometric functions, while solving the wave equation for an elliptical membrane moving through a fluid. The Mathieu functions are solutions of the Mathieu equation which is\nd\n2\nu\nd\nz\n2\n=\n(\na\n+\n16\nb\ncos\n⁡\n2\nz\n)\nu\n=\n0.\n\\Large\\frac{d^2 u}{dz^2}\\normalsize = (a + 16b \\cos 2z)u = 0.\nd\nz\n2\nd\n2\nu\n​\n=\n(\na\n+\n1\n6\nb\ncos\n2\nz\n)\nu\n=\n0\n.\nMathieu decided to write eleven treatises describing the applications of mathematics to physics. The first of these works was\nCours de physique mathématique\nⓉ\n(\nCourse of mathematical physics\n)\n(1873)\nwhich Mathieu later wished he had given the title\nOn the methods of integration in mathematical physics\n. In the Preface, Mathieu writes:-\nAs the domain of science broadens and expands it becomes more and more necessary to expound its principles with clearness and conciseness and to substitute for artificial processes, however skilful, the transformations that can be accounted for by the nature of the subject. This is clearly illustrated in comparing the 'Mécanique analytique' of\nLagrange\nwith the 'Vorlesungen' of\nJacobi\non the same subject. Examining the treatment of certain problems in each of these works the results obtained will often be found to be the same; the difference consists in the fact that in the latter work the calculations are performed according to rules laid down in advance.\nIn\n1878\nhe published\nDynamique analytique\nⓉ\n(\nAnalytical dynamics\n)\n. You can read Mathieu's Preface to this work at\nTHIS LINK\n.\nAfter these two works he published:\nThéorie de la capillarité\nⓉ\n(\nTheory of capillarity\n)\n(1883)\n;\nThéorie du potentiel et ses applications à l'électrostatique et au magnétisme. I\nre\npartie: Théorie du potentiel\nⓉ\n(\nTheory of potential and its applications to electrostatics and magnetism. Part I: Theory of potential\n)\n(1885)\n;\nThéorie du potentiel et ses applications à l'électrostatique et au magnétisme. II\ne\npartie: Electrostatique et magnétisme\nⓉ\n(\nTheory of potential and its applications to electrostatics and magnetism. Part II: Electrostatics and magnetism\n)\n(1886)\n;\nThéorie de l'électrodynamique\nⓉ\n(\nTheory of electrodynamics\n)\n(1888)\n;\nThéorie de l'élasticité des corps solides. I\nre\npartie: Considérations générales sur l'élasticité; emploi des coordonnées curvilignes ; problèmes relatifs à l'équilibre de l'élasticité; plaques vibrantes\nⓉ\n(\nTheory of elasticity of solid bodies. Part I: General considerations on elasticity; Use of curvilinear coordinates; Problems related to the equilibrium of elasticity; Vibrating plates\n)\n(1890)\n;\nThéorie de l'élasticité des corps solides. II\ne\npartie: Mouvements vibratoires des corps solides; équilibre de l'élasticité du prisme rectangle\nⓉ\n(\nTheory of elasticity of solid bodies. Part II: Vibratory movements of solid bodies; Equilibrium of the elasticity of the rectangular prism\n)\n(1890)\n. This means that he managed to publish eight of his intended eleven books before his death. In all his books Mathieu kept to the view expressed in his Preface to\nCours de physique mathématique\nⓉ\n(\nCourse of mathematical physics\n)\n.\nPierre Duhem\nwrites\n[\n4\n]\n:-\nIn his 'Analytical dynamics' he introduces at the very beginning the general methods due to\nHamilton\nand\nJacobi\n. In his 'Theory of capillarity' he lays aside the direct consideration of the capillary forces employed by\nPoisson\n, and follows\nGauss\nin establishing the equations for the various problems by seeking to determine the minimum of the potential of the active forces. In the 'Theory of the elasticity of solid bodies' he invariably uses the principle of virtual velocities to throw the problems of equilibrium into equations.\nIn\n[\n1\n]\nGrattan-Guinness describes Mathieu's nature as:-\n... shy and retiring\n[\nwhich\n]\nmay have accounted to some extent for the lack of worldly success in his life and career; but among his colleagues he won only friendship and respect.\nGaston Floquet writes in\n[\n5\n]\n:-\nOf an essentially straightforward, sincere, and generous nature, he was kindness itself. He possessed the devotion that seeks to be ignored. In July,\n1890\n, when the fatal disease had already attacked him, he succeeded in concealing his ill-health from his colleagues, being unwilling to leave to them the burden of his examinations. In September, on his deathbed the same anxiety agitated his mind with respect to the October examinations. His loyal and trustworthy character made him esteemed and beloved by all; in the Faculty at Nancy he had none but friends. Sensitive to any kindness, touched by the slightest mark of sympathy, he belonged to those who are most easily satisfied. He lived in simple style dividing his time between his lectures and his mathematical researches.",
  "matematicos_citados_na_biografia": [
    "simple groups",
    "Jean-Marie Duhamel",
    "Gabriel Lamé",
    "Joseph Liouville",
    "Joseph Alfred Serret",
    "Liouville",
    "Cauchy",
    "Pierre Duhem",
    "Paris Academy of Sciences",
    "Lamé",
    "Académie des Sciences",
    "Jean Victor Poncelet",
    "Michel Chasles",
    "Charles Delaunay",
    "Victor Puiseux",
    "Charles Auguste Briot",
    "Joseph Bertrand",
    "Joseph Serret",
    "Jean-Claude Bouquet",
    "Émile Picard",
    "Henri Poincaré",
    "Charles Hermite",
    "Hermite",
    "hypergeometric function",
    "partial differential equation",
    "Fresnel",
    "potential theory",
    "three body problem",
    "Lagrange",
    "Jacobi",
    "THIS LINK",
    "Hamilton",
    "Poisson",
    "Gauss"
  ],
  "imagens": []
}