{
  "nome_completo": "Gabrielle Émilie Le Tonnelier de  Breteuil Marquise du Châtelet",
  "nome_curto": "Émilie du Châtelet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chatelet/",
  "data_nascimento": "17 December 1706",
  "local_nascimento": "Paris, France",
  "data_morte": "10 September 1749",
  "local_morte": "Lunéville, France",
  "summary": "Émilie du Châtelet was a French noblewoman who became important to mathematics as the translator of Newton's Principia .",
  "biografia": "We should first make some remarks about\nÉmilie du Châtelet\n's name. Before her marriage her name was Gabrielle-Émilie Le Tonnelier de Breteuil and she was called Gabrielle-Émilie by her family but later she was called simply Émilie by Voltaire and others. We should also note that her husband was the Marquis du Chastellet and her publications appear under the name Madame la Marquis du Chastellet. The spelling \"Châtelet\" was introduced by Voltaire and has now become standard. In this biography we will call her \"Émilie\" up to the time of her marriage, and from then \"du Châtelet\".\nÉmilie's father was Louis Nicolas Le Tonnelier de Breteuil. He was an official at the Court of Louis XIV at Versailles with property in Paris and also land in Touraine. He is variously described\n(\n[\n6\n]\nand\n[\n8\n]\n)\nas:-\n... a charmer in his youth... fashionable but slightly ridiculous ... nobody liked him very much ...\nHis cousin, Marie Anne le Fèvre de Caumartin, was sent to a convent when Le Tonnelier realised she was pregnant and he married her three days before she died. His second wife, Gabrielle Anne de Froulay who was Émilie's mother, was brought up in a convent. She is described in\n[\n10\n]\nas \"studious and disciplined\". Le Tonnelier de Breteuil married her in\n1697\nand settled down after buying a position at Court which he held until Louis XIV died in\n1715\n. At this stage he retired to his big house in Paris overlooking the Tuileries gardens. Le Tonnelier de Breteuil lived there with his wife and five children, one being Émilie who was about nine years old when they moved in. They lived on the ground floor while other members of the family lived on the floors above.\nVoltaire wrote in his\nÉloge historique de Madame la Marquise du Châtelet\n(\nsee\n[\n9\n]\n)\n:-\nFrom her most tender childhood, her mind was nourished by reading good authors in more than one language. She started a translation of the Aeneid and I have seen several sections of this filled with the spirit of the author. Later she learnt Italian and English; Tasso and Milton were as familiar to her as Virgil. She made less progress in Spanish, because she was told that there is only one famous book in that language and that this book is frivolous.\nIn his\nMémoires\nVoltaire wrote\n(\nsee\n[\n9\n]\n)\n:-\nHer father ... made her learn Latin, which she knew as well as Mme Dacier; she knew the finest passages of Horace, Virgil and Lucretius by heart; all the works on philosophy by Cicero were familiar to her. Her dominant taste was for mathematics and philosophy.\nHer cousin, Mme de Créqui\n(\nwho was jealous of Émilie and claimed she was four years older than she was, so is almost certainly unduly cruel in her description\n)\nwrote this description of the teenage Émilie\n(\nsee for example\n[\n6\n]\n)\n:-\nMy cousin Émilie was three or four years younger than I, but five or six inches taller ... . She was a colossus in all her limbs - a marvel of strength and a prodigy of clumsiness. She had terrible feet and formidable hands.\nIt is rather remarkable that, in addition to the academic lessons provided by private tutors, Émilie was given lessons in fencing, riding, and gymnastics. This may have been an attempt by her parents to have her overcome her clumsiness and also to use up some of the excess energy she possessed. One might also wonder why she studied mathematics but this must be due at least in part to the fact that M de Mézières, a family friend, encouraged her. Every night Émilie's parents entertained guests in their Paris house and she would have seen mathematicians like\nBernard de Fontenelle\nthere frequently. Most of all, however, mathematics was a subject Émilie loved.\nWhen she was sixteen years old Émilie was introduced to the Court at Versailles by her father. She loved the glamour and extravagant life there. She was married on\n20\nJune\n1725\nto the Marquis Florent-Claude Chastellet. He was a military man who was made governor of Semur-en-Auxois in Burgundy. After the marriage du Châtelet spent time in Semur-en-Auxois but she also lived in Paris and a number of other places. Her husband spent most of his time on garrison duties which meant that he spent long periods away from his wife. Their first child was a daughter, Françoise Gabriel Pauline, born on\n30\nJune\n1726\n, while their second child was a son, Louis Marie Florent, born on\n20\nNovember\n1727\n. Du Châtelet's father died in\n1728\nand after that she made a number of visits to her mother at Créteil. In April\n1733\na second son was born but he died in September\n1734\n. Before this, however, du Châtelet had met Voltaire.\nVoltaire first met du Châtelet while she was still a child for he had been one of the many guests at their parents dinner parties. They met again on one of the first occasions that du Châtelet went out after the birth of her second son. She had already had a number of lovers which was the custom of the time for someone of her status. One lover was\nMaupertuis\nwho was teaching her mathematics around the time that she met Voltaire. However, she quickly developed a strong relationship with Voltaire and he found in her someone\n(\nalmost certainly the only woman in France\n)\nwith whom he could discuss the philosophical and scientific topics which interested him. For example Terrall writes in\n[\n18\n]\nthat du Châtelet was:-\n... the only French woman of her time seriously to develop her talent for mathematics and physics.\nVoltaire had just returned from England, and the two shared a belief that to understand the world one must apply reasoning to scientific evidence. They also both were firmly convinced of the truth of\nNewton\n's world view which at that time was unpopular in France.\nHow could a woman like du Châtelet participate in scientific discussions? The meetings of the\nAcadémie des Sciences\nin Paris were the focus of discussions on research topics but these were not open to women. The other places where discussions took place were the cafés of Paris but again women were not allowed to enter them. On one occasion in\n1734\nshe tried to go into the Café Gradot to discuss mathematics with\nMaupertuis\n. This Paris café was the most famous as a meeting place of the top mathematicians, astronomers and physical scientists and it was the café where\nMaupertuis\nand other mathematicians spent many hours in debate. Du Châtelet, however, was prevented from entering on the grounds that women were not admitted but she was not one to allow convention to dictate what she might do. A week later she appeared at the Café Gradot again, this time dressed as a man. It was not an attempt to fool people, just to make a statement on what she believed was a ridiculous rule. She was allowed in and served by the management, much to\nMaupertuis\n' amusement.\nIn May\n1734\nVoltaire and du Châtelet attended the wedding of the Duc de Richelieu\n(\nwho had been another of du Châtelet's lovers\n)\n. Days later Voltaire was forced to hide for a couple of months after a warrant was issued for his arrest because of his pro-English, anti-French writings. After that he went to live at Cirey, which was the remote house owned by du Châtelet's husband. Voltaire wrote\n(\nsee for example\n[\n9\n]\n)\n:-\nI found in\n1733\na young lady who felt more or less as I did, and who resolved to spend several years in the country to cultivate her mind, far from the tumult of the world. It was the marquise Du Châtelet, the woman who in all France had the greatest disposition for all the sciences. ... Seldom has so fine a mind and so much taste been united with so much ardour for learning; but she also loved the world and all the amusements of her age and sex. Nevertheless she left all this to go and bury herself in a dilapidated house on the frontiers of Champagne and Lorraine, where the land was very fertile and very ugly. She beautified the house, to which she added pleasant gardens. I built a gallery, in which I created a very fine collection of scientific instruments. We had a large library.\nDu Châtelet's husband does not seem to have been unhappy at this arrangement, for he certainly benefited from Voltaire spending large amounts of money improving the house and estate, and frequently the three were at Cirey together. Hénault, after visiting Cirey, wrote about the life du Châtelet and Voltaire lived there\n(\nsee for example\n[\n3\n]\n)\n:-\nI also stopped at Cirey. It is a rare sight. The two of them are there alone, plunged in gaiety. One writes verse in his corner, the other triangles in hers. The architecture of the house is romantic and surprisingly magnificent.\nSoon du Châtelet was putting her mathematical knowledge to use although she continued to have mathematical tuition from experts. It was not simply as a pupil that she worked with mathematicians, for she discussed some topics more in the spirit of a collaborator rather than a pupil. As well as continuing to discuss mathematics with\nMaupertuis\n, she also did so with\nClairaut\n(\nwho also was her lover\n)\n. By\n1736\nVoltaire was working on a book\nEléments de la philosophie de Newton\nⓉ\n(\nElements of the Philosophy of Newton\n)\nwhich explained\nNewton\n's theories in terms that a general reader could understand. It was a work which appeared under Voltaire's name in\n1738\nbut one which he states clearly in the Preface was written jointly with du Châtelet. In fact on one occasion he stated that the work was really hers but this was probably overstating her contribution.\nOther work undertaken by du Châtelet was a translation of Mandeville's\nThe fable of the bees\nwhich is a rather strange work on morals. She did not simply translate it from English to French, however, for she omitted sections, added material\n(\nclearly indicated\n)\nand wrote a Preface. This Preface contains fascinating information about du Châtelet's views on the position of women\n(\nsee for example\n[\n6\n]\n)\n:-\nI feel the full weight of the prejudice which so universally excludes us from the sciences; it is one of the contradictions in life that has always amazed me, seeing that the law allows us to determine the fate of great nations, but that there is no place where we are trained to think ... Let the reader ponder why, at no time in the course of so many centuries, a good tragedy, a good poem, a respected tale, a fine painting, a good book on physics has ever been produced by a woman. Why these creatures whose understanding appears in every way similar to that of men, seem to be stopped by some irresistible force, but until they do, women will have reason to protest against their education. ... I am convinced that many women are either unaware of their talents by reason of the fault in their education or that they bury them on account of prejudice for want of intellectual courage. My own experience confirms this. Chance made me acquainted with men of letters who extended the hand of friendship to me. ... I then began to believe that I was a being with a mind ...\nThe\nAcadémie des Sciences\nin Paris set the topic for the Grand Prix of\n1737\nto be on the nature of fire and its propagation. Both Voltaire and du Châtelet submitted entries, although du Châtelet did not tell Voltaire until after the winners were announced that she had submitted an entry. Although neither won, the prize was won by\nEuler\n, Du Châtelet's\nDissertation sur la nature et la propagation du feu\nⓉ\n(\nDissertation on the nature and spread of fire\n)\nwas published by the\nAcadémie\nin\n1744\nalong with the submissions of Voltaire and the winning entries.\nIn\n1739\nVoltaire and du Châtelet travelled to Brussels where they wanted to settle a law suit regarding some property of du Châtelet's husband. Determined not to allow this to interrupt her studies of mathematics she took large quantities of books with her and also the mathematician\nSamuel König\nwho was engaged to teach her algebra. Du Châtelet worked on a book,\nInstitutions de physique\nⓉ\n(\nPhysics Institutions\n)\nwhile on this trip and it was published in\n1740\n.\nM Kline\nwrites about the contents of this work in a review of\n[\n15\n]\n:-\nShe attempted to integrate Cartesian, Newtonian, and Leibnizian ideas. On the philosophic side the themes she discusses are free will, God's power and role, and the nature of space, matter, and force.\nPublication of\nInstitutions de physique\nⓉ\n(\nPhysics Institutions\n)\nled to a disagreement between du Châtelet and\nSamuel König\nwho seems to have felt that the work was his. Du Châtelet had learnt of\nLeibniz\n's philosophy from\nSamuel König\nand it had so interested her that she had decided to devote a section of her book to his theories of metaphysics. To an extent, therefore,\nKönig\nwas right for du Châtelet knew little of\nLeibniz\n's ideas before he taught her. However this does not make it his book and there is nothing to suggest that his contribution was any more than that of teacher of the author.\nDu Châtelet's major work was a translation of\nNewton\n's\nPrincipia\n. She used the third Latin edition of\nPhilosophiae naturalis principia mathematica\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n, edited by H Pemberton under\nNewton\n's supervision, which had been published in London in\n1726\n. She began work on the translation in\n1745\nand the Royal Privilege for printing was granted to her in the following year. A part was published in\n1756\n, seven years after her death, under the direction of\nClairaut\nwith a preface written by Voltaire. The complete work appeared in\n1759\nand was for many years the only translation of the\nPrincipia\ninto French. Let us quote from Voltaire's Preface\n(\nsee for example\n[\n19\n]\n)\n:-\nMme du Châtelet has rendered a double service to posterity with her translation of the Principia and enriching it with a commentary. ... As regards the algebraic commentary, it is much more than a translation. Mme du Châtelet based this part on the ideas of\nClairaut\n. She worked out the calculations and after each chapter was completed, M\nClairaut\nchecked and corrected it. ... M\nClairaut\nhad the calculations checked by a third person after they were written out so that it was morally impossible that an error would slip into the work due to an oversight ... It is more astonishing that a woman should have been capable of a task which required such depth and hard work ... She believed that death was coming long before she was taken from us. From then on her one thought was to use the little time she thought that remained to complete the work she had undertaken and so cheat death of stealing what she considered was part of herself. Hard and persevering work, continual lack of sleep when rest might have saved her life, led to the death she had foreseen.\nSee the frontispiece of this work at\nTHIS LINK\n.\nDu Châtelet died in child birth at the court of the Duke of Lorraine. The father of the child was her lover at that time, the poet Jean-François de Saint-Lambert, although she had plotted with Voltaire and Saint-Lambert to engineer a situation in which her husband thought he was the father. She was\n42\nyears old and feared that she would not survive child-birth. Her son was\n21\nand clearly disapproved of his mother's pregnancy. She wrote to a friend\n(\nsee for example\n[\n6\n]\n)\n:-\nI am less pleased with my son; I am not sure whether he loves me as much as he should. He did not take my pregnancy very well.\nHer husband, Voltaire and Saint-Lambert were all present at the birth of her child. Voltaire wrote to one of du Châtelet's friends on\n4\nSeptember\n1749\n:-\nMme du Châtelet informs you that this night, being at her desk working on\nNewton\n, she felt a little call. The little call was a daughter, who appeared in an instant. She was laid on a quarto book of geometry. The mother has gone to lie down and, if she were not asleep, she would be writing to you.\nIt seemed for a few days that du Châtelet's fear that she would die would not be realised. However, on\n9\nSeptember she felt very unwell and extremely hot. She asked to be given the manuscript of the translation of\nNewton\n's\nPrincipia\nthat she had been working on and added the date \"\n10\nSeptember\n1749\n\" to it. Soon after that she lost consciousness and died with her husband, Voltaire and Saint-Lambert all present. The baby girl did not survive either. Voltaire wrote to Mme Denis, who was his niece and had been his lover for some years prior to du Châtelet's death\n(\nsee for example\n[\n3\n]\n)\n:-\nMy dear, I have just lost one who was my friend for twenty years. ... To have seen her die, and in such circumstances! and for such a reason! It is frightful.\nBesterman adds a footnote to his translation of \"my friend\" saying:-\nThere is an untranslatable nuance here: Voltaire wrote \"un ami\" in the masculine.\nLet us end this biography by quoting again from Voltaire's Preface\n(\nsee for example\n[\n19\n]\n)\n:-\nNo woman was ever more learned than she was, yet no one deserved less than she did to be called a blue-stocking. She only ever spoke about science to those from whom she thought she could learn; never did she discuss it to attract attention to herself. She was not ever seen gathering around her those circles which wage battles of the mind, where one sets up a kind of tribunal and passes judgement on one's century - which then in its turn judges you most severely. For a long time she moved in circles which did not know her worth and she paid no attention to such ignorance. ... I saw her, one day, divide a nine-figure number by nine other figures, in her head, without any help, in the presence of a mathematician unable to keep up with her.",
  "matematicos_citados_na_biografia": [
    "Bernard de Fontenelle",
    "Maupertuis",
    "Newton",
    "Académie des Sciences",
    "Clairaut",
    "Euler",
    "Académie",
    "Samuel König",
    "M Kline",
    "Leibniz",
    "König",
    "THIS LINK"
  ],
  "imagens": [
    "chatelet.jpg"
  ]
}