{
  "nome_completo": "Emma Markovna Trotskaia Lehmer",
  "nome_curto": "Emma Lehmer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lehmer_Emma/",
  "data_nascimento": "6 November 1906",
  "local_nascimento": "Samara, Russia",
  "data_morte": "7 May  2007",
  "local_morte": "Berkeley, California, USA",
  "summary": "Emma Markovna Lehmer was a Russian-born mathematician known for her work on reciprocity laws in algebraic number theory.",
  "biografia": "Emma Trotskaia\n's parents were Motvey and Nadejda Trotsky. Motvey Trotsky worked for a large Russian sugar company, while Nadejda had been a dentist before marrying. Although Emma Trotskaia only became\nEmma Lehmer\nin\n1928\nafter she married, for the sake of simplicity we will use her married name throughout this article. Emma Lehmer later wrote about the town of her birth:-\nI was born in a town with the lovely sounding name of Samara on the great Volga river...\nIn fact Samara, which was an industrial town and the administrative centre of Samara province, was renamed Kuybyshev in\n1935\n. Emma wrote many years later that she lost all interest in returning to the town of her birth after it was given such an unpleasant sounding name as Kuybyshev, but it reverted to its original name of Samara in\n1991\n, a move which doubtless was strongly approved by Lehmer. In fact Lehmer spent less than four years in Samara before her father was appointed as the Far East representative of the sugar company and posted to Harbin, Manchuria.\nWhy, one might ask, was a Russian sugar company keen to develop its business in Harbin? Fourteen years earlier it had been a small fishing village but it became the construction centre for the Chinese Eastern Railway by the Russians. It was the Russian military base for operations in Manchuria during the Russian-Japanese War of\n1904\n-\n05\n, but at the end of the war had come under joint Chinese-Japanese control. In Harbin, Lehmer was tutored at home until she was\n14\nwhen a new community school opened. It was at this school that Lehmer first developed her love of mathematics, encouraged by a superb mathematics teacher who had been an engineer in Moscow.\nThe Russian revolution which began in\n1917\nled to a large influx of Russian refugees to Harbin. On the one hand this led to the creation of the new school, but on the other hand it made Lehmer realise that returning to Russia to study at university was going to be impossible. She decided instead to go to the United States for her university studies and after completing her schooling in Harbin, she worked for a year doing a number of different jobs such as translating and baby-sitting as well as coaching children in both mathematics and music\n(\nshe was an accomplished pianist\n)\n. This enabled Lehmer to save enough money to make her education in the United States possible.\nLehmer applied to Berkeley for entry: a university which had already accepted other students from Harbin, and she was offered a place for entry in\n1924\n. However, it was not an easy task to get from Harbin to Berkeley. She made the natural first step of going to Japan; since Harbin was jointly under Japanese control this was straightforward. From there she travelled to Canada but not having a student visa on which to enter the United States, she had to spend several weeks in Canada waiting for the process of obtaining one to be completed. Having allowed what should have been plenty of time to reach Berkeley by the start of term, by the time she arrived there classes had already been running for a week.\nShe enrolled for an engineering degree, taking classes in mathematics, physics, chemistry, English and engineering. This was a heavy load for a student to take but this was not what proved a problem, rather it was that she discovered that dexterity with her hands was not one of her strong points making engineering less attractive. After a couple of years she dropped engineering and moved to mathematics as her main subject. Her favourite mathematics lecturer at Berkeley was\nDerrick Norman Lehmer\nand as well as taking several of his courses she did a research project with him on finding pseudosquares. It was at this time that she met his son\nDerrick Lehmer\n. She graduated with a B.A. degree with honours in Mathematics in\n1928\nand in the same year she married Dick Lehmer\n(\nas\nDerrick Lehmer\nwas called\n)\n.\nEmma and Dick then set out on a tour which began in the redwood forest, went on to Japan, and then let\nDick\nmeet Emma's family before returning to Berkeley. After a few weeks there they drove across the United States to Brown University where both enrolled for a Master's degree. While her husband progressed to obtaining this Ph.D. from Brown University, Emma continued working on her Master's Degree while she helped\nDick\nby typing his thesis and working with him reading mathematics papers. She also helped the family finances by coaching mathematics. She received her Master's Degree in\n1930\nfor a thesis entitled\nA Numerical Function Applied to Cyclotomy\nand in the same year the results were published in the\nBulletin of the American Mathematical Society\n.\nThe two Lehmers' life over the next few years involved moving from place to place as\nDick Lehmer\nsought a permanent university post in the particularly difficult times of the Depression. They spent\n1930\n-\n31\nat the California Institute of Technology and\n1931\n-\n32\nat Stanford. Lehmer's first child Laura was born in\n1932\n. After a spell at the Institute for Advanced Study at Princeton, they moved to Lehigh University in Pennsylvania where Lehmer's second child Donald was born. While at Lehigh, Lehmer translated\nPontryagin\n's important book\nTopological Groups\nfrom Russian into English. It was published by\nPrinceton University Press\nin\n1939\n.\nThe Lehmers remained at Lehigh until\n1940\nexcept for the year\n1938\n-\n39\nwhich they spent in England visiting both the University of Cambridge and the University of Manchester. In England they met, among others,\nHardy\n,\nLittlewood\n,\nDavenport\n,\nMahler\n,\nMordell\nand\nErdős\n.\nBack in the United States after the outbreak of World War II, they spent another year at Lehigh before returning to Berkeley in\n1940\n. Emma Lehmer did not teach throughout this period as university rules prevented a husband and wife teaching in the same Department. An exception was made for a short time during the war years when the rule was relaxed and Lehmer did some teaching. They spent\n1945\n-\n46\nat the Aberdeen Proving Ground where\nDick\nhelped to set up and operate the ENIAC computer. Although the computer worked most of the time computing trajectories for ballistics problems, some weekends Lehmer and her husband used it to solve certain number theory problems using the sieve methods that they were working on\n[\n2\n]\n:-\nWhen they could arrange child care, they often stayed at the lab all night long while the ENIAC processed one of their problems. They would return home at the break of dawn. They were pleased to find that the sieve worked in successfully solving problems.\nLehmer found that not having to teach was an advantage to her in giving her more time to work on her research. She wrote around\n60\npapers on different aspects of number theory, about\n20\nof these being joint publications with her husband. In fact her collaboration began as a three way one with Lehmer working with both her husband and her father-in-law. Her collaborations were both over deep mathematical results, as well as developing computers and computational methods to assist in solving number theory problems. For example around\n1930\nthe Lehmers had applied to the Carnegie Institution for funds to construct a computer to factorise numbers. The proposal reads in part:-\nTo perform the operation with pencil and paper one must start with the million or so numbers among which the solution is known to lie. Actually to write out all these numbers is obviously impossible. We therefore propose to construct a machine which will canvass a million numbers in about three minutes.\nAnother joint project which Lehmer undertook with her husband was assisting\nVandiver\nwith his work on\nFermat's Last Theorem\n, and together the Lehmers computed many\nBernoulli numbers\nwhich\nVandiver\nrequired in his work. As an example of other contributions Lehmer made to Fermat's Last Theorem she published\nOn a resultant connected with Fermat's Last Theorem\nin\n1935\n, then, jointly with her husband,\nOn the first case of Fermat's Last Theorem\nin\n1941\n.\nOne topic which especially interested Lehmer was reciprocity laws. She corresponded with\nHelmut Hasse\non the topic and he encouraged her to publish her article\nOn the Quadratic Character of Some Quadratic Surds\nin\nCrelle\n's Journal in\n1971\n. Another paper which developed from this interest was\nRational reciprocity laws\nwhich she published in\n1978\n.\nLehmer was never unhappy with the role she played. In an article\nOn the advantages of not having a Ph.D\n. she wrote:-\nFirst of all there are lower expectations. If one happens to discover something new, one's peers are pleasantly surprised and generous in their praise. This is good for the morale ...\nIn fact as well as the advantages in not holding faculty position, such as having more time to devote to research, she also had many of the advantages which would have gone with such a post\n[\n1\n]\n:-\nAs a faculty wife she was a member of the university community, had library privileges, and never felt excluded from the mathematics community. She was able to attend department seminars whenever she wished. She was able to travel with her husband to attend mathematics conferences around the world.\nBrillhart in\n[\n1\n]\nwrites about the Lehmers as a team:-\nIn the sixty years during which they collaborated, the Lehmers were a research team who personally influenced a large number of people with their knowledge, their courtesy and sociability, and their fine mathematical work. There is little doubt that one of their most enduring contributions to the world of mathematicians is their founding of the West Coast Number Theory Meeting in\n1969\n. This meeting, which has been held in the western United States in December of every year since that time, has provided an informal and often merry environment in which old friends can meet and younger mathematicians can present their work. This meeting will remain a lasting tribute to the Lehmers.",
  "matematicos_citados_na_biografia": [
    "Derrick Norman Lehmer",
    "Derrick Lehmer",
    "Dick",
    "Dick Lehmer",
    "Pontryagin",
    "Hardy",
    "Littlewood",
    "Davenport",
    "Mahler",
    "Mordell",
    "Erdős",
    "Vandiver",
    "Fermat's Last Theorem",
    "Bernoulli numbers",
    "Helmut Hasse",
    "Crelle"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}