{
  "nome_completo": "Emmy Amalie Noether",
  "nome_curto": "Emmy Noether",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Noether_Emmy/",
  "data_nascimento": "23 March 1882",
  "local_nascimento": "Erlangen, Bavaria, Germany",
  "data_morte": "14 April 1935",
  "local_morte": "Bryn Mawr, Pennsylvania, USA",
  "summary": "Emmy Noether is best known for her contributions to abstract algebra, in particular, her study of chain conditions on ideals of rings.",
  "biografia": "Emmy Noether\n's father,\nMax Noether\n, was a distinguished mathematician and a professor at Erlangen but he came from a family of wholesale hardware dealers. Her mother was Ida Amalia Kaufmann\n(1852\n-\n1915)\n, from a wealthy Cologne family. Both Emmy's parents were of Jewish origin and the reader may be surprised at this since Noether is not a Jewish name. We should explain, therefore, how this came about and, at the same time, give some information on Emmy Noether's ancestors.\nMax Noether\n's paternal grandfather was Elias Samuel, the founder of a business in Bruchsal. Elias had nine children, one being a son Hertz Samuel. In\n1809\nthe State of Baden made the Tolerance Edict which required Jews to adopt Germanic names. Elias Samuel chose the surname Nöther, becoming Elias Nöther, but also changed the given names of his children, giving Hertz the name Hermann. When he was eighteen years old, Hermann Nöther left his home town of Bruchsal and studied theology at the University of Mannheim. Then in\n1837\n, together with his brother Joseph, he set up a wholesale business in iron hardware. Hermann Nöther and his wife Amalia had five children, the third of which was Max. The two children older than Max were Sarah\n(\nborn\n6\nNovember\n1839)\nand Emil. It is worth noting at this point that the Nöther iron-wholesaling business remained a family firm for exactly one hundred years, until the Nazis removed Jewish families from their own businesses in\n1937\n. One other comment is necessary at this point. Although the family name was chosen to be Nöther by Max's grandfather, Max and his family always used the form Noether\n(\nexcept on Max's wedding certificate where the form Nöther appears\n)\n.\nEmmy was the eldest of her parents' four children, the three younger children being boys. Alfred Noether\n(1883\n-\n1918)\nstudied chemistry and was awarded a doctorate from Erlangen in\n1909\n. However, his career was short since he died nine years later. Fritz Noether\n(1884\n-\n1941)\nbecame an applied mathematician. However, as a Jew he was unable to work and left Germany in\n1937\n. He was appointed as a professor at the University of Tomsk in the Soviet Union but accused of anti-Soviet acts he was sentenced to death and shot. He was found not guilty by the Supreme Court of the Soviet Union in\n1988\n. Gustav Robert Noether\n(1889\n-\n1928)\nhad bad health all his life. He was mentally handicapped, spent most of his life in an institution and died young. The first school that Emmy attended was on Fahrstrasse. Auguste Dick writes\n[\n5\n]\n:-\nEmmy did not appear exceptional as a child. Playing among her peers in the schoolyard on Fahrstrasse she probably was not especially noticeable - a near-sighted, plain-looking little girl, though not without charm. Her teachers and classmates knew Emmy as a clever, friendly, and likeable child. She had a slight lisp and was one of the few who attended classes in the Jewish religion.\nAfter elementary school, Emmy Noether attended the Städtische Höhere Töchter Schule on Friedrichstrasse in Erlangen from\n1889\nuntil\n1897\n. She had been born in the family home at Hauptstrasse\n23\nand lived there until, in the middle of her time at high school, in\n1892\n, the family moved to a larger apartment at Nürnberger Strasse\n32\n. At the high school she studied German, English, French, arithmetic and was given piano lessons. She loved dancing and looked forward to parties with children of her father's university colleagues. At this stage her aim was to become a language teacher and after further study of English and French she took the examinations of the State of Bavaria and, in\n1900\n, became a certificated teacher of English and French in Bavarian girls schools. She was awarded the grade of \"very good\" in the examinations, the weakest part being her classroom teaching.\nHowever Noether never became a language teacher. Instead she decided to take the difficult route for a woman of that time and study mathematics at university. Women were allowed to study at German universities unofficially and each professor had to give permission for his course. Noether obtained permission to sit in on courses at the University of Erlangen during\n1900\nto\n1902\n. She was one of only two female students sitting in on courses at Erlangen and, in addition to mathematics courses, she continued her interest in languages being taught by the professor of Roman Studies and by an historian. At the same time she was preparing to take the examinations which allowed a student to enter any university. Having taken and passed this matriculation examination in Nürnberg on\n14\nJuly\n1903\n, she went to the University of Göttingen. During\n1903\n-\n04\nshe attended lectures by\nKarl Schwarzschild\n,\nOtto Blumenthal\n,\nDavid Hilbert\n,\nFelix Klein\nand\nHermann Minkowski\n. Again she was not allowed to be a properly matriculated student but was only allowed to sit in on lectures. After one semester at Göttingen she returned to Erlangen.\nAt this point the rules were changed and women students were allowed to matriculate on an equal basis to the men. On\n24\nOctober\n1904\nNoether matriculated at Erlangen where she now studied only mathematics. In\n1907\nshe was granted a doctorate after working under\nPaul Gordan\n. The oral examination took place on Friday\n13\nDecember and she was awarded the degree 'summa cum laude'.\nHilbert\n's basis theorem of\n1888\nhad given an existence result for finiteness of invariants in\nn\nn\nn\nvariables.\nGordan\n, however, took a constructive approach and looked at constructive methods to arrive at the same results. Noether's doctoral thesis followed this constructive approach of Gordan and listed systems of\n331\ncovariant forms. Colin McLarty writes that\n[\n39\n]\n:-\n... her dissertation of\n1908\nwith\nGordan\npursued a huge calculation that had stumped\nGordan\nforty years before and which Noether could not complete either. So far as I know no one has ever completed it or even checked it as far as she went. It was old-fashioned at the time, a witness to the pleasant isolation of Erlangen, and made no use of\nGordan\n's own work building on\nHilbert\n's ideas.\nHaving completed her doctorate the normal progression to an academic post would have been the\nhabilitation\n. However this route was not open to women so Noether remained at Erlangen, helping her father who, particularly because of his own disabilities, was grateful for his daughter's help. Noether also worked on her own research, in particular she was influenced by\nErnst Fischer\nwho had succeeded\nGordan\nto the chair of mathematics when he retired in\n1911\n. Noether wrote about\nFischer\n's influence:-\nAbove all I am indebted to Mr\nE Fischer\nfrom whom I received the decisive impulse to study abstract algebra from an arithmetical viewpoint, and this remained the governing idea for all my later work.\nFischer\n's influence took Noether towards\nHilbert\n's abstract approach to the subject and away from the constructive approach of\nGordan\n. Now this was very important to her development as a mathematician for\nGordan\n, despite his remarkable achievements, had his limitations. Noether's father,\nMax Noether\n, said of\nGordan\n(\nsee\n[\n3\n]\n)\n:-\nGordan\nwas never able to do justice to the development of fundamental concepts; even in his lectures he completely avoided all basic definitions of a conceptual nature, even that of the limit.\nNoether's reputation grew quickly as her publications appeared. In\n1908\nshe was elected to the\nCircolo Matematico di Palermo\n, then in\n1909\nshe was invited to become a member of the\nDeutsche Mathematiker-Vereinigung\nand in the same year she was invited to address the annual meeting of the Society in Salzburg. She gave the lecture\nZur Invariantentheorie der Formen von n Variabeln\nⓉ\n(\nOn the theory of invariants for the forms of n variable\n)\n. In\n1913\nshe lectured in Vienna, again to a meeting of the\nDeutsche Mathematiker-Vereinigung\n. Her lecture on this occasion was\nÜber rationale Funktionenkörper\nⓉ\n(\nOn fields of rational functions\n)\n. While in Vienna she visited\nFranz Mertens\nand discussed mathematics with him. One of Merten's grandsons remembered Noether's visit\n(\nsee\n[\n5\n]\n)\n:-\n... although a woman,\n[\nshe\n]\nseemed to me like a Catholic chaplain from a rural parish - dressed in a black, almost ankle-length and rather nondescript, coat, a man's hat on her short hair ... and with a shoulder bag carried crosswise like those of the railway conductors of the imperial period, she was rather an odd figure.\nDuring these years in Erlangen she advised two doctoral students who were both officially supervised by her father. These were Hans Falckenberg\n(\ndoctorate\n1911)\nand Fritz Seidelmann\n(\ndoctorate\n1916)\n.\nFor information on these and Noether's other Ph.D. students see\nTHIS LINK\n.\nIn\n1915\nHilbert\nand\nKlein\ninvited Noether to return to Göttingen. The reason for this was that\nHilbert\nwas working on physics, in particular on ideas on the theory of relativity close to those of\nAlbert Einstein\n. He decided that he needed the help of an expert on invariant theory and, after discussions with\nKlein\n, they issued the invitation.\nVan der Waerden\nwrites\n[\n68\n]\n:-\nShe came and at once solved two important problems. First: How can one obtain all differential covariants of any vector or tensor field in a Riemannian space? ... The second problem Emmy investigated was a problem from special relativity. She proved: To every infinitesimal transformation of the Lorentz group there corresponds a Conservation Theorem.\nThis result in theoretical physics is sometimes referred to as Noether's Theorem, and proves a relationship between symmetries in physics and conservation principles. This basic result in the theory of relativity was praised by\nEinstein\nin a letter to\nHilbert\nwhen he referred to Noether's penetrating mathematical thinking. Of course, she arrived in Göttingen during World War I. This was a time of extreme difficulty and she lived in poverty during these years and politically she became a radical socialist. However, they were extraordinarily rich years for her mathematically.\nHermann Weyl\n, in\n[\n69\n]\nwrites about Noether's political views:-\nDuring the wild times after the Revolution of\n1918\n, she did not keep aloof from the political excitement, she sided more or less with the Social Democrats; without being actually in party life she participated intensely in the discussion of the political and social problems of the day. ... In later years Emmy Noether took no part in matters political. She always remained, however, a convinced pacifist, a stand which she held very important and serious.\nHilbert\nand\nKlein\npersuaded her to remain at Göttingen while they fought a battle to have her officially on the Faculty. In a long battle with the university authorities to allow Noether to obtain her habilitation there were many setbacks and it was not until\n1919\nthat permission was granted and she was given the position of\nPrivatdozent\n. During this time\nHilbert\nhad allowed Noether to lecture by advertising her courses under his own name. For example a course given in the winter semester of\n1916\n-\n17\nappears in the catalogue as:-\nMathematical Physics Seminar: Professor\nHilbert\n, with the assistance of Dr E Noether, Mondays from\n4\n-\n6\n, no tuition.\nAt Göttingen, after\n1919\n, Noether moved away from\ninvariant theory\nto work on ideal theory, producing an abstract theory which helped develop ring theory into a major mathematical topic.\nIdealtheorie in Ringbereichen\nⓉ\n(\nIdeal theory for rings\n)\n(1921)\nwas of fundamental importance in the development of modern algebra. In this paper she gave the decomposition of ideals into intersections of primary ideals in any commutative ring with ascending chain condition.\nEmanuel Lasker\n(\nwho became the world chess champion\n)\nhad already proved this result for a polynomial ring over a field. Noether published\nAbstrakter Aufbau der Idealtheorie in algebraischen Zahlkörpern\nⓉ\n(\nAbstract composition of ideal theory in algebraic number fields\n)\nin\n1924\n. In this paper she gave five conditions on a ring which allowed her to deduce that in such commutative rings every ideal is the unique product of prime ideals.\nIn the same year of\n1924\nB L van der Waerden\ncame to Göttingen and spent a year studying with Noether. After returning to Amsterdam\nvan der Waerden\nwrote his book\nModerne Algebra\nⓉ\n(\nModern algebra\n)\nin two volumes. The major part of the second volume consists of Noether's work. From\n1927\nonwards Noether collaborated with\nHelmut Hasse\nand\nRichard Brauer\nin work on non-commutative algebras. They wrote a beautiful paper joint paper\nBeweis eines Hauptsatzes in der Theorie der Algebren\nⓉ\n(\nEvidence of a fundamental theorem in the theory of algebras\n)\nwhich was published in\n1932\n. In addition to teaching and research, Noether helped edit\nMathematische Annalen\n. Much of her work appears in papers written by colleagues and students, rather than under her own name.\nFurther recognition of her outstanding mathematical contributions came with invitations to address the International Congress of Mathematicians at Bologna in September\n1928\nand again at Zürich in September\n1932\n. Her address to the\n1932\nCongress was entitled\nHyperkomplexe Systeme in ihren Beziehungen zur kommutativen Algebra und zur Zahlentheorie\nⓉ\n(\nHyper complex systems in their relation to the commutative algebra and number theory\n)\n. In\n1932\nshe also received, jointly with\nEmil Artin\n, the Alfred Ackermann-Teubner Memorial Prize for the Advancement of Mathematical Knowledge. In April\n1933\nher mathematical achievements counted for nothing when the Nazis caused her dismissal from the University of Göttingen because she was Jewish. She received no pension or any other form of compensation but, nevertheless, she considered herself more fortunate than others. She wrote to\nHelmut Hasse\non\n10\nMay\n1933\n(\nsee for example\n[\n5\n]\n)\n:-\nMany thanks for your dear compassionate letter! I must say, though, that this thing is much less terrible for me than it is for many others. At least I have a small inheritance\n(\nI was never entitled to a pension anyway\n)\nwhich allows me to sit back for a while and see.\nWeyl\nspoke about Noether's reaction to the dire events that were taking place around her in the address he gave at her funeral:-\nYou did not believe in evil, indeed it never occurred to you that it could play a role in the affairs of man. This was never brought home to me more clearly than in the last summer we spent together in Göttingen, the stormy summer of\n1933\n. In the midst of the terrible struggle, destruction and upheaval that was going on around us in all factions, in a sea of hate and violence, of fear and desperation and dejection - you went your own way, pondering the challenges of mathematics with the same industriousness as before. When you were not allowed to use the institute's lecture halls you gathered your students in your own home. Even those in their brown shirts were welcome; never for a second did you doubt their integrity. Without regard for your own fate, openhearted and without fear, always conciliatory, you went your own way. Many of us believed that an enmity had been unleashed in which there could be no pardon; but you remained untouched by it all.\nFor a version of\nWeyl\n's speech see\nTHIS LINK\n.\nShe accepted a one-year visiting professorship at Bryn Mawr College in the USA and in October\n1933\nsailed to the United States on the ship\nBremen\nto take up the appointment. She had hoped to delay accepting the invitation since she would have liked to have gone to Oxford in England but it soon became clear that she had to leave quickly. At Bryn Mawr she was made very welcome by\nAnna Johnson Pell Wheeler\nwho was head of mathematics. Noether ran a seminar during the winter semester of\n1933\n-\n34\nfor three students and one member of staff. They worked through the first volume of\nvan der Waerden\n's\nModerne Algebra\nⓉ\n(\nModern algebra\n)\n. In February\n1934\nshe began giving weekly lectures at the Institute for Advanced Study, Princeton. In a letter to\nHasse\n, dated\n6\nMarch\n1934\n, she wrote:-\nI have started with representation modules, groups with operators ...; Princeton will receive its first algebraic treatment this winter, and a thorough one at that. My audience consists mostly of research fellows, besides\nAlbert\nand\nVandiver\n, but I'm beginning to realise that I must be careful; after all, they are essentially used to explicit computation and I have already driven a few of them away with my approach.\nNoether returned to Germany in the summer of\n1934\n. There she saw her brother Fritz for what would be the last time, and visited\nArtin\nin Hamburg before going on to Göttingen. In\n1980\nArtin\n's wife recalled Noether's visit\n[\n35\n]\n:-\nNow the one thing I remember most vividly is the trip on the Hamburg Untergrund, which is the subway in Hamburg. We picked up Emmy at the Institute, and she and\nArtin\nimmediately started talking mathematics. At that time it was Idealtheorie, and they started talking about Ideal, Führer, and Gruppe, and Untergruppe, and the whole car suddenly started pricking up their ears.\n[\nEach of the German nouns has both mathematical and political meanings.\n]\nAnd I was frightened to death - I thought, my goodness, next thing's going to happen, somebody's going to arrest us. Of course, that was in\n1934\n, and all. But Emmy was completely oblivious, and she talked very loudly and very excitedly, and got louder and louder, and all the time the \"Führer\" came out, and the \"Ideal.\" She was very full of life, and she constantly talked very fast and very loud.\nShe returned to the United States where her visiting professorship at Bryn Mawr had been extended for a further year. She continued her weekly lectures at Princeton where\nRichard Brauer\nhad now arrived. After her lectures she enjoyed talking about mathematics with\nWeyl\n,\nVeblen\nand\nBrauer\n.\nNoether's death was sudden and unexpected. In April\n1935\ndoctors discovered that she had a tumour. Two days later they operated, finding further tumours which they believed to be benign and did not remove. The operation seemed a success and for three days her condition improved. However, on the fourth day she suddenly collapsed and developed a very high temperature. She died later that day.\nWeyl\nin his Memorial Address\n[\n69\n]\nsaid:-\nHer significance for algebra cannot be read entirely from her own papers, she had great stimulating power and many of her suggestions took shape only in the works of her pupils and co-workers.\nIn\n[\n67\n]\nvan der Waerden\nwrites:-\nFor Emmy Noether, relationships among numbers, functions, and operations became transparent, amenable to generalisation, and productive only after they have been dissociated from any particular objects and have been reduced to general conceptual relationships.\nAlthough she received little recognition in her lifetime considering the remarkable advances that she made, she has been honoured in many ways following her death. A crater on the moon is named for her. A street in her hometown is named for her and the school she attended is now named the Emmy Noether School. Various organisations name scholarships and lectures after Emmy Noether.",
  "matematicos_citados_na_biografia": [
    "Max Noether",
    "Karl Schwarzschild",
    "Otto Blumenthal",
    "David Hilbert",
    "Felix Klein",
    "Hermann Minkowski",
    "Paul Gordan",
    "Hilbert",
    "Gordan",
    "habilitation",
    "Ernst Fischer",
    "Fischer",
    "E Fischer",
    "Circolo Matematico di Palermo",
    "Deutsche Mathematiker-Vereinigung",
    "Franz Mertens",
    "THIS LINK",
    "Klein",
    "Albert Einstein",
    "Van der Waerden",
    "Einstein",
    "Hermann Weyl",
    "Privatdozent",
    "invariant theory",
    "Emanuel Lasker",
    "B L van der Waerden",
    "van der Waerden",
    "Helmut Hasse",
    "Richard Brauer",
    "Emil Artin",
    "Weyl",
    "Anna Johnson Pell Wheeler",
    "Hasse",
    "Albert",
    "Vandiver",
    "Artin",
    "Veblen",
    "Brauer"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}