{
  "nome_completo": "Enriqueta González Baz",
  "nome_curto": "Enriqueta González Baz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baz/",
  "data_nascimento": "22 September 1915",
  "local_nascimento": "Mexico City, Mexico",
  "data_morte": "22 December 2002",
  "local_morte": "Mexico City, Mexico",
  "summary": "Enriqueta González Baz was the first Mexican woman to be awarded a higher degree in mathematics. She undertook research at the Institute of Physics, National Autonomous University of Mexico and lectured on mathematics and actuarial mathematics in the Faculty of Science of the University.",
  "biografia": "Enriqueta González Baz\nwas the daughter of Roberto González Baz and Carmen de la Vega. Roberto González Baz, the son of Victor González and María Baz, was born in\n1894\nand baptised in the church of San Pablo Apóstol in Mexico City on\n24\nMay\n1894\n. He married Carmen de la Vega at the church of Santa Catarina Virgen y Mártir in Mexico City on\n1\nMay\n1913\n. Carmen de la Vega, the daughter of Fernando de la Vega and Antonia Rocha, was also born in\n1894\n; both were nineteen years old at the time of their marriage.\nEnriqueta had at least two siblings, a brother Alberto González y de la Vega and a sister. She was born on the Calle de Correo Mayor, a street in the historic centre of Mexico City.\nAfter primary studies, Enriqueta entered the Escuela número\n8\nfor women, a high quality secondary school in Mexico City. Enriqueta's father, Roberto González, believed that his daughters should learn what were considered at that time the necessary skills for any woman. He said \"that before anything else they should be women.\" He therefore insisted that his daughters should study a two year course at the Escuela De Enseñanzas Especiales no\n6\n, also known as the Escuela Doméstica. Among the courses that Enriqueta studied at this school were first aid, cooking and childcare. At this school one of the teachers was Elena Picaso de Murria. She taught English and was the author of several books. Enriqueta took an English course from Elena Picaso which proved important for two different reasons. First if gave her a good command of English which proved useful to her later in her studies and second, it was Elena Picaso who saw the potential in Enriqueta\n(\nand also in her sister\n)\nto study higher education. This gave Enriqueta the confidence to pursue her dream and continue her education after completing two years at the Escuela Doméstica.\nAfter the 'domestic training', Enriqueta began her studies at the night high school that operated in the old San Ildelfonso College in Mexico City while during the day she attended the Escula Nacional de Maestros which trained pupils to become teachers. The San Ildelfonso College had originally been a Jesuit school but, after the Jesuits were expelled from Mexico, it continued as a school but declined in popularity. It eventually became the Escuela Nacional Preparatoria designed to bring students up to the standard required to enter the National Autonomous University of Mexico. At first it was State run but became part of the university system in\n1929\n, controlled by the National Autonomous University. The Escula Nacional de Maestros began as the High School for Young Ladies but was converted into the Normal School for Primary Teachers in\n1890\n. Having completed her studies at the Escuela Nacional Preparatoria and having qualified as an upper primary school teacher in\n1937\n, in that year González Baz enrolled in the School of Physical-Mathematical Sciences of the National Autonomous University of Mexico.\nManuela Garín\nwas in the same class studying mathematics with González Baz. She described what it was like studying for the newly set up mathematics degree in the School of Physical-Mathematical Sciences\n[\n18\n]\n:-\nThe School of Sciences was the adopted daughter of the Faculty of Engineering. We had classes in a little corner on one side of the stairs. There was the blackboard, the teacher's place and four seats. There was no more. There was not a very defined study plan and everyone took the subjects they wanted. I began my studies in\n1937\ntogether with Enriqueta Gonzáles Baz,\nFélix Recillas\nand a metallurgical engineer named Gal. We were really the first generation to follow a structured curriculum.\nFor financial reasons,\nFélix Recillas\ngave up his studies. There was a rule that courses could only be put on for a minimum of three students so Gal was persuaded to register for courses he did not take so that González Baz and\nGarín\ncould study them. Although González Baz and\nGarín\nhad the same academic interests, they were not really friends since their political views were very different.\nGarín\nexplained\n[\n18\n]\n:-\nEnriqueta and I were not friends because she was a very conservative woman while I was more liberal. Mexico in the thirties did not know what political repression was, so young women my age were not politicized.\nThe mathematics degree was a new one and the lecturers often gave courses on topics they knew little about. For example the engineer Marianito Hernández gave a course on the calculus of probabilities explaining to González Baz and\nGarín\nthat he was learning the topic with them since he had been asked to teach it but knew nothing about probabilities. This did not mean that it was a poor course, on the contrary Hernández gave an excellent course. Alberto Barajas gave a course on Modern Algebra using notes taken from a course given by\nGarrett Birkhoff\n, while\nCarlos Graef Fernández\ngave a course on geometry. González Baz was awarded a Doctorado en Ciencias from the National University of Mexico in\n1943\n. Let us note that the Doctorado en Ciencias was, at that time, essentially equivalent to a Master of Science degree. She had written a thesis on\nBessel\nfunctions, Gamma functions and\nLegendre\nfunctions which had been examined by a committee consisting of the physicist Manuel Sandoval Vallarta\n(1899\n-\n1977)\n,\nCarlos Graef Fernández\nand Francisco Zubieta Russi\n(1911\n-\n2005)\n. When the Institute of Mathematics was founded,\nNápoles Gándara\nwas elected its first director. Mathematical research was organised at the Institute into three general branches: pure mathematics, logic and foundations, and applied mathematics. The first was directed by\nAlberto Barajas\nand\nRobeto Vázquez\n, the second by Francisco Zubieta and the last by\nCarlos Graef\n. González Baz's examiners were, therefore, a physicist and two of the three heads of the mathematics research areas in the National Autonomous University of Mexico.\nEnriqueta González Baz is described in\n[\n7\n]\nas \"the first Mexican woman to earn a degree in mathematics.\" Similar descriptions of her are given in\n[\n12\n]\nand\n[\n13\n]\nand many other sources give this description. We should look at exactly why González Baz deserves this description since the situation is slightly more subtle than it might first appear. From what we have seen above about her fellow student\nManuela Garín\n, we need to see why she does not merit the title. This is straightforward for, although\nGarín\ntook the same courses as González Baz, she left the university in\n1940\nafter completing the course work but before writing a thesis. She only wrote her thesis many years later and then was awarded the degree.\nThe other point we must consider is the teaching degrees that were awarded in mathematics by the National Autonomous University of Mexico. These degrees, with an emphasis on teaching mathematics, were bachelor's degrees. Three women were awarded these degrees before González Baz, namely Ana María Flores in\n1937\n, Rosa Aguirre Sánchez in\n1940\nand Carmen Alburquerque García in\n1943\n. Alburquerque García became a dedicated High School mathematics teacher who gained a fine reputation. Ana María Flores worked for the Ministry of Industry and Commerce and pressed for the creation of a Department of Statistics in the Directorate of Norms and Measures. Although these three women were important in the development of women's education in Mexico, since their degrees were essentially in mathematics education, we believe that González Baz fully deserves being known as the \"the first Mexican woman to earn a degree in mathematics.\" Although some may not agree, this is in line with other places in this archive where we have chosen not to consider a mathematics education degrees on a par with mathematics degrees. Let us record another 'first' for González Baz; she is the first Mexican woman to publish research papers in mathematics which are reviewed by\nMathematical Reviews\n. We give some details of these papers below.\nGonzález Baz had been one of the founding members of the\nMexican Mathematical Society\nand was present at the first meeting of the Society on\n30\nJune\n1943\n. There were\n131\nmembers at this meeting but only five of these were women, Enriqueta González Baz,\nParis Pishmish de Recillas\n, Rita López de Llergo y Seoane, Sara Rodiles de Ayala and María Guadalupe Lomelí Cerezo. We note that\nParis Pishmish\nwas a Turkish mathematician who had studied for her doctorate in Istanbul from\n1934\nto\n1937\nwith\nErwin Findley Freundlich\nand\nRichard von Mises\n.\nAfter the award of her degree, González Baz went to Bryn Mawr College in the United States to undertake postgraduate work. The first volume of the\nBulletin\nof the\nMexican Mathematical Society\nwas published in\n1943\nand it announced the award of a scholarship\n[\n14\n]\n:-\n... from Bryn Mawr College in Pennsylvania, USA, to Professor Enriqueta González Baz, to study Higher Mathematics, under the direction of Dr\nAnna Pell Wheeler\n; Miss González Baz will give an advanced course in Spanish at the aforementioned school.\nThe Bryn Mawr College Annual Report,\n1944\n-\n45\n, gives the following information\n[\n6\n]\n:-\nThe Graduate School of\n1944\n-\n45\nnumbered\n109\nstudents. There were\n100\nstudents in the first semester and\n94\nin the second\n(15\nwithdrawals in the first semester and\n9\nadditions in the second\n)\n. Of these,\n37\nwere resident students and\n72\nwere non-resident. Fifty students devoted full time to graduate work. ... Teaching Fellows in Spanish: Enriqueta Gonzalez Baz, Profesora de Ensenanza Primaria Superior,\n1937\n; Doctorado en Ciencias, National University of Mexico,\n1943\n.\nOver the three years\n1945\n-\n47\n, González Baz published four papers. These papers, listed in\n[\n1\n]\n,\n[\n2\n]\n, and\n[\n3\n]\n, are\nTeoremas acerca de la convergencia absoluta de las series de Fourier\nⓉ\n(\nTheorems about the absolute convergence of Fourier series\n)\n(1945)\n,\nConsideraciones sobre las redes distributivas\nⓉ\n(\nConsiderations on distributive networks\n)\n(1945)\n,\nThe existence theorem for a system of an arbitrary number of differential equations of the first order\n(\nSpanish\n)\n(1946)\n, and\nRelacion entre el parametro y las dimensiones de la solution periodica de la Ecuacion de Van der Pol\nⓉ\n(\nRelation between the parameter and the dimensions of the periodic solution of the Van der Pol Equation\n)\n(1947)\n. The article\nConsideraciones sobre las redes distributivas\nⓉ\n(\nConsiderations on distributive networks\n)\nbegins:-\nThis article presents the results of an investigation on distributive networks that we did at the suggestion of Prof\nGarrett Birkhoff\n. Distributive systems are sets that are defined by the following ten postulates ...\nThe review of this article by P M Whitman begins\n[\n19\n]\n:-\nThe author considers systems which are closed under + and\n∘\n\\circ\n∘\n, each of these operations being left and right distributive with respect to the other, with elements\n0\nand I such that\nx\n+\n0\n=\nx\n=\n0\n+\nx\nx + 0 = x = 0 + x\nx\n+\n0\n=\nx\n=\n0\n+\nx\nand\nx\n∘\nI\n=\nx\n=\nI\n∘\nx\nx \\circ  I = x = I \\circ  x\nx\n∘\nI\n=\nx\n=\nI\n∘\nx\nfor all x in the system\n(\nbut associativity and commutativity are not postulated, nor are\nx\n∘\n0\n=\n0\n,\nx\n+\nI\n=\nI\nx \\circ  0 = 0, x + I = I\nx\n∘\n0\n=\n0\n,\nx\n+\nI\n=\nI\n)\n.\nIn\n1947\nGonzález Baz was awarded a scholarship of $\n250\nper month from\n1\nMarch to\n31\nDecember to undertake research on the theory of systems in the project\nInvestigaciones sobre la Theoría de las Redes\nⓉ\n(\nResearch on the Theory of Networks\n)\n.\nFrom\n1948\n, González Baz worked at the Institute of Physics, part of the National Autonomous University of Mexico\n(\nsee\n[\n15\n]\n)\n. She was an Investigation Assistant from\n1948\nworking with six other assistants. The Director of the Institute at this time was her former teacher\nCarlos Graef\n. He had been director from\n1945\n, a year when\nManuela Garín\nwas working at the Institute as an Investigation Assistant. González Baz's name does not appear in the staff list in the three years\n1951\n-\n53\n, but from\n1954\nshe is again listed, this time as an Investigation Assistant for Experimental Nuclear Physics.\nWorking at the Institute of Physics was not the only job that González Baz had for she also gave mathematics courses at the Faculty of Sciences of the National Autonomous University of Mexico, taught at the National Preparatory School and at the Normal Superior School, and was a lecturer of Financial Mathematics at the Actuarial unit of the Faculty of Sciences of the National Autonomous University of Mexico.\nPerhaps she is best remembered today as the translator of\nSolomon Lefschetz\n's book\nTopology\ninto Spanish. Her translation appeared under the title\nElementos de topología\nⓉ\n(\nElements of topology\n)\npublished by the National Autonomous University of Mexico in\n1963\n.\nFinally we quote from a couple of the references about Enriqueta Gonzalez Baz. First, from\n[\n16\n]\n:-\nThe fight to banish the myth that women are not equally capable as men is as long as the history of humanity, especially in the scientific field. However, there are those who with their work, tenacity and curiosity have contributed to changing the notion that women are not made for exact sciences. Such is the case of Enriqueta González Baz.\nFrom\n[\n4\n]\n:-\nShe was a great example of a woman, an example for many women to follow in her footsteps and manage to chart their own path.\nEnriqueta Gonzalez Baz died in Mexico City at the age of\n87\n.",
  "matematicos_citados_na_biografia": [
    "Manuela Garín",
    "Félix Recillas",
    "Garín",
    "Garrett Birkhoff",
    "Carlos Graef Fernández",
    "Bessel",
    "Legendre",
    "Nápoles Gándara",
    "Alberto Barajas",
    "Robeto Vázquez",
    "Carlos Graef",
    "Mexican Mathematical Society",
    "Paris Pishmish de Recillas",
    "Paris Pishmish",
    "Erwin Findley Freundlich",
    "Richard von Mises",
    "Anna Pell Wheeler",
    "Solomon Lefschetz"
  ],
  "imagens": [
    "baz.jpg"
  ]
}