{
  "nome_completo": "Erasmus Bartholin",
  "nome_curto": "Erasmus Bartholin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bartholin/",
  "data_nascimento": "13 August 1625",
  "local_nascimento": "Roskilde, Denmark",
  "data_morte": "4 November 1698",
  "local_morte": "Copenhagen, Denmark",
  "summary": "Erasmus Bartholin was a Danish mathematician and astronomer who wrote on geometry. He also discovered double refraction.",
  "biografia": "Erasmus Bartholin\n's father was Caspar Berthelsen Bartholin and his mother was Anna Fincke, daughter of the mathematician\nThomas Fincke\n. Caspar Bartholin was a Danish physician and theologian who wrote one of the most widely read Renaissance manuals of anatomy. He was a professor at the University of Copenhagen when Erasmus was born but died when Erasmus was less than four years old. There were six sons in the family, and Erasmus had a brother, Thomas Bartholin, who was nine years older than himself. These two brothers went on to become equally famous.\nErasmus received his first education from private tutors, then he attended a Latin school. He entered the University of Copenhagen in\n1642\n, receiving his B.A. in\n1644\nand an M.A. in\n1647\n. From\n1645\nhe studied mathematics at the University of Leiden, travelling to France in\n1651\nbut then going to Italy where he studied at a number of places including Padua from where he received a medical degree in\n1654\n. From\n1656\nhe was professor of geometry at the University of Copenhagen but transferred to become an extraordinary professor of medicine in the following year. In\n1671\nhe was appointed to an ordinary chair of medicine at Copenhagen, a post to held until his death.  In\n1667\nhe was appointed Royal Mathematician\n[\n1\n]\n:-\nHe served the University of Copenhagen as dean of the faculty of medicine, librarian, and rector, and was appointed royal physician and privy councillor.\nDespite being professor of medicine for a long period, he wrote relatively little on that topic. In terms of the number of publications, mathematics was the largest part of his work, but his work in this area is not of great importance. In fact he is best known for work in yet another area, for he was the discoverer of the double\nrefraction\nof light.\nBartholin edited\nIntroduction to the geometry of Descartes\nby\nvan Schooten\nand also translated\nOptics\nof Larissa into Latin. Every year between\n1664\nand\n1674\nhe produced a book\nDissertatio de problematibus geometricis\nⓉ\n(\nOn geometrical problems\n)\n. This consisted of theses which he had proposed for his students to defend. In the sixth such book, published in\n1672\n, he gave a proof of what is known as the second problem of\nDebeaune\n, formulated in a letter to\nMersenne\nwritten in\n1638\n. The problem is the first example of an inverse tangent problem which in modern notation results in requiring the solution to the differential equation\nd\ny\nd\nx\n=\nx\n−\ny\na\n,\ny\n(\n0\n)\n=\n0.\n\\Large\\frac{dy}{dx}\\normalsize  = \\Large\\frac{x-y}{a}\\normalsize , y(0) = 0.\nd\nx\nd\ny\n​\n=\na\nx\n−\ny\n​\n,\ny\n(\n0\n)\n=\n0\n.\nThis has solution\ny\n=\nx\n+\na\n(\ne\n−\nx\n/\na\n−\n1\n)\ny = x + a(e^{-x/a} - 1)\ny\n=\nx\n+\na\n(\ne\n−\nx\n/\na\n−\n1\n)\n.\nDescartes\nsolved\nDebeaune\n's problem in\n1639\n. Bartholin considered the problem in geometric form. In\n[\n6\n]\nPedersen suggests that Bartholin's proof may actually be\nDebeaune\n's original proof which we know he sent to\nDescartes\n. Bartholin could well have come across the proof in papers which\nDebeaune\nsent him for safe keeping shortly before his death in\n1652\n.\nTo see the range of topics on which Bartholin wrote, consider his book\nDe naturae mirabilibus quaestiones academicae\nⓉ\n(\nAcademic questions on the wonders of the nature\n)\nwhich he published in\n1674\n. This consists of essays and lectures written over a number of years such as:\nThe study of the Danish language\n(1657)\n;\nThe shape of snow\n(1660)\n;\nThe pores of bodies\n(1663)\n;\nOn Cartesian physics\n(1664)\n;\nOn nature\n(1666)\n;\nOn judgement and memory\n(1667)\n;\nOn experiment\n(1668)\n;\nOn physical hypotheses\n(1669)\n;\nOn the shape of bodies\n(1671)\n; and\nSecrets of the sciences\n(1673)\n.\nBartholin wrote a large number of mathematical works but he is best remembered for his discovery of the double refraction of light through a crystal of Iceland spar which had been gathered in an expedition to Iceland in\n1668\n. He wrote his text\nExperimenta crystalli Islandici disdiaclastici quibus mira & insolita refractio detegitur\nⓉ\n(\nMarvelous and unusual experiments of refraction in Icelandic spar\n)\non the geometry of crystals in\n1669\n. The two rays he called\nsolita\nand\ninsolita\nand he showed that both were produced by refraction. During his experiments, Bartholin also observed that when the crystals of Iceland spar are rotated about their axis, one of the two images moves in a circle around the other. This is strong evidence that the crystals are somehow splitting the light into two different beams. Bartholin's explanation was based on\nDescartes\n' theory of light along with his idea that there were two sets of \"pores\" in the crystal. However, the true explanation is that the crystal splits the light into two plane-polarized beams.\nHe observed the comets of\n1664\nand\n1665\n, and made other astronomical observations, publishing his descriptions of these events in\nDe cometis anni\n1664\net\n1665\nopusculum\nⓉ\n(\nWork on the comets of the years\n1664\nand\n1665\n)\n(1665)\n. Bartholin also prepared for publication the observations of\nTycho Brahe\n. In both these pieces of work in astronomy he was assisted by Ole Rømer.\nBartholin is also famed for his medical work, in particular his introduction of quinine in the fight against malaria. Some of his medical contributions were made in conjunction with his brother Thomas Bartholin who was a professor of anatomy at the University of Copenhagen from\n1646\nto\n1661\n. Thomas Bartholin founded the journal\nActa medica et philosophica Hafniensia\nto which Erasmus Bartholin contributed papers.",
  "matematicos_citados_na_biografia": [
    "Thomas Fincke",
    "refraction",
    "van Schooten",
    "Debeaune",
    "Mersenne",
    "Descartes",
    "Tycho Brahe"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}