{
  "nome_completo": "Erich Hecke",
  "nome_curto": "Erich Hecke",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hecke/",
  "data_nascimento": "20 September 1887",
  "local_nascimento": "Buk, Posen, Germany (now Poznań, Poland)",
  "data_morte": "13 February 1947",
  "local_morte": "Copenhagen, Denmark",
  "summary": "Erich Hecke was a Polish-born German mathematician whose  best work was in analytic number theory.",
  "biografia": "Erich Hecke\n's father, Heinrich Hecke, was an architect. Erich attended primary school at Buk before going to Posen for his secondary school studies. He graduated from secondary school in\n1905\nand in that year he entered the University of Breslau.\nFollowing the tradition in Germany at that time Hecke did not complete his studies at a single university, but moved to several different universities during the course of his studies. After Breslau he worked under\nEdmund Landau\nat Berlin and then from there he went to Göttingen where he worked under\nHilbert\n. Hecke was awarded his doctorate at Göttingen in\n1910\nfor a dissertation\nZur Theorie der Modulfunktionen von zwei Variablen und ihrer Anwendung auf die Zahlentheorie\nⓉ\n(\nOn the theory of modular functions of two variables and its application to the theory of numbers\n)\nwhich had been supervised by\nHilbert\n.\nHecke remained at Göttingen where he was appointed as an assistant to\nHilbert\nand\nKlein\n. He submitted his\nhabilitation\nto the University of Göttingen in\n1912\nand earned the right to teach there, which indeed he did as a\nPrivatdozent\n. In\n1915\nHecke was appointed to a chair at the University of Basel but, three years later, he returned to a chair of mathematics at Göttingen.\nOne might have imagined that Hecke would have been happy to stay at Göttingen but, having been there for only one year, he accepted the chair of mathematics at Hamburg in\n1919\n. The university was founded in\n1919\nand so he would have had the opportunity to influence the new institution in a way which would not have been possible in an older establishment. There was then a rather strange episode regarding chairs of mathematics at both Berlin and Göttingen.\nCarathéodory\n, who went from Göttingen to Berlin in\n1918\nleft in the following year and, at the request of the Greek government, he took up a post at the University of Smyrna. This left Berlin trying to fill\nCarathéodory\n's chair and Göttingen trying to fill Hecke's chair both in\n1919\n. The two universities drew up very similar lists of possible mathematicians to fill the posts.\nBrouwer\nand\nWeyl\ntopped the list for the chair at both universities but both turned down the offers they received from each of Göttingen and Berlin.\nCourant\nthen accepted the offer of Hecke's chair at Göttingen while Berlin, having been refused by their third choice Herglotz, tried to entice Hecke to leave Hamburg and accept the chair at Berlin. Hecke, however, was happy with his new post at Hamburg and turned down the offer from Berlin. He would remain at Hamburg from the rest of his career.\nThe paper\n[\n5\n]\nis a published version of a talk given by Schoeneberg at a conference organised in Hamburg to celebrate the\n100\nth\nanniversary of Hecke's birthday in\n1987\n. Schoeneberg describes Hecke's contributions to a number of topics which he lists as follows:\nHilbert\nmodular functions,\nDedekind\nzeta functions\n, arithmetical notions and methods, elliptic modular forms of level\nN\nN\nN\n, algebraic functions,\nDirichlet\nseries with functional equation, Hecke-operators\nT\nn\nT_{n}\nT\nn\n​\n, and physics where he made contributions to the kinetic theory of gases.\nHecke's best work was in\nanalytic number theory\nwhere he continued work of\nRiemann\n,\nDedekind\nand\nHeinrich Weber\n. Complex multiplication and modular forms had been treated in the\n19\nth\ncentury by\nKronecker\nand\nHeinrich Weber\n, who discovered their link with class field theory. For his doctoral work\nHilbert\nsuggested to Hecke that he extend\nKronecker\n's ideas to curves of genus\n2\n. Although Hecke achieved important results following this line of investigation, he considered that his attempts had been unsuccessful. However it was highly successful in the sense that the results which Hecke obtained were to lead him to further major discoveries.\nHecke's contributions in\nnumber theory\nare discussed in detail in\n[\n2\n]\n. He studied the\nRiemann\nzeta function, and its extension to arbitrary number fields, discovering important results. He used these results to simplify theorems in class field theory. He then introduced the new concept of \"Grössencharakter\" and the corresponding\nL\nL\nL\n-series, to which he extended the properties of analytic continuation he had proved for the zeta functions in\n1917\n. He discovered the decomposition laws for the divisors of\ndiscriminants\nfor class fields.\nProbably Hecke's most important work was in\n1936\nwith his discovery of the properties of the algebra of Hecke operators and of the\nEuler\nproducts associated with them. He\n[\n1\n]\n:-\n... discovered new connections between prime numbers and analytic functions and new rules for the representation of natural numbers through positive integral quadratic forms of an even number of variables.\nHecke married and had a son who tragically died young. Hecke himself died of cancer before reaching his\n60\nth\nbirthday.",
  "matematicos_citados_na_biografia": [
    "Edmund Landau",
    "Hilbert",
    "Klein",
    "habilitation",
    "Privatdozent",
    "Carathéodory",
    "Brouwer",
    "Weyl",
    "Courant",
    "Dedekind",
    "zeta functions",
    "Dirichlet",
    "analytic number theory",
    "Riemann",
    "Heinrich Weber",
    "Kronecker",
    "number theory",
    "discriminants",
    "Euler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}