{
  "nome_completo": "Erich Hans Rothe",
  "nome_curto": "Erich Hans Rothe",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rothe_Erich/",
  "data_nascimento": "21 July 1895",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "19 February 1988",
  "local_morte": "Ann Arbor, Washtenaw County, Michigan, USA",
  "summary": "Erich Hans Rothe was a German mathematician who worked in the field of analysis.",
  "biografia": "Erich Hans Rothe\n's parents were Elise Margarethe and Erich Hans Rothe. His father, Dr Rothe, was a lawyer and the family were Jewish. He attended school in Berlin graduating from the Königliches Wilhelms-\nGymnasium\nwith his Abitur\n(\nmatriculation examination\n)\nin October\n1913\n. He was taught mathematics at this school by Dr Dietrich to whom he gave special thanks in a note in his doctoral thesis. Then he began his university studies at the University of Munich where one of his mathematics lecturers was\nFerdinand von Lindemann\n, a philosophy lecturer was Hugo Dingler\n(1881\n-\n1954)\nand a physics lecturer was Leo Graetz\n(1856\n-\n1941)\n. He had only completed two semesters of study before war broke out in the summer of\n1914\n. Immediately Rothe volunteered to serve in the German Army\n[\n4\n]\n:-\n... although its goals were obviously alien to him.\nHe joined the artillery and served in the Bayerische Reserve-Feldartillerie-Regimenter No.\n10\n(\nErlangen\n)\nand in the Bayerische Feldartillerie-Regiment\n(\nNürnberg\n)\n. He was at the Battle of Verdun, fought between the German and French armies for almost the whole of the year\n1916\n. The battle, on the hills around Verdun-sur-Meuse in north east France, was extremely costly to both sides with an estimate of almost one million soldiers killed, roughly equal numbers of French and Germans. Rothe survived the battle but he was wounded and eventually discharged from the German Army in December\n1918\n.\nWith the end of World War I in November\n1918\n, Rothe was able to continue his university studies after the four year break caused by the war. He did not return to the University of Munich but instead, in\n1919\n, enrolled at the Technischen Hochschule in Berlin-Charlottenburg where he studied for one semester attending lectures by Rudolf Ernst Rothe\n(1873\n-\n1942)\n. After this one semester, he changed to study at the Friedrich-Wilhelm University of Berlin. There he studied mathematics, physics and philosophy as did his fellow student\nMaximilian Herzberger\nwho had also returned to university after being released from military service at the end of\n1918\n. The ordinary professors of mathematics at the University were\nFriedrich Schottky\nand\nErhard Schmidt\n, while\nIssai Schur\nwas an extraordinary professor. Rothe took the examinations to become a Gymnasium teacher in\n1923\nand, from then until\n1926\n, he was a student teacher at the Mommsen-Gymnasium in Berlin-Charlottenburg. At the same time he undertook research for his doctorate on analogies between linear partial differential equations and linear ordinary differential equations. His thesis advisor was\nErhard Schmidt\n. He submitted his thesis,\nÜber einige Analogien zwischen linearen partiellen und linearen gewöhnlichen Differentialgleichungen,\nⓉ\n(\nOn some analogies between linear partial and linear ordinary differential equations,\n)\nto the University of Berlin in\n1926\n. An oral examination, conducted by\nSchmidt\nand\nRichard von Mises\n, was held on\n4\nMarch\n1926\n. In a paper with the same title, submitted on\n12\nJuly\n1926\n, Rothe thanked\nErhard Schmidt\nfor showing him how some of his original proofs could be simplified. The paper was published by\nMathematische Zeitschrift\nin December\n1928\n. Rothe was awarded his doctorate on\n27\nMay\n1927\n.\nIn his thesis Rothe lists all his lecturers at university. Those who taught him mathematics in Berlin include\nLudwig Bieberbach\n,\nConstantin Carathéodory\n,\nHans Hamburger\n,\nKonrad Knopp\n,\nKarl Löwner\n,\nRichard von Mises\n,\nHans Rademacher\n,\nErhard Schmidt\n,\nIssai Schur\n, and St Jolles\n(1857\n-\n1942)\n; those who taught him physics include Eugen Blasius,\nAlbert Einstein\n, Max von Laue\n(1879\n-\n1960)\n, and\nMax Planck\n; and those who taught him philosophy include Max Dessoir\n(1867\n-\n1947)\n, Alois Riehl\n(1844\n-\n1924)\n, and Eduard Spranger\n(1882\n-\n1963)\n. In addition to his teachers at Berlin and Munich who we have mentioned above, Rothe also lists as his teachers Brentano,\nFischer\n,\nFuchs\n, Grummach, Haarmann, Hammerstein, Henning, Heyn, Hofer, Kükenthal, Külpe, Lagally, H Maier, E Meyer, Reichel, Rieffert, Voss, and Wertheimer. Rothe writes:-\nTo all these men, but especially to Prof Dr\nBieberbach\n, Prof Dr\nvon Mises\n, Prof Dr\nE Schmidt\n, Prof Dr\nI Schur\n, and my former mathematics teacher Dr Dietrich, I give many thanks.\nThe publication of the paper based on his thesis was not Rothe's first publication. In\n1925\n, in collaboration with\nHans Rademacher\n, he published\nDie Differential- und Integralgleichungen der Mechanik und Physik\nⓉ\n(\nThe differential and integral equations of mechanics and physics\n)\nas Chapter\n19\nof the first volume of\nPhilipp Frank\nand\nRichard von Mises\n'\nDie Differential- und Integralgleichungen der Mechanik und Physik\nⓉ\n(\nThe differential and integral equations of mechanics and physics\n)\n. Also in this volume are papers by\nConstantin Carathéodory\n,\nRichard von Mises\n,\nGábor Szegő\n,\nKarl Löwner\n,\nLudwig Bieberbach\n,\nHans Rademacher\n, and\nRichard Courant\n.\nNow at Berlin, Rothe had met his fellow student of mathematics, physics and philosophy,\nHildegard Ille\n. She had obtained her teaching qualification in\n1923\nand a doctorate in the following year after studying with\nIssai Schur\n. After a year at the Kaiser Wilhelm Institute of Physics, headed by\nAlbert Einstein\n, she was a student teacher at the Chamisso-School in Berlin-Schöneberg before marrying Rothe in\n1928\n. Rothe had worked at the Institute of Applied Mathematics at the University of Berlin in\n1926\n-\n27\nbefore being appointed to the Engineering School in Breslau in\n1927\nand\nhabilitating\nthere in\n1928\n. In addition to his position at the Engineering School, he was appointed as a\ndocent\nat the University of Breslau in\n1931\nafter a second habilitation there. During his time in these positions in Breslau, Rothe took study leave for a year which he spent at the University of Göttingen. After publishing the paper based on his thesis, Rothe published:\nEin Beitrag zum Cauchysehen Problem\nⓉ\n(\nA Contribution to the Cauchy problem\n)\n(1928)\n;\nÜber die Approximation stetiger Funktionen durch Eigenfunktionen elliptischer Differentialgleichungen\nⓉ\n(\nOn the approximation of continuous functions by the eigenfunctions of elliptic differential equations\n)\n(1929)\n;\nZweidimensionale parabolische Randwertaufgaben als Grenzfall eindimensionaler Randwertaufgaben\nⓉ\n(\nTwo-dimensional parabolic boundary value problems as a limiting case of one-dimensional boundary value problems\n)\n(1930)\n;\nÜber die Wärmeleitungsgleichung mit nicht-konstante Koeffizienten im räumlichen Falle\nⓉ\n(\nOn the heat equation with non-constant coefficients in the spatial case\n)\n(1931)\n;\nÜber die Grundlösung bei parabolischen Gleichungen\nⓉ\n(\nRegarding the basic solution at parabolic equations\n)\n(1931)\n;\nÜber lineare elliptische Differentialgleichungen zweiter Ordung, deren zugeordnete Massestimmung von Konstanter Krummung ist\nⓉ\n(\nOn nonlinear elliptic differential equations second order, whose associated mass mood of Constant Curvature\n)\n(1931)\n; and\nÜber eine Verallgemeinerung der Besselschen Funktionen\nⓉ\n(\nOn a generalization of Bessel functions\n)\n(1932)\n.\nOn\n15\nApril\n1931\n, Erich and\nHildegard Rothe\nhad a son, Erhard William Rothe, who was born in Breslau. During their years in Breslau both Rothe and his wife reviewed many mathematical papers. We have found around\n800\nreviews by Rothe and around\n170\nby his wife.\nOn\n30\nJanuary\n1933\nAdolf Hitler came to power in Germany and on\n7\nApril\n1933\nclause three of the Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired, with exemptions for participants in World War I and pre-war officials. Now, as we have seen, Rothe had served in World War I so was exempt but it quickly became clear that the exemption would be ignored.\nGábor Szegő\nwas the professor at Königsberg and, like Rothe, was Jewish and had served in World War I.\nHarald Bohr\nhad persuaded\nSzegő\nthat he was in great danger, and a position was arranged for him in the United States. While still in Königsberg,\nSzegő\nwrote to\nRichard Brauer\nwho was in Princeton asking him if he could help Rothe emigrate to the United States.\nBrauer\ntalked to\nOswald Veblen\nwho suggested that Rothe might be better trying to emigrate to the Soviet Union.\nBrauer\nreplied to\nSzegő\nin Königsberg\n[\n2\n]\n:-\nVeblen\njudges the possibility of absorbing German mathematicians in America rather pessimistically ... in appointments nationalistic motives play a growing role.\nVeblen\n, of course, strongly regrets the latter ... Personally I understand the inhibitions which Rothe has vis-à-vis Russia. But it is difficult about this here. All free-minded people look to Russia with a certain admiration and with much interest. The dangers that may be connected to a life in Russia seem small from a distance.\nBecause of his Jewish background, Rothe was dismissed from his positions in\n1935\n. Ignoring the suggestions to go to Russia, he eventually managed to escape with his wife and child and they went to Zürich. Wilfred Kaplan writes\n[\n5\n]\n:-\nIt was in the spring of\n1937\nthat I first came to know Erich Rothe. I was spending a year in Zürich as a graduate student. I had come to Zürich mainly because of\nHeinz Hopf\n, and it was to his friend and former classmate\nHopf\nthat Erich Rothe had come as a refugee from Nazi Germany. With him were his wife and child, and all were warmly welcomed by the Hopfs. My first encounter with Rothe was at the Zurcher Kolloquium, where he lectured on his new research on mapping degree and its applications. I was much impressed with the mathematician and the man, for his talent, his warmth, and his modesty.\nLater in\n1937\nRothe and his family emigrated to the United States. He was appointed as an Instructor in Mathematics at William Penn College, Oskaloosa, Iowa and, as Kaplan writes\n[\n5\n]\n:-\nIt was a time when academic positions were hard to find, and he considered himself fortunate to have one.\nHe worked at William Penn College from\n1937\nuntil\n1943\nbut, during these years, tragedy struck when his wife\nHildegard Rothe-Ille\ndied from cancer in December\n1942\n. Kaplan recounts how Rothe moved from Iowa to Ann Arbor\n[\n5\n]\n:-\nWe met again in June of\n1940\nat the Topology Conference in Ann Arbor. We became friends, played tennis together, and discussed mathematics and common memories of Switzerland. I knew he was not particularly happy in Iowa and was anxious to move to a rigorous centre of mathematical research. We kept in touch by correspondence; I learned of his tragic loss of his young wife. When an opening appeared at the University of Michigan, where I was then instructor, I told our chairman\n(\nHildebrandt\n)\nof him and his interest in such a position. In\n1944\nRothe came to Ann Arbor to begin a long period of brilliant service to the University of Michigan as teacher and scholar.\nHis appointment in\n1944\nwas as an Assistant Professor at the University of Michigan. He was promoted to Associate Professor in\n1949\n, and to Professor in\n1955\n. Details of his contributions to the University of Michigan are given in several sources. We quote first from\n[\n6\n]\n:-\nHis mathematical talents were versatile and his interests broad. His gift for exposition equalling his power of analysis, he was a persuasive teacher as well as a creative mathematician. Combining a secure grounding in pure mathematics with a highly sophisticated knowledge of applications, he exerted a strong influence on students in both mathematics and mathematical physics. As chairman of the departmental doctoral committee, he contributed significantly to the formal organization of advanced mathematical study. Among his peers, he was respected for his many tangible accomplishments and for an elegance and style of mind that helped to set the intellectual tone of the Department.\nHis colleague at the University of Michigan, Wilfred Kaplan, writes in\n[\n5\n]\n:-\nRothe brought something very special to mathematical life in Ann Arbor. His unusual depth of understanding of topology, its applications to analysis, and of mathematical physics\n(\nhe was a contributor to the second edition of the famous text of\nFrank\nand\nvon Mises\n)\ngave a new breadth to the atmosphere in courses and seminars. He was called on for advice and leadership in fields across the whole spectrum of pure mathematics and in physics. He helped to guide many brilliant students to the Ph.D., His contributions to mathematical research reflect his great breadth: differential and\nintegral equations\n, linear and nonlinear functional analysis, topology, calculus of variations. If one seeks a guiding thread through his many papers, it is perhaps the extension to general spaces of the ideas of elementary calculus, in order to answer basic questions arising in partial differential equations and integral equations. Through his papers, his lectures, and his work with graduate students he has made a profound impression in the areas of his work.\nIn\n1964\n, having reached the age of\n69\n, Rothe retired from his professorship at the University of Michigan. However, he taught in\n1967\n-\n68\nat the Western Michigan University in Kalamazoo. Retirement certainly did not mean that Rothe stopped undertaking research into mathematics. For a brief description of Rothe's contributions up to his retirement, see the comments made before a lecture Rothe gave in October\n1964\nat\nTHIS LINK\n.\nRothe continued to publish research papers; we have seen at least\n14\npapers published after his retirement. In\n1978\nthe book\n[\n1\n]\nwas published containing a collection of papers in Rothe's honour. Perhaps, most remarkably, in\n1986\nat the age of\n91\nhe published the\n242\n-page book\nIntroduction to various aspects of degree theory in Banach spaces\nwhich was published by the\nAmerican Mathematical Society\n. Christian Fenske writes in a review:-\nThis is a highly detailed introduction to degree theory of compact maps in\nBanach spaces\n, written by one of the pioneers of the field. The author concentrates on the analytic approach to degree theory and restricts the discussion to\nBanach\nspaces. Of course, much more could be said about degree theory, but the author leaves the reader in no doubt about his choice of topics: at the very beginning he gives a list of subjects not treated in this monograph. ... Most of the text deals with degree theory in finite dimensions. ... The text should be easily accessible to everyone with a moderate background in\nfunctional analysis\n(\nincluding some spectral theory up to the Dunford integral\n)\n. The proofs are unusually detailed and technical arguments are in most cases delegated to notes complementing the chapters. For beginners or non-specialists this is perhaps the best introductory text on degree theory.\nFollowing Rothe's death in\n1988\n, Donald John Lewis\n(1926\n-\n2015)\n, then the Chair of Mathematics at the University of Michigan and known as D.J., wrote:-\nRothe was a scholar of the old school. He was very broadly educated ... He was a wise and judicious man of much wit. His companionship was very much in demand.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Ferdinand von Lindemann",
    "Maximilian Herzberger",
    "Friedrich Schottky",
    "Erhard Schmidt",
    "Issai Schur",
    "Schmidt",
    "Richard von Mises",
    "Ludwig Bieberbach",
    "Constantin Carathéodory",
    "Hans Hamburger",
    "Konrad Knopp",
    "Karl Löwner",
    "Hans Rademacher",
    "Albert Einstein",
    "Max Planck",
    "Fischer",
    "Fuchs",
    "Bieberbach",
    "von Mises",
    "E Schmidt",
    "I Schur",
    "Philipp Frank",
    "Gábor Szegő",
    "Richard Courant",
    "Hildegard Ille",
    "habilitating",
    "docent",
    "Hildegard Rothe",
    "Harald Bohr",
    "Szegő",
    "Richard Brauer",
    "Brauer",
    "Oswald Veblen",
    "Veblen",
    "Heinz Hopf",
    "Hopf",
    "Hildegard Rothe-Ille",
    "Frank",
    "integral equations",
    "THIS LINK",
    "American Mathematical Society",
    "Banach spaces",
    "Banach",
    "functional analysis"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}