{
  "nome_completo": "Ernests Fogels",
  "nome_curto": "Ernests Fogels",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fogels/",
  "data_nascimento": "12 October 1910",
  "local_nascimento": "Nigrande, Saldus, Latvia",
  "data_morte": "22 February 1985",
  "local_morte": "Latvia",
  "summary": "Ernests Fogels was a Latvian mathematician who worked in number theory.",
  "biografia": "Ernests Fogels\nwas the son of farmers who found it hard to earn enough money to make their living. However Fogels was able to attend one of the best secondary schools in Latvia when he entered the Second\nGymnasium\nin Riga. He showed considerable mathematical talents at this school and, when he won a mathematics competition and was awarded a book on\nnumber theory\nas the prize, his interest grew still further. But Fogels had special talents for subjects other than mathematics at the Gymnasium for he had a wonderful talent for painting.\nAfter leaving school, Fogels wanted to continue with both his interest in mathematics and that in painting. However he also required money to support himself through his studies so the next few years, beginning in\n1928\n, proved very demanding as he studied mathematics at the University of Latvia, studied painting at the Academy of Fine Art, and at the same time worked as a clerk and as a schoolteacher of mathematics to fund his studies. He would have liked to write a Master's Thesis on number theory but nobody at the University of Latvia could supervise him on that topic.\nAfter graduating in\n1933\nFogels joined the staff of the University of Latvia. He became a\ndozent\nin\n1937\nand gave lectures on algebra and number theory up until the end of\n1938\nwhen he travelled to England to undertake research at Cambridge. His plan had been to study with\nHardy\n, but this did not work out, so instead he undertook research on the estimate for the difference between consecutive primes supervised by\nIngham\n. However after he returned to Latvia in June\n1939\nWorld War II broke out and his studies were severely affected.\nThe German-Soviet Nonaggression Pact was signed in August\n1939\nand from that time on Latvia's fate was out of its control. On\n17\nJune\n1940\nthe Red Army invaded Latvia and only three days later a new government of Soviet supporters was announced. They voted on\n21\nJuly for Latvia to become a part of the USSR and on\n5\nAugust this became official. The Soviet occupation saw around\n35\n,\n000\nLatvians deported to Russia within a year. During this extremely difficult period Fogels continued to teach and undertake research at the University of Latvia being appointed as an associate professor in\n1940\n. However, the German army invaded Latvia in July\n1941\n. For a period Latvia was a province of a larger Ostland\n(\nincluding Estonia, Lithuania, and Byelorussia\n)\n. In\n1944\nthe Soviet army again marched into Latvia and a renewed period of Soviet domination began.\nDuring these difficult years Fogels had been researching for his thesis\nOn mean values of arithmetical functions\nwhich he submitted to the University of Latvia in\n1947\n. In the same year he took up an appointment as a research fellow at the Institute of Physics and Mathematics of the\nLatvian Academy of Sciences\n. This was a very productive time for Fogels who published twelve papers on number theory over the three years\n1947\n-\n1950\n. In particular he showed that if any countable set has an arithmetic where the elements have unique decompositions into primes, then it is isomorphic to the arithmetic of the natural numbers. He also became interested in finite methods in number theory. These restrict the tools available so that only rational numbers with bounded denominators can occur in a proof, which also cannot use differentiation and integration and other infinite tools. Using such finite methods Fogels proved a number of the classical theorems of number theory.\nIn\n1950\nthe\nLatvian Academy of Sciences\nclosed down mathematics and Fogels moved to the Riga Pedagogical Institute. He spent the next eight years teaching almost the complete range of mathematics courses and wrote about thirty sets of lecture notes for his students. This meant he had little time for research and it is not surprising that he published only two papers during these eight years. In\n1958\nthe Riga Pedagogical Institute was closed down and since Fogels' health was rather poor by this time so he did not seek another position until\n1961\nwhen he was appointed as a research fellow at the Radio Astrophysical Observatory of the\nLatvian Academy of Sciences\n. This was a fruitful period for his research and among his papers were three\nOn the Abstract Theory of Primes\npublished in\nActa Arithmetica\nin\n1964\n,\n1965\nand\n1966\n. The abstract theory of primes had been introduced by\nBeurling\nand studied by many authors. This work proves results on infinite commutative semigroups with countably many generators.\nFogels retired in\n1966\nbut continued to undertake research and from\n1967\nuntil his death he was on the editorial board of\nActa Arithmetica\n. The authors of\n[\n1\n]\nwrite:-\nE Fogels devoted the last years of his life to the\nRiemann\nhypothesis. He constructed many variants of possible proofs, though no one of them was successful.\n[\nTwo papers\n]\ncontain one of such attempts. The author himself noted a gap in the proof. However, it presented some new interesting connections of the\nRiemann\nhypothesis with the theory of prime numbers.\nAs to his character\n[\n1\n]\n:-\nFogels had a strong personality. he was very hard working and energetic. He was one of those men who devoted all their lives to science. He was also a good teacher.\nA final comment on his character is that he was so careful as a reviewer of mathematics papers, spending so much time checking every formula with the utmost care, that he had to give up the work since it was too time consuming.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "number theory",
    "dozent",
    "Hardy",
    "Ingham",
    "Latvian Academy of Sciences",
    "Beurling",
    "Riemann"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}