{
  "nome_completo": "Ernest Barnes",
  "nome_curto": "Ernest William Barnes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barnes/",
  "data_nascimento": "1 April 1874",
  "local_nascimento": "Birmingham, England",
  "data_morte": "29 November 1953",
  "local_morte": "Sussex, England",
  "summary": "Ernest William Barnes was an English mathematician and scientist who later became a liberal theologian and bishop.",
  "biografia": "Ernest William Barnes\nwas the eldest of four sons of John Starkie Barnes and Jane Elizabeth Kerry, both elementary school head-teachers. In\n1883\nBarnes' father was appointed Inspector of Schools in Birmingham, a position that he occupied throughout the rest of his working life. Barnes was educated at King Edward's School, Birmingham and in\n1893\nwent up to Cambridge as a Scholar of Trinity College. He was bracketed Second\nWrangler\nin\n1896\nand was placed in the first division of the first class in Part II of the Mathematical Tripos in\n1897\n. In the following year he was awarded the first Smith's Prize and was duly elected to a Trinity Fellowship. He was appointed a lecturer in mathematics in\n1902\n, junior dean in\n1906\n-\n08\nand a tutor in\n1908\n. He graduated Sc.D. of the University of Cambridge in\n1907\nand was elected a Fellow of the\nRoyal Society\nin\n1909\n.\nIn the same year he became a lecturer in mathematics, Barnes was ordained deacon by the Bishop of London and from\n1906\nto\n1908\nwas Junior Dean of Trinity. In\n1915\n, Barnes left Cambridge, and his career as a professional mathematician, upon his appointment as Master of the Temple in London. This was followed in\n1918\nto a Canonry of Westminster and finally, in\n1924\n, to the Bishopric of Birmingham, an office he held until\n1952\nwhen he had to retire on account of ill-health. He died at his home in Sussex at the age of\n79\n, survived by his wife and two sons.\nBarnes' episcopate was marked by a series of controversies stemming from his outspoken views and, rather surprisingly for someone who held such high office in the Church, often unorthodox religious beliefs. In\n1940\nhe lost a libel case in which he had attacked the Cement Makers' Federation for allegedly holding up the supply of cement, for their own profit, at a time of great national need in the construction of air-raid shelters. Undaunted by this set-back, Barnes returned to his accusations on the cement ring in a speech he delivered in the House of Lords the following year, in which he claimed that powerful business concerns were using libel and slander action to suppress criticism. As a theological author, Barnes' book in\n1947\n, entitled\nThe Rise of Christianity\n, aroused such fierce opposition and criticism from more orthodox members of the Church, that it was strongly suggested he should renounce his episcopal office, a hint which Barnes did not take.\nIn all, Barnes wrote\n29\nmathematical papers during the years\n1897\n-\n1910\n. His early work was concerned with various aspects of the\ngamma function\n, including generalisations of this function given by the so-called Barnes\nG\nG\nG\n-function, which satisfies the equation\nG\n(\nz\n+\n1\n)\n=\nG\n(\nz\n)\nΓ\n(\nz\n)\nG(z+1)=G(z)\\Gamma (z)\nG\n(\nz\n+\n1\n)\n=\nG\n(\nz\n)\nΓ\n(\nz\n)\nand to the double gamma function. Barnes next turned his attention to the theory of integral functions, where, in a series of papers, he investigated their asymptotic structure. He also considered second-order linear\ndifference equations\nconnected with the\nhypergeometric functions\n. In the last five of his papers dealing with the hypergeometric functions, Barnes made extensive use of the integrals studied by\nMellin\nin which the integral\ninvolves gamma functions of the variable of integration. It was in these papers that he brought to the attention of British mathematicians the power and simplicity associated with these integrals, and which now bear the name\nMellin\n-Barnes integrals. His last mathematical paper, published in\n1910\n, was a short and elegant demonstration of a previously known result of Thomae concerning a transformation of a generalised hypergeometric function of unit argument into a more rapidly convergent function of the same kind.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Royal Society",
    "gamma function",
    "difference equations",
    "hypergeometric functions",
    "Mellin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}