{
  "nome_completo": "Ernest William Brown",
  "nome_curto": "Ernest Brown",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brown/",
  "data_nascimento": "29 November 1866",
  "local_nascimento": "Hull, Yorkshire, England",
  "data_morte": "23 July 1938",
  "local_morte": "New Haven, Connecticut, USA",
  "summary": "Ernest Brown worked on lunar and planetary motion.",
  "biografia": "Ernest Brown\n's parents were Emma Martin and William Brown. William worked as a farmer for some years before changing jobs and becoming a lumber merchant. Ernest was the second of his parents' children, having one older sister. He was educated at a school in Trotteridge, Herefordshire, following which he attended Hull and East Riding College in Hull.\nHe showed great promise at this College and, in\n1884\n, he entered Christ's College, Cambridge. Brown received his B.A. in\n1887\nwhen he was ranked Sixth\nWrangler\nin the Mathematical Tripos\n(\nmeaning he was the sixth best student with First Class honours in mathematics\n)\n. He was awarded an M.A. from the University of Cambridge in\n1891\n. In that year he left England for the United States. Before this, in\n1889\n, he had joined the\nRoyal Astronomical Society\nand in the year he left England his first paper was published by that Society on lunar theory.\nBrown was appointed as an instructor in mathematics at Haverford College, Pennsylvania in\n1891\nthen, in\n1893\n, he was promoted to full Professor of Applied Mathematics. In\n1907\nhe was appointed Professor of Mathematics at Yale University, a post he held until he retired in\n1932\n. However his summers were almost all spent back in England at the University of Cambridge.\nWhile he had worked in Cambridge, before going to the United States, Brown had read\nHill\n's\nResearches in the lunar theory\n(1878)\nand published his own ideas on that theory.\nNewcomb\nwas constructing tables of planetary motion when Brown arrived in the United States and\nNewcomb\nhad persuaded\nHill\nto help him out by working on the motion of Jupiter and Saturn. As this meant that\nHill\nwas no longer working on the motion of the Moon, Brown thought that the field was open and so began work himself in that area.\nHe published\nAn Introductory Treatise on the Lunar Theory\nin\n1896\n, then embarked on a new theory of the orbit of the Moon based on\nHill\n's ideas. His great work appeared in five parts in the\nMemoirs of the Royal Astronomical Society\nbetween\n1897\nand\n1908\n.\nAfter\n30\nyears of work, Brown published his lunar tables\nTables of the Motion of the Moon\nin\n1919\n. However the Moon stubbornly refused to follow the path that mathematicians computed for it and, despite attempts to take all reasonable effects into account, there were still fluctuations in the motion not predicted by theory\n[\n2\n]\n:-\nBrown proposed an attack from the observational side and proposed utilising the observation of occultations of stars to a larger extent than hitherto to map the moon's path and improve the theory.\nIn\n1926\nBrown published a paper in which he ascribed these fluctuation to irregular changes in the Earth's period of rotation which has subsequently proved correct.\nNot only did Brown contribute greatly to the theory of the Moon's orbit but he also worked on planetary motion. His book on this topic,\nPlanetary Theory\n, written jointly with C A Shook, appeared in\n1933\n.\nBrown received many awards for his work. He was elected a Fellow of the\nRoyal Society\nat the early age of\n31\n. He received the Gold Medal of the\nRoyal Astronomical Society\nin\n1907\nfor his\nResearches in the lunar theory\n, and the Royal Medal of the\nRoyal Society\nin\n1914\n. He received the Watson Medal of the\nNational Academy of Sciences\nin\n1937\n.\nHe was also an active member of the\nAmerican Mathematical Society\n, serving as its president from\n1914\nto\n1916\n. His life style, perhaps the consequence of his interest in astronomy, is described in\n[\n8\n]\nas follows:-\nHe was in the habit of going to bed early and as a consequence woke up between three and five o'clock in the morning. After having fortified himself with strong coffee from a thermos bottle he set to work without leaving his bed, smoking numerous cigarettes. His serious scientific work was thus done before he got up for breakfast at nine o'clock.\nIn\n[\n2\n]\nhe is described as follows:-\nOf elegant presence and of unassuming friendly character, he was a welcome guest to British astronomers on his occasional visits to his native country.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Royal Astronomical Society",
    "Hill",
    "Newcomb",
    "Royal Society",
    "National Academy of Sciences",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}