{
  "nome_completo": "Ernest William Hobson",
  "nome_curto": "Ernest Hobson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hobson/",
  "data_nascimento": "27 October 1856",
  "local_nascimento": "Derby, England",
  "data_morte": "19 April 1933",
  "local_morte": "Cambridge, England",
  "summary": "Ernest Hobson wrote the first English book on the measure theory and integration of Baire, Borel and Lebesgue.",
  "biografia": "Ernest Hobson\n's mother was Josephine Atkinson. His father, William Hobson, was the editor of the Derbyshire Advertiser, jointly owning the paper and also playing a large role in local politics. Ernest was\n[\n2\n]\n:-\nBrought up in rigidly Low Church surroundings ...\n[\nand\n]\nseems to have felt bitterly the fetters of dogmatism and resolved to shake them off.\nHe was not the infant prodigy that many mathematicians are, rather the reverse in fact for he was considered as a child to be without many gifts. He attended Derby School where he was well taught, but failed to shine until he was\n13\nyears old when he suddenly amazed everyone by gaining distinction in the Cambridge Junior Local Examinations in mathematics, natural sciences, French and music. While at school\n[\n2\n]\n:-\n... he developed strong views of rationalism, becoming ... an avowed radical and agnostic.\nHe studied at the Royal College of Science and gained a Whitworth scholarship in\n1871\nwhich enabled him to study physics with Frederick Guthrie at the Royal School of Mines. These two institutions combined in\n1907\nto become Imperial College of Science and Technology which was a College of the University of London from\n1908\n. Hobson then won a mathematics scholarship to Christ's College, Cambridge, entering in\n1874\n.\nHe graduated as Senior\nWrangler\n(\nranked first in the list of First Class students\n)\nin the Mathematical Tripos of\n1878\ndespite, as noted in\n[\n2\n]\n, being:-\n... more notable as a thinker than as a calculator\n.\nHe was appointed to a fellowship at Christ's College in\n1879\nand taught at Cambridge for the rest of his life. For many years, however, he only taught at the College, playing hardly any role in university life outside College\n[\n2\n]\n:-\nHis work consisted in private coaching and in lecturing in Christ's on more or less elementary mathematics for the Pass and honours examinations.\nPerhaps, rather surprisingly, he coached\nPhilippa Fawcett\n, the Senior Woman Wrangler of\n1890\n, despite his well known strongly held views against women. He married Selina Rosa Knüsli, who came from Glarus in Switzerland, in\n1882\nand continued with his College life until\n1904\nwhen he was appointed to a university lectureship. Cambridge had set up two new prestigious lectureships in the previous year, the\nCayley\nlectureship and the\nStokes\nlectureship. Hobson was the first appointment to the\nStokes\nlectureship.\nHobson published\nA Treatise on Trigonometry\nin\n1891\n[\n2\n]\n:-\n... which possessed a standard of rigour new to Cambridge.\nHe was introduced to modern analysis by\nYoung\nand after this he began to make a real contribution to research. His research concentrated on convergence, in particular convergence of series of orthogonal functions.\nHis book\nTheory of Functions of a Real Variable\npublished in\n1907\nwas the first English book on the measure and integration developed by\nBaire\n,\nBorel\nand\nLebesgue\n.\nHardy\nbelieved that this work had been of major importance in the development of pure mathematics in Britain. Probably mainly due to this particularly influential work, Hobson was elected Sadleirian professor at Cambridge in\n1910\n. The Sadleirian chair only became vacant that year because\nForsyth\nhad been forced to resign the chair after a scandal resulted from his love affair with the wife of\nC V Boys\n. The\nTheory of Functions of a Real Variable\nwas a\n[\n2\n]\n:-\n... solid book of reference, for which the mathematical world owes a debt of gratitude to the author,\n[\nbut was\n]\nsoon out of print and out of date. The leisure which Hobson enjoyed after his election to the Sadleirian Professorship enabled him to devote himself to its complete rewriting, and the second edition\n(1922\n-\n25)\nwas double the size of the first. It is characterised not merely by a great breadth of information and by a critical and conscientious consultation of authorities of the most varied nationalities, but more especially by conspicuous objectiveness and fairness.\nAnother book which Hobson published was\nSquaring the circle\nin\n1913\n[\n3\n]\n. This is a delightful little work which I\n[\nEFR\n]\ngreatly enjoyed reading. Entertainingly written, yet packed with useful information, it leaves me wishing that he had written more popular works.\nHobson was elected a fellow of the\nRoyal Society\nin\n1893\n, serving as a member of its council, and being awarded the Society's Royal Medal in\n1907\n. He was an active member of the\nLondon Mathematical Society\n, being president of the Society\n1900\n-\n2\nand receiving the\nDe Morgan\nMedal of the Society in\n1920\n. He was also president of Section A of the\nBritish Association\nat its meeting in Winnipeg, Canada, in\n1909\n.\nTo many Hobson is better known for the Gifford lectures he gave on\nThe domain of natural science\nat the University of Aberdeen in\n1921\n-\n22\nthan for his mathematical contribution. This comment is in no way intended to minimise the value of his mathematical contributions, rather it is to emphasise the high regard in which his Gifford lectures were held. These lectures were published in\n1923\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Philippa Fawcett",
    "Cayley",
    "Stokes",
    "Young",
    "Baire",
    "Borel",
    "Lebesgue",
    "Hardy",
    "Forsyth",
    "C V Boys",
    "Royal Society",
    "London Mathematical Society",
    "De Morgan",
    "British Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}