{
  "nome_completo": "Ernst Steinitz",
  "nome_curto": "Ernst Steinitz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steinitz/",
  "data_nascimento": "13 June 1871",
  "local_nascimento": "Laurahütte, Silesia, Germany (now Siemianowice Śląskie, Poland)",
  "data_morte": "29 September 1928",
  "local_morte": "Kiel, Germany",
  "summary": "Ernst Steinitz worked on the theory of fields.",
  "biografia": "Ernst Steinitz\n's parents were Sigismund Steinitz\n(1845\n-\n1889)\nand Auguste Cohn\n(1850\n-\n1906)\n. Sigismund, whose parents were Mosche Laib Steinitz and Philippine Prager, was born in Gleiwitz in Silesia\n(\nnow Gliwice in Poland\n)\nand worked on the waterways that linked the industrial coal-producing area of Silesia to the northern cities. He married Auguste in\n1870\n. The family were Jewish and Ernst was the eldest of his parents three sons: Kurt\n(\nborn in\n1872)\nwas only a year younger than Ernst but Walter\n(\nborn in\n1882)\nwas eleven years younger. Ernst showed a very marked talent for music from a young age and his parents, wishing to give him every opportunity to develop these talents, sent him to the Silesian Music Conservatory where he studied the piano\n(\nboth playing and composition\n)\nfor thirteen years\n[\n5\n]\n:-\nHe wrote several piano sonatas and, when he was\n17\n, a piano trio.\nHe prepared for university entrance at the Friedrich\nGymnasium\nin Breslau where his love of mathematics made him decide to study that subject at university rather than music. He entered the University of Breslau in\n1890\n.\nAfter a year at the University of Breslau, Steinitz went to Berlin to study mathematics attending lectures by many famous scientists including\nGeorg Frobenius\n,\nLeopold Kronecker\nand\nMax Planck\n. After spending two years in Berlin, he returned to Breslau in\n1893\n. He submitted a solution to a prize problem announced by the university and this won him not only\n200\nmarks but also the right to submit his doctoral dissertation without payment of the usual fee. He worked on this dissertation, advised by\nJacob Rosanes\n, and was awarded his doctorate in\n1894\nfor his thesis\nÜber die Construktion der Configurationen\nn\n3\nn_{3}\nn\n3\n​\nⓉ\n(\nOn construction of the n\n3\nconfiguration\n)\n. In this work he considers incidence structures in which each line contains exactly\n3\npoints and through each point there are exactly\n3\nlines. He shows that such a structure could be realised in the Euclidean plane with straight lines except maybe one line which has to be drawn as a quadratic curve. He also proved a result on configurations which in fact is just\nKönig\n's theorem for regular bipartite graphs which\nDenes König\npresented to the\nCongrès de philosophie mathématique\nin Paris in\n1914\nand proved in his paper\nSur un problème de la théorie générale des ensembles et la théorie des graphes\nⓉ\n(\nOn a problem in general set theory and graph theory\n)\n(1923)\n. Steinitz's solution of\nKönig\n's theorem twenty years before\nKönig\nis discussed in detail in\n[\n3\n]\n.\nIn\n1897\nSteinitz was appointed\nPrivatdozent\nat the Technische Hochschule Berlin-Charlottenburg after submitting his\nhabilitation\nthesis. In the same year he published the paper\nÜber die Unmöglichkeit, gewisse Configurationen\nn\n3\nn_{3}\nn\n3\n​\nin einem geschlossenen Zuge zu durchlaufen\nⓉ\n(\nOn the impossibility of certain n\n3\nconfigurations to go through in a closed course\n)\n. He soon came in contact with\nIssai Schur\nand\nEdmund Landau\nwho were both studying in Berlin for their doctorates when Steinitz was appointed. He also became a close friend of\nKurt Hensel\nwho had been a Privatdozent at Berlin for ten years before Steinitz arrived.\nHensel\n's grandfather, the Prussian court painter Wilhelm Hensel, had married Fanny Mendelssohn, the eldest sister of the famous composer Felix Mendelssohn. Fanny was herself a famous pianist and composer who wrote about\n500\nmusical compositions in all, including about\n120\npieces for piano. Steinitz spent many happy evenings in\nHensel\n's home playing chamber music. Steinitz joined the\nGerman Mathematical Society\n(\nDeutsche Mathematiker-Vereinigung\n)\nin\n1897\nand there he met\nOtto Toeplitz\n. The two became close friends and often played music together.\nIn\n1909\nSteinitz was considered for an extraordinary professorship at the University of Würzburg. Although he was not appointed he clearly was considered a strong candidate by\nDavid Hilbert\nwho wrote in his support\n(\nsee for example\n[\n5\n]\n)\n:-\nSteinitz is no longer a very young experienced lecturer of great versatility and who has worked on numbers theory, set theory, polyhedron geometry and analysis situs; he has recently been on the recommended list almost everywhere but has not been appointed due to adverse circumstances. From a personal point of view he is, without doubt, extremely likeable as well as very modest and agreeable.\nThe offer of a professorship at the Technical College of Breslau saw him return to Breslau in\n1910\n. In the following year, he married his cousin Martha\n(1875\n-\n1942)\nwhose parents were Julius Steinitz\n(1844\n-\n1919)\nand Rosalie Freund\n(1847\n-\n1937)\n. Steinitz had taught Martha to play the piano when he was at school, continuing the lessons while he was a student. Martha was a very talented pianist who on occasion played duets with the celebrated Austrian pianist and piano teacher Artur Schnabel. Ernst and Martha Steinitz had one child; a son Erhard was born on\n6\nAugust\n1912\n. After spending ten years at the Technical College of Breslau, he moved to Kiel in\n1920\nwhere he was appointed to the chair of mathematics at the Christian-Albrechts University. This chair, the first in mathematics which was established when the University had been founded in\n1665\n, had become vacant when\nHeinrich Wilhelm Jung\nwas appointed to Halle to succeed\nAlbert Wangerin\n. Again\nHilbert\nhad supported Steinitz's appointment writing\n(\nsee for example\n[\n5\n]\n)\n:-\nMy first suggestion would be Steinitz, who deserves it and is up and coming. You will get on well with him. From a purely scientific point of view I consider him to be the most successful researcher among the persons mentioned.\nBelow Steinitz he listed\nFelix Hausdorff\nand\nLudwig Bieberbach\n. A second chair of mathematics at Kiel had become vacant at about the same time and this was filled by Steinitz's friend\nOtto Toeplitz\nwho was already an extraordinary professor at Kiel. Steinitz took up his appointment on\n30\nApril\n1920\nand during his years at Kiel he taught a wide-ranging collection of courses including courses on algebra, polyhedra, number theory, complex analysis, topology, geometry, vector analysis and mechanics. He also conducted a research seminar in collaboration with his colleagues\nOtto Toeplitz\nand\nHelmut Hasse\n.\nMusic still played a major role in Steinitz's life. Karsten Johnsen writes in\n[\n5\n]\nthat he:-\n... retained his great passion for music throughout his life. There are reports that he could play Beethoven piano sonatas from memory. ... Heinrich Heesch,\nToeplitz\nand Steinitz had played music together. There is a story, probably originating from Heesch, that at a symphony concert in Kiel Steinitz spontaneously came to the aid of an indisposed soloist and played the Schumann piano concerto.\nSteinitz died from heart problems in\n1928\n, was cremated on\n3\nOctober\n1928\nin Lübeck but his ashes were buried in Breslau. Only a few weeks before his death\nErich Hecke\nwrote to\nAdolf Kneser\n, who was at Breslau, about Steinitz:-\nHe is certainly a very quiet and modest man, but in my opinion and that of many others, he is a truly profound mathematical thinker who has written extremely significant and seminal works.\nAfter the death of her husband, Martha returned to Breslau with their sixteen year old son Erhard but after the Nazis came to power in\n1933\nMartha and Erhard went to Palestine. Given the musical talents of his parents, it will come as no surprise to learn that Erhard was very musical. In fact he played bassoon in the Israel Philharmonic when it was first formed. Sadly, Martha chose to return to Breslau where she became a victim of the Nazis. She was sent to Theresienstadt, a transit concentration camp, before being sent to the Treblinka concentration camp where she died in the gas chambers in the second half of\n1942\n. Sadly Erhard Steinitz, who married Ilse Schlesinger, died in\n1948\nat the age of\n36\n.\nThe direction of Steinitz's mathematics was much influenced by\nHeinrich Weber\nand by\nHensel\n's results on\np\np\np\n-adic numbers in\n1899\n. In\n[\n4\n]\ninteresting results by Steinitz are discussed. These results were given by Steinitz in\n1900\n, when he was a Privatdozent at the Technische Hochschule Berlin-Charlottenburg, at the annual meeting of the\nDeutsche Mathematiker-Vereinigung\nin Aachen. In his talk Steinitz introduced an algebra over the ring of integers whose base elements are isomorphism classes of finite\nabelian groups\n. Today this is known as the\nHall\nalgebra. Steinitz made a number of conjectures which were later proved by\nHall\n.\nSteinitz is most famous for work which he published in\n1910\n. He gave the first abstract definition of a field in\nAlgebraische Theorie der Körper\nⓉ\n(\nAlgebraic theory of fields\n)\nin that year. Prime fields, separable elements and the degree of transcendence of an extension field are all introduced in this\n1910\npaper. He proved that every field has an algebraically closed extension field, perhaps his most important single theorem. The now standard construction of the\nrationals\nas equivalence classes of pairs of integers under the equivalence relation:\n(\na\n,\nb\n)\n(a, b)\n(\na\n,\nb\n)\nis equivalent to\n(\nc\n,\nd\n)\n(c, d)\n(\nc\n,\nd\n)\nif and only if\na\nd\n=\nb\nc\nad = bc\na\nd\n=\nb\nc\nwas also given by Steinitz in\n1910\n. In\n1930\n, twenty years after its first publication, Steinitz's paper\nAlgebraische Theorie der Körper\nⓉ\n(\nAlgebraic theory of fields\n)\nwas republished with a foreword by\nReinhold Baer\nand\nHelmut Hasse\n. They wrote:-\nSteinitz's work \"Algebraische Theorie der Körper\" ... has become the starting point for many far-reaching analyses in the field of algebra and arithmetic. In the classic beauty and perfection of form of its presentation in all its details it is not only a landmark in the development of algebraic knowledge but it also remains today an outstanding, even indispensable introduction for everyone who wishes to devote himself to the field of detailed studies of more modern algebra\nSteinitz also worked on polyhedra and, after his death, his manuscript on the topic was edited by\nHans Rademacher\nand published as\nVorlesungen über die Theorie der Polyeder\nⓉ\n(\nLectures on the theory of polyhedra\n)\nin\n1934\n.\nDonald Coxeter\nwrites\n[\n2\n]\n:-\nMost people who write about polyhedra are concerned with special forms, such as regular or crystallographic polyhedra. Steinitz has deliberately kept away from special figures, save as examples, since they have been fully treated in such works as Brückner's 'Vielecke und Vielflache'. Many results which one is tempted to take for granted are here proved, with admirable thoroughness and rigour. Subsequent authors will surely be grateful that they can quote such results, instead of either assuming them as \"obvious\" or trying to prove them for themselves. The general theory of polyhedra - even of convex polyhedra - is rather a tantalizing subject. The natural question, \"How many types of polyhedra have\nn\nn\nn\nvertices?\", can be answered for small values of\nn\nn\nn\n, and anyone who is sufficiently industrious can take values a little higher than his predecessors; but very little is known when\nn\nn\nn\nis arbitrary. Steinitz introduces polyhedra from many different aspects: metrical, combinatorial, topological, analytical, projective and axiomatic. Then, having laid the foundations, he is content to stop. This treatment causes a certain lack of unity in structure, and the reader must not expect to find any startling conclusions. Each general statement is amply illustrated by examples; this accounts for the book's great length, but makes it more readable than it could otherwise be. Much of the latter part is concerned with proving in various ways the 'Fundamental Theorem of Convex Types'. Steinitz defines a \"K-polyhedron\" as a Eulerian polyhedron with the property that whenever two faces have two vertices in common, the join of these vertices is an edge. Clearly every convex polyhedron is a K-polyhedron. The \"Fundamental Theorem\" states that every K-polyhedron is isomorphic with a convex polyhedron. Although the book has only a paper cover, it is elegantly printed on good paper, and the\n190\ndiagrams leave nothing to be desired.\nFinally let us mention some of Steinitz's other mathematical contributions. He published important papers on module theory, for example\nZur Theorie der Moduln\nⓉ\n(\nOn the theory of moduli\n)\n(1899)\nand the two-part paper\nRechteckige Systeme und Moduln in algebraischen Zahlköppern\nⓉ\n(\nRectangular systems and modules in algebraic number fields\n)\n(1911\n,\n1912)\n. He also wrote several significant papers on conditionally convergent series such as\nBedingt konvergente Reihen und konvexe Systeme\nⓉ\n(\nConditionally convergent series and convex systems\n)\n(1913)\n. In fact\nEdmund Landau\nhad suggested to Steinitz that he read\nPaul Lévy\n's\n1905\npaper on conditionally convergent series but Steinitz found this unsatisfactory writing in his\n1913\npaper that\nLandau\n's suggestion:-\n... prompted me to study\n[\nLévy\n's\n]\nwork once more in the greatest detail. It is written in a very brief, indeed erratic manner and often in a language which is not clear. If the reader is unaware of the solution, he will in places hardly be able to guess what is meant. ... However much we must deplore publications which are in such a deficient form that extensive commentaries are necessary if they are to be understood, we must admit that M\nLévy\nhas largely proved the proposition on the indicated series with usually complex numbers in the quoted work. The situation with regard to the proposition on generally complex numbers is different, as only results are indicated here. This does not indicate that M\nLévy\nhas not also found a solution for the general case and it indicates even less that he was not able to find it. But one cannot say that this proof is contained in his paper. ...\nIn fact, perhaps surprisingly, it was in the context of his work on series that he set out what today is often called the 'Steinitz replacement theorem' for vector spaces. In\nBedingt konvergente Reihen und konvexe Systeme\nⓉ\n(\nConditionally convergent series and convex systems\n)\n(1913)\nhe stated and proved the replacement theorem in the following form\n(\nwe have changed Steinitz's language into modern terminology\n)\n:-\nLet\nV\nV\nV\nbe a vector space which is spanned by\nn\nn\nn\nelements. If\nV\nV\nV\ncontains\nr\nr\nr\nlinearly independent elements\nv\n1\n,\nv\n2\n,\n.\n.\n.\n,\nv\nr\nv_{1}, v_{2}, ..., v_{r}\nv\n1\n​\n,\nv\n2\n​\n,\n.\n.\n.\n,\nv\nr\n​\n, there is a spanning set of\nV\nV\nV\nconsisting of\nn\nn\nn\nelements and containing the\nv\ni\n,\n1\n≤\ni\n≤\nr\nv_{i}, 1 ≤ i ≤ r\nv\ni\n​\n,\n1\n≤\ni\n≤\nr\n. In particular, a vector space spanned by\nn\nn\nn\nelements cannot contain more than\nn\nn\nn\nlinearly independent elements.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Georg Frobenius",
    "Leopold Kronecker",
    "Max Planck",
    "Jacob Rosanes",
    "König",
    "Denes König",
    "Privatdozent",
    "habilitation",
    "Issai Schur",
    "Edmund Landau",
    "Kurt Hensel",
    "Hensel",
    "German Mathematical Society",
    "Otto Toeplitz",
    "David Hilbert",
    "Heinrich Wilhelm Jung",
    "Albert Wangerin",
    "Hilbert",
    "Felix Hausdorff",
    "Ludwig Bieberbach",
    "Helmut Hasse",
    "Toeplitz",
    "Erich Hecke",
    "Adolf Kneser",
    "Heinrich Weber",
    "Deutsche Mathematiker-Vereinigung",
    "abelian groups",
    "Hall",
    "rationals",
    "Reinhold Baer",
    "Hans Rademacher",
    "Donald Coxeter",
    "Paul Lévy",
    "Landau",
    "Lévy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}