{
  "nome_completo": "Étienne Pascal",
  "nome_curto": "Étienne Pascal",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pascal_Etienne/",
  "data_nascimento": "2 May 1588",
  "local_nascimento": "Clermont (now Clermont-Ferrand), Auvergne, France",
  "data_morte": "24 September 1651",
  "local_morte": "Paris, France",
  "summary": "Étienne Pascal was a French lawyer and amateur mathematician. He was the father of Blaise Pascal.",
  "biografia": "Étienne Pascal\n's parents were Martin Pascal, who was treasurer of France, and Marguerite Pascal de Mons. Étienne was trained in law in Paris, receiving his degree in\n1610\n. He returned to his home town of Clermont were he purchased the post of counsellor for Bas-Auvergne, the region around Clermont, in\n1610\n. He came from a wealthy family so had ample money and had no need to earn a living. However he was keen to reach high positions in the service of the French nation so he sought influential jobs. Perhaps at this stage we should put his life into context by saying a few words about France in this period. Louis XIII had become King of France in\n1610\n, the year in which Étienne Pascal was awarded his law degree. The fact that Louis XIII's father Henry IV had been assassinated by a fanatical Roman Catholic, and Louis was only nine years old when he succeeded to the throne, already gives some idea of the political situation. It was a time of revolt by the French peasants and officials loyal to the government, such at Étienne Pascal, were in some danger of assassination.\nIn\n1616\nÉtienne married Antoinette Begon. Antoinette was\n20\nand Étienne was\n28\nwhen they married. They had three children, Gilberte born in\n1620\n, Blaise born in\n1623\n, and Jacqueline born in\n1625\n. Of course\nBlaise Pascal\nis the famous mathematician and philosopher who has a major biography in this archive. Étienne Pascal served as a tax assessor, then in\n1625\nwas made president of the provincial division of the Cour des Aides, the board of excise which was responsible for financial matters and taxation. Clermont was where this provincial tax court, one of twelve such courts in France, met. Tragedy struck the family, however, when Antoinette died in\n1626\n. Étienne employed a governess, Louise Delfault, to bring up his three children but, being an intelligent man with a wide range of intellectual interests, he played a major role in their education. He had a particular passion for science and mathematics but he was also knowledgeable in ancient languages, Greek literature, and the art of poetry.\nRichelieu was three years older than Étienne Pascal and employed a rather different route to power in France. He began with a career in the Church and, as Bishop of Luçon, became involved with the government in the difficult period when Louis XIII was a minor. The King managed to get Richelieu made a Cardinal, then appointed him a secretary of state in\n1624\n, giving him the title of first minister four years later. In\n1631\nÉtienne Pascal went to Paris so that his son could have the best education and he devoted himself the Blaise's education there. In\n1634\nÉtienne was appointed to a committee set up by Cardinal Richelieu to judge whether\nJean-Baptiste Morin\n's scheme for determining longitude from the Moon's motion was practical. In the same year he sold his Clermont presidency. From about this time he became involved with\nMersenne\n's meetings. Through these he collaborated with\nRoberval\n,\nDesargues\nand\nMydorge\n[\n1\n]\n:-\nIn November\n1635\nMersenne\ndedicated to Pascal the \"Traité des orgues\" of his Harmonie universelle\n(1636)\n.\nRoberval\ncommunicated to Pascal his first discoveries concerning the cycloid and intervened on his side in the debate concerning the nature of gravity. ... At the beginning of\n1637\nFermat\nwrote his \"Solution d'un problème proposé par M de Pascal\".\nÉtienne is famed as the discoverer of the curve the\nLimaçon of Pascal\n.  The curve, so named by\nRoberval\n, can be used to\ntrisect an angle\n. He discovered the curve in around\n1637\n. In a letter\n(\nsee\nLettre d'Étienne Pascal et Roberval à Fermat, samedi\n16\naoût\nⓉ\n(\nLetter from Etienne Pascal and Roberval to Fermat, Saturday August\n16\nth\n)\n1636)\nhe actively argued in favour of\nFermat\n's\nDe maximis et minimis\nⓉ\n(\nOn maxima and minima\n)\nin opposition to\nDescartes\nwho viewed the work in a very negative light.\nIn\n1635\nÉtienne Pascal had used the money he had received from the sale of his position in Clermont to invest in government bonds. As a loyal government supporter he felt that this was the right thing to do and also trusted in the government to safeguard his finances. However, wars are expensive and after France entered the Thirty Years War in\n1638\nthe government was unable to honour the bonds it had issued. There were widespread protests from those who had lost fortunes, and Étienne, despite his support for the government, joined the protests. Governments, however, do not like protests and Étienne Pascal was threatened with imprisonment in the Bastille. In March\n1638\nhe fled from Paris to avoid this punishment and returned to the Auvergne.\nJacqueline Pascal was fourteen years of age by\n1639\nand she had become a talented poet and actress. She took part in a private performance of Scudery's\nAmour tyrannique\nⓉ\n(\nTyrannical love\n)\nput on for Cardinal Richelieu. After the performance, Jacqueline met Cardinal Richelieu and persuaded him to pardon her father for his part in the protests. Certainly Jacqueline must have had great charm, for Cardinal Richelieu did not just do the minimum to please Jacqueline - he appointed Étienne to the post of chief tax officer in Rouen, the capital of Normandy. Étienne took up the post in April\n1639\nand it proved a very demanding position. In January\n1643\nhe wrote a postscript to a letter written by\nBlaise Pascal\n:-\nMy dear daughter will excuse me if I do not write to her as I wished, having no leisure for it; for I have never been in a tenth part the perplexity that I am at present. I could not be more so without being overwhelmed; for the last four months I have not been in bed six times before two o'clock in the morning.\nHard work and great skill on the part of Étienne saw him tackle unrest in the people brought about by bad harvests, high taxes, and an outbreak of the plague. There is no doubt that his honesty, unusual in officials in his position at that time, gave him respect from the people.\nIn early\n1646\nÉtienne broke a leg after falling on some ice. The Deschamps brothers, two local bone setters, were called to help and they moved into the Pascal home to look after Étienne. The brothers were followers of the abbé de Saint-Cyran who was a founder of the Jansenist movement and a director of convent at Port-Royal des Champs near Versailles. The Deschamps had a profound effect on the family which, prior to this, had been Roman Catholics but open-minded and not overly influenced by the teaching of the Church. Étienne was converted by the brothers but still tried to prevent Jacqueline joining the nuns of Port-Royal since he did not want to lose his daughter.\nBlaise Pascal\n's life was changed by the brothers and he became the spiritual leader of the family. One has to wonder how different might\nBlaise Pascal\n's life might have been had his father not broken his leg, for from that time on his life was dominated by the religious ideas of the Deschamps brothers.\nÉtienne Pascal retired from his official position in Rouen in\n1648\n. He had collaborated with his son and with\nPierre Petit\nin October\n1646\nin repeating\nTorricelli\n's experiment on the barometric vacuum. He continued his scientific interests and, in April\n1648\n, he wrote a letter to R P Noël concerning the problem of the vacuum. In August\n1648\nÉtienne went to Paris, returning to the Auvergne in May\n1649\n. He left for Paris again in November\n1650\nand continued to live there until his death less than a year later. After his father died,\nBlaise Pascal\nwrote to his sister Jacqueline giving a deeply Christian meaning to death in general and to his father's death in particular. His ideas here were to form the basis for his later philosophical work\nPensées\nⓉ\n(\nThoughts\n)\n.",
  "matematicos_citados_na_biografia": [
    "Blaise Pascal",
    "Jean-Baptiste Morin",
    "Mersenne",
    "Roberval",
    "Desargues",
    "Mydorge",
    "Fermat",
    "trisect an angle",
    "Descartes",
    "Pierre Petit",
    "Torricelli"
  ],
  "imagens": []
}