{
  "nome_completo": "Étienne Bézout",
  "nome_curto": "Étienne Bézout",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bezout/",
  "data_nascimento": "31 March 1730",
  "local_nascimento": "Nemours, France",
  "data_morte": "27 September 1783",
  "local_morte": "Basses-Loges (near Fontainbleau), France",
  "summary": "Étienne Bézout was a French mathematician who is best known for his theorem on the number of solutions of polynomial equations.",
  "biografia": "Étienne Bézout\n's father was Pierre Bézout who was a magistrate in the town of Nemours. One might have expected Étienne to follow the same career, for his grandfather had also been a magistrate in Nemours. Étienne's mother was Hélène-Jeanne Filz.\nAs we have already indicated the family tradition almost demanded that Étienne follow in his father and grandfather's footsteps. However the remarkable mathematics of\nLeonard Euler\nproved stronger than his parents wishes, for once Bézout had read\nEuler\n's works he wished to devote himself to mathematics. In\n1756\nhe published a memoir\nDynamique\n. In the following year he published\nQuantités différentielles\nand in\n1758\nRectification des courbes\n. These latter two papers were investigations of integration.\nIn\n1758\nBézout was appointed an adjoint in mechanics of the\nAcadémie des Sciences\nand, in the same year, as royal censor. He was appointed examiner of the Gardes de la Marine in\n1763\n, the post being offered to him by the Duke of Choiseul. One important task that he was given in this role was to compose a textbook specially designed for teaching mathematics to the students.\nBézout is famed for the texbooks which came out of this assignment. The first was\nCours de mathématiques à l'usage des Gardes du Pavillon et de la Marine\nⓉ\n(\nMathematics for the use of 'Pavillon' and Marine Guards\n)\n, a four volume work which appeared in\n1764\n-\n67\n.\nIn\n1768\nCamus\n, who was the examiner for the artillery, died. Bézout was appointed to succeed him becoming examiner of the Corps d'Artillerie. He began work on another mathematics textbook and as a result he produced\nCours complet de mathématiques à l'usage de la marine et de l'artillerie\nⓉ\n(\nComplete Mathematics for the use of the navy and artillery\n)\n, a six volume work which appeared between\n1770\nand\n1782\n. This was a very successful textbook and for many years it was the book which students hoping to enter the École Polytechnique studied. Grabiner writes in\n[\n1\n]\n:-\nThe experience of teaching non-mathematicians shaped the style of the works: Bézout treated geometry before algebra, observing that beginners were not yet familiar enough with mathematical reasoning to understand the force of algebraic demonstrations, although they did appreciate proofs in geometry. He eschewed the frightening terms \"axiom\", \"theorem\", \"scholium\", and tried to avoid arguments that were too close and detailed.\nAs might be expected given this approach aimong at the readership for whom Bézout intended his texts, his books came in for a certain amount of criticism for lacking rigour. However, despite this they were books which could be understood by those who needed to use mathematics and as a result were very popular and widely used. Their use spread beyond France for they were translated into English and used in North America. In particular Harvard University adopted them as calculus textbooks.\nReturning to give more information about Bézout's career, we should note that he was promoted to associé in mechanics at the\nAcadémie des Sciences\nin\n1768\nand then further promoted to pensionnaire in\n1770\n.\nAs we have indicated Bézout is famed for being a writer of textbooks but he is famed also for his work on algebra, in particular on equations. He was much occupied with his teaching duties after his\n1763\nappointments and he took these very seriously indeed. As a consequence he could devote relatively little time to research and he made a conscience decision to restrict the range of his work so that he could produce worthwhile results in a narrow order.\nThe way Bézout went about his research is interesting since still today it is a good approach for obtaining results. He attacked quite general problems, but since an attack was usually beyond what could be achieved with the mathematical knowledge then available, he attacked special cases of the general problems which he could solve. This approach often leads slowly to more and more understanding of the general case which may eventually become soluble. Bézout had a name for this approach to mathematics, namely the \"method of simplifying assumptions\".\nHis first paper on the theory of equations\nSur plusieurs classes d'équations de tous les degrés qui admettent une solution algébrique\nⓉ\n(\nOn several classes of equations of all degrees which admit an algebraic solution\n)\nexamined how a single equation in a single unknown could be attacked by writing it as two equations in two unknowns. He wrote in this paper:-\nIt is known that a determinate equation can always be viewed as the result of two equations in two unknowns, when one of the unknowns is eliminated.\nOf course on the face of it this does not help solve the equation but Bézout made the simplifying assumption that one of the two equations was of a particularly simple form. For example he considered the case when one of the two equations had only two terms, the term of degree\nn\nn\nn\nand a constant term. Already this paper had introduced the topic to which Bézout would make his most important contributions, namely methods of elimination to produce from a set of simultaneous equations, a single resultant equation in one of the unknowns.\nHe also did important work on the use of\ndeterminants\nin solving equations. This appears in a paper\nSur le degré des équations résultantes de l'évanouissement des inconnues\nⓉ\n(\nThe degree of equations resulting from disappearing unknowns\n)\nwhich he published in\n1764\n. As a result of the ideas in this paper for solving systems of simultaneous equations,\nSylvester\n, in\n1853\n, called the determinant of the matrix of coefficients of the equations the Bézoutiant.\nThese and further papers published by Bézout in the theory of equations were gathered together in\nThéorie générale des équations algébraiques\nⓉ\n(\nGeneral theory of algebraic equations\n)\nwhich was published in\n1779\n. This work includes a result known as Bézout's theorem:-\nThe degree of the final equation resulting from any number of complete equations in the same number of unknowns, and of any degrees, is equal to the product of the degrees of the equations.\nBy a complete equation Bézout meant one defined by a polynomial which contains terms of all possible products of the unknowns whose degree does not exceed that of the polynomial. One has to understand the problems that faced Bézout for he did not have our simple suffix notation to denote the unknowns by\nx\n1\n,\nx\n2\n,\nx\n3\n,\n.\n.\n.\nx_{1}, x_{2}, x_{3}, ...\nx\n1\n​\n,\nx\n2\n​\n,\nx\n3\n​\n,\n.\n.\n.\nnor could he even label his equations with a suffix notation. Despite this Bézout, who was prepared to enter long and difficult algebraic manipulations, proved his theorem with just a little hand waving over an inductive argument.\nIn this work Bézout also gave the first satisfactory proof of a result of\nMaclaurin\non the intersection of two algebraic curves.\nGrabiner\n[\n1\n]\ntells us that:-\n[\nBézout\n]\nmarried early and happily; although he was reserved and somewhat sombre in society, those who knew him spoke of his great kindness and warm heart. By\n[1763]\nBézout had become a father ...\nAfter his death in\n1783\na statue was erected in Nemours, the town of his birth, to commemorate his great achievements.",
  "matematicos_citados_na_biografia": [
    "Leonard Euler",
    "Euler",
    "Académie des Sciences",
    "Camus",
    "determinants",
    "Sylvester",
    "Maclaurin"
  ],
  "imagens": [
    "bezout.jpg"
  ]
}