{
  "nome_completo": "Euclid of Alexandria",
  "nome_curto": "Euclid",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Euclid/",
  "data_nascimento": "about 325 BC",
  "local_nascimento": "(probably) Alexandria, Egypt",
  "data_morte": "about 265 BC",
  "local_morte": "Alexandria, Egypt",
  "summary": "Euclid was a Greek mathematician best known for his treatise on geometry: The Elements . This influenced the development of Western mathematics for more than 2000 years.",
  "biografia": "Euclid of Alexandria\nis the most prominent mathematician of antiquity best known for his treatise on mathematics\nThe Elements\n. The long lasting nature of\nThe Elements\nmust make Euclid the leading mathematics teacher of all time. However little is known of Euclid's life except that he taught at Alexandria in Egypt.\nProclus\n, the last major Greek philosopher, who lived around\n450\nAD wrote\n(\nsee\n[\n1\n]\nor\n[\n9\n]\nor many other sources\n)\n:-\nNot much younger than these\n[\npupils of\nPlato\n]\nis Euclid, who put together the \"Elements\", arranging in order many of\nEudoxus\n's theorems, perfecting many of\nTheaetetus\n's, and also bringing to irrefutable demonstration the things which had been only loosely proved by his predecessors. This man lived in the time of the first Ptolemy; for\nArchimedes\n, who followed closely upon the first Ptolemy makes mention of Euclid, and further they say that Ptolemy once asked him if there were a shorted way to study geometry than the Elements, to which he replied that there was no royal road to geometry. He is therefore younger than\nPlato\n's circle, but older than\nEratosthenes\nand\nArchimedes\n; for these were contemporaries, as\nEratosthenes\nsomewhere says. In his aim he was a Platonist, being in sympathy with this philosophy, whence he made the end of the whole \"Elements\" the construction of the so-called Platonic figures.\nThere is other information about Euclid given by certain authors but it is not thought to be reliable. Two different types of this extra information exists. The first type of extra information is that given by Arabian authors who state that Euclid was the son of Naucrates and that he was born in Tyre. It is believed by historians of mathematics that this is entirely fictitious and was merely invented by the authors.\nThe second type of information is that Euclid was born at Megara. This is due to an error on the part of the authors who first gave this information. In fact there was a\nEuclid of Megara\n, who was a philosopher who lived about\n100\nyears before the mathematician Euclid of Alexandria. It is not quite the coincidence that it might seem that there were two learned men called Euclid. In fact Euclid was a very common name around this period and this is one further complication that makes it difficult to discover information concerning Euclid of Alexandria since there are references to numerous men called Euclid in the literature of this period.\nReturning to the quotation from\nProclus\ngiven above, the first point to make is that there is nothing inconsistent in the dating given. However, although we do not know for certain exactly what reference to Euclid in\nArchimedes\n' work\nProclus\nis referring to, in what has come down to us there is only one reference to Euclid and this occurs in\nOn the sphere and the cylinder\n. The obvious conclusion, therefore, is that all is well with the argument of\nProclus\nand this was assumed until challenged by Hjelmslev in\n[\n48\n]\n. He argued that the reference to Euclid was added to\nArchimedes\n' book at a later stage, and indeed it is a rather surprising reference. It was not the tradition of the time to give such references, moreover there are many other places in\nArchimedes\nwhere it would be appropriate to refer to Euclid and there is no such reference. Despite Hjelmslev's claims that the passage has been added later, Bulmer-Thomas writes in\n[\n1\n]\n:-\nAlthough it is no longer possible to rely on this reference, a general consideration of Euclid's works ... still shows that he must have written after such pupils of\nPlato\nas\nEudoxus\nand before\nArchimedes\n.\nFor further discussion on dating Euclid, see for example\n[\n8\n]\n. This is far from an end to the arguments about Euclid the mathematician. The situation is best summed up by Itard\n[\n11\n]\nwho gives three possible hypotheses.\n(\ni\n)\nEuclid was an historical character who wrote the\nElements\nand the other works attributed to him.\n(\nii\n)\nEuclid was the leader of a team of mathematicians working at Alexandria. They all contributed to writing the 'complete works of Euclid', even continuing to write books under Euclid's name after his death.\n(\niii\n)\nEuclid was not an historical character. The 'complete works of Euclid' were written by a team of mathematicians at Alexandria who took the name Euclid from the historical character Euclid of Megara who had lived about\n100\nyears earlier.\nIt is worth remarking that Itard, who accepts Hjelmslev's claims that the passage about Euclid was added to\nArchimedes\n, favours the second of the three possibilities that we listed above. We should, however, make some comments on the three possibilities which, it is fair to say, sum up pretty well all possible current theories.\nThere is some strong evidence to accept\n(\ni\n)\n. It was accepted without question by everyone for over\n2000\nyears and there is little evidence which is inconsistent with this hypothesis. It is true that there are differences in style between some of the books of the\nElements\nyet many authors vary their style. Again the fact that Euclid undoubtedly based the\nElements\non previous works means that it would be rather remarkable if no trace of the style of the original author remained.\nEven if we accept\n(\ni\n)\nthen there is little doubt that Euclid built up a vigorous school of mathematics at Alexandria. He therefore would have had some able pupils who may have helped out in writing the books. However hypothesis\n(\nii\n)\ngoes much further than this and would suggest that different books were written by different mathematicians. Other than the differences in style referred to above, there is little direct evidence of this.\nAlthough on the face of it\n(\niii\n)\nmight seem the most fanciful of the three suggestions, nevertheless the\n20\nth\ncentury example of\nBourbaki\nshows that it is far from impossible.\nHenri Cartan\n,\nAndré Weil\n,\nJean Dieudonné\n,\nClaude Chevalley\nand\nAlexander Grothendieck\nwrote collectively under the name of\nBourbaki\nand\nBourbaki\n's\nEléments de mathématiques\ncontains more than\n30\nvolumes. Of course if\n(\niii\n)\nwere the correct hypothesis then\nApollonius\n, who studied with the pupils of Euclid in Alexandria, must have known there was no person 'Euclid' but the fact that he wrote:-\n.... Euclid did not work out the syntheses of the\nlocus\nwith respect to three and four lines, but only a chance portion of it ...\ncertainly does not prove that Euclid was an historical character since there are many similar references to Bourbaki by mathematicians who knew perfectly well that Bourbaki was fictitious. Nevertheless the mathematicians who made up the Bourbaki team are all well known in their own right and this may be the greatest argument against hypothesis\n(\niii\n)\nin that the 'Euclid team' would have to have consisted of outstanding mathematicians. So who were they?\nWe shall assume in this article that hypothesis\n(\ni\n)\nis true but, having no knowledge of Euclid, we must concentrate on his works after making a few comments on possible historical events. Euclid must have studied in\nPlato's Academy\nin Athens to have learnt of the geometry of\nEudoxus\nand\nTheaetetus\nof which he was so familiar.\nNone of Euclid's works have a preface, at least none has come down to us so it is highly unlikely that any ever existed, so we cannot see any of his character, as we can of some other Greek mathematicians, from the nature of their prefaces.\nPappus\nwrites\n(\nsee for example\n[\n1\n]\n)\nthat Euclid was:-\n... most fair and well disposed towards all who were able in any measure to advance mathematics, careful in no way to give offence, and although an exact scholar not vaunting himself.\nSome claim these words have been added to\nPappus\n, and certainly the point of the passage\n(\nin a continuation which we have not quoted\n)\nis to speak harshly\n(\nand almost certainly unfairly\n)\nof\nApollonius\n. The picture of Euclid drawn by\nPappus\nis, however, certainly in line with the evidence from his mathematical texts. Another story told by\nStobaeus\n[\n9\n]\nis the following:-\n... someone who had begun to learn geometry with Euclid, when he had learnt the first theorem, asked Euclid \"What shall I get by learning these things?\" Euclid called his slave and said \"Give him threepence since he must make gain out of what he learns\".\nEuclid's most famous work is his treatise on mathematics\nThe Elements\n. The book was a compilation of knowledge that became the centre of mathematical teaching for\n2000\nyears. Probably no results in\nThe Elements\nwere first proved by Euclid but the organisation of the material and its exposition are certainly due to him. In fact there is ample evidence that Euclid is using earlier textbooks as he writes the\nElements\nsince he introduces quite a number of definitions which are never used such as that of an oblong, a rhombus, and a rhomboid.\nThe\nElements\nbegins with definitions and five postulates. The first three postulates are postulates of construction, for example the first postulate states that it is possible to draw a straight line between any two points. These postulates also implicitly assume the existence of points, lines and circles and then the existence of other geometric objects are deduced from the fact that these exist. There are other assumptions in the postulates which are not explicit. For example it is assumed that there is a unique line joining any two points. Similarly postulates two and three, on producing straight lines and drawing circles, respectively, assume the uniqueness of the objects the possibility of whose construction is being postulated.\nThe fourth and fifth postulates are of a different nature. Postulate four states that all right angles are equal. This may seem \"obvious\" but it actually assumes that space in homogeneous - by this we mean that a figure will be independent of the position in space in which it is placed. The famous fifth, or parallel, postulate states that one and only one line can be drawn through a point parallel to a given line. Euclid's decision to make this a postulate led to Euclidean geometry. It was not until the\n19\nth\ncentury that this postulate was dropped and\nnon-euclidean geometries\nwere studied.\nThere are also axioms which Euclid calls 'common notions'. These are not specific geometrical properties but rather general assumptions which allow mathematics to proceed as a deductive science. For example:-\nThings which are equal to the same thing are equal to each other.\nZeno of Sidon\n, about\n250\nyears after Euclid wrote the\nElements\n, seems to have been the first to show that Euclid's propositions were not deduced from the postulates and axioms alone, and Euclid does make other subtle assumptions.\nThe\nElements\nis divided into\n13\nbooks. Books one to six deal with plane geometry. In particular books one and two set out basic properties of triangles, parallels, parallelograms, rectangles and squares. Book three studies properties of the circle while book four deals with problems about circles and is thought largely to set out work of the followers of\nPythagoras\n. Book five lays out the work of\nEudoxus\non proportion applied to\ncommensurable\nand incommensurable magnitudes.\nHeath\nsays\n[\n9\n]\n:-\nGreek mathematics can boast no finer discovery than this theory, which put on a sound footing so much of geometry as depended on the use of proportion.\nBook six looks at applications of the results of book five to plane geometry.\nBooks seven to nine deal with\nnumber theory\n. In particular book seven is a self-contained introduction to number theory and contains the\nEuclidean algorithm\nfor finding the greatest common divisor of two numbers. Book eight looks at numbers in\ngeometrical progression\nbut\nvan der Waerden\nwrites in\n[\n2\n]\nthat it contains:-\n... cumbersome enunciations, needless repetitions, and even logical fallacies. Apparently Euclid's exposition excelled only in those parts in which he had excellent sources at his disposal.\nBook ten deals with the theory of\nirrational\nnumbers and is mainly the work of\nTheaetetus\n. Euclid changed the proofs of several theorems in this book so that they fitted the new definition of proportion given by\nEudoxus\n.\nBooks eleven to thirteen deal with three-dimensional geometry. In book eleven the basic definitions needed for the three books together are given. The theorems then follow a fairly similar pattern to the two-dimensional analogues previously given in books one and four. The main results of book twelve are that circles are to one another as the squares of their diameters and that spheres are to each other as the cubes of their diameters. These results are certainly due to\nEudoxus\n. Euclid proves these theorems using the \"\nmethod of exhaustion\n\" as invented by\nEudoxus\n. The\nElements\nends with book thirteen which discusses the properties of the five regular polyhedra and gives a proof that there are precisely five. This book appears to be based largely on an earlier treatise by\nTheaetetus\n.\nEuclid's\nElements\nis remarkable for the clarity with which the theorems are stated and proved. The standard of rigour was to become a goal for the inventors of the calculus centuries later. As\nHeath\nwrites in\n[\n9\n]\n:-\nThis wonderful book, with all its imperfections, which are indeed slight enough when account is taken of the date it appeared, is and will doubtless remain the greatest mathematical textbook of all time. ... Even in Greek times the most accomplished mathematicians occupied themselves with it:\nHeron\n,\nPappus\n,\nPorphyry\n,\nProclus\nand\nSimplicius\nwrote commentaries;\nTheon\nof Alexandria re-edited it, altering the language here and there, mostly with a view to greater clearness and consistency...\nIt is a fascinating story how the\nElements\nhas survived from Euclid's time and this is told well by Fowler in\n[\n7\n]\n. He describes the earliest material relating to the\nElements\nwhich has survived:-\nOur earliest glimpse of Euclidean material will be the most remarkable for a thousand years, six fragmentary ostraca containing text and a figure ... found on Elephantine Island in\n1906\n/\n07\nand\n1907\n/\n08\n... These texts are early, though still more than\n100\nyears after the death of\nPlato\n(\nthey are dated on palaeographic grounds to the third quarter of the third century BC\n)\n; advanced\n(\nthey deal with the results found in the \"Elements\"\n[\nbook thirteen\n]\n... on the pentagon, hexagon, decagon, and\nicosahedron\n)\n; and they do not follow the text of the Elements. ... So they give evidence of someone in the third century BC, located more than\n500\nmiles south of Alexandria, working through this difficult material... this may be an attempt to understand the mathematics, and not a slavish copying ...\nThe next fragment that we have dates from\n75\n-\n125\nAD and again appears to be notes by someone trying to understand the material of the\nElements\n.\nMore than one thousand editions of\nThe Elements\nhave been published since it was first printed in\n1482\n. Heath\n[\n9\n]\ndiscusses many of the editions and describes the likely changes to the text over the years.\nB L\nvan der Waerden\nassesses the importance of the\nElements\nin\n[\n2\n]\n:-\nAlmost from the time of its writing and lasting almost to the present, the Elements has exerted a continuous and major influence on human affairs. It was the primary source of geometric reasoning, theorems, and methods at least until the advent of non-Euclidean geometry in the\n19\nth\ncentury. It is sometimes said that, next to the Bible, the \"Elements\" may be the most translated, published, and studied of all the books produced in the Western world.\nEuclid also wrote the following books which have survived:\nData\n(\nwith\n94\npropositions\n)\n, which looks at what properties of figures can be deduced when other properties are given;\nOn Divisions\nwhich looks at constructions to divide a figure into two parts with areas of given ratio;\nOptics\nwhich is the first Greek work on perspective; and\nPhaenomena\nwhich is an elementary introduction to mathematical astronomy and gives results on the times stars in certain positions will rise and set. Euclid's following books have all been lost:\nSurface Loci\n(\ntwo books\n)\n,\nPorisms\n(\na three book work with, according to\nPappus\n,\n171\ntheorems and\n38\nlemmas\n)\n,\nConics\n(\nfour books\n)\n,\nBook of Fallacies\nand\nElements of Music\n. The\nBook of Fallacies\nis described by\nProclus\n[\n1\n]\n:-\nSince many things seem to conform with the truth and to follow from scientific principles, but lead astray from the principles and deceive the more superficial,\n[\nEuclid\n]\nhas handed down methods for the clear-sighted understanding of these matters also ... The treatise in which he gave this machinery to us is entitled Fallacies, enumerating in order the various kinds, exercising our intelligence in each case by theorems of all sorts, setting the true side by side with the false, and combining the refutation of the error with practical illustration.\nElements of Music\nis a work which is attributed to Euclid by\nProclus\n. We have two treatises on music which have survived, and have by some authors attributed to Euclid, but it is now thought that they are not the work on music referred to by\nProclus\n.\nEuclid may not have been a first class mathematician but the long lasting nature of\nThe Elements\nmust make him the leading mathematics teacher of antiquity or perhaps of all time. As a final personal note let me add that my\n[\nEFR\n]\nown introduction to mathematics at school in the\n1950\ns was from an edition of part of Euclid's\nElements\nand the work provided a logical basis for mathematics and the concept of proof which seem to be lacking in school mathematics today.",
  "matematicos_citados_na_biografia": [
    "Proclus",
    "Plato",
    "Eudoxus",
    "Theaetetus",
    "Archimedes",
    "Eratosthenes",
    "Euclid of Megara",
    "Bourbaki",
    "Henri Cartan",
    "André Weil",
    "Jean Dieudonné",
    "Claude Chevalley",
    "Alexander Grothendieck",
    "Apollonius",
    "locus",
    "Plato's Academy",
    "Pappus",
    "Stobaeus",
    "non-euclidean geometries",
    "Zeno of Sidon",
    "Pythagoras",
    "commensurable",
    "Heath",
    "number theory",
    "Euclidean algorithm",
    "geometrical progression",
    "van der Waerden",
    "irrational",
    "method of exhaustion",
    "Heron",
    "Porphyry",
    "Simplicius",
    "Theon",
    "icosahedron",
    "Conics"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}