{
  "nome_completo": "Eugenio Beltrami",
  "nome_curto": "Eugenio Beltrami",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beltrami/",
  "data_nascimento": "16 November 1835",
  "local_nascimento": "Cremona, Lombardy, Austrian Empire (now Italy)",
  "data_morte": "18 February 1900",
  "local_morte": "Rome, Italy",
  "summary": "Eugenio Beltrami contributed to work in differential geometry on curves and surfaces and gave a concrete realisation of the non-euclidean geometry.",
  "biografia": "Eugenio Beltrami\n's father, also called Eugenio Beltrami, was an artist who painted miniatures. His father had come from an artistic family, for his own father had engraved precious stones. The young Eugenio certainly inherited artistic talents from his family, but in his case in addition to the mathematical talents he would acquire, it was music rather than painting that became important in his life.\nBeltrami studied at Pavia from\n1853\nto\n1856\n, and there he was taught by Brioschi who had been appointed as professor of applied mathematics at the University of Pavia the year before Beltrami began his studies. Beltrami would have liked to continue his mathematical studies but he was suffering financial hardship so in\n1856\nhe had to stop his studies and take up a job. He was employed as the secretary to a railway engineer and this job took him first to Verona and then to Milan.\nWhile Beltrami was in Milan the Kingdom of Italy was established in\n1861\n. It was an important political event which did much to invigorate the academic scene in Italy although it seemed unlikely that Italy could achieve the economic progress made by other European countries since over three quarters of the population was illiterate and most were engaged in agriculture.\nAt Milan Beltrami began to work hard at his mathematical studies again and in\n1862\nhe published his first paper. He was appointed to the University of Bologna in\n1862\nas a visiting professor of algebra and analytic geometry. After two years in Bologna, Beltrami accepted the chair of geodesy at the University of Pisa, which he held from\n1864\nto\n1866\n. At Pisa he became friendly with\nBetti\n. In\n1866\nhe returned to Bologna where he was appointed professor of rational mechanics.\nWhen the Kingdom of Italy was established in\n1861\nTurin was the capital. In\n1870\nItalian troops entered Rome. The city had been held by the Pope with support from the French, but after Napoleon III was defeated and abdicated, French support to hold Rome evaporated. A new University of Rome was set up in the new Italian capital and Beltrami was appointed to the chair of rational mechanics there in\n1873\n. After three years in Rome, Beltrami moved to Pavia to take up the chair of mathematical physics there. However, Beltrami returned to Rome in\n1891\nand spent his last years teaching there.\nInfluenced by\nCremona\n,\nLobachevsky\n,\nGauss\nand\nRiemann\n, Beltrami contributed to work in\ndifferential geometry\non curves and surfaces. He translated\nGauss\n's work on conformal representation into Italian. He then considered the problem of when the geodesics on a surface could be represented as straight lines on the plane. Beltrami showed that not all geodesics could be represented in this way and he then went on to consider the natural question of which surfaces had the property that geodesics on the surface could be represented as straight lines on the plane. His answer was very pleasing, for he discovered that they were precisely the surfaces of constant curvature. Beltrami then considered surfaces of constant negative curvature and was led to his most famous results of\n1868\n.\nHis\n1868\npaper\nEssay on an interpretation of\nnon-euclidean geometry\nwhich gives a concrete realisation of the non-euclidean geometry of\nLobachevsky\nand\nBolyai\nand connects it with\nRiemann\n's geometry. The concrete realisation uses the pseudosphere, a surface generated by the revolution of a tractrix about its\nasymptote\n.\nBeltrami in this\n1868\npaper did not set out to prove the consistency of non-Euclidean geometry or the independence of the Euclidean\nparallel postulate\n. What he suggested was that\nBolyai\nand\nLobachevsky\nhad not really introduced new concepts at all but had described the theory of geodesics on surfaces of negative curvature. Beltrami wrote in this paper:-\nWe have tried to find a real foundation to this doctrine, instead of having to admit for it the necessity of a new order of entities and concepts.\nHouel\ntranslated both\nLobachevsky\n's and Beltrami's work into French in\n1870\nand he noted how Beltrami's paper proved the independence of the\nEuclid\n's parallel postulate.\nThe\n1868\npaper should have appeared sooner but it was delayed in its publication because\nCremona\nwas not entirely happy that it was not based on a circular argument.\nCremona\nworried that euclidean geometry was being used to describe non-euclidean geometry and he saw a possible logical difficulty in this.\nCremona\nwas wrong, but his worries caused Beltrami to put his work on one side for a while but the work of\nRiemann\nconvinced Beltrami that his methods were sound.\nBeltrami also worked on optics, thermodynamics, elasticity, electricity and magnetism. His contributions to these topics appeared in the four-volume work,\nOpere Matematiche\n(1902\n-\n20)\n, published posthumously. Some of his work on physical topics relates to his non-euclidean geometry for he examined how the gravitational potential as given by\nNewton\nwould have to be modified in a space of negative curvature. He gave a generalised form of the\nLaplace\noperator.\nIn\n[\n11\n]\nTazzioli examines how Beltrami used differential parameters when considering problems in mechanics, elasticity, and potential theory. He also used them in giving a generalisation of\nGreen\n's theorem. Beltrami indirectly influenced the development of\ntensor analysis\nby providing a basis for the ideas of\nRicci-Curbastro\nand\nLevi-Civita\non the topic.\nSome of Beltrami's last work was on a mechanical interpretation of\nMaxwell\n's equations. There are interesting insights into Beltrami's thinking on this topic contained in his correspondence with\nCesàro\nsome of which is reproduced in\n[\n7\n]\n. One of these letters\n[\n7\n]\n:-\n...\n(\ndated December,\n1888)\nis devoted to the mechanical interpretation of\nMaxwell\n's equations. Here, Beltrami showed a new proof of the conditions when six given functions are the components of an elastic deformation.\nFinally we should mention an important contribution by Beltrami to the history of mathematics. This appears in a\n1889\npublication in which Beltrami brought to the attention of the mathematical world\nSaccheri\n's\n1733\nstudy of the parallel postulate. He compared\nSaccheri\n's results with those of Borelli,\nWallis\n,\nClavius\nand the non-euclidean geometry of\nLobachevsky\nand\nBolyai\n.\nBeltrami achieved an important role in Italian mathematics, becoming President of the\nAccademia dei Lincei\nin\n1898\n. In\n1899\nhe became a senator of the Kingdom of Italy.",
  "matematicos_citados_na_biografia": [
    "Betti",
    "Cremona",
    "Lobachevsky",
    "Gauss",
    "Riemann",
    "differential geometry",
    "non-euclidean geometry",
    "Bolyai",
    "asymptote",
    "parallel postulate",
    "Houel",
    "Euclid",
    "Newton",
    "Laplace",
    "Green",
    "tensor analysis",
    "Ricci-Curbastro",
    "Levi-Civita",
    "Maxwell",
    "Cesàro",
    "Saccheri",
    "Wallis",
    "Clavius",
    "Accademia dei Lincei"
  ],
  "imagens": [
    "beltrami.jpg"
  ]
}