{
  "nome_completo": "Martha Euphemia Lofton Haynes",
  "nome_curto": "Euphemia Lofton Haynes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haynes/",
  "data_nascimento": "11 September 1890",
  "local_nascimento": "Washington, D.C., USA",
  "data_morte": "25 July 1980",
  "local_morte": "Washington, D.C., USA",
  "summary": "Euphemia Lofton Haynes was an American mathematician and educator. She was the first African-American woman to earn a PhD in mathematics.",
  "biografia": "Euphemia Lofton\nwas the daughter of William S Lofton\n(2\nMarch\n1862\n-\n1\nMarch\n1919)\n, a dentist and financier originally from Batesville, Arkansas, and Lavinia Dey who before her marriage was a kindergarten teacher. Lavinia was an active member of the Roman Catholic Church. We note that Euphemia only became\nEuphemia Lofton Haynes\nafter her marriage to Harold Appo Haynes in\n1917\nand that she seldom used the name Martha.\nIn\n1886\nWilliam S Lofton had graduated from Spencerian Business College and, two years later, graduated from Howard University Dental College. He set up a dental practice on M Street, Northwest, Washington, D.C. and married Lavinia on\n30\nOctober\n1889\n. In\n1890\n, when his daughter Euphemia was born, William and Lavinia Lofton were living at\n1543\nM Street, Northwest, Washington D.C. A little over two years later Euphemia's brother Joseph William Lofton\n(1893\n-\n1959)\nwas born. William and Lavinia, however, became involved in bitter arguments and were divorced in\n1897\n.\nAt the\n1900\ncensus Euphemia was nine years old. She was living with her younger brother Joseph William Lofton and their mother Lavinia in the home of Lavinia's sister Anna E Swann and Anna's husband Benjamin S Swann at\n1414\n17\nth Street, Northwest. Lavinia's mother, Agnes Dey, was also living in the same house as was Grace Ann Delaney, Lavinia's grandmother. As we noted above, by this time Lavinia and William S Lofton are divorced. Lavinia now worked as a music teacher and sang alto in the choir at St Augustine's Church, Fifteenth Street, between L and M streets northwest in Washington D.C. At the time of the\n1900\ncensus, William Lofton was living with his mother Martha Tuplet at\n1543\nM Street, Washington D.C. William S Lofton remarried, his second wife being Anna Laura Duncan. They had two daughters, Grace Willna Lofton and Anna Laura Lofton.\nEuphemia attended the M Street High School\n[\n4\n]\n:-\nHighly motivated and ambitious, Euphemia excelled in school from a young age.\nShe graduated from M Street High School in\n1907\n. This school was one of the first high schools for African Americans in the United States. Founded in\n1870\nas the Preparatory High School for Negro Youth, it moved to its permanent building on M Street in\n1901\n. We note that the first African American woman to complete the requirements for a doctorate\n(\nbut not in mathematics\n)\n, Eva Beatrice Dykes\n(1893\n-\n1986)\n, also attended M St High School. Euphemia then spent two years at the Washington Minor Normal School, graduating with distinction in\n1909\n. The Minor Normal School had been established in Washington in\n1851\nto educate African Americans. It had become a part of the District of Columbia Public School System in\n1879\n.\nThe\nWashington Post\n, dated\n19\nSeptember\n1909\n, states\n[\n6\n]\n:-\nAppoint Miss Euphemia Lofton teacher of second grade and assign to Garnet School.\nShe did not teach for long at this time, however, for she entered Smith College in\n1910\n, graduating with a BA in\n1914\nwith a major in mathematics having taken psychology as her minor subject. On\n17\nMay\n1917\nEuphemia married Harold Appo Haynes. Harold was born in Washington D.C. on\n7\nMay\n1889\nand had been a close friend of Euphemia from childhood, graduating from M Street High School in\n1906\n, one year before Euphemia. Harold graduated with a degree in electrical engineering from the University of Pennsylvania in\n1901\n. His World War I registration gives his address as\n1907\n11\nth Street, Northwest, Washington D.C. At the time of his marriage he was teaching at Howard University, a position he held from\n1912\nto\n1918\n. From\n1919\nhe taught Applied Electricity at Armstrong High School. Harold and Euphemia Haynes had no children.\nEuphemia's father William S Lofton died in\n1919\nwith Probate Date for his will\n3\nOctober\n1918\n. This will states\n[\n5\n]\n:-\nI give and devise unto my son, Joseph William Lofton, and unto my daughter, Martha Euphemia Haynes, in fee simple, as tenants in common, Lots Twenty Three\n(23)\nand Twenty Four\n(24)\n, in Square One Hundred and ninety six\n(196)\n, improved by premises No.\n1523\nM Street, Northwest, Washington, D.C., subject to the encumbrances thereon at the time of my death ...\nAt the time of the\n1920\nCensus, Euphemia and her husband were living at\n1414\n17\nth Street, Northwest. She is described as the head of the household and owner of the house, giving her occupation as a teacher. In addition to Euphemia and her husband, also living in the same house are Euphemia's brother Joseph William Lofton and her mother Lavinia Lofton. Both Euphemia and her husband Harold taught in the Washington school system, both playing a major role in promoting the education of African Americans\n[\n4\n]\n:-\nShe taught at all levels in the District of Columbia public school system, including elementary school, high school, and college.\nThe article\n[\n2\n]\nrecords that:-\nHaynes taught mathematics at Armstrong High School, served as an English teacher at Miner Normal School and taught mathematics as chair of the department at Dunbar High School, the premier D.C. African-American high school. ... From these positions, Haynes was vocal in her advocacy for poor students and better schools, denouncing the system's segregation-tinged policies.\nIn addition, she taught first grade at Garrison and Garfield Schools.\nIn\n1930\n, Euphemia Haynes received a master's degree in education from the University of Chicago, her husband Harold gaining a master's degree in education from the same university in the same year. She was appointed as a professor of mathematics at Miner Teachers College in\n1930\nfounding the Department of Mathematics at that College of which she became the head. Now the Miner Teachers College was a development of the Minor Normal School where she had studied in her youth. In\n1929\nan Act of Congress created the Miner Teachers College with a four year programme leading to a Bachelor's degree. The College buildings on Georgia Avenue were those which had housed the Normal School since\n1914\n. The College was in the\n1930\ns still an establishment for African American students but in\n1955\nit combined with Wilson's Teachers College for white students to become the District of Columbia Teachers College. Haynes remained head of the Mathematics Department until she retired in\n1959\n. Of course, by the time she retired the College had become the District of Columbia Teachers College.\nEuphemia Haynes undertook research for a Ph.D. at the Catholic University of America. This University, situated in Washington D.C. and affiliated to the Roman Catholic Church, opened for teaching in\n1889\n. Euphemia worked towards a mathematics doctorate with thesis advisor Aubrey Edward Landry. Landry, an expert in algebraic geometry, had studied for his bachelor's degree at Harvard University, being awarded the degree in\n1900\n, and then studied for a Ph.D. at Johns Hopkins University advised by\nFrank Morley\n, obtaining his doctorate in\n1907\n[\n1\n]\n:-\nLandry was both helpful to and supportive of his students and had a ready supply of problems in algebraic geometry. ... one of his doctoral students reported ... that \"it was very convenient for me to have a man who was a giant who was willing to take on the doctoral students and who was a very helpful, a very helpful, director of theses. You could hardy miss if you worked under Dr Landry.\" Typical of the dissertations he supervised were those consisting of detailed descriptions of the triangles simultaneously inscribed and circumscribed to some special class of real plane curves. These specialised problems were outside the mainstream of research in algebraic geometry, but they were well suited to Landry's students, to whom a Ph.D. usually represented a desired credential rather than the beginning of a research career.\nIn\n1943\nHaynes submitted her thesis\nThe Determination of Sets of Independent Conditions Characterizing Certain Special Cases of Symmetric Correspondences\nand, after she was examined by a committee including Otto Joseph Ramler\n(1887\n-\n1985)\nand Joseph Nelson Rice\n(1890\n-\n1988)\n, she was awarded a doctorate in\n1943\n. Otto Ramler, appointed to the Catholic University in\n1913\n, and Nelson Rice, appointed to the Catholic University in\n1918\n, had both been students at the Catholic University Mathematics Department and, after appointed to the faculty, worked there until they retired. With the award of her doctorate Euphemia Haynes became the first African American woman to be awarded a Ph.D. in mathematics. We note that her husband Harold Haynes was awarded a doctorate in education from New York University in\n1946\n.\nHarold retired in\n1958\nand Euphemia retired in\n1959\n, although she continued to lecture occasionally at Howard University. She was awarded the Papal Medal, the Pro Ecclesia et Pontifice, from the Catholic Church in the year she retired. After retiring, both Euphemia and Harold Haynes\n[\n4\n]\n:-\n... remained pillars of the middle-class African-American community in the District of Columbia. Both Harold and Euphemia played important roles in social and political organizations at both the national level and in the District of Columbia. Euphemia's lifelong Catholicism often motivated her activism. She helped found the Catholic Interracial Council of the District of Columbia and supported the Fides House, a neighbourhood hospitality house organized by The Catholic University of America sociology professors and students. Fides House provided services, assistance, and educational help to people in a poor District of Columbia neighbourhood. Euphemia remained active in professional educational organizations like the Catholic College Alumnae and Sigma Delta Epsilon as well. ... by the\n1950\ns, the Haynes' family moved solidly into the upper-middle class, owning a substantial number of rental properties throughout the District. Dr Euphemia Haynes is perhaps most well known as a member of the District of Columbia Board of Education from\n1960\nto\n1968\n. From June\n1966\nto July\n1967\n, she presided as the president of the Board of Education. While on the Board during the tumultuous\n1960\ns, Dr. Haynes vigorously advocated for poor students and better schools with high academic standards. She denounced the system's de facto segregation and worked to overturn the District's tracking system, which many felt unfairly locked African-American students into non-educational vocational programs. She also supported Julius Hobson's controversial and successful lawsuit charging the school system with racial and economic discrimination in\n1967\n. In\n1968\nthe District's Board of Education was transformed from a judge-appointed organization to a citizen-elected body. Dr. Haynes opted not to run for election in\n1968\nand retired from board service. Dr Harold Haynes died in\n1978\nat\n89\nyears old.\nEuphemia Haynes died of a heart attack, also at the age of\n89\n. She left $\n700\n,\n000\nfor the Education School at The Catholic University of America in her will to endow a professorship and a student loan fund. The University named the chair she funded as the Euphemia Haynes Chair in the Department of Education. The School of Education of the Catholic University of America published a Newsletter in January\n1981\nwhich contained the following:-\nThe School of Education recently received a gift of $\n700\n,\n000\nin the form of a bequest from Euphemia L Haynes, an alumna of the university and a prominent Washington educator, who died earlier this year. The gift was willed to the university in a trust fund Mrs Haynes established for the support of a professorial chair in the School of Education.\nAnother honour followed her death when in\n2004\nthe E L Haynes Public Charter School in Washington, DC was named for her.",
  "matematicos_citados_na_biografia": [
    "Frank Morley"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}