{
  "nome_completo": "Eutocius of Ascalon",
  "nome_curto": "Eutocius",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eutocius/",
  "data_nascimento": "about 480",
  "local_nascimento": "Ascalon, Palestine (now Ashqelon, Israel)",
  "data_morte": "about 540",
  "local_morte": null,
  "summary": "Eutocius was a Greek mathematician who wrote commentaries on works of Archimedes and Apollonius.",
  "biografia": "Eutocius of Ascalon\nwas for a long time thought to have been born in\n530\n. It is instructive to see how this came about for it shows how many pitfalls there are in the study of history. Eutocius wrote commentaries on three works of\nArchimedes\n. His commentary on Book II of\nOn the Sphere and Cylinder\nends with the statement:-\n... the edition was revised by\nIsidorus\nof Miletus, the mechanical engineer, our teacher.\nFrom this it was thought that Eutocius was a pupil of Isidorus and his dates were deduced from this information. However, further investigation showed that this contradicted other information such the dedications that Eutocius makes in some of his other works. It was then realised that the comment at the end of Eutocius's commentary to\nArchimedes\n'\nOn the Sphere and Cylinder\nwas inserted by a later editor of the work who was indeed a pupil of Isidorus of Miletus. It is thought that the first of Eutocius's commentaries on\nArchimedes\nwas written around\n510\n.\nAscalon, where Eutocius was born, had a long history and is mentioned in the Old Testament as Askelon. It received its Greek name after it was conquered by\nAlexander the Great\nin\n332\nBC and the city had fine public buildings built by Herod the Great. It seems likely that Eutocius left Ascalon and went to Alexandria to study.\nPaul Tannery\nhas argued convincingly\n(\nsee\n[\n5\n]\n)\nthat Eutocius was almost certainly a pupil of\nAmmonius\nin Alexandria and it appears that he went on to become head of the Alexandrian School after Ammonius. Ammonius himself was a pupil of\nProclus\nand Eutocius dedicates his commentary on Book I of\nArchimedes\n'\nOn the sphere and cylinder\nto him. Eutocius addresses Ammonius in the preface asking him to\n[\n1\n]\n:-\n... bear with him if he should have erred through youth. He explains that he found no satisfactory commentaries on\nArchimedes\nbefore his own time and promises further elucidation of the master if his work should meet with approval from Ammonius.\nCertainly this reads as if Eutocius is addressing his teacher and\nPaul Tannery\n's deduction seems secure. One has to assume that indeed Ammonius did approve, for Eutocius went on to write commentaries on other works by\nArchimedes\n, namely\nMeasurement of the circle\nand\nOn plane equilibria\n. However, Bulmer-Thomas in\n[\n1\n]\nis convinced that Eutocius did not know of certain other works by\nArchimedes\nsuch as\nQuadrature\nof a\nparabola\nand\nOn spirals\nfor he claims that he would have referred to them at certain natural places in his commentaries rather than give much less suitable references at these points.\nEutocius also edited and wrote commentaries on the first\n4\nbooks of the\nConics\nof\nApollonius\n.\nHeath\nwrites\n[\n2\n]\n:-\nEutocius's commentary on\nApollonius\n's \"Conics\" is extant for the first four Books, and it is probably owing to their having been commented on by Eutocius, as well as to their being more elementary than the rest, that these four Books alone survive in Greek.\nOne sees immediately that commentators such as Eutocius are very important in the history of mathematics and many important works have only survived due to the work of the commentators.\nEutocius does not appear to have done any original work. However, his commentaries contain much that is invaluable in the nature of historical information which might otherwise have been completely lost.\nHeath\nlists some of these important pieces of information\n[\n2\n]\n:-\nthe account of the solutions of the problem of the\nduplication of the cube\n, or the finding of two mean proportionals, by\nPlato\n,\nHeron\n,\nPhilon\n,\nApollonius\n,\nDiocles\n,\nPappus\n,\nSporus\n,\nMenaechmus\n,\nArchytas\n,\nEratosthenes\n,\nNicomedes\n;\nthe fragment discovered by Eutocius himself containing the missing solution, promised by\nArchimedes\nin On the Sphere and Cylinder Book\nII.\n4\n, of the auxiliary problem amounting to the solution by means of conics of the\ncubic equation\n(\na\n−\nx\n)\nx\n2\n=\nb\nc\n2\n(a - x) x^{2} = b c^{2}\n(\na\n−\nx\n)\nx\n2\n=\nb\nc\n2\n.\nthe solutions\n(\na\n)\nby\nDiocles\nof the original problem of\nII.\n4\nwithout bringing in the cubic,\n(\nb\n)\nby\nDionysodorus\nof the auxiliary cubic equation\n.\nAs to contributions to astronomy, Eutocius did write an introduction to Book I of the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nbut\nNeugebauer\nwrites\n[\n3\n]\n:-\nEutocius did not write a \"commentary\" of the ordinary type that follows a given text chapter by chapter. ... the main part concerns methods of\nsexagesimal\ncomputation: multiplication, division, square roots etc. Another chapter concerns\nisoperimetric problems\n, followed by a short section about the shape and size of the earth, based on\nPtolemy\n's norm of\n500\nstades for the equatorial degree. Obviously nothing of real astronomical interest has come down from Eutocius.",
  "matematicos_citados_na_biografia": [
    "Archimedes",
    "Isidorus",
    "Alexander the Great",
    "Paul Tannery",
    "Ammonius",
    "Proclus",
    "Quadrature",
    "parabola",
    "Conics",
    "Apollonius",
    "Heath",
    "duplication of the cube",
    "Plato",
    "Heron",
    "Philon",
    "Diocles",
    "Pappus",
    "Sporus",
    "Menaechmus",
    "Archytas",
    "Eratosthenes",
    "Nicomedes",
    "cubic equation",
    "Dionysodorus",
    "Neugebauer",
    "sexagesimal",
    "isoperimetric problems",
    "Ptolemy"
  ],
  "imagens": []
}