{
  "nome_completo": "Evangelista Torricelli",
  "nome_curto": "Evangelista Torricelli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Torricelli/",
  "data_nascimento": "15 October 1608",
  "local_nascimento": "Faenza, Romagna (now Italy)",
  "data_morte": "25 October 1647",
  "local_morte": "Florence, Tuscany (now Italy)",
  "summary": "Evangelista Torricelli was an Italian scientist who was the first man to create a sustained vacuum and to discover the principle of a barometer. He also achieved some important results in the development of the calculus.",
  "biografia": "Evangelista Torricelli\n's parents were Gaspare Torricelli and Caterina Angetti. It was a fairly poor family with Gaspare being a textile worker. Evangelista was the eldest of his parents three children, having two younger brothers at least one of whom went on to work with cloth. It is greatly to his parents' credit that they saw that their eldest son had remarkable talents and, lacking the resources to provide an education for him themselves, they sent him to his uncle who was a Camaldolese monk. Brother Jacopo saw that Evangelista was given a sound education until he was old enough to enter a Jesuit school.\nTorricelli entered a Jesuit College in\n1624\nand studied mathematics and philosophy there until\n1626\n. It is not entirely clear at which College he studied, with most historians believing that he attended the Jesuit College in Faenza, while some believe that he entered the Collegio Romano in Rome. What is undoubtedly the case is that after study at the Jesuit College he was then in Rome. Certain facts are clear, namely that Torricelli's father died in or before\n1626\nand that his mother moved to Rome for she was certainly living there in\n1641\nat the time of her death. Torricelli's two brothers also moved to Rome and again we know for certain that they were living there in\n1647\n. The most likely events seem to be that after Gaspare Torricelli died, Caterina and her two younger sons moved to Rome to be with Evangelista who was either already living there or about to move to that city.\nAt the Jesuit College Torricelli showed that he had outstanding talents and his uncle, Brother Jacopo, arranged for him to study with Benedetto Castelli. Castelli, who like Jacopo was a Camaldolese monk, taught at the University of Sapienza in Rome. Sapienza was the name of the building which the University of Rome occupied at this time and it gave its name to the University. There is no evidence that Torricelli was actually enrolled at the university, and it is almost certain that he was simply being taught by\nCastelli\nas a private arrangement. As well as being taught mathematics, mechanics, hydraulics, and astronomy by Castelli, Torricelli became his secretary and held this post from\n1626\nto\n1632\n. It was an arrangement which meant that he worked for\nCastelli\nin exchange for the tuition he received. Much later he took over\nCastelli\n's teaching when he was absent from Rome.\nThere does still exist a letter which Torricelli wrote to\nGalileo\non\n11\nSeptember\n1632\nand it gives us some very useful information about Torricelli's scientific progress.\nGalileo\nhad written to\nCastelli\nbut, since\nCastelli\nwas away from Rome at the time, his secretary Torricelli wrote to\nGalileo\nto explain this fact. Torricelli was an ambitious young man and he greatly admired\nGalileo\n, so he took the opportunity to inform\nGalileo\nof his own mathematical work. Torricelli began by telling\nGalileo\nthat he was a professional mathematician and that he had studied the classical texts of\nApollonius\n,\nArchimedes\nand\nTheodosius\n. He had also read almost everything that the contemporary mathematicians\nBrahe\n,\nKepler\nand Longomontanus had written and, he told\nGalileo\n, he was convinced by the theory of\nCopernicus\nthat the Earth revolved round the sun. Moreover, he had carefully studied\nDialogue Concerning the Two Chief Systems of the World - Ptolemaic and Copernican\nwhich\nGalileo\nhad published about six months before Torricelli wrote his letter.\nIt was clear from his letter that Torricelli was fascinated by astronomy and was a strong supporter of\nGalileo\n. However the Inquisition banned the sale of the\nDialogue\nand ordered\nGalileo\nto appear in Rome before them. After Galileo's trial in\n1633\n, Torricelli realised that he would be on dangerous ground were he to continue with his interests in the Copernican theory so he deliberately shifted his attention onto mathematical areas which seemed less controversial. During the next nine years he served as secretary to Giovanni Ciampoli, a friend of\nGalileo\n, and possibly a number of other professors. We do not know where Torricelli lived during this period but, as Ciampoli served as governor of a number of cities in Umbria and the Marches, it is likely that he lived for periods in Montalto, Norcia, San Severino and Fabriano.\nBy\n1641\nTorricelli had completed much of the work which he was to publish in three parts as\nOpera geometrica\nⓉ\n(\nWorks of geometry\n)\nin\n1644\n. We shall give more details of this work later in this biography, but for the moment we are interested in the second of the three parts\nDe motu gravium\nⓉ\n(\nMotion of weights\n)\n. This basically carried on developing\nGalileo\n's study of the parabolic motion of projectiles which had appeared in\nDiscourses and mathematical demonstrations concerning the two new sciences\npublished in\n1638\n. Torricelli was certainly in Rome in early\n1641\nwhen he asked\nCastelli\nfor his opinion on\nDe motu gravium\n.\nCastelli\nwas so impressed that he wrote to\nGalileo\nhimself, at this time living in his home in Arcetri near Florence, watched over by officers from the Inquisition. In April\n1641\nCastelli\ntravelled from Rome to Venice and, on the way, stopped in Arcetri to give\nGalileo\na copy of Torricelli's manuscript and suggest that he employed him as an assistant.\nTorricelli remained in Rome while\nCastelli\nwas on his travels and gave his lectures in his place. Although\nGalileo\nwas keen to have Torricelli's assistance there was a delay before this could happen. On the one hand\nCastelli\ndid not return to Rome for some time, while the death of Torricelli's mother further delayed his departure. On\n10\nOctober\n1641\nTorricelli arrived at\nGalileo\n's house in Arcetri. He lived there with\nGalileo\nand also with Viviani who was already assisting\nGalileo\n. He only had a few months with Galileo, however, before that famous scientist died in January\n1642\n. Delaying his return to Rome for a while after\nGalileo\ndied, Torricelli was appointed to succeed\nGalileo\nas the court mathematician to Grand Duke Ferdinando II of Tuscany. He did not receive the title of Court Philosopher to the Grand Duke which\nGalileo\nhad also held. He held this post until his death living in the ducal palace in Florence.\nIn looking at Torricelli's achievements we should first put his mathematical work into context. Another pupil of Castelli,\nBonaventura Cavalieri\n, held the chair of mathematics at Bologna.\nCavalieri\npresented his theory of indivisibles in\nGeometria indivisibilis continuorum nova\npublished in\n1635\n. The method was a development of\nArchimedes\n' method of exhaustion incorporating\nKepler\n's theory of\ninfinitesimally\nsmall geometric quantities. This theory allowed\nCavalieri\nto find, in a simple and rapid way, the area and volume of various geometric figures. Torricelli studied the methods being proposed by\nCavalieri\nand at first was suspicious of them. However, he soon became convinced that these powerful methods were correct and began to develop them further himself. In fact he used a combination of the new and old methods, using the method of indivisibles to discover his results, but often giving a classical geometrical proof of them. He gave this not because he doubted the correctness of the method of indivisibles, rather because he wanted to give a proof:-\n... according to the usual method of the ancient geometers ...\nso that readers not familiar with the new methods would still be convinced of the correctness of his results.\nBy\n1641\nhe had proved a number of impressive results using the methods which he would publish three years later. He examined the three dimensional figures obtained by rotating a regular polygon about an axis of symmetry. Torricelli also computed the area and centre of gravity of the cycloid. His most remarkable results, however, resulted from his extension of\nCavalieri\n's method of indivisibles to cover curved indivisibles. With these tools he was able to show that rotating the unlimited area of a rectangular hyperbola between the\ny\ny\ny\n-axis and a fixed point on the curve, resulted in a finite volume when rotated round the\ny\ny\ny\n-axis. Notice that we have stated this result in the modern notation of coordinate geometry which was totally unavailable to Torricelli. This last result, described in\n[\n1\n]\nas:-\n... a gem of the mathematical literature of the time ...\nis considered in detail in\n[\n23\n]\nwhere it is noted that, immediately after its publication in\n1644\n, the result aroused great interest and admiration because it went totally against the intuition of mathematicians of the period.\nWe mentioned Torricelli's results on the cycloid and these resulted in a dispute between him and\nRoberval\n. The article\n[\n19\n]\ndiscusses:-\n... a letter dated October\n1643\n, by which Torricelli gets in touch with\nRoberval\nand reports to him about his views and results on the centre of gravity of the parabola, the semigeneral parabolas, the surface of the cycloid and its history, the solid of revolution generated by a conic and the hyperbolic acute solid.\nWe should also note another fine contribution made by Torricelli was in solving a problem due to Fermat when he determined the point in the plane of a triangle so that the sum of its distances from the vertices is a minimum\n(\nknown as the\nisogonic centre\nof the triangle\n)\n. This contribution, described in detail in\n[\n20\n]\n, is summarised in that paper as follows:-\nAround\n1640\n, Torricelli devised a geometrical solution to a problem, allegedly first formulated in the early\n1600\ns by\nFermat\n: 'given three points in a plane, find a fourth point such that the sum of its distances to the three given points is as small as possible'.\nTorricelli was the first person to create a sustained vacuum and to discover the principle of a barometer. In\n1643\nhe proposed an experiment, later performed by his colleague\nVincenzo Viviani\n, that demonstrated that atmospheric pressure determines the height to which a fluid will rise in a tube inverted over the same liquid. This concept led to the development of the barometer. Torricelli wrote a letter to his friend\nMichelangelo Ricci\n, who like him had been a student of Castelli, on\n11\nJune\n1644\n. At this stage Torricelli was in Florence, writing to his friend\nRicci\nwho was in Rome.\nI have already called attention to certain philosophical experiments that are in progress ... relating to vacuum, designed not just to make a vacuum but to make an instrument which will exhibit changes in the atmosphere, which is sometimes heavier and denser and at other times lighter and thinner. Many have argued that a vacuum does not exist, others claim it exists only with difficulty in spite of the repugnance of nature; I know of no one who claims it easily exists without any resistance from nature.\nWhether a vacuum existed was a question which had been argued over for centuries.\nAristotle\nhad simply claimed that a vacuum was a logical contradiction, but difficulties with this had led Renaissance scientists to modify this to the claim that 'nature abhors a vacuum' which is in line with those who Torricelli suggests believe a vacuum exists despite 'the repugnance of nature'.\nGalileo\nhad observed the experimental evidence that a suction pump could only raise water by about nine metres but had given an incorrect explanation based on the \"force created by a vacuum\". Torricelli then described an experiment and gives for the first time the correct explanation:-\nWe have made many glass vessels ... with tubes two cubits long. These were filled with mercury, the open end was closed with the finger, and the tubes were then inverted in a vessel where there was mercury. .. We saw that an empty space was formed and that nothing happened in the vessel where this space was formed ... I claim that the force which keeps the mercury from falling is external and that the force comes from outside the tube. On the surface of the mercury which is in the bowl rests the weight of a column of fifty miles of air. Is it a surprise that into the vessel, in which the mercury has no inclination and no repugnance, not even the slightest, to being there, it should enter and should rise in a column high enough to make equilibrium with the weight of the external air which forces it up?\nHe attempted to examine the vacuum which he was able to create and test whether sound travelled in a vacuum. He also tried to see if insects could live in the vacuum. However he seems not to have succeeded with these experiments.\nIn\nDe motu gravium\nⓉ\n(\nMotion of weights\n)\nwhich was published as part of Torricelli's\n1644\nOpera geometrica\nⓉ\n(\nWorks of geometry\n)\n, Torricelli also proved that the flow of liquid through an opening is proportional to the square root of the height of the liquid, a result now known as Torricelli's theorem. It was another remarkable contribution which has led to some suggesting that this result makes him the founder of hydrodynamics. Also in\nDe motu gravium\nTorricelli studied projectile motion. He developed\nGalileo\n's ideas on the parabolic trajectory of projectiles launched horizontally, giving a theory for projectiles launched at any angle. He also gave numerical tables which would help gunners find the correct elevation of their guns to give the required range. Three years later he received a letter from Renieri of Genoa who claimed that he had conducted some experiments which contradicted the theory of parabolic trajectories. The two corresponded on the topic with Torricelli saying that his theory was in fact based on ignoring certain effects which would make the experimental data slightly different.\nTorricelli not only had great skills in theoretical work but he also had great skill as a maker of instruments. He was a skilled lens grinder, making excellent telescopes and small, short focus, simple microscopes, and he seems to have learnt these techniques during the time he lived with\nGalileo\n. Gliozzi writes in\n[\n1\n]\n:-\n... one of Torricelli's telescope lenses ... was examined in\n1924\n... using a diffraction grating. It was found to be of exquisite workmanship, sos much so that one face was seen to have been machined better than the mirror taken a reference surface ...\nIn fact he made much money from his skill in lens grinding in the last period of his life in Florence and the Grand Duke gave him many gifts in return for scientific instruments.\nMuch of Torricelli's mathematical and scientific work has not survived, mainly because he published only the one work we referred to above. In addition to letters which have survived which tell us important facts about his achievements, we also have some lectures which he gave. These were collected and published after his death and include one he gave when he was elected to the Accademia della Crusca in\n1642\nand seven others given to the Academy during the next few years. One of these was on the wind and it is important for again Torricelli was the first to give the correct scientific explanation when he proposed that\n[\n1\n]\n:-\n... winds are produced by differences of air temperature, and hence density, between two regions of the earth.\nWe referred above to the argument between Torricelli and\nRoberval\nconcerning the cycloid, and in\n1646\nTorricelli began gathering together the correspondence which had passed between the two on the topic. It is clear that Torricelli was an honest man who felt that he needed to publish the material to present the truth to the world. There can be no doubt that these two great mathematicians had made similar discoveries about the cycloid but neither had been influenced by the other's ideas. However, before he completed the task of preparing the correspondence for publication Torricelli contracted typhoid in October\n1647\ndied a few days later at the young age of\n39\nwhile in his prime as a research mathematician and scientist.\nHours before his death he tried to ensure that his unpublished manuscripts and letters be given to someone to prepare for publication and he entrusted them to his friend Ludovico Serenai. After neither\nCastelli\nnor\nMichelangelo Ricci\nwould undertake the task and although\nViviani\ndid agree to prepare the material for publication he failed to accomplish the task. Some of Torricelli's manuscripts were lost and it was not until\n1919\nthat the remaining material was published as Torricelli had wished. His collected works were published with\nGino Loria\nand Guiseppe Vassura as editors, three volumes being published in\n1919\nand the fourth volume in\n1944\nnearly\n300\nyears after Torricelli's death. Sadly material left by him, bearing his own signature, was destroyed in the Torricelli Museum in Faenza in\n1944\n.\nTorricelli's remarkable contributions mean that had he lived he would certainly have made other outstanding mathematical discoveries. Collections of paradoxes which arose through inappropriate use of the new calculus were found in his manuscripts and show the depth of his understanding. In fact he may indeed have made contributions which will never be known, for the full range of his ideas were never properly recorded.",
  "matematicos_citados_na_biografia": [
    "Castelli",
    "Galileo",
    "Apollonius",
    "Archimedes",
    "Theodosius",
    "Brahe",
    "Kepler",
    "Copernicus",
    "Bonaventura Cavalieri",
    "Cavalieri",
    "infinitesimally",
    "Roberval",
    "Fermat",
    "Vincenzo Viviani",
    "Michelangelo Ricci",
    "Ricci",
    "Aristotle",
    "Viviani",
    "Gino Loria"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}