{
  "nome_completo": "Évariste Galois",
  "nome_curto": "Évariste Galois",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Galois/",
  "data_nascimento": "25 October 1811",
  "local_nascimento": "Bourg La Reine (near Paris), France",
  "data_morte": "31 May 1832",
  "local_morte": "Paris, France",
  "summary": "Évariste Galois was a French mathematician who produced a method of determining when a general equation could be solved by radicals and is famous for his development of early group theory. He died very young after fighting a duel.",
  "biografia": "Évariste Galois\n' father Nicholas Gabriel Galois and his mother Adelaide Marie Demante were both intelligent and well educated in philosophy, classical literature and religion. However there is no sign of any mathematical ability in any of Galois' family. His mother served as Galois' sole teacher until he was\n12\nyears old. She taught him Greek, Latin and religion where she imparted her own scepticism to her son. Galois' father was an important man in the community and in\n1815\nhe was elected mayor of Bourg-la-Reine.\nYou can see a map of Paris in the\n19\nth\nCentury, showing Bourg-la-Reine at\nTHIS LINK\n.\nThe starting point of the historical events which were to play a major role in Galois' life is surely the storming of the Bastille on\n14\nJuly\n1789\n. From this point the monarchy of Louis\n16\nth\nwas in major difficulties as the majority of Frenchmen composed their differences and united behind an attempt to destroy the privileged establishment of the church and the state.\nDespite attempts at compromise Louis\n16\nth\nwas tried after attempting to flee the country. Following the execution of the King on\n21\nJanuary\n1793\nthere followed a reign of terror with many political trials. By the end of\n1793\nthere were\n4595\npolitical prisoners held in Paris. However France began to have better times as their armies, under the command of Napoleon Bonaparte, won victory after victory.\nNapoleon became first Consul in\n1800\nand then Emperor in\n1804\n. The French armies continued a conquest of Europe while Napoleon's power became more and more secure. In\n1811\nNapoleon was at the height of his power. By\n1815\nNapoleon's rule was over. The failed Russian campaign of\n1812\nwas followed by defeats, the Allies entering Paris on\n31\nMarch\n1814\n. Napoleon abdicated on\n6\nApril and Louis XVIII was installed as King by the Allies. The year\n1815\nsaw the famous one hundred days. Napoleon entered Paris on March\n20\n, was defeated at Waterloo on\n18\nJune and abdicated for the second time on\n22\nJune. Louis XVIII was reinstated as King but died in September\n1824\n, Charles X becoming the new King.\nGalois was by this time at school. He had enrolled at the Lycée of Louis-le-Grand as a boarder in the\n4\nth class on\n6\nOctober\n1823\n. Even during his first term there was a minor rebellion and\n40\npupils were expelled from the school. Galois was not involved and during\n1824\n-\n25\nhis school record is good and he received several prizes. However in\n1826\nGalois was asked to repeat the year because his work in\nrhetoric\nwas not up to the required standard.\nFebruary\n1827\nwas a turning point in Galois' life. He enrolled in his first mathematics class, the class of Hypolyte Vernier\n(1800\n-\n1875)\n. He quickly became absorbed in mathematics and his director of studies wrote\nIt is the passion for mathematics which dominates him, I think it would be best for him if his parents would allow him to study nothing but this, he is wasting his time here and does nothing but torment his teachers and overwhelm himself with punishments.\nGalois' school reports began to describe him as\nsingular, bizarre\n,\noriginal\nand\nclosed\n. It is interesting that perhaps the most original mathematician who ever lived should be criticised for being\noriginal\n. Vernier reported however\nIntelligence, marked progress but not enough method.\nIn\n1828\nGalois took the examination of the École Polytechnique but failed. It was the leading University of Paris and Galois must have wished to enter it for academic reasons. However, he also wished to enter this school because of the strong political movements that existed among its students, since Galois followed his parents example in being an ardent republican.\nBack at Louis-le-Grand, Galois enrolled in the mathematics class of\nLouis Richard\n. However he worked more and more on his own researches and less and less on his schoolwork. He studied\nLegendre\n's\nGéométrie\nand the treatises of\nLagrange\n. As Richard was to report\nThis student works only in the highest realms of mathematics.\nIn April\n1829\nGalois had his first mathematics paper published on\ncontinued fractions\nin the\nAnnales de mathématiques\n. On\n25\nMay and\n1\nJune he submitted articles on the algebraic solution of equations to the\nAcadémie des Sciences\n.\nCauchy\nwas appointed as referee of Galois' paper.\nTragedy was to strike Galois for on\n2\nJuly\n1829\nhis father committed suicide. The priest of Bourg-la-Reine forged Mayor Galois' name on malicious forged epigrams directed at Galois' own relatives. Galois' father was a good natured man and the scandal that ensued was more than he could stand. He hanged himself in his Paris apartment only a few steps from Louis-le-Grand where his son was studying. Galois was deeply affected by his father's death and it greatly influenced the direction his life was to take.\nA few weeks after his father's death, Galois presented himself for examination for entry to the École Polytechnique for the second time. For the second time he failed, perhaps partly because he took it under the worst possible circumstances so soon after his father's death, partly because he was never good at communicating his deep mathematical ideas. Galois therefore resigned himself to enter the École Normale, which was an annex to Louis-le-Grand, and to do so he had to take his Baccalaureate examinations, something he could have avoided by entering the École Polytechnique.\nHe passed, receiving his degree on\n29\nDecember\n1829\n. His examiner in mathematics reported:-\nThis pupil is sometimes obscure in expressing his ideas, but he is intelligent and shows a remarkable spirit of research.\nHis literature examiner reported:-\nThis is the only student who has answered me poorly, he knows absolutely nothing. I was told that this student has an extraordinary capacity for mathematics. This astonishes me greatly, for, after his examination, I believed him to have but little intelligence.\nGalois sent\nCauchy\nfurther work on the theory of equations, but then learned from\nBulletin de Férussac\nof a posthumous article by\nAbel\nwhich overlapped with a part of his work. Galois then took\nCauchy\n's advice and submitted a new article\nOn the condition that an equation be\nsoluble by radicals\nin February\n1830\n. The paper was sent to\nFourier\n, the secretary of the\nParis Academy\n, to be considered for the Grand Prize in mathematics.\nFourier\ndied in April\n1830\nand Galois' paper was never subsequently found and so never considered for the prize.\nGalois, after reading\nAbel\nand\nJacobi\n's work, worked on the theory of\nelliptic functions\nand\nabelian integrals\n. With support from Jacques\nSturm\n, he published three papers in\nBulletin de Férussac\nin April\n1830\n. However, he learnt in June that the prize of the\nAcademy\nwould be awarded the Prize jointly to\nAbel\n(\nposthumously\n)\nand to\nJacobi\n, his own work never having been considered.\nJuly\n1830\nsaw a revolution. Charles\n10\nth\nfled France. There was rioting in the streets of Paris and the director of École Normale, M. Guigniault, locked the students in to avoid them taking part. Galois tried to scale the wall to join the rioting but failed. In December\n1830\nM. Guigniault wrote newspaper articles attacking the students and Galois wrote a reply in the\nGazette des Écoles\n, attacking M. Guigniault for his actions in locking the students into the school. For this letter Galois was expelled and he joined the Artillery of the National Guard, a Republican branch of the militia. On\n31\nDecember\n1830\nthe Artillery of the National Guard was abolished by Royal Decree since the new King Louis-Phillipe felt it was a threat to the throne.\nTwo minor publications, an abstract in\nAnnales de\nGergonne\n(\nDecember\n1830)\nand a letter on the teaching of science in the\nGazette des Écoles\n(\n2\nJanuary\n1831)\nwere the last publications during his life. In January\n1831\nGalois attempted to return to mathematics. He organised some mathematics classes in higher algebra which attracted\n40\nstudents to the first meeting but after that the numbers quickly fell off. Galois was invited by\nPoisson\nto submit a third version of his memoir on equation to the Academy and he did so on\n17\nJanuary.\nOn\n18\nApril\nSophie Germain\nwrote a letter to her friend the mathematician\nLibri\nwhich describes Galois' situation.\n.. the death of M.\nFourier\n, have been too much for this student Galois who, in spite of his impertinence, showed signs of a clever disposition. All this has done so much that he has been expelled form École Normale. He is without money... . They say he will go completely mad. I fear this is true.\nLate in\n1830\n19\nofficers from the Artillery of the National Guard were arrested and charged with conspiracy to overthrow the government. They were acquitted and on\n9\nMay\n1831\n200\nrepublicans gathered for a dinner to celebrate the acquittal. During the dinner Galois raised his glass and with an open dagger in his hand appeared to make threats against the King, Louis-Phillipe. After the dinner Galois was arrested and held in Sainte-Pélagie prison. At his trial on\n15\nJune his defence lawyer claimed that Galois had said\nTo Louis-Phillipe, if he betrays\nbut the last words had been drowned by the noise. Galois, rather surprisingly since he essentially repeated the threat from the dock, was acquitted.\nThe\n14\nth\nof July was Bastille Day and Galois was arrested again. He was wearing the uniform of the Artillery of the National Guard, which was illegal. He was also carrying a loaded rifle, several pistols and a dagger. Galois was sent back to Sainte-Pélagie prison. While in prison he received a rejection of his memoir.\nPoisson\nhad reported that:-\nHis argument is neither sufficiently clear nor sufficiently developed to allow us to judge its rigour.\nHe did, however, encourage Galois to publish a more complete account of his work. While in Sainte-Pélagie prison Galois attempted to commit suicide by stabbing himself with a dagger but the other prisoners prevented him. While drunk in prison he poured out his soul\nDo you know what I lack my friend? I confide it only to you: it is someone whom I can love and love only in spirit. I have lost my father and no one has ever replaced him, do you hear me...?\nIn March\n1832\na cholera epidemic swept Paris and prisoners, including Galois, were transferred to the pension Sieur Faultrier. There he apparently fell in love with Stephanie-Felice du Motel, the daughter of the resident physician. After he was released on\n29\nApril Galois exchanged letters with Stephanie, and it is clear that she tried to distance herself from the affair.\nThe name Stephanie appears several times as a marginal note in one of Galois' manuscripts. See\nTHIS LINK\n.\nGalois fought a duel with Perscheux d'Herbinville on\n30\nMay, the reason for the duel not being clear but certainly linked with Stephanie.\nA marginal note in the margin of the manuscript that Galois wrote the night before the duel reads\nThere is something to complete in this demonstration. I do not have the time.\n(\nAuthor's note\n)\n.\nYou can see this note  at\nTHIS LINK\n.\nIt is this which has led to the legend that he spent his last night writing out all he knew about\ngroup theory\n. This story appears to have been exaggerated.\nGalois was wounded in the duel and was abandoned by d'Herbinville and his own seconds and found by a peasant. He died in Cochin hospital on\n31\nMay and his funeral was held on\n2\nJune. It was the focus for a Republican rally and riots followed which lasted for several days.\nGalois' brother and his friend Chevalier copied his mathematical papers and sent them to\nGauss\n,\nJacobi\nand others. It had been Galois' wish that\nJacobi\nand\nGauss\nshould give their opinions on his work. No record exists of any comment these men made. However the papers reached\nLiouville\nwho, in September\n1843\n, announced to the\nAcademy\nthat he had found in Galois' papers a concise solution\n...as correct as it is deep of this lovely problem: Given an irreducible equation of\nprime\ndegree, decide whether or not it is soluble by radicals.\nLiouville\npublished these papers of Galois in his Journal in\n1846\n.\nThe theory that Galois outlined in these papers is now called\nGalois theory\n.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "rhetoric",
    "Louis Richard",
    "Legendre",
    "Lagrange",
    "continued fractions",
    "Académie des Sciences",
    "Cauchy",
    "Abel",
    "soluble by radicals",
    "Fourier",
    "Paris Academy",
    "Jacobi",
    "elliptic functions",
    "abelian integrals",
    "Sturm",
    "Academy",
    "Gergonne",
    "Poisson",
    "Sophie Germain",
    "Libri",
    "group theory",
    "Gauss",
    "Liouville",
    "prime",
    "Galois theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}