{
  "nome_completo": "Eugene Borisovich Dynkin",
  "nome_curto": "Evgenii B Dynkin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dynkin/",
  "data_nascimento": "11 May 1924",
  "local_nascimento": "Leningrad, USSR (now St Petersburg, Russia)",
  "data_morte": "14 November 2014",
  "local_morte": "Ithaca, New York, USA",
  "summary": "Eugene B Dynkin was a Russian-born American mathematician who worked in the fields of probability and algebra, especially semisimple Lie groups and algebras, and Markov processes. Dynkin diagrams are named after him.",
  "biografia": "Evgenii Dynkin\nwas born into a family of Jewish origins at a time when Russia was suffering extreme unrest and repression. He lived with his family in Leningrad until\n1935\nwhen they were exiled to Kasakhstan and his father was designated one of the 'people's enemies'. Although he was totally innocent, his father disappeared in the Gulag two years later and became one of the millions to perish under Stalin.\nThings looked particularly bleak for Dynkin at this stage. Being of Jewish origin and the son of a 'people's enemy' should have prevented Dynkin from succeeding in the system. Yet, as Dynkin recalls in\n[\n3\n]\n:-\nIt was almost a miracle that I was admitted\n(\nat the age of sixteen\n)\nto Moscow University. Every step in my professional career was difficult because the fate of my father, in combination with my Jewish origin, made me permanently undesirable for the party authorities at the university. Only special efforts by\nA N Kolmogorov\n, who put, more than once, his influence at stake, made it possible for me to progress through the graduate school to a teaching position at Moscow University.\nAdmitted to Moscow University in\n1940\n, he was saved from military service through poor eyesight and he was able to continue his studies throughout World War II, graduating with an M.S. from the Mechanics and Mathematics Faculty in\n1945\n.\nHis work at this time was partly in algebra and partly in\nprobability\n. He attended the seminars of\nGelfand\non\nLie groups\nand of\nKolmogorov\non\nMarkov\nchains. At this time he discovered the 'Dynkin diagram' approach to the classification of the semisimple\nLie algebras\n. This work came out of Dynkin trying to understand the papers by\nWeyl\nand by\nvan der Waerden\non semisimple Lie groups. Dynkin was not the only person to introduce graph of this type.\nCoxeter\nhad independently introduced them in his work on crystallographic\ngroups\n.\nAfter graduating, Dynkin remained at Moscow University where he became a research student of\nKolmogorov\n. For ten years he worked both on the theory of Lie algebras and on probability theory although his main work during this period was in algebra. In\n1945\nhe solved a problem on\nMarkov\nchains suggested by\nKolmogorov\nand his first publication in probability resulted.\nIn\n1948\nDynkin was awarded his Ph.D. and he became an assistant professor of\nKolmogorov\n's who held the Probability Chair. Dynkin became Doctor of Physics and Mathematics in\n1951\nand\nKolmogorov\npressed for Dynkin to be awarded a chair. However there was no way that the Communist Party leaders of Moscow University would allow a person of Dynkin's background to hold a chair at this time.\nIn\n1953\nStalin died and the situation in Russia eased. The following year, with\nKolmogorov\n's strong support, Dynkin was appointed to a chair at the University of Moscow and he held this chair until\n1968\n. From the time he was appointed to the chair, Dynkin's work became more and more devoted to probability theory. His work from this period is contained in two major books\nFoundations of the Theory of Markov Processes\n(1959)\nand\nMarkov Processes\n(1963)\nwhich have become classics of probability theory. This work on\nMarkov\nprocesses is described in\n[\n4\n]\nand is introduced as follows:-\nFollowing\nKolmogorov\n,\nFeller\n,\nDoob\n, and\nIto\n, Dynkin opened a new chapter in the theory of\nMarkov\nprocesses. He created the fundamental concept of a\nMarkov\nprocess as a family of measures corresponding to various initial times and states and he defined time homogeneous processes in terms of the shift operators ... .\nDynkin's work at Moscow University ended in\n1968\nas described in\n[\n2\n]\n:-\nIn\n1968\nDynkin's work at Moscow University was compulsorily interrupted and from\n1968\nto\n1976\nhe was a senior scientific worker at the Central Economics and Mathematics Institute at the\nUSSR Academy of Sciences\n. During his short spell of work there he organized a group of young workers together with whom he obtained important results in the theory of economic growth and economic equilibrium that culminated in the first Soviet report on this topic at the International Mathematics Congress in Vancouver\n(\nto which, incidentally, in the usual way, he was not allowed to go\n)\n.\nIn\n1976\nDynkin emigrated to the United States but, as explained in\n[\n4\n]\n, this was a brave move:-\nAt the end of\n1976\n, Dynkin left the USSR. The decision to leave was very hard: pupils, friends, and youth were left behind. To apply for emigration was a great risk, especially for an outstanding scientist: many such applicants have been denied exit visas, they have lost their jobs and lived for years as outcasts of Soviet society. Dynkin took the risk because life in the USSR had became more and more unbearable, and the Dynkins' only daughter had already left for Israel.\nIn\n1977\nDynkin was appointed to Cornell University in Ithaca, New York. His work there gained a new lease of life as described in\n[\n3\n]\n:-\nAround\n1980\nDynkin interpreted and vastly generalized an identity which had first come up in the context of quantum field theory. In his hands it became a remarkable relation between occupation times of a\nMarkov\nprocess and a related Gaussian random field. This identity has led to many deep studies, by Dynkin himself as well as a host of others ... In the last few years Dynkin has obtained exciting results in the theory of \"superprocesses\" ... a class of measure-valued\nMarkov\nprocesses\n[\nwhich\n]\ncan be used to give probabilistic solutions to certain nonlinear PDE's in a way which is analogous to the classical solution of the\nDirichlet\nproblem by means of\nBrownian motion\n.\nDynkin has been awarded many prizes for his outstanding contributions. He has been elected as a fellow of the Institute of Mathematical Statistics\n(1962)\nand the\nAmerican Academy of Arts and Sciences\n(1978)\n. In\n1985\nhe was elected a member of the\nNational Academy of Sciences\nof the United States. He has received honorary doctorates from the Pierre and Marie Curie University\n(\nParis\n6)\n(1997)\n, the University of Warwick\n(2003)\nand the Independent Moscow University\n(2003)\n. He recieved the Prize of the\nMoscow Mathematical Society\nin\n1951\nand the Leroy P Steele Prize for Total Mathematical Work from the\nAmerican Mathematical Society\nin\n1993\n. The Steele Prize was awarded:-\n... in recognition of Dynkin's foundational contributions to two areas of mathematics over a long period and his production of outstanding research students in both countries to whose mathematical life he contributed so richly.\nThe following is extracted from the citation for the award:-\nEugene B Dynkin has made major contributions to the theory of Lie algebras and to probability theory. Dynkin's most famous contribution to the theory of Lie algebras was his use of the \"\nCoxeter\n-Dynkin diagrams\" to describe and classify the\nCartan\nmatrices of semisimple Lie algebras. This work was done while Dynkin was still a student at Moscow University. ... Dynkin has laid much of the foundations of the general theory of\nMarkov\nprocesses as we know it today. ... He formulated and proved the strong Markov property\n(\nin\n1956)\n. Dynkin proved the measurability of certain hitting times .... He developed the semigroup theory of Markov processes and characterized Markov processes by the generator of their semigroup. He also showed the usefulness of what is now known as \"Dynkin's formula\". This formula, which expresses expectations of functionals of the\nMarkov\nprocess as an integral involving its generator, has become a standard and indispensable tool which is still used all the time. Dynkin further studied such topics as excessive functions, Martin boundary, additive functionals, entrance and exit laws, random time change, control theory, and mathematical economics. Around\n1980\nDynkin interpreted and vastly generalized an identity which had first come up in the context of quantum field theory. In his hands it became a remarkable relation between occupation times of a\nMarkov\nprocess and a related Gaussian random field. This identity has led to many deep studies, by Dynkin himself as well as a host of others, of the properties of local times of Markov processes as well as to the detailed study of multiple points or self-intersections of Brownian motion. In the last few years Dynkin has obtained exciting results in the theory of \"superprocesses\". This is a class of measure-valued\nMarkov\nprocesses, which in many cases can be constructed as a suitable scaled limit of branching processes. ... Even though Dynkin has dealt with quite concrete probability problems, one of his strengths is his ability to build general theories and an apparatus to answer broad questions ... In Moscow he has been extremely active in a special high school for gifted students in mathematics. ...\nFrom\n1989\nDynkin was A R Bullis Professor of Mathematics at Cornell University.",
  "matematicos_citados_na_biografia": [
    "A N Kolmogorov",
    "probability",
    "Gelfand",
    "Lie groups",
    "Kolmogorov",
    "Markov",
    "Lie algebras",
    "Weyl",
    "van der Waerden",
    "Coxeter",
    "groups",
    "Feller",
    "Doob",
    "Ito",
    "USSR Academy of Sciences",
    "Dirichlet",
    "Brownian motion",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Moscow Mathematical Society",
    "American Mathematical Society",
    "Cartan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}