{
  "nome_completo": "Fabio Conforto",
  "nome_curto": "Fabio Conforto",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Conforto/",
  "data_nascimento": "13 August 1909",
  "local_nascimento": "Trieste, Austro-Hungary (now Italy)",
  "data_morte": "24 February 1954",
  "local_morte": "Rome, Italy",
  "summary": "Fabio Conforto was an Italian mathematician who worked in algebraic geometry, projective geometry and analytic geometry.",
  "biografia": "Fabio Conforto\n's parents were Ruggero Conforto and Irene Vascotto, both natives of Trieste. Fabio was the second of his parents' children, born in Trieste which at that time was part of the Austro-Hungary Empire. However, this prosperous cosmopolitan city, despite being the major port for Austria, had a population with a large number of Italian speaking people. The situation there was difficult with very active groups trying to force that city to become part of Italy. There was an Italian irredentism movement which had been active from the end of the\n19\nth\ncentury in attempting to have Italian speaking areas brought in to become part of Italy. This movement was particularly active in Trieste making life there very dangerous. Ruggero and Irene Conforto decided to move to a part of Austria that was more peaceful and, when Fabio was only forty days old, the family moved to Vienna.\nRuggero and Irene Conforto were Italian speaking, but of course in Vienna they were now living in a German speaking city. The young Fabio heard Italian spoken at home but when he began attending elementary school everything was in German. The young child, therefore, learnt to read and write in German but soon overcame the difficulties of having two languages. Fabio spent the first ten years of his life in Vienna and, despite the years of World War I, it was a happy and profitable childhood. He remembered happy times by the Danube and with his mother and sister in the park. It was in the park that he watched in fascination at the men sitting round playing chess. He wanted to learn how to play the game and soon he was beating children much older than himself. Vienna, of course, is the city of music and this had a major impact on young Fabio. His sister had piano lessons and Fabio took the opportunity to watch during these lessons and quickly became proficient himself. Music became a real passion for the young boy and it would remain important to him throughout his life.\nAfter the war ended in November\n1918\n, Trieste was under the control of Italian troops although it was not yet officially part of Italy. The Conforto family returned to Trieste where Fabio completed his secondary education. The end of World War I saw the collapse of the Habsburg-ruled Austro-Hungarian Empire and arguments followed about which lands would be allocated to Italy. The Treaty of Rapallo, signed in November\n1920\n, saw Trieste officially become part of the Kingdom of Italy. Life, however, for the Conforto family was not easy after they returned from Vienna. They arrived full of hope and joy but were faced with huge bureaucratic problems. The city bristled with armed guards and finding a home in the city, still reeling from the aftereffects of the fighting of the war, was extremely difficult. They did find a place to live but it was damp and gloomy. Fabio faced problems at school too, since he could only read and write in German and now had to rapidly learn to read and write in Italian. After completing elementary school, he attended a\nGymnasium\n.\nThe Italian Fascist movement started around\n1921\nas a nationalist movement following on from the Italian irredentism movement we mentioned above. Led by Benito Mussolini, the Fascists came to power in\n1923\nOne of the first acts of the Fascist government was a reform of Italian education by Giovanni Gentile, Mussolini's Minister of Education. One of the consequences of the Gentile reform was the setting up of the Liceo Scientifico, a secondary school intended to give students the necessary skills to go on to a university education. Conforto completed his schooling at a Liceo Scientifico, undertaking the work of the final two years in a single year and taking the State Examination one year early. During his final years at school the Conforto family had lived in a house with balconies facing the bay. Conforto loved to watch ships approaching the harbour, the sparkle of the sun on the water fascinated him, but even more than the sun he enjoyed watching thunderstorms. During his years at high school he belonged to a group of friends, with whom he spent many carefree hours. During this time he composed, with the collaboration of some of these friends, an operetta and some songs; he also loved sports, for example he enjoyed springboard diving, taking long swims, making boat trips and going for long cycle runs through places that are now mostly in Yugoslavia. At this stage in his life, his passion for music seems to have dominated and he studied both piano and violin at the Conservatory.\nAfter an outstanding Baccalaureate performance, his parents rewarded him with a trip to New York. To help with the expense of the boat trip, Conforto worked for a number of hours a day serving the crew and passengers. It was a valuable trip which helped the young man gain many social skills. He made friends with some of the officers with whom he shared a table and, on the outward trip, gave one of them mathematics lessons. On the return trip there was a severe storm and the conductor of the ship's orchestra became ill. Conforto was able to take over his role and gave brilliant performances. When he returned to Italy, he entered the Milan Polytechnic where he spent two years. The practical work involved in the course did not appeal to him and\nOscar Chisini\n, one of his teachers, advised him to concentrate on pure mathematics topics.\nChisini\nwas able to give Conforto advice based on his own experiences for\nChisini\nhad studied engineering before finding that\nalgebraic geometry\nwas the right area for him.\nTaking\nChisini\n's advice, in the autumn of\n1928\nConforto entered the University of Rome where he attended lectures by\nVito Volterra\n,\nTullio Levi-Civita\n,\nGuido Castelnuovo\nand\nFederigo Enriques\n. He was particularly influenced by\nVolterra\nand Conforto's first papers reflect this:\nMetrica e fondamenti di calcolo differenziale assoluto in uno spazio funzionale continuo\nⓉ\n(\nMetrics and  fundamental absolute differential calculus in a space of continuous functionals\n)\nappeared in\n1930\nand, in the following year, the two papers\nParallelismo negli spazi funzionali continui\nⓉ\n(\nParallelism in spaces of continuous functionals\n)\nand\nFormalismo matematico in uno spazio funzionale continuo retto da un elemento lineare di seconda specie\nⓉ\n(\nMathematical formalism in a space of continuous functionals from a linear element of the second kind\n)\n. Conforto graduated with his laurea on\n3\nJuly\n1931\nand, having won a scholarship to enable him to study abroad, was able to go to Germany in the autumn of\n1931\nwhere he spent the academic year\n1931\n-\n32\nat the University of Göttingen. Of course having spent his childhood in Vienna, German was essentially his first language. His reaction to the rather different style of mathematics in Germany from that which he had studied in Italy is interesting.\nSee\nTHIS LINK\nfor Conforto Conforto's letters from Göttingen\nBack in Italy, Conforto had to undergo military training. He attended the cadet school in Lucca and, while there, made friends with Gilberto Bernardini\n(1906\n-\n1995)\nwho was a physics assistant at the University of Florence. After training, Conforto was attached to the\n13\nth\nArtillery Regiment in Rome. He was appointed as an assistant at the University of Rome, working for\nGuido Castelnuovo\nbut strongly influenced by\nFederigo Enriques\nand\nFrancesco Severi\n. Based on\nEnriques\n's lectures, he began writing the book\nLe superficie razionali\nⓉ\n(\nThe rational surface\n)\nwhich was published a few years later in\n1939\n.\nCastelnuovo\nretired from teaching in\n1935\nand at this time Conforto became\nEnrico Bompiani\n's assistant. He attended the Congress of the Italian Mathematical Union held in Bologna in April\n1937\nand gave the talk\nSulle righe razionali del quinto ordine\nⓉ\n(\nOn rational lines of the fifth order\n)\nin Section II\n(\nGeometry\n)\nwhich was published in the proceedings of the Congress. As well as a series of interesting papers on algebraic geometry, he also became interested in the history of the topic and published\nIl contributo italiano al progresso della geometria algebrica negli ultimi cento anni\nⓉ\n(\nThe Italian contribution to the progress of algebraic geometry in the last hundred years\n)\nin\n1939\n.\nOn\n15\nApril\n1936\n, Conforto married Antonietta Pellegrini. They moved into a new home in Rome and they lived there for sixteen years; their four children were born there, the first being a boy born in August\n1938\n. In addition to his duties as an assistant in algebraic geometry, Conforto also worked at\nMauro Picone\n's National Institute for the Applications of Calculus. At first he worked there without payment but, after a while, he received payment for his contributions which helped him support his family which would have been extremely difficult on just an assistant's pay without this additional support.\nGaetano Scorza\n, who had been appointed to a chair in Rome in\n1935\n, died in August\n1939\n. Conforto entered the competition to fill\nScorza\n's chair but war intervened at a crucial stage in Conforto's career. World War II began on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany. Italy kept out of the war for the first few months but they prepared for war calling up those who had undergone military training. Conforto was one of the first to be called for military service and he joined his regiment in Foligno, in central Italy. While he was in Foligno he received the news in November\n1939\nthat he had been ranked first by the appointing commission set up to fill the chair of analytical geometry and descriptive geometry in Rome. Conforto returned to Rome to take up his professorship but his stay there was short-lived. Italy joined the hostilities of World War II, declaring war on Britain and France on\n10\nJune\n1940\n, only days before France surrendered to the Germans. For the third time, Conforto was called up for military service and he was sent to the French front. He feared that his family might be vulnerable to bombing in Rome so his wife and children moved to a village near Viterbo. Italy occupied a small area of France and a demilitarised zone was set up to include Genoble and Nice. After some time, Conforto returned to Rome and brought his family back to their home there. He again worked at the university and at Picone's Institute which was undertaking military applications as part of the war effort. Along with Picone, he visited Germany in the spring of\n1943\n, and learnt that Rome had been bombed in May while on his travels. Shortly after his return to Rome, in July\n1943\n, Allied forces invaded Sicily and, days later, Mussolini was deposed. Conforto, worried by these events, volunteered in August for military service again to defend his country. This action would land him in trouble after the Allied victory.\nConforto joined the Italian army in Reggio Calabria. On\n3\nSeptember\n1943\nAllied forces crossed the Strait of Messina and quickly defeated the Italian forces in Reggio Calabria. Conforto was taken prisoner and paraded through the streets of Reggio Calabria along with other prisoners. On\n8\nSeptember, Italy surrendered to the Allies but German troops continued to fight to hold Italy. Conforto was released and sent to Lecce, an area under Allied control, where he worked at the Ministry of War and taught at the Military Academy. On\n4\nJune\n1944\nRome fell to the Allies and only after that was Conforto able to contact his family and discover that they had survived the war. In August\n1944\nhe was able to return to Rome and be reunited with his family. The years following the war were difficult ones both because of financial hardship and also because there was much misunderstanding and mistrust between those who had been close colleagues before the war.\nThe range of Conforto's mathematical publications is great with contributions to algebraic geometry, projective geometry, and analytic geometry. In addition, as we have seen above, he wrote articles on the history of mathematics, for example\n(\nwith Guido Zappa\n)\nLa geometria algebrica in Italia\n(\ndal\n1939\na tutto il\n1945)\nⓉ\n(\nAlgebraic geometry in Italy\n(\nfrom\n1939\nto around\n1945)\n)\n(1946)\nand\nLa geometria proiettiva: suo sviluppo storico e suo significato\nⓉ\n(\nProjective geometry: its historical development and its significance\n)\n(1949)\n.\nJean Dieudonné\n, reviewing a\n1979\nreprint of this article, writes that Conforto:-\n... recalls briefly the well-known history of projective geometry, from Poncelet to\nvon Staudt\n. He stresses the role of perspective as developed in art\n(\nespecially by the Italians\n)\nin the birth of\nDesargues\n' ideas in the\n17\nth\ncentury, and the analogous influence of the drawing techniques promoted by\nMonge\n(\n\"descriptive geometry\"\n)\non his students and especially on\nPoncelet\n. A special section is devoted to the Italian treatises on projective geometry, particularly those of\nEnriques\nand\nSeveri\n. In a closing section the author rightly insists on the influence of projective geometry on the concepts of modern mathematics, in introducing such general notions as transformation, correspondence, invariant, and duality, and in giving one of the first examples of a \"hypothetico-deductive system\", where fundamental notions are created, as it were, by the axioms of the theory.\nConforto also wrote on applied mathematical questions, for example\nSulle deformazioni elastiche di un diedro omogeneo e isotropo\nⓉ\n(\nOn the elastic deformation of a homogeneous and isotropic dihedron\n)\n(1942)\nand\n(\nwith C Minelli\n)\nTravi continue inflesse e sollecitate assialmente\nⓉ\n(\nContinuous beams in bending and moving axially\n)\n(1941)\nwhich contains:-\n... a compilation of formulas and tables of coefficients relevant to a generalisation of the\nClapeyron\nthree-moment equation to the case of a continuous beam with piecewise linear variation of bending stiffness, supported at a finite number of points and subject to a uniform transverse loading and to an axial thrust.\nIn addition to his research articles, Conforto also wrote many textbooks, for example\nMeccanica razionale\nⓉ\n(\nTheoretical mechanics\n)\n(1946)\n,\nLezioni di geometria descrittiva\nⓉ\n(\nLessons on descriptive geometry\n)\n(1946)\n,\n(\nwith G Vaccaro\n)\nAlgebra ad uso degli istituti magistrali superiori\nⓉ\n(\nAlgebra for the use of higher teacher training colleges\n)\n(1946)\n,\n(\nwith G Vaccaro\n)\nAlgebra ad uso dei Ginnasi Superiori\nⓉ\n(\nAlgebra for use by senior secondary schools\n)\n(1946)\n,\nLezioni di geometria descrittiva per il I o Biennio universitario\nⓉ\n(\nDescriptive geometry lessons for  two-year college students\n)\n(1946)\n,\nComplementi ed esercizi di geometria descrittiva per il I o Biennio universitario\nⓉ\n(\nComplements and descriptive geometry exercises for two year colleges\n)\n(1946)\n,\n(\nwith G Vaccaro\n)\nAritmetica razionale per gli Istituti Magistrali Superiori\nⓉ\n(\nRational Arithmetic for upper management institutes\n)\n(1947)\n,\nLezioni di geometria analitica per il I o Biennio universitario\nⓉ\n(\nAnalytical geometry lessons for wo-year colleges or university\n)\n(1947)\n,\nComplementi ed esercizi di geometria analitica per il I o Biennio universitario\nⓉ\n(\nComplements and descriptive geometry exercises for two year colleges\n)\n(1947)\n, and\n(\nwith E Tomassi\n)\nNozioni di geometria analitica, proiettiva, descrittiva ad uso degli allievi dell'Accademia Militare di Lecce\nⓉ\n(\nAnalytic geometry concepts, projective, descriptive for use by students of the Military Academy of  Lecce\n)\n(1947)\n.\nIn\n1947\nConforto was sent by the Ministry of Education to Bressanone, in the South Tyrol, as a commissioner to the German language schools. During this visit that he became ill and was forced to return to Rome. In\n1949\nhe taught a summer course at the University of L'Aquila in the central Abruzzo region. He travelled to Cambridge in the United States for the International Congress of Mathematicians in August\n1950\n. Before returning to Italy, he spent several months at Princeton University, where he worked closely with\nCarl Siegel\n. During the years\n1951\nand\n1952\nhe travelled extensively in Europe, visiting Switzerland, Austria, Holland and Germany. This was a successful time and he was elected to the Academy of Mainz. However, back in Italy be became seriously ill in February\n1953\n. Suffering from pleurisy he was confined to bed and suffered a long time in pain. He complained bitterly that he was unable to work and even when he was taken to a clinic he still had his books with him as he struggled to work until the end.\nFollowing his death there were a number of publications of works based on his lecture notes. For example\nAbelsche Funktionen und algebraische Geometrie\nⓉ\n(\nAbelian functions and algebraic geometry\n)\n(1956)\n, based on lecture notes for courses given between\n1940\nand\n1951\n, and\nIntroduzione alla topologia\nⓉ\n(\nIntrodution to topology\n)\n(1960)\nconsisted of the lectures he had given on topology at the University of Rome in the five years before his death.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Oscar Chisini",
    "Chisini",
    "algebraic geometry",
    "Vito Volterra",
    "Tullio Levi-Civita",
    "Guido Castelnuovo",
    "Federigo Enriques",
    "Volterra",
    "THIS LINK",
    "Francesco Severi",
    "Enriques",
    "Castelnuovo",
    "Enrico Bompiani",
    "Mauro Picone",
    "Gaetano Scorza",
    "Scorza",
    "Jean Dieudonné",
    "von Staudt",
    "Desargues",
    "Monge",
    "Poncelet",
    "Severi",
    "Clapeyron",
    "Carl Siegel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}