{
  "nome_completo": "Fan Rong K Chung Graham",
  "nome_curto": "Fan Chung",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chung/",
  "data_nascimento": "9 October 1949",
  "local_nascimento": "Kaohsiung, Taiwan",
  "data_morte": null,
  "local_morte": null,
  "summary": "Fan Chung is a Taiwanese-born American mathematician who works mainly in graph theory.",
  "biografia": "Fan Chung\n's father was an engineer. She attended high school in Kaohsiung, Taiwan and was encouraged to take up mathematics by her father who told her\n[\n2\n]\n:-\n... in math all you need is pencil and paper.\nShe entered the National Taiwan University to read for a B.S. in mathematics. In\n[\n1\n]\nshe described how she was encouraged to think in terms of a career in mathematics by interaction with her fellow students:-\nAs an undergraduate in Taiwan, I was surrounded by good friends and many women mathematicians. We enjoyed talking about mathematics and helping each other. A large part of education is learning from your peers, not just the professors. Seeing other women perform well is a great confidence builder, too!\nIt was during her years as an undergraduate in Taiwan that she was first attracted to combinatorics, the area in which she was soon to begin research\n[\n2\n]\n:-\n... many problems from combinatorics were easily explained, you could get into them quickly, but getting out was often very hard ... Later on I discovered that there were all sorts of connections to other branches of mathematics as well as to many applications.\nChung graduated with a B.S. in mathematics in\n1970\nand then went to the United States for her graduate studies. She entered the University of Pennsylvania but at first Herbert Wilf, Professor of Mathematics at the University of Pennsylvania, hardly noticed her. Wilf writes\n(\nsee\n[\n1\n]\n)\n:-\nI never paid any attention to the graduate students until they got past their qualifying exams. My policy then was to go after the best student and try to get him to go into combinatorics. The year she took the exam,\n1971\n, she had the highest score by far-there was a huge gap between her and the next best student. So I immediately sought her out - I had never spoken to her before - and asked her if she knew anything about combinatorics. She said she knew a little from her days at Taiwan National University but not too much. I pulled out one of my magnetic subjects,\nRamsey\ntheory, that is guaranteed to get graduate students hooked on combinatorics because it is very pretty stuff. I gave her a book and told her to read the chapter on\nRamsey\ntheory. We set up an appointment in a week to talk about it. When she came to the appointment, I asked her how she liked the chapter. She smiled and said it was fine. Then she flipped the book open to a key theorem and said, gently, \"I think I can do a little better with the proof.\" My eyes were bulging. I was very excited. I asked her to go to the blackboard and show me. What she wrote was incredible! In just one week, from a cold start, she had a major result in\nRamsey\ntheory. I told her she had just done two-thirds of a doctoral dissertation. \"Really?\" she said softly. In fact, the result did become a major part of her dissertation.\nChung was awarded an M.S. in\n1972\n, then continued her studies for a Ph.D. with Wilf as her supervisor. She had found her first original results in Ramsey theory and it led to the publication of her first paper\nOn the\nRamsey\nnumbers N\n(3\n,\n3\n, ...,\n3\n;\n2)\nwhich appeared in\nDiscrete Mathematics\nin\n1973\n. In this paper she proved that if\nf\n(\nk\n)\nf (k)\nf\n(\nk\n)\nis the\nRamsey\nnumber\nN\n(\n3\n,\n3\n,\n.\n.\n.\n,\n3\n;\n2\n)\nN(3, 3, ..., 3; 2)\nN\n(\n3\n,\n3\n,\n.\n.\n.\n,\n3\n;\n2\n)\nwhere there are\nk\nk\nk\n3\ns, then\nN\n(\n3\n,\n3\n,\n3\n,\n3\n;\n2\n)\n>\n50\nN(3, 3, 3, 3; 2) > 50\nN\n(\n3\n,\n3\n,\n3\n,\n3\n;\n2\n)\n>\n5\n0\nand\nf\n(\nk\n+\n1\n)\n≥\n3\nf\n(\nk\n)\n+\nf\n(\nk\n−\n2\n)\nf (k+1) ≥ 3f (k) + f (k-2)\nf\n(\nk\n+\n1\n)\n≥\n3\nf\n(\nk\n)\n+\nf\n(\nk\n−\n2\n)\n.\nAlso in\n1973\nChung attended the Capital Conference at George Washington University in Washington, D.C. There she presented a paper\nOn triangular and cyclic Ramsey numbers with k colors\nwhich was published in the Proceedings of the Conference in the following year.\nBy this time Chung was married and she had her first child in\n1974\nbefore submitting her doctoral thesis\n[\n2\n]\n:-\nThat is a wonderful time to have a child. You don't have to attend classes; you only have to write your thesis.\nIn\n1974\nChung graduated with a Ph.D. from the University of Pennsylvania and applied for a job as a member of Technical Staff working for the Mathematical Foundations of Computing Department at Bell Laboratories in Murray Hill, New Jersey. She was appointed and she began working under Henry Pollak who would be her superior at Bell Laboratories for many years. There were many other leading mathematicians working for Bell Laboratories at this time such as\nRon Graham\nand Sloane. She quickly began to collaborate with others at Bell Labs and produced a steady stream of mathematical papers\n[\n2\n]\n:-\nFinding the right problem is often the main part of the work in establishing the connection. Frequently a good problem from someone else will give you a push in the right direction and the next thing you know you have another good problem. You make mathematical friends and share the fun!\nIn\n1975\nshe published\nOptimal rearrangeable graphs\nin which she gave a method of finding the minimum number of edges a rearrangeable graph may have for any choice of nonempty subsets of its vertex set. A Kandel, reviewing this paper wrote:-\nThis contribution is quite relevant to applied problems, since many problems in switching networks can be viewed in graph-theoretic terms. For example, instead of minimizing the number of crosspoints to reduce the cost of the network, one can consider the problem of finding a graph with the minimal number of edges.\nAlso in\n1975\nChung published her first joint paper with\nRon Graham\nOn multicolor Ramsey numbers for complete bipartite graphs\nwhich appeared in the\nJournal of Combinatorial Theory\n.\nWhile working at Bell Laboratories, Chung became pregnant again\n[\n2\n]\n:-\nI told\n[\nHenry Pollak, my manager\n]\nthat I would work until the day I went to the hospital. Since I already had one at home, I thought what's the problem with one more? I didn't even take maternity leave; there was too much paperwork associated with that. So I just took four weeks vacation and wrote one paper in between.\nHer second child was born in\n1977\nbut Chung's marriage was not a successful one and it ended in divorce in\n1982\n. She would marry\nRon Graham\nin\n1983\nbut she continued to publish under her original name of Fan Chung.\nGraham\nhas said\n(\nsee\n[\n1\n]\n)\n:-\nMany mathematicians would hate to marry someone in the profession. They fear their relationship would be too competitive. In our case, not only are we both mathematicians, we both do work in the same areas. So we can understand and appreciate what the other is working on, and we can work on things together-and sometimes make good progress.\nIn\n1983\nthe Bell Telephone Company was split up. Bellcore\n(\nBell Communications Research\n)\n, and other companies, was set up and Henry Pollak became head of a research unit within the newly formed company at Morristown, New Jersey. He asked Chung to become Research Manager and help him develop the unit:-\nFor the next seven years, in addition to my research, I had to write reports, attend meetings, and read the research papers of mathematicians I supervised.\nShe was promoted to Division Manager of Mathematics, Informations Sciences and Operations Research at Bellcore in\n1986\n, a post she held for four years. In the autumn of\n1989\nChung became a visiting professor at Princeton. It marked the beginning of a new association with the academic world. In\n1990\nBellcore created the idea of a Fellow who would spend a sabbatical at a university. Chung was one of the first to receive such a Fellowship and she went to Harvard:-\nIt is not easy for some people to leave management, but it was not so hard for me. Usually with positions in management you obtain more influence and you certainly have more power to make decisions. But I do not want people to respect me because of that power. I'd rather win their admiration because of the mathematics I'm doing.\nThis year was to have a huge influence on Chung who decided to return to the academic world but she did not formally leave Bellcore until\n1994\n. In\n1991\n, however, she became a visiting professor at the Mathematics Department at Harvard University. In August of that year she presented a joint AMS-MAA lecture\nLaplacians of graphs and hypergraphs\nin Orono, ME. The lecture was produced on a videocassette by the\nAmerican Mathematical Society\nand it comes with the following description:-\n\"Can you hear the shape of a graph?\" may sound like a nonsensical twist on the famous drum problem, but in fact it captures an intriguing analogy between manifolds and graphs. In this clear and well-paced lecture, the noted graph theorist Fan Chung exploits this analogy to produce some interesting and useful results. She starts with a historical perspective on graphs, their uses in computer science, and their inherent mathematical interest. She discusses Laplacians of graphs and hypergraphs from both the homological and graph-theoretic viewpoints. The eigenvalues of the Laplacians can be related to various properties of hypergraphs and used to strengthen and imply previous graph-theoretic results. A variety of applications to extremal combinatorics and computational complexity are discussed, in addition to a number of open problems.\nShe gave an invited address to the International Congress of Mathematicians in Zürich in\n1994\n. The same year she resigned from Bellcore and spent a year at the Institute for Advanced Study at Princeton before accepting a professorship at the University of Pennsylvania which she took up in\n1995\n. After three years as Professor of Mathematics and Professor of Computer Science at Pennsylvania she was appointed Professor of Mathematics and Professor of Computer Science and Engineering at the University of California, San Diego. She also holds the Akamai Professorship in Internet Mathematics.\nWe have already given some details of Chung's first few publications. Her interests are wide and among her nearly\n200\npublications there are contributions to spectral graph theory, extremal graphs, graph labelling, graph decompositions, random graphs, graph algorithms, parallel structures and various applications of graph theory in Internet computing, communication networks, software reliability, and discrete geometry. In\n1997\nthe\nAmerican Mathematical Society\npublished a major book\nSpectral graph theory\nby Chung. In this book she writes:-\n... the underlying mathematics of spectral graph theory through all its connections to the pure and applied, the continuous and discrete, can be viewed as a single unified subject.\nSpectral graph theory studies how the spectrum of the Laplacian of a graph is related to its combinatorial properties. Chung studies this topic from the point of view of spectral geometry in this book drawing the analogy to the spectrum on Riemannian manifolds.\nOnly one year later, in\n1998\n, another important book appeared, this time jointly written by Chung and her husband\nGraham\n. This is\nErdős on graphs\nand in it many of the problems and conjectures in graph theory made by\nPaul Erdős\nare listed. It was based on an article Chung published on the same topic in the previous year in the\nJournal of Graph Theory\n. Undoubtedly\nR H Schelp\nis right when he wrote in his review of the book:-\nSurely many of the\nErdős\nproblems presented here will remain open for years to come, providing a challenge to future graph theorists. Thus this text will be an important reference volume for the graph theory researcher.\nChung and\nGraham\nwere not only associated with\nErdős\nthrough his mathematics, but they also were close personal friends with their home providing for him the only place he had as a base.\nIt is worth noting the tremendous contribution Chung has made, and continues to make, as a member of the editorial board of various journals. Since the mid\n1990\ns she has served on, and in most cases continues to serve on, the boards of\n17\njournals. She has also served on the Council of the\nAmerican Mathematical Society\n(1989\n-\n91)\nand on several of its committees. Similarly she has also served on the Council of the Society of Industrial and Applied Mathematics\n(1990\n-\n92)\nand on several of its committees.\nFinally we should note that Chung was honoured with the Allendoerfer Award by the\nMathematical Association of America\nin\n1990\nand by membership of the\nAmerican Academy of Arts and Science\nin\n1998\n.\nShe has made other substantial contributions to the mathematical community with her editorial work, serving on the editorial boards of\nMathematics Research Letters\n,\nRandom Structures and Algorithms\n,\nSIAM Journal on Discrete Mathematics\n, the\nJournal of Combinatorial Designs\n,\nSIAM Review\n, the\nJournal of Graph Theory\n,\nAnnals of Applied Mathematics\n, the\nJournal of Combinatorial Optimization\n,\nAnnals of Combinatorics\n, the\nTaiwanese Journal of Mathematics\n, the\nJournal of Computer and System Sciences\n, and\nMathematical Systems Theory\n. In addition she has served as Co-Editor-in-Chief of\nAdvances in Applied Mathematics\nand the\nElectronic Journal of Combinatorics\n, and as Editor-in-Chief of\nInternet Mathematics\nand the\nJournal of Graph Theory\n.\nTo give an idea of her recent work let us quote from the abstract for the talk\nRandom Graphs and Internet Graphs\nwhich she gave at the University of Manchester in June\n2005\n:-\nWe will discuss some recent developments on random graphs with given expected degree distributions. Such random graphs can be used to model various very large graphs arising in internet and telecommunications. In turn, these \"massive graphs\" shed insights and lead to new directions for random graph theory. For example, it can be shown that the sizes of connected components depend primarily on the average degree and the second-order average degree under certain mild conditions. Furthermore, the spectra of the adjacency matrices of some random power law graphs obey the power law while the spectra of the Laplacian follow the semi-circle law. We will mention a number of related results and problems that are suggested by various applications of massive graphs.",
  "matematicos_citados_na_biografia": [
    "Ramsey",
    "Ron Graham",
    "Graham",
    "American Mathematical Society",
    "Paul Erdős",
    "R H Schelp",
    "Erdős",
    "Mathematical Association of America",
    "American Academy of Arts and Science"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}