{
  "nome_completo": "Ferdinand Joachimsthal",
  "nome_curto": "Ferdinand Joachimsthal",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Joachimsthal/",
  "data_nascimento": "9 March 1818",
  "local_nascimento": "Goldberg, Prussian Silesia (now Złotoryja, Poland)",
  "data_morte": "5 April 1861",
  "local_morte": "Breslau, Germany (now Wrocław, Poland)",
  "summary": "Ferdinand Joachimsthal made substantial contributions to the theory of surfaces and applied the theory of determinants to geometry.",
  "biografia": "Ferdinand Joachimsthal\n's parents were David Joachimsthal and Friederike Zaller, the daughter of Bezallel Cohn from Glogau. The family was Jewish. David Joachimsthal, the son of Lazarus Joachimsthal from Glogau, was a merchant living in the town of Goldberg which was at that time part of the Kingdom of Prussia. Goldberg, meaning 'gold mountain' in German, had been a centre of gold and copper mining since the Middle Ages. The small town is about\n18\nkm southeast of the much larger city of Liegnitz. Ferdinand attended the\nGymnasium\nat Liegnitz\n(\nnow Legnica, Poland\n)\nwhere he was taught by\nEduard Kummer\n. Appointed to the Liegnitz Gymnasium in\n1832\n,\nKummer\ntaught Joachimsthal mathematics and physics. Under\nKummer\n's guidance, Joachimsthal began undertaking mathematical research while at the school in Liegnitz. In\n1836\nhe entered the University of Berlin where he was taught by\nLejeune Dirichlet\nand\nJakob Steiner\n.\nDirichlet\nhad been appointed to a chair in Berlin in\n1828\nbut he also had a heavy teaching load at the Military Academy.\nSteiner\nhad been appointed as an extraordinary professor of geometry two years before Joachimsthal began his studies and he had already made a name for himself as a leading expert on projective geometry. Joachimsthal remained at Berlin for three semesters before, taking the route that most students took at that time, he moved on to study at a second university.\nFrom\n1838\nhe studied at the University of Königsberg where his teachers included\nCarl Jacobi\nand\nWilhelm Bessel\n.\nJacobi\nhad made important contributions to geometry and at the time that Joachimsthal was studying in Königsberg,\nJacobi\nwas working on his theory of\ndeterminants\n.\nBessel\nwas an astronomer who was the first to measure to parallax of a star. He made his announcement of the distance to\n61\nCygni in the year that Joachimsthal began studying at Königsberg. After taking his first degree at Königsberg, Joachimsthal went to Halle to undertake research at the University. His thesis advisor at Halle was Otto Rosenberger\n(1800\n-\n1890)\n, and he obtained a doctorate from there in July\n1840\nfor his thesis\nDe lineis brevissimis in superficiebus rotatione ortis\nⓉ\n(\nOn the shortest line on the surface of rotation of the earth\n)\n. He passed the oral examination \"with distinction\". His thesis advisor Otto Rosenberger had been a student of\nBessel\nand was appointed to Halle as a professor in\n1831\non\nBessel\n's recommendation. At Halle, Rosenberger taught mathematics and astronomy but, although he continued to undertake research, he published nothing after\n1836\n. Now, almost certainly to improve his chances of getting an academic post, Joachimsthal converted from Judaism to the Protestant Christian faith after the award of his doctorate.\nAt this time it was necessary for school teachers to take the 'Examen pro facultate docendi' to qualify to teach in a Gymnasium. This examination tested the candidate on philosophy, history and mathematics. It also required that a practical teaching test be taken. Joachimsthal passed the 'Examen pro facultate docendi' and, from\n1844\n, taught in Berlin at the Konigliche Realschule. From\n1847\nhe taught at the Collège Royal Français in Berlin where he was appointed a professor in\n1852\n. This school had been founded by the Huguenots in\n1689\n, four years after Louis XIV revoked the Edict of Nantes and declared Protestantism to be illegal in France. Joachimsthal also\nhabilitated\nat the University of Berlin on\n13\nAugust\n1845\n, becoming the first Jew to habilitate there. He was examined by\nMartin Ohm\nand the astronomer\nJohann Franz Encke\n. He gave his sample lecture\nÜber die Untersuchungen der neueren Geometrie, welche sich der Lehre von den Brennpunkten anschliessen\nⓉ\n(\nOn the investigations of modern geometry, which connect to the theory of the focal points\n)\nto the whole of the department in Berlin on\n7\nAugust\n1845\nand also gave a public lecture\nDe curvis algebraicis\nⓉ\n(\nOn algebraic curves\n)\non the\n13\nAugust following which the 'Venia legendi'\n(\nthe permission to teach\n)\nwas conferred on him.\nAt the University of Berlin Joachimsthal taught courses on analytic geometry and calculus, giving more advanced courses on the theory of surfaces, the\ncalculus of variations\n, statics and analytic mechanics. He is famed for the high quality of his lectures and he also introduced novel methods of teaching by organising examples classes. Although teaching in examples classes was new to Berlin, Joachimsthal had realised the benefits of this style of teaching while he was a member of\nJacobi\n's seminar in Königsberg. At Berlin, his colleagues included many famous mathematicians who all contributed to his development of mathematical ideas, in particular\nGotthold Eisenstein\n,\nLejeune Dirichlet\n,\nCarl Jacobi\n,\nJakob Steiner\nand\nCarl Borchardt\n. Joachimsthal's abilities as a lecturer are illustrated in\n[\n1\n]\n:-\nHis lectures attracted more students than did those of\nEisenstein\n, his brilliant colleague in the same field.\nWhile teaching as a\ndocent\nat the University of Berlin, Joachimsthal also continued teaching at the Konigliche Realschule and he published the\n21\n-page article\nÜber die Bedingung der Integrabilität\nⓉ\n(\nOn the condition of integrability\n)\nin the\nJahresbericht\nof the Konigliche Realschule of Berlin in\n1844\n. In\n1846\nhe published the important memoir\nÜber die Bedingung der Integrabilität\nⓉ\n(\nOn the condition of integrability\n)\nin Volume\n33\nof\nCrelle\n's Journal. This work, which studied the integrability of differential equations with more than two variables, gave a complete answer to a question that had been considered by\nLagrange\n. He appended a note to the article, dated April\n1846\n, saying that\nJoseph Raabe\nhad published a similar result in an article in Volume\n31\nof\nCrelle\n's Journal dated September\n1844\nbut Joachimsthal had announced his result in the\nJahresbericht\nof the Konigliche Realschule in April\n1844\nand so claimed priority. After\n1847\nhe left the Konigliche Realschule taking up an appointment at the Collège Royal Français and, based on the courses he was giving there, he published the textbook\nCours de géométrie élémentaire à l'usage des élèves du Collège Royal Français\nⓉ\n(\nElementary geometry course for the use of students of the Royal French College\n)\nin\n1852\n. This book\n[\n1\n]\n:-\n... demonstrated his talent as a textbook writer through its clear logical structure and insight\n(\nrarely found in accomplished mathematicians\n)\ninto the difficulties facing beginners ...\nDespite his outstanding contributions, Joachimsthal did not climb the academic ladder in the way that one would have expected and, despite frequent pleas from his colleagues who gave him the highest recommendations, he remained a docent at the University of Berlin. It is hard to attribute this to anything other than the general level of anti-Semitism that pervaded the university system at this time. His attempts to improve his position included submitting a second habilitation in\n1850\n, this time to the University of Breslau with the thesis\nDe duabus aequationibus quarti et sexti gradus in theoria linearum et superficierum secundi ordinis occurrunt\nⓉ\n(\nOn the two equations of the fourth and sixth degree of the lines which occur in the theory of surfaces of the second order\n)\n. However, he was appointed by the Prussian Ministry of Culture to a chair in Halle on\n7\nMay\n1853\n. The chair had become vacant due to the death of Ludwig Adolph Sohncke\n(1807\n-\n1853)\n. Joachimsthal did not hold the chair in Halle for long since he was offered the chair of mathematics at Breslau\n(\nnow Wrocław in Poland\n)\nin\n1855\n. This came about since\nKummer\n, who had held the chair at Breslau since\n1842\n, was offered a chair in Berlin.\nKummer\nrealised that\nKarl Weierstrass\nwould be a strong contender to fill the Breslau chair but he wanted\nWeierstrass\nas a colleague in Berlin\n(\nalthough a position was not available straight away\n)\n.\nKummer\n, therefore, strongly recommended Joachimsthal, whom he regarded extremely highly, to fill the chair in Breslau. The scheme worked, with Joachimsthal ranked first and\nWeierstrass\nthird, so Joachimsthal became\nKummer\n's successor at Breslau in\n1855\n. Here, as he had earlier, he acquired a high reputation for teaching, in fact even higher than the brilliant lecturer\nKummer\nwhom he replaced. At Breslau\n[\n1\n]\n:-\n...\n[\nJoachimsthal\n]\ntaught, among other things, analytic geometry, differential geometry, and the theory of surfaces, in which - exceptional for the time - he operated with determinants and parameters. He gave special lectures on geometry and mechanics for students of mining engineering and metallurgy. The average number of his listeners exceeded that of Kummer, who with Weierstrass was later to become one of the most sought-after teachers of mathematics. In\n1860\n, for example, Joachimsthal had an audience of sixty-six attending his mechanics lectures. By the time of his death, at the age forty-three, he had acquired a wide reputation as an excellent teacher and kind person.\nHis high quality teaching extended to the textbooks which he wrote; these are famed for their clarity of exposition. Jacobi, who was very impressed with Joachimsthal's\nCours de géométrie élémentaire\n, persuaded him to write\nElemente der Analytische Geometrie der Ebene\nⓉ\n(\nElements of analytic geometry of the plane\n)\nwhich\nJacobi\nwanted to be part of the book\nGeometrie des Raumes\nⓉ\n(\nGeometry of space\n)\nthat he was planning to write. However,\nJacobi\ndied before completing this project. Joachimsthal wrote\nCours de géométrie élémentaire\nⓉ\n(\nCourse of elementary geometry\n)\nbut he died before the work could be published and Oswald Hermes\n(1826\n-\n1909)\n, who had been a student of\nKummer\ngraduating in\n1849\n, edited Joachimsthal's notes and published them in\n1863\n. A second edition was published in\n1871\n. Notes from a lecture course Joachimsthal gave in Breslau in the winter semester of\n1856\n-\n57\nwas published as the book\nAnwendung der Differential- und Integralrechnung auf die allgemeine Theorie der Flächen und der Linien Doppelter Krümmung\nⓉ\n(\nApplication of calculus to the general theory of surfaces and lines of double curvature\n)\nin\n1872\n. The editor who converted the lecture notes into a book was Karl Heinrich Liersemann\n(1835\n-\n1896)\n. A second edition of the book appeared in\n1890\n. Liersemann explains in a Preface how he had attended Joachimsthal's lectures in\n1856\n-\n57\nand, having been asked by Joachimsthal, he took careful notes with the aim of their being the basis for a book. He writes:-\nAfter the lecture course finished, Joachimsthal received the manuscript that I had prepared and had thoroughly examined it and found nothing substantially wrong with it. However, he laid it aside probably because other areas of mathematics, namely the elements of analytic geometry, occupied him. If the undersigned has only now, after so many years have passed, decided to publish the lectures, the reason is mainly that it has taken me a long time to put the finishing touches to prepare the work for printing. But once I set about the task, the high quality of the lectures gave me the enthusiasm to complete it, believing that the experts would forgive my efforts because of the merits of the original lectures.\nInfluenced by the work of\nJacobi\n,\nDirichlet\nand\nSteiner\n, Joachimsthal wrote on the theory of surfaces where he made substantial contributions, particularly to the problem of\nnormals\nto\nconic sections\nand second degree surfaces. We should particularly mention his\n20\n-page paper\nMémoire sur les surfaces courbes\nⓉ\n(\nDissertation on curved surfaces\n)\n(1848)\n. The motivation for many of his works were problems posed by other mathematicians, for example he answered questions posed by\nPierre Bonnet\n,\nPhilippe de la Hire\n, Carl Johann Malmsten\n(1814\n-\n1886)\n,\nHeinrich Schröter\n,\nJakob Steiner\n, and\nJacques Charles-François Sturm\n.\nJoachimsthal applied the theory of determinants to geometry. He made the important step of introducing oblique coordinates. Joachimsthal surfaces are named after him, these have a family of plane lines of curvature within the plane of a pencil. He has a theorem named after him which concerns the intersection of surfaces. He is also remembered for another theorem on the four normals to an\nellipse\nfrom a point inside it. One significant aspect of his work is the clever notation which he introduced. Often one fails to recognise the importance of good notation, which can aid understanding and help to point the user towards significant results. Joachimsthal introduced a notation that can be used to write down the equations of tangents and polars of plane and projective conics. The various notations introduced by Joachimsthal in the area of second order equations and conic sections have an influence that has extended far beyond these areas, for example into the important work of\nFrank Morley\n.\nOf course his determination that his works should be of the very highest standard meant there was a price to pay. As stated in\n[\n1\n]\n:-\nJoachimsthal's contributions were substantial and lucid. His marked predilection for mature, polished exposition was expressed in constant recasting, revising and rewriting, so that many planned works never reached completion.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Eduard Kummer",
    "Kummer",
    "Lejeune Dirichlet",
    "Jakob Steiner",
    "Dirichlet",
    "Steiner",
    "Carl Jacobi",
    "Wilhelm Bessel",
    "Jacobi",
    "determinants",
    "Bessel",
    "habilitated",
    "Martin Ohm",
    "Johann Franz Encke",
    "calculus of variations",
    "Gotthold Eisenstein",
    "Carl Borchardt",
    "Eisenstein",
    "docent",
    "Crelle",
    "Lagrange",
    "Joseph Raabe",
    "Karl Weierstrass",
    "Weierstrass",
    "normals",
    "conic sections",
    "Pierre Bonnet",
    "Philippe de la Hire",
    "Heinrich Schröter",
    "Jacques Charles-François Sturm",
    "ellipse",
    "Frank Morley"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}