{
  "nome_completo": "Ferdinando Pio Rosellini",
  "nome_curto": "Fernando Pio Rosellini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rosellini/",
  "data_nascimento": "20 April 1814",
  "local_nascimento": "Pisa (now Italy)",
  "data_morte": "1 July 1872",
  "local_morte": "Casale Monferrato (Alessandria), Italy",
  "summary": "Fernando Pio Rosellini was an Italian educationalist.",
  "biografia": "Fernando Pio Rosellini\n, son of Gianbattista Roselini, a wealthy businessman, and Angiola Biagiotti, was the younger brother of Ippolito Rosellini, famous because of his collaboration with\nJean Francois Champollion\nin Egyptology studies. His birth date has been found through his baptism certificate dated\n20\nNovember\n1848\nin which the Vicar of the \"Cura di San Cosimo\" stated that he was born two days before his baptism.\nRosellini graduated in mathematics at the University of Pisa and improved his knowledge in physics at the University of Florence, where he was assistant professor to Leopoldo Nobili\n(1784\n-\n1835)\n. He perfected his knowledge of French, Latin and Greek, with the help of his brother Ippolito, who by then was professor of Oriental Languages at the University of Pisa. Earlier, in\n1828\n, Ippolito Rosellini and\nJean-François Champollion\n(\nwho was the first to decode Egyptian hieroglyphics\n)\nhad led a combined expedition to Egypt and published their research in\nMonuments de l'Égypte et Nubie\nⓉ\n(\nMonuments of Egypt and Nubia\n)\n.\nIn\n1836\nhe was tutor of the four sons of Giorgio Doria in Genoa, where he received a salary of two thousand francs in addition to a house and subsistence costs. During this time he studied botany and collected a rich herbarium which he gave to the Natural Science Museum of Genoa. He lived in Genoa, at the Doria family home, for ten years.\nOn\n4\nJune\n1843\nhis brother Ippolito died and three years later, on\n8\nMarch\n1846\n, he married his sister-in-law Zenobia Cherubini and adopted her sons Eugenio, Angela and Giovanbattista.\nThe year\n1848\nwas one of revolution in Italy and rulers introduced reforms to satisfy popular demand. Austria, however, controlled Lombardy-Venetia and when revolution broke out they arrested those involved in Venice and Milan in March. The inhabitants of Milan and Venice forced their Austrian rulers out. Rosellini was the Secretary of the \"Circolo Patriottico Milanese\" in Milan, where he took part to the this uprising. In an attempt to strengthen their cause against Austria, Lombardy and Venetia merged with Piedmont but their army suffered defeats against the Austrians who eventually captured Milan. Rosellini left Milan and went to Turin where he became a member of the Parliament of the Italian Kingdom from\n1849\nto\n1850\n, then, still in Turin, he was director of the magazine\n\"La Croce dei Savoia\"\nfrom\n1853\n.\nIn\n1853\n, with the King Edict dated\n13\nFebruary\n1853\n, Camillo Benso conte di Cavour founded the High School \"Istituto di Commercio e Industria\" in Turin, and he wanted Ferdinando Rosellini for the head of the School. Rosellini obtained many important results as director and, in\n1856\n, he received the honour \"Croce di Cavaliere dell'Ordine dei Santi Maurizio e Lazzaro\".\nOn\n5\nDecember\n1852\nLady Clara Leardi Angelieri di Terzo gave her will to the notary Giocanni Negri: she wanted her mansion, the furniture, the library and two hundred thousand liras, to be left to the town of Casale Monferrato to found a high school to teach mathematics, physics and economics. Two years later, on\n4\nAugust\n1854\n, she died and, on\n10\nFebruary\n1855\na committee was appointed to carry out the conditions set out in her will. The members of the board were Giuseppe Visconti, Carlo Cadorna, Vincenzo Luparia, Candido Bottacco, Giuseppe Tommaso Caire and Carlo Mazza. The articles of the association were approved with the King Edict of\n3\nAugust\n1857\n. The economics board of the \"Istituto Leardi\" was designated: Filippo Mellana, Candido Bottacco, Giovanni Tommaso Caire, Pietro De Giovanni, Bernardino Guida, Cesare Manara, Carlo Mazza and Giuseppe Visconti.\nThis school was to provide a new kind of education, so that it was necessary to give it the right educational programs. Ferdinando Pio Rosellini was appointed head of the \"Istituto Leardi\". He talked about the programs that he worked out on\n19\nFebruary\n1858\nto the Town Council. These programs were the basis of the ones proposed in the Casati Law dated\n13\nNovember\n1859\nn.\n3725\n. Rosellini wrote also the regulations which were approved on\n13\nMarch\n1858\n. The school \"Istituto Leardi\" was definitely introduced to the people on\n24\nJune\n1858\n. Here he was the head of the school for fifteen years and also a teacher of mathematics.\nHere he collected a new rich herbarium. In February\n1869\n, Rosellini gave to the \"Istituto Leardi\" his herbarium, called\nFlora monferrina\n, composed of plants and grass of the hills around Casale Monferrato. The original herbarium was enriched by the work of many teachers at the institute: Arturo Zanetti\n(1865\n-\n1869)\n, Alessandro Capra\n(1871\n-\n1891)\n, Ettore Bonzanini\n(1870\n-\n1874)\n, Francesco Delprete\n(1874\n-\n1875)\n, Vittore Gattoni\n(1875\n-\n1879)\n, Bernardo Goio\n(1879\n-\n1886)\n, Gioacchino Nogaris\n(1886\n-\n1890)\n, Pietro Voglino\n(1890\n-\n1897)\n, Augusto Sacco\n(1897\n-\n1900)\nand Giovanni Augusto De Amicis\n(1900\n-\n1905)\n.",
  "matematicos_citados_na_biografia": [
    "Jean Francois Champollion",
    "Jean-François Champollion"
  ],
  "imagens": []
}