{
  "nome_completo": "Leonardo Pisano Fibonacci",
  "nome_curto": "Fibonacci",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fibonacci/",
  "data_nascimento": "1170",
  "local_nascimento": "(probably) Pisa (now Italy)",
  "data_morte": "1250",
  "local_morte": "(possibly) Pisa (now Italy)",
  "summary": "Leonard of Pisa or Fibonacci played an important role in reviving ancient mathematics and made significant contributions of his own. Liber abaci introduced the Hindu-Arabic place-valued decimal system and the use of Arabic numerals into Europe.",
  "biografia": "Leonardo Pisano\nis better known by his nickname\nFibonacci.\nHe was the son of Guilielmo and a member of the Bonacci family. Fibonacci himself sometimes used the name Bigollo, which may mean good-for-nothing or a traveller. As stated in\n[\n1\n]\n:-\nDid his countrymen wish to express by this epithet their disdain for a man who concerned himself with questions of no practical value, or does the word in the Tuscan dialect mean a much-travelled man, which he was?\nFibonacci was born in Italy but was educated in North Africa where his father, Guilielmo, held a diplomatic post. His father's job was to represent the merchants of the Republic of Pisa who were trading in Bugia, later called Bougie and now called Bejaia. Bejaia is a Mediterranean port in northeastern Algeria. The town lies at the mouth of the Wadi Soummam near Mount Gouraya and Cape Carbon. Fibonacci was taught mathematics in Bugia and travelled widely with his father and recognised the enormous advantages of the mathematical systems used in the countries they visited. Fibonacci writes in his famous book\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\n(1202)\n:-\nWhen my father, who had been appointed by his country as public notary in the customs at Bugia acting for the Pisan merchants going there, was in charge, he summoned me to him while I was still a child, and having an eye to usefulness and future convenience, desired me to stay there and receive instruction in the school of accounting. There, when I had been introduced to the art of the Indians' nine symbols through remarkable teaching, knowledge of the art very soon pleased me above all else and I came to understand it, for whatever was studied by the art in Egypt, Syria, Greece, Sicily and Provence, in all its various forms.\nFibonacci ended his travels around the year\n1200\nand at that time he returned to Pisa. There he wrote a number of important texts which played an important role in reviving ancient mathematical skills and he made significant contributions of his own. Fibonacci lived in the days before printing, so his books were hand written and the only way to have a copy of one of his books was to have another hand-written copy made. Of his books we still have copies of\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\n(1202)\n,\nPractica geometriae\nⓉ\n(\nPractical geometry\n)\n(1220)\n,\nFlos\nⓉ\n(\nFlower\n)\n(1225)\n, and\nLiber quadratorum\nⓉ\n(\nBook of squares\n)\n. Given that relatively few hand-made copies would ever have been produced, we are fortunate to have access to his writing in these works. However, we know that he wrote some other texts which, unfortunately, are lost. His book on commercial arithmetic\nDi minor guisa\nⓉ\n(\nBook of small ways\n)\nis lost as is his commentary on Book X of\nEuclid\n's\nElements\nwhich contained a numerical treatment of\nirrational\nnumbers which\nEuclid\nhad approached from a geometric point of view.\nOne might have thought that at a time when Europe was little interested in scholarship, Fibonacci would have been largely ignored. This, however, is not so and widespread interest in his work undoubtedly contributed strongly to his importance. Fibonacci was a contemporary of\nJordanus\nbut he was a far more sophisticated mathematician and his achievements were clearly recognised, although it was the practical applications rather than the abstract theorems that made him famous to his contemporaries.\nThe Holy Roman emperor was Frederick II. He had been crowned king of Germany in\n1212\nand then crowned Holy Roman emperor by the Pope in St Peter's Church in Rome in November\n1220\n. Frederick II supported Pisa in its conflicts with Genoa at sea and with Lucca and Florence on land, and he spent the years up to\n1227\nconsolidating his power in Italy. State control was introduced on trade and manufacture, and civil servants to oversee this monopoly were trained at the University of Naples which Frederick founded for this purpose in\n1224\n.\nFrederick became aware of Fibonacci's work through the scholars at his court who had corresponded with Fibonacci since his return to Pisa around\n1200\n. These scholars included\nMichael Scotus\nwho was the court astrologer, Theodorus Physicus the court philosopher and Dominicus Hispanus who suggested to Frederick that he meet Fibonacci when Frederick's court met in Pisa around\n1225\n.\nJohannes of Palermo, another member of Frederick II's court, presented a number of problems as challenges to the great mathematician Fibonacci. Three of these problems were solved by Fibonacci and he gives solutions in\nFlos\nⓉ\n(\nFlower\n)\nwhich he sent to Frederick II. We give some details of one of these problems below.\nAfter\n1228\nthere is only one known document which refers to Fibonacci. This is a decree made by the Republic of Pisa in\n1240\nin which a salary is awarded to:-\n... the serious and learned Master Leonardo Bigollo ....\nThis salary was given to Fibonacci in recognition for the services that he had given to the city, advising on matters of accounting and teaching the citizens.\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\n, published in\n1202\nafter Fibonacci's return to Italy, was dedicated to\nScotus\n. The book was based on the arithmetic and algebra that Fibonacci had accumulated during his travels. The book, which went on to be widely copied and imitated, introduced the Hindu-Arabic place-valued decimal system and the use of Arabic numerals into Europe. Indeed, although mainly a book about the use of Arab numerals, which became known as algorism, simultaneous linear equations are also studied in this work. Certainly many of the problems that Fibonacci considers in\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\nwere similar to those appearing in Arab sources.\nThe second section of\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\ncontains a large collection of problems aimed at merchants. They relate to the price of goods, how to calculate profit on transactions, how to convert between the various currencies in use in Mediterranean countries, and problems which had originated in China.\nA problem in the third section of\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\nled to the introduction of the Fibonacci numbers and the\nFibonacci sequence\nfor which Fibonacci is best remembered today:-\nA certain man put a pair of rabbits in a place surrounded on all sides by a wall. How many pairs of rabbits can be produced from that pair in a year if it is supposed that every month each pair begets a new pair which from the second month on becomes productive?\nThe resulting sequence is\n1\n,\n1\n,\n2\n,\n3\n,\n5\n,\n8\n,\n13\n,\n21\n,\n34\n,\n55\n, ...\n(\nFibonacci omitted the first term in\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\n)\n. This sequence, in which each number is the sum of the two preceding numbers, has proved extremely fruitful and appears in many different areas of mathematics and science. The\nFibonacci Quarterly\nis a modern journal devoted to studying mathematics related to this sequence.\nMany other problems are given in this third section, including these types, and many many more:\nA spider climbs so many feet up a wall each day and slips back a fixed number each night, how many days does it take him to climb the wall.\nA hound whose speed increases arithmetically chases a hare whose speed also increases arithmetically, how far do they travel before the hound catches the hare.\nCalculate the amount of money two people have after a certain amount changes hands and the proportional increase and decrease are given.\nThere are also problems involving\nperfect numbers\n, problems involving the Chinese remainder theorem and problems involving summing arithmetic and geometric series.\nFibonacci treats numbers such as √\n10\nin the fourth section, both with\nrational\napproximations and with geometric constructions.\nA second edition of\nLiber abaci\nⓉ\n(\nBook of the abacus\n)\nwas produced by Fibonacci in\n1228\nwith a preface, typical of so many second editions of books, stating that:-\n... new material has been added\n[\nto the book\n]\nfrom which superfluous had been removed...\nAnother of Fibonacci's books is\nPractica geometriae\nⓉ\n(\nPractical geometry\n)\nwritten in\n1220\nwhich is dedicated to Dominicus Hispanus whom we mentioned above. It contains a large collection of geometry problems arranged into eight chapters with theorems based on\nEuclid\n's\nElements\nand\nEuclid\n's\nOn Divisions\n. In addition to geometrical theorems with precise proofs, the book includes practical information for surveyors, including a chapter on how to calculate the height of tall objects using similar triangles. The final chapter presents what Fibonacci called geometrical subtleties\n[\n1\n]\n:-\nAmong those included is the calculation of the sides of the pentagon and the decagon from the diameter of\ncircumscribed\nand\ninscribed\ncircles; the inverse calculation is also given, as well as that of the sides from the surfaces. ... to complete the section on equilateral triangles, a rectangle and a square are inscribed in such a triangle and their sides are algebraically calculated ...\nIn\nFlos\nⓉ\n(\nFlower\n)\nFibonacci gives an accurate approximation to a root of\n10\nx\n+\n2\nx\n2\n+\nx\n3\n=\n20\n10x + 2x^{2} + x^{3} = 20\n1\n0\nx\n+\n2\nx\n2\n+\nx\n3\n=\n2\n0\n, one of the problems that he was challenged to solve by Johannes of Palermo. This problem was not made up by Johannes of Palermo, rather he took it from Omar\nKhayyam\n's algebra book where it is solved by means of the intersection of a circle and a\nhyperbola\n. Fibonacci proves that the root of the equation is neither an integer nor a fraction, nor the square root of a fraction. He then continues:-\nAnd because it was not possible to solve this equation in any other of the above ways, I worked to reduce the solution to an approximation.\nWithout explaining his methods, Fibonacci then gives the approximate solution in\nsexagesimal\nnotation as\n1\n.\n22\n.\n7\n.\n42\n.\n33\n.\n4\n.\n40\n(\nthis is written to base\n60\n, so it is\n1\n+\n22\n60\n+\n7\n6\n0\n2\n+\n42\n6\n0\n3\n+\n.\n.\n.\n1 + \\large\\frac{22}{60}\\normalsize  + \\large\\frac{7}{60^{2}\\normalsize}  + \\large\\frac{42}{60^{3}\\normalsize}  + ...\n1\n+\n6\n0\n2\n2\n​\n+\n6\n0\n2\n7\n​\n+\n6\n0\n3\n4\n2\n​\n+\n.\n.\n.\n)\n. This converts to the decimal\n1\n.\n3688081075\nwhich is correct to nine decimal places, a remarkable achievement.\nLiber quadratorum\n, written in\n1225\n, is Fibonacci's most impressive piece of work, although not the work for which he is most famous. The book's name means the book of squares and it is a\nnumber theory\nbook which, among other things, examines methods to find Pythagorean triples. Fibonacci first notes that\nsquare numbers\ncan be constructed as sums of odd numbers, essentially describing an inductive construction using the formula\nn\n2\n+\n(\n2\nn\n+\n1\n)\n=\n(\nn\n+\n1\n)\n2\nn^{2} + (2n+1) = (n+1)^{2}\nn\n2\n+\n(\n2\nn\n+\n1\n)\n=\n(\nn\n+\n1\n)\n2\n. Fibonacci writes:-\nI thought about the origin of all square numbers and discovered that they arose from the regular ascent of odd numbers. For unity is a square and from it is produced the first square, namely\n1\n; adding\n3\nto this makes the second square, namely\n4\n, whose root is\n2\n; if to this sum is added a third odd number, namely\n5\n, the third square will be produced, namely\n9\n, whose root is\n3\n; and so the sequence and series of square numbers always rise through the regular addition of odd numbers.\nTo construct the Pythagorean triples, Fibonacci proceeds as follows:-\nThus when I wish to find two square numbers whose addition produces a square number, I take any odd square number as one of the two square numbers and I find the other square number by the addition of all the odd numbers from unity up to but excluding the odd square number. For example, I take\n9\nas one of the two squares mentioned; the remaining square will be obtained by the addition of all the odd numbers below\n9\n, namely\n1\n,\n3\n,\n5\n,\n7\n, whose sum is\n16\n, a square number, which when added to\n9\ngives\n25\n, a square number.\nFibonacci also proves many interesting number theory results such as:\nthere is no\nx\n,\ny\nx, y\nx\n,\ny\nsuch that\nx\n2\n+\ny\n2\nx^{2} + y^{2}\nx\n2\n+\ny\n2\nand\nx\n2\n−\ny\n2\nx^{2} - y^{2}\nx\n2\n−\ny\n2\nare both squares.\nand\nx\n4\n−\ny\n4\nx^{4} - y^{4}\nx\n4\n−\ny\n4\ncannot be a square.\nHe defined the concept of a\ncongruum\n, a number of the form\na\nb\n(\na\n+\nb\n)\n(\na\n−\nb\n)\nab(a + b)(a - b)\na\nb\n(\na\n+\nb\n)\n(\na\n−\nb\n)\n, if\na\n+\nb\na + b\na\n+\nb\nis even, and\n4\ntimes this if\na\n+\nb\na + b\na\n+\nb\nis odd. Fibonacci proved that a congruum must be divisible by\n24\nand he also showed that for\nx\n,\nc\nx, c\nx\n,\nc\nsuch that\nx\n2\n+\nc\nx^{2} + c\nx\n2\n+\nc\nand\nx\n2\n−\nc\nx^{2} - c\nx\n2\n−\nc\nare both squares, then\nc\nc\nc\nis a congruum. He also proved that a square cannot be a congruum.\nAs stated in\n[\n2\n]\n:-\n... the Liber quadratorum\nⓉ\n(\nBook of squares\n)\nalone ranks Fibonacci as the major contributor to number theory between\nDiophantus\nand the\n17\nth\n-century French mathematician Pierre de\nFermat\n.\nFibonacci's influence was more limited than one might have hoped and apart from his role in spreading the use of the Hindu-Arabic numerals and his rabbit problem, Fibonacci's contribution to mathematics has been largely overlooked. As explained in\n[\n1\n]\n:-\nDirect influence was exerted only by those portions of the \"Liber abaci\" and of the \"Practica\" that served to introduce Indian-Arabic numerals and methods and contributed to the mastering of the problems of daily life. Here Fibonacci became the teacher of the masters of computation and of the surveyors, as one learns from the \"Summa\"\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\nof\nLuca Pacioli\n... Fibonacci was also the teacher of the \"Cossists\", who took their name from the word 'causa' which was first used in the West by Fibonacci in place of 'res' or 'radix'. His alphabetic designation for the general number or coefficient was first improved by\nViète\n...\nFibonacci's work in number theory was almost wholly ignored and virtually unknown during the Middle ages. Three hundred years later we find the same results appearing in the work of\nMaurolico\n.\nThe portrait above is from a modern engraving and is believed to not be based on authentic sources.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "irrational",
    "Jordanus",
    "Michael Scotus",
    "Scotus",
    "Fibonacci sequence",
    "perfect numbers",
    "rational",
    "circumscribed",
    "inscribed",
    "Khayyam",
    "hyperbola",
    "sexagesimal",
    "number theory",
    "square numbers",
    "Diophantus",
    "Fermat",
    "Luca Pacioli",
    "Viète",
    "Maurolico"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}