{
  "nome_completo": "Frank Yates",
  "nome_curto": "Frank Yates",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yates/",
  "data_nascimento": "12 May 1902",
  "local_nascimento": "Manchester, England",
  "data_morte": "17 June 1994",
  "local_morte": "Harpenden, England",
  "summary": "Frank Yates was an English  statistician whose work was important in the development of the subject.",
  "biografia": "Frank Yates\n's mother was Edith Wright and his father was Percy Yates. Percy was a seed merchant as was Edith's father. Edith and Percy Yates had five children, with Frank being the eldest with four younger sisters. His interest in mathematics came early\n[\n1\n]\n:-\nAn uncle's gift of a table of five-figure logarithms led to the young, precocious Yates becoming interested in mathematics.\nHe was educated at Wadham House, a private school where the mathematics master was both an excellent mathematician and teacher who encouraged Frank into this direction. He obtained a scholarship to Clifton College in\n1916\n. Four years later he was awarded a scholarship to study at St John's College, Cambridge. He graduated with First Class Honours in\n1924\nafter doing very well at university but never looking like the outstanding scholar that he later became.\nAfter two years teaching mathematics in secondary schools, he decided that he wanted to put his mathematical skills to more practical use, and anyway he was tired of trying to teach people who did not want to learn, so he joined the Gold Coast Survey as mathematical advisor\n[\n2\n]\n:-\nHere began a deep appreciation of Gaussian least squares, and a lifelong love of the slide rule and other aids to efficient, well-organized, and accurate arithmetic.\nBecause of ill health he decided to try to obtain a post back in England. Back in England, but before obtaining a job, he married Margaret Forsythe Marsden in Lancaster on\n2\nNovember\n1929\n. Margaret was a chemist and the daughter of a civil servant. By chance Yates met\nR A Fisher\nand, after applying to him for a post, he was appointed assistant statistician at Rothamsted Experimental Station in August\n1931\n. When\nFisher\nwas appointed to a chair in University College London in\n1933\n, Yates became Head of Statistics at Rothamsted. He held this post until he retired in\n1968\n. During the ten years from\n1958\nuntil his retirement he was also deputy director of Rothamsted.\nIn\n1933\nYates and his wife obtained a divorce and he married again on\n14\nJuly\n1939\nto Prascovie\n(\nPauline\n)\nTchitchkine. Pauline's father was Vladimir Choubersky who was a railway engineer, and like Yates she was divorced, having been married to Alexis Tchitchkine. Pauline died in\n1976\nand after this Yates married for a third time, to Ruth Hunt in\n1981\n. Yates was\n79\nyears old at the time but they still enjoyed\n13\nyears of marriage; Ruth died in\n1999\n.\nYates worked on experimental design, often collaborating with\nFisher\n. Together they proved a longstanding conjecture on\n6\n×\n6\nLatin squares in\n1934\n. Yates introduced the 'continuity correction' in\n1934\nand published an extremely important volume of statistical tables jointly with\nFisher\nin\n1936\n. Also in\n1936\nhe published work on incomplete block designs which proved very influential in designing biological experiments. Yates' monograph on factorial design published in\n1937\nwas another important publication. In a paper in the\nProceedings of the Cambridge Philosophical Society\nin\n1939\n, Yates discussed the Behrens-Fisher test of the significance of the difference of means of pairs of samples independently drawn from normal populations in which the variances are not assumed to be equal.\nWilks\nwrites that Yates indicates:-\n... why this test yields a smaller percentage of significant differences than would be the case for a t-test involving a pooled estimate of the variance for populations with a fixed variance ratio.\nDuring World War II he studied food supplies and application of fertilisers to improve crops. This was an important contribution to the war effort and led directly to the government implementing specific policies on imports. He applied his experimental design techniques to a wide range of problems such as control of pests. After\n1945\nhe was to continue to apply his statistical techniques to problems of human nutrition.\nYates published a major paper on\nSystematic sampling\nin the\nPhilosophical Transactions of the Royal Society\nin\n1948\n.\nWolfowitz\nwrites that Yates:-\n... discusses various results dealing with one-dimensional systematic sampling. No fully reliable estimate of the sampling error can be obtained from the observations themselves, except that, under certain circumstances, the sum of sets of terms taken alternately positive and negative provides a reasonably satisfactory estimate\n(\nwhich is usually an overestimate\n)\n. The method of \"partial systematic samples,\" based on short sections of completely enumerated sequences, is proposed for estimating the systematic sampling error.\nIn\n1949\nYates was appointed to the United Nations Commission on Statistical Sampling and published\nSampling Methods for Censuses and Surveys\n[\n1\n]\n:-\n... a work which did much to establish sound principles and technical terminology.\nA survey Yates wrote in\n1951\non the design of experiments\nQuelques développements modernes dans la planification des expériences\ndiscussed topics such as: factorial experiments, including a discussion of the weighing problem; the theory of confounding in factorial experiments; fractional replications; split plot designs; balanced and partially balanced incomplete block designs; lattices; lattice squares; and quasi-Latin squares.\nYates became an enthusiastic user of computers writing:-\n... to be a good theoretical statistician one must also compute, and must therefore have the best computing aids.\nIn\n1954\nhe purchased a computer to assist with the statistical analysis to the data at Rothamsted. He was one of the people who were influential in establishing the British Computer Society, and he was president of the Society in\n1960\n-\n61\n. In his Presidential Address Yates pointed out that, as well as making the impossible possible, computers provided speed, thoroughness and a fairly complete mechanisation of techniques for work which would previously have been done by hand. The last of these, Yates suggested, is particularly important for specialists such as biologists. He went on to say that the reluctance of statisticians to use computers was vanishing and they were carrying out computations which were previously impossible, or almost impossibly time consuming to do by conventional methods. Yates remarked that most of the calculations which were possible by hand calculation were still being done that way, probably because no code had been written and made available. He encouraged people to write code to solve standard statistical problems, and emphasised that it should be code which was machine independent.\nYates was an extremely good Departmental Head. In the address at his memorial service his style in this role was talked about:-\nFrank Yates's method of managing his department was a remarkable one, in that it was totally invisible. There were almost no rules, apart from that which insisted that no scientific paper left the department without being read, and usually greatly improved, by him.\nAfter he retired, he became Senior Research Fellow at Imperial College, London. There he did some lecturing for the first time in his career, without having a great deal of success. In\n[\n3\n]\nhis lecturing is described as follows:-\nHe was not an ideal lecturer, for he lacked concern for comprehensive formal presentation and preferred to talk about general ideas.\nThe\nRoyal Society of London\n, to which he was elected in\n1948\n, awarded him their Royal Medal in\n1966\nin:-\n... recognition of his profound and far-reaching contributions to the statistical methods of experimental biology.\nHe was also a member of the\nRoyal Statistical Society\nand received their Guy medal in\n1960\n. He was president of the Society in\n1967\n-\n68\n.",
  "matematicos_citados_na_biografia": [
    "R A Fisher",
    "Fisher",
    "Wilks",
    "Wolfowitz",
    "Royal Society of London",
    "Royal Statistical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}