{
  "nome_completo": "François Georges René Bruhat",
  "nome_curto": "François Bruhat",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bruhat/",
  "data_nascimento": "8 April 1929",
  "local_nascimento": "Paris, France",
  "data_morte": "17 July 2007",
  "local_morte": "Paris, France",
  "summary": "François Bruhat was a French mathematician who worked on algebraic groups.",
  "biografia": "François Bruhat\n's parents were Georges Bruhat, who was assistant director of the École Normale Supérieure in Paris, and Berthe Hubert. François attended the Lycée Henri IV in Paris, going on to prepare for university entry at the Lycée Saint-Louis, also in Paris. From there he entered the École Normale Supérieure where he studied for his Agrégé de mathematique. He was appointed to the National Centre for Scientific research in\n1952\nand he worked there until\n1955\n.\nBruhat was among the first to understand the importance of distributions, as introduced by\nLaurent Schwartz\n, in the theory of\nLie groups\nand their representations and his doctoral thesis was devoted to these topics. He published\nSur les représentations induites des groupes de Lie\nⓉ\n(\nOn induced representations of Lie groups\n)\nin\n1953\non this topic and continued his investigations in\nIrréductibilité des représentations induites des groupes de Lie\nⓉ\n(\nIrreducibility of induced representations of Lie groups\n)\nwhich was published in the following year. This paper considered induced representations which Bruhat then applied in his next paper\nReprésentations induites des groupes de Lie semi-simples complexes\nⓉ\n(\nInduced representations of complex semi-simple Lie groups\n)\n(1954)\nto a complex semi-simple Lie group none of whose simple factor groups is one of the exceptional simple Lie groups. In the same year his paper\nReprésentations induites des groupes de Lie semi-simples réels\nⓉ\n(\nInduced representations of real semi-simple Lie groups\n)\nappeared which dealt with the case of a real semi-simple Lie group. In a major\n108\npage paper\nSur les représentations induites des groupes de Lie\nⓉ\n(\nOn induced representations of Lie groups\n)\n(1956)\nBruhat gave a new theory in which he dealt with more restricted groups but was able to handle more general representations of them.\nAfter spending three years at the National Centre for Scientific Research, Bruhat was appointed as Maître de Conférences at the Faculty of Science in Nancy in\n1955\n. He was later promoted to professor of mathematics at Nancy. Bruhat published two papers which resulted from a collaboration with\nHenri Cartan\nin\n1957\n. These papers\nSur la structure des sous-ensembles analytiques réels\nⓉ\n(\nOn the structure of real analytic subsets\n)\nand\nSur les composantes irréductibles d'un sous-ensemble analytique-réel\nⓉ\n(\nOn the irreducible components of an analytical real-subset\n)\ndeal with real analytic manifolds with singularities. Bruhat continued his study of real analytic manifolds in a collaboration with\nWhitney\n. A course of lecture given by Bruhat in India in\n1958\nwere published as\nLectures on Lie groups and representations of locally compact groups\nand reissued in\n1968\n. The lectures are in three parts. The first covers elementary properties of Lie groups, the second covers the general theory of measures on a locally compact group and representation in general, while the final part contains a construction of the continuous sum of Hilbert spaces, decomposition of a unitary representation into a continuous sum of irreducible representations and the\nPlancherel\nformula.\nIn\n1959\nBruhat lectured on Lie groups and Lie algebras at Recife in Brazil and his lecture notes were published as\nAlgébres de Lie et groupes de Lie : Résumé des eleçons\nin the same year. Another lecture course, this time given in India, was published as\nLectures on some aspects of p-adic analysis\nin\n1963\n. By this time Bruhat had an appointment in Paris, having been appointed to the Faculty of Science there in\n1961\n. He was appointed to Université de Paris VII in\n1970\nand he held this post until\n1989\n. From\n1976\nto\n1981\nhe was vice-president of the university.\nTogether with\nJacques Tits\n, Bruhat developed the theory of simple algebraic groups over local fields. They published a number of notes containing their results in this area but a detailed account of the theory of reductive algebraic groups over local fields appeared in their joint\n250\npage paper\nGroupes réductifs sur un corps local\npublished in\n1972\n.\nFinally we should mention that Bruhat was a member of\nBourbaki\nbeing a third generation member along with\nArmand Borel\n,\nAlexandre Grothendieck\n,\nPierre Cartier\n,\nSerge Lang\n, and\nJohn Tate\n.\nAmong the honours that Bruhat received were that he was made an Officer of the Légion d'Honneur and the national order of merit. He was also made Commandeur des Palmes Académiques.",
  "matematicos_citados_na_biografia": [
    "Laurent Schwartz",
    "Lie groups",
    "Henri Cartan",
    "Whitney",
    "Plancherel",
    "Jacques Tits",
    "Bourbaki",
    "Armand Borel",
    "Alexandre Grothendieck",
    "Pierre Cartier",
    "Serge Lang",
    "John Tate"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}