{
  "nome_completo": "Frank Plumpton Ramsey",
  "nome_curto": "Frank Ramsey",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramsey/",
  "data_nascimento": "22 February 1903",
  "local_nascimento": "Cambridge, England",
  "data_morte": "19 January 1930",
  "local_morte": "London, England",
  "summary": "Frank Ramsey was an English mathematician most important for his work on the foundations of mathematics and philosophy, but best known for his so-called Ramsey theory in combinatorics.",
  "biografia": "Frank Ramsey\n's parents were Arthur Stanley Ramsey and Agnes Mary Wilson. Arthur Ramsey was President of Magdalene College, Cambridge, and a tutor in mathematics there. Frank was the oldest of his parents four children. He had one brother and two sisters and his brother Michael Ramsey went on to become Archbishop of Canterbury.\nRamsey entered Winchester College in\n1915\nand from there he won a scholarship to Trinity College, Cambridge. He completed his secondary school education at Winchester in\n1920\nand he entered Trinity College, Cambridge, to study mathematics. At Cambridge, Ramsey became a senior scholar in\n1921\nand graduated as a\nWrangler\nin the Mathematical Tripos of\n1923\n.\nAfter graduating, Ramsey went to Vienna for a short while, returning to Cambridge where he was elected a fellow of King's College Cambridge in\n1924\n. It is worth noting that this was a most unusual occurrence, and in fact Ramsey was only the second person ever to be elected to a fellowship at King's College, not having previously studied at King's.\nIn\n1925\nRamsey married Lettice C Baker and they had two daughters. In\n1926\nhe was appointed as a university lecturer in mathematics and he later became a Director of Studies in Mathematics at King's College. It was a short career, for sadly Ramsey died at the beginning of\n1930\n. However, in the short time during which he lectured at Cambridge he had already established himself as an outstanding lecturer.\nBroadbent\nwrites in\n[\n1\n]\n:-\nHis lectures on the foundations of mathematics impressed young students by their remarkable clarity and enthusiasm ...\nAlthough Ramsey was a lecturer in mathematics, he produced work in a remarkable range of topics over a short period. As well as starting up the new area of mathematics now called 'Ramsey theory', which we say more about below, he wrote on the foundations of mathematics, economics and philosophy.\nHe published his first major work\nThe Foundations of Mathematics\nin\n1925\n. In this work he accepted the claim by\nRussell\nand\nWhitehead\nmade in the\nPrincipia Mathematica\nthat mathematics is a part of logic. Ramsey's aim in this paper, however, was to improve on the\nPrincipia Mathematica\nand he did so in two ways. Firstly he proposed dropping the axiom of reducibility which, he writes, is:-\n... certainly not self-evident and there is no reason to suppose it true; and if it were true, this would be a happy accident and not a logical necessity, for it is not a tautology.\nHis second simplification is to suggest simplifying\nRussell\n's theory of types by regarding certain semantic paradoxes as linguistic. He accepted\nRussell\n's solution to remove the logical paradoxes of set theory arising from, for example, \"the set of all sets which are not members of themselves\". However, the semantic paradoxes such as \"this is a lie\" are, Ramsey claims, quite different and depend on the meaning of the word \"lie\". These he removed with his reinterpretation that removed the axiom of reducibility.\nRamsey published\nMathematical Logic\nin the\nMathematical Gazette\nin\n1926\n. In this he attacks the:-\n... Bolshevik menace of\nBrouwer\nand\nWeyl\n...\nfor denying that propositions are either true of false. He writes:-\nBrouwer would refuse to agree that either it was raining or it was not raining, unless he had looked to see.\nHe also criticises\nHilbert\nin\nMathematical Logic\nsaying that he had attempted to reduce mathematics to:-\n... a meaningless game with marks on paper.\nHis second paper on mathematics\nOn a problem of formal logic\nwas read to the\nLondon Mathematical Society\non\n13\nDecember\n1928\nand published in the\nProceedings of the London Mathematical Society\nin\n1930\n. This examines methods for determining the consistency of a logical formula and it includes some theorems on combinatorics which have led to the study of a whole new area of mathematics called Ramsey theory.\nHarary\ndescribes this birth of Ramsey theory in\n[\n8\n]\nwhere he writes the following:-\nThe celebrated paper of Ramsey\n[\nin\n1930]\nhas stimulated an enormous study in both graph theory ..., and in other branches of mathematics .... Most certainly 'Ramsey theory' is now an established and growing branch of combinatorics. Its results are often easy to state\n(\nafter they have been found\n)\nand difficult to prove; they are beautiful when exact, and colourful. Unsolved problems abound, and additional interesting open questions arise faster than solutions to the existing problems.\nThe combinatorics was introduced by Ramsey to solve a special case of the decision problem for the first-order predicate calculus. However, as Mellor points out in\n[\n9\n]\n, it is now known that there is a more direct proof than that given by Ramsey, while the general case of the decision problem cannot be solved. So Mellor points out that\n[\n9\n]\n:-\nRamsey's enduring fame in mathematics ... rests on a theorem he didn't need, proved in the course of trying to do something we now know can't be done!\nRamsey made a systematic attempt to base the mathematical\ntheory of probability\non the notion of partial belief. This work on probability, and also important work on economics, came about mainly because Ramsey was a close friend of\nKeynes\n. Being a friend of\nKeynes\ncertainly did not stop Ramsey attacking\nKeynes\n' work, however, and in\nTruth and probability\n, which Ramsey published in\n1926\n, he argues against\nKeynes\n' ideas of an a priori inductive logic. Ramsey's arguments convinced\nKeynes\nwho then abandoned his own ideas. Ramsey, proposing a probability measure based on strength of belief,\n[\n11\n]\n:-\n... derives measures both of desires\n(\nsubjective utilities\n)\nand of beliefs\n(\nsubjective probabilities\n)\n, thereby founding the now standard use of these concepts.\nIn economics, Ramsey wrote two papers\nA contribution to the theory of taxation\nand\nA mathematical theory of saving\n. These would lead to important new areas in the subject.\nIt was philosophy, however, that was Ramsey's real love. He wrote a number of works such as\nUniversals\n(1925)\n,\nFacts and propositions\n(1927)\n,\nUniversals of law an of fact\n(1928)\n,\nKnowledge\n(1929)\n,\nTheories\n(1929)\n, and\nGeneral propositions and causality\n(1929)\n. Braithwaite writes in\n[\n6\n]\n:-\n... in general philosophy took more and more of his attention. For profitable thought in this most difficult field Ramsey was superbly equipped, and there is no doubt that his early death has deprived the world of one of its most promising philosophers.\nOne would have to say, however, that Ramsey's work in philosophy has been somewhat overshadowed by that of\nWittgenstein\n. Recently, however, Ramsey's work in philosophy seems to be receiving more attention.\nSeveral of the articles cited in the references paint vivid pictures of Ramsey's character. For example Braithwaite writes in\n[\n6\n]\n:-\nAs a person, no less than as a thinker, Ramsey was an ornament to Cambridge. From his undergraduate days he had been recognised as an authority on any abstract subject, and his directness of approach and candour were an inspiration to his associates. His enormous physical size fitted well the range of his intellect, and his devastating laugh suited his power of humorously discarding irrelevancies, which power enabled him to be both subtle and profound in the highest degree.\nMellor, in\n[\n10\n]\n, paints a similar picture:-\nHe was a quiet, modest man, easy going and uninhibited, with a loud infectious laugh, his tolerance and good humour enabling him to disagree strongly without giving or taking offence; as with his brother Michael ... whose ordination ... Frank, as a militant atheist, regretted.\nHe was tall\n(\nsix feet three inches\n)\nand bulky, short-sighted, wore steel-rimmed spectacles and appeared clumsy but was in fact a good tennis player. He produced his remarkable output in four hours a day - he found it too exacting to do more - in the mornings, with afternoons and evenings often spent walking or listening to records. He listened a lot to classical music, both live and recorded, and was a keen hill-walker.\nIn\n[\n2\n]\nhis potential is emphasised:-\nThere was no one in Cambridge among the younger men who would be considered his equal for power and quality of mind, and also for the boldness and originality of conception in one of the most difficult subjects of study.\nRamsey suffered an attack of jaundice and was taken to Guy's Hospital in London for an operation. He died following the operation.\nAn article about his death is at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Broadbent",
    "Russell",
    "Whitehead",
    "Brouwer",
    "Weyl",
    "Hilbert",
    "London Mathematical Society",
    "Harary",
    "theory of probability",
    "Keynes",
    "Wittgenstein",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}