{
  "nome_completo": "François Joseph Servois",
  "nome_curto": "François-Joseph Servois",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Servois/",
  "data_nascimento": "19 July 1768",
  "local_nascimento": "Mont-de-Laval (N of Morteau), Doubs, France",
  "data_morte": "17 April 1847",
  "local_morte": "Mont-de-Laval, Doubs, France",
  "summary": "François-Joseph Servois was a French mathematician who worked on projective geometry.",
  "biografia": "François-Joseph Servois\n's father, Jacques-Ignance Servois, was a merchant and his mother was Jeanne-Marie Jolliet. Servois's first intention was to join the priesthood and he began by following this aim and was ordained at Besançon. However, this was in the early days of the French Revolution and a time of great political and military activity in France. Servois soon changed his mind about following a career in the Church, and left in\n1793\nto join the army.\nHe was at the artillery school in Châlons-sur-Marne in\n1794\nand immediately after this he was promoted to lieutenant. There were numerous military campaigns by the French army shortly after this and Servois was in the thick of the action serving as a staff officer. However, he had a great love of mathematics and while on the military campaigns Servois spent all his free time studying.\nLegendre\nrealised that Servois had considerable mathematical talents and he supported a move to have him appointed to the artillery school of Besançon as professor of mathematics. Appointed to this post in July\n1801\n, Servois went on to hold similar positions over the next few years. His first move was only a few months after his first appointment at Besançon when he moved to the artillery school in Châlons-sur-Marne where he had begun his military career. Then in\n1802\nhe made his second move, this time to the artillery school in Metz.\nIn comparison with his earlier appointments, Servois spent quite a while in Metz at the artillery school, remaining there until\n1808\n. His next move was to the artillery school La Fère where he remained until\n1816\nwhen he moved to the artillery and engineering school at Metz. Hardly had he arrived in Metz when a position as curator of the artillery museum in Paris fell vacant. Servois was appointed as curator in\n1816\nand he held this post until he retired in\n1827\n. After he retired Servois returned to his home town of Mont-de-Laval where he lived for nearly twenty further years.\nServois worked in\nprojective geometry\n, functional equations and complex numbers. He introduced the word\npole\nin projective geometry. He also came close to discovering the\nquaternions\nbefore\nHamilton\n.\nPetrova, in\n[\n5\n]\n, describes a paper by Servois on differential operators written in the\nAnnales de mathématiques\nin November\n1814\n. Servois introduced the terms \"commutative\" and \"distributive\" in this paper describing properties of operators, and he also gave some examples of noncommutativity. Although he does not use the concept of a ring explicitly, he does verify that linear commutative operators satisfy the ring axioms. In doing so he showed why operators could be manipulated like algebraic magnitudes. This work initiates the algebraic theory of operators.\nServois was critical of\nArgand\n's geometric interpretation of the complex numbers. He wrote to\nGergonne\ntelling him so in November\n1813\nand\nGergonne\npublished the letter in the\nAnnales de mathématiques\nin January\n1814\n. Servois wrote:-\nI confess that I do not yet see in this notation anything but a geometric mask applied to analytic forms the direct use of which seems to me simple and more expeditious.\nConsidered as a leading expert by many mathematicians of his day, he was consulted on many occasions by\nPoncelet\nwhile he was writing his book on projective geometry\nTraité des propriétés projective\nⓉ\n(\nTreatise on projective properties\n)\n.",
  "matematicos_citados_na_biografia": [
    "Legendre",
    "projective geometry",
    "quaternions",
    "Hamilton",
    "Argand",
    "Gergonne",
    "Poncelet"
  ],
  "imagens": []
}