{
  "nome_completo": "Franz Ernst Neumann",
  "nome_curto": "Franz Neumann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann_Franz/",
  "data_nascimento": "11 September 1798",
  "local_nascimento": "Joachimsthal, Prussia (now Germany)",
  "data_morte": "23 May 1895",
  "local_morte": "Königsberg, Germany (now Kaliningrad, Russia)",
  "summary": "Franz Neumann worked on crystallography and other physical applications of mathematics.",
  "biografia": "Franz Neumann\n's father, Ernst Neumann, was a farmer who later gave up farming and became an estate agent. Franz's mother was a Countess, who had been divorced, and her parents did not allow her to marry Ernst Neumann, the Countess's factotum, since he was a commoner. It was impossible for Franz's mother even to acknowledge that Franz was her son. Therefore Franz was brought up by Ernst Neumann's parents and he did not meet his mother until he was ten years old. While we are discussing the Neumann family we should note that Franz Neumann was the father of\nCarl Neumann\nwho also has a biography in this archive.\nFranz Neumann studied in Berlin\nGymnasium\nwhere he showed some talent for mathematics. However, he did not complete his studies there because of the problems caused by wars between the Prussians and the French. In\n1814\n, at the age of sixteen, Neumann left the Gymnasium and volunteered for the Prussian army. It was a period of victories for Prussia and its allies as the French army under Napoleon was driven back. By May\n1814\nthe allies had taken Paris, the Treaty of Paris was signed and Napoleon was sent into exile.\nHowever, on\n1\nMarch\n1815\n, Napoleon escaped and landed at Cannes with a detachment of his guard. The allied armies began to assemble on the borders of France, and Neumann was with the Prussian forces. Napoleon assembled an army and marched into Belgium where he defeated the Prussians at Ligny on\n16\nJune\n1815\n. Neumann took part in the battle, was seriously wounded, and was taken to a hospital in Düsseldorf. He therefore missed fighting in the battle of Waterloo at which Napoleon was finally defeated two days after the Battle of Ligny.\nBeing wounded was not the only misfortune to befall Neumann, for his father lost everything he possessed in a fire leaving little to support the rest of Neumann's education. Despite the financial problems, Neumann returned to the Berlin Gymnasium to complete his course and entered the University of Berlin in\n1817\n. He did not enrol for a degree in science, however, for he followed the wishes of his father and began to study theology.\nNeumann moved from the University of Berlin to continue his studies at Jena in April\n1818\n. At Jena, his interests turned to more scientific courses and he took up the study of mineralogy and crystallography. He became friendly with one of his teachers at Jena, Christian Weiss, and Weiss arranged for some financial support to allow Neumann to make field trips to Silesia to study geology. He made his first trip in the summer of\n1820\nand he planned to make further trips in\n1822\nand\n1823\n. However, Neumann's father died and, concerned about his mother's health and well-being, he took the year\n1822\n-\n23\nout from his studies to manage his mother's farm.\nTaking a year out to manage the farm did not stop Neumann writing his first paper on crystallography which was published in\n1823\n. Then he returned to the University of Berlin where he worked as curator of the mineral cabinet while completing the research for his doctorate. Neumann obtained his doctorate in November\n1825\n, and in the following May, together with\nJacobi\n, he was appointed as a\nPrivatdozent\nat the University of Königsberg.\nIn\n1828\nNeumann was appointed as a lecturer at Königsberg, being appointed to the chair of minerology and physics in the following year. When Neumann arrived in Königsberg the science courses were being taught by Karl Hagen, and Neumann took over teaching some of these courses. In\n1830\n, he married Luise Florentine Hagen, Karl Hagen's daughter but Luise died in\n1838\nhaving given birth to five children. Five years later Neumann married again, this time to Wilhelmina Hagen, the first cousin of his first wife.\nAt Königsberg in\n1833\n, Neumann and\nJacobi\ntogether started up a mathematics-physics seminar which was used to introduce their students to methods of research. One such student was\nKirchhoff\nwho attended the Neumann-Jacobi seminar from\n1843\nto\n1846\n. In\n1847\nNeumann came into money through an inheritance from his second wife's parents. This enabled him to build a physics laboratory for himself next to his home. He had tried for years to persuade the university authorities to build a Physics Institute but, only after Neumann retired was the Physics Institute built. The physics laboratory which he built for himself was also used by his students.\nNeumann's early work was in crystallography. He used least squares methods of error analysis of instruments giving new precision to measurements. However, his work at Königsberg was influenced by\nBessel\nand\nJacobi\n, and he turned towards a study of mathematical physics.\nIn\n1831\nhe formulated a law on molecular heat, namely that the molecular heat of a compound is equal to the sum of the atomic heats of its constituents. In a second paper he studied why when hot water and cold water are mixed the result does not have a temperature which is the average of the two temperatures. His explanation is broadly correct, namely the specific heat of water increases with temperature, but he failed to realise that this was only true over a certain range of temperatures.\nIn\n1832\nNeumann investigated the wave theory of light, obtaining results similar to those of\nCauchy\nand\nFresnel\n. He published his theory of electrical induction in two papers, the first in\n1845\nand the second in\n1847\n. These assumed action at a distance and deduced the mathematical laws for induction of electric currents.\nNeumann only published a fraction of his work, and major portions of his discoveries were contained in his lectures at Königsberg but never published.\nCarl Neumann\n, Franz Neumann's son, claimed that the unpublished researches of his father, presented in his Königsberg lectures before\n1850\n, the year of the first memoir of\nClausius\non thermodynamics, prove his priority as one of the founders of the mechanical theory of heat.\nCarl Neumann\nprepared his father's lectures for publication in\n1895\nbut they never appeared in print. The article\n[\n3\n]\ncontains extracts from the third lecture given by Franz Neumann in session\n1854\n-\n1855\n.",
  "matematicos_citados_na_biografia": [
    "Carl Neumann",
    "Gymnasium",
    "Jacobi",
    "Privatdozent",
    "Kirchhoff",
    "Bessel",
    "Cauchy",
    "Fresnel",
    "Clausius"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}