{
  "nome_completo": "François de Paule Jacquier",
  "nome_curto": "François Jacquier",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jacquier/",
  "data_nascimento": "7 June 1711",
  "local_nascimento": "Vitry-le-François, Champagne, France",
  "data_morte": "3 July 1788",
  "local_morte": "Rome, Papal States (now Italy)",
  "summary": "François Jacquier was a French 18 th century mathematician who spent most of his life in the Minim Monastery in Rome. Along with Thomas Le Seur he edited a highly annotated edition of Newton's Principia .",
  "biografia": "François Jacquier\nwas born in Vitry-le-François in north eastern France. His parents were Joseph Jacquier\n(1676\n-\n1712)\n, a master baker, and Margueritte Desenlis\n(1679\n-\n1763)\n, the daughter of a master toolmaker. Joseph and Margueritte Jacquier were married on\n4\nFebruary\n1698\n. They had four children: Hugues-Joseph, born November\n1698\n; Anne, born in March\n1700\n; Marie-Françoise, born in January\n1706\n; and François, the subject of this biography, born in\n1711\n. François never knew his father Joseph who died on\n3\nApril\n1762\nthe year after he was born. His eldest brother Hugues-Joseph joined the Order of Minims, an order of friars founded in\n1435\nby St Francis of Paola in Calabria, Italy. Jean Desenlis\n(\nborn\n1666)\n, the elder brother of François\n'\nmother Margueritte, joined the Order of Minims and probably influenced both Joseph and Margueritte Jacquier's sons to join the Order of Minims. We note that although the spelling of the name Jacquier is constant through generations, the name Desenlis is not, appearing also as de Senlis, Senlis, Sanly, Senly, Sanlys etc. See\n[\n30\n]\nfor many more details of relations of François Jacquier.\nJacquier was taught by the Minim priest Jean Desenlis, his uncle, who quickly saw that his nephew was a talented mathematician who was interested in mathematics and science. When he was sixteen years old, Jacquier followed the example of his elder brother and uncle, and joined the Order of Minims. The Order believed in poverty, chastity, and obedience but the followers also devoted themselves to study and scholarship which suited Jacquier. He studied at the College in Vitry-le-François\n[\n7\n]\n:-\nOriginally from Vitry-le-françois in the province of Champagne, Father Jacquier had been in Rome since the early\n1730\ns, when, already professed a Minim, he was sent by the superiors of his province to the College of Trinità dei Monti to continue his studies. Versed in Hebrew and Greek, a scholar of theology and the Holy Scriptures, he had shown above all an exceptional and precocious talent in scientific subjects, in which from\n1734\nhe had had his fellow Minim, Thomas Le Seur, as a teacher.\nWe note that Le Seur, who was born in\n1703\n, so eight years older than Jacquier, had also studied at the College in Vitry-le-François. Jacquier had rapidly gained a high reputation for his mathematical and scientific skills and, in\n1734\n, Cardinal Alessandro Albani consulted him about the hydraulic problems with the harbour of Ravenna and with the river Montone which joins the Ronco before entering the sea just south of Ravenna. After returning to Rome, he was appointed professor of Sacred Scripture at the\nSacra Congregatio de Propaganda Fide\n. In addition, the General Chapter of the Order of Minims in Marseille commissioned him to work on the history of the Order.\nJacquier is best known for his work as an editor and commentator on\nNewton\n's\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n. This annotated edition, published in Geneva in three volumes in\n1739\n,\n1740\nand\n1742\n, gives Le Seur and Jacquier as the editors\n(\nlisted in that order since the convention was to list the most senior first\n)\n. In fact the project was suggested by the Calvinist scholar\nJean Louis Calandrini\n, the professor of mathematics at the Academy of Geneva, and although he is not listed, he was a major contributor to the annotations. Niccolò Guicciardini writes\n[\n11\n]\n:-\nAs to his authorial identification, it is to be noted that\nCalandrini\ndid not add his name to those of Le Seur and Jacquier on the title-page. From this, one derives the impression that he wished to achieve recognition of authorship by more oblique means. It is because of his fame and prominent position in the 'république des lettres' that he expected to be recognised as the editor of the Genevan edition of the 'Principia'\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n: he did not need a mention on the title-page, but rather he was keen on being the object of grateful recognition in the Monita  signed by Le Seur and Jacquier.\nThere are natural questions regarding how\nCalandrini\ncooperated with Le Seur and Jacquier in an era when communication between cities far apart was extremely slow and difficult. It is also interesting that it was a collaboration between Catholic and Protestant scholars\n[\n11\n]\n:-\nHow\nCalandrini\n, Le Seur and Jacquier planned to comment the 'Principia'\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\nin the\n1730\ns is not known. Unfortunately, their correspondence is lost. It may well be that\nCalandrini\ncame to know about the two Minims via his cooperation with Bourguet and the 'Bibliothèque Italique', which promoted many exchanges with the literati active in the peninsula. Be that as it may, a cooperation between scholars living in two cities as distant\n(\ngeographically and culturally\n)\nas Geneva and Rome does not seem the easiest or most obvious choice, but Le Seur and Jacquier were amongst the few in all of Europe who possessed the competence and the stamina to carry out the first, complete, line-by-line, commentary of\nNewton\n's 'Principia'\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n.\nLe Seur and Jacquier fully acknowledge\nCalandrini\n's contribution, writing in the first volume:-\nWe do not wish to omit public evidence of our gratitude towards the illustrious\nCalandrini\n, Professor in the Academy of Geneva, very proficient in matters mathematical, who arranged that our edition of\nNewton\n's 'Principia'\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n, enriched by many additions, would be readied to the elegant standard of the edition that appeared in London in the year\n1726\n. Furthermore, that very learned man took upon himself the labour not only of checking carefully that the figures be engraved, and placed in the appropriate places, and that the typographical errors be corrected, but also of writing those elements of conic sections that we have already praised, and those things that appeared as not treated clearly enough by us, he occasionally elucidated with his own notes.\nCharles de Brosses\n(1709\n-\n1777)\nwas a writer on history and language whose writing were used by Diderot and\nD'Alembert\nin their\nEncyclopaedia\n. In\n1739\nhe met Jacquier who was busy working at Trinità dei Monti on the annotated edition of the\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n. In the\nLettres Familières Écrites d'Italie\nⓉ\n(\nFamiliar letters written from Italy\n)\n, de Brosses describes his encounter with Jacquier in the Trinità dei Monti\n[\n5\n]\n:-\nThe convent is well placed, and has a fine view; it has a garden, a good reading room, and a very pious collection of monks, who know more than what merely pertains to their profession. I made the acquaintance of one, Father Jacquier, a very able mathematician, who is working with one of his brethren on a commentary, in four quarto volumes, regarding the principles of\nNewton\n's philosophy. The earlier volumes are now being printed in Geneva. I have heard great praise of this work. You know\nMalebranche\nused to say that\nNewton\nhad climbed to the top of the tower, and had taken the ladder up with him. Father Jacquier is making a new ladder in order to get to the top of that tower. I made fun of him for his ungrateful way of preferring the Newtonian method to that of Wolff, who has done so well by the Order of the Minims through his treatise 'De Minimis et Maximis'\nⓉ\n(\nOf the smallest and greatest\n)\n: foolish banter on my part!\nIn January\n1741\nJacquier and Le Seur sent the first two volumes of their edition of\nNewton\n's\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\nto the\nRoyal Society\nin London. In a letter to Cromwell Mortimer, Secretary of the\nRoyal Society\n, dated\n9\nJanuary\n1741\n, they explain that they were printed in Geneva since the Inquisitor would not suffer them to be printed at Rome, for fear of offending the Holy Church. This refers to an interesting aspect of Le Seur and Jacquier's annotated edition of the\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n, namely the problem of whether the Earth orbits the Sun. The\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\ncertainly presents a heliocentric solar system, yet the Roman Catholic Church at this time banned the teaching this since the\nIndex\nbanned:-\n... all books teaching the Earth's motion and the Sun's immobility.\nIn fact this prohibition was dropped from the\nIndex\nin\n1758\nbut it was certainly in place in\n1739\n-\n42\nwhen Le Seur and Jacquier's\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\nwas published. They had, therefore, to make sure that their work did not end up on the\nIndex\nby making it clear that they were complete believers in Roman Catholic orthodoxy. They managed this with the following statement:-\nNewton\nassumes the hypothesis of the moving earth. The author's propositions could not be explained without granting that hypothesis. Therefore we were compelled to wear an alien mask. For the rest, we profess ourselves observant of the decrees against the motion of the earth promulgated by the holy pontiffs.\nWe note that the\nRoyal Society\nwas very impressed with the annotated\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\nand elected Jacquier a fellow of the Society on\n10\nDecember\n1741\n.\nProspero Lorenzo Lambertini\n(1675\n-\n1758)\nbecame Pope Benedict XIV in August\n1740\n. He was a scholar who was well disposed towards learning and impressed with the work of Le Seur and Jacquier. One of the long running problems for the Vatican had been the stability of the dome of St Peter's basilica and the new Pope tackled it. Architects had for many years argued over the solution and, in\n1742\n, the Pope asked three mathematicians, Le Seur, Jacquier and\nRuggero Boscovich\n, to advise on stabilising the dome. They studied the problem and produced the report\nParere di tre mattematici sopra i dani, che si sono trovati nella cupola di S Pietro sul fine dell'anno MDCCXLII data per ordi ne di Nostro Signore Papa Benedetto XIV\nⓉ\n(\nOpinion of three mathematicians on the damage found in the dome of St. Peter at the end of the year\n1742\ngiven by order of Our Lord Pope Benedict XIV\n)\n(\nRome,\n1742)\n.\nThis report is an interesting document for it is clearly aimed at criticising architects for lacking the necessary mathematical knowledge to properly design buildings. It begins with a description of the damage that the three mathematicians had observed during their visits to the site. In particular they give details of the numerous cracks which they observed in all parts of the building. They then compare the many faults they have observed with those observed by people in earlier times. They dispute earlier theories that attribute the damage to natural settlement and the incompetence of the masons. The mathematicians want to put the blame on the architects, not on those carrying out the architects' design. They state clearly that mathematicians would have avoided the errors made by the architects. The cracks, they say, come from natural movements in the ground, not from exceptional events such as earthquakes or lightning strikes.\nThe three mathematicians then devise a \"system\" using\nNewton\n's laws of motion and\nPhilippe de La Hire\n's papers as the basis for their calculations\n[\n6\n]\n:-\nThe method consists of starting from theoretical knowledge then to observe its application in reality, and it is used here on several occasions, each time making the case presented more and more complex in order to gradually approach as close as possible to the real situation studied. However, it contradicts the declared organisation of their discourse, which started from observations on the ground before proposing an analysis of the problem. ... The conclusion resulting from these calculations does not fail to surprise us: the recommendation now consists of planning a doubling of the reaction forces as a precaution, \"so that if, by an unforeseen accident, one part were to fail, the other would remain. Their calculations indicate the need to place a new iron circle which would prove sufficient to offset the three million pounds.\nThe authors of\n[\n6\n]\ngive the following conclusion:-\nNewton\n's theories on the exercise of forces, and the debates at the Royal Academy of Sciences, constitutes for Jacquier and Le Seur the opportunity to prove the validity of a system which, through mathematics, claims to be universal. In their eyes, drawing inspiration from the principles of\nNewton\n, of which they published a critical edition three years earlier, with the aim of settling the interminable debates on the dome can be an important issue. In this, their approach meets the expectations of the Holy See, which wishes an indisputable solution. Their conclusion is categorical, and is, in this respect, a figure of expertise: \"everything else that we have heard planned for the desired restoration seems to us superfluous, useless or harmful.\" Convinced of the correctness of their \"system\", they refuse to \"review all the projects because it would be too long and useless.\"\nAs one might expect, architects reacted strongly to the criticisms by Jacquier, Le Seur and Boscovich, claiming that architects understood real situations while mathematicians only understood ideal theoretical situations. Pope Benedict XIV, however, sought the advice of another mathematician,\nGabriele Manfredi\n, in\n1743\n. In the same year he also sought advice from\nGiovanni Poleni\nwho, like Jacquier, Le Seur and\nBoscovich\n, proposed fitting large iron rings to strengthen the dome and the rings were fitted in\n1748\n.\nJacquier visited France in\n1744\nwriting back to Le Seur in January of that year\n[\n22\n]\n:-\nHere they esteem both of us more highly than they do in Rome.\nHe met\nAlexis Clairaut\nwho gave him an enthusiastic reception and arranged for him to be elected to the\nAcadémie des Sciences\n.\nClairaut\nwas friendly with many of the leading scientists and mathematicians in Paris, in particular with\nMaupertuis\nand\nD'Alembert\nwho Jacquier met.\nClairaut\nwas also very friendly with Voltaire and\nÉmilie du Châtelet\nand Jacquier spent two months in the summer of\n1744\nat the Chateau de Cirey in Cirey-sur-Blaise, Haute-Marne, the home of Voltaire and\nÉmilie du Châtelet\n. Jacquier liked\ndu Châtelet\n's\nFundamentals of Physics\nand had arranged for an Italian translation to be made which was being used at this time by\nLaura Bassi\n. The discussions between Jacquier and\ndu Châtelet\nled to her beginning her French translation of\nNewton\n's\nPrincipia\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n. Her two-volume translation and commentary was published in\n1759\nunder the title\nPrincipes Mathématiques de la Philosophie Naturelle\nⓉ\n(\nMathematical Principles of Natural Philosophy\n)\n.\nKing Charles-Emmanuel III of Sardinia offered Jacquier the chair of physics at the University of Turin in\n1745\n. Cardinal Valenti, Pope Benedict XIV's secretary of state, however, wanted to keep Jacquier in Rome and offered him the chair of experimental physics at La Sapienza. This Papal University had been founded in\n1303\nbut was only known as La Sapienza from the\n1650\ns. In\n1755\nJacquier published his Italian translation of\nBrook Taylor\n's\nNew principles\n, with additions, as\nElementi di perspettiva secondo li principii di Brook Taylor, con varii aggiunti\nⓉ\n(\nElements of perspective according to Brook Taylor's principles, with various additions\n)\n.\nIn\n1765\n, Philip, Duke of Parma\n(1720\n-\n1765)\n, asked Jacquier and Le Seur to come Parma to educate his son Ferdinand\n(1751\n-\n1802)\n. Philip died unexpectedly on\n18\nJuly\n1765\nin Alessandria, Italy but Jacquier and Le Seur still went to Parma teaching Ferdinand in the year\n1766\n-\n67\n. While there they co-authored the two-volume work\nElements du calcul integral\nⓉ\n(\nElements of integral calculus\n)\n(1768)\nwhich they dedicated to Ferdinand who had become Duke of Parma following the death of his father. They write in the Preface:-\nIt is customary to expose in the Prefaces, the preliminary notions of the subject that must be treated. We will not enter into this in detail, and we will limit ourselves to prescribing the knowledge that we require in those who will want to read these Elements.\nAlthough we have explained in the first Chapter the principles of the Differential Calculus, we have however only done it succinctly, and as much as it was necessary to lead to the Integral Calculus. It is therefore understood that one must, before reading this work, be exercised in differential calculus, and know how to handle it with ease. It is therefore even more necessary to have thoroughly studied the finite Calculus, and to have become very familiar with its use. Finally, our readers must be perfectly educated in Elementary Geometry, Conic Sections, and have some knowledge of the general theory of curves; nor should they ignore the doctrine of sequences, as it belongs to finite calculus. We are convinced that with these aids, anyone with good understanding for Calculation and the Sciences, will be able by themselves to understand our Work, and to overcome its difficulties, without the help of any Master.\nBut since we already have several Treatises on the Integral Calculus, you are entitled to ask us the reason for our work, and how this work differs from the others that have appeared. Among the different Treatises that we know, some seem to us too elementary, and not very suitable for making known this material; the others are deep and contain the most beautiful discoveries of this kind; but their illustrious authors are great men, who, occupied with the glory of invention, have thought little of the benefits to those who aspire to understand them.\nIt is from these considerations that we attempt, in the Work that we give to the Public, to put our readers within reach of understanding what is most sublime in the Calculus, by requiring no other preparations than those which we have just indicated.\nFrom the Trinità dei Monti, Jacquier conducted a correspondence with many of the leading mathematicians and scientists in Europe, including\nd'Alembert\n,\nClairaut\n,\nBézout\n,\nLalande\n,\nde l'Hôpital\n,\nMaupertuis\n, and\nMontucla\n. We have seen, however, that Jacquier did not spent his time completely within the Trinità dei Monti. He had many links to other leading French people in Rome and was very much a part of this society. For example the French painter Joseph-Marie Vien\n(1716\n-\n1809)\nwas appointed director of the Académie de France in Rome in\n1776\nand he sent his sons to be taught mathematics and Latin by Jacquier. He also went to the Palazzo De Carolis, where the French embassy was situated, to teach Sophie du Puy-Montbrun, the granddaughter of the French ambassador. He also taught Felix Francois Dorothée de Berton, comte de Crillon\n(1748\n-\n1820)\n.\nJacquier, however, was more involved in Roman society than his religious life might suggest. For example, he frequently visited the scholarly salons in Rome, especially that of Margherita Sparapani Gentili Boccapadule\n(1735\n-\n1820)\n. She was a highly educated woman who invited to her home the most cultured Italian and foreign men in Rome. Perhaps more surprising was his friendship with Giacomo Casanova. They corresponded about games of chance involving questions of probability. Their close friendship is evident, however, when Casanova's lifestyle led to him having to pawn one of his most elegant suits and Jacquier lent him money to repay the loan so that the suit would not be sold by the pawnbroker.\nThe Roman College was founded in Rome by Ignatius of Loyola in\n1551\nabout ten years after the founding of the Jesuits. It continued to be run by the Jesuits but, in\n1773\n, the Jesuit Order was suppressed. Teaching at the College was taken over by religious men of other Orders and at this time Jacquier was appointed as Professor of Mathematics.\nThe Pontifical Academy of Arcadia was a literary society founded in Rome in\n1690\n. It was not unusual for men of religion to be members although most of its members were nobles or artists. Jacquier was a member and gave orations to the Society. One such talk he gave in\n1780\nwas on the shape of the Earth.\nGalileo\nhad argued that the fact that the Earth was an oblate spheroid showed that it rotated, the flattening being cause by centrifugal forces. Jacquier argued, following the Roman Catholic doctrine at that time, that God could shape the static Earth any way he wished, so he could have chose to flatten the poles. Although there is no doubt that Jacquier was a devoted Catholic, one is left to wonder if he really believed in a geocentric solar system or whether he argued for it simply because he felt obliged to follow doctrine. Pope Benedict XIV approved the publication of\nGalileo\n's\nDialogo\nⓉ\n(\nDialogue concerning the two chief systems of the world - Ptolemaic and Copernican\n)\nin Padua in\n1744\nand removed the prohibition from the\nIndex\nagainst teaching the Earth's motion in\n1758\n. There is no direct evidence that Jacquier in any way influenced these decisions, but there is just the possibility that he might have done so.\nJacquier continued to live at the Trinità dei Monti and Johann Wolfgang von Goethe, the poet and playwright, visited him there in January\n1787\nwriting in his diary:-\nA few days ago I visited Father Jacquier, a Franciscan, at Trinità dei Monti. He is French by birth, known for his mathematical writings, old in years, very agreeable and intelligent. He knew the best men of his time, and even spent a few months with Voltaire, who affected him greatly.",
  "matematicos_citados_na_biografia": [
    "Newton",
    "Jean Louis Calandrini",
    "Calandrini",
    "D'Alembert",
    "Malebranche",
    "Royal Society",
    "Ruggero Boscovich",
    "Philippe de La Hire",
    "Gabriele Manfredi",
    "Giovanni Poleni",
    "Boscovich",
    "Alexis Clairaut",
    "Académie des Sciences",
    "Clairaut",
    "Maupertuis",
    "Émilie du Châtelet",
    "du Châtelet",
    "Laura Bassi",
    "Brook Taylor",
    "d'Alembert",
    "Bézout",
    "Lalande",
    "de l'Hôpital",
    "Montucla",
    "Galileo"
  ],
  "imagens": [
    "jacquier.jpg"
  ]
}