{
  "nome_completo": "Franz Adolph Taurinus",
  "nome_curto": "Franz Adolph Taurinus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taurinus/",
  "data_nascimento": "15 November 1794",
  "local_nascimento": "Bad König, German",
  "data_morte": "13 February 1874",
  "local_morte": "Cologne, Germany",
  "summary": "Franz Taurinus was a German mathematician best known for his work on non-Euclidean geometry.",
  "biografia": "Franz Adolph Taurinus\n's father was a court official working for the counts of Erbach-Schöneberg. His mother was Luise Juliane Schweikart who had a younger brother F K Schweikart, only fourteen years of age when Taurinus was born. F K Schweikart went on to become professor of law at the University of Königsberg and it is fair to say that Taurinus's uncle Schweikart played a major role in influencing his ideas and academic achievements.\nFollowing his uncle's academic discipline, Taurinus studied law at Heidelberg, Giessen and Göttingen. From\n1822\nhe lived in Cologne as a man of independent means able to devote himself entirely to research without students to teach. Two years before he went to live in Cologne his uncle became professor of law at the University of Königsberg. the two corresponded on mathematical topics and, largely due to Schweikart's influence, he began to investigate the problem of parallel lines and\nEuclid\n's fifth postulate:-\nThat, if a straight line falling on two straight lines make the interior angles on the same side less than two right angles, if produced indefinitely, meet on that side on which are the angles less than the two right angles.\nIn\n1697\nGirolamo\nSaccheri\nassumed the fifth postulate is false and attempted to derive a contradiction. Of course, although he did not intend it to be so, he was then studying\nnon-euclidean geometry\n. In\n1766\nLambert\nfollowed a similar line to\nSaccheri\n.\nLambert\nnoticed that, in this new geometry where the sum of the angles of a triangle was less than\n180\nq\n, the angle sum of a triangle increased as the area of the triangle decreased. Schweikart himself is famed for investigating this new geometry which he called astral geometry. This is described in\n[\n3\n]\n.\nTaurinus not only corresponded on mathematical topics with his uncle but he also corresponded with\nGauss\nabout his ideas on geometry. At first Taurinus tried to prove that Euclidean geometry was the only geometry but, in\n1826\n, he accepted the lack of contradiction in other geometries. He published\nTheorie der Parallellinien\nⓉ\n(\nTheory of parallelism\n)\nin Cologne in\n1825\nand in the following year he published\nGeometriae prima elementa\nⓉ\n(\nFirst elements of geometry\n)\nalso in Cologne.\nIn this last mentioned publication Taurinus accepts that a third system of geometry exists in which the sum of the angles of a triangle is less than\n180\nq\n. He called this geometry \"logarithmic-spherical geometry\" and he recognised the lack of a contradiction in this geometry as meaning that it was internally consistent. He had developed a non-euclidean trigonometry which he applied to a number of elementary problems.\nTaurinus came up with the important idea that elliptic geometry could be realised on the surface of a sphere, an idea taken up by\nRiemann\n. He also realised that there were an infinite number of non-euclidean geometries and this, Taurinus claimed, was highly significant. It showed that euclidean geometry held a unique dominating role. This is an interesting sideways move since his original aim had been to prove that euclidean geometry was the unique geometry. Finding that this was not so, he still wanted to demonstrate that euclidean geometry was \"the\" geometry.\nHaas writes in\n[\n1\n]\n:-\nTaurinus's works on the problem of parallel lines. like those of his uncle, Schweikart, represent a middle stage in the historical development of this problem between the efforts of\nSaccheri\nand\nLambert\n, on the one hand, and those of\nGauss\n,\nLobachevsky\n, and\nBolyai\n, on the other.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Saccheri",
    "non-euclidean geometry",
    "Lambert",
    "Gauss",
    "Riemann",
    "Lobachevsky",
    "Bolyai"
  ],
  "imagens": []
}