{
  "nome_completo": "František Wolf",
  "nome_curto": "František Wolf",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wolf_Frantisek/",
  "data_nascimento": "30 November 1904",
  "local_nascimento": "Prostejov, Moravia, Austro-Hungary (now Czech Republic)",
  "data_morte": "12 August 1989",
  "local_morte": "Berkeley, California, USA",
  "summary": "František Wolf was a Czech mathematician known for his contributions to trigonometry and mathematical analysis.",
  "biografia": "František Wolf\n's father was a maker of fine furniture. Frank was the eldest of his parents two children, having a sister four year younger. He was born in Prostejov, a town southwest of Olomouc, in the farming region of the fertile Haná Plain. Czechoslovakia did not exist at the time that František was born, for the declaration of the political union of the Czechs and Slovaks was not made until the Pittsburgh Convention in the United States on\n31\nMay\n1918\n. At this time František was fourteen years old and he had already become fascinated by science and mathematics. After completing his school education he entered the Charles University in Prague to study physics.\nAt the Charles University, Wolf excelled in his studies and he was awarded a gold medal and watch by Tomas Masaryk, the President of the new republic of Czechoslovakia. Tomas Masaryk's son, Jan Masaryk, was a personal friend of Wolf who was a strong supporter of the idea behind the new country. After obtaining his first degree in physics Wolf went to Masaryk University, Brno, to undertake research in mathematics. His thesis\nContribution à la théorie des series trigonométriques généralisées et des séries à fonctions orthogonales\nⓉ\n(\nContribution to the theory of generalized trigonometric series and series of orthogonal functions\n)\nwas supervised by Otakar Borvka, and he was awarded the degree Rerum Naturum Doctor in\n1928\n. Wolf then became a secondary school teacher and taught mathematics in schools until\n1937\nwhen he was appointed as a\nPrivatdozent\nat the Charles University in Prague.\nShortly after his appointment, Wolf travelled to England to study at Cambridge University with\nHardy\nand\nLittlewood\n. As a result Wolf published two papers in\n1939\n, one in the\nJournal of the London Mathematical Society\nand the other in the\nProceedings of the London Mathematical Society\n. The first was\nAn extension of the Phragmén-\nLindelöf\ntheorem\nwhile the second was\nOn summable trigonometrical series: an extension of uniqueness theorems\n. After this visit to England Wolf returned to Prague in March\n1938\nas Germany was annexing Austria. The serious political situation saw Czechoslovakia, whose leaders did not favour a German takeover, begin drafting men into the army and Wolf was among them. He was still in the Czechoslovak army when German troops, essentially with the approval of the leading European powers, marched into the country towards the end of\n1938\n. Wolf's views made it impossible for him to remain under German occupation and he was fortunate to have an invitation from the\nMittag-Leffler\nInstitute in Stockholm. The German occupiers allowed him to leave the country for a period of three weeks to give a lecture course at the\nMittag-Leffler\nInstitute. However, he did not return after the three weeks, and instead joined the Swedish underground. He remained there until\n1941\n, surviving on a small grant from the Swedish Government.\nIn\n1941\nWolf received an invitation to lecture at Macalester College in Saint Paul, Minnesota, in the United States. Getting from Sweden to the United States looked difficult with World War II at its height, so Wolf set off east travelling on the Trans Siberian Railway, then crossing Japan, before landing on the west coast of the United States. On his way to Saint Paul, he passed through Berkeley where he met\nGriffith C Evans\n, the Head of the Mathematics Department.\nEvans\noffered Wolf a position at Berkeley, but he felt he had to honour his commitment to Macalester College and duly went there for the one year post before returning to Berkeley as an Instructor in Mathematics in\n1942\n. However, Wolf's first\n1941\nvisit to Berkeley was significant in another way for there he met a young botanist Myrtle Richey; they married in\n1945\nand their son Thomas Wolf was born two years later. William G Bade, Murray H Protter, and Angus E Taylor write in their obituary of Wolf:-\nFrank learned to share Myrtle's love of wild flowers, and as a family they made uncounted trips in the spring and summer to seek them out. A summer cabin at Clipper Mills facilitated these activities. They established their home in the Berkeley hills, where Frank loved to walk. Many friends and former students will remember the hospitality of their home and their kindness and interest toward young people and colleagues.\nWolf's paper\nThe\nPoisson\nintegral. A study in the uniqueness of harmonic functions\nhad been published by\nActa Mathematica\nin\n1941\n.\nEvans\nreviewed the paper:-\nIt is known that a harmonic function may have zero boundary values on the circumference of a circle\n(\nfor approach along radii, etc.\n)\nand still not vanish within the circle. ...\n[\nWolf's\n]\npaper is a study of the restrictions on the order of growth of a harmonic function, as a function of r, which are sufficient to insure uniqueness, and, in particular, uniqueness of representation in terms of the\nPoisson\nintegral. By means of conformal representation, simply connected domains with rectifiable boundaries are reduced to the circle.\nIn\n1947\nWolf published\nContributions to a theory of summability of trigonometric integrals\nwhich collected together many of his earlier results in the area:-\nThere are seven chapters. In Chapter I\n[\nWolf\n]\ngives some preliminary results and in Chapter II a theory of generalized integrals required in the sequel. In Chapter III he gives two fundamental theorems. The first gives, under certain rather complex conditions, inversion formulae for trigonometric integrals and the second asserts that under the same conditions the difference between the given trigonometric integral and the trigonometric series of a certain function will be uniformly summable to zero throughout a given interval. Chapter IV deals with trigonometric integrals summable over sets of positive measure and extends\nKuttner\n's theorem and some similar results of\nMarcinkiewicz\nand\nZygmund\n. In chapter V he extends some theorems of\nHille\n,\nOfford\nand\nTamarkin\n. In Chapter VI he gives some results on the inversion of order of integration in a trigonometric integral equivalent to the integration of trigonometric series term by term. Finally in the last chapter there are some very general inversion theorems which the author asserts will yield every known inversion theorem for trigonometric integrals.\nIn\n1951\nWolf and\nBeckenbach\nfounded the\nPacific Journal of Mathematics\n, a major international mathematical research journal sponsored by a dozen or more West Coast universities. His efforts contributed to it becoming the major research journal that it is today. William G Bade, Murray H Protter, and Angus E Taylor describe the research conducted by Wolf after establishing himself at Berkeley:-\nSoon after he came to Berkeley, Frank's mathematical interests took a change in direction as he began to study the perturbation of linear operators. This is the theory of the behaviour of the spectral properties of an operator under small changes in the operator. Such perturbation results are important, for example, in quantum mechanics where physical phenomena are interpreted through linear operators on\nHilbert space\n. Consideration of the\nSchrödinger\nequation leads to perturbation problems for partial differential operators, where the change may occur in the coefficients of the operator or in boundary conditions. Frank's most influential papers were probably those concerned with the analytical perturbation of operators on Banach spaces and his studies on the essential spectrum of certain singular elliptic differential operators.\nThe obituary also describes Wolf's interests outside mathematics:-\nFrank Wolf was a person of personal warmth and charm. He had a great interest in people and in cultural activities. He especially loved music and was accomplished on the piano and violin. For many years he served as a member of the Committee on Arts and Lectures which brought performing artists to the campus. ... Always among his strongest interests was the well-being of Czechoslovakia. He had found many Czech immigrants in Minnesota, and he was a strong supporter of the Czech community in the Bay Area. During the founding of the United Nations in San Francisco in\n1945\n, a dispute arose in the Czechoslovak delegation, and Frank was chosen on one occasion to address the gathering on behalf of his country.\nWolf retired in\n1972\n, and following that he went to the University of Valle in Guatemala where he helped set up a graduate programme. He suffered an accident in his garden, having a fall which badly affected his health. From that time on his health declined leading eventually to his death.",
  "matematicos_citados_na_biografia": [
    "Privatdozent",
    "Hardy",
    "Littlewood",
    "Lindelöf",
    "Mittag-Leffler",
    "Griffith C Evans",
    "Evans",
    "Poisson",
    "Kuttner",
    "Marcinkiewicz",
    "Zygmund",
    "Hille",
    "Offord",
    "Tamarkin",
    "Beckenbach",
    "Hilbert space",
    "Schrödinger"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}