{
  "nome_completo": "Francesco Maria Grimaldi",
  "nome_curto": "Francesco Grimaldi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grimaldi/",
  "data_nascimento": "2 April 1618",
  "local_nascimento": "Bologna, Papal States (now Italy)",
  "data_morte": "28 December 1663",
  "local_morte": "Bologna, Papal States (now Italy)",
  "summary": "Francesco Grimaldi was an Italian Jesuit priest, mathematician and physicist who worked in mechanics, philosophy, astronomy and optics.",
  "biografia": "Francesco Grimaldi\nwas born into a well-off family. His father, Paride Grimaldi, was a silk merchant of noble birth who had moved to Bologna in\n1589\n. He married in Bologna, but the couple were childless when his wife died. In about\n1614\n, Paride Grimaldi married his second wife, Anna Cattani, who owned a chemist shop which she had inherited from her grandfather. Francesco was the fourth of his parents six sons, five of whom survived. He had two older brothers\n(\none child having died\n)\n, the one that he was closest to being Vincenzo Maria Grimaldi who was almost exactly one year older. When Francesco was still quite young, his father died and, at that time, his mother took over running the family chemist shop. Francesco and his brother Vincenzo both joined the Society of Jesus\n(\nthe Jesuits\n)\non\n18\nMarch\n1632\n.\nWe do not know all the places where Grimaldi studied, in particular we are unsure where he spent the two years\n1632\n-\n34\nalthough it was most likely in Novellara. We know for certain that in\n1634\nhe was in Novellara, about\n20\nkm north of Reggio dell'Emilia, where he lived in the house which had been set up in\n1571\nfor training Jesuit novices. In\n1635\nhe went to Parma, just over\n30\nkm to the west of Novellara, where he began his study of philosophy. The Jesuits ran three educational establishments in Parma, the university, a college for educating the sons of the nobility, and a Jesuit College, established around\n1600\n, which Grimaldi attended. In addition to advanced courses in philosophy and theology, the College provided lower level courses in grammar and rhetoric. However, he was in Parma for less than a year before he was transferred to Bologna to complete his first year of study of philosophy. His second year studying philosophy,\n1636\n-\n37\n, was spent at Ferrara before he returned to Bologna to finish the three year course in session\n1637\n-\n38\n. Having completed the three year philosophy course, he taught rhetoric and humanities in the College of Santa Lucia at Bologna for four years from\n1638\nto\n1642\n. Grimaldi was taught by\nGiovanni Battista Riccioli\nin Parma in\n1635\nand both had moved to Bologna at the same time in\n1636\n. However, it was when Grimaldi returned to Bologna and was teaching there in\n1640\nthat he began assisting\nRiccioli\nwith experiments. Grimaldi, working under instruction from\nRiccioli\n, dropped weights from the Asinelli tower and timed their fall using a pendulum.\nRiccioli\nwas hoping that the experiments conducted by Grimaldi would refute\nGalileo\n's theories, which in some sense they did. Let us look in a little more detail at the experiment.\nFirst, Grimaldi and\nRiccioli\ncalibrated a pendulum by getting it to swing for\n24\nhours\n(\nmeasured by the star Arcturus crossing the meridian line\n)\n. They used this\n3\nfoot pendulum to calibrate a shorter pendulum to use in timing. Then Grimaldi dropped balls of wood and of lead from various heights from the Asinelli tower. A nice addition to the accuracy was obtained by getting a group of musical monks to chant in time with the swinging pendulum to aid with the timing. The experiment did not confirm\nGalileo\n's result for, as one might expect, the lead balls reached the ground before the wood ones in all the experiments using different heights on the tower\n[\n11\n]\n:-\nAs everyone had expected,\nGalileo\nwas disproved. The lead ball always hit the ground before the wooden one when they fell from the same height. The discrepancy between the experiment and\nGalileo\n's claim that they reached the bottom simultaneously was so great that Grimaldi supposed that\nGalileo\nmust have known about it, but suppressed his knowledge in order to secure a proposition dearer to him than truth.\nOver the next few years Grimaldi continued studying but also worked, particularly on astronomical investigations, with\nRiccioli\n. He studied theology between\n1642\nand\n1645\ngoing on to undertake further research on philosophy which led to him being awarded a doctorate in\n1647\n. He then began to teach philosophy but, after less than a year, he had changed topics and began to teach mathematics. It is not entirely clear what prompted the change. Many historians suggest that the change of topic was a result of health problems, and he found teaching mathematics less demanding than teaching philosophy. However, this seems somewhat unlikely and it would appear that he may have been eased out of teaching philosophy due to his views being too \"modern\". Remember that he was still within the Jesuit educational system. Certainly\nRiccioli\n, who wrote an obituary of Grimaldi, states clearly that:-\n... Grimaldi was well prepared to teach all branches of mathematics: geometry, optics, gnomonics, statics, geography, astronomy and celestial mechanics.\nGrimaldi was ordained a priest on\n1\nMay\n1651\n. In the same year\nRiccioli\npublished\nAlmagestum novum\nⓉ\n(\nA new 'Almagest'\n)\nin which he credited Grimaldi with being the source of over\n40\ndifferent experiments. For example, the experiment of dropping weights from the Asinelli tower is described, and an experiment firing a cannon ball in different directions. This last experiment is quoted as follows\n[\n11\n]\n:-\nThe argument against the Diurnal and Annual Motion of the Earth devised by Father Francisco Maria Grimaldi based on a cannon ball fired into the North, and into the East and West.\nAs another example, we quote again from\nAlmagestum novum\nⓉ\n(\nA new 'Almagest'\n)\n[\n11\n]\n:-\nP Francisco Maria Grimaldi and I have developed a method for reliably measuring the apparent diameters of the stars by means of a telescope.\nOf course, this \"reliable method\" is no more than a property of the telescope and is measuring the brightness rather than the diameter of the stars. Believing that they were measuring diameters caused them, and others at this time, to have completely incorrect idea of the actual sizes of the stars. Grimaldi and\nRiccioli\n's astronomical observations had been made in an observatory set up at the College of Santa Lucia in Bologna. In the\nAlmagestum novum\nRiccioli\nthanks the \"diligent, prudent, and faithful\" Grimaldi. He says that he was too old to conduct the required late-night observations himself, so he had to rely on his young collaborator Grimaldi. Another important chapter in\nAlmagestum novum\nⓉ\n(\nA new 'Almagest'\n)\npresented maps of the moon's surface made by Grimaldi and containing names for the major features on the surface, named after famous scientists\n(\nparticularly astronomers\n)\n, which have been adopted today\n[\n1\n]\n:-\nAn especially noteworthy contribution was his selenograph of the moon, a composite from telescopic observations of many phases, accurate and correct enough so that he must have used crossed hairs and a micrometer with his eyepiece.\nAnother project on which Grimaldi worked was a survey, using triangulation, to determine a meridian line for Bologna. Again he collaborated on this with\nRiccioli\nbut, in addition, he was assisted by Ovidio Montalbini\n(1601\n-\n1672)\n, a professor at Bologna University and the custodian of its science museum, and\nGiovanni Domenico Cassini\n, who had been appointed as professor of mathematics at the University of Bologna in\n1650\nfollowing the death of\nBonaventura Cavalieri\n. The project was completed by\n1655\nand the results published, again by\nRiccioli\n, in\nGeographiae Hydrographiae Reformatae\nⓉ\n(\nGeography and dydrography reformed\n)\n(1661)\n. Grimaldi did a considerable amount of observing and the data from his observations of stars was published in\nRiccioli\n's\nAstronomia Reformata\nⓉ\n(\nAstronomy reformed\n)\n(1665)\n.\nNow although we have given quite a lot of information about Grimaldi's work, everything we have mentioned so far was published in works by\nRiccioli\n. In fact Grimaldi has no works published under his own name during his lifetime. He died of a sudden illness at the age of\n45\nbut he had spent the last ten years of his life undertaking remarkable research on the properties of light. His work on light was so novel that it had a much smaller impact than one might have expected. He completed writing\nPhysico-Mathesis de Lumine\nshortly before his death and it was published in\n1665\n. The work is an attempt by Grimaldi to determine whether light is a substance or whether it is a quality of another substance. He does this in a rather unusual way. The treatise consists of two books, the first puts forward arguments that light is a substance, although it does sometimes put the opposing view, while the second book argues that light is a quality of another substance. Grimaldi makes it clear that his own view is that light is not a substance and he believes that the arguments in the second book make it probable that light is a quality. Both books, however, have a common feature; they both argue against a corpuscular theory of light.\nBook\n1\nbegins with a description of Grimaldi's most famous discovery, namely the diffraction of light. He created a pinhole through which he allowed light from the sun to enter a darkened room and fall on a screen. The screen was at an angle so that the light produced a elliptical image on the screen. He placed a thin rod in the path of the light and measured the size of the shadow on the screen. He discovered that the shadow was larger than it should have been given conical nature of the beam. From this he argued that this effect was impossible if light consisted of corpuscles so light must have a fluid form which bent round the object. He also noticed coloured bands near to the shadow of the rod. Each band had three components, a white broad central part with a narrow violet band on the side nearest the shadow with a narrow red band on its side furthest from the shadow. He then described what effect was produced by placing obstacles of a different shape from the rod in the path of the cone of light. The name diffraction was chosen by Grimaldi because the effect reminded him of how a flowing fluid splits apart when a thin stick is placed in its path - the Latin diffractio means to \"break apart\". After treating diffraction, he looked at interference by allowing the light to enter the darkened room through two pinholes and observing where the images overlapped on the screen. He announced with the following proposition:-\nThat a body actually enlightened may become obscure by adding new light to that which it has already received.\nNext Grimaldi treated reflection, refraction, and the propagation of light. What we have so far described takes up about one half of the first book. The second half of this book is concerned with colours and the rainbow.\nPerhaps surprisingly, Grimaldi's treatise was little read but his important results on diffraction were made widely known by others. A Rupert Hall writes\n[\n13\n]\n:-\nGrimaldi's experiments and ideas were disseminated by others, not least by the Lyon Jesuit\nHonoré Fabri\n(1607\n-\n88)\n, a man whose writings, especially those on pure mathematics, were well known.\nIsaac Newton\n, by his own affirmation, learnt of the diffraction effect from the first dialogue in\nFabri\n's 'Dialogi physici'\n(1669)\n.\nHonoré Fabri\n's\nDialogi physici sex quorum primum est de Lumine\nⓉ\n(\nSix dialogues on physics: the first is on Light\n)\nhas as its first dialogue\n96\npages containing the description of Grimaldi's experiments.\nFabri\n, however, did not believe Grimaldi's \"explanation\" of the results obtained and attempted to give his own interpretation. The importance of Grimaldi's experiments in influencing the work of\nNewton\nis discussed by Roger Stuewer in\n[\n15\n]\n. It is worth noting that Grimaldi's attempt to explain diffraction was incorrect, as was the attempt of every scientist until Joseph von Fraunhofer\n(1787\n-\n1826)\nin the\n19\nth\ncentury.",
  "matematicos_citados_na_biografia": [
    "Giovanni Battista Riccioli",
    "Riccioli",
    "Galileo",
    "Giovanni Domenico Cassini",
    "Bonaventura Cavalieri",
    "Honoré Fabri",
    "Isaac Newton",
    "Fabri",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}