{
  "nome_completo": "Franz Carl Joseph Mertens",
  "nome_curto": "Franz Mertens",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mertens/",
  "data_nascimento": "20 March 1840",
  "local_nascimento": "Schroda, Posen, Prussia (now Środa Wielkopolska, Poland)",
  "data_morte": "5 March 1927",
  "local_morte": "Vienna, Austria",
  "summary": "Franz Mertens was a Polish-born mathematician who made contributions to a wide variety of areas. He formulated the Mertens conjecture which ( had it been true ) would have implied the Riemann Hypothesis.",
  "biografia": "Franz Mertens\n' father was Julius Mertens and his mother was Henrica de Malignon. He was born into a partitioned Poland, the third of the three partitions took place in\n1795\nand split Poland between Russia, Prussia and Austria. Sroda, the village in which Mertens was born, was close to Poznań in Prussia. The district had a long history of a mixed German and Polish population, but after it was annexed to Prussia there were further attempts to increase its German nature. Mertens' family naturally identified with the German aspect of the country while for those of Polish culture the years of the\n19\nth\ncentury were a continual battle to struggle for their identity. He was known, however, both by the German version of his name which is Franz and the Polish version which is Franciszek.\nMertens completed his university studies at the University of Berlin where he attended lectures by\nWeierstrass\n,\nKronecker\nand\nKummer\n. This was the \"golden period\" for mathematics in Berlin and gave Mertens the best possible mathematical foundations. In\n1865\nhe obtained his doctorate with a dissertation on\npotential theory\nDe functione potentiali duarum ellipsoidium homogenearum\nⓉ\n(\nThe  potential function of two homogeneous ellipsoids\n)\n. His advisors had been\nKummer\nand\nKronecker\n.\nHe worked first in the Jagiellonian University at Kraców, at this time part of the Austrian region of Poland, being appointed as an extraordinary professor in\n1865\n, then promoted to an ordinary professor in\n1870\n. He was called to the Polytechnic in Graz in Austria in\n1884\nthen, remaining in Austria, from\n1894\nhe was an ordinary professor of mathematics at the University of Vienna. He retired in\n1911\nbut, being made Professor Emeritus, he continued to give lectures. He supervised the doctoral theses of a number of excellent mathematicians while in Vienna, in particular\nErnst Fischer\nwho received his doctorate in\n1899\n, and\nEduard Helly\nwho was awarded his doctorate in\n1907\n. He also lectured to\nSchrödinger\nin mathematics at around the same time. It is worth noting that, in\n1882\n, Mertens was offered the chair at Halle left vacant after the death of\nHeine\n. He had been the third choice for this chair but after\nDedekind\nand\nHeinrich Weber\nturned it down, Mertens\n(\nwho was at that time in Cracow\n)\nalso turned it down.\nMertens worked on a number of different topics including potential theory, geometrical applications to\ndeterminants\n, algebra and\nanalytic number theory\n, publishing\n126\npapers. Bruce C Berndt writes:-\nMertens is perhaps best known for his determination of the sign of\nGauss\nsums, his work on the irreducibility of the cyclotomic equation, and the hypothesis which bears his name.\nMany people are aware of Mertens contributions since his elementary proof of the\nDirichlet\ntheorem appears in most modern textbooks. However he made many deep contributions including Mertens' theorems, three results in number theory related to the density of the primes. He proved these results using\nChebyshev\n's theorem, a weak version of the\nprime number theorem\n. Merten's conjectures appears in his paper\nÜber eine zahlentheoretische Funktion\nⓉ\n(\nOn a number theoretic function\n)\n(1897)\npublished in\nAkademie Wissenschaftlicher Wien Mathematik-Naturlich Kleine Sitzungsber\n. Here Mertens defines\nM\n(\nn\n)\nM(n)\nM\n(\nn\n)\nto be the sum of the numbers\nm\n(\ni\n)\nm(i)\nm\n(\ni\n)\nwhere\ni\ni\ni\nruns from\n1\nto\nn\nn\nn\nand where\nm\nm\nm\nis the Möbius function. It was known that there is no\nx\nx\nx\nwith\nM\n(\nx\n)\n>\nx\nM(x) > x\nM\n(\nx\n)\n>\nx\nbut Mertens' conjecture was stronger, namely that there is no\nx\nx\nx\nwith\nM\n(\nx\n)\n>\n√\nx\nM(x) > √x\nM\n(\nx\n)\n>\n√\nx\n. The result is important since a proof of Mertens' conjecture would imply the truth of the\nRiemann hypothesis\n. The conjecture stood for nearly\n100\nyears before it was proved false in\n1985\nby A M Odlyzko and H J J te Riele.\nAmong Mertens other papers we mention:\nInvariante Gebilde ternärer Formen\nⓉ\n(\nInvariant structure of ternary forms\n)\n(1887)\n;\nInvariante Gebilde quaternärer Formen\nⓉ\n(\nInvariant structure of quaternary forms\n)\n(1889)\n;\nDirichletscher Reihen\nⓉ\n(\nDirichlet series\n)\n(1895)\n;\nZur linearen Transformation der q-Reihen\nⓉ\n(\nOn linear transformation of q-series\n)\n(1901)\n; and\nBeweis der Galois'schen Fundamentalsatzes\nⓉ\n(\nProof of Galois's Fundamental Theorem\n)\n(1902)\n.",
  "matematicos_citados_na_biografia": [
    "Weierstrass",
    "Kronecker",
    "Kummer",
    "potential theory",
    "Ernst Fischer",
    "Eduard Helly",
    "Schrödinger",
    "Heine",
    "Dedekind",
    "Heinrich Weber",
    "determinants",
    "analytic number theory",
    "Gauss",
    "Dirichlet",
    "Chebyshev",
    "prime number theorem",
    "Riemann hypothesis"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}