{
  "nome_completo": "Frank Smithies",
  "nome_curto": "Frank Smithies",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smithies/",
  "data_nascimento": "10 March 1912",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "16 November 2002",
  "local_morte": "Cambridge, England",
  "summary": "Frank Smithies was a Scottish mathematician who worked on integral equations, functional analysis, and the history of mathematics.",
  "biografia": "Frank Smithies\n' parents were Frank Smithies, who was born in Yorkshire, and Mary Blakemore who was born in West Lothian in Scotland. Frank Smithies Senior was an engineer who was a staunch trade union man with strong Socialist views. Mary was a trained cook and also had Socialist views. In fact it was their Socialist involvement which led to their meeting after Frank Senior moved to Edinburgh in\n1907\n. Frank Junior was the eldest of his parents two children, having a sister Violet four years his junior. Frank, the subject of this biography, was given a wide range of interests by his father before he even began to attend primary school. For example his father gave him a love of botany and geography which he had throughout his life.\nIn\n1917\nFrank, already well taught by his parents, entered primary school\n[\n4\n]\n:-\nWith a mental age far ahead of his actual years, however, he was rather a misfit in school; he did not easily get on with other children, and matters were not helped by frequent, and at times prolonged, absences due to ill health.\nIn\n1921\nhe struck lucky since he was accepted by W H Roberts, a man who loved the challenge of teaching those who did not fit into the usual educational set-up. Roberts was so impressed by Frank that he accepted him free of charge. This proved especially beneficial since, around this time, Frank's father was black-listed by engineering firms because of his trade union activities and so could not get a job. Roberts did an excellent job and ensured that Frank was in a good position to take the entrance examination for Edinburgh University in March\n1927\n. He passed the examination and matriculated at Edinburgh University in October\n1927\n.\nWith his father unable to obtain work, things were very difficult for Smithies in his first year at Edinburgh University, but it became easier in his second year when he was awarded a Spence Bursary. He graduated in\n1931\nas the top mathematics student in his year, winning the\nNapier\nMedal, the Gadgil Prize, and a John Edward Baxter bursary which paid for two further years study at Cambridge. He had also won a scholarship for St John's College, and he entered the College to study for the Mathematical tripos in October\n1931\n. There he took courses by\nG H Hardy\non\nFourier analysis\n,\nJohn Whittaker\non\nintegral equations\n, and\nEbenezer Cunningham\non mechanics. In fact this was the second member of the Whittaker family who had lectured to Smithies for he had studied the history of mathematics with\nJohn Whittaker\n's father\nEdmund Whittaker\nwhile at Edinburgh University. This is particularly significant since Smithies developed a love of the history of mathematics and made many excellent contributions which we discuss towards the end of this biography.\nSmithies graduated in\n1933\nand began research on integral equations with\nHardy\nat Cambridge. He was influenced, by reading books by\nBanach\nand\nStone\n, and attending lectures by\nCourant\nand\nvon Neumann\n, to become interested in functional analysis despite\nHardy\n's dislike of abstract mathematics. He won the Rayleigh Prize in\n1935\nfor an essay on differential equations of fractional order, and was awarded his doctorate for his thesis\nThe Theory Of Linear Integral Equation\nwhich he submitted to the University of Cambridge in\n1936\n.\nFunded by a Carnegie Fellowship and a St John's College studentship, Smithies then spent two years at the Institute for Advanced Study at Princeton. There he did some joint work with\nvon Neumann\nand some with\nR P Boas\n.  One of the notable results of a collaboration with\nBoas\nwas the article\nContribution to the Mathematical Theory of Big Game Hunting\n. See\nTHIS LINK\n. After returning to Cambridge in\n1938\n, Smithies taught at St John's College and continued his research. However from the summer of\n1940\nhe was engaged in war work at the Ministry of Supply. His work there was very varied, involving theoretical and experimental work on anti-aircraft guns, statistical work on quality control, and the responsibility for \"miscellaneous mathematical problems\". In\n1942\nhe helped set up the Advisory Service on Statistical Quality Control in the Ministry of Supply and about the same time he met Nora Arone who had just started working for the Ministry. Smithies took up his duties again at St John's College in September\n1945\nand three months later he married Nora.\nSmithies early work was on integral equations and in\n1958\nhis text\nIntegral equations\nwas published by\nCambridge University Press\nin their Cambridge Tracts in Mathematics and Mathematical Physics Series. He states in the preface that:-\n... the present work is intended as a successor to\nMaxime B么cher\n's tract, \"An introduction to the study of integral equations\"\n(\nUniversity Press, Cambridge,\n1909)\n.\nAs I A Barnett points out in a review:-\nThis remark is indeed an understatement, since the present work is much more than a continuation of\nB么cher\n's treatment, good as it was fifty years ago. It must have taken a tremendous amount of reading and sifting of the enormous literature to give a modernized version of the theory in this little volume of scarcely more than\n150\npages.\nAlthough he published little in the way of original research in\nfunctional analysis\nafter\n1940\n, Smithies was the greatest influence on the development of the subject in Britain. This was through his teaching at Cambridge, the large number of research students he guided into the subject, and the lectures he gave around the country. Given this leading role, it is fascinating to read his account in\n[\n5\n]\nof how the subject developed, and in particular the role of linear operators in this development. Smithies looks in detail at the development of the concept of an adjoint operator in the years before the\nHahn\n-\nBanach\ntheorem.\nHis teaching at Cambridge is discussed in\n[\n4\n]\n:-\nIn his teaching at all levels Smithies was consientious and meticulous. ... His lectures, at both undergraduate and postgraduate level, were a source of inspiration - not, perhaps, in the conventional sense as a result of charismatic presentation, but rather because his excellent judgement as to choice of material, combined with exceptional clarity of exposition, allowed the subject matter to speak for itself.\nAfter Smithies retired in\n1979\nhe began to take an interest in the history of mathematics, which he had from his undergraduate days, to a more serious level. He undertook some excellent historical research, publishing a number of important works. In fact he expressed a certain sadness that he had not taken up research in this area much earlier in his life. It was work which he simply adored. In fact he had published\nWeierstrass's theory of the real numbers\nin\n1975\nbefore he retired. It is an interesting account which first shows how\nWeierstrass\nconstructed the rational numbers from the natural numbers. It then shows that essentially the same technique allowed\nWeierstrass\nto construct the real numbers from the rationals. In\n1982\nSmithies published the paper\nThe background to Cauchy's definition of the integral\n. This was followed by\nCauchy's conception of rigour in analysis\n[\n6\n]\nin\n1986\nand finally in\n1997\nby the masterly work\nCauchy and the creation of complex function theory\n[\n2\n]\n. Smithies last paper was\nA forgotten paper on the fundamental theorem of algebra\npublished in the\nNotes and Records of the Royal Society of London\nin\n2000\n. Let us end this description of Smithies historical work by quoting his own summary of this paper:-\nIn\n1798\n, there appeared in the Philosophical Transactions of the Royal Society a paper by James Wood, purporting to prove the fundamental theorem of algebra, to the effect that every non-constant polynomial with real coefficients has at least one real or complex zero. Since the first generally accepted proof of this result was given by\nGauss\nin\n1799\n, Wood's paper deserves careful examination. After giving a brief outline of Wood's career, I describe the argument of his paper. His proof turns out to be incomplete as it stands, but it contains an original idea, which was to be used later, in the same context, by\nvon Staudt\n,\nGordan\nand others, without knowledge of Wood's work. After putting Wood's work in context, I conclude by showing how his idea can be used to prove the complex form of the fundamental theorem of algebra, stating that every non-constant polynomial with complex coefficients has at least one zero in the complex field.\nSmithies' wife Nora died in\n1987\nafter a long illness. His sister Violet, with whom he had kept in close contact throughout his life, died two years later\n[\n4\n]\n:-\nAlthough physically rather frail during his last few years, Smithies remained mentally alert until the end. He died after a brief illness ...",
  "matematicos_citados_na_biografia": [
    "Napier",
    "G H Hardy",
    "Fourier analysis",
    "John Whittaker",
    "integral equations",
    "Ebenezer Cunningham",
    "Edmund Whittaker",
    "Hardy",
    "Banach",
    "Stone",
    "Courant",
    "von Neumann",
    "R P Boas",
    "Boas",
    "THIS LINK",
    "Maxime B么cher",
    "B么cher",
    "functional analysis",
    "Hahn",
    "Weierstrass",
    "Gauss",
    "von Staudt",
    "Gordan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}