{
  "nome_completo": "Frances Hardcastle",
  "nome_curto": "Frances Hardcastle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hardcastle/",
  "data_nascimento": "13 August 1866",
  "local_nascimento": "Writtle, Essex, England",
  "data_morte": "26 December 1941",
  "local_morte": "Cambridge, England",
  "summary": "Frances Hardcastle was an English mathematician who held fellowships in the United States. She studied point groups and wrote some important works. She also was a major figure in the Women's Suffrage movement and was secretary of the National Union of Women's Suffrage Societies.",
  "biografia": "Frances Hardcastle\nwas the daughter of Henry Hardcastle\n(1840\n-\n1922)\nand Maria Sophie Herschel\n(1839\n-\n1922)\n. Henry Hardcastle was the only son of Joseph Alfred Hardcastle, M.P. for Bury St Edmunds, and Frances Lambirth. Henry graduated from Trinity College, Cambridge and became a barrister at law in practice. He married Maria Sophie Herschel on\n12\nOctober\n1865\nat the Parish Church, Hawkhurst, Kent. Maria Sophie Herschel was the fourth daughter of\nJohn Herschel\nand Margaret Brodie Stewart\n(1810\n-\n1884)\n. Henry and Maria Sophie Hardcastle had eight children: Frances Hardcastle\n(1866\n-\n1941)\n, the subject of this biography; Alice Louisa Beatrice Hardcastle\n(1867\n-\n1945)\n; Joseph Alfred Hardcastle\n(1868\n-\n1917)\n; John Herschel Hardcastle\n(1870\n-\n1937)\n; Mira Francisca Hardcastle\n(1871\n-\n1957)\n; Alexander Hardcastle\n(1872\n-\n1933)\n; Henry Robert Hardcastle\n(1874\n-\n1956)\n; Eleanor Constance Hardcastle\n(1879\n-\n1969)\n. Frances was baptised on\n9\nSeptember\n1866\nin All Saints Church, Writtle.\nLet us say a little at this point about Frances's four brothers. Joseph Alfred Hardcastle won the Gold Medal for Mathematics at Harrow, studied at Trinity College, Cambridge but had to give up because of ill health. He became an astronomer and lectured and taught pupils. He became secretary of the British Astronomical Association. John Herschel Hardcastle received his commission in the Royal Regiment of Artillery, studied at the Ordnance College, Woolwich under\nGeorge Greenhill\n, and undertook research on Ballistic Tables. Alexander Hardcastle joined the army, served with the Royal Engineers in the Boer War, then retired to Sicily where he worked restoring a Doric temple. Henry Robert Hardcastle became a clergyman. He went to Sicily with his brother Alexander.\nIn\n1869\nthe family moved to Pakenham, Suffolk, about\n6\nkm north east of Bury St Edmunds, where they were living at the time of the\n1871\ncensus. The census records show that family were living at Nether Hall, owned by Joseph Alfred Hardcastle, M.P. from\n1865\nto\n1873\n, and consisted of Henry and Maria Sophie Hardcastle, and their four eldest children. They have six servants, a butler, a cook, a nurse, a nursemaid, a housemaid and an under nursemaid. At the time of the\n1881\ncensus, Frances and Alice Louisa Beatrice were boarding with Pauline Gerrard, a teacher of languages, and her assistant Elizabeth Thomas, a teacher of English, in Dudley Road, Tonbridge, Kent. Both girls were scholars being educated privately. At this time their parents were living at\n38\nEaton Square, London with two of their sons and two of their daughters.\nHardcastle entered Girton College, Cambridge in\n1888\nto study the mathematical tripos. At this time women could attend lectures at Cambridge, and since\n1880\nthey had been allowed to sit the examinations, but could not graduate. In\n1891\nshe sat Part I of the mathematical tripos examinations and was ranked as second class. She continued to study Part II of the mathematical tripos and, in\n1891\n, she was ranked Class II, Division\n3\n, in the examinations. Hardcastle then travelled to the United States, sailing on the ship\nBerlin\nfrom Liverpool to New York arriving\n1\nOctober\n1892\n. From New York she went to Bryn Mawr College, Pennsylvania where she worked as a graduate student advised by\nCharlotte Angas Scott\n. While at Bryn Mawr, Hardcastle translated\nFelix Klein\n's work\nÜber Riemanns Theorie der algebraischen Functionen und ihrer Integrale\nⓉ\n(\nOn Riemann's theory of algebraic functions and their integrals\n)\ninto English. The book was published in\n1893\nunder the title\nOn Riemann's Theory of Algebraic Functions and Their Integrals: A Supplement to the Usual Treatises\n. Hardcastle added the following Translator's Note, dated\n1\nJune\n1893\n:-\nThe aim of this translation is to reproduce, as far as possible, the ideas and style of the original in idiomatic English, rather than to give a literal rendering of its contents. Even the verbal deviations, however, are few in number. So little has been written in English on the subject that a standard set of technical terms as yet hardly exists. Where there was any choice between equivalent words, I have followed the usage of Dr\nForsyth\nin his recently published work on the Theory of Functions. A Glossary of the principal technical terms is appended, giving the original German word together with the English adopted in the text. Prof\nKlein\nhad originally intended to revise the proofs, but owing to his absence in America he kindly waived his right to do so, in order not to delay the publication. The proofs have therefore not been submitted to him, though it was with considerable reluctance that I determined to publish without this final revision.\nMy thanks are due to Miss\nC A Scott\n, D.Sc., Professor of Mathematics in Bryn Mawr College, for many valuable suggestions in difficult passages and for her interest in the progress of the translation, and also for help in the reading of the proof-sheets. I must also express my thanks to Mr James Harkness, M.A., Associate Professor of Mathematics in Bryn Mawr College, for helpful advice given from time to time; and to Miss\nP G Fawcett\n, of Newnham College, Cambridge, for reading over in manuscript the earlier parts which deal more especially with the subject of Electricity.\nHardcastle returned to England sailing on the ship\nGallia\nfrom New York to Liverpool, via Queenstown, Ireland, arriving on\n13\nJuly\n1893\n. After spending the summer in England, she returned to the United States sailing from Liverpool on the ship\nGermanic\nand arriving in New York on\n29\nSeptember\n1893\n. She travelled from New York to Chicago, taking up an honorary fellowship in mathematics at Chicago University for the academic year\n1893\n-\n94\n.\nIn\n1894\n. she was one of the first women to join the\nAmerican Mathematical Society\n. See\nTHIS LINK\n.\nAfter the year in Chicago, Hardcastle again returned to England for the summer of\n1894\n. Going back to the United States for a third year, she left Liverpool on the ship\nGermanic\n, sailing to New York where she arrived on\n5\nOctober\n1894\n. This time she was going back to Bryn Mawr where she had been awarded a fellowship for the academic year\n1894\n-\n95\n.\n(\nLet us record one slightly amusing detail here. On the voyage she had\n8\npieces of baggage while most other passengers had between\n1\nand\n4\n.\n)\nBack in England in\n1894\n, she became a graduate student at Girton College, Cambridge. Her work on point groups, an area of algebraic geometry which is now known as divisors, led to several publications. She published\nSome observations on the modern theory of point groups\nin the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1898\n. This paper begins\n[\n4\n]\n:-\nThe origins of the theory of point groups are to be found in\nBrill\nand\nNoether\n's classic memoir published nearly twenty-five years ago, but it is only within the last fifteen years that systematic attention has been given to the subject by the Italian mathematicians,\nSegre\n,\nBertini\n,\nCastelnuovo\nand others; in their hands a series of isolated problems bids fair to develop into an organic theory, a theory, moreover, which furnishes links in thought between subjects as apparently diverse as projective geometry and the analytical theory of elimination, while maintaining the initial, direct connection between the theory of higher plane curves and the theory of functions. In the following pages I have briefly indicated some of the converging lines of the German and Italian work; in the first section, by a discussion of certain of the technical terms; in the second section, starting from the so-called\nRiemann\n-\nRoch\nequations, by the suggestion of certain lines of enquiry which may prove useful in the classification of algebraic curves. The appended bibliography is divided into two parts; the first contains those memoirs which may be considered as fundamental, from the historical as well as from the purely technical point of view, to the theory of point groups, including those more especially concerned with linear systems of plane  curves; the second includes memoirs on the theory of curves in ordinary and in hyperspace, more or less directly connected with the theory of point groups.\nOn\n13\nApril\n1899\n,\nFrancis Macaulay\nproposed Hardcastle as a referee of a paper submitted to the Cambridge Philosophical Society. This may not appear, at first sight, as a very significant thing to record, but it was significant in the Hardcastle became the first woman to referee a paper for the Society.\nThe\nBritish Association\nasked Hardcastle to report on the present state of the theory of point groups. She presented the first part of her\n4\n-part report to the Seventieth Meeting of the British Association held in Bradford in September\n1900\n. Her report begins\n[\n5\n]\n:-\nThe term point-group is a direct translation of the German word 'Punktgruppe', first used by\nBrill\nand\nNoether\nin the year\n1873\nin their classic memoir on algebraic functions, but to my knowledge, although more than a quarter of a century has elapsed since then, there has been no very systematic attempt to present the theory of point-groups to English readers along any of its lines of development. And yet it should prove of interest even to those mathematicians who do not desire to specialise in it, for, historically and logically, it touches upon many distinct branches of pure mathematics. To mention only those which are most directly brought into connection with each other, we have the intersections of plane curves, the elimination of variables from systems of equations, the algebraic theory of correspondences on a plane curve, properties of linear systems of plane curves, and applications of the theory of functions to the theory of curves and surfaces in space of any number of dimensions.\nAs frequently happens when the progress of a subject has been due to many different writers, the logical and the chronological divisions do not coincide. I have therefore in view a dual arrangement of the subject-matter. In the present instalment of my Report, I have attempted to sketch this proposed arrangement under its two aspects, viz-; as an historical outline, and as an analysis according to content. This is followed by a detailed account of one of the historical, divisions. I hope in the subsequent portions of the Report to deal in a somewhat similar way with the remaining divisions, and to append a complete bibliography.\nThe other three parts of her report were delivered to the\n1902\nmeeting\n[\n6\n]\n, the\n1903\nmeeting\n[\n7\n]\n, and the\n1904\nmeting\n[\n8\n]\n.\nNow we have recorded several outstanding achievements which show what an outstanding role model Hardcastle was for advancing the cause of women mathematicians at the end of the\n19\nth and early years of the\n20\nth centuries. There were, however, other ways in which Hardcastle worked for women's rights\n[\n11\n]\n:-\n... it is clear that Frances interest in suffrage and women's rights reach back to her days at Girton where she spoke to the society on women's suffrage talking about the aims and history of and its relation to the Women's Suffrage Movement and the Higher Education of Women and was a member of the CWSA\n(\nCambridge Association for Women's Suffrage\n)\n. Later, Frances became Honorary Secretary of the National Union of Women's Suffrage Societies\n(\nNUWSS\n)\nunder Millicent Fawcett and can be seen to sign a letter written in\n1908\nto 'The Times', stating her disagreement with militant methods taken by suffragettes.\nAlthough this quote gives an accurate picture of Hardcastle's involvement with the Women's Suffrage movement, there is some confusion over the timing of events. In fact the address that Hardcastle gave to the Girton College Women's Suffrage Society mentioned in the quote was around the year\n1909\n. She was the Honorary Secretary of the National Union of Women's Suffrage Societies at the time of this address to the Girton College Women's Suffrage Society, leaving that role in\n1909\n. In\n[\n3\n]\nwe learn of a letter Hardcastle wrote on\n7\nNovember\n1907\nordering\n20\n,\n000\ncopies of the leaflet 'Some Objections to Women's Suffrage considered' for the use of the National Union of Women's Suffrage Societies.\nIt was proposed to hold as International Congress of Women in The Hague in April\n1915\n. This Congress had two aims:-\n1\n. To demand that international disputes shall in future be settled by some other means than war, and\n2\n. To claim that women shall have a voice in the affairs of nations.\nAbout\n270\nBritish women signed a list supporting the aims of the Congress, one being Hardcastle.\nA E L Davis writes\n[\n1\n]\n:-\nIt seems that an accident, possibly in conjunction with ill health, caused Hardcastle to leave Cambridge in\n1904\nand abandon her mathematical research. She was able to live in adequate comfort on money settled on her by her father, increased later by inheritance. She and her sister Mira Francisca were named joint executors of her father's will, despite the availability of several brothers. She lived in London for a period, and worked for a year as a joint secretary, with Frances Sterling, for the National Union of Women's Suffrage Societies\n(\nthe suffragist organisation\n)\n, before moving to Newcastle where she served as secretary of the North-Eastern Federation of Women's Suffrage Societies. She spent her eventual retirement beside the Northumberland moors at Stocksfield, in a house she had built with Dr Ethel Williams, a former Newcastle GP.\nEthel M N Williams\n(1863\n-\n1948)\nhad been born in Cromer, Norfolk, and attended Norwich High School before studying at Newnham College Cambridge in\n1882\n-\n85\n. She studied at the London School of Medicine followed the award of a diploma in public health at Cambridge in\n1899\n. She signed the Declaration in Favour of Women's Suffrage in\n1889\nand through her work with Women's Suffrage she met Hardcastle and the two became close friends. Hardcastle was joint secretary of the National Union of Women's Suffrage Societies in\n1907\n. Both Williams and Hardcastle sent out a letter in June\n1907\nannouncing that an official newspaper 'Women's Franchise' was being launched for the National Union. Copies of several letters signed by Hardcastle are held by Archives Hub\n[\n2\n]\n. As mentioned above, she was one of the signatories of the\n1908\nletter written to\nThe Times\n[\n10\n]\n:-\n... stating her disagreement with militant methods taken by suffragettes. Her role highlights many of the tensions within the movement head on and another example can be found in archive material showing her dealing with difficult correspondence with Scottish suffragists wishing to split and create their own division.\nWilliams went to Newcastle where she practiced medicine, founding her own practice in\n1906\n. Hardcastle moved to Newcastle, probably around\n1909\n, to live with Williams and Hardcastle became the joint secretary of the North-Eastern Federation of Women's Suffrage Societies. Hardcastle and Williams travelled together to the International Congress of Women held in Zurich in May\n1919\n; Hardcastle was secretary of the North-Eastern Federation at this time. They built the house Bramble Patch at Low Bridges, Stocksfield, Northumberland near Newcastle where they lived after Williams retired in\n1924\n. In\n1939\nboth were living at their home in Stocksfield, with a private secretary and two domestic servants.\nAlthough living in Stocksfield, Hardcastle died at the Royal Hotel, Cambridge, while she was making a visit to the city. She was buried in the churchyard of Girton College. In her will, she left a substantial sum to her friend Ethel Williams.",
  "matematicos_citados_na_biografia": [
    "John Herschel",
    "George Greenhill",
    "Charlotte Angas Scott",
    "Felix Klein",
    "Forsyth",
    "Klein",
    "C A Scott",
    "P G Fawcett",
    "American Mathematical Society",
    "THIS LINK",
    "Brill",
    "Noether",
    "Segre",
    "Bertini",
    "Castelnuovo",
    "Riemann",
    "Roch",
    "Francis Macaulay",
    "British Association"
  ],
  "imagens": [
    "hardcastle.jpg"
  ]
}