{
  "nome_completo": "Ferdinand François Désiré Budan de Boislaurent",
  "nome_curto": "François Budan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Budan_de_Boislaurent/",
  "data_nascimento": "28 September 1761",
  "local_nascimento": "Limonade, Cap-Français, Saint-Domingue (now Haiti)",
  "data_morte": "6 October 1840",
  "local_morte": "Paris, France",
  "summary": "François Budan de Boislaurent was a Haitian born amateur mathematician best remembered for his discovery of a rule which gives necessary conditions for a polynomial equation to have n real roots between two given numbers.",
  "biografia": "François Budan\nwas born in Limonade, a village\n18\nkm south east of Cap-Français in Saint-Domingue. Today the town of Cap-Français is named Cap-Haitien, and Saint-Domingue is Haiti. Cap-Français was founded by the French in\n1670\nas the capital of Saint-Domingue\n(\nalthough the country was only given that name in\n1697)\n. Budan's family had long had connections with the Saint-Domingue with his great-grandfather Jean Budan settling there early in its time as a French colony after his marriage in Nantes. François Budan's father Michel Budan and his mother Marie Minière owned property in Saint-Domingue.\nWhen François was eight years old he was sent to France to be educated. On\n4\nAugust\n1769\nhe entered the College of Juilly as a boarder. The College, close to Paris in the diocese of Meaux, was run by priests of the Oratory and much patronized by the prominent families. The Congregation of the Oratory of Jesus and Mary Immaculate, often called the Oratorians, was founded by Pierre de Bérulle in\n1611\nand approved in\n1613\n. It had a fine reputation for providing a good education with particular emphasis on the classical languages. François received a thorough training in the classics at the College of Juilly and later in his life he often quoted from authors such as Virgil and Horace in his writings. He studied for eight years there and showed great liking and aptitude for the sciences, but as these were not part of the standard teaching, he received special mathematical tuition two days per week given on a voluntary basis by the mathematician J-C Farcot. During\n1775\n-\n77\nBudan studied in the Royal Academy of Juilly, with rhetoric being the topic of the first of these two years and philosophy as the topic of the second. By this time both Budan's parents had died. On\n3\nOctober\n1778\nhe entered the Maison de l'Institution situated in the Rue Saint-Honoré in Paris where he underwent religious training for a year before being sent to Nantes where members of his family lived.\nIn Nantes the Oratorians ran the College of Saint-Clément and Budan was attached to the College from October\n1779\nuntil\n1787\n. He undertook various teaching duties at the College, including logic and physics in his last two years there. During these years he was also a member of the Faculty of Arts at the University of Nantes, which again was an Oratorian institution. During the following years he seems to have been sometimes in Montmorency but mostly in Nantes. Budan took up the study of medicine in Paris and, in\n1803\n, received the title of doctor of medicine for a thesis entitled\nEssai sur cette question d'économie médicale : Convient-il qu'un malade soit instruit de sa situation?\nⓉ\n(\nEssay on the issue of medical ethics: Should a patient be informed of his situation?\n)\nAt around this time he was submitting mathematical works to the\nAcademy of Sciences\nwhich we will discuss in more detail below.\nBudan was appointed Inspector General for Public Instruction in\n1803\n. He married Thérèse-Désirée de Piolenc at Nantes on\n13\nFebruary\n1809\n. He was\n47\nand his wife was\n30\nyears of age. François and Thérèse-Désirée Budan had three daughters and one son: Louise-Victorine\n(\nborn\n25\nJune\n1810)\n, Antoinette\n(\nborn\n28\nAugust\n1811)\n, Charles-Albert\n(\nborn\n13\nSeptember\n1812)\n, and Marie-Thérèse\n(\nborn\n22\nDecember\n1813)\n. All four children were born in Paris. On the death of the wife of Antoine-Athanase Royer-Collard in\n1815\n, Budan acted as tutor to their five children. In\n1835\nBudan retired and he died five years\n(\nto the day\n)\nlater.\nBudan is considered an amateur mathematician and he is best remembered for his discovery of a rule which gives necessary conditions for a polynomial equation to have\nn\nn\nn\nreal roots between two given numbers. Akritas writes in\n[\n3\n]\n:-\nIn the early\n19\nth\ncentury F D Budan and\nJ B J Fourier\npresented two different\n(\nbut equivalent\n)\ntheorems which enable us to determine the maximum possible number of real roots that an equation has within a given interval.\nBudan's rule was in a memoir sent to the Institute in\n1803\nbut it was not made public until\n1807\nin\nNouvelle méthode pour la résolution des équations numerique d'un degré quelconque\nⓉ\n(\nNew method for solving numerical equations of any degree\n)\n. In it Budan wrote:-\nIf an equation in\nx\nx\nx\nhas\nn\nn\nn\nroots between zero and some positive number\np\np\np\n, the transformed equation in\n(\nx\n−\np\n)\n(x - p)\n(\nx\n−\np\n)\nmust have at least\nn\nn\nn\nfewer variations in sign than the original.\nGrabiner writes\n[\n1\n]\n:-\nHe quoted\nLagrange\nto show that it would be useful to give the rules for solving numerical equations entirely by means of arithmetic, referring to algebra only if absolutely necessary. Budan's goal was to solve\nLagrange\n's problem - between which real numbers do real roots lie? - purely by methods of elementary arithmetic. Accordingly, the chief concern of Burdan's Nouvelle méthode was to give the reader a mechanical process for calculating the coefficients of the transformed equation in\n(\nx - p\n)\n. He did not appeal to the theory of finite differences or to the calculus of these coefficients, preferring to give them \"by means of simple additions and subtractions\".\nA paper giving a proof was presented to the\nAcademy of Sciences\nin Paris in\n1811\nand he published it in\n1822\n.\nLagrange\nwas asked to report on Budan's paper of\n1811\nand he found that it was essentially true but to make it completely rigorous certain gaps had to be filled.\nFourier\nhad independently discovered a rule which he taught in a course from\n1797\nbut\nFourier\n's version was not published until\n1831\n, after his death.\nLagrange\n, however, did not appear to know of\nFourier\n's result since he described Budan's result as a new one. Grabiner writes\n[\n1\n]\n:-\nBudan's success in discovering a correct rule and giving a reasonably satisfactory proof of it shows that, at the beginning of the nineteenth century, it was still possible for one without systematic training in mathematics to contribute to its progress ... The professionals were about to take over.\nFourier\n's simultaneous and independent discovery, using derivatives, exemplifies the powerful methods available to one thoroughly schooled in mathematics.\nLet us note that\nCharles-François Sturm\nin his famous paper\nMémoire sur la résolution des équations numériques\nⓉ\n(\nMemoir on solving numerical equations\n)\npublished in\n1829\ncompletely solved the problem of determining the number of real roots of an equation on a given interval.\nHermite\nwrote:-\nSturm\n's theorem had the good fortune of immediately becoming a classic and of finding a place in teaching that it will hold forever. His demonstration, which utilises only the most elementary considerations, is a rare example of simplicity and elegance.\nHermite\nwas wrong. Neither Budan's rule, nor\nFourier\n's rule, nor\nSturm\n's rule found a place in textbooks written a few years after they were discovered. Fashions in mathematics change and solving a problem which\nLagrange\nhad deemed important does not guarantee your solution will achieve fame.\nIn total Budan published ten mathematical works and as one further example of his contributions we note that he submitted a paper on the summation of series to the\nAcademy of Sciences\nin\n1802\nwhich was refereed by\nBiot\nand\nLacroix\n.  He also contributed to law, medicine and poetry, writing a Latin ode on the birth of the son of the Duke of Burgundy. He was honoured for his contributions being named Chevalier of the Légion d'Honneur on\n20\nNovember\n1814\n.",
  "matematicos_citados_na_biografia": [
    "Academy of Sciences",
    "J B J Fourier",
    "Lagrange",
    "Fourier",
    "Charles-François Sturm",
    "Hermite",
    "Sturm",
    "Biot",
    "Lacroix"
  ],
  "imagens": []
}