{
  "nome_completo": "Frederico Commandino",
  "nome_curto": "Frederico Commandino",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Commandino/",
  "data_nascimento": "1506",
  "local_nascimento": "Urbino (now Italy)",
  "data_morte": "5 September 1575",
  "local_morte": "Urbino (now Italy)",
  "summary": "Frederico Commandino was an Italian mathematician who published important translations of works of the Ancient Greek mathematicians.",
  "biografia": "Frederico Commandino\n's father was Battista Commandino who was from a leading family in Urbino. Battista had designed the fortifications of Urbino while his father, Frederico's grandfather, had been the secretary to the Duke of Urbino.\nThere is little information about Commandino's youth and all we know of his early education is that he studied Latin and Greek at Fano under the humanist G Torelli. He returned to Urbino where the next stage of his education came about because of the political situation in Europe. Suleyman the Magnificent came to power in\n1520\nand soon pressure from the Turks was felt in Europe. Charles V, the Holy Roman emperor, felt that his duty was to defend Christian Europe against the Turks but, despite this, his Spanish and German troops marched against the Pope, entering the city of Rome in May\n1527\n. They looted the city in the infamous Sack of Rome with thousands of churches, palaces, and houses being destroyed. The Orsini family, one of the leading families of Rome, fled from the city and sought safety in Urbino. There they had a mathematics tutor for one of their sons, and this same tutor taught Commandino mathematics.\nCommandino's talents were quickly recognised by his tutor. After this tutor was appointed a bishop in June\n1533\nhe arranged that Commandino be appointed as private secretary to Pope Clement VII. He took up this appointment in June\n1534\nbut on\n25\nSeptember\n1534\nPope Clement died and Commandino then went to the University of Padua. Bernardino Baldi, who was a student of Commandino in the latter part of his life and wrote a short biography of him in\n1587\n, claimed that he studied philosophy and medicine at Padua from\n1534\nto\n1544\nbut one should not suppose that this means that he was a student for ten years. Having independent means, he was almost certainly able to study in an academic environment without taking specific degrees. Padua was famous for its medical school but despite this he took his medical degree from the University of Ferrara. It is worth noting that\nCopernicus\nfollowed a very similar path some\n40\nyears earlier, for he also studied medicine at Padua and took a degree from the University of Ferrara; in\nCopernicus\n's case however his Ferrara degree was in law and not medicine.\nIt appears that Commandino intended to practise medicine and indeed he returned to Urbino with this aim. Back in his home town, however, he was appointed as tutor and medical advisor to the Duke of Urbino. He married but his wife died after giving birth to two daughters and a son. After becoming personal physician to the Duke of Urbino, he met Cardinal Farnese, the brother of the Duke's wife, and the Cardinal persuaded him to move to Rome in the early\n1550\ns as his personal physician. While in Rome he became friendly with Cardinal Cervini and when Cervini was elected Pope Marcello II in\n1555\nit looked as if Commandino would prosper with personal favours from the Pope. However Pope Marcello II died shortly after his election and Commandino continued in the service of the Duke of Urbino and Cardinal Farnese but he now returned to Urbino to carry out his duties.\nIt would appear that Commandino was never that enthusiastic about being a medical advisor. His true love was the study of the mathematical classics and he had the mathematical knowledge, as well as language skills, to edit and to translate these books. Already when he lived in Rome he had begun the task of editing\nPtolemy\n's\nPlanisphere\nand from that point on he spent the rest of his life publishing translations\n(\nmostly Greek into Latin\n)\n, with commentaries, of the classic texts of\nArchimedes\n,\nPtolemy\n,\nEuclid\n,\nAristarchus\n,\nPappus\n,\nApollonius\n,\nEutocius\n,\nHeron\nand\nSerenus\n. His first published work was an edition of\nArchimedes\n, dedicated to his patron Cardinal Farnese, which he published in\n1558\n. Also in\n1558\nCommandino published the work which he had begun in Rome, namely\nCommentarius in planisphaerium Ptolemaei\nin which he gave an account of\nPtolemy\n's stereographic projection of the celestial sphere. What is interesting here is that Commandino recognised that\nPtolemy\n's stereographic projection is related to the perspective studies made by architects in designing stage scenery. This is actually an important connection and it shows that Commandino has a deep understanding of the works which he edited.\nAn interesting letter\n(\nsee\n[\n14\n]\n)\nwhich Commandino wrote to Ottavio Farnese, Duke of Parma and Piacenza, on\n3\nNovember\n1560\ntells us something about his life. His son had died and after that he had sent his two daughters to a convent school to be educated. In this letter he told the Duke that he had found a husband for one of his daughters and his second daughter would also soon be married. The reason that this was relevant was that the dowry that Commandino had to find for his two daughters had taken nearly all his capital and so to continue publishing his editions of the classical mathematical texts he required continued support from Cardinal Farnese, his patron, and he also hoped for a promise of support in his old age. In the letter Commandino outlined his plans for further publications including\nPtolemy\n's\nDe analemmate\nand an edition of\nApollonius\n. In fact Commandino had only a manuscript of a Latin translation of an Arabic version of this book by\nPtolemy\nto work from. He published his edition of\nDe analemmate\nin\n1562\ntogether with a commentary on the text and a work his own\nOn the calibration of sundials\nof which he felt added a practical aspect to\nPtolemy\n's theoretical discussions.\nJohn Dee\nvisited Commandino in Urbino in\n1563\n.\nDee\nhad made a copy of\nDe superficierum divisionibus\nby Machometus Bagdedinus in\n1559\nand he took this copy with him to Italy where he gave it to Commandino to publish it, as indeed he did. Two years later, in\n1565\n, Cardinal Farnese became Bishop of Bologna and Commandino followed his patron to Bologna. There he published an original work\nDe centro Gravitatis\non centres of gravity. This work is described by Drake in his famous text on\nGalileo\nas the:-\n... pioneer treatise on centres of gravity in the Archimedean tradition.\nIn the preface to this work Commandino refers to his edition of\nArchimedes\n'\nDe iis quae vehuntur in aqua libri duo; De Insidentibus Aquae\n(\nOn floating bodies\n)\nbeing in the press. It was his efforts to bring this text into a good state which had resulted in him doing original work on centres of gravity and had prompted him to undertake the work for his original contribution. His edition of\nArchimedes\n'\nOn floating bodies\nis also very important for not only did he comment on it but he also corrected it\n[\n1\n]\n:-\nIn particular the proof of proposition\n2\nin book II was incomplete, and Commandino filled it out. One step required knowing the location of the centre of gravity of any segment of a parabolic conoid. No ancient treatment of such a problem was then known, and Commandino's was the first modern attempt to fill in the gap.\nThese two works were published in Bologna but Commandino did not spend long in that city since Cardinal Farnese died on\n28\nOctober\n1565\n, after which Commandino returned to Urbino. The Duke of Urbino awarded him the pension which he had hoped for in his letter of\n1560\nand for a few years he appears to have been rather inactive, probably due to health problems caused by overwork. However the son of the Duke requested that Commandino prepare a Latin translation of\nEuclid\n's\nElements\nand he set to work enthusiastically on this major task. It was published in\n1572\n, dedicated to Duke Francesco Maria of Urbino, with the usual detailed commentaries which he always provided. In the same year he published his Latin edition of\nAristarchus\n's\nSizes and distances of the Sun and Moon\nagain with commentary.\nBy this time the excessive workload that Commandino had put on himself over the years was taking its toll. However, still wishing to push forward with publishing, he now also supervised his pupils in this task. In particular he supervised an Italian edition of\nEuclid\n, but he continued his own translating, working on\nHeron\n's\nPneumatics\n. This last translation was still not published at the time of his death but his son-in-law ensured that this last complete contribution appear in print in\n1575\n. We say last complete work since he left an incomplete Latin translation of Books III to VIII of\nPappus\n's\nCollection\n. His pupil\ndel Monte\ncompleted the task and published this final contribution in\n1588\n.\nWe should mention one further achievement of Commandino, namely his improvement of the reduction compass, helping develop it into the proportional compass. Perhaps we should say exactly what a reduction compass is. It consisted of a pair of dividers with the addition of a number of sharp points that could be slid up and down the arms to provide a device capable of giving measurements in fixed proportion to how far the legs of the dividers were opened. It is said to have been invented by Fabricio Mordente as a drafting instrument but it soon became used for finding proportions between figures. In\n[\n8\n]\nGamba shows that Mordente spent some time in Urbino and had many discussions with Commandino and his pupil\ndel Monte\n.\nHow was this modified into the proportional compass? Well a proportional compass was like a pair of dividers but having a movable hinge in the middle. It had points at both ends of the legs and, depending on the position of the hinge, a fixed proportion was achieved between distances measures with the points at one end and those at the other. It was used to enlarge or reduce drawings. The next step forward from the efforts of Commandino and\ndel Monte\nwas that of\nGalileo\nin\n1606\nwhen he developed the proportional compass into a type of slide-rule.\nIn\n[\n9\n]\nNapolitani discusses the achievements of Commandino whom he rightly suggests had the greatest influence of anybody in ensuring that the classic Greek mathematical texts survived by publishing his editions of them.\nEdward Rosen ends his article\n[\n1\n]\nby writing:-\nIn the sixteenth century, Western mathematics emerged swiftly from a millennial decline. This rapid ascent was assisted by\nApollonius\n,\nArchimedes\n,\nAristarchus\n,\nEuclid\n,\nEutocius\n,\nHeron\n,\nPappus\n,\nPtolemy\nand\nSerenus\n- as published by Commandino.",
  "matematicos_citados_na_biografia": [
    "Copernicus",
    "Ptolemy",
    "Archimedes",
    "Euclid",
    "Aristarchus",
    "Pappus",
    "Apollonius",
    "Eutocius",
    "Heron",
    "Serenus",
    "John Dee",
    "Dee",
    "Galileo",
    "del Monte"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}