{
  "nome_completo": "Friedrich Ernst Peter Hirzebruch",
  "nome_curto": "Friedrich Hirzebruch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hirzebruch/",
  "data_nascimento": "17 October 1927",
  "local_nascimento": "Hamm, Westphalia, Germany",
  "data_morte": "27 May 2012",
  "local_morte": "Bonn, Germany",
  "summary": "Friedrich Hirzebruch was a German mathematician who made important contributions to topology.",
  "biografia": "Friedrich Hirzebruch\nwas the son of Dr Fritz Hirzebruch and Martha Holtschmidt. Fritz Hirzebruch was the headmaster of a secondary school in Hamm, and he also taught mathematics there. When he was at school, Friedrich enjoyed mathematics and learnt more advanced topics by talking to his father and reading his father's mathematics books. In\n1937\nFriedrich reached the age of ten and at that time he was required to join the Deutsches Jungvolk\n(\nGerman Youth\n)\n, a subdivision of the Hitler youth for boys aged\n10\nto\n14\n.  In\n1943\nat the age of\n15\nhe was drafted with his whole school class as \"helper\" into an anti aircraft position in his hometown.\nIn March\n1945\nHirzebruch was drafted into the German army at the time when Allied forces were on the point of crossing the Rhine. By April, Allied forces had taken control of much of Germany and Hirzebruch was taken prisoner. He was released on\n1\nst\nJuly\n1945\n.  He was allowed to enter the Westfälische Wilhelms University of Münster in November\n1945\nwhere he studied mathematics, physics and mathematical logic. Much of the University had been severely damaged by bombing, so at first he had to do most of his studying at home. Quickly, however, conditions improved and nearly normal university life returned.\nHe received his Ph.D. from the University of Münster in\n1950\nfor his thesis\nÜber vierdimensionale Riemannsche Flächen mehrdeutiger analytischer Funktionen von zwei komplexen Veränderlichen\nⓉ\n(\nOn four-dimensional Riemann surfaces ambiguous analytic functions of two complex variables\n)\nafter studying under\nHeinrich Behnke\n. He also studied algebraic topology and\nalgebraic geometry\nwith\nHeinz Hopf\nat the Eidgenössische Technische Hochschule in Zürich from\n1949\nto\n1950\n. This period was very important for the preparation of his thesis.\nAfter serving as a Scientific Assistant at the University of Erlangen during\n1951\n-\n52\n, he spent the two years\n1952\n-\n54\nat the Institute for Advanced Study in Princeton in the United States working with\nArmand Borel\n,\nKunihiko Kodaira\n, and\nD C Spencer\non topics such as sheaf theory, vector bundles, characteristic classes and\nThom\ncobordism. He married Ingeborg Spitzley in\n1952\n; they had  two daughters and one son.\nHis first paper, published in\n1951\n, was\nÜber eine Klasse von einfachzusammenhängenden komplexen Mannigfaltigkeiten\nⓉ\n(\nOn a class of simply connected complex manifolds\n)\n. S S Cairns begins his review as follows:-\nTwo complex manifolds are analytically equivalent if they can be topologically and analytically mapped onto one another. This paper makes a contribution to the general problem of determining all analytic equivalence classes among a class of topologically equivalent manifolds.\nHirzebruch published a paper with the same title as his doctoral thesis in\n1953\n, also publishing three further papers\nÜber die quaternionalen projektiven Räume\nⓉ\n(\nOn the quaternional projective spaces\n)\n;\nOn Steenrod's reduced powers, the index of inertia, and the Todd genus\nand\nÜbertragung einiger Sätze aus der Theorie der algebraischen Flächen auf komplexe Mannigfaltigkeiten von zwei komplexen Dimensionen\nⓉ\n(\nTransfer of some results from the theory of algebraic surfaces to complex manifolds of two complex dimensions\n)\nin the same year. One of his most famous results, now named the Hirzebruch-\nRiemann\n-\nRoch\ntheorem, appeared in his\n1954\npaper\nArithmetic genera and the theorem of Riemann-Roch for algebraic varieties\n. He published\nSome problems on differentiable and complex manifolds\nin the same year. After submitting his\nhabilitation\nthesis\n(\nidentical with the book pubished in\n1956)\nhe spent the year\n1954\n-\n55\nas a\nDozent\nat the University of Münster. Following this he was appointed as an Assistant Professor at Princeton University where he spent the year\n1955\n-\n56\n.\nHirzebruch's impressive work on the\nRiemann\n-\nRoch\ntheorem was fully set out in a book he published in\n1956\nentitled\nNeue topologische Methoden in der algebraischen Geometrie\nⓉ\n(\nNew topological methods in algebraic geometry.\n)\n.\nD C Spencer\nwrites:-\nThis monograph is an exposition of the main ideas and concepts centring around the fundamental Riemann-Roch theorem for algebraic manifolds of arbitrary dimension, a theorem whose proof has recently been found by the author and which is presented here in complete form for the first time. An algebraic manifold is understood to mean a compact complex manifold which can be imbedded complex-analytically without singularities in a complex projective space of suitably chosen dimension.\nIn\n1956\nhe became a full professor at the Rheinischen Friedrich-Wilhelms University of Bonn, holding this position until he retired in\n1993\n. During this time he served as Dean of the Faculty of Mathematics and Natural Sciences from\n1962\nto\n1964\n.\nThe list of books written by Hirzebruch is impressive both for the number, the quality of the exposition, and for the influence on the direction of mathematical research. We give some details of those which followed his\n1956\nmasterpiece mentioned above which was translated as\nTopological methods in algebraic geometry\nand appeared in several updated editions over many years.\nGarben-und Cohomologietheorie\nⓉ\n(\nSheaves and cohomology\n)\n(1957)\n, written with G Scheja, sets out the\ncohomology\ntheory of sheaves. In\n1962\nHirzebruch gave a series of seminars at Brandeis and Berkeley. Notes from these were taken by S S Koh and the text revised and updated by W D Neumann for the book\nDifferentiable manifolds and quadratic forms\nwhich was published as a joint work by the three mentioned mathematicians in\n1971\n. In\n1974\nHirzebruch, jointly with D Zagier,  published\nThe Atiyah-Singer theorem and elementary number theory\n. It is well worth reproducing the first few sentences of a review by Harvey Cohn:-\nThe point of view of this book is so potentially revolutionary that the book can be adequately reviewed and the point of view can be adequately assessed only by judging future developments. Basically, the role of topology in number theory has progressed beyond the local methods such as p-adic theory to global methods such as intersection numbers of homology classes.\nIn\n1981\na series of five lectures by Hirzebruch and eight lectures by Gerard van der Geer were combined into notes by the two authors entitled\nLectures on Hilbert modular surfaces\n. In particular they develop enough of the theory of algebraic surfaces to allow an investigation of\nHilbert\nmodular surfaces. Further works with Hirzebruch as a coauthor are\nZahlen\n(1983)\n,\nGeradenkonfigurationen und Algebraische Flächen\nⓉ\n(\nLine configurations and algebraic surfaces\n)\n(1987)\n, and\nManifolds and modular forms\n(1992)\n.\nHirzebruch also had an important influence on the mathematical life in Germany by organizing the famous Arbeitstagung meetings since\n1957\n. The first\n30\nArbeitstagungen which he organised form the \"First Series\" with a \"Second Series\" beginning in\n1993\n.  It is very important to mention at this point the cooperation with\nMichael Atiyah\n. During the first\n30\nArbeitstagungen\nAtiyah\nlectured\n32\ntimes, often as the first speaker. From\n1959\nto\n1970\nAtiyah\nand Hirzebruch published nine joint papers. The first papers were stimulated by the series of lectures by\nA Grothendieck\nduring the first Arbeitstagung\n1957\ngeneralizing Hirzebruch's\nRiemann\n-\nRoch\ntheorem.\nGrothendieck\n's ideas led to the development of K-theory.\nHirzebruch founded the Institut für Mathematik of the\nMax Planck Society for the Advancement of Science\nin Bonn in\n1980\n. The Institute has a small permanent staff, almost all members being mathematicians from around the world spending a fixed period there. The whole concept is based on providing the most suitable environment for the exchange of problems and ideas. The research environment is enhanced by the library, the administration and the computer group. Hirzebruch served as director of the Institute from\n1980\nto\n1995\n.\nHirzebruch was President of the\nGerman Mathematical Society\nin\n1961\n-\n62\nand again in\n1990\n. He was also President of the\nEuropean Mathematical Society\nfrom\n1990\nto\n1994\n. He was Honorary President of the International Congress of Mathematicians held in Berlin in\n1998\n.\nPart of Hirzebruch's address to the\n1998\nICM address as Honorary President is at\nTHIS LINK\n.\nHis outstanding contributions have led to the most impressive list of honours. He was elected to the the Orden pour le merite für Wissenschaft und Künste, the\nGerman Academy of Scientists Leopoldina\n, the\nHeidelberg Academy\n, the Mainz Academy, the\nRoyal Netherlands Academy of Sciences\n, the Nordrheinwestfalen Academy, the\nNational Academy of Sciences\n(\nUnited States\n)\n, the Bayerische Akademie der Wissenschaften, the\nFinnish Academy of Science and Letters\n, the\nRussian Academy of Sciences\n, the\nParis Academy of Sciences\n, the\nGöttingen Academy of Sciences\n, the\nAmerican Academy of Arts and Sciences\n, the\nUkrainian Academy of Sciences\n, the Sächsische Akademie, the\nBerlin Academy of Science\n, the\nRoyal Society of London\n, the\nRoyal Irish Academy\n, the\nPolish Academy of Sciences\n, Academia Europaea, the European Academy of Arts and Sciences, the\nAustrian Academy of Sciences\nand the\nRoyal Society of Edinburgh\n.\nIn addition Hirzebruch has been awarded honorary doctorates from the University of Warwick, Göttingen, Oxford, Wuppertal, Notre Dame, Dublin, Athens, Potsdam, Konstanz, Humboldt-Berlin, Bar-Ilan, Oslo, and the University of Illinois at Chicago, Augsburg and the\nRomanian Academy of Sciences\nin Bucharest. He has been awarded many prizes: the Silver Medal from the Swiss Federal Institute of Technology\n(1950)\n, the Wolf Prize for Mathematics\n(1988)\n, the\nLobachevsky\nPrize from the\nRussian Academy of Sciences\n(1989)\n, the\nSeki\n-Takakazu  Prize of the\nJapanese Mathematical Society\n(1996)\n, the Cothenius Gold Medal Leopoldina\n(1997)\n, the Lomonosov Gold Medal of the\nRussian Academy of Sciences\n(1997)\n, the\nAlbert Einstein\nMedal\n(1999)\n, the\nStefan Banach\nMedal of the\nPolish Academy of Sciences\n(2000)\n, the Krupp-Wissenschaftspreis\n(2000)\n, the\nHelmholtz\nMedal of the Berlin-Brandenburg Academy of Sciences\n2002\n, the\nGeorg Cantor\nMedal of the\nGerman Mathematical Society\n(2004)\n.\nAccording to the citation the\n1988\nWolf Foundation Prize was awarded to Hirzebruch:-\n... for outstanding work combining topology, algebraic and\ndifferential geometry\n, and algebraic number theory; and for his stimulation of mathematical cooperation and research.\nThe citation then gave a fuller account of Hirzebruch's work which led to the award:-\nFor the past three and a half decades, the name of Professor Friedrich Hirzebruch has been connected with famous results in the areas of topology, algebraic geometry, and global differential geometry, results which all mark the beginning of important theories and which have had an enormous influence on the development of modern mathematics. Hirzebruch's achievements include\n1\n. the discovery of the signature theorem for differentiable manifolds and the formulation and proof of the\nRiemann\n-\nRoch\ntheorem for algebraic varieties,\n2\n. the integrality theorem for characteristic classes of differentiable manifolds,\n3\n. the proportionality theorem for complex homogeneous manifolds and\n(\nwith\nArmand Borel\n)\nthe general theory of characteristic classes of homogeneous spaces of compact\nLie\ngroups,\n4\n. complex K-theory and its spectral sequence and various geometrical applications\n(\nwith\nM F Atiyah\n)\n,\n5\n. the 'topological' proof of the\nDedekind\nreciprocity theorem through\n4\n-manifold theory and other fascinating relations between differential topology and\nalgebraic number theory\n6\n. the systematic study of\nHilbert\nmodular-forms and-surfaces and their relation to class numbers.\nMany mathematicians have expanded and generalized Hirzebruch's ideas. He himself has always been interested in the beautiful particular case and concrete problem, which he solves by creating new methods that combine unusual geometric, algebraic, and arithmetic intuition. Moreover, through his brilliant lecturing and writing, through the \"Arbeitstagung Bonn\"\n(\nyearly international meetings at the highest level\n)\n, and through his dedicated work in scientific organizations he has greatly stimulated world-wide cooperation in research.\nThe\nGerman Mathematical Society\npresented Hirzebruch with their\nGeorg Cantor\nMedal during a meeting of the Society in Heidelberg in September\n2004\n. The citation reads:-\nIn recognition of his remarkable achievements the\nGerman Mathematical Society\nbestows the\nGeorg Cantor\nMedal on Prof Dr Friedrich Hirzebruch. With this distinction the DMV honors a mathematician of worldwide reputation whose path-breaking works have substantially furthered mathematics. His ideas and discoveries - particularly in connection with\nRiemann\n-\nRoch\ntheorems, characteristic classes, and K-theory - have contributed to the instigation of one of the most important developments in mathematics in the second half of the\n20\nth\ncentury. He has contributed more than anyone else to the international integration of German mathematics and to the absorption of East and West German mathematicians into a common organization.",
  "matematicos_citados_na_biografia": [
    "Heinrich Behnke",
    "algebraic geometry",
    "Heinz Hopf",
    "Armand Borel",
    "Kunihiko Kodaira",
    "D C Spencer",
    "Thom",
    "Riemann",
    "Roch",
    "habilitation",
    "Dozent",
    "cohomology",
    "Hilbert",
    "Michael Atiyah",
    "Atiyah",
    "A Grothendieck",
    "Grothendieck",
    "Max Planck Society for the Advancement of Science",
    "German Mathematical Society",
    "European Mathematical Society",
    "THIS LINK",
    "German Academy of Scientists Leopoldina",
    "Heidelberg Academy",
    "Royal Netherlands Academy of Sciences",
    "National Academy of Sciences",
    "Finnish Academy of Science and Letters",
    "Russian Academy of Sciences",
    "Paris Academy of Sciences",
    "Göttingen Academy of Sciences",
    "American Academy of Arts and Sciences",
    "Ukrainian Academy of Sciences",
    "Berlin Academy of Science",
    "Royal Society of London",
    "Royal Irish Academy",
    "Polish Academy of Sciences",
    "Austrian Academy of Sciences",
    "Royal Society of Edinburgh",
    "Romanian Academy of Sciences",
    "Lobachevsky",
    "Seki",
    "Japanese Mathematical Society",
    "Albert Einstein",
    "Stefan Banach",
    "Helmholtz",
    "Georg Cantor",
    "differential geometry",
    "Lie",
    "M F Atiyah",
    "Dedekind",
    "algebraic number theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}