{
  "nome_completo": "Friedrich Moritz Hartogs",
  "nome_curto": "Friedrich Hartogs",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hartogs/",
  "data_nascimento": "20 May 1874",
  "local_nascimento": "Brussels, Belgium",
  "data_morte": "18 August 1943",
  "local_morte": "Munich, Germany",
  "summary": "Friedrich  Hartogs was a Belgian mathematician, known for his work on set theory and foundational results on several complex variables.",
  "biografia": "Friedrich Hartogs\nwas known as Fritz to his friends and colleagues, and in fact even wrote mathematics papers under the name Fritz Hartogs. His parents were Elise Feist and Gustav Hartogs, who was a businessman. Despite being born in Brussels, Hartogs' family were German Jews and he was brought up in Frankfurt am Main in Germany. He attended the\nRealgymnasium\nWöhlerschule in Frankfurt, graduating from the high school in the spring of\n1892\n, a few weeks before his eighteenth birthday.\nAt this time the standard university career for German students involved moving between different institutions and Hartogs followed this route. First he spent a semester at the Technical College at Hanover, followed by a semester at the Technical College in Berlin. He then matriculated at the University of Berlin where he was taught mathematics by, among others,\nGeorg Frobenius\n,\nLazarus Fuchs\nand\nHermann Schwarz\n, and he attended physics lectures by\nMax Planck\n. In\n1900\n, while still a student at the University of Berlin, Hartogs married in Hamburg; the couple had four children. Following his studies at the University of Berlin, he then went to the University of Munich where he attended courses by\nFerdinand von Lindemann\nand\nAlfred Pringsheim\n. It was in\n1901\nthat\nPringsheim\nbecame a full professor at Munich and he became Hartogs's thesis advisor. Hartogs submitted his thesis\nBeiträge zur elementaren Theorie der Potenzreihen und der eindeutigen analytischen Funktionen zweier Veränderlichen\nⓉ\n(\nContributions to the elementary theory of power series and single valued analytic functions of two variables\n)\nto the Ludwig-Maximilians-Universität Munich in\n1903\nand was awarded his doctorate with distinction in July of that year. He continued to work towards\nhabilitating\nat Munich which he did two years later after writing the paper\nZur Theorie der analytischen Funktionen mehrerer unabhängiger Veränderlichen, insbesondere über die Darstellung derselben durch Reihen, welche nach Potenzen einer Veränderlichen fortschreiten\nⓉ\n(\nOn the theory of analytic functions of several independent variables, in particular on their representation by series, which continue according to powers of one variable\n)\n. The\n90\n-page paper was published in\nMathematische Annalen\nin\n1906\n.\nFollowing the acceptance of his habilitation thesis, Hartogs became a\nprivatdozent\nat the University of Munich. In session\n1909\n-\n10\nhe taught\nAbraham Fraenkel\nwho, years later, wrote in his memoirs that Hartogs was by nature a consistently shy and a rather anxious person. Perhaps for this reason he was only promoted slowly when the outstanding quality of his research would suggest that he might have risen more rapidly through his profession. He became an extraordinary professor in\n1912\n, then ten years later was offered a full professorship at the University of Frankfurt. This chair had become vacant when\nArthur Schönflies\nretired after eight years of service. Hartogs was indeed a very cautious person and he turned down the offer of this chair because, in the difficult financial climate of the time with hyperinflation gripping Germany, he did not feel confident that a privately owned institution, which the University of Frankfurt was, offered the security that he required to support his wife and four children. In a letter explaining his decision he wrote\n[\n3\n]\n:-\n...\n[\nsince\n]\nthe professors of the University of Frankfurt legally have no claims on the state, but only have claims on the University of Frankfurt,\n...\nit seemed to me that under the current uncertain internal and foreign policy relationships, which threaten to worsen daily, this decision was by no means worry-free, and as a head of household\n,\nI would feel guilty if I were to let the great advantages of by the position offered in Frankfurt blind me to the issue of material safeguards affecting my family\n...\nAt Frankfurt, Hartogs had several outstanding colleagues.\nOskar Perron\nwas appointed to a professorship in\n1922\n,\nConstantin Carathéodory\nwas appointed in\n1924\nto fill the chair left vacant when\nFerdinand von Lindemann\nretired, and\nHeinrich Tietze\nwas appointed in\n1925\n. These three professors all made representations to the university arguing that Hartogs be appointed to a full professorship and in\n1927\n, five years after turning down the full professorship at Frankfurt, he had at last reached the top of his profession. Like all Jewish academics, after the Nazi Party came to power in\n1933\nHartogs' life became increasingly difficult. Hitler came to power on\n30\nJanuary\n1933\nand on\n1\nApril, so-called 'Boycott Day', Jewish shops were boycotted and Jewish professors and lecturers were not allowed to enter the university. On\n7\nApril the Nazis passed the law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent, with exemptions for participants in World War I and pre-war officials. Hartogs had held an appointment before World War I which qualified him as a civil servant so at this stage he retained his professorship. An attempt by the students at the University of Munich to unseat him was not successful as the Bavarian Secretary of Cultural Affairs upheld the conditions of the law and retained Hartogs.\nThis little victory for Hartogs was only temporary, however. On\n15\nSeptember\n1935\n, at a convention in Nürnberg, two measures were approved by the Nazi Party which removed rights from Jews. The consequences for Hartogs were swift for, on\n22\nOctober, he was forced to retire from his professorship. At first he was able to retain contacts with colleagues and visited the university on a number of occasions. This came to an end when residents of the block of flats where he lived reported to the authorities that he was being visited by German colleagues. To continue with their visits would have meant that his colleagues would suffer severe consequences, so Hartogs became completely isolated. On\n10\nNovember\n1938\n, so called 'Kristallnacht', the Nazi gangs attacked Jews and Jewish property. The police were told not to arrest the attackers but rather to arrest the Jews who were being attacked. Around\n30\n,\n000\nJewish men were arrested and taken to concentration camps. Hartogs was one of those arrested and he was taken to the Dachau concentration camp. After being held for several weeks during which he was appallingly treated he was released.\nHartogs had always done his utmost to protect his family as we have already seen with his decision not to accept the chair at Frankfurt in\n1922\n. He realised in\n1933\nthat his house in the Grosshesselohe, in Munich, could be seized by the authorities so he had made it over to his wife at this time. Hartogs' wife was a Aryan so he hoped that this would ensure that their home was safe. It became clear after the Nürnberg laws of\n1935\nthat this was not sufficient to protect the house since his wife, through marriage to a Jew, would have been liable to having the home confiscated and being sent to a concentration camp. In\n1941\nthe Nazis introduced the compulsory yellow star badge that identified the wearer as a Jew causing Hartogs further distress. It was in\n1941\nthat Hartogs and his wife were given advice by a lawyer that in order to protect Hartogs' wife she should divorce him. This was a painful process for Hartogs and the process was deliberately drawn out to be as lengthy as possible. In early\n1943\nthe divorce was finalised but Hartogs continued to live in his wife's house and the authorities turned a blind eye. The indignity and humiliation that Hartogs had suffered for ten years finally became too much for him and in August\n1943\nhe took his own life by taking an overdose of barbiturates.\nHartogs is best known for his results on the representation of analytic functions of several variables by means of power series. In particular 'Hartogs' Theorem', which he included in his habilitation thesis and the resulting major\n1906\npaper, concerns the removability of compact singularities for\nholomorphic\nfunctions in\nn\n>\n1\nn > 1\nn\n>\n1\ncomplex variables. Daniele Struppa writes in\n[\n4\n]\n:-\nWhen Hartogs originally proved this result, the mathematical community regarded it as one of the most striking facts of the theory of several complex variables, and even now Hartogs' discovery is still regarded as a quite basic reason for the differences between analysis in\nC\n\\mathbb{C}\nC\nand analysis in\nC\nn\n\\mathbb{C}^{n}\nC\nn\n, and its many possible generalizations have since intrigued many mathematicians.\nOne special case of Hartogs' Theorem is known as 'Hartogs' Ball Theorem' which shows that any holomorphic function on an annular region of complex space of dimension greater than\n1\ncan be extended to the disk containing that annulus. In\n[\n3\n]\nthere is a brief description of further contributions by Hartogs:-\nLikewise, his name lives on in the Hartogs figure, which represents the simplest example of a region which is not a domain of holomorphy, and in Hartogs domains\n(\nconvergence ranges for certain series\n)\n. He further proved the important fact that a function of several complex variables is holomorphic if it is holomorphic in each variable separately; this result is particularly striking because the corresponding statement for real variables is totally false. Through his contributions to several complex variables, Hartogs became the founding father of the theory of complex analysis in several variables.\nWe end this biography by giving a few examples of Hartogs' publications:\nÜber neuere Untersuchungen auf dem Gebiete der analytischen Funktionen mehrerer Variablen\nⓉ\n(\nOn recent studies in the field of analytic functions of several variables\n)\n(1907)\n;\nÜber die aus den singulären Stellen einer analytischen Funktion mehrerer Veränderlichen bestehenden Gebilde\nⓉ\n(\nOn the structure of singular points of an analytic function of several variables\n)\n(1909)\n;\nÜber die Bedingungen, unter welchen eine analytische Funktion mehrerer Veränderlichen sich wie eine rationale verhält\nⓉ\n(\nOn the conditions under which an analytic function of several variables behaves like a rational\n)\n(1911)\n;\nÜber das Problem der Wohlordnung\nⓉ\n(\nOn the problem of well-ordering\n)\n(1915)\n; Beweis des Jordanschen Kurvensatzes\nⓉ\n(\nProof of the Jordan curve theorem\n)\n(1925)\n;\nÜber die Grenzfunktionen beschränkter Folgen von analytischen Funktionen\nⓉ\n(\nOn the limited effects of limit functions of analytic functions\n)\n(1928)\n;\n(\nwith A Rosenthal\n)\nÜber Folgen analytischer Funktionen\nⓉ\n(\nOn the effects of analytic functions\n)\n(1928)\n;\n(\nwith A Rosenthal\n)\nÜber Folgen analytischer Funktionen\nⓉ\n(\nOn the effects of analytic functions\n)\n(1931)\n;\nZur Darstellung und Erweiterung der Baireschen Funktionen\nⓉ\n(\nOn the presentation and extension of Baire functions\n)\n(1937)\n; and\nBemerkung zu meiner Arbeit über Bairesche Funktionen\nⓉ\n(\nComments on my work on Baire functions\n)\n(1937)\n.",
  "matematicos_citados_na_biografia": [
    "Realgymnasium",
    "Georg Frobenius",
    "Lazarus Fuchs",
    "Hermann Schwarz",
    "Max Planck",
    "Ferdinand von Lindemann",
    "Alfred Pringsheim",
    "Pringsheim",
    "habilitating",
    "privatdozent",
    "Abraham Fraenkel",
    "Arthur Schönflies",
    "Oskar Perron",
    "Constantin Carathéodory",
    "Heinrich Tietze",
    "holomorphic"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}