{
  "nome_completo": "Friedrich Josef Maria Horn",
  "nome_curto": "Friedrich Horn",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Horn/",
  "data_nascimento": "9 October 1927",
  "local_nascimento": "Vienna, Austria",
  "data_morte": "17 December 1978",
  "local_morte": "Vienna, Austria",
  "summary": "Friedrich Horn was an Austrian mathematician who applied mathematics to chemical engineering.",
  "biografia": "Friedrich Horn\n(\nknown as Fritz\n)\nwas not the ideal pupil at school. He explained what happened in an interview he gave in\n1972\n[\n1\n]\n:-\nHorn insists, with a gentle Viennese lilt to his voice, that he was not very good at school. That he was, in fact, a high school drop out. Well not quite - \"You see,\" he adds with a twinkle, \"I had 'difficulties' in high school because I only did what I wanted to do.\" As a result, he could not finish academic high school and went to a technical school instead.\nHis favourite subject was mathematics when he was at the technical school in Vienna and he wanted to study mathematics at university. However, he could not study Latin at technical school so was unable to enter the University of Vienna to study mathematics since Latin was a prerequisite. Deciding that theoretical physics was the closest subject to mathematics which was now open to him, he entered the Vienna Technische Hochschule where he studied theoretical physics and graduated with a Diplom Ingenieur in\n1954\n. The economic conditions meant that, although he would have liked to continue to study, he had to look for work.\nAfter graduating, Horn went to work for Farbwerke Hoechst AG, a German chemicals company based in Frankfurt, Germany. This company had been founded in\n1863\nin Höchst, near Frankfurt, but the company suffered greatly during World War II and, after it was re-founded in Frankfurt in December\n1951\n, it expanded rapidly acquiring several other companies in\n1953\n. Horn was employed as a physicist with Farbwerke Hoechst where he was assigned to work in a chemical process engineering department headed by Leopold Küchler. Küchler had been a research student at the University of Vienna and had\nhabilitated\nat Göttingen in\n1943\n. At Farbwerke Hoechst, in addition to supervising his work for the company, Küchler was essentially Horn's thesis advisor. In Küchler's department at Farbwerke Hoechst, Horn\n[\n2\n]\n:-\n... was introduced to chemical plant equipment and began the researches into the theory of optimal design and operation of chemical reactors which were to occupy much of the remainder of his life. The ensuing eight years at Hoechst were one of his most productive periods, and the seventeen publications which resulted may be said to have laid the foundations of the systematic mathematical theory of reactor optimization.\nAlthough working in Frankfurt, he was still registered as a research student at the Vienna Technische Hochschule and for several years he travelled back and forward between the two cities, an experience that he did not enjoy. In\n1955\n-\n56\n, he developed mathematical models of chemical processes and optimisation processes designed to be implemented on computers. Although he did not write code himself, he won the 'Max Buchner Preis der Dechema für\n1963\n' for this work. Horn's first publication\nZur Berechnung der Zusammensetzung und Thermodynamischen Funktionen Dissoziierender Verbrennungsgase\nⓉ\n(\nCalculating the composition and thermodynamic functions dissociating combustion gases\n)\n(\nwritten jointly was A Schüller\n)\nappeared in print in\n1957\n. In the same year his single authored paper\nVerweilzeitverteilung und Chemische Reaktion\nⓉ\n(\nResidence time and chemical reaction\n)\nappeared. He submitted his thesis\nOptimum Problems for Continuous Chemical Processes\nto the Vienna Technische Hochschule and was awarded a doctorate, the Dr.techn., in\n1958\n.\nA significant event had occurred in the previous year when Horn attended the First European Symposium on Chemical Reaction Engineering which was held in Amsterdam in May\n1957\n. There he met Kenneth George Denbigh\n(1911\n-\n2004)\nwho was a chemical engineer and philosopher of science. Denbigh was at that time Professor of Chemical Technology at Edinburgh University and Heriot-Watt University in Scotland. Horn remained in contact with Denbigh who moved to Imperial College, London, in\n1960\nwhere he became the Courtaulds Professor of Chemical Engineering. Denbigh persuaded Horn to join him at Imperial College so, in\n1962\n, he left Farbwerke Hoechst and moved to London where he took up his first academic post. Of course, he now had to give lectures in English\n[\n2\n]\n:-\nAt the time, his knowledge of English was rudimentary, but within a year he had mastered his adopted language well enough to lecture fluently, though his speech remained unmistakably Viennese throughout his life.\nWhile at Imperial College, Horn received an invitation to spend several weeks at the University of Minnesota working with Rutherford \"Gus\" Aris\n(1929\n-\n2005)\nand Neal R Amundson\n(1916\n-\n2011)\n. Horn found the research atmosphere in the United States very much to his liking and later in\n1964\nhe accepted an offer from Rice University in Houston, Texas\n[\n2\n]\n:-\nDespite an active research program and extensive travels, both within the United States and abroad, he established a reputation as one of the most stimulating teachers on campus, and was instrumental in establishing a Department of Mathematical Sciences. He served as the Founding Chairman of this department\n(\nin\n1968\nand\n1969)\n, and also as Acting Chairman of the Chemical Engineering Department\n(\nin\n1967)\n.\nHorn was one of the founders of the\nJournal of Optimization Theory and Applications\nin\n1967\nand he became an associate editor. He published a number of articles\n(\nsome in collaboration with colleagues\n)\nin the first few volumes of the journal such as:\nOptimum distributed feed reactors for exothermic reversible reactions\n(1967)\n;\nThe use of the adjoint variables in the development of improvement criteria for chemical reactors\n(1967)\n;\nAn application of the theorem of relaxed control to the problem of increasing catalyst selectivity\n(1968)\nand\nComparison between two sufficient conditions for improvement of an optimal steady-state process by periodic operation\n(1971)\n. Other papers he published with a high mathematical content include\nGeneral mass action kinetics\n(1972)\nand\nNecessary and sufficient conditions for complex balancing in chemical kinetics\n(1972)\nboth in the\nArchive for Rational Mechanics and Analysis\n.\nBy the time these last two papers were published, Horn had left Rice. He had spent the academic year\n1969\n-\n70\nat Carnegie-Mellon University before taking up the chair of chemical engineering in the College of Engineering and Applied Science at the University of Rochester in Rochester, New York\n[\n2\n]\n:-\n... there he began to construct a conceptually novel theory of chemical dynamics which was to claim most of his attention for the rest of his life. The consequences of these ideas are still being developed by other workers, notably his Rochester colleague Martin Feinberg, and it will be many years before they are fully explored.\nMartin Feinberg, a chemical engineer and mathematician working on fluid mechanics, was a professor of chemical engineering at Rochester having been awarded a Ph.D. on fluid mechanics from Princeton in\n1968\n.\nHorn's graduate students at Rochester spoke of him\n[\n1\n]\n:-\n... with a mixture of admiration, awe, and amusement. Amidst stories of his wit\n(\na typical class opening line: \"This book is very dry; if there was another flood you could use it as a raft\"\n)\n. They will tell you of his expertise\n(\n\"He's amazing, capable of seeing things you never dreamed of\"\n)\nand kindness\n(\n\"You can go to him with the slightest problem. He wants you to understand fully so that you don't waste time doing something wrong\"\n)\n. As one student put it, \"He makes you work hard. He's inspiring and - fun.\"\nIn\n1973\nhe suffered a stroke and, although he appeared to make a complete recovery, he felt that his research abilities had diminished. To add to his heartache, he suffered the tragic loss of his son and, in January\n1977\n, he resigned his position at Rochester and returned to his native city of Vienna where he died in the following year.",
  "matematicos_citados_na_biografia": [
    "habilitated"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}