{
  "nome_completo": "Frieda Nugel",
  "nome_curto": "Frieda Nugel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nugel/",
  "data_nascimento": "18 June 1884",
  "local_nascimento": "Cottbus, Brandenburg, Germany",
  "data_morte": "6 November 1966",
  "local_morte": "Bad Godesberg, Bonn, Germany",
  "summary": "Frieda Nugel was a German mathematician who was one of the first women to receive a doctorate in Germany.",
  "biografia": "Frieda Nugel\n's parents were Friedrich Arthur Nugel, a teacher and organist, and Marie Bomb. She was the fourth of her parents six children. The family were members of the Evangelical Lutheran Church, and Frieda received her early education at home given by her father. She then studied at a girls school, the Mädchen-Mittelschule in Cottbus, until\n1901\n. At that time she began her studies at the Höhere Mädchenschule where she remained until\n1906\nwhen she went to Berlin to sit the state examinations to become a teacher.\nBeginning in the spring of\n1906\nshe taught for about eighteen months as a teacher at the manor house of the Werdeck family near Cottbus. At the same time she took private mathematics instruction with Rudolf Tiemann so that she could take the final level school examinations. She could only sit these in Berlin, which she did at the Luisenstädtischen High School on\n16\nSeptember\n1907\n. Nugel then began her studies at Berlin University, attending lectures in mathematics, physics and German. It is worth looking for a moment at the mathematics department where Nugel was receiving her education.\nUntil he last years of the\n19\nth\ncentury, Berlin had been the leading centre for mathematics in Germany, perhaps in the world, with\nKummer\n,\nWeierstrass\nand\nKronecker\n. However\nSchwarz\nhad succeeded\nWeierstrass\naccepting a professorship in Berlin in\n1892\n;\nKronecker\ndied in\n1891\nand was succeeded by\nFrobenius\n; and\nKummer\nhad retired and been replaced by\nFuchs\n.\nSchwarz\ncertainly seemed to give up mathematics after his appointment and it was left largely to\nFrobenius\nto try to maintain Berlin's leading status. Göttingen soon was recognised at the dynamic centre of German mathematics. The final sign that Göttingen had overtaken Berlin came in\n1902\nwhen\nFrobenius\nand\nSchwarz\nchose\nHilbert\nto succeed to the Berlin chair which had become vacant on the death of\nFuchs\n.\nHilbert\nturned down the offer, preferring to remain at Göttingen. He became the first mathematician since\nGauss\nto turn down a chair at Berlin, considered up to that time as the ultimate goal a mathematician could reach. The Berlin chair was then filled by\nSchottky\nwho was a personal friend of\nFrobenius\nbut, like\nSchwarz\nbefore him, he had moved to Berlin after his best days for mathematical research were behind him. Nugel attended lectures by\nFrobenius\nand\nSchur\n, who at the time was a dynamic young lecturer. She also attended lectures by Oskar Knobloch, Eugen Blasius, Arthur Wehnelt, and Heinrich Rubens.\nAfter three terms of study in Berlin, Nugel moved to the University of Munich where she spent one term attending lectures by\nFerdinand Lindemann\nand Aurel Voss. Then, beginning in the autumn of\n1909\n, she began her doctoral studies at Halle. Her research supervisor was\nAugust Gutzmer\n, but she also gained considerable benefit by attending lectures by\nCantor\nand\nWangerin\n. She submitted her thesis\nDie Schraubenlinien. Eine monographische Darstellung\nⓉ\n(\nThe helices. A monographic presentation\n)\nto the Martin-Luther University of Halle-Wittenberg in\n1912\nand she was given oral examinations in mathematics, physics and philosophy over the two days\n27\n-\n28\nFebruary. She was awarded the degree with distinction, graduating on\n9\nJuly\n1912\n. In receiving a doctorate in mathematics, Nugel became one of the first German women to receive such a degree. Before her was\nMarie Gernet\n(\nawarded\n1895\nby Heidelberg\n)\n, Annie Reineck\n(\nawarded\n1907\nby Bern\n)\nand\nEmmy Noether\n(\nawarded\n1908\nby Erlangen\n)\n. Later in July Nugel passed the state examinations qualifying her to teach mathematics, physics and German in a\nGymnasium\n.\nImmediately after passing these examinations, Nugel was appointed as a teacher in the Augusta school on Cottbus. By this time she was engaged to be married to Louis Hahn who had been a research student studying for his doctorate in history at Halle at the same time as Nugel. They were married on\n4\nApril\n1914\nand Nugel left her teaching post at Cottbus at this time and the newly married couple moved to Altena, Westphalia, where Louis Hahn had a job as an editor. On\n1\nMarch\n1915\ntheir first daughter Ingeborg was born and near the end of the year they moved from Altena to Emden. This was Louis Hahn's home town and there he took over as editor of a newspaper owned by his family.\nOf course World War I had begun in August\n1914\nand Frieda Hahn had to make a contribution to the war effort despite having a young family. From the spring of\n1916\nshe did war work at the Kaiser-Friedrich-Oberrealschule, but with her second child due she took a break from December\n1916\nuntil the spring of\n1917\n. Her second child, Helmut was born on\n2\nMarch\n1917\nand she returned to her work very shortly after the birth. She continued with this war work until the end of\n1918\n. She had two further children, Gerold born on\n17\nOctober\n1920\nand Waltraut born on\n11\nSeptember\n1922\n. With a young family Frieda Hahn could not take employment, but she was able to give private tuition in  mathematics, physics and German in her home, which she did for ten years from\n1918\nto\n1928\n[\n2\n]\n:-\nAll their children developed well under their care and showed particularly strong mathematical achievements.  The daughters studied at the Lyzeum in Emden, the sons at the High School ...  Apart from the tasks of educating she had to solve, and fitting in the private instruction which she gave,\n[\nFrieda\n]\nalso supported the journalistic and historical work of her husband during the years of the Weimar Republic.\nHowever the\n1920\ns were years of extreme difficulty in Germany with much political unrest. In January\n1923\nthere was military occupation of the German industrial district in the Ruhr valley by France and Belgium. This triggered the beginning of hyperinflation and many businesses collapsed. One of these was the newspaper business of which Louis Hahn was both manager and editor. With no job, he worked at home, mostly doing unpaid work. It fell to Frieda Hahn to support the family and she returned to teaching. She taught for a few hours a week at the Kaiserin-Augusta-Viktoria school in Emden but in order to enter school teaching full time she had to take examinations again in Berlin. She took the examinations on\n1\nOctober\n1928\nand then took up full time teaching in Emden from\n1\nJuly\n1930\n. As she had done earlier she taught mathematics, physics and German.\nAs World War II progressed conditions became increasingly difficult in Emden, particularly since it was the German seaport for Westphalia. The town came under increasing British and American bomb attacks and a decision was taken to move the Emden school to Bad Wildungen. Frieda Hahn had to leave her husband in Emden, which must have been a terrible experience for her knowing that the town was continually under attack. Indeed the school buildings in Emden were destroyed on\n5\nSeptember\n1944\n. However far worse was knowing that her two sons were in extreme danger, Helmut as a Captain in Russia and Gerold as a Lieutenant in Lorraine. In the summer of\n1944\nshe received the word that she had feared; both of her sons were missing, presumed dead. There was only a few weeks between the two messages. Confirmation of the deaths was not made until\n1961\n. Although Louis Hahn survived the war, he died in\n1952\nafter a long illness. Frieda had retired from teaching in\n1945\nand cared for her husband through his illness.\nFrieda Hahn continued to live in Emden, but after the death of her husband she lived with her daughter Ingeborg. Her younger daughter Waltraut was married and living in Bonn. In\n1955\nshe moved to Bad Godesberg to support her younger daughter and there she helped to educate her three grandchildren. In\n1962\n, fifty years after obtaining her doctorate, her thesis was deemed \"mathematically historically particularly valuable\" and she was honoured by the Martin-Luther University of Halle-Wittenberg. She also received honours from Bonn and from Cottbus.\nThere is one aspect of Frieda Hahn's life which we have not mentioned above. This is the articles she wrote arguing for women's rights, for better education for women, and argued from her own experiences on how the school education system might be improved. These essays include\nDie deutsche Hausfrau und der Krieg\nⓉ\n(\nThe German housewife and the war\n)\n(1916)\n,\nFrauenbewegung und Kinderemanzipation\nⓉ\n(\nWomen's movement and child emancipation\n)\n(1919)\n,\nDie Frau in der Gemeindeverwaltung\nⓉ\n(\nThe woman in the local administration\n)\n(1921)\n, and\nStaat und Stadt Hamburg: Die dreijährige Grundschule vom Standpunkt der Mutter\nⓉ\n(\nState and city of Hamburg: The three-year primary school from the standpoint of the mother\n)\n(1925)\n.",
  "matematicos_citados_na_biografia": [
    "Kummer",
    "Weierstrass",
    "Kronecker",
    "Schwarz",
    "Frobenius",
    "Fuchs",
    "Hilbert",
    "Gauss",
    "Schottky",
    "Schur",
    "Ferdinand Lindemann",
    "August Gutzmer",
    "Cantor",
    "Wangerin",
    "Marie Gernet",
    "Emmy Noether",
    "Gymnasium"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}