{
  "nome_completo": "Frigyes Riesz",
  "nome_curto": "Frigyes Riesz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Riesz/",
  "data_nascimento": "22 January 1880",
  "local_nascimento": "Györ, Austria-Hungary (now Hungary)",
  "data_morte": "28 February 1956",
  "local_morte": "Budapest, Hungary",
  "summary": "Riesz was a founder of functional analysis and his work has many important applications in physics.",
  "biografia": "Frigyes Riesz\n's father Ignácz Riesz was a medical man and Frigyes's his younger brother,\nMarcel Riesz\n, was himself a famous mathematician.\nFrigyes\n(\nor Frederic in German\n)\nRiesz studied at Budapest. He went to Göttingen and Zürich to further his studies and obtained his doctorate from Budapest in\n1902\n. His doctoral dissertation was on geometry. He spent two years teaching in schools before being appointed to a university post.\nRiesz was a founder of\nfunctional analysis\nand his work has many important applications in physics. He built on ideas introduced by\nFréchet\nin his dissertation, using\nFréchet\n's ideas of distance to provide a link between\nLebesgue\n's work on real functions and the area of\nintegral equations\ndeveloped by\nHilbert\nand his student\nSchmidt\n.\nIn\n1907\nand\n1909\nRiesz produced representation theorems for functional on quadratic\nLebesgue\nintegrable functions and, in the second paper, in terms of a\nStieltjes\nintegral. The following year he introduced the space of\nq\nq\nq\n-fold\nLebesgue\nintegrable functions and so he began the study of normed function spaces, since, for\nq\n≥\n3\nq ≥ 3\nq\n≥\n3\nsuch spaces are not\nHilbert spaces\n. Riesz introduced the idea of the 'weak convergence' of a sequence of functions\n(\nf\nn\n(\nx\n)\nf_{n}(x)\nf\nn\n​\n(\nx\n)\n)\n. A satisfactory theory of series of orthonormal functions only became possible after the invention of the\nLebesgue\nintegral and this theory was largely the work of Riesz.\nRiesz's work of\n1910\nmarks the start of operator theory. In\n1918\nhis work came close to an axiomatic theory for Banach spaces, which were set up axiomatically two years later by\nBanach\nin his dissertation.\nRiesz was appointed to a chair in Kolozsvár in Hungary in\n1911\n. However, the Hungarian government was forced to sign the Treaty of Trianon on\n4\nJune,\n1920\n. Hungary was left with less than one third of the land that had previously been Hungary. Romania, Czechoslovakia and Yugoslavia all took over large areas but Austria, Poland and Italy also gained land from Hungary. Kolozsvár was no longer in Hungary after the Treaty of Trianon but rather it was in Romania and was renamed Cluj, so the Hungarian University there had to move within the new Hungarian borders and it moved to Szeged in\n1920\n, where there had previously been no university.\nIn Szeged in\n1922\nRiesz set up the\nJános Bolyai\nMathematical Institute in a joint venture with\nHaar\n. Of course the Institute was named after the famous Hungarian mathematician whose birthplace was Kolozsvár, the town from which the university had just been forced to move. Riesz became editor of the newly founded journal of the Institute\nActa Scientiarum Mathematicarum\nwhich quickly became a major source of mathematics. Riesz was to publish many papers in this journal, the first in\n1922\nbeing on\nEgorov\n's theorem on linear functionals. It was published in the first part of the first volume.\nIn\n1945\nRiesz was appointed to the chair of mathematics in the University of Budapest.\nMany of Riesz's fundamental findings in functional analysis were incorporated with those of\nBanach\n. His theorem, now called the Riesz-\nFischer\ntheorem, which he proved in\n1907\n, is fundamental in the\nFourier analysis\nof Hilbert space. It was the mathematical basis for proving that\nmatrix\nmechanics and wave mechanics were equivalent. This is of fundamental importance in early\nquantum theory\n.\nRiesz made many contributions to other areas including\nergodic theory\nwhere he gave an elementary proof of the mean ergodic theorem in\n1938\n. He also studied orthonormal series and\ntopology\n.\nRogosinski\n, in\n[\n7\n]\n, writes of Riesz's style:-\nThe work of F Riesz is not only distinguished by the genuine importance of his results, but also by his aesthetic discernment in mathematical taste and diction. ... The more leisurely mastership of F Riesz's style, whether he writes in his native Hungarian, or in French or German, conveys such pleasure and is to the older mathematician a nostalgic remainder of what we are in danger to lose. For him there was no mere abstraction for the sake of a structure theory, and he was always turning back to the applications in some concrete and substantial situation.\nHis book\nLeçon's d'analyse fonctionnelle\nⓉ\n(\nLectures on functional analysis\n)\nis one of the most readable accounts of functional analysis ever written.\nRogosinski\n, in\n[\n7\n]\n, describes this book which Riesz wrote jointly with his student B Szökefalvi-Nagy as follows:-\nHere, in the first half written by himself, we find the old master picturing to us Real Analysis as he saw it, lovingly, leisurely, and with the discerning eye of an artist. This book, I have no doubt, will remain a classic in the treasure house of mathematical literature. With it, and with all his other work, will live the memory of Frederic Riesz as a great and fertile mathematician for long in the history of our art.\nRiesz received many honours for his work. He was elected to the\nHungarian Academy of Sciences\nand, in\n1949\n, he was awarded its Kossuth Prize. He was elected to the Paris\nAcademy of Sciences\nand to the Royal Physiographic Society of Lund in Sweden. He received honorary doctorates from the universities of Szeged, Budapest and Paris.",
  "matematicos_citados_na_biografia": [
    "Marcel Riesz",
    "functional analysis",
    "Fréchet",
    "Lebesgue",
    "integral equations",
    "Hilbert",
    "Schmidt",
    "Stieltjes",
    "Hilbert spaces",
    "Banach",
    "János Bolyai",
    "Haar",
    "Egorov",
    "Fischer",
    "Fourier analysis",
    "matrix",
    "quantum theory",
    "ergodic theory",
    "topology",
    "Rogosinski",
    "Hungarian Academy of Sciences",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}