{
  "nome_completo": "Godfrey Harold Hardy",
  "nome_curto": "G H Hardy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hardy/",
  "data_nascimento": "7 February 1877",
  "local_nascimento": "Cranleigh, Surrey, England",
  "data_morte": "1 December 1947",
  "local_morte": "Cambridge, England",
  "summary": "Hardy 's interests covered many topics of pure mathematics:- Diophantine analysis, summation of divergent series, Fourier series, the Riemann zeta function and the distribution of primes.",
  "biografia": "G H Hardy\n's father, Isaac Hardy, was bursar and an art master at Cranleigh school. His mother Sophia had been a teacher at Lincoln Teacher's Training School. Both parents were highly intelligent with some mathematical skills but, coming from poor families, had not been able to have a university education. Hardy\n(\nhe was always known as Hardy except to one or two close friends who called him Harold\n)\nattended Cranleigh school up to the age of twelve with great success\n[\n6\n]\n:-\nHis parents knew he was prodigiously clever, and so did he. He came top of his class in all subjects. But, as a result of coming top of his class, he had to go in front of the school to receive prizes: and that he could not bear.\nHardy did not appear to have the passion for mathematics that many mathematicians experience when young. Hardy himself writes in\n[\n5\n]\n:-\nI do not remember having felt, as a boy, any passion for mathematics, and such notions as I may have had of the career of a mathematician were far from noble. I thought of mathematics in terms of examinations and scholarships: I wanted to beat other boys, and this seemed to be the way in which I could do so most decisively.\nIndeed he did win a scholarship to Winchester College in\n1889\n, entering the College the following year. Winchester was the best school in England for mathematical training yet, despite admitting later in life that he had been well-educated there, Hardy disliked everything about the school other than the academic training he received. Like all public schools it was a rough place for a frail, shy boy like Hardy. It is significant that although he did have a passion for ball games in general and cricket in particular, he was never coached in sport at Winchester. Somehow he failed to take part fully in the non-academic activities.\nWhile at Winchester Hardy won an open scholarship to Trinity College, Cambridge, which he entered in\n1896\n. At Cambridge Hardy was assigned to the most famous coach R R Webb. He quickly realised that the point of the training was simply to achieve the best possible marks in the examinations by learning all the tricks of the trade. He was shocked to discover that Webb was not interested in the subject of mathematics, only in the tricks of examinations.\nBriefly Hardy thought he might change topics and study history instead. However, he managed to change his coach to\nA E H Love\n. Hardy expresses his gratitude to\nLove\nin\n[\n6\n]\n:-\nMy eyes were first opened by\nProfessor Love\n, who first taught me a few terms and gave me my first serious conception of analysis. But the great debt which I owe to him was his advice to read\nJordan\n's \"Cours d'analyse\"; and I shall never forget the astonishment with which I read that remarkable work, the first inspiration for so many mathematicians of my generation, and learnt for the first time as I read it what mathematics really meant.\nHardy was placed as fourth\nwrangler\nin the Mathematical Tripos of\n1898\n, a result which continued to annoy him for, despite feeling that the system was very silly, he still felt that he should have come out on top. Hardy was elected a fellow of Trinity in\n1900\nthen, in\n1901\n, he was awarded a Smith's prize jointly with\nJ H Jeans\n'with unspecified relative merit'.\nThe next period of Hardy's career was up to\n1911\nwhen, as\nBurkill\nwrites in\n[\n1\n]\n, he:-\n... wrote many papers on the convergence of series and integrals and allied topics. Although this work established his reputation as an analyst, his greatest service to mathematics in this early period was \"A course of pure mathematics\"\n(1908)\n. This work was the first rigorous English exposition of number, function, limit, and so on, adapted to the undergraduate, and thus it transformed university teaching.\nThis was a period of which Hardy wrote himself\n[\n4\n]\n:-\nI wrote a great deal... but very little of any importance; there are not more than four or five papers which I can still remember with some satisfaction.\nIt is worth noting at this point that Hardy was a remarkably honest man, and in particular he was very honest about his own abilities, strengths and weaknesses.\nA major change in Hardy's work came about in\n1911\nwhen he began his collaboration with\nJ E Littlewood\nwhich was to last\n35\nyears. Then in early\n1913\nhe received\nRamanujan\n's first letter from India which was to start his second major collaboration. By the time World War I started in\n1914\n,\nRamanujan\nwas in Cambridge and this eased for Hardy what was to be a very difficult period.\nLittlewood\nleft Cambridge for war service in the Royal Artillery. Hardy volunteered for war service but was rejected on medical grounds. However Hardy's views on the war left him at odds with most of his colleagues at Cambridge. He had great respect for Germany\n[\n6\n]\n:-\n... he had a strong feeling for Germany. Germany had, after all, been the great educating force of the nineteenth century. To Eastern Europe, to Russia, to the United States, it was the German universities which had taught the meaning of research. ... in most respects the German culture, including its social welfare, appeared to him higher than his own. ... Hardy, like\nRussell\n... did not believe that the war should have been fought. Further, with his ingrained distrust of English politicians, he thought the balance of wrong was on the English side.\nDeeply unhappy at Cambridge, Hardy took the opportunity to leave in\n1919\nwhen he was appointed as Savilian professor of geometry at Oxford. These were in many ways the years when he was happiest and also the years when he produced his best mathematics in the collaboration with\nLittlewood\n. This collaboration was achieved during a period when\nLittlewood\nwas in Cambridge and Hardy was in Oxford, making joint research a quite difficult logistical exercise. As Hardy wrote in\n[\n5\n]\n:-\nI was at my best at a little past forty, when I was a professor at Oxford.\nDespite his background and the positions he held, Hardy preferred the poor and disadvantaged to those he called the 'large bottomed' who included\n[\n6\n]\n:-\n... the confident, booming, imperialist bourgeois English. The designation included most bishops, headmasters, judges, and all politicians, with the single exception of Lloyd George.\nHe had chosen not to live in the best rooms while at Cambridge, and\nHilbert\nwas so concerned that Hardy was not being properly treated that he wrote to the Master of the College pointing out that the best mathematician in England should have the best rooms. However, Hardy did not think that way. He held a trade union office for two years\n(1924\n-\n26)\nas President of the Association of Scientific Workers. At a time when it seemed difficult to do so, Hardy liked equally both the United States and Russia. He spent the academic year\n1928\n-\n29\nat Princeton in an exchange with\nVeblen\n, who spent the year in Oxford.\nDespite having been unhappy at Cambridge, Hardy returned to the Sadleirian chair there in\n1931\nwhen\nHobson\nretired. Snow in\n[\n6\n]\nsays that Hardy returned to Cambridge for two reasons, firstly that he still considered Cambridge the centre of English mathematics and the Sadleirian chair the foremost mathematics chair in England, and secondly, that he could keep his rooms in College at Cambridge while this was not possible at Oxford. To the unmarried Hardy, this held an attraction as he began to look toward old age.\nHardy's interests covered many topics of pure mathematics -\nDiophantine analysis\n, summation of divergent series,\nFourier series\n, the\nRiemann zeta function\n, and the distribution of\nprimes\n. His long collaboration with\nLittlewood\nproduced mathematics of the highest quality. It was a collaboration in which Hardy acknowledged\nLittlewood\n's greater technical mathematical skills, but at the same time Hardy brought great talents of mathematical insight and a great ability to write their work up in papers with great clarity.\nEven more remarkable was Hardy's collaboration with\nRamanujan\n. Hardy instantly spotted\nRamanujan\n's genius from a manuscript sent to him by\nRamanujan\nfrom India in\n1913\n. Two other top class mathematicians had previously failed to spot the genius. Hardy brought\nRamanujan\nto Cambridge and they wrote five remarkable papers together.\nIt was not only with\nLittlewood\nand\nRamanujan\nthat Hardy collaborated. He was a natural collaborator who also wrote joint papers with\nTitchmarsh\n,\nIngham\n,\nEdmund Landau\n,\nPólya\n,\nE M Wright\n,\nW W Rogosinski\nand\nMarcel Riesz\n.\nHardy was a pure mathematician who hoped his mathematics could never be applied. However in\n1908\n, near the beginning of his career, he gave a law describing how the proportions of dominant and recessive genetic traits would be propagated in a large population. Hardy considered it unimportant but it has proved of major importance in blood group distribution.\nThere was only one passion in Hardy's life other than mathematics and that was cricket. In fact for most of his life his day, at least during the cricket season, would consist of breakfast during which he read\nThe Times\nstudying the cricket scores with great interest. After breakfast he would work on his own mathematical researches from\n9\no'clock till\n1\no'clock. Then, after a light lunch, he would walk down to the university cricket ground to watch a game. In the late afternoon he would walk slowly back to his rooms in College. There he took dinner, which he followed with a glass of wine. When cricket was not in season, it was the Australian cricket scores he would read in\nThe Times\nand he would play real tennis in the afternoons.\nHardy was known for his eccentricities. He could not endure having his photograph taken and only five snapshots are known to exist. He also hated mirrors and his first action on entering any hotel room was to cover any mirror with a towel. He always played an amusing game of trying to fool God\n(\nwhich is also rather strange since he claimed all his life not be believe in God\n)\n. For example, during a trip to Denmark he sent back a postcard claiming that he had proved the\nRiemann hypothesis\n. He reasoned that God would not allow the boat to sink on the return journey and give him the same fame that\nFermat\nhad achieved with his \"\nlast theorem\n\".\nAnother example of his trying to fool God was when he went to cricket matches he would take what he called his \"anti-God battery\". This consisted of thick sweaters, an umbrella, mathematical papers to referee, student examination scripts etc. His theory was that God would think that he expected rain to come so that he could then get on with his work. Since Hardy thought that God would then have the sun shine all day to spite him, he would be able to enjoy the cricket in perfect sunshine.\nAs World War I had been painful for Hardy, World War II was equally so. He had remained remarkably youthful in both mind and body until\n1939\nwhen, at the age of\n62\n, he had a heart attack. His remarkable mental powers began to leave him and sports which he had loved to participate in up till then became impossible. He was filled with anger that Europe had again entered the lunacy of war. However, Hardy had one further gift to leave to the world, namely\nA mathematicians apology\nwhich has inspired many towards mathematics.\nHardy's book\nA mathematicians apology\nwas written in\n1940\n. It is one of the most vivid descriptions of how a mathematician thinks and the pleasure of mathematics. But the book is more, as Snow writes in\n[\n6\n]\n:-\nA mathematicians apology is, if read with the textual attention it deserves, a book of haunting sadness. Yes, it is witty and sharp with intellectual high spirits: yes, the crystalline clarity and candour are still there: yes, it is the testament of a creative artist. But it is also, in an understated stoical fashion, a passionate lament for creative powers that used to be and that will never come again. I know nothing like it in the language: partly because most people with the literary gift to express such a lament don't come to feel it: it is very rare for a writer to realise, with the finality of truth, that he is absolutely finished.\nThe following quotation from\nA mathematicians apology\n(\n[\n5\n]\n)\ngives a clear idea of Hardy's thoughts on mathematics:-\nThe mathematician's patterns, like those of the painter's or the poet's, must be beautiful, the ideas, like the colours or the words, must fit together in a harmonious way. There is no permanent place in the world for ugly mathematics.\nBy the time the war ended in\n1945\nHardy's health was failing fast. He longed to be creative again, for that was all that really mattered to him in life, but he knew that his creativity was gone and that he became very depressed. By\n1946\nhe could only get around by taking taxi rides, a few steps would make him short of breath. In early summer of\n1947\nhe tried to take his own life by taking a large dose of barbiturates. He took so many, however, that he was sick and survived. Snow writes\n[\n6\n]\n:-\nIn the Evelyn nursing home, Hardy was lying in bed. As a touch of farce, he had a black eye. Vomiting from the drugs, he had hit his head on the lavatory basin. He was self-mocking. He had made a mess of it. ...\nHe talked a little, nearly every time I saw him, about death. He wanted it. He didn't fear it: what was there to fear in nothingness? His hard intellectual stoicism had come back. He would not try to kill himself again. He was not  good at it. He was prepared to wait. With an inconsistency which might have pained him - for he ... believed in the rational to an extent that I thought irrational - he showed an intense hypochondriac curiosity about his own symptoms.\nHardy received many honours for his work. He was elected a Fellow of the\nRoyal Society\nin\n1910\n, he received the Royal Medal of the Society in\n1920\nand\nSylvester\nMedal of the Society in\n1940\n:-\n... for his important contributions to many branches of pure mathematics.\nHe also received the Copley Medal of the\nRoyal Society\nin\n1947\n:-\n... for his distinguished part in the development of mathematical analysis in England during the last thirty years.\nHardy learnt of the award only a few weeks before his death.\nHe is described in\n[\n3\n]\nas follows:-\nHe personified the popular idea of the absent-minded professor. But those who formed the idea that he was merely an absent-minded professor would receive a shock in conversation, where he displayed amazing vitality on every subject under the sun. ... He was interested in the game of chess, but was frankly puzzled by something in its nature which seemed to come into conflict with his mathematical principles.\nHe was president of the\nLondon Mathematical Society\nfrom\n1926\nto\n1928\nand again from\n1939\nto\n1941\n. He received the\nDe Morgan\nMedal of the Society in\n1929\n.",
  "matematicos_citados_na_biografia": [
    "A E H Love",
    "Love",
    "Professor Love",
    "Jordan",
    "wrangler",
    "J H Jeans",
    "Burkill",
    "J E Littlewood",
    "Ramanujan",
    "Littlewood",
    "Russell",
    "Hilbert",
    "Veblen",
    "Hobson",
    "Diophantine analysis",
    "Fourier series",
    "Riemann zeta function",
    "primes",
    "Titchmarsh",
    "Ingham",
    "Edmund Landau",
    "Pólya",
    "E M Wright",
    "W W Rogosinski",
    "Marcel Riesz",
    "Riemann hypothesis",
    "Fermat",
    "last theorem",
    "Royal Society",
    "Sylvester",
    "London Mathematical Society",
    "De Morgan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}