{
  "nome_completo": "Gábor Szegő",
  "nome_curto": "Gábor Szegő",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Szego/",
  "data_nascimento": "20 January 1895",
  "local_nascimento": "Kunhegyes, Hungary",
  "data_morte": "7 August 1985",
  "local_morte": "Palo Alto, California USA",
  "summary": "Gábor Szegő worked in the area of extremal problems and Toeplitz matrices.",
  "biografia": "Gábor Szegő\nwas born in Kunhegyes, a small town of about\n9000\ninhabitants in Hungary about\n140\nkm southeast of Budapest. His parents were Adolf Szegő and Hermina Neuman; the family was Jewish. They registered his birth at the Karcag Rabbinical district on\n27\nJanuary\n1895\n. He attended elementary school in his home town of Kunhegyes but his high school studies were in Szolnok where he attended the humanistic\nGymnasium\nwhere he excelled in mathematics. This Gymnasium, at that time called the Royal Hungarian Gymnasium and since\n1922\nnamed after Verseghy Ferenc, was founded in\n1831\nand was one of the best schools in the region. He graduated from the Szolnok Royal Gymnasium with his\nAbitur\non\n28\nJune\n1912\nand, in the autumn of that year, he matriculated at the Pázmány Péter University in Budapest, which today is known as the\nEötvös Loránd\nUniversity of Budapest. In October of\n1912\n, he won the\nEötvös\nCompetition\n[\n6\n]\n:-\nWinning the competition was much more than a passing event but rather a very important milestone in Szegő's career. The competition, as all mathematically inclined Hungarians know, carried a great deal of prestige. It was especially important for Szegő because it is doubtful that, as a Jew whose family had no connections, he would have been able without it to study or receive the attention that he did. His father had even tried to discourage him from entering the university since he thought that his son would have no future there as a Jew.\nHe entered the Mathematical Society competition in his first year of study and the competition of the Philosophical Faculty of the University in his second year. He won both these competitions, having submitted the essay\nOn the approximation of continuous functions by polynomials\nfor the second of these competitions.\nDuring the summers of\n1913\nand\n1914\nSzegő went to Berlin where he studied under, among others,\nGeorg Frobenius\n,\nHermann Schwarz\n,\nKonrad Knopp\nand\nFriedrich Schottky\n. He then went to Göttingen where he studied with\nDavid Hilbert\n,\nEdmund Landau\nand\nAlfréd Haar\n. He returned to Hungary when World War I broke out and, for a while, continued his university studies. At this time he worked under\nLipót Féjer\n,\nMihály Bauer\n, Manó Beke\n(1862\n-\n1946)\nwho worked at the University of Budapest from\n1900\nto\n1922\n, and\nJózsef Kürschák\n. Interaction with\nGeorge Pólya\nled to Szegő publishing the paper\nEin Grenzwertsatz über die Toeplitzschen Determinanten einer reellen positiven Funktion\nⓉ\n(\nA limit theorem on Toeplitz determinants of a real positive function\n)\nin\nMathematische Annalen\nin\n1915\n.\nPólya\nwrites in\n[\n1\n]\n:-\nOur cooperation started from a conjecture which I found. It was about a\ndeterminant\nconsidered by\nToeplitz\nand others, formed with the\nFourier\n-coefficients of a function f\n(\nx\n)\n. I had no proof, but I published the conjecture and the young Szegő found the proof\n[\n...\n]\nWe have seen here a good example of the fruitful cooperation between two mathematicians. Mathematical theorems often, perhaps in most cases, are found in two steps: first the guess is found; then minutes, or hours, or days, or weeks, or months, perhaps even several years later, the proof is found. Now the two steps can be done by different mathematicians, as we have seen.\nHowever, on\n15\nMay\n1915\nhe enlisted in the Austro-Hungarian cavalry rather than wait until he was conscripted when he would have been made to serve in the army. As well as the cavalry, he served both in the infantry and the artillery, and spent some time in the Air force where he met\nRichard von Mises\nand\nTheodore von Kármán\n. Towards the end of the war he was in Vienna and, after the defeat of Austria-Hungary in November\n1918\n, he remained in the military until the spring of\n1919\nwhen he returned to Budapest to continue his university studies. However, while in Vienna and still serving in the military, he was awarded a Ph.D. on\n8\nJuly\n1918\nby the University of Vienna for a thesis based on the paper we mentioned above, published in\n1915\n. One of the first things that Szegő did when arriving back in Budapest was to marry Erzsébet Anna Neményi, who had just been awarded a Ph.D. in chemistry from the University of Budapest. The marriage took place on\n22\nMay\n1919\nwith Szegő still dressed in military uniform. Gábor and Anna Szegő had two children, Peter\n(\nborn\n1925)\nand Veronika\n(\nborn\n1929)\n.\nJohnny von Neumann\nwas a pupil at the Lutheran Gymnasium in Budapest and had shown such remarkable mathematical abilities that a university teacher was sought to tutor him. This was a quite standard approach in Hungary where extremely talented pupils were supported in this way. The Lutheran Gymnasium approached\nJózsef Kürschák\nwho in turn asked Szegő, who worked as his assistant during\n1919\n-\n1920\n, to tutor the young\nvon Neumann\n. Szegő went to\nvon Neumann\n's home once or twice a week and, over tea, discussed set theory,\nmeasure theory\nand other topics. He set\nJohnny von Neumann\nproblems and his solutions are still preserved. Anna Szegő tells how her husband came home with tears in his eyes after realising the brilliance of his young pupil.\nThe years following World War I were difficult ones in Hungary with Mihály Károlyi's liberal government being replaced with the communist regime of Béla Kun on\n21\nMarch\n1919\n. This was equally short-lived and was overthrown on\n1\nAugust by the military regime of Miklós Horthy. It was clear that Hungary was going to be treated harshly in a post-war settlement and conditions in the country were poor. In particular, the prospect of a permanent academic job seemed remote so when his job in Budapest came to an end in\n1920\n, with help from Maximilian von Neumann,\nJohnny von Neumann\n's father, Szegő went to Berlin. Working towards\nhabilitating\nat the University of Berlin, Szegő became a friend of\nIssai Schur\nand worked with\nRichard von Mises\n,\nLeon Lichtenstein\nand\nErhard Schmidt\n. He was awarded the\n1924\nGyula König\nPrize by the\nEötvös Loránd\nMathematical and Physical Society on\n10\nApril of that year. The committee making the decision was chaired by\nJózsef Kürschák\nand had as members\nGyula Farkas\n,\nDénes König\n, and\nFrederick Riesz\n. Here is an extract from the report:-\nThis year the committee wanted to reward a member of the youngest generation and decided to recommend for the prize Gábor Szegő,\nPrivatdozent\nat the University of Berlin. ... During his eight years of scientific activity Gábor Szegő has produced numerous works. Please permit me to restrict myself to those of his papers that attracted most of my attention by the novelty, beauty, and significance of their results and methods.\nA version of the full report is given at\nTHIS LINK\nHe cooperated with\nPólya\nin bringing out a joint Problem Book:\nAufgaben und Lehrsätze aus der Analysis\nⓉ\n(\nProblems and theorems from calculus\n)\n, volumes I and II\n(1925)\nwhich has since gone through many editions and which has had an enormous impact on later generations of mathematicians.\nPólya\nwrote of their collaboration\n(\nsee\n[\n16\n]\n)\n:-\nIt was a wonderful time; we worked with enthusiasm and concentration. We had similar backgrounds. We were both influenced, like all young Hungarian mathematicians of that time, by\nLipót Fejér\n. We were both readers of the same well-directed 'Hungarian Mathematical Journal' for high school students that stressed problem solving. We were interested in the same kinds of questions, in the same topics; but one of us knew more about one topic, and the other more about some other topic. It was a fine collaboration. The book 'Aufgaben und Lehrsätze aus der Analysis', the result of our cooperation, is my best work and also the best work of Gábor Szegő.\nStuart Jay Sidney, reviewing an English translation of this book which was published in\n1973\n, writes\n[\n27\n]\n:-\nOne is not often afforded the opportunity to review a book which was a classic before one's birth. The original German version of the work under review appeared in\n1924\nand for nearly half a century has been a major force in the education of countless mathematicians. It may well be the granddaddy of all the learn-by-doing advanced mathematics books, a species which the authors are careful to distinguish from the species of problem collection books.\nFor reviews of various German and English versions of this classic text see\nTHIS LINK\n.\nIn\n1926\nSzegő moved to Königsberg to succeed\nKonrad Knopp\nas professor;\nKnopp\nhad moved to Tübingen University. The events of\n1933\nwere devastating for Jewish academics like Szegő. After Hitler came to power the Nazi party organised Boycott Day on\n1\nApril\n1933\n. Jewish shops were boycotted and Jewish professors and lecturers were not allowed to enter the university. On\n7\nApril\n1933\nthe Nazis passed a law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent, with exemptions for participants in World War I and pre-war officials. Szegő qualified for this exemption but things quickly became increasingly difficult.\nPólya\nwas worried for him and wrote from Zürich to\nJacob David Tamarkin\n, who was in the United States, in February\n1934\n:-\nIt was very difficult to write about the chief point which is the fate of Szegő. Well, I shall be brief and plain. I am terribly worried about him. I saw Mrs Szegő in December. I got a letter from Szegő in the beginning of January; although no official measure was taken against him\n[\nuntil the beginning of January\n]\nand no direct collision happened with the students, I cannot see how it would go on indefinitely under those circumstances. He would accept, I understand, any offer even for a short period of\n1\nor\n2\nyears, he should try to get a leave of absence for that time, and see whether he can live with his family on that amount. There is no hope to get something for him in Hungary, says\nFejér\nand also Szegő himself ... I could not do anything for him here in Switzerland ... Excuse this letter, but you see, I am worried. The whole European situation is very dark.\nSzegő visited\nHarald Bohr\nin Copenhagen in May\n1934\nand took the opportunity to write himself to\nTamarkin\nwithout fear that it would be read by Nazis censors which it would have been if he had written from Germany. Reading this letter, it is clear that Szegő did not appreciate the danger that he and his family were in from the Nazis. However,\nHarald Bohr\nunderstood more about the danger that the Szegős were in and he also wrote to\nTamarkin\nwho found a post for Szegő at Washington University in St Louis, Missouri. Both\nPólya\nand\nHarald Bohr\nstrongly advised Szegő to accept and he arrived in the United States to take up the position in the autumn of\n1934\n. He spent the summer of\n1935\nas a visiting professor at Stanford University and in\n1936\nhe was invited to address a meeting of the\nAmerican Mathematical Society\n. In\n1938\nhe was offered the position of Head of Mathematics at Stanford University and he accepted, remaining at Stanford for the rest of his working life. He did undertake war work and, in\n1945\n-\n46\n, he went to Biarritz in France where, as part of his service in the U.S. Army, he was a professor at the military university.\nPeter Lax\nwrites in\n[\n14\n]\nabout Szegő's achievements at Stanford:-\nIn the forties and fifties I spent many summers at Stanford University at the invitation of the Head of the Mathematics Department, Gábor Szegő, who was my uncle by marriage. The Head of a department was in those days a much more powerful figure than a mere chairperson today; he made all decisions, including hiring and firing. Szegő used his powers to turn the provincial mathematics department that Stanford had been under\nHans Frederick Blichfeldt\nand James Victor Uspensky - both remarkable mathematicians - into one of the leading departments of the country that Stanford is today. ... As a young man, Szegő was very shy; by the time he came to the United States, he was a self-assured man with old world courtly manners. Underneath his somewhat aristocratic appearance he was a warm-hearted person, ever willing to help others. He was aware of the absurdities of life and savoured them. He had high standards, but did not expect everyone to live up to them. ... it would be impossible today, as Szegő did in the summer of\n1946\n, to invite all graduate students to his home for a supper of stuffed cabbage and plum dumplings, cooked expertly by his wife. Cooking wasn't Mrs Szegő's only expertise; she was a chemist, and supported the family while Szegő served in the prestigious but barely remunerated position of Privatdozent in Berlin. She was a voracious reader, in four languages, and provided intellectual companionship and stimulation to her husband, and their children. It was a happy household, and I was privileged to be part of it for three summers.\nSzegő worked mainly in function theory\n(\nof one complex variable\n)\n, classical orthogonal polynomials, isoperimetric inequalities, and\nToeplitz\nform. His most important work was in the area of extremal problems and\nToeplitz\nmatrices. This work led him to introduce the notion of the Szegő reproducing kernel. From these beginnings he moved to prove a number of limit theorems, now known as the Szegő limit theorem, the strong Szegő limit theorem and Szegő's orthogonal polynomials and on the unit circle. He produced over\n130\nresearch articles as well as several influential books. In addition to the books he wrote with Pólya, described above, Szegő wrote research monographs on his own work.\nOrthogonal Polynomials\nappeared in\n1939\nand was published by the\nAmerican Mathematical Society\n. It has proved highly successful, running to four editions and many reprints over the years.\nEdward Copson\nwrites\n[\n9\n]\n:-\nThe whole work is characterised by the clarity of exposition and the sustaining of interest which one expects of one of the authors of \"\nPólya\n-Szegő\".\nJames Alexander Shohat writes\n[\n26\n]\n:-\nIt is a remarkable source of powerful methods and far-reaching results in an important field, which will inspire and stimulate further research.\nDunham Jackson writes\n[\n11\n]\n:-\n... no one man has made more significant contributions than the author of the book under review. With creative mastery in particular domains he combines an unusually extensive and penetrating acquaintance with the whole background of mathematical analysis, and almost unique experience in presenting the essentials of complicated theories with the greatest possible compactness.\nFor longer extracts from these reviews and further reviews of the book, see\nTHIS LINK\n.\nIn a collaboration with Ulf Grenander, Szegő wrote\nToeplitz forms and their applications\nwhich was published in\n1958\n.\nMark Kac\npraises the book highly, writing\n[\n13\n]\n:-\nI recommend the book as an outstanding example of the power and beauty of analysis.\nFor a longer extract from this review and further reviews of the book, see\nTHIS LINK\n.\nSzegő retired in\n1960\nand was made Professor Emeritus by Stanford. The health of both Szegő and his wife began to deteriorate and Anna died in\n1966\n. Szegő was diagnosed with Parkinson's disease in\n1970\n. Between\n1973\nand\n1980\nhe spent part of the year in Budapest and part in Palo Alto. It was a long difficult illness and he died at the age of ninety.\nWe have already given some quotes which tell us about Szegő's character. Here is another by Halsey Royden\n[\n22\n]\n:-\nSzegő was very distinguished and autocratic; wore elegant tailor-made suits, and was always regarded with awe by the students and most of the faculty.\nAmong his Ph.D. students at Stanford, we mention Paul Rosenbloom\n(\nthe author of\n[\n19\n]\nand\n[\n20\n]\n)\nand Joseph Ullman. In these papers by Rosenbloom says that, in addition to his mathematical needs, Szegő also was concerned for his cultural education, giving him a ticket to a concert given by Bela Bartók at Stanford in the early\n1940\ns. Szegő's colleagues at Stanford wrote these words in the tribute\n[\n24\n]\n:-\nHe was an outstanding human being. His leadership at our department created a spirit of relaxed but very active cooperation and stimulating exchange of ideas. At the same time his hospitality created a warm social atmosphere and his cultured personality produced in all of us a feeling of respect and admiration. His work remains and will not be forgotten.\nSzegő received a number of honours in addition to the\n1924\nGyula König\nPrize mentioned above. Among these was his election to the\nAustrian Academy of Sciences\n(1960)\nand to the\nHungarian Academy of Sciences\n(1965)\n. In addition we note that his bust has been erected in Kunhegyes with copies in St Louis and in Stanford. In\n2010\nthe Gábor Szegő prize was established to be awarded to an early-career researcher for outstanding research contributions in the area of orthogonal polynomials and special functions.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Abitur",
    "Eötvös Loránd",
    "Eötvös",
    "Georg Frobenius",
    "Hermann Schwarz",
    "Konrad Knopp",
    "Friedrich Schottky",
    "David Hilbert",
    "Edmund Landau",
    "Alfréd Haar",
    "Lipót Féjer",
    "Mihály Bauer",
    "József Kürschák",
    "George Pólya",
    "Pólya",
    "determinant",
    "Toeplitz",
    "Fourier",
    "Richard von Mises",
    "Theodore von Kármán",
    "Johnny von Neumann",
    "von Neumann",
    "measure theory",
    "habilitating",
    "Issai Schur",
    "Leon Lichtenstein",
    "Erhard Schmidt",
    "Gyula König",
    "Gyula Farkas",
    "Dénes König",
    "Frederick Riesz",
    "Privatdozent",
    "THIS LINK",
    "Lipót Fejér",
    "Knopp",
    "Jacob David Tamarkin",
    "Fejér",
    "Harald Bohr",
    "Tamarkin",
    "American Mathematical Society",
    "Peter Lax",
    "Hans Frederick Blichfeldt",
    "Edward Copson",
    "Mark Kac",
    "Austrian Academy of Sciences",
    "Hungarian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}