{
  "nome_completo": "Gabriel Lamé",
  "nome_curto": "Gabriel Lamé",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lame/",
  "data_nascimento": "22 July 1795",
  "local_nascimento": "Tours, France",
  "data_morte": "1 May 1870",
  "local_morte": "Paris, France",
  "summary": "Gabriel Lamé worked on a wide variety of different topics. His work on differential geometry and contributions to Fermat's Last Theorem are important. He proved the theorem for n = 7 .",
  "biografia": "Gabriel Lamé\nwas a student at the École Polytechnique, entering in\n1813\nand graduating in\n1817\n. Already during these undergraduate years Lamé was writing research papers, and he published his first paper\nMémoire sur les intersections des lignes et des surfaces\nⓉ\n(\nMemoir on the intersections of lines and surfaces\n)\nin\nGergonne's Journal\nin\n1816\n-\n17\n. After graduating from the École Polytechnique, Lamé studied engineering at the École des Mines in Paris, graduating from there in\n1820\n. While at the École des Mines Lamé published his second work, this time on a method he had invented to calculate the angles between faces of crystals.\nIn\n1820\nLamé, together with his colleague\nÉmile Clapeyron\n, went to Russia. We should give some background to this event which, on the face of it, looks rather a strange career move for the two young mathematicians. Alexander I was emperor of Russia from\n1801\nto\n1825\n. The French Revolution and events in France which followed it, had shown Alexander the importance of scientific knowledge and its applications to military techniques and industrial development. He understood that for Russia to be powerful it must follow suit. He looked towards Europe and European scientists and tried to introduce policies to encourage them to cooperate with Russian scientists. He encouraged teachers to go to Russia to teach the latest scientific theories and to create scientific contacts between Russia and Europe. In line with this policy, the Russian government made a request to France who responded by sending Lamé and\nClapeyron\nto St Petersburg.\nLamé was appointed professor and engineer at the Institut et Corps du Genie des Voies de Communication in St Petersburg. At first things were rather difficult for Lamé but later his visit proved highly productive. He lectured on analysis, physics, mechanics, chemistry, and engineering topics. He published papers in both Russian and French journals during his\n12\nyears there, some jointly with\nClapeyron\n. They published in, for example, the\nJournal des voies de communications\n, the\nJournal du genie civil\n, the\nBulletin des sciences mathématiques\n, the\nReceuil des savants etrangers\n, and\nJournal für die reine und angewandte Mathematik\n(\nCrelle\n's Journal\n)\nafter it began publication in\n1826\n.\nIn\n[\n6\n]\nan interesting episode which occurred during Lamé's time in St Petersburg is related. It concerns Lamé's attempt to spread\nCauchy\n's new ideas of rigorous analysis. A professor at the Institute where Lamé taught had written a book which contained a proof of\nTaylor\n's theorem. Lamé produced a manuscript criticising the proof using\nCauchy\n's arguments. Another side to Lamé's work in St Petersburg was his involvement in helping with plans that were being drawn up for building bridges and roads around the city. At this time he became more aware of the vast potential of railway development, and this would be a topic of great interest to him after his return to France. Before that, he was present when the Liverpool-Manchester line opened in England on\n15\nSeptember\n1830\n.\nBradley\n[\n4\n]\ngives a lot more detail regarding Lamé's time in Russia. She concludes in her paper that:-\n... the repressive atmosphere in France during the period of the Bourbon restoration had made work abroad seem more attractive for research and the application of new ideas. Lame and\nClapeyron\nseized an opportunity offered to them by successful French engineers already established in Russia who had taken with them the spirit of the early years of the École Polytechnique. Important engineers like Betancourt and Bazaine helped them to pursue their careers in a land of scientific opportunity where their ideological convictions were strengthened through contact and discussion with their compatriots.\nIn\n1832\nLamé returned to Paris and at first he formed part of an engineering firm set up jointly with\nClapeyron\nand two others. After only a few months, and still in\n1832\n, Lamé accepted the chair of physics at the École Polytechnique. He did not restrict his interests to teaching and research, however, for in remained an engineer ready for consulting work in that area. In\n1836\nhe was appointed chief engineer of mines and he was also involved in the building of the railway from Paris to Versailles and of the railway from Paris to St Germain, which was opened in\n1837\n.\nLamé was elected to the\nAcadémie des Sciences\nin\n1843\nwhen Louis\nPuissant\ndied leaving a vacancy in the geometry section. In the following year he left his chair of physics at the École Polytechnique and accepted a post at the Sorbonne in mathematical physics and\nprobability\n. He was appointed to the chair of mathematical physics and probability at the Sorbonne in\n1851\n.\nHe worked on a wide variety of different topics. Often problems in the engineering tasks he undertook led him to study mathematical questions. For example his work on the stability of vaults and on the design of suspension bridges led him to work on elasticity theory. In fact this was not a passing interest, for Lamé made substantial contributions to this topic. Another example is his work on the conduction of heat which led him to his general theory of curvilinear coordinates.\nCurvilinear coordinates proved a very powerful tool in Lamé's hands. He used them to transform\nLaplace's equation\ninto ellipsoidal coordinates and so separate the variables and solve the resulting equation. The trademark of Lamé's career was moving from one topic to another in a quite logical way but he often ended up studying problems very far removed from the original. This happened with curvilinear coordinates for he was led to study the equation\n(\nx\n/\na\n)\nn\n+\n(\ny\n/\nb\n)\nn\n+\n(\nz\n/\nc\n)\nn\n=\n0\n(x/a)^{n} + (y/b)^{n} + (z/c)^{n} = 0\n(\nx\n/\na\n)\nn\n+\n(\ny\n/\nb\n)\nn\n+\n(\nz\n/\nc\n)\nn\n=\n0\nwhich, in non-homogeneous form he wrote as\n(\nx\n/\na\n)\nn\n+\n(\ny\n/\nb\n)\nn\n=\n1\n(x/a)^{n} + (y/b)^{n} = 1\n(\nx\n/\na\n)\nn\n+\n(\ny\n/\nb\n)\nn\n=\n1\nwhich, with\na\n=\nb\na = b\na\n=\nb\nis\nx\nn\n+\ny\nn\n=\na\nn\nx^{n} + y^{n} = a^{n}\nx\nn\n+\ny\nn\n=\na\nn\nso he was led to\nFermat's last theorem\n. Although he was basically an applied mathematician, Lamé made a substantial contribution to the problem by solving the case\nn\n=\n7\nn = 7\nn\n=\n7\n. In fact he believed that he had solved the whole problem at one stage but he had overlooked the lack of unique factorisation in certain subrings of the complex numbers.\nHe also did important work on\ndifferential geometry\nand, in another contribution to\nnumber theory\n, he showed that the number of divisions in the\nEuclidean algorithm\nnever exceeds five times the number of digits in the smaller number.\nAs we noted above, he worked on engineering mathematics and elasticity where two elastic constants are named after him. He studied diffusion in crystalline material.\nLamé was considered the leading French mathematician of his time by many, in particular\nGauss\nwho was never one to give praise easily held this opinion. Rather strangely he was more highly thought of outside France than inside, for the French seemed to feel that he was too practical for a mathematician and yet too theoretical for an engineer. His own opinion was that curvilinear coordinates were his most important contribution, but there are strange twists and turns in the history of mathematics and very soon after Lamé introduced them curvilinear coordinates became obsolete through the generalisations introduced by\nHermite\n,\nKlein\n, and\nBôcher\n.",
  "matematicos_citados_na_biografia": [
    "Émile Clapeyron",
    "Clapeyron",
    "Crelle",
    "Cauchy",
    "Taylor",
    "Académie des Sciences",
    "Puissant",
    "probability",
    "Laplace's equation",
    "Fermat's last theorem",
    "differential geometry",
    "number theory",
    "Euclidean algorithm",
    "Gauss",
    "Hermite",
    "Klein",
    "Bôcher"
  ],
  "imagens": [
    "lame.jpg"
  ]
}