{
  "nome_completo": "Gamal Ali Fouad Ismail",
  "nome_curto": "Gamal Ismail",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ismail/",
  "data_nascimento": "29 October 1950",
  "local_nascimento": "Zagazig, El Sharkia, Egypt",
  "data_morte": null,
  "local_morte": null,
  "summary": "Gamal Ismail is an Egyptian mathematician who became Professor of Pure Mathematics at the University College of Women for Art, Science and Education at Ain Shams University in Cairo in 1995 .",
  "biografia": "Gamal Ismail\nwas the daughter of Ali Fouad Ismail Sabry and Souad Ahmed Mahmoud. She studied at Ain Shams University, Cairo, Egypt, where she was awarded the degree of Bachelor of Science in\n1972\n. She was then employed as a demonstrator at the Women's College in Cairo.\nOn\n21\nFebruary\n1974\nshe married Hussein Abdel Wahab Abdel Gawad. They had three children, Assmaa Ismail, Ayman Ismail and Ihab Ismail. She continued to study for a Master of Science Degree and for this degree she wrote the thesis\nNumerical treatment of systems of linear equations\nwhich she submitted to Ain Shams University in February\n1976\nas partial fulfilment of the requirements for the degree. She gives the following Acknowledgements for the help she received:-\nThe author is greatly indebted to Professor Dr Abbas I Abdel Karim, Professor of Mathematics and Head of Department, University College of Women, Ain Shams University for suggesting the topic of this thesis, for his helpful guidance and kind advice throughout the supervision of this research work. Sincere thanks are expressed to Prof Dr M S El Mohandis, Professor of Mathematics, University College of Women, for his kind help and encouragement.\nLet us quote the beginning of the Summary of the thesis:-\nThis thesis contains five main chapters. The first chapter is considered as fundamental for solving sets of linear simultaneous equations. The most important problem of numerical algebra is the development of algorithms for the solution. Essentially there are two reasons why this is such a basic problem. First of all, today nearly every linear problem in applied mathematics - as a boundary value problem for a linear ordinary or partial differential equation is reduced by appropriate techniques to a system of linear equations, especially when electronic computers are to be employed for its solution. Secondly, nonlinear problems can in most cases be solved by approximating them by linear problems. There are several different methods for the solution of sets of equations, the method used depending on the calculating aids available, the type of equations to be solved and the accuracy required in the solution. In general, there are two type of numerical techniques for solving simultaneous linear equations: direct methods, which are finite, and indirect methods which are infinite. The two methods are useful, both have advantages and limitations.\nAfter being awarded a Master of Science Degree, Ismail was appointed as an assistant lecturer in mathematics at Ain Shams University in\n1976\n. She continued to undertake research for a doctorate advised by Abbas I A Karim and in\n1983\nthey published the joint paper\nThe stability of multistep formulae for solving differential equations\n. The authors give the following Abstract\n[\n3\n]\n:-\nBy the numerical treatment of differential equations, the question of stability is still important. It is advantageous to state alternative methods for investigating the stability of multi-step formulae. Among these methods are: determination of the characteristic roots, graphical method, Hermitian form obtained from the characteristic equation or from the multi-step formula, application of Newton's theorem and using Sturm's theorem. The stability of an illustrative formula is discussed by using each of these methods.\nIsmail was awarded a Ph.D. in\n1985\nfor her thesis\nAccuracy of the multi-step methods for solving differential equations\n. This work was not published. She was promoted from assistant lecturer to lecturer in mathematics. No papers by Ismail appear to have been published for ten years after the award of her thesis, but in\n1995\nshe was promoted to associate professor and appointed as manager of the Computer Unit at the Women's College of Ain Shams University. Her next publication, a joint paper with Iman H Ibrahim, was\nVariable step stiffly stable methods\nwhich appeared in\n1996\n. A paper with the same authors and title was published two years later in which the Introduction begins as follows\n[\n1\n]\n:-\nThere is much current interest in the problem of devising numerical methods of stiff ODEs.  Stiffly stable variable step methods of order\n3\nand\n4\nare established. Some stability  properties of multistep formulas will be discussed, some theorems and lemmas are proved ...\nFurther papers by Ismail followed:\nA new higher order effective P-C methods for stiff systems\n(1998)\n;\nStability of nonequidistant variable order multistep methods for stiff systems\n(2000)\n;\nA numerical technique for the\n3\n-D Poisson equation\n(2003)\n,\nEfficient numerical solution of\n3\nD incompressible viscous Navier-Stokes equations\n(2004)\nand\nA new approach to construct linear multistep formulae for solving stiff ODEs\n(2005)\n.\nAlso in\n2005\nIsmail published\nModified technique for solving advance-delay differential systems\nin the journal\nMathematical and computer modelling\n. This was unfortunate for, in the following year, the Editor-in-Chief of\nMathematical and computer modelling\nrequested the paper be retracted. We quote the following reason for the retraction given in this paper\n[\n2\n]\n:-\nThe author has plagiarized part of a paper that had already appeared in 'J. Math. Biol.'\n24\n(1986)\n,\n583\n-\n601\n. One of the conditions of submission of a paper for publication is that authors declare explicitly that their work is original and has not appeared in a publication elsewhere. Re-use of any data should be appropriately cited. As such this article represents a severe abuse of the scientific publishing system. The scientific community takes a very strong view on this matter and we apologize to readers of the journal that this was not detected during the submission process.\nAfter this unfortunate publication, sadly Ismail does not appear to have published any further papers.\nLet us end this biography by noting that Ismail is a member of the Egyptian Mathematics Society and gives her other interests as reading, listening to music, tennis and travel.",
  "matematicos_citados_na_biografia": [],
  "imagens": []
}