{
  "nome_completo": "Gan De",
  "nome_curto": "Gan De",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gan_De/",
  "data_nascimento": "about 400 BC",
  "local_nascimento": "China",
  "data_morte": "about 340 BC",
  "local_morte": "China",
  "summary": "Gan De was one of the earliest of the Chinese astronomers.",
  "biografia": "We know nothing of\nGan De\n's life and very little about his work. The dates we give are guesses, although we do know that at least they are roughly correct\n(\nwe do know for instance that he was making observations in\n365\nBC\n)\n. He was one of the earliest of Chinese astronomers and made observations which he recorded giving dates and coordinates. We know of two books which he wrote, namely the\nSuixing Jing\n(\nTreatise on Jupiter\n)\nand the\nTianwen Xingzhan\n(\nAstrological Predictions\n)\n, but sadly both texts have been lost.\nWe have included Gan De this archive for one reason only. That is that a quotation from his book\nSuixing Jing\n(\nTreatise on Jupiter\n)\nwas recorded by later writers. This records an observation which he made in the summer of\n365\nBC:-\nJupiter was very large and bright. Apparently, there was a small reddish star appended to its side. This is called \"an alliance\".\nOf course the intriguing question is what was the small reddish star which Gan De saw? Could it have been one of Jupiter's satellites? This has intrigued those interested in the history of astronomy. If he did see one of the Galilean satellites, then it would have been Ganymede which is the brightest of the four. Ganymede can have a magnitude of\n4\n.\n6\nwhich means that it is within the range which anyone might expect to see. However the reason that Ganymede is not readily visible is that Jupiter, being so much brighter and so close to Ganymede when viewed from earth, obscures the faint satellite. Gan De might have possessed exceptional eyesight and been able to separate the faint Ganymede and the bright Jupiter. The only thing in the description which would have one doubt this is the fact that Gan De records the small star on the side of Jupiter to be reddish. At this low light level colours are not distinguished by the eye. However, we must remember that he observed under conditions of absolutely no light pollution, something impossible today.\nEvidence on the positive side suggesting that he did indeed observe Ganymede comes from the accuracy of his observations in general. He gave the following description of Jupiter's journey through the constellations:-\nEvery\n12\nyears Jupiter returns to the same position in the sky; every\n370\ndays it disappears in the fire of the Sun in the evening to the west,\n30\ndays later it reappears in the morning to the east ...\nand also gave accurately observed details of the planet's movements throughout its\n12\nyear cycle. We also know that Gan De produced star catalogues.",
  "matematicos_citados_na_biografia": [],
  "imagens": []
}