{
  "nome_completo": "Gaspard Clair François Marie  Riche de Prony",
  "nome_curto": "Gaspard de Prony",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Prony/",
  "data_nascimento": "22 July 1755",
  "local_nascimento": "Chamelet, Beaujolais, France",
  "data_morte": "29 July 1839",
  "local_morte": "Paris, France",
  "summary": "Gaspard de Prony was a French mathematician who produced mathematical tables and texts on mathematical physics.",
  "biografia": "Gaspard de Prony\n's family name was Riche, the de Prony title having been bought by his parents. In fact de Prony's younger brother was always known by the name Riche. De Prony was educated at the Benedictine College at Toissei in Doubs. From there he entered the École des Ponts et Chaussés in\n1776\nwhere he studied engineering. He graduated in\n1779\nas the top student and remained for a further year in Paris, doing as the head of the École des Ponts et Chaussés told him:-\nM de Prony ... concern yourself with acquiring a deep knowledge of your art, for you are destined to become head of the École des Ponts et Chaussés.\nIn\n1780\nhe became an engineer with the École des Ponts et Chaussés and after three years in a number of different regions of France he returned to the École des Ponts et Chaussés in Paris\n1783\n. This was the same year he published his first major work in the\nAcadémie des Sciences\non the forces on arches.\nMonge\nwas impressed with this paper and realised that de Prony was someone of great potential.\nIn\n1785\nde Prony visited England on a project to obtain an accurate measurement of the relative positions of the Greenwich Observatory and the Paris Observatory. Two years later he was promoted to inspector at the École des Ponts et Chaussés. Around this time he was involved with the work on the Louis XVI Bridge in Paris which is now called the Pont de la Concorde.\nFurther promotion in\n1790\nwas followed the next year by his being appointed Engineer-in-Chief of the École des Ponts et Chaussés. This promotion was as a result of the opening of the Louis XVI Bridge.\nAlso around\n1791\nde Prony was working on geometry with\nPierre Girard\n. Then in\n1792\n, de Prony began a major task of producing logarithmic and trigonometric tables, the\nCadastre\n. With the assistance of\nLegendre\n,\nCarnot\nand other mathematicians, and between\n70\nto\n80\nassistants, the work was undertaken over a period of years, being completed in\n1801\n. The tables were, see\n[\n2\n]\n:-\n... vast, with values calculated to between fourteen and twenty-nine decimal places. Each copy consisted of eighteen folio volumes together with another volume of mathematical procedures.\nGetting such a massive work published was another matter. Negotiations went on over a number of years until, in\n1809\n, it seemed they would appear. The publisher wrote:-\nThe present generation would never have witnessed the end of this monumental work if M de Prony had not had the fortunate idea of applying the powerful method of division of labour, conceiving methods to reduce the long and laborious part of the production of the tables to simple additions and subtractions...\nHowever the tables were never published in full and it was near the end of the century before even a part appeared. It was just too expensive to print at a time when France was not in the best of financial states.\nIn\n1794\nthe École Centrale des Travaux Publics was founded by and was directed by\nCarnot\nand\nMonge\n. It was renamed the École Polytechnique in\n1795\nand de Prony was certainly one of the main lectures by this time. He is listed among the first teachers at the university as:-\nProny, lecturer in analysis, director of the Cadastre, member of the Institute. Annual salary\n6\n,\n000\nfrancs. Accommodation within the school...\nDe Prony's lectures given at the École Polytechnique were published, including his lectures on hydraulics.\nIn\n1798\nde Prony refused Napoleon's request that he join his army of invasion to Egypt.\nFourier\n,\nMonge\nand\nMalus\nhad agreed to be part of the expeditionary force and Napoleon was angry that de Prony would not come. It did mean that de Prony was to fail to receive the honours he deserved from Napoleon but de Prony's wife was a close friend of Joséphine and this probably saved de Prony from anything worse.\nIn\n1798\nde Prony achieved his ambition of being appointed director of the École des Ponts et Chaussés. His desire for this post was almost certainly a main reason for his refusing to join Napoleon. As director he began producing a number of important texts on mathematical physics. He became a member of the Bureau de Longitude and, in\n1810\nand\n1811\n, he produced two further major texts from his lectures at the École Polytechnique, namely\nLeçons de Mécanique Analytique\nⓉ\n(\nLessons on analytical mechanics\n)\nand\nSommaire des Leçons du Cours de Mécanique\nⓉ\n(\nSummary of lessons in a course on mechanics\n)\n.\nAfter Napoleon was defeated the reorganisation in France included a reorganisation of the École Polytechnique which was closed during\n1816\n. De Prony lost his position as professor there and was not part of the reorganisation committee. However, as soon as the school reopened, de Prony was asked to be an examiner so he continued his connection yet only had to work one month per year.\nOne of de Prony's most important scientific inventions was the 'de Prony brake' which he invented in\n1821\nto measure the performance of machines and engines. It was based on ideas of\nHachette\nand was a considerable improvement on a method which\nPierre Girard\nhad used two years earlier.\nThe last part of de Prony's career was more involved with education rather than administration. One battle he fought, without success, was against\nCauchy\n's move towards pure mathematics and away from the more applied mathematics which de Prony firmly believed in. In\n[\n2\n]\nMargaret Bradley writes:-\n... there had long been an increasing demand for the reform of the École des Ponts et Chaussés and his lack of attention to this attracted severe criticism. He was now showing even less interest in the day to day running of the school, in favour of science. He was disillusioned by the failure of his attempts to reform mathematics teaching at the École Polytechnique, where he had made energetic and determined efforts to combat the emphasis on theory of\nA-L Cauchy\n... Prony seems to have lost heart for the continuing struggle and to have been less conscientious with regard to his duties as examiner.",
  "matematicos_citados_na_biografia": [
    "Académie des Sciences",
    "Monge",
    "Pierre Girard",
    "Legendre",
    "Carnot",
    "Fourier",
    "Malus",
    "Hachette",
    "Cauchy",
    "A-L Cauchy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}