{
  "nome_completo": "Jean Gaston Darboux",
  "nome_curto": "Gaston Darboux",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Darboux/",
  "data_nascimento": "13 August 1842",
  "local_nascimento": "Nimes, Gard, Languedoc, France",
  "data_morte": "23 February 1917",
  "local_morte": "Paris, France",
  "summary": "Gaston Darboux was a French mathematician who made important contributions to differential geometry and analysis and the Darboux integral is named after him.",
  "biografia": "Gaston Darboux\nwas the son of François Darboux\n(1800\n-\n1849)\nand Alix Gourdoux\n(1811\n-\n1887)\n. François was a clothes merchant and haberdasher, the son of Antoine Darboux\n(1764\n-\n1803)\nand Magdelaine Amalric\n(\ndied\n1812)\n, who married Alix Gourdoux in Nîmes on\n17\nSeptember\n1841\n. Gaston was born in a house which was a converted chapel of the cathedral. The date of his birth is given by various sources as\n13\nAugust or\n14\nAugust, and there is genuine confusion here which we should explain. His birth certificate clearly gives\n1\na.m. on\n14\nAugust but Gaston always maintained that he was born at midnight on\n13\nAugust. He always gave\n13\nAugust when asked for his date of birth and, in fact, his gravestone gives\n13\nAugust, so we have given that date on this biography.\nGaston had a younger brother, Jean Louis Darboux, born on\n15\nMay\n1844\n, who became a mathematics teacher at the Lycée Nîmes. One source gives a second brother Paul Darboux, born\n28\nNovember\n1845\n, but either this is an error or else Paul died as a baby since all of Gaston's obituaries refer to Gaston having only one brother Louis. Tragedy struck the family in\n1849\n, for on\n14\nDecember of that year François Darboux died. Alix took over the business and made strenuous efforts to made sure that both Gaston and Louis received a good education. Gaston and Louis both attended the Lycée Nîmes as day pupils, meaning that they attended from six o'clock in the morning until eight o'clock in the evening. Gaston entered the lycée in October\n1853\n. Alix, Gaston's mother, married Auguste Sistre\n(1823\n-\n1887)\non\n25\nJuly\n1856\nin Nîmes. He, like Alix, was a widow, his wife having died in\n1854\n.\nGaston Darboux graduated from the lycée in Nîmes on\n22\nJuly\n1859\nand later that year, in October, entered the special mathematics class at the lycée of Montpellier where there were special class to prepare pupils for the entrance examinations to the École Polytechnique and the École Normale Supérieure. His teacher at Montpellier was Charles Berger who had studied at the École Normale, graduating in\n1843\n[\n16\n]\n:-\nThe professor, Charles Berger, clearly explained the subjects of his course, took care of his students during the evenings, led the best of them to the library where he made them read books of Higher Mathematics.\nAfter one year at lycée of Montpellier, Darboux sat the entrance examinations for the École Polytechnique, not because he wanted to enter in\n1860\n, but simply because he wanted to please his teacher, Charles Berger, who was keen for his star pupil to sit the examinations. A good performance meant that Darboux gained admission but he preferred to spend another year at Montpellier and take the entrance examinations for both Grand École in the following year. This time he was ranked first from those taking the examinations for both and, if he had followed the usual pattern, he would have chosen to attend the École Polytechnique which was considered best for those wanting to be leaders in their fields, particularly engineers. He chose, however, the École Normale which was the usual route for those of somewhat lesser abilities wishing to become secondary school teachers. Darboux chose to enter the École Normale Supérieure, because he wanted to become a professor. It was a significant decision, not just for the young man, but for the École Normale since other top mathematicians soon followed Darboux's example.\nWhen Darboux went to Paris to begin his studies, his mother accompanied him and introduced him to Louis Pasteur, who was the director of the École Normale. Pasteur was at this time in the middle of a reform programme trying to improve the standard of scientific work at the École but his approach was not always popular with students. He was delighted that the person topping the list had chosen the École Normale and he requested the Minister to allow Darboux to attend any of the courses which he liked outside the École. The Minister granted permission so Darboux was able to attend, at the Collège de France, the lectures of\nJoseph Bertrand\n, with whom he developed a deep friendship. Darboux was awarded the Licencié ès Sciences mathématiques on\n9\nJuly\n1863\nand the Licencié ès Sciences physiques on the\n7\nAugust\n1863\n.\nWhile he was a student his great talent for mathematical research became clear to those around him. While still an undergraduate student at the École Normale Supérieure, he published his first paper on orthogonal surfaces which had been presented to the Académie des Sciences by\nJoseph Serret\nin August\n1864\n. A month later, on\n20\nSeptember, he was placed first in the mathematics aggregation which qualified him to be a mathematics teacher.\nNow Pasteur was aware that he had a student of outstanding qualities and he was very keen that Darboux remained in Paris so he created a position of \"préparateur agrégé de Mathématiques\" at the École Normale. Here is a letter by Pasteur requesting this position be set up for Darboux\n[\n18\n]\n(\nalso quoted in\n[\n5\n]\n)\n:-\nHe is a student whose work, conduct, distinction of spirit, character, and behaviour, nothing leaves to be desired. This young man will quickly be among the most eminent mathematicians. The spirit of invention was the one quality which one could expect this young master still had to achieve. However, he showed recently, with a very remarkable work presented to the Academy of Sciences and by various notes which he gave to the professors and assistants during the year, on various subjects the study of which he was able to devote himself without ceasing to retain the first rank in his division, in spite of the preoccupations of the preparation for the competition of the aggregation. It is absolutely essential that this young man stay in Paris.\nYou can read an English translation of\nPaul Appell\n's obituary of Darboux for the International Committee for Weights and Measures\n[\n5\n]\n, from which this quote was taken, at\nTHIS LINK\n.\nDarboux had studied the work of\nLamé\n,\nDupin\nand\nBonnet\non orthogonal systems of surfaces. He generalised results of\nKummer\ngiving a system defined by a single equation with many interesting properties. He announced his results to the Académie des Sciences on\n1\nAugust\n1864\n, and on the same day Moutard announced that he had also discovered the same system. These results were included in Darboux's doctoral thesis\nSur les surfaces orthogonales\nⓉ\n(\nOn orthogonal surfaces\n)\nfor which he awarded his doctorate after defending his thesis on\n14\nJuly\n1866\n. His examiners were\nMichel Chasles\n,\nJoseph Serret\nand\nClaude Bouquet\nand they gave high praise to the thesis. The report, written by\nMichel Chasles\n, is as follows\n(\nsee\n[\n3\n]\n)\n:-\nThis Thesis is an extensive and very important work on orthogonal surfaces. It consists of three Parts. The first, entitled: 'Study of a remarkable system of orthogonal coordinates', contains different properties of the curvilinear coordinates formed by the triple orthogonal system to which the author and M Moutard were led, independently of each other. The second part contains 'Research on orthogonal surfaces in general'. M Darboux, taking as a starting point the theorem of M\nDupin\n, according to which in any triple system of orthogonal surfaces the intersection curves of the surfaces are their lines of curvature, to which he adds as a complement the following statement: \"When two systems of orthogonal surfaces intersect along the lines of curvature of these surfaces, there is a third system orthogonal to the first two,\" first gives a simple demonstration of this theorem by M\nOssian Bonnet\n, that the search for all orthogonal systems amounts to the complete integration of a third order partial difference equation with three independent variables. Then he makes known a 'New method of research of orthogonal systems', based on the use of a certain auxiliary function V. The third Part contains 'Applications' of the method exposed in the second Part. The author first considers a particular class of orthogonal systems in which the surfaces of the same system are obtained by moving one of them parallel to itself by a simple translation without alteration of shape. The determination of the function V then depends on the integration of a third order partial difference equation with two independent variables. The second case treated by M Darboux is that of surfaces for which the lines of curvature are plane in the three systems. The integrations then take place completely, and the result, in a very simple form, contains three arbitrary functions; these surfaces are, in certain cases, an example of the orthogonal systems studied in the preceding paragraph, that is to say that \"each of the three systems is formed by a surface of invariant form which moves parallel to itself.\" The third and last case relates to systems for which each surface can be divided into infinitely small squares by its lines of curvature. M Darboux had already observed, in the first Part, that the surfaces of the triple orthogonal system previously discovered by M Moutard and by himself enjoy the property in question. By a clever and extremely ingenious analysis, he now shows that the latter system is the only one that answers the question.\nDarboux had been appointed as a substitute for\nJoseph Bertrand\nto teach the special mathematics course at the Lycée Saint-Louis in Paris in\n1864\n-\n65\nwhile still undertaking research for his doctorate. After the award of his doctorate, he was appointed to replace\nJoseph Bertrand\nat the Collège de France where he taught the Mathematical Physics Course in\n1866\n-\n67\n. He was appointed as a substitute for\nJean-Claude Bouquet\nto teach the special mathematics course at the Lycée Louis le Grand\n(\nwhere\nGalois\nwas educated\n)\non\n31\nOctober\n1867\n. A year later he became a Professor of Special Mathematics at the Lycée Louis le Grand where he taught until\n26\nSeptember\n1872\n. In\n1872\nhe was appointed to the École Normale Supérieure where he taught until\n1881\n. From\n1873\nto\n1878\nhe was suppléant to\nLiouville\nin the chair of rational mechanics at the Sorbonne. Then, in\n1878\nhe became suppléant to\nChasles\nin the chair of higher geometry, also at the Sorbonne. Two years later\nChasles\ndied and Darboux succeeded him to the chair of higher geometry, holding this chair until his death. He was dean of the Faculty of Science from\n1889\nto\n1903\n.\nOn\n14\nJuly\n1872\n, Darboux married Célina Amélie Carbonnier, born\n29\nMarch\n1850\nin Beauvais, Oise, Picardie, France. We note that his brother Jean Louis Darboux had married Clare Marie Carbonnier on\n20\nAugust\n1871\n. We assume that the two Darboux brothers married two Carbonnier sisters, but we have been unable to verify this.\nDarboux made important contributions to\ndifferential geometry\nand analysis.\nD J Struik\nwrites in\n[\n1\n]\n:-\n... he followed in the spirit of\nGaspard Monge\n, and Darboux's spirit can be detected in the work of\nÉlie Cartan\n.\nAgain\nStruik\nwrites\n[\n1\n]\n:-\nRelying on the classical results of\nMonge\n,\nGauss\n, and\nDupin\n, Darboux fully used, in his own creative way, the results of his colleagues\nBertrand\n,\nBonnet\n, Ribaucour, and others.\nHe may now be best known for the Darboux integral which is named after him. This integral was introduced in a paper on\ndifferential equations\nof the second order which he wrote in\n1870\n.\nIn\n1875\nhe published his way of looking at the\nRiemann\nintegral, defining upper and lower sums and defining a function to be integrable if the difference between the upper and lower sums tends to zero as the mesh size gets smaller.\nIn\n1873\nDarboux wrote a paper on cyclides and between\n1887\nand\n1896\nhe produced four volumes on infinitesimal geometry which included most of his earlier work it was titled\nLeçons sur la théorie général des surfaces et les applications géométriques du calcul infinitésimal\n. Included in volume four of this work is a discussion of one surface rolling on another surface. In particular he studied the geometrical configuration generated by points and lines which are fixed on the rolling surface.\nEisenhart\nsays of this work in\n[\n8\n]\n:-\nHis geometrical proofs of the theorems dealing with rolling surfaces ... are as pure as they are simple and beautiful.\nDarboux also studied the problem of finding the shortest path between two points on a surface. Work in this area was also done at around the same time by\nZermelo\nand by\nKneser\n.\nDarboux's success in research is discussed by\nEisenhart\nin\n[\n8\n]\n:-\nDarboux's ability was based on a rare combination of geometrical fancy and analytical power. He did not sympathise with those who use only geometrical reasoning in attacking geometrical problems, nor with those who feel that there is a certain virtue in adhering strictly to analytic processes. ... brilliant are his reductions of various geometrical problems to a common analytic basis, and their solution and development from a common point of view.\nHowever Darboux was also renowned as an exceptional teacher, writer and administrator.\nEisenhart\nwrites\n[\n8\n]\n:-\nHis writings possess not only content but singular finish and refinement of style. In the presentation of results the form of exposition was carefully studied. Darboux's varied powers combined with his personality in making him a great teacher, so that he always had about him a group of able students. In common with\nMonge\nhe was not content with discoveries, but he felt that it was equally important to make disciples.\nDarboux is known for a wider range of mathematics than that described above.\nStruik\nwrites in\n[\n1\n]\n:-\nDarboux also did research in function theory, algebra, kinematics and dynamics. His appreciation of the history of science is shown in numerous addresses, many given as éloges before the Academy. He also edited\nJoseph Fourier\n's \"Oeuvres\"\n(1888\n-\n1890)\n.\nFor more information about Darboux's mathematical contributions see\nHenri Poincaré\n's speech at the Darboux Jubilee at\nTHIS LINK\n.\nOf course Darboux received many honours for his work. Lebon in\n[\n3\n]\nlists over\n100\nScientific Societies which elected Darboux as a member. He was elected to the\nRoyal Society of London\nin\n1902\n, winning its\nSylvester\nMedal in\n1916\n. In\n1884\nhe was elected to the\nAcadémie des Sciences\n, becoming its secretary in\n1900\n.\nDarboux represented France at the funeral of\nLord Kelvin\nin Westminster Abbey in December\n1907\n. More details of this are given in\n[\n15\n]\n; see a version of\nLarmor\n's obituary of Darboux at\nTHIS LINK\n.\nIn\n1908\nDarboux was a plenary speaker at the International Congress of Mathematicians held in Rome in\n1908\n. He delivered the lecture\nThe Origins, Methods and Problems of Infinitesimal Geometry\nat\n3\n:\n30\non Tuesday\n7\nApril\n1908\n, the session being chaired by\nSimon Newcomb\n. We give an English version of part of Darboux's lecture at\nTHIS LINK\n.\nLet us end with the description of Darboux by Ernest Lebon written in\n1910\n[\n16\n]\n:-\nTall, severe and cold, M Darboux intimidates those who approach him for the first time. Fortunately, this impression disappears quickly after a few minutes of conversation. We recognize then that he is benevolent and that under a rough bark he hides a generous heart. He has given proofs of these two qualities several times, notably for the past ten years as president of the Society for the support of Friends of Science. His conversation, which ranges over the most diverse subjects, is both informative and attractive. He recognizes that his Mathematics teachers have discovered, awakened and maintained his taste for Geometry and he repeats their names with emotion and pleasure. He strives to judge fairly without bias the issues before him. When he chairs a committee, he has absolute confidence in his colleagues and defends them if they are attacked. ... In all circumstances of life, M Darboux proceeds methodically; one should therefore not be surprised to find this quality when he develops his course programme and writes the equations on the board in the order in which they appear. Very conscientious by nature, he leaves no reasoning unfinished and presents to his listeners lessons which are always carefully prepared. There is irrefutable proof in his library of this last fact: it consists of a dozen large bound notebooks, where one can find, clearly written by himself, the developments of the courses he taught in Mathematical Physics, in Analytical mechanics and infinitesimal geometry. These precious manuscripts contain methods and remarks that he did not publish, but which we can later take advantage of, because his intention is to give them to the Institute. M Darboux remained simple and modest, although he came to a very high position. It is important to point out that he owes it only to his own efforts and his talent: none of his ancestors has occupied even a modest position in the world of science, administration or politics; if scholars protected him at the beginning of his career and opened the doors of glory to him, it is because they had seen in his works points likely to advance Science and recognised in him qualities of first order.\nDarboux is buried in Montparnasse Cemetery in the City of Paris.",
  "matematicos_citados_na_biografia": [
    "Joseph Bertrand",
    "Joseph Serret",
    "Paul Appell",
    "THIS LINK",
    "Lamé",
    "Dupin",
    "Bonnet",
    "Kummer",
    "Michel Chasles",
    "Claude Bouquet",
    "Ossian Bonnet",
    "Jean-Claude Bouquet",
    "Galois",
    "Liouville",
    "Chasles",
    "differential geometry",
    "D J Struik",
    "Gaspard Monge",
    "Élie Cartan",
    "Struik",
    "Monge",
    "Gauss",
    "Bertrand",
    "differential equations",
    "Riemann",
    "Eisenhart",
    "Zermelo",
    "Kneser",
    "Joseph Fourier",
    "Henri Poincaré",
    "Royal Society of London",
    "Sylvester",
    "Académie des Sciences",
    "Lord Kelvin",
    "Larmor",
    "Simon Newcomb"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}