{
  "nome_completo": "Geoffrey Colin Shephard",
  "nome_curto": "Geoffrey Shephard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shephard/",
  "data_nascimento": "16 August 1927",
  "local_nascimento": "Manchester, England",
  "data_morte": "3 August 2016",
  "local_morte": "Norwich, England",
  "summary": "Geoffrey Shephard was an outstanding geometer who wrote many interesting and important papers. His books, especially one co-authored with Branko Grünbaum on tilings, have become classics.",
  "biografia": "Geoffrey Shephard\nwas the son of William Joseph Shephard\n(\nborn about\n1892)\nand Nellie Simmonds\n(\nborn about\n1891)\n. William Shephard was a bank clerk who married Nellie Simmonds on\n17\nApril\n1919\nin the Parish Church of Birch in Rusholme, Manchester. Geoffrey Shephard, the subject of this biography, had one older brother. In\n1939\n, when Geoffrey was twelve years old, the family were living at\n41\nCarisbrooke Road, Leicester and Geoffrey was attending school in Leicester. His father's occupation at this time is given as bank cashier. In Leicester, Shephard attended Wyggeston Grammar School for Boys. This school, founded in\n1876\n, had Thomas Kingdom\n(1881\n-\n1957)\nas headmaster when Shephard studied there. Kingdom had studied classics, in particular Greek, at King's College, Cambridge and had been appointed as headmaster at Wyggeston Grammar School in\n1920\n. Shephard graduated from Wyggeston Grammar School in\n1945\nand, later that year, began studying mathematics at Queens' College, Cambridge.\nAfter a First in Part II of the Mathematical Tripos in\n1947\nand a special credit in Part III of the Mathematical Tripos in\n1948\n, Shephard remained at Queens' College to study for a Ph.D. under\nJ A Todd\n. While he was still an undergraduate he wrote an article on reading the sundial which was at Queens' College, originally erected in\n1642\n. The article was published in the Easter\n1948\nedition of\nThe Dial\nmagazine, dedicated to celebrating the quincentenary of the college. In June\n1948\nthe article was republished as an offprint and made available at the Porters' Lodge for visitors to purchase.\nOn\n11\nAugust\n1950\nhe submitted the paper\nRegular Complex Polytopes\nto the\nLondon Mathematical Society\n; it was published in the Proceedings in\n1952\n. The following extract is from the Introduction to the paper:-\nRegular polytopes of two or more dimensions in Euclidean space have been extensively studied. The regular polygons and polyhedra, or 'Platonic Solids', have been known since ancient times and the polytopes of four and more dimensions were discovered nearly a century ago by\nSchläfli\n. These figures commend themselves to our attention not only on account of their aesthetic appeal but also because their symmetries form important groups isomorphic to groups of real orthogonal matrices.\nThe real orthogonal matrix may be considered as a special case of the more general unitary matrix with complex coefficients which satisfies the relation\nT\nˉ\n′\n=\nT\n−\n1\n\\bar{T}' = T^{-1}\nT\nˉ\n′\n=\nT\n−\n1\nwhere the dash denotes transposition and the bar the complex conjugate. Many groups of unitary matrices are known and it is natural to inquire whether these can be exhibited as symmetry groups of 'complex polytopes' constructed in 'unitary space' ...\nUnitary groups are of particular importance since it can be shown that all finite collineation groups can be reduced to this form.\nThe objects of this paper are:\nTo introduce, for the first time, the concept of a complex polytope.\nTo develop the theory of complex polytopes as far as a complete enumeration of the regular polytopes.\nI am very much indebted to Dr\nJ A Todd\nfor his help and advice in the preparation of this paper.\nIn\n1951\n, Shephard was appointed to a Lectureship in Mathematics at the University of Birmingham but continued to undertake research advised by Todd. His next paper was\nUnitary Groups generated by reflections\nsubmitted to the\nCanadian Mathematical Journal\non\n28\nDecember\n1951\nand revised on\n19\nJanuary\n1953\n. In this paper he writes:-\nI must express my indebtedness to\nJ A Todd\nand\nH S M Coxeter\nfor their advice and suggestions in carrying out the investigations described in this paper. I am especially grateful to the former for undertaking the formidable task of checking the abstract definitions.\nHe was awarded a Ph.D. by the University of Cambridge in\n1954\nfor his dissertation\nRegular Complex Polytopes\n. The Abstract of the thesis begins:-\nThe dissertation consists of a description of a novel method of investigating certain well-known collineation groups in projective space, by the use of 'complex polytopes'. Real polytopes, the analogues in space of any number of dimensions of polygons and polyhedra, have been very fully investigated.\nIn the same year,\n1954\n, he published two further papers, the single author paper\nA construction for Wythoffian polytopes\nand the paper\nFinite unitary reflection\ngroups co-authored with\nJ A Todd\n. The two author paper has around\n500\ncitations on MathSciNet.\nAt Birmingham he began a highly successful collaboration with\nAmbrose Rogers\n. David Larman writes\n[\n14\n]\n:-\nLeaving a Readership at University College London, in\n1954\nAmbrose Rogers\nwent to Birmingham as Mason Professor of Pure Mathematics. In collaboration with Geoffrey Shephard and James Taylor during that period his interest in convex geometry and\nHausdorff\nMeasure Theory widened. In particular, with Geoffrey Shephard, he produced sharp bounds for the volume of a difference body, a problem which had been open for\n30\nyears.\nIn\n1957\nShephard produced an updated version of his article on the Queens' College, Cambridge sundial and\n[\n27\n]\n:-\nShephard's pamphlet was sold at the Porters' Lodge and, with the growth of tourism, became widely known as the authority on the dial.\nSee\nTHIS LINK\n.\nOn\n27\nAugust\n1959\n, Shephard married Helen Gillian Walker, only daughter of Mr and Mrs F C Walker of\n123\nRidgacre Road Birmingham. In\n1960\nthe couple were living at Flat\n13\n, Pakenham Road, Birmingham and in\n1965\nthey were at\n6\nMimosa Close, Birmingham.\nIn\n1966\nhe published the book\nVector Spaces of Finite Dimension\n. He writes in the Preface:-\nThis book is based on a course of lectures on linear algebra given to second-year Honours students in the University of Birmingham.\nFor more information about this book and other publications by Shephard, see\nTHIS LINK\n.\nIn\n1967\nhe became Professor of Pure Mathematics at the University of East Anglia and remained in the chair until he retired in\n1984\n. Soon after going to the University of East Anglia, Shephard began a collaboration with\nBranko Grünbaum\nand their first joint paper\nConvex polytopes\nwas published in the\nBulletin\nof the\nLondon Mathematical Society\nin\n1969\n. This major survey paper covered the advances in the subject in the three years following the publication of\nGrünbaum\n's book\nConvex polytopes\n(1966)\n. We note that MathSciNet lists\n65\njoint publications by these two mathematicians. Moshe Rosenfeld writes\n[\n18\n]\n:-\nBranko\nmet Geoffrey Shephard in\n1975\n. They decided to write a book on Visual Geometry. This was a huge undertaking. So they decided to start with tilings and patterns as a first step in their program. After\n11\nyears of research, tracing ancient and current places where tilings were used, the book was published.\nIt is unclear what 'met' means in this quote. Certainly they wrote their first joint paper in\n1969\nso one assumes that 'met' means 'met in person' but that seems to be contradicted by the note in the four author paper\nThe enumeration of normal\n2\n-homeohedral tilings\n(1986)\nby\nBranko Grünbaum\n, H D Löckenhoff, G C Shephard and Á H Temesvári which reads:-\nThis paper represents, we believe, an excellent example of international cooperation. The four authors, from four different countries, have never met and do not have a common language. The preparation of the final manuscript and diagrams was undertaken by two of the authors\n(\nB G and G C S\n)\nwho take full responsibility for any errors that may occur.\nThe book that took Shephard and\nGrünbaum\neleven years to produce was\nTilings and Patterns\n(1986)\n. The Publisher quotes from reviews:-\n\"Remarkable ... It will surely remain the unique reference in this area for many years to come,\"\nRoger Penrose\n, Nature; \"... an outstanding achievement in mathematical education,\" Bulletin of the\nLondon Mathematical Society\n; \"I am enormously impressed ... Will be the definitive reference on tiling theory for many decades. Not only does the book bring together older results that have not been brought together before, but it contains a wealth of new material ... I know of no comparable book,\"\nMartin Gardner\n.\nJoseph Malkevitch writes in the review\n[\n16\n]\n:-\nWhat\nGrünbaum\nand Shephard have done, in a dazzling display of scholarship, erudition, and research, is collect in one volume a compendium of the accumulated knowledge about tilings and patterns developed by a wide range of individuals including artisans and craftsmen, mathematicians, crystallographers, and physicists. In doing so they were forced to take a fresh look at what was known, what was thought to be known, and what had yet to be investigated, and to provide a framework in which all of this information could be succinctly put down. The project, which was started about\n10\nyears ago and has only now been brought to\n(\npartial\n)\ncompletion, is well worth the wait.\nFor more extracts from reviews of this book, see\nTHIS LINK\n.\nShephard had written another book which he had published well before\nTilings and Patterns\n, namely the joint work\nConvex polytopes and the upper bound conjecture\nwritten in collaboration with Peter McMullen\n(\nborn\n11\nMay\n1942)\n. In fact McMullen had been a Ph.D. student at the University of Birmingham advised by Shephard. When Shephard moved to the University of East Anglia in\n1967\n, McMullen went with him. He had been awarded a Ph.D. in\n1968\nfor his thesis\nOn the Combinatorial Structure of Convex Polytopes\n. In a review of\nConvex polytopes and the upper bound conjecture\n,\nDonald Coxeter\nwrites\n[\n2\n]\n:-\nThis carefully composed book summarises and extends some of the most important parts of\nB Grünbaum\n's treatise 'Convex polytopes'\n(1967)\n. It is a more readable exposition, and brings the subject up to date.\nIn his paper\nSpace Filling with Identical Symmetrical Solids\n(1985)\n, Shephard gives his opinion about the lack of geometry teaching\n[\n24\n]\n:-\nIt seems to us that geometry of this kind described here\n(\nconcerning polyhedra, space-fillings, symmetry groups, etc.\n)\nis both interesting and exciting. It is a tragedy that our present educational system completely ignores these subjects and the little time available for teaching geometry seems to be devoted to comparatively simple and uninteresting topics. Perhaps this is one of the reasons why there still remain so many unsolved geometrical problems in the familiar three-dimensional space in which we live.\nIn fact he had a reputation as an outstanding teacher as Arnold Shaw points out in\n[\n22\n]\n:-\n[\nGeoffrey Shephard was\n]\nan inspiring speaker and with a sense of theatre and an ability to hold an audience - at least in the few University of East Anglia lectures of his which I attended. He reminded one of\nG H Hardy\n's dictum along the lines of: You may have complicated things to say, but you should always say them simply. It comes as no surprise that he provided a prize for work in mathematics which can be explained to people who have no prior knowledge in that field.\nThe prize that Shaw refers to in this quote is the 'Shephard Prize' awarded by the\nLondon Mathematical Society\n[\n23\n]\n:-\nFollowing a very generous donation made by Professor Geoffrey Shephard, the\nLondon Mathematical Society\nwill, in\n2015\n, introduce a new prize. The prize, to be known as the Shephard Prize will be awarded biennially. The award will be made to a mathematician\n(\nor mathematicians\n)\nbased in the UK in recognition of a specific contribution to mathematics with a strong intuitive component which can be explained to those with little or no knowledge of university mathematics, though the work itself may involve more advanced ideas.\n...\nProfessor Shephard himself is Professor of Mathematics at the University of East Anglia whose main fields of interest are in convex geometry and tessellations. Professor Shephard is one of the longest-standing members of the\nLondon Mathematical Society\n, having given more than sixty years of membership. The Society wishes to place on record its thanks for his support in the establishment of the new prize.\nSee\nTHIS LINK\n.\nShephard retired from his chair at the University of East Anglia in\n1984\n. Following his retirement, he taught as a Professorial Fellow for three years, before being appointed Emeritus Professor in\n1987\n. Retirement, however, did not in any way mean that he stopped undertaking research and writing papers. In fact MathSciNet lists\n48\npapers written by Shephard\n(\nsome are joint works\n)\nwhich were published between\n1987\nand\n2016\n. Shaun Stevens wrote in\n2016\n[\n26\n]\n:-\nHe continued to be a regular visitor to the School of Mathematics since that time\n[\n1987]\n; it is only in the last few years that these visits became less frequent.\nAmong the honours he received was a Sc.D. by the University of Birmingham for \"a significant contribution to mathematical knowledge.\"\nWhen Shephard's health deteriorated and he required palliative care, he entered the Priscilla Bacon Lodge in Norwich where he died just a few days before his\n89\nth birthday.",
  "matematicos_citados_na_biografia": [
    "J A Todd",
    "London Mathematical Society",
    "Schläfli",
    "H S M Coxeter",
    "Ambrose Rogers",
    "Hausdorff",
    "THIS LINK",
    "Branko Grünbaum",
    "Grünbaum",
    "Branko",
    "Roger Penrose",
    "Martin Gardner",
    "Donald Coxeter",
    "B Grünbaum",
    "G H Hardy"
  ],
  "imagens": [
    "shephard.jpg"
  ]
}