{
  "nome_completo": "Albert Geoffrey Howson",
  "nome_curto": "Geoffrey Howson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Howson/",
  "data_nascimento": "9 May 1931",
  "local_nascimento": "Kippax, near Castleford, Yorkshire, England",
  "data_morte": "1 November 2022",
  "local_morte": "Eastleigh, Hampshire, England",
  "summary": "Geoffrey Howson was an English expert on mathematical education who wrote several important books on the topic. He served as President of the Mathematical Association of Great Britain, and two terms as Secretary of the International Commission on Mathematical Instruction.",
  "biografia": "Geoffrey Howson\nwas the son of Arthur Howson\n(1890\n-\n1969)\nand Hannah Silverwood\n(1890\n-\n1963)\n. Arthur Howson, born\n26\nFebruary\n1890\nin Kippax, Yorkshire, had left school at the age of twelve and, like most of the males in his family, became a coal miner. In\n1914\nhe married Florence Hick\n(1892\n-\n1925)\n, a Kippax girl, and they had three children: George Arthur Howson\n(1916\n-\n2000)\n; John Allan Howson\n(1919\n-\n2008)\n; and Donald Howson\n(1921\n-\n2006)\n. Following the death of his wife Florence on\n6\nOctober\n1925\n, Arthur Howson married Hannah Silverwood\n(1890\n-\n1963)\nin\n1930\n. Hannah, the eldest child of the miner Samuel Silverwood and his wife Mary, was born on\n17\nJune\n1890\nalso in Kippax and had six younger siblings. Hannah had married the coal miner Arthur Backhouse\n(1890\n-\n1924)\non\n13\nJuly\n1912\n. They had three children: Bertha Backhouse\n(1913\n-\n1995)\n; Lily Backhouse\n(1915\n-\n1991)\n; and Samuel Smith Backhouse\n(1919\n-\n1978)\n. Arthur Backhouse died on\n19\nSeptember\n1924\n. Arthur Howson and Hannah Backhouse were both widowed by\n1925\nand for the next few years both of them struggled to bring up their three children. They married in\n1930\nand had one child, Albert Geoffrey Howson, the subject of this biography. Although he was known as Albert when he was young, since he chose later to always be known as Geoffrey we will refer to him as Geoffrey Howson throughout this biography.\nGeoffrey Howson grew up with six half-siblings, the oldest, Bertha, being eighteen when he was born and the youngest, Donald, being ten. He\n[\n8\n]\n:-\n... grew up very much as the baby of seven in a three-bedroomed house with no inside toilet, no electricity, and no hot water - the five boys all sleeping in one room with two beds.\nHe attended the local Kippax primary school, as had all his six half-siblings before him. The\n1939\nregister records the occupations of members of the family still living at home: Arthur Howson, coal burster working below ground; Hannah Howson, unpaid domestic duties; Bertha Backhouse, shorthand typist; Samuel S Backhouse, solicitors clerk; John A Howson, printer's clerk; and Donald Howson, grocers assistant. In\n1944\nthe Butler Act brought secondary education for all, but by that time all of Geoffrey's half-siblings had completed their primary education and had not progressed further in education. Geoffrey said\n[\n18\n]\n:-\n... the village school I went to was still locked into the nineteenth century. We had standards, not classes or years, which were laid down in the\n1860\ns and once you could do the work in one standard you moved up to the next one. By ten, I was running out of classes and so my parents paid for me to go to the grammar school\n[\nin Castleford\n]\nfor one year, and then I was old enough to take the examination that would give me a free place\n[\nat Castleford Grammar School\n]\n. This was during the War, and it wasn't a very academic grammar school. Although it didn't have a great academic reputation, it did serve us very well by trying to give students who came from working-class homes a broad grasp of education and not just the ability to pass examinations.\nCastleford Grammar School did not have a qualified mathematics teacher for the first three years that Howson studied there since, with World War II in progress, qualified mathematicians were employed in military related jobs. Then a young woman mathematics teacher arrived at the school and prepared him well for the School Certificate in\n1946\n. At this stage in his schooling, Howson's favourite subjects were mathematics, history and geography. This gave him a problem since the headmaster told him that for his last two Sixth Form years, he had to choose between arts or science so either he studied mathematics and other science subjects or he took history and geography as part of an arts course. If he chose science, the headmaster said, he could take both a pure mathematics course and an applied mathematics course since a new mathematics teacher was about to join the school. This teacher, returning from the war, would mean that the school would teach double mathematics in the Sixth Form for the first time in its history. Howson decided to take the mathematics option and give up history and geography. Tony Gardiner writes\n[\n9\n]\n:-\nGeoffrey belonged to the generation, who emerged in significant numbers\n(\nperhaps for the first time\n)\nin the\n1940\ns. Their families had never been to secondary school - let alone university. Yet - thanks to structural changes and committed teachers - they somehow emerged in small numbers at age\n18\n, ready to take on whatever challenges the post-war world might present.\nThe new mathematics teacher was inspiring. He not only taught the syllabus very well but introduced Howson to topics not in the syllabus such as projective geometry. For the first time he found mathematics exciting and discussed with the teacher where he should do university studies. The teacher had himself studied mathematics at the University of Manchester and told Howson there were quality teachers there. Howson won a State Scholarship and, following the advice he had been given, applied to study mathematics at Manchester University. His teacher had lived in Dalton Hall, a Quaker Hall of residence, and Howson applied to live there. Because he was still young he chose to spend three years in the Sixth Form and began his studies at Manchester University in\n1949\n.\nThe Mathematics Department at the University of Manchester was brimming with talent at this time.\nMax Newman\nwas head of the Department of Pure Mathematics which included\nWalter Ledermann\n,\nIan Cassels\n,\nBernhard Neumann\n,\nGraham Higman\n, Arthur Stone\n(1916\n-\n2000)\nand\nKurt Mahler\n. Howson studied courses taught by all these pure mathematicians. There were also outstanding applied mathematicians such as\nJames Lighthill\n, Michael Glauert and Charles Illingworth, who all gave courses studied by Howson. In addition, he took a course in physics given by Bernard Lovell. The greatest influence on Howson in his first year, however, was the tutorial system which operated in his residence, Dalton Hall, modelled on the college tutorial system operated by Oxford and Cambridge. There were two mathematics tutors attached to the Hall,\nWalter Ledermann\nand Charles Illingworth; Howson found\nLedermann\ninspirational:-\nHaving\nWalter Ledermann\nto myself in my own room was marvellous. He was a lovely man and a great teacher. After the tutorial he would stay to discuss the Hall concert or the visiting Covent Garden Opera Company with me, and tell me of his student days in Germany.\nAt the end of his first year he had to choose to specialise in either pure mathematics or in applied mathematics and, although he had found\nJames Lighthill\n's applied mathematics course the most interesting and enjoyable, he chose to become a pure mathematician because of Ledermann's influence. Howson was awarded a B.Sc. in\n1952\nand having proved himself an outstanding student, was keen to undertake research in topology for a doctorate.\nMax Newman\nwould have supervised his research in topology but since he had accepted an invitation from\nBill Tutte\nto spend the year\n1952\n-\n53\nat the University of Toronto, Canada, he arranged for\nGraham Higman\nto look after Howson during that year. The problem\nHigman\nsuggested was in topology and led to Howson's first paper\nDivisibility closure operations\nwhich he submitted to the\nLondon Mathematical Society\nin December\n1953\n. In the paper he writes:-\nI should like to thank Dr\nG Higman\nfor his advice and encouragement during the preparation of this paper.\nHowson writes\n[\n8\n]\n:-\nWhen\nNewman\ncame back from Canada, he asked if I wanted to go to him. I said, no, I was very happy and liked being with\nGraham Higman\n. And we moved on to group theory and to free groups.\nHe moved quickly to obtain results on free groups for his second paper;\nOn the intersection of finitely generated free groups\nwas submitted to the\nLondon Mathematical Society\nin March\n1954\n. In this paper he proves the important result that the intersection of a subgroup of a free group with\nm\nm\nm\nfree generators with a subgroup of\nn\nn\nn\nfree generators is generated by at most\n2\nm\nn\n−\nm\n−\nn\n+\n1\n2mn - m - n +1\n2\nm\nn\n−\nm\n−\nn\n+\n1\nfree generators.\nNot everything had gone smoothly, however, for during his first year as a postgraduate student he had written an M.Sc. thesis which was assigned\nRichard Rado\n, Reading University, as external examiner.\nRado\nhad read the thesis, said the mathematics was fine but it was badly written.\nHigman\nand\nRado\nhad agreed to pass the thesis provided Howson wrote the work up in a comprehensible manner as a paper for the\nLondon Mathematical Society\n. This was, in fact, Howson's first paper described above. Although this must have been upsetting at the time, it did make Howson think deeply about how to write mathematics, something which would be of great value to him in his later career.\nWhile undertaking research, Howson also took courses which interested him and, in particular, he was taking a course by\nAlan Turing\non morphology when\nTuring\ndied.\nHowson was awarded a Ph.D. by the University of Manchester for his thesis\nOn Subgroups of Finitely Generated Free Group\nwhich he submitted in October\n1955\n. It contains the following Acknowledgements:-\nIt is a pleasure for me to thank Dr\nGraham Higman\n, who supervised this research work, for his great encouragement and many suggestions. I am also indebted to Dr\nJ A Green\nfor the helpful supervision of the preparation of this thesis.\nThe reason that\nSandy Green\nhad helped Howson in preparing his thesis was that\nHigman\nhad left Manchester to take up a lectureship in Oxford. In many ways it proved very fortunate for Howson that\nHigman\nhad left Manchester since as a consequence Howson, while still a postgraduate student, had been asked to teach a first-year course on calculus and then a third-year course on number theory. As a consequence, he discovered that he loved lecturing.\nReturning to Howson's excellent Ph.D. thesis, we note it has three chapters. The first gives basic facts about free groups and free products and, in particular, gives a summary of techniques introduced by\nJakob Nielsen\n. The second chapter is basically the paper\nOn the intersection of finitely generated free groups\nwhich we described above. The third chapter is concerned with the generalised free product of groups. His outstanding contributions led to two invitations, one from\nReinhold Baer\nto visit Illinois, and one from\nSaunders Mac Lane\nto visit Chicago. He decided that Chicago was the best option but had to make a decision about his compulsory National Service. Should he go to Chicago first and then do National Service, or would it be best to do National Service first? After a lot of thought, he decided to do National Service first.\nTwo years of National Service were enjoyed by Howson since he spent these teaching mathematics to officer cadets at the RAF Technical College in Henlow. During these years he realised that teaching was much more enjoyable for him than mathematical research on free groups. When his National Service ended in\n1957\nhe applied for a lecturing position at the Royal Naval College at Greenwich. Although this was a Royal Naval College, Howson joined as a civilian. He taught a wide range of courses and was happy teaching at all levels rather than undertaking mathematical research. In August\n1958\nthe International Congress of Mathematicians was held in Edinburgh and all the mathematics staff from the Royal Naval College at Greenwich attended. Since he had lost interest in research, he attended the sessions organised by the International Commission on Mathematical Instruction\n(\nICMI\n)\n, the educational arm of the\nInternational Mathematical Union\n. He did this because he felt he would understand more and these would be more helpful to him as a teacher. He did not think of research in mathematical education at this time but probably these sessions influenced him towards that direction. The Royal Naval College lectureship suited him well\n[\n8\n]\n:-\nThe mix of mathematics, naval protocol, sport, and the London musical scene suited him well, and he enjoyed teaching many of those who were to feature as stars in the first generation of the modern highly technical navy - especially the early nuclear submarine commanders. Despite his modest background, Geoffrey had very broad interests. He was deeply immersed in sport\n(\nincluding fives, squash and tennis, rugby and cricket - once playing a two-day match for the Royal Navy\n)\n. He also had a profound love of music - especially opera ...\nIn\n1961\nBryan Thwaites, Professor of Mathematics at Southampton University, organised a conference to consider the need for curriculum change in mathematics. Around\n130\ndelegates from schools, university and industry attended. It led to the setting up of the School Mathematics Project\n(\nSMP\n)\nwith the aim of bringing the mathematics curriculum up to date and improving its quality. Funding for the Project came from industry and it allowed Southampton University to advertise a post of lecturer to be involved in the Project. Howson said\n[\n18\n]\n:-\n... one Sunday, I was doing the crossword in the Observer, and happened to look in the next column, and there was this advertisement for a post with the newly founded School Mathematics Project. I'd always enjoyed all the teaching I'd done. Some of it, although not to school students, still covered school material. And so I applied for this post. ... The idea was that I would work for the School Mathematics Project for seven years. I would do some lecturing within the mathematics department, and then after seven years, I would become a full-time member of the department.\nHe prepared for his new position reading various reports including the Organization for Economic Co-Operation and Development's\n1961\nreport\nNew thinking in school mathematics\n. He went to the International Congress of Mathematicians in Stockholm in August\n1962\nand there he attended the seminars run by the International Committee of Mathematical Instruction president\nMarshall Stone\n. Taking up his new job in Southampton, Howson became involved in almost every aspect of the School Mathematics Project but his main task was as editor of the series of books that were being produced.\nIn\n1965\nHowson married Jennifer Lound who had been born on\n11\nJanuary\n1932\n. She was the daughter of Douglas Lound\n(1909\n-\n1987)\n, a chauffeur who had been incapacitated by an accident, and his wife Dora Shaw\n(1911\n-\n1966)\n. Geoffrey and Jennifer Howson's daughter, Katharine Hilary Howson, was born in\n1966\n.\nIn\n1967\nHowson was seconded for three years to the Council for Curriculum Renewal and Educational Development Overseas which had offices in BMA House in Tavistock Square, London\n[\n18\n]\n:-\nThe work involved hosting visitors wishing to sample recent developments in UK schools, and making official visits to other countries\n(\nincluding Ghana, Sierra Leone, Nigeria, Swaziland various West Indian nations, India, Sri Lanka, Malaysia, Singapore, Thailand, Bangladesh, Pakistan, Egypt, Mauritius, Tanzania, Kenya, Uganda, Mexico, Iran, USA and various European countries\n)\n.\nThe International Congress on Mathematical Education\n(\nICME\n)\nis an international congress held every four years under the auspices of the ICMI. The first, ICME-\n1\n, was held in\n1969\nin Lyons, France, and attended by Howson. The second, ICME-\n2\n, was held in Exeter, England, in\n1972\nand Howson was much involved helping\nHans Freudenthal\nwith the organisation. The Proceeding,\nDevelopments in Mathematical Education: Proceedings of the Second International Congress on Mathematical Education\n, were edited by Howson and published in\n1973\n. Bernard Hodgson\n[\n11\n]\n:-\n... stressed the crucial role\n[\nHowson\n]\nplayed in the hosting of ICME-\n2\nin Exeter in\n1972\n, as well as the important heritage he left in the Proceedings of that congress through his reflections, based on the experience of both ICME-\n1\nand ICME-\n2\n, about what an ICME congress ought to be and how to achieve such goals.\nHowson remained at Southampton for the rest of his career. He was promoted to Reader in Mathematical Curriculum Studies in\n1979\nand in\n1984\nhe became Professor in Mathematical Curriculum Studies. He continued to be associated with the School Mathematics Project being a Trustee\n1967\n-\n96\n, and  the chair of the board of trustees\n1984\n-\n1996\n. The Project came to an end in\n1996\n. He had many other important roles in mathematical education serving as the Secretary-General of ICMI,\n1983\n-\n1990\n. Let us quote from\n[\n11\n]\nabout the difficulties he faced as Secretary-General:-\nWhen a new Executive Committee of the International Commission on Mathematical Instruction started its term in\n1983\nunder the presidency of\nJean-Pierre Kahane\nand with Geoffrey Howson as Secretary-General, the Commission, it must be stressed, was in a true state of disarray. This can be seen, for instance, from a comment of\nOlli Lehto\n(\nformer Secretary of the\nInternational Mathematical Union\n)\nabout the time span preceding their appointment: \"For a long time, ICMI's activities visibly suffered from a lack of adequate administration.\" Such was the case in particular, notes\nLehto\n, during the\n1979\n-\n1982\nExecutive Committee term, with distinguished mathematicians\nHassler Whitney\nserving as President and\nPeter Hilton\nas Secretary-General: \"Their professional competence was in striking contrast to the Commission's inefficient administration.\" The\nKahane\n-Howson tandem was thus entrusted by\nInternational Mathematical Union\nwith the task of putting the International Commission on Mathematical Instruction back on track.\nThere is no doubt in retrospect that the\nKahane\n-Howson period\n(1983\n-\n1990)\nwas highly successful and that the goal of restoring credence to International Commission on Mathematical Instruction was fully achieved. Both\nJean-Pierre Kahane\nand Geoffrey Howson deserve to be praised on that account.\nTony Gardiner gives the following summary of Howson's contributions in\n[\n9\n]\n:-\nHe published and edited a huge variety of books and papers - all written in a thoughtful style. His goal was to inform and enlighten, rather than to engage in \"theoretical research\". He became a leader in Mathematics Education internationally, but was never really appreciated by the new breed of \"Maths Education\" researchers. His contributions were mostly pragmatic comparisons, surveys, and analyses, designed to inform and to allow improved judgements to be made. He was also very active in supporting teachers' colleges and those working in polytechnics.\nFor more information about Howson's books, including reviews by leading mathematical educationalists, see\nTHIS LINK\n.\nSome of his most important works arose from his interest in the history of mathematical education. Other works arose from his wide and deep knowledge of the systems of mathematical educations in different countries, see for example\nNational curricula in mathematics\n(1991)\n.\nIn\n1988\nHowson was president of the\nMathematical Association\n. At the annual conference, held in Birmingham in that year, Kenneth Baker, the Secretary of State, gave a keynote address about a new national curriculum for mathematics which was about to be brought in for schools in England. When it was introduced, it soon became obvious that this national curriculum was in many ways poorly put together. To fix the problem Howson was asked to chair a committee with representatives of all the major English mathematical societies. Its remit was to identify what had gone wrong. The committee published its findings in\n1995\nin the report\nTackling the Mathematics Problem\n.\nIn June\n2000\nthe report\nMeasuring the Mathematical Problem\nstated:-\nIn \"Tackling the Mathematics Problem\" it was pointed out that\n(\ni\n)\nMathematics, Science and Engineering Departments appear unanimous in their perception of a qualitative change in the mathematical preparedness of incoming students - even among the very best and\n(\nii\n)\nstudents enrolling on courses making heavy mathematical demands are hampered by a serious lack of essential technical facility - in particular, a lack of fluency and reliability in numerical and algebraic manipulation and simplification.\nMogens Niss gives the following overview of Howson's contributions\n[\n27\n]\n:-\nGeoffrey's international interests and activities generated an impressive network of educators throughout the world, with whom he collaborated in multiple ways.\nGeoffrey published a large number of highly influential textbooks, reports, research papers and books on a variety of aspects of mathematics education, all written with remarkable eloquence and precision. His primary foci of attention, however, were the history of mathematics education, primarily, but not only, in Britain, and the constitution and development of mathematics curricula at different levels. His meticulous attention to documentation and detail was legendary, and his texts were always spiced with juicy examples and quotations to illustrate his points. Beyond his academic interests, Geoffrey was very interested in classical music, especially opera, medieval church architecture, arts and crafts, above all embroidery, a craft in which he became very skilful indeed.\nHowson retired in\n1992\nbut, since he greatly enjoyed travelling, he continued to attend ICME conferences being an invited speaker in Seville in\n1996\nwhen he delivered the lecture\nCommon sense and mathematics\nand in Copenhagen in\n2004\nwhen he gave the invited lecture\nFelix Klein and Hans Freudenthal\n. Travel was not only to conferences, for his interest in Church architecture took him so various countries such as Spain. His wife Jennifer died suddenly on\n12\nFebruary\n2009\n. Geoffrey continued to live in Eastleigh, Hampshire and died at the age of\n91\n.",
  "matematicos_citados_na_biografia": [
    "Max Newman",
    "Walter Ledermann",
    "Ian Cassels",
    "Bernhard Neumann",
    "Graham Higman",
    "Kurt Mahler",
    "James Lighthill",
    "Ledermann",
    "Bill Tutte",
    "Higman",
    "London Mathematical Society",
    "G Higman",
    "Newman",
    "Richard Rado",
    "Rado",
    "Alan Turing",
    "Turing",
    "J A Green",
    "Sandy Green",
    "Jakob Nielsen",
    "Reinhold Baer",
    "Saunders Mac Lane",
    "International Mathematical Union",
    "Marshall Stone",
    "Hans Freudenthal",
    "Jean-Pierre Kahane",
    "Olli Lehto",
    "Lehto",
    "Hassler Whitney",
    "Peter Hilton",
    "Kahane",
    "THIS LINK",
    "Mathematical Association"
  ],
  "imagens": [
    "howson.jpg"
  ]
}