{
  "nome_completo": "George Alexander Gibson",
  "nome_curto": "George Gibson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gibson/",
  "data_nascimento": "19 April 1858",
  "local_nascimento": "Greenlaw, Berwickshire, Scotland",
  "data_morte": "1 April 1930",
  "local_morte": "Glasgow, Scotland",
  "summary": "George Gibson graduated from Glasgow University and went on to become Professor there. He published several important textbooks and was an enthusiast for the History of Mathematics.",
  "biografia": "George Gibson\n's father was Robert Gibson, a Justice of the Peace, and George was his parents' third son. Robert Gibson had taught himself Latin to be able to carry out research for a book he wrote on the history of Greenlaw. George attended the Free Church School in Greenlaw until he was sixteen years old when he matriculated at the University of Glasgow. Although he entered in\n1874\n, he only graduated with an M.A. in\n1881\n. This was certainly not because of any lack of ability, for he came top of almost every class he took\n(\nin fact every class except Moral Philosophy\n)\n, but rather it was due to ill health which caused him to miss two sessions. In fact Gibson married while still an undergraduate. In\n1880\nhe married Nellie Stenhouse Hunter, the daughter of James D Hunter; they had three children who survived to adulthood.\nBecause of his health problems, Gibson only took an ordinary degree rather than an honours degree. In the following year he took the honours examinations and his performance was so outstanding that, in\n1882\n, he was awarded the Euing Fellowship in Mathematics and Natural Philosophy. He was appointed as a Junior Assistant to William Jack, Professor of Mathematics at Glasgow University, in\n1883\n, becoming a Senior Assistant to Jack in the following year. He took leave of absence in\n1885\nand travelled to Berlin where he attended lectures at the University. This was the period when the University of Berlin was at its height with\nWeierstrass\n,\nKummer\nand\nKronecker\nall giving outstanding lecture courses. Gibson remained an Assistant until\n1891\nwhen a new Ordinance came into force which meant that from November of that year he became a Lecturer in Mathematics. In\n1895\nGibson was appointed as professor of mathematics at the Glasgow and West of Scotland Technical College\n(\nnow Strathclyde University\n)\n.\nIn\n1909\nGibson was named professor at Glasgow University where he succeeded William Jack. He continued to hold this post until he retired due to ill health in\n1927\n. He published several excellent textbooks, for example\nAn Elementary Treatise on the Calculus, An Elementary Treatise on Graphs\n, and\nA First Course in Calculus, based on Graphic Methods\n. He was also recognised as a leading authority on the History of Mathematics.\nSee his article in this archive on the\nHistory of Scottish Mathematics\nat\nTHIS LINK\nGibson was very active in supporting mathematics in Scotland. He was an active member of the\nEdinburgh Mathematical Society\nand was President of the Society\n1888\n-\n89\n. In\n1902\nhe was made an Honorary Member of the\nEdinburgh Mathematical Society\n. He was elected to the\nRoyal Society of Edinburgh\non\n2\nDecember\n1889\nhaving been proposed by\nSir William Thomson\n(\nLord Kelvin\n)\n, William Jack,\nSir Thomas Muir\n, and\nGeorge Chrystal\n. He served on the Council of the Society during\n1905\n-\n8\nand again in\n1912\n-\n13\n. He was Vice-President of the Society during\n1917\n-\n20\n. He was also honoured with an Hon LL.D from Edinburgh University in\n1905\n, and a similar degree from Glasgow University in\n1927\n.\nAfter Gibson's death his friends raised funds to endow a lecture on the history of mathematics, to be given about every four years. The first lecturer was\nA Einstein\nin\n1930\n, and later speakers have included\nTurnbull\n,\nCoulson\n, and\nCollingwood\n.\nFor further information on Gibson, see his obituary in the\nEdinburgh Mathematical Society\nProceedings at\nTHIS LINK",
  "matematicos_citados_na_biografia": [
    "Weierstrass",
    "Kummer",
    "Kronecker",
    "THIS LINK",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "Sir William Thomson",
    "Sir Thomas Muir",
    "George Chrystal",
    "A Einstein",
    "Turnbull",
    "Coulson",
    "Collingwood"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}