{
  "nome_completo": "George Birch Jerrard",
  "nome_curto": "George Jerrard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jerrard/",
  "data_nascimento": "25 November 1804",
  "local_nascimento": "Bodmin, Cornwall, England",
  "data_morte": "23 November 1863",
  "local_morte": "Long Stratton, Norfolk, England",
  "summary": "George Jerrard was an English mathematician who worked on the theory of equations.",
  "biografia": "George Jerrard\n's father was Joseph Jerrard\n(1773\n-\n1858)\nwho had an army career eventually becoming a major-general. Joseph Jerrard served in Ireland during the rebellion of\n1798\n, was sent to Egypt in\n1805\n, and served at the siege of Copenhagen in\n1807\n. Joseph Jerrard married Charlotte Wilder\n(1777\n-\n1850)\non\n6\nNovember\n1797\nin Comber, County Down, Ireland. Charlotte, the daughter of Captain William Wilder, was born in Bombay, India. However, her father died soon after Charlotte's birth and her mother married George Birch. Catherine was brought up by her step-father, explaining George Birch Jerrard's middle name \"Birch\". Joseph and Charlotte Jerrard had seven children: Catherine Charlotte Jerrard\n(1798\n-\n1854)\n; Eliza Jane Jerrard\n(1799\n-?\n)\n; Joseph Henry Jerrard\n(1801\n-?\n)\n; Katherine Wilder Jerrard\n(1803\n-\n1850)\n; George Birch Jerrard\n(1804\n-\n1863)\n, the subject of this biography; Frederick William Hill Jerrard\n(1809\n-\n1884)\n; Louisa Jerrard\n(1816\n-\n1816)\n. George's younger brother Frederick William Hill studied mathematics at Gonville and Caius College, Cambridge, being eighth\nWrangler\nin\n1833\n, but later joined the Church and was rector at Long Stratton, Norfolk. It was not at Cambridge, but rather at Trinity College, Dublin, that George studied. He entered the university on\n4\nDecember\n1821\nand seems to have taken rather a long time to complete his B.A. since this was not awarded until the spring of\n1827\n. In Dublin he was taught by the Rev Thomas P Huddart.\nThe London University was founded in\n1826\nand teaching began there two years later. King's College London was founded in\n1829\nand, in\n1836\n, the University of London was created as an administrative body which would not undertake any teaching but would examine students of the other two colleges and confer degrees on them. Jerrard was a member of the Senate of the University of London and, in January\n1839\n, he proposed the motion \"That a Committee be appointed to take into consideration the subject of books which may be required for the use of the University.\" Within a few months books were being purchased to build the library. Jerrard was also a member of the\nBritish Association for the Advancement of Science\n. This\nAssociation\nwas founded in\n1831\nand since\n2009\nit has been known as the British Science Association. Jerrard's name appears in the list of life members of the\nAssociation\naround the mid\n1840\ns. Let us note that in\n1844\nGeorge Peacock\nwas President of the\nAssociation\nand, in the following year,\nJohn Herschel\nwas President. As well as in the list of life members, Jerrard's name appears in a list of those \"to whom books are supplied gratis.\" The entries list him as \"Examiner in Mathematics and Natural Philosophy in the University of London.\" His address is given as Long Stratton, Norfolk.\nHis most important work\nMathematical Researches\n(1832\n-\n35)\nis a\n3\n-volume treatise on the theory of equations.\nFrançois Viète\nand\nGirolamo Cardan\nhad shown how to transform an equation of degree\nn\nn\nn\nso that it had no term in\nx\nn\n−\n1\nx^{n-1}\nx\nn\n−\n1\n. This method had been generalised by\nEhrenfried von Tschirnhaus\nto remove terms in\nx\nn\n−\n1\nx^{n-1}\nx\nn\n−\n1\nand\nx\nn\n−\n2\nx^{n-2}\nx\nn\n−\n2\n. These methods were, to a large extent, motivated by attempts to\nsolve equations algebraically\n.\nNiels Abel\nand\nPaolo Ruffini\nshowed this was impossible for general equations of degree greater than four.\nIn\n1786\nErland Bring\nreduced a general quintic to\nx\n5\n+\np\nx\n+\nq\n=\n0\nx^{5} + px + q = 0\nx\n5\n+\np\nx\n+\nq\n=\n0\n.\nJ J Sylvester\nand J Hammond write in\n[\n10\n]\n:-\nIn the year\n1786\nErland Samuel Bring\n, Professor at the University of Lund in Sweden, discovered that by the method of\nTschirnhausen\nit was possible to deprive the general algebraical equation of the\n5\nth\ndegree of three of its terms without solving an equation higher than the\n3\nrd\ndegree. ... It seems to have been overlooked or forgotten, and was subsequently re-discovered many years later by Mr Jerrard.\nIn fact Jerrard generalised\nBring\n's result to show that a transformation could be applied to an equation of degree\nn\nn\nn\nto remove the terms in\nx\nn\n−\n1\n,\nx\nn\n−\n2\nx^{n-1}, x^{n-2}\nx\nn\n−\n1\n,\nx\nn\n−\n2\nand\nx\nn\n−\n3\nx^{n-3}\nx\nn\n−\n3\n.\nCharles Hermite\nused Jerrard's result saying that it was the most important step in studying the\nquintic equation\nsince\nAbel\n's results.\nHermite\ndid not know of\nBring\n's result and it is almost certain that Jerrard did not know of\nBring\n's result either. Jerrard wrote a further two-volume work on the algebraic solution of equations\nAn essay on the resolution of equations\n(1858)\n. He also wrote numerous articles which appear in the\nPhilosophical Magazine\nand the journals of the\nRoyal Society of London\n.\nJerrard believed that he had successfully shown that quintic equations could be solved by the 'method of radicals' despite proofs that this was impossible.\nAbel\n's proof of\n1824\ndid not convince Jerrard and, one would have to add, many other mathematicians too. However,\nWilliam Rowan Hamilton\nsupported\nAbel\nand pointed out errors in Jerrard's work.\nHamilton\nhad been asked by the\nBritish Association for the Advancement of Science\nto verify Jerrard's methods presented in\nMathematical Researches\nand he delivered his report\n[\n8\n]\nto the Sixth Meeting of the\nBritish Association for the Advancement of Science\n, held at Bristol in August\n1836\n. You can read the minute of his report to the\nBritish Association\nat\nTHIS LINK\n.\nJ J Sylvester\nand J Hammond write in\n[\n10\n]\n:-\nIn a report contained in the 'Proceedings of the\nBritish Association\n' for\n1836\n, Sir\nWilliam Hamilton\nshowed that Mr Jerrard was mistaken in supposing that the method was adequate to taking away more than three terms of the equation of the\n5\nth degree, but supplemented this somewhat unnecessary refutation by a profound and original discussion of a question raised by Mr Jerrard, as to the number of variables required in order that any system of equations of given degrees in those variables shall admit of being satisfied without solving any equation of a degree higher than the highest of the given degrees.\nJerrard continued to believe that he was correct and wrote in\nAn essay on the resolution of equations\n(1858)\n:-\nWhat, then, it may be asked, is the element omitted by\nRuffini\n,\nAbel\n, and other distinguished mathematicians, who have been led to the conclusion that it is not possible in every case to effect the algebraical resolution of equations of the fifth degree? Let us for a moment consider the nature of the difficulty which had to be overcome. It is clear that an expression for a root of the general equation of the fifth degree must involve radicals characterised by each of the symbols\n2\n√\n,\n3\n√\n,\n5\n√\n^{2}√, ^{3}√, ^{5}√\n2\n√\n,\n3\n√\n,\n5\n√\n. If, however, we examine all the solutions which have hitherto been discovered of particular equations of that degree, we shall find that into none of them do cubic radicals enter. A great, if not impassable barrier, seems at first to oppose their introduction. For how can cubic radicals arise unless, in opposition to the well-known theorem of M\nCauchy\n, the number of different values of a non-symmetrical function of five quantities can be depressed to three? In answering these questions, it is manifest that we cannot fail to detect the element of which we are in search.\nIn fact Jerrard produced his cubic radical from an equation of degree six. This equation of degree six was correct but his belief that it could always be solved was not.\nJames Cockle\nwas another British mathematician who, at first, could not accept that\nAbel\nhad proved the solution to be impossible, but slowly accepted that Jerrard was wrong.\nCockle\nwrote in the\nPhilosophical Transactions\nof May\n1860\n:-\nThe 'Essay' of Mr Jerrard is of surpassing interest, but these objections to the particular portion of it which relates to the finite solution of quintics seem to me to be fatal. A deep admirer of his researches, and indisposed to regard as established conclusions in which Mr Jerrard does not concur, I may be permitted to express a hope that the promised sequel to the \"Essay\" will not be long delayed.\nBy\n1862\nhe was more prepared to pinpoint exactly where Jerrard had gone wrong. He wrote in\n[\n4\n]\n:-\nAmong mathematicians there are those who will lend but an academic faith to Mr Jerrard's assertion that he has succeeded in rescuing from the class of impossible problems the noted problem of equations. His theory is erroneous, unsupported by calculations of his own, and at variance with the results of calculations of others. Mr Jerrard may regard article\n4\nof his paper of December\n1862\nas a sufficient answer to me, but I do not consider it; and mathematicians will form their own opinion as to whether objections which I have urged against Mr Jerrard's analysis are not fatal to his theory. Mr\nCayley\n's objections Mr Jerrard only attempts to answer by general observations in articles\n1\nand\n2\nof his paper, and by a verbal criticism in article\n3\n, - article\n2\nconsisting in great part of a repetition of a fallacious argument, the use of which leads me, I confess, to the conclusion that Mr Jerrard had misapprehended\nLagrange\n's theory of similar functions. Following an analogous method to that pursued by Mr Jerrard, we might dispute the validity of any mathematical proposition whatever on such grounds as these:\nx\n=\nx\n⟹\nx\n−\nx\n=\n(\n1\n−\n1\n)\nx\n=\n0\n⟹\nx\n=\n0\n1\n−\n1\n=\n0\n0\n,\nx = x  \\implies   x - x = (1 - 1)x = 0   \\implies  x = \\Large\\frac{0}{1-1}\\normalsize  = \\Large\\frac{0}{0}\\normalsize ,\nx\n=\nx\n⟹\nx\n−\nx\n=\n(\n1\n−\n1\n)\nx\n=\n0\n⟹\nx\n=\n1\n−\n1\n0\n​\n=\n0\n0\n​\n,\nand all formulas into which x enters are illusory.\nCockle\nalso wrote:-\nWe must not be too hard upon Mr Jerrard. He has rendered good service to science; he is on the weaker side and is defending a desperate position ... . Even if we think his views erroneous we must make allowance for the basis which a habit of regarding a subject in a particular point of view is apt to infuse into human minds.\nCockle\ncommunicated with Robert Harley\n(1828\n-\n1910)\n, a Congregational minister at Brighouse and a good mathematician, who was elected a fellow of the\nRoyal Society of London\nin\n1863\n. Harley, like Jerrard, worked almost exclusively on quintic equations.\nCockle\nsent copies of his work to Harley, but showed how nervous he was about making mistakes.\nCockle\nwrote to Harley:-\nI think you had better not send the quintic to anyone. I may have written its coefficients wrongly and will look at them again and again, or even solve the equation before communicating it. It would be a perfect waste of time for a third person if there were any error.\nBryce writes that\n[\n2\n]\n:-\n... in\n1862\n,\nCockle\npublished a guarded surrender to\nAbel\nand\nHamilton\nwhich must have been a blow to Jerrard:\nCockle\nhad been the best he had had by way of a mathematical supporter. Moreover, by the\n1860\ns,\nCockle\nwas being forced to point out in print mistakes of Jerrard, and in this he was joined by\nArthur Cayley\n. The exchange ended unpleasantly, with a good deal of asperity on either side.\nJerrard died at his brother's house, the rectory at Long Stratton, Norfolk.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "British Association for the Advancement of Science",
    "Association",
    "George Peacock",
    "John Herschel",
    "François Viète",
    "Girolamo Cardan",
    "Ehrenfried von Tschirnhaus",
    "solve equations algebraically",
    "Niels Abel",
    "Paolo Ruffini",
    "Erland Bring",
    "J J Sylvester",
    "Erland Samuel Bring",
    "Tschirnhausen",
    "Bring",
    "Charles Hermite",
    "quintic equation",
    "Abel",
    "Hermite",
    "Royal Society of London",
    "William Rowan Hamilton",
    "Hamilton",
    "British Association",
    "THIS LINK",
    "William Hamilton",
    "Ruffini",
    "Cauchy",
    "James Cockle",
    "Cockle",
    "Cayley",
    "Lagrange",
    "Arthur Cayley"
  ],
  "imagens": []
}