{
  "nome_completo": "George Howard Darwin",
  "nome_curto": "George Darwin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Darwin/",
  "data_nascimento": "9 July 1845",
  "local_nascimento": "Downe, Kent, England",
  "data_morte": "7 December 1912",
  "local_morte": "Cambridge, England",
  "summary": "George Darwin was an English mathematician who was a son of Charles Darwin and studied the three-body-problem.",
  "biografia": "George Darwin\nwas the second son of Emma Wedgwood and Charles Darwin. His father was the author of\nOn the origin of the species\nand, as a consequence, one of the most famous scientists of his time. George's mother Emma Wedgwood was from another famous family, being a granddaughter of Josiah Wedgwood who is famed for his world famous pottery. George was, therefore, in the words of one of his brothers\n[\n2\n]\n:-\n... born in the scientific purple.\nCharles and Emma had strong views on education, being very much opposed to the classical style of education of the time and yet feeling that they did not wish to conduct educational experiments with their own children. After much indecision, they sent George's older brother to Rugby and George was sent to a school in Clapham run by the Rev Charles Pritchard who later became the Savilian Professor of Astronomy at Oxford\n[\n2\n]\n:-\nPritchard was about that time attracting the attention of thoughtful men by his pioneer work in scientific education.\nDarwin excelled at Pritchard's school and he won a scholarship to study at Trinity College, Cambridge. He also excelled at Cambridge, becoming Second\nWrangler\n(\nmeaning that he was ranked second among those awarded a First Class degree in the Mathematical Tripos\n)\nin\n1868\n, becoming a Smith's Prizeman in the same year, and being elected to a fellowship at Trinity.\nMany top graduates from Cambridge from this period entered the legal profession and that indeed is what Darwin did, being called to the Bar in\n1874\n. However it was not uncommon for some to return to mathematical or other scientific study and Darwin followed this route returning to Trinity where he still held his fellowship. His fellowship expired in\n1878\nbut he continued to work at Cambridge, becoming Plumian professor of astronomy and experimental philosophy there in\n1883\n. He was re-elected to his Trinity fellowship in the following year.\nIn\n1884\nDarwin married Maud du Puy; they had four children, two boys and two girls. Their eldest son Charles was Fourth Wrangler in the Mathematical Tripos of\n1909\n.\nThe obituary\n[\n2\n]\ncontains a poetic description of the relation of George Darwin's areas of study to those of his father:-\nSir George Darwin not only proved worthy of his imperial descent, but capable of extending the boundaries of Empire in new directions. The territories which he reclaimed from the vast ocean of the unknown lay in a direction in which his great father scarcely cast an eye ...\nDarwin studied tidal effects on the planets. In particular, using methods introduced by\nLaplace\nand\nThomson\n, he discussed the effects of tidal action on the Sun-Earth-Moon system. One of his theories, namely that the Moon was pulled from a molten Earth early in its history by tidal action of the Sun, is now considered incorrect.\nDarwin made a major study of the three-body problem in the case of the orbits of the Sun-Earth-Moon system. He also studied the stability of rotating fluids, again motivated by his interest in the Moon being formed in fluid form from a molten Earth. His conclusions that a pear shaped rotating mass is stable is today thought to be incorrect.\nDespite the fact that we do not accept Darwin's conclusions today, he is important in being the first to apply mathematical techniques to study the evolution of the Sun-Earth-Moon system.\nDarwin's approach to research was that of a mathematician\n[\n2\n]\n:-\n[\nHis\n]\nchief work was done in his study, where he was constantly to be found in an arm-chair with his writing board resting across his arms, engrossed in toilsome arithmetical or analytic processes.\nIn\n[\n2\n]\nDarwin's character is described:-\nPersonally Sir George was a most hospitable and pleasant companion, a man of the highest intellectual honesty, but widely tolerant of the diverging views of some of his friends. ... His health was never robust, and he wisely never squandered his time on the details of academic reform, but for the principles he cared and for them he fought.\nDarwin was President of the\nRoyal Astronomical Society\nin\n1899\n-\n1900\nand won the Gold Medal from that Society\n1892\n.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Laplace",
    "Thomson",
    "Royal Astronomical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}