{
  "nome_completo": "George Bernard Dantzig",
  "nome_curto": "George Dantzig",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dantzig_George/",
  "data_nascimento": "8 November 1914",
  "local_nascimento": "Portland, Oregon, USA",
  "data_morte": "13 May 2005",
  "local_morte": "Palo Alto, California, USA",
  "summary": "George  Dantzig was an American mathematical scientist who worked in operations research, computer science, economics and statistics. He is best known for inventing the simplex algorithm for linear programming.",
  "biografia": "George Dantzig\n's parents were Tobias Dantzig and Anja Ourisson. Tobias was born in Russia, but went to France where he studied mathematics in Paris being taught there by\nPoincaré\n. At this time Tobias met Anja who was at the Sorbonne at this time also studying mathematics. They married and emigrated to the United States, settling in Oregon. Tobias believed that his strong Russian accent would prevent him from obtaining jobs other than as a labourer, and at first his jobs included that of lumberjack, road builder and painter. It was into this very poor family that George was born.\nTobias and Anja chose names for their children hoping that these would influence their future careers. George was named \"George Bernard\" after George Bernard Shaw since his parents hoped their first child would become a writer. Similarly George's younger brother was named Henry after\nHenri Poincaré\n, and he did indeed become a mathematician. Tobias was fortunate to gain the chance of reading for a Ph.D. in mathematics at Indiana University, while Anja obtained a Master's degree in French becoming a linguist at the Library of Congress in Washington D.C.\nThe family were now living in Washington D.C., and there George attended Powell Junior High School where his progress in mathematics was, at first, rather poor. Encouraged by his father, and determined to do well in mathematics and science, he soon began to obtain top marks in mathematics. This continued at Central High School where he became fascinated by geometry. By this time he was getting strong support from three people: an outstanding mathematics teacher at the High School, a school friend who would go on to become a professor of mathematics at Berkeley, and his father. George later wrote that his father:-\n... gave me thousands of geometry problems while I was still in high school. ... the mental exercise required to solve them was the great gift from my father. The solving of thousands of problems during my high school days - at the time when my brain was growing - did more than anything else to develop my analytic power.\nTobias was working on his most famous work\nNumber: the language of science\nin the late\n1920\ns and George helped him. He later wrote:-\nAs a teenager, I prepared some of the figures that appeared in the book.\nThe book was published in\n1930\nand when it was reprinted in the\n1970\ns a reviewer wrote:-\nSince its first appearance nearly half a century ago the book has gone through a number of printings and has deservedly maintained its popularity.\nAfter graduating from High School, Dantzig decided to study mathematics at the University of Maryland, where by this time his father was on the Mathematics Faculty. Despite the improved status of his family, Dantzig's parents were still quite poor and not in a position to finance their son through a more prestigious university. He received his A.B. in Mathematics and Physics from the University of Maryland in\n1936\nand in the summer of that year he married Anne Shmuner. The newly married couple moved to Ann Arbour where Dantzig began graduate studies at the University of Michigan as a Horace Rackham Scholar. In\n1937\nDantzig was awarded an M.A. in mathematics, having studied under T H Hildebrandt,\nR L Wilder\nand G Y Rainer.\nUnhappy with abstract mathematics, the only courses he enjoyed being on statistics, Dantzig decided to give up his graduate studies. He moved to Washington where he worked as a Junior Statistician on a project \"Urban study of consumer purchase\" at the U.S. Bureau of Labor Statistics from\n1937\nto\n1939\n. Having read statistics papers by\nNeyman\n, Dantzig wrote to him in\n1939\nasking if there was any possibility he could obtain a teaching assistantship at Berkeley so that he could complete his doctoral studies under\nNeyman\n's supervision. It took\nNeyman\na little while to arrange the teaching assistantship but he managed to do so and Dantzig began for a second time to undertake graduate studies. We quote an often repeated story from this time in Dantzig's own words\n[\n3\n]\n(\nsee also\n[\n2\n]\n)\n:-\nDuring my first year at Berkeley I arrived late one day to one of\nNeyman\n's classes. On the blackboard were two problems which I assumed had been assigned for homework. I copied them down. A few days later I apologized to\nNeyman\nfor taking so long to do the homework - the problems seemed to be a little harder to do than usual. I asked him if he still wanted the work. He told me to throw it on his desk. I did so reluctantly because his desk was covered with such a heap of papers that I feared my homework would be lost there forever.\nAbout six weeks later, one Sunday morning about eight o'clock, Anne and I were awakened by someone banging on our front door. It was\nNeyman\n. He rushed in with papers in hand, all excited: \"I've just written an introduction to one of your papers. Read it so I can send it out right away for publication.\" For a minute I had no idea what he was talking about. To make a long story short, the problems on the blackboard which I had solved thinking they were homework were in fact two famous unsolved problems in statistics. That was the first inkling I had that there was anything special about them.\nWhen the United States entered World War II in\n1941\nDantzig put his graduate studies on hold for a second time, although by this time he had already completed the coursework and written his Ph.D. thesis. He went to Washington and joined the Air Force as a civilian. From\n1941\nto\n1946\nhe was Head of the Combat Analysis Branch, U.S.A.F. Headquarters Statistical Control. In\n1944\nhe was awarded the War Department Exceptional Civilian Service Medal. He wrote of his time there:-\nMy office collected data about sorties flown, bombs dropped, aircraft lost... I also helped other divisions of the Air Staff prepare plans called \"programs\". ... everything was planned in greatest detail: all the nuts and bolts, the procurement of airplanes, the detailed manufacture of everything. There were hundreds of thousands of different kinds of material goods and perhaps fifty thousand specialties of people. My office collected data about the air combat such as the number of sorties flown, the tons of bombs dropped, attrition rates. I also became a skilled expert on doing planning by hand techniques.\nIn\n1946\n, after a break of five years, Dantzig returned to Berkeley for one semester, receiving his doctorate in mathematics from the University of California. He was offered an academic post by Berkeley but had turned down the offer:-\nBerkeley made me an offer, but I didn't like it because it was too small. Or, to be more exact, my wife did not like it. It was a grand salary of fourteen hundred dollars a year. She did not see how we could live on that with our child David.\nBy June\n1946\nhe was in Washington considering a number of different possible jobs. His colleagues at the Pentagon asked him to take on the job of mechanizing the planning process. This appeared to fit in exactly with his interests so that year he was appointed Mathematical Advisor at the Defense Department to undertake the task.\nIn\n1947\nDantzig made the contribution to mathematics for which he is most famous, the simplex method of optimisation. It grew out of his work with the U.S. Air Force where he become an expert on planning methods solved with desk calculators. In fact this was known as \"programming\", a military term that, at that time, referred to plans or schedules for training, logistical supply or deployment of men. Dantzig mechanised the planning process by introducing \"programming in a linear structure\", where \"programming\" has the military meaning explained above. The term \"linear programming\" was proposed by\nT J Koopmans\nduring a visit Dantzig made to the RAND corporation in\n1948\nto discuss his ideas. Having discovered his algorithm, Dantzig made an early application to the problem of eating adequately at minimum cost. He describes this in his book\nLinear programming and extensions\n(1963)\n:-\nOne of the first applications of the simplex algorithm was to the determination of an adequate diet that was of least cost. In the fall of\n1947\n, Jack Laderman of the Mathematical Tables Project of the National Bureau of Standards undertook, as a test of the newly proposed simplex method, the first large-scale computation in this field. It was a system with nine equations in seventy-seven unknowns. Using hand-operated desk calculators, approximately\n120\nman-days were required to obtain a solution. ... The particular problem solved was one which had been studied earlier by George Stigler\n(\nwho later became a Nobel Laureate\n)\nwho proposed a solution based on the substitution of certain foods by others which gave more nutrition per dollar. He then examined a \"handful\" of the possible\n510\nways to combine the selected foods. He did not claim the solution to be the cheapest but gave his reasons for believing that the cost per annum could not be reduced by more than a few dollars. Indeed, it turned out that Stigler's solution\n(\nexpressed in\n1945\ndollars\n)\nwas only\n24\ncents higher than the true minimum per year $\n39\n.\n69\n.\nIn\n[\n11\n]\nDantzig wrote\n(\nsee also\n[\n9\n]\n,\n[\n10\n]\nand\n[\n12\n]\n)\n:-\nLinear programming is viewed as a revolutionary development giving man the ability to state general objectives and to find, by means of the simplex method, optimal policy decisions for a broad class of practical decision problems of great complexity. In the real world, planning tends to be ad hoc because of the many special-interest groups with their multiple objectives.\nBut he also modestly wrote:-\nThe tremendous power of the simplex method is a constant surprise to me.\nThe importance of linear programming methods was described, in\n1980\n, by\nLaszlo Lovasz\nwho wrote:-\nIf one would take statistics about which mathematical problem is using up most of the computer time in the world, then ... the answer would probably be linear programming.\nAlso in\n1980\nEugene Lawler wrote:-\n[\nLinear programming\n]\nis used to allocate resources, plan production, schedule workers, plan investment portfolios and formulate marketing\n(\nand military\n)\nstrategies. The versatility and economic impact of linear programming in today's industrial world is truly awesome.\nBalinski\n[\n4\n]\nwrites:-\nMathematical programming has been blessed by the involvement of at least two exceptionally creative geniuses: George Dantzig and\nLeonid Kantorovich\n.\nHe then goes on to say that\nKantorovich\nreceived the Nobel Prize for his contribution and expresses \"outrage\" that Dantzig did not.\nKoopmans\nalso had a share of this Nobel prize.\nDantzig became a research mathematician with the RAND Corporation in\n1952\nand during this period led the work on implementing linear programming on computers. Orchard-Hays writes in\n[\n14\n]\n:-\nThe systematic development of practical computing methods for linear programming began in\n1952\nat the Rand Corporation in Santa Monica, under the direction of George B Dantzig. The author worked intensively on this project there until late\n1956\n, by which time great progress had been made on first-generation computers.\nHowever, feeling that the RAND Corporation was not providing him with a source of fresh ideas, he took up an appointment as professor at Berkeley in\n1960\nand he was appointed Chairman of the Operations Research Center. While there he wrote\nLinear programming and extensions\n(1963)\n. A reviewer wrote:-\nAn impressive book, the work is very complete, its scientific level high, and its reading pleasant.\nIn\n1966\nhe was appointed Professor of Operations Research and Computer Science at Stanford University where he remained for the rest of his career.\nHis work in a wide range of topics related to optimisation and operations research over the years has been of major importance. However, writing in\n1991\n, Dantzig noted that:-\n... it is interesting to note that the original problem that started my research is still outstanding - namely the problem of planning or scheduling dynamically over time, particularly planning dynamically under uncertainty. If such a problem could be successfully solved it could eventually through better planning contribute to the well-being and stability of the world.\nDantzig has received many honours including the\nVon Neumann\nTheory Prize in\nOperational Research\nin\n1975\n; The National Medal of Science presented by the president of the United States in\n1976\n; the\nNational Academy of Sciences\nAward in Applied Mathematics and Numerical Analysis in\n1977\n; the Harvey Prize in Science and Technology from Technion, Israel, in\n1985\n; the Silver Medal from the Operational Research Society of Britain in\n1986\n; the Adolph Coors American Ingenuity Award Certificate of Recognition from the State of Virginia in\n1989\n; and the Special Recognition Award from the Mathematical Programming Society in\n1994\n.\nThe citation for the Medal of Science states that it was awarded:-\nFor inventing linear programming and discovering methods that led to wide-scale scientific and technical applications to important problems in logistics, scheduling, and network optimization, and to the use of computers in making efficient use of the mathematical theory.\nThe citation for The Harvey Prize reads:-\nIn recognition of his outstanding contribution to engineering and the sciences through his pioneering work in mathematical programming and his development of the simplex method. His work permits the solution of many previously intractable problems and has made linear programming into one of the most frequently used techniques of modern applied mathematics.\nHis work is summarised by Stanford University as follows:-\nA member of the National Academy of Engineering, the\nNational Academy of Science\n, the\nAmerican Academy of Arts and Sciences\nand recipient of the National Medal of Science, plus eight honorary degrees, Professor Dantzig's seminal work has laid the foundation for much of the field of systems engineering and is widely used in network design and component design in computer, mechanical, and electrical engineering.",
  "matematicos_citados_na_biografia": [
    "Poincaré",
    "Henri Poincaré",
    "R L Wilder",
    "Neyman",
    "T J Koopmans",
    "Laszlo Lovasz",
    "Leonid Kantorovich",
    "Kantorovich",
    "Koopmans",
    "Von Neumann",
    "Operational Research",
    "National Academy of Sciences",
    "National Academy of Science",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}