{
  "nome_completo": "George Francis Carrier",
  "nome_curto": "George Carrier",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carrier/",
  "data_nascimento": "4 May 1918",
  "local_nascimento": "Millinocket, Maine, USA",
  "data_morte": "8 March 2002",
  "local_morte": "Wayland, Middlesex, Massachusetts, USA",
  "summary": "George Carrier was considered to be one of the best applied mathematicians the United States ever produced. He loved applied mathematical problems developing complex mathematical models, which he solved with ingenious approximations and asymptotic results.",
  "biografia": "George Carrier\nwas the son of Charles Mosher Carrier\n(1893\n-\n1976)\nand Mary Selina Marcoux\n(1893\n-\n1965)\n. Charles Mosher Carrier was born in Troy, New York, on\n10\nSeptember\n1893\nand studied chemistry at Cornell University, being in the Class of\n1916\n. He completed a\n1917\n-\n18\nWorld War I Registration card giving his occupation as chemical engineer, working for the Great Northern Paper Company. He married Mary Marcoux on\n14\nJuly\n1917\nat Troy, New York. George and Mary Carrier had five children: George Francis Carrier, the subject of this biography; Mary Adeline Carrier\n(1919\n-\n2008)\n; Charles Mosher Carrier Jr\n(1922\n-\n1989)\n; Paul Bennett Carrier\n(1926\n-\n1947)\n; and John W Carrier\n(1927\n-\n2019)\n.\nLet us say a brief word about George's siblings. Mary Adeline Carrier attended Stearns High School and married the General Motors plant engineer Arthur Samuel Birchenough in\n1941\n. Charles Mosher Carrier Jr attended Hebron Academy, worked for the Federal Aviation Administration and married Winifred Agnes McDonald in\n1943\n. Paul Bennett Carrier served in the US Navy in World War II and died unexpectedly on\n7\nSeptember\n1947\n. John W Carrier graduated from Cornell University in\n1947\nand New York Medical College in\n1951\n. He became a radiologist at Central Maine Medical Center and was elected a Fellow of the American College of Radiology in\n1974\n.\nWhen in his teens, George was a guide in the Maine woods where he showed tourists the way to climb Mt Katahdin, the highest mountain in Maine, and was an expert at finding the best places to pick blueberries. He also worked taking summer jobs at the mill without his father's knowledge. He attended Stearns High School in his home town of Millinocket where he was known as \"Doc\". He was a member of the school orchestra and on the Editorial Board of\nNorthern Lights\n, the George W Stearns High School Yearbook of\n1935\n.\nCarrier's frequent visits to mills with his father as he was growing up gave him a love of engineering and so, after graduating from George W Stearns High School, he entered Cornell University to study engineering. The choice of Cornell University was simply to keep with the family tradition\n[\n1\n]\n:-\nAlthough he made a major positive impression on the faculty during his first semester as a fresh-man, his formal academic record was not exceptional; he did not believe that knowledge gained by cramming for examinations would be retained.\nLet us note at this point that his experience as an undergraduate student led to him later writing textbooks and lecturing with a somewhat unconventional approach to learning. In\n1939\nCarrier was awarded a Master's Degree in engineering by Cornell and he continued to undertake research for a Ph.D. advised by James Norman Goodier\n(1905\n-\n1965)\n. Norman Goodier was an applied mathematician, born in England, who had studied at the University of Cambridge before moving to the United States to complete a Ph.D. at the University of Michigan. His thesis advisor moved to Stanford University in\n1936\nand Goodier followed him. Carrier was one of about fifty Ph.D. students that Goodier supervised at Stanford. He was awarded his Ph.D. in June\n1944\nfor his thesis\nInvestigations in the Field of Aeolotropic Elasticity and the Bending of the Sectorial-Plate\n[\n1\n]\n:-\nHis doctoral thesis, a compilation of three distinct problems in structural mechanics, provides early indication of his penchant for problem-solving. One of the problems deals with desirable properties\n(\nintermediate \"softness\"\n)\nof a matrix material in an anisotropic composite so that the stress of a rotating cylindrical flywheel is well distributed over all the fibres - a design concept perhaps yet to be fully appreciated.\nCarrier took five years after his Master's degree before he submitted for his Ph.D. but this was because of a serious health problem\n[\n2\n]\n:-\nAn accomplished clarinet and ocarina player, he organised a swing band at Cornell; he also was houseman at a local pool hall. When George contracted tuberculosis and had to spend a year in a sanatorium, he studied books on advanced mathematics. He then returned to graduate school where he taught courses in drawing and mechanisms and the first advanced course in applied mathematics for engineers at Cornell. Two students in the latter course, Julian Cole and Ivar Stackgold, said they first heard about asymptotic perturbations and similarity in that course and believed that experience had shaped their careers\n(\nthey both became distinguished professors of applied mathematics\n)\n.\nEven before the award of his Ph.D., Carrier was submitting papers. The first was\nProvided stress analysis for the case of anisotropic rotating disks of uniform thickness\n(1943)\nand the second was\nThe thermal-stress and body-force problems of the infinite orthotropic solid\n(1944)\n. Carrier published two further papers in\n1945\n, both related to work he had undertaken for his Ph.D. thesis. These are\nOn the vibrations of the rotating ring\n, and\nOn the non-linear vibration problem of the elastic string\n. We give Carrier's Introduction to each of the\n1944\nand\n1945\npapers and the reviews\n[\n11\n]\n,\n[\n8\n]\nand\n[\n10\n]\nof them, at\nTHIS LINK\n.\nThe quote above mentions that Carrier was an accomplished clarinet player. In fact he had been inspired by Benny Goodman, and even at this stage in his career he had thoughts of seeking a career as a clarinet player in one of the big jazz bands that were so popular at the time. He decided, however, to carry on with applied mathematics and engineering and he was appointed to a two-year postdoctoral position in Harvard's Engineering School. He worked for Howard Emmons\n(1912\n-\n1998)\non the flow of compressible fluids. Emmons was an early user of mechanical calculating machines to find numerical solutions to partial differential equations\n(\nsee\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nGeorge helped design and build a high-speed cascade wind tunnel for the study of jet engine turbines and compressor blades. He was a good experimenter, but his extraordinary mathematical-modelling and analysis capabilities set him apart. Emmons proposed him for a faculty position but was overruled by the rather formal Professor\nRichard von Mises\nwho thought George was \"too much of a wise guy.\" So George went off to Brown University, where he quickly set the academic world on fire.\nIn\n1946\nCarrier married Mary Theresa Casey\n(1923\n-\n2006)\n. Mary, born in Cambridge, Massachusetts on\n11\nMarch\n1923\n, was the daughter of the chauffeur Patrick Casey\n(1890\n-\n1968)\nand his wife Julia O'Neill\n(1894\n-\n1984)\nwho had immigrated to the United States from Ireland in\n1916\nand\n1912\nrespectively. She had worked at the Hood Rubber Company as part of the war effort during World War II. This Company, founded in\n1896\n, had been required by the United States Armed Forces to manufacture military boots. Mary was an avid painter and collector. George and Mary Carrier had three sons: Robert Carrier, Mark Carrier and Kenneth Carrier.\nCarrier was appointed as an assistant professor at Brown University in\n1946\n.\nWilliam Prager\nhad come to Brown University in\n1941\nand had founded the\nQuarterly of Applied Mathematics\nin April\n1943\n. He established the Division of Applied Mathematics at Brown University in\n1946\n, served as its first Chairmen, and appointed some young scientists with expertise in a wide range topics involving applications of mathematics. Carrier was one of his first appointments to build up applied mathematics at Brown University. He was promoted to associate professor at Brown in\n1947\nand full professor in\n1948\n. Although he was only at Brown University for six years, during that time he supervised the Ph.D. studies of nineteen postdoctoral students. For a list of these students and the titles of their dissertations, see\nTHIS LINK\n.\nWhile at Brown, Carrier was supported by the US Air Force to undertake a review of all current research on the theory of supersonic flow. This resulted in the\n286\n-page report\nFoundations of high-speed aerodynamics\nwhich he edited. It contained reprints of fundamental papers on the subject such as the\n1908\ndoctoral dissertation of Theodor Meyer\n(1882\n-\n1972)\nand papers by, among others, Adolf Busemann\n(1901\n-\n1986)\n, Jacob Ackeret\n(1898\n-\n1981)\n,\nTheodore von Kármán\n,\nWilliam J M Rankine\nand\nLudwig Prandtl\n. It was published by\nDover Publications\nin\n1951\n.\nWilliam Prager\nreviewed Carrier's report in the\nQuarterly of Applied Mathematics\n; you can read his review at\nTHIS LINK\n.\nRichard von Mises\nretired from his chair at Harvard University shortly before his death in\n1953\nand Carrier was appointed as the Gordon McKay Professor of Mechanical Engineering at Harvard in\n1952\n. He remained at Harvard for the rest of his career, moving from Mechanical Engineering to be appointed the T Jefferson Coolidge Professor of Applied Mathematics in\n1972\n.\nThe Symposium \"Applied Mathematics: what is needed in research and education\" was held on\n4\nNovember\n1961\n, at the meeting of the\nSociety for Industrial and Applied Mathematics\nheld in Washington D.C. At this meeting Carrier explained what he believed \"applied mathematics\" covered\n[\n5\n]\n:-\nI should define what I mean by the core of applied mathematics; I shall do so by describing the objectives, abilities and educational needs of the men who populate this core. Their objective is to understand scientific phenomena quantitatively. To do so, such men must be so thoroughly informed in the fundamentals of some broad segment of the sciences\n(\nbe they physical, biological, economic, or whatnot\n)\nthat they can pose the question or family of questions they pursue as a mathematical query using, as the occasion demands, either time-honoured and well established scientific laws\n(\nas in mechanics\n)\nor carefully conjectured models\n(\nas in younger sciences\n)\n. Such an applied mathematician must also have an understanding of mathematics, a knowledge of technique, and such skill that he can use either rigorously founded techniques or heuristically motivated methods to resolve the mathematical problem, and he must do so with a full realisation as to the implications of each with regard to reliability and interpretation of results. In particular, the applied mathematician must be very skilful at finding that question\n(\nor family of questions\n)\nsuch that the answer will fill the scientific need while the extraction of the answer and its interpretation are not prohibitively expensive. I must emphasise that such an individual is not a mathematician nor, ordinarily, is he a specialist in a particular branch of science; he is distinguished from these primarily by his attitude and his objectives, but also by the scope of the scientific and mathematical disciplines on which he must draw.\nFor a much fuller extract from the Symposium, giving most of Carrier's contributions, see\nTHIS LINK\n.\nIn addition to the\n1951\npublication mentioned above, Carrier wrote three books, all in collaboration with others:\nFunctions of a Complex Variable: Theory and Technique\n(1966)\n;\nOrdinary Differential Equations\n(1968)\n; and\nPartial Differential Equations: Theory and Technique\n(1976)\n. The approach taken in these books is different from most texts in that they are intended to provide\n[\n1\n]\n:-\n... a minimum of exposition, a maximum of guidance, leaving students to derive key results for themselves and then infer how to proceed from there. This is the way George taught himself complex variables, essentially developing the subject for himself, with minimal reference to any text; he felt that he thereby achieved a depth of understanding ...\nMost reviewers failed to find the books satisfactory. For example, the complex variable book gets criticised in\n[\n6\n]\n:-\n... any intelligent reader who does not wish to be merely told of these facts would find it difficult and time-consuming to learn and understand the theory from this book. Indeed, there is no dearth of much better written texts on complex function theory today.\nFor extracts from Prefaces and extracts for some reviews of these three books, see\nTHIS LINK\n.\nReviewers may not always be right, of course, and the books proved popular. For example, the complex variable book was reprinted in\n2005\n, nearly\n40\nyears after it was first published.\nHis books may have received mixed reviews but his papers received praise from all\n[\n3\n]\n:-\nGeorge was widely considered one of the best applied mathematicians the United States ever produced. He loved applied problems with complex mathematical models, for which he found ingenious approximations and asymptotic results. He had a quick mind and remarkable physical intuition, which made him much sought after as a consultant to business and government. He could listen to the description of a problem and come up with the solution or an effective approach to the solution in minutes. Almost every summer for\n40\nyears, he was a consultant to either the Los Alamos National Laboratory or the Space and Defense Group at TRW in California; both organisations considered him the ideal consultant.\nHis lectures followed much the same philosophy as his books\n[\n1\n]\n:-\nWhat was the experience of attending one of George's classes, and what advice did he have for young investigators? He taught energetically, usually without notes, at break-neck pace\n(\ndrop your pencil and you missed\nFourier\nseries\n)\n, and cared little for algebraic precision. If the topic were\n(\nsay\n)\nboundary-layer methods, he dwelled only briefly on theory, and concentrated on demonstrating technique. Problem formulation, solution methodology, and engineering interpretation were a seamless fusion, whether the course was billed as applied mathematics or fluid mechanics or wave motion.\nWe have already remarked on the extraordinary number of Ph.D. students that Carrier advised while at Brown University. He continued to supervise students at Harvard, the first such student being\nHarvey Philip Greenspan\n[\n1\n]\n:-\nAs a thesis adviser, he did not arrange regular meetings; presumably the student would drop by when ready to talk. He cautioned against young engineers seeking too much freedom to pursue whatever topics they wanted, because few had mature judgment concerning choice of problem. He thought that consulting-for-industry experience substantially benefited the lectures of an applied mathematics professor. His accounts of his own such activities enhanced his students' intuition about which techniques suited a particular problem.\nWe list\n30\nPh.D. students advised by Carrier with the titles of their theses at\nTHIS LINK\n.\nCarrier received prestigious awards. He was elected to the\nAmerican Academy of Arts and Sciences\n(1953)\n, to the\nNational Academy of Sciences\n(1967)\n, to the National Academy of Engineering\n(1974)\nand to the American Philosophical Society\n(1976)\n. He elected an honorary fellow of the\nInstitute of Mathematics and Its Applications\n, the first such foreign honorary member. Carrier received the\nJohn von Neumann\nLecture Prize from the\nSociety for Industrial and Applied Mathematics\nin\n1969\nfor his:-\n... outstanding and distinguished contributions to the field of applied mathematical sciences and for the effective communication of these ideas to the community.\nHe also received the Otto Laporte Award from the American Physical Society in\n1976\nin recognition of his outstanding contribution to fluid dynamics; the\nTheodore von Kármán\nMedal from the American Society of Civil Engineers in\n1977\nin recognition of his achievements in engineering mechanics; the Timoshenko Medal from the American Society of Mechanical Engineers in\n1978\nin recognition of his achievements in applied mechanics; the\nTheodore von Kármán\nPrize from the\nSociety for Industrial and Applied Mathematics\nin\n1979\n; and the Fluid Dynamics Prize from the American Physical Society in\n1984\n. He was awarded the National Medal of Science in\n1990\n:-\nFor his achievement and leadership in the mathematical modelling of significant problems of engineering science and geophysics, and their solution by the application of innovative and powerful analytical techniques.\nHe was presented with the Medal by President George Bush at a White House East Room Ceremony on\n13\nNovember\n1990\n.\nHe served on Board of Trustees of the Rensselaer Polytechnic Institute, on the Council for the Cornell University Engineering College, on the U.S. National Committee of Theoretical and Applied Mechanics, on the Naval Studies Board of the National Research Council; and on the Corporation of the Woods Hole Oceanographic Institute.\nIn many ways, Carrier was what one might call a \"character.\" He is one of these people about whom many anecdotes are told so we should certainly let the reader gain a feeling for his personality\n[\n3\n]\n:-\nGeorge had boundless energy, a cheerful nature, and was master of his emotions. He knew how to put a fractious committee at ease with a light-hearted remark. He had no appetite for prestige, position, or wealth. He was unfailingly honest, always did what he thought was right, and was quick to admit when he was wrong or made a mistake. He chose to work on technical problems for their usefulness and for the fun he could have. Despite his extraordinary accomplishments, he managed to remain modest and \"human.\" He served Harvard as a member of the Administrative Board of the College, as acting dean of the Division of Engineering and Applied Sciences, and as chair of the Committee on Applied Mathematics for many years. In\n2005\na fellowship was established in his honour, to be awarded \"to a scholar of engineering and applied sciences with a special emphasis in widely applied mathematics.\"\nGeorge was also known for his high jinks. On one occasion, he arranged to have the Dean of Engineering arrested for a parking violation during the annual Christmas party. On another occasion, during a seminar on guided missiles, he and a prestigious MIT professor \"arrested\" the speaker and carried him out of the room for revealing \"classified information.\" He was a fan of the Marx Brothers and shared with colleagues his joy for outrageous puns. He loved gardening and building things at his home in Wayland, playing catch with his sons, and dancing with his wife in the living room to a Benny Goodman record. Evenings he enjoyed watching Perry Mason on TV, but after a few minutes his mind would drift, and he would take out a yellow pad of paper and begin writing equations at a furious pace. That way he was able to enjoy Perry Mason for\n40\nyears, according to his son Mark, because he could never remember \"who done it.\"\nCarrier died of esophageal cancer in Beth Israel Deaconess Hospital in a Boston at the age of\n83\n. He had been a resident of Wayland, Massachusetts and we have given his place of death as Wayland, despite the fact that he was taken to the Boston hospital during his final illness. His wife Mary died on\n5\nJuly\n2006\n. Her obituary says\n[\n12\n]\n:-\nMary travelled extensively around the world and established several temporary houses for her family in places as distant as Perth, Western Australia. During the\n1970\n's she worked at the Wayland Antique Exchange. Mary ... enjoyed family gatherings and bargain hunting with her sister Eileen.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Richard von Mises",
    "William Prager",
    "Theodore von Kármán",
    "William J M Rankine",
    "Ludwig Prandtl",
    "Society for Industrial and Applied Mathematics",
    "Fourier",
    "Harvey Philip Greenspan",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "Institute of Mathematics and Its Applications",
    "John von Neumann"
  ],
  "imagens": [
    "carrier.jpg"
  ]
}