{
  "nome_completo": "George Keith Batchelor",
  "nome_curto": "George Batchelor",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Batchelor/",
  "data_nascimento": "8 March 1920",
  "local_nascimento": "Melbourne, Australia",
  "data_morte": "30 March 2000",
  "local_morte": "Cambridge, England",
  "summary": "George Batchelor was an Australian applied mathematician who worked in fluid dynamics.",
  "biografia": "George Batchelor\nwas the son of George Conybere Batchelor and Ivy Constance Berneye. He attended Essendon and Melbourne high schools. He completed his secondary school education in\n1937\nafter exceptional achievements. He the entered the University of Melbourne to study mathematics and physics.\nBatchelor graduated from Melbourne University in\n1940\n, continuing to obtain a Master's Degree in\n1941\n. Due to World War II, he then undertook work for the war effort at the Australian Aeronautical Research Laboratory. His work there was on fluid flow problems in aircraft engines. The work he undertook at this time gave him an interest in fluid dynamics which would become the topic on which he did research for the rest of his life. In fact it was more specific than that, for the applications he studied in the Aeronautical Research Laboratory convinced him that turbulence was the most important problem to attack in aerodynamics.\nAt this time Batchelor wrote his first paper, which appeared in\n1944\n,\nInterference in a wind tunnel of octagonal section\nwhich gave a mathematical deduction of the interference on a model of small wing span suspended at the centre of a tunnel of octagonal section. The actual octagonal shape of the rectangular wind tunnel was, not surprisingly, that of the Australian Council's Division of Aeronautics, Melbourne. Also in\n1944\nhis paper\nOn the hydrodynamic resistance\nwas published.\nThe leading British expert on turbulence was\nGeoffrey Taylor\n, and Batchelor wrote to him at the Cavendish Laboratory in Cambridge offering to work for him. Batchelor and his colleague Alan Townsend arranged funding to allow them to undertake research with\nGeoffrey Taylor\n. Then\n[\n3\n]\n:-\n... in January\n1945\n, together with his wife, Wilma, also of Melbourne, Batchelor embarked on a marathon ten-week voyage via New Zealand, the Panama Canal and New York, and thence in a convoy of\n80\nships across the Atlantic to reach Cambridge.\nArriving in Cambridge Batchelor and Townsend discovered that\nGeoffrey Taylor\nwas no longer interested in undertaking his own turbulence research, but he was happy to supervise them. Batchelor began to examine\nKolmogorov\n's approach to turbulence and in\n1946\nhe presented his interpretation of\nKolmogorov\n's work to the Sixth International Congress for Applied Mechanics in Paris.\nBatchelor was elected a Fellow of Trinity College, Cambridge in\n1947\nand in the following year he was awarded his doctorate and became a Cambridge University lecturer. He continued to produce work of great importance in fluid dynamics. For example he wrote a paper in\n1946\ndeveloping the theory of homogeneous axisymmetric turbulence following the methods of von\nK치rm치n\n. He addressed the Seventh International Congress for Applied Mechanics in\n1948\n, speaking on\nRecent developments in turbulence research\n. He wrote a joint paper with\nGeoffrey Taylor\nin\n1949\nThe effect of wire gauze on small disturbances in a uniform stream\n.\nBatchelor was awarded the\nAdams\nPrize by the University of Cambridge in\n1951\n. He wrote a research monograph\nHomogeneous Turbulence\nin\n1953\nwhich proved definitive. Then, in\n1956\nwith Townsend as a joint author, he wrote\nTurbulent diffusion\n. Lin, reviewing this joint paper of Batchelor and Townsend wrote:-\nAs is well-known in this difficult subject of turbulent diffusion, most of the theoretical developments merely help to provide a framework for the interpretation of measurements, and do not provide definite deductions. The authors, however, have managed to collect a number of cases where a definite contact has been established between theory and experiment.\nCertainly Batchelor stamped his personality on the Cambridge Department. Hunt writes\n[\n2\n]\n:-\nAt the formidable seminars held at\n4\n.\n30\non Fridays, which Batchelor instituted in\n1948\n, many crucial theoretical developments were first presented, including his own. He managed these lively occasions like a circus lion tamer, with a turn of his head and a stare at any stupidity or excessive harassment of visiting speakers.\nIn\n1957\nBatchelor was elected to a fellowship of the\nRoyal Society of London\nand then in\n1959\nhe became a Reader in Fluid Dynamics at Cambridge. At the same time he became Head of the Department of Applied Mathematics and Theoretical Physics becoming a professor of applied mathematics in\n1964\n.\nIn May\n1956\nBatchelor founded the\nJournal of Fluid Mechanics\nand he edited the journal until January\n1999\n. The paper\n[\n1\n]\nwas written as a tribute to Batchelor when ended his\n43\nyears as editor.\nCrighton\n, in\n[\n1\n]\n, ascribes to Batchelor the high standing of the\nJournal of Fluid Mechanics\ndue to his:-\n... insistence not only on the highest standards of scientific work but on the highest standards of clarity and presentation in Journal of Fluid Mechanics papers.\n[\nBatchelor's\n]\nconcerns over clarity of exposition are evidenced also by his own papers in Journal of Fluid Mechanics, by his celebrated textbook\n(\nstill regularly reprinted\n)\n, and by his trenchantly critical Journal of Fluid Mechanics book reviews\n(\nfor example \"This is slipshod writing and it is sheer irresponsibility to put it into print\"\n)\n.\nThe \"celebrated textbook\" referred to in this quotation is\nAn Introduction to Fluid Dynamics\n(1967)\n. We should also mention his major task in editing the papers of\nGeoffrey Taylor\nwhich appeared in four volumes,\n1958\n,\n1960\n,\n1963\n, and\n1971\n. He also wrote\nThe Life and Legacy of G I Taylor\nwhich was published in\n1996\n.\nPedley\n, in\n[\n4\n]\ngives this insight into Batchelor's character:-\nAs a scientist, George was admired for the depth and precision of his thinking. To students and colleagues, he was a rock on which they could rely for clear guidance, given with warmth and humour. As an administrator, he kept his clear vision while attending meticulously to detail.\nAmong the many honours which Batchelor received was election to the\nAmerican Academy of Arts and Sciences\n(1959)\n, to the\nPolish Academy of Sciences\n(1974)\n, to the\nFrench Academy of Sciences\n(1984)\n, and to the\nRoyal Society of London\nin\n1959\nand a Fellow of the\nAustralian Academy of Sciences\n(1989)\n. He was awarded honorary doctorates by Grenoble\n(1959)\n, Technical University of Denmark\n(1974)\n, McGill\n(1986)\n, Michigan\n(1990)\n, Melbourne\n(1994)\n, and Stockholm\n(1995)\n. In addition he won numerous prizes and medals for his outstanding work. He was awarded the Agostinelli Prize by the\nAccademia Nazionale de Lincei\nin Rome in\n1986\n, the Royal Medal from the\nRoyal Society of London\nin\n1988\n, the Timoshenko Medal from the American Society of Mechanical Engineers in\n1988\n, and the Taylor Medal from the Society of Engineering Science in\n1997\n.",
  "matematicos_citados_na_biografia": [
    "Geoffrey Taylor",
    "Kolmogorov",
    "K치rm치n",
    "Adams",
    "Royal Society of London",
    "Crighton",
    "Pedley",
    "American Academy of Arts and Sciences",
    "Polish Academy of Sciences",
    "French Academy of Sciences",
    "Australian Academy of Sciences",
    "Accademia Nazionale de Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}