{
  "nome_completo": "George Biddell Airy",
  "nome_curto": "George Airy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Airy/",
  "data_nascimento": "27 July 1801",
  "local_nascimento": "Alnwick, Northumberland, England",
  "data_morte": "2 January 1892",
  "local_morte": "Greenwich, England",
  "summary": "George Airy was Lucasian professor at Cambridge and Astronomer Royal. He made many major contributions to mathematics and astronomy.",
  "biografia": "George Airy\n's father was William Airy while his mother was Ann Biddell. William Airy was from Lincolnshire and Ann was the daughter of a farmer from Suffolk. Originally William had been a farmer too, but he had educated himself and risen to the position of tax inspector. When George was born his parents were living in Northumberland where William was a collector of excise, but in the following year the family moved to Hereford when William was transferred there.\nGeorge attended Byatt Walker's school in Colchester and at the age of ten he took first place at the end of his primary school career. He had learnt some useful skills at the school such as arithmetic, double-entry book keeping and how to use a slide rule. He had probably learned more, however, from studying his father's books. He wrote in his autobiography that\n(\nsee\n[\n4\n]\n)\n:-\n... he was not a favourite with his school mates.\nEggen writes\n[\n1\n]\n:-\nAn introverted but not shy child, Airy was, even for the time and especially for his circumstances, a young snob. Nevertheless, he overcame some of the dislike of his schoolmates by his great skill and inventiveness in the construction of peashooters and other such devices.\nBefore Airy left Byatt Walker's school his father had transferred again, this time to Essex. From\n1812\nAiry spent his summers with his uncle, Arthur Biddell, who had a farm near Ipswich. Clearly Airy was not too happy at home because he asked his uncle if he could live with him rather than with his own family. Things had taken a turn for the worse at home since his father lost his tax collectors job in\n1813\nand the family were, from that time, living in poverty. Because of the financial circumstances the family seem to have been quite glad that Airy's uncle had almost taken over the role of his father.\nThe fact that Airy spent about half his time with his uncle over the next five years was important for him. Arthur Biddell was a man of learning who had a fine library containing books on chemistry, optics and mechanics which Airy avidly studied, and in addition he had many leading scientists as his friends. Their influence on the young Airy was marked and was a major factor in his seeking an academic career.\nDuring these five years,\n1814\nto\n1819\n, Airy attended Colchester Grammar School where he was\n[\n8\n]\n:-\n... noted for his memory, repeating in one examination\n2394\nlines of Latin verse.\nAiry entered Trinity College, Cambridge in\n1819\nas a\nsizar\n, meaning that he paid a reduced fee but essentially worked as a servant to make good the fee reduction. However it was only because his uncle provided financial support that he was able to undertake university studies at all. To supplement his income Airy took private pupils and this, of course, gave him less time for his own studies. Despite this his performance was outstanding and he graduated as Senior Wrangler\n(\nthe top First Class student\n)\nin\n1823\nand was a Smith's prizeman.\nWoodhouse\n, who had left the Lucasian chair in\n1822\nto become Plumian Professor of Astronomy, was one of Airy's examiners for the Smith's prize, the other being Thomas Turton who had succeeded\nWoodhouse\nto the Lucasian chair. In the following year Airy was awarded a fellowship at Trinity College and began his academic career.\nWe should comment on why Airy did so well in the Tripos examinations, being far ahead of the next best student. The Tripos examinations at that time were less a test of mathematical ability and more a test of the candidates ability to learn vast amounts of material and methods. At this Airy proved exceptionally good, partly because of his excellent memory, but also because of his remarkable organisational abilities. As an undergraduate he kept paper beside him to record every thought he had. Later everything was transferred to the books and diaries which he kept. He maintained this routine throughout his life and this record, almost of his every thought, still exists to provide remarkable evidence of the period\n[\n4\n]\n:-\nThe ruling feature of his character was order. From the time he went up to Cambridge to the end of his life his system of order was strictly maintained.\nClerke writes in\n[\n8\n]\n:-\nHe never destroyed a document, but devised an ingenious plan of easy reference to the huge bulk of his papers.\nIn\n1824\nAiry met Richarda Smith while on a walking holiday. He proposed two days after they first met but her father, Richard Smith, the vicar of a church near Chatsworth, refused to allow the marriage on the grounds that Airy could not support his daughter financially. This made Airy determined to obtain a position with the financial status which would allow him to marry.\nOnly three years after graduating from Cambridge, he was appointed Lucasian Professor of Mathematics at Cambridge. It is rather surprising that the Lucasian Professor only received £\n99\nper year while Airy was already receiving £\n150\nas an assistant tutor. Airy wondered whether he could afford to compete for the chair when he was advised in\n1826\nthat Turton was leaving, but\nPeacock\npersuaded him that the status was more important than the money. He became one of three candidates, French and\nBabbage\nbeing the other two. When\nBabbage\nstated that he was about to start legal proceedings over the election, French withdrew. Airy triumphed and a rivalry with\nBabbage\nwhich was to last for many years began.\nIn addition to the Lucasian Chair, Airy was appointed a member of the Board of Longitude which gave him another £\n100\nper year provided he attended four meetings. He explained his actions\n(\nsee\n[\n4\n]\n)\n:-\nMy prospects in the law or other profession might have been good if I could have waited but marriage would have been out of the question and I much preferred a moderate income in no long time. I had now in some measure taken science as my line\n(\nbut not irrevocably\n)\nand I thought it best to work it well for a time at least and wait for accidents.\nThese, of course, are not the words of a man driven by a love of his subject. He certainly still did not have the financial position to allow him to marry Richarda so he tried for other posts. His attempt to secure the vacant post of Astronomer Royal for Ireland failed in\n1827\n.\nAiry was an examiner for the Smith's Prize and gave lectures while holding the Lucasian Chair. He lectured on light and in these lectures he explained the problem of astigmatism. It was an eye defect which Airy suffered from himself and he had been the first to design glasses to correct it. He had earlier published a paper\nOn a peculiar Defect in the Eye\non this problem for which he was the first to provide a practical solution.\nIn\n1828\nPeacock\ninformed Airy that\nWoodhouse\n, the Plumian Professor of Astronomy, had not long to live and advised him to seek this chair. He wrote\n[\n4\n]\n:-\nI made it known that I was a candidate and nobody thought it worthwhile to oppose me. ... I told everyone that the salary\n(\nabout £\n300)\nwas not sufficient and drafted a manifesto to the University for an increase. ... the University had never before been taken by storm in such a manner and there was some commotion about it. I believe that very few people would have taken that step. ... I had no doubt of success.\nAiry was appointed Plumian Professor of Astronomy at Cambridge and Director of the Cambridge Observatory. The University had complied with his request for the salary to be increased and the £\n500\nper year he received was sufficient to allow him to marry Richarda Smith , which he did on\n24\nMarch\n1830\n.\nHe became Astronomer Royal in\n1835\nmoving at that time from Cambridge to Greenwich. There he undertook a reorganisation of the Royal Observatory which was positive in many ways but also had some unfortunate side effects. Since he could not tolerate his staff thinking for themselves no young scientists were trained at the Observatory during his period as Astronomer Royal. However, his considerable engineering ability was put to good use in renovating the instruments at the observatory. He held this post of Astronomer Royal until\n1881\nwhen he resigned and lived the rest of his life with his two unmarried daughters in the White House close to Greenwich Park.\nAiry wrote the text\nOn the Algebraic and Numerical Theory of Errors of Observations and the Combinations of Observations\n. Although said at the time to be:-\n... unreadable except by those already thoroughly acquainted with the subject,\nthe book was used at Cambridge and influenced\nPearson\n. This text was one of eleven books which Airy published, some of the others being\nTrigonometry\n(1825)\n,\nGravitation\n(1834)\n, and\nPartial differential equations\n(1866)\n. His remarkable publication record included over\n500\npapers and reports. This resulted from his extremely hard work and also his highly organised, efficient way of working which enabled him to get through far more work than almost every other scientist.\nHis attitude to mathematics was very much as an applied mathematician who saw no point in the study of the subject in its own right. His son writes in\n[\n4\n]\n:-\nHis nature was eminently practical, and his dislike of mere theoretical problems and investigations was proportionally great. He was continually at war with some of the Cambridge mathematicians on this subject. Year after year he criticised the Senate House papers and the Smith's Prize papers very severely, and conducted an interesting and acrimonious private correspondence with\nProfessor Cayley\non the same subject.\nAiry's delay, in\n1845\n, of searching for Neptune at the location suggested by\nAdams\nprevented\nAdams\nobtaining full credit for his work although in many ways he has been unfairly criticised over this episode. Airy did, however, make many major contributions to mathematics and astronomy. He improved the orbital theory of Venus and the Moon, studied interference fringes in optics, made a mathematical study of the rainbow and computed the density of the Earth by swinging a pendulum at the top and bottom of a deep mine. We should note that the value he obtained was too large by a fair amount.\nAiry was made chairman of the Commission set up to construct Standard Weights and Measures in\n1834\n. He was elected a Fellow of the\nRoyal Society of Edinburgh\nin\n1835\n, and a Fellow of the\nRoyal Society of London\nin\n1836\n, having received the Society's Copley Medal in\n1831\n. He gave the Bakerian lecture to the Society entitled\nOn the theoretical explanation of an apparent new polarity of light\nin\n1840\n. He received the Society's Royal Medal in\n1845\nfor a paper on the Irish tides.\nThe\nRoyal Astronomical Society\nelected Airy to be their President in\n1845\n. Then, in\n1851\n, Airy was elected President of the\nBritish Association\n, and in\n1871\nhe was elected President of the\nRoyal Society of London\nholding the post for two years. The Institut de France elected him to membership to fill the position which became vacant on the death of\nJohn Herschel\nin\n1872\nand in the same year he accepted a knighthood having declined it on three previous occasions on the grounds that he could not afford the fees. Soon after this, in\n1874\n, he organised an expedition to observe the\ntransit\nof Venus.\nOutside his professional scientific interests, Airy was a man of broad tastes. He liked poetry, history, theology, antiquities, architecture, engineering, and geology. He even published papers on his other interests including one which tried to identify the exact place where Julius Caesar landed in Britain and the exact place from which he left. In addition he published a number of papers on religious matters.\nThere were certainly sides to his character which made him unpopular with those around him. We have already mentioned how he was a snob at school. In later life he was sarcastic and enforced a rigid discipline on his staff at the Royal Observatory. In his defence we would have to note that he enforced such a rigid discipline on himself that it must have seemed natural to him to expect the same from others.\nAn illustration of Airy's personality is shown from his long running disagreements with\nBabbage\n. They had a dispute over the quality of a telescope in\n1832\n, he stated that\nBabbage\n's calculating engine was \"worthless\" ten years later and effectively stopped government funding of the project, and in\n1854\nhe took the side of the narrow gauge for railways while\nBabbage\nsupported the wide gauge. In all these disputes Airy came out the winner, but it is far from clear that he took the \"right\" side in the arguments.\nWe should end with a few words on Airy's importance as a scientist. His own words certainly show that he had a realistic view of himself\n(\nsee for example\n[\n1\n]\n)\n:-\n... in those parts of astronomy which ...\n[\nrequire\n]\nonly method and judgement, with very little science in the persons employed, we have done much; while in those which depend exclusively on individual effort we have done little ... our principal progress has been made in the lower branches of astronomy while to the higher branches of science we have not added anything.\nEggen writes in\n[\n1\n]\n:-\nAiry was not a great scientist, but he made great science possible.\nHowever, others have a higher opinion of Airy's achievements. Chapman\n[\n7\n]\nbelieves that:-\nAiry has been unfairly relegated to the scientific sidelines ...\nHis son summed up Airy's life as follows\n[\n4\n]\n:-\nThe life of Airy was essentially that of a hard-working business man, and differed from that of other hard-working people only in the quality and variety of his work. It was not an exciting life, but it was full of interest ...",
  "matematicos_citados_na_biografia": [
    "sizar",
    "Woodhouse",
    "Peacock",
    "Babbage",
    "Pearson",
    "Professor Cayley",
    "Adams",
    "Royal Society of Edinburgh",
    "Royal Society of London",
    "Royal Astronomical Society",
    "British Association",
    "John Herschel",
    "transit"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}