{
  "nome_completo": "George Lowe Moffat",
  "nome_curto": "George Moffat",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moffat/",
  "data_nascimento": "18 June 1872",
  "local_nascimento": "Leith (near Edinburgh), Scotland",
  "data_morte": "15 April 1934",
  "local_morte": "Helensburgh, Scotland",
  "summary": "George Moffat graduated from Edinburgh University and taught at Dumfries Academy and Glasgow Academy where he became Head of Mathematics.",
  "biografia": "George Moffat\n's father was Andrew Moffat\n(1832\n-\n1896)\nand his mother was Marion Lowe\n(\nborn\n1841\nin Gladsmuir, Haddington. George attended Leith High School from\n1880\nto\n1882\n, then attended George Watson's College from\n1882\nto\n1890\n. He entered the University of Edinburgh, first matriculating in October\n1890\n. Moffat was awarded an M.A. by the University of Edinburgh in\n1893\n.\nMoffat became a mathematics teacher, and taught at Dumfries Academy from\n1893\nto\n1897\n. He was then appointed to The Academy, Glasgow, as an assistant mathematics master. He was always known to his colleagues in the school as 'Geordie'. In December\n1912\n, following the death of James Wood, the Head of Mathematics, Geordie Moffat was appointed to take charge of the Department. We quote from\n[\n2\n]\nconcerning Moffat's character and personality:-\nThere were many facets to Mr Moffat's character and intellect. Those who sat under him in the classroom will mainly remember how successfully they played Meno to his Socrates; but along with his lucidity of exposition they will remember a certain acidity of humour, a source of delight to his audience and not without solace to the offending victim. This characteristic he revealed more extensively still in his intercourse with colleagues: there was never story which he could not cap, rarely a human frailty which he could not pillory with mild and curative satire. He was the last man to make a parade of scholarship. His hospitality to a comparative stranger was charming: but it was not till the stage of light badinage was well past that he admitted one to the deeper recesses of his mind. Then he disclosed interests of great variety and wide range. The somewhat disorderly appearance of his large library, and his habit of collecting books at a faster pace than he could read them, would suggest the dilettante, but in fact he read with absorption in many fields outside his special mathematical studies, and history, theology, philosophy afforded him continual and congenial occupation. Latterly, he had readily lent a helping hand in the reconstruction of the school Library. He would have been much in demand as an after-dinner speaker at School Dinners, had it not been for a certain disinclination; oddly enough he had recently been persuaded to relent, and that for the first time.\nAt Easter\n1934\n, Moffat went on holiday to Helensburgh, where he died. His death was announced as follows:-\nMOFFAT. Suddenly at Helensburgh on Sunday\n15\nApril\n1934\n, George L Moffat, M.A., B.Sc., of\n8\nClarence Drive, Hyndland, Mathematical Master, Glasgow Academy, beloved husband of Elizabeth B Hutchison.\nWhen he joined the\nEdinburgh Mathematical Society\nin December\n1897\nhe gave his address as The Academy, Glasgow, and at this stage he gave only an M.A. as his degree, but three years later he gave, in addition to the M.A., a B.Sc. which had been awarded by the University of London. He remained a member of the\nEdinburgh Mathematical Society\nthroughout his life.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society"
  ],
  "imagens": []
}