{
  "nome_completo": "George Johnston Allman",
  "nome_curto": "George Allman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Allman/",
  "data_nascimento": "28 September 1824",
  "local_nascimento": "Dublin, Ireland",
  "data_morte": "9 May 1904",
  "local_morte": "Dublin, Ireland",
  "summary": "George Allman was an Irish professor, mathematician, classical scholar and historian of ancient Greek mathematics.",
  "biografia": "George Allman\n's parents were Anne and William Allman\n(1776\n-\n1846)\nwho were married in\n1814\n. William Allman, the son of Thomas Allman, was born in Jamaica but came to Ireland at the age of four years. He studied medicine at Trinity College, Dublin and after practising medicine in Clonmel, County Tipperary, he was appointed professor of botany in Trinity College, Dublin in\n1809\n. As well as publishing on botanical topics, he was also interested in mathematics and published some minor works on the subject. George was the younger of his parents' two sons and was brought up by his father following the death of his mother Anne in\n1831\n.\nGeorge Allman studied both pure and applied mathematics at Trinity College, Dublin, and graduated in\n1844\ncoming first equal among the First Class students\n(\nwith\nSamuel Haughton\nwho became professor of geology at Trinity College\n)\nand winning the gold medal for mathematics. He married Louisa Taylor of Dublin and Corballis, County Meath, in\n1853\n; they had one son and two daughters\n(\ntheir eldest daughter Bessie was married in\n1878\nand died in\n1892)\n. In the same year of\n1853\nAllman was appointed as Professor of Mathematics at Queen's College, Galway. He held this position for forty years until he reached retiring age in\n1893\n. He became a member of the Senate of the Queen's University in\n1877\n. He was nominated as one of the first Senators of the Royal University of Ireland in\n1880\n, holding this position until the end of his life.\nAs to his mathematical contributions\n[\n1\n]\n:-\nHe contributed a few papers on mathematical subjects to scientific periodicals, besides an account of Professor\nJames MacCullagh\n's lectures on 'The attraction of the ellipsoid', which appears in the latter's collected works. He also wrote a number of articles in the ninth edition of the 'Encyclopaedia Britannica' on Greek mathematicians.\nThe full title of the paper referred to in this quotation is\nOn the attraction of ellipsoids with a new demonstration of Clairaut's theorem, being an account of the late Professor MacCullagh's lectures on those subjects\nand it appeared in the\nTransactions of the\nRoyal Irish Academy\nXXII\n(1853)\n,\n380\n-\n395\n. Among the articles Allman contributed to the ninth edition of the\nEncyclopaedia Britannica\nwere those on\nThales\n,\nPythagoras\n,\nPtolemy\nand other Greek philosophers.\nHowever, Allman's most significant contribution was\nGreek geometry from Thales to Euclid\npublished in Dublin in\n1889\n. He explains in the Introduction what he aims to cover in the book:-\nIn studying the development of Greek Science, two periods must be carefully distinguished. The founder of Greek philosophy -\nThales\nand\nPythagoras\n- were also the founders of Greek science, and from the time of\nThales\nto that of\nEuclid\nand the foundation of the museum of Alexandria, the development of science was, for the most part, the work of the Greek philosophers. With the foundation of the School of Alexandria, a second period commences; and henceforth, until the end of the scientific evolution of Greece, the cultivation of science was separated from that of philosophy, and pursued for its own sake. In this work I propose to give some account of the progress of geometry during the first of these periods, and also to notice briefly the chief organs of its development.\nThe content of the work is summarised in\n[\n1\n]\n:-\nIn this he traced the rise and progress of geometry and arithmetic, and threw new light on the history of the early development of mathematics.\nJohn Sturgeon Mackay\n, reviewing the book in\nAcademy\n(1\nJune,\n1889)\n, writes:-\nNothing so painstaking, so lucid, and so satisfactory has been written on the history of geometry during the period selected, even in laborious Germany.\nAllman developed methods of deduction of historical information which have proved fundamental in discovering information of the type described in our articles\nHow do we know about Greek mathematics?\nand\nHow do we know about Greek mathematicians?\nin this archive.For example in\n[\n3\n]\nNeuenschwander uses a philological technique developed by Allman in his studies of\nHippocrates of Chios\nin order to show that\nEutocius\nwas by no means quoting directly from\nEudemus\n's\nHistory of geometry\n.\nHe was honoured with the award of an honorary D.Sc. from Dublin University in\n1882\nand he was elected a fellow of the\nRoyal Society of London\nin\n1884\n. Queen's College Galway sent him as their delegate to the University of Bologna in\n1888\nto take part in their octo-centenary. He died of pneumonia at Farnham House, Finglas, Dublin.\nThe\nRoyal Society\nobituary gives the following assessment of Allman's character\n[\n5\n]\n:-\nIn every relation of life he was estimable, and his loss will long be felt by a large circle of college and other deeply attached friends. To the latter he was endeared by his affectionate, frank, and genial disposition; and no person who came in close contact with him could fail to be impressed by his integrity, sincerity, and strong sense of duty which were among his marked characteristics.",
  "matematicos_citados_na_biografia": [
    "Samuel Haughton",
    "James MacCullagh",
    "Royal Irish Academy",
    "Thales",
    "Pythagoras",
    "Ptolemy",
    "Euclid",
    "John Sturgeon Mackay",
    "How do we know about Greek mathematics?",
    "How do we know about Greek mathematicians?",
    "Hippocrates of Chios",
    "Eutocius",
    "Eudemus",
    "Royal Society of London",
    "Royal Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}