{
  "nome_completo": "George Bruce Halsted",
  "nome_curto": "George Halsted",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Halsted/",
  "data_nascimento": "23 November 1853",
  "local_nascimento": "Newark, New Jersey, USA",
  "data_morte": "16 March 1922",
  "local_morte": "New York, USA",
  "summary": "George Halsted was an American mathematician who explored foundations of geometry and introduced non-Euclidean geometry into the United States. He was interested in mathematical education and in the history of mathematics.",
  "biografia": "George Halsted\n's parents were Adela Meeker and Oliver Spencer Halsted, who was a lawyer. The family were well educated; Oliver Halsted had followed the family tradition and been educated at Princeton, like his father and grandfather. It was natural that George would follow this tradition and indeed he too become a student at Princeton University.  He was awarded his A.B. in\n1875\nand, three years later, his A.M.  After the award of his bachelor's degree he studied for a short time at the Columbia School of Mines which had been set up only a short time before at Columbia College in New York City by Frederick Barnard, the president of the College. After this brief period of study, he became\nSylvester\n's first student at Johns Hopkins University where he studied for his doctorate which was awarded in\n1879\nfor his dissertation\nBasis for a Dual Logic\n. He also studied with\nBorchardt\nin Berlin during his doctoral studies. Halsted was given outstanding references by\nSylvester\nto present to\nBorchardt\n.\nReturning to the United States, Halsted was appointed a tutor at Princeton, a post he held between\n1879\nand\n1881\n, then from\n1881\nhe was an instructor in postgraduate mathematics at Princeton, continuing until\n1884\n. He communicated his enthusiasm, particularly for non-euclidean geometry, to a small group of undergraduates at Princeton and in particular to\nFine\n, who had a natural bent for questions of a logical order. In\n1884\nhe accepted a professorship at the University of Texas at Austin. The state constitution of\n1876\nhad provided an endowment and, five years later, the state legislature established a campus at Austin, Texas. The University of Texas at Austin opened in\n1883\n, and Halsted was appointed to the Department of Pure and Applied Mathematics there in only the second year of operation of the University.  He taught there for nineteen years, and during that time influenced a number of students who were to play major roles in the development of American mathematics.\nL E Dickson\nwas an undergraduate and worked for his M.S.\n(\nawarded in\n1894)\nunder\nHalsted\n's supervision.\nRobert Moore\nentered the University of Texas in\n1898\nand there he took courses by Halsted who turned him into an enthusiast for mathematical research, even in his undergraduate course. His teaching methods, which we say more about below, were always directed towards students learning by guided research.\nThere are a number of anecdotes showing Halsted's eccentric nature given in\n[\n2\n]\n. However, despite being somewhat eccentric, yet he was an inspiring professor\n[\n6\n]\n:-\nStudent reminiscences picture Halsted as one of the more colourful professors in the university's early history and a popular speaker on and off campus whether talking about his travels to Germany, Mexico, Japan, and Hungary or about religion or science or about geometry.\nIn\n1886\nHalsted married Margaret Swearingen in Austin; they had three children. His main interests were the foundations of geometry and he introduced non-euclidean geometry into the United States, both through his own research and writings as well as by his many important translations. Halsted gave commentaries on the work of\nLobachevsky\n,\nBolyai\n,\nSaccheri\nand\nPoincaré\nand made translations of their works into English. His work on the foundations of geometry led him to publish\nDemonstration of Descartes's theorem and Euler's theorem\nin the\nAnnals of Mathematics\nin\n1885\n, the year after he arrived at Austin, and then, in the same journal,\nKlein's Evanston lectures\nin\n1893\n.\nLewis describes his teaching methods in\n[\n4\n]\n:-\nIn a classroom of freshmen one of his main purposes was to challenge what he regarded as the ill founded notions that pervaded the teaching of geometry. he could, for example, always count on a student in such a class giving him the common but not mathematically satisfying definition of a straight line as the shortest distance between two points. His criticism of such a definition could be the starting point for a discussion of the fundamentals of geometry. his teaching method may have been one of the inspirations for the Moore method of teaching that his student\nR L Moore\nlater developed with great success.\nHalsted was always outspoken, even in situations where it was clear that what he said would land him in trouble. He could criticise the students he taught with little fear of come back, and his colleagues came in for similar criticism which one would have to say was usually deserved. However when it comes to criticising university administrations one should be more careful - Halsted was not. The University of Texas, like all state universities, was governed by a board of regents. When Halsted criticised these men as being political appointments he had gone too far. He was dismissed from his post in\n1902\n.\nFrom\n1903\nhe held posts at St John's College, Annapolis, Maryland\n(1903)\n, then Kenyon College, Gambier, Ohio\n(1903\n-\n1906)\n. One might have thought that his experience at Texas would have made Halsted a bit more careful of his actions but this seems not to be so. At Kenyon College he was appalled at the student initiations which took place there, with bullying being an accepted way of life for the students. He spoke out strongly against these practices which made him unpopular in all quarters. These sorts of things were a way of life in certain establishments and people did not take kindly to an outspoken person like Halsted criticising them. Finally he went to Colorado State College of Education, Greeley in\n1906\n(\nthis is now the University of Northern Colorado at Greeley\n)\n. Again Halsted was not prepared to turn a blind eye to things he thought were wrong and again he was very outspoken, What did he find to attack this time? Well this time his charge was certainly a serious one for he stated very publicly that the college was being mismanaged\n[\n6\n]\n:-\nThis last controversy led to the college administration being investigated by a grand jury and by two committees appointed by the state governor. Halsted spent most of the last years of his life continuing with his mathematical writing while working as an electrician in the family-run electricity supply store that he had established in Greeley.\nWhen Halsted completed the Princeton University Biographical Questionnaire he wrote:-\nI am working as an electrician as there is nothing in cultivating vacant lots.\nHe certainly felt badly treated by the mathematical community.\nWriting in\n[\n1\n]\n, H S Tropp says of Halsted:-\nIn the period when American mathematics had few distinguished names, the eccentric and sometimes spectacular Halsted established himself as an internationally known scholar, creative teacher and promoter and popularizer of mathematics.\nHis other main interest was in mathematical education and, as a mathematics educator, he criticised the careless way that mathematics was presented in the textbooks of the time. He contributed over ninety article to the\nAmerican Mathematical Monthly\nand wrote many biographies of mathematicians such as\nLambert\n,\nFarkas Bolyai\n,\nLobachevsky\n,\nDe Morgan\n,\nSylvester\n,\nChebyshev\n,\nCayley\n,\nHoüel\nand\nKlein\n.",
  "matematicos_citados_na_biografia": [
    "Sylvester",
    "Borchardt",
    "Fine",
    "L E Dickson",
    "Robert Moore",
    "Lobachevsky",
    "Bolyai",
    "Saccheri",
    "Poincaré",
    "R L Moore",
    "Lambert",
    "Farkas Bolyai",
    "De Morgan",
    "Chebyshev",
    "Cayley",
    "Hoüel",
    "Klein"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}