{
  "nome_completo": "Géza Grünwald",
  "nome_curto": "Géza Grünwald",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grunwald/",
  "data_nascimento": "18 October 1910",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "16 September 1942",
  "local_morte": "Ukraine",
  "summary": "Géza Grünwald was a Hungarian mathematician who worked on analysis. He died in the Holocaust.",
  "biografia": "Géza Grünwald\nwas the son of Ármin Grünwald\n(1881\n-\n1943)\nand Katalin Sommer who were Jewish. Géza had a brother Gyula Grünwald, born in Pestszenterzsebet, a suburb of Budapest, in\n1912\n. Ármin Grünwald was a house painter who tried hard to educate his sons but struggled to bring in a sufficient income. He did, however, send his two sons to an excellent school. Géza attended the St Stephen's Gymnasium in Budapest where he was taught mathematics by Lajos Erdős, the father of\nPaul Erdős\n. One of the pupils at St Stephen's Gymnasium was\nPaul Erdős\nand the two, both with a passion for mathematics, quickly became friends. Lajos Erdős realised that his pupil Géza was very talented and he also realised that his family were not really able to financially support their son's education at this school. Lajos supported Géza both with encouragement and with financial support.\nBefore we go any further we need to clear up a potential difficulty. There were two mathematicians in Budapest in the\n1930\ns who were both named Grünwald, namely Tibor Grünwald and Géza Grünwald, the subject of this biography, but they were not related. Both published papers in the\n1930\ns, both even have joint papers with\nPaul Erdős\n, and they were both members of the same group of young Jewish mathematicians meeting together in Budapest. Our archive also contains a biography of Tibor Grünwald but he is listed under the name\nTibor Gallai\nwhich he adopted during World War II.\nGéza Grünwald and\nPaul Erdős\n, who was about\n30\nmonths younger than Géza, used to walk a great deal in Városliget public park surrounding Hero's Square close to the city centre of Budapest. It was, and still is, one of the city's most popular public parks where many people go to relax and enjoy the sun. It contained a zoo and botanical gardens but Géza and Paul spent most of the time they were in the park trying to outdo each other in mental challenges and trying to beat each other in chess. Grünwald was an exceptionally talented chess player.\nWhile still at the High School in\n1927\n, Grünwald contracted tuberculosis. This was a serious disease and in the\n1920\ns around\n50\n% of those who entered sanatoria with the disease died within five years of contracting it. There was a large difference, however, depending on the sanatorium that the patient went to, with those having a much better chance of a complete cure if it was an expensive sanatorium which offered top quality care and medical attention. Grünwald's parents were not in a financial position to give him this type of sanatorium but Lajos Erdős offered the necessary financial support and Grünwald spent a whole year in a sanatorium, making a complete recovery.\nGrünwald should have taken his final school examinations in\n1928\nbut, of course, his illness and the year spent in the sanatorium meant this was not possible. After his recovery he sat his final school examinations in\n1929\nbut, because of the disruption to his schooling, he did not gain one of the top places as would have been expected had his schooling been unaffected. Since Grünwald was Jewish, the fact that his school examinations were not outstanding meant big problems in obtaining a university place. We should explain why being Jewish led to this problem. In\n1919\nthere was a Communist take-over of Hungary. A right wing government took over in\n1920\nand there was a rise of anti-Semitism with Jews attacked in the streets. In fact the anti-Semitism was written into law in\n1920\nwith universities only allowed to have\n5\n% of their students being Jewish. Grünwald's examination results were not good enough for him to obtain a university place in Hungary with these severe restrictions.\nIf he could not have a university education in Hungary, then he thought he might be able to gain admission to an Italian university. There were financial problems to this idea which had no easy solution. Again it was Lajos Erdős who came to the rescue. He approached\nAlfréd Haar\nwho was the professor of mathematics at the University of Szeged and explained to\nHaar\nthat Grünwald was an outstanding mathematician yet unable to gain admission to university. Let us spend a moment explaining how the University of Szeged had been created not long before this time.\nHaar\nhad been appointed to the Franz Josef Royal Hungarian University in Kolozsvár in\n1912\nand become a full professor there in\n1917\n. Austro-Hungary was aligned to the Central Powers and during the first three years of World War I. In\n1921\nthe Treaty of Trianon was signed which treated Hungary very severely. Its territory was reduced to only one third of its previous size. The terms of the Treaty meant that Kolozsvár was no longer in Hungary\n(\nit became part of Romania\n)\n, so the University there had to move within Hungarian borders. At first it was sited in Budapest for a temporary period of two years before it moved to Szeged, where there had previously been no university. The Department of Mathematics, consisting of the Mathematical Seminary and the Institute of Descriptive Geometry, began operating in Szeged. The department consisted of\nFrigyes Riesz\n,\nAlfréd Haar\n, Rudolf Ortvay\n(\nwho held the Chair of Mathematical Physics\n)\n, and\nTibor Radó\nwho had been appointed as\nHaar\n's assistant. Following Lajos Erdős's recommendation,\nHaar\ninvited Grünwald for an interview which went very well and he was accepted into the University of Szeged's mathematics programme.\nAlexander Soifer writes in\n[\n2\n]\n:-\nIn the early\n1930\ns Budapest, a group of young Jewish students regularly met in a park or took excursions to the countryside to discuss mathematics. ... the regular members of this remarkable group\n[\nwere\n]\n:\nPaul\n(\nPal\n)\nErdős\n,\nTibor Grünwald\n(\nlater Gallai\n)\n, Gergőr\n(\nGéza\n)\nGrünwald, Ester Klein,\nGyörgy\n(\nGeorge\n)\nSzekeres\n, Lily Székely\n(\nlater Sag\n)\n,\nPaul\n(\nPal\n)\nTurán\n, Endre Vázsonyi, and Marta Wachsberger\n(\nlater Sved\n)\n.\nThis group met at the Anonymous Statue and called themselves the 'Anonymous Circle'. The mathematical discussions which went on within this Circle were perhaps more significant in Grünwald's mathematical training than his studies at Szeged.\nPaul Turán\nwrites\n[\n6\n]\n:-\nGrünwald's mathematical interests were wide-ranging. He used to talk about his experiences in Szeged to his friends in Budapest with much enthusiasm. ... Our group of young researchers in Budapest learned of and studied approximation theory through the works of\nLeopold Fejér\n. Grünwald regularly attended our weekly meetings which we held near the statue of Anonymous in the city park. There was no equivalent opportunity in Szeged so that it was natural that Grünwald became interested in issues discussed in our group.\nGrünwald's career at Szeged was highly successful. Beginning with his second year, he won a university prize in each of four consecutive years. In his final undergraduate year he did a project on interpolation and this earned him a university prize. He continued to undertake research on interpolation, advised by\nFrigyes Riesz\n, and submitted his doctoral thesis entitled\nDivergence phenomena of Lagrange interpolating polynomials\n(\nHungarian\n)\n. He defended his thesis on\n4\nDecember\n1935\nand was awarded a doctorate. The\n22\n-page thesis was published in\n1935\nin Hungarian. He published two papers in German, namely\nÜber Divergenzerscheinungen der Lagrangeschen Interpolationspolynome\nⓉ\n(\nOn divergence phenomena of the Lagrange interpolation polynomials\n)\n(1935)\nand\nÜber Divergenzerscheinungen der Lagrangeschen Interpolationspolynome stetiger Funktionen\nⓉ\n(\nOn the divergence phenomena of the Lagrange interpolation polynomials for continuous functions\n)\n(1936)\n. He remained at Szeged to gain a teaching qualification and he was awarded a diploma to teach mathematics and physics in September\n1936\n.\nZoltán Lajos Bay\n(1900\n-\n1992)\nwas appointed professor of theoretical physics at the University of Szeged in\n1930\n. He was a physicist and engineer who developed various technologies. As well as being professor of theoretical physics at Szeged, Zoltán Bay took over the role of head of the research laboratory of the Egyesült Izzó\n(\nUnited Incandescent Lamp and Electricity Co.\n)\nfactory in\n1936\n. The research laboratory of this electricity company was in Budapest and in September\n1937\nGrünwald was employed by Zoltán Bay as a mathematician in the research laboratory.\nOn\n22\nMay\n1938\nGrünwald married Anna Szilágyi who had been born in Miskolc, Hungary, in\n1911\n. Anna, who had been a school friend of Grünwald's, was the daughter of Adolf Szilágyi and Ilona Kálmán. They lived at Szondi utca\n95\n, Budapest, very close to the entrance to the Városliget public park. Anna and Géza Grünwald had one child, a daughter Eva Grünwald born in Budapest in\n1939\n. Eva and her mother Anna are both listed in\n[\n2\n]\nas Holocaust Survivors while Géza Grünwald and his brother Gyula did not survive.\nGrünwald published\n18\npapers in his short life before he was murdered in\n1942\nor\n1943\n. His papers are in Hungarian, German and English. We list these papers at\nTHIS LINK\n.\nToday Grünwald is best known for the Grünwald-\nMarcinkiewicz\nTheorem. Lásló Szili and Péter Véeresi write in the Preface to\n[\n5\n]\n:-\nIn\n1910\n, exactly hundred years ago, two outstanding mathematicians were born:\n(\nin alphabetical order\n)\nthe Hungarian Géza Grünwald and the Polish\nJózef Marcinkiewicz\n. But we must note some other similarities. They proved in the same year\n(1935)\nthe first version of their famous result\n(\nas today called\n)\nthe Grünwald-\nMarcinkiewicz\nTheorem\n(\nG-M Theorem, for short\n)\n. Both improved this first version and got the final form already in the next year; the theorem was a part of their PhD dissertations. And, finally, both were killed during the second world war: Géza Grünwald became a holocaust victim in\n1942\nwhile\nJózef Marcinkiewicz\ndied in\n1940\nin the Katyn massacre.\nThe Grünwald-\nMarcinkiewicz\nTheorem shows that\nLagrange\ninterpolation based at the zeros of\nChebyshev\npolynomials can diverge everywhere even for continuous functions.\nNow we come to Grünwald's death and must say straight away that its date is unclear. The above quote give\n1942\n, other sources give\n1943\n, but we will look below at the evidence and explain why we have given\n16\nSeptember\n1942\n. Here is\nPaul Turán\n's account\n[\n6\n]\n(\nsee also\n[\n4\n]\n)\n:-\nI\n[\nPaul Turán\n]\nbegan writing about Géza Grünwald in\n1943\n, a little while after I found out that he had died. It was hard to believe that it was at the April\n1942\n, meeting of the\nBolyai Mathematical Society\nwhen we last met. At the end of that meeting, Géza told me that he was called up for active military duty in the Labour Service Battalions. Young people are shocked when facing death, they can hardly believe in it. I felt just like that and kept hoping that there must have been an error or a misunderstanding, and, in the end, I stopped writing. During the liberation of Budapest in\n1945\n, we all became personally acquainted with death. As time went by, the facts started to come out. We learned that the Hungarian Labour Service Battalion he served in was in fact a \"death unit\" made up of completely innocent \"politically unreliable\" people as punishment for an act of sabotage in the city of Györ. Within a few months the entire Battalion was executed except for five lucky survivors, among whom was Mr István Kossa who was a good friend of Grünwald and who stayed with him until his execution According to Kossa and the official paperwork, Grünwald died on\n7\nSeptember\n1943\n, at the age of\n31\n.\nIstván Kossa\n(1904\n-\n1965)\nwas elected Secretary General of the Hungarian Social Democratic Party in\n1933\nand served as secretary to the United Incandescent Lamp and Electricity Company where Grünwald worked. Kossa was drafted into the same Labour Service Battalion as Grünwald and describes his experiences in\n[\n1\n]\nwhere he writes:-\nDr Géza Grünwald, a mathematician at the United Bulb, a good comrade who kept close contact with us but has a weak physique.\nAfter World War II, István Kossa became a Hungarian politician and twice served as Minister of Finance.\nAn István Kossa biography states he escaped the Service Battalion in January\n1943\nwhich contradicts the statement that he was with Grünwald until his death on\n7\nSeptember\n1943\n. The date we have given for Grünwald's death is\n16\nSeptember\n1942\nand this is the date given in the Holocaust Survivors and Victims Database\n[\n3\n]\n. The Database states that he was buried on the same day. We note that the Database also shows that Grünwald's brother Gyula also died after being drafted into a Hungarian Labour Service Battalion after being captured. The Database gives \"Date Missing: January\n1943\n.\"\nThe\nJános Bolyai Mathematical Society\nestablished the Géza Grünwald Memorial Prize in\n1951\n. It is awarded annually to exceptional young mathematicians\n(\nup to a maximum of four per year\n)\nwho have made successful starts to their research careers. See\n[8]\nfor details. Some sources state that it was first awarded in\n1953\nby we have found that Lajos Takács won the second Géza Grünwald Memorial Prize in\n1952\nfor his paper\nInvestigation of waiting time problems by reduction to Markov processes\n.",
  "matematicos_citados_na_biografia": [
    "Paul Erdős",
    "Tibor Gallai",
    "Alfréd Haar",
    "Haar",
    "Frigyes Riesz",
    "Tibor Radó",
    "Paul(Pal)Erdős",
    "Tibor Grünwald(later Gallai",
    "György(George)Szekeres",
    "Paul(Pal)Turán",
    "Paul Turán",
    "Leopold Fejér",
    "THIS LINK",
    "Marcinkiewicz",
    "Józef Marcinkiewicz",
    "Lagrange",
    "Chebyshev",
    "Bolyai Mathematical Society",
    "János Bolyai Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}