{
  "nome_completo": "Gheorghe Pic",
  "nome_curto": "Gheorghe Pic",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pic/",
  "data_nascimento": "18 March 1907",
  "local_nascimento": "Szczakowa, Jaworzno, Upper Silesia (now Poland)",
  "data_morte": "23 September 1984",
  "local_morte": "Cluj, Romania",
  "summary": "Gheorghe Pic was a mathematician, born in what is now Poland, who worked in algebra.",
  "biografia": "Gheorghe Pic\n's father was an engineer who was involved with the production of natural gas around Medias, and the family moved to this district when Gheorghe was about one year old. Medias was part of Austria-Hungary when the Pic family moved there but about ten years later, in\n1919\n, it became part of Romania. The town was an important industrial centre because of the nearby natural gas deposits with which Gheorghe's father was involved. Gheorghe attended both primary and secondary school in Blaj, about\n40\nkm west of Medias. He graduated from secondary school in\n1925\nand entered the Faculty of Sciences of the University of Cluj.\nCluj\n(\nknown also by its German name, Klausenburg, and its Hungarian name, Kolozsvár\n)\nhad, with the rest of Transylvania, been incorporated into Romania in\n1919\n, just five years before Pic went to study there. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n.\n(\nThe Hungarian university in Cluj moved first to Budapest, then to Szeged.\n)\nPic obtained his first degree in\n1928\nfrom the Romanian King Ferdinand University of Cluj, then continued to study for his 'capability examination'\n(\nessentially equivalent to a Master's degree\n)\nin mathematics and physics in\n1930\n. Following this Pic went to Rome to study for his doctorate. He submitted his thesis\nDespre invariantii adiabatici ai sistemelor neoronome\nⓉ\n(\nOn the adiabatic invariants of holonomic systems\n)\nin\n1932\nand he defended it before a committee chaired by\nLevi-Civita\nand eleven other professors including\nVito Volterra\nwho was a good friend of Romanian mathematicians.\nAfter returning to Romania after his two years of studying in Rome, Pic had to do his military service. Following this, in\n1933\n, he was appointed as a professor at a high school\n(\na lycée\n)\nin Gherla. He had already taught in this school while doing his undergraduate degree at Cluj, and they were glad to be able to employ such a talented teacher again. He became an honorary assistant to\nTheodor Angheluta\nin the Department of Algebra at the University of Cluj, a position he was to hold for three years while he supported himself financially with his teaching position in Gherla. He was named professor in the Department of Algebra at the University of Cluj on\n1\nNovember\n1945\nbut we should explain some of the events which had affected the university. In\n1940\n, after the start of World War II, the Hungarian university was moved back from Szeged to Cluj, and the Romanian university in Cluj moved to Sibiu and Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. Parts of the Hungarian university in Cluj moved back to Szeged, while that part which remained in Cluj was named the Bolyai University\n(\nafter\nJános Bolyai\n)\n. Pic remained at the university in Cluj until\n1952\n.\nPic went to Bucharest in\n1952\nwhere he worked in the Institute of Civil Engineering, which was headed by N Teodorescu, and also in the Department of Algebra at the University of Bucharest, which was headed by\nGrigore Moisil\n. In September\n1957\nhe returned to Cluj. He was elected as Dean of the Faculty of Mathematics and Physics in\n1958\n, then, four years later, he was elected as Dean of the Faculty of Mathematics and Mechanics. His period as Dean of the Faculty of Mathematics and Physics was a particularly important one since in\n1959\nthe Babeș University and the Bolyai University in Cluj joined to became the Babeș-Bolyai University. Pic headed the Department of Mathematics at Babeș-Bolyai University until his death in\n1984\n.\nThe influence of Pic on the University of Cluj was very marked. He founded the modern algebraic school there, played a major role in the development of the teaching of modern mathematics in Cluj, as well as doing important work building up the mathematics library. His research was mainly in the theory of groups and he wrote several books on higher algebra. Some papers he published in French such as the following which were published early in his career\nSur les groupes de substitutions linéaires qui laissent n points inchangés\nⓉ\n(\nOn groups of linear substitutions  that leave n points fixed\n)\n(1947)\n,\nSur quelques propriétés des groupes discontinus et finis de substitutions linéaires\nⓉ\n(\nOn some properties of discrete and finite groups of linear substitutions\n)\n(1948)\n, and\nSur une équation fondamentale relative aux groupes finis de substitutions linéaires\nⓉ\n(\nOn a fundamental equation on finite groups of linear substitutions\n)\n(1949)\n. Later he published further papers in French, for example\nSur les groupes finis p-nilpotents\nⓉ\n(\nOn finite  p-nilpotent groups\n)\n(1965)\n,\nSur un théorème de la théorie des nombres et ses applications à la théorie des treillis et des groupes\nⓉ\n(\nOn a theorem of number theory and its applications to lattice theory and groups\n)\n(1966)\n, and the lattice theory paper\nUne propriété des treillis finis et distributifs\nⓉ\n(\nA property of finite and distributive lattices\n)\n(1972)\n. Among the papers he published in Romanian, we mention the following\n(\nwhere we give an English translation\n)\nOn the structure of quasi-Hamiltonian groups\n(1949)\n,\nOn a new generalisation of nilpotency of a group\n(1954)\n,\nOn a theorem of B H Neumann\n(1960)\n, and\nOn a theorem of L Fejér\n(1962)\n.\nFinally let us look at the algebra textbook\nTreatise on modern algebra\nwhich Pic published in Romanian in\n1977\n, written jointly with Ioan Purdea. The book consists of four chapters. The first chapter contains a basic introduction to relations. The second chapter, on universal algebra, has sections covering: basic definitions and some examples; homomorphisms of universal algebras and congruence relations; lattices and Boolean lattices; and the lattice of subalgebras and the lattice of congruences of a universal algebra. The third chapter studies groups and semigroups. The fourteen sections are: semigroups; divisibility in commutative semigroups; groups; semigroups of fractions; equivalences induced by a subgroup; conjugate subsets; inner automorphisms;\nSylow\nsubgroups; extensions of groups; direct products of subgroups; normal series; nilpotent groups; solvable groups; free semigroups and free groups. The final chapter is on rings and discusses: definition of a ring; ideals; rings of fractions; characteristics of rings; products of rings; polynomial rings; symmetric polynomials and symmetric rational functions; divisibility in integral domains; prime ideals and prime radicals of ideals in associative rings; Artinian and Noetherian rings;\nDedekind\ndomains; primary ideals in associative and commutative rings with unity; algebraic varieties; and the\nJacobson\nradical in associative rings with identity.",
  "matematicos_citados_na_biografia": [
    "Levi-Civita",
    "Vito Volterra",
    "Theodor Angheluta",
    "János Bolyai",
    "Grigore Moisil",
    "Sylow",
    "Dedekind",
    "Jacobson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}