{
  "nome_completo": "Giacinto Morera",
  "nome_curto": "Giacinto Morera",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morera/",
  "data_nascimento": "18 July 1856",
  "local_nascimento": "Novara (now Italy)",
  "data_morte": "8 February 1907",
  "local_morte": "Turin, Italy",
  "summary": "Giacinto Morera was an Italian mathematician who made contributions to dynamics.",
  "biografia": "Giacinto Morera\n, the son of a wealthy businessman, graduated in engineering and mathematics from the University of Turin in Italy, having attended the courses by\nEnrico D'Ovidio\n,\nAngelo Genocchi\nand\nFrancesco Siacci\n. He considered\nSiacci\nto be not only his \"teacher\" in science and also his teacher about life. Morera extended his knowledge of mathematics, first at the University of Pavia in Italy under the direction of\nEugenio Beltrami\nand\nFelice Casorati\n, then at the University of Pisa under the direction of\nEnrico Betti\nand\nUlisse Dini\n, and finally in Leipzig with\nAdolph Mayer\nand\nFelix Klein\n.\nHe won the competition for the position of professor of rational mechanics at Genoa University, where he stayed and lived for fourteen years. At Genoa he was also professor of mathematical physics, became dean of the Faculty and rector of the University.\nIn\n1900\nhe went to Turin University where he taught advanced and rational mechanics, both at the University and at the Polytechnic. There, as he had been in Genoa, he was appointed as dean of the Faculty of Science. He was member of the\nAcademy of Sciences of Turin\nand of the\nAccademia dei Lincei\n.\nSomigliana described Morera as a \"correct and careful man\", an \"effective teacher\", and wrote\n[\n1\n]\n:-\n... it is not possible to argue that he was very creative; his brains were overall analytical and critical, so that he did not create new theories, but developed the ones which already existed\n[\n... his results consisted of\n]\nsolutions to complicated and difficult problems.\nMorera studied the fundamental problems which arise in dynamics with particular regard to the use of the\nPfaff\nmethod applied to Jacobian systems of partial differential equations and to the problem of\nLie\ntransformations of the canonical equations of motion.\nHe developed the study of the harmonic functions, applying results due to Pizzetti, finding a simple expression for the inner and outer gravitational field of an ellipsoid, solving the\nDirichlet\nproblem. He was interested also in the\nCauchy\nintegral for the representation of functions of a complex variable, in the discontinuity of the differentials of the potential function and in the\nGauss\nrepresentation formula. Finally we note that he improved the proof of the\nKirchhoff\nformula for the\nHuygens\nprinciple.",
  "matematicos_citados_na_biografia": [
    "Enrico D'Ovidio",
    "Angelo Genocchi",
    "Francesco Siacci",
    "Siacci",
    "Eugenio Beltrami",
    "Felice Casorati",
    "Enrico Betti",
    "Ulisse Dini",
    "Adolph Mayer",
    "Felix Klein",
    "Academy of Sciences of Turin",
    "Accademia dei Lincei",
    "Pfaff",
    "Lie",
    "Dirichlet",
    "Cauchy",
    "Gauss",
    "Kirchhoff",
    "Huygens"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}