{
  "nome_completo": "Giambattista Della Porta",
  "nome_curto": "Giambattista della Porta",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Porta/",
  "data_nascimento": "1 November 1535",
  "local_nascimento": "Vico Equense near Naples, Kingdom of Naples (now Italy)",
  "data_morte": "4 February 1615",
  "local_morte": "Naples, Kingdom of Naples (now Italy)",
  "summary": "Giambattista della Porta was an Italian scholar who worked on cryptography and also on optics. He claimed to be the inventor of the telescope although he does not appear to have constructed one before Galileo.",
  "biografia": "Giambattista della Porta\n's father was Nardo Antonio Della Porta, a man of considerable wealth and importance, owning both land and ships. Giambattista's mother was a sister of Adriano Guglielmo Spadafora, a man of learning who worked as a conservator in the archives in Naples. From\n1541\nNardo Antonio was in the service of Emperor Charles V as Scrivano di Mandamento, meaning he was the secretary to the Emperor responsible for civil appeals to the vicariate. Charles V was Holy Roman emperor and king of Spain at this time and his empire extended across Europe to the Netherlands, Austria and the Kingdom of Naples. Nardo Antonio owned three houses in and around Naples, one in the city itself, a villa in Due Porte in the hills northwest of the city, and a magnificent mansion at Vico Equense on the Gulf of Naples northeast of Sorrento. Although no definite proof exists, since Giambattista exercised rights in the church at Vico Equense which were only for those born in the town, it is almost certain that he was born in the family mansion there, the Villa delle Pradelle. He was the third of his parents' four sons, but one older brother died in childhood leaving Giambattista with an older brother Gian Vincenzo and a younger brother Gian Ferrante.\nGiambattista was well educated by private tutors but an important part of his education came about since his father was an intellectual whose home became a meeting place for philosophers, mathematicians, poets, and musicians. Usually this group of learned men met in Nardo Antonio's home in Naples but sometimes in hot weather they chose to meet in the Villa delle Pradelle in Vico Equense. Discussions on scientific topics frequently took place and all three of Nardo Antonio's sons took part. Given that Giambattista's father was keen on learning, it would be natural to assume that he supervised his sons' education but certainly in the case of Giambattista this appears not to be so for it was Adriano Guglielmo Spadafora, his mother's brother, who drew up the programme of topics. Returning to the private tutors, these were the leading experts from Naples, including Domenico Pizzimenti, a classicist, and Donato Antonio Altomare and Giovanni Antonio Pisano, who were philosophers and medical doctors. Mathematics and medicine were the topics most emphasised in his education and it is thought likely that he attended lectures given by the leading expert on these topics at the time,\nGirolamo Cardano\n.\nDella Porta is known today as a playwright, but we are particularly interested in his important contributions to science that we shall examine below. His plays are not easy to date but it is thought that began writing plays when young\n[\n4\n]\n:-\n... it is safe to suppose that he first tried his hand at playwriting in boyhood, and that some of his published comedies were revisions of scripts he originally produced for the amateur players among his family and friends, a conclusion supported by several of his contemporaries' later references to Della Porta's literary precocity.\nHe must have begun writing plays during lessons given by the classicist Pizzimenti. Around the same time, probably when aged about fifteen, della Porta was conducting science experiments with magnets and chemicals. Before going into any detail about his contributions we should put the science of the day into perspective. We do this by quoting from Shea\n[\n20\n]\n:-\n... science as he practised it is no longer science as we know it. After the first decade of the sixteenth century, when Della Porta was still active, science and especially the image of science evolved rapidly. Whereas in Della Porta's day, the astronomer was still an astrologer and the physicist a magician, by the end of the seventeenth century astrology had been severed from astronomy, and magic was either frowned upon or reinterpreted along recognizably rational lines. Della Porta dabbled in magic in the spirit of a Renaissance scholar, and the only scientific figure of the early seventeenth century that could feel any genuine sympathy for him was\nKepler\n, who combined in such a paradoxical fashion the old and the new outlooks on nature.\nIn\n1558\n, when della Porta was twenty-three years old, he published the four volume\nMagiae naturalis, sive de miraculis rerum naturalium\n. In this book he examined the natural world claiming it can be manipulated by the natural philosopher through theoretical and practical experiment. The work discussed many subjects including demonology, magnetism and the camera obscura. Although written in Latin, the work was later translated into French, Italian and German and so became a popular read widely book. Della Porta, for whom fame was important, was very proud of the fact that translations were made into different languages. Around\n1560\n, della Porta formed a society, the Accademia dei Segreti\n(\nthe Academy of Secrets\n)\n, dedicated to discussing and studying nature; regular meetings were held at his home, the Villa delle Pradelle in Vico Equense. To gain admittance to the Academy, a person had to show that they had discovered a fact about the world which was unknown to everyone else. We know something of the \"discoveries\" for della Porta reported some in a greatly expanded twenty-volume version of\nMagiae naturalis\npublished in\n1589\n. The Accademia dei Segreti was closed down by the Inquisition around\n1578\nafter they examined della Porta. There is, perhaps not surprisingly, conflicting information about his examination by the Inquisition. One report states that he impressed them with his learning and convinced them that everything he did was \"natural\". This looks like della Porta's own version for he was always prepared to bend the truth to make himself look good; he did over several other issues, such as his age. The more believable report says that he suffered great \"anguish of soul\" at having first to defend, and then recant his views, probably suffering a short period of imprisonment. Certainly he joined the Jesuit Order after his summons before the Inquisition and spent one day each week on charity work and religious duties. Despite these attempts to be religiously correct, he had to battle against the Inquisition throughout his life and some of his texts were never approved for publication.\nDuring the years that the Accademia dei Segreti was operating, Della Porta travelled widely in Italy, France and Spain always returning to his estate near Naples where he was able to study in peace. He explains in the preface to the\n1589\nedition of\nMagiae naturalis\nthat whenever he visited France or Spain he always met with leading academics, visited libraries, purchased as many books as he could afford, and was always looking to learn new \"secrets\" about the physical world. He never needed to earn a living as the wealth of the family seems to have been sufficient to allow him to devote himself to study. However, running the Academy with the considerable costs involved in the experiments, took a sizable part of the family's wealth and there are indications that some cost cutting became necessary. Also during these years he published\nDe furtivis literarum\n(1563)\n, a work on cryptography in which he collected a large number of different systems. This work, which he presented personally to king Philip II of Spain during a visit to Spain, added greatly to della Porta's already high prestige. In\n1566\nhe published\nArte del ricordare\n, a work in which he explained how to use mnemonic devices to improve memory. We learn from this work that della Porta's memory was more due to his ability to categorize and organize than a natural talent.\nAt some stage della Porta married but the name of his wife is unknown and it seems likely that she died young. They had a daughter, Cinzia, who married Alfonso di Costanzo. If della Porta's marriage produced any further children, they died before their father as Cinzia is his only child mentioned in his will.\nIn November\n1579\ndella Porta was invited to join the service of Luigi, cardinal d'Este. In need of a patron, he moved to Rome two months later and lived at the Palazzo d'Este. He carried out his scientific work financed by the cardinal but caused problems since he\n[\n4\n]\n:-\n... insisted on going to bed immediately after dinner, rose very early and noisily to study before breakfast, and demanded that total silence be maintained whenever he was working or sleeping.\nDella Porta reported to the cardinal on his experiments and also sent him two of his plays, a comedy and tragi-comedy; the first of these was staged. In fact he was one of a number of dramatists who worked for the Cardinal, like Torquato Tasso, the greatest Italian poet of the late Renaissance. After a period of illness\n(\ndella Porta frequently suffered fevers\n)\nhe joined the cardinal in Venice in December\n1580\n. There he worked on parabolic mirrors and lenses, finding that the Venetian expertise with glass was very helpful to him. He also spent time at the court of Duke Alfonso II d'Este at Ferrara but in April\n1581\nhe returned to Naples although continuing to work for the Cardinal. As with his Academy in earlier times, his home became the meeting place for the learned men in the area. Like many scientists at this time he occupied himself with attempts to turn base metal into gold and he believed he had found the secret\n[\n4\n]\n:-\nHis hopes were delayed by quarrels, domestic troubles, and a steady stream of visitors, Neapolitans and foreigners, who flocked to the informal academy in Della Porta's house, kept him from sleeping, drove him to desperation, and worst of all, prevented him from testing his new secret.\nOn hearing the news the cardinal ordered della Porta to come immediately to Rome to report to him but after carrying out further experiments, della Porta found that his method was unsuccessful. He did, however, visit the cardinal in Rome in October\n1586\n. It was the last time they met for the cardinal died in\n1587\n.\nDella Porta published\nPomarium\n(1583)\non growing fruit trees and\nOlivetum\n(1584)\nalso on taking care of trees. Both works formed part of\nVillae\n(1592)\n, an agricultural encyclopaedia. In\nDe humana physiognomonia\n(1583)\nhe turned his attention to animals and human beings, investigating how behaviour is associated to physical appearance. This topic was treated with considerable suspicion by the Roman Catholic Church which at this time was putting many works onto the Index of Forbidden Books. After a long wait of three years, the book was approved by the official censors. In the book he describes his own physical appearance but, as usual with della Porta, it is an idealised version at odds with the descriptions of others. He had a thin face with deep set bright eyes, a long irregularly shaped nose, and a distinctive high forehead.\nOther topics he wrote on include chemistry in\nDe distillatione\n(1609)\n, mechanics, and\nsquaring the circle\nin\nElementa curvilineorum\n(1601)\n. This work, described in detail by Hofmann in\n[\n13\n]\n, uses Euclidean methods to study the areas bounded by circular arcs and straight lines. The main achievement is the proof that the sum of the two lunes of any right-angled triangle is equal to the area of the triangle, but della Porta then incorrectly deduces that each lune separately can be squared. Among his other achievements is a description of a steam engine in\nDe' spiritali\n(1606)\nand being the first to recognise the heating effect of light rays.\nThe\nAccademia dei Lincei\nwas founded in Rome in\n1603\nby Federico Cesi, inspired by della Porta's\nMagiae naturalis\n. The Academy's emblem, the sharp-eyed lynx, was taken from the title page of della Porta's book. The Preface of\nMagiae naturalis\ncontains the words:-\n... with lynx like eyes, examining those things which manifest themselves, so that having observed them, he may zealously use them.\nDella Porta strongly encouraged Cesi in the setting up of his Academy and, in\n1610\n, Cesi came down to Naples to set up a branch of the\nAccademia dei Lincei\n. Della Porta became president of the branch on\n6\nJuly\n1610\n. During his final years, he suffered from ill health, particularly the fever that had regularly attacked him throughout his life, but also kidney stones which became progressively worse until he was bedridden.\nLet us now look a little more at the twenty-volume\n1584\nedition of\nMagiae naturalis\n. Volume\n17\ndeals with optics and the camera obscura is clearly described in Chapter\n6\n. He was the first to propose adding a convex lens to the camera obscura. In Chapter\n10\n, della Porta explains the use of concave and convex lenses. He writes:-\nConcave lenses will make one see most clearly things that are afar off; but convexes, things near at hand; so you may use them as your sight requires. With a concave you will see small things afar off very clearly; with convex, things nearer appear bigger, bit more obscurely; if you know how to fit them together, you will see things afar off, and things near at hand, both greater and clearly. I have much helped some of my friends, who saw things afar off weakly; and what was near, confusedly, that they might see all things clearly.\nAfter reading this passage, it is tempting to credit della Porta with inventing both telescopes and microscopes. However, the context of the passage is correcting defective vision so, although one still has to understand the importance of his optical work, one cannot give him the credit for telescopes and microscopes. We are left with trying to understand what he means by fitting together concave and convex lenses; perhaps that is the arrangement which today we think of as the fundamental property of\nGalileo\n's telescope, or perhaps della Porta is describing bifocal glasses. The situation is somewhat confused by an undated letter by della Porta, written after\nGalileo\ndescribed his telescope, in which he claims to have been the first to invent the telescope. Certainly he studied\nrefraction\nin\nDe refractione, optices parte\n(1593)\n, although he does not appear to have constructed a telescope before\nGalileo\n.\nVolume\n7\nof\nMagiae naturalis\ndeals with magnetism. In\n1600\nWilliam Gilbert published his famous\nDe magnete\n, a work which many claim to be the first modern work on experimental science. However, della Porta claimed that Gilbert:-\n... took the whole seventh book of my 'Magiae naturalis' and split it into many books, making some changes; ... the material which he adds on his own account is false, perverse and melancholy; and towards the end he arrives at the mad idea that the earth is in motion.\nWe commented above that della Porta was well-known as a dramatist. He wrote three tragedies, twenty-nine comedies, and one tragi-comedy; only fourteen comedies, two tragedies and the tragi-comedy have survived. His most famous two plays are\nLa sorella\n(\nThe Sister\n)\nand\nGli duoifratelli rivali\n(\nThe Two Rival Brothers\n)\n. The first of these is a\n[\n18\n]\n... comedy intended to improve public morals by rigorously avoiding the anarchy and hedonism that had characterized so much of the comic theatre in Italy prior to the Counter-Reformation.\nLouise Clubb writes about\nGli duoifratelli rivali\n(\nsee\n[\n11\n]\n)\n:-\nDella Porta seems to be testing the limits of 'commedia grave', stretching without breaking the rules of unity and decorum ... proceeding through deceits, disguises and bawdry to happy marriages, but also containing threats of death, dishonour, fratricide and governmental injustice, 'Fratelli rivali' remains commedia, but just barely.\nLet us end by quoting della Porta's own words from the Prologue of\nFratelli rivali\n:-\nThese works are judged rather by the universal applause of learned men of all nations; for they are seen printed in all parts of the world and translated into Latin, French, Spanish and various other languages; and the more they are heard and read, the more they please and are reprinted.",
  "matematicos_citados_na_biografia": [
    "Girolamo Cardano",
    "Kepler",
    "squaring the circle",
    "Accademia dei Lincei",
    "Galileo",
    "refraction"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}