{
  "nome_completo": "Gino Benedetto Loria",
  "nome_curto": "Gino Loria",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loria/",
  "data_nascimento": "19 May 1862",
  "local_nascimento": "Mantua, Austrian Empire (now Italy)",
  "data_morte": "30 January 1954",
  "local_morte": "Genoa, Italy",
  "summary": "Gino Loria was an Italian mathematician and historian of mathematics who worked on projective geometry, special curves, algebraic geometry and elliptic functions.",
  "biografia": "Gino Loria\n's father was\nSalomon Vita Loria, also called Gerolamo or Girolamo, and his mother was Anaide D'Italia. The family was Jewish and well-off financially. Gino had an older brother, Achille Loria, who was born in Mantua in March\n1857\n. Achille became a famous political economist, being professor of political economy in the University of Sienna\n(1881\n-\n1891)\n, the University of Padua\n(1891\n-\n1903)\nand the University of Torino\n(1903\n-\n1932)\n. He was elected to the Italian Senate in\n1919\n. Gino, like his elder brother, was educated at the lyceum in Padua, entering in\n1875\nand graduating in\n1879\n.\nFrom\n1879\nto\n1883\nhe was a student at the University of Turin and he published his first paper\nIntorno alla geometria su un complesso tetraedrale\nⓉ\n(\nOn the geometry of a tetrahedral complex\n)\nin\n1883\n. He was awarded his doctorate in July\n1883\nfor his dissertation on spherical geometry with the same title as his first publication. His thesis supervisor at Turin was\nEnrico D'Ovidio\n. He spent\n1883\n-\n84\nat the University of Pavia and during\n1884\n-\n86\nhe was an assistant to\nD'Ovidio\nin algebra and analytic geometry at the University of Turin. He published\nSur les différentes espèces de complexes du\n2\ne degré des droites qui coupent harmoniquement deux surfaces du second ordre\nⓉ\n(\nOn the various kinds of complexes of the\n2\nnd degree of lines that intersect harmonicly two surfaces of the second order\n)\nin\nMathematische Annalen\nin June\n1884\n, with\nCorrado Segre\nas his coauthor. During his time as\nD'Ovidio\n's assistant, Loria published a total of sixteen papers on\n[\n8\n]\n:-\n... the geometry of straight lines and spheres, hyperspatial projective geometry, entities generated by algebraic correspondences between fundamental forms, and\nCremona\ntransformations in space.\nLoria was appointed as a\nPrivatdocent\nat the University of Turin in July\n1886\n. Then, in November\n1886\nafter a competition, he was appointed as an extraordinary professor of higher geometry in the University of Genoa, where he was to spend the rest of his academic life. He was promoted to ordinary professor of higher geometry in November\n1891\n, and continued to hold this chair until he retired on\n1\nAugust\n1935\nat the age of\n73\n. He was also \"charge de cours\" of higher analysis\n1892\n-\n97\n, and \"charge de cours\" of descriptive geometry\n1897\n-\n1935\n. He served as dean of the faculty of sciences at Genoa from\n1903\nto\n1906\n. In\n1903\nhe married Ida Levi Gattinara and they made their home at\n41\nManin Square, Genoa. Following his retirement he was made professor emeritus in July\n1936\n.\nAlthough Loria continued to undertake research into geometry throughout his life, his main research activity was in the history of mathematics. His first contributions to this topic were\nSur une démonstration du théorème fondamental de la théorie des équation algébriques\nⓉ\n(\nOn a proof of the fundamental theorem of the theory of algebraic equations\n)\n(1887)\nand\nNotizie storiche sulla geometria numerativa\nⓉ\n(\nHistorical information on the geometry of numbers\n)\n(1888)\n. The authors of\n[\n1\n]\nexplain Loria's aim when writing works on the history of mathematics:-\nIn his day, Loria was arguably the pre-eminent historian of mathematics in Italy. A full professor of higher geometry at the University of Genoa beginning in\n1891\n, Loria wrote the history of mathematics as a mathematician writing for other mathematicians. He emphasised this approach repeatedly in his works. For instance, in the introduction to his 'Storia delle matematiche dall'alba della civilità al tramonto del secolo XIX'\nⓉ\n(\nHistory of Mathematics from the dawn of civilization to the end of the nineteenth century\n)\n, he stated that general history of mathematics was written \"by a mathematician for mathematicians\". In his 'Le scienze esatte nell'antica Grecia'\nⓉ\n(\nThe exact sciences in ancient Greece\n)\n(1914)\n, he explained that the book had been written \"by a mathematician for persons who, although with modest scientific background, are interested in mathematics\". Concerned only with exact sciences, Loria gelt himself compelled to justify his incursions into \"foreign fields\" like philosophy, geodesy, and astronomy, forced as he said by \"the indissoluble links\" among the various branches of his subject matter.\nHis first paper to create a real impact among historians was written around the time he was made a full professor at Genoa\n[\n1\n]\n:-\nLoria's main works are devoted to the history of geometry, his area of research and teaching as a mathematician. His first important historical work was an essay\n[\n'Nicola Fergola e la scuola di matematici che lo ebbe a duce'\nⓉ\n(\nNicola Fergola and a school of mathematics which he led\n)\n(1892)]\non Nicolò Fergola\n(1753\n-\n1824)\n, which marked the rediscovery of a virtually forgotten school of geometry that flourished in Naples during the early decades of the\n19\nth\ncentury. Loria himself first heard of the existence of\nFergola\n's school when he read\nChasles\n's 'Aperçu historique sur l'origine et le developpement des méthods en geométrie'\nⓉ\n(\nHistorical overview of the origin and development of methods in geometry\n)\n(1875)\nthat \"we owe several important works that re-establish ancient geometrical analysis in its original purity to the celebrated\nFergola\nand his students.\nLoria wrote a number of texts which became classics. For example:\nLe scienze esatte nell'antica grecia\nⓉ\n(\nThe exact sciences in ancient Greece\n)\n(1893\n,\n2\nnd\nedition\n1914)\n;\nSpezielle Algebraische und Transcendente Ebene Kurven. Theorie und Geschichte\nⓉ\n(\nSpecial Algebraic and transcendent level curves: theory and history\n)\n(1902\n,\n2\nnd\nedition\n1910\n, Italian edition\n1930\n-\n31)\n;\nVorlesungen über darstellende Geometrie\nⓉ\n(\nLectures on descriptive geometry\n)\n(2\nvolumes\n)\n(1907\n,\n1913)\n;\nMetodi di Geometria Descrittiva\nⓉ\n(\nMethods of descriptive geometry\n)\n(1909\n,\n2\nnd\nedition\n1919\n, third edition\n1925)\n;\nStoria della geometria descrittiva dalle origini sino ai giorni nostri\nⓉ\n(\nHistory of descriptive geometry from its origins to the present day\n)\n(1921)\n;\nCurve sghembe speciali algebriche e trascendenti; Teoria e Storia\nⓉ\n(\nSpecial algebraic and transcendental skew curves; Theory and History\n)\n(2\nvolumes\n)\n(1925)\n;\nHistoire des Mathématiques dans l'Antiquité Hellènique\nⓉ\n(\nHistory of mathematics in ancient Greece\n)\n(3\nvolumes\n)\n(1929\n,\n1931\n,\n1933)\n; and\nStoria delle matematiche\nⓉ\n(\nHistory of Mathematics\n)\n(1929)\n. Reviewing the first volume of\nStoria delle matematiche\nⓉ\n(\nHistory of Mathematics\n)\n, McClenon writes\n[\n5\n]\n:-\nThis book is one that in an English translation would be very useful and welcome to teachers of mathematics, both in universities and in secondary schools. Its value to mathematicians will depend largely on their personal interest in the history and development of the subject; and the second volume, which will begin with the\n16\nth\ncentury, will doubtless offer considerably more of interest to them. The present volume is in any case not just \"another history of mathematics,\" for it is written in an original, individual, and vivid style which, combined with its general accuracy in matters of fact, assures it a place of its own in the literature of the subject.\nAnother important contribution by Loria was the founding of\nBollettino di bibliografia e storia delle scienze matematiche\nⓉ\n(\nBulletin of literature and history of the mathematical sciences\n)\nin\n1898\n. This journal for the history of mathematics was associated with the\nGiornale di Matematiche\nbut published independently of it until\n1922\n, after which it was issued as a section with separate page numbers in\nIl Bollettino di Matematica\n[\n1\n]\n:-\nFollowing Boncompagni's example, Loria founded the 'Bollettino di bibliografia e storia delle scienze matematiche' in\n1898\n. Loria, however, adapted editorial policies different from those of Boncompagni. In Loria's view, subsequent historians \"slightly modified\n(\nBoncompagni's\n)\nprinciples\". On the one hand they tried to pay attention to influential mathematicians; on the other hand, they presented quotations in a clear and exact form, though reduced to their essentials in order to save space and spare the time of scholars by not \"inflicting them with such boredom that drives readers away.\" Loria's 'Bollettino' thus sought to avoid the overly rigorous, erudite style of Boncompagni. It included generally short though well-documented papers, and gave ample space to reviews.\nWe should also comment on Loria's contributions to the teaching of mathematics since these are highly significant. In\n1893\nhe published\nDella varia fortuna d'Euclide in relazione con i problemi dell'insegnamento geometrico elementare\nⓉ\n(\nThe varying fortunes of Euclid in connection with teaching elementary geometrical problems\n)\nin which he established:-\n... a target which the modern teaching of elementary geometry should reasonably aim at.\nGeometry had to be taught in a rigorous but interesting way:-\n... enemies as we are of any concession made at the sacrifice of geometric rigour, we are favourable on the other hand to any legitimate means of enlivening and keeping awake the interest of young people in geometry. Interest which, as a rule, belongs to a few select people.\nGeometry, he argued, was not a 'dead language', but a 'living language'. In the paper\nLa storia della matematica come anello di congiunzione fra l'insegnamento secondario e l'insegnamento universitario\nⓉ\n(\nThe history of mathematics as a link between secondary and tertiary education,\n)\n, which he published in\n1899\n, Loria argued that teachers of mathematics should attend lectures on the history of mathematics before they began to teach in classrooms. Soon Loria was playing a large role in attempting to improve school teaching in mathematics. He gave the main plenary lecture at the Mathesis Congress in Padua in September\n1909\n, choosing as his title\nLa scuola media e la sua attuale crisi di sviluppo\nⓉ\n(\nThe school and its current development crisis\n)\n. The International Commission on Mathematical Instruction, meeting in Paris in\n1914\n, asked him to compile a report\nRapporto generale sulla preparazione teorica e pratica dei professori di matematica dell'insegnamento secondario\nⓉ\n(\nGeneral report on the theoretical and practical preparation of secondary school mathematics teachers\n)\nto be delivered at the planned international conference in Munich in\n1915\n. As part of his preparation he visited Göttingen where he had discussions with\nFelix Klein\nbut, following the outbreak of World War I in\n1914\n, the\n1915\nconference failed to take place and Loria's report was put on hold. In\n1928\nthe International Commission on Mathematical Instruction meeting in Bologna asked Loria to prepare a report for the International Congress of Mathematicians to take place in Zürich in\n1932\n. The Congress was held from\n5\nto\n12\nSeptember\n1932\nand he delivered his report\nLa préparation théorique et pratique des professeurs de mathématiques de L'Enseignement secondaire dans les divers pays\nⓉ\n(\nThe theoretical and practical preparation of mathematics teachers of secondary education in the various countries\n)\nwhich was published in full in\n1933\nin\nL'Enseignement Mathématique\n. In recognition of his efforts, the Commission conferred the title of Honorary Member on Loria on\n15\nJuly\n1936\n.\nLoria retired from the Chair of Higher Geometry at the University of Genoa in\n1935\n. He remained very active with four historical papers appearing in\n1936\n, six in\n1937\nand five in\n1938\n. However, World War II proved an extremely difficult time for Loria. Even before Italy joined the war, the Italian government imposed anti-Semitic laws in\n1938\n. Jews were labelled unpatriotic and prevented from holding government positions or teaching posts. Loria, in common with all Italian Jews, had to register with the authorities. In\n1939\na law was passed requiring all books by Jewish authors to be removed from shops. All this was hard to bear, but much worse was to come. The Allies invaded Sicily in July\n1943\nand German troops took over control of Italy which surrendered in September\n1943\n. Jews were faced with extermination, but the Waldenses saved Loria and his brother. This was a religious movement which had begun in the Middle Ages and had eventually became a Reformed branch of the Protestant Church. The centre of the Waldenses church was the mountain valley of Torre Pellice about\n45\nkm southwest of Turin. The Waldenses saved many Jews from extermination by the Nazis, hiding them in the valley of Torre Pellice; it was there that Loria and his brother were given a safe refuse. However, sadly, Loria's brother Achille died at Luserna San Giovanni\n(\nTorre Pellice\n)\non\n6\nNovember\n1943\n. Loria returned to Genoa in\n1945\n. He wrote no further works on geometry, but did continue to publish historical works up to his final contribution published in\n1953\nLa matematica nel suo millenario sviluppo, ha seguito una direzione costante?\nⓉ\n(\nHas mathematics in its thousand-year development followed a constant direction?\n)\n.\nFor his outstanding mathematical achievements, Loria received many honours and awards. He was elected to: the\nAccademia dei Lincei\n; the Accademia Virgiliana di Scienze, Lettere ed Arti, Mantua; the Accademia di Scienze, Lettere ed Arti, Modena; the Accademia Pontaniana, Naples; the Accademia dei Scienze, Turin; the Societa Italiana per il Progresso di Scienze, Rome; and the Societa di Scienze e Lettere, Genoa. In\n1926\nhe was awarded the Silver Medal of the Association Francaise pour l'Avancement des Sciences. He was also elected to the Deutsche Akademie der Wissenschaften, Halle; to the Czechoslovakian Society for Mathematics and Physics, Prague; to the Königliche Abhandlungen Gesellschaft der Wissenschaften, Prague; to the Masarik Academy of Work, Prague; to the\nMathematical Association\n, London; to the Amsterdam Mathematical Society; to the\nKharkov Mathematical Society\n; and to the Berlin Mathematical Society. In\n1907\nhe received Binoux prize from the French Institute, then in\n1922\nhe was awarded a second Binoux prize for\nStoria della geometria descrittiva dalle origini sino ai giorni nostri\n(\nHistory of Descriptive Geometry from Origins up to our Times\n)\n. He explained how he came to write this work\n(\nsee for example\n[\n2\n]\n)\n:-\nIt is my conviction that whoever aspires to bring any contribution to our scientific knowledge cannot avoid taking notice of what his predecessors have done; this is especially true of a teacher since his course should be a true mirror of the science of his time. With this concept in mind I forced myself to gain an exact knowledge of the vast scientific literature relating to descriptive geometry, without neglecting in the least the precursors of\nMonge\n. The notes thus collected were of great use to me in my university courses; but, up to a certain point, I lost no time in noticing that, as a whole, they constituted the skeleton of a complete history of this material which was lacking, but only on this side of the Alps. Therefore, since in\n1918\nwas approaching the first centenary of the death of\nMonge\n, I decided to celebrate it by publishing a historical work of this sort. The events of the recent war did not permit me to complete this task which I had undertaken. But the delay was short. And the French Institute in conferring the Binoux Prize\n[1922]\nfor my 'History of Descriptive Geometry from Origins up to our Times' has accorded to my labours the most coveted and most significant reward to which I could aspire.\nIn addition to the historical work we have mentioned above, Loria also wrote around fifty biographies of mathematicians, many of which we have used in writing our biographies and are referenced in this archive. He explained why he was so interested in writing biographies\n(\nsee for example\n[\n2\n]\n)\n:-\nEver since I was in my teens the reading of the biographies of the most eminent thinkers exercised on me an irresistible fascination; more even than the fantastic adventures conceived in the whimsy of the old-time writers of romances, I was especially interested in knowing the circumstances through which 'man makes himself eternal.' Was it perhaps to draw from them a norm for the government of my own life? I do not know. I was then ignorant of the maxim, formed by Cicero in the most high sounding togaed Latin, according to which 'history is the master of life,' just as I was ignorant of the disrespectful ironic reply of Hegel, according to which instead 'history teaches only that men have never learned anything about it.' But I felt, however dimly, that, although, just as there do not exist two individuals perfectly equal physically or morally, so there never unfold two existences identical in everything, still the spectacle offered by the evidence of the life of one person might suggest, by way of generalization, some directives of universal character by which I might launch my own career in the world.\nFinally, we note that Pepe, in\n[\n6\n]\n, describes Loria as:-\n... the most notable historian of Italian mathematics.",
  "matematicos_citados_na_biografia": [
    "Enrico D'Ovidio",
    "D'Ovidio",
    "Corrado Segre",
    "Cremona",
    "Privatdocent",
    "Fergola",
    "Chasles",
    "Felix Klein",
    "Accademia dei Lincei",
    "Mathematical Association",
    "Kharkov Mathematical Society",
    "Monge"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}