{
  "nome_completo": "Giovanni Alfonso Borelli",
  "nome_curto": "Giovanni Alfonso Borelli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borelli/",
  "data_nascimento": "28 January 1608",
  "local_nascimento": "Naples, Kingdom of Naples (now Italy)",
  "data_morte": "31 December 1679",
  "local_morte": "Rome, Papal States (now Italy)",
  "summary": "Giovanni Alfonso Borelli was an Italian Italian physiologist and physicist who was the first to explain muscular movement and other body functions according to the laws of statics and dynamics.",
  "biografia": "Giovanni Alfonso Borelli\n's father was Miguel Alonso and his mother was Laura Porrello. The first obvious question must be to ask about the name Borelli. It is a somewhat complicated story, but the subject of this biography was baptised Giovanni Francesco Antonio Alonso. His father, Miguel Alonso, was a Spanish soldier stationed in Naples as part of the Spanish garrison. The city had been captured by the Spanish in\n1503\nand remained under Spanish control for over\n200\nyears. The Spanish soldiers were stationed in the three forts of Naples, the Castel Sant'Elmo, the Castel dell'Ovo, and the Castel Nuovo where Miguel Alonso was when Giovanni was born. His mother, Laura Porrello, was a local girl and Giovanni was the eldest of his parents' six children; five boys, Giovanni, Domenico Onofrio, Salvatore, Filippo, Diego and one girl, Caterina. We will see below why, later in his life, Giovanni wanted to change his name. Let us just point out at this stage that he dropped his father's name Alonso as well as his given names of Francesco and Antonio. He adopted Alfonso, as the Italian version of his father's name Alonso, and the surname Borelli which was a version of his mother's surname Porrello. His brother Filippo\n(\nborn\n9\nMarch\n1614)\nalso changed his name to Borelli. Giovanni's other brothers and sister did not reach adulthood.\nIn\n1614\nMiguel Alonso was moved from the Castel Nuovo to the Castel Sant'Elmo. There he came in contact with Tommaso Campanella\n(1568\n-\n1639)\n, a philosopher and astrologer who had been declared a heretic by the Inquisition and accused of plotting against Spanish rule. Campanella was imprisoned in the Castel Sant'Elmo and this somehow led to Alonso being arrested. After a secret trial he was found guilty and exiled; he went to Rome. However, he appealed against his sentence and was pardoned, returning to the Castel Sant'Elmo in Naples in April\n1617\n. He remained there until his death in\n1624\nbut Borelli's mother Laura continued to live at the Castel Sant'Elmo, probably undertaking some type of work for the troops there, until her death in\n1640\n. We do not have any details of Borelli's life after his father returned to Naples in\n1617\n. We do know that he became acquainted with Campanella during the following years. In fact, although Campanella remained a prisoner, his life became easier after he was transferred to the Castel Nuovo in May\n1618\nand he was free to see friends and even to teach students. It is likely that Borelli was one of these students. It is also likely, but not certain, that Borelli attended medical lectures at the University of Naples. No record of his attendance exists, but being a student of Campanella and also attending the university would explain Borelli's educational standards when he went to Rome in around\n1628\n- he was about\n20\nyears of age. We mentioned at the beginning of this article that Borelli changed his name. In fact he did more than that for he also made efforts to hide his place and date of birth. This must have been a wish to avoid being linked to his father, with a criminal record, and also probably with the imprisoned Campanella. He also objected to the Spanish rule in Italy, so hiding his Spanish origins might have been necessary to keep in favour with his like-minded friends.\nCampanella had been sent to Rome, still as a prisoner, in\n1626\nbut had been given his freedom in\n1628\n. It must have been around this time that Borelli arrived in Rome and was introduced by Campanella to\nBenedetto Antonio Castelli\nwho had come to Rome after being professor of mathematics at Pisa.\nCastelli\nbegan teaching at La Sapienza, the university of Rome, giving courses on\nEuclid\n's\nElements\nand\nApollonius\n's\nConics\n. There is no direct evidence that\nCastelli\nattended these courses, but it must be very probable since we know that he was a pupil of\nCastelli\nand also that he became an expert on\nEuclid\nand\nApollonius\n. Borelli also got to know another of\nCastelli\n's students,\nEvangelista Torricelli\n, who at this time was acting as a secretary to\nCastelli\n. Both\nTorricelli\nand\nCastelli\nwere supporters of\nGalileo\nso\n1632\n-\n33\nmust have been a difficult time for Borelli seeing the Inquisition banning\nGalileo\n's works and putting him on trial. Campanella enjoyed five years of freedom in Rome after\n1628\nbefore he was again accused of plotting against the Spanish occupiers. He fled to Paris in\n1634\naccompanied by Filippo Borelli, the brother of the subject of this biography. Giovanni Alfonso Borelli remained in Rome gaining a reputation as an exceptionally good mathematician.\nBorelli was appointed as a lecturer in mathematics at the University of Messina in Sicily after being recommended by\nCastelli\n. He went to Messina in\n1635\nto give a lecture which demonstrated his mathematical abilities to the Senate of Messina. Borelli was appointed before\n1637\n, the year in which he climbed Mount Etna, but his name only appears in the university records from\n1639\nwhen he was promoted to the chair of mathematics. Certainly Borelli quickly gained a reputation as a leading scholar, although at this stage he still had no publications, and he became a member of the Accademia della Fucina, an academy founded in\n1639\nin Messina. This academy, which had both scientific and literary interests, had been founded by young intellectuals who were unhappy with Spanish rule. The most famous Sicilian mathematician had been\nFrancesco Maurolico\nwho had died more than\n30\nyears before Borelli was born.\nMaurolico\nhad worked on a restoration of books V and VI of\nApollonius\n's\nConics\nbut had died in\n1575\nbefore he was able to publish the work. Borelli became interested in these unpublished manuscripts left by\nMaurolico\nand began to edit them with the intention of having them published. In fact it was many years before this happened, with the work appearing in\n1654\n.\nIn\n1640\nDino Peri\n(\nborn\n1604)\n, the professor of mathematics at Pisa since\n1636\n, died.\nGalileo\n,\nCavalieri\nand others would have liked\nCastelli\nto succeed Peri but he was forced to remain in Rome.\nCastelli\nproposed that Borelli be appointed to the chair in Pisa but the position went to Vincenzo Renieri\n(1606\n-\n1647)\n, a friend and supporter of\nGalileo\n. However, the Senate of Messina was delighted to have such an outstanding scholar as Borelli at their university and in late\n1641\nthey sent him on a long trip with the aim of recruiting top class academics for the University of Messina, particularly in law and medicine. The Senate probably had another aim, which was to advertise widely that they were in business for making economic and political agreements. Borelli visited Naples and Rome, where he renewed his acquaintance with his former teacher\nCastelli\n. He then went on to Tuscany in the hope of seeing\nGalileo\nbut learnt that he had died in January\n1642\n. Borelli visited Florence where he met\nVincenzo Viviani\nwho had been with\nGalileo\nup to the time of his death. He also met Prince Leopold, the youngest brother of Ferdinando II de' Medici, the Grand Duke of Tuscany. Prince Leopold, who was particularly interested in science and technology, had been taught by\nEvangelista Torricelli\nand was a supporter of\nGalileo\n. Leaving Florence, Borelli went on to Bologna where he had useful discussions with the professor of mathematics,\nBonaventura Cavalieri\n. After a visit to Padua, his final destination was Venice, where he spent two months before taking a boat back to Messina. It was while he was in Tuscany that he conceived the idea of writing\nEuclides restitutus\nⓉ\n(\nEuclid restored\n)\n, although this was not published until\n1658\n.\nThe trip enhanced Borelli's reputation for he had shown great learning in his discussions with the leading academics and princes. Back in Messina he became involved in a dispute between two Sicilian mathematicians. Antonio Santini\n(1577\n-\n1662)\nhad proposed the following problem: construct a triangle given its base, the ratio of its sides, and the bisector of its top. Daniele Spinola and Pietro Emmanuele both gave solutions to the problem and Borelli was asked to judge. Although Borelli was critical of both solutions, he preferred that of Spinola and this led to an argument which became very heated. Borelli published\nDiscorso del Signor Gio: Alfonso Borelli, accademico della Fucina e professore delle scienze matematiche nello Studio della nobile città di Messina, nel quale si manifestano le falsità, e gli errori, contenuti nella difesa del Problema Geometrico, risoluto dal R D Pietro Emmanuele\nⓉ\n(\nDiscourse of Giovanni Alfonso Borelli, academician of Fucina and professor of mathematical sciences in the study of the noble city of Messina, which shows errors and mistakes contained in solution of a geometric problem by Pietro Emmanuele\n)\n(1646)\n. See\n[\n21\n]\nwhere, as well as the mathematics, Pietro Nastasi examines how politics influenced the polemic. Borelli's next paper was written following an epidemic of a malignant fever which depopulated much of Sicily in\n1647\n-\n48\n. The paper\nDelle cagioni delle febbri maligne di Sicilia negli anni\n1647\ne\n1648\nⓉ\n(\nOn the causes of malignant fevers in Sicily in the years\n1647\nand\n1648\n)\n(1649)\ndescribed the progress of the epidemic, its symptoms and the best ways to treat it\n[\n5\n]\n:-\n... in his investigations regarding the cause and the spread of the disease, Borelli travelled to several other Sicilian cities and accumulated quite a few notes from autopsies. As a result of this accumulation of data, authors such as Gustavo Barbensi consider Borelli as 'the person who introduced the experimental method in the study of living matter, in particular physiology'.\nBonaventura Cavalieri\ndied in Bologna at the end of November\n1647\nand\n[\n1\n]\n:-\n... the authorities there wished to fill the post with someone equally able. Accordingly they made inquiries concerning Borelli and received strong endorsements for him as the best mathematician in Italy after Cavalieri. They also learned that Borelli was a trifle capricious and had a leaning toward the \"moderns,\"\nCopernicus\nand\nGalileo\n. Whether or not this latter was a factor, Borelli was passed over and the chair went to\nGiovanni Domenico Cassini\n.\nBorelli remained in Messina, and he was still there in\n1654\nwhen, after many years, he saw\nMaurolico\n's\nEmendatio et restitutio conicorum Apollonii Pergaei\nⓉ\n(\nCorrection and restoration of 'Conics' by Apollonius of Perga\n)\nthrough the publication process. Borelli had long wanted to leave Sicily and, after the failed attempts we described above, he was eventually successful in February\n1656\nwhen he was appointed to the chair of mathematics at the University of Pisa. However, at first he struggled to fit into this role\n[\n1\n]\n:-\nHe was by no means the usual sort of professor. Nor did he bother to cultivate the finer graces of that calling. His first lectures at Pisa, for instance, were something of a disaster. He lacked any particular eloquence and was long-winded and dull. The students reacted with catcalls and agitation, once forcing him to stop before finishing his lesson. Very quickly, however, he demonstrated his capabilities, and his lack of Tuscan oratorical polish probably became less of a barrier.\nHe had probably almost completed writing\nEuclides restitutus\nⓉ\n(\nEuclid restored\n)\nin Messina, and now that he was in Pisa he completed it and published the work in Pisa in\n1658\n. This was an attempt by Borelli to present the material in\nEuclid\n's\nElements\nin a clearer manner. He also took the opportunity to examine the parallel postulate of\nEuclid\n[\n15\n]\n:-\nThis most learned author\n[\nBorelli\n]\nblames\nEuclid\n, because he defines parallel straight lines to be those, which lying in the same plane do not meet on either side, even if produced into the infinite. He offers as ground for his accusation, that such relation is unknown: first, he says, because we are ignorant whether such infinite non-concurrent lines can be found in nature; then also because we cannot perceive the properties of the infinite, and hence a relation of this sort is not clearly cognized. But with reverence for so great a man it may be said: can\nEuclid\nbe blamed, because he defines a square to be a figure quadrilateral, equilateral, rectangular; when it may be doubted, whether a figure of this sort has place in nature?\nAnother project came Borelli's way soon after he arrived in Pisa. He was shown by Ferdinando II de' Medici, the Grand Duke of Tuscany, and his brother Prince Leopold\n(\nwhom Borelli had met on his\n1642\ntrip to Tuscany\n)\nan Arabic manuscript, kept in the Laurenziana Library in Florence, which contained a text by\nApollonius\n. Borelli could not read Arabic, but his work with the\nMaurolico\nrestoration allowed him, from the figures in the text, to realise that the manuscript contained an Arabic translation of books\n5\n,\n6\nand\n7\nof the\nApollonius\n's\nConics\nwhich up to that time had been lost. In the summer of\n1658\nthe Medici brothers Ferdinando and Leopold encouraged Borelli to go to Rome to discuss the manuscript with the linguist Abraham Ecchellensis\n(1605\n-\n1664)\n. Their collaboration led to the publication\nApollonius Pergaeus Conicorum libri v. vi. vii. paraphraste Abalphato Asphahanensi nunc Primum editi. Additus in calce Archimedis assumptorum liber, ex codicibus Arabicis mss. Abrahamus Eccellensi Latinos reddidit; J A Borellus curam in geometricis versioni contulit et notas in universum opus adiecit\nⓉ\n(\nApollonius of Perga's  'Conics' books V, VII, VIII whose first edition was translated by\n(\nthe Arabic mathematician\n)\nAl-Isfahaní. In addition work of Archimedes appears at the end of the book, Translated into Latin from the copies of Arabic MSS. Abraham Ecchellensis assisted with the Latin and J A Borelli dealt with the geometry\n)\n(\nFlorence,\n1661)\n.\nA comet appeared towards the end of\n1664\nand Borelli made continuous observations of it. His small publication about the comet\nDel movimento della cometa apparsa il mese di Dicembre\n1664\nⓉ\n(\nOn the motion of the comet which appeared in the month of December\n1664\n)\n, written in the form of a letter to\nStefano degli Angeli\n, he argued that his parallax measurements showed that the comet changed its distance from the earth. He also showed convincingly that the comet was further from the earth than the moon - contradicting\nPtolemy\n's beliefs which were still the Church's accepted system at the time. In a letter about the comet to Prince Leopold, he argued that his measurements indicated that it followed a parabolic orbit.\nMotivated by his interest in the comet, Borelli established an observatory in the fortress of San Miniato in the summer of\n1665\n. His next contribution was the important\nTheoricae mediceorum planetarum ex causis physicis deductae\nⓉ\n(\nlaunched Theoricae mediceorum of the planets from the causes of physical\n)\n(1666)\nwhich he dedicated to his patron Ferdinando II de' Medici, the Grand Duke of Tuscany. In this work Borelli attempted to do far more than just describe the four moons of Jupiter; he wanted to understand the physical causes for their motions\n[\n19\n]\n:-\nIn a display of modesty, Borelli leaves to the grand duke the final judgement as to whether he has succeeded in his task of providing physical causes, claiming in his defence that the truth is so well hidden that, according to\nPlato\n, it is known only to the gods, whereas we are allowed to see only its shadows.\nThis work is remarkable in that Borelli suggests that the moons move around Jupiter in elliptical orbits and that they have a tendency to move towards Jupiter in exactly the same way that heavy objects on earth have a tendency to move towards the earth\n[\n19\n]\n:-\nBorelli believed that the circular motion of an orbiting body, whether planet or satellite, generates a tendency in the body to recede from the centre. The combination of circular motion and a radial motion due to the imbalance between this outward tendency and the tendency towards the centre generates elliptical trajectories. Besides providing a mathematical account of such curves based on the 'Conics' by\nApollonius\n, Borelli was able to explain some of the actions at play on the basis of ingenious physical, magnetic and mechanical reflections and experiments.\nThe breakthrough that Borelli made here was to take\nGalileo\n's terrestrial mechanics and extend their principles to astronomy; despite his major contributions to both mechanics and astronomy,\nGalileo\nhad never thought to combine the two. We know that\nNewton\nowned a copy of this work by Borelli and he made several references to it. Of course, although Borelli must have helped\nNewton\nin moving towards his theory of gravitation, on the other hand the publication of\nNewton\n's\nPrincipia\ntwenty years later completely overshadowed Borelli's masterpiece.\nIn this text Borelli says that it will surprise some that he has published an astronomy text when it is well known that for years he has been working on anatomy, particularly studying the motion of animals. He had been interested in anatomy since he had conducted experiments in Messina relating to the epidemic there. After he arrived in Pisa he met Marcello Malpighi\n(1628\n-\n1694)\nwho was appointed to Bologna in\n1656\n. The two were founder members of the Accademia del Cimento in\n1657\n, which was an academy whose members were much involved in experimental work. Influenced by Malpighi, Borelli began making biomechanical experiments. He worked\n[\n5\n]\n:-\n... on the macro and micro mechanical movements of the muscles in animals. He intended to show that the muscles move just as pulleys and levers do, and that the microstructures inside the body cause the contraction of muscles, including the heart..\nAlthough he worked on his treatise on anatomy,\nDe motu animalium\nⓉ\n(\nMovement of animals\n)\n, for many years, he had not completed it when he decided, in\n1667\n, to return to Messina. The Accademia del Cimento, although never formally closed down, ceased to operate when Borelli left Pisa. Others involved in the Academy left around the same time and it is hard now to determine who was influenced by who. On his way to Messina he spent time in Rome and in Naples where he demonstrated many of the experiments he had carried out in the Accademia del Cimento. He filled his old chair of mathematics in Messina from\n1668\nand, in the following year, made detailed observations of an eruption of Mount Etna. Borelli had always opposed Spanish rule of Sicily and, back in Messina, he became involved in politics. In\n1672\nthe Spanish rulers decided to move against those they knew to be working against them and they sought to arrest Borelli. He quickly left Sicily, going to Rome. There he was supported by the exiled Queen Christina and joined a number of academies of which she was a patron. By\n1676\nhe was complaining that his enemies were making his life difficult and he could not get the peace to complete his works. Things went from bad to worse - he was robbed of all his belongings by a servant and, with no means of support, had to accept an offer of accommodation from priests at the Casa di San Pantaleo. Never one to do nothing, Borelli still made use of his mathematical talents by teaching mathematics at the Scuole Pie di San Pantaleo. He now had no funds to allow him to have his\nDe motu animalium\npublished but, towards the end of\n1679\n, Queen Christina agreed to fund its publication. Borelli dedicated to work to her, but he died of pneumonia before the work was through the press. However, the priest who had offered him accommodation at the Casa di San Pantaleo, undertook to complete the proof-reading. Volume\n1\nappeared in\n1680\n, with the second volume appearing towards the end of the following year. Many consider this to be Borelli's most important work\n[\n5\n]\n:-\nBorelli began this text by dismissing the Aristotelian notion that animal spirits flow to the nerve ends and cause the movement of body parts. Instead he proposed that the muscles constitute the machine, or the motor, of the body's  movements. He classified the mechanics of the muscles according to the different geometrical shapes of the fibres that contract and expand. This allowed Borelli to calculate the movements of the fibres on the basis of Euclidean proportion theory.\nEuclid\n's second book on geometrical algebra was particularly relevant for Borelli in this study, since, for example, he could articulate geometrically his argument about how tendons and fibres contract according to their shapes.\nIn\n1984\nthe American Society of Biomechanics named its the most prestigious honour the 'Giovanni Borelli Award'. It is awarded for :-\n... originality, quality and depth of the research and the relevance of this work to the field of biomechanics.",
  "matematicos_citados_na_biografia": [
    "Benedetto Antonio Castelli",
    "Castelli",
    "Euclid",
    "Apollonius",
    "Evangelista Torricelli",
    "Torricelli",
    "Galileo",
    "Francesco Maurolico",
    "Maurolico",
    "Cavalieri",
    "Vincenzo Viviani",
    "Bonaventura Cavalieri",
    "Copernicus",
    "Giovanni Domenico Cassini",
    "Stefano degli Angeli",
    "Ptolemy",
    "Plato",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}