{
  "nome_completo": "Giovanni Battista Benedetti",
  "nome_curto": "Giovanni Benedetti",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Benedetti/",
  "data_nascimento": "14 August 1530",
  "local_nascimento": "Venice, Venetian States (now Italy)",
  "data_morte": "20 January 1590",
  "local_morte": "Turin, Duchy of Savoy (now Italy)",
  "summary": "Giovanni Benedetti was an Italian mathematician who anticipated some of Galileo's work on free fall.",
  "biografia": "Giovanni Benedetti\nwas born into a rich family of high status in Venice and spent his childhood and boyhood in that city. His father was described by Luca Guarico\n(\nwriting in\n1552)\nas\n[\n1\n]\n:-\n... a Spaniard, philosopher, and physicus, probably in the sense of \"student of nature\" but possibly meaning \"doctor of medicine\".\nGiovanni was taught philosophy, music and mathematics by his father. From the age of seven onwards he seems to have had no formal education and certainly did not attend a university. Benedetti studied the first four books of\nEuclid\n's\nElements\nunder Niccolo Fontana, better known as\nTartaglia\n, probably about\n1546\n-\n1548\n, although later they seem to have fallen out with each other. We deduce this from the fact that\nTartaglia\ndoes not mention in his writings that he taught Benedetti, while Benedetti only mentions that he was taught by\nTartaglia\nto \"give him his due\":-\nN Tartaglia\ntaught me only the first four books of\nEuclid\n, all the rest I learned by myself with great care and study. Nothing is difficult to him who would be learned.\nCertainly during the period that Benedetti was\nTartaglia\n's pupil,\nTartaglia\nwas involved the public challenge with\nFerrari\nin which he lost his reputation. This must have had a significant effect on his pupil and, as a consequence, it is not surprising that in Benedetti's later work he is highly critical of\nTartaglia\n's writings. When he was only twenty-two years of age Benedetti wrote\nResolutio omnium Euclidis problematum\naliorumque ad hoc necessario inventorum una tantummodo circini data apertura\nwhich was published in Venice in\n1553\n. In this work he discussed the general solution of all problems in\nEuclid\n's\nElements\n, and other geometric problems, using only a compass of fixed opening. It must be significant that the question of proving some of\nEuclid\n's theorems with only a compass of fixed opening had been posed by\nTartaglia\nas challenges to\nCardan\nand\nFerrari\nso it is likely that this provided the motivation for Benedetti's study. Benedetti considers the problem:-\nUsing a pair of compasses with a fixed opening, construct the triangle three sides of which are given such that the sum of two of them is greater than the third.\nHaving solved this, he uses it to find the points of intersection of two circles of given centres and radii. He then proudly proclaims:-\nAnd I made this construction despite many clever ancient and modern mathematicians who said that this problem was impossible to solve ... I found it on October\n15\nth\n1552\n.\nBoth\nFerrari\nand\nTartaglia\nproduced results on using only a compass of fixed opening but neither produced anything as systematic or of the quality that Benedetti did. In fact\nTartaglia\n's last work was\nTrattato generale di numeri e misure\n(1560)\non precisely that topic - it is not of the quality of Benedetti's work and, interestingly, does not even mention Benedetti or the\nResolutio\n. There is, however, something else in the\nResolutio\nwhich is very important but not related in any way to the main subject of the work. This is a dedication in the form of a letter addressed to Gabriel de Guzman, a Spanish Dominican priest with whom he had held discussions in Venice in\n1552\non Benedetti's theory of the free fall of bodies. Guzman had suggested that Benedetti publish a mathematical treatment of the speeds of free fall and this letter was his answer to Guzman. Why, one might ask, did he choose to publish this unrelated letter as the dedication in the\nResolutio\n. The answer is that Benedetti feared that his ideas would be stolen if he did not get them into print quickly, so he chose this route. We should note that his fears were fully justified for, as we recount below, despite these attempts his theory was stolen.\nWhat were these ideas of Benedetti on free fall? Well he stated that bodies composed of the same material fell at the same speed regardless of their weight. He justified his claims with an argument using\nArchimedes\n' results on bodies in a fluid. Of course at this time\nAristotle\n's views were accepted without question and what Benedetti was putting forward was in complete contradiction to\nAristotle\n. As one might expect those who read Benedetti's work did not accept his ideas. Some argued that they was stupid, other agreed with his findings but said that they must be in agreement with\nAristotle\n. Benedetti himself remarks that he had critics in Rome who said that\nAristotle\nwas always right, so his work must be wrong. He answered in critics in his next work\nDemonstratio proportionum motuum localium contra Aristotelem et omnes philosophos\nwhich was published in Venice in\n1554\n. In this he repeated his arguments regarding free fall and showed clearly that what he proposed contradicted\nAristotle\nby quoting those passages in\nAristotle\n's works that it contradicted. Two editions of this work appeared in quick succession, the second containing a modification of his ideas. In this second edition he said that the speed of the falling weight would depend on its surface area because of friction with the air, and only in a vacuum would bodies of different sizes fall at the same speed.\nIn\n1554\n, the year Benedetti's\nDemonstratio\nwas published, his daughter was born in Turin. No record of his marriage exists, although no significance should be read into that fact. We do know that he was married in\n1585\n, but it is possible that either this was a second marriage, or that he rejoined his first wife and daughter at this time. Returning to the\n1550\ns, we record Benedetti's appointment as court mathematician to Duke Ottavio Farnese at Parma from\n1558\nuntil\n1566\n. At Parma\n[\n19\n]\n:-\n... he performed the duties of a mathematician, astrologer, designer and constructor of sundials, and adviser on the engineering of public works for the duchy.\nBenedetti was quite rich so when the Duke failed to pay him for long periods, he was not at all worried financially. By long periods we mean that for one period of ten months and a second period of twenty months, he was not paid. While he was employed at Parma, Benedetti lectured in Rome on the science of\nAristotle\nduring the winter of\n1559\n-\n60\n[\n1\n]\n:-\nGirolamo Mei, who heard him there, praised his acumen, independence of mind, fluency and memory.\nIn\n1587\nBenedetti became ducal mathematician and philosopher, employed by Emanuele Filberto the Duke of Savoy, a post he held until his death. He is also known to have taught in the University of Turin in the first few years after he moved to Turin. Bartolomeo Cristini, professor of mathematics at the University of Turin, wrote the following about Benedetti in\n1611\n(\nsee for example\n[\n19\n]\n)\n:-\n[\nEmanuele Filberto\n]\nwas really so fond of these mathematical arts that he invited from abroad, in order to bring prestige to our University of Turin, all the best and the most expert in those arts and he persuaded them with good salaries. Among them I want to mention Benedetti, who was enormously proficient in mathematical abstractions and left to posterity many excellent works, containing original contributions to every branch of natural philosophy.\nFrancesco Morosini, the Venetian ambassador to the Court of Savoy, wrote\n(\nsee for example\n[\n19\n]\n)\n:-\nSince mathematical science is very useful and necessary for the one who intends to practise arms, so His Excellency takes delight in it and his knowledge is much more than passable. Being conscious that a man knows a science so long as he continues to examine and study it, every day he used to listen to a lesson about\nEuclid\nor another writer of those sciences from a Venetian Mr Giovanni Battista Benedetti, a man who, not only in my opinion, but also according to the judgement of many expert people, is at present the best in this profession and is greatly appreciated by the Duke because, besides possessing this most excellent science, he is also such a good teacher that each of his pupils becomes very easily competent and expert in it.\nBenedetti published\nDe gnomonum umbrarumque solarium liber\n(1574)\n, a book on sundials. He wrote on the title page that the book is \"now first printed for public use and convenience of students.\" In a letter dedicating the book to Emanuele Filberto, Benedetti wrote:-\nOur little book on dialling, Serene Duke, which I drew up in past years, can now at last see the light.\nWhile in Turin he also designed and constructed sundials and fountains. Next he published\nDe temporum emendatione opinio, Augustae Taurinorum\n(1578)\non correcting the calendar. The following year saw his publication of\nConsiderutione di Gio. Battista Benedetti Filosofo del Sereniss. S. Duca di Suvoia\nin which he contributed to a current dispute concerning the relative volumes of the elements earth and water. His final work,\nDiversarum Speculationum Mathematicarum et Physicarum Liber Ad Sereniss. Carolum Emunuelem Allobrogum et Subalpinorum ducem invictissimum\nincludes several different pieces written by Benedetti over a number of years. We will discuss below in more detail the important material published here on perspective and music. First we note that\nDiversarum Speculationum\ncontains a commentary on the Fifth Book of\nEuclid\nand a collection of many geometrical theorems including circumscribing a quadrilateral of given sides. In a section on geometry, he also treats spherical triangles, circles and conic sections. There are details of his contributions to isoperimetric figure, regular polygons and regular solids. Dealing with regular polygons, Benedetti proved that\nDürer\n's construction of the regular pentagon using compasses with a fixed opening is not exact.\nThe\nDiversarum Speculationum\ncontains a section on mechanics in which Benedetti again attacks\nAristotle\n's physical concepts and also attacks\nTartaglia\n's mechanics. We should note that in this section he claims that if a body is released from circular motion it will travel in a straight line which is a tangent to the original circle of motion. Benedetti should certainly get the credit for being the first to publish such a claim. He also repeats his arguments concerning free fall. He gives the argument that if two bodies of equal weight were dropped, then the same bodies were dropped joined by a thread then, intuitively, the speed of fall would be the same in both cases. Stillman Drake remarks in\n[\n1\n]\n:-\nBenedetti correctly holds that natural rectilinear motion continually increases in speed because of the continual impression of downward impetus, whereas\nGalileo\nwrongly believes that acceleration was an accidental and temporary effect at the beginning of free fall only.\nAlthough\nGalileo\nhad this wrong in\nDe motu\n, he later realised his mistake and corrected it in later work. We must not give the impression that Benedetti's contributions are better than\nGalileo\n's for although he has deeper understanding on some points, he does not attempt to give the mathematical formulation of acceleration which is\nGalileo\n's great achievement. In\nDiversarum Speculationum\nBenedetti also considers hydrostatic pressure and the idea of hydraulic lift. He correctly claims that winds are due to changes in density of air caused by heating of bodies by the sun in relation to their opacity. He shows that he correctly understands clouds.\nWe promised to return to his contributions to music. Although this was only published in\n1585\n, the ideas are contained in two letters written to Cipriano da Rore who was choirmaster of the Court of Parma in\n1561\n-\n62\n. Benedetti must have held discussions with him during this time, then written the two letters in question in\n1563\nshortly after da Rore left Parma for Venice. Stillman Drake writes\n[\n1\n]\n:-\nDeparting from the prevailing numerical theories of harmony, Benedetti inquired into the relation of pitch, consonance, and rates of vibration. He attributed the generation of musical consonances to the concurrence or codetermination of waves of air. Such waves, resulting from the striking of air by vibrating strings, should either agree with or break in upon one another. Proceeding thus, and asserting that the frequency of vibration of two strings under equal tension vary inversely with the strings lengths, Benedetti proposed an index of agreement obtained by multiplication of the terms of the ratios of a given consonance; by this means he could express the degree of concordance in a mathematical scale.\nIn\n[\n18\n]\nthese musical contributions described in slightly more technical terms:-\nIn a letter to the composer Cipriano de Rore of around\n1563\nthe scientist Giambattista Benedetti proposed a new theory of the cause of consonance. Benedetti argued that since sound consists of air waves or vibrations, in the more consonant intervals the shorter more frequent waves concurred with the longer less frequent waves at regular intervals. In the less consonant intervals, on the other hand, concurrence was infrequent and the two sounds did not blend in the ear pleasantly. He showed that in a fifth, for example, the two vibrations will meet every two cycles of the lower note and every three of the higher. He went on to show that in terms of frequency of concurrence the hierarchy of ratios within the octave would be\n2\n:\n1\n,\n3\n:\n2\n,\n4\n:\n3\n,\n5\n:\n3\n,\n5\n:\n4\n,\n6\n:\n5\n,\n7\n:\n5\n,\n8\n:\n5\n, which challenges both the superiority of super-particular ratios and the sanctity of the senario. There could be no abrupt break from consonance to dissonance but only a continuum of intervals, some more, some less consonant. Benedetti's theory was espoused in the next century by Isaac Beeckman and\nMarin Mersenne\n, who sought\nRené Descartes\n' opinion of it.\nLet us now turn to Benedetti's contributions to perspective. In\n[\n3\n]\nElkins writes:-\n[\nBenedetti\n]\nopens the section titled \"De rationibus operationum perspectivae\" with an impatient review of a perspective error committed by both Dürer and Setlio, and he proceeds at once to prove the correct solution. ... The proof is the first we possess that is based entirely on the authority of Euclid, without any appeal to optics\n(\nthere is one reference at the end to Witelo\n)\n.\nField makes a thorough study of Benedetti's work on perspective in\n[\n13\n]\n:-\nThe work\n[\nDe rationibus operationum perspectivae\n]\nis indeed an elegant, rigorous and original piece of mathematics. The first two qualities naturally give the work considerable appeal to mathematicians and historians of mathematics, but in the present case the third quality, the work's originality - or rather the nature of its originality - seems to entitle it to a wider consideration. ... the most important aspect of this originality is that unlike all his predecessors Benedetti treats the problem of perspective construction as three-dimensional. He works always from the three-dimensional diagram in the first instance. This seems to be in the nature of a return to first principles. Benedetti has returned from the two-dimensional constructions used by artists to the actual physical configurations considered, albeit in a completely geometrical manner, in\nEuclid\n's work on Optics. ...\n[\nHowever\n]\nBenedetti is not so much a mathematician as a natural philosopher employing the methods of geometry. This attitude is, indeed, also suggested by the title of the work: 'De rationibus operationum perspectivae'. Surely a mathematician writing purely as such would have spoken of 'theorica' rather than 'rationes'?\nField also makes an interesting point comparing Benedetti's work on perspective with that on music:-\nThe attitude Benedetti shows in his work on perspective, which is to formulate the problem as one of mathematical physics rather than of mathematics proper, is similar to the attitude he shows in his work on music.\nIn his very first work Benedetti included his ideas on free fall so that he could claim priority and ensure the ideas were not stolen. He must have been aware that\nTartaglia\nconsidered that\nCardan\nhad stolen his solution of the cubic, although in this case\nCardan\nfully acknowledged\nTartaglia\n's contributions. Benedetti was not so lucky. In\n1562\nJean Taisner or Taisnier published from the press of Johann Birkmann of Cologne a work entitled\nOpusculum perpetua memoria dignissimum, de natura magnetis et ejus effectibus, Item de motu continuo\n. This is totally a piece of plagiarism, for Taisnier claims as his own the\nEpistola de magnete\nof Pierre de Maricourt and the\nDemonstratio,\nthe treatise on the fall of bodies by Benedetti. Now, ironically, Taisnier's work became better known than that of Benedetti, particularly after it was translated into English by Richard Eden in\n1578\n.\nSimon Stevin\npublished his experimental verification of this theory of free fall in\n1586\n, still believing that the theory was really due to Taisnier. However, Taisnier had stolen the first edition of Benedetti's work and\nStevin\ncriticised it, making the correction that Benedetti had made himself in his second edition\n32\nyears earlier. Benedetti was not  aware that Taisnier had stolen his work until after\n1570\nand in the Preface of\nDe gnomonum\n, written in\n1573\n, he voiced his anger.\nBenedetti forecast his death for\n1592\nbut, on his deathbed, he recalculated saying that the original data he used was\n4\nminutes in error\n[\n1\n]\n:-\nBenedetti died early in\n1590\n. He had forecast his death for\n1592\nin the final lines of his last published book. On his deathbed he recomputed his horoscope and declared that an error of four minutes must have been made in the original data\n(\npublished in\n1552\nby Luca Guarico\n)\n, thus evincing his lifelong faith in the doctrines of judiciary astrology.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Tartaglia",
    "N Tartaglia",
    "Ferrari",
    "Cardan",
    "Archimedes",
    "Aristotle",
    "Dürer",
    "Galileo",
    "Marin Mersenne",
    "René Descartes",
    "Simon Stevin",
    "Stevin"
  ],
  "imagens": [
    "benedetti.jpg"
  ]
}