{
  "nome_completo": "Giovanni Vailati",
  "nome_curto": "Giovanni Vailati",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vailati/",
  "data_nascimento": "24 April 1863",
  "local_nascimento": "Crema, Italy",
  "data_morte": "14 May 1909",
  "local_morte": "Rome, Italy",
  "summary": "Giovanni Vailati was an Italian  philosopher, historian of science, and mathematician.",
  "biografia": "Giovanni Vailati\n's parents were Vincenzo Vailati, a nobleman, and his wife Teresa Albergoni\n[\n22\n]\n:-\nVailati's parents belonged to the city's aristocracy, and so followed a typical Venetian lifestyle - spending the winter in a palace in the town centre, where they frequented the theatre and the nobles' club - and spending the summer in their villa in Offanengo, where they remained to run the farm estate until the first autumnal mists began to rise up from the many ditches that irrigate the fertile country of Crema.\nGiovanni had a cousin Orazio Maria Premoli\n(1864\n-\n1928)\nwho was also born in Crema, a small town about\n40\nkm south east of Milan, and the two were close throughout their lives. Giovanni attended both elementary and middle school at the College of Santa Maria degli Angeli in Monza and then, in\n1874\n, continued his studies at the College of San Francesco in Lodi. Both of these colleges were run by monks of the Barnabite Order. At this time the rector and a professor at the College in Lodi was Agostino Calcagni\n(1834\n-\n1916)\n. In fact Calcagni taught at the Barnabite College in Lodi for\n60\nyears and was rector of the College for fifteen years. Vailati was a boarder at this the College San Francesco and was awarded his diploma from the Liceo Verri in Lodi in\n1880\n. His cousin Orazio Premoli also studied at the Barnabite College of San Francesco in Lodi. Premoli graduated in law in Turin, and became a member of the Barnabite Order. We note that Premoli devoted himself to historical research, wrote a number of important books about the Barnabite Order and also wrote the biography\n[\n43\n]\nof Vailati. Calcagni, the rector of the College, became a friend of both Vailati and his cousin Premoli.\nOn\n11\nNovember\n1880\nVailati entered the University of Turin and spent two years in the Mathematics Faculty before going to the School of Engineering.\nGiuseppe Peano\nwas appointed as assistant to\nEnrico D'Ovidio\nat Turin in\n1880\nand Vailati was among the first group of students for whom he had to care. Clearly\nPeano\nhad a major influence on Vailati who would become interested in topics on which\nPeano\nworked. Among his teachers of mathematics, others who influenced him were\nAngelo Genocchi\nand\nFrancesco Faà di Bruno\n. Also studying mathematics at Turin, but one year ahead of Vailati, were\nCorrado Segre\nand\nGino Loria\n. However, Vailati's interests were remarkably broad and, in addition to courses on mathematics and engineering, he read works on philosophy, history of science, psychology, pedagogy and economics. Vailati graduated with a civil engineering degree on\n19\nDecember\n1885\n. However, probably mainly due to\nPeano\n, Vailati realised that mathematics was the subject for him so he continued to study at Turin for his mathematics degree which he was awarded on\n17\nJanuary\n1888\n. Sadly, neither the title, the topic, nor the name of his advisor are known. Perhaps it tells us something of Vailati's character that his classmates at university called him \"the Philosopher\" and noticed that he spent long periods of time in Turin's National Library where he read philosophy classics.\nVailati did not seek employment after graduating but returned, rather reluctantly it would appear, to his home in Crema where he studied languages, music, literature and philosophy. He also undertook some administrative work for the Crema municipality. He did make frequent visits to the University of Turin and maintained contacts with mathematics and the mathematicians at the university. Then in\n1892\nhe was appointed as\nPeano\n's second assistant in Infinitesimal Calculus, a position he held until\n1895\n. Vailati, in a letter to his cousin Premoli dated\n22\nDecember\n1892\n, described his duties\n(\nsee\n[\n7\n]\n)\n:-\nIn the days just passed my teaching duties have left me little free time, not so much because of the frequency of the hours of school\n(\nnine a week, of which three consist of merely attending the lesson of the principal\n)\nas for the necessary preparation and elaboration of the topics to discuss so as to avoid the danger of pulling a boner.\nHe began publishing papers at this time with two published in\n1891\n, namely\nLe proprietà fondamentali delle operazioni della logica deduttiva studiate dal punto di vista d'una teoria generale delle operazioni\nⓉ\n(\nThe fundamental properties of the deductive logic operations studied from the perspective of a general theory of operations\n)\n, and\nUn teorema di logica matematica\nⓉ\n(\nA theorem of mathematical logic\n)\n. Two further papers were published in\n1892\n, namely\nDipendenza fra le proprietà delle Relazioni\nⓉ\n(\nDependence between the properties of relations\n)\n, and\nSui principi fondamentali della geometria della retta\nⓉ\n(\nOn fundamental principles of geometry of the line\n)\n.\nAfter completing his years as\nPeano\n's assistant, Vailati became an assistant in projective geometry in\n1895\nand then, one year later, he became\nVito Volterra\n's assistant at Turin. Although employed as a mathematics assistant, nevertheless, his interests were broad and he attended the Psychology Conference in Munich in\n1896\n. Clearly, even at this early stage in his career, he had a high reputation both as a scholar and as a person. Mario Calderoni also attended this Conference in Munich and wrote about Vailati at the Conference\n[\n21\n]\n:-\nI saw him universally celebrated and requested from all intervening scholars; in the streets, in the pubs, in gatherings and meetings he was always in the middle of a group which he fascinated with his simple, whole-hearted, and nonetheless interesting, informative conversation.\nHe still maintained close contact with\nPeano\n's group, particularly with\nAlessandro Padoa\n. He lectured on the history of mechanics between\n1896\nand\n1899\n. He published three articles related to these lectures:\nDel concetto di Centro di Gravità nella Statica di Archimede\nⓉ\n(\nOn the concept of the centre of gravity in Archimedean statics\n)\n(1897)\n;\nIl principio dei Lavori Virtuali da Aristotele a Erone d'Alessandria\nⓉ\n(\nThe principle of virtual work from Aristotle to Heron of Alexandria\n)\n; and\nLe speculazioni di Giovanni Benedetti sul moto dei gravi\nⓉ\n(\nGiovanni Benedetti's speculations on motion under gravity\n)\n. For extracts from a review of this last mentioned work, see\nTHIS LINK\n.\nHe also wrote\nIl Metodo Deduttivo come Strumento di Ricerca. Prolusione ad un corso libero di Storia della Meccanica,\n1897\n-\n1898\nⓉ\n(\nThe deductive method as a research tool: Opening address to a course on the history of mechanics,\n1897\n-\n1898\n)\n. The first of his inaugural lectures on this topic, in December\n1896\n,\nSull' Importanza delle Ricerche relative alla Storia delle Scienze\nⓉ\n(\nOn the importance of research related to the history of science\n)\nwas on the importance of research in the history of science. For extracts from a review of this work, see\nTHIS LINK\n.\nHis second inaugural lecture in\n1897\nwas on the deductive method in which he looked in depth at\nGalileo\n's method which combined induction and deduction. His third inaugural lecture was on the role of language in the history of science and culture. We see something of Vailati's other interests at this time in a reply to a letter from Victoria Welby\n(1837\n-\n1912)\n, which he wrote in June\n1898\n[\n41\n]\n:-\nAs you have seen perhaps from my pamphlets, I am a fervent admirer of the English classical philosophical school, in particular of J S Mill, whom I believe to be by far the most exact and profound writer of the century on philosophical subjects. His influence on continental thought seems to me to be underrated by the actual philosophical authorities in England; they seem to me not sufficiently to realize the great advance represented by Mill's writings, 'vis-a-vis' of those of the German metaphysicians of the school of Kant\n(\nSchopenhauer not excluded\n)\n, who, in so far as logic is concerned, cannot now pretend to have anything more than an historical interest\n(\nand perhaps not much even of that\n)\n. In my essay 'On the use of deduction as a means of investigation'\n[\nIll metodo deduttivo come strumento di ricerca\n]\n, I ventured to suggest some little improvements on Mill's views on the function and logical value of syllogism, to which I have been led by my researches on the history of sciences and by direct analysis of the original works of the great physical discoverers of XVII th century\n(\nGalileo\n,\nHuygens\n,\nNewton\n)\n.\nIn\n1899\n, after spending seven years with the duties of an assistant at Turin, Vailati decided to take up school teaching. It is not entirely clear why he chose to give up his academic career but Massimo Mugnai\n[\n36\n]\nsuggests:-\nThe reasons for this are probably many: desire for independence, awareness of the inherent difficulties in achieving a suitable role at a university, but above all the awareness that he possessed a temperament that is ill-suited to applying himself exclusively to the study of a single discipline.\nCertainly Vailati did not give up teaching mathematics, for he taught this topic at quite a number of schools and technical institutes over the next few years. He taught briefly at a private school in Pinerolo in\n1899\nbefore teaching at the Liceo in Syracuse, Sicily\n(1899\n-\n1900)\n, the Technical Institute in Bari\n(1900\n-\n1901)\n, a high school in Como\n(1901\n-\n1904)\n, and a Technical Institute in Florence from\n1904\n. However, he continued to have broad interests and, while at Syracuse, he met Amato Pojero, a member of the Mathematical Circle of Palermo, who put him in touch with Franz Brentano\n(1838\n-\n1917)\n. Brentano, who had retired from the University of Vienna in\n1895\n, was an influential philosopher and psychologist. Vailati and Brentano became friends and Vailati spent the summer of\n1902\nstaying at the Brentano family home in Austria. In\n1903\nVailati visited England, spending time at Cambridge and in Harrow. The purpose of his visit was to meet Victoria Welby, with whom he had corresponded regularly since\n1898\n. Welby published her first book on philosophy,\nWhat Is Meaning? Studies in the Development of Significance,\nin\n1903\n.\nVailati worked on mathematical logic, working closely with\nPeano\non this topic, and also on the history and methodology of science. However during his lifetime his work in philosophy earned him most recognition. He was a pragmatist with views not far from those of\nCharles Peirce\n. Vailati was a member of the organising committee of the First International Congress of Philosophy which was held in Paris in\n1900\nimmediately before the First International Congress of Mathematicians. At the First International Congress of Philosophy, Vailati was appointed to the permanent international commission. He lectured to the conference on the classification of sciences in his talk\nDes difficultés qui s'opposent à une classification rationelle des sciences\nⓉ\n(\nThe difficulties in making a rational classification of the sciences\n)\n. He attended the International Conference on Historical Sciences in Rome in April\n1903\nand gave two talks:\nLa dimostrazione del principio delle leva data da Archimede\nⓉ\n(\nThe demonstration of the principle of the lever by Archimedes\n)\n; and\nSull'applicabilità dei concetti di causa e di effetto nelle scienze storiche\nⓉ\n(\nThe applicability of the concepts of cause and effect in historical sciences\n)\n. He participated in the third International Congress of Mathematicians in Heidelberg in August\n1904\ngiving the lecture\nIntorno al significato della differenza tra gli assiomi ed i postulati nella geometria greca\nⓉ\n(\nOn the significance of the difference between the axioms and postulates in Greek geometry\n)\nwhich discussed the meaning of the difference between axioms and postulates in Greek geometry. He attended the Third International Congress of Philosophy in Heidelberg in\n1908\n. In fact this third conference was largely a discussion of pragmatism and this is almost certainly due to Vailati's influence on the committee. He delivered the address\nThe grammar of algebra\nat this conference.\nWe noted above that Vailati started teaching in Florence in\n1904\n; he taught there at the Technical Institute \"G Galilei\". He had been asked by the\nAccademia dei Lincei\nto edit the works of\nEvangelista Torricelli\nand this had led to him being appointed to a teaching position in Florence. However, the project editing\nTorricelli\n's works never came to fruition. In Florence, Vailati met with the founders of the journal \"Leonardo\" and he began contributing to that journal. He wrote reviews of recent work by\nPierre Duhem\n,\nHenri Poincaré\n,\nErnst Schröder\n,\nCharles S Peirce\n,\nLouis Couturat\n,\nFederigo Enriques\n, Ernst Mach, and William James. He also published in \"Leonardo\" articles on philosophy, language, and science. The journal became the focus for a Pragmatism Club of Florence in which Vailati enthusiastically participated. In the article\nLa più recente definizione della matematica\nⓉ\n(\nThe most recent definition of mathematics\n)\n(1904)\n, published in \"Leonardo\", Vailati discusses\nBertrand Russell\n's statement that \"mathematics is a science where we never need to know if what is said is true, nor do we need to know what we are talking about\".\nWhen, in\n1905\n, Vailati explained to the\nAccademia dei Lincei\nthat although he would not be able to edit the works of\nEvangelista Torricelli\n, he still wished to remain in Florence so that he could continue studying in the National Library. However, he was removed from his position at the Technical Institute \"G Galilei\" and asked to participate in the Commission set up to consider Educational Reform in Secondary Schools. He undertook general work for the Commission but, in particular, he was put in charge of producing a new syllabus for teaching mathematics in Secondary Schools. His ideas on this were published in his paper\nL'insegnamento della matematica nel primo triennio della scuola secondaria superiore\nⓉ\n(\nThe teaching of mathematics in the first three years of secondary school\n)\n(1907)\n. He argued against teaching geometry from\nEuclid\n's axioms in the first three years of high school, but rather proposed an method based on experimental evidence. This method did not exclude studying proofs of theorems but, Vailati writes in the paper, it gives the student:-\n... the desire and the need to understand 'how' and 'why' certain properties subsist, and to induce him to find interest in the learning of\n(\nor search for\n)\ndeductive relations between properties and reasoning that lead him to acknowledge them as being consequences of one another.\nFor some quotes by Vailati about teaching, see\nTHIS LINK\n.\nVailati began his career with an interest in the history of mechanics and in the last two years of his life he thought again about these questions. He had been stimulated to think again about this having read\nPierre Duhem\n's book\nThe origins of the static\n(1905\n-\n06)\n. The Italian Society for the Progress of Sciences had been set up under its director\nVito Volterra\nand Vailati joined the organising committee.\nFor short extracts from five of Vailati's works written between\n1905\nand\n1907\n, see\nTHIS LINK\n.\nFor extracts from reviews of a few of Vailati's works, see\nTHIS LINK\n.\nHaving taken leave from his teaching post in Florence, in the autumn of\n1908\nVailati drew up plans to return to that position. However, he contracted influenza in December of that year and, thinking that Rome offered a better climate than Florence to aid his recovery, he moved there. Although only\n46\nyears of age, several different health problems afflicted him by the spring of\n1909\nsuch as heart problems and rheumatic fever. He was taken into hospital but he was still in good spirits and continued to read both novels and works on philosophy. Following his death, his funeral took place in Rome attended by high officials of the Italian State including\nVito Volterra\n.\nKennedy writes in\n[\n7\n]\n:-\nVailati came of a Catholic family, but lost his faith during his early university years. Throughout his life he had affectionate and devoted friends. He never married. His premature death was attributed to heart trouble, complicated by pulmonitis.\nIn\n[\n39\n]\nPeano describes his assistant Vailati:-\n... he was modest, friendly with all, and universally esteemed, both for his learning as also for his personal qualities.\nLet us end with Horace Standish Thayer's assessment of Vailati's contributions from\n[\n17\n]\n:-\n[\nVailati's\n]\nwork displays a meeting of intellectual currents that were to determine the later character of modern philosophy: Peirce's pragmatism and his interest in signs and the analysis of concepts; the interest of the Vienna Circle,\n1923\n, in formulating the methodology of verification and a criterion of meaningful\n(\ni.e. the cognitive use of\n)\nlanguage; the mathematical, critical, and analytical investigations of language, logic, and science by\nRamsey\nand\nWittgenstein\n.",
  "matematicos_citados_na_biografia": [
    "Giuseppe Peano",
    "Enrico D'Ovidio",
    "Peano",
    "Angelo Genocchi",
    "Francesco Faà di Bruno",
    "Corrado Segre",
    "Gino Loria",
    "Vito Volterra",
    "Alessandro Padoa",
    "THIS LINK",
    "Galileo",
    "Huygens",
    "Newton",
    "Charles Peirce",
    "Accademia dei Lincei",
    "Evangelista Torricelli",
    "Torricelli",
    "Pierre Duhem",
    "Henri Poincaré",
    "Ernst Schröder",
    "Charles S Peirce",
    "Louis Couturat",
    "Federigo Enriques",
    "Bertrand Russell",
    "Euclid",
    "Ramsey",
    "Wittgenstein"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}