{
  "nome_completo": "Giovanni Antonio Magini",
  "nome_curto": "Giovanni Magini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Magini/",
  "data_nascimento": "13 June 1555",
  "local_nascimento": "Padua, Venetian States (now Italy)",
  "data_morte": "11 February 1617",
  "local_morte": "Bologna, Papal States (now Italy)",
  "summary": "Giovanni Magini was an Italian scientist who worked in astronomy and had a version of an earth-centred Solar system.",
  "biografia": "Giovanni Magini\n's father, Pasquale Magini, was a citizen of Padua. Nothing else appears to be known concerning his father or the rest of his family. Magini completed his education at the University of Bologna, receiving a doctorate in philosophy in\n1579\n. He published\nEphemerides coelestium motuum\n, a major treatise on astronomy, in\n1582\nand in the following year he published an Italian version of the original Latin text.\nEgnatio Danti\nheld the chair of mathematics at the University of Bologna and, following his death in October\n1586\n, a competition was announced to fill the chair. Magini competed for the chair as did, among others,\nGalileo\n. One might think that there would be no competition once\nGalileo\napplied for a chair but Magini was nine years older than\nGalileo\nand seen as a much safer appointment; he was appointed in\n1588\nand held the position for the rest of his life.\nGalileo\nhad revolutionary ideas while Magini's ideas were original but based on the established world-view. In\nNovae coelestium orbium theoricae congruentes cum observationibus N Copernici\n(\nVenice,\n1589)\n, Magini writes about \"absurd hypotheses, such as\nCopernicus\nimagined\". He writes\n(\nsee for example\n[\n10\n]\n)\n:-\nIt seems to\nCopernicus\n, against all truth and philosophy, that the earth moves, while the sun and the eighth sphere are motionless. ...\nCopernicus\n's opinion about the motion of the earth is erroneous.\n[\nHis hypotheses\n]\nare attacked by nearly everybody for being too far away from the truth and absurd.\nThe book does contain, however, Magini's own version of an Earth-centred theory which was seen at the time as an impressive development. He proposed a system consisting of eleven rotating spheres and soon gained international coverage for his ideas with them being explained to an English audience in Thomas Blundeville's treatise\nThe Theoriques of the Seuen Planets\nof\n1602\n.\nIn\n1592\nMagini published\nDe Planis Triangulis\nwhich explains the use of quadrants in astronomy and in surveying, in particular describing details of calculations and measurements which could be performed with a quadrant. In fact several quadrants have survived with an inscription involving Magini's name. Ilaria Meliconi describes a quadrant bearing the inscription \"Quadrant of the General Planisphere of Giovanni Antonio Magini\" and asks\n[\n9\n]\n:-\nWhat can be inferred from the appearance of his name on this quadrant? Are we to believe that he had the skill to be the maker of such a fine and elaborate instrument? If not, was he the designer, or just the original owner of the quadrant?\nTwo quadrants exit, one with the inscription \"Giovanni Antonio Magini of Padua designed this in Bologna in the year\n1592\n\", the other is dated\n1595\nand inscribed \"Giovanni Antonio Magini Professor of Mathematics in the University of Bologna had this made\". We also note that in the Preface to\nDe Planis Triangulis\n, Magini mentions writing an instruction book and an instrument: \"if I had also made the instrument to use together with the book, I would have had it made in brass.\" Also in\n1592\nMagini published\nTabula tetragonica\n, then in\n1596\npublished a commentary on\nPtolemy\n's\nGeographia\n.\nThe chair of mathematics at Bologna saw Magini receive a salary of\n1000\nlire which was doubled to\n2000\nlire in\n1597\n. However, he also acted as a private tutor and received extra income from this type of work. Of course, the professor of mathematics was only going to tutor the very top people and indeed he did just this acting as a tutor to the sons of the Duke of Mantua beginning in\n1599\n. As well as teaching the boys mathematics, Magini was astrologer to the Duke. In\n1599\n-\n1600\n, Magini tutored Ferdinando Gonzaga\n(1587\n-\n1626)\n, the son of Vincenzo I Gonzaga, Duke of Mantua, and his brother, giving instruction on\nAristotle\n's\nMechanics\n. In\n[\n5\n]\nwe learn a lot about the interaction between Magini and Ferdinando over many years as well as understanding a little about Magini's interest in astrology:-\nMagini had continued to keep in touch with Ferdinando and rejoiced at his becoming a cardinal\n[\nin\n1607]\n, commenting at that time upon his unusual erudition; in\n1609\nhe had sent him his own mathematical treatise\n(\non spherical trigonometry\n)\nrecalling Ferdinando's deep understanding of the subject; early in\n1611\nhe sent another work, his treatise on the partispherical mirror. In\n1611\n-\n12\na one-sided part survives of what must have been a quite regular correspondence, demonstrating that Ferdinando was engaged on alchemical experiments under Magini's direction. Magini sent particulars of an experiment to him at Mantua in April\n1611\n, and wrote that he had transcribed many more notes for him, but that a German\n(\nMartin Horkey\n)\n, whom he had sent away on\nGalileo\n's insistence, had taken them. Ferdinando was evidently well equipped with laboratory apparatus, for Magini asked to be lent some of his glass vessels or instruments. In June the same year, when the Cardinal was at Florence and unwell, Magini wrote to cheer him up with the news that he had found at Venice some new books on the subject, including Philip Müller, 'Miracula Chymica et Mysteria Medica'\n(\nfirst edition, Wittenberg\n1611)\nwhich he urged Ferdinando also to buy. In February\n1612\n, when Ferdinando was in Paris, Magini wrote of an even more exciting find, some rare books by the thirteenth-century hermeticist\nRamon Llull\n; even Magini dropped an admission that the attribution to\nLlull\nmight be false, nevertheless he confidently quoted a passage in his letter and asked Ferdinando to check whether an image of Christ and a cross allegedly made from alchemical gold were still in Notre-Dame. Back in Rome in the summer of\n1612\nFerdinando evidently continued his alchemical experiments. Magini urged him to persevere in an exercise to extract the 'menstruo vegetabile' from red wine, which could be very well done in Rome, since the wines there were darker and stronger. Evidently the wine had to remain for forty-five days in a warm bath of putrefied water or horse shit. In another letter, promising more transcripts from the pseudo-Llullian text, Magini insisted on the value of this experiment to distil 'solfere vegetabile' from wine; for it would equip Ferdinando with the key to carrying out still greater transmutations.\nThis seems the appropriate place to say a little more about Magini's contributions to astrology. He published\nDe astrologica ratione\nin\n1607\n, a work in which he discusses the uses of astrology in medicine. He was also a strong believer in metoposcopy, the art of deducing someone's personality from the pattern of the lines across their forehead, and he published a work on that topic.\nIn\n1606\nMagini published an extremely accurate set of trigonometric tables. This mathematical work is typical of all of Magini's mathematical contributions which are all highly practical; they include treatises on the geometry of the sphere, on applications of trigonometry, and on calculating devices of his own invention. He had triumphed over\nGalileo\nin the competition for the chair at Bologna but he also strongly opposed\nGalileo\n's views\n[\n11\n]\n:-\nDuring the Easter holidays of\n1610\n,\nGalileo\nstopped in Bologna on his way from Padua to Florence to stay at the house of his colleague Giovanni Antonio Magini .... Many in Bologna, including Magini, were sceptical of\nGalileo\n's discoveries, and therefore an opportunity presented itself for a demonstration. In the presence of a number of learned men,\nGalileo\nshowed his telescope and let others observe earthly and celestial things through it. They agreed that for earthly objects the instrument performed as promised but that in the heavens it was not reliable.\nThe reason the telescope was believed to be unreliable was that when it was turned on certain stars they appeared as double and another star was seen to have four small stars nearby.\nMagini was also interested in mirrors, both in their theory, publishing a treatise on the theory of concave spherical mirrors, and in their practical manufacture. He presented large concave spherical mirrors to Jacopo Boncompagni\n(\nson of Pope Gregory XIII and Prince of Sora\n)\n, to Cardinal Alessandro Farnese\n(\nson Pier Luigi Farnese, Duke of Parma\n)\n, and to the Holy Roman Emperor Rudolf II. The Duke of Mantua paid him a handsome sum for one of the mirrors but there was a long battle between Magini and Rudolf II since Magini felt he had been promised payment for the mirror which he did not receive.\nWe have not yet mentioned the work for which Magini is best known namely his map of Italy. On\n15\nMarch\n1595\nMagini published a map of the Bologna region and wrote in the dedication\n(\nsee for example\n[\n4\n]\n)\n:-\nInasmuch as I desire to publish a complete atlas of Italy, showing, besides the provinces, the territories of each city, I have decided to publish first this map of the territory of Bologna ...\nLet us quote from\n[\n4\n]\nwhich provides a good summary of how Magini's map of Italy developed from that point:-\n[\nThe Bologna map\n]\nwas soon followed by other maps, and in two years he had the greater part of the maps of North Italy already engraved, and some of them published. They were apparently sold separately and are extremely rare in this state; for, being unable to obtain material for his maps of Southern Italy, he started correcting and revising what he had already done, publishing a new map of the territory of Bologna in two sheets in\n1599\n. At last, in\n1602\n, he received materials for the formation of the maps of the kingdom of Naples; and in\n1604\nnearly the whole atlas was ready, and an index of it appeared in the Latin edition of his astronomical work, the 'Tavole del Primo Mobile'. But now he was unable to obtain engravers, owing to a series of misfortunes, and began a lengthy descriptive commentary which was to accompany the maps, but which was never published, and is for the most part lost. At last, in\n1607\n, he secured the services of one Benjamin Wright, who, in the following year, engraved for him a large map of Italy in six sheets. Wright, however, was something of a drunkard, and pawned several of the plates which he had done: and it was only in\n1613\nthat the engraving of the plates was finished, after a good deal of further revision. The printing at last began in Bologna at the end of\n1616\n; but Magini's death delayed the appearance of the work until\n1620\n, when his son Fabio, who was not fifteen when his father died, finally brought it out. He dedicated it to Ferdinando Gonzaga, a member of the ducal family of Mantua, with which Giovanni had been in close personal relations, and who indeed had procured him a great deal of manuscript material from the governments of the various states of Italy.\nAlmagià, in\n[\n1\n]\n, argues that Magini's maps made a considerable contribution to modern geography:-\nPrevious errors both in latitude and longitude are reduced; the political boundaries and physical features are far better indicated than ever before; and a number of names have been added. It was indeed a long time before Magini's work was superseded.\nFinally, let us note that one of the main sources of biographical information about Magini is his correspondence with leading scientists which was edited and published by Antonio Favaro in\n1886\n(\nsee\n[\n3\n]\n)\n.",
  "matematicos_citados_na_biografia": [
    "Egnatio Danti",
    "Galileo",
    "Copernicus",
    "Ptolemy",
    "Aristotle",
    "Ramon Llull",
    "Llull"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}