{
  "nome_completo": "Giuseppe Basso",
  "nome_curto": "Giuseppe Basso",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Basso/",
  "data_nascimento": "9 November 1842",
  "local_nascimento": "Chivasso, Turin, Kingdom of Sardinia (now Italy)",
  "data_morte": "28 July 1895",
  "local_morte": "Turin, Italy",
  "summary": "Giuseppe Basso was an Italian physicist and mathematician who produced some important results in mathematical physics.",
  "biografia": "Giuseppe Basso\n's parents were poor but hard working. Giuseppe's father was a tailor and their home was also the tailor's workshop. This was the environment that the young boy grew up in having to work hard helping his parents from as soon as he was able. Even after studying all day at school, he still had to come home and become a worker in his father's business. However, despite this hard life he still performed extraordinarily well at school and was always ranked first in his class. Giuseppe's determination to succeed at his studies and the encouragement of his teachers persuaded his parents to make the necessary sacrifices to allow him to continue beyond the stage where he could have left school and become a full-time worker in the tailor's workshop.\nHe attended the gymnasium courses at the college in his native town of Chivasso and, after completing his studies there, continued his education at the high school in Turin. He showed great determination to continue for, given the financial situation, he had to live in extremely difficult circumstances. In\n1857\n, at the age of fifteen, he won a competition for a scholarship for students from the provinces to the Carlo Alberto College of Turin, which was a boys boarding school founded in\n1838\n. This scholarship covered his accommodation and catering while allowing him to take courses at the University of Turin. However, he could only enjoy the benefits of the boarding school for two years. From the summer of\n1859\nhe was no longer given accommodation and catering but only awarded a monthly grant. However, with this he managed not only to live himself but was able to help out his friends and send a little money to his parents. He achieved this, not because he had a large grant but rather because his upbringing had taught him to live very frugally. When there were no courses over the summer, Basso would return to Chivasso and help out in the tailor's workshop much to his father's relief.\nAt the University of Turin he took courses at the Faculty of Science, receiving, among the many distinctions, special praise for his work in mathematical physics. In July\n1862\n, when he was still only nineteen years old, he was awarded the degree of Doctor of Physics. His dissertation was\nSulla luce polarizzata circolarmente e sulle sue applicazioni\nⓉ\n(\nOn circularly polarized light and its applications\n)\n. As an undergraduate Basso had gained a high reputation among his fellow students and also among the professors who taught him. Some of these professors, as well as teaching at the University of Turin, also taught at the Royal Military Academy in Turin. They helped support his application to the Military Academy and he was appointed as an adjunct professor there at within a few weeks of his graduation. Earning a salary had been an urgent necessity for him but now with this appointment he was able to support himself and he looked forward to being able to reward his family for all the sacrifices they had made to let him achieve his goal.\nNot only did he teach at the Military Academy but he also began teaching in various private institutes of secondary education. He had an exceptional ability as a teacher so soon he was much sought after and became one of the most hard-working teachers in Turin. The hard work was having a serious impact on his health, however, and he became rather frail suffering various illnesses so that his friends became very worried about him. He persisted with his studies on top of his teaching for he was determined to gain a university position. In\n1864\n, two years after his graduation, he took part in a competition to become a\ndocent\nin the Faculty of Physical, Mathematical, and Natural Science at the University of Turin. He submitted a thesis\nSul lavoro interno prodotto dal calore  nei corpi\nⓉ\n(\nOn the internal work produced by the heat in the bodies\n)\nand was appointed to the position. We note that he did not give up his position at the Royal Military Academy, in fact continuing to hold that post for the rest of his life.\nOnce he began teaching at the University, Basso's career progressed rapidly and he published\nSull'uffizio della matematica nelle scienze sperimentali\nⓉ\n(\nOn using mathematics in the experimental sciences\n)\nin\n1895\n. The professor of experimental physics at the University of Turin was Gilberto Govi\n(1825\n-\n1889)\nand he was frequently absent from the University and on these occasions Basso substituted for Govi. The help he was able to give Govi quickly added to their warm friendship and so Basso was given the opportunity of doing some experimental physics in Govi's laboratory. In\n1866\na decree of the Minister of War allowed Basso a few month's leave from the Military Academy which gave him the opportunity to work on a\nNota intorno alla determinazione di temperature molto elevate mediante un procedimento calorimetrico analogo a quello seguito da Byström\nⓉ\n(\nNote on the determination of very high temperatures using a similar calorimetric procedure to that followed by Bystrom\n)\nwhich he published in the\nMemoirs\nof the\nTurin Academy of Sciences\nin\n1867\n.\nThe professor of mathematical physics at Turin was Felice Chiò\n(1813\n-\n1871)\nwho was an excellent mathematician and physicist who also undertook various political roles in the newly forming country. Chiò had been appointed as professor of mathematical physics in Turin in\n1854\n, occupying the chair the famous physicist Amedeo Avogadro had held until he retired in\n1850\n. Chiò had kept the style of the mathematical physics courses much as Avogadro, and the material covered was relatively elementary with many topics considered as part of mathematical physics by the time Basso was appointed not being included. In\n1865\nChiò had been appointed professor of analysis and higher geometry, and alternated the teaching of these sciences with that of mathematical physics. Basso took over responsibility for teaching mathematical physics, being appointed a temporary professor of that topic in\n1866\n. He wanted to modernise the topics taught but, with Chiò still teaching at the University, he had to proceed with a great deal of tact. Basso was able to make many significant changes, however, but his efforts on teaching meant that for some time he was not able to find the necessary time for major research projects. In fact\nSulla deviazione massima dell'ago calamitato sotto l'azione della corrente elettrica\nⓉ\n(\nOn the maximum deflection of a magnet under the action of the electric current\n)\n(1870)\n,\nDeterminazione della velocità del suono nell'aria per mezzo di un'eco polifona\nⓉ\n(\nDetermination of the speed of sound in air by means of a polyphonic echo\n)\n(1870)\nand\nNuova bussola reometrica\nⓉ\n(\nA new rheometric compass\n)\n(1871)\nwere the only works he published in the ten years between\n1867\nand\n1877\n. Into the mathematical physics syllabus he introduced a course on physical optics taught every year and various courses based on monographs on other branches of mathematical physics, which alternated from year to year. In fact, not only was physical optics brought into the syllabus, but it also became the main research topic for Basso.\nChiò died in\n1871\nand in the following year Basso was appointed to be the permanent head of mathematical physics, having held the professorship for the previous five years only on a temporary basis. However, in\n1872\nGilberto Govi, the professor of experimental physics, was appointed to the International Commission of Weights and Measures, meaning that he had to spend long periods of time in Paris. Basso, in addition to heading the department of mathematical physics, also acted as a substitute for Govi in experimental physics. This position was renewed on a yearly basis, and this practice continued even after\n1876\nwhen Govi left Turin for a job in Rome. It continued until\n1878\nwhen Andrea Naccari\n(1841\n-\n1916)\n, whose first degree was in Pure Mathematics from the University of Padua in\n1862\n, was appointed as Ordinary Professor of Experimental Physics at the University of Turin. The two years\n1876\n-\n78\nwere particularly difficult for Basso who, in addition to being in charge of Mathematical Physics and of Experimental Physics at the University, was recalled to teaching at the Military Academy in January\n1876\n. Remarkably, these two years of very heavy teaching and administrative duties saw the beginning of a period of intense research activity by Basso. One of the reasons for this was that with Govi having left Turin, Basso had full use of the physics laboratory.\nBetween\n1877\nand\n1880\nBasso had ten papers published, three in\n1877\n, two in\n1879\n, and five in\n1880\n. For the titles of these papers see a list of Basso's papers at\nTHIS LINK\n.\nHis work now was both theoretical and experimental, using experiments to verify the behaviour predicted by the theory. Here is the description of one of his most important papers published in\n1877\n[\n4\n]\n:-\nIn a theoretical-experimental study, 'Fenomeni di polarizzazione cromatica in aggregati di corpi birifrangenti' Basso was the first to consider, from the point of view of optical behaviour, regular agglomerations of small double refraction elements each of which acts as a small isolated crystal, while forming a considerably continuous system on the whole, that he calls a 'radiated' system; he studied theoretically the phenomena of thin chromatic polarisation that show a thin sheet of radiated structure placed between two Nichol prisms with parallel light and convergent light and then experimentally verified the most salient characteristics predicted by the theory in the numerous special cases considered. Some time after he had resumed the study, which had already been attempted with little success by other mathematical physicists in first half of the century, to theoretically determine the intensity and the polarisation conditions of the reflected ray coming from a rectilinearly polarised ray, incident on the surface of a double refraction crystal.\nNot only did Basso's career move forward at the University of Turin, but he was also promoted at the Military Academy. He was promoted there to adjunct professor first class in\n1879\nand then, two years later, in\n1881\n, he was promoted to full professor. At the University of Turin he became a full professor in\n1882\n.\nGalileo Ferraris writes\n[\n1\n]\n:-\nThe series of works on optical physics is the one that defines and assigns to Giuseppe Basso his true place in the ranks of our workers of science: a place, the importance of which will be evident to those who think of the deplorable neglect in which here as elsewhere, in schools as laboratories, is at present left the beautiful branch of physics that Basso favoured. However, note his concentration on this work, which occupied the best part of his career, he has continued to produce also other publications.\nIn addition to important papers on optics and other branches of mathematical physics including magnetism, Basso wrote a number of important obituaries including those of Victor Regnault\n(1810\n-\n1878)\n,\nGustav Robert Kirchhoff\n,\nRudolf Clausius\n, Gilberto Govi\n(1825\n-\n1889)\nWilhelm Weber\n, James Prescott Joule\n(1818\n-\n1889)\n, and\nEnrico Betti\n.\nGalileo Ferraris writes about his experience of having Basso as a teacher\n[\n1\n]\n:-\nI still remember the honest care and love he undertook to make clear and accessible to us all the work he was describing; with what art he was able to couple clarity and accuracy, and sometimes also with elegance of speech; how assiduously and with painstaking zeal he fulfilled his duties. The goodness of heart, the honesty of purpose, the habit of absolute obedience to duty were, moreover, directing elements for all the acts of his life. He spent most of his life on labours and sacrifices, supported only by the conscious performing of duty.\nHowever, Galileo Ferraris explains that Basso denied himself the comforts and luxuries he might have sought and, despite his love of beauty and culture, he denied himself the pleasures offered by theatres and other city art institutions.\nBasso received many honours. He was elected to the\nAcademy of Science of Turin\nin\n1877\nand served as a section secretary in\n1888\nand\n1892\n. in\n1891\nhe was elected member of the Society of Italian Spectroscopy, and in\n1893\nhe became a member in the Royal Academy of Agriculture of Turin.\nGalileo Ferraris ends his biography of Basso writing\n[\n1\n]\n:-\n... always calm and serene, on the evening of\n27\nJuly, he was, coming home, still holding the hands of friends, and they said to him: \"until we meet again,\" the last \"until we meet again.\" The day after he had left us! From that day his old mother is waiting in vain for the usual greeting. And we, still astonished and disbelieving, oh! how often we feel in our hearts a gasp, and a shudder in our veins, if in the evening, at the bend in the road, there is present in the shadow, a figure that we remember, the one that always we expect to see, the figure of our poor friend Basso!",
  "matematicos_citados_na_biografia": [
    "docent",
    "Turin Academy of Sciences",
    "THIS LINK",
    "Gustav Robert Kirchhoff",
    "Rudolf Clausius",
    "Wilhelm Weber",
    "Enrico Betti",
    "Academy of Science of Turin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}