{
  "nome_completo": "Giuseppe Pompilj",
  "nome_curto": "Giuseppe Pompilj",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pompilj/",
  "data_nascimento": "17 July 1913",
  "local_nascimento": "Rome, Italy",
  "data_morte": "9 July 1968",
  "local_morte": "Rome, Italy",
  "summary": "Giuseppe Pompilj was an Italian mathematician who worked in geometry and mathematical statistics.",
  "biografia": "Giuseppe Pompilj\nwas only five years old when his father died in World War I in\n1918\n. He had a brother Guido Pompilj. Giuseppe was educated in Rome where he entered the university to study mathematics. There he was taught by, among others,\nFederigo Enriques\n,\nFrancesco Severi\nand\nGuido Castelnuovo\n. He undertook research in algebraic geometry for his thesis, advised by\nEnriques\n, and graduated in\n1935\n. He began publishing papers in\n1935\nand you can see a list of his publications at\nTHIS LINK\n.\nPompilj continued to undertake research at the University of Rome and, in\n1942\n, he was appointed as a lecturer. However, Italy had entered World War II on the side of Germany in June\n1940\nwith the initial aim of expanding its colonies in North Africa. Pompilj was called up for military service and, after being captured by the British, was interred in a POW camp in North Africa. From there he was transferred to the POW camp at Yol in India. Yol, so called after being the site of the Young Officers Leave camp established in\n1849\n, is situated\n10\nkm southeast of Dharamsala and about\n15\nkm northeast of Kangra town. Conditions in the camp were good and there was a small library in which Pompilj found\nAlec Aitken\n's book\nStatistical Mathematics\n(1939)\n. There was another Italian mathematician held as a prisoner at Yol who had been undertaking research in mathematical statistics for his thesis before being called up for military service. He was able to continue to work on his thesis at Yol and Pompilj was pleased to be able to help him. This was a rather unusual way for an expert in algebraic geometry to become interested in statistics but this was to lead to Pompilj becoming one of the leading statisticians in Italy after the war ended.\nIn\n[\n7\n]\nGiorgio Dall'Aglio writes about the background:-\nThus Pompilj encountered mathematical statistics; a providential contact, which would have been difficult in his country. The Italian statistical school was then dominated by\nCorrado Gini\n, who was critical about the development that mathematical statistics was taking in Anglo-Saxon countries, and drove the Italian school towards descriptive statistics. This direction was also favoured by the nationalism of the Fascist period and by the separation induced by the war. So there was in Italy a deep ditch between statistics and probability, although the latter had famous scholars like\nFrancesco Paolo Cantelli\nand\nBruno de Finetti\n.\nHowever, back in Italy after release from the POW camp in India in\n1946\n, Pompilj's publications over the next couple of years were mainly on geometry except for the paper\nSulla regressione\nⓉ\n(\nOn regression\n)\n(1946)\n. In fact he published eight papers in\n1946\n, the other seven being on geometry. In\n1947\nhe published two papers, one on geometry and one on statistics; see\nTHIS LINK\n.\nIn\n1948\nPompilj entered a competition for a chair of geometry at the University of Rome. He was successful and appointed as professor of geometry. However, in the same year he began teaching statistics in addition to his geometry teaching. Giorgio Dall'Aglio explains in the interview\n[\n9\n]\nhow Pompilj, as a professor of geometry, began teaching statistics:-\nAn encounter with\nCorrado Gini\ndefinitively changed the course of his scientific and academic life.\nGini\nwas an eminent statistician who, due to the autarchic attitude of Fascism and the war, knew little about and did not appreciate the huge developments abroad. However, he recommended the hiring of Pompilj at the Faculty of Statistics in\n1948\n. It is interesting to note that though Pompilj was officially assigned the chair of geometry, he in fact had to teach probability\n(\nwhich previously was taught only to students of actuarial science\n)\nand mathematical statistics. His main accomplishment no doubt is that he was able to foster the academic developments of these new, emerging fields of mathematics.\nWe note that in the\n1950\ns, Pompilj was teaching both statistics and geometry courses at the University of Rome. For the rest of this biography we follow\n[\n13\n]\n.\nThanks to his mathematical training, Pompilj had the skills to reduce the gap between mathematics and statistics that had been created in Italy. He brought Italian research in statistics closer to those of other countries, especially the Anglo-Saxon ones, reformulating and refining, in the context of the theory of random variables, many of the criticisms that\nCorrado Gini\nhad to the significance of the theory.\nHe constantly strove to spread statistical methods for data processing, paying particular attention to the correctness of the interpretation, to the discussion of common and often subtle errors in the applications, to assumptions that were not adequately clarified with the resulting ambiguity in interpretation. He expended great effort in teaching, not only in the Faculty of Statistical Sciences, but also at non-university organisations and institutions, including the Italian Association for Market Studies. At the Central Institute of Statistics, he organised courses in statistical methodology for researchers and employees of public and private corporations, involving eminent teachers and organising the publication of the lectures. He made fundamental contributions to the setting up of the sample surveys carried out Central Institute of Statistics. He created the Istituto di Calcolo delle Probabilità in the Faculty of Statistical Sciences, which became an authoritative reference for all research that required assistance in the proper use of statistical procedures.\nPompilj was also a pioneer in the field of operational research, developing the first significant applications in collaboration with the Italian Navy. He was among the founders of the Italian Association of Operational Research and he created the School of Advanced Operational Research in the Faculty of Statistical Sciences in the University of Rome. As the result of collaboration between the Institute of the Calculus of Probability and the Municipality of Rome a ground-breaking study of the traffic in Rome took shape. Sadly, it was immediately shelved and forgotten, a demonstration of the fact that \"mathematical treatment is not made for managers with little skill\"\n[\nG Pompilj,\nFunzione e limiti della matematizzazione\nⓉ\n(\nFunction and Limits of Mathematical Activity\n)\n, in\nStudi di mercato\n, II\n(1962)\n, page\n14]\n. For a list of works by Pompilj, see\nTHIS LINK\n.\nHe constantly worked to make the successes of the Italian statistical school known abroad, which was unjustly neglected. An unfinished treatise on random variables, composed during a research visit to Pittsburgh, was destined to \"gather together in a single exposition that took into account the various contributions of various schools, the attained results from some researchers\n(\nand particularly those of the Rome Institute of the Calculus of Probability\n)\nin developing, reordering and completing certain contributions of C Gini to the general theory of distributions\"\n[\nG Pompilj,\nLe variabili casuali  Fasc. I: Assiomatizzazione del calcolo delle probabilità\nⓉ\n(\nRandom variables Section\n1\n: Axiomatisation of probability theory\n)\n(\nRome\n1967)\n, page\n3]\n.\nThe first of Pompilj's research contributions was in the field of algebraic geometry and continued themes dear to the Italian school, already studied by\nGuido Castelnuovo\n,\nFederigo Enriques\nand\nFrancesco Severi\n, whom he had as teachers in Rome. The topics covered by Pompilj were principally: multiple planes;\nCremona\ntransformations of the plane that possess special curves of fixed points; and families of hyperelliptical or trigonal surfaces. He also investigated Abelian varieties from an algebraic point of view, functional equivalence, surfaces whose canonical system is degenerate, and irregular surfaces. He was, together with Alfredo Franchetta\n(1916\n-\n2011)\n, the last student of\nEnriques\n. We note that Franchetta continued to undertake research in algebraic geometry and taught at the University of Rome, the University of Turin, the University of Palermo and finally at the University of Naples.\nFollowing the change in his research interests\n[\n6\n]\n:-\n... it was said that the desertion of Pompilj had resulted in a grave loss for geometry. But we must take into account the contribution that he has given to the fields in favour of which he neglected his early studies, both with research and with his work on promotion and dissemination. And one can certainly say that what he has done, leaves little room to regret what he could have done in other fields.\nIn his first statistical work,\nSulla regressione\nⓉ\n(\nOn regression\n)\n, in\nRendiconti di matematica e delle sue applicazioni\n(5)\n5\n(1946)\n,\n186\n-\n219\n, he began to develop a geometrical approach to the theory of random variables to which he returned several times in the following years. He wrote in\nTeoria affine delle variabili casuali\nⓉ\n(\nAffine theory of random variables\n)\nin\nL'Industria\nX\n(1956)\n, page\n143\n:-\nThe geometric approach to which I refer, leads to studying the properties of random variables that are invariant under the action of some subgroup or whole group of affinities.\nFormulated in this way, the study of the properties of a finite set of random variables is part of the famous Erlangen Program of\nFelix Klein\n. This is the most obvious link between the new and the old interests of Pompilj. Thanks to this geometric point of view, Pompilj, together with contributions from some of his students, was able to interpret and to extend, in the context of the theory of random variables, the statistical indicators introduced by\nGini\n, and to deepen his ideas on the theory of distributions.\nIn the work\nTeoria statistica della significatività e conformità dei risultati sperimentali agli schemi teorici\nⓉ\n(\nStatistical Theory of Significance and Conformity of Experimental Results with the Theoretical Methods\n)\n, in\nStatistica, Milano\n8\n(1948)\n,\n7\n-\n42\n, and\nSulla significatività delle costanti statistiche\nⓉ\n(\nOn the significance of statistical constants\n)\n, in\nBollettino dell'Unione\nmatematica italiana\n(3)\n4\n(1949)\n,\n112\n-\n117\n, Pompilj formulated a 'theory of conformity', an alternative to that of significance. According to Pompilj it does not make sense to consider the problem of plausibility or significance of a statistical model because, as Pompilj writes in\nLogica della conformità\nⓉ\n(\nThe logic of conformity\n)\n, in\nArchimede\nIV\n(1952)\n, page\n27\n:-\n... it is not legitimate to consider whether a model is true or false since you can always say that, strictly speaking, every model is false, because it does not coincide with reality.\nHis criticisms begin from a detailed analysis of the meaning and implications of\nBayes\n' Theorem, the foundation of the statistical induction process. Pompilj's main criticism of the theory of significance, taken from those of\nGini\n, is to confuse the 'a posteriori' probability\nP\n(\nA\n∣\nB\n)\nP(A | B)\nP\n(\nA\n∣\nB\n)\nwith the probative\nP\n(\nB\n∣\nA\n)\nP(B | A)\nP\n(\nB\n∣\nA\n)\n. His theory of conformity develops the minimum inferential theory necessary for applications to, in particular, experimental design theory\n[\n11\n]\n. Unlike the theory of significance, the theory of conformity is limited to measuring the conformity of the data collected under a certain hypothesis, refraining from giving an opinion on the probability of the hypothesis itself\n[\n6\n]\n:-\nIt was claimed that it is a step backwards when compared to other concepts, forsaking, therewith, arriving at conclusions. But as these conclusions are based on personal evaluations, not widely shared, one has the opportunity not to insist upon them.\nFor Pompilj it is necessary to depart from\nBayes\n' Theorem to also clarify the mechanisms that operate in the interpretation of facts. In\nLineamenti di una teorica della persuasione\nⓉ\n(\nOutline of a theory of persuasion\n)\n, in\nArchimede\nIII\n(1951)\n,\n135\n-\n143\n, he discusses numerous examples of how:-\n... the same facts are taken, depending on the initial ideas, in support of contrasting hypothesises ... The fact is that in many cases one has good information, objective so to speak, on the probative probabilities, while nothing is known, or almost nothing, on the 'a priori' probabilities, which are then, in turn, by each fixed in a more subjective way.\nIn other words, citing\nSei personaggi in cerca d'autore\nⓉ\n(\nSix Characters in Search of an Author\n)\nby Luigi Pirandello, \"facts are like an empty sack that does not stand without interpretation\" and as the interpretation is all in the 'a priori' judgements that we assign to the different interpretative hypothesises, that is why the same facts can be mathematically evaluated in many different ways.\nIn his concept of probability, Pompilj was close to a subjective concept, but did not completely marry it to his theses. He did not assume the 'degree of confidence in the occurrence of an event' as a definition of probability, but only as a measure of the probability itself\n[\n6\n]\n:-\nPompilj was a convinced advocator of a \"universal solidarity\" in the world in which we live \"in the same sense that everything influences and is influenced by everything else\".\n[\n'Le variabili casuali'\n<\nT\n5710\n>\n<T 5710>\n<\nT\n5\n7\n1\n0\n>\n- fasc.\n1\n, page\n12]\n. This principle, which he repeatedly reiterated in the presentation of the conceptual foundations for the processing and the interpretation of experimental results, it was one aspect of his overall vision of things which was not suffering sharp and isolated divisions, i.e. he liked the connections and overlaps of different fields; this had a positive influence on his work. From this also came his conviction of the vital link between theory and application.\nPompilj had numerous pupils and collaborators that appreciated him for his exceptional generosity and rich humanity, that were not affected despite the numerous family tragedies that marred his life. Following the death of his father in World War I and that of his brother Guido came the death of his first wife Ornella - by whom he had three children - in\n1958\n, and later on, the death of his son Frido.\nHe died in Rome on\n9\nJuly\n1968\n, due to complications following an operation for an aneurysm.\nLet us end with quoting from Giorgio Dall'Aglio\n[\n9\n]\n:-\nPompilj asked Alesandro Faedo to recommend a young researcher in analysis. I was chosen, and at the beginning of\n1956\nI moved to the Faculty of Statistics\n(\nthe full name was \"Facoltà di Scienze Statistiche Demografiche e Attuariali\"\n)\nin Rome. Thus, I had the double fortune of being offered an excellent path for my scientific career as well as finding a remarkable mentor in Giuseppe Pompilj ... Together with his students, Pompilj also did a considerable amount of more applied work. In particular, he very much supported statistical research related to medicine and science in general. One of his most important achievements was his collaboration with the Istituto Centrale di Statistica in the launch of sample surveys. He fought just as hard for the promotion of operations research, creating the Scuola di Perfezionamento in Ricerca Operativa. Pompilj was amongst the founders of the Italian Association in Operations Research. Pompilj's relevance is proven by the fact that a representative of the Istituto di Calcolo delle Probabilità was nominated as a permanent member of the scientific committee. I too, after him, received the honour of this position; but I was not interested, and quit soon after my appointment. ... In only twenty years, he had revolutionized statistics in Italian universities and created a solid group of students. More than ten of them attained a university chair; an unbelievable success considering that just one had succeeded before his death and that most of the appointed chairs were in statistics, where he never really had achieved academic authority. I remember a chat I had once with\nJimmie Savage\n, who remarked upon the scarce scientific works by Pompilj. I explained to him that most of the research conducted by his students\n(\nme in the first place\n)\nwere in fact, started by him. Pompilj was also awarded a Gold Medal of the President of the Republic for his contribution to science and culture. Let me conclude by mentioning an anecdote which demonstrates Pompilj's generous personality. Two years after my arrival, he asked me to write the third chapter of a booklet 'Piano degli Esperimenti'\nⓉ\n(\nExperiment Plan\n)\n(1959)\nwhich would discuss the plans of experiments. Although my contribution was only a small portion of the book, it was published with two authors; moreover, he said that he had received\n300\n,\n000\nITL, and one third was for me. This type of generosity was not common in Italian universities.",
  "matematicos_citados_na_biografia": [
    "Federigo Enriques",
    "Francesco Severi",
    "Guido Castelnuovo",
    "Enriques",
    "THIS LINK",
    "Alec Aitken",
    "Corrado Gini",
    "Francesco Paolo Cantelli",
    "Bruno de Finetti",
    "Gini",
    "Cremona",
    "Felix Klein",
    "Bayes",
    "Jimmie Savage"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}