{
  "nome_completo": "Alberto González Domínguez",
  "nome_curto": "González Domínguez",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dominguez/",
  "data_nascimento": "11 April 1904",
  "local_nascimento": "Buenos Aires, Argentina",
  "data_morte": "14 September 1982",
  "local_morte": "Buenos Aires, Argentina",
  "summary": "Alberto González Domínguez was a major figure in the development of mathematical sciences in Argentina. He worked on analytic functions, the theory of distributions and their application to quantum theory, the representation of functions by Fourier integrals, Laplace integrals and orthogonal series, and on probability theory.",
  "biografia": "Alberto González Domínguez\nwas the son of Julio González. Alberto was born in Argentina to a family from Andalusia in southern Spain. Manuel Balanzat writes\n[\n4\n]\n:-\nEven though by character he was totally Argentine and particularly from Buenos Aires, there were in his behaviour many of the stately traits of his lineage.\nGonzález Domínguez attended both primary and secondary schools in Buenos Aires. His first love was not for mathematics but rather he was very fond of languages when he was studying at High School, so after graduating from High School, he entered the Faculty of Philosophy and Letters of the University of Buenos Aires in\n1922\n. His interest was both in classical languages, where he studied Greek, Latin, Hebrew and Sanskrit, and in modern languages such as French, English, Italian and German. He was also interested in philosophy, grammar, lexicography and literature and he continued to maintain these interests throughout his whole life. He graduated with an arts degree in\n1928\n.\nDuring his studies at the University of Buenos Aires, González Domínguez had come into contact with the professor of mathematics\nJulio Rey Pastor\nwho had come to Argentina from Spain in\n1921\nto build up mathematics at the University of Buenos Aires.\nRey Pastor\nfounded the Mathematics Seminar in\n1928\n. He saw that González Domínguez, despite studying languages, had an interest and a talent for mathematics. With\nRey Pastor\n's encouragement, González Domínguez began to study mathematics in the Faculty of Exact and Natural Sciences of the University of Buenos Aires. He was awarded his Licentiate in Physical Sciences and Mathematics in\n1934\nbut even before this, in\n1933\n, he had been appointed as an assistant in mathematics at the Mathematics Seminar. His first paper was also published before he graduated with his Licentiate, namely\nAplicación de la teoría de las integrales singulares a la demostración de una fórmula de Stieltjes\nⓉ\n(\nApplication of the theory of singular integrals to the proof of a Stieltjes formula\n)\n.\nFrom\n1933\nonwards, González Domínguez worked in the Faculty of Exact and Natural Sciences of the University of Buenos Aires. At first, in addition to working as an assistant, he undertook research for a doctorate. He produced some outstanding research over the following years publishing the following papers:\nSobre la convergencia débil de funcionales lineales\nⓉ\n(\nOn weak convergence of linear functionals\n)\n(1936)\n,\nUna nueva demostración del segundo teorema límite del cálculo de probabilidades\nⓉ\n(\nA new proof of the second limit theorem of the calculus of probability\n)\n(1936)\n,\nSur un théorème de M Glivenko\nⓉ\n(\nOn a theorem of Glivenko\n)\n(1936)\n,\nSur les intégrales de Laplace\nⓉ\n(\nOn Laplace integrals\n)\n(1937)\n,\nGeneralización de un teorema de Cantelli\nⓉ\n(\nGeneralization of a Cantelli theorem\n)\n(1937)\n,\nSobre las series de funciones de Hermite\nⓉ\n(\nOn the series of Hermite functions\n)\n(1938)\n,\nSobre la inversión de integrales de Laplace absolutamente convergentes\nⓉ\n(\nOn the inversion of absolutely convergent Laplace integrals\n)\n(1938)\nand\nCondiciones necesarias y suficientes para que una función sea una integral de Laplace\nⓉ\n(\nNecessary and sufficient conditions for a function to be a Laplace integral\n)\n(1938)\n.\nThe\nArgentina Mathematical Union\nwas founded in September\n1936\nwhen twelve mathematicians met in the Faculty of Exact and Natural Sciences of the University of Buenos Aires. González Domínguez and\nRey Pastor\nwere two of the twelve; González Domínguez was elected secretary of the\nArgentina Mathematical Union\nand\nRey Pastor\nwas elected Vice-President for\n1936\n-\n38\n. González Domínguez continued to serve on the Board of the Union from\n1938\nto\n1945\n.\nIn June\n1939\nGonzález Domínguez submitted his doctoral thesis\nUn nuevo teorema límite del cálculo de probabilidades\nⓉ\n(\nA new limit theorem for the calculus of probabilities\n)\nto the Faculty of Exact and Natural Sciences of the University of Buenos Aires and was awarded the degree on\n7\nAugust. He expresses his thanks to\nJulio Rey Pastor\nin this thesis:-\nWe do not want to conclude without expressing the unpayable debt of gratitude that links us to our dear teacher\nJulio Rey Pastor\n. Even before I knew him, his excellent books\n(\nthe only ones in the Spanish language and comparable to the best foreign ones\n)\nand the bibliography they contained, had introduced us to modern Mathematics. Then, the years of frequenting his classes and his treatment have only increased that debt, and it is certain that without his teachings, his example, and even his suggestions, that this thesis would not have been written. There are certain debts that can neither be described nor can be repaid. Those kind are ours. That which has already been said is worth, at least, an expression of our deepest gratitude.\nWhile he was studying at the University of Buenos Aires, González Domínguez married Matilde V de Gonzalez who had been born in Buenos Aires on\n8\nDecember\n1906\n. They sailed together from Buenos Aires to New York on the ship\nBrazil\narriving on\n18\nSeptember\n1939\n. González Domínguez had been awarded a John Simon Guggenheim Memorial Fellowship to study with\nJacob Tamarkin\nat Brown University in Providence, Rhode Island, USA. The passenger list gives the following details for González Domínguez: age,\n35\n, height\n5\nft\n7\nin, complexion dark, hair colour brown, eye colour brown. For his wife Matilde V de Gonzalez, the details are: age,\n33\n, height\n5\nft\n5\nin, complexion fair, hair colour blond, eye colour brown. They returned to Buenos Aires in\n1941\n. Alberto and Matilde González Domínguez had a son Alvaro V González Domínguez born in\n1943\n.\nAt Brown University, González Domínguez worked on the\nFourier\nintegral,\nHille\nfunctions and, more generally, on integral equations. He published two articles relating to his visit to Brown University, namely\nLa Universidad de Brown\nⓉ\n(\nBrown University\n)\n(1940)\nand\nAlgunos aspectos de la vida universitaria norteamericana\nⓉ\n(\nSome Aspects of American college life\n)\n(1941)\n. For his outstanding achievements, he was awarded the Second National Science Award by Argentina in\n1940\n. In\n1946\nhe was promoted to full professor and, in the following year, he began his first spell as president of the\nArgentina Mathematical Union\nserving during\n1947\n-\n49\n. He attended the International Congress of Mathematicians held at Harvard University, USA, from\n30\nAugust to\n6\nSeptember\n1950\n. He was accompanied by his wife Matilde and his son Alvaro. He became a full member of the National Academy of Exact, Physical and Natural Sciences in\n1950\n.\nGonzález Domínguez made two research trips to Paris in the\n1950\ns. During\n1954\n-\n55\nhe worked on the theory of distributions at the\nLaurent Schwartz\nSeminar and on applications to quantum physics at the\nLouis de Broglie\nSeminar. His second visit to Paris was in\n1958\n-\n59\nwhen again he worked on the theory of distributions at the\nLaurent Schwartz\nSeminar and also lectured at the\nHenri Poincaré\nInstitute. During this visit he gave lectures at the Department of Mathematics at the University of Montpellier. In addition to his visits to Paris, he was a visiting professor at the university of Chicago, the University of Illinois Chicago, the University of California Berkeley and the University of Hawaii.\nIn addition to his work at the University of Buenos Aires, González Domínguez had other appointments which increased his influence on the development of mathematics in Argentina. He was appointed as a member of the board of directors of the National Atomic Energy Commission of Argentina in October\n1955\nand later became Head of the Mathematics Department of the Commission. The Consejo Nacional de Investigaciones Científicas y Técnicas\n(\nCONICET\n)\nwas founded in\n1958\nas a agency of the Argentine government to coordinate scientific research in Argentina. González Domínguez was a researcher at CONICET from\n1961\nonwards. He also served as Professor of Mathematical Analysis at the Higher Technical School of the Ministry of the Army and Professor of Analysis at the Military College of the Nation.\nLet us look at reminiscences about González Domínguez from a colleague and from a student. First we quote from the theoretical physicist and philosopher Mario Bunge\n(1919\n-\n2020)\nwho became a professor at the University of Buenos Aires in the\n1960\ns\n[\n6\n]\n:-\nI also befriended Alberto González Domínguez, an analyst interested in physics and engineering, open to new ideas and ever ready to help with some mathematical problem or other and offer us a cup of coffee. He introduced us to cybernetics, game theory, and the theory of distributions.\nNext we quote from\nCalixto Pedro Calderón\nwho was born on\n29\nDecember\n1939\nin Mendoza, Argentina. He was twenty years younger than his half-brother\nAlberto Pedro Calderón\n.\nCalixto Calderón\ntells us not only about González Domínguez but also paints a picture of life in the Department of Mathematics at the University of Buenos Aires in the\n1960\ns\n[\n7\n]\n:-\nMy life in Mathematics began when I transferred from The University of Cuyo, San Juan, to the University of Buenos Aires in\n1961\n. My brother\nAlberto Calderón\nhelped me economically and morally for the jump. Upon my arrival to Buenos Aires, Dr Alberto González Donnínguez\n(1904\n-\n1982)\nhelped and oriented me with the change. The first subject I took in the Mathematics Department, School of Exact Sciences, was Funciones Reales I, first course on\nLebesgue\nIntegration. Prof Evelio Oklander was the instructor.\nWith the years, I would take Complex Analysis, Ordinary Differential Equations, Funciones Reales II, Partial Differential Equations, Topology, Functional Analysis, Projective Geometry, Differential Geometry, and other important subjects. We had a first rate faculty teaching these fundamental courses. Among them I remember: Alberto Gonzalez Dominguez,\nMischa Cotlar\n,\nLuis Santaló\n, Mario Gutiérrez Burzaco, Rafael Panzone, Agnes Benedek, Miguel Herrera, and Prof Roque Carranza\n(\nstatistician\n)\n. This period was replete of personal experiences. I met mathematicians like Dr\nJulio Rey Pastor\nand\nBeppo Levi\nduring the mathematical teas that were held in the OEA building of Avenida de Mayo. A full floor had been loaned to the School of Exact Sciences of the University of Buenos Aires.\n...\nShortly before my graduation as \"Licenciado en Ciencias Matemáticas,\" I took a course on \"Boundary Values of Analytic Functions\" that was taught by Dr González Domínguez. That course was an introduction to \"mes premiéres armes\" in mathematics. Dr González Domínguez would become my thesis adviser later. I learned from him topics such as the Central Limit Theorem in Probability Theory, Introduction to Functions of\nHille\n(\nHermite\nExpansions\n)\n, Laguerre Expansions, Theory of Approximation and Theory of Distributions. He was a personality larger than life, a prodigy child that spoke\n14\nlanguages and was well versed in Philosophy, Literature and History. He would frequently cite portions of French and Spanish classic literature. One of his favourites was Baudelaire. However, the most important part of his personality was his generosity and selflessness. He had been a student of Dr\nJulio Rey Pastor\n, and after his graduation he went on a Guggenheim fellowship to Brown University, USA, to study under\nDavid Tamarkin\n. Nevertheless, the most discernible influence on him was\nEiner Hille\n's work \"A Class of Reciprocal Functions.\" That influence was passed on to me and from me on to some of my own students.\nLet us look briefly at some of González Domínguez's publications. He published\nSobre algunos puntos de la teoría matemática de los circuitos lineales\nⓉ\n(\nOn some points of the mathematical theory of linear circuits\n)\n(1950)\nwhich was awarded the First National Science Award. LeRoy MacColl begins the review\n[\n12\n]\nof this paper as follows:-\nMuch of the mathematical theory of linear circuits, as it is found in present day papers and treatises, is based upon the assumption that the circuits consist of finite collections of lumped elements. On the other hand, many of the relations obtained in the theory hold under much broader conditions. Thus there has existed some uncertainty as to just what assumptions are required for the deeper parts of the theory. The chief purpose of this paper is to clarify this point.\nMany of González Domínguez's papers arose from lectures he gave at conferences. For example, he gave the lecture\nDistribuciones y funciones analíticas\nⓉ\n(\nDistributions and analytical functions\n)\nat the 'Symposium on some mathematical problems that are being studied in Latin America' held at the UNESCO Scientific Cooperation Centre for Latin America in Montevideo, Uruguay in December\n1951\n.\nIrving Segal\nwrites\n[\n15\n]\n:-\nThe author gives a rigorous treatment of a number of singular functions employed in quantum electrodynamics, via the\nSchwartz\ndistribution theory. Some of the formulas of\nSchwinger\n,\nFeynman\nand\nDyson\nare obtained more simply in their present rigorous formulation.\nGonzález Domínguez also lectured at the 'Second Symposium on some mathematical problems that are being studied in Latin America' which was held at the UNESCO Scientific Cooperation Centre for Latin America in July\n1954\n. He gave the lecture\nSobre algunas integrales divergentes de la Electrodinámica Cuántica\nⓉ\n(\nOn some divergent integrals of quantum electrodynamics\n)\n.\nFreeman Dyson\nwrites\n[\n10\n]\n:-\nA discussion of some divergent integrals which occur in the perturbation-theory treatment of quantum electrodynamics. It is shown that these integrals can be systematically made finite by interpreting them as integrals over distributions in the sense of\nLaurent Schwartz\n.\nIn\n1959\nGonzález Domínguez published the book\nPropiedades en el contorno de funciones analíticas\nⓉ\n(\nBoundary properties of analytic functions\n)\n[\n3\n]\n:-\nAccording to the author, his principal objective in this book is to give an exposition of some results of\nV P Potapov\nwho, in a paper in\n1955\n, generalised various classical results of function theory to the case of matrices of holomorphic functions. This objective is accomplished in a brief and clear manner in the two final chapters and two appendices of this book. It is likely, however, that the book's greatest usefulness will be found in its clear and interesting account of the classical boundary behaviour and representation theorems associated with such names as\nFatou\n,\nHerglotz\n,\nPlessner\n,\nJulia\n,\nCarathéodory\nand\nRolf Nevanlinna\n.\nIn\n1964\n, in collaboration with Carlos Bollini and Juan Jose Giambiagi, González Domínguez wrote the paper\nAnalytic regularization and the divergences of quantum field theories\n. The authors give the following Abstract\n[\n5\n]\n:-\nWe present a method of analytic regularization with which any element of the S-matrix becomes an analytic function of a complex parameter. The usual divergences appear simply as poles at the physical value of the parameter. The subtraction of these poles leads to the usual finite parts. A simple example is discussed, in which the mathematical justification for these subtractions is given. In the consideration of this example we discuss the causal\nGreen\n's functions of the iterated D'Alembertian. They are constructed from the retarded and advanced solutions introduced by\nM Riesz\n. The application to the self-energy of the electron is explicitly given. An heuristic deduction is then used to convert the problem of the evaluation of the self-energy into the problem of solving a differential equation. The self-energy integral is a formal solution of the latter equation, the finite part\n(\nwith the pole subtracted\n)\nbeing a rigorous solution.\nGonzález Domínguez retired in\n1971\nand the\nRevista de la Unión Matemática Argentina\nⓉ\n(\nJournal of the Argentine Mathematical Union\n)\npublished the\n448\n-page volume\n25\ncontaining papers to honour his\n65\nth birthday. The volume begins with a\nDedicatoria\nⓉ\n(\nDedication\n)\n[\n9\n]\n:-\nThe performance of Professor González Domínguez in the Argentine Mathematical Union has been continuous and fundamental: founding member, several times President and always the soul of its Directive Commissions. The creation and subsistence of the\nArgentine Mathematical Union\nand its Journal, although it has always had the encouragement of many, has been the tenacious and persevering work of a few, among whom Professor González Domínguez occupies an exceptional place.\nFrom any angle you look at it, Argentine Mathematics has revolved in the last fifty years around the work of\nRey Pastor\nand his main collaborator and continuator González Domínguez. Nothing is born spontaneously and behind the realities achieved and the promising perspectives that are glimpsed for mathematics in the country, the solicitous and careful hand is perceived, the protective shadow of Professor González Domínguez, always present to iron out rough edges, proclaiming compromise in the relational life, firmly maintaining the seriousness and level of scientific work, putting order in value judgments and putting people and things in their place, subtle and delicate work that can only be done when you have sufficient scientific authority and an inexhaustible effective capacity to give love by the hand full and to absorb ingratitude without fainting, although not without pain.\nWe have mentioned above some honours given to González Domínguez for his outstanding contributions. Here are a few more: the Abraham Mibashan Prize awarded by the Consejo Nacional de Investigaciones Científicas y Técnicas\n(1960)\n; the Ordre des Palmes académiques awarded by the French Government\n(1964)\n; the Concejo Deliberante de la Ciudad de Buenos Aires\n(1969)\n; the Laurel de Plata awarded by the Ateneo Rotario\n(1975)\n; and honorary membership of the\nArgentina Mathematical Union\n(1976)\n.\nAfter he retired from the University of Buenos Aires, González Domínguez took on other roles. In particular he was the first director of the Argentine Institute of Mathematics, a position he held from\n1973\nuntil his death in\n1982\n. He remained an active researcher until his death. In fact his last paper, a joint work with Osvaldo Capri,\nOn operator-valued analytic functions with positive real part whose logarithm belongs to a\nC\np\nC_{p}\nC\np\n​\nclass,\nwas published in\n1984\n, two years after his death.\nLet us end with the following tribute by Manuel Balanzat\n[\n4\n]\n:-\nTo finish we will point out that the key characteristics of his personality were kindness and generosity, qualities that he lavished on his friends and also on those who were not so; he knew how to forgive ingratitude and forget grievances. In short, González Domínguez was a wise man and a good man who dedicated his life to doing science and promoting the development of mathematics in Argentina. As every authentic master wanted to be surpassed by his disciples, their triumphs were his greatest satisfaction; all of them know how to continue his work and take Argentine mathematics to higher and higher levels.",
  "matematicos_citados_na_biografia": [
    "Julio Rey Pastor",
    "Rey Pastor",
    "Argentina Mathematical Union",
    "Jacob Tamarkin",
    "Fourier",
    "Hille",
    "Laurent Schwartz",
    "Louis de Broglie",
    "Henri Poincaré",
    "Calixto Pedro Calderón",
    "Alberto Pedro Calderón",
    "Calixto Calderón",
    "Alberto Calderón",
    "Lebesgue",
    "Mischa Cotlar",
    "Luis Santaló",
    "Beppo Levi",
    "Hermite",
    "David Tamarkin",
    "Einer Hille",
    "Irving Segal",
    "Schwartz",
    "Schwinger",
    "Feynman",
    "Dyson",
    "Freeman Dyson",
    "V P Potapov",
    "Fatou",
    "Herglotz",
    "Plessner",
    "Julia",
    "Carathéodory",
    "Rolf Nevanlinna",
    "Green",
    "M Riesz",
    "Argentine Mathematical Union"
  ],
  "imagens": [
    "dominguez.jpg"
  ]
}