{
  "nome_completo": "Gonzalo Pérez Iribarren",
  "nome_curto": "Gonzalo Pérez Iribarren",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iribarren/",
  "data_nascimento": "26 June 1936",
  "local_nascimento": "Carmelo, Uruguay",
  "data_morte": "27 August 1998",
  "local_morte": "Montevideo, Uruguay",
  "summary": "Gonzalo Pérez Iribarren was a Uruguayan mathematician and statistician who was forced to spend ten years in exile during the right-wing dictatorship beginning in 1973 . He returned to Uruguay in 1983 and was the main force in rebuilding the Institute of Mathematics and Statistics and setting up the Basic Sciences Development Programme.",
  "biografia": "Gonzalo Pérez Iribarren\nwas born in Carmelo, Uruguay about\n200\nkm north east of Montevideo. He had an older brother Ricardo Pérez Iribarren who played a large role in Gonzalo Pérez's life and we shall say more about him later. Gonzalo Pérez was brought up in Carmelo, where he lived in an apartment on the banks of the Arroyo de las Vacas, a water course that flows into the Río de la Plata at Carmelo. Later in life he would still talk about the sunsets on the banks of Arroyo de las Vacas. Most of Gonzalo Pérez's schooling took place in Carmelo but in the\n1950\ns he went to study in Montevideo for the second cycle of Secondary Education. Let us note at this point that Gonzalo Pérez had the nickname \"Flaco\" or \"El Flaco\", meaning \"the skinny one\" and his colleagues often referred to him with this nickname when speaking about him.\nIribarren was interested in studying mathematics but this was only possible in the Faculty of Engineering which he entered. In\n1957\n, while still studying for his degree, he began teaching mathematics in a high school.\nMario Wschebor\n(1939\n-\n2011)\nwas part of a group of friends studying at the University of the Republic in Montevideo which included Carlos Aragone\n(1937\n-\n1994)\nwho later became a professor of physics.\nWschebor\nwrites\n(\n[\n17\n]\nor\n[\n18\n]\n)\n:-\nThe youthful atmosphere of the time had a strong philosophical tint. We were motivated by universal dilemmas; the discussion was extensive and generally unyielding and informed. ... Gonzalo participated in the questions and the searches that could never leave him. ... After that initial time, driven by his faith, he abandoned his studies and his job as a teacher and entered the Jesuit Seminary, first in Uruguay and then in Rome.\nIribarren was a seminarian in Rome and studied theology, Greek and Latin. He then had a long stay in Germany where he learnt English and German. These were the years of Pope John XXIII and the Second Vatican Council, which brought in major changes in doctrine and also in the approach of the Catholic Church to society. Iribarren was deeply involved in these religious events but was never ordained as a priest. After about eight years away from Uruguay, he returned and married Beatriz Sierra and they started their large family.\nIn the mid\n1960\ns, Gonzalo Pérez Iribarren's brother, Ricardo Pérez Iribarren, was the Director of the Institute of Electrical Engineering of the Faculty of Engineering in Montevideo. One of his assistants writes:-\nWorking with Ricardo Pérez was very stimulating, he was constantly aware of what each of his assistants had in hand, he created study groups on semiconductors, an area that at that time was absurdly ignored in the programs, he proposed projects that allowed us to train and move in that direction, and maintained the unity of the Electronics group.\nRicardo Pérez was one of the first to recognise that, \"The world is digital\", and he introduced digital techniques into both teaching and research. Enrique Cabaña writes\n[\n2\n]\n:-\nAt the time that Gonzalo undertook his religious studies, I and many others stopped seeing him for many years. At that time I was a student of Ricardo his brother, I was a friend to Ricardo, Ricardo meant to me a symbol of the best that I would like to be and aspire for the University, and he continues to mean this. In March\n1968\n, however, a new tragedy, the accident that left Ricardo dead and Gonzalo seriously injured.\nIt is impossible to say whether the death of his brother made Gonzalo Pérez change his direction in life, perhaps he himself would not have known whether this was the case, but change direction he did. In\n1969\nhe was appointed as a Grade\n1\nAssistant in the Mathematics Institute in Montevideo working\n20\nhours a week and he remained in that position until\n1971\nwhen he was promoted to Grade\n2\nAssistant working\n30\nhours a week. Enrique Cabaña said\n[\n2\n]\n:-\nWhen Gonzalo came to work at the Mathematics Institute of the Faculty of Engineering, he brought an important dose of freshness, of authenticity, which did a lot of good for those of us who worked with him, for those of us who studied with him at that time.\nThings changed dramatically in\n1973\n.\nJosé Luis Massera\nsaid\n[\n9\n]\n:-\nThe right-wing military coup of June\n1973\nwas being prepared. In the Faculty of Engineering, where another great friend, engineer Julio Ricaldoni, was Dean, there was an explosive accident that was attributed to left-wing students, the University was involved, almost all the Deans were imprisoned, including Ricaldoni, for several years. Many prominent intellectuals and militants were killed; others were able to go into exile in countries of America and Europe. The Mexican embassy was home to many refugees who later lived in the country for many years and profess a deep love for Mexico. Most of the mathematicians went into exile.\nIribarren fled, with several other Uruguayan mathematicians, to the University of Buenos Aires where they were given work. Former president of Argentina, Juan Perón, returned in June\n1973\nand in September\n1973\nhe was again elected President. When he died, his wife Isabel Perón took over. After eight months working at the National University of Buenos Aires the Uruguayans lost their jobs as Isabel Perón's government purged most leftists from university posts. Iribarren remained in Buenos Aires for a while using his mathematical skills to work for both public and private companies. A rebellion against Isabel Perón began on\n18\nDecember\n1975\nwhich led to a coup by Jorge Rafael Videla on\n24\nMarch\n1976\n. Iribarren saw what was coming in December\n1975\nand left with his family eventually settling in Maracaibo, a city a northwest Venezuela. There he was appointed as a Professor in the Mathematics Department of the Experimental Faculty of Sciences at the University of Zulia.\nIribarren's unusual route into teaching mathematics at university level meant that he had no degree. He was awarded a first degree while in Buenos Aires, then began research for a doctorate with Enrique Mario Cabaña Pérez who had been a colleague in Montevideo before the\n1973\ncoup, then had fled to Venezuela where he was working at the Universidad Simón Bolívar. Iribarren's time in Venezuela had good and bad aspects\n(\n[\n17\n]\nor\n[\n18\n]\n)\n:-\nThe overwhelming experience of the tropics inspired his surprised tales of a transplanted southerner, in that world with such different rules. It also allowed him to return to old loves: to paint, as he had done intensely in his youth, and he would not stop doing it for the rest of his life. He also experienced great sadness, the death of a small son, as a result of a devastating illness.\nBy\n1983\nthere were signs that the military dictatorship of Uruguay was moving towards democracy. Iribarren returned with his wife and large family to Colonia in Uruguay in that year but with no regular employment, he made money giving private tuition. He also continued his hobbies of painting, and writing short stories and poems. He made regular visits to Montevideo and began discussions about the creation of a Programme for the Development of Basic Sciences. This was a dangerous move for someone in his position but he came to no harm. In\n1984\nhe was appointed as a Grade\n4\nProfessor with\n40\nhours a week in the Faculty of Engineering at Montevideo, became Director of the Institute of Mathematics and Statistics, and began to collaborate with colleagues to rebuild mathematics during the difficult times of the transition to democracy. He later went on to work at the Mathematics Centre. Ernesto Mordecki explained how Iribarren rebuilt the Institute of Mathematics and Statistics\n[\n11\n]\n:-\nGonzalo was the first university academic that I met who acted, a university academic in the sense of the term that we give to that word in our University of the Republic, and it was obvious that he was very different from all the people that I had met before in the Faculty, with all those characteristics of commitment, drive, desire that Gonzalo put in at that moment, that was breathed, that was seen. The first measures he took, which for us were surprising: he applied for scholarships for students, to study mathematics ... Gonzalo took two very important initiatives, he gave the first courses on Probability, Statistics and Stochastic Processes and assigned a room for the Seminars ... I remember the topic of the first seminar, we studied\nFeller\n's book ...\nElvio Accinelli\n(\nborn\n1955)\nwas a mathematics undergraduate at the University of the Republic from\n1984\nto\n1989\n. He witnessed Iribarren rebuilding the Institute of Mathematics and Statistics\n[\n1\n]\n:-\nAt the Institute of Mathematics and Statistics, mathematicians and students from different places, with very diverse and very rich cultural and scientific backgrounds, began to coexist. There were those who had returned from exile, those who had just left prison, those who had begun their university life under the intervention, and others who, arriving by different paths, began to form part of that community. Being director of the Institute of Mathematics and Statistics required contemplating all this diversity without losing its richness, giving each one a place, a possibility, without frustrating hopes or vocations, and Gonzalo achieved this. He convinced us that, as long as we worked consistently to master mathematics, it was enough to have a vocation for this science in some of its manifestations to have a place there. Gonzalo was a true goldsmith of feelings and passions, a master to listen to, and who listened, opening doors, looking for paths. The warm person that we found in the Institute of Mathematics and Statistics was the same one that we found in his house with open doors at all times. With Gonzalo we talked not only about mathematics, we talked about hopes, about cinema, about future possibilities and present probabilities, about literature. He was a good writer, his short stories were luminous, they were about people, with polished and clear language ...\nPerhaps Iribarren's greatest achievement was setting up the Basic Sciences Development Programme\n(\nPEDEClBA\n)\nsponsored by UNESCO. This was created in October\n1986\nby an agreement between the Uruguayan Government, represented by the Ministry of Education, and the University of the Republic with the active participation of the Programme of the United Nations for Development. PEDEClBA had three main objectives:\nCreate and maintain a scientific platform capable of supporting the development of Basic Sciences and technological development.\nSupport the training of high-level professionals in the various scientific-technical disciplines.\nActively participate in the consolidation of the scientific and cultural fabric of Uruguay.\nGonzalo Perera\n(\nborn\n1966)\nspoke about his first meeting with Iribarren\n[\n14\n]\n:-\nWhen I met him, I was very young, I was just\n19\nyears old. I met him for family reasons; I was a chemistry student, I had met a professor of mathematics at the Faculty of Chemistry, now deceased, Victor Decmzylo, who had lent me\nWalter Rudin\n's \"Real and Complex Analysis\". ... through a family connection, through Marisa Garcia, Gonzalo heard about my unusual interest in this subject. Gonzalo invited me to go to his house one summer weekend to chat with him. ... when I left there, walking towards my house, I was convinced that I wanted to do mathematics, that I was going to be a mathematician.\nIribarren ran the Probability and Statistics Seminar and in\n[\n14\n]\nGonzalo Perera tells how he came to attend that Seminar:-\nI was studying the third year of my degree, and I was thinking of doing the Seminar required in the Bachelor's plan in the last year of my degree, in my fourth year. ... I came to the Institute of Mathematics and Statistics to return a book that they had lent me. Coincidence of coincidences! At the same time, the Seminar on Probability and Statistics was meeting for the first time that year to set working hours and an agenda. Gonzalo Pérez stopped me in the corridor and told me, \"You have to come to the Seminar!\" I told him no, next year, but not now ... We were in front of the seminar room, the door was open and at a certain moment, Gonzalo puts his hand on my shoulder and gives me a tremendous push, he moves behind me, closes the door and says in a loud voice \"Here's a new Seminar colleague!\"\nGiven his extraordinarily difficult task in rebuilding the Institute of Mathematics and Statistics, it is not surprising that Iribarren did not have a great deal of time for research. He did, however, publish three major papers in\n1991\n-\n92\n, namely\n[\n6\n]\n,\n[\n7\n]\nand\n[\n10\n]\n. Let us give the Abstracts of these three papers.\n(\ni\n)\nConservative Confidence Bands for Nonparametric Regression\n[\n6\n]\n:-\nIn this paper conservative confidence bands for the regression function, closely related to those proposed by Hall and Titterington\n(1988)\nare considered. However we allow to appear dependence between the local averages which will lead to more efficient confidence bands. Confidence bands based on local medians are also considered and for both cases we find optimal choices of the number of observations to use at each cell and the number of subintervals to be considered. A comparison between both methods is given and some examples are considered. The proposal is very simple and gives confidence bands for which calculation of widths is very easy.\n(\nii\n)\nNonparametric Regression Estimation in Models with Weak Error's Structure\n[\n7\n]\n:-\nIn this paper we propose nonparametric estimates of the regression function and its derivative when it is only assumed a weak error's structure. We study their local and global asymptotic behaviour when we observe dependent trajectories.\n(\niii\n)\nStreamflow in Southeastern South America and the Southern Oscillation\n[\n10\n]\n:-\nThe relationship between the Southern Oscillation\n(\nSO\n)\nand streamflow in two major rivers of southeastern South America\n(\nNegro and Uruguay rivers\n)\nis explored for the period\n1909\n-\n1989\n. It is found that streamflow in both rivers has a clear tendency to be below average in the period from June through December in high SO index years\n(\ncold events in the equatorial Pacific Ocean\n)\nand a slight tendency to be above average in the period from November through the next February in ENSO years. These findings are in broad agreement with previously proposed associations between extremes in the Southern Oscillation and rainfall variability in southeastern South America.\nEnrique Cabaña spoke about Iribarren's influence on those around him\n[\n2\n]\n:-\nGonzalo was a reference, capable of helping everyone in situations with difficult solutions, with advice, or with a simple sensible comment. Surely his admiration for Saint Augustine and for Saint Francis were not unrelated to his own knowledge and his own kindness. Once he told me that, in cases of doubt, he opted for the solutions that gave him peace.\nErnesto Mordecki is full of praise for Iribarren's character\n[\n11\n]\n:-\nI think that Gonzalo was a distinguished person, outstanding, different, we are all different, but he was extreme in some characteristics that, in my view, were his generosity in a broad sense of that word, individual generosity in dealing with his colleagues, and for all humanity, I would say, he was extremely honest, he had a culture that young people, I would not say surprised us, but overwhelmed us, a person who knew the origin of words, that he had studied Latin, but he was in charge yet not moving us away but rather of approaching us, he was extremely tenacious and had like a halo of energy, of gifts, a very special thing, very dear, very dear, that in the dark that I lived in the Institute, impregnated him, not only him, but fundamentally the space around him. I remember it as a space of light.\nIribarren died when only\n61\nyears of age. He was remembered by his colleagues in a meeting at the Universidad de La República in Montevideo and many of the references we give are talks delivered at this meeting.",
  "matematicos_citados_na_biografia": [
    "Mario Wschebor",
    "Wschebor",
    "José Luis Massera",
    "Feller",
    "Walter Rudin"
  ],
  "imagens": [
    "iribarren.jpg"
  ]
}