{
  "nome_completo": "Lars Göran Borg",
  "nome_curto": "Göran Borg",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borg/",
  "data_nascimento": "19 November 1913",
  "local_nascimento": "Kumla, Närke, Sweden",
  "data_morte": "6 January 1997",
  "local_morte": "Bromma, Stockholm, Sweden",
  "summary": "Göran Borg was a Swedish mathematician who worked in differential equation theory.",
  "biografia": "Göran Borg\nwas the son of Johan Erik Zakarias Borg\n(1880\n-\n1953)\nand Elna Peterson\n(1887\n-\n1974)\n. Erik Borg married Elna on\n18\nOctober\n1910\n. Their daughter Gunni Lovisa Borg\n(1912\n-\n1989)\nwas born on\n2\nApril\n1912\nin Kumla and their son, Göran Borg, the subject of this biography, was born about\n18\nmonths later.\nOn\n1\nOctober\n1939\n, Göran Borg married Gunborg Maria Sjølinder\n(\nborn\n26\nAugust\n1910\n- died\n23\nMarch\n1992)\nat Nora bergsförsamling, Örebro, Sweden. Gunborg Maria was the daughter of Natanael Sjølinder\n(\nborn\n6\nApril\n1875)\nand Hulda Fredrika Gustafsson\n(\nborn\n19\nJanuary\n1879)\n. Göran and Gunborg Borg had three children, Erik Lars Natanael Borg\n(\nborn\n10\nDecember\n1940)\n, Sven Erik Göran Borg\n(\nborn\n30\nJanuary\n1943)\nand Anna-Karin Borg. We note that Erik Borg\n(\nborn\n1943)\nbecame a famous Swedish audiologist.\nBorg studied at the University of Uppsala and by the time his first child was born in\n1940\nhe had the degree fil.lic.\n(\nLicentiate of Science\n)\n. His wife at this time has the degree med.lic. By the time his second son was born in\n1943\n, Borg had the degree fil.mag.\n(\nMaster of Science\n)\n. At Uppsala his doctoral studies were supervised by\nArne Beurling\n. Borg was awarded his Ph.D. in\n1945\nfor his thesis\nEine Umkehrung der Sturm-Liouvilleschen Eigenwertaufgabe: Bestimmung der Differentialgleichung durch die Eigenwerte\nⓉ\n(\nA Reversal of Sturm-Liouville's Eigen Value Problem: Determination of the Differential Equation by the Eigenvalues.\n)\n. He published a\n97\n-page paper, which was essentially his thesis, in\nActa Mathematica\nin\n1946\n. Harry Pollard writes in a review of the paper\n[\n6\n]\n:-\nThe usual\nSturm\n-\nLiouville\nproblem consists in determining the spectrum for a differential equation\ny'' + (\\lambda + \\phi(x)) = 0\nwhen the boundary conditions are given. The present paper studies the inverse problem of recovering φ\n(\nx\n)\nwhen the spectrum and the boundary conditions which give rise to it are known. For example, the problem of discovering the equations of a string from a knowledge of the fundamentals and overtones is of the inverse kind. The conclusions are as follows.\n(\ni\n)\nThe solution of the inverse problem is not unique in general.\n(\nii\n)\nThe solution is unique if it is prescribed that\n\\phi(x) = \\phi(\\pi - x)\n, provided that the boundary condition has one of the forms\ny\n(\n0\n)\n=\ny\n(\nπ\n)\n=\n0\ny(0) = y(\\pi) = 0\ny\n(\n0\n)\n=\ny\n(\nπ\n)\n=\n0\nor\ny\n′\n(\n0\n)\n=\ny\n′\n(\nπ\n)\n=\n0\ny'(0) = y'(\\pi) = 0\ny\n′\n(\n0\n)\n=\ny\n′\n(\nπ\n)\n=\n0\n.\n(\niii\n)\nTo an arbitrary\nSturm\n-\nLiouville\nproblem corresponds an associated one with the following property: if the spectrum of the associated problem is known in addition to the prescribed one, then φ\n(\nx\n)\nis uniquely determined. The chief tools used in the proofs are the theory of\nFourier\nseries and\nvon Koch\n's theory of infinite determinants. The paper concludes with a study of physical applications; in particular, it is shown that under appropriate conditions the string problem mentioned above has a unique solution.\nA detailed discussion of the contents of Borg's thesis is given in\n[\n4\n]\n.\nBorg attended the Tenth Scandinavian Mathematical Congress held in Copenhagen, Denmark, in July\n1946\nand delivered the paper\nInverse problems in the theory of characteristic values of differential systems\nwhich was published in the\nProceedings\nof the Congress. In this, Borg surveyed the results of his thesis and indicated extensions to problems which are not self-adjoint.\nThe publication of his thesis was not Borg's first paper, for he had published\nÜber die Stabilität gewisser Klassen von linearen Differentialgleichungen\nⓉ\n(\nOn the Stability of Certain Classes of Linear Differential Equations\n)\nin\n1944\n. After the award of his doctorate, Borg was appointed as a docent at the Mathematical Institute of the University of Uppsala in\n1945\n. He published papers such as\nBounded solutions of a system of differential equations\n(1948)\n,\nOn a Liapounoff criterion of stability\n(1949)\n,\nOn the completeness of some sets of functions\n(1949)\n, and\nÜber die Ableitung der S-Funktion\nⓉ\n(\nOn the derivation of the S function\n)\n(1950)\n.\nIn July\n1950\n, Borg and his wife Gunborg sailed on the Gripsholm from Gothenburg, Sweden, to New York, USA, arriving on\n27\nJuly. They gave their address in the United States as c/o\nLars Ahlfors\n, Harvard University, Boston. At this time\nAhlfors\nwas the Chairman of the Mathematics Department at Harvard University. Borg was going to the International Congress of Mathematicians held in Cambridge, Massachusetts from\n30\nAugust\n30\nto\n6\nSeptember\n1950\n. He was one of eight Swedish mathematicians attending this Congress; others included\nArne Beurling\n,\nLennart Carleson\nand\nHarald Cramér\n. At the Congress Borg presented the paper\nAn inversion formula\nto the Mathematical Physics and Applied Mathematics Section on\n4\nSeptember and it was published in the\nProceedings\nof the Congress. Borg and his wife sailed from New York on the Stavangerfjord on\n12\nSeptember\n1950\n, the ship being bound for Oslo, Norway.\nIn\n1953\nBorg was appointed as Professor of Mathematics at the Royal Institute Technology in Stockholm. Jan Boman writes in\n[\n2\n]\n:-\nAfter gymnasium I went to a physics program at the Royal Institute of Technology, KTH, in Stockholm. After graduation from KTH in\n1955\nI began higher studies in mathematics at KTH; a number of inspiring mathematics teachers at KTH such as\nÅke Pleijel\n, Tord Ganelius, and Göran Borg may have contributed to my choice of mathematics. In\n1959\nI took the degree of Teknologie Licentiat with mathematics as major subject. My advisor was Göran Borg, a former\nBeurling\nstudent who had made ground-breaking contributions to the inverse spectral problem for\nSturm\n-\nLiouville\noperators.\nBorg attended the International Congress of Mathematicians held in Amsterdam from\n2\nSeptember -\n9\nSeptember\n1954\n. He gave the talk\nOn Spectral Properties of a System of Infinitely Many Differential Equations\n. He gives the following abstract:-\nThe report will contain generalizations of spectral representation theorems and converse spectral theorems, corresponding to those, given by Martjenko,\nGelfand\n, Levitali,\nKrein\n,\nLevinson\nand the present author for the second order ordinary differential equation.\nAt a session on\n28\nOctober\n1958\nthe Swedish National Committee for Mathematics decided to accept the invitation, conveyed by the\nInternational Mathematical Union\n, to organise the next International Congress of Mathematicians in Stockholm in\n1962\n. This decision was endorsed by the\nSwedish Mathematical Society\non\n30\nNovember\n1958\nand a joint invitation was issued to the mathematicians of the world, signed by the chairmen of the National Committee for Mathematics and the\nSwedish Mathematical Society\n,\nÅke Pleijel\nand Göran Borg repecticely.\nMathSciNet lists eleven papers by Borg, the last\nA condition for the existence of orbitally stable solutions of dynamical systems\nbeing published in\n1960\n. From the early\n1950\ns he seems to have moved away from mathematics research and taken on many administrative tasks. He was Dean of the Royal Institute Technology Section of Technical Physics\n1958\n-\n1963\n, Head of the Department of Mathematics\n1967\n-\n1968\n, and Rector of Royal Institute Technology from\n1968\nto\n1974\n. He also made many important contributions outside the Institute, particularly in linking university applied mathematics with mathematical applications to industry. Let us note three of these in particular.\nFirst we mention the Swedish Natural Science Research Council\n[\n7\n]\n:-\nOne of the more important government research councils in Sweden is the Natural Science Research Council controlling allocated federal research funds used primarily for temporary support, filling in \"gaps\" in the research front, strengthening weak points in research, providing \"emergency\" money, etc. Thus this particular research support is particularly significant because it is so carefully directed, rather than because of the money involved. The support to fundamental research in natural sciences and mathematics includes fellowships, scholarships, and specific institutional support. ... new Council membership as of July\n1\n,\n1962\n: ... Professor Göran Borg ... .\nThe Swedish Institute of Applied Mathematics was founded in\n1971\nwith Borg playing an important role in forming the Institute and serving on the Board from the start. Germund Dahlquist tell us about this Institute in\n[\n3\n]\n:-\nThe Swedish Institute of Applied Mathematics, the ITM, was formed in\n1971\nto strengthen the Swedish efforts to develop applicable mathematics important to industry and government . ITM is an acronym for the Swedish name \"Instituted for Tillampad Mathematik\". The word \"institute\" is perhaps a misleading name for the strongly decentralized activity of the ITM. The institute operates mainly as a link for information and project cooperation between researchers, chiefly graduate students, in different specialties at the eleven universities of our country.\n(\nWe include here the five Institutes of Technology.\n)\nThe population of Sweden is approximately\n8\n,\n000\n,\n000\n. In the sixties, some Swedish industrialists realized that there was much to be gained from increased research in applicable mathematics with a strong link to real world problems in the operating, planning and construction departments of their companies. A great deal had recently happened, with vast potentialities for the future: think of computers, control theory, operations research etc. They felt that problems existed, for which no single company could establish resources sufficient for the development of the necessary new methods. At the same time, several university mathematicians also felt the need for improving the existing occasional contacts between university and industry. In particular Professors Ulf Grenander\n(\nmathematical statistics\n)\nand Göran Borg\n(\nmathematical analysis\n)\nwere instrumental in the formation of the ITM. Grenander is nowadays active at Brown University, but he still stimulates the ITM with his ideas and comments on its activities. Borg is a member of the board of the Institute.\nThe third contribution of Borg's that we wish to highlight is his role as a Board Member of the L M Ericsson Telephone Company\n1972\n-\n1980\n. While in that role he took part in the\n7\nth International Teletraffic Congress held in Stockholm\n13\n-\n20\nJune\n1973\n. His role was mentioned in the Opening Address by the Chairman Dr C Jacobaeus\n[\n1\n]\n:-\nAs a representative of the Swedish Telephone Industries, the other main sponsor, we welcome Professor Dr Göran Borg of L M Ericsson. Göran Borg is a board member of L M Ericsson and he is also Dean of the Royal Institute of Technology here in Stockholm. Being a mathematician himself, Professor Borg has a good insight and knowledge of our problems and working methods. He has also taken a deep interest how these matters are treated at the university level.\nAt this Opening Session, there was the following 'Address by Professor Dr Göran Borg, Board Member of the L M Ericsson Telephone Company':-\nLadies and Gentlemen, As a representative for one of the main sponsors, the Swedish Telephone Industries, I want to underline the importance we in the industry lie on the research in telecommunication traffic. It is, of course, evident already from the fact that we over the years have spent and are spending a lot of money in this area. We think also that all efforts here have been most rewarding. As a basis for the system engineering it has given us the means to develop above all switching systems with a good economy. It has had an importance that has been felt throughout the industry and of course also for the many undertakings that the Swedish telecommunications industry has abroad. For myself, as Dr Jacobaeus said, as Dean of the Royal Institute of Technology and as mathematician it has been of a special interest to follow an activity that so evidently links pure science with technology. The interplay between the engineers and the mathematicians is very intense. In fact many engineers have acquired a good competence in mathematics and many mathematicians have got an expert knowledge in switching systems and their behaviour. I think that this kind of cooperation has moved the frontiers of telecommunication ahead. Certainly, we would like to see the same in other areas of technology. With these words I would like to join in with all other wishes of welcome to the delegates and their associates. I wish this congress very good success with its undertakings and hope that the results that will be reached here shall be to the future benefit for the development of telecommunications.\nIn fact Borg served on numerous other committees, for example, on\n12\nJanuary\n1968\nhe was appointed to the Committee for Television and Radio in Education\n(\nTRU Committee\n)\n. At this time he was rector of the Royal Institute Technology.\nIn\n1976\nBorg retired from his professorship at the Royal Institute Technology, Stockholm, but continued to undertake several other roles, for example as a committee chairman of the SNS Development Council during\n1978\n-\n1980\n. SNS, the Centre for Business and Policy Studies, was founded in\n1948\nby a group of young business leaders with a common belief in social science as a tool for economic and social progress. Since its foundation SNS has played a central role in shaping Swedish policy and bringing Swedish policy lessons to the international policy making community. Borg was one of the contributors to the publication\nStrategier för förnyelse: kunskap som nydanare av teknik och industri\nⓉ\n(\nStrategies for renewal: knowledge as innovators of technology and industry\n)\n(\nStockholm Studieförb,\n1980)\n. The problems of Swedish industry in the\n1970\ns was a constantly recurring theme in the media. In March\n1978\na committee was set up by the government to make recommendations and it published\nVägar till ökad välfärd\nⓉ\n(\nRoads to increased welfare\n)\n(1979)\n:-\nThe engineering chapters were to a large extent based on analysis work within a working group led by Professor Göran Borg at the Royal Institute of Technology\n(\nKTH\n)\n.\nBorg was honoured with election as chairman of the\nSwedish Mathematical Society\n, serving\n1957\n-\n1960\n, election to the Royal Swedish Academy of Engineering in\n1962\nand being awarded the Honorary degree of Doctor of Laws by the University of Dundee, Scotland, on\n12\nJuly\n1971\n.",
  "matematicos_citados_na_biografia": [
    "Arne Beurling",
    "Sturm",
    "Liouville",
    "Fourier",
    "von Koch",
    "Lars Ahlfors",
    "Ahlfors",
    "Lennart Carleson",
    "Harald Cramér",
    "Åke Pleijel",
    "Beurling",
    "Gelfand",
    "Krein",
    "Levinson",
    "International Mathematical Union",
    "Swedish Mathematical Society"
  ],
  "imagens": []
}