{
  "nome_completo": "Gordon Bamford Preston",
  "nome_curto": "Gordon Preston",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Preston/",
  "data_nascimento": "28 April 1925",
  "local_nascimento": "Workington, England",
  "data_morte": "14 April 2015",
  "local_morte": "Oxford, England",
  "summary": "Gordon Preston was an English mathematician who worked at Bletchley Park in World War II. He was an important worker in semigroup theory.",
  "biografia": "Gordon Preston\nwas brought up in Carlisle, in the north west of England. He won an open scholarship to Magdalen College Oxford in\n1943\nbut although the war was drawing to close by this time, he could not complete his studies at Oxford but undertook war service. In common with other bright mathematics undergraduates, Preston went to Bletchley Park, Buckinghamshire, a government research centre north of London. The work there was all aimed at cracking German codes and Preston worked there with Alan\nTuring\n[\n3\n]\n:-\nAfter spending one year at Oxford in\n1943\n/\n4\n, I was called up for war service, volunteered for the navy, and was drafted to work for the foreign office at Bletchley Park. There, I was with a small group of about twenty mathematicians, assisted by about\n250\nWRENS, in what was called the Newmanry.\nM H A Newman\n, the MHAN, was the head of this group, and the assistant head was\nShaun Wylie\n. Other members included\nHenry Whitehead\n,\nDavid Rees\n, Michael Crum, Donald Nichle - not a mathematician by training -, I J\n(\nJack\n)\nGood.\nJ A\n(\nSandy\n)\nGreen\n, Joe Gillis, Howard Campaign - a good poker player. Philip Watson\n(\nPhilip and I had come together from Oxford\n)\n, A\n0\nL\n(\nOliver\n)\nAtkin, and Michael Ashcroft. We had a research session, so far as I recall, on Monday afternoons and a research log book in which, at any time, ideas were recorded. This was my first experience of research - it was a mixture of algebra and statistics, or probability theory, and I greatly enjoyed it. I also got to know well\nP J\n(\nPeter\n)\nHilton\nand\nA N\n(\nAlan\n)\nTuring\n. With\nTuring\nI spent uncountable hours playing Go, as also with\nDavid Rees\n.\nIn\n1946\nPreston returned to Oxford to complete his undergraduate studies and he graduated with first class honours in mathematics in\n1948\n[\n3\n]\n:-\nI took finals at Oxford in\n1948\nwith a syllabus that I and most of my contemporaries regarded as impossibly out of date. We could use final examination papers set in\n1910\nto give us practice in answering the\n1948\npapers. There was no algebra - groups, rings, fields, etc. in the syllabus. The study of matrices did not involve the mention of vector spaces. Topological spaces had not been heard of - though some very popular lectures were given on topology by\nJ H C Whitehead\n. It is interesting to reflect that although we, the students, knew that this syllabus had stood still, neglecting most of modern mathematics - analysis was more up to date - we did not complain about it. We read, variously, mathematics right outside the syllabus, but it did not occur to us to suggest that the syllabus be changed. For example, our\ndifferential geometry\nlectures told us about two adjacent points on a curve, or two adjacent tangents to a curve, and my immediate contemporaries at Magdalen\n(\nmy college at Oxford\n)\n, Michael Barrett and Victor Guggenheim, and I, read the appropriate books that did this differential geometry properly. But we knew that answers using a rigorous language were not what our teachers wanted. So our answers were appropriately phrased.\nIt was through the connections that he had made in Bletchley Park that Preston first became interested in semigroups\n[\n3\n]\n:-\nMy semigroup influence came because of the friends I had met at Bletchley Park. I used to go to the National Physical Laboratory at Teddington - this was while I was an undergraduate again from\n1946\nto\n1948\n- to keep in touch with the development of the pilot ACE\n(\nAutomatic Computing Engine\n)\nthat\nAlan Turing\nhad been drafted there to develop. I was interested in the mathematical papers of my other Bletchley friends and, in particular, this was how I came to read\nDavid Rees\n's papers. I have no records, and my memory may be playing me false, but I believe the first paper I read on semigroups was his paper 'On semi-groups' from the Proceeding of the Cambridge Philosophical Society,\n1940\n, together with the small technical note that followed it, \"Note on semi-groups\", ibid.,\n1941\n.\nPreston now continued to undertake research at Oxford on a part-time basis, first with\nWhitehead\nthen with E C\n(\nEdward\n)\nThomson as his advisor. He earned his living as an assistant mathematics master at Westminster School in London where he was appointed in\n1948\n. He left this post in\n1950\nto take up a position teaching at the Royal Military College of Science at Shrivenham, which is close to Swindon and about\n35\nkm south west of Oxford. He continued working towards his D.Phil. on a part-time basis and was awarded the degree in\n1954\nfor his thesis\nSome Problems in the Theory of Ideals\n. He writes in\n[\n3\n]\n:-\n[\nIn my thesis\n]\nI tried to extend properties of groups and rings to a more general context, for example some of the ideal theory of Noetherian rings. I added a chapter at the end of my thesis in which I tried to axiomatise the inverse semigroups that\nRees\nhad considered in his\n1947\npaper. My attempt was not successful: but I proved some results about the semigroups I had defined. My D. Phil. examiners were\nDavid Rees\nand\nWhitehead\n.\nDavid\ngave me a list of detailed comments which\nHenry Whitehead\nwould not let him ask me about in the oral examination - Henry was the chairman of examiners - because Henry had to rush off to captain a cricket team playing that afternoon. Henry asked me a number of questions himself, including some about my chapter on semigroups; and in my answers to his questions which were critical questions I was able apparently to show that he had failed to grasp properly the concepts involved. After this I was invited to come and watch the cricket game, which I took as a sign that I had passed my viva.\nDespite continuing to teach at the Royal Military College of Science, he soon had a number of papers in print. In\n1954\nalone, five of his papers were published, all in the\nJournal\nof the\nLondon Mathematical Society\n:\nThe arithmetic of a lattice of sub-algebras of a general algebra; Factorization of ideals in general algebras; Inverse semi-groups; Inverse semi-groups with minimal right ideals\n; and\nRepresentations of inverse semi-groups\n.\nHowie writes\n[\n2\n]\n:-\n... when he wrote his three hugely influential papers laying the foundations of inverse semigroup theory it is not at all surprising that he was completely unaware of the closely similar work of\nVagner\nin Russia. He did, however, quickly realise how important it was to make contact with Central and Eastern Europe, and had some retrospective amusing difficulties with the authorities at the Military College, to whom even harmless semigroupers in those countries were 'the enemy'.\nPreston was released from his teaching duties at the Royal Military College of Science so that he could spend two years in the United States. He writes in\n[\n4\n]\n:-\nI spent the years\n1956\n-\n58\nin New Orleans at the invitation of\nAl Clifford\n. ...\nClifford\nand I drew up our plans and completed first drafts of several chapters of our two-volume treatise on semigroups during these two years. It proved the major mathematical task I have undertaken. The collaboration was a stimulating and happy one.\nThe first volume of\nClifford\nand Preston's\nThe algebraic theory of semigroups\nwas published in\n1961\n. He had returned to his teaching duties at Shrivenham after his time in New Orleans, but lived in Oxford where he participated in the mathematical life. Howie writes\n[\n3\n]\n:-\nI met Gordon Preston first in\n1959\n, when I arrived in Oxford as a graduate student working under the supervision of\nGraham Higman\n. Gordon lived in Oxford - Shrivenham, his place of work, is just\n30\nkm away - and he was a regular attender at the\nHigman\nalgebra seminar. For the final year of my study at Oxford, when\nHigman\nwas on sabbatical leave in Chicago, Preston was my supervisor, and it is a pleasure now to be able to pay public tribute to the quality of the help and encouragement I received from him during that period.\nWe mentioned above that the first volume of\nClifford\nand Preston,\nThe algebraic theory of semigroups\n,  was published in\n1961\n. Schwarz, in a review of the volume, writes:-\nThis is a well-arranged book furnishing a reasonably comprehensive account of a new field developed by a large number of algebraists very rapidly in the last twenty years. The book under review is the first volume; the second one will follow in the near future. After the book of\nE S Lyapin\n, 'Semigroups'\n(\nRussian\n)\n(1960)\nthis is the second book on the subject in the last eighteen months. Before, there has been no systematic treatment on semigroups at all, with the exception of the book of Suchkewitsch, 'The theory of generalized groups'\n(1937)\ncontaining naturally a very limited number of results. The book under review and that of\nLyapin\nwere written at about the same time. As to the results they overlap, of course, at many places, but in the presentation and the emphasis on problems there are frequent differences. ... This excellent and clearly written book will be very useful both for study and orientation and for reference in further work.\nVolume II of\nClifford\nand\nPreston\n,\nThe algebraic theory of semigroups\nwas published in\n1967\n. Schwarz again wrote a review:-\nVolume II has been eagerly awaited by those who are working in semigroup theory and related subjects\n(\ne.g., automata theory\n)\n. This volume ... deals with additional branches of the theory to which there was at most passing reference in Volume I. The manuscript was finished in\n1963\n, but notes on developments up to\n1967\nare included. ... The book as a whole is an excellent achievement. It is clearly written, contains all known main results to date, and will undoubtedly remain a source book for many years for all workers in this field.\nBy the time Volume II was published, Preston was professor at Monash University in Australia. He had been offered the chair of mathematics in this new university just outside Melbourne in\n1963\nand emigrated to Australia in the year to take up the position. He published papers over the next years such as\nChains of congruences on a completely\n0\n-simple semigroup\n(1965)\n,\nMatrix representations of inverse semigroups\n(1969)\nand\nFree inverse semigroups\n(1973)\n. Howie writes in\n[\n2\n]\n:-\nGordon Preston has an original and penetrating mind, and his list of publications, while not long by today's ridiculously inflated standards, contains many items of real quality, items that have greatly influenced the development of the subject and have stimulated other to activity.",
  "matematicos_citados_na_biografia": [
    "Turing",
    "M H A Newman",
    "Shaun Wylie",
    "Henry Whitehead",
    "David Rees",
    "J A(Sandy)Green",
    "P J(Peter)Hilton",
    "A N(Alan)Turing",
    "J H C Whitehead",
    "differential geometry",
    "Alan Turing",
    "Whitehead",
    "Rees",
    "David",
    "London Mathematical Society",
    "Vagner",
    "Al Clifford",
    "Clifford",
    "Graham Higman",
    "Higman",
    "E S Lyapin",
    "Lyapin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}