{
  "nome_completo": "Gordon Thomas Whyburn",
  "nome_curto": "Gordon Whyburn",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whyburn/",
  "data_nascimento": "7 January 1904",
  "local_nascimento": "Lewisville, Texas, USA",
  "data_morte": "8 September 1969",
  "local_morte": "Charlottesville, Virginia, USA",
  "summary": "Gordon Whyburn was an American mathematician who worked on topology.",
  "biografia": "Gordon Whyburn\n's parents were Thomas Whyburn and Eugenia Elizabeth Whyburn. His school education was in his home town of Lewisville and then, after graduating from school, he entered the University of Texas. He did not embark on a mathematics course at university, however, for his first love was chemistry and it was this topic which he studied for his first degree and he was awarded his A.B. in Chemistry in\n1925\n.\nRobert Moore\nhad been appointed as associate professor at the University of Texas in\n1920\nand it was\nMoore\nwho taught Whyburn calculus early in his university studies.\nMoore\nquickly saw the mathematical potential in Whyburn, and Whyburn was soon attending further mathematics courses given by\nMoore\nwho encouraged him greatly towards the study of mathematics. Even before he obtained his first degree in chemistry, Whyburn was undertaking research in mathematics with\nMoore\n. Of course with\nMoore\nhaving a deep interest in\ntopology\n, that was the direction that Whyburn took and it was to become the topic of his research throughout his life.\nWhyburn had other connections with mathematics at the University of Texas in addition to his work with\nMoore\n. His elder brother, William Marvin Whyburn\n(1901\n-\n1972)\n, was also at the University of Texas at the same time as Gordon Whyburn, and unlike Gordon he was studying mathematics. William Whyburn went on to become Chairman of the Mathematics Department at the University of California, Los Angeles and then at the University of North Carolina. His research was mostly on second order ordinary\ndifferential equations\n, see\n[\n3\n]\nfor details.\nAnother mathematician at Texas at this time was Lucille Smith, who was also from Lewisville, and Whyburn married Lucille in\n1925\n. Lucille Whyburn has, since her husband's death, written four fascinating papers\n(\nsee for example\n[\n4\n]\nand\n[\n5\n]\n)\nrelating to mathematicians and events from her life with Gordon Whyburn. Despite having these connections with mathematics and despite\nMoore\nstrongly encouraging him to move from chemistry to mathematics, Whyburn continued with his chemistry studies being awarded his Master's Degree in\n1926\n. Only at that point did he see that continuing to study chemistry was foolish when he had completed high quality research in mathematics.\nWhyburn presented his first paper, which was on cyclic elements for locally connected plane continua, at the Western Christmas Meeting of the\nAmerican Mathematical Society\nin Chicago on\n31\nDecember\n1926\n(\nsee\n[\n5\n]\nfor more details\n)\n. The road to a doctorate in mathematics was now easy, and indeed he was awarded his Ph.D. in mathematics in\n1927\n. Following this he was appointed as adjunct professor of mathematics at the University of Texas, holding this post from\n1927\nuntil\n1929\n.\nIn\n1929\nWhyburn, together with his wife, was able to go to Europe, financed by a Guggenheim Fellowship, where he spent academic year\n1929\n-\n30\n. He spent most time in Vienna working with\nHahn\n, but also visited Warsaw and made important links with\nKuratowski\nand\nSierpiński\n. In\n[\n3\n]\nletters between Whyburn and\nRobert Moore\nare discussed. These concern\nMoore\n's arcwise connectivity theorem which he had first proved for connected open sets in\n1916\nbut had still not published by\n1930\n.\nBack in the United States, Whyburn was appointed associate professor of mathematics at Johns Hopkins University, then in\n1933\nhe was approached by the University of Virginia who asked him to accept an appointment as professor and chairman of the Department of Mathematics. He accepted the appointment in\n1934\nand planned\n[\n2\n]\n:-\n... to get together a few young and congenial mathematicians of topflight accomplishments. their fields should be different but overlapping so that the students would not be confronted with choosing between absolutely unrelated areas. The plan worked beautifully. E H\nMcShane\njoined the department in\n1935\n, and G H Hedlund in\n1939\n. The three of them ran a program of charm and high standards.\nWhyburn's first research contributions were on cyclic elements and the structure of continua. This work aimed at examining a locally connected plane continuum and the regions of the plane created by it. The theory was based on cyclic elements, that is a region C such that any two points of C are contained in a simple closed curve of C. Around the time Whyburn went to the University of Virginia he began working on\nhomology theory\nand examined different notions of convergence in the space of all subsets of a compact metric space.\nFrom around\n1936\nWhyburn looked at open maps and their applications to complex function theory. In\n1942\nhe published his famous text\nAnalytic Topology\nin which he says\n[\n1\n]\n:-\nAnalytic topology is meant to cover those phases of topology which are being developed advantageously by methods in which continuous transformations play the essential role.\nA reviewer of the book\n[\n1\n]\nwrote:-\nWere the volume a mere collection of the theory developed in diverse papers in recent years, it would be worthwhile as a source book for present and future workers in transformations. However, it is much more than that. Some of the results are new and much of the treatment is new, some of the proofs acquiring an elegance and polish they sadly lacked in the original papers.\nThe book was the result of further developing material which Whyburn had presented as\nAmerican Mathematical Society\nColloquium lecturer in\n1940\n.\nLater major texts by Whyburn were\nTopological analysis\n(1958)\nand\nDynamic topology\nwhich was jointly authored by Edwin Duda and was published\n10\nyears after Whyburn's death. The term \"dynamic topology\", writes Whyburn\n[\n6\n]\n:-\n... refers to the body of results of a topological nature in which the function concept plays a central role.\nAlthough Whyburn spent his career from\n1934\nat Virginia, he did make frequent visits for summer teaching. He taught at Stanford, the University of California, UCLA and the University of Colorado. In addition he took study leave in\n1952\n-\n53\nat Stanford, and\n1956\n-\n57\nspent in England and Switzerland. He retired from his role as chairman at Virginia after he suffered a heart attack in\n1966\n. He regained his health but died three years later of a heart attack\nWhyburn's character is summed up in\n[\n1\n]\n:-\nWhyburn was a very private man. He was quiet and shy, and remarkably gentle with students and family. But in moments of administrative crisis, he could be extremely tough when he had to be. A man of brilliance, with a remarkable speed in research, he nevertheless believed deeply in continuity and patience, and that it was the total record of accomplishment of a lifetime that mattered most.",
  "matematicos_citados_na_biografia": [
    "Robert Moore",
    "Moore",
    "topology",
    "differential equations",
    "American Mathematical Society",
    "Hahn",
    "Kuratowski",
    "Sierpiński",
    "McShane",
    "homology theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}