{
  "nome_completo": "Graciela Beatriz Salicrup López",
  "nome_curto": "Graciela Salicrup",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Salicrup/",
  "data_nascimento": "7 April 1935",
  "local_nascimento": "Mexico City, Mexico",
  "data_morte": "28 July 1982",
  "local_morte": "San José Insurgentes, Mexico City, Mexico",
  "summary": "Graciela Salicrup trained as an architect and then worked as an archaeologist. She became a mathematics undergraduate at the age of 29 and went on to the become a leading topologist. She died at the age of 47 when at her most mathematically productive.",
  "biografia": "Graciela Salicrup\nwas the daughter of Pedro Roberto Salicrup Deschamps, born in Tuxpan, Veracruz, México, on\n12\nMay\n1908\n, and Concepción López Gutiérrez, born about\n1913\n. Pedro married Concepción on\n26\nJune\n1933\nin Mexico City; they had several children and Graciela was one of at least three sisters.\nGraciela's primary education was at the Colegio Alemán, a German school in Mexico City. The school, founded in\n1894\n, taught in German and was modelled on German schools abroad. At this school she had an excellent teacher who gave Graciela a passion for mathematics. She went on to study at a religious secondary school run by nuns. Claudia Gómez Wulschner writes that this school\n[\n5\n]\n:-\n... was the same one where I studied. The truth is that we were both a bit embarrassed by this because in addition to being a school run by nuns, we both received very poor pre-university training in mathematics, as we commented on occasion. Later, she was fortunate to study at the National Preparatory School.\nSalicrup was adamant that she wanted to study mathematics at university. Her parents did not object to her studying at university but they believed that mathematics was definitely not an appropriate subject. Salicrup did not give up easily, but her parents could not understand why their daughter had what they believed were stupid ideas. She said\n[\n5\n]\n:-\n... my family thought that my weirdness bordered on extravagance, disorientation and some madness, so they sent me to a psychiatrist.\nThe psychiatrist was Armando Hinojosa y Cavazos who had been born on\n15\nMay\n1918\nin Saltillo, Coahuila de Zaragoza, Mexico to Doctor Saturnino Hinojosa and Consuelo Cavazos de Hinojosa. He was awarded the degree Licenciatura Como Médico Cirujano from the Universidad Nacional Autónoma de México in\n1949\n. The results of Graciela visits to the psychiatrist probably were not what Salicrup's parents expected for Armando Hinojosa and Graciela Salicrup were married after she had undertaken her university studies.\nSalicrup's parents won the battle over the subject she would study at university, however, and she studied architecture and graduated in\n1959\nfrom the National Autonomous University of Mexico. She had three children with her husband Armando Hinojosa: Ariel Hinojosa Salicrup; David Hinojosa Salicrup; and Mariana Hinojosa Salicrup. We shall say a little about these children at the end of this biography.\nNow with a degree in architecture, Salicrup became involved in an unusual project for someone with this background for her work over the following years was on archaeology. She worked with the Italian Laurette Séjourné\n(1914\n-\n2003)\n. Séjourné, born in L'Aquila, Italy, lived in France before fleeing to Mexico in\n1942\nafter the Nazi conquest. Originally a film director she studied archaeology at the Escuela Nacional de Antropología e Historia and became interested in Mayan and Central American archaeology, inscriptions, mythology and prehistory. Alberto Mercado writes\n[\n12\n]\n:-\nIn a team with other collaborators, Salicrup and Séjourné studied the architecture of Teotihuacán, the enormous city whose remains include the pyramids of the Sun and the Moon, and which forms the archaeological site that is today the most visited in all of Mexico. This city was the home of a civilisation that had its heyday centuries before the Mexica empire - also known as the Aztecs - and of course, before the arrival of the Spanish on the continent. The Aztecs believed that Teotihuacán, which means city of the gods, had been built by giants who still inhabited the earth, hidden from them somewhere.\nThe remarkable fact is that Salicrup continued to feel that mathematics was the topic for her and even in her investigations with Séjourné she tried to understand the lives of the people who had lived in Teotihuacán from the geometry of the ruins they were excavating. Salicrup and Séjourné tried\n[\n12\n]\n:-\n... to solve something like the inverse problem of discovering the purpose of the different places from their geometry: if this space was a room, if that one was an esplanade, a meeting place, a place for prayer.\nThey published the book\nArquitectura y pintura en Teothihuacán\nⓉ\n(\nArchitecture and painting in Teothihuacán\n)\n(1966)\nwhich has Laurette Séjourné and Graciela Salicrup as authors, and Graciela Salicrup and Manuel Romero as illustrators. By the time this book was published, however, Graciela Salicrup, now nearly thirty years old, had begun studying university level mathematics.\nIn\n1964\nSalicrup enrolled in the Faculty of Sciences of the Universidad Nacional Autónoma de México\n(\nUNAM\n)\nto study Mathematics. Many years later Gómez Wulschner asked her how she had found time to become a full time student of mathematics and she replied\n[\n6\n]\n:-\nIf you are convinced of what you want to do, you will always have time.\nWhile studying mathematics in the Faculty of Sciences, from between\n1966\nand\n1968\nshe taught mathematics in the Faculty of Architecture of the UNAM. She graduated with her mathematics degree in\n1969\nhaving presented her thesis\nSubgrupo de Jiang-Bo-Ju\nⓉ\n(\nThe Jiang-BoJu Subgroup\n)\n. Let us note that the Jiang subgroup studied in the thesis is a topological concept introduced by the Chinese mathematician Jiang Boju\n(\nborn\n1937)\n. Salicrup's advisor for her undergraduate thesis had been\nRoberto Vázquez\nand she now began undertaking research for her doctorate advised by\nVázquez\n. She began teaching in the Faculty of Sciences of the UNAM in\n1969\nand was appointed as a special researcher at the Institute of Mathematics of the UNAM in\n1970\n.\nSalicrup and\nVázquez\nbegan publishing a series of papers:\nFibraciones y correflexiones\nⓉ\n(\nFibrations and coreflexions\n)\n(1970)\n;\nFibraciones y correflexiones II\nⓉ\n(\nFibrations and coreflexions II\n)\n(1972)\n;\nT-cocientes\nⓉ\n(\nT-ratios\n)\n(1973)\n;\nReflexividad y coconexidad en Top\nⓉ\n(\nReflexivity and coconnectedness in Top\n)\n(1974)\n;\nExpansiones A-conexas y subespacos A-máximos\nⓉ\n(\nA-connected expansions and A-maximal subspaces\n)\n(1975)\n;\nObjetos máximos en categorías de conexión de Top\nⓉ\n(\nMaximal elements in Top Connection Categories\n)\n(1975)\n; and\nOn functors with quasi-small fibres\n(1977)\n. Horst Herrlich writes in\n[\n9\n]\nthat Graciela Salicrup's work after completing her undergraduate degree:-\n... was characterised by a close cooperation with her beloved teacher\nRoberto Vázquez\n. Graciela and\nVázquez\nwere among the first mathematicians who realised that certain topological concepts and constructions were best understood in the light of category theory. ... they analysed topological problems by means of categorical terms and methods, in many cases having first to develop the yet missing categorical machinery. For nearly a decade they produced roughly one joint paper per year, evincing a high sensitivity for suitable problems, and demonstrating great originality and skill. Their best papers of this period ... are prominent achievements in the newly emerging field of categorical topology. Unfortunately they published their results in a journal neither well known nor easily accessible in the non-Spanish speaking mathematical world. Thus, their work which otherwise would have had a considerable impact on categorical topologists - remained for a long time almost unknown, and several of their results had to be recovered independently by later investigators.\nIn\n1978\nSalicrup submitted her doctoral thesis\nEpireflexividad y conexidad en categorías concretas topológicas\nⓉ\n(\nEpireflexivity and connectedness in topological concrete categories\n)\nand was awarded a Ph.D.\nClaudia Gómez Wulschner was a student in the\n1970\ns taking courses delivered by Salicrup. She writes\n[\n5\n]\n:-\nGraciela studied a lot: daily, at\n8\nin the morning, she was already sitting at her desk at the Institute of Mathematics, she prepared her classes impeccably and only when she wanted to give us homework problems did she carry a sheet of paper folded in half. Otherwise, she would arrive to class on time with only her keys in her hand and very seriously enter the room that would later bear her name. She always finished class exactly. Graciela had her routines at the Institute, she waited in her office or went to chat a little with her dear friend María Emilia Caballero. Around eleven o'clock, Graciela would meet with her teacher and collaborator to work. She would leave around two to go to eat.\nThe topology lectures that Salicrup gave, Topology I, II and III, were published in the book\n[\n13\n]\nafter her death. Aleksandr Bashkirov, reviewing this book, writes\n[\n1\n]\n:-\nThis book is a version of a three-semester course of topology, which was taught by the author at the National Autonomous University of Mexico City from\n1979\nto\n1980\n. The author was a well-known specialist in the theory of topological categories and this book is remarkable for its \"categorical\" spirit. It is separated into three parts, corresponding to three semesters.\nPart one contains fundamentals of general topology: pseudometric spaces, bases of topology, maps, products and co-products, axioms of separation, countability axioms, compactness. Part two deals with deeper concepts of general topology and basic notions of homotopic topology: nets, filters, metrizability, convexity, homotopy, fundamental groups, fundamental groups of spheres, function spaces\n(\nwith the topology of pointwise convergence and with the compact-open topology\n)\n. Part three is devoted to algebraic topology: covering spaces, fiber spaces, lifting theorem, co-fibrations, adjoint spaces, cell polyhedra. Each part consists of nine sections concluding with several problems.\nHorst Herrlich\n(1937\n-\n2015)\n, like Salicrup, was a pioneer of categorical topology. He was Professor of Mathematics at the University of Bremen from\n1971\n. Salicrup was very interested in the work that was being carried out by Herrlich and his research group but felt that she should be able to converse with them in German. Although she had attended a German primary school, she had mostly forgotten what she had learned. She discussed taking German classes with Gómez Wulschner and other colleagues, and a group of them signed up for classes at the Goethe Institute in the Centro Cultural Universitario, part of the UNAM. Gómez Wulschner writes\n[\n7\n]\n:-\nThere were few students and the fact that most of us were mathematicians always made our teachers somewhat nervous; what is true is that Graciela challenged everyone without being aware of it. Here I must point out that she gave us a complex: she was the most attentive, the hardest working, she never boasted of having had previous experience, but on the contrary, she said that she did not remember anything. She always studied, she never failed her homework. Shamelessly just minutes before class we all wanted to be with her so she could help us or, at one point, even shamelessly copy part of her homework.\nSalicrup's cooperation with Horst Herrlich led to two papers, both with\nRoberto Vázquez\nas a third co-author:\nLight factorization structures\n(1978\n/\n79)\n; and\nDispersed factorization structures\n(1979)\n.\nWe learn a little from\n[\n8\n]\nabout Salicrup's character and interests:-\nTall above average, slender, pretty with an enormous personality, half hidden in that combination that occurs between seriousness and shyness and that, in reality, tries to sift a great intelligence, with a look so tender and so deep at the same time ... Graciela always had her timing well measured. She seemed to have arranged them with the precision of a Swiss watchmaker; she was aware of her family - not just her husband and her children - she regularly visited her mother and helped her with one of her sisters, who needed support. ... Graciela possessed enormous virtues and talents, she had a flair for art, she enjoyed music and she loved opera; she enjoyed painting exhibitions and visiting museums just as much as drawing. Also, she knew a lot about literature and history, she was interested in everything. ... Graciela enjoyed everything, she liked going to the movies - particularly art movies -, several times we went with a group of students, scholarship holders from her Institute and colleagues and classmates from the German class. She accompanied us and we greatly enjoyed her presence. The guided visit to Teotihuacán that she organised with researchers and fellows from the Institute where she worked was famous.\nA sad event happened towards the end of Salicrup's life. The strong working relationship she had with\nRoberto Vázquez\nbroke down. He suddenly stopped speaking to her. When asked what had happened to cause this, she replied that she did not know. Of course it is quite possible she knew but did not want to say. Gómez Wulschner makes a conjecture, stressing that it is only a conjecture\n[\n5\n]\n:-\nI cannot deny that this situation obviously bothered and saddened Graciela, he was her teacher and her collaborator for years, but perhaps it was very hard for him to see her fly high, with her own wings and with her own creativity and originality. I insist, this is imagination but I say this because I know Graciela always felt respect for Dr\nVázquez\n.\nSalicrup died when she was only\n47\nyears old. In the summer of\n1982\n, Horst Herrlich and H Lamar Bentley visited Salicrup in Mexico City. These two had collaborated on five papers between\n1978\nand\n1981\nsuch as\nCompleteness for nearness spaces\n(1979)\nand\nThe coreflective hull of the contigual spaces in the category of merotopic spaces\n(1982)\n. The three mathematicians planed to undertake a joint project but Salicrup suffered a fall and was taken to the Hospital Dario Fernandez, San José Insurgentes, Mexico City. She died there on\n28\nJuly\n1982\n. All biographies of Salicrup say that she died after a fall which hurt her badly and from which she did not recover. Although in a sense this is correct, the death certificate shows a little more detail. It states her death was from a \"bronchopneumonia complication determined by a number of injuries.\" Bronchopneumonia is a lung infection which is usually contracted in a hospital so it is likely that she contracted this when admitted to hospital after a fall which caused \"a number of injuries.\"\nWe promised earlier in this biography to say a few words about Salicrup's three children. Ariel Hinojosa Salicrup studied electroacoustic music, opera and classical music in film, and baroque music. He went on to study the guitar, and, in\n1989\n, collaborated in the Mexico Youth Orchestras Project becoming an orchestra director. David Hinojosa Salicrup studied architecture at the Ibero-American University, Mexico City, and was awarded the degree of Bachelor of Architecture in\n1984\n. Mariana Hinojosa Salicrup was a keen dancer from a young age and studied ballet.\nIn\n1987\n, a paper by H Herrlich, G Salicrup and G E Strecker with title\nFactorizations, Denseness, Separation, and Relatively Compact Objects\nwas published\n(\nsee\n[\n11\n]\n)\n. The abstract for the paper states\n[\n11\n]\n:-\nSome of the relationships among the topological notions: '\nHausdorff\n', 'compact', 'perfect', and 'closed' are abstracted to a more general categorical setting, where they are shown to remain intact. An investigation is made of factorization structures\n(\nespecially for single morphisms\n)\nand their relationships to strong limit operators and to the Pumplün-Röhrl\nGalois\ncorrespondence between classes of objects and classes of morphisms in any category. Many examples as well as internal characterisations of\nGalois\n-closed classes are provided.\nThe reason for a publication with Salicrup as a co-author five years after her death is explained in a footnote\n[\n11\n]\n:-\nMany of the ideas and results included in this paper are due to the second author\n[\nGraciela Salicrup\n]\n, and were incorporated in an unfinished manuscript that she was preparing shortly before her untimely death in\n1982\n.\nLet us end by quoting from the Preface to\nCategorical topology. The complete work of Graciela Salicrup\npublished in\n1988\n[\n10\n]\n:-\nFive years have passed since Graciela died. Her life was untimely interrupted by a fatal accident. We lost a friend, Mexico lost a gem. Mexico is a very young country. Even younger is his mathematical tradition. Mathematical activity is twice as difficult if there is no tradition backing it. This doubles the merits of Graciela: she not only was a pioneer in a newly created branch of mathematics, she consciously helped to build up a tradition in a country where mathematical research goes back just to the end of the thirties and now is scarcely fifty years old. Being a woman, her task was particularly difficult. We miss the lovely person, who was always there to listen to our problems and to give sound advice. She was a fair judge and her opinion was as important for moderating as for animating. We miss the mathematician, from whom many of us learned so much, whose lectures were always clear, thoroughly prepared and inspiring, and who knew how to explain well the importance of precision and mathematical rigour. ... We hope that this compilation helps to do justice to the scientific work of an inspired mathematician. Graciela lives in her mathematical work, she lives in her archaeological investigations. Graciela lives in our hearts.",
  "matematicos_citados_na_biografia": [
    "Roberto Vázquez",
    "Vázquez",
    "Hausdorff",
    "Galois"
  ],
  "imagens": [
    "salicrup.jpg"
  ]
}