{
  "nome_completo": "Gregory Maxwell Kelly",
  "nome_curto": "Gregory Maxwell Kelly",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kelly_Max/",
  "data_nascimento": "5 June 1930",
  "local_nascimento": "Bondi, New South Wales, Australia",
  "data_morte": "26 January 2007",
  "local_morte": "Sydney, Australia",
  "summary": "Gregory Maxwell Kelly was an Australian mathematician who worked in category theory.",
  "biografia": "Gregory Maxwell Kelly\n's father was a shop keeper. Max, as he was known to everyone, had a brother, Michael, who was six years younger. Michael recalled some childhood memories:-\n... I have early memories of him doubling me down the hill at Ramsgate Avenue, Bondi, on a scooter. I must have been about four years old and he eleven. I remember the games we used to play with other children in the street -- now forgotten games such as \"countries\" or \"brandings\", and -- my blurred memory thinks he took part in this - the vaguely illegal one of \"chasings through the flats\". I remember us going to school, and him teaching me to read ahead of my classmates and later teaching me to ride a bike. I remember hanging around when his school friends -- some of whom were very flamboyant characters -- visited and stirred up our household ...\nMax attended the Marist Brothers school at Bondi and came top in New South Wales in the Leaving Certificate examination of\n1946\n. In fact he took the examinations in the previous year but was too young to proceed to university as his brother Michael recounts:-\nI remember that at the age of fifteen he was fourteenth in the state in the Leaving Certificate, and since he was too young to attend university, repeated the year, coming first then in the state and gaining other honours.\nEntering the University of Sydney in\n1946\n, he had an outstanding undergraduate career being awarded first-class honours, the University Medal for mathematics, and the James King of Irrawang travelling scholarship in\n1950\n. Michael remembers that while he was an undergraduate:-\n[\nMax\n]\nand his great undergraduate friend, Greg Johnson, turned our back room into a junk den full of radio parts, cathode ray tubes, classical music, and the pervading smell of hot solder and flux.\nKelly then went to the University of Cambridge in England where first he studied for a B.A. which was awarded in\n1953\n, then remained at Cambridge to undertake research in mathematics. His thesis advisor was\nShaun Wylie\nand he completed his doctoral dissertation on homological algebra and was awarded a Ph.D. in\n1957\n. He then returned to Australia where he was appointed as a lecturer in Pure Mathematics at the University of Sydney. In\n1960\nhe married Imogen Datson; they had four children Dominic, Martin, Catherine and Simon. He was steadily promoted during ten years at Sydney, being made a Senior Lecturer in\n1961\n, then a Reader in\n1965\n. During these years, he was not continuously at the University of Sydney for he spent the two years\n1963\n-\n1965\nas a visiting fellow in the United States. The first of these years he spent at Tulane University in New Orleans, the second of the years was spent at the University of Illinois. Then in\n1967\nhe was appointed as Professor of Pure Mathematics at the University of New South Wales. He held this position for six years, returning as Professor of Mathematics at the University of Sydney in\n1973\n. He held this post until he retired in\n1992\n.\nKelly's first paper\nSingle-space axioms for homology theory\nwas based on the work of his doctoral thesis and published in\n1959\n. He writes in the introduction:-\nEilenberg\nand\nSteenrod\ngive a set of axioms for the homology theory of pairs of spaces and their maps, and prove that these axioms are categorical on triangular pairs. Here we give a set of axioms for the homology theory of single spaces and their maps, that is, for absolute rather that relative homology. This axiomatization is shown to be essentially equivalent to that of\nEilenberg\nand\nSteenrod\n, the relative homology groups being suitably defined in terms of the absolute groups.\nThe article\n[\n1\n]\nforms an introduction to a volume of the\nJournal of Pure and Applied Algebra\nproduced to celebrate Kelly's\n70\nth\nbirthday. In it the authors give an excellent summary of Kelly's mathematics contributions. We give an extract from the article:-\nMax has been a prominent figure in category theory for nearly four decades. It is said that, whenever two or more categorists are gathered together, Max's name will come up very soon, either in a scientific or social context. While categories merited only passing mention in Max's doctoral work, the subjects were very close to the kind of mathematics that led\nEilenberg\nand\nMac Lane\nto initiate category theory.\nShaun Wylie\n, well known for his book with\nPeter Hilton\non homology theory, was Max's supervisor at Cambridge. Max's early categorical papers had their origins in that book, particularly to do with questions around the Künneth theorems. However, very soon, Max was led to general considerations within category theory itself, which were then applied to the problems at hand.\nIn this early work we can find the germ of many of Max's later keen interests: enriched category theory, coherence, and higher-dimensional universal algebra. A key fact was that differential graded categories\n(\nDG-categories\n)\nwere already there.\nSammy Eilenberg\ntoo had distinguished these structures, creating the spur for their collaboration on enriched categories. Fred Linton had studied categories with homs lying in a base category other than the category of sets, yet his bases excluded the category of chain complexes needed for DG-categories. Meanwhile, by wanting a general\n(\nsymmetric\n)\nmonoidal category as base, Max was led into coherence questions, reducing the number of axioms established by\nMac Lane\n. He was also led to consider an extension of the notion of naturality to cover the case of all variables in the evaluation map, privately using string diagrams to link the variables. This all culminated in the meticulous\nEilenberg\n-Kelly contribution to the\n1965\nLaJolla Conference whose Proceedings many of us see as representative of category theory reaching maturity as a subject in its own right. An important aspect was that the category of categories could also be used as a base, allowing the study of\n2\n-categories as particular enriched categories.\nWe should also single out for mention the important book\nBasic concepts of enriched category theory\nwhich Kelly published in\n1982\n.\nAmong the honours he received for his major contributions are election to a fellowship in the\nAustralian Academy of Science\nand a Centenary Medal \"for services to Australian society and science in mathematics\" received from the Australian Government in\n2001\n. In the interview reported in\n[\n2\n]\n, Kelly tried to explain the importance of category theory in a way that non-mathematicians would understand. He said:-\nCategory theory sheds light on the relations between various aspects of mathematics and in doing so it brings unity and simplicity. It lights the way for the next lot of advances.\nDominic Kelly wrote about his father:-\nDad was able to lecture and speak fluently in several languages, and was capable of picking up at least the gist of mathematical papers in several others. ... When I was a child, it seemed to me that Dad knew quite a bit about most things -- astronomy, languages, history, and of course theology and philosophy, just to name a few. ... I can remember a number of examples of Dad's efforts on behalf of others. Assisted by the journalist Peter Bowers, he successfully took on the New South Wales Minister for Education to obtain for a blind student in a Catholic school a mathematics textbook in Braille that was gathering dust on top of a filing cabinet in some bureaucrat's office. After being held up to ridicule in the press, the Minister backed down and allowed this student to have the textbook.\nLater, Dad was involved in such things as Action for World Development and various efforts to help the Aboriginal community in Redfern. ... I'm told that Dad was keen to have our local church at the time consider the morality of the Vietnam War, and was even threatened with excommunication for standing up in Mass and challenging the priest on this issue.\nHis brother Michael wrote:-\nHe had a great facility for meeting people and he loved them. He had enormous confidence, though at the same time there were areas of life where he wanted plenty of reassurance. And, with all of his confidence and his academic brilliance, he was a genuinely humble man, and utterly free of snobbery, intellectual or social. There always remained something childlike about him, though I am not sure that he would admit this.\nDominic Kelly wrote about his father's sad final years of ill health:-\nIt was very sad to watch Dad's decline over the last several years. It's an especially terrible thing for a man like him to lose the ability to read. He relied on myriad pills, had a walking frame, underwent back operations, heart operations, and he had recently been diagnosed with emphysema. Last Friday when we were sitting around trying to decide whether or not to remove life support, the senior nurse made the comment that \"up to now, Max has had the perfect death\". Sad though it was, there's no doubt she was right.",
  "matematicos_citados_na_biografia": [
    "Shaun Wylie",
    "Eilenberg",
    "Steenrod",
    "Mac Lane",
    "Peter Hilton",
    "Sammy Eilenberg",
    "Australian Academy of Science"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}