{
  "nome_completo": "Guglielmo Righini",
  "nome_curto": "Guglielmo Righini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Righini/",
  "data_nascimento": "16 February 1908",
  "local_nascimento": "Castelfranco Veneto, Italy",
  "data_morte": "29 May 1978",
  "local_morte": "Florence, Italy",
  "summary": "Guglielmo Righini was an Italian astronomer, specializing in the study of the sun. He also wrote on the history of science.",
  "biografia": "Guglielmo Righini\nwas born in Castelfranco Veneto but his family moved to Belluno, north of Venice, where his father was the stationmaster. Righini went to Florence where he studied at the technical colleges before entering the University of Florence to study for his doctorate in physics. However, while studying at the University of Florence he had already begun working at the Arcetri Observatory in Florence in\n1928\n. The director of the Arcetri Observatory, Giorgio Abetti\n(1882\n-\n1982)\n, had succeeded his father Antonio Abetti\n(1846\n-\n1928)\nto this post in\n1921\n. Giorgio Abetti had studied in the United States with George Ellery Hale\n(1868\n-\n1938)\nin\n1908\nand in the following years the two collaborated closely. Hale advised regarding the construction of a telescope at the Arcetri Observatory modelled on the one at Mount Wilson in the United States. When Righini began work at the Arcetri Observatory, Antonio Abetti\n(\nwho was in the last year of his life\n)\nwas a great help and inspiration to the young astronomer. After graduating from the University of Florence with his doctorate in\n1930\n, Righini continued working at the Arcetri Observatory.\nGiorgio Abetti was working on solar physics and so it was natural for Righini to also undertake research on this topic. His first publication was\nSul profilo del tripletto del magnesio nello spettro del Sole\nⓉ\n(\nOn the triplet profile of magnesium in the spectrum of the Sun\n)\npublished in\n1930\n. In\n1934\nhe had to spend some time doing military service, after which he went to Utrecht where he worked with the astrophysicist Marcel Minnaert\n(1893\n-\n1970)\n, who was involved in deep studies of the sun. Righini was supported financially on this trip to Utrecht by a grant from the Rockefeller Foundation. He wrote the first modern Italian work on solar physics and presented it to the Congress of the International Astronomical Union, which was held in Paris in\n1935\n. He travelled from Florence to Paris on a motorcycle to attend this Congress.\nIn\n1936\nRighini accompanied Giorgio Abetti on an Arcetri Observatory expedition to Russia to observe a total solar eclipse of the sun. They set up their instruments in Orenburgh in Siberia and observed the eclipse which took place on\n19\nJune. From observations made during that eclipse Righini was able to propose the hypothesis that the particles forming the solar corona were moving at great speed and concluded that the coronal gas should be at temperatures of the order of millions of degrees. This was in fact confirmed later. Rosino writes\n[\n10\n]\n:-\nThis was his first experience in the observation of solar eclipses; in later years he took part in seven other expeditions, observing total eclipses of Sun from the ground and from aircraft, becoming one of the most experienced scientists in this field. Righini was extremely skilful not only in experimental and observational work, but also in the theoretical analysis and interpretation of the results. So, although the working conditions were very difficult during the war, he was able to devise and construct instruments for the optical integration of spectral lines, while at the same time examining from the theoretical point of view the structure of their profiles. During these years he published a series of papers on the physical conditions of the solar corona, the intensity distribution of its continuous spectrum, its colour index and temperature, again on the basis of observational and theoretical considerations.\nAfter World War II ended, Righini spent periods of study in Cambridge, England, and in the United States. His visit to Cambridge in\n1948\nwas funded by the British Council and on this trip he was able to learn about the latest developments in solar radio astronomy. The trip to the United States was in\n1955\n-\n56\nwhen he was at Ann Arbor and at Sacramento Peak. In\n1951\nhe had been appointed as director of the Astrophysical Observatory of Asiago. This observatory, founded in\n1942\n, was located in the northern part of Italy and was equipped with the\nGalileo\n122\ncm telescope, at that time the largest in Europe. He worked at the Asiago Observatory until late\n1953\nwhen he was appointed as Professor of Astronomy at the University of Florence and Director of the Arcetri Observatory, succeeding Giorgio Abetti. Righini took up these new roles early in\n1954\n.\nOne of Righini's first tasks was to organise an expedition to the island of Öland in Sweden to observe the total eclipse on\n30\nJune\n1954\n. This expedition, however, was not lucky for the sky was cloudy and observations of the eclipse were not possible. He continued in observing solar eclipses\n[\n10\n]\n:-\nClassical researches were not forgotten, but carried out with new methods. Several expeditions for observing total eclipses of Sun were organized by Righini. In the eclipse of February\n15\n,\n1961\n, when the path of the totality passed over Arcetri, Righini observed the phenomenon aboard a military aircraft, following the shadow of the Moon at high altitude, so to increase, in a perfectly clear sky, the duration of totality. As a recognition of the success of this new technique, he was invited by the National Geographic Society and the Douglas Aircraft Corporation, and later by the NASA, to participate in the capacity of an expert, in the observations from on board jets of the solar eclipses of July\n20\n,\n1963\nin Canada, on May\n30\n,\n1965\nin the Southern Pacific, and on November\n12\n,\n1966\n, in Brazil.\nIt is amusing to note that although one might expect a clear sky from an aircraft, in fact there were problems at the time of the\n1961\neclipse over Arcetri when a local farmer decided to light a fire, with much smoke, shortly before the eclipse was due. The police, however, told him to extinguish the blaze which was indeed put out in time for the eclipse to be viewed in a clear smoke-free sky.\nIn addition to his important research, Righini was also an excellent person to talk about the latest developments in astronomy and was in great demand from the press, radio and television channels to describe these developments at a level which could be understood by the general public. The reader of this biography may be wondering why we have included Righini in our History of Mathematics archive. There are many astronomers in our archive but they tend to be more on the mathematical side than was Righini. The reason for his inclusion is, however, rather different. From the around\n1962\n, he published some important material on the History of Science. In particular, Righini was a leading expert on\nGalileo Galilei\nand we give a list of his main works on\nGalileo\nand other topics in the History of Science at\nTHIS LINK\n.\nStillman Drake writes in\n[\n2\n]\n:-\nWhen a scientist of international renown, after many years of distinguished work in his own field of specialization, turns his attention to the accomplishments of his great predecessors in that field, unique benefits to the history of science result. Such events, not uncommon in the early days of our discipline, have now become unfortunately rare. A striking example is the work of Professor Guglielmo Righini since his publication in\n1962\nof a study of the Florentine astronomical tradition at the Arcetri Observatory\nAs a historian of science, Righini is best known for his studies of\nGalileo\n. Drake writes\n[\n3\n]\n:-\nProfessor Righini's writings on history of science began in\n1962\n, when he had already published\n118\nastronomical papers. They did not interrupt, but supplemented, those activities. It was natural that he should have been particularly attracted to the astronomical work of\nGalileo\n. Not only the place of long residence was in common between\nGalileo\nand Guglielmo Righini; also their interest in applying and devising technological devices to improve astronomical observations and measurements. I may add as a personal note, when we once discussed\nGalileo\n's first pseudonymous attack on the stubborn Aristotelianism of his opponents in the matter of the new star of\n1604\n, I discovered that the dialect of the Paduan countryside - which so charmed the Florentine\nGalileo\nthat he employed it in that first published work of his - was familiar also to Righini from his childhood in the Veneto. He was a most urbane and charming conversationalist, soft-spoken as became a man of unquestionable authority on the most diverse topics.\nIn\n1964\n, for the\n400\nth\nanniversary of the birth of\nGalileo\n, Righini wrote the\n118\n-page work\nContributo alla interpretazione scientifica dell'opera astronomica di Galileo\nⓉ\n(\nContribution to scientific interpretation of Galileo's astronomical work\n)\n. This was published in\n1978\nshortly after Righini's death.\nIn\n1965\nRighini, who by then was\n57\nyears old, married Maria Luisa Bonelli\n(1917\n-\n1981)\n. Maria Luisa, the daughter of Luigi Bonelli and Adele Giamperoli, was an historian of science and an expert on museums. When she married Righini she was the director of the Museum of the History of Science in Florence, which today is called the Museo Galileo. She had been employed first to help the museum recover from the damage caused by the bombings that destroyed the bridges of the Lungarno at the end of the Second World War. However, another major tragedy struck the museum on\n4\nNovember\n1966\nwhen the river Arno flooded\n[\n1\n]\n:-\nThe instruments that at the time were stored in the basement and ground floor of the Museo were seriously damaged. Thanks to international solidarity and the efforts of Maria Luisa Righini Bonelli, then-director of the Museum, it was possible to quickly carry out recovery of the instruments, reopen the exposition rooms to the public and return energies towards library collecting and research activities.\nWe note that was, like her husband, Maria Luisa Righini Bonelli was an expert on\nGalileo\n. She published the book\nVita di Galileo\nⓉ\n(\nLife of Galileo\n)\n(\nNardini, Florence,\n1974)\nand, with William R Shea, wrote\nGalileo's Florentine residences\n(\nIstituto e Museo di storia della scienza, Florence,\n1979)\n. After Righini died in\n1978\n, it was due to his wife that his final two works,\nContributo alla interpretazione scientifica dell'opera astronomica di Galileo\nⓉ\n(\nContribution to scientific interpretation of Galileo's astronomical work\n)\n(1978)\nand\nLe operazioni del compasso geometrico et militare di Galileo Galilei\nⓉ\n(\nTransactions of the geometric and military scope of Galileo Galilei\n)\n(1980)\nwere published by the Istituto e museo di storia della scienza in Florence.\nFinally, we note that Righini's son, Alberto Righini\n(1942\n-\n)\n, is an associate professor at the University of Florence with interests very similar to those of his father. He too has published a book on\nGalileo\n, namely\nGalileo. Tra scienza, fede e politica\nⓉ\n(\nGalileo. Between science, faith and politics\n)\n(2008)\n.",
  "matematicos_citados_na_biografia": [
    "Galileo",
    "Galileo Galilei",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}