{
  "nome_completo": "Guidobaldo Marchese del Monte",
  "nome_curto": "Guidobaldo del Monte",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Monte/",
  "data_nascimento": "11 January 1545",
  "local_nascimento": "Pesaro (now Italy)",
  "data_morte": "6 January 1607",
  "local_morte": "Montebaroccio (now Italy)",
  "summary": "Guidobaldo del Monte was an Italian mathematician who wrote on statics and also on perspective and astronomy.",
  "biografia": "Guidobaldo del Monte\n's father, Ranieri, was from a leading wealthy family in Urbino. Ranieri was noted for his role as a soldier and also as the author of two books on military architecture. The Duke of Urbino, Duke Guidobaldo II, honoured him with the title Marchese del Monte so the family had only become a noble one in the generation before Guidobaldo. On the death of his father Guidobaldo inherited the title of Marchese. We should notice at this point that he signed himself Guidobaldo dal Monte\n(\nusing 'dal' rather than 'del' as was fairly common at the time\n)\nso it is not unusual to see him referred to as Guidobaldo dal Monte rather than Guidobaldo del Monte. For convenience, however, we will refer to him as Guidobaldo throughout this article, although in other places in this archive we refer to him as del Monte.\nWe should also note that a title was not the only thing which he inherited on his father's death for he also came heir to the family estate of Montebaroccio. He was then sufficiently wealthy that he had no need to accept paid employment, and even his army service appears to have been unpaid. In fact he could afford to give financial support to other scientists, for example\nGalileo\nbenefited from his patronage.\nGuidobaldo studied mathematics at the University of Padua in\n1564\n. While there he became a friend of the great Italian poet Torquato Tasso. In fact Guidobaldo may have known Tasso before they studied at Padua together, for Tasso was almost exactly the same age as Guidobaldo and had been educated at the court of the Duke of Urbino, with the duke's son, from\n1556\n. The political situation in Europe at the time determined the next stage of his life.\nSuleyman I, the Magnificent, occupied Buda\n(\npart of present day Budapest\n)\nin\n1526\n. Over the succeeding years Hungary was divided with Royal Hungary coming under the Habsburg rule and the Ottomans controlling Buda and that part to the south. In\n1568\nHungary was partitioned into three with Royal Hungary being reduced to allow for the autonomous principality of Transylvania, which was also under the control of the Turks. Ferdinand I was Holy Roman emperor from\n1558\nto his death in\n1564\nwhen his eldest son became the Holy Roman emperor Maximilian II. He fought an unsuccessful campaign against the Turks in Hungary, not so much with a view to taking control of parts of the country they controlled but more to combat the threat they posed to his empire. For a while Guidobaldo served in the army during the war against the Ottoman in Hungary. Clearly the military expertise gained from his father made him a valuable asset. However, Maximilian was forced to conclude a peace in\n1568\nunder which he was required to pay dues to the sultan. It was an uneasy peace, with some fighting continuing.\nAfter serving in the army, Guidobaldo returned to his estate of Montebaroccio in Urbino where he was able to spend his time doing research into mathematics, mechanics, astronomy and optics. He studied mathematics under\nCommandino\nduring this period and became one of his most staunch disciples. He also became a friend of Bernardino Baldi, who was also a student of\nCommandino\naround the same time.\nGuidobaldo's book\nLiber mechanicorum\n(1577)\nwas regarded as the greatest work on statics since Greek times. It was a return to classical Greek rigour deliberately rejecting the approach of\nJordanus\n,\nTartaglia\nand\nCardan\n. In fact in\n[\n5\n]\nBiagioli tells us that Guidobaldo showed contempt for men like\nTartaglia\n, Benedetti, and other Northern Italians, who were in a much lower social class than the aristocratic Guidobaldo. In fact he attacked them for their claims that bodies would descend along parallel paths if dropped, saying that all bodies would move along paths which converged to the centre of the Earth. Of course he was right but the difference is negligible. It is an indication of his philosophy, however, for complete mathematical precision.\nWhat were the main ideas in his book? He strongly adhered to the principle that more force was required to move a weight than was required to keep it in motion, so dynamics and statics had to be two separate subjects.\nGalileo\nwould later show how to unify statics and dynamics. Another error that Guidobaldo makes is to accept an argument of\nPappus\non inclined planes over that of\nJordanus\n, which is in fact correct. We should not be too critical, however, for much of Guidobaldo's book is excellent material which would be accepted by\nGalileo\nand form the basis for his major step forward. For example Guidobaldo shows that systems of pulleys can be reduced to problems with levers with some excellent analysis.\nAs we have indicated, much of Guidobaldo's approach was adopted by\nGalileo\nwho was his friend for\n20\nyears. Interesting in this respect is an experiment on projectiles which Guidobaldo carried out. Naylor, in\n[\n13\n]\n, describes this achievement:-\nSometime before\n1601\nGuidobaldo del Monte appears to have carried out an experimental study of the form of the projectile trajectory. The existence of this experiment remained unknown for many years until news of\nLibri\n's discovery of it in a manuscript was published in the\n19\nth\ncentury. The experiment itself is remarkably similar to one described by\nGalileo\nin the \"Discorsi\".\nNaylor discusses both experiments and also discusses the possible relationships between them in\n[\n13\n]\nwhile in\n[\n1\n]\nRose writes about these same experiments:-\nIn Guidobaldo's notebook ... it is asserted that projectiles follow parabolic paths; that this path is similar to the inverted parabola\n(\nactually a catenary\n)\nwhich is formed by the slack of a rope held horizontally; and that an inked ball that is rolled sideways over a near perpendicular plane will mark out such a parabola. Remarkably the same two examples are cited by\nGalileo\nat the end of \"The Two new sciences\" ...\nWhile we are discussing Guidobaldo and\nGalileo\n, we should note that as well as giving\nGalileo\nfinancial support, Guidobaldo supported him for the professorship of mathematics at the University of Padua in\n1592\n.\nGuidobaldo also wrote astronomy books, for example\nPlanisphaeriorum\n(1579)\nand\nProblematum astronomicorum\n(1609)\n. Guidobaldo's treatise six books on perspective\nPerspectivae libri sex\n, published in\n1600\n, contains theorems which he deduced with frequent references to\nEuclid\n's\nElements\n. Kemp writes\n[\n3\n]\n:-\nHis \"Perspectivae libri sex\" provided a definitive and often original analysis of the mathematics of perspective projection, in a far more extended way than either\nCommandino\nor Benedetti had aimed to do.\nThe most important result in Guidobaldo's treatise was that any set of parallel lines, not parallel to the plane of the picture, will converge to a vanishing point. This treatise represented a major step forward in understanding the geometry of perspective and it was a major contribution towards the development of projective geometry. It goes beyond most other works of the period on perspective in using three dimensional geometry based on the more advanced Book XI of\nEuclid\n's\nElements\n. Field writes in\n[\n2\n]\n:-\nThe relatively wide appeal of Guidobaldo's \"Six books on perspective\", and its use by later authors, shows how far the general level of mathematical education had risen. References to\nEuclid\n's work on solid geometry clearly no longer looked intimidating.\nGuidobaldo also wrote on\nrefraction\nin water but it was unpublished on his death. Interested in machines of many different types, Guidobaldo wrote on the Archimedean screw to raise water. He also invented or improved a number of mathematical instruments and compasses. In particular Guidobaldo, together with his teacher\nCommandino\n, improved the reduction compass, helping develop it into the proportional compass. Perhaps we should say exactly what a reduction compass is. It consisted of a pair of dividers with the addition of a number of sharp points that could be slid up and down the arms to provide a device capable of giving measurements in fixed proportion to how far the legs of the dividers were opened. It is said to have been invented by Fabricio Mordente as a drafting instrument but it soon became used for finding proportions between figures. In\n[\n10\n]\nGamba shows that Mordente spent some time in Urbino and had many discussions with\nCommandino\nand Guidobaldo. Gamba writes:-\nWhat role did the mathematical school of Urbino play in the invention and improving of the reduction and proportional compass? Up to now the main source of information about this question was the Preface to the treatise \"Del compasso polimetro of the Urbino mathematician Muzio Oddi\". ... The letters I publish bring new evidence on the drafting of the Preface and the intricate affair of the invention of the reduction and proportional compass. I illustrate in particular Fabrizio Mordente's stay in Urbino and discussions with\nCommandino\nand Guidobaldo.\nHow was this modified into the proportional compass? Well a proportional compass was like a pair of dividers but having a movable hinge in the middle. It had points at both ends of the legs and, depending on the position of the hinge, a fixed proportion was achieved between distances measures with the points at one end and those at the other. It was used to enlarge or reduce drawings. The next step forward from the efforts of\nCommandino\nand Guidobaldo was that of\nGalileo\nin\n1606\nwhen he developed the proportional compass into a type of slide-rule.\nYou can see a picture of a proportional compass at\nTHIS LINK\n.\nHe corresponded with several mathematicians including Contarini,\nBarocius\nand, as mentioned above,\nGalileo\n. We have still to mention one appointment which Guidobaldo accepted which seems more on a par with his service in the army than any other aspect of his career, and again reminds us that his father had written two books on military architecture. This was his appointment by the Grand Duke of Tuscany as Surveyor of Fortifications in Tuscany in\n1588\n. It appears that this was a temporary post, perhaps only requiring him to report on the existing fortifications.",
  "matematicos_citados_na_biografia": [
    "Galileo",
    "Commandino",
    "Jordanus",
    "Tartaglia",
    "Cardan",
    "Pappus",
    "Libri",
    "Euclid",
    "refraction",
    "THIS LINK",
    "Barocius"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}