{
  "nome_completo": "Guido Castelnuovo",
  "nome_curto": "Guido Castelnuovo",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Castelnuovo/",
  "data_nascimento": "14 August 1865",
  "local_nascimento": "Venice, Italy",
  "data_morte": "27 April 1952",
  "local_morte": "Rome, Italy",
  "summary": "Castelnuovo was an Italian mathematician who worked in algebraic geometry. He also worked in probability and relativity.",
  "biografia": "Guido Castelnuovo\n's father, Enrico Castelnuovo, was a famous author of novels while his mother was Emma Levi. Enrico Castelnuovo, a strong supporter of Italian unification, merits an entry in the\nDizionario Biografico Degli Italiani\nof comparable size to that of his son Guido Castelnuovo.\nGuido attended the Foscarini grammar school in Venice, where his mathematics teacher was Aureliano Faifofer. After he had completed his secondary education he studied mathematics at the University of Padua. There Castelnuovo was taught by\nVeronese\nwho gave him an interest in geometry. It was to become the main research interest of his career. Castelnuovo graduated from Padua in\n1886\nand spent the following year in Rome on a postgraduate scholarship.\nVeronese\nhad advised Castelnuovo about the best places in which to continue his research but pointed out the problems of going to Rome:-\nRome should be the best place, but unfortunately\nCremona\nis too busy in politics, I don't know how successfully, and he has not been interested in science for a long time. But I think he is still giving the Higher Geometry course.\nSoon after graduating Castelnuovo sent a copy of one of his papers to\nCorrado Segre\n, the professor in Turin. Castelnuovo expressed his surprise when he received a copy of the paper back with carefully thought out notes and suggestions on it and wrote to Segre saying how unusually helpful his comments had been. Segre replied:-\nYou are right. It is a bad habit, even if widespread, to praise papers without reading them. On the contrary I have the habit of reading all the papers I receive and of sending my remarks to the authors: I do with others what I would like the others to do with me.\nThese letters mark the beginning of a long correspondence and collaboration between the two mathematicians.\nAfter his year in Rome Castelnuovo obtained his first appointment as an assistant to\nD'Ovidio\nat the University of Turin. While at Turin he was strongly influenced by\nCorrado Segre\n. This was a period when Castelnuovo produced research of the highest quality on the theory of algebraic curves. In\n1873\nAlexander von\nBrill\nand\nMax Noether\nhad published a joint work on properties of linear series. Castelnuovo made a major step forward reinterpreting the results of this paper in projective terms.\nIn\n1891\nCastelnuovo was appointed to the Chair of Analytic and\nProjective Geometry\nat the University of Rome. In Rome Castelnuovo was a colleague of\nCremona\nbut although he had given up active research he was still teaching the Higher Geometry course despite the fact that he had \"not been interested in science for a long time\", as\nVeronese\nhad commented five years earlier.\nAfter\nCremona\n's death in\n1903\n, Castelnuovo began to teach the advanced geometry courses. He divided his course into two parts, the first part being a general overview of mathematics while the second part was on the theory of plane algebraic curves. This structure was quite deliberate as it formed part of his philosophy on how mathematics should be taught. He wrote:-\n... the reason for the division is that on the one hand it is necessary to have general culture, on the other hand it is necessary to have deep knowledge of a particular field.\nAnother influence on the way he taught was his belief that students should:-\n... see how problems arise from applications, but to look at the theoretical interest they have, beyond the interest in their applications. ... theoretical results could find unexpected applications in the future.\nLater in his career at Rome he taught a course on algebraic functions and abelian integrals in which he treated the theory of\nRiemann\nsurfaces,and courses on non-euclidean geometry,\ndifferential geometry\n, interpolation and approximation, and\nprobability theory\n. He explained why he found probability an interesting topic to teach:-\nProbability is a science of recent formation; hence in it, better than in other branches of mathematics, one can see the relationship between the empirical contribution and the one given by reasoning, and between the process of inductive and deductive logic used in it. The fact that it is a science in the making explains why it is appropriate to give frequent examples to show the applications of known methods or to introduce new ones.\nCastelnuovo also wrote a book on probability, publishing\nCalcolo della probabilità\nⓉ\n(\nCalculation of probability\n)\nin\n1919\nand a text on the theory of relativity in\n1923\n. A summary of his important probability text is given in\n[\n14\n]\n. An interest in the history of mathematics is evident from the interesting history book\nLe origini del calcolo infinitesimale nell'era moderna\nⓉ\n(\nThe origins of calculus in the modern era\n)\n(1938)\nwhich he wrote on the calculus up to the time of\nNewton\nand\nLeibniz\n. His interest in the history of mathematics was also evident in all the courses he taught. Another of his interests was natural philosophy, in particular he was interested in determinism and chance, causality and indeterminacy.\nCastelnuovo's most important work, however, was done in\nalgebraic geometry\n, publishing\nGeometria analitica e proiettiva\nⓉ\n(\nAnalytic and projective geometry\n)\nin\n1903\n. His areas of interest in geometry included the geometry of algebraic curves, linear systems of plane curves from the point of view of birational\ninvariants\n, and the theory of surfaces. In the area of algebraic curves we should mention the Castelnuovo-Severi inequality and a related criterion which Castelnuovo found for the linearity of an algebraic system on a curve. He published three famous papers on linear systems dating from the early\n1890\ns. In the second of these, which appeared in\n1891\n, he gave the first systematic use of the characteristic series and of the adjoint system. His study of the fundamental curves of the system led him to investigate the theory of surfaces, a topic on which he collaborated with\nEnriques\n.\nCastelnuovo produced a series of papers over a period of\n20\nyears which, together with\nEnriques\n, finally produced a classification of algebraic surfaces. Their collaboration began in\n1892\n, shortly after Castelnuovo had taken up his chair in Rome. At first the collaboration was between the established mathematician Castelnuovo and the young twenty year old\nEnriques\nso the relationship was that of teacher and student.\nEnriques\nstruggled with the concepts as he tried to understand the theory of algebraic surfaces, making mistakes in his attempts. He showed his appreciation of Castelnuovo's help and patience writing:-\nIf there is a thing which moves me and encourages me to correct my attitude, apart from the feeling of necessity of dong so, more than the rigour, even if benevolent, of Segre, it is your magnanimity. You, who are witness of my errors more than anyone else, never criticised me in a harsh way and you never showed impatience with me.\nThey pursued the idea that a\nRiemann\n-Roch theorem for surfaces would be a powerful tool. Their classification of algebraic surfaces was published in\n1914\nbut their collaboration had led to many joint papers during the course of the work. Details of their collaboration is given in\n[\n11\n]\n. In\n1901\nCastelnuovo and\nEnriques\nhad submitted their joint work for the Royal Prize in Mathematics awarded by the\nAccademia dei Lincei\n.\nVeronese\n, Cerruti,\nBianchi\n,\nDini\nand\nD'Ovidio\nformed the committee which had to decide whether to award the prize. After lengthy discussions it was decided not to make an award because Castelnuovo and\nEnriques\nhad made a joint submission. They argued that it was joint work done in close collaboration so it was impossible to disentangle their individual contributions, but no award was made. Both received the prize in subsequent years; Castelnuovo in\n1905\nand\nEnriques\nin\n1907\n. See\n[\n2\n]\nfor details.\nCastelnuovo is also remembered for the\nKronecker\n-Castelnuovo theorem which states:-\nIf the sections of an irreducible algebraic surface with a doubly infinite system of planes turn out to be ruler curves, then the above surface is either ruled or the Roman surface of\nSteiner\n.\nKronecker\nhad first stated a version of this theorem in a lecture which he gave to the\nAccademia dei Lincei\nin\n1886\n. Castelnuovo had only recently graduated when he was informed by\nCremona\nof\nKronecker\n's lecture and he found his own proof of the result.\nKronecker\nnever published the theorem and it was Castelnuovo's version which appeared in print.\nIn all Castelnuovo produced over\n100\npublications if one counts his books, articles and scientific memoirs. Further information on him has become available recently since his daughter Emma Castelnuovo, the author of\n[\n4\n]\n, preserved the archive of Castelnuovo's papers and various historians of mathematics such as Gario and Conte have begun to study this material, see for example\n[\n8\n]\n, and\n[\n5\n]\n.\nCastelnuovo retired from teaching at the University of Rome in\n1935\n. This was a period of great political difficulty in Italy as in the rest of Europe. Italy's increasingly close alliance with Hitler and his policies was resented and feared by many in Italy and most certainly by Castelnuovo. There was a sudden decision to impose anti-Semitic laws in\n1938\nwhich condemned Jews as unpatriotic, excluded them from government posts and from state universities. Gario writes\n[\n8\n]\n:-\nIn\n1938\n, like all Italian Jews, he suffered the humiliation of the racial laws which banned thousands of Jews from Italian society.\nCastelnuovo, being a Jew, was forced into hiding during the years the Nazis were in power in Italy but he organised special courses to instruct Jewish students disadvantaged by anti-Semitic government policies.\nCastelnuovo was appointed as a special commissioner of the Consiglio Nazionale delle Ricerche in June\n1944\n, after Rome was liberated, being given the task of reviving the scientific institutions in Italy which had suffered badly under Mussolini during his\n20\nyears in power. Then he became president of the\nAccademia dei Lincei\n, remaining in this position until his death. On\n5\nDecember\n1949\nhe had the honour of being named senator of the Italian Republic. Among his many foreign honours was election to the\nAcadémie des Sciences\nof Paris.\nCastelnuovo was also deeply involved in the debate on mathematical instruction at all levels and had a major influence in the development of the ministerial curricula for the scientific lyceum and technical institutes. Calculus was not brought into the school syllabus in Italy as early as in many other countries and the concept of a function only brought in around\n1910\nafter Castelnuovo's efforts.",
  "matematicos_citados_na_biografia": [
    "Veronese",
    "Cremona",
    "Corrado Segre",
    "D'Ovidio",
    "Brill",
    "Max Noether",
    "Projective Geometry",
    "Riemann",
    "differential geometry",
    "probability theory",
    "Newton",
    "Leibniz",
    "algebraic geometry",
    "invariants",
    "Enriques",
    "Accademia dei Lincei",
    "Bianchi",
    "Dini",
    "Kronecker",
    "Steiner",
    "Académie des Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}