{
  "nome_completo": "Gustav Robert Kirchhoff",
  "nome_curto": "Gustav Kirchhoff",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kirchhoff/",
  "data_nascimento": "12 March 1824",
  "local_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "data_morte": "17 October 1887",
  "local_morte": "Berlin, Germany",
  "summary": "Kirchhoff was a mathematical physicist best known for his laws on the flow of electric current.",
  "biografia": "Gustav Kirchhoff\n's father was Friedrich Kirchhoff, a law councillor in Königsberg with a strong sense of duty to the Prussian state. Gustav's mother was Johanna Henriette Wittke. The family were part of the flourishing intellectual community in Königsberg and Gustav, the most able of Friedrich and Johanna's children, was brought up to think that service to Prussia was the only course open to him. University professors were civil servants in Prussia at this time and so to be a university professor, Gustav's parents believed, represented the right position where someone of high academic abilities could serve Prussia. Given Gustav's academic abilities at school, his future career followed naturally.\nKirchhoff was educated in Königsberg where he entered the Albertus University of Königsberg which had been founded in\n1544\nby Albert, the first duke of Prussia.\nFranz Neumann\nand\nJacobi\nhad jointly set up a mathematics-physics seminar at Königsberg in\n1833\n, and they used it to introduce their students to methods of research. Kirchhoff attended the\nNeumann\n-\nJacobi\nseminar from\n1843\nto\n1846\n. Now\n1843\nwas the year in which\nJacobi\nbecame unwell, so it was\nNeumann\nwho influenced Kirchhoff in a very positive way.\nNeumann\n's interests were at this time firmly in mathematical physics and, at the time Kirchhoff began to study at Königsberg,\nNeumann\nhad become interested in electrical induction. In fact\nNeumann\npublished the first of his two major papers on electrical induction in\n1845\nwhile Kirchhoff was studying with him. Kirchhoff was taught mathematics at the University of Königsberg by Friedrich Jules Richelot.\nIt was while he was studying with\nNeumann\nthat Kirchhoff made his first outstanding research contribution which related to electrical currents. Kirchhoff's laws, which he announced in\n1845\n, allowed calculation of currents, voltages and resistances in electrical circuits with multiple loops, extending the work of\nOhm\n. Kirchhoff considered an electrical network consisting of circuits joined at nodes of the network and gave laws which reduce the calculation of the currents in each loop to the solution of algebraic equations. The first law states that the sum of the currents into a given node equals the sum of the currents out of that node. The second law states that the sum of electromotive forces in a loop in the network equals the sum of potential drops, or voltages across each of the resistances, in the loop.\nKirchhoff's laws followed from applying\nOhm\n's law but the way in which he was able to generalise the results showed great mathematical skills. At this stage Kirchhoff was unaware that\nOhm\n's analogy between the flow of heat and the flow of electricity, which formed the accepted understanding of electrical currents at that time, led to an incorrect understanding of electrical currents. Since no heat flowed in a body at a uniform temperature, it was believed that a static current could exist in a conductor. Kirchhoff's work would, a couple of years later, lead to him to realise this error and to give a correct understanding of how the theory of electric currents and electrostatics should be combined.\nThe year\n1847\nwas an eventful one for Kirchhoff. He graduated from Königsberg in that year and moved to Berlin in\n1847\nat a particularly difficult time when tensions there were high due to poor conditions in the German Confederation. Unemployment and crop failures had led to discontent and disturbances, and trouble was sparked by the news that Louis-Philippe had been overthrown by an uprising in Paris in February\n1848\n. There were revolutions in many German states and fighting in Berlin. Republican and socialist feelings meant that the monarchy was in trouble, but Kirchhoff was in a privileged position and was unaffected by events around him as he pressed forward with his career.\nHe taught at Berlin in an unpaid post from\n1848\nto\n1850\n, and it was while he was working in Berlin that he corrected the accepted understanding of electric currents and electrostatics which we referred to above. He left Berlin for Breslau in\n1850\nwhen he was appointed as extraordinary professor there. In the year that he arrived in Breslau, Kirchhoff solved a problem concerning the deformation of elastic plates. An early form of the theory had been developed by\nGermain\nand\nPoisson\nbut it was\nNavier\nwho gave the correct differential equation a few years later. Problems remained, however, which Kirchhoff solved using variational calculus.\nWhile Kirchhoff was in Breslau he met Bunsen who spent the academic year\n1851\n-\n52\nthere; the two becoming firm and lasting friends. In\n1854\nBunsen, who was working at Heidelberg, encouraged and supported Kirchhoff to move there. Kirchhoff accepted the offer of an appointment as professor of physics and he began a fruitful collaboration with Bunsen. He shared in the academic and social excitement generated in Heidelberg by the circle gathered around\nHelmholtz\n. In\n1857\nhe married Clara Richelot. She was the daughter of Friedrich Richelot, one of his mathematics professors from Königsberg.\nKirchhoff was not the only one working at the time on electric currents.\nWilhelm Weber\nand Rudolf Kohlrausch were also working on the nature of such currents and published similar results to that of Kirchhoff around\n1857\non the velocity of a current in a highly conductive wire. Kirchhoff and\nWeber\nboth discovered that the velocity was independent of the nature of the wire and was almost exactly equal to the velocity of light. However, they both dismissed this as a coincidence rather than making the step which\nMaxwell\nmade five years later of inferring that light was an electromagnetic phenomenon.\nFundamental work by Kirchhoff on black body radiation\n(\na term he introduced in\n1862)\nwas important in the development of\nquantum theory\n. Fraunhofer had observed bright lines in the spectrum produced by flames and noted that they appeared at similar frequencies to certain dark lines in the spectrum of the sun. To make further progress, however, required pure forms of substances, for if impurities were present then these confused the picture by producing lines. Kirchhoff was able to make his fundamental breakthrough by producing purer forms of substances than had been previously the case. He was then able to see, in\n1859\n, that each element had a uniquely characteristic spectrum. He presented his law of radiation, stating that, for a given atom or molecule, the emission and absorption frequencies are the same.\nKirchhoff and Bunsen went on to examine the spectrum of the sun in\n1861\nand were able to identify the chemical elements in the sun's atmosphere. They discovered two new elements, caesium and rubidium in the course of their investigations. Kirchhoff is perhaps best known for being the first to explain the dark lines in the sun's spectrum as caused by absorption of particular wavelengths as the light passes through gases in the sun's atmosphere. This work started a new era in astronomy.\nWith Clara, his first wife, Kirchhoff had three sons and two daughters and he was left to bring them up on his own in\n1869\nwhen Clara died. This was made harder by a disability which caused him to spend much of his life on crutches or in a wheelchair. He later married Luise Brömmel, who was from Goslar, in Heidelberg in\n1872\n. Kirchhoff had been made offers by other universities but he was happy in Heidelberg and turned down such offers. However as his health began to fail he realised that the experimental side of the subject, one which he greatly enjoyed, was becoming increasingly difficult. Therefore, in\n1875\nwhen he was offered the chair of mathematical physics at Berlin, he accepted since it allowed him to continue to make a strong contribution to teaching and theoretical research without the problems that his poor health was giving him in carrying out experiments. His best known treatise, published after he took up the chair in Berlin, is the four volume masterpiece\nVorlesungen über mathematische Physik\nⓉ\n(\nLectures on mathematical physics\n)\n(1876\n-\n94)\n.\nIn\n[\n1\n]\nRosenfeld sums up Kirchhoff's contribution:-\nIn a period of expanding scientific horizons, the need soon arises for ordering and logical analysis of new knowledge. Among the leading physicists of the nineteenth century, it was Kirchhoff whose temperament was best suited to this task. In all his work he strove for clarity and rigour in the quantitative statement of experience, using a direct and straightforward approach and simple ideas. His mode of thinking is as conspicuous in his contributions of immediate practical value\n(\nthe laws of electrical networks\n)\nas in those with wide implications\n(\nthe method of spectral analysis\n)\n.\nAs a teacher his contribution was substantial:-\nThe excellence of Kirchhoff as a teacher can be inferred from the printed text of his lectures\n(\nhe managed to publish only those on mechanics, the others being edited posthumously\n)\n. They set a standard for the teaching of classical theoretical physics in German universities, at a time when they were taking a leading position in the development of science.\nThe texts which he wrote also had a lasting value and they contributed to the strong development of theoretical physics in Germany in the forty years after his death.",
  "matematicos_citados_na_biografia": [
    "Franz Neumann",
    "Jacobi",
    "Neumann",
    "Ohm",
    "Germain",
    "Poisson",
    "Navier",
    "Helmholtz",
    "Wilhelm Weber",
    "Weber",
    "Maxwell",
    "quantum theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}