{
  "nome_completo": "Hannes Olof Gösta Alfvén",
  "nome_curto": "Hannes Alfvén",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alfven/",
  "data_nascimento": "20 May 1908",
  "local_nascimento": "Norrköping, Sweden",
  "data_morte": "2 April 1995",
  "local_morte": "Djursholm, Sweden",
  "summary": "Hannes Olof Gösta Alfvén was a Swedish electrical engineer, plasma physicist and winner of a Nobel Prize in Physics.",
  "biografia": "Hannes Alfvén\n's father Johannes Alfvén and his mother Anna-Clara Romanus were both physicians. We should note that, given the period in which she worked, this was a remarkable achievement for Anna-Clara who was one of the first female physicians in Sweden. Other members of Hannes' family also achieved distinction: his uncle Hugo Alfvén was a famous composer while two other uncles achieved fame, one as an inventor, the other an agronomist.\nHe read\nAstronomie Populaire\nⓉ\n(\nPopular astronomy\n)\nby Camille Flamarion as a teenager and this book proved to be a major influence in determining his fascination with astronomy. Also during his teenage years he took part in Norrköping High School's radio club, building his own radio receiver. Norrköping was too far from Stockholm to receive Swedish broadcasts, but he was able to pick up music from a radio station in Aberdeen, Scotland. After graduating from the High School, Alfvén studied mathematics and physics at the University of Uppsala, beginning his undergraduate studies in\n1926\n. He was awarded a doctorate in\n1934\nfor work on ultra high frequency electromagnetic oscillations. His doctoral thesis, containing the results of his researches which he said followed directly from the interests begun while a member of his school's radio club, was entitled\nInvestigations of the Ultra-short Electromagnetic Waves\n.\nHaving been awarded his doctorate, Alfvén was appointed a\ndocent\nin physics at both the University of Uppsala and the Nobel Institute for Physics in Stockholm. He married Kerstin Erikson in\n1935\n; they had five children Cecilia, Inger, Gösta, Reidun and Berenike. Their son became a physician, and one of their four daughters became a well-known author and one a lawyer. He spent two short periods abroad during these years, spending a few months in Berlin and a few in Cambridge. In\n1940\nhe was appointed as professor of electromagnetic theory and electric measurements at the Royal Institute of Technology in Stockholm. He continued to work in this Institute, being promoted in\n1945\nto a personal chair of electronics\n(\nrenamed plasma physics in\n1963)\n.\nIn\n1967\nAlfvén spoke out against difficulties he was experiencing obtaining financial support from Sweden for projects on peaceful uses of thermonuclear energy. He said at the time:-\nMy work is no longer desired in this country.\nHe was offered support for his work from the USSR and spent two months in the Soviet Union examining prospects there. He had also received offers of professorial appointments in the United States and he moved there to test out the strength of the research support offered. From\n1967\nonwards he held joint appointments in Stockholm, after making his peace with the Swedish government, but also at the University of California at San Diego where he was a research physicist until\n1973\n. He was named Professor at the University of California in\n1973\nbecoming professor emeritus in\n1975\n. He remained at San Diego until\n1988\nwhen he returned to Sweden.\nDespite making remarkable contributions to an understanding of the structure of the universe, Alfvén's ideas have proved controversial. This was entirely due to the innovative nature of his ideas which most scientists failed to appreciate until many years after he had proposed them. For example Peratt explains\n[\n5\n]\nthat in\n1937\nAlfvén made the:-\n... novel suggestion that the galaxy contained a large-scale magnetic field and that the cosmic rays moved in spiral orbits within the galaxy, owing to the forces exerted by the magnetic field. He argued that there could be a magnetic field pervading the entire galaxy if plasma was spread throughout the galaxy. This plasma could carry the electrical currents that would then create the galactic magnetic field.\nScientists were not ready for such a revolutionary idea and it was highly criticised. Fifty years later these ideas became part of the mainstream. Alfvén's discovery of hydromagnetic waves in\n1942\ntook less time to become accepted as correct. Again there was initially a total rejection of the idea. However he persisted and after lecturing on the topic at the University of Chicago six years later, was able to interest\nFermi\nwho was more ready than others to accept novel ideas which made sense. Perhaps the greatest difficulty encountered by Alfvén, however, was due to the firm rejection of his ideas by\nSydney Chapman\nwho was at the time the acknowledged leader in space physics. When, for example, Alfvén put forward his theory of magnetic storms and auroras in\n1939\n, the paper he wrote on the topic was rejected for publication since the results did not agree with those based on\nChapman\n's mathematical model. Alfvén spoke many years later about his problems getting his papers published\n(\nsee for example\n[\n5\n]\n)\n:-\nI have no trouble publishing in Soviet astrophysical journals but my work is unacceptable to the American astrophysical journals. The peer review system is satisfactory during quiescent times, but not during a revolution in a discipline such as astrophysics, when the establishment seeks to preserve the status quo.\nHe said in\n1986\n:-\nWe should remember that there was once a discipline called natural philosophy. Unfortunately, this discipline seems not to exist today. It has been renamed science, but science of today is in danger of losing much of the natural philosophy aspect. Scientists tend to resist interdisciplinary inquiries into their own territory. In many instances, such parochialism is founded on the fear that intrusion from other disciplines would compete unfairly for limited financial resources and thus diminish their own opportunity for research.\nAlfvén was awarded the Nobel Prize in Physics in\n1970\n. Torsten Gustafsson, a member of the Royal Swedish Academy of Sciences, gave the presentation speech\n[\n4\n]\n:-\nAlfvén introduced into discussion of the aurora the fundamental idea that plasma, even in space, has a magnetic field associated with it. In this way, he was led to study the general question of the significance of magnetic fields in the movements of plasmas. The magnetic field forces the positive and negative charges to move in different directions, giving rise to electric currents. The interaction of these currents produces mechanical forces, which can completely change the plasma's direction and speed. In particular, Alfvén discovered the existence of hitherto unsuspected magneto-hydrodynamical waves, the so-called Alfvén waves. In cosmic physics, Alfvén's fundamental contribution has been the introduction of the magnetic field of force and the application of magneto-hydrodynamics.\nAfter giving further details of the contributions made by Alfvén, he ended his speech as follows:-\nProfessor Alfvén. You have created magneto-hydrodynamics. Its development, in which you have played the major role, has shown the significance of this new branch of physics, both on the cosmic scale as well as here on earth. On behalf of the Royal Academy of Science, it is my pleasure to congratulate you on your Nobel Prize in Physics.\nAlfvén also received a large number of other prestigious awards such as the Gold Medal of the\nRoyal Astronomical Society\n(1967)\n, the Lomonosov Medal of the\nUSSR Academy of Sciences\n(1971)\n, The Gold Medal of the Franklin Institute\n(1971)\n, the Bowie Gold Medal of the American Geophysical Union\n(1988)\n, and the\nDirac\nMedal of the Australian Institute of Physics. He was elected to the Royal Swedish Academy of Sciences, the Royal Swedish Academy of Engineering Sciences, the USSR Akademia Nauk, the\nRoyal Society of London\n, the\nNational Academy of Sciences\n, and the\nAmerican Academy of Arts and Sciences\n. In addition, he was honoured by the Yugoslav and Indian academies. He received honorary doctorates from the universities of Newcastle\n(\nEngland\n)\n, Oxford, and Stockholm.\nHe has made many contributions to understanding phenomena close to the earth such as giving an explanation of the Van Allen radiation belt, explaining the reduction of the earth's magnetic field during magnetic storms, and studying the magnetosphere around the earth. He has given an explanation of the formation of the solar system and of comet's tails. Within the larger scale of the galaxy itself he has studied the dynamics of plasmas. He has produced important theories concerning the nature of the universe. But Alfvén had a substantial influence outside the area of his research\n[\n3\n]\n:-\nHannes Alfvén, with his wife Kerstin, also took an active interest in important matters outside science, especially those related to environment, population growth, and disarmament. One result of these interests was a series of books that Hannes wrote, some together with Kerstin. When nuclear power first became a possibility, Alfvén supported its development for commercial use. However, within a few years, when disadvantages emerged, Alfvén became a vigorous opponent. In Sweden, his persuasive support of the anti-nuclear position is acknowledged as an important element in Sweden's eventual decision to abandon its nuclear power program.",
  "matematicos_citados_na_biografia": [
    "docent",
    "Fermi",
    "Sydney Chapman",
    "Chapman",
    "Royal Astronomical Society",
    "USSR Academy of Sciences",
    "Dirac",
    "Royal Society of London",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}