{
  "nome_completo": "Hans Albrecht Bethe",
  "nome_curto": "Hans Bethe",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bethe/",
  "data_nascimento": "2 July 1906",
  "local_nascimento": "Straßburg, Germany (now Strasbourg, France)",
  "data_morte": "6 March 2005",
  "local_morte": "Ithaca, New York, USA",
  "summary": "Hans Bethe was a mathematician and physicist who worked on quantum mechanics.",
  "biografia": "Hans Bethe\nwas born in Strasburg in\n1906\nwhich, at the time, was part of the German Empire of Kaiser Wilhelm II.  Today, Strasbourg, as part of Alsace, is in France, though it borders the German region of Baden.  Hans' parents were Albrecht, a physician, and Ella whose father was a professor of medicine at the university in Strasbourg.  Hans was an only child whose father was a protestant and whose mother had converted from Judaism to Lutheranism, though religion was by no means a major force in his childhood.  His mother was an accomplished musician who, sadly, lost much of her hearing just prior to World War I.\nHans, it is safe to say, was well above his age in mathematical ability as a child.  Recollections of both his own and of relatives include his ability to compute square roots at the age of four, a full understanding of fractions by the age of five, and the ability to find prime numbers by the age of seven.  The latter is evidenced by the fact that he was able to compute and memorize a table of primes that included\n2\n14\n−\n3\n2^{14} - 3\n2\n1\n4\n−\n3\nand\n3\n10\n+\n2\n3^{10} + 2\n3\n1\n0\n+\n2\n.  By the age of fourteen he had taught himself calculus.\nBut mathematics and the word of numbers was not his only forte.  He learned to write very early and, soon after, began to fill notebooks with stories.  In an unusual twist, he wrote first from left to right on one line, and then from right to left on the following line, a manner of writing he much later learned was employed by the ancient Greeks on some of their tablets.\nUpon completion of his high school education in\n1924\n, he began attending the University of Frankfurt, studying theoretical physics because he felt:-\n... mathematics seemed to prove things that are obvious.\nHis interest and ability were beyond what Frankfurt could offer and he was advised to go to Münich where, in\n1926\n, he began studying with the legendary\nArnold Sommerfeld\n.  By\n1928\nhe had completed his doctorate summa cum laude with a thesis on the diffraction of electrons in crystals.  This remarkable thesis was one of his most enduring and important works.\nBy treating the electrons as waves he realized that the wavefunction had to contain certain terms with the same periodicity as the crystal's lattice structure.  This meant that for certain angles of incidence, no wavefunctions existed for an electron in a lattice.  This was a major contribution not only to solid state physics but also to the foundations of quantum mechanics as it further demonstrated the unusual consequences of the wave-like properties of matter.\nIn\n1929\nHans was awarded a Rockefeller Foundation fellowship that allowed him to spend time in Cambridge working with\nRalph Fowler\nand time in Rome working with\nEnrico Fermi\n.  While in Cambridge he coauthored a paper on the quantum theory of absolute zero with fellow visitors Guido Beck and Wolfgang Riezler that turned out to be a hoax concocted to embarrass another Cambridge physicist\n(\nand good friend of\nFowler\n's\n)\n,\nArthur Eddington\n.\nEddington\nhad just published a 'derivation' of the fine structure constant which is thought to be an underivable experimental value.  The paper by Bethe, Beck, and Riezler was later officially retracted.\nWhile in Rome that year, Hans found the atmosphere even more informal than Cambridge.  He enjoyed Cambridge, and particularly\nFowler\n, quite a bit but his relationship with\nFermi\nmight be described as having been more organic and less mechanistic.\nFermi\ntaught Bethe the value of qualitative reasoning and that physics need not -- in fact\nshould not\n-- be drudgery, but rather enjoyable. After his stay in Rome, he returned to Germany and served as a lecturer at the University of Tübingen until\n1933\n.\nWith Hitler's rise to power in\n1933\nand the enactment of the racial laws, Hans lost his job due to his mother's Jewish heritage.\nSommerfeld\ndid manage to secure for him a summer fellowship in Münich but initially few long-term possibilities were forthcoming.\nSommerfeld\nmade an attempt to obtain a post for him in Manchester with William Lawrence Bragg, but, thanks to an unusual set of circumstances he was to end up elsewhere.  As it happened, Bragg was visiting Cornell at the very time that Hans was searching for a position and at the very time Lloyd P Smith, who had studied with Hans in Münich, recommended him for a vacant theorist position at Cornell.  Bragg spoke very highly of Hans, passing along\nSommerfeld\n's praise as well, and the job was his.  Hans was to remain at Cornell for the rest of his life.\nHans' work grew to be focused primarily on nuclear research.  Despite this it was only after repeated urging on the part of his friend Edward Teller that he attended the\n1938\nWashington Conference that was dedicated to the problem of energy generation in the cores of stars.  It would be a watershed moment in his life for he was able to finally solve the problem of energy generation by applying the theoretical tools of nucleosynthesis to the data that had been so far collected in this field.  It was for this work that he won the Nobel Prize in Physics in\n1967\n.\nThe crowning achievement in this work came in\n1939\nwhen he published a paper in\nPhysical Review\nthat essentially showed how stars shine.  Oddly, though, he left the neutrino out of the proton-proton reaction equation.  This was because he had, with Rudolf Peierls five years earlier, concluded that such a process would be unobservable.  Nonetheless, his conclusion -- that the CNO cycle drove energy generation in stars much more massive that the sun while the\np\n−\np\np-p\np\n−\np\nreaction drove energy production in lighter stars -- is a staple of nearly every introductory textbook on astronomy.\nWith his work on quantum mechanics in solid state crystal lattices and his work on stellar nucleosynthesis, he was already a highly accomplished physicist in more than one subfield.  And yet, he was still able to make significant contributions to yet another distinct subfield: quantum electrodynamics\n(\nQED\n)\n.\nHans had learned QED from\nFermi\nin\n1931\nwhile he was visiting Rome, having come by way of Cambridge.  It was just after this that he published a review for the\nHandbuch der Physik\nⓉ\n(\nEncyclopedia of Physics\n)\ndealing heavily with the quantum theory of hydrogen and helium.  The seeds of his work in stellar nucleosynthesis can be seen here since these atoms play a fundamental role in stellar processes.  His work in QED included the calculation of\nbremsstrahlung\nⓉ\n(\nElectromagnetic radiation produced by the acceleration or especially the deceleration of a charged particle after passing through the electric and magnetic fields of a nucleus.\n)\nwith Walther Heitler, perhaps one of the most important results in QED in the\n1930\ns.  But QED was a controversial theory until, in\n1947\n, after attending the Shelter Island Conference, Hans was able to successfully show that QED\n(\nparticularly as descended from\nDirac\n's theory of the electron\n)\ncould, in fact, make accurate predictions of electron transitions in real hydrogen atoms.  In particular, he was able to successfully calculate the fine structure levels in these atoms\n(\nthis seems somewhat at odds with his paper mocking\nEddington\n, though\nEddington\n's approach was unusual and not at all correct\n)\n.\nOutside of Hans' theoretical contributions to physics, he was also a major contributor to the Manhattan Project during World War II.  Having become a US citizen around the time America entered the war, he was able to participate in defense-related projects and began working on the radar project at MIT's radiation laboratory.  He was convinced to participate in a summer study organized by J Robert Oppenheimer in\n1942\nwhich led to the creation of Los Alamos Laboratory in\n1943\nwith Hans as head of the theoretical division.  Among the members of his group was Edward Teller who was, at the time, still one of his best friends.  But Teller's singular obsession with developing a thermonuclear device\n(\nthe hydrogen or H-bomb\n)\nled to a cooling off in their relationship\n(\nin Hans' own words\n)\n.\nHans continued to make contributions to physics not only through direct publication but through his mentoring of younger Cornell faculty members throughout the remainder of his life.  He often advised members of the government, including a number of presidents, on numerous topics\n(\nthough mostly nuclear weapons issues\n)\n.  He was one of the first members of the Union of Concerned Scientists\n(\nUCS\n)\nfounded partly to oppose the development of anti-ballistic missiles\n(\nABMs\n)\n.\nFreeman Dyson\nremembers he always preferred to be called 'Hans' and that he had an unusual sense of humor, not only evident in his hoax publication with Beck and Reizler, but also in his lending his name to a paper\n(\na serious one at that\n)\nhe had virtually nothing to do with, simply so the ever-jocular George Gamow could publish a paper with his student Ralph Alpher, whose author line would read: R Alpher, H Bethe, and G Gamow.  This is now known as the famous\n(\ninfamous?\n)\nα\n,\nβ\n,\nγ\n\\alpha, \\beta, \\gamma\nα\n,\nβ\n,\nγ\npaper\n.\nHans remained fairly active well into his later years, most recently participating in several organized forums regarding Michael Frayn's award-winning play\nCopenhagen\n.  A telling sign of his immense influence on the world of physics was the dedication of an entire issue of\nPhysics Today\n, published by the American Physical Society, to him after his death in early\n2005\n. Bethe was honoured with the award of the\nMax Planck\nMedal in\n1955\nand the United States Atomic Energy Commission's\nEnrico Fermi\nAward in\n1961\n. In\n1957\nhe was elected a fellow of the\nRoyal Society of London\n, as well as a member of the\nNational Academy of Sciences\n(\nUnited States\n)\nin Washington, D.C.",
  "matematicos_citados_na_biografia": [
    "Arnold Sommerfeld",
    "Ralph Fowler",
    "Enrico Fermi",
    "Fowler",
    "Arthur Eddington",
    "Eddington",
    "Fermi",
    "Sommerfeld",
    "Dirac",
    "Freeman Dyson",
    "Max Planck",
    "Royal Society of London",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}