{
  "nome_completo": "Hans Ludwig Hamburger",
  "nome_curto": "Hans Hamburger",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamburger/",
  "data_nascimento": "5 August 1889",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "14 August 1956",
  "local_morte": "Cologne, Germany",
  "summary": "Hans Ludwig Hamburger was a German mathematician. He spent the Second World War in England and afterwards was a professor at universities in Berlin, Cologne and Ankara.",
  "biografia": "Hans Hamburger\n's parents were Karl Zacharias Hamburger and Margarethe Levy\n(1869\n-\n1941)\n. Karl was a barrister at the Court of Appeal and Public Notary in Berlin. Hans had a younger brother, Georg Hamburger, born in Berlin on\n10\nApril\n1891\n. Both Karl and Margarethe Hamburger were Jewish but the two boys were both baptised into the Christian Protestant religion in\n1896\n. The Hamburger family were of high status and their home was a meeting place for many leading academics, scientists and writers. This cultivated conviviality in which he was brought up did much to develop Hans' character and determine the style with which he led his life. He studied at the Royal French Gymnasium in Berlin from\n1898\nto\n1907\n. He passed the matriculation examination in October\n1907\nand, like typical German students of that time, spent time at several different universities while studying mathematics and physics. He studied at the University of Berlin, the University of Lausanne, the University of Göttingen and the University of Munich, completing his studies in Munich in May\n1914\n. At these universities Hamburger attended lectures by world-class mathematicians. At Berlin he was taught by\nFriedrich Schottky\nand\nIssai Schur\n, in Göttingen by\nEdmund Landau\n,\nOtto Toeplitz\n,\nFelix Klein\nand\nDavid Hilbert\n, and in Munich by Arthur Rosenthal,\nAlfred Pringsheim\n, and the philosopher Alexander Pfänder\n(1870\n-\n1941)\n.\nIt was at Munich that Hamburger undertook research for his doctorate, advised by\nAlfred Pringsheim\n. He submitted his\n69\n-page thesis\nÜber die Integration linearer homogener Differentialgleichungen\nⓉ\n(\nOn the integration of linear homogeneous differential equations\n)\nand, after an oral examination conducted by\nAlfred Pringsheim\nand\nArnold Sommerfeld\n, he was awarded the degree in\n1914\n. Hamburger then went to Paris to continue his studies at the Collège de France with Jacques Hadamard. However, the political situation in Europe was quickly deteriorating at this time with a diplomatic crisis developing following the assassination of Archduke Franz Ferdinand of Austria on\n28\nJune\n1914\n. Austria-Hungary declared war on Serbia on\n28\nJuly, Russia began mobilising against Austria-Hungary on the following day, and Germany declared war on Russia on\n1\nAugust. Germany attacked Luxembourg on\n2\nAugust and on\n3\nAugust declared war on France. At this stage Hamburger was a German national in France with the two countries at war. He escaped quickly back to Germany and enlisted in the army. Still in August he was sent in the Field Artillery to take part in the fighting in Galicia. His brother had trained as a lawyer but in\n1915\nhe also undertook military service.\nThe German armies in Galicia were supporting the Austro-Hungarian troops in their battles with Russia. Hamburger fought there with the German troops until December\n1916\nwhen, because of health problems, he was brought back to Germany to undertake work in aerodynamics. After being assigned to the Erste Deutsche Automobile-Fachschule near Mainz, then to the Institute for Fluid Mechanics and Aerodynamics and of aeronautics in Darmstadt, he was sent to German Experimental Institute for Aviation in Adlershof near Berlin. Hamburger was delighted to be back in Berlin for he was then able to continue undertaking research at the Friedrich-Wilhelm University of Berlin. He submitted his work on solving\nStieltjes\n' moment problem for his habilitation and received his right to teach at university in April\n1919\n. The work of his\nHabilitationsschrift\nappeared in four publications, the results were summarised in\nÜber eine Erweiterung des Stieltjesschen Momentenproblems\nⓉ\n(\nOn an extension of the Stieltjes moment problem\n)\n(1919)\nand given in full in a\n3\n-part paper with the same title\n(1920\n,\n1920\n,\n1921)\n. The related paper\nBeitrage zur Konvergenztheorie der Stieltjesschen Kettenbrüche\nⓉ\n(\nContributions to the theory of convergence of the Stieltjes continued fractions\n)\n(1919)\nwas submitted from Adlershof in\n1918\n. Margaret Eleanor Grimshaw writes\n[\n7\n]\n:-\nThe work on the moment problem incorporated earlier results of\nStieltjes\n,\nPerron\nand others, generalised them and gave new proofs and presentations.\nIn\n1920\nhe published\nÜber die Konvergenz eines mit einer Potenzreihe assoziierten Kettenbruchs\nⓉ\n(\nOn the convergence of an associate with a power series continued fraction\n)\nin\nMathematische Annalen\n. He adds a note explaining how the work was undertaken earlier:-\nPlease note that I have undertaken this work in the spring of\n1916\n. Prevented by military obligations, I could not finish the manuscript until March\n1917\nand then sent it soon after to the editors of the Journal of Pure and Applied Mathematics, who accepted the work. In February\n1919\n, I requested that the manuscript be returned because I had realised that my original proof could be significantly simplified.\nHamburger taught at the University of Berlin as a\ndocent\nfrom April\n1919\n, being promoted to Extraordinary Professor on\n1\nJuly\n1922\n. He was made a full professor at the University of Cologne on\n1\nApril\n1924\n.\nErnst Fischer\nhad been appointed as professor of mathematics at the University of Cologne in\n1920\n. At this time there was only one chair of mathematics at Cologne but a second chair was created by the Prussian Ministry of Science, Art and Education and it was to this second chair that Hamburger was appointed. On\n15\nOctober\n1925\nHamburger married Martha Jessen, known as Malla. She was the daughter of Peter Jessen\n(1858\n-\n1926)\n, the director of the library of the Berlin Arts and Crafts Museum.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which, among others, exempted non-Aryans who had served in the\n1914\n-\n18\nWar. Hamburger came under this exemption clause and so remained in his position in\n1933\n. Other Jewish mathematicians who had served in World War I and should have been exempted were, nevertheless, dismissed. Hamburger continued in post at Cologne until\n14\nNovember\n1935\nwhen he was granted leave. On\n31\nDecember\n1935\nhe was retired from his professorship and he travelled to Berlin where he lived with his widowed mother.\nOn\n14\nSeptember\n1936\nHamburger wrote to Stephen Pierce Hayden Duggan, the Director of the Institute of International Education in New York. Duggan\n(1870\n-\n1950)\nbecame head of the Department of Education at the College of the City of New York from\n1906\nand had founded the Institute of International Education in\n1919\nbeing its Director from\n1919\nto\n1946\n. Hamburger wrote\n[\n11\n]\n:-\nI have been advised by Prof James Franck in Baltimore and by Prof Wolfgang Köhler in Swarthmore to call your attention to the fact that in consequence of recent events, I have lost my position as a professor of mathematics at the University of Cologne. If as president of the Emergency-Committee you could give me any advice in this matter and if any new opportunity could be opened to me in America, I should be greatly obliged to you.\nI enclose some dates about myself and my contributions to mathematics. I have no doubt that Prof\nEinstein\n, Prof\nEisenhart\n, Prof\nvon Neumann\nand Prof\nWeyl\nwill be glad to give you more detailed information.\nI beg you to send your answer to my address\nAlbergo Riposo, Ascona/Tessin\n(\nSwitzerland\n)\nwhere I am for the next time.\nYours sincerely, Hans Hamburger.\nFor more about this letter, see\nTHIS LINK\n.\nOn\n12\nJune\n1937\n, Hamburger and his wife were divorced. Not surprisingly, Hamburger published nothing during the six years he spent in Germany after the Nazis came to power. He had published\n29\npapers up to\n1933\nwith the\n91\n-page paper\nRibaucour transformationen und sphärische Abbildung\nⓉ\n(\nRibaucour transformations and spherical imaging\n)\nappearing in\n1933\n. His next published work was\n3\n-part\nBeweis einer Carathéodoryschen Vermutung\nI\n,\nII\n,\nIII\nⓉ\n(\nEvidence for an assumption of Caratheodory  I ,  II ,  III\n)\n(1940\n,\n1941\n,\n1941)\n.\nOn\n25\nMarch\n1939\nhe submitted a request to the Cologne University Board to transfer his residence to the United States and to continue to receive payment of his pension. He wrote\n[\n4\n]\n:-\nI want to emigrate, but because I am a Jew, it is only possible if I get permission for this from my superiors. From my retirement pension I have for years supported my mother, who is completely dependent on my support ...\nThe National Socialist Executive Chairman of the Board, Erwin Fassl, put many obstacles in Hamburger's way. He wrote to the government minister:-\nWith regard to the personality of Professor Hamburger I wish to express my opinion that I do not consider him so reliable that I could endorse his application for continued payment of his pension.\nHamburger shortly thereafter changed his request to emigrate to the Netherlands. Fassl's objections did not prevent Hamburger being given permission to move to the Netherlands, initially for a period of two years but subject to being recalled at any time. He had to make six-monthly reports to the pension awarding authority. On\n14\nAugust\n1939\nHamburger left Germany and, instead of going to the Netherlands, travelled directly to Britain. In January\n1940\nthe Ministry in Cologne asked the Cologne University Administration for Hamburger's address. At this point the Ministry was told that he was in England so they immediately stopped his pension payments. Hamburger's mother, in an attempt to have the payments continue, told the Ministry that Hamburger had been travelling in England at the time that war broke out and had been prevented from returning.\nOn arriving in England, Hamburger was supported by the \"Society for the Protection of Science and Learning\" and he took up residence in Croydon where he continued his mathematical research. He explained in a letter the circumstances of his flight to England\n[\n4\n]\n:-\nI left Berlin and Germany August\n14\nth and came straight to England where I have been ever since. By this you will see that I did not carry out my original plan of stopping in Holland first and consequently I have difficulties in getting the pension due to me, paid to my mother who, of course, is depending on receiving it.\nTwo weeks after he had arrived in England, Britain and Germany were at war and this made life much harder for \"aliens\". He corresponded with\nHermann Weyl\nabout obtaining a position in the United States, in particular at Stanford University. However, in\n1940\nHamburger, as a German citizen, was placed in an internment camp. He wrote to\nHermann Weyl\n, now in Princeton, on\n28\nNovember\n1940\n[\n4\n]\n:-\nThe letter of August which you mentioned did not reach me since I was in an Internment Camp from\n25\nth of June to\n25\nth of October. I hadn't too bad a time there. I had a lot of mathematical work to do, having had to lecture to very nice scientists some of whom were very well known.\nReleased from the internment camp, he spent three weeks back in Croydon before moving to\n45\nOwlstone Road, Cambridge. However, the Society for the Protection of Science and Learning could not continue to support him. He wrote to\nHermann Weyl\non\n28\nNovember\n1940\n[\n4\n]\n:-\nAs you know I am living here on a grant kindly awarded by the Society for the Protection of Science and Learning. Actually these funds seem to be rather low and might become exhausted within not too long a space of time. The amount of my grant has been considerably reduced so that now I have to live off £\n12\n.\n10\nmonthly. And I think it is significant that when calling on the Society some days ago I was told to do everything in my power to hasten my immigration to U.S.A.\nHe wrote again to\nWeyl\non\n6\nJanuary\n1941\n[\n4\n]\n:-\nDear\nWeyl\n,\nI have to inform you that since my last letter of November the\n28\nth I have been notified by the Society for the Protection of Science and Learning that my grant which expires on January the\n31\nst cannot be renewed as the funds of the Society a running very low. Since it is extremely unlikely that I shall be able to obtain any paid work I shall be without any means on the above date and therefore I am relying entirely upon your help in these very unfortunate circumstances. I hope you will be able to find some way out for me. Sincerely and gratefully,\nYours.\nWeyl\nreplied with a letter that did not offer Hamburger much hope\n[\n4\n]\n:-\nThe Natural Science Department of the Rockefeller Foundation seems to find it beyond their means to come to rescue of all the scholars who had found a refuge in the British Empire, and, as I was recently advised, they now have under consideration a plan which, if approved, will afford a type of local assistance to scientists of eminence in England, and until it is determined whether we shall be able to forward such a plan, requests for assistance to scholars in England to come to this country will be held in abeyance.\nLet us record what happened to other members of Hamburger's family. His brother became a notary in\n1927\nbut was removed from this office in\n1935\n. In\n1938\nhe was forbidden to practise as a lawyer except as a \"consultant\" to provide legal assistance for Jews. In\n1940\nhe tried to emigrate but had left it too late. Margarethe Hamburger, the mother of Hans and Georg, died in hospital in April\n1941\nafter falling down stairs in Berlin. From September of that year Georg was forced to wear the Jewish star. In June\n1943\nhe was sent to the Theresienstadt concentration camp where he died in August of the following year.\nWe return to describe Hans Hamburger's life in England. In January\n1941\nhe was appointed as an Assistant Teacher of Mathematics at the Modern and High School in Luton, Bedfordshire. The head teacher was clearly embarrassed at having such a top mathematician teaching school children. She wrote to him on\n2\nFebruary\n1941\n[\n4\n]\n:-\nMy committee of Governors, Mr Godfrey and myself are all very sensible of the tragedy of the position in which such an eminent mathematician as yourself turns schoolmaster. But having said that we will try and forget it and make your interlude with us as happy as possible.\nHe only taught at the school for a term before returning to Cambridge in April\n1941\n. He was there when he received word of his mother's death. In Cambridge, Hamburger had great moral support from\nG H Hardy\n. In the autumn of\n1941\nhe was appointed as a Temporary Lecturer at University College Southampton.\nAfter serving as a Temporary Lecturer at University College Southampton in\n1941\n-\n42\n, Hamburger had his contract extended on\n15\nJune\n1942\nto cover the following academic year\n1942\n-\n43\n. On\n21\nJune\n1943\nhe received a permanent position at Southampton and he continued to teach there until\n1947\n. During these years he collaborated with Margaret Grimshaw writing the textbook\nLinear Transformations in n-Dimensional Vector Space\n.\nAn Introduction to the Theory of Hilbert Space\n. The book was published by Cambridge University Press in\n1951\n.\nFor extracts of reviews of this book, see\nTHIS LINK\n.\nIn\n1946\n, after World War II had ended, the University of Cologne approached Hamburger about taking up the chair at Cologne from which he had been dismissed by the Nazis. He indicated that he would like to return to Cologne but wished first to take up a position of full professor at the University of Ankara. Despite the University of Cologne being unhappy that Hamburger tried to keep the Cologne position open while continuing to work in Ankara, he did return to Cologne and take up his former chair on\n1\nJune\n1953\n. He spent\n1954\n-\n55\nas a visiting professor in the United States at Cornell University in Ithaca. Back in Cologne, he was already seriously ill when he married Vera Schereschevsky in the summer of\n1956\n. He died from tuberculosis two months after his wedding.\nMargaret Grimshaw, Hamburger's collaborator and colleague at Southampton writes\n[\n7\n]\n:-\nIn carrying out his mathematical research, Hamburger formed the habit of working far into the early morning hours and of sleeping in the afternoon. He claimed that this made possible a more intense concentration. In his relaxed and non-mathematical moments he sought society and enjoyed conversation. He was an enthusiastic dancer, skier and climber; he was knowledgeable about modern art, he enjoyed the theatre and, rather late in life, he came to have a great interest in music. As a colleague he was stimulating though exacting; as a companion he was gay and entertaining.\nShe also gives an overview of Hamburger's mathematical contributions\n[\n7\n]\n:-\nThroughout Hamburger's published work there recurs evidence of the effect of his early interest in differential geometry and mathematical methods. He had easy control over complicated analytical manipulations and long-sustained detailed investigations, and he turned again and again to geometrical interpretations to provide both motivating ideas and illustrative examples. The course of his work on each of the main problems that he tackled follows the same pattern; a series of shorter preparatory papers on different aspects of the problem, followed by a very detailed complete account, usually spread over two or three papers. There are two distinct periods of activity, before and after\n1942\n. The work of the first period contains important contributions in two fields; that of differential geometry and partial differential equations, as well as that of continued fractions and the\nStieltjes\nmoment problem with which his name is probably most frequently associated. ... After\n1942\nhis work was confined to the investigation of linear transformations in\nHilbert\nspace.\nAs a final comment, we note that Seth Shulman has pointed out that the review\n[\n1\n]\nmistakenly attributes\nHow Nazi Germany has mobilised and controlled labour\nto H L Hamburger when the pamphlet was written by Ludwig Hamburger, a labour economist, who had recently left Switzerland and obtained a position at the Brookings Institution in Washington, DC.",
  "matematicos_citados_na_biografia": [
    "Friedrich Schottky",
    "Issai Schur",
    "Edmund Landau",
    "Otto Toeplitz",
    "Felix Klein",
    "David Hilbert",
    "Alfred Pringsheim",
    "Arnold Sommerfeld",
    "Stieltjes",
    "Habilitationsschrift",
    "Perron",
    "docent",
    "Ernst Fischer",
    "Einstein",
    "Eisenhart",
    "von Neumann",
    "Weyl",
    "THIS LINK",
    "Hermann Weyl",
    "G H Hardy",
    "Hilbert"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}