{
  "nome_completo": "Hans Wilhelm Eduard Schwerdtfeger",
  "nome_curto": "Hans Schwerdtfeger",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwerdtfeger/",
  "data_nascimento": "9 December 1902",
  "local_nascimento": "Göttingen, Germany",
  "data_morte": "26 June 1990",
  "local_morte": "Adelaide, Australia",
  "summary": "Hans Wilhelm Eduard Schwerdtfeger was a German-born mathematician who worked in Galois theory, matrix theory, group theory and complex analysis.",
  "biografia": "Hans Schwerdtfeger\n's father was a Prussian Major. Hans was brought up in Göttingen where he attended school. Tragedy struck the family in\n1914\nwhen World War I broke out and Hans' father was one of the first casualties of the war. Following the end of the war in\n1918\nthe German monarchy collapsed and was replaced by a parliamentary democracy. The financial condition of the country deteriorated due to the vast expense of the war together with the excessive sums the victorious countries demanded from Germany. To avoid bankruptcy large amounts of money were printed and hyperinflation set in. The Schwerdtfeger family, already in a poor financial state after the death of Hans' father, suffered even more severe hardships that many Germans.\nHans attended secondary school in Göttingen but before completing his studies he left to work at Siemens-Schuckert in Berlin. This firm, set up in\n1903\nthrough the absorbing of the Nürnberg firm Schuckert & Co. by the Construction Firm of Siemens & Halske, took over Siemens power-engineering activities. Schwerdtfeger returned to Göttingen to complete his school education, then entered Göttingen University to study mathematics.\nAt Göttingen University Schwerdtfeger attended lectures by\nDavid Hilbert\n,\nGustav Herglotz\n,\nRichard Courant\n, James Franck,\nMax Born\nand\nBartel van der Waerden\n. After the award for his first degree from Göttingen, Schwerdtfeger went to Bonn University. There he was taught by\nFelix Hausdorff\nand\nOtto Toeplitz\n. His thesis advisor at Bonn was\nToeplitz\nand, in\n1934\n, he submitted his doctoral thesis\nBeiträge zum Matricen-Kalkül und zur Theorie der Gruppenmatrix\nⓉ\n(\nContributions to matrix calculus and the theory of the group matrix\n)\n. In the following year he married Hanna Maeder who was studying mathematics at Göttingen University. In fact Hanna later went on to become a mathematics lecturer. Of course during the years that Schwerdtfeger undertook research for his doctorate in Bonn, the political situation in Germany had changed markedly. Hitler had come to power in the Spring of\n1933\nand the Nazi party began to impose its ideas on the country. Aczél writes\n[\n1\n]\n:-\nYoung men of such background\n[\nas Schwerdtfeger\n]\nwere prime candidates for recruitment by the Nazis but, quite to the contrary, Hans Schwerdtfeger showed great courage as an outspoken critic of the regime.\nOpposition to the Nazis was of course extremely dangerous and ultimately would have meant that Schwerdtfeger would have been killed. However, realising the dangers of his position he fled from Germany in\n1936\nwith his family. They settled first in Prague but in\n1939\n, with World War II imminent, they left for Zürich, moved on to Grenoble and finally Toulon before escaping from war torn Europe and emigrating to Sydney in Australia. In\n1940\nhe was appointed as a lecturer at the University of Adelaide, moving to the position of Senior Lecturer at the University of Melbourne. In\n1957\nhe was appointed as an Associate Professor of Mathematics at McGill University in Montreal in Canada, and he was promoted to full Professor in\n1960\n[\n1\n]\n:-\nHe continued to have strong convictions and opinions and did not hesitate to express them vigorously.\nHe remained at McGill University until he retired in\n1983\nwhen he returned to Australia as a visiting Research Fellow at the University of Adelaide. Schwerdtfeger's son, Peter Schwerdtfeger, lived in Adelaide where he was Professor of Meteorology at Flinders University. Peter had been appointed Foundation Professor of Meteorology there in\n1971\nand worked on topics such as boundary layer meteorology and climatology.\nWe now look at some of his mathematical contributions. Aczél writes:-\nHis main fields of interest were\nGalois theory\n, matrix theory, theory of groups and their geometries and complex analysis. He achieved important results in all these fields.\nSchwerdtfeger began publishing mathematics papers after obtaining a position in Australia. His early papers include\nOn generalized Hermitian matrices\n(1942)\n,\nOn contact transformations associated with the symplectic group\n(1942)\n,\nSkew-symmetric matrices and projective geometry\n(1944)\n,\nOn the representation of rigid rotations\n(1945)\n, and\nThe Isoperimetric Problem\n(1945)\n. This last publication resulted from a lecture he gave to the to the Adelaide University Mathematical Society and was published as a\n14\npage pamphlet. In\n1950\nSchwerdtfeger published his first major text aimed at beginning graduate students,\nIntroduction to Linear Algebra and the Theory of Matrices\n. W Givens writes in a review:-\nThis valuable book is an introduction to the concepts of linear algebra and the theory of matrices which the author intends to supplement with another\n(\nshorter\n)\nvolume including the elementary divisor theory. ... Admirable features of the book include a list of examples for solution, footnotes with historical notes, references to the original literature and to extensions of the topics treated, a geometric framework for the algebraic results, and a summary of the principal problems considered ... There are many detailed results not available elsewhere in a text at this level. ... the results are generally clear and accurate and the general impression made by the book is pleasing. Many graduate students, particularly those interested in applications, should find this a useful addition to the elementary literature of the subject.\nAfter moving to Canada, Schwerdtfeger published further important textbooks. In\n1962\nhe published\nGeometry of complex numbers : Circle Geometry, Möbius Transformations, Non-Euclidean Geometry\nwhich:-\n... should be in every library, and every expert in classical function theory should be familiar with this material. The author has performed a distinct service by making this material so conveniently accessible in a single book.\nIn fact as a consequence of this book, a problem about\nMöbius\ntransformations was proposed by Bert Schweizer. This problem, concerning the nature of subsets of the plane on which collinearity is only preserved by linear functions, gave rise to a substantial body of research.\nSchwerdtfeger's other important textbook is\nIntroduction to group theory\n(1976)\n. The book concentrates on finite groups and leads the reader through many results which are given in the form of exercises.\nAczél writes in\n[\n1\n]\n:-\nHe was an inspiring teacher, gratefully remembered by his students. He had a prominent role in revitalizing mathematics in Australia and was a focal point in the scientific and, with his wife Hanna, in the social life of McGill's Department of Mathematics. In addition to his research and teaching, he is remembered for his integrity, dignity, generosity and friendship.\nSchwerdtfeger was honoured with election to the\nRoyal Society of Canada\nin\n1964\n.",
  "matematicos_citados_na_biografia": [
    "David Hilbert",
    "Gustav Herglotz",
    "Richard Courant",
    "Max Born",
    "Bartel van der Waerden",
    "Felix Hausdorff",
    "Otto Toeplitz",
    "Toeplitz",
    "Galois theory",
    "Möbius",
    "Royal Society of Canada"
  ],
  "imagens": [
    "schwerdtfeger.jpg"
  ]
}