{
  "nome_completo": "Harold Davenport",
  "nome_curto": "Harold Davenport",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davenport/",
  "data_nascimento": "30 October 1907",
  "local_nascimento": "Huncoat, Lancashire, England",
  "data_morte": "9 June 1969",
  "local_morte": "Cambridge, England",
  "summary": "Harold Davenport worked on number theory, in particular the geometry of numbers, Diophantine approximation and the analytic theory of numbers. He wrote a number of important textbooks and monographs including The higher arithmetic (1952) .",
  "biografia": "Harold Davenport\n's parents were Nancy Barnes and Percy Davenport. Nancy was the daughter of John Barnes who owned Perseverance Mill, and Percy worked for John Barnes, first as a clerk and later as the company secretary. Nancy and Percy had two children, Harold having a younger sister Grace.\nHarold attended Accrington Grammar School from the age of about ten years. His main interests were mathematics and chemistry\n[\n7\n]\n:-\nHe was much inspired by his chemistry master, Mr Ackroyd, and by his mathematics mistress, Miss Heap, 'a lady with enthusiasm for mathematics, who paid no attention - thank God - to any regular syllabus or curriculum there may have been'.\nThere were other subjects which interested Harold too, for he loved reading and read every Dickens classic that he could borrow from the local Public Library.\nIn\n1924\nhe obtained two scholarships to attend Manchester University, one from Lancashire County and a university scholarship. He studied mathematics and chemistry at Manchester being taught complex analysis by\nMordell\nand applied mathematics by\nMilne\n. At first he seriously considered a career in chemistry, and he wanted to take both subjects to honours level. But slowly he became more certain that his future was with mathematics so, when he found he could not continue to study both subjects, the decision was not too difficult. He graduated from Manchester with First Class honours in mathematics in\n1927\n.\nAfter Manchester he went to Trinity College, Cambridge, to take another 'first degree' which was a common thing to do at that time, and he was advised to do so by\nMilne\n. Among the friends he made at Cambridge were\nCoxeter\n,\nPaley\n,\nSadler\n, and\nUrsell\n. He had\nFowler\nas an applied mathematics director, and at first his pure mathematics director was S Pollard, then later was\nBesicovitch\n.\nCoxeter\nwrote\n(\nsee for example\n[\n7\n]\n)\n:-\nWhen Davenport was working for the Tripos he seemed wonderfully relaxed. He would give me a cheerful welcome whenever I dropped in to see him under the Clock in Trinity Great Court. I would find him listening to Scheherazade on the phonograph or reading Gibbon's 'Decline and Fall' for the third time. He and\nSadler\nand I often went together to a cinema or to the Festival Theatre. I once asked him how he managed to do such a prodigious amount of mathematics. He replied: \"Between midnight and\n3\na.m.\" His mind must have worked so rapidly that he could do in those three hours more than anyone else could do in six.\nDavenport was most attracted by\nLittlewood\n's lectures on the theory of\nprimes\nand those of\nBesicovitch\non almost periodic functions. Davenport wrote a Ph.D. thesis at Cambridge under\nLittlewood\n's supervision. His research involved studying the distribution of quadratic residues, and he invented new methods to attack his problems involving character sums and exponential sums.\nHe was awarded a\nRayleigh\nPrize in\n1930\nbut expressed disappointment at not being a Smith's Prizeman. He was elected to a Trinity fellowship in\n1932\nand soon after taking up the fellowship he visited\nHasse\nin Marburg and wrote an important joint paper with him. This visit came about because\nHasse\nwished to learn English and had written to\nMordell\nasking him to recommend a young English mathematician who might come to Göttingen to teach him. In fact not only did Davenport teach\nHasse\nEnglish, but he himself became fluent in German during his year at Göttingen\n[\n2\n]\n:-\n... he used to claim that Germans would accept him as a compatriot albeit with the accent of a distant province.\n(\nTo the Anglo-Saxon ear that province indubitably lay near the Mersey.\n)\nDavenport met\nHeilbronn\nwhile in Germany and they began a research collaboration which lasted for many years. After returning to Cambridge his research struck an incredibly rich vein and he published a great number of papers. At this time life in Cambridge was enriched by a large number of visiting mathematicians who were escaping from the Nazi threat on the Continent. Those who interacted with Davenport included\nRichard Rado\n,\nHirsch\n,\nCourant\n, Taussky\n(\nlater\nTaussky-Todd\n)\n,\nKober\nand\nMahler\n.\nHe left Cambridge in\n1937\n, accepting an offer from\nMordell\nof an assistant lectureship at the University of Manchester. There he was influenced by\nMordell\nto become interested in both the geometry of numbers and\nDiophantine approximation\n. While he taught at Manchester he had a number of outstanding colleagues including\nMahler\n,\nErdős\n, and\nBeniamino Segre\n. During his four years on the staff he received a number of honours including a fellowship of the\nRoyal Society\nand the\nAdams\nPrize from the University of Cambridge, both in\n1940\n.\nIn\n1941\nDavenport was appointed to the chair of mathematics at the University College of North Wales at Bangor. Three year later he married Anne Lofthouse who was on the staff of the modern languages department. They had two children, James and Richard. Harold and Anne left Wales and moved to London in\n1945\nwhen Davenport succeeded\nJeffery\nas Astor professor of mathematics in University College, London.\nRogers\nwrites about the time shortly after Davenport came to University College\n(\nsee\n[\n7\n]\n)\n:-\n... I attended Davenport's lectures and seminars, and I am proud to claim to be one of Davenport's students. He gave me inspiration and unlimited help, and friendship. At this time Davenport worked mainly on the geometry of numbers and on Diophantine approximation; he also acquired a lasting interest in problems of packing and covering. It was this last interest that spurred me to some of my most satisfying work.\nStanford University in California provided an excellent place for study leave during\n1947\n-\n48\nand the friendships he made with\nPólya\nand\nSzego\nlasted throughout their lives. In\n1958\nDavenport returned to Cambridge as\nRouse Ball\nProfessor of Mathematics on the retirement of\nBesicovitch\n. This gave him less administrative duties, and more opportunities to make visits to other universities such as Göttingen, Ann Arbor, Boulder, and Milan. His style of doing mathematics at Cambridge is described by Lewis in\n[\n6\n]\n:-\nDavenport used to sit from\n10\nto\n12\nmost mornings drinking coffee and talking to his students and colleagues, including the many post-doctoral visitors who appeared at Cambridge each year. A pad of paper was readily at hand. The students always knew where he could be found and that he was always ready to discuss their latest successes and failures. Usually it was a conversation between him and one other; but the students all sat around waiting their turn to put a question. The conversation was almost entirely mathematical ...\nDavenport worked on\nnumber theory\n, in particular the geometry of numbers, Diophantine approximation and the analytic theory of numbers. He contributed to\nWaring\n's problem early in his career by proving that every sufficiently large number was the sum of sixteen fourth powers. He wrote a number of important textbooks and monographs.\nThe higher arithmetic\n(1952)\nwas a book written at a low level in an attempt to bring results in number theory before as wide an audience as possible.\nAt the most advanced level he wrote a monograph\nAnalytic methods for\nDiophantine equations\nand Diophantine inequalities\n(1962)\nwhich includes many of his contributions extending the\nHardy\n-\nLittlewood\nmethod. He also wrote an important monograph on the analytic approach to the theory of the distribution of primes\nMultiplicative number theory\n(1967)\n.\nWe mentioned above that Davenport had been elected a Fellow of the\nRoyal Society\nwhile still an assistant lecturer. In\n1967\nthe Society awarded him its\nSylvester\nMedal:-\n... in recognition of his many distinguished contributions to the theory of numbers.\nHe was President of the\nLondon Mathematical Society\nduring\n1957\n-\n59\n, and was awarded the Berwick Prize by that Society in\n1954\n. He was elected to the Royal Society of Science of Uppsala in\n1964\n.\nDavenport described his philosophy of mathematics in the following way:-\nMathematicians are extremely lucky, they are paid for doing what they would by nature have to do anyway. One should not have a non-teaching fellowship too long, there comes a time when one must make a contribution to society. Great mathematics is achieved by solving difficult problems not by fabricating elaborate theories in search of a problem.\nAlways a heavy smoker\n(\nhe tried to give up the habit several times but always failed\n)\n, Davenport succumbed to lung cancer at a young age. His influence on those around him is summed up in\n[\n7\n]\nas follows:-\n... the extent which he helped others can only be guessed, he was probably responsible for encouraging work at least as extensive as his own. ... He made his collaborators and colleagues his friends, and gave them generously of his humour and wisdom. He made a practice of writing helpful letters to all who approached him on mathematical matters whether they were professionals, students, amateurs or even cranks. By correspondence and by direct contact he stimulated and encouraged many mathematicians to do much of their best mathematics.\nDavenport's character is described in\n[\n2\n]\n:-\nDavenport was a natural conservative. \"All change is for the worse\" he used to say with complete conviction. He was entirely out of sympathy with the waves of change in the teaching of mathematics but accepted them as an inevitable evil. Selective in his enjoyment of modern technology, he never entered an aeroplane, would use a lift if no alternative existed\n(\nat the International Congress in Moscow he trudged up and down the interminable stairs of Stalin's skyscraper\n)\n, and preferred to send his papers for publication written in his characteristically neat hand.",
  "matematicos_citados_na_biografia": [
    "Mordell",
    "Milne",
    "Coxeter",
    "Paley",
    "Sadler",
    "Ursell",
    "Fowler",
    "Besicovitch",
    "Littlewood",
    "primes",
    "Rayleigh",
    "Hasse",
    "Heilbronn",
    "Richard Rado",
    "Hirsch",
    "Courant",
    "Taussky-Todd",
    "Kober",
    "Mahler",
    "Diophantine approximation",
    "Erdős",
    "Beniamino Segre",
    "Royal Society",
    "Adams",
    "Jeffery",
    "Rogers",
    "Pólya",
    "Szego",
    "Rouse Ball",
    "number theory",
    "Waring",
    "Diophantine equations",
    "Hardy",
    "Sylvester",
    "London Mathematical Society"
  ],
  "imagens": [
    "davenport.jpg"
  ]
}