{
  "nome_completo": "Harold Jeffreys",
  "nome_curto": "Harold Jeffreys",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jeffreys/",
  "data_nascimento": "22 April 1891",
  "local_nascimento": "Fatfield (near Durham), England",
  "data_morte": "18 March 1989",
  "local_morte": "Cambridge, England",
  "summary": "Harold Jeffreys was an English mathematician, statistician, geophysicist, and astronomer.",
  "biografia": "Harold Jeffreys\n' father was  Robert H Jeffreys\n(\nborn at Felton, Northumberland about\n1867)\nwho was the headmaster of a secondary school. His mother was Elizabeth M A Jeffreys\n(\nborn at Stannington, Northumberland, about\n1864)\n. His parents married in\n1890\n.\nHarold Jeffries attended school at Fatfield then, in\n1903\n, he was awarded a scholarship to attend Rutherford College in Newcastle- upon- Tyne. In\n1907\nhe went to Armstrong College, also in Newcastle, which later became Newcastle University. At the time Jeffreys entered the College it was a part of Durham University. There he studied mathematics, physics, chemistry and geology, graduating in\n1910\nwith distinction in mathematics.\nHe went to St John's College, Cambridge after leaving Newcastle, having obtained one of four mathematics scholarships. Among his teachers at Cambridge to exert a strong influence on him were\nH F Baker\n,\nT J I'A Bromwich\n, R Webb, A Berry and\nE Cunningham\n. He became a fellow of St John's College, Cambridge in\n1914\nand remained a fellow all his life.\nJeffreys worked in the Cavendish Laboratories on war related work from\n1915\nuntil\n1917\n. He joined the Meteorological Office from\n1917\nto\n1922\nwhere he worked on hydrodynamical problems. He returned to Cambridge and he lectured there in mathematics until\n1932\n. Jeffreys was to remain on the staff at Cambridge, but not as a mathematician. From\n1932\nto\n1946\nhe taught geophysics there, then he became Plumian Professor of Astronomy.\nAs a lecturer Jeffreys had a poor reputation. A former student D J Finney recalls:-\nIn\n1937\n-\n8\n.. Lawley and I were two young graduate mathematicians in Cambridge ... We began by attending a lecture course given by Professor Harold Jeffreys on '\nProbability\n'. He was not the clearest of lecturers, and we were soon very confused ... . Jeffreys's personal charm and enthusiasm did not prevent a steady decline in attendance until Lawley and I found ourselves the only survivors of an initial\n15\n. ... There came a week when we were both prevented from attending, and the following week we found to our embarrassment that the lecturer had abandoned the course.\nJeffreys's work in diverse areas of science had mathematical applications as their link. In geophysics he studied earthquakes, and the circulation of the atmosphere. As a result of his study of earthquake waves, Jeffreys became the first to claim that the core of the Earth is liquid.\nIn astronomy he studied the outer planets proposing models for their structures. He also studied the origin of the\nsolar system\n.\nHe was awarded honours from the\nRoyal Astronomical Society\n(1937)\n, from the\nRoyal Society of London\n(1948)\nand was knighted in\n1953\n. The\n1948\naward from the\nRoyal Society of London\nwas their Royal Medal which they awarded:-\n... for distinguished work in geophysics and his important contributions to the astronomy of the solar system.\nThe\nRoyal Society\nawarded him their Copley Medal in\n1960\n:-\n... in recognition of his distinguished work in many branches of geophysics, and also in the theory of probability and astronomy.\nAmong Jeffreys's works are\nThe Earth: Its Origin, History and Physical Constitution\n(1924)\n,\nEarthquakes and Mountains\n(1935)\nand he wrote\nMethods of Mathematical Physics\n(1946)\njointly with his wife\nBertha Jeffreys\n. They state clearly in the preface that their aims are\nto provide an account of those parts of pure mathematics that are most frequently needed in physics.\nIn pure mathematics he studied operational methods\n(\nwhere he improved on\nHeaviside\n's operational calculus and\nLaplace transforms\n)\n, cartesian\ntensors\nand asymptotic approximations. In addition to\nMethods of Mathematical Physics\nother contributions of his to pure mathematics are contained in\nTheory of Probability\n(1939)\n. His work in probability is developed along Bayesian lines and again aimed at application in the physical sciences.\nJeffreys's character is well illustrated in\n[\n3\n]\nand the following quotes give a picture:-\nFor many years he smoked intensely and in Cambridge he bicycled everywhere until over\n90\n, even after he had broken his wrist in an accident. ... Although uncommunicative, Harold could be a good talker ... though shy,\n[\nhe\n]\nwas at heart a sociable man ...\nJeffreys's life is summed up in\n[\n3\n]\nas follows:-\nHarold was held in respect, indeed reverence, in many countries, but in those who knew him well it was more than respect or reverence that he inspired, it was affection, affection for a man who for all his impressive abilities as a mathematician, for all his wide and deep knowledge, for all he had done to develop geophysics, was at heart a very friendly, unassuming person, quite free of pride or pretension.",
  "matematicos_citados_na_biografia": [
    "H F Baker",
    "T J I'A Bromwich",
    "E Cunningham",
    "Probability",
    "solar system",
    "Royal Astronomical Society",
    "Royal Society of London",
    "Royal Society",
    "Bertha Jeffreys",
    "Heaviside",
    "Laplace transforms",
    "tensors"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}