{
  "nome_completo": "Haroutune Mugurdich Dadourian",
  "nome_curto": "Haroutune Dadourian",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dadourian/",
  "data_nascimento": "5 December 1878",
  "local_nascimento": "Everek, Ottoman Empire (now Develi, Turkey)",
  "data_morte": "1 June 1974",
  "local_morte": "West Hartford, Connecticut, USA",
  "summary": "Haroutune Dadourian was professor of mathematics and physics at Trinity College, Hartford, Connecticut. He did important work on radioactivity and wrote five mathematics textbooks for science students taking a different approach from that of most authors.",
  "biografia": "Haroutune Dadourian\nwas the son of Mugurdich Dadourian and Ezgule Kalaijian. Mugurdich Everek Dadourian made copper goods in a small workshop and sold them in a separate shop. The family lived in the Armenian village of Everek in a district which was largely Turkish and today is in Turkey. Most of the people in the village were members of the Armenian Apostolic Church and worshiped in the church of Saint Theodore which had an adjoining school. Haroutune said\n[\n1\n]\n:-\nThe services were conducted in ancient Armenian, which was not very well understood by the general public, so, for many people, our house became a kind of church on Sundays. As a result, some of those who came to our house for services on Sunday adopted the Protestant Church. The Armenian Church authorities didn't like that, so they accused my father of being subversive, and he was put in jail for a short time. Then, after that, my father wrote a letter to the Church authorities stating that from now on we will be Protestants. It was a good thing. I was very young then; I must have been eight years old or something like that. I used to play hooky from the Armenian Church school because there were two teachers there in the boys' school and neither of them paid any attention to me. So, I used to take a square board, which we were supposed to take when we went out to the outhouse, and put it just outside of the door. And then I'd play hooky for the rest of the day. But when my father became a member of the Protestant Church, I was transferred to a Protestant school where there were fewer than\n20\nboys and girls, and I completely changed and became a very good student there. In that sense it was a very good thing.\nIn\n1893\n, when he was\n14\nyears old, Haroutune went to the St Paul's Institute in Tarsus for his secondary education. This school was financed by the American Board Foundation, a charity organisation located in Boston, Massachusetts. Thomas Davidson Christie\n(1843\n-\n1921)\nand his family had been sent by the American Board Foundation to teach in Turkey in\n1877\nand in\n1883\nhe became president of St Paul's Institute in Tarsus. Haroutune was taught in the school's first building, Shepard Hall, where around\n200\npupils were taught in six classes. The language teaching was good with Armenian, Turkish, French and English, but mathematics teaching was poor, the highest topic taught being trigonometry. Dadourian spent five years at this school as a pupil, was awarded a B.S. in\n1899\nand taught there for two years\n1898\n-\n1900\n. Now although he had been awarded a first degree by St Paul's Institute, the level was well below that of an equivalent degree in the USA or Europe. He was advised by Thomas Christie to go to Yale University in the United States to further his education with the aim of returning to St Paul's Institute as a teacher.\nDadourian sailed from Boulogne-sur-Mer in France to New York on the ship the\nCap Frio\n, arriving in New York on Sunday\n14\nOctober\n1900\n. He was travelling with a\n22\n-year old Greek Efthymios Karalambidis and both were going to a friend in New Haven, Connecticut. Two days later Dadourian began his studies at the Sheffield Scientific School of Yale University. He said\n[\n1\n]\n:-\nI think it was considered the best institution in the country. It was considered to be way ahead of Harvard or MIT at that time. But even then it was not much a scientific school because it was mainly an engineering school. So, when I took the courses I took electrical engineering because that was the only way to study physics. So, I spent a great deal of time on subjects that did not particularly interest me. For instance, I had three years of drawing and machine design, which was not necessary even for an engineer, it seemed to me.\nThe head of physics at the Sheffield Scientific School at this time was Charles Sheldon Hastings\n(1848\n-\n1932)\n. He had studied at Yale for his Ph.D. and, after working at Johns Hopkins University, he became the first Chair of Physics at the Sheffield Scientific School. He worked on optics and applied his expertise to the design of several large telescopes. As an undergraduate, Dadourian attended lectures by Hastings and also by Lynde Phelps Wheeler\n(1874\n-\n1959)\nand Henry Andrews Bumstead\n(1870\n-\n1920)\n. Wheeler did both undergraduate and postgraduate studies at Yale advised by\nJ Willard Gibbs\n. He was awarded his Ph.D. while Dadourian was an undergraduate and his research interests were in optics, electricity, and radio. Bumstead had studied mathematics with\nFabian Franklin\nand vector analysis with\nJ Willard Gibbs\n. He had been appointed as Hastings' assistant at the Sheffield Scientific School in\n1893\n. Although Dadourian's interests were in mathematics and physics, because of the topics offered at the Sheffield Scientific School be graduated in\n1903\nwith the degree of Ph.B.\n(\nBachelor of Philosophy\n)\nwith honours in Electrical Engineering. He won the prize for Excellence in Electrical Engineering.\nFor his graduate studies he was awarded a Loomis Fellowship in Physics and concentrated on mathematics and physics. He was advised by Bumstead who\n[\n1\n]\n:-\n... was very good as a teacher, and he was also the best man we had at the time as an investigator and in the guiding of graduate school work. In fact, he was the only one really in the whole university, for both the Sheffield and academic physics departments.\nBumstead's main research at this time was on radioactivity so it was natural that Dadourian worked on that for his Ph.D. His work was also influenced by Bertram Borden Boltwood\n(1870\n-\n1927)\n. Boltwood had been an instructor at the Sheffield Scientific School\n1896\n-\n1900\n, but at the time Dadourian began his graduate studies Boltwood was working in his private laboratory at\n139\nOrange Street, New Haven. His work led to him becoming the first, in\n1907\n, to estimate the age of rocks using their lead-uranium ratio. Dadourian said\n[\n1\n]\n:-\nWhen I started to do graduate research work, I used to go to Boltwood's private shop on Orange Street and get the radioactive material from him. That was before he was appointed professor of physics.\nDadourian was awarded an M.A. in\n1905\n, following which he was appointed as an Assistant in Physics, and a Ph.D. in\n1906\nfor his thesis\nOn the radioactivity of underground air and on some radioactive properties of thorium\n. A paper based on his thesis entitled\nThe radio-activity of thorium\nwas published in the\nAmerican Journal of Science\nin\n1906\n. Following the award of his doctorate he was appointed as a Lecturer in the Graduate School of Yale, a post he held from\n1906\nto\n1917\n. On\n3\nOctober\n1908\nhe became a naturalised American citizen.\nAt this stage Dadourian still thought it possible he might return to Armenia to teach there so he decided that rather than concentrate on research he would be better employed writing a textbook. He decided to write up the course he had been giving to the Junior Class at the Sheffield Scientific School and, in\n1913\n, published\nAnalytic Mechanics\n. He remarks in\n[\n1\n]\nthat Bumstead was very unhappy that he \"wasted\" his time writing a textbook instead of doing research.\nExtracts from reviews of this work and his other four books are given at\nTHIS LINK\n.\nSome of Dadourian's ideas about teaching mathematics are given at\nTHIS LINK\n.\nIn\n1911\nDadourian returned to his hometown in Turkey for a visit to see his relations there. It was the last time he would see them\n[\n1\n]\n:-\n... in\n1914\nduring the war my brothers and everybody else were eliminated. You know, what happened to the Jews in the Second World War happened to the Armenians in the First World War, and I think it was done at the connivance of the German government because Turkey was an ally of Germany during the First World War. ... and because they got away with murder then, then why not in the Second World War with the Jews, and that's what happened.\nBumstead had spent a sabbatical year at the Cavendish Laboratory, University of Cambridge, in\n1905\nworking with J J Thomson examining the effect of X-rays on lead and zinc. He suggested to Dadourian that he could benefit from a research visit to the Cavendish Laboratory working with J J Thomson. Dadourian went in\n1914\n, spending the summer at the Cavendish Laboratory. Speaking of J J Thomson, he said\n[\n1\n]\n:-\nHe was \"the\" professor. There was only one professor at the time. He was very nice, once you knew him. And there was at least one Nobel Prize man, C T R Wilson, who was just a reader or lecturer.\nDadourian arrived back in the United States just before World War I started\n[\n1\n]\n:-\n... during the First World War I was chairman of the Defend America by Aiding the Allies Committee in the Hartford area, when the historians and teachers of government and so on were not interested at all until we got into the war. But I was interested because I knew what was coming. So, I think probably I spent far more time and energy in international troubles than on physics or mathematics.\nAlthough World War I began in\n1914\n, the United States did not enter the war at that time. Dadourian, however, wanted to make a contribution; he said\n[\n1\n]\n:-\nI think probably I spent far more time and energy in international troubles than on physics or mathematics.\nOn\n21\nFebruary\n1917\nDadourian completed the military census form for the State of Connecticut. He gives his height as\n5\nft\n5\nin, his weight as\n137\nlbs and in reply to the question \"How many persons are dependent on you for support?\", he wrote \"Don't know. Will know after the European war.\" He writes on the bottom of the form:-\nIn conjunction with other members of the staff of the Sloane Physical Laboratory of Yale University, I have offered my services to the National Research Council\n(\nwhich is working in cooperation with the Federal Government\n)\nfor such work of investigation or testing as my training and equipment especially fit me to do.\nSoon after this he received a telegram from Augustus Trowbridge\n(1870\n-\n1943)\n, the Professor of Physics at Princeton asking him to come to see him\n[\n1\n]\n:-\nTrowbridge said that the British had devised a method of locating enemy guns, and we went to work with that. \"I don't know,\" he said, \"if the government will pay us or not, but for patriotic reasons we should work this summer anyway.\" So, on the\n1\nst of July of\n1917\n, I went there\n[\nPrinceton\n]\nto work with this group on locating enemy guns, and I stayed there until\n1919\n.\nWhile he was doing this work, he married Ruth McIntire\n(1891\n-\n1983)\n, the daughter of the medical doctor Herbert Bruce McIntire and his wife Mary Ida Woodward, in Cambridge, Massachusetts on\n28\nDecember\n1918\n. Ruth had graduated from Radcliffe College. After Dadourian completed his war work at Princeton in\n1919\nhe accepted an offer from Trinity College, Hartford, and became an associate professor of physics there. Trinity College is a liberal arts college, founded in\n1823\n. It had been extending and strengthening its teaching in scientific subjects from the early\n1900\ns. Henry Augustus Perkins\n(1873\n-\n1959)\n, a physicist, was acting President of Trinity College in\n1919\n-\n20\nand he invited Dadourian\n[\n1\n]\n:-\nThe President had resigned, so for one year Perkins was President of the college, and that was the time when he asked me to come and take over the physics department, and also to continue afterwards after he came back to the physics department.\nDadourian, who was called Daddy by his students, was Seabury Professor of Mathematics and Natural Science at Trinity College, Hartford, from\n1923\nuntil his retirement in\n1949\n. In\n1930\nhe visited the Soviet Union, spending three months visiting various towns:-\nIn every town that I visited there were new scientific institutes. Small laboratories have been attached to almost every kind of establishment, from the experimental vineyards of the Transcaucasus to the kitchen factories of Moscow. At the Academy of Sciences in Leningrad I made special inquiry whether research work is encouraged by the Soviet Government.\nHe returned to America in September\n1930\nsailing\n(\nwith his wife\n)\non the ship\nAmerica\nfrom Hamburg to Southampton to New York. The only puzzle here is that he gives his occupation as \"Importer\" which must indicate something of the purpose of his visit.\nBefore America entered World War II, he became chairman of the Defend America by Aiding the Allies Committee in the Hartford area. His political views are illustrated in\n[\n3\n]\n:-\nOften vocal on political matters, Dr Dadourian was a critic of nuclear testing and was active with the Committee for Sane Nuclear Policy. In\n1939\nand\n1940\nhe supported U.S. entry Into World War II, and was president of a group called Defend America by Aiding the Allies, and argued in\n1940\nthat \"The only way to hold this hemisphere together is to prevent Hitler's success over England.\"\nIn a\n1972\nInterview, Dr Dadourian called the Vietnam war a \"perfectly insane thing to do...There is no Hitler in Vietnam to fight.\"\nInterviewed during a peace march in\n1963\n, when he was\n84\nyears old, Dr Dadourian said; \"I will walk. I have walked the last two years. I do not take part in any other public demonstration. ... I am not a professional pacifist ...The danger of the elimination of mankind is so great that I feel everything must be done to prevent. nuclear holocaust.\"\nIn\n[\n3\n]\nthe many organisation to which he belonged are listed:-\nHe was a member of the Armenian Students Association of America, a fellow of the American Physics Society, a member of the Connecticut Civil Liberties Union, the American Civil Liberties Union, and the\nAmerican Mathematical Society\n, as well the\nAmerican Mathematical Association\n, the Connecticut Valley Association of Mathematics Teachers, Sigma Xi scientific Society and the American Association of University Professors.\nHe was taken ill at his home in West Hartford, taken to Hartford Hospital where he died on\n1\nJune\n1974\nat the age of\n95\n.\nLet us end with this tribute from one of his students\n[\n3\n]\n:-\nPresident Lockwood, a student prior to Dr Dadourian's retirement, described Dr Dadourian as \"one of the most distinguished and best-known of Trinity's faculty, and a teacher with an extremely strong and colourful personality. He will be long remembered by his colleagues, his friends and his former students.\"",
  "matematicos_citados_na_biografia": [
    "J Willard Gibbs",
    "Fabian Franklin",
    "THIS LINK",
    "American Mathematical Society",
    "American Mathematical Association"
  ],
  "imagens": [
    "dadourian.jpg"
  ]
}