{
  "nome_completo": "Harry Bateman",
  "nome_curto": "Harry Bateman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bateman/",
  "data_nascimento": "29 May 1882",
  "local_nascimento": "Manchester, England",
  "data_morte": "21 January 1946",
  "local_morte": "Pasadena, California, USA",
  "summary": "Harry Bateman was an English mathematician who did extensive work in analysis -- particularly on Special Functions and Integral Transforms.",
  "biografia": "Harry Bateman\n's parents were Marnie Elizabeth Bond and Samuel Bateman, who was a pharmaceutical chemist and commercial traveller. Harry attended Manchester Grammar School where he first grew to love mathematics, and in his final year he won a scholarship to Trinity College, Cambridge. He went up to Cambridge in\n1900\nand was Senior\nWrangler\nin the Mathematical Tripos examinations of\n1903\nwhen he was awarded his B.A.\n(\nbeing Senior Wrangler means that he was ranked first among those students who were awarded a First Class degree\n)\n. Bateman was awarded a Smith's prize in\n1905\nfor an essay on\ndifferential equations\n. That year he became a Fellow of Trinity College and he received his M.A. degree in\n1906\n. Some insight into the influence on his early mathematical development by his teachers at Cambridge is gained through a letter he wrote in July\n1945\n(\nquoted by\nErdélyi\nin\n[\n3\n]\n)\n:-\nMy own interest in the integrals of the\nEuler\n-\nLaplace\ntype dates, I think, from the time when Sir\nEdmund Whittaker\ngave some properties of the\nLaplace transformation\nin his lectures at Cambridge in\n1903\nor\n1904\n. I made some use of the method of the inverse\nLaplace\ntransformation in the Smith's prize essay and fellowship dissertation partly published in modified form in\n1909\nand\n1910\n.\nBateman began publishing mathematics while he was still an undergraduate. He published eight problems in the\nEducational Times\n, between\n1902\nand\n1910\n, and of these seven were on geometry. His first paper\nDetermination of curves satisfying given conditions\nwas written while he was still an undergraduate and it was published in the\nProceedings of the Cambridge Philosophical Society\nin\n1903\n. Two further papers appeared in print in\n1904\n, namely\nThe solution of partial differential equations by means of definite integrals\n, and\nCertain definite integrals and expansions connected with the Legendre and Bessel functions\n.\nDuring the years\n1905\nand\n1906\nBateman travelled on the continent, visiting Paris and Göttingen. It was during his visit to Göttingen that he learnt of work on\nintegral equations\nbeing undertaken by\nHilbert\nand his school. This prompted Bateman to use the methods being developed there to study the propagation of earthquake waves. On his return to England in\n1906\nhe was appointed a lecturer at Liverpool University, becoming a Reader in mathematical physics at the University of Manchester in the following year. Over these years his publication record was amazing. In addition to the papers mentioned above, he published two papers in\n1905\n, eight in\n1906\n, five in\n1907\nand seven in\n1908\n. One of these\n1908\npapers is his first publication on transformations of partial differential equations and their general solutions. This was to be a topic to which he made many important contributions, and we refer again to this work below. His\n1908\npaper was on the wave equation.\nBateman emigrated to the United States in\n1910\nhaving published four papers in\n1909\nand seventeen papers in\n1910\n. The years\n1910\n-\n1912\nwere spent at Bryn Mawr College where\nCharlotte Angas Scott\nwas the Head of Mathematics. He then spent the years\n1912\n-\n1917\nat Johns Hopkins University in Baltimore on a research fellowship.\nFrank Morley\nwas the Head of Department at Johns Hopkins and by this stage he had restored the doctoral programme there which had been in a bad way when he took over in\n1900\n. The appointment of Bateman was a brilliant move to bring an extremely active young research mathematician into the College. The year\n1912\nwas the one during which Bateman married Ethel Horner Dodd on\n11\nJuly. They had one son Harry Graham who died while he was only a child, and they adopted a daughter Joan Margaret.\nThere is one strange aspect to Bateman's career which will not be evident from our description above. In\n1913\n, while at Johns Hopkins University, he was awarded a Ph.D. At this time he was an extremely eminent mathematician with over\n60\npublications to his name, some of great importance. He did not have the typical CV of a Ph.D. student! His doctoral dissertation was entitled\nThe Quartic Curve and Its Inscribed Configurations\nand his thesis supervisor was Frank\nMorley\n. However, while at Johns Hopkins he found time to take on jobs for a variety of different organisations, being employed at the Bureau of Standards, the Mount Saint Agnes College\n(\na Baltimore college for women operated under the auspices of the Sisters of Mercy\n)\n, the Weather Bureau, and the Department of Terrestrial Magnetism.\nHe spent the rest of his life at Pasadena after being appointed in\n1917\nas professor in the Division of Mathematics, Theoretical Physics, and Aeronautics at Throop College, which was renamed the California Institute of Technology about three years later. In fact when Bateman arrived there in\n1917\nthe College had gone through a marked transition. Originally named Throop University when it was founded by Amos Throop in\n1891\n, it became Throop Polytechnic Institute in\n1893\n, then Throop College of Technology in\n1913\n. The transformation had come about largely because of the enthusiasm of George Ellery Hale, the astronomer, to make the College into a leading scientific institution. A number of superb appointments, such as that of Bateman and also the physicist Robert A Millikan, helped achieve Hale's aim.\nSome of Bateman's early work was on geometry and the influence of geometry on all his work is evident. In\n1905\nhe studied certain quartic surfaces examined earlier by\nCayley\nand\nChasles\n. In particular he constructed the\ntangent\nplane and exhibited the surface as an\nenvelope\nof planes. He is especially known for his work on\nspecial functions\nand\npartial differential equations\n. In\n1904\nhe extended\nWhittaker\n's solution of the potential and wave equation by definite integrals to more general partial differential equations.\nBateman was one of the first to apply\nLaplace transforms\nto integral equations in\n1906\n. In\n1910\nhe solved systems of differential equations discovered by Rutherford which describe radio-active decay. Bateman's method was the now familiar one of applying the complex inversion formula of the\nLaplace\ntransform. The finest contribution Bateman made to mathematics, however, was his work on transformations of partial differential equations, in particular his general solutions containing arbitrary functions. In particular he applied his methods to equations resulting from electromagnetics, then later to those arising from hydrodynamics.\nHe accumulated a vast store of information on all the familiar special functions and on his death the publication of his manuscripts was undertaken by\nErdélyi\nand his associates in the form of the well-known series\nHigher Transcendental Functions\nand\nTables of Integral Transforms\n.\nCopson\nwrites:-\nThe late Harry Bateman, during his last years, planned an extensive compilation of the \"Special Functions\". He intended to investigate and tabulate their properties, the inter-relations between them, their representations in various forms, their macro- and micro-scopic behaviour, and to construct tables of the definite integrals involving them. The whole project was to have been on a gigantic scale; it would have been an authoritative and definitive account of its vast subject.\nWhile much of the material is available, it is not readily accessible, being scattered in books and journals on many fields. The \"Guide to the Functions\" which Bateman planned would have been invaluable. The project was never completed, and, after his death, the California Institute of Technology and the U. S. Office of Naval Research pooled their resources to continue Bateman's task.\nIt turned out that no single section of Bateman's work was in a state suitable for immediate publication, and the field was so wide that it appeared essential to narrow it down if anything useful was to be accomplished. It was decided to concentrate on a three-volume work on the Higher transcendental functions, to be followed by two volumes of tables of integrals. The whole work has been carried out by the staff of the Bateman Manuscript Project, under the directorship of Arthur\nErdélyi\n.\nHe wrote a number of texts that have been reprinted as classics:\nThe mathematical analysis of electrical and optical wave-motion on the basis of\nMaxwell\n's equations\n(1915\n, reprinted\n1955)\n;\nPartial differential equations of mathematical physics\n(1932\n, reprinted\n1944\nand\n1959)\n;\n(\nwritten with H L Dryden and F D\nMurnaghan\n)\n,\nHydrodynamics\n, National Research Council, Washington, D.C.\n(1932\n, reprinted\n1956)\n; and\n(\nwritten with A A Bennett and W E Milne\n)\n,\nNumerical integration of differential equations\n(1933\n, reprinted\n1956)\n. In all Bateman published around\n200\npapers in a period of\n40\nyears. He only published five joint papers, one of those in\n1924\nbeing with\nEhrenfest\nin which they looked at applications of partial differential equations to electromagnetic fields.\nMurnaghan\nwrote that his:-\n... books and papers bristle with references which are a veritable mine of useful source material.\nBateman received many honours for his contributions, including election to the\nRoyal Society of London\nin\n1928\nand election to the\nNational Academy of Sciences\nin Washington in\n1930\n. He was elected vice-president of the\nAmerican Mathematical Society\nin\n1935\n, and was the Society's\nGibbs\nlecturer in\n1943\n. In fact he was on his way to New York to receive further recognition in the form of an award from the Institute of Aeronautical Science when he died of a coronary thrombosis. He was on a train near Milford, Utah, at the time of his death.\nHis interests outside mathematics were few\n(\npublishing\n5\npapers a year for\n40\nyears does not leave much time over!\n)\n. He was a top class chess player, however, good enough to represent Britain in a match against the USA when he was an undergraduate at Cambridge. He played in other chess tournaments too with some notable victories over leading players. His only other hobby appears to have been motoring.\nErdélyi writes in\n[\n3\n]\n:-\nBy all who knew him Bateman is praised as a charmingly modest and unassuming person, very quiet, almost of retiring disposition, but always helpful and ready to put his time and extensive knowledge at the disposal of others.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "differential equations",
    "Erdélyi",
    "Euler",
    "Laplace",
    "Edmund Whittaker",
    "Laplace transformation",
    "integral equations",
    "Hilbert",
    "Charlotte Angas Scott",
    "Frank Morley",
    "Morley",
    "Cayley",
    "Chasles",
    "tangent",
    "envelope",
    "special functions",
    "partial differential equations",
    "Whittaker",
    "Laplace transforms",
    "Copson",
    "Maxwell",
    "Murnaghan",
    "Ehrenfest",
    "Royal Society of London",
    "National Academy of Sciences",
    "American Mathematical Society",
    "Gibbs"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}