{
  "nome_completo": "Heinz Rutishauser",
  "nome_curto": "Heinz Rutishauser",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rutishauser/",
  "data_nascimento": "30 January 1918",
  "local_nascimento": "Weinfelden, Switzerland",
  "data_morte": "10 November 1970",
  "local_morte": "Zürich, Switzerland",
  "summary": "Heinz Rutishauser was a Swiss mathematician who worked in numerical mathematics and computer science.",
  "biografia": "Heinz Rutishauser\n's father was the headmaster of the Thurgauische Kantonsschule in Frauenfeld at the time that he was born. His father died when he was\n13\nyears old, and tragically his mother died three years later. Heinz, together with his younger brother and sister, then went to live in their uncle's home. He entered the Eidgenössische Technische Hochschule Zürich\n(\nETH\n)\nin\n1936\n. He had to interrupt his studies for spells of military service during which he served in the artillery in the Gotthard region. He was awarded his Matura in\n1936\nand was appointed as an assistant of Walter Saxer at ETH.\nRutishauser served as Saxer's assistant for three years while undertaking research for his doctorate. Following this he became a teacher at the\nGymnasium\nin Glarisegg on the Swiss lakeshore of Lake Constance\n(\nBodensee\n)\n. From there he moved to the Gymnasium in Trogen in the Appenzell Ausserrhoden canton in north east of Switzerland. Although a schoolteacher, Rutishauser published papers such as\nÜber Punktverteilungen auf der Kugelfläche\nⓉ\n(\nOn point distributions on a spherical surface\n)\n(1945)\nwhich examines the problem of finding\nn\nn\nn\npoints on the surface of the unit sphere so that the smallest spherical distance between any two of them is maximal;\nSur les suites et familles de fonctions méromorphes de plusieurs variables\nⓉ\n(\nOn series and families of meromorphic functions of several variables\n)\n(1947)\nand\nSur les suites et familles de représentations analytiques du\nR\n4\n\\mathbb{R}^{4}\nR\n4\nⓉ\n(\nOn series and families of analytic representations of\nR\n4\n)\n(1947)\nwhich study\nmeromorphic functions\n; and\nSur le rayon d'une sphère dont la surface contient une courbe fermée\nⓉ\n(\nOn the radius of a sphere whose surface contains a closed curve\n)\n(1948)\nwritten in collaboration with\nHans Samelson\n. He was awarded his doctorate with distinction in\n1948\nfor his thesis\nÜber Folgen und Scharen von analytischen und meromorphen Funktionen mehrerer Variabeln, sowie von analytischen Abbildungen\nⓉ\n(\nOn the consequences and results of analytic and meromorphic functions of several variables, as well as analytical pictures\n)\n.\nHe taught in Trogen until\n1948\nwhen\nEduard Stiefel\nfounded the Institute for Applied Mathematics in ETH.\nEduard Stiefel\n's aim was to build an institute where the mathematical implications of computers could be studied and he employed two assistants, Heinz Rutishauser and\nAmbros Speiser\n.\nEduard Stiefel\ndecided that the Institute for Applied Mathematics at ETH should build its own electronic computer. So he sent Heinz Rutishauser and\nAmbros Speiser\non a fact finding visit to the United States in January\n1949\n. Their assignment was to study the state of the art in computing in the United States and then to start a suitable project at the ETH. Rutishauser and\nSpeiser\nspent most of\n1949\nat Harvard with\nHoward Aiken\nand at Princeton with\nJohn von Neumann\n. They also visited a number of other computer installations, including the ENIAC at Aberdeen, Maryland, and the MARK II at Dahlgren. Returning to ETH in December\n1949\n, Rutishauser discovered that plans had changed since\nEduard Stiefel\nhad managed to persuade ETH to rent the use of\nKonrad Zuse\n's Z\n4\n.\nAmbros Speiser\nexplains that the\n[\n2\n]\n:-\n... specifications of the Z\n4\n, as seen in\n1949\n, were very convincing for\nStiefel\n, Rutishauser and\nSpeiser\n. It must be borne in mind that at this time there were hardly a dozen program-controlled computers in operation, all of them in US. Less than a handful were in use for research in numerical mathematics, the others performed routine calculations. There were no doubts that Z\n4\ncould be used for serious mathematical research. ... When the Z\n4\nmachine was installed, significant work started almost immediately. Within a few years Zürich rose to be one of the foremost centres in numerical analysis. ... The creative spirit that was ever-present, the continuous expression and evaluation of new ideas, the thoroughly based academic knowledge and the sound scientific judgment were daily realities, I am almost tempted to say: This was the air that we were breathing. I can hardly believe, that\nStiefel\n, when he decided to acquire the Z\n4\n, would have dared to hope for success of this degree! The Z\n4\nwas also extensively used in education. As early in\n1951\n, we offered to students a course in computer programming with practical exercises on the machine. We believe we were the first on the European continent to do so. This should be taken in consideration by those who often criticize that Swiss Universities were late in recognizing the importance of informatics.\nRutishauser published two papers in\n1950\n,\nÜber Folgen und Scharen von analytischen und meromorphen Funktionen mehrerer Variabeln, sowie von analytischen Abbildungen\nⓉ\n(\nOn results and sets of analytic and meromorphic functions of several variables, as well as analytical pictures\n)\nwhich continued his study of meromorphic functions and\nEine Konvergenzverbesserung für die Newtonsche Methode\nⓉ\n(\nImprovement of convergence for Newton's Method\n)\nwhich began his study of numerical methods. Also in\n1951\nthe first of a series of four papers by Rutishauser,\nEduard Stiefel\nand\nAmbros Speiser\n,\nProgrammgesteuerte digitale Rechengeräte\n(\nelektronische Rechenmaschinen\n)\nⓉ\n(\nProgram-controlled digital computing devices\n(\nelectronic calculators\n)\n)\nappearing in\n1950\nand\n1951\n.\nHerman Goldstine\nwrites:-\nIn this series of papers the authors discuss in very considerable detail a number of the important mathematical questions that naturally arise in the design of a digital computer. These topics include possible number systems, the questions of \"fixed\" vs \"floating\" point and complementation, the arithmetic processes, the grouping of numbers to achieve higher than normal precisions, conversion between number systems, the structure of finite approximation methods, error analysis, programming and coding as well as the physical organs of a machine. In many of these considerations the authors have compared the various points of view expressed by others in the field to give a comprehensive picture of the situation as understood at the present time.\nHe worked towards his\nhabilitation\nat ETH submitting the dissertation\nAutomatische Rechenplanfertigung\nⓉ\n(\nAutomatic computing plan production\n)\nin\n1951\n.\nHerman Goldstine\ngives the following summary:-\nFor some time various people have been interested in the problem of mechanizing, insofar as possible, the process of coding. In this paper the author analyses such a system and considers its merits. He establishes a machine procedure for handling the various portions of an arithmetic formula such as parentheses, etc., and discusses how these may be combined to produce codes. He then treats inductive processes and the complications that they entail.\nIn\n1955\nRutishauser was appointed extraordinary professor at ETH and, in\n1962\n, he was named Professor of Applied Mathematics. Bauer in\n[\n1\n]\nexplains Rutishauser's involvement in the development of the language ALGOL:-\n[\nIt\n]\nwas natural that Rutishauser,\nSamelson\n... and I did intensify more and more our cooperation in the area of what became called compiler-building. This had the consequence that we were forced to agree on language constructs, and again the lead of four years in practical programming Rutishauser had, thanks to the Z\n4\n, was his great asset. Rutishauser's reputation also had the effect that his appeal at the GaMM-meeting\n[\nGaMM is the Gesellschaft für Angewandte Mathematik und Mechanik\n]\nin\n1955\nto create a common programming language found the support of the GaMM president; within the 'Fachausschuss Programmieren' a working group with Zürich, Munich and later Mainz members was established that pushed the language creation. Rutishauser was not less active than\nSamelson\nand myself: the first larger working meeting of the group, that meanwhile called itself ZMD-Gruppe, took place in autumn\n1957\nin Lugano, organized by Rutishauser. At that meeting it was decided, in the name and with the approval of the GaMM, to approach the American ACM and the British Computer Society with the proposal of a joint conference for the creation of an internationally-based programming language for scientific computation. Unfortunately, the BCS did not react; the ACM, however, under its president John Carr III was cheerful and it came to a one-week ACM-GaMM conference in May\n1958\nat the ETH Zürich, thanks to the support\nEduard Stiefel\nhad given. While the English working title was IAL\n(\nInternational Algebraic Language\n)\n, the name Algorithmic Language ALGOL was already chosen in the publication, edited by A J Perlis and K Samelson, in the newly founded Springer journal 'Numerische Mathematik', Vol\n1\n(1959)\n. The further course of development of ALGOL saw Heinz Rutishauser also taking part in the conference held January\n11\n-\n16\n,\n1960\nwith thirteen experts from the USA, Germany, Switzerland, Netherlands, England, Denmark, and France in Paris. It produced ALGOL\n60\n, a milestone. Rutishauser's share was more than a thirteenth.\nOf all the algorithms which Rutishauser invented, the most famous if the\nqd\n-algorithm. He presented this algorithm in the\n74\npage booklet\nDer Quotienten-Differenzen-Algorithmus\nⓉ\n(\nThe quotient-difference algorithm\n)\n. G E Forsyth writes:-\nThis is a comprehensive exposition of the author's QD algorithm. ... The QD algorithm represents a number of computational schemes for doing a surprising number of jobs: e.g., getting all eigenvalues of a matrix from its Schwarz constants, getting the zeros of a polynomial from its coefficients, finding the poles of a function from its power series, obtaining partial fraction representations of functions, and so forth. The present booklet devotes some attention to the problems of doing QD on automatic computers, and belongs in every numerical analysis library.\nHe remained at ETH Zürich for the rest of his life, becoming one of three professors in the Group for Computer Science set up at ETH in\n1968\n. In\n1974\nthis Group became the Computer Science Institute finally becoming the Division of Computer Science in\n1981\n. Rutishauser, however, did not live to see these later developments. Bauer writes in\n[\n1\n]\nabout Rutishauser's health problems:-\nHowever, his health was not the best. This I became aware of already in\n1955\nwhen Rutishauser stayed in our house. In the night of Wednesday, February\n16\n,\n1955\n, he developed a heart problem. Fortunately, the next day it was stabilized, but he was forced to take a longer recreation stay in Klosters. He also recovered rather quickly from a heart infarction in the autumn of\n1964\n, and he was granted a few more years. But when towards the end of the\n60\n's a professorship was open for the Munich Leibniz Computing Center and Rutishauser was chosen by the Ludwig-Maximilians-Universität and the Bayerische Akademie der Wissenschaften, he did not accept. He let me know that his health would not allow him to accept this honourable offer. In\n1969\nhe became seriously ill. He died on November\n10\n,\n1970\n, sitting at his desk, with acute heart failure.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "meromorphic functions",
    "Hans Samelson",
    "Eduard Stiefel",
    "Ambros Speiser",
    "Speiser",
    "Howard Aiken",
    "John von Neumann",
    "Konrad Zuse",
    "Stiefel",
    "Herman Goldstine",
    "habilitation",
    "Samelson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}