{
  "nome_completo": "Heinrich Suter",
  "nome_curto": "Heinrich Suter",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suter/",
  "data_nascimento": "4 January 1848",
  "local_nascimento": "Hedingen (2 km N of Affoltern), Zürich Canton, Switzerland",
  "data_morte": "17 March 1922",
  "local_morte": "Dornach, Switzerland",
  "summary": "Heinrich Suter was a Swiss historian of science specializing in Islamic mathematics and astronomy.",
  "biografia": "Heinrich Suter\n's father was a farmer who also kept post horses. This was the era when carriages for long-distance travel were pulled by horses that were changed at intervals at posts\n(\nstations\n)\n. In\n1863\nSuter entered the high school for Zürich Canton where he studied Latin and Greek. He then entered both the Eidgenössische Technische Hochschule and the University of Zürich where he was taught by\nChristoffel\n,\nReye\n,\nGeiser\nand\nWolf\n. He then studied at Berlin under\nKronecker\n,\nKummer\nand\nWeierstrass\n. As well as mathematics he also studied history and philology in Berlin which were important for his research. He obtained a doctorate from the University of Zürich in\n1871\non the history of mathematics. His thesis was entitled\nGeschichte der mathematischen Wissenschaften . I; Von den ältesten Zeiten bis Ende des\n16\n. Jahrhunderts\nⓉ\n(\nHistory of the mathematical sciences. I; From the earliest times until the end of the\n16\nth century\n)\n. Hofmann writes\n[\n1\n]\n:-\n... in\n[\nhis thesis\n]\nthe significance of mathematics for cultural history was emphasized. Although Suter set forth the goal of treating the history of mathematics in terms of the history of ideas, he was prevented from attaining it because of the paucity of available data.\nSuter taught mathematics and physics in Swiss schools and became the leading expert on Muslim mathematics. His first appointment after the award of his doctorate was to Wettingen Teachers' training College in Aargau Canton where he was appointed to a temporary position. He was then employed part-time at the\nGymnasium\nin Schaffhausen in\n1874\n, then moved to a similar post in the Gymnasium in St Gall in\n1875\n. This was the year in which Suter married Hermine Frauenfelder. She was the sister of Eduard Frauenfelder who was a well-known philanthropist and preacher at Schaffhausen cathedral. Heinrich and Hermine Suter had three daughters.\nIn the year\n1876\nSuter received a full-time appointment in the cantonal school of Aargau as a teacher of mathematics and physics. He remained in this position for ten years before moving to the cantonal school of Zürich, again as a teacher of mathematics and physics. He remained in this position until he retired in\n1918\n.\nSuter's doctoral dissertation\nGeschichte der mathematischen Wissenschaften. I; Von den ältesten Zeiten bis Ende des\n16\n. Jahrhunderts\nⓉ\n(\nHistory of the mathematical sciences. I; From the earliest times until the end of the\n16\nth century\n)\nwas revised and published in\n1873\n. As can be seen from the title, this was the first part of a two part work, the second part\nGeschichte der mathematischen Wissenschaften. II; Vom Anfange des\n17\n. bis gegen Ende des\n18\n. Jahrhunderts\nⓉ\n(\nHistory of the mathematical sciences. II; From the beginning of the\n17\nth to the late\n18\nth century\n)\nwas published in\n1875\n. For around ten years after this Suter produced no research papers but he began to publish on the history of mathematics again in\n1884\n. It was only when he went to the cantonal school of Zürich in\n1886\nthat he began to learn Arabic from two Orientalists there. He then began to publish important work on the history of medieval Islamic mathematics and astronomy. The two volumes of\n[\n3\n]\ncontain two books and\n41\narticles on that topic that Suter wrote between\n1892\nand\n1922\n.\nThe most important of Suter's works is the book\nDie Mathematiker und Astronomen der Araber und ihre Werke\nⓉ\n(\nThe Arabic mathematicians and astronomers and their works\n)\n(1900)\n. Rosenfeld and Ihsanoglu write in\n[\n2\n]\n:-\n... in\n1900\n, Swiss historian of mathematics and astronomy Heinrich Suter published the bio-bibliographical survey Die Mathematiker und Astronomen der Araber und ihre Werke. Suter's book contained information on scholars not only in the Arab countries but in all the Islamic countries from the\n8\nth\nto the\n17\nth\ncenturies. Die Mathematiker und Astronomen der Araber und ihre Werke contains information on approximately\n500\nscholars whose time of life was known and\n100\nwith unknown dates.\nOther work by Suter includes\nDie Mathematiker auf den Universitäten des Mittelalters\nⓉ\n(\nMathematicians in the universities of the Middle Ages\n)\n(1887)\n, and\nDas Mathematiker-Verzeichnis im Fihrist des ... an-Nadim\nⓉ\n(\nThe mathematician directory in Fihrist of ... an-Nadim\n)\n(1892)\n. There were two versions of\nal-Khwarizmi\n's main astronomical work the\nSindhind zij\nbut the Arabic originals of both are lost. A Latin translation of one version has survived and was published by Suter in\n1914\nin\nDie astronomischen Tafeln des Muhammad ibn Musa\nal-Khwarizmi\n. One of his last works was\nBeitrage zur Geschichte der Mathematik dei den Griechen und Arabern\n(1922)\n.\nSuter was awarded an honorary doctorate from the University of Zürich in the final year of his life.",
  "matematicos_citados_na_biografia": [
    "Christoffel",
    "Reye",
    "Geiser",
    "Wolf",
    "Kronecker",
    "Kummer",
    "Weierstrass",
    "Gymnasium",
    "al-Khwarizmi"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}