{
  "nome_completo": "Heinrich Friedrich Weber",
  "nome_curto": "Heinrich Friedrich Weber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weber_Heinrich_F/",
  "data_nascimento": "7 November 1843",
  "local_nascimento": "Magdala, Thuringia, Germany",
  "data_morte": "24 May 1912",
  "local_morte": "Zürich, Switzerland",
  "summary": "Heinrich Friedrich Weber was a German physicist who was important in the history of the Zürich Polytechnic. His most famous student was Einstein.",
  "biografia": "Heinrich Friedrich Weber\nwas born in Magdala, a little town close to Weimar. He had five brothers; their father was a merchant. After completing his school education at the\nGymnasium\nin Weimar, Weber moved to Jena in order to study physics, mathematics and philosophy at the university there. Among his lecturers the physicist Ernst Abbe and the philosopher Kuno Fischer had the biggest influence on him. In\n1865\nWeber received his doctorate for a thesis entitled\nNeue Probleme der Diffraktionstheorie des Lichtes\nⓉ\n(\nNew problems of diffraction theory of light\n)\n, supervised by Abbe. Afterwards he continued to do research, under Kirchhoff, but he earned his living as a private teacher in the house of the German politician August Dennig in Pforzheim.\nIn\n1870\nWeber moved to Karlsruhe, where he worked as assistant to Gustav Wiedemann\n(1826\n-\n1899)\nat the Polytechnic School. A year later he became\nHelmholtz\n's assistant in Berlin, and in\n1874\nhe moved to Hohenheim, where he taught physics and mathematics at the Royal Academy of Württemberg. A year later he was offered a professorship at the Polytechnic in Zürich\n[\n5\n]\n:-\nWhen he noticed a short elderly gentleman among his students\n[\nat the Academy\n]\n, he did not pay much attention to him; however he was quite surprised when, directly after the lecture, that gentleman asked him whether he would like to accept a professorship in Zürich. It was Kappeler, the former president of the School Board, who had attended the lecture incognito. When appointing new members of staff, Kappeler wanted to consider only his direct personal opinion.\nAt the Polytechnic Weber mainly lectured on technical physics. He also supervised more than forty-three doctoral students; quite a few of them became professors at universities across Europe\n[\n5\n]\n. His most famous student, however, was\nEinstein\n, who often worked in Weber's laboratories. But despite being a 'lecturer beyond comparison'\n[\n5\n]\n, he also had his shortcomings: As a 'typical representative of classical physics'\n[\n4\n]\nhe did not teach\nMaxwell\n's theories, nor 'the foundations of physics, as he did not teach theoretical or mathematical physics'\n[\n3\n]\n. Therefore,\nEinstein\noften skived his lectures, on which Weber commented: \"You are a clever boy,\nEinstein\n, a very clever boy indeed. But you have a great shortcoming: you don't listen to anyone!\"\n[\n4\n]\n. However, 'he and his institute at least helped further sensitise\nEinstein\nto the importance of measurement for testing theory and for finding the best fit between theory and empirical reality'\n[\n3\n]\n.\nIn fact, as 'a pioneer in electrical engineering in Switzerland and Germany'\n[\n4\n]\nhe helped to establish a system of units of measurement, together with physicists such as\nLord Rayleigh\n, Silvanus Thompson, Friedrich Kohlrausch, Eletuhère Mascart, and\nLord Kelvin\n. The latter was a good friend of Weber's. Among other things he experimented with alternating and direct current, with heat conduction, with blackbody radiation and with specific heat.\nAmong Weber's publications,\nDie spezifische Wärme der Elemente Kohlenstoff, Bor und Silizium\nⓉ\n(\nThe specific heat of the elements carbon, boron and silicon\n)\n(1874)\n,\nDer absolute Wert der Siemensschen Quecksilbereinheit\nⓉ\n(\nThe absolute value of Siemens's Mercury unit\n)\n(1884)\n, and\nDie Entwicklung der Lichtemission glühender fester Körper\nⓉ\n(\nThe development of light-emitting glowing solid bodies\n)\n(1887)\nare of particular importance. His\n1874\npaper inspired\nEinstein\nto develop the\nEinstein\nsolid in\n1907\n.\nWeber was also interested in meteorology. He joined the Federal Meteorological Commission in\n1881\n; in\n1902\nhe became vice-president and eight years later president.   However, Weber's most important achievement was the physics institute at the Polytechnic, which opened in\n1890\n. The previous physics laboratories were too small and the equipment was out of date. For several years Weber tried to get the Swiss government's permission to build at least an extension of the existing institute, though he really wanted laboratories that could cater for any future developments in\n(\nelectrical\n)\nengineering. It was only when Werner Siemens declared his support for \"Weber's vision\n[\nwhich\n]\nproved decisive in winning the backing of Kappeler and\nGeiser\n\"\n[\n3\n]\nthat the government gave in and provided the necessary funds. Weber's ideas turned out to be highly successful: for a number of years the institute was the finest of its kind in the world and thus added to the Polytechnic's growing reputation. It was \"especially designed to train electrical engineers or applied physicists\n[\nwhich\n]\nwas what the Swiss wanted their tax money spent on\"\n[\n3\n]\n.\nWeber joined the organising committee of the first International Congress of Mathematicians at the preliminary meeting in July\n1896\n. He did not attend all the committee meetings though and did not get assigned any particular jobs\n(\nbased on the minutes\n)\n. He was the only physicist and only one of two non-mathematicians on the committee.\nWeber married Anna Hochstetter in\n1875\n. The couple had three daughters and five sons, all of which became academics: Oskar: chemist; Friedrich: geologist; Ernst: civil engineer and astronomer; Helmut and Richard: physicians\n[\n5\n]\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Helmholtz",
    "Einstein",
    "Maxwell",
    "Lord Rayleigh",
    "Lord Kelvin",
    "Geiser"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}