{
  "nome_completo": "Helena Rasiowa",
  "nome_curto": "Helena Rasiowa",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rasiowa/",
  "data_nascimento": "20 June 1917",
  "local_nascimento": "Vienna, Austria",
  "data_morte": "9 August 1994",
  "local_morte": "Warsaw, Poland",
  "summary": "Helena Rasiowa was an Austrian-born Polish mathematician who worked in algebraic logic and the mathematical foundations of computer science.",
  "biografia": "Although\nHelena Rasiowa\nwas born in Vienna, her parents were Polish. In\n1918\nPoland regained its status as an independent nation and Rasiowa's parents moved to Warsaw. She was educated there, obtaining a good secondary school education with music lessons taken at a special music school. After completing her school studies she took a course in business management before entering university.\nRasiowa entered the University of Warsaw in\n1938\nbut, after the German invasion of Poland in\n1939\n, the university closed. Rasiowa and her parents moved to Lwów\n(\nnow Lviv in Ukrains\n)\nbut the Poles were trapped between the Soviets and the Germans and Lwów came under Soviet control. Life there seemed even more difficult than under German occupation, so after a year the family returned to Warsaw.\nThere was an impressive collection of mathematicians at the University of Warsaw at this time including\nBorsuk\n,\nŁukasiewicz\n,\nMazurkiewicz\n,\nSierpiński\n,\nMostowski\nand others. They had organised an underground version of the university which was strongly opposed by the Nazi authorities.\nBorsuk\n, for example, was imprisoned after the authorities found that he was helping to run the underground university.\nIn this dangerous situation Rasiowa learnt mathematics, knowing that the penalties for being discovered were extreme. Yet in this environment Rasiowa studied for her Master's Degree under\nŁukasiewicz\n's supervision.\nWhen the Soviet forces came close to Warsaw in\n1944\n, the Warsaw Resistance rose up against the weakened German garrison. However German reinforcements arrived and put down resistance. Around\n160\n,\n000\npeople died in the Warsaw Uprising of\n1944\nand the city was left in a state of almost total devastation. Rasiowa's time during the Uprising is described in\n[\n1\n]\n:-\nIn\n1944\nthe Warsaw Uprising broke out and in consequence Warsaw was almost completely destroyed, not only because of warfare but also because of the systematic destruction which followed the uprising after it had been squashed down. Rasiowa's thesis burned together with the whole house. She herself survived with her mother in a cellar covered by ruins of the demolished building.\nAfter the war Rasiowa taught in a secondary school while her supervisor\nŁukasiewicz\nleft Poland after the terrible suffering he had gone through.\nMostowski\nhowever remembered Rasiowa's impressive work and persuaded her to return to the University of Warsaw to complete a second Master's Thesis under his supervision.\nIn\n1946\n, having obtained her Master's degree, she was appointed as an assistant at the University of Warsaw and continued to work for her doctorate under\nMostowski\n's supervision. Her thesis, presented in\n1950\n, was on algebra and logic\nAlgebraic treatment of the functional calculus of Lewis and\nHeyting\nand these topics would be the main areas of her research throughout her life.\nRasiowa was promoted steadily, reaching the rank of Professor in\n1957\nand Full Professor in\n1967\n. She led the Foundations of Mathematics Section from\n1964\nand the Mathematical Logic Section after its creation in\n1970\n.\nHer main research was in algebraic logic and the mathematical foundations of computer science. In algebraic logic she continued work by\nPost\n,\nStone\n,\nTarski\nand\nŁukasiewicz\n[\n1\n]\n:-\n... aimed at finding a precise description for the mathematical structure of formalised logical systems.\nOf course Rasiowa's work on algebraic logic was in precisely the right area to make her a natural contributor to theoretical computer science. However it is one thing to be in the right area and yet another to have the ability to see the importance of a new subject such as computer science. Her contributions are described in\n[\n1\n]\n:-\nHer contribution to theoretical computer science stems from her conviction that there are deep relations between methods of algebra and logic on the one side and essential problems of foundations of computer science on the other. Among these problems she clearly distinguished inference methods characteristic of computer science and its applications. This conviction of hers had been supported by her results on many-valued and non-classical logics, especially on applications of various generalisations of Post algebras to logics of programs and approximation logics.\nIn fact in\n1984\nRasiowa introduced an important concept of inference where the basic information was incomplete. This led to approximate reasoning and approximate logics which are now central to the study of artificial intelligence.\nRasiowa wrote over\n100\npapers, books and monographs. She also supervised the doctoral dissertations of more than\n20\nstudents. However her contributions were not restricted to research. She helped set up the journal\nFundamenta Informaticae\nwhich she was editor-in-chief from its setting up in\n1977\nuntil her death. In addition to these editorial duties she also was Collecting Editor of\nStudia Logica\nfrom\n1974\nand, from\n1986\n, an associate editor of the\nJournal of Approximate Reasoning\n.\nShe also played a major role in the mathematical life of Poland. A member of the\nPolish Mathematical Society\n, she was its secretary in\n1955\n-\n57\nand its vice-president in\n1958\n/\n59\n. She served on the Committee on Mathematics of the\nPolish Academy of Sciences\nand chaired various committees of the Polish Ministry of Science and Higher Education. It was partly through her endeavours that the Polish Society for Logic and the Philosophy of Science was set up.\nRasiowa remained active right up to her death, having completed eight chapters of a new monograph\nAlgebraic analysis of non-classical first order logics\nbefore entering hospital with her final illness.",
  "matematicos_citados_na_biografia": [
    "Borsuk",
    "Łukasiewicz",
    "Mazurkiewicz",
    "Sierpiński",
    "Mostowski",
    "Heyting",
    "Post",
    "Stone",
    "Tarski",
    "Polish Mathematical Society",
    "Polish Academy of Sciences"
  ],
  "imagens": [
    "rasiowa.jpg"
  ]
}