{
  "nome_completo": "Niels Fabian Helge von Koch",
  "nome_curto": "Helge von Koch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Koch/",
  "data_nascimento": "25 January 1870",
  "local_nascimento": "Stockholm, Sweden",
  "data_morte": "11 March 1924",
  "local_morte": "Danderyd, Stockholm, Sweden",
  "summary": "Helge von Koch is best known for the fractal Koch curve.",
  "biografia": "Helge von Koch\n's father was Richert Vogt von Koch, who had a military career, and his mother was Agathe Henriette Wrede. Von Koch attended a good school in Stockholm, completing his studies there in\n1887\n. He then entered Stockholm University.\nStockholm University was the third university in Sweden and it was planned from\n1865\n, opening in\n1880\nwith\nMittag-Leffler\nas its first professor of mathematics. We should note that although we shall refer to it here by its present name of Stockholm University, it was known in Sweden as Stockholms Högskola until\n1950\nwhich literally means \"Stockholm High School\".\nVon Koch spent some time at Uppsala University from\n1888\n. He was a student of\nMittag-Leffler\nat Stockholm University. Von Koch's first results were on infinitely many linear equations in infinitely many unknowns. In\n1891\nhe wrote the first of two papers on applications of infinite\ndeterminants\nto solving systems of\ndifferential equations\nwith analytic coefficients. The methods he used were based on those published by\nPoincaré\nabout six years earlier. The second of von Koch's papers was published in\n1892\n, the year in which von Koch was awarded a doctorate for his thesis which contained the results of the two papers. Von Koch was awarded a doctorate in mathematics by Stockholm University on\n26\nMay\n1892\n.\nGårding\nwrites in\n[\n2\n]\nthat his doctoral thesis was:-\n... a fantastically mature work ...\nBernkoff writes in\n[\n1\n]\n, however, that this work by von Koch:-\n... cannot be called pioneering. His results were all fairly accessible, although many of the calculations are lengthy. He was aware, through a knowledge of\nPoincaré\n's work, of the possibility of obtaining pathological results but did little to explore them. Yet this work can be said to be the first step on the long road which eventually led to\nfunctional analysis\n, since it provided\nFredholm\nwith the key for the solution of his\nintegral equation\n.\nGarding writes in\n[\n2\n]\n:-\nAfter the thesis von Koch wrote many papers, among others some on infinite determinants, for instance in\n1901\n, but the subject did not have many possibilities for extension and growth and present interest is nil.\nBetween the years\n1893\nand\n1905\nvon Koch had several appointements as an assistant professor of mathematics. He failed in his application for the chair of algebra and\nnumber theory\nat Uppsala University. In\n1905\nBendixson\n, who had also been a student of\nMittag-Leffler\n, resigned his professorship at KTH,\n(\nin Swedish Kungliga Tekniska Högskolan; in English the Royal Institute of Technology in Stockholm\n)\n, when he accepted a chair at Stockholm University. Von Koch was then appointed to the chair of pure mathematics at the KTH. In July\n1911\nvon Koch succeeded\nMittag-Leffler\nas professor of mathematics at Stockholm University.\nVon Koch's snowflake\n.\nVon Koch is famous for the Koch curve which appears in his paper\nSur une courbe continue sans tangente, obtenue par une construction géométrique élémentaire\nⓉ\n(\nOn a continuous curve without tangent, obtained by an elementary geometrical construction\n)\npublished in\n1904\n. This is constructed by dividing a line into three equal parts and replacing the middle segment by the other two sides of an equilateral triangle constructed on the middle segment. Repeat on each of the\n(\nnow\n4)\nsegments. Repeat indefinitely. It gives a continuous curve which is of infinite length and nowhere differentiable. If one starts with an equilateral triangle and applies the construction, one gets the von Koch snowflake\n(\nsometimes called the von Koch star\n)\nas the limit of the construction.\nThe von Koch snowflake is a continuous curve which does not have a tangent at any point. Von Koch's\n1906\npaper mainly consists of a proof of this fact. He also shows in the paper that there are two functions\nf\nf\nf\nand\ng\ng\ng\nwhich are both nowhere differentiable such that the snowflake curve is\nx\n=\nf\n(\nt\n)\n,\ny\n=\ng\n(\nt\n)\nx = f (t), y = g(t)\nx\n=\nf\n(\nt\n)\n,\ny\n=\ng\n(\nt\n)\nwhere\n−\n1\n≤\nt\n≤\n1\n-1 ≤ t ≤ 1\n−\n1\n≤\nt\n≤\n1\n.\nThe first person to give an example of an analytic construction of a function which is continuous but nowhere differentiable was\nWeierstrass\n. At the end of his paper, von Koch gives a geometric construction, based on the von Koch curve, of such a function which he also expresses analytically.\nVon Koch also wrote papers on number theory, in particular he wrote several papers on the\nprime number theorem\nsuch as\nSur la distribution des nombres premiers\nⓉ\n(\nOn the distribution of prime numbers\n)\nin\n1901\nand\nContribution à la théorie des nombres premiers\nⓉ\n(\nContribution to the theory of prime numbers\n)\nin\n1910\n.",
  "matematicos_citados_na_biografia": [
    "Mittag-Leffler",
    "determinants",
    "differential equations",
    "Poincaré",
    "Gårding",
    "functional analysis",
    "Fredholm",
    "integral equation",
    "number theory",
    "Bendixson",
    "Weierstrass",
    "prime number theorem"
  ],
  "imagens": [
    "thumbnail.jpg",
    "../../Diagrams/VonKoch.gif"
  ]
}