{
  "nome_completo": "Hendrik de Vries",
  "nome_curto": "Hendrik de Vries",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/De_Vries_Hendrik/",
  "data_nascimento": "25 August 1867",
  "local_nascimento": "Amsterdam, The Netherlands",
  "data_morte": "3 March 1954",
  "local_morte": "Binyamina, Israel",
  "summary": "Hendrik de Vries was a Dutch mathematician who was interested in projective geometry and in the history of mathematics.",
  "biografia": "Hendrik de Vries\nsometimes has his first name with the spelling\nHendrick\n. Before we give his biography we should say a little about two other mathematicians named de Vries who were both roughly the same age as Hendrik and were his colleagues. These were\nGustav de Vries\n(1866\n-\n1934)\nand his older brother Jan de Vries\n(1858\n-\n1928)\n.\nGustav de Vries\nis the de Vries of the\nKorteweg\n-\nde Vries\nequation and has a biography in this archive. Just to make it harder to distinguish Gustav and Hendrik, they both had\nDiederik Korteweg\nas their thesis advisor. Jan de Vries, Gustav's elder brother, studied mathematics and was awarded his doctorate in\n1881\nby the University of Amsterdam for his thesis\nBolsystemen\nⓉ\n(\nSphere systems\n)\n. He was a classical geometer who, after teaching at secondary school level in Kampen and Haarlem, taught at the technical college in Delft. He was professor of geometry at the University of Utrecht from\n1897\nto\n1928\n. When we refer to de Vries in this biography, we always mean Hendrik de Vries and when we mention any other de Vries we give their name in full. There is one other de Vries that we should note here, namely Hugo de Vries\n(1848\n-\n1935)\n, a biologist who is also mentioned below.\nHendrik de Vries's father was David de Vries who, at the time of his son's birth, was a schoolteacher at the ambachtsschool in Amsterdam. Now the ambachtsschool was the name of a type of school set up in the Netherlands in\n1865\nto train pupils for careers in industry. It provided education for those who previously had virtually no opportunity to attend school after completing primary school. David de Vries married Marie Elisabeth Santweer and Hendrik was their only child.\nWhen Hendrik was still very young, his father was appointed as the headmaster of a ambachtsschool in Rotterdam and the family moved to that city where Hendrik was brought up. Most of de Vries's school education was in Rotterdam but, in\n1884\n, when he was seventeen years old, the family moved again, this time to Frauenfeld in Switzerland. He completed his secondary education in Frauenfeld, then entered the Eidgenossische Polytechnicum in Zürich in\n1886\n. After four years of study, de Vries graduated from the Eidgenossische Polytechnicum in\n1890\nand was appointed as an assistant to\nWilhelm Fiedler\n, who had taught him as an undergraduate, to work on descriptive and projective geometry.\nFiedler\n, whose thesis advisor had been\nAugust Möbius\n, had been appointed as professor at the Polytechnicum in Zürich in\n1867\n. He was a friend of\nGeorge Salmon\n, and had translated\nSalmon\n's books into german. In\n1894\n, after four years as\nFiedler\n's assistant, de Vries returned to the Netherlands. He became a teacher at the first five-year secondary school\n(\nhogere burgerschool\n)\nin Amsterdam. At the same time he studied for a doctorate in mathematics at the University of Amsterdam with\nDiederik Korteweg\nas his advisor. He was awarded a doctorate in\n1901\nhaving submitted his thesis\nOver de restdoorsnede van twee volgens eene vlakke kromme perspectivische kegels, en over satelliet krommen\nⓉ\n(\nOn the residual cross-section of two according to one plane curve perspective cones, and associated curves\n)\n.\nIn\n1902\nde Vries was appointed as a mathematics teacher at the Polytechnic School in Delft. There he showed himself a very successful teacher of students who were studying to become engineers. In\n1905\nthe school was transformed into a Technical High School and de Vries was happy to remain there and not to seek to gain a position at a more prestigious institution. However, he was advised by senior colleagues, in particular by Jan de Vries from Utrecht, that he should seek to move. Eventually persuaded, he remained at the Technical High School in Delft for one further year before he was appointed as a Professor of Mathematics at the Municipal University of Amsterdam in\n1906\n. The vacancy in Amsterdam had occurred due to the retirement of Adrianus Jacobus van Pesch\n(1837\n-\n1916)\n, an applied mathematician who had been Jan de Vries's thesis advisor. When the candidates for the chair were ranked by the assessors, de Vries came top with Frederik Schuh second. Frederik Schuh\n(1875\n-\n1966)\nwas an algebraic geometer who, like de Vries, had been advised by\nKorteweg\nwhen writing his thesis.\nDe Vries gave his inaugural address on\n10\nDecember\n1906\nentitled\nMathesis and mathematicians\n. The address was published and is item\n[12]\nin the list we give of de Vries's publications. See\nTHIS LINK\n.\nFrom his first appointment, his teaching load was heavy and he gave twelve lectures each week on Higher Algebra, Descriptive Geometry, and Differential and Integral Calculus. Although he had been reluctant to move from Delft, once he began teaching in Amsterdam he realised what good advice he had been given about moving. He wrote\n(\nsee\n[\n5\n]\n)\n:-\n... how extraordinarily I welcomed my appointment to Amsterdam; it's like I've become ten years younger.\nOne reason that he was so much happier was that in Amsterdam he could teach geometry, his specialty, while in Delft he had taught mainly analysis. He immediately began working to make Amsterdam the mathematical centre of the Netherlands.\nL E J Brouwer\nwas appointed as a\nprivatdocent\nat the University of Amsterdam in\n1909\n. In\n1910\nKorteweg\ntried to get\nBrouwer\na chair and also sought supporters to help propose him for membership of the\nRoyal Netherlands Academy of Arts and Sciences\n(\nat that time named the Koninklijke Akademie van Wetenschappen\n)\n. De Vries was one of those proposing\nBrouwer\nfor membership of the Academy on\n25\nMarch\n1911\n.\n[\nJan de Vries, the mathematician, and Hugo de Vries, the biologist, were also among his proposers.\n]\nThis was not successful\n(\nby two votes\n)\nbut when\nBrouwer\nwas proposed again a year later, again with Hendrik de Vries and Jan de Vries among his proposers, he was successful. De Vries also supported Schuh for election to the Academy and, over the next few years, supported\nArnaud Denjoy\nand\nDavid Hilbert\n.\nDe Vries and\nBrouwer\ngot on well together and became good friends\n[\n1\n]\n:-\nOnce a week the mathematician Hendrik de Vries came to visit\n[\nBrouwer\n]\n. He usually brought his violin, which he played well, and\nBrouwer\naccompanied him at the piano.\nAnother quote from\n[\n1\n]\nshows their friendship:-\nBrouwer\nand his colleague Hendrik de Vries drew some comfort from a certain degree of tomfoolery that they practised at exams and meetings. De Vries excelled in providing comments under his breath that heavily taxed\nBrouwer\n's facial muscles.\nHendrik de Vries married Martha van Zanden on\n10\nApril\n1912\nin Amsterdam. Martha had been born on\n30\nDecember\n1884\nin Amsterdam to parents Egbert van Zanden\n(1848\n-\n1906)\nand Maria Elisabeth Broeder\n(1859\n-\n1950)\n. Martha and Hendrik de Vries had two children. The family lived at lived at Vossiusstraat\n39\n, in Amsterdam. In\n1913\nde Vries was asked if he was interested in the vacant professorship in Groningen. This had been held by\nPieter Hendrik Schoute\nfrom\n1881\nuntil his death in April\n1913\n. The chair at Groningen had many advantages for de Vries, for example he would have a much smaller teaching load giving him more time for research. Also he would be able to teach only geometry whereas in Amsterdam his heavy lecturing load included topics he was less enthusiastic to lecture on. However, his wife was adamant that she didn't want to live in Groningen and insisted on remaining in Amsterdam. De Vries said\n(\nsee\n[\n5\n]\n)\n:-\nI had to refuse for reasons beyond Science.\nHe held this position until he retired in\n1937\n. At Amsterdam, he supervised the doctoral studies of a number of students who went on the make important contributions to mathematics, the most famous of these being\nBartel van der Waerden\nwho was awarded a doctorate in\n1926\nfor a thesis on the foundations of algebraic geometry. However, in the year\n1924\n-\n25\n, De Vries had three doctoral students, namely\nB L van der Waerden\n,\nMax Euwe\n, and Cornelis Zwikker\n(1900\n-\n1985)\n. Surprisingly, given how famous\nvan der Waerden\nbecame, he later said that\nEuwe\n, who became world chess champion, was the best of the three. We note that Zwikker became a professor of Theoretical and Applied Physics at the University of Delft.\nAlthough initially de Vries's research interest was in geometry, and in particular projective geometry, he became interested in the history of mathematics through reading the works of\nGaspard Monge\n,\nJulius Plücker\nand\nAugust Möbius\n. His book,\nHistorische Studien I\nⓉ\n(\nHistorical Studies I\n)\n(1926)\n, contains seven of his early historical article, all previously published in\nNieuw Tijdschrift voor Wiskunde\n. These do not contain original historical research but rather are aimed at providing interesting background historical information for teachers and professors of mathematics. The seven articles look at the contributions of the geometers\nBlaise Pascal\n,\nCharles-Julien Brianchon\n,\nJulius Plücker\n, and\nMichel Chasles\n.\nPascal\n's\nEssay pour les coniques\nⓉ\n(\nEssay on conics\n)\nis reproduced in facsimile. Other articles look at\nArchimedes\n,\nEratosthenes\n,\nJohn Napier\nand the first logarithmic tables,\nDescartes\n'\nLa Géométrie\nⓉ\n(\nGeometry\n)\nand\nFermat\n's\nAd locus planos et solidus Isagoge\nⓉ\n(\nIntroduction to planes and solids\n)\n. De Vries continued to study geometers and their contributions publishing a much more detailed look at\nJulius Plücker\nin\n1931\nIn this paper he included a study of the contributions of\nJoseph Gergonne\nand\nGabriel Lamé\n.\nFor the titles of more of de Vries's historical publications see\nTHIS LINK\n.\nIn\n[\n3\n]\nPaul Bockstable describes de Vries's contributions:-\nEven greater emphasis was placed on the historical development of mathematical sciences in the historical writings of Hendrik de Vries\n(1867\n-\n1954)\n, professor at the Municipal University of Amsterdam. His lectures took in algebra and analysis, but from\n1921\n-\n22\nonwards, he focused increasingly on his preferred field, giving public lectures on the development of geometry. These culminated in a series of articles in the 'Nieuw Tijdschrift voor Wiskunde'\n(\nNew Journal of Mathematics\n)\n, which were later collected, together with some other items, in a three volume publication entitled 'Historische Studien'\n(1926)\n. De Vries wrote in the introduction that he wanted to focus attention on the historical development of very precisely defined topics, even specific problems or theorems. He pointed out the didactic benefits that the historical approach to mathematical problems could offer.\nB L van der Waerden\nwrites about de Vries's history lectures at the University of Amsterdam which he had attended as a student\n[\n7\n]\n:-\nHendrik de Vries used to give extremely interesting lectures on the History of Mathematics on Saturdays. His interest was especially in the great French geometers. He knew how to give fascinating talks about the origins of Analytical Geometry, the misunderstood 'Rough draft for an essay on the results of taking plane sections of a cone' of\nDesargues\n, the brilliant young man\nBlaise Pascal\n, and especially about\nGaspard Monge\n, who as a student at the École Militaire, using some simple constructions, solved an important problem ... and had thereby also invented Descriptive Geometry!  All these issues De Vries treated in his Historical Studies in his own entertaining and vivid way. I can still see his clean-cut face, I can still see him use his stick and I hear his voice. He made many a witty remark 'en passant'.\nHe continued to publish\nHistorical studies\n, and as examples we give the title of a small number of these later articles:\nOn the contact and intersection of circles and conic sections\n(1946)\n,\nHow analytic geometry became a science\n(1948)\n,\nOn the infinite and the imaginary, or \"surrealism\" in mathematics\n(1949)\n, and\nOn relations and transformations\n(1949)\n.\nHendrik de Vries retired in\n1937\n, the same year as his colleague Gerrit Mannoury\n[\n1\n]\n:-\nIn the same year ... Hendrik de Vries and Gerrit Mannoury had reached retirement age. Their valedictory lectures were given on the same day in the Mathematical Institute in the Roeterstraat. Brouwer, as director of the Institute, addressed them in the name of the faculty, and\nMax Euwe\nspoke on behalf of the students. The newspaper 'Het Volk' mentioned that their old teacher,\nKorteweg\n, was also present at the occasion.\nBefore the outbreak of World War II, de Vries and his wife left Amsterdam and moved to Palestine. However, he continued to keep in touch with events at the University of Amsterdam. After World War II had ended, de Vries wrote to\nBrouwer\nfrom Palestine. The letter is dated\n1\nDecember\n1945\n:-\nI had heard about Belinfante and Koppers, and just yesterday I received a letter from Van Pommeren in which he described his experiences at great length, so I also know what he had to enjoy. One thing is even more depressing and nasty than the other. That Weitzenböck has sneaked away, I have also heard; a pity that they didn't get him in time, because he really deserved it. I always hated his guts. And I heard that a couple of you chaps have been suspended, including our good Stomps, who seems to take it very seriously, because he always did everything that he could to assist the Jews, for example the whole Heimans family, and even hid a Jew in his house. That man truly didn't have to be suspended! And so life goes on again, but I am curious whether it will stay such a mess as it is now, or get better, or even worse.\nWe should give some information about some of those mentioned in this quote so that the reader can understand the events that de Vries refers to. The mathematician Roland Weitzenböck\n(1885\n-\n1955)\nwas appointed to the University of Amsterdam in\n1921\n. During World War II he gave up Dutch nationality, and took German nationality. Given this, it is not surprising that he was dismissed after the war. J F Koppers, Janitor of the Mathematics Institute, was active in the Resistance in WWII. Arrested by the Germans he was taken to Neuengamme concentration camp where he died in\n1944\n. Maurice Joseph Belinfante\n(1896\n-\n1944)\nwas a Portuguese-Jewish docent at the University of Amsterdam who was taken by the Germans and died in Auschwitz in October\n1944\n. Jan Theodoor Stomps\n(1885\n-\n1973)\nwas a biologist who had served as an assistant to Hugo de Vries and later had been appointed as a professor at Amsterdam in\n1920\n.",
  "matematicos_citados_na_biografia": [
    "Gustav de Vries",
    "Korteweg",
    "de Vries",
    "Diederik Korteweg",
    "Wilhelm Fiedler",
    "Fiedler",
    "August Möbius",
    "George Salmon",
    "Salmon",
    "THIS LINK",
    "L E J Brouwer",
    "privatdocent",
    "Brouwer",
    "Royal Netherlands Academy of Arts and Sciences",
    "Arnaud Denjoy",
    "David Hilbert",
    "Pieter Hendrik Schoute",
    "Bartel van der Waerden",
    "B L van der Waerden",
    "Max Euwe",
    "van der Waerden",
    "Euwe",
    "Gaspard Monge",
    "Julius Plücker",
    "Blaise Pascal",
    "Charles-Julien Brianchon",
    "Michel Chasles",
    "Pascal",
    "Archimedes",
    "Eratosthenes",
    "John Napier",
    "Descartes",
    "Fermat",
    "Joseph Gergonne",
    "Gabriel Lamé",
    "Desargues"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}