{
  "nome_completo": "Hendrik van Heuraet",
  "nome_curto": "Hendrik van Heuraet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heuraet/",
  "data_nascimento": "8 September 1634",
  "local_nascimento": "Haarlem, Netherlands",
  "data_morte": "about 1660",
  "local_morte": "(probably) Leiden, Netherlands",
  "summary": "Hendrik van Heuraet was a Dutch mathematician who made some contributions to integration.",
  "biografia": "Hendrik van Heuraet\nwas born between\n2\nFebruary\n1634\nand\n8\nSeptember\n1634\n. We know that he inherited his father's estate when he reached the age of\n21\nand that the documents were signed on\n8\nSeptember\n1655\n. If he went through the formalities at the earliest possible occasion then he must have been born on\n8\nSeptember\n1634\n. However, he may have delayed a while after his twenty-first birthday which could have been as early as\n2\nFebruary that year. His mother was Maria de Coninck who came from Oude Rijn, a town near to Leiden. His father was Abraham van Heuraet, an immigrant from Hamburg who had settled in Haarlem where he was a cloth merchant. Abraham and Maria married in Leiden on\n11\nOctober\n1631\n. The family were quite well off but their fortunes changed quite dramatically. In\n1636\n, when Hendrik was two years old, his mother died. His father's business hit hard times and by the beginning of\n1637\nhe had mortgaged all his possessions in a bid to keep his business going. In the following year the family's fortunes changed again when Abraham inherited a large sum of money from his father's estate. By\n17\nSeptember\n1639\nhe had cleared all the debts that he had incurred when his business failed.\nOn\n28\nMay\n1651\n, when Hendrik was about seventeen years old, his father remarried. Abraham's wife, Magdaleentje Egels, was much younger than her husband and she was carrying his child when he died on\n5\nNovember in the year following his marriage. The eighteen year old Hendrik lost his father and gained a brother soon after. However he left Haarlem around this time and went to Leiden where he entered the University on\n25\nMay\n1653\nintending to study medicine. However he studied mathematics as well as medicine, studying privately under\nvan Schooten\nwith fellow students\nHuygens\nand\nHudde\n. On\n8\nSeptember\n1655\n, having reached the age of twenty-one years, he inherited his father's fortune and from that time on became a man of independent means.\nLittle is known of van Heuraet's life after he inherited his father's money, all that is known is that he went with\nHudde\nto the Protestant university in Saumur, a town on the river Loire in western France, in\n1658\n. From Saumur he wrote a letter to\nvan Schooten\nentitled\nEpistola de transmutatione curvarum linearum in rectas\nⓉ\n(\nLetter on rectification of a curve\n)\n.\nVan Schooten\npublished this letter in\n1659\nand we describe below its contents. Van Heuraet returned to Leiden in the following year and again enrolled to study medicine.\nVan Schooten\nhad established a vigorous research school in Leiden which included van Heuraet, and this school was one of the main reasons for the rapid development of Cartesian geometry in the mid\n17\nth\ncentury.\nSluze\n,\nHuygens\n,\nvan Schooten\n,\nHudde\nand van Heuraet corresponded regarding the properties of curves, in particular van Heuraet was interested in methods of rectification, that is methods to determine the length of a curve. Most of the correspondence was directed through\nvan Schooten\nin the sense that his students would tell him of their discoveries and he would inform the others as well as publish certain of their results as appendices to his own publications.\nVan Schooten\nedited and published a Latin translation of\nDescartes\n'\nLa Géométrie\nin\n1649\n. A second two-volume translation of the same work\n(1659\n-\n1661)\ncontained appendices by\nde Witt\n,\nHudde\nand van Heuraet. In fact there are two papers by van Heuraet which appear as appendices. One of them gives the construction of inflexion points on the conchoid\n(\nsee\n[\n4\n]\nfor details\n)\n. This work was typical of that being carried out by\nvan Schooten\n's research group and this work was important since attempts to discover properties of curves of this type led to methods which eventually gave rise to the differential and integral calculus. The second of the two papers by van Heuraet is the letter from Saumur we mentioned above\n(\nsee\n[\n3\n]\nand\n[\n4\n]\nfor details\n)\n. In it he gives a rectification method which reduces, for any arbitrary algebraic curve, the rectification to a quadrature of an associated curve, that is to computing the area under an associated curve. This was particularly important since at this time mathematicians believed that it was not possible to compare the length of a curved arc with a straight line segment. Van Heuraet's breakthrough is therefore significant in the development of mathematics. In particular, in the paper, he computed the integral\n∫\n1\n+\ny\n′\n2\nd\nx\n\\int \\sqrt{1+y'^{2}} dx\n∫\n1\n+\ny\n′\n2\n​\nd\nx\nand applied his methods to the\nparabola\n. His methods of rectification of curves became part of a more general theory by\nFermat\nwhich was produced independently and at about the same time. We should note that\nWilliam Neile\n, independently of van Heuraet, found the arc length of an algebraic curve in\n1657\nwhen he rectified the cubical parabola.\nNow van Heuraet's remarkable work led to an argument with\nHuygens\nover a priority claim.\nHuygens\nwrote to\nvan Schooten\nsaying that he had reduced the surface area of a paraboloid to a circle.\nVan Schooten\nreplied immediately that van Heuraet had made a similar discovery, indeed van Heuraet's methods were much more general.\nHuygens\nrealised the significance of van Heuraet's work and tried to claim credit for being first to discover another special case. He pressed van Heuraet hard to accept his priority and van Heuraet wrote to him in February\n1658\n[\n2\n]\n:-\nIf you had only known my character, it would not have been necessary to exert so much effort against me, who by no means shall seek to rob you of the pleasure and honour of the aforesaid invention, even if the same might have been found by me long ago.\nVan Heuraet had basically allowed\nHuygens\nhis priority for the special cases to draw a line under the dispute and calm matters down. He seemed successful in this but then\nHuygens\nwrote to\nWallis\nin June\n1659\nmaking a claim which historians believe is simply untrue. He wrote\n[\n2\n]\n:-\nWhen van Heuraet learned that I had measured the surface of the parabolic conoid and had determined the length of the parabola equal to a given quadrature of the hyperbola\n(\nconcerning both of which I wrote you previously\n)\n, he found not only both of them by his own technique but, in addition, he rectified completely all other curves of those genera that we allow in geometry.\nThis was written despite what\nvan Schooten\nwrote to\nHuygens\non\n4\nFebruary\n1658\n[\n2\n]\n:-\n... concerning your other discovery you indicated nothing to me except some obscure things which were almost completely forgotten by me when I visited Heuraet, so that I could not remember what your discovery properly comprised, much less whether his method corresponded with that of your discovery.\nIf nothing else,\nHuygens\nstrenuous attempts to gain some credit for van Heuraet's discovery tells us how significant he felt it to be.\nHuygens\nrepeated his claim in a letter to\nSluze\na month later. When\nHuygens\ncame to describe these events in\nHorologium Oscillatorium\nin\n1673\nhe certainly modified his claims by only saying that his letter to\nvan Schooten\nsaying that he had reduced the surface area of a paraboloid to a circle had been shown to van Heuraet\n[\n2\n]\n:-\n... he shared that letter with van Heuraet, with whom he then associated. Indeed, it was not difficult for this man of very keen ability to deduce that the surface of that conoid is associated with the measure of the parabolic curve itself.\nEven if this lesser claim by\nHuygens\nis true, it does not take anything away from van Heuraet. My\n[\nEFR\n]\nguess would be that\nHuygens\nbelieved this version to be true, but in fact it was not true and van Heuraet's discovery was quite independent of\nHuygens\n. Certainly examining all the correspondence which survives, seeing van Heuraet's reaction to\nHuygens\nclaims and also\nvan Schooten\n's support for van Heuraet, all suggest that he was not directly influenced by\nHuygens\n' special cases.\nThere is, of course, no way now that we will ever know for certain whether or not\nHuygens\n' later claim is true. Certainly\nHuygens\nstressed the superiority of van Heuraet's methods over those of\nWilliam Neile\n, simply, one supposes, because of his claim to have influenced van Heuraet.\nWallis\n, who championed\nNeile\n's cause, strongly disagreed.\nWe do not know when van Heuraet died. All that is known is that\nHuygens\nwrote a letter in December\n1659\nwhich mentions van Heuraet who was certainly alive at the time. From the fact that no mention of his name occurs in any later correspondence, we have assumed that van Heuraet died shortly after this, probably in\n1660\n. Given his remarkable achievements, one has to wonder at the progress he would have made had he lived as long as\nHuygens\n.",
  "matematicos_citados_na_biografia": [
    "van Schooten",
    "Huygens",
    "Hudde",
    "Van Schooten",
    "Sluze",
    "Descartes",
    "de Witt",
    "parabola",
    "Fermat",
    "William Neile",
    "Wallis",
    "Neile"
  ],
  "imagens": []
}