{
  "nome_completo": "Henry Martyn Taylor",
  "nome_curto": "Henry Taylor",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taylor_Henry/",
  "data_nascimento": "6 June 1842",
  "local_nascimento": "Bristol, England",
  "data_morte": "16 October 1927",
  "local_morte": "Cambridge, England",
  "summary": "Henry Martyn Taylor was an outstanding English mathematician who lost the sight of both eyes. He devised a Braille system to allow mathematical and other scientific works to become available to the blind.",
  "biografia": "Henry Martyn Taylor\nwas the son of James Taylor\n(1810\n-\n1898)\nand Eliza Johnson\n(1808\n-\n1902)\n. James Taylor was born on\n12\nMarch\n1810\nin Dublin, Ireland. He studied at Erasmus Smyth's school in Dublin, and later was an Assistant Master at Sherborne School,\n1834\n-\n37\n. After that, he opened a private school at Bristol. He married Eliza Johnson\n(1808\n-\n1902)\non\n27\nMarch\n1837\nat Chard, Somerset, England. Eliza had been baptised on\n14\nDecember\n1808\nat St Nicholas\n(\nwithout\n)\n, Dublin, Ireland. James and Eliza Taylor had five children: James Heber Taylor\n(1840\n-\n1914)\n; Henry Martyn Taylor\n(1842\n-\n1927)\n, the subject of this biography, Alice Mary Taylor\n(1844\n-\n1939)\n; William Wilberforce Taylor\n(1848\n-\n1922)\n; and Emily Jane Taylor\n(1853\n-\n1943)\n. James Taylor matriculated at Trinity College, Cambridge in\n1839\nand was awarded a B.A. in\n1843\n, being ordained a deacon in the same year. He was the headmaster of Kimbolton Grammar School for the four years\n1843\n-\n47\n, then headmaster of the Queen Elizabeth Grammar School, Wakefield and Evening Lecturer at St Andrew's, Wakefield,\n1847\n-\n75\n. Of the five children, the eldest two were born in Bristol, the youngest two in Wakefield and the middle child in Kimbolton.\nThe\n1851\ncensus shows the family living at\n2\nAlmshouse Lane, Wakefield. James Taylor gives his occupation as \"Clergyman, Schoolmaster and Evening Lecturer of Parish Church\". In addition to the family, there are three boarders in the house, aged\n10\n,\n15\nand\n17\n, in addition to three servants and a nurse.\nHenry Taylor attended the Queen Elizabeth Grammar School, Wakefield, the school of which his father was the headmaster. This school was founded by Royal Charter of Queen Elizabeth I in\n1591\nas a boys' school and still today\n(2021)\nis a boys' school. In fact when Henry Taylor attended the school it had just moved to a new site in Northgate, Wakefield, a site which it continues to occupy. Let us note one fact; James Taylor was the nineteenth headmaster of the school, all nineteen being ordained priests. He was, however, the last ordained headmaster of the school. At the time of the\n1861\ncensus, the family were living in a house which was part of the Queen Elizabeth Grammar School. Henry Taylor completed his schooling in\n1861\n, was admitted as a\nsizar\nto Trinity College, Cambridge, on\n9\nFebruary\n1861\nand matriculated at the College beginning his study of the mathematical tripos in the Michaelmas term\n(\nOctober\n)\nof\n1861\n. He joined fellow student\nJohn William Strutt\n(\nlater known as\nLord Rayleigh\n)\nwho also matriculated in Trinity College in the Michaelmas term of\n1861\nto study the mathematical tripos. Taylor became a scholar in\n1863\n.\nIn the mathematical tripos of\n1865\nTaylor was third\nwrangler\n. The senior wrangler was\nJohn William Strutt\nand the second wrangler was Alfred Marshall\n(1842\n-\n1924)\nwho went on the become a leading economist. It was announced that\nStrutt\nwas the\n1\nst Smith's Prizeman and Taylor was the\n2\nnd Smith's Prizeman. Shortly before graduating, Taylor accepted the position of vice-principal of the Royal School of Naval Architecture and Marine Engineering. This School had only been founded a year earlier in\n1864\nto train naval architects. It was situated in South Kensington but in\n1873\nit moved to Greenwich becoming the Royal Naval College. Taylor was offered a fellowship by Trinity College, Cambridge, in\n1866\n, which he accepted but continued to work at the Royal School of Naval Architecture until\n1869\nwhen he was offered an Assistant Tutorship on the staff at Trinity College. Among the pupils that Taylor taught at the Royal School was William Henry White\n(1845\n-\n1913)\nwho went on to become Chief Constructor of the Admiralty and the designer of a great many British warships. Taylor remained close friends with White for the rest of his life. While Taylor had been a scholar at Trinity College he published the paper\nThe method of inversion\nand when at the Royal School of Naval Architecture, he published the paper\nGeometrical explanation of the equations for the longitude of the node, and the inclination of the orbit\nboth published in the\nMessenger of Mathematics\nin\n1866\n. He joined the\nLondon Mathematical Society\non\n19\nMarch\n1866\n.\nThere were two standard routes for Cambridge fellows at this time to set themselves up for a career after the fellowship ended. One was ordination and the other was a law career. Taylor chose to read for the Bar and was called to Lincoln's Inn in\n1869\n. Although this qualified him to practiced law, it does not appear that he ever did so, but the legal training proved useful in his career at the university. We say that he does not appear to have practiced law since we have found no evidence that he did so, but we note that at the time of the\n1871\ncensus he was at his parents' home in Wakefield and gave his occupation as \"Assistant tutor Trinity College. Barrister at Law in practice.\"\nHis mathematical interests were mainly in geometry and he published\nInversion, with Special Reference to the Inversion of an Anchor Ring or Torus\nin the\nProceedings\nof the\nLondon Mathematical Society\nin\n1873\n. The paper begins:-\nWe premise that a straight line inverts into a circle passing through the pole, and vice versa; that a circle inverts into a circle, the two circles being subcontrary sections of a cone of the second degree passing through the pole; and that the angles between lines and surfaces at their points of intersection are the same as the angles between the inverse lines and surfaces at the inverse points. A normal is a straight line cutting a curve or a surface at right angles; it will therefore invert into a circle through the pole cutting the inverse curve or surface at the inverse point at right angles. Such a circle we will call a normal circle. We will now prove that, if two normals at any two points of a surface intersect and be equal, the normals at the inverse points of the inverse surface also will intersect and be equal.\nIn\n1874\nTaylor became a Tutor at Trinity College. In the same year his elder brother, James Heber Taylor, also came to live in Cambridge. James Heber Taylor had been a pupil at the Queen Elizabeth Grammar School in Wakefield, and had been awarded a Lady Betty Hastings Exhibition to Queen's College, Oxford, where he gained a first class in both classical and mathematical Moderations and a second class in Litterae Humaniores. He then went to Trinity College, Cambridge, where he studied both the Classical Tripos and the Mathematical Tripos with great success. He married Mary Elizabeth Pearce in August\n1869\nand after a while he became headmaster of Brewood School, Staffordshire. He came to live in Little Trinity House,\n16\nJesus Lane, Cambridge in\n1874\nwhere he worked as a private tutor. We could also give details of Taylor's younger brother William Wilberforce Taylor who became a mathematician. He also studied at both Oxford University, where he matriculated in\n1868\n, and at Cambridge University entering Trinity College in\n1868\nhaving obtained an exhibition. In the mathematical tripos examinations of\n1872\nhe was ranked\n7\nth wrangler. He became a teacher of mathematics and in\n1881\nhe was teaching at Ripon, Yorkshire. On\n10\nJanuary\n1889\nhe joined the\nLondon Mathematical Society\n.\nIn\n1876\nHenry Taylor published a number of papers including\nOn the generation of a developable surface through two given curves\n,\nOn a certain multiple integral\n,\nOn the lines of curvature of a surface\n, and\nOn the relative values of the pieces in chess\n. Let us quote the first few sentences of the last mentioned of these papers:-\nThe object of this paper is to ascertain the relative values of the pieces on a chessboard. If a piece be placed on a square of a chessboard, the number of squares it commands depends in general on its position. If we calculate the average number of squares which any particular piece commands when placed in succession on every square of the board, it seems fair to assume that this gives a not very inexact measure of the value of the piece. For special reasons the above problem is stated in the following manner:- \"A king and a piece of different colours are placed at random on two squares of a chessboard of\nn\n2\nn^{2}\nn\n2\nsquares; it is required the find the chance that the king is in check.\" The ordinary chessboard has an even number of squares; and as some of the results take different forms for odd and even values of n, the results are given merely for even values of n, and the results for the ordinary chessboard of\n64\nsquares deduced from them.\nThe post of Tutor at Trinity College was a ten year appointment and when that expired in\n1884\nhe was appointed as a lecturer at the College. Let us note that at the time of the\n1891\ncensus Taylor was living at the Rectory, Church Lane, Brington, Huntingdonshire. His sister Alice Mary Taylor had married the Rev Thomas James Sanderson and they had eleven children. The\n1891\ncensus records Henry Taylor, his mother Eliza Taylor, and his sister Emily Jane Taylor all living in the Rectory of All Saints Church Brington with the Rev Thomas James Sanderson, his wife\n(\nHenry Taylor's sister Alice Mary\n)\nand the youngest five of their children. The family had a cook and two housemaids also living at the Rectory. Although still employed as a lecturer at Trinity College, Henry Taylor gives his occupation as \"barrister.\"\nIn\n1894\nTaylor reached\n25\nyears service at Trinity College, the maximum term allowed, and so retired at that time. We list a few more of his papers up to\n1894\n:\nNote on the Equation of the Two Planes which can he drawn, through Two given Points to touch a Quadric\n(1879\n-\n80)\n,\nNote on Euclid ii,\n12\n,\n13\n(1880)\n,\n(\nwith R C Rowe\n)\nNote on a Geometrical Theorem\n(1881\n-\n82)\n,\nOn a six-point circle connected with a triangle\n(1882)\n, and\nThe Relations of the Intersections of a Circles with a Triangle\n(1883\n-\n84)\n.\nAnother aspect of his work at Trinity College is described in\n[\n1\n]\n:-\nThe\n1870\ns were an active time of academic reform in Cambridge. The old Elizabethan statutes had been partially modified by the first Victorian statutes in\n1858\n; but a comprehensive change was made by the Universities of Oxford and Cambridge Act of\n1877\n. Under that Act, each college framed its own statutes for submission to the Privy Council. Accordingly, Trinity proceeded with that duty in a long succession of meetings ... When decisions had been completed, the final drafting of the statutes was entrusted to three of the fellows: Prof\nCayley\n, whose reputation as a draughtsman long survived his retirement from practice at the Bar: Rev Coutts Trotter, conspicuous for his share in the organisation of the University, especially in the domain of natural science: and H M Taylor, whose legal training proved of high value. Then, and for many years to come, Taylor had a prominent\n(\nif not foremost\n)\npart in giving effect to the necessary changes in the old system. Independent in thought, and scrupulously just, he maintained the even tenor of his views, devoted to progress yet mindful of the ancient ways, fair in constructive act, and straight in opposition. Those statutes are now under repeal; their actual initial working owed much to the prudent wisdom of a band of reformers, among whom Taylor held a not unworthy place.\nAlthough as we have seen above, most of Taylor's publications were on geometry, his expertise ranged over a wide range of mathematics and he displayed this expertise in helping his friends. He proofread and helped improve a number of books written by his colleagues such as\nThe Theory of Sound\n(1877)\nby\nJohn William Strutt\nwho writes in the Preface:-\nMy best thanks are due to Mr H M Taylor of Trinity College, Cambridge, who has been good enough to read the proofs. By his kind assistance several errors and obscurities have been eliminated, and the volume generally rendered less imperfect than it would otherwise have been.\nHorace Lamb\nhad been tutored by Taylor at Trinity College and the two remained close friends throughout Taylor's life.\nLamb\npublished\nTreatise on the Mathematical Theory of the Motion of Fluids\nin\n1879\nand later editions were published under the title\nHydrodynamics\n.\nLamb\ndedicated the books to Taylor, writing in the Preface to the Fourth Edition\n(1916)\n:-\nIt is again a satisfaction to me to inscribe on the fly-leaf the name of Mr H M Taylor, whose kindly encouragement first led me to write on the subject, and whose help in revision I had gratefully acknowledged on former occasions.\nWe also note that\nLamb\n's admiration for Taylor led to him naming his third son, born in\n1883\n, Henry Taylor Lamb.\nAndrew Forsyth\nhad also been tutored by Taylor and in the Preface to his book\nA Treatise on Differential Equations\n(1885)\nhe wrote:-\nI wish to express the very great obligations under which I lie to my friend and former tutor Mr H M Taylor, of Trinity College, Cambridge, for his kindness in the revision of the proof-sheets. He has caused the removal of obscurities and has made many valuable suggestions of which I have continually availed myself.\nIn the Preface to his\nTheory of Functions of a Complex Variable\n(1893)\n,\nAndrew Forsyth\nwrites:-\nMr H M Taylor, M.A., Fellow of Trinity College, Cambridge, had read the proofs with great care: the kind assistance he has given me in this way has proved of substantial service and usefulness in correcting the sheets. I desire to recognise most gratefully my sense of the value of the work which these gentlemen\n[\nTaylor and\nWilliam Burnside\n]\nhave done.\nIn the late\n1880\ns Taylor began working on an edition of\nEuclid\n's\nElements\nand Cambridge University Press began publishing it in separate volumes. The first three volumes were then published as\nEuclid's Elements of Geometry Books I-VI\nin\n1893\n. It contains three Prefaces, the Preface to Books I-II is dated\n1\nOctober\n1889\n, the Preface to Books III-IV is dated\n8\nJanuary\n1891\n, and the Preface to Books V-VI is dated\n16\nMarch\n1893\n. The Preface to Books I-II begins:-\nIt was with extreme diffidence that I accepted an invitation from the Syndics of the Cambridge University Press to undertake for them a new edition of the 'Elements of Euclid'. Though I was deeply sensible of the honour, which the invitation conferred, I could not but recognise the great responsibility, which the acceptance of it would entail.\nThe invitation of the Syndics was in itself, to my mind, a sign of a widely felt conviction that the editions in common use were capable of improvement. Now improvement necessitates change, and every change made in a work, which has been a text book for centuries, must run the gauntlet of severe criticism, for while some will view every alteration with aversion, others will consider that every change demands an apology for the absence of more and greater changes.\nHe ended the Preface to\nBooks V-VI\nas follows:-\nI hereby acknowledge the great help I have received in this portion of my work from friends, and especially from Dr\nForsyth\nand from my brother Mr J H Taylor. To the latter I am indebted for the Index to Books I-VI, which I hope may prove of some assistance to persons using this edition.\nThe review\n[\n10\n]\nof\nEuclid's Elements of Geometry\nBooks III-IV\nbegins:-\nIt is only of late years that the University of Cambridge has taken the wise step of giving greater scope to the teaching of geometry by not insisting on the actual proofs of propositions as presented in\nEuclid\n's text. All the definitions, axioms, and postulates, together with the sequence of propositions which he adopted, are retained, but in solving them \"no proof will be accepted that assumes anything not proved in preceding propositions.\" The work under consideration is published in the \"Pitt Press Mathematical Series,\" and it will be found to contain some important changes, both with regard to the proofs and method of arrangement. In the first few propositions of Book III the author has introduced several proofs which seem preferable to those generally adopted, while their order of sequence has been extensively changed. The alterations in the remaining propositions of this book have not been carried to any extent, but several outlines of alternative constructions have been inserted in cases where they may be most instructive.\nTaylor continued to work on producing editions of further of\nEuclid\n's Books but tragedy struck him around the time he left his lectureship at Trinity College in\n1894\n, when he rapidly lost the sight of both of his eyes. Although it is always a little difficult to know precisely what medical conditions afflicted people in past times, it would appear that Taylor suffered from detached retinas, a condition which causes total blindness. With much assistance from those around him, Taylor tried to carry on with mathematical research, something which he had always hoped to be able to spend more time on when retired from his lectureship. Some of his papers, which he dictated after becoming blind, are:\nOn a Series of Cotrinodal Quartics\n(1896\n-\n97)\n;\nOn the Degeneration of a Cubic Curve\n(1896\n-\n97)\n;\nOn the Intersections of Two Cubics\n(1897\n-\n98)\n;\nOn the condition that five straight lines meet a sixth\n(1902)\n;\nA problem of arrangements\n(1903)\n;\nOn a paperfolding puzzle\n(1904)\n;\nOn some geometrical dissections\n(1906)\n; and\nOn the order of the boats after a bumping race\n(1909)\n. He also published the pamphlet\nCollisions at Sea: A Steamship's Lights Might Tell Her Course\n(1895)\nwhich is advertised as \"by H M Taylor, M.A., Fellow of Trinity College, Cambridge, Barrister-at-Law, sometime Vice-Principal of the Royal School of Naval Architecture and Marine Engineering.\"\nTaylor wrote\nSir Isaac Newton - A Short Biography\nfor Volume\n19\nof the\n1911\nEncyclopaedia Britannica\n. You can read a version of this article at\nTHIS LINK\n.\nIn\n1898\n, four years after he became blind, Taylor was elected a fellow of the\nRoyal Society of London\n. Of course undertaking mathematical research became increasingly difficult since he could not read current research papers and books. He did, however, get much pleasure from reading Braille novels and it became a passion for him to develop a Braille system to allow mathematical and other scientific works to become available to the blind. Of course, developing the system was not enough for then scientific works had to be translated into Braille\n[\n7\n]\n:-\nOne Braille notation was devised by the eminent Cambridge mathematician, Henry Martyn Taylor, who was overtaken by blindness in\n1894\n, when engaged in the preparation of an edition of\nEuclid\nfor the Cambridge University Press. By means of his ingenious and well thought out Braille notation he was enabled to transcribe many advanced scientific and mathematical works, and in\n1917\n, with the assistance of Mr Emblen, a blind member of the staff of the National Institute for the Blind, he perfected it. It was recognised as so comprehensive that it was soon adopted as the standard mathematical and chemical notation, and is universally used by English-speaking people.\nCambridge Borough Council had on it representatives of Cambridge University and Taylor served on the Borough Council in that capacity. Remarkably he served as mayor of Cambridge during\n1900\n-\n01\nand in the following years was Chair of the Finance Committee of the Borough Council. He also served as a borough magistrate. At the time of the\n1901\ncensus he was living in Trinity College, but by the\n1911\ncensus he, along with his brother William Wilberforce Taylor and his sister Emily Jane Taylor, were borders at the Nelson Hotel, Mudeford, Christchurch\n(\nat that time in Hampshire, but now in Dorset\n)\n. He had a home, however, at The Yews, Newnham, Cambridge and he died at his home in October\n1927\n. A memorial inscription, in Latin, is at Trinity College. An English translation reads:-\nSacred to the memory of Henry Martyn Taylor, Fellow of the College for sixty-one years and at one time Lecturer and Tutor. At the age of fifty-one he lost his sight; but undiscouraged and eagerly he kindled a torch of hope for those who shared his darkness. His invention of new symbols for Braille enabled them to compensate for the loss of their eyes with their fingers and to follow mathematics more clearly than they could have done by any light.  Although blind and almost sixty years old he became Mayor of Cambridge, and he dealt with College affairs assiduously to the last. He was born on\n6\nth June\n1842\nand died on\n16\nth October\n1927\n, being by then Senior Fellow.\nLet us end with\nHorace Lamb\n's description of Taylor's character\n[\n9\n]\n:-\nTaylor was singularly modest and devoid of personal ambition. He did not seek positions of honour and responsibility, but if they came his way he applied himself conscientiously to the duties which he had undertaken. Throughout his life he was a loyal friend and a fair opponent, generous and just in his thoughts, as in his dealings. Before his blindness he had shared in the usual recreations of his time, \"real\" tennis, cricket, shooting, fishing, billiards, in all of which he was proficient. He was also fond of foreign travel and mountain excursions. But the privation when it came did not provoke a murmur, and he maintained the steady even temper characteristic of him. The last few years of his life were clouded by increasing infirmity, and he died on October\n16\n,\n1927\n. The funeral service in the Chapel of Trinity College drew together a large company of friends and former colleagues to pay the last tribute of affection and respect to a noble and lovable character.",
  "matematicos_citados_na_biografia": [
    "sizar",
    "John William Strutt",
    "Lord Rayleigh",
    "wrangler",
    "Strutt",
    "London Mathematical Society",
    "Cayley",
    "Horace Lamb",
    "Lamb",
    "Andrew Forsyth",
    "William Burnside",
    "Euclid",
    "Forsyth",
    "THIS LINK",
    "Royal Society of London"
  ],
  "imagens": [
    "taylor_henry.jpg"
  ]
}