{
  "nome_completo": "Henri Paul Mineur",
  "nome_curto": "Henri Mineur",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mineur/",
  "data_nascimento": "7 March 1899",
  "local_nascimento": "Lille, France",
  "data_morte": "7 May 1954",
  "local_morte": "Paris, France",
  "summary": "Henri Mineur was a French astronomer and mathematician who observed the variation of star movements based on their distance from the core of a galaxy.",
  "biografia": "Henri Mineur\n's parents were Paul Mineur and Léonie Jacquet. Paul Mineur was a mathematics teacher who was teaching in Lille at the time when his son Henri was born. He later moved to Paris where he taught at the Collège Rollin\n(\nwhich was renamed the Lycée Rollin in\n1919\nand, since\n1944\nhas been known as the Lycée Jacques-Decour\n)\n. Henri received all his schooling in Paris at the Collège Rollin where he showed remarkable talents in mathematics. Jean Claude Barthélemy Dufay\n(1896\n-\n1967)\n, the author of\n[\n5\n]\n, although three years older than Mineur, was a pupil at the Collège Rollin at the same time. He also became a well-known astronomer holding posts such as director of the Lyon Observatory and of Haute-Provence Observatory. Daniel Barbier\n[\n3\n]\nwrites:-\nThis very young Henri is interested in astronomy. Possessing a\n75\nmm telescope, he builds himself an equatorial telescope. We find in 'L'Astronomie' evidence of his modest observations when he was\n15\nto\n16\nyears old and which relate to the sun, planets, double stars and variable stars; at the meeting of\n6\nFebruary\n1916\n, the Secretary General of the Astronomical Society, Camille Flammarion, reported having received a minor note, 'Détermination du méridien avec un plan à plomb et une montre non réglée'\nⓉ\n(\nDetermination of the meridian with a plumb plane and an non-regulated watch\n)\nand raising his hands to heaven exclaimed, \"It's full of sines in there.\" Mineur had, indeed, discovered mathematics.\nWhile still at High School, preparing for the second part of his degree, Henri Mineur had developed a passion for functional equations. Notes that he wrote at that time, which were kept by one of his classmates, demonstrate a keen and even extraordinary mathematical sense in a young man of\n17\nyears. There are remarks such as \"the superiority of functional equations over differential equations is that they allow one to define discontinuous functions.\"\nIn\n1917\nMineur took the highly competitive examinations for admission to the École Polytechnique and the École Normale Supérieur in Paris. He was ranked highly for the École Polytechnique and ranked first for the École Normale Supérieur, which he then chose for his studies. However, because of World War I, he decided to join the army in which he served until\n1919\n. Two years in the army did not hold up his progress for long for he was awarded his first degree\n(\nl'agrégation\n)\nin\n1921\n. He had already started research in mathematics by\n1920\nand, after graduating, he taught mathematics in the Lycée Français, a school in Dusseldorf, Germany, while he was completing his thesis. He was awarded his doctorate in\n1924\nfor his thesis\nDiscontinuous solutions of a class of functional equations\nin which he established an addition theorem for Fuchsian functions. The work of his thesis was published in\n1925\nas was the paper\nThéorie analytique des groupes continus finis\nⓉ\n(\nAnalytic theory of finite continuous groups\n)\nand, three years later, he published a paper on the absolute differential calculus\nCalcul différentiel absolu\nⓉ\n(\nThe absolute calculus\n)\n.\nWe have already noted that Mineur had been interested in astronomy from a young age and in\n1925\nhe left teaching to take up the post of \"astronomer adjoint\" in the Paris Observatory. In fact he had worked at the Paris Observatory a few years earlier, being a trainee there in\n1922\n-\n23\n. Mineur married Suzanne Fromant in\n1926\nand then remarried to Gabrielle Cloche in\n1929\n. Her picture of Mineur is very different from the one presented in obituaries and we quote from her at the end of this biography.\nMineur contributed to many areas of astronomy and mathematics including celestial mechanics, analytic mechanics, statistics and numerical analysis. Examples of his papers around\n1930\nare\nSur les ondes de gravitation\nⓉ\n(\nOn gravitational waves\n)\n(1928)\nand\nLa mécanique des masses variables. Le problème des deux corps\nⓉ\n(\nMechanically varying masses. The two-body problem\n)\n(1933)\n. In\n1938\nhe wrote an important work on the least square method,\nTechnique de la méthodes des moindres carrés\nⓉ\n(\nTechniques of the least squares methods\n)\n. Arthur H Copeland writes:-\nMineur states in the preface of his book that it should be possible for the reader to learn to use the method of least squares without understanding the theory behind it. In fact, the theory of the various operations is not fully explained until the fifth chapter. For this reason the mathematician will perhaps find it more satisfactory to proceed directly from the first chapter to the fifth and then read the second, third, and fourth.\nHis most important work on numerical methods was\nTechnique de calcul numérique\nⓉ\n(\nDigital computer technology\n)\n(1952)\n. William Edmund Milne begins a review of the text as follows:-\nThere are few general treatises, and until now none in French, devoted to methods of interpolation and procedures for numerical calculation. The aim of the present work is to make available to others the practical experience of the author, who, as an astronomer, was led to study methods of calculation and as director of a mathematical research laboratory for national defence had further occasion to solve many numerical problems. The text is addressed not only to mathematicians but also to astronomers, physicists, engineers and others who encounter numerical calculations. The author's plan of presentation is to divide each chapter or subdivision of a chapter into three parts, first theory, second technique, and third numerical applications. The theoretical part provides the derivation of the necessary mathematical formulas, the technique indicates the program by which the problem is set up as well as the organized routine for performing the calculation, and the numerical applications illustrate by specific examples the actual operation of the process.\nIn astronomy Mineur made many significant discoveries. He worked on the propagation of gravitational waves, the evolution of double stars and the proper motions of the stars. He discovered that the speeds of the stars varied according to their distance from the plane of the galaxy. He also discovered the retrograde rotation of the system of globular clusters around the galaxy and corrected the coordinates for the position of the galactic centre. His most significant astronomical discovery was to realise that there was an error in the accepted period-luminosity law for Cepheid variables and he published his revised version in\nZéro de la relation période-luminosité\nⓉ\n(\nZeros of the period-luminosity relation\n)\n(1944)\n. Since the whole scale of the Universe is based on distances determined using this relationship, this discovery doubled the size of the Universe in the sense that all objects in the Universe were now shown to be twice as far away as previously thought. This had a huge impact for\ncosmology\nand, although ill at the time, he was able to attend the meeting in Rome in\n1952\nwhere Walter Baade announced independent confirmation of Mineur's scale for the universe. Mineur explained his work in this area in the book\nL'espace interstellaire\nⓉ\n(\nInterstellar space\n)\n(1947)\nwhich also contained details of his research into interstellar absorption. Earlier, in\n1933\n, he had published\nL'Univers en Expansion\nⓉ\n(\nThe expanding universe\n)\nwhich\n[\n10\n]\n:-\n... is a good collection of the results obtained by the\nLemaître\n-\nEddington\n-\nde Sitter\nline of development of the theory of the \"expanding universe.\"\nWillem Jacob Luyten also reviews the same text, writing in\n[\n9\n]\n:-\nIt gives one of the very few up-to-date discussions of the subject, which is not merely intended for the layman or the general public, but treats the entire problem concisely, \"from the ground up,\" using directly the equations of\nEinstein\n,\nde Sitter\n,\nLemaître\n, and others, and discusses the properties of the various types of space resulting from each. It closes with a résumé of Eddington's calculations of the Cosmological constant l\n.\nIt is clearly written, and gives an admirable summary of this 'question brulante' of the present, and may be heartily recommended to any one interested in the problem.\nMineur published\nHistoire de l'astronomie stellaire jusqu'à l'époque contemporaine\nⓉ\n(\nHistory of stellar astronomy to modern times\n)\nin\n1934\n. This\n57\npage pamphlet looked at topics such as: The ancient world and medieval astronomy;\nGalileo\nand his successors; Birth of stellar astronomy;\nWilliam Herschel\n; The first half of the XIXth century; The late nineteenth century and the early modern period; Large modern instruments; and Photograph of the sky. In\n1936\nthe service for research in astrophysics was set up comprising of the\nObservatoire de Haute Provence\nⓉ\n(\nThe observatory of Haute Provence\n)\nand a laboratory in Paris. Later, in\n1939\n, this became part of the Centre National de la Recherche Scientifique\n(\nCNRS\n)\n. Mineur, together with Daniel Chalonge, was the main force behind the setting up of this service. Mineur was Secretary General of this service and director of the Paris laboratory but he was removed from these positions by the Vichy government after the fall of France during World War II. After the war he became director of the Institute d'Astrophysique in Paris, a post he held for the rest of his life.\nDuring the years\n1940\n-\n44\nMineur was an active member of the French Resistance risking his life on many occasions. Barbier writes\n[\n2\n]\n:-\nA review of Henri Mineur's career would not be complete if we did not mention his patriotism and his taste for things military. In\n1940\nhe volunteered to participate more actively in the war. After his discharge he went immediately to the 'France Combattante' movement, where he continued an effective action. Arrested by the occupiers, he was released after a short time which was even considered too short by the French courts to which he was asked to justify his actions shortly after the country was liberated. His conduct was acknowledged as irrefutable by the awarding of the Resistance Medal with a wonderful citation. He then committed himself again until the end of the war.\nIn fact Mineur's rapid release after being arrested by the Gestapo was because the German astronomer Karl-Otto Kiepenheuer was informed of his arrest by Gabrielle Mineur\n(\nwho was already separated from her husband by this time\n)\nand Kiepenheuer was able to arrange for him to be freed immediately.\nMineur had five years of bad health with heart and liver problems before his death at the early age of\n55\n. An interview given by his wife Gabrielle Mineur in\n1986\npaints a rather different picture of Henri Mineur's personality than that presented by Daniel Barbier in\n[\n2\n]\n. It becomes, for example, immediately clear why Mineur suffered from liver problems. Gabrielle Mineur said:-\nI was married to a renowned astronomer, Henri Mineur, but had problems, he drank. Tired of the hard life I had endured for ten years, I left. ...\nI spoke just now of Henri Mineur, one of the best French astronomers of that time. He had, however, a great personality defect, he drank. ... Of course I was the first to suffer the consequences, imagine for nine years, every night I was beaten. He worked three hours a day, he had an extraordinary facility, he found something and he left all happy. He went to the bistro 'Chez Paul' in the basement of the Place Dauphine, met people who are the poorest, a cobbler, ... \"Ah, There is the astronomer ...\". He was proud. He had the respect of people to whom he owed nothing. And he remained until two o'clock in the morning. Needless to say in what state he returned. For ten years I tried to save him, I tried to get him out of all that, to be what he should have been: a great personality. I helped him with his work, I had a Bachelor of Science, I was doing mathematics and I started to study astronomy. I made statistical calculations for him concerning the movement of stars and the rotation of the Milky Way. But I felt that my capabilities were inadequate and I was being assigned the role of a calculator. It was not enough. The CNRS was an institute for studying astrophysics. In fact, he had very sound views on the future. But what I couldn't do was to have him appointed Director of the Institute, while I was working there. In addition, as he hated any place other than Paris, he never went to Forcalquier where he was expected to build an observatory. It was Ferenczi and Barbier, the latter a personal friend of Mineur, who took care of the Observatoire de Haute Provence. I have great respect for Barbier who has been an excellent co-worker, who tried to put Mineur on the right track, and who wrote really moving things about him.\nFinally, we note that Mineur was twice honoured by the award of prizes from the\nAcadémie des Sciences\n.",
  "matematicos_citados_na_biografia": [
    "l'agrégation",
    "cosmology",
    "Lemaître",
    "Eddington",
    "de Sitter",
    "Einstein",
    "Galileo",
    "William Herschel",
    "Académie des Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}