{
  "nome_completo": "Henryk Michał Zygalski",
  "nome_curto": "Henryk Zygalski",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zygalski/",
  "data_nascimento": "15 July 1908",
  "local_nascimento": "Posen, German Empire (now Poznań, Poland)",
  "data_morte": "30 August 1978",
  "local_morte": "Liss, Hampshire, England",
  "summary": "Henryk Zygalski was a Polish mathematician and cryptologist who worked at breaking German Enigma ciphers before and during World War II.",
  "biografia": "Henryk Zygalski\n's parents were Michał Zygalski\n(\nborn\n15\nSeptember\n1874\nin Obra, Wolsztyn County, now Poland\n)\nand Stanisława Kielisz\n(\nborn\n8\nOctober\n1880\nin Pniewy, Szamotuły County, now Poland\n)\n. Michał Zygalski ran a tailor's shop at\n22\nMielżyńskiego Street in Poznań.\nHenryk attended the St Mary Magdalene Gymnasium in Poznań where his favourite subjects were mathematics and physics. In May\n1926\nhe took his final high school examinations; on\n4\n-\n6\nMay he sat the written papers and then, on\n14\n-\n15\nMay, he was given oral examinations. The examining committee was chaired by the Director of the Gymnasium, Dezydery Ostrowski and the committee consisted of Julian Janicki, Mieczysław Michałkiewicz\n(\nwho examined Polish\n)\n, Kazimierz Pertek\n(\nwho examined the Latin language\n)\n, Jan Odroń\n(\nwho examined the Greek language\n)\n, Aleksander Tarnawski\n(\nwho examined history\n)\n, and Józef Huss\n(\nwho examined mathematics and physics\n)\n. Later in the year\n1926\nZygalski entered the Faculty of Mathematics and Natural Sciences of Poznań University. This was a comparatively new university at this time having been founded in\n1919\nfollowing the end of World War I.\nZdzisław Krygowski\nwas a mathematician who had been awarded a doctorate by Kraków University in\n1895\n, had studied with\nLazarus Fuchs\nand\nHermann Schwarz\nin Berlin, then with\nÉmile Picard\nin Paris. He taught at Lwów Polytechnic where he was rector in\n1917\n-\n18\nbut moved to Poznań University as professor of mathematics in the year that the new university opened. Zygalski attended\nKrygowski\n's courses on higher algebra and on mathematical analysis at Poznań University. In January\n1929\nZygalski attended a new cryptology course and, because of the importance of this, we must fill in a little background about the course.\nPoland had monitored German and Russian radio messages from at least\n1918\nonwards. The importance of decoding these messages was clear since it allowed them to be aware of secret German rearmament and joint German-Russian military cooperation. The Germans had begun to develop the Enigma machine from around\n1919\nand it became the coding method for the German navy from\n1926\n. The Poles began intercepting German army radio messages in this new cipher from July\n1928\nand immediately the Polish General Staff, who ran Section II\n(\nthe Intelligence Section\n)\n, decided that new ideas were required to beak these codes. They decided to collaborate with\nKrygowski\nin putting on a cryptology course for selected students at Poznań University. This university was chosen as the place to put on the course since there were good quality students there and, a vital requirement, many had been educated in German speaking schools so were equally fluent in both German and Polish. Students had to be German speaking but loyal citizens of the Polish state. Only mathematics students were to take the course but they also had to possess qualities such as intuition, meticulousness, patience, and orderliness. The course was not put on in the university building but it was held in the evenings, twice a week, at the newly set up Cipher Bureau in a near-by military facility. The course was based on the book\nCours de cryptographie\nby the French General Marcel Givièrge. Zygalski was one of twenty students who selected for this course as were his fellow mathematics students from Poznań University,\nMarian Rejewski\nand\nJerzy Rózycki\n. In\n[\n3\n]\nthere is a description of how the students were selected for the course:-\nWell, one day or one evening, I don't remember which, one of the younger mathematics students came up to me and said that on such-and-such a day, at such-and-such an hour, Professor\nZdzisław Krygowski\n, director of Poznań University's Mathematics Institute, wanted me to come to the Institute. This student had some sort of list, and he would go and tell each of the persons on the list about this. Not everyone was invited, only a certain number of selected students. What the criteria were, I can only guess . ... I expect it wasn't Professor\nKrygowski\nwho selected the students but rather Section II, the Intelligence Section of the Polish General Staff, that had made the selection. Probably there had been correspondence between Section II and Professor\nKrygowski\n, and on the basis of this correspondence Professor\nKrygowski\nhad given them a list of all the third- and fourth-year students ... who were close to graduating, and then Section II had by its own methods conducted some kind of selection. In any case, not all the students were selected ...\nSlawo Wesolkowski explains in\n[\n12\n]\nhow the students were tested during the course:-\nA few weeks into the course, the students were given real German ciphergrams to solve. The students were told that this system had already been broken although for a time some consultants of the Polish Cipher Bureau had considered it unbreakable. The students were also told what the text was about which helped to narrow down the vocabulary used. A couple of hours later, some of the students including\nRejewski\n, Zygalski and\nRózycki\nproved capable of decoding the message. As the course progressed, the ciphers became increasingly more difficult. Unsuccessful students started dropping out of the course and others decided they did not have enough skill to keep going. Only the above-named three students managed to reconcile their regular course work with the cryptography course.\nRejewski\ngraduated from Poznań University in March\n1929\nbut Zygalski continued to study at Poznań for his Master's Degree in Mathematics. However, from the summer of\n1930\nZygalski worked for\n12\nhours a week at a laboratory set up in the underground vaults of Poznań's military command in St Martin Street, close to the Mathematics Institute, deciphering German messages. This was organised so that he could continue with his university courses. He passed his final University Master's Degree examinations on\n7\nDecember\n1931\nand agreed to continue working for the Cipher Bureau which was soon to be moved from Poznań to Warsaw. By September\n1932\nZygalski was working at the Ministry of War building in Marshal Pilsudski Square in central Warsaw but later the team moved to Biuro Szyfrów-\n4\n, the cipher office dealing with German messages in Kabackie Woods outside Warsaw.\nThere was a commercial model of the Enigma machine but the military were using a type which had been modified by the Germans in a major way to make the resulting codes, they believed, unbreakable. Zygalski and his two fellow mathematicians were presented with a commercial version of the Enigma machine and set to work, using the intercepted coded messages, to reconstruct the modifications made in the military version. They were given access to a small telecommunication factory containing the latest equipment. They introduced high powered mathematical results in solving the problems\n[\n13\n]\n:-\nThe Polish team tackled what was considered by the German military to be unbreakable. These twenty-year-old mathematicians, unversed in traditional schematic routines of academia, using their linguistic and imaginative abilities, formulated bold new theories of probability, permutations and group theory.\nThey worked out how the German Enigma machines were constructed and by the end of\n1937\nthey could decode all German messages sent by their Enigma machines. They also constructed a machine they called a \"Bomba\" to speed up the decoding which might be considered to be one of the first modern computers to be built. Zygalski contributed to the whole of this work but he is famed for one particular advance that he made.\nEven having built a replica of a German Enigma machine, there was still the problem that before a message could be decoded they had to know the setting. In the autumn of\n1938\n, Zygalski came up with perforated sheets which became known as a Zygalski sheets, which could be used to determine the setting. In fact,\nn\n!\nn!\nn\n!\nsheets were required for an Enigma machine with\nn\nn\nn\nrotors so, for the initial Enigma machines with\n3\nrotors, only\n6\nZygalski sheets were required. However, when\n5\nrotor Enigma machines came into use\n60\nZygalski sheets were required. See\n[\n1\n]\nfor details on how the Zygalski sheets were used.\nBelieving that war was imminent, the Poles decided to pass their knowledge of the Enigma machines to the British and French cryptographers. On\n24\n-\n25\nJuly\n1939\n, British and French experts met Zygalski and the other two Polish cryptographers at Biuro Szyfrów-\n4\nin the Kabackie Woods outside Warsaw. At this time they gave one of the replica Enigma machines which they had constructed to the British and one to the French. The contribution this made to the decoding work at Bletchley Park was vital, since it is unlikely that the British would have been able to read German messages but for this input by the Poles. It is not overstating the case to say that Zygalski and his two colleagues changed the course of the war.\nOn\n1\nSeptember\n1939\nGerman armies invaded Poland. On\n3\nSeptember the British and French declared war on Germany and on\n5\nSeptember Zygalski,\nRejewski\nand\nRózycki\nwere told to evacuate Warsaw on a special train. Before they left, however, they destroyed all the evidence that they were working in the Enigma machine so that the German invaders would not learn about their work. With German armies attacking from the west, they went east crossing the border into Romania on\n17\nSeptember. Reaching Bucharest, they presented themselves at the British Embassy but were told to go away and come back in a few days. They did not wait but contacted the French who arranged for them to go to Paris. They then returned west through the north of Italy which, at this time, was not at war. From Italy they entered into France and made their way to Paris. On\n20\nOctober\n1939\n, the three Polish mathematicians began decoding German ciphers from station P.C. Bruno which was established in Gretz-Armainvillers close to Paris. They decoded around\n9000\nmessages relating to the Norwegian and French campaigns.\nOn\n10\nMay\n1940\n, Germany invaded Holland, Belgium and Luxemburg then quickly moved to attack France by early June. P.C. Bruno was evacuated on\n9\nJune. On\n14\nJune German troops entered Paris and, on\n22\nJune, French Marshal Pétain signed an armistice. This divided France into Vichy France, controlled by a government collaborating with Germany, and a part under direct German control. On\n24\nJune Zygalski and his two colleagues were flown to North Africa, given new identities in Algiers, and were then returned to Vichy France where they again worked on cryptography. At this time they were based at station P.C. Cadix outside the town of Uzès close to the Mediterranean. Zygalski and his two Polish colleagues operated as Station\n300\n. This was an extremely difficult period since they were working in Vichy France which was collaborating with Germany so they played a double game which their French colleagues did not recognise.\nThe three Polish mathematicians also spent time at a base in Algeria in North Africa. There they gathered information in preparation for Operation Torch, the Allied invasion of North Africa.\nRózycki\ndied on\n9\nJanuary\n1942\nwhen the ship he was travelling on was sunk while crossing the Mediterranean from Algiers to France. On\n10\nNovember\n1942\n, following an invasion of North Africa by the Allies, German troops occupied Vichy France. Zygalski and\nRejewski\n, having learnt in advance that this was about to happen, fled first to the Italian zone, then back to occupied Vichy France, and finally on\n29\nJanuary\n1943\n, travelled to the Spanish border accompanied by a smuggler. While on this journey the two Poles were robbed at gunpoint by the smuggler. Once in Spain, Zygalski and\nRejewski\nwere arrested. Spain at this time, although a neutral country, was collaborating with Germany. After a short time in prison, Zygalski and\nRejewski\nwere released and went first to Madrid then, at the end of July\n1943\n, they fled to Portugal. A British naval vessel was anchored off the Portuguese coast and they were taken to it in a small boat. Once in England, Zygalski and\nRejewski\nbecame part of the Polish Signals Battalion stationed at Boxmoor near London. They did no further work on the Enigma codes but they did work on breaking German SS and SD hand ciphers for the rest of the war. It is unclear why these two exceptionally talented men were not allowed to contribute to the work of decoding Enigma messages going on at Bletchley Park, particularly since they had collaborated with Bletchley while at station P.C. Cadix in Vichy France.\nDuring the war a Polish Government-in-Exile operated in Britain and in\n1942\nit set up a Commission for Higher Technical Education. The object of the Commission was to train scientists and engineers who would be in a position to lead reconstruction in Poland after the war ended. However, after the war ended, Poland became part of the Soviet system and, although Poles could return to their home country from Britain, nevertheless, they knew that the Communist government would treat them with considerable suspicion. Although some returned, as for example\nRejewski\ndid, nevertheless the majority, including Zygalski, decided to remain in Britain. The original purpose of the Commission for Higher Technical Education having gone, it became, by Act of Parliament, the Polish University College in\n1947\n. The College, based in eight buildings between Knightsbridge and Putney, taught courses with the aim that students would sit examinations for external University of London degrees. A student was taught in Polish for two years and then courses would be in English. Some features of a Polish education were retained, such as students writing a thesis in their final year, but the curricula were essentially those of the University of London. Zygalski was appointed to teach at the Polish University College from the time it was set up.\nIn\n1951\nit was agreed that Battersea Polytechnic would take over the Putney Buildings of the Polish University College as well as their remaining students. However, in a move that caused resentment, only eight of the staff of the Polish University College were to be given positions in Battersea Polytechnic. Zygalski, however, was one of the eight. In June\n1957\nBattersea Polytechnic became a College of Advanced Technology. Then, in September\n1966\n, Battersea Polytechnic achieved university status and it became the University of Surrey. Zygalski was at last was on the staff of a university but, sadly, his time as a university teacher was short for he suffered a stroke in\n1968\n.\nRelatives of the three Polish mathematicians visited Bletchley Park in\n2014\nto celebrate their achievements. Jeremy Russell, Henryk Zygalski's nephew, said on this occasion:-\nOne of the biggest regrets of my life is not being sufficiently aware of his work at an age when I could ask him about it, because he never talked about it spontaneously. At the age of\n60\nhe had a stroke and for the next ten years until he died he was less and less able to communicate, so I missed a valuable opportunity to find out more about what he did.\nIn fact those at Battersea Polytechnic and the University of Surrey were never aware of Zygalski's role in the war. However, the role of Zygalski and his two fellow Polish mathematicians has been commemorated in several ways more recently\n[\n8\n]\n:-\nIn\n2002\n, a group of history and cryptology enthusiasts proposed commemorating this achievement with a monument where the history of breaking the Enigma ciphers began - in Poznań, Poland. ... From the\n24\nproposals received, the jury unanimously selected the design by Grazyna Bielska-Kozakiewicz and Mariusz Krzysztof Kozakiewicz. Their work represented the prism of a regular triangular base - its sides covered with rows of numbers. On each side of the monument, the name of one of the codebreakers emerges from the chaos of numbers. In its verdict, the jury remarked that the winning project \"represents in the purest form the brilliant thought of the three mathematicians. The artist himself seems to step aside permitting the spectator to contemplate the purely intellectual achievement of the three cryptologists.\"\nThe monument was unveiled on\n10\nNovember\n2007\nin Poznań Castle, the site of the Department of Mathematics where the three had studied. The date was the\n75\nth anniversary of the first Enigma code being broken. You can see the monument at\nTHIS LINK\n.\nOther events commemorating their remarkable achievements have been a conference \"Secrets of Enigma\" held in Bydgoszcz, Poland, on\n9\n-\n10\nNovember\n2004\n, the visit to Bletchley Park in\n2014\nby relatives of the three cryptologists mentioned above, and the publication of several books, four of which are listed in the References to this biography.",
  "matematicos_citados_na_biografia": [
    "Zdzisław Krygowski",
    "Lazarus Fuchs",
    "Hermann Schwarz",
    "Émile Picard",
    "Krygowski",
    "Marian Rejewski",
    "Jerzy Rózycki",
    "Rejewski",
    "Rózycki",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}