{
  "nome_completo": "Pierre René Jean Baptiste Henri Brocard",
  "nome_curto": "Henri Brocard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brocard/",
  "data_nascimento": "12 May 1845",
  "local_nascimento": "Vignot (part of Commercy), France",
  "data_morte": "16 January 1922",
  "local_morte": "Bar-le-Duc, France",
  "summary": "Henri Brocard was a French mathematician best known for his discovery of the so-called Brocard points of a triangle.",
  "biografia": "Henri Brocard\n's parents were Elizabeth Auguste Liouville and Jean Sebastien Brocard. He attended the Lycée in Marseilles, moving from there to the Lycée in Strasbourg. After graduating from the Lycée he entered the Academy in Strasbourg where he was coached to take the entrance examinations of the École Polytechnique in Paris.\nBrocard studied at the École Polytechnique from\n1865\nto\n1867\n. Most graduates at this time became technical officers in the military forces and indeed that is exactly the route which Brocard took, joining the Engineering Corps in the French Army. He was joining an army which had been reorganised shortly before\n(\nin\n1866)\nand all France was confident of its abilities. Brocard taught for a short while in Montpellier. Most of his army career was spent in teaching and research, with his first mathematical articles published in\n1868\n, but he did see active service quite soon in his career.\nThe popularity of Napoleon III, the French emperor, was declining in France and he thought a war with Prussia might change his political fortunes since his advisers told him that the newly reorganised French Army could defeat Prussia. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states. With both sides feeling that a war was to their advantage, the Franco-Prussian War became inevitable. On\n14\nJuly\n1870\n, Bismarck sent a telegram aimed at infuriating the French government. He succeeded, for on the\n19\nJuly France declared war on Prussia very confident that their newly reorganised army was superior to that of the Prussians. Brocard was with the\n120\n,\n000\nFrench troops under Marshal MacMahon accompanied by Napoleon III. They moved towards Metz where the French Army of the Rhine was trapped. However, Prussian intelligence worked out their movements and engaged them on\n29\nand\n31\nAugust on the river Meuse. The French fell back to the fortress at Sedan where they were encircled by the Prussian troops. After attempting to break out on a number of occasions, the French suffered heavy losses. When the Prussians attacked them on\n1\nSeptember the French surrendered. Brocard was one of\n83\n,\n000\nFrench soldiers taken as prisoners of war at Sedan.\nThe war was an embarrassing defeat for the French. After Brocard was released he returned to his army life of teaching and research. The\nFrench Mathematical Society\n, Société Mathématique de France, was founded in\n1872\nand Brocard joined the Society in the year after it was founded. In\n1875\nhe was made a life member of the French Association for the Advancement of Science and the French Meteorological Society. By this time, however, he was in north Africa where he had been sent. He spent around ten years, from\n1874\nto\n1884\n, in north Africa. Mostly he was in Algiers which, after being captured by the French in\n1830\n, had been made the military and administrative headquarters for their African empire.  At the Congress of Berlin in\n1878\nthe British withdrew their objections to French expansion in North Africa. Tunisia then became a French protectorate in\n1881\n-\n83\n. Brocard took part in the scientific life of Algiers, being a cofounder of the Meteorological Institute there, and a member of the local committee of the meeting of the  French Association for the Advancement of Science in Algiers in\n1881\n. At this meeting Brocard delivered a paper\nÉtudes d'un nouveau cercle du plan du triangle\nⓉ\n(\nStudies of a new circle related to the triangle\n)\nwhich contains what is known today as the 'Brocard circle'\n(\nsee below\n)\n.  During his ten years in North Africa, Brocard also spent time in Oran, which was occupied by the French in\n1831\nand turned by them into a modern port and major naval base.\nIn\n1884\nBrocard returned to France where he served with the Meteorological Commission in Montpellier, Genoble and Bar-le-duc. He continued to serve with the army until he retired in\n1910\nhaving reached the rank of lieutenant colonel. He served on many government commissions and was an active mathematician, as he had been throughout his life. He published in many different journals, but his two major publications were the two volumes of\nNotes de bibliographie des corbes géométriques\nⓉ\n(\nBibliographic notes on geometric curves\n)\n(1897\n,\n1899)\nand the two volumes of\nCourbes géométriques remarkables\nthe first of which was published in\n1920\n, the second in\n1967\nlong after his death. This last work was written in collaboration with T Lemoyne\n[\n1\n]\n:-\nThe Notes may be regarded as a source book of geometric curves, with a painstakingly prepared index containing more than a thousand named curves. The text consists of brief descriptive paragraphs, with diagrams and equations of these curves.\nLet us look at the triangle for which Brocard is famed. The Brocard points of a triangle\nA\nB\nC\nABC\nA\nB\nC\nare\nV\n,\nW\nV, W\nV\n,\nW\nwhere\nV\nA\nB\n,\nVAB,\nV\nA\nB\n,\nV\nB\nC\nVBC\nV\nB\nC\nand\nV\nC\nA\nVCA\nV\nC\nA\nand the angles\nW\nB\nA\nWBA\nW\nB\nA\n,\nW\nC\nB\nWCB\nW\nC\nB\nand\nW\nA\nC\nWAC\nW\nA\nC\nare equal.\n[\nDraw a circle tangent to\nA\nB\nAB\nA\nB\nat\nA\nA\nA\npassing through\nC\nC\nC\n, another tangent to\nB\nC\nBC\nB\nC\nat\nB\nB\nB\npassing through\nA\nA\nA\n, a third tangent to\nC\nA\nCA\nC\nA\nat\nC\nC\nC\npassing through\nB\nB\nB\n. They are concurrent at\nV\n.\nV.\nV\n.\n]\nAngle\nV\nA\nB\nVAB\nV\nA\nB\nis called the Brocard angle and satisfies\ncot\n⁡\nV\nA\nB\n=\ncot\n⁡\nA\n+\ncot\n⁡\nB\n+\ncot\n⁡\nC\n\\cot VAB = \\cot A + \\cot B + \\cot C\ncot\nV\nA\nB\n=\ncot\nA\n+\ncot\nB\n+\ncot\nC\n.\nThe Brocard circle is that drawn on a diameter, the end points of which are the circumcentre and symmedian point of the triangle. It passes through the Brocard points.\nAlthough best known through this work on the triangle, Brocard also made other contributions which have proved important. The problem of Brocard referred to in\n[\n2\n]\nis the following. In\n1876\n, Brocard asked if the only solutions to the equation\nn\n!\n+\n1\n=\nm\n2\nn! + 1 = m^{2}\nn\n!\n+\n1\n=\nm\n2\n, in positive integers\n(\nn\n,\nm\n)\n(n, m)\n(\nn\n,\nm\n)\n, are\n(4\n,\n5)\n,\n(5\n,\n11)\n,\n(7\n,\n71)\n. This problem remains open. It is not even known whether there are only finitely many solutions. Let us mention a further contribution, this time to pursuit curves. A\npursuit curve\nis that traced out by a point\np\np\np\nif it is always directed towards a point\nx\nx\nx\ntracing out some curve, both points moving with the same velocity. The idea was introduced by\nBouguer\naround\n1732\n. In\n1877\nLucas\nasked what curves would be traced out by three dogs, initially at the vertices of an equilateral triangle, if they run one after the other. In\n1880\nBrocard showed that each dog's pursuit curve would be that of a logarithmic spiral and that the dogs would meet at a common point. This point is now known as the Brocard point of the triangle.\nBrocard spent the last years of his life in Bar-le-Duc as a somewhat solitary figure. He was an only child, and had no close family. He never married and seldom entertained friends. He did, however, continue to take an active part in scientific life, being the librarian of the Bar-le-Duc Society of Letters, Sciences, and Arts. He declined the offer to become president of the Society. He spent many hours making astronomical observations from his back garden. He attended the International Congress of Mathematicians at Zürich in\n1897\n, Paris in\n1900\n, Heidelberg in\n1904\n, Rome in\n1908\n, Cambridge, England in\n1912\n, and Strasbourg in\n1920\n.\nGuggenbuhl writes in\n[\n1\n]\n:-\nOn\n16\nJanuary\n1922\n, Brocard was found dead at his desk. In accordance with his specific request, he was buried in the small cemetery at Vignot, next to his father and mother.",
  "matematicos_citados_na_biografia": [
    "French Mathematical Society",
    "Bouguer",
    "Lucas"
  ],
  "imagens": [
    "brocard.jpg",
    "../../Diagrams/Brocard.gif"
  ]
}