{
  "nome_completo": "Henry C Heaton",
  "nome_curto": "Henry Heaton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heaton/",
  "data_nascimento": "19 April 1846",
  "local_nascimento": "Millsboro, Washington County, Pennsylvania, USA",
  "data_morte": "27 January 1927",
  "local_morte": "Biddle, Power River County, Montana, USA",
  "summary": "Henry Heaton was an American amateur mathematician who published a large number of elegant problems and puzzles.",
  "biografia": "Henry Heaton\n's parents were Weaver Heaton\n(1810\n-\n1873)\nand Rebecca Naylor Sharp\n(1816\n-\n1879)\n. Weaver Heaton, the son of Jacob Bowen Heaton\n(1786\n-\n1839)\nand Rachel Weaver\n(1787\n-\n1858)\n, married Rebecca, the daughter of Isaac Sharp and Eliza Ann Naylor, on\n26\nOctober\n1834\nin Pennsylvania. Weaver was a millwright who designed and built mills, and made mill machinery. Weaver and Rebecca Heaton had eight children: Emaline Heaton\n(\nborn\n1835)\n; James Heaton\n(\nborn\n1838)\n; Rachel Heaton\n(\nborn\n1840)\n; Eliza Heaton\n(\nborn\n1842)\n; Henry C Heaton\n(\nborn\n1846\n, the subject of this biography\n)\n; William Naylor Heaton\n(\nborn\n1847)\n; George Heaton\n(\nborn\n1851)\n; and Ella M Heaton\n(\nborn\n1851)\n. We note that George Heaton and Ella M Heaton were twins. At the time of the\n1850\ncensus\n(\ntaken on\n9\nAugust of that year\n)\n, John H Sharp aged\n19\nwas also living with the family. Although we are unsure how he was related to the family, it is highly probable\n(\ngiven his surname Sharp\n)\nthat he was a relation of Henry's mother.\nIn\n1852\nthe family moved to Greenfield also in Washington County, Pennsylvania. In Greenfield, Henry attended the local\n[\n1\n]\n:-\n... school four months every winter until he was fourteen years old. During the remaining portion of the year he attended, sometimes a subscription school, but a good portion of the time the California Seminary, an institution located in the adjoining village of California, and patronized largely by young folks, male and female, who either were teachers or expected to become such. Up to his fifteenth year his educational advantages were very good for the time.\nThe\n1860\ncensus was taken on\n17\nJuly of that year and at that time Weaver and Rebecca Heaton together with seven of their eight children were still living at their home in Greenfield. James, who was\n21\nyears old at this time was working as a ship's carpenter. Rachel was\n18\n, Eliza\n17\n, Henry\n14\n, William\n11\n, and twins George and Ella were\n8\nyears of age.\nBy this time Henry had learn quite a lot of elementary mathematics\n[\n1\n]\n:-\nHe commenced the study of Arithmetic at ten, Elementary Algebra at eleven or twelve, Trigonometry in his fourteenth year, and Higher Algebra and the first four books of Geometry were completed just after he was fourteen years old. From the effects of one example, in arithmetic, which his teacher had solved for him, his mathematical talent became aroused, and he was able to solve, unaided, any problem found in the textbooks.\nHenry Heaton began his two parallel careers at the age of eighteen. One of these careers was as a teacher while the other was as a carpenter. With these two jobs he was able to make enough money to allow him to attend Mount Union College in Ohio in the winter of\n1866\n-\n67\nand he studied there for his B.S. which he was awarded\n17\nJune\n1869\n. In September\n1869\nhe moved to Iowa to live with his aunt and uncle John and Ann Sharp in the town of Taylor, Appanoose County, Iowa. At the time of the\n1870\ncensus, taken on\n29\nJuly of that year, Heaton was living with the Sharps and their eight children aged between\n8\nand\n26\nyears, who were all living in the family home. Heaton's occupation, as shown on the census form, was that of carpenter. By this time Heaton's parents had left Greenfield and were living in New Haven, Fayette County, Pennsylvania.\nIn the autumn of\n1864\nJoel E Hendricks\nand his family moved to Des Moines, Polk County, Iowa. There\nHendricks\nbecame involved in surveying and until\n1873\nhe undertook such work. However,\nHendricks\nhad spent his whole life with a great love for mathematics and in\n1873\nhe founded a mathematics journal which he named\nThe Analyst\n. Heaton moved to Des Moines to take up a position as a teacher and there he made the acquaintance of Hendricks who encouraged Heaton's interest in mathematics.\nHendricks\nsuggested that Heaton subscribe to the\nYates County Chronicle\nand it was to this journal that he began to send solutions of mathematical problems posed in the\nChronicle\n. It was\nHendricks\nwho taught Heaton the basic concepts of\nprobability theory\nwhich he quickly mastered.\nThe\n1\nst  part of the\n1\nst  volume of\nThe Analyst\nappeared in January\n1874\n. In the third part of the\n1\nst  volume Heaton's solution to the following problem was published:-\nA ball rolls down the convex surface of a fixed sphere, the friction being just sufficient to prevent sliding; find the point where it leaves the sphere.\nIn Volume\n3\n, Part\n3\n, Hendricks published a solution to the \"Four Bricks Problem\" and notes that Heaton has solved this problem. This famous problem is as follows:-\nIf four bricks are placed on each other at random, with their longest axes horizontal and in the same vertical plane, determine the probability that the pile will stand.\nThe problem had first been posed by\nArtemas Martin\nin the December\n1871\npart of the\nSchoolday Visitor\nbut had not been solved. G H Harvill writes in\n[\n1\n]\nthat Heaton contributed:-\n... many elegant solutions of difficult problems in 'The Analyst', 'Mathematical Visitor', 'Mathematical Magazine', 'Mathematical Messenger', 'Annals of Mathematics' and 'School Visitor', to all of which he has been a regular and leading contributor. His many elegant solutions of the most difficult Probability problems places him abreast of the renowned\nE B Seitz\nand today he has no superiors and few equals, in this, his favourite field.\nHeaton's contributions to\nThe Analyst\nare given at\nTHIS LINK\n.\nAfter\nThe Analyst\nended publication in\n1883\n, its continuation was the\nAnnals of Mathematics\n, the\n1\nst  part of the\n1\nst  volume of which was published in March\n1884\n. Heaton continued his contributions to the\nAnnals\n. For example in\n1887\nhe solved the following problem in the\nAnnals\nposed by\nArtemas Martin\n:-\nEach of four equal circles touches two of the others. Find the average area included between them.\nBetween\n1878\nand\n1894\nHeaton posed, or published solutions to, several problems in\nThe Mathematical Visitor\n. For example he posed:-\nIf\nn\nn\nn\npeople meet by chance, what is the probability that they all have the same birthday, supposing every fourth year a leap year.\nHe solved various problems including:-\nThe first of two casks containing a gallons of wine, and the second b gallons of water. Part of the water is poured into the first cask, and then part of the mixture is poured back into the second. Required the probability that not more then\n1\nn\n\\large\\frac{1}{n}\\normalsize\nn\n1\n​\nof the contents of the second cask is wine.\nHe gained fame\n(\nand a prize\n)\nby solving\nArtemas Martin\n's 'Three Pennies' Prize Problem:-\nThree equal coins are dropped horizontally at random, one at a time, into a circular box whose diameter is twice that of one of the coins. Find the chance that only one coin rests on the bottom of the box.\nAnother problem he solved was the famous \"Duck Problem\":-\nA sportsman saw a duck in a circular pond, which dodged behind a tree growing in it. The sportsman ran along the edge of the pond, but the duck kept behind the tree all the time and swam towards the shore. Required the equation of the curve the duck described, and the distance it swam to reach the shore.\nThe article\n[\n1\n]\nwas published in\n1895\nand at this time the\nAmerican Mathematical Monthly\nhad only just begun publication. Heaton posed the following problem in the\n1\nst  part of the\n1\nst  Volume of the\nMonthly\nin\n1894\n, namely:-\nThrough two given points to pass four spherical surfaces tangent to two given spheres.\nWe list a collection of problems posed by Heaton, and a collection of those solved by Heaton, all of which were published either in\nThe Analyst\nor in the\nAmerican Mathematical Monthly\n, at\nTHIS LINK\n.\nWe noted that Heaton met\nJoel Hendricks\nwhen he\n(\nHeaton\n)\nwas teaching at Des Moines in the early\n1870\ns. On\n30\nMarch\n1875\nhe married Mary Ann Marker, a daughter of George Marker\n(1818\n-c.\n1877)\nand Rachel Bitner\n(1818\n-\n1854)\n. Henry and Mary Ann Heaton had two children; Roy Henry Heaton\n(\nborn\n26\nJune\n1876)\nand Emma Margaret Heaton\n(\nborn\n27\nMarch\n1884)\n. Emma died at the age of eight in November\n1892\n.\nThe Heatons did not stay in Des Moines for long for in\n1877\n-\n78\nthey were living in Sabula, Jackson County, Iowa, a town on the Iowa/Illinois border almost surrounded by the Mississippi River, where Heaton was Superintendent of Schools. While there he published the paper\n[\n3\n]\non cubic equations. In this paper Heaton solved the cubic equation\nx\n3\n−\n3\na\nx\n=\n2\nb\nx^{3} - 3ax = 2b\nx\n3\n−\n3\na\nx\n=\n2\nb\nby putting\nx\n=\n2\n√\na\ncos\n⁡\nt\nx = 2√a \\cos t\nx\n=\n2\n√\na\ncos\nt\n. Then the original equation becomes\n2\ncos\n⁡\n3\nt\n=\n2\nb\na\n√\na\n2\\cos 3t = \\large\\frac{2b}{a√a}\\normalsize\n2\ncos\n3\nt\n=\na\n√\na\n2\nb\n​\nso\nx\n=\n2\n√\na\ncos\n⁡\n[\ncos\n⁡\n−\n1\n(\nb\n3\na\n√\na\n)\n]\nx = 2√a \\cos[\\cos^{-1}(\\large\\frac{b}{3a√a}\\normalsize )]\nx\n=\n2\n√\na\ncos\n[\ncos\n−\n1\n(\n3\na\n√\na\nb\n​\n)\n]\n.\nBy\n1879\nHeaton was living in Atlantic, Cass county, Iowa, a town between Omaha and Des Moines, and in\n1881\nin Perry, Iowa, about\n40\nkm north west of Des Moines. Later in\n1881\n, he moved to the town of Lewis, Iowa where he was close to Atlantic. By\n1883\nhe was once again living in Atlantic, Cass county. He was still living in Atlantic when the\nAmerican Mathematical Monthly\nbegan publishing in\n1894\nand by this time he had been awarded a Master's Degree.\nIn\n1896\nHeaton, who was now County Surveyor, published\n[\n2\n]\n, namely\nA Method of Solving Quadratic Equations\nin the\nAmerican Mathematical Monthly.\nIn this paper he presented the following method of deriving the \"usual\" formula for the solution of the general quadratic:\nLet it be required to solve the equation\na\nx\n2\n+\nb\nx\n+\nc\n=\n0\nax^{2} + bx + c = 0\na\nx\n2\n+\nb\nx\n+\nc\n=\n0\nTransposing the middle term we have\na\nx\n2\n+\nc\n=\n−\nb\nx\nax^{2} + c = -bx\na\nx\n2\n+\nc\n=\n−\nb\nx\nSquaring,\na\n2\nx\n4\n+\n2\na\nc\nx\n2\n+\nc\n2\n=\nb\n2\nx\n2\na^{2}x^{4} + 2acx^{2} + c^{2} = b^{2}x^{2}\na\n2\nx\n4\n+\n2\na\nc\nx\n2\n+\nc\n2\n=\nb\n2\nx\n2\nSubtracting\n4\na\nc\nx\n2\n4acx^{2}\n4\na\nc\nx\n2\n,\na\n2\nx\n4\n−\n2\na\nc\nx\n2\n+\nc\n2\n=\n(\nb\n2\n−\n4\na\nc\n)\nx\n2\na^{2}x^{4} - 2acx^{2} + c^{2} = (b^{2} - 4ac)x^{2}\na\n2\nx\n4\n−\n2\na\nc\nx\n2\n+\nc\n2\n=\n(\nb\n2\n−\n4\na\nc\n)\nx\n2\nExtracting the square root,\na\nx\n2\n−\nc\n=\n±\n√\n(\nb\n2\n−\n4\na\nc\n)\nx\nax^{2} - c = ±√(b^{2} - 4ac)x\na\nx\n2\n−\nc\n=\n±\n√\n(\nb\n2\n−\n4\na\nc\n)\nx\nAdding equation\n(2)\n,\n2\na\nx\n2\n=\n[\n−\nb\n±\n(\n√\n(\nb\n2\n−\n4\na\nc\n)\n]\nx\n2ax^{2} = [-b ± (√(b^{2} - 4ac)]x\n2\na\nx\n2\n=\n[\n−\nb\n±\n(\n√\n(\nb\n2\n−\n4\na\nc\n)\n]\nx\nWhence\nx\n=\n1\n2\na\n[\n−\nb\n±\n(\n√\n(\nb\n2\n−\n4\na\nc\n)\n]\n.\nx = \\large\\frac{1}{2a}\\normalsize [-b ± (√(b^{2}- 4ac)].\nx\n=\n2\na\n1\n​\n[\n−\nb\n±\n(\n√\n(\nb\n2\n−\n4\na\nc\n)\n]\n.\nHeaton asks, \"Is this new?\"\nIn\n1898\nHeaton published\n[\n4\n]\n, namely\nInfinity, the Infinitesimal, and Zero\n. He begins the paper by writing:-\nSo much has been written upon this subject that I do not flatter myself that I can write anything new. I shall only attempt to point out a few of the things that have been written that to my mind plainly cannot be true, and with these errors in view endeavour to express the truth as I see it. If in so doing I fall into error I shall have the satisfaction of knowing that greater men have done the same. In the Analyst, Vol. VIII., pages\n105\n-\n113\n, Professor Judson has a very interesting article upon this subject in which he quotes freely from many distinguished authors many things that are plainly fallacious. Yet when he attempts to outline his view of the subject it seems to the writer that he blunders fully as badly as those whom he criticises.\nLater in the article, showing remarkable confidence in his own understanding, he writes:-\nI believe that mathematical infinity is something beyond the ken of even a Professor\nDe Morgan\n, that he was never so far from having a correct conception of it as when he claimed to have a clear conception of it.\ntan\n⁡\nx\n\\tan x\ntan\nx\ndoes not become infinite as x approaches\n90\n°, for so long as x differs by the shadow of a hair from\n90\n°,\ntan\n⁡\nx\n\\tan x\ntan\nx\nis finite. I think I know exactly what is meant by the term zero. But I can have no conception either of infinity or of the infinitesimal, and I think it would be well if mathematicians would let both pretty severely alone.\nIn\n1906\nHeaton moved from Atlantic to Belfield, North Dakota. It is unclear exactly how long he lived in Belfield but by\n1917\nhe was back in Atlantic, Iowa. He died in Biddle, Power River County, Montana, at the age of\n80\nin January\n1927\n. His wife outlived him by over a year, dying in Biddle in June\n1928\nat the age of\n84\n.",
  "matematicos_citados_na_biografia": [
    "Joel E Hendricks",
    "Hendricks",
    "probability theory",
    "Artemas Martin",
    "E B Seitz",
    "THIS LINK",
    "Joel Hendricks",
    "De Morgan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}