{
  "nome_completo": "Herbert Pahlings",
  "nome_curto": "Herbert Pahlings",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pahlings/",
  "data_nascimento": "12 May 1939",
  "local_nascimento": "Krefeld, Germany",
  "data_morte": "9 January 2012",
  "local_morte": "Aachen, Germany",
  "summary": "Herbert Pahlings was a German mathematician who worked in group theory and the representation theory of finite groups.",
  "biografia": "Herbert Pahlings\nstudied mathematics and physics at the universities of Tübingen and Giessen, beginning his studies in\n1959\n. He was awarded his Diploma by the Justus-Liebig University of Giessen in\n1965\nand then, in\n1968\n, he was awarded his PhD for his thesis\nBeiträge zur Theorie der projektiven Darstellungen endlicher Gruppen\nⓉ\n(\nContributions to the theory of projective representations of finite groups\n)\n. His advisor was Hermann Boerner. In his thesis Pahlings gave a number of interesting results on faithful irreducible projective representations of groups.\nSince\n1965\nhe worked as an assistant at the department of mathematics at Giessen, interrupted by visits in\n1968\nto Texas A & M in the United States, and in\n1973\n-\n74\nto Carleton University, Ottawa, Canada. In\n1975\nhe got his\nHabilitation\nand a permanent position as Akademischer Oberrat at Giessen where he worked until, in\n1979\n, he was appointed to a professorship at Lehrstuhl D für Mathematik in Aachen, Germany.\nUntil his retirement in\n2004\nhe lectured at all levels, from beginners courses on Linear Algebra with an audience of several hundred students to a broad spectrum of special courses, mainly on algebraic topics, in particular from group theory and representation theory. His lectures contained a wealth of material, often enriched in a very original way by his own ideas. They were loved and esteemed by the students for the clarity of their design and presentation. No wonder that he attracted many of the best students to work under his advice for their Diploma or even PhD. Of his PhD students Meinolf Geck, Klaus Lux, Götz Pfeiffer and Jürgen Müller meanwhile teach at universities while Thomas Breuer played and is playing a main role in the development of GAP and the construction of its representation theoretic data bases.\nHerbert Pahling's papers from his time at Giessen deal with a variety of\n(\noften concrete\n)\nproblems from the\nrepresentation theory\nof finite groups. Also from this time there are lecture notes on modular representation theory of a course he gave at Istanbul in\n1973\n. But it was only when he moved to Aachen that he soon developed a keen interest in algorithmic methods of representation theory, their implementation and use. He participated very actively in the development and use of a special program system CAS\n(\nCharacter Algebra System\n)\n, which he describes\n(\ntogether with his coauthors\n)\nin a paper published in the proceedings of a conference on Computational Group Theory held at Durham in\n1982\n. The highlight of the paper were some worked-out examples provided by Herbert Pahlings. They show how new character tables could be obtained from\n(\nparts of\n)\nknown ones interactively using CAS without ever touching the elements of the underlying groups.\nAt that time the classification of finite simple groups had just been finished and the preparation of the 'Atlas of Finite Groups' was on the way. Character tables of simple and related groups are a dominant feature of the Atlas and programs such as the ones of CAS were welcome in particular for interactive handling the character tables of groups which were far too big to be worked with from their elements. In the preface of the Atlas,\nJohn Conway\nrecognized the help obtained from Herbert Pahlings and the CAS group both in providing additional tables and correcting errors that are unavoidable in working 'by hand' with such a huge amount of data.\nCAS was still written in Fortran and had a language suitable for interactive handling but not really for implementing new algorithms, so in\n1986\na number of colleagues at RWTH Aachen led by\nJoachim Neubüser\ndecided to begin developing GAP\n(\nGroups, Algorithms and Programming\n)\nas a new system in which only basic time-critical functions were written in C while its own problem-adapted language should serve both as the user language and for implementation of mathematical algorithms. Herbert Pahlings patiently and constructively took part in the long discussions on the design of GAP and together with his students became a main developer and frequent and successful user of GAP. Several of his papers from his time in Aachen deal with applications to topics studied elsewhere: for example, he contributed to the project of realizing finite groups as\nGalois\ngroups and there are papers on the\nMöbius\nfunction of groups.\nHerbert Pahlings has spread the knowledge on computational representation theory by lectures and complete courses given at many places in countries such as Brazil, South Africa, Ireland, Hungary and Italy\n(\nthere are published lecture notes of some of these courses\n)\nand was a splendid host for many visitors who came to Aachen to learn about this topic. He also served as a member of the GAP Council from\n1995\nto\n2007\n, and as such had been editor for the formal acceptance of several GAP packages.\nHerbert Pahlings' former students and colleagues have taken part in the publication of several collections of data connected with group representations: Gerhard Hiss and Klaus Lux published\n'Brauer Trees of Sporadic Groups'\nin\n1989\n, Christoph Jansen and Klaus Lux together with Richard Parker and Robert Wilson\n'An Atlas of Brauer Characters'\nin\n1995\n(\nwhich also contains corrections and addenda to the\n'Atlas'\n)\n, and Thomas Breuer\n'Characters and Automorphism Groups of Compact Riemann Surfaces'\nin\n2000\n.\nIn\n2010\nHerbert Pahlings, together with his former student Klaus Lux, published\n'Representations of Groups, A Computational Approach'\n, a book of\n460\npages which in more than one way breaks new ground. It is the first text presenting a full view of algorithmic methods in both ordinary and modular representation theory, thus closing a strongly felt gap in the available literature on computational group theory. Moreover rather than relying on other texts for the theoretical background it builds up from scratch the theorems together with the algorithms, and it demonstrates the use of algorithms by worked examples using GAP implementations. Thus it gives an example and a guideline for everybody planning a course on some algebraic structure for which not only theorems but also algorithms are known. Let us quote from a review of the book by Shigeo Koshitani:-\nRepresentation theory of finite groups is still one of the most exciting, interesting and important subjects in mathematics. The main pioneers of this theory are\nG Frobenius\n,\nW Burnside\n,\nI Schur\nand\nR Brauer\n. ... In representation theory of finite groups, modern circumstances, especially in the last two decades, are, however, very different from those when\nBrauer\nwas studying the subject. Namely, we are easily able to use computer algebra systems such as GAP and MAGMA. GAP was developed by\nJoachim Neubüser\nin Aachen between the late\n1980\n's and early\n1990\n's, and he is called the \"father'' of GAP in the introduction of the book under review. Since then, GAP has been maintained, checked, developed and improved mainly by the GAP team in Aachen until very recently. As the authors say, the book under review grew out of some courses given by the second author\n[\nHerbert Pahlings\n]\nin Aachen starting in the early\n1990\n's. As far as the reviewer knows, the book under review is the first to provide readers a sort of introduction to ordinary and modular representation theory of finite groups with emphasis on computational aspects. If we look at the contents of the book under review, we can easily find out that this wonderful book has a very different tone from the other standard textbooks on representation theory of finite groups. The reason is, surely, its computational aspect. ... the reviewer feels confident in saying that this is really a wonderful, nice and significant book, which is so well written, and it is recommended to a wide range of mathematicians, including not only graduate students but also many mathematicians of greater experience.\nPahlings is survived by his wife, whom he met when he was a student, his three sons and six grandchildren. Joachim Neubüser gave the following tribute to his colleague:-\nPersonally, I will always remember with gratitude the many years of our close, friendly and fruitful collaboration at Lehrstuhl D für Mathematik, RWTH Aachen, and I think we all  remember him with gratitude for his valuable contributions to computational group theory and to GAP in particular.\nThis biography is, with some additions, that written by\nJoachim Neubüser\n[\n1\n]\nand we thank him for allowing us to reproduce it in this archive.",
  "matematicos_citados_na_biografia": [
    "Habilitation",
    "representation theory",
    "John Conway",
    "Joachim Neubüser",
    "Galois",
    "Möbius",
    "G Frobenius",
    "W Burnside",
    "I Schur",
    "R Brauer",
    "Brauer"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}