{
  "nome_completo": "Herbert Dingle",
  "nome_curto": "Herbert Dingle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dingle/",
  "data_nascimento": "2 August 1890",
  "local_nascimento": "Brixton, London, England",
  "data_morte": "4 September 1978",
  "local_morte": "Hull, England",
  "summary": "Herbert Dingle was an English physicist and philosopher of science who wrote a number of influential books. He was involved in several long-running disputes with other physicists.",
  "biografia": "Herbert Dingle\n's father, James Henry Dingle\n(\nborn January\n1858)\n, died shortly after he was born and his family moved to Plymouth. James Henry Dingle, born in Liskeard, Cornwall, the son of the shoemaker James Henry Dingle\n(1834\n-\n1915)\nand Rebecca Davy\n(1834\n-\n1919)\n, married Emily Jane Goddard\n(1864\n-\n1942)\nin Liskeard, Cornwall in\n1888\n. They had two children, Reginald James Dingle\n(\nborn\n24\nJune\n1889\n, died\n27\nOctober\n1973)\nand Herbert Dingle, the subject of this biography. At the time of the\n1891\ncensus Reginald was living with his paternal grandparents in Liskeard, Cornwall while Herbert was living with his widowed mother Emily Jane Dingle, his aunt Harriet F Goddard, and his maternal grandparents Joseph and Sophia Goddard in Plymouth. Reginald Dingle became an editor and author, writing books such as\nDemocracy in Spain\n(1905)\nand\nRussia's Work in France\n(1938)\n.\nHerbert was not able to finish school and started working as a clerk at age\n14\n. Dingle kept studying on his own, however, and earned a Royal Scholarship for Physics at Imperial College of Science and Technology, London, in\n1915\nat age\n25\n. In\n1918\n, he graduated, having become a Demonstrator in the Physics Department.\nAlso in\n1918\n, he married Alice Westacott, with whom he had a son. Alice died in\n1947\nand Dingle never remarried. Their son became an industrial chemist, but died before his father.\nStudying under Arthur Fowler, Dingle became interested in spectroscopy and its applications to astronomy. He researched the spectra of ionised and doubly ionised fluorine, iron and mercury. In\n1922\nhe became a Fellow of the\nRoyal Astronomical Society\n. Soon after, in\n1924\n, he published\nModern Astrophysics\n, which was one of the first books on the subject. He begins the Preface as follows:-\nA science in its infancy is the least satisfactory, and, at the same time, the most profitable theme for a general description. It is the leas satisfactory because its conclusions - if we can call them conclusions are, at the best, little more than tentative summaries of observed facts, liable at any moment to be superseded by wider generalisations: the inconsequential playfulness of childhood has not given place to the graver consistency of mature age. It is the most profitable theme because it has not yet lost the quickening inspiration that alone can produce great things. It is in touch with the poetry and romance that go side by side with all true science. In its eyes still shines \"the light that never was on sea or land.\" This book I intended primarily for the general public. The subject of Astrophysics is presented as a panorama, seen from a detached point of view with vision characterised by breadth rather than by acuteness. An attempt has been made also to convey indirectly to the reader something of the emotions of the practical worker - something of the strange mixture of enthusiasm and wonder, assurance and distrust, eagerness and fear; of amazement at the splendour of his achievements, and humiliation at their meanness; of delight in his knowledge, and disgust at his ignorance; of confidence for the future, and shuddering at its difficulties; in short, of the \"divine despair,\" that agitates the breast of the modern astrophysicist when he surveys the untrodden land into which he has pierced.\nHe also collaborated on\nThe Splendour of the Heavens\n(1923)\nand\nThe Life and Work of Sir Norman Lockyer\n(1929)\n. Dingle participated in two failed expeditions to observe the Sun's spectrum during a total solar eclipse: the first in\n1927\nto Colwyn Bay when there was complete cloud cover and rain,  and the second in\n1932\nto Montreal when again it was cloudy. In\n1940\n, a third expedition was cancelled due to the outbreak of the Second World War. He became head of the spectroscopy section at Imperial College after Fowler retired in\n1935\n, and later was appointed to the chair of Natural Philosophy in the Physics Department in\n1937\n.\nDingle also showed an early interest in relativity. He wrote\nRelativity for All\nin\n1922\n, in which he explained the subject\n(\nwhich was considered highly specialised at the time\n)\nin simple terms. In\n1932\n, during a stay in the California Institute of Technology, he met\nAlbert Einstein\nand contributed to R C Tolman's textbook\nRelativity, Thermodynamics and Cosmology\n.\nDingle had a great interest in the philosophy of science. On this subject, he published\nScience and Human Experience\n(1931)\n,\nThrough Science to Philosophy\n(1937)\n, the latter of which was based on his Lowell Lectures at Harvard, in\n1936\n. His philosophy can be described as following the tradition of British empiricism. He believed that true scientific knowledge could only be obtained by first collecting data and then, and only then, elaborating a hypothesis using said data. This is what is often referred to as the inductive method.\nFor extracts from reviews to these two books, as well as many other books by Dingle, see\nTHIS LINK\n.\nBecause of his philosophical ideas, Dingle clashed with some modern approaches to the study of cosmology. This culminated in\n1937\n, in an article in\nNature\ntitled\nModern Aristotelism\n. In it he criticised\nMilne\n(\nand on a lesser note\nEddington\nand\nDirac\n)\nfor employing a hypothetico-deductive method, in which a hypothesis is first created and then corroborated by correctly implied observations, instead of an inductive method. Dingle went so far as to say that\nMilne\n's method was completely separate from reality, and called it a treachery to\nNewton\n's methods. He wrote in\nModern Aristotelism\n:-\nInstead of the induction of principles from phenomena we are given a pseudo-science of invertebrate cosmology, and invited to commit suicide to avoid the need of dying.\nThis was controversial and occasioned a special fifteen-page supplement of\nNature\n(12\nJune\n1937\n, No.\n3528)\nin which sixteen scientists responded to Dingle's article, among which were\nMilne\n,\nEddington\nand\nMcCrea\n. The debate helped shape the future methods of the study of the cosmos, as well as clarify the relation between mathematical deduction and physical experiments. Dingle's ideas eventually faded away and are not widely accepted today, while\nMilne\n's method became the norm\n(\nMilne\nwas awarded the James Scott prize in\n1943\nand became the President of the\nRoyal Astronomical Society\nin the same year\n)\n.\nDingle published the book\nThrough Science to Philosophy\n(1937)\nin which he continued to put forward the ideas of his\nModern Aristotelism\narticle.\nArthur Eddington\n, in a review of book, writes\n[\n18\n]\n:-\n... Dingle scarcely recognises the existence of a route by which the scientific study of the universe has, through its own practical development, independently reached conclusions comparable with those of philosophy. Dingle rather goes out of his way to give the impression that his hand is against every man. Doubtless some of his contentions will arouse opposition; but his insistent magnification of imperceptible differences seems to me exaggerated. At the outset he assumes the role of protector of the plain reader bewildered by paradoxical utterances of scientific experts ... we are given an \"extraordinary miscellany of absurdities\" collected from\nDirac\n,\nEddington\n,\nPlanck\n,\nBohr\nand\nJeans\n.\nThe criticism that he received seemed only to encourage Dingle to double his efforts in putting his ideas across. He published\nThe Special Theory of Relativity\n(1940)\nwhich was reviewed by\nGerald James Whitrow\nwho writes\n[\n54\n]\n:-\nDingle seems to have missed the main point of the theory, which is that classical kinematics needs to be replaced by a new kinematics rigorously derived from precise concepts of length and time. It is not sufficient merely to tinker with our ordinary intuitive ideas. Because he appreciated this vital epistemological point,\nEinstein\nwas the first to grasp the inner meaning of the\nLorentz\nformulae and thereby to make a fundamental advance. It would seem that Dingle is still living in the afterglow of pre-\nEinstein\nphysics, for his methods are intrinsically of a similar type to those of\nFitzGerald\nand\nLorentz\n.\nDuring the Second World War, Dingle was in charge of the Physics Department at Imperial, in the absence of Sir George Thompson. After the war, he became Professor and Head of the Department of History and Philosophy of Science at University College London, a position he held from\n1946\nto\n1955\n. He was elected President of the\nRoyal Astronomical Society\nin\n1951\n. This was a surprise for him, since he was no longer active in spectroscopy and astrophysics. He previously had been Chairman of the Library Committee for several years, as well as Secretary from\n1929\nto\n1933\n. In\n1953\n, he used his presidential address to criticise the view of some theoretical cosmologists.\nHe also became President of Commission\n41\n(\nHistory of Astronomy\n)\nat the\nInternational Astronomical Union\nand a Vice-President of the International Union for the History of Science. He was one of the founders of the British Society for the History of Science, which he presided from\n1955\nto\n1957\n. In\n1948\n, he founded the Philosophy of Science Group within it, which later became the British Society for the Philosophy of Science. He was also the founder of the\nBritish Journal for the Philosophy of Science\n(1950)\n. Nineteen of Dingle's essays on the history and philosophy of science were published in\n1952\nunder the title\nThe Scientific Adventure\n. Here is an extract from the book:-\nIt is a common complaint among the educated, but not professionally scientific, public that the physics of this century has become absurd.... It is worth an effort to see why physics, which in fact has never become irrational, can appear as though it had. I believe the root cause is that in this century a change has come over the metaphysics that underlies the physicist's practice and that he is largely unconscious of this fact. The change I speak of is from a view that regards physics as a study of the nature of an external world to a view that regards it as an attempt to find rational relations between the elements of our experience. The older physicist believed in Nature and thought of himself as making experiments to see what She was like. She was there whether he could observe her or not. But the modern physicist thinks first of all of what he observes in his experiments and is not interested in anything that he cannot possibly observe. He looks for relations between his observations and ignores everything else. But he still expresses his results as though they were discoveries of the essence of Nature, because he is so used to this way of speaking that he does not realise that his discoveries no longer conform to it. When they are expressed as the characteristics of a world existing outside us and independently of us, which causes our experience by its impact on our sense organs, these discoveries require such a world to have contradictory properties. Hence, by retaining this form of expression, the physicist finds himself presenting his perfectly rational achievements as though they were nonsensical.\nThis book certainly made interesting reading and led to many reviews. We list extracts for fourteen of these reviews at\nTHIS LINK\n.\nThroughout his life, Dingle held a great appreciation for English literature. As a result, his writing was literary in style and he was able to clearly explain his position, as well as criticise those he disagreed with. He wrote some books on literature, mainly\nScience and Literary Criticism\n(1949)\nand\nThe Mind of Emily Brontë\n(1974)\n.\nHe dedicated his last twenty years to a controversial campaign against the validity of special relativity. In particular he pointed out what he believed were problems behind the clock\n(\nor twins\n)\nparadox. The paradox states that if two clocks, say A and B, start with the same time and one of the two travels at a high speed before returning, a difference between the times marked by the two clocks appears. However, according to Dingle\n[\n1\n]\n:-\nThe question therefore arises: how does one determine, consistently with the theory, which clock works the more slowly? Unless this question is answerable, the theory unavoidably requires that A works more slowly than B and B more slowly than A - which it requires no super-intelligence to see is impossible.\nHis discussion with\nW H McCrea\nin the correspondence columns of\nNature\ncreated controversy and sparked interest in the paradox. Nevertheless, Dingle, not satisfied with the discussion, wrote\nScience at the Crossroads\n(1972)\n, where he reinstated his questions about the paradox, considering they had been avoided by critics.\nWhitrow\nexplains in Dingle's obituary\n[\n53\n]\nthat these difficulties can be resolved by rejecting Dingle's assumption that the 'rates' of the clocks are invariant, which is equivalent to adopting\nNewton\n's concept of universal time\n(\nsomething incompatible with special relativity\n)\n.\nWhitrow\nalso writes in his review of\nScience at the Crossroads\n[\n55\n]\n:-\nTwo experts in relativity who cannot be accused of failing to consider Dingle's argument are Professor\nJ L Synge\nand, as already mentioned, Professor\nMcCrea\n. After a lengthy correspondence,\nSynge\nconcluded that the contradiction described by Dingle is due to the incompatibility of special relativity with \"the concept of clocks that run regularly, as understood by Professor Dingle\".\nMcCrea\n's rejection of Dingle's argument was based, inter alia, on his contention that Dingle had invoked the notion of distant simultaneity which is illegitimate in special relativity.\nIn\n1972\na paper in Volume\n177\nof Science reported on an experimental verification of the twin paradox:-\nFour cesium beam clocks flown around the world on commercial flights during October\n1971\n, once eastward and once westward, recorded directionally dependent time differences which are in good agreement with predictions of conventional relativity theory. Relative to the atomic time scale of the U.S. Naval Observatory, the flying clocks lost\n59\n±\n10\n59 ± 10\n5\n9\n±\n1\n0\nnanoseconds during the eastward trip and gained\n273\n±\n7\n273 ± 7\n2\n7\n3\n±\n7\nnanoseconds during the westward trip, where the errors are corresponding standard deviations. These results provide an unambiguous empirical resolution of the famous clock \"paradox\" with macroscopic clocks.\nNow it is important to make the point that there remains controversy on points raised by Dingle. For example Harry H Ricker III argues \"Herbert Dingle was correct!\", see\n[\n43\n]\n,\n[\n44\n]\nand\n[\n45\n]\n.\nW A Smeaton writes\n[\n48\n]\n:-\nAs well as being a writer with a fine command of English, he was a brilliant lecturer and a witty conversationalist. I shall never forget that I was instructed, entertained, occasionally irritated, and frequently inspired by Herbert Dingle, at first as an undergraduate at Imperial College and later as a postgraduate student and as a friend.\nG J Whitrow\nwrites\n[\n53\n]\n:-\nAll his writings were graced by a clear and beautiful literary style and like his conversation often revealed a rapier-like wit. Despite his reputation for polemics, he was a kind and friendly man. Both he and his wife, who died in\n1947\n, generously assisted refugees from Europe in the nineteen-thirties.\nDingle died in Hull, at\n88\nyears of age.",
  "matematicos_citados_na_biografia": [
    "Royal Astronomical Society",
    "Albert Einstein",
    "THIS LINK",
    "Milne",
    "Eddington",
    "Dirac",
    "Newton",
    "McCrea",
    "Arthur Eddington",
    "Planck",
    "Bohr",
    "Jeans",
    "Gerald James Whitrow",
    "Einstein",
    "Lorentz",
    "FitzGerald",
    "International Astronomical Union",
    "W H McCrea",
    "Whitrow",
    "J L Synge",
    "Synge",
    "G J Whitrow"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}