{
  "nome_completo": "Herman Heine Goldstine",
  "nome_curto": "Herman Goldstine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Goldstine/",
  "data_nascimento": "13 September 1913",
  "local_nascimento": "Chicago, Illinois, USA",
  "data_morte": "16 June 2004",
  "local_morte": "Bryn Mawr, Pennsylvania, USA",
  "summary": "Herman Goldstine was an American mathematician and computer scientist who  helped to develop ENIAC, an early electronic digital computer.",
  "biografia": "Herman Goldstine\nwas brought up in Chicago where his father was a lawyer. He studied at the University of Chicago where he was awarded a bachelor's degree in mathematics in\n1933\n, graduating Phi Beta Kappa. He remained in Chicago studying for a Master's degree which he received in the following year, then was awarded a doctorate in\n1936\nfor his thesis\nConditions for Minimum of a Functional\n. His thesis advisor had been Lawrence Graves and he had also been taught by William Reid. Appointed an assistant to\nGilbert Bliss\nat Chicago in\n1936\nworking with him on the calculus of variations for three years before moving to the University of Michigan in\n1939\nas an Instructor. In\n1941\nhe married Adele Katz who was an ENIAC\n(\nElectronic Numerical Integrator And Computer\n)\nprogrammer; they had a daughter Madlen and a son Jonathan.\nThe first publication of Goldstine's was\nMinimum problems in the functional calculus\nwhich was based on results in his thesis. Lawrence Graves, his thesis advisor, writes that Goldstine first gives:-\n... necessary conditions and sufficient conditions, in terms of the first and second differentials, that a real-valued function defined on an open set in a normed linear space should have a minimum. Most of the paper is taken up with the more difficult problem of determining such conditions when the class of admissible points is\n(1940)\nrequired to satisfy an equation of an abstract functional character. Various hypotheses are described under which a multiplier rule can be obtained. Sufficient conditions for a minimum are also given.\nThere followed\nA generalized Pell equation. I\n(1940)\n, written jointly with R P McKeon, and\nLinear functionals and integrals in abstract spaces\n(1942)\nin which he shows that the\nDaniell\nintegral and the integral similarly defined by\nBanach\nin his addendum to\nSaks\n's \"Theory of the Integral\" are\nLebesgue\nintegrals with respect to regular\nCarathéodory\nouter measures. In\n1942\nhe published two papers,\nThe modular space determined by a positive function\n(\nwith R W Barnard\n)\nand\nThe calculus of variations in abstract spaces\n.\nThe United States entered World War II following the Japanese attack on the American fleet at Pearl Harbour on\n7\nDecember\n1941\n. Goldstine joined the US army and in July\n1942\n, with the rank of lieutenant, he was posted to the Ballistics Research Laboratory at the Aberdeen Proving Ground, Maryland. In\n[\n2\n]\nRalph Gomory explains how this came about:-\nBliss\nhad been one of a group, organized by the Princeton mathematician\nOswald Veblen\n, that had worked on ordnance problems for the army during World War I. Bliss had made significant contributions to the theory of ballistics. When Herman was called into the army in July of\n1942\n,\nBliss\nwrote to\nVeblen\n.\nVeblen\nhad returned to the army as the chief scientist of the Army Ballistics Research Laboratory in Aberdeen, Maryland.\nBliss\nsuggested to\nVeblen\nthat he should get Herman assigned to the Ballistics Research Laboratory.\nHowever, this led to a degree of confusion. Goldstine was already in the army at Stockton, California, when he received two sets of orders. One set of orders instructed him to proceed to the Far East, while the second set instructed him to report to the Research Laboratory in Aberdeen, Maryland. He spoke to his commanding officer explaining that he had two sets of conflicting orders. The commanding officer asked him which he would prefer and, after being told that he would rather go to the Ballistics Research Laboratory he was told to drive there as quickly as possible and sort out the mess from Aberdeen. This is exactly what Goldstine did and, as Gomory writes\n[\n2\n]\n:-\nIt was of course a decision with momentous consequences for the early history of the computer.\nResearch at the Moore School of Electrical Engineering at the University of Pennsylvania was being carried out using early forms of computers. In particular the School used a Bush analyser, designed by Vannevar Bush, specifically to integrate systems of ordinary differential equations. However\nJohn Mauchly\nand\nJ Presper Eckert\nJr at the Moore School had ideas about how a better computer might be built. The main task of the Ballistics Research Laboratory was to produce firing tables which could be used by to direct guns to hit precise targets several miles away. The calculations were tedious and were carried out in Aberdeen by around one hundred women. The Ballistics Research Laboratory were certainly aware of the potential impact that computers would have on this work and they began using the computing facilities at the Moore School of Electrical Engineering. Goldstine was given the task of liaising with the mathematicians at the Moore School. After\nMauchly\nwrote a report towards the end of\n1942\ndetailing the ideas for a better computer that he had been working on with\nEckert\n, Goldstine quickly saw the potential in what was being proposed.\nVarious committees then considered the proposal before money could be assigned to the project of building the computer, and in April\n1943\nGoldstine persuaded\nVeblen\n, who was the chief scientist at the Ballistics Research Laboratory in Aberdeen, to approve the idea. The army allocated  $\n500\n,\n000\nto pay for the research on the ENIAC project. The massive computer weighing\n30\ntons was completed by February\n1946\n. In that year Herman and his wife Adele published the joint paper\nThe electronic numerical integrator and computer\n(\nENIAC\n)\n. L J Comrie clearly understood the significance of ENIAC when he reviewed the paper. Here is a short extract from the review:-\nThis is the first technical description of the first electronic calculator. The machine was developed at the Moore School of Electrical Engineering at Philadelphia for the Ballistic Research Laboratory of the Army Ordnance Department at Aberdeen, Maryland, where it is now located. The discarding of moving parts and the use of electronic circuits has, almost overnight as it were, speeded up certain calculations by a factor that handsomely exceeds\n1000\n. ... The importance of this pioneer effort cannot be overestimated. It has ushered in a new era in calculations with discrete numbers and has not only swept away the bottleneck of many existing and known forms of computation, but has also opened up new vistas of numerical thought by providing the means of doing what has never yet been attempted because of prohibitive time and cost.\nGoldstine had been promoted from Instructor to Assistant Professor at the University of Michigan in\n1942\nand continued to hold this post while undertaking army work at the Ballistics Research Laboratory in Maryland. In\n1946\n, with World War II over, Goldstine left the army and returned to his university position. However, a chance meeting with\nvon Neumann\non a railway platform in Aberdeen, Maryland, in the summer of\n1944\nproved highly significant to his future career. Goldstine started to tell\nvon Neumann\nabout the computing project he was working, in particular that ENIAC could carry out\n333\nmultiplications per second, and then\n[\n3\n]\n:-\n... the whole atmosphere of our conversation changed from one of relaxed good humour to one more like the oral examination for the doctor's degree in mathematics\nA project to produce an improved computer began with Goldstine,\nvon Neumann\n,\nMauchly\nand\nEckert\nall involved. However\nMauchly\nand\nEckert\nleft the Moore School in October\n1946\nand started up the Electronic Control Company which received an order from Northrop Aircraft Company to build the Binary Automatic Computer\n(\nBINAC\n)\n. Goldstine was appointed Associate Project Director of the Electronic Computer Project at the Institute for Advanced Study, Princeton University, and with\nvon Neumann\nworked on their own ideas for a new computer. They produced a series of reports on the EDVAC\n(\nElectronic Differential Variable Computer\n)\nwhich changed the whole concept of computers. There was\nPreliminary Discussion of the Logical Design of an Electronic Computing Instrument\n(1947)\nby Arthur Bucks,\nJohn von Neumann\nand Herman Goldstine.\nRichard Hamming\nbegins a review:-\nThis report gives a preliminary discussion of a high-speed electronic digital computing machine. The machine is to make full use of the flexible and compact coding of problems which is possible when orders as well as numbers are stored in the high speed memory and can be operated on and modified according to the progress of the computation.\nIn the same year Goldstine and\nvon Neumann\npublished\nPlanning and Coding of Problems for an Electronic Computing Instrument\nwhich discusses the general philosophy of coding problems for a large scale digital computers, then the same two authors published\nNumerical inverting of matrices of high order\n, again in\n1947\n. In the last mentioned paper they state that they:-\n... wish to determine the precision and stability of a\n(\nlong\n)\ncomputation with respect to the round off errors.\nIn\n1948\nthey continued to produce further reports on their plans writing in one:-\nWe wish to develop here methods that will permit us to use the coded sequence of a problem, when that problem occurs as part of a more complicated one, as a single entity, as a whole, and avoid the need for recoding it each time when it occurs as a part in a new context, i.e., in a new problem. The importance of being able to do this is very great. It is likely to have a decisive influence on the ease and the efficiency with which a computing automat of the type that we contemplate will be operable.... We envisage that a properly organized automatic, high speed establishment will include an extensive collection of such subroutines, of lengths ranging from about\n15\n-\n20\nwords upwards.\nGoldstine and\nvon Neumann\nalso produced papers using computation to attack mathematical question, such as their application to number theory in\nA numerical study of a conjecture of Kummer\n(1953)\n. Goldstine's applications of computing was to a wide variety of problems, for example he published\nCalculation of plane cavity flows past curved obstacles\n(1954)\njointly with\nG Birkhoff\nand E H Zarantonello:-\nThis paper describes the first systematic calculations ever carried out on cavity and jet flows past curved obstacles, comprising altogether fifty symmetric plane flows past convex and concave bodies, under several different conditions of streamline detachment. The computations were performed on a high speed digital computer ...\nIn\n1955\na joint work by Goldstine and\nvon Neumann\nBlast wave calculation\nwas published as well as\nOn the stability of two superposed compressible fluids\nwhich was joint work by Goldstine and J Gillis.\nGoldstine became Project Director in\n1954\n. His social relations with\nvon Neumann\nare described in\n[\n2\n]\n:-\nMany evenings Johnny\n[\nvon Neumann\n]\nwould entertain. Usually a few of us, maybe my wife and me. We would just sit around, and he might not even sit in the same room. He had a little study that opened off of the living room, and he would just sit in there sometimes. He would listen, and if something interested him, he would interrupt. Otherwise he would work away.\nAfter\nvon Neumann\n's death in\n1957\n, Goldstine left Princeton and in\n1958\nwas appointed research administrator at IBM. He did not undertake research solely on computers and their applications, however, for he published a series of three papers on\nHilbert space with non-associative scalars\n(1962\n,\n1964\n,\n1966)\n. Goldstine's wife Adele died in\n1964\nand two years later he married Ellen Watson. He remained working with IBM in a number of leading roles until he retired in\n1984\n. He was appointed director of scientific development for data processing at IBM in\n1965\n, then an IBM Fellow in\n1969\nand also a consultant to the director of research.\nGoldstine wrote a number of outstanding books. These include\nThe computer from Pascal to von Neumann\n(1972)\n, and\nA history of numerical analysis from the\n16\nth through the\n19\nth century\n(1977)\n, described as:-\n... a definitive text which is a must for the library of any serious numerical analyst.\nA history of the calculus of variations from the\n17\nth through the\n19\nth century\nwas published in\n1980\n. L G Chambers wrote that:-\n... this book is a substantial piece of mathematical scholarship. The exposition is good and the author has clarified the argument of, and has indicated the connection between, many of the fundamental works to which he refers with the result that the book gives a better understanding of the calculus of variations than do many modern texts. ... the book deserves the highest recommendation.\nGoldstine received many honours for his outstanding contributions to the development of the computer and its applications to mathematics. For example he received the Harry H Goode Memorial Award in\n1979\n, and the National Medal of Science in\n1983\nfrom President Ronald Regan for:-\n... fundamental contributions to development of the digital computer, computer programming and numerical analysis.\nHe was admitted to the Hall of Fame of the Army Ordnance Department in\n1997\nand also received the IEEE Pioneer Award. He was elected to the\nNational Academy of Science\n, the\nAmerican Academy of Arts and Sciences\n, and the American Philosophical Society. This last mentioned Society appointed him their Executive Director after he retired from IBM in\n1984\n, a position he held until\n1997\n. On\n27\nMay\n1998\nIBM Research announced that it was to honour:-\n... Dr Herman H Goldstine by renaming a major postdoctoral fellowship for the mathematician.\nHe died in his home of Parkinson's disease at the age of\n90\n.",
  "matematicos_citados_na_biografia": [
    "Gilbert Bliss",
    "Daniell",
    "Banach",
    "Saks",
    "Lebesgue",
    "Carathéodory",
    "Bliss",
    "Oswald Veblen",
    "Veblen",
    "John Mauchly",
    "J Presper Eckert",
    "Mauchly",
    "Eckert",
    "von Neumann",
    "John von Neumann",
    "Richard Hamming",
    "G Birkhoff",
    "National Academy of Science",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}