{
  "nome_completo": "Hidegorô Nakano",
  "nome_curto": "Hidegorô Nakano",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nakano/",
  "data_nascimento": "16 May 1909",
  "local_nascimento": "Tokyo, Japan",
  "data_morte": "11 March 1974",
  "local_morte": "Detroit, Michigan, USA",
  "summary": "Hidegorô Nakano was a Japanese mathematician who is remembered today for Nakano spaces, and for his results on vector lattices and operator theory in Hilbert spaces.",
  "biografia": "Hidegorô Nakano\n's parents were Katsugoro and Kame Nakano. Katsugoro Nakano's ancestors had a lacquerware business making ornamental parts for swords. Katsugoro had been brought up to enter the family business and to eventually take charge of it but when the market for such things became less he moved into the business of painting commercial signs. Katsugoro and Kame Nakano had four children, two boys and two girls; Hidegorô was the eldest of the boys.\nHidegorô attended schools in Tokyo, completing his secondary education at a middle school. He then entered the National First High School which was a prestigious preparatory school first founded in\n1874\nas the Tokyo School of English. Later, in\n1886\n, it moved to the Hongo district of Tokyo. Entrance to the school was very competitive and graduates were almost assured entry into Tokyo Imperial University. The level of education at this school was roughly that of the first two years of a modern UK university. Nakano then entered the Imperial University of Tokyo where he studied mathematics. He was advised by Takuji Yoshie\n(1874\n-\n1947)\nwho had been a student of Lazarus Fuchs, obtaining his doctorate in\n1899\nwith a thesis on differential equations. Nakano graduated from the Imperial University of Tokyo in March\n1933\nwith a Bachelor of Science degree and he continued studying at the Graduate School for his doctorate.\nNakano entered Graduate School on\n1\nApril\n1933\nbut at this time he already had six papers published, all written in German:\nÜber die Verteilung der Peanoschen Punkte einer Differentialgleichung\nⓉ\n(\nOn the distribution of Peano's points in a differential equation\n)\nwas communicated by\nTatsujiro Shimizu\nto the Physico-Mathematical Society of Japan on\n30\nOctober\n1931\n;\nÜber den Konvergenzradius der Lösung einer Differentialgleichung\nd\ny\nd\nx\n=\nf\n(\nx\n,\ny\n)\n\\large\\frac{dy}{dx}\\normalsize  = f(x, y)\nd\nx\nd\ny\n​\n=\nf\n(\nx\n,\ny\n)\nⓉ\n(\nOn the radius of convergence of the solution of a differential equation dy/dx = f\n(\nx, y\n)\n)\nwas communicated by Takuji Yoshie to the Imperial Academy of Japan on\n12\nFebruary\n1932\n;\nÜber den Konvergenzradius der Lösungen eines Differentialgleichungssystems\nⓉ\n(\nOn the radius of convergence of the solutions of a system of differential equations\n)\nwas communicated by Takuji Yoshie to the Imperial Academy of Japan on\n12\nApril\n1932\n,\nÜber den Konvergenzbereich einer zweifachen Potenzreihe und seine Anwendungen\nⓉ\n(\nOn the convergence domain of a double power series and Its applications\n)\nwas submitted to the\nJapanese Journal of Mathematics\non\n13\nMay\n1932\n;\nÜber eine stetige Matrixfunktion\nⓉ\n(\nOn a continuous matrix function\n)\nwas communicated by\nTeiji Takagi\nto the Imperial Academy of Japan on\n13\nJune\n1932\n. Nakano's remaining\n1932\npaper was communicated by Takuji Yoshie to the\nImperial Academy of Japan\non\n12\nOctober\n1932\n.\nHaving six papers in print before entering graduate school, Nakano submitted a thesis for his doctorate the day he entered on\n1\nApril\n1933\n. This was even more remarkable than it might at first appear since at that time doctorates in Japan were normally awarded to those over\n50\nyears old.\nKentaro Yano\n, explained the circumstances in\n[\n3\n]\n:-\nOn the day that Hidegorô Nakano became a research student, he went to his supervisor's office and applied for doctor degree by presenting his thesis which was already completed. Let me explain now the situation at that time. It was, of course, true that the doctorate was awarded only after a thesis had been submitted, examined and approved. But at that time it was common that a person was allowed to present their thesis only after they had been doing research for about\n20\nor\n30\nyears and had reached a suitable age. But Nakano had just graduated from the university, and presented his thesis for a doctorate on the same day that he entered graduate school. This also astonished his supervisor, Professor Takuji Yoshie. After a while Nakano told me why he did so. The reason was that there was no age limit for presenting a doctoral thesis and, according to the regulations, there was no examination fee charged if a person was a student in the graduate school. But of course this was indeed a special case. Therefore, Professor Takuji Yoshie examined Nakano's thesis very carefully. He arrived at the conclusion that the author of the thesis was well qualified to be awarded the title of doctor. In\n1936\n, Nakano was awarded doctor of science degree three years after submitting. At that year, he was\n27\nyears old. This\n27\nyear old doctor of science was reported many times in newspapers. The reason was that the people who got a doctorate were normally at least over\n50\nyears of age at that time.\nNakano undertook research at the Graduate School until\n29\nApril\n1935\n, when he became a professor at the National First High School. On\n24\nOctober\n1935\n, Nakano married Sumiko Yamamura\n(11\nDecember\n1913\n, Tokyo -\n5\nMarch\n1999\n, Detroit\n)\n. Sumiko was the daughter of Toyonari Yamamura and Akiko Maeda. Hidegorô and Sumiko Nakano had two children both born in Tokyo: a daughter Kazumi Nakano\n(\nborn\n21\nJune\n1937)\nand a son Hideaki Nakano\n(\nborn\n7\nApril\n1943)\n. He left the position at the National First High School in April\n1938\nand undertook research at home until he was appointed as a research assistant at the Imperial University of Tokyo on\n30\nSeptember\n1939\n. On\n31\nMarch\n1940\nhe was made an Instructor, a position he held for two years. It was during this period that Japan entered World War II, signing a pact with Germany and Italy on\n27\nSeptember\n1940\n, but hostilities did not begin until Japan attacked the United States fleet in Pearl Harbor on\n7\nDecember\n1941\n. At first the war had little effect on those living in Japan and life continued much as normal. Nakano was promoted to assistant professor on\n15\nApril\n1942\n.\nFrom June\n1944\nJapan became the target of air raids, initially on military targets. However in February\n1945\nTokyo became the target of firebombing raids and quickly the Imperial University of Tokyo was closed with students and staff being evacuated. Kazumi Nakano, Hidegorô Nakano's daughter, wrote in a letter of\n18\nOctober\n2010\nabout how her father helped students during the last year of World War II\n(\nsee\n[\n2\n]\n)\n:-\nNakano was helping with food for students, but this is difficult to understand without knowing the situation during April\n1945\nthrough March\n1946\n(\nthe last year of the World War II\n)\n. All educational institutions in Tokyo\n(\nkindergarten through university\n)\nwere closed at the end of March\n1945\nand evacuated to safer regions. The Department of Mathematics of the Imperial University at Tokyo was evacuated to a local public school in the village of Osachi in the Suwa region of Nagano prefecture. Shortage of food was everywhere. Nakano often led his students on a hike hunting for food in neighbouring villages. In those cold mountain areas of poor soil a sack potatoes would be a harvest of the day. His wife invited the students to the temple where the Nakano family maintained a temporary residence and fed hungry students.\nNakano's first book was\nFrom Riemann integral to Lebesgue integral\n(\nJapanese\n)\npublished in\n1940\n. Next came\nAllgemeine Spektraltheorie:\n1940\n-\n41\n, a collection of his papers written in German followed by three books in Japanese,\nHilbert Space Theory\n(1946)\n,\nClassical Integration Theory\n(1949)\n, and\nMeasure Theory\n(1950)\n. He then published four books written in English:\nModern Spectral Theory\n(1950)\n;\nModulared Semi-Ordered Linear Spaces\n(1950)\n;\nTopology and Linear Topological Spaces\n(1951)\n; and\nSpectral Theory in the Hilbert Space\n(1953)\n.\nMore information about these English books can be seen at\nTHIS LINK\n.\nBy the time that\nSpectral Theory in the Hilbert Space\nwas published, Nakano had left Tokyo and moved to Sapporo to take up a professorship at Hokkaido University. He took up this new position on\n1\nApril\n1952\n. Kazumi Nakano, Hidegorô Nakano's daughter, writes:-\nIn the old education system of Japan prior to the end of World War II, graduate studies in Mathematics involved very little work of scheduled classroom lectures. Seminars were dominant. Much of the\n3\n-year curricula for undergraduate mathematics majors was similar. Admission to the graduate programme was more like doctoral candidacy today. Regular members of Nakano's seminars, undergraduate as well as graduate, called themselves Nakano's students.  Nakano moved to Hokkaido University from Tokyo University in\n1952\n. Both universities were part of the system of the seven Imperial Universities, i.e., the only universities established and funded entirely by the central government of Japan. An appointment to a position from another institution of the system was regarded as transfer at the discretion of the president of an accepting institution. Nakano's appointment at Hokkaido University was thus a move from Tokyo to Hokkaido.\nKazumi Nakano also wrote about Hidegorô Nakano's seminar at Hokkaido University:-\nThe Nakano Seminar existed from\n1951\nto\n1959\nwhile Hidegorô Nakano was an active faculty member of the Department of Mathematics at Hokkaido University. It was a group of graduate students engaged in research under Nakano's leadership. The group held a weekly seminar in the room next to his office on the third floor of Science Building where the Department of Mathematics was located. Doctoral degrees were conferred on most of them but some left the university without completing the degree requirements.\nIn\n1960\nhe went to Queen's University in Canada for a year to work with Israel Halperin\n(1911\n-\n2007)\n. Halperin had been a student of\nJohn von Neumann\nand spent most of his career at Queen's University. He had severe problems in the\n1940\ns when arrested and accused of espionage but after a trial in\n1947\nhe was cleared of all charges. Before this visit, Halperin and Nakano had written two joint papers,\nDiscrete semi-ordered linear spaces\n(1951)\nand\nGeneralized\nl\np\nl^{p}\nl\np\nspaces and the Schur property\n(1953)\n. Nakano wrote in April\n1960\n:-\nI am going to Canada, being invited by\nCanadian Mathematical Congress\n. I am scheduled to leave Sapporo\n26\nMay, and to arrive at Vancouver\n23\nJune. I shall stay in Kingston for about a year.\nFrom February\n1961\nto March\n1974\nNakano was a professor of mathematics at Wayne State University, Detroit, USA. In\n1962\nhe attended the International Congress of Mathematicians in held in Stockholm, Sweden, from\n15\nAugust to\n22\nAugust\n1962\n. He returned to the United States flying via London to New York arriving on\n2\nSeptember\n1962\n. He gives the address to which he is going as Wayne State University, Detroit\n2\n, Michigan and his permanent address as No\n393\n,\n4\n-chome, Ninami-chinagawa, Chinagawa-ku, Tokyo. Nakano's two children came to the United States to join their parents in\n1962\n.\nAt Wayne State University, Nakano supervised the studies of eight students for a Ph.D. He continued to work there until\n1973\nwhen he was taken ill. His daughter Kazumi Nakano wrote:-\nHidegorô Nakano was suddenly hospitalised in Detroit on\n27\nAugust\n1973\n, for a surgery of colon cancer. He experienced a series of complications after the surgery and continued to stay in the same hospital until he died on\n11\nMarch\n1974\n.\nFrom the late\n1960\ns Nakano became interested in set theory and attempted to produce a different version of the theory from the classical axiomatic approach. He tried to publish a book giving his approach to set theory but was unable to get it published. He resorted to giving lectures at meetings of the\nAmerican Mathematical Society\nand the abstracts of these were published. For example\nMathematical set theory\n(1966)\n,\nOn the continuum problem\n(1967)\n,\nOn the existence of regular initial numbers\n(1968)\n,\nCritical numbers\n(1968)\n,\nElimination of the paradoxes in the set theory\n(1969)\n,\nAn axiomatic set theory\n(1969)\n, P\nointless axiomatic set theory\n(1969)\n, and\nThe Russell's paradox in set spaces\n(\nAxiomatic set theory is not set theory\n)\n(1969)\n. Nakano explained in\n1969\n:-\nI wrote a book, 'Set Theory', and submitted it to the\nAmerican Mathematical Society\nto have it published in the Colloquium Series. However, it was rejected because of unfavourable reports from two referees. I also submitted it to many publishers, but all of them rejected it because it was original. Some publishers said that this book should be published in a Journal. These circumstances made me decide to give publicity to the important results obtained in this book piece by piece at Meetings of the\nAmerican Mathematical Society\n.\nKentaro Yano\nwrote\n[4]\n:-\nOnly the genius, like Nakano, has such a great courage to dare challenge such a theory. He made such a challenge to the famous Set Theory, and wrote a manuscript with title \"Set Theory\" in English. But when he presented it to the Society for publication, it was rejected by saying that as it was not a paper but a monograph. He was advised to find a publishing company for its publication. When he brought it, however, to a publishing company, it was rejected again by saying that this was not a book but a paper to be published in a journal. Back and forth, such that, it took a long time for his creative work to be published. In\n1974\n, he passed away in Detroit. In\n1978\n, after\n4\n-years later, this book was finally published under the efforts of his pupils and followers. In the last paragraph of preface, Nakano wrote \"I had been wondering about the existence of spaces which are neither finite or infinite. During the Christmas season of\n1965\n, I got an idea of mathematical set theory and I was able to give a solution not only to this problem but also to the general continuum problem. This was truly a gift from God.\"\nAlthough it is claimed Nakano's\nSet Theory\nbook was published in\n1978\n, we have not been able to find any trace of this book.\nPaul Halmos\n[\n1\n]\nwrote:-\nThe first thing I learned about Nakano was his work on what is called the multiplicity theory of normal operators; that was something that had a great deal of interest for me once, and in my study of the subject I followed in the footsteps of Nakano\n(\namong others\n)\n. Toward the end of his life he became interested in the foundations of set theory and distributed many preprints on that subject, but the professionals seemed to regard his approach with impatient suspicion.\nLet us end with saying a little about Kazumi Nakano, Hidegorô Nakano's daughter. She was educated in Japan, studying at Fuji-Gakuen High School\n(\ngraduated March\n1956)\n, Hokkaido University\n(\ngraduated with a B.S. in March\n1960)\n, and then the Graduate School of Hokkaido University\n(\ngraduated with an M.S. in March\n1962)\n. After the award of her Master's Degree, she came to the United States in\n1962\nand studied for a doctorate in mathematics at Wayne State University. She was advised by Bertram J Eisenstadt\n(1923\n-\n2003)\nand was awarded a Ph.D. for her thesis\nUniformity and real Valued Functions\n(1967)\n. She worked at Wayne State University, was a member of the\nAmerican Mathematical Society\nfor\n51\nyears, and died in Brockport, New York, USA on\n4\nFebruary\n2017\n.",
  "matematicos_citados_na_biografia": [
    "Tatsujiro Shimizu",
    "Teiji Takagi",
    "Imperial Academy of Japan",
    "Kentaro Yano",
    "THIS LINK",
    "John von Neumann",
    "Canadian Mathematical Congress",
    "American Mathematical Society",
    "Paul Halmos"
  ],
  "imagens": [
    "nakano.jpg"
  ]
}