{
  "nome_completo": "Howard Percy Robertson",
  "nome_curto": "Howard Percy Robertson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robertson/",
  "data_nascimento": "27 January 1903",
  "local_nascimento": "Hoquiam, Washington, USA",
  "data_morte": "26 August 1961",
  "local_morte": "Pasadena, California, USA",
  "summary": "Bob Robertson was an American mathematician who made important contributions to Differential Geometry and Relativity.",
  "biografia": "Howard Percy Robertson\nwas known to his friends and colleagues as Bob. His parents were George Duncan Robertson and Anna McLeod. Both George and Anna were Americans of Scottish descent with typically Scottish names. George Robertson's family came from Maryland and he was an engineer who built bridges in the Washington area. Anna had attended Johns Hopkins and then become a nurse. Bob was the eldest of his parents five children so when his father died in\n1918\nhe had to help his mother support the family. His mother became the local postmistress and also became involved in local politics.\nBob entered the University of Washington in\n1918\n. At this time he lived in the small town of Monteseno and he had to earn money during his undergraduate years which meant that he was unable to participate in the usual undergraduate university life. Originally he set out on an engineering course but he changed to major in pure mathematics for the later part of his degree. He was awarded a bachelor's degree in\n1922\nand then, one year later, he was awarded a master's degree. In the year he graduated with an M.Sc., Robertson married Angela Turinsky. She had been born in Budapest and was the daughter of an Austro-Hungarian army officer. Angela's father settled in the United States, becoming a landscape artist in Idaho. Bob and Angela met at the University of Washington where Angela was studing philosophy and psychology. At the University of Washington Robertson was greatly influenced by\nE T Bell\n. It was\nBell\nwho strongly encouraged Robertson to move to the California Institute of Technology to undertake research for his doctorate.\nRobertson was awarded his doctorate from the California Institute of Technology in\n1925\nafter submitting his dissertation\nOn the Dynamical Space-Time which Contains a Conformal Euclidean\n3\n-Space\n. His thesis advisor had been Harry\nBateman\n. He was awarded a National Research Council Fellowship in mathematics to study in Germany where he spent the two years\n1925\n-\n27\n. Most of the time he spent at Göttingen but six months was spent at Munich. This was an important time for Robertson who met\nHilbert\n,\nCourant\n,\nSchwarzschild\n,\nvon Neumann\n,\nWigner\n,\nSchrödinger\n,\nHeisenberg\nand\nEinstein\n. After two years in Germany he returned to the California Institute of Technology in\n1927\nwhere he was appointed assistant professor of mathematics. After two years Robertson was appointed assistant professor at Princeton. He spent eighteen years at Princeton where he was promoted to associate professor and then full professor. At Princeton he worked in both the mathematics department and the physics department. It was during his time at Princeton that Bob and Angela Robertson's two children were born; Duncan Robertson who went on to become a surgeon in Arizona, and Marietta who married Peter Fay an historian at Caltech.\nBefore discussing Robertson's important contributions to applied mathematics we will discuss a second side of his career which began in\n1939\nwhen World War II started. Although at this stage the United States was not involved in the war, nevertheless Robertson became a member of a group which was to become part of the National Defense Research Committee. They began to study the effectiveness of explosives and the mathematical theory of explosion damage. After the fall of France in May\n1940\n, Robertson was given the position of liaison scientist with Britain. Over the next years he spent time in both Britain and the United States, then in\n1943\nhe moved to Britain on a semi-permanent basis. In\n1944\nhe was put in charge of a group which were assigned the task of studying German scientific technology. He remained in Europe until the middle of\n1946\nwhen he returned to Princeton. He was awarded the Medal of Merit in\n1946\nfor his contributions to the war effort. However his duties did not end at this point. He was Director of the Weapons System Evaluation Group from\n1950\nto\n1952\n, then from\n1954\nto\n1956\nhe was back in Europe as Scientific Advisor to the NATO Commander. After Robertson's death the Supreme Allied Commander in Europe wrote:-\nDr Robertson had a remarkable ability for getting to the crux of a problem and presenting his conclusions in such a manner that all could understand and appreciate them. He inspired the utmost confidence in all those who were privileged to work with him, and after his departure we frequently had occasion to call for his advice and assistance which was always forthcoming, frequently at great personal inconvenience and sacrifice.\nGiven our description of Robertson's activities from\n1939\nonward it is hard to see how he had time to make a contribution to applied mathematics. However he did make outstanding contributions to\ndifferential geometry\n, quantum theory, the theory of general relativity, and cosmology\n[\n4\n]\n:-\n... he was interested in the foundations of physical theories, differential geometry, the theory of continuous groups, and group representations. He was particularly interested in the application of the latter three subjects to physical problems.\nHis contributions to differential geometry came in papers such as:\nThe absolute differential calculus of a non-Pythagorean non-Riemannian space\n(1924)\n;\nTransformation of Einstein space\n(1925)\n;\nDynamical space-times which contain a conformal Euclidean\n3\n-space\n(1927)\n;\nNote on projective coordinates\n(1928)\n;\n(\nwith\nH Weyl\n)\nOn a problem in the theory of groups arising in the foundations of differential geometry\n(1929)\n;\nHypertensors\n(1930)\n; and\nGroups of motion in space admitting absolute parallelism\n(1932)\n.\nWe have included a paper which Robertson wrote with\nWeyl\nin the list above. In fact his association with\nWeyl\nwent much further and in\n1931\nhe published an English translation of the second edition of\nWeyl\n's classic text\nThe theory of groups and quantum mechanics\n. Before we move on to discuss the area for which Robertson is rightly most famed, namely for his work on general relativity and cosmology, we complete the description of his academic career. After he had completed his work in Europe following World War II and returned to Princeton he was approached by the California Institute of Technology with the offer of a professorship. Princeton tried to counter the offer with inducements for him to remain there but Robertson had been very happy at Caltech before and the chance to return greatly appealed to him. He accepted the professorship at Caltech and held this position for the remainder of his career.\nApplying his mathematical skills to cosmology had been an interest of Robertson's from early in his career as the paper\nOn relativistic cosmology\n(1928)\nshows. Around this time he built on\nde Sitter\n's solution of the equations of general relativity in an empty universe and developed what are now called Robertson-\nWalker\nspaces\n[\n2\n]\n:-\nIn\n1928\nand\n1929\nRobertson developed fully the \"postulate of uniformity\" so as to obtain the complete family of line-elements from the theory of continuous groups in Riemannian space. These Robertson-\nWalker\ncosmological spaces are still fundamental;\nA G Walker\nrediscovered them in\n1936\n...\nHe wrote a masterly paper\nRelativistic cosmology\nin\n1933\nwhich summarised his own contributions to the subject up to that time and well as contributions of others. In three papers entitled\nKinematic and world structure\npublished in\n1935\nand\n1936\nRobertson looked at\nMilne\n's theory and\nEinstein\n's theory of gravitation and their respective application to cosmology, arguing strongly that\nMilne\n's objections to\nEinstein\n's theory are not valid. After moving from Princeton to Caltech, Robertson's interests became somewhat more directed towards astronomy. However he continued to develop earlier themes with papers such as\nOn the present state of relativistic cosmology\n(1949)\n.\nThe Poynting-Robertson effect is so named for Robertson's paper\nDynamical effects of radiation in the solar system\nin which he studied the behaviour of a moving body, subject to the laws of general relativity, which is absorbing and re-emitting solar radiation.\nAs a final illustration of Robertson's interest in the connection between geometry and physics we quote A H Taub's review of Robertson's paper\nThe geometries of the thermal and gravitational fields\nwhich was published in the\nAmerican Mathematical Monthly\nin\n1950\n:-\nThe author's purpose is to give \"a study of the physical geometry of the gravitational and of the thermal fields, and of the reasons for the success of the former as opposed to the latter, as a basis for a tenable physical theory.\" The discussion of gravitation is given in terms of a four-dimensional scalar theory but the main ideas of\nEinstein\n's general theory are stressed. The results of this theory regarding the motion of test particles and the behaviour of light rays are stated and compared to that of\nEinstein\n's theory and differ from that theory. However the author's purpose is not to give a physical theory of gravitation, but to discuss the geometry of a theory of the gravitational field. He also discusses the geometry of the thermal field in terms of measurements made by rods after they have been allowed to come into thermal equilibrium with a heated medium. It is shown that in the latter case the geometry depends on the material composing the measuring rods whereas in the gravitational case the geometry is universal because of the equivalence between inertial and gravitational mass.\nHe was elected a member of the\nNational Academy of Sciences\nof the United States\n(\nand served as its foreign secretary from\n1958\nuntil his death\n)\nand the\nAmerican Academy of Arts and Sciences\n.\nFinally we quote some comments regarding Robertson's character. After his death a friend wrote to Angela Robertson\n[\n2\n]\n:-\nDistinguished scientist, selfless servant of the national interest, courageous champion of the good and the right, warm human being, he gave richly to us and to all from his great gifts.\nTaub writes in\n[\n4\n]\n:-\nBob will be remembered by many for being a vital person with a quick wit, and for having an enormous appreciation for stories and limericks, some of which he originated. ... Angela and Bob's house was a place where many people found comfort, relaxation and good talk on science and other subjects. One cannot estimate the effect of or the effort involved in arranging for \"informal evenings\". I warrant that many acknowledged and many unacknowledged footnotes are due to Robertson as a result of conversations originating around Angela's kitchen table.\nRobertson died of a heart attack following being injured in a minor car accident.",
  "matematicos_citados_na_biografia": [
    "E T Bell",
    "Bell",
    "Bateman",
    "Hilbert",
    "Courant",
    "Schwarzschild",
    "von Neumann",
    "Wigner",
    "Schrödinger",
    "Heisenberg",
    "Einstein",
    "differential geometry",
    "H Weyl",
    "Weyl",
    "de Sitter",
    "Walker",
    "A G Walker",
    "Milne",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}