{
  "nome_completo": "Ehud Hrushovski",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hrushovski/",
  "data_nascimento": "30 September 1959",
  "local_nascimento": "West Jerusalem, Israel",
  "data_morte": null,
  "local_morte": null,
  "summary": "Ehud Hrushovski is the Merton Professor of Mathematical Logic at Oxford University. He has won many prizes and awards for his remarkable contributions to discrete mathematics and model theory with interaction notably with algebraic geometry, topology and computer sciences.",
  "biografia": "Ehud Hrushovski\nis the son of Benjamin Harshav\n(1928\n-\n2015)\nand Irena Ledderman. Benjamin Harshav was born in Vilna, Poland\n(\nnow Vilnius in Lithuania\n)\non\n26\nJune\n1928\n, the son of a history teacher and a mathematics teacher; he was Jewish. He lived in Vilna until the German army took control of the city in\n1941\nwhen he fled to the Urals and studied mathematics and physics at university in Orenburg. After the end of World War II he went to Łódź and then spent\n1947\n-\n48\nin Munich. He emigrated to Israel in\n1948\nwhere, after fighting in the Arab-Israeli War, he studied Hebrew Literature and Jewish history at the Hebrew University of Jerusalem. He became an eminent\n[\n21\n]\n:-\n... poet, author, teacher, translator, and literary scholar.\nIrena Ledderman, known as Rena, was born on\n27\nMay\n1930\n, the daughter of Rivka Erna Ledderman; she became a psychologist. Ehud Hrushovski was one of Benjamin and Irena's three children.\nBetween\n1954\nand\n1963\n, Benjamin Harshav taught Hebrew literature at the Hebrew University of Jerusalem except for the years\n1957\n-\n60\nwhen he was studying comparative literature at Yale University in the United States. Ehud Hrushovski grew up in West Jerusalem where he attended school. At elementary school, he had mixed feelings about mathematics\n[\n34\n]\n:-\nI was very struck by certain mathematical things. I remember very well learning the proof of commutativity of multiplication, being shown a rectangle divided into small squares. I remember even being sceptical about it, being unsure whether one was counting the corners of the squares, or the actual squares, whether there was a cheat there. And I remember the real line being introduced, and the revelation of some connection between numbers and something drawn. On the whole, though, it was pretty dreary and boring. It was all about learning things by heart. But from time to time, I was struck by certain ideas.\nWhen he moved on to study at High School, however, he was taught by a very good teacher who was working on a project on mathematical education. But mathematics was not his main interest at this time. He lived in an apartment in West Jerusalem which was full of his parents' books, mainly works of literature, many of which were written in languages he could not read. Influenced by his father, he began to feel that philosophy was the subject for him. He wrote\n[\n19\n]\n:-\nInfluenced by my father, I was excited about the prospects for a theory of the understanding of natural language, for elucidating the mystery of metaphors.\nHe completed his high school studies in\n1976\nand, being only\n17\nyears old, he had a year before he had to undertake three years compulsory military service in the Israeli army. He applied to Oxford University to study mathematics and philosophy, still feeling that philosophy was the subject he was really interested in but also that mathematics would be a useful support. He was at Brasenose College, Oxford, for the year\n1976\n-\n77\n. The mathematics he studied during that year stunned him and he fell in love with the subject. He said that he was\n[\n19\n]\n:-\n... overwhelmed by the newness and beauty of the mathematical edifice I was beginning to glimpse.\nAlthough the questions that philosophy posed interested him, he did not find that the courses he took in Oxford excited him in the way that mathematics did. After the three years compulsory military service in Israel, Hrushovski went to the United States in\n1980\nto study mathematics at the University of California, Berkeley. He was awarded a B.A. from Berkeley in\n1982\nhaving majored in mathematics and continued to study at Berkeley for a Ph.D. His thesis advisor was Leo Harrington\n(\nborn\n17\nMay\n1946)\nwho works in recursion theory, model theory, and set theory. Hrushovski was awarded an NSF Graduate Fellowship and, in\n1985\n, he published the paper\nIdentities of cofinal sublattices\nwhich he co-authored with George M Bergman. George Bergman\n(\nborn\n1943)\n, had studied for his Ph.D. at Harvard advised by\nJohn Tate\n, and had been appointed to Berkeley in\n1967\nbeing steadily promoted there reaching full professor in\n1978\n. His research interests include universal algebra and category theory.\nHrushovski was awarded a Ph.D. by the University of California, Berkeley in\n1986\nfor his thesis\nContributions to Stable Model Theory\n. In it he gives the following Acknowledgements:-\nI feel very lucky to have been a student of Leo Harrington's. His depth and breadth of vision are on a scale that I did not know existed. But he is able to know what is major without making anything seem minor, and to create a sense of excitement at every step of the way. Learning from him has been a great pleasure.\nI was supported financially by a Berkeley Graduate Fellowship in\n1982\n/\n83\nand a National Science Foundation Graduate Fellowship in\n1983\n/\n84\n-\n1985\n/\n86\n.\nLeo Harrington had given a model theory course at Berkeley in\n1982\n-\n83\nduring which he had set out basic stability theory and presented\nSaharon Shelah\n's results. Hrushovski's thesis was built on this work of\nShelah\n's which, in Hrushovski own words\n[\n34\n]\n:-\n... was a huge revolution\n[\nwhich\n]\nturned\n[\nmodel theory\n]\nfrom a nice collection of ideas to a really deep area with its own systematic methodology at a completely different order of magnitude. This is stability theory.\nThe final year of Hrushovski's Ph.D. studies,\n1985\n-\n86\n, he had spent in Paris as an exchange student.\nAfter the award of his Ph.D., Hrushovski spent the year\n1986\n-\n87\nat Rutgers University in New Jersey, followed by two years,\n1987\n-\n89\n, at Princeton University, also in New Jersey. The first of these two years at Princeton he was in Instructor in Mathematics and the second year he was a Visiting Assistant Professor. During these years he was particularly influenced by Gregory Cherlin who was a professor at Rutgers University. Cherlin had studied at Yale University for his Ph.D. advised by\nAbraham Robinson\nand had been awarded the degree in\n1971\nfor his thesis\nA New Approach to the Theory of Infinitely Generic Structures\n. After spending time at MIT and Heidelberg he had joined Rutgers University where he spent the rest of his career. He made major contributions right from the beginning of his career on model theory, model theoretic algebra, and applications of model theory to combinatorics.\nIn\n1989\n-\n90\nHrushovski was a Postdoctoral Fellow at the Mathematical Sciences Research Institute which had been founded in\n1982\non the University of California, Berkeley, campus. In\n1990\nhe was appointed to his first tenure-track position when he became an Assistant Professor at the Massachusetts Institute of Technology\n(\nMIT\n)\n. In\n1991\nhe was appointed as an Assistant Professor at the Hebrew University in Jerusalem and over the next few years worked at both universities. He was promoted to Associate Professor at MIT in\n1992\nand full professor in\n1994\n. At the Hebrew University he was promoted to Associate Professor in the spring of\n1994\n, then to full professor later in that year.\nIn\n1993\nHrushovski won the first of many prizes and awards, namely the\nKarp\nPrize awarded by the Association for Symbolic Logic. He was making outstanding contributions to model theory and received the\nKarp\nPrize for\n[\n23\n]\n:-\n... his introduction of new methods in geometric stability theory.\nFor more information about this award and many other prizes awarded to Hrushovski, see\nTHIS LINK\n.\nIn the interview\n[\n34\n]\nHrushovski was asked to give an example of model theory which could be explained to a beginner. Here is his example:-\nThe easiest concrete example of model theory to explain is\nTarski\n's study of Greek geometry, which is a rich subject. It appears to be about certain figures in the plane, cut out by some algebraic equations. It's a great achievement to do one theorem at a time, to prove the Pythagorean theorem or the great many theorems proven by the Greeks, each one a separate achievement. At a certain point one gets the feeling that there's also a domain, something closed there, where you could describe the whole family of theorems and maybe systematise them. So we have\nTarski\n's theorem about the decidability of elementary geometry. Elementary geometry means that any question we can ask about algebraic shapes, including conic sections, hyperbolas, parabolas, or also more complicated ones, in fixed dimension and fixed degree, can be answered systematically.\nDescartes\nhad a feeling that it would work, that he could somehow do analytic geometry and answer questions like that, with algebraic manipulations.\nTarski\nproved that you can systematically answer all these things. That sheds a different light on the whole field; it's one whole level of abstraction up from a single elementary theorem in geometry. And surprisingly it reflects back once you have a global understanding of the area, that you can also tackle concrete questions using that - there were specific questions to which people were looking for answers - about complicated algebraic shapes, singularities and so on. Having the systematic understanding which\nTarski\nhad is the beginning of model theory. It gives, e.g., ways to prove effectiveness results but also to prove numerical bounds of the questions. Sometimes a specific question is so difficult that you can only get a handle on them via a more abstract and wider view.\nIn\n1994\nHrushovski moved to live permanently in Jerusalem when he became a full professor at the Hebrew University. There he married Merav Givoni, a Hebrew poet; they had a son David, born in\n2005\n, who became a talented poet and musician and studied at the University of Oxford beginning in\n2023\n. From August to December\n1997\nHrushovski was back in the United States as Miller Visiting Professor at the University of California, Berkeley. In January\n2000\nhe became the\nAlbert Einstein\nChair at the Hebrew University in Jerusalem. From August\n2008\nhe spent a year as a Visiting Professor at Yale University and from January to May\n2014\nhe was a Clay Mathematical Institute Senior Scholar, participating in Model Theory, Arithmetic Geometry and Number Theory at the Mathematical Sciences Research Institute, Berkeley. He returned to the Hebrew University where he worked until\n2016\nwhen he was appointed Merton Professor of Mathematical Logic at Oxford University.\nAmong many honours given to Hrushovski, in addition to the prizes he has received, let us record that he was elected a fellow of the\nAmerican Academy of Arts and Sciences\nin\n2007\n[\n6\n]\n:-\nProfessor Ehud Hrushovski is a Professor of Mathematics at the Hebrew University of Jerusalem. Formerly, Hrushovski was the Professor of Mathematics at the Massachusetts Institute of Technology. He received his Ph.D. from the University of California, Berkeley in\n1986\n, where his Ph.D. thesis revolutionised stable model theory. He has applied methods and theorems from model theory to other parts of mathematics, particularly arithmetic algebraic geometry, including the\nMordell\n-\nLang\nconjecture for function fields and a case of the\nJacobi\nconjecture for difference fields. Additionally, he has advanced model theory, making algebra appear inherently rather than being imposed.\nIn the following year,\n2008\n, he was elected a fellow of the\nIsrael Academy of Sciences and Humanities\n. In\n2018\nhe was elected to the\nAcademia Europaea\nand in\n2020\nhe was elected a fellow of the\nRoyal Society\n[\n27\n]\n:-\nEhud Hrushovski is a mathematical logician, concerned with mapping the interactions and interpretations among different mathematical worlds.   He studied in UC Berkeley, worked in Princeton, Rutgers, MIT and Paris and for twenty five years at the Hebrew University in Jerusalem.  He is now based in Oxford University.\nGuided by the model theory of\nRobinson\n,\nShelah\nand Zilber, Hrushovski investigated mathematical areas  including highly symmetric finite structures, differential equations,  difference equations and their relations to arithmetic geometry and the\nFrobenius\nmaps,  aspects of additive combinatorics, motivic integration, valued fields and non-archimedean geometry.   In some cases, notably approximate subgroups and geometric\nMordell\n-\nLang\n, the metatheory  had impact within the field itself, and led to a lasting involvement of model theorists in the area. He took part in the creation  of geometric stability,  simplicity theory in finite dimensions, and establishing the role of definable groups within first order model theory.\nHrushovski co-authored papers with forty-five  collaborators.  He has received a number of awards including the\nKarp\n,\nErdős\nand Rothschild prizes and the\n2019\nHeinz Hopf\nprize.\nHe has also been an invited speaker at the Mathematical Logic and Foundations Section of the International Congress of Mathematicians held in Kyoto, Japan in August\n1990\n; he gave the lecture\nCategorical Structures\n. He was a plenary speaker at the International Congress of Mathematicians held in Berlin, Germany in August\n1998\n. He delivered the lecture\nGeometric Model Theory\nand began his lecture with the following introduction:-\n\"Contemporary symbolic logic can produce useful tools - though by no means omnipotent ones - for the development of actual mathematics, more particularly for the development of algebra, and it would appear, of algebraic geometry.\" This statement\n(\nwith a reference to still older roots\n)\nwas made by\nAbraham Robinson\nin his\n1950\naddress to the International Congress of Mathematicians. Instances of such uses of logic include the correction and proof by Ax-Kochen of a p-adic conjecture of\nArtin\n's, and the Denef - Van den Dries proof of a p-adic analytic conjecture of\nSerre\n. The internal development of model theory since the\n70\n's has led to entirely new techniques, that, combined with the older ones, have begun to find applications to Diophantine geometry. It is the purpose of this talk to explain these methods and connections.\nThe present applications use only the finite-dimensional part of model theory\n(\nin a sense to be explained\n)\n.\nShelah\nand his followers created a theory of much greater generality\n(\nsuperstability, supersimplicity\n)\nincorporating many of the features of the finite dimensional case. One hopes that future applications will use this power. This exposition will limit itself to the finite-dimensional heartland\n(\nfinite\nMorley\nrank, S\n1\n-rank\n)\n.\nInstead of defining the abstract context for the theory, I will present some of its results in a number of special, and hopefully more familiar, guises: compact complex manifolds, ordinary differential equations, difference equations, highly homogeneous finite structures. Each of these has features of its own, and the transcription of the general results is not routine; they are nonetheless readily recognisable as instances of a single theory. The current applications to Diophantine geometry arise by way of the difference and differential \"examples\". §\n2\nand §\n6\nwill describe the model theory behind these results, and the prospects and difficulties lying ahead.\nHe has been an invited speaker giving a number of prestigious lecture series; we give a few examples. He gave the University of California Los Angeles Distinguished Lecture Series in April\n2011\n. He delivered three lecture on\nThe logic of large finite structures\n. He gave the Simons Symposium Talk in April\n2013\nat the University of Texas. He talked on\nGeometric integration over valued fields\n. As the Chaire d'excellence of the Fondation Sciences Mathématique de Paris he gave the seven lecture course on\nTopics in pseudo‑finite model theory\nat the Institut\nHenri Poincaré\nfrom October to December\n2015\n. He then gave a ten lecture course\nTowards a model theory of global fields\nat the Institut\nHenri Poincaré\nfrom January to April\n2016\n. He gave the\nEvelyn Nelson\nLectures at McMaster University in March\n2021\n. His title was\nOn the logic of finite fields\n(\nwith an additive character\n)\n. He gave the\nCoxeter\nLecture Series in December\n2021\nat the\nFields\nInstitute for Research in Mathematical Sciences. His three lectures were titled:\nIn pursuit of the Galois group\n;\nOn approximate subgroups\n; and\nMargulis arithmeticity and approximate lattices\n.\nLet us end this biography by noting that a conference \"Model theory: from geometric stability to tame geometry\" was organised to celebrate Hrushovski's\n60\nth birthday. Although originally arranged for June\n2020\nat the Centre International de Rencontres Mathématiques in Luminy, Marseille, France, because of COVID-\n19\n, it was rearranged and held at the\nFields\nInstitute in Toronto, Canada, in December\n2021\n. The proceeding of that conference contains an Introduction that summarises Hrushovski's remarkable contributions. We end by quoting from that Introduction\n[\n16\n]\n:-\nThroughout his career, starting with his Berkeley Ph.D. thesis, geometric stability theory\n(\ndefinable groups, minimal types, internality and binding groups, orthogonality, canonical bases, imaginaries, often in unstable contexts\n)\nhas been a guiding theme; an example is his\n2000\npaper with Hart and Laskowski The uncountable spectra of countable theories, a culmination of classification theory over countable languages. \"Hrushovski constructions\" first appeared in his talks in\n1988\nto give counterexamples to conjectures of Lachlan and Zilber but the ideas since then have yielded countless other important examples, as well as Zilber's pseudo-exponential field. His\n1996\npaper\nZariski\ngeometries with Zilber exhibits a natural context where Zilber's trichotomy conjecture holds\n(\nso is a counterpart to the Hrushovski constructions\n)\n, and was a key ingredient to his subsequent work on diophantine geometry. Early drafts of his monograph with Cherlin, Finite structures with few types, as well as work on PAC structures, gave versions of the independence theorem which underpins simple theories.\nOn the more applied side of model theory, Hrushovski's work with Chatzidakis and Peterzil on ACFA opened up difference algebra as an area of model-theoretic applications, reinforced by his manuscript on the nonstandard\nFrobenius\n. Hrushovski startled not just the model theory community when he found applications of large chunks of geometric stability theory in Diophantine geometry: he obtained for example a model-theoretic proof of the geometric\nMordell\n-\nLang\nconjecture, in all characteristics\n(\na new result for function fields in characteristic p\n)\n, and a new proof of the\nManin\n-\nMumford\nconjecture, with explicit bounds. A series of joint papers with Pillay in the late\n2000\ns\n(\none paper also with Peterzil, another also with Simon\n)\nyielded new ways of thinking about NIP theories model-theoretically, proved the Pillay conjecture on definable groups in o-minimal expansions of ordered fields, exhibited the significance of\nKeisler\nmeasures, and found model-theoretic applications of Vapnik-Chervonenkis theory; it has yielded many further developments in definable dynamics by Hrushovski and others. His\n2009\npaper on approximate subgroups led to the Breuillard-Green-\nTao\nclassification of finite approximate subgroups and to many other riches. Over the last\n25\nyears, the model theory of valued fields has been a major theme of his work, with ideas from stability theory feeding into our understanding of algebraically closed valued fields, with applications in motivic integration\n(\nHrushovski and Kazhdan\n)\n, nonarchimedean tame topology and Berkovich space\n(\nHrushovski and Loeser\n)\n, and zeta functions for groups\n(\nHrushovski, Martin, and Rideau-Kikuchi\n)\n.",
  "matematicos_citados_na_biografia": [
    "John Tate",
    "Saharon Shelah",
    "Shelah",
    "Abraham Robinson",
    "Karp",
    "THIS LINK",
    "Tarski",
    "Descartes",
    "Albert Einstein",
    "American Academy of Arts and Sciences",
    "Mordell",
    "Lang",
    "Jacobi",
    "Israel Academy of Sciences and Humanities",
    "Academia Europaea",
    "Royal Society",
    "Robinson",
    "Frobenius",
    "Erdős",
    "Heinz Hopf",
    "Artin",
    "Serre",
    "Morley",
    "Henri Poincaré",
    "Evelyn Nelson",
    "Coxeter",
    "Fields",
    "Zariski",
    "Manin",
    "Mumford",
    "Keisler",
    "Tao"
  ],
  "imagens": [
    "hrushovski.jpg"
  ]
}