{
  "nome_completo": "Edward Hubert Linfoot",
  "nome_curto": "Hubert Linfoot",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Linfoot/",
  "data_nascimento": "8 June 1905",
  "local_nascimento": "Sheffield, England",
  "data_morte": "14 October 1982",
  "local_morte": "Cambridge, England",
  "summary": "Hubert Linfoot was a British mathematician who worked in optics as well as pure mathematics.",
  "biografia": "Hubert Linfoot\n's parents were George Edward Linfoot and Laura Clayton. George Linfoot was a violinist and mathematician who was a school teacher of mathematics before becoming Director of Music for the Sheffield Local Education Authority. Hubert was the eldest of his parent's children and their only son. Hubert's sister Laura Margaret Linfoot\n(1910\n-\n1995)\nbecame a Fellow and Tutor in Economics in\nSomerville\nCollege, Oxford. Margaret married the government economic adviser Robert Hall. We note the amusing fact that after Robert Hall was knighted, his wife became Lady Margaret Hall. This must have caused confusion in Oxford where one of the colleges is named Lady Margaret Hall.\nLinfoot was brought up in Sheffield where he attended King Edward VII school. His record was outstanding and he achieved passes with distinction in Mathematics, Additional Mathematics, Chemistry and German. He took the Oxford scholarship examinations when only\n16\nyears of age and was awarded a mathematics scholarship to Balliol College. However he did not go to Oxford at this young age but waited until he was\n18\nyears old, matriculating in\n1923\n. The lecturer at Oxford who influenced him most was\nG H Hardy\n. During\n1925\n-\n26\nhe had tutorials from\nBesicovitch\nwho spent the year in Oxford trying to improve his ability to teach in English. In fact despite still being an undergraduate, Linfoot was already undertaking research and published his first paper\nThe domains of convergence of Kummer's solutions to the Riemann P-equation\nin\n1926\n.\nIn\n1926\nLinfoot graduated B.A. with First Class Honours in mathematics and he was awarded a Goldsmith Senior Scholarship to enable him to undertake research supervised by\nHardy\n. He attended\nHardy\n's seminar along with\nStephen Bosanquet\nand\nMary Cartwright\nwho were also\nHardy\n's doctoral students. Three of Linfoot's papers were published in\n1928\n:\nOn the \"Law of large numbers\"\nI;\nOn the \"Law of large numbers\"\nII; and\nGeneralisation of two theorems of H Bohr\n. Also in\n1928\n, Linfoot was awarded his doctorate after submitting his thesis\nApplications of the Theory of Functions of a Complex Variable\nin which he studied almost periodic functions. His scholarship was extended to allow him to spend the academic year\n1928\n-\n29\nat Göttingen in Germany. There he attended lectures on number theory by\nEdmund Landau\n, lectures by\nHarald Bohr\non almost periodic functions\n(\nHarald Bohr\n, although based in Copenhagen, was visiting Göttingen to continue his collaboration with\nEdmund Landau\n)\n, lectures on topological groups by\nvan der Waerden\n, lectures on class field theory by\nEmil Artin\n, and lectures by\nEdmund Landau\non\nWaring\n's problem and on Schlicht functions. Linfoot had already adopted the practice of taking notes of high quality of all courses he attended, and most of his beautifully written notebooks survive including those of the Göttingen courses he attended. Linfoot already spoke German fluently before his Göttingen visit, and after spending the year in Germany he was often mistaken for being German. In fact the courses Linfoot attended in Göttingen were delivered in German but written up by him in English.\nAfter spending this year in Göttingen, Linfoot spent the next two academic years in Princeton supported by a Jane Eliza Procter Fellowship. His notebooks show the lectures he attended: a course on dimension theory given by\nPavel Sergeevich Aleksandrov\n, a course on quantum mechanics by\nHoward Robertson\n, and another course on quantum mechanics by\nvon Neumann\n. Linfoot returned to Balliol College in\n1931\nand taught there until he was appointed as an Assistant Lecturer at the University of Bristol in\n1932\n.\nHans Heilbronn\nwas dismissed as an Assistant at Göttingen following the passing of the Nazi racial laws of\n1933\n. He went to the University of Bristol and began lifelong friendship with Linfoot. They published an important joint paper\nOn imaginary quadratic corpora of class-number one\n(1934)\n. In it they showed that there were at most ten quadratic fields of negative\ndiscriminant\nof class number one\n(\nof which nine had been known essentially since\nEuler\n)\n. In\n1935\nLinfoot married Joyce Dancer, the only daughter of James and Ellen Dancer, who was an excellent mathematician; they had a daughter Margaret\n(\nborn\n1945)\nand a son Sebastian\n(\nborn\n1947)\n. The\n1930\ns were a time of change for Linfoot. Following his year in Germany he became convinced that war was inevitable. This was reinforced by his discussions with\nHeilbronn\nand other refugees. Linfoot was determined to serve his country and make a significant contribution to the war effort despite knowing that his poor physical health would mean that he would fail a medical for military service. He therefore moved his research area to optics, believing that this would enable him to contribute to the war effort. His reason for choosing optics was a longstanding interest in astronomy and, when he was a young boy, he had built himself a small telescope. He also spoke of feeling that he had come to doubt his continuing creativity as a pure mathematician\n(\nalthough he published\n13\npapers in pure mathematics in the\n1930\ns, they were all joint publications, which could indicate that he felt he was helping to solve problems devised by others\n)\n.\nLinfoot began to build optical instruments in the H H Wills laboratory of the Physics Department at Bristol University. He exhibited a microscope of his own construction at the\n1939\nExhibition of the Physical Society\n[\n2\n]\n:-\nLinfoot said of this transition that in pure mathematics he needed to learn to think with complete accuracy, whereas in optics he had to learn to think with controlled inaccuracy, and he found this the more difficult of the two.\nAlthough he began his new career in optics with very practical work, he soon began to use his mathematical skills to solve theoretical problems. During World War II, he remained at Bristol but did important work for the Ministry of Aircraft Production on optical systems for air reconnaissance and also for Mott's research group which was trying to provide rapid solutions to problems of a technical nature. An example of a paper he published during World War II is\nOn some optical systems employing aspherical surfaces\n(1943)\n. P Boeder writes in a review:-\nThe \"see-saw diagram\" method of C R Burch\n(1942)\n[\nBurch worked at the H H Wills Laboratory\n]\nis applied to obtain general formulas for the\nSeidel\nerrors, excluding distortion, of optical systems consisting of two mirrors and a nearly plane parallel plate. It is shown that the only flat-fielded anastigmatism with both mirrors spherical is equivalent to the field-flattened Schmidt, while, in general, flat-fielded anastigmat requires asphericity of at least two of the optical surfaces. Nevertheless, special consideration is given to the case where both mirrors are spherical and only the correcting plate is figured. A system is designed suitable for use as an astrographic camera. Although this system is not strictly anastigmatic, it is shown that its field curvature can be satisfactorily controlled. An estimation is given of the performance of the system as compared with that of\nSchwarzschild\n's two mirror aplanats.\nOn\n1\nJune\n1948\nLinfoot was appointed Assistant Director of the Observatories at Cambridge, and\nJohn Couch Adams\nAstronomer\n[\n1\n]\n:-\nThis was an especially propitious moment for him to arrive in Cambridge since the Mathematics Laboratory had just begun its activities and was engaged in the early stages of the construction of Edsac I, one of the first generation of fast computers. The development of these was of crucial importance for optical design, where the sheer weight of the arithmetical calculations constituted a real barrier to progress. Linfoot began almost immediately to write programs which were well received by the laboratory personnel since they ran for a reasonable length of time and so enabled the computer's performance to be properly accessed. He developed at this time a keen interest in computers which came to exercise a strong influence on his thinking.\nIn\n[\n2\n]\nan overview of Linfoot's contributions to astronomical optics is given which begins as follows:-\nAny summary of his rich contribution to astronomical optics must necessarily be over-simplified, but the main elements may perhaps be characterised as synthesis, error-balancing, assessment and testing. ... One of Linfoot's major contributions to synthesis was to apply his formidable analytic ability to the physical concept of the plate-diagram of Burch; this led, for example, to much of his work on Schmidt-Cassegrain and related systems.\nThe first of Linfoot's two major books was\nRecent advances in optics\n(1955)\n.\nM Herzberger\nwrites:-\nThe author has made contributions to geometrical optics, diffraction optics and to the study of coherence in optical systems. His book can be considered as a collection of a series of monographs in special fields of optics in which he is interested. ... The first section deals with the optical image starting from the characteristic function ... The second monograph deals with the\nFoucault\n(\nknife-edge\n)\ntest, its theory, and its application to the study of aberrations of optical system with small errors. The third monograph deals with the Schmidt correcting plate, to the theory of which the author has made various contributions. The last chapter carries out in detail an idea by C R Burch.\nOne important aspect of Linfoot's work was his application to optics of new ideas in information theory which had just been published by\nClaude Shannon\n. For example he showed how the methods of information theory can be applied to the analysis of the optical images in his article\nInformation theory and optical images\n(1955)\n.\nHerzberger\nalso reviewed\nOptical image evaluation from the standpoint of communication theory\n(1958)\n:-\nThis thought-provoking but difficult paper attempts to transfer the concepts developed in communication theory to the evaluation of the optical and photographic image and its information content in the presence of optical \"noise\".\nApplying ideas from information theory, particularly methods of\nFourier analysis\n, to optical images is the main topic of his second book\nFourier methods in optical image evaluation\n(1964)\n. It is worth noting that his papers contain material relating to an unpublished book on almost periodic functions which he had planned to write.\nLinfoot's expertise in optics for astronomical instruments led to him being in demand as a consultant for the building of several major telescopes. He was a consultant for the design of a thirty-seven-inch Schmidt-Cassegrain telescope at the University of St Andrews, Scotland, completed in\n1962\n(\ninitially supervised by\nFinlay Freundlich\n)\n, for the\n2\n.\n5\nm Cassegrain\nIsaac Newton\nTelescope completed at Herstmonceux, Sussex in\n1967\n, and for the\n3\n.\n9\nm Cassegrain Anglo-Australian Telescope which began operating at Siding Spring, Australia in\n1974\n. The first two of these consultancies are most extensively documented in the papers he left.\nAs to his character we quote from\n[\n2\n]\n:-\nLinfoot's health was never robust. His need to reserve his effort for what was of greatest importance could give the impression of a more retiring disposition than he in fact possessed, and this contributed to the sense of intellectual loneliness that he undoubtedly felt even in a great university, particularly among astronomers who in the days before radio astronomy and space research tended towards conservatism of outlook. ... He had cultivated tastes not only in music but also in literature and art ... and was a connoisseur of chess and Go.",
  "matematicos_citados_na_biografia": [
    "Somerville",
    "G H Hardy",
    "Besicovitch",
    "Hardy",
    "Stephen Bosanquet",
    "Mary Cartwright",
    "Edmund Landau",
    "Harald Bohr",
    "van der Waerden",
    "Emil Artin",
    "Waring",
    "Pavel Sergeevich Aleksandrov",
    "Howard Robertson",
    "von Neumann",
    "Hans Heilbronn",
    "discriminant",
    "Euler",
    "Heilbronn",
    "Seidel",
    "Schwarzschild",
    "John Couch Adams",
    "M Herzberger",
    "Foucault",
    "Claude Shannon",
    "Herzberger",
    "Fourier analysis",
    "Finlay Freundlich",
    "Isaac Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}