{
  "nome_completo": "Hypsicles of Alexandria",
  "nome_curto": "Hypsicles",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hypsicles/",
  "data_nascimento": "about 190 BC",
  "local_nascimento": "Alexandria, Egypt",
  "data_morte": "about 120 BC",
  "local_morte": null,
  "summary": "Hypsicles was a Greek mathematician who wrote a treatise on regular polyhedra. He is the author of what has been called Book XIV of Euclid's Elements , a work which deals with inscribing regular solids in a sphere.",
  "biografia": "Hypsicles of Alexandria\nwrote a treatise on regular polyhedra. He is the author of what has been called Book XIV of\nEuclid\n's\nElements\n, a work which deals with inscribing regular solids in a sphere.\nWhat little is known of Hypsicles' life is related by him in the preface to the so-called Book XIV. He writes that Basilides of Tyre came to Alexandria and there he discussed mathematics with Hypsicles' father. Hypsicles relates that his father and Basilides studied a treatise by\nApollonius\non a\ndodecahedron\nand an\nicosahedron\nin the same sphere and decided that\nApollonius\n's treatment was not satisfactory.\nIn the so-called Book XIV Hypsicles proves some results due to\nApollonius\n. He had clearly studied\nApollonius\n's tract on inscribing a dodecahedron and an icosahedron in the same sphere and clearly had, as his father and Basilides before him, found it poorly presented and Hypsicles attempts to improve on\nApollonius\n's treatment.\nArab writers also claim that Hypsicles was involved with the so-called Book XV of the\nElements\n. Bulmer-Thomas writes in\n[\n1\n]\nthat various aspects are ascribed to him, claiming that either:-\n... he wrote it, edited it, or merely discovered it. But this is clearly a much later and much inferior book, in three separate parts, and this speculation appears to derive from a misunderstanding of the preface to Book XIV.\nDiophantus\nquotes a definition of\npolygonal number\ndue to Hypsicles\n(\nsee either\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nIf there are as many numbers as we please beginning from\n1\nand increasing by the same common difference, then, when the common difference is\n1\n, the sum of all the numbers is a\ntriangular number\n; when\n2\na square; when\n3\n, a pentagonal number\n[\nand so on\n]\n. And the number of angles is called after the number which exceeds the common difference by\n2\n, and the side after the number of terms including\n1\n.\nThis says that, in modern notation, the\nn\nn\nn\nth\nm\nm\nm\n-agonal number is\n1\n2\nn\n[\n2\n+\n(\nn\n−\n1\n)\n(\nm\n−\n2\n)\n]\n\\large\\frac{1}{2}\\normalsize  n [2 + (n - 1) (m - 2)]\n2\n1\n​\nn\n[\n2\n+\n(\nn\n−\n1\n)\n(\nm\n−\n2\n)\n]\n.\nWe do not know for certain that Hypsicles wrote a text on polygonal numbers, but it is fairly certain that he did write such a text which has been lost. This work on polygonal numbers is related to the ideas on\narithmetic progressions\nthat appear in another work by Hypsicles, making it more likely that indeed Hypsicles had indeed done original work on this topic.\nThe work which involves arithmetic progressions is Hypsicles'\nOn the\nAscension\nof Stars\n. In this work he was the first to divide the\nZodiac\ninto\n360\n°. He says\n(\nsee\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nThe circle of the zodiac having been divided into\n360\nequal arcs, let each of the arcs be called a spatial degree, and likewise, if the time taken by the zodiac circle to return from a point to the same point is divided into\n360\nequal times, let each of the times be called a temporal degree.\nHypsicles considers two problems in this work\n[\n2\n]\n:-.\n(\ni\n)\nGiven the ratio of the longest to the shortest day at any place, how long does it take any given sign of the zodiac to rise there?\n(\nii\n)\nHow long does it take any given degree in a sign to rise?\nHypsicles makes a false assumption involving arithmetic progressions so that his results are wrong.\nHeath\nwrites\n[\n2\n]\n:-\nTrue, the treatise\n(\nif it really be by Hypsicles, and not a clumsy effort by a beginner working from an original by Hypsicles\n)\ndoes no credit to its author; but it is in some respects interesting...\nThe mistake which Hypsicles makes is to assume that the rising times form an arithmetical progression. Having made this assumption his results are correct and\nNeugebauer\n[\n4\n]\ncertainly values this work much more highly than\nHeath\ndoes. In fact without the aid of the sine function and trigonometry it is hard to see how Hypsicles could have done better.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Apollonius",
    "dodecahedron",
    "icosahedron",
    "Diophantus",
    "polygonal number",
    "triangular number",
    "arithmetic progressions",
    "Ascension",
    "Zodiac",
    "Heath",
    "Neugebauer"
  ],
  "imagens": []
}