{
  "nome_completo": "Ibrahim ibn Sinan  ibn Thabit ibn Qurra",
  "nome_curto": "Ibrahim ibn Sinan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ibrahim/",
  "data_nascimento": "908",
  "local_nascimento": "Baghdad, (now in Iraq)",
  "data_morte": "946",
  "local_morte": "Baghdad, (now in Iraq)",
  "summary": "Ibrahim ibn Sinan was an Islamic mathematician and astronomer who studied geometry and in particular tangents to circles. He also made advances in the theory of integration.",
  "biografia": "Ibrahim ibn Sinan\nwas a son of\nSinan ibn Thabit\nand a grandson of\nThabit ibn Qurra\nand studied geometry and in particular\ntangents\nto circles. He also studied the apparent motion of the Sun and the geometry of shadows. There is no doubt that had he not died at the young age of thirty-eight, he would have achieved a degree of fame for his mathematical works going even beyond the opinion of Sezgin\n(\nsee\n[\n5\n]\nand\n[\n6\n]\n)\nthat he was:-\n... one of the most important mathematicians in the medieval Islamic world.\nPerhaps his early death robbed him of the chance to make a contribution even more important than that of his famous grandfather.\nIbrahim's most important work was on the\nquadrature\nof the\nparabola\nwhere he introduced a method of integration more general than that of\nArchimedes\n. His grandfather\nThabit ibn Qurra\nhad started to view integration in a different way to\nArchimedes\nbut Ibrahim realised that\nal-Mahani\nhad made improvements on what his father had achieved. To Ibrahim it was unacceptable that\n(\nsee for example\n[\n1\n]\n)\n:-\n...\nal-Mahani\n's study should remain more advanced than my grandfather's unless someone of our family can excel him.\nIbrahim is also considered the foremost Arab mathematician to treat mathematical philosophy. He wrote\n(\nsee for example\n[\n1\n]\n)\n:-\nI have found that contemporary geometers have neglected the method of\nApollonius\nin analysis and synthesis, as they have in most of the things I have brought forward, and that they have limited themselves to analysis alone in so restrictive a manner that they have led people to believe that this analysis did not correspond to the synthesis effected.\nWe know of Ibrahim's works through his own work\nLetter on the description of the notions Ibrahim derived in geometry and astronomy\nin which Ibrahim lists his own works. This is one of seven treatises by Ibrahim given with full Arabic text and English summaries in\n[\n2\n]\n. Among the works published in\n[\n2\n]\nare\nOn drawing the three\nconic sections\nin which Ibrahim give a pointwise construction for the\nellipse\n, the parabola and the\nhyperbola\n. Although based on ideas due to\nApollonius\nthere are aspects of this work which illustrate the changed point of view of Arabic mathematicians. For example Ibrahim uses an arithmetical term to denote the product of two geometrical lines.\nIn\nOn the measurement of the parabola\nIbrahim ibn Sinan gives a beautiful proof that the area of a segment of the parabola is four-thirds of the area of the\ninscribed\ntriangle. Another work is\nOn the method of analysis and synthesis, and the other procedures in geometrical problems\nwhich contains a systematic exposition of analysis, synthesis and related subjects, with many easy examples. This is in contrast to\nThe selected problems\nin which\n41\ndifficult geometrical problems are solved, usually by analysis only, without a discussion of the number of solutions or conditions which make the solutions possible.\nOn the motions of the sun\nis an astronomical work which discusses of the motion of the solar\napogee\n. It also provides a critical analysis of the observations underlying\nPtolemy\n's solar theory, and Ibrahim ibn Sinan provides his own theory of the sun. The work\nOn the\nastrolabe\nincludes work on map projections. Ibrahim proves in this work that the\nstereographic projection\nmaps circles which do not pass through the pole of projection onto circles.\nIn fact geometric transformations figure a great deal in Ibrahim's works and this interesting aspect is discussed in detail in\n[\n4\n]\n. Examples are given which illustrate how Ibrahim applied an orthogonal compression to transform a circle into an ellipse, and an oblique compression to map a hyperbola into a second hyperbola. In a different work Ibrahim uses a transformation which maps figures keeping invariant the ratio between their areas.\nIbrahim's contribution is summed up in\n[\n1\n]\nas follows:-\nConsidering both the problem of\ninfinitesimal\ndeterminations and the history of mathematical philosophy, it is obvious that the work of ibn Sinan is important in showing how the Arab mathematicians pursued the mathematics that they had inherited from the Hellenistic period and developed it with independent minds. That is the dominant impression left by his work.",
  "matematicos_citados_na_biografia": [
    "Sinan ibn Thabit",
    "Thabit ibn Qurra",
    "tangents",
    "quadrature",
    "parabola",
    "Archimedes",
    "al-Mahani",
    "Apollonius",
    "conic sections",
    "ellipse",
    "hyperbola",
    "inscribed",
    "apogee",
    "Ptolemy",
    "astrolabe",
    "stereographic projection",
    "infinitesimal"
  ],
  "imagens": []
}