{
  "nome_completo": "Ida Winifred Busbridge",
  "nome_curto": "Ida Busbridge",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Busbridge/",
  "data_nascimento": "10 February 1908",
  "local_nascimento": "Plumstead, Kent, England",
  "data_morte": "27 December 1988",
  "local_morte": "Bromley, Kent, England",
  "summary": "Ida Busbridge worked on integral equations and radiative transfer. She was the first woman appointed to an Oxford fellowship in mathematics. She taught at the University of Oxford for 35 years.",
  "biografia": "Ida Busbridge\nwas the daughter of Percival George Busbridge\n(1872\n-\n1909)\nand his wife May Edith Webb\n(1874\n-\n1943)\n. We are unsure of Percival Busbridge's occupation and only have the following information. Captain Percival George Busbridge of the\n2\nnd Kent Royal Artillery\n(\nVolunteers\n)\nwas appointed as Captain in the\n2\nnd Kent Royal Artillery on\n1\nApril\n1908\n, in other words as a professional member of the platoon instead of his former volunteer status. Percival and May were married in the first half of\n1898\n. They had four children: Walter George Busbridge\n(1901\n-\n1979)\n, who became a Scientific Officer; Evelyn May Busbridge\n(1903\n-\n1995)\n, who became an assistant Mistress at a Secondary School; Percival Hugh Busbridge\n(1906\n-\n1930)\n, who became a mechanical engineer; and Ida Winifred Busbridge\n(1908\n-\n1988)\n, the subject of this biography. Before we embark on Ida Busbridge's biography, let us give a little more information about her siblings.\nWalter George Busbridge, born\n23\nFebruary\n1901\n, studied physics and became Head of Industrial Liaison, Isotope Research Division, Harwell, United Kingdom Atomic Energy Authority. He was awarded an OBE in the Queen's New Year Honours,\n1\nJanuary\n1962\n. Evelyn May Busbridge attended King's College, London, and was awarded a B.A. in\n1924\n. She then went on to study at the London Day Training College which had been founded in\n1902\nto train teachers. She was awarded the qualification Ped. in\n1925\nand became a well-known teacher of mathematics. Percival Hugh Busbridge also attended King's College, London, and was awarded a B.Sc. Eng. in\n1927\n, although sadly, he died three years later on\n19\nMay\n1930\n.\nTragically, Ida Busbridge never really knew her father Percival Busbridge who died on\n27\nJune\n1908\nwhen Ida was sixteen months old. At that time the family were living at\n120\nEglinton Road, Plumstead, Kent. Percival died\n[\n3\n]\n:-\n... of complications arising from influenza. His death was attributed by his family to overwork and lack of proper medical care.\nIda's mother May had to bring up her four children and she earned her living as an elementary school teacher working for the London County Council\n(\nL.C.C.\n)\n. Ida began her primary school education at the L.C.C. School in Plumstead in\n1914\nwhen she was six years old. She spent four years at this school then, in\n1918\n, she entered Christ's Hospital, Hertford, which at that time was a girls only school. This school had a long history, founded in the\n16\nth century, and was an independent school in which most pupils are funded through bursaries. The school had been coeducational until\n1902\nwhen the boys went to a new school near Horsham in Sussex. Busbridge was always grateful for the education she received at Christ's Hospital and continued to take an interest in the school throughout her life.\nWhile at Christ's Hospital, Busbridge was awarded the Cambridge School Certificate in\n1923\n, and the Higher School Certificate with Intermediate Exemption in\n1925\nand the Higher School Certificate with Intermediate Exemption in\n1926\n. On\n30\nSeptember\n1926\nshe entered Royal Holloway College, giving her home address as\n82\nChesnut Road, London S.E.\n18\n, although she later moved to Haremere, Westerham Road, Keston, Kent. She was awarded two scholarships, the Royal Holloway College Entrance Scholarship, which gave her £\n60\na year for three years, and a Christ's Hospital Scholarship which gave her £\n50\na year for three years.\nWhen Busbridge entered Royal Holloway College she was intending to specialise in physics and she took the General B.Sc. course in\n1926\n-\n27\nand again in\n1927\n-\n28\n. Her real love, however, was in mathematics and she won a Driver Scholarship in Mathematics and a Driver Prize in Pure Mathematics in\n1928\n. We note that the Driver Prizes were endowed by Mary Ann Driver in\n1887\nand are awarded in recognition of excellent work. Having changed to specialise in mathematics Busbridge took the B.Sc.\n(\nSpecial\n)\ncourse in\n1928\n-\n29\n. Again she had outstanding success with the award of the Driver Prize in Pure and Applied Mathematics and the Martin Holloway Prize in\n1929\n, which was awarded to the best single honours finalist in each faculty. She graduated in June\n1929\nwith a B.Sc.\n(\nSpecial\n)\nwith First Class Honours in Mathematics. She was also awarded the Sir John Lubbock Prize for the best First Class honours of any internal or external candidate. Not only was she the best Royal Holloway student, but to win the Lubbock Prize she had to be ranked first from all mathematics students at all London University Colleges. Busbridge did not miss out on the social life of the university for she was in the Choral Society in\n1926\nand\n1927\nthen, in the University choir in\n1928\n. She was also Secretary of the Science Discussion Society in\n1927\nand President of that Society in\n1928\n. Her academic record notes that her friends were Auckland, Payne and Cook and that Busbridge was:-\n... most capable and thoroughly reliable.\nAfter her highly successful undergraduate career, Busbridge remained at Royal Holloway College, working for an M.Sc. She was awarded a B.Sc.\n(\nSpecial\n)\nPart II with First Class Honours in Mathematics in\n1932\nand, in the same year, was awarded a Gilchrist Studentship for Women which was based on the results of a Scholarship examination. In\n1933\nshe submitted her M.Sc. thesis\nFourier Integrals\nwhich was examined by\nG H Hardy\nas external examiner. She was awarded the degree \"with distinction.\" Based on the results of her M.Sc. thesis, she published the paper\nOn general transforms with kernels of the Fourier type\n, which appeared in the\nJournal\nof the\nLondon Mathematical Society\nin\n1934\n. The Abstract reads:-\nSince\nG N Watson\npublished his paper on \"General transforms\", alternative proofs of his theorems have been given by\nE C Titchmarsh\nand\nM Plancherel\n. These depend on approximations by means of series of functions possessing specific properties. In this note I show that the theorems can be proved by means of the properties of mean-square limits, without using series of approximating functions.\nShe was appointed as a Demonstrator in Mathematics at University College, London, in\n1933\nand she held this post for two years. In\n1935\nshe moved to St Hugh's College, Oxford, where she was employed to assist\nDorothy Wrinch\nin teaching women undergraduates. The Principal of Hugh's College was Barbara Elizabeth Gwyer\n(1881\n-\n1974)\nand she wrote\n[\n4\n]\n:-\nSt Hugh's was lucky enough to adopt Ida at this juncture, to present her for Matriculation and to appoint her Lecturer in Mathematics. When Dr\nWrinch\nleft England for America in\n1938\nIda inherited her responsibility for the teaching of women mathematicians and in\n1945\nwas appointed Fellow and Tutor at St Hugh's.\nIn addition to teaching at St Hugh's College, Busbridge worked towards a D.Phil. advised by\nE C Titchmarsh\n. She was awarded the degree in\n1938\nfor her thesis\nGeneral transforms\n. In\n1938\nshe published the paper\nDual Integral Equations\nin the\nProceedings\nof the\nLondon Mathematical Society\n. She gives the following introduction:-\nIn his new book on\nFourier\nintegrals\n[\nIntroduction to the theory of Fourier integrals\n(1937)]\n, Prof\nTitchmarsh\ngives the formal solution by\nMellin\ntransforms of some dual integral equations, which arise in connection with the problem of a  flat electrified disc of conducting material. He suggested to me that I should consider conditions for the validity of his analysis and in this paper I give a solution. Prof\nTitchmarsh\nhas very kindly helped me with many suggestions and criticisms and I should like here to express my gratitude to him.\nAlso in\n1938\nshe published\nA theory of general transforms for functions of the class\nL\np\n(\n0\n,\n∞\n)\n(\n1\n<\np\n≤\n2\n)\nL^{p}(0, ∞) (1 < p ≤ 2)\nL\np\n(\n0\n,\n∞\n)\n(\n1\n<\np\n≤\n2\n)\nin the\nQuarterly Journal of Mathematics\n.\nThe St Hugh's Chronicle for\n1939\n-\n40\nreports\n[\n5\n]\n:-\nMiss Busbridge\n(\nM.A. London\n)\n, a member of our Society, awarded the D.Phil. in\n1938\nand the M.A. by decree in\n1939\n, is now Lecturer in Mathematics, and will examine for and take pupils from the other Societies as required. Oxford knows her well, for since\n1935\nshe has been a diligent assistant to Dr\nWrinch\nwhen both were in residence, and an effective substitute when she was abroad.\nIn\n1939\nshe published four papers, two of which were follow-ups to her\n1938\nQuarterly Journal of Mathematics\npaper\n(\npublished in the same journal\n)\n, and the other two being\nThe Evaluation of Certain Integrals Involving Products of Hermite Polynomials\n, and\nOn the solution of an integral equation\n, both published in the\nJournal\nof the\nLondon Mathematical Society\n.\nSt Hugh's making her a fellow in\n1945\nwas, almost certainly, the result of Busbridge applying for a post at Cambridge since she was frustrated by the lack of opportunities for female academics in Oxford.\nCertainly Busbridge gained the reputation as a demanding tutor. Judy Batson writes\n[\n1\n]\n:-\nThe atmosphere grew less formal and constrained during the\n1950\ns when older fellows retired and younger women took their places Dr Ida Busbridge\n(\nRoyal Holloway College, London\n)\nbecame mathematics tutor in\n1939\nand, until the women's colleges were able to appoint their own tutors in the subject, for many years had sole charge of all women students reading mathematics. She was considered an outstanding lecturer and demanding tutor. Clare Richardson\n(\nSt Hugh's\n1954)\nrecalled that Dr Busbridge kept assigning more and more work every week to her and her tutorial partner until they finally gaped at her in astonishment. \"Miss Busbridge just smiled and told us that she had been trying to find out how much we could cope with, and now she knew.\"\nSusan Wallington writes in an obituary of Gay Catto\n(\nnée Hunt\n)\n[\n9\n]\n:-\nAt the start of Michaelmas Term\n1959\n, Gay and I both arrived to read Mathematics at St Hugh's. Our tutor was the notable mathematician Ida Busbridge, always known as Buz, who decided we should be tutorial partners as we were both clergy daughters and should be companions! She was quite right about that as we became lifelong friends. Buz's tutorial style was to seat her students either side of her at a table while she wrote out the solution to a problem with laborious slowness. We spent many hours that first year following her meticulous workings\n(\nlater to find her teaching much more valuable than I realised at the time\n)\n.\nMargaret Rayner\nwrites in\n[\n6\n]\n:-\nDorothy Wrinch\nhad conformed to the usual Oxford tutorial style: undergraduates taught themselves from books, lectures and their contemporaries, and bothered a tutor about details only when it was absolutely necessary. Ida Busbridge, a graduate of Royal Holloway College in the University of London, believed that this system was inappropriate for women undergraduates who had not experienced the rigorous preparation for Oxford available in many boys' schools. She set weekly problems for students and required written solutions to be handed in before the next tutorial, so that she could read and comment upon them. In tutorials she taught basic material, normally to two students, and at the end handed over the meticulous notes she had written during the hour. Not all students found this routine agreeable or stimulating, but students became less likely to give up on mathematics, and examination results improved.\n...\nThroughout the\n1940\ns and\n1950\ns Ida Busbridge was the spokeswoman for the teaching of women undergraduate mathematicians at Oxford, both in the University and in schools, and completely changed how things were done. She maintained good relations with schools and took an active part in the\nMathematical Association\n.\nMargaret Rayner\nalso writes in\n[\n6\n]\nabout Busbridge as a lecturer:-\nIda Busbridge was a superb lecturer; her voice could be heard clearly in the largest lecture theatre; her material was perfectly prepared; her handwriting was immaculate. Her proofs and explanations left nothing to chance.\nAt St Hugh's College, Busbridge was friends with Madge Gertrude Adam\n(1912\n-\n2001)\n. Adam had a major influence on Busbridge's career so we quote some details from\n[\n11\n]\n:-\nIn\n1935\n, Madge Adam ... became the first of a long line of postgraduate research students in solar physics at the University of Oxford Observatory. The new director of the observatory, Professor H H Plaskett, was about to establish solar physics as its chief research object, and the Sun was Adam's particular interest. Having just found herself in possession of a first, she heard that Plaskett was asking for research students. \"So I knocked on his door and said, 'How about me?'.\" The woman who became a dedicated researcher, internationally known for her work on the nature of sunspots and on their magnetic fields, was to be a key figure at the observatory for the rest of her life.\nInfluenced by her friend Adam, Busbridge applied her mathematical skills to problems in solar physics. Her first paper in the\nMonthly Notices\nof the\nRoyal Astronomical Society\nwas\nOn the solution of the equation of radiative transfer\n(1941)\n. She ends the paper with the following acknowledgement:-\nI should like to express my thanks to Professor H H Plaskett and the Professor\nE A Milne\n, from both of whom I have received several long and helpful letters on the subject. To Professor Plaskett I am indebted for the discussion on the darkening near to the limb of the sun ... I should also like to thank members of the University Observatory for their interest in the problem and for helpful criticisms.\nThis was the first of several papers that Busbridge published in the\nMonthly Notices\nof the\nRoyal Astronomical Society\n. There followed:\nOn emission lines in stellar spectra\n(1952)\n;\nCoherent and non-coherent scattering in the theory of line formation\n(1953)\n;\n(\nwith Walter Stibbs\n)\nOn the intensities of interlocked multiplet lines in the Milne-Eddington model\n(1954)\n;\nA mathematical verification of the principle of invariance as applied to completely non-coherent scattering and to interlocked multiplet lines\n(1955)\n; and\nFinite atmospheres with isotropic scattering\n(1955)\n;\nFinite Atmospheres with Isotropic Scattering: II. Increase of Line Strength to the Limb\n(1956)\n. Her work on radiative transfer led to her publishing the book\nThe Mathematics of Radiative Transfer\n(1960)\n.\nFor\n(\ni\n)\nthe Publisher's description,\n(\nii\n)\nthe Preface,\n(\niii\n)\nan extract from the Introduction,\n(\niv\n)\nan extract from a review, and\n(\nv\n)\nWalter Stibbs comments on\nThe Mathematics of Radiative Transfer\nsee\nTHIS LINK\n.\nBusbridge submitted this book, together with other publications, to Oxford University for the degree of D.Sc. After the submission was examined by\nE C Titchmarsh\nand D W N Stibbs, she was awarded the degree of D.Sc. in\n1961\n.\nFinally let us note Busbridge's work for the\nMathematical Association\n[\n6\n]\n:-\nIda Busbridge was an enthusiastic member of the\nMathematical Association\n. She was a member of the Committee which produced the report on the Teaching of Calculus in Schools in\n1954\n, and also of the Committee which prepared the Report on Analysis\n(\nCourse I in\n1957\nand Course II in\n1962)\n. The Analysis Committee met on Saturday afternoons at St Hugh's and was sustained by wonderful teas which Ida provided. She was President of the Association from\n1964\nand\n1965\nand it gave her particular pleasure that the Annual Conference was held in Oxford in\n1965\nand that her Presidential address was given in the Sheldonian Theatre.\nIn her Presidential Address, she said her aim was to:-\n... give every girl or boy the opportunity to develop his or her mathematical powers to the full\n[\nand to\n]\nfoster those of special ability for the sake of the country as a whole for the advancement of knowledge.\nIn\n1970\n, Busbridge retired from St Hugh's College. She died on\n27\nDecember\n1988\nand, on Saturday\n25\nFebruary\n1989\n, a memorial service was held in St Hugh's College Chapel. A Memorial Address was delivered by the Principal Rachel Trickett. For a version of this address, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "G H Hardy",
    "London Mathematical Society",
    "G N Watson",
    "E C Titchmarsh",
    "M Plancherel",
    "Dorothy Wrinch",
    "Wrinch",
    "Fourier",
    "Titchmarsh",
    "Mellin",
    "Margaret Rayner",
    "Mathematical Association",
    "Royal Astronomical Society",
    "E A Milne",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}