{
  "nome_completo": "Ilya Nestorovich Vekua",
  "nome_curto": "Ilya Vekua",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vekua/",
  "data_nascimento": "23 April 1907",
  "local_nascimento": "Shesheleti, Kutaisi Governorate, Russian Empire (now Ochamchira District, Abkhazia, breakaway region of Georgia)",
  "data_morte": "2 December 1977",
  "local_morte": "Tbilisi, Georgia, USSR",
  "summary": "lya Vekua was a  Georgian mathematician, specializing in partial differential equations, singular integral equations, generalized analytic functions and the mathematical theory of elastic shells.",
  "biografia": "Ilya Vekua\n's parents were Nestor and Lisa Vehua, who were described in\n[\n2\n]\nas peasants:-\n... who could have never fancied that their first-born child would become one of the prominent mathematicians of the\n20\nth\ncentury, a great organiser, an outstanding scientist and a public figure.\nThe village of Shesheleti where Ilya was brought up, about\n12\nkm from the Black Sea, had no high school, so Vekua attended the secondary school in Zugdidi, about\n25\nkm to the south. At the school in Zugdidi of all subjects he studied and enjoyed it was mathematics that captivated him. He loved its rigour and its logical internal structure. He was described as serious and thoughtful during his school days and, in\n1925\n, he completed his schooling and entered the Faculty of Physics and Mathematics of Tbilisi State University. This university had opened in\n1918\nand one of the founders of the university was\nAndrei Razmadze\nwho held a chair in the Physics and Mathematics Faculty.\nRazmadze\nwas assisted by\nNikoloz\n(\nNiko\n)\nMuskhelishvili\nwho had joined the new university in\n1920\n. Among the more junior members of the mathematics staff at the time that Vekua was a student we mention Archil Kharadze\n(1895\n-\n1976)\nand George Nikoladze\n(1888\n-\n1931)\n.\nAlthough the standard of teaching was high, the classes were very large and students got relatively little personal contact with their professors. There were no research seminars at this time and few opportunities for involving students in research topics. However, for the best students this problem was to some extent minimised by the students themselves who organised their own student physics and mathematics circle. They set up meetings in which the students gave talks on solving mathematical problems. They also invited their professors and visiting academics to give lectures to the circle. From his third year onwards, Vekua was elected each year as chairman of the student physics and mathematics circle. In\n1929\n, while still an undergraduate, Vekua was employed as an Observer at the Georgian Geophysics Observatory. He retained a position with the Geophysics Observatory until\n1933\nbut for the latter part of this time he changed from the role of Observer to that of Physicist at the Observatory's Karsani Magnetic Department\n(\nnear Tbilisi\n)\n.\nVekua graduated from the Tbilisi State University in\n1930\nand became a postgraduate student at the USSR Academy of Sciences in Leningrad. At the Academy of Sciences he came into contact with\nMuskhelishvili\nwho had taught him at Tbilisi, but\nMuskhelishvili\nhad not really known the young student while he was an undergraduate as he explained.\nMuskhelishvili\nwrote\n(\nsee\n[\n2\n]\n)\n:-\nStrangely enough, I really got to know Vekua only in\n1930\nin Leningrad, where he had been sent on my recommendation along with a group of other young mathematicians to the graduate school in the Physics and Mathematics Institute. While there were very few mathematics professors in Tbilisi, we had to teach a large number of subjects, and since there were quite a lot of students it was hard to memorise all of them. Besides Vekua always behaved modestly and quietly. Some time after arriving in Leningrad\n(\nI often go there to give lectures and work with graduate students\n)\n, I went to the Director of the Institute, the leading naval architect and outstanding specialist in applied mathematics Academician\nAleksei Nikolaevich Krylov\n, to ask how the postgraduates we had sent were coping with the work. Frankly, I was somewhat surprised that\nAleksei Krylov\nonly talked about Vekua. I must say that the speciality of\nAleksei Krylov\nwas very far from that in which Vekua was engaged, but\nAleksei Krylov\nwas one of the smartest people I ever met, and he could spot talent in a far removed area. One day I participated in the seminar which was led by Professor\nVladimir Ivanovich Smirnov\n(\nalso a very prominent scientist\n)\n, and found a report which had been written by Vekua. This report gave me a very strong impression of maturity of thought and clarity of presentation. It was then that I saw clearly that this is a talented young man. Our acquaintance began just after the workshop and developed into a close friendship. The difference in age, which at that time could pose a huge problem but is now almost obliterated, did not prevented us from the very beginning from being friends, and our scientific work, especially before Vekua moved to Moscow in\n1951\n, and then to Novosibirsk, always proceeded closely. In particular, the work of Ilya Vekua in the field of so-called 'singular integral equations' had a great influence on the direction of my own work, and I felt it my pleasant duty to emphasize that fact in the introduction to my monograph in this area.\nAdvised by\nAleksei Krylov\n,\nNiko Muskhelishvili\nand\nVladimir Smirnov\n, Vekua undertook research on the equations of mathematical physics at the\nUSSR Academy of Sciences\nin Leningrad for his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\n[\n7\n]\n:-\nUsing the methods of the complex variable function theory, he investigated a number of problems of static and dynamic elasticity. During that period he wrote his major works devoted to the theory of distribution of elastic waves in an infinite layer with parallel plane boundaries. These studies formed the basis of his candidate's thesis ...\nHe published two papers in\n1933\n, both joint works with A K Rukhadze and both in Russian, namely\n(\ni\n)\nProblem of torsion of a circular cylinder reinforced with a longitudinal circular rod\nand\n(\nii\n)\nTorsion and bending by transverse force of a bar composed of two elastic materials bounded by confocal ellipses\n. He returned to Tbilisi in\n1933\nand was appointed as a Junior researcher in the Faculty of Physics and Mathematics of Tbilisi State University. He also became the scientific secretary of the Mathematical Institute of the Georgian Branch of the\nUSSR Academy of Sciences\nand we now look briefly at how this was set up.\nOn\n8\nOctober\n1933\na research institute of mathematics, physics and mechanics was set up run by Tbilisi State University. Its director was\nNiko Muskhelishvili\n. On\n1\nOctober\n1935\n, at the initiative of\nMuskhelishvili\nand Vekua, the mathematics and mechanics section of the above-mentioned institute was transformed into a mathematical research institute under the auspices of the Georgian Branch of the\nUSSR Academy of Sciences\n. This Institute was incorporated into the\nGeorgian Academy of Sciences\nafter it was founded in February\n1941\n.\nIn\n1937\nVekua defended his Candidate's thesis \"Propagation of elastic waves in an infinite layer\" and, immediately afterwards, was promoted to assistant professor. In\n1939\nhe defended his doctoral thesis\n(\nequivalent in standard to a D.Sc. or\nhabilitation\n)\n\"A complex representation of solutions of elliptic differential equations and its application to boundary value problems\". The representations which Vekua introduced in this thesis, and published in papers which appeared in\n1941\nand\n1942\n, were named 'Vekua representations' by\nMuskhelishvili\n. There have been a number of papers studying Vekua representations and in recent times they have been generalised.\nThe years of World War II were difficult although the German armies never reached Tbilisi. During these hard years, Vekua served first as the dean of the Faculty of Physics and Mathematics of Tbilisi State University and later as pro-rector. He had other roles too being head of the Geometry Section of the Faculty and, outside the university, he headed the Theoretical Mechanics section of the Transcaucasian Institute of Railway Transport. After the war, in\n1947\n, he became head of a department of the Institute of Mathematics and of the Department of Mathematical and Natural Sciences of the\nGeorgian Academy of Sciences\n. He held these roles until\n1950\n.\nIn\n1951\nVekua was invited by Sergei Alekseevich Khristianovich, a mechanical engineer who was pro-rector of Moscow State University, to come to Moscow and work in the scientific institutions and higher educational institutions in that city. He left Tbilisi, going to Moscow in the autumn of\n1951\n. He was appointed head of a Laboratory of the Central Institute of Hydro-aerodynamics and also head of Theoretical Mechanics at the Moscow Physico-Technical Institute. In the following year he became a professor in the Department of Differential Equations of Lomonosov State University of Moscow. He also became a senior scientific worker at the\nSteklov\nInstitute of Mathematics of the\nUSSR Academy of Sciences\nin\n1953\n.\nThe authors of\n[\n7\n]\ndescribe some of Vekua's mathematical achievements while he was working in Moscow:-\nIn Moscow I N Vekua wrote and published a large cycle of studies devoted to the so-called theory of generalized analytic functions. An attempt to construct the theory of such functions was made back in the\n19\nth\ncentury by the Italian mathematician\nBeltrami\n. In the early\n1930\ns\nCarleman\nand Theoclorescu showed that a number of properties of analytic functions of one complex variable could be transferred to the solution of an elliptic system of two first order differential equations in the case of two real independent variables. I N Vekua created a general theory which at present forms the basis of the theory of generalized analytic functions. Using the theorems he had derived, Vekua obtained an analytic substantiation of\nM A Lavrentev\n's geometrical theory of quasiconformal mappings of plane domains, which has been recognized as one of the best achievements in the theory of functions over the last fifty years. l N Vekua's results in the theory of first order elliptic systems were included in his monograph 'Generalized Analytic Functions' which was awarded the Lenin Prize in I\n963\nThe Siberian Branch of the\nUSSR Academy of Sciences\nwas established in\n1957\nand Vekua was among those elected to the Presidium. Novosibirsk State University was constructed at Akademgorodok and when it opened in\n1959\nVekua became its first rector. At the same time he became head of the Theoretical Department of the Siberian Institute of Aerodynamics. He held these positions from\n1959\nto\n1965\nwhen, at the request of the\nGeorgian Academy of Sciences\n, he returned to Tbilisi to become Rector of Tbilisi State University. In\n1972\nhe retired as Rector and was elected President of the\nGeorgian Academy of Sciences\n. He held this position until his death in\n1977\n.\nThe authors of\n[\n7\n]\nwrite:-\nVekua was a warm-hearted person with high civic qualities. His endurance, courage and self-control evoked; delight and admiration. Though suffering from an incurable grave illness, the scientist persistently continued his research, resulting in the development of a new version of the mathematical theory of elastic shells. This version was included in his monograph \"Theory of Shells: General Methods of Construction\" which was published posthumously in Moscow in\n1982\n. The monograph was awarded the State Prize of the USSR and its English translation was published by Pitman Publishers in\n1985\n.\nIn the book Vekua sates that:-\n... the main purpose of shell theory consists precisely in constructing approximate solutions of relevant prioblems of the three-dimensional theory of elasticity.\nLeonid P Lebedev writes in a review:-\nThis monograph summarizes the author's many years of work on shell theory. In the first two chapters, which make up half of the book, the author constructs different variants of the linear theory of elastic shells by reducing three-dimensional problems to the corresponding two-dimensional ones. ... The book makes much use of the apparatus of tensor mathematics, surface theory, and the theory of generalized analytic functions. At the end of the book is a list of the author's works on shell theory.\nWe have mentioned a couple of Vekua's books but he wrote a number of others. There is\nNew Methods for Solving Elliptic Equation\ns\n(\nRussian\n)\n(1948)\nand, a book mentioned above,\nGeneralized analytic functions\n(\nRussian\n)\n(1959)\n.\nLionel Cooper\nwrites in a review of this book:-\nBy generalized analytic functions are meant functions of two real variables which obey elliptic differential equations analogous to the\nCauchy\n-\nRiemann\nequations. ... It is well and clearly written ...\nAn English translation with title\nGeneralized analytic functions\nwas published in\n1962\nand a German translation appeared in the following year.\nVekua published\nFundamentals of tensor analysis\n(\nRussian\n)\nin\n1967\n. Manindra Chandra Chaki writes in a review:-\nThe book provides a good introduction to tensor analysis and gives some of its applications to the theory of surfaces. ... The treatment of the subject is clear and rigorous.\nHis next book was\nFoundations of tensor analysis and the theory of covariants\n(\nRussian\n)\n(1978)\n. Wlodzimierz Wrona writes in a review:-\nThe book contains a systematic presentation of tensor algebra and tensor analysis with their applications to the theory of surfaces and to the theory of shells. It also gives a solid mathematical preparation for the study of the theory of elasticity. Many results of the author's own research related to special coordinate systems having applications in the general theory of elasticity, and to the theory of covariants, are included.\nAs to Vekua's personality, we quote from his friend\nLipman Bers\n[\n5\n]\n:-\n... there was nothing official or rigid in his personality. Ilya Nestorovich was a large man with a booming voice, enormously friendly and filled with joie de vivre. His courtliness was somewhat old fashioned, and when you saw him kissing ladies' hands, or officiating as \"tamada\"\n(\ntoastmaster\n)\nat a Georgian style party, or enjoying food and good wine or a good story, you forgot all about his scientific and administrative prominence. But his benevolence went beyond mere social friendliness. He was willing to help when others would not, and one could talk to him, freely and openly, about many things. His judgements were shrewd, original, and unhampered. ... Vekua's deeply rooted optimism was not based on denying or ignoring the tragic aspects of life or of history. Once he and I watched a Broadway performance of Bolt's Man For All Seasons. Vekua may not have known the details of Sir Thomas More's death, and the dilemma of an honourable and reasonable man confronting a tyrant moved him deeply. I recalled that evening when I read in an article, written for his\n70\nth\nbirthday\n(\n[\n4\n]\n)\nabout the \"strength, courage and self-control Ilya Nestorovich showed under complicated circumstances.\"\nVekua received many honours. He was elected Corresponding Member of the Academy of Sciences of the Georgian SSR in\n1944\nand, two years later, a Corresponding Member of the\nUSSR Academy of Sciences\nand also a Full Member of the\nGeorgian Academy of Sciences\n. He received the Gold Star of the Hero of Socialist Labour and five orders of Lenin. He also received much international recognition being elected to the Academy of Sciences of the German Democratic Republic, the\nGerman Academy of Scientists Leopoldina\n, the Sicilian Academy of Sciences, the Polish Society of Theoretical and Applied Mechanics, and the Danish Centre of Applied Mathematics and Mechanics. He was awarded honorary degrees from Halle University and Jena University.",
  "matematicos_citados_na_biografia": [
    "Andrei Razmadze",
    "Razmadze",
    "Nikoloz(Niko)Muskhelishvili",
    "Muskhelishvili",
    "Aleksei Nikolaevich Krylov",
    "Aleksei Krylov",
    "Vladimir Ivanovich Smirnov",
    "Niko Muskhelishvili",
    "Vladimir Smirnov",
    "USSR Academy of Sciences",
    "Georgian Academy of Sciences",
    "habilitation",
    "Steklov",
    "Beltrami",
    "Carleman",
    "M A Lavrentev",
    "Lionel Cooper",
    "Cauchy",
    "Riemann",
    "Lipman Bers",
    "German Academy of Scientists Leopoldina"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}