{
  "nome_completo": "Ingrid Daubechies",
  "nome_curto": "Ingrid Daubechies",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Daubechies/",
  "data_nascimento": "17 August 1954",
  "local_nascimento": "Houthalen, Belgium",
  "data_morte": null,
  "local_morte": null,
  "summary": "Ingrid Daubechies is a Belgium mathematician and physicist who has done important work on wavelets in image compression. She is on the Board of Enhancing Diversity in Graduate Education, an organisation which helps women get advanced degrees in mathematics.",
  "biografia": "Ingrid Daubechies\n' parents were Marcel and Simone Daubechies. Both are now retired but Marcel was a civil mining engineer while Simone was criminologist with a great interest in history which she went back to university to study as an undergraduate after she retired.\nIngrid's father encouraged her to take an interest in science while she was studying at school. However, even as a child an interest in mathematics was evident. She has written\n[\n4\n]\n:-\nI was always interested in how things worked and how to make things. For instance, I really like weaving and pottery, and I have liked this kind of craft pursuit since my childhood. But I also was interested in seeing how machinery worked, or in why certain mathematical things were true\n(\nlike the fact that a number is divisible by nine if, when you add all its digits together, you get another number divisible by\n9\n- try it with\n73512\nand\n8577\n, both multiples of\n9\n; there is no rule that is quite as simple for divisibility by\n7\n, say\n)\n.\nIn\n[\n4\n]\nDaubechies recalls other memories of her childhood:-\nWhen I was eight or nine, the thing I liked best when playing with my dolls was to sew clothes for them. I liked trying to make patterns that would fit them well - it was fascinating to me that by putting together flat pieces of fabric one could make something that was not flat at all, but followed curved surfaces. Around the same time, when I couldn't fall asleep at night, I would compute the powers of\n2\nin my head:\n1\n,\n2\n,\n4\n,\n8\n,\n16\n, ...\n(\nmultiplying by\n2\nevery time\n)\n. The numbers became very large very quickly but I would keep going quite a while. It was fascinating, again, to see how fast these numbers grew.\nAfter her school education in Belgium, Daubechies entered the Free University Brussels to read for a degree in physics. Many of the mathematicians in this archive have started out as mathematicians and have later come to apply their mathematical skills in other scientific disciplines. Daubechies, however, is one of the few who progressed in the opposite direction, starting off by training in physics. She obtained her Bachelor's degree in Physics in\n1975\nand continued to undertake research at the Free University Brussels for a doctorate in physics.\nFrom the time that she was awarded a Bachelor's degree, Daubechies became a Research Assistant in the Department for Theoretical Physics at the Free University Brussels. She held this post from\n1975\nuntil\n1984\nand, midway through this period, in\n1980\nshe was awarded her Ph.D. in physics for a thesis entitled\nRepresentation of quantum mechanical operators by kernels on Hilbert spaces of analytic functions\n. By this time she had already published quite a number of papers, having written around ten articles. In\n1978\nAn application of hyperdifferential operators to holomorphic quantization\nappeared, then a number of papers written jointly with Dirk Aerts:\nA characterization of subsystems in physics; Physical justification for using the tensor product to describe two quantum systems as one joint system; A mathematical condition for a sublattice of a propositional system to represent a physical subsystem, with a physical interpretation\n; and\nA connection between propositional systems in Hilbert spaces and von Neumann algebras\n. In a review of the third of these four papers E G Beltrametti explained the context of both this work and the second of these joint papers:-\nOne of the basic rules of Hilbert space quantum mechanics is that when two physical systems, say\nS\n1\nS_{1}\nS\n1\n​\nand S, are viewed as the pieces of a compound system S, then the Hilbert space to be associated to S is the tensor product of the Hilbert spaces\nH\n1\nH_{1}\nH\n1\n​\nand H associated to\nS\n1\nS_{1}\nS\n1\n​\nand S. This rule found little justification in the traditional logico-algebraic approach to quantum mechanics. The authors make a significant contribution to its justification.\nIn\n1981\nDaubechies went to the United States, although she continued to hold her Research Assistant position at the Free University Brussels, spending two years there undertaking postdoctoral work. Returning to Belgium she was then appointed to the tenured position of Assistant Professor in the Department for Theoretical Physics at the Free University Brussels in\n1984\n. In fact she received her first major prize in\n1984\nwhen she was awarded the Louis Empain Prize for Physics. This prestigious prize is awarded once every five years to a Belgium scientist on the basis of work done before age\n29\n.\nIn\n1987\nDaubechies returned to the United States to take up the post of Technical Staff Member at the Mathematics Research Center of AT&T Bell Laboratories, Murray Hill, New Jersey. In the same year she married A Robert Calderbank, who is also a mathematician.\nIn addition to the events we have mentioned, the year\n1987\nwas an important one for Daubechies from a mathematical point of view. Let us set the scene and put her work in context. In the early\n1980\ns J Morlet had discovered new way to represent geophysical signals. Rather than using\nFourier\ntransform methods to analyse signals he had the intuitive idea of using wavelets and later, in collaboration with Alex Grossmann, he put his intuition on a firm mathematical basis by introducing the continuous wavelet transform. In about\n1985\nDaubechies, in collaboration with Yves Meyer and Alex Grossmann, introduced a discrete approach which enabled functions to be reconstructed from a discrete set of values. It was a breakthrough by Daubechies in\n1987\n, when she constructed compactly supported continuous wavelets, which led to many important applications. Daubechies believes that she is considered a mathematician because these applications are outside physics:-\n... even as a physicist, my work was very theoretical, very mathematical. I became interested in applications of mathematics outside physics\n(\nespecially in engineering\n)\n, and that is how I am now considered a mathematician.\nAlthough she still remained on the staff at the Bell Laboratories, Daubechies took leave to take university posts. In\n1990\nshe spent six months at the University of Michigan, and in the following year she was appointed Professor in the Mathematics Department at Rutgers University, spending two years there. While at Rutgers, she published\nTen lectures on wavelets\nin\n1992\n. This important book led to her being awarded the Steele Prize for mathematical exposition by the\nAmerican Mathematical Society\nin\n1994\n. The citation for the award reads:-\nThe concept of wavelets has its origins in many fields, and part of the accomplishment of Daubechies is finding those places where the concept arose and showing how all the approaches relate to one another. The use of wavelets as an analytical tool is like\nFourier\nanalysis - simple and yet very powerful. In fact, wavelets are an extension of\nFourier analysis\nto the case of localization in both frequency and space. And like\nFourier\nanalysis, it has both a theoretical side and practical importance. ...\nIan Stewart has described a number of applications of wavelet analysis. Here are two such descriptions:-\nPerhaps the best-known application of wavelet analysis to date derived from the U.S. FBI's decision in\n1993\nto use a wavelet transform for encoding digitised fingerprint records. A wavelet transform occupies less computer memory than conventional methods for image storage, and its use was predicted to reduce the amount of computer memory needed for fingerprint records by\n93\n%. ...\nIn the past two decades, medical centres had come to employ various kinds of scanner-based imaging systems, such as computed tomography and magnetic resonance imaging, that use computers to assemble the digitised data collected by the scanner into two- or three-dimensional pictures of the body's internal structures. ... a poor digitised image can be smoothed and cleaned up by taking a wavelet transform of it, removing unwanted components, and \"detransforming\" the wavelet representation to yield an image again. The method reduced the time of the patient's exposure to the radiation involved in the scanning process and thus made the imaging technique cheaper, quicker, and safer.\nIn January\n1992\nDaubechies gave a lecture\nWavelets making waves in mathematics and engineering\nto a joint AMS-MAA meeting in Baltimore, Maryland. The lecture was published on a videocassette by the\nAmerican Mathematical Society\n. G Walter's review of the video tells us much about Daubechies' style as a lecturer:-\nMost videos of mathematicians giving lectures are not very successful. They are trying to convey ideas but the camera focuses our attention on the appearance of the speaker and his or her idiosyncrasies, for example a bright tie or a habit of pinching the nose. In this video of Ingrid Daubechies' lecture on wavelets, the reverse is true. Her manner of illustrating dilations and translations by stretching her arms contributes to an understanding of the principal concepts of wavelet theory. Furthermore, her obvious enthusiasm for the subject helps focus our attention on it and not on her, and contributes to a very successful video.\nDaubechies was a fellow of the John D and Catherine T MacArthur Foundation from\n1992\nto\n1997\nand was elected to the\nAmerican Academy of Arts and Science\nin\n1993\n. In the following year Daubechies left Bell Laboratories and took up her present position of Professor in the Mathematics Department and the Program in Applied and Computational Mathematics at Princeton University. Between\n1997\nto\n2001\nshe was Director of the Program in Applied and Computational Mathematics. The\nAmerican Mathematical Society\nfurther honoured Daubechies in\n1997\nwith the award of the Ruth Lyttle Satter Prize in Mathematics for:-\n... her deep and beautiful analysis of wavelets and their applications.\nThe\nNational Academy of Sciences\nelected Daubechies a Member in\n1998\n, then made their four yearly Award in Mathematics to her in\n2000\n:-\n... for fundamental discoveries on wavelets and wavelet expansions and for her role in making wavelets methods a practical basic tool of applied mathematics.\nShe has received many honours for her remarkable achievements other than those we have mentioned above. For example she was elected a Fellow of The Institute of Electrical and Electronics Engineers in\n1998\nand, in the same year, was awarded their Information Theory Society Golden Jubilee Award for Technological Innovation. In\n1999\nshe was elected to the\nRoyal Netherlands Academy of Arts and Sciences\n, and in\n2000\nshe received numerous honours such as an honorary degree from the Université Libre de Bruxelles and the Eduard Rhein Foundation\n2000\nBasic Research Award.\nDaubechies was awarded an honorary degree by the Université Polytechnique Fédérale, Lausanne, Switzerland\n(2001)\n, the Université Pierre et Marie Curie, Paris, France\n(2005)\n, the Universita degli Studi di Genova, Genoa, Italy\n(2006)\n, the Universiteit Hasselt, Belgium\n(2008)\nand Oxford University\n(2013)\n. She was awarded the Gold Medal of the Flemish Royal Academy of Arts and Sciences, Belgium\n(2005)\n, and the ICIAM Pioneer Prize\n(2008)\n. In\n2004\nshe was named William R Kenan Jr Professor at Princeton University.\nDaubechies was elected a\nLondon Mathematical Society\nHonorary Member in\n2007\n. In\n2015\nshe was elected a member of the National Academy of Engineering for her\n[\n7\n]\n:-\n... contributions to the mathematics and applications of wavelets.\nShe was awarded the William Benter Prize in Applied Mathematics from the City University of Hong Kong in\n2018\n; the citation records that\n[\n8\n]\n:-\nProfessor Daubechies has made exceptional contributions to a wide spectrum of scientific and mathematical subjects, and her work in enabling the mobile smartphone revolution is truly symbolic of the era. A pioneer in mathematical applications for the detection of art forgery, Professor Daubechies is a prominent supporter of encouraging greater interest in mathematics in developing countries and among women.\nHer work on wavelets led to her receiving the Fudan-Zhongzhi Science Award in\n2018\n:-\nThe award is presented for her remarkable contributions to wavelets, especially the orthogonal Daubechies wavelet and the biorthogonal CDF\n(\nCohen-Daubechies-Feauveau\n)\nwavelet, her leadership in developing wavelet theory and modern time-frequency analysis which fundamentally changed image and signal processing, her deep influence on many areas of data analysis and scientific computing, and her contribution to image compression, analogue-to-digital conversion and thresholding-based algorithms for inverse problems.\nIn the following year she was elected to membership of the\nGerman Academy of Sciences Leopoldina\nand in\n2020\nshe received the Princess of Asturias Award for Technical and Scientific Research. The jury stated\n[\n10\n]\n:-\nIngrid Daubechies has led the development of the modern mathematical theory of wavelets, which are like mathematical heartbeats that enable us to approach Van Gogh and discover his style or to listen to the music enclosed in the apparent noise of the Universe, among many other applications of all kinds. In short, they enable us to visualise what we cannot see and listen to what we cannot hear.\nOn receiving the award on\n23\nJune\n2020\n, she said:-\nI am very honoured to have been selected for this award, both by the prestige of the Award itself, as witnessed by the renown of past awardees, and by the identity of my co-awardees, each of them giants in my own personal gallery of heroes.\nShe was awarded the Wolf Prize in Mathematics in\n2023\n, becoming the first woman to receive this award. The citation reads\n[\n11\n]\n:-\nIngrid Daubechies is awarded the Wolf Prize for her work in the creation and development of wavelet theory and modern time-frequency analysis. Her discovery of smooth, compactly supported wavelets, and the development of biorthogonal wavelets transformed image and signal processing and filtering.\nHer work is of tremendous importance in image compression, medical imaging, remote sensing, and digital photography. Daubechies has also made unparalleled contributions to developing real-world applications of harmonic analysis, introducing sophisticated image-processing techniques to fields ranging from art to evolutionary biology and beyond.\nDaubechies's most important contribution is her introduction in\n1988\nof smooth compactly supported orthonormal wavelet bases. These bases revolutionised signal processing, leading to highly efficient methods for digitising, storing, compressing, and analysing data, such as audio and video signals, computed tomography, and magnetic resonance imaging. The compact support of these wavelets made it possible to digitise a signal in time linearly dependent on the length of the signal. This was a critical ingredient for researchers and engineers in signal processing to be able to rapidly decompose a signal as a superposition of contributions at various scales.\nIn subsequent joint work with A Cohen and J C Feauveau, Daubechies introduced symmetrical biorthogonal wavelet bases. These wavelet bases give up orthonormality in favour of symmetry. Such bases are much more suitable for treating the discontinuities arising at the boundaries of finite-length signals and improving image quality. Her biorthogonal wavelets became the basis for the JPEG\n2000\nimage compression and coding system.",
  "matematicos_citados_na_biografia": [
    "Fourier",
    "American Mathematical Society",
    "Fourier analysis",
    "American Academy of Arts and Science",
    "National Academy of Sciences",
    "Royal Netherlands Academy of Arts and Sciences",
    "London Mathematical Society",
    "German Academy of Sciences Leopoldina"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}