{
  "nome_completo": "Ada Isabel Maddison",
  "nome_curto": "Isabel Maddison",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maddison/",
  "data_nascimento": "13 April 1869",
  "local_nascimento": "Cumberland, England",
  "data_morte": "22 October 1950",
  "local_morte": "Martin's Dam, Wayne, Pennsylvania, USA",
  "summary": "Isabel Maddison was an English mathematician best known for her work on differential equations.",
  "biografia": "Isabel Maddison\n's parents were Mary Anderson and John Maddison, a civil servant. Isabel Maddison entered University College in Cardiff in\n1885\n. She was awarded a Clothworker's Guild Scholarship to study at Girton College, Cambridge, where she matriculated in\n1889\n. A fellow student who matriculated at Girton at the same time as Maddison was Grace Chisholm\n(\nlater\nGrace Chisholm Young\n)\n. Maddison attended lectures at Cambridge by\nCayley\n,\nWhitehead\nand\nYoung\n, and she earned a First Class degree in the Mathematical Tripos examinations of\n1892\nalthough at this time women could not formally receive a degree at Cambridge. Her fellow student\nGrace Chisholm\nalso earned a First Class degree in the same Mathematical Tripos examinations.\nShe also took\n(\nunofficially, on a challenge, with\nGrace Chisholm\n)\nthe exam for the Final Honours School in mathematics at the University of Oxford on which she out-performed all the Oxford students.\nThe first woman to earn a First Class degree at Cambridge was\nCharlotte Scott\nwho did so in\n1880\n. Five years later Bryn Mawr College, in Pennsylvania in the United States, opened. The College was founded by Joseph Taylor, a Quaker, and it was set up with Quaker beliefs although it operated as a nondenominational college. It was the first higher education institution in the United States offering graduate training for women. On\nCayley\n's recommendation,\nScott\nwas appointed there and became the first head of the Bryn Mawr Mathematics Department. After Maddison completed her studies at Cambridge in\n1892\nshe was awarded a scholarship which enabled her to spend the year\n1892\n-\n93\nat Bryn Mawr College undertaking research with\nScott\n.\nMaddison had, like\nScott\n, become interested in linear algebra through the influence of\nCayley\nat Cambridge. When she first reached Bryn Mawr College, Maddison continued to work on this topic but later, advised by\nScott\n, she began to work on singular solutions of differential equations. Although she had earned the equivalent of a First Class degree at Cambridge, Maddison still had no degree so she took the external examinations of the University of London in\n1893\nwhich allowed her to graduate with a B.Sc. with honours. Bryn Mawr College awarded her their Residential Mathematical Fellowship which funded her studies for the year\n1893\n-\n94\n. She was next awarded the Mary E Garrett European Fellowship which enabled her to spend\n1894\n-\n95\nat Göttingen in Germany. There she met again\nGrace Chisholm\nwho was studying for her doctorate under\nKlein\n. Maddison attended lectures by\nKlein\n,\nHilbert\nand\nBurkhardt\nduring her year at Göttingen where she played a full part in the exciting mathematical atmosphere of the department.\nIn\n1895\nMaddison returned to Bryn Mawr College to take up the position of assistant to the president of the College, Carey Thomas, as Martha Carey Thomas preferred to be known. Carey Thomas, who had a doctorate in linguistics, had been appointed as the first dean at Bryn Mawr College when it opened and she had become the second president when James E Rhoads retired in\n1894\n. Until\n1902\nCarey Thomas held both the position of dean and of president so Maddison had a busy life as her assistant. It was a position which took up so much of her time that she was unable to continue with mathematical research but she did complete her doctorate under\nScott\n's supervision. She was awarded a Ph.D. in\n1896\nfor her thesis\nOn Singular Solutions of Differential Equations of the First Order in Two Variables and the Geometrical Properties of Certain Invariants and Covariants of Their Complete Primitives\nand in the same year appointed as Reader in Mathematics at Bryn Mawr. Her paper\nOn certain factors of c- and p- discriminants and their relations to fixed points in the family of curves\nwhich she published in the\nJournal of Pure and Applied Mathematics\nwas based on her doctoral dissertation was awarded the Gambel Prize. She also published an English translation of\nKlein\n's address to the\nGöttingen Academy\nin the\nBulletin of the American Mathematical Society\nin\n1896\nand in the Bulletin of\n1897\na\nNote on the History of the Map Coloring Problem\n.\nIn\n1897\n, she was one of the first women to join the\nAmerican Mathematical Society\n. See\nTHIS LINK\n.\nMaddison remained at Bryn Mawr until she retired in\n1926\n. One important piece of work where she did use her mathematical skills was in\n[\n2\n]\n:-\n... a statistical study for the American Association of University Women of the health, marital status, children, occupations, financial status, and education of children of women college graduates between\n1869\nand\n1898\n.\nShe did regret not having time for mathematical research, saying that she felt a bit:-\n... ashamed of having deserted mathematics for a less rarefied atmosphere of work among people and things.\nAfter Maddison retired she returned to England for a time but later went back to Pennsylvania where she spent time writing poetry rather than mathematics. Her will gave a large sum of money in the memory of Carey Thomas\n(\nwho died in\n1935)\nto be used as pension funds for non-faculty members of staff at Bryn Mawr. In a tribute by the Board of Directors after her death she was remembered for:-\n... her natural and gentle sweetness, her love of youth, and her sensitivity.",
  "matematicos_citados_na_biografia": [
    "Grace Chisholm Young",
    "Cayley",
    "Whitehead",
    "Young",
    "Grace Chisholm",
    "Charlotte Scott",
    "Scott",
    "Klein",
    "Hilbert",
    "Burkhardt",
    "Göttingen Academy",
    "American Mathematical Society",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}