{
  "nome_completo": "Ivan Matveevich Vinogradov",
  "nome_curto": "Ivan Matveevich Vinogradov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vinogradov/",
  "data_nascimento": "14 September 1891",
  "local_nascimento": "Milolyub, Velikie Luki, Pskov province, Russia",
  "data_morte": "20 March 1983",
  "local_morte": "Moscow, Russia",
  "summary": "Vinogradov used trigonometric series to attack deep problems in analytic number theory.",
  "biografia": "Ivan Matveevich Vinogradov\n's mother was a teacher and his father, Matvei Avraam'evich Vinogradov, was priest in Milolyub, a village in the Velikie Luki district of the Pskov province of Russia. The usual education for the son of a priest was in a special ecclesiastic school, but because Ivan showed scientific skills his parents decided in\n1903\nto send him to school were he would receive a scientific rather than classical education. By\n1903\nIvan's father was a priest at the Church of the Holy Shroud in Velikie Luki, and it was in that town that Ivan attended school from\n1903\nto\n1910\n.\nHe studied at the university in St Petersburg, entering the Faculty of Mathematics and Physics there in\n1910\n. Two of his teachers there,\nA A Markov\nand Ya V Uspenskii, both had interests in\nprobability\nand\nnumber theory\nand Vinogradov's interest in number theory stems from this period. He graduated with his first degree in\n1914\nand, because of his outstanding work on the distribution of\nquadratic residues\nand non-residues, he was encouraged to continue his studies, supervised by Uspenskii.\nHis master's degree was completed in\n1915\n(\nsee\n[\n12\n]\nand\n[\n13\n]\n)\n:-\nWhile he was successfully preparing for the Master's examination with its very broad syllabus, Vinogradov was working on very difficult problems in the theory of numbers ...\nHe continued to work on quadratic residues, having been awarded a scholarship in\n1915\non the recommendation of\nSteklov\n. He generalised results of\nVoronoy\non the\nDirichlet\ndivisor problem which allowed him to obtain estimates for the number of integral points between a given curve\ny\n=\nf\n(\nx\n)\ny = f (x)\ny\n=\nf\n(\nx\n)\nand the\nx\nx\nx\n-axis.\nVinogradov was very single minded in his approach to mathematics and succeeded to press ahead with deep research despite the difficulties arising first from World War I, and then from the upheaval caused by the Russian revolution. Despite his best efforts, there were, of course, problems which he could not overcome. Mainly these concerned the lack of communication between Russia and the West so that he was unaware of results of\nWeyl\nand others which was highly relevant to his work and, similarly, mathematicians in the West were largely unaware of Vinogradov's results.\nHe taught at the State University of Perm from\n1918\nto\n1920\n. The State University of Perm, founded in\n1916\n, was called Molotov University for a time, and is now the Gorky State University. His first appointment was as a\ndocent\n, but after a year he was promoted to professor. In\n1920\nhe returned to St Petersburg to two posts, one as professor at the Polytechnic Institute, and the other as docent at the university. He gave a course on number theory at the university which was to be the basis for his famous text on the subject\nFoundations of number theory\n. He was promoted to professor at the university in\n1925\n, becoming head of the probability and number theory section.\nFrom around\n1930\nhe became heavily involved with mathematics administration on a national level but his research work was amazingly unaffected by the heavy workload. Around this time he did all the organizational groundwork for the foundation of the\nSteklov\nMathematical Institute at the\nUSSR Academy of Sciences\nin Leningrad. He become the first director of the\nSteklov\nInstitute in\n1934\n, moving to Moscow when the Academy moved the Institute there, and continuing to hold the directorship until his death. As an indication of his research activity during this period it is worth noting that he published around\n12\npapers in each of the years\n1934\nto\n1938\n. How he achieved this on top of his heavy administrative duties is quite remarkable.\nDuring his time as head of the\nSteklov\nInstitute, Vinogradov discussed with\nLuzin\nthe research areas which should be emphasised in the Soviet mathematical Institutes. These were: fundamental questions of analysis and mathematical physics; special areas of function theory of real variables; number theory and\nGalois theory\n; probability theory; theoretical mechanics; applied methods of analysis.\nLet us now look a little at the main mathematical contributions made by Vinogradov. The importance of trigonometric sums in the theory of numbers was first shown by\nWeyl\nin\n1916\n. In the\n1920\ns the work of\nHardy\nand\nLittlewood\ndeveloped\nWeyl\n's methods to attack other problems in\nanalytic number theory\n. However it was Vinogradov who, in a series of papers in the\n1930\ns, brought the method to its full potential. His methods reached their height in\nSome theorems concerning the theory of\nprime numbers\nwritten in\n1937\nwhich provides a partial solution to the\nGoldbach conjecture\n. In it Vinogradov proved that every sufficiently large odd integer can be expressed as the sum of three primes. In\n[\n8\n]\n(\nor\n[\n9\n]\nfor the articles\n[\n8\n]\nand\n[\n9\n]\nare identical\n)\nthe authors write:-\nHe introduced and developed two fundamental methods, which could be briefly described as 'the bilinear form technique' and 'the mean value theorem'. They have enabled progress to be made on a whole range of problems. For example, in what is probably his most celebrated piece of work\n[\nSome theorems concerning the theory of prime numbers\n(1937)]\n, he was able to combine the bilinear form technique with the\nHardy\n-\nLittlewood\nmethod so as to reduce the\nGoldbach\nternary problem to that of checking a finite number of cases.\nRecent research on the type of problems studied by Vinogradov shows that his methods are still the most powerful available to obtain yet further results.\nVinogradov made many other contributions, for example to the theory of distribution of power residues, non-residues, indices and\nprimitive roots\n. He often returned to the topic of his first research paper on the error term in an asymptotic formula discovered by\nGauss\n. The book\n[\n2\n]\ncontains sixteen articles by Vinogradov which he selected himself as those he felt were most significant. The papers included:\nOn the distribution of power residues and nonresidues\n(1918)\n;\nOn the distribution of fractional parts of values of a function of one variable\n(1926)\n;\nOn\nWaring\n's\ntheorem\n(1928)\n; and\nRepresentation of an odd number as a sum of three primes\n(1937)\n. Two of his monographsThe\nmethod of trigonometric sums in the theory of numbers\n, and\nSpecial variants of the method of trigonometric sums\nare also in the book.\nHis influence outside the Soviet Union was soon apparent. Even in\nEdmund Landau\n's three volume work on number theory, published in\n1927\n, prominence is given to Vinogradov's methods. However he seldom travelled outside the Soviet Union although he did visit St Andrews in\n1958\nas the leader of the Soviet delegation to the\nInternational Mathematical Union\n(\nIMU\n)\n. He then went on to the International Congress at Edinburgh. Chandrasekharan, a former president of the IMU wrote\n(\nsee\n[\n8\n]\nor\n[\n9\n]\n)\n:-\nVinogradov headed the U.S.S.R. delegation to the\n3\nrd\nGeneral Assembly of the I.M.U. at St Andrews, which was held just before the International Congress of Mathematicians at Edinburgh in\n1958\n. ... Vinogradov headed the Soviet delegation again at the\n5\nth\nGeneral Assembly at Dubna in\n1966\n.\nHe and I used to converse in English. We have met for long hours, sometimes discussing mathematics and mathematicians, at other times about other things. I had no difficulty in understanding his English, and his responses showed that he understood what I said. I know that he could read and understand German just as well, though he never particularly wanted to speak German.\nHe did welcome mathematicians who visited him in Moscow. One such visitor, Chandrasekharan, wrote:-\nHe was a marvellous and meticulous host. ... No one who has been at his home as a guest can forget his bountiful hospitality.\nThe authors of\n[\n24\n]\n(\nsee also\n[\n25\n]\n)\n, however, criticise Vinogradov saying that he was a typical loner with a difficult character, interested only in his mathematical research and in strengthening his Institute.\nAn international conference was held in Moscow to mark his\n80\nth\nbirthday. Vinogradov gave a dinner for the participants at his own expense and personally addressed the invitation cards. The proceeding of the conference were published in\n1973\nwith Vinogradov as editor-in-chief.\nVinogradov received many honours for his mathematical achievements. He received the highest honour the\nUSSR Academy of Sciences\ncould give, namely the Lomonosov Gold Medal. He also received many other Soviet honours such as: Hero of the Soviet Union, on two occasions; Order of Lenin, on five occasions; Order of the Hammer and Sickle, on two occasions; the Order of the October Revolution; The Stalin Prize; and the Lenin Prize. He was elected to the\nRoyal Society of London\nin\n1942\nand to the\nLondon Mathematical Society\nin\n1939\n.\nAlways a fit man, and proud of his physical fitness, he remained healthy and active into his early\n90\ns.\nOne hundred years after his birth, on\n14\nSeptember, a conference on analytic number theory was organised, followed by 'Vinogradov lectures'. The article\n[\n26\n]\ngives summaries of the\n10\none hour 'Vinogradov lectures' devoted to number theory and related problems in algebraic geometry.",
  "matematicos_citados_na_biografia": [
    "A A Markov",
    "probability",
    "number theory",
    "quadratic residues",
    "Steklov",
    "Voronoy",
    "Dirichlet",
    "Weyl",
    "docent",
    "USSR Academy of Sciences",
    "Luzin",
    "Galois theory",
    "Hardy",
    "Littlewood",
    "analytic number theory",
    "prime numbers",
    "Goldbach conjecture",
    "Goldbach",
    "primitive roots",
    "Gauss",
    "Waring",
    "Edmund Landau",
    "International Mathematical Union",
    "Royal Society of London",
    "London Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}