{
  "nome_completo": "Ivor Malcolm Haddon Etherington",
  "nome_curto": "Ivor Etherington",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Etherington/",
  "data_nascimento": "8 February 1908",
  "local_nascimento": "Lewisham, Kent, England",
  "data_morte": "1 January 1994",
  "local_morte": "Easdale, Argyllshire, Scotland",
  "summary": "Ivor Etherington was an English mathematician who worked on general relativity, and later on genetics and introduced genetic algebras.",
  "biografia": "Ivor Etherington\n's parents were Bruce Etherington and his wife Annie Margaret Ferguson. Bruce Etherington was born in\n1874\nin India to the missionaries William Duke Etherington and his wife Ellen Symonds. He was brought up in England and his departure on missionary work was reported in the\nWestern Times Newspaper\non\n15\nMay\n1899\n[\n1\n]\n:-\nBaptists are much interested in the departure of one of their members Mr Bruce Etheringyon, B.A. as a missionary to Ceylon, the son of the Rev W D Etherington, M.A. of Babbicombe, for\n17\nyears missionary in India. He carries with him a Kodak camera, a memento of his friends, and the special wishes of the Sunday School and Y.P.S.C.E. with both of which he was identified. He sails on Thursday next.\nBruce Etherington married Annie Margaret Ferguson who born about\n1873\nin Ceylon\n(\nnow Sri Lanka\n)\nbut, at the age of seven, on\n3\nApril\n1881\n, she was living in Hougham, Kent, England. Her father, John Ferguson\n(1842\n-\n1913)\n, was born in Tain, Scotland while her mother Charlotte Haddon was born in Middlesex in\n1839\n. They were also missionaries.\nBruce Etherington returned to England from Ceylon on the\n4\nth\nApril\n1905\n[\n2\n]\nbut the family, consisting of Bruce, Annie Margaret, and their two children E Margaret Etherington\n(\nborn about\n1904)\nand Bruce Etherington Jr, were back in Ceylon when Bruce Etherington Sr. died on\n9\nOctober\n1907\nat the General Hospital in Colombo, Ceylon\n(\nnow Sri Lanka\n)\n. At this time Annie Margaret was carrying Ivor, the subject of this biography, and she returned to England with her two children. The unveiling of a commemorative plaque to Bruce Etherington was reported in the\nWestern Times Newspaper\non\n12\nOctober\n1908\n[\n3\n]\n:-\nMention was made of the zeal and enthusiasm of the late Mr Etherington, who was himself the son of a former Indian missionary.\nThe plaque is mounted in Upton Vale Baptist Church, Torquay, Devonshire, England.\nIn\n1913\n, when Ivor was five years old, his mother remarried. Her second husband was Edwin Duncombe de Rusett\n(1873\n-\n1934)\nwho was also being a Baptist minister. Edwin was a widower with three children David Edwin de Rusett\n(1903\n-\n1978)\n, Frances Edith de Rusett\n(1905\n-\n2008)\nand Dorothea May de Rusett\n(1907\n-\n1987)\n. Edwin and Annie Margaret had two children, John Duncombe de Rusett\n(1915\n-\n1990)\nand Alan William de Rusett\n(1916\n-\n1974)\n. By the end of\n1916\n, Ivor was the sixth of a family of eight. Alastair Gillespie writes\n[\n7\n]\n:-\nThese early years were happy ones and Ivor recalled them with great warmth. Life in a large family of lively intelligent people formed the grounding of Ivor's education. Before joining the ministry, his stepfather had been a naval engineer and he maintained his interest in matters practical after joining the Church. Their house was full of gadgets which stimulated infectious curiosity. When he was seven, Ivor invented a meccano-based contraption for sending the cruets round the dining table. Unfortunately it was not allowed to be used until after lunch on Sundays! He showed early signs of his lifelong interest in mathematics when he entertained himself during his stepfather's sermons by factorising the hymn numbers.\nIn fact Edwin Duncombe de Rusett's father, Edwin William Rusett, had been a naval architect and Edwin had trained as an engineer and worked for six years in that work before training for the ministry at Corpus Christi College, Cambridge. He was minister at College Road Baptist Church, Harrow, from\n1915\nand Ivor spent the next six years at Harrow. Edwin made use of his engineering expertise during the years of World War I, working for the Ministry of Munitions in addition to his work as a Baptist Church minister. In\n1921\nEdwin was asked to found a Free Church at Thorpe Bay in Essex and the family moved there. In\n1922\n, Ivor was sent to Mill Hill School, North London, where he quickly developed a love for mathematics under the expert teaching of the Senior Mathematics Master, Herbert Coates. Mill Hill School, founded in\n1807\nby non-conformist merchants and ministers, was an excellent boarding school for boys. Ivor made a friend at Mill Hill, fellow pupil John Ffoulkes Edwards, who played an important role in Ivor's future career.\nIn\n1924\n, Edwin, in partnership with A H Page, founded Thorpe Hall School where Ivor's two younger half-brothers were educated. Ivor himself, sometimes taught at the school. In\n1927\nEtherington matriculated at Hertford College, Oxford where he studied mathematics. His tutor was Bill Ferrar who had been appointed to Oxford in\n1925\nafter spending two years as a Senior Lecturer at the University of Edinburgh working under Edmund Whittaker. Etherington was a first class student in the examinations at the end of his first year but after this his time to study became restricted because he became Secretary of the Hertford College branch of the Student Christian Movement. His upbringing had seen him surrounded by a deeply religious family and Etherington felt that he had to undertake Christian duties out of respect to his family, although his own attitude towards religion was that of a sceptic. His work for the Student Christian Movement took him away from his mathematical studies, so he only obtained a Second Class degree when he graduated from Oxford.\nAt this stage, although Etherington had hoped for an academic career, he felt that his performance in the final examinations would mean that he stood no chance. However, his tutor\nBill Ferrar\nsaw that Etherington had mathematical talents far beyond what his Second Class degree indicated, and contacted\nEdmund Whittaker\nin Edinburgh recommending Etherington for research towards a Ph.D. in the general theory of relativity advised by\nWhittaker\n. He was accepted and, after undertaking research in Edinburgh, was awarded a Ph.D. by the University of Edinburgh in\n1932\nfor his thesis\nOn Relativistic Cosmology, and the Definition of Distance in General Relativity\n. Although he was working on general relativity, he published the following two papers in\n1932\n:\nOn errors in determinants\nand\nA simple method of finding sums of powers of the natural numbers\n. He published a paper,\nOn the definition of distance in general relativity\n, based on his doctoral thesis, in the\nPhilosophical Magazine\nin\n1933\n. The paper begins:-\nIn recent papers Professor\nE T Whittaker\nand\nH S Ruse\nhave discussed the problem of defining, in a general Riemannian space-time, the concept of distance between two particles, as distinct from that of interval\n(\nor integrated line element\n)\nbetween two events. The problem has also been considered by Dr R C Tolman with reference to particular metrics.\nRuse\n's procedure is purely mathematical, being a natural extension of the concept of spatial distance in Special Relativity.\nWhittaker\nand Tolman, on the other hand, related their definitions to the astronomical methods of calculating great distances, such as those of the extragalactic nebulae. These methods depend ultimately on a comparison of absolute and apparent brightness, it being assumed that brightness decreases with the square of the distance; or, alternatively, on a similar comparison of absolute and apparent size. It is the purpose of the present paper to investigate definitions which translate that procedure more exactly.\nPerhaps the most remarkable fact about this paper is that\n74\nyears later, it was thought worthy of republication. How many mathematicians can say that their doctoral thesis was republished\n74\nyears after its first appearance! Jaume J Carot, reviewing the republished paper, writes:-\nThis is a reprint of a beautiful paper by I M H Etherington, written in the early times\n(1933)\nof the theory of general relativity. It deals with the very important issue of defining, in the general relativistic context\n(\ni.e., in an arbitrary space-time\n)\n, the notion of\n(\nspatial\n)\ndistance between two particles, this being relevant in the areas of observational astrophysics and cosmology. The paper emerged in the context of an on-going discussion amongst\nWhittaker\n,\nRuse\nand Tolman on this central concept. Using very unsophisticated mathematical tools and concepts\n(\nnormal coordinates and the very notion of tensorial invariance\n)\n, Etherington managed to prove what is nowadays called the 'reciprocity theorem for null geodesics', which states, roughly speaking, that many geometric properties are invariant when the roles of the observer and the source are exchanged in astronomical observations, this holding in any general space-time, regardless of its geometry.\nAfter the award of his doctorate, Etherington was appointed to Chelsea Polytechnic where he taught for the year\n1932\n-\n33\n. During this year he shared a flat with his school friend Ffoulkes Edwards. After only one year, he was appointed to a lectureship at the University of Edinburgh and taught there for\n41\nyears until he retired at the age of\n66\nin\n1974\n. He had more than shown that\nFerrar\n's faith in the Second Class Honours student was fully justified with his brilliant thesis. To emphasise his achievements we note that, at the age of\n26\n, he was elected to the\nRoyal Society of Edinburgh\non\n5\nMarch\n1934\n. The year\n1934\nwas also when he married the school teacher Elizabeth Goulding; they had two daughters Donia and Judy. Ivor and Betty Etherington\n[\n8\n]\n:-\n... were very active in the anti-fascist movement. As the situation in Europe deteriorated, their home became a sanctuary to a large number of refugees seeking to start new lives beyond the reach of Nazi persecution. The Etheringtons, with the help of anyone else they could involve, managed to effect the escape of some\n32\npeople from Germany. Betty even undertook a journey to Germany herself just before the outbreak of war to smuggle back the belongings of escaping refugees.\nEtherington's friendship with Ffoulkes Edwards was to set the path for his research for the rest of his career. Ffoulkes Edwards was studying medicine at University College Hospital, London and after he took up his lectureship in Edinburgh, Etherington began a long correspondence with him on blood group inheritance. They wrote three papers all with the title\nBlood Group Inheritance\nwhich were published in\nNature\nin\n1935\n,\n1935\n, and\n1938\n. They begin the first of these papers writing:-\nSeveral theories of the inheritance of human blood groups have been proposed, but none has been completely satisfactory.\nThe importance of this work for Etherington's future research was that it led him to study non-associative algebras which he called genetic algebras. His first paper on these algebras was titled\nGenetic algebras\nand published in\n1939\n. For a list of Etherington's papers see\nTHIS LINK\n.\nTo see the motivation for Etherington's research in this area we quote from the introduction to his paper\nNon-associative algebra and the symbolism of genetics\npublished by the\nRoyal Society of Edinburgh\nin\n1941\n:-\nThe statistical material of genetics usually consists of frequency distributions - of genes, zygotes and mating couples - from which new distributions referring to their progeny arise. Combination of distributions by random mating is usually symbolised by the mathematical sign for multiplication; but this sign is not taken literally for the simple reason that the genetical laws connecting the distributions of progenitors and progeny are inconsistent with the laws governing multiplication in ordinary algebra. ... However, there is no insuperable reason why the genetical sign of multiplication should not be taken literally; for it is possible with any particular type of inheritance to construct an \"algebra\" - distinct from ordinary algebra but of a type well known to mathematicians - such that the laws governing multiplication shall represent exactly the underlying genetical situation. These \"genetic algebras\" are of a kind known as \"linear algebras,\" .... It is not suggested that the use of ordinary algebraic methods in conjunction with the specific principles of genetics will not lead to correct results. It seems, however, that the systematic use of genetic algebras would simplify and shorten the way to their attainment, and perhaps enable much more difficult problems to be tackled with equal ease. The construction of genetic algebras has been described in a somewhat abstract way in a previous paper\n(\nEtherington,\n1939)\n, .... Here I propose to consider the symbolism more from the geneticist's point of view, applying it to some simple population problems, without going into the details of the mathematical background. It will be recognised that the current treatment of such problems does in reality make use of genetic algebras without noticing them explicitly. By elaborating the symbolism and adapting it to more complicated genetical premises..., it should be possible to avoid the laborious complexity which other methods in such cases would involve. Only elementary mathematical knowledge is assumed, and it is hoped that this paper will be found understandable by geneticists whose mathematical knowledge is quite limited. ... I am indebted to Dr J Ffoulkes Edwards for a lengthy correspondence in which this paper germinated ...\nEtherington was awarded a D.Sc. in\n1941\nfor his thesis\nResearches in non-associative algebra\n. We writes in the Introduction:-\nI wish that this thesis may not be judged as a finished achievement in biological investigations but may be judged primarily as a contribution to algebra, suggested by biological problems, and perhaps having possibilities of applications beyond the simple ones so far demonstrated.\nAs well as genetic algebras, Etherington introduced train algebras. He explained what train algebras were in the introduction to\nNon-commutative train algebras of ranks\n2\nand\n3\n(1951)\n:-\nThe algebras considered here are non-commutative and non-associative\n(\ni.e. not necessarily commutative or associative\n)\nin multiplication, and are linear over a field which is assumed commutative, associative and non-modular. They are not necessarily of finite order. Train algebras arose in the study of genetic algebras, which provide simplified mathematical models of the transmission of genes in sexual reproduction.\nIn\n1981\n, in the review\n[\n6\n]\n, Etherington wrote about his own contributions to genetic algebras:-\nI initiated the study of genetic algebras in several papers between\n1939\nand\n1951\n... . I was intrigued by the unusual properties of these algebras, which were quite unlike anything in the literature. I also thought that, from the point of view of geneticists, the subject had a future. My belief was fortified by kindly letters from\nJ B S Haldane\nand\nLancelot Hogben\n, and still more by the appearance of R. D. Schafer's seminal paper in\n1962\nin 'Mathematica Scandinavica'; also by Olav Reiersol's paper in\n1949\nin the 'American Journal of Mathematics'. Over the years, from\n1966\nonwards, many papers about genetic algebras have appeared and are still appearing. Frankly, I am unable to keep up with them, so that I am no longer the expert on the subject.\nOur colleague, Colin Campbell, was a student at the University of Edinburgh in the early\n1960\ns and was taught by Etherington. Colin writes\n[\n4\n]\n:-\nAs a student at Edinburgh University in the early\n1960\ns I very much remember Dr Etherington\n(\nor Dr I H M Etherington but certainly not Ivor Etherington\n)\n. He had a slightly bumbling style as a lecturer but his lectures were always well prepared and interesting. He came across as a quiet\n(\nand very shy\n)\nbut kind man for whom, over the years, I had a high regard. I was pleased to note his promotion from Doctor to Professor.\nEtherington was promoted successively to Senior Lecturer, Reader and, in\n1972\n, to a personal chair. After he retired in\n1974\nthe University gave him the title of the title Professor Emeritus. He served the\nEdinburgh Mathematical Society\nduring his career, as secretary for ten years between\n1933\nand\n1944\n, as editor of the\nEdinburgh Mathematical Notes\nand as President of the Society in\n1947\n-\n48\n. He was awarded the Keith Prize by the Royal Society of Edinburgh in\n1958\n. He was a faithful attender of the EMS Colloquia in St Andrews as the set of portraits above shows. After he retired in\n1974\nhe went to live permanently in the holiday cottage he owned at Easdale on the Argyllshire coast. This cottage had, for many summers, been home to the family as the children grew up.\nLet us end this biography by giving a quote from\n[\n8\n]\nconcerning Etherington's interests outside mathematics:-\nHe had a wide range of interests in all manner of things, a sharp intellect and an impish sense of humour. He had a reading knowledge of seven foreign languages, not to mention Esperanto, and harboured ambitions to read\n(\nthough not to speak\n)\nChinese. He obtained some books on Chinese and a Chinese mathematical dictionary, confessing in typically modest fashion to making just a little progress with the language. In some autobiographical notes he left, he wrote 'If I live, as planned, to age\n100\n, I may just manage it with a year or two to spare. Anyhow I guess you can sell these books and get more than I paid for them'. He also had a lifelong love of music and particularly enjoyed playing the piano, especially Beethoven sonatas. He had learnt the rudiments of piano-playing from his friend John Ffoulkes Edwards and started to teach himself, but later received more formal instruction on the insistence of his step-grandmother.",
  "matematicos_citados_na_biografia": [
    "Bill Ferrar",
    "Edmund Whittaker",
    "Whittaker",
    "E T Whittaker",
    "H S Ruse",
    "Ruse",
    "Ferrar",
    "Royal Society of Edinburgh",
    "THIS LINK",
    "J B S Haldane",
    "Lancelot Hogben",
    "Edinburgh Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}