{
  "nome_completo": "Henryk Iwaniec",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iwaniec_Henryk/",
  "data_nascimento": "9 October 1947",
  "local_nascimento": "Elblag, Poland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Henryk Iwaniec is a Polish born mathematician who has worked in the United States since 1983 . He has produced remarkable results in number theory for which he has received many awards. He is also the author of several highly praised books.",
  "biografia": "Henryk Iwaniec\nis a twin. He was born in the city of Elblag in Poland eight hours before his brother\nTadeusz Iwaniec\n. Elblag is an industrial city in the north of Poland, near the Baltic coast about\n50\nkm east of Gdańsk. When Henryk and\nTadeusz\nwere six years old they began their elementary education at a school in Elblag. There was no academic tradition in the family but Henryk's parents encouraged their boys to learn and he said\n[\n10\n]\n:-\n... especially my mother, created a great atmosphere for learning, encouraged us and showed faith in us.\nThe boys continued to study at the Elblag elementary school completing the course there in\n1961\n. There was no reason for either of them to have any special interest in mathematics at this time. Their parents wanted them to have an education that would set them up to have good jobs so, later in\n1961\n, they both entered the Elblag Technical High School. At this school they were taught much about machines and technology but soon both developed a passion for mathematics. In many ways this was a result of mathematics competitions. At first they participated in school competitions, then in competitions at a higher level in Gdańsk. The Gdańsk University of Technology ran a mathematics club and both boys were sent by Aleksander Kociołkowski, director of the Elblag Technical High School, to take part in the Gdańsk club once a month.\nWhen the boys reached the Third Grade at the Elblag Technical High School they began to take part in the Mathematical Olympiad Competitions. They were immediately successful in the Olympiad, both taking part in the International Mathematical Olympiad in\n1965\nand\n1966\n. They both won silver medals in\n1966\n.  As a result of their successes in mathematical competitions they received special treatment from their High School mathematics teacher Andrzej Wendecker. Henryk Iwaniec said he was\n[\n10\n]\n:-\n... a wonderful man and pedagogue. He had a habit that when he took a student to answer, he would put their notebook on the table. When the student gave wrong answers or could not answer at all, he would gradually move the notebook towards the edge of the table until it fell on the floor. It looked quite colourful and dramatic. As far as I remember, my notebook never lay on the floor. After a while, the teacher did not demand anything from me or my brother, we did not even have to do homework. When there was a test, he asked us to leave the room and not to disturb our classmates. Everyone understood this after our successes in the Olympiads. Then we had time to do homework from another subject or prepare for the next lesson, for example Polish.\nThe Iwaniec twins graduated from the Elblag Technical High School in\n1966\nand by that time both knew that they wanted to study mathematics at university. The mathematics taught at the High School was only a small part of what they knew by this time since they had studied more advanced mathematics on their own. They stimulated each other by asking questions and working together trying to solve them. They never competed, but were always supportive of each other. The best university for the boys to study mathematics was Warsaw University but there was a problem. Government regulations required students to study at local universities and Warsaw was certainly far from Elblag. This problem was overcome, however, since winning Olympiads gave them the privilege of choosing where to study, also to enter without taking the entrance examinations. Henryk was relieved at this since, although the mathematics entrance examination for Warsaw University would have posed no problem, the compulsory Russian language examination would have presented a problem. They were relieved to enter Warsaw University in\n1966\nwithout needing to take these examinations.\nAlthough Henryk and\nTadeusz\nwere equally enthusiastic about mathematics, as the twins had nearly identical interests, they decided that they should specialise in different areas of mathematics. At the end of Henryk's first year of study, Andrzej Schinzel invited him to attend and to give talks in his number theory seminar at the Mathematics Institute of the\nPolish Academy of Sciences\n. Schinzel\n(1937\n-\n2021)\nhad been student of\nWacław Sierpiński\nand had been awarded a Ph.D. from the\nPolish Academy of Sciences\nin\n1960\nfor his thesis\nOn some problems in the arithmetic theory of continued fractions\n. Iwaniec writes\n[\n26\n]\n:-\nEarly on I was fascinated by analytic number theory because of the large variety of tools which are used to establish results of an arithmetical flavour. I was particularly impressed by the work of\nYu V Linnik\n. I started alone on sieve methods while Professor Schinzel provided general advice, and also helped with editorial matters.\nBy\n1970\n, while still an undergraduate, Iwaniec had two papers accepted for publication. The first,\nOn the error term in the linear sieve\n, had been submitted to\nActa Arithmetica\non\n5\nJanuary\n1970\n. The paper begins\n[\n15\n]\n:-\nThe aim of this paper is to improve certain results of Jurkat and Richert concerning the linear sieve and obtained by Selberg's method. In the paper a variant of\nBrun\n's method is used, which was considered earlier in an unpublished manuscript of B Roser.\nHans-Egon Richert\n(1924\n-\n1993)\nwrites in the review\n[\n19\n]\n:-\nThe author proves a new version of the \"best possible\" form of the\nSelberg\nsieve. However his method rests on the\nBrun\nsieve which corresponds to some unpublished work of Rosser. Moreover, by using non-elementary results from prime number theory, he obtains an improved form of the error term. This enables him to improve upon a result regarding a problem of\nJacobsthal\n:\nFor r given let\nC\n0\n(\nr\n)\nC_{0}(r)\nC\n0\n​\n(\nr\n)\ndenote the maximal length of the sequence of consecutive integers, each divisible by one out of the first r primes. Then\nC\n0\n(\nr\n)\n<\n<\nr\n2\nlog\n⁡\n2\nr\nC_{0}(r) << r^{2}\\log^{2}r\nC\n0\n​\n(\nr\n)\n<\n<\nr\n2\nlo\ng\n2\nr\n.\nThe paper\nPrimes of the type\nφ\n(\nx\n,\ny\n)\n+\nA\n\\varphi (x, y) + A\nφ\n(\nx\n,\ny\n)\n+\nA\nwhere\nφ\n\\varphi\nφ\nis a quadratic form\n, which Iwaniec submitted to\nActa Arithmetica\non\n24\nJuly\n1971\n, was \"In memory of\nW Sierpinski\n\" and had the following acknowledgement:-\nI wish to express here my best thanks to Professor A Schinzel for his valuable suggestions and the assistance in the preparation of this paper.\nAlthough he still had not been awarded his Master's Degree, the university regulations allowed for him to request to be examined for his Ph.D. using one of his first two accepted papers as a thesis. He used one of these papers for his Master's Degree which he was awarded in\n1971\nbut choose not to be examined for his Ph.D. at this time since it required him to pass an examination in Marxist philosophy.\nFrom the beginning of his studies at the University of Warsaw, Iwaniec met Katarzyna\n(\nknown as Kasia\n)\nwho was a fellow student of mathematics in the same class. They became close friends and married in\n1971\n, immediately after graduation. They had two children, Irena\n(\nknown as Irenka, born about\n1973)\nand Anna\n(\nknown as Ania, born about\n1978)\n. Irenka studied art at Cooper Union in New York while Ania studied engineering at Caltech, was awarded a doctorate in medical engineering for her thesis\nAn Experimental Analysis of the Characteristic Behaviors of an Impedance Pump\nin\n2005\nand became a professor at the Keck Graduate Institute.\nIwaniec was employed at the Institute of Mathematics of the\nPolish Academy of Sciences\nfrom\n1971\nbut waited six months before taking his Ph.D. examination to give himself time to prepare for the Marxist philosophy examination. In\n1972\nhe asked Władysław Krajewski, a professor of the philosophy of science, to examine him on Marxist philosophy. He explained how Krajewski treated him with great kindness despite the fact that he had not attended any lectures on the subject\n[\n10\n]\n:-\nThe professor first asked me what solipsism was. I answered him something, because I had read about it before. Then he asked if I liked physics. I replied that I did. \"So what is\nHeisenberg\n's uncertainty principle?\" he asked. Of course, I replied, trying to keep the exam topic as long as possible. He must have sensed my intentions, because then he said: \"You know, this has to be an exam on Marxist philosophy, I have to ask you questions from that area.\" He asked me what the difference was between materialism and empiriocriticism according to Plekhanov and … I completely lost it. Then the professor asked: \"Would it be fair if I averaged your grades for these three questions?\" And I passed.\nAfter defending his Ph.D. thesis in March\n1972\n, eight months after being awarded his Master's Degree, Iwaniec was invited to visit Nottingham, England, by Heini Halberstam\n(1926\n-\n2014)\n. Halberstam had been born in Czechoslovakia and had been brought to England by the Kindertransport to escape the Nazis. He was an expert in analytic number theory and Professor of Mathematics at the University of Nottingham from\n1964\nto\n1980\n. Iwaniec made the visit to Nottingham in the spring of\n1974\n. Although he had written his papers in English, he still found speaking English difficult. On this visit, in addition to lecturing in Nottingham, he also gave lectures in Cambridge and Cardiff. Realising that fluency in English was essential if he was to gain international recognition, he spent time trying to improve his spoken English. Strangely, this happened on a visit to Italy.\nIwaniec defended his\nhabilitation\nthesis in\n1976\n, then was awarded a scholarship from the\nAccademia Nazionale dei Lincei\nwhich enabled him to spend the year\n1976\n-\n77\nat the Scuola Normale Superiore di Pisa in Italy. There he worked with the Canadian mathematician John Friedlander. As well as greatly improving his English, meeting Friedlander proved important to Iwaniec in other ways; they became close friends and collaborators. As of March\n20025\n, MathSciNet lists\n60\njoint publications by Iwaniec and Friedlander. In\n1997\nthey proved that there are infinitely many prime numbers of the form\na\n2\n+\nb\n4\na^{2} + b^{4}\na\n2\n+\nb\n4\n; perhaps Iwaniec's most famous result. In\n2017\nIwaniec and Friedlander were jointly awarded the\nJoseph L Doob\nPrize by the\nAmerican Mathematical Society\n; for details see\nTHIS LINK\n.\nWorking at the Institute of Mathematics of the\nPolish Academy of Sciences\nmeant that Iwaniec did not have to teach students so could concentrate on research. It also gave him many opportunities to travel which he was able to do despite the fact that the Polish People's Republic had to authorise visits which they only did reluctantly. He was, however, able to make trips to Sweden, the Netherlands, Finland, Germany, the Soviet Union, and several trips to France and England. He was invited to Bordeaux in\n1979\nto give a course of lectures to graduate students and this led to long-term cooperation with French mathematicians.\nIn\n1978\nIwaniec was invited to give a lecture in the Number Theory Section of the International Congress of Mathematicians held in Helsinki, Finland in August of that year. He gave the lecture\nSieve Methods\nwhich he dedicated to\nViggo Brun\n. He began the lecture as follows:-\nIn the early twenties of this century\nViggo Brun\nintroduced a method which proved to be one of the most fruitful tools in elementary number theory. Since the power of his sieve method was realised the latter began developing rapidly engaging the attention of many prominent number-theoreticians of the past years. We now have a great number of variations of the method, the most remarkable being\nSelberg\n's\nλ\n2\n\\lambda^{2}\nλ\n2\nmethod and the combinatorial sieve of Rosser. Of particular interest is also the recent asymptotic sieve of\nBombieri\nwhich rests on an entirely different concept, called by\nSelberg\n\"local sieve\". The large sieve is in a sense not a sieve. Nevertheless these three topics are intimately related through the similarity of the arithmetical applications.\nIn view of the diversity of different sieve techniques it is clearly impossible to give a complete presentation of the theory in a short time. I wish to devote my lecture rather exclusively to the combinatorial sieve of Rosser for two reasons; the first is the number of strong results it originated recently; the second reason is my personal interest.\nIwaniec had been steadily promoted in the\nPolish Academy of Sciences\nand, in the spring of\n1983\n, he was promoted to professor. The Institute for Advanced Study\n(\nIAS\n)\nat Princeton planned to run a special mathematics programme in\n1983\n-\n84\nin analytic number theory and invited Iwaniec to participate. This was indeed a prestigious invitation and the\nPolish Academy of Sciences\nwere happy to approve the visit. He travelled to the United States with his wife and two young daughters in September\n1983\n. He was a member of the IAS School of Mathematics from September\n1983\nuntil April\n1984\n. Although he had intended to return to Warsaw after his time at the IAS, he received an invitation to spend a semester at Michigan University in Ann Arbor. This was particularly tempting since his brother\nTadeusz Iwaniec\nwas working there at this time. While there he was invited to spend a semester as \"\nUlam\nDistinguished Visiting Professor\" at the University of Colorado in Boulder.\nAlthough the\nPolish Academy of Sciences\nhad been very happy to see Iwaniec spend a year in the United States, they began sending him requests to return to Warsaw. He became tempted to stay for longer in the United States, however, after receiving further invitations\n[\n10\n]\n:-\nI received another invitation - this time from the University of Texas. I wrote a letter saying that I would be happy to work for them for one semester - in the spring of\n1985\n. The day after I sent that letter, I received an invitation from the Institute for Advanced Study in Princeton for\n3\nyears. After some thought, I decided that I wasn't going to Texas, but to Princeton. There was no internet at that time, so I called Texas and asked them to destroy my letter before opening it when they received it. And they did. I started negotiating with Warsaw to agree to my continued stay in the United States, which was really difficult. I had to apply for a leave of absence from work at the Mathematical Institute of the\nPolish Academy of Sciences\n. Eventually, we ended up back in Princeton. We put down roots here. The children studied in American schools, and I had excellent working conditions.\nHe was a Member of the IAS School of Mathematics from December\n1984\nto December\n1986\n. Up to\n1986\nhe had still thought that he would return to his position in the\nPolish Academy of Sciences\nafter the IAS visit but during that year he began to feel that, given the opportunity, he would like to emigrate to the United States. Stanford University in California was interested in offering him a position but before the offer was finalised he was invited to a meeting at Rutgers University in New Brunswick, New Jersey where he was offered the position of New Jersey State Professor. He was also offered generous terms and conditions which he was pleased to accept. He took up that position in January\n1987\n.\nWe noted above that Iwaniec was an invited speaker at the International Congress of Mathematicians in Helsinki in\n1978\n. He was invited to speak at two later International Congresses. At the International Congress of Mathematicians at Berkeley, California in August\n1986\nhe gave the lecture\nSpectral Theory of Automorphic Functions and Recent Developments in Analytic Number Theory\n. He began the Introduction as follows:-\nNumber theory and modular forms have been intimately related from the very beginnings of the latter. Very well known are connections with higher arithmetic and algebraic number theory. In the last decade there have been considerable developments in modular forms in relation to analytic number theory. Its foundation rests on the spectral theory of automorphic functions due to H Maass and\nA Selberg\n. Initially the spectral theory served to give extremely sharp estimates for certain exponential sums of primary importance for problems in analytic number theory. This area of research was given the nickname \"Kloostermania.\" Today analytic number theory is paying back. The connection in question has been reversed to that the machinery of analytic number theory is working to improve the spectral theory of automorphic functions, at least in the most interesting case of congruence groups. This indispensable interrelation is the subject of my talk. We shall also mention some applications to particular problems. My favourite one is the mean-value theorem for primes in arithmetic progressions to large moduli.\nIn\n2006\nIwaniec was a Core Member of the Number Theory Committee for the International Congress of Mathematicians at Madrid, Spain. He was also a plenary lecturer at this Congress held in August\n2006\n. He delivered the plenary lecture\nPrime numbers and L-functions\nwhich he began as follows:-\nPrime numbers fascinate every mathematician, regardless of her or his field of main interest. They also capture the attention of people in other professions. I recall my popular talk in May\n2005\nwhich I delivered to engineers in my native city Elblag in Poland; never before have I heard questions about primes being asked with greater passion. Since our modern daily life is driven by computers, the prime numbers are used to combat hackers. There are offers of huge monetary awards for finding large prime numbers\n(\nwhich are apparently useful in cryptography\n)\n. Regardless of industrial applications the prime numbers will always play a fundamental role in number theory, because they are to arithmetic as the elementary particles are to matter in physics. Primes form the heart of analytic number theory. Therefore this is a serious subject in which I have been happily working most of my life\n(\nand fortunately being paid to do so\n)\n. When presenting results in this talk I shall often express my views on methods and perspectives concerning prime numbers. The tools for studying primes\n(\nlike the L-functions, character sums, bilinear forms, sieve methods, combinatorial identities\n)\nare as fascinating as the results themselves; thus I will spend considerable time analysing the strength of these tools and their potential.\nThis is not a survey of all that is known about prime numbers. There are truly great results concerning prime numbers, which nevertheless do not seem to give insight into the nature of primes. One of these, in my opinion, is the recent spectacular result of B Green and\nT Tao\nconcerning long arithmetic progressions. My goal here is to cover various areas of analytic number theory which are oriented towards the Theory of Prime Numbers in general. Among them are the very promising developments by D A Goldston, J Pintz and C Y Yildirim concerning small gaps between primes.\nIwaniec has been given many major awards for his outstanding contributions. For example he received the Alfred Jurzykowski Award\n(1991)\n, the\nWacław Sierpiński\nMedal\n(1996)\n, the\nOstrowski\nPrize\n(2001)\n, the\nFrank Nelson Cole\nPrize in Number Theory\n(2002)\n, the Leroy P Steele Prize in Mathematical Exposition\n(2011)\n, the Shaw Prize in Mathematical Sciences\n(2015)\n, the\nStefan Banach\nMedal\n(2015)\n, the\nDoob\nPrize\n(2017)\n, and the Casimir Funk Natural Sciences Award\n(2020)\n.\nYou can read details of these awards, which give details about his research contributions leading to the award, at\nTHIS LINK\n.\nIn\n[\n10\n]\nIwaniec describes when he learnt that he was to receive the Shaw Prize in Mathematical Sciences:-\nOn\n1\nJune\n2015\nI received an e-mail from Hong Kong. I often work at night, even until the morning. And it was the same then. At some point I clicked and saw that there was an e-mail. For a few seconds I wondered what it was. I opened it and read it … I felt happily surprised. I couldn't sleep a wink the whole night. I made myself another cup of coffee. I waited until the official ceremony, which was broadcast live. A few hours later, at a press conference in Hong Kong, the official announcement of the awards was made. The award is one million dollars in each field. In the field of mathematics, the\n2015\naward was given to two people, so I actually got half a million. Kasia\n[\nIwaniec's wife\n]\nwas in hospital at the time, after a tragic car accident. I went to see her immediately - I went to the hospital every day, by the way. She was in a very serious condition, so I had mixed feelings about whether I should tell her about the award.\nIn addition he has received many other honours. For example, he was elected to the\nPolish Academy of Sciences\nin\n1983\nand to the\nAmerican Academy of Arts and Sciences\nin\n1995\n, he received the Rutgers Board of Trustees Award for Excellence in Research in\n2000\n, he received a Doctorate Honoris Causa from the Université Bordeaux\n1\nin\n2005\n, he was elected to membership in the\nNational Academy of Sciences\nin\n2006\n, and he was made an inaugural fellow of the\nAmerican Mathematical Society\nin\n2013\n.\nFrom the above list of awards, we see that there is one for mathematical exposition. The citation for the award begins\n[\n2\n]\n:-\nHenryk Iwaniec is awarded the Leroy P Steele Prize for Mathematical Exposition for his long record of excellent exposition, both in books and in classroom notes. He is honoured particularly for the books 'Introduction to the Spectral Theory of Automorphic Forms' and 'Topics in Classical Automorphic Forms'.\nFor more information about these two books and also information about four other books by Iwaniec, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Tadeusz Iwaniec",
    "Tadeusz",
    "Polish Academy of Sciences",
    "Wacław Sierpiński",
    "Yu V Linnik",
    "Brun",
    "Selberg",
    "Jacobsthal",
    "W Sierpinski",
    "Heisenberg",
    "habilitation",
    "Accademia Nazionale dei Lincei",
    "Joseph L Doob",
    "American Mathematical Society",
    "THIS LINK",
    "Viggo Brun",
    "Bombieri",
    "Ulam",
    "A Selberg",
    "T Tao",
    "Ostrowski",
    "Frank Nelson Cole",
    "Stefan Banach",
    "Doob",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences"
  ],
  "imagens": [
    "iwaniec_henryk.jpg"
  ]
}