{
  "nome_completo": "Izabela Abramowicz",
  "nome_curto": "Izabela Abramowicz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abramowicz_Izabela/",
  "data_nascimento": "9 November 1889",
  "local_nascimento": "Lutosławice, near Piotrków Trybunalski, Russian Empire (now Poland)",
  "data_morte": "22 January 1973",
  "local_morte": "Łęczyca, near Poznań, Poland",
  "summary": "Izabela Abramowicz was a Polish mathematician who was the first woman to be awarded a gold medal and a first-degree diploma in mathematics from the University of Kyiv. She was an outstanding school teacher awarded the Knight's Cross of the Order of Polonia Restituta and other awards for her educational achievements",
  "biografia": "Izabela Abramowicz\nwas the daughter of Tomasz Franciszek Abramowicz\n(1863\n-?\n)\n, a teacher at the school in Lutosławice Rządowe, and Maria Petronela Gniotek\n(1867\n-\n1944)\n. Lutosławice Rządowe is south of the city of Łódź and north of Piotrków Trybunalski. The region was originally in Poland but in the Second Partition of Poland in\n1793\nit was annexed to Prussia. After Napoleon's conquest it became part of the Napoleonic Duchy of Warsaw but the\n1815\nCongress of Vienna saw the region incorporated into the Russian Empire. There were continuing tensions between Poles and the Russian authorities and there was a Polish uprising in\n1863\n. Tomasz and Maria Petronela had three children,\nKazimierz Abramowicz\n, who became a mathematician and has a biography in this archive, Izabela Abramowicz, the subject of this biography, and Zygmunt Abramowicz\n(1893\n-\n1966)\n. Izabela and her younger brother Zygmunt were born in Lutosławice Rządowe where the family lived, but Kazimierz was born in Brzeziny, the town of his mother's birth east of the city of Łódź.\nIzabela Abramowicz began her secondary education at the State Gymnasium in Piotrków Trybunalski. The economy of the area deteriorated in early\n1900\ns with many Polish workers losing their jobs. There were protests by Poles who wanted an independent Poland and opposed the government's policy of Russification. Strikes and protests began in the Łódź region even before the Russian Revolution began on\n22\nJanuary\n1905\n. Strikes caused school closures, many lost their lives when Russian police fired on protesters, and there was fighting in Łódź, Piotrków Trybunalski and other major towns in the region. In order to complete her secondary school education, Abramowicz interrupted her studies in Piotrków Trybunalski and transferred to the State Gymnasium in Bobruisk. This city had been in Poland but had gone through the same changes as the Łódź region to end up in the Russian Empire in\n1815\n. Today, however, it is in Belarus. Izabela Abramowicz took her matriculation examinations and graduated from the State Gymnasium in Bobruisk in\n1907\n.\nAlthough at this time women in Russian universities were not given the same status as men, nevertheless they were allowed to attend classes. The authors of\n[\n9\n]\nwrite:-\nIn light of petitions from regions across the country for the opening of higher women's courses in them, on\n3\nDecember\n1905\n, the Minister of Public Education was authorised to establish private women's courses in them. That same year, women were granted admission to most Russian universities and other institutions of higher learning. Furthermore, there appeared mixed-type general education institutions, i.e. schools serving both males and females. The period following\n1905\nwitnessed a marked upturn in the development of women's higher education in Russia, an area in which this nation was outperforming even Western Europe. All Russian university cities were becoming home to various organisations offering general and vocational education to women, with some of those facilities funded by the government.\n... in\n1905\nwomen in Russia were granted permission to attend universities and some other institutions of higher learning as non-degree students. This was fundamental to resolving the issue of women's higher education, in a sense calling into question the need to establish higher women's courses. Yet, even though women had been granted admission to universities, the number of places reserved for them there was insufficient.\nIn\n1907\n, Izabela Abramowicz was able to begin to study mathematics in the Faculty of Physics and Mathematics of the University of Kiev.\n(\nWe note that Kiev is now known as Kyiv.\n)\nThis was a particularly difficult time, however, for anyone to be studying at the University of Kiev since it was a time of mass student protest associated with the Russian Revolution of\n1905\n. There was unrest among students caused by events at universities across the country. Student strikes and student riots were monitored by the Kiev Secret Police. Izabela Abramowicz was not alone in Kiev, however, for her brother\nKazimierz Abramowicz\nalso began her studies at the University of Kiev in\n1907\n. We are unsure exactly when the Abramowiczs' mother came to Kiev, but certainly at some stage the three were living together in Kiev.\nIzabela attended courses by, among others,\nBoris Yakovlevic Bukreev\nand\nDmitry Aleksandrovich Grave\n.\nBukreev\nran a seminar on the theory of analytic functions which she attended. Advised by\nBukreev\n, she wrote the dissertation\nOn the double integrals of algebraic surfaces\nfor which she was awarded a gold medal in\n1911\n. With this award, she became the first woman to receive a gold medal from the University of Kiev. She completed her studies and was awarded a first-degree diploma at the Faculty of Physics and Mathematics in May\n1912\n. Because of her exceptional performance, she received permission from the Minister of Education to remain at the University of Kiev to prepare for examinations for the Master of Science degree. We should note that at this time the first-degree diploma was about equivalent in standard to a present day Master's Degree and required both examinations and a thesis while the Master's Degree was in standard between that of the present Ph.D. and the habilitation. Now although Izabela was allowed to study for the Master's Degree, she was not awarded a scholarship. Of course, men who had shown the same abilities would certainly have received a scholarship. In order to support herself financially, Izabela began teaching mathematics at three different gymnasiums in Kiev.\nIn October\n1917\nIzabela Abramowicz was appointed as a lecturer at the Polish University College in Kiev. In\n[\n8\n]\nthere is an excellent account of how and why this university was founded:-\nIn December\n1916\n, Wacława Peretjatkowiczowa, headmistress of two girls' secondary schools, applied to the Russian Ministry of Public Enlightenment with a request for permission to open a Polish higher education institution of the humanistic type in Kiev ... Peretjatkowiczowa's efforts were initially met with serious obstacles, \"resulting either from bureaucratic formalities or simply from the reluctance and suspicion of ... the authorities\". However, Peretjatkowiczowa was a very energetic person, committed to the implementation of her intention, so she was not discouraged by the initial failures and after a personal intervention in Petrograd\n[\nnow St Petersburg\n]\n, in the second half of January\n1917\nshe managed to obtain permission from the Russian education authorities to open a university. ... there was a relatively large number of Polish youth in Kiev at that time, originating both from the almost fifty thousand pre-war Polish diaspora of Kiev, as well as from among the population that flocked to Kiev and the surrounding areas from the Kingdom of Poland and other war-torn territories. In\n1916\n, over\n100\n,\n000\nPoles lived in Kiev. The idea was for these young people to be able to continue their interrupted studies or, after obtaining high school diplomas, begin their studies.\nThe Polish University College in Kiev formally opened on\n31\nMarch\n1917\n. At this stage there were around\n500\nstudents, the majority of whom were women. Although no science subjects were offered at first, by the summer of\n1917\na decision was made to expand into that area. The first semester of the\n1917\n-\n18\nyear began on\n13\nOctober\n1917\n. Izabela began teaching mathematics at this time. In the whole university there were\n718\nstudents, including\n527\nwomen and\n191\nmen. By this time there were\n18\nlecturers, six of whom, like Abramowicz, had been appointed in October\n1917\n. Izabela Abramowicz taught the course 'Introduction to Mathematics'. She gave the course in both the first and second semester of\n1917\n-\n18\n, teaching three hours per week. In the first semester she had a class of\n19\nstudents, and in the second semester there were\n13\nstudents in the class. Other mathematics courses were given by Leon Kordysz\n(\nAnalytical geometry\n)\nand by\nEustachy Żyliński\n(\nMathematics\n)\n.\nIn June\n1919\nPoland was confirmed as an independent country by the Treaty of Versailles. Although World War I had ended in\n1918\n, Poland was immediately involved in a war with Soviet Russia. This was a complicated situation with Poles, Ukrainians, Bolsheviks and White Russians all involved in fighting and occupying Kiev. On\n1\nAugust\n1919\n, the future of the Polish University College was debated. Conditions were put on the College such as a requirement that all students should declare themselves to be communists. By the end of August, however, White Russians had captured Kiev and in September the College again debated opening. Many College professors, however, left Kiev for Lwów in November\n1919\n, the remaining professors leaving with the retreating Polish troops in June\n1920\n. Izabela Abramowicz was on the list of teachers in higher education colleges leaving Kiev on\n10\nJune\n1920\nwith the retreating Polish troops. Although her name was on the list, she does not appear to have left and it is conjectured that she continued to teach at three Gymnasiums in Kiev until August\n1923\n. We note that no direct evidence for this has been found.\nIt is reasonable to ask why Izabela Abramowicz's name was on the list of those to leave on\n10\nJune\n1920\n, yet she appears to have remained in Kiev. Since her brother\nKazimierz Abramowicz\nleft Kiev in June\n1920\nand went to Warsaw it is reasonable to conjecture that Izabela and her mother decided to remain in Kiev and wait for Kazimierz to find a job and a home before they joined him. To support this conjecture we note that, on\n18\nFebruary\n1921\n, Abramowicz arrived in Poznań and, after living in a number of temporary places around the city, by October\n1921\nwas in his own apartment in Stanisława Wyspiańskiego street. Izabela and her mother arrived there from Kiev on\n25\nAugust\n1923\n.\nIn\n1923\n-\n24\nIzabela Abramowicz was a mathematics teacher at the State Secondary School in Wolsztyn. After this year she was appointed as a mathematics teacher at the Secondary School in Poznań named after Generałowa Jadwiga Zamoyska\n(1831\n-\n1923)\n.\nThe First Polish Mathematics Congress was held in Lwów,\n7\n-\n10\nSeptember\n1927\n. The Congress was attended by about\n200\nmathematicians from Poland and a small number from abroad. About\n100\nlectures were delivered in the halls of the Lwów Polytechnic. Four people from Poznań attended the Congress: Izabela Abramowicz, her brother\nKazimierz Abramowicz\n,\nWładysław Ślebodziński\nand Lidja Seipeltówna. Izabela was, rather surprisingly, given the affiliation \"professor, Poznań University\".\nKazimierz Abramowicz\nwas \"deputy professor, Poznań University\",\nWładysław Ślebodziński\nwas \"professor, School of Machine Design, Poznań\" and Lidja Seipeltówna was \"assistant, University of Poznań\". We assume that Izabela must have been teaching at the University in addition to her teaching at a secondary school.\nThe First Polish Mathematics Congress resolved to convene the First Congress of Mathematicians of Slavic Countries in Warsaw in\n1929\n. This Congress took place\n23\n-\n27\nSeptember\n1929\nwith\nWacław Sierpiński\nas its chairman. In his opening address\nSierpiński\n:-\n... emphasised among other things that the Congress did not in any way have a political basis. Its goal was to establish closer intellectual relationships among researchers who work in the same branch of knowledge, who live in nearby territories and for whom collaboration is made somewhat easier by the kinship of their native languages. As a confirmation of his words Prof\nSierpiński\npointed to the presence of several mathematicians who came from non-Slavic countries with the goal of participating in the work of the Congress.\nIzabela Abramowicz and her brother\nKazimierz Abramowicz\nboth attended this Congress.\nThe Second Congress of Polish Mathematicians was held in Vilnius\n23\n-\n26\nSeptember\n1931\n. Despite the general economic crisis, the Congress was attended by over\n160\nmathematicians including Izabela Abramowicz and her brother\nKazimierz Abramowicz\n. We note that Izabela did not lecture at any of these Congresses.\nKazimierz Abramowicz\ndied in\n1936\nbut Izabela continued to live with her mother in Poznań but during the years\n1939\n-\n42\nshe lived in Łeczyca near Poznań. On\n1\nSeptember\n1939\nGermany invaded Poland and Poznań was incorporated into the Third Reich. A policy of Germanisation was adopted and over\n100\n,\n000\nPolish civilians were expelled from the city. Education in Polish was banned but Izabela gave private lessons in Poznań as part of the \"underground education\". In early December\n1942\nshe was detained during a roundup by the German police in Poznań and, as a result, in the period\n1942\n-\n44\nshe was forced to work under harsh conditions in three factories in Poznań and Luboń.\nIn January and February\n1945\nthere was fierce fighting as the Germans attempted to hold Poznań. The bombing and shelling that took place did great damage. The Germans surrendered in February\n1945\nand, almost immediately, Izabela resumed her job as a mathematics teacher at the Secondary School named after Generałowa Jadwiga Zamoyska.\nZygmunt Abramowicz, Izabela's younger brother, had married Nina who was a Russian. Nina was friendly with the Borszczow family who had emigrated from Russia to Poland after the Russian Revolution since Pavel Borshchev had fought for the White Army. Pavel was arrested by the Soviets in the summer of\n1945\nleaving his wife Marianna and their three sons, Sviatoslav\n(\nage\n14)\n, Aleksander\n(\nage\n12)\nand Sergiusz\n(\nage\n1)\nin difficulties. Nina told Izabela, who was now living alone since her mother died in\n1944\n, about the plight of the Borszczow family. They reached an arrangement where the Borszczow family would have free accommodation with Izabela and she would see to the education of the three boys in exchange for Marianna running the house.\nIzabela continued teaching mathematics at the Gen Zamoyska school until\n31\nAugust\n1953\nwhen she became a mathematics teacher at the Adam Mickiewicz High School in Poznań. This school had been founded by the priest and patriot Czesław Piotrowski in\n1923\nand named after the poet and patriot Adam Mickiewicz. She taught at the school until\n1968\n.\nIzabela Abramowicz died in Łęczyca in January\n1973\n. The obituary\n[\n5\n]\n, written by the school she taught at from\n1924\n, now named after Generałowa Jadwiga Zamoyska and Helena Modrzejewska, reads:-\nOn\n22\nJanuary\n1973\n, Professor Izabela Abramowicz died - a mathematics teacher at our secondary school in the years\n1924\n-\n1953\n, awarded the Knight's Cross of the Order of Polonia Restituta. We bid farewell to an outstanding teacher with an extraordinary mind and heart.\nThe obituary\n[\n6\n]\n, written by the Adam Mickiewicz Secondary School, reads:-\nOn\n22\nJanuary\n1973\n, Dr Izabela Abramowicz died at the age of\n84\n- an outstanding teacher and educator of many generations, a long-time teacher at the\n8\nth Adam Mickiewicz High School in Poznań, awarded the Knight's Cross of the Order of Polonia Restituta, the Golden Cross of Merit and many other decorations.\nOn\n25\nJanuary\n1973\na funeral mass for Izabela Abramowicz was celebrated at\n2\n:\n30\np.m. in the parish church in Wiry, near Poznań following which she was buried in the cemetery at Wiry.\nAfter Izabela's death the Borszczow family continued to live in her house.",
  "matematicos_citados_na_biografia": [
    "Kazimierz Abramowicz",
    "Boris Yakovlevic Bukreev",
    "Dmitry Aleksandrovich Grave",
    "Bukreev",
    "Eustachy Żyliński",
    "Władysław Ślebodziński",
    "Wacław Sierpiński",
    "Sierpiński"
  ],
  "imagens": [
    "abramowicz_izabela.jpg"
  ]
}