{
  "nome_completo": "al-Ishbili Abu Muhammad Jabir ibn Aflah",
  "nome_curto": "Jabir ibn Aflah",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jabir_ibn_Aflah/",
  "data_nascimento": "about 1100",
  "local_nascimento": "possibly Seville (now Spain)",
  "data_morte": "about 1160",
  "local_morte": null,
  "summary": "Jabir ibn Aflah or Geber was an Spanish Islamic mathematician whose works were translated into Latin and so became available to European mathematicians.",
  "biografia": "Jabir ibn Aflah\nis often known by the Latinised form of his name, namely\nGeber\n. Although not he was not in the first rank of Arabic mathematicians, he is important in the development of mathematics since his works were translated into Latin, and so became available to European mathematicians, whereas the work of some of the top rank Arabic mathematicians such as\nAbu'l-Wafa\nwere not translated into Latin.\nVery little information is available regarding Jabir ibn Aflah's life. That he came from Seville is known from two sources. Firstly he is described as \"al-Ishbili\" in manuscripts containing his treatises; this means \"from Seville\". The other source gives us not only the information that he came from Seville, but also a good estimate for the period in which he lived. The information comes from Maimonides.\nMoses Maimonides, whose Arabic name was Abu 'Imran Musa ibn Maymun ibn 'Ubayd Allah, was a Jewish philosopher, jurist, and physician who was born in Córdoba in\n1135\n. Among many important works he wrote\nThe Guide of the Perplexed\nin Arabic in which he writes of:-\n... ibn Aflah of Seville, whose son I have met ...\nJabir ibn Aflah invented an observational instrument known as the torquetum, a mechanical device to transform between spherical coordinate systems\n(\nsee\n[\n3\n]\nfor further details\n)\n. He also gave his name to a theorem in spherical trigonometry, and his criticisms of\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nare well known. These criticisms appears in Jabir ibn Aflah's most famous work\nIslah al-Majisti\nⓉ\n(\nCorrection of the Almagest\n)\n. One sees that ibn Aflah even puts his argument regarding errors made by\nPtolemy\ninto the title of the work. In\n[\n4\n]\nLorch explains Jabir ibn Aflah's most famous criticism, namely\nPtolemy\n's placement of Venus and Mercury below the Sun.\nPtolemy\nclaimed that these planets could never be on a line between an observer on Earth and the sun., but ibn Aflah states that this is an error, and that Venus and Mercury are above the Sun.\nIt is a little difficult to establish the exact degree of originality of\nCorrection of the Almagest\n. Certainly its general approach bears considerable similarity to the work of\nAbu'l-Wafa\n, but it may not be based on\nAbu'l-Wafa\n's work. Both may be based on the work of\nThabit ibn Qurra\n, or the work of ibn Aflah,\nAbu'l-Wafa\n, and\nThabit ibn Qurra\nmay all be based on some still unknown source.\nThe influence of ibn Aflah is quite remarkable. In\n[\n4\n]\nhis influence on astronomers in both the East and West is studied. In particular the author looks at his influence on the Persian astronomer Qutb al-Din al-Shirazi, who was a pupil of Nasir al-Din\nal-Tusi\n; on the Hispano-Arabian philosopher ibn Rushd, who is often known as Averroes, was born in Córdoba in\n1126\nand integrated Islamic traditions and Greek thought; and on\nLevi ben Gerson\n(\nsometimes known as Gersonides\n)\n. One of ibn Aflah's more infamous influences was on\nRegiomontanus\nwho copied large parts of ibn Aflah's work in the fourth book of his publication\nDe triangulis\n.\nRegiomontanus\ndid not acknowledge that ibn Aflah was the source of the material and this caused\nCardan\nto strongly criticise\nRegiomontanus\n.",
  "matematicos_citados_na_biografia": [
    "Abu'l-Wafa",
    "Ptolemy",
    "Thabit ibn Qurra",
    "al-Tusi",
    "Levi ben Gerson",
    "Regiomontanus",
    "Cardan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}