{
  "nome_completo": "Jacob Wolfowitz",
  "nome_curto": "Jacob Wolfowitz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wolfowitz/",
  "data_nascimento": "19 March 1910",
  "local_nascimento": "Warsaw, Russian Empire (now Poland)",
  "data_morte": "16 July 1981",
  "local_morte": "Tampa, Florida, USA",
  "summary": "Jacob Wolfowitz worked on nonparametric statistical inference with Wald and also collaborated on sequential analysis.",
  "biografia": "Jacob Wolfowitz\n's father emigrated to the USA in\n1914\nand Jacob joined him in\n1920\nwhen he was ten years old. Jacob attended High School in New York and, having graduated, entered the College of the City of New York. While Wolfowitz was in the middle of his undergraduate course the Great Depression began.\nThe Great Depression began in\n1929\nand by\n1932\none quarter of the workers in the United States were unemployed. When Wolfowitz graduated in\n1931\nthere was little prospects of good employment so he spent the next ten years teaching mathematics in a number of different high schools while he worked towards his doctorate. In\n1934\nWolfowitz married Lillian Dundes; they had one daughter, born in\n1941\nand a son Paul, born in\n1943\n. Paul Wolfowitz became the Deputy Secretary of Defense\n(\nsic\n)\nfor the USA in March\n2001\n.\nWolfowitz met\nWald\nin\n1938\nand they began a collaboration which lasted until\nWald\n's death\n[\n2\n]\n:-\nThey were the closest of friends, and Wolfowitz regarded\nWald\nas his teacher as well as his co-worker. Their work together produced some of the most important and striking results in theoretical statistics.\nIn fact the first paper which Wolfowitz wrote was a joint one with\nWald\n. Wolfowitz's earliest interest was nonparametric inference and the joint paper we just mentioned presents ways of calculating confidence intervals which are not necessarily of fixed width, on a distribution function\nF\nF\nF\nbased on the empiric independent identically distributed observations on\nF\nF\nF\n. It is in a paper by Wolfowitz in\n1942\nthat the word 'nonparametric' appears for the first time.\nWolfowitz obtained his doctorate from New York University in\n1942\nand that year joined the Statistical Research Group at Columbia University. This research group was working on problems related to war work and one of the statistical methods it was working on was sequential analysis. The type of problem that this statistical method applies to is when the number of observations of a variable is not determined before the experiment begins, but rather the number of observations is determined by the observations themselves.\nWald\nand Wolfowitz were both attached to the Statistical Research Group at Columbia and they led the research project to develop a theory for sequential analysis. Wolfowitz produced work on sequential estimators of a Bernoulli parameter, and results on the efficiency of certain sequential estimators. Again he collaborated with\nWald\non work in this area, and one particular result should be mentioned, namely their proof of the optimal character of the sequential probability ratio test for testing between two hypotheses. This result is described in\n[\n2\n]\nas:-\n... one of the strikingly beautiful results of theoretical statistics.\nAt the end of the war Wolfowitz left the Columbia research group and took up a position as associate professor at University of North Carolina. After spending the year\n1945\n-\n46\nthere, he returned to Columbia University. He remained at Columbia until after the death of\nWald\n, then he was appointed professor of mathematics at Cornell in\n1951\n. While on the Faculty at Cornell he was visiting professor at the University of California at Los Angeles in\n1952\n, at the University of Illinois in\n1953\n, Technion in Israel in\n1957\n. In\n1967\nhe was visiting professor at both Technion and the University of Paris, and he spent a period at the University of Heidelberg in\n1969\n. He left Cornell and joined the University of Illinois at Urbana in\n1970\n, retiring in\n1978\nwhen he then went to the University of South Florida at Tampa. In\n1979\nhe was Shannon Lecturer of the Institute of Electrical and Electronic Engineers.\nAs someone who collaborated with others frequently on research, it is worth hearing the opinions of collaborators who\n[\n2\n]\n:-\n... attest to the stimulating experience of doing joint research with him. In research discussions he is energetic, probing, critical, humorous, and very inventive.\nWe have mentioned Wolfowitz's work on nonparametric inference and his work on sequential analysis. He also studied asymptotic statistical theory, that is the theory of how statistical processes behave in the limit as the sample size gets larger and larger. The properties of consistency and efficiency are important here, the first ensuring convergence and the second relating to the rate of convergence. Wolfowitz looked at many aspects of the maximum likelihood method.\nInformation theory, which had been started by\nShannon\n, was another area to which Wolfowitz made important contributions. His book\nCoding Theorems of Information Theory\n(3\nrd\ned.\n1978)\nis a classic in the subject. It is\n[\n2\n]\n:-\n... the only book which concentrates on statistical and probabilistic aspects of noisy channel communication theory. It is also a handy introductory text because of its brief and simple formulations of problems and estimates. Yet it is comprehensive and at the limits of present research. The completely revised third edition is indispensable for specialists, as the other two editions were before. It contains the core of the ideas of Wolfowitz's papers and of research influenced by him, which already means that the main stream of present research in this theory is covered.\nWe should also mention what a fine teacher Wolfowitz was\n[\n2\n]\n:-\nHis lectures reflect his own insistence on understanding the essential features of a proof. \"Lets see what makes things tick\", his class hear, and his students and audiences at scientific meetings have the privilege of receiving a lively and lucid exposition that enables them to appreciate the crucial ideas of a subject much more than does the customary formal lecture or line by line proof. ... His students ... always found generosity, patience, and the deep personal concern along with helpful criticism.\nWolfowitz received many honours for his outstanding contributions to statistics. He was elected to the\nNational Academy of Sciences\n, and the\nAmerican Academy of Arts and Sciences\n. He was elected a Fellow of the Econometric Society, the International Statistics Institute, and the Institute of Mathematical Statistics. He was both Rietz Lecturer and\nWald\nLecturer for this latter Institute. Technion, in Israel, awarded him an honorary degree in\n1975\n.\nFinally, a comment on his personality and interests outside mathematics and statistics:-\nHe is a voracious reader, and his knowledge of, and intense interest in, all facets of the state of the world, make him an interesting person with whom to discuss almost anything.",
  "matematicos_citados_na_biografia": [
    "Wald",
    "Shannon",
    "National Academy of Sciences",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}