{
  "nome_completo": "Jacob (II) (Jacques (II)) Bernoulli",
  "nome_curto": "Jacob (II) Bernoulli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bernoulli_Jacob(II)/",
  "data_nascimento": "17 October 1759",
  "local_nascimento": "Basel, Switzerland",
  "data_morte": "15 August 1789",
  "local_morte": "St Petersburg, Russia",
  "summary": "Jacob ( II ) Bernoulli was a member of the Swiss Bernoulli family who worked on mathematical physics.",
  "biografia": "Jacob\n(\nII\n)\nBernoulli\nwas one of the sons of\nJohann\n(\nII\n)\nBernoulli\n. Following the family tradition he took a degree in law but his interests were in mathematics and mathematical physics.\nYou can see the Bernoulli family tree at\nTHIS LINK\n.\nIn\n1782\nJacob\n(\nII\n)\nBernoulli's uncle\nDaniel Bernoulli\ndied and his chair of physics in Basel became vacant. Jacob\n(\nII\n)\napplied for the chair and presented a work on mathematical physics to support his application. The decison as to who should fill the vacant chair was not made on academic grounds but was made by drawing lots. Jacob\n(\nII\n)\nBernoulli was unlucky and he was not offered this position which he would really have liked.\nHe was then appointed as secretary to the Imperial Envoy to Turin and Venice. However, he was soon given the chance of another academic post when he received an offer from St Petersburg. He went to St Petersburg and began to write important works on mathematical physics which he presented to the\nSt Petersburg Academy of Sciences\n. These treatises were on elasticity, hydrostatics and ballistics.\nDespite the rather harsh climate, the city of St Petersburg had great attractions for Jacob\n(\nII\n)\nBernoulli since his uncle\nDaniel Bernoulli\nhad worked there with\nEuler\n. In fact Jacob\n(\nII\n)\nmarried a granddaughter of\nEuler\nin St Petersburg but, tragically, the city was to lead to his death.\nSt Petersburg is located on the delta of the Neva River, at the head of the Gulf of Finland. St Petersburg, built on\n42\nislands in the Neva River, is a city of waterways and bridges and because of this it is called the \"Venice of the North.\" This has great attraction but Jacob\n(\nII\n)\nBernoulli drowned, while still only\n29\nyears of age, in the Neva River while he was swimming.",
  "matematicos_citados_na_biografia": [
    "Johann(II)Bernoulli",
    "THIS LINK",
    "Daniel Bernoulli",
    "St Petersburg Academy of Sciences",
    "Euler"
  ],
  "imagens": [
    "bernoulli_jacob_ii.jpg"
  ]
}