{
  "nome_completo": "Jacques Tits",
  "nome_curto": "Jacques Tits",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tits/",
  "data_nascimento": "12 August 1930",
  "local_nascimento": "Uccle, Belgium",
  "data_morte": "5 December 2021",
  "local_morte": "Paris, France",
  "summary": "Jacques Tits was a Belgium-born French mathematician who worked on group theory and geometry.",
  "biografia": "Jacques Tits\nwas born in Uccle, on the southern outskirts of Brussels. His parents were Léon Tits, who was a professor, and Lousia André. Jacques attended the Athénée of Uccle and then studied at the Free University of Brussels. His thesis advisor in Brussels was Paul Libois, and Tits graduated with his doctorate in\n1950\nhaving submitted his dissertation\nGénéralisation des groupes projectifs basés sur la notion de transitivité\nⓉ\n(\nGeneralization of projective groups based on the notion of transitivity\n)\n. From\n1948\nto\n1956\nhe was funded by the Belgium Fonds National de la Recherche Scientifique.\nTits' first papers, following the work he had undertaken for his doctoral dissertation, were on generalisations of triply transitive groups. He published a two part paper\nGénéralisations des groupes projectifs\nⓉ\n(\nGeneralizations of projective groups\n)\nin\n1949\non this topic generalising the group of one-dimensional projective transformations. Among the results proved were characterisations of projective groups among triply transitive groups. In\nGroupes triplement transitifs et généralisations\nⓉ\n(\nTriply transitive groups and generalizations\n)\n(1950)\n, Tits went on to look at generalisations of\nn\nn\nn\n-tuply transitive groups, defining an almost\nn\nn\nn\n-tuply transitive group. This generalises the group of collineations of the plane which is almost quadruply transitive. In\nSur les groupes triplement transitifs continus; généralisation d'un théorème de Kerékjártó\nⓉ\n(\nOn triply transitive continuous  groups; generalization of a theorem Kerékjártó\n)\n(1951)\nTits looked at triply transitive groups of transformations of a topological space using his earlier results which characterised the projective groups among triply transitive groups.\nTits married Marie-Jeanne Dieuaide, a historian, on\n8\nSeptember\n1956\n. From\n1956\nto\n1962\nhe was an assistant at the University of Brussels.  He was promoted to professor in\n1962\nand remained in this role at Brussels for two years before accepting a professorship at the University of Bonn in\n1964\n. Among Tits' doctoral students in Brussels we mention Francis Buekenhout who was awarded his doctorate in\n1965\n. In\n1973\nTits accepted the Chair of Group Theory at the Collège de France. Shortly after taking up this post, he became a naturalised French subject in\n1974\n. Tits held this chair until he retired in\n2000\n.\nThe large and important mathematical developments introduced by Tits are far too numerous to cover here in any detail. Perhaps the most important part of his work was the introduction of buildings and this is put into context by Ronan in\n[\n3\n]\n. We give his summary:-\nThis paper is an essay on how the development of group theory led to the discovery of various families of simple groups, and how these in turn led to the theory of buildings. In outline the story is this.\nGalois\nfirst used the term 'group' in the technical sense, and found the first simple groups. Jordan, in his famous Traité des substitutions et des équations algébriques\nⓉ\n(\nTreatise on substitutions and algebraic equations\n)\n, published in\n1870\n, promoted\nGalois\n' work and put the theory of groups on a firm foundation. At this time groups were treated as groups of permutations, but other aspects of group theory were soon on the way.\nLie\nvisited Paris in\n1870\nas a graduate student, and went on to create the theory of continuous transformation groups.\nKilling\ncame to such groups independently, and in\n1888\nfound the classification of the simple\nLie\ngroups, using semisimple complex\nLie\nalgebras\n(\nfamilies A through G\n)\n.\nCartan\nrefined this classification in\n1894\n, correcting some errors in the proofs, and it is now known as the\nKilling\n-\nCartan\nclassification. The classical families\n(\nA through D\n)\nsoon led to groups over fields other than the real or complex numbers, and a comprehensive study was published by Dickson in\n1901\n. Later he dealt with\nE\n6\nE_{6}\nE\n6\n​\nand G, but progress on the others did not occur until after the Second World War. Tits was working on the problem, as was Chevalley, who was a more established mathematician at that time. Chevalley succeeded in\n1955\n, and his paper was soon followed by variations due to Steinberg, Tits, Suzuki, and Ree. During this time Tits was gradually developing the theory of buildings, and his book \"Buildings of spherical type and finite BN-pairs\"  in\n1974\nproduced a fully-fledged theory that has since found many uses. ... we mention some of Tits' early work on buildings, and we discuss the contents of his above-mentioned book concerning buildings of spherical type. Finally ... a later approach to buildings, also due to Tits, is mentioned, and we return at the end to the construction of the exceptional groups of Lie type using building theory.\nThrough a large number of other important roles, Tits played a major part in mathematical life. For example he was editor-in-chief for mathematical publications at I.H.E.S. from\n1980\nto\n1999\n. He served on the committee awarding the\nFields medals\nin\n1978\nand again in\n1994\n. He also served on the committee awarding the Balzan Prize in\n1985\n.\nTits has received, and continues to receive, many honours. Among these we mention the Prix scientifique Interfacultataire L Empain\n(1955)\n, the Wettrems Prize of the Royal\nBelgium Academy of Science\n(1958)\n, the Prix décennal de mathématique from the Belgium government\n(1965)\n, the Grand Prix of the\nFrench Academy of Sciences\n(1976)\n, the Wolf Prize in Mathematics\n(1993)\n, and the Cantor Medal from the\nGerman Mathematical Society\n(1996)\n. He was elected to many academies and societies including the\nGerman Academy of Scientists Leopoldina\n(1977)\n, the\nRoyal Netherlands Academy of Sciences\n(1988)\n, founder member of Academia Europaea\n(1988)\n, the\nRoyal Belgium Academy of Science\n(1991)\n, the\nAmerican Academy of Arts and Sciences\n(1992)\n, the\nNational Academy of Sciences\nof the United States\n(1992)\n, and\nLondon Mathematical Society\n(1993)\n. He has been awarded honorary doctorates from the universities of Utrecht\n(1970)\n, Ghent\n(1979)\n, Bonn\n(1988)\nand Leuwen\n(1992)\n. He was made Chevalier de la Légion d'Honneur\n(1995)\nand Officier de l'Ordre National du Mérite\n(2001)\n.\nAfter retiring in\n2000\n, Tits became the first holder of the Vallée-Poussin Chair from the University of Louvain. He gave his inaugural lecture\nImmeubles : une approche géométrique des groupes algébriques simples et des groupes de Kac-Moody\non\n18\nOctober\n2001\n. He followed this with three series of lectures on the following topics\n(1)\nGénéralités sur les nombres\np\np\np\n-adiques. Groupes algébriques simples sur les corps\np\np\np\n-adiques\nⓉ\n(\nOverview of  p-adic numbers. Simple algebraic groups over the p-adic field\n)\n;\n(2)\nSchémas en groupes à fibre générique simple sur les anneaux d'entiers\nⓉ\n(\nDiagrams simple generic fiber of whole groups on rings\n)\n;\n(3)\nRéseaux invariants dans les espaces de représentations. Applications algébriques\nⓉ\n(\nInvariants lattices in representations of spaces. Algebraic applications\n)\n.\nIn\n2008\nthe\nNorwegian Academy of Science and Letters\nawarded the Abel Prize to\nJohn Griggs Thompson\nand Jacques Tits:-\n... for their profound achievements in algebra and in particular for shaping modern group theory.\nThe Press Release gives the following summary of Tits's contributions:-\nTits created a new and highly influential vision of groups as geometric objects. He introduced what is now known as a Tits building, which encodes in geometric terms the algebraic structure of linear groups. The theory of buildings is a central unifying principle with an amazing range of applications, for example to the classification of algebraic and Lie groups as well as finite simple groups, to Kac-Moody groups\n(\nused by theoretical physicists\n)\n, to combinatorial geometry\n(\nused in computer science\n)\n, and to the study of rigidity phenomena in negatively curved spaces. Tits's geometric approach was essential in the study and realisation of the sporadic groups, including the Monster. He also established the celebrated \"Tits alternative\": every finitely generated linear group is either virtually solvable or contains a copy of the free group on two generators. This result has inspired numerous variations and applications. The achievements of\nJohn Thompson\nand of Jacques Tits are of extraordinary depth and influence. They complement each other and together form the backbone of modern group theory.",
  "matematicos_citados_na_biografia": [
    "Galois",
    "Lie",
    "Killing",
    "Cartan",
    "Fields medals",
    "Belgium Academy of Science",
    "French Academy of Sciences",
    "German Mathematical Society",
    "German Academy of Scientists Leopoldina",
    "Royal Netherlands Academy of Sciences",
    "Royal Belgium Academy of Science",
    "American Academy of Arts and Sciences",
    "National Academy of Sciences",
    "London Mathematical Society",
    "Norwegian Academy of Science and Letters",
    "John Griggs Thompson",
    "John Thompson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}