{
  "nome_completo": "Jacques Herbrand",
  "nome_curto": "Jacques Herbrand",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herbrand/",
  "data_nascimento": "12 February 1908",
  "local_nascimento": "Paris, France",
  "data_morte": "27 July 1931",
  "local_morte": "La Bérarde, Isère, France",
  "summary": "Jacques Herbrand was a French mathematician who died young but made contributions to mathematical logic.",
  "biografia": "Jacques Herbrand\n[\n4\n]\n:-\n... was the only son of parents who recognised his precocious genius and endeavoured to assure its full development by their love and support.\nHe gained the top place in the Concours Général examination then entered the École Normale Supérieure at the age of\n17\nhaving again been ranked in top place in the entrance examination. This was quite an exceptional achievement at that time for a student of his age. At the École Normale he became interested in the foundations of mathematics and read\nWhitehead\nand\nRussell\n's\nPrincipia Mathematica\nduring his undergraduate years. He had already set himself the goal of creating a school of mathematical logic in France to rival that in Göttingen. In\n1928\nhe received his\nAgrégation\n, again being ranked as the top student. During this year\n[\n4\n]\n:-\n... he obtained the results which would constitute his thesis: a new proof, the simplest known to date, of the consistency of arithmetic, and a new criterion, very general and completely formal, for the truth of propositions.\nFor his doctoral thesis he studied mathematical logic under the supervision of\nErnest Vessiot\nwho at that time was the Director of the École Normale. On the one hand mathematical logic was a surprising choice, given the lack of interest in that topic in France in this period. However, Herbrand had already made major breakthroughs in the topic while an undergraduate so his success in the area was well established. His doctoral thesis was approved in April\n1929\nbut although his work was to receive the very highest praise, there had been much difficulty in getting a panel together to examine the thesis.\nVessiot\nplayed an important role here, convincing analysts somewhat sceptical about the importance of mathematical logic. In October of the same year Herbrand joined the army for his military service.\nAfter his spell in the army, Herbrand was awarded a Rockefeller fellowship to allow him to study at various places in Europe. His first period, until May\n1931\n, was spent at the University of Berlin where he worked with\nvon Neumann\n. From Berlin, Herbrand went to Hamburg where he spent the month of June working with\nArtin\n. His final visit was to Göttingen where he spent the month of July\n1931\nstudying with\nEmmy Noether\n.\nAfter leaving Göttingen, Herbrand decided on a holiday in the Alps before his intended return to France. However he was never to complete his plans for he died in a mountaineering accident in the Alps only a few days after his holiday began. His death at the age of\n23\nin one of the tragic losses to mathematics. See the newspaper reports of the accident in the article\nHerbrand's accident\n.\nIt is incredible how much Herbrand achieved in the short time he had to undertake mathematical research. He made contributions to mathematical logic where Herbrand's theorem on the theory of quantifiers appears in his doctoral thesis. See\n[\n6\n]\nfor discussion of a gap which was found in Herbrand's proof in\n1963\n.\nHerbrand's theorem establishes a link between quantification theory and sentential logic which is important in that it gives a method to test a formula in quantification theory by successively testing formulas for sentential validity. Since testing for sentential validity is a mechanical process, Herbrand's theorem is today of major importance in software developed for theorem proving by computer.\nHerbrand also worked on field theory considering abelian extensions of\nalgebraic number fields\n. In the few months on which he worked on this topic, Herbrand published ten papers. These papers simplify proofs of results by\nKronecker\n,\nHeinrich Weber\n,\nHilbert\n,\nTakagi\nand\nArtin\n. Herbrand also generalised some of the results by these workers in class field theory as well as proving some important new theorems of his own.\nChevalley\nand Lautman write in\n[\n4\n]\n:-\n[\nHerbrand's\n]\nwork was perfect in abstractness and rigour; but for him the life of mathematical creation was not a spiritual one which led apart from the concrete life of a man; it was the only expression he could give to the interior drama of his imprisoned soul. He lived constantly absorbed in the analysis of the conflicts and duties which gave birth to an inescapable sensitivity within him. It seemed that only the most brilliant successes could be worthy of this life spent in spiritual solitude. The finest works of music and poetry contained for him thoughts close to his own; the unceasing work of his will was no less a matter of conscience to him. It was always necessary for him to unite the elements of an idea or a sensation in a finished construct in order to savour them in advance and to see them come at his will. Thus, the lifelong interest he had in mathematical logic was perhaps born of the wondrous hope of anticipating the future by means of finite calculi and combinations.\nFor more information about\nChevalley\nwritings on Herbrand's thought see the article\nChevalley on Herbrand\n.",
  "matematicos_citados_na_biografia": [
    "Whitehead",
    "Russell",
    "Agrégation",
    "Ernest Vessiot",
    "Vessiot",
    "von Neumann",
    "Artin",
    "Emmy Noether",
    "Herbrand's accident",
    "algebraic number fields",
    "Kronecker",
    "Heinrich Weber",
    "Hilbert",
    "Takagi",
    "Chevalley",
    "Chevalley on Herbrand"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}