{
  "nome_completo": "Jacques Salomon Hadamard",
  "nome_curto": "Jacques Hadamard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hadamard/",
  "data_nascimento": "8 December 1865",
  "local_nascimento": "Versailles, France",
  "data_morte": "17 October 1963",
  "local_morte": "Paris, France",
  "summary": "Jacques Hadamard was a French mathematician whose most important result is the prime number theorem which he proved in 1896 . This states that the number of primes < n tends to infinity as fast as n /log e n .",
  "biografia": "Jacques Hadamard\n's father, Amédée Hadamard, married Claire Marie Jeanne Picard on\n6\nJune\n1864\n. Amédée Hadamard, who was of a Jewish background, was a teacher who taught several subjects such as classics, grammar, history and geography while Jacques' mother taught piano giving private lessons in their home. At the time that Jacques was born Amédée was teaching at the Lycée Impérial in Versailles but the family moved to Paris when Jacques was three years old when his father took up a position at the Lycée Charlemagne.\nThis was an unfortunate time for a child to be growing up in Paris. The Franco-Prussian War which began on\n19\nJuly\n1870\nwent badly for France and on\n19\nSeptember\n1870\nthe Prussians began a siege of Paris. This was a desperate time for the inhabitants of the town who killed their horses, cats and dogs for food. Hadamard's family, like many others, ate elephant meat to survive. Paris surrendered on\n28\nJanuary\n1871\nand the Treaty of Frankfurt, signed on\n10\nMay\n1871\n, was a humiliation for France. Between the surrender and the signing of the treaty there was essentially a civil war in Paris and the Hadamards' house was burnt down.\nThe war was not the only cause of sadness for the Hadamards. Jacques' young sister Jeanne died in\n1870\nbefore the siege of Paris and another sister Suzanne, who was born in\n1871\n, died in\n1874\n.\nJacques began his schooling at the Lycée Charlemagne where his father taught. In his first few years at school he was good at all subjects except mathematics. He excelled in particular in Greek and Latin. He wrote in\n1936\n:-\n... in arithmetic, until the fifth grade, I was last or nearly last.\nHe was not accurate in this statement, for although at first it is true he was weak in arithmetic, by the fifth class he was placed second in his class at the Lycée. By this time\n(1875)\nhe was winning prizes in many subjects in the Concours Général, the national competition for school pupils. It was a good mathematics teacher who turned him towards mathematics and science, when he was in this fifth class.\nIn\n1875\nHadamard's father, having acquired a poor reputation as a teacher, was transferred to the Lycée Louis-le-Grand and Jacques attended this school from\n1876\n. In\n1882\nhe graduated\nBachelier ès lettres et ès sciences\nthen, in the following year, he received his\nBaccalauréat ès sciences\n. He was awarded first prize in algebra and first prize in mechanics in the Concours Général of\n1883\n.\nIn\n1884\nHadamard took the entrance examinations for École Polytechnique and École Normale Supérieure; he was placed first in both examinations. He chose the École Normale Supérieure, where he soon made friends with his fellow students including\nDuhem\nand\nPainlevé\n. Among his teachers were\nJules Tannery\n,\nHermite\n,\nDarboux\n,\nAppell\n,\nGoursat\nand\nÉmile Picard\n. Already at this stage he began to undertake research, investigating the problem of finding an estimate for the\ndeterminant\ngenerated by coefficients of a power series. He graduated from the École Normale Supérieure on\n30\nOctober\n1888\n.\nWhile undertaking research for his doctorate he worked as a school teacher. At first he was attached to the Lycée de Caen but without teaching duties. From June\n1889\nhe taught at the Lycée Saint-Louis and then from September\n1890\nat the Lycée\nBuffon\nwhere he taught for three years. Although his research went extremely well, his teaching was less appreciated, probably because he demanded more of his pupils than their abilities allowed. His one great success was teaching\nFréchet\n, and the two corresponded over a period of about nine years.\nHadamard obtained his doctorate in\n1892\nfor a thesis on functions defined by\nTaylor\nseries. This work on functions of a complex variable was one of the first to examine the general theory of analytic functions, in particular his thesis contained the first general work on singularities.\nIn the same year Hadamard received the Grand Prix des Sciences Mathématiques for his paper\nDetermination of the number of\nprimes\nless than a given number\n. The topic proposed for the prize, concerning filling gaps in\nRiemann\n's work on\nzeta functions\n, had been put forward by\nHermite\nwith his friend\nStieltjes\nin mind.\nStieltjes\nhad claimed in\n1885\nto have proved the\nRiemann hypothesis\nbut had never published his \"proof\" and, after the prize topic was announced in\n1890\n,\nStieltjes\ndiscovered a gap in his \"proof\" which he was unable to fill. He never submitted an entry for the prize but Hadamard, between the time his thesis was submitted and his oral examination, realised that his results could be applied to zeta functions. His paper on\nentire functions\nand zeta functions was awarded first prize.\nThe year\n1892\nwas significant for Hadamard in addition to the academic achievements described above. In June of that year he married Louise-Anna Trénel who was, like Hadamard, of a Jewish background. They had known each other from childhood and shared a love of music. They moved to Bordeaux the following year when Hadamard was appointed as a lecturer at the University. If he had failed to come up to scratch as a teacher at the Lycée\nBuffon\n, this was far from the case now, for he impressed everyone with both his research and teaching skills. On\n1\nFebruary\n1896\nhe was appointed as Professor of Astronomy and Rational Mechanics at Bordeaux.\nThe four years which he spent in Bordeaux were not only busy ones for his family life, with two sons Pierre and Étienne being born during this time, but they were also extremely productive ones for Hadamard's research. He published\n29\npapers during these four years, but they are remarkable more for their depth and the range of the topics which they covered rather than their number. Perhaps his most important result proved during this time was the\nprime number theorem\nwhich he proved in\n1896\n. This states that:-\nThe number of primes ≤\nn\nn\nn\ntends to ∞ as\nn\n/\nln\n⁡\nn\nn/\\ln n\nn\n/\nln\nn\n.\nThis theorem was conjectured in the\n18\nth\ncentury, but it was not proved until\n1896\n, when Hadamard and\n(\nindependently\n)\nCharles de la Vallée Poussin\n, used complex analysis. The proof had been outlined by\nRiemann\nin\n1851\n, but the necessary tools had not been developed at that time. This problem was one of the major motivations for the development of complex analysis from\n1851\nto\n1896\nwhen\nRiemann\n's outlined proof was finally completed.\nSolving this important open problem was not Hadamard's only remarkable contribution of\n1896\n. In the same year he published a paper on properties of dynamic trajectories which won the Bordin Prize of the\nAcademy of Sciences\n. The topic proposed for the prize had been one on geodesics and Hadamard's work in studying the trajectories of point masses on a surface led to certain non-linear differential equations whose solution also gave properties of geodesics. His work was therefore a major contribution to both geometry and to dynamics.\nAnother result which Hadamard published during his time in Bordeaux was his famous determinant inequality of\n1893\n. Matrices whose determinants satisfied equality in the relation are today called\nHadamard matrices\nand are important in the theory of\nintegral equations\n, coding theory and other areas.\nHadamard first became involved in politics during his time in Bordeaux. Alfred Dreyfus, whose wife was a relation of Hadamard, came from Alsace. Born into a Jewish family, Dreyfus embarked on a military career. In\n1894\n, when he was in the War Ministry, he was accused of selling military secrets to the Germans and he was sentenced to life imprisonment. Although his trial had been highly irregular, the anti-Semitic views of many people made the verdict popular. Forged documents and cover-ups soon showed that the legal process had been suspect. At first Hadamard, like many people, assumed that Dreyfus was guilty. However after moving to Paris in\n1897\nhe began to discover how evidence against Dreyfus had been forged. He became a leading member of those trying to correct the injustice.\nPainlevé\ndescribed a conversation he had with Hadamard on the matter in\n1897\n(\nsee for example\n[\n6\n]\n)\n:-\nFor almost an hour,\n[\nHadamard\n]\ntried to convince me of Dreyfus's innocence, and at the end, faced with my disbelief, he did his best to make me understand the intrinsic value of his arguments and his complete lack of passion and sentimentality ... he based his belief in his innocence on the facts.\nIn\n1898\nthe novelist Émile Zola wrote an open letter accusing the army of covering up its mistaken conviction of Dreyfus. The case split France into two opposing camps leading to issues far beyond the guilt or innocence of Dreyfus. There were demands to bring Zola to justice, anti-Semitic riots broke out, and there was a petition demanding that Dreyfus be retried. Zola was sentenced to a year in prison and fined\n3\n,\n000\nfrancs. By\n1899\nthere had been a confession to the forgeries, followed by a suicide, and Dreyfus was retried, again found guilty, but pardoned. Hadamard took an active part in clearing Dreyfus's name which finally happened on\n22\nJuly\n1906\n, when Dreyfus was reinstated and decorated with the Legion of Honour.\nLaurent Schwartz\nwrote\n(\nsee for example\n[\n27\n]\n)\n:-\nIt is the Dreyfus Affair which was in the sense of defence of justice the great affair of\n[\nHadamard's\n]\nlife. From the moment when he understood the enormity of the injustice perpetrated against a man in the name of reason of state, and the consequences which anti-Semitism could have, he devoted himself passionately to the review of the trial. This affair marked his life.\nLong before the Dreyfus Affair had ended Hadamard had, as we have indicated, moved from Bordeaux to Paris. In\n1897\nhe resigned his chair in Bordeaux to take up lesser posts, one in the Faculty of Science of the Sorbonne and one at the Collège de France. Soon after arriving in Paris in October\n1897\n, he published the first volume of\nLeçons de Géométrie Elémentaire\nⓉ\n(\nElementary geometry lessons\n)\n. This volume on two dimensional geometry appeared in\n1898\n, and was followed by a second volume on three dimensional geometry in\n1901\n. This work had been requested by\nDarboux\nand it went on to have a major influence on the teaching of mathematics in France.\nHadamard received the Prix\nPoncelet\nin\n1898\nfor his research achievements over the preceding ten years. His research turned more towards mathematical physics from the time he took up the posts in Paris, yet he always argued strongly that he was a mathematician, not a physicist. He believed that it was the rigour of his work which made it mathematics. In particular he worked on the\npartial differential equations\nof mathematical physics producing results of outstanding importance. His famous\n1898\nwork on geodesics on surfaces of negative curvature laid the foundations of symbolic dynamics. Among the topics he considered were elasticity, geometrical optics, hydrodynamics and\nboundary value problems\n. He introduced the concept of a well-posed initial value and boundary value problem.\nDuring Hadamard's first five years in Paris another three children were born, first another son Mathieu and then two daughters Cécile and Jacqueline. He continued to receive prizes for his research and he was further honoured in\n1906\nwith election as President of the\nFrench Mathematical Society\n. In\n1909\nhe was appointed to the chair of mechanics at the Collège de France. In the following year he published\nLeçons sur le calcul des variations\nⓉ\n(\nLectures on the calculus of variations\n)\nwhich helped lay the foundations of\nfunctional analysis\n(\nhe introduced the word\nfunctional\n)\n. Then in\n1912\nhe was appointed as professor of analysis at the École Polytechnique where he succeed\nJordan\n.\nPoincaré\nhad strongly supported Hadamard for this chair but, within a few months, he died at the tragically young age of\n58\n. Hadamard then undertook the hugely difficult task of surveying\nPoincaré\n's work and by the end of the summer of\n1912\nhe had produced two major articles. As\nPaul Lévy\nwrote:-\nOne had to be Hadamard to dare to undertake the exposition of all of\n[\nPoincaré\n's\n]\nimmense work which dealt with so many different areas, and to finish it in one summer.\nNear the end of\n1912\nHadamard was elected to the\nAcademy of Sciences\nto succeed\nPoincaré\n. He wrote later that his many years of \"pure joy\", beginning from the time of his marriage, came to an end in\n1916\n. It was World War I which led to a great tragedy for Hadamard with his two older sons being killed in action. Both were killed at Verdun and Hadamard was lecturing in Rome when Pierre was killed. He left before receiving the news which he did not discover until arriving back in Paris despite the best efforts of\nFano\n,\nVolterra\n's wife and others to get news to him. Étienne was killed near Verdun about two months later.\nHadamard knew only one way to push the pain of these tragedies away enough to allow him to keep going, and that was to throw himself even more vigorously into mathematics. He was appointed to\nAppell\n's chair of analysis at the École Centrale in\n1920\nbut retained his positions in the École Polytechnique and the Collège de France. During the years between his appointment and\n1933\nhe travelled widely visiting the United States twice, Spain, Czechoslovakia, Italy, Switzerland, Brazil, Argentina, and Egypt.\nHe continued to produce books and papers of the highest quality, publishing perhaps his most famous text\nLectures on Cauchy's problem in linear partial differential equations\nin\n1922\n. The book was based on a lecture course he had given at Yale University in the United States. He also took up new topics, writing several papers on\nprobability theory\n, in particular on Markov chains. He also published many articles on mathematical education and education in general.\nBetween the wars Hadamard's politics moved towards the left, mainly in response to the Nazis rise to power in\n1933\n. After the start of World War II, when France fell in\n1940\n, Hadamard and his family escaped to the United States where he was appointed to a visiting position at Columbia University. However, he failed to find a permanent post in America and in\n1944\nreceived the terrible news that his third son Mathieu had been killed in the war. Hadamard left the United States soon after and spent a year in England before returning to Paris as soon as was possible after the end of the war.\nAfter the War he became an active peace campaigner and it required the strong support of mathematicians in the USA to allow him to enter the country for the International Congress in Cambridge, Massachusetts in\n1950\n. He was made honorary president of the Congress.\nOne further tragedy was to hit Hadamard before his death. In\n1962\n, when he was\n96\nyears old, his grandson Étienne was killed in a mountaineering accident. This seemed to finally kill Hadamard's spirit and he did not leave his house after this, almost waiting to die.\nThe following tribute is paid in\n[\n3\n]\n:-\nHadamard was the doyen not only of the\nAcademy of Sciences\n, to which he was elected in December\n1912\n, in the seat left vacant by the death of\nHenri Poincaré\n, but of the entire Institut de France. In December last year, he was formally presented with a gold medal specially struck to commemorate the fiftieth anniversary of his election to the academy, and tributes were paid to him by scientists all over the world.\nThere is no way that an article of this length can even indicate the range of Hadamard's mathematical contributions. As well as about\n300\nscientific papers and books Hadamard also wrote books for a wider audience. His book\nThe psychology of invention in the mathematical field\n(1945)\nis a wonderful work about mathematics. We should also, however, indicate Hadamard's style of teaching. At the conference to celebrate the centenary of his birth, one of his students said he had been taught by:-\n... a teacher who was active, alive, whose reasoning combined exactness and dynamism. Thus the lecture became a struggle and an adventure. Without rigour suffering, the importance of intuition was restored to us, and the better students were delighted.\nLaurent Schwartz\nspoke about Hadamard at this ceremony held to celebrate the centenary of Hadamard's birth:-\nI believe that he had a fantastic influence on his time, and that all living analysts were shaped by him, directly or indirectly.",
  "matematicos_citados_na_biografia": [
    "Duhem",
    "Painlevé",
    "Jules Tannery",
    "Hermite",
    "Darboux",
    "Appell",
    "Goursat",
    "Émile Picard",
    "determinant",
    "Buffon",
    "Fréchet",
    "Taylor",
    "primes",
    "Riemann",
    "zeta functions",
    "Stieltjes",
    "Riemann hypothesis",
    "entire functions",
    "prime number theorem",
    "Charles de la Vallée Poussin",
    "Academy of Sciences",
    "integral equations",
    "Laurent Schwartz",
    "Poncelet",
    "partial differential equations",
    "boundary value problems",
    "French Mathematical Society",
    "functional analysis",
    "Jordan",
    "Poincaré",
    "Paul Lévy",
    "Fano",
    "Volterra",
    "probability theory",
    "Henri Poincaré"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}