{
  "nome_completo": "James Greig Arthur",
  "nome_curto": "James Arthur",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arthur_James/",
  "data_nascimento": "18 May 1944",
  "local_nascimento": "Hamilton, Ontario, Canada",
  "data_morte": null,
  "local_morte": null,
  "summary": "James Arthur is a Canadian mathematician who has made outstanding contributions to the Langlands programme which relates arithmetic and algebra with analysis and spectral theory. He has been awarded many prizes including the prestigious Wolf Prize and the Leroy P Steele Prize for Lifetime Achievement.",
  "biografia": "James Arthur\nwas the son of James Greig Arthur and Katherine Mary Patricia Scott\n(1918\n-\n2011)\n. James Sr was the son of Rev A J Arthur. Katherine, daughter of Henry Duke Scott and Lillian Mary Scott, was a graduate of St Clement's School and of Trinity College, University of Toronto. James and Katherine had four children. Their first two children were boys: James Greig Arthur, the subject of this biography, and Philip Duke Arthur, born\n25\nJanuary\n1947\n, who became a public accountant. Their two girls were Elizabeth and Katherine. James was born in Hamilton, Ontario and attended Upper Canada College, a boy's school in Toronto, Canada. This school, founded in\n1829\n, served as a high quality feeder school for the University of Toronto. James Arthur was Head Boy at the College in\n1962\n, the year he graduated. James' father and James's younger brother Philip both attended this school. In\n2020\nwhen Arthur was awarded the Upper Canada College Old Boy of Distinction Award, he spoke about his days at the College\n[\n44\n]\n:-\nI was fortunate to go to Upper Canada College. I got a really great foundation. The masters were by and large original thinkers and pretty passionate about what they were teaching. Most of my classmates were imbued with a sense of passion for what they do in life. It was infectious. You learn that attitude. We have memories that go way back. I have a lot of happy memories. There was a sense of irreverence among the boys, and some of their jokes and pranks, while not always amusing to the long-suffering masters, are still funny to us today. By my last year, I was really excited about mathematics and decided it was what I wanted to do as a career.\nAfter graduating from the Upper Canada College, James Arthur entered Trinity College, one of the colleges of the University of Toronto. The staff of the Department of Mathematics when Arthur began his studies included Albert Fenton Pillow,\nFrederick Valentine Atkinson\n, George Francis Denton Duff,\nH S M Coxeter\n, Paul George Rooney and\nG de B Robinson\n. Two other leading mathematicians took up appointments while Arthur was an undergraduate, namely\nHans Heilbronn\n(\nwho arrived in\n1964)\nand\nJacob Lionel Bakst Cooper\n(\nwho arrived in\n1965)\n. Arthur graduated with a B.Sc. in\n1966\nand continued to study at Toronto for his Master's Degree which he was awarded in\n1967\n.\nMany students from the United States and Canada who went on to win major prizes for outstanding research contributions, took part in the William Lowell Putnam Competition and were Putnam fellows, received an Honourable Mention, or were highly placed. James Arthur was certainly an excellent student who was in the Toronto team for the Putnam Competition but, at this stage, did not show the \"genius\" ability that some others showed. He said\n[\n5\n]\n:-\nI was not a prodigy in mathematics as a child. As a matter of fact, I am quite happy that my record for the Putnam exams was not available to the Prize Committee. But I do remember being fascinated even as a child by what was said to be the magic and power of mathematics.\nArthur went to Yale University to undertake research for a Ph.D. advised by\nRobert Langlands\n. He was awarded a Ph.D. in\n1970\nfor his thesis\nHarmonic Analysis of Tempered Distributions on Semisimple Lie Groups of Real Rank One.\nIn it he writes\n[\n9\n]\n:-\nI would like to express my deep gratitude to Professor\nRobert Langlands\nfor his constant guidance and encouragement. He suggested the problem for this dissertation, and over the past two years has been more than generous with both his time and his ideas. I would also like to acknowledge a debt of a different sort to Professor\nHarish-Chandra\n. As will become evident to the reader, the results of this dissertation lean heavily upon Professor\nHarish-Chandra\n's work.\nAfter graduating from Yale with a Ph.D., Arthur was appointed as an Instructor in Mathematics at Princeton University. There he met Dorothy Pendleton Helm who was appointed as an Instructor in Romance Languages at Princeton University in\n1970\n. In\n[\n48\n]\nshe gives this account of her career up to that point:-\nDorothy Pendleton Helm Arthur was born in Louisville, Kentucky, in\n1943\n. After graduating from Sacred Heart Academy in Louisville, she obtained a B.S. in\n1964\nfrom Georgetown University's School of Languages and Linguistics, where she studied French, Spanish, and linguistics. She began her graduate studies at Brown University in\n1966\n, completing an A.M. in\n1968\n; her thesis, \"The Royalist of Ferney: A Study of Voltaire during the Maupeou Revolution,\n1768\n-\n74\n,\" was directed by Prof Durand Echeverria. After being admitted to candidacy for the Ph.D., she received a Woodrow Wilson Dissertation Fellowship in\n1969\nand planned to specialise in Ronsard's early sonnets and Renaissance mythology.\nJames Arthur and Dorothy Pendleton Helm were married in Princeton on\n10\nJune\n1972\n. They had two children and we will pause our biography to say a little about these two boys. James Pendleton Arthur was born in\n1974\nand is now a poet. He spoke about his upbringing in\n[\n36\n]\n:-\nMy dad, a mathematician, raised me to believe that mathematics is beautiful, so maths is a part of my imaginative terrain. In my late\n20\ns I wrote several\n11\n-line poems because I wanted to create poems that couldn't be uniformly divided into couplets, tercets, or quatrains,\n11\nbeing a prime number. One of those\n11\n-liners, \"On Day and Night,\" did make it into my first book. From my perspective, \"On Day and Night\" is about indivisibility, and about the idea that few things in this world are actually as classifiable as they seem.\nJames and Dorothy Arthur's younger son is David Greig Arthur who became a mathematician and computer scientist working for Google as a software engineer\n[\n11\n]\n:-\nOriginally from Toronto, David received his B.S. in mathematics and computer science from Duke University and his PhD in theoretical computer science from Stanford University. Though David's Ph.D. is in computer science, he says his Ph.D. thesis was \"\n100\npages of mathematical proofs, with no computers anywhere to be seen!\"\nHe did perform at the \"genius\" level in mathematics competitions\n[\n11\n]\n:-\nIn\n1999\nand\n2000\n, David was a member of the Canadian student team to the International Mathematical Olympiad\n(\nIMO\n)\n. In\n2000\n, David received a gold medal and was only\n4\npoints away from a perfect score. Participating in the IMO was an unforgettable experience for David. \"The IMO was a chance to see something beautiful, to meet people from across the world, and to excel at something I cared about,\" he says. Today, David carries on supporting Canada at the IMO, having acted as the Deputy Team Leader for the\n2009\nand\n2011\nevents. \"It is no less inspiring to meet the world's best mathematicians now than it was ten years ago,\" says David.\nAfter two years at Princeton, James Arthur was appointed as an Assistant Professor of Mathematics at Yale University. His first publication was\nThe Selberg trace formula for groups of F-rank one\nwhich was published in the\nAnnals of Mathematics\nin\n1974\n. The\n60\n-page paper begins:-\nAn important tool for the study of automorphic forms is a non-abelian analogue of the\nPoisson\nsummation formula, generally known as the\nSelberg\ntrace formula. There have been a number of publications on the subject following\nSelberg\n's original paper\n[\nHarmonic analysis and discontinuous groups in weakly symmetric Riemannian spaces with applications to Dirichlet series\n(1956)]\n, ... . With the exception of\nSelberg\n's brief account\n[\nDiscontinuous groups and harmonic analysis\n(1962)]\n, however, most authors have restricted themselves to the groups SL\n(2)\nand GL\n(2)\n. In this paper we develop the formula for a wider class of groups.\n...\nMost of the methods used in this paper originate with\nSelberg\n(\nsee\n[\nDiscontinuous groups and harmonic analysis\n(1962)])\n, including the ideas behind the proof of Theorem\n3\n.\n2\nand the convergence of the integrals in §\n8\n. These were described to me by\nRobert Langlands\nwhom I would like to thank for his encouragement. I am also grateful for the comments of Stephen Gelbart, who read through the original manuscript.\nWhile working as an Assistant Professor of Mathematics at Yale University, Arthur was awarded a Yale University Junior Faculty Fellowship which he held at Institute Des Hautes Etudes Scientifiques, Bures-sur-Yvette, France in\n1974\n-\n75\n. During this time he published further major papers including the\n30\n-page paper\nSome tempered distributions on semisimple groups of real rank one\n(1974)\nwhich begins:-\nThe\nSelberg\ntrace formula leads naturally to the study of certain tempered distributions on reductive groups defined over local fields. An important problem is to calculate the\nFourier\ntransforms of these distributions. We shall consider this question for the case that the local field is R and the group G is semisimple and has real rank one.\nHe also published the major\n56\n-page paper\nThe characters of discrete series as orbital integrals\n(1976)\n. This paper gives his address as Bures-sur-Yvette, France, and gives important generalisations of\nHarish-Chandra\n's results. Ernest A Thieleker writes in the review\n[\n42\n]\n:-\nThe methods of proof involve generalisations of\nHarish-Chandra\n's theory of the differential equations satisfied by invariant integrals. In the course of the proof an explicit formula for the volume function ν is also developed. The proof of this formula depends on a lemma of\nLanglands\nwhose detailed proof is published here for the first time.\nIn\n1975\nArthur was awarded a Sloan Fellowship which he held at the Institute for Advanced Study, Princeton being a member of the Institute from July\n1976\nto June\n1977\n. He was promoted to Professor at Duke University in\n1976\nbut returned to Canada in\n1978\nwhen he was appointed as a Professor in the Department of Mathematics at the University of Toronto. He has remained at the University of Toronto throughout the rest of his career. In\n1987\nhe was made a \"University Professor\" and in\n2007\nhe was also named as \"Ted Mossman Chair in Mathematics\". The appointment to the Ted Mossman Chair in Mathematics is at the level of Professor with tenure, and the Chair holder has to be to be an outstanding mathematician, whose research and teaching make a major contribution to the quality and stature of the department.\nIn\n1982\nArthur was awarded an E W R Steacie Memorial Fellowship by the Natural Sciences and Engineering Research Council of Canada. These fellowships were awarded:-\n... to recognise early stage academic researchers in the natural sciences and engineering and to enhance their research capacity so that they could become leaders in their field and inspire others.\nIn\n1987\nArthur received the\nJohn L Synge\nAward. This was the first of many awards and prizes: for details of twelve of these, see\nTHIS LINK\n.\nArthur has twice been an invited speaker at the International Congress of Mathematicians. The first was in\n1983\nin Warsaw when he addressed 'Section\n8\n:\nLie\ngroups and representations' giving the talk\nThe trace formula for noncompact quotient\n. His talk begins:-\nIn papers in\n1956\nand\n1962\n,\nSelberg\nintroduced a trace formula for a compact, locally symmetric space of negative curvature. There is a natural algebra of operators on any such, space which commute with the Laplacian. The\nSelberg\ntrace formula gives the trace of these operators. Selberg also pointed out the importance of deriving such a formula when the symmetric space is assumed only to have finite volume. Then the\nLaplace\noperator will have continuous as well as discrete spectrum; it is the trace of the restriction of the operator to the discrete spectrum that is sought.\nSelberg\ngave such a formula for the quotient of the upper half plane by\nS\nL\n(\n2\n,\nZ\n)\nSL(2, \\mathbb{Z})\nS\nL\n(\n2\n,\nZ\n)\n.\nSelberg\nalso suggested how to extend the formula to any locally symmetric space of rank\n1\n. Spaces of rank\n1\nare the easiest noncompact ones to handle for they can be compactified in a natural way by adding a finite number of points. I have recently obtained a trace formula for spaces of higher rank. I shall illustrate the formula by looking at a typical example.\nHis second invitation to address the International Congress of Mathematicians was in Berlin in\n1998\n. At this Congress he addressed 'Section\n7\n. Lie Groups And Lie Algebras' giving the talk\nTowards a Stable Trace Formula\n. The Abstract states:-\nThe paper is a report on the problem of stabilising the trace formula. The goal is the construction and analysis of a stable trace formula that can be used to compare automorphic representations on different groups.\nFor a brief overview of Arthur's research contributions up to\n2003\n, see\nTHIS LINK\n.\nArthur has been elected to leading Academies and Societies. He has been elected: a Fellow of the Royal Society of Canada\n(1980)\n; a Fellow of the\nRoyal Society of London\n(1992)\n; a Foreign Honorary Member of the\nAmerican Academy of Arts and Sciences\n(2003)\n; a Fellow of the\nAmerican Mathematical Society\n(2012)\n; a Foreign Associate of the\nNational Academy of Sciences\n(\nUS\n)\n(2014)\n; and a Fellow of the\nCanadian Mathematical Society\n(2019)\n. When elected to the\nNational Academy of Sciences\n, his research interests were given as follows\n[\n23\n]\n:-\nJames Arthur works in the area of mathematics called automorphic representations. These objects date back to the nineteenth century, but in recent years have come to occupy a central place in mathematics known as the\nLanglands\nprogram. The conjectures of\nRobert Langlands\nthat define the programme are still largely unresolved. Roughly speaking, they assert that concrete spectral data wrapped up in automorphic representations govern fundamental processes from quite different domains of mathematics. One of the primary tools for analysing automorphic representations has been a complex trace formula that relates this spectral data to various kinds of geometric data. It was introduced in special cases by\nSelberg\nin\n1956\n, and was then established for general groups by Arthur over the later period from\n1975\nto\n2000\n. Arthur has used the trace formula to classify certain automorphic representations and establish some cases of the\nLanglands\nconjectures. He is now working on the central premise of the\nLanglands\nprogram known as the principle of functoriality.\nIn\n2003\nArthur was nominated by\nRobert Langlands\nto become president of the\nAmerican Mathematical Society\nin February\n2005\n. In this nomination we learn about Arthur's talents other than research. For example,\nLanglands\nwrites\n[\n34\n]\n:-\nBeginning in\n1997\n, and recently appointed for a second five-year term to end in\n2007\n, he has been an Academic Trustee at the Institute for Advanced Study, responsible, in particular, for explaining mathematics and mathematicians to the other members of the Board of Trustees, who are largely drawn from the world of business and finance. He always carefully arms himself with a knowledge of the broad spectrum of scientific activities of the Institute's School of Mathematics and the details of its yearly programs, but his best weapon when articulating our needs and achievements before the Board has perhaps been his conviction of the importance of defending the place of mathematics in the academic world and in society as a whole. I suspect at the same time that he simply enjoys cultivating the art of persuasion.\nIn the nomination, Robert Pritchard, the former President of the University of Toronto is quoted regarding Arthur's work on many university committees\n[\n34\n]\n:-\nJim has served on many of the University's most important special committees ... Why is he chosen? Because he ... personifies our highest aspirations, has superb academic and scholarly judgement, has very high standards, is utterly reliable, is highly courteous, is practical and not just a theorist, always acts in a principled way, and conducts himself with dignity in all situations. He is a very special person quite apart from being a superb mathematician. He is extremely considerate of others and listens hard to competing views. He's fair and will always work to do the right thing.\nAfter being elected as President of the\nAmerican Mathematical Society\n, Arthur was interviewed before taking up the role. He spoke about the public interest in mathematics\n[\n18\n]\n:-\nThere is a sympathetic curiosity about mathematics. People don't know what mathematicians do, but they somehow have the feeling that mathematics has mystery, power, and beauty. I think people who are not mathematicians have a sense of that. We should stoke their curiosity. We already do so, but I think we can do more. This is probably the most important aspect of strengthening mathematics in the United States and around the world. To have public sympathy and interest in mathematics would help just about everything that concerns us as mathematicians. It would persuade more talented young people to go into mathematics, because mathematics would be regarded with interest, and maybe even awe, by their parents and their friends, and would seem to be a worthy cause to spend one's life pursuing. It would help funding for mathematics, because voters would have a sympathy for it. Also, public appreciation of the beauty of mathematics would help encourage good people to become high school teachers.\nIn the\n2014\ninterview\n[\n47\n]\nArthur spoke about the importance of having good mathematics teachers:-\nIf teachers are not comfortable with maths and do not really understand it, they are not going to like it. And if children don't like it, they will certainly not want to think about it. Thinking about maths is extremely important for students, not just in the half hour or hour of a maths class but at other times as well, just because it is interesting. We need teachers who love maths, and who are free to communicate it in their own way. In my opinion, this is by far the most important thing. Students love to be taught by someone with a passion for a subject. Mathematics can seem beautiful and mysterious and powerful to anyone, but especially to impressionable children. They might laugh at an eccentric teacher with a passion for something as arcane as mathematics, but that is part of the deal. Once students plug in, they will start thinking about maths out of curiosity, and that is how they become strong.\nArthur was very active in the mathematical community outside the University of Toronto. He had many editorial roles: on the Editorial Advisory Board of the\nJournal für die reine und angewandte Mathematik,\nGöttingen, from\n1985\n; on the Editorial Advisory Board of the\nJournal\nof the\nAmerican Mathematical Society\n(1988\n-\n2002)\n; an Associate Editor for the\nCanadian Journal of Mathematics\nand the\nCanadian Mathematical Bulletin\n(1986\n-\n1991)\n; on the Editorial Board of\nInternational Mathematics Research Notices\n, Duke University\n(1991\n-\n2000)\n; and as the Editor of the\nWorld Directory of Mathematicians\n(1997\n-\n98\n,\n2001\n-\n2002)\n. He served on numerous committees including: the Executive Committee of the\nInternational Mathematical Union\n(1991\n-\n1998)\n; the NSERC Grant Selection Committee for Mathematics\n(1988\n-\n1991)\n; the Academy Fellowship Review Committee of the Royal Society of Canada\n(1991\n-\n1993)\n; the National Program Committee of the\nAmerican Mathematical Society\n(1989\n-\n1991)\n; the Committee on Committees of the\nAmerican Mathematical Society\n(1991\n-\n1992)\n; the Steering Committee for Centre de Recherches Mathematiques, University of Montreal\n(1989\n-\n1992)\n; the Nominating Committee of the\nFields\nInstitute\n(1992\n-\n1996)\n; the Selection Committee for\n2002\nFields\nMedals, International Mathematical Union; and the Search Committee for President of the Clay Mathematics Institute\n(2003)\n. Of the many duties that he undertook let us mention: Convenor for Mathematics Division, Royal Society of Canada\n(1988\n-\n1990)\n; and the Academic Trustee for Mathematics for the Institute for Advanced Study, Princeton\n(1997\n-\n2007)\n.\nArthur was awarded an honorary degree by the University of Ottawa in\n2002\n. His Profile for the award states\n[\n7\n]\n:-\nJames Arthur is regularly cited as perhaps the best and most immediately influential mathematician currently active in Canada. His work stands at the forefront of a bold initiative to unify the diverse branches of pure mathematics. Through more than three decades as a mathematician, Arthur charted a course for himself with way stations spanning the globe.\nLet us end our biography by giving the Abstract or the three Virginia Mathematics Lectures\n(\ni\n)\nL-functions and Number Theory\n,\n(\nii\n)\nThe Trace Formula and Automorphic Forms\n, and\n(\niii\n)\nBeyond Endoscopy and Functoriality\nwhich he gave\n14\n-\n16\nNovember\n2016\n[\n20\n]\n:-\nNumber theory is founded on the basic properties of integers and prime numbers. But its study these days is increasingly leading us to the far reaches of some of the most diverse and powerful areas of mathematics. Nowhere is this more apparent than in the\nLanglands\nprogram, which represents a profound unifying force for mathematics.\nWe shall try to introduce the\nLanglands\nprogram through the theory of L-functions. These are infinite series that look like the famous Riemann zeta function, except that they have nontrivial coefficients. The information that goes into the coefficients is in fact very interesting, and gives an elegant way of organising fundamental data from number theory, representation theory and algebraic geometry. The\nLanglands\nprogram postulates deep relationships among different L-functions, and hence also the data in their coefficients.\nWe shall discuss these matters, and explain how they are part of the theory of automorphic forms. We shall then describe the trace formula, which has led to important results in the classification of automorphic representations. If time permits, we shall also say something about Beyond Endoscopy, a proposal by\nLanglands\nfor attacking the central conjecture of the subject known as the Principle of Functoriality.",
  "matematicos_citados_na_biografia": [
    "Frederick Valentine Atkinson",
    "H S M Coxeter",
    "G de B Robinson",
    "Hans Heilbronn",
    "Jacob Lionel Bakst Cooper",
    "Robert Langlands",
    "Harish-Chandra",
    "Poisson",
    "Selberg",
    "Fourier",
    "Langlands",
    "John L Synge",
    "THIS LINK",
    "Lie",
    "Laplace",
    "Royal Society of London",
    "American Academy of Arts and Sciences",
    "American Mathematical Society",
    "National Academy of Sciences",
    "Canadian Mathematical Society",
    "International Mathematical Union",
    "Fields"
  ],
  "imagens": [
    "arthur_james.jpg"
  ]
}