{
  "nome_completo": "James P Pierpont",
  "nome_curto": "James Pierpont",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pierpont/",
  "data_nascimento": "16 June 1866",
  "local_nascimento": "New Haven, Connecticut, USA",
  "data_morte": "9 December 1938",
  "local_morte": "San Mateo, California, USA",
  "summary": "James Pierpont was an American mathematician who worked on the Galois theory of equations.",
  "biografia": "James Pierpont\n's father was Cornelius Pierpont, a well-off businessman living in New Haven. The Pierpont family had lived for many generations in New Haven. One of the early members, also named James Pierpont\n(1659\n-\n1714)\n, was a graduate of Harvard University and a founder of The Collegiate School of Connecticut in\n1701\nwhich shortly after was named Yale College. James, the subject of this biography, was one of his parents' four children. He had one older brother, one younger brother and a sister. He attended New Haven High School where he prepared for a college education. After graduating from high school, he entered Worcester Polytechnic Institute, taking courses there which would lead to him becoming a mechanical engineer. However, as he progressed he realised that it was pure mathematics which interested him far more than the practical aspects of engineering. He graduated with a B.S. in\n1886\nbut already he had made plans to study pure mathematics at some of the top European universities.\nOf course one has to realise that the college education that Pierpont had received in no way prepared him for doctoral studies so he had to go through the full range of undergraduate and postgraduate studies in Europe. He adopted the standard German experience of moving between various different universities but the majority of his first few years of study were spent at the University of Berlin. There he was taught by the leading mathematicians of the day including\nLazarus Fuchs\n,\nKarl Weierstrass\nand\nLeopold Kronecker\n. However, it was\nKronecker\n's algebraic school that influenced Pierpont most and this influence could clearly be seen in Pierpont's work for many years. The last few years of Pierpont's European training were spent at the University of Vienna where he undertook research for his doctorate. There he was advised by Gustav Ritter von Escherich and, from\n1893\nonwards, also by\nLeopold Gegenbauer\nwho was appointed to Vienna in that year. Von Escherich\n(1849\n-\n1935)\n, an expert on analytical geometry, had been appointed to the University of Vienna in\n1884\n. Pierpont was awarded a doctorate in\n1894\nfor his thesis\nZur Geschichte der Gleichung fünften Grades bis zum Jahre\n1858\nⓉ\n(\nOn the history of the fifth degree equation up to the year\n1858\n)\n. He had enjoyed his six years in Europe and made many good friends such as\nWilhelm Wirtinger\nwho had\nhabilitated\nin Vienna in\n1890\n.\nØystein Ore\nwrites\n[\n3\n]\n:-\nThis period of studies was a very happy one, and in his later years Pierpont liked to reminisce about it, repeating often what a revelation the acquaintance with European mathematics and mathematicians had been to him.\nAfter the award of his doctorate, Pierpont returned to the United States where he was appointed a Lecturer in Mathematics at Yale in\n1894\n. He held this position for a year and then was appointed an Instructor in Mathematics in\n1895\n. The\nAmerican Mathematical Society\nheld its first Colloquium at Buffalo in September\n1896\n. Two series of lectures were given, one by Maxime Bôcher on\nLinear Differential Equations, and their Application\nand the other by Pierpont on\nGalois's Theory of Equations\n.\nBôcher\n's lectures were not published, but those by Pierpont appeared in the\nAnnals of Mathematics\nin\n1900\n. In the autumn of\n1896\nPierpont became an Assistant Professor at Yale, then in\n1898\nhe was appointed as a full professor. The title of his Colloquium lectures is a good indication of Pierpont's main interests in the period up to his appointment to a full professorship. He published some nicely written articles, but there is little in them in the way of original results. He also wrote some good historical articles on the theory of equations such as\nLagrange's place in the theory of substitutions\n(1894)\n, and\nEarly history of Galois' theory of equations\n(1897)\n.\nHe attended the summer meeting of the\nGerman Mathematical Society\nat Munich in September\n1899\n. From this time on he became interested in the theory of functions of a real variable and integration, publishing papers such as\nOn multiple integrals\n(1905)\nand\nOn improper multiple integrals\n(1906)\n. Between these two papers his first book was published, the first volume of the two-volume text\nLectures on the Theory of Functions of Real Variables\n(1905)\n. He explains in the Preface what his motivation was in writing the book:-\nThe student of mathematics, on entering the graduate school of American universities, often has no inconsiderable knowledge of the methods and processes of the calculus. He knows how to differentiate and integrate complicated expressions, to evaluate indeterminate forms, to find maxima and minima, to differentiate a definite integral with respect to a parameter, etc. But no emphasis has been placed on the conditions under which these processes are valid. Great is his surprise to learn that they do not always lead to correct results. ... The problem therefore arises to examine more carefully the conditions under which the theorems and processes of the calculus are correct, and to extend as far as possible or useful the limits of their applicability.\nG A Miller\nwrites in a review\n[\n2\n]\n:-\n... one feels that one is being led by a master of his subject and a sympathetic teacher, and these elements combined with the nature of the subject make the present work one of the most significant publications on pure mathematics that have ever appeared in this country.\nPhilip Jourdain\n, however, does have some criticisms in his review. For example\n[\n1\n]\n:-\nI am here doubting the advisability of any mode of exposition which leads to the remark of Prof Pierpont: \"It is too early to make the reader see the necessity of this step. ...\" If it is ever advisable to teach mathematics in this way, it is by introducing the student by a path which can never be used for the discovery of any important truths.\nHowever, on the whole,\nJourdain\ntoo heaps praise on the book\n[\n1\n]\n:-\nIts chief excellencies seem to be:\n(1)\nThe introduction of various current inaccurate statements as examples in criticism ...\n(2)\nanalytical representations of some apparently 'lawless' functions. ...\n(3)\nexamples of continuous functions lacking differential quotients at isolated points, -- functions often ignored by teachers ...\n(4)\nthe careful distinction between \"any\" and \"every,\" which is often neglected.\nThe second volume of\nLectures on the Theory of Functions of Real Variables\nwas published in\n1912\n. Pierpont writes in the Preface:-\nThe present volume has been written in the same spirit that animated the first. The author has not intended to write a treatise or a manual; he has aimed rather to reproduce his university lectures with necessary modifications, hoping that the freedom in the choice of subjects and in the manner of presentation allowable in a lecture room may prove helpful and stimulating to a larger audience.\nPierpont's next textbook was\nFunctions of a complex variable\n(1914)\n. He explains in the Preface what drove his choice of approach and topics:-\nThe present volume has arisen from lectures on the 'Theory of Functions of a Complex Variable' which the author has been accustomed to give to juniors, seniors, and graduate students at Yale University during the last twenty years. As these students often do not intend to specialise in mathematics, many topics which might properly find a place in a first course in the function theory have not been treated for example\nRiemann\n's surfaces. On the other hand the author, having in mind the needs of the students of applied mathematics, has dwelt at some length on the theory of linear differential equations, especially as regards the functions of\nLegendre\n,\nLaplace\n,\nBessel\n, and\nLamé\n. As a splendid application of the principles of the function theory and also on account of their intrinsic value, three chapters have been devoted to the elliptic functions.\nThese books were based on courses Pierpont taught at Yale, so it is clear that he derived pleasure from lecturing.\nOre\ngives this description\n[\n3\n]\n:-\nHe enjoyed teaching and contact with the students, and he usually succeeded in transmitting some of his own enthusiasm to them. His lectures were forceful and clear and showed the impression of his wide knowledge of mathematics. At times this knowledge would throw him off on a tangent so that his lecture would end in fields far from the scheduled subject, to the delight of the enthusiastic students and to the grief of those whose interests were chained to the text of the day. He spent considerable time with the students, discussed and gave advice and helped them both mathematically and otherwise.\nIn addition to the\nAmerican Mathematical Society\nColloquium Lectures that he gave in Buffalo in\n1896\n, Pierpont address the International Congress of Arts and Science in St Louis in September\n1904\non the\nHistory of Mathematics in the Nineteenth Century\n, he addressed the\nAmerican Mathematical Society\nsummer meeting at Wellesley in\n1921\non\nSome mathematical aspects of the theory of relativity\n, he gave the\nGibbs\nLecture in Kansas City in\n1925\non\nSome modern views of space\n, he addressed the annual meeting at Nashville in\n1927\non\nMathematical rigor, past and present\n, he addressed the annual meeting at New York in\n1928\nOn the motion of a rigid body in a space of constant curvature,\nand the annual meeting at Berkeley in\n1929\non\nNon-Euclidean geometry, a retrospect\n.\nAmong the service he gave to the\nAmerican Mathematical Society\n, we note that he served on the Council three times:\n1899\n-\n1901\n,\n1927\n-\n1929\n, and\n1931\n-\n1933\n. He was honoured by being elected Vice-President of the Society in\n1905\n. He was awarded two honorary degrees: Yale University in\n1899\nand Clark University in\n1909\n. In\n1923\nhe was named Erastus L DeForest Professor of Mathematics at Yale.\nTo get a feeling for Pierpont as a man let us quote\nOre\nagain\n[\n3\n]\n:-\nPierpont enjoyed friends, company, and conversation. Walking was his only exercise. He loved a good discussion and when one came to see him it usually would not be long before one was drawn into some argument. Even if one at times would disagree with him, it was impossible not to admire his wide knowledge and memory. Personally he was always very modest about his own achievements. At times he could show a burst of temper, mostly in cases where matters of principle were involved, sometimes in meetings of the department or faculty.\nFinally let us record some of Pierpont's more amusing aspects. For many years he held the record for borrowing the largest number of books from the Yale University library. The range of topics that interested him was enormous; science, literature, geography, biography, travel and languages to name just a few. He could write equally well with his left and right hand and, even more surprisingly, he could write upside-down - a useful skill when teaching students.",
  "matematicos_citados_na_biografia": [
    "Lazarus Fuchs",
    "Karl Weierstrass",
    "Leopold Kronecker",
    "Kronecker",
    "Leopold Gegenbauer",
    "Wilhelm Wirtinger",
    "habilitated",
    "Øystein Ore",
    "American Mathematical Society",
    "Bôcher",
    "German Mathematical Society",
    "G A Miller",
    "Philip Jourdain",
    "Jourdain",
    "Riemann",
    "Legendre",
    "Laplace",
    "Bessel",
    "Lamé",
    "Ore",
    "Gibbs"
  ],
  "imagens": [
    "pierpoint.jpg"
  ]
}