{
  "nome_completo": "James Stuart",
  "nome_curto": "James Stuart",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stuart/",
  "data_nascimento": "2 January 1843",
  "local_nascimento": "Balgonie, Fife, Scotland",
  "data_morte": "13 October 1913",
  "local_morte": "Carrow Abbey,  England",
  "summary": "James Stuart was a Scottish educational pioneer and politician.",
  "biografia": "James Stuart\n's father was  Joseph Gordon Stuart\n(\nborn in Edinburgh about\n1816)\nwho owned a Flax Spinning Mill in Milton of Balgonie in Fife. In the\n1861\ncensus he is recorded as employing\n225\npeople. James' mother was  Catherine Booth\n(\nborn in Edinburgh about\n1816)\n.\nJames Stuart received his school education at Madras College, St Andrews and then attended St Andrews University, graduating in\n1861\n. He proceeded to Cambridge, supported by a Ferguson scholarship and a scholarship from Trinity College. On graduating as third\nwrangler\nin\n1866\n, he was elected to a fellowship at Trinity.\nAn educational pioneer, he established lecture courses in several towns around England and he supported the education of women. He also supported London and Oxford in setting up similar extension courses. From\n1875\nto\n1889\n, Stuart was Professor of Mechanism and Applied Mechanics at Cambridge\n(\na precursor of the Engineering department\n)\n, but he resigned following Senate opposition to his emphasis on practical training and to his radical politics. He was among the first in Cambridge to lecture on\nClerk Maxwell\n's theory of electricity and magnetism.\nHe married Laura Elizabeth Colman\n(\nNorwich, Norfolk,\n1859\n-\n1920)\nat Norwich, Norfolk in\n1890\n.\nHe was a backbench Member of Parliament during\n1884\n-\n1900\nand\n1906\n-\n10\n, when he supported votes for women and reform of the House of Lords. He was appointed a Privy Councillor in\n1909\n.\nHe was awarded an Honorary LL.D by St Andrews University in\n1876\n, and he served as Rector of the University during\n1898\n-\n1901\n. His wife was the eldest daughter of J J Colman, MP, the mustard manufacturer. From\n1898\n, Stuart took over management of the firm.",
  "matematicos_citados_na_biografia": [
    "wrangler",
    "Clerk Maxwell"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}