{
  "nome_completo": "James Stirling",
  "nome_curto": "James Stirling",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stirling/",
  "data_nascimento": "May 1692",
  "local_nascimento": "Garden (near Stirling), Scotland",
  "data_morte": "5 December 1770",
  "local_morte": "Edinburgh, Scotland",
  "summary": "James Stirling was a Scottish mathematician whose most important work Methodus Differentialis in 1730 is a treatise on infinite series, summation, interpolation and quadrature.",
  "biografia": "James Stirling\n's father was Archibald Stirling and his mother, Archibald Stirling's second wife, was Anna Hamilton. James was their third son and he was born on the family estate at Garden, about\n20\nkm west of the Scottish town of Stirling. The family were strong supporters of the Jacobite cause and this was to have a significant influence on James Stirling's life.\nThe Jacobite cause was that of the Stuart king, James II\n(\nof Britain -- James VII of Scotland: Jacobus in Latin\n)\n, exiled after the Revolution of\n1688\n, and his descendants. Scotland was united to England and Wales in\n1707\n. The Stuarts were Scottish but Roman Catholics and therefore they had only limited support. They did, however, offer an alternative to the British crown with an exiled court in France which had strong support from many such as the Stirling family. When James Stirling was about\n17\nhis father was arrested, imprisoned and accused of high treason because of his Jacobite sympathies. However he was acquitted of the charges.\nNothing is known of Stirling's childhood or indeed about his undergraduate years in Scotland. The first definite information that we know is that he travelled to Oxford in the autumn of\n1710\nin order to matriculate there. Indeed Stirling matriculated at Balliol College Oxford on\n18\nJanuary\n1711\nas a Snell Exhibitioner.\nThe terms of the Snell Exhibitions is described in\n[\n3\n]\n:-\nThe Snell Exhibitions to Balliol College were established by the will of an Ayrshire man John Snell\n(1629\n?-\n1679)\n. They were originally intended for Scottish students within Scotland who had not graduated and who would subsequently return to Scotland as priests of the Church of England. Nominations were to be made by the College of Glasgow, one of the requirements of candidates being that they should have spent at least one year at Glasgow.\nBased on this, together with information from Ramsay\n(\nsee\n[\n4\n]\n)\nwho knew Stirling in later life and wrote that he was:-\nbred at the University of Glasgow\nit is usual to state that indeed Stirling studied at the University of Glasgow\n(\nas is done in\n[\n1\n]\n)\n. However this is not absolutely certain. We know that Ramsay is not always completely reliable. Stirling's name does not appear in the list of students matriculating at Glasgow\n(\nnot all student's names occur so this is not very significant\n)\n. Tweddle\n[\n3\n]\nnotes that a student with the name 'James Stirling' matriculated at the University of Edinburgh on\n24\nMarch\n1710\n, did not graduate, and has a signature which is similar to that of the mathematician. Another fact, which is not insignificant, is that Stirling's father was a graduate of Edinburgh. It would be nice to solve this and many other puzzles associated with Stirling's life but they may always remain as puzzles.\nStirling was awarded a second scholarship in October\n1711\n, namely the Bishop Warner Exhibition. He should have sworn an oath when matriculating but his Jacobite sympathies would not let him do this and he was excused. Queen Anne died in August\n1714\nand the German, George I, acceded to the British throne. In\n1715\nthere was the first Jacobite Rebellion, which melted away after the drawn Battle of Sheriffmuir on\n13\nNovember\n1715\n. However the concession of allowing Stirling not to swear the oath was withdrawn. He lost his scholarships when he continued to refuse to take the oath. Then he was accused of corresponding with Jacobites who had been involved in planning the rebellion. Life must have been difficult for him at this time and he even appeared at the assizes charged with 'cursing King George' but he was acquitted.\nCertainly Stirling could now not graduate from Oxford but he remained there for some time. In the minutes of a meeting of the\nRoyal Society of London\non\n4\nApril\n1717\n, when\nBrook Taylor\nlectured on extracting roots of equations and on logarithms, it is recorded:-\nMr Stirling of Balliol College Oxford had leave to be present.\nIn\n1717\nStirling published his first work\nLineae Tertii Ordinis Neutonianae\nⓉ\n(\nNewton's third order curves\n)\nwhich extends\nNewton\n's theory of plane curves of degree\n3\n, adding four new types of curves to the\n72\ngiven by\nNewton\n. The work was published in Oxford and\nNewton\nhimself received a copy of the work which is dedicated to the Venetian ambassador Nicholas Tron.\nLineae Tertii Ordinis Neutonianae\ncontains other results that Stirling had obtained. There are results on the curve of quickest descent, results on the\ncatenary\n(\nin particular relating this problems to that of placing spheres in an arch\n)\n, and results on orthogonal trajectories. The problem of orthogonal trajectories had been raised by\nLeibniz\nand many mathematicians worked on the problem in addition to Stirling, including\nJohann Bernoulli\n,\nNicolaus\n(\nI\n)\nBernoulli\n,\nNicolaus\n(\nII\n)\nBernoulli\n, and Leonard\nEuler\n. It is known that Stirling solved the problem early in the year\n1716\n.\nIn\n1717\nStirling went to Venice. The Venetian ambassador Tron left London to return to Venice in June\n1717\nand it is almost certain that Stirling travelled with him. Stirling seems to have been promised a chair of mathematics in Venice but, for some reason that is not known, the appointment fell through. What Stirling did in Venice is also not known but he certainly continued his mathematical research.\nStirling certainly was in Venice in\n1719\nsince he submitted a paper\nMethodus differentialis Newtoniana illustrata\nⓉ\n(\nNewton's differential method illustrated\n)\nto the\nRoyal Society of London\nfrom Venice at that time. The paper was received by the\nRoyal Society\nand reported to their meeting on\n18\nJune\n1719\n.\nNicolaus\n(\nI\n)\nBernoulli\noccupied the chair at the University of Padua from\n1716\nuntil\n1722\n. Stirling must have met\nNicolaus\n(\nI\n)\nBernoulli\nand got to know him quite well since, in\n1719\n, he wrote to\nNewton\n, again from Venice, offering to act as a go-between. In\n1721\nStirling was in Padua and we know that he attended the University of Padua at that time.\nIn\n1722\nStirling returned to Glasgow, perhaps around the time that his friend\nNicolaus\n(\nI\n)\nBernoulli\nleft Padua. There is a story told by\nTweedie\nin\n[\n5\n]\nthat Stirling learned the secrets of the glass industry while in Italy and had to flee for fear of his life since the glass-makers may have tried to assassinate him to prevent their secrets becoming known. It is not clear what he did between that time and late\n1724\nbut it is clear that, at least from\n1722\n, he had the intention of becoming a teacher in London.\nIn August\n1722\nMaclaurin\nvisited\nNewton\nin London and\nNewton\nshowed him a letter from Stirling in which Stirling wrote that he intended to set himself up as a mathematics teacher in London. Certainly Stirling was friendly with\nNewton\nand the letter was almost certainly asking for\nNewton\n's help in this venture, help which\nNewton\nwas giving in telling\nMaclaurin\nof Stirling's plans.\nIn late\n1724\nStirling travelled to London where he was to remain for\n10\nyears. These were ten years in which Stirling was very active mathematically, corresponding with many mathematicians and enjoying his friendship with\nNewton\n.\nNewton\nproposed Stirling for a fellowship of the\nRoyal Society of London\nand, on\n3\nNovember\n1726\n, Stirling was elected.\nStirling achieved his aim of becoming a teacher in London when he was appointed to William Watt's Academy in Little Tower Street, Covent Garden, London which was\n[\n1\n]\n:-\n... one of the most successful schools in London; and, although he had to borrow money to pay for the mathematical instruments he needed.\nThe school's prospectus of\n1727\nlists a course on mechanical and experimental philosophy given by Stirling and others. The syllabus included mechanics, hydrostatics, optics, and astronomy.\nWhile in London, Stirling published his most important work\nMethodus Differentialis\nⓉ\n(\nThe differential method\n)\nin\n1730\n. This book is a treatise on infinite series, summation, interpolation and\nquadrature\n. The asymptotic formula for\nn\n!\nn!\nn\n!\nnow known as\nStirling's formula\nfor which Stirling is best known, appears as Example\n2\nto Proposition\n28\nof the\nMethodus Differentialis\nⓉ\n(\nThe differential method\n)\n. See\nTHIS LINK\n.\nOne of the main aims of the book was to consider methods of speeding up the convergence of series. Stirling notes in the Preface that\nNewton\nhad considered this problem. As an example of the problem he is trying to solve Stirling gives the example of the series\n∑\n1\n2\nn\n(\n2\nn\n−\n1\n)\n\\sum  \\large\\frac{1}{2n(2n-1)}\\normalsize\n∑\n2\nn\n(\n2\nn\n−\n1\n)\n1\n​\nwhich had been studied by\nBrouncker\nin his work on the area under a\nhyperbola\n. Stirling writes, in\nMethodus Differentialis\nⓉ\n(\nThe differential method\n)\n, that:-\n...if anyone would find an accurate value of this series to nine places ... they would require one thousand million of terms; and this series converges much swifter than many others...\nMany examples of his methods are given, including\nLeibniz\n's problem of\nπ\n4\n=\n1\n−\n1\n3\n+\n1\n5\n−\n1\n7\n+\n1\n9\n−\n.\n.\n.\n\\large\\frac{\\pi}{4}\\normalsize  = 1 - \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  - \\large\\frac{1}{7}\\normalsize  + \\large\\frac{1}{9}\\normalsize  - ...\n4\nπ\n​\n=\n1\n−\n3\n1\n​\n+\n5\n1\n​\n−\n7\n1\n​\n+\n9\n1\n​\n−\n.\n.\n.\nand he also gives a theorem to treat convergence of an infinite product. Included in this work on accelerating convergence is a discussion of\nDe Moivre\n's methods.\nWe mentioned above that he studied interpolation in the\nMethodus Differentialis\nⓉ\n(\nThe differential method\n)\n. For example he defined the series\nT\nn\n+\n1\n=\nn\nT\nn\nT_{n+1} = nT_{n}\nT\nn\n+\n1\n​\n=\nn\nT\nn\n​\nwith\nT\n1\n=\n1\nT_{1} = 1\nT\n1\n​\n=\n1\n. He then considered\nT\n3\n/\n2\nT_{3/2}\nT\n3\n/\n2\n​\n, between the terms\nT\n1\nT_{1}\nT\n1\n​\nand\nT\n2\nT_{2}\nT\n2\n​\n. In today's notation this would be\nΓ\n(\n3\n2\n)\n\\Gamma (\\large\\frac{3}{2}\\normalsize )\nΓ\n(\n2\n3\n​\n)\nand Stirling here is studying the\nGamma function\n. He calculated\nT\n3\n/\n2\nT_{3/2}\nT\n3\n/\n2\n​\nto ten decimal places. In fact\nT\n3\n/\n2\n=\nΓ\n(\n3\n2\n)\n=\n1\n2\nΓ\n(\n1\n2\n)\n=\n1\n2\n√\nπ\nT_{3/2} = \\Gamma (\\large\\frac{3}{2}\\normalsize ) = \\large\\frac{1}{2}\\normalsize \\Gamma (\\large\\frac{1}{2}\\normalsize ) = \\large\\frac{1}{2}\\normalsize √\\pi\nT\n3\n/\n2\n​\n=\nΓ\n(\n2\n3\n​\n)\n=\n2\n1\n​\nΓ\n(\n2\n1\n​\n)\n=\n2\n1\n​\n√\nπ\n.\nThe book contains other results on the Gamma function and the\nHypergeometric function\n.\nDe Moivre\npublished\nMiscellanea Analytica\nⓉ\n(\nMiscellaneous analysis\n)\nin\n1730\n. Stirling wrote to\nDe Moivre\npointing out some errors that he had made in a table of logarithms of\nfactorials\nin the book and also telling\nDe Moivre\nabout Example\n2\nto Proposition\n28\nof\nMethodus Differentialis\nⓉ\n(\nMiscellaneous analysis\n)\n.\nDe Moivre\nwas able to extend his earlier results using Stirling's ideas and published a Supplement to\nMiscellanea Analytica\na few months later. Clearly Stirling and\nDe Moivre\nregularly corresponded around this time for in September\n1730\nStirling relates the episode and new results of\nDe Moivre\nin a letter to\nGabriel Cramer\n.\nThere is another area of Stirling's work that we shall examine, namely his work on gravitation and the figure of the Earth. However, before doing so we will look at a correspondence that Stirling had with\nEuler\nsince this relates to the work we have just discussed on series.\nEuler\nwrote to Stirling on\n8\nJune\n1736\nfrom St Petersburg. We quote from his letter where he gives his opinion on Stirling's work\n(\nsee\n[\n7\n]\nor\n[\n3\n]\n)\n:-\n... the more I have learned from your excellent articles, which I have seen here and there in your Transactions, concerning the nature of series, a study in which I have indeed expended much effort, the more I have wished to become acquainted with you in order that I could receive more from you yourself and also submit my own deliberations to your judgement. But before I wrote to you, I searched all over with great eagerness for your excellent book on the method of differences, a review of which I had seen a short time before in the Acta Lipsiensis, until I achieved my desire. Now that I have read through it diligently, I am truly astonished at the great abundance of excellent methods contained in such a small volume, by means of which you show how to sum slowly converging series with ease and how to interpolate progressions which are very difficult to deal with. But especially pleasing to me was proposition XIV of part\n1\nin which you give a method by which series, whose law of progression is not even established, may be summed with great ease using only the relation of the last terms, certainly this method extends very widely and is of the greatest use. In fact the proof of this proposition, which you seem to have deliberately withheld, caused me enormous difficulty, until at last I succeeded with very great pleasure in deriving it from the preceding results, which is the reason why I have not yet been able to examine in detail all the subsequent propositions\nIn\n1735\nStirling returned to Scotland where he was appointed manager of the 'Scotch mining company, Leadhills' in Lanarkshire at a salary of £\n120\nper year. This was a job that Stirling did very well, he\n[\n8\n]\n:-\n... proved extremely successful as a practical administrator, the condition of the mining company improving vastly owing to his method of employing labour to work the mines.\nHowever the work was very demanding. It was two years before he got round to replying to\nEuler\n's letter from which we quoted above. In the reply, dated\n16\nApril\n1738\n, and written from Edinburgh he explains why he has not replied sooner\n(\nsee\n[\n7\n]\nor\n[\n3\n]\n)\n:-\nDuring these last two years I have been involved in a great many business matters which have required me to go frequently to Scotland, and then return to London. And it was on account of these affairs that first of all your letter came late into my hands and then that, even to this very day, there is scarcely time available for reading through your letter with the attention which it deserves. For after deliberations have been interrupted, not to say neglected, for a long time, patience is required before the mind can be brought to think about the same things once again.\nIn the same letter Stirling offered to put\nEuler\n's name forward for election to the\nRoyal Society of London\n. He did not do that, however, probably again through pressure of work with the mining company and it was not until\n1746\nthat he was proposed by several mathematicians not including Stirling.\nIt appears that Stirling never replied to this second letter from\nEuler\n. He wrote to\nMaclaurin\non\n26\nOctober\n1738\nsaying that\nEuler\n's second letter was:-\n... full of many ingenious things, but it is long and I am not quite master of all the particulars.\nIn\n1745\nStirling published a paper on the ventilation of mine shafts. He certainly did not give up mathematics when he took up the post in the mining company, and in\n[\n3\n]\nthere is a discussion of unpublished mathematical work in notebooks of Stirling that were probably written between\n1730\nand\n1745\n.\nThe year\n1745\nwas the date of the most major of the Jacobite rebellions and\nMaclaurin\nplayed an active role in the defence of Edinburgh against the Jacobites. Charles Edward, the Young Pretender, entered Edinburgh with an army of\n2\n,\n400\nmen on\n17\nSeptember\n1745\n. In\n1746\nMaclaurin\ndied, partly as a consequence of the battles of the previous year, and Stirling was considered for his chair at Edinburgh. However Stirling's strong support for the Jacobite cause meant that such an appointment was impossible, especially in the year after the rebellion.\nStirling was elected to membership of the\nRoyal Academy of Berlin\nin\n1746\n. In\n1753\nhe resigned from the\nRoyal Society\nas he was in debt to the Society and could no longer afford the annual subscriptions. It cost him £\n20\nto resign.\nOne non-mathematical contribution by Stirling is described in\n[\n8\n]\n(\nsee also\n[\n5\n]\n)\n:-\n... he surveyed the Clyde with a view to rendering it navigable by a series of locks, thus taking the first step towards making Glasgow the commercial capital of Scotland. The citizens were not ungrateful, and in\n1752\npresented him with a silver tea-kettle 'for his service, pains, and trouble'.\nFinally we must discuss Stirling's second major mathematical contribution, namely his work on the figure of the Earth. On\n6\nDecember\n1733\nStirling read a paper to the\nRoyal Society\nentitled\nTwelve propositions concerning the figure of the Earth\n. The minutes of the Society state:-\nMr Stirling was ordered thanks, and was desired to communicate his Propositions.\nIndeed Stirling did submit an extended version of his results which appeared as\nOf the figure of the Earth, and the variation of gravity on the surface\nin\n1735\n. In\n[\n1\n]\nthe paper is described:-\nIn it he stated, without proof, that the Earth is an oblate spheroid, supporting\nNewton\nagainst the rival\nCassinian\nview.\nCertainly Stirling was considered the leading British expert on the subject for the next few years by all including\nMaclaurin\nand\nSimpson\nwho went on to make major contributions themselves. As Stirling's unpublished manuscripts show\n[\n3\n]\n, he did go much further than the\n1735\npaper but probably the pressure of work at the mining company gave him too little time to polish the work. He explains in a letter to\nMaclaurin\n, dated\n26\nOctober\n1738\n, why he has not published despite pressure to do so:-\nI got a letter this last summer from Mr\nMachin\nwholly relating to the figure of the Earth and the new mensuration, he seems to think this a proper time for me to publish my proposition on that subject when everybody is making a noise about it; but I choose rather to stay till the French arrive from the south, which I hear will be very soon. And hitherto I have not been able to reconcile the measurements made in the north to the theory....\nIn fact the French expedition to Ecuador, referred to by Stirling as 'the south', left in\n1735\nbut did not return until\n1744\n.",
  "matematicos_citados_na_biografia": [
    "Royal Society of London",
    "Brook Taylor",
    "Newton",
    "catenary",
    "Leibniz",
    "Johann Bernoulli",
    "Nicolaus(I)Bernoulli",
    "Nicolaus(II)Bernoulli",
    "Euler",
    "Royal Society",
    "Tweedie",
    "Maclaurin",
    "quadrature",
    "Stirling's formula",
    "THIS LINK",
    "Brouncker",
    "hyperbola",
    "De Moivre",
    "Gamma function",
    "Hypergeometric function",
    "factorials",
    "Gabriel Cramer",
    "Royal Academy of Berlin",
    "Cassinian",
    "Simpson",
    "Machin"
  ],
  "imagens": []
}