{
  "nome_completo": "János Apáczai Csere",
  "nome_curto": "János Apáczai",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Apaczai/",
  "data_nascimento": "10 June 1625",
  "local_nascimento": "Apáca, Transylvania, Hungary (now Romania)",
  "data_morte": "31 December 1659",
  "local_morte": "Kolozsvár, Hungary (now Cluj, Romania)",
  "summary": "János Apáczai was born in Transylvania and wrote the Hungarian Encyclopaedia .",
  "biografia": "János Apáczai Csere\nwas born in Apácza, near Brassó, in Transylvania. Little is known about his parents who died when he was young, so he was brought up as an orphan. He was born at a time when Transylvania was experiencing a golden age for economic and cultural development. It was ruled by Prince Gábor Bethlen, who was imposed by the Ottomans, who at this time occupied Transylvania. Hungary, at this time, was caught between the Habsburg Empire and the Ottoman Empire but despite this maintained a considerable amount of political and religious freedom. This background information is necessary to understand Apáczai's aims.\nWhen Apáczai was four years old Prince Gábor Bethlen died and he was succeeded by Prince György Rákóczi I who continued to maintain the international position of Transylvania. However, the country not only had the political tensions imposed by the Habsburg and Ottoman Empires, but it also suffered religious tensions between Calvinists and Catholics. Apáczai studied in Kolozsvár\n(\ntoday Cluj\n)\nand in Gyulafehérvár\n(\nAlba-Iulia\n)\nbut, having no family, it proved difficult for him to support himself financially during his education, and twice he was forced to interrupt his studies because he did not have the financial means to continue.\nThe College in Gyulafehérvár was the leading College in Transylvania. It was Prince Gábor Bethlen who had brought it up to international standing so that the citizens of Transylvania could obtain a high quality university level education without going abroad. Alsted and Bisterfeld were two German professors who had been appointed to Gyulafehérvár as part of the upgrading in\n1629\nand they were to have a big influence on Apáczai while he was a student there.\nIn\n1648\nGyörgy Rákóczi I died and he was succeeded by his son Prince György Rákóczi II. In this same year of\n1648\nBisterfeld persuaded Bishop István Katona to award Apáczai a scholarship to allow him to study abroad, and he went to study in Franeker, Leiden and Utrecht. Apáczai was awarded the degree of Doctor of Theology from the University of Harderwijk in April\n1651\n. While in Utrecht, Apáczai studied the works of\nDescartes\n. He did not spend all his time on work, however, for while there he met Aletta van der Maet and they were married. It was in Utrecht that he wrote the\nHungarian Encyclopaedia\nwhich was his greatest achievement. He made it clear in the Latin Preface what his purpose was\n(\nsee for example\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nMy aim was to make up for the alarming lack of books in my native language to the best of my power and provide the students with a single volume from which they could unravel all the threads of science in their mother tongue.\nApáczai's\nHungarian Encyclopaedia\ncontains one section on arithmetic\n(\nPart Four of the Encyclopaedia\n)\nand one section on geometry\n(\nPart Five of the Encyclopaedia\n)\n. There is no attempt at originality, this was not Apáczai's aim, rather he wanted to present advanced mathematics in the Hungarian language. He stated in the Preface the sources he used for most of his material, and in the case of the mathematical sections they are based on works by\nRamus\nand\nSnell\n. There is no attempt to present the material in a manner helpful to beginners, rather the material is a collection of mathematical theorems intended to be used by lecturers. Many of the Hungarian terms that Apáczai introduced for mathematical terms are still in use today.\nIn\n1653\nPrince György Rákóczi II requested that Apáczai return to Hungary and appointed him to teach at the College in Gyulafehérvár where he had studied. In his inaugural lecture\nAbout the Learning of Wisdom\nApáczai first defined wisdom as:-\n... the systematic summing up of all the things that are necessary to be known.\nHe then made it clear that he looked to change education:-\n... if the time during which we now make efforts to ram\n[\nstudents'\n]\nheads almost to surfeit with grammar and in some cases with rhetoric or logic, were used for lectures on the interesting subjects of mathematics and physics, we would give them a source of unspeakable joy for all their lives ...\nIn this same address he also made clear that he supported Puritanism and that he would base his teaching on the ideas of\nDescartes\n. These views put him at odds with many influential people, but while Bisterfeld was at the College in Gyulafehérvár, Apáczai's position there was safe. However, Bisterfeld died in\n1655\nand following this Basirius became head of the College. Basirius informed Prince György Rákóczi II that Apáczai's teaching was having an evil influence and must be stopped. After an open debate had been held, Apáczai was forbidden to teach.\nPrince György Rákóczi II sent Apáczai to become head of the College at Kolozsvár\n(\nCluj\n)\nin\n1656\n. This was not quite the change of heart that it appears since the College at Kolozsvár was essentially a ruin. Despite this many of the students from Gyulafehérvár, who had protested when he was banned from teaching, moved to Kolozsvár to complete their education with Apáczai.\nThe\nHungarian Encyclopaedia\nfailed to have a major impact on mathematical education in Hungary. We mentioned above that Apáczai wrote the text for teachers, but there were not the quality of teachers around to take the text and turn it into good lecture material. The level of material was too high for students to cope with for he had presented his subject at the level of the top European universities, and students at this time in Hungary were not at this level. Szénássy\n(\nsee\n[\n2\n]\nor\n[\n3\n]\n)\nalso notes that Apáczai's approach was classical and did not include the advances in algebraic notation which\nViète\nhad introduced.",
  "matematicos_citados_na_biografia": [
    "Descartes",
    "Ramus",
    "Snell",
    "Viète"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}