{
  "nome_completo": "Jean-Louis Loday",
  "nome_curto": "Jean-Louis Loday",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loday/",
  "data_nascimento": "12 January 1946",
  "local_nascimento": "Le Pouliguen, Pays de la Loire, France",
  "data_morte": "6 June 2012",
  "local_morte": "Les Sables-d'Olonne, France",
  "summary": "Jean-Louis Loday wasa French mathematician whoo worked in the field of cyclic homology.",
  "biografia": "Jean-Louis Loday\nwas born in Le Pouliguen, a town on the west coast of France, west of Nantes, on a peninsular into the Bay of Biscay. His father, Louis Loday, was mayor of Le Pouliguen at the time Jean-Louis was born, holding this position from\n1945\nto\n1969\n. After beginning his education in his home town, he then studied at the Lycée Clemenceau in Nantes. This school, founded at the beginning of the nineteenth century, was an excellent one with a high standard. It had received the name Clemenceau after World War I, named for Georges Clemenceau who was at that time premier of France playing a major role in framing the Treaty of Versailles. He graduated from the Lycée Clemenceau, and was ranked first in the concours général de mathématiques in\n1963\n. Then he attended preparatory class at the Lycée Louis-le-Grand in Paris preparing to take the entrance examination for the École Normale Supérieure. Having been successful in these examinations, he entered this prestigious university on rue d'Ulm in\n1965\n.\nLoday was awarded his\nagrégation de mathématiques\nin\n1969\nand he went to the University Louis Pasteur in Strasbourg where he undertook research for his doctorate. His research advisor was Max Karoubi whose area of interest was K-theory. Karoubi was one of Henri Cartan's students, having been awarded his doctorate in\n1967\nfor his thesis\nAlgèbres de Clifford et K-théorie\nⓉ\n(\nClifford algebras and K-theory\n)\n, and he went on to become the founder of the First European Mathematical Congress. Loday, who was Karoubi's first doctoral student, was awarded his Ph.D. in\n1975\nfor his thesis\nK-théorie algébrique et représentations de groupes\nⓉ\n(\nAlgebraic K-theory and group representations\n)\n. This thesis was in two parts, both of which studied product constructions in K-theory. A paper based on his thesis was published in\n1976\nbut he had already published a number of papers, some of which announced results which were described in detail in his thesis. These earlier papers were:\nApplications algébriques du tore dans la sphère\nⓉ\n(\nAlgebraic embeddings  of the torus in the sphere\n)\n(1971)\n;\nStructures multiplicatives en K-théorie\nⓉ\n(\nMultiplicative structures in K-theory\n)\n(1972)\n;\nApplications algébriques du tore dans la sphère et de\nS\np\n×\nS\nq\nd\na\nn\ns\nS\np\n+\nq\nS^{p} \\times  S^{q} dans S^{p+q}\nS\np\n×\nS\nq\nd\na\nn\ns\nS\np\n+\nq\nⓉ\n(\nEmbeddings of the algebraic torus in the sphere and of S\np\nx  S\nq\nin S\np+q\n)\n(1973)\n;\nStructure multiplicative en K-théorie algébrique\nⓉ\n(\nMultiplicative structure in algebraic K-theory\n)\n(1974)\n; and\nHigher Whitehead groups and stable homotopy\n(1976)\n. The\n1973\npublication was in the proceedings of the Conference \"Classical algebraic K-theory and connections with arithmetic\" which Loday attended in Seattle in the United States.\nIt was at the University Louis Pasteur in Strasbourg that Loday spent his whole career. He worked there at the Institut de Recherche Mathématique Avancée which is a laboratory of the Centre National de la Recherche Scientifique and of the Université Louis Pasteur of Strasbourg. He attended the conference 'Algebraic K-theory' held at Northwestern University, Evanston, Illinois, United States in\n1980\nand published two papers in the conference proceedings. In\n1982\nhe published\nSpaces with  finitely many nontrivial homotopy groups\n. Ronnie Brown writes in\n[\n1\n]\nthat this:-\n...imaginative paper introduced the notion of the fundamental\nn\nn\nn\n-cat-group of an\nn\nn\nn\n-cube of spaces, and proved that these\nn\nn\nn\n-cat-groups modelled the weak pointed homotopy type of connected spaces whose homotopy groups vanish above dimension\nn\n+\n1\nn+1\nn\n+\n1\n.\nThis was related to work that Ronnie Brown was involved in and he relates in\n[\n1\n]\nhow he cooperated with Loday during the early\n1980\ns. He writes that:-\n... it was fortunate to have had the privilege and pleasure of working with him, to  find the way our ideas  fitted, and that our different backgrounds and expertise led to the development of these new ideas.\nIn particular, they published the joint paper\nExcision homotopique en basse dimension\nⓉ\n(\nLow dimensional homotopical excision\n)\nin\n1984\nwhich introduced the non-abelian tensor product of groups. This paper was particularly interesting to me\n[\nEFR\n]\nfor, together with David Johnson and Ronnie Brown, I published\nSome computations of non-abelian tensor products of groups\nin\n1987\n. This is my most cited paper so I have a very personal reason for saying 'thank you' to Jean-Louis Loday.\nAnother topic that Loday worked on during the\n1980\ns was cyclic homology, some of the work being undertaken jointly with\nDaniel Quillen\n. Loday published the\n450\n-page text\nCyclic homology\nin\n1992\n. Jerry Lodder writes in a review:-\nThis book is written to introduce students and nonspecialists to the field of cyclic homology. As a prerequisite it requires only a rudimentary knowledge of\nalgebraic topology\nand homological algebra. In the first half of the book the author meticulously outlines several approaches to cyclic homology, namely algebraic, geometric, and categorical. The second half contains more sophisticated results which use cyclic homology to express certain relative algebraic K-theory groups. ... The proofs of these results are highly readable and provide more details than the original research articles. ... A nice feature of the text is how the author interleaves introductory chapters with those containing recent results in cyclic homology. For example, there are fundamental chapters covering Hochschild homology, algebraic K-theory, and invariant theory, all of which are classical and essential for an understanding of the results of cyclic homology. The other chapters bring together various constructions in the literature organized around common themes.\nA second edition, with an additional chapter on '\nMac Lane\n(\nco\n)\nhomology', was published in\n1998\n. In the\n1990\ns, Loday also worked on operads, a topic that he continued to study for the rest of his life. He explains the idea behind operads in\n[\n6\n]\n:-\nAn operad is an algebraic device which encodes a type of algebras. Instead of studying the properties of a particular algebra, we focus on the universal operations that can be performed on the elements of any algebra of a given type. The information contained in an operad consists in these operations and all the ways of composing them. The classical types of algebras, that is associative algebras, commutative algebras and\nLie\nalgebras, give the first examples of algebraic operads. Recently, there has been much interest in other types of algebras, to name a few:\nPoisson\nalgebras, Gerstenhaber algebras,\nJordan\nalgebras, pre-\nLie algebras\n, Batalin-Vilkovisky algebras,\nLeibniz\nalgebras, dendriform algebras and the various types of algebras up to homotopy. The notion of operad permits us to study them conceptually and to compare them.\nHe was Director of Research for the Centre National de la Recherche Scientifique, being promoted to Directeur de recherche de classe exceptionnelle in\n1995\n. His final paper, published after his death, was the paper\nPermutads\nwritten jointly with María Ronco. Here is the abstract of that paper:-\nWe unravel the algebraic structure which controls the various ways of computing the word\n((\nx y\n)(\nz t\n))\nand its siblings. We show that it gives rise to a new type of operads, that we call permutads. A permutad is an algebra over the monad made of surjective maps between finite sets. It turns out that this notion is equivalent to the notion of \"shuffle algebra\" introduced previously by the second author. It is also very close to the notion of \"shuffle operad\" introduced by V Dotsenko and A Khoroshkin. It can be seen as a noncommutative version of the notion of nonsymmetric operads. We show that the role of the associahedron in the theory of operads is played by the permutohedron in the theory of permutads.\nWe should mention that Loday also published under the pseudonym Guillaume William Zinbiel\n(\nZinbiel is\nLeibniz\nwritten backwards\n)\n. For example he published\nEncyclopedia of types of algebras\n2010\nunder the name G W Zinbiel in the book\nOperads and universal algebra\n. Loday was a joint editor of these proceedings\n(\nunder the name Jean-Louis Loday\n)\nof the International Conference held at the Chern Institute of Mathematics at Nankai University, China, in July\n2010\n. Loday's website\n[\n5\n]\ncontains a biography of the fictitious G W Zinbiel. As well as telling us that he was born on\n29\nFebruary\n1900\nin Zoebersdorf, Alsace, we learn that his favourite music was Mozart and he played the triangle in the regional orchestra. The piece is a lovely illustration of Loday's humour.\nLoday died in a tragic boating accident, falling from his boat off Les Sables-d'Olonne. He had received honours such as the Prix Francoeur from the\nAcademy of Sciences\nin\n1987\n. After his death the Third Conference on Topologie, Géométrie et de Physique Mathématique was held at Rabat in June\n2013\ndedicated to his memory.\nLet us end by quoting from\n[\n4\n]\n:-\nHe has supervised\n15\ntheses and brought many postdoctoral students to Strasbourg. He has organized many conferences and workshops. He knew that mathematical research should never be done alone in a corner. He has never behaved like an isolated researcher and was always generous with his time and ideas. He always gave great attention to students and colleagues. He was also unable to refuse an invitation to give a presentation or course, even on the other side of the planet\n(\nfor example, in Montreal, Chile, Kazakhstan in recent years\n)\n. All those who have met him have had the privilege of meeting a beautiful person. This is one of those rare encounters that illuminate a life. All those who knew him will remember above all, his humour, his humanity and his love for art and mathematics.\nSimilar sentiments are expressed in\n[\n3\n]\n:-\nHe will be remembered for his good humour, his fine sense for human relationships and for his infectious enthusiasm for mathematics.",
  "matematicos_citados_na_biografia": [
    "agrégation de mathématiques",
    "Daniel Quillen",
    "algebraic topology",
    "Mac Lane",
    "Lie",
    "Poisson",
    "Jordan",
    "Lie algebras",
    "Leibniz",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}