{
  "nome_completo": "Jean-Nicolas Nicollet",
  "nome_curto": "Jean-Nicolas Nicollet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nicollet/",
  "data_nascimento": "29 July 1786",
  "local_nascimento": "Cluses, Savoy, France",
  "data_morte": "11 September 1843",
  "local_morte": "Washington, D.C., USA",
  "summary": "Joseph Nicolas Nicollet was a French cartographer, astronomer and mathematician known for his expeditions to map the USA.",
  "biografia": "Jean-Nicolas Nicollet\nis also known as Joseph Nicolas Nicollet. He was educated at the college in Cluses where his favourite subject was mathematics. In\n1805\n, at the age of nineteen, Nicollet became an assistant teacher of mathematics in Chambery. Wishing to further his education, he went to Paris and attended the École Normale Supérieur. He taught in Paris for a brief period before, in\n1817\n, becoming secretary and librarian at the Paris Observatory. At the Observatory he continued his education, studying under\nLaplace\n. He continued teaching mathematics and, in\n1818\n, he gives his posts as Astronomer attached to the Royal Observatory in Paris and Professor of Mathematics at the College of Louis-Le-Grand.\nNicollet rapidly made a fine reputation for himself both as a teacher and as a mathematical astronomer at the Observatory, receiving the Legion of Honour for his excellent work. His publications were all in the field of cartography and mathematical astronomy. Using his mathematical skills, he applied the principles of mathematical probability to the stock market believing that he could make his fortune. His\nprobability\nconsiderations did not allow for the French Revolution of\n1830\nwhich caused the stock market to crash. Nicollet was ruined financially and, perhaps equally as bad in his eyes, he felt his mathematical skills would no longer be respected. He decided to go to the United States. His aim was to make a name for himself, using his considerable scientific skills in cartography and geodesy, and then return to France with his reputation restored. He certainly achieved the first of these aims, but he never returned to France. Although the stock market crash was the main reason for Nicollet setting out for the United States, there were other more minor reasons. Nicollet had lost his patron when\nLaplace\ndied in\n1827\nand he had quarrelled with\nFrançois Arago\nwho was becoming an increasingly important figure at the Observatory.\nIn\n1832\nNicollet sailed to North America and went first to Washington where he met those members of the government who were interested in carrying out scientific surveys. Immediately Nicollet began scientific work with the French born and educated Augustine Verot, Professor of Mathematics and Natural Philosophy in St Mary's College, Baltimore, the first Roman Catholic seminary to be established in the United States. In the Botanical Garden of the College, they observed a transit of Mercury on\n4\nMay\n1832\n, a solar eclipse on\n26\nJuly\n1832\nand made further observations, the last recorded being on\n28\nNovember\n1832\n. Ferdinand Rudolph Hassler was conducting the United States Coast Survey and he agreed to support Nicollet's explorations. Nicollet did not spend longer than necessary in Washington for he wanted to plan his scientific work and to do this he needed to travel. For three years he travelled through the southern states and although his route looks somewhat random, there was purpose in where he went. He had realised the importance of the Mississippi River which at that time had not been correctly mapped. Savoie Lottinville gives a summary of Nicollet's first explorations in\n[\n13\n]\n:-\nIn December,\n1832\n, he began his travels to\n[\nsearch out the headwaters of the Mississippi and to map that region\n]\nthough not before having seen Lieutenant James Allen's engineering report from Henry R Schoolcraft's expedition of the previous summer to Lake Itasca, which would be one of Nicollet's objectives.\nHe spent some time in New Orleans, but on\n30\nNovember\n1834\nhe was in Milledgeville, Georgia, where he observed a total eclipse of the sun at the State House, Senate Hall. A telescope had been procured for him by Milton Anthony, a founder of the Medical College of Georgia, and he was \"zealously assisted by Doctors Dugas and Ford, of the Medical College.\" He made calculations wherever he went and encouraged those he met to take regular barometric readings and make astronomical observations. Some certainly did so and reported their results to Nicollet who published them along with his own observations. By\n1835\nhe was in St Louis making it a base for planning his scientific expeditions\n[\n13\n]\n:-\nNicollet felt that the geographical location of the mouth of the Mississippi must be determined first. Having gone south and satisfied himself on this point, he headed north from St Louis by way of the Missouri, only to be turned back in August,\n1835\n, by a bout of malaria. He returned to the quest in June,\n1836\n, reaching Fort Snelling on July\n2\n. With the aid of Lawrence Taliaferro, the Indian agent at the fort, he was outfitted and began his ascent of the Mississippi, only to lose his canoe and provisions at the Falls of St Anthony. At the end of July he started again, and on Monday, August\n29\n,\n1836\n, he explored the southern tip of the Hauteurs des Terres and found the small trickle that formed present-day Whipple Lake and the beginnings of the Father of Waters.\nThere are two important aspects of Nicollet's travels. Firstly there was the great scientific value that someone as skilful and highly trained as Nicollet could produce. Secondly there is a wealth of information collected in his journals which gives great insight into the customs and culture of the tribes that he met on his travels. Relating to this first\n1836\nexpedition, Raphael Hamilton writes in\n[\n12\n]\n:-\nIn\n1836\n, the members of this tribe still preserved the tradition that their happiest contact with white men had been in the days of the French regime. Nicollet quotes from a speech by their chief, Flat Mouth, who begged him to interest the king of France in their regard because \"The French were the first to discover us.\" Such devotion to the French may explain why these Indians proved so ready to tell Nicollet the facts and significance of many customs indigenous to their native culture. Such ethnic lore obtained at such an early date is hard to find elsewhere.\nNicollet was at Fort Snelling, Minnesota by October\n1836\nand he remained there until the summer of\n1837\n. He returned to St Louis, but made preparations for another expedition in the spring of\n1838\n. He had accepted a position with the United States Army Corps of Engineers and on\n18\nJune\n1838\nset off on another expedition from Traverse des Sioux. In\n[\n11\n]\nthe start of this expedition is described:-\nOn June\n18\n,\n1838\n, a \"hot and muggy\" day, a picturesque caravan left Traverse des Sioux, westward bound. It was the Nicollet expedition, which was sent to the Northwest by the United States government to explore and map the vast region between the upper Mississippi and the Missouri. The leader of the party was the French explorer, Joseph N Nicollet, and his assistant was John C Frémont, then an unknown young lieutenant. Among the Nicollet Papers in the Library of Congress is an account in the explorer's own handwriting of the departure from Traverse des Sioux .... He and Frémont, he records, rode \"in the wagon of Joseph Rainville and his wife,\" bringing \"up the rear of the train to superintend the march.\" In front they could see \"\n8\nvoyageurs, each at the head of his heavily loaded cart,\" led by La Framboise \"with his wife and Eugene in the Barouche.\"\nOn\n30\nJune\n1838\nhe made astronomical observations, assisted by Lieutenant, Charles Tremont, of the Corps Topographical Engineers, at Red Pipestone Quarry, on the Coteau des Prairies, Sioux Indian Country, Iowa Territory. He observed a partial eclipse of the sun on the east shore of Ti tanka tanninan Lake, on Lahontan River, Sioux Country, Iowa Territory, on\n18\nSeptember\n1838\n. In\n1839\nhe led another expedition to explore the region between the Mississippi River and the Missouri river. Again John Frémont was his assistant but of course today Frémont is better known than Nicollet; Frémont went on to lead major expeditions, and was the first candidate for the Republican Party for President of the United States. Nicollet made an astronomical observation at his encampment, on the Coteau du Missouri, Yanktonan Indian country on\n6\nJuly\n1839\n. Helen Tanner writes in\n[\n15\n]\n:-\nExploration in\n1839\nwas delayed by a slow voyage up the Missouri river to Fort Pierre. From this point, Nicollet and his companions set out for Devil's Lake, a region of confrontation between the Sioux and combined Chippewas and Metis allied to the Hudson's Bay Company post in the lower Red River valley. On their return route, they crossed the prominent landform of eastern South Dakota, the Coteau des Prairies, before reaching the upper Minnesota River post of the American Fur Company, the firm that furnished supplies and guides for the expedition.\nBy\n20\nNovember\n1839\nhe was back in St Louis, Missouri, making astronomical observations in the garden of the Cathedral. He now worked on a map of the Hydrographic Basin of the Upper Mississippi River and a Report on his travels. He sent his first map, drawn to scale\n1\n:\n600\n,\n000\n, to the Senate in\n1842\nbut, unhappy with the printing proposals, he had a smaller version made drawn to scale\n1\n:\n1\n,\n200\n,\n000\n. Raymond DeMaillie\n[\n7\n]\nwrites:-\nNever robust, the rigour of his expeditions undermined his health; he died before fully completing his planned report. Nonetheless, his contributions rank him as the first modern cartographer in the United States.\nIn fact the Report, published in\n1843\n, contains the following note\n(\ndated\n13\nSeptember\n1843\n, two days after his death\n)\nat the end of the Introduction:-\nThus far Mr Nicollet had written of his introduction, when death put an end to his labours, and before he had been able to revise his report, which had been returned to him for that purpose, and also to add the astronomical observations upon which his calculations were founded. These observations form parts of his journals, which are to be deposited in the Bureau of the Corps of Topographical Engineers.\nJohn Allen\n[\n5\n]\ngives this assessment of Nicollet:-\nHe was widely recognized as a leading authority on virtually all aspects of scientific geographic observation and data collection; he communicated with the leading scientists of the time in the United States; and the products of his travels, particularly his large map of the \"Hydrographical Basin of the Upper Mississippi River,\" were to serve as the models for American explorer-scientists through the age of John Wesley Powell.",
  "matematicos_citados_na_biografia": [
    "Laplace",
    "probability",
    "François Arago"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}