{
  "nome_completo": "Jean François Chazy",
  "nome_curto": "Jean Chazy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chazy/",
  "data_nascimento": "15 August 1882",
  "local_nascimento": "Villefranche-sur-Saône, France",
  "data_morte": "9 March 1955",
  "local_morte": "Paris, France",
  "summary": "Jean Chazy was a French mathematician and astronomer who worked on the three body problem.",
  "biografia": "Jean Chazy\n's father was an industrialist, working in the textile trade in Villefranche-sur-Saône, a town in east-central France with metallurgical, textile and chemical industries. Jean began his studies at the Collège of Mâcon and then went on to perform outstandingly at the Lycée in Dijon. At this stage in his career he made the decision not to follow the career of his father, but rather to aim for a career in teaching and research. After becoming a Concours Général laureate, he took the entrance examinations of both the École Polytechnique and the École Normale Supérieure, being offered a place by both famous grandes écoles. At this time the École Normale Supérieure had the best reputation for mathematics and, as this was Chazy's chosen topic, he began his studies at the École Normale. He graduated with his first degree in\n1905\n.\nFrance's defeat in the Franco-Prussian war of\n1870\n-\n71\nmeant that the French were determined to recover Alsace-Lorraine and so were continually preparing for conflict with Germany. Conscription was one way of achieving this, and after graduating, Chazy undertook military service for a year before continuing with his studies. The research he undertook for his doctorate involved the study of differential equations, in particular looking at the methods used by\nPaul Painlevé\nto solve differential equations that\nHenri Poincaré\nand\nÉmile Picard\nhad failed to solve. Although\nPainlevé\nhad made many advances, he had also posed many questions and it was these that Chazy attacked. Chazy published several short papers while undertaking research, for instance\nSur les équations différentielles dont l'intégrale générale est uniforme et admet des singularités essentielles mobiles\nⓉ\n(\nOn differential equations whose general integral is uniform and admits mobile essential singularities\n)\n(1909)\n,\nSur les équations différentielles dont l'intégrale générale possède une coupure essentielle mobile\nⓉ\n(\nOn differential equations whose general integral has a mobile crucial break\n)\n(1910)\nand\nSur une équations différentielle du premier ordre et du premier degré\nⓉ\n(\nOn differential equations of the first order and first degree\n)\n(1911)\n. He was awarded his doctorate in\n1911\nfor his thesis\nSur les équations différentielles du troisième ordre et d'ordre supérieur dont l'intégrale générale a ses points critiques fixes\nⓉ\n(\nOn differential equations of the third order and higher order whose general integral has its fixed critical points\n)\nwhich he defended at the Sorbonne on\n22\nDecember\n1910\n. It was published as a\n68\n-page paper in\nActa Mathematica\nin\n1911\n. In his thesis he was able to extend results obtained by\nPainlevé\nfor differential equations of degree two to equations of degree three and higher. It was work of the highest quality.\nIn\n1911\n, Chazy was appointed as a lecturer in mechanics at the University of Grenoble. By good fortune the\nAcademy of Sciences\nposed a topic for the Grand Prix in Mathematical Sciences of\n1912\nwhich was exactly right given the research that Chazy had undertaken for his thesis. The topic posed was:\nImprove the theory of differential algebraic equations of the second order and third order whose general integral is uniform\n. The judges, one of whom was\nPaul Painlevé\n, received a number of outstanding submissions for the prize, including one from Chazy. In the end they decided to split the award three ways giving a one-third share to each of Chazy,\nPierre Boutroux\nand René Garnier. Chazy moved from Grenoble to Lille where he was appointed as a lecturer in the Faculty of Sciences\n(\nlater renamed the University of Lille\n)\n. However, the outbreak of World War I interrupted his career. By the end of July\n1914\nFrance had began mobilizing its troops and, on\n3\nAugust, Germany declared war on France. Chazy was mobilised and sent to the sound reconnaissance laboratory which was set up at the École Normale Supérieure. This laboratory was under the direction of Jacques Duclaux who was married to the radiologist Germaine Berthe Appell, making Duclaux the son-in-law of\nPaul Appell\nand the brother-in-law of\nÉmile Borel\n. The Germans had developed a new gun, known as \"Big Bertha\", a large howitzer built by the armaments manufacturer Krupp. At the start of the war, only two of these guns were operational but they were very effective in taking the Belgium forts at Liège, Namur and Antwerp as well as the French fort at Maubeuge. In April\n1918\nthe German armies made a number of attacks against allied positions which met with considerable success. They swept forward and the French government made strenuous efforts to defend Paris at all costs. On\n15\nJuly the French withstood the last German offensive. Chazy was able to compute the position of the Big Bertha guns firing at Paris from long-range with surprising accuracy. This played an important part in the ability of the French to defend the city. On\n8\nAugust the German armies began to move back; this was the beginning of the final chapter in the war. For his war work Chazy was awarded the Croix de Guerre.\nOnce he was released from military service in\n1919\n, Chazy returned to his position in Lille. In addition to his university position, he also took on another teaching position in the city, namely at the Institut industriel du Nord. Lille had been occupied by the Germans between\n13\nOctober\n1914\nand\n17\nOctober\n1918\n, during which time the university suffered looting and requisitions. Much damage had been caused, particularly in\n1916\nwhen explosions had destroyed the university's laboratories. After the war ended the reconstruction of educational facilities began. It was a difficult time for all those working there. Having done brilliant work on differential equations, Chazy's interests now turned towards the theory of relativity.\nAlbert Einstein\n's general theory of relativity was, at this time, very new only having been published near the end of\n1915\n. Chazy's first publication on the subject was\nSur les fonctions arbitraires figurant dans le\nd\ns\n2\nds^{2}\nd\ns\n2\nde la gravitation einsteinienne\nⓉ\n(\nOn the arbitrary functions contained in ds\n2\nof Einstein's gravitation equation\n)\nwhich appeared in\n1921\n. In the same year, Chazy published a paper on the three-body problem,\nSur les solutions isosceles du Problème des Trois Corps\nⓉ\n(\nOn the isosceles solutions of the three body problem\n)\n, an area he had begun to study in\n1919\nand for which he has become famous. Several important papers on the three-body problem followed, such as\nSur l'allure du mouvement dans le problème des trois corps quand le temps croît indéfiniment\nⓉ\n(\nOn the speed of the movement in the three-body problem when the time increases indefinitely\n)\n(1922)\nwhich led to Chazy being awarded the Prix Benjamin Valz. An important paper on relativity he published in\n1924\nis\nSur le champ de gravitation de deux masses fixes dans la théorie de la relativité\nⓉ\n(\nOn the gravitational field of two fixed masses in the theory of relativity\n)\n.\nIn\n1923\nChazy was appointed as a lecturer at the École Centrale des Arts et Manufactures in Paris and he was also appointed as an examiner at the École Polytechnique. He was named professor of analytical mechanics at the Sorbonne in\n1925\n. He continued to work at the Sorbone until his retirement in\n1953\n, but over the years he worked in Paris he held a number of different chairs such as analytical and celestial mechanics, and rational mechanics. Donald Saari explained some of Chazy's major contributions in\n[\n10\n]\n:-\n... in the\n1920\ns, the French mathematician Jean Chazy made an important advance. While he did not solve the three-body problem in the standard way of explaining what happens at each instant of time, with a clever use of the triangle inequality he was able to discover the asymptotic manner in which these particles separate from one another as time marches on to infinity. His description carefully catalogues all possible ways in which particles can separate from one another, or from a binary cluster. But a side issue arose: was his beautiful and orderly description marred by the inclusion of another, possibly spurious kind of motion? In this regime, the radius of the universe would expand, then contract, then expand even more, then ... All of this oscillating would create a setting whereby, as time goes to infinity, the limit superior of the radius of this universe approaches infinity while the limit inferior is bounded above by some positive constant. Weird, but if this oscillatory behaviour could occur, it would be fascinating. Chazy, however, had no clue as to whether it could exist. He was forced to include the motion only because he could not develop a mathematical reason to exclude it.\nChazy published a number of influential texts while working as a professor in Paris. He published the two-volume treatise\nThe Theory of Relativity and Celestial Mechanics\n(1928\n,\n1930)\n. He wrote in the Preface:-\nThe purpose of this book, which is the development of a course taught at the Faculty of Sciences of Paris in\n1927\n, is to expose as clearly as possible the theory of relativity in dealing with celestial mechanics, taking as a starting point the knowledge of a student who has attended a few lessons on differential and integral calculus, and mechanics.\nThe publisher gave this description of the second volume:-\nThis second part of the beautiful treatise of Jean Chazy is second to none as the leading report of interest. It discusses the principles of relativity, the equations of gravitation, the determination of\nd\ns\n2\nds^{2}\nd\ns\n2\n,\nSchwarzschild\nequations of motion, the\nn\nn\nn\n-body problem and finally cosmogonic hypotheses related to the\nd\ns\n2\nds^{2}\nd\ns\n2\nof the universe. The beautiful clarity in the exposition, the scope of information and the contributions from the author himself make this book indispensable to anyone who wants to enter the heart of the theories to which Einstein's name is attached.\nHere are the headings of the twelve chapters in the text.\nVolume I:\n(1)\nThe calculus of variations. Geodesics of a\nd\ns\n2\nds^{2}\nd\ns\n2\n;\n(2)\nThe law of gravitation derived from the\nSchwarzschild\nd\ns\n2\nds^{2}\nd\ns\n2\nand the advance of planetary perihelia;\n(3)\nThe law of gravitation of the theory of relativity and the classical theory of perturbations;\n(4)\nThe work of\nLe Verrier\nand\nNewcomb\n;\n(5)\nExplanations of three disagreements between Newtonian theory for the major planets and observation;\n(6)\nThe bending of light rays near the Sun.\nVolume II:\n(7)\nBirth of the Theory of Relativity. Displacement of spectral lines;\n(8)\nThe ten differential equations of gravitation;\n(9)\nThe structure of the\nSchwarzschild\nd\ns\n2\nds^{2}\nd\ns\n2\n;\n(10)\nThe\nLaplace\nequation and the\nPoisson\nequation. The velocity of the propagation of gravity. Approximate equations of motion;\n(11)\nRotation of a central body. The\nn\nn\nn\n-body problem. Motion of the Moon;\n(12)\nCosmological hypotheses.\nIn\n1933\n, Chazy published another two-volume work, namely\nCours de Mecanique Rationelle\nⓉ\n(\nRational mechanics course\n)\n. This work was very popular and he published further editions, the third being published in\n1947\n(\nVolume I\n)\nand\n1948\n(\nVolume II\n)\n. In a review of the two volumes\nPhilip Franklin\nwrites:-\n[\nThe first volume\n]\non the dynamics of a material particle begins with a discussion of vectors. The principles of mechanics are then formulated and in successive chapters applied to problems of equilibrium, motion in one, two and three dimensions, and later to motion on a curve and in a surface. The effects of friction and the rotation of the earth are discussed. The treatment is clear and logical with special attention devoted to qualitative results and the precise consideration of singular situations where the simplest existence theorems do not apply.\n[\nThe second\n]\nvolume discusses systems of particles, rigid bodies, strings, hydrostatics, hydrodynamics and gravitational potential. The treatment is clear, concise and exact.\nS G Hacker\n[\n9\n]\nwrites:-\nProfessor Chazy's 'Cours' provides another lucid, and in this case refreshing, introduction to theoretical dynamics.\nIn\n1953\nChazy published\nMécanique céleste. Equations canoniques et variation des constantes\nⓉ\n(\nCelestial mechanics. canonical equations and variation of constants\n)\n. G Lampariello writes:-\nThis monograph should be considered as an important complement to the two major treatises on celestial mechanics by\nTisserand\n[\nTraité de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\n]\nand\nPoincaré\n[\nMéthodes Les nouvelles de la mécanique céleste; Leçons de mécanique céleste\nⓉ\n(\nNew methods of celestial mechanics; lessons on celestial mechanics\n)\n]\n. The masterly exposition of the fundamental concepts makes a happy reconciliation between classical and relativistic concepts. The author calculates the shift of the perihelion of the planets and the bending of light in the gravitational field of the Sun and compares the theoretical results with the observations.\nPierre Costabel gives the following overview of Chazy's contributions in\n[\n1\n]\n:-\nWhile penetrating in an original and profound way the field of research opened by the relativity revolution, Chazy nevertheless remained a classically trained mathematician. With solid good sense, he held a modest opinion of himself. The reporters of his election to the Academy were, however, correct to stress how much, in a period of crisis, celestial mechanics needed men like him, who were capable of pushing to its extreme limits the model of mathematical astronomy that originated with\nNewton\n. Thus, beyond the lasting insights that Chazy brought to various aspects of the new theories, his example remains particularly interesting for the philosophy of science.\nChazy received many honours for his contributions. He was elected a member of the astronomy section of the\nAcademy of Sciences\non\n8\nFebruary\n1937\n, and became a member of the Bureau des Longitudes in\n1952\n. He was also a member of the\nRomanian Academy of Sciences\nand a member of the\nBelgian Academy of Sciences\n. In\n1934\nhe was elected president of the\nSociété Mathématique de France\n, being followed in this position in\n1935\nby\nMaurice Fréchet\n. He was also elected to the Geographical Society of Peru and the Institute of Coimbra in Portugal. When he retired in\n1953\nhe was made a Commander of the Légion d'Honneur.",
  "matematicos_citados_na_biografia": [
    "Paul Painlevé",
    "Henri Poincaré",
    "Émile Picard",
    "Painlevé",
    "Academy of Sciences",
    "Pierre Boutroux",
    "Paul Appell",
    "Émile Borel",
    "Albert Einstein",
    "Schwarzschild",
    "Le Verrier",
    "Newcomb",
    "Laplace",
    "Poisson",
    "Philip Franklin",
    "Tisserand",
    "Poincaré",
    "Newton",
    "Romanian Academy of Sciences",
    "Belgian Academy of Sciences",
    "Société Mathématique de France",
    "Maurice Fréchet"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}