{
  "nome_completo": "Jeremiah Chappelle Certaine",
  "nome_curto": "Jeremiah Certaine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Certaine/",
  "data_nascimento": "6 June 1920",
  "local_nascimento": "Philadelphia, Pennsylvania, USA",
  "data_morte": "30 July 1993",
  "local_morte": "Mount Vernon, Westchester, New York, USA",
  "summary": "Jeremiah Certaine was an African American mathematician who was awarded a Ph.D. by Harvard University for a thesis on algebra in 1945 . He taught at Howard University for a few years but for most of his career he was an applied mathematician for Nuclear Development Associates and the United Nuclear Corporation.",
  "biografia": "Jeremiah Certaine\nwas an African American, the son of Lawrence Certaine\n(1884\n-\n1966)\nand Sadie M Hall\n(1885\n-\n1956)\n. Lawrence Certaine, born in Hansometown, Duval, Florida, USA, worked as a carrier for the US Government, then later as a postman for the US Mail. He married Sadie Hall, born in Maryland, USA, and they had nine children, five boys and four girls, with Jeremiah, the subject of this biography, being their sixth child.\nJeremiah was brought up and attended school in Philadelphia. Graduating from High School, he continued to study in Philadelphia, entering Temple University. This university had been founded as Temple College in\n1888\n:-\n... primarily for the benefit of Working Men; and for men and women desirous of attending the same.\nCertaine was awarded a B.A. by Temple University in\n1940\nand was accepted to continue studying mathematics at Temple University for a Master's Degree which he was awarded in\n1941\n. While he was a student, Certaine completed a World War II Draft Card on\n1\nJuly\n1941\n. It gives the following details. Name: Jeremiah Certaine; Race: Black; Age:\n21\n; Birth Date:\n6\nJune\n1920\n; Birth Place: Philadelphia, Pennsylvania, USA; Residence Place: Philadelphia, Philadelphia, Pennsylvania, USA; Registration Date:\n1\nJuly\n1941\n; Registration Place: Philadelphia, Philadelphia, Pennsylvania, USA; Height:\n5\nft\n11\nins; Weight:\n150\nlbs; Complexion: Light Brown; Hair Colour: Black; Eye Colour: Brown; Next of Kin: Sadie Certaine.\nAfter the award of his Master's Degree, Certaine went to Harvard University where he began research advised by\nGarrett Birkhoff\n. In\n1942\n-\n43\nhe was a member of the Harvard Math Club and presented the paper\nGroups as algebras of a single operation\nat one of its meetings. In\n1943\nhe published the paper\nThe ternary operation\n(\na\nb\nc\n)\n=\na\nb\n−\n1\nc\n(abc) = ab^{-1}c\n(\na\nb\nc\n)\n=\na\nb\n−\n1\nc\nof a group\nwhich was reviewed by\nDan Rutherford\n[\n11\n]\n:-\nLet G be a set of elements on which there is defined a ternary operation\n(\nabc\n)\nsatisfying the following postulates:\n(\ni\n)\n((\nabc\n)\nde\n)\n=\n(\nab\n(\ncde\n))\n,\n(\nii\n)\n(\nabb\n)\n= a,\n(\niii\n)\n(\nbba\n)\n= a. These postulates are shown to be independent and consistent. It is proved that any element u of G may be chosen as the identity of a group\nG\nu\nG_{u}\nG\nu\n​\ndefined by ab=\n(\naub\n)\nand that\n(\na\nb\nc\n)\n=\na\nb\n−\n1\nc\n(abc)=ab^{-1}c\n(\na\nb\nc\n)\n=\na\nb\n−\n1\nc\n. Further, the groups\nG\nu\nG_{u}\nG\nu\n​\nare isomorphic. Equivalent and weaker postulates are also considered. A geometrical interpretation of the ternary operation leads to an abstract definition of a set of free vectors. It is proved that any group may be converted into a group of free vectors and conversely.\nIn the paper Certaine writes:-\nI wish to express my gratitude to\nGarrett Birkhoff\nfor his kind assistance and encouragement, without which this note would probably not have been written.\nIn\n1945\nCertaine was awarded a Ph.D. from Harvard University for his\n69\n-page thesis\nLattice-Ordered Groupoids and Some Related Problems\n. The Abstract of the thesis begins as follows\n[\n7\n]\n:-\nLattice-ordered Groupoids and Some Related Problems. The idea of ideals in a commutative ring is a well-known one. We are able to multiply two ideals. For a given set of ideals we are able to find a unique smallest ideal containing any member of the set\n(\ngreatest common divisor or g.c.d.\n)\nand a unique maximal ideal contained by any member of the set\n(\nleast common multiple or l.c.m.\n)\n. Under the operations of l.c.m. and g.c.d., the ideals form a lattice; and we find that multiplication distributes over g.c.d., i.e. A, B, C are three ideals, and\n(\nB, C\n)\nis the g.c.d. or join of B and C, then A ·\n(\nB, C\n)\n=\n(\nA · B, A · C\n)\n, This is merely a special example of a lattice-ordered groupoid, defined as follows. Let G be a lattice with join\n(\na, b\n)\nand meet\n[\na, b\n]\n, with a multiplication a · b be defined over G such that a ·\n(\nb, c\n)\n=\n(\nab, ac\n)\n,\n(\nb, c\n)\na =\n(\nba, ca\n)\n.\n(\nThis is called an operator lattice.\n)\nIf multiplication is associative and an identity exists, then G is called a lattice-ordered groupoid.\nRobert Nowland is in error when he records Certaine's Ph.D. being from the University of Michigan\n[\n10\n]\n:-\nJeremiah Certaine was the fourteenth African American to earn a Ph.D. in Mathematics\n(\nUniversity of Michigan\n)\n. At this time half of all African American Ph.Ds in Mathematics were earned by students of the University of Michigan.\nIn\n1945\n, Certaine was appointed to the Radiation Laboratory at the Massachusetts Institute of Technology on a one year position. This Laboratory, which undertook microwave and radar research, had been created in\n1940\nand only operated to the end of\n1945\nwhen it was broken up. At the end of the year, in\n1946\n, he was appointed as a Research Mathematician at the Nuclear Radiation Laboratory. On\n19\nJuly\n1946\nhe married Carlotta Laura Henderson in Manhattan, New York City. Carlotta, born\n31\nMay\n1922\n, was the daughter of the Post Office worker Edgar Henderson and his wife Madeline Pearce who was an elementary school teacher.\nIn\n1947\nCertaine was appointed as an Assistant Professor of Mathematics at Howard University\n[\n3\n]\n:-\nIn\n1947\nWoodard\nwas retired,\nBlackwell\nwas chair, and two new regular faculty members had been added. One was\nClaytor\n, whose mathematical work, beginning with his\n1933\ndoctoral thesis under\nKline\nat Pennsylvania, had attracted considerable attention. It is generally agreed that his very promising career had been blunted by the racial restrictions he encountered ....\nClaytor\nwas appointed as an associate professor. The new assistant professor was Jeremiah Certaine, who had just received his Ph.D. from Harvard, and who remained at Howard until\n1951\n.\nWhile at Howard University, Certaine became a member of the\nMathematical Association of America\nin\n1949\n. He attended the International Congress of Mathematicians which was held in Cambridge, Massachusetts, from\n30\nAugust to\n6\nSeptember\n1950\n. Among the many students he taught at Howard University, we mention Eleanor Jones who said\n[\n8\n]\n:-\nMy teachers at Howard included Dr\nElbert Cox\n, who was the first Black person in the United States to receive the PhD degree in mathematics. He received his doctorate from Cornell University in\n1925\n. I also studied under\nDudley Woodard\nand\nWilliam Claytor\nwho had PhD degrees from the University of Pennsylvania and\nDavid Blackwell\n, who was eminent enough to occupy later positions at Stanford University and the University of California at Berkeley. It was Jeremiah Certaine, the Black Harvard PhD, who helped me see the beauty of algebraic structure.\nCertaine left Howard University in\n1951\nwhen he was appointed as Senior Mathematician for the Nuclear Development Associates at White Plains, New York. He had published little after his time undertaking research at Harvard University, but once in this new position with Nuclear Development Associates he became very research active, publishing reports on work undertaken under contract from the United States Atomic Energy Commission. For example in\n1953\nhis reports:\nAngular Distribution of Photons from Pane Monoenergetic Sources\n;\nIntegral Term for Elastic Scattering of Particles\n; and\nSome Remarks on Plane Conical Sources\nappeared. One of his reports in\n1954\nwas\nA Solution of the Neutron Transport Equation\nwhich begins:-\nWe present in this report the fundamental mathematical results upon which the NDA\n(\nNuclear Development Associates\n)\nneutron calculational program has been based. All our results are derived from the neutron transport equation for a plane source, from which it is also possible to obtain certain results about point sources.\nThe authors of\n[\n5\n]\nwrite:-\nAbout\n1955\n, J Certaine proposed a method for the numerical integration of the\nBoltzmann\ntransport equation, which found its fruition in a code known as NIOBE\n[\nNumerical Integration of the\nBoltzmann\nEquation\n]\nfor the lBM\n7090\nseries of computers. Basically, the transport part of the equation was evaluated in terms of the standard method of characteristic rays while a discrete energy treatment was used with the slowing clown integrals determined by\nGauss\n-\nLegendre\nquadratures. The results of some NIOBE-calculated problems have been published and a good number more were performed in the early\n1960\ns, but remain unpublished. After that the method sort of faded away, and is practically unknown today.\nCertaine continued to produce many reports, some single authored, others co-authored with other workers at Nuclear Development Associates. His excellent work led to a new appointment in\n1958\n. The\nAmerican Mathematical Monthly\nreported\n[\n9\n]\n:-\nDr Jeremiah Certaine, Howard University, has accepted the position of Manager, Department of Mathematics, Nuclear Development Corporation of America, White Plains, New York.\nHis publications over the following few years included\nOn sequences of pseudo-random numbers of maximal length\n(1958)\n,\nThe solution of ordinary differential equations with large time constants\n(1960)\n, and, with several co-authors,\nMinimum Weight Shield Synthesis for Space Vehicles\n(1964)\n.\nFrom\n1964\nCertaine worked as Science Advisor for the Office of the Manager, Research and Development Division, United Nuclear Corporation. With Lambros Lois he published\nA Round-Off Free Solution of the Boltzmann Transport Equation in Slab Geometry\nin the journal\nAdvances in Nuclear Science\nand Technology\n(1969)\n. This paper has the following summary:-\nThis chapter discusses the methods employed for the solution of the transport equation in slab geometry, transformation of the monoenergetic transport equation, a round-off free solution for the monoenergetic one-velocity single-region transport equation, the multi-region solution of the slab problem, and applications of the round-off free solution. The nuclear engineer or shield designer usually associates the Monte Carlo method with very long computing times. It turns out that at large distances from the source, very few particles can be expected to reach and to be recorded in some specific angular direction or energy range. For a reliable statistical answer, a sufficient number of particles are needed. This necessitates the tracing of the histories of an immensely large number of particles. Techniques like biased sampling and splitting and Russian roulette that increase the probability of an initial particle contributing to the final answer have been used to considerably decrease the time required for a solution. Monte Carlo calculations are resorted to only when the complications of geometry of the source and the region make it impossible to find an answer by other means. This method is particularly useful for the calculation of integral rather than differential quantities.\nHe died at Mount Vernon, Westchester, New York, at the age of\n73\nyears.",
  "matematicos_citados_na_biografia": [
    "Garrett Birkhoff",
    "Dan Rutherford",
    "Woodard",
    "Blackwell",
    "Claytor",
    "Kline",
    "Mathematical Association of America",
    "Elbert Cox",
    "Dudley Woodard",
    "William Claytor",
    "David Blackwell",
    "Boltzmann",
    "Gauss",
    "Legendre"
  ],
  "imagens": []
}