{
  "nome_completo": "Jesse Douglas",
  "nome_curto": "Jesse Douglas",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Douglas/",
  "data_nascimento": "3 July 1897",
  "local_nascimento": "New York, USA",
  "data_morte": "7 October 1965",
  "local_morte": "New York, USA",
  "summary": "Jesse Douglas worked on geometry, group theory and the calculus of variations.",
  "biografia": "Jesse Douglas\n's parents were Louis Douglas and Sarah Kommel. Jesse developed a love for mathematics while he was studying at high school in New York. After graduation from high school, he entered the City College of New York and won the Belden Medal for excellence in mathematics in his first year at the College. In winning this medal, he became the youngest person ever to receive it. After an outstanding undergraduate career he graduated with honours in mathematics in\n1916\nand entered Columbia University.\nPerhaps it is worth at this stage explaining the difference between Columbia University and Columbia College. In\n1754\nKing's College was founded in New York but following the American War of Independence, this name was regarded as inappropriate and the College was renamed Columbia College. In\n1912\nColumbia College became Columbia University but the university retained the name Columbia College for the undergraduate liberal arts school for men. It was therefore Columbia University that Douglas entered in\n1916\nto undertake research under the supervision of\nEdward Kasner\n. He took part in\nKasner\n's seminar on\ndifferential geometry\nand it was there that Douglas developed a love of geometry. Also at the seminar he first met the\nPlateau\nProblem for which he would become famous. He submitted his doctoral thesis\nOn Certain Two-Point Properties of General Families of Curves; The Geometry of Variations\nin\n1920\n. In the following year he published the main results of his doctoral thesis in the\nTransactions of the American Mathematical Society\n.\nDouglas continued to undertake research in differential geometry while teaching at Columbia College from\n1920\nto\n1926\n. His publications from this period are\nNormal congruences and quadruply infinite systems of curves in space\n(1924)\n, and\nA criterion for the conformal equivalence of a Riemann space to a Euclidean space\n(1925)\n. Then he was awarded a National Research Fellowship and, from\n1926\nto\n1930\n, he visited Princeton\n(1926\n-\n27)\n, Harvard\n(1927)\n, Chicago\n(1928)\n, Paris\n(1928\n-\n30)\n, and Göttingen\n(1930)\n. It was during this period that he worked out a complete solution to the\nPlateau\nproblem which had been posed by\nLagrange\nin\n1760\nand then had been studied by leading mathematicians such as\nRiemann\n,\nWeierstrass\nand\nSchwarz\n. The problem is to prove the existence of a surface of minimal area bounded by a given contour. Before Douglas's solution only special cases of the problem had been solved. In a series of papers from\n1927\nonwards Douglas worked towards the complete solution:\nExtremals and transversality of the general\ncalculus of variations\nproblem of the first order in space\n(1927)\n,\nThe general geometry of paths\n(1927\n-\n28)\n, and\nA method of numerical solution of the\nproblem of Plateau\n(1927\n-\n28)\n. Douglas presented full details of his solution in\nSolution of the problem of Plateau\nin the\nTransactions of the American Mathematical Society\nin\n1931\n. For this fine achievement he was awarded the\nFields Medal\nat the International Congress of Mathematicians at Oslo in\n1936\n.\nIn\n1930\nDouglas was appointed as an assistant professor of mathematics at the Massachusetts Institute of Technology. He was promoted to associate professor in\n1934\nand spent the year\n1934\n-\n35\nas a research fellow at the Institute for Advanced Study at Princeton. He left the Massachusetts Institute of Technology in\n1937\n, spending another year as a research fellow at the Institute for Advanced Study at Princeton in\n1938\n-\n39\n. He received Guggenheim Foundation Fellowships in\n1940\nand\n1941\n, then was appointed to Brooklyn College and from\n1942\nto\n1954\nhe taught there and at Columbia University. Douglas married Jessie Nayler on\n30\nJune\n1940\n; they had one son Lewis Philip Douglas.\nAfter giving a complete solution to the\nPlateau\nProblem, Douglas went on to study generalisations of it. He published\nOne-sided minimal surfaces with a given boundary\n(1932)\nand\nA Jordan space curve no arc of which can form part of a contour which bounds a finite area\n(1934)\n. In\n1943\nDouglas was awarded the\nBôcher\nPrize by the\nAmerican Mathematical Society\nfor his memoirs on the\nPlateau\nProblem. In particular the award was for three papers all published in\n1939\n:\nGreen's function and the problem of Plateau\nand\nThe most general form of the problem of Plateau\npublished in the\nAmerican Journal of Mathematics\nand\nSolution of the inverse problem of the calculus of variations\npublished in the\nProceedings of the National Academy of Sciences\n. In the first of these Douglas looked at the following form of the problem: Given an aggregate\nG\nG\nG\nof\nk\nk\nk\nnon-intersecting\nJordan\ncurves in\nn\nn\nn\n-space, to find a minimal surface bounded by\nG\nG\nG\nand having a prescribed genus\nh\nh\nh\nand a prescribed orientability character\n(\none-sided or two-sided\n)\n. In the second paper the following problem is studied by Douglas: Given a Riemann surface\n(\nor semi-surface\n)\nR\nR\nR\nwith boundary\nC\nC\nC\n, and given in\nn\nn\nn\n-space a topological image\nG\nG\nG\nof\nC\nC\nC\n, to prove the existence of a minimal surface topologically equivalent to\nR\nR\nR\nand bounded by\nG\nG\nG\n. The third paper does not give the compete proof for the solution of the inverse problem of the calculus of variations but is an announcement of the result.\nThese three papers were, amazingly, not the only ones which Douglas published in\n1939\n. He also published\nThe analytic prolongation of a minimal surface across a straight line\nwhich gives a generalisation of some earlier results on minimal surfaces with a simpler proof,\nThe higher topological form of Plateau's problem\nwhich compares the methods which Douglas used in the first two of his papers which won the\nBôcher\nPrize, and\nMinimal surfaces of higher topological structure\n. Another five papers by Douglas appeared in\n1940\n:\nTheorems in the inverse problem of the calculus of variations; Geometry of polygons in the complex plane; On linear polygon transformations; A converse theorem concerning the diametral locus of an algebraic curve\nand\nA new special form of the linear element of a surface\n. The second and third of these papers generalise the following elementary geometrical theorem:  If on each side of any triangle as base an isosceles triangle with\n120\n° as vertex-angle is constructed\n(\nalways outward or always inward\n)\n, then the vertices of these isosceles triangles form an equilateral triangle.\nIn\n1942\nDouglas published a non-technical survey of the theory of integration. His starting point was the quadrature of a circle and of a segment of a parabola by\nArchimedes\n. He then gave the definitions of the\nRiemann\n,\nRiemann\n-\nStieltjes\nand\nLebesgue\nintegrals, and presented their properties. In the\n47\npage text, Douglas also mentions\nFourier series\nand transforms,\nDenjoy\nintegrals and the double integrals of\nRiemann\nand of\nLebesgue\n. Douglas also worked\ngroup theory\nand, in\n1951\n, studied groups with\n2\ngenerators\nx\n,\ny\nx, y\nx\n,\ny\nsuch that every element can be expressed in the form\nx\nn\ny\nm\nx^{n}y^{m}\nx\nn\ny\nm\n, where\nn\n,\nm\nn, m\nn\n,\nm\nare integers. He published a number of papers on this topic entitled\nOn finite groups with two independent generators\n. He also presented a series of papers\nOn the basis theorem for finite abelian groups\n.\nHis wife, Jessie Douglas died in\n1955\n, the year in which Douglas was appointed professor of mathematics at the City College of New York. He remained in that post for the final ten years of his life, living in Butler Hall,\n88\nMorningside Drive in New York.",
  "matematicos_citados_na_biografia": [
    "Edward Kasner",
    "Kasner",
    "differential geometry",
    "Plateau",
    "Lagrange",
    "Riemann",
    "Weierstrass",
    "Schwarz",
    "calculus of variations",
    "problem of Plateau",
    "Fields Medal",
    "Bôcher",
    "American Mathematical Society",
    "Jordan",
    "Archimedes",
    "Stieltjes",
    "Lebesgue",
    "Fourier series",
    "Denjoy",
    "group theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}