{
  "nome_completo": "João Delgado",
  "nome_curto": "João Delgado",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Delgado/",
  "data_nascimento": "1553",
  "local_nascimento": "Lagos, Portugal",
  "data_morte": "30 September 1612",
  "local_morte": "Coimbra, Portugal",
  "summary": "João Delgado was a Portuguese mathematician, priest and architect. He made important contributions to the debate about the place of mathematics in a curriculum.",
  "biografia": "João Delgado\nwas born in Lagos, a town on the south coast of Portugal not far from the south west tip of the country. There are no precise details of his birth and the year is simply a \"best guess\" based on other dates. Lagos was an important port for Portuguese ships sailing to make discoveries in the New World and much of the spices and goods brought back to Portugal came through this port.\nThe first fact that we know about Delgado\n(\nother than his place of birth\n)\nis that he entered the Society of Jesus\n(\ncommonly known as the Jesuits\n)\nin\n1574\n. We, therefore, know nothing about the first\n21\nyears of his life. In\n1576\nhe went to Rome to study with one of the most eminent scholars of mathematics of the day, namely the Jesuit\nChristopher Clavius\n.\nClavius\n, from a region which is now Germany, was well-known to the Jesuits of Portugal since after entering the Jesuit order in\n1555\nin Rome, he had studied at the University of Coimbra in Portugal in the following year. Let us note that the University of Coimbra was founded in Lisbon in\n1290\nbut moved permanently to Coimbra in\n1537\n. Portugal had a second university, the University of Évora which existed between\n1559\nand\n1779\n, but after the University of Évora was closed the University of Coimbra was the only Portuguese university until the University of Lisbon was founded in\n1911\n.\nClavius\nspent four years in Coimbra studying at the university before returning to Rome where, after studying theology, he taught mathematics at the Jesuit Collegio Romano in Rome from\n1564\n. He had been teaching there for twelve years when Delgrado arrived in\n1576\nto begin his nine years studying at the Collegio Romano. This was an extremely important time in Delgado's mathematical development and\nClavius\n's influence would be the basis of the contribution he made after returning to Portugal.\nIn\n1585\nDelgado returned to Portugal with the intention of going to Brazil but, for some reason that is not known, the trip never happened. It has been conjectured that may have taught mathematics in\n1585\n-\n86\nbut this is not known for certain. What we do know for certain is that in\n1586\n-\n87\nhe taught in Coimbra, but not giving courses open to all but just teaching members of the Jesuit Order at the Jesuit residence in the city. In the two years\n1587\n-\n89\nhe continued to teach in Coimbra but during these years his courses were at the College of Jesus which was open to both Jesuit and lay students. This Jesuit College was initially built in\n1542\nand is the oldest Jesuit College in the world. It remained an independent college until\n1759\nwhen, after the Jesuits were expelled from Portugal, the College became part of the University of Coimbra. In\n1589\n-\n90\n, Delgado was sent to Évora where the Jesuit University of Évora was operating. During this year he did not teach but spent it in priestly duties.\nAlthough in Delgado's time there were only two universities in Portugal, there were other Jesuit colleges where elementary mathematics was taught. The most important was the College of Santo Antão in Lisbon which started to give courses from\n18\nOctober\n1553\n. These were held in a house used by the Jesuits since\n1542\n. Portugal, a small country with a population of around one million at this time, was ambitious in building a large overseas empire and an important requirement to achieve this was to have men with great navigation skills. Mathematics and astronomy were the foundation of these skills but Portuguese universities concentrated on teaching theology so the King of Portugal appealed for instructional courses to be set up. Teaching of\nEsfera\n, meaning the sphere, was set up in the College of Santo Antão and from the beginnings this course was given only to Jesuit students. However, there were no dedicated mathematics teachers in Portugal so still only very basic mathematics\n(\nbeginnings of\nEuclid\n's\nElements\nand some use of navigational instruments\n)\nwas being taught by professors of philosophy. Only the first part of\nSacrobosco\n's\n1220\ntext\nTractatus de Sphaera\nⓉ\n(\nTreatise on the sphere\n)\nwas used for this teaching. The first chapter of this book deals with the shape and place of the Earth within a spherical universe. The second chapter deals with various circles on the sky. The third chapter describes rising and setting of heavenly bodies from different geographical locations while the fourth chapter gives a brief introduction to\nPtolemy\n's theory of the planets and of eclipses. This mathematics teaching did not accomplish the need for many skilled navigators so, in\n1590\n, Delgado was appointed to teach the\nAula de Esfera\n, the Course of the Sphere, at the College of Santo Antão in a course available to both Jesuits and lay students. This appointment made him the first professor of mathematics in Portugal. Delgado held this appointment until his death\n22\nyears later, but he did not teach the Aula de Esfera continuously at the College of Santo Antão during these years.\nDelgado had a second position as the chief architect for Portugal. Among the works he undertook as an architect we mention those for the College of Santo Antão, the Jesuit Novitiate at Cotovia, and the College of Arts in Coimbra. When Delgado was occupied with these architect's duties, the Aula de Esfera was delivered by Francisco da Costa\n(1567\n-\n1604)\nwho was his assistant.\nIn order to understand the significance of Delgado's contributions, we need to examine a little of the background to the position of mathematics at this time. The main problem posed was whether mathematics met the requirements of a science as set out by\nAristotle\nin the\nAnalytica posteriora\n. This revolved around what became known as the 'Quaestio de certitudine mathematicarum', namely the question of the certitude of mathematics. The debate arose from the writings of Alessandro Piccolomini\n(1508\n-\n1578)\nwho was born in Sienna, studied in Padua, Bologna and Rome, and taught in Sienna and Rome. He raised serious doubts about the scientific value of mathematics, stating that the discipline did not meet the most important scientific requirement, that of presenting the causes of the conclusions. He published\nCommentarium de certitudinem mathematicarum disciplinarum\nⓉ\n(\nCommentary on the certainty of mathematical disciplines\n)\n(1547)\nwhich\n[\n14\n]\n:-\n... contains the provocative thesis that certitude in mathematics does not rely upon proofs. Piccolomini argues that, since a mathematical proof cannot meet the requirements for the most certain kind of proof, the so-called demonstratio potissima, mathematics does not derive its certainty from its proofs; instead, it derives its certainty from its content.\nFrancesco Barozzi\n(\nbetter known by the Latin form of his name\nFranciscus Barocius\n)\npublished\nOpusculum, in quo una Oratio, et duae Quaestiones: altera de certitudine, et altera de medietate Mathematicarum continentur\nⓉ\n(\nAn essay, in which one statement and  two questions: one of the certainty of mathematics, and the other of what mathematics contains\n)\nin\n1560\n. This was written to argue against the views of Piccolomini and argues that mathematical certainty derives from the nature of its proofs:-\n... the certitude of mathematics is contained in the syntactic rigour of demonstrations.\nChristopher Clavius\nproduced a version of\nEuclid\n's\nElements\nin\n1574\nwhich defended the certainty of mathematical proofs. However, Benito Pereira\n(1536\n-\n1610)\n, a Spanish Jesuit who taught in Rome, endorsed Piccolomini\"s views in\nDe communibus omnium rerum naturalium\nⓉ\n(\nWhat all natural things have in common\n)\n(1576)\n. In fact Pereira went further than Piccolomini denying any scientific value to mathematics.\nWe explained above that Delgado was in Rome, studying with\nClavius\n, from\n1576\nto\n1585\nso we see that he was in Rome at just the time when this argument was raging. Jesuits around the world took sides in the argument, the Jesuits in Coimbra, for example, taking the side of Benito Pereira. We should understand that, in many ways, the debate on the certitude of mathematics was between philosophers who sided with Piccolomini and Pereira, and mathematicians who took the opposing view. This, of course, illustrates the importance in the Portuguese context of the mathematician Delgado opposing the philosophers of Coimbra.\nWe know in detail what Delgado taught in his\n1605\n-\n06\nAula de Esfera\nsince the text of that course survives. We also have details of his\n1606\n-\n07\ncourse. A manuscript containing material thought to be from his\n1598\ncourse also exists. The book\n[\n1\n]\ncontains a collection of fascinating articles about these courses of Delgado, although we should point out that it is\n45\nyears old and some of its conclusions have been superceded by more recent research. Delgado begins by citing the theses and arguments of the detractors of mathematics. Some, he explains, argue that mathematics does not proceed by means of proper causes, but only by the formal arguments which is a sign of inferiority in relation to physics. Others argue, says Delgado, that mathematics does not proceed by any cause since mathematical causes are only metaphorical, and others do not accept that mathematical proofs proceed from their own principles. Although he is clearly referring to the arguments by Piccolomini and Pereira, he does not mention them by name. In particular, he explains that some reject\nEuclid\n's proof that the sum of the angles of a triangle add to two right angles because it uses the external angle in the proof and this is not a part of the triangle.\nThen Delgado explains that his view of mathematics is completely the opposite of that presented by these detractors of mathematics. He ends his introductory chapter giving four theses which give his view of mathematics\n[\n1\n]\n:-\nDelgado's thinking can be summarized as follows: Mathematics fulfils the Aristotelian requirements so that one can and should consider it a perfect science; mathematics is a superior discipline, whose results influence the production of theories of other scientific disciplines, such as physics. João Delgado is an example of the Collegio Romano's role in the formation of specialized core groups in the teaching and promotion of mathematics. What stands out in the introductory chapter of his course is the breadth of topics covered, the extent of his defence of mathematics, his deep knowledge of the technicalities involved, and the force of his attack on his opponents, which goes well beyond the brief arguments presented in the prolegomena of works of\nClavius\n.\nLuís Miguel Carolino looks at this aspect of Delgado's contribution in\n[\n12\n]\n. He writes in summary:-\nChallenging the views traditionally endorsed by philosophers on this matter, Delgado argued that mathematics fit all the main features of Aristotelian science, and therefore it should be considered as a true science. By doing so, Delgado was one of the first Jesuit mathematicians to defend the scientificness of mathematics within a strict Aristotelian framework.\nA more detailed summary of Luís Miguel Carolino's excellent paper\n[\n12\n]\nis given at\nTHIS LINK\n.\nThe Jesuits of Coimbra reacted strongly to Delgado's strongly worded attack. Sebastião do Couto\n(1554\n-\n1638)\nproduced the University of Coimbra response and the argument would rumble on for many years, particularly in Italy, France, Germany and Portugal. Delgado, however, played an important role in this argument and deserves considerable praise for his defence of mathematics and its importance to other disciples, something which today is completely taken for granted.\nOne other aspect of Delgado's contribution is important for the development of mathematics in Portugal, namely the small group of fellow mathematicians he built at the College of Santo Antão in Lisbon. Most of these mathematicians, such as Francisco da Costa, taught at the College of Santo Antão and helped to build Portuguese mathematics.\nNo book by Delgado was ever published but it is known that he intended to write one. His aim was to produce a text to teach mathematics in a three year course and he sent a request to Rome in\n1606\nfor an assistant to assist him in producing this work.\nClavius\nwould have had to approve the final version of such a publication but, as far as we know, no text from Delgado ever reached him. It is not impossible, although very unlikely, that one day a draft of this book might turn up in some library or private collection. More probably, however, the book was never written.",
  "matematicos_citados_na_biografia": [
    "Christopher Clavius",
    "Clavius",
    "Euclid",
    "Sacrobosco",
    "Ptolemy",
    "Aristotle",
    "Francesco Barozzi",
    "Franciscus Barocius",
    "THIS LINK"
  ],
  "imagens": []
}