{
  "nome_completo": "Johann Heinrich Lambert",
  "nome_curto": "Johann Heinrich Lambert",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lambert/",
  "data_nascimento": "26 August 1728",
  "local_nascimento": "Mülhausen, Alsace (now Mulhouse, France)",
  "data_morte": "25 September 1777",
  "local_morte": "Berlin, Prussia (now Germany)",
  "summary": "Johann Lambert was the first to provide a rigorous proof that π is irrational.",
  "biografia": "Johann Heinrich Lambert\n's family were originally from Lorraine which was a French territory up to the Thirty Years' War. Three Christian denominations, Roman Catholicism, Lutheranism, and Calvinism, each tried to impose themselves and various countries joined in the conflicts which raged across Europe for many years. In\n1635\nthe Lambert family, who were Calvinists, fled from Lorraine as religious refugees and settled in Mulhouse. At that time Mulhouse was a free imperial city which had formed defensive alliances with the Swiss.\nLambert's father, Lukas Lambert, was a tailor as his own father had been. Lukas married Elizabeth Schmerber in\n1724\nand Johann Heinrich Lambert was one of their five sons. It was a large family, with two girls in addition to the five boys, and Lukas Lambert did not have sufficient income to enable him to support and educate the family in comfort. Heinrich attended school in Mulhouse, receiving a reasonably good education up to the age of twelve, studying French and Latin in addition to elementary subjects. However, when he was twelve years old he had to leave school to help his father with tailoring. Most young boys would have ended their education at that point, but not young Heinrich who continued to study in his own spare time. Usually his day was fully occupied in helping his father but in the evenings he would study scientific subjects on his own.\nThis pattern of study became increasingly difficult when, at the age of fifteen, he had to work as a clerk to earn more money for the family. In fact it was a natural occupation for Heinrich since he had acquired great skill in calligraphy and he was given a job at the ironworks at Seppois, which was south of Mulhouse and almost due west of Basel. Soon his increasing skill in academic subjects helped him to gain work as a private tutor. When he was seventeen years old Lambert left his position at the ironworks to take up a post as secretary to Johann Rudolf Iselin who was the editor of the\nBasler Zeitung\n, a conservative daily paper. This position was ideal for Lambert who could now concentrate even more deeply on his own study of mathematics, astronomy, and philosophy. He wrote in a letter\n(\nsee\n[\n1\n]\n)\n:-\nI bought some books in order to learn the first principles of philosophy. The first object of my endeavours was the means to become perfect and happy. I understood that the will could not be improved before the mind had been enlightened. I studied Christian Wolff \"On the power of the human mind\",\nNicolas Malebranche\n\"On the investigation of truth\" and John Locke \"Essay concerning human understanding\". The mathematical sciences, in particular algebra and mechanics, provided me with clear and profound examples to confirm the rules I had learned. Thereby I was able to penetrate into other sciences more easily and more profoundly, and to explain them to others, too. It is true that I was aware of the lack of oral instruction, but I tried to replace this by even more assiduity ...\nIn\n1748\n, when he was twenty years old, Lambert took up a new position, this time as a tutor in the home of Count Peter von Salis in Chur. This town was in Graubünden which at that time was part of the Swiss Confederation. He became tutor to the Count's grandson and his cousin, who were both eleven years old, and another family member who was seven. Lambert could now use the excellent library in the Count's home and was in an even stronger position to continue his studies of mathematics, astronomy, and philosophy. While in Chur, he made his own astronomical instruments and delved deeply into mathematical and physical topics.\nIt was in Chur that Lambert first came to be noticed by the scientific community. He was elected to the Literary Society of Chur and to the Swiss Scientific Society based in Basel. He undertook work for the Scientific Society such as making regular meteorological observations and he began to publish scientific articles, his first being on caloric heat which appeared in\nActa Helvetica\nin\n1755\n. This paper by Lambert on the theory of heat appeared in Volume\n2\nof the journal published by the Societas Helvetica which had been founded in\n1751\n(\nsee\n[\n23\n]\nfor details\n)\n. In\n1756\nLambert left Chur with the two older boys whom he had tutored during the previous eight years; they were now\n19\nyears old. He took the two young men on a \"grand tour\" of Europe, first visiting Göttingen. There Lambert met\nKästner\nand\nTobias Mayer\n, and was elected to the Learned Society of Göttingen.\nNow\n1756\nwas not the best time to begin a tour of Europe. In that year the French-Austrian alliance prepared to attack Prussia but the latter did not wait to be attacked and began hostilities by invading Saxony on\n29\nAugust. The French and Austrians began to get the upper hand in\n1757\nand occupied Göttingen while Lambert was studying there. He left with his two pupils and went to Utrecht which they used as a base for the next two years while they visited most of the main Dutch cities.\nLambert's first book, which was on the passage of light through various media, was published in The Hague in\n1758\n. Before returning to Chur, Lambert took his pupils to Paris, where he met\nd'Alembert\n, and to Marseilles, Nice, Turin, and Milan. The thirty year old Lambert now decided that it was time to find a scientific position and left Peter von Salis's family soon after they had completed their \"grand tour\". However this did not prove to be an easy task and his first wish, namely to get a position in Göttingen, soon proved impossible to achieve. After a few months spent in Zürich making astronomical observations, he returned to his home in Mulhouse where he spent several further months. In\n1759\nhe went to Augsburg where he found a publisher for two more of his books,\nPhotometria\nⓉ\n(\nPhotometry\n)\nand\nCosmologische Briefe\nⓉ\n(\nBrief letters on Cosmography\n)\n. Of\nPhotometria\n, published in\n1760\n, Scriba writes:-\nLambert carried out his experiments with few and primitive instruments, but his conclusions resulted in laws that bear his name. The exponential decrease of the light in a beam passing through an absorbing medium of uniform transparency is often called 'Lambert's law of absorption', although\nBouguer\ndiscovered it earlier. 'Lambert's cosine law' states that the brightness of a diffusely radiating plane surface is proportional to the cosine of the angle formed by the line of sight and the normal to the surface.\nIn\n1760\nEuler\nrecommended Lambert for the position of Professor of Astronomy at the\nSt Petersburg Academy of Sciences\nto fill a vacancy which, due to a reorganization of the Academy and political changes, remained unfilled for several years. Lambert was asked to organise a Bavarian Academy of Sciences in Munich along the lines of the\nBerlin Academy\n, but he fell out with other members of the project and left the new Academy in\n1762\n. By this time, however, his important work on cosmology\nCosmologische Briefe\nⓉ\n(\nBrief letters on Cosmography\n)\n(1761)\nhad appeared. It is the first scientific presentation of the notion that the Universe is composed of galaxies of stars. Coffa, reviewing\n[\n22\n]\nwrites:-\nLambert's finite Universe is composed of galaxies, supergalaxies and even higher systems of stars all of which rotate around their respective centres; each of these centres is occupied by a \"regent\", an immensely large, exceedingly dense and opaque body. The whole is dominated by the centralmost body or supreme regent, the body \"which steers around itself the whole creation\". Lambert's book is also remarkable for the modernity of its methodological stand: his systematic survey of the differences among facts, theories, predictions and possible verifications was not emulated in cosmological literature until the\n20\nth\ncentury.\nAfter returning from Munich, Lambert took part in a survey of the border between Milan and Chur, and also visited Leipzig where he was able to find a publisher for a work on philosophy\nNeues Organon\n(\npublished in\n1764)\n.\nHe wanted to gain a position at the\nBerlin Academy of Sciences\nand so become a colleague of\nEuler\nand\nLagrange\n. Lambert was therefore delighted to go to Berlin in\n1764\nat the invitation of\nEuler\n. However, although Lambert joined the Huguenot Church, of which\nEuler\nwas a staunch member, differences between the two men soon arose, mainly concerning the income of the Academy, which depended on its privilege to sell calendars. It may well be that these differences contributed to\nEuler\n's decision to leave Berlin for St Petersburg in\n1766\n. However these were not the only problems that Lambert faced after arriving in Berlin for at first Frederick II refused to appoint Lambert to the Academy on account of his unusual appearance, strange dress and eccentric behaviour. These were in part due to his humble background together with the fact that he deliberately chose not to conform to the conventions of the upper classes. Also it was in part due to his devout religious attitude. However, once Frederick II got to know Lambert, he discovered that he was a man of extraordinary insight. Scriba writes\n[\n1\n]\n:-\nAs a member of the physical class for twelve years, until his death at the age of forty-nine, Lambert produced more than\n150\nworks for publication. He was the only member of the Academy to exercise regularly the right to read papers not only in his own class, but in any other class as well.\nIn\n1766\nLambert wrote\nTheorie der Parallellinien\nⓉ\n(\nThe theory of parallel lines\n)\nwhich was a study of the\nparallel postulate\n. By assuming that the parallel postulate was false, he managed to deduce a large number of\nnon-euclidean\nresults. He noticed that in this new geometry the sum of the angles of a triangle increases as its area decreases.\nOf his work on geometry, Folta writes in\n[\n14\n]\n:-\nLambert tried to build up geometry from two new principles: measurement and extent, which occurred in his version as definite building blocks of a more general metatheory. Above all, Lambert carefully considered the logical consequences of these axiomatically secure principles. His axioms concerning number can hardly be compared with\nEuclid\n's arithmetical axioms; in geometry he goes beyond the previously assumed concept of space, by establishing the properties of incidence. Lambert's physical erudition indicates yet another clear way in which it would be possible to eliminate the traditional myth of three-dimensional geometry through the parallels with the physical dependence of functions. A number of questions that were formulated by Lambert in his metatheory in the second half of the\n18\nth\ncentury have not ceased to remain of interest today.\nLambert is best known, however, for his work on π.\nEuler\nhad already established in\n1737\nthat\ne\ne\ne\nand\ne\n2\ne^{2}\ne\n2\nare both\nirrational\n. However Lambert was the first to give a rigorous proof that π is irrational. In a paper presented to the\nBerlin Academy\nin\n1768\nLambert showed that, if\nx\nx\nx\nis a nonzero\nrational number\n, then neither\ne\nx\ne^{x}\ne\nx\nnor\ntan\n⁡\nx\n\\tan x\ntan\nx\ncan be rational. Since tan\n(\nπ/\n4)\n=\n1\nthen π/\n4\nmust be irrational. In\n[\n34\n]\nthere is discussion of the claim that Lambert's proof is incomplete and requires a result by\nLegendre\nto complete it. Wallisser shows that Lambert's proof is not only complete but is an outstanding mathematical achievement for its time. In fact it was\nPringsheim\nin\n1898\nwho first noted that Lambert's proof was absolutely correct and exceptional for its time, since the expansion of the tangent function was not only written down formally, but also proved to be a convergent continued fraction. Also, remarkably, Lambert conjectured in this paper that\ne\ne\ne\nand π are\ntranscendental\n. This was not proved for another century when\nHermite\nproved that\ne\ne\ne\nis transcendental and\nLindemann\nproved that π is transcendental.\nLambert also made the first systematic development of hyperbolic functions. A few years earlier they had been studied by\nVincenzo Riccati\n. Lambert is also important for his study of the trigonometry of triangles on surfaces, his work on perspective and cartography, as well as his contributions to the\ntheory of probability\n. In this latter topic, he gave a mathematical formulation of the law of mortality in\n1772\n. His contributions to probability are evaluated by Garibaldi and Penco in\n[\n15\n]\n. They write:-\nThe lines drawn by\nJacob Bernoulli\nin the \"Ars conjectandi\" were taken up and developed in a decisive way by Lambert, whose fundamental contributions to the theory of errors in measurement have been re-evaluated in recent years. Lambert's vast, multifaceted activity covered optics, cosmology and geodesy and put him in contact with the major scientists and philosophers of his day\n(\nKant\n)\n. In his own fundamental philosophical opus, the \"Neues Organon\", Lambert developed a noteworthy theory of logical probability that, to our knowledge, has thus far escaped the attention of eminent scholars in the field such as\nKeynes\n. Logical probability is a 'third general type of probability' that follows in order of exposition the 'a priori probability' typical of games of change and the 'a posteriori probability' of statistics.\nHe also made a major contribution to philosophy and in\nAnlage zur Architectonic\nⓉ\n(\nSystems for Architecture\n)\n(1771)\nhe attempted to transform philosophy into a deductive science, modelled on\nEuclid\n's approach to geometry. In\n[\n3\n]\nBasso highlights Lambert's understanding of the main concepts of the deductive-geometric methodology, namely axioms, postulates, theorems, problems, constructions, and logic.",
  "matematicos_citados_na_biografia": [
    "Nicolas Malebranche",
    "Kästner",
    "Tobias Mayer",
    "d'Alembert",
    "Bouguer",
    "Euler",
    "St Petersburg Academy of Sciences",
    "Berlin Academy",
    "Berlin Academy of Sciences",
    "Lagrange",
    "parallel postulate",
    "non-euclidean",
    "Euclid",
    "irrational",
    "rational number",
    "Legendre",
    "Pringsheim",
    "transcendental",
    "Hermite",
    "Lindemann",
    "Vincenzo Riccati",
    "theory of probability",
    "Jacob Bernoulli",
    "Keynes"
  ],
  "imagens": [
    "lambert.jpg"
  ]
}