{
  "nome_completo": "Johann Heinrich Rahn",
  "nome_curto": "Johann Rahn",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rahn/",
  "data_nascimento": "10 March 1622",
  "local_nascimento": "Zürich, Switzerland",
  "data_morte": "25 May 1676",
  "local_morte": "Zürich, Switzerland",
  "summary": "Johann Rahn was a Swiss mathematician who was the first to use the symbol ÷ \\div ÷ for division.",
  "biografia": "Johann Rahn\n's father was Hans Heinrich Rahn\n(\nborn\n7\nJuly\n1593\n, died\n21\nSeptember\n1669)\nand his mother was Ursula Escher vom Glas\n(\nborn\n1591\n, died\n28\nApril\n1663)\n. Hans Rahn was Bailiff to Töss at the time his son Johann was born and later\n(1655\n-\n1669)\nhe was Burgermeister of Zürich. At this time Töss was a town in its own right but today it is incorporated into the city of Winterthur; it is situated north east of Zürich. In fact when Johann was born his grandfather Hans Rudolf Rahn was Burgermeister of Zürich. Hans Heinrich and Ursula had four children, two boys and two girls: Hans Conrad\n(\nborn\n1616)\nwas Johann's elder brother, with Regula\n(\nborn\n1628)\nand Ursula\n(\nborn\n1635)\nbeing his two younger sisters. Johann explains in his book that in his youth he enjoyed opportunities for study both in Switzerland and abroad. It is thought that Johann Rahn's interest in mathematics came through his uncle Johann Georg Werdmüller who was an engineer. In\n1642\n, with Europe in the middle of the Thirty Years War, the city of Zürich decided to construct fortifications. Various proposals were evaluated and Werdmüller's proposal was accepted. This was also the time when Johann Rahn married Elisabeth Holzhalb\n(\nborn in\n1626)\n; they had two children Hans Heinrich\n(\nborn\n9\nMarch\n1646)\nand Hans Rudolf\n(\nborn\n18\nApril\n1669)\n.\nJohann Rahn followed in the tradition of having major roles in the administration of the city of Zürich. He\n[\n5\n]\n:-\n... was appointed a 'Schützenmeister', which meant that he supervised shooting practice, and a 'Zeugherr', responsible for military supplies and artillery.\nNow Rahn was certainly interested in mathematics, and he was carrying out small investigations, but it was only after he came in contact with\nJohn Pell\nthat he developed a deeper interest and considerably more expertise. In May\n1654\nPell\narrived in Zürich, sent there by Oliver Cromwell on a diplomatic mission. Cromwell wanted to split the Protestant cantons of Switzerland off so they might join a Protestant League with England at its head. We do not know exactly when Rahn and\nPell\nfirst came in contact but, given their respective roles, it is likely to have been soon after\nPell\narrived in Zürich. The first definite information is a letter which Rahn sent to\nPell\n, dated\n4\nNovember\n1654\n, in which he thanks\nPell\nfor sending him his publication, the two page\nA Refutation of Longomontanus's Pretended Quadrature of the Circle\n(1644)\n. Rahn also enclosed a piece of his own mathematics.\nPell\n's negotiations in Zürich were long drawn out and he remained there for a number of years. In early\n1657\nRahn began to receive regular tutoring from\nPell\n. John Aubrey explained in\nBrief lives\nthat\nPell\nhad told him that\n[\n3\n]\n:-\nRahn was Dr\nPell\n's scholar at Zürich, and came to him every Friday night.\nPell\n, in a letter to Thomas Brancker dated\n5\nMarch\n1666\n, describes Rahn as his 'disciple'. He writes that he kept:-\n... copies of the most considerable papers that he wrought in my presence or that I gave him to transcribe.\nThe tutorials came to an end in early\n1658\nwhen Rahn was appointed as governor of the Kyburg district, about\n20\nkm north east of Zürich. Once he was settled into his new role, Rahn wrote to\nPell\nexplaining that his duties as 'Landvogt' kept him very busy and this meant that he would not have time to devote to his mathematical studies. In June\n1658\nPell\nreturned to England to give his report to Cromwell only shortly before Cromwell's death. However, although\nPell\ndid not realise it, Rahn was finding more time to study mathematics than he expected from his earlier letter, for in\n1659\nhe published his famous text\nTeutsche Algebra, oder algebraische Rechenkunst, zusamt ihrem Gebrauch\nⓉ\n(\nExamples in algebra and arithmetic, together with their application\n)\n. He writes in the Preface that\n[\n4\n]\n:-\n... in the preceding summer he met at the watering place, Taynach, a nobleman, Leonard Weiss, with whom he discussed algebra and to whom he promised to prepare a work in the German language which should contain the advances due to\nVieta\n,\nDescartes\nand others, which were at that time accessible only in the Latin and French languages. He says that he took his problems partly from\nVieta\n,\nDescartes\n,\nvan Schooten\n,\nDiophantus\nand\nClavius\n.\nRahn was the first to use the symbol ÷ for division in\nTeutsche Algebra\n, a symbol which\nPell\nhad probably used when giving Rahn tutorials. The book, written in German, contains an example of\nPell\n's equation. The text is important for the innovation in algebraic symbolism that it contains but exactly how much credit is due to\nPell\nand how much to Rahn is hard to determine. Both were modest men so we must not necessarily take their comments too literally, but nevertheless the credit for much of the mathematical innovation must be due to\nPell\n. Rahn writes in the Preface that:-\n... in the solutions, and in the arithmetic too, I make use of a completely new method, which has not been used by any writer on algebra in a published work, that I first learned from an eminent and very learned person to whom I should very gladly acknowledge indebtedness and humble respect, had he permitted.\nClearly this refers to\nPell\n, but the fact that\nPell\nis not mentioned by name is almost certainly for the reason stated; because Rahn was aware that\nPell\nwould not wish to see his name in lights. We see plenty of evidence of\nPell\n's humble attitude below when discussing the English translation of the famous text.\nThe German-born Theodore Haak, a scholar and translator of wide scientific interests, gave a copy of Rahn's book to\nPell\nin\n1660\n.\nPell\nwas very impressed by the work and thought that an English translation should be made to provide a more modern algebra book than\nWilliam Oughtred\n's\nClavis Mathematicae\nⓉ\n(\nKey to mathematics\n)\n(1631)\nwhich was still the standard English algebra text. Two translations into English of Rahn's text were started, neither aware that the other was happening, and at the same time Rahn was translating his German text into Latin. Rahn left Kyburg in\n1664\nand returned to Zürich to take up the post of Secretary-Councillor there. He then completed his translation and deposited the manuscript in the library in Zürich in\n1667\n. His Latin translation had the title\nAlgebra Speciosa seu Introductio in Geometriam Universalem\nⓉ\n(\nSpecial introduction to geometry or univesal algebra\n)\nand in the Preface Rahn explains that he chose not to publish the translation since he had, by this time, learnt that an English translation was about to be published.\nIn fact Thomas Brancker had completed his English translation by May\n1665\nand it was in the hands of the publisher when\nJohn Collins\nasked him to delay publishing until he had discussed the matter with\nPell\n. After meeting with Brancker and his publisher,\nPell\nsaid\n(\nreported in a letter by Brancker\n)\n:-\nHe hoped to be at leisure, to review some of Rahn's Problems, and to work them anew; and that he would send them to me, with leave to publish them or to keep them by me.\nPell\nmodified a small part of Rahn's book but also greatly expended it to about twice its original size. Before it was published he tried to find out up-to-date details of Rahn.\nPell\nwrote to Haak on\n13\nJune\n1666\n:-\nI wish you could ... learn from Zürich, concerning Johann Heinrich Rahn, lately Landvogt der Graffschaft Kyburg, whether he be yet alive, whether he be now at Zürich, what titles or offices he hath now. You gave me his book in November\n1660\n. I suppose you know that it is turned into English, and that\n15\nsheets of it are printed. Some mention should be made of him, if we can get sufficient information concerning him.\nHaak clearly did not manage to find out anything, for no further information about Rahn was inserted when\nAn Introduction to Algebra\nwas published.\nPell\nwas in two minds as to whether his name should appear as an author. He wrote\n(\nbut never sent\n)\na letter which reads\n[\n2\n]\n:-\nI know not how my mind may alter but for the present I think it best not to name me at all in the title or preface: and yet you may be more ingenuous than Rahn was and not vent all for your own devices. You may say that the alterations and additions were made by the advice of one of good reputation in those studies.\nIn fact when the book appeared, the front cover stated \"Translated out of the High-Dutch into English by Thomas Brancker M.A. much altered and augmented by D.P.\" The \"D.P.\" stands for \"Doctor\nPell\n\". Rahn's name does not appear on the title page, but he is mentioned in the Preface.\nAlthough Rahn knew something of an English translation, Rahn did not resume contact with British mathematicians until\n1671\n. On\n17\nMay of that year Rahn wrote to Haak\n(\nsee for example\n[\n5\n]\n)\n:-\nQuite some time ago, relying on the training I received from Mr\nPell\n(\nto whom alone I am indebted for whatever I know in algebra\n)\n, I reduced and arranged the problems of\nDiophantus\nof Alexandria in algebraic form. Recently I have also finished a treatise on optics, catoptrics, and dioptrics, together with an appendix on practical dioptrics, showing the method\n(\nand the necessary instruments\n)\nfor grinding and polishing glass lenses. These things, indeed, became clear to me not on the basis of mere theory, but on the basis of actual practice and use, when I was repeatedly preoccupied by the desire not only to know how to construct large and small telescopes, and microscopes, but also - above all - when I found a method\n(\nto do with the internal part or middle circuit of the wheel\n)\nof making hyperbolic sections, thanks to which objects are rendered very clear, and the field of vision is extraordinarily enlarged.\nIn the above Rahn refers to three treatises he has written. The first on the problems of\nDiophantus\nwas entitled\nSolutio Problematum Diophanti Alexandrini\nⓉ\n(\nSolutions to  problems of Diophantus of Alexandria\n)\n. He completed it in\n1667\nand intended it as a companion volume to the Latin translation he had made of his\nTeutsche Algebra\n. Quite independently, both the English translation and Latin translation had doubled in length. The other two treatises on optics referred to by Rahn are\nTractatus von der Dioptrica oder Durchstrahlung\nⓉ\n(\nTract on dioptrics and radiation\n)\nand\nCatoptrica oder Gelbstrahlung in ebenen Flächen\nⓉ\n(\nCatoptrics or reflections in plane surfaces\n)\nbut sadly neither has survived.\nOn\n17\nApril\n1675\n, Rahn wrote to\nPell\n. By this time he was a Senator of Zürich, a Judge and President of the Criminal Court\n[\n5\n]\n:-\nI have received the Algebra - no longer 'my' Algebra, but rather, on many accounts, yours - which, thanks to your generosity, was sent to me by a certain scholar; from it, I gather that my memory is still flourishing with you, after the passing of so many years. When you were worthily fulfilling the role of English Resident, you conferred so many favours on me, so often, that whenever they come to mind, it causes me no slight pain to think that I have no ways of repaying them that would suitable to my obligations - all the more so, since they are so augmented by this favour of a new kind, that I shall never be capable of deserving them.\nThe letter goes on to explain about the optical research he undertook before his public duties became so onerous that he had no time left for research.\nFinally let us mention that when Brancker translated Rahn's\nTeutsche Algebra\nhe changed the notation\n(\nprobably to make it easier to print\n)\nand so the division sign ÷ had been replaced. When\nPell\ncame into the project to make his additions and corrections, he insisted that the division sign be reinstated as Rahn had written it. It is worth contemplating the fact that had Brancker's translation appeared in its original form it is probable that today we would not use the division sign ÷ but rather Brancker's replacement symbol.",
  "matematicos_citados_na_biografia": [
    "John Pell",
    "Pell",
    "Vieta",
    "Descartes",
    "van Schooten",
    "Diophantus",
    "Clavius",
    "William Oughtred",
    "John Collins"
  ],
  "imagens": [
    "rahn.jpg"
  ]
}