{
  "nome_completo": "John Keill",
  "nome_curto": "John Keill",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keill/",
  "data_nascimento": "1 December 1671",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "31 August 1721",
  "local_morte": "Oxford, England",
  "summary": "John Keill was a Scottish mathematician who acted as a propagator of Newton's philosophy.",
  "biografia": "John Keill\n's mother was Sarah Cockburn. She came from a family with strong associations with the Church, having an uncle who was bishop of Aberdeen and a brother who was an Episcopal priest who supported the Stuart cause refusing to take an oath of allegiance to William and Mary after James II was deposed in the Revolution of\n1688\n. John's father was Robert Keill who was an Edinburgh lawyer. James Keill who became a physicist, was John's younger brother born two years later. John attended school in Edinburgh, then studied at Edinburgh University under\nDavid Gregory\nobtaining his degree in\n1692\nwith distinction in both mathematics and physics. Keill went to Oxford with\nDavid Gregory\nin\n1692\nand, after obtaining a scholarship to finance his studies, studied at Balliol College. He obtaining an M.A. from Oxford on\n2\nFebruary\n1694\n.\nAt Oxford Keill lectured on\nNewton\n's work and was soon appointed as a lecturer in experimental philosophy at Hart Hall\n[\n2\n]\n:-\nHe therefore offered the first course on Newtonian natural philosophy, and the first reputedly based on 'experimental demonstrations', at either of the English universities. Judging from the published version of his lectures\n(\nIntroductio ad veram physicam, Oxford,\n1701)\n, many of his demonstrations were mathematical rather than experimental, being based on 'thought experiments'\n(\nimagined experiments\n)\nrather than real manipulations.\nNevertheless, some of Keill's demonstrations called for real apparatus, and the innovatory nature of his teaching, continued after\n1710\nby his studentJohn Theophilus Desaguliers\n(1683\n-\n1744)\n, should be recognised.\nKeill was appointed deputy to the Sedleian professor of natural philosophy in\n1699\n, a post he held until\n1704\n. Keill was elected a Fellow of the\nRoyal Society\nin\n1701\nand remained at Balliol College until his scholarship ran out in\n1703\nwhen he transferred to Christ Church. Despite acting as Sedleian professor of natural philosophy for five years, he failed to be appointed to fill the position when it became vacant in\n1704\n. Similarly he was unlucky to fail in his application for the Savilian Professor of Astronomy which became vacant on\nDavid Gregory\n's death in\n1708\n. Feeling that he would not progress further in Oxford, after his two failures, he decided to look for a government position. He was appointed treasurer of the fund set up to help protestant refugees from the Rhenish Palatinate. During the War of the Grand Alliance\n(1689\n-\n97)\n, the troops of Louis XIV of France invaded the Rhenish Palatinate and many of the inhabitants fled for their lives. The fund helped those who wished to settle in England. Many wished to settle in North America and Keill accompanied a party who sailed to New England. He returned in\n1711\nand considered taking up a post as a mathematician in the Republic of Venice. However he was appointed to undertake decoding work for Queen Anne and decided to remain in England. In the following year the Savilian Professorship of Astronomy in Oxford became vacant again and this time Keill was appointed taking up the post in\n1712\n.\nKeill acted as a propagator of\nNewton\n's philosophy and argued against\nWhiston\nand others. He claimed that\nLeibniz\nhad plagiarised\nNewton\n's invention of the calculus and he served as\nNewton\n's\navowed champion\n. The part played by Keill in the controversy over who invented the calculus is fully brought out in\n[\n3\n]\n. In fact\nLeibniz\n, in a\n1705\narticle, had commented on\nNewton\n's elegant use of fluxions comparing it to\nFabri\nwho had:-\n... substituted the advance of movements for the method of\nCavalieri\n.\nThis did not provoke any reaction from\nNewton\nuntil\n1711\nwhen Keill suggested that this could be interpreted as suggesting that\nNewton\n's fluxions were a moving version of\nLeibniz\n's differentials. Keill responded by accusing\nLeibniz\nof plagiarizing\nNewton\nin the\nPhilosophical Transactions of the Royal Society\nand\nLeibniz\nwrote to the\nRoyal Society\nasking that he withdraw his accusation. Keill maintained his position and\nLeibniz\nwrote to\nNewton\nasking him to tell Keill to withdraw his accusations.\nThe position went from bad to worse when\nJohann Bernoulli\ndiscovered an error in\nNewton\n's work. He wrote two articles explaining\nNewton\n's error and suggested that they demonstrated that\nNewton\ncould not have invented the calculus independently of\nLeibniz\nsince he was incapable of it. Keill wrote to\nNewton\non\n26\nApril\n1714\n:-\nI have read both pieces ... inserted in the Journal Litéraire and I think I never saw anything written with so much impudence, falsehood and slander as they are both. I am of the opinion that they must be immediately answered and I am now drawing up an answer which I will finish as soon as I hear from you ...\nAgain Keill wrote to\nNewton\non\n19\nMay\n1714\n:-\nI am almost confident that he wrote that paper on purpose to show that you did not understand second fluxions ...\nKeill did write a reply in the\nJournal Litéraire\nwhich he intended as a defence of national honour. Although Keill and\nNewton\nseemed very friendly at this time it appeared that\nNewton\ngrew tired of Keill's stirring up trouble.\nNewton\nmade it up with\nJohann Bernoulli\nalthough Keill never did.\nAn account of the\nNewton\n-\nLeibnitz\ndispute by\nCharles Bossut\nis at\nTHIS LINK\n.\nIn\n1717\nKeill married Mary Clements. However\n[\n2\n]\n:-\n... his choice of wife was regarded as something of a scandal - Mary Clements was held to be of very inferior rank, being the daughter of James Clements, an Oxford bookbinder. Perhaps the attraction for Keill was the fact that she was twenty-five years younger. They had a son who became a linen draper in London ...\nKeill's work\nEuclides elementorum libri priores sex\nⓉ\n(\nThe first six books of Euclid's 'Elements'\n)\npublished in\n1715\nstudies trigonometry and logarithms. He also wrote on forces between particles and on theories of the origin of the universe. He wrote up more of his lectures in\nIntroductio ad veram\nⓉ\n(\nIntroduction to truth\n)\n(\npublished in Leiden in\n1725)\n. In these he wrote:-\nThe only true philosophers are those who would account for all effects and phenomena by the known established laws of motion and mechanics.\nTwo years before he died, Keill was left a fortune on the death of his brother James. He died at his home of a severe fever and was buried at St Mary's Church, Oxford.",
  "matematicos_citados_na_biografia": [
    "David Gregory",
    "Newton",
    "Royal Society",
    "Whiston",
    "Leibniz",
    "Fabri",
    "Cavalieri",
    "Johann Bernoulli",
    "Leibnitz",
    "Charles Bossut",
    "THIS LINK"
  ],
  "imagens": []
}