{
  "nome_completo": "John Robert Ringrose",
  "nome_curto": "John Ringrose",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ringrose/",
  "data_nascimento": "21 December 1932",
  "local_nascimento": "Edmonton, London, England",
  "data_morte": null,
  "local_morte": null,
  "summary": "John Ringrose is an English mathematician who is a leading world expert on non-self-adjoint operators and operator algebras.",
  "biografia": "John Ringrose\nwas educated at Buckhurst Hill County High School in Chigwell in the Epping Forest district of Essex, England. The school is on the northeastern perimeter of the metropolitan area of London. After leaving the school, Ringrose entered St John's College, Cambridge and he received an M.A., then later a Ph.D. from Cambridge in\n1957\n.\nAfter completing his Ph.D., Ringrose was appointed a lecturer in mathematics at King's College of the University of Newcastle-upon-Tyne in\n1957\n. He remained in Newcastle until\n1961\nwhen he returned to Cambridge as a lecturer in mathematics. He was also elected a fellow of his old College, St John's College, Cambridge. He remained at Cambridge for two years then, in\n1963\n, Ringrose returned to Newcastle where he was appointed a senior lecturer in mathematics.\nIn\n1964\nhe was appointed to the chair of Pure Mathematics at the University of Newcastle-upon-Tyne and he held this post until he retired in\n1993\n. On his retiral he became professor emeritus at Newcastle. He also served as Pro-Vice-Chancellor at the University of Newcastle-upon-Tyne from\n1983\nuntil\n1988\n.\nRingrose is a leading world expert on non-self-adjoint operators and operator algebras. He has written on operators of\nVolterra\n-type, compact linear operators, the Neumann series of integral operators, algebras of operators, automorphisms and derivations of operator algebras, and the\ncohomology\nof operator algebras.\nHe has written a number of influential texts including\nCompact non-self-adjoint operators\n(1971)\nand, with\nR V Kadison\n,\nFundamentals of the theory of operator algebras\nin four volumes published in\n1983\n,\n1986\n,\n1991\nand\n1992\n. The first of these volumes is an elementary approach to the theory of\nC\n∗\nC^{*}\nC\n∗\n-algebras and von Neumann algebras. The authors state in the preface that their:-\n... primary goal is to teach the subject and lead the reader to the point where the vast recent literature, both in the subject proper and in its many applications, becomes accessible.\nThe second volume treats advanced topics which Ringrose and\nKadison\nconsider to be fundamental for an understanding of current research in operator algebras. R S Doran, a reviewer of the text, writes that:-\nThe book\n[\nis\n]\nwritten by two eminent mathematicians each of whom has made major contributions to the theory of operator algebras.\nHe concludes the review saying that:-\n...the authors have presented\n[\nthe material\n]\nin a fresh and attractive way which conveys the spirit and beauty of the subject. They are to be commended for writing a beautiful book which, in the reviewer's opinion, fulfills all of the promises made in the preface.\nThese two volumes contain an outstanding collection of exercises which in many cases lead the reader to prove some further major results by skillfully breaking them down into manageable parts. The third and fourth volumes contain the solutions to the exercises. R S Doran says the authors' solutions:-\n... which were developed from scratch specifically for this volume, are models of clarity and efficiency, reflecting their vast experience and insight into the subject.\nThe\nRoyal Society of London\nelected Ringrose as a fellow in\n1977\nand he has also been elected a fellow of the Royal Society of Edinburgh. He has served the\nLondon Mathematical Society\nin many different ways including holding the position of president of the Society from\n1992\nto\n1994\n.",
  "matematicos_citados_na_biografia": [
    "Volterra",
    "cohomology",
    "R V Kadison",
    "Kadison",
    "Royal Society of London",
    "London Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}