{
  "nome_completo": "John Joseph O'Connor",
  "nome_curto": "John O'Connor",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/OConnor/",
  "data_nascimento": "31 July 1945",
  "local_nascimento": "Luton, Bedfordshire, England",
  "data_morte": null,
  "local_morte": null,
  "summary": "John O'Connor is an English-born mathematician best known as one of the creators of the MacTutor History of Mathematics archive.",
  "biografia": "John O'Connor\n's father was Wilfred O'Connor\n(1908\n-\n1985)\nwho was born in Lincoln, England. His mother was Kathleen Meehan\n(1907\n-\n1979)\nfrom Tulla, County Clare, Ireland. Wilfred was apprenticed to a chemist and druggist in Lincoln and after passing the exams of the Pharmaceutical Society of Great Britain\n[\n17\n]\nhe qualified as a pharmacist. He took a partnership with a chemist and druggist in Luton, Bedfordshire and eventually took over this business. He also passed the examinations of the Worshipful Company of Spectacle Makers\n[\n23\n]\nso he could practise as an optician. He carried on working as a pharmacist until\n1978\n. Kathleen Meehan came to Luton from Ireland in about\n1930\nto join other members of her family who were already in England. She worked as a secretary at the SKEFCO ball-bearing factory in Luton. Wilfred and Kathleen married in\n1942\n. They had three sons: John, the subject of this biography\n(\nborn\n1945)\n, Denis\n(\nborn\n1947)\nand Hugh\n(\nborn\n1950)\n.\nO'Connor grew up in Stopsley, which is a suburb on the Northern edge of Luton. He went to primary school in Stopsley and from the age of eight went to St Michael's College in Hitchin, Hertfordshire, which was about six miles away. St Michael's was a Roman Catholic School which was run by a French-based teaching order.\n[\n21\n]\nIt served as the Catholic secondary school for a wide catchment area in both Bedfordshire and Hertfordshire. It was about a\n20\nminute bus journey from Stopsley. O'Connor was lucky that when he was in the fifth form\n(\naged about\n15)\nthe priest who had been his mathematics teacher was replaced by an Irishman called Mr McHugh who was on the verge of retirement. He was an eccentric enthusiast, one of whose tricks was to stand with is back to the blackboard and, without looking, draw a perfect chalk circle. McHugh encouraged O'Connor to press ahead of the rest of the class and introduced him to calculus. From then on O'Connor was mainly interested in following mathematics rather than his other subjects.\nIn\n1963\nhe won an open scholarship to Oxford to study mathematics. In the nine months between leaving school and taking up his place at university he worked in the National Chemical Laboratory in Teddington, London\n(\npart of the\nNational Physical Laboratory\nsite\n)\n. He worked with a group who measured specific heats of chemical substances from absolute zero up to room temperature.\n[\n4\n]\nHis job mainly involved doing calculations on electric desk-calculating machines and in preparing data to be submitted to the valve-operated computer DEUCE which was still being used at the NPL site. This sparked a continuing interest in computers.\nHe started at St Catherine's College, Oxford\n[\n20\n]\nin\n1964\n. This was a newly opened college in striking new buildings designed by the Danish architect Arne Jacobson. Building work was still going on when O'Connor joined the college. He was tutored by John N Crossley\n(\nborn\n1937)\n, Alan B Tayler\n(1931\n-\n1995)\n, Graeme Segal\n(\nborn\n1941)\n, John Ockendon\n(\nborn\n1940)\nand briefly by\nTerry Wall\n. In his final year he became interested in algebraic topology and attended lectures by Brian Steer. He did well enough as an undergraduate to be allowed to stay on to do his doctorate. He was supervised by Graeme Segal, and for part of a year by Wilson Sutherland\n(1935\n-\n2019)\n. His thesis title was\nStable Equivariant Homotopy Theory\nand he showed how the equivariant analogue of the stable homotopy of spheres could be reduced to a cobordism problem.\nIn\n1969\nO'Connor married Jean Cridland\n(1941\n-\n2019)\nfrom Philadelphia, USA, whom he had originally met in France when she was on her way back from teaching English in Turkey with the US Peace Corps. She was a graduate of the University of Pennsylvania and Columbia and was a teacher of French and Spanish. They had four children: Paul\n(\nborn\n1973)\n, Elspeth\n(\nborn\n1976)\n, Helen\n(\nborn\n1978)\nand James\n(\nborn\n1980)\n.\nIn\n1970\nO'Connor was appointed a lecturer in the Pure Mathematics Department of the University of St Andrews at the same time that\nJohn Howie\ntook over from\nEdward Copson\nas the Regius professor of mathematics. St Andrews only had about\n3000\nstudents at that time and O'Connor was give the freedom to lecture on a variety of advanced topics to small but talented groups of honours students as well as learning how to teach larger groups of younger undergraduates. His interests moved away from topology and more towards the area of computational algebra.\nIn\n1988\nan initiative in teaching mathematics on computers was started. With the assistance of\nEdmund Robertson\nand other colleagues O'Connor developed a system of computer learning christened MacTutor\n(\nbecause it was implemented on Apple Macintosh computers\n)\n. As well as containing the usual facilities for plotting functions, sitting quizzes, etc. it included some ingenious ideas for exploring different areas of mathematics. This system won various awards from sponsors as varied as British Nuclear Fuels and the US Department of Agriculture\n(\nthough in the latter case the money attached to the prize was not received when the Americans discovered that St Andrews was not in the USA\n)\n.\nIn\n1994\nthe MacTutor software was entered for the\nEuropean Academic Software Award\n. The part of the system which already contained large amounts of historical content was adapted to appear as a resource on the newly-developed World Wide Web. MacTutor won the\n1994\nEASA and one of the things which most impressed the judges in Heidelberg -- as well as the other mathematicians competing for the prize -- was this historical material on the Web. At that time there was little other such material available on the Web and so O'Connor and\nRobertson\nwere encouraged to expand it further.\nFor more information about the beginnings of MacTutor, see\nTHIS LINK\n.\nLet us give some quotes from articles about MacTutor. The Merlot review in\n2002\nstates\n[\n10\n]\n:-\nThis site is a rich and growing source of materials pertaining to the history of mathematics including biographies of mathematicians, mathematics in various cultures, time lines, famous curves\n(\nwith Java interactivity\n)\n, overview of math history, in-depth coverage of a large number of history topics, and more. Individual pages contain many cross-links and material is well written and useful for both casual and experienced users.\nBarnabas Hughes writes in\n2007\n[\n8\n]\n:-\nJohn J O'Connor and\nEdmund F Robertson\nof the School of Mathematics and Statistics at the University of St Andrews deserve the thanks of every teacher of mathematics who wishes to interest oneself or one's students in the history of mathematics.\nTony Mann writes in\n2011\n[\n15\n]\n:-\nMention must be made of the outstanding Web resource on the history of mathematics, the MacTutor archive, created and maintained by two mathematicians, John J O'Connor and\nEdmund F Robertson\n, at the University of St Andrews. This currently includes\n2\n,\n118\nbiographies and over\n4\n,\n000\npictures of mathematicians. It records about\n2\nmillion file accesses each week, which reflects its use worldwide. Such a reach must have been unimaginable when MacTutor was first conceived. There is no doubt that much of the work now taking place in the history of mathematics would be impossible without this archive: the use of history of mathematics in education, at the school and the undergraduate level, is so greatly facilitated by MacTutor that I believe the growth in interest in history in mathematics education could not have occurred without the archive.\nDaniel Ashlock writes in\n2020\n[\n1\n]\n:-\n... mathematics is the passport to a larger, richer world. The archive of mathematical biographies can make this real for students who have not yet mastered their first deeper mathematics. If you are a teacher, the MacTutor archive is a wonderful resource for enriching a maths class, for final written projects, and to give students a sense of the reach and scope of mathematics. You can simply have the students browse the archives, or you can use it to create ten-minute segments for class about interesting people.\nThe MacTutor history archive has won a number of awards including the\nHirst\nPrize of the\nLondon Mathematical Society\nin\n2015\n.\nA list of some of the awards won by the MacTutor archive is at\nTHIS LINK\n.\nFor more information about the award of the\nHirst\nPrize to  O'Connor and\nRobertson\n, see\nTHIS LINK\nO'Connor became a Senior Lecturer in\n1992\nand retired from teaching in\n2010\n. He and\nRobertson\ncontinue their work on MacTutor. In\n2020\n, following the unease of the university authorities that MacTutor could be vulnerable to interference from outside, O'Connor cooperated with David J Ferguson, a talented computer science undergraduate working on a summer project, to transfer MacTutor to a more secure platform using a system called\nLektor\n.",
  "matematicos_citados_na_biografia": [
    "National Physical Laboratory",
    "Terry Wall",
    "John Howie",
    "Edward Copson",
    "Edmund Robertson",
    "Robertson",
    "THIS LINK",
    "Edmund F Robertson",
    "Hirst",
    "London Mathematical Society"
  ],
  "imagens": [
    "oconnor.jpg"
  ]
}