{
  "nome_completo": "John Wallis",
  "nome_curto": "John Wallis",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wallis/",
  "data_nascimento": "23 November 1616",
  "local_nascimento": "Ashford, Kent, England",
  "data_morte": "28 October 1703",
  "local_morte": "Oxford, England",
  "summary": "John Wallis was an English mathematician who built on Cavalieri's method of indivisibles to devise a method of interpolation. Using Kepler's concept of continuity he discovered methods to evaluate integrals.",
  "biografia": "John Wallis\n's father was the Reverend John Wallis who had become a minister in Ashford in\n1602\n. He was a highly respected man known widely in the area. The Reverend Wallis married Joanna Chapman, who was his second wife, in\n1612\nand John was the third of their five children. When young John was about six years old his father died.\nJohn went to school in Ashford but an outbreak of the plague in the area led to his mother to decide that it would be best for him to move away. He went to James Movat's grammar school in Tenterden, Kent, in\n1625\nwhere he first showed his great potential as a scholar. Writing in his autobiography, Wallis comments\n[\n28\n]\n:-\nIt was always my affection, even from a child, not only to learn by rote, but to know the grounds or reasons of what I learnt; to inform my judgement as well as to furnish my memory.\nIn\n1630\n, still only\n13\nyears of age, he considered himself ready for university\n[\n28\n]\n:-\nI was as ripe for university as some that have been sent thither.\nHowever he spent\n1631\n-\n32\nat Martin Holbeach's school in Felsted, Essex, where he became proficient in Latin, Greek and Hebrew. He also studied logic at this school but mathematics was not considered important in the best schools of the time, so Wallis did not come in contact with that topic at school. It was during the\n1631\nChristmas holidays that Wallis first came in contact with mathematics when his brother taught him the rules of arithmetic. Wallis found that mathematics\n[\n28\n]\n:-\n... suited my humour so well that I did thenceforth prosecute it, not as a formal study, but as a pleasing diversion at spare hours ...\nThe mathematics books he read were those he came on by chance:-\nFor I had none to direct me what books to read, or what to seek, or in what method to proceed. For mathematics, at that time with us, were scarce looked on as academical studies, but rather mechanical - as the business of traders, merchants, seamen, carpenters, surveyors of lands and the like.\nFrom school in Felsted he went to Emmanual College Cambridge, entering around Christmas\n1632\n. He took the standard bachelor of arts degree and, since nobody at Cambridge at this time could direct his mathematical studies, he took a range of topics such as ethics, metaphysics, geography, astronomy, medicine and anatomy. Although never intending to follow a career in medicine, he defended his teacher Francis Glisson's revolutionary theory of the circulation of the blood in a public debate, being the first person to do so.\nIn\n1637\nWallis received his BA and continued his studies receiving his Master's Degree in\n1640\n. In the same year he was ordained by the bishop of Winchester and appointed chaplain to Sir Richard Darley at Butterworth in Yorkshire. Between\n1642\nand\n1644\nhe was chaplain at Hedingham, Essex and in London. It was during this time that the first of two events which shaped Wallis's future took place:-\n... one evening at supper, a letter in cipher was brought in, relating to the capture of Chichester on\n27\nDecember\n1642\n, which Wallis in two hours succeeded in deciphering. The feat made his fortune. He became an adept in the cryptologic art, until then almost unknown, and exercised it on behalf of the parliamentary party.\nThis was the time of the Civil War between the Royalists and Parliamentarians and Wallis used his skills in cryptography in decoding Royalist messages for the Parliamentarians. Because of his efforts on behalf of the Parliamentarians he was given charge of the church of St Gabriel in Fenchurch Street, London in\n1643\n. In this same year his mother died and this left Wallis as a man of independent means since he inherited a major estate in Kent.\nIn\n1644\nWallis became secretary to the clergy at Westminster and through this he was given a fellowship at Queen's College, Cambridge. His study of divinity there did not last long since he married Susanna Glyde on\n14\nMarch\n1645\n, so was no longer able to hold the fellowship\n(\nfellows could not be married\n)\n. He returned to London where he began to meet weekly with a group of scientists interested in natural and experimental science. This enthusiastic group would eventually become the\nRoyal Society\nof London, but even at this early stage they evolved strict rules. Wallis wrote:-\n[\nWe\n]\nmet weekly,\n(\nsometimes at Dr Goddard's lodgings, sometimes at the Mitre in Wood Street near-by\n)\nat a certain hour, under a certain penalty, and a weekly contribution for the charge of experiments, with certain rules agreed among us. There, to avoid being diverted to other discourses and for some other reasons, we barred all discussion of Divinity, of State Affairs, and of news\n(\nother than what concerned our business of philosophy\n)\nconfining ourselves to philosophical inquiries, and related topics; as medicine, anatomy, geometry, astronomy, navigation, statics, mechanics, and natural experiments.\nIn this passage we have modernised Wallis's English a little to make it more easily understood.\nWe talked above about two events which shaped Wallis's future, the first being cryptography. The second, closely associated with the beginnings of the\nRoyal Society\nand almost certainly arising from those meetings, was that he read\nOughtred\n's\nClavis Mathematicae\nin\n1647\n. Quickly his love of mathematics, which he had as a student but which had never found the opportunity to flourish, now came pouring out. He writes in his autobiography that he mastered\nOughtred\n's book in a couple of weeks and went on to produce mathematics of his own.\nWallis wrote a book\nTreatise of Angular Sections\nwhich remained unpublished for forty years. He also discovered methods of solving equations of degree four which were similar to those which\nHarriot\nhad found but Wallis claimed that he made the discoveries himself, not being aware of\nHarriot\n's contributions until later.\nHe was appointed to the Savilian Chair of geometry at Oxford in\n1649\nby Cromwell mainly because of his support for the Parliamentarians. Certainly the previous holder of the chair, Peter Turner, was dismissed for his Royalist views. Cromwell held Wallis in high regard, not just for his political views but also for his scholarship. Wallis held the Savilian Chair for over\n50\nyears until his death and, even if he was appointed for the wrong reasons, he most certainly deserved to hold the chair.\nThis was not the only position which Wallis would hold at Oxford. In\n1657\nhe was appointed as keeper of the University archives. There was considerable controversy over his election to this post. Aubrey wrote in his\nLives of Eminent Men:-\nIn\n1657\nhe got himself chosen\n(\nby unjust means\n)\nto the Custos Archivorum of the University of Oxford ... Now, for the Savilian Professor to hold another place besides, is so downright against Sir Henry\nSavile\n's Statutes that nothing can be imagined more, and if he does he is downright perjured. Yet the Dr is allowed to keep the other place still.\nCertainly Wallis's opponents believed that he became keeper of the University archives because of his support for Cromwell. Even if this were the case, as with the Savilian Chair, Wallis carried out his duties extremely well and fully deserved the post.\nAlthough Wallis was a Parliamentarian he certainly spoke out against the execution of Charles I and, in\n1648\n, had signed a document opposing the execution. This was done in good faith for although Wallis used his undoubted political skills to gain what wanted at times, there was never any suggestion that he was anything other than an honest man. Wallis, however, gained by signing the petition against the King's execution for, in\n1660\nwhen the monarchy was restored and Charles II came to the throne, Wallis had his appointment in the Savilian Chair confirmed by the King. Charles II went even further for he appointed Wallis as a royal chaplain and, in\n1661\n, nominated him as a member of a committee set up to revise the prayer book.\nWallis contributed substantially to the origins of calculus and was the most influential English mathematician before\nNewton\n. He studied the works of\nKepler\n,\nCavalieri\n,\nRoberval\n,\nTorricelli\nand\nDescartes\n, and then introduced ideas of the calculus going beyond that of these authors.\nWallis's most famous work was\nArithmetica infinitorum\nwhich he published in\n1656\n. In this work Wallis established the formula\n1\n2\nπ\n=\n2.2.4.4.6.6.8.8.10...\n1.3.3.5.5.7.7.9.9...\n\\large\\frac{1}{2}\\normalsize \\pi = \\large\\frac{2.2.4.4.6.6.8.8.10...}{1.3.3.5.5.7.7.9.9...}\\normalsize\n2\n1\n​\nπ\n=\n1\n.\n3\n.\n3\n.\n5\n.\n5\n.\n7\n.\n7\n.\n9\n.\n9\n.\n.\n.\n2\n.\n2\n.\n4\n.\n4\n.\n6\n.\n6\n.\n8\n.\n8\n.\n1\n0\n.\n.\n.\n​\nwhich\nHuygens\nrefused to believe until he was shown that it led to numerically correct approximations to π. Wallis discovered this result when he was attempting to compute the integral of\n(\n1\n−\nx\n2\n)\n1\n2\n(1 - x^{2})^{{1\\over2}}\n(\n1\n−\nx\n2\n)\n2\n1\n​\nfrom\n0\nto\n1\nand hence to find the area of a circle of unit radius. He solved the problem of integrating\n(\n1\n−\nx\n2\n)\nn\n(1 - x^{2})^{n}\n(\n1\n−\nx\n2\n)\nn\nfor integer powers of\nn\nn\nn\n, building on\nCavalieri\n's method of indivisibles, but, unable to deal with fractional powers, he used interpolation, a word which he introduced in this work. His interpolation used\nKepler\n's concept of continuity, and with it he discovered methods to evaluate integrals which were later used by\nNewton\nin his work on the binomial theorem.\nNewton\nwrote:-\nAbout the beginning of my mathematical studies, as soon as the works of our celebrated countryman, Dr Wallis, fell into my hands, by considering the Series, by the Intercalation of which, he exhibits the Area of the Circle and the Hyperbola....\nIn his\nTract on Conic Sections\n(1655)\nWallis described the curves that are obtained as cross sections by cutting a cone with a plane as properties of algebraic coordinates:-\n... without the embranglings of the cone.\nIn the Introduction he declared that it was\n[\n31\n]\n:-\n... no more necessary ... to regard the parabola as a section of a cone by a plane parallel to a generator than to regard a circle as a section of a cone by a plane parallel to the base, or even a triangle as a plane through the vertex.\nWallis developed methods in the style of\nDescartes\nanalytical treatment and he was the first English mathematician to use these new techniques. This work is also famed for the first use of the symbol ∞ which was chosen by Wallis to represent a curve which one could traced out infinitely many times. He used the symbol again in the more influential work\nArithmetica infinitorum\nwhich was published a few months later.\nWallis was also an important early historian of mathematics and in his\nTreatise on Algebra\nhe gives a wealth of valuable historical material. However the most important feature of this work, which appeared in\n1685\n, is that it brought to mathematicians the work of\nHarriot\nin a clear exposition, presented for the first time by someone who really understood the significance of his contributions.\nIn\nTreatise on Algebra\nWallis accepts negative roots and complex roots. He shows that\na\n3\n−\n7\na\n=\n6\na^{3} - 7a = 6\na\n3\n−\n7\na\n=\n6\nhas exactly three roots and that they are all real. He also criticises\nDescartes\n' Rule of Signs stating, quite correctly, that the rule which determines the number of positive and the number of negative roots by inspection, is only valid if all the roots of the equation are real. One highly controversial section in this work is one in which Wallis claims that\nDescartes\n' knowledge of algebra was gained directly from\nHarriot\n. Wallis received criticism for these claims immediately the book was published, but the subject is still of interest to historians of mathematics today. The claims made by Wallis on this topic have never been shown false to everyone's complete satisfaction. There is just a hint that there could be some truth in his claims which keeps the discussion alive.\nWallis made other contributions to the history of mathematics by restoring some ancient Greek texts such as\nPtolemy\n's\nHarmonics\n,\nAristarchus\n's\nOn the magnitudes and distances of the sun and moon\nand\nArchimedes\n'\nSand-reckoner\n.\nHis non-mathematical works include many religious works, a book on etymology and grammar\nGrammatica linguae Anglicanae\n(\nOxford,\n1653)\nand a logic book\nInstitutio logicae\n(\nOxford,\n1687)\n.\nWallis became involved in a bitter dispute with\nHobbes\n, who although a fine scholar, was far below Wallis's class as a mathematician. In\n1655\nHobbes\nclaimed to have discovered a method to square the circle. Wallis's book\nArithmetica infinitorum\nwith his methods was in press at the time and he refuted\nHobbes\nclaims.\nHobbes\nreplied to the:-\n... insolent, injurious, clownish language ...\nof Wallis with the pamphlet\nSix lessons to the Professors of Mathematics at the Institute of Sir Henry Savile\n. Wallis replied with the pamphlet\nDue Correction for Mr Hobbes, or School Discipline for not saying his Lessons Aright\nto which\nHobbes\nwrote the pamphlet\nThe Marks of the Absurd Geometry, Rural Language etc. of Doctor Wallis\n.\nAfter a period when the controversy seemed to have ended,\nHobbes\nopen up the argument again with a new work. In the Preface he wrote:-\nOf those who with me have written something about these matters, either I alone am mad, or I alone am not mad. No third option can be maintained, unless\n(\nas perchance it may seem to some\n)\nwas are all mad.\nWallis replied:-\nIf he is mad, he is not likely to be convinced by reason; on the other hand, if we be mad, we are in no position to attempt it.\nThe dispute continued for over\n20\nyears, becoming extended to include\nBoyle\n, and ending only with\nHobbes\n's death.\nOne aspect of Wallis's mathematical skills has not yet been mentioned, namely his great ability to do mental calculations. He slept badly and often did mental calculations as he lay awake in his bed. One night he calculated the square root of a number with\n53\ndigits in his head. In the morning he dictated the\n27\ndigit square root of the number, still entirely from memory. It was a feat which was rightly considered remarkable, and Oldenburg, the Secretary of the\nRoyal Society\n, sent a colleague to investigate how Wallis did it. It was considered important enough to merit discussion in the\nPhilosophical Transactions of the Royal Society\nof\n1685\n.\nHearne, writing of Wallis in\n1885\n, described him as follows:-\n... he was a man of most admirable fine parts, and great industry, whereby in some years he became so noted for his profound skill in mathematics that he was deservedly accounted the greatest person in that profession of any in his time. He was withal a good divine, and no mean critic in the Greek and Latin tongues.",
  "matematicos_citados_na_biografia": [
    "Royal Society",
    "Oughtred",
    "Harriot",
    "Savile",
    "Newton",
    "Kepler",
    "Cavalieri",
    "Roberval",
    "Torricelli",
    "Descartes",
    "Huygens",
    "Ptolemy",
    "Aristarchus",
    "Archimedes",
    "Hobbes",
    "Boyle"
  ],
  "imagens": [
    "wallis.jpg"
  ]
}