{
  "nome_completo": "John Turner",
  "nome_curto": "John Turner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Turner_John/",
  "data_nascimento": "23 June 1871",
  "local_nascimento": "Bridge-of-Weir, Kilbarchan (near Paisley), Scotland",
  "data_morte": "possibly 1948",
  "local_morte": "Newington, Edinburgh, Scotland",
  "summary": "John Turner graduated from the university of Edinburgh and taught at the Royal High School of Edinburgh.",
  "biografia": "John Turner\n's parents were Archibald Turner\n(\nborn in Lochwinnoch, Renfrewshire about\n1831)\nwho was a 'tenter' and Janet Cameron. The\n1881\ncensus, taken when John Turner was ten years old, describes his father as a mill worker. John Turner is the youngest of the family having older siblings: Duncan\n(\nborn about\n1856\nand a student of theology\n)\n, Thomas\n(\nborn about\n1858\nand a railway clerk\n)\n, Jeanie\n(\nborn about\n1860)\n, William\n(\nborn about\n1866\nand an apprentice moulder\n)\nand Robert\n(\nborn about\n1869\nand an apprentice grocer\n)\n.\nJohn Turner entered Bridge of Weir Public School in\n1877\n, when he was six years old, and after two years moved to Paisley Public School. He spent three years at this school before moving in\n1882\nto Lauder Public School.\nTurner first matriculated at the University of Edinburgh in October\n1886\nwhen he was fifteen years old. He graduated with an M.A. in\n1891\n, then a B.Sc.\n(\nMath\n)\nin the following year. He took up the position of Assistant Mathematical Master at The Edinburgh High School in session\n1892\n-\n93\n. John Marshall, M.A. Oxon., LL.D. Edin., a classics scholar, was Rector of The Edinburgh High School when Turner was appointed. His School Rector's Report for session\n1892\n-\n93\nexplains why the School appointed Turner:-\nAnother important addition to the Staff has been Mr John Turner, M.A., who entered at the beginning of the Session on his duties as Assistant Mathematical Master. It has always been found somewhat difficult to classify the Mathematical pupils of a school in which languages form the main basis of classification in such a manner as to prevent boys of unequal mathematical attainments being classes together. It is with a view to enabling Mr Smith\n[\nE Johnston Smith, M.A. was Principal teacher of Mathematics and Arithmetic\n]\nto form suitable subdivisions of the Mathematical Classes that Mr Turner is now associated with him in the Mathematical Teaching. The experience of this first year of the new arrangements leads me to hope that before long a very considerable higher level of mathematical attainments may be looked for in the school. Mr Turner's work throughout the Session has been most successful.\nIn November\n1894\n, Turner joined the\nEdinburgh Mathematical Society\n. By this time he was a mathematics master at the Royal High School, Edinburgh. Turner was a very active member of the Society. He was Editor of the\nProceedings\nof the\nEdinburgh Mathematical Society\nfrom\n1904\n, then was Honorary Treasurer of the Society from\n1905\nto\n1909\n. Following this period of service to the Society he was honoured by being elected as President for session\n1910\n-\n11\n. As President, he chaired the meeting of the Society on Friday\n10\nNovember which was a solemn occasion when he read a tribute to Professor\nChrystal\nto the meeting.\nChrystal\nhad died a week earlier.\nTurner carried out administrative duties for the Society over many years but he also contributed to the academic work of the Society. For example he contributed the paper\nOn the teaching of geometry\nto the meeting of the Society on Friday\n8\nDecember\n1905\n. He remained a member of the Society throughout his career. After he retired in\n1933\n, he remained a member, giving his address as\n110\nFindhorn Place, Edinburgh,\n9\n. He reached the positions of Depute Rector and Principal Teacher of Mathematics at the Royal High School, Edinburgh, before he retired. W King Gillies, M.A., B.A.\n(\nOxon.\n)\n, LL.D., F.R.S.E., a classics scholar, was Rector of the Edinburgh Royal High School during the last thirteen years the Turner taught there. In his School Report for session\n1932\n-\n33\n, the Rector writes:-\nAt Easter Mr John Turner, Deputy Rector and Principal Teacher of Mathematics, retired after forty years' service, and the best memorial of his work is the unbroken series of success gained by his pupils in Mathematics, and their abiding gratitude.\nWhen Turner retired in April\n1933\n, a lunch was held to mark the occasion\n[\n4\n]\n:-\nThe Retiral of Mr Turner\nOn Friday,\n7\nth\nApril, the Staff met at lunch to say farewell to Mr Turner. The Rector presided, and, in addition to the whole Staff, there were present Miss Turner and Miss MacLaren.\nIn his speech the Rector\n[\nW King Gillies, M.A., B.A.\n(\nOxon.\n)\n, LL.D., F.R.S.E.\n]\nreferred to the esteem in which Mr Turner was held by his pupils, an esteem which was built on the sound foundation of good teaching. He mentioned his personal indebtedness to Mr Turner and, expressing his profound gratitude for thirteen years' assistance, said that Mr Turner's wise and dispassionate judgment on affairs had been a source of comfort and assurance. To all his colleagues Mr Turner had been a valued friend, the younger members of the Staff in particular finding in him a kind and considerate adviser. The Rector congratulated Mr Turner on entering on his retirement after such long and distinguished service, and expressed his pleasure in handing over to him a pair of field-glasses and several books as a token of affection and esteem from his colleagues, who might fairly claim to represent the High School Masters and Mistresses of the last forty years.\nMr Turner in reply said that the occasion marked the end of a long story, not very exciting, but pleasant, and might also be the beginning of another, perhaps shorter one, but one which, if good wishes counted, would be happy. Forty years ago he had found his career determined by force of circumstances, but he had never regretted that kindly fate had made him a teacher and had decreed work in the Royal High School. The profession of teaching had its drawbacks - the work was more strenuous than credit was given for - but whether teachers received honest abuse or doubtful compliments, there was no doubt that their work was useful, important, and well worth doing for its own sake. It was no small thing to belong to such a School as the High School. He had found that the School was unique in some puzzling way. Perhaps it was the beauty of the building. As the late Dr Marshall had said, \"I think it must be the spirit of the School, moulding by her gentle influence all her children, masters and boys, unto her own image.\" It would be a sad day if that gentle spirit were lost, driven away by neglect or indifference. To his colleagues his debt was a long one, and he wished to express his thanks for their kindness, not only for presenting him with such handsome gifts, but for so many years of forbearance and good fellowship. He often wondered how far good wishes helped to bring about their own fulfilment. He thought they did, and felt sure that the good wishes expressed that day would bring years of happiness to all.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Chrystal"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}