{
  "nome_completo": "John Edward Aloysius Steggall",
  "nome_curto": "John Steggall",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steggall/",
  "data_nascimento": "19 November 1855",
  "local_nascimento": "London, England",
  "data_morte": "26 November 1935",
  "local_morte": "Dundee, Scotland",
  "summary": "John Steggall was appointed to be the first Professor of Mathematics at the newly-formed University College Dundee: soon to become Queen's College and part of the University of St Andrews. He held this post for 50 years.",
  "biografia": "John Steggall\n's father was J W B Steggall M.R.C.S., a Member of the Royal College of Surgeons of England. John was educated in London and attended the City of London School. He entered Trinity College, Cambridge, in\n1874\nand there he studied the Mathematical Tripos. He graduated in\n1878\nas second\nWrangler\n(\nmeaning that he was ranked second in the list of those obtaining First Class degrees\n)\n. The Senior Wrangler in that year was\nErnest Hobson\nbut in the competition for the Smiths Prize it was Steggall who came out as the top candidate ahead of\nHobson\n.\nFor someone with this high level of attainment at Cambridge the natural next step would have been to have applied for a fellowship. Hobson won a fellowship but these were only open to those who did not marry and Steggall was about to marry Isabella Katherine Fraser of Rowmore House, Gareloch, near Helensburgh. They married in\n1878\n. In\n1890\nThe College, a Cambridge student magazine, contained the comment:-\n[\nSteggall\n]\ndid not proceed to the examination for the fellowship, having gone in for a fellowship of a more lasting kind. It is to be regretted for his sake that the regulations allowing married men to hold fellowships did not come into force until after his time.\nJohn and Isabella had three children, one son and two daughters. The son was killed in action in World War I.\nAfter graduating Steggall became an Assistant Master at Clifton College, Bristol. He held this position during\n1878\n-\n1879\nand then from\n1880\nhe was Fielden lecturer at Owens College, Manchester\n(\nthis later became the University of Manchester\n)\n.\nIn\n1881\nUniversity College, Dundee, was set up with Mary Ann Baxter as its principal benefactor. She required it to be for:-\n... promoting the education of persons of both sexes and the study of Science, Literature and the Fine Arts.\nIn many ways it was modelled on Owens College, Manchester and advice had been sought from Owens College. Steggall applied to become the first Principal of University College, Dundee. He failed to secure this position, but instead was offered the chair of Mathematics and Natural Philosophy. He accepted, and went to Dundee in\n1883\nto become the first professor of mathematics at the new College. In\n1895\nUniversity College decided that a separate department of physics was required and J P Keunen was appointed. Steggall then became Professor of Pure and Applied Mathematics, a title that he held until he chose to retire in\n1933\nhaving been a professor for\n50\nyears. Two years after he became Professor of Pure and Applied Mathematics, University College Dundee became part of the University of St Andrews and so from\n1897\non Steggall became an employee of the University of St Andrews.\nIt was while he was at Owens College, Manchester, that Steggall published\nLondon University Pure Mathematics Questions and Solutions\nwhich gave the University of London examination questions from\n1877\nto\n1881\ntogether with Steggall's solutions. It was a useful work, for when he went to University College, Dundee, for some years his students took the University of London external examinations since University College had no power to award degrees. In the Preface to the book he explained his reasons for writing it:-\nThe main object of this book is to afford help to those students who have to read mathematics for the BA and BSc degrees of the University of London without the aid of a private tutor.\nSteggall had little time for research when he arrived in Dundee. He taught his first class at\n8\na.m. every morning Monday to Saturday\n(\ninclusive\n)\n. On many days he taught his final lecture from\n9\np.m. to\n10\np.m. He had to give\n16\nhours of lectures per week, two tutorials, and\n(\nwith the help of one laboratory assistant\n)\nhad to supervise the laboratory which was open\n45\nhours per week. Of course on top of all this teaching he was responsible for setting and marking examinations, and for procuring equipment for the laboratory. It was due to the very heavy workload that eventually physics was split off to become a separate subject in\n1895\n.\nWilliam Peddie\nsaid of him:-\nThe generation of British mathematics to which Steggall belonged delighted in proposing and working out problems whose solutions might require the aid of any branch of pure or applied mathematics.\nHe was an enthusiastic member of the\nEdinburgh Mathematical Society\nwhich, by coincidence, was founded in the year that Steggall arrived in Scotland to take up his professorship in Dundee. Comments by\nMuir\nin his presidential address to the Society in\n1884\nsuggest that he resented the Englishman Steggall being appointed to a Scottish professorship but Steggall fitted in well with the work of the new Society and was elected its tenth president in\n1891\n-\n92\n. He was also president in\n1924\nand\n1929\n.\nTurnbull\nwas the only other who was President three times.\nSteggall ordered mathematical models from a German company in the early\n1900\ns to use in his teaching. His models are still owned by the University of Dundee. They include models of: a surface of rotation of the tractrix; a surface of rotation of\nSteiner\n's Roman surface, an ellipsoid; a helicoid; a hyperbolic paraboloid; a catenoid; a\nRiemann\nsurface with branch point of order two; a triply-connected\nRiemann\nsurface; a hyperbolic paraboloid; a torus; and a hyperboloid of revolution with ellipsoid cross-section.\nAlthough his teaching load was heavy, he did find time to write a few research papers. His research interests were in the theory of numbers and in kinematical geometry, particularly the geometry of the triangle. He also published articles on teaching mathematics such as the following examples which all appeared in the\nMathematical Gazette: On practical mathematics in schools\n(1914)\n;\nVoting in theory and practice\n(1929)\n; and\nThe neglect of arithmetic in schools\n(1935)\n. He gave lectures such as\nTeaching of Mathematics and Physics\nin\n1898\nin Glasgow;\nEducation and Machinery\nin\n1905\nto the Ruskin Society;\nA Pioneer in Hydraulics: Mark Beaufoy\nin\n1908\nto the Dundee Society of Engineers; and\nLectures on Astronomy\n.\nSteggall was an important influence on university life:-\nHe remained an exceptional examiner who maintained an alertness and freshness of outlook to the end. He was a central figure at the college in his time, participating in all aspects of University life. The college magazine was in great praise of his attendance at Student Society meetings and he was a popular Honorary President of the Society for some years. His position and sense of duty made him an important figure to the students.\nHilary Mason writes\n[\n3\n]\n:-\nSteggall in many ways is an outstanding example of the men of his time who believed passionately in reform and who sought to improve the lives of the poor by educational reform and by provision of better housing and medical care. Steggall was active in many areas: Dundee Social Union, Dundee School Board, and the Episcopal Church. He along with many others deserves to be remembered for his contribution to mathematics, not principally through any contribution of original work but through educational reform. Men like him made it possible for many of us to study when in the past universities would have been closed to us. They also made mathematics easier and more enjoyable to study.\nSteggall's many other interests included photography, woodwork and cycling. His enthusiasm as a cyclist can be realised by the fact that at the age of\n65\nhe rode his bicycle\n500\nmiles to a\nBritish Association\nmeeting in Cardiff. He was a member of the Scottish Arts Club and the Scottish Mountaineering Club.\nHis\ncollection of more than\n2000\nphotographs\ncan be seen at the University of St Andrews.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "Ernest Hobson",
    "Hobson",
    "William Peddie",
    "Edinburgh Mathematical Society",
    "Muir",
    "Turnbull",
    "Steiner",
    "Riemann",
    "British Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}