{
  "nome_completo": "John Jackson",
  "nome_curto": "John Jackson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jackson/",
  "data_nascimento": "11 February 1887",
  "local_nascimento": "Paisley, Renfrewshire, Scotland",
  "data_morte": "9 December 1958",
  "local_morte": "London, England",
  "summary": "John Jackson graduated from Glasgow and Cambridge. He went to the Royal Observatory at Greenwich but his career there was interrupted by World War I. He was then appointed HM Astronomer at the University of Cape Town.",
  "biografia": "John Jackson\n's father was  Matthew Jackson\n(\nborn Burnfoot, Ayrshire about\n1855)\nwho was an engine and machine iron turner. His mother was  Jeanie Millar\n(\nborn Lochwinnoch, Renfrewshire about\n1855)\n. He  had three older brothers, Andrew\n(\nborn about\n1878)\n, Matthew\n(\nborn about\n1880)\n, and Robert\n(\nborn about\n1883)\nwho became classics master at Paisley Grammar School. John Jackson also had an older sister Jeanie\n(\nborn about\n1885)\nand two younger siblings, Margaret\n(\nborn about\n1889)\nand William\n(\nborn about\n1892)\n.\nJohn Jackson's secondary school education was at Paisley Grammar School. At this stage he was not aiming at a university education so, although he took a broad range of science subjects and modern languages, he did not take Latin or Greek one of which was compulsory at this time to enter university. He completed his secondary education in\n1903\nwith chemistry being his best school subject. He now decided that he did want to enter university so spent the summer making good his lack of Latin so that he could sit the entrance examinations of the University of Glasgow. He was clearly successful since he was awarded a small bursary after taking the examinations.\nEntering the University of Glasgow, Jackson decided not to specialise in his best school subject of chemistry but instead studied mathematics and physics. He graduated in\n1907\nwith a B.A. with First Class Honours in Mathematics and Natural Philosophy\n(\nas physics was called at this time\n)\n. He continued to study a wide range of science subjects and was awarded a B.Sc. from Glasgow in\n1908\nwith special distinction in mathematics, natural philosophy, astronomy and chemistry. It was astronomy which become his main passion, through outstanding teaching by Ludwig Becker, during his final years at Glasgow and Jackson decided that he wanted to make a career in the subject. There was little chance to progress further in astronomy in Glasgow, so he decided to continue his studies at Cambridge.\nHe went to Trinity College, Cambridge in\n1909\nand there he was able to take courses on a wide range of subjects within astronomy, pure mathematics and applied mathematics. In\n1914\na vacancy arose at the Royal Observatory in Greenwich for a Junior Chief Assistant and the Astronomer Royal Sir Frank Dyson appointed Jackson to the post. His immediate superior was the Senior Chief Assistant, Spencer Jones. World War I was to force a break in his career, however, and in\n1917\nhe received a commission with the Royal Engineers and was sent to France. There he used his mathematical skills in sound ranging, then in the following year he was assigned to the British Fourth Army to carry out the task of plotting artillery trajectories. He continued in this role until\n1919\nwhen he was able to return to his post at the Observatory at Greenwich. His main interests at Greenwich were in double stars\n(\ncollaborating on this investigation with Herbert Hall Turner, the Savilian Professor of Astronomy at Oxford University\n)\n, meridian observations and the time service. He also worked on the rotation period of Neptune and was able to produce a figure much closer to the correct value than that accepted at the time. During his time at Greenwich he was promoted to Senior Chief Assistant.\nIn\n1933\nJackson was appointed His Majesty's Astronomer at Cape Observatory, Cape Town, South Africa. The position became vacant since the previous holder Harold Spencer Jones had returned to Greenwich to succeed Frank Dyson as the Astronomer Royal. Jackson, who went out to South Africa with his wife Mary Beatrice Marshall, also became Director of Cape Observatory, and he filled this position until he retired in\n1950\n. The authors of\n[\n1\n]\nwrite that:-\n... he was to suffer the staff disruption caused by years of war. In spite of this, his term of office was noted for its production of a mass of valuable work. Jackson's special concern was the stellar parallax programme; he undertook the necessary reductions and observations personally, at a time when two thirds of his staff were \"up north\". Jackson retired in\n1950\n, having measured the distances of over\n1600\nsouthern stars with greatly improved accuracy and having advanced or completed all the major projects which had been going on at the time of his appointment.\nThere was a total eclipse of the sun in South Africa on\n1\nOctober\n1940\n. Plans had been made to send a team from Greenwich to observe this but World War II prevented this from going ahead. Jackson was thus left in charge of the observations for this important event. Taking equipment sent out from London, Jackson headed a party from the Cape Observatory to the site chosen for observations.\nAfter he retired in\n1950\n, Jackson returned to England living in Ewell, Surrey. He received many honours for his contributions. These included a CBE in\n1950\n, the Royal Medal from the\nRoyal Astronomical Society\nin\n1952\nand the Gill Medal of the Astronomical Society of South Africa in\n1958\n. He was president of the\nRoyal Astronomical Society\nfrom\n1953\nto\n1955\nand during this time he went to Stromatad in Sweden to observe the total eclipse of the sun on\n30\nJune\n1954\n. During the last few years of his life he suffered from ill health and died following a short illness.",
  "matematicos_citados_na_biografia": [
    "Royal Astronomical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}