{
  "nome_completo": "John Carr",
  "nome_curto": "John Carr",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carr/",
  "data_nascimento": "29 August 1948",
  "local_nascimento": "East Heddon, Northumberland, England",
  "data_morte": "14 July 2016",
  "local_morte": "Edinburgh, Scotland",
  "summary": "Jack Carr was a Scottish mathematician who worked in differential equations and dynamical systems.",
  "biografia": "John Carr\nwas known to all as\nJack Carr\n. He was born into a farming family at Birds Hill Farm in East Heddon, Northumberland. East Heddon is situated in the north east of England about\n15\nkm west of Newcastle-upon-Tyne. Jack had two older brothers and the three boys had to join with their parents in helping to run the farm. While he was still a schoolboy, the family moved to Ryton, County Durham, but after arriving there Jack's schooling was interrupted when he had an illness that meant he missed a year at school. With no thought of a university education, he left school at the age of fifteen and was employed as a telephone engineer with the General Post Office\n(\nGPO\n)\nwhich at that time ran the whole of the British telephone system.\nIn addition to his day job with the Post Office, Carr studied at night school. He also was able to study mathematics from books that he borrowed from the local library and the more he studied the more his love for mathematics grew. Realising that their telephone engineer was a very talented young man, the Post Office offered him financial support to study mathematics at university. Carr took up the offer and studied mathematics at the University of Bath. It was a very new university when Carr began his studies there having only received university status in\n1966\nand many buildings were under construction on its new campus on the hill of Claverton Down outside Bath. However, it had been an educational establishment for over\n100\nyears before that although, prior to\n1964\n, it had been sited in Bristol. Carr graduated in\n1971\nwith a first class honours degree in mathematics and his performance had been so good that he was offered a place at the University of Oxford to study for a Master's Degree. At Oxford his performance was excellent and, after the award of an M.Sc., he undertook research for his D.Phil. advised by\nBryce McLeod\n. He was awarded a D.Phil. in\n1974\nfor his thesis\nThe Asymptotic Behaviour of the Solutions of Some Linear Functional Differential Equations.\nJanet Dyson was studying for a D.Phil. at the University of Oxford at the same time as Carr and her thesis was on a similar topic to that of Carr, namely\nSome topics in functional differential equations\n(1973)\n. Carr and Dyson published three joint papers in\n1974\n-\n1975\n, one being in the proceedings of the conference\nOrdinary and partial differential equations\nheld at the University of Dundee, Scotland, in\n1974\nand the other two in the\nProceedings\nof the\nRoyal Society of Edinburgh\n. While at Oxford, Carr met Teresa; they later married and had three children, Sam, Nancy and Emily.\nIn\n1974\nCarr was appointed as a lecturer in mathematics at Heriot-Watt University in Edinburgh, Scotland. He spent the rest of his career at Heriot-Watt University where he was promoted to professor in\n1982\nand was head of the mathematics department from\n1992\nto\n1996\n.\nIn\n1981\nCarr published the book\nApplications of centre manifold theory.\nHe wrote the following description of its contents:-\nThese notes are based on a series of lectures given in the Lefschetz Center for\nDynamical Systems\nin the Division of Applied Mathematics at Brown University during the academic year\n1978\n-\n79\n. The purpose of the lectures was to give an introduction to the applications of centre manifold theory to differential equations. Most of the material is presented in an informal fashion, by means of worked examples in the hope that this clarifies the use of centre manifold theory. The main application of centre manifold theory given in these notes is to dynamic bifurcation theory. Dynamic bifurcation theory is concerned with topological changes in the nature of the solutions of differential equations as parameters are varied. Such an example is the creation of periodic orbits from an equilibrium point as a parameter crosses a critical value. In certain circumstances, the application of centre manifold theory reduces the dimension of the system under investigation. In this respect the centre manifold theory plays the same role for dynamic problems as the\nLyapunov\n-\nSchmidt\nprocedure plays for the analysis of static solutions. Our use of centre manifold theory in bifurcation problems follows that of Ruelle and Takens and of Marsden and McCracken.\nIn a review of the book, the Soviet nonlinear dynamical systems expert Rifkat Ibragimovich Bogdanov\n(1950\n-\n2013)\nwrites\n[\n2\n]\n:-\nA centre\n(\nor neutral\n)\nmanifold for a vector field at its zero is an invariant manifold corresponding to the zero real part eigenvalues of the linearised vector field. This book is devoted to the well-known method of reduction of the initial vector field trajectories to that of its restriction to the centre manifold. The book includes the simplest existence theorem and approximation theorem for a centre manifold\n(\nwith complement for the infinite-dimensional case\n)\n. The bifurcation of vector fields of codimension one and the bifurcation\n(\nalso in the presence of the symmetry-rotation by π-angle of plane vector fields of codimension two are described. Applications of the above methods to a panel flutter problem are included.\nIn\n1982\n, the year following the publication of this book, Carr wrote two papers in collaboration with Robert G Muncaster:\nThe application of centre manifolds to amplitude expansions. I. Ordinary differential equations\n; and\nThe application of centre manifolds to amplitude expansions. II. Infinite-dimensional problems\n. Muncaster was a research associate at Heriot-Watt University in\n1976\n-\n79\nbefore moving to the University of Illinois at Urbana-Champaign where he has worked ever since. Carr published many important papers throughout his career and we will only give here the titles of a small number:\n(\nwith Oliver Penrose\n)\nThe Becker-Döring cluster equations: basic properties and asymptotic behaviour of solutions\n(1986)\n;\n(\nwith John M Ball\n)\nCoagulation-fragmentation dynamics\n(1987)\n;\n(\nwith John M Ball\n)\nAsymptotic behaviour of solutions to the Becker-Döring equations for arbitrary initial data\n(1988)\n;\n(\nwith John M Ball\n)\nThe discrete coagulation-fragmentation equations: existence, uniqueness, and density conservation\n(1990)\n;\nAsymptotic behaviour of solutions to the coagulation-fragmentation equations. I. The strong fragmentation case\n(1992)\n; and\n(\nwith B Adams\n)\nSpatial pattern formation in a model of vegetation-climate feedback\n(2003)\n. John Macleod Ball was at Heriot-Watt from\n1972\nto\n1996\nbefore being appointed Sedleian Professor of Natural Philosophy at the University of Oxford. He has been awarded many prizes and medals, elected to the\nRoyal Society\nin\n1989\n, and knighted in\n2006\n.\nIn\n1999\n, in collaboration with Julian Hunt, professor of mathematics, University of Cambridge, Carr wrote\nMathematics for the\n21\nst Century\nwhich was printed in the\nTimes Higher Education Supplement.\nYou can read a version of this article at\nTHIS LINK\n.\nThis article was in anticipation of the fourth International Congress on Industrial and Applied Mathematics which was held in Edinburgh\n5\n-\n9\nJuly\n1999\n. Robert Edmund O'Malley, an American mathematician who had spent a year at Heriot-Watt University in around\n1970\n, attended the fourth International Congress on Industrial and Applied Mathematics and wrote in\n[\n8\n]\nabout Carr's contribution to organising this conference:-\nEdinburgh and Heriot-Watt mathematicians Jack Carr, Lyn Thomas, Michael Levitin, and Adri Olde Daalhuis joined professional staff from Meeting Makers in Glasgow and lots of young assistants, including Sir\nMichael Atiyah\n's son, in making the combined registration/headquarters operation function very efficiently. In particular, much of the preliminary organization was accomplished through efficient electronic communication and the Web. I was continually amazed throughout the week by Jack Carr's wonderful conviction that all would go well with the program since the people involved were\n99\n% super. If you pressed, he'd recognize complications, but he never let them pull his spirits down. One helpful new feature he introduced to ICIAM was a brief Daily News containing program changes and highlights of the previous day. We were very lucky that the able Jack had been drafted to handle so much of the logistics.\nJack Carr did not only use his many skills in research, conference organising, and teaching undergraduates and postgraduates. Together with his wife Teresa, he organised mathematics classes for pupils in their final two years of primary school, ages\n10\nand\n11\n, between the years\n1991\nand\n2006\n. Approximately halfway through these sixteen years, Carr wrote the article\n[\n3\n]\nin which he described a little of his approach to these classes that, over these sixteen years, involved the participation of over\n1000\nScottish primary school children. For a version of Carr's article, see\nTHIS LINK\n.\nThere are other ventures that Carr took part in which we should mention at this point. One was his involvement in\nScholarpedia\n, a peer-reviewed open-access encyclopaedia written and maintained by scholarly experts from around the world.\nScholarpedia\nwas inspired by\nWikipedia\n, began publishing in\n2005\n, and aimed to complement\nWikipedia\nby providing in-depth scholarly treatments of academic topics. Each article has a single curator who is ultimately responsible for the article's contents. Each article's curator is a world-recognized authority on the topic covered by the article. Carr was a curator of\nScholarpedia\n.\nCarr made several research visits abroad. He spent the academic years\n1978\n-\n79\nat Brown University, Providence, Rhode Island. It was there that he gave lectures which he published as his book in\n1981\n. He visited the Department of Mathematical Sciences, Carnegie Mellon University in April\n2007\n. He gave the course Dynamical Systems, to the African Institute for Mathematical Sciences, Ghana, in February/March\n2013\n, in January/February\n2014\n, and a Masters project in April\n2014\n. He gave the following description of his Dynamical Systems course:-\nNonlinear differential equations and dynamical systems is a vast area and practitioners include applied mathematicians, analysts and others in science and engineering. Although there are many books on nonlinear science, they are not always accessible to beginning graduate students as they often require extensive mathematical preparation. The main aim of this course is to provide a broad education in the area that is mathematically insightful yet devoid of extensive formalism. The main topic will be the study of the qualitative and geometric theory of nonlinear differential equations and dynamical systems. the approach taken will depend heavily on examples. Students will\n(\na\n)\nLearn a number of techniques which will increase their chances of success when faced by a nonlinear problem.\n(\nb\n)\nBe provided with the fundamental ideas of the subject so that they will find some of the more advanced textbooks accessible.\nCarr received several honours for his broad contributions to mathematics. He was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1986\n. In\n2002\nhe and his wife Teresa were given Inspiration Awards by the\nRoyal Society of Edinburgh\n. These annual awards recognise the outstanding contribution made by volunteers to the\nRoyal Society of Edinburgh\n's programme of educational activities for young people.\nLet us now give extracts from some of the obituaries. In\n[\n6\n]\nwe have the following:-\nProfessor Jack Carr, an internationally renowned mathematician, pursued mathematics and later mathematical education from pure love for the subject. He was unassuming, motivated neither by material gain nor even a great desire for professional advancement. His research and teaching were grounded in impeccably high academic standards, comprehensive knowledge, and a rare talent to quickly identify the essential core of any problem. He readily explained his insights in patient and simple terms both to students and to many others who approached him for help.\nIn\n[\n5\n]\nwe read the following:-\nApart from his outstanding research skills, he was an influential member, and often chair, of numerous local, national, and international committees. He was always extremely generous with his encouragement and assistance to students and colleagues, and he did his best to convey the excitement of Mathematics to his students and others.\nIn\n[\n7\n]\nwe read the following:-\nProfessor Jack Carr, an internationally renowned mathematician, pursued mathematics and later mathematical education from pure love for the subject. He was unassuming, motivated neither by material gain nor even a great desire for professional advancement. His research and teaching were grounded in impeccably high academic standards, comprehensive knowledge, and a rare talent to quickly identify the essential core of any problem. He readily explained his insights in patient and simple terms both to students and to many others who approached him for help.\nLet me\n[\nEFR\n]\nfinish this biography with a little personal comment. On one occasion I conducted an academic audit of a Scottish university along with Jack Carr. He was the applied mathematics expert and I was the pure mathematician. He was a great partner to have for such an exercise. He was very perceptive but equally kind, positive and helpful in his comments. Since his area of mathematics was far removed from mine, we seldom met at conferences but I remember one joint meeting of the British Mathematical Colloquium and the British Applied Mathematics Colloquium where Jack joined a group of St Andrews pure mathematicians at meal times and it was such a pleasure to share his company.",
  "matematicos_citados_na_biografia": [
    "Bryce McLeod",
    "Royal Society of Edinburgh",
    "Dynamical Systems",
    "Lyapunov",
    "Schmidt",
    "Royal Society",
    "THIS LINK",
    "Michael Atiyah"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}