{
  "nome_completo": "John Walsh",
  "nome_curto": "John Walsh",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Walsh/",
  "data_nascimento": "about 1786",
  "local_nascimento": "Shandrum, County Limerick, Ireland",
  "data_morte": "1847",
  "local_morte": "Cork, Ireland",
  "summary": "John Walsh was an eccentric Irish mathematician who wrote on a wide variety of mathematical topics.",
  "biografia": "John Walsh\nwas an extreme mathematical eccentric whose life both\nGeorge Boole\nand\nDe Morgan\nfelt should be better known. We do our best to follow their wishes by giving\nGeorge Boole\n's biography which appears in\n[\n2\n]\n, see also\n[\n1\n]\n.\nJohn Walsh was born at Shandrum, on the border of the County of Limerick, probably about the year\n1786\n. His parents were small farmers; and the only education which he appears to have received was from itinerant schoolmasters, a class of teachers of humble rank who resided, while imparting their little stock of knowledge, with the parents of their pupils, and thus may have contributed to foster that respect for learning which still characterises the Irish peasant. Of his mother, Mr Walsh always spoke with great affection, attributing to her influence his first love of letters. He also held in kind remembrance one of his early school-fellows, John Harding, to whom in later life he dedicated a little tract on\nThe General Principles of the Theory of Sound\n.\nWhen about\n28\nyears of age, John Walsh, in company with Harding, removed to Cork. Necessity, however, compelled the friends to separate. Walsh, who wrote a fine hand, an accomplishment which he stated that he owed to his mother's instruction, obtained employment as a teacher of writing in ladies' schools. He also received private pupils, and at a subsequent period was engaged as writing-master in two respectable boys' schools in the city. The teaching of writing and arithmetic appears to have been his chief source of subsistence; for although he sometimes obtained pupils in the higher mathematics, this was not a frequent occurrence. Mr Walsh is said to have been a careful and diligent writing-master, and to have succeeded in making his pupils in arithmetic understand and like the subject. The few testimonies which I have heard of his abilities as a teacher of the higher mathematics would not lead me to think that he was equally successful there. He is stated to have been too intent on enforcing his own peculiar views. Indeed there can be little doubt, from an examination of his papers, that upon this subject he laboured under a peculiar mental hallucination.\nAt what time Mr Walsh began to write on mathematical topics I am not able to determine. By degrees, however, this class of speculations appears to have absorbed his entire interest. He became convinced that the differential calculus was a delusion; that\nSir Isaac Newton\nwas a shallow sciolist, if not an impostor; and that the universities and academics of Europe were engaged in the interested support of a system of error. Whether this was a sudden conviction, or whether it was the gradual result of the successive disappointments which he was destined to endure in his attempts to convince the world how misplaced its confidence had been, it is not easy to determine; but the latter is the more probable view. However this may have been, Mr Walsh was for a series of years engaged in a constant endeavour to induce the principal learned societies of Europe to print his communications. His posthumous papers show that he was thus in frequent correspondence with the\nFrench Academy\n, the\nRoyal Society of London\nand the\nRoyal Society of Edinburgh\n, the\nRoyal Irish Academy\nand other similar bodies.\nFailing in every effort of this nature, he published at his own expense a large number of tracts, in which he endeavoured to establish his views, and denounced in no measured terms the unjust and selfish opposition which he thought that he had met with. Of a considerable number of these tracts, and also of the original manuscripts of them, I have found copies among his papers and a brief account of them may be interesting.\nThe printed tracts and papers are for the most part occupied with the announcement of some discovery which was designed to supersede the differential calculus in its application to problems respecting curves. The method in question consisted in transferring the origin of coordinates to a point upon the curve, developing the ordinate\ny\ny\ny\nin terms of the abscissa\nx\nx\nx\n, and making use of the coefficients of the expansion just in the same way as the ordinary principles of the differential calculus would direct us to do. The titles of some of Mr Walsh's papers will serve to throw light on the particular objects which he had in view. The equation of a curve transformed as above Mr Walsh calls its 'partial equation'.\nMemoir on the Invention of Partial Equations; The Theory of Partial Functions; Irish Manufactures: A New Method of Tangents; An Introduction to the Geometry of the Sphere, Pyramid and Solid Angles; General Principles of the Theory of Sound; The Normal Diameter in Curves; The Problem of Double Tangency; The Geometric Base; The Theoretic Solution of Algebraic Equations of the Higher Orders.\nThe mere list of titles above given, and it is far from being complete, affords evidence of considerable industry, and Mr Walsh's unpublished papers confirm this testimony. The following is an account of the principal ones:\nThe Elements of Geometry\n, by John Walsh\n(\nFolio\n)\n. This merely contains a series of definitions and axioms, etc., beginning with the 'doctrine of ratio'.\nThe definitions are headed by the motto 'Space is Space, Time is Time, Truth is Truth', and the first of the so-called definitions is 'Space and Time are infinite, coeternal, and cannot be increased or diminished.' For the rest, the propositions appear to be those of\nEuclid\nexpressed in another form, the word 'angular plane' being used for angle.\nMemoir on the Calculus of Variations, showing its total unreality\n. In these, and in nearly all of Mr Walsh's speculations which I have taken the trouble to examine, one peculiarity of his mental procedure is very observable. He takes up some known method or formula of analysis, makes in it a slight and quite unimportant change\n(\nfor every theorem admits of some variety in the mode of its expression\n)\nand views the result to which he is led as an original discovery. Thus, in a page headed\nCubic Equations\n, he writes the name of\nCardan\nopposite to a well-known algebraic solution, that of Walsh opposite to the same result put under another and less convenient form, and below these he gives a formula headed\nFor a Complete Cubic by Walsh only\n. It is related of the dramatic poet Wycherley, that in his old age, the functions of memory and of genius were so strangely mingled and confused that if verses were read to him in the evening he would reproduce them the following morning with all the effort of original composition, quite unconscious of the source of his borrowed inspiration. Mr Walsh committed similar errors without the intervention of a sleep.\nWhat importance Mr Walsh attached to his supposed discoveries will appear from the following extract which I make from the manuscript notebook above referred to. It is not a solitary example:-\nDiscovered the general solution of numerical equations of the fifth degree at\n114\nEvergreen Street, at the Cross of Evergreen, Cork, at nine o'clock in the forenoon of July\n7\nth\n,\n1844\n; exactly twenty-two years after the invention of the Geometry of Partial Equations, and the expulsion of the differential calculus from Mathematical Science.\nBesides Mr Walsh's own papers, there remain a large number of letters which had been received by him, in reply to his applications, from different learned societies. The most interesting of these conveys a report by\nPoisson\nand\nCauchy\non one of his papers submitted to the\nAcademy of Sciences\n. That report points out clearly what I have already had occasion to remark in other instances, that Mr Walsh's supposed discovery, in so far as it was true, was not original. In a subsequent report by\nPoisson\nupon another communication, that great analyst, referring to the former one, stated explicitly that Mr Walsh's papers did not merit the attention of the\nAcademy\n.\nMr Walsh continued to pursue his avocation as a writing-master in Cork until the year\n1845\n, when a paralytic seizure threw him almost helpless upon the charity of those who had known him in better days. Among his papers is a subscription list, testifying that the appeal made for him to the benevolence of his fellow citizens was not unheard. I have however been informed upon credible authority that the first use which Mr Walsh made of the sum put into his hands was to rush into print. It will not be surprising to learn that about this period he was for some time confined in the city jail for debt and that shortly after he was an inmate of the Union.\nIt is a happy circumstance, that, never having married, he had no family cares to weigh upon his spirits. What time poor Walsh spent in the Union in this his first visit to it I have not ascertained; but before long he was removed, chiefly through the benevolent intercession of Dr Finn, one of the physicians of the North Infirmary, to that Institution, where he remained for some months. It is not improbable that at this period, his disease may have been accompanied by cerebral excitement, for he is described as having been a rather intractable patient. Peculiar notions which he had formed on the subject of religion led him to attempt to convert some of his fellow-patients to the same views. I have been informed by one of the physicians who was then in attendance at the infirmary, that he would rise at night from his bed, and addressing the other patients, declaim in the most earnest manner against the belief in the immortality of the soul. The particular argument upon which he relied is stated in a paper which a short time before he had printed under the title of\nMetalogia\n. It is, in his own words, as follows:-\nThe Deity is coeternal with Time and Space, and has all his attributes infinite. He cannot confer any of these attributes on thinking beings; for if the Divine Being could confer any one of his attributes, viz. immortality, for example, therefore inductively he could confer all his attributes on mankind, and make them coequal to himself in every respect, which would be contradictory and absurd. Therefore, etc.\nIn the same paper, which is interesting as being probably his last performance, he thus defines the science of Metalogia, and describes its claims:-\nMetalogia, which signifies beyond reason, is the name I have given to a new branch of knowledge which inquires into the causes of such phaenomena as ignorance would persuade us had been beyond the power of human reason to investigate. Already it has opened the way for three great movements in human affairs.\nThese movements he describes with a simplicity which would excite a smile, if the whole history did not too deeply draw upon the sources of pity, as, First:-\nThe falsehood of the Greek method of exhausted quantities, so celebrated throughout all ages, even in our own times, by the mathematicians, astronomers and philosophers of the world, as an admirable and refined invention. And the falsehood of the offspring of that method, namely, the no less celebrated doctrine of fluxions, differentials, limits, etc., the boast and glory of England, France and Germany, demonstrated by the great invention of the geometry of partial equations which has superseded them, at least in my hands, and indefinitely surpassed the old system in power.\nThe second great movement in human affairs is in physical science, viz. the falsehood of\nNewton\n's law of gravity. ... The third of these great movements\n[\nis the above argument against immortality which, he says\n]\nbecause it is based upon demonstrated truth will ultimately overspread the earth. and banish superstition from its surface.\nObserve the admirable candour of the admission\n'at least in my hands'\nwith which poor Walsh is forced to qualify his harmless boast of the triumphs of his system.\n\"Whether\", he confesses in another part of the same paper, \"it is owing to the prejudices of the philosophers or to the actual irrational bearing of the human species,\" his most important discoveries had been \"completely sent to Coventry\".\nThe remainder of poor Walsh's story is soon told. After remaining without benefit for some time in the North Infirmary, he was received into the house of a brother, the Rev M Walsh, parish priest of Sneem in the County of Kerry. There, however, he did not remain long. Restless and unhappy, he returned at his own desire, to Cork, and resided on Patrick's Quay, where he endeavoured again, but vainly, to obtain pupils in his favourite science. The paralysis from which he suffered had moreover destroyed the beauty of his hand-writing, which from one specimen that I have seen of it appears to have been once remarkable, and thus cut off all hopes of subsistence from his former employment. Doubtless it was by the aid of benevolent friends\n(\nand in generous sympathy for misfortune, Cork is not wanting\n)\nthat he was able to subsist.\nIt was at the commencement of an awful period that John Walsh sought an asylum in the Cork Union. The autumn of\n1846\nand the whole of the following winter and summer will long be remembered in Ireland. The food of a nation had perished, and a desolation unexampled in modern times came down upon the land. At the time of Mr Walsh's admission, the Union house built for the accommodation of\n2\n,\n000\npersons was already crowded. Ere long, the number of its inmates exceeded\n7\n,\n000\nand, despite all endeavours to provide accommodation for the continually increasing throng by the erection of sheds and temporary hospitals, all the avenues of approach were thronged with the dying and the dead. Amid this scene of national woe and calamity in the famine year of\n1847\n, poor Walsh breathed his last. He had been for some time before his death insensible and unable to recognise his pupil. I have been informed by Dr O'Connor that he did not die of the fever which was carrying off the inmates of the Union house at the rate of two or three hundred weekly, but of the paralytic affection under which he had for some time laboured.\nMr Walsh was a man of agreeable address, and, when treated with the respect which he thought due to himself, of friendly and courteous manners. In the affairs of the world he was a child and was apt to become the dupe of interested persons. With proper economy he might have saved sufficient to support himself in old age; but the easiness of his temper, and, I fear during the latter years of his life, a too great fondness for social enjoyments kept him poor. The freedom of his opinions upon religion operated also unfavourably upon his temporal interests. I have reason to think, from an examination of his papers, that the looseness of his sentiments upon this subject was not the result of any desire to release himself from the restraints of moral obligation, but of an exaggerated self-esteem. and a too great confidence in his own not very exalted powers of intellect, the source probably of nearly all his errors and misfortunes. To this cause we may attribute the intemperate tone of his remarks whenever he is discussing the merits of those whom the world has consented to make its guides in science. Upon his favourite topic of discourse, it is said that he was quite unable to bear contradiction.\nMr Walsh is an extreme instance of a class of persons, who, without having mastered the very elements of received science, spend their lives in attempting its subversion and in the vain endeavour to substitute in its place some visionary creation of their own fancy. Whether such persons would not in the earlier stages at least of their career be accessible to the conviction of their error is worthy of consideration. A little judicious kindness at that period might in some cases prevent the misspending of a life. But when that which was originally but a fond and foolish notion has been fostered into a disease of the mind, the cure is generally hopeless. Trisectors of an angle, squarers of the circle, discoverers of perpetual motion, constitute a class of mankind whose peculiarities deserve the attention of the student of human nature, and whose personal history is often calculated to awaken the deepest commiseration. Providence seems to have in some measure vindicated the equality of its dispensations by assigning to them a double measure of hope, which serves them in the stead both of ability and of success.\nBut there is a class superior to these whose history is far more affecting; men who with both genius and competent knowledge devote themselves, perhaps in the over hours of labour, to the improvement of some mechanical invention, and either through want of means, or through legal impediments, or because they have miscalculated the requirements of the age, find themselves doomed to ceaseless disappointment. If they are unburdened with family ties, the case is not so distressing. Amid the greater sorrows of the times, we may permit ourselves to forget theirs. But if they have wife and children looking up to them for support, yet destined to see their comforts depart and their hopes grow less; if, in addition to this, sickness follows in the train of toil and disappointment, and unstrings the skilful hand and quenches the fire of the inventive mind, then I confess that, guilt and its consequences apart, I know of few sadder spectacles in the varied drama of human life.",
  "matematicos_citados_na_biografia": [
    "George Boole",
    "De Morgan",
    "Sir Isaac Newton",
    "French Academy",
    "Royal Society of London",
    "Royal Society of Edinburgh",
    "Royal Irish Academy",
    "Euclid",
    "Cardan",
    "Poisson",
    "Cauchy",
    "Academy of Sciences",
    "Academy",
    "Newton"
  ],
  "imagens": []
}