{
  "nome_completo": "John Macnaghten Whittaker",
  "nome_curto": "John Whittaker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whittaker_John/",
  "data_nascimento": "7 March 1905",
  "local_nascimento": "Cambridge, England",
  "data_morte": "29 January 1984",
  "local_morte": "Sheffield, England",
  "summary": "John Macnaghten Whittaker worked in Quantum Mechanics and Complex Analysis.  He became Vice-Chancellor of Sheffield University.",
  "biografia": "John Whittaker\n's mother, Mary Ferguson McNaghten Boyd, was from an important family. Her father, the Rev Thomas Boyd, was a presbyterian minister who lived in Cambridge and was the Scottish Secretary of the Religious Tract Society. His father, Mary's grandfather, was Sir Thomas Boyd who had been Lord Provost of Edinburgh and had a major role in the founding of the Edinburgh Royal Infirmary and four Edinburgh Schools including George Watson's College. It was one of the schools remodelled by the Merchant Company and opened as a College on\n26\nSeptember\n1870\n. John's father was\nEdmund Taylor Whittaker\n, a distinguished mathematician who has a biography in this archive.\nJack\n(\nthe name he was known by throughout his life\n)\nhad two brothers\n(\none older brother and one younger brother\n)\nand two sisters. One of his sisters, Beatrice Mary Whittaker, married\nEdward Copson\nwhile one of his brothers, Eddy Whittaker, became Vice-President of the Prudential Insurance Company in Newark, New Jersey, United States. Jack's parents moved from Cambridge to Dublin when he was one year old. His parents moved again, this time to Edinburgh in Scotland, in\n1912\n. It was in that city that Jack first attended school studying at George Watson's College, the school that his great-grandfather had helped found. He then attended St Salvator's School in St Andrews until he won a scholarship to Fettes Academy in Edinburgh. St Salvator's School, which opened in\n1882\nin what is now the Scores Hotel, aimed:-\n... to provide a sound general education to prepare boys for the Public Schools of England and Scotland ... No better facilities exist within the four corners of the United Kingdom for the purpose.\nWhen Jack boarded at the school Alfred George Le Maitre was the Headmaster and there were around\n50\nboys, most of whom were day pupils, the most successful of whom went on to Sandhurst, Rugby, or like Jack, to Fettes Academy.\nWhittaker attended Fettes from\n1918\nuntil\n1920\nduring which time he was introduced to calculus. Then at the age of\n15\nhe entered Edinburgh University where he became friends with\nHodge\nwho was in the same class. The decision to study mathematics had not been taken lightly for he had wide ranging interests and expertise. In fact he had seriously thought of studying fine art but, influenced by his father, he decided to study mathematics. Having a famous mathematician as a father must have made such a decision very difficult for he would have had conflicting feelings, some drawing him to his father's topic, some telling him he should be his own person and do something different.\nJack entered Trinity College, Cambridge, in\n1923\nand there he was taught by\nLittlewood\n,\nMilne\n,\nFowler\nand S Pollard. One of the first papers the Whittaker wrote solved a problem mentioned by Pollard in his lectures and it appears that Pollard's lectures had the most influence on the direction of his mathematical interests. His fellow students were also an impressive collection of people who included W H McCrea,\nPaley\n,\nCoxeter\nand\nTodd\n.\nHe spent two years as an Assistant Lecturer in Mathematics at the University of Edinburgh\n(1927\n-\n29)\nwhere his father\nE T Whittaker\nheld the Chair of Mathematics, and during this time he was awarded a D.Sc. by Edinburgh University and a Smith's Prize by Cambridge. Elected a fellow of Pembroke College, Cambridge, he spent the next four years there as a lecturer. However, although he greatly enjoyed college life, in some ways it did not suit him since supervising students was something he was not happy with and felt it was something that he did not do very well. He therefore looked for an opportunity to move away from Cambridge and the vacant chair of pure mathematics at Liverpool looked attractive.\nWhittaker accepted the chair of pure mathematics at the University of Liverpool in\n1933\n. The teaching of pure mathematics was his responsibility, while teaching applied mathematics was the responsibility of L Rosehead who was appointed to the Applied Mathematics Chair at the same time as Whittaker. On\n19\nDecember of that year he married Iona Mhari Natalie Elliot, whose father has been a tea planter in Assam. Jack and Iona had two sons, John Edmund Whittaker born on\n19\nNovember\n1934\nand Richard James Whittaker born on\n6\nFebruary\n1938\n.\nBy\n1938\nwar seemed almost inevitable so Whittaker joined the emergency research officers. After World War II started, Whittaker was called up for war service in July\n1940\n. His first assignment was to join the Newark section of the King's Own Royal Regiment as an intelligence officer. While the threat of invasion seemed imminent he undertook guard duty, but by October\n1940\nhe was posted to Anti-Aircraft Command at Stanmore. During the summer of\n1942\nhe was at the tank gunnery school at Lulworth, being sent to Egypt in September of that year. He spent a year in Cairo where he made contacts with mathematicians which were to forge strong links between Cairo and Liverpool which lasted many years. We refer below to a book which records the lectures he gave at Fouad I University, Cairo. He served Montgomery, served with the\n8\nth\nArmy, and at Staff Headquarters during the Tunisian campaign. By August\n1943\nhe was back in England, working at the War Office where he later was Deputy Scientific Advisor to the Army Research Council.\nWhittaker returned to his chair at Liverpool in October\n1945\nand became involved in administrative duties such as being Dean of Science from\n1947\nto\n1950\n. By\n1953\nhe had decided that if he was to be an administrator he would be a professional one, and, having declined offers from two London Colleges, he became Vice-Chancellor of Sheffield University. He successfully led Sheffield until his retirement in\n1965\n. The article\n[\n1\n]\ndetails many of his achievements for Sheffield University as he skilfully led it for thirteen years through a period of massive expansion. New staff had to be appointed, new buildings built, new departments started up, and all presented problems which tackled with vigour, firmness and understanding.\nHe also played a large role in the life of the city of Sheffield, helping to improve relations between the city and the university. In particular he served on the Cathedral Council, was a governor of the United Hospitals, served on the Conservation Council, and was a member of the Sheffield Museum Society. The Museum Society gave him the chance to use his expertise on fine art\n[\n1\n]\n:-\nHe often lectured to outside bodies on his many artistic interests including numismatics, Coptic textiles, and archaeology.\nLet us now look at Whittaker's contributions to mathematics. His first four papers in the late\n1920\ns were on\nquantum theory\n. The second of these was\n(\naccording to Geoffrey Stephenson\n)\n:-\n... far-sighted in its motivation for at that time of elementary particles interacting with the gravitational field was not taken very seriously.\nHe then did some of his most important work on complex analysis. He extended results of his father\nE T Whittaker\non the cardinal function. He also made important contributions to\nNevanlinna\ntheory with results on\nmeromorphic\nfunctions. He was interested over many years in expanding functions in a series of polynomials and Whittaker's constant is named after him. He wrote three important books.\nInterpolatory function theory\n(1939\n, reprinted\n1964)\n,\nSeries of Polynomials\n(1944)\n, and\nSur les Séries de Base de Polynomes Quelconques\n(1949)\n. The first of these contains a result, which Whittaker correctly attributed to Takenaka, which shows that, with an added technical condition, an entire function every derivative of which has a zero in the unit disk is necessarily a constant. The constant has become known as Whittaker's constant despite the result being originally due to Takenaka. The second book is only\n43\npages long and is the result of a series of lectures given by Whittaker at the Fouad I University, Egypt in\n1943\n. It brings up to date the first chapter of his earlier book. The third book is again short being\n85\npages long. It gives a much fuller treatment of the material in his\n1943\nbook, and also contains results obtained since\n1943\n. In many ways this work can be seen as Whittaker's greatest achievement and he was awarded the prestigious\nAdams\nPrize by Cambridge University for this work in\n1949\n.\nIn\n1965\nWhittaker retired as Vice-Chancellor and enjoyed his mathematics again. After spending a year at Birmingham as a senior research fellow in mathematics he returned to Sheffield in\n1967\nas an honorary lecturer in mathematics. He renewed his contacts with mathematicians in Cairo, spending January to March of\n1967\nas a visiting professor in Cairo. He also spent time in Teheran where he took the opportunity to indulge his love of fine art and brought back a fine collection of ceramics, glassware, and water colours.\nHis interests and character are described in\n[\n1\n]\nas follows:-\n... he collected\n18\nth\nand\n19\nth\ncentury water colours and other pictures and drawings. ... In his youth Jack had been active in hockey, rugger and tennis ... He remained a keen gardener .. He neither smoked nor drank but later in life he came increasingly to appreciate the fine food his wife provided, especially sweet things. He was a good after-dinner speaker, always without notes.",
  "matematicos_citados_na_biografia": [
    "Edmund Taylor Whittaker",
    "Edward Copson",
    "Hodge",
    "Littlewood",
    "Milne",
    "Fowler",
    "Paley",
    "Coxeter",
    "Todd",
    "E T Whittaker",
    "quantum theory",
    "Nevanlinna",
    "meromorphic",
    "Adams"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}