{
  "nome_completo": "John Willard Milnor",
  "nome_curto": "John Milnor",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Milnor/",
  "data_nascimento": "20 February 1931",
  "local_nascimento": "Orange, New Jersey, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "John Milnor is an American mathematician known for his work in differential topology, K-theory and dynamical systems.",
  "biografia": "John Milnor\n's parents were Joseph Willard Milnor\n(1889\n-\n1949)\nand Emily Cox\n(1891\n-\n1973)\n. Joseph Milnor, born in Williamsport, Pennsylvania, graduated from Lehigh University in\n1912\nwith first class honours in mathematics. After serving for a year with the General Electric Company in Pittsfield, he entered the engineering department of the Western Union Telegraph Company in\n1913\n. Nine years later he was promoted to research engineer and, in\n1936\n, became a transmission engineer. He was appointed consulting engineer in\n1943\nand retired in the following year.\nMilnor\n(\nknown to his friends and colleagues as Jack\n)\nwas an undergraduate at Princeton University, receiving his A.B. in\n1951\n. Most outstanding mathematicians develop a passion for the subject when at school but not so Milnor. It was in his first year at Princeton that he first became interested in mathematics\n[\n14\n]\n:-\nThe first time that I developed a particular interest in mathematics was as a freshman at Princeton University. I had been rather socially maladjusted and did not have too many friends, but when I came to Princeton, I found myself very much at home in the atmosphere of the mathematics common room. People were chatting about mathematics, playing games, and one could come by at any time and just relax. I found the lectures very interesting. I felt more at home there than I ever had before and I have stayed with mathematics ever since.\nAmong his notable achievements while an undergraduate were being named Putnam Fellow as a top scorer in the Putnam competition in mathematics in\n1949\nand\n1950\n. Perhaps even more impressive was the publication of his first paper in the\nAnnals of Mathematics\nin\n1950\n. This paper,\nOn the total curvature of knots\n, was accepted for publication in\n1948\nwhen Milnor was only seventeen years old. The paper came as the result of the differential geometry course Milnor attended given by\nAlbert Tucker\n. In the lectures\nKarol Borsuk\n's question on the total curvature of a knotted curve was mentioned and Milnor solved the problem \"after a few days thought\". Milnor had been helped in writing the paper by\nRalph Fox\nand he acknowledged this in the paper:-\nI am indebted to\nR H Fox\nfor substantial assistance in the preparation of this paper.\nHe began research at Princeton after graduating with his B.A. and, in\n1953\n, before completing his doctoral studies, he was appointed to the faculty in Princeton. While undertaking research he enjoyed playing games in the common room. In particular he played Kriegspiel\n(\na game of blindfold chess\n)\n, Go and Nash\n(\na game invented by\nJohn Nash\nand now called Hex\n)\n. In fact\nJohn Nash\nwas at Princeton during these years and Milnor and\nNash\noften talked about game theory. Milnor's next paper, written while he was undertaking research, was\nSums of positional games\n(1953)\n. Milnor writes in the Introduction:-\nMany common games, such as chess and checkers, exhibit a structure in addition to that which is necessary to define their game-theoretic properties. By a position in such a game will be meant merely the physical setup of the board without any specification as to which player is to move. In these games a set of possible moves is defined at each position for each of the players, even though only one of them will actually be able to move from this position in any particular play of the game. In this paper an operation of addition will be defined and studied for games having this structure.\nThis was only one of several papers that Milnor published in\n1953\n. The others were:\nThe characteristics of a vector field on the two-sphere\n;\nOn total curvatures of closed space curves\n; and\n(\nwith\nIsrael Herstein\n)\nAn axiomatic approach to measurable utility\n. Another paper,\nLink groups\n, was published in\n1954\nbut it had been submitted for publication in March\n1952\n, over a year before the first of the\n1953\npapers just mentioned. Milnor writes in the Introduction to\nLink groups\n:-\nBy a link homotopy is meant a deformation of one link onto another, during which each component of the link is allowed to cross itself, but such that no two components are allowed to intersect. The purpose of this paper is to study links under the relation of homotopy. The fundamental tool in this study will be the link group. The link group of a link is a factor group of the fundamental group of its complement, which is invariant under homotopy. ... I am indebted to\nR H Fox\nfor assistance in the preparation of this paper.\nIn\n1954\nMilnor received his doctorate for his\n44\n-page thesis\nIsotopy of Links\nwritten under\nRalph Fox\n's supervision. Milnor remained on the staff at Princeton where he was an Alfred P Sloan fellow from\n1955\nuntil\n1959\n. During these years he undertook research on manifolds. He explained in\n[\n14\n]\nwhat a manifold is and why it is important:-\nIn low dimensions manifolds are things that are easily visualized. A curve in space is an example of a one-dimensional manifold; the surfaces of a sphere and of a doughnut are examples of two-dimensional manifolds. But for mathematicians the dimensions one and two are just the beginning; things get more interesting in higher dimensions. Also, for physicists manifolds are very important, and it is essential for them to look at higher-dimensional examples. For example, suppose you study the motion of an airplane. To describe just the position takes three coordinates, but then you want to describe what direction it is going in, the angle of its wings, and so on. It takes three coordinates to describe the point in space where the plane is centred and three more coordinates to describe its orientation, so already you are in a six-dimensional space. As the plane is moving, you have a path in six-dimensional space, and this is only the beginning of the theory. If you study the motion of the particles in a gas, there are enormously many particles bouncing around, and each one has three coordinates describing its position and three coordinates describing its velocity, so a system of a thousand particles will have six thousand coordinates. Of course, much larger numbers occur, so mathematicians and physicists are used to working in large-dimensional spaces.\nHe was promoted to professor in\n1960\nthen, in\n1962\n, Milnor was appointed to the Henry Putman chair.\nMilnor was awarded a\nFields\nMedal at the\n1962\nInternational Congress of Mathematicians in Stockholm. His most remarkable achievement, which played a major role in the award of the\nFields Medal\n, was his proof that a\n7\n-dimensional sphere can have several differential structures. This work opened up the new field of differential topology. He showed that\n28\ndifferent differentiable structures exist on the seven-dimensional sphere. He distinguished between these structures using numerical invariants based on the\nTodd\npolynomials. The\nTodd\npolynomials were first studied in algebraic geometry and it is surprising that they play this fundamental role in classification of manifolds. The reason that Milnor could use them to distinguish the differential properties of manifolds is because they have arithmetic properties, involving the Bernoulli numbers, which reflect in a deep and not fully understood way these differential properties.\nThe references\n[\n4\n]\nto\n[\n18\n]\ngive a good indication of the wide influence of Milnor's work up to\n1992\n(\nwhen these articles were written\n)\n. The article\n[\n4\n]\nis a survey of Milnor's work in algebra, particularly in algebraic\nK\nK\nK\n-theory, where his work continues to have important influences. The article\n[\n17\n]\nlooks at nine papers which Milnor had written on differential geometry. It discusses Milnor's theorem, which shows that the total curvature of a knot is at least\n4\n. Among other results discussed are Milnor's result showing that we cannot necessarily \"hear the shape\" of a\n16\n-dimensional torus, and another result giving upper and lower bounds on the number of distinct words of a given length in a finitely generated subgroup of the fundamental group.\nIn the\n1950\ns Milnor did a substantial amount of work on algebraic topology which is discussed in\n[\n18\n]\n. He constructed the classifying space of a topological group and gave a geometric realisation of a semi-simplicial complex. He also studied the\nSteenrod\nalgebra and its dual, investigated the structure of\nHopf\nalgebras, and studied characteristic classes and their relation to mathematical physics.\nFor a good overview of Milnor's mathematics, see the citations for the various prizes which he has won at\nTHIS LINK\n.\nThe extracts from reviews of his books and the extracts from Milnor's Prefaces to these books contain much useful information: see\nTHIS LINK\n.\nMilnor's current interest is dynamics, especially holomorphic dynamics. His work in dynamics is summarised by Peter Makienko in his review of\n[\n9\n]\n:-\nIt is evident now that low-dimensional dynamics, to a large extent initiated by Milnor's work, is a fundamental part of general\ndynamical systems\ntheory. Milnor cast his eye on dynamical systems theory in the mid-\n1970\ns. By that time the\nSmale\nprogram in dynamics had been completed. Milnor's approach was to start over from the very beginning, looking at the simplest nontrivial families of maps. The first choice, one-dimensional dynamics, became the subject of his joint paper with\nThurston\n. Even the case of a unimodal map, that is, one with a single critical point, turns out to be extremely rich. This work may be compared with\nPoincaré\n's work on circle diffeomorphisms, which\n100\nyears before had inaugurated the qualitative theory of dynamical systems. Milnor's work has opened several new directions in this field, and has given us many basic concepts, challenging problems and nice theorems.\nMilnor has received many awards and honours for his extraordinarily important contributions. He received the National Medal of Science in\n1967\nand was elected a member of the\nNational Academy of Sciences\n, the\nAmerican Academy of Arts and Science\n. He is a member of the American Philosophy Society and has played a major role in the\nAmerican Mathematical Society\n. In August\n1982\nMilnor received the Leroy P Steele Prize:-\n...for a paper of fundamental and lasting importance, 'On manifolds homeomorphic to the\n7\n-sphere', Annals of Mathematics\n64\n(1956)\n,\n399\n-\n405\n.\nHe received the Wolf Prize\n(1989)\n, the Leroy P Steele Prize for Mathematical Exposition\n(2004)\n, the Leroy P Steele Prize for Lifetime Achievement\n(2011)\n, the\nAbel\nPrize\n(2011)\nand in\n2014\nwas made a Fellow of the\nAmerican Mathematical Society\n.\nSee extracts from the citations for the various prizes which he has won at\nTHIS LINK\n.\nMilnor has written eight important books:\nMorse theory\n(1963)\n;\nLectures on the h-cobordism theorem\n(1965)\n;\nTopology from the differentiable viewpoint\n(1965)\n;\nSingular points of complex hypersurfaces\n(1968)\n;\nIntroduction to algebraic K-theory\n(1971)\n;\n(\nwith Dale Husemoller\n)\nSymmetric bilinear forms\n(1973)\n;\n(\nwith James D Stasheff\n)\nCharacteristic classes\n(1974)\n; and\nDynamics in one complex variable\n(1999)\n.\nFor extracts from reviews of these books and of the seven volumes of Milnor's papers that have been published, and for Milnor's Prefaces to these books  see\nTHIS LINK\n.\nAmong the many services he has rendered to mathematics is editorial work, being editor of the\nAnnals of Mathematics\nfrom\n1962\n. Since\n1988\nhe has been at the State University of New York at Stony Brook. There were several reasons for moving there, one being\nDusa McDuff\nwith whom Milnor had been friends for many years and eventually married. She had been appointed to the University of Warwick in\n1976\nbut resigned her tenured post there two years later and accepted an untenured post at the State University of New York at Stony Brook so that she could be close to Milnor.\nDusa McDuff\nwrote:-\nI was influenced by the clarity of Jack Milnor's ideas and approach to mathematics, and was helped by his encouragement. I kept my job in Stony Brook, even though it meant a long commute to Princeton and a weekend relationship, since it was very important to me not to compromise on my job as my mother had done. After several years, I married Jack and had a ... child.\nMilnor said\n[\n14\n]\n:-\nI felt that the Institute\n[\nfor Advanced Study\n]\nwas a wonderful place to spend some years, but for me it was, perhaps, not a good place to spend my life. I was too isolated, in a way. I think the contact with young people and students and having more continuity was important to me, so I was happy to find a good position in Stony Brook. There were also domestic reasons: my wife was at Stony Brook and commuting back and forth, which worked very well until our son got old enough to talk. Then he started complaining loudly about it.\nFinally we note Milnor's hobbies\n[\n14\n]\n:-\nI like to relax by reading science fiction or other silly novels. I certainly used to love mountain climbing, although I was never an expert. I have also enjoyed skiing. Again I was not an expert, but it was something I enjoyed doing. ... I enjoy music but I don't have a refined musical ear or a talent for it.",
  "matematicos_citados_na_biografia": [
    "Albert Tucker",
    "Karol Borsuk",
    "Ralph Fox",
    "R H Fox",
    "John Nash",
    "Nash",
    "Israel Herstein",
    "Fields",
    "Fields Medal",
    "Todd",
    "Steenrod",
    "Hopf",
    "THIS LINK",
    "dynamical systems",
    "Smale",
    "Thurston",
    "Poincaré",
    "National Academy of Sciences",
    "American Academy of Arts and Science",
    "American Mathematical Society",
    "Abel",
    "Dusa McDuff"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}