{
  "nome_completo": "John Scott Russell",
  "nome_curto": "John Scott Russell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Russell_Scott/",
  "data_nascimento": "9 May 1808",
  "local_nascimento": "Parkhead, near Glasgow, Scotland",
  "data_morte": "8 June 1882",
  "local_morte": "Ventnor, Isle of Wight, England",
  "summary": "John Scott Russell was a Scottish engineer and naval architect best known for his identification of a solitary wave: a precursor of today's solitons.",
  "biografia": "John Scott Russell\n's father was the Rev David Russell\n(1785\n-\n1868)\nwas a parish school teacher and a graduate of Glasgow University. His mother was  Agnes Clarke Scott. He was her only child. Agnes, who married David Russell in Dublin, Ireland, died when John Scott Russell was very young. When John was three years old, his father became minister of Colinsburgh Relief Church, near Kirkcaldy, a congregation which had seceded from the Church of Scotland; but he soon moved on to a larger congregation in Hawick, and married Anne Titterton\n(1787\n-\n1861)\non\n28\nApril\n1812\nin Kilconquhar, Fife and had more children. Later, he moved again, to Errol, near Perth.\nJohn Scott Russell was primarily an engineer and naval architect, rather than a mathematician; but his name is well-known to applied mathematicians today through his experimental discovery of the 'solitary wave'. This is now recognised as a fundamental ingredient in the theory of 'solitons', applicable to a wide class of nonlinear partial differential equations.\nJohn spent just one year at St Andrews University, before transferring to Glasgow University; there, he first added his mother's name, Scott, to his own. He graduated in\n1825\n, aged\n17\n. In\n1825\n, he moved to Edinburgh, where he taught mathematics at a 'South Academy', perhaps founded by himself and a friend. Later, he also taught at the Leith Mechanics Institute, and gave courses on mathematics and natural philosophy to medical students, under the auspices of the Royal College of Surgeons. During\n1832\n-\n33\n, following the death of\nJohn Leslie\n, he substituted for the professor of natural philosophy at Edinburgh University; but he did not apply for the vacant post, which he was sure would go to David Brewster. In fact, the successful candidate was the\n23\nyear-old James D Forbes, who had strong political and academic supporters. In\n1838\n, Russell was an unsuccessful applicant for the chair of Mathematics, which\nPhilip Kelland\nsecured.\nJohn Scott Russell married Henrietta Osbourne in\n1836\n. Henrietta was born in Ireland about\n1809\nand died in Ventnor, Isle of Wight on\n9\nOctober\n1888\n. They had children Norman, Louisa, Mary and Alice.\nIn the\n1830\ns Russell developed a prototype passenger-carrying steam carriage, but it met with opposition from the road trustees, and the venture failed. He had more success with the Union Canal Company, investigating the feasability of steam-powered canal transport and studying the connection between resistance to motion and wave-generation. He spoke of his work at early meetings of the\nBritish Association for the Advancement of Science\n, founded in\n1831\n; and the Association appointed him and Sir John Robison of Edinburgh to a 'Committee on Waves' to conduct observations and experiments. A substantial report by Robison and Russell appeared in\n1837\nand Russell alone wrote his major\nReport on Waves\n(1844)\nfollowing Robison's death in\n1843\n. These reports, in fact all Russell's own work, contain a remarkable series of observations, at sea, in rivers and canals, and in Russell's own wave tank constructed for the purpose. There, Russell's \"Great Wave of Translation\" is described in detail.\nRussell's experimental work helped to stimulate a revival in theoretical hydrodynamics in Britain.\nGeorge Green\n,\nGeorge Airy\n,\nPhilip Kelland\nand Samuel Earnshaw all attempted theoretical descriptions of the solitary wave, but these were not successful.\nAiry\nobjected to the emphasis placed by Russell on his \"Great Primary Wave\", wrongly arguing that it was neither great nor primary, but just one consequence of the linear shallow water theory which he\n(\nAiry\n)\nhad given.\nG G Stokes\nwas more cautious, but he also doubted that the solitary wave could propagate without change in form. A correct approximate theory was at last given by\nBoussinesq\n(1871)\nand\nRayleigh\n(1876)\n; but the issue was not really settled until the appearance of the important paper by\nKorteweg\nand\nde Vries\n(1895)\n. The full significance of the solitary wave and its generalisation was finally uncovered in\n1965\n: see\n[\n4\n]\nand\n[\n5\n]\n.\nAfter working for a shipbuilder in Greenock, Russell moved to London in\n1844\n, with his wife and two young children. He first worked on a railway magazine, and he became secretary of the Society of Arts, a post which led to major involvement in planning the Great Exhibition of\n1851\n. Thereafter, he became increasingly involved in the design of yachts, boats, barges and ships, and he became a director of a ship-building company. He collaborated with Isambard Kingdom Brunel on the construction of the pioneering iron vessels Great Britain and Great Eastern; and was alone responsible for the successful iron warship Warrior.\nIn the\n1860\ns, Russell's reputation suffered a number of setbacks from which it never recovered. He became embroiled in a lengthy financial dispute about an armaments contract; the Great Eastern suffered a serious breakdown; and he was controversially expelled from the Institute of Civil Engineers. His major published work,\nThe Modern System of Naval Architecture\n, appeared in\n1865\n. Much later, he revisited his work on solitary waves, published posthumously as\nThe Wave of Translation in the Oceans of Water, Air and Ether\n(1885)\n.\nEmmerson's biography of Russell\n[\n1\n]\ndeals authoritatively with his contributions of naval architecture, concluding that\nRussell's great love was applied science, and it was perverse fate which channelled him into complicating it with the economic cares of a large and uncertain business... He was a great patriot and he sought to serve great ends in the national interest... He was not embittered by the shabby treatment he received from fate, from his fellows or from his country.",
  "matematicos_citados_na_biografia": [
    "John Leslie",
    "Philip Kelland",
    "British Association for the Advancement of Science",
    "George Green",
    "George Airy",
    "Airy",
    "G G Stokes",
    "Boussinesq",
    "Rayleigh",
    "Korteweg",
    "de Vries"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}