{
  "nome_completo": "Jean Baptiste Joseph Fourier",
  "nome_curto": "Joseph Fourier",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fourier/",
  "data_nascimento": "21 March 1768",
  "local_nascimento": "Auxerre, Bourgogne, France",
  "data_morte": "16 May 1830",
  "local_morte": "Paris, France",
  "summary": "Joseph Fourier studied the mathematical theory of heat conduction. He established the partial differential equation governing heat diffusion and solved it by using infinite series of trigonometric functions.",
  "biografia": "Joseph Fourier\n's father was a tailor in Auxerre. After the death of his first wife, with whom he had three children, he remarried and Joseph was the ninth of the twelve children of this second marriage. Joseph's mother died went he was nine years old and his father died the following year.\nHis first schooling was at Pallais's school, run by the music master from the cathedral. There Joseph studied Latin and French and showed great promise. He proceeded in\n1780\nto the École Royale Militaire of Auxerre where at first he showed talents for literature but very soon, by the age of thirteen, mathematics became his real interest. By the age of\n14\nhe had completed a study of the six volumes of\nBézout\n's\nCours de mathématiques\n. In\n1783\nhe received the first prize for his study of\nBossut\n's\nMécanique en général\nⓉ\n(\nGeneral mechanics\n)\n.\nIn\n1787\nFourier decided to train for the priesthood and entered the Benedictine abbey of St Benoit-sur-Loire. His interest in mathematics continued, however, and he corresponded with C L Bonard, the professor of mathematics at Auxerre. Fourier was unsure if he was making the right decision in training for the priesthood. He submitted a paper on algebra to\nMontucla\nin Paris and his letters to Bonard suggest that he really wanted to make a major impact in mathematics. In one letter Fourier wrote\nYesterday was my\n21\nst  birthday, at that age\nNewton\nand\nPascal\nhad already acquired many claims to immortality.\nFourier did not take his religious vows. Having left St Benoit in\n1789\n, he visited Paris and read a paper on algebraic equations at the\nAcadémie Royale des Sciences\n. In\n1790\nhe became a teacher at the Benedictine college, École Royale Militaire of Auxerre, where he had studied. Up until this time there had been a conflict inside Fourier about whether he should follow a religious life or one of mathematical research. However in\n1793\na third element was added to this conflict when he became involved in politics and joined the local Revolutionary Committee. As he wrote:-\nAs the natural ideas of equality developed it was possible to conceive the sublime hope of establishing among us a free government exempt from kings and priests, and to free from this double yoke the long-usurped soil of Europe. I readily became enamoured of this cause, in my opinion the greatest and most beautiful which any nation has ever undertaken.\nCertainly Fourier was unhappy about the Terror which resulted from the French Revolution and he attempted to resign from the committee. However this proved impossible and Fourier was now firmly entangled with the Revolution and unable to withdraw. The revolution was a complicated affair with many factions, with broadly similar aims, violently opposed to each other. Fourier defended members of one faction while in Orléans. A letter describing events relates:-\nCitizen Fourier, a young man full of intelligence, eloquence and zeal, was sent to Loiret. ... It seems that Fourier ... got up on certain popular platforms. He can talk very well and if he put forward the views of the Society of Auxerre he has done nothing blameworthy...\nThis incident was to have serious consequences but after it Fourier returned to Auxerre and continued to work on the revolutionary committee and continued to teach at the College. In July\n1794\nhe was arrested, the charges relating to the Orléans incident, and he was imprisoned. Fourier feared the he would go to the guillotine but, after Robespierre himself went to the guillotine, political changes resulted in Fourier being freed.\nLater in\n1794\nFourier was nominated to study at the École Normale in Paris. This institution had been set up for training teachers and it was intended to serve as a model for other teacher-training schools. The school opened in January\n1795\nand Fourier was certainly the most able of the pupils whose abilities ranged widely. He was taught by\nLagrange\n, who Fourier described as\nthe first among European men of science,\nand also by\nLaplace\n, who Fourier rated less highly, and by\nMonge\nwho Fourier described as\nhaving a loud voice and is active, ingenious and very learned.\nFourier began teaching at the Collège de France and, having excellent relations with\nLagrange\n,\nLaplace\nand\nMonge\n, began further mathematical research. He was appointed to a position at the École Centrale des Travaux Publics, the school being under the direction of\nLazare Carnot\nand\nGaspard Monge\n, which was soon to be renamed École Polytechnique. However, repercussions of his earlier arrest remained and he was arrested again and imprisoned. His release has been put down to a variety of different causes, pleas by his pupils, pleas by\nLagrange\n,\nLaplace\nor\nMonge\nor a change in the political climate. In fact all three may have played a part.\nBy\n1\nSeptember\n1795\nFourier was back teaching at the École Polytechnique. In\n1797\nhe succeeded\nLagrange\nin being appointed to the chair of analysis and mechanics. He was renowned as an outstanding lecturer but he does not appear to have undertaken original research during this time.\nIn\n1798\nFourier joined Napoleon's army in its invasion of Egypt as scientific adviser.\nMonge\nand\nMalus\nwere also part of the expeditionary force. The expedition was at first a great success. Malta was occupied on\n10\nJune\n1798\n, Alexandria taken by storm on\n1\nJuly, and the delta of the Nile quickly taken. However, on\n1\nAugust\n1798\nthe French fleet was completely destroyed by Nelson's fleet in the Battle of the Nile, so that Napoleon found himself confined to the land that he was occupying. Fourier acted as an administrator as French type political institutions and administration was set up. In particular he helped establish educational facilities in Egypt and carried out archaeological explorations.\nWhile in Cairo Fourier helped found the Cairo Institute and was one of the twelve members of the mathematics division, the others included\nMonge\n,\nMalus\nand Napoleon himself. Fourier was elected secretary to the Institute, a position he continued to hold during the entire French occupation of Egypt. Fourier was also put in charge of collating the scientific and literary discoveries made during the time in Egypt.\nNapoleon abandoned his army and returned to Paris in\n1799\n, he soon held absolute power in France. Fourier returned to France in\n1801\nwith the remains of the expeditionary force and resumed his post as Professor of Analysis at the École Polytechnique. However Napoleon had other ideas about how Fourier might serve him and wrote:-\n... the Prefect of the Department of Isère having recently died, I would like to express my confidence in citizen Fourier by appointing him to this place.\nFourier was not happy at the prospect of leaving the academic world and Paris but could not refuse Napoleon's request. He went to Grenoble where his duties as Prefect were many and varied. His two greatest achievements in this administrative position were overseeing the operation to drain the swamps of Bourgoin and supervising the construction of a new highway from Grenoble to Turin. He also spent much time working on the\nDescription of Egypt\nwhich was not completed until\n1810\nwhen Napoleon made changes, rewriting history in places, to it before publication. By the time a second edition appeared every reference to Napoleon would have been removed.\nIt was during his time in Grenoble that Fourier did his important mathematical work on the theory of heat. His work on the topic began around\n1804\nand by\n1807\nhe had completed his important memoir\nOn the Propagation of Heat in Solid Bodies\n. The memoir was read to the Paris Institute on\n21\nDecember\n1807\nand a committee consisting of\nLagrange\n,\nLaplace\n,\nMonge\nand\nLacroix\nwas set up to report on the work. Now this memoir is very highly regarded but at the time it caused controversy.\nThere were two reasons for the committee to feel unhappy with the work. The first objection, made by\nLagrange\nand\nLaplace\nin\n1808\n, was to Fourier's expansions of functions as trigonometrical series, what we now call Fourier series. Further clarification by Fourier still failed to convince them. As is pointed out in\n[\n4\n]\n:-\nAll these are written with such exemplary clarity - from a logical as opposed to calligraphic point of view - that their inability to persuade\nLaplace\nand\nLagrange\n... provides a good index of the originality of Fourier's views.\nThe second objection was made by\nBiot\nagainst Fourier's derivation of the equations of transfer of heat. Fourier had not made reference to\nBiot\n's\n1804\npaper on this topic but\nBiot\n's paper is certainly incorrect.\nLaplace\n, and later\nPoisson\n, had similar objections.\nThe Institute set as a prize competition subject the propagation of heat in solid bodies for the\n1811\nmathematics prize. Fourier submitted his\n1807\nmemoir together with additional work on the cooling of infinite solids and terrestrial and radiant heat. Only one other entry was received and the committee set up to decide on the award of the prize,\nLagrange\n,\nLaplace\n,\nMalus\n, Haüy and\nLegendre\n, awarded Fourier the prize. The report was not however completely favourable and states:-\n... the manner in which the author arrives at these equations is not exempt of difficulties and that his analysis to integrate them still leaves something to be desired on the score of generality and even rigour.\nWith this rather mixed report there was no move in Paris to publish Fourier's work.\nWhen Napoleon was defeated and on his way to exile in Elba, his route should have been through Grenoble. Fourier managed to avoid this difficult confrontation by sending word that it would be dangerous for Napoleon. When he learnt of Napoleon's escape from Elba and that he was marching towards Grenoble with an army, Fourier was extremely worried. He tried to persuade the people of Grenoble to oppose Napoleon and give their allegiance to the King. However as Napoleon marched into the town by one gate Fourier left in haste by another.\nNapoleon was angry with Fourier whom he had hoped would welcome his return. Fourier was able to talk his way into favour with both sides and Napoleon made him Prefect of the Rhône. However Fourier soon resigned on receiving orders, possibly from\nCarnot\n, that the was to remove all administrators with royalist sympathies. He could not have completely fallen out with Napoleon and\nCarnot\n, however, for on\n10\nJune\n1815\n, Napoleon awarded him a pension of\n6000\nfrancs, payable from\n1\nJuly. However Napoleon was defeated on\n1\nJuly and Fourier did not receive any money. He returned to Paris.\nFourier was elected to the\nAcadémie des Sciences\nin\n1817\n. In\n1822\nDelambre\n, who was the Secretary to the mathematical section of the\nAcadémie des Sciences\n, died and Fourier together with\nBiot\nand\nArago\napplied for the post. After\nArago\nwithdrew the election gave Fourier an easy win. Shortly after Fourier became Secretary, the\nAcadémie\npublished his prize winning essay\nThéorie analytique de la chaleur\nin\n1822\n. This was not a piece of political manoeuvring by Fourier however since\nDelambre\nhad arranged for the printing before he died.\nDuring Fourier's eight last years in Paris he resumed his mathematical researches and published a number of papers, some in pure mathematics while some were on applied mathematical topics. His life was not without problems however since his theory of heat still provoked controversy.\nBiot\nclaimed priority over Fourier, a claim which Fourier had little difficulty showing to be false. Poisson, however, attacked both Fourier's mathematical techniques and also claimed to have an alternative theory. Fourier wrote\nHistorical Précis\nⓉ\n(\nHistorical summary\n)\nas a reply to these claims but, although the work was shown to various mathematicians, it was never published.\nFourier's views on the claims of\nBiot\nand\nPoisson\nare given in the following, see\n[\n4\n]\n:-\nHaving contested the various results\n[\nBiot\nand\nPoisson\n]\nnow recognise that they are exact but they protest that they have invented another method of expounding them and that this method is excellent and the true one. If they had illuminated this branch of physics by important and general views and had greatly perfected the analysis of\npartial differential equations\n, if they had established a principal element of the theory of heat by fine experiments ... they would have the right to judge my work and to correct it. I would submit with much pleasure .. But one does not extend the bounds of science by presenting, in a form said to be different, results which one has not found oneself and, above all, by forestalling the true author in publication.\nFourier's work provided the impetus for later work on trigonometric series and the theory of functions of a real variable.",
  "matematicos_citados_na_biografia": [
    "Bézout",
    "Bossut",
    "Montucla",
    "Newton",
    "Pascal",
    "Académie Royale des Sciences",
    "Lagrange",
    "Laplace",
    "Monge",
    "Lazare Carnot",
    "Gaspard Monge",
    "Malus",
    "Lacroix",
    "Biot",
    "Poisson",
    "Legendre",
    "Carnot",
    "Académie des Sciences",
    "Delambre",
    "Arago",
    "Académie",
    "partial differential equations"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}