{
  "nome_completo": "Józef Puzyna",
  "nome_curto": "Józef Puzyna",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puzyna/",
  "data_nascimento": "19 March 1856",
  "local_nascimento": "Nowy Martynów, Galicia, Austrian Empire (now Martynów Nowy Ukraine)",
  "data_morte": "31 March 1919",
  "local_morte": "Stańków, Poland (now Stankiv, Ukraine)",
  "summary": "Józef Puzyna is considered as a precursor of the Lwów School of Mathematics. His book (1898 - 1900) on the theory of analytic functions in two volumes was the first Polish mathematical book that used the language of set theory.",
  "biografia": "Józef Puzyna\nwas the son of Włodzimierz Antoni Ezekiel\n(1825\n-\n1896)\n, prince of Puzyna, and his wife Felicja Rucka\n(1825\n-\n1899)\nof Jastrzębiec. The Puzyna family could trace their roots back to the Rurik dynasty of the\n13\nth century. Andrej Kotljarchuk writes\n[\n14\n]\n:-\n... one branch of the old Ruthenian Prince family of the Puzyna had settled down in the district of Upyté. During the\n17\nth century, this branch of the family converted to Calvinism and assimilated with its ethnically non-Slavic neighbours. Another branch of the Puzyna, which settled among the Ruthenians, resisted polonization and preserved its East Slavic identity. In mid-\n17\nth century, the head of this branch, Afanasiusz Puzyna, became Orthodox bishop of Lutsk. Later, members of the Puzyna family would take part in three different national movements\n(\nLithuanian, Belarusian and Ukrainian\n)\n. Jonas Puzinas became a prominent Lithuanian archaeologist.\nWłodzimierz was a wealthy landowner directly descended from Jan Puzyna, the brother of the Orthodox bishop of Lutsk, who converted to become a Roman Catholic after his marriage. Włodzimierz and his wife Felicja had three daughters and one son: Kazimiera Józefa Oktawia Puzyna\n(\nborn\n1855)\n, Józef Puzyna\n(\nthe subject of this biography, born\n1856)\n, Izabella Ścibor-Rylska\n(\nborn\n1857)\nand Antonina Puzyna\n(\nborn\n1862)\n.\nJózef Puzyna was brought up in Galicia which at that time was part of the Austrian Empire. Although Austria had Germanised the region from\n1800\n, it was granted autonomy in\n1867\nwith schools and Lwów University allowed to teach in Polish. The Franz Joseph Gymnasium had been established in around\n1850\nby Agenor Romuald Gołuchowski, a member of the Austrian parliament, Minister of Interior, and Governor of Galicia, who was an advisor to Emperor Franz Joseph. The Polish language was the language of instruction when Puzyna studied there. He graduated in\n1875\nand, later that year, began his studies in the Philosophy Faculty of Lwów University. He attended lectures on mathematics, physics, chemistry and philosophy but his main interests were in mathematics and physics. He attended lectures on mathematics from\nWawrzyniec Żmurko\n(1824\n-\n1889)\nand on applied mathematics by\nOskar Fabian\n(1846\n-\n1899)\n. He attended experimental physics courses taught by Tomasz Stanecki\n(1826\n-\n1891)\n, and philosophy lectures by Euzebiusz Czerkawski\n(1822\n-\n1896)\nwho, in addition to his work in philosophy, was a leading educational reformer. He was also taught psychology and natural philosophy by Julian Ochorowicz\n(1850\n-\n1917)\n.\nArmy service was required and Puzyna took the academic year\n1877\n-\n78\naway from his studies to spend it in the Austrian army. At the end of the year he was given the rank of reserve lieutenant and was able to return to Lwów University to complete his studies. He was working towards two qualifications, first to gain the qualifications required so that he could teach in a Gymnasium but he also wanted to be in a position to be able to complete the requirements for a doctorate. After taking written examinations on pedagogy, mathematics and physics, he was awarded his teaching certificate on\n1\nJune\n1882\n. He was already undertaking research towards his doctorate advised by\nŻmurko\nbut while completing this he took on a teaching post at a Gymnasium in Lwów. He submitted his thesis\nO pozornie dwuwartościowych określonych całkach podwójnych\nⓉ\n(\nOn apparently two-valued definite double integrals\n)\nwhich was examined by\nWawrzyniec Żmurko\nand\nOskar Fabian\n. In his thesis he investigated the dependence of the double integral on the order of integration. He took examinations in mathematics and physics on\n2\nDecember\n1882\nand philosophy on\n2\nJuly\n1883\n, all of which he passed as \"excellent\". Having completed the formalities successfully, Puzyna received the degree of doctor of philosophy on\n5\nJuly\n1883\n.\nIn\n1883\nPuzyna was awarded a scholarship which enabled him to study abroad. He sought advice from\nŻmurko\nabout the best place to go to further his studies and\nŻmurko\nsuggested that Berlin would be best. Puzyna spent the academic year\n1883\n-\n84\nin Berlin where he attended lectures by many world leading mathematicians. Among the mathematicians whose lectures he attended there were\nKarl Weierstrass\n,\nLeopold Kronecker\n,\nLazarus Fuchs\n,\nEduard Kummer\n,\nEugen Netto\n, Reinhold Hoppe\n(1816\n-\n1900)\n, Johannes Knoblauch\n(1855\n-\n1915)\nand\nCarl Runge\n[\n12\n]\n:-\nIn the winter semester, his main attention was given to familiarising himself with\nWeierstrass\n's theory of functions, and in the summer semester he studied new directions in geometry. At the same time, throughout the whole year, he participated in the mathematics seminar, which was led in the first half of the year by Professor\nL Kronecker\n, and in the second half by Professors\nK Weierstrass\nand\nL Kronecker\n.\nBack in Lwów after his very profitable year in Berlin, Puzyna was ready for the necessary procedure to obtain his\nhabilitation\n. He submitted two theses, the first being his doctoral thesis which by this time had been printed, and the second being the manuscript thesis\nPrzyczynek do teorii obliczenia symbolów nieoznaczonych\nⓉ\n(\nA contribution to the theory of computing indefinite symbols\n)\n. He was also asked to submit a list of courses which he had prepared and his list consisted of: New methods in analytical geometry; Synthetic geometry; and Applications of infinitesimal calculus in geometry. He explained that in the first of these he would introduce the general methods of\nJulius Plücker\n's theory of algebraic curves and surfaces, in the second he would explain\nJakob Steiner\n's geometric methods, and in the third he would examine properties of geometric bodies from the point of view of curvature on the basis of the differential calculus. Puzyna's habilitation examination was held on\n11\nDecember\n1884\nand the questioning was led by\nŻmurko\n. Having successfully passed this examination, he proceeded to the habilitation lecture which he gave on\n15\nDecember\n1884\nwith title\nOn Euler's integrals\n.\nPuzyna began lecturing at the Lwów University in\n1885\nas a\ndocent\n. On\n20\nJuly\n1888\nhe married Janina Chojecka\n(1870\n-\n1940)\n, the daughter of Stanisław Chojecki\n(1821\n-\n1911)\nand Klementyna Siemieńska\n(1841\n-\n1921)\n, in Kraków. Józef and Janina Puzyna had three daughters and one son, Antonina Puzyna, born in Lwów in either\n1889\nor\n1890\n, Anna Puzyna, born in Lwów on\n23\nSeptember\n1891\n, Maria Puzyna\n(1892\n-\n1976)\n, born in Lwów on\n27\nSeptember\n1892\n, and Stefan Puzyna, born on\n11\nAugust\n1899\nin Lwów.\nIn\n1889\nPuzyna was promoted to extraordinary professor and made temporary Head of the Department of Mathematics at Lwów University following the death of\nWawrzyniec Żmurko\n. In\n1892\nhe became a full professor and his role as Head of the Department of Mathematics at Lwów University was confirmed. Up until\n1888\nhe had only published one paper, being his doctoral thesis. In\n1888\n, however, he published three papers:\nO zastosowaniu uogólnionych form interpolacyjnych Lagrange'a\nⓉ\n(\nOn the application of Lagrange's generalized interpolation forms\n)\n;\nO tak zwanych miejscach skupienia i ich zastosowaniu w Analizie\nⓉ\n(\nOn the so-called concentration places and their application in Analysis\n)\n; and\nZ Analizy\nⓉ\n(\nFrom Analysis\n)\n. By\n1898\nhe had published fifteen papers but in that year he published the first volume of his most famous work, the\n2\n-volume book\nTeorya funkcyj analitycznych\nⓉ\n(\nTheory of analytic functions\n)\n. Mykhailo Zarichnyi writes\n[\n23\n]\n:-\nPuzyna worked mostly in complex analysis. His monograph on the theory of analytic functions in two volumes was the first Polish mathematical book that used the language of set theory.\nFamous mathematicians\nStanisław Saks\nand\nAntony Zygmund\nhighly praised Puzyna's monograph, considering it a real encyclopaedia of analysis, which, in addition to the contemporary exposition of the theory of analytic functions, contained information from the field of set theory and set-theoretic topology, group theory, algebra, differential equations, and harmonic functions.\nActually, Puzyna's book was the first attempt to teach a course in the theory of analytic functions based on set theory. One of the initial chapters of the book was devoted to the foundations of this theory, as well as some fundamental concepts of set-theoretic topology\n(\naccumulation point, derivative, compactness, connectedness, etc.\n)\n. Examples of subsets of the set of real numbers with predetermined properties of the transfinite derivative\n(\nnecessary for countable ordinal numbers\n)\nwere presented.\nHowever, later in the book, Puzyna changes the style of exposition of the material: the chapters on the topology of surfaces are actually written without the use of language of set theory. The author mostly relies on an intuitive-visual argument.\nIn fact, in Puzyna's book we observe a certain eclecticism, a combination of both the set-theoretical and the visual-intuitive approach. The latter corresponds to\nPoincaré\n's philosophical views: the basis of mathematics is intuition, and not everything in mathematics lends itself to formalisation and analytical exposition. When explaining the theory of surfaces, Puzyna appeals to the reader's geometric intuition and uses rich illustrative material. Note that a systematic presentation of the theory of surfaces based on set-theoretic topology would hardly be possible at that time, as it needed systematic development of the necessary topological apparatus, primarily homeomorphisms and deformations\n(\nhomotopies\n)\n.\nPuzyna had several important roles in Lwów University. He was dean of the Faculty of Philosophy in\n1898\n-\n90\n, rector of the University in\n1904\n-\n05\nand vice-rector in\n1905\n-\n06\n. As a teacher of mathematics he played a very important role. Stanisław Domoradzki writes in\n[\n3\n]\n:-\nAs a professor, Puzyna always encouraged his students to work independently but was happy to support them with advice and guidance. His approachability, kindness and other personal qualities made students fell as if they were in the presence of a senior colleague, not a professor or a superior. It was only in closer contact with Puzyna that the richness of his nature was revealed. The simplicity and helpfulness characteristic of profound minds made him closer to his listeners, but much more than that. His lectures, always prepared in detail, attracted many students.\nHe lectured on a wide range of topics. Courses he taught included: Modern Methods of Analytic Geometry\n(\nfrom\n1885)\n; Modern Geometry I\n(\nfrom\n1885\n-\n86)\n; Modern Geometry II\n(\nfrom\n1886)\n; Modern Geometry III\n(\nfrom\n1901)\n; Theory of Analytic Functions\n(\nfrom\n1886\n-\n87)\n; Theory of Elliptic Functions\n(\nfrom\n1887\n-\n88)\n; Theory of Abelian Functions\n(\nfrom\n1888\n-\n89)\n; Differential Calculus and An Introduction to Analysis\n(\nfrom\n1889\n-\n90)\n; Analytic Geometry on Surfaces\n(\nfrom\n1889\n-\n90)\n; Integral Calculus\n(\nfrom\n1890\n-\n91)\n; Theory of Numbers I\n(\nfrom\n1891\n-\n92)\n; Theory of Substitutions\n(\nfrom\n1892)\n;\n[\nCalculus of commutativity\n(\nfrom\n1893)\n; Differential Geometry\n(\nfrom\n1902\n-\n03)\n; Invariants\n(\nfrom\n1908\n-\n09)\n; Functions of Polyhedrons, Modular and Elliptic\n(\nfrom\n1908\n-\n09)\n; Integration of Differential Equations\n(\nfrom\n1910)\n; Conformal Mapping\n(\nfrom\n1910)\n;\nFredholm\n's Equations\n(\nfrom\n1908)\n; Some Problems of Algebra; Spatial Analytic Geometry; Lie Differential Equations; On the History of Mathematics; The\nMittag-Leffler\nStars; Non-Euclidean Geometry; Partial Differential Equations; Algebraic Curves; and Linear Differential Equations.\nFor more information about courses delivered by Puzyna, see\nTHIS LINK\n.\nIn the article\n[\n16\n]\nAgnieszka Niemczynowicz and Agnieszka Bojarska-Sokołowska look at Puzyna's lectures on integral equations. They write:-\nThe beginning of the theory of integral equations as an own discipline started in the late\n19\nth and early\n20\nth century with the work of\nVolterra\n,\nFredholm\nand\nHilbert\n. The lectures of Puzyna demonstrate the ideas of these pioneers. Puzyna's goal was to present, in a transparent way, the complete theory of the integral equations which was known at that time. With this aim he mixed different methods to solve integral equations.\n...\nComparing the framework of Puzyna's lecture on integral equations with any modern lectures, we can notice, that his lecture was an introduction to the theory of integral equations mainly based on work of\nFredholm\n. From the historical point of view the\nFredholm\n's method was many years ahead of its time and had one of the most famous follower who was\nD Hilbert\n. We can notice\nHilbert\n's influence in Puzyna's lecture and in the concept of the modern theory of integral equations as well.\nPuzyna did not have it easy as Head of the Department of Mathematics. For some years the only other professor was Jan Rajewski\n(1857\n-\n1906)\nwho had also been awarded a doctorate from Lwów and had been appointed as a professor in\n1900\n. Rajewski, however, had severe health problems and, by\n1904\n, he was on long-term health leave. For a while Puzyna had to attempt to teach a full course of mathematics on his own. He was successful, however, in building up a strong department bringing outstanding mathematicians such as\nWacław Sierpiński\nto his department. He gathered round him some exceptionally talented people such as\nZygmunt Janiszewski\nand\nStefan Mazurkiewicz\n. He taught\nHugo Steinhaus\n,\nOtton Nikodym\n,\nStanisław Leśniewski\n,\nFranciszek Leja\n,\nVolodymyr Levytsky\n, Antoni Łomnicki\n(1881\n-\n1941)\nand\nStanisław Ruziewicz\n. There were no Polish mathematics congresses during Puzyna's lifetime but he attended the Mathematical Section of the\n11\nth Congress of Polish Physicists and Naturalists in Kraków in\n1911\n. Also at this Congress were a number of mathematician we have just mentioned such as\nJaniszewski\n,\nSierpiński\nand\nSteinhaus\n.\nIn\n[\n3\n]\nwe are told about some of Puzna's interests outside mathematics:-\nHe had broad musical interests, was a great pianist and admirer of Wagner's music, and it is worth emphasising both his broad interests in the humanities and in the field of management and in running a farm. His estate in Stańków in Stryi district was known for its excellence in Galicia.\nThe last few years of Puzyna's life were very difficult due to World War I. The area where he lived was occupied by the Russians from October\n1914\nbut fierce fighting continued there. It became part of the short-lived West Ukrainian People's Republic in\n1918\nand Puzyna died there in March\n1919\nonly a few weeks before it was annexed by Poland. He was buried in the cemetery in Stryi close to where he lived in the village of Stanków, now Stankiv in Ukraine.",
  "matematicos_citados_na_biografia": [
    "Wawrzyniec Żmurko",
    "Oskar Fabian",
    "Żmurko",
    "Karl Weierstrass",
    "Leopold Kronecker",
    "Lazarus Fuchs",
    "Eduard Kummer",
    "Eugen Netto",
    "Carl Runge",
    "Weierstrass",
    "L Kronecker",
    "K Weierstrass",
    "habilitation",
    "Julius Plücker",
    "Jakob Steiner",
    "docent",
    "Stanisław Saks",
    "Antony Zygmund",
    "Poincaré",
    "Fredholm",
    "Mittag-Leffler",
    "THIS LINK",
    "Volterra",
    "Hilbert",
    "D Hilbert",
    "Wacław Sierpiński",
    "Zygmunt Janiszewski",
    "Stefan Mazurkiewicz",
    "Hugo Steinhaus",
    "Otton Nikodym",
    "Stanisław Leśniewski",
    "Franciszek Leja",
    "Volodymyr Levytsky",
    "Stanisław Ruziewicz",
    "Janiszewski",
    "Sierpiński",
    "Steinhaus"
  ],
  "imagens": [
    "puzyna.jpg"
  ]
}