{
  "nome_completo": "Juan Jorge Schäffer",
  "nome_curto": "Juan Jorge Schäffer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schaffer/",
  "data_nascimento": "10 March 1930",
  "local_nascimento": "Vienna, Austria",
  "data_morte": "12 February 2017",
  "local_morte": "Pittsburgh, Pennsylvania, USA",
  "summary": "Juan Jorge Schäffer was born in Austria, became a citizen of Uruguay where he had most of his schooling and undergraduate studies, and worked at Carnegie Mellon University in Pittsburgh, USA from 1968 . His outstanding research papers on functional analysis and ordinary differential equations made important contributions to the development of mathematics in Uruguay.",
  "biografia": "Juan Jorge Schäffer\nwas the son of Daniel Schäffer\n(1890\n-\n)\nand Margarethe Lang\n(1900\n-\n1991)\n. The first thing we must make clear is that Juan Jorge Schäffer was the name that he made official when he became a citizen of Uruguay but at birth he was given the name\nHans Jörg Schäffer\n. We shall use Juan Jorge throughout this biography. Daniel Schäffer, one of four siblings, was born in Temesvár, Hungary, which is now Timișoara, Romania. He only spent eight days there before his family moved to Sofia in Bulgaria. He spoke several languages and eventually had a film distribution business in Vienna. Margarethe, Juan Jorge's mother, was known as Gretel. She was the daughter of Otto Lang and Emilia Strausky, had two elder sisters and came from a middle class background. Both sides of the family were Jewish, something which played a very major role in their lives. Daniel and Margarethe Schäffer had two children, Eva Ruth Schäffer, born in Vienna in\n1928\n, and Juan Jorge Schäffer, the subject of this biography, born two years later. Juan Jorge said that he always joked with his mother, telling her that since she was born on\n19\nJuly\n1900\n, that was in the\n19\nth century since the\n20\nth century did not begin until\n1901\n.\nIn Vienna, the Schäffer family were quite prosperous and lived in the upper storey of a two storey house with a large garden. Daniel Schäffer had good contacts abroad, particularly in Zurich, Switzerland. He loved to travel, which he had to do as part of his business, but, at this time, his wife did not enjoy travel. Juan Jorge learnt French from his parents, who insisted that he learn that language. He began his schooling in\n1936\nat a Jewish school in Vienna where he learnt Hebrew in his first year of study. His sister Eva had an accident in their home, falling down the stairs and breaking her leg. This did not seem too serious at first but it did not heal as expected. She was diagnosed with tuberculosis and was taken to hospital. She died in\n1937\nand later that year Juan Jorge went with his parents on a skiing holiday to Switzerland. Schäffer says in\n[\n11\n]\nthat they would all have died in the holocaust if his sister had lived, since no country would have taken a child with tuberculosis.\nIn March\n1938\nthe Schäffer family set off for another skiing holiday in Switzerland. They had friends in Zurich whom they visited while staying in a hotel. From Zurich they made their way by train to Arosa, a small town in the Swiss mountains where there is safe skiing and many hotels to accommodate the tourist trade. The last part of the journey from Chur to Arosa was on the metre gauge railway. Daniel and Margarethe Schäffer seemed unaware of the political situation in Austria and certainly did not expect the German invasion of Austria on\n11\nMarch\n1938\n.\nOn\n13\nMarch the Anschluss annexed Austria into the German Reich. Daniel and Margarethe decided to return to their home to see what could be salvaged and left Juan Jorge in Switzerland with their Swiss friends. Daniel returned to Vienna first, then a little later Margarethe joined him. On\n20\nApril, Margarethe left Vienna and travelled back to Switzerland via Germany with some possessions in her suitcase. Daniel was still in his Vienna home on\n1\nMay\n1938\nwhen the police arrested him as part of the persecution of Jews which began immediately after the Anschluss. Since\n1\nMay was a public holiday the police told Daniel to go home and they would return on the following day. He did not wait to be arrested, however, but took his brother's Yugoslav passport and went to the train station. Daniel and his brother were sufficiently alike that the passport photograph was good enough. He did not have money to pay for the train fare but the man in the ticket office accepted Daniel's gold watch in payment. He also had a few possessions in his suitcase but almost all they owned was left in Vienna and never seen again.\nThe family were reunited in Arosa in May\n1938\nand Juan Jorge attended a school there for a few months. In the oral history interview\n[\n11\n]\nhe said that he had problems with long division when at this school. This, he said, was the first of several problems he had with long division! In the autumn of\n1938\nthe family moved to Paris where they stayed in a little hotel near the Opera. Juan Jorge already spoke French so attending school in Paris was not a problem. He began studying at a girls' boarding school which had financial problems and was accepting boys as well as girls. It was a grand building but, because of the financial problems, the food was terrible. His parents quickly removed him and he then attended a public school near his hotel. The family certainly did not intend to stay in Paris and while there Daniel went round all the embassies trying to find a country that would accept them. The only possible country was Uruguay so the Schäffer family emigrated there on a ship from Antwerp to Montevideo. They arrived in Montevideo on\n1\nMay\n1939\n.\nIn\n[\n11\n]\nSchäffer explained that the family were allowed ashore in Montevideo while many refugees on their ship were not allowed and were sent back. He did not understand why they were lucky in being allowed to remain in Uruguay, but thought it was probably because they were Jewish and there was already a sizable Jewish community in Montevideo. Certainly the German speaking Jewish community in Montevideo helped them out by looking for accommodation for them. The family spent a few weeks in a hotel before a house was found for them to rent. It was some distance from the centre of the city but there was a good tram service to the centre. Many years later the family bought this house. Other members of their family joined them in Montevideo, Juan Jorge's grandmother an aunt arrived and lived together in a house near where the Schäffer family were living. Daniel set up an import-export business in Montevideo. Schäffer particularly remembered a notable event which happened on\n9\nSeptember\n1945\nwhen Uruguay changed from driving on the left to driving on the right.\nSchäffer had a great aptitude for languages speaking German and French fluently before arriving in Uruguay. Amazingly, he also spoke Spanish by the time he arrived having been able to learn it in the couple of weeks the ship took to sail from Antwerp to Montevideo. His first school in Montevideo was a primary school which, to educate more children, had two cohorts of pupils, one studying in the morning, the other in the afternoon. When he had difficulty with long division, he was put down a grade. Soon he was sent to the Lycée Français, the French private school located at Benigno Paiva in Buceo, Montevideo. This did not go very well since by this time France had surrendered following the German invasion and was collaborating with Germany. This meant that half the staff in the Lycée Français in Montevideo sided with the French German collaborators while half the staff were strongly opposed. Given this unpleasant situation, Schäffer's parents moved him to a British school. Two separate British schools had been founded in Montevideo in\n1908\n, one for boys and one for girls, but by the time Schäffer studied there the two school had merged. The education at this school was good and Schäffer quickly added English to his growing language skills. The biggest problem was bullying at this school but after some time he, and several other pupils, were expelled as \"enemy aliens.\" Schäffer believed that this happened because his mother was heard speaking German with the mothers of some other pupils and, of course, with Britain at war with Germany, this led to the expulsions. By this time the Lycée Français had sorted out its problems and he returned there and completed the French baccalaureate.\nAfter the award of the baccalaureate, Schäffer entered the University of Montevideo to study engineering.\nThere he met fellow engineering student\nGünter Lumer\n, another Jewish student whose family had emigrated to Uruguay to escape for the Nazis.\nPaul Halmos\nheld visiting appointments at the University of Montevideo in\n1951\n-\n1952\n. Schäffer, who studied mathematics as part of the engineering course, attended the same lectures by\nHalmos\nas his friend\nLumer\n.\nHalmos\nwrites\n[\n4\n]\n:-\nJuan Schäffer's story is similar\n[\nto\nLumer\n's\n]\n: born in Austria, he lived in France for a while, spoke German, French, Spanish, Italian, and English, all very fast, all with complete colloquial mastery. He was, even as a student, spectacularly bright and quick - when I asked a question, he would catch on when I was half through and the answer would start pouring out in staccato Spanish. ...\n[\nHe\n]\nwas quick enough to catch his own mistakes after he half said them, and to correct them while I was still bewildered. ... Schäffer's stuff would be a snow job - each crystal was impeccably clean but the mass could be incomprehensible in its impressive totality.\nHalmos\n,\nLumer\nand Schäffer wrote the joint paper\nSquare roots of operators\nwhich they submitted to the\nAmerican Mathematical Society\non\n4\nApril\n1952\n. The paper begins\n[\n5\n]\n:-\nIf H is a complex\nHilbert\nspace and if A is an operator on H\n(\ni.e., a bounded linear transformation of H into itself\n)\n, under what conditions does there exist an operator B on H such that\nB\n2\n=\nA\nB^{2}  = A\nB\n2\n=\nA\n? In other words, when does an operator have a square root? The spectral theorem implies that the normality of A is a sufficient condition for the existence of B; the special case of positive definite operators can be treated by more elementary means and is, in fact, often used as a step in the proof of the spectral theorem. As far as we are aware, no useful necessary and sufficient conditions for the existence of a square root are known, even in the classical case of finite-dimensional\nHilbert\nspaces. The problem of finding some easily applicable conditions is of interest, in part because the use of square roots is frequently a helpful technique in the study of algebraic properties of operators, and in part because of the information that such conditions might yield about the hitherto rather mysterious behaviour of non-normal operators.\nSchäffer graduated from the University of Montevideo with a degree in industrial engineering and was awarded a fellowship which allowed him to choose where he studied for a doctorate. He chose to go to Switzerland and study at the Eidgenössische Technische Hochschule Zürich. His studies were supervised by Maximiliaan Julius Otto Strutt\n(1903\n-\n1992)\n, the Professor Ordinarius für theoretische Electrotechnik, and by\nMichel Plancherel\n. He was awarded his Dr. sc. techn. in\n1956\nfor his thesis\nContributions to the Theory of Electrical Circuits with Non-Linear Elements\n. Having always found mathematics more to his liking than engineering, he had worked in parallel on a mathematics doctorate at the University of Zurich advised by\nRolf Herman Nevanlinna\n. Schäffer was aware, he said in\n[\n11\n]\n, that\nNevanlinna\nhad been a National Socialist but he greatly admired him as a mathematician. Schäffer didn't, however, adopt\nNevanlinna\n's proposal for his thesis topic. In fact during his time in Zurich, he made a return trip to Uruguay, visiting Brazil on the way. In Brazil he had met up with\nLeopoldo Nachbin\nand it was his advice he followed for his thesis.\nBartel van der Waerden\nhad been on the staff at the University of Zurich from\n1951\nand he gave Schäffer some advice concerning his thesis. In\n1957\nSchäffer was awarded the degree of Doctor of Philosophy from the University of Zurich for his mathematics thesis\nAnalytische Parameterabhängigkeit der fastperiodischen Lösungen von nichtlinearen Differenzialgleichungen\nⓉ\n(\nAnalytical parameter dependence of the almost periodic solutions of nonlinear differential equations.\n)\n.\nReturning to Uruguay, Schäffer was appointed to teach engineering and mathematics at University of Uruguay in Montevideo. He married Inge Dorote Kaelbermann in\n1959\nand the wedding reception was held in the Schäffer family home. Inge, the daughter of Alberto Kaelbermann and Lilli Dinkelmann, had been born in Mannheim, Germany on\n11\nDecember\n1935\n. Like Schäffer, her family had fled from the Nazis and arrived in Uruguay. In\n1959\nSchäffer was awarded a Guggenheim fellowship to make a research visit to the United States and on\n18\nDecember\n1959\nhe and his wife flew from Montevideo to New York on their way to the University of Chicago.\nLet us note at this point that Inge was a teacher who taught English when in Uruguay and taught Spanish when in the United States. Juan Jorge and Inge Schäffer had a son Alejandro A Schäffer born in Montevideo on\n1\nJuly\n1963\n. He studied computer science at Carnegie Mellon University, then was awarded a Ph.D. in Computer Science from Stanford University in\n1988\n. He works as a computational biologist specialising in cancer genomics, biological sequence analysis, and medical genetics studies.\nJosé Luis Massera\nhad taught Schäffer when he was an undergraduate in Montevideo and they became colleagues when Schäffer joined the staff at the University of Uruguay. They became friends although they never discussed political matters;\nMassera\nwas a militant Communist. While Schäffer was still an undergraduate they published the joint papers\nMinimum figures covering points of a lattice\n(\nSpanish\n)\n(1951)\nand\nOn the level curves of a convex surface\n(\nSpanish\n)\n(1953)\n. After Schäffer joined the faculty in Montevideo in\n1957\nthey published many joint papers, for example their first of a series\nLinear differential equations and functional analysis\nwas published in\n1958\nwith the sixth in the series appearing in\n1961\n-\n62\n. Their book\nLinear differential equations and function spaces\nwas published in\n1966\n. Constantin Corduneanu writes in the review\n[\n1\n]\n:-\nThe book contains in a more systematic and detailed form the main results in the theory of linear differential equations which the authors have obtained in the last years. The theory is developed for equations in a\nBanach\nspace and considerable emphasis is placed on the methods of functional analysis and on the use of function spaces. The book is addressed primarily to readers interested in the theory of differential equations, but no specialised knowledge in this field is required. ... The book is well-written, self-contained and constitutes undoubtedly an important tool in this field of investigation. The reviewer believes that the topics and methods of this book will find interesting developments in other branches of modern research such as control theory and functional equations.\nFor the Publisher's summary of the chapters of this book, see\nTHIS LINK\n.\nWe note that Mathematical Reviews lists\n50\npapers published by Schäffer before this\n1966\nbook.\nIn\n1968\n,\nMassera\nadvised the Schäffer family to leave Uruguay because of the political situation in the country. Camille Gapenne writes:-\nUruguay was experiencing a deep crisis since the late\n1950\ns, which intensified throughout the\n1960\ns to include political, economic, social, even ethical and moral matters.\nSchäffer and his wife discussed what they should do and decided that\nMassera\nwas right and it was time to leave. He had an invitation to Carnegie Mellon University in Pittsburgh so, in\n1968\n, they moved to Pittsburgh where Schäffer worked for the rest of his career. Russell Walker, a professor at Carnegie Mellon University, said\n(\nsee\n[\n12\n]\n)\n:-\nJuan contributed greatly to the development of the mathematical studies and honours programmes in the department in the early\n1970\ns. He wrote two sets of notes for mathematical studies and taught in the honours programme for many years. These programmes remain central parts of the undergraduate curriculum.\nEmily Payne writes\n[\n12\n]\n:-\nOutside of the department, Schäffer was active in university governance. He served several terms on the Faculty Senate and two terms as chair of the Faculty Organization, helping to develop several key faculty governance policies. He also served as associate dean of the Mellon College of Science from\n1986\n-\n1993\nand as acting dean in\n1991\n. But his true home was always in teaching mathematics, both to Carnegie Mellon students and high school students who came to the university's campus for the Pennsylvania Governor's School for the Sciences.\nThe reference\n[\n6\n]\ngives more information about Schäffer's work at the Pennsylvania Governor's School for the Sciences. When asked \"What keeps you coming back to Pennsylvania Governor's School for the Sciences?\", he said:-\nIn mathematics, it is very important to know how to collaborate. High school students in the United States are not encouraged to collaborate. It is considered cheating. I believe Pennsylvania Governor's School for the Sciences gives these students a safe environment to learn how to collaborate in order to further their mathematical understanding. Pennsylvania Governor's School for the Sciences students have no grades so have no reason to compete. It is very valuable that they are able to work together.\nIn addition to the books he wrote with\nJosé Luis Massera\n, Schäffer wrote three other books:\nGeometry of spheres in normed spaces\n(1976)\n;\nBasic Language of Mathematics\n(2014)\n; and\nLinear Algebra\n(2014)\n. For more information on these four books, see\nTHIS LINK\n.\nSchäffer was interested in the history of mathematics and developed a course on the topic. His interest in history extended beyond mathematics and he also wrote historical articles on world leaders. Emily Payne explains in\n[\n12\n]\nhow he also used his language skills to help others:-\nA true scholar, Schäffer was a respected mathematician, a history enthusiast and a lover of languages - he was fluent in English, Spanish, French, German and Portuguese. He used his linguistic talents to help his late wife, Inés, host international visitors to Pittsburgh and as a volunteer translator for foreign patients at Pittsburgh hospitals ...\nSchäffer's wife, Inge Doris Schäffer, died on\n15\nSeptember\n2008\nand she was buried in Homewood Cemetery, Pittsburgh. Her name appears on her tombstone as \"Inés Schäffer\". Schäffer died in\n2017\nand was also buried in Homewood Cemetery.",
  "matematicos_citados_na_biografia": [
    "Günter Lumer",
    "Paul Halmos",
    "Halmos",
    "Lumer",
    "American Mathematical Society",
    "Hilbert",
    "Michel Plancherel",
    "Rolf Herman Nevanlinna",
    "Nevanlinna",
    "Leopoldo Nachbin",
    "Bartel van der Waerden",
    "José Luis Massera",
    "Massera",
    "Banach",
    "THIS LINK"
  ],
  "imagens": [
    "schaffer.jpg"
  ]
}