{
  "nome_completo": "Julia Hall Bowman Robinson",
  "nome_curto": "Julia Bowman Robinson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robinson_Julia/",
  "data_nascimento": "8 December 1919",
  "local_nascimento": "St Louis, Missouri, USA",
  "data_morte": "30 July 1985",
  "local_morte": "Berkeley, California, USA",
  "summary": "Julia B Robinson worked on computability, decision problems and non-standard models of arithmetic.",
  "biografia": "Julia Bowman\n's parents were Ralph Bowers Bowman and Helen Hall. Julia was the younger of her parents two children, having an elder sister Constance who was two years older. Ralph Bowman owned a machine tool and equipment company while Helen had been a primary school teacher before her marriage. However Ralph seemed to lose interest in his business after his wife Helen died, partly because he had made enough money to support his family from investing it. Julia was two years old when her mother died and after this she and her sister Constance were sent to live in a community of about four houses in the Arizona desert. Ralph remarried Edenia Kridelbaugh a year later, retired from his business at this time, and moved with his new wife to Arizona to be with his children.\nThe family moved about a lot over the next few years, always being away from the desert in the summer time. Of course there was no school in the middle of the Arizona desert, so when Julia was five years old\n(\nand Constance was seven\n)\nher new mother Edenia insisted that the family settle permanently somewhere where the children could be sent to school. They chose Point Loma in San Diego which was very small, having around\n50\nfamilies, with a primary school which had so few pupils that it combined children of different ages into the same classroom. The arrangement allowed both Julia and Constance to progress more rapidly through the levels than might otherwise have been possible. In\n1928\nRalph and Edenia had a daughter Billie, so Julia now had a younger sister as well as an elder one. Her schooling was disrupted by a year off school with scarlet fever when she was nine years old.\nScarlet fever marked the beginning of a very difficult time for Julia. The whole family was put in quarantine for a month but soon after she had recovered from one disease Julia was struck down with another, namely rheumatic fever. This time she was sent to the home of a nurse and spent a year in bed before making a slow recovery. By the time she had fully regained her health, Julia had missed two years schooling. The family had already moved away from Point Loma so that Julia could restart school without having the problems of being far behind her friends. However the illness lasted longer than expected and two years seemed too much time for her to make up at the new school. A private tutor was employed and\n[\n8\n]\n:-\n... in one year, working three mornings a week, she and I went through the state syllabuses for the fifth, sixth, seventh, and eighth grades. It makes me wonder how much time must be wasted in classrooms.\nBowman spent the year\n1932\n-\n33\nat the Theodore Roosevelt Junior High School before entering San Diego High School in\n1933\n. By the time she reached the final years of her schooling she was the only girl in her mathematics class and in her physics class. She did exceptionally well, however, receiving awards in mathematics and sciences as well as the Bausch and Lomb medal for the best science pupil. Although her parents and teachers all expected her to go to college, there was no expectation that she should develop her obvious mathematics talents beyond working towards a teaching qualification.\nAfter graduating from San Diego High School she entered San Diego State College to study mathematics with the aim of being a high school teacher. Tragedy struck in September\n1937\nwhen Ralph Bowman, Julia's father, committed suicide. When he had retired in\n1922\nhe was confident that he had savings which would support his family. However the Great Depression began in\n1929\nand by\n1937\nall Ralph Bowman's savings had been wiped out. The family moved to a small apartment and an aunt help provide the funds which allowed Julia and Constance to remain at College. The biggest influence on Bowman's mathematical development at this time came not through her College courses but through reading\nBell\n's\nMen of Mathematics\n. She recounted\n[\n8\n]\n:-\nThe only idea of real mathematics that I had came from Men of Mathematics. ... I cannot overemphasise the importance of such books about mathematics in the intellectual life of a student like myself completely out of contact with research mathematicians.\nUnhappy with the level of mathematics taught at San Diego State College, Bowman transferred to the University of California at Berkeley and after one year there she was awarded an A.B. During that year she took a number theory course from\nRaphael Robinson\nand began going for walks with him; on these he would teach her more mathematics which she found very exciting. When Bowman's job applications failed,\nNeyman\nfound a small amount of money to allow her to stay on at Berkeley as his assistant. A year later, in\n1941\n, she was awarded her M.A. then she turned down a civil service job to remain at Berkeley as a teaching assistant. After marrying\nRaphael Robinson\non\n22\nDecember\n1941\nshe was no longer allowed to teach in the mathematics department since her husband was on the mathematics staff. She was unhappy teaching statistics, which was allowed by the rules, but despite this her first publication\nA note on exact sequential analysis\ncame out of her teaching in the statistics laboratory at Berkeley. Robinson left mathematics at this time.\nIn\n1946\nshe visited Princeton, where her husband was a visiting professor, and took up mathematics again, working for a doctorate under\nTarski\n's supervision. She wrote\n[\n8\n]\n:-\nTarski was a very inspiring teacher. He had a way of setting results into a framework so that they all fit nicely together, and he was always full of problems - he just bubbled over with problems.\nIn her thesis\nDefinability and decision problems in arithmetic\nRobinson proved that the arithmetic of\nrational numbers\nis undecidable by giving an arithmetical definition of the integers in the rationals. Robinson was awarded a doctorate in\n1948\nand that same year started work on\nHilbert\n's Tenth Problem: find an effective way to determine whether a\nDiophantine equation\nis soluble. Along with\nMartin Davis\nand Hilary Putman she gave a fundamental result which contributed to the solution to\nHilbert\n's Tenth Problem, making what became known as the Robinson hypothesis. She also did important work on that problem with Matijasevic after he gave the complete solution in\n1970\n. Let us quote Robinson's own description of the problem which she wrote in an article intended for a general audience in\n1975\n:-\nHilbert in\n1900\nposed the problem of finding a method for solving Diophantine equations as the\n10\nth\nproblem on his famous list of\n23\nproblems which he believed should be the major challenges for mathematical research this century. In\n1970\n, a\n22\nyear old Leningrad mathematician Yuri Matijasevic solved the problem by showing that no such method exists.\nNow you are going to ask how could he be sure? He couldn't check each possible method and maybe there were very involved methods that didn't seem to have anything to do with Diophantine equations but still worked. The answer lies in a branch of mathematics called recursion theory which was developed during the\n1930\ns by several mathematicians:\nChurch\n,\nGödel\n,\nKleene\n,\nPost\nin the United States,\nHerbrand\nin France,\nTuring\nin England, Markov in the USSR, etc. The method of proof is based on the fact that there is a Diophantine equation say P\n(\nx,y,z,...,w\n)\n=\n0\nsuch that the sets of all values of x in all solutions of P =\n0\nis too complicated a set to be calculated by any method whatever. If we had a method would tell us whether P\n(\na,y,z,...,w\n)\n=\n0\nhas a solution for a given value of a, then we would have a method of calculating whether a belongs to the set S, and this is impossible.\nReturning to the year\n1949\n-\n50\n, Robinson spent that year at the RAND Corporation working on game theory. As a result of her work at RAND she published\nAn iterative method of solving a game\nin the\nAnnals of Mathematics\nin\n1951\nin which she proved the convergence of an iterative process for approximating solutions for each player in a finite two-person zero-sum game. This result has been described as the most important theorem in elementary game theory.\nIn the\n1950\ns Robinson continued to undertake research in mathematics, but also became involved with politics which occupied a lot of her time for around six years. In addition to work on\nHilbert\n's Tenth Problem, Robinson also wrote other important mathematics papers: on general recursive functions\n(1950)\n, on primitive recursive functions\n(1955)\n, on the undecidability of algebraic rings and fields\n(1959)\nand on decision problems for algebraic rings in\n1962\nin which she showed that rings of integers of various fields of algebraic numbers are undecidable. Although she kept working on mathematics, Robinson suffered health problems in the\n1960\ns having heart surgery.\nIn\n1971\nat a conference in Bucharest Robinson gave a lecture\nSolving diophantine equations\nin which she set the agenda for continuing to study Diophantine equations following the negative solution to\nHilbert\n's Tenth Problem problem. In this lecture she said:-\nNow it seems to me we should turn the problem around. Instead of asking whether a given Diophantine equation has a solution, ask \"for what equations do known methods yield the answer?\"\nIn\n1980\nshe gave the\nAmerican Mathematical Society\nColloquium Lectures on computability,\nHilbert\n's Tenth Problem, decision problems for rings and fields, and\nnon-standard models\nof arithmetic. She was the second woman to give the Colloquium Lectures, the first being\nWheeler\nin\n1927\n.\nJulia Robinson received many honours. She was the first woman to be elected to the\nNational Academy of Sciences\nin\n1976\n, and in the same year was appointed to a professorship at the University of California in Berkeley. She was elected to the American Association for the Advancement of Science in\n1978\n, became the first woman officer of the American Mathematical Society in the same year and the first woman president of the Society in\n1982\n. She wrote\n[\n8\n]\n:-\nI found my service as president taxing but very, very satisfying.\nShe was\nAmerican Mathematical Society\nColloquium Lecturer in\n1980\n, the Association for Women in Mathematics\nEmmy Noether\nLecturer in\n1982\n, and elected to the\nAmerican Academy of Arts and Sciences\nin\n1984\n. She was awarded a John D and Catherine D MacArthur Foundation Prize in\n1983\nin recognition of her contributions to mathematics.\nLeon Henkin, writing in\n[\n5\n]\n, describes her as follows:-\nThe style of quiet decorum she generally adopted was in contrast to the flashes of lively spirit that could be discerned in a wide range of bright or strong feelings when she spoke. Especially strong was her stubborn insistence that opportunity ought to be freely accessible to all - whether economic opportunity or opportunity for access to a mathematical career.\nLet us end this biography by quoting Robinson's own words on how she would wish to be remembered:-\nWhat I really am is a mathematician. Rather than being remembered as the first woman this or that, I would prefer to be remembered, as a mathematician should, simply for the theorems I have proved and the problems I have solved.\nA year after Robinson's death, her husband set up the Julia B Robinson Fellowship Fund to provide fellowships for graduate students in mathematics at Berkeley. When\nRaphael Robinson\ndied in January\n1995\nalmost all his estate went into the Fellowship Fund.",
  "matematicos_citados_na_biografia": [
    "Bell",
    "Raphael Robinson",
    "Neyman",
    "Tarski",
    "rational numbers",
    "Hilbert",
    "Diophantine equation",
    "Martin Davis",
    "Church",
    "Gödel",
    "Kleene",
    "Post",
    "Herbrand",
    "Turing",
    "American Mathematical Society",
    "non-standard models",
    "Wheeler",
    "National Academy of Sciences",
    "Emmy Noether",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}