{
  "nome_completo": "Julius Plücker",
  "nome_curto": "Julius Plücker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plucker/",
  "data_nascimento": "16 July 1801",
  "local_nascimento": "Elberfeld (now Wuppertal), Duchy of Berg (now Germany)",
  "data_morte": "22 May 1868",
  "local_morte": "Bonn, Germany",
  "summary": "Julius Plücker was a German mathematician who made important contributions to analytic geometry and physics.",
  "biografia": "Julius Plücker\n's family were descended from merchants who had originally lived in Aachen but had settled in Elberfeld during the Reformation in the\n16\nth\nCentury. This meant that Julius's background was a mixture of French and German and throughout his life it is evident that he found both attractive. For example, much of his mathematics followed the French style of geometry as developed by Monge. His father, Johann Peter Plücker\n(1771\n-\n1844)\n, was a businessman in Elberfeld although he later retired to Dusseldorf. Julius's mother was Johanna Maria Lüttringhausen\n(1776\n-\n1843)\n, a daughter of Johannes Lüttringhausen. Peter and Johanna Plücker had both been born in Elberfeld and they married in that town on\n21\nSeptember\n1797\n. They had three children: Julius Plücker, the subject of this biography, Moritz Rudolf Plücker\n(1804\n-\n1876)\nand Emil Plücker\n(\ndied\n1871)\n. We note that almost all sources give Julius's date of birth as\n16\nJune\n1801\nbut the date on his gravestone is\n16\nJuly\n1801\nand we have adopted this date.\nJulius Plücker first attended the Normal School in Elberfeld run by Johann Friederich Wilberg\n(1766\n-\n1846)\nwho had undertaken research on the affects of different styles of teaching on the characters of the pupils. Plücker studied there from\n1806\nto\n1815\nand his ability was recognised by Wilberg who approached Plücker's father persuading him that his son's talents merited further scholarly training. Wilberg recognized that geometry was an excellent teaching tool to develop self-creative thinking and independence in his students. His friend, the mathematician William Adolph Diesterweg\n(1782\n-\n1835)\nencouraged him in the technical aspect of this idea. The two men had been close friends since\n1807\n. Another of Wilberg's friends was Friedrich Kohlrausch\n(1780\n-\n1865)\nwho became a history teacher at the Königlichen\nGymnasium\nin Düsseldorf in\n1814\n. This school had been founded as a Lyceum by the Jesuits and had begun a process of major innovative development under a new director Karl Wilhelm Kortum\n(1789\n-\n1859)\n. The school offered an enthusiastic approach to learning, especially science.\nIn\n1816\nPlücker, following Wilberg's advice, moved to the Königlichen Gymnasium in Düsseldorf to prepare for university studies. After graduating with a diploma in\n1819\nhe followed the typical path for German university students of the time, studying at a number of different universities. He first attended the University of Heidelberg which he entered in the summer semester of\n1891\n. He spent three semesters at Heidelberg where he attended the lectures of Georg Friedrich Creuzer\n(1771\n-\n1858)\n, the professor of philology and ancient history. Next he moved to the University of Bonn beginning his studies there in the winter semester of\n1820\n. Here he was taught physics and chemistry by Karl Wilhelm Gottlob Kastner\n(1783\n-\n1857)\nwho lectured at Bonn from\n1818\nto\n1821\n. He was also taught mathematics and physics by Karl Dietrich von Münchow\n(1778\n-\n1836)\n, the professor of astronomy, mathematics and physics, and mathematics by Wilhelm Adolf Diesterweg who had been appointed professor of mathematics in\n1819\n.\nHis next move was to go to France in March\n1823\nwhere he attended courses on geometry at the University of Paris. He attended lectures by, among others,\nJean-Baptiste Biot\n,\nAugustin-Louis Cauchy\n,\nSylvestre Lacroix\nand\nSiméon Poisson\n. He completed his doctoral dissertation\nGeneralem analyeseos applicationem ad ea quae geometriae altioris et mechanicae basis et fundamenta sunt e serie Tayloria deducit\nⓉ\n(\nGeneral analysis applied to higher geometry and fundamental mechanics and deduced from Taylor series\n)\nwhile he was in Paris which he submitted to the University of Marburg. His thesis advisor at Marburg was Christian Ludwig Gerling\n(1788\n-\n1864)\nwho had studied under\nCarl Friedrich Gauss\n. He sent the thesis from Paris to Marburg in July\n1823\nand was awarded his doctorate 'in absentia' on\n30\nAugust\n1823\n. He remained in Paris working towards his\nhabilitation\nat the University of Bonn. It was while he was studying in Paris that Plücker learned the importance of analytical mechanics as developed by\nLaplace\nand\nLagrange\nas well as that of geometric mechanics as developed by\nPoinsot\n. This interplay between geometry and mechanics would form the topic of Plücker's research throughout his career from this time onwards.\nAt the beginning of April\n1825\nhe left Paris and returned to Bonn where he delivered his habilitation lecture on\n28\nApril. The dean praised his habilitation as being an excellent combination of mathematics and physics which led to a deep study of both areas. He was appointed as a\ndocent\n. Two years later he published the first volume of\nAnalytisch-geometrische Entwickelungen\nⓉ\n(\nEvolution of analytical geometry\n)\n. We say more about this important work below. Lecture courses he gave while a docent at Bonn include: Analysis and algebra including number theory; Geometry; Mathematical Physics; Bookkeeping; and Astronomy. The geometry lectures that he gave in his first years at Bonn were based on\nBiot\n's\nGéométrie analytique\nⓉ\n(\nAnalytical geometry\n)\nbut from the winter semester of\n1828\n-\n29\nonwards he lectured on his own geometric results. He based the Mathematical Physics courses on\nElementary Mechanics\nby\nLouis Poinsot\n, and\nMechanics\nby\nSiméon-Denis Poisson\n. Plücker gave all his courses in German but sometimes gave the occasional lecture in French. Sometimes he offered the students separate tutorials in German and in French.\nPromoted to extraordinary professor at Bonn in\n1828\n, he went to Berlin in\n1833\nand spent a year as an extraordinary professor at the University while at the same time he taught at the Friedrich Wilhelm Gymnasium. This dual role made Plücker think about how to bring his teaching and his research closer together. In particular he sought to bring an excitement to his teaching, particularly for the best students, by using examples from his own research. For most Germans a position in Berlin would be the ultimate goal and one would have expected Plücker to spent the rest of his career there. Things were not so simple, however, for the chair of mathematics in Berlin had just been filled by\nJakob Steiner\n.\nSteiner\nwas the leader of the German school of synthetic geometry, while Plücker followed the analytical approach. This might have been a strength had the two men been on good terms, but their personalities meant that their relationship was one of continual conflict. Wolfgang Eccarius\n[\n12\n]\nsees the competition between the two men for the chair of mathematics at the Polytechnic, and\nAugust Crelle\nfavouring Plücker over\nSteiner\n, as the basis to their personal conflict. Plücker quickly decided that he would have to find a position away from Berlin as soon as possible. He became an ordinary professor of mathematics at the University of Halle on\n7\nNovember\n1833\nand remained there for four semesters. He was appointed to fill the chair previously held by Heinrich Scherk who, after less than two years in post, had left Halle for the chair at the University of Kiel. At Halle, Plücker gave lecture courses on: Analysis and Algebra; Geometry, Mathematical Physics; and Physics.\nHe returned to the Rheinische Friedrich-Wilhelms University of Bonn in\n1836\nto fill the chair of mathematics. In the following year, on\n4\nSeptember\n1837\n, he married Maria Louise Antonie Friederike Altstätten\n(1813\n-\n1880)\nat Haus Altstätten, Neugasse, Bonn; they had one son  Albert Plücker\n(1838\n-\n1901)\nborn in Bonn on\n1\nAugust\n1838\n. As we have indicated, Plücker was a geometer yet he firmly believed in the importance of the applications of mathematics to the physical sciences. In\n1847\nhe turned to physics, accepting the chair of physics at Bonn and working on magnetism, electronics and atomic physics. He anticipated Kirchhoff and Bunsen in indicating that spectral lines were characteristic for each chemical substance. He made significant discoveries along with his student Johann Wilhelm Hittorf\n(1824\n-\n1914)\n. Together they\n[\n2\n]\n:-\n... made many important discoveries in spectroscopy, anticipating the German chemist Robert Bunsen and the German physicist\nGustav R Kirchhoff\n, who later announced that spectral lines were characteristic for each chemical substance.\nHe made other important discoveries which would eventually lead to the invention of a cathode ray tube\n[\n8\n]\n:-\n[\nIn\n1847]\nhe became interested in\nFaraday\n's work.\nFaraday\nhad begun to experiment with electrical discharge in gases, noting the spark effect. ... It occurred to Plücker that if gases could be contained in an enclosure, the discharge effect should be observable for a length of time. ... in\n1858\nHeinrich Geissler\n(1814\n-\n1879)\ninvented the vacuum glass tube. When Plücker generated the discharge, an eerie, mysterious, and beautiful greenish glow appeared. It remained for a persistent time. ... Plücker, the complete scientist, recognised that this fluorescence within the tube responded to an electromagnet on the wall of the tube; he discerned that these expressions of light were rays or beams of some electrical property. ... Geissler and Plücker had propelled\nFaraday\n's Effect into a visual manifestation.\nHowever, his student Johann Hittorf wrote\n[\n2\n]\n:-\n... Plucker never attained great manual dexterity as an experimenter. He had always, however, very clear conceptions as to what was wanted, and possessed in a high degree the power of putting others in possession of his ideas and rendering them enthusiastic in carrying them into practice.\nAlthough Plücker continued to hold the chair of physics at Bonn until his death, in\n1865\nhis research interests returned to mathematics and\nFelix Klein\nserved as his assistant\n1866\n-\n1868\n.\nLet us now look briefly at the highly significant contributions which Plücker made to mathematics. His first major work was\nAnalytisch-geometrische Entwickelungen\nⓉ\n(\nAnalytic geometric developments\n)\npublished in two volumes, the first in\n1828\nand the second three years later\n[\n1\n]\n:-\nIn each volume he discussed the plane analytic geometry of the line, circle, and conic sections; and many facts and theorems - either discovered or known by Plücker - were demonstrated in a more elegant manner. The point coordinates used in both volumes are nonhomogeneous affine; in volume II the homogeneous line coordinates in a plane, formerly known as Plücker's coordinates, are used and conic sections are treated as\nenvelopes\nof lines. The characteristic features of Plücker's analytic geometry were already present in this work, namely, the elegant operations with algebraic symbols occurring in the equations of conic sections and their pencils.\nHis next major work was\nSystem der analytischen Geometrie, auf neue Betrachtungsweisen gegrundet, und insbesondere eine ausführliche Theorie der Kurven dritter Ordnung enthaltend\nⓉ\n(\nSystem of analytic geometry, founded on new perspectives, and in particular a detailed theory of curves of the third order containing\n)\n(1835)\nwhich treats point and line coordinates which apply to conic sections. The main part of the work discusses plane cubic curves. In\n1839\nhe published\nTheorie der algebraischen Kurven\nⓉ\n(\nTheory of algebraic curves\n)\nwhich discussed properties of algebraic curves near infinite points, studying in great depth singular points on the plane. This work also contains the celebrated 'Plücker equations' relating the order and class of a curve.\nHe initiated the investigation of geometrical configurations associated with line complexes. In this way of specifying coordinates, a point has a linear equation, namely that of all lines through the point while a line has a pair of numbers namely the\nx\nx\nx\nand\ny\ny\ny\ncoordinates of where it cuts the axes. He also introduced the idea of a ruled surface. His work on combinatorics considers Steiner type systems. In fact Robin Wilson points out in\n[\n24\n]\nthat Plücker's contribution is the earliest reference to block designs when he constructed the system of order\n9\nand stated necessary condition on the number of elements for such a system to exist. Hans Ludwig de Vries writes in\n[\n23\n]\n:-\nIt is the aim of these notes to amuse the reader with the remark that already in\n1835\nJulius Plücker published S\n(2\n,\n3\n,\n9)\nin his book 'System der analytischen Geometrie, auf neue Betrachtungsweisen gegründet, und insbesondere eine ausführliche Theorie der Curven dritter Ordnung enthaltend'\nⓉ\n(\nA system of analytic geometry, based on new perspectives and in particular a detailed theory of third-order curves\n)\nand defined general\nSteiner\ntriple systems S\n(2\n,\n3\n, m\n)\n= STS\n(\nm\n)\nthere in a footnote. He stated the first theorem on STSs, which says that not every m has an STS\n(\nm\n)\n, but only those which are of the form m =\n6\nn+\n3\n. So, since he missed m =\n6\nn+\n1\n, the first theorem on STSs was wrong, or at least incomplete.\nIn\n1868\nPlücker published the first part of\nNeue Geometrie des Raumes, gegründet auf die Betrachtung der geraden Linie als Raumelement\nⓉ\n(\nNew geometry of space, based on the consideration of the straight line as a space element\n)\n(1868)\nbut died before the second part was complete.\nKlein\nwas, at this time, his assistant and had discussed the ideas that Plücker intended to develop in this second part.\nKlein\ntherefore carried out the plan as envisaged by Plücker publishing the second volume in\n1869\n. Simon Grigorevich Gindikin writes about this work in\n[\n15\n]\n:-\n... the idea of Julius Plücker\n[\nwas\n]\nto consider the space whose elements\n(\npoints!\n)\nare lines of the usual three-dimensional space. Plücker developed this idea over several years and the final result is contained in the posthumous memoir, edited in\n1868\n-\n69\nby\nKlein\nand\nClebsch\n, entitled \"New Geometry of the Space based on the Consideration of a Line as a Space Element\". The dimension of the space of lines is four and it is probably the first four-dimensional space that appeared in science. Strangely enough, in the period when four-dimensional manifolds appeared in relativity  theory and became fashionable, nobody compared the\nMinkowski\nfourfold and the Plücker fourfold which appeared\n50\nyears earlier.\nPlücker was awarded the Copley Medal from the\nRoyal Society of London\nin\n1866\n:-\nFor his researches in analytical geometry, magnetism, & spectral analysis.\nFor the full text of the citation for the Copley Medal see\nTHIS LINK\nThis award, and the lack of recognition of Plücker's achievements in Germany, is certainly an indication that his brilliance was seen more clearly in Britain than it was in Germany.\nPlücker is buried in the Alter Friedhof\n(\nOld Cemetery\n)\nin Bonn.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Jean-Baptiste Biot",
    "Augustin-Louis Cauchy",
    "Sylvestre Lacroix",
    "Siméon Poisson",
    "Carl Friedrich Gauss",
    "habilitation",
    "Laplace",
    "Lagrange",
    "Poinsot",
    "docent",
    "Biot",
    "Louis Poinsot",
    "Siméon-Denis Poisson",
    "Jakob Steiner",
    "Steiner",
    "August Crelle",
    "Gustav R Kirchhoff",
    "Faraday",
    "Felix Klein",
    "envelopes",
    "Klein",
    "Clebsch",
    "Minkowski",
    "Royal Society of London",
    "THIS LINK"
  ],
  "imagens": [
    "plucker2.jpg"
  ]
}