{
  "nome_completo": "Julián Adem Chahín",
  "nome_curto": "Julián Adem",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adem_Julian/",
  "data_nascimento": "8 January 1924",
  "local_nascimento": "Tuxpan, Veracruz, Mexico",
  "data_morte": "9 September 2015",
  "local_morte": "Mexico City, Mexico",
  "summary": "Julián Adem was a Mexican applied mathematician and geophysicist specialising in atmospheric sciences. He is most famous for developing the Hemispheric Thermodynamic Climate Model which simulated the natural climate.",
  "biografia": "Julián Adem\nwas the son of Jorge Adem Jerasle\n(1890\n-\n1974)\nand Almas Chahín Yehel\n(1903\n-\n1986)\n. Jorge Adem was born in Lenanon and his wife Almas was born in Beirut, Lenanon; both had emigrated from Lenanon to Mexico. Jorge was Arabic speaking while his wife Almas spoke both Arabic and French. Jorge Adem was a merchant and, let us note, had a hobby as an angler and won an angling championship in\n1958\n. The\n1930\nCensus lists the family living at\n36\nCalle de Humbolt, Tuxpan, Veracruz. The city of Tuxpan\n(\nmeaning place of the rabbits in Aztecs language\n)\nlies on the Pantepec River and is a major port for Mexico City. The\n1930\nCensus gives the children of Jorge and Almas Adem as:\nJosé Adem\n(\naged\n8)\n, Julián Adem\n(\naged\n6)\n, Antonio Adem\n(\naged\n4)\nand María Elena Adem\n(\naged\n1)\n. In fact Julián Jorge Adem, the subject of this biography, was born on\n8\nJanuary\n1924\nand Antonio Jorge Adem was born on\n17\nFebruary\n1926\n. After the\n1930\nCensus, three more girls were born, Labibe Adem\n(\nborn about\n1931)\n, Alicia Adem\n(\nborn\n13\nNovember\n1933)\nand Esbaide Adem\n(\nborn\n1938)\n; all the seven children were born in Tuxpan, Veracruz.\nJosé Adem\nbecame a topologist and has a biography in this archive. Antonio Adem became a businessman. Esbaide Adem became a promoter and pioneer in nuclear physics research in Mexico.\nJulián Adem attended a primary, secondary and high school in Tuxpan. The secondary and high school had been founded by Professor Manuel C Tello in\n1938\n. Julián writes\n[\n2\n]\n:-\nIn\n1938\nan event occurred that changed my life, as well as that of many other Tuxpenos: Professor Manuel C Tello came to Tuxpan from Jalapa and established the secondary and high school that today bears his name, and which since then has depended on the Universidad Veracruzana. I was from the fourth generation of students, and received a solid preparation there, thanks to the commitment and great academic and human quality of teacher Tello and the other professors, most of whom were professionals who pursued their careers in Tuxpan and dedicated a good part of their time to teaching.\nRené Garduño writes that at High School, Adem\n[\n15\n]\n:-\n... excelled in studies and sports, mainly volleyball; he also practiced drawing and painting. Already then his inclination for graphic arts was noticeable, which would later culminate in scientific journals. In high school he founded and directed a publication called 'Juventud'; in it he wrote, drew and also got into the printing press to collaborate manually: he himself confesses a certain addiction to ink.\nAdem graduated from the Manuel C Tello High School in\n1943\nwhere he had, like his elder brother\nJosé Adem\n, developed a passion for mathematics. He entered the National School of Engineers of the National Autonomous University of Mexico\n(\nUNAM\n)\nbut, finding that mathematics was taught in the Faculty of Sciences, decided to study mathematics and engineering in parallel. This was not a particularly difficult thing to do since the mathematics lectures, although in a different faculty, were given in the same building as the engineering lectures.\nThe Institute of Geophysics at the UNAM was founded by the engineer Ricardo Monges López\n(1886\n-\n1983)\n. He was commissioned to propose a plan for creating the new Institute in July\n1946\nand he began to seek staff in various departments who could give part of their time to the new Institute. In March\n1947\nJulián Adem was preparing to write his civil engineering thesis advised by the engineer Alberto J Flores, director of the National School of Engineers. His thesis was on the development of methods devised to calculate how buildings are affected by seismic disturbances so he went to ask Monges López if he had any seismic data that might be useful to him. Monges López was impressed with Adem and offered him a position as his assistant. Adem graduated with a civil engineering degree in\n1948\n, continued to study mathematics in the Faculty of Science, and worked as Monges López's assistant helping him to set up the Institute of Geophysics.\nOn\n4\nFebruary\n1949\nthe Institute of Geophysics at the UNAM began operating. By this time Adem was collaborating with Marcos Moshinsky Borodiansky\n(1921\n-\n2009)\n. Moshinsky had been born in Kyiv, Ukraine but his Jewish family emigrated to Mexico when he was three years old. He studied at the National Preparatory School and at the Faculty of Sciences, UNAM where he became a researcher at the Physics Institute in\n1942\n. He obtained his doctorate from Princeton University in\n1949\nhaving been advised by\nEugene Wigner\n. His interests were elementary particles and nuclear reactions. Adem and Moshinsky worked on applied mathematics problems related to nuclear reactions and published their first paper\nSelf-adjointness of a certain type of vectorial boundary value problems\n(\nSpanish\n)\nin\n1950\n. Their second paper, submitted on\n10\nApril\n1951\nto the\nQuarterly of Applied Mathematics\n, was\nOn matrix boundary value problems\n. They write in the Introduction:-\nIn a recent publication\n[\n'Self-adjointness of a certain type of vectorial boundary value problems'\n(\nSpanish\n)]\na matrix type of boundary value problem was introduced in order to simplify the description of nuclear reactions. It appeared that this type of boundary value problem could find applications in other branches of mathematical physics, and the purpose of the present note is to illustrate them.\nWhen we deal with vibrations of continuous media, with problems of heat flow etc., we usually describe the state of the system in terms of a single function which depends on position as well as on the time. As an example, we may mention the lateral displacement of a vibrating string, or the temperature function in case of problems of heat flow.\nIn many problems of vibration and heat conduction, of which examples will be given below, the description of the state by a single function leads to boundary value problems of great difficulty. It is possible though, in some cases, to divide the continuous medium into several regions, and with each region we can associate a function describing its state. These functions can be grouped together in the form of a column matrix or vector, which will then represent the state of the whole system. The mathematical problem we encounter then, is a matrix boundary value problem, which is, in general, much simpler than the one we would have to deal with in the usual formulation.\nIn the present note, we shall discuss two examples of matrix boundary value problems. The first one describing the flow of heat in a cross, illustrates the case where the interactions between the different regions appear through boundary conditions. The second one, dealing with the vibration of systems of plates with intermediate elastic media, illustrates the case where the interactions take place through the equations of motion. We shall obtain the eigenvalues and eigenmatrix functions corresponding to this type of problems, and with the help of them, give a formal solution for any initial conditions.\nAdem gives has address as Institute of Geophysics while Moshinsky gives his as Institute of Physics. The authors give the following Acknowledgement:-\nThe authors are thankful to engineer R Monges López, Director of the Instituto de Geofísica, for the encouragement he has given to the present research. This work was supported, in part, by the Instituto Nacional de la Investigación Científica.\nThe\nQuarterly of Applied Mathematics\n, the journal in which the paper appeared in\n1952\n, was published by the Division of Applied Mathematics, American Mathematical Society, Brown University. When the paper was submitted, Adem had already been accepted by Brown University to study there for a Ph.D. in Applied Mathematics advised by George Francis Carrier\n(1918\n-\n2002)\n. He studied at Brown University from\n1951\nto\n1953\nand was awarded his Ph.D. in\n1953\nfor his thesis\nOn The Axially-Symmetric Steady Wave Propagation in Elastic Circular Rods\n. He published a paper with the same title as his Ph.D. thesis in the\nQuarterly of Applied Mathematics\nin\n1953\nwhich begins:-\nIn the first part of this report we find an exact solution for the problem of steady wave propagation in an isotropic, elastic circular bar of infinite length, free of stress on its lateral surface and loaded by a harmonic body force, parallel to its axis, whose amplitude is a\nDirac\ndelta function. The solution of this problem gives at the same time the solution for a semi-infinite bar with a special prescribed load on its boundary plane.\nAdem writes\n[\n2\n]\n:-\nUpon my return to Mexico, after the initial construction of the brand new Ciudad Universitaria had been completed, the Institute of Geophysics was established on floors\n3\n,\n4\nand\n5\nof the then Tower of Sciences, and now Tower II of Humanities. Upon returning, the engineer Monges López invited me to help him with the academic-administrative task.\nCarl Axel Christian Wallén\n(1917\n-\n2010)\nwas a Swedish meteorologist who was sent by UNESCO to advise Mexico on meteorological studies. He was at Institute of Geophysics in Mexico City when Adem returned there and he attended a series of three lectures Adem gave on 'Applications of the equations of the mechanics of continuous media in geophysics'. After the last of Adem's lectures, Wallén told him that Carl-Gustaf Rossby, who became founding director of the Swedish Meteorological and Hydrological Institute in Stockholm in\n1947\n, was working on similar research and suggested that Adem might like to make a research visit to the Meteorological and Hydrological Institute in Stockholm. Adem writes\n[\n2\n]\n:-\nA few days later I received a personal invitation from Professor Rossby, and with the consent of engineer Ricardo Monges López I left for Sweden in October\n1954\nfor a postdoctoral stay that would decide my entry into research in the area of atmospheric science. It was the time when electronic computers were becoming available for research, which made it possible to try to solve fluid dynamics equations in a practical way, and the era of numerical models for climate prediction began, which was a magnificent opportunity for an applied mathematician. My ticket to Sweden was paid for by the Ministry of Foreign Affairs, at the request of the then coordinator of Scientific Research, Dr Alberto Barajas.\nAdem spent almost two years in Stockholm before returning to Mexico in June\n1956\n. Before leaving Stockholm he submitted the paper\nA Series Solution  for the Barotropic Vorticity Equation and its Application in the Study of Atmospheric Vortices\nto\nTellus\n, to the\nQuarterly Journal of Geophysics.\nThe paper has the following Abstract:-\nA method to obtain a series solution for the barotropic non-divergent, vorticity equation is given and is applied to the case of a vortex. A formula that gives the development of a symmetrical vortex as a function of radius, maximum velocity and latitude is obtained. A numerical example is worked out. The convergence of the series solution for the general case is discussed and shown to depend on the scale of motion to be forecast and conclusions are drawn regarding time-steps used in a forecast and the smoothing of the initial map. The possibility of improving a forecast and reducing the number of time-steps used in it by the application of this series solution, follows as a general conclusion. Finally, a theorem that gives the scaling of the variables in an experimental model of a barotropic flow is obtained.\nAdem gives has address as the International Meteorological Institute in Stockholm but adds the note:-\nThe author is  a member of the Instituto de Geofisica, Universidad  Nacional de Mexico and of the Instituto Nacional de la Investigación  Cientifíca, Mexico City. He undertook the investigation reported in this paper when he was on leave in Stockholm.\nHe attended a meeting of the Bureau of the Scientific Committee on Oceanic Research in Gothenburg on\n18\nJanuary\n1957\n. This was shortly before the start of the International Geophysical Year\n(\nJuly\n1957\n-September\n1958)\nand Adem was appointed as coordinator of the Mexican participation. The USA aimed to launch man-made satellites during the International Geophysical Year and, on\n4\nJuly\n1957\nAdem announced\n[\n31\n]\n:-\nThe man-made moons which will be launched into space during the International Geophysical Year will be visible from Mexico City with ordinary binoculars. ... the public will be duly informed when the satellites are launched and the course they will take. Scientific observations of the satellites will be made from the Tonantzintla Observatory in Puebla, which operates under the auspices of the National University of Mexico. ... pictures of recent eruptions on the surface of the sun are being taken and sent to Germany for interpretation.\nSeveral attempts to launch the satellites by America failed and the USSR launched two satellites before a successful American launch on\n1\nFebruary\n1958\n.\nOn\n14\nSeptember\n1958\n, Adem married Martha Diaz de Leon Hernandez\n(1925\n-\n1979)\n, the daughter of the lawyer Leandro Diaz de Leon and Aurora Hernandez. Julián and Martha had two sons. Julián Adem, born\n9\nApril\n1960\nin Mexico City, studied international relations and became the Mexican consul in Dallas, Texas. Alejandro Adem, born\n24\nNovember\n1961\nin Mexico City, studied mathematics at the National Autonomous University of Mexico, being awarded a B.S. in\n1982\n. He then went to Princeton University, was advised by\nWilliam Browder\n, and was awarded a Ph.D. in\n1986\nfor his thesis\nFinite Transformation Groups and Their Homology Representations\n. He was professor at the University of Wisconsin-Madison and the University of British Columbia, and has won may awards for outstanding mathematical contributions.\nLet us return to our biography of Julián Adem Sr. By\n1960\nhe was using the first computer installed at UNAM to begin a new approach to studying the climate. He presented his results to the\n12\nth general assembly of the International Union of Geodesy and Geophysics which was held in Helsinki, Finland,\n26\nJuly to\n6\nAugust\n1960\n. At this meeting he presented his initial work on his thermodynamic model for climate prediction which would become the most important of Adem's many contributions. After his presentation Walter Hansen, director of the Oceanographic Institute of the University of Hamburg, Germany, invited him to the Institute as a visiting professor, asking him to deliver lectures on 'Hydrodynamics of the oceans'. Back in Mexico, having flown via Houston, Texas, he sought permission to go to Hamburg and this was approved. At Hamburg he delivered the course but also continued research improving his model for climate prediction. Hansen tried to persuade Adem to spend more time teaching at the Institute in Hamburg but he wanted to support science in Mexico so refused the offer.\nIn October\n1959\nhe had been appointed as director of the Institute of Geophysics in Mexico City. During his trip to Hamburg, Anselmo Chargoy had taken over as acting director but Adem took back his role of director when he returned from Hamburg in April\n1962\n. In the summer of that year Jerome Namias came to the Institute of Geophysics, invited by Adem. Namias\n(1910\n-\n1996)\n, was head of the Extended Forecast Division, National Meteorology Center, National Oceanic and Atmospheric Administration, U.S. Department of Commerce, Washington, D.C. While in Mexico City, Adem and Namias discussed Adem's thermodynamic model for climate prediction which Namias thought to have great potential. He invited Adem to spend some time at the National Meteorology Center in Washington D.C. so Adem asked for permission from the coordinator of Scientific Research of UNAM to spend a sabbatical year at the Center. He spent the year from October\n1962\nto November\n1963\nin Washington, then returned to his role at head of the Institute of Geophysics in Mexico City.\nAt the National Meteorology Center, Adem continued to develop his model to predict weather. He published the paper\nPreliminary Computations on the Maintenance and Prediction of Seasonal Temperatures in the Troposphere\nin\n1963\nwhich showed how the model was improving. The Abstract begins\n[\n4\n]\n:-\nBy considering the conservation of energy and the balance of radiation in the troposphere, in the cloud layer, and in the surface of the earth, we obtain a system of six equations containing six unknowns. The variables are the temperatures and the excesses of radiation in the troposphere, in the cloud layer, and in the surface of the earth. The equations contain as parameters the insolation, the cloudiness, the heat given off by the oceans and the continents to the atmosphere, and the initial temperature distributions. The model contains only meridional turbulent transport in the troposphere. Computations for both hemispheres and for the four seasons, as well as for the annual case, are carried out, obtaining a remarkable agreement with observations.\nAdem's term as head of the Institute of Geophysics ended in October\n1965\nand he asked not to be re-appointed since he wanted to devote himself to full time research. He spent the next five years, until\n1971\n, at the National Meteorology Center in Washington D.C. He writes\n[\n2\n]\n:-\nAfter five years as a researcher at that centre in Washington, D.C., Dr Pablo González Casanova, then rector of UNAM, called me on the phone to inform me that several researchers were proposing me as a candidate for a second term as director of the Institute of Geophysics. After consulting with the family, I accepted the proposal and moved to Mexico, following the recommendations of the rector. The Governing Board unanimously appointed me director and I re-joined the UNAM, with my old position as top-ranking researcher.\nA conference on climatic changes on time scales ranging from a month to millennia was held at the Scripps Institution of Oceanography, San Diego, California,\n15\n-\n17\nNovember\n1972\n. The conference report\n[\n33\n]\nshows that several researchers were now using Adem's Model. Here are some extracts from the report\n[\n33\n]\n:-\nAdem's numerical-thermodynamical model has been used to simulate an ice-free Arctic. Computed sea water temperatures are similar to observed high latitude ice-free parts.\n...\nThe fourth speaker was Julian Adem of the Instituto de Geofisica who presented a number of results of numerical thermodynamic experiments on climate changes. The predictions obtained from his thermodynamic model were said to agree well with the observed SSTA pattern observed in the eastern North Pacific ocean. Dr. Adem also showed a set of experiment results by changing different parameters in the model.\n...\nDavid M Shaw of the University of Rhode Island presented the final paper coauthored by William L Donn: 'Application of Adem's Model to Paleozoic and Cenozoic Climates'. They have applied Adem's model to various stages of continental drift and have determined that there would be no ice at the pole if it were in a large, open ocean. Since, however, the Arctic ice at present is only\n3\nm thick, this would change the water balance of the globe. It appears that the depth of the mixed layer in the ocean is more critical than cloud cover and other parameters. He pointed out that\n250\nmillion years ago, the continents were almost all in the Southern Hemisphere with presumably an ice-free Arctic until at least one hundred million years B. P. By\n25\nmillion B. P. the Arctic had probably iced up.\nIn addition to his research, Adem has greatly enriched scientific life by founding the Unión Geofísica Mexicana in\n1960\n, the journal\nGeofísica Internacional\nin\n1961\n, and the Centro de Ciencias de la Atmósfera in\n1977\n.\nAdem's wife died in\n1979\nand he married Thelma del Cid on\n18\nDecember\n1981\n. Both were involved in founding the journal\nAtmósfera\nwhich started life in\n1988\n. The journal was announced by the American Meteorological Society as follows:-\nA new quarterly journal devoted to the publication of original research papers on the atmospheric sciences, in English or Spanish, is scheduled to appear beginning in\n1988\n. The journal will have a broad scope, including a variety of topics, ranging from theoretical and applied studies to interdisciplinary studies. The editorial staff consists of Julián Adem, editor; Carlos Gay, associate editor; and Thelma del Cid, technical editor.\nAdem received many honours and awards for his outstanding contributions. He was elected to El Colegio Nacional on\n23\nOctober\n1974\n, and he received Mexico's National Prize in Sciences\n(1976)\n. He received an honorary doctorate from the Universidad Veracruzana\n(1993)\nand the Adolfo Ruiz Cortines medal\n(1994)\n. He also received the National University Award from the National Autonomous University of Mexico\n(1993)\n.\nA great traveller all his life, in the later part of his career Adem was a visiting professor at the\nMax Planck\nInstitute for Meteorology, Hamburg,\n1977\n-\n1978\n, and at the Catholic University Louvain, Belgium,\n1982\n,\n1983\n,\n1985\n,\n1989\n, and\n1992\n. He retired in\n1994\n, being appointed investigator emeritus.\nRené Garduño, who worked with Adem for over\n30\nyears, writes\n[\n15\n]\n:-\nJulián Adem is a true gentleman, simple and methodical, an aristocrat. All his life he has looked good: lean, healthy, and vigorous. He takes a daily walk through the University City, which seems to him the most beautiful campus in the world, frequently swimming at his house in Tepoztlán, Morelos. Although he is modest and reserved, he considers that his daily presence at the Centre for Atmospheric Sciences is motivating and paradigmatic. He is frank, approachable, and courteous to everyone: academics, students, and administrators; and for everything from a greeting in the hallway to a technical discussion in his cubicle.\nHe is loyal to science, UNAM and Mexico. Surely in engineering he would have become rich and in a foreign institution he would have had better income than in our University. In economic and political terms, he says that you have to play it with the institution and the country. He is patriotic and has the university at heart. He recommends honesty as the motto for everything, particularly scientific research. He advises choosing collaborators more for their high moral level than for their high academic performance.\nFor more information about Adem's life and work, see our English translation of\n[\n2\n]\nat\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "José Adem",
    "Eugene Wigner",
    "Dirac",
    "William Browder",
    "Max Planck",
    "THIS LINK"
  ],
  "imagens": [
    "adem_julian.jpg"
  ]
}