{
  "nome_completo": "Julius Gysel",
  "nome_curto": "Julius Gysel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gysel/",
  "data_nascimento": "11 August 1851",
  "local_nascimento": "Wilchingen (Schaffhausen canton), Switzerland",
  "data_morte": "23 August 1935",
  "local_morte": "Schaffhausen, Switzerland",
  "summary": "Julius Gysel was a Swiss school-teacher with an interest in geometry.",
  "biografia": "Julius Gysel\n's family had been living in the small town of Wilchingen since at least the\n16\nth\ncentury\n[\n10\n]\n. His father was Johannes Gysel\n(1815\n-\n1875)\n, a council clerk; he also served as president of the town council and later on as Kantonsrat. His mother was Maria Verena Waldvogel\n(1821\n-\n1903)\n[\n2\n]\n. Gysel grew up in his hometown with his four siblings and attended elementary school there. He then attended the Realschule in Neunkirch\n(\ncanton Schaffhausen\n)\n, followed by four years at the\nGymnasium\nin Schaffhausen. There he discovered his passion for mathematics, but he excelled in all other subjects as well.\nAfter being awarded his Matura in\n1869\n, Gysel studied mathematics at the Polytechnic until\n1872\n. Moreover, he attended lectures on history and art history by Johannes Scherr and Gottfried Kinkel, respectively. Among his mathematics teachers was\nGeiser\n, in fact, \"his favourite teacher was the influential\nKonrad\n[\nsic!\n]\nFriedrich Geiser\n\"\n[\n13\n]\n. The two men formed a life-long friendship. Geiser also suggested the topic for Gysel's doctoral thesis\nSynthetische Untersuchung eines Orthogonalflächensystems\nⓉ\n(\nA synthetic analysis of a system of orthogonal surfaces\n)\n, which he submitted at the University of Zürich in\n1874\nand dedicated to Geiser\n[\n3\n]\n. Subsequently, Gysel attended mathematics lectures at the University of Bern for a year, notably those by\nGeorg Sidler\nand\nLudwig Schläfli\n. He remained good friends with the latter until\nSchläfli\n's death. A number of letters that both\nSchläfli\nand\nGeiser\nwrote to Gysel over the course of their decades-long friendships have survived; analyses of these letters and translations can be found in\n[\n1\n]\n.\nWhilst writing his thesis, Gysel worked as a supply teacher for mathematics at the Kantonsschule in Schaffhausen from\n1872\n-\n1874\n. He must have made a very good impression, as he was offered a full position upon his return from Bern the following year despite his young age. As was common at the time, the school had two tracks, a classical one and science one. Gysel taught mathematics in the classical track until his retirement in\n1926\n. In addition, he took on responsibility for the physics classes in both tracks until\n1919\n.\nAccording to Schnyder\n[\n11\n]\nand Scherrer\n[\n10\n]\n, Gysel's pupils were always well prepared for university studies, notably at the Polytechnic. Indeed, former pupils attest to the quality of Gysel's teaching in\n[\n13\n]\n:-\nGysel taught as if at university. In physics, we were presented with experimental lectures, broken up by a few revision classes. At this level of education, this is a risk. The success\n[\nof this method\n]\n, with exceptions, was due to the physics experiments, which fascinated the pupils, on the one hand; and to the well-structured, educational lectures on the other hand, paired with excellent experimental skills.\nHowever, as Scherrer notes,  \"according to\n[\nGysel's\n]\nown confession, neither particular aptitude, nor specific training or manual skill seemed to predestine him for teaching physics\"\n[\n10\n]\n. Gysel preferred mathematics, and he was well aware of the challenges that faced any teacher of mathematics\n[\n10\n]\n:-\nAccording to Gysel himself, mathematics is the least popular and least enjoyable subject for many pupils, because it demands strict, implacable logic and a selfless devotion to the subject matter. However, he was capable of teaching with such clarity that less talented pupils also profited\n[\nfrom his lessons\n]\n; this was because\n[\ntheir\n]\nteacher was never scathing about their shortcoming, but tried to support them as much as possible, with great wisdom and patience.\nDespite all the educational reforms since Gysel's death, his observation about the popularity of the school subject mathematics still holds true today -- surely many of today's mathematics teachers would agree with him.\nGysel greatly influenced the school not only as a teacher, but also in his capacity as headmaster in particular. In\n1881\nhe was appointed deputy headmaster,  \"which could be seen as an exceptional mark of confidence\"\n[\n8\n]\n. Not only had his predecessor been held in high regard, but also, more importantly,  \"the powers of the deputy headmaster were vested in a representative of the sciences\"\n[\n8\n]\n. Three years later, Gysel was appointed headmaster, which was the first time that a science teacher was appointed to such a senior position\n[\n5\n]\n. He only stepped down in\n1909\n. His appointment as headmaster coincided with a general change in education across Switzerland and Germany: during the second half of the\n19\nth\ncentury, and particularly towards its end, the sciences became more and more important in the curricula of secondary schools; polytechnics were not only founded, but were also awarded university status\n[\n6\n]\n. Gysel's passion for physics experiments and technological progress\n(\nsee paragraph below\n)\nis representative of his time. Similarly, his appointment can be seen as an indication of the gradual revaluation of scientists.\nDuring his time in office the school prospered: teaching of the sciences was enhanced, the laboratories were expanded, a third track for future teachers was established in\n1897\n[\n4\n]\n, the number of pupils doubled, and, as his crowning achievement, the school moved into a new building in\n1902\n.\nGysel aka  \"Tschuli\" was quite popular among his pupils, not only as a teacher, but also as headmaster. As K Bächtold writes in\n[\n4\n]\n,  \"it has been attested a hundredfold that the headmaster was an enthusiastic and inspiring teacher, respected and loved by the pupils\". The school's pupil corporation, Scaphusia\n(\none of the oldest of its kind in Switzerland and similar to the better known student corporations, whose nearest equivalent in the English-speaking world are the US-American fraternities\n)\n, awarded him honorary membership in recognition of his benevolence towards the society. For more details see\n[\n5\n]\n, where an entire chapter is dedicated to Gysel. Furthermore, the dialect writer Albert Bächtold\n(1891\n-\n1981\n, also from Wilchingen\n)\nhonoured Gysel's influence on his own life in his novel\nDe Studänt Räbme\nⓉ\n(\nThe student Rabne\n)\n(1947)\n: The headmaster in the novel, called  \"Vatter\"\n(\n\"father\"\n)\n, is based on Gysel. The writer described his teacher as follows\n[\n4\n]\n:-\nTschuli: something powerful, clear and straight; you know at first sight that there are no backdoors here, nor any intrigues.\n[\nand\n]\nYou will find such a man only once in a hundred years.\nThroughout his life, Gysel educated himself further, both in his subjects and in educational matters. He advocated extended and better teaching of physics, and set up the school's physics laboratories. Indeed,  \"he witnessed and participated in the astounding development of technology\"\n[\n10\n]\nduring his professional life. An example of this interest is the X-ray chamber that he set up in the new school building, and which was used by the local hospital as well. He continued working in the chamber even after his retirement. The new school was also equipped with eight laboratories and two libraries as well as current transformers and a dynamo, which generated the energy needed for physics experiments\n[\n7\n]\n.\nGysel was also a keen member of the\nNaturforschende Gesellschaft Schaffhausen\n, his local Society for Natural Scientists, from\n1876\nonwards. From\n1905\n-\n1920\nhe served as the Society's vice president, and was made an honorary member in\n1922\n. Over the course of the years, he gave a number of talks at the society's meetings as well as elsewhere, predominantly on topics in physics. In addition, he taught experimental physics courses for teachers, and a popular lecture course on radiology in\n1920\n/\n21\n[\n13\n]\n. Gysel became a member of the\nDeutsche Mathematiker-Vereinigung\nin\n1897\n. He was also among a large number of Swiss secondary schoolteachers who attended the First International Congress of Mathematicians in Zürich.\nHis teaching and administrative duties left him little time for research. The list of his publications comprises only seven items: apart from his doctoral thesis, Gysel published three papers on problems in geometry as part of his school's Osterprogramme:\nBeiträge zur analytischen Geometrie der Kurven und Flächen\n2\n. Grades\nⓉ\n(\nContributions to analytic geometry of curves and surfaces of the second degree\n)\n(1877)\n;\nÜber die sich rechtwinklig schneidenden Normalen einer Fläche\n2\n. Grades\nⓉ\n(\nOn the intersecting at right angles of normals to a surface of the second degree\n)\n(1885)\n;\nZur Konstruktion des Schwerpunktes einer ebenen Vielecksfläche\nⓉ\n(\nOn the construction of the centre of gravity of a plane triangular face\n)\n(1894)\n. As Uehlinger recounts in\n[\n13\n]\n, the\n1894\npaper was, according to Gysel, the most widely recognised one, and included in L Henneberg's\nDie graphische Statik der starren Systeme\nⓉ\n(\nThe graphical statics of rigid systems\n)\n(1911)\n. The other publications are a report on the Kantonsschule's new building\n(1903)\n, an obituary of his friend Jakob Amsler-Laffon\n(1912)\n, and the chapter on\nMathematics, Astronomy, Technology and Physics\nin the centennial publication of the\nNaturforschende Gesellschaft Schaffhausen\nⓉ\n(\nNature Research Society of Schaffhausen\n)\n(1923)\n.\nOn top of his school duties, Gysel took on a number of positions in various committees, which again reflect his interest in education and in technological progress. From\n1889\n-\n1920\nhe served on the Erziehungsrat; he also acted as examiner at Matura examinations and the Polytechnic's entry exams for many years. Moreover, he was member of the town's library committee from\n1888\n-\n1929\n, responsible for mathematics, astronomy, physics, technology and alpinism. For a while, he was on a committee studying the implementation of electric lighting, and for some years he was a member of the supervisory board of the Light-and-Waterworks Schaffhausen.\nIn recognition of his contributions, he was made an  \"Ehrenbürger\"-- an honorary citizen, of Schaffhausen in\n1922\n-- this is comparable to being awarded the Freedom of the City in Great Britain.\nOn\n3\nAugust\n1876\n, Gysel married Barbara Carolina Bollinger from Schaffhausen. In various obituaries their\n59\n-year long marriage is described as a happy one. The couple had two sons and two daughters, as well as nine grandchildren. One of their sons, also called Julius\n(1881\n-\n1972)\n, graduated as a mechanical engineer from the ETH in\n1906\nand worked for an electric power company. In his obituary, his parents' home is described as a place with  'simple living, hard work, and a lot of music'\n[\n9\n]\n.\nThroughout his life, Gysel was in excellent health  -- as Schnyder writes,  \"during the\n53\n½  years of teaching,\n[\nhe\n]\nwas never off sick, even for a single period\"\n[\n11\n]\n. A keen mountaineer, he climbed\n33\nmountains over\n3000\nm, and kept up his hobby until his late\n70\ns. He co-founded his local branch of the Swiss Alpine Club and led numerous youth hikes\n[\n12\n]\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Geiser",
    "Konrad[sic!]Friedrich Geiser",
    "Georg Sidler",
    "Ludwig Schläfli",
    "Schläfli",
    "Deutsche Mathematiker-Vereinigung"
  ],
  "imagens": [
    "gysel.jpg"
  ]
}