{
  "nome_completo": "Karl Friedrich Geiser",
  "nome_curto": "Karl Geiser",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Geiser/",
  "data_nascimento": "26 February 1843",
  "local_nascimento": "Langenthal, Bern, Switzerland",
  "data_morte": "7 May 1934",
  "local_morte": "Küsnacht, Zürich, Switzerland",
  "summary": "Karl Geiser was a Swiss mathematician who worked in algebraic geometry and minimal sufaces. He organised the first International Mathematical Congress in Zurich.",
  "biografia": "Karl Geiser\n's first name is often written as Carl. His father was Friedrich Geiser, a butcher who ran a local inn. Friedrich was influential in the district being a member of the Cantonal legislature at Berne. Karl's mother was Elisabeth Begert. There was a famous mathematician in Karl's family for his great uncle was\nJakob Steiner\n; this certainly helped Karl in his career, particularly when he went to the University of Berlin. Before studying at Berlin he spent four semesters as a student at the Polytechnikum in Zürich\n(\nit was founded in\n1855\nas the Eidgenössische Polytechnische Schule and renamed the Eidgenössische Technische Hochschule in\n1911)\n. Then he spent a further four semesters at the University of Berlin where he was taught by\nKarl Weierstrass\nand\nLeopold Kronecker\n. Coming from a family with little money to support the education of their children, Geiser had to support himself while studying in Berlin. He did this by taking private pupils and\nWeierstrass\nand\nKronecker\nboth helped by finding pupils for him. He graduated in\n1863\nand was appointed as a\ndozent\nat Zürich Polytechnikum. He undertook research for his doctorate at the University of Bern advised by\nLudwig Schläfli\n. He was awarded his doctorate in July\n1866\nfor his dissertation\nBeiträge zur synthetischen Geometrie\nⓉ\n(\nContributions to synthetic geometry\n)\n. In Zürich he took on the duties of a professor after the death of Joseph Wolfgang von Deschwanden\n(1819\n-\n1866)\n, the professor of descriptive geometry, until the chair could be filled. Note that\nTheodor Reye\nalso assisted with Deschwanden's teaching. In May\n1867\nWilhelm Fiedler\nwas appointed to fill Deschwanden's chair.\nAt Zürich Polytechnikum, Geiser was appointed as an extraordinary professor in\n1869\n, and then in\n1873\nhe was appointed to a full professorship of higher mathematics and synthetic geometry, with special responsibility for teaching mathematics to engineering students and to mathematics students. Geiser had a number of famous colleagues at Zürich Polytechnikum, first\nGeorg Frobenius\nbetween\n1875\nand\n1892\n, and then\nAdolf Hurwitz\nwho filled\nFrobenius\n's chair.\nHurwitz\nremained in Zürich until his death in\n1917\n. Geiser taught\nalgebraic geometry\n(\nhis own research topic\n)\n,\ndifferential geometry\nand\ninvariant theory\nat Zürich. He was more interested in teaching mathematicians than engineers and he appears to have been a rather unpopular lecturer with some of the engineers\n[\n3\n]\n:-\nHe was rather exacting in his expectations from his students and, for this reason, was not always very popular, especially among the engineers.\nHis teaching did, however, make an important contribution to general relativity in an indirect fashion.\nAlbert Einstein\nwas a student at the Zürich Polytechnikum from October\n1896\nuntil he graduated in July\n1900\n. He attended some of Geiser's lectures and towards the end of his life recalled his fascination with Geiser's\nInfinitesimalgeometrie\ncourse. In this course Geiser taught the Gaussian theory of surfaces and, in\n1912\n,\nEinstein\nhad what he described as \"the decisive idea\" of an analogy between general relativity and Gaussian surfaces.\nGeiser published on algebraic geometry and minimal surfaces. In\n1865\nhe published a paper\nÜber eine geometrische Verwandtschaft des zweiten Grades\nⓉ\n(\nOn a geometric relationship of the second degree\n)\non a quadratic transformation called 'quadric inversion' which was discovered in the same year by\nThomas Hirst\n. Papers such as\nÜber die Normalen der Kegelschnitte\nⓉ\n(\nOn the normals of conics\n)\n(1866)\nfollowed. One of his most important results explains how the\n28\ndouble tangents of the plane\nquadric\nare related to the\n27\nstraight lines of the cubic surface. This appears in his\n1869\npaper\nÜber die Doppeltangenten einer ebenen Curve vierten Grades\nⓉ\n(\nOn the double tangents of a plane curve of the fourth degree\n)\npublished in\nMathematische Annalen\n. He is also remembered by those working in algebraic geometry for his discovery of an involution, now named after him, which appears in his paper\nZwei Geometrische Probleme\nⓉ\n(\nTwo Geometric Problems\n)\n(1867)\n. Later papers include\nNotiz über die algebraischen Minimumsflächen\nⓉ\n(\nNote on the algebraic minimum surfaces\n)\n(1871)\n,\nZum Hauptaxenproblem der Flächen zweiten Grades\nⓉ\n(\nOn the principal axes problem of surfaces of the second degree\n)\n(1877)\n, and\nÜber einen fundamentalen Satz aus der kinematischen Geometrie des Raumes\nⓉ\n(\nOn a fundamental set of the kinematic geometry of space\n)\n(1881)\n.\nHowever Geiser's most important contribution was not in his original research but rather in his political skills in organising the educational system in Switzerland\n[\n1\n]\n:-\nAcquainted with many persons in the fields of politics and economics as well as with important mathematicians in the neighbouring countries, and a close adviser of the chairman of school supervisors, Geiser worked effectively within the professoriate to attract first-rate teachers. There devolved upon him, above all, the instruction of candidates for the teaching of algebraic geometry, differential geometry, and invariant theory.\nAssociated to his work in this area is his book\nEinleitung in die synthetische Geometrie. Ein Leitfaden beim Unterrichte an höheren Realschulen und Gymnasien\nⓉ\n(\nIntroduction to synthetic geometry. A guide at the lessons of higher secondary schools\n)\n(1869)\n.\nArnold Emch, who was a student of Geiser's, explains how he\n[\n3\n]\n:-\n... was very influential in bringing the Cantonal\n(\nor secondary\n)\ncolleges of Switzerland to a higher level of teaching and of professional qualifications for teachers of those schools.\nHe also made a major contribution to making the Zürich Polytechnikum one of the leading institutions in the world. For ten years he was its director\n(1881\n-\n1887\nand\n1891\n-\n1895)\nand the mathematicians who taught there during this period indicate the high status it was achieving:\nRichard Dedekind\n, Heinrich Durege,\nElwin Christoffel\n,\nHermann Schwarz\n,\nHeinrich Weber\n,\nTheodor Reye\n,\nWilhelm Fiedler\n,\nGeorg Frobenius\n,\nFriedrich Schottky\n,\nAdolf Hurwitz\n,\nHermann Minkowski\nand\nErnst Zermelo\n. One of the important decisions which faced the Zürich Polytechnikum during the period he served as director was whether it was an institution devoted to practical subjects relating to industrial production or to technical and theoretical expertise in mathematics and similar subjects. It was in large part due to Geiser that when the laboratories were rebuilt in the\n1880\ns and\n1890\ns, theoretical knowledge in scientific experimentation was seen to be an important aspect of good teaching. He argued that the Polytechnikum should also teach students abstract ideas and show how they might be applied and adapted to assist industrial processes. Through his excellent leadership, an good balance was achieved making the Polytechnikum part university, part laboratory, and part industrial training centre.\nAlthough Geiser was helped in his career by his relationship with\nJakob Steiner\n, he repaid the debt by editing\nSteiner\n's unpublished lecture notes and treatises. For example he published\nDie Theorie der Kegelschnitte in elementarer Darstellung. Auf Grund von Universitätsvorträgen und mit Benutzung hinterlassener Manuscripte Jacob Steiner's\nⓉ\n(\nThe theory of conic sections in elementary representation. Using university lectures and  posthumous manuscripts of Jacob Steiner\n)\n(1867)\n,\nConstruction der Fläche zweiten Grades durch neun Punkte: Nach den hinterlassenen Manuscripten Jacob Steiners dargestellt von Herrn C F Geiser in Zürich\nⓉ\n(\nConstruction of quadric by nine points: After the posthumous manuscripts of Jacob Steiner presented by Mr C F Geiser in Zurich\n)\n(1868)\n, and\nZur Erinnerung an Jakob Steiner\nⓉ\n(\nIn memory of Jakob Steiner\n)\n(1874)\n.\nAnother important contribution which Geiser made, that was not in the area of research, was to organise the first International Congress of Mathematicians held in Zürich in\n1897\n. He was president of the organising committee and in this role he gave an address at the opening ceremony on Monday\n8\nAugust in the Aula of the Polytechnikum\n[\n2\n]\n:-\nIn a long and florid address\n[\nGeiser\n]\npraised the Swiss mathematical glories: Jacob, Johann, and\nDaniel Bernoulli\n,\nLeonhard Euler\n, and\nJakob Steiner\n.\nIn his speech, he also explained that Zürich had been chosen as the venue for the first International Congress because it was \"at the crossroad of the large railways from Paris to Vienna and from Berlin to Rome\". Following his speech, he was elected president of the Congress \"by acclamation\". We should note that, although\n90\nyears old, he was able to be present at the next International Congress of Mathematicians held in Zürich in\n1932\n.\nGeiser was honoured with election as one of the first three honorary members of the\nSwiss Mathematical Society\n, elected in session\n1911\n-\n12\n. He had been elected as a foreign member of the\nGerman Academy of Scientists Leopoldina\non\n9\nDecember\n1888\n.\nEmch tells us something of Geiser's character in\n[\n3\n]\n:-\nAlthough a good European in the best sense of the word, Geiser remained a rugged individualist of the old Swiss type. ... He hated all pretence and always worked in support of real merit. True friendship was guarded as a treasure by him. ... Although struck by loss of clear eyesight and temporary blindness which was later partly removed by a surgical operation, Geiser's mind remained active and alert. When\n89\nyears of age, being especially fond of Italian culture, he insisted on being taken to Zürich from his Chalet on the lovely mountain-side of Lake Zürich to hear a lecture on Dante by the Swiss-Italian poet Chiesa. The writer last saw Geiser in the spring of\n1929\n, when he spent a friendly afternoon with him at his home on the lake.",
  "matematicos_citados_na_biografia": [
    "Jakob Steiner",
    "Karl Weierstrass",
    "Leopold Kronecker",
    "Weierstrass",
    "Kronecker",
    "dozent",
    "Ludwig Schläfli",
    "Theodor Reye",
    "Wilhelm Fiedler",
    "Georg Frobenius",
    "Adolf Hurwitz",
    "Frobenius",
    "Hurwitz",
    "algebraic geometry",
    "differential geometry",
    "invariant theory",
    "Albert Einstein",
    "Einstein",
    "Thomas Hirst",
    "quadric",
    "Richard Dedekind",
    "Elwin Christoffel",
    "Hermann Schwarz",
    "Heinrich Weber",
    "Friedrich Schottky",
    "Hermann Minkowski",
    "Ernst Zermelo",
    "Steiner",
    "Daniel Bernoulli",
    "Leonhard Euler",
    "Swiss Mathematical Society",
    "German Academy of Scientists Leopoldina"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}