{
  "nome_completo": "Karlis Zalts",
  "nome_curto": "Karlis Zalts",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zalts/",
  "data_nascimento": "10 March 1885",
  "local_nascimento": "Burtnieki, Latvia",
  "data_morte": "1953",
  "local_morte": "Riga, Latvia",
  "summary": "Karlis Zalts was a Latvian mathematician with wide-ranging interests in topics such as mechanical calculators, statistics and nomography as well as folklore, education, and philosophy.",
  "biografia": "Karlis Zalts\nwas educated at the Real\nGymnasium\nin Jelgava, which is a Latvian city southwest of Riga. His schooling was at a time when Latvia was dominated by Russia, as it had been from the end of the\n18\nth\ncentury, and the domination would continue until World War I. After Zalts graduated from the Gymnasium in Jelgava in\n1904\nhe went to Ukraine and studied engineering at the Kiev Polytechnic Institute. He graduated from the Institute in\n1912\nand began teaching in Kiev.\nDuring\n1917\nthe Russian domination of Latvia ended and, after a brief period of German invasion, the country became independent in a proclamation made on\n18\nNovember\n1918\n. Zalts returned to Latvia in\n1921\nand was appointed to the University of Latvia in Riga. There he taught mathematics to engineering students until\n1938\n.\nZalts was someone of varied interests and during the\n1920\ns, not only did he publish on mechanical calculators, statistics and nomography\n(\ngraphic representation of data\n)\n, but he also published on folklore, education, and philosophy. By\n1928\nhe had made a decision to become more deeply involved with mathematical research and he registered as a student in the Faculty of Mathematics and Natural Sciences although he continued to teach mathematics to engineers. By\n1937\nhe had been awarded a Master's Degree in nomography and he was appointed as a\ndozent\nin the Faculty of Mathematics and Natural Sciences.\nPolitical moves which would have a major impact on Zalts' career were soon happening, in particular the German-Soviet Nonaggression Pact was signed in August\n1939\nand from that time on Latvia was doomed to lose its independence again. On\n17\nJune\n1940\nthe Red Army invaded Latvia and only three days later a new government of Soviet supporters was announced. They voted on\n21\nJuly for Latvia to become a part of the USSR and on\n5\nAugust this became official. The Soviet occupation saw around\n35\n,\n000\nLatvians deported to Russia within a year. During this extremely difficult period the University of Latvia continued to operate and Zalts undertook research towards his thesis.\nThe German army invaded the USSR in July\n1941\n. For a period Latvia was a province of a larger Ostland\n(\nincluding Estonia, Lithuania, and Belorussia\n)\n. Zalts continued research at the University of Latvia and in February\n1944\nhe was awarded his doctorate for his thesis on the geometry of deformations. However, shortly after this he was forced by the Germans to go to Dresden to work in a plant which was developing optical equipment for military purposes. He undertook research at the plant until\n1\nMay\n1945\n. The Soviet army had again marched into Latvia in\n1944\nand a renewed period of Soviet domination began. The army reached the Dresden plant where Zalts was working on\n1\nMay\n1945\nand he was required by the Russians to work as an an interpreter for the Red Army until\n1\nSeptember of that year. The Russians then took him to Moscow where he was given a job as a scientific consultant for the Special Construction Bureau. On\n16\nMarch\n1946\nhe was allowed to return to Riga.\nOne might think that Zalts problems would end there, but they did not. He worked for a while in the library, then began teaching again in the Faculty of Engineering Sciences of the University of Latvia. The various Institutes of the\nLatvian Academy of Sciences\nwere being set up at this time and Zalts was about to be appointed when Soviet checks of his suitability were run and his publications on folklore, education, and philosophy in the\n1920\ns and\n1930\ns were discovered. Also significant was the fact that he had been a major contributor to the Latvian Encyclopedia. This meant that he was the author of a great deal of work which was then banned by the Soviet authorities as they made strenuous efforts to transform the country into a typical Soviet one. Their policy of severe political repression and extreme Russification meant that Zalts became an \"unwelcome person\". He was allowed to continue teaching mathematics to engineers, but he was not allowed to publish, nor to attend conferences, nor to be promoted at the University.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "dozent",
    "Latvian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}