{
  "nome_completo": "Karl Wilhelm Feuerbach",
  "nome_curto": "Karl Feuerbach",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Feuerbach/",
  "data_nascimento": "30 May 1800",
  "local_nascimento": "Jena, Germany",
  "data_morte": "12 March 1834",
  "local_morte": "Erlangen, Germany",
  "summary": "Karl Feuerbach was a geometer who discovered the nine point circle of a triangle.",
  "biografia": "Karl Feuerbach\n's mother was Eva Wilhelmine Maria Troster\n(1774\n-\n1852)\n, described by relatives as having a rare goodness and sweetness, and his father was Paul Johann Anselm Ritter von Feuerbach\n(1775\n-\n1833)\n, a professor of law at the University of Jena who wrote the Bavarian criminal code. Eva and Paul had eleven children, the first eight being boys and the last three girls. Three of the eight boys died as infants leaving eight children who grew to adulthood. Of these eight children, five sons were to be awarded a doctorate, three of them becoming a professor, the most famous being the philosopher\n(\nwithout ever being professor\n)\nLudwig Andreas Feuerbach\n(1804\n-\n72)\nwho was one of the very influential critics of religion and thus of great importance for Marx and Marxism. The other boys were Joseph Anselm Feuerbach\n(1798\n-\n1851)\n, philologist and archeologist, Eduard August Feuerbach\n(1803\n-\n1843)\n, professor of law at the University of Erlangen, and Friedrich Heinrich Feuerbach\n(1806\n-\n1880)\n, an orientalist.\nPaul Feuerbach had been sixteen years of age when he left home, against his father's wishes, to study philosophy and history at the University of Jena. He became highly successful as a lawyer and eventually was able to make peace with his father who forgave him, after much pleading, for running away and disobeying him. On\n16\nNovember\n1802\n, Paul wrote to his father describing his young son Karl\n(\nthe subject of this biography\n)\nwho was approaching the age of\n30\nmonths at this time\n(\nsee\n[\n3\n]\n, also quoted in\n[\n4\n]\n)\n:-\n... my youngest son Karl is a healthy, red cheeked, fat youngster, who runs around happily and has little thought for anything except food.\nThe family moved around as Paul Feuerbach's fame took him from one city to another. They were in Jena when Karl was born but soon moved to Kiel. In the winter of\n1804\nPaul writes in a letter\n(\nsee\n[\n3\n]\n)\nthat he has just taken his wife and three boys from Kiel to Landshut in Bavaria. They made the journey in an open-topped wagon in freezing weather. Later they moved from Landshut to Munich\n(\nabout\n65\nkm\n)\nand, in\n1814\n, from Munich to Bamberg\n(\nover\n200\nkm north of Munich\n)\n. Karl and his elder brother Anselm were attending a\nGymnasium\nin Munich when their father moved to Bamberg and they were left in Munich to complete their schooling. Both boys entered the University of Erlangen in\n1817\nwhere they were brilliant students. In fact Paul Feuerbach's fame had been recognised by King Maximilian Joseph who had ennobled  him in\n1808\nand awarded him free university education for all his sons. In\n1819\nPaul Feuerbach was appointed as President of the Court of Appeals in Ansbach. He wrote a letter in December of that year in which he proudly describes his son Karl's outstanding abilities in mathematics and physics and his achievements at the University of Erlangen. Clearly Paul, coming from a family with a tradition in law, would have liked his sons to follow the 'family profession' but he writes that although Karl has given thought to the legal profession, nevertheless, his intention at the time was to become an engineer in the army.\nAfter spending three years studying at the University of Erlangen, Karl Feuerbach moved to the University of Freiburg im Breisgau in\n1820\n. This was a move designed to allow him to study under Karl Heribert Ignatius Buzengeiger\n(1771\n-\n1835)\nwho had taught in Ansbach before been appointed to the University of Freiburg in the previous year; indeed this move was very fruitful as Feuerbach had hoped. Feuerbach's father, however, although as one might imagine very proud of his son's accomplishments, nevertheless was worried that Karl might find problems in Bavaria since he was not a Bavarian by birth. Moreover, as a Protestant he was likely to suffer discrimination in the predominantly Roman Catholic Bavaria. These fears seemed groundless, however, when by the age of twenty-two, Karl Feuerbach had been awarded his doctorate, been appointed to a professorship in mathematics at the Gymnasium at Erlangen and had published an extremely important mathematical work\nEigenschaft einiger merkwürdigen Punkte des geradlinigen Dreiecks und mehrerer durch sie bestimmten Linien und Figuren\nⓉ\n(\nProperty of some strange points of the rectilinear triangle and its lines and figures\n)\n.\nHis life, however, did not go well and it is unclear whether the misfortunes that followed were simply that or whether they were motivated by political enemies of his father. There seems little doubt that as a student Feuerbach had been, as many young men, somewhat rebellious. He had joined an organisation with political aims\n(\nagain many students do this\n)\nbut he had also behaved in an irresponsible way incurring debts despite the wealthy family from which he came. One day as he walked to the Gymnasium at Erlangen where he was teaching, he was arrested. Around twenty young men, all members of the same student organisation, had been rounded up and arrested at this time. Feuerbach and the other nineteen were imprisoned in the New Tower in Munich. A description of what happened after this is contained in a letter his father wrote on\n1\nJuly\n1827\n[\n3\n]\nand is recounted in\n[\n4\n]\n:-\n... the weeks and months were allowed to drag on without action and that Karl was not allowed to receive letters or visitors. Karl became obsessed by the idea that only his death could free his\n19\ncompanions. He made two separate attempts at suicide. One evening he was found unconscious from loss of blood after having cut the veins in his feet. He was transferred to a hospital and then made a second attempt at suicide by jumping out a window. He was saved from death by landing in a deep snow bank but was permanently crippled as a result of the accident. The father writes bitterly of the fact that he was not more closely guarded, particularly since he had been declared on the verge of a mental breakdown when he was arrested.\nIt was not long after his attempted suicide that Karl Feuerbach was released on condition that he was looked after by Friedrich Wilhelm Thiersch\n(1784\n-\n1860)\n, a classical scholar and educationalist and friend of the Feuerbach family, who had taught Karl when he had attended the Gymnasium in Munich. This release allowed Feuerbach to await trial out of prison and indeed the trial eventually went ahead only to result in the release and total vindication of all concerned\n(\none of the men had died in prison so there were only\n19\nto be declared 'not guilty'\n)\n. Feuerbach had been undertaking mathematical work while in prison and once released, all he wanted to do was to be with his brothers, sisters and father in Ansbach while he continued with this research. He was not in a sufficiently strong mental state to resume teaching for about a year and when he did it was at the Gymnasium at Hof. This appointment as professor of mathematics had been arranged by King Maximilian Joseph who made strenuous efforts to help all the young men who had been imprisoned. However, Feuerbach was not happy at Hof, missing the quiet life he had with his family at Ansbach. His mental state deteriorated and two of his brothers went to Hof to help him to go to Erlangen for medical treatment. Part of the reason for choosing Erlangen was the knowledge that Feuerbach had been happy there. He made a steady recovery and soon he appeared to be sufficient well to resume teaching, which he did in\n1828\nat the Gymnasium at Erlangen. However, he was not really in a good enough mental state as events were to show\n[\n4\n]\n:-\n... one day he appeared in class with a drawn sword and threatened to cut off the head of every student in the class who could not solve the equations he had written on the blackboard. After this episode he was permanently retired. Gradually he withdrew more and more from reality. He allowed his hair, beard, and nails to grow long; he would stare at occasional visitors without any sign of emotion; and his conversation consisted only of low mumbled tones without meaning or expression.\nHe only lived for a further six years and these he spent in Erlangen living as a recluse.\nFeuerbach's fame is as a geometer who discovered the nine point circle of a triangle. This is sometimes called the\nEuler\ncircle but this incorrectly attributes the result. Feuerbach also proved that the nine point circle touches the\ninscribed\nand three escribed circles of the triangle. These results appear in his\n1822\npaper, and it is on the strength of this one paper that Feuerbach's fame is based. He wrote in that paper:-\nThe circle which passes through the feet of the altitudes of a triangle touches all four of the circles which are tangent to the three sides of the triangle; it is internally\ntangent\nto the inscribed circle and externally tangent to each of the circles which touch the sides of the triangle externally.\nThe nine point circle which is described here had also been described in work of\nBrianchon\nand\nPoncelet\nthe year before Feuerbach's paper appeared. However\nJohn Sturgeon Mackay\nnotes in\n[\n5\n]\nthat Feuerbach gave:-\n... the first enunciation of that interesting property of the nine point circle\nnamely that \"it is internally tangent to the inscribed circle and externally tangent to each of the circles which touch the sides of the triangle externally.\" The point where the incircle and the nine point circle touch is now called the Feuerbach point.\nYou can see a diagram showing the Feuerbach point at\nTHIS LINK\n.\nFeuerbach did undertake further mathematical research. He sent a note from Ansbach to the journal\nIsis\n(\ndated\n22\nOctober\n1826)\nentitled\nEinleitung zu dem Werke Analysis der dreyeckigen Pyramide durch die Methode der Coordinaten und Projectionen. Ein Beytrag zu der analytischen Geometrie von Dr. Karl Wilhelm Feuerbach, Prof. d. Math.\nⓉ\n(\nIntroduction to the analysis of the triangular pyramid, by means of the methods of coordinates and projections. A study in analytic geometry by Dr Karl Wilhelm Feuerbach, Professor of Mathematics\n)\n. This note announced results which were to appear in full in a later publication and indeed they did in a\n48\n-page booklet\nGrundriss zu analytischen Untersuchungen der dreyeckigen Pyramide\nⓉ\n(\nFoundations of the analytic theory of the triangular pyramid\n)\npublished in\n1827\n. This is a second major work by Feuerbach and it has been studied carefully by\nMoritz Cantor\nwho discovered that in it Feuerbach introduces homogeneous coordinates. He must therefore be considered as the joint inventor of homogeneous coordinates since\nMöbius\n, in his work\nDer barycentrische Calcul\nⓉ\n(\nThe barycentric calculus\n)\nalso published in\n1827\n, introduced homogeneous coordinates into analytic geometry.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Euler",
    "inscribed",
    "tangent",
    "Brianchon",
    "Poncelet",
    "John Sturgeon Mackay",
    "THIS LINK",
    "Moritz Cantor",
    "Möbius"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}