{
  "nome_completo": "Kazimierz Abramowicz",
  "nome_curto": "Kazimierz Abramowicz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abramowicz/",
  "data_nascimento": "4 March 1888",
  "local_nascimento": "Brzeziny, Łódź Voivodeship, Russian Empire (now Poland)",
  "data_morte": "10 September 1936",
  "local_morte": "Poznań, Poland",
  "summary": "Kazimierz Abramowicz was a Polish mathematician who lived through difficult times in the early 1900 s in Europe. He studied in Kyiv and worked most of his career at the University of Poznań.",
  "biografia": "Kazimierz Abramowicz\nwas the son of Tomasz Franciszek Abramowicz\n(1863\n-?\n)\n, a teacher at the school in Lutosławice Rządowe, and Maria Petronela Gniotek\n(1867\n-\n1944)\n. Lutosławice Rządowe is south of the city of Łódź and north of Piotrków Trybunalski. The region was originally in Poland but in the Second Partition of Poland in\n1793\nit was annexed to Prussia. After Napoleon's conquest it became part of the Napoleonic Duchy of Warsaw but the\n1815\nCongress of Vienna saw the region incorporated into the Russian Empire. There were continuing tensions between Poles and the Russian authorities and there was a Polish uprising in\n1863\n. Tomasz and Maria Petronela had three children, Kazimierz Abramowicz\n(1888\n-\n1936)\n, the subject of this biography,\nIzabela Abramowicz\n(1889\n-\n1973)\n, who became a mathematician and has a biography in this archive, and Zygmunt Abramowicz\n(1893\n-\n1966)\n. Although Kazimierz was born on Brzeziny, the town of his mother's birth east of the city of Łódź, both his siblings were born in Lutosławice Rządowe where the family lived.\nIn\n1898\n, at the age of ten, Abramowicz began his secondary education at the State Gymnasium in Piotrków Trybunalski. The economy of the area deteriorated in early\n1900\ns with many Polish workers losing their jobs. There were protests by Poles who wanted an independent Poland and opposed the government's policy of Russification. Strikes and protests began in the Łódź region even before the Russian Revolution began on\n22\nJanuary\n1905\n. Strikes caused school closures, many lost their lives when Russian police fired on protesters, and there was fighting in Łódź, Piotrków Trybunalski and other major towns in the region. In order to complete his secondary school education, Abramowicz interrupted his studies in Piotrków Trybunalski and transferred to the State Gymnasium in Bobruisk. This city had been in Poland but had gone through the same changes as the Łódź region to end up in the Russian Empire in\n1815\n. Today, however, it is in Belarus. Abramowicz took his  matriculation examinations and graduated from the State Gymnasium in Bobruisk in\n1907\n. Later in that year he entered the Faculty of Physics and Mathematics of the St Vladimir Imperial University of Kiev\n(\nnow the Taras Shevchenko National University of Kyiv, Ukraine\n)\n. The university had been founded in\n1834\nand had, from its foundation, a strong school of mathematics.\nThis was a particularly difficult time for anyone to be studying at the University of Kiev since it was a time of mass student protest associated with the Russian Revolution of\n1905\n. There was unrest among students caused by events at universities across the country. Student strikes and student riots were monitored by the Kiev Secret Police. Abramowicz was not alone in Kiev, however, for his sister\nIzabela Abramowicz\nalso began her studies at the University of Kiev in\n1907\n. We are unsure exactly when Abramowicz's mother came to Kiev, but certainly at some stage the three were living together in Kiev.\nAt the University of Kiev, Abramowicz was taught mathematics by, among others,\nBoris Yakovlevic Bukreev\nand\nDmitry Aleksandrovich Grave\n. Among his fellow students was\nAlexander Markowich Ostrowski\nwho, although five years younger than Abramowicz, joined\nGrave\n's seminar at the University of Kiev in\n1908\nwhen he was a fifteen year old schoolboy.\nBukreev\nran a seminar on the theory of analytic functions and Abramowicz joined that seminar in his second year of study. He presented the paper\nExponential, logarithmic, trigonometric and circular functions of a complex variable\n(\nRussian\n)\nto\nBukreev\n's seminar. He attended\nGrave\n's\nCourse of Algebraic Analysis\n(\nRussian\n)\nand the lecture notes he took were available to students from\n1910\nas a lithographic text. Abramowicz also helped\nGrave\nin publishing other courses of his lectures, for example\nArithmetical Theory of Algebraic Quantities\n(\nRussian\n)\n(1909\n-\n10)\nand\nElements of the theory of elliptic functions\n(\nRussian\n)\n(1910)\n. Wiaczesław A Dobrowolski writes\n[\n2\n]\n:-\nHaving thoroughly familiarised himself with the classical works of\nEuler\n,\nPfaff\n,\nGauss\n,\nKummer\nand\nSchwartz\non hypergeometric series, Abramowicz became particularly interested in the lectures of\nFelix Klein\n. Following the example of this scholar, he devoted his entire attention to functions of a more general type, which\nKlein\ncalled \"Funktionen mit Nebenpunkten\", which means that the subject of considerations were hypergeometric functions with so-called removable singular points.\nIn\n1910\nAbramowicz submitted the paper\nOn the hypergeometric series\n(\nRussian\n)\nfor the University's competitive prize and it was awarded a gold medal. In\n1911\nhe graduated with a first-degree diploma which was about equivalent in standard to a present day Master's Degree and required both examinations and a thesis. Abramowicz wrote the thesis\nOn hypergeometric functions with one removable singular point\n(\nRussian\n)\nfor which he was awarded a gold medal\n[\n2\n]\n:-\nThe first chapter presented the theory of the ordinary\nRiemann\nfunction P with some modernisation of the proofs. The second chapter was devoted to hypergeometric functions Q with one apparently singular point. The third chapter dealt with the function\nη\n(\nz\n)\n\\eta(z)\nη\n(\nz\n)\n, which is the ratio of two Q functions. In Abramowicz's work, the results of his predecessors were supplemented, and in a number of cases the problems were considered in a more general form. This work was distinguished by the clarity and precision of its exposition ...\nGrave\nexamined the thesis and wrote in his report:-\nAbramowicz demonstrated erudition and attempts at original creativity.\nHis thesis was printed in a slightly abridged form in two parts in the\nKiev Uniwiersitietskije Izwiestija\nin\n1912\n. The problem of finding coefficients in\nRiemann\n's formulas which were related to hypergeometric functions was the subject of another paper by Abramowicz which he published in\n1913\n.\nIn the summer of\n1912\nAbramowicz, as one of the best and most talented students, was awarded a scholarship for two years to fund his continuing research and work towards his Master's Degree at the University of Kiev. Advised by\nGrave\n, he undertook the major task of preparing to be examined for this degree. At this time the Master's Degree was in standard between that of the present Ph.D. and the\nhabilitation\n. Obtaining this degree allowed the person to become a\ndocent\nand to lecture on a designated topic. Abramowicz took the Master's Degree examinations between\n18\nFebruary\n1914\nand\n29\nApril\n1914\n. He sat the following eight examinations:\n(\ni\n)\nOn the theory of differential equations\n(\non\n18\nFebruary\n)\n,\n(\nii\n)\nOn the theory of functions\n(\non\n18\nFebruary\n)\n,\n(\niii\n)\nOn Geometry\n(\non\n18\nMarch\n)\n,\n(\niv\n)\nOn Probability Theory\n(\non\n18\nMarch\n)\n,\n(\nv\n)\nOn Algebra\n(\non\n18\nMarch\n)\n,\n(\nvi\n)\nOn Mechanics\n(\non\n15\nApril\n)\n,\n(\nvii\n)\nOn Differential Calculus\n(\non\n29\nApril\n)\n,\n(\nviii\n)\nOn Variational Calculus\n(\non\n29\nApril\n)\n.\nHe was given the grades \"very good\" for the examinations\n(\ni\n)\n-\n(\nvi\n)\n, and the grades \"good\" for\n(\nvii\n)\nand\n(\nviii\n)\n. Based on these results,\nGrave\nrecommended that Abramowicz should undertake research on automorphic functions. The two places that were most useful for a young researcher to visit at this time were Berlin and Göttingen and in May\n1914\nthe Mathematics Department at Kiev, impressed with his potential, sent Abramowicz to Germany to study at these two centres. Europe was, however, rapidly moving towards a war and when Austria-Hungary declared war on Serbia on\n28\nJuly\n1914\n, Russia came to Serbia's defence. By\n4\nAugust Germany was drawn into the war and Abramowicz was forced to return to Kiev.\nHe was appointed as an assistant professor of mathematics at the University of Kiev in the spring of\n1915\n. In\n1916\n-\n1917\nhe taught at a special course in the theory of elliptic functions at the University of Kiev. He also served as a lecturer at Kiev Polytechnic from\n1914\nto\n1916\n. In October\n1916\nPerm State University was founded, initially as a branch of St Petersburg University, in the city of Perm. Abramowicz was sent to Perm to lecture at the new university for the year\n1916\n-\n17\n. After one year Perm University became independent of St Petersburg University and on\n14\nAugust\n1917\nthe Ministry approved Abramowicz's appointment as an associate professor in the Department of Mathematics at the University of Perm.\nAfter teaching at the University of Perm during session\n1917\n-\n18\n, Abramowicz returned to Kiev for the summer vacation. He had for some time shared a house in Kiev with his mother Maria Petronela Abramowicz and his sister\nIzabela Abramowicz\n. The Russian Civil War had begun in November\n1917\nand Perm, having military munitions factories, was a target for both sides. Abramowicz decided not to return to Perm for the session\n1918\n-\n19\nbut remained in Kiev and taught at the Kiev Polytechnic. In fact the Siberian White Army took Perm in December\n1918\nbut with continued fighting, it was retaken by the Red Army in July\n1919\n.\nIn June\n1919\nPoland was confirmed as an independent country with the Treaty of Versailles. Although World War I had ended in\n1918\n, Poland was immediately involved in a war with Soviet Russia and in May\n1920\nPolish-Ukrainian forces reached Kiev. Stanisław Domoradzki and Małgorzata Stawiska write\n[\n4\n]\n:-\n... faculty and students started to leave\n[\nKiev\n]\nas the fighting continued. Even after the Great War had ended, Kiev changed hands, passing from Germans to Ukrainians to Bolsheviks to White Russians to Ukrainians and Poles to Bolsheviks again.\nAbramowicz left Kiev with the retreating Polish army and arrived in Warsaw in June\n1920\n. In August\n1920\nthe Red Army approached Warsaw but was defeated when Polish forces commanded by Józef Piłsudski counterattacked. The new independent Poland looked to build up its education system and the University of Poznań had been founded on\n7\nMay\n1919\n. Two chairs of mathematics were founded;\nZdzisław Krygowski\nwas appointed to the first chair and Franciszek Włodarski\n(1899\n-\n1944)\nto the second chair. Abramowicz was offered a position as an assistant lecturer at the University of Poznań or an equivalent one at the University of Vilnius; he chose to accept Poznań.\nOn\n18\nFebruary\n1921\n, Abramowicz arrived in Poznań and, after living in a number of temporary places around the city, by October\n1921\nwas in his own apartment in Stanisława Wyspiańskiego street. He was joined in this apartment by his mother Maria Petronela Abramowicz and his sister\nIzabela Abramowicz\non\n25\nAugust\n1923\n.\nWhen Abramowicz moved to Poznań in February\n1921\n, session\n1920\n-\n21\nwas already well under way. The university year was made up of trimesters and he began teaching in the second of these. From\n1\nMarch to\n30\nApril\n1921\nhe taught number theory with a two hour class every Wednesday and an exercise class in the theory of algebraic equations for one hour every Friday. He continued to give both of these in the third trimester,\n1\nMay to\n17\nJuly\n1921\n, and, in addition, he also taught the theory of algebraic equations for one hour on every Tuesday, Wednesday, and Friday.\nAs Poland organised its education system after it became an independent country, it required those with degrees obtained from abroad to complete their studies in Poland. Abramowicz was in a position to easily obtain a doctorate since he had four excellent papers published between\n1911\nand\n1917\n, but things were made more difficult for him when in\n1921\nthe Faculty of Philosophy at the University of Poznań brought in a requirement that anyone applying for a doctorate was required to have studied for one year at the University of Poznań and must submit a thesis containing material not previously published. The University of Warsaw did not have conditions of this type on their doctorates, so Abramowicz applied to study for a doctorate at the University of Warsaw in\n1922\n. He was assigned\nStefan Mazurkiewicz\nas his thesis advisor and quickly submitted the thesis\nOn hypergeometric functions with an arbitrary number of removable singular points\n(\nPolish\n)\n. He was awarded a doctorate on\n23\nMay\n1922\n.\nLech Maligranda lists the courses Abramowicz delivered from\n1922\nto\n1936\nin\n[\n9\n]\n:-\nIn the following years\n(1922\n-\n36)\nAbramowicz gave the following lectures, classes and seminars at the University of Poznań: Differential and integral calculus with exercises\n(1925\n-\n36)\n; Algebraic equations\n(1923\n-\n24)\n; Introduction to analysis\n(1923\n-\n25)\n; Theory of numerical equations\n(1924\n-\n25)\n; Elementary mathematics\n(1924\n-\n25)\n; Determinants and linear equations\n(1926\n-\n27\nand\n1927\n-\n28)\n; Integral calculus with quadratures of differential equations\n(1926\n-\n27)\n; Proseminar on differential and integral calculus\n(1926\n-\n27\n,\n1928\n-\n29)\n; Differential geometry\n(1928\n-\n29)\n; and Analysis with elements of higher algebra for physicists\n(1928\n-\n29)\n.\nIn\n1929\nAbramowicz habilitated in mathematics at the University of Poznań. This was recorded in the Senate Minutes of\n24\nApril\n1929\n:-\nMotion of the Council of the Faculty of Mathematics and Natural Sciences to grant Dr. Kazimierz Abramowicz veniae legendi in the field of mathematics. In a secret vote, the motion was approved and it was resolved to send it to the Ministry for approval.\nThe Minister approved Abramowicz's habilitation on\n11\nMay\n1929\n.\nIn Maligranda's article\n[\n9\n]\nwe learn a little about Abramowicz's personality:-\nHe probably had difficult war experiences behind him, he was always serious, never smiled, he looked either at the floor or at the ceiling. He examined female students with the door half open.\nHe examined many students but let us note three in particular who have become quite famous because of their work as cryptologists reconstructing the German military Enigma cypher machine before World War II;\nMarian Adam Rejewski\n,\nJerzy Witold Rozycki\nand\nHenryk Michał Zygalski\n. Abramowicz awarded\nRejewski\na \"good\" grade for differential calculus while he awarded both\nRozycki\nand\nZygalski\na \"very good\" grade for the same topic.\nThe First Polish Mathematics Congress was held in Lwów,\n7\n-\n10\nSeptember\n1927\n. The Congress was attended by about\n200\nmathematicians from Poland and a small number from abroad. About\n100\nlectures were delivered in the halls of the Lwów Polytechnic. Three mathematicians from the University of Poznań attended the Congress, Kazimierz Abramowicz, his sister\nIzabela Abramowicz\n, and the assistant Lidja Seipeltówna. Kazimierz Abramowicz gave the lecture\nOn the transformation of automorphic functions of several variables\n(\nPolish\n)\n. A short paper summarising his lecture was published in the\nProceeding\nof the Congress. We give an English translation:\nThe problem, given by\nPoincaré\nin his treatise: \"Sur les fonctions fuchsiennes et l'arithmétique\"\nⓉ\n(\nOn Fuchsian functions and arithmetic\n)\non the transformation of\nFuchs\nfunctions, can be generalised to automorphic functions of several variables. In the case of an automorphic function\nf\n(\nx\n1\n,\nx\n2\n,\n.\n.\n.\nx\nn\n)\nf(x_1 , x_{2}, ... x_{n} )\nf\n(\nx\n1\n​\n,\nx\n2\n​\n,\n.\n.\n.\nx\nn\n​\n)\nwith n variables\nx\n1\n,\nx\n2\n,\n.\n.\n.\nx\nn\nx_{1}, x_{2}, ... x_{n}\nx\n1\n​\n,\nx\n2\n​\n,\n.\n.\n.\nx\nn\n​\n, belonging to the discontinuous group G, the problem will consist in determining the conditions under which there is an algebraic dependence between the function f and the function transformed by means of a certain substitution S, not belonging to the group G. In general, not for every automorphic function f will there exist such a substitution S for which the aforementioned algebraic dependence will hold; this will only happen exceptionally for individual functions, and the first goal will be to determine those functions for which the transformation problem is possible.\n...\nWe consider groups such as quadratic and linear or hyperfuchsian groups. As for quadratic groups, we show that\nPoincaré\n's theorem on the transformation of arithmetic Fuchsian functions extends to functions belonging to the quadratic group with rational integer coefficients. In the case of hyperfuchsian functions, we give a method that allows us to determine the cases in which there exists a hyperfuchsian function f, as well as a continuous group g, each substitution of which applied to the function f gives a new function, related to the previous algebraic relation.\nThe method is based on the study of the fixed points of the hyperfuchsian group G, for which we prove the theorem that these points remain unchanged under substitutions of the continuous group g; this theorem leads to the determination of the group G.\nThe First Polish Mathematics Congress resolved to convene the First Congress of Mathematicians of Slavic Countries in Warsaw in\n1929\n. This Congress took place\n23\n-\n27\nSeptember\n1929\nwith\nWacław Sierpiński\nas its chairman. In his opening address\nSierpiński\n:-\n... emphasised among other things that the Congress did not in any way have a political basis. Its goal was to establish closer intellectual relationships among researchers who work in the same branch of knowledge, who live in nearby territories and for whom collaboration is made somewhat easier by the kinship of their native languages. As a confirmation of his words Prof\nSierpiński\npointed to the presence of several mathematicians who came from non-Slavic countries with the goal of participating in the work of the Congress.\nKazimierz Abramowicz and his sister\nIzabela Abramowicz\nboth attended this Congress and Kazimierz Abramowicz delivered the lecture\nSur un groupe automorphe\nⓉ\n(\nOn an automorphic group\n)\n.\nThe Second Congress of Polish Mathematicians was held in Vilnius\n23\n-\n26\nSeptember\n1931\n. Despite the general economic crisis, the Congress was attended by over\n160\nmathematicians including Kazimierz Abramowicz and his sister\nIzabela Abramowicz\n. He delivered the lecture\nOn the transformation of hyperfuchsian functions\n(\nPolish\n)\n.\nThe Fourteenth Congress of Polish Physicians and Naturalists was held in Poznań\n11\n-\n15\nSeptember\n1933\nunder the patronage of the President of the Republic of Poland, Prof Dr Ignacy Mościcki. Abramowicz attended this Congress and delivered two lectures\nOn automorphic functions\n(\nPolish\n)\nand\nOn the derivative of an implicit function\n(\nPolish\n)\n. Both papers were published in the\nProceedings\nof the Congress. In fact they were Abramowicz's final publications.\nAbramowicz published\n22\npapers, three in Russian, six in French and thirteen in Polish. We note that the short paper in the\nProceedings\nof the First Polish Mathematics Congress is not included as one of these\n22\npapers. The papers involve the range of topics that he worked on, in particular the theory of analytical functions, the properties of automorphic functions and groups, and hypergeometric functions. The\n22\npapers are listed in\n[\n9\n]\nwhere Lech Maligranda gives an excellent account of the mathematics studied by Abramowicz.\nOn\n1\nSeptember\n1935\n,  Abramowicz was promoted to associate professor. He had some health problems, however, and in September\n1936\nhe went into hospital to undergo what should have been a fairly routine operation to have his appendix removed. It appears that a mistake was made in giving him a blood transfusion in that he was given the wrong blood type. As a result of this error, he died on\n13\nSeptember. He was buried in St Martin's Cemetery on Bukowska Street, Poznań but when the Cemetery was closed down in\n1942\n, his body was exhumed and buried in the Resurrection of the Lord cemetery on Debiec Street. This cemetery now appears to be somewhat neglected but the position of Abramowicz's grave is marked with a modern memorial.",
  "matematicos_citados_na_biografia": [
    "Izabela Abramowicz",
    "Boris Yakovlevic Bukreev",
    "Dmitry Aleksandrovich Grave",
    "Alexander Markowich Ostrowski",
    "Grave",
    "Bukreev",
    "Euler",
    "Pfaff",
    "Gauss",
    "Kummer",
    "Schwartz",
    "Felix Klein",
    "Klein",
    "Riemann",
    "habilitation",
    "docent",
    "Zdzisław Krygowski",
    "Stefan Mazurkiewicz",
    "Marian Adam Rejewski",
    "Jerzy Witold Rozycki",
    "Henryk Michał Zygalski",
    "Rejewski",
    "Rozycki",
    "Zygalski",
    "Poincaré",
    "Fuchs",
    "Wacław Sierpiński",
    "Sierpiński"
  ],
  "imagens": [
    "abramowicz.jpg"
  ]
}