{
  "nome_completo": "Konrad Hermann Theodor Knopp",
  "nome_curto": "Konrad Knopp",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Knopp/",
  "data_nascimento": "22 July 1882",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "20 April 1957",
  "local_morte": "Annecy, France",
  "summary": "Konrad Knopp was a German mathematician who worked on generalised limits and complex functions. He was the co-founder of Mathematische Zeitschrift in 1918 .",
  "biografia": "Konrad Knopp\n's father was Paul Knopp and his mother was Helene Ostertun. Paul Knopp\n(1845\n-\n1904)\nwas a businessman and manufacturer from Neustettin\n(\nthe town is now in northwest Poland and is named Szczecinek\n)\n. His wife Helene\n(1857\n-\n1923)\nwas the daughter of Otto Ostertun who was a head forester. Konrad's school education was in Berlin, then he spent one semester at the University of Lausanne in\n1901\n. Following this he went to the University of Berlin where he was taught by\nSchwarz\n,\nFrobenius\n,\nSchottky\n,\nLandau\nand\nSchur\n, receiving a qualification to teach in\n1906\nand a doctorate in\n1907\n. His doctoral studies were supervised by\nSchottky\nand\nFrobenius\n, and he was awarded the degree for his thesis\nGrenzwerte von Reihen bei der Annäherung an die Konvergenzgrenze\nⓉ\n(\nLimit values of rows in approaching the convergence limit\n)\n.\nKnopp left Germany in the spring of\n1908\nand travelled to Japan where he taught in Nagasaki in western Kyushu, at the Handelshochschule during\n1908\n-\n09\n. He then travelled in India and China. In\n1910\nhe returned to Germany and married the painter Gertrud Kressner\n(1879\n-\n1974)\n, the daughter of Colonel Karl Kressner and Hedwig Rebling; they had one son and one daughter. Konrad and Gertrud Knopp then moved to Tsingtao, eastern Shantung province, China where he taught at the German-Chinese academy during\n1910\n-\n11\n. Germany had occupied Tsingtao in\n1897\n, modern port facilities had been installed and a modern European-style city had been created. In\n1911\nKnopp and his wife returned from Tsingtao to Germany and he taught at the Military Technical Academy and the Military Academy while working on his\nhabilitation\nthesis which he submitted to Berlin University. Knopp became an officer in the army during World War I, being wounded in action near the beginning of the war.\nAfter being wounded he was discharged from the army and by the autumn of\n1914\nhe was teaching at Berlin University. In the following year he was appointed as an extraordinary professor at Königsberg, becoming an ordinary professor there in\n1919\n. Examples of some papers he published during this period are:\nBemerkungen zur Struktur einer linearen perfekten nirgends dichten Punktmenge\nⓉ\n(\nRemarks on the structure of a linear perfect nowhere-dense set of points\n)\n(1916)\n;\nEin einfaches Verfahren zur Bildüng stetiger nirgends differenzierbarer Funktionen\nⓉ\n(\nA simple method for teaching continuous nowhere differentiable functions\n)\n(1918)\n;\nMittelwertbildung und Reihentransformation\nⓉ\n(\nAveraging and range transformation\n)\n(1920)\n; and\nÜber das Eulersche Summierungsverfahren\nⓉ\n(\nOn Euler summation\n)\n(1923)\n. He was appointed to a chair of mathematics at Tübingen University in\n1926\nand he remained there until he retired in\n1950\n. Examples of publications during this time are\nZur Theorie der Limitlerungsverfahren\n(1930)\n; and\nÜber die maximalen Abstände und Verhältnisse verschiedener Mittelwerte\nⓉ\n(\nOn the maximum distances and ratios of different averages\n)\n(1935)\n.\nKnopp worked on generalised limits and wrote excellent books on complex functions.\nTheorie und Anwendung der Unendlichen Reihen\nⓉ\n(\nTheory and application of infinite series\n)\nwas published in\n1922\n.\nElemente der Funktionentheorie\nⓉ\n(\nElements of complex analysis\n)\nwas published in\n1936\nwith an English translation appearing in\n1953\n. The chapters of the book are:\nChapter I: Complex numbers and their geometric representation.\nChapter II: Linear functions.\nChapter III: Sets, sequences and power series.\nChapter IV: Analytic functions and conformal mapping.\nChapter V: Elementary functions.\nDetails of three further textbooks by Knopp are given in the article:\nTexts by Knopp\n.\nHe produced the sixth edition of Hans von Mangoldt's famous\nHöhere Mathematik: eine Einführung für Studierende und zum Selbststudium\nⓉ\n(\nHigher mathematics: an introduction for students and for self-study\n)\n. The book continued to appear as a jointly authored text by von Mangoldt and Knopp, and the three volumes which were reprinted in\n1990\nwere the seventeenth, sixteenth and fifteenth editions of these volumes respectively. Volume\n1\ncovers numbers, functions, limits, analytic geometry, algebra, set theory; volume\n2\ncovers differential calculus, infinite series, elements of\ndifferential geometry\nand of function theory; and volume\n3\ncovers integral calculus and its applications, function theory, differential equations. Friedrich Lösch added a fourth volume in\n1980\nto cover more modern material: set theory,\nLebesgue\nmeasure and integral, topological spaces, vector spaces, functional analysis, integral equations. The review of the\n1990\nreprint states:-\nThis famous and comprehensive introduction to analysis by von Mangoldt and Knopp has been popular for generations of German-speaking students, in mathematics, physics and other natural sciences, and engineering.\nHe was the co-founder of\nMathematische Zeitschrift\nin\n1918\n, being the editor from\n1934\nto\n1952\n.\nAfter he retired Knopp continued to publish interesting papers such as\nZwei Abelsche Sätze\n(1952)\nin which he proved abelian theorems for\nLaplace\nand\nAbel\ntransforms which are closely related to the well-known Tauberian theorems of\nKaramata\n. He was invited to lecture in March\n1952\nat a meeting held in conjunction with the first meeting of the International Mathematical Union. He chose to give the expository lecture\nFolgenräume und Limitierungsverfahren. Ein Bericht über Tübinger Ergebnisse\nⓉ\n(\nSequence spaces and limiting process. A report on Tubingen's results\n)\n.",
  "matematicos_citados_na_biografia": [
    "Schwarz",
    "Frobenius",
    "Schottky",
    "Landau",
    "Schur",
    "habilitation",
    "Texts by Knopp",
    "differential geometry",
    "Lebesgue",
    "Laplace",
    "Abel",
    "Karamata"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}