{
  "nome_completo": "Krystyna Maria Trybulec Kuperberg",
  "nome_curto": "Krystyna Kuperberg",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kuperberg/",
  "data_nascimento": "17 July 1944",
  "local_nascimento": "Tarnów, Poland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Krystyna Kuperberg is a Polish mathematician who works in America. She is known for her work in dynamical systems, geometry and topology.",
  "biografia": "Krystyna Kuperberg\n's name before she married was Krystyna Maria Trybulec. Her parents were Jan W Trybulec and Barbara H Kurlus. They were both trained pharmacists and owned a chemists shop in Tarnów where they dispensed medicines. The town of Tarnów, in South eastern Poland, had been administered by Austria until it was returned to Poland after the end of World War II, when Krystyna was still a very young child. She grew up in a family with an older brother Andrzej Trybulec who was interested in philosophy and mathematics.\nKrystyna was brought up in Tarnów until she was\n15\nyears old, when the family moved to Gdańsk on the northern coast of Poland. After attending high school for three years in Gdańsk she entered the University of Warsaw in\n1962\n, where her brother Andrzej was studying. He had set out on a philosophy course but had changed to study mathematics. Krystyna decided in high school that she would study mathematics at university. The first course she studied was given by Andrzej\nMostowski\n, then later she attended topology lectures given by Karol\nBorsuk\nand found the subject a fascinating one. She was not the only member of her family to love\nBorsuk\n's lectures, for her brother also found them far the best of all the mathematics lectures.\nBorsuk\n's lectures held another special significance for Krystyna, since a fellow student at these lectures was Wlodzimierz Kuperberg, whom Krystyna married.\nAfter graduating, Krystyna Kuperberg undertook research at the University of Warsaw under\nBorsuk\n's supervision and, in\n1966\n, she was awarded her Master's degree. Her husband went on to complete his Ph.D. in mathematics but Krystyna stopped her studies with the Master's Degree. Her first child Greg Kuperberg was born in\n1967\n. Two years later, in\n1969\n, the Kuperberg family left Poland and went to live in Sweden. Krystyna's second child, Anna, was born in\n1969\nnot long after the family moved to Sweden.\nIn\n1972\nthe Kuperberg family moved again, this time to the United States and Krystyna took up officially the graduate work she had begun in Warsaw under Borsuk's supervision. It was not that she had given up mathematics in the intervening years, merely that she had not been registered as a student or held a post. She had, however, continued research collaborating with her husband. The two published several papers on topology. In\n1971\nKrystyna and Wlodzimierz published the joint paper\nOn weakly zero-dimensional mappings\n. In this paper they answered a question posed by A Lelek in\n1967\nwhen he asked if a Cantorian manifolds could be mapped by a weakly zero-dimensional mapping onto a space of lower dimension. They proved that indeed it was possible.\nIn\n1972\n, the year Krystyna register as a research student at Rice University in Houston, Texas, she published\nAn isomorphism theorem of the\nHurewicz\n-type in\nBorsuk\n's theory of shape\nin\nFundamenta Mathematicae\n. At Rice University her doctoral studied were supervised by W H Jaco and she was awarded her Ph.D. in\n1974\n. She attended a topology conference at the University of North Carolina, Charlotte in the same year and presented a paper\nTwo Vietoris-type isomorphism theorems in Borsuk's theory of shape, concerning the Vietoris-Čech homology and Borsuk's fundamental groups\nwhich was published in the conference proceedings in the following year. Also in\n1974\nboth Krystyna and her husband Wlodzimierz Kuperberg were appointed to permanent positions on the Faculty at Auburn University in Auburn, Alabama.\nKrystyna Kuperberg has remained at Auburn University since she was appointed in\n1974\n. She was promoted to Full Professor at Auburn in\n1984\nand then awarded an Alumni Professorship there in\n1994\n. While on the Faculty at Auburn she has held a number of visiting positions: Oklahoma State University\n(1982\n-\n83)\n; the Courant Institute of Mathematical Sciences\n(1987)\n; the Mathematical Sciences Research Institute at Berkeley\n(1994\n-\n95)\n; and the University of Paris at Orsay\n(\nsummer\n1995)\n.\nIn\n1975\nshe published\nA note on the\nHurewicz\nisomorphism theorem in\nBorsuk\n's theory of shape\nwhich improved on the results of her paper from\n1972\npublished in\nFundamenta Mathematicae\nwhich we mentioned above. Her interests moved towards applying topological ideas to the theory of\ndynamical systems\n. In\n1981\nshe published\nA rest point free dynamical system on\nR\n3\n\\mathbb{R}^{3}\nR\n3\nwith uniformly bounded trajectories\n. This paper, on which she collaborated with Coke Reed, provided a counter-example to a question posed by\nUlam\nin\n1935\nand entered by him into the Scottish Book.\nContinuing her collaboration with Coke Reed, Kuperberg published another paper on dynamical systems in\n1989\nwhen\nA dynamical system on\nR\n3\n\\mathbb{R}^{3}\nR\n3\nwith uniformly bounded trajectories and no compact trajectories\nappeared in the\nProceedings of the\nAmerican Mathematical Society\n. In\n1988\nKuperberg solved a problem relating to question of\nKnaster\nas to whether every homogeneous space is bihomogeneous.\nKuratowski\nfound a counter-example in\n1922\nbut in\n1930\nT Dantzig had asked whether\nKnaster\n's question was true for continua. It was this question to which Kuperberg found a counter-example, announcing it in\nA homogeneous nonbihomogeneous continuum\nin\n1988\n, and giving full details in\nOn the bihomogeneity problem of Knaster\npublished in the\nTransactions of the American Mathematical Society\n.\nKuperberg's most celebrated result, however, was discovered in\n1993\nand published in\n1994\nin\nA smooth counterexample to the\nSeifert\nconjecture\nin the\nAnnals of Mathematics\n. John E Fornaess, reviewing the paper, explains its context:-\nOne of the basic concepts in dynamical systems is that of a fixed point or a periodic orbit. This was already observed by H\nPoincaré\n(\nin\n1890)\n, who discussed the existence of periodic orbits for the three-body problem in celestial mechanics. The idea is that once you have a periodic orbit of some complicated system, you can start analyzing the system near the periodic orbit and this gives you an initial handle on the description of the system. One question therefore is whether dynamical systems tend to have periodic orbits. One such case is for the three-sphere. The\nSeifert\nconjecture\n(1950)\n, is that all vector fields on the three-sphere have at least one closed orbit. ...\nThe paper is an important contribution to the theory of dynamical systems, and it solves in a simple but elegant way the long-standing\nSeifert\nconjecture.\nHaving written papers with her husband, Kuperberg went on to write papers with her son Greg who had also become a mathematician. In\n1996\nthey published\nGeneralized counterexamples to the\nSeifert\nconjecture\nwhich improved on Kuperberg's results from two years earlier. They gave examples in this later paper which are real-analytic rather than only smooth. They also solve the\nSeifert\nconjecture by giving counter-examples in dimension three or more.\nKuperberg has already received several awards for her outstanding work and it is certain that she will receive further awards. Perhaps the most prestigious was in\n1995\nwhen she was awarded the Alfred Jurzykowski Award by the Kosciuszko Foundation. In the following year she received a Research Excellence Award from the College of Sciences and Mathematics of Auburn University. Also in\n1996\nshe was elected to the Council of the\nAmerican Mathematical Society\nhaving served on several Committees of that Society.",
  "matematicos_citados_na_biografia": [
    "Mostowski",
    "Borsuk",
    "Hurewicz",
    "dynamical systems",
    "Ulam",
    "American Mathematical Society",
    "Knaster",
    "Kuratowski",
    "Seifert",
    "Poincaré"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}