{
  "nome_completo": "Kuo Tsai Chen",
  "nome_curto": "Kuo-Tsai Chen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chen/",
  "data_nascimento": "15 July 1923",
  "local_nascimento": "Chekiang (now Zhejiang), China",
  "data_morte": "August 1987",
  "local_morte": "Urbana, USA",
  "summary": "Kuo-Tsai Chen was a Chinese-born mathematician who worked in algebraic topology and analysis.",
  "biografia": "Kuo-Tsai Chen\nstudied at the Southwest Associated University. In\n1938\nwar had broken out between China and Japan and Beijing University, Tsinghua University, and Nankai University moved to Kungming to form the State Southwest Associated University. Chen graduated with a Bachelor of Science degree in\n1946\n. This was the year that, following the end of the war, Southwest Associated University was split into the three universities which returned to Beijing, Tsinghua, and Nankai. Chen moved to Shanghai where he was employed as an assistant at the Mathematics institute of the\nAcademia Sinica\n.\nAfter working at the\nAcademia Sinica\nfor one year, Chen was advised to go to the United States to gain a doctorate. He went there in\n1947\n, working under the supervision of\nSamuel Eilenberg\nat Indiana University. However\nEilenberg\nhad accepted an appointment at Columbia University in New York so Chen followed his supervisor there. Chen supported himself by taking two appointments while in New York, the first appointment was as a mathematics instructor at the National Bible Institute which he held from\n1948\nto\n1950\n. In the second of these two years he also worked as an assistant at Columbia University. Let us note in passing that the National Bible Institute of New York changed its name to Shelton College, then left New York in\n1953\n. Chen submitted his doctoral dissertation\nIntegration in Free Groups\nin\n1950\nto Columbia University and was awarded a Ph.D.\nAfter the award of his doctorate, Chen was appointed as an Instructor at Princeton University. After spending the year\n1950\n-\n51\nat Princeton he was appointed as a Research Associate at the University of Illinois where he again spent a year. In\n1952\nhe was appointed as a Lecturer at the University of Hong Kong where he worked until\n1958\n. His early work, following on from his doctoral dissertation, was on group theory and the theory of links. He published\nIntegration in free groups\n(1951)\n,\nCommutator calculus and link invariants\n(1952)\n,\nIsotopy invariants of links\n(1952)\n, and\nA group ring method for finitely generated groups\n(1954)\n.\nThe authors of\n[\n2\n]\nwrite:-\nHis parents were then living in Taipeh, Taiwan. In the first course he gave in Hong Kong, Chester Chen, as he had become known, met a charming sophomore, Julia Tse-Yee Fong, who became his bride in\n1953\n. His very strict sense of duty did not allow him to give his preferred student special help, which occasionally made her very mad at him. Their happy marriage brought forth three children: Matthew in\n1955\n, who earned a Doctorate in mathematics at the University of California at Berkeley and who is currently\n[1990]\nan electrical engineer with AT&T Lydia in\n1956\n, who graduated from Sarah Lawrence College, and is now a painter and editor; Lucia in\n1960\n, who graduated from MIT and is now a graduate student in material science at the University of Illinois.\nAfter leaving Hong Kong in\n1958\n, Chen went to Brazil where he was appointed as an Associate Professor at the Instituto Tecnologico de Aeronautica in São Jose dos Campos. He was promoted to Professor in\n1959\nthen, following two visits to the Institute for Advanced Study at Princeton\n(\nin the winter of\n1960\n-\n61\nand the spring of\n1962)\n, he was appointed Associate Professor at Rutgers University in\n1962\n. After being promoted to full Professor at Rutgers in\n1963\n, he left two years later to take up a position at the State University of New York in Buffalo. After two years in Buffalo he returned to the University of Illinois as Professor. He remained in this post for\n20\nyears until his death in\n1987\n.\nIn Chen's Collected Papers\n[\n1\n]\nhis work is summarised as follows:-\nKuo-Tsai Chen is best known to the mathematics community for his work on iterated integrals and power series connections in conjunction with his research on the cohomology of loop spaces. His work is intimately related to the theory of minimal models as developed by\nDennis Sullivan\n, whose own work was in part inspired by the research of Chen. An outstanding and original mathematician, Chen's work falls naturally into three periods: his early work on group theory and links in the three sphere; his subsequent work on formal differential equations, which gradually developed into his most powerful and important work; and his work on iterated integrals and homotopy theory, which occupied him for the last twenty years of his life. The goal of Chen's iterated integrals program, which is a\nde Rham\ntheory for path spaces, was to study the interaction of topology and analysis through path integration.\nChen was advisor to six doctoral students at the University of Illinois and these graduated between\n1970\nand\n1980\n. Richard Hain, who was Chen's last doctoral student graduating in\n1980\nwith his thesis\nIterated Integrals, Minimal Models and Rational Homotopy Theory\n, is the coauthor of the articles\n[\n2\n]\n, and\n[\n3\n]\n. The authors of\n[\n3\n]\nnote that Chen's death:-\n... followed a long illness. He was a devout Christian throughout his life.",
  "matematicos_citados_na_biografia": [
    "Academia Sinica",
    "Samuel Eilenberg",
    "Eilenberg",
    "Dennis Sullivan",
    "de Rham"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}