{
  "nome_completo": "Lajos Martin",
  "nome_curto": "Lajos Martin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Martin_Lajos/",
  "data_nascimento": "30 August 1827",
  "local_nascimento": "Buda, Hungary",
  "data_morte": "4 March 1897",
  "local_morte": "Kolozsvár, Hungary (now Cluj, Romania)",
  "summary": "Lajos Martin was a Hungarian mathematician and engineer best known for his works in transportation and aerodynamics.",
  "biografia": "Lajos Martin\n's father was a wine grower in Buda. Lajos was the seventh of his parents' children. At the time of his birth, Buda was one of the three towns which were united to become Budapest in\n1872\n; the other two towns were Pest and Obuda. The years during which Martin was growing up in Buda were ones during which the three towns developed rapidly with the building of town houses, palaces, public buildings and churches. It was a time of optimism with the setting up of the\nHungarian Academy of Sciences\nin Pest just two years before Martin was born. One dramatic event which took place while he was growing up was a severe flood in\n1838\nwhich destroyed half the houses in Pest and many in Buda. His school education took place in Buda where he attended the Roman Catholic Secondary School. He then began studies at the university in Pest.\nA university had operated in Buda from\n1777\n, transferred from Nagyszombat\n(\nnow Trnava, Slovakia\n)\n, but in\n1783\nit was moved to Pest when Joseph II turned Buda into the country's administrative centre. It was at this university in Pest\n(\nknown as the\nLoránd Eötvös\nUniversity since\n1949)\nthat Martin studied, taking courses in the faculty of Arts in his first two years of study. However he then turned towards engineering taking courses at the university's Institutum Geometrico-Hydrotechnicum. He achieved outstanding grades in the examinations he took but the revolutions that swept Europe in\n1848\ndisrupted his studies. A revolutionary demonstration in Pest on\n15\nMarch\n1848\nled to many reforms being granted but the court in Vienna became increasingly unhappy with the events and an army invaded Hungary in September. Martin, along with many other student conscripts, joined the Hungarian army to oppose the invading forces. He served in the artillery, fighting in many battles which saw the Hungarians triumph. At one stage he was in the fortress at Oradea which had become an important headquarters for the revolutionary forces. Hungarian independence was declared on\n14\nApril\n1849\nand after this Russian and Austrian troops combined in a joint action against the Hungarians. Greatly outnumbered, the Hungarians were defeated in a number of battles which led to their overall defeat. The Hungarians surrendered on\n13\nAugust\n1849\nand, after this, Martin went into hiding. However, after a time during which he managed to avoid capture, he was taken prisoner.\nFollowing a period in prison, Martin was drafted into the Austrian army. At first, when assigned to the north of Italy, he was given manual tasks which included work as a school janitor and as a stoker. However, after some time his superiors discovered that he had a qualification in mathematics. They then sent him to the Military Academy in Vienna where, given the expertise that he had already acquired, he was admitted to the final grade. The Austrian army now made use of his talents and he was rapidly promoted to second lieutenant, first lieutenant, then to professor of geometrics and machines. He was by now highly skilled in ballistics and undertook work on developing rockets for the Austrian army. He wrote a scholarly work in\n1856\n.\nIn\n1859\nhe left the army and returned to Buda where he graduated as a school teacher. He taught first in a school in Selmecbánya then, from\n1862\n, at a school in Bratislava. He also worked as the director of a telegraph office at one stage in his career during the\n1860\ns. However he continued to undertake research in ballistics, both making theoretical calculations and carrying out practical experiments. He became interested in hydraulics, undertaking research on ships propellers, and giving an early formulation of the principle of the steam turbine. During these years he wrote some textbooks for secondary schools and published his studies of the theory of the best propeller and windmill. Lloyd's of London, the shipping insurance firm, were interested in Martin's screw propellers which they tested but Martin refused to sell patents for his ideas. In\n1872\nhe was appointed as Professor of Mathematics in the Department of Advanced Mathematics at the University of Kolozsvár. Robert Oláh-Gál writes\n[\n3\n]\n:-\n[\nMartin\n]\ntook on the reorganization and the management of the Observatory of the University, which had been founded in\n1755\nbut had been very neglected. His years at Kolozsvár were occupied with designing and building flying machines. He created first the \"floating wing\" and then the \"floating wheel\". With his floating wheel\n(\na helicopter type construction\n)\nthere were experiments in\n1896\nto get it airborne, and they succeeded in lifting the construction up to\n3\nmeters into the air using muscle power. This bicycle-driven flying construction is on view in the Transylvanian Historic Museum in Kolozsvár\n(\nCluj\n)\n. ... He corresponded with the German aviator Otto Lilienthal\n(1848\n-\n1896)\nwho, at the same time, was conducting experiments constructing a plane with a rigid wing-surface similar to a bird-wing.\nMartin became rector of the university during\n1895\n-\n96\nand he spoke in his Rector's Address of the importance he expected aircraft to acquire in the future for passenger traffic, warfare and commerce. He predicted the evolution of transport networks in a remarkably accurate way and deserves much credit for the foresight he showed. Barna Szénássy writes about Martin's work at the University of Kolozsvár, and the controversy that it caused, in\n[\n2\n]\n:-\nAfter several dilettante attempts, the first scientific treatment of the problem of the most efficient marine screw and the structurally similar air propeller was accomplished by Lajos Martin, a professor of mathematics at the University of Kolozsvár. A special incentive for him was the competition announced by the Hungarian Ministry of Commerce\n[\nin\n1870]\ninviting constructions of steam, water, wind or horse-powered devices that would have solved the problem of irrigation until the extension of the system of canalization. In his theoretical research, Martin accepted the\nMaclaurin\n-\nEuler\nformula but also assumed that the best ship screw and air vane must be some sort of conoid. Making physically and technically untenable simplifications, he put down the equation he had figured out, and although the contraptions constructed on its basis all failed at the testing, martin deemed it justified to publish his theoretical findings. That launched one of the fiercest and at the same time most fruitful literary debates in the history of Hungarian mathematics involving many of our outstanding scholars. The first to point out the errors in Martin's lengthy treatises\n[\n'Helical surfaces in mechanics'\n(1874\n-\n75)]\nand\n[\n'The theory of the horizontal air vane'\n(1874\n-\n75)]\nwere his official critics Kálmán Szily and István Hruspér ... Kálmán Szily, for example, revealed with scathing sarcasm that Martin's surface did not satisfy either of the hypotheses: it was not a conoid and it did not fulfil the\nMaclaurin\n-\nEuler\nformula. ... Szily applied the calculus of variations in his computations but gave up the tiresome examination of the second variation. Having noticed this, Martin did not rest with arms folded. In a reply in a highly ironical tome\n[\nApplication of the differential coefficient for solving the equation of the propeller surface\n(\nHungarian\n)\n(1877)]\nhe called Szily's variational method an unnecessary and erroneous extravagance.\nMartin held the professorship in Kolozsvár until his death at the age of seventy. He was honoured with election to the\nHungarian Academy of Sciences\nas a corresponding member in\n1859\n, becoming a full member in\n1861\n. Despite having a high international reputation, Szénássy writes\n[\n2\n]\n:-\nIn Hungary\n[\nMartin\n]\nwas a laughing stock for his research and experiments.",
  "matematicos_citados_na_biografia": [
    "Hungarian Academy of Sciences",
    "Loránd Eötvös",
    "Maclaurin",
    "Euler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}