{
  "nome_completo": "Lars Gårding",
  "nome_curto": "Lars Gårding",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Garding/",
  "data_nascimento": "7 March 1919",
  "local_nascimento": "Hedemora, Dalarna, Sweden",
  "data_morte": "7 July 2014",
  "local_morte": "Lund, Sweden",
  "summary": "Lars Gårding was a Swedish mathematician who studied partial differential equations and partial differential operators.",
  "biografia": "Lars Gårding\nwas the son of Jonas Ruben Gårding\n(1892\n-\n1985)\nand Matilda Elisabet Gahn\n(1892\n-\n1980)\n. Jonas Ruben Gårding was an engineer working at Motala and it was in Motala that Lars grew up. We note that Hedemora is about\n200\nkm north of Motala, Hedemora is about\n160\nkm north west of Stockholm, while Motala is about\n200\nkm south west of Stockholm. Lars had a younger brother Per Fredrik Gårding, born in\n1920\n.\nWhen Lars Gårding began his studies at the University of Lund in\n1937\nhe intended to become an actuary. His course involved mathematics and soon he was influenced by\nMarcel Riesz\nto change topics and concentrate on mathematics.\nRiesz\nhad been appointed to the chair of mathematics at the University of Lund in\n1926\nand by the time that Gårding studied there\nRiesz\nhad turned a somewhat mediocre mathematics department into an exciting place of international fame. Gårding undertook research for a Ph.D. supervised by\nMarcel Riesz\nand was awarded a Ph.D. in\n1944\nfor his thesis\nOn a class of linear transformations connected with group representations\n.\nD E Littlewood\n, reviewing the published version of the thesis, writes:-\nThe results obtained are not fundamental as are the\nDirac\nmatrices and the corresponding spinors, but an efficient technique is developed over a specialized field.\nThis publication was not the first one that Gårding produced, in fact his first paper was\nThe distributions of the first and second order moments, the partial correlation coefficients and the multiple correlation coefficient in samples from a normal multivariate population\nwhich appeared in\n1941\n. The Abstract states:-\nWhen the frequency function of a statistical variable is known, one of the most important tasks of Theoretical Statistics is to find the frequency functions of some simple functions of this variable. The most important are the first and second order moments in a sample containing a certain number of values of the variable.\nC C Craig writes in a review:-\nThis is a well organized exposition, both concise and clear, of the derivation of the distributions named in the title.\nTwo other papers appeared before his thesis, namely\nConics inscribed in a triangle treated by means of complex numbers\n(\nSwedish\n)\n(1942)\nand\nA general theorem concerning group representations\n(1943)\nwhich is concerned with a generalization of the familiar\nBurnside\n-\nSchur\nlemma of representation theory. This\n1943\npaper on group character theory and the theory of infinitesimal transformations has some applications to quantum theory, relativity and nuclear physics. Indeed Gårding was at the University of Cambridge, England, in\n1944\nand continuing to study relativistic wave equations when, on\n1\nDecember\n1944\n, he submitted the paper\nRelativistic wave equations for zero rest-mass\nto the\nProceedings of the Cambridge Philosophical Society\n. The paper was communicated by\nP A M Dirac\nand Gårding gives two addresses on the paper, 'The Institute of Mathematics of the University of Lund, Sweden', and 'Wesley House, Cambridge'.\nGårding continued to have the University of Lund as his permanent address but made many other visits. In Lund he worked closely with\nMarcel Riesz\nand soon began to produce papers on the theory of partial differential equations. There were other doctoral students working on similar topics at Lund, for example N E Fremberg wrote a thesis\nSome applications of the Riesz potential to the theory of the electromagnetic field and the meson field\nin\n1946\n. He writes:-\nI want to express to Professor\nMarcel Riesz\nmy sincerest gratitude for his direction of my attention to these problems, for valuable discussions and kind encouragement, and for critical examination of the manuscript. I am very grateful to ... Dr Lars Gårding for careful examination of the manuscript.\nGårding was working on similar topics and published\nThe Solution of Cauchy's Problem for Two Totally Hyperbolic Linear Differential Equations by Means of Riesz Integrals\nwhich he submitted to the\nAnnals of Mathematics\nin June\n1946\n. In\n1947\nGårding was at Princeton University, in the United States, when he submitted\nNote on continuous representations of Lie groups\n.\nIn fact the Institute for Advanced Study at Princeton was a place where Gårding spent time on eight separate occasions between\n1949\nand\n1977\n. His first visit was from October\n1949\nto May\n1950\n. He sailed from Gothenburg, Sweden, to New York, USA, on the ship\nSelma Thorden\n, arriving in New York on\n8\nOctober\n1949\n. He was accompanied by his wife Eva Gårding, the two having recently married. The immigration details on arriving in the United States contains a statement which we do not understand:-\nThe above mentioned alien is ordered delivered Ellis Island Hospital for further medical examination.\nThe word \"Mental\" is hand-written on the card. Passing over this very strange note we should say a little about Gårding's marriage at this point. He had married Eva Lundius earlier in\n1949\n. Eva Maria Lundius\n(14\nJuly\n1920\n-\n1\nJanuary\n2006)\nwas born and grew up in Landskrona in the south of Sweden. She worked as a teacher of modern languages but studied for a Ph.D. in phonetics at Lund University which she was awarded in\n1967\nfor the dissertation\nInternal Juncture\n(\nSwedish\n)\n. She became a professor of phonetics in Lund University in\n1980\n.\nIn\n1952\n, after\nMarcel Riesz\nretired from his chair, Gårding was appointed as a professor at the University of Lund and, in the following year, he was elected as a member of the\nRoyal Swedish Academy of Sciences\n. He spent the Winter and Spring semesters of\n1957\nat the University of Chicago where he taught the course \"\nCauchy\n's problem for hyperbolic equations.\" His third visit to the Institute for Advanced Study was from October\n1958\nto January\n1959\n. For the following two years\n(1959\n-\n60\nand\n1960\n-\n61)\nhe made similar visits. Edward Nelson writes in his historical note on analytic vectors about Gårding's\n1958\n-\n59\nvisit\n[\n12\n]\n:-\nWhen I did this work, I was a fresh Ph.D. at the Institute for Advanced Study. My wife and I lived in the brand-new Institute housing. On the other side of our apartment wall lived Lars Gårding. He was intrigued by the use of the heat equation to produce analytic vectors and told me, ruefully and quite rightly, that it was a method he should have thought of himself. He invited me to his apartment to explain to him the use of diffusion processes in deriving properties of the heat equation - at that time this technique appeared bizarre, and he wrote a paper\n(\nL Gårding, 'Vecteurs analytiques dans les représentations des groupes de Lie'\nⓉ\n(\nAnalytical Vectors in Lie Group Representations\n)\n(1960))\neliminating probability theory from the proof. Our new apartments were frequently invaded by field mice that had been displaced by the construction. Gårding would balance a soup bowl on a matchstick over bait, so that he could release the mice alive and unharmed.\nAt the University of Lund, Gårding played a major role in the development of the Mathematical Institute. This took a leading role both with his outstanding mathematical contributions and also using his skills as an organiser. For quite a number of years he was the director of the Mathematical Institute and he had this role through the difficult period in the late\n1960\ns when there was student unrest throughout universities in many parts of the world. In particular the role of professors as academic leaders was questioned, particularly their role as head of department. There were tensions at Lund University as there were in many universities, but Gårding had a skill of damping down such unrest so the mathematics department was able to function productively through this period. In fact Gårding continued in his leadership role until\n1975\n.\nAs a research supervisor, Gårding was skilled in suggesting topics for his students' dissertations that were challenging, but not impossible. Perhaps his most famous student was\nLars Hörmander\nwho had begun research for his doctorate at the University of Lund in\n1951\nadvised by\nMarcel Riesz\nbut, after\nRiesz\nretired in\n1952\n, he was advised by Gårding and was awarded a doctorate in\n1955\nfor his thesis\nOn the Theory of General Partial Differential Equations\n. Perhaps we have insulted several other outstanding mathematicians but suggesting the\nHörmander\nmay be Gårding's most famous student. We must mention also\nBruce Kellogg\nwho was awarded a Ph.D. by the University of Chicago in\n1958\nfor his thesis\nHyperbolic Equations with Multiple Characteristics\n.\nBruce Kellogg\npublished a paper containing results for his thesis, with the same title as the thesis, in which he wrote:-\nThe results of this paper were submitted in a thesis to the University of Chicago in partial fulfilment of the requirements for the degree of Doctor of Philosophy. We wish to acknowledge our gratitude to Professor Lars Gårding who suggested this problem and whose encouragement and advice made this paper possible.\nAnother outstanding student was Charles Vidar Håkan Thomée\n(\nknown as Vidar\n)\nwho was born in Malmö, Sweden, on\n20\nAugust\n1933\nand studied at the University of Lund, graduating with his doctorate from the University of Stockholm in\n1959\nwith his thesis\nSome results concerning boundary problems for partial differential equations\n. He was advised by Gårding and\nHörmander\n. He worked for many years at Chalmers University of Technology and University of Gothenburg. Another student of Gårding's who we should mention is Jan-Erik Ingvar Roos\n(1935\n-\n2017)\nwho was awarded a Licentiate in\n1958\nadvised by Gårding. Roos never submitted a thesis for a doctorate but became a professor at the University of Stockholm. Following his death on\n15\nDecember\n2017\n, the Department of Mathematics at the University of Stockholm made an announcement which stated:-\nHis influence on the Department's development has been enormous, both in research and through supervision of doctoral students.\nGårding had a career during which he made impressive research contributions to several different areas of mathematics. He also made important contributions to teaching, both at undergraduate level and with books aimed at students who only had a high school mathematics background. For example he published\nEncounter with mathematics\nin\n1977\nwriting in the Preface:-\nTrying to make mathematics understandable to the general public is a very difficult task. The writer has to take into account that his reader has very little patience with unfamiliar concepts and intricate logic and this means that large parts of mathematics are out of bounds. When planning this book, I set myself an easier goal. I wrote it for those who already know some mathematics, in particular those who study the subject the first year after high school. Its purpose is to provide a historical, scientific, and cultural frame for the parts of mathematics that meet the beginning student.\nFor a longer extract from the Preface and extracts from reviews of this book see\nTHIS LINK\n.\nIn\n1988\nhe published\nAlgebra for computer science\nco-authored with Torbjörn Tambour. We include this book in a list of some of Gårding's books for which we give some additional information such as extracts from reviews and extracts from Prefaces; see\nTHIS LINK\n.\nAfter he retired from his professorship at Lund, Gårding made a major contribution to the history of mathematics with the outstanding book\nMathematics and mathematicians. Mathematics in Sweden before\n1950\npublished in Swedish in\n1994\nand in English in\n1998\n. Between these two dates he published another important historical work, namely\nSome points of analysis and their history\n(1997)\n. Richard Beals writes\n[\n2\n]\n:-\nThis lively book is a guided tour through some of the highlights of twentieth-century analysis.\nHe also wrote historical articles such as\nWhy is there no Nobel prize in Mathematics?\n(1985)\n,\nHistory of the mathematics of double refraction\n(1989)\n, and\nNiels Henrik Abel and solvable equations\n(1994)\n.\nIt was not only mathematics which interested Gårding. He was very interested in and knowledgeable about art, literature and music and he played both violin and piano. In\n1987\n, he published a book on bird singing and sounds, a result of his interest in bird watching. He also published papers such as\nA Simple Model for the Interplay of Predators, Rodents and Food\n(2000)\n, and\nInteractions driving the population cycle of Arctic small rodents\n(2005)\n. His interest in more philosophical issues resulted in papers such as\nModels in science and otherwise\n(1999)\n,\nA philosophical dialog. Mathematics, life, and death\n(2000)\nVon Neumann with the Devil\n(2010)\n.\nGårding was involved in several of the International Congress of Mathematicians both as a speaker and as an organiser. He was on the Organising Committee of the International Congress of Mathematicians in Stockholm in\n1962\n. The scientific programme for this Congress was drawn up in close cooperation with the International Mathematical Union, which for this purpose nominated a Consultative Committee which included Gårding as a member. He was an invited speaker at the International Congress of Mathematicians held in Edinburgh, Scotland, in\n1958\nwhen he gave the lecture\nSome Trends and Problems in Linear Partial Differential Equations\n. Again in\n1970\nhe was an invited speaker at the International Congress of Mathematicians held in Nice delivering the lecture\nSharp fronts and lacunas\n.\nMany mathematicians have a prize named after them but this is usually set up after their death. The Eva and Lars Gårding Prize, however, was set up by Eva and Lars Gårding during their lifetimes. It:-\n...  is intended for the promotion of research and for rewarding scientific excellence in the fields of Mathematics and Linguistics. It is awarded for Mathematics during odd years and for Linguistics during even years. The prize was first awarded in\n2003\n, and in\n2014\nthe prize was worth\n220\n,\n000\nkr.\nEva Gårding died on\n1\nJanuary\n2006\nand because of the huge support the Gårdings gave each other in their academic studies, despite the very different fields in which they worked, we choose to end this biography of Lars Gårding with a quote from\n[\n5\n]\nconcerning Eva Gårding:-\nEva Gårding had great personal splendour. She had a special ability to inspire students and get them irresistibly involved in scientific thinking. She was a very good teacher as well as a very good writer. For her, a scientific report was not only a work of science, but equally importantly, a work of art. This is apparent from her own scientific writings, where precision, clarity and elegance are characteristic features. She was also a very sharp critic. Her perspicacity allowed her to immediately discover flaws in reasoning and weak points in an argument, and she was wise enough not to be overly consenting and complying. Eva Gårding was also a very good friend. Her house was always open to phonetics students, colleagues, guest researchers and scientists visiting from all parts of the world.",
  "matematicos_citados_na_biografia": [
    "Marcel Riesz",
    "Riesz",
    "D E Littlewood",
    "Dirac",
    "Burnside",
    "Schur",
    "P A M Dirac",
    "Royal Swedish Academy of Sciences",
    "Cauchy",
    "Lars Hörmander",
    "Hörmander",
    "Bruce Kellogg",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}