{
  "nome_completo": "Irena M Lasiecka",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lasiecka/",
  "data_nascimento": "4 February 1948",
  "local_nascimento": "Warsaw, Poland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Irena Lasiecka is a Polish born mathematician who has worked in the United States for most of her career. She has done exceptional work on control theory which has a wide range of important applications. She has over 400 publications and has received many awards for her work.",
  "biografia": "Irena Lasiecka\nis a Polish born mathematician who has worked in the United States for most of her career. At school in Poland, her first thought of a career was to become an architect. Her father, however, persuaded her that this was not the subject for her. After graduating from school, she entered the University of Warsaw wanting to study mathematics and physics. She said\n[\n16\n]\n:-\nFrom the very beginning of my university studies, I was exposed to advanced topics in analysis, differential equations, functional analysis, and control theory. I was fortunate to be admitted to a very special programme in applied mathematics at the University of Warsaw, Poland, which combined a rigorous education in mathematics and applications, with a particular emphasis on control theory.\nLasiecka was awarded a Master of Science degree in applied mathematics from the University of Warsaw in\n1972\n. She then continued to undertake research in control theory advised by Andrzej Piotr Wierzbicki. Wierzbicki\n(\nborn\n29\nJune\n1937\nin Warsaw\n)\nhad been awarded a Ph.D. in\n1964\nand is a leading expert in control theory and optimisation theory. Before we continue we should give an idea about what control theory is, so let us quote from Lasiecka herself\n[\n31\n]\n:-\nWhat is control theory of a dynamical system? Traditionally, the classical viewpoint taken in the study of differential equations consisted in the\n(\npassive\n)\nanalysis of the evolution properties displayed by a specific equation, or a class of equations, in response to given data. By contrast, control theory injects an active mode of synthesis in the study of differential equations: it seeks to influence their dynamical evolution by selecting and synthesising suitable data\n(\ninput functions, or control functions\n)\nfrom within a preassigned class, as to achieve a predetermined desired outcome or performance.\nThis quote is taken from the Preface to Lasiecka's book\nMathematical Control Theory of Coupled PDEs\n(2002)\n. We give a longer extract from this Preface at\nTHIS LINK\n.\nSoon after beginning research for her doctorate, Lasiecka published the paper\nNecessary conditions for optimality of control up to the complete state for systems described by ordinary differential equations with delays in state and control\n(\nPolish with English and Russian summaries\n)\n. Her second paper, published in\n1975\n, was written in Russian with a Polish summary. It has the title\nConical approximations of sets in optimization theory\nand was reviewed by Milan Vlach who wrote\n[\n43\n]\n:-\nThe author studies the properties and mutual relations of various conical approximations of sets in locally convex topological linear spaces. On the basis of their definitions she separates the approximations into two groups - axiomatic and constructive. The former include internal cone, simplicial cone and extremal cone, while the latter include admissible cone, tangent cone, functional decrease cone and radial cones. A separation theorem for internal and extremal cones is presented and employed for deriving necessary conditions of optimality in the spirit of the Dubovitskii-Miljutin formalism.\nLasiecka was awarded a Ph.D. from the University of Warsaw in\n1975\nand was appointed as an assistant professor at the Institute of Control Sciences of the\nPolish Academy of Sciences\nin Warsaw. Her next paper, published in\n1976\nand written in Russian with Polish summary, was\nFinite difference approximation of optimal control for systems described by nonlinear differential equation with delay\n. R N P Singh writes in the review\n[\n37\n]\n:-\nA finite-difference approximation approach is used to obtain the suboptimal solution of the optimal control problem for systems characterised by nonlinear differential equations with delay. Using the method of Lagrange multipliers, the author discusses the rates of convergence of various suboptimal solutions to the optimal solutions and obtains error estimates for the optimal control, state, and cost functional. The method is constructive and leads, in a natural way, to the development of computational algorithms for the real-time solution of the problem using a computer.\nShe worked at the Institute of Control Sciences with Kazimierz Malanowski. He had been born on\n19\nDecember\n1936\n, received his doctoral degree from the\nPolish Academy of Sciences\nin\n1964\nand, like Lasiecka. was employed at the Institute of Control Sciences. Lasiecka and Malanowski published a joint papers in\n1977\n:\nOn regularity of solutions to convex optimal control problems with control constraints for parabolic systems\n(\nRussian\n)\n, and two further joint papers in\n1978\n:\nOn discrete-time Ritz-Galerkin approximation of control constrained optimal control problems for parabolic systems\n(\nRussian\n)\n, and\nOn regularity of solutions to convex optimal control problems with control constraints for parabolic systems\n(\nRussian\n)\n.\nLasiecka had her first visiting appointment in\n1976\nwhen she spent from January to March as a Visiting Assistant at the Department of Mathematics, Liege University, Belgium. In\n1977\n, while retaining her position at the\nPolish Academy of Sciences\nin Warsaw, Lasiecka went on a postdoctoral fellowship to the University of California, Los Angeles, USA. Two papers, both published in\n1978\n, give different addresses.\nGeneralization of the Dubovitzky-Milutyn Optimality Conditions\ngives the address Staff Member, Institute of Organization, Management, and Control Sciences, Warsaw, Poland. It also contains the note:-\nThis research was sponsored by the Institute of Automatic Control, Department of Electronics, Technical University, Warsaw, Poland.\nThe other\n1978\npaper is\nBoundary Control of Parabolic Systems: Regularity of Optimal Solutions\nwhich gives the address Department of Systems Science, University of California at Los Angeles, Los Angeles, California. This paper was communicated by A V Balakrishnan\n(1922\n-\n2015)\nwho had invited Lasiecka to undertake postdoctoral studies in his department. He was a professor of engineering and professor of mathematics at the University of California, Los Angeles and had been chair of the Department of Systems Science in the School of Engineering from\n1969\nto\n1975\n. In\n1979\nLasiecka's postdoctoral fellowship ended and she became a Visiting Assistant Professor at the University of California at Los Angeles. She was partially supported by a research grant from the National Aeronautics and Space Administration\n(\nNASA\n)\n. Also in\n1979\nLasiecka, who was still on the staff at the\nPolish Academy of Sciences\nin Warsaw, was given the\nPolish Academy of Sciences\nAward.\nFor information about this and other awards given to Lasiecka, see\nTHIS LINK\n.\nIn\n1980\nLasiecka published the paper\nState Constrained Control Problems for Parabolic Systems: Regularity of Optimal Solutions\n. The Introduction begins:-\nThis paper deals with regularity properties of optimal solutions of distributed control problems with state constraints. Not only regularity of solutions is an interesting question from the mathematical point of view, but it also provides the mathematical foundations for estimating the error occurring in approximation of control problems. Estimates of such error involve bounds on the derivative of the function being approximated. Therefore, in order to obtain good estimates, certain types of solutions regularity\n(\nin the primal and dual control problems\n)\nare needed. The required regularity, as a rule, is more restrictive than that imposed by the spaces in which control problems are considered\n(\ncontrol functions are usually in\nL\n2\nL^{2}\nL\n2\n)\n. Also, regularity results give insight into the practicality of approximation schemes. It can indicate which kind of approximation should be applied. Namely, if a function has only the first derivative in\nL\n2\nL^{2}\nL\n2\n, there is usually no advantage in using piecewise approximating polynomials of degree >\n1\n.\nOn\n16\nJuly\n1980\nLasiecka married Roberto Triggiani. Triggiani\n(\nborn\n1942)\nhad been awarded a laurea in Electronic Engineering from the University of Padua in\n1967\nand a Ph.D. from the University of Minnesota, Minneapolis in\n1973\n. He worked in a very similar area to Lasiecka, his first publication being\nDelayed control action controllable systems in Banach space\n(1974)\n. He had taught at Iowa State University from\n1975\nand, at the time of his marriage to Lasiecka, he was an Associate Professor there.\nIn\n1980\nLasiecka left her position at the\nPolish Academy of Sciences\nin Warsaw, which she had held while visiting Los Angeles, and was appointed as an Assistant Professor of Mathematics at the University of Florida, Gainesville. Lasiecka's husband Roberto Triggiani spent a sabbatical year\n1980\n-\n81\nat the University of Florida and in\n1981\nboth Lasiecka and her husband were promoted to Associate Professorships at the University of Florida. Lasiecka and Triggiani published their first joint paper in\n1981\n, namely\nA cosine operator approach to modelling\nL\n2\n(\n0\n,\nT\n;\nL\n2\n(\nΓ\n)\n)\nL_{2}(0,T; L_{2}(\\Gamma ))\nL\n2\n​\n(\n0\n,\nT\n;\nL\n2\n​\n(\nΓ\n)\n)\n-\nboundary input hyperbolic equations\n. It was the first of many joint papers and, by March\n2025\n, MathSciNet lists\n136\njoint publications by Irena Lasiecka and Roberto Triggiani. Also in\n1981\nLasiecka and Triggiani were awarded the National Science Foundation\n(\nNSF\n)\naward\nBoundary Control Problems For Parabolic and Hyperbolic Partial Differential Equations\nwhich ran from June\n1981\nto February\n1984\n. This was the first of many NSF awards and, by March\n2025\n, the National Science Foundation lists\n24\nawards made to Lasiecka. Let us give some examples. Their fourth award was\nMathematical Sciences: Boundary Control Problems for Higher Dimensional Wave-Type and Plate-Type Partial Differential Equations\nrunning from June\n1989\nto November\n1992\n. It has the following Abstract:-\nThis project is to investigate a coherent set of boundary control problems for systems described by wave-type and plate-type partial differential equations, defined on a bounded domain in higher dimensional space. Both linear and nonlinear dynamics are considered. Problems for investigation include: exact controllability; uniform stabilisation by means either of explicit dissipative feedback operators or else of nondissipative feedback operators based on algebraic\nRiccati\noperators; optimal quadratic cost problems and related\nRiccati\nequations; asymptotic stability properties for nonlinear models; robustness of asymptotic stability properties under nonlinear structural perturbations; well-posedness of nonlinear wave equations with non-monotone nonlinearities in the Neumann boundary conditions. The emphasis throughout is on the optimal setting where the solutions and their relevant properties are studied in the spaces of optimal regularity, or, alternatively, in the spaces of finite energy. There are many applications for the theoretical developments described above. For instance, the control of robot arms and the reduction of damaging oscillations in large flexible structures on Earth or in orbit, are examples of practical benefits resulting from this work.\nSome of the awards were to support graduate students, some were to purchase graphic workstations and some were for US-France cooperative research. In this last category was\nShape Analysis of Damping Processes for Elastic Systems in Structural Modelling\n(1993\n-\n1997)\nwhich has the Abstract:-\nThis three-year award supports U.S.-France cooperative research in applied mathematics. The investigators are Irena Lasiecka and Roberto Triggiani from the University of Virginia and J P Zolesio and M Souli from the University of Nice. The investigators will utilise partial differential equations, hyperbolic equations and numerical analysis in approaching a number of problems in structural mechanics. The project focuses on elastic structures whose dynamical behaviour is effected by internal damping of vibrations. The objectives are to enhance stability properties by determining the optimal shape or design of the elastic structure so that undesirable vibrations are reduced. The U.S. investigators bring to this collaboration their expertise in mathematical modelling of structural damping, optimum control and related questions and the utilisation of elastic partial differential equations for determining controllability and stabilisation properties. This is complemented by French expertise in shape analysis and optimisation. The research has important applications in the areas of space mechanics and control.\nIn\n1984\nLasiecka was promoted to full Professor at the University of Florida. She was awarded a fellowship by the Consiglio Nazionale delle Ricerche and spent the summer in Italy as a Visiting Professor at the Scuola Normale Superiore in Pisa and at the Department of Mathematics, University of Bologna. In the summer of\n1986\nshe was a Visiting Professor at the International Institute for Applied Systems Analysis in Laxenburg, Austria about\n20\nkm south of Vienna. We note that these visiting appointments are the first of\n27\nlisted by Lasiecka between\n1976\nand\n2021\n. Many between\n1984\nand\n2002\nwere to Italy, in particular five were to Pisa, four to Bologna, one to Trento and one to Rome.\nShe left the University of Florida in\n1987\nwhen she became Professor of Applied Mathematics at the University of Virginia, Charlottesville. We note that, also in\n1987\n, Triggiani became Professor of Applied Mathematics at the University of Virginia. Lasiecka was Professor of Mathematics at the University of Virginia from\n1998\nto\n2011\n, then Commonwealth Professor of Mathematics,\n2011\n-\n2013\n. During her\n26\nyears at the University of Virginia she won a number of major awards. In\n1989\nshe received the Silver Core Award from the International Federation for Information Processing. The Institute of Electrical and Electronics Engineers made her a fellow in\n2004\n:-\nFor Contribution to Boundary Control Systems.\nShe received the\n2006\nTechnical Achievement Award from the International Congress of Nonlinear Analysis and Applications:-\nFor Outstanding Contribution to Nonlinear Mathematical Analysis.\nIn\n2011\nshe received the W T and Idalia Reid Award from the\nSociety for Industrial and Applied Mathematics\n. Lasiecka received this award for:-\n... her fundamental contributions in control and optimisation theory, particularly for dynamical systems governed by partial differential equations and their applications.\nFor more information about these prizes and awards that Lasiecka received, see\nTHIS LINK\n.\nLasiecka's first book, written jointly with her husband, is\nDifferential and Algebraic Riccati Equations\n(1991)\n. In\n[\n16\n]\nshe writes:-\nMy first monograph lecture notes\n(\njointly with R Triggiani\n)\npublished in\n1991\nby Springer, provides the first overview of the literature on optimal control theory as applied to classical and physically relevant single partial differential equation models with boundary/point control and/or boundary observation. It axiomatizes the properties and criteria that need to be satisfied for a successful application of optimal-control theory.\nFor more information about this book by Lasiecka, and about nine other books authored or co-authored by her, see\nTHIS LINK\n.\nIn September\n2013\nLasiecka left the University of Virginia and was appointed Distinguished University Professor and Chair of the Department of Mathematical Sciences of the University of Memphis, Memphis, Tennessee. In the interview\n[\n33\n]\nshe explained why she made the move:-\nAfter spending\n26\nyears at the University of Virginia\n(\nUVA\n)\nas a Full Professor and later Commonwealth Professor of Mathematics, an endowed chair, I wanted to expand my academic experience to include different students' environments and academic settings. Compared to UVA, the landscape of education and teaching in Memphis is very different. Many American students at Virginia are groomed in families with educational tradition and ambition. In addition, UVA attracts top International students in mathematics, engineering and sciences. Helping students in Memphis in achieving their academic goals is academically more challenging but also humanly more rewarding. Of course, the fact that Department of Mathematics at the University of Memphis had an excellent reputation in research\n(\nwith several stellar mathematicians including long time visitor\nPaul Erdős\n)\nand strong tradition of excellence played a dominant role in my decision.\nThe article\n[\n14\n]\nwritten in\n2023\nby the Division of Research and Innovation of the University of Memphis explains how important her appointment was to the University of Memphis:-\nIt was a good day for the University of Memphis back in\n2013\n, when Dr Irena Lasiecka decided to leave an endowed professorship at the University of Virginia after\n26\nyears and become a Distinguished University Professor and Chair of Memphis's Department of Mathematical Sciences. According to one of her academic peers, her move \"jolted the professional community and instantaneously brought world-wide visibility and reputation to the ... University of Memphis.\" Lasiecka is a towering figure in her field, combining innovative research, success at recruiting PhD students and post-docs as well as serving the larger mathematics community through a busy schedule of teaching and lecturing all over the world. She is also co-Editor-in-Chief of two academic journals, Applied Mathematics and Optimization, and Evolution Equations and Control Theory.\nLet us give further quotes from\n[\n14\n]\nwhere Lasiecka describes control theory:-\nLasiecka's area of specialisation is control theory of partial differential equations, an applied mathematical discipline that requires expertise in analysis, partial differential equations, calculus of variations, Riemannian geometry and several applied areas in both engineering and life sciences. \"Partial differential equations involve a lot of pure mathematics, and that was what I was trained for very early in my studies,\" she said. Control theory of partial differential equations remains critical in advancing both aviation and aerospace as well as many other scientific disciplines; Lasiecka's research has been supported for decades by the National Science Foundation, Division of Mathematical Sciences, as well as NASA and the Air Force, among many others. Her research has made her one of the most frequently cited mathematicians in the world.\nExplaining control theory, she said, \"Your goal is to control something - for example, the temperature in this room or the oscillation of an airplane wing. But the main issue is somehow to understand the phenomena. After you have a good understanding of the model, you try to predict what can happen. Finally, you have to act, and that's exactly when the control comes, okay? You have to do something to achieve the desired target.\" Or to understand why an aircraft - or spacecraft - might fail in flight. Or a bridge might suddenly fall down. In fact, her presentation slide of the famous\n1940\nTacoma Narrows Bridge collapse, caused by wind turbulence, is a favourite. \"The study of fluids is related to turbulence ... a similar thing is oscillations, and often you want to reduce the oscillations of a building\" or a bridge, as in Tacoma, she said. \"There are certain operating structures and physical laws which can be altered or impacted by applications of control. But first you need to understand why it happened. People working in experimental science can provide some prediction. Then we try to confirm or understand it better from the point of view of mathematics. That's exactly what the goal is.\" In fact, understanding something new and being able to impact a particular problem is the part of Lasiecka's research that she is most proud of. \"The example of this bridge, I can tell you that it's a nice part of research that you understand why it collapsed. It was confirmed by physicists and engineers with experimental science. Everything became clear.\"\nShe gives information about areas that are influenced by control theory in\n[\n16\n]\n:-\nControl theory is omnipresent in all aspects of life. Engineering, medicine, life sciences, computer science, and social sciences all benefit from control theory and pose a variety of open problems to be resolved. In the area of big data and artificial intelligence/robotics, one needs to effectively control systems with a reduced number of variables\n(\nwhile retaining relevant information of the system\n)\n; here, uncertainty is particularly challenging. That refers to modelling, observing, and controlling from remote locations. Closer links with control systems, where big data problems surface to the top of the scientific interests, as well as with the traditional engineering community are expected to continue and grow.\nThe range of applications of her work is also shown by the different organisations that supported. and continue to support, her work. We have mentioned above the continual support she has received from the National Science Foundation but she has also been supported by the Air Force Office of Scientific Research, by the Army Research Office and by the National Aeronautics and Space Administration. She has been an Institute of Electrical and Electronics Engineers Distinguished Lecturer, and has given plenary lectures at\nAmerican Mathematical Society\nconferences, at\nSociety for Industrial and Applied Mathematics\nconferences and at Institute of Electrical and Electronics Engineers conferences. She has served as Chair of the International Federation for Information Processing Committee on Modelling and Optimisation from\n1989\nto\n2002\n.\nLet us end this biography by noting that, as of March\n2025\n, MathSciNet lists\n428\npublications for Irena Lasiecka. Her CV lists\n32\nstudents whose Ph.D. thesis she has directed up to\n2021\n. It also lists\n17\npostdoctoral fellows whose work she has supervised. Her interests outside her career include music, theatre, film, reading, and gardening.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Polish Academy of Sciences",
    "Riccati",
    "Society for Industrial and Applied Mathematics",
    "Paul Erdős",
    "American Mathematical Society"
  ],
  "imagens": [
    "lasiecka.jpg"
  ]
}