{
  "nome_completo": "László Rédei",
  "nome_curto": "László Rédei",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Redei/",
  "data_nascimento": "15 November 1900",
  "local_nascimento": "Rákoskeresztur, Budapest, Hungary",
  "data_morte": "21 November 1980",
  "local_morte": "Budapest, Hungary",
  "summary": "László Rédei was a Hungarian mathematician who worked on algebraic number theory and abstract algebra.",
  "biografia": "László Rédei\n's name also appears as\nLadislaus Rédei\n, in particular it is this version of his name which appears on his papers in the\n1940\ns. He was brought up in Budapest, the town of his birth. He attended school in Budapest, then studied at the University of Budapest. He continued to undertake research at the University of Budapest and published his first paper in\n1921\n. The paper was\nExistence theorem for the primitive root of the congruence\nx\nϕ\n(\np\na\n)\n−\n1\n≡\n0\n(\nm\no\nd\np\nα\n)\nx^{\\phi(p^{a})} - 1  ≡ 0 (mod p^{\\alpha})\nx\nϕ\n(\np\na\n)\n−\n1\n≡\n0\n(\nm\no\nd\np\nα\n)\n(\nHungarian\n)\n. In the following year he was awarded his doctorate but, before the award of his doctorate, Rédei had already become a secondary teacher of mathematics, taking up his first teaching appointment in\n1921\n.\nFor nearly twenty years Rédei worked as a secondary school teacher. At first he taught in schools in small towns but eventually he was appointed to teach at a school in Budapest. It is remarkable that during these years, as well as undertaking the demanding job of school teaching, he was undertaking research and publishing papers. These papers are impressive both for their quality and for the number which he published during this period. By\n1940\n, the year he moved from secondary school teaching to become a lecturer at Szeged University, Rédei had published over\n35\npapers on\nalgebraic number theory\n, particularly on class groups of quadratic number fields. He may have remained outside universities for nearly\n20\nyears, but he did achieve high recognition for his work in other ways. He was awarded an\nhabilitation\nfrom Debrecen in\n1932\n, studied at the University of Göttingen with a Humboldt scholarship in the academic year\n1934\n-\n35\n, and was awarded the Julius König medal in\n1940\n.\nTo understand how a vacancy occurred at the University in Szeged we need to look at the events which began while Rédei was undertaking research in Budapest. Cluj\n(\nknown also by its German name, Klausenburg, and its Hungarian name, Kolozsvár\n)\nhad, with the rest of Transylvania, been incorporated into Romania in\n1919\n. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n. The Hungarian university in Cluj moved first to Budapest, then to Szeged. In\n1940\n, Hungary captured the part of Romania containing Cluj, and the Hungarian university was moved back from Szeged to Cluj. A new university was founded in Szeged in the same year and many of the staff chose to remain in Szeged and work at the new university rather than move to Cluj. However Gyula Szokefalvi-Nagy left the\nBolyai\nInstitute in Szeged and moved to Cluj, with Rédei becoming his replacement. In\n1941\nRédei was appointed to the Chair of Geometry in Szeged but later he was appointed to the Chair of Algebra and Number Theory. He remained at the University of Szeged until\n1967\n.\nLet us look now at Rédei's work on algebraic number theory. His first papers were devoted to providing new proofs of the quadratic reciprocity law. He then moved on to what would be his main work for around\n25\nyears.\nGauss\nhad proved that the number of even invariants of the class group of a quadratic number field is one less than the number of prime factors occurring in the\ndiscriminant\nof the number field. However, when Rédei started work on the problem there was no information on the size of the cyclic components. In the early\n1930\ns he obtained a formula for the number of cyclic components which have order at least\n4\n. The paper\n[\n1\n]\nexamines the work which led up to the solution of the problem by Rédei in\n1953\n:-\nIn\n1953\nL Rédei published his famous article \"Die\n2\n-Ringklassen-gruppe des quadratischen Zahlkörpers und die Theorie des Pell-schen Gleichung\"\nⓉ\n(\nThe\n2\n-ring class group of quadratic field and the theory of Pell's equation\n)\n, after many years of investigation of\nPell\n's equation. He gave a unified theory for the structure of class groups of real quadratic number fields and conditions for solvability of\nPell\n's equation and other indeterminate equations.\nThis was not the only problem concerning quadratic number fields which Rédei investigated over this period. Between\n1936\nand\n1942\nhe looked at the problem of determining which real quadratic number fields\nQ\n(\n√\nd\n)\n\\mathbb{Q}(√d)\nQ\n(\n√\nd\n)\nhave a ring of integers which is a Euclidean ring. There are actually\n21\nsuch fields but Rédei did not achieve this classification. He did however publish a number of papers such as\nÜber den Euklidschen Algorithmus in reell quadratischen Zahlkörpern\nⓉ\n(\nOn the Euclidean algorithm in real quadratic fields\n)\n(\nHungarian\n)\n(1940)\n,\nÜber den Euklidischen Algorithmus in reellquadratischen Zahlkörpern\nⓉ\n(\nOn the Euclidean algorithm in real quadratic fields\n)\n(1941)\n, and\nZur Frage des Euklidischen Algorithmus in quadratischen Zahlkörpern\nⓉ\n(\nThe question of the Euclidean algorithm in quadratic fields\n)\n(1942)\n. In these he found several of the\n21\ncases, also showing that many others do not have a Euclidean ring of integers. He did, however, get one of these wrong for he 'proved' in the last of the three papers we mentioned that\nQ\n(\n√\n97\n)\n\\mathbb{Q}(√97)\nQ\n(\n√\n9\n7\n)\nhas a ring of integers which is a Euclidean ring. This error was only spotted in\n1952\n.\nThe other two main areas to which Rédei contributed are group theory and semigroup theory. In group theory he worked for many years of factorisations of finite abelian groups, looking at properties of abelian groups in every element had a unique factorisation as a product of elements one from each of a number of specified subsets of the group. His most general result in this area is the subject of the paper\nNeuer Beweis des Hajósschen Satzes über die endlichen Abelschen Gruppen\nⓉ\n(\nNew evidence for Hajós's theorem on finite Abelian groups\n)\n(1955)\n. He also worked on finite\np\np\np\n-groups and a major text\nEndliche p-Gruppen\nⓉ\n(\nFinite p-groups\n)\nwas published in\n1989\n, nine years after his death. A reviewer writes:-\nThe classical approach to the study of p-groups consists in the investigation of their subgroups and central series. The author presents a new approach to the investigation of finite p-groups. It is based on the notion of a basis\n(\nof minimal length\n)\nof an arbitrary p-group.\nOne of Rédei's most important contributions to semigroup theory is his proof that every finitely generated commutative semigroup is finitely presented. This result appears in his book\nTheorie der endlich erzeugbaren kommutativen Halbgruppen\nⓉ\n(\nTheory of finitely generated commutative semigroups\n)\n(1963)\nwhich was translated into English as\nThe theory of finitely generated commutative semigroups\n(1965)\n. However, he contributed numerous other significant results about semigroups, for example classifying all semigroups whose proper subsemigroups are groups and providing a wide range of interesting examples of semigroups.\nLet us mention other important books written by Rédei. In\n1965\nhe wrote\nBegründung der euklidischen und nichteuklidischen Geometrien nach F Klein\nⓉ\n(\nJustification of Euclidean and non-Euclidean geometries by F Klein\n)\nwhich was translated into English and published in\n1968\nas\nFoundation of Euclidean and non-Euclidean geometries according to F Klein\n. There is also\nLückenhafte Polynome über endlichen Körpern\nⓉ\n(\nIncomplete polynomials over finite fields\n)\n(1970)\n, translated into English as\nLacunary polynomials over finite fields\n(1973)\n. L Carlitz writes in a review:-\nThe author has written this book with great care. It is by no means easy to read. However the remarkable results and methods will repay careful study.\nPerhaps his most famous textbook is\nAlgebra\nwritten in Hungarian and published in\n1954\nwith a German translation being published in\n1959\n.\nPaul Halmos\n, reviewing the Hungarian edition, writes:-\nThe book is intended to be both a university text and a reference volume. It treats its subject carefully, systematically, and exhaustively. The exposition is, in principle, self-contained. There are no exercises, but there are many examples and counterexamples designed to supply the concrete background needed for the understanding of the abstract material. Whenever possible, the author proceeds from the general to the special.\nFinally we quote from\n[\n3\n]\nconcerning Rédei as a teacher:-\nDuring the almost thirty years he spent as Szeged University, he had a great influence on his pupils. In his lectures he was hardly interested in the volume of the presented material, but in putting it in the proper light. He lectured without the slightest trace of rhetoric, but most of what he said was clear even for the weaker students and at the same time it contained many stimulating remarks for the good ones. He was able to create an excellent scientific atmosphere around him. He always felt his pupils to be collaborators, and never refused to learn from them. A whole generation of Hungarian algebraists can be considered as more or less direct pupils of his.",
  "matematicos_citados_na_biografia": [
    "algebraic number theory",
    "habilitation",
    "Bolyai",
    "Gauss",
    "discriminant",
    "Pell",
    "Paul Halmos"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}