{
  "nome_completo": "Leo Zippin",
  "nome_curto": "Leo Zippin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zippin/",
  "data_nascimento": "25 January 1905",
  "local_nascimento": "New York City, New York, USA",
  "data_morte": "11 May 1995",
  "local_morte": "Manhattan, New York, USA",
  "summary": "Leo Zippin was an American mathematician who is best known for being one of those who solved Hilbert's Fifth Problem.",
  "biografia": "Leo Zippin\n's parents were Bella Salwen and Max Zippin who were immigrants to the United States arriving in New York in\n1903\n. Bella and Max were Jewish and they had lived in the city of Chernigov, situated in northern Ukraine around\n140\nkm north of Kiev. The years around\n1900\nwere difficult in Ukraine, with problems which would lead eventually to the Russian Revolution. There was also extreme anti-Semitism and for Max Zippin, who loved the Yiddish culture and supported a workers' revolution, it was a difficult place to live. Once settled in New York, Max wrote plays for the Yiddish theatre\n(\nnot successfully since none was ever performed\n)\nand he wrote for the\nJewish Daily Forward\n:-\nLaunched as a Yiddish-language daily newspaper on\n22\nApril\n1897\n, the 'Forward' entered the din of New York's immigrant press as a defender of trade unionism and moderate, democratic socialism.\nLeo was brought up in New York where he began his education. He entered the DeWitt Clinton High School but the Russian Revolution of\n1917\ndramatically changed the family's life. Max, the staunch supporter of the workers, was of course delighted and could not resist taking the family back to witness the historic events. What they found in Russia was extreme poverty, illness and a civil war. It was not the joyous revolution that Max had hoped to rejoice in, and after a while they decided to return to the United States. This, however, proved much harder than they realised since all routes leading west were blocked. If you can't go west then you have to go east and that is precisely what the Zippins did boarding the Trans-Siberian railway\n[\n1\n]\n:-\nThe family story has them as far as Harbin, Manchuria, nearly out of money. Bella marched up to the local potentate's residence and introduced herself as an English teacher to the startled man. She taught members of the household until the family was able to move on. The trip took, perhaps, close to two years.\nBack in the United States, the family settled in Philadelphia where Max found a job. Leo entered Central High School, Philadelphia, on\n19\nSeptember\n1919\n. The Russian adventure had quite an effect on Leo and certainly from that time on he did not want to follow his father's political ideas, rejecting Communism. Taking two years out seems to have done little, however, to slow down his educational achievements and his performance at the prestigious Central High School was outstanding. He entered the University of Pennsylvania in\n1922\n, was awarded the Freshman Entrance Prize in\n1923\nand graduated with his first degree in\n1925\n. He continued with graduate studies at the University of Pennsylvania advised by the topologist John Robert Kline\n(1891\n-\n1955)\n. John Kline had studied at the University of Pennsylvania under\nR L Moore\nand was appointed to his chair in\n1920\nwhen\nMoore\nmoved to Texas. John Kline was the most influential mathematician in the Philadelphia area during the\n1920\ns and Zippin prospered under his advice. His doctoral studies were funded first by his appointment as an assistant instructor in mathematics in\n1927\nand then for two years as a Harrison Fellow. He was awarded his Ph.D. on\n19\nJune\n1929\nfor his thesis\nA Study of Continuous Curves and their Relation to the Janiszewski-Mullikin Theorem\n. He published the main results of this thesis in a paper of the same name in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1929\n.\nDespite the depression, which made it almost impossible for Zippin to gain employment, he did succeed in gaining a National Research Fellowship which funded his visit during\n1929\n-\n30\nto the University of Texas. John Kline had written to\nR L Moore\non\n22\nApril\n1929\n, before Zippin had been awarded his doctorate, including the comment:-\nZippin has applied and asked to come to Texas to work with you.\nZippin's paper\nGeneralization of a theorem due to C M Cleveland\nwas read at the\n1931\nEaster meeting of the\nAmerican Mathematical Society\nat the University of California, Berkeley. The paper was published in the\nAmerican Journal of Mathematics\nin\n1932\n. Again a National Research Fellowship funded him during the year\n1931\n-\n32\nwhich he spent at Princeton. This was an important year for Zippin who was able to work with some outstanding mathematicians such as\nOswald Veblen\nand\nJames Alexander\n. He married Frances Levinson, a teacher at the James Madison High School in Brooklyn in\n1932\n; they had two daughters Nina and Vivian. In March\n1932\nthe\nAmerican Mathematical Society\nmet at Columbia University in New York. Zippin attended the meeting and delivered a talk\nOn the Rutt-Nöbeling theorem\n. His abstract begins:-\nA new and thoroughly independent proof is given that a locally compact continuous curve\nC\nC\nC\n, containing two points\nx\nx\nx\nand\ny\ny\ny\nsuch that no\nN\nN\nN\npoints of\nC\nC\nC\nseparate\nx\nx\nx\nand\ny\ny\ny\n, contains at least\nN\n+\n1\nN+1\nN\n+\n1\nindependent arcs\nx\ny\nxy\nx\ny\n.\nIn addition, his paper\nIrreducible continuous curves\nwas also read to the meeting. In September of that year the Society again met at Columbia University with Zippin attending and delivering his lecture\nCharacterization of the closed\n2\n-cell\n.\nIf jobs had been hard to get in\n1929\n, they were even harder to get in\n1933\nwhen Zippin's fellowship ended. However, the Institute for Advanced Study had just opened in Princeton and Zippin was offered a position as research assistant to\nJames Alexander\n. He gladly accepted and he undertook joint work with\nAlexander\nleading to the publication of their joint paper\nDiscrete abelian groups and their character groups\n(1935)\n. Zipppin had published papers prior to this, in addition to that already mentioned, with\nThe Moore-Kline problem\n(1932)\nand\nIndependent arcs of a continuous curve\n(1933)\n.\nAn important event for Zippin's career occurred when, in\n1934\n-\n35\n,\nDeane Montgomery\nwas a National Research Council Fellow at the Institute for Advanced Study in Princeton. The two mathematicians became firm friends and over the following years undertook important joint research projects. In\n1936\nZippin left the Institute for Advanced Study when he was appointed as an instructor at New York University. After spending the first four years of their married life living far from each other, Zippin and his wife were at last together. Two years later, in\n1938\n, he was appointed to Queens College, a part of the City University of New York. He had a heavy teaching load at Queens College but continued to undertake research, collaborating with\nDeane Montgomery\nwho was, at this time, at Smith College, Northampton, Massachusetts. When the United States entered World War II in December\n1941\n, Zippin was nearly\n37\nyears old; too old for active service. He volunteered for war work and was given leave by Queens College in\n1942\nto work at the Ballistics Research Laboratory in Aberdeen, in Maryland.\nIsaac Schoenberg\nwrites about his time at the Aberdeen Proving Ground\n[\n2\n]\n:-\nSeveral mathematicians, among them\nO Veblen\n,\nMina Rees\nand Leo Zippin, were concerned with making mathematicians available for the war effort. Leo Zippin, as a Corporal, followed the development of the first electronic computer, the ENIAC, at the\nMoore\nSchool of the University of Pennsylvania, which was to be moved to the Ballistics Research Laboratory in Aberdeen,  Maryland. Leo Zippin arranged my going to the Ballistics Research Laboratory for the duration\n[1943\n-\n46]\n.\nIn late\n1945\n, Zippin returned to his duties at Queens College but he also continued with the work he had undertaken at the Aberdeen Proving Ground being attached to the Institute for Mathematics and Mechanics at New York University. He slowly returned to his joint research with\nDeane Montgomery\n, and together they made progress towards a solution to\nHilbert\n's fifth problem\n[\n1\n]\n:-\nThey met at least once a month, sometimes in New York, sometimes Princeton, talked on the phone and exchanged letters. ...\nMontgomery\nand Zippin conducted their collaboration while walking. ... In Princeton the countryside was nearby; in New York they took long walks in Central Park. ... they were \"wonderful friends.\"\nIn\n1952\nthey published three joint papers which, together with a theorem of\nAndrew Gleason\n, prove that every locally Euclidean group is a\nLie\ngroup. This solves\nHilbert\n's Fifth Problem. Two of the three papers have the title\nSmall subgroups of finite-dimensional groups\nwhile the third is entitled\nFour-dimensional groups\n. The theorem which Zippin and\nMontgomery\nproved was:-\nIf G is a separable, metric, locally compact, finite-dimensional, connected and locally connected topological group, and if all proper subgroups of G are generalized\nLie\ngroups, then G contains an invariant closed generalized\nLie\nsubgroup H such that G/H is finite-dimensional and has no small subgroups.\nKenkichi Iwasawa\nwrites in a review that this:-\n... theorem, together with a theorem of\nGleason\nthat a finite-dimensional group without small subgroups is a\nLie\ngroup, gives an important result that every finite-dimensional\n(\nseparable, metric, locally compact\n)\ngroup is a generalized\nLie\ngroup. It then follows immediately that every locally euclidean group is a\nLie\ngroup, namely, the solution of\nHilbert\n's fifth problem.\nZippin wrote the monograph\nTopological transformation groups\n(1955)\nwith\nMontgomery\n. A review by\nKenkichi Iwasawa\nbegins:-\nAlmost two decades have passed since publication of the first edition of\nPontryagin\n's \"Topological groups\"\n[1938]\nwhich has been since considered as one of the standard reference books in the field. In the meantime, the theory of topological groups has made outstanding progress, culminating in the solution of\nHilbert\n's fifth problem by\nGleason\nand by the authors of the present book. The authors give here a detailed account of those important results on locally compact topological groups obtained in this period, suggesting at the same time further future developments in the theory.\nAlthough Zippin continued to make an important contribution to Queens College up to his retirement in\n1971\n, his last research paper appeared in\n1956\n. After that he had only one further publication, namely the book\nUses of infinity\n(1962)\n. He writes in the Preface:-\nMost of this book is designed so as to make little demand on the reader's technical competence in mathematics; he may be a high school student beginning his mathematics now or one who has put away and forgotten much of what he once knew. On the other hand, the book is mathematical except for the first chapter - that is to say, it is a carefully reasoned presentation of somewhat abstract ideas. ... I hope that the reader will believe me when I say that professional mathematicians do not profess to understand better than anybody else what, fro a philosophical point of view, may be called the \"meaning of infinity.\" This is proved, I think, by the fact that most mathematicians do not talk about this kind of question, and those who do, do not agree.\nAt Queens College, Zippin was rightly considered a celebrity. Joseph Malkevitch, a student of Zippin's in the early\n1960\ns, wrote about his:-\n... special excitement in taking a course with someone who had solved one of the world-famous\nHilbert\nproblems.\nZippin was honoured with election to the\nAmerican Academy of Arts and Sciences\nin\n1970\n. In April\n2008\nthe following resolution was made:-\n... the Board of Trustees of The City University of New York approve the naming of Room\n508\nof Kiely Hall at Queens College as \"The Leo Zippin Mathematics Common Room.\"\nThey gave the following explanation:-\nLeo Zippin was a renowned mathematician who taught at Queens College from\n1938\nuntil\n1971\n. He was a founding member of the Queens College Mathematics Department and the first Executive Officer of the Mathematics Ph.D. program at 'The CUNY Graduate Center'. Professor Zippin was an inspiration to many students who pursued graduate studies and careers in mathematics. In\n1995\n, Room\n508\nof Kiely Hall was dedicated to the memory of Professor Zippin, who died that year.",
  "matematicos_citados_na_biografia": [
    "R L Moore",
    "Moore",
    "American Mathematical Society",
    "Oswald Veblen",
    "James Alexander",
    "Alexander",
    "Deane Montgomery",
    "Isaac Schoenberg",
    "O Veblen",
    "Mina Rees",
    "Hilbert",
    "Montgomery",
    "Andrew Gleason",
    "Lie",
    "Kenkichi Iwasawa",
    "Gleason",
    "Pontryagin",
    "American Academy of Arts and Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}