{
  "nome_completo": "Leonid Andreevich Pastur",
  "nome_curto": "Leonid Andreevich Pastur",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pastur/",
  "data_nascimento": "21 August 1937",
  "local_nascimento": "Vinnytsya, Ukraine",
  "data_morte": null,
  "local_morte": null,
  "summary": "Leonid Pastur is a Ukrainian mathematical physicist and theoretical physicist.",
  "biografia": "Leonid Andreevich Pastur\nwas born in Vinnytsya, Ukraine, a city in west-central Ukraine also known as Vinnitsa. The city had a one time been part of Poland and at another time part of Russia. He was born at an extremely difficulty time when around\n10\n,\n000\ncitizens of the city were massacred by the Soviet secret police. He attended secondary school in Mariupol, a city in the south east of Ukraine close to the Sea of Azov, graduating in\n1955\n. He then went to Kharkov\n(\nnow known as Kharkiv\n)\nwhere he entered the Faculty of Physics and Engineering at the Kharkov Polytechnic Institute. The authors of\n[\n6\n]\nwrite:-\nAt that time, the level of teaching of mathematics and theoretical physics in the faculty was extremely high, and this inspired students to study these subjects in more depth. This determined both Pastur's subsequent scientific interests and his style of work. The characteristics of his research activity have a natural connection with theoretical physics, the ability to distil new mathematical questions and promising lines of approach from a physical problem, and the effective application of modern mathematical methods when solving physical problems.\nHe was an undergraduate at the Kharkov Polytechnic Institute until\n1961\nwhen he graduated and began undertaking research at the Institute for Low Temperature Physics and Engineering in Karkov. This Institute was part of the\nAcademy of Sciences of Ukraine\n, and Pastur began work in the Department of Mathematical Physics which was headed by\nVladimir Aleksandrovich Marchenko\n. We note that\nMarchenko\nhad just been appointed as Head of the Department when Pastur began research, and\nEvgenii Yakovlevich Khruslov\nbegan research as\nMarchenko\n's student at the same time. Pastur was, at this time, appointed as a Junior Research Fellow. In\n1964\nhe was awarded a Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin theoretical mathematical physics for his thesis\nThe dislocation theory of twins in bounded crystals\n. In this thesis he studied questions of the dislocation theory of twinning in the theory of strength of materials.\nIlya Mikhailovich Lifshitz\n(1917\n-\n1982)\n, the younger brother of\nEvgenii Mikhailovich Lifshitz\n, began working with Pastur in\n1963\n. They developed a theory of disordered systems, a new field of solid state physics having to do with substances that have no large scale structural order. Examples of such materials are amorphous metals, semiconductors, polymers, and many others. Their work on this topic over the following fifteen years was written up in several papers but put together in the monograph\nIntroduction to the theory of disordered systems\n(\nRussian\n)\n(1982)\n. Andrzej Zardecki writes in a review:-\nThis book is devoted to one-particle approximation in the theory of disordered systems. The authors start with a general discussion, exemplified by such properties as the existence of spectral bounds, density of a discrete spectrum and localization. About one-half of the book deals with one-dimensional systems. The concept of the density of states is thoroughly illuminated with model calculations. This is followed by a study of more complex features of disordered systems including the localization length and kinetic properties. In the three-dimensional case, the authors investigate the behaviour of the density of states and of the wave function in the vicinity of the fluctuating spectral bounds. For substitutional disorder a modified perturbation theory, based on the smallness of concentration, is established. Both formal properties of the perturbation series and the applications to the evaluation of the spectrum in the presence of impurity centres are discussed. In the last part of the book, the authors study the penetration of a stream of particles through a disordered layer. This text give a comprehensive treatment of the theory of disordered systems; the bibliography includes work done in the field up to\n1980\n.\nPastur was promoted to Senior Research Fellow at the Institute for Low Temperature Physics and Engineering in\n1968\nand awarded his Doctor of Science degree\n(\nequivalent in standard to a D.Sc. of the\nhabilitation\n)\nin\n1975\nfor his thesis\nProblems in the theory of disordered systems\n. The authors of\n[\n10\n]\ngive the following acknowledgement in their paper:-\nIt is a pleasure to dedicate this survey to Leonid A Pastur - one of the founding fathers of the rigorous theory of disordered systems. He is a mathematical physicist who masterly knows how to convert physical intuition into mathematical theorems and vice versa. Many of his contributions to the theory of random\nSchrödinger\noperators have been ground breaking. Here we only mention the early papers\n[(\nwith M M Benderskij\n)\n'On the spectrum of the one-dimensional Schrödinger equation with a random potential'\n(1970)\n, 'On the Schrödinger equation with a random potential'\n(1971)\n, 'On the distribution of the eigenvalues of the Schrödinger equation with a random potential'\n(1972)\n, 'Behaviour of some Wiener integrals as t  →  infinity and the density of states of Schrödinger equations with random potential'\n(1977)\n,\n(\nwith I Ya Goldsheid and S Molchanov\n)\n'A pure point spectrum of the stochastic one-dimensional Schrödinger operator'\n(1977)\n, and 'Spectral properties of disordered systems in the one-body approximation'\n(1980)]\n, his survey articles\n[\n'Spectra of random self-adjoint operators'\n(1973)\n, and 'Spectral properties of random self-adjoint operators and matrices\n(\na survey\n)\n'\n(1999)]\nand the monographs\n[(\nwith I M Lifshits and S A Gredeskul\n)\n'Introduction to the theory of disordered systems'\n(1982)\n, and\n(\nwith A Figotin\n)\n'Spectra of random and almost-periodic operators'\n(1992)]\n.\nSince the above quote mentions two important monographs co-authored by Pastur, we should give a few further details of the second at this point. He wrote\nSpectra of random and almost-periodic operators\nin collaboration with Alexander Figotin. Russell A Johnson begins a review of the monograph by writing:-\nThe present book studies random differential and difference operators. The most important example is the random\nSchrödinger\noperator ... These operators have been much studied in recent years ...\nLet us give details of Pastur's career at the Institute for Low Temperature Physics and Engineering in Kharkov. He was Head of the Department of Statistical Methods in Mathematical Physics from\n1985\nto\n1997\n, and Deputy Director and Head of the Mathematical Division from\n1987\nto\n1997\n. He served as a part-time Professor at Kharkov State University from\n1978\nto\n1994\n, and then as Professor in the Department of Mathematics at the University Paris\n7\n, Denis Diderot, from\n1995\nto\n2004\n. These university appointments, however, did not affect his main appointment at the Institute for Low Temperature Physics and Engineering in Kharkov where he has been employed throughout his career. In Paris, Pastur had other appointments, namely as Head of Department of Theoretical Physics at the University Paris\n7\n, Denis Diderot, from\n2003\n.\nPastur also plays a major role in the administration of research in  Ukraine. For instance he served as Chairman of the Mathematics Panel of the Ukrainian Fund of Fundamental Researches in Kiev from\n1992\nto\n1996\n, and as Chairman of the Ukrainian Fund of Fundamental Researches in Kiev from\n1994\nto\n1996\n. At an international level, he was a member of the Executive Committee of the International Association of the Mathematical Physics from\n1997\nto\n2003\n. We should also note that he has served on the editorial boards of many journals: the International Journal of Low Temperature Physics\n(1994\n-\n)\n; the Journal of Statistical Physics\n(1987\n-\n1989\n,\n1993\n-\n1996)\n; Mathematical Physics, Analysis and Geometry\n(1994\n-\n)\n; the Ukrainian Mathematical Journal\n(1992\n-\n)\n; Selecta Matematica Sovetica\n(1988\n-\n1995)\n; Random Operators and Stochastic Equations\n(1992\n-\n)\n; Markov Processes and Related Fields\n(1999\n-\n)\n; and Geometrical and Functional Analysis\n(2001\n-\n)\n.\nThe most recent monograph by Pastur is\nEigenvalue distribution of large random matrices\n(2011)\nwritten in collaboration with Mariya Shcherbina.\nTerence Tao\nhas reviewed the book and writes:-\nThis text is another welcome and modern addition to the literature on the asymptotic spectral statistics of large random matrices. The focus in this text is on the classical invariant Hermitian or symmetric random matrix ensembles, such as the Gaussian Unitary Ensemble, Gaussian Orthogonal Ensemble and Wishart ensemble. However, some space is also devoted to more general classes of ensembles, such as invariant ensembles given by a potential function, or\nWigner\nmatrix models in which the upper-triangular entries are jointly independent. Some invariant unitary matrix models are also considered.\nPastur has been honoured for his many contributions. In particular he had been awarded the Ukrainian State Prize in Science and Technology\n(1985)\nfor his book\nIntroduction to the theory of disordered systems\n(\nRussian\n)\nwritten with Ilya Mikhailovich Lifshitz, and elected an Academician of the\nNational Academy of Sciences of Ukraine\n(1990)\n. He has been an invited speaker at many major conferences including as a special session speaker at the International Congress of Mathematicians held in Berkeley in August\n1986\n, a similar role at the International Congress of Mathematical Physics held in Swansea in\n1988\n, a plenary lecturer at the International Congress of Mathematical Physics held in Leipzig in\n1991\n, and a special session speaker at the II European Congress of Mathematicians held in Budapest in\n1996\n. In May\n20013\nthe conference 'Mathematical Physics of Disordered Systems' was held in Hagen, Germany, in Pastur's honour. The organisers wrote:-\nThe Wednesday will be a special day: all sessions will be in honour of Professor Leonid Pastur. The morning session will take place at the usual conference location. To celebrate Leonid's\n75\nth\nbirthday the Wednesday afternoon session will take place at the medieval castle Hohenlimburg near Hagen. The conference dinner on Wednesday evening will also takes place at the castle.\nLet us end with the following comments by the authors of\n[\n6\n]\n:-\nHis vast erudition, both in mathematics and physics, together with his open character and helpful attitude, have always attracted numerous students to him. Many of them now hold doctorates or higher doctorates.\nThe authors of\n[\n4\n]\nmake similar comments:-\nThe scope of his research interests is very broad. He continuously follows all the new advances not only in areas close to his own, but also in other areas of mathematics. His immense erudition in mathematics as well as physics, in combination with his sociable disposition and benevolence, has attracted to him numerous students who are now successfully working in Ukraine and in other countries.",
  "matematicos_citados_na_biografia": [
    "Academy of Sciences of Ukraine",
    "Vladimir Aleksandrovich Marchenko",
    "Marchenko",
    "Evgenii Yakovlevich Khruslov",
    "Evgenii Mikhailovich Lifshitz",
    "habilitation",
    "Schrödinger",
    "Terence Tao",
    "Wigner",
    "National Academy of Sciences of Ukraine"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}