{
  "nome_completo": "Leopold Bernhard Gegenbauer",
  "nome_curto": "Leopold Gegenbauer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gegenbauer/",
  "data_nascimento": "2 February 1849",
  "local_nascimento": "Asperhofen (E of Herzogenburg), Austria",
  "data_morte": "3 June 1903",
  "local_morte": "Giesshübl, Mödling, Austria",
  "summary": "Leopold Gegenbauer was an Austrian mathematician who gave his name to a sequence of orthogonal polynomials.",
  "biografia": "Leopold Gegenbauer\nwas the son of Viktorin Gegenbauer, who was a surgeon, and Amalie Zeitzem, the daughter of Bernhard Zeitzem who was the Administration Controller for the Imperial War Council Deposits in Vienna. In the autumn of\n1858\nLeopold entered the Piarist\nGymnasium\nin Krems an der Donau in Austria. This school was run by the Roman Catholic educational order of Piarists, or Poor Clerics of the Mother of God, and had an excellent reputation for high quality education taking in a wide range of children. At this school Gegenbauer studied reading, writing, elementary mathematics, grammar, humanities, poetry and rhetoric as well as the specialist Piarist topics of schola principiorum and schola parva. He took his matriculation examination in\n1866\nand was awarded an \"excellent\" or \"outstanding\" in every subject.\nGegenbauer entered the University of Vienna in the autumn of\n1866\nand in his first year he studied history, Sanskrit grammar, and comparative linguistics of Indo-European langages. However, he changed topics for his second year to take courses in mathematics and physics. His lecturers at Vienna included the mathematicians Franz Moth and\nJózeph Petzval\n, the astronomer Edmund Weiss, and the mathematical physicists\nLudwig Boltzmann\n,\nJosef Stefan\nand Viktor von Lang. He graduated in June\n1869\nwith a degree which qualified him to teach mathematics and physics in Gymnasia in Austria. First he spent the year\n1869\n-\n70\nas a probationary teacher in the Gymnasium in Vienna, after which he taught at the Gymnasium in Waidhofen an der Thaya in the north of Austria, but moved to become a teacher at the National Gymnasium in Krems an der Donau, also in Austria. In\n1873\nhe obtained leave from his teaching position in Krems, and was awarded a grant for travel and living expenses, allowing him to undertake research at the University of Berlin. At Berlin he attended lectures from\nKarl Weierstrass\n,\nEduard Kummer\n,\nHermann Helmholtz\nand\nLeopold Kronecker\nduring the two years he studied there from\n1873\nto\n1875\n. He found\nWeierstrass\n's lectures fascinating and spent much time working through the details but he was also influenced by\nKronecker\n's lectures which gave him an interest in number theory which lasted throughout his life. During these years he made a number of close friends and was very active in the Mathematics Society. In\n1875\nhe was awarded a doctorate in mathematics for his work on what today are called the 'Gegenbauer polynomials', in particular proving his famous addition formula for these polynomials.\nAfter graduating from Berlin, Gegenbauer returned to Vienna where, in the autumn of\n1875\n, he received an offer of a professorship at the High School in Wiener Neustadt. However, before making his decision, he was offered the position of extraordinary professor at the University of Czernowitz. Now Czernowitz, on the upper Prut River in the Carpathian foothills, was at that time in the Austrian Empire but after World War I it was in Romania, then after\n1944\nit became Chernovtsy in Ukraine. Czernowitz University was founded in\n1875\nand Gegenbauer was being offered the first professorship of mathematics there. Of the two offers, he preferred the professorship at Czernowitz which he happily accepted. He remained in Czernowitz for three years and during this time he married Helene Schuler von Libloy\n(1861\n-\n1924)\n, the daughter of Friedrich Schuler von Libloy who was professor of German Law at the University of Czernowitz. Gegenbauer gave outstanding service to the new university of Czernowitz which they recognised by awarding him an honorary degree in\n1879\n.\nIn\n1878\nGegenbauer moved to the University of Innsbruck where he became a colleague of\nOtto Stolz\nwho, like Gegenbauer, was an Austrian who had studied at Vienna but had been strongly influenced by spending two years at the University of Berlin. In Innsbruck Gegenbauer again held the position of extraordinary professor. However, he immediately took study leavend spent some of\n1878\n-\n79\nin Rome attending lectures by\nLuigi Cremona\n; while there he studied in the Vatican Library. After three years teaching in Innsbruck Gegenbauer was appointed full professor in\n1881\n, then he was appointed as full professor of mathematics at the University of Vienna in\n1893\nfilling the vacancy created by the death in September\n1891\nof his former teacher\nJózeph Petzval\n. During the session\n1897\n-\n98\nhe was Dean of the university. He remained at Vienna until his death. Among the students who studied with him at Vienna were the Slovenian\nJosip Plemelj\n, the American\nJames Pierpont\n,\nErnst Fischer\n, and Lothar von Rechtenstamm.\nGegenbauer had many mathematical interests such as\nnumber theory\n, function theory, and the theory of integration, but he was chiefly an algebraist. He is remembered for the Gegenbauer polynomials, a class of orthogonal polynomials which he introduced in his doctoral thesis of\n1875\nand also studied in several papers; they play an important role in potential theory and harmonic analysis. Theses polynomials are obtained from the\nhypergeometric\nseries in certain cases where the series is in fact finite. The Gegenbauer polynomials are solutions to the Gegenbauer differential equation and are generalizations of the associated\nLegendre\npolynomials. However, the name of Gegenbauer occurs in many other places, such as Gegenbauer functions, Gegenbauer transforms, Gegenbauer series,\nFourier\n-Gegenbauer sums,\nGauss\n-Gegenbauer quadrature, Gegenbauer's integral inequalities, Gegenbauer's partial differential operators, the Gegenbauer equation, Gegenbauer approximation, Gegenbauer weight functions, the Gegenbauer oscillator, and the Gegenbauer addition theorem published in\n1875\n. Around\n300\npapers appear in MathSciNet whose title includes one of these notions named for Gegenbauer. As an example of his work on number theory, let us mention the paper\nAsymptotische Gesetze der Zahlentheorie\nⓉ\n(\nAsymptotic laws of number theory\n)\n(1885)\nin which he gave the well-known asymptotic estimate\n6\nn\nπ\n2\n\\Large\\frac{6n}{\\pi^{2}\\normalsize}\nπ\n2\n6\nn\n​\nfor the number of square-free integers not exceeding\nn\nn\nn\n.\nThe Monatshefte für Mathematik und Physik was founded by Gustav von Escherich and the emeritus professor\nEmil Weyr\nin\n1890\n, and Gegenbauer immediately began publishing papers in the journal. For example in the journal he published:\nEinige arithmetische Sätze\nⓉ\n(\nSome arithmetical propositions\n)\n(1890)\n,\nÜber die Wurzeln der hypergeometrischen Reihe\nⓉ\n(\nOn the roots of the hypergeometric series\n)\n(1891)\n,\nÜber die aus n Haupteinheiten gebildeten complexen Zahlen\nⓉ\n(\nOn the form of n main units in the complex numbers\n)\n(1891)\n,\nÜber die G Cantor'sche Zerlegung der reellen Zahlen in unendliche Producte\nⓉ\n(\nOn Cantor's decomposition of real numbers as infinite products\n)\n(1892)\n,\nÜber die Tchebychef-de Polygnac'sche Identität\nⓉ\n(\nOn The Chebychev-de Polygnac identity\n)\n(1892)\n,\nÜber eine arithmetische Formel\nⓉ\n(\nOn an arithmetic formula\n)\n(1892)\n,\nÜber reelle Primzahlen\nⓉ\n(\nOn real primes\n)\n(1893)\nand another eight papers in\n1893\n.\nEmil Weyr\ndied in\n1894\nand Gegenbauer assumed his position on the editorial board. He continued to publish several papers each year in the journal up to the year\n1900\n.\nUp to now we have not mentioned one important aspect of Gegenbauer's contributions, namely his work on actuarial science and accounting. He actively contributed to the insurance industry, designed a course on the Theory of Insurance at Vienna University, and was the main driving force behind establishing a chair of actuarial studies at the University of Vienna. Gegenbauer is said to have made the following prophetic statement\n(\nsee for example\n[\n1\n]\n)\n:-\nThe\n20\nth\ncentury is the century of technology: we should orient ourselves toward technology, unless we intend to condemn ourselves to atrophy.\nGegenbauer was also involved in educational policy issues and in local politics. He wrote a paper on the regulation of salaries for university professors in which he requested the nationalisation of tuition fees. During\n1889\n-\n1892\n, he acted as member of the municipal council of Innsbruck. From\n1898\nto\n1902\nhe served as a State School Inspector and while in this role he developed the curriculum in mathematics and physics for Gymnasia.\nWe have already mention the honorary degree awarded to Gegenbauer by the University of Czernowitz in\n1879\n. He received other honours such as elected as a corresponding member of the\nAustrian Academy of Sciences\nin\n1883\n. On\n6\nOctober\n1900\nhe was elected to the\nGerman Academy of Scientists Leopoldina\n.\nIn\n1901\nhe began to suffer from a severe nervous disease and had to stop teaching. His health continued to deteriorate until his death in\n1903\nat the age of\n54\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Józeph Petzval",
    "Ludwig Boltzmann",
    "Josef Stefan",
    "Karl Weierstrass",
    "Eduard Kummer",
    "Hermann Helmholtz",
    "Leopold Kronecker",
    "Weierstrass",
    "Kronecker",
    "Otto Stolz",
    "Luigi Cremona",
    "Josip Plemelj",
    "James Pierpont",
    "Ernst Fischer",
    "number theory",
    "hypergeometric",
    "Legendre",
    "Fourier",
    "Gauss",
    "Emil Weyr",
    "Austrian Academy of Sciences",
    "German Academy of Scientists Leopoldina"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}