{
  "nome_completo": "Leucippus of Miletus",
  "nome_curto": "Leucippus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leucippus/",
  "data_nascimento": "about 480 BC",
  "local_nascimento": "(possibly) Miletus, Asia Minor",
  "data_morte": "about 420 BC",
  "local_morte": null,
  "summary": "Leucippus was a Greek philosopher who originated the atomic theory of indivisibles developed later by Democritus.",
  "biografia": "Leucippus of Miletus\ncarried on the scientific philosophy which had begun to become associated with Miletus. We know little of his life but it is thought that he founder the School at Abdera on the coast of Thrace near the mouth of the Nestos River. Today the town is in Greece and is called Avdhira. At the time that Leucippus would have lived in Abdera it was a prosperous town which politically was a member of the\nDelian League\n.\nThe philosopher\nProtagoras\nwas born in Abdera and he was a contemporary of Leucippus but Protagoras, the first of the\nSophists\n, spent most of his life in Athens and may have left Abdera before Leucippus arrived there. Although now there seems little doubt that Leucippus existed, it is worth remarking that\nEpicurus\n, at the end of the fourth century BC, actually believed that Leucippus had never existed since so little was known of him. However we now know enough in the way of independent evidence to be sure that Leucippus did exist.\nAristotle refers to Leucippus as a philosopher with rather different views to those of\nParmenides\n.\nAristotle\nrefers to him several times and quotes from his works on a number of occasions. For example in\nDe caelo\nAristotle\nwrites:-\n... of those who have maintained the existence of indivisibles, some, as for example Leucippus and\nDemocritus\n, believe in indivisible bodies, others, like\nXenocrates\n, in indivisible lines.\nUnfortunately\nAristotle\nis not entirely consistent in his references to Leucippus. Some quotes suggest that atomism began with\nLeucippus\n, other quotes such as the one above bracket Leucippus and\nDemocritus\n, while in a few places\nAristotle\nseems to imply that\nDemocritus\nalone invented atomism.\nCertainly it seems that Leucippus was much influenced in his thinking by\nZeno of Elea\nand by Parmenides, but it seems relatively unlikely that there is any truth in the later claim that he was a pupil of\nZeno of Elea\n. More likely here is that later writers realised that Leucippus followed Zeno's ideas and 'pupil' was intended in this sense.\nIt is thought that\nDemocritus\nwas a pupil of Leucippus, where this time 'pupil' really does have its standard meaning. Together they are considered as the joint founders of\natomic theory\n. Leucippus stated that atoms are\n[\n7\n]\n:-\n... imperceptible, individual particles that differ only in shape and position.\nThe mixing of these particles gives rise to the world we experience. The reason that some early writers did not believe in the existence of Leucippus seems to be because his views and those of\nDemocritus\nbecame completely entwined. Quite soon the whole became attributed to\nDemocritus\nwho was the more famous of the pair. It seems likely that\nDemocritus\nas a pupil of Leucippus, developed the ideas of his teacher but it is quite beyond us to disentangle the contributions of each to this important doctrine.\nTwo works, almost certainly written by Leucippus, are\nThe Great World System\nand\nOn the Mind\n. The first of these is attributed to Leucippus by\nTheophrastus\n. Theophrastus\n(\nabout\n372\nBC -\n287\nBC\n)\nwas a pupil of\nAristotle\nwho had studied at Athens under\nAristotle\n. Theophrastus became head of the Lyceum in Athens after\nAristotle\nin\n323\nBC. He was in a position to be able to distinguish the works of Leucippus from those of\nDemocritus\nand we shall describe his views on this matter.\nTheophrastus claimed that the basic ideas of atomism were present in the philosophy of Leucippus according to which\n[\n1\n]\n:-\nBoth matter and void have real existence. The constituents of matter are elements infinite in number and always in motion, with an infinite variety of shapes, completely solid in composition.\nAccording to\nDiogenes Laertius\n, the\ncosmology\nput forward by Leucippus in\nThe Great World System\nis a creation of worlds by agglomerations of atoms by chance collisions. There is then differentiation with the smaller atoms being sent off into the infinity of space while the rest form into a spherical structure with the larger atoms at the centre and the smaller atoms further away from the centre.\nFrom the treatise\nOn the Mind\nwe have the only quotation of the words of Leucippus which have survived. In this work he writes\n(\nsee for example\n[\n8\n]\n)\n:-\nNothing happens in vain, but everything from reason and of necessity.\nLeucippus also contributed to the\nmethod of exhaustion\n.",
  "matematicos_citados_na_biografia": [
    "Delian League",
    "Protagoras",
    "Sophists",
    "Epicurus",
    "Parmenides",
    "Aristotle",
    "Democritus",
    "Xenocrates",
    "Zeno of Elea",
    "atomic theory",
    "Theophrastus",
    "Diogenes Laertius",
    "cosmology",
    "method of exhaustion"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}