{
  "nome_completo": "Li Chunfeng",
  "nome_curto": "Li Chunfeng",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Li_Chunfeng/",
  "data_nascimento": "602",
  "local_nascimento": "Shaanxi province, China",
  "data_morte": "670",
  "local_morte": "Chang'an, China",
  "summary": "Li Chunfeng was a Chinese mathematician who worked in astronomy and calendar reform.",
  "biografia": "Li Chunfeng\n's name is sometimes written as\nLi Ch'un-feng.\nHe was born during the short lived Sui dynasty which was important in unifying a country which had been divided for over\n300\nyears. Education became important and mathematics was taught at the Imperial Academy. Li Chunfeng's father was a Taoist and this had a great influence on Li Chunfeng's thinking. It is a positive religion, emphasising the joyful and carefree sides of the Chinese character. It is also characterized by a positive, active attitude toward the occult and, as we shall see below, Li Chunfeng became to be regarded as a great astrologer and prophet through using numerology.\nWhen Li Chunfeng was sixteen years old, the Sui dynasty was replaced by the T'ang dynasty. It continued the educational development which had already begun, and formalised the teaching of mathematics at the Imperial Academy. Li rose to become a high-ranking court astronomer and historian, being first appointed to the Imperial Astronomical Bureau in\n627\n. The reason for his appointment was the need for calendar reform. In ancient China there was a belief that a ruler received his right to rule from heaven. Changing the calendar was seen as one of the duties of the office, establishing the emperor's heavenly link on earth. After a change of ruler, and even more significantly after a change of dynasty, the new Chinese emperor would seek a new official calendar thus establishing a new rule with new celestial influences.\nAlthough the Chinese calendar had only been in operation for a few years, already predictions of eclipses were getting out of step.\nWang Xiaotong\nhad been appointed to the Imperial Astronomical Bureau a few years earlier to make recommendations. Li was promoted to become the deputy director of the Imperial Astronomical Bureau in about\n641\n.\nWe shall describe below some of the contributions Li made to mathematics through his work in astronomy and calendar reform. First let us note his contributions as an historian. He assisted in compiling the official histories of the Jin and Sui dynasties. In the\nJinshu\n(\nHistory of the Jin Dynasty\n)\nand\nSuishu\n(\nHistory of the Sui Dynasty\n)\nLi wrote the chapters on the developments in Chinese astronomy, astrology, metrology, and the mathematics of music through the relevant periods.\nIn\n648\nLi was appointed as director of the Imperial Astronomical Bureau. He also became editor-in-chief for a collection of mathematical treatises now called\nThe Ten Classics\na name given to them in\n1084\n. The History of the T'ang records\n(\nsee\n[\n5\n]\n)\n:-\nThe astronomical observer Wang Sibian presented a memoir to the emperor reporting that the ten mathematical texts such as the Wucao suanjing or the Sunzi suanjing were riddled with mistakes and contradictions. As a consequence\nLi Chunfeng\ntogether with Liang Shu, an expert in mathematics from the ministry of education, and Wang Zhenru, a teacher from the national university and others were ordered by imperial decree to annotate the ten mathematical texts such as the Wucao suanjing or the Sunzi suanjing.\nLater Li worked on the Linde calendar, which was introduced in\n665\nand used until\n728\n. This calendar gave better results than the calendar it replaced in predicting the positions of the planets. There were long months of\n30\ndays, short months of\n29\ndays and, in addition, intercalary months. An intercalary month was added every three years to allow for the fact that a solar year has\n365\n.\n2422\ndays while\n12\nlunar months of\n29\n.\n5306\ndays contains\n354\n.\n3672\ndays.\nThe quotation we gave above suggests that Li was given the task of correcting and annotating mathematical texts. Do we know of errors that he corrected? Yes, we do. To give an example, he corrected a mistake in\nLiu Hui\n's comment on the least common multiple of\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n,\n10\n,\n11\n,\n12\nin Problem\n11\nof Chapter\n4\nof the\nNine Chapters\non the\nMathematical Art\n, giving the correct answer\n27720\n. In all he made\n110\ncomments in the text of this work providing useful historical information as well as corrections. For example he gave\nZu Geng\n's derivation of the volume of a sphere, then improved it by using\nπ\n=\n22\n7\n\\pi = \\large\\frac{22}{7}\\normalsize\nπ\n=\n7\n2\n2\n​\ninstead of\nπ\n=\n3\n\\pi = 3\nπ\n=\n3\n. Li's comments in these texts are all clearly indicated\n(\nwhich is certainly not true for many other commentators\n)\n. He begins each comment with the words\n(\nsee for example\n[\n5\n]\n)\n:-\nYour servant, Chunfeng, and his collaborators comment respectfully on ...\nLi did make some original contributions to mathematics although he is not particularly famous in this respect. His contributions arose through his astronomical work, in particular in computing the angular speed of the sun's apparent motion. He developed a method of finite differences in his computations which he used in his work on the Linde calendar.\nWe mentioned near the beginning of this article the influence of Taoist beliefs on Li. He wrote\nCommentary on and Introduction to the Gold Lock and Flowing Pearls\n, which was a book about Taoist practices. In the area of astrology he wrote\nYisizhan\nin\n645\nwhich is a classic work of astrology which was important in the development of Chinese culture. It is generally accepted, but not absolutely certain, that Li also wrote the\nMassage-Chart Prophecies\n. This is a collection of sixty attempts to predict the future using numerology. The rather strange name came from the final poem in the book which says:-\n... thousands of years need endless telling, so we'd better stop and enjoy a conformable massage.",
  "matematicos_citados_na_biografia": [
    "Wang Xiaotong",
    "The Ten Classics",
    "Liu Hui",
    "Nine Chapters",
    "Zu Geng"
  ],
  "imagens": []
}