{
  "nome_completo": "Li Rui",
  "nome_curto": "Li Rui",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Li_Rui/",
  "data_nascimento": "8 December 1768",
  "local_nascimento": "Yuanhe (now Suzhou, Jiangsu province), China",
  "data_morte": "30 June 1817",
  "local_morte": "China",
  "summary": "Li Rui was a Chinese mathematician who produced commentaries on important Chinese mathematical works.",
  "biografia": "When\nLi Rui\nwas a young boy, about sixteen years old, he studied\nCheng Dawei\n's\nSuanfa tong zong\n(\nGeneral source of computational methods\n)\nwritten in\n1592\n. We give some information in\nCheng Dawei\n's biography about this work from which Li Rui gained his mathematical expertise. In\n1788\nhe graduated from the Yuanhe province school and went on to study mathematics at the Ziyang Academy in Suzhou.\nAt the Ziyang Academy Li Rui was taught mathematics by the director of the Academy, Qian Daxin\n(1728\n-\n1804)\n. Qian Daxin wrote a commentary on the\nSan Tong Li\nand, in\n1791\n, Li Rui wrote a postscript to this work by his teacher. It was the first of many postscripts which he would write. In\n1795\nRuan Yuan\nbecame a minister in the Education Department of Zhejiang province. He was based in Hangzhou and had an ambitious programme to compile a massive work of biography on mathematicians and astronomers. He gathered a team round him to undertake this task and two members of the team were Qian Daxin and Li Rui.\nLi Rui now undertook a number of important tasks. He wrote a commentary on the\nCe yuan hai jing\nwhich he completed in\n1797\n. The original work by\nLi Zhi\non inscribed and circumscribed circles had been written in\n1248\n. Li Rui also wrote a commentary on another of\nLi Zhi\n's works, namely\nYi gu yan duan\n(\nNew steps in computation\n)\nwhich was originally written in\n1259\n. Around the same time he studied the\nShu Shu Jiu Zhang\n(\nMathematical Treatise in Nine Sections\n)\n. This was a work by\nQin Jiushao\nwhich presents a general algorithm for the solving simultaneous congruences, that is the Chinese remainder theorem.\nFrom\n1795\nwhen he went to assist\nRuan Yuan\nin Hangzhou until the\nChouren zhuan\nor\nBiographies of astronomers and mathematicians\nwas published in\n1799\nLi Rui contributed to the work and to several other works. In addition to those listed above, he wrote the\nHu Shi Suan Shu Xi Cao\n(\nCommentary of Calculations of Arcs and Segments\n)\n, the\nZhong Ke Ce Yuan Hai Jing Xi Cao\n, and the\nRi Fa Shuo Yu Qiang Ruo Kao\n(\nStudies of Denominator of Tropical Year\n)\n.\nJiao Xun was another mathematician working with\nRuan Yuan\nin Hangzhou on the biographies compilation. After the compilation was completed Li Rui and Jiao Xun studied mathematics together around\n1800\n. Li Rui continued to contribute to commentaries produced by others, and in\n1802\nhe wrote a postscript to\nCommentary of Qi Gu Suan Jing\nby Zhang Dunren\n(1754\n-\n1834)\n. Although the name of Li Rui's wife is not known, we do know that she died in the year he wrote this postscript.\nLi Huang was one of the commentators on the\nNine Chapters\non the Mathematical Art\n. He lived in Beijing and when Li Rui went there in\n1810\nto take civil service examinations, he lived in Li Huang's home. Li Rui failed his examinations, but he made an important discovery in Li Huang's home for there he found a copy of the\nYang Hui Suan Fa\n(\n\"\nYang Hui\n's Method of Computation\"\n)\n. This was a copy of commentary of a book originally written in\n1275\nwhich had been lost. Finding the book was a great thrill to Li Rui who published it in\n1814\nwith a postscript written by himself.\nIn\n1813\nwhile working on his edition of the lost work by\nYang Hui\n, Li Rui wrote the\nKai Fang Shuo\n(\nTheory of Equations of Higher Degree\n)\n. He was a highly productive mathematician at the height of his abilities, making very useful contributions to Chinese mathematics, when sadly he died in\n1817\n.",
  "matematicos_citados_na_biografia": [
    "Cheng Dawei",
    "Ruan Yuan",
    "Li Zhi",
    "Qin Jiushao",
    "Nine Chapters",
    "Yang Hui"
  ],
  "imagens": []
}