{
  "nome_completo": "Jacob Lionel Bakst Cooper",
  "nome_curto": "Lionel Cooper",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cooper/",
  "data_nascimento": "27 December 1915",
  "local_nascimento": "Beaufort West, Cape Province, South Africa",
  "data_morte": "8 August 1979",
  "local_morte": "London, England",
  "summary": "Lionel Cooper was a South African mathematician who worked in operator theory, thermodynamics, functional analysis and differential equations.",
  "biografia": "Lionel Cooper\n's parents were Frances Bakst and Isaiah Cooper. Isaiah owned a farm at Nelspoort, a small South African community where white farmers had established their homes, about\n50\nkm from Beaufort West. For the first three years of his life Lionel lived there with his parents and his younger sister. However, after Isaiah died in\n1919\n, Lionel's mother Frances moved to Beaufort West, making a home there for Lionel and his sister. Even at this stage Lionel showed a strong desire to learn and was particularly fascinated by the stars. He spent many evenings on the roof of their house looking at the stars and learning the names of the constellations. When Lionel was seven years old the family moved again, this time moving the\n550\nkm from Beaufort West to Cape Town to live with Frances' parents\n[\n2\n]\n:-\nThe home was comfortable and cultured, his grandfather being a rabbinical scholar and his grandmother widely read.\nThe main reason that the family moved to Cape Town was to allow Lionel to have much better educational opportunities. In\n1924\n, when he was eight years old, he entered the South African College School in Cape Town. This famous school, the oldest in South Africa, was at that time situated in Orange Street occupying buildings which today are used by the University of Cape Town. In\n1931\n, when in his final year at school, Cooper took the examinations for university entrance and greatly impressed the mathematics examiner, Professor Philip Stein of the University of Natal, who said that Cooper's mathematics paper was the best he had ever seen. Cooper entered the University of Cape Town in\n1932\nwhere his academic performance was outstanding. He graduated with a degree in mathematics and physics having won numerous prizes including the Governor-General's prize for Pure Mathematics, the Darter prize for Applied Mathematics and the Bartle Frere prize for History. But Cooper did much more at university than just concentrate on his academic subjects. He was very active in the students political clubs becoming\n[\n2\n]\n:-\n... a socialist member of the Students' Parliament, with strong views against apartheid and Nazism. There were many German-Jewish refugees in Cape Town then, and through his friendship with one of them he became fluent in German.\nHe then won a Rhodes Scholarship to study at Queen's College, Oxford, England, and he began his studies there in\n1935\n. Again he won prizes and a distinction in the theory of functions\n[\n2\n]\n:-\nAt Oxford he had the great good fortune to meet Kathleen Dixon, who was reading History, and they were married in June,\n1940\n. Their marriage was a long and exceptionally happy one, and it is remarkable that all four of their children\n(\nBarbara, Frances, David and Deborah\n)\nread Mathematics at University.\nAlan Hill, the author of\n[\n3\n]\n, met Cooper while he was studying at Oxford. He writes\n[\n3\n]\n:-\n...\n[\nCooper\n]\nwas interested in everything. Every field of intellectual and cultural activity - from his own specialism, mathematics, right across to poetry, music, drama, languages, history, physical activities, and human beings - engaged his critical and discerning attention. In particular, he seemed to be very interested in politics. But I felt that this interest was really a moral concern; he was less interested in the politics of power than in seeing that people were treated with decency and justice. And his high view of how mankind should be treated was exemplified in his own life - as his many colleagues and friends who received his unfailing kindness and consideration will testify.\nA research scholarship had enabled him to work for a D.Phil. under\nTitchmarsh\n's supervision. The degree was awarded in\n1940\nfor his thesis\nTheory and applications of Fourier integrals\n. He had already published\nThe absolute Cesàro summability of Fourier integrals\n(1939)\nbefore the award of his doctorate. Cooper writes in the introduction to the paper:-\nThe theory of the absolute summability of series has been treated by various authors and the results have been applied to\nFourier series\n. Very general results have been obtained by\nBosanquet\n[\nin\n1936]\n, by whom the investigation of the analogous problem for integrals was suggested to me. In this paper results for\nFourier\nintegrals parallel to those of\nBosanquet\nfor series are obtained. They correlate the absolute summability of the\nFourier\nintegral of a function with bounded variation of the function.\nAnother paper which resulted from his research under\nTitchmarsh\nwas\nThe uniqueness of trigonometrical integrals\n(1941)\n. Cooper writes in the introduction to the paper:-\nThe many investigations which have been made up to now into the conditions under which a trigonometrical integral is unique have dealt with conditions involving convergence at individual points, or summability at individual points. In view of the importance of mean convergence in the theory of trigonometrical integrals, it is of interest to inquire what happens when the integral is only convergent in mean. This paper is devoted to the investigation of this question.\nFrom\n1940\nto\n1944\nhe worked with the Bristol Aeroplane Company having failed the medical to serve in the armed forces due to his poor eyesight. After lecturing in London\n(\nboth at Birkbeck College and Imperial College\n)\nhe was appointed professor of mathematics in Cardiff in\n1951\n. He quickly set about the\n[\n2\n]\n:-\n... considerable task of reorganising and reorienting the Department. The existing courses in Pure Mathematics there were of a classical nature, and it was entirely due to his efforts that they were improved and modernised, the end product being an attractive blend of forward-looking courses with functional analytic methods given some prominence. He brought research more to the forefront by giving advanced courses and seminars and before long the climate in the Department was transformed.\nHe spent\n1954\nback in the country of his birth, South Africa, at the University of the Witwatersrand which was undergoing a period of considerable growth. He was Visiting Professor and Acting Head of Department there, having exchanged positions with Philip Stein. Returning to Cardiff, he became very engaged in University affairs, being Dean of the Faculty of Science during\n1956\n-\n58\nand also taking on other roles on Council and Court. In\n1960\na Commission was set up to recommend how the University of Wales should develop in the light of rapidly increasing student numbers. Cooper became a prominent member of the Commission but it failed to reach a unanimous conclusion, producing two conflicting reports in\n1964\n. One argued that four unitary universities should be set up to replace the federal university while the second argued for the\nstatus quo\nwith improvements in organisation. The second was accepted. All this work meant that Cooper's time for research was severely limited but he made an effort to increase his output by making a number of research visits, most significantly to the research centre in Oberwolfach, Germany, and spending the year\n1964\n-\n65\nin Pasadena as Visiting Professor at the California Institute of Technology.\nCooper was offered a professorship at the University of Toronto in\n1965\n. He was quickly involved in the Canadian mathematical scene and was editor of the\nCanadian Journal of Mathematics\nfrom\n1965\nto\n1967\n. Although he was very happy in Toronto, when he was offered the chair of Pure Mathematics and Head of the Department of Mathematics at Chelsea College, London, he found the attraction of London too much to resist. The South-Western Polytechnic had been founded in\n1895\n, became the Chelsea Polytechnic in\n1922\n, and the School of Science separated and became known as the Chelsea College of Science and Technology in\n1957\n. This had become a College of the University of London in\n1966\n, just before Cooper was appointed as head of mathematics there. He then played a major role in the British mathematical scene serving on the Mathematics Panel of the University Grants Committee in\n1971\n-\n75\nand other committees, as well as organising a major conference on\ndifferential equations\nat Chelsea College.\nHis research was on a wide range of different but related topics: operator theory, transform theory, thermodynamics,\nfunctional analysis\nand differential equations. He applied the tools he had developed to the study of different applications. For example his paper\nThe propagation of elastic waves in a rod\n(1947)\nis reviewed by\nG F Carrier\nwho writes:-\nTwo-dimensional waves in an elastic plate are considered. ... Using the exact equations of elasticity, and a\nFourier\ntransform integrating technique, conclusions are obtained as to\n(1)\nthe velocities of propagation which can be obtained and in particular their upper bounds;\n(2)\nthe dispersive nature of the waves, both longitudinal and transverse;\n(3)\nthe velocity at which elastic energy can be expected to be transported.\nOther papers in which deal with applications include\nThe uniqueness of the solution of the equation of heat conduction\n(1950)\n. Cooper's work in operator theory was in the area of linear operators on real or complex\nHilbert spaces\n, for example he published\nSymmetric operators in Hilbert space\n(1948)\n. He studied the unbounded operators which arose from quantum theory publishing\nThe characterization of quantum-mechanical operators\n(1950)\n. He corresponded with\nEinstein\non logical inconsistency in quantum theory in\n1949\nand this led to his paper\nThe paradox of separated systems in quantum theory\n(1950)\nin which he discussed the paradox put forward by\nEinstein\n, Podolsky and Rosen in\n1935\n.\nIn the area of transform theory, Cooper worked on the representation and uniqueness of\nintegral transforms\n, on approximation, and on linear transformations which satisfy functional relations arising from\nrepresentations\nof\nlinear groups\n. His final paper was\nApproximation by products to functions with group symmetry\n(1980)\n, published after his death. In the introduction he writes:-\nOur subject is a class of problems concerning the closeness with which functions of several variables invariant in some specified group of transformations can be approximated in mean square by functions which are products of functions of the individual variables. These problems originate in questions in the\nquantum mechanics\nof many particle systems posed to me by Professor Heinz Post; my thanks are due to him for drawing my attention to the problem and to discussions of the physics involved.\nHis lecturing is described in\n[\n2\n]\nas follows:-\nAs a lecturer he could be hard to follow: sometimes the sequence of ideas came too quickly for the comfort of those in the audience with less agile minds: sometimes he overestimated the background knowledge of his audience. However, many of his lectures were enormously stimulating and were full of unexpected insights into the topics being studied.\nAs to his character, the quote above from Alan Hill's tribute\n[\n3\n]\ntells us much. Here is another quote from\n[\n3\n]\n:-\nLionel was a man of great intellectual power and integrity, and when required he could be forcible - even fierce - in his attitude. But his friends knew that beneath this exterior breathed one of the warmest-hearted of men. In fact, the longer one knew Lionel, the more one realised that his true gentleness was one of his most outstanding and endearing qualities.\nDavid Edmunds writes\n[\n2\n]\n:-\nWhen younger he was a keen squash player, and after giving this up he continued to swim, to play tennis with great determination and to walk, especially in the Lake District which he loved and knew so well. In public he appeared reserved or even shy, and there was certainly nothing at all ostentatious in his make-up; underneath the reserve, however, there was a quiet self-confidence which enabled him to assess problems dispassionately and on their merits. It took time to know him, but those who became close to him found him absolutely reliable, a tower of strength in difficult times and always a marvellous companion. He was an excellent after-dinner speaker, with a real flair for story-telling; this never failed to surprise those who had seen him on less festive occasions.\nPaul Butzer\nwrites in\n[\n1\n]\n:-\nCooper had a sharp intellect, always interested in the basic assumptions of the problems studied. He was a scholar in the old sense of the word, widely read, having brilliant ideas, an inspiration to those who knew him. He did not seek the limelight, and was somewhat reserved in public. He worked in a quiet way but still with great influence. He radiated authority in every situation of life, an authority based on deep respect and justice. He had a healthy self-confidence which allowed him to be composed; there was no rushing about him.\nCooper had been a fit man so he became alarmed when he found himself struggling for breath while walking in the Lake District. After a series of medical tests, doctors discovered that he had a heart defect and said that surgery was the only way to solve the problem. Cooper waited until he had marked and assessed all his examination papers before entering hospital for the operation. Although a major operation, he was not thought to be in danger and expected to make a full recovery. However he suffered a massive haemorrhage soon after the operation and never regained consciousness but died some days later.",
  "matematicos_citados_na_biografia": [
    "Titchmarsh",
    "Fourier series",
    "Bosanquet",
    "Fourier",
    "differential equations",
    "functional analysis",
    "G F Carrier",
    "Hilbert spaces",
    "Einstein",
    "integral transforms",
    "representations",
    "linear groups",
    "quantum mechanics",
    "Paul Butzer"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}