{
  "nome_completo": "Lipót Fejér",
  "nome_curto": "Lipót Fejér",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fejer/",
  "data_nascimento": "9 February 1880",
  "local_nascimento": "Pécs, Hungary",
  "data_morte": "15 October 1959",
  "local_morte": "Budapest, Hungary",
  "summary": "Fejér 's main work was in harmonic analysis working on Fourier series and their singularities. Fejér collaborated to produce important papers with Carathéodory on entire functions and with Riesz on conformal mappings.",
  "biografia": "Lipót Fejér\n's mother was Viktória Goldberger and his father was Samu\n(\nor Samuel\n)\nWeiss; the family was Jewish. The reader will have noticed that Fejér's father had the name Weiss and, indeed, Lipót Fejér was given the name Leopold Weiss when he was born. He changed his name around\n1900\nto make himself more Hungarian. This was standard practice carried out at that time to show solidarity with Hungarian culture. Weiss in German means \"white\" while the Hungarian for white is \"feher\" but he chose the name \"Fejér\" which is an archaic spelling for the Hungarian for \"White\". Let us say a little more about his family. Viktória Goldberger's maternal grandfather Sámuel Nachod was a doctor from Pécs, awarded his medical degree in\n1809\n, while her father, József Goldberger, was an eminent man known as the author of a Hebrew-Hungarian dictionary. Samu Weiss, Lipót's father, was a shopkeeper in Pécs.\nLipót's schooling was in Pécs but at first things did not go well and his father took him out of school for a while and acted as his teacher. However, his attitude to mathematics changed dramatically when he was taught the topic by his high school teacher Sigismund Maksay. The\nEötvös\nMathematics Competition began in\n1894\nwith problems appearing in\nKözépiskolai Matematikai Lapok\n, the Mathematical and Physical Journal for Secondary Schools. Encouraged by Maksay, Fejér began submitting his solutions to the problems to Budapest\n[\n6\n]\n:-\nLaszló Racz, a secondary school teacher who led a problem study group in Budapest, often opened his session by saying, \"Lipót Weiss has again sent in a beautiful solution.\"\nIn\n1897\n, the year that he graduated from the high school in Pécs, Fejér won second prize in the\nEötvös\nMathematics Competition. In that year Fejér entered the Polytechnic University of Budapest where he studied mathematics and physics until\n1902\n, except for the year\n1899\n-\n1900\nwhich he spent at the University of Berlin. In Budapest he was taught by, among others,\nJulius König\n,\nJózsef Kürschák\n, Manó Beke and\nLoránd Eötvös\n. Despite the strong influence of these outstanding scientists, it was the year he spent in Berlin which led to the results which proved his most significant and influenced his whole career. In Berlin he attended courses by\nGeorg Frobenius\nand\nLazarus Fuchs\nbut it was his discussions with\nHermann Schwarz\nthat led him look at the convergence of\nFourier\nseries and prove the highly significant \"Fejér's theorem\" published in\nSur les fonctions bornées et intégrables\nⓉ\n(\nOn bounded  and integrable functions\n)\n. In this paper, submitted to the\nParis Academy of Sciences\non\n10\nDecember\n1900\n, he proved:-\nThe\nFourier\nseries is summable\n(\nC,\n1)\nto the value of the function at each point of continuity.\nFejér's theorem is a simple, beautiful theorem, and, in the opinion of\nJean-Pierre Kahane\n[\n8\n]\n, its discovery restored to\nFourier\nseries a fundamental role in analysis for at least fifty years. Also, at that time the theory of functions of one real variable had produced a number of strange anomalies\n(\nlike continuous, nowhere differentiable functions\n)\n, and Fejér's theorem, by its simplicity, reassured mathematicians who were disturbed by these pathological results. While attending\nSchwarz\n's twice-monthly colloquium, in which he was lecturing on his collected works, Fejér met\nConstantin Carathéodory\n,\nErhard Schmidt\nand\nIssai Schur\nwho were doctoral students, and\nEdmund Landau\nwho was a\nprivatdozent\n. He formed lasting friendships with these mathematicians whom he collaborated with throughout the rest of his life. From\nSchwarz\n, in addition to specific ideas for his research, Fejér inherited a geometrical approach to mathematics and a love of extremal problems. We note that it was while he was in Berlin that he changed his name from Weiss to Fejér and, after he did so,\nSchwarz\njokingly refused to talk to him! Fejér's fundamental summation theorem for\nFourier series\nformed the basis of his doctoral thesis which he presented to the University of Budapest in\n1902\n. This doctoral thesis contained important corollaries of \"Fejér's theorem\" which also appear in the paper\nUntersuchungen über Fouriersche Reihen\nⓉ\n(\nStudies of Fourier series\n)\n(1904)\n:\n1\n.  If the\nFourier\nseries of a function converges at a point of continuity of the function, its sum is the value of the function at that point;\n2\n.\nWeierstrass\n's approximation theorem: A function continuous in a closed interval is a uniform limit of polynomials;\n3\n.\nPoisson\n's integral provides a valid solution for\nDirichlet\n's problem for the circle.\nFejér spent the winter of\n1902\n-\n3\non a visit to Göttingen, attending lectures by\nDavid Hilbert\nand\nHermann Minkowski\n, and the summer of\n1903\nin Paris where he attended lectures by\nÉmile Picard\nand\nJacques Hadamard\n. After this year he returned to Hungary and, from\n1903\nto\n1905\n, he taught at the University of Budapest. Although Fejér had gained an international reputation because of his outstanding papers, he did not have a permanent position in Hungary and was relatively unknown there. This is nicely illustrated by the following story. In\n1905\nHenri Poincaré\nwas awarded the first\nBolyai\nprize and arrived in Budapest to receive the award. He was met at the railway station by many high ranking officials and he immediately asked \"Where is Fejér?\" The Hungarian officials had never heard of Fejér so they asked\nPoincaré\n, \"Who is Fejér?\"\nPoincaré\nreplied, \"Fejér is the greatest Hungarian mathematician, one of the world's greatest mathematicians.\" Soon after this Fejér was offered the chair of mathematics at Kolozsvár in Hungary\n(\nnow Cluj in Romania\n)\nFrom\n1905\nuntil\n1911\nhe taught at Kolozsvár during which time he produced many high quality beautifully written papers: six in\n1906\n, three in\n1907\n, five in\n1908\n, four in\n1909\nand six in\n1910\n. In\n1911\nFejér was appointed to the chair of mathematics at the University of Budapest and he held that post until his death. However there were problems regarding his appointment to the chair as is recounted in\n[\n21\n]\n:-\nAlthough already world famous and warmly endorsed by\nPoincaré\non the occasion of the awarding of the\nBolyai\nPrize, Fejér's appointment to a chair at the University had been opposed by anti-semites on the Faculty. One of them, knowing full well that Fejér's original name had been Weiss, asked during the occasion of Fejér's candidacy: 'Is this Leopold Fejér related to our distinguished colleague on the Faculty of Theology, Father Ignatius Fejér?' Without missing a beat\nLoránd Eötvös\n, Professor of Physics, answered \"Illegitimate son\". After that the appointment sailed through smoothly.\nDespite these difficulties, Fejér was honoured with election to the\nHungarian Academy of Sciences\nin\n1911\nand being a vice-president of the International Congress of Mathematicians held in Cambridge, England, in August\n1912\n. During his period in the chair at Budapest, Fejér led a highly successful Hungarian school of analysis. He published important works such as\nÜber die Konvergenz der Potenzreihe an der Konvergenzgrenze in Fallen der konformen Abbildung auf die schlichte Ebene\nⓉ\n(\nOn the convergence of the power series at the limit of convergence in cases of conformal mapping on the simple level\n)\n(1914)\n,\nÜber Interpolation\nⓉ\n(\nOn interpolation\n)\n(1916)\n, and\nInterpolation und konforme Abbildung\nⓉ\n(\nInterpolation and conformal mapping\n)\n,\n(1918)\n. However, he was greatly affected by World War I, and the political events which followed, as\nPaul Turan\nrecounts\n[\n24\n]\n:-\nNaturally, World War I had an impact on him, to which a serious illness added in\n1916\n. The effect of counterrevolutionary times was shown by a three-year gap in the list of his papers. He never did overcome the effect of those times\n[\nthe white terror under Miklós Horthy in the early\n1920\ns\n]\n, as could be perceived again and again from his hints.\nFejér's main work was in harmonic analysis. He worked on power series and on\npotential theory\n. Much of his work is on\nFourier\nseries and their singularities but he also contributed to approximation theory. He collaborated to produce important papers, one with\nCarathéodory\non entire functions in\n1907\nand another major work with\nRiesz\nin\n1922\non\nconformal mapping\n. However, as a Jew he suffered after the Nazis came to power. He had a prostate operation in the early\n1940\ns after which he did little research and, as a Jew, was forced to retire in\n1944\n. However, after this his situation quickly became totally unbearable\n[\n6\n]\n:-\nLate one December night, the residents in his house on Tatra Street were lined up by Arrow Cross \"lads,\" to be marched to the bank of the Danube. They were saved by the phone call of a brave officer. Other Budapest Jews did meet death from a gunshot there by the riverbank. After the liberation, Fejér was found in an emergency hospital on Tatra Street \"under hardly describable circumstances.\"\nAlthough Fejér survived this horrific episode, his mental capacities rapidly deteriorated. He was fully aware that he was loosing the place and would make comments such as \"Since I became a complete idiot.\"\nPaul Erdős\nsaid\n(\nsee\n[\n6\n]\n)\n:-\nHe was happy when he didn't think about it. He continued to recognize my mother and me. In the hospital he was well cared for, till he died of a stroke in\n1959\n.\nOne of Fejér's students, Agnes Berger, described his lecturing style in the following way\n(\nsee\n[\n21\n]\n)\n:-\nFejér gave very short, very beautiful lectures. They lasted less than an hour. You sat there for a long time before he came. When he came in, he would be in a sort of frenzy. He was very ugly-looking when you first examined him, but he had a very lively face with a lot of expression. The lecture was thought out in very great detail, with dramatic denouement. He seemed to relive the birth of the theorem; we were present at the creation. He made his famous contemporaries equally vivid; they rose from the pages of the textbooks. That made mathematics appear as a social as well as an intellectual activity.\nFinally let us quote\nGeorge Pólya\n[\n16\n]\nabout Fejér's personality:-\nHe had artistic tastes. He deeply loved music and was a good pianist. He liked a well-turned phrase. \"As to earning a living,\" he said, \"a professor's salary is a necessary, but not a sufficient, condition.\" Once he was very angry with a colleague who happened to be a topologist\n[\nBéla Kerékjártó\n]\n, and explaining the case at length he wound up by declaring: \"... and what he is saying is a topological mapping of the truth.\" He had a quick eye for human foibles and miseries; in seemingly dull situations he noticed points that were unexpectedly funny or unexpectedly pathetic. He carefully cultivated his talent of raconteur; when he told, with his characteristic little gestures, of the little shortcomings of a certain great mathematician, he was irresistible. The hours spent in continental coffee houses with Fejér discussing mathematics and telling stories are a cherished recollection for many of us. Fejér presented his mathematical remarks with the same verve as his stories, and this may have helped him in winning the lasting interest of so many younger men in his problems.\nPólya\nwrites in\n[\n17\n]\n:-\nWas Fejér eccentric? If you could see him in his rather Bohemian attire\n(\nwhich was, I suspect, carefully chosen\n)\nyou would find him very eccentric. Yet he would not appear so in his natural habitat, in a certain section of Budapest middle-class society, many members of which had the same manners, if not quite the same mannerisms, as Fejér - there he would appear about half eccentric.\nWe have already mentioned some of the honours given to Fejér but, in addition, he received the Kossuth Prize, first grade\n(1948)\n, the People's Order of Merit\n(1950)\n, and the Labour Red Flag of Merit\n(1953)\n. He was elected to the\nGöttingen Academy of Sciences\n(1925)\n, the Bavarian Academy of Sciences\n(1954)\n, and the\nPolish Academy of Sciences\n(1957)\n. He was elected an honorary member of the Calcutta Mathematical Society\n(1930)\n, and awarded an honorary doctorate by Brown University in Providence, USA\n(1933)\nand by\nEötvös Loránd\nUniversity of Budapest\n(1950)\n. He also served as an editor of the\nRendiconti del Circolo Matematico di Palermo\nand of the\nMathematische Zeitschrift\n.\nWe end with this fine tribute by\nGeorge Pólya\n[\n16\n]\n:-\nWhy did Hungary produce so many mathematicians of our time? Many people have asked this question which, I think, nobody can fully answer. There were, however, two factors whose influence on Hungarian mathematics is manifest and undeniable, and one of these was Leopold Fejér, his work, his personality. The other factor was the combination of a competitive examination in mathematics with a periodical.",
  "matematicos_citados_na_biografia": [
    "Eötvös",
    "Julius König",
    "József Kürschák",
    "Loránd Eötvös",
    "Georg Frobenius",
    "Lazarus Fuchs",
    "Hermann Schwarz",
    "Fourier",
    "Paris Academy of Sciences",
    "Jean-Pierre Kahane",
    "Schwarz",
    "Constantin Carathéodory",
    "Erhard Schmidt",
    "Issai Schur",
    "Edmund Landau",
    "privatdozent",
    "Fourier series",
    "Weierstrass",
    "Poisson",
    "Dirichlet",
    "David Hilbert",
    "Hermann Minkowski",
    "Émile Picard",
    "Jacques Hadamard",
    "Henri Poincaré",
    "Bolyai",
    "Poincaré",
    "Hungarian Academy of Sciences",
    "Paul Turan",
    "potential theory",
    "Carathéodory",
    "Riesz",
    "conformal mapping",
    "Paul Erdős",
    "George Pólya",
    "Béla Kerékjártó",
    "Pólya",
    "Göttingen Academy of Sciences",
    "Polish Academy of Sciences",
    "Eötvös Loránd"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}