{
  "nome_completo": "Liu Hong",
  "nome_curto": "Liu Hong",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Liu_Hong/",
  "data_nascimento": "129",
  "local_nascimento": "Lo-yang,(now Luoyang), China",
  "data_morte": "210",
  "local_morte": "China",
  "summary": "Liu Hong was a Chinese astronomer who was involved in calendar reform.",
  "biografia": "Liu Hong\nwas of noble birth, descended from the Imperial family of the Eastern Han Dynasty. This dynasty was established in\n25\nAD after the brief\n15\nyear reign of Wang Mang's Hsin dynasty. The capital was Lo-yang where a large ornate palace was built. In Encyclopaedia Britannica the aims and achievements of the Han rulers are described:-\n... the Han came to require cultural accomplishment from their public servants, making mastery of classical texts a condition of employment. The title list of the enormous imperial library is China's first bibliography. Its text included works on practical matters such as mathematics and medicine, as well as treatises on philosophy and religion and the arts. Advancement in science and technology was also sought by the rulers, and the Han invented paper, used water clocks and sundials, and developed a seismograph. Calendars were published frequently during the period.\nLiu Hong became interested in astronomy as a young boy. He was appointed to the Imperial Observatory in\n160\nand was involved in making astronomical observations. Two works which he wrote, namely the\nQi Yao Shu\n(\nThe Art of Seven Planets\n)\nand a new version entitled the\nBa Yuan Shu\n(\nThe Art of Eight Elements\n)\nhave been lost so we know little of their contents. We do know that Liu presented these works to the Emperor in\n174\nor\n175\n, and we also know that they were based on Buddhist beliefs.\nPerhaps the greatest of Liu's achievements was his work which led to a new calendar. This calendar was published in\n187\nand described the motion of the moon far more accurately than any previous Chinese calendar. His measurements of the length of the shadow of a pole at the summer and at the winter solstices give results which are accurate to within\n1\n% of their true value.",
  "matematicos_citados_na_biografia": [],
  "imagens": []
}