{
  "nome_completo": "William Lloyd Garrison Williams",
  "nome_curto": "Lloyd Williams",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Williams/",
  "data_nascimento": "3 October 1888",
  "local_nascimento": "Friendship, near Labette, Kansas, USA",
  "data_morte": "31 January 1976",
  "local_morte": "Pennsylvania, USA",
  "summary": "Lloyd Williams was an American mathematician most important for his role in founding the Canadian Mathematical Society.",
  "biografia": "Lloyd Williams\n's father was Nathan Williams and his mother was Amanda Dunreath Truex; they were Quakers. Nathan and Amanda married in\n1887\nand Lloyd was born in the following year. Nathan had been married before and had a number of children with his first wife. However, Lloyd was the only child of his marriage to Amanda. She was\n44\nyears old he was born and, sadly, she died when he was only five years old. We should comment at this point on Lloyd's full name. He was named after William Lloyd Garrison who helped lead the successful Abolitionist campaign against slavery in the United States.\nAfter the death of his mother, the Tomlinsons, who were the parents of Nathan Williams' first wife, took Lloyd to their farm in Indiana where the brought him up. After attending elementary school, where his teachers failed to spot his talents and he does not appear to have impressed, he entered the local Quaker Academy where his teachers did recognise his abilities and encouraged him. It was through the efforts of his teachers that he was able to major in Classics at Haverford College. It may come as a surprise that someone who would distinguish themselves in mathematics was at this stage concentrating on classics. However, he did take some mathematics courses and when he was awarded a Rhodes Scholarship to study at the University of Oxford he decided that he would take a mathematics degree. The tutorial system at Oxford suited Williams. He later compared his Oxford education with the education in American universities at the time:-\nIt is my considered opinion that the system practised in the universities of North America of trying to educate young men and young women by herding them together in rooms and lecturing to them is a failure. If you will throw the good and the ambitious student on his own, help him but not spoon-feed him, he can accomplish twice as much and do it twice as well as he can under the conditions that largely obtain in our universities.\nWilliams undertook research in mathematics at the University of Chicago attending each summer. It was during one summer in Chicago that he met Anne Christine Sykes, who was an excellent pianist. Her mother was a painter while her father was a mathematician who had graduated from Harvard and taught mathematics and Greek at a private boys school. Anne and Lloyd later married. At Chicago, Williams thesis supervisor was\nL E Dickson\nand he suggested the topic for his student. However it appears that he gave little further advice until he suggested in\n1920\nthat Williams should submit. He was awarded his doctorate from Chicago in\n1920\nfor his thesis\nFundamental Systems of Formal Modular Seminvariants of the Binary Cubic\n.\nThere are two things for which Williams is particularly remembered. The first of these came early in his career when he was teaching at Cornell University, which he did until\n1924\n. In\n1922\nthe African American\nElbert Frank Cox\nentered Cornell to study for his doctorate under Williams' supervision. Williams had strong beliefs regarding equality, being passionate in his hatred of racial discrimination. It is perhaps hard today to understand just how ground breaking a move it was by Williams to supervise the doctorate of an African American student. No African American student had ever been awarded a mathematics doctorate. It was also a time of high racial tension in the United States, for example it was the era of considerable activity by the Ku Klux Klan with\n31\nAfrican-Americans being murdered by lynching in\n1926\n.\nIn\n1924\nWilliams moved from Cornell to accept a position within the Mathematics Department of McGill University in Montreal, Canada.\nCox\nhad still not competed his doctorate at this stage and with help from Williams he was awarded a Erastus Brooks Fellowship so that he could study at McGill University with his supervisor. In\n1925\nCox\nwas awarded his doctorate by Cornell University for his thesis\nPolynomial solutions of difference equations\n. Williams felt that since\nCox\nwas the first person of his race in the world to be awarded a doctorate in mathematics it was necessary for him to have the recognition by a university outside the United States. Universities in England and Germany refused to consider his doctoral thesis but the Imperial University in Sandai, Japan, accepted it.\nIt was at McGill that Williams spent the rest of his working life, teaching there until\n1954\n. In\n[\n2\n]\nBott\ndescribes Williams who in fact played a major role in convincing\nBott\nto become a mathematician:-\nMy first teacher in the calculus was Professor Williams. He was beautiful! Some professors taught in gowns, English style, and he was one of these. His gown was unbelievably old, chalk crusted and slightly torn. With his hair flying and his gown flapping, Prof Williams' lectures were not a model of clarity, but I found shining through them his love of the subject and also his general benevolent view of life and mankind.\nAlthough extremely kind, Williams had high standards as a teacher.\nBott\nwrites\n[\n2\n]\n:-\nKind though he was, he also had high standards, and he failed\n75\npercent of the calculus class one year!\nWe mentioned above that Williams is particularly remembered for two things. We have discussed one of these, the fact that he supervised the first African American to be awarded a Ph.D. in mathematics. The second thing for which he is particularly remembered is his efforts to found the\nCanadian Mathematical Society\n. We should remark that this was named the Canadian Mathematical Congress from the time it was founded in\n1945\nuntil\n1976\nwhen it adopted its present name. Williams favoured the term \"Congress\" which he gave French and English speaking Canadians equal status. Williams worked hard from\n1943\nto provide a forum around which Canadian mathematical life could be centred. He was elected as the Treasurer of the Society when it was founded in June\n1945\nand remained in this position until\n1965\n. His success in this role it illustrated by comment by Professor Magee :-\nAt the University of Western Ontario, members of the Department of Mathematics were greatly impressed by the zeal and enthusiasm displayed by Prof Williams in his role as an administrator in the affairs of the Canadian Mathematical Congress. He established firm and lasting friendships with leading industrialists. It was an education to see how easily a genuine rapport with industry was made and to marvel at the effective measures employed to gain financial support for the Congress.\nWilliams was much honoured for his contributions to the mathematical life of Canada. For example he was awarded honorary degrees by the University of Montreal, the University of Manitoba, Dalhousie University, and Mount Allison University. His concern for mankind is clearly evident from the descriptions we have given above, but we should illustrate it further with examples from outside the world of mathematics. Not only did he work to found the\nCanadian Mathematical Society\nbut he also, around the same time, worked to found a Canadian Save the Children Fund. When he retired from McGill in\n1954\n, Williams joined the Board of the Canadian Friends Service Committee and was Chairman of the Committee from\n1959\nuntil\n1963\n.\nRobinson\nwrites\n[\n3\n]\n:-\nLloyd died on\n31\nJanuary\n1976\n. He and his charming wife Anne had done to live with their daughter Christine Ayoub, a mathematician on the staff of Pennsylvania State University. His death was very sudden, for I had seen Christine at an\nAmerican Mathematical Society\nmeeting in Texas just a week before and there was no serious problems as yet.\nRobinson\nalso writes in\n[\n3\n]\n:-\nNot many of us can look back on so many contributions to the academic and social life of our world.",
  "matematicos_citados_na_biografia": [
    "L E Dickson",
    "Elbert Frank Cox",
    "Cox",
    "Bott",
    "Canadian Mathematical Society",
    "Robinson",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}