{
  "nome_completo": "Lorna Mary Swain",
  "nome_curto": "Lorna Swain",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Swain/",
  "data_nascimento": "22 March 1891",
  "local_nascimento": "Hampstead, London, England",
  "data_morte": "8 May 1936",
  "local_morte": "Cambridge, England",
  "summary": "Lorna Mary Swain was a British mathematician who was one of few early female lecturers at the University of Cambridge.",
  "biografia": "Lorna Swain\n's father was Edward Swain\n(\nborn Ropsley, Lincolnshire about\n1853)\nwho was a solicitor. Her mother was Mary Isabella Victoria Swain\n(\nborn at St Paul's, London about\n1865)\n.\nLorna Swain was educated at South Hampstead High School in London. From there she won a scholarship to study at Newnham College, Cambridge and she began her studies in\n1910\n. In\n1913\nshe graduated with a First Class honours degree in mathematics and was appointed to an assistant lecturer post at Newnham College with the start of the appointment delayed for a year to allow her to spend a year in Göttingen.\nHowever\n1914\nwas not the best of year to begin research in Germany. Shortly after she arrived there war broke out and she hurriedly returned to England. Her mathematical books and papers fared less well and remained interned for several years before eventually being returned.\nSwain's mathematical interests were in fluid dynamics so, as Göttingen was out of the question, she went to Manchester to work with\nHorace Lamb\n. While in Manchester she published her first paper, a joint paper with\nLamb\n. As planned, she returned to Newnham College in\n1915\nto take up her lecturing post. However World War I again affected her career since she now undertook war work at the Royal Aircraft Establishment.\nThe war work she undertook was related to her expertise in fluids, and she worked on problem of vibration of propellers of aircraft. Her work was written up jointly with H A Webb and appeared as a Report of the Advisory Committee for Aeronautics in\n1919\n.\nIn\n1920\nSwain was appointed Director of Studies at Newnham College. With heavy teaching and administrative responsibilities she had less time to undertake research but she did publish an important work on motion through a viscous fluid in\n1923\nin the Proceedings of the\nRoyal Society\n.\nKennedy describes her commitment to teaching and education in\n[\n1\n]\nas follows:-\nIt was one of her guiding principles to do everything she could to encourage the study of mathematics not only in her own College but generally among women. For this reason she was an active member of the\nMathematical Association\nand served on their committee to investigate the teaching of applied mathematics. ... She felt that school work could foster or spoil a gift for mathematics and that it was of the first importance that girls should have good teaching. Her own work, she thought, could contribute to the supply of teachers... all her students know how carefully she arranged the work for each individual, giving extra help herself when she thought it necessary.\nIn\n1926\nLorna Swain was promoted to College Lecturer and she then had the opportunity to give advanced courses on hydromechanics and dynamics. A years study leave in\n1928\n-\n29\nallowed her to spend the year at Göttingen that the war had robbed her of earlier. This was a time when she was able to undertake concentrated research and another important work On the turbulent wake behind a body of revolution was published in\n1929\n.\nLorna Swain is described in\n[\n1\n]\nas:-\n... unassuming, reserved in manner, often silent, a singularly faithful friend. Her former pupils were sure of her interest and encouragement in their careers, of a warm and sincere welcome when they visited her, of prompt and valuable advice when they consulted her.\nHer death at a young age took away someone at the height of their teaching and research powers:-\nHer wisdom and influence were increasing, her powers of mind were still expanding, when she was overtaken by illness and death. It would be idle to guess what more she might have done if she had lived; it is certain she contributed worthily to mathematical education and to mathematical thought.",
  "matematicos_citados_na_biografia": [
    "Horace Lamb",
    "Lamb",
    "Royal Society",
    "Mathematical Association"
  ],
  "imagens": []
}