{
  "nome_completo": "Louis Auguste Antoine",
  "nome_curto": "Louis Antoine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Antoine/",
  "data_nascimento": "23 November 1888",
  "local_nascimento": "Mirecourt, Vosges, France",
  "data_morte": "8 February 1971",
  "local_morte": "Rennes, Bretagne, France",
  "summary": "Louis Antoine was a French mathematician famous for his invention of Antoine's necklace .",
  "biografia": "Louis Antoine\nwas born in Mirecourt, a small town just over\n40\nkm south of Nancy. He attended the lycée in Nancy and, after his father had been appointed director of Compagnie Générale des Allumettes Chimique, a firm which manufactured matches in Saintines, Oise, he studied at the Collège de Compiègne. Saintines, about\n12\nkm south of Compiègne, was famous for the manufacture of matches, which had been made there since\n1853\n. The Collège de Compiègne was an ancient institution founded in\n1571\n, which had served as a Jesuit college\n1653\n-\n1762\nand then as a Benedictine college\n1772\n-\n1790\n. Louis was a successful pupil at school, excelling in mathematics and science. At the Collège de Compiègne he was introduced to rugby by one of the professors and it was to remain a passion throughout his life.\nIn Paris, Antoine was awarded a baccalaureate in Latin and Sciences in\n1905\nand, in the following year, a baccalaureate in mathematics. Having sat the entrance examinations, he was offered a place at both the École Normale Supérieure and at the École Polytechnique in\n1908\n. He chose the former since it was the stronger of the two establishments for mathematics and graduated in\n1912\n.\nGaston Julia\n, who was four years younger than Antoine, entered the École Normale Supérieure in\n1911\nand, despite the fact that they did not overlap at the École for very long, Antoine and\nJulia\nbecame firm friends. Following his graduation, Antoine became a mathematics teacher at the Lycée de Dijon in Saint-Cyr. He met two sisters, Marguerite and Yvonne Rouselle, daughters of a notary clerk and both school teachers at Mouy, Oise\n[\n15\n]\n:-\nMarguerite fell under the charm of the very beautiful blue eyes of Louis. The feelings were reciprocated and the two were engaged to be married.\nThe future for Antoine as a school teacher who would soon be married to his sweetheart seemed secure when political events in Europe turned their world upside-down. Matters came to a head in July\n1914\nwith various declarations of war, and on\n3\nAugust Germany declared war on France. Events had been moving quickly and Antoine, who was a reserve lieutenant in the\n72\nnd\nInfantry Regiment of Amiens, was mobilised on\n2\nAugust as France geared up for war. He became the commander of the second machine gun section of the\n151\nst\nInfantry Regiment. Germany invaded Belgium on the night of\n3\n-\n4\nAugust, the event which brought Great Britain into World War I. Antoine and his section were sent to Belgium to meet the German advance. Fierce fighting took place near the village of Ramscapell after the German advance was halted by the river Yser. In a trench near Ramscapell, Antoine was wounded by shrapnel on\n25\nAugust but was able to continue fighting. He was wounded again on\n30\nOctober, again being hit by shrapnel. For his courageous actions he was decorated several times, made a captain at the age of\n29\nand, on\n28\nNovember\n1916\n, he was made a knight of the Légion d'Honneur and was decorated with the Croix de Guerre with palm. He was given short periods of leave on a few occasions and he was able to meet up with his family and with his fiancée Marguerite.\nIn the spring of\n1917\nthe Allies, following a plan made by Robert Nivelle, the commander of the French forces, were attempting to force the German troops back from the line, along the Chemin des Dames, they held between Arras and Reims. However, the Germans countered the attacking forces with an intense barrage of artillery fire from positions which were well protected with deep trenches and underground quarries. On\n16\nApril\n1917\n, Antoine led his men to attack Fort Brimont on the banks of the river Miette.\nGaston Julia\nrelates the events that followed\n(\n[\n13\n]\nor\n[\n14\n]\n)\n:-\nThe attack progresses to a railway embankment, behind which troops are hiding waiting for the attack. Antoine is observing the German trenches through binoculars when a bullet removes both his eyes. He is blind, but does not know it yet. At the hospital, he is told he has lost one eye but they hope to save the other. He is evacuated to Paris to the hospital annex Val-de-Grâce, where the wounded from the front are treated. This is where I found him one morning when I was asked to go to the bandaging room at\n8\n:\n00\nbecause one of my classmates from the École Normale arrived in the night and had asked to see me. I ran to the bandaging room and Antoine said simply to me: \"Look at me straight in the face and tell me just how my eyes are: I want the whole truth.\" It is a poignant moment: there is nothing in his empty eye sockets. I told him so, sadly. He took my hand and thanked me affectionately for having \"treated him like a man.\"\nNot only had Antoine lost the sight of both eyes, he had also lost any sense of smell as the bullet had also destroyed his nose. Julia had also been seriously wounded in the fighting of World War I and he spent much time in hospital having operations on his face.\nJulia\nand Antoine met frequently in the Val-de-Grâce hospital, even sharing a room for a while.\nHenri Lebesgue\nwas a friend of\nJulia\n's and he often visited the hospital. As Antoine slowly recovered he began to worry about his future. Now that he was blind, he felt that he would not be able to continue as a school teacher. As a wounded soldier, he would receive a state pension but he was not happy to think that his life was over.\nHenri Lebesgue\nsuggested that he could train to become a research mathematician despite never having studied beyond undergraduate level. He also suggested the area that would be best for him to work in, namely two- and three-dimensional topology. As this was a new area, there were few papers in that area so Antoine's inability to read would be a smaller disadvantage. Also,\nLebesgue\nsuggested\n(\n[\n12\n]\nor\n[\n1\n]\n)\n:-\n... in such a study the eyes of the spirit and the habit of concentration will replace the lost vision.\nMarguerite, Antoine's finacée, had been appointed as a teacher at Vert-le-Petit, in the Essonne\n[\n15\n]\n:-\nAntoine offered to cancel his promise of marriage to Marguerite but, like many women, she refused, perhaps partly out of patriotism, but also because of an intense love. Their marriage was celebrated on\n15\nMay\n1918\n.\nNow there was no way that Antoine could have studied mathematics on his own but he had the help of a number of good friends:\nHenri Lebesgue\n,\nMarcel Brillouin\nand\nGaston Julia\nmade Braille copies of the leading mathematical treatises of the day so that Antoine could bring his mathematical knowledge up to the level needed for research. However, there was no standard Braille representation of mathematical symbols so Antoine, assisted by Bourguignon who was a student at the École Normale Supérieure of Saint-Cloud, invented Braille versions of mathematical symbols. From\n1919\n, Antoine had a position at the University of Strasbourg while he worked on his thesis. He submitted his doctoral thesis,\nSur l'homéomorphie de deux figures et de leurs voisinages\nⓉ\n(\nOn the homeomorphism of two figures and their neighborhoods\n)\n, to the University of Strasbourg and was awarded his doctorate on\n9\nJuly\n1921\n. The thesis was a remarkable piece of work which contained what today is known as 'Antoine's necklace'\n[\n12\n]\n:-\nBernard Morin\n(1931\n-\n)\nmet Antoine in the mid-\n1960\ns, and Antoine explained to his younger fellow blind mathematician how he had come up with his best-known result. Antoine was trying to prove a three-dimensional analogue of the\nJordan\n-\nSchönflies\ntheorem, which says that, given a simple closed curve in the plane, there exists a homeomorphism of the plane that takes the curve into the standard circle. What Antoine tried to prove is that, given an embedding of the two-sphere into three-space, there is a homeomorphism of three-space that takes the embedded sphere into the standard sphere. Antoine eventually realized that this theorem is false. He came up with the first \"wild embedding\" of a set in three-space, now known as Antoine's necklace, which is a\nCantor\nset whose complement is not simply connected. Using Antoine's ideas,\nJ W Alexander\ncame up with his famous horned sphere, which is a wild embedding of the two-sphere in three-space.\nAn interesting account of these ideas is given in Horst Ibisch's articles\n[\n10\n]\nand\n[\n11\n]\n. Ibisch explains how\nJ W Alexander\nrealised that Antoine's \"remarkable point set\" could be easily modified to obtain a counterexample to the\nSchönflies\nconjecture which he published in\n1924\n. In fact\nJ W Alexander\nhad earlier announced that he had a proof of the\nSchönflies\nconjecture! Here is a description of how Antoine's necklace is constructed\n[\n1\n]\n:-\nAntoine's necklace is a gorgeous mathematical object that may be represented as chains within chains within chains ... The necklace can be constructed by first considering a solid torus, or doughnut shape. Within the torus, we construct a chain\nC\nC\nC\nof\nn\nn\nn\ncomponents\n(\nlinks\n)\n. Next, we modify each link of chain\nC\nC\nC\nso that it is actually another chain\nC\n1\nC_{1}\nC\n1\n​\nof\nn\nn\nn\nsolid tori. In each link of\nC\n1\nC_{1}\nC\n1\n​\n, we construct a smaller chain of solid tori embedded in each link. Continue this process forever to create the delicate necklace of tori whose diameters decrease to zero.\nA movie of a rotating\n4\nth\niteration for Antoine's necklace is at\nTHIS LINK\nHenri Lebesgue\n, who examined Antoine's doctoral thesis, wrote:-\nIn France we have very few doctors of mathematics, although our people have a high culture. Perhaps the French do not like the mediocre and, for fear of not doing well enough, many prefer doing nothing who could do exceptionally well. Despite his brilliant qualities, without the war, M Antoine would perhaps never have undertaken his own research. His example encourages daring.\nAntoine was not particularly happy in Strasbourg. The city had long been disputed between the French and the Germans. It had been French before the Franco-Prussian war of\n1870\n-\n71\nwhen Germany captured the city after a\n50\n-day siege. After taking control of Alsace-Lorraine, the Germans had reorganised the University of Strasbourg and reopened it as the German Kaiser-Wilhelm University of Strasbourg in\n1872\n. Strasbourg was returned to France after World War I and the city and university were being made French when Antoine was appointed. He was unhappy at the tensions that existed between the French and German supporters and looked for the first possible move. This came in\n1922\nwhen he was offered a position as an assistant lecturer at the Faculty of Science at Rennes. He was appointed Professor of Pure Mathematics in Rennes in\n1925\n. Of course, it is natural to ask how someone who is totally blind could teach students. Jean Lefort writes\n[\n15\n]\n:-\nHe put all his energies into teaching when he began to carry out his profession. He needed to write on the blackboard so he took lessons in writing from his secretary so that he could write well both French and mathematical formulas\n(\nto correctly set the numerator and denominator of a fraction is a trap for a blind man\n)\n. Like any teacher, after writing on the blackboard, he turns to his students and when he wants to continue writing, he must know where he stopped. He divided the blackboard into three vertical strips with holes which could hold a peg. He placed a peg where he stopped, which allowed him to continue writing in the proper place. However, it was impossible to draw the figures which were required in geometry. These were prepared at home by his wife, with the help of mathematics teachers. These figures were made with such dazzling precision that one day one of his students ventured to ask him in a geometry course suited for cartography, \"But Sir, how do you make them?\" He got this humorous response: \"You know, I'm blind because of the war, a bullet has deprived me of my sight, and the last thing I saw was a military map\". He added, \"In geometry, I have an advantage over you; you, you see the figure, but the whole figure. I also see the figure, but I only remember the part that interests me to answer the question.\"\nJean Bocle was a student of Antoine's at Rennes. He went on to become Antoine's assistant and much later became Dean of Science at Rennes. He spoke about Antoine as a teacher in\n[\n4\n]\n:-\n[\nAntoine\n]\nspoke in a clear voice, well modulated, at such a rate that it was easy to take notes, especially as his explanations were always clear and his presentation never became confused, examples and counterexamples presented at the right time to make the theory clear. ... The examination papers were discussed with the assistants and their difficulty was well judged: never traps or trick questions. All of this meant that the results were never a surprise. At oral examinations, as in the written examinations, Antoine sought not to embarrass the candidate; I do not believe a student was ever lost for words in front of him ... After the interrogation ended, there was no anxious waiting, for Antoine immediately gave the result to the applicant.\nJean Lefort also writes about Antoine's family in\n[\n15\n]\n:-\nAfter the birth of Maurice at Strasbourg, his two daughters, Madeleine and Denise, were born in Rennes: Antoine always regretted that he had never seen his children. The children were accustomed to not to leave their toys lying around and to leave a door which was closed, wide open so that their father didn't collide with it. Good father, he watched over the upbringing of his children, speaking in French, in Latin, in Greek, teaching physics and mathematics well ... forcing them to find for themselves the rules to use. ...\nHow did the blind mathematician spend his leisure time? Louis Antoine:-\n... made a point of honour of doing things which were difficult for the blind, such as handicrafts: repairing an iron, doing joinery work, changing washers. However, there were other things he could not do or refused to do: at the table, for example, it was necessary to cut his meat, this was done by his wife who was always by his side. Also when he went outside, he insisted that he was accompanied, which was a burden to Marguerite, though later it was the children who accompanied their father to the faculty, children who felt the curious looks from the students. This refusal to travel alone outside is quite strange from a man who has invested so much so that the blind could take their place in society. ... From the beginning of his disability, he had taken up music, learning piano using a Braille method, then taking up the mandolin since it was easier to transport. Music was his main hobby. ... one of his daughters, then in kindergarten, when asked by her teacher what her father did said, \"Dad listens to music!\" He could also read novels or other Braille books.\nHis whole career was spent in Rennes where he was visited by many mathematicians. For example,\nPavel Sergeevich Aleksandrov\nand\nPavel Samuilovich Urysohn\nvisited him in Rennes only days before\nUrysohn\ndrowned swimming off Batz-sur-Mer in August\n1924\n. He welcomed German mathematicians as enthusiastically as any others. During World War II, Antoine and his wife opened their home to refugees. Later, when under German occupation, a room in their home was requisitioned for German officers to live in. He was treated with great kindness by these officers who were embarrassed to see someone so disabled by war. He took on several administrative roles at the university but refused the position of Dean of Science since that position would have involved him in making journeys to Paris and he disliked travelling.  Antoine published a textbook based on courses he had taught on the differential and integral calculus; the\n234\npage volume\nCalcul différentiel et calcul intégral: Calcul intégral\nⓉ\n(\nDifferential and integral calculus: Integral calculus\n)\n(1948)\nand the\n194\npage volume\nCalcul différentiel et calcul intégral: Calcul différentiel\nⓉ\n(\nDifferential and integral calculus: Differential calculus\n)\n(1949)\n. The book, which was \"a model of clarity, brevity and rigour\" was popular and a second edition was published in\n1955\n.\nIn\n1957\nhe suffered heart problems and had to restrict his activities. Fearing that he might not be able to carry out all his duties at the university to the high standard that he set himself, he retired from his professorship. He was honoured in\n1961\nwhen he was elected to the\nAcadémie des Sciences\nhaving been proposed for membership by\nJulia\n. He died in February\n1971\nfollowing a fracture of his neck. His wife Marguerite only outlived him by a few weeks for she died on\n24\nMay\n1971\n. On the occasion of his\n100\nth\nbirthday, the University of Rennes organised a special session devoted to the memory. The proceedings of the meeting was published as\nJournée Louis Antoine\n(1988)\n. Many of the papers listed in the references are published versions of talks given at this special session. Let us end this biography by quoting from the speech given by Denise Legros, Antoine's daughter:-\nWe have come to this day where he would have been\n100\nyears old, and only now I learned of the existence of the Antoine necklace. ... He never boasted of his science and we did not realise the importance of his work. Certainly, we saw many foreign mathematicians come to our home and we saw that one is American, another is German. He would even have meetings or dinners out with these foreign professors who came, but we did not know much more. Mama told me: \"Oh, you know, your father does important work and if he was not blind we would have often been to conferences abroad.\" But it was impossible to persuade him to travel.",
  "matematicos_citados_na_biografia": [
    "Gaston Julia",
    "Julia",
    "Henri Lebesgue",
    "Lebesgue",
    "Marcel Brillouin",
    "Jordan",
    "Schönflies",
    "Cantor",
    "J W Alexander",
    "Pavel Sergeevich Aleksandrov",
    "Pavel Samuilovich Urysohn",
    "Urysohn",
    "Académie des Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}