{
  "nome_completo": "Louis Paul Emile Richard",
  "nome_curto": "Louis Richard",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Richard_Louis/",
  "data_nascimento": "31 March 1795",
  "local_nascimento": "Rennes, France",
  "data_morte": "11 March 1849",
  "local_morte": "Paris, France",
  "summary": "Louis Richard was a French mathematician who is best-known as the teacher of Evariste Galois.",
  "biografia": "Louis Richard\n's father was a lieutenant colonel in the artillery. Louis was the eldest of his parents' four children and his parents would certainly have expected him to follow in his father's footsteps and join the military. He was left with a physical impediment as a result of a childhood accident so he was unable to pursue the military career that both he and his parents had wished. He therefore decided to become a teacher of mathematics and so train men many of whom would indeed progress to military careers themselves.\nHe taught mathematics at the lycée at Douai, a town on the river Scarpe south of Lille, from\n1814\n. While teaching at this lycée he became friendly with a student A J H Vincent, who later became a famous historian of Greek mathematics. Richard continued his friendship with Vincent after he left Douai.\nIn\n1815\nhe was appointed professor at the Collège de Pontivy, being given the title of Professor of Special Mathematics in the following year. Pontivy is a town in Brittany which Napoleon had designed and used as his military base\n(\nrenaming it Napoleonville\n)\n. These military connections must have been to Richard's liking. In\n1920\nhe went to Paris where he was appointed to teach mathematics at the Collège Saint-Louis. Remaining in Paris, he then taught at the famous Collège Louis-le-Grand where he was given the chair of Special Mathematics in\n1822\n. Richard held this post for twenty-seven years until his death at the age of\n53\n.\nThe Collège Louis-le-Grand was an ancient educational establishment founded in\n1563\n. It was situated in the heart of the student area of Paris close to the Sorbonne and the Collège de France. The main function of the school was to prepare pupils for the entrance examinations to the École Polytechnique and École Normale Supérieure. It had an outstanding reputation in this function with a high success rate. Richard was an extremely talented teacher who was given the freedom to devise his own approach to getting the best educational results. Not only did he achieve excellent results from his pupils but, perhaps even more importantly, he also did an outstanding job in firing their interest in research in mathematics.\nRichard perhaps attained his greatest fame as the teacher of\nGalois\nand his report on him which stated:-\nThis student works only in the highest realms of mathematics....\nis well known. However, he also taught several other mathematicians whose biographies are included in this archive including\nLe Verrier\n,\nSerret\nand\nHermite\n. He fully realised the significance of\nGalois\n' work and so, fifteen years after he left the college, he gave\nGalois\n' student exercises to\nHermite\nso that a record of his school-work might be preserved. It is probably fair to say that Richard chose to give them to\nHermite\nsince in many ways he saw him as being similar to\nGalois\n. Under Richard's guidance,\nHermite\nread papers by\nEuler\n,\nGauss\nand\nLagrange\nrather than work for his formal examinations, and he published two mathematics papers while a student at Louis-le-Grand.\nDespite being encouraged by his friends to publish books based on the material that he taught so successfully, Richard did not wish to do so and so published nothing. This is indeed rather unfortunate since it would now be very interesting to read textbooks written by the teacher of so many world-class mathematicians.",
  "matematicos_citados_na_biografia": [
    "Galois",
    "Le Verrier",
    "Serret",
    "Hermite",
    "Euler",
    "Gauss",
    "Lagrange"
  ],
  "imagens": []
}