{
  "nome_completo": "Louis Puissant",
  "nome_curto": "Louis Puissant",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puissant/",
  "data_nascimento": "22 September 1769",
  "local_nascimento": "Champagne, France",
  "data_morte": "10 January 1843",
  "local_morte": "Paris, France",
  "summary": "Louis Puissant was a French mathematician and geographer who is best remembered for his invention of a new map projection.",
  "biografia": "Louis Puissant\n's family were farmers from the Champagne region of France. Louis trained as a land-surveyor but felt that he did not know enough mathematics to carry out this work to the standard that he wished, so decided that he must study geometry. He made rapid progress with his studies, showing that he had real talent for the subject.\nHe was employed in the French War Department in\n1790\n, then, beginning in\n1792\n, he became an engineer-geographer with the French army in the Eastern Pyrenees and in Spain. He returned to Paris in\n1796\nwhere he was appointed professor at the École Centrale d'Agen. In\n1802\nhe was promoted to engineer-geographer first class. He was sent to the Island of Elba to carry out triangulations there, then after this was sent to Lombardy to carry out a similar task. This was a time when the French were undertaking many projects measuring the earth. Much of this was related to the introduction of the metre which had become obligatory throughout France in\n1801\n.\nDelambre\nand\nMéchain\nhad been measuring the meridian since\n1792\nand this project was still not complete when Puissant was carrying out triangulations using similar methods. Puissant was fascinated by this major scientific project, and wrote an book on the problem of the shape of the earth.\nHe was professor of mathematics at the École Centrale de Lot-et-Garonne, then at the military academy at Fontainebleau. He directed the École de Géographes in Paris from\n1809\nto\n1833\n. These were difficult years during which Napoleon rescinded the metric system in France, then suffered a military defeat with his Russian campaign in\n1812\n, and was finally defeated in\n1815\n. The Bourbons' constitutional monarchy fell in\n1830\nand revolutions led to fighting in the streets of Paris. Puissant had risen to the rank of lieutenant-colonel by the time he left the army.\nOn\n3\nNovember\n1828\nPuissant was elected to the\nAcademy of Sciences\nto fill the vacancy caused by the death of\nLaplace\nin the previous year.\nHe is best remembered for his invention of a new map projection for a new map of France, and he was involved in the production of the map. The map was produced with considerable detail, the projection used spherical trigonometry, truncated power series and\ndifferential geometry\n.\nPuissant wrote on geodesy, the shape of the earth and spherical trigonometry. He wrote a mathematics text\nCours de Mathématiques\n. In\n1801\nhe published\nRecueil de diverses propositions de Géométrie, résolues ou démontrées par l'analyse algébrique, suivant les principes de Monge et de Lacroix: à l'usage de ceux qui suivent le traité Elémentaire d'Application de l'Algèbre à la Géométrie de ce dernier\nⓉ\n(\nCollection of various proposals for Geometry, resolved or proven by algebraic analysis, following the principles of Monge and Lacroix: the use of those who follow the recent treatise 'Elements of the application of algebra to geometry'\n)\n. In\n1807\nhe published\nTraité de topographie, d'arpentage et de nivellement\nⓉ\n(\nsurveying and leveling\n)\n. A second enlarged edition was produced in\n1820\n. A supplement to this work contains his theory of map projections.",
  "matematicos_citados_na_biografia": [
    "Delambre",
    "Méchain",
    "Academy of Sciences",
    "Laplace",
    "differential geometry"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}