{
  "nome_completo": "Louis Raffy",
  "nome_curto": "Louis Raffy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Raffy/",
  "data_nascimento": "21 March 1855",
  "local_nascimento": "Toulouse, Haute-Garonne, France",
  "data_morte": "9 June 1910",
  "local_morte": "Paris, France",
  "summary": "Louis Raffy was a French mathematician who published extensively on infinitesimal geometry.",
  "biografia": "Louis Raffy\nwas the son of Jean Casimir Raffy\n(1820\n-\n1884)\nand Marguerite Augustine Guibal\n(1821\n-\n1864)\n. Casimir Raffy was a school teacher who wrote secondary school textbooks. His many popular books included\nLectures d'histoire ancienne\nⓉ\n(\nLectures on ancient history\n)\n(1859)\n,\nLectures d'histoire moderne\nⓉ\n(\nLectures on modern history\n)\n(1860)\n,\nLectures géographiques\nⓉ\n(\nLectures on geography\n)\n(1867)\nand\nL'Europe géographie physique, politique, agricole, etc. de l'Europe en général et des états qui la composent\nⓉ\n(\nEurope physical geography, politics, agriculture, etc. Europe in general and the states that make it up\n)\n. The first two of these both ran to over\n20\neditions. Louis spent only the first three years of his life in Toulouse for when he was three years old his family moved to Paris. In fact he was to spend the rest of his life in that city.\nAt the Lycée Saint-Louis, Louis Raffy had brilliant successes in arts subjects as well as in science. He graduated in\n1873\nas both a 'Bachelier ès lettres' and a 'Bachelier ès sciences'. His remarkable abilities in all he studied gave him a problem in what to study at university. He hesitated for some time, unsure about his choice of a career, but eventually he decided that it was the sciences that he wanted to make his career in and he firmly set his sights on specialising in mathematics. His nature was to put all his energies into everything he did so from that point on he aimed high in his studies of the mathematical sciences.\nRaffy was appointed as an assistant teacher at the Lycée Saint-Louis in\n1875\n. In the following year he sat the examinations to enter the École Normale Supérieure and was awarded a place but he chose not to begin his university career at this time and he continued to work as a teacher at the Lycée Saint-Louis until\n1879\n. In that year he entered the École Normale Supérieure and, after taking leave in session\n1982\n-\n83\n, was ranked first in the agrégation, the highest teaching diploma in France, in\n1883\nand on the\n20\nApril of that year he was awarded his doctorate in mathematics. His research on the genus of an algebraic curve was highly praised by\nCharles Hermite\n. Raffy published two papers which were based on his thesis, namely\nDétermination du genre d'une courbe algébrique\nⓉ\n(\nDetermination of the genus of an algebraic curve\n)\n(1883)\nand the\n85\n-page paper\nRecherches algébriques sur les intégrales abéliennes\nⓉ\n(\nAlgebraic research on abelian integrals\n)\n(1883)\n.\nFor a list of\n77\npapers and one book published by Raffy during his career, see\nTHIS LINK\n.\nOn\n19\nOctober\n1883\nRaffy was appointed as a demonstrator in mathematics at the École Normale Supérieure and in the following year on\n6\nNovember\n1884\nhe was put in charge of three courses at the Faculty of Sciences in Paris. From this time on, his career took place between the Sorbonne and the École Normale Supérieure, both institutions that he loved. His excellent work on delivering the three courses in\n1884\n-\n85\nsaw him put in charge of four courses at the Faculty of Sciences on\n21\nMarch\n1885\nand later that year, on\n1\nAugust, he was appointed as a senior lecturer at the Faculty of Sciences.\nRaffy published numerous papers, those published in\n1884\nand\n1885\nbeing the three papers\nSur les transformations invariantes des différentielles elliptiques\nⓉ\n(\nOn invariant transformations of elliptic differentials\n)\n,\nSur une proposition de M Hermite\nⓉ\n(\nOn a proposition of Hermite\n)\nand\nSur les quadratures algébriques et logarithmiques\nⓉ\n(\nOn algebraic and logarithmic quadratures\n)\n.\nPaul Appell\nspoke about his research as follows\n[\n2\n]\n:-\nLouis Raffy had definitively found his way in infinitesimal geometry, which he never ceased to cultivate and enrich until his last day; his work on surfaces and curved lines, on the deformation of surfaces, succeeded one another without interruption, noticed by the learned world, and rewarded by the\nAcademy of Sciences\n.\nIn the list of publications which we have found written by Raffy, there are\n77\npapers and one book as we mentioned above. This constitutes a high output achieved over\n28\nyears. We display these publications at\nTHIS LINK\n.\nOn\n14\nSeptember\n1887\nRaffy married Gabrielle Mathilde Thérèse Fontolive\n(\nborn\n2\nDecember\n1865\nin Paris\n)\n, the daughter of Antoine Fontolive, a dentist, and his wife Marie-Thérèse Rossignol. Louis and Gabrielle Raffy had three children, Louise Emilie Andrée Raffy, Lucienne Amélie Georgette Raffy\n(\nborn\n17\nDecember\n1891\nin Paris\n)\n, and Paul Jean Léon Raffy\n(\nborn\n27\nJanuary\n1897\nin Paris\n)\n. We note that his eldest daughter Louise married Edmond Paul Ouivet who had studied mathematics advised by Raffy. Edmond Ouivet published\nMelanges recherches sur les mouvements plans a deux paramètres\nⓉ\n(\nMixed research on plane motions with two parameters\n)\nin the\nBulletin des Sciences Mathématiques\nin\n1917\n.\nPaul Appell\nspoke about Raffy's teaching as follows\n[\n2\n]\n:-\nIn his teaching, he was deeply imbued with his duties: he prepared his courses and lectures with meticulous care, loving his pupils, taking an interest in the detail of their work, correcting and annotating their copies with admirable knowledge, bringing to examinations a high idea of his mission.\nRaffy was appointed as a senior lecturer for the teaching of the agrégation, the highest teaching diploma in France, at the Faculty of Sciences from\n7\nNovember\n1885\n. He held this position until\n1893\n. He became a senior lecturer delivering courses leading to the first degree in mathematics on\n9\nNovember\n1893\n, and an assistant professor of analysis on\n27\nJuly\n1895\n. All these positions were at the Faculty of Sciences but on\n13\nJanuary\n1897\nhe was appointed as a senior lecturer at the École Normale Supérieure.\nAt the École Normale Supérieure, Raffy became a senior lecturer in analysis and, beginning in July\n1897\n, he taught courses on the Elements of Analysis and on Mechanics. We have a record of Raffy's courses for he published them as the\n251\n-page book\nLeçons sur les applications géométriques de l'analyse\n(\néléments de la théorie des courbes et des surfaces\n)\nⓉ\n(\nLessons on geometric applications of analysis\n(\nelements of the theory of curves and surfaces\n)\n)\n(1897)\n[\n2\n]\n:-\nHis lessons were published in a work remarkable for his composition, his precision and the perfection of language.\nOn\n9\nDecember\n1899\nhe was promoted to adjunct professor at the Sorbonne. He took leave in session\n1900\n-\n1901\n. On\n26\nJuly\n1904\nhe was appointed to the chair of Applications of Analysis to geometry at the Sorbonne, a chair was specially created for Raffy.\nRaffy is one of many people who make a huge contribution to mathematics yet their contributions have not been made in ways that lead to them being known to mathematicians today. We know of no theorem named for him nor any concept being named for him. He was unlucky with his paper\nSur une classe nouvelle de surfaces isothermiques et sur les surfaces deformaties sans alteration des courbures principales\nⓉ\n(\nOn a new class of isothermal surfaces and on deformed surfaces without alteration of the principal curvatures\n)\n(1893)\nwhich contains a statement that a necessary condition that a surface\nS\nS\nS\nadmits ∞\n1\nsurfaces applicable to it with preservation of both curvatures is that the surface\nS\nS\nS\nbe isometric. Sadly Raffy's proof is incorrect but he was unlucky in that the error was as a result of using a result of Théodule Caronnet\n(\nborn\n1864)\nwhich was fallacious. Théodule Caronnet was, in\n1893\n, a research student at the University of Paris and he was awarded his doctorate in mathematical sciences in\n1894\n. He was later known for being the author of a large number of highly successful textbooks on geometry and mechanics. A correct proof of the result stated by Raffy was proved correctly by Ioannis Hazzidakis, the father of\nNikolaos Hatzidakis\n, in\nBiegung mit Erhaltung der Hauptkrümmungsradien\nⓉ\n(\nBending with preservation of the main radii of curvature\n)\n(1897)\n.\nThere is another important contribution which Raffy made to mathematics in France which we must record and that is his contributions to the\nFrench Mathematical Society\n. He became a member of that Society in\n1883\nand served the Society for the rest of his life taking on the most important and arduous tasks. Raffy died in\n1910\n, at the age of\n55\n. The President of the\nFrench Mathematical Society\nat the time of Raffy's death was Raoul Bricard\n(1870\n-\n1943)\n. Bricard was a professor of applied geometry at the National Conservatory of Arts and Crafts in Paris. He explained Raffy's contribution to the\nFrench Mathematical Society\nin his funeral oration\n[\n2\n]\n:-\nAs secretary, he took care of editing the 'Bulletin' until about\n1900\n. Called to the presidency in\n1902\nby the unanimous wish of his colleagues, he resumed, some time after, the functions of secretary which he continued until his death. Not only did he edit our 'Bulletin' with as much awareness as skill, but nothing that touched the life of the Society left him indifferent, and we can rightly say that he was its soul, not missing hardly any meetings and making frequent communications which constituted one of their most serious attractions. By the affection he bore to the Society, Louis Raffy showed the excellence of his character, I mean the love of science for itself, and not only for the successes it won him. Finally, I will not forget that for many years we have been able to appreciate what the man was worth beside the scientist, his inexhaustible obligingness, and his eagerness to defend the ideas he believed to be right. The memory of Louis Raffy, of all he did for our Society and dreamed of doing, will not fade from our memory.\nWe have quoted above from\nPaul Appell\n's oration at Raffy's funeral and we now give a further quote from this oration\n[\n2\n]\n:-\nThus arrived at the end of his ambitions, having not sought any function outside his service to the University to which he devoted all his efforts, he could hope for a beautiful end to his career surrounded by his dearly loved family. ... Three weeks ago he had to cease all service and was quickly taken from us. ... In the dreadful sadness of such a separation, all the professors and students of the Faculty are united in the same feeling of admiration for a life so upright, so pure, so courageous; of grief and mourning before such an untimely end.\nFinally let us quote from the obituary\n[\n2\n]\n:-\nFrench science has suffered a significant loss in the person of M Louis Raffy, professor at the Faculty of Sciences of Paris, who died on\n9\nJune, at the age of\n55\nyears. The career of the scientist was entirely devoted to science and the teaching of infinitesimal geometry which he delivered with so much care at the Sorbonne.",
  "matematicos_citados_na_biografia": [
    "Charles Hermite",
    "THIS LINK",
    "Paul Appell",
    "Academy of Sciences",
    "Nikolaos Hatzidakis",
    "French Mathematical Society"
  ],
  "imagens": []
}