{
  "nome_completo": "Louis Poinsot",
  "nome_curto": "Louis Poinsot",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Poinsot/",
  "data_nascimento": "3 January 1777",
  "local_nascimento": "Paris, France",
  "data_morte": "5 December 1859",
  "local_morte": "Paris, France",
  "summary": "Louis Poinsot was the inventor of geometrical mechanics, investigating how a system of forces acting on a rigid body could be resolved into a single force and a couple.",
  "biografia": "Louis Poinsot\nattended the school of Louis-le-Grand in Paris. He sat the entrance examination of the École Polytechnique in October\n1794\nbut he performed poorly in the algebra assessment, which he failed. Despite this poor performance in one part of the entrance examinations, Poinsot was accepted for admission to the École Polytechnique.\nFrom\n1794\nuntil\n1797\nPoinsot was a student at the École Polytechnique but then he left and went to study at the École des Ponts et Chaussée with the intention of becoming an engineer. Poinsot seems to have somewhat lacked vision at this stage in his career as to what he wanted for the future. Once on the course to become an engineer, he reacted by failing to study the practical subjects and became fully engrossed in abstract mathematics. Having made rather a mess of his education, Poinsot decided to give up the idea of becoming an engineer and left the École des Ponts et Chaussée to become a mathematics teacher.\nFrom\n1804\nuntil\n1809\nPoinsot was a mathematics teacher at the Lycée Bonaparte in Paris. Then he was appointed as inspector general of the Imperial University. Another famous mathematician held a post with this university at this time for\nDelambre\nhad been appointed treasurer to the Imperial University in\n1808\n, holding the position until\n1815\n. Poinsot took on another appointment, in addition to the one with the Imperial University, when he accepted the position of assistant professor of analysis and mechanics at the École Polytechnique on\n1\nNovember\n1809\n.\nWe should say a little about how someone like Poinsot, who had not really made a great success of his education, had moved from school teaching into higher education in the way that he did. The reason is that Poinsot had been very active in mathematics even while he was supposed to be studying for an engineering qualification. He had published a number of works on geometry, mechanics and statics beginning with\nEléments de statique\nⓉ\n(\nElements of statics\n)\nin\n1803\nand following this with\n[\n1\n]\n:-\n... memoirs that dealt with the composition of moments and the composition of areas\n(1806)\n, the general theory of equilibrium and of movements in systems\n(1806)\n, and polygons and polyhedra\n(1809)\n.\nCertainly Poinsot had been very busy during his years as a school teacher of mathematics and by\n1809\nhe had made for himself a fine reputation. In\n1812\nPoinsot arranged for\nReynaud\nto substitute for him in lecturing at the École Polytechnique and, from this time on, he did no further teaching there asking\nCauchy\nto substitute for him after\nReynaud\n. In September\n1816\nthe École Polytechnique was reorganised and Poinsot lost the post which he had held in name only for the previous four years.\nBy\n1816\nPoinsot had been elected to the\nAcadémie des Sciences\nfor, on\n31\nMay\n1813\n, he had replaced\nLagrange\nin the mathematics section of the\nAcadémie\n. The\n1816\nreorganisation of the École Polytechnique saw Poinsot become admissions examiner and he held this post for ten years. From\n1839\nuntil his death he worked at the Bureau des Longitudes.\nPoinsot had high principles when it came to mathematics research and the publication of it\n[\n1\n]\n:-\nPoinsot was determined to publish only fully developed results and to present them with clarity and elegance. Consequently he left a rather limited body of work ...\nHis research in geometry, statics and dynamics is important. He was the inventor of geometrical mechanics, investigating how a system of forces acting on a rigid body could be resolved into a single force and a couple. He wrote an important work on polyhedra in\n1809\n(\nalready mentioned above\n)\n, discovering four new regular polyhedra, two of which appear in\nKepler\n's work of\n1619\nbut Poinsot was unaware of this. In\n1810\nCauchy\nproved that, with this definition of regular, the enumeration of regular polyhedra is complete. A mistake was discovered in Poinsot's\n(\nand hence\nCauchy\n's\n)\ndefinition in\n1990\nwhen an internal inconsistency became apparent.\nIn addition Poinsot worked on number theory and on this topic he studied\nDiophantine equations\n, how to express numbers as the difference of two squares and primitive roots. However he is best known for his dedication to geometry and, together with\nMonge\n, he contributed to the topic regaining its leading role in mathematical research in France in the eighteenth century. As well as his research in geometry, Poinsot contributed to its increasing importance by creating a chair of advanced geometry at the Sorbonne in\n1846\n. Poinsot intended the chair for\nChasles\nand indeed he was appointed to the new chair which he occupied until his death in\n1880\n.\nPoinsot did, as many academics at this time in France, become involved in politics. He was involved both in the politics of higher education and also with the politics of France. In the former capacity he served on the Conseil de Perfectionnement of the École Polytechnique on a number of occasions after\n1830\n. In\n1840\nhe was appointed to the Conseil Royal de l'Instruction Publique which dealt with higher education. He was\n[\n1\n]\n:-\nModerately liberal in his political opinions\n[\nand\n]\nhe protested against the clericalism of the Restoration but later accepted nomination to the Chambre de Paris\n(1846)\nand the Senate\n(1852)\n.",
  "matematicos_citados_na_biografia": [
    "Delambre",
    "Reynaud",
    "Cauchy",
    "Académie des Sciences",
    "Lagrange",
    "Académie",
    "Kepler",
    "Diophantine equations",
    "Monge",
    "Chasles"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}