{
  "nome_completo": "Louise Schmir Hay",
  "nome_curto": "Louise Szmir Hay",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hay/",
  "data_nascimento": "14 June 1935",
  "local_nascimento": "Metz, France",
  "data_morte": "28 October 1989",
  "local_morte": "Oak Park, Illinois, USA",
  "summary": "Louise Szmir Hay was a French-born American mathematician who worked on recursively enumerable sets and computational complexity theory.",
  "biografia": "Louise Szmir\n's parents were Samuel Szmir and Marjem Szafran. The reader may well ask at this point - who is Louise Szmir? Is this not a biography of Louise Schmir Hay? Szmir is not a misprint, rather Szmir was the Polish-Jewish family name which she got through her father who had emigrated to France from Poland between the wars. Louise's mother was also a Polish Jew who had left Poland to live in France. Later the family would change their name from Szmir to Schmir, and later still Louise would marry John Hay - hence the puzzle over her name. To add one further twist to the name question, she divorced John Hay and still later married the mathematician Richard Larson. However, she was not known by the name of Larson, all her mathematical publications being under the name of Louise Hay.\nLouise's father Samuel Szmir was in the clothing business. Samuel and Marjem had two children, Gaston who was born in\n1933\nand then Louise who was born two years later. Louise would never know her mother for Marjem died when she was only three years old. Her father Samuel married quickly after the death of his first wife and by the end of\n1938\nhe was married to Eva Sieradska. World War II started less than a year after this second marriage and it marked the beginning of extremely difficult times for the family.\nBeing Jewish, they had to avoid being captured by the Nazis who would have sent them to a concentration camp, and almost certain death. For many years the family lived in fear and hid from the Germans. In\n1943\nSamuel and Eva had their only child when Maurice was born. In March\n1944\nGaston, who was Louise's older brother, together with Louise, escaped from occupied France and managed to get to the neutral country of Switzerland which was a safe haven. Their they remained for the rest of the war, but after the war ended they returned to their family in France. The whole family had come through the war under very stressful circumstances, but without loss of life.\nIn\n1946\nSamuel and Eva, together with their three children, emigrated to the United States. It is at this time that they changed their family name from Szmir to Schmir. It maintained the pronunciation, but made the spelling more natural in the United States. The family settled in New York and Samuel owned a delicatessen there from\n1950\nto\n1965\n. Louise attended school in New York but at first there was no sign that she had special talents for mathematics\n[\n3\n]\n:-\nUntil high school, I was not particularly mathematically inclined - indeed, I was much better at verbal subjects; combinatorial aspects of numbers and equations have never been my strong point ...\nThe high school which she attended was the William Taft High School in the Bronx in New York. It was only when she was in the tenth grade at this school that her interest in mathematics first began to show and, as often happens, it was a teacher, David Rosenbaum, who sparked that interest. Rosenbaum\n[\n3\n]\n:-\n... believed in teaching the logic of the subject rather than just following the theorem-proof format of the text\n(\nwhich of course was straight out of Euclid\n)\n. He wrote up and distributed notes on logical reasoning, fallacies, etc., and expected the students to understand what they were doing when they wrote up a proof. ... I found the logical aspects of mathematics much more congenial than the numerical aspects, and when I showed aptitude for this, Mr Rosenbaum suggested I read up on non-Euclidean geometry, to put the subject in a new perspective. ... He had me get Wolfe's book on non-Euclidean geometry, which I found fascinating and which ultimately was the basis of the project I wrote as a senior for the Westinghouse Science Talent Search, in which I won third prize.\nIn fact David Rosenbaum helped in other ways too. Louise Schmir's family were struggling financially in the United States and Rosenbaum arranged for Louise to take up private mathematics tutoring so that she could help support the family financially. Also her third prize in the Westinghouse Science Talent Search, again a result of Rosenbaum's encouragement and direction, was a vital component in her being awarded a scholarship to enable her to take a degree in mathematics at Swarthmore College.\nMoney was still tight while at College but Louise was able to earn money during the summer vacation, and again the Westinghouse prize helped her to find useful summer jobs. During the summer of\n1952\nshe worked for the National Bureau of Standards, learning to program an early computer. This in turn meant that she was able to earn money with a part-time job in the Moore School of Electrical Engineering during her undergraduate years. While still an undergraduate at Swarthmore College Louise married John Hay, also an undergraduate at the time, who was studying experimental psychology.\nLouise Hay graduated from Swarthmore College in\n1956\nand, despite being married, fully intended to undertake graduate studies. However, if she and her husband were to be together they would have to find a university which not only had a good graduate programme in mathematics, but also had a good one in experimental psychology. In fact the constraints were more severe than this, for ever since her teacher Rosenbaum had turned her on to mathematical logic, she had wanted to undertake research in that topic. It was even harder to find a university with strong graduate schools in both experimental psychology and mathematical logic.\nIn fact John Hay graduated from Swarthmore College with a Master's Degree a year before his wife graduated, so the choice of university for their doctoral study had to be made before Hay entered her final year at Swarthmore. They were both accepted by Cornell which offered them teaching assistantships. Louise Hay remained at Swarthmore College to complete her undergraduate year while her husband moved to Ithaca to begin research. It was certainly seen as unusual at that time for a newly married couple to live in separate towns for the first year of their marriage.\nAt Cornell Hay's thesis was supervised by J Barkley Rosser. However, being out of step with her husband, after she had studied for two years at Cornell, her husband had completed his Ph.D. and took up a teaching position in Oberlin. Being apart again did not really seem an option to Hay who terminated her studies at Cornell early, writing up what she had at that point for a Master's Degree. However, she did not do this grudgingly\n[\n3\n]\n:-\nI must admit I was glad to leave - I lacked confidence that I could finish a Ph.D. at that point.\nHay was awarded an M.A. in\n1959\n, then also managed to get a job at Oberlin. Her thesis advisor gave her a programme to follow to continue to work towards her doctorate. It was not that good a programme, for Hay found a counter-example to one of the results she had been told to prove. This marked the start of her mathematical publications but we shall wait until later in this biography before commenting on her mathematical papers.\nFor the next few years Hay had a number of posts as she basically followed her husband round the country. Both Hay and her husband worked for the Cornell Aeronautical Laboratory in Buffalo for a year, then Hay had a part-time teaching post before working at Mount Holyoke College for three years as an instructor. By this time she was thinking that she would like to complete the Ph.D. course she had started, but no university within travelling distance offered mathematical logic at doctoral level.\nA number of events encouraged her to get her mathematical career back into gear. One was\nArtin\n's\nGeometric Algebra\nwhich she read and loved, a second was a chance to attend seminars at Cornell over the summer of\n1962\nwhile her husband was there on a research visit, and the third was an inspiring discussion she had with\nHanna Neumann\nwhen she visited Mount Holyoke College. On the negative side she now had a child, Bruce, who was born in\n1963\n, but did not find that too restricting. She now made the decision to spend a year at Cornell and finish her doctorate while her husband returned to Smith College where he was teaching. Things worked out well for Hay\n[\n3\n]\n:-\nI had a wonderful and productive year. I took\n3\ncourses, passed my prelims, and under the inspiring tutelage of Anil Nerode, did all the work for a dissertation in recursion theory.\nBefore completing writing up her thesis she had twins, Philip and Gordon who were born in\n1964\n, but with the help of housekeepers she was able to graduate with her Ph.D. in\n1965\n. The award of a doctorate led to her going back on the staff at Mount Holyoke College in\n1965\n, this time with the tenure track appointment of Assistant Professor. She held this appointment for three years, one of which she spent at M.I.T. on a NSF Postdoctoral Fellowship. In\n1968\nshe was appointed as an Associate Professor at the University of Illinois at Chicago, and in the same year her marriage with John Hay ended.\nHay spent the rest of her career in Chicago at the University of Illinois. She remarried in\n1970\n, this time to the mathematician Richard Larson. Her health began to decline and in\n1974\nshe was diagnosed with cancer; however, she made a good recovery. She was promoted to full Professor in\n1975\n.\nWe still have to give a brief account of some of Hay's mathematics. She published papers on mathematical logic, recursive function theory, and theoretical computer science. She published\nAxiomatization of the infinite-valued predicate calculus\nin the\nJournal of Symbolic Logic\nin\n1963\nin which she gave a set of nine axiom schemes and two rules for the predicate calculus based on the infinite-valued sentential calculus of\nŁukasiewicz\n. In\n1965\nshe published\nOn creative sets and indices of partial recursive functions\nwhich investigated sets of indices of partial recursive functions and of recursively enumerable sets.\nIn a\n1975\npaper\nSpectra and halting problems\nshe considered problems related to theoretical computer science. In this paper she gives strong relations between three different classification problems. These are the class of\nTuring\nmachines that halt on an element of A, the class of recursive sets that contain an element of A, and the class of spectra of first-order sentences that contain an element of A. In the same year she published\nRice theorems for d.r.e. sets\nwhich builds on the theory of index sets of classes of recursively enumerable sets and extends the ideas to properties of index sets of classes of sets which are differences of recursively enumerable sets.\nFrom\n1980\nuntil\n1988\nHay became Head of the Mathematics Department. However in\n1988\ncancer recurred and led to her death the following year. The talk\n[\n3\n]\n, which she gave near the end of her life, contains some words of advice to young women mathematicians:-\nIf there is a moral to this tale of how I became a mathematician, it is that sources of inspiration and opportunities to change your life can come unexpectedly and should not be ignored; and that you should not neglect the dictates of your own career, taking some risks if necessary, since you never know what the future will bring.\nIn\n1990\n, the Association of Women in Mathematics, of which Hay was a founding member, established the Louise Hay Award for Contributions to Mathematics Education:-\nWhile Louise Hay was widely recognized for her contributions to mathematical logic and for her strong leadership as head of the Department of Mathematics, Statistics, and Computer Science at the University of Illinois at Chicago, her devotion to students and her lifelong commitment to nurturing the talent of young women and men secure her reputation as a consummate educator. The annual presentation of this award is intended to highlight the importance of mathematics education and to evoke the memory of all that Hay exemplified as a teacher, scholar, administrator, and human being.",
  "matematicos_citados_na_biografia": [
    "Artin",
    "Hanna Neumann",
    "Łukasiewicz",
    "Turing"
  ],
  "imagens": [
    "hay.jpg"
  ]
}