{
  "nome_completo": "Louis Bertrand Castel",
  "nome_curto": "Louis Castel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Castel/",
  "data_nascimento": "15 November 1688",
  "local_nascimento": "Montpellier, France",
  "data_morte": "11 January 1757",
  "local_morte": "Paris, France",
  "summary": "Louis Castel was a French mathematician who was a strong opponent of Newton's philosophy.",
  "biografia": "Louis Castel\n's father was André-Guillaume Castel. Originally from Béarn, a mountainous region of  south west France, Guillaume Castel practised as a surgeon in Montpellier. Louis was Guillaume's second son. He was educated in the Jesuit school in Toulouse and he entered the Jesuit Order on\n16\nOctober\n1703\n. He studied mathematics and philosophy in the Order and decided that he wished to go on a mission to China where his Order was very active following an edict of toleration which had been proclaimed in\n1692\n. Jesuit communities had been established in many cities of south and central China, and a church had been built in Peking under Imperial patronage. Castel, however, was not allowed to be part of a Chinese mission since his superiors decided that his health was not sufficiently good for such a strenuous undertaking and he remained in Toulouse.\nHis early writings had been seen by\nFontenelle\nand after his disappointment at failing to get to China, he persuaded Castel to go to Paris. Indeed late in\n1720\nCastel did go to Paris and taught physics and mathematics at the Jesuit school in the rue Saint-Jaques which was later to become the Lycée Louis-le-Grand. In particular he taught\ninfinitesimal\ncalculus and mechanics at the Lycée. Castel was never to leave Paris again except for a short visit to the South of France near the end of his life.\nImmediately on arriving in Paris, Castel was appointed as an associate editor of the\nJournal de Trévoux\n, remaining on the editorial board of this monthly publication until\n1745\n. Castel was a strong opponent of\nNewton\n's views on science and he made these views clear in his two volume work\nTraité de physique sur la pesanteur universelle des corps\nⓉ\n(\nA Physical Treatise on universal gravitation\n)\n(1724)\n. On nationalistic grounds he supported the views of\nDescartes\nand his opposition delayed the acceptance of\nNewton\n's theories in France. Castel believed that science should be based on logical thought not on experiment.\nNewton\n, he said:-\n... reduced man to using only his eyes.\nCastel's physics was based on reason, not observation. He also opposed\nNewton\non religious grounds, believing Newtonian theory to be materialistic. He made this clear in an early article written in the\nJournal de Trévoux\nin\n1721\nin which he stated that\nNewton\nhad been influenced by\nDemocritus\nin substituting the void for divine intelligence. He gave his own alternative system to replace\nNewton\n's system but it is of little importance\n[\n1\n]\n:-\nIt was an attempt to harmonise philosophy, scientific curiosity, and religious dogma by methods of rationalism.\nThere was another reason why Castel opposed\nNewton\n. Science, he believed, had to be accessible to everyone and so both higher mathematics and costly experimentations had to be excluded from scientific methods. He wrote in the\nJournal de Trévoux\nthat:-\n... the experiments capable of perfecting physics, ought to be easy to make and to repeat at any time, and almost by everyone.\nHe published\nVrai système de physique de M Isaac Newton\nin\n1743\nin which he claimed\n(\nwith some degree of exaggeration!\n)\nthat:-\n... in order to make these experiments on the refraction of light correctly one must be a millionaire.\nCastel's ideas on the accessibility of science were also held by others such as Diderot, a friend of Castel. Diderot expressed similar views to Castel in\nLettre sur les aveugles\nⓉ\n(\nLetter on blindness\n)\n(1749)\nand\nDe l'interprétation de la naturei\nⓉ\n(\nOn the interpretation of the naturai\n)\n(1751)\n.\nCastel's system to replace the theories of\nNewton\ndid not bring him fame. However he did achieve this from a rather unusual source. In the November\n1725\nissue of\nMercure de France\nhe set out his ideas for an instrument, the clavecin oculair, which made colours and musical tones correspond. Two articles in the\nJournal de Trévoux\nin\n1735\n, namely\nNouvelles expériences d'optique et d'acoustique\nⓉ\n(\nNew optical and acoustic experiments\n)\nand\nL'optique des couleurs fondée sur les simples observations\nⓉ\n(\nThe optical colour based on simple observations\n)\n, took the idea further describing an instrument to accomplish the colour-tone correspondence, namely the ocular harpsichord\n[\n1\n]\n:-\nBy\n1742\nthe fame of Castel and of his invention had reached as far as St Petersburg and had been brought to the attention of the empress. the instrument was completed in July\n1754\n, and on\n21\nDecember of the same year Castel gave a private demonstration of it before fifty guests. The spectators were enthusiastic and applauded several times. Colour organs appeared in the early\n20\nth\ncentury in England and the United States.\nCastel was elected to the\nRoyal Society of London\nin\n1730\n. He was also elected to the Bordeaux Academy\n(1746)\n, the Academy of Rouen\n(1748)\nand the Academy of Lyon\n(1748)\n.",
  "matematicos_citados_na_biografia": [
    "Fontenelle",
    "infinitesimal",
    "Newton",
    "Descartes",
    "Democritus",
    "Royal Society of London"
  ],
  "imagens": []
}