{
  "nome_completo": "Ludolph Van Ceulen",
  "nome_curto": "Ludolph Van Ceulen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Van_Ceulen/",
  "data_nascimento": "28 January 1540",
  "local_nascimento": "Hildesheim, Germany",
  "data_morte": "31 December 1610",
  "local_morte": "Leiden, Netherlands",
  "summary": "Ludolph Van Ceulen was a German mathematician who is famed for his calculation of π to 35 places. In Germany π used to be called the Ludolphine number .",
  "biografia": "Ludolph Van Ceulen\n's name means Ludolph from Cologne but, in fact, he was born in Hildesheim. His mother was Hester de Roode while his father, Johannes Van Ceulen, was a merchant but of limited financial means. Van Ceulen could receive no more than an elementary education and, certainly, he did not have a university education as his parents were not sufficiently wealthy to pay for one. This made his mathematical studies much harder since he could not read Latin or Greek so had to rely on friends to make translations of important texts for him. He held a number of posts not only as a teacher of mathematics but also as a fencing teacher. First let us give the few details of Van Ceulen's life prior to\n1578\n. The only sources of such information are Meursius\n[\n2\n]\nand Van Ceulen's own Preface to his book\nVanden circkel\nⓉ\n(\nOn the circle\n)\n(1596)\n. According Meursius\n[\n2\n]\n, Van Ceulen came from a large family. After the death of his father Johannes, Van Ceulen travelled to Livonia, a region in present day Latvia and Estonia. Then he travelled to visit his brother Gert who lived in Antwerp. After this he moved to Delft. The first archival material giving us a definite date is the baptism certificate of his daughter who was born in Delft on\n4\nMay\n1578\n. Van Ceulen tells us in his Preface that he made a trip to Germany in\n1569\nwhen he visited Cologne and purchased a book there. He also tells us that he learnt mathematics in Antwerp, where he was taught by Iohan Pouwelsz. The information from the Preface also tells us that Van Ceulen earned his living teaching mathematics beginning around\n1566\n.\nThe strong reaction in the Netherlands against their Spanish rulers followed the start of a reign of terror by the Spanish occupation in the south beginning around\n1567\n. The Duke of Alba, a Spanish soldier and statesman, became notorious for his tyranny as governor-general of the Netherlands from\n1567\nto\n1573\n. Following the popular uprisings, Philip II sent Alba to the Netherlands in August\n1567\nwith a large army to punish the rebels. His tasks included rooting out heresy, and re-establishing Philip II's authority. Van Ceulen was a member of the Calvinist church of the Netherlands, so like thousands of others, suffered from the attempts of the Spanish to subdue rebellions in the Netherlands. Alba set up a new court, the Council of Troubles\n(\nlater known as the Council of Blood\n)\nwhich ignored the law of the land and condemned around\n12\n,\n000\npeople for their support of the rebellion. Many of these had not waited to be arrested but had fled the country. It is likely that at this time Van Ceulen was still in Antwerp which had became a centre of Protestant activity and was most at risk. Many of the Protestant inhabitants of Antwerp fled to the northern Netherlands at this time, while another major exodus occurred after looting by the Spanish armies in\n1576\n. It is likely that Van Ceulen was among the large numbers who fled to Delft in\n1576\n. The Union of Utrecht on\n23\nJanuary\n1579\nwas designed to form a block\n(\nknown as the States-General\n)\nwithin the larger union of the Low Countries which would resist Spanish rule. It produced a union in the north Netherlands, still officially under the rule of the King of Spain, but distinct from the south. The north was predominantly Calvinist and effectively ruled by William, Prince of Orange.\nVan Ceulen was married twice. His first wife was Mariken Jansen; they had five children including the daughter born in May\n1578\n. Mariken died in\n1590\nand Van Ceulen remarried on\n17\nJune of that year to Adriana Simondochter who was the widow of Bartholomew Cloot. The Cloots had, like many others, moved from Antwerp to Delft and since Bartholomew Cloot was an accountant and mathematics teacher, it is quite reasonable to guess that they the families had known each other since both lived in Antwerp. An indication of what close friends the families were is seen from the fact that Bartholomew Cloot was a witness to the signing of Van Ceulen's daughter's birth certificate in May\n1578\n. Like Mariken Van Ceulen, Bartholomew Cloot died in\n1590\n. Adriana had eight children from her marriage to Bartholomew so when she married Van Ceulen the couple had thirteen children.\nAfter arriving in Delft, Van Ceulen taught mathematics there then, on\n13\nMay\n1580\n, he submitted a request to the Delft town council to be allowed to open a fencing school in the town. The Council agreed to his request and informed him that the Church of the St Aghata monastery was available. To understand why Van Ceulen was being offered a church in which to hold his fencing school, one has to understand that Delft was largely a Calvinist city and many of the buildings previously owned by the Roman Catholic Church had been taken over and put to other uses. The Council were obviously very pleased to have Van Ceulen open a fencing school in the city for, in addition to offering him the building, they awarded him an annual allowance of\n25\nguilders. During his time in Delft, Van Ceulen was involved in a number of mathematical disputes. The first was with William Goudaan, a mathematics teacher from Haarlem. Goudaan had posed a geometric problem which Van Ceulen solved but his solution was not accepted by Goudaan. When Goudaan published his own solution to the problem, Van Ceulen realised that it was incorrect. In\n1584\nVan Ceulen published\nSolutie ende werckinghe op twee geometrische vraghen by Willem Goudaen inde jaeren\n1580\nende\n83\nbinnen Haerlem aenden kerckdeure ghestelt: mitsgaders propositie van twee andere geometrische vraghen\nⓉ\n(\nSolution of two geometric problems posed by William Goudaen in\n1580\nand\n83\nin Haarlem and corrections: together with two other geometric problems\n)\nputting his side of the dispute. A second dispute from this period was with Simon van der Eycke who had published an incorrect proof of the quadrature of the circle in\n1584\n. Van Ceulen showed van der Eycke's error in two publications:\nKort claar bewijs dat die nieuwe ghevonden proportie eens circkels iegens zyn diameter te groot is ende ouerzulcx de quadratura circuli des zeluen vinders onrecht zy\nⓉ\n(\nShort clear proof that the new-found proportion of a circle to his diameter is too big, whence the quadrature of the circle of this discoverer is not correct.\n)\n(1585)\nand\nProefsteen ende claerder wederleggingh dat het claarder bewijs\n(\nso dat ghenaempt is\n)\nop de gheroemde ervindingh vande quadrature des circkels een onrecht te kennen gheven, ende gheen waerachtich bewijs is: hier by gevoeght Een corte verclaringh aengaende het onverstant ende misbruyck inde reductie op simpel interest. Den ghemeenen volcke tot nut\nⓉ\n(\nTouchstone and clear refutation that the\n(\nso called\n)\nclearer proof of the famous discovering of the quadrature of the circle reveals a mistake and is not a real proof : hereby added a short statement about the unwisdom and abuse in reduction by simple arguments.  To the benefit of the\n(\ncommon\n)\npeople.\n)\n(1586)\n. Up to this time Van Ceulen had not read\nArchimedes\n' work on  in which he had used a regular polygon of\n96\nsides to show that\n223\n71\n<\nπ\n<\n22\n7\n\\large\\frac{223}{71}\\normalsize  < \\pi < \\large\\frac{22}{7}\\normalsize\n7\n1\n2\n2\n3\n​\n<\nπ\n<\n7\n2\n2\n​\n. Van Ceulen had a problem since he could not read Greek, but Jan Cornets de Groot, the burgomaster of Delft and father of the jurist, scholar, statesman and diplomat, Hugo Grotius, translated\nArchimedes\n' approximation to π for Van Ceulen. This proved a significant point in Van Ceulen's life for he spent the rest of his life obtaining better approximations to π using\nArchimedes\n' method with regular polygons with many sides.\nAlthough Van Ceulen was based in Delft until\n1594\n, he made regular trips to other towns, for example he tells us in the Preface to\nVanden circkel\nthat he made a trip to Bremen in\n1587\nand in\n1589\nhe was in Arnhem at the Gelderse court. In\n1594\nhe moved with his family to Leiden where again he taught mathematics and fencing. On\n9\nJune\n1594\nhe made a request of the Leiden Council that he be given permission to open a fencing school in the Catharina Hospital. The Council accepted his request to open a fencing school, but did not accept his request regarding its location. They offered Van Ceulen the Faliedenbegijnkerk for, as in Delft, former Roman Catholic churches were being put to different uses. However, included in the letter of permission was a clause with made Van Ceulen responsible for any damage caused to the building by either him or his students. Nobody else was allowed to run a fencing school in Leiden and in\n1602\n, when he realised that his assistant Pieter Bailly was running his own school, Van Ceulen complained to the Council who forced the closure of Bailly's fencing school.\nThe leading Leiden professor Joseph Scaliger published\nCyclometrica elementa duo\nⓉ\n(\nTwo elements on circle measurement\n)\nin\n1594\n. In this work he claimed that π was equal to √\n10\n. Van Ceulen knew that was incorrect - he already had an accurate value of π with √\n10\nwell outside his bounds. In fact he knew that √\n10\ndid not even fall within\nArchimedes\n' bounds. However, he now had a problem since he felt he could not openly criticise Scaliger, given his position, and he also he had the problem that Scaliger's book was in Latin which he could not read\n(\na friend must have translated the relevant parts\n)\n. He approached other academics, explaining Scaliger's error to them, and hoped that they would let Scaliger see where he had gone wrong. However Scaliger was not going to be told how to do mathematics by a fencing instructor, and challenged Van Ceulen to put his objections in writing. Van Ceulen never did so, perhaps because he felt he could not enter a public dispute with a leading professor at the university, perhaps also because his inability to write Latin would have meant that he could not take part in the dispute on the usual terms.\nIn addition to teaching mathematics and fencing, Van Ceulen was writing his most famous work, the book\nVanden circkel\nⓉ\n(\nOn the circle\n)\nwhich he published in\n1596\n. In this book he gave π correct to\n20\ndecimal places using a regular polygon of\n15\n×\n2\n31\n15 \\times  2^{31}\n1\n5\n×\n2\n3\n1\nsides.\nStruik\nwrites\n[\n1\n]\n:-\nThe 'Vanden circkel'\nⓉ\n(\nOn the circle\n)\nconsists of four sections. The first contains the computation of π. The second shows how to compute the sides of regular polygons of any number of sides, which in modern terms amounts to the expression of\nsin\n⁡\nn\nA\n\\sin nA\nsin\nn\nA\nin terms of\nsin\n⁡\nA\n\\sin A\nsin\nA\n(\nn an integer\n)\n. The third section contains tables of sines up to a radius of\n1\n0\n7\n10^{7}\n1\n0\n7\n(\nnot an original achievement\n)\n, and the fourth has tables of interest. The first and second sections are the most original; they contain not only the best approximation of π reached at that time but also shows Van Ceulen to be as expert in trigonometry as his contemporary\nViète\n. In\n1595\nthe two men competed in the solution of a forty-fifth degree equation proposed by\nvan Roomen\nin his 'Ideae mathematicae'\n(1593)\nand recognised its relation to the expression of\nsin\n⁡\n45\nA\n\\sin 45A\nsin\n4\n5\nA\nin terms of\nsin\n⁡\nA\n\\sin A\nsin\nA\n.\nVan Ceulen was appointed to a number of committees by the States-General. The first was on\n13\nMarch\n1598\nwhen he was appointed to a committee to consider applications for patents for instruments to be used at sea. Also on the committee were Joseph Scaliger, Rudolph Snell and\nSimon Stevin\n. He served on a similar committee set up on\n26\nJune\n1598\n. Then in\n1599\nthe city of Leiden asked him to serve on a committee they had set up to study tax and interest. Joseph Scaliger was the chairman of this committee.\nWilliam of Orange was assassinated at Delft on\n10\nJuly\n1584\nby a Roman Catholic who believed that William's assassination would prevent a rebellion against Catholic Spain. William's eldest son Philip William was loyal to Spain so it was Prince Maurits, William of Orange's second son, who was appointed stadholder of Holland and Zeeland, or the United Provinces of the Netherlands, in\n1584\n. Maurits understood the importance of military strategy, tactics, and engineering in military success. In\n1600\nhe asked his close advisor,\nSimon Stevin\n, to set up an engineering school within the University of Leiden. It was a good political move to insist that the courses were taught there in the Dutch language.  On\n10\nJanuary\n1600\n, Van Ceulen was appointed to the Engineering School. The School was set up in the Faliedenbegijnkerk so Van Ceulen could teach fencing and mathematics in the same building. For the last ten years of his life he taught arithmetic, surveying and fortification in the Engineering School. The method of teaching adopted by the School was for lessons consisting of a half-hour lecture followed by a half-hour tutorial during which students could ask the lecturer questions. Van Ceulen had several friends among the mathematicians of the time. In particular his friendships with\nSimon Stevin\nand\nAdriaan van Roomen\nwere important for his career. His most famous student, who studied under him at Leiden, was\nWillebrord Snell\n.\nSnell\ntranslated two of Van Ceulen's works into Latin to make them more accessible to the world-wide mathematical community.\nVan Ceulen is famed for his calculation of π to\n35\nplaces which he did using polygons with\n2\n62\n2^{62}\n2\n6\n2\nsides. Having published\n20\nplaces of π in his book of\n1596\n, the more accurate results were only published after his death. In\n1615\nhis widow Adriana Simondochter published a posthumous work by Van Ceulen entitled\nDe arithmetische en geometrische fondamenten\nⓉ\n(\nOn arithmetic and fundamental geometry\n)\n. This contained his computation of\n33\ndecimal places for π. The complete\n35\ndecimal place approximation was only published in\n1621\nin\nSnell\n's\nCyclometricus\nⓉ\n(\nMeasuring the circle\n)\n. Having spent most of his life computing this approximation, it is fitting that the\n35\nplaces of π were engraved on Van Ceulen's tombstone. In fact Van Ceulen had purchased a grave in the Pieterskerk on\n11\nNovember\n1602\nbut, after Van Ceulen's death on\n31\nDecember\n1610\n, his widow Adriana exchanged this grave for another, still in the Pieterskerk, and it was in this second grave that Van Ceulen was buried on\n2\nJanuary\n1611\n. The tombstone gave both Van Ceulen's lower bound of\n3\n.\n14159265358979323846264338327950288\nand his upper bound of\n3\n.\n14159265358979323846264338327950289\n. However, the original tombstone disappeared around\n1800\nto be replaced by a replica two hundred years later. The original text on the tombstone was known since it had been recorded in a guidebook of\n1712\nand after that reprinted in many articles.  Vajta writes\n[\n11\n]\n:-\nOn July\n5\n,\n2000\na very special ceremony took place in the St Pieterskerk\n(\nSt Peter's Church\n)\nat Leiden, the Netherlands. A replica of the original tombstone of Ludolph Van Ceulen was placed into the Church since the original disappeared. ... It was therefore a tribute to the memory of Ludolph Van Ceulen, when on Wednesday\n5\nJuly,\n2000\nprince Willem-Alexander\n(\nheir to the throne\n)\n, unveiled the memorial tombstone in the St Peter's Church, in Leiden.\nIn Germany π was called the \"Ludolphine number\" for a long time.",
  "matematicos_citados_na_biografia": [
    "Archimedes",
    "Struik",
    "Viète",
    "van Roomen",
    "Simon Stevin",
    "Adriaan van Roomen",
    "Willebrord Snell",
    "Snell"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}