{
  "nome_completo": "Luigi Federico Menabrea",
  "nome_curto": "Luigi Menabrea",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Menabrea/",
  "data_nascimento": "4 September 1809",
  "local_nascimento": "Chambéry, Savoy, France",
  "data_morte": "24 May 1896",
  "local_morte": "St Cassin (near Chambéry), France",
  "summary": "Luigi Menabrea was a French-born soldier and engineer who made contributions to elasticity theory and became prime-minister of Italy.",
  "biografia": "Luigi Menabrea\nstudied engineering and mathematics at the University of Turin, then became an engineer in the army. His career was a remarkable one in which he made very significant contributions to science, yet also reached the highest levels in military and political life. In order to understand the background to his life we need to look briefly at the political situation in Italy.\nThe aims of most Italians was a unified Italian state, but there were different ideas as to how to approach this. Some favoured a unified Italy ruled by a king, others looked for a republic. Austria controlled parts of the country which aspired to become part of the unified Italy while France played an important role, yet their position was not as well defined. Then of course there was the 'problem' of the Papal States which were ruled by a religious leader, namely the Pope. The end of Napoleon's control of much of Europe saw the Congress of Vienna\n(1814\n-\n15)\nestablish a political order in Italy that lasted essentially through the first\n60\nyears of Menabrea's life. It created states such as that of Nice, Savoy, and Piedmont ruled by King Victor Emmanuel I of Savoy. Francis I of Austria also became king of Lombardy-Venetia and Austrian troops stationed at Ferrara were there to intervene in the Papal States if necessary. Austria also had the right to intervene in the Kingdom of the Two Sicilies, and Venetia and Lombardy became part of the Austrian empire. In\n1831\nCharles Albert became king of Savoy. He was strongly anti-Austrian and wanted to drive the Austrians from the Italian peninsula. Another who wished to drive out the Austrians was Cavour who, like Menabrea, was at this time following a military career. The authorities became suspicious of his motives and he was sent to the Alpine fortress of Bardo where he was out of the way. Cavour resigned and he was replaced in\n1831\nby Menabrea.\nMenabrea soon moved from the fortress of Bardo to become professor of mechanics and construction at both the Military Academy of the Kingdom of Sardinia and at the University of Turin.  In August\n1840\nCharles Babbage\ngave a series of lectures on his Analytical Engine at the Academy of Sciences in Turin. The occasion was the second congress of Italian scientists, and the invitations had come in the name of King Charles Albert. He had been invited to give the lectures by\nGiovanni Plana\nand expected that\nPlana\nwould write up the lectures for publication. However, Menabrea was assigned to the task, something which must have disappointed\nBabbage\nsince\nPlana\nwas a distinguished scientist whereas he had almost certainly never heard of Menabrea. However the congress was a great success and in addition to\nBabbage\n's lectures there were discussion sessions on the Analytical Engine which involved\nBabbage\n, Menabrea, and the Italian astronomer Ottaviano Mossotti. Menabrea wrote up the lectures, modified with ideas from the discussions, in the paper\nNotions sur la Machine Analytique de M Charles Babbage\nⓉ\n(\nBasics of the alalytic engine of Charles Babbage\n)\nwhich was published in French in\nBibliothèque Universelle de Genève\nin October\n1842\n.\nThis was the paper which Lord Byron's daughter\nAda Lovelace\npublished a translation of with extensive notes and further illustrations of the working of the analytic engine.\nNot long after the publication of this article Menabrea began his political career. By\n1848\nhe became a trusted helper of King Charles Albert who sent him on a number of important diplomatic missions. Now\n1848\nwas the year in which revolutions took place in many countries in Europe, with people protesting against their rulers. Francis Ferdinand V was temporarily expelled from Modena but was restored by Austrian troops. Menabrea was sent on a diplomatic mission to Modena to make sure that it remained part of the Kingdom of Sardinia. On\n20\nAugust\n1859\nModena declared itself part of the Kingdom of Italy. He was also sent on a similar mission to Parma. After this Menabrea entered the Parliament of Piedmont and was attached to the Ministry of War, then later to the Ministry of Foreign Affairs.\nDuring this period of politics he continued to do excellent scientific work, giving the first precise formulation of methods of structual analysis based on the principle of virtual work first presented in\n1857\n. He also studied elasticity and the principle of least work in\nNouveau principe sur la distribution des tensions dans les systèmes élastique\nⓉ\n(\nNew principles on the distribution of tension in the elastic systems\n)\npublished in\nComptes rendus\nin\n1858\n. The principle of Menabrea states that the elastic energy of a body in perfect elastic equilibrium is a minimum with respect to any possible system of stress-variation compatible with the equations of the statics of continua in addition to the boundary conditions. In\n1868\nhe published an improved demonastration of his principle in\nÉtudes de Statique Physique - Principe général pour déterminer les pressions et les tensions dans un système élastique\nⓉ\n(\nStudies on statical physics  - General principle for determining the pressure and tension in an elastic system\n)\n.  He published, jointly with\nJ L F Bertrand\n, the first completely correct proof of this principle in\n1870\n.\nCastigliano\n, with whom Menabrea was in dispute regarding this principle, became better known for the concepts of work and energy in analytical mechanics. Menabrea later published two further papers answering the criticisms of\nCastigliano\n.\nThis scientific work by Menabrea took place at a time when he was still more heavily involved in politics and military work. He had always worked for a compromise solution to the Italian unification question and up to\n1859\nbelieved that a compromise between the Vatican and the state was possible. However in\n1859\nthere was a war which Cavour and Napoleon III of France organised against the Austrians in north Italy. Menabrea resumed a leading military role as major-general and commander-in-chief of the engineers in the Lombard military campaigns. Peschiera, at the southeast end of Lake Garda, was one of the four fortified towns of the Austrians and Menabrea organised the siege works against it. He also used his engineering skills to flood the plains through which the Austrian army was advancing. Menabrea was present at Palestro when Manfredo Fanti scored a brilliant victory against Austria. He was also involved at Solferino on\n24\nJune\n1859\n- the battle against the Austrians there being the last engagement of the second War of Italian Independence. The northern part of Italy had now been unified as the Kingdom of Italy.\nIn\n1861\nMenabrea was appointed lieutenant-general and was involved in conducting the seige of Gaeta. Gaeta's capitulation to the Kingdom of Italy in\n1861\nmarked the end of the Bourbon Kingdom of the Two Sicilies. Menabrea now turned again to politics and was appointed Naval Minister in the cabinet of Bettino Ricasoli from June\n1861\nto May\n1862\n. He then served in the cabinet of Farini Minghetti as Minister of Public Works from December\n1862\nto September\n1864\n. The year\n1866\nsaw another war with Austria in which the Kingdom of Italy captured Venetia from the Austrians. Menabrea was given full authority by the Kingdom of Italy to negotiate with Austria the hand over of Venetia at the Treaty of Prague at the end of the war. In fact he had to contend with a trick from the Austrians who gave Venetia to the French on\n12\nOctober in an attempt to keep the territory out of Italian hands. However one week later Napoleon III ceded Venetia to Italy.\nOn\n27\nOctober\n1867\nMenabrea succeeded Urbano Rattazzi as Prime Minister of Italy. He served until\n14\nDecember\n1869\nwhen he resigned since a new chamber had been elected in which he did not hold a majority; he was replaced by Giovanni Lanza. Not only did Menabrea hold the position of Prime Minister during this period\n(\nduring which there were three cabinets\n)\n, but he also held the position of Foreign Minister. It was not an easy period in which to be Prime Minister. During his office Garibaldi led an army on Rome in an attempt to capture the Papal States. France supported the Pope and French troops defeated Garibaldi's volunteers at Mentana. Although Menabrea had secretly supported Garibaldi, and the government had put up money for the failed venture, he had to issue a proclamation on\n27\nOctober\n1868\nstarting legal proceedings against Garibaldi. Certainly this was playing politics for Menabrea strongly believed that the Pope should lead the Roman Catholic Church, not be head of a country. He also strongly supported Rome becoming part of the Kingdom of Italy. This was not achieved during his period of office but one of his successes as Prime Minister was to scrap unpopular taxes on items such as flour.\nAfter Giovanni Lanza took over as Prime Minister he was aware that Menabrea might still keep substantial power through his close contacts with King Victor Emmanuel II. Lanza, therefore, thought it better to remove Menabrea from the centre of events and he did this by appointing him ambassador to London. He was made Marquis of Valdora in\n1875\n. In\n1882\nhe was appointed as ambassador in Paris, replacing General Cialdini, and he continued in this role until he retired from public life in\n1892\n.",
  "matematicos_citados_na_biografia": [
    "Charles Babbage",
    "Giovanni Plana",
    "Plana",
    "Babbage",
    "Ada Lovelace",
    "J L F Bertrand",
    "Castigliano"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}