{
  "nome_completo": "Luigi Amoroso",
  "nome_curto": "Luigi Amoroso",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Amoroso/",
  "data_nascimento": "23 May 1886",
  "local_nascimento": "Naples, Italy",
  "data_morte": "28 October 1965",
  "local_morte": "Naples, Italy",
  "summary": "Luigi Amoroso was an Italian mathematician and economist who wrote on integral equatioins but is best known for his economic works.",
  "biografia": "Luigi Amoroso\nwas the son of Nicola Amoroso\n(\nborn Naples\n1855)\nand Maria Mascoli\n(1860\n-\n1934)\n. Nicola Amoroso was an engineer who married Maria Mascoli in\n1885\n. Luigi was the eldest of his parents' six sons. Let us note at this point that there appears to be some confusion as to Luigi Amoroso's date of birth, some biographies giving\n26\nMarch\n1886\n. Christian Kleiber and Samuel Kotz write in\n[\n1\n]\n:-\nLuigi Amoroso's father Nicola played an important role in his son's moral. intellectual, and scientific development. He was an engineer and important technical official, first in the Southern Railway Company and then in the Italian State Railway. Despite his heavy workload, in the evenings, after supper, the father would dedicate his time to research in pure mathematics, thereby setting an example and demonstrating the importance of study to his six sons, of whom Luigi was the eldest.\nAmoroso began his studies of mathematics at the Scuola Normale Superiore in Pisa in\n1903\n. In\n1905\nhis family moved to Rome and so at that time he left Pisa and entered the University of Rome where he graduated with a doctorate in mathematics in\n1907\n. He had written a thesis on holomorphic functions and was appointed as an assistant to\nGuido Castelnuovo\n, the professor of analytic geometry at the University of Rome, in\n1908\n. In\n1909\nthree of Amoroso's papers were published. These were:\nDell' estensione del problema di Dirichlet per le funzioni di più variabili complesse\nⓉ\n(\non the extension of the Dirichlet problem for functions of multiple complex variables\n)\n;\nRicerche intorno alle equazioni integrali lineari di prima specie\nⓉ\n(\nResearch on linear integral equations of the first kind\n)\n; and\nLa Teoria dell' equilibrio economico secondo il Prof Vilfredo Pareto\nⓉ\n(\nThe theory of economic equilibrium according to Prof Vilfredo Pareto\n)\n. This shows that, at this early stage of his career, Amoroso was undertaking research in mathematical problems and also that he had become interested in mathematical economics, particularly through studying the work of Vilfredo Pareto\n(1848\n-\n1923)\n. In this work on the notion of economic equilibrium, he traced the development of the concept from Pareto's\nCours d'Économie Politique\nⓉ\n(\nCourse of political economy\n)\n(1896)\nto his\nManuel d'Économie Politique\nⓉ\n(\nManual of political economy\n)\n(1909)\n. Jan Horst Peppler writes\n[\n9\n]\n:-\nThis article\n[\nby Amoroso\n]\nbegins with a description of the development of the Paretian concept utility, from a cardinal concept to a purely ordinal index-function. It then continues with a description of economic equilibrium under perfect competition according to Pareto, showing how all marginal utilities for consumers equate, as well as for the producer and marginal productivities. In a short digression on monopolistic and duopolistic market structures, he adopts Pareto's view, later rejected, that each duopolist would seek to optimize his own output independent of the output of his competitor, thus \"over determining\" the solution and in essence giving up any attempt to solve it. Typically, he thus rejects the problem as not being part of 'economia puru', but of sociology. \"Pure economics tells us that the conditions given in the outline of our problem are incompatible. ... It is not appropriate to force ourselves further.\"\nChristian Kleiber and Samuel Kotz write in\n[\n1\n]\n:-\nWhile studying mathematics, he also carried out research in the field of administration and economics, and in recognition of his eclecticism, he was awarded the 'libera docenza', which qualified him to teach at the university level in economics\n(1910)\nand in mathematical physics\n(1913)\n.\nDespite the move from research in mathematics to research in mathematical economics, Amoroso still produced more papers on mathematics than on economics during this early part of his career. For example his\n1910\npapers include:\nSur la théorie des fonctions de plusieurs variables\nⓉ\n(\nOn the theory of functions in seveal vaiables\n)\n;\nSulla risolubilità della equazione integrale lineare di prima specie\nⓉ\n(\nOn the solvability of linear integral equations of the first kind\n)\n;\nSulla sviluppabilità in serie degli integrali delle equazioni differenziali lineari\nⓉ\n(\nOn the series developability of integrals of linear differential equations\n)\n;\nAlcune osservazioni intorno alla teoria delle serie di Fourier-Hilbert-Schmidt\nⓉ\n(\nSome observations on the Fourier-Hilbert-Schmidt series theory\n)\n;\nSul valore massimo di speciali determinanti\nⓉ\n(\nOn the maximum value of special determinants\n)\n; and\nL'applicazione della matematica alla economia politca\nⓉ\n(\nThe application of mathematics to political economy\n)\n. These papers were published in\nBattaglini\n'\ns Giornale di matematiche\n, the\nRendiconti\nof the\nAccademia Nazionale dei Lincei\n, and the last paper in the\nGiornale degli Economisti e Rivista di Statistica\n.\nAlthough today Amoroso is remembered as a mathematical economist, despite his interest in this topic starting at the beginning of his career, his move towards this was slow with only a small proportion of his papers being on this topic for many years while he published more papers on mathematics and mathematical physics. For example on mathematical physics he published on viscous fluids with papers such as\nAncora della integrazione delle equazioni del moto lento di un fluido viscoso\nⓉ\n(\nMore on the integration of the equations of the slow motion of a viscous fluid\n)\n(1912)\n,\nIntegrazione delle equazioni del moto lento di un fluido viscoso\nⓉ\n(\nIntegration of the slow motion equations of a viscous fluid\n)\n(1912)\nand\nMoto lento di un fluido viscoso\nⓉ\n(\nSlow motion of a viscous fluid\n)\n(1913)\n. His papers on economics were highly mathematical as for example a paper on the mathematical character of economics\nI caratteri matematici della scienza economica\nⓉ\n(\nThe mathematical characters of economic science\n)\n(1913)\nand one exhibiting analogies between statistical-economic phenomena and mechanical phenomena in\nAnalogie tra i fenomeni statistico-economici e i fenomeni meccanici\nⓉ\n(\nAnalogies between statistical-economic phenomena and mechanical phenomena\n)\n(1913)\n.\nIn\n1914\nAmoroso was appointed to the chair of financial mathematics at the University of Bari. After seven years in Bari, he moved to his home city of Naples when he was appointed, first to the chair of mathematical finance, then to the chair of political economy, at the University of Naples. In\n1921\n, the year he went to Naples, he published an important book,\nLezioni di Economia Matematica.\nⓉ\n(\nLessons on mathematical economy.\n)\nKeppler writes\n[\n9\n]\n:-\nWith this book, Amoroso established himself as a follower of\nCournot\n, Gossen,\nJevons\n, Walras,\nEdgeworth\n, Pareto, and\nFisher\nand in it professes to draw a sharp distinction between mathematical and political economics. Amoroso's digressions ... only very occasionally concern political issues, but consist of seemingly endless mathematical examples. At this point Amoroso still believes in a distinction between industries with increasing returns to scale\n(\nmanufacturing industry\n)\nand industries with decreasing returns to scale\n(\nagriculture\n)\n, a notion which he would later dismiss in favour of a general U-shaped average cost curve. He is evidently fascinated by correspondences between the equilibrium concepts in economics and mechanics.\nDenis Giva writes about this book in\n[\n7\n]\n:-\nIn 'Lezioni di Economia Matematica', Amoroso isolated the object of mathematical economics which ... was a field whose discipline was not yet settled, identifying the insufficiencies of the historical evolution of economic thought as it was summarized in the nineteenth-century static systems from\nCournot\nto\nFisher\n. Mathematical economics, as an abstract analytical science, came for Amoroso to coincide with economic mechanics, that is, with the study of the relations between\n(\npsychological\n)\nforces on the basis of which the economic facts and the obstacles that oppose the action of these forces are produced: in every instant forces and obstacles determine the connections that are then realised among the quantities in the economy as a whole. The laws of mechanics and economic laws have in common the object - the phenomena of motion - and the methodology: the passage from the analysis of the motion of every single particle, and therefore of every action, to the study of the composition of these individual actions in collective action. The specificity of mathematical laws in economics consequently derives from their appearing as barriers and insuperable constraints both at the microeconomic level and at the level of collective action, whatever the institutional condition in which the economic process takes place.\nAlso in\n1921\nhe published the first volume of his two volume work\nLezioni di matematica finanziaria\nⓉ\n(\nFinancial mathematics lessons\n)\n(1921\n-\n23)\n.\nAmoroso spent five years at the University of Naples before being appointed to the chair of economics in the Faculty of Political Science in the University of Rome in\n1926\n. His inaugural address was\nCi che è scienza e ci che è fede nel campo della dottrina economica\nⓉ\n(\nWhat is science and what is faith in the field of economic doctrine?\n)\nin which he claimed that moral grounds led economists to choose particular assumptions which fitted a particular type of economic and political system. He says that there are three distinct types of such systems, of which one is the Fascist system. He describes the merits of each and declines to endorse any one as his preferred system. Very few would agree with all he states here, however, particularly his claim that one merit of Fascism is that it denies that class conflict exists.\nBy this time Benito Mussolini ruled Italy as a Fascist dictator. It is impossible to know whether Amoroso was a Fascist or whether he just found it to his advantage to praise Fascism. Either way, he certainly has this as a controversial side to his career.\nTo understand Amoroso's connection with Italian Fascism, we need to look briefly at how that arose and its ideas. Benito Mussolini founded the Revolutionary Fascist Party in\n1915\nwhich had left-wing policies which attempted to \"out socialist the socialists.\" It had disastrous results in the election of\n1919\nbut it joined with other parties, changed its name to the National Fascist Party and won seats in the Italian parliament in\n1921\n, including a seat for Mussolini himself. The party now was strongly in favour of continuing the process which unified Italy to extend the Empire and achieve \"control of the Mediterranean.\" They organised attacks by their military wing, the Blackshirts, on socialists and their institutions. In October\n1922\nthey attempted to take control of the country by force with a march on Rome. The King handed power to Mussolini who was supported by the military, the business community and many with right-wing views. The National Fascist Party soon ruled as a Fascist dictatorship. The Doctrine of Fascism states:-\nFascism attacks the whole complex of democratic ideologies and rejects them both in their theoretical premises and in their applications or practical manifestations. Fascism denies that the majority, through the mere fact of being a majority, can rule human societies; it denies that this majority can govern by means of a periodical consultation; it affirms the irremediable, fruitful and beneficent inequality of men, who cannot be levelled by such a mechanical and extrinsic fact as Universal suffrage.\nThese were views which were supported by Amoroso who, like Pareto, felt that democracy had failed. The Fascists took over Amoroso's economic ideas as explained in\n[\n9\n]\n:-\nIn the\n1920\ns and\n1930\ns, Amoroso had become the foremost academic spokesman for fascist economic policy and theory. This freely assumed role placed him in a pivotal position in one of the great debates of the time - the debate over the merits and structure of a corporatist reorganization of a capitalist economy. This debate, ultimately about the optimal degree of state intervention in market economies, was an international phenomenon, yet nowhere else did it assume the critical importance it had in Italy. There, corporatism provided the ideological veil for the contradictions of the fascist regime under Benito Mussolini, which had to reconcile its roots in revolutionary syndicalism with its role as a bulwark against the threat of left-wing forces gaining power in the tumultuous years after World War I. Luigi Amoroso's\n1933\nessay, written jointly with the one-time fascist minister of the economy Alberto de' Stefani, \"La logica del sistema corporativo\"\nⓉ\n(\nThe logic of the corporate system\n)\n, was a generally recognized synthesis of the debate on corporatism. It is not without irony that Luigi Amoroso, as Italy's foremost neoclassical economist, would devote a large part of his writing on economic policy to eulogizing fascism for having overcome \"economic liberalism.\"\nVilfredo Pareto died in\n1923\nbut it was only in\n1938\nthat Amoroso wrote his appreciation\n[\n1\n]\n. It seems that he was writing then because Pareto's economics had become so central to Fascism. Amoroso wrote:-\nJust as the weaknesses of the flesh delayed, but could not prevent, the triumph of Saint Augustine, so a rationalistic vocation retarded but did not impede the flowering of the mysticism of Pareto. For that reason, Fascism, having become victorious, extolled him in life, and glorifies his memory, like that of a confessor of its faith.\nAmoroso delivered lectures at the National Institute of Higher Mathematics in the academic year\n1940\n-\n1941\nand published them under the title\nMeccanica economica\nⓉ\n(\nEconomic mechanics\n)\n(1942)\n.\nPerhaps one of the most remarkable aspects of Amoroso's career is the fact that after the defeat of Fascism, he was able to continue to put forward economic views, with only a little change in emphasis, which were applauded by the anti-Fascists. Perhaps it was the highly mathematical basis for his work which allowed him to be equally successful under different political regimes with differing economic views. His major book, published after the fall of Fascism was\nEconomia di mercato\nⓉ\n(\nMarket economy\n)\n(1949)\n[\n9\n]\n:-\nIts most striking feature is a new attempt to combine mathematics with expository presentation. Many of its more than fifty chapters contain mathematical appendices, which are in no way necessary to follow the flow of the book. For example, lengthy discussion of the necessity of interest, abounding with practical and historical examples, is followed by an appendix on compound interest calculation. Amoroso also engages in institutional analysis and, once again, moralistic advice, now exclusively based on conservative Catholic thinking, as represented, for instance, by Pope Pius XII. The book contains a clear pro-capital bias. Speculation is now seen as a dynamic element,  in which only the excesses have to be curbed. Most striking is the fact that oligopoly theory is completely omitted.\nFrom\n1944\nAmoroso was director of the Institute of Economic and Financial Studies at the University of Rome and later became dean of the Faculty of Political Sciences.\nThe Econometric Society was founded in Cleveland, Ohio, USA, on\n20\nDecember\n1930\n. Although Amoroso was not a founding member of the Society, he was elected a fellow shortly after its founding. An interesting debate, in which Amoroso gave his views about mathematics and economics, occurred in\n1953\nwhen the Econometric Society reconsidered its criteria to select fellows.\nOskar Morgenstern\n(\nelected\n1950)\nproposed\n(\nsee\n[\n10\n]\n)\n:-\n... in my view the fellows ought to be persons who have done some econometric work in the strictest sense. That is to say, they must have been in one way or another in actual contact with data they have explored and exploited, for which purpose they may have even developed new methods.\nAmoroso contested\nMorgenstern\n's proposal\n(\nsee\n[\n1\n]\n)\n:-\nI, too, have more than once experienced the unpleasant feeling mentioned by Professor\nMorgenstern\nin seeing pages crammed with formulae which, in general, apply only with limitations to the economic reality. And in this connection allow me to recall\nEdgeworth\n's golden maxim: if discretion in the use of algebraic symbols constitutes an elegance for the mathematician, it constitutes a necessity for the economist. I cannot, however, agree with the opposite thesis which, it seems to me, is implicit in the thought of my eminent colleague i.e., I cannot agree that econometrics should consider as its principal task the mathematical analysis of statistical data, with the purpose of obtaining directly the empirical laws governing the phenomenon in question. In reality econometrics\n(\nlike Janus' temple\n)\nis two-faced: at the same time an inductive and deductive science. And these two lines must be harmoniously blended, avoiding any excess in one or the other direction. By this criterion I let myself be guided in indicating candidates for fellowship; this I do within the limits of my possibilities which are bounded by my incomplete knowledge of the papers written by the individual authors.\nAmoroso had left Rome to return to the University of Bari in\n1956\nand he retired from Bari in\n1959\n. He received an honorary degree from the University of Bari in\n1957\nand they awarded him their Grand Gold Medal in\n1959\n. He was highly praised in a farewell celebration. After retiring he went back to Naples, the city in which he had been born.\nOne of the major honours given to Amoroso was an invitation to be a plenary\n1\n-hour speaker at the International Congress of Mathematicians held in Bologna from\n3\nSeptember to\n10\nSeptember\n1928\n. He delivered the lecture\nLe equazioni differenziali della dinamica economica\nⓉ\n(\nThe differential equations of economic dynamics\n)\n.\nAmoroso received honorary degrees from many universities. He was a member of the Higher Council of Statistics, the Higher Council of Mines, the National Research Council and the National Committee for Education, Sciences and Arts. He was vice-president of the Italian Institute of Actuaries, CEO of the Assicurazioni d'Italia, a director of the Banco di Napoli and of the National Insurance Institute. He was elected a member of the class of physical, mathematical and natural sciences of the\nAccademia dei Lincei\non\n29\nNovember\n1956\n. He was also a member of the Apulian Academy of Sciences, a member of the Institut international de statistique and, as we mentioned above, of the Econometric Society.\nWe noted at the beginning of this article that there is some disagreement over the date of Amoroso's birth. There is also disagreement over the place of his death. Some articles give Naples, others give Rome.",
  "matematicos_citados_na_biografia": [
    "Guido Castelnuovo",
    "Battaglini",
    "Accademia Nazionale dei Lincei",
    "Cournot",
    "Jevons",
    "Edgeworth",
    "Fisher",
    "Oskar Morgenstern",
    "Morgenstern",
    "Accademia dei Lincei"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}