{
  "nome_completo": "Luoxia Hong",
  "nome_curto": "Luoxia Hong",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Luoxia_Hong/",
  "data_nascimento": "about 130 BC",
  "local_nascimento": "Southwest China",
  "data_morte": "about 70 BC",
  "local_morte": "China",
  "summary": "Luoxia Hong was a Chinese astronomer who was involved in calendar reform.",
  "biografia": "Luoxia Hong\nlived in the time of the Former Han dynasty. The dynasty was established in\n206\nBC by Liu Pang and replaced the preceding short-lived Ch'in dynasty. The Ch'in dynasty had attempted to destroy learning by burning books but the Han dynasty reversed this repressive policy and encouraged learning, record keeping and culture. In\n140\nBC, probably before Luoxia Hong was born, Emperor Wu-ti came to power and ruled from his capital Chang'an. Wu-ti took made new moves to promote scholarship and to develop the civil service. In particular, as part of his efforts to improve the administration, he decided to introduce a new calendar. He ordered all the astronomers in his empire to come to the capital to make proposals.\nWe should say a little about why calendar reform was such a frequent event in China while in Europe there has only been one major reform of the calendar. In ancient China there was a belief that a ruler received his right to rule from heaven. Changing the calendar was seen as one of the duties of the office, establishing the emperor's heavenly link on earth. After a change of ruler, and even more significantly after a change of dynasty, the new Chinese emperor would seek a new official calendar thus establishing a new rule with new celestial influences.\nLuoxia Hong was one of the astronomers who went to Chang'an in answer to Emperor Wu-ti's request. Some of the astronomers were already part of Wu-ti's civil service, being imperial astronomers. Luoxia, however, lived in the southwest of China. Emperor Wu-ti received eighteen proposals for a new calendar, and he judged the best one was that received from Luoxia Hong and one of his colleagues Deng Ping. In\n104\nBC the calendar was put into operation by the Emperor.\nThere were\n12\nmonths of\n29\nor\n30\ndays and the calendar was based on a cycle of\n19\nyears. In seven of the\n19\nyears an extra month was inserted making it a calendar based both on the sun and on the moon. Luoxia Hong's calendar was much more than simply an attempt to bring the sun and moon into a common system for he also gave predictions for the positions of the planets and predictions of eclipses. All this was only possible with good observations and the reason that they were good is that Luoxia Hong made an equatorial armillary sphere to make observations for his new calendar.\nEmperor Wu-ti was delighted with Luoxia Hong's achievements and offered him an official position in Chang'an. This offer, however, was refused, and Luoxia Hong returned to live a solitary life.",
  "matematicos_citados_na_biografia": [],
  "imagens": []
}