{
  "nome_completo": "Luther Pfahler Eisenhart",
  "nome_curto": "Luther Eisenhart",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eisenhart/",
  "data_nascimento": "13 January 1876",
  "local_nascimento": "York, Pennsylvania, USA",
  "data_morte": "28 October 1965",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "Luther Eisenhart was an American mathematician who worked in differential geometry and relativity theory.",
  "biografia": "Luther Eisenhart\n's parents were Charles Augustus Eisenhart and Emma Catherine Pfahler who were from long established York families. His father Charles Eisenhart had a surprisingly large number of different occupations as Eisenhart himself described\n(\nsee\n[\n5\n]\n)\n:-\nMy father, after being a student at the York County Academy, taught in a country school until ... he went to Marshall, Michigan, and worked in a store. At the same time, he was apprentice to a local dentist. Being very expert with his hands, he soon acquired competence in the technique of dentistry. In due time he returned to York, set up a dentist office, and was married. He made sufficient income to meet the expenses of his growing family, but his intellect was too active to be satisfied by dentistry. Electricity appealed to him and he organized the Edison Electric Light Company in the early eighties. The telephone also made an appeal. He experimented with telephones and in the late nineties organized the York Telephone Company.\nLuther was the second of his parents' six sons. He was brought up in a religious home with much of the family's social life being centred around St Paul's Lutheran Church. His mother provided him with such a good foundation to his education that, after beginning primary schooling at the age six and a half, he took only three years to complete the normal course of six years. He attended York High School but took the final year off school to prepare for entry to College undertaking independent study of Latin and Greek.\nHe was a student at Gettysburg College from September\n1892\nand won the prize for excellence in his first year and the mathematics prize in his second year. He also excelled at baseball, a sport that the young Eisenhart boys had been passionate about as they grew up. He had to spend the final two years at Gettysburg College studying mathematics with guidance from his professor but with no classes since he was the only student taking the subject.  He was awarded his A.B. in\n1896\n.\nAfter teaching in the preparatory school of Gettysburg College for a year, he began graduate study at Johns Hopkins University in October\n1897\n. He wrote\n[\n5\n]\n:-\n...\nThomas Craig\naroused my interest in\ndifferential geometry\nby his lectures and my readings of\nDarboux\n's treatises. Toward the close of\n1900\nI wrote a thesis in this field on a subject of my own choosing and in June the degree of Doctor of Philosophy was granted.\nHis thesis was entitled\nInfinitesimal deformation of surfaces\n.  As Eisenhart indicated in the above quote, this work was heavily influenced by\nDarboux\n's treatise on the subject and he received little supervision for his doctorate.\nEisenhart spent most of his career at Princeton where he became an instructor in mathematics taking up his appointment in September\n1900\n. In\n1905\nhe was selected to be a preceptor, a position which had been recently created. In\n1908\nhe married Anna Maria Dandridge Mitchell; they had one son Churchill Eisenhart. Sadly his wife died in\n1913\nand, five years later he married Katharine Riely Schmidt of York, Pennsylvania; they had two daughters. He was promoted to full professor in\n1909\nand worked at Princeton until he retired in\n1945\n. He served as Dean of the Faculty from\n1925\nto\n1933\nwhen he became Dean of the Graduate School. After\nHenry Fine\ndied following a bicycle accident in December\n1928\n, Eisenhart became Head of Mathematics at Princeton and Dod Professor of Mathematics, continuing in these roles until he retired in\n1945\n.\nBefore looking at his research contributions, let us look at some of the reforms he introduced at Princeton. He proposed the four course plan\n(\ninstead of the five courses which was the scheme then in place\n)\nwhich involved the undergraduates doing independent reading and research during their final two years. They completed their course by writing an undergraduate thesis. The plan was adopted in\n1923\nand, as we can see from the details we gave above of Eisenhart's own education, it was very much based on the experiences he had gone through. He believed that:-\n... teaching methods . . . must be designed to encourage independence and self-reliance, to evoke curiosity, and stimulate the imagination and creative impulse.\nHe also stated that:-\nThe real test of an educational process is what is becoming of the student as he proceeds with his education - how he is being prepared to continue his education and become an educated man.\nThere was opposition to the four course plan - both from fellow academics and from students. The students sang:-\nLuther Pfahler Eisenhart,\nEfficient from the very start;\nBut he's condemned in the eyes of man\nFor originating the four-course plan.\nHowever Eisenhart was prepared to fight for what he believed in, and his arguments won the day.\nLet us now look at Eisenhart's research contributions. There are two stages in his work although it is all in differential geometry. The first stage continued his doctoral work studying deformations of surfaces. His first book\nA Treatise in the Differential Geometry of Curves and Surfaces\n, published in\n1909\n, was on this topic and was a development of courses he had given at Princeton for several years. In\n[\n2\n]\nthis book is described as:-\n... in textbook form, with numerous problems, introducing the student to classical and modern methods. One of the most interesting novelties of the volume was the so-called 'moving trihedrals' for twisted curves as well as surfaces so freely used in writings of\nDarboux\nand others. From the first, methods of the theory of functions of a real variable are employed. The work was of great value in introducing the American student to an important field by the most modern method of the time.\nThe second stage started after\n1921\nwhen Eisenhart, prompted by\nEinstein\n's general theory of relativity and the related geometries, studied generalisations of Riemannian geometry. He published\nRiemannian Geometry\nin\n1926\nand\nNon-Riemannian Geometry\nin\n1927\n. The scene is set for the first of these works in\n[\n1\n]\n:-\nRiemann proposed the generalisation of the theory of surfaces as developed by\nGauss\n, to spaces of any order, and introduced certain fundamental ideas in this general theory. Important contributions to it were made by\nBianchi\n,\nBeltrami\n,\nChristoffel\n,\nSchur\n, Voss, and others, and\nRicci-Curbastro\ncoordinated and extended the theory with the use of\ntensor analysis\nand his absolute calculus. The book gave a presentation of the existing theory of Riemannian geometry after a period of considerable study and development of the subject by\nLevi-Civita\n, Eisenhart, and many others.\nIn\n1933\nEisenhart published\nContinuous Groups of Transformations\nwhich continues the work of his earlier books looking at\nLie\n's theory using the methods of the tensor calculus and differential geometry. Again quoting\n[\n1\n]\n:-\nThe study of continuous\ngroups\nof transformations inaugurated by\nLie\nresulted in the developments by\nEngel\n,\nKilling\n, Scheffers,\nSchur\n,\nCartan\n,\nBianchi\nand\nFubini\n, a chapter which closed about the turn of the century. The new chapter began about\n1920\nwith the extended studies of tensor analysis, Riemannian geometry and its generalizations, and the application of the theory of continuous groups to the new physical theories. Eisenhart has thus developed a remarkable body of original material and has notably served his colleagues by frequent surveys of fields in which he had become a specialist.\nAfter he retired, Eisenhart continued to undertake research. In fact he published\n21\npapers between\n1951\nand\n1963\n, for example:\nGeneralized Riemann spaces and general relativity\n(1953)\n;\nA unified theory of general relativity of gravitation and electromagnetism\n(1956)\n;\nThe cosmology problem in general relativity\n(1960)\n; and\nThe Einstein generalized Riemannian geometry\n(1963)\n.\nEisenhart had a long association with the\nAmerican Mathematical Society\nbeing vice president in\n1914\n, and Colloquium lecturer in\n1925\nwhen he lectured on non-Riemannian geometry. He edited\nThe Annals of Mathematics\nfrom\n1911\nto\n1925\nand the\nTransactions of the American Mathematical Society\nfrom\n1917\nto\n1923\n, being managing editor in\n1920\n-\n23\n. He was President of the\nAmerican Mathematical Society\nfrom\n1931\nto\n1932\n. He was also honoured by being elected president of the American Association of Colleges\n(1930)\n, and vice president of the\nNational Academy of Sciences\n(\nUnited States\n)\n(1945\n-\n49)\nand of the American Association for the Advancement of Science. He was also elected an officer of the American Philosophical Society serving from\n1942\nto\n1959\n. In addition he received honorary degrees from Gettysburg College\n(1921)\n, Columbia University\n(1931)\n, University of Pennsylvania\n(1933)\n, Lehigh University\n(1935)\n, Duke University\n(1940)\n, Princeton University\n(1952)\nand Johns Hopkins University\n(1953)\n. In\n1937\nhe was named Officer of the Order of the Crown of Belgium.\nLefschetz writes about Eisenhart's character in\n[\n1\n]\n:-\nHe was par excellence a family man and found in his family a great source of happiness and strength. Eisenhart was essentially a most modest man. The intimate atmosphere which surrounded him, its very serenity, was due in large measure to the care and devotion which he received from Mrs Eisenhart. The Dean, as we all called him, did not seem to realize that he was an outstanding leader both in his field and in higher education. For outside his family he had two \"loves\": differential geometry\n(\nas research and study\n)\nand education.\nAfter his death his faculty colleagues said, in a tribute, that:-\n... in two centuries of Princeton's history few scholars had done more to shape the future of the University ...\nand the trustees declared that he had:-\n... earned an enduring place in the front rank\n[\nof those who had\n]\nmade Princeton great.",
  "matematicos_citados_na_biografia": [
    "Thomas Craig",
    "differential geometry",
    "Darboux",
    "Henry Fine",
    "Einstein",
    "Gauss",
    "Bianchi",
    "Beltrami",
    "Christoffel",
    "Schur",
    "Ricci-Curbastro",
    "tensor analysis",
    "Levi-Civita",
    "Lie",
    "groups",
    "Engel",
    "Killing",
    "Cartan",
    "Fubini",
    "American Mathematical Society",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}