{
  "nome_completo": "Lyman Spitzer",
  "nome_curto": "Lyman Spitzer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Spitzer/",
  "data_nascimento": "26 June 1914",
  "local_nascimento": "Toledo, Ohio, USA",
  "data_morte": "31 March 1997",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "Lyman Spitzer was an American theoretical physicist and astronomer best known for pioneering the idea of a space telescope. He also worked on nuclear fusion.",
  "biografia": "Lyman Spitzer\nJr parents were Lyman Strong Spitzer\n(\nborn\n2\nFebruary\n1880\n, in Amherst, OH\n)\nand Blanche Carey Brumback\n(\nborn\n4\nMarch\n1885\n, in Ohio\n)\n. His middle name of 'Strong' came from Lyman Strong Spitzer Sr.'s mother Sarah Elizabeth Strong who was married to Adelbert Lorenzo Spitzer. Spitzer Sr. worked in Real Estate in Toledo and later was Manager of a paper and box company. He was a Captain, Quartermaster Corps, during World War I, and almost lived to be\n100\nyears old, dying on\n2\nApril\n1979\n. Lyman Jr attended Scott High School in Toledo and then studied at Phillips Academy in Andover, Massachusetts, graduating in\n1931\n. In the same year he entered Yale University where, in addition to outstanding academic achievements in physics, he was chairman of\nThe Yale Daily News\n. He graduated Phi Beta Kappa in\n1935\nwith a Bachelor's degree in physics. Having won a fellowship to St John's College, Cambridge to enable him to study there during the academic year\n1935\n-\n36\n, he was taught by\nArthur Eddington\nand was strongly influenced by\nSubrahmanyan Chandrasekhar\nwho was about four years older than Spitzer.\nAfter his year abroad, Spitzer returned to the United States and entered Princeton University where he earned his Master's degree in\n1937\n. He undertook research for his doctorate under Henry Norris Russell, and received a Ph.D. in astrophysics in\n1938\n. He then was appointed as a postdoctoral fellow at Harvard, spending the academic year\n1938\n-\n39\nthere before returning to Yale where he was appointed as an Instructor in\n1939\n. Soon after this he married an archaeologist Doreen D Canaday; they had a son Nicholas C and three daughters, Dionis C, Sarah S and Lydia S.\nAfter the start of World War II, Spitzer left Yale to undertake work to help the war effort. He worked first at the Special Studies Group at Columbia, then did underwater sound research with the Sonar Analysis Group that led the development of sonar. In\n1946\nhe returned to university life, being made an associate professor at Yale. Henry Norris Russell, who had supervised Spitzer's doctoral studies at Princeton, was retiring and Princeton was seeking to fill the Chair of Astronomy. Spitzer applied for the position, beginning his covering letter as follows\n[\n3\n]\n:-\nFor many reasons, I believe that the chairmanship at Princeton offers very great opportunities of the sort which interest me, and I would definitely accept an offer from Princeton University if it were along the lines which I visualise, and which I describe below ... The most important aspect of the Princeton opening, from my point of view, is the general policy of the University administration towards the Astronomy Department.\nMy own respect for the astronomy at Princeton in general and for Professor Russell in particular, is so profound that it would be a great personal pleasure for me to come to Princeton under almost any conditions. The very strong support which astrophysics enjoys at Yale, however, would make it very difficult for me to leave New Haven with its effective opportunities for effective research and growth unless the corresponding opportunities at Princeton are at least as great.\nHe was appointed to the chair and took up the position in the spring of\n1947\n. He also became the director of Princeton's Observatory. In the second half of the\n1940\ns Spitzer became interested in space astronomy. He explained in\n[\nL Spitzer, Dreams, stars, and electrons,\nAnnual Reviews of Astronomy and Astrophysics\n27\n(1989)\n,\n1\n-.\n]\n:-\nAs World War II drew to its end, I was approached by a friend on the staff of the RAND corporation, an Air Force 'think-tank'. He told me that his group was carrying out a secret study of a possible large artificial satellite to circle the earth a few hundred miles up. \"Would you be interested,\" he asked me, \"in writing a chapter on how such a satellite might be useful in astronomy?\" With my long and ardent background in science fiction, I found this invitation an exciting one and accepted with great enthusiasm.\nHis involvement in space astronomy has made Spitzer well known by the general public, but he made many other highly significant advances. One area which he founded is the study of the interstellar medium consisting of gas and dust between the stars from which new stars are formed. It was the realisation that the bright stars in spiral galaxies had formed relatively recently from the dust and gas seen in these galaxies which first led him to this work. He described his later significant contributions to this area in his book\nDiffuse Matter in Space\n(1968)\n.\nAnother area to which he made major contributions was plasma physics. He founded the Princeton Plasma Physics Laboratory\n(\ninitially called Project Matterhorn\n)\nin\n1951\nwhich studied how nuclear fusion could be harnessed to give clean energy. He was the first director of the Laboratory, continuing in this role until\n1967\n. He described his contribution to plasma physics in\nPhysics of Fully Ionized Gases\n(1956)\n. W P Allis, reviewing the book, writes:-\nThis book starts with particle orbits in crossed electric and magnetic, and in inhomogeneous magnetic fields. This approach is necessary in discussing containment by magnetic mirrors and the lack of it in a simple torus. A rapid treatment of the\nBoltzmann\nequation, in an appendix, brings us in Chapter\n2\nto the transport equation for a fluid. This is joined with\nMaxwell\n's equations, and the simple limits of high and low magnetic fields are briefly considered. There is a chapter on ... magnetohydrodynamics, and one on waves .... The best chapter deals with encounters between charged particles and the resultant macroscopic phenomena: diffusion, electrical and thermal conductivities, relaxation times for densities and energies. This summarizes some of the author's own researches and the results in that chapter are frequently referred to in papers.\nTwo years later Spitzer published the paper\nThe stellarator concept\ndescribing further results from his Laboratory. He introduced the paper by writing:-\nThe basic concepts of the controlled thermonuclear program at Project Matterhorn, Princeton University, are discussed. In particular, the theory of confinement of a fully ionized gas in the magnetic configuration of the stellarator is given, the theories of heating are outlined, and the bearing of observational results on these theories is described.\nHe then goes on to give further details:-\nMagnetic confinement in the stellarator is based on a strong magnetic field produced by solenoidal coils encircling a toroidal tube. The configuration is characterized by a 'rotational transform', such that a single line of magnetic force, followed around the system, intersects a cross-sectional plane in points which successively rotate about the magnetic axis. A theorem by Kruskal is used to prove that each line of force in such a system generates a toroidal surface; ideally the wall is such a surface. A rotational transform may be generated either by a solenoidal field in a twisted, or figure-eight shaped, tube, or by the use of an additional transverse multipolar helical field, with helical symmetry.\nThe third area which Spitzer helped to shape is that of stellar dynamics. The idea of 'relaxation' had been defined by\nChandrasekhar\nbut it was the work of Spitzer which clarified how\n[\n3\n]\n:-\n... this leads to a stellar structure to approach a singular state, as the effective conduction of heat outward in the star cluster\n(\ncaused by gravitational interactions between pairs of stars\n)\nforces the inner parts to contract more and more rapidly.\nAs with the other areas, he wrote up his contributions as a book,\nDynamical evolution of globular clusters\n(1987)\n.\nIn\n1952\n, Spitzer was named the Charles A Young Professor of Astronomy at Princeton. He was president of the American Astronomical Society\n(1958\n-\n60)\nand chair of the Space Telescope Institute Council\n(1981\n-\n90)\n. He received many honours including: the Henry Norris Russell Prize from the American Astronomical Society\n(1953)\n, the award of the Bruce Medal of the Astronomical Society of the Pacific\n(1973)\nand the Henry Draper Medal of the\nNational Academy of Sciences\n(1974)\n. He was awarded the\nJames Clerk Maxwell\nPrize for Plasma Physics by the American Physical Society\n(1975)\n, and the Gold Medal of the\nRoyal Astronomical Society\n(1978)\n. In\n1979\nhe received the National Medal of Science, then in\n1985\nthe Crafoord Prize of the Royal Swedish Academy of Sciences for\n[\n2\n]\n:-\nFundamental pioneering studies of practically every aspect of the interstellar medium, culminating in the results obtained using the\nCopernicus\nsatellite.\nHe was elected a fellow of the\nRoyal Society of London\nin\n1990\n.\nSpitzer had the vision to propose a space telescope in\n1946\nand was, of course, much involved with the\nHubble\nSpace Telescope. He continued working right up to the day of his death. In fact he was analyzing results from the\nHubble\nSpace Telescope in his office at Princeton on that day, then died suddenly of heart failure in his home.\nThe proposal that the Space Infrared Telescope Facility\n(\nSITF\n)\nbe named the Spitzer Deep Space Observatory was made by Jay Stidolph who wrote:-\nMy suggestion for the renaming of SITF is the Spitzer Deep Space Observatory, named for Dr Lyman Spitzer. Dr Spitzer is, I believe, the father of the modern space based telescope. Dr Spitzer's revolutionary paper, written in the\n1940\ns, was the first to propose the idea of putting telescopes into space, and thus above the blurring effects of the Earth's atmosphere, which not only revolutionised the science of astronomy, but it also pulled back the atmospherically induced blinders we had lived with for so long and revealed the true wonder and beauty of the universe. The hard-won science and images of breathtaking beauty that have been garnered from the\nHubble\nTelescope have helped bring millions of supporters to the space programme and taught us things about the universe which we might never have discovered without it.",
  "matematicos_citados_na_biografia": [
    "Arthur Eddington",
    "Subrahmanyan Chandrasekhar",
    "Boltzmann",
    "Maxwell",
    "Chandrasekhar",
    "National Academy of Sciences",
    "James Clerk Maxwell",
    "Royal Astronomical Society",
    "Copernicus",
    "Royal Society of London",
    "Hubble"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}