{
  "nome_completo": "Madan Lal Puri",
  "nome_curto": "Madan Lal Puri",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Puri/",
  "data_nascimento": "20 February 1929",
  "local_nascimento": "Sialkot, India (now Pakistan)",
  "data_morte": null,
  "local_morte": null,
  "summary": "Madan Lal Puri is an Indian-born statistician whose work in nonparametric statistics and probability theory has had profound effects on the way statistics is understood and applied.",
  "biografia": "Madan Lal Puri\n's parents were Ganesh Das and S W Puri. He was born in Sialkot in the Punjab which was part of India. At this time India was ruler by the British although through the first eighteen years of Puri's life there was increasingly violent Hindu-Muslim conflict and vigorous protests demanding Indian independence. Despite the attempts by the British to offer reforms and concessions, these years saw the inevitable moves towards independence. However, the situation was more complicated for there were compelling Muslim demands for a separate state. In July\n1947\nthe British Parliament passed the Indian Independence Act which created separate countries of India and Pakistan by mid August. The larger part of the Punjab was to be in Pakistan, the smaller eastern part in India. Once the borders were known there was a mass migration and over\n10\nmillion people became refugees. Puri's family were in the region which was to become Pakistan and they fled as refugees to Delhi. Over a million people died in the fighting which ensued but Puri and his family survived.\nPuri was studying mathematics at Punjab University when the split occurred. We should explain that Punjab University was founded in\n1882\nand was based in Lahore but ran colleges in many parts of what was then northern India. After the split in\n1947\ntwo separate universities were created. The Punjab University in Lahore lost those colleges which had ended in India after the lines were drawn, and a new Punjab University in Chandigarh, India, was created to run the these colleges. Puri was awarded his B.A. degree in\n1948\nfrom the Punjab University in India and continued to study there for a master's degree which was awarded in\n1950\n. In January\n1951\nhe was appointed as a lecturer in mathematics at Punjab University of India and he taught mathematics at several different colleges between January\n1951\nand August\n1957\n.\nIn September\n1957\nPuri moved to the United States being appointed as an instructor and graduate student at the University of Colorado in Boulder. After a year he moved to the University of California at Berkeley where he was a research assistant in statistics. There his doctoral studies were supervised by Erich Lehmann and Puri was awarded his doctorate in\n1962\nafter submitting his thesis\nAsymptotic Efficiency of a Class of C-Sample Tests\n. Also in\n1962\n, on\n24\nAugust, Puri married Uma Kapur; they had three children. After the award of his Ph.D., Puri was appointed as an assistant professor at the\nCourant\nInstitute of Mathematical Sciences in New York. Examples of papers he published around this time are:\nAsymptotic efficiency of a class of c-sample tests\n(1964)\n;\n(\nwith S Bhuchongkul\n)\nOn the estimation of contrasts in linear models\n(1965)\n;\nSome distribution-free k-sample rank tests of homogeneity against ordered alternatives\n(1965)\n;\nOn the combination of independent two sample tests of a general class\n(1965)\n;\nOn a class of testing procedures in linear models\n(1965)\n; and\nOn some tests of homogeneity of variances\n(1965)\n.\nIn\n1965\nhe was promoted to associate professor at the\nCourant\nInstitute, then three years later he became a full professor at the Indiana University at Bloomington. He supervised his first doctoral student at New York University while working at the\nCourant\nInstitute, then went on to supervise a further fifteen Ph.D. students at Indiana University. He has a remarkable publication record, publishing over\n3000\npages of papers. MathSciNet contains a list of\n238\nitems authored by Puri. It would be quite impossible in a biography of this type to do more than indicate the main areas to which he contributed. The ten parts which the selection of his papers is divided into in\n[\n3\n]\ngives a good indication of the range of topics which he studied. These are:\nNon-parametric methods in univariate analysis.\nNon-parametric methods in multivariate analysis.\nNon-parametric methods in design and analysis of experiments.\nMiscellaneous topics.\nLimit theorems, rates of convergence and related topics\n(\nindependent case\n)\n.\nLimit theorems\n(\ndependent case\n)\n.\nExtreme value theory.\nTime series and related topics.\nFuzzy set theory and related topics.\nMiscellaneous topics.\nIn\n2003\nPuri was given the newly created title of College of Arts and Sciences Distinguished Research Scholar to recognise the honour bestowed by the publication of\n[\n3\n]\n. Kumble Subbaswamy, dean of the College of Arts and Sciences at Indiana University, Bloomington, gave this appreciation of Puri's contributions:-\nOn February\n20\nat a dinner in his honour, it was my great pleasure to honour Madan Lal Puri as College of Arts and Sciences Distinguished Research Scholar. This rare designation is reserved for those who have become world leaders in a field while on the College faculty, and whose collected works are published because of their archival value. The medal with which Professor Puri was adorned is testimony to his scholarly contributions to the world of statistics and to Indiana University over his illustrious career. Professor Puri's research has lead to his being considered one of the most versatile and prolific researchers in the world in mathematical statistics in the areas of nonparametric statistics, order statistics, limit theory under mixing, time series, splines, tests of normality, generalized inverses of matrices and related topics, stochastic processes, statistics of directional data, random sets, and fuzzy sets and fuzzy measures. Indeed, Professor Puri is to be commended for the 'Puri-Sen Era' in mathematical statistics. A scholar's work is never complete, and Professor Puri has certainly proved that by giving of himself in organizing international conferences and serving as editor-in-chief of the Journal of Statistical Planning and Inference.\nMoya Andrews, dean of the faculties at Indiana University, Bloomington, said:-\nHis work in nonparametric statistics and\nprobability theory\nhas had profound effects on the way statistics is understood and applied. The methodology that he developed in the statistical design and analysis of experiments has paved the way for the development of clinical designs, epidemiological investigations and environmental studies. Madan Puri's name would be found on almost any statistician's list of three outstanding contributors to the world of nonparametric statistics. No one in the whole world has worked in as many aspects of this field as he has.\nPuri has received a great many honours for his outstanding contributions to statistics and we mention only a few. He was elected a member of the International Statistical Institute, a fellow of the Institute of Mathematical Statistics, a fellow of the\nAmerican Statistical Association\n, and a fellow of the\nRoyal Statistical Society\n. In\n1975\nthe Punjab University in India awarded him a D.Sc. Puri twice received the Senior U.S. Scientist Award from the Alexander von Humboldt Foundation in Germany, in\n1974\nand in\n1983\n. In\n1974\nhe was honoured by the German government:-\n... in recognition of past achievements in research and teaching.\nHe was also a Distinguished Visitor at the London School of Economics and Political Science in\n1991\n.",
  "matematicos_citados_na_biografia": [
    "Courant",
    "probability theory",
    "American Statistical Association",
    "Royal Statistical Society"
  ],
  "imagens": [
    "puri.jpg"
  ]
}