{
  "nome_completo": "'Mamphono Khaketla",
  "nome_curto": "'Mamphono Khaketla",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Khaketla/",
  "data_nascimento": "5 March 1960",
  "local_nascimento": "Maseru, Basutoland (now Lesotho)",
  "data_morte": null,
  "local_morte": null,
  "summary": "'Mamphono Khaketla is a Lesotho mathematician who became a lecturer in mathematics at the National Teacher Training College. She has served in the Lesotho government, holding positions such as Minister of Education and Training.",
  "biografia": "'Mamphono Khaketla\n's parents were Bennett Makalo Khaketla\n(1913\n-\n2000)\nand Caroline Ntseliseng 'Masechele Khaketla\n(1918\n-\n2012)\n. To understand 'Mamphono Khaketla's life we need to look at her background, particularly at her parents lives.\nBennett Makalo Khaketla was born in Qacha's Nek, a mountainous region of what was then called Basutoland and is now known as Lesotho. After his early education in Lesotho, he moved to South Africa where he qualified as a primary school teacher at Mariazell. He taught at St Patrick's Anglican School in Bloemfontein from\n1933\nto\n1939\nand then at various schools in Lesotho and in South Africa. He received a B.A. in politics after completing a correspondence course with the University of South Africa. At the Morija Training College he met Caroline Ntseliseng 'Masechele and they married in January\n1946\n.\nCaroline Ntseliseng 'Masechele Khaketla, originally Caroline Ramolahloane, was born in the Berea district of Lesotho. She obtained a BA degree from Fort Hare University College in\n1941\nhaving studied education. She taught in Thabana Girls' School then went to Morija Training College where she met Bennett Makalo Khaketla. They both taught at Basutoland High School in Morija but he was dismissed for political activities so they went to Nigel in South Africa where Khaketla was the principal of Charterson High School. After they returned to Lesotho in\n1953\n, he embarked on a political career and she went back to teaching at Basutoland High School. Later in around\n1959\nshe opened an experimental school, the 'Iketsetseng Private School', in Maseru. She wrote eleven books and served on the council of the National University of Lesotho.\nBennett Makalo Khaketla published two novels, three plays and a collection of poems between\n1945\nand\n1954\n. He became highly involved in politics, in particular challenging the legitimacy of the British colonial rule. He founded and became the editor of the major militant Lesotho periodical\nMohlabani\nin\n1954\n. He also wrote further books including\nLesotho\n1970\n: An African Coup under the Microscope\n. He was a highly active opponent to Leabua Joseph Jonathan who ruled Lesotho from\n1966\n(\nwhen the country became independent\n)\nto\n1986\n. Bennett Makalo Khaketla's book\nLesotho\n1970\ndetailed the alledged brutalities of Jonathan and the book was banned in Losotho.\nThe Khaketlas had six children, four sons and two daughters, the eldest being Sechele Khaketla who became a pianist. Another brother Maieane Khaketla became an Anglican priest who, over the years, has been suspended and arrested.\n'Mamphono Khaketla attended her mother's 'Iketsetseng Private School' both for her primary and for her secondary education. She received the Cambridge Overseas Certificate at Maseru Day High School before going to the Lesotho National Teacher Training College in Maseru. This is the only government-owned teaching training college in Lesotho. She took two of the programmes the College offered, the one leading to the Secondary Teachers Certificate and the one leading to the Diploma in Education. After the award of the Certificate, Khaketla entered the National University of Lesotho which is in Roma, about\n35\nkm southeast of Maseru. This university was established in\n1975\non the Roma campus of the University of Botswana, Lesotho and Swaziland which had been given this name after independance in\n1966\n.\nAfter the award of a Bachelor of Education in\n1980\nand the Diploma in Education in\n1982\n, Khaketla went to the United States where she studied at the University of Wisconsin-Madison. She was awarded the Madison Vilas Fellowship in\n1988\n. Two publications in\n1989\nwere\nThe alignment of six standardized tests with the NCTM standards\ndelivered at the National Summit on Mathematics Assessment convened by the Mathematical Sciences Education Board, Washington, DC, and\nAn examination of six standard mathematics tests for grade eight\npublished by the National Center for Research in Mathematical Sciences Education. Both of these were three author works with, as well as Khaketla, Thomas A Romberg who was her thesis advisor and Linda Wilson.\nKhaketla was awarded a Ph.D. in\n1991\nfor her thesis\nAn analysis of the Lesotho Junior Certificate Mathematics Examination and its impact on instruction\n. The Acknowledgements in this thesis give us some further interesting background information:-\nThe list of people who made it possible for me to undertake this study is so long that it can stretch from Madison to Maseru. It will suffice therefore to say thank you to all of you who in many different ways contributed to my studies at UW-Madison. First, Professor Thomas Romberg, who not only worked as my advisor but also provided me with the opportunity to work with him at the Wisconsin Center for Educational Research. A valuable experience indeed. Many thanks to the other members of my committee: Professors Walter Secada, Margaret Meyer, Elizabeth Fennema, Michael Subkoviak and Colleen Moore. Special thanks go especially to Colleen and Mike for undertaking this task at such short notice. I would also like to thank all the friends I made in social, academic and religious circles in Madison, without whose support my stay here would have been miserable. You know who you are folks! Thanks. A special thank you goes to Jim Middleton and Katim Touray, who were my computer consultants. To those people in Lesotho who responded to my unending requests for information, especially: Dr E M Sebatane, Mr P M Pule of the examinations Council, my brother, Motloheloa, and all my colleagues at the Lesotho National Teacher Training College. To all those who kept those letters rolling in to keep me informed of the happenings at home, I extend my heartfelt thanks, especially to Tseliso, Khahliso, Mahlape and 'Mamotsamai. Special thanks go to J L Ramokhoro who helped with the data analysis. This study would not have materialized had it not been because of the support I received from the principals and teachers of the schools in the sample. My thanks goes to them too. Without the financial support of the African American Institute and Professor T A Romberg, I would never have made it to Madison. Thanks to Anita Johnson, my program coordinator at the African American Institute and to Mpho Ndebele, the African American Institute representative in Lesotho. My appreciation also goes to the government of Lesotho, through its ministry of education for granting me a leave of absence to pursue my studies. I would like to end by saying a big and special thank you to my parents who are always there for me; for having faith in me and letting me be who I am.\nAfter the award of her doctorate, Khaketla returned to Lesotho where she was appointed as a lecturer in mathematics at the Lesotho National Teacher Training College in Maseru in\n1991\n. Along with the co-authors Thomas A Romberg, Linda Wilson and Silvia Chavarria, Khaketla published the paper\nCurriculum and Test Alignment\nas a chapter in the book\n[\n1\n]\n, pages\n61\nto\n74\n. Here is the Abstract of the paper:-\nThe purpose of this chapter is to report on information gathered from two studies related to the reality of Evaluation Standard\n1\n: Alignment of the NCTM 'Standards'. In the first study, the six standardized tests most widely used at state and district levels in schools in the United States are examined to determine whether or not they are appropriate instruments for assessing the content, process, and levels of thinking called for in the 'Standards'. The results show that the tests are not appropriate. They are found to be generally weak in five of the six content areas and in five of the six process areas. Furthermore, the tests place too much emphasis on procedures and not enough on concepts. In the second study, we conduct an examination of items and tests from newly developed state tests and foreign tests. It is clear that there are test items currently in use and some being developed that provide the kind of breadth of content and depth of knowledge cited in the 'Standards'.\nThe\n5\nth BOLESWA Educational Research Symposium was held Maseru from\n12\nJuly to\n16\nJuly\n1993\nand Khaketla published\nTheory and practice in educational research\nwhich appeared in the\nProceedings\nof the Symposium in\n1995\n. Khaketla remained at the National Teacher Training College until\n1996\n, being by this time assistant director of the college. Leaving the Training College, she worked at the Institute of Development Management in Lesotho and Botswana from\n1996\nto\n2001\n. She was appointed as the director of the Centre for Accounting Studies in\n2001\nand held this post for a year. She retained her interest in mathematical education during this period; the paper\nThe design and evaluation of exemplary curriculum materials in mathematics\nwhich she wrote jointly with Dick Slettenhaar was presented to the\n11\nth Annual Meeting of the Southern African Association for Research in Mathematics, Science and Technology Education held at the University of Eswatini in Kwaluseni, Swaziland from\n12\nJanuary\n2003\nto\n15\nJanuary\n2003\n.\nPakalitha Mosisili\n(\nborn\n14\nMarch\n1945)\nbecame Prime Minister of Lesotho in May\n1998\nwhen he led the Lesotho Congress for Democracy to victory in elections. Accused of vote rigging by the opposition, there followed a difficult period with mass protests. In May\n2002\nelections were held and again the Lesotho Congress for Democracy was victorious so Pakalitha Mosisili remained as Prime Minister. Forming a new National Assembly at this time he invited Khaketla to serve as Minister of Communications, Science and Technology. Splits in the Lesotho Congress for Democracy led to National Assembly being dissolved in November\n2006\nand elections were held in February\n2007\n. Khaketla lost her seat in this election but was elected to the National Assembly as one of the Lesotho Congress for Democracy members on a party list for proportional representation submitted by the National Independence Party which was allied to the Lesotho Congress for Democracy. Mosisili now appointed Khaketla as the Minister of Education and Training, a position she held until\n2012\n. On\n28\nFebruary\n2015\na snap election was held and, with the aid of coalition partners, Mosisili again became Prime Minister. On\n30\nMarch\n2015\nKhaketla was appointed Minister of Finance and, in November\n2015\n, she presided over the\n102\nnd session of the African, Caribbean and Pacific Group of States Council of Ministers. A collapse in the seven party coalition saw new elections in June\n2017\nin which the Lesotho Congress for Democracy was defeated. This collapse in the coalition was caused by problems which had Khaketla at its centre.\nThe political difficulties arose through accusations that Khaketla had used her position to demand a large bribe to ensure that the contract for the government's fleet was awarded to Lebelonyane Fleet Solutions Joint Venture. This complex of accusations and counteraccusations is perhaps best summarised in\n[\n3\n]\n:-\nManagement of the government fleet has over the last three years been one of Lesotho's biggest headaches and reportedly contributed significantly to the collapse of the previous seven party coalition government led by former Prime Minister Pakalitha Mosisili. The then finance minister Dr 'Mamphono Khaketla was accused of soliciting a M\n4\nmillion bribe from the directors of Lebelonyane Fleet Services in exchange for a government fleet tender. Dr Khaketla denied the allegation. The Directorate on Corruption and Economic Offences insists Khaketla allegedly solicited a bribe in exchange for a government fleet tender. Khaketla, together with her co-accused, Thabo Napo solicited the bribe from Lebelonyane Fleet Solutions Joint Venture on March\n17\n,\n2016\n, the anti-corruption body asserts. According to the charge sheet, Khaketla in common purpose with her \"friend and/or partner\" Napo attempted to solicit a bribe of about M\n4\nmillion from Lebelonyane in exchange for a government fleet tender, also known as Lesotho \"fleetgate\" which was eventually awarded to Bidvest Bank. The Directorate on Corruption and Economic Offences adds Khaketla was to use her powers and position as minister of finance to influence and ensure that the tender is awarded to Lebelonyane. The duo is out on bail of M\n5000\nbail and they have to report to the offices of the Directorate on Corruption and Economic Offences on the last Friday of every month. Lebelonyane, which had been recommended by the government's bid evaluation team during the Mosisili administration as the winning bidder for the lucrative contract to manage the government fleet, was never awarded the tender. Instead, the government announced that the existing contract held by South African company Bidvest, had been extended for four years.\nWe note that\n[\n5\n]\n:-\nKhaketla, who was later reshuffled to the Foreign Affairs portfolio, has vehemently denied allegations of corruption and even sued some of her accusers for\n6\nmillion miLoti\n(\n$\n455\n000)\nfor alleged defamation.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "thumbnail.jpg"
  ]
}