{
  "nome_completo": "Margaret Barr Moir",
  "nome_curto": "Margaret Barr Moir",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moir/",
  "data_nascimento": "7 July 1883",
  "local_nascimento": "Cairneyhill, Fife, Scotland",
  "data_morte": "25 March 1975",
  "local_morte": "South Croydon, London, England",
  "summary": "Margaret Barr Moir was a Scottish mathematical physicist who became a lecturer in mathematics at the University of Western Australia in Perth. She may be the first woman appointed as a university lecturer in mathematics in Australia. She lost her job after the University had to make substantial cut-backs following the Great Depression.",
  "biografia": "Margaret Barr Moir\nwas the daughter of John Moir and Mary McMurchy. John Moir had been born in Glasgow on\n16\nApril\n1848\n, the son of John Moir, spirit merchant, and his wife Catherine Duncan. He studied at the University of Glasgow and graduated with an M.A. in\n1870\n. He then studied divinity at the University of Glasgow and graduated with a B.D. in\n1874\n. He became a United Presbyterian Church Minister at Cairneyhill, Fife, in\n1876\n. He married Mary McMurchy in Paisley in\n1881\n. She had been born in Paisley on\n17\nAugust\n1851\n, the daughter of James McMurchy and Margaret Barr. John and Mary Moir had five children: Margaret Barr Moir\n(\nborn\n1883)\n, the subject of this biography, John Moir\n(\nborn\n1885)\n, Catherine Douglas Moir\n(\nborn\n1887)\n, James McMurchy Moir\n(\nborn\n1889)\nand Mary Moir\n(\nborn\n1891)\n. Before we give details of Margaret Barr Moir, let us give some details about other members of her family.\nJohn Moir, Margaret's father, continued as a United Presbyterian Church Minister at Cairneyhill until his death there on\n4\nJuly\n1895\n. His wife Mary died two years later on\n10\nJune\n1897\n. Margaret's brother John died on\n1\nJune\n1892\nwhen seven years old. Catherine, born\n7\nJanuary\n1887\n, studied at the University of Glasgow and graduated with an M.A. in\n1911\n. She married Eric Wilfred Mackay in Hillhead, Glasgow in\n1921\n. James McMurchy, born\n17\nOctober\n1889\n, studied at the University of Glasgow. He graduated was an M.A. in\n1908\nand became an Insurance Clerk living at\n7\nKelvinside Terrace, West, Glasgow. He worked for the Scottish Amicable Life Assurance Society at Glasgow and Manchester. Later, he resided at\n231\nWilton Street Glasgow and\n14\nDoune Terrace, Glasgow. He was a\n2\nnd Lieutenant in the\n1\nst Black Watch\n(\nRoyal Highlanders\n)\nin World War I, and was killed in action on\n25\nSeptember\n1915\nin France. Mary Moir was born on\n19\nMay\n1891\n.\nMargaret Moir studied at the Glasgow High School for Girls. This school had been founded in\n1894\nin the building of Garnethill School and extended in\n1898\n. She graduated from the school in\n1902\nand looked to continue her education. This was a time when higher education for girls was becoming established in Glasgow. The\n[\n1\n]\n:-\n... Glasgow Association for the Higher Education of Women was founded\n[\nin\n1877]\nwith a view to offer to women opportunities of study and general culture, as well as to prepare girls for teaching and other professions. ... The Association organised a University Higher Local Certificate for Women aimed at establishing standards for women which would prove acceptable to Glasgow University. It offered teaching as near as possible to that given to men in the Arts Faculty of the University, with lectures given in University classrooms although the Association also rented an office, classroom and reading-room in St Andrew's Hall at Charing Cross, Glasgow. In\n1883\n, the Association was incorporated under the Companies Act as Queen Margaret College, for the education exclusively of women. ... The classes were organised on University lines and the subjects for the MA degree were taught and examined although degrees were not then open to women. ... The College joined with the University of Glasgow in\n1892\nwith the University assuming responsibility for the administration, staffing and maintenance of the College.\nMoir studied at Queen Margaret College for two years,\n1902\n-\n04\n, where she was awarded distinction in mathematics and sciences. For most of the women studying at Queen Margaret College, they were looking to be teachers. Moir, however, had higher aims and in\n1904\nshe began studying for an M.A. at the University of Glasgow. At this time the M.A. was the standard first degree at a Scottish university and this tradition has been maintained to this day. In current times a student would, typically, study for an M.A. if they were an arts student or a B.Sc. if their interests were science. Around\n1900\n, however, it was quite typical for a student to study first for an M.A. and then, after graduating, take specialist science subjects for a B.Sc. This is what Moir did, graduating with an M.A.\n(\nClass I\n)\nin Mathematics and Natural Philosophy in\n1907\nand then a B.Sc.\n(\nDist\n)\nwith special distinction in mathematics, physics and astronomy in\n1909\n.\nAfter these two degrees, in\n1909\nMoir began undertaking research supervised by\nAndrew Gray\nand supported by Carnegie Research Scholarships. She was Carnegie Research Scholar in sessions\n1909\n-\n1910\nand\n1910\n-\n1911\n, then after two years she was elected to a Carnegie Research Fellowship which she held in\n1911\n-\n1912\n,\n1912\n-\n1913\nand\n1913\n-\n1914\n. During this time, she published five papers\nOn the Influence of Temperature upon the Magnetic Properties of a Graded Series of Carbon Steels\n(1912)\n,\nThe Effect of Thermal Treatment and the Effect of Longitudinal Strain in inducing a Sensitive State in certain Magnetic Materials\n(1914)\n,\nThe magnetic properties of a graded series of chrome steels at ordinary and low temperatures\n(1914)\n,\nPermanent magnetism of certain chrome and tungsten steels\n(1914)\n, and\nPermanent magnetism of certain chrome and tungsten steel\ns\n(1914\n-\n15)\n. The full references for these papers are given in\n[\n4\n]\n,\n[\n5\n]\n,\n[\n6\n]\n,\n[\n7\n]\n, and\n[\n8\n]\n. In these papers she gives her affiliation as 'Carnegie Research Scholar in the University of Glasgow'. In each of these papers she acknowledges the help of\nAndrew Gray\nand\nJames Gordon Gray\n; typical is the acknowledgement in\n[\n4\n]\n:-\nThe work described in the present paper was carried out in the Natural Philosophy Institute of the University of Glasgow. The author desires to express her thanks to Professor\nA Gray\nand to Dr\nJ G Gray\nfor the interest they have taken in the progress of the experiments.\nAndrew Gray\nhad studied at the University of Glasgow then became an assistant to\nWilliam Thomson\nand Eglinton Fellow in Mathematics. After serving as Professor of Physics at the University College of North Wales, he returned to Glasgow in\n1899\nwhen he succeeded\nKelvin\nas Professor of Natural Philosophy. He was the father of the mathematician and physicist\nJames Gordon Gray\nwho became a lecturer in natural philosophy at the University of Glasgow in\n1904\n.\nFor extracts from some of the above papers, see\nTHIS LINK\n.\nIn\n1914\nMoir submitted a thesis\n[\n9\n]\nfor the degree of D.Sc. to the University of Glasgow basically consisting of the first four of her papers we listed above. The thesis begins:-\nThe following thesis is an account of researches which have been carried out during the past four years in the Physical Institute of Glasgow University. These researches all deal with the general subject of the magnetisation of iron and various steels, but the following special branches of the subject have been particularly investigated:\n(\na\n)\nthe influence of temperature on the magnetic properties of a graded series of carbon steels.\n(\nb\n)\nThe effect of thermal treatment and the effect of longitudinal strain in inducing a sensitive state in certain magnetic materials.\n(\nc\n)\nThe magnetic properties of a graded series of chrome steels at ordinary and low temperatures, and\n(\nd\n)\nThe permanent magnetism of chrome steels. Under these four headings therefore, I shall describe the work.\nDuring the five years that Moir undertook this research she had been supported by the Carnegie Trust and their annual report of\n1915\n-\n16\nstates\n[\n12\n]\n:-\nAfter holding a Carnegie Scholarship for two years Miss Moir was elected to a Fellowship in\n1911\n, which has since been twice renewed. During the whole of that time she has been engaged in an investigation of the properties of magnetic materials under varying conditions of temperature and strain on which Miss Moir was engaged during the first two years of her tenure of a Fellowship was given in the Report for the quinquennial period\n1908\n-\n13\n. On her election for a third year in recognition of the excellence of her work, she continued an investigation which had previously been begun on chrome steels, an account of which forms the subject of the above paper in the Philosophical Magazine. Afterwards she engaged in an investigation of the permanent magnetism of a graded series of tungsten  steels supplied by Sir W G Armstrong, Whitworth and Co, testing them under varying conditions with special reference to the influence of vibration and alternate heating and cooling on the permanence of the magnetism. An account of this work also has been published in the 'Philosophical Magazine'.\nThe Carnegie Trust's annual report of\n1913\n-\n14\nstates\n[\n11\n]\n:-\nThe University of Glasgow has recently placed its imprimatur on the work of Miss Margaret B Moir by awarding her the degree of Doctor of Science for a thesis based on her investigations on the influence of temperature upon the magnetic properties of steels. Miss Moir devoted herself with unremitting zeal and conspicuous success to the study of this question during the whole period of five years for which she was a beneficiary of the Trust.\nTo end our discussion of her research at Glasgow, let us quote from Graeme Gooday\n[\n1\n]\n:-\nThe most powerful endorsement of Sklodowska Curie's work came from Silvanus Thompson in a paper he read at a meeting of the IEE in Glasgow in\n1912\n. ... it became the standard reference work on permanent magnets. Most authors thereafter referred to Sklodowska Curie's results by citing Thompson rather than referencing her original paper. While effectively assimilating the results of Curie's work into mainstream research on magnets, Thompson's work rather ironically upstaged it. For example, in\n1914\nDr Margaret Moir, research fellow at the University of Glasgow, published a piece on tungsten and chromium magnets that was primarily a response to Thompson's work, simply commenting in passing that her work refined that of \"Mdme\n(\nsic\n)\nCurie\" by noting that the optimum proportion of chromium for permanence depended on a magnet's length to breadth ratio\n(\nMoir,\n1914\n-\n15\n,\n385\n-\n86)\n.\nAfter completing her D.Sc., Moir was appointed as a teacher at Manchester High School for Girls. This independent school, founded in\n1874\n, was the first school in the north of England to provide an academic education for girls. Moir was there when her brother was killed in action on\n25\nSeptember\n1915\nand her address is given at that time as\n19\nCresswell Grove, West Didsbury, Manchester. She is listed as a Departmental Mistress at this school in each year from\n1914\nto\n1919\nbut she was granted a leave of absence\n[\nwe think around\n1915]\nfor several months to work for the Admiralty as an assistant physicist at the Mining School in Portsmouth in the application of physics to submarine mining.\nAlexander David Ross\n(1883\n-\n1966)\nwas born and brought up in Glasgow where, in\n1911\n, he was elected President of the Scottish Branch of the British Astronomical Association. In the following year he was elected to the combined Chair of Mathematics and Physics in the University of Western Australia. In\n1929\nthe chair was separated into distinct Chairs of Mathematics and Physics, and Ross became Professor of Physics and\nCharles E Weatherburn\nwas appointed as Professor of Mathematics. Moir was appointed as a temporary lecturer and an assistant to A D Ross at the University of Western Australia in\n1925\n. That she should go to Perth, Australia, is not entirely surprising since many had emigrated from Scotland to Western Australia in the second half of the\n19\nth century, in particular quite a few from Fife, including a number of members of the Moir family. There is, too, the link with Ross and the University of Glasgow.\nOn\n13\nFebruary\n1925\n, Moir departed from London, England, on the ship\nMongolia\nof the Peninsular and Oriental Steam Navigation Company bound for Fremantle, Australia. In\n1925\nshe was recorded as a lecturer living at\n989\nHay Street, West Perth, Perth, Western Australia, Australia. Three years later, in\n1928\nshe was still recorded as a lecturer living at\n989\nHay Street, West Perth, Perth, Western Australia, Australia. In\n1928\nthe Department of Mathematics and Physics splits into a Department of Physics and a Department of Mathematics.\nAn International Oceanography Congress was due to be held in Seville, Spain, in the first week of May\n1929\n. Moir requested leave of absence to research the teaching of mathematics in the USA and Britain, and to attend the Seville conference as a representative of the University of Western Australia. Her request was granted and, in February\n1929\n, she left Sydney, Australia, on the ship\nNiagara\nbound for Vancouver, British Columbia, Canada. On\n1\nMarch\n1929\nshe arrived in Canada, having travelled via Auckland, New Zealand, giving the information that she was travelling to London, England, via Canada and the USA. She stated that her nearest relative was her sister Mrs MacKay in Glasgow; that is her sister Catherine who married Eric Wilfred Mackay in Hillhead, Glasgow in\n1921\n.\nWe have no information about where she visited in the United States as part of her research on the teaching of mathematics there, but having travelled from Vancouver to New York, she sailed on the\nAlaunia\nof the Cunard Steamship Company from New York to London, arriving on\n16\nApril\n1929\n. She then went to Seville, Spain, to attend the International Oceanography Congress which was held\n1\n-\n7\nMay in the Palacio de la Plaza de Espana\n[\n16\n]\n:-\n... an attendance by\n129\nscientists hailing from\n35\ncountries comprising the Americas, central Europe and such distant countries as Australia, China and Japan was achieved. On the oceanographic side, the most significant contributions were in the field of physics, notably, general oceanic ow, seasonal oceanic temperature variations, plus the first world-wide-presentation of the valued Helland-Hansen method\n(\nthe Temperature Anomaly Method\n)\n.\nAgain we have no information about where she visited in Britain as part of her research on the teaching of mathematics there, but in\n25\nFebruary\n1930\nshe arrived in Fremantle, Western Australia on the ship\nMongolia\nhaving sailed from London. Back at the University of Western Australia in Perth, she was now in the Department of Mathematics. The Mathematics staff consisted of a professor,\nCharles E Weatherburn\n, two lecturers R D Thompson and Margaret Moir, an Assistant lecturer A A Orton and a demonstrator W D Everson. Although we are not certain of this, we believe that Moir became Australia's first female lecturer in mathematics. In\n1931\nshe was recorded as a lecturer living at\n35\nMalcolm Street, West Perth, Perth, Western Australia, Australia.\nThe University of Western Australia hit hard times financially during the Great Depression. The Depression began in\n1929\nand in\n1931\na policy was made requiring Australian Federal and State governments to cut spending by\n20\n%. In December\n1931\nMoir lost her position as a result of a lack of funds due to the\n20\n% cut. In\n1933\nshe departed from Fremantle, Australia on the\nMongolia\nof the Peninsular and Oriental Steam Navigation Company which had sailed from Brisbane calling at Melbourne, Adelaide, Fremantle, where she boarded, then continuing to Colombo, Bombay, Port Sudan, Port Said and Marseilles before arriving in London on\n7\nApril\n1933\n.\nIn\n1939\nWorld War II broke out. Moir was living Godstone, Surrey, England and records of the time give her occupation as University Lecturer Retired, and ARP Warden unpaid. An ARP\n(\nAir Raid Precautions\n)\nWarden had a variety of duties such as seeing the blackout was observed, helping people to air raid shelters when an air raid was taking place, and supporting people whose property had been destroyed. She continued to live in London and at the time of her death in\n1975\nshe was living at\n37\nCroham Manor Road, South Croydon.",
  "matematicos_citados_na_biografia": [
    "Andrew Gray",
    "James Gordon Gray",
    "A Gray",
    "J G Gray",
    "William Thomson",
    "Kelvin",
    "THIS LINK",
    "Charles E Weatherburn"
  ],
  "imagens": []
}