{
  "nome_completo": "Marie-Louise Dubreil-Jacotin",
  "nome_curto": "Marie-Louise Dubreil-Jacotin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dubreil-Jacotin/",
  "data_nascimento": "7 July 1905",
  "local_nascimento": "Paris, France",
  "data_morte": "19 October 1972",
  "local_morte": "Paris, France",
  "summary": "Marie-Louise Dubreil-Jacotin was a French mathematician who worked in fluid mechanics and abstract algebra. She was the second woman in France to obtain a doctorate in pure mathematics.",
  "biografia": "Marie-Louise Dubreil\n's name before she married was Marie-Louise Jacotin. Her father, M Jacotin, trained in law and was the head of the legal department in a French bank. Her mother was the daughter of M Rodon, who was a glass-blower from Briare in Loiret, although the family were originally of Greek origin. It was from her mother that Marie-Louise received her early education, in particular in singing and painting\n[\n2\n]\n:-\n... leading to a remarkable intellectual blossoming at the cost of, perhaps, a certain neglect of addition, multiplication and spelling ...\nMarie-Louise's father put her name down for a place at the newly opened Jules-Ferry Lycée and there her brilliance was noticed by her teachers, especially the mathematics teacher who was the sister of\nÉlie Cartan\n. Marie-Louise took the baccalaureate in elementary mathematics and at this stage encountered a particularly good piece of luck. One of her best friends in her class at school was Denise Coulom who was the daughter of the head of the Collège de Chaptal. This College, named after the French chemist Jean-Antoine-Claude Chaptal, had special mathematics classes to which girls were not allowed entry, but M Coulom was persuaded by his daughter to make an exception in the case of Marie-Louise. At this school she was taught with the exceptional mathematics teacher George Milhaud.\nOften one piece of good fortune is balanced by bad fortune and in the case of Marie-Louise's study at the Collège de Chaptal this was exactly what happened. Her father had been ill for some time and the strain of seeing him nearing the end of his life made it difficult for her to take full advantage of the opportunity the school gave her. When she took the university entrance examinations she did not do sufficiently well to gain a place in Paris and was only given a Bourse de licence which allowed her to enter higher education outside Paris. She was persuaded by Milhaud to spend another year at the College and try again to gain entry to the École Normale Supérieure.\nAfter coming top of her class in session\n1925\n-\n26\nshe sat the entrance examinations in\n1926\nand was ranked second\n[\n2\n]\n:-\nThe ranking was published with the official note: \"The nomination of the students to the École Normale Supérieure will be by order of rank\". But the decree of the ministry published afterwards in the official journal named twenty male students at the top and then Marie-Louise at the head of the Bousiers de licence. This decree had moved her down to\n21\nst  place. She expressed her \"sad disappointment\" to the Minister of Public Instruction and Fine Arts, Édouard Herriot\n(1894)\n. She asked to be allowed to attend the École Normale Supérieure as an extra day pupil or, if that were not possible, to take courses at the school so as not to lose \"the minimum benefit of her rank of admission.\"\nThen Jacotin had a second piece of luck which came about through another of her friends who had been in the same class at the Jules-Ferry Lycée. Her friend Simone Hauser was the daughter of Fernand Hauser, an editor of the Journal of the École Normale Supérieure. He took up the case with Herriot and he discussed it with Cavalier who had recently been appointed as Head of Higher Education. He was clear as to what must happen\n[\n2\n]\n:-\nI do not know who has done this. What is certain is that Mlle Jacotin was second in the examination for the École Normale Supérieure and that she is a pupil of this school ... But she should be careful. She is going to create a precedent and traditions. On her will depend what we will be able to decide concerning future candidates.\nFurther pressure on the administration to justify their decision to prevent Mlle Jacotin studying at the École Normale Supérieure resulted in them backing down, and she was given a place to study in Paris. She was able to begin her studies in\n1926\n, although it took until February of the following year before she was able to formally matriculate. Two other members of her class at the École\n(\nwith biographies in this archive\n)\nwent on to become famous, namely\nJean Leray\nand\nClaude Chevalley\n. Jacotin attended lectures on fluid mechanics by Villat at the Sorbonne and lectures the Collège de France.\nLebesgue\nand\nHadamard\nwere among the lecturers who taught her during her outstanding three undergraduate years. Jacotin graduated in\n1929\n.\nErnest Vessiot\n, Director of the École Normale Supérieure, arranged a scholarship for Jacotin to undertake research. She had been attracted by the course on fluids given by Villat and he now advised her to go to Oslo to study with\nVilhelm Bjerknes\nwho had been appointed to the chair of applied mechanics and mathematical physics at the University of Oslo three years earlier. Bjerknes had published his most important work\nOn the Dynamics of the Circular Vortex with Applications to the Atmosphere and to Atmospheric Vortex and Wave Motion\nin\n1921\nand at the time that Jacotin visited him he was working on a project to write a large textbook on theoretical physics which he hoped Jacotin would translate into French. It was a project that\nBjerknes\nnever completed.\nJacotin returned to Paris where she married\nPaul Dubreil\non\n28\nJune\n1930\n.\nPaul Dubreil\n, whom Marie-Louise had met while they both studied at the École Normale Supérieure, had been awarded a Rockefeller scholarship in\n1929\nand at the time of their marriage was on a European tour which would let him study with the top mathematicians in Germany and Italy. After her marriage Dubreil-Jacotin went with her husband to Hamburg, Frankfurt, Rome and Göttingen. She met\nEmmy Noether\n, whom she would later pay tribute to in her article\nPortraits of women mathematicians\n, and in Rome during the winter term of\n1930\n-\n31\nshe met\nLevi-Civita\nwho was working on similar problems in fluid mechanics which interested her\n[\n2\n]\n:-\nShe told him about an important difference between the irrotational wave he had just described\n(\nof a ideal liquid with a free surface\n)\nand a rotational wave which\nGerstner\nhad described a long time before\n(\nthe cycloidal wave\n)\n. This provokes a movement of mass in deep layers.\nLevi-Civita\n, surprised and interested, encouraged her to continue her studies. She established the existence of an infinity of waves, those of\nGerstner\nand\nLevi-Civita\nbeing two examples. This would be her thesis. Its importance and that of her work on the theory of waves meant that she extended work on it until\n1935\n.\nIn the summer of\n1931\nDubreil-Jacotin and her husband spent a term at Göttingen where they involved themselves in the vigorous research groups led by\nHilbert\nand\nWeyl\n. At the start of the new academic year\n1931\n-\n32\nPaul Dubreil\ntook up an appointment at the University of Lille and Marie-Louise continued to work on her thesis on fluids but began to take an interest in algebra. In\n1934\nshe defended her thesis in Paris:-\nThe jury was presided over by\nErnest Vessiot\n. The other members were\nGaston Julia\nand Henri Villat.\nJacques Hadamard\ncame to help with the defence and to sit at her side.\nDubreil-Jacotin's interests in algebra had now reached the point where she offered it as a subsidiary subject at her oral. Following the award of a doctorate she went to Nancy where\nPaul Dubreil\nnow had an appointment at the University. It would have made sense for the University of Nancy to employ Dubreil-Jacotin too, but they did not wish to employ a husband and wife in the same department. Dubreil-Jacotin, therefore, accepted a position of research assistant at Rennes.\nOn\n22\nSeptember\n1936\nthe Dubreils' daughter Edith was born. Two years later Dubreil-Jacotin was appointed as an assistant lecturer at Rennes. From\n1939\nto\n1943\nshe was an assistant professor at Lyon but also taught courses at Rennes. Lesieur writes that in October\n1943\n[\n3\n]\n:-\n... she became a full professor at Poitiers where in\n1955\nshe held the chair in Differential and Integral Calculus. It was at Poitiers that I knew her. I am able to confirm that she began the development of this maths department where she amply filled her role as teacher and researcher. She kept the future in mind by gathering round her a community which comprised Arbault, Croisot, and Lesieur. This group was later enriched by others. Among them we must include, for the theory of semigroups,\nM P Schützenberger\n.\nOne might reasonably ask how the Dubreils brought up their daughter when Marie-Louise worked in places such as Rennes, Lyon and Poitiers while Paul worked in Nancy. Remember too that these were the years of the Second World War which began around the time that Dubreil-Jacotin became an assistant lecturer in Rennes. In May\n1940\nGerman forces invaded France and had taken Paris by the middle of June. A few days later France was defeated and under German occupation. In fact Edith was brought up in Paris with Paul and Marie-Louise spending weeks about with her\n[\n2\n]\n:-\nThe defeat, the occupation and the liberation made these never-ending trips to and from Paris slower and more difficult and dangerous. The train that Marie-Louise took each Tuesday was destroyed by a bloody bombing of the Rennes railway station. Fortunately this happened on the Mardi Gras holiday of\n1943\n. It was in\n1944\nat St Pierre des Corps that she found herself under bombardment. She spent an anxious and sleepless night made worse by twenty-four hours without food. During the winter of\n1944\n-\n45\nthe trip from Poitiers to Paris meant crossing the Loire river by foot bridge that rising water was on the verge of washing away. Marie-Louise accepted the risks calmly as part of her job.\nPaul Dubreil\nwas appointed to the Sorbonne in November\n1946\nand family life became easier. However Marie-Louise was still commuting weekly from Poitiers to Paris and her mother's ill health put her under increasing stress. During\n1954\n-\n55\nshe was mainly in Paris, being appointed as Research Director at the Centre National de la Recherche Scientifique. After the death of her mother she returned to teach at Poitiers, then in\n1956\nshe was appointed to Faculty of Science in Paris\n[\n3\n]\n:-\nIn addition to many other tasks she was co-director of the Algebra and Number Theory Seminar and the driving force behind a group actively working on ordered algebraic structures. Her teaching was reorganised to follow new reforms in the curriculum and put her in touch with applied maths and information technology.\nThe article\n[\n3\n]\nsummarises Dubreil-Jacotin's research contributions. We have indicated how these began in the field of fluid mechanics and moved towards algebra. For example in\n1952\nshe published a paper\nAlgebraic properties of Reynolds transformations\nwhich illustrates how she was working on ideas both in algebra and fluids\n[\n3\n]\n:-\nin her collaboration with\nPaul Dubreil\nshe had brought to light the notion of permutable equivalences. She also began research into the theory of groups, semigroups and algebraic congruences on her own and in collaboration with\nP Dubreil\nor R Croisot. Starting in\n1948\n, she dealt with ordered sets by first treating the question of regular equivalences and then studying ordered sets under a multiplication law. She introduced the notion of a semi-reticulated semigroup just as the equivalence relations allowed her to generalise the ideal theory of\nArtin\n-\nPrüfer\n. Some of the results she obtained are published in the second part of 'Lessons on the theory of lattices, of ordered algebraic structures and geometric lattices' published in\n1953\n... in collaboration with R Croisot and L Lesieur.\nTom Blyth\n, who undertook research under Dubreil-Jacotin's supervision, writes\n[\n1\n]\n:-\nIt was\nD E Rutherford\nwho suggested that I should follow the old Scottish tradition of doing research on the Continent.\n(\nI discovered somewhat later that he, who had a doctorate from Amsterdam, was the only example of this old tradition that I could find!\n)\nThus he arranged for me to go to Paris with a NATO scholarship, to be supervised by Madame Dubreil-Jacotin. This was my first trip out of the UK and it was arranged that I meet her at the Institut Henri Poincaré at\n5\npm on the day after I arrived in Paris. Equipped with only high school French\n(\nmost of which I had forgotten during my undergraduate years\n)\n, and feeling as hopeless as an illegal immigrant, I managed to find my way there with the aid of a borrowed map of the Métro. The meeting was memorable. Naturally the first thing I asked was if she spoke English, to which she replied simply 'En France, on parle Français'. After an hour or so, during which my French improved dramatically, she told me to accompany her in her car since she had to go to the Place Vendôme to meet her husband. On reaching the ground floor of the Institut Poincaré we encountered a throng of students which parted for her as did the sea for Moses. Scurrying along in her wake, I realised that this was no ordinary Professor. On arriving at the Place Vendôme she told me to see her again in two weeks, after I had enjoyed discovering some of the niceties of Paris. A handshake and an au revoir left me to find my own way back to the Collège Franco-Britannique where I was staying. Luckily I had that Métro map!\nSupervision by her was a joy. She claimed that she could not easily read my writing\n(\nin truth it was the other way round\n)\nand gave me a portable typewriter to prepare the material for her inspection. We met every two or three weeks in the late afternoon, either in her office or at her house in the\n16\nth\narrondissement. This was invariably followed by dinner, often in restaurants that I could never hope to afford.\nI last met her in\n1970\n. At the International Congress in Nice there was a splinter group on Semigroups, chaired by her husband Paul. At the beginning of one of the sessions he called the rabble audience to order. In our thus interrupted conversation she wryly commented to me 'il y a des professeurs qui sont les dictateurs' to which I could not resist the reply 'oui, et il y en a qui sont les dictatrices!' Her jovial acceptance of this will always remain with me.\nI owe her, and her husband Paul, my entire subsequent career and memories of them stir great affection.\nDubreil-Jacotin's character is summed up by\nLeray\nin\n[\n2\n]\n:-\nShe had determination, intelligence and composure. To these personality traits she added what were then considered more feminine qualities. Her colleagues admired her deeply even if they felt shy about expressing their affection directly to her. She, however, sensed their support and felt that it helped her when she had serious difficulties. She was a pioneer not by choice but by necessity. She needed boldness and daring to overcome the obstacles which the time in which she lived placed in her path. She was, however, changed neither by her ambition for an exceptional career nor by a passionate feminism. These were both aspects of her rich personality and the need to express herself in her own individual way.\nAs to her interests:-\nShe loved travelling and was delighted to fly over the Grand Canyon in a helicopter. She also explored the bush in Senegal ... She took very lively and artistic photographs. She enjoyed playing tennis with her friends as well as bridge, but the sea, and especially sailing, was her first love. Her love of life was exemplified when, in a force six to seven wind she sailed around the Isle of Ré in a \"beluga\"\n[\na kind of dinghy\n]\n. In her memory the Ile de France Yacht Club founded a \"Challenge Marie-Louise Dubreil-Jacotin\" judged on two contests: a regatta and a bridge tournament.\nTragedy hit the Dubreils in October\n1970\nwhen their daughter died. Two years later Dubreil-Jacotin was involved in a car accident which did not seem too serious at the time but she died of a heart attack five weeks later.\nLet us end this biography by quoting from the introduction to\nPortraits of women mathematicians\nwhich she published in\n1948\n:-\nThe development of the teaching of women, the overturning of prejudices, the profound changes in the kind of life and role assigned to women in recent years have led, without a doubt, to a change in the place held by women in science. One will see how women will be able, on a par with men, to develop from the role of good student or collaborator to become scholars whose work will open new directions.",
  "matematicos_citados_na_biografia": [
    "Élie Cartan",
    "Jean Leray",
    "Claude Chevalley",
    "Lebesgue",
    "Hadamard",
    "Ernest Vessiot",
    "Vilhelm Bjerknes",
    "Bjerknes",
    "Paul Dubreil",
    "Emmy Noether",
    "Levi-Civita",
    "Gerstner",
    "Hilbert",
    "Weyl",
    "Gaston Julia",
    "Jacques Hadamard",
    "M P Schützenberger",
    "P Dubreil",
    "Artin",
    "Prüfer",
    "Tom Blyth",
    "D E Rutherford",
    "Leray"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}