{
  "nome_completo": "Marie-Hélène Schwartz",
  "nome_curto": "Marie-Hélène Schwartz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schwartz_Marie-Helene/",
  "data_nascimento": "27 October 1913",
  "local_nascimento": "Paris, France",
  "data_morte": "5 January 2013",
  "local_morte": "Paris, France",
  "summary": "Marie-Hélène Schwartz was the daughter of Paul Lévy and the wife of Laurent Schwartz. She lived through very difficult times but went on to have an outstanding career at the University of Lille. She worked on functions of a complex variable, Ahlfors theory, the Poincaré-Hopf theorem, and finally characteristic classes of singular varieties.",
  "biografia": "Marie-Hélène Schwartz\nwas named Marie-Hélène Lévy and only adopted the name Schwartz after her marriage to\nLaurent Schwartz\n. She was the daughter of the mathematician\nPaul Lévy\nand his wife Suzanne Lévy\n(1892\n-\n1973)\n, a daughter of the merchant Paul Lévy\n(1853\n-\n1903)\nand Berthe Weil\n(1862\n-\n1930)\n.\n[\nSuzanne really did have a father and a husband with the same name!\n]\nSuzanne's maternal grandfather was Henri Weil\n(1817\n-\n1913)\n, a philologist and member of the Institut de France. Paul and Suzanne Lévy had three children, Marie-Hélène Lévy\n(\nthe subject of this biography\n)\n, Denise Lévy\n(\nborn\n3\nOctober\n1916)\nand Jean Claude Lévy\n(\nborn\n10\nApril\n1918)\n. Denise became a professor of German at the lycée Molière in Paris. She married the engineer Robert Piron. Jean Claude studied at the École Polytechnique and became an engineer in the navy.\nMarie-Hélène was educated in Paris and spent her final years of schooling at the lycée Janson de Sailly. This famous lycée was founded in\n1880\nand admitted girls from the\n1890\ns. It had an excellent reputation and was the place where the Paris \"high society\" sent their children for a top quality education. Perhaps the most famous mathematician to have studied at this lycée was\nÉlie Cartan\n. Marie-Hélène enjoyed mathematics and slowly got to know another pupil who was in the year below her at the lycée, namely\nLaurent Schwartz\n. He writes in\n[\n1\n]\n:-\nMarie-Hélène Lévy, daughter of\nPaul Lévy\n, ... was not unknown to me since I had seen her once or twice in the past, our families having known each other for three generations, but her sister Denise, who was part of the same music theory course as me, was more familiar to me. Marie-Hélène had really pleased me the first time I had met her, several years before. One year my senior, she entered the first year preparatory class in mathematics and science for entrance to the Grandes Écoles when I passed into elementary mathematics. Despite and perhaps because of the pleasure of seeing her in my high school, I hardly spoke to her for the year, but I quickly fell in love with her. When I met her I spoke to her with extreme shyness, more and more overcome with emotion and confusion.\nThe relationship between Marie-Hélène and\nLaurent Schwartz\nslowly grew. Marie-Hélène performed well in the entrance examinations for the Grandes Écoles and, in\n1934\nshe began her studies of mathematics at the École Normale Supérieure on rue d'Ulm, the only woman in her class. In April\n1935\nMarie-Hélène and\nLaurent\nbecame engaged but both sets of parents worried that they were far too young, particularly when she said that\n[\n1\n]\n:-\n... she was a mature girl, and she was not afraid of having a child before taking the aggregation.\nIn the summer of\n1935\nMarie-Hélène went with her parents on a holiday in the Dolomites.\nLaurent Schwartz\njoined the Lévy family on their vacation and at this time Marie-Hélène and\nLaurent\nmade plans to marry in December\n1935\n. This, however, was not to happen since in October\n1935\n, with Marie-Hélène continuing her studies of mathematics at the École Normale Supérieure, she developed pulmonary tuberculosis. At first Marie-Hélène did not realise she was seriously ill and tried to carry on with her life but suddenly she developed a very high fever. She had suffered from pleurisy several years earlier and quickly she was sent to the Mont-Blanc sanatorium in Passy, on the plateau d'Assy in Haute-Savoie. There were several sanatoriums in Passy specialising in the treatment of tuberculosis and certain other chronic infectious pulmonary diseases.\nLaurent Schwartz\nwrites\n[\n1\n]\n:-\nIt was obviously a tragedy for both of us, and of course for our families. There was no longer any question of marriage in December.\nAt the Mont-Blanc sanatorium Marie-Hélène was treated by Jacques Arnaud\n(1904\n-\n1944)\n, one of the pioneers of functional respiratory exploration in France. We note that his death at the age of forty occurred in the performance of his professional duty being arrested and shot by the German occupation troops for refusing to hand over the list of his patients. Arnaud did not hide the seriousness of Marie-Hélène's condition, telling her that she would be at the sanatorium for a very long time, not months but years. She was advised to prepare for a very lengthy stay and, as much as possible, to mingle with other patients in the sanatorium, because a certain collective life enabled them to maintain their balance. She resolved that\n[\n1\n]\n:-\n... she would use all her energy to look after herself, to heal herself and to shorten her forced stay as much as possible. To achieve this, she mingled little with others, bonding only with rare friends. She asked to take her meals in her room, and spent a large part of her day reading or resting, bundled up on the balcony, in the extreme cold. She was also careful to eat all of her rations.\nExaminations of her lungs showed that her condition was worsening, and the Lévy family were informed. Marie-Hélène, although not told directly of her worsening condition, was aware of it herself\n[\n1\n]\n:-\nSeeing her future truly compromised, Marie-Hélène took care of herself with an extraordinary will, \"like a dragon\", said Dr Arnaud.\nLaurent Schwartz\nwrites\n[\n1\n]\n:-\nWe wrote to each other at length every day without exception throughout her stay in the sanatorium. Our letters were obviously sentimental, even sensual, but I did not omit anything, neither from my mathematical work, nor from my political activity, allowing Marie-Hélène to evolve with me. She was thus passionate about the same great political causes as me. Of course, we read a lot, and these readings fed into our intense correspondence.\nAlthough they both kept the very many letters that they exchanged over this period, they eventually had to be burned during the German occupation of France during the war to prevent them falling into the hands of the Germans. Both being Jewish and having Trotskyist political views, clearly expressed throughout their correspondence, these letters would not only have put them in fatal danger but also put their political friends mentioned in the correspondence in peril. Slowly Marie-Hélène's condition improved but the doctors told her that even if she survived, she would stay in the sanatorium for a very long time, that she would almost certainly not be able to get married and that, if she did get married, she should not have children since pregnancy could cause a relapse.\nLaurent Schwartz\nwrites\n[\n1\n]\n:-\nFrom the start, to affirm loudly that I remained united with Marie-Hélène, and in protest against the long engagement that had been forced on us, I had decided to consider us as husband and wife. I addressed all my letters to the sanatorium, day after day, to Mrs Laurent Schwartz. Marie-Hélène asked for nothing better, and the sanatorium authorities considered this an asset for her recovery.\nIndeed she did recover, and immediately after she left the Mont-Blanc sanatorium she married\nLaurent Schwartz\non\n2\nMay\n1938\n. Rather charmingly, they never accepted that as the day of their marriage, but always considered they had married years before. Almost immediately after their marriage, Marie-Hélène went to Laon, the capital of the Aisne department of Hauts-de-France, northern France. After graduating from the École Normale Supérieure,\nLaurent Schwartz\nhad undertaken compulsory military service. He had been assigned first to Ban-Saint-Martin, near Metz, then becoming a second lieutenant assigned to Laon. Marie-Hélène settled down there with her husband and, although they would have liked children, they were told to wait for four years to improve Marie-Hélène chances of avoiding a relapse. In the autumn of\n1938\nthey moved to Châtillon-sous-Bagneux when\nLaurent\nwas appointed to the Mont Valérien garrison.\nMilitary service being over in September\n1939\n,\nLaurent\nwas immediately mobilised as World War II broke out. They moved first to Ballancourt, then to Biscarrosse, Landes, where they were living when France capitulated to Germany on\n22\nJune\n1940\n. For their safety, Marie-Hélène and\nLaurent\nwere evacuated to Aire-sur-l'Adour before German troops arrived in Biscarrosse.\nLaurent\nwas demobilized on\n15\nAugust\n1940\nand the family went briefly to Toulouse to join up with the\nLaurent\n's parents. There they met\nHenri Cartan\nand Marie-Hélène took the opportunity to ask him for his advice about how she could try to restart her academic studies.\nCartan\nadvised that they move to Clermont-Ferrand where the French University of Strasbourg had moved after the German invasion, which would benefit both her and her husband. At Clermont-Ferrand, Marie-Hélène began research and published her first paper\nExemple d'une fonction méromorphe ayant des valeurs déficientes non asymptotiques\nⓉ\n(\nExample of a meromorphic function with deficient non-asymptotic values\n)\nin\n1941\n.\nWhen\n1942\narrived and four years had passed from Marie-Hélène leaving the sanatorium, she had now reached the time when the medics had told her she could try for a child.\nLaurent Schwartz\nwrites\n[\n1\n]\n:-\nMarie-Hélène had suffered so much from the obligation to wait four years before having a baby that she now deeply desired this child. The idea of waiting until the end of a war that dragged on seemed unbearable to her.\nBelieving that the situation in Vichy France was relatively stable, Marie-Hélène was pregnant by July\n1942\nbut their position took a sudden turn for the worse with the German invasion of Vichy France on\n11\nNovember. Both Marie-Hélène and\nLaurent\nwere now in extreme danger, not only being Jewish but also being active Trotskyists with contacts to others in the organisation. From this time on they had several successive homes near Clermont-Ferrand, Boisséjour, Ceyrat, and Vernet-la-Varenne. Soon they had to adopt false identities,\nLaurent\nbecoming Laurent-Marie Sélimartin and Marie-Hélène adopting the name Marie-Hélène Lengé. Their son Marc-André Schwartz was born on\n17\nMarch\n1943\n.\nIn\n[\n1\n]\nLaurent Schwartz\nrecounts a highly dangerous experience Marie-Hélène suffered while they were in Ceyrat:-\nIn June an event occurred which nearly cost us dearly. I went to Paris for three days to meet different members of our family who had stayed there and to have contacts with Trotskyist friends. ... During this absence of three days, the police appeared one morning at seven o'clock in our small apartment in Ceyrat. Marie-Hélène received them in her dressing gown. She led the two policemen into the main room, both an office and bedroom, and told them that I was in Paris, that I had crossed the demarcation line regularly\n(\nI had a very fragile throat ... and I had a pass to consult in Paris, where naturally I did not consult anyone\n)\n... They had a search warrant and began to look at the mathematics books and search the desk drawers ... The search continued through the kitchen where they obviously noticed the ladder that allowed entry through a trap door into the attic. Marie-Hélène had the guts, with a twinge of heart, to invite them to come upstairs. A few days earlier, it was strewn with prohibited works including Marx's 'Das Kapital' ... and books by Lenin and Trotsky, among others. We had everything hidden under a double floor. ... These books were so well hidden that they never found them.\nMarie-Hélène was summoned to the police station where the commissioner asked her a question about Gérard Bloch, telling her that he had just been arrested in Lyon. Bloch was a leading Trotskyist but fortunately was also a young and brilliant mathematician whom Marie-Hélène had known since childhood since she had taken piano lessons with his mother. Realising that Bloch must have been followed when he had visited them earlier, she claimed that he had come to discuss mathematics with them. Given the Trotskyist connections and their Jewish background, it must have been a mixture of skill and luck which saw Marie-Hélène and her husband survive the war. After the Allied invasion of France in June\n1944\nthe German occupiers were driven back, and by August of that year the Vichy regime had fallen. In September\n1944\nMarie-Hélène and her husband returned to Paris, living in an apartment at\n2\nrue de Monticelli.\nAfter a year in Grenoble, the family moved to Nancy when\nLaurent\nwas appointed there in the autumn of\n1945\n. On\n30\nJuly\n1947\nMarie-Hélène had her second child, a daughter Claudine Schwartz. She undertook research on a problem suggested by\nGeorges Valiron\nand received helpful suggestions from\nAndré Lichnerowicz\n. In\n1949\nshe published two papers:\nSur les surfaces de Riemann possédant des points critiques arbitrairement rapprochés\nⓉ\n(\nOn Riemann surfaces with arbitrarily close critical points\n)\n; and\nSur les indices de ramification  de M Nevanlinna\nⓉ\n(\nOn the branching indices of M Nevanlinna\n)\n. Both were presented by\nJacques Hadamard\n. In\n1950\nanother paper appeared, namely\nApplications intérieures régulières dans les variétés à n dimensions\nⓉ\n(\nRegular interior applications in n-dimensional varieties\n)\nfollowed by\nCompte-rendu de travaux de M Heins sur diverses majorations de la croissance des fonctions analytiques ou sous-harmoniques\nⓉ\n(\nReport on the work of M Heins on various increases in the growth of analytical or sub-harmonic functions\n)\n(1952)\nwhich she had presented to the Séminaire\nBourbaki\nin December\n1949\n.\nShe submitted her thesis\nFormules apparentées à celles de Gauss-Bonnet et de Nevanlinna-Ahlfors pour certaines applications d'une variété à n dimensions dans une autre\nⓉ\n(\nFormulas related to those of Gauss-Bonnet and Nevanlinna-Ahlfors for certain applications of one n-dimensional manifold in another\n)\nin May\n1953\nand it was examined by\nGeorges Valiron\n, chairman,\nHenri Cartan\nand\nAndré Lichnerowicz\n.\nLaurent Schwartz\nwrites\n[\n1\n]\n:-\nIf someone had told her in\n1935\n, when she entered the sanatorium, that she would overcome so many obstacles, not to mention a world war, she would have thought it a joke.\nMarie-Hélène published her thesis in two papers, the first two chapters of her thesis were published as\nFormules apparentées à la formule de Gauss-Bonnet pour certaines applications d'une variété à n dimensions dans une autre\nⓉ\n(\nFormulas related to the Gauss-Bonnet formula for certain applications of one n-dimensional manifold in another\n)\n(1954)\n, while the third chapter was published as\nFormules apparentées à celles de Nevanlinna-Ahlfors pour certaines applications d'une variété à n dimensions dans une autre\nⓉ\n(\nNevanlinna-Ahlfors-related formulas for certain applications of one n-dimensional manifold in another\n)\n(1954)\n. In the first of these papers she writes:-\nI would like to express here my gratitude to M\nValiron\nwithout whose encouragement I would not have undertaken this work and to M\nLichnérowicz\nwho was kind enough to take an interest in it and give me the benefit of his advice.\nAfter her thesis was accepted, Marie-Hélène taught as an assistant at the University of Paris, and was then appointed to the University of Reims Champagne-Ardenne. In\n1964\nshe was appointed to the Faculté des Sciences de l'Université de Lille where she remained until her retirement in\n1981\n. At Lille\n[\n7\n]\n:-\n... in addition to teaching first-year courses in large lecture halls to young students who did not always appreciate her pedagogy, Mme Schwartz taught advanced courses and had a small group of very successful doctoral students. She wrote several book-length lecture notes for these courses, on analytic functions and sheaf theory in\n1966\n, on differential manifolds and transversality in\n1973\n, on singular vector bundles in\n1982\n, and on analytic subsets of analytic manifolds in\n1988\n. Fibered spaces had been the subject of her research for a long time. As early as\n1956\n, she had given a three-month set of lectures in Bogotá on 'Espacios fibrados'. The lecture notes, in Spanish, that she wrote for this course can be found in Paris, both in the library of the Institut Henri Poincaré and in the mathematics library of the Université Pierre et Marie Curie. All the above courses were only mimeographed and remained unpublished, but between\n1960\nand\n1992\nshe published a number of papers on differential geometry and analytic spaces, their singularities and their characteristic classes, that were later recognised to be fundamental, and she continued to work and to publish after her retirement in\n1981\n.\nThis quote refers to book length lecture notes by Marie-Hélène which include:\nFonctions analytiques et théorie des faisceaux. Fasc. I-III : cours de D.E.A., Lille\n1965\n-\n66\nⓉ\n(\nAnalytical functions and beam theory. Fasc. I-III: D.E.A. course, Lille\n1965\n-\n66\n)\n(1966)\n;\nLectures on stratification of complex analytic sets\n(1966)\n;\nClasses obstructrices d'un sous-ensemble analytique d'une variete analytique\nⓉ\n(\nObstructing classes of an analytic subset of an analytic variety\n)\n(1988)\n; and\nClasses de Chern des ensembles analytiques\nⓉ\n(\nChern classes of analytical sets\n)\n(2000)\n. The publisher's information about the last mentioned book is as follows:-\nChern classes are among the main invariants of complex analytic manifolds. The present work of Marie-Hélène Schwartz deals with the generalization of this idea to the case of singular complex analytical sets. The problem then becomes considerably more difficult. To deal with it, she uses a decomposition, called Whitney stratification, of a complex analytic space into analytic submanifolds which satisfy certain incidence properties and she invents several very interesting techniques which allow her to define\nChern\nclasses by means of the index of reference fields that satisfy certain conditions with respect to the strata of the Whitney stratification. This work takes up ideas that the author presented in\n1964\n. The definition of\nChern\n's classes given by Marie-Hélène Schwartz is very useful both from a conceptual point of view and from a practical point of view. The techniques she introduces in this text have a scope beyond the simple definition of\nChern\n's classes and help to understand the structure of singular analytic sets.\nJean-Paul Brasselet gives a summary of Marie-Hélène's mathematical journey in\n[\n4\n]\n:-\nFrom the study of the functions of a complex variable to the characteristic classes of singular varieties, Marie-Hélène Schwartz's mathematical journey has followed a well-defined route, braving all the difficulties encountered along the way. This presentation is not intended to write all of Marie-Hélène Schwartz's work but to show how her results follow this route. We can in fact distinguish in her mathematical journey four periods whose themes successively cover the functions of a complex variable,\nAhlfors\ntheory, the\nPoincaré\n-\nHopf\ntheorem for singular varieties and radial fields, and finally the characteristic classes of singular varieties.\nIt is remarkable that Marie-Hélène, who was not given much chance of surviving when in her early\n20\ns, should live to her\n100\nth year. She had many heartaches during her long life, living through terrible times during World War II, then suffering the dreadful loss of her son Marc-André Schwartz who committed suicide in\n1971\n.\nA conference was held in her honour at Lille on\n17\n-\n18\nApril\n1986\n. The proceedings were published as\n[\n3\n]\n. Another two-day meeting was held in Paris to honour her\n80\nth birthday in October\n1993\nat which Marie-Hélène delivered the main lecture. After her death in\n2013\n, an issue of the\nGazette des Mathematiciens\nwas devoted to papers written in her honour, for example\n[\n4\n]\n,\n[\n5\n]\n,\n[\n6\n]\n,\n[\n8\n]\n,\n9]\n.\nWe end with Yvette Kosmann-Schwarzbach's summary of her contribution\n[\n7\n]\n:-\nShe played a remarkably modest but efficient role as the wife of a great mathematician who conducted manifold political and social activities, so her own achievements tended to be overshadowed by his enormous mathematical talent. But her pioneering role in the field of analytic geometry is now well established.",
  "matematicos_citados_na_biografia": [
    "Laurent Schwartz",
    "Paul Lévy",
    "Élie Cartan",
    "Laurent",
    "Henri Cartan",
    "Cartan",
    "Georges Valiron",
    "André Lichnerowicz",
    "Jacques Hadamard",
    "Bourbaki",
    "Valiron",
    "Lichnérowicz",
    "Chern",
    "Ahlfors",
    "Poincaré",
    "Hopf"
  ],
  "imagens": [
    "schwartz_marie-helene.jpg"
  ]
}