{
  "nome_completo": "Marinus of Neapolis",
  "nome_curto": "Marinus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Marinus/",
  "data_nascimento": "about 450",
  "local_nascimento": "Neapolis, Palestine (called Shechem in Bible, now Nablus, Israel)",
  "data_morte": "about 500",
  "local_morte": "possibly Athens, Greece",
  "summary": "Marinus succeeded Proclus as head of the Academy at Athens. He published some work on astronomy.",
  "biografia": "Marinus of Neapolis\nwas probably a\nSamaritan\n, but just possibly a Jew. He became a convert to the Greek way of life and joined the\nAcademy\nin Athens where he was a pupil of\nProclus\nwho was head of the Academy. In fact when\nProclus\nwrote a commentary on the\nMyth of Er\n, he dedicated it to Marinus.\nMarinus succeeded\nProclus\nas head of the\nAcademy\nat Athens in\n485\n. We are told in\n[\n5\n]\nthat:-\n... he lectured on\nPappus\n's commentary to Book V of the Almagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n(\nin particular his discussion of\nparallax\n)\n; and there are still extant lecture notes on the Data of\nEuclid\n.\nMarinus\n[\n2\n]\n:-\n... wrote a commentary, or rather introduction to the Data of\nEuclid\n. It is mainly taken up with a discussion of the question - what is meant by given?\nIn fact Marinus was a great believer in mathematics, something which he shared with fellow late\nNeoplatonists\n. He said\n(\nsee for example\n[\n1\n]\n)\n:-\nI wish everything were mathematics.\nAlthough Marinus followed closely the views of his teacher,\nProclus\nhe did show originality which is much to his credit. The level of his regard for\nProclus\nis evident in the biography that he wrote\nLife of Proclus\nin which he\n[\n1\n]\n:-\n... praised and eulogised\n[\nProclus\n]\n.\nYet when Marinus felt that\nProclus\nwas in error he was quite prepared to give his own views. For example\nProclus\nhad claimed that\nPlato\n's\nParmenides\nwas concerned with gods. Marinus, quite correctly, pointed out that\nPlato\n's work in rather concerned with 'forms'\nThe article\n[\n7\n]\nby Tihon is an interesting account of two previously unknown commentaries on astronomical topics by Marinus. One concerns the\nMilky Way\nand Marinus discusses whether it is affected by precession. As early as the\n5\nth\ncentury BC\nDemocritus\nhad correctly understood the Milky Way to be due to a multitude of faint stars. However this was still not the accepted view in the time of Marinus, who argues against this hypothesis in this commentary. Marinus did claim, however, that the Milky Way was part of the sphere of fixed stars and so underwent precession in the same way as the fixed stars.\nIn the second commentary by Marinus described in\n[\n7\n]\n, he corrects the rules for the direction of parallax in longitude given by\nTheon\nof Alexandria in his small commentary on\nPtolemy\n's\nHandy Tables\n. Marinus makes use of ideas by\nPappus\nin making his corrections.",
  "matematicos_citados_na_biografia": [
    "Samaritan",
    "Academy",
    "Proclus",
    "Pappus",
    "parallax",
    "Euclid",
    "Neoplatonists",
    "Plato",
    "Parmenides",
    "Milky Way",
    "Democritus",
    "Theon",
    "Ptolemy"
  ],
  "imagens": []
}