{
  "nome_completo": "Marjorie Lee Wikler Senechal",
  "nome_curto": "Marjorie Senechal",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Senechal/",
  "data_nascimento": "18 July 1939",
  "local_nascimento": "St Louis, Missouri, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Marjorie Senechal is an American mathematician who worked on tessellations and quasicrystals. She won the Mathematical Association of America's Carl B Allendoerfer Award for excellence in expository writing in Mathematics Magazine for her article, Which Tetrahedra Fill Space? Her book American Silk 1830 - 1930 won the Millia Davenport Publication Award of the Costume Society of America.",
  "biografia": "Marjorie Senechal\nwas given the name Marjorie Wikler and was only known as Marjorie Senechal after her marriage. However, for simplicity, we will use the name Marjorie Senechal throughout this biography. Her father was Abraham Wikler, born in New York on\n12\nOctober\n1910\n, the son of the Jewish butcher Isaac Wikler who had emigrated from Ukraine, and his wife Clara. Abraham graduated with an M.D. in\n1935\nand became a psychiatrist and neurologist who made important discoveries in drug addiction. Marjorie's mother was Ada Fay Fischer, born in New York City on\n12\nJuly\n1915\n. Ada Fay Fischer was the daughter of May Fischer and Flora M Samuels. Abraham and Ada Fay Wikler had four children, the eldest being Marjorie, the subject of this biography. Her younger siblings were Norma Wikler, Daniel I Wikler\n(\nborn\n21\nMay\n1946)\nand Jean C Wikler\n(\nborn\n12\nJuly\n1948)\n. When the\n1940\ncensus was taken in early April\n1940\nthe family were living at\n208\nFrieda Avenue, Kirkwood, St Louis, Missouri but later that year they moved to Lexington, Kentucky when Abraham Wikler was appointed as an intern at the Lexington Narcotic Hospital, a prison farm run by the United States Public Health Service for drug addicts.\nWhen the family first moved to Lexington, Kentucky they lived on the Narcotic Farm\n(\nknown as Narco\n)\nwhich was actually\n10\nmiles from Lexington. She wrote\n[\n21\n]\n:-\nWe lived on a farm, twelve hundred acres in the heart of the Kentucky bluegrass country. Meat was raised and butchered there, vegetables grown, cows milked, eggs laid, and bread baked. You are thinking: they must have had quite a staff. Yes we did; it numbered in the hundreds. What you need to know is: they all were federal prisoners, serving time for possession of drugs. The farm I grew up on was the famous Narcotic Farm, a U.S. government prison/hospital for heroin addicts. Farm work, and housework - we had \"houseboys\" too - was part of the cure. ... Unsupervised, I prowled where my curiosity led me. I climbed trees and rode horses. Maybe that's why I have never felt constrained by academic boundaries. I talked with whomever I chose: Kentucky drifters, Chicago jazz musicians, New York street criminals, Chinese laundrymen. Prisoners came and went and came back again; the relapse rate was\n90\n%. And so I also learned that some problems, like drug addiction, are essentially intractable, and that any partial traction is achieved through the synthesis of multiple perspectives\nSenechal attended the Training School of the University of Kentucky in Lexington, Kentucky which was a small school. She was not happy there, and she explained why in the interview\n[\n19\n]\n:-\nAt half past seven on weekday mornings, the prison ambulance, a uniformed guard at the wheel, stopped at our front door. ... The guard dropped us off at a small ivy-covered building on the campus of the University of Kentucky. With only one class at each grade level and special teachers for music, art, and gym, the Training School was the best in town. I was miserable. The work was too easy and the kids were nascent snobs. ... These kids noticed who arrived by ambulance. Their parents, and the teachers, noticed who were Jewish.\nWhen she was fifteen years old her parents moved from the Narcotic Farm to a house in Lexington\n[\n19\n]\n:-\n... quiet, leafy neighbourhoods; formal living rooms, drapes drawn against the afternoon sun: black maids in large kitchens.\nFrom this house she went on a yellow school bus to Lafayette High School in Kentucky's Picadome district which was a large school. She said that the children at this school\n[\n19\n]\n:-\n... were not snobs. But I was miscast in my new role as a Lexington teenager. I saw everything through Narco eyes. ... For me, Lexington was a looking-glass prison, with walls of hypocrisy and conformity as strong as brick and stone. After two years I escaped to the University of Chicago, which didn't require a high school diploma. I erased all traces of my Kentucky accent, or thought I did, and didn't look back for a long, long time.\nEntering the University of Chicago, Senechal had no idea what she wanted to study. Her father had wanted her to follow in his footsteps and have a career in medicine so she enrolled in chemistry. Although no High School Diploma had been required, nevertheless the chemistry course still assumed that the students had studied the subject at school. Senechal had not, partly because she had left school after the\n11\nth grade. She stuck with the course despite the fact that lectures were given to a very large class at\n8\no'clock in the morning. She did not enjoy the chemistry laboratories in the afternoon, but mathematics was more enjoyable so she majored in that subject\n[\n21\n]\n:-\nBut I didn't know, or think to ask myself, what I enjoyed about it: which areas of math appealed to me and why; what stirred my imagination. Nor did I have any clear idea of a career.\nShe graduated with a B.S. from the University of Chicago in\n1960\nand then continued her study of mathematics, undertaking postgraduate work at the Illinois Institute of Technology. After being awarded an M.S. in\n1962\nshe continued undertaking research for a doctorate at the Illinois Institute of Technology advised by Abe Sklar. Sklar's thesis advisor had been\nTom Apostol\nat the California Institute of Technology where he had been awarded his Ph.D. in\n1956\nfor his thesis\nSummation formulas associated with a class of Dirichlet Series\n. When Sklar became Senechal's thesis advisor she had no idea which area of mathematics attracted her most and she ended up undertaking research on analytic number theory, somewhat by accident\n[\n21\n]\n:-\nAnalytic number theory\nbecame my research topic because my advisor, an expert on summation formulas for divergent infinite series, had a grant from the Office of Naval Research that included support for a graduate student.\nAt the Illinois Institute of Technology Senechal met Lester John Senechal who, like her, was undertaking research for a Ph.D. in mathematics. Lester Senechal's research advisor was\nRay Lorch\n, and he was awarded a Ph.D. in\n1963\nfor his thesis\nOn Uniform Operators.\nKarl Menger\nalso advised Lester Senechal during his doctoral studies and you can see his comments about\nMenger\nat\nTHIS LINK\n.\nMarjorie Wikler, as she then was, married Lester Senechal while both were undertaking research at the Illinois Institute of Technology. After the award of his doctorate, Lester Senechal was appointed to the University of Arizona. Marjorie Senechal moved to Tucson with her husband, still not having completed her Ph.D. While in Tucson she completed the work and submitted her thesis\nApproximate Functional Equations and Probabilistic Inner Product Spaces\nto the Illinois Institute of Technology and was awarded a Ph.D. in\n1965\n. She published the paper based on her thesis\nA summation formula and an identity for a class of Dirichlet series\nin\n1966\n.\nSenechal's first child, a daughter named Diana Louise, was born in Tucson in\n1964\n. Let us note as an aside that Diana Senechal was awarded a Ph.D. in Slavic Languages and Literature from Yale University. Unable to obtain a position at the University of Arizona since a husband and wife were not permitted posts at the same institution, Lester and Marjorie Senechal obtained a Fulbright scholarship and a Fulbright travel grant respectively, to teach at the University of Ceara in Fortaleza, Brazil, from June to December\n1965\n. They returned to the United States where they settled in Amherst, Massachusetts where Lester was employed. In fact the Five College Consortium consisting of Amherst College, Hampshire College, Mount Holyoke College, Smith College and the University of Massachusetts at Amherst had been formally established in\n1965\n. This provided good opportunities for Senechal to obtain a position and she was appointed to a one year position at Smith College, for the academic year\n1966\n-\n67\n, standing in for a woman who was on maternity leave. By this time Senechal was expecting her second child but she persuaded the College that she would be able to teach for the full session with her baby due in the spring vacation.\nSenechal's second daughter, Jenna Juliet, was born in the spring of\n1967\nbut this had a more major impact on Senechal's career than one would expect all because of a chance occurrence. She wrote\n[\n21\n]\n:-\nMy only problem, as the due date approached, was finding a gripping book to read in the hospital. Serendipity struck: in the science library I came across 'Crystals: their role in nature and science', by Charles Bunn. All I knew about crystals was that they were pretty. I checked it out and read it with increasing excitement in my few quiet moments the next week. I'd found the answer to my unasked questions. Crystals showed me what drew me to math: geometric forms, patterns, packings and tilings; and elegant puzzles like diffraction diagrams.\nAt Smith College, the woman who had taken maternity leave did not return and in\n1967\nSenechal was appointed as an assistant professor and given a two year appointment. This was followed by a three year appointment following which she was given a permanent position. In\n1973\nshe was made Associate Professor and a full Professor of Mathematics in\n1978\n.\nHer discovery of the mathematics of crystallography and the group structure of tilings was exciting but she did not find anyone else at Smith College who was interested. Via one of his articles, she was able to make contact with Arthur Loeb who worked at the Kennecott Copper Company's laboratory in Lexington, Massachusetts. At last she had found someone who shared her interests. She studied books in the Smith College Art Library looking at the patterns illustrated in books like\nThe\nGrammar of Ornament\nand tried to learn how to quickly identify which of the\n17\nspace groups was the symmetry group of the pattern. A professor of art, seeing her interest, asked her if she knew\nDorothy Wrinch\n. Although\nWrinch\nwas retired she was still active and working at Smith College; they soon started working together.\nSenechal published her first paper in her new area of interest in\n1975\n,\nPoint groups and color symmetry\nin the journal\nZeitschrift fur Kristallographie\n. This was her first publication in ten years, but it was the first of a great wealth of papers and books on these topics. She spent her first sabbatical year\n1974\n-\n75\nat the University of Groningen in The Netherlands. She took a house in Paterswolde where her two daughters attended elementary school. During this year when she was able to learn from leading researchers in mathematical crystallography. She wrote\n[\n21\n]\n:-\nFor the first time, I was working in a real crystallography department, gaining a broader sense of the field and its denizens past and present.\nShe was able to spend the academic year\n1979\n-\n80\nat the Institute of Crystallography of the Academy of Sciences of the USSR in Moscow as an exchange scientist. Charlene Morrow writes\n[\n13\n]\n:-\nThis community of colleagues, particularly the mathematicians and crystallographers associated with\nBoris Delone\n, a leading researcher, soon became very important to her. Nor Senechal was firmly grounded in an international community of researchers that would take her overseas many times.\nFor Senechal's description of the influence\nDelone\nhad on her, see\nTHIS LINK\n.\nThe year spent in Russia was significant to Senechal in other ways. She wrote\n[\n21\n]\n:-\nThe girls braved the -\n45\n° cold - that merciless crossing point of the Fahrenheit and Centigrade scales\n[\nIn fact -\n40\n°F = -\n40\n°C\n]\n- to trudge to their Russian schools. They learned Russian and enough other things to skip a year of school when they came home; and they made Russian friends. Moscow in those days was even more child-friendly than Holland. The streets and the subways were safe; they went to parties, concerts, and circuses on their own. Moscow was, however, less friendly to visiting adults. Social isolation, mainly, made it a divorce factory for American visitors; we divorced a few years after our return.\nAs well as international visits, Senechal also played a major role in organising various international conferences at Smith College, For example in\n1973\nan interdisciplinary symmetry meeting was held at Smith College and Senechal was one of the two editors of the proceedings along with George Fleck. In April\n1984\n, Smith College was the site of a Shaping Space Conference. Again there was a conference proceeding which Senechal and Fleck edited. For extracts of reviews of the two books, see\nTHIS LINK\n.\nIn\n1990\nshe published\nCrystalline Symmetries: An Informal Mathematical Introduction.\nRolf Schwarzenberger wrote in a review\n[\n18\n]\n:-\nThis monograph is the best introduction to mathematical crystallography available and is unlikely to be surpassed for a very long time.\nFor a longer extract from this review and other reviews of this and other works by Senechal see\nTHIS LINK\n.\nThere is a surprising aspect of Senechal's publication list, namely the fact that she has published articles on silk. She had married the photographer Stan Sherer in\n1989\nand in the\n1990\ns they made many trips to Albania. She discovered that there was a great industry in raising silkworms in Albania. Fascinated with the story of silk in Albania, she began researching silk in America in the\n1830\ns\n[\n21\n]\n:-\nI remembered that Northampton, Massachusetts had been the home of the Corticelli Company, which made silk thread. Surely I could find information in our local library. But no: all I found were some\n1830\ns sericulture manuals. With a Smith colleague, I launched a town-gown history recovery project. For the next ten years, we and our students pored over local archives, reconstructed\n1830\ns silk-winding equipment, mounted exhibits, hosted expert visitors, and even raised silkworms.\nThis interest in the history of silk was matched by an interest in the history of mathematics. Senechal retired from teaching in July\n2007\nbut this allowed her to spend more time on two major projects, namely editing\nThe Mathematical Intelligencer\nand writing a biography of\nDorothy Wrinch\n. She completed this second project publishing\nI died for beauty: Dorothy Wrinch\n(\nOxford University Press,\n2012)\n. Philip Ball, reviewing the book in\nNature\nwrote\n[\n3\n]\n:-\nIt is tremendous that Senechal has excavated this story. She offers a gripping portrait of an era and of a scientist whose complications acquire a tragic glamour. It is a cautionary tale for which we must supply the moral ourselves.\nSenechal has given much service to the mathematical community with her editorial work. This includes being a member of the Editorial Board of the\nMathematical Association of America\n's Carus Mathematical Monographs\n(1987\n-\n1996)\n, being editor from\n1992\nto\n1996\n; on the Editorial Board of the journal \"Discrete and Computational Geometry\"\n1985\n-\n2006\n; being editor of the column \"Mathematical Communites\" for The Mathematical Intelligencer\n(1997\n-\n)\n; being Co-Editor-in Chief of The Mathematical Intelligencer from\n1\nJuly\n2005\nand being the sole Editor-in-Chief from\n1\nJanuary\n2013\n.\nAmong the awards and honours that have been given to Senechal we mention: the Carl B Allendoerfer Award from the\nMathematical Association of America\nin\n1982\n, for her paper\nWhich tetrahedra fill space?\n; the Honored Faculty Award from Smith College in May\n2007\n; the Millia Davenport Publication Award from the American Costume Society in\n2008\n; and elected a Fellow of the\nAmerican Mathematical Society\nin\n2012\n.",
  "matematicos_citados_na_biografia": [
    "Tom Apostol",
    "Analytic number theory",
    "Ray Lorch",
    "Karl Menger",
    "Menger",
    "THIS LINK",
    "Dorothy Wrinch",
    "Wrinch",
    "Boris Delone",
    "Delone",
    "Mathematical Association of America",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}