{
  "nome_completo": "Mark Kac",
  "nome_curto": "Mark Kac",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kac/",
  "data_nascimento": "3 August 1914",
  "local_nascimento": "Krzemieniec, Poland, Russian Empire (now Kremenets, Ukraine)",
  "data_morte": "26 October 1984",
  "local_morte": "California, USA",
  "summary": "Mark Kac pioneered the modern development of mathematical probability, in particular its applications to statistical physics.",
  "biografia": "Mark Kac\nwas born into a Jewish family in a Russian part of Poland. His date of birth was given as\n3\nAugust on his birth certificate and this was the day on which, throughout his life, he celebrated his birthday. However, this was the date according to the Julian calendar that was used in czarist Russia at the time of his birth, since Poland at that time was part of the Russian Empire. He claimed that his actual date of birth was\n16\nAugust.\nIn\n1915\nEurope was in the midst of World War I and Kac's family was evacuated further east into Russia. Mark Kac's father was an academic with a degree in philosophy from the University of Leipzig and a degree from Moscow in history and philology. During this time he made money tutoring in the family's one-room apartment. One of the topics he tutored was geometry and Mark, although only five years old, became fascinated by what his father was teaching and he persuaded his father to teach him some geometry. Describing this introduction to mathematics in\n[\n4\n]\n,\n[\n5\n]\nhe said:-\n... at that time my father despaired because at the same time I was exceedingly bad learning multiplication tables. That one could know how to prove theorems of elementary geometry without knowing how much seven times nine was seemed more than slightly strange.\nIn\n1921\nthe family returned to Poland and Mark was taught by a French governess. By\n1925\n, when he was eleven, he had learnt Russian, French from the governess and some Hebrew from his father but, despite being Polish, he did not speak Polish. Only in\n1925\n, when he entered the Lycee of Krzemieniec, did he learn Polish. Kac studied Latin and Greek at school as well as mathematics, physics and chemistry. He was equally interested in mathematics and physics but his mother wanted him to study engineering at university. He eventually chose to study mathematics and he recounted how that came about\n(\n[\n4\n]\n,\n[\n5\n]\n)\n:-\n... in the summer of\n1930\nI became obsessed with the problem of solving\ncubic equations\n. Now, I knew the answer, which\nCardan\nhad published in\n1545\n, but what I could not find was a derivation that satisfied my need for understanding. When I announced that I was going to write my own derivation, my father offered me a reward of five Polish zlotys\n(\na large sum and no doubt the measure of his scepticism\n)\n. I spent the days, and some of the nights, of that summer feverishly filling reams of paper with formulas. Never have I worked harder. Well, one morning, there it was --\nCardan\n's formula on the page. My father paid up without a word, and that fall my mathematics teacher submitted the manuscript to \"Mlody Matematyk\"\n(\nThe Young Mathematician\n)\n. ... When my\ngymnasium\nprincipal, Mr Rusiecki, heard that I was to study engineering, he said, \"No, you must study mathematics; you have clearly a gift for it\".\nKac entered the Jan Kasimir University of Lwów where he was taught by\nSteinhaus\n. After graduating he remained at the University of Lwów and he was awarded his doctorate in June\n1937\n. Kac had decided, before his doctorate was awarded, to try to leave Poland\n(\n[\n4\n]\n,\n[\n5\n]\n)\n:-\n... I wanted to get out of Poland very badly. I did not know the disaster was going to be of the magnitude it turned out to be, but it was obvious that Europe, especially eastern Europe, was not the place to stay.\nHis first attempt was to try to obtain an academic post in Britain. He recounted an application he made to Imperial College in London, despite not speaking English at that time\n(\n[\n4\n]\n,\n[\n5\n]\n)\n:-\n... in \"Nature\" there would be ads of various positions. Most positions required being a British subject, but one of them ...was an ad for a junior lecturer in the Imperial College of Science and Technology at the salary of\n150\npounds per annum.... Even then that was not very much money, and I thought that no self-respecting British subject would ever want to apply for a job like this. So I spoke to my teacher,\nHugo Steinhaus\n, and asked whether it would be a good idea to apply, and he, partly in jest, partly seriously, said, \"Well, let's estimate your chances of getting the job. I would say it is\n1\nin\n5000\n. Let's multiply this by the annual salary. If this comes out to be more than the cost of the postage stamp, then you should not apply. If it is less than the cost of the stamp, you should.\" Well, it turned out to be a little bit less than the cost of the stamp, so I wrote. I got a letter from them later on saying that unfortunately the job was filled, so there had been after all a British subject who wanted the\n150\npounds per annum.\nKac then tried to go to the United States, helped by\nSteinhaus\nwho was not only his teacher but also by this time his friend. This was a difficult period, however, since there was a large number of refugees from Germany, particularly people of Jewish descent, who wanted to make a new life in Britain or the United States. While attempting to go to the United States, Kac worked for an insurance company in Lwów. He eventually was given a six month visitor's visa for the United States but was required to buy a return ticket to ensure that he left after six months. After being awarded his doctorate in\n1937\n, he applied for a scholarship to go to Johns Hopkins University but it was not awarded to him. Kac did not give up, however, and the following year he applied again, and this time he was successful. He described how the failure to get the scholarship the first time was an extraordinary piece of good luck\n(\n[\n4\n]\n,\n[\n5\n]\n)\n:-\n... that saved my life because if I had gotten it a year earlier, I would have been compelled to go back. This way the war caught me in this country and literally saved my life. I was at Johns Hopkins when the war started, and then I got an offer to Cornell, where I spent twenty-two very happy years.\nCertainly Kac was fortunate to have been able to leave Poland at that time. As he writes in\n[\n2\n]\n:-\nIn less than a year the world exploded and much of my part of it was consumed by flames. Millions, including my parents and my brother, were murdered by the Germans, and many dissappeared without a trace in the vastness of the Soviet Union.\nKac served at Cornell as an instructor from\n1939\nto\n1943\n(\nthe year he became a US citizen\n)\n, assistant professor from\n1943\nto\n1947\nwhen he was promoted to full professor. When Kac left Cornell in\n1961\nhe went to Rockefeller University, in New York City. His chair in Cornell was filled by Mitchell Feigenbaum, one of the founders of the modern subject of chaos. Kac spent twenty years at Rockefeller University, then decided to spend the rest of his career:-\n.... where there is more sun and less ice ...\nso he went to the University of Southern California where he spent the rest of his career.\nKac has pioneered the modern development of mathematical\nprobability\n, in particular its applications to\nstatistical physics\n. The method of quantization now in use involves the\nFeynman\n-Kac path integral, named after Richard\nFeynman\nand Mark Kac. He published a classic text\nStatistical Independence in Probability, Analysis and\nNumber Theory\nin\n1959\n.\nTo many Kac will be remembered best for a paper he wrote for the\nAmerican Mathematical Monthly\nin\n1966\n. This is the famous paper\nCan One Hear the Shape of a Drum?\nand Kac received the\nChauvenet\nPrize from the\nMathematical Association of America\nin\n1968\nfor the :-\nmost outstanding expository article on a mathematical topic by a member of the Association.\nIn addition to the\nChauvenet\nPrize\n(\nwhich in fact he won on two separate occasions\n)\n, Kac was awarded the\nGeorge David Birkhoff\nPrize in Applied Mathematics in\n1978\n. The citation for the fifth award of this prize, which is a joint prize of the\nAmerican Mathematical Society\nand the\nSociety for Industrial and Applied Mathematics\n, was made:-\nTo Mark Kac for his important contributions to statistical mechanics and to probability theory and its applications.\nWhen asked what pleased him most about the scientific work he had done, Kac replied\n(\n[\n4\n]\n,\n[\n5\n]\n)\n:-\n... I was always interested in problems rather than in theories. In retrospect the thing which I am happiest about, and it was done in cooperation with\nErdős\n... was the introduction of probabilistic methods in number theory. To put it poetically,\nprimes\nplay a game of chance. And also some of the work in mathematical physics. I am amused by things. Can one hear the shape of a drum? I also have a certain component of journalism in me, you see: I like a good headline, and why not? And I am pleased with the sort of thing I did in trying to understand a little bit deeper the theory of phase transitions. I am fascinated, also, with mathematical problems, and particularly ... the role of dimensionality: why certain things happen in 'from three dimensions on' and some others don't. I always feel that that is where the interface, will you pardon the expression, of nature and mathematics is deepest. To know why only certain things observed in nature can happen in the space of a certain dimensionality. Whatever helps understand this riddle is significant, I am pleased that I, in a small way, did something with it.\nRaimi described Kac, in particular his English accent, in\n[\n12\n]\n:-\nHe spoke his five or six languages beautifully. He never lost his Polish accent - he rolled his Rs mercilessly - but, more important, he never lost that brio, that sparkling juxtaposition of surprising phrases and constructions that made his speech such a delight to anyone with an ounce of poetry in his soul. How much of this was due to his Polish and how much to his own curious outlook on the world one cannot say.",
  "matematicos_citados_na_biografia": [
    "cubic equations",
    "Cardan",
    "gymnasium",
    "Steinhaus",
    "Hugo Steinhaus",
    "probability",
    "statistical physics",
    "Feynman",
    "Number Theory",
    "Chauvenet",
    "Mathematical Association of America",
    "George David Birkhoff",
    "American Mathematical Society",
    "Society for Industrial and Applied Mathematics",
    "Erdős",
    "primes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}