{
  "nome_completo": "Mark Aronovich Naimark",
  "nome_curto": "Mark Aronovich Naimark",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Naimark/",
  "data_nascimento": "5 December 1909",
  "local_nascimento": "Odessa, Ukraine",
  "data_morte": "30 December 1978",
  "local_morte": "Moscow, USSR",
  "summary": "Mark Aronovich Naimark was a Ukranian mathematician who worked in functional analysis and mathematical physics.",
  "biografia": "Mark Aronovich Naimark\n's father, Aron Iakovlevich Naimark, was a professional artist who had married Zefir Moiseevna. Mark Aronovich was brought up by his Jewish parents Aron Iakovlevich and Zefir Moiseevna in Odessa where he showed an outstanding talent for mathematics while at school. In\n1924\n, at the age of fifteen, he entered a technical college but also worked in a foundry to earn his living. In addition to these two occupations, which he undertook for four years, he also studied university level mathematics on his own completing a university course on analysis by\n1928\n. He entered the Physical-Mathematical Faculty of the Odessa Institute of National Education in\n1929\n(\nshortly afterwards this Institute was renamed the Physico-Chemico-Mathematical Institute\n)\n. In\n1932\nhe married Larisa Petrovna Shcherbakova; they had two sons. Then, in\n1933\n, after graduating from the Physico-Chemico-Mathematical Institute he went to Odessa State University to undertake graduate studies in the Department of the Theory of Functions.\nAt Odessa State University Naimark's studies were supervised by\nMark Grigorievich Krein\nwho, although only two years older than Naimark, had completed his doctorate in\n1929\nand had begun to build up a\nfunctional analysis\nresearch group. With Krein, Naimark worked on applying\nBezout\n's\ndeterminant\nto the problem of separating the roots of an algebraic equation. The two collaborated in writing three papers on this topic:\nÜber eine Transformation der Bezoutiante, die zum Sturmschen Satze führt\nⓉ\n(\nOn a transformation of Bezout that leads to the Sturm's theorem\n)\n(1933)\n;\nOn the application of Bezoutians to the separation of the roots of algebraic equations\n(1935)\n; and\nThe method of symmetric and hermitian forms in the theory of the separation of the roots of algebraic equations\n(1936)\n. Naimark defended his candidate's dissertation\n(\nequivalent to a Ph.D. thesis\n)\nThe theory of normal operators in Hilbert space\nin\n1936\nthen moved to Moscow in\n1938\n. In Moscow he studied at the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\n[\n4\n]\n:-\nIt was at this time that his main scientific interests, which relate to the\nspectral theory\nof operators in\nHilbert\nspace and the\nrepresentation theory\nof locally compact groups, were finally formed.\nThe theory that he developed concerning self-adjoint extensions of symmetric operators with extension of the original\nHilbert\nspace was complementary to that developed by\nvon Neumann\n. At the\nSteklov\nMathematical Institute he attended the functional analysis seminar run by\nIsrail Moiseevic Gelfand\nwith whom he began a fruitful collaboration. In joint work with\nGelfand\n, he worked on noncommutative normed rings with an involution. They showed that these rings could always be represented as a ring of linear operators on a\nHilbert\nspace in\nOn the imbedding of normed rings into a ring of operators in Hilbert space\n(1943)\n. In April\n1941\nhe had received his doctorate\n(\nequivalent to the German\nhabilitation\n)\nfrom the\nSteklov\nMathematical Institute, following which he had been appointed to a chair at the Seismological Institute of the\nUSSR Academy of Sciences\nin Moscow. At the start of the war he undertook military work in a number of different places, moving to Tashkent at the end of\n1941\nsince the Seismological Institute had been evacuated there from Moscow. He returned to Moscow at the end of the war where\n[\n4\n]\n:-\n... he worked in a number of institutes, including the Institute of Chemical Physics and the USSR Academy for the Arms Industry, gradually moving towards pedagogical work. To help provincial higher education institutes, he periodically had to go to Kostrom.\nHe continued to publish joint papers with\nGelfand\n, in particular in\n1946\n-\n47\nthey published seven papers:\nOn unitary representations of a complex unimodular group\n;\nUnitary representations of the Lorentz group\n;\nUnitary representations of the group of complex matrices of the second order\n(\nthe Lorentz group\n)\n;\nUnitary representations of the Lorentz group\n;\nUnitary representations of the group of linear transformations of a line\n;\nThe fundamental series of the irreducible representations of a complex unimodular group\n; and\nAuxiliary and degenerate series of the representations of a unimodular group\n. They published four joint papers on similar topics in\n1948\n, and further papers in each of the years from\n1950\nto\n1953\n.\nNow Naimark's aim was to work at the\nSteklov\nMathematical Institute and he tried\n[\n2\n]\n:-\n... for years to be accepted and\n[\nbut his attempts were\n]\nthwarted by the anti-Semitic proclivities of its director,\nIvan Vinogradov\n.\nIn\n1954\nhe was appointed professor at the Moscow Physical-Technical Institute\n[\n4\n]\n:-\nHere he regularly gave courses in mathematical analysis, partial differential equations and functional analysis, he also supervised a group of post-graduate students and organized research seminars.\nThen in\n1962\n, after years of struggling against discrimination, he became professor in the Department of the Theory of Functions and Functional Analysis at the\nSteklov\nMathematical Institute, a post he continued to hold until his death. During these years he was the only Jewish mathematician employed at the Institute out of a staff of around\n140\n. After his appointment to the\nSteklov\nMathematical Institute he travelled widely and we should make special mention of his lecture tour of Canada in\n1967\nwhich did much to improve relations between Soviet and Western scientists. He had a heavy teaching load in the early part of his career but as he became more senior he only taught graduate students and supervised research students.\nWe have already noted that Naimark's first work was on the separation of roots of algebraic equations but, once he had established himself in Moscow, he worked on functional analysis and group representations. In\n1943\nhe proved the\nGelfand\n-Naimark theorem on self-adjoint algebras of operators in\nHilbert space\n. In the same year he generalised\nvon Neumann\n's spectral theorem to locally compact\nabelian groups\n. He made a detailed analysis of the infinite-dimensional representations of the semisimple\nLie groups\n. His important treatise\nUnitary representations of the classical groups\nwith\nGelfand\non irreducible representations of the classical\nmatrix\ngroups was published in\n1950\n. This work formed the basis for later contributions by\nHarish-Chandra\non representations of semisimple\nLie\ngroups.\nI E Segal\nbegins a review of the monograph as follows:-\nThis is a fairly comprehensive account of the irreducible continuous unitary representations of the classical simple\n(\ncomplex\n)\nLie\ngroups, and of related aspects of harmonic analysis on such groups. It supersedes the material published in a long series of earlier notes. The results are for the most part very explicit and apparently well adapted to specific applications.\nNaimark also made substantial contributions to\nBanach\nalgebras. He wrote the famous text\nNormed Rings\nin\n1956\n.\nE Hewitt\nbegins a review with the following paragraph:-\nThis treatise is not merely a technical report on\nBanach\nalgebras\n(\n\"normed rings\" in Soviet parlance\n)\n, but is actually a compendium of functional analysis, containing a full treatment of those parts of the subject that are relevant to the theory of normed algebras. In theory, it is accessible to anyone who can read Russian, knows some algebra, and is familiar with elementary analysis. The scope of the book is enormous: starting with the simplest concepts, the author finishes with a report on recent developments in the theory of\nW\n∗\nW^{*}\nW\n∗\n-algebras.\nThe review ends:-\nProfessor Naimark has produced a unique, monumental, and highly valuable work.\nHis book\nLinear differential operators\nhad been published two years earlier in\n1954\n. E A Coddington writes:-\nThis work is an important contribution to the literature on the spectral theory of ordinary linear differential operators.\n(\nThe title is somewhat misleading in that partial differential operators are not analysed.\n)\nStarting from simple facts about boundary-value problems, the author develops the theory of expansion by eigenfunctions, and the spectra of ordinary differential operators, including many of the results obtained recently by Russian mathematicians.\nIn\n1958\nNaimark published\nLinear representations of the Lorentz group\n. Naimark states his aims in writing the text up front:-\nThis book is the first monograph on the representations of the\nLorentz\ngroup. It is written principally for theoretical physicists, but the principal results and methods\n(\nbelonging to the author\n)\nmust also be interesting to specialists in mathematics. The exposition begins with elementary concepts of the theory of groups and the theory of group representations; facts about the\nLorentz\ngroup and the rotation group in three-dimensional Euclidean space are given in detail, so that the book can serve as a means for studying the general theory of representations.\nWilhelm Magnus\nreviews the text in\n[\n8\n]\nwriting:-\n... the book is a very valuable contribution to the mathematical textbook literature. The style is simple and lucid. The mathematical tools are reduced to the minimum necessary to prove the theorems concerning the\nLorentz\ngroup, and some theorems from functional analysis are proved in nine appendices. At the same time, many generalisations of the results proved are mentioned, and appropriate references are given.\nD F Johnston has interesting points to make about\nLinear representations of the Lorentz group\nin\n[\n5\n]\n:-\nThis is an interesting book from several points of view. For the pure mathematician it is a systematic treatment of the\nLorentz\ngroups in the classical tradition; for the theoretical physicist the long final chapter on invariant equations is of deep interest; for the social historian this Russian account of the theory of the\nLorentz\ngroups reveals the isolation of Russian mathematicians from the work of their Western colleagues, the same isolation manifest in Russian music and literature.\nIn all Naimark wrote\n123\npapers and\n5\nbooks but he also put considerable effort into the translations and further editions of the books. For example, he worked hard to produce a second edition of\nNormed rings\nand this appeared in\n1968\n. After the first Russian edition had been published in\n1956\n, English and German translations had been produced. These translations contained improvements and additional material which, in Naimark's words:-\n... take into account some of the important advances in the theory of linear ordinary differential operators which have been made in the past few years.\nThese improvements were incorporated into the second Russian edition of\n1968\n. In addition to these improvements and updating, he completely rewrote the final chapter.\nHis last book was\nTheory of group representations\npublished in\n1976\n. By the time this book was written Naimark was suffering from heart disease, a problem which afflicted him during the last ten years of his life. However, he\n[\n1\n]\n:-\n... bore his affliction with grace and humour.\nToo ill to sit up yet determined to continue writing the\nTheory of group representations\n, he dictated the text to his wife. The book only covers finite-dimensional group representations but, despite his illness, Naimark states in the Preface that he hoped to write a sequel on the analytic and infinite-dimensional theory. Sadly he died before he was able to undertake this task.\nWe now give a quote by his colleagues showing Naimark's high reputation as a teacher\n[\n4\n]\n:-\nNaimark's scientific activity was inseparably linked with his pedagogical work and his work on the education of young people. He generously shared his rich experience with his colleagues and students. Everyone who went to him for advice received much more: he not only helped them to overcome their scientific difficulties, but he was able to encourage them and inspire them with a belief in their own strength. He had a remarkable gift for explaining things simply and intelligibly. This feature was evident both in his lectures to students and in his scientific talks, articles, and monographs.' His lectures and talks invariably attracted the interest not only of mathematicians but also of physicists.\nAs a person he was also held in high regard by his colleagues\n[\n4\n]\n:-\nThose who were lucky enough to be closely associated with Naimark know and remember him as a man of spiritual qualities, unusual honesty, sympathy, high morals, and kindness. Being always a man of principles and conscientiousness in science and in his everyday life, for many he was a model person and scientist.\nHis world-wide reputation as a leading scholar was evident but he received less recognition by the authorities in his own country than one might have expected\n[\n2\n]\n:-\nNaimark's outstanding contribution to science and his international reputation did not, however, promote him to the official Soviet \"table of ranks.\" He never became a full-fledged academician, nor was he counted among the country's prominent mathematicians, and the 'Great Soviet Encyclopaedia' found no place for him.\nFinally let us note Naimark's wide range of interests\n[\n1\n]\n:-\nNaimark's life was governed by total dedication to science that led to a large scientific output. Nevertheless, he found time to read Western writers in their original languages and to follow developments in the fine arts. He was a skilful painter and knew a great deal about music.",
  "matematicos_citados_na_biografia": [
    "Mark Grigorievich Krein",
    "functional analysis",
    "Bezout",
    "determinant",
    "Steklov",
    "USSR Academy of Sciences",
    "spectral theory",
    "Hilbert",
    "representation theory",
    "von Neumann",
    "Israil Moiseevic Gelfand",
    "Gelfand",
    "habilitation",
    "Ivan Vinogradov",
    "Hilbert space",
    "abelian groups",
    "Lie groups",
    "matrix",
    "Harish-Chandra",
    "Lie",
    "I E Segal",
    "Banach",
    "E Hewitt",
    "Lorentz",
    "Wilhelm Magnus"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}