{
  "nome_completo": "Marta Irene Cavallo Bunge",
  "nome_curto": "Marta Bunge",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bunge/",
  "data_nascimento": "31 October 1938",
  "local_nascimento": "Buenos Aires, Argentina",
  "data_morte": "25 October 2022",
  "local_morte": "Brooklyn, New York, USA",
  "summary": "Marta Bunge was an Argentine mathematician who worked most of her career at McGill University in Montreal, Canada. An expert in category theory, she was known for her work on synthetic differential topology and toposes.",
  "biografia": "Marta Bunge\nwas the daughter of the civil engineer Ricardo Cavallo and his wife María Teresa. She was given the name Marta Irene Cavallo and only became known as Marta Cavallo Bunge after marrying Mario Bunge.\nArgentina had gone through a difficult political period in the\n1930\ns following a military coup. A revolution in\n1943\nsaw members of the military take control and in\n1946\nJuan Perón became president. His policies led to high inflation and opposition members were tortured or imprisoned. Marta was born into a Roman Catholic family who were strongly opposed to the government of Juan Perón. She had two younger sisters. She wrote about her childhood in\n[\n2\n]\n:-\nI lived the greatest part of my childhood and adolescence under the Peronist government, about which the only thing I was told was that it had to be opposed and never ever talked about in the presence of the domestic employees, presumably out of fear of being denounced to the police. As I had swallowed Catholicism without questioning, I did likewise with anti-Peronism. My parents were conservative - not to say reactionary. ...\nLike most middle-class Argentinians of my generation, I was educated\n(\nso to speak\n)\nin the midst of the Catholicism professed by my parents. I spent both my elementary and secondary school years as a day student at a religious school run by Carmelite Spanish nuns, situated in the Belgrano neighbourhood of Buenos Aires where we lived. The religion taught at the school was just a collection of rites and stories from the bible, which in fact was limited to the New Testament.\nAfter graduating from the High School, Marta decided that philosophy was the subject she wanted to study at university. The obvious place for an exceptionally good student from Buenos Aires to read for a philosophy degree was the University of Buenos Aires but Marta's parents had refused to let her study there since it was \"a focus of dangerous ideas and a bastion of Peronism.\" She enrolled, therefore, at the National Teacher's College which at least had the advantage of being close to her home. The teachers there were good and helpful, and Marta soon joined a group of bright girls who were looking to study some more advanced material than they were being taught. She was one of four students from the National Teacher's College who decided to audit the course 'Philosophy of Science' given by Mario Bunge at the Faculty of Philosophy of the University of Buenos Aires. She found the course\n[\n2\n]\n:-\n... both fascinating and hard, so much so that I had to ask my father, a civil engineer with a solid knowledge of the basic sciences and mathematics, for help in writing up the weekly essays required for it. His help, coupled with my willingness to learn, led me to become the best student in a course of fifty or so students. It was not long before Mario took an interest in me ...\nMario Bunge described in\n[\n1\n]\nhow their relationship developed:-\nMarta,\n19\nyears younger than I, was serious, intelligent, charming, courageous, beautiful, and elegant. She used to study together with three classmates a couple of years older than her. All four audited my philosophy course, and were enrolled in the teacher's college, which under Peronism had decayed less than the university. I started accompanying her to the Retiro railway hub, where we sat under the English Tower, distinguished by a copy of Big Ben and a reminder of the great power that Britain had exerted in our country. At first we took the first trains available, but we soon started missing trains. After a couple of months we confessed our mutual love. From then on we also met in parks, museums, and milk bars.\nThere were obvious difficulties with the relationship; their\n19\n-year age difference and they had a professor/student relationship. There were other difficulties, however, for Mario Augusto Bunge\n(1919\n-\n2020)\nhad divorced his wife Julia Molina y Vedia\n(1912\n-\n1985)\n. He had two sons, Carlos Federico Bunge, known as Cantarito\n(\nborn\n1941)\nand Mario Bunge Jr., known as Bambi\n(\nborn\n1943)\n. Mario proposed marriage to Marta but at first she felt that, as a Roman Catholic, she could not marry someone who was divorced. He eventually convinced her to renounce her Roman Catholic faith but by this time her parents had discovered their daughter's relationship and told her that she must never see Mario again.\nThe\n12\nth International Congress of Philosophy was held in Venice, Italy in September\n1958\nand Mario Bunge attended the Congress. He wrote to Marta from Venice but had to send the letters of a friend to give to her since her parents would have destroyed any letters sent to her home. Back in Buenos Aires, Mario went to see Marta's parents and asked for their permission to marry their daughter. They refused saying that they would not allow Marta to marry a divorced man, especially one with political views of which they disapproved. Since Marta was not yet\n21\n, legally she required her parents' permission.\nMarta and Mario spent a few weeks discussing what they should do then, on\n30\nDecember\n1958\n, they boarded a plane from Buenos Aires to Córdoba City, Argentina, then went on by taxi to a tourist resort where they declared themselves married. They spent their honeymoon in a hotel on Carlos Paz reservoir. Marta had written a letter to her parents telling them what she was about to do and had Cantarito deliver it as soon as she had left Buenos Aires. Reluctantly, her parents agreed to the marriage and, some time after the couple returned, with her parents present they went to a lawyer who married them by proxy in Mexico.\nIn the first few months of\n1959\nMarta completed her philosophy degree. She now followed an unusual path, but a similar one to that followed by Mario. He had always wanted to be a philosopher but had decided to study for a Ph.D. in mathematical physics. He was awarded the degree in\n1952\nfor his quantum mechanics thesis\nLa cinemática del electrón relativista\nⓉ\n(\nThe kinematics of the relativistic electron\n)\nbefore returning to philosophy. Marta decided to study mathematics before returning to philosophy. Her choice of mathematics was made because her favourite course at the National Teacher's College had been logic.\nEnrolled at the University of Buenos Aires for an undergraduate mathematics degree, Marta found the going hard since the mathematics teaching at the religious High School had been poor. Mario taught her calculus and soon she was enjoying the university courses. Gregorio Klimovsky taught a course based on\nRoman Sikorski\n's\nBoolean algebras\nbook but the main mathematics courses she attended were taught by\nMischa Cotlar\n. She took a course based on a book by\nG H Hardy\non real functions. Following on from studying that book was a course on functional analysis. She also took a course on topology by Mario Gutiérrez-Burzaco and, under his supervision, read George Springer's\n1957\nbook\nRiemann Surfaces\n.\nMario had been invited to spend\n1960\n-\n61\nas a visiting professor at the University of Pennsylvania. Marta applied for admission to graduate studies there and was a bit surprised to be accepted. They flew from Buenos Aires to Los Angeles arriving on\n20\nAugust\n1960\n. Marta gave her name as Marta I Cavallo, her United States address as Department of Philosophy, University of Pennsylvania, and her permanent address as Florida\n656\nCapital Federal Buenos Aires. They returned to Buenos Aires in\n1961\nbut by\n1963\nthe political situation in Argentina was in turmoil and Marta and her husband decided to leave the country. They flew to Texas at the beginning of February\n1963\nwhere Mario taught for a term.\nRobert Lee Moore\n, although over\n80\n, still ran his seminar which Marta would have liked to audit.\nMoore\n, however, was not prepared to allow \"outsiders\" to attend his seminar. Marta learnt Greek during the term in Texas and, after going to the University of Pennsylvania to register for a Ph.D. she and her husband flew to Milan, took a ship to Piraeus and then drove to Corfu in a hire car.\nMarta loved Corfu and would spend much time there over the following years. After spending the summer there, they returned to the United States where Marta began working on her Ph.D. while Mario lectured at Temple University. Certainly at that time she was still intending to return to philosophy after the Ph.D. She had taken graduate courses on category theory from Peter John Freyd at the University of Pennsylvania and was awarded a Masters Degree in Mathematics in\n1964\n. Freyd became her Ph.D. thesis advisor but Marta realised that she wanted to make categories her life's work only after she met William Lawvere at the International Congress on Logic, History and the Philosophy of Science in Jerusalem held in the Hebrew University of Jerusalem in August-September\n1964\n. Lawvere\n(1937\n-\n2023)\n, who had studied for his Ph.D. at Columbia University advised by\nSamuel Eilenberg\n, was going to spend\n1964\n-\n1967\nat ETH in Zürich. Mario Bunge was awarded a Humboldt Foundation grant and spent a year at Freiburg im Breisgau, allowing Marta to travel weekly by train from Freiburg to Switzerland in order to participate in the\nBeno Eckmann\nseminar and discuss her research with Lawvere.\nGiving information about her thesis advisors in\n[\n4\n]\n, Marta Bunge writes:-\nAlthough Peter Freyd and Bill Lawvere shared\nSammy Eilenberg\nas an ancestor, they each had different original interests. Whereas Peter had started out with a\n1960\nPrinceton dissertation on a general theory of categories and functors in addition to his contributions to stable homotopy theory, followed by his highly original book on abelian categories influenced by\nAlexander Grothendieck\nand Peter Gabriel, Bill did so motivated instead by the work of\nClifford Truesdell\nand Walter Noll on continuum mechanics, a subject which he postponed to deal with until later while coming up in the meantime with a novel concept of algebraic theory for his\n1963\nColumbia dissertation. In both cases, their wide knowledge of mathematics became an important factor in their ability to grasp important concepts from various sources some of which had been previously unrelated, while doing so with rigour and precision not to speak of elegance.\nIn June\n1966\nMarta Cavallo Bunge was awarded a Ph.D. by the University of Pennsylvania for her thesis\nCategories of set valued functions\n. She gives the following Acknowledgements\n[\n3\n]\n:-\nI wish to express my gratitude: to Professor Peter Freyd, for having introduced me to the subject of categories as well as for his encouragement while I studied at the University of Pennsylvania; to Professor William Lawvere, for his inspiration in the writing of this paper and for his supervision while I was working on it at the E.T.H., Zürich; to Professors\nEmil Grosswald\nand Joachim Lambek, for their encouragement, and to Professor\nBeno Eckmann\n, for his hospitality at the Mathematisches Institut, E.T.H., Zürich.\nThe Preface to the thesis reads\n[\n3\n]\n:-\nThe theory of categories was introduced by\nEilenberg\nand\nMac Lane\nin\n1945\n; it arose from the field of topology. It was soon realised that other mathematical theories as well could profit from their invention. This was initially the main reason for the increasing interest in categories. The applications brought soon attention to problems peculiar to the theory of categories, which in a few years grew enough to become another area of mathematics. Even so, the now widespread interest in category theory seems still to lie in the many virtues of its applications, such as its unifying character, elegant and concise language, fruitfulness and emphasis on results involving structure. This led to the idea that category theory might provide a more suitable foundation for mathematics than set theory. To carry out this program it was necessary to have also a theory of the\n(\nmeta\n)\ncategory of categories. Lawvere has recently provided such a theory; this seems to be the proper framework in which to develop mathematics on a categorical basis.\nAn important step in the program of categorising mathematics has been accomplished by Lawvere himself upon reformulating set theory in terms of categorical concepts alone, namely, those of mapping, domain, codomain and composition.\nIn this paper we study a class of categories closely related to the category of sets and mappings.\nBoth Marta and her husband became unhappy living in the United States worried by attitudes people had to the Vietnam War, which they felt was unjust, upset by the discrimination they witnessed and other events such as the assassination of President Kennedy. After travel in Europe in\n1965\n-\n66\n, they ended up in Canada where both worked at McGill University in Montreal, Marta being appointed as a Post Doctoral Fellow, Mathematics in\n1966\n. She spent the rest of her career with positions at McGill University: Post Doctoral Fellow, Mathematics\n(1966\n-\n69)\n; Assistant Professor, Mathematics\n(1969\n-\n77)\n; Associate Professor, Mathematics\n(1977\n-\n85)\n; Professor, Mathematics\n(1985\n-\n2002)\n; and Professor Emerita, Mathematics\n(2003\n-\n2022)\n.\nMarta Bunge's first paper was\nRelative functor categories and categories of algebras\n(1969)\n. John Kennison writes in the review\n[\n8\n]\n:-\nThe author gives a clear account of this subject and provides generalised definitions for adjoints, functor categories and standard constructions\n(\nor triples\n)\n. The author obtains some substantial theorems which examine these concepts in relative category theory.\nShe attended the Midwest Category Seminar V in Zürich,\n24\n-\n30\nAugust\n1970\nand her second publication was the\n53\n-page paper\nBifibration induced adjoint pairs\npublished in the\nReports of the Midwest Category Seminar V\n(1971)\n. We note that\nMathSciNet\nlists a total of about\n50\npublications by Marta Bunge.\nMarta and Mario Bunge had two children: Eric Russell Bunge\n(\nborn\n1\nJune\n1967)\nand Silvia Alice Bunge\n(\nborn December\n1973)\n. Eric Russell, named Russell after\nBertrand Russell\nwhom both parents admired, became an architect working in New York while Silvia became a cognitive neuroscientist and professor at the University of California, Berkeley.\nMarta Bunge held the position of Visiting Professor at a number of institutions during her career. These include being Visiting Professor at: Matematisk Institut, Aarhus Universitet, Denmark\n(\nSummer\n1972)\n; Forschungsinstitut fur Mathematik, ETH Zurich, Switzerland\n(\nWinter\n1972)\n; IMAS, Universidad Nacional Autonoma de Mexico, Mexico City\n(1975\n-\n76)\n; Centre des Recherches Mathematiques, Universite de Montreal\n(1979\n-\n80)\n; Section des Mathematiques, Universite de Geneve, Switzerland\n(1986\n-\n87)\n; Dipartimento di Matematica, Universita di Genova, Italy\n(1993\n-\n94)\n; and School of Mathematics, Macquarie University, Sydney, Australia\n(\nJune-December\n2001)\n.\nThe authors of\n[\n6\n]\nwrite:-\nMarta Bunge's contributions to category theory mark her as one of its foundational figures. Alongside other luminaries in the field, she shaped its trajectory and made significant strides across various domains, from categorical logic\n(\na cornerstone of the McGill group\n)\nto topos theory, synthetic differential geometry, and synthetic differential topology. Marta possessed a keen eye for identifying and delving into fundamental ideas, coupled with a profound appreciation for the collaborative nature of category theory. Her collaborative endeavours include the monograph \"Singular Coverings of Toposes\"\n(2006)\nand the book \"Synthetic Differential Topology\"\n(2018)\n.\nFor more information about these two books, see\nTHIS LINK\n.\nIn\n1995\nMarta Bunge explained what she thought it meant to be a category theorist:-\nCategory theorists are conceptual mathematicians of a special kind. What binds them together is that they approach mathematical problems with a point of view that is radically different from that on which traditional mathematics is based, and which emphasises interactions between mathematical objects over their individual constituents. Their results are often surprising, provide new insights, and are obtained by the invention of sophisticated notions, theories, and techniques. Category Theory is only little more than\n50\nyears old\n(\ndating it back to the work of\nS Eilenberg\nand\nS Mac Lane\nin\n1945)\n- yet, its impact on several branches of mathematics has been considerable, in spite of the reluctance to recognise it as a revolutionary independent field dealing with foundational questions, very different from Set Theory.\nMario Bunge died in\n2020\nat the age of\n100\n. Marta Bunge died two years later and after her death her daughter Silvia Bunge wrote about her mother's last days\n[\n5\n]\n:-\nLess than a week before she passed away, and already very ill, she made a concerted effort to complete one last editorial review for a journal. As I told her, it would have been perfectly understandable under the circumstances for her to either decline to handle the submission or to conduct a cursory review. Instead, she read the paper carefully and wrote a detailed report. I was astonished then, as I have been on many other occasions, at both her formidable intellect and strength of character.\nAfter her mother died, Silvia wrote to her friends about her mother\n(\nsee\n[\n5\n]\nor\n[\n11\n]\n)\n:-\nMy mother was born and raised in Buenos Aires, after which she and my dad lived in the U.S. and Europe before settling in Montreal for decades. She was a theoretical mathematician with many outside interests, including music, literature, politics, and more. She was such a creative writer that we begged her to retire and write a novel, but she didn't want to give up on her work. A native Spanish speaker, she spoke English flawlessly and was fluent in French, Italian, and Greek. She was an adventurer, swimming long distances while dodging motorboats, cross-country skiing in the bitter cold north of Montreal, etc. - and she planned elaborate family trips to faraway lands like Egypt and India.\nMy mom was also very involved throughout her career in the struggle for human rights, advocating for mathematicians incarcerated for their political beliefs, and raising awareness about their conditions. She was an avid reader of many international journals, and uncompromising in her critique of nations that don't uphold human rights.\nMy mom was the only woman in her department at McGill University for the first\n30\nyears of her faculty position, after which a second one was hired. She experienced sexism but didn't consider herself a feminist; she just pursued her passion for mathematics. She didn't talk about her work much\n(\nwe wouldn't have understood it\n)\n, so it's been gratifying to hear from her colleagues and former students that she was a brilliant mathematician, an inspiring and generous teacher, and a warm colleague.\nFarewell to a bright, funny, cultured, elegant, passionate, and fearless mom.\nThe story of how Marta Bunge's valuable library was donated to the University of Sao Paulo is told in\n[\n11\n]\n:-\nThe library of Professor Dr Marta Bunge donated to the Institute of Mathematics and Sytatistics, University of Sao Paulo\n(\nIME\n)\nis composed of more than\n800\nbooks identified by the Bunge label and the ex-libris of a dragonfly. In overview, the books cover the area of Category Theory, Professor Bunge's specialty, whose knowledge can also be applied to other sciences\n(\nphysics, biology, philosophy, etc.\n)\n. ...\nThe story of this donation begins with a family friend, the Brazilian mathematician Valéria de Paiva, who works at the Topos Institute in Berkeley, California. A pioneer in Category Theory research in Brazil, she was a supporter of Dr Marta Bunge and has already spearheaded and co-edited a special issue of the journal Theory and Applications of Categories in her honour. So, after the death of Professor Marta Bunge, her daughter and son, Silvia and Eric Bunge, were looking for a university to donate her library, when they contacted Dr de Paiva to ask for help. She, meanwhile, informed Professor Hugo Mariano, from IME's Mathematics Department, about this opportunity. ...\nThe books were sent to the University of Sao Paulo's Institute of Mathematics and Statistics in São Paulo by ship. ...\nThe whole donation process took around eight months, and the books arrived in December\n2023\n, when they were cataloged and made available for borrowing at the IME Library. ... the donation consisted of\n856\nbooks ... The books can be identified by the \"BUNGE\" label on the spine, as well as the ex-libris stamp of a dragonfly on the first page. Many copies also have the signature of Professor Marta Bunge on the first page.\nThe symbol of the ex-libris was not chosen by chance. Silvia Bunge once read that the dragonfly symbolises wisdom and transformation: \"perfect for a body of knowledge transferred from our mother's personal library to a university.\" Her brother, Eric, recalled that during a walk, Professor Marta was once followed all the way home by a dragonfly.",
  "matematicos_citados_na_biografia": [
    "Roman Sikorski",
    "Mischa Cotlar",
    "G H Hardy",
    "Robert Lee Moore",
    "Moore",
    "Samuel Eilenberg",
    "Beno Eckmann",
    "Sammy Eilenberg",
    "Alexander Grothendieck",
    "Clifford Truesdell",
    "Emil Grosswald",
    "Eilenberg",
    "Mac Lane",
    "Bertrand Russell",
    "THIS LINK",
    "S Eilenberg",
    "S Mac Lane"
  ],
  "imagens": [
    "bunge.jpg"
  ]
}