{
  "nome_completo": "Martin David Davis",
  "nome_curto": "Martin Davis",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Davis/",
  "data_nascimento": "8 March 1928",
  "local_nascimento": "New York City, New York, USA",
  "data_morte": "1 January 2023",
  "local_morte": "Berkeley, California, USA",
  "summary": "Martin Davis was an American mathematician, known for his work on Hilbert's tenth problem.",
  "biografia": "Martin Davis\n's parents, Helen Gotlieb and Harry Davis, were brought up in Łódź, Poland. Both were Jewish and had known each other in Łódź before emigrating to the United States. Martin Davis wrote\n[\n1\n]\n:-\nMy mother as a teenage girl frequented the lending library that my father with other young 'free-thinkers' had set up.\nThey met again in New York after emigrating and they were married in that city. Martin was the oldest of his parents' two children, having a younger brother Jerome born in\n1933\n. Sadly Jerome died of a ruptured appendix at the age of eight, a devastating blow for thirteen year old Martin and his parents. Harry and Helen Davis had no formal education but learnt English at a night school for immigrants after arriving in New York. Harry was a talented artist but worked hard to support his family as an embroiderer of ladies clothes and household linen. Helen made women's corsets which she sold from a downstairs room in their apartment. The family struggled during the Depression and turned to the Home Relief programme during the middle\n1930\ns to have sufficient food to live. The young Davis was educated in public schools in New York, gaining much from the excellent Bronx High School of Science. This school had been founded in\n1938\n, not long before Davis began his education there\n[\n7\n]\n:-\nI was a bookish boy. And I got beat up a lot by more athletic boys! I got interested in science quite early. I wanted to be a paleontologist, then I wanted to be a physicist, and finally I fell in love with mathematics.\nHe graduated from the High School in\n1944\nand entered the City College of New York later that same year\n[\n7\n]\n:-\n... at City College, there were two people who had a big influence on me. One was\nEmil L Post\n, who was a great logician and a very direct influence on the direction of my work, and Bennington Gill, who was really a very inspiring teacher, even though his mathematical productivity pretty much ended with his dissertation.\nDavis took a course on symbolic mathematical logic in his first year and a reading course on real variable theory with\nEmil Post\nin his second year. In his third year he began taking a reading course with\nPost\non mathematical logic but this stopped when\nPost\nhad a breakdown. Certainly by the time Davis graduated from the City College with a B.S. in\n1948\nhe knew he wanted to undertake research in mathematical logic. He had already written a report as part of an advanced logic course he had taken in his final year and this was later incorporated into his Ph.D. thesis. After graduating, he entered Princeton to undertake research with\nAlonso Church\nas his advisor.\nAs a graduate student at Princeton, Davis was unhappy. He spoke in\n[\n7\n]\nabout a \"very heavy culture clash\" which made Princeton a difficult environment for a boy from a working class Jewish family brought up in the Bronx. He studied there for only two years, being awarded a Master's degree in\n1949\nand a Ph.D. in May\n1950\n. Although he had become fascinated by\nHilbert\n's Tenth Problem while studying with\nPost\nat the City College, he deliberately chose to concentrate on other topics for his thesis, namely hyperarithmetic hierarchy. His thesis\nOn the Theory of Recursive Unsolvability\ndid, however, contain a chapter on\nHilbert\n's Tenth Problem where he introduced the important idea of the Davis normal form. Since it played such a major role in Davis's career, perhaps we should say a little more about\nHilbert\n's Tenth Problem at this stage. The problem, as stated by\nDavid Hilbert\nat the International Congress of Mathematicians in Paris in\n1900\n, is rather different from the way that it is usually stated today so let us look at both aspects. The original problem is:-\nDevise a process according to which it can be determined by a finite number of operations whether a given polynomial equation with integer coefficients in any number of unknowns is solvable in rational integers.\nThe more modern statement would be:-\nDoes there exist an algorithm to determine whether a Diophantine equation has a solution in natural numbers?\nThe differences in these two statements are significant.\nHilbert\nbelieved that an algorithm\n(\ni.e. a process determined by a finite number of operations\n)\nexisted and the problem was to find it. However, certainly\nPost\nbelieved that the problem \"begs for an unsolvability proof\" and had used these words in his discussions with Davis. Let us now return to discussing Davis's career after the award of his doctorate.\nIn\n1950\nhe was appointed as a research instructor at the University of Illinois at Urbana-Champaign. There he taught a logic course which had computability as one of the main topics. This part of the course formed the basis for his book\nComputability and Unsolvability\nwhich was published in\n1958\n. It is interesting to quote from Davis's Preface:-\nThis book is an introduction to the theory of computability and noncomputability, usually referred to as the theory of recursive functions. This subject is concerned with the existence of purely mechanical procedures for solving problems. Although the theory is a branch of pure mathematics, it is, because of its relevance to certain philosophical questions and to the theory of digital computers, of potential interest to nonmathematicians. The existence of absolutely unsolvable problems and the\nGödel\nincompleteness theorem are among the results in the theory of computability which have philosophical significance. The existence of universal\nTuring\nmachines, another result of the theory, confirms the belief of those working with digital computers that it is possible to construct a single 'all-purpose' digital computer on which can be programmed\n(\nsubject of course to limitations of time and memory capacity\n)\nany problem that could be programmed for any conceivable deterministic digital computer. This assertion is sometimes heard in the strengthened form: anything that can be made completely precise can be programmed for an all-purpose digital computer. However, in this form, the assertion is false. In fact, one of the basic results of the theory of computability\n(\nnamely, the existence of nonrecursively enumerable sets\n)\nmay be interpreted as asserting the possibility of programming a given computer in such a way that it is impossible to program a computer\n(\neither a copy of the given computer or another machine\n)\nso as to determine whether or not a given item will be a part of the output of the given computer. Another result\n(\nthe unsolvability of the halting problem\n)\nmay be interpreted as implying the impossibility of constructing a program for determining whether or not an arbitrary given program is free of 'loops.'\nIt was at Urbana-Champaign that Davis met Virginia Whiteford Palmer whom he married on\n21\nSeptember\n1951\n. Virginia had an A.B. from Smith College, awarded in\n1950\n, and studied Library Science at the University of Illinois. Virginia, who became a textile artist, and Martin Davis had two children, Harold and Nathan. Davis was two years at Urbana-Champaign then spent the two years\n1952\n-\n54\nat the Institute for Advanced Study at Princeton. In\n1954\nhe was appointed as an Assistant Professor of Mathematics at the University of California at Davis where he spent a year before accepting a similar position at Ohio State University. Again after a year, he moved to the Hartford Graduate Division of the Rensselaer Polytechnic Institute in Troy, New York in\n1956\n. His first position at Rensselaer was as Assistant Professor of Mathematics but he was soon promoted to Associate Professor and remained there until\n1959\n. He then spent the year\n1959\n-\n60\nas a Research Scientist and Associate Professor of Mathematics at New York University, following which he spent the years\n1960\n-\n65\nat Yeshiva University, a Jewish university in New York.\nDuring these years when Davis was moving around spending time at various institutions, he published a number of important papers such as\nArithmetical problems and recursively enumerable predicates\n(1953)\n,\nThe definition of universal Turing machine\n(1957)\n,\n(\nwith Hilary Putnam\n)\nReductions of Hilbert's tenth problem\n(1958)\nand\n(\nwith Hilary Putnam and\nJulia Robinson\n)\nThe decision problem for exponential diophantine equations\n(1961)\n. In the first of these papers Davis made a very significant hypothesis relating to\nHilbert\n's Tenth Problem:-\nDiophantine sets are precisely those that can be generated by recursive functions or, what is the same thing, by a\nTuring\nmachine.\nThe\n1958\npaper with Hilary Putnam was the result of their families sharing a house while at a five-week logic conference at Cornell in the summer of\n1957\n. They then met up during the summers of the following three years, doing their most significant work on\nHilbert\n's Tenth Problem in\n1959\n. It would not be Davis who would eventually solve the Tenth Problem, rather it was solved in\n1970\nby\nYuri Matiyasevich\nfollowing further progress by\nJulia Robinson\n.\nFor his work on\nHilbert\n's Tenth Problem, particularly his remarkable paper explaining the proof, Davis received many honours and awards. In January\n1975\nhe was awarded the Leroy P Steele Prize by the American Mathematical Society:-\n... for his paper \"Hilbert's tenth problem is unsolvable\"\n(1973)\n.\nIt was this paper which also gained him the\nChauvenet\nPrize of the\nMathematical Association of America\nin January\n1975\n. In the same month he was awarded the\nLester R Ford\nPrize from the\nMathematical Association of America\n. He was the\nMathematical Association of America\n's\nEarle Raymond Hedrick\nLecturer in\n1976\n. In\n1982\nhe was elected to the\nAmerican Academy of Arts and Sciences\nand was awarded a Guggenheim Foundation Fellowship in\n1983\n-\n84\n. In\n2001\nhe was awarded a Townsend Harris Medal by the Alumni Association of the City College of New York.\nFinally let us look at some of the highly significant books that Davis has published. We have already mentioned\nComputability and unsolvability\n(1958)\nand quoted from the Preface. However, let us now give an indication of its reception by reviewers. C Elgot writes\n[\n4\n]\n:-\nThe author succeeds admirably in presenting a readable, motivated, yet not verbose, exposition of the theory of recursive functions.\nClifford Spector writes\n[\n12\n]\n:-\nThis text in recursive function theory is written for a wide audience. The first half could be used for advanced undergraduates, and the book as a whole provides a compact yet comprehensive introduction to the subject suitable for a graduate course. In addition it may be of interest to non-mathematicians such as philosophers and engineers. Aside from the ability to follow detailed proofs, very little mathematical background is required of the reader. The inclusion of intuitive explanations at crucial points makes it possible to skip many of the proofs if desired, or can serve to help the uninitiated student to develop the ability to follow rigorous proofs. On the other hand, recent developments are presented in a form for the more mature readers. One very desirable feature is the inclusion of convincing arguments that the fundamental definitions are natural rather than arbitrary.\nLouis Kattsoff seems less certain that the level is that broad\n[\n8\n]\n:-\nAlthough it is good to have this book, it is not precisely an \"introduction\" in the sense that students are led into the field \"from scratch.\"\nWe noted above that\nComputability and unsolvability\nstarted life as a lecture course while Davis's books\nLecture notes on mathematical logic\n(1959)\nand\nComputability\n(1974)\nare actually lecture courses.  The second of these consists of notes of lectures given during\n1973\n-\n1974\nat\nCourant\nInstitute of Mathematical Sciences at New York University. Another interesting book by Davis is\nApplied nonstandard analysis\n(1977)\n. The nature of this book is set by Davis's first sentence:-\nNonstandard analysis is a technique rather than a subject.\nDavis republished\nComputability and unsolvability\nin\n1982\nbut added his\n1973\naward winning paper\nHilbert's tenth problem is unsolvable\n(1973)\nas an appendix. Michael Stob\n[\n13\n]\ncriticises the book for being\n25\nyears old, and therefore out of date, but says that it is worth buying for the appendix which:-\n...  is a completely self-contained exposition of the proof that there is no algorithm for determining whether an arbitrary Diophantine polynomial equation with integer coefficients has an integer solution. It is a masterfully written article and, given to an undergraduate, is sure to awaken interest in computability theory. I know, I read it as an undergraduate and have been in love with recursion theory every since.\nIn\n1983\nDavis, in collaboration with Elaine J Weyuker, published\nComputability, complexity, and languages. Fundamentals of theoretical computer science\n. The authors write in the Preface:-\nIt is our purpose in writing this book to provide an introduction to the various aspects of theoretical computer science that is sufficiently comprehensive that the professional literature of treatises and research papers will become accessible to our readers. It is our hope, however, that this book will help readers to see theoretical computer science not as a fragmented list of discrete topics, but rather as a unified subject drawing on powerful mathematical methods and on intuitions derived from experience to give valuable insights into a vital new area of human knowledge.\nJohn Helm, reviewing the book, writes:-\n... the reviewer believes that this book fills a real need because of its comprehensiveness and its completeness, and predicts that it will be widely used as a text and reference for some time to come.\nIn\n2000\nDavis published\nThe universal computer. The road from Leibniz to Turing\nwhich was reprinted in the following year under the title\nEngines of logic. Mathematicians and the origin of the computer\n:-\nThis is an important book: it describes, for a wide audience, the logical underpinnings of computers and thus supplements in an illuminating way the remarkable story of the technological advances that make modern computers possible.\nJohn Dawson, reviewing the book, writes\n[\n2\n]\n:-\nThis book surveys developments in mathematics and logic that led the way to the design and construction of modern digital computers. ... its focus is on conceptual rather than technological advances.\nDavis retired from his chair in New York University in\n1996\nand moved to Berkeley, in California.",
  "matematicos_citados_na_biografia": [
    "Emil L Post",
    "Emil Post",
    "Post",
    "Alonso Church",
    "Hilbert",
    "David Hilbert",
    "Gödel",
    "Turing",
    "Julia Robinson",
    "Yuri Matiyasevich",
    "Chauvenet",
    "Mathematical Association of America",
    "Lester R Ford",
    "Earle Raymond Hedrick",
    "American Academy of Arts and Sciences",
    "Courant"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}