{
  "nome_completo": "Martin Eichler",
  "nome_curto": "Martin Eichler",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eichler/",
  "data_nascimento": "29 March 1912",
  "local_nascimento": "Pinnow, Germany",
  "data_morte": "7 October 1992",
  "local_morte": "Basel, Switzerland",
  "summary": "Martin Eichler was a German matnematician who worked in number theory.",
  "biografia": "Martin Eichler\n's father was a minister in the Church. Martin's parents gave him his early education before he entered the\nGymnasium\nin Gütersloh in\n1923\n. He studied there for seven years, graduating in\n1930\n. He then entered the University of Königsberg in\n1930\nwhere he studied mathematics, physics and chemistry. After going to Zürich to continue his studies, he then went to the University of Halle-Wittenberg where he wrote his thesis\nUntersuchungen in der Zahlentheorie der rationalen Quaternionenalgebren\nⓉ\n(\nInvestigations in the number theory of rational quaternions\n)\nwith Heinrich Brandt as his advisor. Eichler was awarded his doctorate in\n1936\n.\nFollowing the award of his doctorate, Eichler was appointed as an assistant in the Mathematical Seminar at the University of Halle. However, by this time the Nazis were in power in Germany. Eichler was dismissed from his assistantship for political reasons but fortunately\nHasse\nfound him a temporary position as an editor for a new version of the\nEnzyklopädie der Mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of Mathematical Sciences\n)\n. After Eichler worked on this for a while,\nHasse\nmanaged to arrange a position for him as an assistant at Göttingen. In\n1939\nhe submitted his\nhabilitation\nthesis to Göttingen and qualified to lecturer there.\nIt now appeared that, after a difficult period, Eichler's mathematical career was back on track thanks mainly to the efforts of Hasse. However World War II again caused an interruption to his career. Eichler was sent to Peenemünde to work at the\nHeeresversuchsanstalt\n, an extensive rocket development and test site which had been set up in\n1937\n. The team at Peenemünde, led by Wernher von Braun and Walter Dornberger, was involved in much more than rocket development. Radar was developed there as was the first closed circuit television system. During this period Eichler also worked at the Technical University of Darmstadt.\nAfter the war ended Eichler was eventually able to return to his university position as Göttingen which he did in\n1947\n. He then went to the Royal Aircraft Establishment at Farnborough in England where he spent two years returning to Germany in\n1949\n. He was appointed as an extraordinary professor at the University of Munster where he remained until\n1956\nwhen he went to the University of Marburg as an ordinary professor. Two years later he was invited to Basel to succeed\nOstrowski\nwho had retired in\n1959\nafter holding the chair at Basel for over\n30\nyears. Eichler wrote\nAlexander Ostrowski. über sein Leben und Werk\nⓉ\n(\nAlexander Ostrovsky: his life and work\n)\na fine tribute to\nOstrowski\nin\n1988\n. He married Erika Paffen; they had two children.\nEichler's early papers include\nÜber die Einheiten der Divisionsalgebren\nⓉ\n(\nOn the units of division algebras\n)\n(1937)\n,\nEinheitentheorie der einfachen Algebren\nⓉ\n(\nTheory of units of simple algebras\n)\n(1938)\n,\nÜber die Idealklassenzahl total definiter Quaternionenalgebren\nⓉ\n(\nOn the ideal class number of totally definite quaternionic algebras\n)\n(1938)\n. Slightly later he wrote a number of papers on the theory of quadratic forms such as\nÜber gewisse Anzahlformeln in der Theorie der quadratischen Formen\nⓉ\n(\nOn certain number formulas in the theory of quadratic forms\n)\n(1943)\n,\nZur Theorie der quadratischen Formen gerader Variablenzahl\nⓉ\n(\nOn the theory of quadratic forms straight variable number\n)\n(1945)\nand\nZahlentheore der quadratischen Formen\nⓉ\n(\nNumber theory of quadratic forms\n)\n(1946)\n. In\n1952\nhe published the book\nQuadratische Formen und orthogonale Gruppen\nⓉ\n(\nQuadratic forms and orthogonal groups\n)\n. B W Jones writes:-\nThe aim of the author is to develop in this book a thoroughgoing, self-contained theory of quadratic forms from a completely modern point of view. ... The quadratic forms are considered as metrics of a vector space in an arbitrary field and associated with such a metric is the orthogonal group in the broad sense of an automorphic transformation of the form. ... the spirit of the work of Hasse, Hecke, and Siegel pervade this volume and the power and beauty of the general modern methods is evident throughout.\nLater books by Eichler include:\nEinführung in die Theorie der algebraischen Zahlen und Funktionen\nⓉ\n(\nIntroduction to the theory of algebraic numbers and functions\n)\n(1963)\ntranslated into English as\nIntroduction to the theory of algebraic numbers and functions\n(1966)\n;\nProjective varieties and modular forms\n(1971)\n; and\n(\ncoauthored with Don Zagier\n)\nThe theory of Jacobi forms\n(1985)\n. The first of these is described in a review by A Mattuck which begins as follows:-\nThree books peacefully coexist between the covers of this work: one on algebraic functions of one variable, an introduction to algebraic number theory, and an exposition of modular forms with some applications to analytic number theory. Their association is rather loose, and occasionally a turn of the page means not only a change of scene but a new cast of characters as well. However, the modular forms gain by being placed in the context of algebraic function theory and serve to illustrate it as well, while the elementary substratum common to algebraic numbers and functions is well known.\nA review of\nThe theory of Jacobi forms\npays it this fine compliment:-\n... the material is of such intrinsic beauty and importance that no serious student of arithmetic should miss this book.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Hasse",
    "habilitation",
    "Ostrowski"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}