{
  "nome_completo": "Mary Everest Boole",
  "nome_curto": "Mary Everest Boole",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boole_Mary/",
  "data_nascimento": "11 March 1832",
  "local_nascimento": "Wickwar, Gloucestershire, England",
  "data_morte": "17 May 1916",
  "local_morte": "Notting Hill, Kensington, England",
  "summary": "Mary Everest Boole was an English mathematician who was married to George Boole. She wrote a number of books on mathematical education.",
  "biografia": "Mary Everest\nwas the daughter of Reverend Thomas Roupell Everest\n(1800\n-\n1855)\n, Rector of Wickwar, and Mary Ryall\n(\nborn\n1815)\n. Thomas Everest had one brother, George Everest\n(1790\n-\n1866)\n, who was the surveyor and geographer after whom Mount Everest was named. Mary Ryall had a brother John Ryall who became Vice President and Professor of Greek at Queen's College, Cork. After Mary Everest married\nGeorge Boole\nshe became known as Mary Everest Boole. For simplicity, we shall refer to her as Mary Boole throughout this biography. She had a brother, George John Everest\n(1835\n-\n1908)\nwho became vicar of Teynham in Kent.\nThomas Everest studied at Pembroke College, Cambridge and was ordained in\n1826\n. He was a priest at Bristol Cathedral before becoming rector of Wickwar, near Chipping Sodbury in Gloucestershire, in\n1830\n. On\n27\nSeptember\n1830\nhe married Mary Ryall; their daughter Mary\n(\nthe subject of this biography\n)\nwas born in\n1832\nand their son George in\n1835\n. In\n1837\nan influenza epidemic swept through England leaving Thomas Everest as an invalid. Being a strong believer in homeopathy, he went with his family to Poissy, near Paris, in France in\n1837\nto be treated by Samuel Hahnemann, the founder of the homoeopathic system of medicine, leaving his curate in charge of the church at Wickwar. Mary Boole was at this time five years old but she had to follow the same routine as Hahnemann devised for the whole family\n(\nincluding their servants\n)\n[\n9\n]\n:-\nThe regimen included frigid baths, a special diet, and long vigorous walks before breakfast, especially on cold days.\nBy\n1843\nThomas Everest was well enough to return to his church at Wickwar, but the family maintained the routine devised for them by Hahnemann for eleven years. Whether Thomas Everest recovered because of Hahnemann's treatment or in spite of Hahnemann's treatment is a matter of opinion but certainly the whole family had great faith in the homoeopathic approach.\nWhile in France, Mary Boole became bilingual in French and English. In fact, in later life she considered French her native tongue. She attended school as well as being tutored by a governess. Her mother also gave her lessons which she later described as \"hopelessly dreary.\" Later, while still in France, she was tutored by a Monsieur Deplace. She later wrote:-\nMonsieur Deplace is the hero of my idyll. I wish, though I know that the wish is vain, that I could convey any adequate impression of the way in which he enveloped my life with a protecting influence without the slightest interference with either my thoughts or my feelings.\nThe author of\n[\n9\n]\nwrites:-\nOne lesson Mary writes about is her problem in arithmetic with the \"double rule of three.\" Deplace told her nothing at the beginning, but he asked her a succession of questions. She was to write down each answer, as he asked the question. Then he asked her to analyse his questions and to review her answers to his questions. In this way, step by step, she perceived the answer to her complicated problem. Mary writes that Deplace was educated in the French school of mathematics.\nAt age ten, when still in France, Mary Boole heard her father speaking with a friend who was visiting from England. The friend spoke about the University of Cambridge being a great centre for mathematics and spoke, in particular, about\nCharles Babbage\n. After the friend left Mary heard her father talking to her mother saying he did not know what he would do with his children since his son lacked interest in education as he would expect of a girl, but his daughter had the educational interests and abilities he would expect of a boy. \"If only she could go to Cambridge and study mathematics she would carry everything before her,\" he said, \"but what could a girl do learning mathematics.\" Mary was shocked to learn that she could not go to university, she could not study mathematics and she would never meet the famous\nCharles Babbage\n.\nA year later the family were back in England. Mary Boole could not go to university but she could learn mathematics by teaching herself from books. She met many of her father's friends and these included\nJohn Herschel\nand\nCharles Babbage\n. This provided her with further motivation to read mathematics books. She attended school for a short time but soon was taken out of education to become an assistant to her father. She had some practical teaching experience taking the Sunday School class as well as writing experience helping her father with his sermons.\nIn December\n1843\nMary Boole's uncle, George Everest, returned from India. He had undertaken much work there for the Great Trigonometrical Survey and was knowledgeable about mathematics. He also had many fascinating tales to tell of his travels in India while carrying out the surveys. George Everest spent many hours with Mary, encouraging her and telling her about his experiences. George Everest enjoyed his discussions with Mary so much that at one time he even asked her father if he could not adopt her, but this was not what her parents wanted.\nIn\n1850\nMary met\nGeorge Boole\nin Cork\n[\n10\n]\n:-\n... during a visit to her uncle John Ryall, then vice-president of the college. While their opinions on certain matters were markedly divergent, in many respects it must have seemed that each had found a complementary partner in the other. Mutual interests in spirituality and mathematics figured prominently in their courtship as well as in their later life together. Indeed, their relationship evolved partly as a consequence of time they spent together devoted to Mary's private tuition, George proving particularly helpful to overcoming her various difficulties with differential calculus.\nWhen Mary met\nGeorge Boole\nshe was eighteen years old and he was thirty-five. For two years after they met they corresponded frequently, much of the letters being about mathematics and science. In\n1852\nGeorge Boole\nvisited the Everest family home in Wickwar and at this time he became more formally her mathematics tutor. The two continued to correspond about mathematics, but it is clear that they had developed a close friendship despite the fact that they were living far apart.\nOn\n15\nJune\n1855\nMary's father died leaving her without means of support and\nGeorge Boole\nproposed marriage. After a short engagement, they married on\n11\nSeptember\n1855\nat a small ceremony in Wickwar. The lived at first in Sundays Well Road, Cork, then in Castle Road, Blackrock, Cork, before moving to Litchfield Cottage, Ballintemple, Cork. It proved a very happy marriage with five daughters: Mary Ellen Boole born in\n1856\n, Margaret Boole born in\n1858\n, Alicia Boole\n(\nlater\nAlicia Boole Stott\n)\nborn in\n1860\n, Lucy Everest Boole born in\n1862\n, and Ethel Lilian Boole born in\n1864\n.\nGeorge Boole\ndied on\n8\nDecember\n1864\nwith his daughter Ethel Lilian less than seven months old; she had been born on\n11\nMay\n1864\n. Mary Boole was only\n32\nyears old, having five young daughters and no means of support.\nMary Boole moved back to England where, thanks to Frederick Denison Maurice, she was offered the position as a librarian at Queen's College, London. She lived at\n43\nHarley Street, London, and it is from that address that she wrote to Charles Darwin in December\n1866\n. For their correspondence, see\nTHIS LINK\n.\nFor information on the Boole children after their return to England, see\nTHIS LINK\n.\nWhile working as a librarian at Queen's College, London, Mary had given a\n[\n2\n]\n:-\n... series of talks to a group of London mothers who, finding their religion threatened by Darwin's new theories, sought Mrs Boole's philosophic wisdom.\nThese talks, Mary used as the basis for her book\nThe message of psychic science to mothers and nurses\nwhich she completed in\n1868\nbut it was only published in\n1883\n. It is claimed that she did not publish after it was written because, having shown it to F D Maurice, he was so displeased with it that he persuaded her not to publish it and had her dismissed from her position at Queen's College. She then lived with her unmarried uncle Robert Everest in Sunninghill, Berkshire; she is there at the time of the\n1871\ncensus but at this time her children are not living with her since they remained in Harley Street, London. Mary's occupation is given as \"Teacher of Mathematics\". Shortly after this she worked as James Hinton's secretary.\nJames Hinton\n(1822\n-\n1875)\nwas a talented surgeon who, as well as writing on his medical specialities, wrote on ethical subjects and on 'thinking'. Mary Boole described Hinton as a 'thought-artist'. She wrote that\n[\n4\n]\n:-\nFor the thought-artist no opinion is right or is wrong. The all-important thing is the conduct of the thinking-machinery.\nAdela Pinch writes\n[\n4\n]\n:-\nBoole ... insisted on Hinton's writings as somehow not really writing, but pure thinking. Whatever it was about, Boole insisted, \"the motif was always the same - the Rhythm of Thought.\"\nJames Hinton died on\n16\nDecember\n1875\nand after this time Mary Boole began publishing books and articles. Let us note that Mary Boole's daughter Mary Ellen Boole married James Hinton's son Charles Howard Hinton\n(1853\n-\n1907)\nin\n1880\n. Charles Howard Hinton was a mathematician who wrote \"What is the Fourth Dimension?\" but, after being convicted of bigamy Charles and Mary Ellen went to Japan and then to the United States.\nAt the\n1881\ncensus Mary Boole was living at\n103\nSeymour Place, Marylebone, London with her\n22\nyear old daughter Margaret Boole whose occupation is described as \"Art Student\n(\nPainting\n)\n\". Mary's occupation is given, at this time, as \"Civil Service Pensioner\". At the\n1891\ncensus Mary Boole was visiting her mother who was living next door to Mary's brother George Everest, vicar of Teynham, Kent. Mary was described as \"living on her own means\". At the\n1901\ncensus Mary Boole was living at\n16\nLadbroke Road, Notting Hill, Kensington, London. She was again described as \"living on her own means\". She was at the same address at the\n1911\ncensus.\nAfter moving to London\n[\n11\n]\n:-\n... Mary began teaching, women initially and then children. She followed her tutor Monsieur Deplace's method with her own additions. She believed that children should be given mathematical objects to play with and develop, at their own pace, ideas of order and pattern. She invented curve stitching, or what we call today, string geometry, to help children learn about the geometry of angles and spaces. She was an outstanding teacher. One of Mary's pupils wrote to her saying: \"I thought we were being amused not taught. But after I left I found you had given us a power. We can think for ourselves, and find out what we want to know.\" Mary believed that it was possible to express all basic notions of the universe with numbers and symbols. At the age of\n50\n, she began writing a series of books and articles about this, publishing them regularly until the time of her death in\n1916\naged\n84\n.\nLet us now look briefly at some of Mary Boole's publications. These include:\nThe message of psychic science to mothers and nurses\nmentioned above\nSymbolic Methods of Study\n(\nK. Paul, Trench & Company,\n1884)\n;\nLogic taught by love\n(\nAlfred Mudge & son,\n1889)\n;\nMathematical psychology of Gratry and Boole: Translated from the Language of the Higher Calculus Into that of Elementary Geometry\n(\nSwan Sonnenschein & Company,\n1897)\n;\nBoole's Psychology as a Factor in Education\n(\nBenham & Company,\n1902)\n;\nThe cultivation of the mathematical imagination\n(\nColchester,\n1902)\n;\nLectures on the Logic of Arithmetic\n(\nClarendon Press,\n1903)\n;\nThe Preparation of the Child for Science\n(\nClarendon Press,\n1904)\n;\nMistletoe and Olive. An Introduction for Children to the Life of Revelation, etc.\n[\nIn Prose and Verse.\n]\n(\nLondon,\n1908)\n;\nThe Message of Psychic Science to the World\n(\nC. W. Daniel,\n1908)\n;\nThe Message of Psychic Science to Mothers and Nurses\n(\nC.W. Daniel,\n1908)\n;\nMiss Education and Her Garden: A Short Summary of the Educational Blunders of Half a Century - dedicated\n(\nwithout Permission\n)\nto the Educational Authorities of Great Britain\n(\nC.W. Daniel,\n1908)\n;\nPhilosophy and Fun of Algebra\n(\nC. W. Daniel,\n1909)\n;\nA Woodworker and a Tentmaker\n(\nC. W. Daniel,\n1909)\n;\nSuggestions for Increasing Ethical Stability\n(\nC. W. Daniel,\n1909)\n;\nSome Master Keys of the Science of Notation: A sequel to \"Philosophy and Fun of Algebra\"\n(\nC. W. Daniel,\n1911)\n;\nThe Forging of Passion Into Power\n(\nM. Kennerley,\n1911)\n;\nWhat One might say to a Schoolboy\n(\nC. W. Daniel,\n1921)\n;\nAt the foot of the Cotswolds\n(\nC.W. Daniel,\n1923)\n;\nThe Psychologic Aspect of Imperialism: A Letter to Dr Bose\n(\nC.W. Daniel,\n1931)\n.\nFor quotes from some of these books, see\nTHIS LINK\n.\nLet us just give here the contents of\nPhilosophy and Fun of Algebra\n(1909)\n:\nFrom Arithmetic to Algebra;\nThe Making of Algebras;\nSimultaneous Problems;\nPartial Solutions and the Provisional Elimination of Elements of Complexity;\nMathematical Certainty and Reductio Ad Absurdum;\nThe First Hebrew Algebra;\nHow to Choose Our Hypotheses;\nThe Limits of the Teacher's Function;\nThe Use of Sewing Cards;\nThe Story of a Working Hypothesis;\nMacbeth's Mistake;\nJacob's Ladder;\nThe Great X of the World;\nGo Out Of My Class-Room;\nSquare Root of -\n1\n;\nInfinity;\nFrom Bondage to Freedom; Appendix.",
  "matematicos_citados_na_biografia": [
    "George Boole",
    "Charles Babbage",
    "John Herschel",
    "Alicia Boole Stott",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}