{
  "nome_completo": "Mary Watson Whitney",
  "nome_curto": "Mary Whitney",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Whitney_Mary/",
  "data_nascimento": "11 September 1847",
  "local_nascimento": "Waltham, Massachusetts, USA",
  "data_morte": "20 January 1921",
  "local_morte": "Waltham, Massachusetts, USA",
  "summary": "Mary Watson Whitney was a mathematician and astronomer. She wrote around 70 astronomy papers, and directed the Vassar College Observatory. She was one of the first seven women to join the New York Mathematical Society in 1891",
  "biografia": "Mary Watson Whitney\nwas the daughter of Samuel Butterick Whitney\n(1814\n-\n1867)\nand Mary Watson Crehore\n(1823\n-\n1893)\n. Samuel Whitney was a successful real estate agent, but it was his wife who\n[\n9\n]\n:-\n... was of a retiring disposition, had intellectual tastes and was the one most deeply interested in the education of the children.\nSamuel and Mary Whitney had six children: Elisha Crehore Whitney\n(1846\n-\n1866)\n; Mary Watson Whitney\n(1847\n-\n1921)\n, the subject of this biography; Anne Maria Whitney\n(1849\n-\n1852)\n; Adaline Stearns Whitney\n(1852\n-\n1896)\n; Charles Abijah Whitney\n(1855\n-\n1909)\n; and Thomas Lawrence Whitney\n(1857\n-\n1873)\n. There were a number of tragedies among these children. Elisha Crehore Whitney, Mary's older brother, was lost in a shipwreck in the South Seas in May\n1866\nat the age of twenty. Anne Maria Whitney suffered from fits and died aged two years and five months, while Thomas Lawrence Whitney drowned in Waltham on\n26\nJune\n1873\nabout a month short of his sixteenth birthday.\nMary attended schools in Waltham where she showed excellent abilities in mathematics and was praised by her teachers for her enthusiasm for studying. Her school years were, of course, somewhat stressful since the American Civil War was fought from\n1861\nto\n1865\n. She was upset that universities did not accept girls and it looked as though high school education would be all that she would be able to undertake. She learnt, however, that, by a stroke of good fortune, a college for women was planned by to be set up in Poughkeepsie, New York, by Matthew Vassar\n(1792\n-\n1868)\nand was to be called Vassar College. He was interested in the sciences and one of the first buildings planned for the new college was an observatory.\nMaria Mitchell\nwas at this time the most famous female astronomer, in fact she was the only American woman with an international reputation as an astronomer. She had become famous with the discovery of a comet in\n1847\nand had won a gold medal for this discovery. Matthew Vassar wanted her to become the professor of astronomy at Vassar College and, to make it attractive, he had purchased an excellent telescope. This\n12\n-inch refractor was the second largest telescope in the United States at this time. Charles S Farrar\n[\n4\n]\n:-\n... professor of Mathematics, Natural Philosophy and Chemistry at Vassar from\n1865\n-\n1874\ndesigned and supervised the construction of the Observatory in\n1864\n.\nMitchell\naccepted and was in post when the College opened in\n1865\n.\nIt was in\n1863\nthat Mary Whitney graduated from the high school and, knowing now that Vassar College would open in\n1865\n, she had just over a year to wait. Certainly she was not one to waste this time but rather she saw it as providing an opportunity for her to be better prepared for higher education. In\n1860\n, the New-Church School had opened in the area of Piety Corner in Waltham. The principal teacher was Edwin A Gibbens, a Harvard graduate who had been teaching at the Boston Latin School. He became Whitney's private tutor and a combination of his skilful teaching and her ability and enthusiasm for learning meant that by the time she entered Vassar College in\n1865\nshe was exceptionally well prepared\n[\n9\n]\n:-\nIn September\n1865\n, accompanied by her father, Mary Whitney made the journey to Poughkeepsie and presented herself at Vassar on its opening day. There in its new reception rooms stood Miss Lyman, the Lady Principal, ready to welcome the eager students who thronged its portals. Assisting her were other women members of the faculty, among them Professor\nMaria Mitchell\n, the astronomer and most distinguished scientific woman of her time. Miss Whitney's attention was soon attracted by her striking figure and penetrating dark eyes and, in listening to her brilliant conversation, forgot everyone else. The attraction was no doubt mutual, for Miss\nMitchell\nwas an excellent judge of young people and must have recognised very quickly the superior ability and earnest purpose of this gifted young woman. In later years, she frequently said she did not know which was her greatest feat, to discover the comet which made her famous or to find Mary Whitney.\nAt Vassar College, Whitney began attending astronomy classes by\nMaria Mitchell\nwho taught the subject in a highly mathematical way. Discovering that most of her class did not have the necessary mathematical background,\nMitchell\ntaught the class mathematics. Whitney immediately stood out as the best student having already an excellent knowledge of mathematics and a passion to learn. Dorrit Hoffliet wrote\n[\n11\n]\n:-\nHer classmates called her 'Pallas Athene, Our Goddess of Wisdom'.\nThere were other students too who were quickly drawn to\nMitchell\n's teaching and six of these became known as the Hexagon. Whitney became the leader of the group; you can see a picture of them at the time of their graduation in\n1868\n, with Whitney in the centre, at\nTHIS LINK\n.\nThe Vassar College Observatory was, of course, a place for these students to learn about astronomy and soon Whitney was observing. But the Observatory dome served another purpose in that\nMitchell\nused it as a gathering place for the discussion of politics and women's issues. Speaking about\nMitchell\na few years after her death, Whitney wrote\n[\n11\n]\n:-\nShe was, however, a constant upholder of higher education of women, as she was of the theory of co-education, and in time she became an ardent suffragist.\nAlthough Whitney worked hard at her academic studies she also had time for other activities\n[\n23\n]\n:-\n... she was president of the maths club, active in the croquet and chess clubs, a contributor to student publications and a performer in dramatic productions.\n[\nShe was also\n]\nan editor of 'The Transcript', the first student journal, and president of the class in\n1867\n...\nThese fine university achievements were, however, accomplished in spite of family tragedies. Nothing was heard from Elisha Crehore Whitney, her older brother, after May\n1866\nand news reached the family that he had been shipwrecked in the South Seas. He was reported missing, and it was not known if he was among a boatload of survivors. Mary's father died suddenly on\n13\nMay\n1867\nnot knowing if his son had survived. Shortly after his death, the family received the news that Elisha was confirmed lost at sea.\nMaria Mitchell\n's father William B Mitchell was a schoolteacher and amateur astronomer. When\nMaria\nwas appointed to Vassar in\n1865\nshe lived with her father in the Vassar Observatory;\nMaria\n's mother had died in\n1861\n. After Whitney graduated with an A.B. on\n24\nJune\n1868\n, William Mitchell wrote to a friend saying\n[\n11\n]\n:-\nThou art right in supposing that I must miss the graduated astronomical class. It is a more severe experience than I had imagined it would be. Cara Glover and Mary Whitney especially, who had in a manner adopted us as step-parents, are a great miss to us. Without disparagement ... to Mary Whitney is to be awarded the palm of unrivalled qualities.\nMaria Mitchell\nwas sad to see her students Sarah Mariva Glazier, Mary Whitney and Louise Blatchley, three of the Hexagon, leaving Vassar College. She wrote these lines while saying goodbye to the three girls at the railway station as they left Vassar College\n[\n9\n]\n:-\nSarah, Mary, Louise, and I\nHave come to the crossroads to say good-bye;\nA knot of lovers, - a circle of peers.\nThey in their youth and I in my years.\nBathed in tears and covered with dust,\nWe say good-bye, because we must;\nWilling to bear the parting and pain,\nBelieving we all shall meet again;\nThat if God is God and truth is truth,\nWe shall meet again and all in youth.\nWhitney had decided that she wanted to continue studying, so before leaving Vassar,\nMitchell\ngave Whitney her own copy of\nTheoria Motus Corporum Coelestium in Sectionibus Conicis Solem Ambientium\nby\nCarl Friedrich Gauss\n. This book, written in Latin and published in\n1809\n, arose from\nGauss\n's work on computing the orbit of dwarf planet Ceres, discovered in\n1801\n, from a small number of observations. After graduating she returned home to support her mother now that her elder brother and father had both died. She took a job teaching mathematics at a school in Auburndale, Massachusetts, to the south of Waltham.\nThere was a solar eclipse on\n7\nAugust\n1869\nwith the narrow path of totality passing through the middle of the state of Iowa. Whitney made an expedition to Burlington with\nMitchell\nand seven other graduates of Vassar College to view the eclipse using a three-inch Alvan Clark telescope which had been specially made for the occasion. Knowing that Whitney was desperate to continue studying,\nMaria Mitchell\ncontacted\nBenjamin Peirce\nat Harvard, asking if he would allow her best student Whitney to attend his lectures on quaternions. This, of course, was a difficult request since Harvard did not admit women.\nBenjamin Peirce\nagreed that he would take her into his lectures as his guest. Once the male students had accepted that a woman was attending the lectures, Whitney was able to make her own way to the lectures without being chaperoned by\nBenjamin Peirce\n. She also attended a graduate course\nBenjamin Peirce\ndelivered on Celestial Mechanics which could only go ahead if three students attended. In fact there were exactly three, Whitney,\nBenjamin Peirce\n's son James Mills Peirce who was at this time a professor of mathematics at Harvard, and William Elwood Byerly who was an undergraduate at Harvard at that time but later became professor of mathematics there.\nBy September\n1870\n, Whitney was spending some time working with Truman Henry Safford at the Dearborn Observatory in Chicago. She made frequent visits to Vassar College and when an alumnae association was formed there in June\n1871\n, Whitney was elected president. She undertook this task with enthusiasm, and she was awarded a Master's Degree by Vassar College on\n26\nJune\n1872\n. Two other students were awarded an A.M. at that Commencement, one of whom was Sarah Glazier who had been a member of the Hexagon. What Whitney wanted, however, was an academic position in keeping with her skills, experience and knowledge but being a woman such positions were not open to her.\nIn\n1873\nWhitney's sister Adaline graduated from Vassar College and decided to study medicine in the University of Zurich. Mary, her brother Charles, and Mary's mother accompanied Adaline to Switzerland. As always, Mary Whitney continued to study while she was living in Zurich.\nRudolf Wolf\nwas professor of mathematics and professor of astronomy in Zurich at this time and she attended his lectures on Celestial Mechanics. She also attended lectures on Synthetic Geometry given by Carl Culmann, the professor at the Eidgenössische Technische Hochschule Zurich. Wishing to continue to build her mathematical expertise, Whitney bought many mathematical texts while living in Zurich. In\n1876\n, Mary, her brother and her mother all returned to Waltham leaving Adaline to continue her medical studies in Zurich.\nBack in Waltham, Whitney became a mathematics teacher at Waltham High School. She held this position for five years, later describing these as the most unsatisfactory years of her life, being forced to teach in a high school when she was certain that any man with the mathematical and astronomical expertise that she had would have easily been appointed to a university professorship. There was only one suitable position in the whole of the United States in astronomy, that being filled by\nMaria Mitchell\nat Vassar College. Two women's colleges\n[\n9\n]\n:-\n... Smith and Wellesley had opened in\n1875\nwhile she was still in Europe, but neither college had a department of astronomy and though she was equally fitted to teach mathematics, her well-known Unitarianism would have hindered her from securing an appointment at Wellesley.\nIn\n1881\nMaria Mitchell\n's health became frail and Vassar College asked Whitney if she would consider assisting her. Whitney agreed and resigning her position at Waltham High School, she took up the position at Vassar College. The appointment, however, was rather ambiguous as Caroline Furness points out\n[\n9\n]\n:-\nShe shared in the teaching and kept up the routine of work of observing with the transit instrument for the time service. Much to her disappointment, however, no opportunity was afforded her of doing independent work with the twelve inch telescope. On account of Professor\nMitchell\n's health, it was seldom used except for demonstration to the students. Her position, too, was a little ambiguous, for she was Professor\nMitchell\n's private assistant and ranked in the catalogue merely as a graduate student.\nKeen to gain more experience in observational astronomy, Whitney looked for an observatory that would let her make use of a telescope. She could not let\nMaria Mitchell\ndown so it would also require someone to stand in for her as\nMitchell\n's assistant. In\n1887\nan assistant was found and Edward C Pickering\n(1846\n-\n1919)\n, the director of Harvard College Observatory, welcomed Whitney. She was to assist Arthur Searle in using a Russian diagonal transit instrument. It was a brief visit since\nMaria Mitchell\n, whose health was getting rapidly worse, resigned from Vassar College and at Christmas\n1887\nWhitney received a postcard from her saying that she had recommended Whitney as her successor. Soon after Whitney received a letter from the Vassar President asking her to return at once which she did still in the role of an assistant.\nWhitney now felt that her greatest responsibility was teaching her students and she put much effort into developing her lectures. She had for so long wanted to undertake observational research but the excellent\n12\n-inch equatorial telescope had never been used for research and Whitney spend many hours each night trying to master using it. She wrote frequently to Truman Henry Safford asking for his advice and he provided both advice and encouragement. Safford was now director of the Hopkins Observatory at Williams College in Williamstown and often she would visit him on her way to or from Boston. He encouraged her to undertake research and begin to publish papers but as\nMitchell\nhad not gone down that route, it was a big step for Whitney to take.\nMitchell\ndied on\n28\nJune\n1889\nand following that, Whitney was promoted to Professor of Astronomy and Director of the Vassar Observatory. She was also elected as secretary of the faculty\n[\n9\n]\n:-\nIn\n1889\n, when Miss Whitney became Professor of Astronomy at Vassar, she was forty-one years old and in her prime, strong in mind and body, and strong in character. There was much happiness in her home relations and she was conscious of the admiration and confidence of her friends. She was restive after her many years of unproductiveness and was eager to make a start. She felt her responsibility to the science of astronomy, but more than that she felt her obligation as a woman.\nThe outlook seemed very bright for Whitney at this time. Her sister had established a successful medical practice in Boston and had made a home there with their mother. Her brother was married, living in Waltham with children. Before long, however, her mother became seriously ill and her sister became a permanent invalid. The living accommodation at the Vassar Observatory was extended so that Whitney's mother and sister could live there. Whitney's mother died on\n31\nDecember\n1893\nbut Mary continued to look after her sister at the Observatory until her death on\n13\nFebruary\n1896\n.\nIn\n1891\nWhitney applied for membership of the\nNew York Mathematical Society\nwhich, six years later, changed its name to the\nAmerican Mathematical Society\n. The\nNew York Mathematical Society\nwas founded on\n24\nNovember\n1888\nat a meeting attended by only six people and a year later it was still very small with only eleven members. All these eleven were men but\nCharlotte Angas Scott\nbegan attending meetings of the Society soon after it was founded but could not join as membership was only open to those from New York. She was the first of seven women to join the Society, all seven becoming members in\n1891\n. It was in\n1891\nthat membership became open to those living outside New York. The other six women were\nCharlotte Angas Scott\n,\nAchsah Ely\n,\nSusan Jane Cunningham\n,\nMary Emma Byrd\n,\nEllen Amanda Hayes\nand\nAmy Rayson\n.\nDespite the difficulties of having to look after her mother and sister, Whitney began to publish research papers describing observations she made from\n1890\nonwards. She observed mainly comets, variable stars, eclipses, and asteroids\n(\nwhich were called minor planets at the time\n)\n. You can see a list of the titles of\n70\npapers describing observations between\n1890\nand\n1910\nat\nTHIS LINK\n.\nA summary of her research work is given in\n[\n26\n]\n:-\nUnder her direction the Vassar Observatory gained an international reputation for accurate and valuable research. In\n1888\n, her first paper, reporting observations of a double star elicited recognition from Prof Burnham of the Lick Observatory. In the study of variable stars she was recognised as one of the most important contributors of her time. ... Her first major piece of research was to assist in determining the longitude of the newly established Smith College Observatory by simultaneous observations at Smith and Harvard. She then turned her attention to observing comets and plotting their exact location in the sky. She also observed several lunar eclipses and spent a great deal of time observing and charting the paths of numerous asteroids\n(\ncalled 'minor planets' at the time\n)\n. Most of the publications on these topics are series of tables reporting the detailed measurements. At a time when large numbers of these phenomena were just beginning to be identified her contributions were significant, and widely recognised among her fellow astronomers. She collaborated with astronomers at Harvard and Columbia, while leading astronomers\n(\ne.g. Safford, Young, & Percival Lowell\n)\nvisited her at Vassar. ... By the turn of the century she was addressing the problem of solar motion within the galaxy and examined several sophisticated mathematical formulas in a search for the most accurate method of determining this. In\n1905\nshe and her student Caroline Furness published a catalogue of all the stars located within\n2\ndegrees of the North Pole. After the turn of the century Prof Whitney's early interest in nova was revived, and she turned her attention to the study of variable stars, producing several short publications and a major monograph in\n1913\n(\nwhich was her last publication\n)\n. This study is a remarkable record of the careful and precise astronomical measurements.\nWhitney made two trips to Europe. The first was made in\n1901\ntogether with Caroline Ellen Furness. Furness had been an undergraduate at Vassar College where she had studied mathematics and astronomy. In\n1894\nshe had been appointed as Whitney's assistant at Vassar College and in\n1895\nshe became an instructor in mathematics. She had been awarded a Ph.D. by Columbia University in\n1900\n. Whitney and Furness sailed to Hamburg and then visited the Potsdam Observatory. Next they visited Prague and saw\nTycho Brahe\n's observatory there followed by visits to Heidelberg, the Royal Observatory in Strassburg, the Paris Observatory and London where they met\nAgnes Clerke\n[\n10\n]\n:-\nSuch a charming personality Miss\nAgnes\nhad, so gentle, so modest, and yet so full of knowledge.\nWhile in London they visited the Greenwich Observatory, then travelled to Cambridge where they met\nRobert Ball\nwho agreed to lecture at Vassar College on his forthcoming trip to America.\nThe second of Whitney's trips to Europe was made in the summer of\n1908\nwhen she met up with Furness who had just ended a stay at Groningen, and they spent two months living in the English countryside. Of course there had to be observatory visits and these were made to Oxford.\nIn March\n1910\n, Whitney suffered the same illness that had led to her sister becoming a permanent invalid. Just after a morning class she suffered a cerebral haemorrhage, resulting in the immediate paralysis of her entire left side. She was granted leave of absence due to ill health and Caroline Furness became director of the Vassar Observatory and chair of the Astronomy Department. Whitney spent the last ten years of her life unable to continue with the work that had meant so much to her. Until she officially retired in\n1915\nshe continued living in the Vassar Observatory. She then returned to her home in Waltham where she died of pneumonia. She is reported to have said on her deathbed: \"I hope when I get to Heaven, I shall not find the women playing second fiddle.\"\nFor tributes to Whitney, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Maria Mitchell",
    "Mitchell",
    "THIS LINK",
    "Maria",
    "Carl Friedrich Gauss",
    "Gauss",
    "Benjamin Peirce",
    "Rudolf Wolf",
    "New York Mathematical Society",
    "American Mathematical Society",
    "Charlotte Angas Scott",
    "Achsah Ely",
    "Susan Jane Cunningham",
    "Mary Emma Byrd",
    "Ellen Amanda Hayes",
    "Amy Rayson",
    "Tycho Brahe",
    "Agnes Clerke",
    "Agnes",
    "Robert Ball"
  ],
  "imagens": [
    "whitney_mary.jpg"
  ]
}