{
  "nome_completo": "Doris Mary Cannell",
  "nome_curto": "Mary Cannell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cannell/",
  "data_nascimento": "19 July 1913",
  "local_nascimento": "Liverpool, England",
  "data_morte": "18 April 2000",
  "local_morte": "Nottingham, England",
  "summary": "Mary Cannell was an English mathematician and historian who worked extensively on George Green.",
  "biografia": "Mary Cannell\nwas the daughter of the post office clerk Robert James Brownburgh Cannell\n(1882\n-\n1961)\nand Mary Singleton\n(1883\n-\n1967)\n. Robert Cannell\n(\nborn\n24\nNovember\n1882)\nand Mary Singleton\n(\nborn\n1\nJanuary\n1883)\nwere married on\n10\nAugust\n1911\nat the Parish Church, St Johns Bootle, Lancashire. Bootle is a town on the west coast of England just north of Liverpool. Mary, the mother of the subject of this biography, was the oldest child of the tram owner William Singleton and his wife Martha. Her occupation was recorded as \"pupil school teacher\" in the\n1901\ncensus and, a few months before her marriage, as \"teacher assistant\" working for the Bootle Education Committee in the\n1911\ncensus. Robert and Mary Cannell lived at\n35\nMerton Road, Bootle, Liverpool and they had two children, Mary Cannell, the subject of this biography, and Robert Leslie Cannell, born\n6\nOctober\n1920\n, who became an engineer.\nMary was born a year before World War I broke out. Her father served in the Royal Signal School of the Royal Engineers during the war. She was brought up in Liverpool where, after winning a scholarship, she attended Merchant Taylors' Girls School in Great Crosby, about\n5\nkm north of Bootle. This independent school, opened in\n1888\n, had around\n300\npupils when she was studying there. It had a good reputation for academic success. On\n14\nMarch\n1923\nshe was confirmed by the Bishop of Liverpool at St Faith's Church, Great Crosby. Many pupils from Merchant Taylors' Girls School were confirmed into the Church of England at this Church. After completing her studies at this school she entered the University of Liverpool to study French. As a second subject she studied history.\nAfter completing her first degree, Cannell studied for a postgraduate diploma in education so that she might enter the teaching profession. Indeed she did became a school teacher and taught French. During a spell in France, she taught English.\nDuring World War II Cannell undertook war work lecturing to troops. It was to prompt a change in her career for she then moved into higher education. The rest of her career was spent in training teachers at the Teacher Training College in Worcester and she progressed to high positions in this area. In\n1960\nshe was appointed as Deputy Principal of Nottingham College of Education. She took on the role of overseeing the amalgamation of the College with Trent Polytechnic in\n1974\n. The combined educational establishment has now become Nottingham Trent University.\nThere is no hint in the biographical details which we have just given as to why Mary Cannell might figure in an archive of mathematicians. Indeed it was the work which she undertook after she retired which earns her a place in this archive as a highly respected historian of mathematics.\nHer work stemmed from the fact that\nGeorge Green\nhad worked as a miller near Nottingham.\nGreen\nwas a mathematician who was well known to almost all students of mathematics around the world, yet little was known of his life. John Fauvel writes in\n[\n5\n]\n:-\n... widespread knowledge of\nGreen\nhimself dates only from the\n1970\ns when Cannell and other Nottingham colleagues worked to restore his windmill and his memory.\nWhen I\n[\nEFR\n]\nfirst visited\nGreen\n's windmill in Nottingham the booklet which I purchased was\nGeorge Green: Miller and Mathematician,\n1793\n-\n1841\nwritten by Mary Cannell published by the City of Nottingham Arts Department in\n1988\n. She produced a major biography of Green\nGeorge Green: Mathematician and Physicist\n1793\n-\n1841\n: The Background to His Life and Work\nin\n1993\n. Lawrie Challis writes in the Foreword of the book\n[\n3\n]\n:-\nI first met Mary Cannell in\n1977\n, soon after the start of a campaign to restore Green's Mill. She had recently retired as Acting Principal of Nottingham College of Education, then one of the largest Colleges of Education in England, and I was very grateful when she agreed to become Honorary Secretary of the\nGeorge Green\nMemorial Fund. At that stage I had thought only of harnessing to our cause her very considerable energy, determination and organisational ability; I had not dreamed that she would also spend much of the next fifteen years unravelling\nGreen\n's story. The work has taken her around the country talking to\nGreen\n's descendants, many times to Cambridge, particularly Caius and Queens' colleges, to Edinburgh and Manchester and even to Melbourne, Australia, to talk to J J Cross, an authority on\nGreen\n's period in the history of mathematics. She has shared her enthusiasm with many; she is a vivid lecturer and has given well over fifty lectures on\nGreen\n. Her book will allow this enthusiasm to reach a much wider audience, and we are greatly in her debt. Her claim that she has worked more as editor than as prime researcher is far too modest. She has illuminated our picture of\nGreen\nin many ways, and one that I find particularly interesting is her identification of Toplis as the Nottingham mathematician most likely to have guided\nGreen\n's education after his eighteen months at school. I have found only one omission in the book, and that is reference to the vital role she herself played in the restoration of\nGreen\n's Mill and the organisation of his bicentenary celebration. Through this work on\nGreen\n, Mary Cannell has made many friends in the local and scientific communities, and I am delighted to have this opportunity of thanking her on their behalf and mine for her work, and for this intriguing book.\nFor more information about this book, including extracts from the Prefaces and reviews of the\n1993\nand\n2001\neditions, see\nTHIS LINK\n.\nIn addition she wrote research articles on\nGeorge Green\n's life and work bringing to the world of mathematics an understanding of\nGreen\n's remarkable life. In collaboration with N J Lord, she wrote\nGeorge Green, mathematician and physicist\n1793\n-\n1841\npublished in the\nMathematical Gazette\nin\n1993\n. It has the following Abstract:-\nThese past two years have seen the bicentenaries of\nMichael Faraday\n,\nCharles Babbage\nand\nJohn Frederick Herschel\n. A fourth contemporary, who deserves to rank with these, is\nGeorge Green\n, the bicentenary of whose birth will be marked by the dedication of a plaque in Westminster Abbey. His memorial will be in proximity to those commemorating\nNewton\n,\nKelvin\n,\nFaraday\nand\nClerk Maxwell\n. Those to the Herschels\n(\nWilliam Herschel\nand\nJohn Herschel\n)\nand\nStokes\nare close by.\nGreen\n's memorial designates him \"Mathematician and Physicist\". Most mathematicians will know of\nGreen\n's theorem and\nGreen\n's functions; physicists find his papers seminal to the study of, for example, solid state physics and elasticity and, since the mid-twentieth century,\nGreen\n's functions have become an indispensable technique for those working in nuclear physics.\nThe single author work by Cannell,\nGeorge Green: an enigmatic mathematician\n, appeared in the\nAmerican Mathematical Monthly\nin\n1999\n. It begins:-\nThe mathematics developed by\nGeorge Green\nhas been widely applied in modern physics and quantum electrodynamics yet his life has remained something of a mystery. There is no reference to him in the main volumes of the Dictionary of Scientific Biography: he is belatedly and briefly included in the Supplement of\n1976\n. The bicentenary celebrations of his birth in\n1993\nfocused increasing attention on the man who gave the world\nGreen\n's functions.\nThis 'Monthly' has already published an authoritative account of\nGreen\n's first and seminal publication, 'An Essay on the Application of Mathematical Analysis to the Theories of Electricity and Magnetism', which examined in some detail his use and development of mathematical sources. What is presented here is a short survey of\nGreen\n's life and an examination of the circumstances and the social environment in which he lived. The great problem is the lack of material concerning\nGreen\n. His output was small; ten papers including the 'Essay', written in the space of eleven years, amounting to less than\n250\npages of print. There are no manuscripts, no working papers, no diaries, no memorabilia. There are a dozen letters to his patron, but no replies. There is no portrait or photograph. There was no established family house for his common-law wife, Jane Smith, and their seven children, and when the last, Clara, died in\n1919\n, the family was thought to be extinct.\nThe few official facts of\nGreen\n's life were established and published by H G Green\n(\nno relation\n)\n. His paper included two valuable letters written in\n1845\nby\nGreen\n's cousin and brother-in-law, William Tomlin, and Edward Bromhead, his patron. In the\n1970\ns\nGreen\n's letters to Bromhead came to light - the only information extant in\nGreen\n's own hand, the only testimony to his mathematical thought and the only revelation of his personality.\nGreen\ndied at the age of forty-seven, just at the time when his work was about to be recognised: in consequence he established no reputation in his lifetime.\nJohn Fauvel writes in\n[\n5\n]\n:-\n[\nMary Cannell\n]\ncharmed audiences on several continents, promoting interest in\nGreen\nand early\n19\nth -century mathematical physics, in the clear tones and pure vowels of pre-war English, somewhere between Miss Marple and Dame Peggy Ashcroft.\nMary's pre-war studies into French culture lent insight into the mathematical sources used by\nGreen\n, and her interest in English social history enabled her to appreciate the unrewarding and frustrating position in which he lived - that of a working miller and mathematical genius, struggling to find a voice in a period of social privilege and rigid class structure.\nMary Cannell was working on projects of one sort or another - the\nGreen\nwebsite, the revised edition of the biography, research papers, the catalogue in the university of Nottingham library - right to the end, in days filled with her characteristic energy and enthusiasm.\nShe received numerous invitations to give lectures\n[\n4\n]\n:-\nMary gave well over\n50\nlectures on\nGreen\nto local societies and wrote an illustrated booklet that has so far sold over\n5000\ncopies. The interest this engendered and her realisation that there was much to be done to place\nGreen\n's life in its context within English social history at a time of rigid class divisions led her to begin work on the first edition of the biography. Her research was extensive and earned her great respect as an historian of mathematics. She was invited to lecture on\nGreen\nat a number of Universities in Britain, Canada and the United States and her splendid lecture at the\nRoyal Society\nduring the Bicentenary meeting will be remembered for many years.\nFor many years Cannell was Secretary of the\nGeorge Green\nMemorial Fund. They worked with appeals and other methods to raise the money to restore\nGreen\n's Mill in Sneinton during the\n1970\ns and\n1980\ns. The\nGeorge Green\nMemorial Fund was also involved in major celebrations in\n1993\nto commemorate the bicentenary of\nGreen\n's birth, culminating in the dedication of a memorial plaque to\nGreen\nin Westminster Abbey. Lawrie Challis writes\n[\n4\n]\n:-\nThe\nGeorge Green\nMemorial Fund had been set up, a year or two before Mary retired, with the aim of restoring his ruined windmill, and Mary became an enthusiastic member of a team that worked closely with the Sneinton Environmental Society and the City authorities. She also made a major contribution to the organisation of the\n1993\nBicentenary celebrations of\nGreen\n's birth that involved events in Nottingham, Cambridge and London, and she gave much input on the design of the Memorial Services at Sr Stephen's, Sneinton and at Westminster Abbey. Many other activities supported by the fund, such as the naming of a\nGreen\nroom in the Bromley House Library, establishment of the\nGreen\nwebsite, the location of items for the\nGreen\nCollection in the University of Nottingham library and the restoration of Toplis' tomb in South Walsham, had been her idea and owed a lot to her in their execution. The\nGreen\nfamily became her friends and she wrote a letter to them every Christmas to explain what the Fund had done in the past year. She did all this with tremendous energy and enthusiasm and always with great friendliness and humour.\nMary Cannell received a number of honours including being made a Fellow of the University of Nottingham\n(1995)\n, an honorary graduate of the Open University\n(1996)\nand an honorary graduate of Nottingham Trent University\n(\nposthumously\n)\n(2000)\n. She died in the year\n2000\nand left money to fund Summer Studentships in mathematics at the University of Nottingham. We also note that she donated money to fund the\nGeorge Green\nPrize for Mathematics and the\nGeorge Green\nPrize for Physics at the Merchant Taylors' Girls School.\nLet us end with Lawrie Challis's description of Cannell\n[\n4\n]\n:-\nMary was a very special person who made friends and gained respect wherever she went. She had great warmth and a style and charm that seemed to come from a slightly earlier age. She is greatly missed by her many friends and colleagues.",
  "matematicos_citados_na_biografia": [
    "George Green",
    "Green",
    "THIS LINK",
    "Michael Faraday",
    "Charles Babbage",
    "John Frederick Herschel",
    "Newton",
    "Kelvin",
    "Faraday",
    "Clerk Maxwell",
    "William Herschel",
    "John Herschel",
    "Stokes",
    "Royal Society"
  ],
  "imagens": [
    "cannell.jpg"
  ]
}