{
  "nome_completo": "Mary Lee Wheat Gray",
  "nome_curto": "Mary Lee Wheat Gray",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gray/",
  "data_nascimento": "4 April 1939",
  "local_nascimento": "Hastings, Nebraska, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Mary Gray is an American mathematician, statistician, and lawyer. She has written on mathematics, education, computer science, statistics and academic freedom.",
  "biografia": "Mary Lee Wheat\n's parents were Lillie Alves and Neil Claude Wheat. Her mother had been a school teacher before she married and her father held a variety of jobs from policeman to truck driver and mechanic, and finally the manager of a trucking firm. In fact Mary was part of an extended family since her father's brother had married her mother's sister and they had one child, a son who was one year older than Mary. Three of Mary's grandparents had been born in Nebraska, while the fourth had emigrated to Nebraska from Germany.\nMary's parents encouraged her to learn when she was young. They taught her history and Mary's father was asking her mental arithmetic questions when she was five. She attended high school in Hastings, Nebraska, in the class one year below her cousin. The subjects which she enjoyed most were mathematics, history and physics. When she was in her final year of study her father died from a heart attack. At this stage Wheat's mother took a job working in Hastings College cafeteria to help support the family and, after graduating from high school, Wheat became a student at Hastings College. It was in her second year that a new lecturer, Jim Standley, joined the mathematics staff at the College. Her talent for mathematics had already been recognised but it was Standley who suggested to Wheat that she go on to postgraduate work. It was something she had never considered before, but once it was suggested to her she found it an attractive idea.\nWheat graduated from Hastings College in\n1959\nhaving taken mathematics and physics as major subjects. She had been awarded a Fulbright fellowship to allow her to study in Germany so she went to Frankfurt to study at the J W Goethe Institute. Returning to the United States after a year, Wheat began graduate studies at the University of Kansas. She was awarded a Master's degree in\n1962\nand continued research for her doctorate supervised by William Scott. After submitting her thesis\nRadical Subcategories\nin\n1964\nshe was awarded her Ph.D. Her studies were partially financed by fellowships from the National Science Foundation and partly by working as an assistant instructor at the University of Kansas. She was also employed as a physicist at the National Bureau of Standards each summer.\nAfter graduating, she married Alfred Gray, also a mathematician, whom she had met while at the University of Kansas. Her husband was appointed to the University of California at Berkeley while Mary Gray taught a course at Berkeley during the summer and then was appointed to the California State University at Hayward. In\n1967\nshe published two papers,\nRadical subcategories\nand\nAbelian objects\nboth of which were published in the\nPacific Journal of Mathematics\n. In the following year Mary and her husband moved. He was appointed to the University of Maryland and she was appointed to the American University in Washington. They chose to live between the two sites to make sure neither had too long a journey to work. In\n1970\nshe published an important book\nA radical approach to algebra\n. Edward Patterson writes that the book:-\n... takes the idea of a radical as its main theme, to which it sticks closely throughout, whilst nevertheless describing many other significant ideas of modern algebra. ... The method of presentation in this book is to introduce ideas in basically an ascending order of technical complexity, which results in the material being arranged to a certain extent in the historical order of development. ... The book is well written and proofs are set out in a concise manner.\nGray has done much to support the role of women mathematicians. She published the article\nWomen in mathematics\nin the\nAmerican Mathematical Monthly\nin\n1972\n. At the time she was president of the Association for Women in Mathematics, an organisation which she helped to found, holding the position from\n1971\nto\n1973\n. It was a role which Gray undertook with determination. One of her first acts was to put pressure on the\nAmerican Mathematical Society\nwhom she felt did not have nearly enough women on their committees or among the speakers at their conferences. She tackled the problem head on and, after carefully reading the by-laws of the\nAmerican Mathematical Society\n, tried to attend one of the Council meetings of the Society. It was explained to her at the door that such meetings were not open for members to attend. Gray, who had read the by-laws, correctly explained that this was not specified but was told that members did not attend because of a gentleman's agreement. She then said, \"I'm not a gentleman, I'm staying.\" Later Gray was elected to the Council and in\n1976\nwas elected the second female vice president\n(\nthe first was\nCharlotte Scott\nseventy years earlier\n)\n. A good example of Gray's views is given in the article\nGender and mathematics: mythology and misogyny\nwhich she published in\n1996\nas a chapter in the book\nTowards gender equity in mathematics education\n(\nKluwer Acad. Publ., Dordrecht\n)\n. Another article which deals with these issues is\nThe Association for Women in Mathematics - a personal view\nwhich appears in the\nMathematical Intelligencer\n13\n(4)\n(1991)\n.\nIn addition to her mathematics, through the\n1970\ns Gray studied law, receiving a law degree with distinction from Washington College of Law in\n1979\n. Her training helped her fight more effectively for women's rights. Fasanelli writes\n[\n1\n]\n:-\n... she might easily be found in Bosnia, Chile, Israel or Rwanda. She might be found testifying before congressional committees on Capitol Hill or appearing as an expert witness in California courtrooms. Through her knowledge of law and statistics, and her attention to social justice, she has found many ways to use her professional training to help people around the world. ... She testified about income tax reform to the U.S. House Ways and Means Committee; on affirmative action at the Department of Labor; on pensions and insurance for five U.S. congressional committees as well as in eight states from Maine to Oregon. She has also testified on age discrimination, Social Security, pay equality, women and the military, retirement income security, the constitutional right to travel, and women in science.\nOf the awards which Gray has received we mention two in particular. She was honoured by the Association for Women in Mathematics in\n1991\n. The citation reads:-\nIt is especially fitting that Mary Gray be honored at the Twentieth Anniversary meeting of the Association for Women in Mathematics, since she is the one person most responsible for the existence of this organization; for years her name was virtually synonymous with Association for Women in Mathematics. She ran the organization almost single-handedly for its first two and a half years, serving as chair during that period and producing the Newsletter for the first four years.\nDuring this same period, Mary was working to insure broader membership participation in the established mathematical societies. She worked to open American Mathematical Society Council meetings to observers, as provided in the bylaws, and to make common practice the nomination by petition for certain American Mathematical Society offices. In\n1976\n, Mary became the second woman Vice President of the Society\n(\nnominated by petition\n)\nand the first in seventy years\nOn an even broader front, Mary has been active on Committee W, the Committee on Women of the American Association of University Professors, serving as its chair from\n1973\nuntil\n1978\nand again since\n1986\n. She served as President of Women's Equity Action Leagues from\n1982\nto\n1988\n. Her concern for the rights of all humans is evidenced by her involvement with Amnesty International, currently as Treasurer and member of the Board of Directors of Amnesty International USA.\nThe second award which we mention is the\n1994\nMentor Award for Lifetime Achievement from the American Association for the Advancement of Science. The award was given for\n[\n4\n]\n:-\n... the extraordinary number of women and underrepresented minorities she has affected in her career both directly and indirectly through the influence of her former students and the programs she has initiated and developed. Her twenty doctoral students include eleven women and five African American women.",
  "matematicos_citados_na_biografia": [
    "American Mathematical Society",
    "Charlotte Scott"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}