{
  "nome_completo": "Mary Emma Byrd",
  "nome_curto": "Mary Byrd",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Byrd/",
  "data_nascimento": "15 November 1849",
  "local_nascimento": "Le Roy, Calhoun, Michigan, USA",
  "data_morte": "13 July 1934",
  "local_morte": "Lawrence, Kansas, USA",
  "summary": "Mary Byrd was an astronomer and mathematician. She was director of the Smith College Observatory for nineteen years. She was one of the first seven women to join the New York Mathematical Society in 1891 .",
  "biografia": "Mary Byrd\nwas the daughter of John Huntington Byrd\n(1816\n-\n1897)\nand Elizabeth Adelaide Lowe\n(1821\n-\n1912)\n. John Huntington Byrd, born\n28\nDecember\n1816\nin Vergennes, Addison, Vermont, was a Congregational minister and a staunch abolitionist arguing forcefully to abolish slavery. Elizabeth Adelaide Lowe, born\n30\nAugust\n1821\nin Vienna, Oneida, New York, was descended from John Endicott, an early governor of Massachusetts\n[\n17\n]\n:-\nOne of her brothers, David Low, in early days a prominent judge in Kansas, served in Congress one term, but did not seek re-election because he found \"politics and ideal honesty incompatible.\"\nJohn Byrd married Elizabeth Lowe on\n10\nMay\n1847\nin Lorain County, Ohio. John and Elizabeth Byrd had eight children: Abbie Elizabeth Byrd\n(\nborn\n1848)\n; Mary Emma Byrd\n(\nborn\n1849\n, the subject of this biography\n)\n; Clara Margaret Byrd\n(\nborn\n1851)\n; William Thomas Byrd\n(\nborn\n1854)\n; Charles Henry Byrd\n(\nborn\n1856)\n; E Charles Byrd\n(\nborn\n1857)\n; Alice Huntington Byrd\n(\nborn\n1862)\n; and N Adam Byrd\n(\nborn\n1864)\n.\nThe first few years of Mary Byrd's life were particularly difficult given the active role played by her father in opposing slavery. John Byrd had received a degree from Oberlin College in\n1846\nand was ordained shortly afterwards. He joined the American Missionary Association, a missionary society which preached evangelical Christianity and the end of slavery. He went to Le Roy, Calhoun, Michigan in\n1847\nto carry out this preaching and soon pro-slavery Methodists tried to have him barred from preaching in public buildings in Michigan. In\n1851\nthe family settled in Sicily, Ohio where at first John Byrd did not preach but tried to help his family with various health problems. He resumed missionary work in Ohio in October\n1853\nand, in\n1855\n, he applied to go to Kansas as a missionary for the American Missionary Association. They family moved to Leavenworth City, Kansas in July\n1855\nwhen Mary Byrd was five years old.\nThe following years in Kansas were very difficult ones for the young Mary. She did not attend school until she was ten years old and the dangers that the family suffered due to John Byrd preaching anti-slavery must have had a large influence on her. You can read more about the dangers that the family endured in Kansas from opposing slavery at\nTHIS LINK\n.\nAt the time of the\n1860\nUS Census\n(23\nJune\n)\n, the family are living in Atchison, Kansas, about\n30\nkm north east of Leavenworth City. Clara Byrd is not listed and we assume that she had died. The family had one domestic servant, Hanna Ingram, and\n24\n-year old Timothy Stevens, with no occupation, is living with them. In the autumn of\n1861\nthe family moved to a government farm at Fort Leavenworth where John Byrd served as Superintendent for thirteen years. On all subsequent Census, John Byrd's occupation is given as \"Farmer.\"\nAfter the family moved in\n1861\n, Mary attended Leavenworth High School and, by the time she was fourteen, as well as studying at the school, she was teaching the elementary classes there. In the Catalogue of the Rockford Female Seminary in Rockford, Illinois, both Mary E Byrd and Abbie E Byrd with Residence Leavenworth, Kansas, are listed as in the Junior Class - Section A for the year\n1865\n-\n66\n. Mary is also listed in the same catalogue in the Department of Drawing and Painting. At the time of the\n1870\nCensus, Mary, then nineteen years old, is in Fort Leavenworth, still \"At school\" as is her\n21\n-year old sister and all her younger siblings. The census data also records\n18\nmen living with the Byrd family, all listed with occupation \"Farm Hand.\" In\n1871\nMary Byrd entered Oberlin College in Ohio where her father had studied. She was there for a year and a half but left without graduating. Louise Barber Hoblit writes that she left Oberlin College\n[\n18\n]\n:-\n... as one calamity followed another in Kansas and family needs were met first.\nAfter teaching mathematics for a short while in a school, Mary Byrd entered the University of Michigan; she graduated with a B.A. in\n1878\n. In the following year she was appointed as the principal of Wabash High School in Indiana. This school had been founded by Joseph John Mills in\n1869\nwith Mills as the first principal. Byrd remained as principal until\n1882\nwhen she left and went to study astronomy at Harvard College under Edward Charles Pickering. While at Harvard, Byrd became friendly with\nMina Fleming\nand with\nAnna Winlock\nwho had worked there since\n1875\n. In fact, after\nAnna Winlock\ndied in January\n1904\nMary Byrd wrote an obituary which you can read at\nTHIS LINK\n.\nPatricia Whitesell writes\n[\n29\n]\n:-\nByrd's associations at Harvard were important elements in her development as an astronomer, and she particularly valued the mentoring she received from E C Pickering, who was well known for his conviction that women should receive support and recognition in the scientific world.\nIn\n1883\nMary Byrd was appointed as an Assistant in Mathematics and Astronomy at Carleton College in Northfield, Minnesota. The director of the Carleton College Observatory was William Wallace Payne\n(1837\n-\n1928)\nwho had been appointed to Carleton College as Professor of Mathematics and Natural Philosophy in\n1866\n. Payne had pressed for an observatory and a wooden structure had been erected in the summer of\n1877\n. Byrd used this observatory from the time of her appointment in\n1883\n. She also provided time signals twice daily for the railways of the region. On\n21\nOctober\n1886\nthe corner-stone for a new observatory was laid. This was quite an event with a large number of people present. At the event, Byrd gave the lecture\nPopular Fallacies about Observatories\nwhich was published as\n[\n8\n]\n. She began with the words:-\nDuring the years that my life has been well nigh lived in an observatory, I have felt that some things are viewed differently by those without and those within the walls. One does not willingly try to dispel pleasant illusions, and yet, since an observatory with all its domes and piers, appliances and instruments, is designed for the search of truth, standing so near its cornerstone, I ask your leave to speak the truth frankly for a few minutes.\nHer lecture ended with the words:-\n... it is not to found a palace for dreams, a place where the fancy may feast on swift-changing star pictures, that the walls of an observatory go up. It is to establish a place where truth is sought. I know that there are those who think that an observatory is a monument to human pride and human intellect, and the truth found here appears cold and visionary, without power to warm the human heart or make the world better. To me it seems that God made human minds hungry for all truth and that he says to the observer here, as well as to the disciple of old - \"Seek, and ye shall find.\"\nFor a version of the whole of Byrd's lecture, see\nTHIS LINK\n.\nInterestingly, a French translation of this paper was published as\nErreurs populaires au sujet des observatoires\nwith author Marie E Byrd, and a Portuguese translation was published as\nSobre alguns erros populares relativos aos observatorios\nwith author Maria E Byrd. Both of these translations were published in\n1887\nand, in the same year, Byrd published the paper\nHints on the Popular Study of Astronomy\nin which she demonstrated her skill of encouraging everyone to take an interest in astronomy. For a version of this paper, see\nTHIS LINK\n.\nFor a list of\n40\npapers by Byrd, see\nTHIS LINK\n.\nIn\n1887\nByrd was appointed as director of the Smith College Observatory at Smith College. This women's college was founded in Northampton, Massachusetts in\n1871\nand had taken in its first students in\n1875\n. The Observatory had just been founded in\n1887\nso the College was appointing its first director. We should note that\nAnna Winlock\nwas also considered for the post of director of the Smith Observatory but Byrd was the preferred candidate. It is not difficult to see why. Smith College was much more interested in teaching than in research and\nAnna Winlock\nhad no teaching experience at all while Mary Byrd had proved herself a remarkably good teacher of both mathematics and astronomy. The Observatory that Byrd was now the director is described in\n[\n20\n]\n:-\nThe Smith Observatory had an\n11\n-inch equatorial telescope and a small meridian circle, but no regular income for maintenance and for purchase of books until an endowment was given by Elizabeth Haven in\n1898\n. The equatorial lacked electric lighting for the micrometer\n(\nan instrument attached to the telescope eyepiece for measuring the angular distance between two objects such as a comet and a star\n)\nuntil students raised money for it by voluntary contributions in\n1891\n-\n92\n.\nWe should note that Byrd was not appointed as Professor of Astronomy\n(\nmany biographies wrongly state that she was\n)\n. She wrote to Pickering in\n1888\n:-\nIt is, I understand, contrary to the traditions of this institution to give any woman the title and pay of professor.\nByrd retained her interest in mathematics and, in\n1891\n, she applied for membership of the\nNew York Mathematical Society\nwhich, six years later, changed its name to the\nAmerican Mathematical Society\n. The\nNew York Mathematical Society\nwas founded on\n24\nNovember\n1888\nat a meeting attended by only six people and a year later it was still very small with only eleven members. All these eleven were men but\nCharlotte Angas Scott\nbegan attending meetings of the Society soon after it was founded but could not join as membership was only open to those from New York. She was the first of seven women to join the Society, all seven becoming members in\n1891\n. It was in\n1891\nthat membership became open to those living outside New York. The other six women were\nCharlotte Angas Scott\n,\nAchsah Ely\n,\nSusan Jane Cunningham\n,\nMary Watson Whitney\n,\nEllen Amanda Hayes\nand\nAmy Rayson\n.\nByrd was keen to be undertake research with the Observatory, but as we mentioned above, Smith College saw her role as mainly teaching. Byrd wrote the following in the\n1892\n-\n93\nAnnual Report:-\nExcept in bitter midwinter weather this year, there have not been more than three or four nights a term when I could handle a telescope for any purpose save to adjust for students until after ten o'clock at night; and my work begins in the morning at eight or half past eight. May I beg you to consider how short, under such circumstances, must inevitably be the time during which a teacher can keep fresh springs of inspiration for her students. I have put off the evil day by working late at night, on very cold nights, and by spending since last Commencement, seven weeks of vacation time at the observatory.\nIn order to have a programme of useful research at the Observatory, it was necessary to obtain a precise value for its longitude. Byrd had undertaken this work jointly with\nMary Watson Whitney\nand they published the results in the joint paper\nLongitude of Smith College Observatory\n(1893)\n. The paper begins as follows\n[\n6\n]\n:-\nThe following description of the observations made in\n1888\nfor determining the difference of longitude between the observatories of Smith College and Harvard College comprises three parts. Part I, by Mary E Byrd, gives an account of the instruments and of the telegraphic arrangements at Northampton, and includes the observations made by the writer at both stations. Part II, by\nMary W Whitney\n, contains a description of the Cambridge instruments and of all her observations. Part III, which has been jointly prepared by both authors, discusses the clock-rates, the exchange of signals, the personal equation of the observers, and the result obtained for the required difference of longitude.\nMost of the research papers that Byrd wrote related to comets, and these were published in the\nAstronomical Journal\n. For example, in\n1901\nher observations of Comet b\n1900\n(\nBorrelly-Brooks\n)\nmade with the\n11\n-inch refractor and filar micrometer were published in the\nAstronomical Journal\n. In\n1905\nshe sent observations of Comet\n1905\nII\n(\nBorrelly\n)\nto the\nAstronomical Journal\nthat she had made with her assistant Harriet Williams Bigelow\n(1870\n-\n1934)\nbut the journal did not publish them. Byrd wrote to Pickering\n[\n20\n]\n:-\nThe truth is that we work so hard here to carry on a little independent work, living, I might almost say, for the sake of comets that come within the reach of our glass until observations and reductions are completed, that this attitude on the part of the 'Journal' is no small disappointment.\nPickering suggested she sent the observations to\nAstronomische Nachrichten\nwith a letter of introduction from him. They were published there in August\n1905\n:\nAstronomische Nachrichten\n169\n(1905)\n,\n191\n.\nIn\n1906\nByrd resigned from her position at the Smith College Observatory. The reasons for her resignation are explained in\n[\n5\n]\n:-\nAfter a most successful directorship of the Smith College Observatory, at Northampton, Massachusetts, lasting nineteen years, Miss Byrd has voluntarily severed her connection, because of the acceptance by the Smith College authorities of money from Rockefeller and Carnegie.\nMiss Byrd's devotion to principle and those principles the high old Puritan ones, is what might be expected from her ancestry and early environment, for her father's was the church known as \"the abolition\" one in Kansas' antislavery days and many were the persecutions suffered.\nWith this background in her life it is easy to see that for conscience sake she would yield the position she has long held with honour, and upon which she was dependent for support, and whether accepting her logic or not, no one not hardened by the commercialism of today can fail to respect her fidelity to principles and to admire her courage.\nThis article chooses not to criticise Rockefeller and Carnegie but many, certainly including Byrd, believed that their fortunes had been made by driving many of their competitors to ruin.\nByrd went back to her home in Kansas and continued to write articles on teaching astronomy. On\n12\nOctober\n1920\n, fourteen years after she retired, she wrote to a friend\n[\n20\n]\n:-\nIt is almost\n40\nyears to the month since I met my first class in astronomy, at Wabash High School, Indiana. Never was the outlook darker in all that time for practical elementary astronomy. Ah, I have worked hard, given up so much to do my best to bring in better ways of teaching, and now the conviction comes home that I have failed. I should like to write just one more article, a scathing review of the unutterable indifference of astronomers, most of them, to the teaching of the elements of their science. I could do it too, I could say things in a way to make even the astronomers in the big observatories 'sit up and take notice' but I don't suppose I shall. It would mean hard work and probably would not do much good. Then too I am too kind-hearted really to enjoy more than the first few sentences.\nIn fact Byrd did not publish any further articles after writing this letter except the note\nMeteor Observed\n(1930)\nin which she described a meteor which had been observed by her sister Alice H Byrd.\nByrd wrote two books, the first being\nA Laboratory Manual of Astronomy\npublished in\n1899\nwhen she was Director of the Smith College Observatory, and the second\nFirst Observations in Astronomy\npublished in\n1913\n, seven years after she retired as Director of the Smith College Observatory. She was a Teacher in Astronomy at the Normal College of the City of New York at the time of its publication. In fact she spent\n1913\n-\n14\nin New York City where in addition to teaching at the Normal School, she taught at Hunter College.\nWe mentioned above that Byrd joined the\nNew York Mathematical Society\nin\n1891\n, which became the\nAmerican Mathematical Society\nthree years after she joined. Also in\n1891\nByrd was elected to the British Astronomical Association. She was also a member of the Astronomical and Astrophysical Society of America which, in\n1915\n, changed its name to the American Astronomical Society. She was also an active member of the Astronomical Society of the Pacific, organising events for them. In addition to these mathematical and astronomical societies, it is not surprising that she was also a member of a political one, namely the Anti-Imperialist League of Northampton which opposed the colonial expansion of the United States. The Anti-Imperialist League of Northampton had been formed in\n1899\nwith Mary Byrd as its secretary.\nAfter retiring, Byrd lived for a while in Dunedin, Florida but returned to Lawrence, Kansas where she died of a cerebral haemorrhage in July\n1934\n, She was buried in Oak Hill Cemetery.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Mina Fleming",
    "Anna Winlock",
    "New York Mathematical Society",
    "American Mathematical Society",
    "Charlotte Angas Scott",
    "Achsah Ely",
    "Susan Jane Cunningham",
    "Mary Watson Whitney",
    "Ellen Amanda Hayes",
    "Amy Rayson",
    "Mary W Whitney"
  ],
  "imagens": [
    "byrd.jpg"
  ]
}