{
  "nome_completo": "Maurice Audin",
  "nome_curto": "Maurice Audin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Audin/",
  "data_nascimento": "14 February 1932",
  "local_nascimento": "Béja, Tunisia",
  "data_morte": "21 June 1957",
  "local_morte": "Algiers, Algeria",
  "summary": "Maurice Audin was a French mathematician and an activist in the anticolonialist cause, who died under torture by the French state during the Battle of Algiers.",
  "biografia": "Maurice Audin\nwas the son of Louis Audin\n(1900\n-\n1977)\nand Alphonsine Fort\n(1902\n-\n1989)\n. Louis Audin was born into a working class family from Lyon in France, while Alphonsine was born into a peasant family from Mitidja in the north of Algeria. Louis  Audin became chief of police in Béja, Tunisia, and he married Alphonsine in\n1923\nin Koléa, a city in northern Algeria overlooking the Mitidja plain. Tunisia had been occupied by France in\n1880\nand Louis Audin was in the French military, sent to Béja as part of French control of the country.\nAs the son of a military man, young Maurice was educated in the school in Hammam Righa which educated the sons of the French military. He went there in\n1943\nand studied there until\n1946\n. Hammam Righa is a pleasant town in a green and wooded area\n100\nkm south west of Algiers. In\n1946\nAudin transferred to the military school in Autun, Saône-et-Loire, in France. Originally a school to train sons of the military for military careers, it became an ordinary secondary school for sons of the military in\n1921\n. During World War II it had been forced to move to various different locations but had returned to Autun at the start of\n1945\n. It had been the intention that Audin would become an officer in the military but after two years at the school, in\n1948\n, he gave up ideas of a military career and went to the lycée Émile-Félix Gautier where he studied mathematics. This school had closed during World War II but had reopened in\n1944\nwith a new name, that of Émile-Félix Gautier a famous geographer and historian. Graduating from the lycée Émile-Félix Gautier, Audin entered the University of Algiers.\nIn\n1941\nRené de Possel\nwas appointed to a chair of mathematics in Algiers. He held the chairs of rational mechanics, then differential and integral calculus. In\n1951\nhe was appointed to the specially created chair of higher analysis at the Faculty of Science at Algiers. Audin was taught by\nde Possel\namong others and he was awarded his degree in June\n1953\n. In fact on\n24\nJanuary\n1953\n, while he was still an undergraduate, he married Josette Sempé\n(\nborn in\n1931)\n; they had three children: Michèle\n(\nborn\n3\nJanuary\n1954)\n, Louis\n(\nborn\n18\nOctober\n1955)\nand Pierre\n(\nborn\n28\nApril\n1957)\n. Audin was appointed as an assistant to\nRené de Possel\nin February\n1953\nand this temporary position became permanent in\n1954\n. In addition to his work as an assistant, he also undertook research for his doctoral thesis advised by\nde Possel\n.\nAudin began publishing papers on the research he was undertaking. These were:\nSur les transformations linéaires dans les espaces de Banach et l'alternative de Fredholm\nⓉ\n(\nOn Linear Transformations in Banach Spaces and Fredholm's Alternative\n)\n(1953)\n,\nSur certaines singularités des transformations linéaires bornées\nⓉ\n(\nOn some singularities of bounded linear transformations\n)\n(1954)\n,\nSur le développement de certaines transformations linéaires en série de transformations orthogonales et de rangs finis dans un espace de Banach\nⓉ\n(\nOn the development of certain linear transformations as series  of orthogonal  and finite range transformations in a Banach Space\n)\n(1955)\n,\nExtension de la méthode d'extremum de Galois-Hilbert à des cas non symétriques\nⓉ\n(\nExtension of the Galois-Hilbert extremum method to unsymmetrical cases\n)\n(1955)\n,\nSur les transformations linéaires des espaces vectoriels qui satisfont à une condition de Fredholm\nⓉ\n(\nOn linear transformations of vector spaces that satisfy a Fredholm condition\n)\n(1957)\n, and\nSur les transformations linéaires qui vérifient une condition de Fredholm et sur le spectre de certaines familles de transformations\nⓉ\n(\nOn linear transformations that satisfy a Fredholm condition and on the spectrum of certain families of transformations\n)\n(1957)\n. These last two mentioned papers announce results on transformations of a topological vector space into itself which are of finite index. These results from Audin's thesis will, he promises, appear in a later paper with full proofs.\nThe Algerian war of independence began on\n1\nNovember\n1954\nand Audin, a member of the Communist Party of Algeria which he joined in\n1950\n, strongly supported Algeria's right to be independent of France. In the spring of\n1957\nhe went to Paris to discuss his thesis with\nLaurent Schwartz\n. By this time he had a substantial part of his thesis completed and\nde Possel\nhad advised him to get advice from\nSchwartz\non what further work was required.\nSchwartz\ntold him that he would need another couple of months work to complete his thesis. Audin explained to\nSchwartz\nthat as a member of the Communist Party of Algeria, a banned organisation, he was under continuous threats from the French forces. In fact it was the Front de Libération Nationale that led the revolution but the French authorities believed that the Communist Party of Algeria, heavily influenced by Moscow, were the leaders. It was a situation that\nSchwartz\nsympathised with, for he was a strong supporter of Algerian independence.\nIn\n[\n9\n]\nJosette Audin explained why she and her husband supported independence:-\nMaurice and I lived in Algeria, and we witnessed, long before\n1\nNovember\n1954\n, all that colonialism was doing to Algerians. In this country, at that time, every person was either on the side of the colonisers, or on the side of those who did not accept to be humiliated, to see their dignity flouted. We, young members of the Algerian Communist Party, had chosen our camp, participating among Algerians in the struggle for the independence of Algeria.\nAfter visiting\nSchwartz\nin Paris, Audin returned to the University of Algiers and continued working on his thesis.\nBombings became more frequent as the independence movement grew and the police were unable to cope. The Tenth Paratroop Division was sent to Algiers in January\n1957\nwith orders to use every means to end terrorist activity. On the sunny afternoon of\n3\nJune\n1957\nat the Casino de la Corniche in Algiers, in a picturesque situation on a cliff top overlooking the Mediterranean, teenagers were dancing to Lucky Starways and his orchestra. A bomb had been planted under the orchestra and the explosion killed eight and left\n92\npeople injured. On\n10\nJune the doctor, George Hadjadj, a member of the Communist Party of Algeria, was arrested by the military and tortured. Under torture, and threats against his wife, he admitted that in April he had treated Paul Caballero, the Secretary-General of the Communist Party of Algeria, at Audin's home. On the late evening of\n11\nJune\n1957\nAudin was arrested by Captain Devis, Lieutenant Philippe Erulin and soldiers of the Paratroop Division. Audin was a pacifist and had never been involved in any acts of violence but his wife explained why they had to support independence\n[\n9\n]\n:-\nMaurice was working on his thesis, we had three young children, but in spite of that, or rather because of that, we owed it to ourselves, we had to, to engage in this fight for freedom. We knew the risks were great: how many Algerians before Maurice was arrested, had been imprisoned, atrociously tortured, murdered, executed! It outraged us, and it happened to him!\nAfter Audin was arrested his wife was not allowed to leave her home, prevented from using the telephone or communicating with anyone and the troops set a trap there. On the day after the arrest, Henri Alleg, a friend and fellow member of the Communist Party of Algeria, visited Audin's house. He quickly spotted the trap set by the troops and claimed that he was selling insurance. This did not fool the troops who arrested him and took him to a villa in El Biar where he was tortured. Alleg was told that he would be subjected to even worse torture and to convince him of how severe this would be, on\n19\nJune the troops brought Audin to him. Audin was in a very bad condition, had obviously been severely tortured, and when instructed to explain what further interrogation would be like, simply said to Alleg, \"It's hard, Henri!\" Audin was never seen again, except by the French troops interrogating him. Let us quote Alleg's description from\n[\n1\n]\n:-\n\"Bring in Audin,\" Charbonnier said, \"he's in the other building.\" Erulin continued to hit me, while the other one watched the spectacle, sitting on a table. My glasses having long since been lost, my short-sightedness reinforced the sense of unreality, of the nightmare that I felt and against which I tried hard to fight out of fear that my willpower would eventually break. \"Audin, tell him what's waiting for him. But spare him yesterday evening's horrors.\" It was Charbonnier talking. Erulin wrenched my head up. Above me I saw the pale and haggard face of my friend Audin looking at me as I trembled on my knees. \"Go on, tell him,\" Charbonnier said. \"It's hard, Henri,\" Audin said. And he was taken away. Erulin pulled me up sharply. ... He thrust his face close to mine, practically touching mine, and screamed at me \"You're going to talk! Everyone has to talk here! We fought in Indochina - that'll help you to know what we are. It's the Gestapo here ... You've written articles on torture, you bastard? Right, well now it's the\n10\nth Paratroop Division that's going to do it to you.\"\nAfter Audin's wife Josette was allowed to leave her home she made every effort to find out what had happened to her husband. Eventually she was told to come to the headquarters on\n1\nJuly which she did, happily, believing that she would be reunited with her husband. Once she arrived, an official report dated\n22\nJune was read to her. This report is described in\n[\n10\n]\n:-\n... on the evening of\n21\nJune, as he was being transferred by jeep from El Biar to the precinct house where his interrogation was to take place, Audin jumped from the back seat and ran. Audin's escort, Sergeant Misigri, fired a burst from his automatic pistol and then pursued his prisoner on foot. He encountered an inhabitant of the neighbourhood, Dr Jean Mairesse, who had seen from his terrace the shadow of a figure heading in the direction in which Audin had presumably fled. Mairesse, two other civilians, and some paratroopers who had come running at the sound of gunfire joined the chase, but they came up empty-handed. Audin had vanished, Misigri, the Mayer report concludes, was confined to quarters for\n15\ndays for \"not having taken sufficient precautions to prevent an escape attempt by a detained suspect.\"\nAlthough this official version continued to be held by the French authorities, it was not believed by many people especially by Audin's wife and friends. She began a campaign to discover the truth, hiring lawyers and making inquiries. In August\n1957\nshe wrote to the paper\nLe Monde\nsetting out\n[\n10\n]\n:-\n... the circumstances of her husband's arrest, the report of his escape, and of rumours circulating in Algiers that he had been confined, in poor physical condition, in some secret prison.\nMuch support followed but there was no change in the official version of events. Two important things happened, however, the Maurice Audin committee was set up in November\n1957\nand Audin's thesis was accepted posthumously on\n2\nDecember. Examining the thesis was,\nLaurent Schwartz\nwrote\n[\n9\n]\n:-\n... an initiative of\nde Possel\n: why not pass the thesis of Audin at the Sorbonne \"in absentia\",\n(\nin fact a posthumous thesis\n)\n? We went to Dean Joseph Pérès who perfectly accepted the solution. He did not lack civic courage: after the thesis, he received the press, and said it was a \"normal pedagogical procedure\". Not so normal: I've never heard of another example before or after. The jury would be composed of Jean Favard, President, myself rapporteur, and\nJacques Dixmier\n, the third member of the jury. It was decided that\nde Possel\nwould present Audin's results on the board.\nFor more details of the examination of Audin's thesis and also the commemoration\n40\nyears later on the fortieth anniversary of the event, see\nTHIS LINK\n.\nJosette Audin was not going to accept the official version of her husband's disappearance and she contacted lawyers who filed a civil suit for kidnapping and murder. Audin's daughter explained how her mother fought for years to have the truth come out\n[\n12\n]\n:-\nFrom the day my father disappeared, my mother thought of nothing else. We, the children, lived with it. My whole life, my identity, was linked to it; to who my father was and what happened to him. My mother never once stopped fighting .... My mother wrote to people, she wrote letter after letter in the days when there were no photocopiers. She wrote to everyone and she kept on writing.\nWhen Algeria achieved independence in March\n1962\n, France issued a decree providing an amnesty for:-\n... deeds committed within the framework of operations of the maintenance of order directed against the Algerian insurrection.\nThis led to Josette Audin's civil suit being dismissed in April\n1962\n. The Audin Committee, however, worked to assemble evidence about Audin's death. In January\n1960\nthe journalist Georges Ras wrote in the\nVoix du nord\nthat the Audin Committee did not have any proof of its allegations and that it had been deliberately deceiving the public. The Committee saw this as a chance to have their evidence made public in a court case so they sued Ras for libel. For seven years the case rumbled on with technical arguments which prevented evidence being presented. Eventually, in\n1969\n, judges ruled that Ras had libelled the Audin Committee and awarded the Committee the symbolic amount of\n1\nfranc in damages.\nGeneral Paul Aussaresses, who was the intelligence officer for the Paratroop Division that arrested Audin, stated in May\n2001\nthat he had ordered Lieutenant Charbonnier to question Audin. With this statement, Josette Audin tried again to bring a complaint for unlawful confinement, but it was dismissed. When Nicolas Sarkozy was elected President of France in\n2007\n, Josette Audin wrote to him asking that he look into the disappearance of her husband; he did not reply. In\n2012\nFrançois Hollande set up a Ministry of Defence investigation into the circumstances of Audin's death. A major step forward happened in January\n2014\n. General Paul Aussaresses had died on\n3\nDecember\n2013\nand on\n8\nJanuary\n2014\nthe journalist Jean-Charles Deniau reported that Aussaresses had admitted before his death that he had ordered that Audin be killed. This, of course, was hardly hard evidence since there was no way that Deniau could prove what he now stated. François Hollande, however, admitted in June\n2014\nthat the official version that Audin had escaped was false and that there were documents which established that he died in custody.\nThe final chapter\n(\nat least at the time of writing this biography\n)\nwas due to French President Emmanuel Macron when, on\n13\nSeptember\n2018\n, he issued a five-page statement in which he:-\n... recognises, in the name of the French Republic, that Maurice Audin was tortured then executed or tortured to death by the soldiers who arrested him at his home.\nOn the day he issued the statement, President Macron visited Josette Audin, now\n87\nyears old, at her home in the Paris suburb of Bagnolet. He hugged her and, in the name of the French Republic, asked her for forgiveness. Michèle, Audin's daughter, said\n[\n12\n]\n:-\nWhat Emmanuel Macron has done is a very big step and hugely important, because it concerns so many people in France, particularly those of Algerian origin. There was such distortion of the truth for such a long time. The gap between the historical reality and the official version given by the republic was enormous. At last this has been recognised. It's a pity it's taken so long for this historic moment to come, but it's definitely the start of something, not the end. We knew my father was tortured and killed, we do not know exactly how or who killed him, and it's possible we never will, but to me that's not the most important thing. For me, it's important that the system, the state, recognises its responsibility. My mother feels differently. She was\n26\nyears old. She had three children. My father was the love of her life. She wants to know who killed him and how. Most of all, she wants to know what they did with his body. She has fought this battle throughout her life until now, and she will continue it.",
  "matematicos_citados_na_biografia": [
    "René de Possel",
    "de Possel",
    "Laurent Schwartz",
    "Schwartz",
    "Jacques Dixmier",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}