{
  "nome_completo": "René Maurice Fréchet",
  "nome_curto": "Maurice Fréchet",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frechet/",
  "data_nascimento": "2 September 1878",
  "local_nascimento": "Maligny, Yonne, Bourgogne, France",
  "data_morte": "4 June 1973",
  "local_morte": "Paris, France",
  "summary": "Maurice Fréchet was a French mathematician who made major contributions to the topology of point sets and defined and founded the theory of abstract spaces.",
  "biografia": "Maurice Fréchet\n's parents were Jacques and Zoé Fréchet. It was a Protestant family and at the time Maurice was born his father was the director of a Protestant orphanage in Maligny. There were six children in the family, Maurice being the fourth. While he was still a very young child, his father Jacques Fréchet was appointed as head of a Protestant school in Paris and the family moved there with high expectations of a good future. However, political decisions were to severely damage the comfortable life of the Fréchet family.\nBefore Maurice was born the constitution of the Third Republic had been drawn up. Although the Republicans were divided into two wings, these were united on their attitude to the church's role in politics and education. One of the leaders Jules Ferry held major positions of power during\n1880\n-\n85\nand he brought in new laws to make primary education free, compulsory, and secular. Religious teaching in schools was replaced by \"civic education\" and from this time on French education was secularised. Jacques Fréchet lost his job as headmaster and was unemployed. Maurice's mother came to the financial rescue of the family by setting up a boarding house for foreigners. This had the benefit that Maurice grew up surrounded by those speaking foreign languages and he developed an international outlook which was to remain with him throughout his life. After the French education system settled down from the impact of the legal restraints put upon it, Jacques Fréchet was able to find a job teaching within the new secular system. It meant that the family never enjoyed the standards they might otherwise have expected, but nevertheless they did return to a stable financial situation.\nMaurice entered secondary education at the Lycée Buffon in Paris. There he was taught mathematics by\nHadamard\nwho was a teacher at the school from\n1890\nto\n1893\nbefore being appointed professor at the University of Bordeaux in\n1894\n.\nHadamard\nimmediately saw the mathematical potential of his young pupil and coached him on an individual basis. This continued after\nHadamard\nmoved to Bordeaux, for he wrote to Fréchet setting him mathematical problems, and corrected his work with severe criticisms if there were any errors. The relationship was one in which Fréchet was extremely grateful for the encouragement and guidance that he was receiving, but he admitted much later that he lived in continual fear of not being able to solve the problems he was set.\nAfter leaving school, Fréchet undertook military service before, in\n1900\n, entering the École Normale Supérieure in Paris. There he still worried over the decision on whether to specialise in physics or mathematics, and was eventually persuaded to specialise in mathematics, not because he did not enjoy physics just as much, but rather because further study of physics required him to take chemistry courses which he disliked. Even before he was awarded his\nAgrégation des Sciences Mathematiques\nin\n1903\n, Fréchet began publishing short papers. By the end of\n1903\nhe had four papers in print, three of which were four pages long. Seven further papers appeared in\n1904\n, then remarkably eleven papers in\n1905\nas he undertook research for his doctorate under\nHadamard\n's supervision. Contact with several American mathematicians who were in Paris, in particular\nEdwin Wilson\n, led to Fréchet publishing some of his early papers in\nAmerican Mathematical Society\npublications\n(\nEdwin Wilson\nwas editor of the\nTransactions of the American Mathematical Society\nfrom\n1903)\n. Another task undertaken by Fréchet around this time was writing up\nBorel\n's lectures for publication. Fréchet attended these lectures while an undergraduate and wrote up the lectures during the winter of\n1903\n-\n04\n. The book\nLeçons sur les fonctions de variables réelles et les développements en séries de polynômes\nⓉ\n(\nLectures on real variables functions and series expansions of polynomials\n)\nwas published in\n1905\n.\nFréchet wrote an outstanding doctoral dissertation\nSur quelques points du calcul fonctionnel\nⓉ\n(\nOn some points of the functional calculus\n)\nsubmitted on\n2\nApril\n1906\n. In it he introduced the concept of a metric space, although he did not invent the name 'metric space' which is due to\nHausdorff\n. The thesis concerns 'functional operations' and 'functional calculus' and is developed from ideas due to\nHadamard\nand\nVolterra\n. The importance of the thesis is that it develops axiomatic analysis systems providing an abstraction of different objects studied by analysis in a similar way to group theory providing an abstraction of algebraic systems. This parallel is drawn by Fréchet himself who requires sufficient structure on his abstract systems so that limits and continuity can be studied. He defines a functional operation as a numerically valued function defined on arbitrary objects which he wants to include points, lines, functions, numbers, surfaces etc. The functional calculus of his thesis is then the systematic study of functional operations.\nA versatile mathematician, Fréchet served as professor of mathematics at the Lycée in Besançon\n(1907\n-\n08)\n, professor of mathematics at the Lycée in Nantes\n(1908\n-\n09)\n, then professor of mechanics at the Faculty of Science in Poitiers\n(1910\n-\n19)\n. He married Suzanne Carrive in\n1908\nand they had four children; Hélène, Henri, Denise, and Alain. Fréchet had arranged to spend the academic year\n1914\n-\n15\nat the University of Illinois at Urbana in the United States and had accepted an appointment there for one year. He and his family were packed and ready to travel to the port to board their ship for the United States when World War I broke out and Fréchet was required for military service.\nHe was mobilised on\n4\nAugust\n1914\nbut because of his language skills, initially gained when his mother ran the establishment of foreigners, he was attached to the British Army as an interpreter. This may have resulted in a slightly safer job than he would otherwise have had, but nevertheless he spent about two and a half years at or near the front, so was fortunate to survive. A great many French academics perished during the war, for the French belief in equality meant they tended to fight in the trenches rather than undertake specialised war work for which their expertise made them especially useful. In fact there is evidence that Fréchet had arranged with some American mathematicians to publish his complete works if he did not survive the war. That he chose to negotiate with Americans is almost certainly a sign that he felt more appreciated in that country than in his own. Not only did he undertake this dangerous work during the war, but Fréchet continued to produce frequent mathematics papers. One can only marvel at how he was able to continue with cutting edge research in such circumstances and with so little time to devote to his mathematics.\nFor the period of the war Fréchet retained his post at the Faculty of Science in Poitiers despite not being able to teach there. However before he was released from military service at the end of the war, he was selected to go to Strasbourg to assist with re-establishing the university there. He was both professor of higher analysis at the University of Strasbourg and Director of the Mathematics Institute there from\n1919\nto\n1927\n. As he had been in earlier times, Fréchet was able to continue to produce a large research output despite heavy duties. He now had major administrative duties, one of the first being setting up and organising the International Congress of Mathematicians in Strasbourg in\n1920\n. This was a difficult Congress for political reasons, since German and Austrian mathematicians were banned but this resulted in strong opinions and numerous arguments. An indication of his remarkable research output is that he had\n36\npapers published in the two years\n1924\nand\n1925\n. It was after going to Strasbourg that he began to become interested in statistics but he only published a small number of articles on\nprobability\nat this stage, most of his papers being on general analysis and\ntopology\n. However, he taught courses on probability, statistics, and insurance mathematics at Strasbourg.\nFrom November\n1928\nFréchet held posts in Paris, but from this time on he concentrated more on statistics. It was\nBorel\nwho encouraged Fréchet to seek positions in Paris and he supported his candidacy. There is also a suggestion that Fréchet had a difference of opinion with the Council of the Faculty of Science at Strasbourg which meant he was both pleased to return to Paris and not unhappy at leaving Strasbourg. He held several different positions in the field of mathematics in Paris between\n1928\nand\n1948\nwhen he retired. He was director of studies at the École des Hautes-Études, then professor at the Faculty of Science in Paris. From\n1929\nhe was also professor of analysis and mechanics at the École Normale Supérieure. In\n[\n6\n]\nArmatte examines in detail the:-\n... campaign\n[\nFréchet\n]\nsustained from\n1934\nto\n1936\nat the International Institute of Statistics against improper uses of the correlation coefficient. This campaign took the unusual form of a survey sent to colleagues all over the world as well as a series of papers, committee reports, and censure motions within the  International Institute of Statistics. It sheds light on the difficulties of giving a mathematically sound foundation to one of the most elementary notions of mathematical statistics, at the key moment when it was developing into an autonomous scientific discipline. Moreover, correlation is a notion largely used as an instrument of proof in several domains of observational sciences. Maurice Fréchet did not disdain contributing his own stone to the building of these mathematical foundations via his work on the notion of distance. And, because he respected applied mathematics, he used the same surveying technique - and with the same pugnacity - to examine the consistency and relevance of other statistical methods, like the estimation of the parameters of a theoretical distribution and the application of mathematics to economic and social questions.\nIn January and February of\n1942\nFréchet was lecturing in Portugal. He lectured in Lisbon on:\nLes fonctions périodiques, les fonctions presque périodiques et les fonctions assymptotiquement presque périodiques; Applications des fonctions assymptotiquement presque périodiques au théorème ergodique de Birkhoff; Les débuts de la topologie combinatoire; le théorème d'Euler-Cauchy; La théorie des courbes dans les espaces abstraits très généraux; Types homogènes de dimensions\nⓉ\n(\nThe periodic functions, almost periodic functions and asymptotically almost periodic functions; Applications of asymptotically almost periodic functions to the ergodic theorem of Birkhoff; The beginnings of combinatorial topology;  Euler-Cauchy theorem; The theory of curves in very general abstract spaces; homogeneous types of dimensions\n)\n; and\nLe développement d'une fonction continue en série de polynômes dans les espaces abstraits\nⓉ\n(\nDevelopment of a continuous function in series of polynomials in abstract spaces\n)\n. In addition he gave a lecture aimed at the general public on\nLes origines des notions mathématiques\nⓉ\n(\nThe origins of mathematical concepts\n)\n.\nThe Portuguese Mathematical Society made Fréchet an honorary member and recognised four major achievements:\nThe deep influence exerted by the ideas of Maurice Fréchet in contemporary mathematics.\nThat the creation of a theory of abstract spaces, by this illustrious mathematician, at the beginning of the century, was the necessary starting point for the development of numerous mathematical theories which flourish today.\nThat the abstract theories of which Maurice Fréchet was one of the first pioneers, have allowed a major work of synthesis and clarification in the mathematical sciences to be carried out through the last thirty years.\nThat the workmanship which Maurice Fréchet carried out in the most varied fields of the pure and applied mathematics is a monument to the glory of the constructive spirit of the Man.\nAs we have indicated, Fréchet made major contributions to the topology of point sets, and defined and founded the theory of abstract spaces.  Fréchet also made important contributions to statistics, probability and calculus. There are different ways that people make major contributions to the progress of mathematics, some by solving the big questions, others by proposing new areas for research. Fréchet recognised himself that he fell into the latter category. In his dissertation of\n1906\n, discussed above, he started a whole new area with his investigations of functionals on a metric space and formulated the abstract notion of compactness. In\n1907\nhe discovered an integral representation theorem for functionals on the space of quadratic\nLebesgue\nintegrable functions. A similar result was discovered independently by\nRiesz\n. His introduction of\ngeneral topology\nhas been somewhat less appreciated than would otherwise have been the case since the publication of\nHausdorff\n's major text in\n1914\nprovided a more popular view.\nFréchet's most important work includes:\n1\n.\nLes Espaces abstrait\nⓉ\n(\nAbstract spaces\n)\n(1928)\n, in which he:-\n... made a major contribution toward laying the foundations of general topology and abstract analysis.\n2\n.\nRécherchés théoretiques modernes sur la théorie des probabilités\nⓉ\n(\nModern theoretical research on  probability theory\n)\n(1937\n-\n38)\n.\n3\n.\n(\nwith Ky Fan\n)\nIntroduction à la Topologie Combinatoire\nⓉ\n(\nIntroduction to combinatorial topology\n)\n(1946)\n, about which\nEilenberg\nwrites:-\nEntertaining reading about combinatorial topology accessible to a reader with very little mathematical preparation. The topics discussed are: the\nJordan\ncurve theorem, the map colouring problem, the Euler characteristic and the classification of surfaces. The proofs are very intuitive and are not intended to be complete. Many historical remarks are included.\n4\n.\nPages choisies d'analyse générale\nⓉ\n(\nSelected articles on general analysis\n)\n(1953)\n, which:-\n... contains selections by\n[\nFréchet\n]\nfrom his papers on general analysis. He has also supplemented the original papers with short remarks on later developments connected with the ideas in them, answers to conjectures, etc. The papers are grouped under the following headings: Vue d'ensemble; Espaces fonctionnels; Analyse fonctionnelle; Les espaces abstraits; L'analyse générale\nⓉ\n(\nOverview; functional spaces; functional analysis;  abstract spaces;  general analysis\n)\n.\n5\n.\nLes Mathématiques et le concret\nⓉ\n(\nMathematics and the concrete\n)\n(1955)\n,\nThis is a collection of a number of papers by Fréchet grouped under the general headings: Sur les mathématiques en général; Sur le calcul des probabilités et ses applications; Les mathématiciens et la vie. Deux examples. Papers have been selected for their general interest and readability by non-mathematicians.\nFinally let us mention that Fréchet was an extremely active correspondent with most of the leading mathematicians of his day. Let us record just a few of the names:\nPavel Sergeevich Aleksandrov\n,\nRené-Louis Baire\n,\nL E J Brouwer\n,\nBéla Kerékjártó\n,\nKazimierz Kuratowski\n,\nHenri Lebesgue\n,\nPaul Lévy\n,\nNikolai Nikolaevich Luzin\n, P Mahlo,\nPaul Montel\n,\nFrigyes Riesz\n,\nWacław Sierpiński\n,\nPavel Samuilovich Urysohn\n,\nEdwin Wilson\n, and\nStanisław Zaremba\n. As an example of one of these correspondences we refer to\n[\n4\n]\nwhich is described by Esther R Phillips  as follows:-\nMaurice Fréchet, according to the author, corresponded with virtually every mathematician of this century. His prodigious correspondence, preserved in the Archive of the\nParis Academy of Sciences\n, sheds light on the genesis and evolution of a broad body of contemporary mathematics. Among Fréchet's manuscripts are forty-eight letters of which seven were written by\nP S Aleksandrov\nand\nP S Urysohn\nand the remainder\n(\nafter\nUrysohn\n's death in\n1924)\nby\nAleksandrov\n. Of particular interest in connection with the development of topology are the letters written between\n1920\nand the\n1930\ns. In the earliest of these letters the young Russian scholars express their gratitude to Fréchet for having created the theory of abstract spaces on which their earliest investigations were based and cite as the source of their first published works problems posed by\nN Luzin\nin his analysis seminar at Moscow University. The letters reveal that after\nUrysohn\n's death,\nAleksandrov\n's investigations moved away from the \"classification of topological spaces\" and became increasingly algebraic\n[\ncombinatorial\n]\n, culminating in his simplicial theory of homology.\nAlthough widely honoured, it does appear that Fréchet was more highly rated outside France than inside it. He was invited to address the International Congress of Mathematicians in Bologna in\n1928\nand in Oslo in\n1932\n. He was elected to the\nPolish Academy of Sciences\nin\n1929\nand the\nRoyal Society of Edinburgh\nin\n1947\n. He was also a member of the International Institute of Statistics. He lost out many times in elections to the\nAcademy of Sciences\n, eventually being elected in\n1956\nwhen he was\n78\nyears old.",
  "matematicos_citados_na_biografia": [
    "Hadamard",
    "Agrégation des Sciences Mathematiques",
    "Edwin Wilson",
    "American Mathematical Society",
    "Borel",
    "Hausdorff",
    "Volterra",
    "probability",
    "topology",
    "Lebesgue",
    "Riesz",
    "general topology",
    "Eilenberg",
    "Jordan",
    "Pavel Sergeevich Aleksandrov",
    "René-Louis Baire",
    "L E J Brouwer",
    "Béla Kerékjártó",
    "Kazimierz Kuratowski",
    "Henri Lebesgue",
    "Paul Lévy",
    "Nikolai Nikolaevich Luzin",
    "Paul Montel",
    "Frigyes Riesz",
    "Wacław Sierpiński",
    "Pavel Samuilovich Urysohn",
    "Stanisław Zaremba",
    "Paris Academy of Sciences",
    "P S Aleksandrov",
    "P S Urysohn",
    "Urysohn",
    "Aleksandrov",
    "N Luzin",
    "Polish Academy of Sciences",
    "Royal Society of Edinburgh",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}