{
  "nome_completo": "Maurice Auslander",
  "nome_curto": "Maurice Auslander",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Auslander/",
  "data_nascimento": "3 August 1926",
  "local_nascimento": "Brooklyn, New York, USA",
  "data_morte": "18 November 1994",
  "local_morte": "Trondheim, Norway",
  "summary": "Maurice Auslander was an American mathematician who worked in commutative algebra and homological algebra.",
  "biografia": "Maurice Auslander\n's father was Charles Auslander who was born in Russia around\n1905\nto parents who were both Russian. He married Ida, also born in Russia to Russian parents, who was about a year older than her husband. Both Charles Auslander and Ida emigrated to the United States in\n1907\nwhen they were babies. In the US Census of\n1930\nand\n1940\nthey were living in Brooklyn, New York City giving the address Assembly District\n12\n, Brooklyn, New York City, Kings, New York in\n1940\n. Both sides of the family were Jewish. Maurice had a younger brother Louis, born in Brooklyn, New York, on\n12\nJuly\n1928\n.\nLouis Auslander\nalso became a prominent  mathematician and has a biography in this archive.\nMaurice Auslander was educated in Brooklyn, New York, where he completed both his primary and secondary education. After graduating from High School, he studied at Columbia University in New York where he obtained his B.S. in\n1949\n. Remaining at Columbia he worked for his doctorate in group theory under the supervision of Robert L Taylor. He left New York in\n1953\nwhen he was appointed as an Instructor at the University of Chicago. After submitting his doctoral thesis\nRelative Cohomology Theory of Groups and Continuations of Homomorphisms\nto Columbia University, he was awarded his Ph.D. in\n1954\n.\nAfter a year as an Instructor at Chicago University, Auslander was appointed as an Instructor at the University of Michigan. He held this post for two academic years,\n1954\n-\n56\n, before being awarded an NSF Postdoctoral Fellowship which enabled him to spend the year\n1956\n-\n57\nat the Institute for Advanced Study in Princeton. His first two publications appeared in\n1955\nbeing\nOn the dimension of modules and algebras\n(\nIII\n)\nand\n(\nwith\nRoger Lyndon\n)\nCommutator subgroups of free groups\n. It may appear strange that his first paper is the third in a series of papers entitled\nOn the dimension of modules and algebras\nbut this is because it was one of a series of papers with this title in the\nNagoya Mathematics Journal\nby a number of distinguished mathematicians. The year\n1956\nmarks an important stage in his career for in that year he published his first joint paper with D Buchsbaum\nHomological dimension in Noetherian rings\n. It was to be the first of many joint papers that the two mathematicians produced in a long and fruitful collaboration. In\n1957\nhe published the sixth paper in the series\nOn the dimension of modules and algebras\n. Auslander's two papers in this series contain the now standard result that the global dimension of a ring can be computed from knowledge of the cyclic modules.\nIn\n1957\nAuslander was appointed as an Assistant Professor at Brandeis University. Three years later he was promoted to Associate Professor and he became Chairman of the Mathematics Department at Brandeis. After holding this post for a year, Auslander was awarded an NSF Senior Postdoctoral Fellowship which enabled him to spend the academic year\n1961\n-\n62\nat the University of Paris. He published\nModules over unramified local rings\nin\n1961\nwhich continued, and to a certain extent completed, the work which he had begun with Buchsbaum over five years before.\nAuslander was invited to give a special lecture at the International Congress of Mathematicians in Stockholm in\n1962\n. He chose to speak on his results on modules over unramified local rings. It was the first of two addresses he gave to the International Congress of Mathematicians, the second being in\n1986\nat Berkeley. Returning to Brandeis in\n1962\n, Auslander was promoted to full Professor in\n1963\n, a position that he held until his death in\n1994\n.\nTravel was one of Auslander's loves and he spent time in many different parts of the world holding visiting positions at many universities. After being awarded a Sloan Foundation Fellowship for\n1963\n-\n64\n, he spent the summer of\n1965\nas a Fulbright Fellow at the University of Uruguay in Montevideo. The academic year\n1965\n-\n66\nwas spent on a second year-long visit to the University of Paris, and in\n1970\n-\n71\nhe held two visiting positions, first at the University of Illinois at Urbana-Champagne and then at Queen Mary College in London, England. In\n1975\nhe visited Mexico setting up a research group there on the representation theory of\nArtin\nalgebras. For a couple of years he travelled less and in this period he was Chairman of the Mathematics Department at Brandeis for a second time during\n1976\n-\n78\n. In\n1978\n-\n79\nAuslander made the first of several visits to the University of Trondheim in Norway, on this occasion as a Guggenheim Fellow. He made further visits to Trondheim in\n1989\n-\n90\nand\n1991\nbeing appointed as an Adjunct Professor there in\n1992\n. It is interesting to note that half of Auslander's publications have a co-author from Trondheim. A visit to China in\n1986\nsaw him help establish there a successful research group on\nrepresentation theory\n. Other universities he visited included Texas at Austin\n(1981\n-\n82)\n, and Virginia State\n(1986\n-\n87)\n.\nThe countries he visited are numerous but we give details to illustrate this aspect of his career\n(\nrepeating some information just given\n)\n. He was an NSF Senior Postdoctoral Fellow at the University of Paris in\n1961\n-\n62\n, a Fulbright Fellow at the University of Uruguay, Montevideo, in the summer of\n1965\n, a Visiting Professor at the University of Paris in\n1965\n-\n66\n, a Senior Research Fellow at Queen Mary College, University of London in the spring of\n1971\n, Guggenheim Fellow at the University of Trondheim in the spring of\n1979\n, Visiting Professor at the University of Bielefeld in the summer of\n1984\nand again in the summer of\n1985\n, Visiting Professor at the University of Paderborn in the summer of\n1988\n, Norwegian Research Council Guest researcher at the University of Trondheim in\n1989\n-\n90\n, Visiting Professor at the University of Paderborn in the summer of\n1990\n, Norwegian Research Council Guest researcher at the University of Trondheim in winter\n1991\n, Adjunct Professor at the University of Trondheim in\n1992\n-\n94\n, and awarded a Humboldt Senior Research Fellowship in\n1994\n.\nIt is fitting that Auslander ended his days while travelling. Knowing that he had incurable cancer he set off for a last trip during which he visited again some of his favourite parts of the word\n(\nsee\n[\n8\n]\nor\n[\n9\n]\n)\n:-\nDespite declining health, Maurice managed to continue with his favorite occupations during the last year of his life. He revisited China, seeing the results of his influence and the changes in the society. He enjoyed the spectacular fjords and glaciers of Norway and put the finishing touch to the manuscript for his last book. He attended a conference in Utrecht and saw the impact of the theory of Cohen-\nMacaulay\napproximations. He gave his final public lecture, pushing homological methods in representation theory, at ICRA VII in Mexico. With cancer in bones, liver, and lungs he planned his last nostalgic tour, putting his faith in what money and willpower could do. He enjoyed the company of old friends, wandered through the streets and gardens of Paris; appreciated for the last time his favourite painting, a self-portrait of Rembrandt, in London; and enjoyed the Munch museum in Oslo. Shortly after arriving in Trondheim he was hospitalised. He died a week and a half later, among close friends and colleagues, in the middle of the European meeting on \"invariants and representations of algebras\" which he had looked forward to attending. He died the way he lived and worked - elegantly.\nThe authors of\n[\n8\n]\ngive the following overview of his mathematical contributions:-\nAuslander has made fundamental contributions in many central parts of algebra. It would be senseless to try to describe his work within a given specialty or to present it under a particular title. Quite the contrary, he liked to attack problems by surprise, from apparently nowhere. This approach resulted in many original theorems in commutative and noncommutative ring theory, for orders and\nBrauer\ngroups, and in the representation theory of\nArtin\nalgebras as well as in the theory of singularities. Among the main characteristics of his work one will particularly remember the extreme elegance of the methods he liked to introduce and develop and also his ability to present and explain the crucial points. These qualities were also typical of his personality.\nThe authors of\n[\n4\n]\nwrite about his contributions to the representation theory of algebras:-\n[\nMaurice Auslander's\n]\ncontributions to the modern representation theory of algebras as well as to other fields of mathematics were deep and influential. When Maurice Auslander entered representation theory he was already a widely known mathematician with important contributions in commutative and homological algebra. His discovery, with Idun Reiten, of almost split sequences in the early seventies is certainly one of the foundation stones of our subject. His contributions to various fields continued right up to his last days. The influence of Maurice Auslander was not limited to his papers. His lectures and personal discussions with colleagues and students were always a source of inspiration.\nWhile on the theme of representation theory of algebras, Dieter Happel reviewing\n[\n2\n]\nwrites:-\n... one should highlight ... the famous \"Queen Mary Notes\", which were written at a very early stage of modern representation theory of\nArtin\nalgebras, and also early papers on the use of functors. They show clearly the insight and influence of Auslander on the directions and developments of representation theory of\nArtin\nalgebras.\nTo gain some insight into the range of Auslander's contributions we list the chapter headings that his papers are divided into in his\nSelected Works\n(\n[\n1\n]\nand\n[\n2\n]\n)\n:-\n(1)\nHomological dimension and local rings,\n(2)\nRamification theory,\n(3)\nFunctors,\n(4)\nAlmost split sequences and Artin algebras,\n(5)\nSome topics in representation theory,\n(6)\nLattices over general orders,\n(7)\nTilting theory and homologically finite subcategories,\n(8)\nAlmost split sequences and commutative rings,\n(9)\nGrothendieck groups and Cohen-Macaulay approximations, and\n(10)\nRelative theory and syzygy modules ...\nWe list Auslander's books:\nAnneaux de Gorenstein, et torsion en algèbre commutative\n(1967)\n,\n(\nwith Mark Bridger\n)\nStable module theory\n(1969)\n,\nRepresentation dimension of Artin algebras\n(1971)\n,\nRepresentation theory of Artin algebras\n(1972)\n,\n(\nwith David A Buchsbaum\n)\nGroups, Rings, Modules\n(1974)\n,\nCategorical methods in the representation theory of Artin rings\n(1975)\n, and\n(\nwith Idun Reiten and Sverre O Smalo\n)\nRepresentation theory of Artin algebras\n(1995)\n. Reviewing\nStable module theory\n, G Michler writes:-\nIn Chapter\n1\nof this book the authors present their new theory of stable functors. ... The remaining three chapters of this book are devoted to applications of the results of the first chapter to the study of finitely generated modules of a right and left Noetherian ring ...\nReviewing\nGroups, Rings, Modules\n, Chr U Jensen writes:-\nAccording to the authors, the main purpose of this book is \"to introduce the reader who has some familiarity with basic notions of sets, groups, rings and vector spaces to the study of rings by means their module theory\". This program is carried out in a systematic way for the classically important semisimple rings, principal ideal domains and\nDedekind\ndomains. ... To each chapter there is a rich collection of stimulating exercises, some of which are expositions of subjects not presented in the text.\nReviewing\nRepresentation theory of Artin algebras\nAndrzej Skowronski writes:-\nThe book is an introduction to the representation theory of\nArtin\nalgebras. The main aim of this book is to illustrate how the theory of almost split sequences\n(\nAuslander-Reiten sequences\n)\nis used in the study of finitely generated modules over\nArtin\nalgebras. It contains complete proofs of all the theorems presented. Only some first-year undergraduate algebra and basic homological algebra is assumed. ... In my opinion the book has an elementary and general character, and touches on only the simplest topics of the modern representation theory of\nArtin\nalgebras. With the exception of Chapter IX\n(\non short chains and cycles\n)\n, the material presented is very old. Hence the book does not reflect the development of representation theory over the last\n15\nyears. ... the book is addressed only to novices. It does not lead the reader to the most recent investigations in the representation theory of\nArtin\nalgebras.\nPerhaps the best summary of the topics that Auslander worked on is given by looking at the books\n[\n1\n]\nand\n[\n2\n]\nof his selected works. Dieter Happel writes in a review:-\nThese two impressive volumes, edited by Idun Reiten, Sverre O. Smalo and Oyvind Solberg, contain most of the articles and some monographs by the well-known algebraist Maurice Auslander, who died in\n1994\n. The volumes consist of ten chapters devoted to special themes\n(\nHomological dimension and local rings, Ramification theory, Functors, Almost split sequences and\nArtin\nalgebras, Some topics in representation theory, Lattices over general orders, Tilting theory and homologically finite subcategories, Almost split sequences and commutative rings,\nGrothendieck\ngroups and Cohen-\nMacaulay\napproximations, and Relative theory and syzygy modules\n)\nof his work. ... One should thank the editors, all of whom were longstanding collaborators of Auslander, for the work involved in editing these volumes. They are a must for any algebraist working in the areas mentioned above to see all the important contributions by Auslander, most of them very timely even today, and some of them more timely than when they were written.\nH Rossi writes about Auslander's personality in\n[\n1\n]\n:-\nFor\n[\nMaurice\n]\n, the difference between pragmatics and theory was only theoretical: his complete comprehension of complex situations, and only that, guided his actions. There never was any suspicion of compromise with principle: in his life, his politics, his mathematics. He always delivered his message with charm, elegance and humour; because of this he was surprisingly effective ...\nIn\n[\n8\n]\nPeskine and Reiten also write of Auslander's personality:-\nMaurice Auslander had a warm and sensitive personality. His door was always open to his friends. He enjoyed discussions, often provocative ones, about mathematics and its philosophy in particular. He had considerable administrative talent, doubling the size of the department during his first chairmanship at Brandeis. His interests outside mathematics included art, poetry and music, and he enjoyed playing the violin. He was himself a \"homme libre\", free of all influences, and wanted others to be the same. He would pin down clichés on the spot. In mathematics he had a sense of beauty; he truly enjoyed some results and their proofs.\nAmong the honours he received for his outstanding contributions we should mention his election to the\nAmerican Academy of Arts and Science\nand to the\nNorwegian Academy of Science and Letters\n. In\n1987\nthe journal\nCommunications in Algebra\ndevoted the first two parts of volume\n15\nto papers honouring Auslander's\n60\nth\nbirthday. In\n1991\na Conference was held at the University of Utah, Salt Lake City, to celebrate his\n65\nth\nbirthday. The Maurice Auslander Memorial Conference was held at Brandeis University in\n1995\nand the proceedings of the\n1994\nconference 'Representation theory of algebras' was dedicated to his memory when published in\n1996\n. Similarly the proceedings of the\n1996\nconference 'Algebras and modules I' was dedicated to his memory when published in\n1998\n.",
  "matematicos_citados_na_biografia": [
    "Louis Auslander",
    "Roger Lyndon",
    "Artin",
    "representation theory",
    "Macaulay",
    "Brauer",
    "Dedekind",
    "Grothendieck",
    "American Academy of Arts and Science",
    "Norwegian Academy of Science and Letters"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}