{
  "nome_completo": "Ernst Mauritz Dahlin",
  "nome_curto": "Mauritz Dahlin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dahlin/",
  "data_nascimento": "4 August 1843",
  "local_nascimento": "Handog, Lit Parish, Jämtland Province, Sweden",
  "data_morte": "24 February 1929",
  "local_morte": "Helsingborg, Skane Province, Sweden",
  "summary": "Mauritz Dahlin was a Swedish mathematicianwho best known for his work on the history of mathematics.",
  "biografia": "Mauritz Dahlin\n's parents were Olof Dahlin\n(1807\n-\n1871)\n, who was a sergeant in the army, and Anna Laura Elisabet Stridsberg\n(1818\n-\n1906)\n. Olof and Anna were married in Lit, a village on the banks of the Indalsälven river, north east of Östersund the main town in Jämtland province in central Sweden, in\n1842\n. Mauritz, born in Hangog which is close to Lit which a few kilometres south east on the same bank of the river, was the oldest of his parents' seven children having the siblings Anna Olivia Elisabet Dahlin\n(\nborn in Handog in\n1843\nand became a teacher\n)\n, Jakob Ephraim Dahlin\n(\nborn in Handog in\n1848\nand became a marine commissioner\n)\n, Mats Georg Gotthilf Dahlin\n(\nborn in Lockne in\n1850\nand became a farmer\n)\n, Ida Ultima Dahlin\n(\nborn in Lockne in\n1852\nand became a housewife\n)\n, Olof Emanuel Dahlin\n(\nborn in Lockne in\n1854\nand became an artist\n)\nand Johannes Johan Laurentius Olsson Dahlin\n(\nborn in Lockne in\n1856\nand became a bookkeeper\n)\n. We see from the places that the children were born that the family moved to Lockne, south of Östersund, around\n1849\n. Both Mats and Johannes emigrated to the United States.\nIn the autumn of\n1854\n, Mauritz\nDahlin entered Östersund High School. The town had grown from a village of around\n400\ninhabitants in\n1820\nto become much larger during the\n1850\ns as it became a centre for the logging industry. Dahlin spent four years at this school before moving to Uppsala High School in the autumn of\n1858\n. He only spent one school year at Uppsala High School leaving in the spring of\n1859\n. He returned to Uppsala High School in the autumn of\n1859\nand completed his secondary education there, graduating on\n11\nJune\n1867\n. He did not begin his university studies immediately for it was not until\n22\nMarch\n1869\nthat he matriculated at the University of Uppsala. This university, founded in\n1477\n, was the oldest university in Sweden and, at the time that Dahlin studied there, it was one of only two universities in Sweden, the other being Lund University. Dahlin graduated with a Bachelor of Arts degree\n13\nSeptember\n1873\nand continued his studies for a Ph.D.\nDahlin undertook research on the history of mathematics for his Ph.D., in particular studying the history of Swedish mathematics. He submitted his thesis Contributions to the history of mathematics in Sweden before\n1679\nand an oral examination was held on Saturday\n22\nMay\n1875\nin the Upper Philosophical Lecture Room. His thesis, published in\n1875\n, was dedicated to Carl Fredrik Huss and his wife Eva Catharina Huss:-\nWith love and gratitude from Mauritz.\nCarl Fredrik Huss\n(1811\n-\n1897)\nwas a mill owner, foundry proprietor and commissioner of surveyors. An expert businessman, he acquired lands and made a fortune. He was married to Eva Catharina Huss\n(1821\n-\n1900)\n.\nDahlin was awarded the degree on\n31\nMay\n1875\nand on\n8\nSeptember of that year he was appointed as a\ndocent\nin mathematics at Uppsala University. After the award of his Ph.D., Dahlin had been put forward by the Uppsala Faculty of Humanities and Social Sciences for the position of docent in the history of mathematics. However, this was considered was by the chancellor of the university to be too specific a topic for an appointment as docent so his appointment was as a docent in mathematics. However, the authors of\n[\n2\n]\nexplain that he:-\n... hardly possessed any merits that entitled him to an academic teaching position in the mathematical field of research. Dahlin made an, albeit modest, addition to Sweden's history of education with his graduate thesis 'Contributions to the history of mathematics in Sweden before\n1679\n', which mainly consists of concise accounts of Uppsala professors' mathematical papers before the said year. Dahlin points out an important source for the study of history of education, namely the handwritten manuscripts from the astrological observatory in Uppsala\n(\ncurrently deposited in the university library\n)\n, but one cannot say that he fully made use of this source even with regards to its mathematical content. The thesis does however raise interest by its, at that time, original topic. It can essentially be characterised as a preparatory work for a proper scientific report of the history of mathematics in Sweden before\n1679\nand retains as such its value, until such report is at hand. Dahlin had started to gather material for a continuation covering the time after\n1679\n, but this work had to be withdrawn, since he for economic reasons was forced to leave the university.\n(\nThe translation above is from\n[\n3\n]\nby Annette Oldsberg.\n)\nDahlin's thesis was published as a book, see\n[\n1\n]\n. You can read an English translation of the Introduction to\nContributions to the history of mathematics in Sweden before\n1679\nat\nTHIS LINK\n.\nYou can read an English translation of extracts from\nContributions to the history of mathematics in Sweden before\n1679\nat\nTHIS LINK\n.\nFinding that he could not afford to work as a docent at the university, Dahlin became a bank clerk at Swedish National Bank on\n8\nApril\n1876\n. This position, however, he only had for a few months before he joined the prison service. He was appointed as second teacher at the Langholmen prison on\n25\nAugust\n1876\n. He served as Superintendent for Education at Malmö's prisons from\n1\nFebruary\n1877\nto\n31\nDecember\n1878\n. Although he continued working for the prison service, he took on the additional position as teacher of mathematics at the Department of Mechanical Engineering at Malmö Navigation School on\n2\nOctober\n1877\n. He would work at the navigation School in parallel to his work at the prison service until\n31\nAugust\n1903\nwhen he retired from that position.\nOn\n25\nFebruary\n1878\nhe was appointed as acting accountant at the Malmö Central Prison. This was renewed a couple of weeks later on\n5\nMarch and then, on\n29\nNovember\n1878\n, he was appointed as accountant at Malmö Central Prison. He held\n[\n2\n]\n:-\n... the accountancy position at the Malmö Central Prison during thirty-five years, with \"exceeding skill and rare zeal\".\nOn\n14\nJune\n1879\nDahlin married Bernhardina Adéle Oktavia Stackelberg\n(\nborn\n22\nAugust\n1846\nin Malmö, died\n29\nSeptember\n1884\nin Malmö\n)\n, the daughter of Baron Major Bernt Adolf Gustav Hjalmar Louis Stackelberg and Maria Augusta Vilhelmina Lundbom. Their daughter Vera Julia Oktavia Dahlin was born at Malmö on\n15\nMarch\n1880\n. She went on to study in Stockholm where she attended the Royal Conservatory of Music from\n1897\nto\n1900\n. She died in Helsingborg on\n19\nFebruary\n1925\n. Dahlin and his wife also had a son, Bror Hjalmar Oskar Dahlin, born in\n1881\nand died in\n1899\n.\nSix years after Dahlin's wife died in\n1884\n, he remarried on\n13\nAugust\n1892\n. His second wife was Anna Fransiska Emilia Julie Ohlsen\n(\nborn\n8\nSeptember\n1848\nin Copenhagen, died\n16\nJune\n1926\nin Helsingborg\n)\n, the daughter of the gardener Jörgen Ernst Ohlsen.\nDahlin resigned his position at the prison service on\n13\nAugust\n1913\nwhen he reached the age of seventy. The authors of\n[\n2\n]\nwrite:-\nAt his resignation in\n1913\n, the Swedish Prison and Probation Service expressed its gratitude for his \"long and valued employment in the prison service and the great example that he had thus set for the cementation of the sound reputation of the correctional system\".  As a result of these merits the\n1913\nSwedish parliament granted him an increased pension.\nDahlin was honoured with the \"Second Award\" from the Faculty of Humanities and Social Sciences of Uppsala University in\n1875\n; the Royal Order of Vasa in\n1895\n; and Jubilee Doctor on\n30\nMay\n1925\n. We note the sad fact that Dahlin's second wife and both his children died before him.\nAs to Dahlin's character and hobbies, the authors of\n[\n2\n]\nwrite:-\nDahlin's personality was characterised by devoutness, uncompromised probity, devoted service and irrepressible energy. He was in many ways a unique man, captivating through his sharp-wittedness and extensive knowledge. Interested in outdoor activities, he particularly practised skiing, when the opportunity presented itself, as well as swimming. In his time he was one of Orphei Drängar's foremost second basses. At the age of sixty-three he took part in a choir tour of the United States.\nWe note that the Orphei Drängar was a male choral society based in Uppsala.",
  "matematicos_citados_na_biografia": [
    "docent",
    "THIS LINK"
  ],
  "imagens": [
    "dahlin.jpg"
  ]
}