{
  "nome_completo": "Maxwell Herman Alexander Newman",
  "nome_curto": "Max Newman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Newman/",
  "data_nascimento": "7 February 1897",
  "local_nascimento": "Chelsea, London, England",
  "data_morte": "22 February 1984",
  "local_morte": "Comberton (near Cambridge), England",
  "summary": "Max Newman was an English mathematician who worked on combinatorial topology and theoretical computer science. His codebreaking work in World War II has made him famous.",
  "biografia": "Max Newman\n's father, Herman Alexander Neumann, was German and Max had the family name of Neumann until he changed it in\n1916\n. Herman Neumann worked in England as the secretary to a company. Herman had married Sarah Pike who was the daughter of a leather dresser, and came from a farming family, but had become a primary school teacher.\nMax attended the City of London School, entering in\n1908\n. From there he gained a scholarship to St John's College, Cambridge, which he entered in\n1915\n. Of course World War I had already begun when he entered university and as a consequence, after obtaining First Class in Part\n1\nof the Mathematical Tripos, he interrupted his studies. As we mentioned above, it was at this time that he changed his name by deed poll from Neumann to Newman. From\n1916\nuntil\n1919\nNewman undertook work related to the war, doing various jobs such as army paymaster and schoolmaster. He returned to Cambridge after his war related duties ended in\n1919\n, graduated in\n1921\n, and then became a Fellow of St John's College in\n1923\n.\nDuring a visit to Vienna in session\n1922\n-\n23\nhe was strongly influenced by\nReidemeister\n. From\n1927\nhe was a lecturer at Cambridge in addition to his holding his Fellowship. Newman visited Princeton in\n1928\n-\n9\nduring which time he was a Rockefeller Research Fellow working closely with\nAlexander\n. Newman married Lyn Irvine in\n1934\n. She was the daughter of John Irvine, a Church of Scotland minister, and she was an accomplished author. They had two sons.\nWhile at Cambridge Newman taught a course on the foundations of mathematics.  It was these lectures which introduced\nTuring\nto the concept of 'decidability' that in turn inspired\nTuring\n's famous paper,\nOn Computable Numbers, with an application to the Entscheidungsproblem\n. which was published with considerable help from Newman.  Without Newman's encouragement,\nTuring\nmight not have done this work and got drawn into codebreaking.\nNewman returned to Princeton for a second visit in\n1937\n-\n8\n. In\n1939\nhe was elected a Fellow of the\nRoyal Society\n. He was later\n(1958)\nto receive the\nSylvester\nmedal from the\nRoyal Society\n:-\n... in recognition of his distinguished contributions to combinatory\ntopology\n,\nBoolean algebras\nand mathematical logic.\nIn\n1942\nhe joined the Government Code and Cipher School at Bletchley Park and worked there on Colossus with\nJ H C Whitehead\nand\nBill Tutte\n. His important contribution is described in\n[\n2\n]\nand in\n[\n1\n]\n:-\nThe work to which Newman contributed, though distinct from that on \"Enigma\", has been described as being of comparable importance. He devised a way of carrying forward the work of Tiltman and\nTutte\nby the use of specially designed machines and for this purpose was given charge of a section, commonly called \"Newmanry\".\nHe ran this section admirably. He soon became involved in designing a much more advanced machine, which many think has a place in the early history of digital computers. The design brought into play his knowledge of formal logic. All this gave him an insight into what could be done by electronic means, and convinced him that general purpose digital computers could and should be built.\nAt the end of the War Newman was appointed to a chair to succeed\nMordell\nas Fielden Professor of Mathematics at Manchester and, three years later, he appointed\nTuring\nto the post of Reader in Mathematics in his Department. He made other fine appointments such as\nBernhard Neumann\nand\nCassels\n. Along with\nHodge\nand\nHenry Whitehead\n, Newman set up the\nBritish Mathematical Colloquium\n.\nHis mathematical work was in the field of combinatorial topology where he greatly influenced his friend\nHenry Whitehead\n. A series of papers by Newman on this topic between\n1926\nand\n1932\nrevolutionised the field. He achieved this by giving a totally new definition of combinatory equivalence based on three elementary moves, rather than on the notion of subdivision which had previously been used. This allowed him to recast the subject avoiding the difficulties which had previously arisen.\nNewman also wrote an important paper on theoretical computer science, produced a topological counter-example of major significance in collaboration with\nHenry Whitehead\n, and wrote an outstanding paper on periodic transformations in\nabelian\ntopological groups\n. He only wrote one book\nElements of the topology of plane sets of points\n(1939)\n. Writing in\n[\n4\n]\n,\nPeter Hilton\nclaims that:-\n... this is the only text in\ngeneral topology\nwhich can be wholeheartedly recommended without qualification. It is beautifully written in the limpid style one would expect of one who combined clarity of thought, breadth of view, depth of understanding and mastery of language. Newman saw, and presented, topology as part of the whole of mathematics, not as an isolated discipline: and many must wish he had written more.\nIn\n1962\nNewman was presented with the\nDe Morgan\nMedal from the\nLondon Mathematical Society\n. The President of the Society,\nMary Cartwright\n, gave a tribute to Newman's work which is reported in\n[\n3\n]\n:-\nHis early work on Combinatory Topology has exercised a decisive influence on the development of that subject. At a time when the study of\nmanifolds\nwas based on a number of different combinatory concepts, he established a simple combinatory system of simplicial complexes with an equivalence relation based on elementary moves. ... He has proved two important results about fixed points. The first was an early inroad on\nHilbert\n's Fifth Problem, in which he proved that abelian continuous groups do not have arbitrarily small\nsubgroups\n, the second was a simplified proof of a difficult fixed point theorem of\nCartwright\nand\nLittlewood\narising in the study of\ndifferential equations\n. ...\nIn\n1964\nNewman retired from his Manchester chair but he most certainly did not give up mathematics. He taught a course at the University of Warwick and at this time I\n[\nEFR\n]\nwas a research student there and met him and attended lectures he gave. He was an outstanding teacher, clearly giving much attention to the organisation of his material. Retirement was also an opportunity for Newman to relaunch his research career which he did with the vigour of a young academic. He published a highly significant paper in\n1966\nwhich proved the\nPoincaré\nConjecture for topological manifolds of dimension greater than\n4\n.\nLynn Newman died in\n1973\n, and later in the same year he married Margaret Penrose, the daughter of a professor of physiology, who was the widow of the physician Professor Lionel Sharples Penrose.\nWylie\n, writing in the\nDictionary of National Biography\n, gives an indication of Newman's interests outside mathematics:-\nNewman was a very gifted pianist and a strong chess player. He also enjoyed reading ... At first contact perhaps austere, he was in fact a splendid companion, with a great sense of humour and a quite delightful turn of phrase.",
  "matematicos_citados_na_biografia": [
    "Reidemeister",
    "Alexander",
    "Turing",
    "Royal Society",
    "Sylvester",
    "topology",
    "Boolean algebras",
    "J H C Whitehead",
    "Bill Tutte",
    "Tutte",
    "Mordell",
    "Bernhard Neumann",
    "Cassels",
    "Hodge",
    "Henry Whitehead",
    "British Mathematical Colloquium",
    "abelian",
    "topological groups",
    "Peter Hilton",
    "general topology",
    "De Morgan",
    "London Mathematical Society",
    "Mary Cartwright",
    "manifolds",
    "Hilbert",
    "subgroups",
    "Cartwright",
    "Littlewood",
    "differential equations",
    "Poincaré",
    "Wylie"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}