{
  "nome_completo": "Maxim Lvovich Kontsevich",
  "nome_curto": "Maxim Kontsevich",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kontsevich/",
  "data_nascimento": "25 August 1964",
  "local_nascimento": "Khimki, near Moscow, USSR (now Russia)",
  "data_morte": null,
  "local_morte": null,
  "summary": "Maxim Kontsevich is a Russian and French mathematician best known for his work on geometric aspects of mathematical physics including knot theory, quantisation, and mirror symmetry.",
  "biografia": "Maxim Kontsevich\nwas born into a talented family in Khimki\n(\nsometimes written Chimki or Himki\n)\n, about\n17\nkm northwest of the centre of Moscow. His father, Lev Rafailovich Kontsevich, is an expert on the Korean language and Korean history, and he worked as Leading Researcher at the Institute of Oriental Studies of the\nRussian Academy of Sciences\nin Moscow. He devised the Kontsevich system for the Cyrillization of the Korean language, the main system in use today for producing Russian versions of Korean texts. Maxim's mother trained as an engineer, and his elder brother Leonid\n(\nLenny\n)\nwent on to undertake research into computer imaging and works in San Francisco.\nKontsevich attended secondary school in Moscow and became fascinated by mathematics and physics at an early age. This was, he wrote:-\n... thanks to my brother and some very good books.\nHe took special advanced courses in these two subjects during his final three years at secondary school, having won the right to enter these courses which was determined by competition. When he was sixteen years old he was placed second in the national Mathematical Olympiad competition. Because of his success in this competition he was offered a place at Moscow State University without having to sit the entrance examinations. There he was taught by a number of outstanding professors, in particular by\nIsrail Moiseevic Gelfand\n. In\n1983\n, when he was only nineteen years old, Kontsevich's paper\nThe growth of the Lie algebra generated by two generic vector fields on the line\n(\nRussian\n)\n, written jointly with\nA A Kirillov\n, was published. In the same year he published\nAlgebras of intermediate growth\n(\nRussian\n)\n, written jointly with\nA A Kirillov\nand A I Molev. The authors describe the contents as follows:-\nWe investigate finitely generated associative and\nLie algebras\nfor which the dimension of the nth term of the natural filtration grows faster than any polynomial in\nn\nn\nn\nbut slower than any exponent\nc\nn\nc^{n}\nc\nn\n. The associative and\nLie\nalgebras generated by two generic vector fields on the real line are considered as examples.\nIn\n1985\n, he left university to begin research at the Institute for Problems of Information Processing, an Institute attached to the\nRussian Academy of Sciences\n. He published further papers\nThe Virasoro algebra and Teichmüller spaces\n(\nRussian\n)\n(1988)\nand\nJackson networks on countable graphs\n(\nRussian\n)\n(1988)\n, the last paper being a joint publication.\nPerhaps in retrospect one can say that the most significant event for Kontsevich was an invitation to spend three months at the\nMax Planck\nInstitute in Bonn in\n1990\n. Towards the end of his visit an international conference was held at the Institute and one of the main speakers at the conference was\nMichael Atiyah\nwho, in Kontsevich's own words, was :-\n... an eminent British mathematician who spoke of wonderful things, most importantly\nWitten\n's conjecture.\nKontsevich was inspired by\nAtiyah\n's talk, and\n[\n11\n]\n:-\n... the next day, during a final boat trip on the Rhine for conference participants, he explained to his colleagues how he intended to prove\nWitten\n's conjecture. The project sounded so impressive that he was invited there and then to return to the\nMax Planck\nInstitute as a visitor for a full year.\nWhen he returned to Bonn in the next year he registered as a doctoral student at the Rheinische Friedrich-Wilhelms University of Bonn with Don Zagier as his thesis supervisor. He submitted his doctoral thesis\nIntersection Theory on the Moduli Space of Curves and the Matrix Airy Function\nand was awarded his doctorate in\n1992\n. In his thesis he achieved his aim of proving\nWitten\n's conjecture. He published the results in a paper of the same title as his thesis in\n1992\n. Claude Itzykson writes in a review of the paper:-\nThis article presents the most complete description given by its author of the proof of a conjecture by\nE Witten\n. Its subject is the computation of intersection numbers of stable classes, introduced by\nMumford\n, Morita and Miller, on ... a compactification of the moduli space of genus-\ng\ng\ng\nalgebraic curves with\nn\nn\nn\nmarked points.\nWitten\nconjectured as generating function an asymptotic expansion of matrix integrals investigated by physicists under the name \"two-dimensional quantum gravity\". A striking consequence is that it satisfies an infinite integrable hierarchy of\nKorteweg\n-\nde Vries\nequations completed by a so-called \"string equation\". The author succeeds in exhibiting a second type of matrix\nAiry\nintegral possessing the same properties. His derivation uses an elegant reduction to a combinatorial problem following ideas of\nThurston\n,\nMumford\n, Harer and Penner.\nClifford Henry Taubes\nwrites\n[\n10\n]\n:-\n... many of the steps in this proof exhibit Kontsevich's unique talent for combinatorial calculations.\nThis remarkable achievement led to Kontsevich receiving invitations to Harvard University, Princeton's Institute for Advanced Study, and the University of Bonn. He made visits to all three between\n1992\nand\n1995\n. In\n1993\n, however, he had received an offer of a Professorship at the University of California at Berkeley where he remained until\n1996\nwhen he moved to France\n[\n11\n]\n:-\n... Kontsevich could have settled permanently in the United States. He had a post at Berkeley, not far from San Francisco where his brother was living. He was in fact on the point of buying a home there when the Institut des Hautes Études Scientifiques offered him the post of resident professor. He knew the institute's reputation, having spent a few days there in\n1988\nduring a short working visit to France.\nKontsevich quickly followed his brilliant paper of\n1992\nwith another in the following year entitled\nVassiliev's knot invariants\n.\nJ S Birman\nwrites in a review:-\nV A Vassiliev\n[\nin\n1990]\nintroduced a family of numerical invariants of knots. ... These invariants were shown by Vassiliev to be determined by a very complicated combinatorial construction. They are very powerful, and subsume the\nJones\npolynomial and all of its generalizations. The paper under review is a research announcement of far-reaching results about the Vassiliev invariants. ... The main theorem has many implications, and is the subject of numerous investigations which are in progress as we write this review. However, what is perhaps even more important than the detailed statement of results is that the author has taken a very fresh and original look at the Vassiliev invariants and tells us how he was led to do it. He also gives an exposition of Vassiliev's theory which, while lacking details, makes it seem both natural and clear in a way which a careful reading of that detailed paper did not do. Curiously, the author has indicated that he does not intend to write a full exposition of his theory, leaving that task to others, notably D Bar-Natan\n[\nOn the Vassiliev knot invariants, Topology\n]\n. That is a pity because when the person who has discovered a phenomenon writes about it he is able to let you in on his way of thinking in a way that another simply cannot do for him. For that reason this little paper should be read and re-read: as an introduction to the subject, for its insights into the intuitive ideas behind it, and\n(\nafter digesting Bar-Natan's exposition of the proof\n)\nto return to it for fresh insights.\nAt the First European Congress of Mathematics in Paris in\n1992\nKontsevich gave the invited address\nFeynman diagrams and low dimensional topology\nwhich was published in\n1994\nin the Proceeding of the conference. He was also awarded a European Mathematical Society Prize at this First European Congress. Also in\n1994\nhe published\nGromov-Witten classes, quantum cohomology, and enumerative geometry\nwhich was written jointly with\nYuri Manin\n. In\n1993\nhe published\nFormal\n(\nnon\n)\ncommutative symplectic geometry\nwhich was reviewed by Alexander Voronov. His review begins:-\nThe paper places emphasis on the three fundamental types of algebras -\nLie\n, associative and commutative - as functional models of three hypothetical versions of noncommutative symplectic geometry\n(\nin fact, the usual commutative one in the third case\n)\n. Calculus of differential forms, symplectic forms, Hamiltonian vector fields and\nPoisson\nbrackets in noncommutative geometry are sketched. As an application of\n(\nand a motivation for\n)\nthese ideas, it is shown how to produce\ncohomology\nclasses of the moduli spaces of algebraic curves.\nKontsevich was a Plenary Speaker at the International Congress of Mathematicians in\n1994\nin Zürich. He then proved that any\nPoisson\nmanifold admits a formal quantization and gave an explicit formula for the flat case. This was one of the four major problems which Kontsevich worked on, leading to him receiving a\nFields Medal\nat the International Congress of Mathematicians in Berlin in\n1998\n. The other three problems have been mentioned above: intersection theory on moduli spaces of curves, low-dimensional topology particularly knots via integrals related to\nFeynman\ndiagrams, and the enumeration of rational curves.\nIn\n2008\nKontsevich and\nWitten\njointly received the Crafoord Prize in Mathematics from the\nRoyal Swedish Academy of Sciences\n:-\n... for their important contributions to mathematics inspired by modern theoretical physics.\nThe news release of the\nRoyal Swedish Academy of Sciences\ndescribed the work for which Kontsevich and\nWitten\nwere awarded the prize in the following way:-\nThe laureates in mathematics have used the methodology of physics to develop a revolutionary new mathematics intended for the study of various types of geometrical objects. Their work is not only of great interest in the discipline of mathematics but may also find applications in totally different areas. Its results are of considerable value for physics and research into the fundamental laws of nature. According to string theory, which is an ambitious attempt to formulate a theory for all the natural forces, the smallest particles of which the universe is composed are vibrating strings. This theory predicts the existence of additional dimensions and requires very advanced mathematics. The laureates have resolved several important mathematical problems related to string theory and have in this way paved the way for its further development.\nIn addition to the honours mentioned above, Kontsevich was awarded the Daniel Iagolnitzer Prize and elected a member of the\nAcademy of Sciences\nin Paris.",
  "matematicos_citados_na_biografia": [
    "Russian Academy of Sciences",
    "Israil Moiseevic Gelfand",
    "A A Kirillov",
    "Lie algebras",
    "Lie",
    "Max Planck",
    "Michael Atiyah",
    "Witten",
    "Atiyah",
    "E Witten",
    "Mumford",
    "Korteweg",
    "de Vries",
    "Airy",
    "Thurston",
    "Clifford Henry Taubes",
    "J S Birman",
    "Jones",
    "Yuri Manin",
    "Poisson",
    "cohomology",
    "Fields Medal",
    "Feynman",
    "Royal Swedish Academy of Sciences",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}