{
  "nome_completo": "Mei Wending",
  "nome_curto": "Mei Wending",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mei_Wending/",
  "data_nascimento": "1633",
  "local_nascimento": "Xuangcheng, now Xuanzhou, Anhui province, China",
  "data_morte": "1721",
  "local_morte": "China",
  "summary": "Mai Wending was a Chinese mathematician and astronomer who wrote on simultaneous equations and advocated the use of Western ideas in Chinese mathematics.",
  "biografia": "Mei Wending\nwas born into a family of considerable mathematical talents. He had three younger brothers, two of whom, Mei Wennai and Mei Wenmi, were both skilled mathematicians and astronomers. Mei Wenmi, Mei Wending's youngest brother, produced an excellent star catalogue. Continuing for a moment to give further family details, we note that Mei Wending's son Mei Yiyan, who died young, also became a skilled mathematician assisting his father. Also Mei Wending's grandson,\nMei Juecheng\n, became a particularly well-known as a mathematician. To avoid confusion, from now on let us adopt the system of referring to Mei Wending as Mei, while referring to all other members of the Mei family by their full names.\nThe German Jesuit missionary Johann Adam Schall von Bell went to China as a missionary in\n1618\n. He went to Peking in\n1630\nto undertake a reform of the Chinese calendar. Because the Board of Mathematics, a group of around\n200\nChinese mathematicians, had made an error in calculating the calendar in\n1611\n, the government had enlisted the help of missionaries in the task. Schall, rather than just assisting, was put in charge of the production of a new calendar which was adopted in\n1645\n. However this was controversial; many Chinese did not like a Westerner in charge of the calendar, other missionaries were upset that the new calendar still contained references to \"lucky\" and \"unlucky\" days. These issues regarding the Chinese calendar were important ones during the years that Mei and his brothers were growing up, and they studied the mathematical and astronomical topics necessary for calendar design under the Daoist teacher Ni Guanghu.\nChina was in a transitional state during the years that Mei was growing up. The Ming dynasty had come to an end in\n1644\nwhen the Manchus, having invaded from the north, took control of Peking. They set up the new Qing regime and the native Chinese were not allowed to hold the highest offices in the administration, these being all taken by Manchus. Mei's family remained loyal to the old Chinese Ming dynasty keeping themselves independent of the Manchu led administration. However, the Qing rulers tried to promote Chinese culture and the Emperor Kangxi, who came to power in\n1661\nwhen only seven years of age, worked hard to promote learning. He was keen on both Chinese learning and the new European learning brought to China by the missionaries. Mei also tried to steer a course between the best of the old Chinese learning and the new European learning. Keizo Hashimoto writes\n[\n1\n]\n:-\nMei tried to situate the new European knowledge properly within the historical framework of Chinese astronomy and mathematics. In his view, Chinese astronomical knowledge had advanced following the adoption of the new, more accurate Jesuit calendar following the reform initiated by Xu Guangqi in\n1629\n. In his historical studies, Mei stressed that Chinese astronomy had improved from generation to generation, progressing from coarseness to accuracy. He gave precisely the same description for the development of Western astronomy. In other words, he believed that progress was a universal historical pattern. This was Mei's historical rationale for synthesizing Western and Chinese knowledge.\nMei's first work was on astronomy and its relation to making calendars. This treatise\nLixue pianzhi\nⓉ\n(\nSuperfluousness of calendar learning\n)\nwas written in\n1662\n. In fact arguments about the calendar were reaching a head in China around this time for only two years after this work appeared the Jesuits were accused by Yang Guangxian of using calendar reform as a means of covering up their work on converting the Chinese to Christianity and of subverting the Empire. What did Mei argue in his\n1662\nwork? Pingyi Chu writes\n[\n4\n]\n:-\nErrors in the astronomical texts, he argued, jeopardized the development of the discipline; he then developed an evidential method to analyse traditional Chinese mathematics and astronomy. His methods involved correcting and reconstructing texts while preserving questions that he had been unable to solve. Mei argued that all sorts of errors in the ancient mathematical and astronomical texts had seriously impaired their transmission regardless of whether they were the corruption of printing boards, or mistakes in coping with a text, or commentating on a text without a proper understanding. In reviving the Chinese mathematical and astronomical traditions, collecting and collating ancient texts was a crucial first step.\nBut Mei also entered into the religious argument which was associated with calendar reform, and in particular faced up to the arguments being put forward by Yang Guangxian:-\nMei Wending argued, moreover, that calendrical studies were at the core of the Confucian pursuit of 'gewu qiungli'\n(\ninvestigating things so as to fathom the principle thoroughly\n)\n.The eternity of 'li' guaranteed the status of the ancient sages, a status profoundly important to the cultural identity of Confucian scholars. The innate capacity of the heart/mind was such that the ultimate 'li' could be attained through mathematical investigations of each ancient calendar. From this angle, Mei Wending suggested the possibility of integrating calendrical study into the newly emerging evidential scholarship and contended that the investigation of ancient calendars and ancient remains were of equal importance for understanding 'li'. In addition, he claimed that the new Western calendar was only a variant of the Chinese calendar, anticipated by the wisdom of the ancient sages. This emphasis on the great importance of astronomy led Mei to reject the claims of Confucian scholars such as Yang Guangxian who were satisfied with understanding the 'li' of astronomy without bothering with detailed calendrical calculations. According to Mei, without engaging in complicated calendrical computation, 'li' simply could not be attained.\nYang Guangxian's arguments against the astronomers who were Jesuits, either Europeans or Chinese converts, was so successful that at one stage all were condemned to death. They were saved due to an earthquake hitting not long before the time set for their execution, but later Mei's arguments against Yang Guangxian succeeded since his lack of ability to make complicated calendrical computations became clear. In fact this dispute led to the Emperor Kangxi becoming an enthusiast for mathematics, something which helped Mei in the later part of his career. Kangxi said\n[\n5\n]\n:-\nYou only know that I am versed in mathematics. But you do not know why I study mathematics. When I was young, the Chinese officials and the Westerners at the Board of Mathematics were on unfriendly terms with each other. They accused each other. It almost came to capital punishment. Yang Guangxian and Adam Schall von Bell measured the length of the sun's shadow in front of the Wu Men gate. Unfortunately among those leading ministers there was no one who understood the method. I realised that if I did not know it myself, I could not judge true from false. So I was eagerly determined to study mathematics.\nMei's first mathematical work was the\nFangcheng lun\n(\nOn simultaneous linear equations\n)\nwhich he wrote in\n1672\n. Joseph Dauben and Christoph Scriba write\n[\n2\n]\n:-\n'Fangcheng' is one of the 'jiushu'\n(\nNine Subjects Concerning Number\n)\nemphasised in Confucian education in the pre-Qin period\n(\nbefore\n211\nB.C.\n)\n. When he finished writing this book, Mei Wending wrote to one of his friends saying that \"I am disgusted by those Western missionaries who exclude traditional Chinese mathematics, and therefore I wrote this book about which even\nMatteo Ricci\ncould not possibly say a bad word\". Indeed, Western missionaries who went to China in the\n16\nth\nand\n17\nth\ncenturies did not mention simultaneous linear equations because the subject was then only in its infancy in the West. Mei Wending clearly wished to demonstrate the superiority of early Chinese mathematics over the methods Western scholars had brought to China, and at least in this case, the example of simultaneous linear equations was an excellent one to stress.\nHe continued throughout his career to argue strongly for the acceptance of the new mathematical ideas coming from Europe and also for preserving the Chinese approach to mathematics\n[\n2\n]\n:-\nIn his various works, Mei Wending compiled ancient mathematical material and studied a number of almost forgotten topics. For example, the gougu theorem\n(\nreferred to in the West as the Pythagorean Theorem\n)\nwas a well-known and important focus of ancient Chinese geometry, but since the time of\nLiu Hui\nand Zhao Shang, two brilliant mathematicians of the\n3\nrd\ncentury, no proof of the gougu theorem had been given in any mathematical books. Mei Wending, however, proposed two proofs, along with other applications of the theorem in his 'Gougu juyu'\n(\nIllustration of the Right-Angled Triangles\n)\n(\nwritten before\n1692)\n.\nIn\n1693\nMei again made clear his approach to Western mathematics writing\n(\nsee for example\n[\n3\n]\n)\n:-\nNumber and principle are united.\n[\nIn this respect\n]\nChina and the West do not differ. Therefore rites can be retrieved from Barbarians, administration can be enquired about from Tanzi. Refusing this learning just because it is Western would be a short-sighted attitude, and not the way to what is excellent. Furthermore, if we look for it in the past, we will probably find something similar.\nMei used traditional Chinese methods in\nJihe bubian\n(\nComplements of Geometry\n)\nMei to calculate the volumes and relative dimensions of regular and semi-regular polyhedrons. The\nJihe tongjie\n(\nComplete Explanation of Geometry\n)\ncontains Mei's approach to Euclidean geometry. In\n1700\n, in the\nQiandu celiang\n(\nThe Measurement of a Prism with Two Right Triangular Bases\n)\n, he gave a trigonometric interpretation of the celestial coordinate transformation introduced by\nGuo Shoujing\nin\n1280\n. Around\n1701\nhe wrote\nLixue yiwen\n(\nInquiry on Mathematical Astronomy\n)\nwhich greatly interested the Emperor Kangxi who then summoned Mei to an audience in\n1703\n. By this time Mei was seventy years old and went to Baoding to meet Emperor Kangxi taking his grandson\nMei Juecheng\nwith him. Although this was the first meeting between Mei and the Emperor, earlier Mei had taught mathematics to the son of Li Guangdi, the Emperor's mathematical advisor, along with his own grandson\nMei Juecheng\nat Baoding. Mei was too old by this time to serve the Emperor but the discussions between Mei and the Emperor led eventually to the establishing of the Mengyangzhai\n(\nthe Academy of Mathematics\n)\nin\n1713\n. Its main aim was to supervise the compilation of mathematical and astronomical works, and many of the mathematicians trained by Mei, including his grandson\nMei Juecheng\n, were chosen to work at the Academy.\nThe ancient Chinese calendar makers had used a method of interpolation in their work and Mei explained their methods in his\n1704\nwork\nPinggliding sancha xiangshuo\nⓉ\n(\nA Detailed Account of third degree interpolation\n)\n. In\n1710\nhe produced a text\nFangyuan miji\nⓉ\n(\nOn the relation between the square and the circle\n)\nin which he gave his methods for finding the formula for the volume of a sphere. His collected works,\nLisuan quanshu\n, was published in\n1723\n.\nMei Juecheng\ncompiled and edited his grandfather's works and published them in\nMei shi congshu jiyao\nⓉ\n(\nCollected Works of the Mei Family\n)\nin\n1761\n. For more details see\nMei Juecheng\n's biography.",
  "matematicos_citados_na_biografia": [
    "Mei Juecheng",
    "Matteo Ricci",
    "Liu Hui",
    "Guo Shoujing"
  ],
  "imagens": []
}