{
  "nome_completo": "Michel Plancherel",
  "nome_curto": "Michel Plancherel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plancherel/",
  "data_nascimento": "16 January 1885",
  "local_nascimento": "Bussy, Kanton Freiburg, Switzerland",
  "data_morte": "4 March 1967",
  "local_morte": "Zürich, Switzerland",
  "summary": "Michel Plancherel 's main research fields were analysis, mathematical physics and algebra.  He is best known for Plancherel's theorem in harmonic analysis.",
  "biografia": "Family background.\nMichel Plancherel's father, Donat Plancherel, was born in\n1863\nin Bussy, a village in the\ndistrict de la Broye\nin the\nKanton Fribourg\n, close to Estavayer-le-Lac. Donat Plancherel was a teacher, first in Villaz-Saint-Pierre and later in Bussy. Michel Plancherel was born January\n16\n,\n1885\n, as the first of\n8\nchildren. However two of Michel's siblings died in early life. In\n1892\n, the family moved to Fribourg\n(\nFreiburg\n)\n, where Donat Plancherel worked as administrator of the printing plant\nSt-Paul\nand as an editor of\nLa Liberté\n, the local newspaper. Simultaneously, he was a professor at the\nCollège St-Michel\n(1896\n-\n1912)\nand at the\nÉcole secondaire de jeunes filles\n. Michel's character was coined by his father's sense of order, conciliation, affability and directness. His father was appreciated for his hard work, his reports were known as models of clarity and concision.\nEducation.\nAfter moving to Fribourg, Michel was sent to school and attended the\nCollège St-Michel\nin the section which prepared for\nETH Zürich\n(\ncalled Eidgenössisches Polytechnikum at that time\n)\n. However, Michel chose to study at the faculty of science at the\nUniversity of Fribourg\n. There, between\n1903\nand\n1907\n, he was a student of\nMathias Lerch\nand the Dutchman Mathieu Frans Daniels. Under\nLerch\n's supervision, Michel finished his excellent doctoral thesis\nSur les congruences\n(\nmod\n2\nm\n)\nrelatives au nombre des classes des formes quadratiques binaires aux coefficients entier et à discriminant négatif\nⓉ\n(\nOn the congruence\n(\nmod\n2\nm\n)\non the number of classes of binary quadratic forms with integer coefficients and negative discriminant\n)\nin\n1907\n. He wrote the thesis in part during his mandatory service in the Swiss army. With a grant of the state of Fribourg, he continued his studies in Göttingen\n(1907\n-\n1909)\nand Paris\n(1909\n-\n1910)\n. In Göttingen, he followed the courses of\nFelix Klein\n,\nDavid Hilbert\nand\nEdmund Landau\n, and got to know\nHermann Weyl\n, his future colleague at ETH Zürich. At Sorbonne and Collège de France, he met\nÉmile Picard\n,\nHenri Lebesgue\n,\nÉdouard Goursat\nand\nJacques Hadamard\n.\nCareer.\nIn\n1910\n, Michel Plancherel became\nPrivatdozent\nat the University of Geneva, and in\n1911\nextraordinary professor in Fribourg being the successor of Lerch who went to Brno in\n1906\n. Two years later, in\n1913\n, he was promoted ordinary professor. In the sequel, still being deeply grateful for the grant Fribourg awarded him as a student, he declined offers of the Universities of Bern and Lausanne. Finally, in\n1920\nhe accepted a professorship at ETH Zürich, where he was the successor of\nAdolf Hurwitz\nwho had died the year before. Plancherel occupied his chair for higher mathematics during the next\n35\nyears, until he retired in\n1955\n. During that time, he declined calls from several universities. The confidence his colleagues put in Plancherel bestowed him the dignity of rector at ETH between\n1931\nand\n1935\n.\nTeaching.\nAt ETH Plancherel gave courses not only for mathematicians but also for students of electrical and mechanical engineering. His teaching was clear although not easy to grasp, since he lectured in a rapid French. In his exams, he was of military severity but always correct and fair. He applied the same high standards and discipline to his students that he used for himself. A list of his PhD students is available at\nTHIS LINK\n.\nCommitment.\nMichel Plancherel was president of the\nSwiss Mathematical Society\nbetween\n1918\nand\n1919\n, vice-president of the International Congress of Mathematicians\n1932\nin Zürich, and president and co-founder of the foundation for the advancement of the mathematical sciences in Switzerland and served in several other institutions\n(\nsee the list at\nTHIS LINK\n)\n.\nIn the Swiss army, Michel Plancherel reached the rank of colonel. In\n1939\nhe was appointed to the General Staff, and during the critical years of World War II, he was the officer responsible for the press and radio division.\nAfter the flight of\n550\nHungarian students in\n1956\nto Switzerland, the rectors of the Swiss universities commissioned Michel Plancherel to raise funds to help these students. Plancherel collected over\n2\nmillion Swiss Francs, an immense sum at that time. During the great depression in the\n1930\n's Plancherel was the director of the service for voluntary work, and, after\n1948\n, president of the Swiss\nWinterhilfe\n, an organization to help people during hard winters. It is reported that Plancherel was deeply enrooted in his Christianity: among other activities he presided the\nMission Catholique Française\nin Zürich.\nPrivate life.\nMichel Plancherel was married to Cécile Tercier, born January\n15\n,\n1891\nin Adrey, close to Gryère. They became acquainted with each other when she was a student at the nurse's training school in Fribourg. They married on September\n8\n,\n1915\n, and had\n9\nchildren together, five boys and four girls. Thirteen grandchildren were the joy of Plancherel's older days, after Cécile died November\n24\n,\n1952\n.\nMichel Plancherel died on March\n4\n,\n1967\n: In full possession of his physical faculties and of unbroken intellectual freshness. He was on his way home from a meeting with experts of the federal maturity commission on March\n1\n. As was his habit, he was walking from ETH to his home at Zürichberg, when he was hit by a car. He succumbed his severe injuries on March\n4\n, without having regained consciousness. Michel Plancherel was buried on March\n8\n,\n1967\n, on the cemetery of Fluntern in Zürich.\nScientific work.\nMichel Plancherel's main research fields were analysis, mathematical physics and algebra. In a series of articles he generalized results in the classical\nFourier theory\nto more general spaces\n(\nHilbert spaces\n)\nby investigating various orthonormal systems of functions, their summability and the representation of functions in such systems by Fourier series and Fourier integrals and more general integral transformations. In his work he achieved fundamental results, one of them is the famous Plancherel theorem in harmonic analysis and which is now known in many generalizations\n(\nPlancherel measures\n)\n. He applied his results in the theory of hyperbolic and parabolic\npartial differential equations\n.\nHe also contributed to the solutions to variational problems via Ritz's method and to\nergodic theory\n. In\n1913\nhe gave a proof that mechanical systems cannot be ergodic\n(\nsee Stephen G. Brush: Milestones in mathematical physics. Proof of the impossibility of ergodic systems: the\n1913\npapers of Rosenthal and Plancherel.\nTransport Theory Statist. Phys\n.\n1\n(1971)\n, no.\n4\n,\n287\n-\n298)\n. The papers by Rosenthal and Plancherel marked a watershed in the development of the foundations of statistical mechanics, for they brought to a close the classical age of\nMaxwell\n,\nBoltzmann\nand\nEhrenfest\nand stimulated the development of ergodic theory as a new branch of mathematics.\nIn algebra Plancherel obtained results on quadratic forms and their applications, to the solvability of systems of equations with infinitely many variables and to the theory of commutative Hilbert algebras\n(\ntheorem of Plancherel-\nGodement\n)\n.\nThe scientific estate of Plancherel is administered by the library of ETH Zürich\n(\nWissenschaftshistorische Sammlungen der ETH-Bibliothek\n)\n.",
  "matematicos_citados_na_biografia": [
    "Mathias Lerch",
    "Lerch",
    "Felix Klein",
    "David Hilbert",
    "Edmund Landau",
    "Hermann Weyl",
    "Émile Picard",
    "Henri Lebesgue",
    "Édouard Goursat",
    "Jacques Hadamard",
    "Privatdozent",
    "Adolf Hurwitz",
    "Swiss Mathematical Society",
    "Fourier theory",
    "partial differential equations",
    "ergodic theory",
    "Maxwell",
    "Boltzmann",
    "Ehrenfest",
    "Godement"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}