{
  "nome_completo": "Michelangelo Ricci",
  "nome_curto": "Michelangelo Ricci",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ricci/",
  "data_nascimento": "30 January 1619",
  "local_nascimento": "Rome (now Italy)",
  "data_morte": "12 May 1682",
  "local_morte": "Rome (now Italy)",
  "summary": "Michelangelo Ricci was an Italian churchman who made some early applications of induction.",
  "biografia": "Michelangelo Ricci\nwas born into a large family of modest means. His father, Prosper Ricci, came from Como while his mother, Veronica Cavalieri, came from Bergamo.  Prosper and Veronica made great sacrifices to give their children a good education.\nMichelangelo quickly profited by these educational opportunities, quickly mastering Latin and Greek. He was also highly praised for his style of his Italian writing. However, among the subjects he was taught, mathematics and physics were the ones that he loved most. Throughout his life, Ricci suffered from epileptic fits, a condition which began when he was a child. His achievements, from childhood and throughout his life, are all the more remarkable when one considers that he had this severe handicap with which to contend.\nRicci became a friend of\nEvangelista Torricelli\nwho came to Rome in\n1627\n; in fact both were taught by the Benedictine monk\nBenedetti Castelli\n(\nhis name was Antonio Castelli but he took on the name Benedetti when he entered the Benedictine Order\n)\n.\nCastelli\nwas appointed professor of mathematics in Pisa when\nGalileo\nleft in\n1592\nbut moved to become professor of mathematics at La Sapienza, the University of Rome. He was a friend of\nGalileo\nand published innovative work on hydraulics in\n1630\n. When\nCastelli\nwas away from Rome,\nTorricelli\ntook over his teaching and, in this way, he also taught Ricci. In addition to mathematics, Ricci studied theology and law in Rome, principally because he needed a career which would provide him with a steady income. At this time he also became friends with\nRené de Sluze\nwho studied law at La Sapienza between\n1642\nand\n1643\n. Although awarded a doctorate in law in\n1643\n,\nde Sluze\nremained in Rome for several years enjoying the scholarly environment. It is clear that\nde Sluze\n,\nTorricelli\nand Ricci had a considerable influence on each other in the mathematics which they studied.\nRicci made his career in the Roman Catholic Church. His income came from the Church, certainly from\n1650\nhe received such funds, but perhaps surprisingly he was never ordained. Some have suggested that the fact that he suffered from epileptic fits could have prevented him being ordained. Ricci served successive popes\n(\nAlexander VII, Clement IX and Innocent XI\n)\nin several different roles before being made a cardinal by Pope Innocent XI on\n1\nSeptember\n1681\n. In particular he served as Secretary of the Sacred Congregation of Indulgences and Sacred Relics. Several requests that he brought before this body, in particular requests from the Irish bishops in\n1670\nand\n1671\n, are recorded. He also served as a Consultor of the Supreme Sacred Congregation of the Roman and Universal Inquisition. This had been set up by Pope Paul III in\n1542\n:-\n... to maintain and defend the integrity of the faith and to examine and proscribe errors and false doctrines.\nAs a scientist who was at the forefront of the scientific research of his day and as an enthusiast for the new ideas being put forward by\nGalileo\nand others, he was able to play an important role in moderating the Church's approach to \"modern science\". In particular, he frequently intervened to avoid censorship by the Church of the activities of those engaged in up-to-the-minute research. Of course, the argument between\nGalileo\nand the Church happened long before Ricci was in a position to help\n(\nhe was only\n14\nyears old when\nGalileo\nwas tried\n)\n. However, he did work at making\nGalileo\n's ideas acceptable to the Church and tried to ensure that other scientist did not suffer similar consequences. For example, in\n1658\nhe wrote to Domenico Rossetti:-\nLearn at\nGalileo\n's expense. He ran into so much trouble just because he picked fights.\nRicci corresponded with\nVincenzo Viviani\nabout the articles\nViviani\nwas writing on\nGalileo\n's life and his work, trying to encourage him to get across\nGalileo\n's ideas without causing the Church to become upset. For example, here are three quotes from the letters that Ricci wrote to\nViviani\nafter reading sections on\nGalileo\n:-\nI would moderate those terms of persecution and such when speaking of Father\nGrassi\nand other Jesuits and imitators.\nIt is necessary to limit those praises of the book about the two systems to the many natural problems solved in it, so that it cannot be said that Copernican opinions are being defended and approved.\nI consider Your Lordship's advice prudent, to use few words when discussing the details of the misfortune that befell\nGalileo\nover the 'Dialogues', and to expatiate further on other astronomical and geometrical matters, his meaningful experiences and wise reflections.\nRicci's main mathematical work was\nExercitatio geometrica, De maximis et minimis\nⓉ\n(\nExercises in  geometry, maxima and minima\n)\n(1666)\nwhich was later reprinted as an appendix to\nNicolaus Mercator\n's\nLogarithmo-technia\nⓉ\n(\nTechniques of logarithms\n)\n(1668)\n. It only consisted of\n19\npages and it is remarkable that his high reputation rests solely on such a short publication. In this work Ricci finds the maximum of\nx\nm\n(\na\n−\nx\n)\nn\nx^{m}(a - x)^{n}\nx\nm\n(\na\n−\nx\n)\nn\nand the\ntangents\nto\ny\nm\n=\nk\nx\nn\ny^{m} = kx^{n}\ny\nm\n=\nk\nx\nn\n. The methods are early examples of induction. Ricci dedicated this work to the philosopher and polymath Stefano Gradi\n(1613\n-\n1683)\n, whose interests included mathematics and science - Gradi eventually became Head of the Vatican library. A manuscript of Ricci's, devoted to algebra but never published, is in the library of the Mathematical Institute of Genoa. It shows that Ricci was familiar with current research in algebra around\n1640\nwhich was developing as a result of the work of\nFrançois Viète\n.\nIn his own time Ricci's fame as a mathematician\n(\nwhich was remarkably high - some believed him to be the best mathematician in Italy of his generation\n)\nrested more on the many letters he wrote on mathematical topics, rather than on his published work. He corresponded with many mathematicians across Europe including\nTorricelli\n,\nViviani\nand\nde Sluze\n. Results of his own contributions contained in these letters include work on spirals\n(1644)\nand on families of curves which generalised cycloids\n(1674)\n. He states explicitly in a letter of\n1668\nthat finding tangents and finding areas are inverse operations. His correspondence is, however, even more important for the results which others sent him. In\n1641\nTorricelli\ndiscovered that by rotating a rectangular hyperbola he could get a solid of revolution that was infinite in length but finite in volume. He communicated this result, and other similar results, in\n1643\nto Jean-Francois Niceron in Paris although he gave no proofs. Ricci was sent the statement of these results and replied in a letter to\nTorricelli\nin June\n1643\n[\n5\n]\n:-\nFather Niceron writes me that all the excellent men of that kingdom desire to see your works and that the sheet of propositions I sent them is passing through everyone's hands with great praise of your beautiful discoveries.\nOn\n11\nJune\n1644\n,\nTorricelli\nwrote to Ricci his famous letter about his invention of a barometer, showing that he had proved the existence of a vacuum. The letter begins:-\nTo Michelangelo Ricci in Rome\nMost Illustrious Sir and Most Learned Patron\nSeveral weeks ago I sent to Sig Antonio Nardi several of my demonstrations of the areas of cycloids, and asked him that after he had examined them he would send them on at once to yourself or to Sig Magiotti. I have already called attention to the fact that there are in progress certain philosophical experiments, I do not know just what, relating to vacuum, designed not simply to make a vacuum but to make an instrument which will show the changes in the atmosphere, as it is now heavier and more gross and now lighter and more subtle.\nRicci replied on\n18\nJune, showing his concern at the reaction of certain people within the Church to\nTorricelli\n's discoveries:-\nI estimate that you will unfortunately be too nauseated by the temerarious opinion of these Theologians, and by their constant habit of mixing up things of God with natural questions, where they should instead be treated with greater respect and reverence.\nTorricelli\nwrote again to Ricci giving further details of his experiments on\n28\nJune.\nMarin Mersenne\n, who was greatly interested in the barometer in the last years of his life, visited Italy in October\n1644\nand at this time he was able to hold discussions about the barometer with\nTorricelli\nas well as with Ricci. We note that when\nBonaventura Cavalieri\ndied in November\n1647\n, he left a request that\nTorricelli\nand Ricci collaborate in editing his unpublished manuscripts and letters. In fact, unknown to\nCavalieri\n,\nTorricelli\nhad died a few days earlier so his request for editing his works fell entirely to Ricci. However, Ricci felt that he had too many duties to be able to undertake the task so it was not until\n1919\nthat the remaining material left by\nCavalieri\nwas eventually published\n(\nsome material had been lost by that time\n)\n.\nAs well as having an important role in the development of mathematics and physics through his correspondence, Ricci also took an active role as Roman correspondent in the Accademia del Cimento which was founded in Florence in\n1657\nby Giovanni Alfonso Borelli and\nVincenzo Viviani\n. Beginning in\n1666\n, the Academy published\nSaggi di naturali esperienze fatte nell'Academia del Cimento sotto la protezione del Serenissimo Principe Leopoldo di Toscan e descrittedal segretario di essa Accademia\nⓉ\n(\nEssays on experiments in the Academy of Cimento, under the protection of the Most Serene Prince Leopold of Tuscany and described by the secretary to the Academy\n)\nand Ricci acted as an editor for this important journal. In\n1668\n, Ricci, in collaboration with Giovanni Giusto Ciampini\n(1633\n-\n1698)\nand Francesco Nazari\n(1634\n-\n1714)\n, founded the wide-ranging journal\nGiornale de letterati\n. This journal provided information on topical issues as well as reviews and translations of important articles in other journals. For example, the journal tackled issues such as the nature of matter - followers of\nGalileo\nand of\nDescartes\nargued over this topic, and it also raised theological issues with the Church. Ricci was a major figure in the production of the journal until\n1675\nwhen he handed over control to his younger colleagues.\nOther regular correspondents of Ricci included Leopoldo de' Medici, brother of the Grand Duke of Tuscany, who was a patron of the arts with interests in science, technology, rare books and paintings. Their correspondence was much concerned with the Accademia del Cimento and its\nSaggi\n. Christina Alexandra\n(1626\n-\n1689)\n, Queen of Sweden, abdicated in\n1654\n, converted to Catholicism, and in the following year went to Rome. She had broad literary and scientific interests, and the group of scholars she eventually gathered round her in Rome included Ricci. We noted above that he was made a cardinal by Pope Innocent XI on\n1\nSeptember\n1681\n, and this appears to have been partly though Christina's influence. However, this is not quite as simple as it might at first appear since, when the Pope informed him that he would be made a cardinal, Ricci politely and humbly replied to the Pope in a long letter refusing to accept the position:-\n... with great energy, and strength of reasons, and the same level of erudition, makes me determined to reject the dignity conferred.\nHowever, the Pope's wishes were paramount and Ricci was forced the accept the honour. After his death, only a few months later, Ricci's funeral was held in the church of Santa Maria in Vallicella in Rome on\n14\nMay\n1682\n. His body was then taken to the church of San Francesco a Ripa in Rome where he was buried in the family tomb\n(\nit can still be seen in the first chapel on the right as one enters the church\n)\n. The monument to Ricci erected over the tomb was designed by Domenico Guidi.",
  "matematicos_citados_na_biografia": [
    "Evangelista Torricelli",
    "Benedetti Castelli",
    "Castelli",
    "Galileo",
    "Torricelli",
    "René de Sluze",
    "de Sluze",
    "Vincenzo Viviani",
    "Viviani",
    "Grassi",
    "Nicolaus Mercator",
    "tangents",
    "François Viète",
    "Marin Mersenne",
    "Bonaventura Cavalieri",
    "Cavalieri",
    "Descartes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}