{
  "nome_completo": "Michael Stifel",
  "nome_curto": "Michael Stifel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stifel/",
  "data_nascimento": "1487",
  "local_nascimento": "Esslingen, Germany",
  "data_morte": "19 April 1567",
  "local_morte": "Jena, Germany",
  "summary": "Michael Stifel was a German mathematician who invented logarithms independently of Napier using a totally different approach.",
  "biografia": "Michael Stifel\n's name appears in many forms, as was a common feature of the time when people did not even adopt a standard spelling for their own names. The versions Styfel, Styffel, Stieffell, Stieffel are all used, as is the Latin version of his name Stifelius. His father was Conrad Stifel, but nothing is known of Michael's upbringing and early education. He attended the University of Wittenberg where he was awarded an M.A. This was a new university, founded in\n1502\n, and at this time awarded degrees after one year of study. He made his life in the Church entering the Augustinian monastery at Esslingen. He was ordained in\n1511\nwhile at the monastery. However Stifel did not conform correctly to the Catholic faith when he became unhappy with taking money from the poor and he began to absolve poor people of their sins without taking indulgence money. We should note here that it was in October\n1517\nthat Martin Luther made public his\n95\ntheses condemning the selling of indulgences; the event widely accepted as beginning the Reformation. Stifel also began, around\n1520\n, to attempt to use methods of numerology to deduce hidden religious meanings from names particularly using the numbers which appear in the book of Revelation and in the Book of Daniel\n(\nhe identified Pope Leo X with the Antichrist; we say more below about how numbers led him to this\n)\n. Attracted to the ideas of Martin Luther, he composed a song in his honour which, not surprisingly, was not the best move given the reaction of the Church in Rome to Luther's ideas. Fearing for his life, Stifel fled from the monastery at Esslingen in\n1522\n.\nStifel published\nVon der christförmingen Lehre Luthers ein überaus schön künstlich Lied samt seiner Nebenauslegung\nⓉ\n(\nAn extremely beautiful artful song about Luther's teaching shaped by Christ including its explanation\n)\n(1522)\n. In this he portrayed Luther as more than a prophet, identifying him with an angel from the Book of Revelation, and claiming he had been sent to reveal the Antichrist. Stifel wrote\n[\n7\n]\n:-\nI believe that this man is sent to us by God, ordained and raised up in the fervour of the spirit of Elias. ... The undertaking and purpose of this pamphlet is to certify and prove the teachings of the Christian angel, Martin Luther, and to show how his writings flow directly from the ground of the holy gospel, Paul, and the teachers of the Holy Scriptures that were sent and certified by God.\nHe sought refuge with a relative of Franz von Sickingen, a highly influential and wealthy man who protected many Humanists and Reformers in his castles, known as \"refuges for righteousness\". However, the castle he had escaped to at Kronberg in the Taunus Mountains was besieged by von Sickingen's enemies in October\n1522\nand Stifel had to flee again. He went to Wittenberg, the town to which Martin Luther had returned in March of\n1522\nafter taking refuge in Wartburg Castle near Eisenach. Stifel lived in Luther's own house for a while and the two became close friends; also at this time he became friendly with Philipp Melanchthon, the Professor of Greek in Wittenberg and one of Luther's first supporters. In\n1523\nLuther obtained a position for Stifel as a pastor but anti-Lutheran pressure forced him out of this and a number of other positions, in particular one in Mansfeld and one in Upper Austria. It was after the Spaniard Ferdinand I became ruler of Bohemia in\n1526\nthat he tried to rid the land of the Protestants and this resulted in Stifel fleeing back to seek refuge with Luther in\n1528\n. Luther then set Stifel up in a parish at Annaburg travelling there with him in October of that year. Not only did Stifel take over the duties of the priest who had just died, but he also married the widow of the deceased, the marriage being conducted by Luther himself.\nStifel settled down well in Annaburg. Luther was delighted with his staunch supporter and there was a lighter side to life too; in the summer of\n1531\nLuther wrote to Stifel that he, along with many cherry-loving boys, will soon visit Stifel's cherry garden. However, Stifel now had the time and peace to return to his earlier ways of using numerology to deduce hidden meanings. He published the pamphlet\nEin Rechenbüchlein vom Endchrist. Apocalypsis in Apocalypsim\nⓉ\n(\nAn arithmetic book of the Antichrist: Revelation of the Apocalypse\n)\n(1532)\nin Wittenberg in which he used numerology to show that the end of the world was near, and that the pope was the Antichrist. Soon after publishing this pamphlet, he did some more calculations and became convinced that he had shown that the world would end at\n8\na.m. on\n18\nOctober\n1533\n. Aware that he was about to warn his congregation of the date of the end of the world, Luther begged him not to make any announcement. However, Stifel was not to be put off and many members of his congregation sold all their possessions, gave up their jobs, and waited in church for the end of the world. When Stifel's prediction failed he was arrested, put in jail and dismissed as a pastor at his church. Luther was quick to forgive his faithful follower and, with Melanchthon's assistance, secured Stifel's release from prison. This episode seemed to cure Stifel of his desire to use numerology to make religious predictions\n(\nat least he stopped making them public\n)\nand he began to turn his very considerable abilities towards mathematics.\nBy\n1535\nStifel had earned another chance to be given a parish and he went to a parish in Holzdorf, close to Annaburg and only about\n35\nkm from Wittenberg; he remained there for\n12\nyears. He now became a serious mathematician, studying mathematics at the University of Wittenberg instructed by Jacob Milich. Unable to read Greek, he studied\nEuclid\n's\nElements\nin the Latin translation by\nCampanus of Novara\n. He also read recent mathematical works in German such as\nChristoff Rudolff\n's\nCoss\n, a work which he greatly respected, and arithmetic texts by several authors including\nAdam Ries\n. Encouraged by Milich, he began to write his own texts, writing three during his twelve years in Holzdorf. These books,\nArithmetica integra\nⓉ\n(\nIntegral arithmetic\n)\n(1544)\n,\nDeutsche arithmetica\nⓉ\n(\nGerman arithmetic\n)\n(1545)\n, and\nWelsche Practick\nⓉ\n(\nItalian practice\n)\n(1546)\nwere major contributions to mathematics and we will examine some innovations contained in the first of these below. These productive years at Holzdorf ended when religious wars broke out in\n1546\nbut these were far from simple Catholic versus Protestant affairs. In the religious Schmalkaldic War of\n1546\n-\n7\n, the Lutheran duke Maurice of Saxony allied with the Catholic Holy Roman emperor Charles V in an attempt to take a region of Saxony away from Protestant control. The Protestant alliance between certain territories of the Holy Roman Empire, the Schmalkaldic League, had been formed in\n1530\nbut in\n1546\nit was attacked by Maurice of Saxony and Charles V who defeated it in\n1547\n. Stifel was forced to flee from his parish again.\nThis time Stifel went to Prussia living in Memel in\n1549\nand Eichholz in the following year. He obtained a parish at Haberstroh near Königsberg in\n1551\nand began lecturing on mathematics and theology at the University of Königsberg. At this time he produced a new edition of\nRudolff\n's\nCoss\n(1552\n-\n1553)\nbut this was certainly not a simple editing exercise but rather he more than doubled its length by adding much material of his own. However, arguments with colleagues over religious issues led to him to return to Saxony in\n1554\n. He obtained a parish at Brück, near Wittenberg but left to go to Jena where he began lecturing at the University on mathematics, in particular on arithmetic and geometry. By\n1559\nStifel's name appears in the register University of Jena as a University Master and priest. He remained in Jena for the last years of his life.\nStifel's research was on arithmetic and algebra but before we examine his contributions to these areas we should say a little about the numerology that he practised before becoming a serious research mathematician. His early \"discovery\" was that pope Leo X was\n666\n, the number of the beast given in the Book of Revelation. He used a method of obtaining a number from words which had been used by many before him. He took the letters of LEO DECIMVS which corresponded to Roman numerals and added these. Taking the sum of L, D, C, I, M, V gave him\n1656\nwhich did not mean much to Stifel. Then, since there are\n10\nletters in LEO DECIMVS and M is the first letter of 'mysterium' he realised that he should move the counter on the M of his counting board onto the X position. This gave him\n666\n, the number of the beast as given in the Book of Revelation:-\nHere is wisdom. Let him that hath understanding count the number of the beast: for it is the number of a man; and his number is Six Hundred Three Score and Six.\nMany years later he wrote about this discovery\n(\nsee\n[\n18\n]\n)\n:-\nI figured that M might mean 'mysterium', went to my cell, kneeled down and prayed to God about this matter. However, I did not pray for long; for I received such consolation, that it consoles me even today, whenever I think about it. And after that I was no longer so fearful and despondent as I was before and from that time on I have always loved the Revelation of John.\nA second method he used, also in use long before Stifel's time, was simply giving each letter its numerical value with\na\n=\n1\n,\nb\n=\n2\n,\nc\n=\n3\na = 1, b = 2, c = 3\na\n=\n1\n,\nb\n=\n2\n,\nc\n=\n3\netc. Note that his alphabet had only\n23\nletters\n(\nno\nj\n,\nu\nj, u\nj\n,\nu\nor\nw\nw\nw\n)\n. His third method is one which he invented himself, namely to give each letter the corresponding triangular number;\na\n=\n1\n,\nb\n=\n3\n,\nc\n=\n6\n,\nd\n=\n10\na = 1, b = 3, c = 6, d = 10\na\n=\n1\n,\nb\n=\n3\n,\nc\n=\n6\n,\nd\n=\n1\n0\netc. Summing the values of the\n23\nletters of his alphabet gave\n2300\nwhich the Book of Daniel says is the number of days to clean the sanctuary. He then set himself the task of writing a poem of\n22\nlines, each line of which had a sum of letters\n(\ntaking the corresponding triangular numbers\n)\nmaking\n2300\n.\nLet us turn now to the innovations which appear in Stifel's\nArithmetica integra\nⓉ\n(\nIntegral arithmetic\n)\n(1544)\n, a work which he dedicated to Philipp Melanchthon. It consists of three books, the first of which is on\nnumber theory\n, particularly the theory of triangular numbers. In this book there is a beautiful and very clever method of constructing magic squares which allows him to construct a\n16\n×\n16\nmagic square\n. The second book of\nArithmetica integra\nⓉ\n(\nIntegral arithmetic\n)\nis devoted to\nEuclid\n's theory of\nirrational\nnumbers, while the third book is a work on coss\n(\nthe name give to algebra at this time\n)\n. Here he makes an early attempt to study negative numbers. Stifel said these numbers, which he called \"absurd\" of \"fictitious\", arise when real numbers are subtracted from nothing. Also in this book he solves cubic and quartic equations using methods from\nCardan\n. In particular, he solves the quartic equation\nx\n4\n+\n2\nx\n3\n+\n6\nx\n2\n+\n5\nx\n+\n6\n=\n5550.\nx^{4} + 2x^{3} + 6x^{2} + 5x + 6 = 5550.\nx\n4\n+\n2\nx\n3\n+\n6\nx\n2\n+\n5\nx\n+\n6\n=\n5\n5\n5\n0\n.\nHe notices that\nx\n4\n+\n2\nx\n3\n+\n6\nx\n2\n+\n5\nx\n+\n6\n=\nA\n2\n+\nA\nx^{4} + 2x^{3} + 6x^{2} + 5x + 6 = A^{2} + A\nx\n4\n+\n2\nx\n3\n+\n6\nx\n2\n+\n5\nx\n+\n6\n=\nA\n2\n+\nA\nwhere\nA\n=\nx\n2\n+\nx\n+\n2\nA = x^{2} + x + 2\nA\n=\nx\n2\n+\nx\n+\n2\n. He solves\nA\n2\n+\nA\n=\n5550\nA^{2} + A = 5550\nA\n2\n+\nA\n=\n5\n5\n5\n0\nto get\nA\n=\n74\nA = 74\nA\n=\n7\n4\n, then solves\nx\n2\n+\nx\n+\n2\n=\n74\nx^{2} + x + 2 = 74\nx\n2\n+\nx\n+\n2\n=\n7\n4\nto get the answer\nx\n=\n8\nx = 8\nx\n=\n8\n. He advises the reader to use his notation rather than that of\nCardan\nin\nArs Magna\n, writing:-\nGet accustomed to transform the signs used by\nCardan\ninto our own. Although his signs are the older, ours are the more commodious, at least according to my judgement.\nAlso in\nArithmetica integra\n, Stifel begins to present for the first time the idea of an exponent. Not only does he give the correspondence between the arithmetic progression\n1\n,\n2\n,\n3\n,\n4\n,\n5\n, ... with the geometric progression\n2\n,\n4\n,\n8\n,\n16\n,\n32\n, ... but he extends it backward so that\n0\ncorresponds to\n1\n, -\n1\ncorresponds to\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n, -\n2\ncorresponds to\n1\n4\n\\large\\frac{1}{4}\\normalsize\n4\n1\n​\n, etc. He seems to even realise that he has stumbled on something important, for he writes:-\nA whole book might be written concerning the marvellous things relating to numbers, but I must refrain and leave these things with eyes closed.\nStifel wrote\nArithmetica integra\nin Latin but his next publication\nDeutsche arithmetica\n(1545)\nwas written in German and was clearly designed to make algebra more widely understandable to a wide range of people. He introduces some very clumsy notation for powers of the unknown which is clearly designed to make the idea more readily understandable and, in some sense, it does. Although he has not yet suggested the notation\nx\n,\nx\nx\n,\nx\nx\nx\n,\nx, xx, xxx,\nx\n,\nx\nx\n,\nx\nx\nx\n,\netc for the powers of the unknown, rather using separate symbols, his clumsy notation of\nDeutsche arithmetica\nⓉ\n(\nGerman arithmetic\n)\nis a first step towards this. In\n1553\nStifel brought out a new edition of\nRudolff\n's\nCoss\n, but he added more material in the form of notes and comments at the end of each chapter that he more than doubled the length of the original text. He gives\nPascal\n's triangle when considering powers of\n(\n1\n+\nx\n)\n(1 + x)\n(\n1\n+\nx\n)\n. That this appears nearly\n100\nyears before\nPascal\nwas born should come as no surprise since\nPascal's triangle\nwas studied by numerous mathematicians before\nPascal\n. One of the advances in Stifel's notes is an early attempt to use negative numbers to reduce the solution of a quadratic equation to a single case. He writes\n(\nwe have modernised the text by using 'coefficient' and '\nx\nx\nx\n'\n)\n:-\nFirst, multiply the coefficient of x by itself and watch the sign - or +. You should know that - and - multiplied yield +\n(\njust as + and +\n)\n.\nAnother of Stifel's advances in this text was to introduce the notation\nA\n,\nA\nA\n,\nA\nA\nA\n,\nA\nA\nA\nA\nA, AA, AAA, AAAA\nA\n,\nA\nA\n,\nA\nA\nA\n,\nA\nA\nA\nA\n, ...  for the powers of the unknown\nA\nA\nA\n. However, he was not bold enough to use this innovative idea in the text where he used a more conventional notation. Of course, when one writes a book there is a certain necessity of producing a text that will be read and few people are prepared to accept too much innovation. Although he is producing a new edition of\nRudolff\n's\nCoss\n, Stifel uses his own notation for roots. If we use ζ for Stifel's symbol for the square of the unknown, then he writes √ζ for the square root that\nRudolff\nwrote √. This seems a backward step but of course it generalises to cube roots, fourth roots etc in a more satisfactory manner than\nRudolff\n's notation. One can think of it as a first step towards\n,\n3\n,\n4\n,\n.\n.\n.\n\\sqrt{}, \\sqrt[3]{}, \\sqrt[4]{}, ...\n​\n,\n3\n​\n,\n4\n​\n,\n.\n.\n.\nthat we use today. He writes:-\nHow much more convenient my own signs are than those of\nRudolff\n, no doubt everyone who deals with these algorithms will notice for himself. But I shall often use the sign √ in place of the √ζ for brevity. But if one places this sign before a simple number which has not the root which the sign indicates, then from that simple number arises a surd number.\nIn other words √\n4\nis a simple number but √\n2\nis a surd. Stifel continues:-\nNow my signs are much more convenient and clearer than those of\nRudolff\n. They are also more complete for they embrace all sorts of numbers in the arithmetic of surds. ... my signs are adapted to advance the subject by putting in place of so many algorithms a single and correct algorithm, as we shall see.\nWe stress here, not that Stifel is introducing a particularly wonderful notation, but that he is so concerned with good notation. This shows a very significant understanding of the way forward for algebra. However, it is worth noting that Stifel still had no notation for =. We end this biography with the following assessment by Kurt Vogel\n[\n1\n]\n:-\n[\nStifel\n]\nwas, in fact, the greatest German algebraist of the sixteenth century.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Campanus of Novara",
    "Christoff Rudolff",
    "Adam Ries",
    "Rudolff",
    "number theory",
    "magic square",
    "irrational",
    "Cardan",
    "Pascal",
    "Pascal's triangle"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}