{
  "nome_completo": "Mihailo Petrović",
  "nome_curto": "Mihailo Petrović",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petrovic/",
  "data_nascimento": "6 May 1868",
  "local_nascimento": "Belgrade, Serbia",
  "data_morte": "8 June 1943",
  "local_morte": "Belgrade, Yugoslavia, now Serbia",
  "summary": "Mihailo Petrović was a Serbian mathematician and inventor who worked in differential equations and phenomenology.",
  "biografia": "Mihailo Petrović\nwas known by the nickname Alas, the fisherman, so his name often appears as Mihailo Petrović Alas. His father, Nikodim Petrović, was the theology professor at Belgrade, and his mother Milica Lazarević was the daughter of the archdeacon Novica Lazarević. Nikodim died when his son Mihailo was around five years old and he was brought up by his mother and grandfather Novica Lazarević. Petrović attended the First Belgrade Gymnasium, graduating from that High School in\n1885\n. He had impressed his teachers with his mathematical ability and had won various prizes. Also by this time he was an enthusiastic river fisherman. Encouraged by his grandfather Novica Lazarević, he had spent many hours fishing on the Sava and the Danube rivers\n[\n19\n]\n:-\nHe began apprenticing with Master Gašpar in\n1882\n, as a third-year student of the High School.\nFishing was not Petrović's only hobby while at school, for he also was very musical and learnt to play the violin. Since his favourite subject at the\nGymnasium\nwas mathematics, after leaving the school he enrolled in the Department of Mathematics and Natural Sciences of the Faculty of Philosophy in the Grand School, which in\n1905\nbecame the University of Belgrade, wanting to specialise in mathematics but taking a general science course which included physics, chemistry, geology, biology, psychology and philosophy as well as mathematics. His mathematics professor at Belgrade was Dimitrije Nešić\n(1836\n-\n1904)\nwho was a major influence on mathematical education in Serbia writing many textbooks, and he was also a founder of the Serbian Academy of Sciences, serving as its president. Petrović graduated with his first degree from the Belgrade Grand School in\n1889\nand decided to pursue further studies in mathematics in Paris.\nPetrović travelled to Paris and once there he prepared to take the entrance examinations for the École Normale Supérieure. He took the examination in\n1890\nand, after the award of very high marks, began his studies attending lectures at the Sorbonne. He was taught by some of the leading mathematicians in the world including\nHenri Poincaré\n,\nJean Gaston Darboux\n,\nPaul Émile Appell\n,\nJules Tannery\n,\nCharles Hermite\nand\nPaul Painlevé\n. As in the Gymnasium, he continued to follow his love of music and, while at the École Normale Supérieure, he established a \"music playing society\". He graduated in\n1892\nwith a degree in mathematics, the Licence es sciences mathématiques, and continued his studies, being awarded a degree in physics, the Licence ès Sciences Physiques, in\n1893\n. He was named as one of the best students of his generation and as such was invited to a reception given by the President of the French Republic. He was already undertaking research for his doctorate advised by\nCharles Hermite\nand\nÉmile Picard\n, and submitted his main thesis\nSur les zéros et les infinis des intégrales des équations différentielles algébriques\nⓉ\n(\nOn the zeros and singularities of the integrals of algebraic differential equations\n)\nin June\n1894\n. His second thesis was entitled\nPropositions données par la Faculté\nⓉ\n(\nProposals given by the faculty\n)\n. The examining committee was\nCharles Hermite\n,\nÉmile Picard\nand\nPaul Painlevé\n, with\nHermite\nthe president of the committee. His name on the thesis is given in a French form as Michel Petrowitch and he dedicated his main thesis to\nJules Tannery\nand\nPaul Painlevé\n. Petrović begins his introduction as follows:-\nIn this work, I deal with some questions concerning the direct study of zeros, infinities, maxima, minima, etc. of integrals of algebraic differential equations, and I apply the results found in the study of the integrals by placing myself in the point of view of the general theory of functions.\nHis second thesis was\nOn recent results on the principle of least action\nand it was approved by\nGaston Darboux\n.\nAfter the award of his doctorate, the Docteur es Sciences Mathématiques, he returned to Belgrade. His professor at Belgrade Grand School had been Dimitrije Nešić, who we mentioned above, and Nešić retired at almost the same time as Petrović returned. The professorship becoming vacant, Petrović applied but he was not the only well-qualified candidate since Petar Vukićević, a slightly older mathematician who had been awarded a doctorate by the University of Berlin in\n1894\n, was also a strong candidate. The competition was very close but Petrović was appointed having received one more vote that Vukićević. What a difference that one vote made, for Vukićević became a school teacher and never did any further research. Petrović was very aware of this and later said\n(\nsee\n[\n12\n]\n)\n:-\nIf I had not obtained that one additional vote for my application for a Grand School professor, I would have never pursued mathematics as my profession. I would have lived on Serbian rivers, not on a boat, but on a dinghy.\nAppointed to the Grand School in\n1894\nas professor for mathematical sciences, he continued there for the rest of his career. He had gained great recognition as a mathematician but he still had a passionate love of fishing and, in\n1895\n, he passed the examination for a master fisherman and earned the right to establish his first professional fishing company. He was proud particularly of his fishing achievements for in\n[\n15\n]\n:-\n... Mihailo Petrović's study ... on the wall above the typewriter stood only one diploma. It was a master's letter, written in rough, unskilled handwriting of a river master fisherman, and signed by the president of the commission, that Mihailo Petrović, a professor, has passed the master's exam for a master river fishermen, and is now certified in the fisherman trade, which the undersigned members of commission recognise and confirm.\nMusic also continued to play a big part in his life and, in January\n1896\n, he founded an orchestra consisting of about a dozen players. This group, which called themselves \"Suz\", played urban folk music and performed in many cities throughout Serbia.\nWith fishing and music playing such a large part in Petrović's life, one wonders if he had much time left to carry out his job as a professor of mathematics. A look at his mathematical output, however, soon shows that he certainly did not slack in this for he published over three hundred mathematics papers. He also wrote three books:\nAn Analysis of Number Intervals\nwhich makes an important contribution to interval numerical analysis;\nElliptic Functions\nwhich is still read by students in Serbia today; and\nMathematical Spectres\nwhich is a highly original work closer to number theory and cryptography than to analysis.\nIn the\n1890\n's he developed the hydraulic computer for the solution of first order ordinary differential equations. Called the hydraulic integrator, it was described in his paper\nSur un procédé d'intégration graphique des équations différentielles\nⓉ\n(\nOn a method of graphical integration of differential equations\n)\npublished in\nComptes rendus de l'Académie des Sciences de Paris\nin\n1897\n. It was translated into Serbian and published as\nHydraulic integrator\nin the following year. The invention was displayed at the World Exposition in Paris in\n1900\nwhere he received a gold medal.\nSince\n1925\nthe\nParis Academy of Sciences\nhad been commissioning a series of monographs reviewing current mathematical problems, the series having the title\nMémorial des sciences mathématiques\nⓉ\n(\nMemorial of mathematical sciences\n)\n. Petrović was asked to write\nIntégration qualitative des équations différentielles\nⓉ\n(\nQualitative integration of differential equations\n)\nwhich appeared as No\n48\nin the series in\n1931\n.\nFor the beginning of Petrović's article, see\nTHIS LINK\n.\nAnother topic on which he worked, which combined his mathematical interest with other interests, was phenomenology. He published\nElements of mathematical phenomenology\n(1911)\n,\nMéchanismes communs aux Phénomènes disparates\nⓉ\n(\nCommon mechanisms for disparate phenomena\n)\n(1921)\n, and\nPhenomenological mapping\n(1933)\n. His work in this area is described in\n[\n20\n]\n:-\nIn order to cast phenomena into a mathematical form, he developed and elaborated a method of phenomenological referencing: when \"the mechanism of the phenomena\" is established, it is represented by a \"figurative point\" in a multidimensional space and then its mechanism mathematically described in a way mechanisms of phenomena are described in classical mechanics. He expounded this method in the monograph 'Phenomenological Mapping' published in\n1933\n. However, he did not stop at phenomena in nature and some phenomena in society, but also invested a great deal of effort to confirm the universality of his method in literature as well. The material he gathered for the accomplishment of this goal was published in\n1967\nin the book 'Metaphors and Allegories'.\nPetrović presented his mathematical work at several International Congresses of Mathematicians: in Paris in August\n1900\n, in Rome in April\n1908\n, in Cambridge, England in August\n1912\n, in Strasbourg in September\n1920\n, and in Toronto, Canada in August\n1924\n. At each of these International Congresses of Mathematicians he was the only participant from Serbia, and by the time of the Toronto congress, Serbia was part of Yugoslavia and he was the only participant from Yugoslavia.\nAs well as being the only Serbian mathematician taking part in the major international mathematics conferences, Petrović was the leader for developing the teaching of mathematics in Serbia. He was the only person who supervised Ph.D. students undertaking mathematical research at the University of Belgrade from\n1912\nto\n1941\n.\nWe have seen from Petrović's attendance at International Congresses of Mathematicians that he was prepared to travel. In fact he loved travelling to remote parts of the world such as the Arctic and the Antarctic. In the summer of\n1931\nhe went from France to Greenland and almost all the way to the North Pole. In the following summer he crossed the Atlantic, to the Sargasso Sea, the Caribbean Islands, Antilles, and Bermuda. The summer of\n1933\nsaw him travel to Labrador and Newfoundland, and the following summer involved sailing via the Atlantic ocean to the Antarctic. The summer of\n1935\nhad a trip to the Indian Ocean as its highlight while in the summer of\n1939\nhe made a shorter trip, going to the Azores. By this time he was over\n70\nbut it was the outbreak of World War II in\n1939\nwhich certainly made further major travels impossible.\nLike many mathematicians, both war and the threat of war, saw their country recruit them for work in cryptography. Petrović is remarkable for documenting all the things he did but, not surprisingly, cryptography is an exception. We do know something of his contributions, however, as recorded in\n[\n11\n]\n:-\nPetrović's achievements in the field of cryptography and ciphering are documented in\n15\nvolumes of the Department for Ciphering of the Intelligence Service of the General Staff Head Office of the Kingdom of Yugoslavia, under the title \"Cryptography - school for training in ciphering\" as well as in\n24\nvolumes entitled \"The System\"\n(\nof coding\n)\n. In these documents, it was recorded that Petrović's work and results of that work are to be found in:\n(\na\n)\nciphering methods;\n(\nb\n)\nmethods for \"cracking\" codes and\n(\nc\n)\ntraining in ciphering techniques and cracking of messages that had been coded.\nInternational fame brought international recognition. Petrović was elected to the\nSerbian Academy of Sciences and Arts\n, the\nYugoslav Academy of Sciences and Arts\n, the\nCzech Academy of Sciences\n, the\nPolish Academy of Sciences\nin Kraków, the\nWarsaw Scientific Society\n, and the\nRomanian Academy\n. He was also a member of many mathematical societies including the\nFrench Mathematical Society\n, the\nMathematical Circle of Palermo\n, the\nRomanian Mathematical Society\n, and the\nUnion of Czech Mathematicians\n.\nHe retired in\n1938\nand he received an honorary doctorate from the University of Belgrade in the following year. The proposal made to the University explaining why he deserved this honour states:-\nM Petrović has created the Mathematical School, the first in Yugoslavia, and with this creative endeavour he elevated the teaching of mathematics at the University of Belgrade to the level of contemporary world-class schools. Our Faculty, University, our state and this entire country owe the highest accolade to Mihailo Petrović.\nAlso in\n1939\nYugoslavia awarded him the Decoration of St Sava of the first degree.\nWe refer to\n[\n12\n]\nfor some information about the many activities that filled his life, some of which we have mentioned above:-\nMihailo Petrović had a rich, interesting and unconventional life. It is difficult to fully enumerate, let alone describe in detail, all the things Petrović engaged in. In addition to his interest in various areas of mathematics, Petrović appears in many other, often unexpected fields. He wrote laws and drafted international agreements, but was also an inventor, holding successful and executed patents. Petrović is considered by many to be one of Serbia's most philosophy, namely mathematical phenomenology. His style of writing was beautiful and interesting and some of his novels are among favourite Serbian pieces of youth literature. He wrote academic papers in and studied other natural sciences, primarily astronomy, theory of relativity and chemistry. He created a coding system and was the main cryptographer of the Serbian and Yugoslav Army. He played violin and conducted the musical band \"Suz\" which up to the onset of the Second World War provided one of the main loci of bohemian life of Belgrade. Finally, he was a great and passionate fisherman, and a great world traveller and seafarer who sailed northern and southern seas. A great mathematician and world traveller died quietly, dreaming about a new and great ocean journey.\nMihailo Petrović died in Belgrade on\n8\nJune\n1943\nat his home in\n22\nKosančićev venac street. In fact the war must have hastened his death. German planes bombed Belgrade beginning on\n6\nApril\n1941\nand German ground forces crossed the Yugoslav border on the same day. Yugoslavia surrendered on\n17\nApril. Petrović had been drafted as a Lieutenant Colonel in the army, although he was\n73\nyears old at the time, and he was immediately arrested by the occupying German forces spending one year in prison. He was released, probably because of the state of his health, and allowed to return to his flat. Once there he just sat in his room and wrote until the end came.\nFinally we quote from\n[\n6\n]\nregarding Petrović's personality:-\nContemporaries of Petrović often witnessed that he was an honest, honourable, and above all an extremely modest man.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Henri Poincaré",
    "Jean Gaston Darboux",
    "Paul Émile Appell",
    "Jules Tannery",
    "Charles Hermite",
    "Paul Painlevé",
    "Émile Picard",
    "Hermite",
    "Gaston Darboux",
    "Paris Academy of Sciences",
    "THIS LINK",
    "Serbian Academy of Sciences and Arts",
    "Yugoslav Academy of Sciences and Arts",
    "Czech Academy of Sciences",
    "Polish Academy of Sciences",
    "Warsaw Scientific Society",
    "Romanian Academy",
    "French Mathematical Society",
    "Mathematical Circle of Palermo",
    "Romanian Mathematical Society",
    "Union of Czech Mathematicians"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}