{
  "nome_completo": "Mikhail Fedorovich Subbotin",
  "nome_curto": "Mikhail Fedorovich Subbotin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Subbotin/",
  "data_nascimento": "29 June 1893",
  "local_nascimento": "Ostrolenka, Russian Empire (now Ostrołęka, Poland)",
  "data_morte": "26 December 1966",
  "local_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "summary": "Mikhail Subbotin was a Soviet Polish mathematician and astronomer who worked on general properties of motion in the n -body problem.",
  "biografia": "Mikhail Fedorovich Subbotin\n's father, Fedor Subbotin, was an army officer. Subbotin entered the Faculty of Physics and Mathematics at Warsaw University in\n1910\n. At this time the University of Warsaw was a Russian university and Warsaw was in \"Vistula Land\", as it was called, under Russian control. Russia had implemented a policy to have \"Vistula Land\" dominated by Russian culture. In a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in Russian. Warsaw only had a Russian language university after the Polish University of Warsaw was closed by the Russian regime in\n1869\n.\nAt the Russian University of Warsaw, Subbotin was awarded the\nCopernicus\nScholarship after a competition run by the department. Although mainly interested in mathematics at this stage, he did begin to find an interest in astronomy when he worked as a calculator for the university observatory. Subbotin graduated from the University of Warsaw in\n1914\nand began his career with an appointment as a junior astronomer at the university.\nWorld War I began in\n1914\nand, by the end of the year, Russian forces controlled almost all of Galicia. However, the Central Powers\n(\nGermany and Austria- Hungary\n)\nrecaptured Galicia and large parts of Congress Poland. The Russian University of Warsaw was evacuated to Rostov-on-Don in\n1915\nand Subbotin went with the rest of the university. A German governor general was installed in Warsaw and a new Kingdom of Poland was declared on\n5\nNovember\n1916\nbut by this time Subbotin was working for his Master's Degree in Rostov-on-Don.\nIn\n1917\nSubbotin submitted his thesis and was awarded his Master's Degree in Rostov-on-Don. Despite his early appointment as a junior astronomer, Subbotin's work at this time was firmly in the area of mathematics. He had already published two papers prior to submitting his Master's thesis, one was\nOn the determination of singular points of analytic functions\nwhile the second was published in France and was on singular points of certain\ndifferential equations\n.\nFrom the evacuated university in Rostov-on-Don, Subbotin moved to the Polytechnic Institute in Novocherkassk. First he was appointed there as an assistant, but soon was made a\nPrivatdozent\n, then promoted to professor of mathematics. In\n1921\n, while progressing well in his career in Novocherkassk, Subbotin received an invitation to work at the Main Russian Astrophysical Laboratory. He accepted the offer and left Novocherkassk in\n1922\nto take up a position as Director of the Russian Astrophysical Laboratory in Tashkent.\nThe Russian Astrophysical Laboratory in Tashkent had been created out of the Tashkent Observatory and, in\n1925\n, the Tashkent Observatory became independent again with Subbotin as the first Director of the newly re-established Observatory.\nFrom\n1930\nhe worked in astronomy and celestial mechanics at Leningrad\n(\nSt Petersburg\n)\nUniversity being appointed as head of the astronomy department there. He held a variety of posts such as Chairman of the Department of Celestial Mechanics\n(1935\n-\n44)\n, Head of the Theoretical Section of Pulkovo Observatory\n(1931\n-\n34)\n, and Head of Leningrad University Observatory\n(1934\n-\n39)\n.\nWorld War II began near the end of\n1939\nand, in June\n1941\n, Germany invaded the Soviet Union. By September\n1941\nGerman armies and the armies of their ally Finland were close to Leningrad. The whole population of the city took part in its defence building antitank fortifications round the city while\n200\n,\n000\ntroops of the Russian army defended the city. By November\n1941\nLeningrad was almost completely cut off.\nThe siege took a huge toll on the population with\n650\n,\n000\ndying in\n1942\nfrom starvation, disease, or more directly from German artillery. In\n1942\none million of the children, the sick, and the elderly were evacuated from the city. Subbotin nearly died of hunger in the siege but, seriously ill, he was evacuated in February\n1942\njust in time to save his life. It is worth noting that Leningrad held out and by January\n1944\nthe German troops were driven back and the siege lifted.\nSubbotin had been taken to Sverdlovsk in February\n1942\nto recover his health. The University of Leningrad was re-established at Saratov and by the end of\n1942\nSubbotin was in Saratov as the Director of the Leningrad Astronomical Institute. Subbotin recommended that the Institute become the Institute of Theoretical Astronomy of the\nUSSR Academy of Sciences\nin\n1943\nand his recommendation was followed. When the situation allowed, the Institute was returned to Leningrad with Subbotin as its head.\nSubbotin's early work was in the theory of functions and\nprobability\n. Later he worked in celestial mechanics producing new methods of calculating orbits from three observations based on solving the\nEuler\n-\nLambert\nequations. His astronomy work used his mathematical skills and\n[\n1\n]\n:-\n... Subbotin not only showed the possibility of improving the convergence of the trigonometric series by which the behaviour of perturbing forces is represented, but also gave an expression for determining\nLaplace\ncoefficients and presented formulas for computing the coefficients of the necessary members of the trigonometric series.",
  "matematicos_citados_na_biografia": [
    "Copernicus",
    "differential equations",
    "Privatdozent",
    "USSR Academy of Sciences",
    "probability",
    "Euler",
    "Lambert",
    "Laplace"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}