{
  "nome_completo": "Mykhailo Pilipovich Krawtchouk",
  "nome_curto": "Mikhail Krawtchouk",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krawtchouk/",
  "data_nascimento": "27 September 1892",
  "local_nascimento": "Chovnitsy, (now Kivertsi) Ukraine",
  "data_morte": "9 March 1942",
  "local_morte": "Kolyma, Siberia, USSR",
  "summary": "Mykhailo Pilipovich Krawtchouk was a Soviet Ukrainian mathematician who worked on differential and integral equations.",
  "biografia": "There are many different transliterations of Mikhail Krawtchouk's name, the forms Kravchuk and Krawtschuk also being used. The form used here \"Krawtchouk\" is the spelling used in the papers which he wrote in French. His father, Filipp Krawtschuk, graduated from Petrovsko-Razumovskaya Academy and became a land surveyor. His mother, born in Poland, was fluent in several European languages and taught Mikhail and his three siblings German, Polish, and French. But the main language the family spoke every day was their native Ukrainian.\nWhen Mikhail was nine years old, in\n1901\n, the family moved to Lutsk, a city on the Styr River in northwest Ukraine. He attended the Lutsk Gymnasium and graduated with the Gold Medal. Krawtchouk then studied at the St Vladimir University in Kyiv and obtained his first degree in\n1914\n. He published his first paper in\n1914\n, namely\nOn groups of commutative matrices\n(\nRussian\n)\n. The First World War broke out shortly after Krawtchouk graduated and, because of problems at Kyiv University it was evacuated to Saratov. Krawtchouk, however, chose to move to Moscow. A note dated\n2\nNovember\n1916\ncontains his own report of his studies at Moscow University and this is given in\n[\n6\n]\n. The paper\n[\n6\n]\nalso contains a report by\nDmitry Aleksandrovich Grave\n, dated\n21\nFebruary, giving an evaluation of Krawtchouk as a mathematician.\nThis, however, was a time of severe political problems with one disruption following another for Krawtchouk. In\n1917\nthe Bolsheviks seized power in St Petersburg and fighting broke out in Moscow. Bolshevik power was soon firmly established and Krawtchouk returned to Kyiv. For two years Krawtchouk taught in a number of different institutions until the outbreak of the civil war. This was not an easy period for, in January\n1918\n, an independent Ukrainian state was proclaimed with Kyiv as its capital. Red Army troops entered Kyiv in the following month. In Kyiv, Krawtchouk had met Esfira Iosifovna when they were both students\n[\n25\n]\n:-\nThey met for the first time during their student days, in Kiyanovskiy lane, where two sisters from Kyiv arranged dinners for students. They got married in\n1918\n, taught together at the Savarian school.\nMikhail Filippovich and Esfira Iosifovna Krawtchouk had two children, a son Zhenya and a daughter Natasha.\nLater in\n1918\nan independent Ukraine was again declared in Kyiv but there followed a series of struggles between Ukrainian nationalist, White, and Red forces. In November\n1919\nKyiv was briefly taken by the White armies before being occupied by the Red Army. There was still no peace in Kyiv for, in May\n1920\nthe Poles captured Kyiv but were driven out in a counterattack. During this stormy period Krawtchouk was headmaster at a country school not far from Kyiv. It was in\n1920\nthat Krawtchouk wrote his\n96\n-page handwritten book\nGeometry for seven-year labour schools\n. It was never printed or published and was only discovered in November\n2005\n. The article\n[\n14\n]\nexamines this book:-\nYoung talented mathematician already in the first years of his professional work didn't stand aside the issues of general education. He who has not only taught mathematics in secondary schools\n(\nI, II Ukrainian schools, electrical school, etc.\n)\n, but also at the university, other institutions of Kyiv, being desperate about financial difficulties\n(\nwhich our entire intelligence experienced in that times\n)\nin the village Savarka\n(1920\n-\n1921)\n, painfully feeling the lack of textbooks, undertook to conclude this book. He is working hard in the evenings and night hours, alternating between the research on higher mathematics\n(\nthe theory of variable matrix transformations of quadratic forms, the theory of correlation, interpolation theory of functions of a real variable, etc.\n)\nand the best ways to apply elementary mathematics for students in grades\n5\n-\n7\n.\nAfter working on his doctoral thesis advised by\nDmitry Aleksandrovich Grave\n, he was awarded a doctorate for a dissertation\nOn Quadratic Forms and Linear Transforms\nin\n1924\n. In the same year he attended the International Mathematical Congress in Toronto, giving the lecture \"Note sur l'interpolation généralisée\"\nⓉ\n(\nNote on generalized interpolation\n)\n, and made contacts with many mathematicians. Four years later he attended the International Mathematical Congress in Bologna where he gave the lecture \"Sur l'integration approchée des équations différentielles linéaires\"\nand he continued his attendance at International Congresses of Mathematicians at Zurich in\n1932\ndelivering the lecture \"Sur le problème des moments\"\nⓉ\n(\nOn the problem of moments\n)\n.\nKrawtchouk's contacts with other mathematicians were extremely valuable, particularly those with\nJacques Hadamard\n,\nDavid Hilbert\n,\nRichard Courant\nand\nFrancesco Tricomi\n. In\n1929\nKrawtchouk published his most famous work,\nSur une généralisation des polynômes d'Hermite\nⓉ\n(\nOn a generalisation of Hermite polynomials\n)\n. In this paper he introduced a new system of orthogonal polynomials now known as the Krawtchouk polynomials, which are polynomials associated with the binomial distribution. Let us note that, in March\n2021\n, MathSciNet lists\n112\npapers with 'Krawtchouk' in the title,\n88\nof these having 'Krawtchouk polynomials' in the title. An additional\n26\npapers have 'Kravchuk' in their title. For more information about Krawtchouk polynomials, see\n[\n19\n]\nor\n[\n20\n]\n; this paper has the following review:-\nOrthogonal Krawtchouk\n[\nKravchuk\n]\npolynomials present a system of polynomials that are orthogonal with respect to the weight function which is the density of the binomial probability distribution. These polynomials belong to the class of orthogonal polynomials with discrete variables and were introduced by the Ukrainian mathematician M Krawtchouk in\n1929\n. The content of original works by Krawtchouk devoted to this topic is described in detail here. A survey of the further developments and applications of Krawtchouk polynomials is provided.\nAlthough most references today are to Krawtchouk polynomials, his mathematical work was very wide and, despite his early death, he was the author of around\n180\narticles on mathematics. He wrote papers on differential and integral equations, studying both their theory and applications. The paper\n[\n14\n]\nby V O Movchan has the following summary:-\nWe analyse M P Kravchuk's work on generalising methods for the integration of ordinary differential equations, in particular the least squares method and the Ritz method, and on developing new methods for the approximate integration of differential, integral, and integro-differential equations. We prove that Kravchuk's scientific interest in this area was greatly stimulated by the studies of Walther Ritz and\nNikolai Mitrofanovich Krylov\n.\nOther areas he wrote on included algebra\n(\nwhere among other topics he studied the theory of permutation matrices\n)\n, geometry, mathematical and numerical analysis, probability theory and mathematical statistics. Eugene Seneta writes about his contributions to statistics in\n[\n23\n]\n:-\nHis work in mathematical statistics relates to the theory of correlation and regression, the bivariate normal, the method of moments in statistics, and orthogonal polynomial systems. Some of this was influenced by the work of the English Biometric School headed by\nKarl Pearson\n, as was the early work of\nSlutsky\n, also in Kyiv in the early years of his career. A theme running through much of Kravchuk's work, and not only in mathematical statistics, is the method of moments. His statistical direction was initially driven by the work of\nChebyshev\non interpolation and the method of moments, which in turn derived partly from\nChebyshev\n's contact with the works of\nBienaymé\n. In the Zapysky version of the\n1929\npaper, all the substantial papers of Chebyshev on interpolation are mentioned. Kravchuk, however, uses a more modern matrix approach in contrast to\nChebyshev\n's continued fractions.\nChebyshev\n's work was dominant in probability and statistics in the old czarist Russian empire, and this influence of the St Petersburg School is natural on a strong mathematician such as Kravchuk.\nHe was also interested in the philosophy of mathematics, the history of mathematics and mathematical education. Krawtchouk edited the first three-volume dictionary of Ukrainian mathematical terminology\n[\n25\n]\n:-\nMikhail Krawtchouk was the first in Ukraine to develop a project concerning algebraic and geometric terminology. Under his leadership, in the\n1920\ns, employees of the Institute of the Ukrainian Scientific Language compiled a three-volume mathematical dictionary. And the students of Mikhail Filippovich, even after his death, will remember not only the beauty of the ideas that were presented in Krawtchouk's lectures, but also the beauty of his Ukrainian speech.\nIn\n1929\nKrawtchouk was elected a full member of the\nUkrainian Academy of Sciences\n. He taught at the Kyiv Polytechnic Institute\n(\nnow the National Technical University of Ukraine\n)\nwhere he became a professor and was head of the Mathematical Chair. Surprisingly, despite continuing to publish deep research papers and having a high teaching and administrative load, he found time to publish articles on teaching mathematics in schools. For example he published the articles\n(\nall in Ukrainian and some with co-authors\n)\nElements of the theory of determinants\n(1933)\n,\nA new method of teaching logarithms in secondary schools\n(1936)\n, and\nApproximate calculations in secondary schools\n(1936)\n. This, however, was a time of new political problems.\nAt this time political life in the USSR revolved round the exposure and suppression of alleged plotters against the regime. The country was subjected to an vigorous campaign against so-called enemies of the people. There was a series of public trials and in a massive terror campaign against the population as a whole. The worst phase of the terror took place during the period\n1937\n-\n38\nwhen at least five million people were sent to camps mostly in the Arctic. In\n1937\nKrawtchouk was accused of being a Polish spy and also a bourgeois nationalist\n[\n25\n]\n:-\nThe accusation was even that he had knowledge of foreign languages and corresponded with scholars of capitalist countries.\nHe was arrested, tried and sentenced to twenty years in prison and five years in exile. As part of the punishment imposed on him, Krawtchouk was stripped of his membership of the\nUkrainian Academy of Sciences\nand his exile was to be spent at the Kolyma camp in northeastern Siberia, one of the two most notorious of the Corrective Labour Camps. He was subjected to cruel torture and wrote to the chairman of the Supreme Court of the USSR\n(\nsee\n[\n7\n]\n)\n:-\nI was stunned by these wild accusations, physically beaten by night interrogations, in particular, complete deprivation of sleep for eleven days, exacerbation of heart disease, measures of direct physical impact, morally affected by screams, moans of torture in neighbouring rooms ...\nFor an English translation of\n[\n7\n]\nsee\nTHIS LINK\n.\nHis GULAG sentence is also the subject of\n[\n25\n]\n; for an English translation see\nTHIS LINK\n.\nHe was finally broken by threats against his family: if he refused to accept that he had committed the crimes he was accused of, his family would be arrested and destroyed. He died at the age of\n49\nin Kolyma, one of the Labour Camps set up by the Gulag. As was typical of such events, Krawtchouk was written out of history at this time as if he had never existed. In\n1956\n, however, he was rehabilitated but, although his work could now be spoken about, there would still be no mention of how he had met his death or where he died. For example,\n[\n30\n]\nwritten in\n1968\n, gives an accurate account of his work, lists\n161\nof his publications, but concerning his death it simply states:-\nThe eminent scientist died on March\n9\n,\n1942\n, at the height of his creative powers and potential.\nIn March\n1992\n, fifty years after his death, he was restored as a member of the\nUkrainian Academy of Sciences\n. In September\n1992\nthe First International M Krawtchouk Conference was held in Ukraine. Since then these conferences have been a yearly event. There was a special number of the\nUkrainian Mathematical Journal\n44\n(7)\n1992\ndedicated to Krawtchouk; references\n[\n4\n]\n,\n[\n5\n]\n,\n[\n11\n]\n,\n[\n12\n]\n,\n[\n17\n]\n,\n[\n18\n]\n,\n[\n19\n]\n,\n[\n20\n]\nall relate to this special issue\n[\n23\n]\n:-\nPlaques in his memory have now been erected in Lutsk and in Kyiv, and a small museum established in part of the elementary school in Chovnytsia.\nLet us end this biography by quoting from Eugene Seneta about work of Krawtchouk which has hardly been noticed\n[\n23\n]\n:-\nA little-noticed feature of Kravchuk's work is the expansion of a binomial probability value in terms of Krawtchouk polynomials orthonormal with respect to another binomial distribution. The germ of the idea is the analogous expansion of densities in terms of\nHermite\npolynomials in\nChebyshev\n's last probability paper\n(1887)\n; and Kravchuk's expansion also produces the Charlier expansion of a binomial probability in the limit. More importantly, he gives a bound on the error of partial expansion, a very Chebyshevian idea. More importantly still, in his\n1931\npaper, he produces a polynomial system orthonormal with respect to the hypergeometric distribution. Subsequently this system, overlooked at the time outside Ukraine, even though it was described by Smohorshewsky in the very same French journal\n(\nC.R. Acad. Sci., Paris,\n200\n(1935)\n801\n-\n803)\nhas come to be credited to later work of\nWolfgang Hahn\n. Inasmuch as the binomial distribution can be considered as a limit of the hypergeometric, this system generalises the Krawtchouk polynomials.",
  "matematicos_citados_na_biografia": [
    "Dmitry Aleksandrovich Grave",
    "Jacques Hadamard",
    "David Hilbert",
    "Richard Courant",
    "Francesco Tricomi",
    "Nikolai Mitrofanovich Krylov",
    "Karl Pearson",
    "Slutsky",
    "Chebyshev",
    "Bienaymé",
    "Ukrainian Academy of Sciences",
    "THIS LINK",
    "Hermite",
    "Wolfgang Hahn"
  ],
  "imagens": [
    "krawtchouk.jpg"
  ]
}