{
  "nome_completo": "Mina Spiegel Rees",
  "nome_curto": "Mina Rees",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rees/",
  "data_nascimento": "2 August 1902",
  "local_nascimento": "Cleveland, Ohio, USA",
  "data_morte": "25 October 1997",
  "local_morte": "New York City, USA",
  "summary": "Mina Spiegel Rees was an American mathematician and a pioneer in the history of computing. She had a major impact on the academic and research culture of the United States.",
  "biografia": "Mina Rees\n's parents were Moses Rees\n(1858\n-\n1932)\nand Alice Louisa Stackhouse\n(1870\n-\n1946)\n. Moses Rees was born in New York on\n26\nJuly\n1858\nto parents Herman Rees and Mina Spiegel who had emigrated from Germany. Moses Rees became an insurance agent. Alice Louisa Stackhouse was born in Heath End, England on\n1\nNovember\n1870\nto parents Joseph Stackhouse and Isabella Milling. The\n1881\nUK census records the Stackhouse family is living in Kidderminster, Alice is at School and her father Joseph's occupation is given as \"iron roller.\" The Stackhouse family emigrated to the United States in\n1882\n. Moses Rees met Alice Stackhouse in Lebanon Pennsylvania and they were married there on\n1\nSeptember\n1892\n. Moses and Alice Rees had five children: Elsie Isabella Rees\n(1893\n-\n1975)\n, Albert L Rees\n(1894\n-\n1992)\n, Clyde Harvey Rees\n(1896\n-\n1967)\n, Clarence Eugene Rees\n(1898\n-\n1966)\n, and Mina Spiegel Rees\n(1902\n-\n1997)\n, the subject of this biography.\nLet us note here\n(\nwhere dates refer to the US census\n)\nthat: Elsie Isabella Rees was a stenographer in publishing\n(1910)\n, and had no occupation\n(1920\nand\n1930)\n; Albert L Rees was a clerk in a steel company\n(1910)\nand was foreman in a gravel company\n(1920)\n; Clyde Harvey Rees was a shipping clerk in a steel company\n(1910)\nand a salesman in a millinery company\n(1920)\n; and Clarence Eugene Rees was a manager in an electric company\n(1920\nand\n1930)\n.\nWhen Mina was two years old the family moved from Cleveland to the Bronx in New York City. Mina grew up in New York City and attended public school there but life was quite hard. She said\n[\n4\n]\n:-\nMy father kept giving away all the money we had, thinking other people were worse off than we were. He was a charming guy.\nShe attended Hunter College High School, associated with Hunter College with which she was to have a long association\n[\n31\n]\n:-\nHer friend Leah Jonas recalled that Mina had \"a vital, joyous, wonderful, and delightfully down to earth personality.\" Mina played a ukulele guitar at lunch time in Hunter High School Math Club and everyone sang songs.\nShe graduated from Hunter College High School as valedictorian of her class in\n1919\n. She then entered Hunter College where she majored in mathematics and took a large part in College life\n[\n18\n]\n:-\nShe was president of her freshman and sophomore classes and, during her senior year, of the Student Self Governance Association. During her junior year she served as editor-in-chief of the Hunter College yearbook, the Wistarion.\nShe graduated with distinction in\n1923\nand the\nWistarion\nrecorded in \"History of the Class of\n1923\n\":-\nUnder the able leadership of our presidents, Anna Michels and Mina Rees, we have taken part in all college affairs. The Brick Book Campaign, Alumnae Bazaar, the Publicity Committee and the Union all felt our hearty cooperation.\nYou can read Mina Rees's report on her year as President of the Hunter College Student Self-Government Association at\nTHIS LINK\n.\nAfter graduating, she was offered a position as a mathematics teacher at Hunter College by Emma Matilda Requa\n(1852\n-\n1937)\n, the Head of the Department of Mathematics. Rees, however, had already formed the opinion that the lecturers at the College were not well enough qualified. She said in the\n1969\ninterview\n[\n32\n]\n:-\nI had formed a firm opinion when I was an undergraduate that this was a bad mistake that the College was making, employing people who had just graduated. I felt that the standards of the College were not high enough and that people should be better educated before they ... became teachers there. So, I said I could not under any circumstances, teach at the College because I wasn't\n[\nwell enough educated\n]\n. ...\n[\nEmma Requa\n]\nwas appalled at anything like this, so she got me a job at Hunter High School.\nAppointed as an assistant teacher at Hunter High School, Rees continued her studies at Columbia University. In an interview, see\n[\n10\n]\n, she spoke of the attitude that she encountered there:-\nWhen I had taken four of their six-credit graduate courses in mathematics and was beginning to think about a thesis, the word was conveyed to me - no official ever told me this but I learned - that the Columbia mathematics department was really not interested in having women candidates for Ph.D.'s. This was a very unpleasant shock. ... That was the only episode that raised a question about the appropriateness of mathematics as a field for women before I had my Ph.D. It was a really traumatic affair for me. ... I decided to switch to Teacher's College and take the remaining courses necessary for an M.A. there.\nIt is worth noting that only one woman received a Ph.D. in mathematics from Columbia University between\n1923\nand\n1939\n, namely\nEdna Ernestine Kramer\n.\nAfter receiving her M.A. in\n1925\n, Rees returned to Hunter College where she was appointed to the post of instructor. Determined not to allow the attitude of Columbia University to prevent her from completing her doctorate, she saved up money from her salary to enable her to enrol at the University of Chicago in\n1929\nafter obtaining leave of absence from Hunter College. She took a rather unconventional approach to beginning her Ph.D. studies\n[\n32\n]\n:-\nI decided that\nDickson\nwas the greatest man in the world and Chicago was undoubtedly the mecca of all algebraists, so without mentioning it to Chicago I just went out in\n1929\nand turned up ...\nShe was looking for\nLeonard Eugene Dickson\nto advise her researching a topic in associative algebra but, unknown to her, his interests had moved to number theory by this time. In fact Rees had some good fortune for, within a month of her arrival in Chicago, the new president of the University of Chicago, Robert Maynard Hutchins, was inaugurated. Rees represented the Hunter College Mathematics Department at the inauguration and was a guest of honour at the dinner given by the Chicago Mathematics Department to celebrate the occasion. It was soon after this dinner that\nDickson\nasked her to undertake research for her Ph.D. advised by him.\nDickson\n's interests were not by then on associative algebra so he played little part as her advisor\n[\n32\n]\n:-\nI just informed him I wanted abstract algebra, and there just wasn't any work going on in abstract algebra at Chicago while I was there, so I am virtually self-educated. It was the craziest arrangement.\nDespite these difficulties, in\n1931\nRees graduated with her doctorate for a thesis entitled\nDivision algebras associated with an equation whose group has four generators\n.\nSaunders Mac Lane\nwrites in\n[\n15\n]\n:-\nNow for a missed opportunity for mathematics in connection with Mina. Mina's thesis was finished in the spring of\n1931\n. Professor\nDickson\nmight then have recommended her for an NRC postdoctoral fellowship. If she had won one, and if she had heard of\nNoether\n, she could have gone to Göttingen, where she would surely have attended\nNoether\n's lectures on hypercomplex systems and factor sets. From Mina's subsequent accomplishments we know that she would have understood these notions and made use of them to simplify her earlier proof. We know that\nEmmy Noether\ntook care of her associates and students, both men and women. We also know about Mina and so can imagine many splendid research results.\nThe opportunity was missed, however, and Rees returned to Hunter College where she was promoted to assistant professor in\n1932\nand then to associate professor in\n1940\n. However, in\n1943\nshe took leave so that she could contribute to the war effort. She worked as a technical aide and executive assistant with the Applied Mathematics Panel in the Office of Scientific Research and Development. In this job she had to take problems submitted to the Panel, find the underlying mathematics behind the problems, and then find the right university mathematician to solve it. She writes in\n[\n63\n]\n:-\nI shall present an account of some of the activities in mathematics that were carried on during World War II and comment on their impact on the development of the mathematical sciences in the United States after the war. Most of this memoir will be concerned with aspects of mathematical activity with which I had personal contact because of my role as executive assistant to\nWarren Weaver\n, who was Chief of the Applied Mathematics Panel of the Office of Scientific Research and Development during the war, and with war-related developments that came within my purview because of my responsibilities as head of the mathematical research program of the newly established Office of Naval Research after the war.\nIn\n[\n63\n]\nRees presents 'An Overview of the Work of the Applied Mathematics Panel'; for an extract see\nTHIS LINK\n.\nThe Association for Women in Mathematics sponsored a panel on \"Women Mathematicians before\n1950\n\" at the summer meeting in Providence, R.I., on\n9\nAugust\n1978\n. One of the speakers was Mina Rees and she gave much insight into the work of the Applied Mathematics Panel'; see her contribution at\nTHIS LINK\n.\nFor her work with the Applied Mathematics Panel, Rees received the President's Certificate of Merit at the end of the war. She also received the King's Medal for Service in the Cause of Freedom from the British government.\nIn\n1946\nthe US Navy invited Rees to become Head of the mathematics branch of the Office of Naval Research to support scientific and mathematical research. In\n1949\nshe became Director of the Mathematical Sciences Division and then, in\n1952\n, Deputy Science Director. At the December\n1953\nmeeting of the\nAmerican Mathematical Society\n, Rees's achievements in these important roles was recognised with the following resolution\n[\n65\n]\n:-\nThe very striking and brilliant contributions made by pure\n(\nnon-military, non-applied\n)\nscience, not least of these by mathematics, to the winning of World War II is well known. It was clearly seen by the government and those responsible for the armed services that a large scale fostering by the U.S. government of fundamental research, the basis of all research, was unavoidable. ... Needless to say as the purest of all sciences, mathematical research might well have lagged behind in such an undertaking. That nothing of the sort happened is beyond any doubt traceable to one person - Mina Rees. Under her guidance, basic research in general, and especially in mathematics, received the most intelligent and wholehearted support. No greater wisdom and foresight could have been displayed and the whole post-war development of mathematical research in the United States owes an immeasurable debt to the pioneer work of the Office of Naval Research and to the alert, vigorous and farsighted policy conducted by Miss Rees. The influence of these policies has been such that it vitally affected later developments: the activities of Air Force and Ordinance research, the National Science Foundation itself. It is well known that in these more recent organisations Mina Rees was constantly appealed to for counsel and guidance.\nIn\n1953\nRees returned to Hunter College, the institution she had left on extended leave\n10\nyears previously to undertake war work. She was appointed professor of mathematics and dean of the faculty, positions she held until\n1961\n. However, during these eight years back at Hunter College she served on numerous national committees which included the National Research Council, the National Bureau of Standards and the National Science Foundation. Rees also acted as a consultant on the machine handling of data for the\n1960\ncensus.\nMina Rees had met Leopold Brahdy at a party in\n1936\n[\n31\n]\n:-\nWhile they were talking, he mentioned his intention to go to Russia as a member of a group in order to study various aspects of life in that country. He suggested she join the group. Since she was planning to go to the Mathematical Congress in Oslo, she accepted.\nShe married Leopold Brahdy on\n24\nJune\n1955\n. Brahdy, born in Vienna, Austria on\n6\nMay\n1891\n(\nor\n6\nMay\n1892\n, the date he gave on at least one official form\n)\nand immigrated with his family to the United States when he was six years old. He had studied at Columbia College where he graduated with a B.S., and the College of Physicians and Surgeons for his M.D. He was licenced to practice medicine and was a surgeon. He had married the artist Dorothy Kohnstann\n(1899\n-\n1982)\non\n10\nOctober\n1929\nbut they were later divorced. Brahdy was elected Vice-Chairman of the Metropolitan New York Section of the History of Science Society in\n1969\nand was later Chairman for a short term. This Society had come about by the efforts of\nDoris Hellman\n,\nCarolyn Eisele\nand\nCarl Boyer\n. The marriage worked out well, helping rather than hindering Rees's career\n[\n31\n]\n:-\nMina found no conflict between her marriage and her job, but added, \"I'm fortunate. You do have to be careful about the husband you select. Mine is interested in my career and enjoys it.\"\nRees left Hunter College in\n1961\n, taking up the post of dean of graduate studies in the newly established City University of New York\n(\nCUNY\n)\n. Graduate studies at CUNY were very much directed by Rees during her\n11\nyears there as she was appointed provost of the graduate division for\n1968\n-\n1969\nand then president of the Graduate School and University Center from\n1969\nuntil she retired in\n1972\n. While dean of graduate studies at CUNY she wrote in\n1965\n(\nsee\n[\n15\n]\n)\n:-\nIt may be because the Graduate Dean is a woman, or it may be for completely objective reasons, that ours is proving an ideal university to draw into advanced graduate work the most obvious source of unused talent in a society that desperately needs additional numbers of persons with training through the doctorate, namely women.\nAlthough Rees did not continue with the algebra research she undertook for her doctoral thesis, she made major contributions to mathematical education and to the development of computers. Her papers on mathematical education include\nModern Mathematics and the Gifted Student\n(1953)\n,\nNew Frontiers for Mathematicians\n(1955)\n,\nMathematicians in the Market Place\n(1958)\n,\nThe Nature of Mathematics\n(1962)\n, and\nThe Scientist in Society: Inspiration and Obligation: The scientist today must accept a role more difficult than that of his predecessors\n(1975)\n. You can read short extracts from these papers at\nTHIS LINK\n.\nHer papers on computers include\nThe Federal Computing Machine Program\n(1950)\n,\nDigital computers - their nature and use\n(1952)\n,\nComputers:\n1954\n(1954)\n,\nDigital Computers\n(1955)\n, and\nThe impact of the computer\n(1958)\n. You can read short extracts from these papers at\nTHIS LINK\n.\nAnother area in which Rees made significant contributions was in working to make advanced degrees in mathematics and other subjects natural for women to study\n[\n72\n]\n:-\nRees's efforts to bring more women into advanced study in all fields were significant. As more and more women, at all stages in their lives, started attending college and graduate school, Rees clearly saw the need for flexibility. Modern graduate students and non-traditional students, especially females, could not be expected to be solely students. They were employees, spouses, and parents. Rees strove to build a program at CUNY that nurtured instead of alienated these new types of students, and advocated for similar programs across the country.\nRees received many awards for her outstanding contributions. In\n1962\nshe received the first Award for Distinguished Service to Mathematics from the\nMathematical Association of America\n[\n2\n]\n:-\n... for outstanding service to mathematics, other than mathematical research ...\n[\nand for\n]\ncontributions\n[\nthat\n]\ninfluence significantly the field of mathematics or mathematical education on a national scale.\nIn\n1970\nshe became president elect of the American Association for the Advancement of Science and in\n1971\nshe became the first woman president of that Association\n[\n81\n]\n:-\nIn the balloting by mail for the presidency of the AAAS, Dr Rees to her surprise won over another mathematician, Dr\nMark Kac\n, of Rockefeller University, New York. She says she never expected to be elected. She tried to hide the fact she had even been nominated from her husband, Dr Leopold Brahdy, a physician. She didn't succeed in that ploy - he was getting mail from the AAAS in his own name.\nFor more details from the article\n[\n81\n]\n, see\nTHIS LINK\n.\nIn\n1983\nRees was awarded the\nNational Academy of Sciences\nPublic Welfare Medal\n[\n3\n]\n:-\nFor her contributions to the scientific enterprise, especially in mathematics, astronomy, and computer sciences, from wartime, through the transition from war to peace, and continuing today.\nIn addition Rees was awarded honorary degrees from around twenty universities and colleges.\nIn\n[\n15\n]\nUta Merzbach describes Rees in these terms:-\nMina Rees was eminently rational. Her devotion to reason helped her formulate goals clearly and allocate resources judiciously in accordance with these goals. ...\nMina Rees was eminently intelligent. She comprehended quickly, communicated effectively, and thought creatively. Her ability to attach realisable pieces of basic research to mission-oriented applications of mathematics did much to develop a broadened base of support for mathematicians' work.\nMina Rees was eminently civilised. Her diplomatic skills were considerable; her conversational technique bespoke her broad knowledge base as well as her wide interest in mathematical and non-mathematical topics. Experience and reflection led her to a balanced outlook on teaching and research, the arts and sciences, long-range and short-range planning and obligations of the professional and the private life.\nAmong Rees's interests other than her academic work we mention oil painting, music, dance, literature, bird watching, travel and cooking. For a number of years, she went to Mexico each summer to paint, then later she went to Maine for painting.\nLeopold Brahdy, Rees's husband, died on\n30\nNovember\n1977\n. Rees had retired in\n1972\nand died in the Mary Manning Walsh Home in Manhattan at the age of ninety-five. Let us end with the following conclusion of Amy Shell-Gellasch\n[\n70\n]\n:-\nMina Rees had a profound, though for the most part unseen, impact on the mathematical sciences in the United States. However, the academic and research culture in which many of us work is in large part a product of her insight and dedication.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Edna Ernestine Kramer",
    "Dickson",
    "Leonard Eugene Dickson",
    "Saunders Mac Lane",
    "Noether",
    "Emmy Noether",
    "Warren Weaver",
    "American Mathematical Society",
    "Doris Hellman",
    "Carolyn Eisele",
    "Carl Boyer",
    "Mathematical Association of America",
    "Mark Kac",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}