{
  "nome_completo": "Mischa Cotlar",
  "nome_curto": "Mischa Cotlar",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cotlar/",
  "data_nascimento": "1 August 1913",
  "local_nascimento": "Sarny, Ukraine",
  "data_morte": "16 January 2007",
  "local_morte": "Buenos Aires, Argentina",
  "summary": "Mischa Cotlar was a Uruguayan mathematician who worked in the fields of harmonic analysis, ergodic theory and spectral theory.",
  "biografia": "Mischa Cotlar\n's parents were Ovsey Cotlar\n(1879\n-\n1952)\nand Sara Medved\n(\n-\n1965)\n. Ovsey Cotlar ran a flour mill, but was more famous as an outstanding chess player. He died in\n1952\nand an obituary in the September-October\n1952\nissue of the Chess magazine\nCaissa\nstated:-\nRecently passed away in the capital\n(\nBuenos Aires\n)\n, the Russian teacher Ovsey Cotlar, widely known for his research on the\nLasker\ndefence of the Queen's gambit and the Rubinstein system of the Ruy Lopez, work that adorned the pages of 'Caissa' at the time. Despite his advanced age of\n73\nyears, he could still expect other contributions to the theory which is why his death is more regrettable.\nChess was not Ovsey Cotlar's only passion, however, for he was also deeply interested in mathematics and music. Mischa had an older brother Sasha Cotlar, born\n7\nApril\n1910\n, died\n1991\n. In\n1928\nthe Cotlar family, who were Jewish, emigrated from Ukraine, forced out by the Bolshevik revolution, and arrived in Montevideo. Mischa was only\n15\nat this time and had only had one year of formal education. He had been taught both mathematics and music by his father and was an excellent pianist.\nThe Cotlar family were poor, living in a single room in Montevideo, and they all had to work to earn a living. Ovsey became a newspaper salesman, selling newspapers in front of a hotel on the Avenida\n18\nde Julio, the main street in Montevideo. Sasha worked on the tramway while Mischa played the piano from\n4\np.m. to\n4\na.m. in a harbour bar. The first possession that Ovsey bought was a piano for Mischa. It was paid for in instalments and only fitted into their one room accommodation with great difficulty.\nThat this was no ordinary poor family became apparent once Ovsey Cotlar began playing competitive chess. The Uruguayan Chess Society held an annual competition which Ovsey won. This gained him immediate fame with reporters interviewing the newspaper seller who had beaten all the Uruguayan chess players. Ovsey told the reporters that he had a son who was mathematically gifted and this was reported in the papers. This immediately made the Uruguayan mathematician\nRafael Laguardia\ntake notice since he was himself an avid chess player.\nLaguardia\nwas an excellent mathematician who had studied with\nÉmile Picard\nat the Sorbonne in France. He invited Cotlar to join a mathematical group that met in his home.\nJosé Luis Massera\nwrites\n[\n13\n]\n:-\nIt was immediately evident that he not only was very talented but showed a great originality.\nJoining\nLaguardia\n's small group gave him access to several mathematicians but, perhaps even more significant, it meant that he gained access to\nLaguardia\n's excellent mathematical library. Before leaving Ukraine, Cotlar had studied\nDmitry Grave\n's number theory book and solved some of the open problems in the book. He showed\nLaguardia\nhis solutions and\nLaguardia\nwas totally amazed that a boy with only one year of formal schooling could produce mathematics which was not only correct but was rigorously written with ingenious arguments. Although Cotlar had solved some open problems, other mathematicians had solved them too and published the results but, of course, Cotlar had no way of knowing this. After being a member of\nLaguardia\n's group for two years, in\n1930\nLaguardia\nasked him to teach a course on number theory at the Engineering School of the Universidad de la República. At this time he was still earning money by playing the piano in the harbour bar but, in\n1931\n,\nLaguardia\narranged for him to play in a trio to entertain the customers at the up-market British Hotel in the seaside resort on Punta del Este.\nJulio Rey Pastor\nbegan to visit\nLaguardia\n's group in Montevideo.\nJosé Luis Massera\nwrites that\n[\n13\n]\n:-\n... every weekend\n\"Don\" Julio Rey Pastor\ncame to visit us from Buenos Aires and taught us on some of the new developments of mathematics - of which we knew nothing. Our mathematical relation with\nRey Pastor\nwas very fruitful, since we were able to discuss our mathematical problems freely in a one-to-one basis. In this way, our horizons were open to the then new mathematics: general topology, algebra, modern analysis.\nDon Julio\nhad a very complex personality, and occasionally he was very difficult to deal with; but the overall balance of our relationship with him is, undoubtedly, enormously positive for the development of mathematics in Uruguay.\nRey Pastor\nencouraged Cotler to move to Argentina and, in\n1935\n, he moved to Buenos Aires. With a letter of introduction addressed to Juan Carlos Vignaux, he arrived at the School of Sciences. With no formal qualifications he could not register as a student but he was allowed to attend classes. He met\nManuel Sadosky\nwho wrote\n[\n17\n]\n:-\nCora Ratto - then my classmate and later my wife - and I immediately took a liking to the \"Russian peasant,\" who was withdrawn and extremely humble. After a short while, Mischa told Cora that he missed playing the piano very much. Music allowed him to take refuge from the often dismal surrounding reality to enter a world of peace and harmony. Cora immediately invited him to play at her home and, after a long argument, convinced Mischa to accept the offer. Cora's mother delighted in Mischa's playing and always considered it a great personal vindication to have met a talented young man willing to use an instrument she had not succeeded in making important to her own children. Mischa, in his desire not to intrude, sat on the very edge of the piano stool, and we were always worried about the stability of the system and imagined the pianist rolling on the floor! Little by little, Mischa carved his place in Buenos Aires. He earned his living tutoring students and even got a more stable situation teaching in a private academy that prepared candidates to enter the Naval School.\nIn\n1937\nCotlar met Yanny Frenkel, a Ph.D. student of\nRey Pastor\n, who was born in Melitopol, Russia on\n21\nMay\n1909\n. We note here a slight discrepancy since although Yanny gives this date of birth on one of her trips into the United States, on two other trips she gives her age which would correspond to a\n1910\ndate of birth. They were married in\n1938\n.\nCotlar, with no formal qualifications, could not obtain an official teaching position. However he did make contacts with some people who would be significant collaborators.\nBeppo Levi\nwas Jewish and dismissed from his position in Bologna, Italy, after Mussolini brought in the Manifesto of Race in July\n1938\n. He was a friend of\nRey Pastor\nand in October\n1939\nhe emigrated to Argentina to be the director of the recently founded mathematical institute at the Universidad del Litoral in Rosario. Although he was\n64\nyears old at this time, he was able to continue research and administration for a further\n20\nyears and became one of Cotlar's friends and collaborators. They produced three joint papers, the first being published in\n1943\n. Equally important was the fact that Cotlar published nine papers in\nMathematicae Notae\n, a journal founded by\nBeppo Levi\n. The other significant person that Cotlar met was Rodolfo A Ricabarra\n(1925\n-\n1984)\n; they became firm friends and published seven joint papers, the first being published in\n1949\n.\nFor a list of Mischa Cotlar's publications, see\nTHIS LINK\n.\nFor a list of Yanny Frenkel's publications\n(\nnote she published under the name Yanny Frenkel rather than Yanny Cotlar\n)\n, see\nTHIS LINK\n.\nIn\n1945\nCotlar was appointed as a research instructor at the Universidad National de La Plata when the engineer A Martínez Civelli was rector, but six months later a new rector was appointed and Cotlar was quickly dismissed.\nSeveral mathematicians who were based in the United States made visits to Argentina.\nGeorge D Birkhoff\nvisited Buenos Aires in\n1942\nand immediately saw what a talented mathematician Cotlar was and said he would recommend him for a Guggenheim Fellowship. Sadly\nGeorge Birkhoff\ndied in\n1944\nbefore this was completed.\nAntoni Zygmund\n, who was based at the University of Chicago, made his first visit to Argentina in\n1949\non a Fulbright scholarship. He discovered two exceptional students, Mischa Cotlar and\nAlberto Calderón\n, and arranged for\nCalderón\nto study at Chicago for a Ph.D. advised by him.\nGarrett Birkhoff\n,\nGeorge Birkhoff\n's son, came across paper work in his father's papers concerning Cotlar and the Guggenheim Fellowship and he took the application forward. Cotlar was recommended for a Guggenheim Fellowship by\nGarrett Birkhoff\n, which he won in\n1950\n. On\n24\nJanuary\n1951\nMischa and Yanny Cotlar flew from Buenos Aires to New York. They spent six months at Yale University, where Mischa studied ergodic theory with\nShizuo Kakutani\n.\nMarshall Stone\nhad agreed that, despite Cotlar having no formal qualifications, the University of Chicago would accept him onto a Ph.D. course. He went there and was advised by\nAntoni Zygmund\n. Cotlar said\n[\n2\n]\n:-\nIn\n1951\nI did not have any degree but they got me a scholarship to go to Chicago. I wanted to go to classes, especially\nZygmund\n's classes, but he said to me: \"What are you doing here? Go and do your own things.\"\nCotlar may not have had any qualifications, but by\n1950\nhe had already\n27\npublications. He was awarded a doctorate by the University of Chicago in\n1953\nfor his thesis\nOn the theory of Hilbert transforms.\nFollowing this, he and his wife returned to Argentina sailing from New York to Buenos Aires on the ship the Rio Araza, departing on\n28\nMarch\n1953\n. To obtain a position at the University of Buenos Aires he would have been required to sign allegiance to Juan Perón, then President of Argentina, and this he would not do having strong moral principles. There was another possibility\n[\n17\n]\n:-\nBy\n1953\n, thanks to the \"diplomatic\" efforts of that great man, Antonio Monteiro, a Departamento de Investigaciones Científicas\n(\nDIC\n)\n, was created at the Universidad Nacional de Cuyo. And the only requirements to join the DIC were professional! The appointment of Mischa as Director of DIC was a \"bomb\" in our small circle, The job of director or chairman entails bureaucratic chores; it is necessary to deal with files and budgets; but, worst of all, it requires wearing a tie for official ceremonies! Who could imagine Mischa in such a garb? A group of intelligent. enthusiastic, and heterodox people gathered at DIC. They published a journal, the 'Revista Matemática Cuyana', to record the research produced there. Its contents received very favorable comments in the mathematical reviews. The results of the work at DIC fructified Argentine mathematics for years to come, since after it was closed in\n1956\n, again for political reasons, its researchers went on to teach students who are now well-known mathematicians themselves. In fact, when the university situation changed dramatically in\n1956\n, Mischa and his collaborators were asked to join university faculties all over the country.\nWhile at DIC, Cotlar published four important papers in the\nRevista Matemática Cuyana,\nThese are\n[\n35]\n-\n[\n38]\nin the list of his publications we give at\nTHIS LINK\n.\nAfter DIC was closed, Cotlar was appointed Professor of Mathematics at the School of Sciences of the Universidad de Buenos Aires in\n1957\n. He spent nine years in this position during which time he wrote three monographs\n([\n42]\n,\n[\n47]\nand\n[\n52]\nin the list of his publications\n)\n. He also wrote two textbooks, namely\nIntroducción al Algebra\nⓉ\n(\nIntroduction to algebra\n)\nwith\nCora Ratto de Sadosky\n, and\nNociones de Espacios Normados\nⓉ\n(\nNotions of normed spaces\n)\nwith Roberto Cignoli.\nArturo Illia had become President of Argentina following elections in June\n1963\n. He tried to split the Perónists, who controlled the unions, from their exiled leader Perón. The Perónists reacted by supporting a coup against President Arturo Illia in June\n1966\nand General Juan Carlos Onganía, the commander in chief of the army, took control of the country. Following the military takeover, the University of Buenos Aires was attacked by police in August\n1966\n. Cotlar resigned, along with\n400\nother academics, and after a short stay in Montevideo, was appointed to Rutgers University in the United States in\n1967\n. He spent the year\n1969\n-\n70\nat the University of Nice in France at the invitation of\nJean Dieudonné\n. In\n1971\nhe taught at the Universidad Central de Venezuela while still holding a tenured professorship at Rutgers. In the following year Cotlar and his wife Yanny both returned to Argentina. Cotlar was appointed as professor at the Universidad de la Plata, where his friend and colleague Rodolfo Ricabarra also joined the faculty. After a couple of years, the political situation once again made life impossible.\nArgentina was ruled by the military until elections were held in March\n1973\n. Héctor J Cámpora became president and began to work towards having the exiled Juan Perón return. He did so in June\n1973\nwhich caused violent fighting but he became president in October\n1973\n. Opposition increased and the police, paramilitaries and intelligence branches of the administration, began to crack down on political, student, and union leaders. Human rights activists were particularly targeted. Cotlar left and was appointed to the Central University of Venezuela in Caracas. Stefania Marcantognini writes in\n[\n12\n]\nabout Cotlar's seminar at the Central University of Venezuela in Caracas:-\nThe Seminar which has been held until today for almost twenty years, has hosted what we can today call the group of Harmonic Analysis and Theory of Operators of Venezuela, a group of young Venezuelan mathematicians who in various universities of the country seek to develop research activities in those areas. The influence of Mischa is reflected in the attitude and work capacity of this group, which is beginning to be recognized beyond our borders. The Seminar has remained open to mathematicians from other areas who find a platform to discuss their ideas and find in Mischa a mathematician of extraordinary qualities and a man of friendly character. Mischa is, undoubtedly, the mathematician with the longest and most prestigious career among those who have worked permanently in Venezuela, and those of us who have the privilege of knowing him, we also know that he adds to his quality as a scientist a deeply modest and sincere personality.\nCora Sadosky\nwrites\n[\n20\n]\n:-\nIn Caracas, Mischa and I began to collaborate in earnest and together we established an ambitious research program. Mathematically, our Caracas exile was extraordinarily productive. Although Mischa was part of the\nZygmund\nschool, he had an astonishing intellectual affinity with the Ukrainian school of Mathematics lead by Professors\nKrein\nand\nGohberg\n, the leaders of the extraordinarily original and fertile school of operator theory. In spite of my analytic upbringing, I could not resist Mischa's daring approaches to operator theory. In\n1980\nDaniel, Cora Sol and I moved to the U.S., and Mischa remained in Venezuela. He loved Caracas - the climate, the mountains, the flowers, and the Venezuelans. Mischa and Yanny came to visit us every year, in Washington, DC, Princeton, and Berkeley - and for many years I spent several weeks in Caracas. Thus our mathematical collaboration was not interrupted. When Mischa and Yanny decided to return to Buenos Aires, Mischa still kept sending me scores of hand-written manuscripts with new ideas that we needed to develop.\nCotlar was elected to the National Academy of Exact Sciences of Argentina in\n1988\n.\nAlberto Calderón\ngave a speech introducing Cotlar to the Academy. You can read the speech at\nTHIS LINK\n.\nWe would like to quote here\nCalderón\n's description to Cotlar's mathematical contributions\n[\n5\n]\n:-\nCotlar's mathematical work has very singular characteristics. One is its insights, bringing to light the deep roots and motivations of theories and theorems. The other is the vision that uncovers links and unsuspected relations between subjects that apparently have no connection at all. It is for these characteristics, I believe, that his works have a very definite taste of philosophical essays. Examples of this are the four consecutive papers that appeared in the 'Revista Matemática Cuyana, volume\n1\n(1955)\n, Fasciculo\n2\n'. In one of them, the result now known as Cotlar's Lemma shows the reason why, independently from\nFourier\nTheory, the\nHilbert\nTransform is bounded in\nL\n2\nL^{2}\nL\n2\n. In another of those papers, he gives the unified treatment of the\nHilbert\nTransform and the Ergodic Theorem, which is known as the Principle of Transference in modern ergodic theory. Finally, I want to call attention to the fact that some of Cotlar's results, published in journals of little accessibility and slow distribution, have been named after other mathematicians who discovered them independently but years after him. One such example is the theorem of representation of s-Boolean algebras as a s-algebra of sets modulo an ideal of \"null\" sets, which today is known as the Loomis-\nSikorski\ntheorem.\nWe have mentioned Cotlar's modest personality several times but let us here quote the authors of\n[\n10\n]\nwho write:-\nMischa is extremely modest and very dear to all those who are lucky enough to know him. As can be seen in the list of his publications, many of them are in collaboration with other mathematicians, one more indication of his friendly nature and his spirit of collaboration and also of the purely scientific interest that motivates him in his work.\nThroughout his life Cotlar argued passionately for peace in the world and tried to encourage other scientists to join in his mission for peace. Towards the end of his life the cold war had essentially ended but this did not bring about the changes he wished in the world. He said\n[\n2\n]\n:-\nThere are still scientists working for destruction, to increase the killing power of the powerful. If the scientists and technicians refused to develop the weapons that are more deadly and precise every day, the world would be very different and we would not have what we see today, where so many innocents die who have nothing to do with the conflict while those responsible are safe.\nFor more on this the reader can see an English translation of Mischa Cotlar's\n2006\nMaster Class on this topic at\nTHIS LINK\n.\nWe also present an English translation of Carlos Borches'\n2001\ninterview with Cotlar at\nTHIS LINK\n.\nAn English translation of Mischa Cotlar's 'La Nación' obituary is available at\nTHIS LINK\n.\nLet us end with this quote from\nCora Sadosky\n[\n20\n]\n:-\nMischa was never trapped into the brainless anti-Americanism of the times, and was never a \"travel companion\" of the Communists. He was deeply committed to a just peace in Israel/Palestine, and always defended Israel's right to exist. He also rejected the anti-Semitism barely hidden in many of the contemporary \"progressive\" agendas. However, along with many other pacifists, Mischa could not find a practical way to reconcile his absolute philosophical conviction about the wrongness of killing with the realities of war and peace. Mischa settled in Buenos Aires when Yanny's mental health deteriorated. He himself was also gravely sick, but he took loving care of Yanny until his death. In spite of his growing physical weakness, Mischa still tried to mobilize the international mathematical community for the creation of a new movement for the ethical responsibility of scientists. Unfortunately, this last appeal did not elicit a meaningful response. Mischa was an extraordinary person. He was endowed with many talents and the people around him were changed by his touch. All of the many friends that he met in his different endeavours will remember him with love and respect.",
  "matematicos_citados_na_biografia": [
    "Lasker",
    "Rafael Laguardia",
    "Laguardia",
    "Émile Picard",
    "José Luis Massera",
    "Dmitry Grave",
    "Julio Rey Pastor",
    "\"Don\" Julio Rey Pastor",
    "Rey Pastor",
    "Don Julio",
    "Manuel Sadosky",
    "Beppo Levi",
    "THIS LINK",
    "George D Birkhoff",
    "George Birkhoff",
    "Antoni Zygmund",
    "Alberto Calderón",
    "Calderón",
    "Garrett Birkhoff",
    "Shizuo Kakutani",
    "Marshall Stone",
    "Zygmund",
    "Cora Ratto de Sadosky",
    "Jean Dieudonné",
    "Cora Sadosky",
    "Krein",
    "Gohberg",
    "Fourier",
    "Hilbert",
    "Sikorski"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}