{
  "nome_completo": "Mollie Orshansky",
  "nome_curto": "Mollie Orshansky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Orshansky/",
  "data_nascimento": "9 January 1915",
  "local_nascimento": "Bronx, New York City, USA",
  "data_morte": "18 December 2006",
  "local_morte": "Manhattan, New York City, USA",
  "summary": "Mollie Orshansky was an American economist and statistician who developed the Orshansky Poverty Thresholds, used for measuring household incomes.",
  "biografia": "Mollie Orshansky\n's parents, Samuel and Fannie Orshansky, lived in  Ukraine but poverty had encouraged them to seek a better life and they had emigrated to the United States, settling in the Bronx. Samuel Orshansky was a plumber and ironworker, but was often unemployed; he and his wife spoke only a little English. The family were Jewish and Mollie was the third of her parents' six daughters. The six girls shared three beds and often had to depend of charity to provide their food. Despite this, Mollie was admitted to Hunter College High School which was set up to educated gifted girls. After graduating from Hunter College High School, Mollie entered Hunter College in\n1931\nwhere she majored in mathematics and statistics. She graduated with an A.B. in\n1935\nand then undertook graduate studies at the American University in Washington D.C. where she also studied economics and statistics at the Department of Agriculture Graduate School.\nIn\n1939\nOrshansky was appointed as a Research Clerk with the U.S. Children's Bureau. There she worked on topics that meant a lot to her given the poverty of her own childhood, namely biometric studies of child health, growth, and nutrition. In\n1942\nshe was employed as a statistician in the New York City Department of Health where she worked on devising an important survey into pneumonia, collecting data both on its incidence and treatment. She moved to the U.S. Department of Agriculture in\n1945\nwhere she spent thirteen years as a statistician in the Bureau of Human Nutrition and Home Economics involved in collecting and analysing data on family expenditure of various kinds, particularly looking at expenditure on food relative to family income. She prepared a plan to provide adequate nutrition for poor families at a price they could afford\n[\n1\n]\n:-\nIn painstaking detail, the food plans laid out the amount of meat, bread, potatoes, and other staples that families needed in order to eat healthily. These were \"by no means subsistence diets,\" Orshansky later wrote. \"But they do assume that the housewife will be a careful shopper, a skilful cook, and a good manager who will prepare all the family's meals at home.\"\nOrshansky moved to the Social Security Administration in\n1958\n. There she was employed as a Social Science Research Analyst in the Office of Research and Statistics. In an article Children of the Poor published in the\nSocial Security Bulletin\nof\n1963\nshe wrote:-\nCreature comforts once the hallmark of luxury have descended to the realm of the commonplace, and the marvels of modern industry find their way into the home of the American worker as well as that of his boss. Yet there is an underlying disquietude reflected in our current social literature, an uncomfortable realization that an expanding economy has not brought gains to all in equal measure. It is reflected in the preoccupation with counting the poor - do they number\n30\nmillion,\n40\nmillion, or\n50\nmillion?\nIt was at this time she did the work for which she is best known, in particular devising in\n1963\nthe Orshansky index, which is the official measure of poverty used by the U.S. government. Fisher writes\n[\n3\n]\n(\nsee also\n[\n4\n]\n)\n:-\nThe poverty thresholds were originally developed in\n1963\n-\n1964\nby Mollie Orshansky of the Social Security Administration.  She published an analysis of the poverty population using these thresholds in a January\n1965\nSocial Security Bulletin article.  Orshansky based her poverty thresholds on the economy food plan - the cheapest of four food plans developed by the Department of Agriculture.  The actual combinations of foods in the food plans, devised by Agriculture Department dietitians using complex procedures, constituted nutritionally adequate diets; the Agriculture Department described the economy food plan as being \"designed for temporary or emergency use when funds are low.\"\n(\nOrshansky also developed a second set of poverty thresholds based on the Agriculture Department's somewhat less stringent low-cost food plan, but relatively little use was ever made of these higher thresholds.\n)\nOf course politics usually distorts well-intentioned research and there are a number of misconceptions about Orshansky's thresholds. First she made very clear that it was a threshold to measure inadequate incomes, not adequate ones. She wrote:-\n... if it is not possible to state unequivocally 'how much is enough,' it should be possible to assert with confidence how much, on an average, is too little.\nThe other point to note is, as stated by Michael B Katz in\nThe Undeserving Poor\n(\nsee for example\n[\n2\n]\n)\n:-\nOrshansky developed the index as a research tool, not an instrument of policy of a criterion for determining eligibility for anti-poverty programs.\nOver the following years until her retirement in\n1982\n, Orshansky continued to apply statistics to measures of poverty. For example she wrote\nChildren of the Poor\n(1963)\n,\nCounting the Poor:  Another Look at the Poverty Profile\n(1965)\n,\nWho's Who Among the Poor:  A Demographic View of Poverty\n(1965)\n,\nHow poverty is measured\n(1969)\n,\nHistory of the Poverty Line\n(1970)\n, and was a joint author of\nMeasuring Poverty: A Debate\n(1978)\nand\nImproving the Poverty Definition\n(1979)\n. In\n1976\nshe received the Distinguished Service Award in recognition of her work in this area.\nIn\n1999\nshe summed up the motives behind her statistical work in an interview published in the\nDallas Morning News:-\nPoor people are everywhere; yet they are invisible. I wanted them to be seen clearly by those who make decisions about their lives.\nOrshansky never married\n[\n2\n]\n:-\nFor most of her career, she lived in an apartment on the waterfront in Washington. She travelled extensively and loved to cook.\nIt is sad that during her last few years a legal dispute arose over her care\n[\n2\n]\n:-\nIn\n2002\n, The Washington Post reported on a legal struggle over Miss Orshansky's care, which had begun after she was hospitalized in the fall of\n2001\n. A niece, Jane M Pollack, had taken Miss Orshansky to New York, but a judge in Washington, who had named a legal guardian for Miss Orshansky, tried to compel her to return to Washington, arguing that her family had not demonstrated that they could adequately care for her. On August\n15\n,\n2002\n, the District of Columbia Court of Appeals ruled that the judge had abused her authority and ignored Miss Orshansky's wishes to live with her family in New York. The appeals court also cancelled the appointment of the guardian.\nShe died of cardiopulmonary arrest at her home in Manhattan and was buried at Mount Lebanon Cemetery in Glendale, Queens.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "0rshansky.jpg"
  ]
}