{
  "nome_completo": "Nasir al-Din al-Tusi",
  "nome_curto": "Nasir al-Din al-Tusi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Tusi_Nasir/",
  "data_nascimento": "18 February 1201",
  "local_nascimento": "Tus, Khorasan (now Iran)",
  "data_morte": "26 June 1274",
  "local_morte": "Kadhimain (near Baghdad now in Iraq)",
  "summary": "Nasir al-Tusi was an Islamic astronomer and mathematician who joined the Mongols who conquered Baghdad. He made important contributions to astronomy and wrote many commentaries on Greek texts.",
  "biografia": "Although usually known as\nNasir al-Din al-Tusi\n, his proper name was Muhammad ibn Muhammad ibn al-Hasan al-Tusi. In fact al-Tusi was known by a number of different names during his lifetime such as Muhaqqiq-i Tusi, Khwaja-yi Tusi and Khwaja Nasir.\nAl-Tusi was born in Tus, which lies close to Meshed in northeastern Iran high up in the valley of the Kashaf River. He was born at the beginning of a century which would see conquests across the whole of the Islamic world from close to China in the east to Europe in the west. It was the era when the vast military power of the Mongols would sweep across the vast areas of the Islamic world displaying a bitter animosity towards Islam and cruelly massacring people. This was a period in which there would be little peace and tranquillity for great scholars to pursue their works, and al-Tusi was inevitably drawn into the conflict engulfing his country.\nIn Tus, al-Tusi's father was a jurist in the Twelfth Imam School. The Twelfth Imam was the main sect of Shi'ite Muslims and the school where al-Tusi was educated was mainly a religious establishment. However, while studying in Tus, al-Tusi was taught other topics by his uncle which would have an important influence on his intellectual development. These topics included logic, physics and\nmetaphysics\nwhile he also studied with other teachers learning mathematics, in particular algebra and geometry.\nIn\n1214\n, when al-Tusi was\n13\nyears old, Genghis Khan, who was the leader of the Mongols, turned away from his conquests in China and began his rapid advance towards the west. It would not be too long before al-Tusi would see the effects of these conquests on his own regions, but before that happened he was able to study more advanced topics. From Tus, al-Tusi went to Nishapur which is\n75\nkm west of Tus. Nishapur was a good choice for al-Tusi to complete his education since it was an important centre of learning. There al-Tusi studied philosophy, medicine and mathematics. In particular he was taught mathematics by Kamal al-Din ibn Yunus, who himself had been a pupil of\nSharaf al-Din al-Tusi\n. While in Nishapur al-Tusi began to acquire a reputation as an outstanding scholar and became well known throughout the area.\nThe Mongol invasion reached the area of Tus around\n1220\nand there was much destruction. Genghis Khan turned his attention again towards the east leaving his generals and sons in the west to continue his conquests. There was, amid the frequent fighting in the region, peaceful havens which attracted al-Tusi. The Assassins, who practised an intellectual form of extremist Shi'ism, controlled the castle of Alamut in the Elburz Mountains, and other similar impregnable forts in the mountains. When invited by the Isma'ili ruler Nasir ad-Din 'Abd ar-Rahim to join the service of the Assassins, al-Tusi accepted and became a highly regarded member of the Isma'ili Court. Whether he would have been able to leave, had he wished to, is not entirely clear. However, al-Tusi did some of his best work while moving round the different strongholds, and during this period he wrote important works on logic, philosophy, mathematics and astronomy. The first of these works,\nAkhlaq-i nasiri\n, was written in\n1232\n. It was a work on\nethics\nwhich al-Tusi dedicated to the Isma'ili ruler Nasir ad-Din 'Abd ar-Rahim.\nIn\n1256\nal-Tusi was in the castle of Alamut when it was attacked by the forces of the Mongol leader Hulegu, a grandson of Genghis Khan, who was at that time set on extending Mongol power in Islamic areas. Some claim that al-Tusi betrayed the defences of Alamut to the invading Mongols. Certainly Hulegu's forces destroyed Alamut and, Hulegu himself being himself interested in science, he treated al-Tusi with great respect. It may be that indeed al-Tusi felt that he was being held in Alamut against his will, for certainly he seemed enthusiastic in joining the victorious Mongols who appointed him as their scientific advisor. He was also put in charge of religious affairs and was with the Mongol forces under Hulegu when they attacked Baghdad in\n1258\n.\nAl-Musta'sim, the last Abbasid caliph in Baghdad, was a weak leader and he proved no match for Hulegu's Mongol forces when they attacked Baghdad. After having laid siege to the city, the Mongols entered it in February\n1258\nand al-Musta'sim together with\n300\nof his officials were murdered. Hulegu had little sympathy with a city after his armies had won a battle, so he burned and plundered the city and killed many of its inhabitants. Certainly al-Tusi had made the right move as far as his own safety was concerned, and he would also profit scientifically by his change of allegiance.\nHulegu was very pleased with his conquest of Baghdad and also pleased that such an eminent scholar as al-Tusi had joined him. So, when al-Tusi presented Hulegu with plans for the construction of a fine Observatory, Hulegu was happy to agree. Hulegu had made Maragheh his capital . Maragheh was in the Azerbaijan region of northwestern Iran, and it was at Maragheh that the Observatory was to be built. Construction of the Observatory began in\n1259\nwest of Maragheh, and traces of it can still be seen there today.\nThe observatory at Maragheh became operational in\n1262\n. Interestingly the Persians were assisted by Chinese astronomers in the construction and operation of the observatory. It had various instruments such as a\n4\nmetre wall quadrant made from copper and an\nazimuth\nquadrant which was the invention of Al-Tusi himself. Al-Tusi also designed other instruments for the Observatory which was far more than a centre for astronomy. It possessed a fine library with books on a wide range of scientific topics, while work on science, mathematics and philosophy were vigorously pursued there.\nAl-Tusi put his Observatory to good use, making very accurate tables of planetary movements. He published\nZij-i ilkhani\n(\nthe Ilkhanic Tables\n)\n, written first in Persian and later translated into Arabic, after making observations for\n12\nyears. This work contains tables for computing the positions of the planets, and it also contains a star catalogue. This was not the only important work which al-Tusi produced in astronomy. It is fair to say that al-Tusi made the most significant development of\nPtolemy\n's model of the planetary system up to the development of the\nheliocentric model\nin the time of\nCopernicus\n. In al-Tusi's major astronomical treatise,\nal-Tadhkira fi'ilm al-hay'a\n(\nMemoir on astronomy\n)\nhe\n[\n17\n]\n:-\n... devised a new model of lunar motion, essentially different from\nPtolemy\n's. Abolishing the eccentric and the centre of prosneusis, he founded it exclusively on the principle of eight uniformly rotating spheres and thereby succeeded in representing the irregularities of lunar motion with the same exactness as the \"Almagest\"\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. His claim that the maximum difference in longitude between the two theories amounts to\n10\nproves perfectly true. In his model Nasir, for the first time in the history of astronomy, employed a theorem invented by himself which,\n250\nyears later, occurred again in\nCopernicus\n, \"De Revolutionibus\", III\n4\n.\nThe theorem referred to in this quotation concerns the famous \"Tusi-couple\" which resolves linear motion into the sum of two circular motions. The aim of al-Tusi with this result was to remove all parts of\nPtolemy\n's system that were not based on the principle of uniform circular motion. Many historians claim that the Tusi-couple result was used by\nCopernicus\nafter he discovered it in Al-Tusi's work, but not all agree; see for example\n[\n38\n]\nwhere it is claimed that\nCopernicus\ntook the result from\nProclus\n's\nCommentary on the first book of Euclid\nand not from al-Tusi.\nAmong numerous other contributions to astronomy, al-Tusi calculated the value of\n51\n' for the\nprecession of the equinoxes\n. He also wrote works on astronomical instruments, for example on constructing and using an\nastrolabe\n.\nIn logic al-Tusi followed the teachings of\nibn Sina\n. He wrote five works on the subject, the most important of which is one on inference. In\n[\n33\n]\nStreet describes this as follows:-\nTusi, a thirteenth century logician writing in Arabic, uses two logical connectives to build up molecular propositions: 'if-then', and 'either-or'. By referring to a dichotomous tree, Tusi shows how to choose the proper disjunction relative to the terms in the disjuncts. He also discusses the disjunctive propositions which follow from a conditional proposition.\nAl-Tusi wrote many commentaries on Greek texts. These included revised Arabic versions of works by\nAutolycus\n,\nAristarchus\n,\nEuclid\n,\nApollonius\n,\nArchimedes\n,\nHypsicles\n,\nTheodosius\n,\nMenelaus\nand\nPtolemy\n. In particular he wrote a commentary on\nMenelaus\n's\nSpherics\n(\nsee\n[\n41\n]\nfor details\n)\n, and\nArchimedes\n'\nOn the sphere and cylinder\n(\nsee\n[\n21\n]\nfor details\n)\n. In the latter work al-Tusi discussed objections raised by earlier mathematicians to comparing lengths of straight lines and of curved lines. Al-Tusi argues that comparisons are legitimate, despite the objections that, being different entities, they are incomparable.\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nwas one of the works which Arabic scientists studied intently. In\n1247\nal-Tusi wrote\nTahrir al-Majisti\n(\nCommentary on the Almagest\n)\nin which he introduced various trigonometrical techniques to calculate tables of sines; see\n[\n5\n]\nfor details. As in the\nZij-i Ilkhahi\nal-Tusi gave tables of sines with entries calculated to three\nsexagesimal\nplaces for each half degree of the argument.\nOne of al-Tusi's most important mathematical contributions was the creation of trigonometry as a mathematical discipline in its own right rather than as just a tool for astronomical applications. In\nTreatise on the quadrilateral\nal-Tusi gave the first extant exposition of the whole system of plane and spherical trigonometry. As stated in\n[\n1\n]\n:-\nThis work is really the first in history on trigonometry as an independent branch of pure mathematics and the first in which all six cases for a right-angled spherical triangle are set forth.\nThis work also contains the famous sine formula for plane triangles:\na\nsin\n⁡\nA\n=\nb\nsin\n⁡\nB\n=\nc\nsin\n⁡\nC\n\\Large\\frac a {\\sin A}\\normalsize = \\Large\\frac b {\\sin B}\\normalsize = \\Large\\frac c {\\sin C}\ns\ni\nn\nA\na\n​\n=\ns\ni\nn\nB\nb\n​\n=\ns\ni\nn\nC\nc\n​\n.\nAnother mathematical contribution was al-Tusi's manuscript, dated\n1265\n, concerning the calculation of\nn\nn\nn\n-th roots of an integer; see\n[\n6\n]\nfor details of a copy of this manuscript made in\n1413\n. This work by al-Tusi is almost certainly not original but rather it is his version of methods developed by\nal-Karaji\n's school. In the manuscript al-Tusi determined the coefficients of the\nexpansion of a binomial\nto any power giving the binomial formula and the\nPascal triangle\nrelations between\nbinomial coefficients\n.\nWe should mention briefly other fields in which al-Tusi contributed. He wrote a famous work on minerals which contains an interesting theory of colour based on mixtures of black and white, and included chapters on jewels and perfumes. He also wrote on medicine, but his medical works are among his least important. Much more important were al-Tusi's contributions to philosophy and ethics. In particular in philosophy he asked important questions on the nature of space.\nAl-Tusi had a number of pupils, one of the better known being Nizam al-a'Raj who also wrote a commentary on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. Another of his pupils Qutb ad-Din ash-Shirazi gave the first satisfactory mathematical explanation of the rainbow. Al-Tusi's influence, which continued through these pupils, is summed up in\n[\n1\n]\nas follows:-\nAl-Tusi's influence, especially in eastern Islam, was immense. Probably, if we take all fields into account, he was more responsible for the revival of the Islamic sciences than any other individual. His bringing together so many competent scholars and scientists at Maragheh resulted not only in the revival of mathematics and astronomy but also in the renewal of Islamic philosophy and even theology.",
  "matematicos_citados_na_biografia": [
    "metaphysics",
    "Sharaf al-Din al-Tusi",
    "ethics",
    "azimuth",
    "Ptolemy",
    "heliocentric model",
    "Copernicus",
    "Proclus",
    "precession of the equinoxes",
    "astrolabe",
    "ibn Sina",
    "Autolycus",
    "Aristarchus",
    "Euclid",
    "Apollonius",
    "Archimedes",
    "Hypsicles",
    "Theodosius",
    "Menelaus",
    "sexagesimal",
    "al-Karaji",
    "expansion of a binomial",
    "Pascal triangle",
    "binomial coefficients"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}