{
  "nome_completo": "Nathan Jacob Fine",
  "nome_curto": "Nathan Fine",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fine_Nathan/",
  "data_nascimento": "22 October 1916",
  "local_nascimento": "Philadelphia, USA",
  "data_morte": "18 November 1994",
  "local_morte": "Deerfield Beach, Florida, USA",
  "summary": "Nathan Fine was an American mathematician who worked on the hypergeometric series.",
  "biografia": "Nathan Fine\nwas known to his friends as Nat. He attended Temple University from where he was awarded a B.S. in\n1936\n. He then moved to the University of Pennsylvania to study for his Master's degree which was awarded in\n1939\n. Following this, he became a school teacher and taught at a junior high school from\n1941\nto\n1942\n. His first university appointment came when he was appointed as Instructor in Mathematics at Cornell University for\n1942\n, and his next was to the same position at Purdue University from\n1942\nto\n1945\n. Of course these last positions were held during World War II and, while he held these posts, Fine undertook war work as a research mathematician at the Naval Ordnance Plant in Indianapolis during\n1944\n-\n1945\n, and then he worked for the Operations Evaluations Group in Washington, D.C. during\n1946\n-\n1947\n.\nHe undertook research at the University of Pennsylvania for a Ph.D. under the supervision of\nAntoni Zygmund\nand he obtained his doctorate in\n1946\nfor his thesis\nOn the Walsh Functions\n.\nZygmund\n, who had escaped with his wife and son from German controlled Poland to the USA in\n1940\n, held a number of posts before he finally settled in Chicago. He was only at the University of Pennsylvania for a short while and Fine was lucky to have his doctoral studies supervised by such an outstanding mathematician. Fine was appointed to the position of Assistant Professor of Mathematics at the University of Pennsylvania in\n1947\nand in\n1956\nhe was promoted to full professor. In\n1963\nhe moved from the University of Pennsylvania to Pennsylvania State University, where he remained until his retirement in\n1978\n.\nFine held a number of fellowships such as an NSF Postdoctoral Fellowship in\n1953\n-\n54\nand a Guggenheim Foundation Fellowships presented by the John Simon Guggenheim Memorial Foundation of New York City in\n1958\n. The\nMathematical Association of America\nhad established The\nEarle Raymond Hedrick\nLectures are named after the first president of the Association. The lecturer needed to be of known skill as an expositor of mathematics and be someone:-\n... who will present a series of at most three lectures accessible to a large fraction of those who teach college mathematics.\nFine was honoured by being made Earle Raymond\nHedrick\nLecturer in\n1966\n.\nAs a mathematician Fine had wide interests publishing on many different topics including number theory, logic, combinatorics, group theory, linear algebra, partitions and functional and classical analysis. He is perhaps best known for his book\nBasic hypergeometric series and applications\npublished in the Mathematical Surveys and Monographs Series of the\nAmerican Mathematical Society\n. The material which he presented in the\nEarle Raymond Hedrick\nLectures twenty years earlier form the basis for the material in this text. Andrews has written an Introduction to the book in which he explains something of his own experiences of taking courses by Fine:-\nIn\n1948\n, Nathan Fine published a note in the Proceedings of the National Academy of Sciences announcing several elegant and intriguing partition theorems. These results were marked both by their simplicity of statement and by the depth of their proof. Fine was at that time engaged in his own special development of q-\nhypergeometric series\n, and as the years passed he kept adding to his results and polishing his presentation. Several times, both at Penn and Penn State, he presented courses on this material. I took the course twice, first in\n1962\n-\n1963\nat Penn and then in\n1968\n-\n1969\nat Penn State. As a graduate student at Penn, I wrote my thesis on mock theta functions under\nRademacher\n's direction. The material that Fine was lecturing about fit in perfectly with my thesis work and introduced me to many aspects of this extensive subject. The course was truly inspiring. As I look back at it, it is hard for me to decide whether the course material or Fine's exquisite presentation of it impressed me most.\nAndrews writes more about Fine's lecturing style in\n[\n1\n]\n:-\nMy fellow students and I viewed him as a mathematical juggernaut. He spoke deliberately and somewhat slowly\n(\nthank goodness\n)\n. He smoked unfiltered Camel cigarettes which he Persian-inhaled throughout each lecture. I look back fondly on Nat, his beautiful mathematics, and his ever-present cigarettes. In each lecture, he was clearly having a whale of a good time, and so were we.\nWe became somewhat diverted while looking at Fine's text\nBasic hypergeometric series and applications\nwhen we began to look at Andrews' Introduction. Returning to the book itself, we quote from a review by David M Bressoud of the\n124\npage book:-\nFor far too long, there has been a dearth of good references on basic hypergeometric series. The present book and Basic hypergeometric series by G Gasper and M Rahman have appeared in the past two years to greatly rectify this situation. It is a measure of the breadth of this field that after the respective first chapters there is virtually no overlap between these books.\nFine writes from the viewpoint of a number theorist, and his slim volume is rich with examples and results from the theory of partitions, the study of\nRamanujan\n's mock theta functions, and modular equations. This is a very personal book, a distillation of those results in basic hypergeometric series which hold the most appeal to its author.\nMany of Fine's papers were written jointly with other leading mathematicians. To quote just two examples, there is\nThe probability that a matrix be nilpotent\nwritten jointly with\nHerstein\nand published in the\nIllinois Journal of Mathematics\nin\n1958\n, and\nPairs of commuting matrices over a finite field\nwritten jointly with\nWalter Feit\nand published in the\nDuke Mathematical Journal\nin\n1960\n. Fine was also interested in problem solving and contributed both problems and solutions to problems to several different journals. Coming out of this interest is, for example, his paper\nOn rational triangles\nin the\nAmerican Mathematical Monthly\nin\n1976\n. A rational triangle is one with both rational sides and rational area. In this article Fine proved that here exist rational numbers\na\na\na\nand\nb\nb\nb\nthat are never sides of a rational triangle, and also there exists a rational triangle of any given rational area.\nAs to his interests, Andrews writes\n[\n1\n]\n:-\nIn addition to mathematics, he enjoyed a variety of games, including GO, chess, bridge, billiards, and backgammon. He was a life master at bridge and played duplicate bridge until two days before he died.\nLet us end this brief biography by quoting a couplet Fine composed in honour of\nErdős\n:-\nChebychev said it, and I'll say it again,\nThere's always a prime between\nN\nN\nN\nand\n2\nN\n2N\n2\nN\n.",
  "matematicos_citados_na_biografia": [
    "Antoni Zygmund",
    "Zygmund",
    "Mathematical Association of America",
    "Earle Raymond Hedrick",
    "Hedrick",
    "American Mathematical Society",
    "hypergeometric series",
    "Rademacher",
    "Ramanujan",
    "Herstein",
    "Walter Feit",
    "Erdős"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}