{
  "nome_completo": "Nathaniel Bowditch",
  "nome_curto": "Nathaniel Bowditch",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bowditch/",
  "data_nascimento": "26 March 1773",
  "local_nascimento": "Salem, Massachusetts, USA",
  "data_morte": "16 March 1838",
  "local_morte": "Boston, USA",
  "summary": "Nathaniel Bowditch was an American mathematician who published works on navigation and astronomy.",
  "biografia": "Nathaniel Bowditch\n's father was Habakkuk Bowditch who was a cooper, that is a maker and repairer of wooden casks. His mother was Mary Ingersoll. Although Nathaniel was born in Salem, Massachusetts, his family moved to Danvers, also in Massachusetts, while he was still a baby. After a few years, when Nathaniel was seven years old, they returned to Salem. As Albree writes in\n[\n8\n]\n:-\nThe first\n50\nyears of Bowditch's life revolved around Salem, Massachusetts, a compact seafaring town along the picturesque north shore,\n16\nmiles north of Boston.\nThis was a hard time for the Bowditch family. Habakkuk Bowditch's business collapsed and the family hit really hard times financially. Although Nathaniel went to school until he was ten years old, his formal education had to end at that point and he began working in his father's cooperage shop. After two years of helping his father, Nathaniel became an apprentice clerk in the ship's chandler shop of Hodges and Ropes in Salem in\n1785\n. This shop dealt in provisions and supplies for ships. In\n1790\nBowditch, aged seventeen by this time, changed his employers and began working for the shop of Samuel C Ward.\nAlthough Bowditch was working as a clerk, he was educating himself throughout this period. Reingold writes in\n[\n1\n]\n:-\n... he acquired skill in languages and considerable knowledge of mathematics and other sciences through reading and study. Bowditch's scientific career was largely one of self-education; the United States of his day afforded very little opportunity for research in astronomy and mathematical physics.\nThere was one way in which Bowditch was lucky. Richard Kirwan\n(1733\n-\n1812)\nwas an Irish chemist who made contributions in several areas of science. Kirwan was elected to the\nRoyal Society of London\nin\n1780\nand helped found the Royal Irish Society some years later. A privateer from Salem, that is a sailor licensed to attack enemy shipping, had intercepted a ship carrying Kirwan's library between Ireland and England and having captured it brought Kirwan's library back to Salem where it was available and used by Bowditch from June\n1791\n. Bowditch had begun to learn algebra in\n1787\nand two years later he began to study the differential and integral calculus. He learnt calculus so that he might study\nNewton\n's\nPrincipia\nand in\n1790\nhe learnt Latin which was also necessary to enable him to read\nNewton\n's famous work. Later Bowditch learnt other languages in order to study mathematics in these languages; in particular he learnt French in\n1792\n.\nBetween\n1795\nand\n1799\nBowditch made four sea voyages on merchant ships, and in\n1802\nhe was in command of a merchant ship of which he was also a joint owner. Four of these voyages were to the East Indies while he made one voyage to Europe. The fourth journey was to Philippines while his last voyage was to Sumatra. This was not a period when Bowditch put his studies to one side, on the contrary there was much time at sea for him to carry on his studies and he perfected his French at this time. On his voyage of\n1802\n-\n03\nhe read the first volume of\nLaplace\n's\nTraité de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\nwhich had been published in\n1798\n. By June\n1806\nBowditch had read the first four of\nLaplace\n's five volumes\n(\nthe fifth volume was not published by\nLaplace\nuntil\n1825)\n.\nIn March\n1798\nwhile Bowditch was back in Salem between voyages, he married Elizabeth Boardman but sadly she died seven months after the wedding. In\n1800\n, before he made his last voyage, Bowditch married for the second time. His second marriage was to Mary Ingersoll who was a cousin and together they had eight children.\nBowditch was now coming up in the world and he gave up his career as a sailor in\n1804\nto move into the business world. In that year he became president of the Essex Fire and Marine Insurance Company in Salem and under his leadership the Company prospered despite difficult conditions due to the war of\n1812\nand other political problems. During the years of his presidency of this Company Bowditch undertook mathematical and astronomical investigations which gave him a high reputation in the academic world.\nHis\nNew American Practical Navigator\n(1802)\nbegan as a project to correct and extend the work of John Hamilton Moore. In fact he published the first American edition of Moore's\nPractical Navigator\nin\n1799\n, having collaborated with his brother on making corrections to Moore's work. In fact Bowditch loved to carry out complex mathematical computations and the task of checking and correcting Moore's work was one he greatly enjoyed. He published a second edition in\n1800\n, but by the time he came to publish a third edition he had changed Moore's book in such a major way that it was now sensible to publish the work under his own name which accounts for his\n1802\npublication.\nBowditch had already received high recognition for his academic contributions, including election to the\nAmerican Academy of Arts and Sciences\nin\n1799\n. He was offered the chair of mathematics and physics at Harvard in\n1806\nbut he turned it down. In\n1804\nhe had published an article on observations of the moon, and in\n1806\nhe published naval charts of the harbour at Salem and several other harbours. More scientific publications followed such as one on a meteor explosion in\n1807\n, three papers on orbits of comets\n(1815\n,\n1818\n,\n1820)\n, and in\n1815\nhe studied\nLissajous\nfigures while studying the motion of a pendulum suspended from two points.\nHarvard University was not the only one to offer Bowditch a chair. He was also offered one by West Point and, in\n1818\n, he was offered the chair at the University of Virginia. However, Bowditch had a salary from the Essex Fire and Marine Insurance Company which was\n50\n% higher than the $\n2\n,\n000\nwhich Virginia offered him. Bowditch refused all the chairs of mathematics he was offered.\nBowditch's translation of the first four volumes of\nLaplace\n's\nTraité de mécanique céleste\nⓉ\n(\nTreatise on celestial mechanics\n)\nwas completed by\n1818\nbut he would not publish it for many years. Almost certainly the cost of publication caused the delay, but Bowditch did not just put the work on one side after\n1818\nbut continued to improve it over the succeeding years. Bowditch was helped by\nBenjamin Peirce\nin this project and his commentaries doubled the length of the book. His purpose was more than just an English translation. He wanted\n[\n1\n]\n:-\n... to supply steps omitted in the original text; to incorporate later results into the translation; and to give credits omitted by\nLaplace\n.\nBy this time Bowditch had a high international reputation for he had published articles in British and Continental journals as well as in American ones. We have already noted his election to the\nAmerican Academy of Arts and Sciences\nin\n1799\n. He was elected to the American Philosophical Society in\n1809\n, the\nRoyal Society of Edinburgh\nand the\nRoyal Society of London\nboth in\n1818\n, and the\nRoyal Irish Academy\nin\n1819\n.\nIn\n1823\nBowditch left the Essex Fire and Marine Insurance Company in Salem and became an actuary in the Massachusetts Hospital Life Insurance Company. Albree writes in\n[\n8\n]\n:-\nWhen Bowditch moved from Salem to Boston in\n1823\n, he moved\n2\n,\n500\nbooks, more than\n100\nmaps and charts, and\n29\nvolumes of his own manuscripts. As president of the Massachusetts Hospital Life Insurance Company, he enjoyed enough material success so that he could afford the $\n12\n,\n000\nit cost to have his translation of\nLaplace\npublished\n(1829\n-\n1839)\n.\nThe work\n[\n6\n]\nis a reprint in\n1966\nby the Chelsea Publishing Company of Bowditch's translation. The publisher gives this description of the work:-\nThe present work is a reprint, in four volumes, of Bowditch's English translation of Volumes I-IV of Traité de mécanique céleste de mécanique céleste\n[\nDuprat, Paris,\n1798\n-\n1805]\n. The various volumes of the translation were originally published in\n1829\n,\n1832\n,\n1834\nand\n1839\n, respectively\n[\nHilliard, Gray, Little and Wilkins, Boston\n]\n, under the title Mécanique céleste, which is here translated. The memoir on the life of Bowditch, which originally appeared in Volume IV, has been transferred to Volume I.\nWe should note that the memoir on the life of Bowditch originally appeared in Volume IV since this volume was not published until\n1839\n, the year after Bowditch died.\nIn\n1969\nby the Chelsea Publishing Company published\n[\n4\n]\nwhich is a reprint of the French original of\nLaplace\n's fifth volume. The publisher describes this is follows:-\nThe present work is a textually unaltered reprint of Volume V of Traité de mécanique céleste, first published in\n1825\n[\nDuprat, Paris\n]\n.... It constitutes the fifth volume of a set, the first four of which are Nathaniel Bowditch's English translation of Traité de mécanique céleste. Although Bowditch did not make a translation of this fifth volume, he did make use of relevant portions of this volume in his running commentary in each of the four translated volumes.\nRothenberg in\n[\n9\n]\nwrites of the value of Bowditch's English translation:-\nIt would be difficult to overestimate the value of Bowditch's translation and commentary to American physical astronomy during the first half of the nineteenth century. The work marked the beginning of American participation in the field of celestial mechanics. Not only did it allow the poorly trained professors of mathematics in American colleges to explore the wonders of French celestial mechanics, but it also became an essential part of the education of some of Bowditch's successors in the field.\nReingold, however, in\n[\n1\n]\nnotes that:-\nPrinted in a small edition, the work was perhaps more widely admired than read, simply serving to confirm the translator's already high reputation.",
  "matematicos_citados_na_biografia": [
    "Royal Society of London",
    "Newton",
    "Laplace",
    "American Academy of Arts and Sciences",
    "Lissajous",
    "Benjamin Peirce",
    "Royal Society of Edinburgh",
    "Royal Irish Academy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}