{
  "nome_completo": "Nathaniel Bliss",
  "nome_curto": "Nathaniel Bliss",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bliss_Nathaniel/",
  "data_nascimento": "28 November 1700",
  "local_nascimento": "Bisley, Gloucester, England",
  "data_morte": "2 September 1764",
  "local_morte": "London, England",
  "summary": "Nathaniel Bliss was an English mathematician and astronomer who went on to become Astronomer Royal.",
  "biografia": "Nathaniel Bliss\nwas born in the Cotswold village of Bisley which is about\n5\nkm east of Stroud. His father, also named Nathaniel Bliss, was a clothier in the town where his son was born. He matriculated at Pembroke College, Oxford, in\n1716\n, and graduated BA on\n27\nJune\n1720\n. In\n1723\nhe was awarded an MA by Oxford, then married Elizabeth Hillman shortly after. Nathaniel and Elizabeth Bliss had many children but only four survived him. Elizabeth was the daughter of the leading Oxford scholar Thomas Hillman of Painswick. Bliss then took holy orders, becoming rector of St Ebbe's Church, Oxford in\n1736\n.\nTwo other important scientists were working in Oxford at this time;\nEdmond Halley\nand\nJames Bradley\n.\nHalley\nhad been appointed to the Savilian chair of geometry at Oxford in\n1704\nand had been appointed Astronomer Royal in\n1720\n.\nBradley\nhad been appointed to the Savilian chair of astronomy at Oxford in\n1721\n. Bliss attended lectures by\nBradley\nbut\n[\n4\n]\n:-\nRather curiously, his name does not appear on the list of Pembroke College men who attended\nBradley\n's courses, and one wonders how many other people attended without their names appearing in the surviving lists.\nFollowing the death of\nHalley\nin January\n1742\n,\nBradley\napplied for the position of Astronomer Royal and Bliss applied for the Savilian chair of geometry. Bliss was supported for this post by\nBradley\n, and also by\n(\namong others\n)\nGeorge Parker, the second earl of Macclesfield, and by\nWilliam Jones\n. Bliss was appointed and took up the position on\n18\nFebruary\n1742\n. Following this he set up instruments in Oxford creating the fourth observatory in the city. He was elected a fellow of the\nRoyal Society\nin May of\n1742\n.\nBradley\nwas successful in his application to succeed\nHalley\nas Astronomer Royal. One consequence of this was that he moved to Greenwich and Bliss now began a correspondence with\nBradley\nwhich lasted\n20\nyears until\nBradley\n's death. Of course the journey from Oxford to Greenwich was not too difficult and he frequently visited\nBradley\nat Greenwich. In addition Bliss undertook astronomical work with George Parker, the second earl of Macclesfield, who had established an observatory at Shirburn Castle. Bliss supplied\nBradley\nwith data gained from observing Jupiter's moons and collaborated with\nBradley\nand the Earl of Macclesfield in making observations of the comet of\n1745\n.\nBliss, of course, was Savilian professor of geometry at Oxford so, although his research interests were mainly in astronomy, he also taught mathematics at Oxford. McConnell writes\n[\n1\n]\n:-\nA notice for his lectures advertised courses in arithmetic, algebra, and plane and spherical trigonometry, with the use of logarithms and surveying instruments. He accepted between six and ten students in each class; they had to attend three times a week, for not less than one hour daily. He charged\n2\nguineas for each course, which lasted about three months, another half guinea being payable for every month the course lasted thereafter.\nBy\n1761\nBradley\n's health was deteriorating and he was not well enough to undertake the important observations of the transit of Venus on\n6\nJune\n1761\n. Bliss undertook these observations which he sent to the\nRoyal Society\n. In\n1762\nBradley\ndied and so the position of Astronomer Royal became vacant. Bliss applied for the position and was duly appointed on\n26\nAugust\n1762\n. It seems slightly ironical, but Bliss seems to have been more productive in astronomy research when he was the professor of geometry than when he was Astronomer Royal. Of course he was nearly\n62\nyears of age when appointed and he only held the post for two years before his death so had relatively little time to make a mark\n[\n4\n]\n:-\nAs he had completed no major researches in that time, his Greenwich observations were not published until\n1805\n, when Thomas Hornsby included them as a supplement to his edition of the observations of\nJames Bradley\n.\nHe had a great interest in improving clocks, which he saw as important to improve astronomical measurements. This was a period when clocks were proving to be the solution to the longitude problem and Harrison's clock H\n4\nwas being tested during his time in Greenwich.\nNevil Maskelyne\nwas also trying to win the longitude prize using the lunar distance method. Bliss was one of three leading astronomers to examine the instruments that\nMaskelyne\ntook to St Helena in\n1763\n-\n64\nas part of the longitude project. He also made observations of an annular eclipse visible at Greenwich on\n1\nApril\n1764\n.\nJ Fauvel, R Flood and R Wilson explain in\n[\n4\n]\nevents which followed the death of Bliss:-\nWe must, however, assume that Bliss continued to teach in Oxford after his appointment as Astronomer Royal, for on\n21\nMay\n1765\n, his enterprising widow launched what one assumes to have been a continuation of his popular lectures, delivered by Bradley's Savilian astronomical successor, Thomas Hornsby, 'for the Entertainment of ladies and others'. Mrs Bliss was clearly the driving force behind the special lecture given in the Bodleian Library tower above the Schools quadrangle, for her name heads the published prospectus as organizer, taking precedence over Professor Hornsby who merely delivered it, and stipulating that the admission fee would be by ticket for half a crown. One assumes that the ladies who attended were well off, for in\n1765\na halfcrown would have maintained a labourer's entire family for a couple of days.",
  "matematicos_citados_na_biografia": [
    "Edmond Halley",
    "James Bradley",
    "Halley",
    "Bradley",
    "William Jones",
    "Royal Society",
    "Nevil Maskelyne",
    "Maskelyne"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}