{
  "nome_completo": "George Neville Watson",
  "nome_curto": "Neville Watson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Watson/",
  "data_nascimento": "31 January 1886",
  "local_nascimento": "Westward Ho!, Devon, England",
  "data_morte": "2 February 1965",
  "local_morte": "Leamington Spa, Warwickshire, England",
  "summary": "Neville Watson studied at Cambridge, and then taught at Cambridge and University College London before becoming Professor at Birmingham. He is best known as the joint author with Whittaker of one of the standard text-books on Analysis.",
  "biografia": "Neville Watson\n's mother was Mary Justina Griffith\n(1860\n-\n1945)\n, the eldest daughter of the rector of Ardley in Oxfordshire, Rev George Sandham Griffith\n(1831\n-\n1903)\nand Julia Robberd\n(1832\n-\n1904)\n. Neville's father was George Wentworth Watson\n(\nborn\n1857\nin Calcutta, India, died\n1940)\nwho, at the time of Neville's birth, was a schoolmaster at the United Services College, teaching mathematics and geography, but is more famous for his work as a genealogist. He played a large role in the publication of\nThe Complete Peerage\n, a\n13\n-volume database of the British peerage, generally accepted as the greatest British achievement in the field of genealogy. The first edition was published in London between\n1887\nand\n1898\n. George and Mary Watson were married in\n1885\nand had two children, the eldest being Neville and the younger his sister Muriel Mary Joyce Wentworth Watson\n(\nborn about\n1892)\n.\nLet us say a little about Westward Ho! where Neville was born. As a first comment, let us record that on the\n1891\ncensus his place of birth is given as Northam, Devon while on the\n1901\ncensus it is given as Westward Ho!. In fact Westward Ho! was the name of a new hotel opened in\n1865\n, named after Charles Kingley's novel of that name which was set in nearby Bideford. Villas began to be built round the hotel and the United Services College, a secondary school preparing boys for a military or civil service overseas career, was founded there in\n1874\n. Almost all the boys were boarders and this was the school in which Neville's father was teaching at the time of his birth. The school merged with another in\n1906\nand closed its premises in Westward Ho! The town of Northam is closer to Westward Ho! than Bideford, and certainly those living near the hotel would think of living near Northam before the village took the name of the hotel and became known as Westward Ho! In fact the\n1891\ncensus considers their house in Westward Ho! to be in the town of Northam. The census form shows that Neville and his parents had two servants, a nurse Clara Carter\n(\nage\n23)\nand a general servant Mary Ann Hocking\n(\nage\n20)\n.\nThe Watson family moved from Westward Ho! to Kensington, London, and, certainly by the time of the\n1901\ncensus, they were living there with Neville's father described as a private tutor and as an employer. Again they have two servants, a housemaid and a cook. Neville was educated at St Paul's School in West Kensington, London, entering as a Foundation Scholar in\n1898\n. While studying there, he held both the Campden Exhibition and the Keen Scholarship\n[\n25\n]\n:-\nHis sister's chief recollections are of long hours closeted with his father in his study and of occasions when he was so absorbed that he could pass his mother and sister in the street without recognising them.\nKenneth Wardle writes\n[\n22\n]\n:-\nAt school he was not particularly sociable, being somewhat reserved, and while his fellows were playing games during their lunch hour Watson would be down at Addison Road station watching the trains and recording the numbers of the engines. This early interest developed later into an absorbing interest in railways. It was while still at school ... that he published his first mathematical paper, in the December\n1903\nnumber of 'The Gazette'; ... \"A method for determining a very rapidly converging series for the square root of any positive integer.\"\nWe note that certainly Watson's series converges rapidly, for example eight terms of his series for √\n2\ngives it correct to\n390\ndecimal places.\nWinifred Cooke, writes of Watson's school days in\n[\n22\n]\n:-\nHe often remarked that he was eternally grateful that during his last three years at St Paul's School, where he was educated, there was an insufficient number of staff to teach him mathematics and consequently he was forced to do much on his own and so became prepared for university style of teaching.\nDespite this comment, he was very fortunate to have the outstanding teacher of mathematics\nFrancis Macaulay\n. He mixed with equally outstanding pupils, for\nJ E Littlewood\n, less than a year older than Watson, was also a pupil at the school. In\n1904\nWatson won the Smee Prize from St Paul's School for his essay \"Properties of curves.\" This prize had been endowed \"for original work of a scientific or practical nature.\"\nHaving won a scholarship to Trinity College, Cambridge, Watson matriculated there in\n1904\n. At this time there were three young fellows of Trinity all of whom had a major influence on Watson's mathematics. They were\nE T Whittaker\n,\nE W Barnes\n, and\nG H Hardy\n. Perhaps the one from this trio who had the greatest influence on him at this time was\nBarnes\n, despite the fact that he was coming to the end of his career.\nWhittaker\nleft Cambridge in\n1906\n, two years after Watson arrived, and although his influence at this time was slight, he became an important collaborator and friend some years later.\nWatson graduated as Senior\nWrangler\nin\n1907\n(\nmeaning that he was ranked in first position among those who were awarded First Class degrees\n)\n, after choosing to take three years over Part I when many of his contemporaries were taking two. He completed the Mathematical Tripos in the following year in the second division of the First Class\n[\n25\n]\n:-\n... although this result was attributable to illness it undoubtedly disappointed him.\nHe wrote about the Tripos in\n[\n23\n]\n:-\nIn my undergraduate days, now slightly more than a quarter of a century distant, the order of merit in the Mathematical Tripos still existed though its abolition had been decided upon; and, in certain circles, the discussion of the form of candidates and the places which they were likely to obtain in the next Tripos was not without interest; though the contest was, I think, free from any betting element, some impression of the general attitude to the examination may be gained by comparing it with the attitude of the sporting press to a forthcoming race. I have always got the impression from my father\n(\nwho was a contemporary of Professor\nForsyth\n)\nthat in his time, a quarter of a century before mine, this interest in Tripos results as sporting events was considerably stronger.\nWhile an undergraduate, he published three papers:\nThe Expansion of Products of Hypergeometric Functions\n(1907)\n,\nA Series for the Square of the Hypergeometric Function\n(1908)\nand\nThe cubic transformation of the hypergeometric function\n(1909)\n. These papers were all published in the\nQuarterly Journal of Pure and Applied Mathematics\n.\nHe won a prestigious Smith's Prize in\n1909\n, becoming a Fellow of Trinity College in\n1910\nand living in the College's New Court. This was particularly pleasing to him for he had a great love of his College, and throughout his life he collected prints of the College and of previous Fellows. Later while holding the fellowship he lived at Neviles Court, Trinity College.\nAfter election to his Trinity fellowship, Watson spent four further years in Cambridge before leaving to take up an assistant lectureship in University College, London. From\n1918\nuntil he retired in\n1951\nhe was Mason Professor of Pure Mathematics at Birmingham University\n[\n22\n]\n:-\nAt that time one lecture room at Edmund Street in the centre of Birmingham sufficed for all lectures in both pure and applied mathematics at the University, and there was no Honours School of Mathematics. Promising students took one year of post-graduate work to qualify for the degree of M.A. or M.Sc. It was Watson who brought the Honours School into being, and so widened the scope of the work that it became necessary to have two separate departments, one for Pure Mathematics and a second which developed into the Department of Mathematical Physics under Professor\nR E Peierls\n[\nin\n1937]\n. All this development took place at the same time that Watson was also carrying out an enormous amount of work outside the University.\nWinifred Adelaide Cooke who graduated from the University of Birmingham in\n1926\nwrites\n[\n22\n]\n:-\nI first met Professor Watson when I became one of his students at Birmingham University. How well I remember his shy and sensitive manner and his quick movements. He was a man of very strong likes and dislikes and his reactions were sometimes a little unorthodox. Many a time, when something or someone annoyed him during a lecture his piece of chalk would come flying over the heads of us students and someone would duck to avoid it. Beneath all this he had a very genuine interest in, and desire to help, all his students. In those early days he owned a small, open, three-wheeled car. The back seat was completely inaccessible unless you climbed over the car itself, and to be one of his passengers dashing across Birmingham was sometimes rather a hazardous affair, especially when he had to negotiate tram lines. ... He was always very much aware of students' difficulties during their first year at the University and did much to make the transition as smooth as possible.\nIn\n1925\nhe married Elfrida Gwenfil Lane\n(1898\n-\n1998)\nin Holbeach, Lincolnshire, the daughter of the farmer Thomas Wright Lane\n(\nborn in North Eastham, Norfolk in around\n1862\n, died\n3\nJanuary\n1932\non board the\nS.S. Ulysses\nat Penang, Malay\n)\nand Sara Jane Lane\n(\nborn in Bangor, Carnarvon around\n1870)\n. Elfrida was born in Holbeach on\n3\nNovember\n1898\nand had served as a Motor Driver in the Women's Royal Naval Service in\n1918\n. They had one son who, following the family tradition, was named George.\nWatson worked on a wide variety of topics, all within the area of complex variable theory, such as\ndifference equations\n,\ndifferential equations\n,\nnumber theory\nand\nspecial functions\n. He is best known as a joint author with\nE T Whittaker\nof\nA Course of Modern Analysis\npublished in\n1915\n. The first edition of the book has only Whittaker as an author. In\n1922\nWatson published\nThe theory of Bessel functions\nwhich was another masterpiece.\nTitchmarsh\nwrote of Watson's books\n(\nsee for example\n[\n2\n]\n)\n:-\nHere one felt was mathematics really happening before one's eyes. ... the older mathematical books were full of mystery and wonder. With Professor Watson we reached the period when the mystery is dispelled though the wonder remains.\nFor further information about Watson's three books, including extracts from reviews, see\nTHIS LINK\n.\nOne piece of work undertaken by Watson deserves special mention. It involves the problem of wireless waves, which were quickly found to travel long distances despite the fact that theoretically they should not have been able to follow the curvature of the Earth. A mathematical model had been constructed where the Earth was represented by a partially conducting sphere surrounded by an infinite dielectric. Such a model had been used by\nMacdonald\n,\nRayleigh\n,\nPoincaré\n,\nSommerfeld\nand others. Although Watson was not interested in how best to model the situation, he was, however, very interested in using his expertise to determine mathematical solutions to the given model which others might then check against observations. He obtained solutions to the problem in\n1918\nwhich showed conclusively that the model was not a satisfactory one.\nIn\n1902\nHeaviside\nhad predicted that there was an conducting layer in the atmosphere which allowed radio waves to follow the Earth's curvature. This layer in the atmosphere, now called the\nHeaviside\nlayer, was only a conjecture in\n1918\nbut it was suggested to Watson that, having shown the previous model to be wrong, he now looked at the model resulting from the postulated\nHeaviside\nlayer. Watson showed that if the layer was about\n100\nkm above the Earth's surface and it had a certain conductivity, then indeed the solutions obtained closely matched observations. That\nHeaviside\n, and Watson, were correct was confirmed in\n1923\nwhen the existence of the layer was proved experimentally when radio pulses were transmitted vertically upward and the returning pulses from the reflecting layer were received.\nWatson undertook a major project by examining in detail\nRamanujan\n's notebooks, extending his results and supplying proofs. In fact he wrote twenty-five papers relating to results in\nRamanujan\n's notebooks, and he spent many hours making a hand written copy in wonderful script of all the notebooks. He enjoyed numerical calculations and spent many happy hours doing numerical work on his calculating machine.\nHe was elected to the\nRoyal Society\nof London in\n1919\n. In\n1946\nhe received the\nSylvester\nMedal of the\nRoyal Society\n:-\n... in recognition of his distinguished contributions to pure mathematics in the field of mathematical analysis and in particular for his work on asymptotic expansion and on general transforms.\nWatson was also very active in his support for the\nLondon Mathematical Society\n. He served as its secretary from\n1919\nto\n1933\n, its president from\n1933\nto\n1935\nand acted as an editor of the\nProceedings\nof the Society until\n1946\n. The Society awarded him their\nDe Morgan\nMedal in\n1947\n. The\nRoyal Society of Edinburgh\nelected him to an honorary fellowship.\nA strong supporter of the\nMathematical Association\nhe played a very active role\n[\n22\n]\n:-\nThe\nMathematical Association\nhas every reason to feel proud that a mathematician so distinguished as Watson should associate himself closely with its activities. He was elected President for the two years\n1932\nand\n1933\n, being the last to hold office for more than one year, and was noted in committee for his mastery of detail and precise pertinent comments on items on the agenda. His first Presidential Address was called \"The Marquis and the Land Agent, a tale of the\n18\nth century\". It concerned\nFagnano\nand\nLanden\nand elliptic arcs; but the title beguiled an unwary journalist into attending; he left early! The second address on \"Scraps from some mathematical notebooks\" was on\nGauss\nand the entries in his day-book. Watson was a great believer in going to the original works of the great mathematicians, rather than to their interpreters, and he also had the great gift of clarifying the sometimes obscure material of others. As a Vice-President of the\nAssociation\nhe was a regular attender at Council meetings almost to the end of his life.\nWe learn something about Watson's beliefs when we look at his record of attendance at International Congresses of Mathematicians. He attended the\n1912\nCongress in Cambridge, England, but chose not to attend the\n1920\nand\n1924\nCongresses since they were not truly international with mathematicians from Germany, Austro-Hungary, Bulgaria and Turkey excluded. He attended the\n1932\nCongress in Zurich and wrote in\n[\n24\n]\nthat he had:-\n... deliberately abstained from attending the Congresses at Strassburg and Toronto in\n1920\nand\n1924\n, for reasons which are now, happily, a matter of past history, and by my having been unavoidably prevented from going to Bologna in\n1928\n; in fact my only previous experience of a Congress was gained at Cambridge in\n1912\n.\nFor a version of Watson's report on the\n1932\nICM, see .\nWe find a little of Watson's personality described in\n[\n2\n]\n:-\nHe was the university's expert on the timetable; students with unusual combinations of subjects usually had to be referred to him for advice, and for many years after his retirement the dates of the academic year were governed by the \"Watsonian cycle\". ... He took great trouble with the style of his letters and his conversation and enjoyed finding a pungent phrase to express his points of view or his criticism ... he made no secret of his aversion to cars, telephones, and fountain pens. He loved trains - whose timetables were as familiar to him as those of the university lectures - and unusual stamps.\nKenneth Wardle writes about Watson's personality in\n[\n22\n]\n:-\nIn manner and appearance\n(\nhe always wore a wing collar\n)\nhe recalled the professors of an earlier generation, and he was always very proud of his Fellowship at Trinity and delighted to entertain colleagues with remarks and tales from the High Table, around which, he was wont to say, one could always hear profound conversation on any subject under the sun. Yet the appearance belied the man, for, while he was somewhat difficult to get to know, when one did achieve this he was a very real friend, and there are many who will remember both his kindnesses and his assistance with their problems; he and his wife were most charming hosts to those whom they entertained at their house. ... He did not like telephones and regarded them as \"an invention the devil\". There was no Departmental Secretary during his time at Birmingham, and he carefully typed all examination papers from members of his staff himself, filling in the formulae most carefully with old-fashioned pen and nib. He preferred to discuss matters face to face with colleagues rather than write a letter and send it by internal post, and it may be that his long journeys on foot from one part of the University to another compensated for lack of other exercise, for he never seemed to suffer from ill-health. ... He took little exercise, apart from his walk to and from the station at Leamington and across Birmingham to catch the tram. Incidentally his pace of walking was such as to stretch his younger colleagues considerably, and pedestrians and traffic in the city appeared to split before his progress rather as the bow wave of a ship. At one time he drove a car, but he was never too happy with this, and forsook this method of transport when four-wheel brakes came into fashion.\nWatson died in\n1965\n. Alan Champneys writes\n[\n12\n]\n:-\nUpon his death,\nRobert Rankin\nof the University of Glasgow, who had been Watson's immediate successor as the  Mason Professor in Birmingham, was initially given the task of organising Watson's unpublished work. To his horror, Watson's widow showed him a room in their house, devoid of furniture, knee deep in unpublished manuscripts. These included a massive, but incomplete further edition of the Whittaker and Watson textbook, a monograph on 'Three Decades of Midland Railway Locomotives' and a great deal of material relating to\nRamanujan\n. The task of further editing Watson's papers was given to\nE T Whittaker\n's son,\nJ M Whittaker\n, who was appointed by the\nRoyal Society\nto write Watson's obituary in its Biographical Memoirs.",
  "matematicos_citados_na_biografia": [
    "Francis Macaulay",
    "J E Littlewood",
    "E T Whittaker",
    "E W Barnes",
    "G H Hardy",
    "Barnes",
    "Whittaker",
    "Wrangler",
    "Forsyth",
    "R E Peierls",
    "difference equations",
    "differential equations",
    "number theory",
    "special functions",
    "Titchmarsh",
    "THIS LINK",
    "Macdonald",
    "Rayleigh",
    "Poincaré",
    "Sommerfeld",
    "Heaviside",
    "Ramanujan",
    "Royal Society",
    "Sylvester",
    "London Mathematical Society",
    "De Morgan",
    "Royal Society of Edinburgh",
    "Mathematical Association",
    "Fagnano",
    "Landen",
    "Gauss",
    "Association",
    "Robert Rankin",
    "J M Whittaker"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}