{
  "nome_completo": "Nicole Oresme",
  "nome_curto": "Nicholas Oresme",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Oresme/",
  "data_nascimento": "1323",
  "local_nascimento": "Allemagne (west of Riez), France",
  "data_morte": "11 July 1382",
  "local_morte": "Lisieux, France",
  "summary": "Nicole Oresme was a French mathematician who invented coordinate geometry long before Descartes. He was the first to use a fractional exponent and also worked on infinite series.",
  "biografia": "Nicholas Oresme\n, whose name is given in French as\nNicole Oresme\n, was of Norman origin. Nothing is known of his early life, and the first that is known is that he studied for an Arts Degree in Paris in the early\n1340\ns where he was taught by Jean Buridan at the University of Paris.\nBuridan was a philosopher and logician who made contributions to\nprobability\n, optics and mechanics. He added to\nAristotle\n's theory of motion by understanding that motion was retarded by resistance from the air. Although his views were in many respects close to those of\nOckham\n, he disagreed with some of\nOckham\n's views and attacked them in\n1340\n. About\n35\nyears later the followers of\nOckham\nwould retaliate by placing Buridan's works on the\nIndex of Forbidden Books\n. Buridan had a major influence in interesting Oresme in natural philosophy and in encouraging him to question the ideas of\nAristotle\n.\nOresme's name appears on the list of scholarship holders in theology at the College of Navarre at the University of Paris in the year\n1348\n. He was awarded the degree of Master of Theology in\n1355\nand, in the following year, he was appointed as Grand Master of the College of Navarre. Not long after this Oresme became friendly with the dauphin Charles who went on to become Charles V of France in\n1362\n. The friendship between Charles and Oresme was one which continued throughout their lives. Charles was in intellectual and religious man who enjoyed the company of scholars such as Oresme.\nAfter six years as the Grand Master of the College of Navarre, Oresme left in\n1362\nto become canon of the Cathedral of Rouen. The following year he took on the additional duties of canon at the Sainte-Chapelle in Paris. In\n1364\nhe became dean of the Cathedral of Rouen and, his friend Charles becoming King of France on\n8\nApril of that year, Oresme was appointed as Charles' chaplain and councillor. From\n1370\nhe lived mainly in Paris, advising Charles on financial matters as well as translating from Latin into French\nAristotle\n's\nEthics, Politics\nand\nOn the Heavens\nand the\nAristotle\nstyle work\nEconomics\n. These translations were very important, introducing many new technical terms into the French language. As a reward for this work Charles appointed Oresme bishop of Lisieux in\n1377\nand he was consecrated in the following year.\nAt a time when\nAristotle\n's ideas were accepted almost without question, Oresme did indeed question them. For example he rejected\nAristotle\n's definition of time, which was based on uniform motion, and proposed a definition independent of motion. Similarly he rejected\nAristotle\n's definition of the position of a body, which was the boundary of the surrounding space, and replaced it with a definition in terms of the space which the body occupies.\nOresme invented a type of coordinate geometry before\nDescartes\n, finding the logical equivalence between tabulating values and graphing them in\nDe configurationibus qualitatum et motuum\n. He proposed the use of a graph for plotting a variable magnitude whose value depends on another variable. It is possible that\nDescartes\nwas influenced by Oresme's work since it was reprinted several times over the\n100\nyears following its first publication. Oresme was the first to prove Merton's theorem, namely that the distance travelled in a fixed time by a body moving under uniform acceleration is the same as if the body moved at a uniform speed equal to its speed at the midpoint of the time period.\nAnother work by Oresme\nDe proportionibus proportionum\ncontains the first use of a fractional exponent, although, of course, not in modern notation. He examined the question as to whether the ratio of the periods of two heavenly bodies was a rational number asking:-\n... if anyone should make a mechanical clock, would he not make all the wheels move as harmoniously as possible?\nHe then answered his own question, arguing that the\nirrationality\nof ratios will not rob the heavens of their beauty and will also not be inconsistent with regular movement. Oresme also worked on infinite series and argued for an infinite void beyond the Earth.\nClagett writes in\n[\n3\n]\n:-\nThis brilliant scholar has been credited with ... the invention of analytic geometry before\nDescartes\n, with propounding structural theories of compounds before nineteenth century organic chemists, with discovering the law of free fall before\nGalileo\n, and with advocating the rotation of the Earth before\nCopernicus\n. None of these claims is, in fact, true, although each is based on discussion by Oresme of some penetration and originality ...\nIn\nLivre du ciel et du monde\n(1377)\nOresme opposed the theory of a stationary Earth as proposed by\nAristotle\nand in this work he proposed rotation of the Earth some\n200\nyears before\nCopernicus\n. However he rather spoilt this fine piece of thinking by rejecting his own ideas at the end of the work and so, as Clagett writes, cannot be regarded as claiming that the Earth rotated before\nCopernicus\n. He wrote\nQuestiones Super Libros Aristotelis de Anima\ndealing with the nature of light, reflection of light, and the speed of light. Oresme's work on light is discussed in detail in\n[\n16\n]\n.",
  "matematicos_citados_na_biografia": [
    "probability",
    "Aristotle",
    "Ockham",
    "Descartes",
    "irrationality",
    "Galileo",
    "Copernicus"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}