{
  "nome_completo": "Nicolai Vasilievich Bugaev",
  "nome_curto": "Nicolai Vasilievich Bugaev",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bugaev/",
  "data_nascimento": "14 September 1837",
  "local_nascimento": "Dusheti Russian Empire (now Georgia)",
  "data_morte": "11 June 1903",
  "local_morte": "Moscow, Russia",
  "summary": "Nicolai Vasilievich Bugaev was a Russian mathematician, born in Georgia, who worked mainly on analysis and number theory.",
  "biografia": "Nicolai Vasilievich Bugaev\n's father was a medical doctor in the army. When Bugaev was ten years old his father sent him to Moscow to be educated. It was not an easy life for the young Bugaev for he had to earn extra money giving tuition in order to make have enough money to live on.\nIn\n1855\nBugaev entered the Faculty of Physics and Mathematics at Moscow University. He graduated four years later and went to St Petersburg to study at the Engineering Academy there. At this point Bugaev was not concentrating on mathematics, although his courses had included a very strong background in mathematics. However, he returned to Moscow in\n1861\nwith the intention of concentrating on mathematics from that time on.\nHe wrote a Master's thesis on convergence of infinite series at the University of Moscow which he submitted and successfully defended in\n1863\n. The work of this thesis is important and the paper\n[\n8\n]\nis concerned with the subsequent development of ideas on general tests of convergence of infinite series contained in Bugaev's thesis. It should be remembered that a Master's thesis in Russia at this time was essentially equivalent to the doctorate at a British or American university today. After this Bugaev decided that he should study abroad to complete his education. Over a period of two and a half years he studied under\nKummer\nand\nWeierstrass\nin Berlin and\nLiouville\nin Paris.\nIn\n1866\nBugaev submitted his doctoral thesis on numerical identities associated with the number e. A Russian doctoral thesis being essentially the equivalent of the German\nHabilitation\nthesis, then Bugaev's appointment as professor at Moscow University followed in\n1867\n.\nHis research was mainly on analysis and\nnumber theory\n. Bugaev gave proofs of theorems stated without proof by\nLiouville\n. He wrote on algebraic integrals of certain\ndifferential equations\n. His work in Moscow was to lead to the creation of the Moscow school of the theory of functions of a real variable in\n1911\n, eight years after his death by\nEgorov\n, one of his students.\nSonin\nwas another of Bugaev's pupils who went on to make a major contribution to mathematics.\nBugaev's most important work in number theory was based on an analogy between some operations in number theory and the operations such as differentiation and integration in analysis. Bugaev built a systematic theory of discontinuous functions which he called arithmology.\nBugaev also published papers on the philosophy of mathematics such as\nLes mathématiques et la conception du monde au point de vue philosophie scientifique\nⓉ\n(\nMathematics and the scientific worldview philosophy perspective\n)\n(1898)\nwhich he delivered at the International Congress of Mathematicians at Zürich in\n1897\n. In this work Bugaev describes mathematics as based on the theory of functions, with geometry and the theory of\nprobability\nhaving a minor role. Bugaev claims that these contain all that is necessary:-\n... to develop the fundamental principles of the scientific and philosophical conception of the world.\nIn\n[\n5\n]\nDemidov sees Bugaev's work on the philosophy of mathematics as contributing to the foundation of the school of real analysis. The philosophical concepts, Demidov writes:-\n... established an important component of the philosophic context in which the formation of the Moscow school of the theory of functions of one real variable unfolded at the beginning of the twentieth century.\nThe theorem relating convergence almost everywhere and uniform convergence by D F\nEgorov\n, one of Bugaev's pupils, in\n1911\nis seen as marking the beginning of the Moscow school of the theory of functions of a real variable.\nBugaev was one of the founders of the\nMoscow Mathematical Society\n, its vice president from\n1886\nand its president from\n1891\n. He led a campaign for Russian authors to write in Russian and this led to the developing of Russian mathematical terminology.",
  "matematicos_citados_na_biografia": [
    "Kummer",
    "Weierstrass",
    "Liouville",
    "Habilitation",
    "number theory",
    "differential equations",
    "Egorov",
    "Sonin",
    "probability",
    "Moscow Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}