{
  "nome_completo": "Nicolas-Louis de Lacaille",
  "nome_curto": "Nicolas-Louis de Lacaille",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lacaille/",
  "data_nascimento": "15 March 1713",
  "local_nascimento": "Rumigny-en-Thiérache, France",
  "data_morte": "21 March 1762",
  "local_morte": "Paris, France",
  "summary": "Nicolas-Louis de Lacaille was a French astronomer and geodesist who catalogued the stars of the Southern Hemisphere and named 14 out of the 88 constellations.",
  "biografia": "Nicolas-Louis de Lacaille\nor\nde la Caille\nwas the son of Charles-Louis de Lacaille\n(1679\n-\n1731)\nand Barbe Rebuy. Most biographers agree on his birthday being\n15\nMarch\n1713\n, though some sources mark his birthday on\n14\nDecember, closer to\n29\nDecember, the date of his baptism. Lacaille had three older brothers, five older sisters\n(\none named Marie-Barbe\n)\nand one younger sister. All died at a young age except three girls, who became nuns, and  Lacaille, the subject of this biography. The family had been living in Rumigny, in the Ardennes, for at least two generations. They owned the castle of Cour-des-Prés, where Lacaille grew up.\nCharles-Louis was an educated man who had retired from the military to pursue his mechanical and scientific interests. He was particularly interested in mechanics and had invented several machines. Being in charge of Lacaille's studies from a young age, he transmitted his passions to him. Although the family were well off at first, Charles-Louis ran up debts when he embarked on a project to run a paper mill, which failed. Sent to Nantes by the Duke of Bourbon in\n1725\nto head a colonial project, his luck again ran out for the project was abandoned. He was next appointed by the Duchess of Vendôme as a guardian and huntsman at Anet, west of Paris.\nNicolas-Louis Lacaille went to study at the Collège de Mantes-sur-Seine\n(\nnow Mantes-la-Jolie\n)\n,\n48\nkm west of Paris, and then, in\n1729\n, with a scholarship to the Parisian Collège de Lisieux. At this College he studied rhetoric and philosophy for two years.  These years were difficult since his health was so poor that he struggled to eat enough to stay alive. When he was eighteen, his father died, and Lacaille inherited a large amount of debt from him\n(\nhe willingly took it upon himself while his sisters managed their father's assets\n)\n. Lacaille managed to continue his education thanks to the financial help of Duque Louis Henri de Bourbon, who had been a friend of his father's. He went on to study theology at the Collège de Navarre, entering in\n1732\n, intending at this stage to become a priest. His father had wanted him to enter the Church and he greatly respected the memory of his father's wishes.\nDuring this time, Lacaille came across a copy of\nEuclid\n's\nElements\n. His education until that point had mainly been literary, but he managed to teach himself geometry without the help of a teacher. He gained an interest in mathematics and started studying astronomy on his own. For three years, he balanced these new scientific interests with his theological studies. He eventually decided to focus entirely on the former, but he did not forget his religious background. He had become a deacon, and acted as such first in Saint-Étienne-du-Mont and later in the chapel of Collège Mazarin.\nThrough astronomy, Abbé Lacaille became friends with\nJacques Cassini\n, then director of the Paris Observatory. Cassini's influence helped Lacaille improve in his astronomical observations. He also befriended Cassini's son, César-François\n(\noften called\nCassini de Thury\n)\n, and nephew, Jean-Dominique Maraldi. In\n1735\n, Lacaille surveyed the French coast from Nantes to Bayonne, along with Maraldi. Lacaille started working in the Paris Observatory in May\n1736\n, and stayed there until January\n1740\n. In July\n1739\n, along with Maraldi and\nCassini de Thury\n, Lacaille began measuring the French meridian. Their objective was to revise earlier measures by\nDominique Cassini\n(1690)\nand\nJean Picard\n(1669\n-\n70)\n. The survey took around three years and was often carried out in treacherous conditions in dangerous parts of the country. The results were published in\n1743\nwith the title\nLa Méridienne de France vérifiée\nⓉ\n(\nThe Meridian of France verified\n)\nunder\nCassini de Thury\n's name. Lacaille, however, had made all the calculations and was not happy that all he received was an acknowledgement of his help in the Preface. He wrote to\nJames Bradley\n, sending a copy of another of his books:-\n... I have also had printed the details of all the geometrical and astronomical operations that I have made with\nCassini de Thury\n, to amend the work of his father on the figure of the earth. I would have sent it at the same time if I had not been so shocked by the behaviour of M\nCassini\n, who has taken complete possession of this book, to which he has hardly done more than put his name and pay the costs of printing: if it had been on sale I would have bought a copy for you and one for me; but this book is not yet published so far as I know. What I am telling you here is not to complain about M\nCassini\nbut only to inform you about the author and the work. When you have seen it you can assure yourself of what I have the honour to tell you and can inform yourself of it through those of our Academy whom you know. However, you would please me by not revealing to anybody that I have told you about it myself. I ask a thousand excuses for the liberty that I have dared to take with you. But also I beg you to believe that there is nobody more inclined than myself to render all the services in this country that you judge me capable of...\nThe measurements of the meridian confirmed\nNewton\n's idea that the Earth was a sphere flattened at the poles, as did the results from the expeditions sent to Peru and Lapland in\n1735\nand\n1736\n. The\nAcadémie des Sciences\nrecognised Lacaille's worth and elected him as an assistant astronomer on\n3\nMay\n1741\n, when he was only\n28\nyears old. On\n5\nApril\n1745\n, he was elected associate astronomer, replacing Grandjean de Fouchy\n(\nwho was appointed perpetual secretary\n)\n. Ian Stewart Glass writes in\n[\n7\n]\n:-\nMore than any other astronomer of his time,\n[\nLacaille\n]\nsaw the value to science of making accurate measurements of the stars and planets. A savant at the time of the 'enlightenment', which was then sweeping the intellectual world, he was one of the first French apostles of\nNewton\n, whose theory of gravitation had been looked upon with hostility and scepticism for almost fifty years.\nDescartes\n\" erroneous theory of fluid vortices in a space filled with an ill-defined medium still held sway. But increasingly precise observations of the positions of the planets, moons and comets were making it clear that their movements could only be interpreted in Newtonian terms. Indeed, it can be said that Lacaille and the mathematicians who were his contemporaries in Paris were the true successors of\nNewton\nwhen it came to the development of celestial mechanics and physics as a whole.\nIn\n1739\n, he was appointed to the chair of mathematics at Collège Mazarin, in Paris, succeeding\nPierre Varignon\n. There, he published many textbooks based on his lectures in mathematics\n(\nLeçons de Mathématiques\nⓉ\n(\nLessons in mathematics\n)\n,\n1741)\n, in mechanics\n(\nLeçons de Mécanique\nⓉ\n(\nLessons in mechanics\n)\n,\n1743)\n, in astronomy\n(\nLeçons d'Astronomie géométrique et physique\nⓉ\n(\nLessons in geometric and physical astronomy\n)\n,\n1746)\nand in optics\n(\nLeçons d'Optique\nⓉ\n(\nLessons in optics\n)\n,\n1750)\n. It is a testament to their didactic importance that many of these works were republished several times and then translated into various languages. Abbé Lacaille would often sell these books to his students at half their prize, not interested in financial gain. Lacaille moved his observatory to Collège Mazarin, where a new one had been built for him, stopping his visits to the Paris Observatory by\n1742\n.\nIn\n1748\nhe received a copy of\nJames Bradley\n's paper on his discovery of nutation. He replied to him in a letter dated\n22\nAugust\n1748\n:-\nIt was the paper from you that I waited for with the most impatience since the rumour of this discovery spread, that is, since about ten years ago. I have been disgusted to see several of our astronomers quarrelling over the glory of supposedly themselves having made this discovery ...; but it and the rules obeyed by the movements should in fact have been ascribed to you ... Since I received your letter I have made a translation from which I read an extract to our academy, which is happy to have acquired you as one of its members.\nIndeed\nBradley\nhad been elected to the\nAcademy of Sciences\nin July\n1748\n. After receiving\nBradley\n's paper, Lacaille adjusted all his own observations to allow for nutation. This, however, did not find favour with many of his French colleagues who were highly critical of him over this action. In fact he had little support from his French colleagues as Curtis Wilson points out in\n[\n20\n]\n:-\nIn\n1742\n... Lacaille proposed a project for improving the foundations of astronomy, revising solar theory, and forming a star catalogue, and he invited the other astronomers of the\nAcademy\nto join him in this undertaking. Cold-shouldered by the Cassinis, treated with hostility by P C Le Monnier and\nJean d'Alembert\n, he carried the project forward on his own, with a heroism that went beyond the mere courage of physical endurance. The journey to the Southern Hemisphere needs to be seen as in the service of this overarching aim.\nIndeed, one of Abbé Lacaille's greatest astronomical achievements was the cataloguing of the southern stars. On\n20\nNovember\n1750\nhe embarked on the vessel\nLe Glorieux\n, commanded by d'Après de Mennevillette, a friend of Lacaille's. He headed to the Cape of Good Hope on a scientific expedition organised by the\nAcadémie des Sciences\n, set up at Lacaille's request. He arrived on\n19\nApril\n1751\n, after a detour to Rio de Janeiro. His observations, published in\n1763\nin\nCoelum Australe Stelliferum\nⓉ\n(\nStars of the Southern skies\n)\n, include\n10\n,\n305\ndistinct stars, immediately superseding\nHalley\n's previous catalogue, which was much smaller and less accurate. He identified fourteen new constellations, which he named after scientific instruments: Telescopium, Microscopium, Apparatus Sculptoris, Fornax chemical, Horologium, Reticulus rhomboidalis, Pyxis nautica, Antlia pneumatica, Octanis, Circinus, Norma, and Mons Menae. He described these constellations in\nTable des Ascensions Droites et des Declinaisons Apparentes des Etoiles australes renfermées dans le tropique du Capricorne ...\nⓉ\n(\nTable of right ascents and apparent declinations of Southern stars enclosed by the Tropic of Capricorn ...\n)\n(1756)\n. Lacaille narrated in detail his journey to the Cape in\nJournal historique de voyage au Cap de Bonne-Espérance par feu M l'abbé de La Caille ...\nⓉ\n(\nHistorical travel journal at the Cape of Good Hope by the late M the Abbot of La Caille ...\n)\nwhich was published posthumously in\n1776\n. Abbé Carlier edited this publication and added a description of Lacaille's life. Two hundred years later, R Raven-Hart translated this work into English and it was published as\nTravels at the Cape,\n1751\n-\n53\n: an annotated translation of 'Journal historique du voyage fait au Cap de Bonne-Espérance ...'\n(1976)\n.\nIn\n1751\n, while in the Cape, he made some observations of the Moon. Later, when put together with the observations carried out by\nJérôme Lalande\nin Berlin at the same time, they allowed the astronomer to determine the lunar parallax. In\n1752\n, he performed a measure of the arc of the meridian between Klipfontein and Cape Town. His results were slightly anomalous, suggesting that the earth was slightly pear-shaped. Ian Glass writes\n[\n7\n]\n:-\nAided by slaves, he laid out a precise baseline of\n12605\nmetres length employing measuring rods brought from Paris. This was used to calibrate the baseline of two large triangles with vertices at his observatory in Cape Town and near the present village of Aurora. The latitudes of the end stations were measured using a zenith sector. The radius of the earth at\n33\ndegrees south was found to be comparable to that at\n45\ndegrees north in France, implying that the planet was somewhat pear-shaped.\nSir George Everest explained in\n1821\nthat Lacaille was in error due to the gravitational attraction of the nearby mountains, particularly Table Mountain. Sir Thomas Mclear later revised this measure between\n1838\nand\n1847\nand was able to confirm that the error was not due to measurement errors by Lacaille for his baseline and latitudes were remarkably accurate.\nAbbé Lacaille came back to Paris on\n28\nJune\n1754\nand continued his research. He created a method to calculate the orbits of comets, he studied astronomical refraction and he published ephemerides and logarithmic tables, among other things. In\n1757\n, he published\nAstronomiae Fundamenta\nⓉ\n(\nFundamental astronomy\n)\n, a catalogue of the\n400\nbrightest stars that was far superior to any of its predecessors. It is of note that Lacaille did not sell the\nAstronomiae Fundamenta\nⓉ\n(\nFundamental astronomy\n)\ncommercially, but distributed copies to those interested, paying for the expenses himself. In\n1758\n, he published a set of solar tables that took planetary perturbations into account for the first time. In\n1761\n, he observed Venus's passage in front of the Sun. Since the Observatory at Collège Mazarin was not ideal for it, Lacaille went to Carrières, near Charenton, along other astronomers. He was elected a member of the Science Academies of St Petersburg, Berlin, Stockholm, London, Göttingen and Bologna.\nWe mentioned above Lacaille correspondence with\nBradley\nbut he was certainly not the only astronomer with whom Lacaille corresponded. Between\n1757\nand\n1761\nhe exchanged thirteen letters with\nTobias Mayer\n[\n15\n]\n:-\nFour major topics are addressed : astronomical refraction, the return of\nHalley\n's comet in\n1759\n, the determination of terrestrial longitudes by means of Lunar distances and Venus's passage across the Solar disc on the\n6\nth of July\n1761\n. The first topic dominants, turning out to be a particularly thorny issue. A disagreement concerning the corrections of refraction predicted by both astronomers leads them into a heated debate, in which each one defends stoutly his own observation instrument while casting suspicion on the instrument of the other. In this case\nTobias Mayer\nwas right; Lacaille never came to realise that the graduation of his sextant, although carefully verified, was defective.\nLacaille continued working until his death at Collège Mazarin in\n1762\ndue to a fatal attack of the gout certainly made worse due to over-work. He was\n49\nyears old and had not published most of his observations. It was not until Francis Baily produced a catalogue that was published by the British Association in\n1847\nthat all of Lacaille's observations became known. He is buried in the chapel of the Collège Mazarin.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Jacques Cassini",
    "Cassini de Thury",
    "Dominique Cassini",
    "Jean Picard",
    "James Bradley",
    "Cassini",
    "Newton",
    "Académie des Sciences",
    "Descartes",
    "Pierre Varignon",
    "Bradley",
    "Academy of Sciences",
    "Academy",
    "Jean d'Alembert",
    "Halley",
    "Jérôme Lalande",
    "Tobias Mayer"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}