{
  "nome_completo": "Nicolaus Copernicus",
  "nome_curto": "Nicolaus Copernicus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Copernicus/",
  "data_nascimento": "19 February 1473",
  "local_nascimento": "Toruń, Poland",
  "data_morte": "24 May 1543",
  "local_morte": "Frauenburg (now Frombork), Poland",
  "summary": "Copernicus was a Polish astronomer and mathematician whose theory that the Earth moved around the Sun profoundly altered later workers' view of the universe, but was rejected by the Catholic church.",
  "biografia": "Nicolaus Copernicus\nis the Latin version of the famous astronomer's name which he chose later in his life. The original form of his name was Mikolaj Kopernik or Nicolaus Koppernigk but we shall use Copernicus throughout this article. His father, also called Nicolaus Koppernigk, had lived in Kraków before moving to Toruń where he set up a business trading in copper. He was also interested in local politics and became a civic leader in Toruń and a magistrate. Nicolaus Koppernigk married Barbara Watzenrode, who came from a well off family from Toruń, in about\n1463\n. They moved into a house in St Anne's Street in Toruń, but they also had a summer residence with vineyards out of town. Nicolaus and Barbara Koppernigk had four children, two sons and two daughters, of whom Nicolaus Copernicus was the youngest.\nYou can see a picture of the house in which Copernicus was born at\nTHIS LINK\n.\nWhen young Nicolaus was ten years old his father died. His uncle Lucas Watzenrode, who was a canon at Frauenburg Cathedral, became guardian to Nicolaus and Barbara Koppernigk's four children.\nYou can see a picture of Lucas Watzenrode at\nTHIS LINK\n.\nNicolaus and his brother Andreas remained in Toruń, continuing their elementary education there. In\n1488\nNicolaus was sent by his uncle to the cathedral school of Włocławek where he received a good standard humanist education. After three years of study at Włocławek he entered the University of Kraków\n(\nsituated in what was then the capital of Poland\n)\n. By this time Lucas Watzenrode was Bishop of Ermland and he envisaged a church career for both of his nephews. Andreas, Nicolaus's brother, entered the University of Kraków at the same time, and both their names appear on the matriculation records of\n1491\n-\n92\n.\nUniversity education at Kraków was, Copernicus later wrote, a vital factor in everything that he went on to achieve. There he studied Latin, mathematics, astronomy, geography and philosophy. He learnt his astronomy from\nTractatus de Sphaera\nby\nJohannes de Sacrobosco\nwritten in\n1220\n. One should not think, however, that the astronomy courses which Copernicus studied were scientific courses in the modern sense. Rather they were mathematics courses which introduced\nAristotle\nand\nPtolemy\n's view of the universe so that students could understand the calendar, calculate the dates of holy days, and also have skills that would enable those who would follow a more practical profession to navigate at sea. Also taught as a major part of astronomy was what today we would call astrology, teaching students to calculate horoscopes of people from the exact time of their birth.\nWhile a student in Kraków, Copernicus purchased a copy of the Latin translation of\nEuclid\n's\nElements\npublished in Venice in\n1482\n, a copy of the second edition of the\nAlfonsine Tables\n(\nwhich gives planetary theory and eclipses\n)\nprinted in Venice in\n1492\n, and\nRegiomontanus\n's\nTables of Directions\n(\na work on spherical astronomy\n)\npublished in Augsburg in\n1490\n. Remarkably Copernicus's copies of these works, signed by him, are still preserved.\nIt was while he was a student at Kraków that Copernicus began to use this Latin version of his name rather than Kopernik or Koppernigk. He returned to Toruń after four years of study at Kraków but, as was common at the time, did not formally graduate with a degree. His uncle Lucas Watzenrode was still determined that Copernicus should have a career in the Church and indeed this was a profession which would allow security for someone wanting to pursue leaning. So that he might have the necessary qualifications Copernicus decided to go to the University of Bologna to take a degree in canon law. In the autumn of\n1496\nhe travelled to Italy, entering the University of Bologna on\n19\nOctober\n1496\n, to start three years of study. As a native German speaker he joined the \"German Nation of Bologna University\". Each student contributed to the \"German Nation\" an amount they could afford and the small contribution that Copernicus made indicates his poor financial position at that time.\nWhile he was there his uncle put his name forward for the position of canon at Frauenburg Cathedral. On\n20\nOctober\n1497\n, while in Bologna, Copernicus received official notification of his appointment as a canon and of the comfortable income he would receive without having to return to carry out any duties. At Bologna University Copernicus studied Greek, mathematics and astronomy in addition to his official course of canon law. He rented rooms at the house of the astronomy professor Domenico Maria de Novara and began to undertake research with him, assisting him in making observations. On\n9\nMarch\n1497\nhe observed the Moon eclipse the star Aldebaran.\nIn\n1500\nCopernicus visited Rome, as all Christians were strongly encouraged to do to celebrate the great jubilee, and he stayed there for a year lecturing to scholars on mathematics and astronomy. While in Rome he observed an eclipse of the Moon which took place on\n6\nNovember\n1500\n. He returned to Frauenburg\n(\nalso known as Frombork\n)\nin the spring of\n1501\nand was officially installed as a canon of the Ermland Chapter on\n27\nJuly. He had not completed his degree in canon law at Bologna so he requested his uncle that he be allowed to return to Italy both to take a law degree and to study medicine. Copernicus was granted leave on\n27\nJuly\n1501\n[\n13\n]\n:-\n... principally because Nicolaus promised to study medicine, and as a helpful physician would some day advise our most reverend bishop and also the members of the Chapter.\nAs this quotation indicates, the Cathedral Chapter liked his proposal to study medicine and provided the necessary funds. He set off again for Italy, his time going to Padua. Copernicus had another reason to return to Italy, which he almost certainly did not disclose, and that was to continue his studies of astronomy.\nPadua was famous for its medical school and while he was there Copernicus studied both medicine and astronomy. At that time astronomy was essentially astrology and, as such, considered relevant to medicine since physicians made use of astrology. In the spring of\n1503\nhe decided formally to obtain his doctorate in Canon Law, but he did not return to Bologna but rather took the degree at the University of Ferrara. After receiving his doctorate, Copernicus stayed in Ferrara for a few months before returning to Padua to continue his studies of medicine. There is no record that he ever graduated from Padua.\nWhen he returned to his native land, Copernicus was again granted leave from his official duties as a canon in the Ermland Chapter at Frauenburg. This was allow him to be physician to his maternal uncle Lucas Watzenrode, the Bishop of Ermland, but he carried out far more duties for his uncle than medical ones becoming essentially his private secretary and personal advisor. For about five years he undertook these duties and during this period he lived at Heilsberg Castle, a few miles from Frauenburg, the official residence of the Bishop of Ermland.\nIn\n1509\nCopernicus published a work, which was properly printed, giving Latin translations of Greek poetry by the obscure poet Theophylactus Simocattes. While accompanying his uncle on a visit to Kraków, he gave a manuscript of the poetry book to a publisher friend there. Lucas Watzenrode died in\n1512\nand following this Copernicus resumed his duties as canon in the Ermland Chapter at Frauenburg. He now had more time than before to devote to his study of astronomy, having an observatory in the rooms in which he lived in one of the towers in the town's fortifications.\nYou can see a picture of Copernicus's observatory in Frauenburg at\nTHIS LINK\n.\nAround\n1514\nhe distributed a little book, not printed but hand written, to a few of his friends who knew that he was the author even though no author is named on the title page. This book, usually called the\nLittle Commentary\n, set out Copernicus's theory of a universe with the sun at its centre. The\nLittle Commentary\nis a fascinating document. It contains seven axioms which Copernicus gives, not in the sense that they are self evident, but in the sense that he will base his conclusions on these axioms and nothing else; see\n[\n79\n]\n. What are the axioms? Let us state them:\nThere is no one centre in the universe\n.\nThe Earth's centre is not the centre of the universe\n.\nThe centre of the universe is near the sun\n.\nThe distance from the Earth to the sun is imperceptible compared with the distance to the stars\n.\nThe rotation of the Earth accounts for the apparent daily rotation of the stars\n.\nThe apparent annual cycle of movements of the sun is caused by the Earth revolving round it\n.\nThe apparent retrograde motion of the planets is caused by the motion of the Earth from which one observes\n.\nSome have noted that\n2\n,\n4\n,\n5\n, and\n7\ncan be deduced from\n3\nand\n6\nbut it was never Copernicus's aim to give a minimal set of axioms. The most remarkable of the axioms is\n7\n, for although earlier scholars had claimed that the Earth moved, some claiming that it revolved round the sun, nobody before Copernicus appears to have correctly explained the retrograde motion of the outer planets. Even when he wrote his\nLittle Commentary\nCopernicus was planning to write a major work, for he wrote in it\n(\nsee\n[\n77\n]\n)\n:-\nHere, for the sake of brevity, I have thought it desirable to omit the mathematical demonstrations intended for my larger work.\nIt is likely that he wrote the\nLittle Commentary\nin\n1514\nand began writing his major work\nDe revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nin the following year.\nGiven Copernicus's nature it is clear that he would have liked to have lived a quiet life at Frauenburg, carrying out his\n(\nrelatively few\n)\nduties conscientiously and devoting all his spare time to observing, developing his theories of the universe, and writing\nDe revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n. It is equally clear that his fame as an astronomer was well known for when the Fifth Lateran Council decided to improve the calendar, which was known to be out of phase with the seasons, the Pope appealed to experts for advice in\n1514\n, one of these experts was Copernicus. Many experts went to Rome to advise the Council, but Copernicus chose to respond by letter. He did not wish to contribute more to the discussions on the calendar since he felt that the motions of the heavenly bodies was still not understood with sufficient precision.\nThe peace which Copernicus wished, however, was not easy to find in a period of frequent wars. The fortifications of Frauenburg that formed Copernicus's home had been built to protect the town which had been captured by various opposing groups over the years. In\n1516\nCopernicus was given the task of administering the districts of Allenstein\n(\nalso known as Olsztyn\n)\nand Mehlsack. He lived for four years in Allenstein Castle while carrying out these administrative duties.\nYou can see a picture of Allenstein Castle where Copernicus lived at\nTHIS LINK\n.\nAlways keen to make observations, Copernicus returned to his home/observatory in Frauenburg whenever there was a reason to attend a meeting or consult with the other canons, always taking the opportunity to further his researches. However when war broke out between Poland and the Teutonic Knights towards the end of\n1519\nCopernicus was back in Frauenburg. After a period of war, Copernicus was sent to participate in peace talks in Braunsberg as one of a two man delegation representing the Bishop of Ermland. The peace talks failed and the war continued. Frauenburg came under siege but Copernicus continued making his observations even at this desperate time. By the autumn of\n1520\nCopernicus was back living in Allenstein Castle and had to organise its defence against attacking forces. The castle resisted the attack and by\n1521\nan uneasy peace had returned.\nAs a reward for his defence of Allenstein, Copernicus was appointed Commissar of Ermland and given the task of rebuilding the district after the war. His close friend, Tiedemann Giese, another canon in the Chapter, was given the task of assisting him.\nYou can see a picture of Tiedemann Giese at\nTHIS LINK\n.\nAs part of the recovery plan, Copernicus put forward a scheme for the reform of the currency which he presented to the Diet of Graudenz in\n1522\n. However, despite attending the Diet and arguing strongly for his sensible proposals, they were not acted on.\nCopernicus returned to Frauenburg where his life became less eventful and he had the peace and quiet that he longed for to allow him to make observations and to work on details of his heliocentric theory. Having said that he now had the peace he wanted, one should also realise that he was undertaking his mathematical and astronomical work in isolation with no colleagues with whom to discuss matters. Although Copernicus was a canon, he had never become a priest. In fact on\n4\nFebruary\n1531\nhis bishop threatened to take away his income if he did not enter the priesthood, yet Copernicus still refused.\nA full account of Copernicus's theory was apparently slow to reach a state in which he wished to see it published, and this did not happen until the very end of Copernicus's life when he published his life's work under the title\nDe revolutionibus orbium coelestium\nⓉ\n(\nOn the revolutions of the heavenly spheres\n)\n(\nNuremberg,\n1543)\n. In fact had it not been for\nGeorg Joachim Rheticus\n, a young professor of mathematics and astronomy at the University of Wittenberg, Copernicus's masterpiece might never have been published. In May\n1539\nRheticus\narrived at Frauenburg where he spent about two years with Copernicus.\nRheticus\nwrote of his visit:-\nI heard of the fame of Master Nicolaus Copernicus in the northern lands, and although the University of Wittenberg had made me a Public Professor in those arts, nonetheless, I did not think that I should be content until I had learned something more through the instruction of that man. And I also say that I regret neither the financial expenses nor the long journey nor the remaining hardships. Yet, it seems to me that there came a great reward for these troubles, namely that I, a rather daring young man, compelled this venerable man to share his ideas sooner in this discipline with the whole world.\nWe should note that\nRheticus\nwas a Protestant, so in those troubled times of the Reformation he took somewhat of a risk visiting a Catholic stronghold. In September\n1539\nRheticus\nwent to Danzig, visiting the mayor of Danzig, who gave him some financial assistance to help publish the\nNarratio Prima\nⓉ\n(\nFirst report\n)\nor, to give it its full title\nFirst report to Johann Schöner on the Books of the Revolutions of the learned gentleman and distinguished mathematician, the Reverend Doctor Nicolaus Copernicus of Toruń, Canon of Warmia, by a certain youth devoted to mathematics\n. The publication of this work encouraged Copernicus to publish the full mathematical details of his theory which he had promised\n27\nyears earlier. Swerdlow writes:-\nCopernicus could not have asked for a more erudite, elegant, and enthusiastic introduction of his new astronomy to the world of good letters; indeed to this day the \"Narratio Prima\" remains the best introduction to Copernicus's work.\nIn his\nFirst Report\nRheticus\nwrote about Copernicus's way of working\n(\nsee\n[\n80\n]\n)\n:-\n... my teacher always had before his eyes the observations of all ages together with his own, assembled in order as in catalogues; then when some conclusion must be drawn or contribution made to the science and its principles, he proceeds from the earliest observations to his own, seeking the mutual relationship which harmonizes them all; the results thus obtained by correct inference under the guidance of Urania he then compares with the hypothesis of\nPtolemy\nand the ancients; and having made a most careful examination of these hypotheses, he finds that astronomical proof requires their rejection; he assumes new hypotheses, not indeed without divine inspiration and the favour of the gods; by applying mathematics, he geometrically establishes the conclusions which can be drawn from them by correct inference; he then harmonizes the ancient observations and his own with the hypotheses which he has adopted; and after performing all these operations he finally writes down the laws of astronomy ...\nWhile living with Copernicus,\nRheticus\nwrote to several people reporting on the progress Copernicus was making. For example on\n2\nJune\n1541\nRheticus\nwrote that Copernicus\n[\n80\n]\n:-\n... is enjoying quite good health and is writing a great deal ...\nwhile he wrote that on\n9\nJune Copernicus\n[\n80\n]\n:-\n... had finally overcome his prolonged reluctance to release his volume for publication.\nBy\n29\nAugust\nDe revolutionibus orbium coelestium\nⓉ\n(\nOn the revolutions of the heavenly spheres\n)\nwas ready for the printer.\nRheticus\ntook the manuscript with him when he returned to his teaching duties at Wittenberg, and gave it the printer Johann Petreius in Nürnberg. This was a leading centre for printing and Petreius was the best printer in town. However, since he was unable to stay to supervise the printing he asked Andreas Osiander, a Lutheran theologian with considerable experience of printing mathematical texts, to undertake the task. What Osiander did was to write a letter to the reader, inserted in place of Copernicus's original Preface following the title page, in which he claimed that the results of the book were not intended as the truth, rather that they merely presented a simpler way to calculate the positions of the heavenly bodies. The letter was unsigned and the true author of the letter was not revealed publicly until\nKepler\ndid so\n50\nyears later. Osiander also subtly changed the title to make it appear less like a claim of the real world. Some are appalled at this gigantic piece of deception by Osiander, as\nRheticus\nwas at the time, others feel that it was only because of Osiander's Preface that Copernicus's work was read and not immediately condemned.\nIn\nDe revolutionibus\nⓉ\n(\nOn the revolutions of the heavenly spheres\n)\nCopernicus states several reasons why it is logical that the sun would be at the centre of the universe:-\nAt the middle of all things lies the sun. As the location of this luminary in the cosmos, that most beautiful temple, would there be any other place or any better place than the centre, from which it can light up everything at the same time? Hence the sun is not inappropriately called by some the lamp of the universe, by others its mind, and by others its ruler.\nCopernicus's\ncosmology\nplaced a motionless sun not at the centre of the universe, but close to the centre, and also involved giving several distinct motions to the Earth. The problem that Copernicus faced was that he assumed all motion was circular so, like\nPtolemy\n, was forced into using epicycles\n(\nsee for example\n[\n78\n]\n)\n. It was consequently considered implausible by the most of his contemporaries, and by most astronomers and natural philosophers until the middle of the seventeenth century. In the intended Preface of\nDe revolutionibus orbium coelestium\nⓉ\n(\nOn the revolutions of the heavenly spheres\n)\nCopernicus showed that he was fully aware of the criticisms that his work would attract:-\nPerhaps there will be babblers who, although completely ignorant of mathematics, nevertheless take it upon themselves to pass judgement on mathematical questions and, badly distorting some passages of Scripture to their purpose, will dare find fault with my undertaking and censure it. I disregard them even to the extent as despising their criticism as unfounded.\nIts notable defenders included\nKepler\nand\nGalileo\nwhile theoretical evidence for the Copernican theory was provided by\nNewton\n's theory of universal gravitation around\n150\nyears later.\nCopernicus is said to have received a copy of the printed book, consisting of about\n200\npages written in Latin, for the first time on his deathbed. He died of a cerebral haemorrhage.\nBrahe\n, who did not accept Copernicus's claim that the Earth moved round the sun, nevertheless wrote:-\nThrough observations made by himself\n[\nCopernicus\n]\ndiscovered certain gaps in\nPtolemy\n, and he concluded that the hypotheses established by\nPtolemy\nadmit something unsuitable in violation of the axioms of mathematics. Moreover, he found the Alfonsine computations in disagreement with the motions of the heavens. Therefore, with wonderful intellectual acumen he established different hypotheses. He restored the science of the heavenly motions in such a way that nobody before him had a more accurate knowledge of the movements of the heavenly bodies.\nRudnicki\n[\n13\n]\ngives this appreciation of Copernicus:-\nHe was truly creative. His scientific method, though determined by the horizons of contemporary knowledge and belief, was yet ideally objective. Ethically, his actions throughout his life bear witness to the highest standards. He did good. He earned the general respect and honour of his contemporaries. For many years he served self-sacrificingly the cause of his native country. But he knew no private, domestic joys.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Johannes de Sacrobosco",
    "Aristotle",
    "Ptolemy",
    "Euclid",
    "Regiomontanus",
    "Georg Joachim Rheticus",
    "Rheticus",
    "Kepler",
    "cosmology",
    "Galileo",
    "Newton",
    "Brahe"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}