{
  "nome_completo": "Nikolai Mitrofanovich Krylov",
  "nome_curto": "Nikolai Mitrofanovich Krylov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krylov_Nikolai/",
  "data_nascimento": "29 November 1879",
  "local_nascimento": "St Petersburg, Russia",
  "data_morte": "11 May 1955",
  "local_morte": "Moscow, USSR",
  "summary": "Nikolai Krylov was a Russian mathematician who published over 200 papers on analysis and mathematical physics.",
  "biografia": "Nikolai Mitrofanovich Krylov\ngraduated from the St Petersburg Institute of Mines in\n1902\n. He was professor there from\n1912\nuntil\n1917\nwhen he went to the Crimea to become professor at the Crimea University. He held this post until\n1922\nwhen he moved to Kiev on being appointed chairman of the mathematical physics department of the\nUkrainian  Academy of Sciences\n(\nin fact renamed the All-Ukrainian Academy of Sciences in the year before Krylov was appointed\n)\n.\nHe worked mainly on interpolation and numerical solutions to\ndifferential equations\n, where he obtained very effective formulas for the errors. He also applied his methods to non-linear oscillatory problems in\n1932\nand, in so doing, laid the foundations for non-linear mechanics.\nKrylov published over\n200\npapers on analysis and mathematical physics. For example he published\nOn the approximate solution of the integro-differential equations of mathematical physics\n(1926)\n, and\nApproximation of periodic solutions of differential equations\nin French in\n1929\n. With his collaborator and former student\nN N Bogolyubov\n, he published\nOn Rayleigh's principle in the theory of differential equations of mathematical physics and on Euler's method in calculus of variations\n(1927\n-\n8)\nand\nOn the quasiperiodic solutions of the equations of the nonlinear mechanics\n. This last mentioned paper was also written in French and published in\n1934\n. The most famous publication of Krylov and\nBogolyubov\nis their book\nIntroduction to nonlinear mechanics\n, published in Kiev in\n1937\n. This book was translated into English by\nSolomon Lefschetz\nand published by\nPrinceton University Press\nin\n1943\n.\nLevinson\nwrites in a review:-\nThe treatment is so oriented as to be readily available to the engineer or physicist. In fact, rigor is entirely subordinated to the objective of making the material as widely available as possible. Examples of physical systems are given which lead to the type of equation considered in the monograph. Moreover, general statements of methods for solving equations are illustrated by the explicit solution of examples.\nBefore publishing this book with\nBogolyubov\n, in\n1931\nKrylov had published the important monograph\nLes méthodes de solution approchée des problèmes de la physique mathématique\n.\nAll of Krylov's works emphasise computational aspects, motivations, and applications. In\n[\n8\n]\nLucka discusses work by on the Ritz method of convergence:-\nWe present the fundamental results of the works of N M Krylov and\nN N Bogolyubov\ndevoted to the establishment of effective error estimates for the Ritz method, the Bubnov-Galerkin method and the least squares method in connection with self-adjoint differential equations.\nIn\n1939\nKrylov and\nBogolyubov\npublished\nSur les équations de Focker-Planck déduites dans la théorie des perturbations à l'aide d'une méthode basée sur les propriétés spectrales de l'hamiltonien perturbateur\n(\nApplication à la mécanique classique et à la mécanique quantique\n)\n. This paper began their work which established the theory of perturbations and transitions of state on a new and uniform basis, both in classical mechanics and quantum mechanics.\nFinally let us mention three papers published by Krylov in\n1947\n. These are\nSur une propriété des suites particulières de nombres premiers impairs\npublished by the\nAcademy of Sciences\nin Paris,\nSur les complexes de Galois\nand\nSur les quaternions de W R Hamilton et la notion de la monogénéité\nboth published by the USSR Academy of Sciences\n(\nnow the\nRussian Academy of Sciences\n)\n.\nIn\n1928\nKrylov was elected to the\nUSSR Academy of Sciences\nand in\n1939\nhe became an honoured scientist of the Ukrainian Soviet Socialist Republic.",
  "matematicos_citados_na_biografia": [
    "Ukrainian  Academy of Sciences",
    "differential equations",
    "N N Bogolyubov",
    "Bogolyubov",
    "Solomon Lefschetz",
    "Levinson",
    "Academy of Sciences",
    "Russian Academy of Sciences",
    "USSR Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}