{
  "nome_completo": "Nikolai Evgrafovich Kochin",
  "nome_curto": "Nikolai Evgrafovich Kochin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kochin/",
  "data_nascimento": "6 May 1901",
  "local_nascimento": "St Petersburg, Russia",
  "data_morte": "31 December 1944",
  "local_morte": "Moscow, USSR",
  "summary": "Nikolai Kochin was a Russian mathematician who was one of the founders of modern dynamic meteorology.",
  "biografia": "First let us note that we have given Kochin's birthday as\n6\nMay\n1901\n. This was the date by the calendar in use in Russia when he was born. When Russia adopted the Gregorian calendar in\n1918\n, his birthday became\n19\nMay and, as a consequence, his day of birth is sometimes given as\n19\nMay\n1901\n.\nNikolai Evgrafovich Kochin\n's father, Evgraf Kochin, was a clerk in a textile factory. The family was a large one and Evgraf was the only breadwinner but he tried to give all his children the best upbringing and education that he could possible manage. When Nikolai Evgrafovich was still very young he already showed his talent for mathematics by quickly learning basic arithmetic. At junior school he entered straight into the second class and his teachers soon realised that he was an exceptionally talented child.  After completing his primary education, he entered the\n1\nst\nGymnasium\nin St Petersburg and his performance in almost all his subjects received the top grade\n[\n13\n]\n:-\nKochin's teachers were impressed by his remarkable capabilities and his brightness and speed of thought.\nThe only exceptions to this top performance were in singing and drawing where he performed less well. Mathematics, however, was his best subject and he gained a reputation for being infallible in that subject. Kochin had an older sister who began to study mathematics at the Bestuzhev Institute for Women in St Petersburg. She had purchased university texts on geometry and on analysis and Kochin read these books while he was at the high school. He got great pleasure in reading these books.\nIn early\n1917\n, while Kochin was nearing the end of his secondary education, the Russian Revolution broke out in Petrograd.\n[\nThe city of his birth, St Petersburg, was named Petrograd at this time.\n]\nThere had been food shortages, strikes and military set-backs in World War I which led up to the February Revolution. A Soviet administration was set up in the city but in October of\n1917\nthe Bolshevik party led by Lenin took control. The factory in whose office Evgraf Kochin worked closed amid the chaos and the Kochin family, left without any income, could not obtain sufficient food. Conditions were extremely difficult and, starved of food, the children became ill. Kochin, however, was able to complete his school education in\n1918\nand in the same  year entered Petrograd University which had been renamed\n1\nst  Petrograd State University shortly before he began his studies. In\n1919\n, Kochin's father Evgraf died and in the summer of that year Kochin was drafted into the Red Army. A White Army led by Nikolai Nikolayevich Yudenich marched from Estonia and attempted to capture Petrograd. Kochin was part of the Red Army, led by Trotsky, that defeated this White Army at Gatchina near Petrograd. In November\n1919\nKochin was part of the Red Army that captured Yamburg, about\n100\nkm south west of Petrograd, following the withdrawal of Yudenich's White Army from the town. Kochin enlisted as a cadet in the Artillery Academy in Petrograd in\n1920\n. This Academy had been set up in\n1918\nfollowing the Revolution to train soldiers to fight for the Bolsheviks. By\n1921\nthe Bolsheviks has essentially won the Civil War but there was a rebellion by Russian sailors, soldiers and civilians which began at the naval fortress of Kronstadt. Kochin was sent with the Bolshevik army to put down the Kronstadt rebellion. In April\n1922\n, with stability returning to the country, Kochin was discharged from the army.\nOnce he left the army Kochin joined\nAleksandr Aleksandrovich Friedmann\n's Mathematics Department in the Main Geophysical Observatory in Petrograd and, at the same time, continued his studies in the Mathematics Department of the Physics and Mathematics Faculty of Petrograd University. The authors of\n[\n5\n]\nwrite:-\nAll research workers received from\nFriedmann\ntopics for independent investigation; the scientific seminar was quite active. Kochin was hired as a computation assistant, but he was not given any routine computation tasks\n(\nexcept that he was once involved in a group task of supplementing ballistic charts\n)\n.\nFriedmann\noffered him a topic - the study of a rotating cyclone. Soon Nikolai Kochin solved two problems formulated by\nFriedmann\nin his Master's dissertation 'The Hydrodynamics of a Compressible Fluid'.\nNote that the Russian Master's Degree at this time was equivalent to the modern Ph.D. Kochin graduated from the University in\n1923\n. He was appointed to Leningrad State University in\n1924\n(\nPetrograd was renamed Leningrad in\n1924)\nand taught mathematics and mechanics there until\n1934\n. It was in\n1924\nthat he began work on a topic that led to some of his most important contributions\n[\n5\n]\n:-\nGreat interest was aroused by the series of works by\nVilhelm Bjerknes\nand his son Jacob, expounding a new theory of cyclone origin and development, which brought back the idea of atmospheric fronts. A detailed review of the theory of cyclogenesis was written by O A Kostareva in\n1924\n.\nFriedmann\ngot interested in the new theory, considering it qualitatively correct, but not sufficiently substantiated mathematically. The seminar participants also reviewed works containing solutions to specific problems related to the frontal model. On\n17\nMarch\n1924\nKochin gave a talk on A Defant's article 'On the theory of the polar front'. Soon Kochin's article was published, specifying Defant's solution. This article was the start of a major series of works by Kochin, resulting in the creation of the linear theory of cyclogenesis in the early\n1930\ns.\nNote that Albert Defant\n(1884\n-\n1974)\nwas a meteorologist and oceanographer who was a professor in Innsbruck\n(1919\n-\n1926)\nand then Berlin\n(1926\n-\n1945)\n. The authors of\n[\n13\n]\nwrite that Kochin:-\n... obtained fundamental results in the theory of the general circulation of the atmosphere. He was the first to examine the influence of the friction of atmospheric air against the Earth's surface, which had previously been neglected. As was shown, this effect is important owing to the action of turbulent viscosity many orders of magnitude greater than molecular viscosity. The thickness of the boundary layer on the Earth's surface, in which an important role is played by the\nCoriolis\nforce, was estimated. It turned out that this thickness is of the order of a kilometre, i.e. comparable with the thickness of the troposphere. Taking into account simplifications stemming from the relative thinness of the atmosphere, it was shown that, for a complete determination of all the elements of circulation of the atmosphere in the steady case, it is sufficient to know the temperature distribution in the air and the pressure over the Earth's surface, and appropriate computer procedures were developed. One more pioneering study is the wet cyclone model the constructed. These studies laid the foundation for subsequent research in meteorology.\nAs an undergraduate Kochin had already met\nPelageia Polubarinova\nand the two found that they had much in common, as both were undertaking research on meteorology, gas dynamics and shock waves in compressible fluids. In\n1925\nPelageia Polubarinova\nand Kochin married by simply registering the event. This was all that was necessary in Russia following the revolution. Nikolai Evgrafovich Kochin and\nPelageia Kochina\nhad two daughters Ira and Nina following their marriage.\nFriedmann\ndied in September\n1925\nand, after this, Kochin took over his role as the leading Russian meteorologist. In\n1932\nhe began working at the Physics and Mathematics Institute of the\nUSSR Academy of Sciences\nin Leningrad. However, some years later, the Institute was split into two Institutes, namely the Physics Institute and the Mathematics Institute. At this time Kochin worked in the Department of Mechanics and this resulted in his move to Moscow where the\nV A Steklov\nMathematics Institute was based. Kochin became a professor at Moscow University in\n1935\nand worked there for the rest of his life. At Moscow University he gave many courses such as \"Hydrodynamic Theory\", \"Dynamic meteorology\", \"Problems of continuum mechanics\", \"On waves at the interface between two fluids,\" \"Problems of gas dynamics\", \"On the stability of fluid motion\", and \"On the wave resistance of bodies\".\nFrom\n1935\nto\n1938\nhe also worked at the Central Aerohydrodynamics Institute in Moscow where a group of scientists, led by\nSergei Alekseevich Chaplygin\n, were investigating aviation problems and problems involving the motion of ships. Kochin was awarded a Doctorate in Physics and Mathematical Sciences in\n1935\n(\nequivalent in standard to the D.Sc. or\nhabilitation\n)\n. In\n1938\nhe became Head of the Department of Fluid Mechanics at Moscow State University, a position he held for the rest of his life. He was appointed as Head of the Department of Mechanics of the\nUSSR Academy of Sciences\nin\n1939\n, again a position he held until his death.\nWorld War II began in\n1939\nbut initially this had little effect on the scientists in Moscow. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Moscow and Kochin was able to continue his high work rate. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. The German armies reached the outskirts of Moscow in late\n1941\nand Kochin's wife and two daughters Ira and Nina were evacuated to Kazan. Kochin, however, remained in Moscow carrying out military research. By\n1943\nthe German army had suffered defeats by Soviet troops and Moscow was safe enough for\nKochina\nto return. This she did, but Kochin became ill and died before the end of the war. At the time of his death he had been in the middle of delivering lecture courses and\nKochina\ntook over the courses and completed giving them.\nAs we have seen, Kochin's research was on meteorology, gas dynamics and shock waves in compressible fluids. He gave the solution to the problem of small amplitude waves on the surface of an uncompressed liquid in the paper\nTowards a Theory of Cauchy-Poisson Waves\n(\nRussian\n)\nin\n1935\n. He also worked on the pitch and roll of ships and he presented a new theory in\nTheory of Waves Created by the Vibration of a Body Under a Free Surface of Heavy Uncompressed Liquid\n(\nRussian\n)\n(1940)\n. In aerodynamics he introduced formulae for aerodynamic force and for the distribution of pressure in papers such as\nOn the Wave Resistance and Lifting Strength of Bodies Submerged in Liquid\n(\nRussian\n)\n(1937)\n. His papers on theoretical mechanics,\nTorsional oscillations of crankshafts\n,\nBending of a kite string under the action of the wind\n,\nStability of Kármán vortex chains\n,\nFreeing of mechanical systems from constraints\n, and\nCalculation of critical speeds of a shaft\nare discussed in\n[\n9\n]\n.\nHe wrote textbooks on hydromechanics and vector analysis. For example, he wrote\nIntroduction to theoretical fluid mechanics\n(1932)\nand co-authored\nTheoretical Mechanics\n(1932)\n. The following quote which comes from\n[\n13\n]\nhas been slightly modified to add a couple of details:-\nHis enormous contribution to meteorology was summed up in the two-volume work 'Dynamic Meteorology'\n(1935)\n. He wrote the textbook 'Vector Calculus and the Principles of Tensor Calculus', many editions of which have been published, and finally, together with Ilia Afanasevich Kibel\n(1904\n-\n1970)\nand Nikolai Vladimirovich Roze, wrote the outstanding two-volume course 'Theoretical Fluid Mechanics', which has been, and continues to be, used to teach many generations of Russian mechanics.\nWe note that the first edition of\nVector Calculus and the Principles of Tensor Calculus\nwas titled\nVector Calculus\nand published in\n1927\n. Kochin also edited the works of Ivan Aleksandrovich Lappo-Danilevskii\n(1896\n-\n1931)\n, who was an expert on applying matrix theory to differential equations, and of\nAleksandr Mikhailovich Lyapunov\n.\nKochin was an enthusiastic member of the\nMoscow Mathematical Society\nand served as its secretary from\n1938\nto\n1940\n. In\n1939\nhe was elected as a full member of the\nUSSR Academy of Sciences\n, a most unusual event since he had not been first elected as a corresponding member. In\n1927\nhe was awarded a prize by Narcompros\n(\nthe People's Committee for Education\n)\nand in\n1933\nhe received a prize from the Main Geophysical Observatory. The authors of\n[\n13\n]\nwrite:-\nKochin's vast output during his short life is a source of wonder and admiration. The results he obtained and the projected trends determined development for many years ahead, and continue to determine to this day, the face of fluid dynamics and meteorology.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Aleksandr Aleksandrovich Friedmann",
    "Friedmann",
    "Vilhelm Bjerknes",
    "Coriolis",
    "Pelageia Polubarinova",
    "Pelageia Kochina",
    "USSR Academy of Sciences",
    "V A Steklov",
    "Sergei Alekseevich Chaplygin",
    "habilitation",
    "Kochina",
    "Aleksandr Mikhailovich Lyapunov",
    "Moscow Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}