{
  "nome_completo": "Nikolai Vladimirovich Efimov",
  "nome_curto": "Nikolai Vladimirovich Efimov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Efimov/",
  "data_nascimento": "31 May 1910",
  "local_nascimento": "Orenburg, Russia",
  "data_morte": "16 October 1982",
  "local_morte": "Moscow, Russia",
  "summary": "Nikolai Vladimirovich Efimov was a Russian mathematician. He worked on the geometry of surfaces of negative curvature.",
  "biografia": "Nikolai Vladimirovich Efimov\n's father, Vladimir Efimov, was a clerk. Nikolai Vladimirovich was born in Orenburg, a city in the south of Russia, near the Kazakhstan border, north of the Caspian Sea but grew up in Rostov-na-Donu, about\n30\nkilometres from the north east end of the Sea of Azov. He was educated in Rostov-na-Donu, graduating from the high school there in\n1927\n. After leaving school he was employed constructing a depot at the Kamenolomni railway station on the north side of Rostov-na-Donu. Leaving work on this construction site, his next job was as a metal worker in a factory making agricultural machinery in Rostov-na-Donu. One should not get the impression that these jobs were long term, rather they were just to fill in before he entered the Mathematics and Physics section of the Faculty of Education of Rostov University in\n1928\n.\nEfimov graduated in\n1931\n, having completed the four-year undergraduate course in three years. His performance had been outstanding and merited the award of a postgraduate scholarship which funded him to undertake research at Moscow State University.\nBenjamin Fedorovich Kagan\nheld the chair of geometry at Moscow State University at this time and he was running a research seminar on vector and tensor analysis\n[\n6\n]\n:-\nFrom then on, for almost half a century, Efimov devoted all his energies to geometry, mainly to the qualitative theory of surfaces, and he became one of the founders of the modern aspect of that branch of geometry.\nIn\n1934\nEfimov graduated with a Candidate's degree\n(\nequivalent to a Ph.D.\n)\nand began work at Voronezh State University as a lecturer. However, he continued to work on his geometry research with the aim of submitting it for a doctorate\n(\nequivalent to a D.Sc. or\nhabilitation\n)\n. The year\n1934\nwhen Efimov graduated, was highly significant for geometry research in Russia, for late in that year\nStefan Cohn-Vossen\nemigrated there to escape from the Nazis in Germany. Under his influence a school of \"geometry in the large\" was set up in Moscow and in Leningrad and Efimov's meeting with\nCohn-Vossen\n, who had worked closely with\nHilbert\n, was a major influence on setting the direction of his future research. In\n1940\nEfimov was awarded a doctorate from Moscow State University after submitting the thesis\nThe curving of surfaces with parabolic points\n. During the years he had been working towards his doctorate, he was publishing an impressive collection of papers, in fact his first seven papers were published between\n1933\nand\n1940\n. These papers\n[\n8\n]\n:-\n... concerned an application of tensor methods to the study of various classes of surfaces and the nets of lines in them. In these papers he studied the geometric properties of geodesies, conjugates and other nets; he obtained tensorial criteria for certain classes of surfaces\n(\nincluding quadrics\n)\n, and jointly with Dubnov he found an invariant characterization of the metric of a\nLie\nsurface.\nDubnov, mentioned in this quote, is Yakov Semenovich Dubnov. Dubnov had also been a student of Kagan and Efimov worked closely with him during these years. Although World War II started in September\n1939\nwith the German and Russian invasion of Poland, this had little effect in Voronezh, about\n500\nkm south of Moscow. However, on\n22\nJune\n1941\nthe German armies invaded their former ally pushing rapidly east into Soviet lands. They advanced along a broad front from the Baltic to the Black Sea and, in August\n1941\n, Efimov and\n80\nstudents from Voronezh State University enlisted as volunteers in the Russian army. In November\n1941\nhe was ordered to go to the Voronezh Aviation Institute and assist the war effort by taking the position of head of the Theoretical Mechanics Department there. Voronezh was by this time close to the front line and far too dangerous a place for research establishments, so the Soviets had relocated the Voronezh Aviation Institute in Tashkent, far away from possible attack. Efimov worked at the Voronezh Aviation Institute in Tashkent until\n1943\nwhen he went to Moscow to head the Department of Higher Mathematics at the Moscow State Forest University\n(\nit was at that time called the Moscow Institute of Forestry\n)\n. In fact\n1943\nwas the earliest that Moscow began to operate again as normal after the German attack on the city in late\n1941\n. Although the Germans were driven back in January\n1942\n, the front line remained too close to the city to allow life to return to normal there and it was not until the second half of\n1943\nthat Moscow became totally secure.\nAlthough Efimov continued as head of the Department of Higher Mathematics at the Moscow State Forest University until\n1961\nhe had several other academic roles within the city. In\n1946\nhe was appointed as a professor in the Faculty of Physics of Moscow State University and he held this post for ten years. His association with Moscow State University did not end in\n1956\nfor in that year he became a professor in the Faculty of Mechanics and Mathematics, appointed to the chair of Mathematical Analysis. He continued to hold this chair for the rest of his life but from\n1962\nto\n1969\nhe was, in addition, dean of the Faculty of Mechanics and Mathematics\n[\n8\n]\n:-\nWhile he was Dean and with his active participation the teaching plans and programmes underwent a radical reorganization, bringing the presentation of mathematics closer to the modern state of the science and its practical requirements.\nAs well as this contribution that Efimov made to the teaching programmes of Moscow State University, we must also give an indication of his own skills as a lecturer, his research contributions, and the impressive collection of books that he wrote. First we record that the authors of\n[\n6\n]\nstate that, after his appointment to Moscow State University in\n1946\n, he:-\n... quickly earned the reputation of being one of the best lecturers there. His lectures and discourses before a student audience are always distinguished by their scientific depth, the mastery of exposition, and the attention they give to the problem of training young people.\nMany of the references listed below give detailed descriptions of Efimov's important contributions to geometry, but perhaps his achievements are best summed up by quoting from\nP S Aleksandrov\n[\n2\n]\n:-\nNikolai Vladimirovich Efimov is one of those rare geometers whose international reputation rests not so much on a series of separate results as on one really big discovery. This is that the curvature of a surface of negative curvature without singularities in three-dimensional space cannot be separated from zero, that is, necessarily takes on values of arbitrarily small modulus. The intuitive content of this result is accessible to every mathematician, for one need only look at a one-sheet hyperboloid or a hyperbolic paraboloid to see it. Efimov's result is a generalization in principle of\nHilbert\n's famous theorem that a surface of constant negative curvature in three-dimensional space cannot be without singularities. Efimov's theorem on the qualitative theory of surfaces ranks alongside\nHilbert\n's theorem. I recall with what enthusiasm\nHeinz Hopf\ngave his talk at the International Congress of Mathematicians in Moscow in\n1966\non the subject of Efimov's proof.\nThe theorem which\nP S Aleksandrov\nrefers to in this quote was one that Efimov became interested in while working for his doctorate but it was not until around\n1950\nthat he began to concentrate all his efforts on obtaining a solution. Only a few mathematicians have the determination shown by Efimov to spend over twelve years of their lives trying to solve a single problem but he did so and published his solution in\n1963\nin\nThe impossibility in three-dimensional Euclidean space of a complete regular surface with a negative upper bound of the Gaussian curvature\n. We must not give the impression that Efimov did not publish in the years during which he battled with his big problem for nothing would be further from the truth. For example he published five papers in\n1961\nand six papers in\n1962\nimmediately before his important\n1963\npaper.\nEfimov published many important books, some at undergraduate level, some at research monograph level. They were remarkably influential, not only in Russia but in many countries around the word where translations were published. Another indication of the worth of these books is the large number of editions that some of them went through, not just reprints with minor changes, but often editions containing a wealth of new material. One more general comment before we list a few of these books, and that is that they were all single-authored works. Many others who have written large collections of books have done so in collaboration with their colleagues, so reducing their own workload. Efimov's book with the largest number of editions is\nHigher Geometry\n(\nRussian\n)\n(1945)\n.\nArend Heyting\n, reviewing this first edition, writes:-\nThis university textbook treats mainly the foundations of geometry. ... The book is written in a clear style and meets a high standard of rigour.\nGiven\nHeyting\n's interests, the 'high standard of rigour' comment is particularly pleasing. Many Russian editions followed and by\n1978\na sixth edition was in print. An English translation of this sixth edition was made and published\n1980\n. It was also translated into other languages including Spanish and French. The next book was published in Russian in\n1948\nand a German translation appeared in\n1957\n. The German edition\nFlächenverbiegung im Grossen\n(1957)\ncollects together Efimov's early work on \"geometry in the large\" as G Y Rainich explains in a review:-\nWhen\nCohn-Vossen\nwent to Moscow in\n1936\nhe took with him, so to say, the theory of bending of surfaces. Many important papers on the subject appeared in Russia in the following years, among them Efimov's review that forms the basis of the present book\n(\nwhich to an extent brings the theory back to Germany\n)\n. ... The exposition is very clear and detailed, although complicated proofs in some cases are omitted.\nAnother teaching text was published by Efimov in\n1963\n, namely\nQuadratic forms and matrices\n(\nRussian\n)\n. This was translated into English and published with the title\nQuadratic forms and matrices. An introductory approach\n(1964)\n. The book develops the theory of quadratic forms and matrices, and considers their geometrical interpretations which it presents in a two and three dimensional setting.\nAnother teaching book, but one containing much not standard material for a work at undergraduate level, was\nLinear algebra and multidimensional geometry\n(\nRussian\n)\n(1970)\n. It was translated into English and published with the title\nLinear algebra and multidimensional geometry\n(1975)\n. J Burlak, reviewing the Russian edition, writes:-\nAlthough this may be thought of as a book on linear algebra, the treatment is so geometrical that the subject matter merges naturally into higher-dimensional analytic geometry. Thus, although applications\n(\ne.g., to rigid body dynamics and elasticity theory\n)\nare mentioned and the usual matrix theory is covered\n(\nincluding, e.g., reduction to the\nJordan\ncanonical form\n)\n, there is none of the standard material on the solution of systems of linear equations. On the other hand, the material on such topics as tensor algebra, exterior forms,\nquadric\nhypersurfaces and projective space is not often found in elementary books on linear algebra. The book is based on courses of lectures and contains enough material for courses of several kinds.\nNext Efimov published\nExterior differential forms in Euclidean space\n(\nRussian\n)\n(1971)\nin which he:-\n... gives a clear elementary treatment of the calculus of exterior differential forms in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n, leading up to a proof of\nStokes\n's theorem.\nFinally, let us mention the book\nIntroduction to the theory of exterior forms\n(\nRussian\n)\n(1977)\n.\nEfimov received many honours for his contributions including the\nLobachevsky\nMedal in\n1951\n, the Lenin Prize in\n1966\nand two orders of the Red Banner of Labour. Perhaps his greatest honour was being an invited plenary speaker at the International Congress of Mathematicians held in Moscow in August\n1966\n. He gave the plenary lecture\nHyperbolic Problems in the Theory of Surfaces\n(\nRussian\n)\n. He became a corresponding member of the\nUSSR Academy of Sciences\nin\n1979\n. He was elected a member of the Committee of the\nMoscow Mathematical Society\n, was appointed as a member of the Editorial Board of the\nUspekhi Matematicheskikh Nauk\n, and was chair of the mathematics section of the Universities' and Educational Institutes' scientific-methodological council in the Ministry of Education of the USSR.\nWe end this biography by giving two quotes which tell us something of Efimov's character and his interests outside mathematics. First we quote the authors of\n[\n6\n]\nwho, two years before Efimov's death, write:-\nA scientist with a world-famous name, Efimov is in everyday life and work an extraordinarily conscientious and an unusually modest man. His kindness, his readiness to help by word and deed, his high professional and human qualities have won him the sincere respect of all who come into contact with him. We wish him many years of successful work, good health and happiness.\nThe authors of the obituary\n[\n8\n]\nwrite:-\nAll who knew Nikolai Vladimirovich Efimov remember his joie de vivre, his exceptional kindness towards people, his thoughtfulness, and extraordinary conscientiousness and thoroughness in all his work. Association with him was always lively and interesting; he was a man of high culture, a great connoisseur and judge of the arts, especially of poetry and the theatre. Not only in his teaching, editing and administrative work, but in all his dealings with the people around him he was able to see what was important; and perhaps this feature of his character appeared particularly brightly in his mathematical research; Efimov's theorems occupy a worthy place in mathematics. Efimov was a remarkable person and a great mathematician. Those who knew him will always cherish his bright memory in their hearts.",
  "matematicos_citados_na_biografia": [
    "Benjamin Fedorovich Kagan",
    "habilitation",
    "Stefan Cohn-Vossen",
    "Cohn-Vossen",
    "Hilbert",
    "Lie",
    "P S Aleksandrov",
    "Heinz Hopf",
    "Arend Heyting",
    "Heyting",
    "Jordan",
    "quadric",
    "Stokes",
    "Lobachevsky",
    "USSR Academy of Sciences",
    "Moscow Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}