{
  "nome_completo": "Nikolai Sergeevitch Krylov",
  "nome_curto": "Nikolai Sergeevitch Krylov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Krylov_Nikolai_S/",
  "data_nascimento": "10 August 1917",
  "local_nascimento": "Ustyuzhna near Vologda, Russia",
  "data_morte": "21 June 1947",
  "local_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "summary": "Nikolay Sergeevitch Krylov was a Russian theoretical physicist who worked in classical mechanics, statistical physics and quantum mechanics.",
  "biografia": "Nikolai Sergeevitch Krylov\nentered the Department of Physics at Leningrad University in\n1934\n[\n2\n]\n:-\nEven as a student he attracted general attention by his brilliant abilities and his desire through his own efforts to get to the bottom of the problems of theoretical physics that interested him. This ability to concentrate on and to penetrate into the object of his studies characterised Krylov throughout his scientific career, which began when he was still a university student.\nKrylov graduated in\n1939\nbut even before this he had written two papers which were published in\n1940\n. These are\nOn the foundation of physical statistics\nand\nOn methods of obtaining Gibbs' distribution\n. After graduating, he continued to undertake research at Leningrad University, advised by V A Fock. He presented his candidate's thesis\nMixing processes in phase space\nwhich he defended brilliantly in July\n1941\n. Up to this time Krylov had been little affected by World War II, but in\n1941\nthe Germans invaded Russia and by September German troops were on the outskirts of Leningrad cutting the city off from the rest of Russia. The city came under constant artillery and air bombardment and Krylov was assigned air defence duties. However, he would invariably be seen reading a book while on duty. It is quite incredible how he continued research, developing his ideas on statistical mechanics, while subjected to appalling suffering from shortages of supplies. About\n660\n,\n000\npeople died in Leningrad during the siege from scurvy and starvation. The exceptionally bitter winter of\n1941\n-\n42\n, when temperatures fell to -\n40\n° C, was one of extreme hardship for Krylov but he was evacuated and was able to recover his health in time to defend his doctoral thesis in Kazan\n(\nwhere Leningrad University had moved because of the war\n)\nin the summer of\n1942\n.\nThe blockade of Leningrad was broken in January\n1943\n, but it was into\n1944\nbefore the German troops were forced back from the surroundings. Krylov certainly could not return to Leningrad so he spent time working at the scientific centres in Elabuga, Joshkar Ola, and Moscow. By the autumn of\n1944\nLeningrad was able to start the process of recovery\n(\nmuch had been destroyed by the bombardment and much of what remained was destroyed by the Germans before they retreated\n)\n. Krylov resumed his duties at senior scientist at the Physical Institute of Leningrad University. By the end of\n1946\nhis health had begun to deteriorate and after months of severe illness he died in June of the following year.\nA S Wightman wrote in the Preface to\n[\n1\n]\n:-\nKrylov's place in the history of statistical mechanics is quite special. he came after the developments in probability theory and ergodic theory of the first three decades of this century which represented the first major impact of statistical mechanics on mathematics\n(\nthe work of\nPoincaré\n,\nBirkhoff\n,\nvon Neumann\n,\nHopf\n,\nKolmogorov\n,\nKhinchin\n,\nWiener\n, ...\n)\n. He tried, and in this he was ahead of his time, to re-examine the fundamental physical issues of statistical mechanics in the light of these new mathematical insights.\nL A Bunimovich writes in a similar way in\n1987\n:-\nThe outstanding Russian physicist N S Krylov died in\n1947\nat the age of\n30\n. His works, in which he tried to re-examine the fundamental problems of statistical mechanics in the light of developments in\nergodic theory\nand\nprobability theory\n, were far ahead of his time. Some of his ideas still remain to be developed.\nIn\n1946\nKrylov began to write a monograph explaining his revolutionary ideas. We give the introduction to Krylov's monograph at\nTHIS LINK\nNote that in the introduction Krylov refers to the contents of the six chapters he intended to write. However at his death he had only completed Chapter\n1\nand most of Chapter\n2\n. Chapters\n3\nto\n6\nand part of Chapter\n2\nwere, sadly, never written.",
  "matematicos_citados_na_biografia": [
    "Poincaré",
    "Birkhoff",
    "von Neumann",
    "Hopf",
    "Kolmogorov",
    "Khinchin",
    "Wiener",
    "ergodic theory",
    "probability theory",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}