{
  "nome_completo": "Nilakantha Somayaji",
  "nome_curto": "Nilakantha",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nilakantha/",
  "data_nascimento": "14 June 1444",
  "local_nascimento": "Trikkantiyur (near Tirur), Kerala, India",
  "data_morte": "1544",
  "local_morte": "India",
  "summary": "Nilakantha was a mathematician and astronomer from South India who wrote texts on both astronomy and infinite series.",
  "biografia": "Nilakantha\nwas born into a Namputiri Brahmin family which came from South Malabar in Kerala. The Nambudiri is the main caste of Kerala. It is an orthodox caste whose members consider themselves descendants of the ancient Vedic religion.\nHe was born in a house called Kelallur which it is claimed coincides with the present Etamana in the village of Trkkantiyur near Tirur in south India. His father was Jatavedas and the family belonged to the Gargya gotra, which was a Indian caste that prohibits marriage to anyone outside the caste. The family followed the Ashvalayana sutra which was a manual of sacrificial ceremonies in the Rigveda, a collection of Vedic hymns. He worshipped the personified deity Soma who was the \"master of plants\" and the healer of disease. This explains the name Somayaji which means he was from a family qualified to conduct the Soma ritual.\nNilakantha studied astronomy and Vedanta, one of the six orthodox systems of Indian Hindu philosophy, under the teacher Ravi. He was also taught by Damodra who was the son of\nParamesvara\n.\nParamesvara\nwas a famous Indian astronomer and Damodra followed his father's teachings. This led Nilakantha also to become a follower of\nParamesvara\n. A number of texts on mathematical astronomy written by Nilakantha have survived. In all he wrote about ten treatises on astronomy.\nThe\nTantrasamgraha\nⓉ\n(\nStrategy collection\n)\nis his major astronomy treatise written in\n1501\n. It consists of\n432\nSanskrit verses divided into\n8\nchapters, and it covers various aspects of Indian astronomy. It is based on the epicyclic and eccentric models of planetary motion. The first two chapters deal with the motions and longitudes of the planets. The third chapter\nTreatise on shadow\ndeals with various problems related with the sun's position on the celestial sphere, including the relationships of its expressions in the three systems of coordinates, namely ecliptic, equatorial and horizontal coordinates.\nThe fourth and fifth chapters are\nTreatise on the lunar eclipse\nand\nOn the solar eclipse\nand these two chapters treat various aspects of the eclipses of the sun and the moon. The sixth chapter is\nOn vyatipata\nand deals with the complete deviation of the longitudes of the sun and the moon. The seventh chapter\nOn visibility computation\ndiscusses the rising and setting of the moon and planets. The final chapter\nOn elevation of the lunar cusps\nexamines the size of the part of the moon which is illuminated by the sun and gives a graphical representation of it.\nThe\nTantrasamgraha\nⓉ\n(\nStrategy collection\n)\nis very important in terms of the mathematics Nilakantha uses. In particular he uses results discovered by\nMadhava\nand it is an important source of the remarkable mathematical results which he discovered. However, Nilakantha does not just use\nMadhava\n's results, he extends them and improves them. An anonymous commentary entitled\nTantrasamgraha-vakhya\nⓉ\n(\nInterpretation of the Tantrasamgraha\n)\nappeared and, somewhat later in about\n1550\n,\nJyesthadeva\npublished a commentary entitled\nYuktibhasa\nⓉ\n(\nLogic\n)\nthat contained proofs of the earlier results by\nMadhava\nand Nilakantha. This is quite unusual for an Indian text in giving mathematical proofs.\nThe series\nπ\n4\n=\n1\n−\n1\n3\n+\n1\n5\n−\n1\n7\n+\n.\n.\n.\n\\large\\frac{\\pi}{4}\\normalsize  = 1 - \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  - \\large\\frac{1}{7}\\normalsize  + ...\n4\nπ\n​\n=\n1\n−\n3\n1\n​\n+\n5\n1\n​\n−\n7\n1\n​\n+\n.\n.\n.\nis a special case of the series representation for arctan, namely\ntan\n⁡\n−\n1\nx\n=\nx\n−\n1\n3\nx\n3\n+\n1\n5\nx\n5\n−\n.\n.\n.\n\\tan^{-1}x = x - \\large\\frac{1}{3}\\normalsize x^{3} + \\large\\frac{1}{5}\\normalsize x^{5} - ...\ntan\n−\n1\nx\n=\nx\n−\n3\n1\n​\nx\n3\n+\n5\n1\n​\nx\n5\n−\n.\n.\n.\nIt is well known that one simply puts\nx\n=\n1\nx = 1\nx\n=\n1\nto obtain the series for\nπ\n4\n\\large\\frac{\\pi}{4}\\normalsize\n4\nπ\n​\n. The author of\n[\n4\n]\nreports on the appearance of these series in the work of\nLeibniz\nand\nJames Gregory\nfrom the\n1670\ns. The contributions of the two European mathematicians to this series are well known but in\n[\n4\n]\nthe results on this series in the work of\nMadhava\nnearly three hundred years earlier as presented by\nNilakantha\nin the\nTantrasamgraha\nⓉ\n(\nStrategy collection\n)\nis also discussed.\nNilakantha derived the series expansion\ntan\n⁡\n−\n1\nx\n=\nx\n−\n1\n3\nx\n3\n+\n1\n5\nx\n5\n−\n.\n.\n.\n\\tan^{-1}x = x - \\large\\frac{1}{3}\\normalsize x^{3} + \\large\\frac{1}{5}\\normalsize x^{5} - ...\ntan\n−\n1\nx\n=\nx\n−\n3\n1\n​\nx\n3\n+\n5\n1\n​\nx\n5\n−\n.\n.\n.\nby obtaining an approximate expression for an arc of the circumference of a circle and then considering the limit. An interesting feature of his work was his introduction of several additional series for\nπ\n4\n\\large\\frac{\\pi}{4}\\normalsize\n4\nπ\n​\nthat converged more rapidly than\nπ\n4\n=\n1\n−\n1\n3\n+\n1\n5\n−\n1\n7\n+\n.\n.\n.\n\\large\\frac{\\pi}{4}\\normalsize  = 1 - \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  - \\large\\frac{1}{7}\\normalsize  + ...\n4\nπ\n​\n=\n1\n−\n3\n1\n​\n+\n5\n1\n​\n−\n7\n1\n​\n+\n.\n.\n.\n.\nThe author of\n[\n4\n]\nprovides a reconstruction of how he may have arrived at these results based on the assumption that he possessed a certain\ncontinued fraction\nrepresentation for the tail series\n1\n(\nn\n+\n2\n)\n−\n1\nn\n+\n4\n+\n1\nn\n+\n6\n−\n1\nn\n+\n8\n+\n.\n.\n.\n.\n\\large\\frac{1}{(n+2)}\\normalsize  - \\large\\frac{1}{n+4}\\normalsize  + \\large\\frac{1}{n+6}\\normalsize  - \\large\\frac{1}{n+8}\\normalsize   + ....\n(\nn\n+\n2\n)\n1\n​\n−\nn\n+\n4\n1\n​\n+\nn\n+\n6\n1\n​\n−\nn\n+\n8\n1\n​\n+\n.\n.\n.\n.\n.\nThe\nTantrasamgraha\nⓉ\n(\nStrategy collection\n)\nis not the only work of Nilakantha of which we have the text. He also wrote\nGolasara\nⓉ\n(\nGlossary\n)\nwhich is written in fifty-six Sanskrit verses and shows how mathematical computations are used to calculate astronomical data. The\nSiddhanta Darpana\nⓉ\n(\nPrinciple mirror\n)\nis written in thirty-two Sanskrit verses and describes a planetary model. The\nCandracchayaganita\nⓉ\n(\nArithmetic\n)\nis written in thirty-one Sanskrit verses and explains the computational methods used to calculate the moon's zenith distance.\nThe head of the Nambudiri caste in Nilakantha's time was Netranarayana and he became Nilakantha's patron for another of his major works, namely the\nAryabhatiyabhasya\nⓉ\n(\nCommentary on Aryabhata's work\n)\nwhich is a commentary on the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nof\nAryabhata I\n. In this work Nilakantha refers to two eclipses which he observed, the first on\n6\nMarch\n1467\nand the second on\n28\nJuly\n1501\nat Anantaksetra. Nilakantha also refers in the\nAryabhatiyabhasya\nⓉ\n(\nCommentary on Aryabhata's work\n)\nto other works which he wrote such as the\nGrahanirnaya\nⓉ\n(\nAdjudication\n)\non eclipses which have not survived.",
  "matematicos_citados_na_biografia": [
    "Paramesvara",
    "Madhava",
    "Jyesthadeva",
    "Leibniz",
    "James Gregory",
    "continued fraction",
    "Aryabhata I"
  ],
  "imagens": [
    "nilakantha.jpg"
  ]
}