{
  "nome_completo": "Norman Earl Steenrod",
  "nome_curto": "Norman Steenrod",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steenrod/",
  "data_nascimento": "22 April 1910",
  "local_nascimento": "Dayton, Ohio, USA",
  "data_morte": "14 October 1971",
  "local_morte": "Princeton, New Jersey, USA",
  "summary": "Norman Steenrod was an American mathematician who worked in algebraic topology and was one of the founders of homological algebra.",
  "biografia": "Norman Steenrod\n's father was Earl Lindsay Steenrod and his mother was Sarah Rutledge. Both were teachers but neither had any interest in mathematics. They had three children who survived childhood. Earl Steenrod taught mechanical drawing but had astronomy as a hobby and he interested Norman in this exciting subject while he was still a young boy. Sarah Steenrod had music as a hobby and she gave Norman a lifelong interest in this.\nNorman attended school in Dayton and he was such an outstanding pupil that he was able to complete the twelve school years in only nine. At this stage he was only fifteen years old and so before entering university he worked for two years as a tool designer. This was not an arbitrary occupation to put off two years, rather it was his elder brother's trade and Norman had been taught the job by his brother. The job had a very positive effect on Steenrod's finances too, for it gave him the extra cash needed to pay his university expenses.\nIn\n1927\nSteenrod enrolled at the Miami University at Oxford, Ohio. From there he moved to the University of Michigan at Ann Arbor where he attended courses in physics, philosophy and economics. He took just one mathematics course but it was an important one for the future direction of his research, for he took a topology course given by\nRaymond Wilder\nwho had been a student of\nRobert Moore\n.\nSteenrod graduated from Ann Arbor in\n1932\nbut did not obtain a fellowship to allow him to undertake research. He spent the year\n1932\n-\n33\nback at his home in Dayton. He worked hard on topology problems which\nWilder\nhad given him and he made sufficient progress, despite working on his own, that by the end of the year he had written his first paper. Then things got better for Steenrod, for the quality of the paper led quickly to offers of fellowships from Harvard, Princeton and Duke. Again he decided to make some money and before taking up the Harvard fellowship, the one he had decided to accept, so he worked at the Flint Chevrolet plant as a die designer using again the skills he had learnt from his brother.\nBefore he had completed his year at Harvard he was offered fellowships for the following year by both Harvard and Duke. Before he had made his decision about which to accept he received another offer, this time from the University of Michigan. He decided to accept this latter offer to work with\nWilder\n. However he discovered that\nWilder\nwould not be at Michigan during that year since he had arranged to spend it at Princeton.\nWilder\nand\nLefschetz\nput a strong case to Princeton for them to offer Steenrod a fellowship but even after achieving this it still took all their powers of persuasion to convince Steenrod to take up the Princeton offer.\nAt Princeton Steenrod worked for his doctorate being supervised by\nLefschetz\n. He took only two years before he was awarded his Ph.D. then continued to work at Princeton as an instructor. He married Carolyn Witter in\n1938\nand they had two children, a girl born in\n1942\nand a son in\n1947\n. In\n1939\nSteenrod accepted an appointment to the University of Chicago where he worked for three years, returning to the University of Michigan in\n1942\n.\nSteenrod spent five years back at Ann Arbor before accepting an offer from Princeton. He moved to Princeton in\n1947\nand remained on the Faculty there for the rest of his career.\nAfter his first research work on point-set topology Steenrod then worked on\nalgebraic topology\n. He is best known for introducing the Steenrod algebra which came about through his work in classifying by homotopy the maps of a complex into a sphere. He published a paper of fundamental importance on this topic in\n1942\nin which Steenrod squares are introduced for the first time. Lectures which he gave on this topic at Princeton were written up by David Epstein and published as\nCohomology operations\nin\n1962\n.\nOne of the other major topics of Steenrod's research was fibre bundles. Again Steenrod published a book on the topic which has become a classic. The book\nThe Topology of Fibre Bundles\nwas published in\n1951\n.\nChern\n, reviewing the book, writes:-\nThis is the first systematic account of fibre bundles, covering the development of the subject from its birth in\n1935\nuntil the most recent period. Most of the essential aspects are treated ... . The book presupposes little knowledge of algebraic topology from the reader. It is divided into three parts. Part I deals with the general theory. ... Perhaps the most important result is the covering homotopy theorem, which has many consequences. Part II is devoted to the homotopy theory of bundles. A clear and concise treatment of the homotopy groups is given, the first one in book form. As one of its most interesting applications, information is obtained on the topological properties of spheres. ... Part III treats the cohomology theory of bundles. ...\nIn\n1957\nSteenrod was given the honour of being asked to give the\nAmerican Mathematical Society\nColloquium lectures. Rather surprisingly although notes of the lectures circulated for many years they were not published until\n1972\n, after Steenrod's death. The introduction to this book sets the scene:-\nThe lectures gave an excellent introduction to a central problem of algebraic topology and its applications, namely the problem of extending continuous functions. In particular, they gave a clear account of some of Steenrod's more important contributions to the subject and covered, as well, the related work of several other mathematicians. Many advances have been made since\n1957\n, but most of them were inspired by the ideas presented in these lectures. This paper is strongly recommended for anyone wanting an introduction to the subject.\nFinally we mention the important work which Steenrod did on homology theories which appeared in the famous book\nFoundations of algebraic topology\nwhich he wrote with Samuel\nEilenberg\nand was published in\n1952\n. The authors promised to write a second volume of this work but it never came about.\nSteenrod received many honours for his major contribution to topology, the most important of which was his election to the\nNational Academy of Sciences\n.\nJames\nwrites in\n[\n2\n]\n:-\nAlgebraic topology underwent a spectacular development in the years following the second world war. From a position of minor importance, as compared as compared with the traditional areas of analysis and algebra, its concepts came to exert a profound influence, and it is now commonplace that a mathematical problem is \"solved\" by reducing it to a homology-theoretic one. To a great extent the success of this development can be attributed to Steenrod's influence.\nWe noted above Steenrod's interest in music. His other interests outside mathematics included tennis, golf, chess and bridge.",
  "matematicos_citados_na_biografia": [
    "Raymond Wilder",
    "Robert Moore",
    "Wilder",
    "Lefschetz",
    "algebraic topology",
    "Chern",
    "American Mathematical Society",
    "Eilenberg",
    "National Academy of Sciences",
    "James"
  ],
  "imagens": [
    "steenrod.jpg"
  ]
}