{
  "nome_completo": "Octav Onicescu",
  "nome_curto": "Octav Onicescu",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Onicescu/",
  "data_nascimento": "20 August 1892",
  "local_nascimento": "Botoșani, North Moldavia (now Romania)",
  "data_morte": "19 August 1983",
  "local_morte": "Bucharest, Romania",
  "summary": "Octav Onicescu was a Romanian mathematician with research interests that included many areas such as probability, Riemannian manifolds, absolute differential calculus, functional analysis, algebra, and the topological theory of functions. He is considered as the founder of the Romanian school of probability.",
  "biografia": "Octav Onicescu\nwas the son of Vlad Onicescu, from Stefanesti, Botoşani County, and Ana Schipor, from Bucovina, but of Macedonian origin. The Onicescu family were land owners and were involved in local government. Octav's primary education was at the Boys' Primary School in Botoşani and then he entered the \"August Treboniu Laurian\" High School, one of the best high schools in the country, which had been founded in\n1858\n. In this High School he showed a special interest in mathematics and philosophy, and graduated with the highest possible average of\n10\n. Although he excelled at mathematics, he also excelled at poetry which was another of his favourite subjects.\nIn\n1911\nOnicescu took the baccalaureate examinations, and then enrolled in the Faculty of Sciences of the University of Bucharest; he also attended courses in the Faculty of Philosophy. At the Faculty of Sciences he was taught mathematics by professors\nGheorghe Țițeica\n,\nDimitrie Pompeiu\nand Traian Lalescu\n(1882\n-\n1929)\n.\nȚițeica\nand\nPompeiu\nhave biographies in this archive, while Lalescu was an expert on integral equations although he had broad mathematical interests including functional equations, trigonometric series, mathematical physics, geometry, mechanics, algebra, and the history of mathematics. Onicescu attended lectures in the Faculty of Philosophy by Constantin Radulescu-Motru\n(1868\n-\n1957)\nand Petre Paul Negulescu\n(1870\n-\n1951)\n. These two eminent philosophers had very different political views, Radulescu-Motru being a socialist and Negulescu a Conservative who twice served as Education Minister during the\n1920\ns.\nAt the University of Bucharest, Onicescu won the admiration of his teachers, especially\nGheorghe Țițeica\n, the leading Romanian mathematician at that time. Onicescu and\nȚițeica\nbecame friends and had a long mathematical collaboration. In\n1913\nOnicescu graduated in Mathematics and Philosophy, completing his studies a year earlier than his fellow students. In\n1914\nhe began his teaching career, becoming a mathematics teacher at the Military High School at the Dealu Monastery,\n6\nkm north of Targoviste, where he worked until\n1916\n. This Military High School had only been founded in\n1912\n, two years before Onicescu began teaching there, by Nicolae Filipescu. It was a very important school for the Romanian army in the period between the Two World Wars, and it played a large role in the process of modernising the Romanian army.\nIn\n1916\nOnicescu married Luiza Zorio, who was born in Italy, the daughter of the hydraulic engineer Michele Zorio\n(1866\n-\n1931)\n. Michele Zorio had brought the first water supply to the district of Botoşani. Octav\nand\nLuiza Onicescu had two sons, Dan and Mircea. Mircea Onicescu\n(1925\n-\n2011)\nbecame a gynaecologist.\nWorld War I began in\n1914\nbut for two years Romania was neutral. On\n27\nAugust\n1916\nRomania entered the war allied with Russia and Britain against the Central Powers of Germany, Austro-Hungary, the Ottoman Empire, and Bulgaria. Onicescu volunteered for military action and joined the Romanian army as an active fighter on the front.  After the Russian Revolution in October\n1917\n, Russia withdrew from the war and Romania's position become very difficult being totally surrounded by the Central Powers. They signed the Treaty of Bucharest with the Central Powers in May\n1918\nbut the treaty was nullified after the war ended with the defeat of the Central Powers later that year. Onicescu ended his military service in\n1918\n.\nAfter leaving the army, he was awarded a state scholarship to undertake research for a doctorate in mathematical sciences at the University of Rome La Sapienza, with\nTullio Levi-Civita\nas his thesis advisor. The topic of his doctoral thesis was one of great interest and topicality at that time, namely applying differential geometry to the general theory of relativity. We see how topical this was if we note that\nAlbert Einstein\nhad only published the general theory in late\n1915\n, three years before Onicescu began to undertake research.\nLuigi Bianchi\nand\nGregorio Ricci-Curbastro\nhad both studied three-dimensional differential varieties that admitted groups of transformations, with major papers\nOn the three-dimensional spaces which admit a continuous group of motions\n(1897)\nand\nMéthodes de calcul différentiel absolu et leurs applications\nⓉ\n(\nMethods of absolute differential calculus and their applications\n)\n(1900)\n, respectively. In his thesis Onicescu took the\n3\n-dimensional ideas of these papers and generalised them into the\n4\n-dimensional analogues relevant to general relativity. While working on his doctorate, he published several papers in the field of differential geometry, which brought him great prestige, for example\nCampo newtoniano viciniore ad un campo vettoriale assegnato\nⓉ\n(\nNewtonian field near an assigned vector field\n)\n(1920)\n,\nSulle varieth che ammettono una translazione infinitesima\nⓉ\n(\nOn the varieties that admit an infinitesimal translation\n)\n(1920)\n, and\nSpazi che ammettono una translazione infinitesima lungo le linee di lunghezza nulla\nⓉ\n(\nSpaces admitting infinitesimal translation along lines of zero length\n)\n(1920)\n. In June\n1920\nhe defended his doctoral dissertation\nSopra gli einsteinieni a gruppo continuui di transformazione\nⓉ\n(\nOn the continuous Einsteinian group of transformation\n)\nat the University of Rome. He was examined by a committee consisting of eleven mathematicians, including\nTullio Levi-Civita\n, as president,\nVito Volterra\nand\nGuido Castelnuovo\n. His doctoral thesis was praised by the committee for its originality in applying differential geometry of the general theory of relativity. In addition to his main doctoral dissertation, he also presented three supplementary dissertations, one on the composition logarithm, one on the bases of geometry and one on hydrodynamics. On\n20\nJune\n1920\n, he graduated as Doctor of Mathematics from the University of Rome, with the distinction 'magna cum laude', and became the first Romanian to obtain the title of Doctor of Mathematics from La Sapienza in Rome. We should note here that while Onicescu was in Rome, he attended lectures on probability by\nFrancesco Paolo Cantelli\n. These lectures, based on\nGuido Castelnuovo\n's book\nCalcolo della probabilità\nⓉ\n(\nCalculus of probability\n)\n(1919)\n, created a strong impression and later in his career, Onicescu would do impressive work on probability and statistics.\nAfter the award of his doctorate, Onicescu spent the year\n1920\n-\n21\nin Paris. He was a member of\nJacques Hadamard\n's seminar at the Collège de France and also attended lectures by\nÉmile Picard\nand\nÉlie Cartan\nat the Sorbonne.\nÉlie Cartan\n's lectures on integral invariants made a strong impression on Onicescu and gave him an interest in mechanics. In Paris he met up with the Romanian mathematicians\nPetre Sergescu\nand Alexandru Pantazi\n(1896\n-\n1948)\nwho were both in Paris undertaking research for their doctorates. Another Romanian in Paris at that time was Serban Coculescu\n(1902\n-\n1959)\n, known as Pius Servien, who was studying philology, mathematics, physics and philosophy at the Sorbonne. He was the son of the mathematician and astronomer Nicolae Coculescu\n(1866\n-\n1952)\n. Onicescu organised a seminar in which all these Romanians took part. After his year in Paris, Onicescu returned to Romania where he continued as a teacher at the Military High School at the Dealu Monastery but was invited to lecture on general relativity at several institutions.\nIn\n1922\nOnicescu was appointed as a lecturer in the Faculty of Sciences of the University of Bucharest. He was appointed as an assistant professor in\n1928\nthen, on\n1\nJuly\n1929\n, he was appointed associate professor, and in\n1931\nhe became a full professor. Over the following years he moved to head various departments in the University of Bucharest. His\n1931\nappointment was as Professor of Theoretical Mechanics in the Physics Section of the Faculty of Science, but in\n1938\nhe became Professor of Algebra in the Mathematical Section of the Faculty of Science and in\n1948\n, after the University of Bucharest was reorganised, he became Professor of Probability in the Faculty of Mathematics and Physics. It is perhaps surprising that he headed departments concerning very different areas of mathematics but we should emphasise that Onicescu's mathematical interests were indeed very broad. He taught courses on mechanics, absolute differential calculus related to\nEinstein\n's theory, continuous groups of transformations, probability calculus, statistical mechanics, statistics and insurance, and potential theory. His research interests included many areas such as: probability, Riemannian manifolds, absolute differential calculus, functional analysis, algebra, and the topological theory of functions. To quote from Onicescu\n[\n31\n]\n, he considered himself:-\n... a researcher of facts: human, social, economic, of natural phenomena, with mathematical means, preferable probabilistic or mechanical, a researcher who determined throughout his whole life to assimilate much more mathematical science in order to use it in his research activity.\nHe gave a expanded version of this in a speech he made at the Romanian Academy at a meeting held to celebrate his\n75\nth birthday\n[\n32\n]\n:-\nI am not first of all a mathematician, by no means a probabilist as most agree, not even a mechanician as some do not want to consider me. I regard myself as a researcher of human actions, either social or economic, and natural phenomena, who used mathematical tools, preferably probabilistic or mechanical, who all his life strove to assimilate as much mathematics as he could for using it in his researches. I cultivated probability as a science of measurement of random events and processes. I cultivated mechanics as a support or a model of any science of natural motion. In this long and difficult way I met geometry, algebra, and analysis, sometimes topology, and I did not hesitate to take up the problems raised. It was my chance that at any important moments of my scientific or social enterprises I enjoyed ideas, and enthusiasm to materialise my projects that become common to all of us.\nIn\n1924\nOnicescu gave a course on Probability, Statistics and Applications, the first university level course on this topic to be given in Romania. He approached the Central Institute of Statistics, arguing that statistics required a much greater input from mathematics and mathematicians than was happening at that time. He continued to teach probability theory until he retired in\n1962\n. He was appointed as chair of the Romanian Census of\n1930\nbut found it difficult to organise due to a lack of statisticians. In an attempt to remedy this situation, in\n1930\nhe founded the School of Statistics, Actuarial Science and Computing in Bucharest, where he was director for several years. About ten years after it was founded, the School of Statistics changed its name to the Institute of Statistics, Actuarial Science and Computation of the University of Bucharest. For political reasons, the Institute was disbanded in\n1947\n; we will say more later in this biography about Onicescu's involvement in politics.\nThere are two distinct phases to Onicescu's work on probability. The first phase up to\n1958\ninvolved a very fruitful collaboration with\nGheorghe Mihoc\n.\nMihoc\ntaught actuarial mathematics from\n1930\nto\n1948\nat the School of Statistics. He undertook research for a doctorate advised by Onicescu and, in\n1934\n, he submitted his thesis\nOn the general properties of dependent statistical variables\n(\nRomanian\n)\nto the University of Bucharest and was awarded a doctorate in mathematics on\n28\nApril of that year. They collaborated on many papers, four in\n1936\n, three in\n1937\n, one in\n1938\n, and three in each of\n1939\nand\n1940\n. This joint work laid down the basis of the Romanian school of probability theory. They were joint authors on five books, one of which was\nLa Dépendance Statistique: Chaînes et Familles de Chaînes Discontinues\nⓉ\n(\nStatistical Dependence: Chains and Families of Discontinuous Chains\n)\n. This book was reviewed by\nAlex Aitken\n[\n2\n]\n; you can read an extract of\nAitken\n's review at\nTHIS LINK\n.\nWe noted above that there was a second phase in Onicescu's work on probability. This was after\n1958\nwhen he produced a new framework for probability theory, which replaced the classical event space concept with a Boolean σ-algebra. He wrote the book\nProbability Theory on Boolean Algebras of Events\n(1976)\nin collaboration with Ion Cuculescu which was reviewed by Alan J Mayne\n[\n24\n]\n, Demetrios A Kappos\n[\n22\n]\nand Sergiu Rudeanu\n[\n37\n]\n. You can read extracts from their reviews at\nTHIS LINK\n.\nAnother of Onicescu's contributions was his work on mechanics. In this area he introduced 'invariant mechanics' which is\n[\n28\n]\n:-\n... a science of motion in which the presence of the whole universe is to be found in each of its components, not by structural geometric ways, as in relativity, but by means of the analysis of the elementary processes of motion following the line of Newtonian thought, the Invariant Mechanics, without leaving the spatio-temporal frame of the old science, has found, together with gravity, a second inertial interaction, similar to an elastic repulsive force. Slightly sensitive to current distances, but very sensitive to intergalactic distances, this interaction is for a great part responsible for\nHubble\n's expansion and at the same time for the stability of the universe, in its limits, necessarily finite.\nWith this theory, it is tempting to think that Onicescu might be trying to solve the problem of 'dark energy' which, of course was not proposed until\n1998\n!\nThe above quote is taken from the Preface to Onicescu's book\nInvariantive Mechanics\n(1975)\n. For a longer extract from this Preface and a short extract from the Introduction, see\nTHIS LINK\n.\nOnicescu's activities were so broad that it is impossible to give details of most of his contributions to the development of mathematics and statistics in Romania. Here are a few examples. From\n1925\nhe taught mechanics applied to the human body at the Institute of Physical Education in Bucharest and served as rector of the Academy of Physical Education from\n1929\nto\n1940\n. In\n1932\nhe founded the Romanian Institute for the Study of the Economic Conjuncture and in the same year he founded the Romanian Society of Science. He was elected a corresponding member of the\nRomanian Academy\nin\n1933\nand was one of the founders of the \"The Institute of Mathematical Sciences of the\nRomanian Academy\n\" founded on\n22\nDecember\n1945\n. A Probability Section of the Institute of Mathematical Sciences was created in\n1949\nwith Onicescu as its head. He became president of the General Pension Establishment in the Ministry of Finance in\n1941\nand, in the same year, president of the Private Insurance Control Council in the Ministry of the Economy. In\n1968\nhe was a cofounder of the International Centre for Mechanical Sciences in Udine, Italy.\nMihai Botez writes\n[\n3\n]\n:-\n... in the\n1930\ns, Onicescu was a 'public figure'; he was often invited to the Royal Palace for state dinners and other events, and the list of his personal friends included influential politicians from all political parties, leaders of spiritual life - like the controversial philosopher Nae Ionescu of the great composer George Enesco - and even people like philanthropist-industrialist N Malaxa\n(\npersuaded by the Professor to sponsor scientific events, including an international award for mathematicians\n)\n.\nAlthough a 'public figure' in the\n1930\ns, after the Communist takeover of Romania which followed the Soviet occupation of Romania after World War II, Onicescu concentrated on his scientific work and did not take part in other activities. He was not re-elected to the\nRomanian Academy\n, which had been renamed the 'Academy of the People's Republic of Romania'. He did, however, keep his professorship at the University of Bucharest. His already impressive output of papers increased further with, for example,\n55\npapers published in the ten years between\n1954\nand\n1963\n. As Cezar Stanciu writes in\n[\n39\n]\n:-\n... the\n1960\ns was a good time for Romanians, as the Communist regime, aiming to affirm its autonomy in front of Moscow and pursue its national-communist project, seemed to lean closer and closer to the West. The cultural and ideological restrictions of the Stalinist era had slowly faded away and Romania appeared to be headed for a different version of Communism, one relying on liberalisation and openness to the West.\nA change in policy in\n1971\n, however, changed the way that Onicescu behaved, leading to him becoming politically active. The change in policy is described in\n[\n39\n]\nas follows:-\nIn July\n1971\n,\n[\nRomania's leader Nicolae Ceausescu\n]\nmade what appeared to many as a radical turn of his domestic policy: liberalisation of arts, culture, and social life were drastically limited and the Communist party engaged on a course which was strongly inspired by Stalinism.\nMihai Botez, who knew Onicescu well at this time, writes\n[\n3\n]\n:-\nHis seminars were still tolerated by the authorities, but their content was almost subversive, prompting serious scientific approaches in a cynical milieu saturated by ideological dogmas. And his house became an island of intellectual freedom, where independent thinkers of different professions and ages were always welcomed. ... unlike the overwhelming majority of his colleagues in the Academy or University, he tried to use his immense prestige and position in order to help and even protect the dissidents, taking considerable risks for those days. It seems to me that such a courageous attitude should not be forgotten.\nDan Carlea tells us in\n[\n5\n]\nthat Onicescu was followed for years by agents of the State, listening devices were installed in his house, and his correspondence was censored. Only when he reached the age of\n90\ndid these measures end.\nMarius Iosifescu describes the end of Onicescu's life in\n[\n18\n]\n:-\nOnicescu not only lived for a long time, but he also participated in many changes in the world and in his country. He was a man with a great deal of charm and wit, who enjoyed an exceptional family life. ... Onicescu was hard working up to the end. His physical and intellectual forces diminished only in his last two years. He found in his late work a remedy for the annoyances of the old age and the difficulties of everyday life. His last years were saddened by the fact that he missed his most beloved disciples who had settled far away. He rejoiced instead at the great affection extended to him by his family, friends and admirers throughout the world. I last saw Onicescu four days before his death. I had gone to his home to say good-bye before leaving for Warsaw to attend the International Congress of Mathematicians. Though already seriously ill he was still lucid. I expected to find him better on my return but, unfortunately, I was wrong. I was told he had just had the time to see his\n90\nth birthday Festschrift so well deserved by him.\nAmong the many honours given to Onicescu let us mention that he was elected a full member of the\nRomanian Academy\nin\n1965\n, was elected as member of the Academy of Science in Torino in\n1976\nand became an honorary member of the International Statistical Institute in\n1982\n. On the centenary of his birth in\n1992\nRomania issued a stamp in his honour. See\nTHIS LINK\n.\nThe \"Octav Onicescu\" museum was founded in Botoşani in October\n1995\n; it is the only museum in Romania for a mathematician.",
  "matematicos_citados_na_biografia": [
    "Gheorghe Țițeica",
    "Dimitrie Pompeiu",
    "Țițeica",
    "Pompeiu",
    "Tullio Levi-Civita",
    "Albert Einstein",
    "Luigi Bianchi",
    "Gregorio Ricci-Curbastro",
    "Vito Volterra",
    "Guido Castelnuovo",
    "Francesco Paolo Cantelli",
    "Jacques Hadamard",
    "Émile Picard",
    "Élie Cartan",
    "Petre Sergescu",
    "Einstein",
    "Gheorghe Mihoc",
    "Mihoc",
    "Alex Aitken",
    "Aitken",
    "THIS LINK",
    "Hubble",
    "Romanian Academy"
  ],
  "imagens": [
    "onicescu.jpg"
  ]
}