{
  "nome_completo": "Oliver Graham Sutton",
  "nome_curto": "Oliver Sutton",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sutton/",
  "data_nascimento": "4 February 1903",
  "local_nascimento": "Cwmcarn, Monmouthshire, Wales",
  "data_morte": "26 May 1977",
  "local_morte": "Sketty Green, near Swansea, Wales",
  "summary": "Graham Sutton was a mathematician who made important contributions applying mathematics to meteorology. He was elected a Fellow of the Royal Society in 1949 , appointed CBE in 1950 for distinguished service to government scientific work, and knighted in 1955 for services to mathematics and science.",
  "biografia": "Graham Sutton\nwas the son of Oliver Sutton\n(1870\n-\n1944)\nand his wife Rachel Rhydderch\n(1874\n-\n1933)\n. Oliver Sutton was a schoolmaster and became head of Cwmcarn Elementary School where he gained a reputation as a fine teacher of elementary mathematics. He married the milliner Rachel Rhydderch in\n1899\nin Crickhowell, Breconshire, Wales. Rachel, who spoke both English and Welsh, was the daughter of the coal miner William Rhydderch. Oliver and Rachel Sutton had four children: William George Leslie Sutton\n(1899\n-\n1987)\n, Oliver Graham Sutton\n(1903\n-\n1977)\n, the subject of this biography, Jack Sutton\n(1910\n-\n1999)\n, and Rachel Margaret Rhydderch Sutton\n(1911\n-\n1984)\n. We note that William George Leslie Sutton and Jack Sutton both went on to study mathematics; William Sutton was awarded a First Class degree in mathematics by the University of Oxford, and Jack graduated with a mathematics degree from the University College of Wales, Aberystwyth. Rachel also studied at the University College of Wales, Aberystwyth, taking a degree in arts.\nGraham began his schooling at Cwmcarn Elementary School in\n1906\nand in\n1914\nhe won a scholarship to Pontywaun Grammar School in Pontywaun an adjacent village to Cwmcarn. The headmaster of the Grammar School was T H Williams who had studied at Aberystwyth Grammar School, then at Jesus College, Oxford, where he was awarded a good degree in Mathematics in\n1878\n. With strong leadership from Williams, the school had an outstanding reputation for science, particularly for mathematics. Graham flourished in this excellent school\n[\n18\n]\n:-\n[\nGraham\n]\nSutton was privileged in his final year at school to receive almost individual coaching in mathematics and chemistry for the Higher Certificate of the Central Welsh Board and was able to proceed with the help of County and University Scholarships to the University College of Wales, Aberystwyth, in\n1920\n. There he graduated in\n1923\nwith first class honours in pure mathematics and subsidiary applied mathematics, physics and chemistry.\nSutton's mathematics lecturers at Aberystwyth included\nWilliam Henry Young\nand George Adolphus Schott\n(1868\n-\n1937)\nwho was the Professor of Applied Mathematics. It was\nW H Young\nwho was the greatest influence on him and persuaded him to compete for the Welsh Graduate Scholarship for Jesus College, Oxford. Jesus College has strong Welsh connections and is sometimes called the Welsh College. It was founded in\n1571\nby a group of Welshmen and continued a strong Welsh connection though fellowships and scholarships. Sutton won the Welsh Graduate Scholarship and, in\n1923\nhe began studying at Jesus College advised by\nG H Hardy\n. Sutton worked on series of orthogonal functions and published\nOn a theorem of Carleman\na note in the 'Records of\n24\nApril\n1924\n' published in\n1925\nin the\nProceedings\nof the\nLondon Mathematical Society\n. This note on the theory of\nFourier\nseries was a comment on\nTorsten Carleman\n's paper\nA theorem concerning Fourier series\n(1923)\n.\nAfter two year at Jesus College, Oxford, working with\nG H Hardy\n, Sutton took a position as a Mathematics Master at Canton Municipal Secondary School in Cardiff in\n1925\n. The school had opened in\n1907\nand when Sutton taught there the headmaster was Elwyn James who always was seen with mortar board, gown and cane. After teaching mathematics for one year, Sutton was appointed as an Assistant Lecturer in Mathematics at University College, Aberystwyth in\n1926\n. He may have continued his whole career as a university mathematician had it not been for a visit to University College, Aberystwyth by David Blunt in\n1928\n. Blunt\n(1886\n-\n1965)\n, born in Wales with Welsh as his first language, had studied mathematics and physics at University College, Aberystwyth from\n1904\nto\n1907\nand, like Sutton, he had been taught by G A Schott. He then undertook research at Trinity College, Cambridge, and in\n1916\nundertook war service in the Meteorological Section of the Royal Engineers. After World War I ended, he was demobilised and joined the Meteorological Office. At the time when he visited Aberystwyth in\n1928\nhe was undertaking research on atmospheric turbulence, looking at the processes of the transfer of heat in the atmosphere by eddy motion and by radiation. He discussed his research with Sutton while visiting Aberystwyth convincing him that this was an exciting and important application of mathematics. Sutton then moved rapidly and before the end of\n1928\nhe had joined the Meteorological Office as a Professional Assistant\n[\n18\n]\n:-\nHe had a short initial posting to Shoeburyness for work on meteorological corrections to gunnery procedures but in the following year was seconded to the Chemical Defence Experimental Station, Porton, where he embarked upon his major scientific research on atmospheric turbulence and diffusion. ... By the time Sutton joined the group there had been useful progress in observing and understanding the complex properties of atmospheric flow relevant to the dispersion of gaseous and particulate material injected locally into the atmosphere.\nOn\n2\nApril\n1931\nSutton married Doris Morgan\n(1902\n-\n1985)\nin Bridgend, Glamorgan, Wales. Doris, the daughter of Thomas Oswald Morgan, a boot and shoe merchant with a business at Pontycymer, Glamorgan, was a graduate of University College, Aberystwyth in languages and history. Graham and Doris Sutton had two sons, Peter Morgan Sutton\n(1932\n-\n2014)\nand Anthony Graham Sutton\n(1935\n-\n2004)\n. We note at this point that Peter Morgan Sutton studied at Bishop Wordsworth School, Salisbury, Wrekin College, Wellington, University College London and at University College Hospital Medical School. He had a distinguished career working at University College Hospital and teaching at the Medical School.\nAt the Meteorological Office, Sutton began working on turbulent motion in the atmosphere and realised that some of the then current mathematical models for explaining diffusion did not fit the experimental results. Other ideas had been put forward by\nG I Taylor\nand\nL F Richardson\nto explain the observed diffusion of a plume of smoke which seemed to Sutton to form a good starting point for him to make progress. He began publishing papers with these ideas, the first few being:\n(\nwith E Ll Davies\n)\nThe present position of the theory of turbulent motion in the atmosphere\n(1931)\n;\nNote on the variation of the wind with height\n(1931)\n;\nNote on the relationship between wind gradient and wind velocity\n(1931)\n; and\nA theory of eddy diffusion in the atmosphere\n(1932)\n. He gives the following abstract to the\n1932\npaper:-\nThe theory of eddy diffusion in the atmosphere put forward almost simultaneously by\nG I Taylor\nand\nL F Richardson\nin England and by W Schmidt in Austria is a direct generalisation of the classical theory of molecular diffusion. It is assumed that the mass effect of the eddies is entirely similar, except for a scale difference, to that of the molecules ; thus we find an eddy-diffusivity of the order of\n1\n0\n2\n10^{2}\n1\n0\n2\nto\n1\n0\n11\n10^{11}\n1\n0\n1\n1\ncm\n2\n^{2}\n2\n/sec replacing a molecular diffusivity of the order of\n1\n0\n−\n1\n10^{-1}\n1\n0\n−\n1\ncm\n2\n^{2}\n2\n/sec in entirely similar differential equations. Recent researches\n[\nin the Davies-Sutton\n1931\npaper\n]\n, however, have shown that the difference between the eddy structure of a turbulent fluid and the molecular structure of a fluid at rest is more than one of scale, and it is now clear that there is need of an extended theory to express this difference. The failure of the earlier theory to account for the phenomenon of atmospheric diffusion has been made evident by the enormous variations found in K, the eddy conductivity.\nRichardson\nhas evaluated K for the diffusion of smoke over short distances, for the distribution of volcanic ash, and for the scatter of small balloons, and has found K's varying from\n1\n0\n4\n10^{4}\n1\n0\n4\nto\n1\n0\n8\n10^{8}\n1\n0\n8\ncm\n2\n^{2}\n2\n/sec. Other writers have given estimates varying from\n1\n0\n2\n10^{2}\n1\n0\n2\nto\n1\n0\n11\n10^{11}\n1\n0\n1\n1\ncm\n2\n^{2}\n2\n/sec, and in general it has been found that K increases rapidly with the scale of the phenomenon. The present paper is concerned with an attempt to define a new diffusion coefficient which is constant over a field of a few hundred metres to hundreds of kilometres. The basic idea, that the rate of diffusion is governed by what is termed the \"effective eddy\" is not entirely new; it is inherent in much of\nRichardson\n's work. In the earlier theory it was assumed that the size of the effective eddy remained constant; here it is assumed that it varies with the distance travelled by the diffusing cluster.\nHe also gives the following Acknowledgements at the end of the paper:-\nThe author wishes to acknowledge with gratitude the invaluable assistance given to him in the course of these researches by Mr D Brunt, M.A., and Mr E LI Davies, M.Sc., both of the Meteorological Office.\nSutton soon gained a reputation as an outstanding researcher and his abilities as an organiser and administrator were also quickly evident. He was rapidly promoted at the Meteorological Office but worries about the possibility of war led to him spending a year seconded to the Woolwich Arsenal beginning in August\n1937\n. He was involved in the mathematical theory of the small anti-aircraft rockets which were being developed there at this time. Of course, work which in any way involved military applications could not be published during the\n1930\ns and some of his research from these years had to wait until the war was over before it could be published. Returning to the Meteorological Office, Sutton was made Head of the Meteorology Section in\n1938\n.\nWorld War II began on\n1\nSeptember\n1939\nwhen Germany invaded Poland and on\n3\nSeptember Britain declared war on Germany. This led to Sutton being involved in organising research and development of various weapons programmes and as a consequence he had no publications between\n1939\nand\n1946\n. By\n1941\nthe Meteorological Office was highly involved in research into defence against chemical weapons. A new Field Planning Section was formed in January\n1941\nto study the atmospheric dispersion of chemical weapons and Sutton was chosen to lead the Section. In August\n1942\nhe was named Superintendent of Research with his responsibilities being greatly increased to cover laboratory work at the Porton establishment. He continued to be assigned major roles being Superintendent of Tank Armament Research from\n1943\nto\n1945\n[\n18\n]\n:-\nSutton's wise and constructive influence on the Porton wartime programme was obvious to all concerned. Apart from the need for a thorough appreciation of the technical requirements, there was the equally demanding task of ensuring the harmonious and effective deployment of many scientists with different disciplines, working in groups and as individuals, some imported specially for the war effort from university and industry, many of them now operating in close conjunction with service personnel. W R Lane, a senior contemporary Porton physicist, writes of Sutton's contribution at that time as follows: \"Sutton had a deep feeling for the inter-disciplinary approach to problems, and with his mathematical expertise and meteorological background he made a major contribution to the work of the Establishment. He encouraged new ideas and independent thinking and he permitted a freedom of action which was greatly valued by his associates.\"\nAfter the war ended, Sutton was appointed Superintendent at the Radar Research and Development Establishment at Malvern from\n1945\nto\n1947\n. This was a period of major reorganisation following the end of the war, with large reduction in personnel and redeployment of many staff. Although Sutton had no expertise in radar development, his organisational abilities and excellent way of dealing with staff meant that he was able to make an important contribution.\nIn\n1947\nSutton resigned his role at Malvern when he was appointed to the Bashforth Chair in Mathematical Physics at the Military College of Science at Shrivenham\n[\n3\n]\n:-\nHe greatly enjoyed this temporary return to academic life where, in addition to his teaching duties, he maintained his research activity. In these years he published the key papers which established his reputation.\nHe was now able to publish results of research done before the war which he had been unable to publish at the time. His two most important papers were\nThe problem of diffusion in the lower atmosphere\n(1947)\nand\nConvection in the atmosphere near the ground\n(1948)\n. Michael Field writes\n[\n7\n]\n:-\nThe consequences were wide-ranging, for they provided for the first formulae representing the effect of meteorological conditions on the distribution of concentration downwind of a continuous release of gas or particles at ground level. Sutton's point-source formula, at first in restricted use in chemical warfare studies, became widely known in the context of industrial pollution.\nSutton also began publishing books with the monograph\nAtmospheric Turbulence\n(1949)\nand the popular work\nThe Science of Flight\n(1949)\n. The Preface to\nAtmospheric Turbulence\nbegins:-\nIn this Monograph I have attempted an account of an aspect of dynamical meteorology which is now recognised as a study of major importance, not only because of its intrinsic interest and the fundamental part which it plays in the science of meteorology as a whole, but also because of its significance in economic, military and industrial spheres. The theory of atmospheric turbulence is more mathematically developed than those parts of dynamical meteorology which treat of large-scale motions of the atmosphere and I have considered the subject throughout as a branch of mathematical physics.\nThe Preface to\nThe Science of Flight\nbegins:-\nAs its title indicates, this is a book about the theoretical aspects of flying. It is not concerned with the problem of aircraft design, which is the province of the engineer, and nowhere does it touch upon the actual technique of flying. In short, it is an attempt to explain to the layman something of a branch of applied mathematics, called aerodynamics, which lies at the root of all matters appertaining to mechanical flight. I have written the book because I believe there are many people who would like to know more of these matters. This means putting into plain English much which is usually expressed in the language and notation of mathematics, an interesting but never very easy task for the author who must, of necessity, be steeped in that notation himself.\nFor more information about both these books and other books written by Sutton, see\nTHIS LINK\n.\nAfter six years at the Royal Military College of Science at Shrivenham, Sutton returned to the Meteorological Office in\n1953\nwhen he was appointed Director General. He continued in this role until\n1965\nwhen he retired but was appointed as the first chairman of the newly founded Natural Environment Research Council. He held this post for three years after which the family moved to Sketty near Swansea\n[\n3\n]\n:-\nIn his last years Sutton returned to Wales, to Swansea, and an interesting glimpse of his continued concern with organisation is provided by the fact that the house he built for his retirement at Swansea was of identical design to the one he had earlier built at Bracknell. In this way all the furniture fitted perfectly and the upheaval of moving house was reduced to a minimum.\nBoth Sutton and his wife kept busy in retirement\n[\n18\n]\n:-\nSutton quickly found himself involved as a local magistrate and, slightly further afield, as a very welcome member of Council of Aberystwyth University College, of which he later became Vice-President. He gave himself wholeheartedly to the tasks deriving from his membership of Council, most aptly perhaps as Chairman of the Buildings Committee. He and members of his family - brother, sister, wife - had as undergraduates known only the old college buildings on the sea front; he returned in\n1963\nto open the new Physical Sciences building on the post-war campus up the hill.\nMary Auronwy James lists some of the many honours given to Sutton\n[\n13\n]\n:-\n[\nHe\n]\nwas Vice-President of University College Wales, Aberystwyth from\n1967\nto\n1976\n. He was elected a Fellow of the\nRoyal Society\nin\n1949\n, appointed CBE in\n1950\nfor distinguished service to government scientific work, and knighted in\n1955\nfor services to mathematics and science. He received many honours including Honorary DSc\n(\nLeeds\n)\n, Honorary LLD\n(\nWales\n)\n1949\n; and honorary membership of several scientific and American societies, and he was presented with: the President's Gold Medal of the Society of Engineers\n(1957)\n; Symons Gold Medal, Royal Meteorological Society\n(1959)\n; International Meteorological Organization Prize\n(1968)\n; and Frank A Chambers Award, Air Pollution Control Association\n(1968)\n.",
  "matematicos_citados_na_biografia": [
    "William Henry Young",
    "W H Young",
    "G H Hardy",
    "London Mathematical Society",
    "Fourier",
    "Torsten Carleman",
    "G I Taylor",
    "L F Richardson",
    "Richardson",
    "THIS LINK",
    "Royal Society"
  ],
  "imagens": [
    "sutton.jpg"
  ]
}