{
  "nome_completo": "Osborne Reynolds",
  "nome_curto": "Osborne Reynolds",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reynolds/",
  "data_nascimento": "23 August 1842",
  "local_nascimento": "Belfast, Ireland",
  "data_morte": "21 February 1912",
  "local_morte": "Watchet, Somerset, England",
  "summary": "Osborne Reynolds was an Irish mathematician and physicist best known for introducing the Reynolds number classifying fluid flow.",
  "biografia": "Osborne Reynolds\n' father was also called Osbourne Reynolds\n(\nborn in Debach, Suffolk, England, about\n1814\n; died in\n1890)\nand was a priest in the Anglican church. However, he had an academic background having graduated from Cambridge in\n1837\n, being elected to a fellowship at Queens' College, and being headmaster of first Belfast Collegiate School and then Dedham School in Essex. In fact it was a family with a tradition of the Church and three generations of Osborne's father's family had been the rector of Debach-with-Boulge. Osborne Reynolds' mother was  Jane Bryce\n(\nborn about\n1815)\n. She was a widow, the daughter of Edward Hickman. He had a younger brother Edward\n(1844\n-\n1907)\nwho became a priest.\nOsborne was born in Belfast when his father was Principal of the Collegiate School there, but began his schooling at Dedham when his father was headmaster of the school in that Essex town. After that he received private tutoring to complete his secondary education. He did not go straight to university after his secondary education, however, but rather he took an apprenticeship with the engineering firm of Edward Hayes in\n1861\n. Reynolds wrote\n(\nactually in his application for the chair in Manchester in\n1868)\nof his father's influence on him while he was growing up\n(\nsee for example\nLamb\n's article\n[\n8\n]\n)\n:-\nIn my boyhood I had the advantage of the constant guidance of my father, also a lover of mechanics, and a man of no mean attainments in mathematics and its application to physics.\nReynolds, after gaining experience in the engineering firm, studied mathematics at Cambridge, graduating in\n1867\nas Seventh\nWrangler\nin the Mathematical Tripos\n(\nranked seventh in the list of First Class students\n)\n. As an undergraduate Reynolds had attended some of the same classes as\nRayleigh\nwho was one year ahead of him. As his father had before him, Reynolds was elected to a scholarship at Queens' College. He again took up a post with an engineering firm, this time the civil engineers John Lawson of London, spending a year as a practicing civil engineer.\nOsborne Reynolds married Charlotte Jemima Chadwick\n(\nthe daughter of Charles Chadwick, born about\n1844)\nin Leeds on\n22\nJuly\n1868\n. They had a son, also named Osborne\n(\nborn in Rusholme, Lancashire in September\n1869)\n. Osborne Reynolds later married Annie Charlotte Wilkinson\n(\nborn about\n1860)\nin Leeds in\n1882\n. They had four children, Henry\n(\nborn\n1883)\n, Margaret\n(\nborn\n1885)\n, Frank\n(\nborn\n1887)\n, and Geoffrey\n(\nborn\n1889)\n.\nIn\n1868\nReynolds became the first professor of engineering in Manchester\n(\nand the second in England\n)\n. Kargon writes in\n[\n1\n]\n:-\n... a newly created professorship of engineering was advertised at Owens College, Manchester, at £\n500\nper annum. Reynolds applied for the position and, despite his youth and inexperience, was awarded the post.\nWe should note in passing that Owens College would later become the University of Manchester. In his application for the post Reynolds wrote\n(\nsee for example\n[\n8\n]\n)\n:-\nFrom my earliest recollection I have had an irresistible liking for mechanics and the physical laws on which mechanics as a science is based.\nReynolds set up the Whitworth laboratories at Owens College\n[\n3\n]\n:-\n... and not only made them famous throughout the world but a pattern for the other European schools of research.\nHe held this chair in Manchester until he retired in\n1905\n.\nHis early work was on magnetism and electricity but he soon concentrated on hydraulics and hydrodynamics. He also worked on electromagnetic properties of the sun and of comets, and considered tidal motions in rivers.\nAfter\n1873\nReynolds concentrated mainly on fluid dynamics and it was in this area that his contributions were of world leading importance. We summarise these contributions. He studied the change in a flow along a pipe when it goes from laminar flow to turbulent flow. In\n1886\nhe formulated a theory of lubrication. Three years later he produced an important theoretical model for turbulent flow and it has become the standard mathematical framework used in the study of turbulence.\nThe author of\n[\n2\n]\nnotes that:-\nHis studies of condensation and heat transfer between solids and fluids brought radical revision in boiler and condenser design, while his work on turbine pumps permitted their rapid development.\nAn account of Reynolds' work on hydrodynamic stability published in\n1883\nand\n1895\nis looked at in\n[\n9\n]\n. The\n1883\npaper is called\nAn experimental investigation of the circumstances which determine whether the motion of water in parallel channels shall be direct or sinuous and of the law of resistance in parallel channels\n. The 'Reynolds number'\n(\nas it is now called\n)\nused in modelling fluid flow which is named after him appears in this work.\nReynolds became a Fellow of the\nRoyal Society\nin\n1877\nand,\n11\nyears later, won their Royal Medal. In\n1884\nhe was awarded an honorary degree by the University of Glasgow. By the beginning of the\n1900\ns Reynolds health began to fail and he retired in\n1905\n. Not only did he deteriorate physically but also mentally, which was sad to see in so brilliant a man who was hardly\n60\nyears old.\nNot only is Reynolds important in terms of his research, but he is also important for the applied mathematics course he set up at Manchester. Anderson writes in\n[\n4\n]\n:-\nReynolds was a scholarly man with high standards. Engineering education was new to English universities at that time, and Reynolds had definite ideas about its proper form. He believed that all engineering students, no matter what their speciality, should have a common background based in mathematics, physics, and particularly the fundamentals of classical mechanics. ... Despite his intense interest in education, he was not a great lecturer. His lectures were difficult to follow, and he frequently wandered among topics with little or no connection.\nIn\n[\n8\n]\nLamb\n, who knew Reynolds well both as a man and as a fellow worker in fluid dynamics, wrote:-\nThe character of Reynolds was like his writings, strongly individual. He was conscious of the value of his work, but was content to leave it to the mature judgement of the scientific world. For advertisement he had no taste, and undue pretension on the part of others only elicited a tolerant smile. To his pupils he was most generous in the opportunities for valuable work which he put in their way, and in the share of cooperation. Somewhat reserved in serious or personal matters and occasionally combative and tenacious in debate, he was in the ordinary relations of life the most kindly and genial of companions.",
  "matematicos_citados_na_biografia": [
    "Lamb",
    "Wrangler",
    "Rayleigh",
    "Royal Society"
  ],
  "imagens": [
    "reynolds.jpg"
  ]
}