{
  "nome_completo": "Oskar Klein",
  "nome_curto": "Oskar Klein",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Klein_Oskar/",
  "data_nascimento": "15 September 1894",
  "local_nascimento": "Mörby, Stockholm, Sweden",
  "data_morte": "5 February 1977",
  "local_morte": "Stockholm, Sweden",
  "summary": "Oskar Klein was a Swedish theoretical physicist whose ideas were important in the development of string theory.",
  "biografia": "Oskar Klein\nwas was the youngest son of Sweden's first rabbi, Gottlieb Klein, who was originally from the Southern Carpathian. Gottlieb Klein received his doctorate from Heidelberg and moved to Sweden in\n1883\n. He evidently instilled an interest in learning in his young son, as Oskar became quite fond of biology at an early age. This interest changed to chemistry around the age of\n15\nand soon after, in\n1910\n, Svante Arrhenius, at what seems to be the behest of Gottlieb, invited Oskar to work in his laboratory at the Nobel Institute. Here he took up an interest in solubility and he published his first paper in\n1912\non the solubility of zinc hydroxide in alkalis. This was the very same year that he finished his secondary education. He waited, however, until\n1914\nto take the University exam.\nArrhenius wanted to send Klein to work with Jean-Baptiste Perrin in his laboratory at the University of Paris but the plan was foiled by the outbreak of World War I. Klein found himself caught up in the tempest and saw military service in\n1915\nand\n1916\n. After his service concluded, but with the war still raging, he returned to work with Arrhenius.\nTheir work now centred around studying dielectric constants of alcohols in various solvents. During this particular stay in Stockholm, he met Hendrik A Kramers, who, at the time\n(1917)\n, was a student of\nNiels Bohr\nin Copenhagen. Kramers and Klein met several times during the next few years both in Stockholm and in Copenhagen, which was to be Klein's next destination.\nIn\n1917\nKlein received a fellowship to study abroad and, subsequently, arrived in Copenhagen in\n1918\n. Over the course of the next two years he would travel between Stockholm and Copenhagen performing work for both\nBohr\nand Arrhenius, spending the summer of\n1919\nwith Kramers in Copenhagen, and finally returning to Stockholm in\n1920\n. But that was not to be the end of his Copenhagen experience. In fact, it was merely the beginning.\nBohr\ntraveled to Stockholm in\n1920\nto visit Klein and convinced him to return to Copenhagen once more to work at\nBohr\n's Institute. Klein agreed and began what would prove to be quite a fruitful relationship that eventually would lead him to his first teaching position.\nAround this time,\nBohr\nwas working with Svein Rosseland on the statistical equilibrium of a mixture of atomic and free electrons. At the time, it was believed that electrons colliding with atoms always lost energy. However, Klein, in conjunction with Rosseland, introduced \"collisions of the second kind\" where the electrons actually gained energy!\nKlein continued his work on the other side of the 'molecular aisle' by turning his attention to ions. In fact, this led him to his thesis research in which he studied the forces between ions in strong electrolytes using\nGibbs\n's statistical mechanics. The result was a generalized formulation of Brownian motion. He defended his doctorate in\n1921\nat Stockholm Högskola and was opposed by Erik Ivar\nFredholm\nthe mathematical physicist best known for his work on\nintegral equations\nand spectral theory. After his successful defence, Klein returned to Copenhagen, later assisting\nBohr\non a trip to Göttingen.\nAround this time Klein turned to publishing semi-popular writings on physics. His first work in this new arena was a philosophical paper that was a refutation of an objection to relativity theory by Swedish philosophers. Not surprisingly, it was around this time that he began to look for a job.\nIn\n1923\n, Oskar Klein married Gerda Agnete Koch and moved to Ann Arbor, Michigan to take up a post at the University of Michigan, a post he won with no small thanks to his venerable friend\nNiels Bohr\n. His first work in Ann Arbor dealt with the anomalous Zeeman effect which was a problem that arose out of the fact that no one at the time understood the behavior of atoms in a magnetic field. The classical Zeeman effect was explained, in a nutshell, as the splitting of spectral lines by the magnetic field. The problem was that the classical theory only effectively described atoms with a total electron spin of zero. The difference can be seen in the Hamiltonians of the two. For the normal Zeeman effect, the Hamiltonian reads:\nH\n1\n=\ne\n2\nm\nc\nL\n.\nB\nH_{1} = \\Large\\frac{e}{2mc}\\normalsize  \\bf{L} . \\bf{B}\nH\n1\n​\n=\n2\nm\nc\ne\n​\nL\n.\nB\nFor the anomalous Zeeman effect, the Hamiltonian becomes:\nH\n1\n=\ne\n2\nm\nc\n(\nL\n+\n2\nS\n)\n.\nB\nH_{1} = \\Large\\frac{e}{2mc}\\normalsize  (\\bf{L} + 2\\bf{S}) . \\bf{B}\nH\n1\n​\n=\n2\nm\nc\ne\n​\n(\nL\n+\n2\nS\n)\n.\nB\nThe extra term arises from the intrinsic dipole moment of an object with spin, where\nS\n\\bf{S}\nS\nis the spin angular momentum. For the time\n(1923)\n, this was a fairly large problem to tackle, but Klein did not stop there.\nHe went on to work on the interaction of diatomic molecules with precessing electrons, studying the angular momentum within the molecule itself. The following year, in\n1924\n, he taught a course on electromagnetism and lectured on an electric particle in a combined gravitational and electromagnetic field. This was the beginning of his landmark work on a unified field theory.\nKlein chose to solve the problem by essentially extending his work to a fifth dimension, though his early unification ideas centred around quantum physics as the catalyst. He did this by setting\np\n5\n2\n=\nm\n2\np_{5}^{2} = m^{2}\np\n5\n2\n​\n=\nm\n2\n. Brink\n[\n5\n]\nhas said that Klein was driven by:-\n... the wish to have a formalism which includes the wave aspect and the particle aspect as a limit.\nAfter a time Klein argued less and less that quantum physics could lead to a unified picture, in fact he later abandoned the idea entirely. However, he did see the possibility of unification in five dimensions, which seems to have been present in his initial attempt.\nAt this time, Klein apparently was unaware of the work of\nTheodor Kaluza\n.\nKaluza\n, in\n1919\n, sent a paper to\nAlbert Einstein\nproposing a unification of gravity with\nMaxwell\n's theory of light.\nEinstein\ninitially was uninterested in the paper, but later realized the highly original ideas contained within it and encouraged\nKaluza\nto publish his ideas. In fact the paper was communicated by\nEinstein\nhimself on\n8\nDecember\n1921\n.\nIn\n1925\n, Klein returned to Copenhagen and contracted hepatitis. He was ill for half a year, though he was visited by\nHeisenberg\nin July of\n1925\nand\nSchrödinger\nin January of\n1926\n. This was around the time he was finally able to return to work. It was at this time that he finally became aware of\nKaluza\n's work.\nWolfgang Pauli\ncommunicated this work to him and Klein:-\n... tried to rescue what I could from the shipwreck.\nKlein's adaptation of\nKaluza\n's work had a major difference from the original in that the extra or fifth dimension was curled up into a ball that was on the order of the\nPlanck\nlength,\n1\n0\n−\n33\n10^{-33}\n1\n0\n−\n3\n3\ncm. It is important to note, however, that the extra dimension, though curled up, was still Euclidean in nature. Basically, the fifth coordinate was not observable but was a physical quantity that was conjugate to the electrical charge. As Kragh\n[\n4\n]\nexplains, Klein attempted to explain the atomicity of electricity as a quantum law. He also attempted to account for the electron and the proton.\nKlein assumed the fifth dimension to be periodic with a period\nl\n=\nℏ\nc\n2\nk\ne\nl = \\hbar c \\Large\\frac{\\sqrt {2k}} {e}\nl\n=\nℏ\nc\ne\n2\nk\n​\n​\nwhere\ne\ne\ne\nwas the charge of the electron and\nk\nk\nk\nwas\nEinstein\n's constant of gravitation. The dimension was on the order of the\nPlanck\nlength.\nKlein's results were published in\nNature\nin the autumn of\n1926\nand generated interest from such eminent theorists as Vladimir Fock, Leon Rosenfeld,\nLouis de Broglie\n, and\nDirk Struik\n. Unfortunately, despite a lot of initial interest in unification, most physicists eventually went on to more promising and experimentally testable research leaving\nKaluza\n-Klein theory to be explored by another generation of physicists nearly half a century later. In Klein's own words:-\nDirac\nmay well say that my main trouble came from trying to solve too many problems at a time.\nIt was also in\n1926\nthat Klein was appointed as\ndocent\nat Lund University and became, for the next five years,\nBohr\n's closest collaborator both on correspondence and complimentarity, and apparently contributed to the development of the uncertainty principle, as\nHeisenberg\nrecalled:-\nAfter several weeks of discussion, which were not devoid of stress, we soon concluded, not least thanks to Oskar Klein's participation, that we really meant the same, and that the uncertainty relations were just a special case of the more general complementarity principle.\nIn fact,\n1926\nwas a banner year for Klein. In addition to finally recovering from the hepatitis and becoming docent at Lund, it was in this same year that he made his next great theoretical breakthrough. In a paper in which he determined the atomic transition probabilities\n(\nprior to\nDirac\n)\n, he introduced the initial form of what would become known as the Klein-Gordon equation.\nThe Klein-Gordon equation was the first relativistic wave equation. The equation can be written:\n∂\n2\nψ\n∂\nt\n2\n=\nc\n2\n∇\n2\nψ\n−\nm\n2\nc\n4\nℏ\n2\nψ\n\\Large\\frac{\\partial^2 \\psi}{\\partial t^2}\\normalsize=c^2 \\nabla^2 \\psi - \\Large\\frac{m^2 c^4}{\\hbar^2}\\normalsize\\psi\n∂\nt\n2\n∂\n2\nψ\n​\n=\nc\n2\n∇\n2\nψ\n−\nℏ\n2\nm\n2\nc\n4\n​\nψ\nIt is interesting to note that this equation appeared exactly as it has been written in David Bohm's\n1951\nbook\nQuantum Theory\nbut was not called the Klein-Gordon equation. However, Bethe and Jackiw's\nIntermediate Quantum Mechanics\n, originally written in\n1964\n, does refer to the same equation as the Klein-Gordon equation. Klein and Walter Gordon were thus eventually honoured with having the equation named after them, though it seems to have taken over a quarter of a century to receive the honour. Oddly enough,\nSchrödinger\nhimself privately developed a relativistic wave equation from his original wave equation, which, in reality, was not that difficult to do, and did so prior to Klein and Gordon, though he never published his results. The trouble came when the equation did not result in the correct fine structure of the hydrogen atom and when\nPauli\nintroduced the concept of spin a year later\n(1927)\n. The equation turned out to be incompatible with spin and, as a result, is only useful for calculations involving spinless particles. But, nonetheless, it was an important point in quantum theory and, along with his unification theory, was to ensure a lasting legacy for Klein and cemented\n1926\nas a pivotal year in his life.\nIn the years following\n1926\n, Klein turned to teaching and continued his research, though possibly at a reduced pace. Brink\n[\n5\n]\nquotes a friend and mentor to Klein as having said:-\nYou will now fulfill the words: go and teach the people. Your great pedagogical talents always were one of your strongest qualities. I am not of the opinion that finding new laws of nature and indicating new directions is one of your great strengths, although you always have developed a certain ambition in this direction.\nIn\n1927\n, Klein was appointed Lektor in Copenhagen but nonetheless continued his research working with\nPascual Jordan\non the second quantization in quantum mechanics.\nIn his work with\nJordan\n, he demonstrated the close connection between quantum fields and quantum statistics. It was known that second quantization guarantees that photons obey\nBose\n-\nEinstein\nstatistics, but Klein showed that second quantization is not confined to free particles only. He and\nJordan\nshowed that one can quantize the non-relativistic\nSchrödinger\nequation and, in honour of this work, he was the recipient of yet another named mathematical tool, the\nJordan\n-Klein matrices.\nIn subsequent years he collaborated with the Japanese physicist Yoshio Nishina who was in Copenhagen on an extended research visit and worked on the problem of Compton scattering of a\nDirac\nelectron. Despite the so-called Klein paradox, that being that the positron was not completely understood by physicists, he was able to convince physicists of the soundness of\nDirac\n's relativistic wave equation. His continued work included the quantum mechanics of the second law of thermodynamics and Klein's lemma.\nIn\n1930\n, he was offered\nFredholm\n's position at Stockholm Högskala and he finally returned to his native city to take up a post that he held until his retirement in\n1962\n.\nDuring the\n1930\ns, Klein helped many refugee physicists who were expelled from Germany and other nations largely due to their Jewish heritage. Of the many he helped, one included Walter Gordon who would later join Klein in being the beneficiaries of the named equation we have just discussed. In\n1943\n, Klein also aided in\nBohr\n's escape from Copenhagen.\nDuring the\n1930\ns Klein also found time to attend conferences, not the least of which included the\n1938\nWarsaw Conference where he spoke on\n(\nalmost\n)\nnon-Abelian gauge theories\n. This conference included some of the leading theorists of the day including\nSir Arthur Eddington\n,\nEugene Wigner\n, and others. It was at this conference that Klein suggested that a spin -\n1\nparticle mediated beta decay and played a role in weak interactions in a similar manner to the photon in electromagnetism. Klein's hypothesis was yet another crack at a unified field theory, this time in attempt to unify the strong, weak, and electromagnetic forces. The work was not noticed until nearly twenty years later when it was resurrected by\nJulian Schwinger\nin\n1957\n.\nIn the\n1940\ns Klein worked on a wide variety of subjects including superconductivity\n(\nwith Jens Lindhard in\n1945)\n, biochemistry, universal\np\np\np\n-decay, general relativity, and stellar evolution. Sometime after\n1947\nhe, and independently Giovanni Puppi, realized that both the electron and the μ-meson were \"weak\" particles.\nIn the\n1950\ns and\n1960\ns Klein remained active, addressing the\n11\nth\nSolvay Conference in\n1958\n, developing a new model for cosmology in conjunction with Hannes Alfven in\n1963\n, and tackling\nEinstein\n's General Relativity in a paper published in\nAstrophisica Norvegica\nin\n1964\n. During his later years, he also became very interested in philosophy and especially in analogies between science and religion. In addition, he took to writing a few popular books, most of which are out of print.\nOskar Klein died in Stockholm, one of the finest theoretical physicists of the twentieth century.",
  "matematicos_citados_na_biografia": [
    "Niels Bohr",
    "Bohr",
    "Gibbs",
    "Fredholm",
    "integral equations",
    "Theodor Kaluza",
    "Kaluza",
    "Albert Einstein",
    "Maxwell",
    "Einstein",
    "Heisenberg",
    "Schrödinger",
    "Wolfgang Pauli",
    "Planck",
    "Louis de Broglie",
    "Dirk Struik",
    "Dirac",
    "docent",
    "Pauli",
    "Pascual Jordan",
    "Jordan",
    "Bose",
    "Sir Arthur Eddington",
    "Eugene Wigner",
    "Julian Schwinger"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}