{
  "nome_completo": "Eduard Ott-Heinrich Keller",
  "nome_curto": "Ott-Heinrich Keller",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keller/",
  "data_nascimento": "22 June 1906",
  "local_nascimento": "Frankfurt (Main), Germany",
  "data_morte": "5 December 1990",
  "local_morte": "Halle, Germany",
  "summary": "Ott-Heinrich Keller was a German mathematician who worked on algebraic geometry and topology.",
  "biografia": "Ott-Heinrich Keller\nwas born in Frankfurt\n(\nMain\n)\n. After completing his school education, he studied at the universities of Frankfurt, Vienna, Berlin and Göttingen. His doctoral studies were supervised by\nMax Dehn\nand, in\n1929\n, he was awarded a doctorate for his thesis\nÜber die lückenlose Erfüllung des Raumes mit Würfeln\nⓉ\n(\nOn the complete filling of space with cubes\n)\n. Following his graduation he was appointed as an assistant at the University of Frankfurt where he remained until\n1931\n, the year in which he published his second paper\nDie Homoiomorphie der kompakten konvexen Mengen im Hilbertschen Raum\nⓉ\n(\nThe homeomorphism of compact convex sets in Hilbert space\n)\n. Keller then went to the Technical University of Charlottenburg in Berlin where he was appointed as assistant to\nGeorge Hamel\n. There he submitted his\nhabilitation\nthesis in\n1933\nwith a work on\nCremona\ntransformations. In the same year he published two papers related to his thesis, namely\nÜber eine diskontinuierliche Gruppe von Cremona-Transformationen\nⓉ\n(\nOn a discontinuous group of Cremona transformations\n)\n, and\nCremona-Transformationen algebraischer Kurven\nⓉ\n(\nCremona transformations of algebraic curves\n)\n.\nOf course\n1933\nwas the year that Hitler came to power and Keller continued to work at the Technical University of Charlottenburg in Berlin during the years leading up to World War II continuing to work there during the war itself. He had published a number of papers on geometry and\nalgebraic geometry\nbetween\n1933\nand\n1939\n, but only one publication\nEine Bemerkung zu den Plückerschen Formeln\nⓉ\n(\nA note on the Plucker formulas\n)\n(1943)\nbetween\n1940\nand\n1948\n. During the war he undertook war related work and in\n1941\nwas assigned to the naval college in Flensburg as a teacher for mathematics and mechanics. The naval station and academy at Flensburg had been established before World War II, and served an important role for Germany throughout the war.\nIn the years immediately following World War II Keller worked in the Universities of Kiel and Münster, then in\n1947\nhe was appointed as an ordinary professor at the Technischen Hochschule in Dresden. In\n1949\nhe published\nZu einem Satze von H W E Jung über ganze birationale Transformationen der Ebene\nⓉ\n(\nOn a theorem of H W E Jung on all birational transformations of plane\n)\nand, by a strange coincidence, following the retirement of\nHeinrich W E Jung\nfrom the chair of mathematics at Halle, Keller was appointed to\nJung\n's chair at the Martin Luther University of Halle-Wittenberg in\n1951\n. From that time on until his death he carried out scientific activities of depth and breadth at Halle and used his talents to enrich the mathematical studies of the circle of pupils and friends around him. At Halle, he led the Mathematical Institute and he also gave leadership for several specialist areas of mathematics. He was an active member of the\nGerman Mathematical Society\nbeing a member of the executive committee from\n1960\nto\n1966\nand he was chairman of the Society from\n1960\nto\n1961\n. He was member of the\nGerman Academy of Scientists Leopoldina\nand the Academy of Sciences of Saxony.\nAs to Keller's mathematical contributions, the author of\n[\n1\n]\nwrites:-\nLooking at Keller's work one notices immediately that he made contributions to several, not only all neighbouring, areas of mathematics, the most important being to geometry, to algebraic geometry and to topology; in addition he studied number theoretic and analytic topics as well as those of a more philosophical character.\nIn\n1954\nKeller published his first book\nGeometrie der Zahlen\nⓉ\n(\nGeometry of numbers\n)\nwhich contained many of his contributions to the topic. D Derry, in a review of the text, writes:-\nThis is an account of results in the theory of numbers obtained by geometric methods up to\n1951\n. Among the chapter headings are convex bodies in lattices, star bodies, linear forms, minima of homogeneous forms, inhomogeneous forms, definite quadratic forms,\ncontinued fractions\nand algebraic numbers. Some proofs of fundamental results are sketched. The results on star bodies which have been obtained in the last two decades are listed with considerable completeness. Included among these is a paragraph of conjectures made by Mahler. The chapter on definite quadratic forms contains a clear account of the work done on the reduction problem.\nHis second book was aimed at students, rather than researchers. The was the text\nAnalytische Geometrie und lineare Algebra\nⓉ\n(\nAnalytical geometry and linear algebra\n)\npublished in\n1957\n. Keller writes in the introduction:-\nThe book is intended to introduce beginners to geometric and algebraic thought, so that it proceeds constantly from the concrete to the abstract. Axiomatics are omitted. An attempt is made to clarify the algebraic kernel of geometric concepts and methods of proof.\nKeller retired in\n1971\nfrom his professorship in Halle. However he continued to be active in mathematical research publishing papers such as\nNormalformen für Flächen\n3\n. Ordnung\nⓉ\n(\nNormal forms for surfaces of the\n3\nrd order\n)\n(1974)\n,\nInnere Punkte von kompakten konvexen Mengen unendlicher Dimension\nⓉ\n(\nInterior points of compact convex sets of infinite dimension\n)\n(1980)\n,\nDie Homologiegruppen der Mannigfaltigkeit, die aus den linearen k-Räumen auf einer nichtausgearteten\n2\nk-Quadrik besteht\nⓉ\n(\nThe homology groups of the variety, which consists of the linear k-space on a non-degenerate quadric\n2\nk\n)\n(1980)\n,\nDie Zahl\nⓉ\n(\nNumber\n)\n(1983)\n, and\nDas Zählen als angeborene Verhaltensweise\nⓉ\n(\nCounting as innate behavior\n)\n(1984)\n. He also published the book\nVorlesungen über algebraische Geometrie\nⓉ\n(\nLectures on algebraic geometry\n)\nin\n1974\n.",
  "matematicos_citados_na_biografia": [
    "Max Dehn",
    "George Hamel",
    "habilitation",
    "Cremona",
    "algebraic geometry",
    "Heinrich W E Jung",
    "Jung",
    "German Mathematical Society",
    "German Academy of Scientists Leopoldina",
    "continued fractions"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}