{
  "nome_completo": "Otto Toeplitz",
  "nome_curto": "Otto Toeplitz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Toeplitz/",
  "data_nascimento": "1 August 1881",
  "local_nascimento": "Breslau, Germany (now Wrocław, Poland)",
  "data_morte": "15 February 1940",
  "local_morte": "Jerusalem (under the British Mandate at the time)",
  "summary": "Toeplitz worked on infinite linear and quadratic forms. In the 1930 's he developed a general theory of infinite dimensional spaces and criticised Banach's work as being too abstract.",
  "biografia": "Otto Toeplitz\ncame from a Jewish family which contained several teachers of mathematics. Both his father, Emil Toeplitz, and his grandfather, Julius Toeplitz, taught mathematics in a\nGymnasium\nand they also both published mathematics papers. Otto was brought up in Breslau and he attended a Gymnasium in that city. His family background made it natural that he also should study mathematics.\nAfter completing his secondary education in Breslau, Toeplitz entered the university there to study mathematics. After graduating, he continued with his studies of\nalgebraic geometry\nat the University of Breslau, being awarded his doctorate in\n1905\n.\nIn\n1906\nToeplitz went to Göttingen.\nDieudonné\n, in\n[\n9\n]\ndescribes some of the work that Toeplitz did during his seven years in Göttingen. When he arrived there\nHilbert\nwas completing his theory of\nintegral equations\n. This greatly influenced Toeplitz who began to rework the classical theories of forms on\nn\nn\nn\n-dimensional spaces for infinite dimensional spaces. He wrote five papers directly related to\nHilbert\n's\nspectral theory\n. Also during this period he published a paper on summation processes and discovered the basic ideas of what are now called the 'Toeplitz operators'. When Toeplitz arrived in Göttingen,\nHellinger\nwas a doctoral student there. The two quickly became friends and they would collaborate closely for many years.\nHellinger\nleft Göttingen in\n1909\n, four years before Toeplitz, but before that the two were already producing joint papers.\nIt was not until\n1913\nthat Toeplitz was offered a teaching post as extraordinary professor at the University of Kiel. He was promoted to ordinary professor at Kiel in\n1920\n. A major joint project with\nHellinger\nto write a major encyclopaedia article on integral equations, which they worked on for many years, was completed during this time and appeared in print in\n1927\n. In\n1928\nToeplitz accepted an offer of a chair at the University of Bonn.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which, among others, exempted non-Aryans who had been in post before\n1914\n. Toeplitz kept his lecturing post in Bonn in\n1933\n.\nHowever Toeplitz was dismissed from his chair by the Nazis in\n1935\ndespite the exemption clause in the Civil Service Law which was simply disregarded after decisions at the Nuremberg party congress in the autumn of\n1935\n. Toeplitz had not instantly left Germany in\n1933\nwhen the Nazis came to power. As a proud Jew he started working for the Jewish community from that time. On a local level he united Jewish schoolchildren in Bonn and its vicinity bringing them to a Jewish school which he founded. On a country wide by level he selected gifted students for scholarships which allowed them to study abroad. His daughter Eva Wohl writes\n[\n13\n]\n:-\nOf course it was very painful for him to realize that some of his colleagues at the university had fallen into the Nazis trap; still there remained a handful of very faithful friends with whom he worked till the day of his emigration. My father was very happy to have the opportunity to emigrate to Palestine\n(\nas it then was\n)\nin\n1939\nand to be able to help in the building up of Jerusalem University. He had great plans for modernizing the university but unfortunately he became very ill and died a year after his arrival.\nToeplitz worked on infinite linear and\nquadratic forms\n. In the\n1930\ns he developed a general theory of infinite dimensional spaces and criticised\nBanach\n's work as being too abstract. In a joint paper with\nKöthe\nin\n1934\n, Toeplitz introduced, in the context of linear sequence spaces, some important new concepts and theorems.\nKöthe\n, in\n[\n12\n]\n, describes the:-\n... sometimes clumsy ways of our thinking ...\nwhich led to their discoveries. He also relates how the isomorphism problem for sequence spaces appeared in disguise as a new problem on nuclear\n(\nF\n)\n-spaces with basis.\nToeplitz was also very interested in the history of mathematics. For example he wrote an excellent book on the history of the calculus\nThe Calculus: A Genetic Approach\n(1963)\n. It was originally published posthumously in German in\n1949\nedited by\nG Köthe\n. An historical topic which interested him deeply was the relation between Greek mathematics and Greek philosophy. He was a frequent visitor to the Frankfurt Mathematics Seminar in the\n1920\ns and\n30\ns, where his friend\nHellinger\nworked from\n1914\n, and there the history of mathematics played a large role. Toeplitz believed\n[\n1\n]\n:-\n... that only a mathematician of stature is qualified to be a historian of mathematics.\nIt was not only the history of mathematics which interested outside his area of research in mathematics. He wrote a popular book on mathematics in collaboration with H\nRademacher\n. This work,\nThe Enjoyment of Mathematics\n, has been reprinted many times over the years. Toeplitz was also greatly interested in school mathematics and devoted much time to it.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "algebraic geometry",
    "Dieudonné",
    "Hilbert",
    "integral equations",
    "spectral theory",
    "Hellinger",
    "quadratic forms",
    "Banach",
    "Köthe",
    "G Köthe",
    "Rademacher"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}