{
  "nome_completo": "Ludwig Otto Hesse",
  "nome_curto": "Otto Hesse",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hesse/",
  "data_nascimento": "22 April 1811",
  "local_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "data_morte": "4 August 1874",
  "local_morte": "Munich, Germany",
  "summary": "Otto Hesse worked on the development of the theory algebraic functions and the theory of invariants. He is remembered particularly for introducing the Hessian determinant.",
  "biografia": "Otto Hesse\n's father was Johann Gottlieb Hesse who was a merchant and brewer. Otto's mother was Anna Karoline Reiter\n(1788\n-\n1865)\n. Born in Königsberg, Otto Hesse grew up in the famous city where he attended the Old City\nGymnasium\n. His father died in\n1829\nwhile he was at the high school. He graduated with his leaving certificate in\n1832\nand then entered the University of Königsberg.\nAt the university Hesse studied mathematics and natural sciences where his lectureres included\nJacobi\n,\nBessel\n,\nCarl Neumann\n, and F J Richelot. If it had not been for the inspired teachings of\nJacobi\n, Hesse may have chosen to specialise in a science subject other than mathematics. However Hesse graduated in\n1837\nwith a qualification which allowed him to teach mathematics, physics and chemistry in secondary schools, and then he spent a year as a probationary teacher at the Kneiphof Gymnasium in Königsberg. In the summer of\n1838\nhe travelled through Germany and Italy, furthering his education. Back in Königsberg by the start of the autumn school term he took up a post teaching physics and chemistry at a trade school there.\nHesse had continued to study for his doctorate under\nJacobi\n's supervision and he was awarded the degree from Königsberg in\n1840\nafter submitting his thesis\nDe octo punctis intersectionis trium superficium secundi ordinis\nⓉ\n(\nThe eight points of intersection of the second order\n)\n. In\n1841\nhe submitted his\nhabilitation\nthesis to Königsberg and was appointed as a\nprivatdozent\n. At this point he resigned his teaching position at the trade school. In the same year Hesse married Marie Sophie Emilie Dulk, the daughter of Friedrich Philipp Dulk\n(1788\n-\n1852)\nwho was the Professor of Chemistry at Königsberg; they had one son and five daughters.\nIn\n1845\nHesse was promoted to extraordinary professor at Königsberg and spent his most productive years there publishing most of his work in\nCrelle\n's Journal. Many famous mathematicians did their doctoral studies under Hesse's supervision. These doctoral include\nGustav Kirchhoff\nand\nCarl Neumann\nat Königsberg, but he also lectured to several other students there who would go on to become exceptional mathematicians including\nSiegfried Aronhold\n,\nAlfred Clebsch\nand\nRudolph Lipschitz\n. In\n1855\nHesse was appointed as an ordinary professor at Halle, but he only held this post for one year since when he was offered the chair at Heidelberg, to succeed Ferdinand Schweins, he was eager to accept and join his former students\nKirchhoff\nand Bunsen there. In\n1856\nhe took up the appointment in Heidelberg, officially taking up the position from\n9\nSeptember, and remained there until\n1868\nwhen he took up a post in the new Munich Polytechnic. We mentioned the famous students who undertook doctoral studies under Hesse's supervision at Königsberg. At the Ruprecht-Karls University of Heidelberg he had an even longer list of famous research students including\nAdolph Mayer\n,\nErnst Schröder\n,\nHeinrich Weber\n,\nOlaus Henrici\n, and\nMax Noether\n.\nHesse's main work was in the development of the theory of algebraic functions and the theory of invariants. Haas writes in\n[\n1\n]\n:-\nHis achievements can be evaluated, however, only in close connection with those of his contemporaries. Hesse was indebted to\nJacobi\n's investigations on the linear transformation of quadratic forms for the inspiration and starting point of his initial works on the theory of quadratic curves and planes. For proof\n(\nagain influenced by\nJacobi\n)\nhe used the newly developed\ndeterminants\nwhich allowed his presentation to reach an elegance not previously attained.\nIn fact Hesse introduced the 'Hessian determinant' in a paper in\n1842\nduring an investigation of cubic and quadratic curves. Subsequently this concept has been widely applied in\nalgebraic geometry\n.\nSome recent research has suggested that Hesse did much more than improve the presentation of certain results by\nJacobi\n. For example in\n[\n3\n]\nFraser presents a strong argument that Hesse's work was more fundamental than many have considered. He examines\nJacobi\n's\n1837\nresult on the calculus of variations and Hesse's reformulation in\n1857\n:-\nJacobi\n's result does not have much visibility in current texts on the calculus of variations and even less so Hesse's. Both have major contributions to this field, which might be considered the doorstep of\nfunctional analysis\n. After the important breakthrough of\nEuler\nand\nLagrange\n, it was a natural step to study the second variation.\nJacobi\nin\n1837\nproposed a theory of the second variation which was generally well received. In\n1857\nHesse published another presentation of the theory, which has been regarded merely as an improved exposition of\nJacobi\n's results. The author\n[\nof\n[\n3\n]\n]\nchallenges these views, attributing to Hesse an effectively distinct presentation of the theory. Indeed, Hesse shifts from an algorithmic approach to the calculus of variations to an emphasis on its analytical character. This was the line of research adopted in the method of fields of extremals, which characterizes progress in the calculus of variations in the late nineteenth century. Hesse might be considered a precursor of these developments.\nAnother result by Hesse which has proved particularly influential is the 'principle of transfer' which he gave in\n1866\nduring his work on projective geometry. How this influenced many different areas of mathematics is studied by Hawkins in the interesting paper\n[\n4\n]\n.\nWilhelm Meyer\ngave a general form of Hesse's principle of transfer in\n1883\nwhich in turn was used by\nCartan\nin\n1913\nto construct all irreducible representations of a complex semisimple\nLie algebra\n.\nHesse's work was also influenced by\nSteiner\n, particularly work he did on the geometrical interpretation of algebraic transformations.\nPlücker\nand\nPoncelet\nhad also made major contributions which Hesse built on. His student\nAronhold\nshowed that some of Hesse's results here were best possible. Hesse worked on some topics that\nCayley\nwas also working on and both produced a theory of homogeneous forms which they published at the same time.\nHaas writes in\n[\n1\n]\nof Hesse's contributions as a teacher:-\nHesse's teaching was also influential. In his long years as a lecturer, he continually showed his enthusiasm for mathematics, and his textbooks on analytical geometry must be seen in this context. the special forms of linear equation and of planar equation that Hesse used in these books are called Hesse's normal form of the linear equation and of the planar equation in all modern textbooks on the discipline.\nThe two textbooks which Hesse wrote during his years in Heidelberg are\nVorlesungen über analytische Geometrie des Raumes: insbesondere über Oberflächen zweiter Ordnung\nⓉ\n(\nLectures on the analytical geometry of space: in particular on surfaces of the second order\n)\n(1861)\nand\nVorlesungen über analytische Geometrie der geraden Linie, des Punktes und des Kreises in der Ebene\nⓉ\n(\nLectures on the analytical geometry of the straight line, the point and the circle in the plane\n)\n(1865)\n. Let us also mention his important paper\nSieben Vorlesungen aus der analytischen Geometrie der Kegelschnitte\nⓉ\n(\nSeven lectures on the analytical geometry of conic sections\n)\nwhich appeared in\nZeitschrift für Mathematik und Physik\nin\n1874\n.\nMany academies honoured Hesse with membership including the\nBerlin Academy of Sciences\nand the\nGöttingen Academy of Sciences\n(\nKönigliche Gesellschaft der Wissenschaften\n)\nin\n1856\nand the Bavarian Academy of Sciences\n(\nKöniglich Bayerischen Akademie der Wissenschaften\n)\nin Munich in\n1869\n. In\n1871\nhe became an honorary foreign member of the\nLondon Mathematical Society\n. He was also honoured with the award of the\nSteiner\nprize of the\nBerlin Academy of Sciences\nin\n1872\n.\nHesse died in Munich from a liver problem but was buried in Heidelberg at his request since he always felt that city to be his second home. His complete works was published by the Bavarian Academy of Sciences in\n1897\nwith a foreword by\nWalther von Dyck\n, S Gundelfinger,\nJacob Lüroth\nand\nMax Noether\n. The\n731\npage book was reprinted by the\nChelsea Publishing Company\nin\n1972\n(\nthis is the book\n[\n2\n]\n)\n.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Jacobi",
    "Bessel",
    "Carl Neumann",
    "habilitation",
    "privatdozent",
    "Crelle",
    "Gustav Kirchhoff",
    "Siegfried Aronhold",
    "Alfred Clebsch",
    "Rudolph Lipschitz",
    "Kirchhoff",
    "Adolph Mayer",
    "Ernst Schröder",
    "Heinrich Weber",
    "Olaus Henrici",
    "Max Noether",
    "determinants",
    "algebraic geometry",
    "functional analysis",
    "Euler",
    "Lagrange",
    "Wilhelm Meyer",
    "Cartan",
    "Lie algebra",
    "Steiner",
    "Plücker",
    "Poncelet",
    "Aronhold",
    "Cayley",
    "Berlin Academy of Sciences",
    "Göttingen Academy of Sciences",
    "London Mathematical Society",
    "Walther von Dyck",
    "Jacob Lüroth"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}