{
  "nome_completo": "Patrick Brendan Kennedy",
  "nome_curto": "Paddy Kennedy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kennedy/",
  "data_nascimento": "20 July 1929",
  "local_nascimento": "Clarecastle, County Clare, Ireland",
  "data_morte": "8 June 1966",
  "local_morte": "Nottingham, England",
  "summary": "Patrick Brendan Kennedy was an Irish mathematician who worked in complex analysis. As a young man he was an outstanding chess player.",
  "biografia": "Paddy Kennedy\n's parents were Pat Kennedy\n(\nborn\n1883)\nand Kit O'Sullivan\n(\nborn\n1897)\n. Pat and Kit Kennedy were married in\n1920\nand had five children: Tadhg Kennedy, Mary Anne\n(\nNancy\n)\nKennedy, Patrick Brendan Kennedy, Kitty Kennedy and Joan Kennedy. Pat Kennedy, Paddy's father, had been an apprentice carpenter in his father's firm but, despite being the eldest son, had gone against the tradition of following the family trade and he had joined the police force in\n1923\n. He joined at a significant time, just after the end of the Irish Civil War\n(1922\n-\n23)\nwhich followed the establishment of the Irish Free State. Paddy's mother Kit was the daughter of the blacksmith Patrick O'Sullivan from near Castlemaine. Paddy's\n[\n1\n]\n:-\n... mother's family were quiet-spoken and rather introverted people and pledged teetotallers.\nThe family moved to Ballylongford in\n1936\nwhen Pat Kennedy was stationed there. However, he wanted to be transferred to Cork so that his children might be able to receive a good secondary education. In\n1937\nwhen Paddy was eight years old, after a year in Ballylongford, he did manage to achieve the transfer to Cork and, in\n1941\n, Paddy entered the North Monastery secondary school in Cork. This school, on the north side of the city, had an excellent reputation and dated back to\n1811\n. Known as 'the Mon', the school had a particularly strong reputation for science. In\n1946\n, while at the North Monastery School, Kennedy won the Honan Scholarship to University College Cork. This scholarship had been set up in\n1909\nby Isabella Honan who was the last of a Cork merchant family that had made its fortune from the butter trade.\nKennedy entered University College Cork in\n1946\naiming at a science degree. This had not been his original intention which was to study medicine, but he had been persuaded that he should read for a science degree. He graduated in\n1949\nwith a B.Sc. degree with First Class Honours in Mathematics and Mathematical Physics. In the year he graduated, Kennedy took part in the Irish Chess Championship which was held in Galway. The Championship was organised as a\n7\n-round,\n16\n-player Swiss-system tournament. The Swiss system means that players are drawn to play against an opponent who, as far as possible, has the same score. Kennedy won each of the\n7\nrounds achieving the maximum score of\n7\n/\n7\n. This runaway win put him\n2\n1\n2\n2\\large\\frac{1}{2}\\normalsize\n2\n2\n1\n​\npoints clear of the next best player. The reference\n[\n3\n]\ngives each of Kennedy's seven games. David Kennedy, the son of Paddy Kennedy, writes\n[\n3\n]\n:-\nHis result will probably never be equalled. Not only did he win at the first attempt, but he also won with a\n100\n% record. The quality of his play was remarkable for a player who had never played outside of Cork prior to that event. According to Noel Mulcahy, a number of characteristic features can be seen in his games\n(\nsee\n[\n3\n]\nfor details of his games\n)\nat the championships. Firstly, a logical approach: he nearly always played what the position demanded, whether this involved a wild attack or precise manoeuvres. Secondly, a lack of nerves: in a crucial game\n(\nagainst J A Flood, see\n[\n3\n]\n)\nhe played an incredibly risky-looking line where his King was badly exposed. It must have taken a great deal of self-confidence and reliance on his own judgement and calculations. Finally, patience and a willingness to work hard at a position to build up small advantage.\nAfter graduating with a B.Sc. from Cork, Kennedy continued to study there for his Master's Degree. He was given a £\n300\nper annum position as a Demonstrator in the Mathematics and Mathematical Physics Departments at Cork for\n1949\n-\n50\n. This money allowed him to help support his elder brother Tadhg's studies at College. Paddy Barry writes\n[\n1\n]\n:-\nVery unusually he was not renewed as Demonstrator for\n1950\n-\n51\nand had to support himself by teaching in the Crawford Tech. This sowed the seeds of animosity in him towards those who made the decision.\nThe 'Crawford Tech' referred to in this quote is the Crawford Municipal Technical Institute which was founded in\n1912\n. It trained students in Science and Engineering and is now part of the Cork Institute of Technology. Mathematics and chess were not the only two passions in Kennedy's life, however for he\n[\n2\n]\n:-\n... was also a very promising pianist. He had lessons in\n1950\nfrom Mrs Tilly Fleischmann and learnt very quickly to play Chopin. She said of him at the time that he was the only pupil she had had, who never played a wrong note. He was also very interested in listening to music, chiefly Beethoven, and his general conversation suggested the arts man rather than the scientist.\nTilly Fleischmann\n(1882\n-\n1967)\nwas a famous Irish pianist, born in Cork of German descent, who, in addition to performing, taught the piano for over sixty years to advanced pupils.\nIn\n1951\nKennedy completed his M.Sc. studies and was examined by Vicenzo Consolato Antonino Ferraro\n(1902\n-\n1974)\nwho, at that time, was professor of applied mathematics at the University College of the South West at Exeter\n(\nnow the University of Exeter\n)\n. Ferraro was particularly impressed by Kennedy's work in analysis and recommended that he study for a Ph.D. with\nWalter Hayman\nat Exeter. Kennedy was awarded an M.Sc. with First Class Honours from the National University of Ireland, and was awarded the Travelling Studentship in Mathematical Sciences of the National University of Ireland. He took Ferraro's advice and went to Exeter to undertake research advised by\nHayman\n.\nHayman\nhad been appointed as a Lecturer in Mathematics at Exeter in\n1947\nand Kennedy became his first research student.\nHayman\nwrites\n[\n2\n]\n:-\nThe following two years were very happy for us both. We were young and enthusiastic and had long conversations about functions walking in Rougemont gardens and other places around Exeter. I had recently returned from America full of the ideas of Maurice Heins\n(1915\n-\n2015)\nand put Paddy onto a question raised by Heins. This he solved in a thoroughly elegant manner. But the teaching was both ways. Heini Halberstam\n(1926\n-\n2014)\nand I and some of our other colleagues benefited from a course on\nprobability\nand\nmeasure theory\ngiven by Paddy. Paddy was a wonderful conversationalist and tremendous good company. I have known few greater joys in life than sitting opposite him each smoking a cigarette and chatting, oblivious of time.\nKennedy's first paper was\nOn a conjecture of Heins\nwhich he submitted to the\nProceedings\nof the\nLondon Mathematical Society\non\n12\nSeptember\n1953\n. The paper is related to a conjecture of Heins on subharmonic functions and gives positive results. Kennedy promises a further paper giving an example of a class of integral functions which shows these positive results are best possible and provides a counter-example to Heins' conjecture. Kennedy gives the following acknowledgement:-\nI wish to express my gratitude to Mr\nW K Hayman\n, whose guidance and advice were invaluable at all stages of the preparation of this paper. The author is a Travelling Student of the National University of Ireland.\nKennedy was appointed as an assistant lecturer in mathematics at Aberystwyth in autumn\n1953\n. He married Pamela Fishwick in March\n1954\nin Aberystwyth; they had three children, David Patrick Kennedy, Anne Deirdre Kennedy, and Jane C Deborah Kennedy. He was awarded a Ph.D. by the National University of Ireland in\n1954\nfor his thesis\nAsymptotic Values on Integral Functions\n. At this time National Service was compulsory and, as someone living in Wales, he would have had to have served in the British Army for a year. This was not a pleasant prospect for a patriotic Irishman so he only taught in Aberystwyth for a year before returning to Cork as a lecturer in mathematics taking up the appointment in the autumn of\n1954\n. The vacancy had occurred since Henry St John Atkins, the Professor of Mathematics at University College Cork, had become became president of the college. Barry writes\n[\n1\n]\n:-\nKennedy's objectives from the start in\n1954\nwere to raise standards, to do rigorous mathematics, to modernise the courses, and to encourage and help all the other staff to be active in research.\nHe continued with a remarkable research output, with papers:\nIntegrability theorems for power series\n(1955)\n,\nConformal mapping of bounded domains\n(1956)\n, and\nA class of integral functions bounded on certain curves\n(1956)\n. In this last mentioned paper, submitted in March\n1955\n, Kennedy writes:-\nI wish to express my warm thanks to Mr\nW K Hayman\nfor much valuable advice during the preparation of this paper. ... The material of this paper forms part of a Thesis submitted for the Ph.D. degree of the National University of Ireland.\nHis remarkable publication record continued with:\nA note on uniformly distributed sequences\n(1956)\n,\nFourier series with gaps\n(1956)\n,\nGeneral integrability theorems for power series\n(1957)\n,\nFourier series with gaps. II\n(1957)\n,\nRemark on a theorem of Zygmund\n(1958)\n,\nOn the coefficients in certain Fourier series\n(1958)\n. This last mentioned paper acknowledges support as follows:-\nResearch supported in part by the Air Research and Development Command, United States Air Force, through its European Office ...\nSome of Kennedy's papers listed below also acknowledge the same source of support. Further papers were:\n(\nwith WK\nHayman\n)\nOn the growth of multivalent functions\n(1958)\n,\nA remark on continuity conditions\n(1959)\n,\nA property of bounded regular functions\n(1959)\n, and\nOn a theorem of Hayman concerning quasi-bounded functions\n(1959)\n.\nPaddy Barry was a research student at Cork advised by Kennedy. He writes\n[\n1\n]\n:-\n[\nKennedy\n]\nwas very enthusiastic about, and interested in, mathematics. He was an excellent teacher, committed to proof, explained clearly, was unhurried, gave model notes , exhorted, encouraged and inspired. He prepared a booklet on real analysis for students. He was informal with senior students; I had most of my post-graduate lectures from him on a\n2\nft ×\n2\nft table in the College restaurant. He won the admiration and loyalty of repeated classes of students. I regard him as having been a watershed in the department. Before him there were oldish courses and little research for a long time. Soon after he arrived there was fairly normal activity.\nKennedy was appointed Professor of Mathematics at Cork in\n1956\n. He was awarded the D.Sc. by the National University of Ireland in\n1960\nand was elected a Fellow of the Royal Irish Academy in\n1962\n. He took study leave in\n1961\n-\n62\nand on his return to Cork he applied for the chair of mathematics at the University of York. This was a new university which opened in\n1963\nwith just\n230\nstudents. Kennedy was the first professor of mathematics, appointed before the university opened. He worked at building the mathematics library and appointing staff to the mathematics department before the opening in\n1963\n.\nHayman\nwrites\n[\n2\n]\n:-\nThroughout his career as a university teacher Paddy threw himself with great gusto into academic politics. He saw things in black and white colours and had no hesitation in telling everybody that it would be iniquitous to do anything but A even when it was fairly clear that course B would in fact be adopted. Coming from a very young Professor such an attitude sometimes caused resentment. It also caused him a great deal of disappointment when some of the things he hoped for did not come off. He could not be above the battle. If he was in something, whether it was a committee or a problem in mathematics he was in it up to the neck. In this way he got a good deal done both mathematically and in building up the departments at both Cork and York, but at high cost to his nerves.\nIn\n1965\nKennedy was appointed as External Examiner in Mathematics for the National University of Ireland. The first students who had entered the University of York in\n1963\nwere due to take their final examinations in the summer of\n1966\n. Hayman writes:-\nHe was extremely conscientious and his final tragic breakdown can only be attributed to excessive and quite unnecessary worry about his students and his work.\nOn the night of\n8\nJune\n1966\n, Kennedy took his own life in a hotel in Nottingham.\nWe should say a little more about Kennedy's chess career. He was the youngest winner of the Irish Chess Championship at age\n20\nin\n1949\nwith a\n7\n/\n7\nscore which has never been equalled. One might have expected him to have gone on to a stunning chess career but, rather strangely, he never again displayed the brilliance he had shown at the\n1949\nChampionship. His son, David, explains that there was\n[\n3\n]\n:-\n... a falling off in the quality of his play in autumn\n1949\nand he resigned from the Cork Championship after playing\n(\nand winning\n)\nonly two games. Mulcahy suggests this may have been down to a sense of anti-climax after the Irish coupled with unexpected difficulty in beating weaker players. About the same time, nerves began to affect him and his remaining formal competition results were poor.\nAt the time of his death Kennedy was writing a book on the applications of subharmonic functions to function theory.\nHayman\ncompleted the book and\nSubharmonic functions. Vol. I\nwas published in\n1976\nwith Kennedy and Hayman as joint authors. D H Armitage writes in a review of the book:-\nThis book gives a clear and attractive account of the theory of subharmonic functions in domains of Euclidean spaces\nR\nm\n(\nm\n≥\n2\n)\n\\mathbb{R}^{m} (m ≥ 2)\nR\nm\n(\nm\n≥\n2\n)\nand illuminates the connections and analogies with classical complex variable theory particularly well.\nHayman\nwrites an Acknowledgement section in the book:-\nThis project was started by my friend and former student Professor P B Kennedy. His tragic death in\n1966\nmade it impossible for him to finish the work. I hope it may serve as a memorial to a deeply conscientious and extremely charming person whom I still miss greatly.",
  "matematicos_citados_na_biografia": [
    "Walter Hayman",
    "Hayman",
    "probability",
    "measure theory",
    "London Mathematical Society",
    "W K Hayman"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}