{
  "nome_completo": "Pafnuty Lvovich Chebyshev",
  "nome_curto": "Pafnuty Chebyshev",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chebyshev/",
  "data_nascimento": "16 May 1821",
  "local_nascimento": "Okatovo, Kaluga Region, Russia",
  "data_morte": "8 December 1894",
  "local_morte": "St Petersburg, Russia",
  "summary": "Pafnuty Chebyshev is largely remembered for his investigations in number theory. Chebyshev was also interested in mechanics and is famous for the orthogonal polynomials he invented.",
  "biografia": "Pafnuty Chebyshev\n's parents were Agrafena Ivanova Pozniakova and Lev Pavlovich Chebyshev. Pafnuty was born in Okatovo, a small town in western Russia, south-west of Moscow. At the time of his birth his father had retired from the army, but earlier in his military career Lev Pavlovich had fought as an officer against Napoleon's invading armies. Pafnuty Lvovich was born on the small family estate into a upper class family with an impressive history. Lev Pavlovich and Agrafena Ivanova had nine children some of whom followed in their father's military tradition.\nLet us say a little about life in Russia at the time Pafnuty Lvovich was growing up. There was a great deal of national pride in the country following the Russian defeat of Napoleon, and their victory led to Russia being viewed by other European countries with a mixture of fear and respect. On the one hand there was those in the country who viewed Russia as superior to other countries and argued that it should isolate itself from them. On the other hand, educated young Russians who had served in the army had seen Europe, learned to read and speak French and German, knew something of European culture, literature, and science, and they argued for a westernisation of the country.\nPafnuty Lvovich's early education was at home where both his mother and his cousin Avdotia Kvintillianova Soukhareva were his teachers. From his mother he learnt the basic skills of reading and writing, while his cousin acted as a governess to the young boy and taught him French and arithmetic. Later in life Pafnuty Lvovich would greatly benefit from his fluency in French, for it would make France a natural place to visit, French a natural language in which to communicate mathematics on an international stage, and provide a link with the leading European mathematicians. All was not easy for the young boy, however, for with one leg longer than the other he had a limp which prevented him from taking part in many of the normal childhood activities.\nIn\n1832\n, when Pafnuty Lvovich was eleven years old, the family moved to Moscow. There he continued to be educated at home but he was now tutored in mathematics by P N Pogorelski who was considered the best elementary mathematics tutor in Moscow. Pogorelski was the author of some of the most popular elementary mathematics texts in Russia at the time and certainly inspired his pupil and gave him a solid mathematical education. Chebyshev was, therefore, well prepared for his study of the mathematical sciences when he entered Moscow University in\n1837\n.\nThe Russian university system that Chebyshev entered had undergone considerable change. Moscow University that he entered had been founded in\n1755\nand modelled on the German universities. However following the Russian victory over Napoleon there was the westernising movement in the country which we mentioned above. Alexander I, the emperor of Russia, saw the universities as the breeding grounds for what he considered as dangerous doctrines coming from western Europe and the universities were put under pressure in the\n1820\ns to dismiss staff who taught such doctrines. A new minister of education was appointed in\n1833\nunder Nicholas I, who had become Russian emperor in\n1825\n, and he promoted a freer intellectual atmosphere in the universities but on the other hand children of the lower classes were excluded.\nAt Moscow University the person who was to influence Chebyshev most was\nNikolai Dmetrievich Brashman\nwho had been professor of applied mathematics at the university since\n1834\n.\nBrashman\nwas particularly interested in mechanics but his interests were wide ranging and, in addition to courses on mechanical engineering and hydraulics, he taught his students the theory of integration of algebraic functions and the calculus of\nprobability\n. Chebyshev always acknowledged the great influence\nBrashman\nhad been on him while studying at university, and credited him as the main influence in directing his research interests, referring to their \"precious personal talks\".\nThe department of physics and mathematics in which Chebyshev studied announced a prize competition for the year\n1840\n-\n41\n. Chebyshev submitted a paper on\nThe calculation of roots of equations\nin which he solved the equation\ny\n=\nf\n(\nx\n)\ny = f (x)\ny\n=\nf\n(\nx\n)\nby using a series expansion for the inverse function of\nf\nf\nf\n. The paper was not published at the time\n(\nalthough it was published in the\n1950\ns\n)\nand it was awarded only second prize in the competition rather than the Gold Medal it almost certainly deserved. Chebyshev graduated with his first degree in\n1841\nand continued to study for his Master's degree under\nBrashman\n's supervision.\nOnce, much later in his career, Chebyshev objected to being described as a \"splendid Russian mathematician\" and said that surely he was a \"world-wide mathematician\" rather than a Russian mathematician. It is very clear that right from the time he began his studies for his Master's degree that Chebyshev aimed at international recognition. His very first paper was written in French and was on multiple integrals. He submitted the paper to\nLiouville\nin late\n1842\nand the paper appeared in\nLiouville\n's journal in\n1843\n. It contains a formula which is stated without proof and the following paper in the first part of volume\n8\nof the journal contains a proof of the formula given by\nCatalan\n. In\n[\n12\n]\nthe authors suggest that Chebyshev may have visited Paris in\n1842\naccompanying the Russian geographer Chikhachev who certainly met\nCatalan\n(\nwho assisted\nLiouville\nin producing his journal\n)\nin December of that year. There is no conclusive evidence, but it must be highly likely that if Chebyshev did not personally visit Paris in\n1842\nthen he sent his paper to\nLiouville\nvia Chikhachev.\nChebyshev continued to aim at international recognition with his second paper, written again in French, appearing in\n1844\npublished by\nCrelle\nin his journal. This paper was on the convergence of\nTaylor series\n. In the summer of\n1846\nChebyshev was examined on his Master's thesis and in the same year published a paper based on that thesis, again in\nCrelle\n's journal. The thesis was on the theory of probability, and in it he developed the main results of the theory in a rigorous but elementary way. In particular the paper he published from his thesis examined\nPoisson\n's weak law of large numbers.\nDuring\n1843\nChebyshev produced a first draft of a thesis which he intended to submit to obtain his right to lecture once he found a suitable position. Times were hard and Moscow had no suitable positions available for Chebyshev but, in\n1847\n, he was appointed to the University of St Petersburg submitting his thesis\nOn integration by means of logarithms\n. In it he generalised methods of\nOstrogradski\nto show that a conjecture which\nAbel\nmade in\n1826\nabout the integral of\nf\n(\nx\n)\n/\n√\nR\n(\nx\n)\nf (x)/√R(x)\nf\n(\nx\n)\n/\n√\nR\n(\nx\n)\n, where\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nand\nR\n(\nx\n)\nR(x)\nR\n(\nx\n)\nare polynomials, was true. In a report which he wrote about a visit to Paris in\n1852\n, Chebyshev described how he was asked to develop the ideas further\n(\nsee for example\n[\n11\n]\n)\n:-\nLiouville\nand\nHermite\nsuggested the idea of developing the ideas on which my thesis had been based. ... in the thesis I considered the case where the differential under the integral contains the square root of a\nrational function\n. But it was interesting in several respects to extend those principles to a root of any degree.\nAlthough Chebyshev's thesis was not published until after his death, he published a paper containing some of its results in\n1853\n.\nBetween arriving in St Petersburg and this\n1853\npublication Chebyshev published some of his most famous results on number theory. He wrote an important book\nTeoria sravneny\non the theory of congruences which he submitted for his doctorate, defending it on\n27\nMay\n1849\n. This work also received a prize from the\nAcademy of Sciences\n. He collaborated with\nBunyakovsky\nin producing a complete edition of\nEuler\n's\n99\nnumber theory\npapers which they published in two volumes in\n1849\n. Chebyshev's work on\nprime numbers\nincluded the determination of the number of primes not exceeding a given number, published in\n1848\n, and a proof of\nBertrand\n's conjecture.\nIn\n1845\nBertrand\nconjectured that there was always at least one prime between\nn\nn\nn\nand\n2\nn\n2n\n2\nn\nfor\nn\n>\n3\nn > 3\nn\n>\n3\n. Chebyshev proved\nBertrand\n's conjecture in\n1850\n. Chebyshev also came close to proving the\nPrime Number Theorem\n, proving that if\nπ\n(\nn\n)\nlog\n⁡\ne\nn\nn\n\\Large {\\frac { \\pi(n) \\log_{e} n}  n}\nn\nπ\n(\nn\n)\nl\no\ng\ne\n​\nn\n​\n(\nwith\nπ\n(\nn\n)\n\\pi (n)\nπ\n(\nn\n)\nthe number of primes ≤\nn\nn\nn\n)\nhad a limit as\nn\n→\n∞\nn \\to \\infty\nn\n→\n∞\nthen that limit is\n1\n. He was unable to prove, however, that\nl\ni\nm\nn\n→\n∞\nπ\n(\nn\n)\nlog\n⁡\ne\nn\nn\nlim_{n \\to \\infty }\\Large {\\frac { \\pi(n) \\log_{e} n}  n}\nl\ni\nm\nn\n→\n∞\n​\nn\nπ\n(\nn\n)\nl\no\ng\ne\n​\nn\n​\n.\nexists. The proof of this result was only completed two years after Chebyshev's death by\nHadamard\nand\n(\nindependently\n)\nde la Vallée Poussin\n.\nChebyshev was promoted to extraordinary professor at St Petersburg in\n1850\n. Two years later, between July and November\n1852\n, he visited France, London and Germany. We mentioned above his report on that trip during which he had the opportunity to investigate various steam engines and their mechanics in practice. His report covers his studies of applied mechanics as well as his discussions with French mathematicians including\nLiouville\n,\nBienaymé\n,\nHermite\n,\nSerret\n,\nPoncelet\n, and English mathematicians including\nCayley\nand\nSylvester\n. In Berlin he met\nDirichlet\n:-\nIt was of great interest for me to become acquainted with the celebrated geometer Lejeune-Dirichlet. ...\n[\nI\n]\nfound an occasion each day to talk with this geometer concerning\n[\napplications of calculus to number theory\n]\nas well as other questions on pure and applied analysis. ...\n[\nI attended\n]\nwith particular pleasure one of his lectures on theoretical mechanics.\nIn fact Chebyshev's interest both in the theory of mechanisms and in the theory of approximation stem from his\n1852\ntrip. In\n[\n31\n]\nTikhomirov studied Chebyshev's work on approximation theory and writes:-\nChebyshev ... set the foundations of the Russian school of approximation theory: we show the relation of Chebyshev's ideas in approximation theory to applied problems\n(\ntheory of mechanisms and computational mathematics\n)\n.\nPapers which arose as a direct consequence of the trip included\nThéorie des mécanismes connus sous le nom de parallélogrammes\npublished in\n1854\n. It was in this work that his famous Chebyshev polynomials appeared for the first time but he later went on to develop a general theory of orthogonal polynomials. In\n[\n28\n]\nRoy discusses his contributions to on orthogonal polynomials and puts the work into its historical context:-\nChebyshev was probably the first mathematician to recognise the general concept of orthogonal polynomials. A few particular orthogonal polynomials were known before his work.\nLegendre\nand\nLaplace\nhad encountered the\nLegendre\npolynomials in their work on celestial mechanics in the late eighteenth century.\nLaplace\nhad found and studied the\nHermite\npolynomials in the course of his discoveries in probability theory during the early nineteenth century. Other isolated instances of orthogonal polynomials occurring in the work of various mathematicians is mentioned later. It was Chebyshev who saw the possibility of a general theory and its applications. His work arose out of the theory of least squares approximation and probability; he applied his results to interpolation, approximate quadrature and other areas. He discovered the discrete analogue of the\nJacobi\npolynomials but their importance was not recognized until this century. They were rediscovered by\nHahn\nand named after him upon their rediscovery. Geronimus has pointed out that in his first paper on orthogonal polynomials, Chebyshev already had the\nChristoffel\n-\nDarboux\nformula.\nThe trip Chebyshev undertook in\n1852\nwas one of many. In addition to the mathematicians we have mentioned that he met on that trip, he also had contacts with other European mathematicians such as\nLucas\n,\nBorchardt\n,\nKronecker\n, and\nWeierstrass\n(\nsee for example\n[\n12\n]\n)\n. Almost every summer Chebyshev travelled in Western Europe, but when he did not, he spent the summer in Catherinenthal near Reval\n(\nnow known as Tallinn in Estonia\n)\n. We do not have full information about his many Western European visits, but we do know that he spoke at sessions of the French Association for the Advancement of Science between\n1873\nand\n1882\n, presenting sixteen reports, being at the meetings in Lyon in\n1873\n, Clermont-Ferrand in\n1876\n, Paris in\n1878\n, and La Rochelle in\n1882\n. In addition to his\n1852\ntrip to France, and those just mentioned between\n1873\nand\n1882\n, we have records of visits he made in\n1856\n,\n1864\n,\n1884\nand\n1893\n. The\n1884\nvisit, which probably saw him visit a number of European universities, ended at the University of Liège where he led the celebrations to honour\nCatalan\n's retirement.\nWe have mentioned some contributions that Chebyshev made to the theory of probability. In\n1867\nhe published a paper\nOn mean values\nwhich used\nBienaymé\n's inequality to give a generalised law of large numbers. As a result of his work on this topic the inequality today is often known as the\nBienaymé\n-Chebyshev inequality. Twenty years later Chebyshev published\nOn two theorems concerning probability\nwhich gives the basis for applying the theory of probability to statistical data, generalising the central limit theorem of\nde Moivre\nand\nLaplace\n. Of this\nKolmogorov\nwrote\n(\nsee for example\n[\n1\n]\n)\n:-\nThe principal meaning of Chebyshev's work is that through it he always aspired to estimate exactly in the form of inequalities absolutely valid under any number of tests the possible deviations from limit regularities. Further, Chebyshev was the first to estimate clearly and make use of such notions as \"random quantity\" and its \"expectation\n(\nmean\n)\nvalue\".\nLet us mention a few further aspects of Chebyshev's work. In the theory of integrals he generalised the\nbeta function\nand examined integrals of the form\n∫\nx\np\n(\n1\n−\nx\n)\nq\nd\nx\n\\int   x^{p} (1 - x)^{q} dx\n∫\nx\np\n(\n1\n−\nx\n)\nq\nd\nx\n.\nOther topics to which he contributed were the construction of maps, the calculation of geometric volumes, and the construction of calculating machines in the\n1870\ns. In mechanics he studied problems involved in converting rotary motion into rectilinear motion by mechanical coupling. The Chebyshev parallel motion is three linked bars approximating rectilinear motion. He wrote many papers on his mechanical inventions;\nLucas\nexhibited models and drawings of some of these at the Conservatoire National des Arts et Métiers in Paris. In\n1893\nseven of his mechanical inventions were exhibited at the World's Exposition in Chicago, organised to celebrate the\n400\nth\nanniversary of Christopher Columbus's discovery of America, including his invention of a special bicycle for women.\nA number of famous mathematicians were taught by Chebyshev and gave a descriptions of him as a lecturer. The first quote we give is by\nLyapunov\nwho attended lectures by Chebyshev in the\n1870\ns. The quote is given in a number of places\n(\nsee for example\n[\n1\n]\nor\n[\n11\n]\n)\n:-\nHis courses were not voluminous, and he did not consider the quantity of knowledge delivered; rather, he aspired to elucidate some of the most important aspects of the problems he spoke on. These were lively, absorbing lectures; curious remarks on the significance and importance of certain problems and scientific methods were always abundant. Sometimes he made a remark in passing, in connection with some concrete case they had considered, but those who attended always kept it in mind. Consequently his lectures were highly stimulating; students received something new and essential at each lecture; he taught broader views and unusual standpoints.\nOur second quote concerning Chebyshev as a teacher comes from the writings of Dmitry\nGrave\nwho attended lectures by Chebyshev in the\n1880\ns\n(\nsee for example\n[\n11\n]\n)\n:-\nChebyshev was a wonderful lecturer. His courses were very short. As soon as the bell sounded, he immediately dropped the chalk, and, limping, left the auditorium. On the other hand he was always punctual and not late for classes. Particularly interesting were his digressions when he told us about what he had spoken outside the country or about the response of\nHermite\nor others. Then the whole auditorium strained not to miss a word.\nLet us quote from a lecture given by Chebyshev in\n1856\nwhere he explained how he saw the interaction of the pure and applied sides of mathematics. It is an interesting quote, for much of Chebyshev's work in mathematics was done following these principles\n(\nsee for example\n[\n1\n]\nor\n[\n11\n]\n)\n:-\nThe closer mutual approximation of the points of view of theory and practice brings most beneficial results, and it is not exclusively the practical side that gains; under its influence the sciences are developing in that this approximation delivers new objects of study or new aspects in subjects long familiar. In spite of the great advance of the mathematical sciences due to the works of the outstanding mathematicians of the last three centuries, practice clearly reveals their imperfection in many respects; it suggests problems essentially new for science and thus challenges one to seek quite new methods. And if theory gains much when new applications or developments of old methods occur, the gain is still greater when new methods are discovered; and here science finds a reliable guide in practice.\nAs to Chebyshev's personal life, he never married and lived alone in a large house with ten rooms. He was rich, spending little on everyday comforts but he had one great love, namely that of buying property. It was on this that he spent most of his money but he did financially support a daughter whom he refused to officially acknowledge. He did spend time with this daughter, especially after she married a colonel. Chebyshev often met her and her husband in Rudakovo at the home of his sister Nadiejda.\nChebyshev retired from his professorship at St Petersburg University in\n1882\n; he had been appointed to this particular post\n22\nyears earlier. He had received many honours during his career and a few more were still to come his way. He became a junior academician of the\nSt Petersburg Academy of Sciences\nin\n1853\nwith the chair of applied mathematics, an extraordinary academician in\n1856\nand an ordinary academician in\n1859\n, again with the chair of applied mathematics. He was elected a Corresponding Member of the Société Royale des Sciences of Liège in\n1856\n, of the Société Philomathique, also in\n1856\n, of the\nBerlin Academy of Sciences\nin\n1871\n, the Bologna Academy in\n1873\n, the\nRoyal Society of London\nin\n1877\n, the Italian Royal Academy in\n1880\n, and the\nSwedish Academy of Sciences\nin\n1893\n. He was elected a Corresponding Member of the Institut de France in\n1860\nand a foreign associate of the Institut in\n1874\n. In addition every Russian university elected him to an honorary position, he became an honorary member of the St Petersburg Artillery Academy and the was awarded the French Légion d'Honneur.",
  "matematicos_citados_na_biografia": [
    "Nikolai Dmetrievich Brashman",
    "Brashman",
    "probability",
    "Liouville",
    "Catalan",
    "Crelle",
    "Taylor series",
    "Poisson",
    "Ostrogradski",
    "Abel",
    "Hermite",
    "rational function",
    "Academy of Sciences",
    "Bunyakovsky",
    "Euler",
    "number theory",
    "prime numbers",
    "Bertrand",
    "Prime Number Theorem",
    "Hadamard",
    "de la Vallée Poussin",
    "Bienaymé",
    "Serret",
    "Poncelet",
    "Cayley",
    "Sylvester",
    "Dirichlet",
    "Legendre",
    "Laplace",
    "Jacobi",
    "Hahn",
    "Christoffel",
    "Darboux",
    "Lucas",
    "Borchardt",
    "Kronecker",
    "Weierstrass",
    "de Moivre",
    "Kolmogorov",
    "beta function",
    "Lyapunov",
    "Grave",
    "St Petersburg Academy of Sciences",
    "Berlin Academy of Sciences",
    "Royal Society of London",
    "Swedish Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}