{
  "nome_completo": "Panini",
  "nome_curto": "Panini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Panini/",
  "data_nascimento": "about 520 BC",
  "local_nascimento": "Shalatula (near Attock), now Pakistan",
  "data_morte": "about 460 BC",
  "local_morte": "India",
  "summary": "Panini was a Sanskrit grammarian who gave a comprehensive and scientific theory of phonetics, phonology, and morphology.",
  "biografia": "Panini\nwas born in Shalatula, a town near to Attock on the Indus river in present day Pakistan. The dates given for Panini are pure guesses. Experts give dates in the\n4\nth\n,\n5\nth\n,\n6\nth\nand\n7\nth\ncentury BC and there is also no agreement among historians about the extent of the work which he undertook. What is in little doubt is that, given the period in which he worked, he is one of the most innovative people in the whole development of knowledge. We will say a little more below about how historians have gone about trying to pinpoint the date when Panini lived.\nPanini was a Sanskrit grammarian who gave a comprehensive and scientific theory of phonetics, phonology, and morphology. Sanskrit was the classical literary language of the Indian Hindus and Panini is considered the founder of the language and literature. It is interesting to note that the word \"Sanskrit\" means \"complete\" or \"perfect\" and it was thought of as the divine language, or language of the gods.\nA treatise called\nAstadhyayi\n(\nor\nAstaka\n)\nis Panini's major work. It consists of eight chapters, each subdivided into quarter chapters. In this work Panini distinguishes between the language of sacred texts and the usual language of communication. Panini gives formal production rules and definitions to describe Sanskrit grammar. Starting with about\n1700\nbasic elements like nouns, verbs, vowels, consonants he put them into classes. The construction of sentences, compound nouns etc. is explained as ordered rules operating on underlying structures in a manner similar to modern theory. In many ways Panini's constructions are similar to the way that a mathematical function is defined today. Joseph writes in\n[\n2\n]\n:-\n[\nSanskrit's\n]\npotential for scientific use was greatly enhanced as a result of the thorough systemisation of its grammar by Panini. ... On the basis of just under\n4000\nsutras\n[\nrules expressed as aphorisms\n]\n, he built virtually the whole structure of the Sanskrit language, whose general 'shape' hardly changed for the next two thousand years. ... An indirect consequence of Panini's efforts to increase the linguistic facility of Sanskrit soon became apparent in the character of scientific and mathematical literature. This may be brought out by comparing the grammar of Sanskrit with the geometry of Euclid - a particularly apposite comparison since, whereas mathematics grew out of philosophy in ancient Greece, it was ... partly an outcome of linguistic developments in India.\nJoseph goes on to make a convincing argument for the algebraic nature of Indian mathematics arising as a consequence of the structure of the Sanskrit language. In particular he suggests that algebraic reasoning, the Indian way of representing numbers by words, and ultimately the development of modern number systems in India, are linked through the structure of language.\nPanini should be thought of as the forerunner of the modern formal language theory used to specify computer languages. The Backus Normal Form was discovered independently by\nJohn Backus\nin\n1959\n, but Panini's notation is equivalent in its power to that of\nBackus\nand has many similar properties. It is remarkable to think that concepts which are fundamental to today's theoretical computer science should have their origin with an Indian genius around\n2500\nyears ago.\nAt the beginning of this article we mentioned that certain concepts had been attributed to Panini by certain historians which others dispute. One such theory was put forward by B Indraji in\n1876\n. He claimed that the Brahmi numerals developed out of using letters or syllables as numerals. Then he put the finishing touches to the theory by suggesting that Panini in the eighth century BC\n(\nearlier than most historians place Panini\n)\nwas the first to come up with the idea of using letters of the alphabet to represent numbers.\nThere are a number of pieces of evidence to support Indraji's theory that the Brahmi numerals developed from letters or syllables. However it is not totally convincing since, to quote one example, the symbols for\n1\n,\n2\nand\n3\nclearly do not come from letters but from one, two and three lines respectively. Even if one accepts the link between the numerals and the letters, making Panini the originator of this idea would seem to have no more behind it than knowing that Panini was one of the most innovative geniuses that world has known so it is not unreasonable to believe that he might have made this step too.\nThere are other works which are closely associated with the\nAstadhyayi\nwhich some historians attribute to Panini, others attribute to authors before Panini, others attribute to authors after Panini. This is an area where there are many theories but few, if any, hard facts.\nWe also promised to return to a discussion of Panini's dates. There has been no lack of work on this topic so the fact that there are theories which span several hundreds of years is not the result of lack of effort, rather an indication of the difficulty of the topic. The usual way to date such texts would be to examine which authors are referred to and which authors refer to the work. One can use this technique and see whom Panini mentions.\nThere are ten scholars mentioned by Panini and we must assume from the context that these ten have all contributed to the study of Sanskrit grammar. This in itself, of course, indicates that Panini was not a solitary genius but, like\nNewton\n, had \"stood on the shoulders of giants\". Panini must have lived later than these ten but this is absolutely no help in providing dates since we have absolutely no knowledge of when any of these ten lived.\nWhat other internal evidence is there to use? Well of course Panini uses many phrases to illustrate his grammar any these have been examined meticulously to see if anything is contained there to indicate a date. To give an example of what we mean: if we were to pick up a text which contained as an example \"I take the train to work every day\" we would know that it had to have been written after railways became common. Let us illustrate with two actual examples from the\nAstadhyayi\nwhich have been the subject of much study. The first is an attempt to see whether there is evidence of Greek influence. Would it be possible to find evidence which would mean that the text had to have been written after the conquests of Alexander the Great? There is a little evidence of Greek influence, but there was Greek influence on this north east part of the Indian subcontinent before the time of Alexander. Nothing conclusive has been identified.\nAnother angle is to examine a reference Panini makes to nuns. Some argue that these must be Buddhist nuns and therefore the work must have been written after Buddha. A nice argument but there is a counter argument which says that there were Jaina nuns before the time of Buddha and Panini's reference could equally well be to them. Again the evidence is inconclusive.\nThere are references by others to Panini. However it would appear that the Panini to whom most refer is a poet and although some argue that these are the same person, most historians agree that the linguist and the poet are two different people. Again this is inconclusive evidence.\nLet us end with an evaluation of Panini's contribution by Cardona in\n[\n1\n]\n:-\nPanini's grammar has been evaluated from various points of view. After all these different evaluations, I think that the grammar merits asserting ... that it is one of the greatest monuments of human intelligence.",
  "matematicos_citados_na_biografia": [
    "John Backus",
    "Backus",
    "Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}