{
  "nome_completo": "Patrick Alfred Pierce Moran",
  "nome_curto": "Patrick Moran",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moran/",
  "data_nascimento": "14 July 1917",
  "local_nascimento": "Kings Cross, Sydney, New South Wales, Australia",
  "data_morte": "19 September 1988",
  "local_morte": "Canberra, Australian Capital Territory, Australia",
  "summary": "Patrick Moran was an Australian statistician who worked in probability theory and its application to population and evolutionary genetics.",
  "biografia": "Patrick Moran\nwas the son of Herbert Michael Moran\n(1885\n-\n1945)\nand Eva Mann\n(1887\n-\n1977)\n. Herbert Moran, the son of Michael Moran\n(1856\n-\n1951)\n, was a surgeon in Sydney who specialised in treating cancer patients. Michael Moran, Patrick Moran's paternal grandfather, was born in Ireland and arrived in Australia in\n1877\nbecoming a successful baker in Sydney. Eva Mann's family had come to Australia some years before Herbert Moran's family. All her ancestors were in Australia by\n1830\n. Except for Patrick's father, all other members of the families were without a formal education. Herbert and Eva Moran had six children, Patrick being the first born, but all the other five died shortly after birth.\nPatrick Moran was clearly strongly influenced by his father although he wrote later in life in autobiographical notes\n(\nsee\n[\n18\n]\nor\n[\n19\n]\n)\n:-\nI did not understand him at all ... yet I appreciated him.\nHis father had an extensive library with many books on the history of medicine and on science in general. Peter Hall writes\n[\n15\n]\n:-\nAs a small boy he was very interested in mechanical devices, but did not show a particular aptitude for mathematics. He was later to write, \"Arithmetic I could not do and never got my sums right all through schooldays\n(\nand later in the Ministry of Supply!\n)\n.\"\nAn event which left him with a permanent husky voice happened in his childhood when\n[\n18\n]\n:-\n... he suffered an attack of appendicitis late one night after going out with his parents for a meal. His father panicked and phoned for a distinguished surgeon colleague who operated around midnight, too soon after the meal. Pat vomited on the operating table and the surgeon had to do a tracheotomy to let him breathe, cutting his vocal cords in the process.\nIn\n1928\nMoran was sent to St Ignatius College, Riverview, an old Sydney school, for a few terms but then was educated at home for over a year. Some of the breaks in Moran's education were due to his father travelling to Europe to learn about the latest developments in cancer treatment. Around\n1930\nhe read\nW H Turnbull\n's small book\nThe Great Mathematicians\nand this made him 'determined to be a mathematician' despite his lack of arithmetical skills. In\n1930\nhe entered St Stanislaus College in Bathurst, a town in rural New South Wales. Pat's memories of life at this school were mostly unhappy but he had a 'lasting respect for the headmaster, Father E Gallagher' who, he wrote later in life, 'encouraged me to think'. He matriculated from St Stanislaus in\n1933\n, despite having missed six months schooling in\n1932\nwhen he was with his father in Europe.\nMoran entered Sydney University in\n1934\n, before reaching his\n17\nth birthday, aiming to study various sciences but to specialise in mathematics. He studied chemistry for one year, zoology for two years and mathematics and physics for three years. We are fortunate to have details of some of the mathematics courses he took. In pure mathematics these included a course by Richard Jenkins Lyons on analytical geometry and two courses by\nThomas Gerald Room\n, one on algebra and one on higher plane curves. In applied mathematics the courses included two by H H Thorne, one on statistics and one on the kinetic theory of bases, and a course by E M Wellish on wave mechanics. He graduated in\n1937\nwith a first class degree in mathematics. One sadness of the three years he spent as an undergraduate was that his parents were divorced in\n1935\n.\nAfter graduating, Moran continued studying aiming at the mathematical tripos at the University of Cambridge. He wanted to undertake research in mathematics but\nHoratio Scott Carslaw\n, who retired from the Chair of Mathematics at Sydney in February\n1935\n, told him to choose a different subject since\nCarslaw\nbelieved he would not succeed as a mathematician. After this Moran's father tried to persuade him to study medicine but Moran was keen to stick with mathematics. He travelled to England with his mother in September\n1937\nwith the promise of financial support from his father. He entered St John's College and was a\nWrangler\nin Part II of the tripos in\n1938\n. He was\n28\nth out of\n33\nWranglers and continued to Part III. He attended a variety of courses in\n1938\n:\nJ A Todd\non differential geometry,\nM H A Newman\non analysis,\nA E Ingham\non algebra,\nH Heilbronn\non the theory of numbers,\nS Goldstein\non electricity and hydrodynamics,\nE Cunningham\non statics and dynamics,\nJ C Burkill\non theory of real functions and\nW W Rogosinski\non\nFourier\nseries. In\n1939\nhe took courses:\nM H A Newman\non topology,\nA S Besicovitch\non integration,\nF Smithies\non integral equations,\nJ C Burkill\non the theory of real functions,\nW W Rogosinski\non\nFourier\nseries, and\nG U Yule\non statistics. He also attended lectures by\nG H Hardy\nin\n1938\n-\n1939\n. Moran passed the examinations for Part III in June\n1939\nbut his supervisor,\nEbenezer Cunningham\n, told him \"that\n[\nhe\n]\nhad no real mathematical ability and that he should do something else, e.g. medicine.\" Despite receiving the same advice from two independent experts, Moran was still determined to continue his study of mathematics.\nRobert Rankin\n[\n19\n]\n:-\n...  recalls that Pat had lodging near Darwin College where\nBesicovitch\nlived and that he used to take Mrs Besicovitch occasionally to the cinema for which\nBesicovitch\nalways thanked him when next they met. He also recalls Pat's troubles with arithmetic through an incident of considerable exasperation to Pat when he worked something out three times and obtained a different answer on each occasion. Pat himself was to write, \"Arithmetic I could not do.\"\nMoran decided to wait a year before beginning research and aimed at studying logic in the Moral Sciences tripos. When World War II began in September\n1939\n, Moran's plans had to change and he was appointed as an experimental officer in the Ministry of Supply, working on rockets at the Projectile Development Establishment. At this stage he met\nD G Kendall\nwho remembered their first meeting well\n[\n19\n]\n:-\nI recall very clearly the day on which I first met Pat Moran. It was\n1\nFebruary\n1940\n; we had each been summoned for interview, and the object of this\n(\nthough we did not know it at the time\n)\nwas to build up a team of mathematicians to work on rocket weapons under W. R. J.\n(\nlater Sir William\n)\nCook and Louis Rosenhead. I arrived a little late, and the waiting room contained a group of people nearly all of whom were complete strangers to me, though they seemed to know one another well. One was Pat, and he beamed a terrific smile in my direction when he saw my embarrassment. We instantly became great friends.\nMoran recalled\n[\n15\n]\n:-\n... working in a room with\nMaurice Bartlett\n, and looking through\nFisher\n's 'Statistical Methods for Research Workers'. It seemed then very clear to me that I would never understand statistics.\nThis work bored him so he moved to External Ballistics Laboratory in Cambridge. This he found even worse as he was required to only make routine calculations for problems he was not allowed to know about. Leaving this job, in\n1942\nhe joined the Australian Scientific Liaison Office in London. Here his work involved both applied physics and operational research. He took a course on radar and visited operational research sections of Fighter Command, Coastal Command, Bomber Command and several other units. He wrote up reports, over\n120\nin all, and began research, in particular on measuring the mean projected area of a shell fragment, a topic proposed by\nD G Kendall\n. Realising that a deeper knowledge of statistics would benefit him, he read the first volume of\nM G Kendall\n's\nAdvanced Theory of Statistics\nwhich inspired him. Joining the\nRoyal Statistical Society\n, he spent his lunch times in their library and got to know\nM G Kendall\n.\nWhile studying mathematics at Cambridge it had been\nBesicovitch\nwho had the most influence and, during the war years, Moran undertook research on\nHausdorff\nmeasure publishing several papers on the topic, including\nThe measure of plane sets\n(1943)\n,\nMeasuring the surface area of a convex body\n(1944)\n, and\nThe measure of product and cylinder sets\n(1945)\nwhich was a joint publication with\nBesicovitch\n. Leaving the Australian Scientific Liaison Office in June\n1945\n, he was awarded a Baylis Research Scholarship to undertake research at St John's College, Cambridge. He had hoped that\nBesicovitch\nwould supervise his research but he was rather saddened to find that\nBesicovitch\ndid not want to do so and instead suggested that he work with\nFrank Smithies\n.\nChoosing the right research problem for a research student is not the easiest thing to do since one has always to find a problem which will lead to results even if the original problem proves too hard.\nSmithies\ndid not make a good choice in what he proposed to Moran since the problem proved far too hard; indeed it has still not been solved. Moran made no progress but for relaxation worked on statistical problems suggested to him by\nMaurice Kendall\nand\nJohn Wishart\n. He also attended lectures by\nMaurice Bartlett\non the relation between Rimkowski theory of mixed area and analysis of variance and Edward Bullard's lectures on economics. After a year working on the problem posed by Smithies, in\n1946\nMoran gave up his scholarship and was appointed as a Senior Research Officer at the Institute of Statistics at the University of Oxford. This had, at least in part, been the route that he took so that he was in a sound enough financial state to marry.\nMoran had met Jean Mavis Frame\n(\nborn\n1918)\nin\n1945\nand they were married on\n14\nSeptember\n1946\nin Reading; they had three children, Everill Frances Louise Moran\n(\nborn\n1947)\n, Michael Patrick Allan Moran\n(\nborn\n1950)\nand Hugh Frederick Moran\n(\nborn\n1953)\n. For most of their lives in Australia from the\n1950\ns onwards they lived at\n17\nTennyson Crescent, Forrest in Canberra.\nSome of the first papers he published on statistics were\nRandom associations on a lattice\n(1947)\n,\nThe random division of an interval\n(1947)\n,\nSome theorems on time series\n(1947)\n,\nOn the method of paired comparisons\n(1947)\n, and\nRank correlation and permutation distributions\n(1948)\n.\nWorking at the Institute of Statistics at the University of Oxford, Moran was attached to Balliol College and later lectured at Trinity College. Perhaps the most significant thing, at least as far as his future career was concerned, about this position in the Institute of Statistics was that it was housed beside the Bureau of Animal Population and the Edward Gray Institute of Ornithology. His contacts with these two led to a lifelong interest in animal populations and many of his later publications arose through this interest. In\n1951\nMoran was appointed as a University Lecturer at Oxford but he returned to Australia at the beginning of\n1952\nwhen he was appointed as foundation professor of statistics at the Australian National University in Canberra. This was a slightly unusual appointment since the Statistics Department had been set up in the Research School of Social Sciences but Moran had no interest in the Social Sciences\n[\n19\n]\n:-\nInitially Pat had no staff and no students, but the library facilities were good from the outset. He was\n34\nyears of age at the time and comparatively inexperienced, but with a combination of good luck and good judgement the department which he founded prospered. Although it typically had only three or four academic staff and never had more than seven during the thirty years of his tenure, it played a unique role in the training and development of several generations of Australian statisticians.\nMoran's contributions in many areas were very influential. One of the first areas he worked on after taking up the statistics chair in Canberra led first to the paper\nA probability theory of dams and storage systems\nand, after a series of others on the topic, the book\nThe Theory of Storage\n(1959)\n. Before this book appeared his first paper on genetics appeared with\nRandom processes in genetics\n(1958)\n. Again he wrote an important book in this area with\nThe Statistical Processes of Evolutionary Theory\n(1962)\n. As an example of his work on animal populations, let us mention the paper\nSome remarks on animal population dynamics\n(1960)\npublished in\nBiometrics\n. In\n1963\nhe published the book\nGeometrical Probability\nwritten in collaboration with\nMaurice Kendall\n. The fourth of Moran's books was\nAn Introduction to Probability Theory\n(1967)\n. He writes in the Preface:-\nHolding as I do, the view that however important abstractions and generalisations are, no mathematical science can remain vigorous unless it draws some of its inspiration from the natural sciences, an attempt has been made to illustrate the subject by some of the many attractive problems in what has now come to be known as 'applied probability theory'.\nIn a review of this book in the\nJournal\nof the\nAmerican Statistical Association\n, the reviewer writes:-\nThis classic text and reference introduces probability theory for both advanced undergraduate students of statistics and scientists in related fields, drawing on real applications in the physical and biological sciences. The book makes probability exciting.\nFor some extracts from reviews of Moran's four books, see\nTHIS LINK\n.\nMoran kept up contacts with other statisticians both through visits abroad and having visitors come to Canberra. For example he spent a month visiting\nJerzy Neyman\nat the University of California at Berkeley in each of the years\n1965\n,\n1970\nand\n1971\n. He spent a year at the University of Oxford in both\n1955\n-\n56\nand in\n1960\n. On the\n1960\nvisit he returned to Australia on the ship Southern Cross, leaving Southampton on\n6\nDecember and arriving in Sydney. In\n1966\nhe spent study leave in the USSR and made a trip to China in\n1979\n-\n80\n.\nC C Heyde describes Moran's personality in\n[\n18\n]\n:-\nFor the most part, people saw Pat as unaffected, quiet, friendly and courteous. There was, however, a darker side to his personality and he suffered considerably from depression. His religious beliefs were deeply held and when he realized he had made a mistake he would typically try to make amends.\nIn\n1982\nhe reached the age of\n65\nand retired from his chair. Made an honorary Visiting Fellow in the Social Psychiatry Research Unit he published a number of papers\nBritish Journal of Psychiatry\n. His interest in mental disorders almost certainly arose because of the depression from which he suffered. He had little contact, however, with the department which he had led for thirty years which saddened his colleagues who greatly appreciated his deep knowledge and insight. A stroke in July\n1987\nleft him with paralysis down his left side but with determination on both his part and that of his wife, he slowly recovered. A heart attack in September\n1988\nended his life. He was buried in Gungahlin Cemetery, Mitchell, Canberra.\nMoran was honoured for his outstanding research by election to the\nAustralian Academy of Science\nin\n1962\nand also to the\nRoyal Society of London\nin\n1975\n. The\nAustralian Academy of Science\nawarded him their Lyle Medal in\n1963\nand the Statistical Society of Australia awarded him their Pitman Medal in\n1982\n. He was made an Honorary Life Fellow of the Royal Statistical Society in\n1970\nand an Honorary Life Member of the\nStatistical Society of Australia\nin\n1978\n. He served as President of the\nStatistical Society of Australia\n(1963\n-\n64)\n, President of the\nAustralian Mathematical Society\n(1976\n-\n78)\n, and Vice-President of the International Statistical Institute\n(1975\n-\n77)\n. He was also honoured after his death by having the\nAustralian Academy of Science\nbeginning the award of the Moran Medal in\n1990\n. The Academy's webpage gives the following information about the Medal:-\nThe Moran Medal recognises the contributions to science of the late P A P Moran, FAA. Its purpose is to recognise outstanding research by scientists under\n40\nyears at the closing date, except in the case of significant interruptions to a research career, in one or more of the fields of applied probability, biometrics, mathematical genetics, psychometrics and statistics. The award is normally made every two years.\nFor winners of the Moran Medal, see\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "W H Turnbull",
    "Thomas Gerald Room",
    "Horatio Scott Carslaw",
    "Carslaw",
    "Wrangler",
    "J A Todd",
    "M H A Newman",
    "A E Ingham",
    "H Heilbronn",
    "S Goldstein",
    "E Cunningham",
    "J C Burkill",
    "W W Rogosinski",
    "Fourier",
    "A S Besicovitch",
    "F Smithies",
    "G U Yule",
    "G H Hardy",
    "Ebenezer Cunningham",
    "Robert Rankin",
    "Besicovitch",
    "D G Kendall",
    "Maurice Bartlett",
    "Fisher",
    "M G Kendall",
    "Royal Statistical Society",
    "Hausdorff",
    "Frank Smithies",
    "Smithies",
    "Maurice Kendall",
    "John Wishart",
    "American Statistical Association",
    "THIS LINK",
    "Jerzy Neyman",
    "Australian Academy of Science",
    "Royal Society of London",
    "Statistical Society of Australia",
    "Australian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}