{
  "nome_completo": "Paul-André Meyer",
  "nome_curto": "Paul-André Meyer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meyer_Paul-Andre/",
  "data_nascimento": "21 August 1934",
  "local_nascimento": "Boulogne-Billancourt, near Paris, France",
  "data_morte": "30 January 2003",
  "local_morte": "Strasbourg, France",
  "summary": "Paul-André Meyer was a French mathematician who worked in the theory of stochastic processes.",
  "biografia": "Paul-André Meyer\nwas not given the name Meyer when he was born but rather he took the family name of Meyerowitz. Nobody in his family had been interested in mathematics; his father was a trader who fled from France shortly after the outbreak of World War II. The war began on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but, over the following months, France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and, by June, France had surrendered and fighting had ended. The Meyerowitz family fled from France in\n1940\nand sailed to Argentina, settling in Buenos Aires. Paul-André attended a French school in Buenos Aires but, spending six years there from the age of six to the age of twelve, he became fluent in Spanish. At first he performed poorly in mathematics but was encouraged by his mother. Soon he was ahead of the rest of his class and was fortunate to have an excellent teacher who taught him to compute square roots and cube roots as well as giving him a liking for geometry. He returned to France with his family in\n1946\n, after the war ended, but his love for the Spanish language lasted through his whole life.\nBack in France, Paul-André entered the lycée Janson de Sailly in Paris. This school, one of the best-known lycées in central Paris, traditionally educated many of France's intellectuals. At first he was a boarder at the school but by the middle of his first year he was living with his family, attending the school as a day pupil. It was at this school that Paul-André fell in love with advanced mathematics, mainly due to an outstanding mathematics teacher M Heilbronn who was an expert mathematician having obtained a doctorate with a thesis\nLes équations aux dérivées partielles selon Jules Drach\nⓉ\n(\nPartial differential equations according to Jules Drach\n)\n. Paul-André, who spent four years in Heilbronn's classes, obtained his baccalaureate in\n1952\n. He writes in\n[\n10\n]\nabout influences at this time:-\nAt that time, I spent much of Thursday afternoon at the Palais de la Découverte. Actually, I spent as much at the Guimet Museum, where the library fascinated me. ... The result of all this was that I went to buy the 'Cours de Mathématiques Spéciales' by A Decerf, which had the advantage of being thin. It was not an extraordinary book, but it was clear and I loved it.\nPaul-André spent the following two years preparing to take the entrance examinations for the grandes écoles. In fact, in\n1952\nhis father changed the family name from Meyerowitz to Meyer and from this time on the subject of this biography was known as Paul-André Meyer. He began to study advanced works\n[\n10\n]\n:-\nIt was\nRaphaël Salem\nwho lent me the first edition of the treatise on integration by\nStanisław Saks\n,\nHenri Cartan\nwho advised me to read the 'Fonctions de Variables Réelles'\nⓉ\n(\nFunctions of a real variable\n)\nby\nBourbaki\n, and\nLaurent Schwartz\nwho recommended me his book on distributions. I bought these books, they have served me later, but of course I could not understand them at that time. More importantly, the physicist P Grivet persuaded my parents that my project to only prepare for the competition of the rue d'Ulm was not crazy.\nHe entered the École Normale Supérieure in\n1954\nstill unsure whether to study physics or mathematics but after encountering rather poor physics teaching contrasted with outstanding lectures in mathematics by\nHenri Cartan\nhe quickly decided to concentrate on mathematics. Surprisingly, he did not excel at first, in fact up to the time of his\nagrégation\nin\n1957\n, he performed rather poorly. However, as soon as he began research under Jacques Deny\n(1916\n-\n)\n, who had been a student of\nHenri Cartan\n, he showed himself to be an outstanding student. During his university years he converted to Roman Catholicism and in\n1957\nhe married Genevieve whom he met while studying at the Sorbonne. Remarkably she had, like Meyer, lived in Buenos Aires and had even studied at the same French school there although they had not met at that time. They had three children between\n1959\nand\n1962\nwith a fourth child born in\n1969\n. Meyer's research for his doctorate was put into context by\nGustave Alfred Arthur Choquet\n(\nsee\n[\n16\n]\n)\n:-\nPaul Lévy\n, who was considered abroad as one of the founding fathers of modern probability, was little known in France. France, which had been the cradle of probability with\nPascal\n, was running the risk of seeing the line of her famous theoreticians\n(\nBorel\n,\nFréchet\n,\nLévy\n...\n)\ncut short. The Parisian mathematicians, being aware of this danger, invited Michel Loève, a former disciple of\nPaul Lévy\n, to come from Berkeley and spend a year in Paris, in order to sow the good seed by giving a course and a seminar ... By the end of the year, Meyer had assimilated the probabilistic techniques and was ready to begin his own research; this was the time when Gilbert Hunt was publishing, in the United States, two fundamental memoirs which were renewing at the same time potential theory and the theory of Markov processes by establishing a precise link, in a very general framework, between an important class of Markov processes and the class of kernels in potential theory which French probabilists had just been studying. Meyer, who was in close relation with these potentialists, and who was quite knowledgeable about convex functional analysis, was particularly well positioned to explore Hunt's theory. In\n1961\n, under the guidance of Jacques Deny, Meyer defended his thesis on multiplicative and additive functionals of\nMarkov\nprocesses, which established him at once as a top researcher among probabilists and potentialists.\nGilbert Hunt, referred to in this quote, was a professor of mathematics at Princeton University and a leading authority in\nprobability theory\nand mathematical analysis. Michel Loève\n(1907\n-\n1979)\n, who had been born in Palestinian, was a French-American probabilist and a mathematical statistician who had studied in Paris under\nPaul Lévy\nand had been appointed as Professor of Mathematics at Berkeley. Meyer had spent time at Berkeley following Loève's visit to Paris and, while in the United States, he met\nJoseph Doob\n. He had already read\nDoob\n's classic text\nStochastic Processes\nand these events all came together to give Meyer's research career an inspiring beginning. In\n1962\nand\n1963\nhe published important papers on supermartingales\n(\nthese can be thought of as processes which model unfair games\n)\n. These papers contain remarkable deep results which are extensions of work done by\nDoob\n. He was appointed to the University of Strasbourg in\n1964\n. In\n1966\nhe published the book\nProbabilités et Potentiel\nⓉ\n(\nProbability and potential\n)\n(\nan English translation entitled\nProbability and Potential\nwas published in the same year\n)\n. Heinz Bauer writes in a review:-\nIt is difficult to explain briefly what this book is. It is much easier to explain what it is not and what it does not pretend to be. It is not a textbook, nor a book on probability theory as a whole, and not at all a book on classical potential theory. ... The book consists of three parts\n[\nElements of Probability Calculus;\nMartingale\ntheory; Analytical tools in Potential theory\n]\nwhich are \"connected by a pattern of analogies rather than by explicit logical relations.\" But ... the author succeeds perfectly in making clear to his reader the interplay between probabilistic and potential theoretic notions and procedures.\nPerhaps the best description of what book contains is given in Meyer's Introduction. We choose, as Heinz Bauer does, to quote from Meyer himself:-\nThe fundamental work of\nDoob\nand Hunt has shown, during the last ten years or so, that a certain form of potential theory\n(\nthe study of kernels which satisfy the \"complete maximum principle\"\n)\nand a certain branch of probability theory\n(\nthe study of Markov semigroups and processes\n)\nin reality constitute a single theory. It is not a purely formal matter. Probabilistic methods have led to a much better understanding of certain fundamental ideas of potential theory\n(\ne.g. balayage, thinness, polar sets\n)\n; they have above all led to a host of new results in potential theory. In turn, probability theory has received comparable mathematical advantages from this association, and a very important psychological benefit: a marked enlargement of its public, and the end of an old isolation of twenty or thirty years. Because of this isolation, a probabilistic background has been lacking in a number of mathematicians to whom probabilistic methods could be of great service. One can thus imagine the usefulness of a work, intended for researchers rather than students, which might put at their disposal simultaneously the elements of probability theory and some of its more advanced aspects. This need is the raison d'être of the present book.\nIn\n1967\nthe first of the series\nSéminaire de Probabilités\nⓉ\n(\nSeminar on probability\n)\nappeared. This series, published by Springer in their Lecture Notes in Mathematics series, contains remarkable work by Meyer. In the many volumes, published between\n1967\nand\n1993\n, Meyer systematically discussed the main developments of the moment, mainly concentrating on his own work and work of his students and collaborators. However, he made very significant improvements when writing about the work of others, giving new proofs, simplifying arguments, extending results or simply explaining things more clearly than in the original papers. In many ways one can consider Meyer's work improving on that of others to be as important, and adding as much to the progress of mathematics, as his original research.\nIn collaboration with Claude Dellacherie, Meyer wrote five volumes between\n1975\nand\n1992\nentitled\nProbabilités et Potentiel\nⓉ\n(\nProbability and potential\n)\n. This title was identical to that of Meyer's single-authored text of\n1966\nand indeed was considered by the authors as a revision and updating of that earlier text. M G Sur writes in a review of the first of these five volumes:-\nMeyer's book 'Probabilités et potentiel'\nⓉ\n(\nProbability and potential\n)\n(1966)\nhas earned recognition and enjoys great popularity among specialists. However, since its publication a considerable amount of new material has been added to the theory and a new point of view towards some notions and statements in the book has been developed. For this very reason the authors decided to revise the earlier monograph.\nIn\n1993\nMeyer published\nQuantum probability for probabilists\n. His approach, writes David Applebaum, is:-\n... deeply rooted in the language and perspectives of classical probability theory, as one would expect from a set of notes based on lectures aimed at an audience of classical probabilists with little background in operator algebras. Here the aim is to persuade the audience that quantum probability is a fascinating subject which they would be well advised to study. The author's enthusiasm is apparent on every page; he has read an enormous wealth of literature both within and around the subject and these notes consequently constitute an impressive survey of a field which is still relatively new and rapidly evolving.\nStéphane Attal writes in\n[\n1\n]\n(\nand\n[\n2\n]\n)\nabout Meyer as a teacher:-\nI thought about this seminar held on Tuesday mornings. Every week we found ourselves in front of the board on the fourth floor of the tower of the Institute de Recherche mathématique Avancée. We were sometimes ten people, sometimes three people, and we listened to Meyer. He came each time with a new typed text: he had proved a new result, or he had read and completely rewritten an article by someone else, or he showed us the\n10\nth\nchapter of his course on\nvon Neumann\nalgebras,\nLie algebras\nor quantum field theory. I thought about the interest and enthusiasm he constantly showed for all that I did.\nHe was a very modest man who had many interests outside mathematics\n(\nsee\n[\n1\n]\nand\n[\n2\n]\n)\n:-\nMeyer's four main passions outside of science, I believe, were his family, music, languages and literature. Paul-André Meyer was indeed very close to his family, which for him was paramount. He writes: \"I have always given my family a certain priority over my work, and I felt rewarded when one day one of my daughters told me: 'When we were little, we were a little ashamed, because we thought you did nothing!'. Paul-André Meyer was a great lover of music and a great musician. He himself played the violin, viola and especially the flute. His whole family grew up with this passion for music\n(\ntwo girls became professional musicians\n)\n. In the evening, the \"little family Meyer\" played at home sonatas, trios, and quartets with piano.\nMeyer received many honours for his mathematical contributions including the Peccot Prize, the\nMaurice Audin\nPrize and the\nAmpère\nPrize. He was elected as a corresponding member of the\nAcademy of Sciences\n. Following his death the Institut de Recherche Mathématique Avancée at Strasbourg created the Meyer Prize which is awarded annually to an outstanding young probabilist working in the field of stochastic processes. The prize was awarded for the first time in\n2004\n. The first recipient was Thomas Duquesne.",
  "matematicos_citados_na_biografia": [
    "Raphaël Salem",
    "Stanisław Saks",
    "Henri Cartan",
    "Bourbaki",
    "Laurent Schwartz",
    "agrégation",
    "Gustave Alfred Arthur Choquet",
    "Paul Lévy",
    "Pascal",
    "Borel",
    "Fréchet",
    "Lévy",
    "Markov",
    "probability theory",
    "Joseph Doob",
    "Doob",
    "Martingale",
    "von Neumann",
    "Lie algebras",
    "Maurice Audin",
    "Ampère",
    "Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}