{
  "nome_completo": "Paul Wittich",
  "nome_curto": "Paul Wittich",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wittich/",
  "data_nascimento": "1546",
  "local_nascimento": "Breslau, Hapsburg Empire (now Wrocław, Poland)",
  "data_morte": "9 January 1586",
  "local_morte": "Vienna, Austria",
  "summary": "Paul Wittich was a Polish mathematician and astronomer who anticipated Tycho Brahe's planetary theory. He may have influenced Napier.",
  "biografia": "The date of\nPaul Wittich\n's birth is unknown. The\n1546\ndate which we give was computed by Gingerich\n[\n4\n]\nbased on Wittich's known matriculation date at university and the average age at which students of that period matriculated. Little is known of his family background\n[\n3\n]\n:-\nWell born, and probably well off, Wittich was an enigmatic character whose roots remain mostly obscure.\nHowever, certain information from letters written at the time show at least that his family included scholars in contact with the leading mathematicians and astronomers of the day\n[\n3\n]\n:-\nBut a hitherto unknown letter from Andreas Dudith to Johannes Praetorius, written soon after Wittich's death, suggests that Wittich was already associated by family ties to the Wittenberg astronomical tradition:\n\"Wittich said that the Epitome of\nCopernicus\nwas written by the author himself; he received it from his uncle, a well-known physician and mathematician of this city, named Balthasar\n[\nSartorius\n]\nwhose many letters to\nRheticus\nyou were able to see at\nRheticus\n's house. I am surprised that\nRheticus\ndid not show us this Epitome, which the doctor\n[\ni.e. Sartorius\n]\nis likely to have received from him; the book is not printed but is written in Wittich's hand; it is in quarto; it has\n14\nfolios whose gatherings, as they call them, make four.\"\nThe book described is clearly Copernicus's 'Commentariolus', the very first formulation of his heliocentric theory, and the setting shows that Wittich's astronomical connections reached through his uncle to Rheticus himself. In addition, Rheticus, who had been\nCopernicus\n's only disciple, corresponded with a Johannes Wittich in Wrocław, who may have been another of Paul's relatives.\nThe first precise date we know for Wittich is that he matriculated at University of Leipzig in the summer of\n1563\n. He then matriculated at Wittenberg in June\n1566\n. No record exists of any degrees awarded to him by either of these universities. If Wittich was born in\n1546\nthen he was born in the same year as\nTycho Brahe\n. Certainly\nTycho\nwas a student at Wittenberg at the same time as Wittich but later remarked that he scarcely remembered him. This, of course, may relate to the fact that\nTycho\nlater became extremely antagonistic towards Wittich for reasons which we shall explain below. The authors of\n[\n3\n]\nwrite:-\nWe now know that Wittich became a kind of itinerant humanistic tutor to men who valued and practised astronomy in a variety of contexts.\nHowever, this interpretation is doubted by Richard S Westfall who writes \"frankly I did not see the evidence on which this assertion was based.\" Certainly Wittich travelled widely after his time in Leipzig and Wittenberg\n[\n3\n]\n:-\nHis routes fan out from his home town of Wrocław west to the Silesian town of Görlitz; then, a hundred miles beyond it, to the major university centres of Leipzig and Wittenberg ...; then, south to the great Hapsburg Court at Prague; later the academy of Altdorf, near Nuremberg; and finally, to yet another university town, Frankfurt an der Oder.\nWittich matriculated at Frankfurt an der Oder in\n1576\nand there he met\nJohn Craig\n, from Edinburgh, who was dean at Frankfurt an der Oder for several years before returning to Edinburgh. Let us remark that\nCraig\nthen became personal physician to James VI of Scotland\n(\nlater James I after the union of the crowns of England and Scotland\n)\n. The connection with\nCraig\nis interesting, particularly in the light of a comment by the historian Anthony à Wood\n(1632\n-\n1695)\nthat\nNapier\ngot the idea for logarithms from a method brought back from the Continent by\nJohn Craig\n. It is certainly possible that the method referred to by Wood is one invented by Wittich since we know that Wittich found how to replace multiplication and division with addition and subtraction using the rules for sines and cosines of the sums and differences of angles. In one of his copies of\nDe revolutionibus\n, Wittich used the blank space at the end of a chapter to write out an example of his method, known as\nprosthaphaeresis\n[\n2\n]\n:-\nAnd this was precisely one of the pages that\nJohn Craig\nhad transcribed into his copy of 'De revolutionibus' when he was being tutored by Wittich in Frankfurt an der Oder in\n1576\n. In turn he took his annotated copy with him when he returned to Edinburgh, and he surely must have shown it to\nNapier\nwho was living in a castle in the area.\nBy October\n1579\nhe was back in Wrocław where he worked with Andreas Dudith. They observed the partial eclipse of the sun on\n22\nOctober\n1579\nand a total eclipse of the moon on\n31\nJanuary\n1580\n. Dudith wrote in a letter to a friend:-\nWittich allows neither reason nor advice, neither \"prayers nor prizes\"\n(\nas you say\n)\n, to dissuade him from his enthusiasm for travelling. In his very pleasant company for a few days, I have felt myself enflamed for mathematical studies ...\nLater Dudith wrote, again in a letter:-\nI am making great efforts so that I might not only retain Wittich in this city, but that I might keep him in my house.\nCertainly Dudith did not succeed in persuading Wittich to give up his enthusiasm for travelling for in the summer of\n1580\n, taking with him a letter of introduction from Thaddaeus Hagecius, he went to visit\nTycho\non the island of Hveen\n(\ncalled today Hven or Ven\n)\nin Copenhagen Sound where\nTycho\nhad his observatory Uraniborg. Hagecius had been professor of mathematics at the Charles University of Prague and was in frequent scientific correspondence with\nTycho\n. The visit to Uraniborg must have been an exciting one for Wittich\n[\n2\n]\n:-\nTycho\nheld nothing back as he explained the novel star-sights and scales on his quadrants, sextants, and armillary spheres. They toured the library with its thousands of books and its giant celestial globe, and they swapped notes on their ingenious trigonometrical methods. And the quest\n[\nWittich\n]\nshowed his host\n[\nTycho\n]\nthe technical underpinnings of his cosmological speculations ... The idea of preserving some of the Copernican details, but with the Earth as the fixed centre, must have greatly intrigued\nTycho\n.\nPierre Kerszberg explains the relation between Wittich's planetary theory and that proposed by\nTycho\n:-\nBy the end of the\n1570\ns,\nTycho\nhad found an orbit for the comet of\n1577\nthat tallied well with the older view that Mercury and Venus circled around the Sun. In\n1580\n, however, he was exposed to the rich commentaries of\nCopernicus\nthat Wittich had brought with him during a four-month visit at the isle of Hven, the site of\nTycho\n's observatory. Wittich's diagrams are semigeoheliocentric, and therefore retain the solid crystalline spheres, only because they fail to solve completely the problem of the possible collision between the Sun and a planet such as Mars.\nTycho\npublished his own fully geoheliocentric system in\n1588\n, but then there followed a bitter dispute of priority and discovery with  N R Ursus, who had published shortly thereafter a system containing striking similarities with\nTycho\n's. In the process,\nTycho\naccused Wittich of divulging secrets, which suggests that some communication between Ursus and Wittich could conceivably have occurred.\nNow the dispute between\nTycho\nand Wittich was based on more than who had invented the planetary theory. Wittich left Uraniborg after spending four months there claiming\n(\nperhaps correctly or perhaps as an excuse\n)\nthat he had to return to Wrocław to deal with an inheritance from a rich uncle. On Saturday\n29\nOctober\n1580\nTycho\nwrote the following inscription in Latin on the title page of\nPeter Apian\n's\nAstronomicum Caesareum\n, then gave the book to Wittich:-\nTo Paul Wittich of Wratislava, friend and fellow lover of mathematics.\nClearly, despite\nTycho\n's appreciation of Wittich at this time, Wittich had become tired of\nTycho\n; he promised to return but never did. Back in Wrocław he joined discussions with\nHenry Savile\n, who was visiting, about\nPtolemy\nand\nCopernicus\n.\nBy\n1584\nWittich was in Kassel working with\nBürgi\nhelping improve the design of the instruments he was making for the Observatory of Wihelm of Hesse in Kassel. Wihelm of Hesse was\nTycho\n's great astronomy rival and Wittich now passed on\nTycho\n's secrets regarding star-sights and scales. Wilhelm was delighted and gave Wittich a gold chain in return for his suggestions about improving his instruments.\nTycho\n, on the other hand, was furious and had his revenge when he published the first volume of his correspondence where he strongly asserted that ideas in the planetary theory were entirely his own, and scarcely mentioned Wittich despite the fact that his planetary theory originated with him. He also claimed to have discovered the method of prosthaphaeresis which Wittich had shown him.\nWittich died in Vienna in\n1586\nwhile working for the Emperor Rudolf II who was a generous patron of the arts and sciences.\nTycho\nnow made serious attempts to buy the copies of\nCopernicus\n's\nDe revolutionibus\nwhich Wittich had owned. He remembered that they contained not only details of Wittich's planetary theory but also his work on prosthaphaeresis. Clearly having claimed these as his own ideas, it was to his advantage to remove them from inspection. On Wittich's death his possessions had gone to his sister who was living in Wrocław. In\n1589\nHagecius and two friends had approached Wittich's sister and attempted to but the copies of\nDe revolutionibus\non behalf of\nTycho\n. However Wittich's sister was clearly aware of the value of these works and Hagecius's approach failed. Again in\n1595\nHagecius tried to purchase them on behalf of\nTycho\nbut again failed. In\n1598\nLongomontanus made another attempt to buy the books for\nTycho\n, this time he succeeded. These copies still survive and historians wrongly attributed the inscriptions of Wittich to\nTycho\nuntil recent research by Gingerich has given Wittich the credit he deserves.",
  "matematicos_citados_na_biografia": [
    "Copernicus",
    "Rheticus",
    "Tycho Brahe",
    "Tycho",
    "John Craig",
    "Craig",
    "Napier",
    "Peter Apian",
    "Henry Savile",
    "Ptolemy",
    "Bürgi"
  ],
  "imagens": []
}