{
  "nome_completo": "Paul Antoine Aristide Montel",
  "nome_curto": "Paul Montel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montel/",
  "data_nascimento": "29 April 1876",
  "local_nascimento": "Nice, France",
  "data_morte": "22 January 1975",
  "local_morte": "Paris, France",
  "summary": "Paul Montel was a French mathematician who worked on complex analytic functions.",
  "biografia": "Paul Montel\nwas the son of Anais Magiolo and Aristide Montel, who was a photographer. He was educated at the Lycée in Nice then, in\n1894\n, he entered École Normale Supérieure in Paris, graduating three years later.\nMontel then taught at several lycées and at this stage he had no intention of undertaking research in mathematics. He enjoyed teaching but he had other interests such as literature and travel and was pleased to have a job where he had sufficient leisure to enjoy these pursuits. He was, however, a very successful teacher and did well in preparing his students for the competitive examinations which gave them places at the leading engineering institutions. Montel's friends saw the great talent which he possessed and they persuaded him to return to Paris and work on a thesis for his doctorate in mathematics. This he did and obtained his doctorate in\n1907\n. However, he returned to teaching in lycées and did not seek a university post at this time. He was appointed to his first university post in Paris in\n1918\nat the age of\n42\n.\nDieudonné\nwrites in\n[\n1\n]\n:-\nDuring the German occupation he was dean of the Faculty of Science, and he was able to uphold the dignity of the French university in spite of the arrogance of the occupiers and the servility of their collaborators.\nMontel worked mostly on the theory of analytic functions of a complex variable. His work is put in context by\nDieudonné\nin\n[\n1\n]\n:-\nThe idea of compactness had emerged as a fundamental concept in analysis during the nineteenth century; provided a set is bounded in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n, it is possible to define for and sequence of points, a subsequence which converges to a point of\nR\nn\n\\mathbb{R}^{n}\nR\nn\n(\nthe\nBolzano\n-\nWeierstrass\ntheorem\n)\n.\nRiemann\nhad sought to extend this extremely useful property to sets E of functions of real variables, but it soon appeared that boundedness of E was not sufficient. Around\n1880\nG Ascoli\nintroduced the additional condition of equicontinuity of E, which implies that E has again the\nBolzano\n-\nWeierstrass\nproperty. But at the beginning of the twentieth century\nAscoli\n's theorem had very few applications, and it was Montel who made it popular by showing how useful it could be for analytic functions of a complex variable.\nMontel introduced a set of functions called a normal family and used these ideas to simplify classical results in function theory such as the mapping theorem of\nRiemann\nand\nHadamard\n's characterisation of entire functions of finite order. Montel's idea of normal families proved to be powerful in many connections, for example in the proof of the\nPicard\n-\nLandau\n-Schottky theorems, and it became central in the theory of iterations of analytic functions started by\nÉmile Picard\nand developed by\nFatou\nand\nJulia\n. In\n1915\nthe Paris\nAcademy of Sciences\nannounced that its\n1918\nGrand Prix would be awarded for a study of iteration from a global point of view. In\n[\n2\n]\nAlexander suggests that this choice of topic may have been made because it was felt by\nAppell\n,\nÉmile Picard\n, and\nKoenigs\nthat normal families might provide a suitable tool for such investigations. The Grand Prix was won by\nJulia\nbut Montel, who did not enter for the prize, was awarded a smaller monetary prize at the same time.\nMontel also investigated the relation between the coefficients of a polynomial and the location of its zeros in the complex plane.\nAs we mentioned above, Montel was interested in travel and his eminence as a mathematician led to many invitations which he was more than delighted to accept. He lectured in Belgium, Egypt, Romania and South America. Having students in Romania meant that he was able to make frequent visits to that country. He married late in life and had no children.\nAmong the honours he received, the most prestigious was election to the French\nAcademy of Sciences\nin\n1937\n.",
  "matematicos_citados_na_biografia": [
    "Dieudonné",
    "Bolzano",
    "Weierstrass",
    "Riemann",
    "G Ascoli",
    "Ascoli",
    "Hadamard",
    "Picard",
    "Landau",
    "Émile Picard",
    "Fatou",
    "Julia",
    "Academy of Sciences",
    "Appell",
    "Koenigs"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}