{
  "nome_completo": "Paulette Libermann",
  "nome_curto": "Paulette Libermann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Libermann/",
  "data_nascimento": "14 November 1919",
  "local_nascimento": "Paris, France",
  "data_morte": "10 July 2007",
  "local_morte": "Montrouge, near Paris, France",
  "summary": "Paulette Libermann was a French mathematician who survived the terrors of World War II and made important contributions to differential geometry.",
  "biografia": "Paulette Libermann\nwas born into a Jewish family who were of Polish and Ukrainian origin. Perhaps 'Polish' is not strictly accurate since Poland did not exist at that time and so many refer to her background as Russian. Her maternal grandparents were Israël Mayer Apte\n(1851\n-\n1938)\n, born in Warsaw, and Rachel Moïse Schoub\n(1852\n-\n1921)\nwho were married in Paris on\n1\nApril\n1875\n. Her parents spoke both French and Yiddish at home, but Paulette and her two sisters were French speaking. Paulette attended the Lycée Lamartine, a school for girls in the rue du Faubourg, Poissonnière, Paris. There she excelled, showing her brilliant abilities, and often helping her fellow pupils with their homework. In\n1938\nshe entered the École Normale Supérieure de Sèvres. This was a university level institution designed to educate women who were going to become secondary school teachers. It was also known as the École Normale Supérieure de Jeunes Filles, and the students there studied a special women's scientific teaching diploma. It had been founded in\n1881\nand remained a separate institution until it joined the École Normale Supérieure in\n1987\n. However around the time Libermann was a student, the director was Eugénie Cotton\n(1881\n-\n1961)\n, a physicist with strong left wing views, and she wanted to make the École Sèvres educate women to the same level as the École Normale Supérieure at the Rue d'Ulm trained men. Libermann greatly benefited from the reforms brought in by Eugénie Cotton, and she was taught by leading mathematicians such as\nÉlie Cartan\n,\nAndré Lichnerowicz\nand\nJacqueline Ferrand\n.\nWorld War II began in September\n1939\nand in May\n1940\n[\n12\n]\n:-\n... the German army invaded a large part of France that included Paris, and there followed in the spring and summer of\n1940\na southward exodus of civilians. Paulette and her family took refuge in Lyons, where she was able to sit for two examinations. She then travelled to Toulouse to sit for additional examinations. She returned to Paris with her family in autumn. Part of the École had moved to Paris after the German troops occupied the building in Sèvres, and she prepared for the agrégation while living with her family.\nAfter the defeat of France in World War II, the Vichy Regime had taken over control of the country. It enacted laws to imitate those brought in by the Third Reich in Germany and, in particular, in October\n1940\nthey passed a Statute excluding Jews from many occupations such as the armed forces, entertainment, arts, media, and professional jobs like the teaching profession. This made it impossible for Libermann to take the examinations for her teaching certificate, but Eugénie Cotton was able to obtain scholarships for three Jewish students to study at the École Sèvres for a fourth session. Eugénie Cotton was forced to retire in\n1941\n, but Libermann, who was one of the three Jewish students supported by the scholarships, was able to spend session\n1941\n-\n42\nat École Sèvres beginning a research career advised by\nÉlie Cartan\n[\n3\n]\n:-\nWith a kind of black humour, Paulette Libermann used to say that the anti-Semitic laws had been lucky for her, since\nÉlie Cartan\n, who was teaching these young ladies, suggested that she start research instead\n[\nof becoming a teacher\n]\n.\nFrom that time on, Libermann had great admiration for\nÉlie Cartan\nand remained a close friend of the Cartan family for the rest of her life.\nBy the spring of\n1942\nthe conditions imposed on Jews by the Vichy Regime was becoming increasingly severe. From February\n1942\ntelephones and radios found in the homes of Jewish people had been confiscated and a curfew had been enforced on Jews. Libermann, with her parents and two sisters, fled from Paris in June\n1942\nafter the Vichy Regime required Jews to wear a yellow star. They went to Lyon where they lived under false names, but conditions there soon became desperate. In November\n1942\nKlaus Barbie was sent to Lyon where he became the head of the local Gestapo. He is thought to have been responsible for the deaths of\n4000\nJews in Lyon during the two years he served there and, as a result of this and the fact that he personally tortured those captured, he is known as the \"Butcher of Lyon\". Somehow Libermann and her family were able to hide from Barbie despite the fact they lived in la Place Bellecour which adjoined a building occupied by the Gestapo. In later life she described the fact that they survived this terrible period as a miracle. In the autumn of\n1944\n, following the liberation of Paris by the Allies in August, Libermann was able to return to the École Sèvres in Paris and obtain her teaching certificate.\nAfter the award of her certificate, Libermann was appointed to teach, first at Douai in the north east of France about\n30\nkm south of Lille, then, from the beginning of the\n1945\n, at the High School for Girls in Strasbourg. Again she received important advice from\nÉlie Cartan\nwho suggested to her she contact\nCharles Ehresmann\nat the University and begin studying for a doctorate in mathematics under his supervision. This she did while continuing to teach at the High School for Girls. To finish off writing her thesis, she spent a while at Centre National de la Recherche Scientifique. Then in\n1953\nshe defended her thesis\nSur le problème d'équivalence de certaines structures infinitésimales\nⓉ\n(\nOn the issue of equivalence of some infinitesimal structures\n)\nand received her Docteur d'Etat from the Louis Pasteur University of Strasbourg. Audin writes\n[\n1\n]\n:-\nThe equivalence problem is a general problem and has been investigated by many including\nÉlie Cartan\n. Roughly speaking, the question is to classify, up to local isomorphism, structures on manifolds. For instance, all the manifolds of the same dimension are equivalent\n(\nthis is a local question\n)\n. But this is not true anymore if the manifolds are endowed with Riemannian metrics: a\n(\ncurved\n)\nsphere is not locally isometric to a\n(\nflat\n)\nplane.\nLibermann began publishing research articles several years before completing the work for her thesis. For example she published, jointly with her supervisor Ehresmann,\nSur les formes différentielles extérieures de degré\n2\nⓉ\n(\nOn exterior differential forms of degree\n2\n)\n(1948)\n,\nSur le problème d'équivalence des formes différentielles extérieures quadratique\nⓉ\n(\nOn the problem of equivalence of quadratic external differential forms\n)\n(1949)\n, and\nSur les structures presque hermitiennes isotropes\nⓉ\n(\nOn almost Hermitian isotropic structures\n)\n. She also published a number of single authored papers such as\nProblèmes d'équivalence relatifs à une structure presque complexe sur une variété à quatre dimensions\nⓉ\n(\nEquivalence issues of an almost complex structure on a variety of four dimensions\n)\n(1950)\n,\nSur la courbure et la torsion des variétés presque hermitiennes\nⓉ\n(\nOn the bending and twisting of almost Hermitian varieties\n)\n(1951)\n,\nFormes différentielles sur une variété symplectique\nⓉ\n(\nDifferential forms on a symplectic variety\n)\n(1952)\n, and\nSur les variétés presque paracomplexes\nⓉ\n(\nOn almost paracomplexes varieties\n)\n(1952)\n. In this early part of her career she spoke at a number of international conferences such as: 'Colloque de topologie et géométrie différentielle'\nⓉ\n(\nSymposium on topology and differential geometry\n)\nheld in Strasbourg in\n1952\n; 'Géométrie différentielle'\nⓉ\n(\nDifferential geometry\n)\nheld at the Centre National de la Recherche Scientifique, Strasbourg in\n1953\n; and 'Convegno Internazionale di Geometria Differenziale' held in Italy in\n1953\n.\nShe was appointed Professor at the University of Rennes where she continued her research on differential geometry. During this time she was involved in a car accident as a passenger and never fully recovered from her injuries to the extent that for the rest of her life she had a stiff leg. In\n1966\nshe was named Professor at the Faculty of Sciences at the University of Paris\n[\n12\n]\n:-\nWhen the Faculty of Science of the University of Paris split after\n1968\n, mostly along ideological lines, she chose Paris VII in accordance with her left-leaning convictions.\nMarc Chaperon writes\n[\n7\n]\n:-\nShe was quietly daring but also very faithful: to\nÉlie Cartan\nof course, whose vision of the world was perpetuated by her seminar with Yvette Kosmann, during a period where his viewpoint was a bit out of fashion; and even more significantly to\nEhresmann\n, gradually marginalised after having occupied a central focus in the mathematics of his time. At the Kosmann-Libermann seminar, the 'a fortiori' marginalised students of this great mind could express themselves. Paulette Libermann was in a good position to understand the meaning of both their work and exclusion. Perhaps due to the help that she had received from\nÉlie Cartan\nas a beginner, she was always ready to welcome and encourage previously unknown young mathematicians, including Michèle Audin, Daniel Bennequin, Jean-Pierre Françoise and the author of this article\n[\nMarc Chaperon\n]\n.\nPerhaps she is best known for her monograph\nSymplectic geometry and analytical mechanics\nwritten jointly with Charles-Michel Marle. This was published in four volumes in French\n(1986\n,\n1986\n,\n1987\n,\n1987)\nand an English text of\n526\npages was published in\n1987\n. The authors write in the Preface:-\nDuring the last two centuries, analytical mechanics have occupied a prominent place among scientists' interests. The work in this field by such mathematicians as\nEuler\n,\nLagrange\n,\nLaplace\n,\nHamilton\n,\nJacobi\n,\nPoisson\n,\nLiouville\n,\nPoincaré\n,\nCarathéodory\n,\nBirkhoff\n,\nLie\nand\nÉlie Cartan\nhas played a major role in the development of several important branches of mathematics: differential geometry, the calculus of variations, the theory of\nLie\ngroups and\nLie\nalgebras, and the theory of ordinary and partial differential equations. During the last thirty years, the study of the geometric structures which form the basis of mechanics\n(\nsymplectic,\nPoisson\nand contact structures\n)\nhas enjoyed renewed vigour. The introduction of modern methods of differential geometry is one of the reasons for this renewal; it has permitted a formulation of global problems and furnished tools with which to solve them. Even though there are already a number of books that treat this subject, the authors believe that it is of value to provide readers with an approach to these methods and to permit them to familiarise themselves with certain recent developments which are not mentioned in the other textbooks in this field, and to acquire the information necessary in order to pursue current research. They have also expounded and employed the methods of exterior algebra which were introduced by\nE Cartan\n.\nReviewing this book, I Vaisman writes\n[\n20\n]\n:-\nThe present work is an advanced textbook which gives a systematic exposition of the theory of symplectic, Poisson and contact manifolds, and their applications in Hamiltonian mechanics. ... The book, which was written by two well-known specialists with important contributions in the field\n(\nalso reflected in this book\n)\nis very well written, updated, and it supplies a valuable contribution to the geometric-mechanical literature.\nN M J Woodhouse writes in the review\n[\n21\n]\n:-\nThe authors have clearly achieved their main aim: to give a systematic, accurate and largely self-contained account of the geometric foundations of classical mechanics for graduate students in mathematics. In doing so, they have written an excellent and lasting book.\nThe book contains five chapters: Symplectic vector spaces and symplectic vector bundles; Semibasic and vertical differential forms in mechanics; Symplectic manifolds and\nPoisson\nmanifolds; Action of a\nLie\ngroup on a symplectic manifold; and Contact manifolds. For more information about this book, see\nTHIS LINK\n.\nLibermann was invited for extended research visits at many top universities. For example she spent time at St Hugh's College at Oxford working with\nWhitehead\n, at the University of California at Berkeley, at the Mathematical Sciences Research Institute in Berkeley, and at the National Institute of Pure and Applied Mathematics at Rio de Janeiro. She attended many international meetings where she was invited to lecture, only giving up travelling to conferences in\n2004\nwhen she was\n85\nyears old. For example she gave a survey of various geometric concepts and results used in analytical mechanics in her lecture\nLiouville forms, parallelisms and Cartan connections\nto the\nJean Leray\n'\n99\nConference, and reviewed and summarised the theory of\nCartan\nconnections in her lecture\nCartan connections and momentum maps\ngiven at the 'Classical and Quantum Integrability' conference held in Warsaw in\n2001\n. She continued to help to run the 'Geometry and Mechanics' seminar in Paris until the end of\n2006\n. She broke her shoulder after a fall and then went to hospital for an operation in April\n2007\n. She was taken to a retirement home at Montrouge, near Paris, following the operation but her health rapidly declined and she died in the home in July. Her final publication\nCharles Ehresmann's concepts in differential geometry\nwas published in\n2007\n. Marc Chaperon writes\n[\n7\n]\n:-\nMademoiselle Libermann, as everyone called her, left us on\n10\nJuly\n2007\n, after an exceptionally long and fruitful mathematical life. For example, till the end she actively participated in our seminar of Hamiltonian geometry, organised by her friend and collaborator Charles-Michel Marle; during the ensuing lunches, we benefited from her remarkable knowledge of mathematics and mathematicians but also from her stimulating vision of the world. I do not think she had changed substantially nor lost in vivacity since her admission in\n1938\nto the École Normale Supérieure de Jeunes Filles.\nMichèle Audin writes in\n[\n1\n]\n:-\nTiny, energetic, smiling, chatty, sometimes caustic, she was also a memory of the mathematical community. She liked to speak of those who helped her, either personally or professionally: Cartan's family,\nJacqueline Ferrand\n,\nEhresmann\n, anonymous others ... and she also liked to speak of those who did not help her. She participated, almost until the end, in conferences all around the world. The last time we met, in April, I was leaving for Vietnam. \"I cannot go\", she told me, \"too tiring, I am getting old\". She was\n87\n.",
  "matematicos_citados_na_biografia": [
    "Élie Cartan",
    "André Lichnerowicz",
    "Jacqueline Ferrand",
    "Charles Ehresmann",
    "Ehresmann",
    "Euler",
    "Lagrange",
    "Laplace",
    "Hamilton",
    "Jacobi",
    "Poisson",
    "Liouville",
    "Poincaré",
    "Carathéodory",
    "Birkhoff",
    "Lie",
    "E Cartan",
    "THIS LINK",
    "Whitehead",
    "Jean Leray",
    "Cartan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}