{
  "nome_completo": "Paulo Ribenboim",
  "nome_curto": "Paulo Ribenboim",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ribenboim/",
  "data_nascimento": "13 March 1928",
  "local_nascimento": "Recife, Pernambuco, Brazil",
  "data_morte": null,
  "local_morte": null,
  "summary": "Paulo Ribenboim is a Brazilian mathematician who works in number theory.",
  "biografia": "Paulo Ribenboim\nattended the João Barbalho school in Recife, the capital of Pernambuco state in northeastern Brazil, in\n1934\nand\n1935\n.  Recife is an Atlantic seaport containing many waterways, with bridges connecting different parts of the city. In\n1936\nPaulo's family moved from Recife to Rio de Janeiro, and there he continued his education attending the Anglo-American College which was a private school. He achieved a school record by being awarded five gold medals in each of the years from\n1938\nto\n1942\n. He attended the Andrew's College from\n1943\nto\n1945\n.\nIn\n1946\nRibenboim entered the Faculty of Philosophy at the University of Brazil. He wrote his first paper\nCharacterization of the sup-complement in a distributive lattice with last element\nin\n1948\nand it was published in\nSumma Brasil. Math\n.  in the following year. Ribenboim was awarded his Bachelor's degree in\n1948\nthen, following this, he spent a semester as a teaching assistant in the  Saint Ignatius Faculty of Engineering  which became part of the new Pontificia Universidade Católica in Rio de Janeiro, which is now named the Federal University of Rio de Janeiro. In\n1949\nhe was appointed as a teaching assistant in geometry in Rio de Janeiro, then later that year he was appointed assistant professor at the Centro Brasileiro de Pesquisas Fisicas, again in Rio de Janeiro.\nIn\n1950\nRibenboim was awarded a scholarship to study in Nancy, France, with\nDieudonné\n. He travelled by boat from Rio de Janeiro arriving in Cannes on\n22\nApril before reaching Nancy on the following day. This was an exciting time for Ribenboim for as well as working with\nDieudonné\nhe met\nLaurent Schwartz\nand\nGrothendieck\nwhile studying in Nancy. During\n1951\nup to the spring of\n1952\nhe attended lecture courses on\nLie\ngroups by\nDelsarte\n, algebraic numbers by\nDieudonné\nand the theory of distributions by\nLaurent Schwartz\n. In the middle of this mathematical activity Ribenboim married Huguette Demangelle in Nancy on\n19\nDecember\n1951\n. His first son Serge Charles was born in\n1953\n.\nRibenboim submitted his second research paper\nModules sur un anneau de Dedekind\nⓉ\n(\nModules over a Dedekind ring\n)\nto\nSumma Brasil. Math\n.  and it was published in\n1952\n. In July of that year he returned from France to Rio de Janeiro where he was appointed to teach calculus at Escola Tecnica do Exercito and also appointed to teach analytic functions in the Centro Brasileiro de Pesquisas Fisicas. In\n1953\nhe was appointed as a lecturer at the University of Brazil in Rio de Janeiro then in August of that year he travelled again to Europe, this time to work with\nKrull\nin Bonn, Germany. He studied ideal theory and valuation theory with\nKrull\nbetween August\n1953\nand August\n1956\n. During this time he attended the International Congress of Mathematicians in Amsterdam in\n1954\n. Ribenboim's big research breakthrough came when he found a counterexample to a conjecture of\nKrull\n. He published his result in\nSur une conjecture de Krull en théorie des valuations\nⓉ\n(\nOn a conjecture of Krull in the theory of valuations\n)\nin\nNagoya Math. J\n.  in\n1955\n. This became his third publication. After this Ribenboim began to publish rapidly. In\n1956\nalone he published:\nSur une note de Nagata relative à un problème de Krull\nⓉ\n(\nOn a note of Nagata on a problem of Krull\n)\n;\nUn théorème sur les anneaux primaires et complètement intégralement clos\nⓉ\n(\nA theorem on primary rings which are completely integrally closed\n)\n;\nSur la théorie des idéaux dans certains anneaux de type infini\nⓉ\n(\nOn the theory of ideals in some rings of infinite type\n)\n; and\nAnneaux normaux réels à caractère fini\nⓉ\n(\nNormal real rings of finite type\n)\n.\nAfter three years in Germany, Ribenboim returned to Brazil in August\n1956\nwhere he was appointed to the new Institute of Pure and Applied Mathematics in Rio de Janeiro. In the same year he was elected to the\nBrazilian Academy of Sciences\n, being the youngest member at the time of his election. Perhaps the most remarkable fact about this early election was that he still had not obtained his doctorate. This was awarded by the University of São Paulo in August\n1957\n. In\n1958\nhe was promoted to Research Chief at the Institute of Pure and Applied Mathematics. In the same year he attended the International Congress of Mathematicians in Edinburgh, being the second such congress he had attended. He was the made head of the Mathematics Division of the National Research Council in Brazil and in September\n1959\nhe made his first visit to the United States when he was Visiting Associate Professor at the University of Illinois. This visit was funded by a Fulbright Fellowship. While in Urbana in\n1961\nhis second son Eric Leonard was born.\nIn\n1962\nhe had a summer appointment at the University of Michigan in Ann Arbor but, after this, his United States visa could not be renewed. He was then appointed as associate professor of mathematics at Queen's University in Kingston Ontario, Canada. His tenure at Queen's University was confirmed in\n1964\nand in the following year he was promoted to full professor.\nRibenboim has published a remarkable collection of research papers, monographs, graduate and undergraduate texts, and popular widely accessible mathematics books. A bibliography in\n[\n1\n]\ncontains\n262\nitems beginning with his work on valuations and valuation rings, continuing with a remarkable collection of books, up to his latest papers on ultrametric spaces. Let us look at some of the books which he has published. His first book was\nThéorie des groupes ordonnés\nⓉ\n(\nTheory of ordered groups\n)\npublished in\n1963\n. This is a:-\n... clearly written introduction to the theory of abelian ordered groups, assuming only an elementary knowledge of abelian group theory and topology.\nSeveral texts followed in fairly quick succession:\nThe Riemann-Roch theorem for algebraic curves\n(1965)\nand\nLinear representation of finite groups\n(1966)\n. Ribenboim, in the Preface to the second of these writes:-\nThese notes cover the second part of a course to fourth year undergraduate honours students in mathematics at Queen's University, given in\n1964\n... Apart from the arrangement and selection of material, there is little that is original.\nIn\n1965\nRibenboim published his book\nThéorie des valuations\nⓉ\n(\nTheory of valuations\n)\nconsisting of lectures he gave in\n1964\nat the Séminaire de Mathétiques Supérieurs in Montréal.\nIn\n1966\nRibenboim spent two months at Harvard working with\nZariski\n. In\n1966\n-\n7\nhe spent a sabbatical at the North-Eastern University in Boston. During this time he attended lectures by David Mumford on algebraic geometry. He also went to lectures by J Ax and these formed the basis of his next book\nLa conjecture d'Artin sur les équations diophantiennes\nⓉ\n(\nThe conjecture of Artin on Diophantine equations\n)\npublished in\n1968\n.\nRings and modules\npublished in\n1969\nwas designed for instructors rather than for students. Ribenboim points out in the Preface that he considers preparation of exercises as well as expansion of material to be roles of a competent instructor. In\n1972\nL'arithmétique des corps\nⓉ\n(\nArithmetic of fields\n)\nwas published. Jacobowitz, in a review of the work, writes:-\nThis is a text suitable for an unorthodox course in algebraic number theory. Instead of the customary material on ideal factorization and unit theorems, the reader will find such topics as p-adic logarithms, the\nWitt\nring, infinite\nGalois theory\n, ordering of number fields and diophantine dimension\n(\nincluding Terjanian's celebrated counterexample\n)\n. The author possesses an excellent feeling for the precise amount of detail needed in a proof, which makes much of the book accessible even at the advanced undergraduate level. There are many exercises of a theoretical, rather than routine computational, nature which complement the text. In short, the author has written an attractive exposition of his subject.\nAlso in\n1972\nhe published\nAlgebraic numbers\n. The book is divided into\n13\nchapters, the first four of which provide background material. The next six chapters cover algebraic integers, integral basis,\ndiscriminant\n, the decomposition of ideals in\nDedekind\ndomains, the norm of an ideal, finiteness of the class number, the structure of the group of units, the ramification index and the degree of inertia, discriminant and different. Chapters\n11\nand\n12\ntreat more specialised topics. The first of these is devoted to ramification theory in\nGalois\nextensions and the second to a proof of the theorem by\nKronecker\nand\nHeinrich Weber\non the abelian extensions of the field of rational numbers.\nMany people will think of Ribenboim as a writer of superb number theory books. He began to write about this topic, one which clearly had an enormous fascination for him, in\n1979\nwith his famous text\nThirteen lectures on Fermat's last theorem\n.\nFurther wonderful books of number theory have excited many students and turned them on to mathematics.\nThe book of prime number records\npublished in\n1988\nhas six chapters entitled:\nHow many primes are there?;\nHow to recognize whether a natural number is prime;\nAre there functions defining prime numbers?;\nHow are the primes distributed?;\nWhat special kinds of primes have been considered?;\nHeuristic and probabilistic results about prime numbers.\nA reviewer's comment \"This book is well written with much wit\" certainly applies to this book, but could equally apply to all of Ribenboim's books. Another classic is\nThe little book of big primes\n(1991)\nwhich is an abridgement of the book just described. It has a sequel:\nThe little book of bigger primes\n(2\nnd\nedition,\n2004)\n. Further number theory books are\nCatalan's Conjecture\npublished in\n1994\n,\nThe new book of prime number records\n(1995)\nand\nFermat's last theorem for amateurs\n(1999)\n.\nMore recent books by Ribenboim are:\nThe theory of classical valuations\n(1999)\n;\nMy numbers, my friends\n(2000)\n;\nClassical theory of algebraic numbers\n(2001)\nIn the Preface to the first of these Ribenboim explains the what he intends to study:-\nKürschák formally introduced the concept of a valuation of a field, as being real valued functions on the set of nonzero elements of the field, satisfying certain properties, like the p-adic valuations.\nOstrowski\n,\nHasse\n,\nSchmidt\n, and others developed this theory. These are the classical valuations which are the object of this book.\nKrull\nextended the concept of a valuation of a field, by allowing the values to be in any totally ordered abelian additive group. Such valuations are often called\nKrull\nvaluations; the classical valuations are special\nKrull\nvaluations. In this book we shall not study\nKrull\nvaluations.\nIn addition to writing many books, Ribenboim has edited a number of 'Collected Works' of his fellow mathematicians. For example, among the mathematicians included in this archive, he has edited the Collected Papers of\nSatoshi Suzuki\n,\nWilhelm Ljunggren\n,\nNorman Alling\n,\nPierre Samuel\n,\nGiacomo Albanese\n,\nLeo Moser\n,\nWolfgang Krull\nand\nMario Fiorentini\n. He has also edited the works of Peter Roquette, Trygve Nagell, Kustaa Inkeri, Ruggiero Torelli and Wayne McDaniel. His own seven-volume collected papers appeared in\n1997\nand a new edition will be issued soon.\nRibenboim has received a wide range of honours for his outstanding contributions to research and for the outstanding books he has written. He was elected a fellow of the Royal Society of Canada in\n1969\n. Other honours have included: an honorary doctorate from the University of Caen, France, in\n1979\n; receiving the Rosette of the Royal Society of Canada in\n1982\n; and a prize for excellence in research from Queen's University in\n1983\n. He received the\nMathematical Associaton of America\n's\nGeorge Polyá\nAward in\n1995\n.\nLet us end by quoting from two reviews of\nMy numbers, my friends\n, a book which both in title and content say much about Ribenboim's mathematical loves. An extract from a review of the text by F Beukers gives a good impression of the contents:-\nThis is a book by a man who loves numbers. In\n10\nlong essays the author deals with number theoretic properties of numbers which have captivated both professional and amateur mathematicians. Examples of such numbers are\nFibonacci\nnumbers, class numbers, prime numbers, consecutive powers, powerful numbers and\n1093\n. Besides that we find chapters on prime-producing polynomials and transcendence results. The text is written on the level of undergraduate students. The choice of topics is of course personal. But in several of them, such as powers in recurrent sequences, the author has made a number of contributions. And on other topics included, the author has written complete books, such as on\nCatalan\n's problem, prime records and\nFermat\n's Last Theorem.\nThe final extract is from a review by Marvin Schaefer:-\nWhat can I say? I am a fan of Paulo Ribenboim, and I avidly look forward to reading his new books. His other works include 'The Little Book of Big Primes'\n(1991)\n, '\n13\nLectures on Fermat's Last Theorem'\n(1995)\n, 'The\n[\nNew\n]\nBook of Prime Number Records'\n(1998)\n, and 'Fermat's Last Theorem for Amateurs'\n(1999)\n. His writing is almost always clear and warmly wry. Most importantly, he takes special pains to make certain that he includes the most recent results and an extensive bibliography. So when 'My Numbers, My Friends' came out, I was excited. And this book more than rewarded my anticipation! Ribenboim is now retired, and treats us to a delightful survey of a few of his favourite numbers ... This book has a number of wonderful and wryly-written passages. Its coverage is vast: although much of the material in the lectures can be found in number theory textbooks, Ribenboim has integrated and consolidated so much related material from the literature that each lecture sparkles from its new treatment.",
  "matematicos_citados_na_biografia": [
    "Dieudonné",
    "Laurent Schwartz",
    "Grothendieck",
    "Lie",
    "Delsarte",
    "Krull",
    "Brazilian Academy of Sciences",
    "Zariski",
    "Witt",
    "Galois theory",
    "discriminant",
    "Dedekind",
    "Galois",
    "Kronecker",
    "Heinrich Weber",
    "Ostrowski",
    "Hasse",
    "Schmidt",
    "Satoshi Suzuki",
    "Wilhelm Ljunggren",
    "Norman Alling",
    "Pierre Samuel",
    "Giacomo Albanese",
    "Leo Moser",
    "Wolfgang Krull",
    "Mario Fiorentini",
    "Mathematical Associaton of America",
    "George Polyá",
    "Fibonacci",
    "Catalan",
    "Fermat"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}