{
  "nome_completo": "Pavel Sergeevich Aleksandrov",
  "nome_curto": "Pavel Aleksandrov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aleksandrov/",
  "data_nascimento": "7 May 1896",
  "local_nascimento": "Bogorodsk (also called Noginsk), Russia",
  "data_morte": "16 November 1982",
  "local_morte": "Moscow, USSR",
  "summary": "Pavel Aleksandrov was a Russian mathematician who made important contributions to general topology.",
  "biografia": "Like most Russian mathematicians there are different ways to transliterate\nAleksandrov\n's name into the Roman alphabet. The most common way, other than Aleksandrov, is to write it as\nAlexandroff.\nPavel Sergeevich Aleksandrov's father Sergej Aleksandrovich Aleksandrov was a medical graduate from Moscow University who had decided not to follow an academic career but instead had chosen to use his skills in helping people and so he worked as a general practitioner in Yaroslavskii. Later he worked in more senior positions in a hospital in Bogorodskii, which is where he was when Pavel Sergeevich was born.\nWhen Pavel Sergeevich was one year old his father moved to Smolensk State hospital, where he was to earn the reputation of being a very fine surgeon, and the family lived from this time in Smolensk. The city of Smolensk is on the Dnieper River\n420\nkm west of Moscow. Pavel Sergeevich's early education was from his mother, Tsezariya Akimovna Aleksandrova, who applied all her considerable talents to bringing up and educating her children. It was from her that Aleksandrov learnt French and also German. His home was one that was always filled with music as his brothers and sisters all had great talent in that area.\nThe fine start which his mother gave him meant that he always excelled at the grammar school in Smolensk which he attended. His mathematics teacher Alexsander Romanovich Eiges soon realised that his pupil had a remarkable talent for the subject and\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\n... at grammar school he studied celestial mechanics and mathematical analysis. But his interest was mainly directed towards fundamental problems of mathematics: the foundations of geometry and\nnon-euclidean geometry\n. Eiges had a proper appreciation of his pupil and exerted a decisive influence on his choice of a career in mathematics.\nIn\n1913\nAleksandrov graduated from the grammar school being dux of the school and winning the gold medal. Certainly at this time he had already decided on a career in mathematics, but he had not set his sights as high as a university teacher, rather he was aiming to become a secondary school teacher of mathematics. Eiges was the role model whom he was aspiring to match at this stage, for Eiges had done more than teach Aleksandrov mathematics, he had also influenced his tastes in literature and the arts.\nAleksandrov entered Moscow University in\n1913\nand immediately he was helped by\nStepanov\n.\nStepanov\n, who was working at Moscow University, was seven years older than Aleksandrov but his home was also in Smolensk and he often visited the Aleksandrov home there.\nStepanov\nwas an important influence on Aleksandrov at this time and suggested that Aleksandrov join\nEgorov\n's seminar even in the first year of his studies in Moscow. In Aleksandrov's second year of study he came in contact with\nLuzin\nwho had just returned to Moscow. Aleksandrov wrote\n(\nsee for example\n[\n3\n]\nor\n[\n4\n]\n)\n:-\nAfter\nLuzin\n's lecture I turned to him for advice on how best to continue my mathematical studies and was struck most of all by\nLuzin\n's kindness to the man addressing him - an\n18\n-year old student ... I then became a student of\nLuzin\n, during his most creative period ... To see\nLuzin\nin those years was to see a display of what is called an inspired relationship to science. I learnt not only mathematics from him, I received also a lesson in what makes a true scholar and what a university professor can and should be. Then, too, I saw that the pursuit of science and the raining of young people in it are two facets of one and the same activity - that of a scholar.\nAleksandrov proved his first important result in\n1915\n, namely that every non-denumerable Borel set contains a perfect subset. It was not only the result which was important for set theory, but also the methods which Aleksandrov used which turned out to be one of the most useful methods in descriptive set theory. After Aleksandrov's great successes\nLuzin\ndid what many a supervisor might do, he realised that he had one of the greatest mathematical talents in Aleksandrov so he thought that it was worth asking him to try to solve the biggest open problem in set theory, namely the\ncontinuum hypothesis\n.\nAfter Aleksandrov failed to solve the continuum hypothesis\n(\nwhich is not surprising since it can neither be proved or disproved as was shown by Cohen in the\n1960\ns\n)\nhe thought he was not capable of a mathematical career. Aleksandrov went to Novgorod-Severskii and became a theatre producer. He then went to Chernikov where, in addition to theatrical work, he lectured on Russian and foreign languages, becoming friends with poets, artists and musicians. After a short term in jail in\n1919\nat the time of the Russian revolution, Aleksandrov returned to Moscow in\n1920\n.\nLuzin\nand\nEgorov\nhad built up an impressive research group at the University of Moscow which the students called 'Luzitania' and they, together with\nPrivalov\nand\nStepanov\n, were very welcoming to Aleksandrov on his return.\nIt was not an immediate return to Moscow for Aleksandrov, however, for he spent\n1920\n-\n21\nback home in Smolensk where he taught at the University. During this time he worked on his research, going to Moscow about once every month to keep in touch with the mathematicians there and to prepare himself for his examinations. At around this time Aleksandrov became friendly with\nUrysohn\n, who was a member of 'Luzitania', and the friendship would soon develop into a major mathematical collaboration.\nAfter taking his examinations in\n1921\n, Aleksandrov was appointed as a lecturer at Moscow university and lectured on a variety of topics including functions of a real variable,\ntopology\nand\nGalois theory\n. In July\n1922\nAleksandrov and\nUrysohn\nwent to spend the summer at Bolshev, near to Moscow, where they began to study concepts in topology.\nHausdorff\n, building on work by\nFréchet\nand others, had created a theory of topological and metric spaces in his famous book\nGrundzüge der Mengenlehre\nⓉ\n(\nGeneral set theory\n)\npublished in\n1914\n. Aleksandrov and\nUrysohn\nnow began to push the theory forward with work on countably compact spaces producing results of fundamental importance. The notion of a compact space and a locally compact space is due to them.\nIn the summers of\n1923\nand\n1924\nAleksandrov and\nUrysohn\nvisited Göttingen and impressed\nEmmy Noether\n,\nCourant\nand\nHilbert\nwith their results. The mathematicians in Göttingen were particularly impressed with their results on when a topological space is metrisable. In the summer of\n1924\nthey also visited\nHausdorff\nin Bonn and he was fascinated to hear the major new directions that the two were taking in topology. However while visiting\nHausdorff\nin Bonn\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\nEvery day Aleksandrov and\nUrysohn\nswam across the Rhine - a feat that was far from being safe and provoked\nHausdorff\n's displeasure.\nAleksandrov and\nUrysohn\nthen visited\nBrouwer\nin Holland and Paris in August\n1924\nbefore having a holiday in the fishing village of Bourg de Batz in Brittany. Of course mathematicians continue to do mathematics while on holiday and they were both working hard. On the morning of\n17\nAugust\nUrysohn\nbegan to write a new paper but tragically he drowned while swimming in the Atlantic later that day. Aleksandrov determined that no ideas of his great friend and collaborator should be lost and he spent part of\n1925\nand\n1926\nin Holland working with\nBrouwer\non preparing\nUrysohn\n's paper for publication.\nThe atmosphere in Göttingen had proved very helpful to Aleksandrov, particularly after the death of\nUrysohn\n, and he went there every summer from\n1925\nuntil\n1932\n. He became close friends with\nHopf\nand the two held a topological seminar in Göttingen. Of course Aleksandrov also taught in Moscow University and from\n1924\nhe organised a topology seminar there. At Göttingen, Aleksandrov also lectured and participated in\nEmmy Noether\n's seminar. In fact Aleksandrov always included\nEmmy Noether\nand\nHilbert\namong his teachers, as well as\nBrouwer\nin Amsterdam and\nLuzin\nand\nEgorov\nin Moscow.\nFrom\n1926\nAleksandrov and\nHopf\nwere close friends working together. They spent some time in\n1926\nin the south of France with\nNeugebauer\n. Then Aleksandrov and\nHopf\nspent the academic year\n1927\n-\n28\nat Princeton in the United States. This was an important year in the development of topology with Aleksandrov and\nHopf\nin Princeton and able to collaborate with\nLefschetz\n,\nVeblen\nand\nAlexander\n. During their year in Princeton, Aleksandrov and\nHopf\nplanned a joint multi-volume work on\nTopology\nthe first volume of which did not appear until\n1935\n. This was the only one of the three intended volumes to appear since World War II prevented further collaboration on the remaining two volumes. In fact before the joint work with\nHopf\nappeared in print, Aleksandrov had begun yet another important friendship and collaboration.\nIn\n1929\nAleksandrov's friendship with\nKolmogorov\nbegan and they\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\n... journeyed a lot along the Volga, the Dnieper, and other rivers, and in the Caucuses, the Crimea, and the south of France.\nThe year\n1929\nmarks not only the beginning of the friendship with\nKolmogorov\nbut also the appointment of Aleksandrov as Professor of Mathematics at Moscow University. In\n1935\nAleksandrov went to Yalta with\nKolmogorov\n, then finished the work on his\nTopology\nbook in the nearby Crimea and the book was published in that year. The 'Komarovski' period also began in that year\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\nOver the last forty years, many of the events in the history of mathematics in the University of Moscow have been linked with Komarovka, a small village outside Moscow. Here is the house owned since\n1935\nby Aleksandrov and\nKolmogorov\n. Many famous foreign mathematicians also visited Komarovka -\nHadamard\n,\nFréchet\n,\nBanach\n,\nHopf\n,\nKuratowski\n, and others.\nIn\n1938\n-\n1939\na number of leading mathematicians from the Moscow University, among them Aleksandrov, joined the Steklov Mathematical Institute of the\nUSSR Academy of Sciences\nbut at the same time they kept their positions at the University.\nAleksandrov wrote about\n300\nscientific works in his long career. As early as\n1924\nhe introduced the concept of a locally finite covering which he used as a basis for his criteria for the metrisability of topological spaces. He laid the foundations of\nhomology theory\nin a series of fundamental papers between\n1925\nand\n1929\n. His methods allowed arguments of combinatorial and\nalgebraic topology\nto be applied to\npoint set topology\nand brought together these areas. Aleksandrov's work on homology moved forward with his homological theory of dimension around\n1928\n-\n30\nAleksandrov was the first to use the phrase 'kernel of a homomorphism' and around\n1940\n-\n41\nhe discovered the ingredients of an exact sequence. He worked on the theory of continuous mappings of topological spaces. In\n1954\nhe organised a seminar on this last topic aimed at first year students at Moscow University and in this he showed one of the aspects of his career which was of major importance to him, namely the education of students. This is described in\n(\n[\n3\n]\nand\n[\n4\n]\n)\n:-\nTo the training of these students and those who came after them, Aleksandrov literally devoted all his strength. His influence on the class of young men studying topology under him was never purely mathematical, however real and significant that was. There were physical days exercise on topological walks, in long outings lasting several days by boat, ... in swimming across the Volga or other broad stretches of water, in skiing excursions lasting for hours on the slopes outside Moscow, slopes to which Aleksandrov gave striking, fantastic names...\nMany honours were given to Aleksandrov for his outstanding contribution to mathematics. He was president of the\nMoscow Mathematical Society\nfrom\n1932\nto\n64\n, vice president of the International Congress of Mathematicians from\n1958\nto\n62\n, a corresponding member of the\nUSSR Academy of Sciences\nfrom\n1929\nand a full member from\n1953\n. Many other societies elected Aleksandrov to membership including the\nGöttingen Academy of Sciences\n, the\nAustrian Academy of Sciences\n, the Leopoldina Academy in Halle, the\nPolish Academy of Sciences\n, the\nNational Academy of Sciences of the United States\n, the\nLondon Mathematical Society\n, the American Philosophical Society, and the\nDutch Mathematical Society\n.\nHe edited several mathematical journals, in particular the famous Soviet Journal\nUspekhi Matematicheskikh Nauk\n, and he received many Soviet awards, including the Stalin Prize in\n1943\nand five Orders of Lenin.\nToday the Department of General Topology and Geometry of Moscow State University is Russia's leading centre of research in set-theoretic topology. After Aleksandrov's death in November\n1982\n, his colleagues from the Department of Higher Geometry and Topology, in which he had held the chair, sent a letter to Moscow University's rector A A Logunov proposing that one of Aleksandrov's former students should become Head of the Department, to preserve Aleksandrov's scientific school. On\n28\nDecember\n1982\nthe rector issued a circular creating the Department of general topology and Geometry.\nVitaly Vitalievich Fedorchuk\nwas elected Head of the Department.\nAlso in memory of Aleksandrov's contributions to topology at Moscow University and his work with the\nMoscow Mathematical Society\n, there is an annual topological symposium\nAleksandrov Proceedings\nheld every May.",
  "matematicos_citados_na_biografia": [
    "non-euclidean geometry",
    "Stepanov",
    "Egorov",
    "Luzin",
    "continuum hypothesis",
    "Privalov",
    "Urysohn",
    "topology",
    "Galois theory",
    "Hausdorff",
    "Fréchet",
    "Emmy Noether",
    "Courant",
    "Hilbert",
    "Brouwer",
    "Hopf",
    "Neugebauer",
    "Lefschetz",
    "Veblen",
    "Alexander",
    "Kolmogorov",
    "Hadamard",
    "Banach",
    "Kuratowski",
    "USSR Academy of Sciences",
    "homology theory",
    "algebraic topology",
    "point set topology",
    "Moscow Mathematical Society",
    "Göttingen Academy of Sciences",
    "Austrian Academy of Sciences",
    "Polish Academy of Sciences",
    "National Academy of Sciences of the United States",
    "London Mathematical Society",
    "Dutch Mathematical Society",
    "Vitaly Vitalievich Fedorchuk"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}