{
  "nome_completo": "Pedro Nunes Salaciense",
  "nome_curto": "Pedro Nunes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nunes/",
  "data_nascimento": "1502",
  "local_nascimento": "Alc치cer do Sal, Portugal",
  "data_morte": "11 August 1578",
  "local_morte": "Coimbra, Portugal",
  "summary": "Pedro Nunes or Nunez was a Portuguese scholar who worked in geometry, spherical trigonometry, algebra as well as geography, physics, and cosmology.",
  "biografia": "Pedro Nunes\nor\nNunez\nwrote under the Latin name of Petrus Nonius Salaciensis. The city of his birth, Alc치cer do Sal, was named Salacia by the Romans so Salaciensis simply indicates that he came from Salacia. Nothing is known of his parents but it is certain that they were of the Jewish religion. Nunes travelled to Spain and entered the University of Salamanca around\n1517\n. This university, already\n300\nyears old when Nunes began his studies, was one of the leading centres for education in Europe. Although no records exist to prove the date of his admission, nevertheless at this time it was typical for boys to enter university at age fifteen and from the wide range of topics that he studied at Salamanca we know that he must have taken a typical length course. Given the skills he acquired he must have studied philosophy, medicine, mathematics and geography. In\n1523\nhe graduated and, in the same year, married the Spanish girl D Guiomar Areas in Salamanca. Pedro and Guiomar Nunes had six children: two boys Apol칩nio and Pedro, and four girls Briolanja, Francisca, Isabel and Guiomar.\nWe do not know exactly how long Nunes remained at Salamanca after he graduated but by\n1527\nhe had returned to Portugal. There he began teaching Prince Luis, the brother of Joao o Piedoso. Joao had become king of Portugal\n(\nknown as John III or John the pious\n)\nin\n1521\nat the age of nineteen. Nunes acted as tutor to Luis until July\n1531\n. Starting in\n1527\n, Nunes taught navigation skills to Martim Afonso de Sousa, who led the first colonizing expedition to Brazil in\n1530\n, and to another naval officer Joao de Castro. In fact Joao de Castro, in addition to a highly successful career in the Portuguese navy in North Africa and India, was himself an excellent scientist writing three important works on the science of navigation in\n1538\n,\n1538\n-\n39\nand\n1541\n. On\n16\nNovember\n1529\nking Joao o Piedoso appointed Nunes as \"Cosmographer of the Kingdom of Portugal\". One of his official duties as Cosmographer was to give classes in navigation to seafarers. A few weeks later, on\n4\nDecember, he began teaching moral philosophy at the University of Lisbon. This appointment was only as a substitute for the professor, but on\n15\nJanuary\n1530\nhe was appointed to the chair of Logic. He taught logic for at least a year but it appears that his classes were not very successful with students so he moved to the chair of\nmetaphysics\non\n4\nApril\n1532\n. During this period, however, Nunes was working towards a doctorate in medicine and after successfully taking examinations on\n16\nFebruary\n1532\nbe was awarded his medical doctorate on\n3\nMarch.\nIt is not entirely clear where Nunes was over the period between\n1532\nand\n1544\n. Part of the time he was in Lisbon but there is also evidence that he spent time in Spain. Certainly during this period he was officially employed by the University of Lisbon and he supervised the studies of a number of doctoral students over these years. He was also working during these years on writing a number of books. He began writing\nLibro de Algebra\nin\n1534\nalthough only published the completed work thirty-three years later. The book is in three parts, the first part dealing with equations of the first and second degree and the third part dealing with equations of the third degree. The middle part of the text studies the theory of proportion and algebraic manipulation. The first of Nunes books to be published was\nTratado da Sphera\nin\n1537\n. This book contained Nunes' edition of\nSacrobosco\n's\nTractatus de Sphaera\n, of\nPeurbach\n's\nTheoricae nouae planetarum\n, and of Book I of\nPtolemy\n's\nGeographia\n. In addition Nunes added two works of his own on navigation. His next published work was\nDe Crepusculis\n(1542)\nin which he addressed a problem posed to him by one of his pupils, Prince Cardinal Henrique the son of Manuel I who became archbishop of Braga in\n1534\nand, after a career in the church, king of Portugal in\n1578\n. Nunes taught Henrique from October\n1531\nuntil his appointment in Braga. The question he had posed to Nunes was \"Which day has the shortest twilight?\" and it was the question of the duration of twilight that Nunes addressed in\nDe Crepusculis\n. Gonzalo de Reparaz Ruiz writes\n[\n10\n]\n:-\n[\nNunes\n]\nwas teacher of mathematics of the son of D Manuel, the Infant Henry, to whom he demonstrated the method of establishing the latitude of a point by the height of the sun and how to indicate this on a chart. This demonstration he repeated before the King in\n1533\n. In the preface which he had written to his Libro de Algebra and dedicated to his former pupil the Cardinal Henry, who was then Regent of the country, Nunes states that the publication of this book was delayed by other \"very varied\" works which, he asserts, had taken his time for several years.\nNunes moved to the University of Coimbra to take up the Chair of Mathematics on\n16\nOctober\n1544\n, a post he held until\n1562\nalthough he spent four years away from the University living in Lisbon during the period\n1557\n-\n61\n. The Chair of Mathematics was a new post in the University of Coimbra and it was set up to provide instruction in the technical requirements for navigation, clearly a topic of great importance in Portugal at this period when control of sea trade was the chief source of Portuguese wealth. While at Coimbra Nunes taught\nChristopher Clavius\n. He had been appointed Royal Cosmographer in\n1529\nbut was promoted to Chief Royal Cosmographer on\n22\nDecember\n1547\n. He held this post until his death. In\n1548\nthe king, Joao o Piedoso, honoured Nunes by naming him Cavaleiro do H치bito de Cristo\n(\nKnight of the Order of Christ\n)\n.\nSoon after moving to Coimbra Nunes published\nDe erratis Orontii Finaei\nin\n1546\n. This book was written to show that\nOronce Fine\n's attempts to solve the three classical problems of squaring the circle, trisecting an arbitrary angle and to doubling the cube were incorrect. Around\n1550\nhe made the discovery for which today he is best known, namely his investigation of the\nloxodrome\nor, to use the name that Nunes invented, the rhumb line. In many ways the loxodrome is a natural curve for someone interested in navigation to examine for it is the curve that a ship will follow if it always follows the same compass setting. Another way to think of the curve is that it is obtained by cutting the meridians on the sphere at a constant angle. A loxodrome will, in fact, spiral towards the pole but its importance to map projections is that the loxodrome become a straight line in the Mercator projection of the sphere. It was\nWillebrord Snell\nwho named Nunes' rhumb line the loxodrome.\nIn\n1566\nNunes published his own collected works as\nPetri Nonii Salaciensis Opera\nwhich contains improved versions of his earlier works with additional material\n[\n8\n]\n:-\nThis book is a very much extended compilation of Nunes works about navigation and was, at the time, the state of the art of nautical science. It also included a commentary to\nAristotle\n's mechanical problem on the motion of a boat propelled by oars.\nA second improved edition of this book was published in\n1573\nunder a different title, namely\nDe arte atque ratione navigandi\n. In\n1567\nhe published\nLibro de Algebra\nmostly written many years earlier as we noted above. We note that John Martyn published in\n[\n4\n]\nwhat is claimed to be an early version of Nunes' algebra text. However, Giovanna Cifoletti\n[\n5\n]\ncasts doubt on whether the published manuscript was written by Nunes or whether it was a set of notes taken by one of Nunes' students. In\n1571\nhe put together two of his previously published texts,\nDe Crepusculis\nand\nDe erratis Orontii Finaei\n, bring them out in a single volume. Outside mathematics he worked in geography, physics,\ncosmology\nand he wrote poetry. Examples of his poetry are published in\n[\n4\n]\n.\nNunes devised a system to allow fractional parts of a degree to be measured. He describes it as:-\n... drawing on the face of a quadrant for measuring angles\n45\nconcentric arcs, one of which was divided into\n90\nequal parts or degrees, and the remainder into\n89\n,\n88\n,\n87\n,\n86\n, etc., successively, the last being divided into\n46\nequal parts. When the index did not exactly cut one of the divisions of the arc of degrees, it passed through or near to one of the divisions of one or other of the other arcs; and by noting the place of that division the fractional parts of a degree were calculated.\nIn\n1572\nNunes was called to court to preside over the reform of weights and measures. He stayed in Lisbon for two years before finally returning to Coimbra.\nFinally, let us note the friendship between\nJohn Dee\nand Nunes.\nDee\nwrote in\n1558\n:-\n... if my work cannot be finished or published while I remain alive, I have bequeathed it to that most learned and grave man who is the sole relic and ornament and prop of the mathematical arts among us, D D Pedro Nunes, of Salacia, and not long since prayed him strenuously that, if this work of mine should be brought to him after my death, he would kindly and humanely take it under his protection and use it in every way as if it were his own: that he would deign to complete it, finally, correct it, and polish it for the public use of philosophers as if it were entirely his. And I do not doubt that he will himself be a party to my wish if his life and health remain unimpaired, since he loves me faithfully and it is inborn in him by nature, and reinforced by will, industry, and habit, to cultivate diligently the arts most necessary to a Christian state.",
  "matematicos_citados_na_biografia": [
    "metaphysics",
    "Sacrobosco",
    "Peurbach",
    "Ptolemy",
    "Christopher Clavius",
    "Oronce Fine",
    "loxodrome",
    "Willebrord Snell",
    "Aristotle",
    "cosmology",
    "John Dee",
    "Dee"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}