{
  "nome_completo": "Peter Clive Sarnak",
  "nome_curto": "Peter Sarnak",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sarnak/",
  "data_nascimento": "18 December 1953",
  "local_nascimento": "Johannesburg, South Africa",
  "data_morte": null,
  "local_morte": null,
  "summary": "Peter Sarnak is South African/American mathematician who, with Alex Lubotzky and Ralph Phillips, introduced Ramanujan graphs which have led to advances in theoretical computer science, differential geometry, algebraic groups and finite groups. He has received many major awards including the Pólya Prize, the Ostrowski Prize, the Levi L Conant Prize, the Frank Nelson Cole Prize, the Paul R Halmos-Lester R Ford Prize and the Wolf Prize.",
  "biografia": "Peter Sarnak\nwas born into a Jewish family in Johannesburg, South Africa. When he was about eight years old the family spent over two years in Israel and it was there that Peter has his first memories of becoming excited about mathematics\n[\n18\n]\n:-\nThere was another girl in the class and she showed me how to solve two simultaneous linear equations and I was just blown away about this and I just thought she was the greatest genius and I was just following her around. I asked her to explain something else to me - so she showed me how to eliminate variables which essentially is a big chunk of linear algebra. This was fascinating to me and then I showed it to my father and he knew how to do that too.\nMathematics was just something that he found easy and not challenging, so school mathematics did little to interest Peter. The thing he did find challenging was chess, and he was an enthusiastic player when at school; he played at both national and international level. After returning to South Africa, he attended the King David School in Victoria Park, Johannesburg, run by the South African Board of Jewish Education. He wrote in\n[\n21\n]\nthat while at this school:-\n... my passion was tournament chess where I enjoyed success at the junior and senior levels in southern Africa. My father was very supportive of my\n(\nand my brothers'\n)\ninvolvement with chess while we were kids ...\nHe was indeed very successful becoming Junior Chess Champion of South Africa, and then Champion of Rhodesia.\nChess, however, led to another encounter with mathematics\n[\n18\n]\n:-\n... when I was playing chess, I would read all the chess books from the local library of all the grandmasters. One of the grandmasters was a Russian Botvinnik, world champion around\n1960\n. He had a degree in electrical engineering and would write in some of his books sort of mathematically. ... engineers used the letter j not i for the square root of minus one. ... he said it's the square root of minus one and I learned that from a world chess champion, and well, I understood what he was saying but he was using it as an analogy.\nWhen in his final year of study at High School, Sarnak told his father he was going abroad to become a professional chess player. His father, however, insisted that his son undertake university studies before doing that. Sarnak graduated from the King David School in\n1971\nand entered the University of the Witwatersrand with the aim of specialising in physics.\nSarnak knew Eddie Price\n(1939\n-\n2022)\nwho was a leading South African chess player and physics lecturer. After the award of a B.Sc. with Honours in physics from the University of the Witwatersrand, Price had gone to England to obtain a Master's Degree in physics from St John's College, Cambridge, before returning to the University of the Witwatersrand as a lecturer in physics. During his first year studying physics, Sarnak told Price that he was miserable doing physics labs. Price said that if it was the theoretical side of physics that he enjoyed, then he was better to major in applied mathematics. He had found the first year mathematics courses exciting\n[\n34\n]\n:-\nWhat won me over as a first year undergraduate studying mathematics was abstraction and specifically that conceptual thinking can make the solution of a problem and understanding of a theory completely transparent. I remember the first course in abstract linear algebra as a spark, and also a topology course that drew me to want to learn and understand much more.\nSo Sarnak changed to study both pure and applied mathematics. He\n[\n6\n]\n:-\n... completed his BSc degree at the University of the Witwatersrand in\n1974\n. He was awarded the Herbert Le May prize for Applied Mathematics and the William Cullen Medal for the best graduate in the Faculty of Science in\n1974\n. He went on to complete his BSc Honours in Pure Mathematics also at the University of the Witwatersrand and was awarded the Unico Chemical Company Gold Medal for the Best Honours student in the Science Faculty in\n1975\n.\nThe Professor and Head of the Department of Mathematics at the University of the Witwatersrand when Sarnak studied there was Douglas Barker Sears. Born in South Africa, Sears had gone to England in\n1950\nand trained under\nE C Titchmarsh\nbecoming an expert on differential equations. Although Sarnak had begun his studies at university with the intention of having a career in chess, once he met deep mathematics he gave up the idea of a chess career and became determined to become a mathematician. A course by Sears had made a major impression on him\n[\n12\n]\n:-\nOne of my teachers D B Sears\n(\nwho was one of the few students of the British analyst\nE C Titchmarsh\nand worked on spectral theory of differential operators\n)\ngave a course on\nGelfand\n's theory of\nBanach\nAlgebras. The course was aimed at showing the power of this elegant theory and its broad applications, and it left a tremendous impression on me - it was the first piece of modern mathematics that I had seen.\nSarnak was definite about wanting to carry on to postgraduate work but at that time South Africa was not a good place for that. All his lecturers, impressed with his abilities, told him that he should go to either Oxford or Cambridge. Sarnak, however, felt that if he went to either, then he would be encouraged to go as quickly as possible to a doctorate but he wanted a broader postgraduate experience. The United States offered what he sought, so he applied to universities there. He decided to accept Stanford University and began his studies there in\n1976\n.\nWhen at the University of the Witwatersrand, Sarnak had known fellow student Helen Nissenbaum, the daughter of Michael Meyer Nissenbaum and Rose Stillerman. Helen was awarded a B.A. Mathematics and Philosophy in\n1975\nand First Class Honours in Philosophy in\n1976\n, both from the University of the Witwatersrand. With Sarnak, she began her postgraduate studies at Stanford University in\n1976\n. Peter Sarnak and Helen Nissenbaum were married on\n9\nJune\n1977\nin San Francisco, California. Helen was awarded an M.A. Social Sciences in Education from Stanford in\n1978\nand continued to study at Stanford for a Ph.D. Let us note that Peter Sarnak and Helen Nissenbaum have three daughters.\nPeter Sarnak's postgraduate studies at Stanford were supervised by\nPaul Cohen\n.\nCohen\nwas a world leader in mathematical logic and had been awarded a\nFields\nmedal in\n1966\nfor his proof that the continuum hypothesis and the axiom of choice could not be deduced from the axioms of\nZermelo\n-\nFraenkel\nset theory. This looks like a narrow speciality, rather than the breadth that Sarnak was seeking, but he explained in\n[\n45\n]\n:-\nI had taken some basic courses in mathematical logic and even some about\nCohen\n's technique of forcing. I had heard from some of the faculty that\nCohen\nwas a very dynamic and brilliant mathematician and found this very appealing. This information was rather accurate and I was very fortunate to learn a great amount of mathematics and especially taste and quality from\nPaul Cohen\n.\nHe also spoke about\nCohen\nin the interview\n[\n34\n]\n:-\nPaul Cohen\n, who was my thesis advisor, had a major influence on my mathematical taste, knowledge, insight and intuition. His view of the unity of mathematics\n(\nand that one really need not stick to a small sub-field\n)\nmade a big impression on me. Together,\nPaul\nand I studied a good portion of\nSelberg\n's works, and the core of my own work is very much shaped and influenced by\nSelberg\n's ideas.\nSarnak's\n111\n-page Ph.D. thesis\nPrime Geodesic Theorems\nwas approved in August\n1980\n. In it he gives the following acknowledgement:-\nI would like to thank my adviser, Professor\nP Cohen\n, for all he taught me over the past few years, and for his encouragement and advice. I would also like to thank Professor R S Phillips for his encouragement and the many discussions on and relating to the subject of this thesis. To my office mate, A Woo, thanks for all the mathematics learned and done together. ... Finally, thanks to Helen for her continual support.\nHelen is, of course, Sarnak's wife. Also mentioned in this quote is Ralph Saul Phillips\n(1913\n-\n1998)\nwho became an important collaborator of Sarnak's, the two writing seventeen joint papers. Sarnak wrote about Phillips' influence when he was a postgraduate student in\n[\n51\n]\n:-\nFrom the point of view of students and young postdocs, Ralph was a model professor. He always welcomed people into his office to discuss mathematics or to do joint readings. ... In seminars and colloquia he never hesitated to ask a basic question, even though it might well show some ignorance. His were the questions that many in the audience were wondering about but were afraid to ask. In fact, Ralph was never interested in dazzling; he never put on airs. He was happy and satisfied with what he was doing, and it was contagious. He much preferred to work together with others, and as is clear from his many successful collaborations, he was very good at it.\nAlex Woo, Sarnak's 'office mate', was a Ph.D. student advised by Ralph Phillips. His thesis was\nScattering Theory on Real Hyperbolic Spaces and their Compact Perturbations\n(1981)\n.\nReturning to Sarnak's Ph.D. thesis, we quote now the beginning of the Introduction:-\nA lot of work has been done in recent years concerning closed geodesics on Riemannian manifolds. In the case that the manifold has a \"large\" fundamental group such as a surface of genus g ≥\n2\n, the existence of infinitely many such geodesics is easily demonstrated by exhibiting one in each free homotopy class. The work referred to above is concerned with showing the existence of infinitely many prime geodesics on any compact, closed manifold.\nIt is our aim in this thesis to study the asymptotic distribution of the lengths of periodic geodesics, and consequences thereof. The results we obtain have interesting applications to number theory as well as to the behaviour of eigenvalues of the\nLaplace\n-\nBeltrami\noperator on Riemannian manifolds.\nThere are three different methods of getting hold of the closed geodesics. The first is to use the fact that these geodesics are critical points of the energy integral on a path space. Secondly, by viewing these geodesics as periodic orbits of the geodesic flow, one may use methods of topological dynamics. Finally, in the case of constant curvature, the lengths of the closed geodesics can be identified through exact trace formulas such as the\nSelberg\nTrace Formula. We will be concerned mainly with the latter two methods, as they are more useful as far as asymptotics of the lengths is concerned.\nSarnak was appointed as Assistant Professor of Mathematics at\nCourant\nInstitute of Mathematical Sciences, New York University in\n1980\nand promoted to Associate Professor there in\n1983\n. Also in\n1983\nhe was one of twenty mathematicians awarded an Alfred P Sloan Fellowship for Basic Research\n[\n52\n]\n:-\nThe recipients were selected on the basis of their exceptional potential to make creative contributions to scientific knowledge. ... Candidates for fellowships are nominated by senior scientists familiar with their talents. Fellows need not pursue a specified research project and are free to shift the direction of their research at any time.\nIn\n1985\nhe was named Presidential Young Investigator\n[\n53\n]\n:-\nThe National Science Foundation recently announced ... the Presidential Young Investigator Awards for\n1985\n. This is the second year in a program begun in\n1984\n. ... The awards, which fund research by faculty near the beginning of their academic careers, are intended to help universities attract and retain outstanding young Ph.D.'s who might otherwise pursue non-teaching careers.\n...\nNames of\n1985\nrecipients of Presidential Young Investigator Awards in the mathematical sciences, their institutional affiliations and research interest follow: ... Peter Sarnak\n(\nStanford University\n)\n, Analysis, Number Theory and Geometry ...\nFor more information about these awards and other major awards made to Sarnak, see\nTHIS LINK\n.\nBack at Stanford University, Sarnak became a full professor in\n1987\n. He spent a sabbatical year\n1987\n-\n1998\nas a Fellow at the Institute of Advanced Studies, Hebrew University of Jerusalem, Israel. He was appointed as a Professor at Princeton University in\n1991\nand named\nH Fine\nProfessor there in\n1995\n. He served as Head of Mathematics at Princeton\n1996\n-\n99\n. In addition to his role at Princeton University, he was a member of Institute for Advanced Study\n1999\n-\n2002\nand a Professor at the\nCourant\nInstitute\n2001\n-\n2005\n. In\n2002\nhe was named Eugene Higgins Professor of Mathematics at Princeton University.\nSarnak's two main areas of research are number theory and analysis on manifolds. His first papers on number theory were:\nClass numbers of indefinite binary quadratic forms\n(1982)\n,\nSums of Kloosterman sums\n(1983)\n,\nThe arithmetic and geometry of some hyperbolic three-manifolds\n(1983)\n, and\nAdditive number theory and Maass forms\n(1984)\n. On analysis on manifolds and dynamical systems, his first papers were:\nAsymptotic behavior of periodic orbits of the horocycle flow and Eisenstein series\n(1981)\n,\nEntropy estimates for geodesic flows\n(1982)\n,\nA new curvature invariant and entropy of geodesic flows\n(1984)\n, and\nDomains in hyperbolic space and limit sets of Kleinian groups\n(1984)\n.\nOne of his most important papers was\nRamanujan graphs\n(1988)\n[\n36\n]\n:-\nIn his celebrated\n1988\npaper with Alex Lubotzky and Ralph Phillips, Sarnak constructed a family of\n(\nwhat they called\n)\nRamanujan\ngraphs - these are expander graphs which are, in many ways, optimal. This was, at the time, revolutionary - it was known that a random graph was an expander, but no one knew how to construct one deterministically, and certainly no one even guessed that a deterministic family with optimal expansion properties was possible. The result had immediate repercussions in theoretical computer science, but many of the techniques were developed further\n(\noften by Sarnak and his students\n)\nto create a veritable revolution in mathematics, involving such diverse fields as differential geometry and algebraic and finite groups.\nIn\n1990\nSarnak was an invited speaker in the Number Theory Section of the International Congress of Mathematicians held in Kyoto, Japan. He gave the talk\nDiophantine problems and Linear Groups\nand began his lecture as follows:-\nIn this lecture we describe and exploit the relation between analytic Diophantine problems on homogeneous varieties and harmonic analysis on the corresponding groups. For the case\nG\n=\nS\nL\n(\n2\n)\nG = SL(2)\nG\n=\nS\nL\n(\n2\n)\nthis relation has been well studied and striking applications to analytic number theory have been found, especially by\nIwaniec\nand his collaborators. Our focus here will be on general G where this aspect of the theory is still in a primitive state.\nEight years later, at the\n1998\nInternational Congress of Mathematicians held in Berlin, Sarnak was a plenary speaker delivering the talk\nL-functions\n. The lecture began:-\nSince\nHecke\n's work, the theories of L-functions and of automorphic forms have been closely interwoven. In this talk, we review some recent developments concerning the analytic aspects of these topics.\nSarnak described the areas he worked on in\n[\n21\n]\n:-\nI have worked in areas ranging from analysis to number theory and mathematical physics. A recurring theme throughout this work is the role of symmetry and group theory. The modern theory of zeta and L-functions, which has its origins in the works of\nDirichlet\nand\nRiemann\n, has far-reaching applications to prime numbers, to Diophantine equations such as the solution of quadratic equations in several integer variables, to combinatorics and theoretical computer science, and even to the understanding of the quantizations of certain arithmetically defined chaotic Hamiltonian systems. Finding and exploiting these applications in order to solve basic problems of these types has been one of the major thrusts of my work.\nHis outstanding contributions to these areas led to him winning major awards in addition to the two mentioned above. He has been awarded the\n1998\nGeorge Pólya\nPrize in Mathematics for:-\n... pathbreaking extension of steepest descent methods for the asymptotic analysis of oscillatory\nRiemann\n-\nHilbert\nproblems.\nHe was awarded the\n2001\nOstrowski\nPrize\n[\n13\n]\n:-\nHis contributions to number theory and to questions of analysis often motivated by number theory have been very influential in mathematics.\nAlong with Nicholas Katz, he received the\n2003\nLevi L Conant Prize for the\n[\n1\n]\n:-\n... expository paper \"Zeroes of zeta functions and symmetry\".\n[\nIt\n]\nis a model of high-level exposition. Katz and Sarnak do justice to their beautiful topic, a rich mix of intensive numerical exploration, conjectures, and theorems.\nHe received the\n2005\nFrank Nelson Cole\nPrize in Number Theory\n[\n2\n]\n:-\n... for his work relating the distribution of zeros of L-functions in certain families to the distribution of eigenvalues in a large compact linear group of a type that depends on the family of L-functions one is considering.\nSarnak was awarded the\nPaul R Halmos\n-\nLester R Ford\nPrize in\n2012\nfor his paper\nIntegral Apollonian Packings\nand the Wolf Prize in Mathematics in\n2014\n[\n14\n]\n:-\n... for his deep contributions to analysis, number theory, geometry, and combinatorics.\nThe\nRoyal Society of London\nawarded Peter Sarnak its\nSylvester\nMedal in\n2019\n:-\n... for transformational contributions across number theory, combinatorics, analysis and geometry.\nFor more details of all these awards, see\nTHIS LINK\n.\nIn addition to these awards, Sarnak received honorary degrees from a number of universities including the Hebrew University of Jerusalem\n(2010)\n, the University of Chicago\n(2015)\n, the University of the Witwatersrand\n(2014)\n, the University of St Andrews\n(2016)\n, King's College, London\n(2017)\n, and Stockholm University\n(2023)\n.\nFor the citation given for the honorary D.Sc. from the University of St Andrews, see\nTHIS LINK\n.\nSarnak was elected a member of the\nAmerican Academy of Arts & Sciences\nin\n1991\n; elected as member of the\nNational Academy of Sciences\nin\n2002\n; elected a fellow of the\nRoyal Society of London\nin\n2002\n; elected a member of the American Philosophical Society in\n2008\n; elected a member of the Academia Europaea in\n2013\n; became a fellow of the\nAmerican Mathematical Society\nin\n2018\n; and became an honorary member of the\nLondon Mathematical Society\nin\n2021\n.\nIt is not only in research that Sarnak has excelled, for he has also shown himself to be an outstanding lecturer for undergraduates. In\n2014\nhe received the Phi Beta Kappa Teaching Award from Princeton University\n[\n30\n]\n:-\n... this honour is awarded based on skill in instruction, commitment to working with and building relationships with undergraduates, and ability to spark students' interests. To this end, senior Daniel Kriz had this to say about Sarnak: \"Perhaps my favourite undergraduate maths class at Princeton was MAT\n415\nAnalytic Number Theory. …\n[\nProfessor Sarnak\n]\nalways paid careful attention to make sure the entire class was up to speed during lecture, and the assigned problem sets which he personally devised were not only illuminating and thought-provoking, but\n(\ndare I say\n)\nfun as well. Moreover, he was more than willing to go over material both after lecture and outside the classroom; I have not met another instructor so happy to meet outside of class, sit down and point to exactly where, how and why my proof was wrong.\"\nAs an advisor of graduate students, Sarnak has also received much praise. For example, Marybeth Perrin writes in\n[\n20\n]\n:-\nBy far my biggest mentor was Peter Sarnak, my advisor in graduate school. Grad school was\n(\nfor me and for many others\n)\na time of real struggle. Before that it was all \"learn this subject, do some problems sets, learn some more, you're doing great!\" but in Grad school there's a need to produce original work, which I had never done or even considered really until that point. Peter is extraordinarily supportive, enthusiastic, and energetic. Every time I met with him I left feeling like a million bucks. This is pretty rare in an advisor and I really needed it. On a more technical level a lot of my interests in mathematics were taken in one form or another from Peter. He was\n(\nand still is\n)\nvery good at picking problems for me to work on and the directions he pushed me in have proven fruitful.\nAnother of Sarnak's graduate students was Akshay Venkatesh who spoke about his advisor in\n[\n48\n]\n:-\nSarnak is a very positive person. You would go in to see him and, of course, you'd be depressed because you hadn't been able to do anything. But you'd come out of his office feeling cheerful. You'd come out feeling you're working on the right thing. I think that's actually very valuable - that he was able to kind of make you feel positive. He was able to motivate you. That was really valuable for me. For a graduate student it can be very difficult. It's very easy to get discouraged if you have no real understanding that you're going to be stuck for a very long time.\nNow let us look at Sarnak's books:\nSome applications of modular forms\n(1990)\n;\n(\nwith N M Katz\n)\nRandom matrices, Frobenius eigenvalues, and monodromy\n(1999)\n; and\n(\nwith G Davidoff and A Valette\n)\nElementary number theory, group theory, and Ramanujan graphs\n(2003)\n. Solomon Friedberg writes in a review of the first of these\n[\n9\n]\n:-\nThis book treats in detail a remarkable range of ideas and beautiful mathematics. It is highly recommended to everyone interested in modular forms.\nThe\n1999\nbook, co-authored with Nicholas M Katz, was reviewed by Philippe G Michel who writes\n[\n17\n]\n:-\nThis book is fascinating in many aspects: First, its rigorous, systematic and accessible exposition of the subject makes it a bright landmark at the crossroads of arithmetic and mathematical physics; no doubt it will become a basic reference in random matrix theory. Second, it offers its reader a bouquet of beautiful new results but also leaves the door open to many challenging conjectures.\nFinally, the\n2003\nbook is reviewed by Thomas R Shemanske who writes\n[\n43\n]\n:-\nIt would make a great text for an honours or senior seminar, showing how elegantly many different areas of mathematics come together to solve a very concrete problem of broad interest and application.\nFor more information about these three books, see\nTHIS LINK\n.\nIn\n2007\n, in addition to being Eugene Higgins Professor of Mathematics at Princeton, Sarnak was appointed to a professorship at the Institute for Advanced Study\n[\n16\n]\n:-\nLeading number theorist Peter Sarnak has joined the Faculty of the School of Mathematics at the Institute for Advanced Study. Sarnak, a Member at the Institute from\n1999\nto\n2002\nand from\n2005\nto\n2007\n, is the Eugene Higgins Professor of Mathematics at Princeton University. He will continue to hold his appointment at Princeton in conjunction with his professorship at the Institute. Peter Goddard, Director of the Institute, described Sarnak as a scholar who \"combines distinction as one of the world's leading number theorists with outstanding talents as a mentor of younger mathematicians. He inspires enormous enthusiasm for his subject and fosters interactions across disciplinary boundaries.\"\n...\nRegarding his appointment, Sarnak commented, \"I am delighted to join the Institute for Advanced Study and to participate in its primary mission of scholarship, research, and mentoring. To step into the unique intellectual environment that has defined the Institute since its beginnings is a challenge and an opportunity that I am grateful to embrace.\"\nIn\n2022\nSarnak was named Gopal Prasad Professor at the Institute for Advanced Study\n[\n37\n]\n:-\nThe Institute is proud to announce the creation of the Gopal Prasad Professorship in recognition of prolific mathematician and six-time Member of Institute for Advanced Study\n(\nIAS\n)\n, Gopal Prasad. The professorship, endowed with a gift from the Prasad family, ensures that future generations of scholars, from all regions of the world, have the opportunity to benefit from the unique environment of discovery at IAS. Peter Sarnak, current Professor in the School of Mathematics, has been selected as the inaugural Gopal Prasad Professor. The professorship is to be held by Faculty in the Schools of Mathematics and Natural Sciences.\nSarnak has given exceptional service to the mathematical community on numerous editorial boards including: the\nAmerican Mathematical Society\nColloquium Series; the International Mathematics Research Notices; Communications in Mathematical Physics; Forum Mathematics; Journal of Experimental Mathematics; Annals of Mathematics; Compositio Mathematics; Geometric & Functional Analysis; Duke Mathematics Journal; AIMS Library of Mathematical Sciences, Cambridge University Press; Cambridge Tracts in Mathematics; New Mathematical Monographs, Cambridge University Press; Cambridge Studies in Advanced Mathematics; and Notices of the\nAmerican Mathematical Society\n.",
  "matematicos_citados_na_biografia": [
    "E C Titchmarsh",
    "Gelfand",
    "Banach",
    "Paul Cohen",
    "Cohen",
    "Fields",
    "Zermelo",
    "Fraenkel",
    "Paul",
    "Selberg",
    "P Cohen",
    "Laplace",
    "Beltrami",
    "Courant",
    "THIS LINK",
    "H Fine",
    "Ramanujan",
    "Iwaniec",
    "Hecke",
    "Dirichlet",
    "Riemann",
    "George Pólya",
    "Hilbert",
    "Ostrowski",
    "Frank Nelson Cole",
    "Paul R Halmos",
    "Lester R Ford",
    "Royal Society of London",
    "Sylvester",
    "American Academy of Arts & Sciences",
    "National Academy of Sciences",
    "American Mathematical Society",
    "London Mathematical Society"
  ],
  "imagens": [
    "sarnak.jpg"
  ]
}