{
  "nome_completo": "Peter Ramus",
  "nome_curto": "Peter Ramus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramus/",
  "data_nascimento": "1515",
  "local_nascimento": "Cuts (near Noyon), Vermandois, France",
  "data_morte": "26 August 1572",
  "local_morte": "Paris, France",
  "summary": "Peter Ramus was a French mathematician who wrote a whole series of textbooks on logic and rhetoric, grammar, mathematics, astronomy and optics.",
  "biografia": "Peter Ramus\nis also known as\nPetrus Ramus\nand as\nPierre de la Ramée.\nThis latter name is the one he was given at birth.\nPeter Ramus's father Jacques de la Ramée was a labourer and his mother was Jeanne Charpentier. It might sound a little strange that Jacques de la Ramée was titled, yet worked as a labourer. This came about because the family had lost their money in\n1468\nwhen Liège was destroyed, yet they kept their title.\nRamus was educated at home until, in\n1527\nat the age of twelve years, he entered the Collège de Navarre in Paris. He graduated with a Master's Degree in\n1536\n, defending a thesis on\nAristotle\n. After this Ramus taught, first at the Collège de Mans, then at the Collège de l'Ave Maria. His teaching was aimed at attacking\nAristotle\nand in particular\nAristotle\n's logic. He published his views in three works including\nAristotelicae animadversiones\nin\n1543\n, and following this he was forbidden to teach or publish philosophy by Francis I.\nIt was mathematics and the plague which came to Ramus's rescue. Mathematics since when he was forbidden to teach and publish philosophy he turned to mathematics, and the plague for it created staff shortages which resulted in Ramus being reinstated as a teacher. In\n1547\nCardinal Charles de Lorraine appealed to Henry II to have the ban against Ramus lifted and indeed this happened. He was then appointed to the Collège de Presles, and he soon became head of the College. Not only was Ramus back as a teacher, but he also returned to publishing texts. Of course those opposed to his views still strongly attacked him and these attacks became even stronger after he was appointed as Regius Professor of Philosophy and Eloquence at the Collège de France in\n1551\n.\nIn\n1562\nRamus, whose teaching were becoming more involved with political and religious issues, abandoned the Catholic Church and became a convert to Calvinism. In this year he proposed major reforms in the teaching and structure of the University of Paris. Convinced that mathematics was a subject of fundamental importance to all of learning, he proposed a chair of mathematics at the University. Later he would endow this chair with his own money.\nOther changes which Ramus proposed was the abolition of student fees\n(\nwhich\n450\nyears later is again a topic of vigorous debate in Britain!\n)\n. He also proposed changes to the arts syllabus which included a large component of physics and other sciences. Political events were to intervene, however, as the French Wars of Religion began. The Duc de Guise, a Catholic supporter, with his armed forces took control of the royal family in Paris. There were uprisings by the Huguenots around France. Conspirators were ruthlessly dealt with by the Duc de Guise. Near the end of\n1562\n, Ramus was forced to flee Paris for fear of his life as the Calvinists were ordered out of the city. He went to Fontainebleau. The two sides in the War of Religion fought the Battle of Dreux in December\n1562\nand then looked for a peaceful settlement.\nDespite the assassination of the Duke de Guise by a Protestant fanatic, the Peace of Amboise was signed in March\n1563\n. It granted certain rights of conscience to the Huguenots and Ramus saw it as sufficient to allow him to return to Paris. For a while he tried to keep a low profile but when one of his opponents was appointed to the Regius Chair of Mathematics, Ramus opposed the appointment, but lost. With tensions rising again in the religious wars, Ramus fled Paris for a second time in\n1567\n.\nThe situation for the Calvinists deteriorated and a third religious war broke out in\n1568\n. Ramus returned briefly to Paris, found his library destroyed, and requested permission from the King to visit Germany. This Ramus did from\n1568\nto\n1570\n, but in that year another treaty, the Peace of Saint-Germain, was signed in August. Feeling that it was again safe to return to Paris, Ramus gained the promise of protection from the King although he was again banned from teaching. In\n1572\nthree thousand Huguenots assembled in Paris to celebrate the marriage of Marguerite de Valois to Henry III of Navarre. They were massacred on the eve of the feast St Bartholomew and, despite his royal protection, Ramus was murdered by hired assassins. As Mack writes in\n[\n6\n]\n:-\nThat he died a Protestant martyr had considerable consequences for his later reputation. His works were massively reprinted and became very influential in Protestant parts of Germany, in Britain and in New England well into the seventeenth century.\nThe changes which Ramus proposed to the Arts courses taught at universities at that time was a return to the seven classical liberal arts, but with the syllabus more based on applied topics. He developed \"method\" as a pedagogical concept taking theory towards that required for practical problems. In a text that he wrote in\n1546\nRamus describes his concept of methods as:-\n... the organisation of different things in such a way that the whole subject may be more easily perceived and taught.\nUsing this philosophy he proposed to reorganise the seven liberal arts using the following three \"laws of method\":-\n(\ni\n)\nonly things which are true and necessary may be included;\n(\nii\n)\nall and only things which belong to the art in question must be included;\n(\niii\n)\ngeneral things must be dealt with in a general way, particular things in a particular way.\nUsing this approach Ramus worked on many topics and wrote a whole series of textbooks on logic and rhetoric, grammar, mathematics, astronomy, and optics.\nIt is reasonable to ask how important Ramus is for mathematics. There do not seem to be any theorems named after him, and indeed he is not considered to have been an original mathematician discovering new facts. This does not prevent him from being important, however, and recent work has suggested that he had a more major influence on the development of mathematics than had been once thought. The book\n[\n4\n]\nis devoted to considering Ramus's contribution to mathematics.\nRamus believed that learning in mathematics had declined, and this was due in large part to\nPlato\nbecause of his refusal to consider applications of mathematics. Given these views it is not surprising that his\n1569\ntextbook on geometry contained strong criticisms of\nEuclid\n's\nElements\n.\nHaving identified the problems, Ramus aimed to improve mathematical instruction. In order to achieve this he planned to prepare editions of classical mathematical texts. He wrote textbooks on arithmetic, algebra and geometry with the aim of including only theorems which could be applied to the crafts. Rigorous proof was of little importance to Ramus who preferred a \"natural method\". It was not that he did not believe in theoretical mathematics, but he only saw that it was of importance when it was placed in conjunction with applications. He studied the methods of the tradesmen and craftsmen in Paris in order to choose the directly applicable material.\nOne of the topics which Ramus believed that mathematics should be applied to was astronomy. He seems to have been an early believer of the heliocentric theory of the solar system. He did not favour using theoretical hypotheses to decide between theories, but advocated basing theories on observational evidence.\nAs Mahoney writes in\n[\n1\n]\n:-\nBy emphasising the central importance of mathematics and by insisting on the application of scientific theory to practical problem solving, Ramus helped to formulate the quest for operational knowledge of nature that marks the Scientific Revolution.",
  "matematicos_citados_na_biografia": [
    "Aristotle",
    "Plato",
    "Euclid"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}