{
  "nome_completo": "Peter Stefan",
  "nome_curto": "Peter Stefan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stefan_Peter/",
  "data_nascimento": "27 March 1941",
  "local_nascimento": "Bratislava, Czechoslovakia (now Slovakia)",
  "data_morte": "18 June 1978",
  "local_morte": "Tryfan, Snowdonia, Wales",
  "summary": "Peter Stefan was a Slovak mathematician who was known for his works on dynamical systems and mathematical entropy.",
  "biografia": "Peter Stefan\nattended school in Bratislava and then attended the university in Prague obtaining his first degree in\n1965\n. Peter obtained a post on there and lectured for\n3\nyears.\nIn\n1968\nhe was invited to attend a conference on\nDynamical Systems\nat the University of Warwick. These major conferences at Warwick had many international visitors throughout an academic year with periods of higher activity. They have been important in the development of many mathematical topics.\nPeter had been involved in politics in Czechoslovakia, supporting the political movement which hoped to humanise Communist rule by introducing basic civil freedoms, an independent judiciary, and other democratic institutions. During Peter's visit to Warwick the Soviets invaded Czechoslovakia on the night of August\n20\n-\n21\n,\n1968\n, installing a Soviet controlled security service. Peter feared that he would be in danger if he returned, and since the reform programme had stopped, he preferred the freedom in Britain.\nStefan remained at the University of Warwick where he studied for a Ph.D. which was awarded in\n1973\n. His thesis was on\nAccessibility and singular foliations\nand is important in\ncontrol theory\nand in the mathematical theory of entropy.\nHowever Stefan did not remain at Warwick while working for his doctorate. He spent\n1969\n/\n70\nat Manchester returning for a year to Warwick before being appointed to a lectureship at the University College of North Wales at Bangor, a post he held until his death at the age of\n37\n. He spent one year in Paris during his tenure of the Bangor post, spending\n1976\n/\n77\nat the Institut des Hautes Études Scientifique.\nStefan had a love of freedom and he translated this into a love of climbing after his return from Paris. He was killed in a climbing accident in Snowdonia. He was climbing on his own at the time.\nIn\n[\n1\n]\nhis attitude towards mathematics is summed up as follows:-\nPeter had a strong sense of what was important in mathematics ... Given a first-rate mathematical idea, he made it part of himself. That often required an exhaustive search for the right perspective in mathematical development, in exposition, technical accuracy, and historical viewpoint. His fine taste and judgement shine throughout his work.",
  "matematicos_citados_na_biografia": [
    "Dynamical Systems",
    "control theory"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}