{
  "nome_completo": "Petr Sergeevich Novikov",
  "nome_curto": "Petr Sergeevich Novikov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Novikov/",
  "data_nascimento": "15 August 1901",
  "local_nascimento": "Moscow, Russia",
  "data_morte": "9 January 1975",
  "local_morte": "Moscow, Russia",
  "summary": "Petr Sergeevich Novikov is a Russian mathematician known for his work on combinatorial problems in group theory including the word problem for groups and the Burnside problem.",
  "biografia": "Petr Sergeevich Novikov\nwas the son of Sergei Novikov, a Moscow merchant, and Alexandra Novikov. He attended school in Moscow then, in September\n1919\n, he entered the Faculty of Physics and Mathematics at Moscow University. However, even before Novikov entered university, the Russian nation had been plunged into civil war. The Red Army had been formed in February\n1918\nwith Trotsky as its leader. The Red Army opposed the White Army formed of anticommunists led by former imperial officers. In the spring of\n1920\n, with the civil war still raging, Novikov joined the Red Army. He served with this army until July\n1922\nwhen he returned to Moscow University to complete his studies.\nHe graduated in\n1925\nthen, remaining at Moscow University, he undertook research under\nLuzin\n's supervision. Novikov graduated in\n1929\nand then taught at the Moscow Chemical Technology Institute until he joined the Department of Real Function Theory at the\nSteklov\nInstitute in\n1934\n. He was awarded his doctorate in\n1935\nand, in\n1939\n, he was promoted to full professor. Novikov married\nLyudmila Vsevolodovna Keldysh\nin\n1935\n. They had five children; one of their sons\nSergei Novikov\nwas awarded a\nFields Medal\nin\n1970\n.\nNovikov headed the Department of Analysis at Moscow State Teachers Training Institute from\n1944\n. In\n1957\nNovikov set up a new department at the\nSteklov\nInstitute, namely the Department of Mathematical Logic, and he was appointed as the first head of that department. He held the two posts, one at the Moscow State Teachers Training Institute and the other at the\nSteklov\nInstitute, until he retired in\n1972\nand\n1973\nrespectively.\nAfter early work on set theory, influenced by\nLuzin\nand his school, he began to publish results in mathematical physics from\n1938\n. Perhaps his most fundamental result in this area was that\n[\n1\n]\n:-\n... any two solids having the same constant density must coincide if they both are star-shaped relative to a common point and have the same external gravitational potential.\nHe began to study mathematical logic and the theory of algorithms just before\n1940\n. He studied consistency of arithmetic, proving that formal arithmetic with recursive definitions is consistent. He also examined the consistency of certain propositions in\nGödel\n's system of axiomatic set theory.\nNovikov showed, in\n1952\n, that the word problem for\ngroups\nis insoluble. The word problem asks the fundamental question of whether there is an algorithm to determine whether a word in a group given by a\npresentation\nconsisting of a finite number of generators and relations is trivial. The problem was first posed by\nDehn\nin\n1912\nand Novikov was able to show that no such algorithm exists in general. Research into questions of this type is still of major importance in combinatorial group theory. Novikov was awarded the Lenin Prize in\n1957\nfor this outstanding piece of work. In fact\nBoone\npublished another proof of this result in\n1957\n, the same year that Novikov received his prize.\nThe word problem was not the only problem of major importance in combinatorial group theory which Novikov solved. Jointly with\nAdian\nhe showed that the problem of the finiteness of periodic groups proposed by\nBurnside\nin\n1902\nhad a negative solution. Although in\n1959\nNovikov announced that for every\nn\n>\n71\nn > 71\nn\n>\n7\n1\nthere exists a finitely generated infinite group with every element of order dividing\nn\nn\nn\n, his proof was not quite correct.\nLet us state the problem more precisely. The\nBurnside problem\nasks whether, for fixed\nd\nd\nd\nand\nn\nn\nn\n, the group\nB\n(\nd\n,\nn\n)\nB(d, n)\nB\n(\nd\n,\nn\n)\nhaving\nd\nd\nd\ngenerators and in which every element\nx\nx\nx\nsatisfies\nx\nn\n=\n1\nx^{n} = 1\nx\nn\n=\n1\n, is finite. Novikov's argument of\n1959\nwas correct in general terms but the details were not, and in putting the arguments right it was found that one required larger values of\nn\nn\nn\n. In\n1968\nNovikov and\nAdian\njointly published a proof\nB\n(\nd\n,\nn\n)\nB(d, n)\nB\n(\nd\n,\nn\n)\nis infinite for every\nd\n>\n1\nd > 1\nd\n>\n1\nand every\nn\n>\n4380\nn > 4380\nn\n>\n4\n3\n8\n0\n. They continued to work on improving the result and, in\n1979\n, published a book\nThe Burnside problem and identities in groups\nin which they improved the result to\nn\n>\n664\nn > 664\nn\n>\n6\n6\n4\n.\nThere is still a large gap, however, between those values of\nn\nn\nn\nfor which\nB\n(\nd\n,\nn\n)\nB(d, n)\nB\n(\nd\n,\nn\n)\nis known to be finite and those for which it is known to be infinite. It is really easy to show the\nB\n(\nd\n,\n2\n)\nB(d, 2)\nB\n(\nd\n,\n2\n)\nis finite.\nBurnside\nhimself showed that\nB\n(\nd\n,\n3\n)\nB(d, 3)\nB\n(\nd\n,\n3\n)\nis finite, Sanov showed\nB\n(\nd\n,\n4\n)\nB(d, 4)\nB\n(\nd\n,\n4\n)\nis finite and\nMarshall Hall\nshowed\nB\n(\nd\n,\n6\n)\nB(d, 6)\nB\n(\nd\n,\n6\n)\nis finite. However, it is still an open question as to whether\nB\n(\n2\n,\n5\n)\nB(2, 5)\nB\n(\n2\n,\n5\n)\nis finite.",
  "matematicos_citados_na_biografia": [
    "Luzin",
    "Steklov",
    "Lyudmila Vsevolodovna Keldysh",
    "Sergei Novikov",
    "Fields Medal",
    "Gödel",
    "groups",
    "presentation",
    "Dehn",
    "Boone",
    "Adian",
    "Burnside",
    "Burnside problem",
    "Marshall Hall"
  ],
  "imagens": [
    "novikov.jpg"
  ]
}