{
  "nome_completo": "Philip Hall",
  "nome_curto": "Philip Hall",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hall/",
  "data_nascimento": "11 April 1904",
  "local_nascimento": "Hampstead, London, England",
  "data_morte": "30 December 1982",
  "local_morte": "Cambridge, England",
  "summary": "Philip Hall was the main impetus behind the British school of group theory and the growth of group theory to be one of the major mathematical topics of the 20 th Century was largely due to him.",
  "biografia": "Philip Hall\n's father was George Hall and his mother was Mary Laura Sayers. They were not married and George left without making any provision for Laura or their newly born son Philip. Laura called herself Mrs Hall and she brought Philip up in her parents home in Hampstead, London, until he was seven years old. At the time Philip was born Laura was employed as dressmaker as was her twin sister Lois, and also her two elder sisters, who were also twins, Ada and Ethel. In\n1909\n, while living in his grandfather Joseph Sayers' house, Philip entered New End Primary School.\nIn\n1910\nLaura, along with her three sisters, bought a house in Well Walk which they ran as a boarding house. Philip attended Sunday School and was baptised in\n1911\n. He excelled at his Primary School and in\n1915\nhe won a scholarship to Christ's Hospital West Horsham. This was a boarding school for children of ability whose parents were not able to afford the normal boarding school fees. Hall entered Christ's Hospital in May\n1915\nat age eleven. Although these were the years of World War I, Hall was too young to be affected by the war, other than serving in the Officer's Training Corps.\nIt was at Christ's Hospital that Hall came to love mathematics. He was fortunate to have teachers who were both accomplished mathematicians and also able to transmit their enjoyment of the subject. It was not only mathematics in which he excelled, winning the Gold Medal in his final year, but also in English winning a medal for the best English essay. Hall was House Captain in\n1921\n-\n22\n, his final year at Christ's Hospital, and his popularity says much about his character\n[\n4\n]\n:-\nHe was kind and helpful to the younger boys, who respected and admired him; this was remarkable in those days for he was neither an extroverted leader nor any kind of athlete. He played rugby for his House as a rather clumsy forward, but gave up cricket, being content for a number of years to be official scorer for the school First Eleven.\nHis fellow school pupils recollected that at school he was\n[\n4\n]\n:-\n... likeable and cheerful, with a sense of humour, gentle and reserved.\nHall went up to King's College Cambridge in October\n1922\nhaving won an Open Foundation Scholarship in December\n1921\n. He wrote in his first letter home\n(\nsee for example\n[\n4\n]\n)\n:-\nI am getting on beautifully and enjoying it very much; there are such opportunities of learning that it is about all you can do to make the most of them. ... I have made the acquaintance of Mr Littlewood and Mr Pollard, the two most progressive of the mathematicians here, so I am going on fairly well for a start.\nThe 'Mr Littlewood' that Hall referred to is\nDudley Littlewood\n. However, he fails to mention in this letter one other extremely promising mathematician in his year at Cambridge, namely\nWilliam Hodge\n. Among his teachers at Cambridge were\nHobson\n, the Sadleirian professor, and\nBaker\n, the Lowndean professor of Astronomy and Geometry.\nRichmond\nwas also on the staff when Hall arrived in Cambridge, but he retired in\n1923\n.\nHall's interest in\ngroup theory\ncame from\nBurnside\n's book which he was encouraged to read by Arthur Berry, the Assistant Tutor in Mathematics at King's College. Hall later wrote:-\nI began with Berry's encouragement to study the works of\nWilliam Burnside\n, especially his magnificent treatise on the \"Theory of Groups\" and some of his later papers.\nHall offered parts of that book for examination in the Tripos and gave a proof that no group of order\np\nn\n,\nn\n>\n1\np^{n}, n > 1\np\nn\n,\nn\n>\n1\n, can be simple. He graduated with a B.A. in\n1925\nand was elected to an Open Senior Foundation Scholarship which supported him for a further year at King's College. It was a year in which Hall wondered about his future, unsure whether to try for an academic career or not. He sat the Civil Service Examination in June\n1926\nwhich, if he had been successful, would have given him a fast route to the Administrative Grades. Fortunately for mathematics, and particularly group theory, he was not successful. He did spend some time on learning languages during this year; he spent the summer of\n1925\nin Italy learning Italian and studied German in London in March\n1926\n.\nIn October\n1926\nHall submitted an essay\nThe Isomorphisms of Abelian Groups\nas his attempt to gain a Fellowship. It shows many signs of having been written hurriedly, even to the extent that it ends in the middle of a proof! It is fairly clear that Hall only made the decision to try for an academic career after much thought and late on in terms of writing up his dissertation. Despite its deficiencies, it shows that already Hall was way ahead of his time in his approach to group theory and certainly nobody at Cambridge could have been in a position to properly evaluate the work. It considers subgroups of\nP\nG\nL\n(\n2\n,\nC\n)\nPGL(2,\\mathbb{C})\nP\nG\nL\n(\n2\n,\nC\n)\nand, among other results, proves that a group of order\np\nn\n,\nn\n>\n1\np^{n}, n > 1\np\nn\n,\nn\n>\n1\n, in which every characteristic abelian subgroup has order\np\np\np\n, is the central product of non-abelian groups of order\np\n3\np^{3}\np\n3\n.\nJohn Thompson\nwrites in\n[\n4\n]\nthat the dissertation:-\n... suffers from unwise use of the word 'obvious', a trait common to the young, but not always confined there. It is a trait which Hall did not retain.\nDespite having written the work hurriedly, his quality shone through and Hall was elected to a Fellowship at King's College in March\n1927\n. By that time he was already working as a research assistant to\nKarl Pearson\nin University College, London. He took up this post in January\n1927\nand his first published papers are on the theory of correlation. However, he found his main task of computing tables for the Incomplete Beta Function less than inspiring.\nHall wrote to\nBurnside\nin the summer of\n1927\nand, in\n1942\nhe described this:-\nI asked\nBurnside\n's advice on topics of group theory which would be worth investigation and received a postcard in reply containing valuable suggestions as to worth-while problems. ... shortly afterwards\nBurnside\ndied. I never met him, but he has been the greatest influence on my ways of thinking.\nReturning to Cambridge in September\n1927\nto take up the Fellowship at King's he made an important discovery in group theory, generalising the Sylow theorems for finite\nsoluble groups\nto prove what are now called Hall's theorems. These fundamentally important results were published in\nA note on soluble groups\nin the\nJournal of the London Mathematical Society\nin\n1928\n.\nThere is then a rather surprising gap in Hall's publication record. Here are his own words, written fifty years later:-\nMy Fellowship at King's had been renewed in\n1930\nbut, sometime in\n1931\nit was intimated to me that a second renewal would be unlikely unless I showed signs of mathematical life; before then I had only produced one short note in\n1928\n, so there was some justification in their warning and I obviously had to make a bit of an effort.\nHall certainly made 'a bit of an effort' for in\n1932\nhe wrote what is perhaps his most famous paper\nA contribution to the theory of groups of\nprime\npower order\n. It is a beautiful paper which is one of the fundamental sources of modern group theory. In it, in addition to its main aims of developing the theory of regular\np\np\np\n-groups, Hall introduces the commutator calculus, commutator collection, and the connection between\np\np\np\n-groups and\nLie\nrings. Not only did he get his Fellowship renewed but in\n1933\nhe was appointed as a Lecturer at Cambridge.\nIn June\n1939\nHall gave a series of lectures at a small meeting at the Mathematical Institute in Göttingen. Four of Hall's lectures were published as separate papers in\nCrelle\n's Journal. These papers are\nVerbal and marginal subgroups, The classification of prime-power groups, On groups of automorphisms\n, and\nThe construction of soluble groups\nall of which appear in volume\n182\npublished in\n1940\n. In\nThe classification of prime-power groups\nHall introduces an equivalence relation called isoclinism to aid the classification of prime power groups. This important concept continues to play a major role. We should note that Hall was criticised for going to Germany at this difficult time but defended his actions saying:-\n... the German mathematicians ...\n[\nare\n]\nas little responsible for the present situation\n(\nand probably enjoy it as little\n)\nas you or I do.\nDuring World War II he made an important contribution with his work at the Code and Cypher School at Bletchley Park where he began work in September\n1941\n. In particular he worked on Italian ciphers, then on Japanese ciphers learning about\n1500\nJapanese characters to help him in this task. During these war years he lived with his mother in Little Gaddesden where she had moved with her elder sister Ada at the beginning of the war in\n1939\nto be away from London. This meant that he had to travel about\n20\nmiles to Bletchley Park each day and he made the\n40\nmile round trip partly by train and partly by motorcycle.\nHall returned to King's College Cambridge in July\n1945\n. In\n1946\nhe wrote letters to the authorities supporting\nHasse\n's reinstatement, and also wrote encouraging letters to\nHasse\nwho had shown great kindness to Hall in\n1939\n. Hall was promoted to Reader at Cambridge in\n1949\n, then in\n1953\n, after\nMordell\nretired from the Sadleirian Chair, Hall was appointed to succeed him. In\n1955\nhe was one of the main speakers at the Edinburgh Mathematical Colloquium in St Andrews where he gave five lectures on\nSymmetric Functions in the Theory of Groups\n. His picture at this colloquium is one of those in theset above.\nBefore giving his lectures he wrote to\nEdge\nsaying:-\nThe subject I have in mind is symmetric functions, in relation to various branches of the theory of groups. I think I can find something to say on that which will not be too trite.\nIn particular he spoke about partitions and their connection to\nrepresentation theory\n:-\n... whenever in mathematics you meet with partitions, you have only to turn over the stone or lift up the bark, and you will, almost infallibly, find symmetric functions underneath. More precisely, if we have a class of mathematical objects which in a natural and significant way can be placed in one-to-one correspondence with the partitions, we must expect the internal structure of these objects and their relations to one another to involve sooner or later ... the algebra of symmetric functions.\nIn\n1956\nHall published, jointly with\nGraham Higman\n,\nOn the p-length of p-soluble groups and reduction theorems for Burnside's problem\n. This is a paper of major importance as was seen by\nBaer\nwhen he wrote a review saying that he could:-\n... do no more than just indicate the wealth of material contained in this investigation.\nThe paper has indeed proved highly influential and much of the rapid development of group theory in the\n1960\ns was built on this foundation. In August\n1957\nHall gave a series of lectures at the Canadian Mathematical Congress Summer Seminar in Edmonton, Canada, on\nnilpotent groups\nwhich have had great influence ever since.\nHis major contribution to infinite groups is seen in highly significant papers of\n1952\n,\n1959\nand\n1961\n. The ideas of these papers continue to be one of the main areas of group theory research. For example\nThe Frattini subgroups of finitely generated groups\nis the important paper on infinite groups which he published in\n1961\n. In it Hall considers many different classes of groups and investigates whether the\nFrattini\nsubgroup of groups in these classes needs to be nilpotent.\nIn\nOn non-strictly simple groups\npublished in\n1963\nHall established the existence of simple groups which were the infinite union of a chain of subgroups, each normal in the next. The paper, like so many of Hall's papers, introduces important ideas which are widely applicable. Karl Gruenberg explains some further features of this paper:-\nBesides containing a discussion of the possible order types of abelian series in simple groups, the paper also presents an extremely informative survey of the inter-relations that are known or conjectured to exist between the various classes of generalized soluble groups. This discussion is kept concise by the use of an elegant calculus of closure operations on group properties.\nHall received many honours for his work. He was elected to the\nRoyal Society\nin\n1942\n, then he was awarded its\nSylvester\nMedal in\n1961\n:-\n... in recognition of his distinguished researches in algebra.\nHall was a great supporter of the\nLondon Mathematical Society\n, and he was awarded its Senior Berwick Prize\n(1958)\nand the\nDe Morgan\nMedal and Larmor Prize in\n1965\n. He was elected President of the\nLondon Mathematical Society\nin\n1955\nand served the Society in this capacity until\n1957\n. He delivered his Presidential address on\n21\nof November\n1957\non\nSome word-problems\n. In this talk Hall spoke about word problems in general and specifically mentioned word problems for groups, semigroups, and cancellative semigroups. He introduced the idea of a normal form which he used in the solution of the word problem for\nLie\nrings and also for nilpotent groups. He ended his talk with these words:-\nProblems such as these still seem to present a formidable challenge to the ingenuity of algebraists. In spite of, or perhaps because of, their relatively concrete and particular character, they appear, to me at least, to offer an amiable alternative to the ever popular pursuit of abstractions.\nThe collected works of Philip Hall\n[\n2\n]\nwere published in\n1988\n. A McIver in a review wrote:-\nThis beautiful book consists of almost fifty years of publications by one of the greatest mathematicians of this century. ... Hall's elegant works\n(\nboth in content and exposition\n)\nare allowed to speak for themselves ... however, the tremendous impact which his research has had on algebra is discussed... . The reader glimpses a little of his character: his universal kindness and his invigorating enthusiasm both for mathematics and the world in general. ... Altogether we are presented with an all-around picture of a most remarkable mathematician.\nWe have made various comments about Hall's character in this article, but we should end by making a few more. He had a deep love of poetry which he recited beautifully in English, Italian or Japanese. He also loved music, art, flowers, and country walks. However, he was a rather shy man who avoided large gatherings and was only really happy in company when he was with one or two friends. When\nOlga Taussky-Todd\naccused him of being the worst recluse in Cambridge, Hall replied \"No,\nTuring\nis worse\"! He had an incredibly broad knowledge, not only of mathematics but, it seemed, on almost any subject\n[\n1\n]\n:-\nHall's range of knowledge was extraordinary, embracing anything from agriculture to poetry, ... combined with his complete integrity, high intellectual standards and sound judgement ...\nAlthough a man of a few words, his comments were always significant. His modesty was clear when you spoke to him or heard him lecture as I\n[\nEFR\n]\nhad the good fortune to do on several occasions. Roseblade, one of Hall's research students, writes in\n[\n4\n]\n:-\nHis students loved him and he them. Writing so lucidly and elegantly himself, he must have found painful much of what they first wrote; but whenever he had strong criticism to make of their work, he always found a way to soften the blow and never failed to suggest effective improvements. Nor did he abandon them when they had completed their dissertations; he wrote them helpful and stimulating letters, often very long and always by hand. ... He was a wonderful person; gentle, amused, kind, and the soul of integrity.",
  "matematicos_citados_na_biografia": [
    "Dudley Littlewood",
    "William Hodge",
    "Hobson",
    "Baker",
    "Richmond",
    "group theory",
    "Burnside",
    "William Burnside",
    "John Thompson",
    "Karl Pearson",
    "soluble groups",
    "prime",
    "Lie",
    "Crelle",
    "Hasse",
    "Mordell",
    "Edge",
    "representation theory",
    "Graham Higman",
    "Baer",
    "nilpotent groups",
    "Frattini",
    "Royal Society",
    "Sylvester",
    "London Mathematical Society",
    "De Morgan",
    "Olga Taussky-Todd",
    "Turing"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}