{
  "nome_completo": "Philippe de La Hire",
  "nome_curto": "Philippe de la Hire",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/La_Hire/",
  "data_nascimento": "18 March 1640",
  "local_nascimento": "Paris, France",
  "data_morte": "21 April 1718",
  "local_morte": "Paris, France",
  "summary": "Philippe de la Hire was a French mathematician who worked on conic sections and on geodesy and astronomy.",
  "biografia": "Philippe de la Hire\n's father was Laurent de La Hire\n(27\nFebruary\n1606\n-\n28\nDecember\n1656)\n. Laurent was born in Paris and became a painter of some distinction, getting commissions from the church, from politicians, and from wealthy Parisians who wished their portrait painted. He became a professor at the Academy of Painting and Sculpture. Philippe's mother was Marguerite Coquin\n(\ndied\n1669)\nand the de la Hire home was a stimulating place for children to grow up in, for Laurent and Marguerite entertained artists, scientists and mathematicians. The most notable mathematician who was frequently in their home was\nGirard Desargues\n. Philippe was the oldest of his parents five children having a younger brother Barthélemy and three younger sisters; Marie\n(\nwho was born between the two boys\n)\nand the two youngest members of the family Marguerite and Louise. The family had two homes in Paris, one in the rue Montmartre with four floors and a garden, and the other, a smaller dwelling, in the rue Gravilliers.\nLa Hire was educated as an artist and became skilled in drawing and painting. Although he received no formal education either in a school or in a university, nevertheless his father expected his son to follow his profession and trained him accordingly. La Hire was sixteen years old when his father died and at that time he was fully committed to a life as an artist. His health had been poor as he grew up so, three years after his father's death, he made plans to visit Italy. There were two reasons for the visit: he hoped that a stay in Italy would see his health improve, and also his father had given him a love of Italian art despite Laurent never having himself been to Italy. La Hire set off for Venice in\n1660\nand there spent four years developing his artistic skills and learning geometry. The interest in geometry arose from his study of perspective in art, but soon he was finding his mathematics classes more enjoyable than painting.\nReturning to Paris in\n1664\n, La Hire was a wealthy man and able to pursue his interests without the need to seek employment. Sturdy writes\n[\n8\n]\n:-\nAn intelligent young man from France who had spent the best part of four years\n[\nin Venice\n]\ncould not fail to return home a more mature, self-confident, sophisticated, and worldly-wise person than when he left.\nHe continued to paint but his serious studies were devoted to geometry. He had a friend, Abraham Bosse, with whom he could share both artistic and mathematical interests. Bosse was an artist who was much older than La Hire, but had attended classes on geometry by\nGirard Desargues\nfrom\n1641\n.\nDesargues\n, who La Hire had known from childhood, had died in\n1661\n. Bosse had published a series of works developing the geometric ideas that he had learnt from\nDesargues\nand had established his own school of art in\n1661\n. Much influenced by the work of\nDesargues\n, both directly and through his friendship with Bosse, La Hire worked on\nconic sections\nwhich he treated projectively. He published his first work\nObservations sur les Points d'Attouchement de Trois Lignes Droites qui touchent la Section d'un Cone\nⓉ\n(\nObservations on the touching points of three straight lines which touch the section of a cone\n)\nin\n1672\n, followed by his famous treatise\nNouvelle méthode en géometrie pour les sections des superficies coniques et cylindriques\nⓉ\n(\nNew methods in the geometry of conic sections and cylindrical surfaces\n)\nin\n1673\n. Taton\n[\n1\n]\nwrites that the\nNouvelle méthode\nⓉ\n(\nNew methods in the geometry of conic sections and cylindrical surfaces\n)\n:-\n... is a comprehensive study of conic sections by means of the\nprojective\napproach, based on a homology which permits the deduction of the conic sections under examination from a particular circle. This treatise was completed shortly afterwards by a supplement entitled 'Les planiconiques' which presented this method in a more direct fashion. The 'Nouvelle méthode' clearly displayed\nDesargues\n' influence, even though La Hire, in a note written in\n1679\n..., affirmed that he did not become aware of the latter's work until after publication of his own. Yet what we know about La Hire's training seems to contradict this assertion. Furthermore, the resemblance of their projective descriptions is too obvious for La Hire's not to appear to have been an adaption of\nDesargues\n'. Nevertheless, La Hire's presentation, which was in classical language and in terms of both space and the plane, was much simpler and clearer. Thus La Hire deserves to be considered, after\nPascal\n, a direct disciple of\nDesargues\nin projective geometry.\nThis assessment may be a little harsh on La Hire who was an extremely honest and meticulous person. It is possible that he knowledge these ideas of\nDesargues\ncame through Bosse rather than directly from\nDesargues\n, so his statement that he did not know of\nDesargues\n' publications until after his own had been published could still be true. But we should understand a little more about the contents of the\nNouvelle méthode\nⓉ\n(\nNew methods in the geometry of conic sections and cylindrical surfaces\n)\n[\n1\n]\n:-\nLa Hire provided an exposition of the properties of conic sections. He began with their focal definitions and applied Cartesian analytic geometry t the study of equations and the solution of indeterminate problems; he also displayed the Cartesian method for solving certain types of equations by intersections of curves. Although not a work of great originality, it summarises the progress achieved in analytical geometry during half a century and contained some interesting ideas, among them the possible extension of space to more than three dimensions.\nLa Hire's mother died in\n1669\nand the two Paris homes were left jointly to the five children. La Hire bought out the shares of his brother and three sisters shortly after his mother's death. He married Cathérine le Sage in\n1670\nand they took up residence in their home in rue Montmartre. Their second home in rue Gravilliers was let out to rent. Philippe and Cathérine La Hire had four children; Cathérine-Geneviève\n(\nborn\n1671)\n, Marie-Ann\n(\nborn\n1673)\n, Gabriel-Philippe\n(\nborn\n1677)\nand Anne-Julie\n(\nborn\n1680)\n.\nOn\n26\nJanuary\n1678\nLa Hire was elected to the\nAcadémie des Sciences\n. Rather surprisingly, his election was to the astronomy section. He had, at that time, made no contributions to astronomy but\nFontenelle\n[\n3\n]\nsuggests that his election was on the strength of his excellent publications in geometry. Of course, often someone deserving of admission to the\nAcademy\nwould enter the section in which a vacancy occurred rather than be forced to wait, perhaps for many years, for a vacancy in a more appropriate section. Election to the\nAcademy\nwas a great honour for La Hire, but it also meant a change in life style. The\nAcademy\nwas a working organisation so election meant that be was no longer a man of leisure. Jean-Baptiste Colbert, the French Minister of Finance, had been instrumental in founding the\nAcademy\nin\n1666\nand he now assigned La Hire to assist\nJean Picard\nin the surveying work he was undertaking with the ultimate aim of producing more accurate maps of France. Together La Hire and\nPicard\nundertook surveying work in Brittany in\n1679\nand in Guyenne in\n1880\n. La Hire then went, without\nPicard\n, to survey around Calais and Dunkirk in\n1681\nand the coast of Provence in\n1682\n. We note that La Hire's maps of the Earth were made with the centre of projection, not at the pole, but at\nr\n/\n√\n2\nr/√2\nr\n/\n√\n2\nalong a radius produced through the pole\n(\nwhere\nr\nr\nr\nis the radius of the Earth\n)\n.\nOn\n1\nApril\n1681\nLa Hire's wife Cathérine died. He had little option than to remarry quickly, having four children the youngest being just over one year old. He married Cathérine Nonnet, the daughter of notary Jean Nonnet and his wife Marie, on\n18\nSeptember\n1681\n. By this time La Hire's work for the\nAcademy\nwas closely linked to the Paris Observatory which, like the\nAcademy\n, had been founded largely due to Colbert. The director was Giovanni Cassini, and the Observatory had published the\nConnaissance des temps\nⓉ\n(\nUnderstanding time\n)\nin\n1679\nwhich was the world's first nautical almanac. La Hire chose to live with his new wife at the Observatory rather than in his house on rue Montmartre. Sturdy writes\n[\n8\n]\n:-\nWhatever the prestige attached to residence in the Observatory, from a domestic point of view it had many drawbacks. The accommodation was extremely cramped. The La Hires had only two bedrooms, a room where Philippe worked, a kitchen and the use of a cellar. Not only were there the children of Philippe's first marriage to be catered for: four more children were born to Philippe and Cathérine. The La Hire family by the late\n1680\ns and early\n1690\ns numbered ten and must have felt intense pressure from overcrowding ...\nTo some extent the overcrowding was eased by the fact that, at least in the early years of their marriage, La Hire was often absent undertaking work for the\nAcademy\n. He continued the surveying work for the French atlas, but after the death of Colbert in\n1683\n, he was directed by his successor François Michel le Tellier, Marquis de Louvois. The Royal Court had moved into the Palace of Versailles in\n1682\nand La Hire was given surveying projects relating to the supply of water to the new Palace. The following quote from\nFontenelle\n[\n3\n]\ntells us a lot about La Hire's character:-\nLa Hire, scrupulously exact almost to the point of superstition, used to present to M de Louvois lists of expenses drawn up day by day, in which even fractions were not neglected. The minister habitually used to tear them up without looking at them, and have the sums sent in rounded up figures.\nIn December\n1682\nhe was appointed to the chair of mathematics at the Collège Royale which had remained vacant following the death of\nGilles Roberval\nin October\n1675\n. Courses he lectured included astronomy, mechanics, hydrostatics, dioptrics, and navigation. Four years after being named professor, he was appointed, in addition, to the chair of architecture at the Académie Royale d'Architecture\n[\n8\n]\n:-\nLa Hire took his duties in the Collège Royale and Académie d'Architecture seriously, preparing his courses conscientiously and lecturing as regularly as possible. If his other commitments stood in his way, his eldest son, Gabriel-Philippe, lectured on his behalf.\nIn fact, in exactly the same way as La Hire's own father had trained him to follow in his profession as an artist, La Hire had trained his own eldest son to follow his own career. La Hire's aim was to have his son elected to the\nAcademy\nand indeed Gabriel-Philippe La Hire assisted his father in a while range of scientific activities and was elected an 'élève' of the\nAcademy\nin\n1694\nat the age of seventeen; in so doing he became the youngest member of the\nAcademy\nin the seventeenth century.\nDespite his interests across a whole range of scientific disciplines, La Hire remained fascinated by geometry. In\n1685\nhe published a comprehensive work on conic sections\nSectiones conicae\nⓉ\n(\nConic sections\n)\nwhich contained a description of\nDesargues\n' projective geometry. In\n1708\nhe calculated the length of the cardioid. He also wrote memoirs on the cycloid, the epicycloid, the conchoid and quatratures. However he had other mathematical interests and also wrote on\nmagic squares\n. He published\nTraité de méchanique\nⓉ\n(\nTreatise on mechanics\n)\nin\n1695\n. Taton writes\n[\n1\n]\n:-\nAlthough passed over by the majority of the historians of mechanics, this work marks a significant step towards the elaboration of a modern manual of practical mechanics, suitable for engineers of various disciplines.\nOther topics to which he made important contributions included astronomy, physics and geodesy. In astronomy he installed the first\ntransit\ninstrument in the Paris Observatory. He also produced tables giving the movements of the Sun, Moon and the planets which he published in\n1687\n, publishing further such tables in\n1702\n.\nLa Hire became involved in experimental work in many different scientific areas. For example he did experiments on falling bodies\n(\nfor example with Mariotte in\n1683)\n, on magnetism, on the heat reflected by the moon, on the transmission of sound, on the physical properties of water, on electrostatics, on respiration, and on physiological optics. He also studied the instruments involved in experimental work. For example for surveying, which one of his major tasks, he designed an instrument to find the level at a site and studied instruments to compute slopes and elevations. He also studied instruments to measure climatic conditions such as temperature, pressure and wind speed, making measurements with such instruments at the Paris Observatory. Other experiments involved accurate time keeping so he studied clocks as well as magnets and electrostatic machines used in other experimental work.\nWe should also mention La Hire's contributions in editing the works of\nJean Picard\n, Edme Mariotte,\nGilles Roberval\n, and\nFrenicle de Bessy\n.\nFinally we quote Taton's evaluation of La Hire's contributions\n[\n1\n]\n:-\nIt is difficult to make an overall judgement on a body of work as varied as La Hire's. A precise and regular observer, he contributed to the smooth running of the Paris Observatory and to the success of the different geodesic undertakings. Yet he was not responsible for any important innovation. His diverse observations in physics, meteorology, and the natural sciences simply attest to the high level of his intellectual curiosity. Although his rejection of the infinitesimal calculus may have rendered a part of his mathematical work sterile, his early works in projective, analytic, and applied geometry place him among the best of the followers of\nDesargues\nand\nDescartes\n. Finally, his diverse knowledge and artistic, technical, and scientific experience were factors in the growth of technological thought, the advances of practical mechanics, and the perfecting of graphic techniques.",
  "matematicos_citados_na_biografia": [
    "Girard Desargues",
    "Desargues",
    "conic sections",
    "projective",
    "Pascal",
    "Académie des Sciences",
    "Fontenelle",
    "Academy",
    "Jean Picard",
    "Picard",
    "Gilles Roberval",
    "magic squares",
    "transit",
    "Frenicle de Bessy",
    "Descartes"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}