{
  "nome_completo": "Philip Kumar Maini",
  "nome_curto": "Philip Maini",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Maini/",
  "data_nascimento": "16 October 1959",
  "local_nascimento": "Magherafelt, County Londonderry, Northern Ireland",
  "data_morte": null,
  "local_morte": null,
  "summary": "Philip Maini is an Irish mathematical biologist who works in modelling processes in biology and medicine.",
  "biografia": "Philip Maini\nis the son of Panna Lal Maini and Satya Wati Bhandari. Panna Lal and Satya Wati were from the Punjab in North West India. Panna Lal had travelled to Northern Ireland in\n1954\n. He had sailed to London on the ship\nMaloja\nof the Peninsula and Orient Steam Navigation Company arriving there on\n18\nFebruary\n1954\n. Satya Wati and Philip's elder brother Arvind did not arrive in Northern Ireland until\n1957\n.\nMaini attended the Rainey Endowed School, known colloquially as \"The Rainey\", a grammar school in the town of his birth, Magherafelt, which had been founded in\n1707\n. He attended the Kindergarten from\n1969\nto\n1971\n, moving up to the Grammar School which he attended from\n1971\nto\n1978\n. He wrote\n[\n2\n]\n:-\nIn\n1979\nI went up to Balliol College, Oxford, to read Mathematics. To say I was terrified would be an understatement. How would I cope with this new life? I had not quite appreciated just how well the Rainey had prepared me and that the excellent mathematical training I had received from Mr Frew, Mr Irvine, and the legendary Doc Gwilliam, would prove invaluable for dealing with the rigours of the Mathematics degree.\n'Doc Gwilliam' is Alfred E Gwilliam who had joined the Rainey in around\n1944\nand was the Head of Mathematics when Maini began his studies. 'Mr Frew' is Jackson Frew who was appointed as an assistant teacher in Mathematics and Physics at the Rainey in\n1969\nand in\n1973\nhe became Head of Mathematics. Writing of his time at school, Maini confessed\n[\n3\n]\n:-\nMy true passion is football and I really wanted to be a professional footballer. At school I would look out the window during class, dreaming of scoring the winning goal in the FA Cup final. Of course I realised I was nowhere near good enough. Now, when kicking a football about, I dream of solving maths problems instead! I first saw the power and beauty of mathematics when, in the first year of A levels, my teacher wrote down the equation for simple harmonic motion for a swinging pendulum and I saw how this simple equation could describe everything about the motion of the pendulum. I was hooked.\nLet us note at this point that Maini's brother Arvind studied at the Rainey Endowed School from\n1964\nto\n1971\n, then trained in medicine and became a GP in Belfast.\nAfter graduating from the Rainey, Maini studied mathematics at Balliol College, Oxford and was awarded a B.A. with Honours in Mathematics in\n1982\n. He then undertook research at Oxford for his D.Phil. advised by\nJames Murray\nwho was a Reader in Mathematics from\n1972\nto\n1986\n, and Professor of Mathematical Biology from\n1986\n.\nMurray\nwas Director of the Centre for Mathematical Biology at Oxford from\n1983\n. Maini wrote\n[\n2\n]\n:-\nI enjoyed by\n[\nfirst\n]\ndegree so much that I stayed on to do a doctorate in Mathematical Biology. During that time I spent six months in the mountains of New Mexico at the Los Alamos National Laboratory, a fascinating place full of recent history - it was where The Bomb was developed during the Second World War. I then spent three months teaching at the University of Utah, Salt Lake City, in the foothills of the Wasatch Mountains. It took a while to get used to the idea that if I looked over my shoulder I would see, a few hundred metres away, these spectacular mountains rising thousands of feet into the air. The Sperrins had not quite prepared me for that!\nMaini attended the conference 'Ordinary and partial differential equations', held in Dundee, Scotland in\n1984\n. A paper written jointly with his thesis advisor and with\nGeorge F Oster\n,\nA mechanical model for biological pattern formation: a nonlinear bifurcation analysis\n, was published in the Proceedings of the conference.\nGeorge Oster\nwas awarded a Ph.D. in nuclear engineering from Columbia University in\n1961\nand was appointed to the University of California at Berkeley. His interests turned towards mathematical biology and he became Professor of Cell and Developmental Biology. Maini also attended the conference 'Nonlinear oscillations in biology and chemistry' held in Salt Lake City, Utah, in\n1985\n. The same three authors presented the paper\nAn analysis of one- and two-dimensional patterns in a mechanical model for morphogenesis\nwhich was published in the proceedings of the conference.\nFor details of a few of the papers Maini published at the beginning of his career, see\nTHIS LINK\n.\nIn\n1985\nMaini was awarded a D.Phil. by the University of Oxford for his thesis\nOn mechano-chemical models for morphogenetic pattern formation\n.\nAfter he had completed his D.Phil., Maini was appointed as a Research assistant at the Centre for Mathematical Biology in Oxford in\n1985\n. Unsure what he wanted for his future career, however, he decided to spend the year\n1986\n-\n87\nas a school teacher while he made up his mind. He was appointed as an Assistant Master to teach at Eton College, an independent boarding school situated in Berkshire near Heathrow airport and the town of Windsor. Founded in\n1440\n, Eton has through its long history, been a leading English boarding school. In\n[\n2\n]\nMaini describes his first day as a mathematics teacher at Eton:-\nAs I walked to my class the boys, an 'O' level class, were lined up waiting for me to enter. I noticed two things - they were mostly much taller than me and they all sounded so posh. I seriously considered turning and running away but then I hit on a plan. I walked in quietly and waited for them to settle. They turned and looked in expectation at the silent figure in front of them. I guess that the very last thing they expected to hear come out of a brown face was a broad Maghera accent. They were stunned. I immediately had the upper hand and I realised just how important the first few moments of the teacher-student interaction are in shaping the course of the longer term relationship. My one year there was probably the happiest of my professional career. There was a great camaraderie amongst the teachers and the boys responded very positively to a teacher who was from a different mould.\nAfter the year teaching mathematics at Eton College, Maini returned to Oxford in\n1987\nwhere he was appointed as a Junior Research Fellow at Wolfson College. After spending one year in this position, Maini returned to Salt Lake City in\n1988\nwhen he was appointed as an Assistant Professor in the Department of Mathematics of the University of Utah. He was two years in Salt Lake City in this position before returning to the University of Oxford in\n1990\nwhere he became a Tutorial Fellow at Brasenose College and also a lecturer in Mathematical Biology at the Mathematical Institute in Oxford. He began supervising D.Phil. students from the beginning of his time in Oxford and his first student, Jonathan Sherratt, graduated with his doctorate in\n1991\n. His thesis was entitled\nMathematical models of wound healing\n. In fact Maini advised a large number of doctoral students and within ten years of Sherratt obtaining his D.Phil., at least fifteen further students advised by Maini had been awarded doctorates.\nIn\n1997\nthe paper\nMathematical modeling of corneal epithelial wound healing\nby Maini, written in collaboration with Paul D Dale and Jonathan A Sherratt, was awarded the Bellman Prize.  This prize, established in\n1985\n, was in honour and memory of Richard Bellman, a pioneer in biomathematics and the founder of the journal\nMathematical Biosciences\n, the journal in which the prize-winning paper was published. Here is the Abstract of the paper\n[\n1\n]\n:-\nWe propose a reaction-diffusion model of the mechanisms involved in the healing of corneal surface wounds. The model focuses on the stimulus for increased mitotic and migratory activity, specifically the role of epidermal growth factor. Analysis of the model equations elucidates the interaction and roles of the model parameters in determining the speed of healing and the shape of the traveling wave solutions which correspond to the migration of cells into the wound during the initial phase of healing. We determine an analytic approximation for the speed of traveling wave solutions of the model in terms of the parameters and verify the results numerically. By comparing the predicted speed with experimentally measured healing rates, we conclude that serum-derived factors can alone account for the overall features of the healing process, but that the supply of growth factors by the tear film in the absence of serum-derived factors is not sufficient to give the observed healing rate. Numerical solutions of the model equations also confirm the importance of both migration and mitosis for effective would healing. By modifying the model we obtain an analytic prediction for the healing rate of corneal surface wounds when epidermal growth factor is applied topically to the wound.\nIn\n1998\nMaini was appointed as Director of the Wolfson Centre for Mathematical Biology at Oxford\n(\npreviously called the Centre for Mathematical Biology\n)\nand, in the same year, Titular Professor of Mathematical Biology at the Mathematical Institute of the University of Oxford. In\n2005\nhe became Professor of Mathematical Biology at the Mathematical Institute and a Professorial Fellow of St John's College, Oxford.\nIn\n[\n3\n]\nMaini describes his research:-\nMy work is mainly at the cell and tissue level. In biology, we know a lot about how cells behave on their own and we know how a collection of cells\n(\na tissue\n)\nbehaves. However, we do not know what happens in between - how do the cells communicate with each other to coordinate their behaviour? For example, how do cells organise themselves to form the stripes you see on a zebra, the structure of the bones in your arm, the pattern of feathers in a chick? When you cut yourself, how do the cells know that they should close the wound and how do they know when the wound has healed? In all these cases, the key cell properties are proliferation and movement and these are very carefully controlled by the body. If they go out of control, then diseases such as cancer result. I work with biologists and clinicians in understanding the basic biology underpinning problems like these and work with them to develop better disease therapies. To do that, I use mathematical modelling - I write down mathematical equations to describe what the biologists think is happening. I then solve these using computers to see if the model behaves the way the biology does. The exciting part is when it does not - that means that the biologists are missing something with their explanations. Working with the biologists, I then put new biological theories to the test mathematically and together we keep trying until we can get something to work - that is how new biology is discovered using mathematics.\nMost of Maini's papers are written as multi-author works with two, three or four authors. In\n[\n2\n]\nhe spoke about the fact that much of his work involved collaborations with scientists working in a variety of different areas\n[\n2\n]\n:-\nDuring a typical day I do not spend more than about one hour at a time on any one particular thing so there is no time to get bored. I find the variety very stimulating, but the mental gymnastics can be exhausting. I work with biochemists, biologists, clinicians, engineers, plant scientists and zoologists. I find learning new science exciting and using mathematics to gain insight is very satisfying. Like a marriage, a collaboration has more chance of working if the individuals involved actually like each other, so I am careful in choosing with whom I work and we have lots of laughs. An added bonus is if the collaborator is from some exotic faraway place. As a result, I end up travelling a lot with work - six to twelve times a year - and have been very lucky to see a lot of the world and make friends from many different cultures.\nIn\n2015\nMaini was elected to the\nRoyal Society of London\n. The citation for his election reads:-\nPhilip Maini's mathematical and computational modelling of spatiotemporal processes in biology and medicine has led to significant scientific advances in both. His work on biological pattern formation has led to detailed understanding of the roles of noise, domain growth and gradients in pattern generation. He has generalised the concept of gradient information and has proposed an experimentally consistent resolution of the chemotactic wave paradox. He has developed multiscale models for wound healing and for vascular tumour growth. He has thereby elucidated the underlying mechanisms by which particular growth factors reduce scar formation and has provided detailed insight into the design of combination cancer therapy.\nThis was one of many honours given to Maini and we list here only a few of these. He was awarded a Leverhulme Trust Senior Research Fellowship by the\nRoyal Society\nfor\n2001\n-\n2002\n. The\nRoyal Society\nalso awarded him a Wolfson Research Merit Award\n(2006\n-\n2011)\n. The\nLondon Mathematical Society\nawarded him their Naylor Prize and Lectureship in Applied Mathematics in\n2009\n. He was a Distinguished Research Fellow of the African Institute of Mathematical Sciences in\n2010\n-\n2013\n. In\n2003\nthe\nInstitute of Mathematics and its Applications\nelected him a fellow. He was elected a Corresponding Member of the\nMexican Academy of Sciences\nin\n2011\n. The\nSociety for Industrial and Applied Mathematics\nelected him a fellow in\n2012\n. He was awarded the Arthur T Winfree Prize from the Society for Mathematical Biology in\n2017\n. The citation for this award states that Maini's work:-\n... has led to scientific advances not only in mathematics, but also in biology and the biomedical sciences. His mathematical oncology research has provided detailed insight into the design of combination cancer therapies.\nAlso in\n2017\n, Maini was elected to the Academy of Medical Sciences.\nLet us end with the comment that Maini lists football, travel and volunteer dog-walking as his recreations.",
  "matematicos_citados_na_biografia": [
    "James Murray",
    "Murray",
    "George F Oster",
    "George Oster",
    "THIS LINK",
    "Royal Society of London",
    "Royal Society",
    "London Mathematical Society",
    "Institute of Mathematics and its Applications",
    "Mexican Academy of Sciences",
    "Society for Industrial and Applied Mathematics"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}