{
  "nome_completo": "Phyllis Nicolson",
  "nome_curto": "Phyllis Nicolson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nicolson/",
  "data_nascimento": "21 September 1917",
  "local_nascimento": "Macclesfield, England",
  "data_morte": "6 October 1968",
  "local_morte": "Sheffield, England",
  "summary": "Phyllis Nicolson was an English mathematician best known for her work in numerical analysis.",
  "biografia": "Phyllis Nicolson\nwas\nPhyllis Lockett\nuntil her marriage. Her parents were Arthur Lockett\n(1876\n-\n1957)\n, who was a stone mason, and Susan Davey\n(1878\n-\n1936)\n. They were married in\n1901\nin Macclesfield, Cheshire, England. Phillis had older brothers Arthur Lockett\n(1906\n-\n1919)\n, Donald Lockett\n(1909\n-\n1991)\nand James Lockett\n(1912\n-\n1991)\nand a younger brother. At the time of the\n1910\ncensus, Arthur Lockett's occupation is recorded as stone mason working in a cotton mill. The census records them as having children Arthur and Donald, but they have had two other children who have died before\n1910\n.\nPhyllis\nwas educated at Stockport High School for Girls which was built in\n1910\nin the Cale Green district of Stockport, close to Davenport railway station. After graduating from the school she entered Manchester University and graduated with the degrees of B.Sc.\n(1938)\nand M.Sc.\n(1939)\n. She then began undertaking research at Manchester with the aim of writing a Ph.D. thesis. Her thesis advisor was Lajos Jánossy\n(1912\n-\n1978)\n, a Hungarian physicist and mathematician who had studied in Vienna and Berlin before being appointed as an astrophysicist in Berlin in\n1934\n. In\n1936\nhe had to flee from the Nazis and came to London where he worked on cosmic radiation at Birkbeck College. In\n1939\nhe moved to the University of Manchester and began advising Phyllis Lockett. She writes in\n[\n12\n]\n:-\nIn\n1939\ncosmic ray work was started under the direction of Dr L Jánossy and would normally have formed the basis of a Ph.D. thesis presented in\n1941\n. In\n1940\n, however, this work was interrupted by the war and the writer joined a Ministry of Supply group under the direction of Professor\nD R Hartree\nF.R.S.\nThe work undertaken in\n1939\n-\n40\nformed the first of three sections in her thesis and also was published in a joint paper with Jánossy, namely\nThe Sun's Magnetic Field and the Diurnal and Seasonal Variations in Cosmic Ray Intensity\nwhich appeared in the\nProceedings\nof the\nRoyal Society of London\nin\n1941\n. It has the following abstract:-\nThe diurnal and seasonal variations in the vertical cosmic ray intensity, produced by a solar magnetic dipole field, are calculated at latitudes\n0\nand\n45\n°, and compared with 'observed' data. It appears that the diurnal variation at latitude\n45\n° can be largely accounted for by assuming the existence of a solar dipole of moment\n1.1\n×\n1\n0\n34\n1.1  \\times  10^{34}\n1\n.\n1\n×\n1\n0\n3\n4\ngauss cm\n3\n^{3}\n3\n, a value which is consistent with observational evidence. The diurnal variation at the equator, however, cannot be explained by the hypothesis of a solar magnetic dipole field. The seasonal variation in intensity inferred by the above value for the solar dipole moment is of the same order of magnitude as the observational variation, but shows a phase discrepancy of two months.\nDuring the period\n1940\n-\n45\nshe was a member of a research group in Manchester University directed by\nDouglas Hartree\n, working on wartime problems for the Ministry of Supply, one being concerned with magnetron theory and performance. In\n1942\nshe married Malcolm Macleod Nicolson\n(6\nJuly\n1919\n, Portree, Isle of Skye, Scotland -\n21\nDecember\n1951\n, Leeds, England\n)\nin Manchester. Malcolm was the son of Angus Nicolson and Isabella McDougall. Angus Nicolson worked for McAlpines mostly in Manchester. He died in\n1935\nfollowing an accident on a building site. Malcolm Nicolson was a graduate of Manchester University, and was doing war service in the Royal Navy at the time of his marriage.\nAt Manchester\nHartree\nhad been responsible for the operation of the differential analyser but in\n1940\n, when he had to undertake war work, the responsibility fell to two of his graduate students John Ingham and Malcolm Nicolson, Phyllis's future husband. In the latter part of\n1940\n, Malcolm Nicolson was called up for war service. At this time Nicholas Eyres and Phyllis Lockett joined John Ingham in operating the Manchester differential analyser\n[\n15\n]\n(\nsee also\n[\n7\n]\n)\n:-\n[\nThe differential analyser\n]\nhad by this time come to be understood more as a useful modelling tool that could quickly produce indicative results and save staff- hours. This usefulness increased the variety of equations and problems that the team received before\nHartree\n's promotion to the Headquarters staff of the Department of Scientific Research in\n1941\n. This promotion meant that he could once again assist with the work of the Manchester machine team, who had been tasked with resolving calculations that helped to model the variable heat flow in the processes concerned with the manufacture of steel. Ingham left the team in late\n1941\n, leading\nHartree\nto ask his former student Jack Howlett to join in his place. The analyser team was strengthened further in\n1942\nwith the addition of Jack Michel, who along with Howlett, Eyres, and Nicolson remained until the end of the war.\nHartree\nstressed in\n[\n9\n]\nthe need for a team of four to operate the differential analyser:-\nA group of four is necessary in order to have enough manpower to use the machine effectively on many problems to which it may be applied, though some of the simpler problems can be handled by a smaller number.\nPhyllis Nicolson published joint papers with\nHartree\n, Howlett, Eyres:\nEvaluation of the Solution of the Wave Equation for a Stratified Medium\nappeared as Air Defense Research & Development Establishment, Memorandum\n47\n, May\n1944\n; and\nEvaluation of the Solution of the Wave Equation for a Stratified Medium: Normalisation\nappeared as Radar Research and Development Establishment Report No.\n279\n, March\n1945\n.\nHartree\nwrites in\n[\n9\n]\nthat he asked Phyllis Nicolson to develop the radar magnetron electronics and radio propagation. She used the differential analyser to calculate the orbits of electrons in an oscillating magnetron\n[\n15\n]\n:-\nTowards the end of the war, Phyllis Nicolson led the group's work in resolving the problems of radio propagation, basing her work on\nHartree\n's publications from\n1923\nto\n1931\non the Appleton-\nHartree\nequation. Her approach undertook a ray treatment that was similar to\nHartree\n's prior work on wave propagation in a stratified medium. She used the Manchester machine to test the relationship between the propagation of radio waves and meteorological conditions. Her work on radio propagation would later feed into the development of GEE, a hyperbolic navigation system that measured the time delay between different radio signals to provide a location for an aircraft flying overhead. This is more commonly understood today as radar technology.\nAfter World War II ended in\n1945\n, Malcolm Nicolson began working for a Ph.D. at the Cavendish Laboratory at the University of Cambridge and Phyllis Nicolson became a member of Girton College, Cambridge, undertaking research at the Cavendish Laboratory. Phyllis Nicolson was awarded a Ph.D. in\n1946\nby the University of Manchester for her thesis\nThree Problems in Theoretical Physics.\nThe three problems are studied in three separate parts of the thesis: Part I. Meson Formation and the East-West Asymmetry and Latitude effect at Sea Level. Part II. Transient behaviour in the single anode magnetron. Part III. The Solution of the partial differential equations describing the flow of heat in a medium in which internal evolution of heat occurs as a result of chemical processes.\nPhillis became a Tucker-Price research fellow at Girton College, Cambridge in\n1946\n, holding this until\n1949\n. She had a strong wish to have her first child before reaching thirty, and she achieved this ambition with a day to spare. Donald Macleod Nicolson was born in Cambridge on\n20\nSeptember\n1947\n. We note at this point that Donald Nicolson studied at King Edward VII School Sheffield\n(1959\n-\n66)\n, then the Mathematical Tripos at St John's College Cambridge\n(1966\n-\n70)\n. He undertook research in algebra for his Ph.D. at Imperial College London then held various posts in Africa: the University of Rhodesia\n(1976\n-\n78)\n, the University of Ilorin, Nigeria\n(1978\n-\n80)\n, and the University of Malawi\n(1980\n-\n94)\n. He published papers:\nOn the graph of prime ideals of the Burnside ring of a finite group\n(1978)\nand\nThe orbit of the regular G-set under the full automorphism group of the Burnside ring of a finite group G\n(1978)\n.\nIn January\n1950\nthe Nicolson family moved to Leeds when Malcolm Nicolson was appointed as a Lecturer in Physics at the University of Leeds. They lived at the Dingle, Outwood Lane, Horsforth. On\n5\nFebruary\n1950\nPhyllis's second son, Roderick Ian Nicolson, was born in Leeds. Roderick Nicolson, now Professor of Psychology at Edge Hill University, Ormskirk, Lancashire, writes in\n[\n14\n]\n:-\nI was lucky enough to 'translate' from maths to Psychology in the\n1970\ns when Psychology was the leading applied science. My goal is to restore Psychology to this position, undertaking research of real impact, addressing the problems that are important to\n21\nst Century Psychology, employing techniques that will become the standard tools and helping students acquire the skills needed to succeed in the\n21\nst century. My main interests are accelerating human learning; creating positive organisational change; positive ageing; dyslexia; the cognitive neuroscience of learning; and the cognitive neuroscience of emotion.\nTragedy struck the Nicolson family on Friday,\n21\nDecember\n1951\nwhen Malcolm Nicolson was killed in a railway accident. On Monday\n24\nDecember an inquest was held and returned a verdict of \"accidental death.\" The inquest was reported in the\nWharfedale & Airedale Observer\non Friday,\n28\nDecember\n1951\n[\n10\n]\n:-\nPhyllis Nicolson, widow, told the Coroner, Dr A J Swanton, that her husband was a Doctor of Philosophy and a Master of Science. They were expecting friends for Christmas and her husband left the house to meet them.\nEdward Lloyd, Belmont Avenue, Liverpool lecturer in physics at Liverpool University, said that at\n9\n.\n40\np.m. on Friday, after he had waited for Dr Nicolson at his home, he went to Newlay station and found him lying dead between the rails. Witness said he had arrived at Horsforth station with his family and not at Newlay station.\nDr C J E Wright said death was due to multiple injuries which included a fractured skull, lacerations of the brain and a fractured pelvis. He did not think Dr Nicolson had been run over by a train but had been probably struck by one. William James, a porter at Newlay station, said he told Dr Nicolson the train he was waiting for would arrive at No.\n1\nplatform. Dr Nicolson had then crossed over to the No.\n1\nplatform by the proper public crossing. Witness said there was another crossing which was for the use of railway employees only. It was a very foggy night, he added.\nPolice Sergeant N Burton said Dr Nicolson's body was found on No.\n4\nline. It was quite possible he had been knocked on to that line by a train passing along one of the other lines. Sergeant Burton added that there were two notices warning people not to use the railway employees' crossing.\nThe Coroner said Dr Nicolson was \"a brilliant man.\" \"This is a sad and untimely end to a promising career,\" he said. He thought Dr Nicolson had made his first mistake in going to the wrong station to look for his friends. \"Then, on leaving the platform, he made a second and fatal mistake, by walking across the crossing which was solely reserved for railway workers,\" the Coroner added. The fog, he said, might have been a contributory factor.\nMalcolm Nicolson's funeral took place at Horsforth Cemetery. At the time of his death he was writing the book\nFundamentals & techniques of mathematics for scientists\nwhich was finally completed and published in\n1961\n. After her husband's untimely death, Phyllis was appointed to fill his lectureship in Physics at Leeds University. Her family and teaching responsibilities meant that she did not have time to continue with her research and she has no research papers published after\n1951\n. Some information about her published work is at\nTHIS LINK\n.\nOn\n1\nAugust\n1955\nPhyllis Nicolson married Malcolm McCaig\n(1911\n-\n1978)\n, who was also a physicist, in Sheffield. Malcolm McCaig, of\n121\nRinginglow Road, Sheffield worked at the Permanent Magnet Association, Brown Street, Sheffield. Malcolm McCaig, born in Nottingham, had married Cassellia Naomi Partridge\n(1910\n-\n1953)\nand they had a son Ian McCaig\n(\nborn February\n1946)\n. Phyllis and Malcolm McCaig had a son Andrew Malcolm McCaig, born in May\n1957\n, who became a geologist. He writes:-\nI was born in Sheffield, England and have a B.A.\n(\nNatural Sciences\n)\nfrom Cambridge, an M.Sc. from the University of Western Ontario and gained a Ph.D. from Cambridge in\n1983\nworking on shear zones in the Pyrenees. After a brief period as a lecturer at Dundee University, I have been at Leeds since\n1984\n.\nWe have not yet mentioned the work for which Phyllis Nicolson is best known, namely her joint work with\nJohn Crank\non the heat equation which was published in the paper\nA practical method for numerical evaluation of solutions of\npartial differential equations\nof the heat-conduction type\n(1947)\n.\nCharlotte Froese Fisher describes in\n[\n7\n]\nhow\nCrank\nand Nicolson came to work on this problem:-\n[\nThere\n]\nwere solutions to other partial differential equations that had been solved on desk calculators. One such problem was the fire\n(\nburning\n)\nproblem of great importance in wartime conditions. This was another heat-conduction problem, very non-linear and with a temperature-dependent term.\nHartree\nwas asked to look into it. He could see a general way of how the problem might be treated but could also see that a lot of detailed work would be needed. Looking for the best people, he had no hesitation in suggesting\nJohn Crank\n, a former student of his, and Phyllis\n(\nLockett\n)\nNicolson. This led to the development of\n[\na method\n]\nnow known as the famous\nCrank\n-Nicolson formula for parabolic equations. When numerical methods are used\n(\nas distinct from differential analysers\n)\n, both the time and the space derivatives need to be replaced by finite differences. A computationally simple, explicit method had been suggested by others but gave rise to an oscillating error. In this paper\nCrank\nand Nicolson present an implicit method requiring an iterative process at each step. As a result, more computations were needed at each step, but the oscillations were removed and much bigger steps in time could be used.\nHartree\nwas intimately involved in the work. The authors acknowledge his many helpful suggestions.\nA continuous solution\nu\n(\nx\n,\nt\n)\nu(x, t)\nu\n(\nx\n,\nt\n)\nis required which satisfies the second order partial differential equation\nu\nt\n−\nu\nx\nx\n=\n0\nu_{t} - u_{xx} = 0\nu\nt\n​\n−\nu\nx\nx\n​\n=\n0\nfor\nt\n>\n0\nt > 0\nt\n>\n0\n, subject to an initial condition of the form\nu\n(\nx\n,\n0\n)\n=\nf\n(\nx\n)\nu(x, 0) = f(x)\nu\n(\nx\n,\n0\n)\n=\nf\n(\nx\n)\nfor all real\nx\nx\nx\nThey considered numerical methods which find an approximate solution on a grid of values of\nx\nx\nx\nand\nt\nt\nt\n, replacing\nu\nt\n(\nx\n,\nt\n)\nu_{t}(x, t)\nu\nt\n​\n(\nx\n,\nt\n)\nand\nu\nx\nx\n(\nx\n,\nt\n)\nu_{xx}(x, t)\nu\nx\nx\n​\n(\nx\n,\nt\n)\nby finite difference approximations. One of the simplest such replacements was proposed by\nL F Richardson\nin\n1910\n.\nRichardson\n's method yielded a numerical solution which was very easy to compute, but alas was numerically unstable and thus useless. The instability was not recognised until lengthy numerical computations were carried out by\nCrank\n, Nicolson and others.\nCrank\nand Nicolson's method, which is numerically stable, requires the solution of a very simple system of linear equations\n(\na tridiagonal system\n)\nat each time level.\nLet us quote from\n[\n16\n]\nthe context and overview given there of Phyllis Nicolson's contributions:-\nHartree\ncontinued to develop mechanical computing in Manchester by importing the idea of the 'differential analyser' from the United States, and raising local sponsorship to build a production machine housed in the basement of Patrick Blackett's physics department\n(\na room unusable by that stage for physics experiments because of the Rutherford-era radiation\n)\n. In the decade before\n1948\nHartree's group was a national resource for numerical solutions to the problems of the science war, including the British atomic bomb project. ... the differential analyser required simultaneous skilled operators for the most efficient use, and\nHartree\nrecruited a team of four. ... this was in part manual labour, perceived by at least one of the recruits as a male job because of the lubricating oil and overalls involved. But the competition for male mathematically skilled war-workers was very high and opportunity opened to Phyllis Lockett, a recent Manchester graduate. Her most valued contribution was remembered within the team not at the controls of the analyser but on problems it could not solve. When the team had to act as 'human CPUs', reverting to the desk calculators, she was the fastest. But it was her theoretical contributions that have lasted the longest; she went on to co-develop the\nCrank\n-Nicolson algorithm which is still in use today by\n(\nelectronic\n)\ncomputers.\nMalcolm McCaig, Phyllis's husband, published the book\nAttraction and repulsion: mechanical applications of permanent magnets\n(1967)\n. Phyllis died of breast cancer in\n1968\n.",
  "matematicos_citados_na_biografia": [
    "D R Hartree",
    "Royal Society of London",
    "Douglas Hartree",
    "Hartree",
    "THIS LINK",
    "John Crank",
    "partial differential equations",
    "Crank",
    "L F Richardson",
    "Richardson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}