{
  "nome_completo": "Pierre François Verhulst",
  "nome_curto": "Pierre Verhulst",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Verhulst/",
  "data_nascimento": "28 October 1804",
  "local_nascimento": "Brussels, French Empire (now Belgium)",
  "data_morte": "15 February 1849",
  "local_morte": "Brussels, Belgium",
  "summary": "Pierre Verhulst was a Belgian statistician who worked on population growth.",
  "biografia": "Pierre Verhulst\nwas born into a wealthy family who spared no expense to give their son a top quality education. His secondary education was at the Athenaeum of Brussels which had an excellent reputation and gave a much broader education than other schools at that time, being particularly strong on its science teaching. Verhulst excelled in science but had other talents too, twice winning a Latin poetry prize. Two pupils in the same class as Verhulst were\nJoseph Plateau\nand Guillaume-Adolphe Nerenburger\n(1804\n-\n1869)\nand these three shared the top prize in mathematics in August\n1822\n, the year they graduated from the Athenaeum. They had a wonderful mathematics teacher in their final years at the Athenaeum, namely\nAdolphe Quetelet\n, who had been appointed as a professor of mathematics there in\n1819\n. Verhulst and\nPlateau\nspent many hours in deep scientific discussions, while both were strongly encouraged by\nQuetelet\nwho became their friend and advisor.\nPlateau\n, of course, achieved fame and has a biography in this archive. Nerenburger also achieved fame with an outstanding career in the Belgian Army but also used his scientific skills as director of the topographic map of Belgium.\nWhen Verhulst graduated from the Athenaeum in\n1822\nhe had not completed the full course of study there but he was keen to progress quickly with his university studies. He entered the University of Ghent in September\n1822\nwhere he registered for a degree in the exact sciences. The authors of\n[\n6\n]\nexplain that:-\n... his lack of formalism caused some problems when he tried to enrol, although, in those days such matters could easily be resolved with some negotiating and argumentation. It was here that he met\nQuetelet\nagain, this time as his algebra professor. Just like his studies at the Brussels Atheneum, his academic performance at the University of Ghent was a success. In less than a year, between February\n1824\nand October\n1824\n, he was honoured with two prizes, one at the University of Leiden for his comments on the theory of maxima, and a second time he won the gold medal of the University of Ghent for a study of variation analysis.\nHe received his doctorate on\n3\nAugust\n1825\nafter only three years study for his thesis\nDe resolutione tum algebraica, tum lineari aequationum binominalium\nⓉ\n(\nThe resolution of algebraic and linear binominal equations\n)\nin which he studied the reduction of binomial equations. He returned to Brussels and undertook some teaching duties at the Musée des Sciences et des Lettres beginning in April\n1827\n. Mathematics courses were being introduced at the museum and Verhulst was responsible for setting up the teaching of an analysis course. However, he had to give up this position after a while since his health was too poor to allow him to continue. In fact he was plagued with bad health throughout his life but the records that exist do not allow us to come to any definite decision about the nature of his illness. However, it appears that the most likely is cause was tuberculosis. May we suggest that\nQuetelet\n's claim in\n[\n13\n]\nthat his illness was related to the fact that he was extremely tall\n(1\n.\n89\nm or about\n6\nft\n)\nsays more about the medical knowledge of the day than it does about Verhulst's illness. At this time Verhulst worked on the theory of numbers, and, influenced by\nQuetelet\n, he became interested in the calculus of\nprobability\nand social statistics. He had been intending to publish the complete works of\nEuler\nbut he put that idea aside as he became more and more interested in social statistics.\nIn\n1829\nVerhulst published a translation of\nJohn Herschel\n's\nTheory of light\n. However in an attempt to overcome his illness he decided to travel to Italy in the hope that the warm climate would improve his health. He arrived in Rome in\n1830\nbut his visit there was not a quiet one.\nQuetelet\nwrote\n(\nsee\n[\n1\n]\n)\n:-\nWhilst on a trip to Rome he conceived the idea of carrying out reform in the Papal States and of persuading the Holy Father to give a constitution to his people.\nAn account of these events was given by Queen Hortense de Beauharnais who was, at this time, living in Rome\n[\n10\n]\n:-\nA young Belgian scholar, Mr Verhulst, had come to Rome for his health. He very often came to my house in the evening; we frequently had discussions together. One morning he asked to speak to me, and brought a plan for a constitution for the Papal States, which he wanted me to look at critically before he gave it to the cardinal-vicar to submit to the pope. I could not help laughing at the strangeness of my position. I, the exiled Queen of Holland, was being asked to revise a constitution, and for the pope! That seemed to me to be a real joke. But my young Belgian friend did not laugh. \"Yesterday evening,\" he said to me, \"I was talking with several cardinals; their terror is great. I told them of the only way to save the church and the state. They agreed with all my observations. And one of them wishes to submit them to the pope himself. Here is the constitution of which I have sketched the basis.\"\nApparently, his plan was considered but did not meet with approval. The Roman hierarchy did not take kindly with being told how to run their affairs by a Belgium\n(\nor probably by anyone, for that matter\n)\nso the police were summoned and Verhulst was ordered to leave Rome. At first he thought he could avoid deportation and barricaded himself in his apartment. After a couple of days his friends persuaded him that he would he foolish to try to defy the expulsion order and he returned to Belgium.\nWhile Verhulst had been in Rome there had been a rebellion in Belgium with much fighting between revolutionaries and Dutch troops. In fact it was news of this rebellion that had motivated him to write a constitution for the Papal States. The National Congress of Belgium was established in November\n1830\nand soon after declared Belgium independent and drew up a Constitution. Verhulst was keen to get involved and, despite his illness and against the advice of his friends, in the middle of\n1831\nhe enlisted in the army set up to oppose the Dutch forces. He also wanted to influence the political situation and wrote\nMémoire sur les abus dans l'enseignement supérieur actuel\nⓉ\n(\nMemoir on abuses in the current higher education\n)\n(1831)\nwhich criticised the way university professors were chosen through political favouritism. He also criticised the standards of teaching in the universities and suggested reforms that the National Congress could implement to improve the situation. May we suggest that his future successes were in spite of this intervention rather than because of it. In\n1832\nQuetelet\nwas assigned the task of drawing up mortality tables for the new Belgium State and he asked Verhulst to assist him in this.\nAn independent Belgium needed professional soldiers trained in a Military Academy and King Leopold I, who admired the French system with its École Polytechnique, suggested that Belgium set up a Military Academy based on the French model. Lieutenant-Colonel Jean-Jacques Édouard Chapelié, who had been a student at the École Polytechnique, was given the task of setting up the Belgium Military Academy. He became the first director when it was established in\n1834\nand\nQuetelet\nwas appointed as one of the first professors. On\nQuetelet\n's recommendation, in\n1834\nVerhulst was appointed as a Répétiteur at the Academy to teach calculus. In\n[\n13\n]\nQuetelet\nsays that Verhulst took the utmost care with the preparation of his lecture notes for his courses at the Military Academy, and continually updated and improved them. On\n28\nSeptember\n1835\nVerhulst was appointed professor of mathematics at the Université Libre of Brussels. There he gave courses on astronomy, celestial mechanics, the differential and integral calculus, the theory of probability, geometry and trigonometry.\nVerhulst married in\n1840\nto Miss De Biefve, whose brother Édouard De Biefve\n(1808\n-\n1882)\nwas well-known as a painter; they had one daughter. Verhulst had to resign from his position at the Université Libre of Brussels since it had been decreed that those teaching at the Military Academy could not teach in any other educational establishments. He continued to be influenced by\nQuetelet\nalthough he was not always in agreement with\nQuetelet\n's ideas. However, one project by Verhulst which\nQuetelet\npraised highly was his work on elliptic functions. This came about since Verhulst bought an edition of the complete works of\nLegendre\nin a public sale. He was particularly inspired by\nLegendre\n's\nTraité des fonctions elliptiques\nⓉ\n(\nTreatise on elliptic functions\n)\nand went on to read the works of\nNiels Abel\nand\nCarl Jacobi\non\nelliptic functions\n. Verhulst then wrote\nTraité élémentaire des fonctions elliptiques\nⓉ\n(\nElementary treatise on elliptic functions\n)\n(1841)\nwhich was a critical résumé of these important contributions to the theory of elliptic functions.\nQuetelet\npraised the work highly and it must have been a contributory factor in Verhulst's election to the\nBelgium Academy of Science\nlater in\n1841\n.\nQuetelet\ndoes not seem to have appreciated Verhulst's most important contribution, however, namely his work on the logistic equation and logistic function.\nVerhulst's research on the law of population growth is important and his first important contribution was\nNotice sur la loi que la population suit dans son accroissement\nⓉ\n(\nRemarks on the law that  population follows in its growth\n)\n(1838)\n. The assumed belief before\nQuetelet\nand Verhulst worked on population growth was that an increasing population followed a\ngeometric progression\n.\nQuetelet\nbelieved that there are forces which tend to prevent this population growth and that they increase with the square of the rate at which the population grows. Verhulst wrote in his\n1838\npaper:-\nWe know that the famous Malthus showed the principle that the human population tends to grow in a geometric progression so as to double after a certain period of time, for example every twenty five years. This proposition is beyond dispute if abstraction is made of the increasing difficulty to find food ... The virtual increase of the population is therefore limited by the size and the fertility of the country. As a result the population gets closer and closer to a steady state. ...\nIn the paper Verhulst argued against the model for population growth that\nQuetelet\nhad proposed and instead proposed a model with a\ndifferential equation\nnow known as the logistic equation. He published a further paper on population growth in\n1844\nentitled\nRecherches mathématiques sur la loi d'accroissement de la population\nⓉ\n(\nMathematical research on the law of growth of the population\n)\n. He named the solution to the equation he had proposed in his\n1838\npaper the 'logistic function'. It is unclear why he gave it this name and in\n[\n12\n]\nHugo Pastijn considers certain possible explanations:-\nThe reason why Verhulst called this curve \"a courbe logistique\" in his communication of November\n30\n,\n1844\n, is not clear. He does not give any explanation. One might guess that he refers to the term logistics, related to transportation and distribution in the supply chain of an army, analogous to the supply of subsistence means of a population which he considered to be limited. The term logistic was then already to a certain extent in use in the military environment. He could have been familiar with it, through his military contacts in the Military Academy in Brussels. Another possible root of the term logistic could have been the French word \"logis\"\n(\nplace to live\n)\nwhich was of course related to the limited resources for subsistence of a population, Verhulst was dealing with in his model.\nIn this paper, which was published in\n1845\n, Verhulst writes:-\nWe shall not insist on the hypothesis of geometric progression, given that it can hold only in very special circumstances; for example, when a fertile territory of almost unlimited size happens to be inhabited by people with an advanced civilization, as was the case for the first American colonies.\nHe showed that forces which tend to prevent a population growth grow in proportion to the ratio of the excess population to the total population. Based on his theory Verhulst predicted the upper limit of the Belgium population would be\n9\n,\n400\n,\n000\n. In fact the population in\n1994\nwas\n10\n,\n118\n,\n000\nand, but for the affect of immigration, his prediction looks good. To update these figures, we note that the\n2013\npopulation estimate is\n10\n,\n951\n,\n266\n(\nwith\n90\n% being Belgium\n)\nand the projections for\n2020\nand\n2030\nare\n11\n,\n662\n,\n00\nand\n12\n,\n278\n,\n000\nrespectively. He produced a third important paper on this topic in\n1847\n, namely\nDeuxième mémoire sur la loi d'accroissement de la population\nⓉ\n(\nSecond memoir on the law of growth of the population\n)\n. In this last paper, Verhulst put forward some criticisms of his own model of population growth and this, together with\nQuetelet\n's criticisms in his obituary of Verhulst\n[\n13\n]\n, led to Verhulst's logistic equation being ignored for many years until the work of Raymond Pearl and Lowell Reed in\n1920\n.\nVerhulst was elected president of the\nBelgium Academy of Science\nin\n1848\n. However, the bad health which he had suffered from earlier returned to make his life increasing difficult over the last years of his life.\nWe end with this description of Verhulst based on\nQuetelet\n's writings\n(\nsee\n[\n6\n]\n)\n:-\nAccording to\nQuetelet\n, Verhulst was ...   self-willed, a man with a social conscience and a man of principle, controversial and often an advocate of extreme ideas, but he also had a strong sense of justice and acted from a deep feeling for his duty. He was straightforward and consistent in his thinking, but on the other hand also conciliatory. As chairman of the Academy he shrank from anything that might have caused dissension. He was never offensive, and the higher his position the more unassuming he became. Although he himself did not have the slightest inclination for losing his temper, he respected the short-temperedness of others. Although he loved taking part in debates, it was more out of a craving for knowledge than in a spirit of contradiction or with the intention of imposing his own views. He was noted for his unperturbed equanimity. It would have been difficult to find a man more conscientious. According to\nQuetelet\n's testimony, this sense of duty was marked during the last years of his life, when he still went to work every day. It took him more than an hour to walk the short distance from his house to his office. People saw him trudge along the streets, resting with every step he took, to arrive finally at the academy, panting heavily and completely exhausted.",
  "matematicos_citados_na_biografia": [
    "Joseph Plateau",
    "Adolphe Quetelet",
    "Plateau",
    "Quetelet",
    "probability",
    "Euler",
    "John Herschel",
    "Legendre",
    "Niels Abel",
    "Carl Jacobi",
    "elliptic functions",
    "Belgium Academy of Science",
    "geometric progression",
    "differential equation"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}