{
  "nome_completo": "Pierre Emile Jean Cartier",
  "nome_curto": "Pierre Cartier",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cartier/",
  "data_nascimento": "10 June 1932",
  "local_nascimento": "Sedan, Ardennes, France",
  "data_morte": "17 August 2024",
  "local_morte": "Marcoussis, Île-de-France, France",
  "summary": "Pierre Cartier was a French mathematician who has worked in algebraic geometry, representation theory, mathematical physics and category theory. He was a member of Bourbaki.",
  "biografia": "Pierre Cartier\n's parents were Jean Cartier, who was a medical representative, and Yvonne Suran who was the headmistress of a Lycée. Cartier wrote of his family in\n[\n2\n]\n:-\nThe second or third or fourth generation in any family or any social group follows definite sociological patterns. My own family was typical. My grandfather was a self-made man, a very successful businessman. My father and my uncle went into the business, but they were not so devoted to the fight. And people in my generation - well, I suppose I made the right decision not to engage in it. Indeed, people in my generation who did go into our family business did not do so well, because they didn't have anything to fight for.\nPierre was born in Sedan, a small city in northeastern France near the Belgium border. He said of his background\n[\n1\n]\n:-\nMy background, characterised by the contrast between the Alsatian common sense of my grandmother and the somewhat delirious imagination of my father, gave me a huge curiosity for people, countries and books.\nWhen Pierre was eight years old the town was destroyed during the German invasion of France in World War II. Food was scarce and life was extremely hard for everyone. The war years, and those immediately after, was an extremely difficult time for the young boy to grow up and receive his education. He attended the Collège Turenne in Sedan, beginning his studies there in\n1942\n. Because of the war the school had few books and struggled to provide an education for the children. He spoke in\n[\n2\n]\nabout his experiences there:-\nI had been a student in a very provincial, very outdated high school. Some of my teachers were very good but of course they were very far away from modern science. The mathematics I was taught was classical geometry, in the uncultivated, synthetic way. I did have the luck to have an imaginative teacher in physics, and so at first I wanted to by a physicist.\nHe had been taught some algebra by one of his grandmother's brothers and he became fascinated by mathematics, reading on his own a number of mathematics texts. He also leafed through encyclopaedias looking for the articles on mathematical topics. In\n1948\n, at age sixteen, he won first prize in the 'concours général'. One of his parents' friends, delighted at Pierre's achievement, offered to buy him books as a reward. Pierre spent a couple of hours in a bookshop making his choice. He finally decided on\nAndré Lichnerowicz\n's book on tensor calculus and volume\n1\nof\nBourbaki\n's\nTopology\n.\nIn order to prepare for entry into the École Normale Supérieure in Paris, Cartier left Sedan and went to Paris where he attended the Lycée Saint-Louis\n[\n2\n]\n:-\nI took private lessons in physics from a very peculiar teacher, Pierre Aigrain.\nHe continued to study mathematics on his own and during his time he prepared to begin his university studies by reading\nClaude Chevalley\n's\nTheory of Lie Groups\nand works by\nHermann Weyl\n. Cartier entered the École Normale Supérieure in\n1950\nwhere\nHenri Cartan\nwas his professor of mathematics and he also attended courses by\nLaurent Schwartz\n. He also learnt much from\nSamuel Eilenberg\nwho was spending a year in Paris working with\nHenri Cartan\non their book\nHomological algebra\n. However Cartier suggested that the education he received at the École Normale Supérieure and the Sorbonne was old fashioned to say the least\n[\n2\n]\n:-\nUsually a bright student completes the program in two years, but I managed to get through it in one. But both the mathematics and the physics I was taught were totally outmoded at that time, totally. I remember that, in a course called General Physics at the Sorbonne, the professor made a solemn declaration: \"Gentlemen in my class what some people call the 'atomic hypothesis' has no place.\" That was\n1950\n, five years after Hiroshima! So I went to Aigrain and said, \"What do I do?\" and he said, \"Well, of course, you have to get your degree, but I will teach you physics properly.\" This shows what the French university was at the time.\nAs well as mathematics and physics courses, he also took philosophy courses and seminars\n[\n1\n]\n:-\nAt the end of the year I had to choose: Louis Althusser\n(1918\n-\n1990)\n, the Marxist, advised me that it was better to take the mathematics rather than the philosophy exams,\nYves Rocard\nproposed to me that I help build the French atomic bomb and\nHenri Cartan\ninvited me to a\nBourbaki\nmeeting.\nHe decided to attend the\nBourbaki\nmeeting\n[\n1\n]\n:-\nIn\n1950\na new generation, whose natural leader was\nSerre\n, had taken control\n[\nof\nBourbaki\n]\n. In that period we had huge ambitions;\nBourbaki\nreally wanted to write down all of mathematics. For me it was a dazzling experience; I learned so many things during the week I spent with them. According to\nBourbaki\n's method, we studied reports on the topics which were to be treated in the series. Moreover, it was there where I met\nAndré Weil\n, to whom I kept very close during the rest of his life.\nAfter completing his Agrégé de mathematique in\n1951\nCartier married Monique Pissevin on\n3\nNovember; they had one daughter Marion. He continued to study at the École Normale for his doctorate and was assigned\nRoger Godement\nas an advisor.\nGodement\nwas in Nancy and Cartier soon decided that he was more interested in the mathematics that\nHenri Cartan\nand\nAndré Weil\nwere doing so he changed the topic of his research.\nWeil\nwas by this time on the faculty of the University of Chicago in the United States but he returned to Paris every summer when Cartier could discuss his progress. Cartier began publishing papers and nine had appeared in print while he was still undertaking research for his doctorate:\nDualité de Tannaka des groupes et des algèbres de Lie\nⓉ\n(\nDuality Tannaka groups and Lie algebra\n)\n(1956)\n;\nDémonstration algébrique de la formule de Hausdorff\nⓉ\n(\nDemonstration of algebraic formula Hausdorff\n)\n(1956)\n;\nThéorie différentielle des groupes algébriques\nⓉ\n(\nDifferential theory of algebraic groups\n)\n(1957)\n;\nUne nouvelle opération sur les formes différentielles\nⓉ\n(\nA new operation on the differential forms\n)\n(1957)\n;\nCalcul différentiel sur les variétés algébriques en caractéristique non nulle\nⓉ\n(\nCalculus on algebraic varieties in nonzero characteristic\n)\n(1957)\n;\nDualité des variétés abéliennes\nⓉ\n(\nDuality of Abelian varieties\n)\n(1957)\n;\n(\nwith\nJ Dixmier\n)\nVecteurs analytiques dans les représentations de groupes de Lie\nⓉ\n(\nAnalytical vectors in Lie group representations\n)\n(1958)\n;\nRemarques sur le théorème de Birkhoff-Witt\nⓉ\n(\nNotes on the Birkhoff-Witt theorem\n)\n(1958)\n; and\nQuestions de rationalité des diviseurs en géométrie algébrique\nⓉ\n(\nQuestions of rationality for divisors in algebraic geometry\n)\n(1958)\n.\nHe defended his thesis\nDérivations et diviseurs en géométrie algébrique\nⓉ\n(\nDerivations and divisors in algebraic geometry\n)\nin\n1958\n. He said\n[\n1\n]\n:-\nThe best result of my thesis solved a problem posed by\nWeil\nin his book on Abelian varieties and algebraic groups. One day I had an inspiration: I was aware of what\nDieudonné\nwas doing with formal groups, I also had in mind the question posed by\nWeil\nand I said to myself: \"This is linked\". I saw it immediately but it took a very long time to prove because it lies on the crystalline cohomology of schemes\n(\nto be developed only after\n1965)\n.\nHe had worked for three years, from\n1954\nto\n1957\n, at the Centre National de la Recherche Scientifique. We have already mentioned that Cartier had been invited to a\nBourbaki\ncongress while he was still an undergraduate. This was held at Pelvoux, in the Alps, in June\n1951\n[\n2\n]\n:-\nI remember that we discussed many things, especially a text written by\nLaurent Schwartz\non the foundations of\nLie\ngroups; it was one of the first drafts in the well-known series of\nBourbaki\non\nLie\ngroups\nBy\n1955\nhe had become a full member of the\nBourbaki\ngroup and remained associated with the group until he reached the official retiral age of\n50\nset by the group in\n1983\n. He made a major contribution to the project\n[\n2\n]\n:-\nI estimate that I contributed about\n200\npages a year during all this time with\nBourbaki\n.\nHe also took over the role of secretary:-\nAfter\nDieudonné\n(\nand an interlude by\nSamuel\nand\nDixmier\n)\nI was the secretary of\nBourbaki\n, and it was my duty to do most of the proofreading, I think I proofread five to ten thousand pages. I have a good visual memory. I wouldn't compare myself with\nDieudonné\n, but there was a time when I knew most of the printed material in\nBourbaki\n.\nCartier spent two years from\n1957\nto\n1959\nat the Institute for Advanced Study at Princeton in the United States. Returning to France he was appointed Professor in the faculty of Science at Strasbourg in\n1961\n, remaining there until he moved to the Institut des Hautes Études Scientifiques at Bures-sur Yvette ten years later. In addition to this post he was director of research at the Centre National de la Recherche Scientifique from\n1974\n. In\n1982\nhe left he Institut des Hautes Études Scientifiques becoming a professor at the École Polytechnique\n(1982\n-\n88)\nand at the École Normale Supérieure from\n1988\n.\nCartier had written papers on a broad range of mathematical topic including\nalgebraic geometry\n, number theory, group theory,\nprobability\n, and mathematical physics. In\n[\n1\n]\nhe speaks about his approach to solving mathematical problems:-\nMy method is my character: I am curious by nature and everything attracts my attention. Since I have acquired a 'savoir faire' in very different directions, when I study a problem I always have several techniques in mind. I am also very interested in questions concerning history and the philosophy of mathematics. André Weil taught me to learn from the mathematicians of the past as if they were our contemporaries. For me the big question is always the same: what guarantees that mathematics tells the truth? How does it tell it? Does it always tell it?\nThe latter part of Cartier's career saw a surprising change of mathematical direction\n[\n2\n]\n:-\nI have been personally very happy, because when I reached the time of normal retirement from Bourbaki, I had the very fortunate opportunity to be asked to deliver the lecture on behalf of\nVladimir Drinfeld\nat the International Congress of Mathematicians at Berkeley in\n1986\n(\nDrinfeld\nwas prevented from coming for political reasons\n)\n. It was a great challenge and a great honour for me; his paper is one of the most important papers in the proceedings. Overnight that changed my mathematical life. I said, \"This is what I have to do now.\" Of course I knew the basic material but the perspective was new. I cannot claim that within the few hours I had to prepare the lecture I could really master it, but I understood enough to explain to the people, \"This is new, it is important.\"\nUnlike other members of\nBourbaki\n, Cartier had always been interested in mathematical physics. He had often lectured on applied mathematics topics in the\nBourbaki\nseminar but every time he did so he always felt that others did not approve. There were reasons for this other than the obvious fact that they preferred pure mathematics. Those like\nGodement\nand\nGrothendieck\nwere passionately opposed to the military and mathematical physics was seen by them as \"military applications\". Long before the\n1986\nchange of direction he speaks of above he had written papers such as\nQuantum mechanical commutation relations and theta functions\n(1966)\n. Following his delivery of\nDrinfeld\n's lecture in\n1986\n, he delivered the paper\nSur le développement des mathématiques de\n1870\nà\n1970\n: quelques exemples d'interaction avec la physique\nⓉ\n(\nOn the development of mathematics from\n1870\nto\n1970\n: some examples of interaction with physics\n)\nat the Colloquium on Mathematics and Physics held in Paris from\n17\nto\n19\nOctober\n1988\n. It was published in\n1991\n. Continuing this interest in applications to physics, he did much work on functional integration, collaborating with Cécile DeWitt-Morette. They published jointly authored papers such as\nA new perspective on functional integration, Poisson processes in probability and quantum physics\n(1996)\n,\nA rigorous mathematical foundation of functional integration\n(1997)\n, and\nPhysics on and near caustics\n(1997)\n. They produced the excellent survey of their work in this area in\nFunctional integration\n(2000)\n. In\n2006\nthey published the book\nFunctional integration: action and symmetries\n. Dada S Fine writes in a review:-\nThis monograph presents a wide array of examples of path integration in physics. The list begins with Gaussian integrals, the forced harmonic oscillator, and the semi-classical approximation. It then moves on to more exotic quantum mechanical examples including phase-space path integrals, the spinning top, the Aharonov-Bohm effect and supersymmetric quantum mechanics.\nPoisson\nprocesses, solutions of stochastic differential equations and an introduction to quantum field theory ... The authors write for both mathematicians and physicists. ... Overall, this book provides both mathematicians and physicists with a look at what is out there in the realm of path integral physics. Its extensive coverage and references to recent literature make it potentially very useful.\nAnother interest which Cartier kept throughout his career was in the philosophy of mathematics. For example, he ran a seminar on epistemology at the École Normale Supérieure. He published\nLogique, catégories et faisceaux\n[\nd'après F Lawvere et Myles Tierney\n]\nⓉ\n(\nLogic, categories and beams\n[\nafter F Lawvere and Myles Tierney\n]\n)\n(1979)\nin the\nSéminaire Bourbaki\n, and\nThe nature and meaning of numbers\n(\nwritten in\n1984\nand published in\n1989)\n. One of his most recent papers on the philosophy of mathematics, published in\n2012\n, is\nHow to take advantage of the blur between the finite and the infinite\n. Philip Ehrlich writes in a review of this paper:-\nIn this paper, the distinguished author presents a series of philosophical musings based on the distinction between a \"true finite\" set and a \"theoretical finite\" set. By a true finite set the author means a set that can be constructed by some feasible human action such as writing numbers on a sheet of paper or on a computer screen, and by a theoretical finite set the author means a set that is set-theoretically finite, i.e. a set for which there is no bijection with a proper subset of itself. Through a series of illustrations the author suggests that the set-theoretic conception is a liberating notion that has important implications for mathematics.\nLet us note, however, that in parallel with these topics, he has continued to publish on algebraic geometry. To illustrate the range of topics which interests Cartier we record the fact that he is an editor of a book about art and mathematics\nLes Mathematiques et l'Art\nⓉ\n(\nMathematics and Art\n)\n.\nCartier has been very active helping to support mathematics in developing countries. For example, he has helped  countries such as Chile, Vietnam, and India to raise their mathematical profile. He was awarded the\nAmpère\nPrize by the\nFrench Academy of Sciences\nin\n1979\n.",
  "matematicos_citados_na_biografia": [
    "André Lichnerowicz",
    "Bourbaki",
    "Claude Chevalley",
    "Hermann Weyl",
    "Henri Cartan",
    "Laurent Schwartz",
    "Samuel Eilenberg",
    "Yves Rocard",
    "Serre",
    "André Weil",
    "Roger Godement",
    "Godement",
    "Weil",
    "J Dixmier",
    "Dieudonné",
    "Lie",
    "Samuel",
    "Dixmier",
    "algebraic geometry",
    "probability",
    "Vladimir Drinfeld",
    "Drinfeld",
    "Grothendieck",
    "Poisson",
    "Ampère",
    "French Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}