{
  "nome_completo": "Piero della Francesca",
  "nome_curto": "Piero della Francesca",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Francesca/",
  "data_nascimento": "June 1420",
  "local_nascimento": "Borgo San Sepolcro (now Sansepolcro, Italy)",
  "data_morte": "12 October 1492",
  "local_morte": "Borgo San Sepolcro (now Sansepolcro, Italy)",
  "summary": "Piero della Francesca was an Italian artist who pioneered the use of perspective in Renaissance art and went on to write several mathematical treatises.",
  "biografia": "Piero della Francesca\n, who came from a family of fairly prosperous merchants, is recognised as one of the most important painters of the Renaissance. Although today he is always known as Piero della Francesca, he would have been known in his lifetime as Piero di Benedetto de' Franceschi. His father, Benedetto de' Franceschi, was a leather and wool merchant, while his mother Romana was the daughter of the wool merchant, Renzo di Carlo da Monterchi, from the nearby village of Monterchi. It is thought that Benedetto and Romana married around\n1416\nfor, although no marriage certificate has been found, they exchanged the dowry in that year. However, Benedetto inherited some money and a share of a house in\n1410\nand there is some evidence to suggest that he married shortly after this, but if this is true it is hard to believe that the dowry would only be exchanged six years later. As these arguments illustrate, there is no definite evidence when Piero was born, sources giving dates between\n1406\nand\n1422\n. However, James Beck makes a good case in\n[\n20\n]\nfor June\n1420\nbased in part on Piero being the third of his parents' sons. We know little of Piero's early years but, given the wealth and status of his father\n(\nwho owned agricultural land, vineyards, urban properties and a fine family home\n)\n, it is clear that he would have attended school in San Sepolcro.\nDetails of Piero's schooling remain conjecture, but we can deduce something of its nature from the skills he displayed as an adult. He wrote his mathematics books in Italian rather than Latin, suggesting that he probably did not learn Latin at school. Also it is clear that Piero's Italian writing lacked style, and was rather simple and elementary. This suggests that Piero did not spend that long at school and it confirms his lack of Latin since those who could write fluent Latin developed a style when writing Italian that reflected Latin structure. However, as an adult he had read\nEuclid\n's\nElements\nand had some knowledge of the works of\nArchimedes\nand, since no Italian versions were available in Piero's day, he must have learnt enough Latin in later life to read these works. Paul Grendler writes\n[\n32\n]\n:-\nHis father's occupation and social position probably determined that Piero della Francesca attended an abbaco and vernacular school, perhaps only for a few years. The boy Piero probably received the same schooling as did thousands of other Italians of his background, but it was a surprisingly rich and diverse education. The adult Piero may have learned enough Latin to enable him to read Latin mathematical texts with their specialised vocabulary. The key seems to be that Piero continued to learn throughout his life. And his learning worked for him. One has the impression that Piero retained everything - the saints' legends read in school, the mathematics of abbaco school, his creative explorations into ancient geometry - and that all his learning enriched his painting.\nOur knowledge of Piero's life in San Sepolcro has been greatly increased by the research of James Banker\n(\nsee\n[\n3\n]\nand\n[\n19\n]\n)\n. Documents Banker has found show that Piero worked as the assistant of Antonio d'Anghiari in the\n1430\ns. Antonio came from the village of Anghiari, about\n7\nkm from Borgo San Sepolcro, but moved to Borgo San Sepolcro where he completed his first commission and was paid on\n27\nMay\n1430\n. Piero's father Benedetto was witness to the payment. In June of the following year Benedetto received payment for Piero's work \"painting the poles of the candles\". Benedetto received further payments for work carried out by Piero over the following years during which he was clearly working as an assistant to Antonio. For example one document dated\n29\nDecember\n1432\nstates\n(\nsee\n[\n19\n]\n)\n:-\nMaster Antonio di Giovanni painter from Anghiari, inhabitant of the land of Borgo, was confessed and content to be the true debtor of Benedetto di Piero di Benedetto from aforesaid Borgo in the amount of fifty-six florins ... for the salary and debt of Pietro, painter, son of said Benedetto and the wages of the said Pietro for the labour lent to the said Master Antonio from the first of the month of the most recent June and also from the loan to him by the said Benedetto made freely on successive occasions and down to today for the exigencies of said master Antonio for the furnishings of the pictures of the altar-piece of the major altar of the church of S Francesco.\nThe fact that Piero is described as a \"painter\" in this document indicates that Piero was not an apprentice by this time but rather an assistant. By the dating we have given above, he was only twelve years old at the time, certainly the right age to be an apprentice but that he would be an assistant by this age is surprising. The real problem is that, fascinating as all the evidence about Piero's youth is, whatever dates are proposed, there always seems to remain some difficulties. The documents show that Piero's father continued to receive payments for work undertaken by Piero, working with Antonio d'Anghiari, in\n1435\n,\n1436\n, and\n1437\n, in particular for painting banners for the Church. A document dated\n8\nJanuary\n1438\n, again signed by Benedetto, ends Piero's association with Antonio acknowledging that payment has been received for Piero's work on three separate churches and chapels in and around Borgo San Sepolcro. Banker, in\n[\n3\n]\n, gives an overview of the influence of these years on the young Piero:-\nThe artisan culture of San Sepolcro in the\n1430\ns profoundly informed Piero's sensibility. His origins in this culture endowed him with several strengths and habits of mind that sustained him throughout his life, overcoming the socially ambiguous nature of his family as it was perched between artisan and merchant status. His labour in the artisan culture remained formative in Piero's life and art, not withstanding his great later achievements in painting, mathematics, and geometry that required access to and participation in an elite culture. His formative years as an artisan moulded the understructure of his mind: his linguistic practices, artisan methods, and representation of artisan achievements.\nPiero left Borgo San Sepolcro and went to Florence where, in\n1439\n, he was assisting Domenico Veneziano in painting the chapel of Santa Egidio, in Santa Maria Novella. Paul Watson writes\n[\n2\n]\n:-\nIn Florence he probably studied the statuary of Donatello and Luca Della Robbia, the buildings of\nFilippo Brunelleschi\n, and the paintings of Masaccio and Fra Angelico, and he might have read a theoretical treatise on painting by the humanist and architect\nLeone Battista Alberti\n. Undoubtedly, he would have been directed to these luminaries by Domenico Veneziano, whose own works demonstrate a Renaissance emphasis on colour and light as elements of pictorial construction. It was this contact with the early Renaissance art of Florence that provided the foundation of Piero's own style.\nIt is not known whether Piero assisted Domenico for the whole work but we know he received payment for his contribution to painting the first mural on\n12\nSeptember\n1439\n. In June\n1441\nDomenico began work on a second fresco in the chapel and by this time Piero is listed as a member of the town council in Borgo San Sepolcro. It has been pointed out that he may not actually have been living in Borgo at this time and might well have continued to assist Domenico. However, it appears that he painted the\nBaptism\nin Borgo San Sepolcro around\n1441\nin the cathedral church of St John the Evangelist\n(\nalthough some art historians suggest it was painted\n20\nyears later\n)\n. Ginzburg in\n[\n9\n]\ndiscusses in depth the various arguments used in dating Piero's paintings. In\n1445\nthe Compagnia della Misericordia, a guild whose aim was to help the poor and unfortunate, commissioned him to paint an altarpiece in their church at Borgo San Sepolcro. The commission stated that the work was to be completed within three years, but it was not finished until\n1462\n, seventeen years after Piero began. The image painted by Piero depicts the Virgin protecting members of the guild under her cloak. Piero only worked intermittently on the altarpiece, undertaking many other commissions during these years.\nYou can see the\nSan Sepolcro alterpiece\nat\nTHIS LINK\n.\nAlso in Borgo San Sepolcro around this time he painted the\nBaptism of Christ\n, which uses geometry to great effect, for example in placing the dove at the centre of the circle forming the top of the painting. The hills around Borgo San Sepolcro and the town itself appear in the background of the scene.\nYou can see the\nBaptism of Christ\nat\nTHIS LINK\n.\nAfter undertaking work in Pesaro and Ancona, around\n1450\nhe was invited to Ferrara by Borso d'Este where he\n[\n13\n]\n:-\n... decorated many of the palace rooms. These, however, were afterwards destroyed by Duke Ercole the elder when he renovated the palace.\nAlso while in Ferrara he painted frescos in the Sant'Andrea Church of the Augustinians in Sant'Agostino. He was in Rimini in\n1451\ncommissioned by Sigismondo Pandolfo Malatesta. He painted a famous fresco of Sigismondo praying before St Sigismund and, as this painting is signed and dated, it is one of the few definite dates in this biography. While in Rimini he met with the mathematician and architect\nLeone Battista Alberti\nwho was completing his book\nDe re aedificatoria\n.\nAlberti\n, like Piero, was deeply interested in perspective and the two must have exchanged ideas on this topic while in Rimini. One of Piero's most famous works\n(\nmany would say his most famous\n)\nis the\nStory of the True Cross\ncycle, begun around\n1457\n. Marilyn Lavin\n[\n33\n]\nwrites about the frescos, commissioned by the richest family in Arezzo\n(\nthe Bacci family\n)\n, and painted in the church of San Francesco:-\nIn the Tuscan town of Arezzo, Piero della Francesca painted the Renaissance fresco cycle most admired by twentieth-century viewers. The frescoes represent the story of the True Cross, and were commissioned for the chancel area of the friary church of San Francesco. The decorations had been started by a popular, but rather workmanlike, painter Bicci di Lorenzo, in the late\n1440\ns; it was probably after Bicci died in\n1452\nthat Piero was called in. He completed the project sometime before December\n20\n,\n1466\n...\nNot only do the frescos show that Piero is complete master of perspective but they also show a remarkable treatment of light. Piero uses light, combining shadow and shade, to make the figures\n3\n-dimensional. Light is also used in conjunction with perspective to create the illusion of depth in the scenes depicted.\nYou can see the\nTrue Cross frescos\nat\nTHIS LINK\n.\nPiero was the called to Rome by Pope Pius II soon after he became pope in August\n1458\n. Piero painted many frescos in the Vatican, later destroyed when replaced by works by Raphael, and in the Basilica di Santa Maria Maggiore. After leaving Rome, Piero returned to his home town where he undertook a number of commissions before he went to Loreto to begin decorating the vault of the sacristy with Domenico Veneziano. An outbreak of the plague caused them to leave soon after starting the work. Piero's\nThe Flagellation of Christ\n, painted in Urbino around\n1460\n, is now considered a masterpiece. Marilyn Lavin writes\n[\n10\n]\n:-\nAlthough Piero della Francesca's Flagellation is today one of the most famous and highly regarded paintings of the Italian fifteenth century, its prominence in the history of art is relatively new. Small in scale and housed in the out-of-the-way town of Urbino, its very existence is unrecorded before the late eighteenth century. When it made its first appearance in art historical literature some time after, Piero was, surprisingly enough, considered more a technician than an artist. ... Only around the turn of\n[\nthe\n20\nth\n]\ncentury did\n[\nthe Flagellation\n]\nbegin to be appreciated as a great work of art. With the waning of romantic attitudes and the critical acceptance of Post-Impressionism and Cubism, it was soon drawing praise for the very qualities that had earlier been censured; its restrained expression, purity of colour and, above all, the perfect equilibrium of its organisation.\nThe scene is dominated by architecture with stunning use of perspective to both add realism and also to draw the eye towards the figure of Christ although he is depicted almost in the background.\nYou can see the\nFlagellation of Christ\nat\nTHIS LINK\n.\nPiero produced other remarkable paintings, including the\nResurrection\npainted in Borgo San Sepolcro around\n1563\n. The landscape around Borgo San Sepolcro and the town itself is represented amazingly accurately behind the figure of Christ preparing to leave the tomb.\nYou can see the\nResurrection of Christ\nat\nTHIS LINK\n.\nFurther works are the\nMadonna del Parto\n, a fresco originally in Santa Maria di Momentana in Monterchi painted around the same time, the\nNativity\npainted around\n1470\n-\n75\n, the\nMadonna di Senigallia\npainted in Urbino around\n1474\n, the\nMadonna and Child with Saints\n, a Montefeltro Altarpiece painted just after the Madonna of Senigalli.\nYou can see the\nMadonna del Parto\nat\nTHIS LINK\n, the\nMadonna di Senigallia\nat\nTHIS LINK\nand the\nMontefeltro Altarpiece\nat\nTHIS LINK\n.\nHe also painted portraits of Federico da Montefeltro, Duke of Urbino, and Battista Sforza, Duchess of Urbino. Federico was blind in his right eye so Piero shows him in profile so as not to give offence. Despite this the Duke is painted with realism, for example his bent nose and wart are depicted, yet the portrait shows great elegance. The background landscape is remarkably detailed yet subtle.\nYou can see the\nUrbino portraits\nat\nTHIS LINK\n.\nPiero spent the last years of his life in his home town, becoming prior of the Confraternita di San Bartolomeo in\n1480\n. Although some historians dispute this, many accept Vasari's claim in\n[\n13\n]\nthat Piero went blind. For example Beck writes\n[\n20\n]\n:-\nThere is solid evidence that he became blind in later life, although almost certainly this occurred after\n1487\nwhen he made some hand-written notes blocking out the details of his last will and testament. Obviously, blindness had an enormous impact upon his life and his art, making it impossible to date any work whatsoever after ca.\n1488\n. More challenging for the critic is the possibility that his eyesight deteriorated slowly. Were this documentable, we might understand features of his later work that could reflect a declining visual condition ... For the moment there is no evidence for fixing precisely when the blindness occurred nor have efforts been made to identify a visual crisis in his art.\nFinally we note that no evidence exists that Piero ever married. Certainly no wife or children are mentioned in his will which has survived.\nWe now give a description, contributed by J V Field, of Piero's mathematical works.\nIn his own time he was also known as a highly competent mathematician. In his\nLives of the most famous painters\n...\n[\n13\n]\n, Giorgio Vasari\n(1511\n-\n1572)\nsays that Piero showed mathematical ability in his earliest youth and went on to write 'many' mathematical treatises. Of these, three are now known to survive. The titles by which they are known are:\nAbacus treatise\n(\nTrattato d'abaco\n)\n,\nShort book on the five regular solids\n(\nLibellus de quinque corporibus regularibus\n)\nand\nOn perspective for painting\n(\nDe prospectiva pingendi\n)\n. Piero almost certainly wrote all three works in the vernacular\n(\nhis native dialect was Tuscan\n)\n, and all three are in the style associated with the tradition of 'practical mathematics', that is, they consist largely of series of worked examples, with rather little discursive text.\nThe\nAbacus\ntreatise is similar to works used for instructional purposes in 'Abacus schools'. It deals with arithmetic, starting with the use of fractions, and works through series of standard problems, then it turns to algebra, and works through similarly standard problems, then it turns to geometry and works through rather more problems than is standard before\n(\nwithout warning\n)\ncoming up with some entirely original three-dimensional problems involving two of the 'Archimedean polyhedra'\n(\nthose now known as the truncated tetrahedron and the\ncuboctahedron\n)\n.\nFour more Archimedeans appear in the\nShort book on the five regular solids\n: the truncated cube, the truncated octahedron, the truncated icosahedron and the truncated dodecahedron.\n(\nAll these modern names are due to\nJohannes Kepler\n(1619)\n.\n)\nPiero appears to have been the independent re-discoverer of these six solids. Moreover, the way he describes their properties makes it clear that he has in fact invented the notion of truncation in its modern mathematical sense.\nOn perspective for painting\nis the first treatise to deal with the mathematics of perspective, a technique for giving an appearance of the third dimension in two-dimensional works such as paintings or sculptured reliefs. Piero is determined to show that this technique is firmly based on the science of vision\n(\nas it was understood in his time\n)\n. He accordingly starts with a series of mathematical theorems, some taken from the optical work of\nEuclid\n(\npossibly through medieval sources\n)\nbut some original to Piero himself. Some of these theorems are of independent mathematical interest, but on the whole the work is conceived as a manual for teaching painters to draw in perspective, and the detailed drawing instructions are mind-numbing in their repetitiousness. There are many diagrams and illustrations, but unfortunately none of the known manuscripts has illustrations actually drawn by Piero himself.\nNone of Piero's mathematical work was published under his own name in the Renaissance, but it seems to have circulated quite widely in manuscript and became influential through its incorporation into the works of others. Much of Piero's algebra appears in\nPacioli\n's\nSumma\n(1494)\n, much of his work on the Archimedeans appears in\nPacioli\n's\nDe divina proportione\n(1509)\n, and the simpler parts of Piero's perspective treatise were incorporated into almost all subsequent treatises on perspective addressed to painters.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Archimedes",
    "Filippo Brunelleschi",
    "Leone Battista Alberti",
    "THIS LINK",
    "Alberti",
    "Abacus",
    "cuboctahedron",
    "Johannes Kepler",
    "Pacioli"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}