{
  "nome_completo": "Abraham ben Meir ibn Ezra",
  "nome_curto": "Rabbi Ben Ezra",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ezra/",
  "data_nascimento": "1092",
  "local_nascimento": "Tudela, Emirate of Saragossa (now Spain)",
  "data_morte": "1167",
  "local_morte": "Calahorra, Spain",
  "summary": "Rabbi Ben Ezra worked in Islamic Spain and wrote works which introduced Islamic mathematics and Indian number systems to Europe.",
  "biografia": "Rabbi Ben Ezra\nlived in Muslim Spain. Little is known of his life except that he was on friendly terms with the eminent poet and philosopher Judah ha-Levi, whom some historians believe was ibn Ezra's father-in-law. Ibn Ezra made his reputation as a scholar and a poet. It is recorded that during this period of his life, up to\n1140\n, he travelled to North Africa and possibly visited Egypt.\nFrom\n1140\nto\n1160\nibn Ezra's life changed markedly. He was forced to wander throughout Europe during this period and he eventually settled down in Rome, then Lucca, for a few years before his death. It was during this latter period of his life that he composed his most famous works. In addition to his poetry, ibn Ezra wrote on\n[\n7\n]\n:-\n... grammar, exegesis, philosophy, medicine, astronomy, and astrology.\nIn addition to these topics, ibn Ezra wrote on\npermutations\nand\ncombinations\n, the calendar, the\nastrolabe\n, and Biblical studies. He is of particular importance because he spread the learning of the Arabs through Europe at a time when scholarship in Christian Europe had been been neglected for five hundred or more years.\nOf the most interest to us in this archive devoted to the history of mathematics is ibn Ezra's work on numbers. He wrote three treatises on numbers which helped to bring the Indian symbols and ideas of decimal fractions to the attention of some of the learned people in Europe. The\nBook of the Unit\nis a work on the Indian symbols\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n. A second work is the\nBook of the Number\nwhich describes the decimal system for integers with place values from left to right. In this work ibn Ezra uses zero which he calls galgal\n(\nmeaning wheel or circle\n)\n. Despite ibn Ezra's books, these ideas would not become accepted into mainstream European mathematics for several more centuries.\nIbn Ezra translated\nal-Biruni\n's commentary on\nal-Khwarizmi\n's tables and made interesting comments on the introduction of Indian mathematics into Arabic science in the\n8\nth\ncentury. Historians of science try today to quantify precisely how much Arabic mathematics was influenced by knowledge of Indian mathematics, so ibn Ezra's writing on this topic are carefully studied.\nIbn Ezra's writings on grammar and poetry were often motivated by the \"paytanim\"\n[\n2\n]\n:-\nSynagogues began ... to appoint official precentors, part of whose duty it was to compose poetical additions to the liturgy on special Sabbaths and festivals. The authors were called \"paytanim\"\n(\nfrom the Greek poietes, \"poet\"\n)\n, their poems \"piyyutim\". The keynote was messianic fervour and religious exuberance. Besides employing the entire biblical, Mishnaic, and Aramaic vocabularies, the paytanim coined thousands of new words. ... Abraham ibn Ezra... attacked the language and style of the early paytanim; he\n[\nwas\n]\nthe first to use Arabic metres in religious poems.\nIn fact to ibn Ezra there was no conflict between science and religion for he considered that science and astrology were at the basis of Jewish learning\n[\n7\n]\n:-\nFor ibn Ezra revelation and reason are ultimately perfectly congruent. His critical reading of the biblical text and his astrological interpretations of some biblical passages arise from his consistent application of a naturalist and rationalistic exegetical method and express his commitment to the view that rationality is inherent in revelation itself.",
  "matematicos_citados_na_biografia": [
    "permutations",
    "combinations",
    "astrolabe",
    "al-Biruni",
    "al-Khwarizmi"
  ],
  "imagens": [
    "ezra.jpg"
  ]
}