{
  "nome_completo": "Rafael Bombelli",
  "nome_curto": "Rafael Bombelli",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bombelli/",
  "data_nascimento": "January 1526",
  "local_nascimento": "Bologna, Papal States (now Italy)",
  "data_morte": "1572",
  "local_morte": "(probably) Rome, Papal States (now Italy)",
  "summary": "Rafael Bombelli was an Italian mathematician who wrote an influential algebra text and made free use of both negative numbers and complex numbers.",
  "biografia": "Rafael Bombelli\n's father was Antonio Mazzoli but he changed his name from Mazzoli to Bombelli. It is perhaps worth giving a little family background. The Bentivoglio family ruled over Bologna from\n1443\n. Sante Bentivoglio was \"signore\"\n(\nmeaning lord\n)\nof Bologna from\n1443\nand he was succeeded by Giovanni II Bentivoglio who improved the city of Bologna, in particular developing its waterways. The Mazzoli family were supporters of the Bentivoglio family but their fortunes changed when Pope Julius II took control of Bologna in\n1506\n, driving the Bentivoglio family into exile. An attempt to regain control in\n1508\nwas defeated and Antonio Mazzoli's grandfather, like several other supporters of the failed Bentivoglio coup, were executed. The Mazzoli family suffered for many years by having their property confiscated, but the property was returned to Antonio Mazzoli, Rafael Bombelli's father.\nAntonio Mazzoli was able to return to live in Bologna. There he carried on his trade as a wool merchant and married Diamante Scudieri, a tailor's daughter. Rafael Bombelli was their eldest son, and he was one of a family of six children. Rafael received no university education. He was taught by an engineer- architect Pier Francesco Clementi so it is perhaps not too surprising that Bombelli himself should turn to that occupation. Bombelli found himself a patron in Alessandro Rufini who was a Roman noble, later to become the Bishop of Melfi.\nIt is unclear exactly how Bombelli learnt of the leading mathematical works of the day, but of course he lived in the right part of Italy to be involved in the major events surrounding the solution of\ncubic\nand\nquartic equations\n.\nScipione del Ferro\n, the first to solve the cubic equation was the professor at Bologna, Bombelli's home town, but del\nFerro\ndied the year that Bombelli was born. The contest between Fior and\nTartaglia\n(\nsee\nTartaglia\n's biography\n)\ntook place in\n1535\nwhen Bombelli was nine years old, and\nCardan\n's major work on the topic\nArs Magna\nⓉ\n(\nThe great art\n)\nwas published in\n1545\n. Clearly Bombelli had studied\nCardan\n's work and he also followed closely the very public arguments between\nCardan\n,\nFerrari\nand\nTartaglia\nwhich culminated in the contest between\nFerrari\nand\nTartaglia\nin Milan in\n1548\n(\nsee\nFerrari\n's biography for details\n)\n.\nFrom about\n1548\nPier Francesco Clementi, Bombelli's teacher, worked for the Apostolic Camera, a specialised department of the papacy in Rome set up to deal with legal and financial matters. The Apostolic Camera employed Clementi to reclaim marshes near Foligno on the Topino River, southeast of Perugia in central Italy. This region had became part of the Papal States in\n1439\n. It is probable that Bombelli assisted his teacher Clementi with this project, but we have no direct evidence that this was the case. We certainly know that around\n1549\nBombelli became interested in another reclamation project in a neighbouring region.\nIt was in\n1549\nthat Alessandro Rufini, Bombelli's patron, acquired the rights to reclaim that part of the marshes of the Val di Chiana which belonged to the Papal States. The Val di Chiana is a fairly central region in the Tuscan Apennines which was not well drained either by the Arno river which runs north west going through Florence and Pisa to the sea, or by the Tiber which runs south through Rome. By\n1551\nBombelli was in the Val di Chiana recording the boundaries to the land that was to be reclaimed. He worked on this project until\n1555\nwhen there was an interruption to the reclamation work.\nWhile Bombelli was waiting for the Val di Chiana project to recommence, he decided to write an algebra book. He had felt that the reason for the many arguments between leading mathematicians was the lack of a careful exposition of the subject. Only\nCardan\nhad, in Bombelli's opinion, explored the topic in depth and his great masterpiece was not accessible to people without a thorough grasp of mathematics. Bombelli felt that a self-contained text which could be read by those without a high level of mathematical training would be beneficial. He wrote in the preface of his book\n[\n2\n]\n(\nsee also\n[\n3\n]\n)\n:-\nI began by reviewing the majority of those authors who have written on\n[\nalgebra\n]\nup to the present, in order to be able to serve instead of them on the matter, since there are a great many of them.\nBy\n1557\n, the work at Val di Chiana still being suspended, Bombelli had begun writing his algebra text. We will study in detail the contents of the work below. Suffice to say for the moment that, in\n1560\nwhen work at Val di Chiana recommenced, Bombelli had not completed his algebra book.\nWork at the Val di Chiana marshes could not have been far from completion when it had been suspended, for it was completed before the end of\n1560\n. The scheme was a great success and through the project Bombelli gained a high reputation as an hydraulic engineer. In\n1561\nBombelli went to Rome but failed in an attempt to repair the Santa Maria bridge over the Tiber. However, with reputation still high, Bombelli was taken on as a consultant for a project to drain the Pontine Marshes. These marshes in the Lazio region of south-central Italy had been an area where malaria had been a health hazard since the period of the Roman Republic. Several emperors and popes made unsuccessful attempts to reclaim the area but all, including the one which Bombelli acted as consultant on for Pope Pius IV, came to nothing.\n[\nIt was not until\n1928\nthat the Pontine Marshes were finally drained.\n]\nOn one of Bombelli's visits to Rome he made an exciting mathematical discovery. Antonio Maria Pazzi, who taught mathematics at the University of Rome, showed Bombelli a manuscript of\nDiophantus\n's\nArithmetica\nand, after Bombelli had examined it, the two men decided to make a translation. Bombelli wrote in\n[\n2\n]\n(\nsee also\n[\n3\n]\n)\n:-\n...\n[\nwe\n]\n, in order to enrich the world with a work so finely made, decided to translate it and we have translated five of the books\n(\nthere being seven in all\n)\n; the remainder we were not able to finish because of pressure of work on one or other.\nDespite never completing the task, Bombelli began to revise his algebra text in the light of what he had discovered in\nDiophantus\n. In particular,\n143\nof the\n272\nproblems which Bombelli gives in Book III are taken from\nDiophantus\n. Bombelli does not identify which problems are his own and which are due to\nDiophantus\n, but he does give full credit to\nDiophantus\nacknowledging that he has borrowed many of the problems given in his text from the\nArithmetica\n.\nBombelli's\nAlgebra\nwas intended to be in five books. The first three were published in\n1572\nand at the end of the third book he wrote that\n[\n1\n]\n:-\n... the geometrical part, Books IV and V, is not yet ready for the publisher, but its publication will follow shortly.\nUnfortunately Bombelli was never able to complete these last two volumes for he died shortly after the publication of the first three volumes. In\n1923\n, however, Bombelli's manuscript was discovered in a library in Bologna by Bortolotti. As well as a manuscript version of the three published books, there was the unfinished manuscript of the other two books. Bortolotti published the incomplete geometrical part of Bombelli's work in\n1929\n. Some results from Bombelli's incomplete Book IV are also described in\n[\n17\n]\nwhere author remarks that Bombelli's methods are related to the geometrical procedures of\nOmar Khayyam\n.\nBombelli's\nAlgebra\ngives a thorough account of the algebra then known and includes Bombelli's important contribution to complex numbers. Before looking at his remarkable contribution to complex numbers we should remark that Bombelli first wrote down how to calculate with negative numbers. He wrote\n(\nsee\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nPlus times plus makes plus\nMinus times minus makes plus\nPlus times minus makes minus\nMinus times plus makes minus\nPlus\n8\ntimes plus\n8\nmakes plus\n64\nMinus\n5\ntimes minus\n6\nmakes plus\n30\nMinus\n4\ntimes plus\n5\nmakes minus\n20\nPlus\n5\ntimes minus\n4\nmakes minus\n20\nAs Crossley notes in\n[\n3\n]\n:-\nBombelli is explicitly working with signed numbers. He has no reservations about doing this, even though in the problems he subsequently treats he neglects possible negative solutions.\nIn Bombelli's\nAlgebra\nthere is even a geometric proof that minus time minus makes plus; something which causes many people difficulty even today despite our mathematical sophistication.\nBombelli, himself, did not find working with complex numbers easy at first, writing in\n[\n2\n]\n(\nsee also\n[\n3\n]\n)\n:-\nAnd although to many this will appear an extravagant thing, because even I held this opinion some time ago, since it appeared to me more sophistic than true, nevertheless I searched hard and found the demonstration, which will be noted below. ... But let the reader apply all his strength of mind, for\n[\notherwise\n]\neven he will find himself deceived.\nBombelli was the first person to write down the rules for addition, subtraction and multiplication of complex numbers. He writes\n√\n−\nn\n√-n\n√\n−\nn\nas \"plus of minus\",\n−\n√\n−\nn\n-√-n\n−\n√\n−\nn\nas \"minus of minus\", and gives rules such as\n(\nsee\n[\n2\n]\nor\n[\n3\n]\n)\n:-\nPlus of minus times plus of minus makes minus\n[\n+\n√\n−\nn\n×\n+\n√\n−\nn\n=\n−\nn\n+√-n \\times  +√-n = -n\n+\n√\n−\nn\n×\n+\n√\n−\nn\n=\n−\nn\n]\nPlus of minus times minus of minus makes plus\n[\n+\n√\n−\nn\n×\n−\n√\n−\nn\n=\n+\nn\n+√-n \\times  -√-n = +n\n+\n√\n−\nn\n×\n−\n√\n−\nn\n=\n+\nn\n]\nMinus of minus times plus of minus makes plus\n[\n−\n√\n−\nn\n×\n+\n√\n−\nn\n=\n+\nn\n-√-n \\times  +√-n = +n\n−\n√\n−\nn\n×\n+\n√\n−\nn\n=\n+\nn\n]\nMinus of minus times minus of minus makes minus\n[\n−\n√\n−\nn\n×\n−\n√\n−\nn\n=\n−\nn\n-√-n \\times  -√-n = -n\n−\n√\n−\nn\n×\n−\n√\n−\nn\n=\n−\nn\n]\nAfter giving this description of multiplication of complex numbers, Bombelli went on to give rules for adding and subtracting them.\nHe then showed that, using his calculus of complex numbers, correct real solutions could be obtained from the\nCardan\n-\nTartaglia\nformula for the solution to a cubic even when the formula gave an expression involving the square roots of negative numbers.\nFinally we should make some comments on Bombelli's notation. Although authors such as\nPacioli\nhad made limited use of notation, others such as\nCardan\nhad used no symbols at all. Bombelli, however, used quite sophisticated notation. It is worth remarking that the printed version of his book uses a slightly different notation from his manuscript, and this is not really surprising for there were problems printing mathematical notation which to some extent limited the type of notation which could be used in print.\nHere are some examples of Bombelli's notation.\nDespite the delay in publication, Bombelli's\nAlgebra\nwas a very influential work and led to\nLeibniz\npraising Bombelli saying he was an:-\n... outstanding master of the analytical art.\nJayawardene writes in\n[\n1\n]\nthat in his treatment of complex numbers Bombelli:-\n... showed himself to be far ahead of his time, for his treatment was almost that followed today.\nCrossley writes in\n[\n3\n]\n:-\nThus we have an engineer, Bombelli, making practical use of complex numbers perhaps because they gave him useful results, while\nCardan\nfound the square roots of negative numbers useless. Bombelli is the first to give a treatment of any complex numbers... It is remarkable how thorough he is in his presentation of the laws of calculation of complex numbers...\nIt seems to be quite fair to describe Bombelli as the inventor of complex numbers. Nobody before him had given rules for working with such numbers, nor had they suggested that working with such numbers might prove useful.\nDieudonné\ndoes not appear to agree with this assessment, however, for in his review of\n[\n5\n]\nand\n[\n6\n]\n, he writes:-\n... imaginaries had been used long before Bombelli's book, and it is therefore not quite justified to call him the \"first discoverer\" of complex numbers.\nI\n[\nEFR\n]\nfeel that\nDieudonné\nis wrong here as I believe he is when he writes that Bombelli's\nAlgebra\n... did not sell very well, nor apparently did it have much influence on later developments.\nI think that Bombelli's\nAlgebra\nis one of the most remarkable achievements of\n16\nth\ncentury mathematics, and he must be credited with understanding the importance of complex numbers at a time when clearly nobody else did.",
  "matematicos_citados_na_biografia": [
    "cubic",
    "quartic equations",
    "Scipione del Ferro",
    "Ferro",
    "Tartaglia",
    "Cardan",
    "Ferrari",
    "Diophantus",
    "Omar Khayyam",
    "Pacioli",
    "Leibniz",
    "Dieudonné"
  ],
  "imagens": [
    "thumbnail.jpg",
    "../../Diagrams/Bombelli.gif"
  ]
}