{
  "nome_completo": "Rajeev Motwani",
  "nome_curto": "Rajeev Motwani",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Motwani/",
  "data_nascimento": "26 March 1962",
  "local_nascimento": "Jammu, Jammu and Kashmir, India",
  "data_morte": "5 June 2009",
  "local_morte": "Atherton, San Mateo County, California, USA",
  "summary": "Rajeev Motwani was an Indian-born American computer scientist whose research focused on theoretical computer science and is known for his contribution to the Google search engine.",
  "biografia": "Rajeev Motwani\n's father, Hotchand Motwani, was a Lieutenant Colonel in the Indian army. His mother was Namita Sushila and he had two brothers Sanjeev and Suneev. His father's job meant that the family moved from place to place as Rajeev was growing up, never spending more than two years in any one place. However, education was important to the Motwani family and Rajeev always attended the best missionary school in the town in which they were living. Prabhakar Raghavan writes of Rajeev's love of reading when he was a child\n[\n5\n]\n:-\nThose who knew Rajeev as a young boy remember him as an avid reader. When Rajeev was seven, his father was stationed in the scenic town of Devlali near Mumbai, India. His family would walk a kilometer to the local library to get books, and the seven-year-old Rajeev would be seen reading the books they had borrowed from the library as they walked home! His brothers recall that not a single day would pass when he did not read a whole book. Rajeev would read books of all types, including novels, comics, autobiographies and scientific books.\nIn\n1974\n, when Rajeev was twelve years old, the family settled down in New Delhi. His father wanted the best possible education for his sons so Rajeev sat the entrance examinations to the prestigious St Columba's High School. The principal, Brother J N Foley, was so impressed with Rajeev's performance, particularly in mathematics, that he admitted all three Motwani boys to the High School. Motwani explained where his love of mathematics came from in an interview\n[\n4\n]\n:-\nThis was partly shaped by the books I had at home. My parents for some reason had a lot of these books -\n10\ngreat scientists or five famous mathematicians - their life story and so on. As a child, whatever heroes you read about you want to become.\nOne of his fellow students at the High School wrote about Motwani\n[\n9\n]\n:-\nRajeev and I were classmates is St Columba's High School in New Delhi over\n30\nyears ago. Of course he was a brilliant maths whiz even back then, but what struck me the most is how vividly I remember how much he used to help me and other classmates understand the complex problems that were a bit beyond our grasp.\nHe did not graduate from St Columba's High School but in\n1978\n, one year before completing the course, he sat the entrance examinations for the Indian Institutes of Technology. He had wanted to study mathematics and become a mathematician but his parents had persuaded him that there was no money in mathematics but he should go into the new area of computer science. The Indian Institute of Technology in Kanpur, had been established in\n1959\n, and was the first in India to offer courses in Computer Science. The first such courses were established in the Electrical Engineering department in\n1963\nand, in\n1971\n, it began teaching a programme of Computer Science and Engineering leading to a Master's degree, the M.Tech. Motwani began studying for his B.Tech. in Computer Science and Engineering in\n1978\n. He was taught programming by Kesav Nori who was a great influence on him\n[\n8\n]\n:-\nNori had just come back from Europe. He stayed for a year or so and taught the first course in programming. He was a wonderful teacher and used to tell great stories. ... Nori ... was a very inspiring person. He did more than just teaching. He created such a wonderful ecosystem and developed a personal connection with his students.\nMotwani enjoyed himself at the Indian Institute of Technology. He had been sad not to be studying mathematics but this changed to happiness when he realised that mathematics featured in most things he was studying. He also enjoyed himself socially, playing bridge, playing volleyball, and partying with friends. He also read large numbers of science-fiction books and spent hours solving crossword puzzles. He graduated with a B.Tech. in\n1983\nand was offered a scholarship by the University of California at Berkeley to read for a Ph.D. His thesis advisor at Berkeley was Richard Karp. He explained in\n[\n8\n]\nthat he did not work at first:-\n[\nBerkeley\n]\nwas a very politically oriented university. .... Ronald Reagan was the president then. So then for\n3\nyears I had a blast. Did not do any work and fully enjoyed the environment. My advisor was Richard Karp, who won the\nTuring\naward - which is like the Nobel Prize in computer science in\n1985\n-\n86\n, when I had finished those\n3\nyears. It was then that I thought that I was not doing anything and letting this man down. So from then on I worked really hard and was quite productive for the next two years.\nMotwani was awarded a Ph.D. in\n1988\nby Berkeley for his thesis\nProbabilistic Analysis of Matching and network flow Algorithms\n.\nDonald Knuth\nvisited Berkeley around the time that Motwani was completing his thesis. After taking advice from Richard Karp,\nKnuth\noffered Motwani a one-year position at Stanford University. Motwani accepted and began teaching at Stanford in the autumn of\n1988\n. Seffi Naor writes\n[\n9\n]\n:-\nI first met Rajeev when I came to Stanford in\n1988\n. We were both young researchers and Rajeev struck me from the beginning as brilliant, very knowledgeable, and having broad interests. Working with him, he was always full of new ideas, prolific, but also very calm and mature. He was very ambitious of course, yet I never felt that he was in any way competitive. He had a very quiet self confidence which reflected on everyone around him. I felt very fortunate to have collaborated with him.\nSoon after arriving in Stanford, Motwani met Asha Jadeja who had moved to the San Francisco Bay area after graduating from the University of Southern California. They were married on\n22\nMarch\n1990\nin Delhi; they had two daughters Naitri and Anya. Motwani was happy at Stanford and the University was very pleased with his work during the year, so when they offered him a permanent position he was happy to accept. His papers which were published in these early years and were reviewed in\nMathematical Reviews\n, include the following multi-authored works:\nDeferred data structuring\n(1988)\n;\nCovering orthogonal polygons with star polygons: the perfect graph approach\n(1988)\n;\nPerfect graphs and orthogonally convex covers\n(1989)\n; and\nA linear time approach to the set maxima problem\n(1992)\n. In\n1995\n, in collaboration with Prabhakar Raghavan, he published the book\nRandomized algorithms\n. Mark Jerrum reviewed the book:-\nThat there might be profit in extending the classical notion of computation to encompass random choice was a fundamental insight. The potential value of this extension became apparent in the mid-\n1970\ns with the discovery, by Rabin, and Solovay and\nStrassen\n, of fast primality tests based on the construction of \"dense witnesses\" to compositeness. It is only in the last decade or so, however, that most of us have come to appreciate the true importance of the role of randomness in the study of computation. Today, it seems that randomness has contributed at least as much to computer science - surprising results, exciting new techniques, and practical algorithms - as that other extension to classical computation, namely, parallelism. But whereas there have been several books on parallel computation\n(\nthough fewer good ones\n)\n, Motwani and Raghavan's is the first textbook, to the best of the reviewer's knowledge, devoted to randomised algorithms. The new book arrives at a strategic moment, for it is still just possible to cover in a single volume all the main aspects of the topic. ... Even though the pace is often rapid, the authors have succeeded in making the material accessible. By emphasising the role of a number of key ideas and techniques, they have elucidated the structure of the subject matter and imparted a satisfactory shape to the book. ... This is an authoritative work by researchers active in the field. The book is welcome as a reference work, as a source book for algorithmic ideas, and as a graduate-level course text.\n(\nMy guess is that the material is too advanced for any but the most exceptional undergraduate class.\n)\nJohn Hopcroft and Jeff Ullman published their classic book\nIntroduction to Automata Theory, Languages, and Computation\nin\n1979\n. Motwani used this book in courses he taught at Stanford and he had made such excellent contributions to the areas that he was invited to join the two original authors in a rewritten second edition of the book. This appeared in\n2000\nwith a third edition of the now three-author work appearing in\n2006\n.\nMotwani was an inspiring lecturer. Here are some quotes from\n[\n9\n]\nby people who attended his lectures. Aleksandra Korolova writes:-\nAt the time when I started graduate school, I was somewhat unexcited about theoretical Computer Science, and it was Rajeev's Randomized Algorithms class that made me fall in love with theory again. His lectures were so perfectly crafted, from the progression of describing a simple approach providing the intuition to generalizing it, to doing an impeccable formal analysis, to the perfect board technique, that I left every lecture excited about a new powerful topic that I have just learned and understood. Rajeev could be covering the contents of a few serious research papers in one lecture but in his presentation, understanding them was both effortless and insightful.\nNeha Kumar writes:-\nAs a researcher and technologist, Rajeev was brilliant - words could do little justice in describing his immense influence. As a teacher, he was awe-inspiring - carrying with him an equanimity and cheerfulness that remained undisturbed through every lecture. As a student advisor, he was kind and supportive - never impatient or proud\n(\nthough he may have had every reason to be so\n)\n. As a supervisor, he was trusting and understanding. Most of all, however, his immense stature never came in the way of his friendly, smiling disposition ...\nIn\n[\n5\n]\nMotwani's research contributions are detailed:-\nRajeev Motwani's great interest in fundamental problems of theoretical computer science and a keen interest and awareness of applications sets him apart as a rarity among theoretical computer scientists. He repeatedly exhibited a grasp of issues affecting many areas of computing, and actively sought out and influenced new applications of his theoretical ideas.\nIn this article his research is looked at in detail. We give here the section headings under which his research is discussed: Algorithmic combinatorics and graph theory; Probabilistically Checkable Proofs; Approximation algorithms; Randomized geometric algorithms; Data mining and information retrieval; Similarity search; and Streaming algorithms.\nPerhaps Motwani is most famous for the contributions he made to developing the search engine Google. He described in detail in\n[\n8\n]\nhow this came about. We give a short extract:-\nWe formed this research group called Midas which stood for Mining Data At Stanford. We did a lot of good work on data mining. Then there was this guy called Larry Page who wasn't really a part of the Midas group but was a friend of Sergey Brin\n[\nwho was part of the group\n]\nand would show up for these meetings. He was working on this very cool idea of doing random walks on the web. When I understood what the World Wide Web would look like, I knew I had to somehow force randomness into it. When Larry showed us what he was doing, it was like a complete epiphany, we thought it was absolutely the right thing to do. So Sergey got involved and it became a sub group inside Midas. I was really a good sounding board for Sergey and Larry and I could relate to what they were doing through randomness.\nMotwani, together with Sergey Brin, Larry Page and Terry Winograd, published the paper\nThe PageRank Citation Ranking: Bringing Order to the Web\nin\n1998\n. They explained in the paper:-\nIn this paper, we take advantage of the link structure of the Web to produce a global \"importance\" ranking of every web page. This ranking, called PageRank, helps search engines and users quickly make sense of the vast heterogeneity of the World Wide Web.\nAlso in\n1998\n, the same four authors published the paper\nWhat Can You Do With A Web In Your Pocket\n. In it they announce that they have developed Google:-\nWe have developed a global ranking of web pages called PageRank based on the link structure of the web that has properties that are useful for search and navigation ... We have used PageRank to develop a novel search engine called Google, which also makes heavy use of anchor text.\nGoogle was certainly not the only highly successful startup that Motwani assisted, with his technical skills, with his encouragement, and often with his financial support.\nMotwani died in a tragic drowning accident in the swimming pool at his home. He was\n47\nyears old and at the height of his career. Motwani received many honours for his outstanding contribution and it is clear that, but for his premature death, he would have received many more. He received the Bergmann Memorial Award from the US-Israel Bi-National Science Foundation\n(1993)\n, the IBM Faculty Development Award\n(1994)\n, the IBM Faculty Partnership Award\n(1995)\n, the Indian Institute of Technology Alumni Leadership Award\n(2001)\n, the\nGödel\nPrize\n(2001)\n, and the Distinguished Alumnus Award from the Indian Institute of Technology Kanpur\n(2006)\n.\nPerhaps the best tribute to Motwani is not to quote from the many heartfelt messages that were received after his death, but rather to quote from the acknowledgement that his student Chandra Chekuri wrote in his Ph.D. thesis in\n1998\n:-\nRajeev accepted me as a student when I was unsure of my interests and capabilities and gave me direction by suggesting concrete open problems. The many hours he spent with me in my first few years here, when I needed his time the most, have contributed much to my scholarship. I express my sincere thanks to him for his support, guidance and wisdom. His persistence in tackling problems, confidence, and great teaching will always be an inspiration to me.",
  "matematicos_citados_na_biografia": [
    "Turing",
    "Donald Knuth",
    "Knuth",
    "Strassen",
    "Gödel"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}