{
  "nome_completo": "Ralph Hartzler Fox",
  "nome_curto": "Ralph Fox",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fox_Ralph/",
  "data_nascimento": "24 March 1913",
  "local_nascimento": "Morrisville, Pennsylvania, USA",
  "data_morte": "23 December 1973",
  "local_morte": "Philadelphia, USA",
  "summary": "Ralph Fox was an American mathematician who made important contributions to differential topology and knot theory.",
  "biografia": "Ralph Fox\nwas born into a Quaker family. He was educated at home and did not attend school. When he was an adult he was called to testify in favour of the soundness of home education at a court case in Virginia; he certainly provided a good example that such an education can be highly effective. He was a very musical child and showed an extraordinary talent as a pianist. He began his formal education at Swarthmore College, originally founded by Quakers, in Swarthmore, Pennsylvania, but at the same time he studied piano at the Leefson-Hille Conservatory of Music in Philadelphia. In fact Swarthmore is less than\n20\nkm from Philadelphia, so geographically this was not difficult, and Fox continued with these two studies for two years.\nAfter taking his first degree from Swarthmore, Fox went to Johns Hopkins University where he studied for a Master's Degree in mathematics before going to Princeton where he undertook research advised by the topologist\nSolomon Lefschetz\n. He also became an expert in the board game of Go while at Princeton\n(\nhe later represented the United States in the first international Go tournament in Tokyo in\n1963)\n. He graduated with a Ph.D. from Princeton in\n1939\nafter submitting his thesis\nOn the Lusternik Schnirelmann Category\n. In this work he made an extensive study of the category of subsets of a space, and the relation to homotopy and homology properties. The thesis contains theorems on homotopy properties of mappings, particularly of mappings of sets into absolute neighbourhood retracts. Relations with the \"category\" of a set, and with particular deformations, \"expansions,\" are studied. He published a number of papers related to the work he had undertaken for his doctorate:\nOn homotopy and extension of mappings\n(1940)\n,\nOn the Lusternik-Schnirelmann category\n(1941)\n,\nExtension of homeomorphisms into Euclidean and Hilbert parallelotopes\n(1941)\n, and\nTopological invariants of the Lusternik-Schnirelmann type\n(1941)\n.\nWhile he was a student, Fox had married Cynthia Atkinson; they had one son Robin. Fox spent the year after the award of his doctorate at the Institute for Advanced Studies at Princeton. Then he was appointed to the University of Illinois, moving to a position at Syracuse University before returning to Princeton in\n1945\n. He remained on the Princeton University faculty for the rest of his life. The year after Fox was appointed as a lecturer at Princeton,\nEmil Artin\nleft Indiana University at Bloomington and was appointed to Princeton.\nArtin\nhad worked on the braid group as early as the\n1920\ns, publishing a fundamental paper on the topic in\n1926\n. After arriving in Princeton he began to think again about braids and he began working with Fox on certain topological ideas. They published the joint paper\nSome wild cells and spheres in three-dimensional space\n(1948)\n. Epple writes\n[\n1\n]\n:-\nOn the one hand, they asked for a clear delineation of the domain of knot theory within three dimensional topology; on the other, it hinted as a relation between the complements of\n(\nmaybe wild\n)\nknots or knotted arcs and the\nPoincaré\nconjecture.\nFox became the leader of a very active group of young mathematicians at Princeton studying knots, links and three dimensional topology. In\n1950\nthe International Congress of Mathematicians took place in Cambridge, Massachusetts, and Fox was an invited speaker giving the lecture\nRecent development of knot theory at Princeton\non the work of his Princeton group. In this lecture he pointed the way towards the new approach that they were taking:-\n... classical knot theory tends, by its narrowness, to isolate the subject from the rest of topology. It is hoped that the various special theorems which make up classical knot theory will eventually turn out to be particular cases of general topological theorems. In working towards this end the following principles seem obvious:\n(\nA\n)\nThe class of polygons should be replaced by a suitable topologically defined class of curves. ...\n(\nB\n)\nEuclidean\n3\n-space should be replaced by other compact\n3\n-manifolds. ...\nIn the same talk he reported on work of his Princeton group on the algebraic structure of the knot group and presentations of this group. These ideas had not been published at the time Fox gave this talk but over the next few years he published them in a number of important articles. He also mentioned in his talk to the International Congress of Mathematicians his ideas on how to study group presentations using the \"free differential calculus.\" Five papers on this topic appeared over the following ten years:\nFree differential calculus. I. Derivation in the free group ring\n(1953)\n;\nFree differential calculus. II. The isomorphism problem of groups\n(1954)\n;\nFree differential calculus. III. Subgroups\n(1956)\n;\n(\nwith\nRoger Lyndon\nand\nKuo-Tsai Chen\n)\nFree differential calculus. IV. The quotient groups of the lower central series\n(1958)\n; and\nFree differential calculus. V. The Alexander matrices re-examined\n(1960)\n. In the same\n1950\nlecture, Fox reported on work by his young student\nJohn Milnor\non the total curvature of a knot.\nMilnor\nhad, at this time, only just begun research for his doctorate which he was awarded in\n1954\n.\nIn the summer of\n1951\n, Fox went to the Mathematics Institute of the Universidad Nacional Autónoma de México in Mexico City where he gave a series of lectures, supported by a Guggenheim Fellowship. This was part of a year of festivities which the university organised to celebrate the Fourth Centenary of the Royal Pontifical University of Mexico. During these celebrations the university awarded honorary degrees to several leading mathematicians including\nGarret Birkhoff\n,\nSolomon Lefschetz\nand\nNorbert Wiener\n. A Fulbright grant allowed Fox to lecture at the Universities of Delft and Stockholm in\n1952\n. In the following year he lectured to the Summer Seminar of the\nCanadian Mathematical Society\n.\nIn the spring of\n1956\nFox was invited to give a series of lectures at Haverford College\n(\nan institution founded on Quaker values on a campus just outside Philadelphia\n)\nunder the Philips Lecture Program.The Philips Grant consists of funds left by Haverford alumnus William Pyle Philips\n(\nwho graduated in\n1902)\nfor\n(\ni\n)\nthe purchase of rare books which the college would not otherwise buy and\n(\nii\n)\nto invite distinguished scientists and statesmen to Haverford.\nNiels Bohr\n,\nEnrico Fermi\nand\nErwin Schrödinger\nhad earlier been invited as Philips Lecturers. Fox's lectures were written up as a book, with Richard Crowell, a doctoral student of Fox's who was awarded his doctorate in\n1955\n, as co-author. The book\nIntroduction to knot theory\nwas published in\n1963\nand became a classic being reprinted in\n1977\n. A Russian translation had been published in\n1967\n. Lee Neuwirth writes in a review of the\n1963\nedition:-\nThis book is in many ways a very surprising work. In the first place it places topology, algebraic topology and knot theory in the position of solving a \"practical problem''. ... In the second place, for a very innocent task, namely distinguishing knots, a quite respectable amount of interesting and sophisticated mathematics is introduced. ... In the third place, while there is a great emphasis on practicality, and informal discussion prior to making a definition or proof is frequent, there is no sacrifice of rigour. This book is on the side of formality for necessity's sake, rather than formality for its own sake.\nH F Trotter begins his review\n[\n5\n]\nby explaining what knot theory attempts to solve:-\nIt is a famous theorem that any two embeddings of a circle in the plane are topologically equivalent. In contrast, it is intuitively obvious that a circle embedded in three-dimensional space can be knotted in many different ways. Mathematical curiosity at once prompts the question: \"How can two knots be proved to be really different?\" This natural and apparently innocuous question poses the central problem of knot theory and leads to algebraic developments of surprising variety and richness. The authors have succeeded admirably in their purpose of providing an introduction to this fascinating subject at a level accessible to graduate students and advanced undergraduates.\nIt was Fox's work on the braid group that formed the starting point for\nJoan Birman\n's doctoral dissertation of\n1968\nas her abstract shows:-\nIn\n1962\nR H Fox introduced a new definition of the braid group as the fundamental group of the space of\nn\nn\nn\nunordered distinct points of the Euclidean plane. Fox's definition suggested a natural generalization to the concept of a braid group on an arbitrary manifold, as the fundamental group of the space of\nn\nn\nn\nunordered, distinct points of that manifold. The present investigation begins with Fox's definition, and studies the algebraic and geometric properties of these braid groups on arbitrary manifolds.\nVisits by Fox to many places around the world proved important for research collaborations but none more so than his visits to Japan\n(\nsee, for example\n[\n3\n]\nand\n[\n4\n]\n)\n. As a result of these visits, several Japanese knot theorists visited Princeton to collaborate with Fox's group there. In fact Fox was very friendly and encouraging toward all young topologists and many of them received invitations to visit Princeton. His first visit to Japan was, as we mentioned above, as an American representative to the World Go tournament in October\n1963\n. While he was in Japan the universities of Tokyo, Osaka, Nagoya, Kyoto and Fukuoka all issued invitations to him to lecture on knot theory.\nLee Neuwirth, from whom we quoted above, was one of Fox's doctoral students, being awarded a Ph.D. in\n1959\n. Other doctoral students of Fox with biographies in this archive include\nJohn Stallings\n(\nPh.D.\n1959)\nand\nBarry Mazur\n(\nPh.D.\n1959)\n. Fox's health deteriorated and in\n1973\nhe entered the University of Pennsylvania Graduate Hospital to undergo open-heart surgery. He died in the hospital following surgery. Following his death Lee Neuwirth edited Introduction to\nKnots, Groups, and\n3\n-manifolds, papers dedicated to the memory of R H Fox\nwhich was published by\nPrinceton University Press\nin\n1975\n. Neuwirth gives the following fine tribute to Fox in the Introduction\n[\n2\n]\n:-\nThe influence of a great teacher and a superb mathematician is measured by his published works, the published works of his students, and perhaps foremost, the mathematical environment he fostered and helped to maintain. In this last regard Ralph Fox's life was particularly striking: the tradition of topology at Princeton owes much to his lively and highly imaginative presence. Ralph Fox had well defined tastes in mathematics. Although he was not generally sympathetic towards topological abstractions, when questions requiring geometric intuition or algebraic manipulations arose, it was his insights and guidance that stimulated deepened understanding and provoked the development of countless theorems.\nLet us end this biography by quoting the tongue-in-cheek advice that Fox gave\nJoan Birman\nwhen she complained that she was having to serve on too many committees. He said:-\nSpeak often and not to the point, and soon they will drop you from all the committees.",
  "matematicos_citados_na_biografia": [
    "Solomon Lefschetz",
    "Emil Artin",
    "Artin",
    "Poincaré",
    "Roger Lyndon",
    "Kuo-Tsai Chen",
    "John Milnor",
    "Milnor",
    "Garret Birkhoff",
    "Norbert Wiener",
    "Canadian Mathematical Society",
    "Niels Bohr",
    "Enrico Fermi",
    "Erwin Schrödinger",
    "Joan Birman",
    "John Stallings",
    "Barry Mazur"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}