{
  "nome_completo": "Raphael Mitchel Robinson",
  "nome_curto": "Raphael Robinson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Robinson_Raphael/",
  "data_nascimento": "2 November 1911",
  "local_nascimento": "National City, California, USA",
  "data_morte": "27 January 1995",
  "local_morte": "Berkeley, California, USA",
  "summary": "Raphael Robinson was an American mathematician who was interested in a wide variety of problems including number theory and tilings.",
  "biografia": "Raphael Robinson\n's mother was Bessie Stevenson and his father was Bertram H Robinson. Bertram was a lawyer who travelled from place to place. He gave his sons romantic names, Raphael being the name he gave to the youngest of his four children, which was in keeping with his nature and his love of poetry. However his desire to move around eventually saw him move on and leave Bessie to bring up the family on her own. Bessie was a school teacher who taught in an elementary school and had to work very hard to give her children a good education.\nRobinson entered the University of California at Berkeley from where he graduated with a B.A. in\n1932\nand an M.A. in the following year. He undertook research in complex analysis supervised by John McDonald and he was awarded a Ph.D. in December\n1934\nfor his thesis\nSome results in the theory of Schlicht functions\n.\nThe Great Depression began in\n1929\nwhile Robinson was an undergraduate and by\n1932\n, when he graduated with a B.A., one quarter of the workers in the United States were unemployed. The Depression lasted for around ten years so when Robinson began to look for a post in\n1935\nthere was still a great scarcity of college positions and those which did exist paid very low wages. He was offered a half-time position at Brown University as an instructor which he accepted despite the fact that it really did not pay enough for him to survive. Indeed he suffered great hardship for two years and as a result of the poverty he suffered from tuberculosis. By\n1937\nemployment opportunities were improving and Robinson was offered a full-time instructorship at Berkeley which he gladly accepted.\nIn\n1939\nRobinson taught a course in number theory and one of his students was\nJulia Bowman\n. Raphael and Julia began going for walks together; on these he would teach her more mathematics which she found very exciting. When Bowman's job applications failed,\nNeyman\nfound a small amount of money to allow her to stay on at Berkeley as his assistant and in\n1941\nshe was awarded her M.A. By this time Raphael and Julia planned to marry so Julia turned down a civil service job to remain at Berkeley as a teaching assistant. Raphael married Julia on\n22\nDecember\n1941\nbut after this she was no longer allowed to teach in the mathematics department since Raphael was on the mathematics staff. Many years later\nJulia Robinson\nspoke about her husband:-\nHe taught me and has continued to teach me, has encouraged me, and has supported me in many ways.\nRobinson was steadily promoted, becoming a full professor in\n1949\n. He remained on the Faculty at Berkeley until he retired in\n1973\n.\nWe record details of his character and interests as given in an obituary written by John Addison, David Gale, Leon Henkin, and Constance Reid:-\nAt the age of\n61\n, when \"early retirement\" was not yet a popular option, Raphael chose to retire - at considerable financial sacrifice - so that he could devote more time to mathematics. Even in retirement Robinson owned no casual clothes. His pleasures were sedentary. He enjoyed challenging table games, novels as well as non-fiction, old movies, and the verse of Ogden Nash\n(\non occasion turning out efforts of his own in that genre\n)\n. He was a generous donor to many causes and a thorough reader of the Chronicle, the New Yorker, and the Nation as well as\nMartin Gardner\n's columns and selected comic strips. He was also a faithful contributor to the Problems Section of the American Mathematical Monthly. What the section editor described as \"a beautiful short paper\" of his was accepted for publication just days before his death.\nJulia Robinson died in July\n1985\nand, in the following year, Raphael established the Julia Bowman Robinson Fund for fellowships for graduate students in mathematics at Berkeley. On\n4\nDecember\n1994\nRobinson suffered a stroke from which he never recovered, dying eight weeks later.\nRobinson worked on a wide variety of mathematical topics. His doctoral dissertation was on complex analysis, but he also worked on logic, set theory, geometry, number theory, and combinatorics. In\n1939\nhe published\nOn numerical bounds in\nSchottky\n's theorem\nin the\nBulletin of the American Mathematical Society\n, and in the following year published\nOn the mean values of an analytic function\nin the same journal.\nAs an example of another of his early papers let us say a little about\nThe approximation of irrational numbers by fractions with odd or even terms\nwhich he published in the\nDuke Mathematical Journal\nin\n1940\n. The paper looks at a problem first studied by\nHurwitz\nin\n1891\n, namely to approximate an irrational number\nx\nx\nx\nby rational numbers\nA\nB\n\\large\\frac{A}{B}\\normalsize\nB\nA\n​\nsubject to the condition of\n∣\nx\n−\nA\nB\n∣\n<\n1\nm\nB\n2\n| x - \\large\\frac{A}{B}\\normalsize  | < \\large\\frac{1}{mB^{2}\\normalsize}\n∣\nx\n−\nB\nA\n​\n∣\n<\nm\nB\n2\n1\n​\nfor various values of\nm\nm\nm\n. Robinson obtains best possible results using methods involving continued fractions, their convergents and their secondary convergents.\nA typical paper on logic was\nFinite sequences of classes\nwhich appeared in\n1945\n. He made a major contribution to the study of the foundations of mathematics, in particular the study of undecidable theories. In a series of papers Robinson showed that a number of mathematical theories are undecidable. He also examined the concept of 'essentially undecidable' introduced by\nTarski\n, and answered an important open question by constructing a theory with a finite number of axioms that is essentially undecidable. In\n1953\nTarski\n, together with Robinson and\nMostowski\n, published\nUndecidable theories\n. G Kreisel writes:-\nThe book gives an introductory account of the methods introduced by\nTarski\nfor establishing the undecidability of several fairly simple branches of mathematics\n(\ngroup theory, lattices, abstract projective geometry, closure algebras and others\n)\n. The methods and aims of this work are probably more easily intelligible and more interesting to the 'ordinary' mathematician than those of any other branch of mathematical logic.\nAs we mentioned above, Robinson worked in number theory and he used the earliest computers to obtain results. He coded the\nLucas\ntest for primality and tested whether\n2\nn\n−\n1\n2^{n} - 1\n2\nn\n−\n1\nwas prime for all primes\nn\n<\n2304\nn < 2304\nn\n<\n2\n3\n0\n4\non the SWAC computer. He gave his results in\nMersenne and Fermat numbers\npublished in the\nProceedings of the American Mathematical Society\nin\n1954\n. These showed that these\nMersenne\nnumbers were all composite except for the seventeen values:\nn\nn\nn\n=\n2\n,\n3\n,\n5\n,\n7\n,\n13\n,\n17\n,\n19\n,\n31\n,\n61\n,\n89\n,\n107\n,\n127\n,\n521\n,\n607\n,\n1279\n,\n2203\n,\n2281\n, for which\n2\nn\n−\n1\n2^{n} - 1\n2\nn\n−\n1\nis a prime. At the time that Robinson wrote this paper the last five of these primes were larger than any that had previously been found.\nA number theory colleague wrote the following about Robinson's number theory papers:-\nIn an age where most of our journals are filled with papers which\n(\neven if good\n)\nexploit theories for their own sake ... it is refreshing and stimulating to encounter one of Robinson's papers. In each of them he takes a problem, old or new, which can be stated in simple and intelligible terms, and either solves it, or at least adds much that is new. His scholarship is impeccable; it is plain that he never writes until he has thought deeply, and until he has sought out every relevant piece of existing knowledge.\nAnother major interest was tilings of the plane. In a major paper\nUndecidability and nonperiodicity for tilings of the plane\npublished in\n1971\n, Robinson continued to study problems of a kind that he had examined for a long while. D A Klarner writes in a review:-\nThis paper not only makes a considerable contribution in simplifying a tangled body of theory; it is wonderfully clear in exposition. The general mathematical reader will take pleasure in reading this paper; it is a remarkable piece of work.\nIn fact Robinson had already made a substantial contribution to problems of this type in earlier papers. We give a description of the type of problems Robinson was considering:-\nImagine the plane cut with two sets of parallel lines into an infinite grid of unit squares called cells. These cells are to be filled with translates of unit squares called tiles. A tile is a unit square cut with its diagonals into four triangles that are coloured; furthermore, a tile has an orientation in the plane so that rotations and reflections of the tile may not be allowed. Finally, there is a rule about adjacent tiles: their abutting edges must be the same colour. Given a finite set of types of tiles, the question is raised whether translates of copies of tiles in this set may be used to fill every cell in the plane subject to the rule that abutting edges be the same colour. If this is possible, the set of tiles is said to tile the plane. H Wang\n(1961)\nasked if there exists a general decision method for deciding every question of this kind. Also, he conjectured that if a set of tiles tiles the plane, then the set may be used to tile the plane periodically. If this conjecture were true\n(\nit has been shown to be false\n)\n, then a general decision method would exist; namely, we systematically tile larger and larger square arrays of cells in every possible way with the given set of tiles. If the set tiles the plane periodically, this procedure will eventually turn up a period of a tiling. If the set does not pack the plane, then it follows from the König infinity lemma that there is a square array that cannot be tiled at all. Of course, this decision method is not effective if the set tiles the plane, but there is no way to tile the plane with the set periodically. This is the problem considered by\n[\nRobinson\n]\n: to construct a set of tiles that tiles the plane but does not admit a periodic tiling. Actually, such a set containing over twenty thousand tiles had already been found by R Berger\n(1966)\nwho needed the result in the course of his proof that no general decision method exists for Wang's tiling problems.\n[\nRobinson\n]\nhas found a set of\n52\ntiles that tile the plane, but do not admit a periodic tiling. There are variations on the rules about adjacent tiles, and for each rule the decidability question and the periodicity question have been settled.\nIn the\n1971\npaper mentioned above, Robinson asks a question about undecidability and nonperiodicity results for tilings of the hyperbolic plane. He partially answered his own question in\nUndecidable tiling problems in the hyperbolic plane\nwhich was published in\n1978\n. Undecidability involves the halting problem for\nTuring\nmachines and in\n1991\n, when Robinson was aged\n80\n, he published\nMinsky's small universal Turing machine\nwhich describes a universal\nTuring\nmachine with\n4\nsymbols and\n7\nstates. In\n1994\nRobinson\n(\nnow aged\n83\n!\n)\npublished\nTwo figures in the hyperbolic plane\nwhich presents some properties of tilings of the hyperbolic plane by equilateral triangles having angles of size\n2\nπ\nn\n\\Large\\frac{2\\pi}{n}\nn\n2\nπ\n​\n, where\nn\n=\n7\nn = 7\nn\n=\n7\nor\nn\n=\n9\nn = 9\nn\n=\n9\n.",
  "matematicos_citados_na_biografia": [
    "Julia Bowman",
    "Neyman",
    "Julia Robinson",
    "Martin Gardner",
    "Schottky",
    "Hurwitz",
    "Tarski",
    "Mostowski",
    "Lucas",
    "Mersenne",
    "Turing"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}