{
  "nome_completo": "Raymond Louis Wilder",
  "nome_curto": "Raymond Wilder",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilder/",
  "data_nascimento": "3 November 1896",
  "local_nascimento": "Palmer, Massachusetts, USA",
  "data_morte": "7 July 1982",
  "local_morte": "Santa Barbara, California, USA",
  "summary": "Raymond Wilder was an American mathematician who worked in topology as well as producing works on philosophy.",
  "biografia": "Raymond Wilder\n's parents were Mary Jane Shanley and John Louis Wilder, who was a printer. Music played a large part in the family, and Raymond learnt to play the piano, in particular playing to accompany silent films in local cinemas. He also played the cornet in the family orchestra at dances and fairs. Although mathematics attracted him at school, when he entered Brown University in\n1914\nit was with the intention of becoming an actuary. World War I caused Wilder to take a break in his studies from\n1917\nto\n1919\nwhen he served in the U.S. Navy as an ensign. Following his war service he returned to Brown University to resume his studies. He received his first degree in\n1920\n.\nWilder then taught mathematics at Brown during\n1920\n-\n21\nwhile studying for his master's degree in actuarial mathematics which he received in\n1921\n. He married Una Maude Greene in\n1921\n; they had three daughters, Mary Jane, Kermit and Beth, and one son David. Wilder moved to the University of Texas in\n1921\nwhere again he was appointed as an instructor while he worked for his doctorate. It was here that his interests moved towards pure mathematics under the influence of\nRobert Moore\n. When he asked permission from\nMoore\nto take his topology course,\nMoore\nreplied\n(\nsee for example\n[\n3\n]\n)\n:-\nNo, there is no way a person interested in actuarial mathematics could do, let alone be really interested in, topology.\nAfter Wilder persuaded\nMoore\nto let him take the course,\nMoore\nproceeded to ignore him until he solved one of the hardest problems\nMoore\nposed to the class. Wilder gave up his plans to study actuarial mathematics and became\nMoore\n's research student. He suggested Wilder write up the solution to the problem  for his doctorate which indeed he did, becoming\nMoore\n's first Texas doctorate in\n1923\nwith his dissertation\nConcerning Continuous Curves\n.\nThe dissertation was concerned with the\nSchönflies\nprogramme which aimed to study positional invariants of sets in the plane or\n2\n-sphere. A positional invariant of a set\nA\nA\nA\nwith respect to a set\nB\nB\nB\nis a property which is shared by all homeomorphic images of\nA\nA\nA\nwhich are contained in\nB\nB\nB\n. The best known example of such a positional invariant is embodied in the\nJordan\ncurve theorem:\nA simple closed curve in the\n2\n-sphere has precisely two complementary domains and is the boundary of each of them\n. A converse to the\nJordan\ncurve theorem, proved by\nSchönflies\n, states that a subset of the\n2\n-sphere is a simple closed curve if it has two complementary domains, is the boundary of each of them, and is accessible from each of these domains. Wilder's thesis contained a new approach to the\nSchönflies\nprogramme. He continued to undertake research with this aim and in\n1930\n, in\nA converse of the Jordan-Brouwer separation theorem in three dimensions\n, Wilder showed that a subset of Euclidean\n3\n-space whose complementary domains satisfied certain homology conditions was a\n2\n-sphere.\nAfter a year as an instructor in mathematics at the university of Texas, Wilder was appointed as an assistant professor at Ohio State University in\n1924\nbut here he encountered difficulties due to his\n[\n3\n]\n:-\n... reluctance to sign a required loyalty oath at Ohio State University. Wilder's hostility to mindless patriotism and his predilection for liberal thought accompanied him throughout his life.\nAfter two years at Ohio State, he joined the faculty of the University of Michigan at Ann Arbor. There he progressed from his initial rank of assistant professor to become an associate professor in\n1929\n, and then a full professor in\n1935\n. He played a significant role in the American mathematical scene during World War II in particular he helped settle European refugee mathematicians in the United States. He became a research professor in\n1947\n, a position he held for\n20\nyears until his retirement in\n1967\n.\nThe initial phase of Wilder's research on the\nSchönflies\nprogramme, which we described above, was in in set-theoretic topology and lasted until around\n1930\n. After this he worked in algebraic topology, and in\n1932\nhe called for the unification of the two areas. His work was then directed towards the theory of manifolds, for example\nGeneralized closed manifolds in n-space\n(1934)\n, and in particular to extending the\nSchönflies\nprogramme to higher dimensions. This work was presented in a unified form in\nTopology of Manifolds\n(1949)\n; this was reprinted in\n1963\nand again in\n1979\nwith a few notes on the current status of the problems. The final three chapters of the book discuss Wilder's contributions in the theory of positional topological invariants.\nIt was around the time that Wilder published the first edition of\nTopology of Manifolds\nthat his research interests underwent a major change. He had already become interested in the foundations of mathematics as illustrated by his article\nThe nature of mathematical proof\n(1944)\nin which is concerned with:-\n... the preconceptions, sometimes not consciously avowed, which underline and unavoidably influence the point of view of active mathematicians.\nAt the International Congress of Mathematicians in Cambridge, Massachusetts in\n1950\nhe addressed the Congress on\nThe cultural basis of mathematics\n. In his lecture he asked:-\nHow does culture\n(\nin its broadest sense\n)\ndetermine a mathematical structure, such as a logic?\nHow does culture influence the successive stages of the discovery of a mathematical structure?\nHe attempted to answer these questions by giving examples such as\nintuitionism\nand symbolism. The first major text he published on foundations, which was based on lecture courses he had given, was\nIntroduction to the foundations of mathematics\n(1952)\n. He wrote in the introduction:-\nThe reason for instigating such a course was simply the conviction that it was not good to have teachers, actuaries, statisticians, and others who had specialized in undergraduate mathematics, and who were to base their life's work on mathematics, leave the university without some knowledge of modern mathematics and its foundations.\nBeth writes in a review:-\nThe first part of this book gives ... an exposition of the basic theories of modern mathematics: the theory of sets, the real number system\n(\non the basis of the\nPeano\naxioms\n)\nand the theory of groups\n(\nincluding some of its applications in algebra and geometry\n)\n. Special attention is given to those topics which are important from the point of view of research on foundations, such as the relations between various definitions of infinity, diagonal procedures, well-ordering, the choice axiom and its equivalents. ... The second part is devoted to a discussion on various viewpoints on foundations. After a summary of the earlier developments\n(\nup to the\nZermelo\nsystem\n)\n, the\nFrege\n-\nRussell\nthesis, intuitionism, and formalism are more fully explained. A final chapter deals with the cultural setting of mathematics.\nWilder's ideas continued to develop along the lines of cultural anthropology. He presented his ideas in\nEvolution of mathematical concepts. An elementary study\n(1969)\n. May, in a review, writes:-\nThe author quietly proposes that we study mathematics as a human artefact, as a natural phenomenon subject to empirical observation and scientific analysis, and, in particular, as a cultural phenomenon understandable in anthropological terms. Since this flies in the face of the dominant paradigm of the history of ideas nearly isolated from the social context, it may be misunderstood or ignored. But since it complements the interest among historians of science in constructing a science about science, it may initiate a new pattern.\nIn the book Wilder himself writes:-\nThe major difference between mathematics and the other sciences, natural and social, is that whereas the latter are directly restricted in their purview by environmental phenomena of a physical or social nature, mathematics is subject only indirectly to such limitations. ...\nPlato\nconceived of an ideal universe in which resided perfect models ... The assumption made in the present work is that the only reality mathematical concepts have is as cultural elements or artefacts.\nIn\n1981\nWilder published another major text\nMathematics as a cultural system\nwhich has a similar title to the talk he gave to the International Congress of Mathematicians thirty years earlier. Hirst writes:-\nThe book begins with an explanation of his notion of a cultural system in general, and how mathematics fits into this. Evolutionary processes are discussed, with the idea of \"hereditary stress\" serving again as an important springboard for the emergence of new ideas and insights in mathematics. Consolidation is discussed, as a force or process which unifies existing fields of mathematics and may at the same time spawn new ones.\nAfter Wilder retired from the University of Michigan in\n1967\nhe moved to the University of California at Santa Barbara. He lectured there in\n1970\n-\n71\n, then became a research associate retaining this position until his death. At the time of Wilder's death in Santa Barbara there were\n23\ngrandchildren and\n14\ngreat-grandchildren in his family. His wife, Una, survived him for an additional\n19\nyears, dying at the age of\n100\nin Long Beach.\nRaymond writes about Wilder's teaching, interests, and personality in\n[\n3\n]\n:-\nHis advanced graduate classes and seminars were intimate and stimulating. He enjoyed talking about the people, many of whom he knew personally, behind the ideas and theorems. I found myself often staying after his class. Our conversations would follow up some of the items in the classroom but would soon drift to other areas of his expertise. He was a devoted student of southwestern Native American culture. One day he told me that after retiring he would like to be a bartender in a rural area of Arizona or New Mexico, because he found the stories of the folk that he met in those bars so fascinating.\nAmong all the great mathematicians I have known, Wilder was the most approachable. He had a wonderful sense of humour and his wisdom made him a father confessor to many of his colleagues. With his wife, Una, they made their home a centre of hospitality.\nWilder contributed much to American mathematics. He was a strong supporter of the\nAmerican Mathematical Society\nbeing a member of its Council from\n1935\nto\n1937\n, a semicentennial lecturer in\n1938\n, colloquium lecturer in\n1942\n, vice president during\n1950\n-\n51\nand president during\n1955\n-\n56\n. He was also the Society's\nJosiah Willard Gibbs\nLecturer in\n1969\n. Wilder played a major role in the\nMathematical Association of America\nbeing its president during\n1965\n-\n66\n. The Association awarded him the Distinguished Service Medal in\n1973\n. He was honoured by election to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1963\n. He was awarded honorary degrees by Bucknell University\n(1955)\n, Brown University\n(1958)\n, and the University of Michigan\n(1980)\n.",
  "matematicos_citados_na_biografia": [
    "Robert Moore",
    "Moore",
    "Schönflies",
    "Jordan",
    "intuitionism",
    "Peano",
    "Zermelo",
    "Frege",
    "Russell",
    "Plato",
    "American Mathematical Society",
    "Josiah Willard Gibbs",
    "Mathematical Association of America",
    "National Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}