{
  "nome_completo": "Rebeca Cherep de Guber",
  "nome_curto": "Rebeca Cherep de Guber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Guber/",
  "data_nascimento": "2 July 1926",
  "local_nascimento": "Avellaneda, Buenos Aires, Argentina",
  "data_morte": "25 August 2020",
  "local_morte": "Buenos Aires, Argentina",
  "summary": "Rebeca Guber was one of the first Argentinian women mathematicians. She played a major role in the development of computing in Argentina. She also made important contributions to education particularly teaching science in schools.",
  "biografia": "Rebeca Guber\nwas given the name\nRebeca Cherep\nand only used the name\nRebeca Cherep de Guber\nafter her marriage to José Guber. She was widely known as \"Rebe.\" Her parents were Russian Jewish immigrants who arrived in Argentina early in the\n20\nth century. They came from a situation in their homeland where Jews were not allowed to study and could only do manual work. In addition, they did not feel safe with pogroms that could break out at any time. Arriving in Argentina, they lived in Avellaneda, an area south of the centre of Buenos Aires. Although they felt that the move gave them the chance of a better life, it certainly did not let them escape from poverty. They lived in a collective housing tenement and when Rebeca was born in July\n1926\nshe was delivered on a table in their home. Rebeca's parents felt that education was the way out of poverty so they made every effort to give her the best chance to study.\nRebeca attended both elementary school and high school in Avellaneda. In elementary school she was the person who always solved the mathematics problems the fastest while in secondary school she was fortunate to have good teachers who saw her mathematical talents and encouraged her to continue to study mathematics at university. We should note that these teachers should be given much credit for encouraging a girl to study university level mathematics since at this time in Argentina is was almost unknown for a girl to study mathematics at university. At the High School in Avellaneda, Rebeca became friends with\nCecilia Tuwjasz\n(\nknown as\nCecilia Berdichevsky\nafter her marriage\n)\n. Rebeca and\nCecilia\nboth loved mathematics and excelled at that topic at the High School. After graduating, however, they chose different routes to a mathematical career. They felt that there were two ways in which they could pursue a career in mathematics, either by doing an accounting degree or by studying for a B.Sc. in mathematics. Rebeca took the B.Sc. in mathematics option while\nCecilia\nopted for an accounting degree. Later Rebeca would persuade\nCecilia\nto take a mathematics degree and they would become colleagues.\nRebeca began her university studies of mathematics in the National University of La Plata. This university, in the city of La Plata, was situated not far south of Buenos Aires. It was at the National University of La Plata that Rebeca met José Guber\n(1925\n-\n1995)\n, the son of the Polish born businessman Wolf Guber and his wife Etta, who was training to be an engineer; they later married.\nAt the National University of La Plata, Rebeca was fortunate to be taught by\nManuel Sadosky\nand\nLuís Antoni Santaló\n.\nManuel Sadosky\nwas an Assistant in the Department of Mathematics in the Faculty of Physico-mathematical Sciences of the National University of La Plata and was in charge of the practical courses Higher Mathematics I and II\n(\ndifferential equations and analytical functions\n)\n.\nLuís Santaló\nwas a leading Spanish mathematician who had left Spain for political reasons due to the Spanish Civil War. After a short stay in France, he took the advice of\nJulio Rey Pastor\nand went to Argentina in\n1939\n. There he served as a professor in the National University of the Littoral, the National University of La Plata and the University of Buenos Aires. After her first degree Rebeca continued to study for a Ph.D. advised by\nSantaló\nto study problems in differential and integral geometry. She defended her doctoral thesis\nEl estudio de los invariantes afines asociados de las curvas del espacio y de ciertos elementos geométricos ligados con las mismas de manera afín\nⓉ\n(\nThe study of the associated affine invariants of the curves of space and of certain elements\n)\nin December\n1949\n. She published two papers containing the main results of her thesis:\nAffine invariants of certain triples of curves in space\n(\nSpanish\n)\n(1951)\nand\nAffine invariants of pairs of space curves\n(\nSpanish\n)\n(1951)\n. Reviewing the first of these, Abraham Schwartz writes\n[\n27\n]\n:-\nThe author studies triples of curvilinear elements of the second order in Euclidean\n3\n-space, each element determining a centre point, a tangent line, and an osculating plane. Nine affine invariants are found in the general case, three in the special case where the curves have an ordinary point in common, and one in the still more special case where the curves have a common tangent at an ordinary point. Metric and affine interpretations for the invariants are given in the three cases. The six projective invariants determined by P Buzano in the general case\n(1948)\nare included among those obtained here. The invariant obtained in the third case is simply related to those studied by\nL A Santaló\n(1947)\n.\nReviewing the second,\nChuan-Chih Hsiung\nwrites\n[\n13\n]\n:-\nBy the neighbourhoods up to and including the third order of each of five different pairs of curves at two ordinary points in an ordinary space, affine invariants, which are not projective invariants, are derived, together with their metric characterizations. A typical one of the above five cases is concerned with two curves C, C' and two ordinary points A, B on C, C' respectively under the conditions that A is on the tangent\nt\nB\nt_{B}\nt\nB\n​\nof C' at B and the osculating planes of C, C' at A, B do not pass through\nt\nB\nt_{B}\nt\nB\n​\nand the tangent of C at A, respectively.\nWe have been unable to give a precise date for when Rebeca married José Guber. In March\n1951\nshe sailed from Buenos Aires to New York on the\nFletero\narriving on\n17\nMarch. She travelled with José Guber but, at this time, they were nor married. They returned from New York to Buenos Aires on the Argentine\nSS Artiller\nleaving New York on\n27\nMay\n1951\n. It seems likely that they were married either later in\n1951\nor in\n1952\n. José Guber's friend Julio Broner started up the Wobron automobile parts company in\n1951\nwith José Guber as a minor partner so he had a good income.\nJuan Perón had been elected president of Argentina in\n1946\nand in\n1949\nintroduced Constitutional Reforms. These were not supported by all and were opposed by the Radicals who declared the Peronists did not have the required majority to make constitutional changes. Universities lost their autonomy and opponents of the Constitutional Reforms pointed out that Perón had centralised too much power in his own hands. Both Rebeca Guber and her husband had left-wing views which prevented Rebeca from taking a university position. She said\n[\n7\n]\n:-\nWhen I graduated I won a contest for head of Practical Works but, despite the fact that the position was attractive and the dean of that time supported me as much as he could, his offer was impossible, because I did not accept joining the ruling party.\nBy\n1952\nPerón's government became more determined that only supporters of the party could teach in universities. Rebeca earned her living giving private mathematics classes and created an institute in which she taught Mathematical Analysis to Engineering students. She worked with\nManuel Sadosky\nwriting the book\nElementos de cálculo diferencial e integral\nⓉ\n(\nElements of differential and integral calculus\n)\nwhich was published in\n1956\n. This textbook was in two volumes, the first on the Differential Calculus and the second on the Integral Calculus. The book was not aimed primarily at mathematics students but rather it was written for engineers and users of mathematics. It was very popular and was still being reprinted in\n2010\n.\nIn\n1955\nGuber and her husband went to Europe, spending some time in France. Shortly after they returned to Argentina, there was a coup that ousted Perón. He had began to lose the support of the military and, after a failed coup in June\n1955\n, another in September\n1955\nsucceeded and Perón fled to exile in Spain. Although there was an unstable political situation over the following years, the universities regained their autonomy in\n1956\n. At the University of Buenos Aires,\nManuel Sadosky\nwas appointed Acting Professor of Mathematical Analysis in the Faculty of Exact and Natural Sciences and Acting Professor of Special Mathematics in the Faculty of Engineering. In October\n1955\n, Rebeca Guber began to work at the Faculty of Exact and Natural Sciences of the University of Buenos Aires. On\n13\nOctober\n1957\nRebeca and José Guber's only child, Rosana Guber, was born. Rosana went on to study Anthropological Sciences at the University of Buenos Aires, then obtained a doctorate from Johns Hopkins University in the United States. She became a university professor.\nRebeca Guber spoke about her work at the University of Buenos Aires in an interview\n(\nsee for example\n[\n23\n]\n)\n:-\nAfter\n1955\n,\nManuel Sadosky\nbecame a professor of the Analysis I course and I was his head of practical work. When the Computational Institute was created,\nManuel\ncalled me to be his chief of operations. It was a very busy and rewarding time.\nManuel\noutlined the policies and I made sure that everything went as planned. He had to handle a group of seventy people.\nHer work over the following year was much involved with the Computational Institute and the computer that was installed there so we should give a little background concerning these. The university authorities to set up a Computational Institute and purchased a computer; a Special Commission comprising of\nAlberto González Domínguez\n,\nManuel Sadosky\nand Simón Leonado Altmann was, on\n18\nNovember\n1957\n, given the responsibility to study the \"organisation and governance of the Computational Institute and present draft regulations and a plan for its needs.\" Before looking at Guber's contribution to computing, we note that in\n1957\nher third paper on differential geometry\nDevelopable surfaces related in an affine manner with a space curve\nwas published. In it she finds necessary and sufficient conditions that a certain ruled surface be developable.\nCecilia Berdichevsky\nwrites about the purchase of the Ferranti Mercury computer in\n[\n2\n]\n:-\nAfter issuing an international bid that year\n[1957]\n, all members of a Special Commission from the University of Buenos Aires selected the Ferranti Mercury computer to be purchased for the University.... The installation of the Mercury was completed by the beginning of\n1961\n. The reason for such delay was that the chosen room to place the computer, being prepared on the second floor of the new building of the School of Exact and Natural Sciences, was not yet ready and did not suit the required strict Ferranti specifications.\nThe Ferranti Mercury computer was known from the time it was installed as\nClementina\n. This was because it had been programmed to play the song\nOh My Darling, Clementine\n. A small team began work with the new computer led by\nManuel Sadosky\n. Rebeca Guber and\nCecilia Berdichevsky\nhad leading roles in\nSadosky\n's team. Guber was appointed Technical Secretary of the Computational Institute on\n6\nJune\n1960\n. The Computational Institute, directed by\nManuel Sadosky\n, began operating the new computer on\n15\nMay\n1961\n. Guber said in an interview\n(\nsee for example\n[\n7\n]\n)\n:-\nThe first job we did was a national census sample that took half an hour to process. When we left, three years later, the computer processed\n24\nhours a day, seven days a week, due to the number of projects we carried out.\nThe Institute was highly successful in carrying out tasks for various faculties in the University of Buenos Aires, for institutions such as the National Atomic Energy Commission, and for various private companies. In addition members of the Computational Institute carried out their own researches. Cristina Zoltan was taught by Guber and then was a assistant at the Computational Institute. She explained some of the specific tasks undertaken there\n[\n17\n]\n:-\nRebeca Guber was my teacher at the Faculty of Sciences, when I was studying mathematics. As soon as the computer science course opened, I enrolled. For this reason, I began working at the Computational Institute as an assistant to Wilfred Durán. Rebe's management at the Institute has always had my admiration. Her support and drive for the Institute's projects was notable. In particular, Wilfred Durán's project to make a programming language that could facilitate the programming of the models developed in Oscar Varsavsky's group. Wilfred asked for more help from work, more space and even a blackboard that covered an entire wall. Everything was granted. Rebe personally took care of supporting the project\n(\nCOMIC\n)\n, which had overtones of the quixotic since at that time IBM was developing FORTRAN with the participation of\n1000\nprogrammers and in the Institute a language with more facilities was developed with a team of\n5\n.\nLiana Lew said:-\nGuber stood out for promoting the most ambitious projects. As I remember it, in\n1962\nwhen I entered the Scientific Computer career, I had the opportunity to program an Economic Model of the Argentine Republic, processed by Clementina and directed by Oscar Varsavsky. Guber was very demanding and we had a lot of respect for her, the entire Computational Institute felt that way.\nThe mathematician Hugo Scolnik said:-\nRebeca had a very hard childhood, she was born in a tenement house, perhaps everything that happened in her life forged her strong character. I met her in\n1960\nwhen I went to the Computational Institute looking for a job. She was a close friend of\nCecilia Berdichevsky\nand they were both classmates of my aunt's. When\nSadosky\nproposed me to be secretary of the Argentine Computing Society, I began to interact with Rebe and from then on we saw each other a few times. I think her personality, her good intentions and her organisational skills helped her achieve a lot of results.\nArturo Illia had become President of Argentina following elections in June\n1963\n. He tried to split the Perónists, who controlled the unions, from their exiled leader Perón. The Perónists reacted by supporting a coup against President Arturo Illia in June\n1966\nand General Juan Carlos Onganía, the commander in chief of the army, took control of the country. Following the military takeover, the University of Buenos Aires was attacked by police in July\n1966\n. Guber said\n[\n7\n]\n:-\nThat night the board of directors met and we already anticipated that this was coming. Two people,\nCora Ratto de Sadosky\nand I, were in our houses standing guard to be able to react to arrests, or whatever was necessary.\nGuber's daughter, Rosana Guber, said:-\nThe first time I saw my mom cry was one evening on a day when she had come home too early. She called at the Faculty and no one answered her. She stopped short, crying and screaming: 'They got in! They got in!\nGuber, along with around\n400\nother faculty members, resigned in protest at the police brutality directed at the university staff following what became known as the 'Night of the Long Batons'. Guber, who had put so much effort into managing the Computational Institute was devastated to see it destroyed.\nMore information about this is at\nTHIS LINK\n.\nGuber, along with the engineer Juan Chamero, the mathematician\nManuel Sadosky\nand the chemist David Jacovkis created the company called Asesores Ciencia Técnicos S.A. Other members of the Computational Institute worked for the company\n[\n7\n]\n:-\nRebeca played a managerial role in the company and was also in charge of preparing all the proposals for the work to be carried out, including a technical, economic and financial feasibility study for a project to extend\n9\nJulio Avenue. This project considered mathematical models of traffic flow and parking, and was probably the largest carried out in Latin America.\nIn\n1970\nGuber and the other two founders sold the company to some of those workers. In\n1971\nRebeca and José Guber were divorced. José Guber said that their family relations deteriorated after the 'Night of the Long Batons' in July\n1966\n. In\n1973\nshe began working for then Association of Social Benefits but resigned from the board in\n1976\nwhen the military dictatorship that took power in Argentina that year began to persecute the business men that the Association supported. In\n1977\n, after a year in which she had been unable to get a job, Guber went to Venezuela. Her daughter Rosana said\n[\n6\n]\n:-\nShe told me on Monday that we were traveling on Friday. I cried and cried, but we left.\nIn Venezuela she served as an advisor to the Fundación Gran Mariscal de Ayacucho, later becoming director of the Information Technology Department, and coordinated the Mathematics Department of the Faculty of Architecture of the Central University of Venezuela.\nIn\n1983\nArgentina became a democracy under President Raúl Alfonsín. Guber returned to Argentina before the election of Alfonsín to the presidency and worked along with\nManuel Sadosky\nto support his candidacy. After Alfonsín became president, Guber was made head of the Cabinet of Advisors and, later, Undersecretary of Operational Coordination. In this role she was a major player in the creation of the Technological Institute of Chascomús and the Latin American School of Informatics. The Technological Institute of Chascomús is a multidisciplinary centre whose mission is to provide excellent education and generate innovative basic and applied knowledge. Top-level scientists are trained and numerous highly relevant and internationally recognised investigations are carried out there. The Latin American School of Informatics, established in\n1986\nat the Pereyra Iraola Park about\n40\nkm from Buenos Aires, was an Argentine undergraduate school of computer science. Guber put in very effective support to make this successful but after four years its funding was withdrawn. Guber said funding was withdrawn\n[\n1\n]\n:-\n... because there is a bad habit. One can say that in Argentina it is the custom, but in many countries the same thing happens. Unfortunately, a new official, almost by definition, destroys what the previous one did.\nFor the rest of her career, Guber was an advisor to many different organisations such as the Scientific Research Commission of the Province of Buenos Aires. Her work between\n2000\nand\n2002\nfor this commission had her create a project for teaching science in schools in the Province of Buenos Aires. She also worked for the Board of Directors of the National Agency for Scientific and Technological Promotion and for the National Commission for the Improvement of the Teaching of Natural Sciences and Mathematics. Another of her projects, the study centre the Grupo Redes, was described by its coordinator Mario Albornoz\n[\n17\n]\n:-\nRebe was a founding member of the Grupo Redes in\n2002\n.... She worked with us until her health prevented her from doing so. She was instrumental in several projects. She, with Willy Durán, worked on a science teaching project in schools in the Province of Buenos Aires. For several years, she supervised the annual report of 'The State of Science', she directed several online surveys and was in charge\n(\nabove all\n)\nof teaching the youngest to work.\nRosana, Guber's daughter, published the book\nDe Chicos a Veteranos. Nación y Memorias de la Guerra de Malvinas\nⓉ\n(\nFrom boys to veterans. Nation and memories of the Malvinas war\n)\n(\nAl Margen, La Plata,\n2009)\n. She wrote in the Preface:-\nMy mother Rebeca Cherep has always been with me, ever since her incredible effort to understand my work on an Argentina that punished her and ignored her since the Night of the Long Batons in\n1966\n, when I saw her cry for the first time. Her values, such as commitment, solidarity and passion for Argentina, are woven into each semicolon of this work.\nGuber continued to work until her\n85\nth birthday in\n2011\n. She died aged\n94\n, one of the victims of the COVID-\n19\npandemic. She has been honoured with the naming of a room in the Computational Institute the 'Rebeca Cherep de Guber Classroom'.\nLet us end with this assessment from Pablo Jacovkis, author of\n[\n14\n]\n,\n[\n15\n]\n, ...\n[\n20\n]\n, who was dean of the Faculty of Exact and Natural Sciences:-\nRebe was on the one hand tireless, very attentive to everything, and detailed; she has great leadership skills. She had a very strong character, which was very common among professional women of that time, more macho than today, in which a woman always had to show that she was on par\n(\nor ahead\n)\nof the men in the work circle where she moved.",
  "matematicos_citados_na_biografia": [
    "Cecilia Tuwjasz",
    "Cecilia Berdichevsky",
    "Cecilia",
    "Manuel Sadosky",
    "Luís Antoni Santaló",
    "Luís Santaló",
    "Julio Rey Pastor",
    "Santaló",
    "L A Santaló",
    "Chuan-Chih Hsiung",
    "Manuel",
    "Alberto González Domínguez",
    "Sadosky",
    "Cora Ratto de Sadosky",
    "THIS LINK"
  ],
  "imagens": [
    "guber.jpg"
  ]
}