{
  "nome_completo": "Lucien Alexandre Charles René de Possel",
  "nome_curto": "René de Possel",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Possel/",
  "data_nascimento": "7 February 1905",
  "local_nascimento": "Marseilles, France",
  "data_morte": "26 February 1974",
  "local_morte": "Paris, France",
  "summary": "Lucien Alexandre Charles René de Possel was a French mathematician and computer scientist who worked on optical character recognition. He was one of the founders of the Bourbakists.",
  "biografia": "René de Possel\n's parents were Marthe Seignon and Raoul de Possel, who was an examining magistrate. René attended the Institution Mélizan and the Lycée at Marseille before going to Paris to study at the École Normale Supérieure. After completing his Agrégé de mathematique, de Possel continued to undertake research for his doctorate. He spent time studying at Munich, Göttingen and Berlin which had a major effect on broadening his education. In\n1931\nhe published a result on the conformal mapping of a simply connected domain in a Göttingen journal. He introduced the notion of sets of maximum type in a paper published in\n1932\n, and this concept was also studied in his doctoral thesis which was published in\n1933\n.\nHis studies were helped financially by the award of a Rockefeller Fellowship in\n1930\n-\n32\nbefore he gained his first appointment as Maître de Conférences at the Faculty of Science at Marseille in\n1933\n. He then held the same position in the Faculty of Science at Clermont-Ferrand from\n1934\nwhere he joined\nSzolem Mandelbrojt\n. They would go to Paris to attend the Séminaire de mathématiques in the Institut Henri-Poincaré every second Monday. This gave them the chance to visit bookstores and libraries as well as meet up with other friends which they had made during their studied in Paris. They met regularly for lunch with their friends at the Café Capoulade in boulevard Saint-Michel near the Luxembourg Gardens and it was here that he became one of the founder members of the\nBourbaki\ngroup.\nIn the early stages of\nBourbaki\n, de Possel was involved on a subcommittee which considered how they would present integration theory. His views on integration are to be found in the expository article\nLes théories modernes de l'intégration\nⓉ\n(\nModern theories of integration\n)\nwhich he published in\n1946\nand in which he sketched an abstract form of the\nRiemann\n-\nStieltjes\nintegral. On many issues de Possel and\nAndré Weil\nwere on opposite sides in the arguments. At the first\nBourbaki\ncongress in July\n1935\nde Possel was still an active member of the group and much involved with contributing but, largely due to differences with\nWeil\n, he dropped out of the project. De Possel married Yvonne Liberati on\n12\nAugust\n1935\n; they had three children, Yann, Maya, and Daphné. In\n1936\nhe published an important book on game theory, namely\nSur la théorie mathématique des jeux de hasard et de réflexion\nⓉ\n(\nOn the mathematical theory of gambling and reflection\n)\n. He published an article in\n1935\nwhich was the first to present a general theory of differentiation in abstract measure spaces and in the following year he published another article in which he gave complete proofs.\nDe Possel was appointed as professor in the Faculty of Science at Bresançon, then in\n1938\nprofessor in the Faculty of Science at Clermont. In\n1941\nhe was appointed to a chair of mathematics in Algiers. He held the chairs of rational mechanics, then differential and integral calculus. In\n1951\nhe was appointed to the specially created chair of higher analysis at the Faculty of Science at Algiers. From\n1959\nhe was professor of numerical analysis at the Faculty of Science in Paris. We look briefly at the mathematics papers which de Possel published during these year.\nIn\n1939\nhe published\nSur la représentation conforme d'un domaine à connexion infinie sur un domaine à fentes parallèles\nⓉ\n(\nOn the conformal representation of a connection to infinite domain on a domain with parallel divisions\n)\nin which he developed further the ideas on conformal mapping of a simply connected domain which he had published in\n1931\n. In the second half of the\n1940\ns he published a considerable number of papers. We mention\nSur l'indétermination de la puissance d'un torseur réparti\nⓉ\n(\nOn the indeterminacy of the power of a distributed couple\n)\nin which he gave proofs of some formulas of use in the mechanics of continuous media, where the differential elements are subjected to couples as well as forces per unit volume;\nLes principes mathématiques de la mécanique classique\nⓉ\n(\nThe mathematical principles of classical mechanics\n)\nwhich was based in ideas due to Brelot;\nSur la définition d'un torseur réparti et sur l'évaluation de sa puissance\nⓉ\n(\nOn the definition of a distributed couple and the evaluation of its power\n)\nwhich examines when external forces on part of a body are equivalent to couples alone;\nInitiation à la topologie\nⓉ\n(\nIntroduction to topology\n)\nresulting from work carried out in Portugal;\nSur les systèmes dérivants et l'extension du théorème de Lebesgue relatif à la dérivation d'une fonction à variation bornée\nⓉ\n(\nOn derived systems and the extension of the Lebesgue theorem about the derivation of a function of bounded variation\n)\nextending the classical theorem for linear\nLebesgue\nmeasure; and\nLa notion physique d'énergie vis-à-vis des définitions du travail et de la force\nⓉ\n(\nThe physical concept of energy vis-à-vis the working definitions and strength\n)\nwhich considers the formulation of classical mechanics given by Brelot.\nDe Possel worked on computer science at the Institut Blaise Pascal of the National Centre for Scientific Research, in particular working on optical character recognition. His pioneering work in this field means that for many people this is the contribution for which he is best known. He became director of the Institut Blaise Pascal in\n1962\nand held this post until it was reorganised in\n1968\n. He continued to publish mathematics papers at during the years when he worked at the Institut Blaise Pascal:\nDeux lemmes sur les variétés à deux dimensions, et leur application au polygone fondamental d'une variété conforme prolongeable\nⓉ\n(\nTwo lemmas on varieties in two dimensions, and their application to the fundamental polygon of a  compliant extendable variety\n)\n(1962)\n;\nSur les variétés à deux dimensions, les ensembles de capacité maximale et le prolongement des variétés conformes\nⓉ\n(\nOn the varieties in two dimensions, sets of maximum capacity and the extension of conformal varieties\n)\n(1964)\n; and\nSur l'existence d'ensembles d'entiers qui interviennent en théorie ergodique\nⓉ\n(\nOn the existence of whole sets involved in ergodic theory\n)\n(1966)\n. We mentioned that one of his early publications was a book on game theory and one of his last publications was also on game theory. In\n1968\nhe published\nGraphes et jeux de \"prise\"\n(\nnimspiele\n)\nⓉ\n(\nGraphs and games of 'taking'\n(\nthe game of Nim\n)\n)\nin which he:-\n... announces the solution of several variants of the game of Nim with the following rules: Two players alternate in removing matches from p piles\nT\n1\n,\n.\n.\n.\n,\nT\np\nT_{1},... ,T_{p}\nT\n1\n​\n,\n.\n.\n.\n,\nT\np\n​\n. The matches removed by a player in a turn must come from a single pile\nT\nn\nT_{n}\nT\nn\n​\nand the number removed must belong to a set\nA\nn\nA_{n}\nA\nn\n​\nof positive integers, fixed by the rules, but always containing\n1\n. The player to remove the last match wins.\n(\nIn another version, the player to remove the last match loses.\n)\nAmong his hobbies were watersports, and in particular he loved motor boats and underwater fishing.",
  "matematicos_citados_na_biografia": [
    "Szolem Mandelbrojt",
    "Bourbaki",
    "Riemann",
    "Stieltjes",
    "André Weil",
    "Weil",
    "Lebesgue"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}