{
  "nome_completo": "René-Louis Baire",
  "nome_curto": "René Baire",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baire/",
  "data_nascimento": "21 January 1874",
  "local_nascimento": "Paris, France",
  "data_morte": "5 July 1932",
  "local_morte": "Chambéry, France",
  "summary": "René Baire worked on the theory of functions and the concept of a limit.",
  "biografia": "René Baire\n's father was a tailor and René was one of three children from the poor working class family who had to struggle under difficult financial circumstances. René grew up in Paris at the time when the Eiffel tower was being constructed. In\n1886\n, when he was twelve years old, René won a scholarship to enable him to have a good education despite his family's poverty. He entered the Lycée Lakanal where he boarded and he became an outstanding student. He won two honourable mentions in the Concours Général, a competition between the top pupils from all the Lycées across France.\nIn\n1890\nRené completed the advanced classes at the Lycée Lakanal and entered the special mathematics section of the Lycée Henri IV. After completing one year of preparation at this Lycée, he passed the entrance examinations for both the École Polytechnique and the École Normale Supérieure. He chose the latter as the place to study. Costabel writes in\n[\n1\n]\n:-\n... during his three years there\n[\nhe\n]\nattracted attention by his intellectual maturity. He was a quiet young man who kept to himself and was profoundly introspective. During this period he was found to be in delicate health.\nAt the École Normale Supérieure Baire attended lectures by\nJules Tannery\nand\nGoursat\nand, in addition, he attended lectures by\nHermite\n,\nÉmile Picard\nand\nPoincaré\nat the Sorbonne. While he was a student he assisted with the editing of\nPoincaré\n's lectures, which he attended in\n1894\n, on the propagation of heat. Having received his licentiate Baire proceeded toward his \"agregation\" but, although he was the best student in the written parts of this examination, he was only third overall after the oral examination.\nHis poor performance in the oral is worth describing in more detail since it was to have a great affect on the future direction of Baire's research. He was asked to prove the continuity of the exponential function but when he was in the middle of the proof he realised that\n[\n1\n]\n:-\n... his demonstration of continuity, which he had learnt at the Lycée Henri IV, was purely an artifice, since it did not refer sufficiently to the definition of the function.\nThe examiners were hard on Baire and he was extremely disappointed with the outcome, but he then determined to examine again his analysis course while researching into the concept of continuity of a general function. However, the immediate result of his passing his agregation was that he obtained his first post as a professor at a lycée. An appointment in Bar-le-Duc gave him reasonable financial security but he was unhappy that living in Bar-le-Duc meant that he had no opportunity for close contacts with university life.\nAt the Lycée in Bar-le-Duc Baire worked on the theory of functions and the concept of a limit. Around this time he discovered conditions under which a function is a limit of a sequence of continuous functions. Shortly after this Baire set up his classification of functions. Class\n1\nfunctions were those functions which were the limit of a sequence of continuous functions. Class\n2\nfunctions were those functions which were the limit of a sequence of Class\n1\nfunctions, while Class\n3\nfunctions were those functions which were the limit of a sequence of Class\n2\nfunctions.\nBaire was awarded a scholarship to allow him to continue his studies in Italy and there he met and established a close friendship with\nVolterra\n. While he worked in the lycée, Baire wrote a doctoral thesis on discontinuous functions. He was examined on\n24\nMarch\n1899\nby a board consisting of\nDarboux\n,\nAppell\nand\nÉmile Picard\n, and they awarded him the doctorate. However\n[\n1\n]\n:-\nThe few objections, which Baire fully appreciated, proved that he had embarked on a new road and would not find it easy to convince his listeners.\nEven before presenting his thesis Baire had suffered from poor health and, after the award of his doctorate, he was only able to contribute to mathematics for a few short spells. He continued to teach in lycées\n(\nhe taught in Troyes, Bar-le-duc and Nancy\n)\nbut was not happy teaching at this low level. In\n1901\nBaire was appointed to the University of Montpellier as a \"Maitre des conferences\". This post saw him preparing students for the \"agregation\" examination, a position he enjoyed much more than teaching in lycées. While at Montpellier he wrote a paper on\nirrational\nnumbers and limits.\nIn\n1904\nhe was awarded a Peccot Foundation Fellowship which was to allow young school teachers to spend a semester in a university developing their skills. Baire spent the semester at the Collège de France where he lectured on the subject of his thesis and had the lectures published the next year. Baire returned to Montpellier where he suffered the first severe attack of illness but after a while the worst of the attack passed and he was able to work again. He was appointed to a university post in\n1905\nwhen he joined the Faculty of Science at Dijon. In\n1907\nhe was promoted to Professor of Analysis at Dijon.\nBaire's health had never been good since he was young but from the time he was at the Lycée at Bar-le-Duc it began to deteriorate to the stage that it prevented him from working. The bad spells became more frequent, immobilising him for long periods. Apart from problems with his oesophagus that had plagued him since his youth, he developed a kind of psychological disorder which, using his own description, \"debilitated\" him occasionally. Apparently he eventually became unable to undertake work which required him to concentrate, and research in mathematics became impossible at these times. Between\n1909\nand\n1914\nhe continued trying to undertake his teaching duties, but this became more and more difficult. Then near the beginning of\n1914\nhe requested leave so that he might try to recover his health.\nBaire went first to Alésia, then he went to Lausanne. It was while he was in Lausanne that World War I began and he was not able to return to France. He spent the war years from\n1914\nuntil\n1918\nin Lausanne in quite difficult financial circumstances.\nIt is interesting to consider the various causes suggested by his contemporaries to account for his illness. Some suggested that the cause for his problems lay in intellectual overexertion in his student days. His close family, and others close to him, blamed his illness on his deep feelings of frustration that his achievements were not being recognised by the academic authorities. Baire felt that he deserved a professorship in Paris and failing to achieve this, it was suggested, caused him depression and hence his ill health.\nCertainly Baire felt that men such as\nLebesgue\n, who was younger than Baire, had been unfairly preferred to him. He first fell out with\nLebesgue\nin\n1904\n, when he taught his course at the Collège de France, over who had the most right to teach such a course. Their rivalry turned into a more serious argument later in Baire's life. Baire also fell out with\nde la Vallée Poussin\nwhich may be surprising to those who know that Baire's ideas entered the mainstream of mathematics through\nde la Vallée Poussin\n's well-known treatise. The letters written to Baire by\nde la Vallée Poussin\n, and reproduced in\n[\n7\n]\n, give an idea of the reasons for their arguments which seem to centre round the fact that\nde la Vallée Poussin\nhad classified by order of importance mathematical discoveries of\nLebesgue\nand Baire.\nWhile on the topic of letters, we should remark that\n[\n4\n]\ncontains fifty letters written by Baire to\nÉmile Borel\n. The first five are written during\n1898\nbeginning during the time that Baire was in Italy. There is a gap from the fifth letter, dated\n22\nMay\n1898\nto the sixth dated\n4\nFebruary\n4\n1902\n. The gap is explained by Baire's first serious illness over the period he taught at Bar-le-Duc. In the letters reproduced in\n[\n4\n]\n, Baire writes in great detail about his research ideas, including the Baire classification of functions, sets of first and second category, and semicontinuity. In the letters he also discusses\nCantor\n's set theory and the foundations of mathematics.\nIt appears that it was not only Baire's family who felt he had been hard done by, for after\n1918\nmany in the mathematical community seemed to be trying to make amends for his lack of recognition. In\n1918\nsome suggested that a chair at the Collège de France, which he undoubtedly deserved, would lift Baire's depression, helping him to regain his intellectual vigour, but apparently these suggestions never materialised. Unable to resume his duties, Baire lived on the shores of Lake Geneva and he was there when he received the Chevalier de la Legion d'Honneur and in\n1922\nwhen he was elected to the\nAcadémie des Sciences\n. He retired in\n1925\nand spent his last years in the solitude of hotel rooms on the shores of the Lake of Leman. Although he received a reasonable pension, inflation over these years soon meant that he ended his life with financial difficulties similar to those of his youth.\nDespite being unable to work for long periods, Baire wrote a number of important analysis books including\nThéorie des nombres irrationels, des limites et de la continuité\nⓉ\n(\nTheory of irrational numbers, limits and continuity\n)\n(1905)\nand\nLeçons sur les théories générales de l'analyse\nⓉ\n(\nLessons on general theories of analysis\n)\n,\n2\nVols.\n(1907\n-\n8)\n. Baire made a decisive step in moving away from the intuitive idea of functions and continuity and he saw clearly that a theory of infinite sets was fundamental for rigorous real analysis. He wrote in his doctoral thesis:-\nGenerally speaking, in the framework of ideas that here concern us, every problem in the theory of functions leads to certain questions in the theory of sets, and it is to the degree that these latter questions are resolved, that it is possible to solve the given problem more or less completely.\nWhen his health was good, the quality of his lectures received rather differing opinions from his students. Some described his lectures as very clear, but others claimed that what he taught was so difficult that it was beyond human ability to understand. Baire, aware of these comments, wrote:-\n... but look at\nDenjoy\n- he understood it, hence it must not be so difficult ...\nDenjoy\n, who was Baire's most famous student, certainly understood Baire's ideas and developed them in his own work. He wrote that Baire was:-\n.. not an agreeable character ...\n[\nand\n]\nnot a person of enormous culture ...\n[\nbut\n]\nconstantly tormented due to the fatigue of his brain.\nOn the other hand\nDenjoy\ndescribed him as:-\n... an excellent person.\nAnother of his students, Reault, wrote much more positively describing Baire as having:-\n... paternal concern ...\n[\nHe had\n]\nhigh intellectual qualities ... a penetrating mathematical mind\n[\nwith\n]\nthe extent and depth of his knowledge ...\n[\nand\n]\nthe greatness of his character.",
  "matematicos_citados_na_biografia": [
    "Jules Tannery",
    "Goursat",
    "Hermite",
    "Émile Picard",
    "Poincaré",
    "Volterra",
    "Darboux",
    "Appell",
    "irrational",
    "Lebesgue",
    "de la Vallée Poussin",
    "Émile Borel",
    "Cantor",
    "Académie des Sciences",
    "Denjoy"
  ],
  "imagens": [
    "baire.jpg"
  ]
}