{
  "nome_completo": "Richard Wesley Hamming",
  "nome_curto": "Richard Hamming",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamming/",
  "data_nascimento": "11 February 1915",
  "local_nascimento": "Chicago, Illinois, USA",
  "data_morte": "7 January 1998",
  "local_morte": "Monterey, California, USA",
  "summary": "Richard Hamming was an American mathematician and computer scientist, best known for the so-called Hamming code .",
  "biografia": "Richard Hamming\n's parents were Richard J Hamming and Mabel G Redfield. He was brought up in Chicago where he attended school and soon realised that he was a more able mathematician than his teacher. He decided to study engineering at university but the only offer of a scholarship came from the University of Chicago which had no engineering department. He entered the University of Chicago receiving his B.S. in\n1937\nafter majoring in mathematics. Following his undergraduate studies, he went to the University of Nebraska where he was awarded his M.A. in\n1939\n. He received his Ph.D. in mathematics in\n1942\nfrom the University of Illinois at Urbana-Champaign. His doctoral dissertation\nSome Problems in the\nBoundary Value Theory\nof Linear\nDifferential Equation\nwas supervised by Waldemar Trjitzinsky\n(1901\n-\n1973)\n. Trjitzinsky, a Russian by birth, emigrated to the United States in the\n1920\ns and was a professor of Mathematics at the University of Illinois from\n1934\nto\n1969\n. His interests were in analysis, particularly\nmeasure theory\n, integration and differential equations. In a paper published in\nActa Mathematica\nin\n1936\n, Trjitzinsky studied linear differential systems with two point boundary conditions of a particular type and Hamming extended this work in his thesis. In particular, Hamming investigated the\nGreen\n's function and also the characteristic solutions for which he obtained asymptotic expressions. He further developed methods introduced by\nJacob D Tamarkin\nto investigate the characteristic numbers and to show that the series used converged uniformly. Hamming did, however, develop interests in ideas that were quite far removed from his study of differential equations\n[\n15\n]\n:-\nAs a graduate student I found, and studied,\nBoole\n's 'Laws of Thought', and I found it interesting, relevant, and believable.\nAfter the award of his doctorate, Hamming married Wanda Little on\n5\nSeptember\n1942\n. He taught, for a short time, at the University of Illinois and then at the University of Louisville. In\n1945\n, encouraged by a friend, he joined the Manhattan Project, a U.S. government research project to produce an atomic bomb. It was called the Manhattan Project because the first research had been done at Columbia University in Manhattan. However by the time that Hamming was recruited to the project it was being undertaken at Los Alamos. A month after he arrived at Los Alamos, he was joined by his wife Wanda who was also employed on the Manhattan Project. He was given the task of running the IBM computers which played a vital role in the project\n[\n9\n]\n:-\nAt Los Alamos I was brought in to run the computing machines which other people had got going, so those scientists and physicists could get back to business. ... I saw\nFeynman\nup close. I saw\nFermi\nand Teller. I saw Oppenheimer. I saw\nHans Bethe\n: he was my boss.\nWanda began working with desk calculators and, later, worked for\nEnrico Fermi\nand Edward Teller. Hamming relates an interesting episode in\n[\n15\n]\n:-\n... at Los Alamos ... we were designing atomic bombs. Shortly before the first field test\n(\nyou realize that no small scale experiment can be done - either you have a critical mass or you do not\n)\n, a man asked me to check some arithmetic he had done, and I agreed, thinking to fob it off on some subordinate. When I asked what it was, he said, \"It is the probability that the test bomb will ignite the whole atmosphere.\" I decided I would check it myself! The next day when he came for the answers I remarked to him, \"The arithmetic was apparently correct but I do not know about the formulas for the capture cross sections for oxygen and nitrogen - after all, there could be no experiments at the needed energy levels.\" He replied, like a physicist talking to a mathematician, that he wanted me to check the arithmetic not the physics, and left. I said to myself, \"What have you done, Hamming, you are involved in risking all of life that is known in the Universe, and you do not know much of an essential part?\" I was pacing up and down the corridor when a friend asked me what was bothering me. I told him. His reply was, \"Never mind, Hamming, no one will ever blame you.\"\nAfter the Manhattan Project ended, Hamming remained at Los Alamos for six months, writing up details of the calculations that had been made. He felt that it was important to try to understand exactly what had been achieved there and why it had been so successful. It was at this time that he realised that he had done the right thing by not studying engineering - the engineers did much of the routine work but mathematicians like himself were more involved in the cutting edge innovations. He formed a view of mathematics, arising from this Los Alamos experience, that computation was of major importance but it made him doubt the significance of the standard approach through abstract mathematical theories\n(\nsee, for example,\n[\n19\n]\n)\n. He had already the offer of a position at the Bell Telephone Laboratories in New Jersey and, in\n1946\n, he began working in the mathematics department there. However, he did not break his link with Los Alamos, continuing to make two week visits each summer to Los Alamos Scientific Laboratories as a consultant. At Bell Labs he was able to work with both\nClaude Shannon\nand\nJohn Tukey\n[\n15\n]\n:-\n[\nAt\n]\nBell Labs I came into a very productive department. Bode was the department head at the time;\nShannon\nwas there ... I shared an office for a while with\nShannon\n. At the same time he was doing information theory, I was doing coding theory. It is suspicious that the two of us did it at the same place and at the same time - it was in the atmosphere.\nThe head of the Mathematical Research Department at Bell Labs was Hendrik Wade Bode\n(1905\n-\n1982)\nwho first joined the Department at Bell Labs in\n1929\nand became head in\n1944\n. In addition to\nShannon\nand\nTukey\n, some other young mathematicians had joined the Mathematical Research Department at Bell Labs just before Hamming. These included Donald Percy Ling\n(1912\n-\n1981)\nand Brockway McMillan\n(1915\n-\n)\nwho had been at Los Alamos at the same time as Hamming.\nShannon\n, Ling, McMillan and Hamming called themselves the Young Turks and Hamming spoke about the group\n(\nsee\n[\n8\n]\n)\n:-\nWe grew up in the great depression, so we believed we owed the world a living. During the war, we all had to learn things we didn't want to learn to get the war won, so we were all cross-fertilized. We were impatient with conventions and had often had responsible jobs very early. We were first-class troublemakers. We did unconventional things in unconventional ways and still got valuable results. Thus, management had to tolerate us and let us alone a lot of the time.\nHis unconventional approach was emphasised by Alan Chynoweth who worked for the Physics Research Department at Bell Labs\n[\n9\n]\n:-\n... we were in the habit of lunching together as a physics group, and for some reason this strange fellow from mathematics was always pleased to join us. We were always happy to have him with us because he brought so many unorthodox ideas and views. Those lunches were stimulating, I can assure you.\nNot all of Hamming's colleagues were as happy to tolerate his 'unconventional ways', however\n[\n8\n]\n:-\nSome former colleagues from Bell Labs recall Hamming as egotistical and comment that he occasionally went off \"half-cocked, after some half-baked idea,\" and he was slow to pick up on his misdirection. \"He is very hard to work with,\" one former Bell scientist said, \"because he does a lot of broadcasting and not a lot of listening.\"\nWe will discuss below some of Hamming's highly significant work on error-correcting codes, but here we note some of the many varied problems he worked on in Bell Labs\n[\n11\n]\n:-\n... working as I did for the Bell System, I did many telephone computations and other mathematical work on such varied things as traveling wave tubes, the equalization of television lines, the stability of complex communication systems, the blocking of calls through a telephone central office, to name but a few.\nHe was to continue to work for Bell Telephones until\n1976\nalthough he became increasingly interested in teaching and held visiting or adjunct professorships at Stanford University, the City College of New York, the University of California at Irvine, and Princeton University between\n1960\nand\n1976\n. After retiring from Bell Labs in\n1976\n, he accepted a professorship of computer science at the Naval Postgraduate School at Monterey, California. At this point he gave up his research career, deciding to concentrate on teaching and writing books. He formed the belief that the way mathematics is being taught is wrong, but the only way to change this was to write textbooks that can be used for a new approach. Here we quote two examples from\n[\n17\n]\nillustrating his views on mathematics teaching:-\nWe live in an age of exponential growth in knowledge, and it is increasingly futile to teach only polished theorems and proofs. We must abandon the guided tour through the art gallery of mathematics, and instead teach how to create the mathematics we need. In my opinion, there is no long-term practical alternative\n.\nThe way mathematics is currently taught it is exceedingly dull. In the calculus book we are currently using on my campus, I found no single problem whose answer I felt the student would care about! The problems in the text have the dignity of solving a crossword puzzle - hard to be sure, but the result is of no significance in life.\nProbability\nand statistics have easily understood problems whose results are surprising, important and interesting in themselves\n.\nHis attempt to move to a new way of teaching calculus is exhibited in his book\nMethods of mathematics applied to calculus, probability, and statistics\n(1985)\n. He wrote about this book in\n[\n17\n]\n:-\nThis book ... is very different from the standard texts and its success or failure will tell us something about the prospects for change and innovation. If we are to move to any sort of new curriculum ... this book is a first start.\nOther texts he wrote, all attempting to change conventional approaches to the areas they covered, include\nNumerical Methods for Scientists and Engineers\n(1962)\n,\nIntroduction to applied numerical analysis\n(1971)\n,\nComputers and Society\n(1972)\n,\nDigital filters\n(1977)\n,\nCoding and information theory\n(1980)\n,\nThe Art of Probability for Scientists and Engineers\n(1991)\n, and\nThe Art of Doing Science and Engineering : Learning to Learn\n(1997)\n.\nExtracts from reviews of most of these books are given at\nTHIS LINK\n.\nHamming is best known for his work on error-detecting and error-correcting codes. His fundamental paper on this topic\nError detecting and error correcting codes\nappeared in April\n1950\nin the\nBell System Technical Journal\n. With this paper, he started a new subject within information theory. Hamming codes, Hamming distance and Hamming metric are standard terms used today in coding theory but they are also used in many other areas of mathematics. These ideas, of fundamental importance in coding theory, all originated in this classic paper and are of practical use in computer design. How did Hamming come to do this work? He tells us in the paper that he:-\n... was led to the study ... from a consideration of large scale computing machines in which a large number of operations must be performed without a single error in the end result.\nIn fact it was in\n1947\nwhen Hamming set computers at Bell Labs to work on a particular problem over the weekend. The result was needed by his colleagues but, come Monday, he discovered that an error had occurred early in the calculations and he had nothing to report. He decided that if the computer could detect when an error had occurred then it must be able to detect where it had occurred. Since the machines worked in binary, every entry was either\n0\nor\n1\nso knowing that a particular entry was wrong meant that the computer could correct it - if\n0\nwas wrong the correct entry must be\n1\nand vice-versa. Error detecting was done by a parity check on each block of symbols - an extra digit was added\n(\neither\n0\nor\n1)\nso that the sum of the digits in the block was even. One incorrect entry could be detected since the parity check would fail. Hamming thought out a way not only to determine if a single error had occurred but also, by adding extra parity checks, to detect where it had occurred. He then devised a way to both correct a single error in a block and detect a second error. These codes were described in the first part of the paper while the second part used a geometrical model to show that the codes he had described were best possible.\nWork in codes is related to packing problems and the error-correcting codes discovered by Hamming led to the solution of a packing problem for matrices over finite fields. In\n1956\nHamming worked on the early computer, the IBM\n650\n. His work here led to the development of a programming language which has evolved into the high-level computer languages used to program computers today. Hamming also worked on numerical analysis, integrating differential equations, and the Hamming spectral window which is much used in computation for smoothing data before\nFourier analysing\nit.\nHamming has received many awards for his pioneering work. In\n1968\nhe was made a fellow of the Institute of Electrical and Electronics Engineers. The IEEE awarded Hamming the Emanuel R Piore Award in\n1979\n:-\nFor introduction of error correcting codes, pioneering work in operating systems and programming languages, and the advancement of numerical computation.\nThe IEEE named a medal \"The Richard W. Hamming Medal\" in his honour and he was the first recipient of this $\n10\n,\n000\nprize medal in\n1988\n:-\nFor exceptional contributions to information sciences and systems.\nAlso in\n1968\nhe was presented with the\nTuring\nAward from the Association for Computing Machinery:-\nFor his work on numerical methods, automatic coding systems, and error-detecting and error-correcting codes.\nHe was made a fellow of the Association for Computing Machinery in\n1994\n.\nHe has received further honours included being elected a member of the National Academy of Engineering in\n1980\nand receiving the Harold Pender Award from the University of Pennsylvania in\n1981\n. In\n1996\n, in Munich, Hamming received the prestigious $\n130\n,\n000\nEduard Rheim Award for Achievement in Technology for his work on error correcting codes.\nIn\n1997\nHamming retired from teaching at the Naval Postgraduate School and was made Distinguished Professor Emeritus. Shortly before he retired he said\n(\nsee\n[\n8\n]\n)\n:-\nA friend told me recently, \"Hamming, the day you quit teaching, you are going to fall apart.\" He's probably right. When I left Bell Labs, I knew that that was the end of my scientific career. When I retire from here, in another sense, it's really the end.\nIndeed he was right for having taught up to December\n1997\n, he died of a heart attack in the following month. On Hamming's death Richard Franke of the Naval Postgraduate School at Monterey wrote:-\nHe will be long remembered for his keen insights into many facets of science and computation. I'll also long long remember him for his red plaid sport coat and his bad jokes.\nJames F Kaiser, in a brief obituary of Hamming, writes:-\nWe will all miss his engaging mind and his penetrating insight into matters scientific, engineering, and of everyday living.",
  "matematicos_citados_na_biografia": [
    "Boundary Value Theory",
    "Differential Equation",
    "measure theory",
    "Green",
    "Jacob D Tamarkin",
    "Boole",
    "Feynman",
    "Fermi",
    "Hans Bethe",
    "Enrico Fermi",
    "Claude Shannon",
    "John Tukey",
    "Shannon",
    "Tukey",
    "Probability",
    "THIS LINK",
    "Fourier analysing",
    "Turing"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}