{
  "nome_completo": "Maximilian Ernst Richard Fuchs",
  "nome_curto": "Richard Fuchs",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuchs_Richard/",
  "data_nascimento": "5 December 1873",
  "local_nascimento": "Greifswald, Prussia now Germany",
  "data_morte": "28 December 1944",
  "local_morte": "Bad Doberan, near Rostock, Germany",
  "summary": "Richard Fuchs was a German mathematician who worked on differential equations and aerodynamics.",
  "biografia": "Richard Fuchs\n's father was\nLazarus Immanuel Fuchs\n, a famous mathematician with a biography in this archive, and his mother was Marie Anders\n(\nborn about\n1849)\n. They were Evangelical Protestants. Richard was born in Greifswald in north east Prussia\n(\nnow in Germany\n)\n, on the Baltic Sea.\nLazarus Fuchs\nhad been appointed to the University of Greifswald in session\n1868\n-\n69\nand he was still there when his son Richard was born in December\n1873\nbut he moved to Göttingen in\n1874\n, where he spent just one year before moving to Heidelberg in\n1875\n. This means that Richard had lived in three different towns before he was two years old.\nIt was in Heidelberg that Richard Fuchs began his schooling, attending a very good private school run by Antoni for eighteen months. He then spent six months at the Grand Ducal Lyceum in Heidelberg run by Gustav Uhlig\n(1838\n-\n1914)\nwho had been appointed Director in December\n1871\n. This was an excellent school with around\n500\npupils attracted from a wide area by its high reputation but, after a short time there, Richard Fuchs had to move on. In\n1884\nLazarus Fuchs\nmoved from Heidelberg to take up the Berlin chair left vacant by the death of\nEduard Kummer\nso at this Richard Fuchs had to move school. However, in Berlin he was able to study at a school which was also very highly regarded.\nThe Askanische\nGymnasium\n, at\n24\nto\n26\nHallesche Strasse in the district Tempelhof district of Berlin, had been founded in\n1875\nand its first headmaster was Woldemar Ribbeck\n(1830\n-\n1902)\n. When Fuchs studied at the school Ribbeck, a classical philologist, was still the headmaster with a staff of\n15\nteachers and over\n500\npupils. Fuchs studied at this school for eight years and was inspired by the outstanding mathematics teacher Adolf Schumann who died in\n1894\n, just a year after Fuchs graduated from the high school.\nIn\n1893\nFuchs took the maturity examination and entered the Friedrich-Wilhelm University of Berlin. He studied mathematics and physics there for eight semesters attending lectures by Fischer,\nGeorg Frobenius\n,\nLazarus Fuchs\n, Friedrich Robert Helmert\n(1843\n-\n1917)\n,\nHermann von Helmholtz\n,\nKurt Hensel\n, Georg Hettner\n(1854\n-\n1914)\n, Johannes Knoblauch\n(1855\n-\n1915)\n, Eduard Eberhard Kundt\n(1839\n-\n1894)\n, Friedrich Paulsen\n(1846\n-\n1908)\n,\nMax Planck\n,\nErnst Pringsheim\n,\nLudwig Schlesinger\n, F E Schulze,\nHermann Amandus Schwarz\n, and Carl Stumpf\n(1848\n-\n1936)\n. We note that in addition to those who taught him mathematics and physics, Fuchs was also taught by the philosophers Paulsen and Stumpf, by F E Schulze who was Professor of Zoology, and by Helmert who was professor of advanced geodesy and director of the Geodetic Institute. Undertaking research advised by\nHermann Amandus Schwarz\nand\nGeorg Frobenius\n, Fuchs was awarded a doctorate from the Friedrich-Wilhelm University of Berlin in\n1897\nfor his thesis\nÜber die Periodicitätsmoduln der hyperelliptischen Integrale als Functionen eines Verzweigungspunktes\n.\nⓉ\n(\nOn the periodicity of the hyperelliptic integrals as functions of a branch point.\n)\nHe dedicated his thesis to:-\nMy dear father and teacher,\nL Fuchs\n, with love and gratitude.\nAs well as all his above teachers, to whom he extended his greatest thanks and everlasting gratitude, he offered in particular thanks to\nLudwig Schlesinger\n, who greatly helped him in his studies, and he keeps till last his greatest thanks of all to his \"beloved father and teacher\nLazarus Fuchs\n.\" He was examined in an oral examination on\n28\nJuly\n1897\n, with opponents Gerhard Hessenberg\n(1874\n-\n1925)\n, Arthur Schulze\n(1872\n-\n1942)\nand Paul Bartels\n(1874\n-\n1914)\n. Hessenberg, Schulze and Bartels were students of mathematics, theoretical physics and medicine, respectively, who all obtained their doctorates in\n1897\n.\nIn\n1901\nFuchs was appointed as a teacher at the Bismarck-Gymnasium in Berlin-Wilmersdorf. He taught there while working on an\nhabilitation\nthesis. He married Käthe Kiepert\n(1877\n-\n1945)\nin Berlin in\n1903\n. Käthe was the daughter of Richard Kiepert\n(1846\n-\n1915)\n, a German cartographer born in Weimar. He was the son of famed cartographer and geographer Heinrich Kiepert\n(1818\n-\n1899)\n. Richard and Käthe Fuchs had two children, Dietrich Fuchs and Barbara Fuchs\n(\nborn\n1909)\n. Barbara studied physics and was awarded a doctorate before marrying the physicist Rudolf Jaeckel\n(1907\n-\n1963)\n. Jaeckel had a Jewish grandmother so he, like Barbara, was a quarter Jewish. They married before a law came into force banning such marriages. Jaeckel was dismissed in\n1938\nbut remained in Germany. Rudolf and Barbara Jaeckel had a son Klaus\n(1942\n-\n1996)\nwho was also a physicist.\nReturning to describe Fuchs' career, he habilitated at the Technische Hochschule Berlin-Charlottenburg in\n1906\nbut continued to teach at the Bismarck-Gymnasium. Axel von Harnack\n(1895\n-\n1974)\n, who became a librarian, historian and philologist, was a student at the Bismarck-Gymnasium in the first half of the\n1910\ns. He wrote in\n1964\nabout Fuchs who was his mathematics teacher at the Gymnasium\n[\n1\n]\n:-\nThe mathematics professor Dr Richard Fuchs gave us the feeling of being taught by a true scholar. He also worked part-time as professor at the Technische Hochschule in Charlottenburg and was a highly gifted teacher. His lessons were inspiring and punctuated with good humour which we held in high esteem. He presented the abstract material - based on the abundance of his knowledge - with lively clarity. He was also in a position to clarify the basics of his subject, as well as those of physics and chemistry, to students who were mathematically limited. He took us far beyond the level which was achieved at classical grammar schools in those days. We were acquainted with the elements of differential calculus and also taught possible applications.\nFuchs' father,\nLazarus Fuchs\n, died in\n1902\nand one of Richard Fuchs' main tasks from that time on was the publication of his father's complete works. He undertook this task in collaboration with\nLudwig Schlesinger\n, who had greatly assisted Fuchs while he was working for his doctorate and who was married to Fuchs' sister Clara, and they jointly edited\nGesammelte mathematische Werke von L Fuchs\nⓉ\n(\nCollected mathematical works of L Fuchs\n)\nwhich was published by Mayer & Müller, Berlin in three volumes in\n1904\n,\n1906\nand\n1909\n. Hermann Blenk writes in\n[\n3\n]\n:-\nDuring these years, busy with the release of the publications of his father, he promoted his life's work, the theory of linear differential equations in the complex domain, through its own investigations, and a wide readership benefited from his ability present a clear presentation and a simple argument.\nThese publications include\nSur quelques équations différentielles linéaires du second ordre\nⓉ\n(\nOn some linear differential equations of second order\n)\n(1905)\n,\nÜber lineare homogene Differentialgleichungen dritter Ordnung mit nur wesentlichen singulären Stellen\nⓉ\n(\nOn linear homogeneous differential equations of the third order with only essential singular points\n)\n(1906)\n,\nÜber lineare homogene Differentialgleichungen zweiter Ordnung mit drei im Endlichen gelegenen wesentlich singulären Stellen\nⓉ\n(\nOn linear homogeneous second order differential equations with three located in the finite singularity points\n)\n(1907)\nand\nÜber elliptische Funktionen und Integrale in ihrer Abhängigkeit von einem Parameter\nⓉ\n(\nOn elliptic integrals and functions in their fdependence on a parameter\n)\n(1908)\n. For a list of further publications by Fuchs, see\nTHIS LINK\n.\nIn the summer of\n1914\nWorld War I broke out  involving most of the nations of Europe. Fuchs was sent to the German Research Institute for Aviation in Adlershof near Berlin. This research institute, called the Deutsche Versuchsanstalt für Luftfahrt, had been set up in\n1912\nand required mathematicians with knowledge of aerodynamics and electrical engineering. Already the theory of complex variables was being used in the design of aircraft wings and\nLaplace transforms\nwere heavily used in electrical engineering. Fuchs contributed to the first of these two areas making studies of the mechanics of flight, in particular studying longitudinal and lateral stability of the aircraft and well as wing theory. During the war years he did not publish any papers\n(\nexcept\nÜber eine lineare Differentialgleichung zweiter Ordnung mit einer Unbestimmtheitsstelle\nⓉ\n(\nOn a linear second order differential equation with an indeterminacy\n)\n(1915)\nfor which the research had been completed before the outbreak of war\n)\n. However, after the war ended he published\nBeiträge zur Prandtlschen Tragflügeltheorie\nⓉ\n(\nContributions to Prandtl wing theory\n)\n(1921)\nwhich reflected the type of research he had undertaken during his war work. At the Technische Hochschule in Berlin-Charlottenburg he was promoted to extraordinary professor in\n1922\n. In the same year he published the first volume of his textbook\nAerodynamik\nⓉ\n(\nAerodynamics\n)\n. This book, written jointly with Ludwig Hopf from Aachen was, at this time, the only German text in this area. In addition to his position at the Technische Hochschule Berlin-Charlottenburg, from\n1922\nto\n1936\nFuchs also worked at the German Research Institute for Aviation in Berlin-Adlershof where he had carried out war work during the\n1914\n-\n18\nwar. In fact it was the Technische Hochschule Berlin-Charlottenburg that provided the training of mathematically educated engineers who were ideally suited for work at the German Research Institute for Aviation in Berlin-Adlershof. Let us note that one of Fuchs' publications relating to his work at the Institute for Aviation was\nBerechnung der Luftkräfte in der Flugtechnik mittels der Theorie der Funktionen einer komplexen Veränderlichen\nⓉ\n(\nCalculation of air forces in aeronautical engineering by means of the theory of functions of a complex variable\n)\n(1928)\n.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which, among others, exempted non-Aryans who had served in the\n1914\n-\n18\nwar. Fuchs was a half-Jew so certainly came under the non-Aryan definition of the Civil Service Law but he had served in the\n1914\n-\n18\nwar so came under the exemption clause. This meant that in\n1933\nhe kept his position at the Technische Hochschule Berlin-Charlottenburg but, as time went on, the exemption clause became ignored. He was dismissed from the Technische Hochschule Berlin-Charlottenburg in\n1937\nand with his dismissal there were no Jewish mathematicians left at the Hochschule. However, he was allowed to continue his work on aviation and worked at the German Research Institute for Aviation in Braunschweig until his death in the last days of\n1944\n.",
  "matematicos_citados_na_biografia": [
    "Lazarus Immanuel Fuchs",
    "Lazarus Fuchs",
    "Eduard Kummer",
    "Gymnasium",
    "Georg Frobenius",
    "Hermann von Helmholtz",
    "Kurt Hensel",
    "Max Planck",
    "Ernst Pringsheim",
    "Ludwig Schlesinger",
    "Hermann Amandus Schwarz",
    "L Fuchs",
    "habilitation",
    "THIS LINK",
    "Laplace transforms"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}