{
  "nome_completo": "Richard Courant",
  "nome_curto": "Richard Courant",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Courant/",
  "data_nascimento": "8 January 1888",
  "local_nascimento": "Lublinitz, Germany (now Lubliniec, Poland)",
  "data_morte": "27 January 1972",
  "local_morte": "New Rochelle, New York, USA",
  "summary": "Richard Courant was a Polish-born applied mathematician best known for founding the Institute named after him in New York.",
  "biografia": "Richard Courant\n's father was Siegmund Courant and his mother was Martha Freund. It was a Jewish family but there were tensions in it, particularly between Siegmund and his elder brother Jakob. Richard was the eldest of Siegmund and Martha Courant's children and soon after the birth of their second son Siegmund sold his share in the family business in Lublinitz and they bought a business in Glatz. A third son was born in the year they moved to Glatz, Richard being three at the time.\nWhen Richard was nine his family moved again, this time to Breslau. His father Siegmund was now in problems since he had agreed to buy another business before being persuaded by his brother Jakob to break the contract and move to Breslau. Siegmund worked for an insurance company in Breslau and Richard attended school there, entering the König-Wilhelm\nGymnasium\n. With little previous education Richard struggled at school at first, even being \"less than satisfactory\" at arithmetic.\nWhen Richard was fourteen years old he began to tutor to make enough money to support himself. Soon after this tragedy struck the family when Jakob, in severe business difficulties, committed suicide. Other members of the family blamed Richard's parents Siegmund and Martha. Shortly after Siegmund was declared bankrupt and the following two years must have been ones of extreme difficulty for Richard, attending school and still supporting himself tutoring. In\n1904\nRichard's parents left Breslau and moved to Berlin. Richard was earning enough to support himself, even now that he had to rent accommodation in Breslau.\nAlthough he had not yet passed the examinations necessary to enter university, Richard left school in\n1905\nand attended classes in mathematics and physics at the University of Breslau. In\n1906\nhe passed the university entrance examinations and continued to study, now officially a student. Although his original intention was to study physics, Courant found the teaching less satisfactory than that in mathematics. Adolf\nKneser\n, Georg\nLandsberg\nand Jakob\nRosanes\nwere among his mathematics teachers but Courant still found that, for him, their courses lacked excitement.\nCourant had studied at Breslau with two fellow students Otto\nToeplitz\nand Ernst\nHellinger\n. These two, several years older than Courant and further on with their education, were by this stage studying at Göttingen and wrote to Courant telling him how exciting it was there, particularly because of\nHilbert\n. In the spring of\n1907\nCourant left Breslau, spent a semester at Zürich, then began his studies at Göttingen on\n1\nNovember\n1907\n.\nAt Göttingen Courant began by attending courses by\nHilbert\nand\nMinkowski\nand he was also allowed to attend the joint seminar of the two mathematicians on mathematical physics. He also attended lectures on physics and philosophy.\nHaar\nwas\nHilbert\n's assistant at this time but he completed his doctoral work in\n1908\nand in that year Courant became\nHilbert\n's assistant. Reid writes\n(\nsee\n[\n3\n]\nor\n[\n4\n]\n)\n:-\nDuring the four semesters that Courant served as\nHilbert\n's assistant, Hilbert was devoting himself almost exclusively to subjects in analysis ... Courant took to analysis as if it were his natural element. All his future mathematical work was to be done in subjects to which he was introduced during his student days by\nHilbert\n.\nCourant obtained his doctorate from Göttingen in\n1910\nunder\nHilbert\n's supervision. His thesis was entitled\nÜber die Anwendung des Dirichletschen Prinzipes auf die Probleme der konformen Abbildung\nⓉ\n(\nOn the application of  Dirichlet's principle to the problems of  conformal mappings\n)\n. Late in\n1910\nhe began his year of compulsory military service.\nHensel\noffered him a place at Marburg to work for his\nhabilitation\nwhich he would have accepted had he not received an offer from\nHilbert\nto study at Göttingen for the habilitation just as he was about to reply to\nHensel\n. He accepted\nHilbert\n's offer but once he left military service he had some financial problems since he was sending a regular allowance to his parents in Berlin. Courant began to tutor again to help out his finances.\nFor his habilitation thesis Courant again worked on the\nDirichlet\nprinciple. The thesis accepted, he gave his inaugural lecture\nOn existence proofs in mathematics\non\n23\nFebruary\n1912\n. He then became a mathematics lecturer at Göttingen until the start of World War I but this was not a particularly productive period for him mathematically. He had married Nelly Neumann in the summer of\n1912\n, a friend from his days in Breslau who was also a mathematician.\nWhen war broke out Courant was drafted into the army. Before he saw action he became seriously ill with typhoid fever. He returned to his unit and was involved in fighting which saw half his fellow soldiers killed. He made a suggestion about designing a telegraph system which used the earth as a conductor and he was allowed to return to Göttingen to discuss the idea. At Göttingen his idea was put into practice and a box to transmit signals produced. Courant returned to his unit with his communications box.\nOn the\n27\nSeptember\n1915\nCourant was wounded and received leave. Soon after he was divorced from Nelly Neumann. Although Courant returned to the front it is probably no exaggeration to say that his piece of communications equipment saved his life, for Courant spent time training men to use it and avoided the worst of the fighting. Courant found time to carry on with his mathematics research too. When Springer started the new journal\nMathematische Zeitschrift\nin January\n1918\n, one of Courant's papers, written while he was in the army, appeared in the second issue.\nAfter the war, in December\n1918\n, Courant returned to Göttingen. He married Nerina Runge, Carle\nRunge\n's daughter, on\n22\nJanuary\n1919\nand a couple of months later began teaching as a\nprivatdozent\nat Göttingen. This was a period of intense research activity for Courant. In the spring of\n1920\nhe accepted the chair of mathematics at Münster when\nKilling\nretired. However, after a few months\nHilbert\nand\nKlein\narranged for him to return to Göttingen to replace\nHecke\nwho had gone to Hamburg.\nIn\n1922\nCourant founded the university's Mathematics Institute but at this stage it was only a concept with no special building - it was\n1927\nbefore the building was constructed. In\n1922\nCourant published a book on function theory. It was a joint publication with\nHurwitz\n, although\nHurwitz\nhad died in\n1919\n. Based on\nHurwitz\n's lectures, Courant added material of his own. Some people such as\nKellogg\ndisliked the book. However,\nFriedrichs\nwho was a student at the time wrote:-\n... the Courant section, the third chapter - when I got hold of that chapter, I started reading one morning, I read morning and night without stopping. It was the most breathtaking book I have ever read in mathematics.\nOther important mathematics which Courant published around this time was work on\neigenvalue\n, in particular proofs of existence. In\n1924\nhe published, jointly with\nHilbert\n, an important text\nMethoden der mathematischen Physik\nⓉ\n(\nMethods of mathematical physics\n)\n. Again Courant was the sole author and the contribution from\nHilbert\nwas in the form of lecture notes.\nHilbert\n's interests had moved away from mathematical physics by this time and he did not take any more than a passing interest that Courant was writing the text. In\n1925\n, with\nFriedrichs\nas his assistant, Courant began work on a second volume of Courant-\nHilbert\n.\nBy\n1928\nthe new Mathematics Institute, begun the previous year, neared completion. It was formally dedicated on\n2\nDecember\n1929\n. Invited to lecture in the United States in\n1932\nCourant visited the major universities there.\nCourant was expelled from Göttingen when the Nazis came to power in\n1933\n. On\n30\nJanuary\n1933\nHitler came to power and in March Courant left Göttingen for his spring holiday in Arosa in Switzerland. He had been hoping not only to have a holiday, but to complete the second volume of Courant-\nHilbert\nwhen away from his duties in the Mathematics Institute.\nFriedrichs\nwas with Courant to help with the book. Political events destroyed his plans, however, and he returned to Göttingen at the beginning of April on advice from members of the Institute. On\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which exempted non-Aryans who had fought for Germany in World War I. Certainly Courant came under the exemption clause and he expected to be unaffected.\nOn\n5\nMay Courant received an official letter telling him he was on forced leave.\nWeyl\nwas made director of the Mathematics Institute and he made every effort to have Courant reinstated. Meanwhile attempts were made to offer Courant posts elsewhere. He was offered a position in Istanbul, he considered it enough to make a trip there, but eventually turned it down. Invited to Cambridge in England for a one year visit, he applied for leave\n(\nslightly strange that he had to do so since he was already on forced leave\n)\n. His forced leave was changed to ordinary leave and Courant left for England, going to New York University the following year.\nThe first few months in New York were difficult. He was poorly paid, there were no mathematicians of quality on the staff and the students he taught he found very badly prepared. However, he invited as many mathematicians as possible to lecture there. By June\n1935\nhe had been offered a permanent post and it was suggested that he might try to build a strong graduate school. In\n1936\nhe was offered a professorship at New York University and given the task of building a graduate centre. Again he had a mostly successful collaboration with his students. He had to get on well too with administrators in educational and financial institutions for the project to succeed and although he could charm such people he could also offend them, though he did not always realise that he had done so.\nCourant built up an applied mathematics research centre in New York based on the Göttingen model, making many new appointments such as\nFriedrichs\n. Numerous mathematicians who were forced to leave Germany in the years before the start of World War II, were given help by Courant to obtain positions in the United States.\nIn\n1940\n-\n41\nhe worked on a new book with\nHerbert Robbins\n, a young topologist from Harvard. This book was\nWhat is mathematics?\nand it records Courant's views of mathematics. His aim, as he writes in the Preface, is to set the reader:-\n... on a straight road from the very elements to vantage points from which the substance and driving force of modern mathematics can be surveyed.\nThe book was highly successful both in terms of sales and reviews.\nPerhaps one of Courant's most famous pieces of mathematics from around this time was his \"finite element method\". In fact this method first appeared in an existence proof of a version of the\nRiemann\nmapping theorem in the\nHurwitz\n-Courant book of\n1922\n. The idea appeared again as a footnote in the Courant-Hilbert publication\nMethoden der mathematischen Physik\nⓉ\n(\nMethods of mathematical physics\n)\nin\n1924\n. The first application as a numerical method, however, was given by Courant in\n1943\nin his solution of a torsion problem. The name \"finite element method\" was not due to Courant, however, but appears only in the\n1960\ns.\nFrom\n1947\nuntil his death Courant visited Germany almost every summer. He never seems to have considered returning there, however, for he seemed by then firmly established in the United States. From\n1953\nto\n1958\nhe was director of his new Institute of Mathematical Sciences at New York University, which in\n1964\nwas named the Courant Institute after him. It is fair to say that this was a far greater achievement for Courant than was the Mathematics Institute at Göttingen. At Göttingen he arrived in a place filled with mathematicians of outstanding talent. In New York he began with nothing, after experiencing almost the destruction of his Göttingen Institute through the racial policies of the Nazis. That he was able to create the Courant Institute starting from nothing is a quite phenomenal achievement. He suffered a stroke on\n19\nNovember\n1971\n, was taken to hospital in New Rochelle where he died two months later.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Kneser",
    "Landsberg",
    "Rosanes",
    "Toeplitz",
    "Hellinger",
    "Hilbert",
    "Minkowski",
    "Haar",
    "Hensel",
    "habilitation",
    "Dirichlet",
    "Runge",
    "privatdozent",
    "Killing",
    "Klein",
    "Hecke",
    "Hurwitz",
    "Kellogg",
    "Friedrichs",
    "eigenvalue",
    "Weyl",
    "Herbert Robbins",
    "Riemann"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}