{
  "nome_completo": "Robert Wertheimer Frucht",
  "nome_curto": "Roberto Frucht",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frucht/",
  "data_nascimento": "9 August 1906",
  "local_nascimento": "Brünn, Austria-Hungary, now Brno, Czech Republic",
  "data_morte": "26 June 1997",
  "local_morte": "Valparaiso, Chile",
  "summary": "Roberto Frucht was a Czech-born mathematician who moved to Chile before the Second World War. He worked in group theory and graph theory.",
  "biografia": "Roberto Frucht\nwas known as Robert Frucht until he went to South America in\n1939\nwhen he changed his name to Roberto Frucht. Roberto's father, Rudolf Frucht, was an editor who had Jewish relations. In\n1908\nthe family moved to Berlin and it was in that city that Frucht was brought up. His education began at the\nGymnasium\nAskanische in Berlin in\n1912\n. The Askanische Gymnasium, at\n24\nto\n26\nHallesche Strasse in the district Tempelhof district of Berlin, had been founded in\n1875\nand its first headmaster was Woldemar Ribbeck\n(1830\n-\n1902)\n. When Frucht entered the school the director was Adolf Busse\n(1856\n-\n1942)\n. Frucht passed his matriculation examination at Michaelmas\n1924\n(\nin September\n)\ngiving him the right to study at university.\nWhile he was studying at school, he became fascinated by the new developments in physics. The theory of relativity and quantum mechanics were, at this time, changing the nature of physics and the young Frucht wanted to be part of this revolution but was unsure whether reading mathematics or physics at university would be the right route to follow. He was still undecided when he entered the University of Berlin in\n1924\n.\nTaking courses in mathematics, physics and philosophy during his first few semesters at university convinced Frucht that physics was not for him. It was not the theoretical side which put him off since he enjoyed this aspect of the topic but rather it was the experimental side. Frucht quickly realised that he lacked the necessary manual dexterity to be a successful experimental physicist so came more and more to concentrate on mathematics. However, it was the mathematics relevant to the theory of relativity, namely the tensor calculus and its applications to higher dimensional differential geometry, that was his main interest. When he was looking for someone who could be his thesis advisor on this topic he realised that this was not going to be possible at the University of Berlin. He therefore went to\nIssai Schur\n, a lecturer whom he greatly admired for his outstanding lecturing style, and asked him if he would act as his thesis advisor.\nSchur\nwas happy to be Frucht's thesis advisor but only on the condition that he undertook research on group theory. He completed work on his thesis\nÜber die Darstellung endlicher Abelscher Gruppen durch Kollineationen\nⓉ\n(\nOn the representation of finite Abelian groups by collineations\n)\nand was examined on\n16\nJanuary\n1930\nby\nIssai Schur\nand\nLudwig Bieberbach\n. On\n14\nMarch\n1930\n, he submitted a paper based on his thesis to the\nJournal für die reine und angewandte Mathematik\n. In his thesis Frucht lists all the professors who taught him at the University of Berlin:\nLudwig Bieberbach\n,\nGeorg Feigl\n,\nHeinz Hopf\n, Wolfgang Köhler\n(1887\n-\n1967)\n,\nKarl Löwner\n,\nRichard von Mises\n, Walther Nerst\n(1864\n-\n1941)\n,\nMax Planck\n,\nAlfred Pringsheim\n, Emil Rupp\n(1898\n-\n1979)\n,\nErhard Schmidt\n, Wilhelm Schlenk\n(1879\n-\n1943)\n,\nErwin Schrödinger\n,\nIssai Schur\n, Edward Spranger\n(1882\n-\n1963)\n, Arthur Wehnelt\n(1871\n-\n1944)\nand Max Wertheimer\n(1880\n-\n1943)\n. He was awarded a doctorate 'magna cum laude' in\n1931\n. It is worth noting that, despite moving from physics to mathematics,\nMax Planck\ntold him after examining him in physics:-\n... hopefully my physics students understand physics as well as you.\nIn\n1930\nthe family home was in Dieffenbachstrasse in the Kreuzberg district of Berlin but, by this time Rudolf Frucht, Roberto's father, had lost his job and Frucht felt that he had to earn money to support the family. Since university jobs as a mathematician were scarce and since, as a Czechoslovakian citizen, he was not eligible to be a Gymnasium teacher in Germany, he took a position as an actuary in an Italian Insurance Company in Trieste, Italy. He writes\n[\n4\n]\n:-\nMy work there had little to do with mathematics; rather I had to dictate business letters in German to an Italian typist who, although very efficient, soon lost her job - because she became my wife. ... Form a mathematical point of view, however, that period of my life was rather boring ...\nThe Italian typist whom Frucht married in\n1932\nwas Maria Mercedes Bertogna Posselt; they had one child, a daughter Erica. Despite Frucht saying that this was a boring period for his mathematics, he did publish a number of papers. Some were related to his actuarial work, particularly annuities, such as\nUn modo semplice di estrapolare le rendite vitalizie secondo il tasso d'interesse\nⓉ\n(\nAn easy way to extract the annuity according to the interest rate\n)\n(1934)\n,\nL'assicurazione addizionale dell'essenzione dal pagamento dei premi vita decrescenti in caso d'invalidità totale\nⓉ\n(\nThe additional insurance of exemption from the payment of diminishing life premiums in the event of total disability\n)\n(1934)\nand\nSulle relazioni che esistono fra due tipi di formule proposte per il calcolo approssimato delle rendite vitalizie\nⓉ\n(\nOn the relations that exist between the two types of formulas proposed for the approximate calculation of annuities\n)\n(1936)\n. Other papers, however, continued his mathematical interests:\nBestimmung der Hyperflächen mit konformer hypersphärischer Abbildung\nⓉ\n(\nDetermination of hypersurfaces with conformal hyper spherical imaging\n)\n(1934)\n. Notice that he was writing actuarial papers in Italian but mathematical papers in German.\nFrucht explains in\n[\n4\n]\nhow he became a graph theorist:-\n... one day in\n1936\nI received from the Akademische Verlagsgesellschaft a catalogue containing a description of\nDénes König\n's book 'Theorie der endlichen und unendlichen Graphen'.\nⓉ\n(\nTheory of finite and infinite graphs\n)\nSince Chapter\n8\npromised applications to group theory, I immediately ordered the book, and beginning with the day it arrived I became an enthusiastic graph theorist.\nIn fact Chapter\n8\nwas entitled \"Logik, Theories der Spiele, Gruppentheorie\"\nⓉ\n(\nLogic, theories of games, group theory\n)\n. Section\n5\nof this chapter, the final section, was about\nCayley\ndiagrams for groups. One of the questions that\nDénes König\nposed in this book concerned automorphisms of graphs and, after working on the problem for some time, Frucht was able to solve it. He began to publish papers relating to graph theory and group theory:\nDie Gruppe des Petersenschen Graphen und der Kantensysteme der regulären Polyeder\nⓉ\n(\nThe group of Petersen's graph and edge systems of regular polyhedra\n)\n(1937)\nand\nHerstellung von Graphen mit vorgegebener abstrakter Gruppe\nⓉ\n(\nProduction of graphs with a given abstract group\n)\n(1938)\n. This second paper contained the answer to\nKönig\n's question. In it Frucht proved what today is known as 'Frucht's Theorem', namely that given any finite group\nA\nA\nA\nthere exists a graph\nG\nG\nG\nwhose automorphism group is isomorphic to\nA\nA\nA\n. Also in this paper, Frucht gives a\n3\n-regular graph with\n12\nvertices and\n18\nedges which has a trivial automorphism group. This graph is today known as the 'Frucht graph'.\nIn\n1938\nItaly began to introduce racial laws, for instance Regio Decreto\n17\nNovembre\n1938\nNr.\n1728\nbanned books written by Jews, and preventing Jews holding public office or university appointments. He left his position as an actuary with the Italian Insurance Company in Trieste in\n1938\nand by early\n1939\n, feeling that his future in Europe was uncertain and seeing that war was inevitable, he decided that he had to emigrate to allow his family to live in peace. His wife, Mercedes, had family in Argentina so they decided to move there. Frucht managed to find work as an actuary at an insurance company in Buenos Aires.\nRobert Hermann Breusch had been a mathematics student at the University of Freiburg, but had spent considerable time studying in Berlin taking courses by\nIssai Schur\nand\nRichard von Mises\n. Frucht and Breusch were about the same age and they became friends at that time. Breusch was not Jewish but he was engaged to marry Kate Dreyfuss who was Jewish. Breusch emigrated to Chile in\n1936\nand found a position at the University Santa Maria in Valparaiso. In\n1939\nBreusch and his wife Kate\n(\nby this time they had married\n)\nemigrated to the United States and Breusch wrote to Frucht, by this time working in Buenos Aires, asking him if he would consider the academic position at the University Santa Maria in Valparaiso. He happily accepted the invitation and by the autumn of\n1939\nhe was teaching elementary courses in Valparaiso. He was made dean of the Faculty of Mathematics and Physics in\n1948\n. He continued in this position until\n1968\n.\nFrucht's abilities as a teacher are described in\n[\n5\n]\n:-\nThose of us who were his students received from him a solid and complete mathematical training. He was an outstanding teacher, methodical and extremely orderly in his presentation, and he managed this at all levels of education despite a heavy workload. With his powerful voice and his lively, frank and intelligent gaze, he displayed his expertise in a rigorous and very pleasant way. He wrote all the details on the board legibly, which helped us make excellent grades which have sustained us for years.\nAfter taking up the position at the University Santa Maria in Valparaiso, Frucht published articles on group theory, on graph theory and on other mathematical topics. For example, early in his career in Chile he published the group theory papers\nCoronas of groups and their subgroups, with an application to determinants\n(\nSpanish\n)\n(1942)\n,\nThe subgroups of the complete monomial groups of degree\n2\n(\nSpanish\n)\n(1944)\n,\nOn certain invariants of finite groups\n(\nSpanish\n)\n(1945)\nbut continued later to publish group theory papers such as\nRemarks on finite groups defined by generating relations\n(1955)\nand\nGeneralization of a theorem of Carmichael on direct products\n(\nSpanish\n)\n(1960)\n. Many of Frucht's graph theory papers involve both groups and graphs such as\nOn the groups of repeated graphs\n(1949)\n,\nGraphs of degree three with a given abstract group\n(1949)\nand\n(\nwith\nFrank Harary\n)\nOn the corona of two graphs\n(1970)\n. Frucht and\nHarary\n's introduction to this paper reads:-\nOur object in this note is to construct a new and simple operation on two graphs\nG\n1\nG_{1}\nG\n1\n​\nand\nG\n2\nG_{2}\nG\n2\n​\n, called their corona, with the property that the group of the new graph is in general isomorphic with the wreath product of the groups of\nG\n1\nG_{1}\nG\n1\n​\nand\nG\n2\nG_{2}\nG\n2\n​\n.\nExamples of Frucht's graph theory papers are\nA one-regular graph of degree three\n(1952)\n,\nHow to describe a graph\n(1970)\n, and\nA canonical representation of trivalent Hamiltonian graphs\n(1970)\n. Example of his papers on combinatorics are\n(\nwith\nGian-Carlo Rota\n)\nThe Möbius function for partitions of a set\n(\nSpanish\n)\n(1963)\n,\nOn inequalities and extreme values of symmetric functions on the sides of a triangle\n(1964)\n,\n(\nwith\nGian-Carlo Rota\n)\nBell polynomials and partitions of abstract sets\n(\nSpanish\n)\n(1965)\n, and\nA combinatorial approach to the Bell polynomials and their generalizations\n(1969)\n.\nIn\n1970\nFrucht retired and was made professor emeritus. He continued to live in Valparaiso and devoted much time to mathematical research. Conditions for mathematicians in Chile became very difficult after a military coup took place in\n1973\n. The universities lost many of their students and many foreign professors left the country. Frucht remained faithful to Chile although across the country as a whole, mathematical research almost stopped completely. Frucht however, continued to undertake research and publish his results although, we note, from around that time his publications are in English rather than Spanish. By the early\n1980\ns research in mathematics, and science in general, began to be supported in Chile although it was not until\n1990\nthat a democratic government ruled the country.\nAllow me\n[\nEFR\n]\nto relate a personal connection with Frucht. On\n14\nJanuary\n1975\nDonald Coxeter\nwrote to\nJohn Leech\nasking if he could help with a computer investigation of a class of groups call\nF\na\n,\nb\n,\nc\nF^{a,b,c}\nF\na\n,\nb\n,\nc\n.\nLeech\nforwarded\nCoxeter\n's letter to me and my colleague Colin Campbell since he knew we had expertise in this type of problem. We began to correspond with\nLeech\nin Scotland,\nCoxeter\nin Canada, Frucht in Chile and Abe Sinkov in Arizona who were all working on the problem.\nCoxeter\nwrote on one occasion:-\nThe groups F\na,b,c\narose because some of them have\nCayley\ndiagrams which are '\n0\n-symmetric' or 'faithful' graphs. I am writing a paper on such groups jointly with Foster, Frucht and Watkins. This is progressing very slowly.\nIn fact the paper\nCoxeter\nrefers to was never written. R M Foster was a leading electrical engineer who, in the\n1920\ns, became interested in symmetrical graphs that could be used as electrical networks. For many decades he worked at this subject partly from a professional viewpoint and partly from a recreational one. At a conference held in Waterloo, Ontario, in April\n1966\n, Foster presented a census of symmetric trivalent graphs with up to\n400\nvertices. In a letter Colin Campbell and I wrote to\nCoxeter\non\n7\nOctober\n1975\n, we made \"the\nF\na\n,\nb\n,\nc\nF^{a,b,c}\nF\na\n,\nb\n,\nc\nconjecture\" which, over thirty years later, was proved to be true. In\n1978\nCoxeter\nand Frucht presented a paper\nA new trivalent symmetrical graph with\n110\nvertices\nto the 'Second International Conference on Combinatorial Mathematics' held in New York.\nCoxeter\n, Frucht and Powers published a book\nZero-symmetric graphs\nin\n1981\n. These graphs are finite connected graphs of valency three for which the full automorphism group acts regularly on the vertices. Such graphs are both vertex-transitive and edge-transitive. The groups\nF\na\n,\nb\n,\nc\nF^{a,b,c}\nF\na\n,\nb\n,\nc\nyield many examples of graphs of this type with one generating involution and these examples are studied in the book.\nThe paper\n[\n5\n]\ncontains a number of entertaining anecdotes relating to Frucht. For example, we learn that he smoked both inside and outside the classroom. He had a reputation as a car driver of an old Simca car, mainly gained through jokes he made about his own driving. For example he joked that he had a Mercedes, but it was his wife not his car\n[\n5\n]\n:-\nHe continued driving until a very advanced age but the rumour was that his ability with advanced mathematics was far beyond his ability to drive.\nThe authors of\n[\n5\n]\ncomment that everyone knew him as \"El Toro Frucht\" but nobody was sure how he got that nickname\n[\n5\n]\n:-\nAn intensive investigation of the origin of that nickname was not conclusive. Some students thought that was his name, while others attributed it to his pronunciation of the Greek letter \"mu\"; it may have been simply that his deep voice, his German accent and his tendency to say \"eehh, eehh ...\" sounded like mooing to students who were looking for a nickname.\nAn Electrical Engineering student of his in the\n1970\ns comments\n... his nickname \"Toro Frucht\" was because he made a kind of guttural sound while he was searching in his mind for the correct word in Spanish to answer questions from his students. For us it sounded like a fighting bull getting ready to attack.\nAn American visitor was entertained by Frucht and his wife Mercedes. He afterwards said\n[\n5\n]\n:-\nThere I had a wonderful experience in dynamic linguistic evolution. Roberto and Mercedes usually conversed in a mixture of Castilian, Italian, French and German but because of my presence, they added English to the list that day. None of us knew what language the next word would be in, but the three of us understood everything. An amazing but delightful experience.\nOne of his students described his personality:-\nIn meetings and conversations, his arguments always had a crushing logic, which was a clear manifestation of his mental mathematical thinking. His frankness was sometimes disconcerting, but very sincere, genuine and well-intentioned. He did not hesitate to point out our mistakes, but corrected them only with the aim of improving them. And his modesty was proverbial. He had an excellent and fine sense of humour and laughed often with frank and sincere laughter.\nFrucht received many honours. He was a founding member of the\nMathematical Society of Chile\nwhich met informally in the late\n1970\ns and became legally incorporated in\n1983\n. Frucht was elected president of the Society. In\n1976\nhe was made an honorary editor of the\nJournal of Graph Theory\n, awarded the \"Gabriela Mistral\", Knight's Class, by the Ministry of Education in\n1978\n, and elected a member of the Chilean Academy of Sciences in\n1979\n. Volume\n6\n, Issue\n2\n, of the\nJournal of Graph Theory\ncontained articles \"to honour Roberto Frucht.\" The first two articles in this issue are\n[\n7\n]\nand\n[\n4\n]\n.\nHis death was announced by the\nAmerican Mathematical Society\n[\n3\n]\n:-\nRobert W Frucht, professor emeritus at Santa Maria University, Valparaiso, Chile, died on June\n26\n,\n1997\n. Born August\n9\n,\n1906\n, he was a member of the Society for\n29\nyears.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Issai Schur",
    "Schur",
    "Ludwig Bieberbach",
    "Georg Feigl",
    "Heinz Hopf",
    "Karl Löwner",
    "Richard von Mises",
    "Max Planck",
    "Alfred Pringsheim",
    "Erhard Schmidt",
    "Erwin Schrödinger",
    "Dénes König",
    "Cayley",
    "König",
    "Frank Harary",
    "Harary",
    "Gian-Carlo Rota",
    "Donald Coxeter",
    "John Leech",
    "Leech",
    "Coxeter",
    "Mathematical Society of Chile",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}