{
  "nome_completo": "Robert McNair Ferguson",
  "nome_curto": "Robert Ferguson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferguson/",
  "data_nascimento": "8 July 1829",
  "local_nascimento": "Airdrie, Lanarkshire, Scotland",
  "data_morte": "31 December 1912",
  "local_morte": "Edinburgh, Scotland",
  "summary": "Robert Ferguson was a founder member of the Edinburgh Mathematical Society and became their fifth President.",
  "biografia": "Robert Ferguson\n's father was  John Ferguson\n(\nborn in Airdrie, Lanarkshire in\n1795\n; died in\n1883)\nwho was a pawn-brokers clerk. His mother was  Elizabeth Cochrane\n(\nborn in Airdrie, Lanarkshire in\n1797\n, died in\n1876)\n. Robert Ferguson had three younger sisters: Anne\n(\nborn\n1835)\n, Janet\n(\nborn\n1841)\nand Margaret\n(\nborn\n1844)\n. Robert Ferguson's birthdate is given as\n1928\nin his obituaries\n(\nsee below\n)\nbut this seems to be wrong.\nRobert Ferguson's family moved from Airdrie to Edinburgh when Robert was three years old. He was a pupil at the school attached to the Free Church Training College at Moray House, becoming an assistant master and then a lecturer at the Training College. During this period, beginning in\n1843\n, he studied at the University of Edinburgh and at New College. After being awarded an M.A. with First Class Honours in Mathematics, Natural Philosophy and Philosophy by the University of Edinburgh, he studied under Bunsen in Heidelberg and was awarded a Ph.D. from the University of Heidelberg in\n1855\n.\nIn\n1858\n, in partnership with a Mr Bickerton, he took over running the Edinburgh Institution at\n8\nQueen Street, Edinburgh. He was a Partner and Joint Headmaster from\n1858\nto\n1875\n, then Headmaster until he retired in\n1898\n.\nFerguson married Janet Margaret Monteith on\n13\nAugust\n1864\nin Edinburgh and they had two children: Duncan\n(\nborn\n1872)\nand James\n(\nborn\n1876)\n. After Janet's death he married Mary Leslie\n(\nor Marjoribanks\n)\nin Edinburgh in\n1896\n.\nFurther details of his life are given in two obituaries which we present at\nTHIS LINK\nand\nTHIS LINK\n.\nLet us note that Ferguson was a founder member of the\nEdinburgh Mathematical Society\n, joining the Society at its first meeting in February\n1883\n. He was elected President of the Society for session\n1885\n-\n86\n. He gave his presidential address to the Society on leaving office on Friday\n12\nNovember\n1886\n:-\nOn the occasion of demitting his office, Dr Ferguson delivered an address in which he congratulated the Society on its vigorous growth and encouraging prospects. He contrasted the state of mathematical education at the universities now with that which prevailed thirty years ago, and expressed a hope for the further improvement of these institutions by an increased staff of extra and infra-mural lecturers. In adverting to the position of mathematical masters in secondary schools, he thought that they should more frequently be entrusted with the highest authority. After a few remarks on the methods of mathematical tuition, he pointed out the desirability of continuing to widen the work of the Society in the interests of such professions as those of the engineer and the actuary.\nRobert Ferguson was elected to the\nRoyal Society of Edinburgh\non\n6\nJanuary\n1868\n, his proposers included Philip Kelland. An obituary, written by Andrew E Scougal, appears in\nProc. Roy. Soc. Edinb\n.\n33\n(1912\n-\n13)\n,\n342\n-\n5\n.",
  "matematicos_citados_na_biografia": [
    "THIS LINK",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh"
  ],
  "imagens": []
}