{
  "nome_completo": "Robert de Montessus de Ballore",
  "nome_curto": "Robert de Montessus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Montessus/",
  "data_nascimento": "20 May 1870",
  "local_nascimento": "Villeurbanne, Rhône, France",
  "data_morte": "26 January 1937",
  "local_morte": "Arcachon, Gironde, France",
  "summary": "Robert de Montessus was a French mathematician, known for his work on continued fractions and Padé approximants.",
  "biografia": "Robert de Montessus de Ballore\nwas born in Villeurbanne, in the suburbs of Lyon. His father, Philippe-George\n(1825\n-\n1890)\n, was an officer in the French army who had graduated from the Saint Cyr military school. He left the French army to become a farmer in the Charolais. Robert's mother was a great-granddaughter of Philibert de Commerson, a naturalist on Bougainville's expedition and a member of the\nFrench Academy of Sciences\n. Robert was the youngest of his parents' four children. The oldest child was Fernand\n(1851\n-\n1923)\n, who graduated from the École Polytechnique and became a famous seismologist.\nRobert de Montessus obtained his baccalaureate in\n1886\n. He continued his education at Saint Étienne for two further years. Unfortunately, his parents were on the road to financial ruin. Thus, he joined the French army but left in\n1893\nto take up a job at the Compagnie des Chemins de Fer de Paris à Lyon et à la Méditerranée.\nDuring the years\n1895\n-\n1902\n, Robert de Montessus taught in different secondary schools\n(\nin Evreux, Yzeure, and Senlis\n)\n. During the academic year\n1898\n-\n1899\n, he followed the lectures of\nPaul Appell\n,\nGaston Darboux\nand\nÉmile Picard\nat the Sorbonne. Thus, he obtained his Licence ès Sciences on\n24\nOctober\n1901\n. Next, he worked for his doctorate in mathematics under Appell's supervision.\nThe first contribution of Robert de Montessus in mathematics was to help\nGiuseppe Peano\nin editing the Introduction of the\nFormulaire\nⓉ\n(\nFormulary\n)\nin\n1897\n.\nIn\n1902\n, his friend, the French mathematician Robert d'Adhémar, helped him to join the Catholic University of Lille. In the same year, Robert de Montessus published a paper entitled\nSur les fractions continues algébriques\nⓉ\n(\nOn  algebraic continued fractions\n)\nin the\nBulletin de la Société Mathématique de France\n. In this paper he proved his famous theorem on the convergence of the rows of a\nPadé\n's table associated to a meromorphic function analytic at the origin. At the same time,\nHenri Padé\nworked on related topics and the two mathematicians were in contact. However, they ended up arguing about the priority of certain convergence results\n(\nsee\n[\n2\n]\n)\n.\nIn\n1903\n, Robert de Montessus became Maître de Conférences at the Lille Catholic University.\nRobert de Montessus defended his doctoral thesis\nSur les fractions continues algébriques\nⓉ\n(\nOn  algebraic continued fractions\n)\non\n8\nMay\n1905\n. The examiners were his supervisor\nPaul Appell\n, together with\nHenri Poincaré\nand\nÉdouard Goursat\n. In the first part of the thesis, Robert de Montessus dealt with different problems of convergence of algebraic continued fractions. The second part was on probabilities\n(\nerrors theory\n)\n. The first part of his thesis was published in the\nRendiconti del Circolo Mathematico di Palermo\nin\n1905\n.\nIn\n1906\n, the subject proposed for the Grand Prix of the\nParis Academy\nof\n1906\nwas on the convergence of algebraic\ncontinued fractions\n. The Grand Prix was awarded to Robert de Montessus,\nHenri Padé\nand A Auric\n(\nsee\n[\n2\n]\n)\n. Moreover, Montessus de Ballore's theorem was soon cited by mathematicians such as\nEdward van Vleck\n,\nNiels Norlund\n,\nOskar Perron\nand\nEdwin Wilson\n.\nJoseph Walsh\ncited the theorem in\n1935\nand again after World War II. Today, the Robert de Montessus theorem remains of great interest\n(\nsee\n[\n4\n]\n)\n.\nRobert de Montessus married Suzanne Montaudon\n(1884\n-\n1983)\non the\n29\nMarch\n1906\n.\nIn\n1908\n, Robert de Montessus wrote a book on probability theory entitled\nLeçons élémentaires sur le Calcul des Probabilités\nⓉ\n(\nBasic rules of probability theory\n)\n. From this text it is clear that Robert de Montessus was familiar with the work of\nLouis Bachelier\non the theory of speculation\n(\nsee\n[\n3\n]\n)\n. De Montessus continued to publish works on continued fractions up to\n1909\n. Afterwards, he wrote papers on algebraic space curves and the paramatrisation of such a curve by elliptic functions. So, he followed\nGeorge Halphen\n's works.\nAt the beginning of World War I, he left Lille. During the war, he gave some lectures at the Sorbonne, particularly on\nelliptic functions\nand algebraic space curves. In\n1917\n, Robert de Montessus joined the editorial team of the\nJournal de Mathématiques Pures et Appliquée\nheaded by\nCamille Jordan\n. In the same year de Montessus was employed to work on ballistics by the French government.\nAfter\n1919\n, Robert de Montessus devoted much attention to the\ntheory of probability\nand applied statistics. In fact he was in correspondence with several Belgian mathematicians such as\nPaul Mansion\n,\nCharles de La Vallée Poussin\n, Maurice Alliaume, but also with\nMaurice Fréchet\nand Charles Jordan. In\n1924\n, he was appointed as a researcher at the French National Office of Meteorology at Paris. In\n1925\n, he published a book, in collaboration with\nJosé Duarte\n, on tables for\nlog\n⁡\nn\n!\n\\log n!\nlo\ng\nn\n!\n.\nIn\n1919\n, Robert de Montessus created the\nIndex Generalis\n(\nsee\n[\n5\n]\n)\n, a very ambitious project as explained by Henri Villat\n(\nsee\n[\n7\n]\n)\n:-\nAbout twenty years ago, de Montessus undertook the publication of the \"Index Generalis\", an annual reference work now well known throughout the scientific world and of inestimable value to every investigator. It is hard to conjecture the number of practical difficulties which de Montessus had to overcome in organizing this immense mass of data on the universities and learned societies of the world; the scientific qualities of which he had given evidence elsewhere came to his aid here.\nBetween the two world wars, Robert de Montessus gave courses of lectures on various branches of mathematics in Warsaw, Kraków, Lwów\n(\nnow Lviv in Ukraine\n)\n, Budapest, Vienna and at other universities such as Lausanne and Geneva.\nIn conclusion, let us quote from Henri Villat\n(\nsee\n[\n6\n]\n)\n:-\nRobert de Montessus est mort au début de l'année\n1937\nd'une façon brusque et inattendue; il a laissé autour de lui le souvenir d'un savant modeste et consciencieux, d'un homme droit et d'un ami sûr\nⓉ\n(\nRobert Montessus died in early\n1937\nin a sudden and unexpected fashion; He left the memory of a humble and conscientious scholar, a straight man and a true friend\n)\n.\nEn\n1917\n,\nCamille Jordan\navait introduit R de Montessus à la rédaction du Journal de Mathématiques. La direction du journal tient à donner ici à sa mémoire un hommage auquel il aurait été sensible, et un souvenir ému.\nⓉ\n(\nIn\n1917\n,Camille Jordan had introduced R de Montessus as editor of the Journal of Mathematics. The Journal wants to give a well-merited tribute in his fond memory\n)",
  "matematicos_citados_na_biografia": [
    "French Academy of Sciences",
    "Paul Appell",
    "Gaston Darboux",
    "Émile Picard",
    "Giuseppe Peano",
    "Padé",
    "Henri Padé",
    "Henri Poincaré",
    "Édouard Goursat",
    "Paris Academy",
    "continued fractions",
    "Edward van Vleck",
    "Niels Norlund",
    "Oskar Perron",
    "Edwin Wilson",
    "Joseph Walsh",
    "Louis Bachelier",
    "George Halphen",
    "elliptic functions",
    "Camille Jordan",
    "theory of probability",
    "Paul Mansion",
    "Charles de La Vallée Poussin",
    "Maurice Fréchet",
    "José Duarte"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}