{
  "nome_completo": "Robert John Tainsh Bell",
  "nome_curto": "Robert J T Bell",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bell_Robert/",
  "data_nascimento": "15 January 1876",
  "local_nascimento": "Falkirk, Stirlingshire, Scotland",
  "data_morte": "8 September 1963",
  "local_morte": "Dunedin, New Zealand",
  "summary": "Robert Bell graduated from Glasgow University. He was appointed to a professorship at the University of Otago in New Zealand. He worked in Geometry.",
  "biografia": "Robert J T Bell\n's name is given as John Tainsh Bell on his birth certificate, so he must have added the Robert later. His father was the Rev George Bell, a congregational minister and his mother was Margaret Walker Scott. Robert studied at Hamilton Academy, Lanarkshire, and then entered the University of Glasgow. He was awarded an M.A. with First Class Honours in Mathematics and Natural Philosophy by Glasgow in\n1898\n, then remained at the University employed as a tutorial assistant. At this time he lived at Portland Park, Hamilton. He married Agnes Thomson in\n1902\n.\nBell was promoted to Lecturer in Mathematics at Glasgow and awarded a D.Sc. by the University in\n1911\nfor his treatise\nCoordinate Geometry of Three Dimensions\n. He continued to work in Glasgow until\n1920\nwhen he was appointed Professor of Pure and Applied Mathematics at the University of Otago, Dunedin, New Zealand.\nThree universities honoured Bell with honorary degrees; he received LL.D. from Glasgow in\n1932\n, Sc.D. from Cambridge in\n1948\n, and LL.D. from Otago in\n1962\n.\nBell was a member of the\nEdinburgh Mathematical Society\n, joining the Society in March\n1899\n. He served the Society as editor of the\nProceedings\nfrom\n1911\nuntil he left Edinburgh to take up the Professorship at the University of Otago. He contributed papers to meetings of the Society such as\nNote on the axes of a normal section of the enveloping cylinder of a conchoid\nto the meeting on Friday\n9\nJanuary\n1914\n.\nRobert John Tainsh Bell was elected to the\nRoyal Society of Edinburgh\non\n6\nMarch\n1916\n, his proposers being\nGeorge Alexander Gibson\n,\nAndrew Gray\n, Robert Alexander Houstoun, Diarmid Noel Paton.\nAn obituary, written by\nR P Gillespie\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1966\n, pages\n10\n-\n11\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nThe following announcement was made of his death:-\nProfessor Robert J T Bell, M.A., D.Sc., LL.D., Sc.D., author of \"An Elementary Treatise on Coordinate Geometry of Three Dimensions\"\n(1910\n; third edition\n1944)\n, chapters I-IX of which have been issued separately as \"Coordinate Solid Geometry\" since\n1938\n, died at Dunedin, New Zealand, on September\n8\nat the age of\n86\n, leaving a son and a daughter. Formerly Lecturer in Mathematics in the University of Glasgow, he was Professor of Mathematics in the University of Otago from\n1920\nuntil\n1948\nand was prominently engaged in administrative affairs there.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "George Alexander Gibson",
    "Andrew Gray",
    "R P Gillespie",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}