{
  "nome_completo": "Robert Alexander Rankin",
  "nome_curto": "Robert Rankin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rankin/",
  "data_nascimento": "27 October 1915",
  "local_nascimento": "Garlieston, Wigtownshire, Scotland",
  "data_morte": "27 January 2001",
  "local_morte": "Glasgow, Scotland",
  "summary": "Robert Rankin was Professor of Mathematics at Glasgow for many years. He worked on number theory and the theory of functions.",
  "biografia": "Robert Rankin\n's father, the Rev Oliver Shaw Rankin, was the parish minister of Sorbie, Wigtownshire at the time of Robert's birth. The Rev Oliver Rankin became Professor of Old Testament Language, Literature and Theology in the University of Edinburgh in\n1937\n. Robert was named after his grandfather, Robert Rankin, who was Minister of Lamington, Lanarkshire.\nRobert attended Garlieston School and from there went to Fettes College, an independent school in Edinburgh. He obtained a scholarship to Clare College, Cambridge, which he entered in\n1934\n. There he was particularly influenced by\nLittlewood\nand\nIngham\nwhose lectures he attended while taking Part III of the Mathematical Tripos. Rankin graduated in\n1937\nand in the same year his father became Professor of Old Testament Language, Literature and Theology at the University of Edinburgh.\nAt Cambridge Rankin began to undertake research in number theory under\nIngham\n's supervision. Dalyell recalls in\n[\n2\n]\nthat\nIngham\ntold him:-\nRobert was the most serious of all my gifted pupils.\nThe research which Rankin undertook at this time, on the difference between two successive primes, won him the Rayleigh Prize in\n1939\n. He published four papers on\nThe difference between consecutive prime numbers\nbetween this time and\n1950\n.\nRankin was elected a Fellow of Clare College in\n1939\n. In the same year he began to work with\nG H Hardy\non the results of\nRamanujan\n. Although\nRamanujan\nhad died nearly twenty years earlier, he had left a number of unpublished notebooks filled with theorems that\nHardy\nand other mathematicians continued to study. Rankin did not work long on\nRamanujan\nat this time, however, before World War II meant that he had to devote himself to war work. He did return to study\nRamanujan\n's work and in many ways it can be seen as a continuing theme throughout his life. He wanted to join the army and become involved in the fighting but he was ordered to work for the Ministry of Supply at Fort Halstead in Kent. A mathematician of his calibre was seen to have a much more important role to play in the war effort.\nAt Fort Halstead Rankin worked on the development of rockets. He developed a theory to allow the trajectory of the rocket to be calculated from the initial conditions. The British Government, however, paid little attention to the work of Rankin and his team. He was transferred from Fort Halstead to Wales where he continued to work until the end of the war. Of course during the war his work on rockets was classified information, but once the war was over the information was declassified and Rankin was released early from his war service on the condition that he wrote up the theoretical work which he had done on rockets. Indeed he did write the work up as\nThe mathematical theory of the motion of rotated and unrotated rockets\nand it was published in the\nPhilosophical Transactions of the Royal Society\nin a paper which was longer than any previously published in that journal. Kelley, in a review of the paper, writes:-\nThe author makes a thorough and comprehensive study of the motion of a rocket during burning. ... The problem is to devise a mathematical theory which will, after experimental measurement of suitable constants, predict position, velocity, angular position, and angular velocity of a rocket at the end of burning from a knowledge of these and other physical data at the beginning of burning. Of necessity, since the work is intended for direct application to ballistic calculations, considerable detail is given, and this, in turn, requires a truly formidable list of notations.\nDuring the war Rankin had married Mary Llewellyn in\n1942\n; they would have four children, one son and three daughters. Rankin returned to Cambridge with his wife in\n1945\nwhere he became a Faculty Assistant Lecturer. In\n1947\nhe became an Assistant Tutor and then in the following year he was promoted from Assistant Lecturer to Lecturer. In\n1949\nhe became a Praelector at Cambridge. A colleague who worked with him at Cambridge at this time recalled\n(\nsee\n[\n2\n]\n)\n:-\nHe was a conscientious teacher and had a wide interest in mathematics. Those who took the trouble to ask him serious questions were rewarded with precise and very serious answers.\nIn\n1951\nRankin left Cambridge when he was appointed Mason Professor of Pure Mathematics at Birmingham University. He was not to spend long in Birmingham for, in\n1954\n,\nT M MacRobert\nretired from the Chair of Mathematics at the University of Glasgow and the Principal of that university tempted Rankin to move back to Scotland to fill the vacancy. Martin writes\n[\n3\n]\n:-\nThus began a period of\n28\nyears during which Robert's powerful intellect, exceptionally accurate memory and tremendous energy, along with his absolute integrity and unstinted devotion to duty, enabled him to render signal service to the university.\nRankin wrote over\n100\nresearch papers, mostly on the theory of numbers and the theory of functions. He wrote\nThe modular group and its subgroups\npublished in\n1969\nand\nModular forms and functions\nwhich was published in\n1977\n. The former of these is described by Rankin himself in the Preface:-\nThis short course of lectures was given at the\nRamanujan\nInstitute for Advanced Study in Mathematics, in the University of Madras, in September\n1968\n. The object of the course was to study the modular group and some of its subgroups, with help of algebraic rather than analytic or topological methods.\nOf course the connection with\nRamanujan\n, the continuing theme we mentioned earlier, was not only that the lectures were given in the\nRamanujan\nInstitute but that The\nRamanujan\nInstitute in Madras published the book. A major historical work was\nRamanujan : Letters and commentary\na joint work with B C Berndt which Rankin published in\n1995\n; it has been instantly recognised as a exceptional contribution to the history of mathematics. Earlier he had published the papers\nRamanujan as a patient\nin\n1984\n, and\nSrinivasa Ramanujan\n(1887\n-\n1920)\nin\n1987\n. At the conference\nRamanujan revisited\nin Urbana- Champaign, Illinois in\n1987\nhe presented a paper on\nRamanujan's t-function and its generalizations\n. The paper appeared in the conference proceedings of which Rankin was himself an editor. Marvin Knopp writes:-\nThis is an informed\n(\nand informative\n)\naccount of\nRamanujan\n's function t\n(\nn\n)\nand many of the important later developments grounded in that work. With his usual fine sense of history,\n[\nRankin\n]\nbegins the discussion, not with\nRamanujan\nhimself, but rather with the older English mathematician\nJ W L Glaisher\n(\nborn in\n1848)\n, who initiated the study of multiplicative properties of the\nFourier coefficients\nof modular forms in his series of papers, published in\n1907\n, dealing with ... the number of representations of\nn\nn\nn\nas a sum of\ns\ns\ns\nsquares. Taking up this work where severe complications had forced\nGlaisher\nto abandon it\n(18\nwas the largest value of\ns\ns\ns\nhe treated\n)\n,\nRamanujan\nwas led to his seminal work on\nt\n(\nn\n)\nt(n)\nt\n(\nn\n)\nin investigating\n[\nthe number of representations of\nn\nn\nn\nas a sum of\n24\nsquares\n]\n.\nWe should note that Rankin himself had made a number of contributions to studying the number of representations of an integer as a sum of squares. Although the above comments on his publications concentrate on his historical contributions, we have only given it this slant since this aspect is more easily described. We should emphasise that his remarkable contributions to the theory of numbers have played a majr part in the modern developemnt of the topic.\nOne characteristic of Rankin was the care with which he undertook all things in his life. Not only was his research articles written with great care but he applied the same attention to detail in running the Department of Mathematics at Glasgow and also in his teaching. Directly coming out of his teaching was the undergraduate text\nAn introduction to mathematical analysis\n.\nHe was still publishing papers, and giving lectures, up to the time of his death. He published\nThe books studied by Ramanujan in India\nin\n2000\n(\nagain collaborating with B C Berndt\n)\nand travelled to London to lecture there shortly before his death although his doctors had strongly advised him not to go.\nRankin received many honours for his outstanding contributions to mathematics. Elected a fellow of the\nRoyal Society of Edinburgh\nin\n1955\n, he received the Society's Keith Prize for his publications in\n1961\n-\n63\n. The\nLondon Mathematical Society\nawarded him their Senior\nWhitehead\nPrize in\n1987\nand the\nDe Morgan\nMedal in\n1998\n.\nMathematics was certainly not Rankin's only interest. He was very musical\n[\n3\n]\n:-\nThe organ works of JS Bach were of special interest to him and he had a detailed knowledge of many of the chorale preludes. He played the organ very competently.\nHe took a scholarly approach to his interest in Scottish Gaelic being President of the Glasgow Gaelic Society from\n1957\nuntil his death, and he enjoyed hill walking. He used his knowledge of Gaelic in a professional capacity when he was external examiner at University College, Galway in Ireland when he examined mathematics papers written in Irish Gaelic.\nMay I\n[\nEFR\n]\nfinish this biography on a personal note. I knew Rankin from the late\n1960\ns. He always made me feel very welcome whenever I visited Glasgow University and treated me with great kindness. Latterly, with his deep interest in the history of mathematics, Rankin was extremely encouraging to me in developing this archive. He contributed an excellent article on\nRobert Simson\nto the archive based on a lecture he gave at the\nRoyal Society of Edinburgh\n; one which I was fortunate enough to hear.",
  "matematicos_citados_na_biografia": [
    "Littlewood",
    "Ingham",
    "G H Hardy",
    "Ramanujan",
    "Hardy",
    "T M MacRobert",
    "J W L Glaisher",
    "Fourier coefficients",
    "Glaisher",
    "Royal Society of Edinburgh",
    "London Mathematical Society",
    "Whitehead",
    "De Morgan",
    "Robert Simson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}