{
  "nome_completo": "Robert Murphy",
  "nome_curto": "Robert Murphy",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Murphy/",
  "data_nascimento": "1806",
  "local_nascimento": "Mallow, Cork County, Ireland",
  "data_morte": "12 March 1843",
  "local_morte": "London, England",
  "summary": "Robert Murphy was an Irish mathematician who worked on the theory of equations and was among the first to consider algebras of operators.",
  "biografia": "Robert Murphy\nwas the son of the shoemaker John Murphy and his wife Margaret. Although we do not know his exact date of birth, we know that he was baptized in the Church of Ireland on\n8\nMarch\n1807\nwhich would suggest that he was born near the end of\n1806\n. Robert was, according to some sources, the third of his parents' seven children and, according to other sources, the sixth child of seven boys and two girls. He was brought up in the family home on Beecher Street, Mallow. John Murphy clearly had a reasonable education since he served as the parish clerk. Tragedy struck the family, however, in January\n1814\nwhen John Murphy died. Robert was only seven years old at this time and the death of his father meant that from that time on the family were in extreme poverty. His life became even more difficult when he was eleven years old for at that time he was run over by a cart outside his home and his thighbone was fractured in the accident. He spent a year in bed recovering from this and even when he was able to leave his bed after a year he still had to spend a further six months walking with great difficulty.\nIt is often the case that misfortune has its positive side and this appears to be true for Murphy for it was during the time that he was confined to bed that he discovered that he had a talent for mathematics. His mother could not afford to buy him mathematics books but she found an old Cork almanac containing problems on navigation and positional astronomy solved using trigonometry. He spent many a happy hour in bed with this book and, now that his mathematical talent was clear, he was given a copy of\nEuclid\n's\nElements\nand an algebra textbook.\nJohn Mulcahy, a graduate of Trinity College Dublin in\n1830\n, was appointed to the Chair of Natural Philosophy at Queen's College, Galway before the university opened in\n1849\n, but before taking up the appointment was transferred to the Chair of Mathematics. It is not John Mulcahy but rather it is his father, Mulcahy Senior, who played a vital role in Robert Murphy's life. Mulcahy Senior was a teacher in Cork and he posed mathematical problems in a local paper. He received some remarkable solutions from someone who signed themselves \"Mallow\" and, intrigued to find out who the mathematical genius was, travelled to Mallow. There he learnt to his amazement that the solutions were from Robert Murphy, a child on crutches of around\n12\nyears of age. Mulcahy Senior spoke to Murphy's mother and immediately understood that there was no way that the family could afford to educate their son. He then made strenuous efforts to arrange for Murphy to get an education.\nMulcahy spoke to one of Murphy's neighbours, a Mr Croker, saying:-\nMr Croker, you have a second Sir\nIsaac Newton\nin Mallow: pray look after him.\nHe persuaded Croker to help finance Murphy's education and he also spoke to Mr Hopley, the headmaster of the local school, who agreed to cover Murphy's fees and the cost of books at his school. Murphy spent three years between\n1819\nand\n1823\nat Mr Hopley's school where he was taught by a Mr Armstrong. In\n1823\nMurphy, supported by Mulcahy, Hopley and Croker, applied to enter Trinity College, Dublin. As part of his application he attached examples of his mathematical work. His application, however, was rejected. With only three years formal education and presenting mathematical work which those viewing his application failed to understand, led to this outcome. The reader will notice that we have here a not too dissimilar situation to that faced by the young\nÉvariste Galois\nfive years later. Such setbacks were not going to stop Murphy doing mathematics.\nThe Reverend John Mackey had published a pamphlet entitled\nA Method of Making a Cube a Double of a Cube, Founded on the Principles of Elementary Geometry\n. We know now, of course, that doubling the cube using ruler and compass is impossible but this was not known in the\n1820\ns. We know little about John Mackey other than he was originally from Cashel and, at the time he wrote his pamphlet, he was at Maynooth College. Murphy had amused himself by studying the classical Greek problems and believed that they were insoluble. He quickly found the error in John Mackey ruler and compass construction of the cube root of\n2\nand in\n1824\npublished his own pamphlet entitled\n'Refutation of a Pamphlet Written by the Rev. John Mackey Entitled \"A Method of Making a Cube a Double of a Cube, Founded on the Principles of Elementary Geometry,\" wherein His Principles Are Proved Erroneous and the Required Solution Not Yet Obtained\n. Murphy began his account by looking briefly at the history of duplication the cube and trisecting the angle. He then wrote:-\nBut amongst all the attempts which have been made for the solution of the duplication, there has not been one more foolish or more erroneous, than that of the Rev John Mackey; which being masked under the appearance of truth, consists of a collection of false propositions.\nNote the confidence of the eighteen year old boy with little formal education. Murphy then goes on to correctly point out the errors in the Reverend John Mackey's arguments using only\nEuclid\n's\nElements\nand\nCardan\n's\nArs Magna\nⓉ\n(\nThe great art\n)\n(\nmore precisely the\nCardan\n-\nTartaglia\nformula for solving cubic equations\n)\n. Murphy ends his\n19\n-page pamphlet by writing:-\nWe shall conclude with hoping that Mr Mackey's next attempt will be more successful.\nNow Murphy had a stroke of luck. McCarthy was a junior fellow of Gonville and Caius College, Cambridge, who lived in Cork and when he returned home for a vacation he met Murphy. Collecting together some of Murphy's mathematics he returned to Cambridge and showed them to\nRobert Woodhouse\n. Woodhouse glanced at Murphy's work and at first did not rate it highly but, on a second reading, he saw its potential. He wrote to McCarthy saying that he would accept Murphy as a student at Gonville and Caius College, Cambridge, for a fee of £\n60\nif his sponsors could raise that amount. He assured them that this would cover all of Murphy's expenses for the duration of his undergraduate course. Mulcahy, with the help of several friends in Mallow, was able to put together the £\n60\nand Murphy was admitted as a pensioner to Gonville and Caius College, Cambridge, on\n7\nJuly\n1825\n.\nMurphy won the\n1\nst  Mathematics Prize in\n1826\nand went on to graduate with a B.A. in\n1829\n. He was\n3\nrd\nwrangler\n, meaning that he was ranked third among the students receiving a first class degree. This excellent performance, quite remarkable for someone with Murphy's minimal formal education before beginning his undergraduate studies, led to Murphy being awarded a Perse Fellowship. At the same time, to help his financial position, he was appointed as Librarian. He gave Hebrew lectures in\n1830\n(\ngiving six lectures and receiving £\n10\nas payment\n)\n, and was appointed as a junior dean in charge of discipline and chapel services in October\n1831\n, a position he held until\n1833\n. He was ordained a deacon on\n4\nJune\n1831\nand gave Greek lectures in\n1832\n. On top of all this he was writing innovative mathematical papers and was commissioned in\n1830\nto write a book on the mathematical theory of electricity for the use of students at Cambridge. It appeared that the young man had finally made the transition to a top class mathematician. However, his newly found status and his good income was something he could not cope with and the young man became addicted to betting.\nAlready as an undergraduate there is considerable evidence that Murphy could not handle his finances. In December\n1827\nhe was \"advanced thirty pounds out of the Perse and forty pounds out of the College Fund\". In December of the following year, at the meeting of the Senior Fellows when Murphy's degree was confirmed, it was \"agreed to advance Mr Murphy a loan of fifty pounds\". There is another factor in Murphy's problems for his mother, who had given him great moral support during his youth, died in\n1832\n. He was already gambling, making many bets with William Haughton Stokes\n(1802\n-\n1884)\nand others, and getting himself into severe debt problems. After the death of his mother these problems got worse and he was informed in December\n1832\nthat his position as junior dean was to end. Also the same meeting of the Senior Fellows in December\n1832\nit was agreed that \"sixty pounds be allowed to Mr Murphy for the present year\". William Haughton Stokes, who we mentioned above, was the elder brother of the mathematician\nGeorge Gabriel Stokes\n, and like Murphy was Irish. William Haughton Stokes had been\n16\nth\nWrangler in\n1828\nand was appointed a fellow of Gonville and Caius College, Cambridge. In the two months, October and November\n1832\n, ten Common Room wagers by Murphy are recorded in the College Wager Book and, in\n1833\n,\n21\nof the total of\n60\nbets recorded involve Murphy.\nWhat sort of bets did Murphy make? Many are on political topics such as, \"Mr Stokes bets Mr Murphy that there will be at least forty-five members returned from Parliament at the next election.\" Many are quite strange, for example \"Mr Murphy bets Mr Stokes that Napoleon is said to have sacrificed the life of his wife rather than that of his son,\" or \"Mr Paget bets Mr Murphy that Abraham took to himself a wife after the death of Sarah.\" We note that Mr Paget is George Edward Paget who became a distinguished physician. Many of the bets involved bottles of wine and there is a suggestion that Murphy had problems with alcohol as well as with betting. Although Murphy lost his position as a junior dean in charge of discipline in\n1833\n, he continued to hold other posts at Gonville and Caius College, being a Hebrew lecturer in\n1833\n,\n1834\nand\n1835\n. He was also a university examiner in mathematics in\n1833\n. However he continued to run up debts throughout Cambridge and by\n1836\nhe was forced to leave the city. The money from his fellowship was withheld from him and used by the College to repay his debts. He had spent the years\n1830\nto\n1836\nproducing top quality mathematics and we look now at some of the work he published during these years.\nMurphy published\nOn the General Properties of Definite Integrals\n(1830)\n,\nOn the Resolution of Algebraical Equations\n(1831)\n,\nFirst Memoir on the Inverse Method of Definite Integrals, with Physical Applications\n(1830)\nand\nOn Elimination between an Indefinite Number of Unknown Quantities\n(1832)\nin the\nTransactions of the Cambridge Philosophical Society\n. We can already see the two main areas on which Murphy was working, namely on\nintegral equations\nand algebraic equations. His next publication was a contribution to mathematical physics, namely the book\nElementary Principles of the Theories of Electricity, Heat, and Molecular Actions. Part I on Electricity\nwhich was designed for use by Cambridge undergraduates. You can read Murphy's Introduction to this book at\nTHIS LINK\n.\nWilliam Thomson\nwrites in\nElectricity and Magnetism\n(1872)\n:-\nIt appears highly probable that\n[\nMurphy\n]\nmay never have had access to\nGreen\n's 'Essay' at all, and that this is the explanation of the fact\n(\nof which any other explanation is scarcely conceivable\n)\n, that in his 'Treatise on Electricity' he makes no allusion whatever to\nGreen\n's discoveries, and gives a theory in no respect pushed beyond what had been done by\nPoisson\n...\nAlthough\nGreen\n's\nEssay\nwas published in March\n1828\n, it was only seen at this time by those around Nottingham. It is unlikely that Murphy would know of it until\nGreen\nbecame an undergraduate at Caius College in October\n1833\n. Murphy's book was certainly completed by June\n1833\n(\nthis is the date on the Introduction\n)\nso it is completely understandable that\nGreen\n's ideas did not get included in Murphy's book.\nOn the theory of equations Murphy wrote papers such as\nOn the Existence of Real or Imaginary Root to Any Equation\n(1833)\n,\nFurther Development of the Existence of a Real or Imaginary Root to Any Equation\n(1833)\n,\nAnalysis of the Roots of Equations\n(1837)\nand the results from these papers were all contained in Murphy's\n1839\nbook\nA Treatise on the Theory of Algebraical Equations\n. The book also included a description of the work on others on the theory of equations. You can read Murphy's Introduction to this book at\nTHIS LINK\n.\nPerhaps Murphy's most remarkable paper was\nFirst Memoir on the Theory of Analytic Operations\npublished in\n1837\nin the\nPhilosophical Transactions of the Royal Society of London\n. In this paper Murphy looks at linear operators on functions. Looking at examples of such operators was not new but Murphy looked at these operators as an algebraic system. He defined addition and multiplication of the linear operators\n(\nmultiplication being composition\n)\n. He noted that in general the multiplication was not commutative. Although, of course, he does not use modern terminology, what he had defined was a non-commutative ring. He went on the define the kernel of an operator\n(\nwhich he called the appendage\n)\nand showed that an operator was invertible if its kernel was\n0\n. He noted the, now standard, result that if\nf\n,\ng\nf, g\nf\n,\ng\nare invertible operators\n(\nf\n.\ng\n)\n−\n1\n=\ng\n−\n1\n.\nf\n−\n1\n.\n(f . g)^{-1} = g^{-1}. f ^{-1}.\n(\nf\n.\ng\n)\n−\n1\n=\ng\n−\n1\n.\nf\n−\n1\n.\nHe also defined conjugates\nf\n−\n1\n.\ng\n.\nf\nf ^{-1}. g . f\nf\n−\n1\n.\ng\n.\nf\n,\nLie\nbrackets\nf\n.\ng\n−\ng\n.\nf\nf. g - g . f\nf\n.\ng\n−\ng\n.\nf\n, and gives the binomial theorem for non-commuting variables. All of this was eight years before\nHamilton\n's non-commutative system of\nquaternions\nwas published.\nLet us continue to describe the events of Murphy's life. He had been elected to the\nRoyal Society\non\n5\nJune\n1834\nand, in the same year, given a Frankland junior fellowship. After he had to leave Cambridge, he returned briefly to Ireland but went to London in October\n1836\nsince he had learnt that the professor of mathematics at University College, London, George James Pelly White, had drowned, together with his wife, mother and two boatmen, in a pleasure boat accident off Guernsey on\n5\nOctober. George Pelly White, a graduate of Trinity College, Cambridge, was only\n25\nyears old when he drowned. Murphy's hope for this chair were not realised since, even before he reached London,\nDe Morgan\nhad been appointed to fill the vacant chair. In fact\nDe Morgan\nhad previously held the chair up to the summer of\n1831\nwhen he had resigned in protest over the dismissal of the Professor of Anatomy.\nDe Morgan\n, who fully understood Murphy's genius, tried to help him over the next few years. Murphy lived cheaply in London and made some money tutoring privately. Encouraged by\nDe Morgan\nhe also wrote articles for the Society for the Diffusion of Useful Knowledge and for the\nPenny Cyclopaedia\n. It was while living in London in these difficult circumstances that he wrote the paper on what are now called non-commutative rings which we described above. He still had hopes of returning to Cambridge and he went there in\n1838\nwhen he was elected to a Stokes Fellowship by Caius College. Unfortunately this did not provide him with the income he had hoped for since it was confiscated to pay off debts which he still had in Cambridge. Caius College made advance payment so that he could pay off the \"Porter, Bedmaker, Laundress, Shoecleaner and Milkman\". He was, however, appointed as an examiner of mathematics and natural philosophy at the University of London in October\n1838\n. He continued to hope for a Senior Fellowship at Cambridge but it was not to be.\nBy this time his health was deteriorating and he had symptoms of lung disease. He battled on, however, continuing to undertake research and to write it up for publication. His book\nA Treatise on the Theory of Algebraical Equations\nwas published in\n1839\nand provided much need funds. His final works were\nRemark on Primitive Radices\n(1841)\n,\nCalculations of Logarithms by Means of Algebraic Fractions\n(1841)\n, and\nOn Atmospheric Refraction\n(1842)\n. As his lung disease got progressively worse his pupils deserted him. Today Murphy is little known but, had he been more able to organise his life, his health may have been better and he may have had the time to produce results of lasting importance of which his genius showed him to be capable. He was buried in an unmarked grave in Kensal Green Cemetery, London.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "Isaac Newton",
    "Évariste Galois",
    "Cardan",
    "Tartaglia",
    "Robert Woodhouse",
    "wrangler",
    "George Gabriel Stokes",
    "integral equations",
    "THIS LINK",
    "William Thomson",
    "Green",
    "Poisson",
    "Lie",
    "Hamilton",
    "quaternions",
    "Royal Society",
    "De Morgan"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}