{
  "nome_completo": "Robert Schlapp",
  "nome_curto": "Robert Schlapp",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schlapp/",
  "data_nascimento": "18 July 1899",
  "local_nascimento": "Edinburgh, Scotland",
  "data_morte": "31 May 1991",
  "local_morte": "Ashford, Kent, England",
  "summary": "Robert Schlapp studied at Edinburgh and Cambridge universities. He spent his whole career at Edinburgh University teaching mathematics and Physics. He was also interested in the History of Mathematics.",
  "biografia": "Robert Schlapp\n's parents were Anna Lotze and Otto Schlapp. Otto, originally from Germany, had taught German at George Watson's Boys' College but became the first Professor of German at the University of Edinburgh. Robin\n(\nas Robert was known to all his colleagues including the authors of this biography\n)\nwas educated at George Watson's School, Edinburgh, and completed his school education as dux of the School in\n1917\n.\nOf course World War I had begun in\n1914\nwhen Robin was a fifteen year old schoolboy. This was a particularly difficult for time for Robin and all his family because of their German origins. Although he had been placed first in the Edinburgh University Bursary Competition, and awarded a George Watson's Bursary and the Glass Mathematical Bursary, Robin enlisted for military service. He was assigned to the\n31\nst\nBattalion, Middlesex Regiment, which was intended for those with connections to \"the enemy\", and spent the rest of the war doing heavy manual labour.\nReturning to Edinburgh University after the war ended, Schlapp graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy. Supported by a Drummond Mathematical Scholarship, he then studied at St John's College, Cambridge, for his doctorate which was awarded in\n1925\nfor his thesis\nThe Reflexion of X-rays from Crystals\n. Schlapp was then appointed as an Assistant in Natural Philosophy at Edinburgh University. Subsequently he was a Lecturer in Applied Mathematics, then Senior Lecturer in Mathematical Physics at Edinburgh University. Schlapp married Mary Fleure in\n1940\n; they had two daughters.\nIn January\n1923\nSchlapp joined the\nEdinburgh Mathematical Society\n. He was honoured by being elected as President of the Society for session\n1942\n-\n43\n, and then again for session\n1943\n-\n44\n. He was elected to the\nRoyal Society of Edinburgh\non\n14\nMarch\n1927\n, his proposers being\nSir Edmund T Whittaker\n,\nSir Charles G Darwin\n,\nDavid Gibb\n,\nEdward Thomas Copson\n. He was an active member of the Society serving on the Council from\n1956\nto\n1959\n. Following this he was Curator of the Society from\n1959\nto\n1969\n, then Vice-President from\n1969\nto\n1972\n. He was awarded the Society's Bicentenary Medal in\n1983\n.\nAn obituary, written by Nicholas Kemmer, appears in the\nRoyal Society of Edinburgh\nYear Book\n1993\n, pages\n111\n-\n114\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nAs explained in this obituary, Schlapp published little after\n1940\n. However he did publish three articles:\nA note on small vibrations\n(1942)\n;\nColin Maclaurin: A biographical note\n(1949)\n; and\nThe contribution of the Scots to mathematics\n(1973)\n.\nD C Lewis, reviewing the first of these, writes:-\nThe author states: \"This note exhibits some old results in what is possibly a new form.\" Accordingly, it is a purely expository matrix-theoretical treatment of the stable conservative linear\ndynamical system\nof\nn\nn\nn\ndegrees of freedom. The paper includes examples.\nA version of the second paper on Colin Maclaurin is available in this archive at\nTHIS LINK\n.\nThe third paper on the contributions of Scots to mathematics, begins with the thirteenth century and ends shortly before the middle of the nineteenth century \"when the concept of Scottish mathematics begins to lose its definition\". Thus, he does not include, for example,\nWedderburn\n,\nKelvin\n, or\nMaxwell\n. He devotes most of his attention to describing the work of\nJohn Napier\n,\nJames Gregory\n(\nwhom he calls \"the most original mathematician Scotland ever produced\"\n)\n,\nJames Stirling\n, and\nColin Maclaurin\n.",
  "matematicos_citados_na_biografia": [
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "Sir Edmund T Whittaker",
    "Sir Charles G Darwin",
    "David Gibb",
    "Edward Thomas Copson",
    "THIS LINK",
    "dynamical system",
    "Wedderburn",
    "Kelvin",
    "Maxwell",
    "John Napier",
    "James Gregory",
    "James Stirling",
    "Colin Maclaurin"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}