{
  "nome_completo": "Édouard Albert Roche",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roche/",
  "data_nascimento": "17 October 1820",
  "local_nascimento": "Montpellier, Hérault, France",
  "data_morte": "18 April 1883",
  "local_morte": "Montpellier, Hérault, France",
  "summary": "Édouard Roche was a 19 th century French mathematician and astronomer who worked for his whole career at the University of Montpellier. He is famed for what are known today as the Roche lobes, equipotential surfaces, and the Roche limit giving the distance from a planet at which satellites will be torn into rings.",
  "biografia": "Édouard Roche\nwas the son of Arthur Pierre François Esprit Roche\n(1785\n-\n1862)\nand Pauline Angélique Auguy\n(1800\n-\n1877)\n. Arthur Roche had been born in Montpellier on\n21\nMay\n1785\n, a son of Pierre Roche and Agathe Élisabeth Crassous. He became an advisor and then secretary general of the prefecture of Hérault. He married Pauline Auguy on\n22\nNovember\n1819\nin Montpellier. She had been born in Saint-Pargoire, Hérault on\n22\nApril\n1800\n, a daughter of the landowner André Édouard Auguy and Françoise Antoinette Guillaumette Arnal. Arthur and Pauline Roche had three children: Édouard Roche, born\n17\nOctober\n1820\n, the subject of this biography; Sosthenes Roche, born\n18\nJanuary\n1823\n, died when one year old on\n28\nSeptember\n1824\n; and Arthur Roche, born\n9\nAugust\n1835\n. Arthur Roche Jr\n(1835\n-\n1910)\nalso became a mathematician and we will say a little more about him below.\nComing from a family who had a long tradition of academic success, several becoming professors at the University of Montpellier, when he was studying at Montpellier Lycée Édouard Roche showed that his exceptional talents were almost certainly going to have him continue in that tradition. What was less obvious, however, was the area in which he would specialise since he was equally talented in literature and science. He won the top prizes in both and his teachers all noted that his great ability and also his enthusiasm for studying would lead him to achieve much in either topic. Only when he reached the more advanced mathematical topics did he feel that this was drawing him irresistibly in that direction. The Grandes Écoles of Paris were the obvious choice for an outstanding student such as Roche, and he put all his efforts into studying for the preparatory examinations.\nIn\n1840\n, having graduated from the Montpellier Lycée, his hard work seemed to have paid off when he was accepted to study at the École Polytechnique in Paris. The hard work had, however, led to health problems since he had naturally delicate health, and his parents felt that the stress of studying at the École Polytechnique might prove too much. Instead of going to Paris, he entered the University of Montpellier in\n1840\nenthusiastic for studying mathematics and physical sciences. He took courses taught by\nJoseph Diez Gergonne\n, Pierre Lenthéric\n(1793\n-\n1849)\nand Antoine-Jérôme Balard\n(1802\n-\n1876)\nat the Faculty of Sciences in Montpellier.\nGergonne\nwas an expert in geometry but he also wrote papers on analysis, statics, astronomy, and optics. Lenthéric had been appointed professor of elementary mathematics at the Montpellier Lycée in\n1815\n, changed to teach physics in\n1821\n, then taught at the Faculty of Sciences of Montpellier from\n1827\n. First he taught transcendental mathematics, then became professor of special mathematics from\n1830\n. He also filled the chair of astronomy from\n1830\nto\n1833\n, then in\n1833\nbecame full professor of transcendental mathematics. Balard was a chemist famed as the discoverer of bromine. He was professor of chemistry at the Faculty of Sciences of Montpellier from\n1833\nto\n1843\nwhen he became professor of chemistry at the Sorbonne.\nThere was one other professor at the Faculty of Sciences in Montpellier who influenced Roche, namely Jean Nicolas Legrand\n(1796\n-\n1871)\n. Legrand was a student at the École Normale and had been a professor of physics in Douai, Reims, Avignon, Nancy and Besançon before being appointed as a lecturer at the Faculty of Sciences in Toulouse in\n1832\n. He came to Montpellier in\n1837\nwhen appointed to the Faculty of Sciences where he became the Professor of Astronomy in\n1841\n. He increased Roche's interest in applying mathematics to problems in astronomy.\nRoche graduated with a doctorate from the Faculty of Sciences of Montpellier in\n1844\n. For his doctorate he presented two theses, namely a mathematical physics thesis with title\nSur la  distribution de la chaleur  dans une sphère\nⓉ\n(\nOn the Distribution of Heat in a Sphere\n)\n, and an astronomy thesis with title\nSur la  figure des planètes\nⓉ\n(\nOn the Shape of the Planets\n)\n. Let us quote from the introduction to both theses. The first begins as follows:-\nThe equations for the problem we are about to address were given by\nPoisson\nin his 'Theory of Heat', Chapter X. The integration procedure to be used is indicated there; but the solution is developed only for the case where the sphere is homogeneous.\nWhen the sphere is heterogeneous, but nevertheless such that the temperature is the same throughout the entire extent of each spherical layer, the problem depends on the integration of a linear, second-order partial difference equation in two variables. This integration leads, using ordinary methods, to a differential equation that can only be integrated in a small number of particular cases, and even when the expression for the function can be obtained, it is difficult to discover its progression and its principal properties.\nIt was therefore necessary to find, through the direct consideration of this differential equation, a means of recognising the nature of the function it implicitly determines. This is what M\nSturm\ndid in his fine 'Memoir on Linear Second-Order Differential Equations', where, using a method as elegant as it was fruitful, he established the curious properties of these integrals. The same geometer demonstrated, in his 'Memoir on a Class of Partial Differential Equations', the use that can be made of these properties. We should also mention several very interesting memoirs by M\nLiouville\non the same subject.\nBased on these various works, we will study the distribution of heat in a sphere, where the temperature depends at each instant only on the distance from the centre. We will then deduce from the general formulas those relating to the homogeneous sphere, and we will indicate their use in the question of the movement of heat within and on the surface of the Earth.\nThe astronomy thesis begins as follows:-\nThe search for equilibrium figures for a homogeneous fluid mass, endowed with rotational motion, is a difficult problem, which can only be completely resolved when this figure is assumed to be little different from that of a sphere. In this case, there is only one equilibrium figure, which is that of an ellipsoid of revolution flattened at the poles.\nTo demonstrate this important proposition,\nLaplace\nused two methods found in the third book of 'Celestial Mechanics'. The first is based on a series development, which he introduced into analysis, and which recurs repeatedly in the problem of the attraction of spheroids, in that of tides, and in the theory of heat. The illustrious geometer admits the possibility of representing, by this type of series, any function of two variables, a theorem that has since been demonstrated a priori by\nPoisson\n.\nFor fear that this assumption might cast doubt on the results of his analysis,\nLaplace\nbelieved it necessary to demonstrate the proposition in question, independently of the use of series. This second demonstration is incomplete, as noted by M\nLiouville\n, who provided a rigorous one.\nPoisson\nprovided another but this one is still inexact, as we will see.\nWe will assume here that, in addition to the mutual attraction of its molecules, the fluid mass is subject to the action of a force placed at its centre and reciprocal to the square of the distances; which implicitly includes the case where the fluid mass covers a sphere of density different from its own.\nThere had been a total eclipse of the sun on Friday\n8\nJuly\n1842\nwith the path of totality passing over Milan, Turin, Marseille, Montpellier, Zaragoza and Madrid. Roche had observed the eclipse and published a report of his observations including measurements of red protuberances surrounding the sun.\nFrançois Arago\nwas very impressed with Roche's report and quoting from it in glowing terms in his own report. Arago offered Roche a place as a free student at the Paris Observatory and, after completing his doctorate in Montpellier in\n1844\n, Roche went to Paris. At the Paris Observatory Roche studied practical astronomy directed by Hervé Auguste Étienne Albans Faye\n(1814\n-\n1902)\n. Faye had studied at the École Polytechnique, leaving in\n1834\nbefore completing his course to accept François Arago's offer of position at the Paris Observatory. On\n22\nNovember\n1843\nhe had discovered a periodic comet with an orbital period of about\n7\n.\n5\nyears, now named\n4\nP/Faye. It brought him international fame and he was awarded the\nLalande\nPrize in\n1844\nand elected to the\nFrench Academy of Sciences\nin the same year. As well working at the Observatory, Roche attended lectures by\nCauchy\n,\nLe Verrier\n,\nDelaunay\n,\nLiouville\nand\nSturm\nat either the Sorbonne or at the Collège de France.\nTowards the end of\n1847\nRoche returned to Montpellier where he married Marie Ursule Amélie Rigal on\n17\nNovember\n1847\n. Marie Rigal\n(1828\n-\n1847)\nhad been born in Montpellier on\n29\nMay\n1828\nto François Roch Rigal and Caroline Virginie Blanchy. Tragically, Marie Rigal died on\n23\nNovember\n1847\n, six days after their marriage, having contracted pneumonia during the wedding festivities.\nJoseph Boussinesq\nwrites\n[\n2\n]\n:-\n... from then on, the feelings of the most tender affection for a mother, a father and a brother worthy of him were alone to divert the solitude of his heart. It was, I believe, from that day that he ceased to be able to laugh, while retaining the habit of that amiable smile, an expression of his somewhat melancholy goodness, which all his pupils knew.\nIn\n1849\nRoche was appointed to the position of chargé de cours at the University of Montpellier and, three years later, in\n1852\nhe was appointed professor of mathematics. In\n1848\nRoche published his first four papers on astronomy, all in the Mémoires de l'Académie des sciences et lettres de Montpellier. These are:\nObservation de l'éclipse de soleil du\n9\noctobre\n1847\nⓉ\n(\nObservation of the Solar Eclipse of October\n9\n,\n1847\n)\n;\nMémoire sur la loi de la densité à l'intérieur de la terre\nⓉ\n(\nMemoir on the Law of Density in the Interior of the Earth\n)\n;\nMémoire sur la figure de la terre\nⓉ\n(\nMemoir on the Shape of the Earth\n)\n; and\nCalcul de l'inégalité parallactique du mouvement de la lune\nⓉ\n(\nCalculation of the Parallax Inequality of the Motion of the Moon\n)\n.\nMuch of Roche's work on the solar system is brought together in\n[\n16\n]\n. He gives the following introduction:-\nMy studies on the shape of celestial bodies and the arrangement of the level layers in the atmospheres surrounding them have led me to some results applicable to the Sun, its atmosphere, and the progressive condensation by which, as we know, the various planets were formed. I propose to bring together here the consequences of my previous work relating to these questions, and to show how they confirm, clarify, or modify\nLaplace\n's cosmogonic theory.\nVarious problems concerning the solar system will be addressed in this Memoir; but, given the difficulty of the subject, the reader will not be surprised to find, on many points, only mere overviews.\nRoche is remembered today largely through Roche lobes and the Roche limit. Roche lobes are equipotential surfaces round a star in a binary system in which material is gravitationally bound to the star. The Roche limit is the distance from a planet at which a moon will be torn into small pieces to form a ring round the planet. Martin Solc write about Roche lobes in\n[\n17\n]\n:-\nRoche devoted himself to topics that lay generally outside of mainstream astronomical research in his time. He studied the equilibrium figure of a rotating fluid body that was subjected to an external gravitational force caused by another body. This condition is extremely important for determining the equipotential surfaces around a pair of bodies like a binary star. Where one\n(\nor both\n)\nof the components assumes a tear-drop shape, the space\n(\ns\n)\nso filled is called the Roche lobe.\nIwan P Williams writes about the Roche limit\n[\n20\n]\n:-\nRoche\n(\n[\n12\n]\n,\n[\n13\n]\n,\n[\n14\n]\n)\nhad shown some interest in the problems associated with the deformation and fission of rotating fluids, but the work which has become associated with his name as the Roche limit was concerned with the formation of Saturn's rings through mass loss from a hypothetical satellite\n(\n[\n15\n]\n,\n[\n16\n]\n)\n. The satellite is taken to be small in size, not deforming Saturn and not in contact in contrast to the assumed situation in the Earth-Moon problem. The gravitational field of both Saturn and the satellite are taken to be that of point masses and Roche consider the loss of a particle from the surface of the satellite at the point nearest Saturn. The satellite is also effectively assumed to be face-on to Saturn, though Roche actually assumed nothing of the satellite, only that the third body that was to be lost stayed on the line joining Saturn and the satellite until lost. ... The Roche limit actually places a limit for the closest distance that a secondary can approach a primary and remain stable under a very idealised set of conditions. In particular the secondary is assumed to move on a circular orbit and maintain the face-on configuration. In reality virtually no secondary moves on a circular orbit and the face-on configuration is far from common.\nIn\n[\n5\n]\nZdenĕk Kopal put Roche's work into context:-\nLong before the\n[\nRoche problems\n]\nemerged to become almost a byword in double-star astronomy in the second half of the present century, astronomers were well aware of their existence which can be traced back - and hence its name - to the French mathematician Édouard Albert Roche\n(1820\n-\n1883)\n. Their roots, to be sure, go much further back in the history of our subject; for - through their connection with the energy integral of the problem of three bodies - many of their properties were known to the German mathematician\nC G J Jacobi\n(1804\n-\n1851)\nwith whose name they are still sometimes associated. In reality, however, its properties go back to the\n18\nth century to the work of\nJ L Lagrange\n(1736\n-\n1813)\nand, in fact, to\nLeonard Euler\n(1707\n-\n1789)\n- and thus to the early applications of the infinitesimal calculus to dynamical astronomy in the days of\nIsaac Newton\n(1642\n-\n1727)\n. Yet all these grand men of our science were concerned with certain problems ... solely from the viewpoint of particle mechanics\n(\ni.e., the motion of individual particles in the course of time\n)\n; their relevance to the problems of double-star astronomy was glossed over mainly on account of the fact that no binary stars\n(\nor, at least, close binaries\n)\nwere known to exist in the sky at that time. However, a study of the particular case of equipotential surfaces associated with gravitational dipoles\n(\nto which the energy associated with close gravitational dipoles - and to which the energy integral reduces to surfaces of zero velocity\n(\nor, more precisely, to surfaces over which the squares of the velocity components are small enough to be ignorable\n)\n- has remained the historical task of E A Roche; and it is, therefore, eminently appropriate that these be permanently associated with his name.\nAlthough Roche's work is seen today as being of great importance, it was largely ignored during his lifetime. Kopal suggests that the fact that Roche worked in Montpellier, away from the main areas of astronomical research, might have proved positive for science but negative for his own reputation. Perhaps, Kopal writes, his innovative ideas would have been rubbished by the leading astronomers if he had worked in Paris. The fact that his reputation was poor is illustrated by his failure to be elected to the\nAcademy of Sciences\nin Paris in\n1883\n. He had been made a corresponding member in December\n1873\nbut when\nJoseph Liouville\ndied in September\n1882\n, a vacancy occurred in the Astronomical Section of the Academy.\nFélix Tisserand\nproposed Roche to fill the vacancy and an election was held on\n16\nApril\n1883\n. Out of\n56\nvotes cast, only one was cast for Roche - this must have been\nTisserand\n's vote.\nYou can read the report that\nTisserand\nwrote to support his proposal for Roche to fill the vacancy at\nTHIS LINK\n.\nKopal writes\n[\n5\n]\n:-\n... the rest of the academicians\n(\ntrying no doubt to avoid the injustice of electing him as one of their equals\n)\nvoted for others whose names are all forgotten, and their work as dead as mutton. ... Perhaps the main cause of delay to recognise the fundamental nature of Roche's contributions to modern astrophysics was the extent of the ignorance of his age of the internal structure of the stars; for even by the time when Roche died, scholars of the calibre of\nHenri Poincaré\ndid not find it unreasonable to regard the stars as homogeneous\n(\nand sometimes incompressible!\n)\nself-gravitating globes for the sake of mathematical simplifications permissible on such a basis. That the actual structure of the stars must be very far from such a model did not begin to transpire until the beginning of the\n20\nth century ...\nAlthough Roche was aware that his name had been put forward for election to the Astronomical Section of the\nAcademy of Sciences\n, it is almost certain that he would not have known the results of the election since he died of a chest infection only two days after the vote took place.\nHis Christian faith supported him in his final illness\n[\n2\n]\n:-\nDeath did not surprise him. For a long time he had found, in the exercise of the Christian virtues and in the religious practices of a simple faith, all the consolations attached to the hope of a better life and of a more complete light than that which both rejoices and disturbs our wavering reason here below. There he drew the strength to endure with resignation the sufferings of the obstinate cough which was gradually exhausting him. Provided with the last rites of the Church, he saw without faltering the approach of his supreme hour.\nWe mentioned Édouard Roche's brother Arthur Roche above and promised to give some more information. Arthur Roche also became a mathematician and worked for most of his career as a professor of mathematics at the Montpellier Lycée.\nJoseph Boussinesq\nwas a pupil at the Montpellier Lycée and writes that Arthur Roche\n[\n2\n]\n:-\n... had, in October and November\n1859\n, completed my preparation for the baccalaureate in science with a few lessons.\nBoussinesq\nends the article\n[\n2\n]\nwith the following comment:-\nMay the expression of the unanimous regrets\n[\noffered by Roche's colleagues on his death\n]\nsoften the pain of his brother, to whom you will allow me to offer, in closing, these few pages, because, an excellent professor himself, although in a more modest sphere, he has also acquired, in this capacity, the right to my gratitude.\nThere is, however, much confusion regarding Arthur Roche. Both the obituaries\n[\n8\n]\nand\n[\n9\n]\nare for Arthur Roche and correctly say he taught at Montpellier Lycée. They give, however, Édouard Roche's scientific achievements and are written shortly after Édouard Roche died and\n27\nyears before Arthur Roche died! Clearly both obituaries have confused the two brothers.  Certainly\n[\n9\n]\nclaims to take its information from\n[\n19\n]\nand we note that in\n[\n19\n]\nÉdouard Roche is only referred to as \"M Roche\".\nFinally let us comment on Roche as a teacher by quoting what\nBoussinesq\nwrote about taking courses by Roche at the Faculty of Sciences in Montpellier\n[\n2\n]\n:-\nAs a student of the Faculty of Sciences of Montpellier, I had the happy experience of following, in\n1860\nand\n1861\n, Roche's courses in Infinitesimal Analysis and Mechanics, whose listeners unanimously appreciated his clarity and communicative enthusiasm. I was able above all to appreciate, on various occasions, the excellence of his kindness. I find it impossible to forget, for example, the kindness with which he welcomed me and encouraged my first efforts, when, still having only a slight tinge of special Mathematics, I was introduced to him by his younger brother, M Arthur Roche and I expressed to him the desire to devote my life to the study of science.\nIn\n2006\na crater on the far side of the moon was named for Roche. He also has a crater on the Martian moon Phobos named after him.",
  "matematicos_citados_na_biografia": [
    "Joseph Diez Gergonne",
    "Gergonne",
    "Poisson",
    "Sturm",
    "Liouville",
    "Laplace",
    "François Arago",
    "Lalande",
    "French Academy of Sciences",
    "Cauchy",
    "Le Verrier",
    "Delaunay",
    "Joseph Boussinesq",
    "C G J Jacobi",
    "J L Lagrange",
    "Leonard Euler",
    "Isaac Newton",
    "Academy of Sciences",
    "Joseph Liouville",
    "Félix Tisserand",
    "Tisserand",
    "THIS LINK",
    "Henri Poincaré",
    "Boussinesq"
  ],
  "imagens": [
    "roche.jpg"
  ]
}