{
  "nome_completo": "Roger Paman",
  "nome_curto": "Roger Paman",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Paman/",
  "data_nascimento": "not known",
  "local_nascimento": null,
  "data_morte": "1748",
  "local_morte": null,
  "summary": "Roger Paman was an English mathematician who took part in a voyage hoping to circumnavigate the world. He made contributions to the development of the calculus.",
  "biografia": "We know nothing of\nRoger Paman\n's date of birth, place of birth, or his parents. Almost all we know of him comes from information which he himself gives in the preface to, what appears to be, his only published book. Other details of the events in which he participated are known, however, so we can indirectly work out quite a few details using these other sources.\nAlthough there is no record of Paman being a student at the University of Cambridge, we know that Mr Frank of St John's College, Cambridge gave him a copy of\nGeorge Berkeley\n's\nThe Analyst\n(1734)\n. Paman wrote a paper on this treatise which he called\nThe Harmony of the Ancient and Modern Geometry Asserted\n. This paper was communicated to several members of the\nRoyal Society\n, and it kept circulating until\n1739\n.\nOn\n18\nSeptember\n1740\nPaman set off with George Anson on his journey around the world. Eight ships set out from St Helen's but only one ship, the Centurion, succeeded in making the journey around the world. It returned to England, reaching Spithead on\n15\nJune\n1744\nbut, since Paman was back in England long before this, we know that he was not on board the Centurion. Five of the ships, the Gloucester, the Wager, the Tryal, the Anna and the Industry, were destroyed during the journey, three of them while rounding Cape Horn, so Paman was not on board any of these ships. We can therefore deduce that Paman must have been on one of the two remaining ships, either the Severn or the Pearl.\nThe Severn and Pearl, with Paman on board, left England together with the other ships. They set off across the Atlantic but they were poorly manned and they were ill-equipped. However, they anchored near the coast of Patagonia\n(\nSouthern Argentina\n)\non\n18\nFebruary\n1741\n. On\n7\nMarch they passed the Straits of Le Maire, still with all the other ships. However, on\n10\nApril they lost sight of the other ships, and on\n25\nApril they even lost sight of each other. The two ships, with Paman certainly on one of them, made contact again on\n21\nMay. The weather had been terrible and most of the men were ill, and both ships had to wait before going on. Although we know nothing specific about Paman, he must have suffered along with the other members of the two crews. On\n4\nJuly\n1741\n, the ships arrived in Rio de Janeiro, and Captain Legge, the captain of the Severn, wrote:-\nAnd I arrived by the great mercy of Almighty God safe in this port the\n6\nth\nof June, not having above thirty men in the ship, myself, lieutenants, officers and servants\n(\nbesides three men I had at sea from the Pearl\n)\nthat were able to assist to the working of the ship; and all of us so weak and so much reduced that we could hardly walk along the deck.\nThe two ships remained in Rio for a long time. The crew attempted to get their ships repaired and the extended stop allowed the men to regain their health. However the ships were not happy places and there was much quarrelling over what to do next. On\n5\nFebruary\n1742\n, they arrived in Barbados, by this time on their way home to England.\nIt seems that much of the blame for making Anson's voyage relatively unsuccessful, was given to these two ships. For instance, John Campbell wrote:-\nThe scheme which Commodore Anson was sent to execute, was certainly well laid; and if the two ships that repassed the Streights of Le Maire, and thereby exposed themselves to greater dangers, than they could have met with by continuing their voyage, had either proceeded with the Commodore, or had followed him to the island of Juan Fernandez, he would have had men enough to have undertaken something of consequence either in Chile or Peru ...\nGiven these feelings it is clear that Paman and the other the men from the Severn and the Pearl would not have been treated as heroes when they returned to England.\nIt is reasonable to ask exactly what Paman's role had been on the voyage. Perhaps the best indication of this is given in an advertisement for a book which Paman intended to write. This book would have given:-\n... the height of the Mercury in the Thermometer every Day at Noon, during the Months of February, March, April and May, between the Latitudes of\n40\n° and\n60\n° South. An accurate Account of the Variations of the Needle, at different Distances, on the same Parallels from the Coasts of Brazil, Patagonia, and Terra del Fuego. With such Curious Particulars relating to different Parts of South America, as the Author had an Opportunity of remarking himself, or procuring from Persons of Credit and Distinction, during Seven Months that he lived in Brazil.\nIt is possible that Paman wrote this book, but no trace of it has been found nor is there any evidence that it was published. The most likely explanation is that there was insufficient interest generated by the advertisement.\nBefore setting out on the voyage, Paman had given his paper,\nThe Harmony of the Ancient and Modern Geometry Asserted\n, to his friend Dr Hartley, and when he returned, in February\n1742\n, Paman sent it to the\nRoyal Society\n. This paper must have been the main reason for his election as a Fellow of the\nRoyal Society\n. He was recommended by\nAbraham de Moivre\n, R Barker and G Scott on\n10\nFebruary\n1743\n, with the following text\n(\npreserving the old English spelling\n)\n:-\nMr Roger Paman of London: A Gentleman Extremely well versed in all the Parts of the higher Mathematicks desiring to be a member of this Society we recommend him as personally known to us and likely to become a usefull Member thereof.\nHe was elected a Fellow on\n12\nMay\n1743\n.\nPaman's paper was published the paper as a book in\n1745\n. The book was titled, as the paper,\nThe Harmony of the Ancient and Modern Geometry asserted\n. The preface was dated\n1\nAugust\n1745\nwhile the postscript to the preface is dated\n24\nAugust\n1745\n. The book probably appeared in October of that year, as\nThe Gentleman's Magazine\nincludes this book in its list of \"Books and Pamphlets published this Month\":-\nThe harmony of the ancient and modern geometry asserted; in answer to the Analyst, etc. pr.\n7\ns.\n6\nd. sew'd.\nAs this states, Paman had written his work to answer the criticisms of the calculus presented by\nBerkeley\nin\nThe Analyst\npublished in\n1734\n. His reasons are clearly stated in the preface:-\nHaving undertaken to cultivate the Discoveries of the Moderns upon the Principles of the Ancients, without any Considerations of Velocity, Time or Motion of Indivisibility or Infinity, in such a Manner that, whilst I omitted those Considerations, I might not neglect the Design ... of introducing them first into Geometry, and that whilst I aimed at the Rigour of the Ancients, I might avoid the Tedium and Perplexity of their Demonstrations ad absurdum.\nThe way that Paman attempted to avoid \"considerations of velocity, time or motion of indivisibility or infinity\" was to introduce certain new concepts. First he defines \"radical quantity\":-\nI call one Expression the radical Quantity of another; when the latter is compos'd of any Power or Powers of the former, their Parts or Multiples.\nA \"radical Quantity\" is close to what today would be called a \"variable\", even though Paman implies that an expression can be composed of this variable only by taking powers of it, and by multiplicating by scalars, which means that Paman is thinking of polynomials or power series.\nHe next defines the \"first State of\nx\nx\nx\n\" which would in today's terminology be a neighbourhood of\n0\nin the positive real numbers. He also defines concepts he calls \"Maximinus\" and \"Minimajus\":-\nIf one Expression be less\n(\ngreater\n)\nthan another, in the first State of their radical Quantity, and yet no Quantity of the same Kind can be added to\n(\nsubtracted from\n)\nthe former, without making the Sum\n(\nRemainder\n)\ngreater\n(\nless\n)\nthan the latter in the first State of their radical Quantity; then I call the former the first Maximinus\n(\nMinimajus\n)\nof the latter.\nPaman himself explains this concept in the preface:-\n... all that is understood by a Maximinus, is such a Quantity as being less than another, cannot be augmented by any Quantity of the same Kind, that is by any Part of itself, without becoming greater; thus A is the Maximinus of B, when it is the greatest of all those Quantities of the same Kind that are less than B. And all that is understood by a Minimajus is such a Quantity, as being greater than another, cannot be diminished by any Quantity of the same Kind without becoming less.\nPaman's explanation looks like our present definition of infimum and supremum, but whereas our infimum and supremum given a set\n(\nof real numbers\n)\ngives a real number, the Maximinus and Minimajus of a quantity is a quantity of the same kind.\nWith these concepts Paman defines fluxions. Paman's terminology will of course seem strange at first glance. But as all of the terms he introduces cover concepts developed by Paman, we cannot blame him for using new names. But we must consider whether these concepts are actually useful.\nIn a limited sense, they certainly are. Paman managed to give foundations to the calculus using these concepts, and he needed all of them. But we would not be able to define the derivative using Paman's terms since we consider more complicated functions than the polynomials or power series which Paman considered. However, the states of\nx\nx\nx\nare closely related to the very important concept of neighbourhoods\n(\nthe latter of course being used far more generally than just on\nR\n\\mathbb{R}\nR\n)\n, and the Maximinus and Minimajus are cousins of lim inf and lim sup\n(\nalthough more powerful\n)\n.\nIt must therefore be said that far from introducing concepts for their own sake, Paman introduced interesting new concepts that were useful to him and that would have been useful to mathematics if other mathematicians had noticed them.\nThere was another approach to answering\nBerkeley\ndue to\nMaclaurin\nwho published\nA Treatise of Fluxions\nin\n1742\n. This was after Paman's first version of his paper, but before the publication of Paman's book. Certainly we know that Paman read\nMaclaurin\n's treatise for he wrote in his book that the two books at times agreed strongly with each other:-\n... at my return I found Mr\nMacLaurin\nhad published his Treatise of Fluxions, in which I have the pleasure to see my agreement with that ingenious gentleman ...\nThere seems no way of discovering whether Paman made major changes to his manuscript after reading\nMaclaurin\n's treatise.\nIn fact there were three authors,\nRobins\n,\nMaclaurin\nand Paman, who attempted to answer\nBerkeley\nin different ways.\nRobins\ngave an explanation of\nNewton\n's theories, with clearer definitions and rigorous proofs, while still depending on intuitive concepts.\nMaclaurin\nmanaged to give foundations using neither\ninfinitesimals\nnor motion or velocities. Given his position in the learned world, it was only natural that his answer was the one to be remembered by most, especially when his work also included much interesting mathematics. However, it is interesting to see Paman's remarkably modern work - with concepts resembling our neighbourhood concept and lim inf and lim sup. Sadly, his work was apparently not studied at the time, and did not influence the later developments. It only in\n1989\n, when Breidert and Sageng made detailed studies of Paman's work, that its contents became known.\nThanks to\nBjorn Smestad\nfor his permission to use material from his article on Paman. See the Web site below.",
  "matematicos_citados_na_biografia": [
    "George Berkeley",
    "Royal Society",
    "Abraham de Moivre",
    "Berkeley",
    "Maclaurin",
    "MacLaurin",
    "Robins",
    "Newton",
    "infinitesimals"
  ],
  "imagens": []
}