{
  "nome_completo": "Roger Bacon",
  "nome_curto": "Roger Bacon",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bacon/",
  "data_nascimento": "1214",
  "local_nascimento": "Ilchester, Somerset, England",
  "data_morte": "June 1292",
  "local_morte": "Oxford, England",
  "summary": "Roger Bacon was an English mathematician. His most important mathematical contribution is the application of geometry to optics.",
  "biografia": "Roger Bacon\n's parents were well-off landowners. His father, however, must have had a high regard for education since two of his sons became academics and he was prepared to support them financially. Before giving the few details of his early years that are known, we should say a little about the date of birth we have given for Roger. All that is known is that in\n1267\nBacon wrote the following:-\nI have laboured diligently in sciences and languages, and forty years have passed since I first learned the alphabet. I have always been studious and for all but two of these forty years I have been in study.\nThe date of\n1214\nis arrived at by assuming that the passage means that forty years have passed since he began his university studies. These began at the age of thirteen, so\n53\nfrom\n1267\ngives the date of\n1214\nas the year of his birth. There is, however, another interpretation. This is to accept as a literal fact that he first learned the alphabet in\n1227\n. If so then perhaps he was born around\n1222\nbut would Bacon claim to have been in study since the age of five? This would seem unlikely for the son of landowners of this period.\nRoger was not the oldest of his parent's sons so he would not have been expected to inherit the family estates and wealth. It is likely that his parents would have expected him to have become a priest which was the usual route for a son, other than the first, of a family in their position. Although there is no record of Roger's education before he entered Oxford University it is likely that he would have been taught Latin and arithmetic by the local priest to prepare him for university studies\n(\nwhere all teaching was carried out in Latin\n)\n. At the age of thirteen he entered Oxford University, his father putting up the money for his board, subsistence, and tuition.\nOf course we must not think of Bacon's university course in terms of the three or four year university course of today. Entering university at the age of thirteen meant that the university was providing both what would be considered today as a secondary and tertiary education, so Bacon would have spent many years of study at Oxford. His initial studies covered the trivium of grammar, logic, and rhetoric. He then progressed to the quadrivium, studying geometry, arithmetic, music and astronomy. He received Master's Degree from the University of Oxford and remained there teaching until around\n1241\n.\nThe teachings of\nAristotle\nhad been banned at the University of Paris for several years on the grounds that\nAristotle\nwas not a Christian. However in the early\n1240\ns Paris reintroduced the teachings of\nAristotle\ninto their courses. They looked to the young lecturer Bacon, who had become an expert on\nAristotle\nat Oxford where his teachings formed a major part of the course material, to lecture at the University of Paris on\nAristotle\n's ideas. He joined the Faculty of Arts in Paris, which was divided into four administrative units, three being French and one, which Bacon joined, being English. This was only an administrative set-up and in no way indicated the language of teaching which, like Oxford, was Latin. Students who find\n9\na.m. lectures impossibly early in universities today should note that lectures in Paris in Bacon's time began at\n6\na.m.\nWe should note that up to this time Bacon showed little interest in science. It was while at Paris that he met Peter Peregrinus who was to be a major influence on him. Bacon later wrote:-\n[\nPeregrinus\n]\ngains knowledge of matters of nature, medicine, and alchemy through experiment, and all that is in the heaven and in the earth beneath. ... Moreover, he has considered the experiments and the fortune-telling of the old witches, and their spells and those of all magicians. And so too the illusions and wiles of all conjurors; and this so that nothing may escape him which ought to be known, and that he may perceive how far to reprove all that is false and magical.\nPeregrinus later wrote a famous treatise on magnets while serving as an engineer in the army of Charles I of Anjou. His masterpiece was written while the army was besieging Lucera in Italy in August\n1269\nwhile on a crusade approved by the Pope.\nBacon's interest in mathematics and natural philosophy, probably aroused by Peregrinus, took over his life in Oxford after he returned there in\n1247\n. It became a passion into which he poured all his family's wealth. He bought books, equipment, instruments, and mathematical tables. These were all very expensive for all books were in manuscript and each volume had to be copied by hand. He was much influenced by the writings of\nGrosseteste\nand he embarked on a deep study of languages, mathematics, optics and sciences. So hard did he study that he had no time for friends or the university life around him. He was so fully occupied with his studies that those around him marvelled that his health stood up to the long hours he spent.\nHis most important mathematical contribution is the application of geometry to optics. He said:-\nMathematics is the door and the key to the sciences.\nBacon had read\nal-Haytham\n's\nOptics\nand this made him realise the importance of the applications of mathematics to real word problems, see\n[\n26\n]\n. He followed\nGrosseteste\nin emphasising the use of lenses for magnification to aid natural vision. He carried out some systematic observations with lenses and mirrors. He seems to have planned and interpreted these experiments with a remarkably modern scientific approach. However many experiments are described in his writings which he never carried out in practice. Lindberg\n[\n23\n]\nsays Bacon's experiments included:-\n... contrived or artificial experiments, casual everyday experience, reports of the experiences of other observers, the spiritual experience of divine illumination, and what I\n[\nLindberg\n]\ncall geometrical experiments.\nIn\nDe mirabile potestate artis et naturae\n, which is essentially a letter written around\n1250\n, Bacon described his scientific ideas, in particular his ideas for mechanical devices and some of his optical achievements.\nBacon visited Paris in\n1251\nbut later left the University of Oxford and entered the Order of Friars Minor, the Franciscan Friary in Oxford. It is unclear exactly what his reasons were for this move. Certainly he was a devout Christian who believed that his scientific work would aid an understanding of the world, and so of God through understanding His creation. St Augustine had encouraged Christians to learn from and make Christian use of the teachings of pagan philosophers. Bacon strongly believed in this teaching by St Augustine and studied all the Greek and Arabic works he could lay his hands on. This was not the view of many in the Church, however, who believed that a study of the scriptures was the only path to knowledge and disapproved of the study of non-Christian philosophers. Joining the Franciscans, who had a tradition of scholarship, may have been a move to give Bacon some protection from those opposed to his views. It may simply be that by this time his enormous expenditure on scientific study had used all his family's funds, he was forced to find a means to provide his keep. Some historians suggest that the move was largely due to ill health, perhaps caused by over-work.\nIn the Oxford friary he continued his interest in the sciences. Study was a major part of the life of the friars, although Bacon's experimental science would have been a unique form. The friary had an excellent library so, although he was now not allowed personal possessions by the rules of the Order, he could still continue his scientific pursuits. However, in\n1256\nRichard of Cornwell became head of the academic side of the Franciscan Order in England. This was unfortunate for Bacon who was very critical of Richard's ideas. Perhaps, therefore, it is not surprising that soon after Richard was appointed, Bacon was forced to end his academic studies at the Oxford friary and was sent to a friary in Paris. He wrote:-\nThey forced me with unspeakable violence to obey their will.\nFor about\n10\nyears Bacon had no personal contact with the outside world although he was able to correspond by letter. One of the few academic tasks he was able to do during this time was work on calendar reform. His plea to the Pope to reform the calendar was not listened to and when\n300\nyears later the Church did reform the calendar along the lines suggested by Bacon, he received no credit for his early proposals. Bacon was also able to teach mathematics while in the Paris friary, so although it appears that the intention was to prevent him from undertaking research which the Church did not approve, life of a sort was still possible.\nBacon contacted Cardinal de Foulques in\n1264\nproposing to write a book on science which would be of benefit of the Church. There seemed to be some misunderstanding, for Cardinal de Foulques got the idea that the book was already written and asked to see it. Bacon saw this as his only chance to restart his scientific studies and be free from the Paris friary. However with no money, and by now his family in England were ruined through choosing the losing political side, he had little means to produce the required text. However, in\n1265\nCardinal de Foulques became Pope Clement IV and Bacon now had the support of the Pope. He contacted the Pope who replied in a letter written on\n22\nJune\n1266\ntelling Bacon to write his work in secret so that his superiors would not know that he was breaking the rules of his Order. This seemed impossible to Bacon, so he approached his superiors showing them the Pope's request. He was allowed to proceed.\nBy\n1267\nBacon had written what looks remarkably similar to a grant proposal that a mathematician or scientist might make today. His proposal was for an encyclopaedia of all the sciences worked on by a team of collaborators, coordinated by a body in the Church. His proposal was contained in the rapidly composed\nOpus maius\n(\nGreat Work consisting of\n840\npages\n)\n,\nOpus minus\n(\nSmaller Work\n)\nand the\nOpus tertium\n(\nThird Work\n)\n. Bacon was aiming to show the Pope that sciences had a rightful role in the university curriculum and were important to the Church. He wrote down in\nOpus maius\nan astounding collection of ideas, for example he gives a proposal for a telescope:-\nFor we can so shape transparent bodies, and arrange them in such a way with respect to our sight and objects of vision, that the rays will be reflected and bent in any direction we desire, and under any angle we wish, we may see the object near or at a distance ... So we might also cause the Sun, Moon and stars in appearance to descend here below...\nThis work also gives\n42\n° for the maximum altitude of the rainbow, a more accurate value than any previously given and one which Bacon must have discovered by experiment. The article\n[\n16\n]\nis an excellent account of how Bacon's ideas on logical theory evolved during his career. From his early work he introduced innovations in semantic theory and in\nOpus maius\nhe extended these ideas applying them to problems of theology and philosophy.\nThe\nOpus maius\nwas sent to the Pope by a courier John, who was Bacon's favourite pupil. We know that the manuscript reached Rome but Pope Clement IV died before seeing it and Bacon's chances of having his great project come to fruition vanished.\nAbout this time, however, Bacon was able to leave the friary in Paris and return to England. There he embarked on the great project he had proposed to the Pope, starting to write the\nCommunia naturalium\n(\nGeneral Principles of Natural Philosophy\n)\nand the\nCommunia mathematica\n(\nGeneral Principles of Mathematical Science\n)\n. This last work contains a study of quantity and of the theory of proportions which Bacon intended as part of volume II of his synthesis of knowledge. Only parts were ever published, probably most was never written, but again there was some remarkable insights on astronomy and calendar reform which Bacon had formed after making observations. It was reported that Bacon\n... did sometimes use in the night season to ascend this place\n(\nhis study on Folly Bridge, on an eyot midstream in the Thames\n)\nenvironed with waters and there to take the altitude and distance of stars and make use of it for his own convenience...\nBacon believed that the Earth was a sphere and that one could sail round it. He estimated the distance to the stars coming up with the answer\n130\nmillion miles.\nAround\n1278\nBacon was put in prison in the convent in Ancona in Italy by his fellow Franciscans, the charge being of\nsuspected novelties\nin his teaching. Here friars who had views with which their superiors disagreed were put in solitary confinement and not allowed to speak even to their guards for fear their views would have influence. They were refused confession and denied absolution so, their superiors believed\n(\nand so did the imprisoned friars\n)\n, they would go to hell for all eternity. A change in the Franciscan leadership in\n1290\n, however, saw Raymond of Guafredi take control of the Order and following the teachings of love by St Francis, released the prisoners in Ancona. Although we have no explicit evidence that Bacon was among these men, it seems very likely that he was and he must have returned to England as soon as he could.\nFrom his writings it is clear that Bacon had always argued for what he believed and against those he believed to be wrong. He continued to state his views even after suffering the prison at Ancona for around\n12\nyears. They were as aggressively stated in\nCompendium studii theologiae\n, his last writings of\n1293\n, as at any time in his life.",
  "matematicos_citados_na_biografia": [
    "Aristotle",
    "Grosseteste",
    "al-Haytham"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}