{
  "nome_completo": "Rudolf Skuherský",
  "nome_curto": "Rudolf Skuherský",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Skuhersky/",
  "data_nascimento": "24 April 1828",
  "local_nascimento": "Opocno, Bohemia, now Czech Republic",
  "data_morte": "9 October 1863",
  "local_morte": "Prague, Bohemia, now Czech Republic",
  "summary": "Rudolf Skuhersky was the first Professor of Descriptive Geometry at the Prague Polytechnic. He argued for reforms of the Polytechnic to have lectures in both Czech and German. He was elected to parliament as a member of the Czech National Party.",
  "biografia": "Rudolf Skuherský\nwas the son of František Alois Skuherský\n(1794\n-\n1864)\nand his wife Karolina Svobodova. František Skuherský, the son of a tanner, had been born at Zamecka no.\n65\nin Opocno. He studied medicine and surgery at the University of Prague and became a medical doctor in\n1821\n. From\n1823\nhe practised medicine in Opocno and his fame as an excellent doctor soon spread far and wide. He was a friend of Jan Evangelista Purkyne\n(1787\n-\n1869)\n, an anatomist and physiologist, who was one of the best known scientists of his day. František Skuherský founded a hospital in Opocno, supported by donations from\n30\n,\n000\npeople. The hospital, which opened in\n1838\nand served mostly poor patients, was one of the first in Bohemia. He was also the organiser of theatre and music performances.\nFrantišek and Karolina Skuherský had a son Rudolf, the subject of this biography, born in Opocno in\n1828\n. They had a second son, František Zdenek Xavier Alois Skuherský\n(1830\n-\n1892)\n, who was born in Opocno on\n31\nJuly\n1830\n. Let us note here that František Zdenek Skuherský studied philosophy and medicine at the Charles University in Prague, then studied music at an organ school in Prague. He had a career teaching music and is famed as a composer. His most famous pupil was the Czech composer Leos Janacek\n(1854\n-\n1928)\n.\nThe Skuherský family was, as we have seen, closely connected with the town of Opocno so we shall give a little information about it. It is situated in the Hradec Kralové Region in north-eastern part of the historical region of Bohemia. The noble Colloredo family were granted Opocno Castle by the Holy Roman Emperor in\n1634\nand later generations became Princes of Colloredo-Mannsfeld. The\n2\nnd Prince was Rudolf Colloredo-Mansfeld\n(1772\n-\n1843)\nwho had become Prince in\n1807\n. František Alois Skuherský was financially supported by the Prince for his undergraduate studies at the University of Prague, and he became the Prince's doctor when he returned to Opocno in\n1823\n.\nRudolf Skuherský studied at the Gymnasium in the town of Hradec Kralové for three years, then for one year in Broumov, which is in the Hradec Kralové region. It would have been natural for Rudolf to follow his father into the medical profession, particularly since his father was making such a success of his career. He decided, however, that medicine was not the subject for him so he went to Prague where he studied for the two years\n1842\n-\n44\nat a High School, then he spent one year studying engineering at the Prague Polytechnic. The Prague School of Engineers had been founded in\n1707\nand, in\n1806\n, it had been transformed into the Prague Polytechnic Institute. When Skuherský studied there it had four Departments: Civil and Water Engineering, Architecture, Chemistry, and Mechanical Engineering.\nChristian Doppler\ntaught Skuherský mathematics at the Polytechnic, in particular with a course on theoretical geometry. Skuherský also studied courses on physics and botany during the year he spent at the Polytechnic.\nDespite performing well at the Prague Polytechnic, Skuherský was not happy with the teaching there. This is not too surprising since the professors there were under extreme pressure, so much so that it damaged their health. For example,\nDoppler\n's heath failed under the pressure\n[\n4\n]\n:-\nThe examinations were very stressful. The terms of both oral and written exams had to be reported in advance to the Land Committee which also nominated the examination commissioner. For example, in January and February\n1843\nDoppler\nhad to examine\n256\nstudents in\n17\ndays, both in writing and orally, in arithmetic and algebra. The examinations took a minimum of six hours daily. The same number of students sat for the examination in \"theoretical geometry\" in June and July of the same year in a twelve day examination. Additionally in July and August it was necessary to examine\n145\nstudents in geodesy in eight days. ... In July\n1847\nDoppler\norally examined\n526\nstudents in mathematics and\n289\nin geodesy.\nAfter a year at the Prague Polytechnic, Skuherský returned to his home town of Opocno in\n1845\nwhere he was employed as an economics official on the estate of Prince Rudolf Colloredo-Mansfeld. In\n1848\nthere were revolutions across Europe with students demanding freedom of the press and better education while workers protested against the intolerable conditions in which they were forced to work. For the Czechs it became a milestone in the nationalist movement providing the opportunity for nationalist demands. By the autumn things were somewhat quieter and Skuherský returned to Prague hoping to continue his technical studies in improved circumstances. Back at the Polytechnic, he studied hard and excelled in technical drawing and was awarded prizes for his excellent work. He especially liked descriptive geometry, but at the Prague Polytechnic only the most basic foundation of the subject was covered, so he went to the Polytechnic in Vienna in\n1849\n.\nThe Imperial and Royal Polytechnic Institute of Vienna had been founded in\n1815\nto provide a technical or scientific education. The Polytechnic was modelled on the École Polytechnique in Paris with Johann Joseph Prechtl\n(1778\n-\n1854)\nas its director. The revolutionary events of\n1848\ncaused the Polytechnic to suspend teaching in March\n1848\nand soldiers were billeted there, causing damage to both the buildings and the teaching material. Teaching began again in October\n1849\n, and it was at this time that Skuherský began his studies there.\nJohann Hönig\n(1810\n-\n1886)\nwas Professor of Descriptive Geometry at the Polytechnic Institute in Vienna having been appointed in\n1843\n. He had been a student at the Polytechnic Institute, served as an assistant to the Professor of Mechanics there from\n1835\nto\n1839\n, and had then been Professor of Descriptive Geometry and Civil Architecture at the Mining and Forestry Academy in Schemnitz from\n1839\nto\n1843\n. Skuherský studied under Hönig who supervised his research. In\n1850\nhis first two papers were published in the Proceedings of the Kaiserliche Akademie der Wissenschaften in Wien\n(\nnow the\nAustrian Academy of Sciences\n)\n, namely\nDie orthographische Parallelperspektive\nⓉ\n(\nThe Orthographic Parallel Perspective\n)\nand\nDie Theorie der Theilungspunkte als Beitrag zur Lehre von der freien Perspektive\nⓉ\n(\nThe theory of division points as a contribution to the doctrine of free perspective\n)\n. The first of these two papers begins:-\nThe position of a point in space is perfectly determined when its distances from three coordinated planes are known.\nIn the elements of analytical and descriptive geometry, it is also shown, as is well known, that the position of the coordinate planes in relation to one another is entirely arbitrary, and that the position of a point in space can also be fixed differently; but in these developments the coordinate planes should always be assumed to be perpendicular to each other and only right-angled coordinates should be mentioned. In descriptive geometry, it is seldom a question of the absolute position of the various objects.\nThe chief object of this science is: the faithful representation of the most varied forms in their various combinations, and therefore the exact determination of the relative position of individual points under different circumstances its main task.\nSkuherský graduated from the Construction Department of the Prague Polytechnic in\n1851\n. The excellent work he had done for the two papers just mentioned led to him being appointed as Johann Hönig's assistant and he held this post until\n20\nNovember\n1852\n.\nAn Imperial Decree of\n24\nOctober\n1843\ngave the Polytechnic in Prague the same rights as the Polytechnic in Vienna. The required reorganisation was delayed by the revolution of\n1848\nand only on\n17\nJanuary\n1850\ndid a decree authorise four new professorships for the Prague Polytechnic: higher mathematics; descriptive geometry; analytical chemistry; and palaeontology. On\n7\nNovember\n1852\n, a decree appointed Skuherský as temporary Professor of Descriptive Geometry. The reorganisation had only allowed for a temporary professorship of Descriptive Geometry but it was expected that it would become a full permanent professorship in due course. The reorganisation also set up a preparatory year to bring students up to the required level before they began their courses. Skuherský taught mathematics in this preparatory year as well as teaching courses on descriptive geometry. After the full permanent professorship of Descriptive Geometry was authorised on\n19\nJuly\n1854\n, Skuherský was appointed to that post on\n16\nAugust\n1854\n.\nIn\n1855\nSkuherský published the book\nDie orthographische Parallel-Perspective\nⓉ\n(\nThe Orthographic Parallel Perspective\n)\n. Here is a translation from German to English of the Preface:-\nPreface\nIn my first essay on orthographic parallel perspective, I developed the principles of this projection method and attempted to shed more light on the various representations of tri-, di-, isometric and oblique projection, as well as the graphic operations on which they are based.\nIn some remarks on the methods of perspective projection hitherto known, I have endeavoured to point out the generality of orthographic parallel perspective and several circumstances worthy of consideration which enable the designer to produce a perspective picture of an object without a special expenditure of time and effort, depending on the wishes of the individual and the purpose of the executing drawing, - and thus speak for the advantageous applicability of this projection method.\nIn the same essay I mentioned that by means of the method of free shadow determination in the orthographic parallel perspective, similar to the pure perspective, being able to determine the shadow on any object not infrequently with little effort and with visible advantages over the hitherto customary method of construction.\nThe construction of shadows for orthogonal and central projections can be found comprehensively treated in many works, but there is still a lack of an implementation of the same for a parallel perspective without the aid of the orthogonal projections of the shadow of an object.\nI therefore tried to fill this gap and, in the present work, to deal briefly with the most essential of the free definition of the shadow in its application to the orthogonal or orthographic parallel perspective that I proposed in\n1850\nand was favourably received by the technical public.\nIndividual tasks involved in determining shadows were given special consideration insofar as they can be treated as problems of descriptive geometry.\nPrague,\n20\nJanuary\n1855\n.\nThere were a few difficult years in the\n1850\ns due to Bach's absolutism. From\n1852\n, this system, brought in by the Minister of the Interior Baron Alexander von Bach, reduced freedom of the press and promoted other absolutist policies. In August\n1855\n, a concordat gave the Roman Catholic Church control over education. During this period, Skuherský concentrated on his academic work and kept out of political affairs.\nKarel Drabek writes\n[\n1\n]\n:-\nAccording to contemporary reports, Professor Skuherský explained things in a very engaging and understandable way. Also with his listeners, who in the vast majority of cases liked the subject, he established lasting friendly relations with many of them.\nOn his travels in Western Europe and England, Professor Skuherský met prominent workers in descriptive geometry, learnt French and English, and continued to emphasise the need to know foreign languages. He focused his extracurricular activities first on alleviating the misery of the poor technical students, so at the beginning of the\n1860\n-\n61\nacademic year, thanks to him, a fund was set up for the providing of free lunches, which was organised by an elected student committee.\nAfter Bach's absolutism fell out of favour, Skuherský entered Czech political and national life. As a member of the Czech National Party, he was elected to the parliament. He also worked in the Czech National Museum, and was a founding member of Czech Sokol in\n1862\n. This organisation aimed to provide a physical, moral, and intellectual training for the nation. He also worked to encourage industry in the Czech Republic.\nTeaching in the Prague Polytechnic had been in German and hence Skuherský published his book in the German language. He was a passionate believer, however, in equality between the Czech and German languages and was a strong supporter of reorganising the Polytechnic to allow this to be possible. In\n1860\n-\n61\nhe gave his lectures on descriptive geometry in Czech to\n156\nfirst-year students and he arranged for his assistant Rafael Morstadt\n(1835\n-\n1908)\nto deliver the lectures in German to\n63\nstudents.\nSkuherský died suddenly at the age of\n35\n. He contracted diphtheria and died from the disease eight days later\n[\n1\n]\n:-\nThe whole of Prague proved with their participation in his funeral how they respected this man. The funeral procession came out of his house No.\n831\non the corner of Jindrisska Street and Wenceslas Square opposite today's Polish Cultural Centre. It was attended by all organisations and associations in which Professor Skuherský had been active, and also those he had supported. He was buried in the Olsany cemetery ... .\nOn\n25\nMay\n1957\nCzechoslovakia issued a series of four stamps to commemorate the\n250\nth anniversary of the creation of the School of Engineering in Prague. The\n30\nhaler stamp had a portrait of Josef Bozek\n(1782\n-\n1835)\n, the\n60\nhaler stamp had a portrait of\nF J Gerstner\n, the\n1\nkoruna stamp had a portrait of R Skuherský, and the\n1\n.\n40\nkoruna stamp had a picture of the School of Engineering building. See\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Christian Doppler",
    "Doppler",
    "Austrian Academy of Sciences",
    "F J Gerstner",
    "THIS LINK"
  ],
  "imagens": [
    "skuhersky.jpg"
  ]
}