{
  "nome_completo": "Ruth Moufang",
  "nome_curto": "Ruth Moufang",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moufang/",
  "data_nascimento": "10 January 1905",
  "local_nascimento": "Darmstadt, Germany",
  "data_morte": "26 November 1977",
  "local_morte": "Frankfurt am Main, Germany",
  "summary": "Ruth Moufang studied projective planes, introducing Moufang planes and non-associative systems called Moufang loops.",
  "biografia": "Ruth Moufang\n's father, Eduard Moufang\n(1874\n-\n1941)\n, was a chemist who was an expert on brewing and beer, and had written books on that topic. He acted as a scientific consultant to industry. Eduard Moufang was the son of Friedrich Carl Moufang\n(1848\n-\n1885)\nfrom Mainz, who was a businessman in Frankfurt am Main, and Elisabeth von Moers from Mainz. Ruth Moufang's mother was Else Fecht, who was the daughter of Alexander Fecht\n(1848\n-\n1913)\nfrom Kehl and Ella Scholtz\n(1847\n-\n1921)\n. Ruth was the younger of her parents' two daughters, having an elder sister Erica\n[\n5\n]\n:-\nThe two sisters appear to have been encouraged in their intellectual pursuits by their family, as was common among the educated German middle class of that period.\nBoth girls attended the\nRealgymnasium\nin Bad Kreuznach, Ruth beginning her studies there in\n1913\n. Both were taught mathematics by the teacher Wilhelm Schwan who began teaching at the Realgymnasium in Bad Kreuznach in\n1918\n. Schwan wrote a widely used mathematics text and the two Moufang sisters helped him by making the drawings for the diagrams in the book. Both Ruth and Erica Moufang had considerable artistic skills and this was put to good use in their work on Schwan's geometry book. Ruth became fascinated with mathematics through Schwan's inspirational teaching and her sister Erica went on to become an artist. Let us note that Wilhelm Schwan, in addition to the geometry text, edited a volume of mathematics lectures. He became affiliated with the University of Frankfurt and obtained a doctorate in mathematics from the University.\nIn\n1924\n, Moufang passed her Abitur examination while at the gymnasium in Bad Kreuznach and later that year she began her studies at the Johann Wolfgang Goethe University in Frankfurt am Main. This university had been founded in\n1914\nand admitted female students from the start.\nArthur Schönflies\nwas the first full professor at Frankfurt but he retired before Moufang began her studies, being replaced by\nCarl Ludwig Siegel\n. Other leading mathematicians teaching there when Moufang was a student included\nErnst Hellinger\n,\nMax Dehn\n, who was appointed to succeed\nLudwig Bieberbach\nafter he left in\n1921\n,\nOtto Szász\n, and\nPaul Epstein\n. She took the examinations to qualify her to teach at a Gymnasium in\n1929\n, and then continued studying at Frankfurt where she undertook research for a doctorate. She was supervised by\nMax Dehn\nand obtained a Ph.D. in\n1931\nfor her thesis\nZur Struktur der projektiven Geometrie der Ebene\nⓉ\n(\nOn the structure of projective geometry of the plane\n)\non\nprojective geometry\n[\n4\n]\n:-\nMoufang's graduate work would be the most significant of her career. In it, she transported the axioms\nDavid Hilbert\nhad postulated for the realm of plane geometry into the field of projective geometry.\nFollowing the award of her doctorate, Moufang was awarded a fellowship which let her spend the academic year\n1931\n-\n32\nundertaking research at the University of Rome. She returned to Germany in\n1932\nand was appointed to a temporary teaching position, a Lehrauftrag\n(\nLectureship\n)\n, at the University of Königsberg. After teaching for the academic year\n1932\n-\n33\nin Königsberg, she returned to Frankfurt where again she was appointed to a lectureship. The next few years were ones of great difficulty for the mathematics department at Frankfurt after the Nazi party came to power in\n1933\n. Because he was Jewish,\nSzász\nwas banned from teaching in\n1933\n. For the same reason\nDehn\nand\nHellinger\nwere forced to retire in\n1935\nand\nEpstein\nresigned voluntarily to avoid being dismissed. The remarkably productive period for mathematics at Frankfurt from its founding in\n1914\nended in the early\n1930\ns with these dismissals. During the years that she was teaching at universities, Moufang was also working on her\nhabilitation\nthesis. She submitted her thesis to the Johann Wolfgang Goethe University in Frankfurt am Main in\n1936\n.\nFrom\n1931\nto\n1937\nshe had studied projective planes introducing Moufang planes and non-associative systems called Moufang loops. In\n[\n2\n]\nChandler and\nMagnus\ndescribe her contributions to geometry, putting them into context as follows:-\nA large part of her work is dedicated to the foundations of geometry. Her most outstanding contribution to this field is a result which adds a third important discovery to two others made previously by\nHilbert\n(1901\nand\n1930)\n. Reversing a development going from\nEuclid\nto\nDescartes\nin which geometry is replaced by algebra as a fundamental discipline of mathematics,\nHilbert\nhad shown that a subset of his axioms for plane geometry\n(\nessentially the incidence axioms\n)\ntogether with the incidence theorem of\nDesargues\npermits the introduction of coordinates on a straight line which are elements of a skew field. If\nDesargues\n' theorem is replaced by that of\nPappus\n, the coordinates become elements of a field. Moufang\n(1933)\nshowed that another incidence theorem, called the theorem of the complete quadrilateral\n(\nor of the invariance of the fourth harmonic point\n)\n, allows one to introduce coordinates which are elements of an alternating division algebra. This and a subsequent paper had the effect of stimulating further research of these algebras and of other nonassociative algebraic structures\n(\nMoufang loops\n)\n. Her work is based both on a powerful geometric intuition and on the development of difficult algebraic techniques. It is supplemented by a sequence of papers on continuum mechanics.\nShe published seven papers on this work. These are:\nZur struktur der projectiven Geometrie der Ebene\nⓉ\n(\nOn the structure of projective geometry of the plane\n)\n(1931)\n;\nDie Einführung in der ebenen Geometrie mit Hilfe des Satzes von vollständigen Vierseit\nⓉ\n(\nThe Introduction to plane geometry using the principle of complete quadrilateral\n)\n(1931)\n;\nDie Schnittpunktssätze des projektiven speziellen Fünfecksnetzes in ihrer Abhängigkeit voneinander\nⓉ\n(\nThe intersection of sets of projective special triangle networks in their dependence on each other\n)\n(1932)\n;\nEin Satz über die Schnittpunktsätze des allgeimeinen Fünfecksnetzes\nⓉ\n(\nA theorem on the intersection of the general triangle networks\n)\n(1932)\n;\nDie Desarguesschen Sätze von Rang\n10\nⓉ\n(\nThe Desargues sets of rank\n10\n)\n(1933)\n;\nAlternativkörper und der Satz vom vollständigen Vierseit\nD\n9\nD_{9}\nD\n9\n​\nⓉ\n(\nAlternative fields  and the principle of the full quadrilateral D\n9\n)\n(1934)\n; and\nZur Struktur von Alternativkörper\nⓉ\n(\nOn the structure of an alternative body\n)\n(1934)\n. Moufang published only one paper on\ngroup theory\n,\nEinige Untersuchungen fiber geordenete Schiefkörper\nⓉ\n(\nSome investigations on a fibre ordered skew field\n)\n, which appeared in print in\n1937\n. In this paper, which was motivated by the two papers of\nHilbert\non geometry mentioned above\n(\npublished in\n1901\nand\n1930)\n, she examines the group\nM\n=\nF\n/\nF\n′\n′\nM = F/F''\nM\n=\nF\n/\nF\n′\n′\n, the free metabelian group on two generators. She proves that the rational group algebra of this group can be embedded in an ordered division ring. As a consequence it is easy to show that\nM\nM\nM\ncontains a copy of the free\nsemigroup\non two generators. Moufang also gives applications of the result to\nnumber theory\n,\nknot theory\nand the foundations of geometry.\nMoufang submitted her habilitation thesis in the summer of\n1936\nand\nhabilitated\non\n9\nFebruary\n1937\n, being only the third German woman to habilitate in mathematics. However, the Nazis, to be precise Hitler's minister of education, refused Moufang permission to teach\n(\nbecause she was a woman\n)\n, so from\n1937\nshe became an industrial mathematician working on elasticity theory. In fact this gives Moufang the unique position of being the first German woman with a doctorate to be employed in industry. She may actually be the first ever such woman anywhere. Bhama Srinivasan writes in\n[\n5\n]\nthat, following her habilitation:-\n... the logical course of events would then have been for her to become a Privatdozent. However, in March\n1938\nshe received a letter from the Minister of Education informing her that the policies of the Third Reich required a professor to be a \"leader\" of the students in more than just the academic sphere; since the student body was almost exclusively male, they did not think it feasible to appoint women professors. They did not, however, have any objection to her holding a job which involved only research. Since there were no permanent positions in universities which consisted of research alone, Moufang left academic life and joined the Krupps Research Institute in Essen where she remained until\n1946\n.\nHer first appointment at the Krupps Research Institute was as a research assistant but in\n1942\nshe was appointed as Head of the Department of Applied Mathematics and Mechanics. At this stage in her career Moufang undertook research on applied mathematics topics, in particular on the theory of elasticity. She published\nDas plastische Verhalten von Rohren unter statischem Innendruck bei verschwindender Längsdehnung im Bereich endlicher Verformungen\nⓉ\n(\nThe plastic behavior of pipes under static pressure at zero elongation in the range of finite deformations\n)\nin\n1941\nwhich is based on a discussion of a stress-strain law of deformation type. Her next paper\nVolumentreue Verzerrungen bei endlichen Formänderungen\nⓉ\n(\nVolume preserving bias in finite deformations\n)\n(1946)\ngeneralised to the finite case the known decomposition in the infinitesimal case of the strain tensor into the strain deviation, giving the change of shape, and a spherical tensor, giving the change of volume. In a\n1947\npaper, which appeared after she left the Krupps Research Institute, she extended the results of this last paper and gave\nrational\napproximations to the irrational intensity of the spherical tensor. A final paper by Moufang on this topic,\nStrenge Berechung der Eigenspannungen, die in plastisch aufgeweiteten Hohlzylindern nach der Entlastung zurückbleiben\nⓉ\n(\nCalculation of residual stresses that remain in plastically widened hollow cylinders after discharge\n)\n, was published in\n1948\nand reviewed by\nWilliam Prager\n:-\nThe paper contains an analysis of the residual stresses in a thick-walled tube which has been plastically deformed by interior pressure. This analysis is based on the strain-hardening law of Schmid and on the assumption of plane strain.\nAfter World War II ended, various German universities wanted to recruit staff who had not been members of a Nazi organisation. In particular the Johann Wolfgang Goethe University in Frankfurt am Main looked to recruit such people and Moufang, having habilitated nine years earlier, was awarded the right to teach there as a\ndocent\nin\n1946\n. She became an extraordinary professor at Frankfurt in\n1951\nand a full professor in\n1957\n, but she published nothing further after the applied mathematics papers which resulted from her research at the Krupps Research Institute except for an obituary of\nMax Dehn\nin\n1954\n(\nwritten in collaboration with\nWilhelm Magnus\n)\n. We note that Moufang holds a unique position here as the first German woman professor of mathematics\n[\n5\n]\n:-\nAlthough she did not publish much in later years she had many Ph.D. students. One can only speculate on what her mathematical output might have been had she not been forced to spend ten years in industry at a productive stage in her career.\nMoufang retired in\n1970\n. She was honoured in\n1965\nwith a special part of volume\n87\nof the\nMathematische Zeitschrift\ndevoted to papers published to celebrate her\n60\nth\nbirthday. In\n2006\na street in Frankfurt was named in her honour and in\n2010\nthe University of Frankfurt set up the Ruth Moufang Fund to support students and scientists from the university.\nLet us end our biography by quoting Bhama Srinivasan\n[\n5\n]\n:-\nMoufang had many intellectual interests besides mathematics. She was very modest about her work; when I contacted her about the possibility of writing this article she replied that she did not feel her work was important enough.",
  "matematicos_citados_na_biografia": [
    "Realgymnasium",
    "Arthur Schönflies",
    "Carl Ludwig Siegel",
    "Ernst Hellinger",
    "Max Dehn",
    "Ludwig Bieberbach",
    "Otto Szász",
    "Paul Epstein",
    "projective geometry",
    "David Hilbert",
    "Szász",
    "Dehn",
    "Hellinger",
    "Epstein",
    "habilitation",
    "Magnus",
    "Hilbert",
    "Euclid",
    "Descartes",
    "Desargues",
    "Pappus",
    "group theory",
    "semigroup",
    "number theory",
    "knot theory",
    "habilitated",
    "rational",
    "William Prager",
    "docent",
    "Wilhelm Magnus"
  ],
  "imagens": [
    "moufang.jpg"
  ]
}