{
  "nome_completo": "Salomon Bochner",
  "nome_curto": "Salomon Bochner",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bochner/",
  "data_nascimento": "20 August 1899",
  "local_nascimento": "Podgorze, near Kraków, Austria-Hungary (now Poland)",
  "data_morte": "2 May 1982",
  "local_morte": "Houston, Texas, USA",
  "summary": "Salomon Bochner was a pure mathematician who was born in what is now Poland and moved to America to escape the Nazis. He worked on integral transforms and distribution theory.",
  "biografia": "Salomon Bochner\n's mother was Rude Haber and his father was Joseph Bochner. It was an orthodox Jewish family with Joseph running a small business and both parents being enthusiastic about education, although they themselves were self educated after leaving school. Both Rude and Joseph read widely, with Rude having a deep knowledge of the plays of Shakespeare and Ibsen while Joseph was a Hebrew scholar. Salomon was the older of his parent's two children having a younger sister Fanny. At school Salomon enjoyed arts subjects, yet excelled at mathematics, but when he was in the middle of his secondary education war broke out.\nOne of the events leading up to World War I was Austria-Hungary making an ultimatum to Serbia in the belief that Russia would be deterred from becoming involved by the threat of German support for Austria. Despite Serbia essentially accepting the ultimatum, Austria-Hungary declared war on Serbia on\n28\nJuly\n1914\n. Russia immediately ordered partial mobilization against Austria-Hungary and two days later ordered full mobilization. The Bochner family, fearing a Russian invasion, fled from their home and settled in Berlin. This move had its advantages and disadvantages. On the down side the family was less well off in Berlin, but after only a few months there Salomon passed the entrance examination to a high quality\nGymnasium\nwhich gave him an outstanding education.\nAfter graduating from the Gymnasium, Bochner entered the University of Berlin in\n1918\n. His PhD, which was supervised by\nSchmidt\n(\nwith assistance from\nSchur\n)\n, was on orthogonal systems of complex analytic functions. He received his doctorate from the University of Berlin on\n13\nJune\n1921\n. However in the early\n1920\ns Germany faced an escalating rate of inflation that was eventually to destroy the German mark. Bochner's family suffered, as did the majority of Germans, and although he fervently wished to pursue an academic career in mathematics, he felt that he had to support his family through the difficult times. He ran a successful import-export business for a few years but success in business did not bring him happiness as he longed to study mathematics. His family, more interested to see him happy than for the financial benefits his business was bringing them, urged him to return to mathematics despite hyperinflation in Germany in\n1923\n. Since\nBergman\nhad been undertaking research on orthogonal systems of analytic functions during the time that Bochner had put his mathematics aside, Bochner decided that he needed to move into a new area.\nIt was in\n1923\nthat\nHarald Bohr\npublished his ideas on almost periodic functions and Bochner read these. He extended the ideas on his own, coming up with some original techniques which impressed\nHarald Bohr\nwho invited him to Copenhagen. In\n1924\n, after the award of an International Education Board fellowship, Bochner travelled to Copenhagen to work with\nHarald Bohr\non almost periodic functions. He was also able to travel to England on the Fellowship where he worked with\nHardy\nin Oxford and\nLittlewood\nin Cambridge. In England he began studying the\nzeta function\nand this, like almost periodic functions, was to be a continuing interest throughout his life.\nBochner lectured at the University of Munich from\n1924\nto\n1933\n, submitting an outstanding\nhabilitation\ndissertation on almost periodic functions in\n1927\n. He developed major results in harmonic analysis\n[\n1\n]\n:-\n... that was perhaps he greatest achievement. The culmination of this work at Munich was the publication in\n1932\nof 'Vorlesungen über Fouriersche Integrale'\nⓉ\n(\nLectures on Fourier integrals\n)\n, an influential book that has become a mathematical classic. Among much else the book contains Bochner's most famous theorem, characterising the\nFourier\n-\nStieltjes\ntransforms of positive measures as positive-definite functions ...\nThis work developed into the theory of distributions, see for example\n[\n3\n]\nfor details. However the period during which Bochner was producing this outstanding work was also one of great personal difficulty.\nThe Mathematics Department at the University of Munich, realising what an outstanding mathematician Bochner was, wished to appoint him as an assistant professor but both the University Senate and the local government raised objections. He was, of course, a foreigner, originally an Austrian who had acquired Polish nationality as a consequence of the peace treaties at the end of World War I. The Senate demanded that he become a member of the Reich, but even then they were only prepared to appoint him as a lecturer, and not as an assistant professor.\nPerron\nheld a mathematics chair at Munich and he argued that the University's reputation was being damaged by what was a political rather than scientific decision. With the assistance of\nCarathéodory\n, also a professor at Munich,\nPerron\ntried to obtain an invitation for Bochner to go to Harvard:-\n... since we could thus have a new means in our hands to make even clearer to the Ministry that Bochner is quite a character and that we make fools of ourselves in front of the scientific world if we put him off life here.\nThe attempt to obtain an invitation for Bochner to Harvard rather backfired, however, since the decision eventually fell to\nG D Birkhoff\n, who was visiting Europe. He wrote on\n7\nJuly\n1928\nthat it would be better:-\n... to get some promising young American, of about equal standing and achievement, to come to us for half a year at a similar salary, ... Bochner's conversation gives me the impression of genuine devotion to his science. He says he is interested in the whole field of analysis. Personally I have heard nothing much of Bochner in Vienna, Budapest, Szeged, Göttingen, or Berlin, which seems to indicate that he is not the man of outstanding promise. It is easy to understand that\nCarathéodory\n's recommendations are slightly tinged by his personal relations to Bochner, and also perhaps by a feeling\n(\nnot rare here\n)\nthat any second rate European youngster is good enough for us.\nPoor Bochner was clearly suffering from\nBirkhoff\n's anti-Semitism which is now well documented, see\n[\n8\n]\n. Certainly at this time\nBirkhoff\nsystematically kept Jews out of his department, and this must be the explanation for the quite ridiculous assessment of Bochner as a \"second rate European youngster\".\nWe have mentioned above what is considered to be Bochner's most important work in Munich, but in fact he worked on a surprising variety of topics while he was there. It is certainly worth mentioning that in a\n1928\npaper on\nRiemann\nsurfaces he used\nZorn\n's lemma, seven years before\nZorn\ndiscovered the result independently. He published a generalisation of the\nLebesgue\nintegral in\n1932\n, which is now known as the Bochner integral. The breadth of his work, however, is best illustrated by the fact that he was also undertaking research in physics at this time and published several papers on X-ray crystallography.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n1\nApril there was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter their university. On\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. As an orthodox Jew, Bochner's position was now impossible and he accepted a position at Princeton in\n1933\n.\nAppointed as an associate in Princeton in\n1933\n, Bochner was promoted to assistant professor in the following year. Every summer he made a trip to Europe to visit his family who were steadily becoming in greater danger from the Nazi anti-Jewish policies. Bochner persuaded them to leave Germany and go to England. By this time his sister Fanny was married and when the family became convinced that life in Germany was impossible and moved to England, Bochner paid for Fanny's children to attend good schools there. On one of his summer trips to Europe Bochner met Naomi Weinberg who was the daughter of the publisher of a New York Jewish newspaper. On\n1\nNovember\n1938\nhe married Naomi with\nJohnny von Neumann\nas his best man. They had one daughter, Deborah. He had become a naturalised citizen of the United States in\n1938\nand, in the following year, he was promoted to associate professor, becoming full professor in\n1946\n. He was appointed as\nHenry Burchard Fine\nProfessor in\n1959\nand held this prestigious chair until he retired in\n1968\n.\nZund\n[\n11\n]\nsummarises his major research contributions in Princeton:-\nBochner's years at Princeton continued to break new ground in startling new directions, including\nfunctional analysis\nand group theory. He collaborated with a number of distinguished mathematicians, perhaps most notably\nJ von Neumann\non a theory of almost periodic functions on a group\n(1935)\n. Bochner found that the\nRiemann\nLocalisation Theorem was not valid for\nFourier\nseries of several variables\n(1935\n-\n1936)\n, which led him indirectly to consider functions of several complex variables\n(1937)\n. He made basic contributions to this theory that included the Bochner-\nMartinelli\nFormula\n(1943)\n, and extensions of\nCauchy\n's integral formula\n(1944)\n. His research was summarised in Several Complex Variables\n(1948)\n, written with W T Martin, which was the first American book on the subject.\nAgain showing wide interests, Bochner worked on the\ntheory of probability\n. His major book on this topic is\nHarmonic Analysis and the Theory of Probability\n(1955)\n. He also published papers on the gamma function, the zeta function and partial differential equations. In the\n1960\n's he worked on the history and philosophy of mathematics. One of his most interesting works on this topic is\nThe Role of Mathematics in the Rise of Science\n(1966)\n. His interests in the philosophy of mathematics led to his becoming one of the editors of the five volume work\nDictionary of the History of Ideas\n(1973\n-\n74)\n. He was the only member of the editorial team with a scientific background.\nAlthough he was seventy years old when he retired from Princeton, Bochner was appointed as Edgar Odell Lovett Professor of Mathematics at Rice University and went on to hold this chair until his death in\n1982\n. He became Head of Department at Rice in\n1969\nand held this position until\n1976\n. Gunning\n[\n1\n]\nwrites:-\nHe was as influential at Rice as he had been at Princeton, if not more so ... In addition to teaching mathematics he participated in the history of science program, was responsible for the foundation of an interdisciplinary institute for the history of ideas, and gave university-wide public lectures on the history of science.\nBochner received many honours for his outstanding contributions. He was elected to the\nNational Academy of Sciences\nin\n1950\n. He was\nAmerican Mathematical Society\nColloquium lecturer in\n1956\n, was vice-President of the\nAmerican Mathematical Society\nin\n1957\n-\n58\nand was awarded the Society's Leroy P Steele Prize in\n1979\n.\nZund writes\n[\n11\n]\n:-\nBochner was a personable individual who had an intense curiosity and seemingly boundless energy.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Schmidt",
    "Schur",
    "Bergman",
    "Harald Bohr",
    "Hardy",
    "Littlewood",
    "zeta function",
    "habilitation",
    "Fourier",
    "Stieltjes",
    "Perron",
    "Carathéodory",
    "G D Birkhoff",
    "Birkhoff",
    "Riemann",
    "Zorn",
    "Lebesgue",
    "Johnny von Neumann",
    "Henry Burchard Fine",
    "functional analysis",
    "J von Neumann",
    "Martinelli",
    "Cauchy",
    "theory of probability",
    "National Academy of Sciences",
    "American Mathematical Society"
  ],
  "imagens": [
    "bochner.jpg"
  ]
}