{
  "nome_completo": "Samuel Beatty",
  "nome_curto": "Samuel Beatty",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beatty/",
  "data_nascimento": "21 August 1881",
  "local_nascimento": "Owen Sound, Ontario, Canada",
  "data_morte": "3 July 1970",
  "local_morte": "Toronto, Canada",
  "summary": "Samuel Beatty was a Canadian mathematician who was the first person to receive a PhD in mathematics from a Canadian university.",
  "biografia": "Samuel Beatty\nentered the University of Toronto in\n1903\nas an undergraduate. He was to spend the rest of his life studying there and working for the University. After obtaining his undergraduate degree from Toronto, Beatty went on the undertake research for a Ph.D. under\nFields\n's supervision. When Beatty was awarded a doctorate in\n1915\nhe became the first to obtain such a degree from a Canadian university. In fact Beatty was the only student who Fields supervised for a doctorate.\nBeatty was appointed as a Lecturer at the University of Toronto after studying for his doctorate. When he was appointed, Alfred Baker was his Head of the Mathematics Department, but in\n1918\nBaker retired and A T DeLury, who had taught Beatty when he was an undergraduate, became Head. Beatty was promoted to Professor, then in\n1934\nbecame Head of the Mathematics Department. In\n1936\n, in addition to his role has Head of the Mathematics Department, he was appointed Dean of the Faculty of Arts and, three years later became a founding member of the Committee of Teaching Staff. He retired from the role of Dean in\n1952\nand in the following year was elected Chancellor of the University. He held this position until\n1959\n. First let us quote an episode relating to his time as Dean:-\nDean Beatty is remembered for the enormous support he gave to his students, and he earned their deepest appreciation as a result. One of his students, Walter Kohn, who won the\n1998\nNobel Prize in Chemistry for his development of the density-functional theory, expressed heartfelt appreciation to the Dean who in\n1942\nhelped Kohn to enrol in the Mathematics Department at the University. Kohn, a young chemist of enormous potential, could not gain access to the chemistry buildings during the war because of his German nationality, and Dean Beatty was instrumental in helping him to continue his studies.\nBeatty did not publish a large number of research articles. We give a few examples:\nDerivation of the Complementary Theorem from the Riemann-Roch Theorem\n(1917)\n,\n(\nwith Muriel Wales\n)\nTheory of algebraic functions based on the use of cycles\n(1944)\n,\nOn the minimum value of the Riemann-Roch expression for order-bases in the large\n(1948)\n,\nOn the number of conditions to apply to a function\nR\n(\nZ\n,\nU\n)\nR(Z, U)\nR\n(\nZ\n,\nU\n)\nto build it on an assigned local order-basis t\n(1948)\n,\n(\nwith N D Lane\n)\nA symmetric proof of the Riemann-Roch theorem, and a new form of the unit theorem\n(1952)\n,\nUpper and lower estimates for the area of a triangle\n(1954)\n, and\nDifference methods in the theory of local order bases and their equivalent normalized function bases\n(1956)\n. His most famous mathematical idea, however, appeared in a problem he set in the\nAmerican Mathematical Monthly\nin\n1926\n. We explain what Beatty did.\nLet\nR\nR\nR\nbe an irrational number greater than\n1\nand let\nS\nS\nS\nbe defined by\n1\nR\n+\n1\nS\n=\n1\n\\Large\\frac{1}{R}\\normalsize  + \\Large\\frac{1}{S}\\normalsize   = 1\nR\n1\n​\n+\nS\n1\n​\n=\n1\n. Define two sequences\n[\nn\nR\n]\n[nR]\n[\nn\nR\n]\nand\n[\nn\nS\n]\n[nS]\n[\nn\nS\n]\nwhere\nn\nn\nn\nruns through the natural numbers and, for any real number\nx\nx\nx\n,\n[\nx\n]\n[x]\n[\nx\n]\ndenotes the greatest integer less than or equal to\nx\nx\nx\n. The two sequences are called 'Beatty sequences' and have the property that every natural number appears in one and only one of the two sequences. For example taking\nR\n=\n5\nπ\nR = \\Large\\frac{5}{\\pi}\\normalsize\nR\n=\nπ\n5\n​\ngives the sequences\n1\n,\n3\n,\n4\n,\n6\n,\n7\n,\n9\n,\n11\n,\n12\n,\n14\n,\n15\n,\n17\n,\n19\n,\n20\n,\n22\n,\n23\n,\n25\n,\n27\n,\n28\n,\n30\n,\n31\n, ...\n2\n,\n5\n,\n8\n,\n10\n,\n13\n,\n16\n,\n18\n,\n21\n,\n24\n,\n26\n,\n29\n,\n32\n,\n34\n,\n37\n,\n40\n,\n43\n,\n45\n,\n48\n,\n51\n,\n53\n, ...\nR =\n6\n/π gives the sequences\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n11\n,\n13\n,\n15\n,\n17\n,\n19\n,\n21\n,\n22\n,\n24\n,\n26\n,\n28\n,\n30\n,\n32\n,\n34\n,\n36\n,\n38\n, ...\n2\n,\n4\n,\n6\n,\n8\n,\n10\n,\n12\n,\n14\n,\n16\n,\n18\n,\n20\n,\n23\n,\n25\n,\n27\n,\n29\n,\n31\n,\n33\n,\n35\n,\n37\n,\n39\n,\n41\n, ...\nwhile R =\n7\n/π gives the sequences\n2\n,\n4\n,\n6\n,\n8\n,\n11\n,\n13\n,\n15\n,\n17\n,\n20\n,\n22\n,\n24\n,\n26\n,\n28\n,\n31\n,\n33\n,\n35\n,\n37\n,\n40\n,\n42\n,\n44\n, ...\n1\n,\n3\n,\n5\n,\n7\n,\n9\n,\n10\n,\n12\n,\n14\n,\n16\n,\n18\n,\n19\n,\n21\n,\n23\n,\n25\n,\n27\n,\n29\n,\n30\n,\n32\n,\n34\n,\n36\n, ...\nReferences to paper investigating Beatty sequences appear in\n[\n2\n]\n.\nG de B Robinson\n, the author of\n[\n1\n]\n, was a student at Toronto and was taught by Beatty. He writes:-\nBeatty went on sabbatical leave in\n1926\n-\n27\nto Wales, attracted by\nW H Young\n, so his course on Complex Variables was given by DeLury. Not till\n1929\n-\n30\ndid I hear Beatty expound the theory of Algebraic Functions based on the\nLagrange\nInterpolation Formula which had been his life work. Perhaps Beatty's greatest contribution to mathematics in Canada was his bringing\nBrauer\nand\nCoxeter\nto the Department in\n1935\n-\n36\n.\nThe\nCanadian Mathematical Society\nwas founded in June\n1945\nas the\nCanadian Mathematical Congress\n. Of all the founding members, Beatty was perhaps the most determined to improve the level of mathematical achievement in Canada through the setting up of such a mathematical society. Beatty was elected as the first President of the Society. The first meeting recorded that the aim of:-\n...this congress\n[\nwill\n]\nbe the beginning of important mathematical development in Canada.\nBeatty remained President until\n1952\n, but was honoured with re-elected for a second three year term in\n1956\n-\n59\n.\nAnother venture led by Beatty was organising a series of\nMathematical Expositions\nto be produced by the Department. He wrote the following as a Preface to an early volume which shows his thinking behind the series:-\nThere are many books dealing in an individual way with elementary aspects of Algebra, Geometry, or Analysis. In recent years various advanced topics have been treated exhaustively, but there is a need in English of books which emphasise fundamental principles while presenting the material in a less elaborate manner. A series of books, published under the auspices of the University of Toronto and bearing the title 'Mathematical Expositions', represents an attempt to meet this need. It will be the first concern of each author to take into account the natural background of his subject and to present it in a readable manner.\nAfter he retired as Head of the Mathematics Department and Dean of the Faculty of Arts and Science in\n1952\nthe Samuel Beatty Fund was set up by his friends and former students. Its aim was to:-\n... support mathematics education in the province of Ontario through grants, scholarships, and awards.\nG de B Robinson\n, ends his tribute\n[\n1\n]\nwith these words:-\n... in each role he accomplished great things and won the respect and affection of all who knew him.",
  "matematicos_citados_na_biografia": [
    "Fields",
    "G de B Robinson",
    "W H Young",
    "Lagrange",
    "Brauer",
    "Coxeter",
    "Canadian Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}