{
  "nome_completo": "Satyendranath Bose",
  "nome_curto": "Satyendranath Bose",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bose/",
  "data_nascimento": "1 January 1894",
  "local_nascimento": "Calcutta, (now Kolkata) India",
  "data_morte": "4 February 1974",
  "local_morte": "Calcutta, (now Kolkata) India",
  "summary": "Satyendranath Bose was an Indian mathematician who did important work in statistical mechanics.",
  "biografia": "Satyendranath Bose\n's mother, Amodini Devi, had received little formal education but she skilfully brought up her large family of seven children. Bose's father was Surendranath Bose who worked for a while as an accountant before joining the East Indian Railways. He later set up his own chemical and pharmaceutical company. Satyendranath was the eldest of Amodini and Surendranath's seven children, having six younger sisters.\nSatyendranath began his education at an elementary school in Calcutta before entering the Hindu School in\n1907\n. It was here that his interest in mathematics and science began, and as is so often the case, it was due to an outstanding mathematics teacher coupled with encouragement from the headmaster.\nHe began his studies at Presidency College, Calcutta, in\n1909\nwhere he had a brilliant academic record. He was awarded a B.Sc. in\n1913\nand an M.Sc. in\n1915\nproving himself to be by far the best student of mathematics. In the year he was awarded his Master's degree, Bose married Ushabala Ghosh. They had five children, three daughters and two sons.\nHad Indians been allowed to take administrative posts in the government service, Bose would almost certainly have followed that route. As it was, he continued to study physics and mathematics and was appointed to the newly opened University College of Science in Calcutta in\n1917\n. This university was a research institution for postgraduate studies and here Bose was able to study recent European texts on\nquantum theory\nand relativity which, before the opening of the new institution, had not been readily available in India.\nGibbs\nbook on\nstatistical mechanics\nstimulated Bose's interest in this topic. He also studied\nEinstein\n's papers on relativity and obtained\nEinstein\n's permission to translate them for publication in India.\nBose was appointed as a Reader in physics at the University of Dacca in\n1921\nand taught there until\n1945\n, being a professor and head of the physics department from\n1927\n. In\n1945\nhe returned to Calcutta University when he was appointed as Guprasad Sing Professor of Physics, a position he held until he retired in\n1956\nwhen he was made Professor Emeritus.\nHe did important work in quantum theory, in particular on\nPlanck\n's black body radiation law. Bose sent his paper\nPlanck's Law and the Hypothesis of Light Quanta\n(1924)\nto\nEinstein\n. He wrote a covering letter saying:-\nRespected Sir, I have ventured to send you the accompanying article for your perusal and opinion. You will see that I have tried to deduce the coefficient .. in\nPlanck\n's law independent of classical electrodynamics.\nThis paper was only four pages long but it was highly significant. The derivation of\nPlanck\n's formula had not been to\nPlanck\n's satisfaction, and\nEinstein\ntoo was unhappy with it. Bose was able to derive the formula for radiation from\nBoltzmann\n's statistics. The paper, and his method of deriving\nPlanck\n's radiation formula, was enthusiastically endorsed by\nEinstein\nwho saw at once that Bose had removed a major objection against light quanta. The paper was translated into German by\nEinstein\nand submitted with a strong recommendation to the\nZeitschrift für Physik\n.\nEinstein\nextended Bose's treatment to material particles whose number is conserved and published several papers on this extension.\nAn important consequence of\nEinstein\n's response to Bose's article was that his application to the University of Dacca for two years research leave beginning in\n1924\nwas approved. He now had the chance of meeting European scientists and travelled first to Paris where he met Langevin and\nde Broglie\n. In October\n1925\nBose travelled from Paris to Berlin where he met\nEinstein\n. Much progress had been made by\nEinstein\nfollowing his receipt of Bose's paper for he was able to see how the ideas could be taken forward. While he was in Berlin Bose attended a course on quantum theory given by\nBorn\n.\nBose published on statistical mechanics leading to the\nEinstein\n-Bose statistics.\nDirac\ncoined the term\nboson\nfor particles obeying these statistics. Through these terms his name is rightly known and remembered, for indeed his contributions are remarkable, especially given the fact that he made his important discoveries working in isolation from the mainstream developments in Europe.\nIt was not only for his research contributions that Bose is important, however, for his efforts to improve education in India led to a much greater use of technology. He gave leadership in many ways: as president of the physics section of the Indian Science Congress in\n1939\n, as general president of the Indian Science Congress in Delhi in\n1944\n, and as president of the National Institute of Science of India in\n1949\n. His greatest honour was election to the\nRoyal Society of London\nin\n1958\n.\nAfter Bose retired from Calcutta University in\n1956\nhe was appointed as vice-chancellor of Viswa-Bharati University, Santiniketan. Two years later he was honoured with the post of national professor.\nP T Landsberg writes\n[\n3\n]\n:-\nThe high regard with which\n[\nBose\n]\nwas held in India can hardly be appreciated in the West, where respect for old age is much less developed than it is in India. Bose's shock of white hair and friendly personality was probably last in evidence ant a public function in January of this year, when an international symposium on statistical physics was held in Calcutta. Special references were made to his famous paper, and Bose himself also addressed the meeting, asking his colleagues to keep afresh \"that wonderful spark\" which gave fulfilment to scientific work.",
  "matematicos_citados_na_biografia": [
    "quantum theory",
    "Gibbs",
    "statistical mechanics",
    "Einstein",
    "Planck",
    "Boltzmann",
    "de Broglie",
    "Born",
    "Dirac",
    "Royal Society of London"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}