{
  "nome_completo": "Leslie Saunders Mac Lane",
  "nome_curto": "Saunders Mac Lane",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacLane/",
  "data_nascimento": "4 August 1909",
  "local_nascimento": "Norwich, Connecticut, USA",
  "data_morte": "14 April 2005",
  "local_morte": "San Francisco, California, USA",
  "summary": "Saunders Mac Lane was an American mathematician who worked in cohomology and category theory, but who is best known for the algebra book he wrote with Garrett Birkhoff.",
  "biografia": "Saunders Mac Lane\ncame from a Scottish family who fled from Scotland after the Battle of Culloden in\n1746\n. His grandfather, William Ward McLane was born in Lewisville, Pennsylvania in\n1846\n, became a Presbyterian Minister but was forced to leave the Church after preaching the theory of evolution. He became a pastor in the Congregational Church and the eldest son from his second marriage, Donald Bradford McLane, was born\n19\nJanuary\n1882\nin Steubenville. Donald married Winifred Saunders, the eldest daughter of George Aretas Saunders, in\n1908\n. Winifred was a graduate of Mount Holyoke College and taught English, Latin and Mathematics at High School before her marriage. After his marriage, Donald became a Congregational Minister in Taftville, Connecticut and his eldest son Leslie Saunders MacLane, the subject of this biography, was born in Norwich, close to Taftville. When he was only one month old his parents decided they did not like the name Leslie and from that time on he was known as Saunders MacLane. The change from MacLane to Mac Lane only came about many years later after his marriage. Saunders had two brothers, Gerald R MacLane, who became a mathematics professor at Rice University and Purdue University, and David Tyler MacLane, born\n20\nJanuary\n1922\n, in Utica, New York, who became a school teacher and businessman. Mac Lane's early years were spent in several different small towns but he did live in one large city, spending a few years in Boston when aged around seven.\nMac Lane's High School education began in Utica, New York but was interrupted in\n1924\nwhen he was\n14\nyears old for, at that time, his father died. After his father's death, Mac Lane moved to Leominster, Massachusetts, to live with his grandfather who, as we noted above, was also a Congregational Minister. Saunders graduated in\n1926\nfrom high school and, in that year, he entered Yale University. It had been his half-uncle, John Fisher MacLane\n(\nborn\n1878)\n, who had visited him and explained that he and several of his relations had gone to Yale University. He offered to provide Mac Lane with sufficient funds to cover his expenses at Yale but he expected Mac Lane to train for a career in either business or law. Mac Lane's grandfather, William Ward McLane, died on\n14\nJune\n1931\na year after Mac Lane graduated from Yale.\nIn the autumn of\n1926\n, Mac Lane began his studies at Yale but at this time his aim was to specialise in chemistry\n[\n3\n]\n:-\nI took both an honours course in chemistry and the standard freshman mathematics course. I found the chemistry rather dull. I didn't enjoy laboratory work. I had a wonderful teacher in the freshman mathematics course, an instructor working for his Ph.D., named Lester Hill. He gave me lots of encouragement and said, \"Mac Lane, why don't you take the Barge Prize examination?\" They gave that examination to freshmen every year. So I took the examination, succeeded in winning the prize, and decided that maybe mathematics was a better field than chemistry.\nHowever, he did not take only mathematics courses but, in his second year, he took an accounting course, feeling that he should do that since his uncle was financing his studies. Within weeks he was completely bored by accounting and, after one of his classmates said how much he was enjoying physics, Mac Lane went on to major in both mathematics and physics. He graduated from Yale in\n1930\nand took up a fellowship at Chicago. At the University of Chicago he was influenced by\nEliakim Moore\nbut his first year there,\n1930\n-\n31\n, was\n[\n33\n]\n:-\n... a vaguely disappointing year of graduate study.\nBy this time\nE H Moore\nwas nearly seventy years old but his advice to Mac Lane to study for a doctorate at Göttingen in Germany certainly persuaded Mac Lane to work at the foremost mathematical research centre in the world at that time. Of course\nMoore\nhad himself studied in Germany as a young man and had created in Chicago an eminent research school of mathematics based on his experiences of German mathematics at that time.\nMac Lane went to Göttingen in\n1931\n[\n33\n]\n:-\nHilbert\nhad retired from his professorship, but still lectured once a week on \"Introduction to Philosophy on the Basis of Modern Science\". His successor,\nHermann Weyl\n, lectured widely on\ndifferential geometry\n,\nalgebraic topology\nand on the philosophy of mathematics\n(\non which I wrote up lecture notes\n)\n. From his seminar on group representations, I learned much\n(\ne.g., on the use of linear transformations\n)\n, but I failed to listen to his urging that algebraists should study the structure of\nLie algebras\n. I also was not convinced by his assertion that set theory involved too much \"sand\".\nEdmund Landau\n(\nprofessor since\n1909)\nlectured to large audiences with his accustomed polished clarity - and with assistants to wash off used\n(\nrolling\n)\nblackboards.\nRichard Courant\n, administrative head of the Institute, lectured and managed the many assistants working on the manuscript of the\nCourant\n-\nHilbert\nbook.\nGustav Herglotz\ndelivered eloquently his insightful lectures on a wide variety of topics:\nLie\ngroups, mechanics, geometrical optics, functions with a positive real part.\nFelix Bernstein\ntaught statistics, but left in December\n1932\nbefore the deluge struck. These were then the 'ordentliche' professors in Göttingen.\nHowever, political events would soon disrupt Göttingen. Mac Lane began to work for his doctorate under\nPaul Bernays\n' supervision but in\n1933\nthe Nazis came to power. They began to remove the top mathematicians from Göttingen, and other universities, who had Jewish connections. Mac Lane wrote to his mother on\n3\nMay\n1933\n(\nsee\n[\n33\n]\n)\n:-\nSo many professors and instructors have been fired or have left that the mathematics department is pretty thoroughly emasculated. It is rather hard on mathematics, and we have but the cold comfort that it is the best thing for the Volk.\nMac Lane had seen that he had to work quickly for his doctorate and leave Germany as soon as possible before things deteriorated further. He defended his thesis\nAbbreviated Proofs in the Logical Calculus\n, with\nWeyl\nas examiner, on\n19\nJuly\n1933\n. At the end of his thesis he thanked his advisor\nPaul Bernays\n\"for his criticism\", \"and most of all Professor\nHermann Weyl\nfor his advice and for the inspiration of his lectures\". Mac Lane was rather disappointed to learn that\nWeyl\nhad only rated his thesis \"sufficient\". A couple of days after getting his degree, he married Dorothy Jones whom he had met in Chicago and who had joined him in Göttingen\n(\nin fact she had typed his thesis\n)\n. It was a small ceremony followed by a wedding dinner with a couple of friends in the Rathaus Keller. The newly married couple quickly returned to the United States. The article\n[\n33\n]\nby Mac Lane gives an interesting account of the events at Göttingen in\n1933\n.\nOn returning to the United States, Mac Lane spent the session\n1933\n-\n34\nat Yale while he tried to get a university position for the following year. He went to the\nAmerican Mathematical Society\nmeeting in December\n1933\nand talked with\nGeorge Birkhoff\n,\nMarshall Stone\nand\nJoseph Ritt\nabout possible positions. A couple of weeks after this he received a letter from Harvard offering him an appointment for a year as\nBenjamin Peirce\nInstructor. He was also asked to give an advanced course. He gladly accepted. Up to this time he had worked on mathematical logic but that was not a topic that was attractive to those making appointments to mathematics departments. Offered the option of giving the advanced course at Harvard on logic or algebra, he opted for algebra and he began to move in that direction. He spent two years at Harvard and left to take up a post of instructor at Cornell for session\n1936\n-\n37\n. He spent the following session back at Chicago, working in algebra and getting much help from\nAdrian Albert\n, before accepting an appointment as an assistant professor at Harvard which he took up in\n1938\n.\nIt was during the years at Harvard\n(1938\n-\n47)\nthat he wrote his famous text\nA survey of modern algebra\nwith\nGarrett Birkhoff\nwhich was published in\n1941\n.\nKaplansky\nwrites in\n[\n24\n]\nabout this text:-\n\"A Survey of Modern Algebra\" opened to American undergraduates what had until then been largely reserved for mathematicians in\nvan der Waerden\n's \"Moderne Algebra\", published a decade earlier. The impact of\nBirkhoff\nand Mac Lane on the content and teaching of algebra in colleges and universities was immediate and long sustained. What we recognise in undergraduate courses in algebra today took much of its start with the abstract algebra which they made both accessible and attractive.\nFurther information about this famous text including details of how it came to be written are given at\nTHIS LINK\n.\nDuring World War II Mac Lane worked in the Applied Mathematics Group at Columbia\n[\n3\n]\n:-\nWe were doing some immediately practical problems of calculating curves for fire control and such. It was elementary differential equations and I learned to understand more about them. But the work at Columbia was not in really profitable directions of applied mathematical research. Also it was partly administrative and I decided that I didn't especially like administration. I remember making a conscious decision at that time: if you want to go into business and make that your career, now is the time to do it. I didn't. I went back to Harvard, happy to go back to mathematics.\nThen in\n1947\nhe was appointed professor of mathematics at Chicago. The research centre there had\nMarshall Stone\n,\nAbraham Albert\n,\nIrving Kaplansky\n, Otto Schilling and\nAndré Weil\non the staff and was led by\nStone\n. In\n1952\n, five years after being appointed, Mac Lane took over the chairmanship of the department from\nStone\nwho stepped down as chairmen but remained on the staff for another sixteen years. Wojciech Komornicki attended Mac Lane's algebra course in\n1968\n-\n69\nand describes the experience in\n[\n27\n]\n:-\n... it was nothing like any mathematics course I had ever taken. Though teaching from his own book, it seemed that Mac Lane would go out of his way to present the material differently than what was in the text. Sometimes he would give more than one proof of the same theorem. He made sure that we were aware of this, explaining that the more ways we understood something the better our understanding. Though I once again saw the same definition of a group that I remembered from my NSF program, I heard that a group was a category with one object in which all the arrows were invertible. The product of two groups was a universal object. I remember struggling with these new concepts especially since Mac Lane's style was to give us the big picture leaving most, but not all, of the details to the book and to the problems he assigned. However, the understanding of the mathematics was paramount in Mac Lane's presentations. If he thought that someone did not understand a proof, he would provide an alternative proof. And there was never any hint that a concept or a proof was too complex for someone to understand. Another aspect of his teaching that struck me was that he never came to class with notes. He would every once in a while pull out an index card on which I assume he had the subject matter of the day's class, look at it, put it back in his shirt or jacket pocket and continue the lecture. Though his lectures were meticulous in presenting the global picture of what we were learning he took great care to answer questions. No question was too small and he never blew off a question nor showed any irritation by student asking questions.\nMac Lane's work covered a wide range of mathematics. He worked on and off throughout his career on mathematical logic, no surprise for a student of Bernays, and he did some early work on planar graphs. He studied valuations and their extensions to polynomial rings. In the\n1940\ns he worked on cohomology and introduced the basic notions of category theory. Peter May, Professor in Mathematics at the University of Chicago, said\n(\nsee\n[\n28\n]\n)\n:-\n[\nIn his research\n]\nhe was extraordinarily perceptive and original, and he was especially strong as a philosopher of mathematics. With\nSammy Eilenberg\nhe created a new way of thinking about mathematics. In a landmark\n1945\npaper, they introduced and named the concepts of 'categories,' 'functors' and 'natural transformations.' The language they introduced there transformed modern mathematics. In fact, a very great deal of mathematics since then would quite literally have been unthinkable without that language.\nMac Lane was the author of seven books:\n(\nwith\nGarrett Birkhoff\n)\nA Survey of Modern Algebra\n(1941)\n;\nHomology\n(1963)\n;\n(\nwith\nGarrett Birkhoff\n)\nAlgebra\n(1967)\n;\nCategories for the Working Mathematician\n(1971)\n;\nMathematics, Form and Function\n(1985)\n;\n(\nwith Ieke Moerdijk\n)\nSheaves in Geometry and Logic: A First Introduction to Topos Theory\n(1992)\n; and\nSaunders Mac Lane: A Mathematical Autobiography\n(2005)\n.\nInformation about\nA Survey of Modern Algebra\nis given at\nTHIS LINK\n.\nInformation about the other six books is given at\nTHIS LINK\n.\nAmong the many prizes and honours Mac Lane received we mention the Chauvenet Prize\n(1941)\n:-\n... for his writing 'Modular Fields' and 'Some Recent Advances in Algebra' ...\nand the Leroy P Steele Prize\n(1986)\n:-\n... for his many contributions to algebra and algebraic topology, and in particular for his pioneering work in homological and categorical algebra.\nHe received the National Medal of Science in\n1989\n:-\nFor revolutionizing the language and content of modern mathematics by his collaboration in the creation and development of the fields of homological algebra and category theory, for outstanding contributions to mathematics education, and for incisive leadership of the mathematical and scientific communities.\nFor his contributions to the\nMathematical Association of America\n, Mac Lane received the Association's Award for Distinguished Service for\n1975\n. He was a Governor of the Association\n(1943\n-\n45)\n, a Vice-President\n(1948\n-\n49)\n, and President for\n1951\n-\n52\n[\n10\n]\n:-\nHis presidency made an enduring impression on those who were active in the Association at that time. He saw the office less as an honour than as an opportunity, attacked the problems of collegiate mathematics with characteristic imagination and energy, and set the Association on the active course that it has followed ever since.\nHe was elected to the\nNational Academy of Sciences\nin\n1949\nand served as its vice-president from\n1973\nto\n1981\n. He was also elected to the American Philosophical Society in\n1949\n, and served as its vice-president from\n1968\nto\n1971\n. He was president of the\nAmerican Mathematical Society\nin\n1973\n-\n74\n[\n10\n]\n:-\nAs President of the\nAmerican Mathematical Society\n, Mac Lane has given that Society the dynamic leadership that one would have anticipated, initiating new activities and vigorously pursuing old ones. Many members of the Society especially valued the openness of his administration and his new lines of communication with the membership. He handled difficult problems with exemplary skill which many of us have enjoyed observing at first hand. His presidency of the Society, like his presidency of the Association, will be remembered with admiration.\nAmong his other honours we note that he was elected an Honorary Fellow of the\nRoyal Society of Edinburgh\nin\n1972\n. He received honorary degrees from many universities including Purdue University, Yale University and the University of Glasgow.\nSaunders and Dorothy Mac Lane had two daughters, Gretchen and Cynthia. Dorothy died in\n1985\nand Mac Lane married the artist Osa Skotting Segal\n(\nwho was divorced from\nIrving Segal\nin\n1977)\nin the following year. Mac Lane's hobbies included skiing, hiking and writing poetry. He would read aloud the works of poets such as Byron, Shelley, Keats and Wordsworth. Osa said\n[\n55\n]\n:-\nAnd so I was reading poetry to him - those same poets - when he was lying there at the end of his life.\nKelly, in\n[\n25\n]\n, writes:-\nNo man could so stimulate others unless, alongside an incisive intellect, he was possessed of enthusiasm and warmth, a deep interest in his fellow man, and a sympathy the more real for being unsentimental. Those who proudly call themselves his friends know these things: others will infer them in reading\n[\nhis works\n]\n.",
  "matematicos_citados_na_biografia": [
    "Eliakim Moore",
    "E H Moore",
    "Moore",
    "Hilbert",
    "Hermann Weyl",
    "differential geometry",
    "algebraic topology",
    "Lie algebras",
    "Edmund Landau",
    "Richard Courant",
    "Courant",
    "Gustav Herglotz",
    "Lie",
    "Felix Bernstein",
    "Paul Bernays",
    "Weyl",
    "American Mathematical Society",
    "George Birkhoff",
    "Marshall Stone",
    "Joseph Ritt",
    "Benjamin Peirce",
    "Adrian Albert",
    "Garrett Birkhoff",
    "Kaplansky",
    "van der Waerden",
    "Birkhoff",
    "THIS LINK",
    "Abraham Albert",
    "Irving Kaplansky",
    "André Weil",
    "Stone",
    "Sammy Eilenberg",
    "Mathematical Association of America",
    "National Academy of Sciences",
    "Royal Society of Edinburgh",
    "Irving Segal"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}