{
  "nome_completo": "Seán Hugh Dineen",
  "nome_curto": "Seán Dineen",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dineen/",
  "data_nascimento": "12 February 1944",
  "local_nascimento": "Cork City, Ireland",
  "data_morte": "18 January 2024",
  "local_morte": "Lucan, Dublin, Ireland",
  "summary": "Seán Dineen was an Irish mathematician who made many contributions to infinite-dimensional complex analysis. He also wrote popular undergraduate texts. He was head of mathematics at University College Dublin for ten years.",
  "biografia": "Seán Dineen\nwas the son of Jeremiah Joseph Dineen\n(1908\n-\n1953)\nand Margaret Jean Connaughton\n(1912\n-\n1999)\n. Jeremiah Dineen was born in Ballingarry, Limerick, Ireland, the son of John Guinane Dineen and Bridget Murphy. He married Margaret Connaughton in Dublin in March\n1943\n. John Hugh Dineen, the subject of this biography known as Seán, was the oldest of his parents six children. His younger siblings were Traolach, Donal, Maura, Eithne and Emer. Jeremiah and Margaret had founded St Mary's College, a secondary school for boys in Clonakilty, on the south coast of Ireland, in\n1938\n. Before they funded the school, there had not been any boys' secondary school in Clonakilty. Jeremiah Dineen taught mathematics, physics and chemistry at the College while Margaret Connaughton taught Irish and Commerce.\nSeán attended the primary school Clonakilty Boys N S where he was in the same class as Donal Hurley. To have two pupils in the same class at a small primary school who both went on to become outstanding mathematicians is unusual. Donal Hurley's secondary education was at Farranferris College, Cork, he then studied at University College Cork before going to the United States where he was awarded a PhD from Yale in\n1970\nfor his thesis\nExistence and properties of class A geodesics on Riemannian manifolds\n. Most of his career was spent at University College Cork; he co-authored the books\nGeometry, Spinors and Applications\n(2000)\nand\nTopics in Differential Geometry; a New Approach Using D-differentiation\n(2002)\n. Dineen and Hurley were taught by Con O'Rourke in their final two years at the Clonakilty primary school. He constantly challenged the boys with problems and it became highly competitive. Seán Dineen explained\n[\n11\n]\n:-\nSixth and seventh class were together in the school. Sixth class used to do algebra, working with polynomials in x. Seventh class, for those who would not go on to secondary school, did geometry and proved theorems. There was one student in that class who got full marks in all subjects in the primary certificate. It was quite competitive there.\nSeán said that Con O'Rourke\n[\n12\n]\n:-\n... had a unique way of teaching mathematics, especially mental arithmetic, which involved solving problems without pen and paper. I found, then and ever since, that once one managed to firmly embed a mathematical idea or problem in the mind, it was effortlessly carried out and insight gradually appeared.\nAfter studying at the Clonakilty primary school, Dineen entered St Mary's College Clonakilty. By this time his father had died but his mother was still running the school. He said\n[\n12\n]\n:-\nIt was quite difficult for my mother to manage six children, be a full-time teacher, and manage a boys' school.\nSeán and his siblings helped out\n[\n12\n]\n:-\nEvery summer, Seán and his siblings would help their mother maintain the school building, formerly an old fever hospital. Painting the school was an annual task, and this hands-on involvement taught the importance of community effort from a young age.\nWhile at this school he began to understand that mathematics was the subject for him\n[\n12\n]\n:-\nI'm not precisely sure when I became interested in mathematics but by the time I was twelve I was interested. The fact that I found mathematics honest and easy helped.\nHis mother realised that the science education they could offer at St Mary's College was not ideal for her bright young son to prepare for study at university so, after he had spent three years at St Mary's College, she arrange for him to become a boarder at the Cistercian College in Roscrea, in central Ireland about\n200\nkm north of Clonakilty. This Roman Catholic College, founded in\n1905\n, had some excellent teachers. In particular, Dineen was taught mathematics by Fr Emmanuel and John Williams who were both talented teachers. In addition to mathematics, John Williams taught Irish and English. Fr Emmanuel, born William Curtis, introduced Dineen to calculus, which he found fascinating and straightforward. Fr Emmanuel\n[\n22\n]\n:-\n... was best with strong pupils, and he ranked Seán as his best ever. He did much for the mathematical community, and was a stalwart of the Irish Mathematics Teachers' Association and the Computers in Education Society of Ireland. For many years he produced solution-books for the Leaving Certificate Mathematics papers, published by Folens for the use of teachers.\nSeán's obituary\n[\n23\n]\nstates:-\nSeán came to Cistercian College Roscrea for the\n1959\n-\n61\nLeaving Certificate cycle from St Mary's College, Clonakilty, the first boys' secondary school there which had been established by his father and mother in\n1938\n. Quietly spoken, he made an immediate impact in the classroom where he gained the deserved respect from his Inter Cert prize winning colleagues, and where he excelled at Mathematics under Fr Emmanuel's vigilant tutelage. He also made his presence felt on the top pitch where his native Cork's hurling skills guaranteed him a permanent position on the Senior Cup team. Sean's clean sweep of Honours in his Leaving Certificate included Commerce - despite never being in the Commerce class!\nAt the Cistercian College Roscrea, Seán also studied applied mathematics taught by Jack Murphy and English taught by Gus Martin. Dineen was awarded his Leaving Certificate in\n1961\nand later that year he entered University College Cork\n(\nUCC\n)\n.\nAt University College Cork he studied mathematics, physics and chemistry in his first year. The head of mathematics was\nPaddy Kennedy\nbut he was away on study leave when Dineen began his studies so he was taught by Siobhán O'Shea. Kennedy came back at Easter and then lectured to Dineen for the final term of that year. Donal Hurley was also taught by\nKennedy\nand described his style in\n[\n13\n]\n:-\nPaddy Kennedy\nwas memorable because of the performance of his lectures. He required that we all wear undergraduate gowns at lectures. I think he was the only academic in UCC who insisted on that. We put on the gowns in the lecture hall before he arrived and took them off again as soon as he departed as we were embarrassed to wear them on the campus. ...\nKennedy\nwas a chain smoker and lit one cigarette from the butt of the one that was just smoked. ... However, the really memorable aspect of his lecturing was his presentation. I still have the notes I took in his course and they are a clear, organised presentation of the introduction to the abstract algebra course. As he lectured, he gave the impression that he was just thinking up the material as he went along; he would stand back, look at the blackboard and reflect for a minute or two and then go and fill the board with his beautiful writing and crystal clear material. He was by far the best lecturer I ever had.\nThe examinations at the end of the first year were to decide who would qualify for honours. Dineen qualified in both mathematics and chemistry but, with mathematics as the subject he wanted to study, it was an easy decision for him to choose mathematics. He still had another choice to make, either to take honours mathematics and statistics, or honours mathematics and mathematical physics. He chose the former option.\nIn addition to the courses he took, Dineen read various books on his own. Advised by\nPaddy Kennedy\n, he took\nGeorg Cantor\n's book\nContributions to the Founding of the Theory of Transfinite Numbers\n(1915)\nout of the library. He also read the books\nThe Taylor Series: An Introduction to the Theory of Functions of a Complex Variable\n(1957)\nby\nPaul Dienes\nand\nAn Introduction to the Theory of Infinite Series\n(1926)\nby\nThomas John I'Anson Bromwich\n.\nAfter his first degree, Dineen remained at UCC during\n1964\n-\n65\nstudying for a Master's Degree. It was a year when, in addition to studying two major mathematics topics, he taught a third year honours course and lectured to\n250\ncommerce students. One of his major topics was real analysis, and he was the only student taking that course. It became a reading course with material from books by Kelly, A E Taylor,\nHalmos\n, and Loomis. He said\n[\n11\n]\n:-\nThey were great books, and still are, but I had no preparation for that level and I struggled with those books all year.\nAt UCC, Dineen made contributions to student life. In\n1962\n-\n63\nhe was one of the founders of the student Mathematical Society. In\n1964\n-\n65\nhe was highly involved in student politics and became the organiser of all the student dances.\nWhile studying for his Master's Degree, he decided that he wanted to go to the United States to undertake research for a doctorate. He applied to Maryland, Syracuse, Princeton and Stanford but made it clear that he would require financial support. Only Maryland and Syracuse offered him a place and a teaching assistantship to fund his studies. With nobody who could advise him as to which to accept for mathematical quality, he chose the University of Maryland since it was bigger, Baltimore had warmer weather and was nearer to the sea.\nArriving in Baltimore too late at night to find accommodation, he was told by a kindly police officer that he could sleep for that night in a police cell. At the university he met the Brazilian student Thomas Aloysius Walsh Dwyer on his first day there. They became close friends and Dwyer, who had studied with\nLeopoldo Nachbin\nat the Instituto Matematica Pura e Aplicada\n(\nIMPA\n)\nin Rio de Janeiro for a Master's Degree\n(\nawarded on\n28\nAugust\n1965)\n, told Dineen of his very positive experiences of working with\nNachbin\n. Dineen was already familiar with\nNachbin\n's books, particularly one on approximation theory and one on the\nHaar\nintegral, which he had greatly enjoyed. He looked at some of\nNachbin\n's research papers and liked those too. Knowing that\nNachbin\nhad a position at Rochester as well as at IMPA, he contacted him and asked if he could transfer to Rochester.\nNachbin\n, however, thought it best if he went to the IMPA in Rio de Janeiro to undertake research advised by him while remaining a student at the University of Maryland with\nJohn Horvath\nas his official advisor. Having spent around two years at the University of Maryland attending courses and reading books and papers, he made his first visit to Rio de Janeiro in\n1967\n.\nWhen Dineen went to a party organised by one of his friends in Baltimore, he met Carol Lee Newbrough, a student studying English and education. Carol\n(1948\n-\n2021)\n, was the daughter of Donley M Newbrough and Doris Frances Baker from Hyattsville, Maryland. Seán and Carol quickly discovered that they both lived in different apartments in the same house and soon became close friends. They were married in December\n1966\n. Although he went to Rio in\n1967\n, he returned to the United States in February\n1968\nwhere Seán and Carol's first child Deirdre was born; the family then returned to Rio. They had a second child, Stephen, born in Ireland a few years later.\nDineen was awarded a Ph.D. by the University of Maryland for his thesis\nHolomorphy types on a Banach space\nwhich he presented in June\n1969\n. In June\n1970\nhe submitted a paper containing a large part of his thesis for publication in\nStudia Mathematica\nand it appeared as\n[\n9\n]\n. Let us note that the thesis gives his name as John Hugh Dineen, while on the paper he gives his name as Seán Dineen. The paper begins as follows:-\nIn discussing tensor products, bilinear mappings and linear mappings on a\nBanach\nspace it has been found useful to distinguish between various sorts of mappings such as the compact, nuclear, integral mappings, etc. Since n-homogeneous polynomials are nothing more than symmetric n-linear mappings, and a holomorphic function on a\nBanach\nspace can be looked upon as a sequence of homogeneous polynomials which satisfy certain conditions, it is not surprising that one can define various subspaces of the space of all holomorphic functions so that the resulting structure is enriched. Such is the case in the\nL Nachbin\nand C Gupta paper \"On Malgrange's theorem for nuclearly entire functions\", where\nMalgrange\n's approximation theorem is generalised from the finite to the infinite-dimensional case. To describe a theory for a large class of subspaces\nNachbin\n, in \"Topology on spaces of holomorphic mappings\", introduced the concept of holomorphy type. Motivated by these two papers, we describe and study in this work various topological vector spaces of holomorphic functions.\nHe ends the paper with the following acknowledgement:-\nThe results in this paper are taken from my doctoral thesis at the University of Maryland,\n1969\n. I wish to thank my thesis advisor, Professor\nLeopoldo Nachbin\n, for introducing me to this subject and for his constant encouragement and guidance at all times. I also wish to thank Professor\nJohn Horvath\nfor his advice and encouragement. I wrote my thesis while on leave of absence from the University of Maryland at the Instituto de Matemática Pura e Aplicada, Rio de Janeiro. During that time I was supported by the Conselho Nacional de Pesquisas of Brazil and the National University of Ireland.\nDineen submitted the paper\n[\n8\n]\non\n14\nSeptember\n1970\nin which he gives an example of a non-compact bounding subset of the space of all bounded sequences with the sup norm topology and studies some consequences. On\n2\nFebruary\n1970\n, Dineen submitted two further papers. The paper\n[\n6\n]\ncontains results from his thesis while the paper\n[\n7\n]\nextends results from his thesis. We note that in\n1970\n-\n72\n, twelve papers by Dineen were published, four of which are written in French.\nDineen was appointed as an Instructor at Johns Hopkins University in Baltimore for the year\n1969\n-\n70\n, but wished to return to Ireland. He said\n[\n11\n]\n:-\nThere were no positions in Ireland. Then I applied for a scholarship at the Dublin Institute for Advanced Study\n(\nDIAS\n)\n, which I got. So I was there for two years,\n1970\n-\n1972\n. In the middle of my first year a job came up in University College Dublin\n(\nUCD\n)\n, which I applied for. The problem was that DIAS wanted a decision for my second year sooner than UCD could confirm the position, so I said to UCD that I had to take the DIAS post for another year. UCD agreed to take my application as if it were for the following year, so I spent another year\n(\nmy second\n)\nat DIAS and then I got the UCD position which I took. I have been there ever since.\nAppointed to University College Dublin in\n1972\n, he was promoted to professor in\n1979\n. The authors of\n[\n12\n]\nwrite:-\nSeán became a professor in\n1979\nand held the Chair in Analysis. The story of his appointment is a colourful one, which he told at his retirement. Suffice to say, the rule 'no canvassing' came shortly afterwards! Seán recalled, \"The whole process took\n3\nmonths, every day going to see people, making a lot of phone calls, and at the same time teaching.\" He even remembered trying to explain his research to a veterinary professor who was giving a horse an injection at the time!\nMathSciNet lists\n129\npublications by Dineen. Of these\n101\nare classified as functional analysis, these having almost\n1600\ncitations. Of these publications there are three books written at the level of graduate students and research mathematicians. He also wrote a number of books at undergraduate level, which approach standard topics in an innovative way.\nFor detailed information about all Dineen's books, see\nTHIS LINK\n.\nDineen has a remarkable record of attending conferences and giving invited lectures abroad. From\n1969\nto\n2015\nhe attended\n209\nsuch events. He also gave\n15\nresearch courses ranging in length from\n3\nto\n15\nlectures, at Universidade Federal Do Rio de Janeiro\n(5\ncourses\n)\n, Coimbra\n(3\ncourses\n)\n, University College Dublin\n(3\ncourses\n)\n, Cork\n(1\ncourse\n)\n, Wuppertal\n(1\ncourse\n)\n, Madrid\n(1\ncourse\n)\nand Kent State\n(1\ncourse\n)\n. The course\nComplex analysis in locally convex spaces\nhe gave at the Universidade Federal Do Rio de Janeiro in the summer of\n1978\nformed the basis for the first book he published in\n1981\n. But he wrote two further non-mathematical books.\nThe Texture of West Cork\n(2020)\nis described by the publisher as follows:-\nThe Texture of West Cork is a profile of the community that is West Cork. Examples and anecdotes involving communication, cooperation, sport, the performing arts, the environment, economics and politics explore what is unique and attractive about this remote part of Ireland. The conclusions are not a surprise but rarely presented in such a lucid and unified fashion.\nHis other non-mathematical book was\nStones in the Wood\n(2016)\n, a collection of short fictional stories set in his native\n20\nth century Clonakilty.\nDineen retired from the University College Dublin in\n2009\nhaving been Head of Mathematics for the previous ten years. His wife Carol died at home on\n22\nApril\n2021\nafter a long illness. On the day his wife died, Seán Dineen received the news that he had a terminal illness. He died at The Hermitage Clinic, Lucan, County Dublin in January\n2024\nbut, following his wishes, was buried in the Darrara Cemetery in Clonakilty, West Cork.\nAmong the honours he received was election to the\nRoyal Irish Academy\nin\n1984\n. He was a founder member of the\nIrish Mathematical Society\nin\n1976\nand was elected as its president in\n1987\n-\n88\nand\n1988\n-\n89\n. He was also a member of the\nAmerican Mathematical Society\nand of the\nEuropean Mathematical Society\n.\nWe learn more of Dineen's interests other than mathematics from\n[\n23\n]\n:-\nWhen Sean took time out from his academic pursuits, he was a keen family man, closely followed Munster Rugby\n(\nof course!\n)\n, was the lynchpin of the local residents' association\n(\nLakelands in Stillorgan\n)\n, and a chronicler of local history and events. He zealously maintained his close links with West Cork - where he was buried ... He was a most enthusiastic supporter of all Cistercian College Roscrea Class of '\n61\nevents - even shrugging aside his medical ailments last September\n(2023)\nin order to attend a lunch in Dublin.\nLet us end by quoting from\n[\n13\n]\n:-\nWhile Seán was renowned for his mathematics across the world, any chat with mathematicians who had visited here inevitably steered towards stories of his driving, or his smoking, or his smoking while driving. He was unfailingly generous though in driving his increasingly apprehensive mathematical visitors to and from the airport. Indeed one who came for his funeral mentioned that Seán had collected and dropped him back to the airport on something like\n17\nvisits. Seán had a flexible interpretation of most rules of the road\n(\nincluding one-way road signs\n)\nand considered several feet out from the footpath a perfectly good place to park. One former student wrote on his passing that \"Seán encouraged and supported my PhD work with wit, deep insight, and friendship. He even loaned me his car on one occasion, my first ever attempt to drive on the left side of the road\n(\nit was not entirely disastrous\n)\n. I recall his advice to me about it: you only need to watch out for what is in front of you. You'll be to the front of other drivers who are behind you or to your side, so no need to worry about them! Logical, a bit irreverent, and a reminder to not take things too seriously. That was just like him.\"",
  "matematicos_citados_na_biografia": [
    "Paddy Kennedy",
    "Kennedy",
    "Georg Cantor",
    "Paul Dienes",
    "Thomas John I'Anson Bromwich",
    "Halmos",
    "Leopoldo Nachbin",
    "Nachbin",
    "Haar",
    "John Horvath",
    "Banach",
    "L Nachbin",
    "Malgrange",
    "THIS LINK",
    "Royal Irish Academy",
    "Irish Mathematical Society",
    "American Mathematical Society",
    "European Mathematical Society"
  ],
  "imagens": [
    "dineen.jpg"
  ]
}