{
  "nome_completo": "Selig Brodetsky",
  "nome_curto": "Selig Brodetsky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brodetsky/",
  "data_nascimento": "10 February 1888",
  "local_nascimento": "Olviopol, Pervomaisk, Russian Empire (now Ukraine)",
  "data_morte": "18 May 1954",
  "local_morte": "London, England",
  "summary": "Selig Brodetsky was educated at Cambridge and Leipzig. He became a lecturer at Bristol and later lecturer and professor at Leeds. He worked on fluid flow with particular emphasis on aerodynamics. He was President of the Hebrew University of Jerusalem for a short time.",
  "biografia": "Selig Brodetsky\n's father was Akiva Brodetsky, a synagogue official, and his mother was Adel Prober. Selig was the second son from a large family of thirteen children. His parents were both Russian Jews and his father, tired of the harassment which the family were suffering in Russia, decided to move to London in\n1893\n. He moved to the East End of London, leaving his wife Adel, Selig, and three other young children in Russia. He managed to earn enough to support his family and he wrote asking them to join him in London.\nTheir journey across Europe was a difficult one described in\n[\n3\n]\n:-\nLittle Selig, then a child of four, retained to the end of his life, a vivid memory of their hiding in a hen-coop till nightfall when a kindly officer in charge of Frontier Forces signalled them out of the darkness that now was the time to cross the frontier. His baby sister started to cry at this critical time but her mother pushed her shawl into the child's mouth and so silenced her.\nIn London Akiva and Adel could not find permanent work and so they made a living from sewing, with the children earning a little to help by packing matches into boxes. In\n1894\n, when Selig was old enough to begin school, he attended the Jew's Free School in Whitechapel, London. From there, having won a scholarship, he went to the Central Foundation School in Cowper Street, central London, in\n1900\n. In\n1902\nhe came top of the list of those winning intermediate scholarships in London. Further success came when he was awarded a scholarship to study mathematics at Trinity College, Cambridge, matriculating in\n1905\n.\nBrodetsky achieved a very fine record at Cambridge. He graduated in\n1908\nbeing placed as bracketed\nSenior Wrangler\n(\nfirst equal\n)\n. This in fact made news in a rather disturbing way since\n[\n1\n]\n:-\nNewspaper editorials noted that if the Aliens Act restricting immigration had been passed earlier the Brodetsky family would have been barred.\nIn\n1910\nBrodetsky was awarded the\nIsaac Newton\nScholarship which enabled him to study at Leipzig for his doctorate.\nThe University of Leipzig awarded Brodetsky a doctorate in\n1913\nfor a thesis on gravitation and he returned to England in\n1914\nwhere he accepted a lectureship in Applied Mathematics at the University of Bristol. On course World War II broke out shortly after this and, in addition to his teaching duties, Brodetsky was assigned as an advisor to a firm making optical equipment, such as periscopes for submarines, for the war. He also collaborated with\nG H Bryan\nof University College, Bangor, on mathematical aeronautics, and some of his later publications on this topic are mentioned below.\nOn\n13\nJanuary\n1919\nBrodetsky married Mania Berenblum. They had two children, a son Paul born in\n1924\nand a daughter Adèle. In\n1919\nBrodetsky accepted a position as a lecturer at the University of Leeds and he was made a Reader in\n1920\n. He was appointed as the first holder of the Chair of Applied Mathematics at Leeds in\n1924\n.\nBrodetsky's work was mainly on aerodynamics and fluid mechanics. His papers include work on the stability of a parachute and fluid flow past circular and elliptic cylinders. He published\nThe mechanical principles of the aeroplane\nin\n1921\n. He also wrote the book\nA first course in nomography\nin\n1920\n. A nomograph was widely used in engineering and in industry. It is a graphic representation that consists of several lines with scales arranged so that by using a straight edge between known values on two lines an unknown value can be read at the intersection with a third line.\nThe\n5\nth\nInternational Congress for Applied Mechanics was held at Cambridge, Massachusetts, in\n1938\nand Brodetsky delivered a paper on the equations of motion of an airplane. He expanded his theory further, publishing a major article\nThe general motion of the aeroplane\nin the\nPhilosophical Transactions of the Royal Society\nin\n1940\n. We list the chapter and section headings of this paper to give an indication of the approach Brodetsky took.\nChapter I.\nLongitudinal Motion without Screw Thrust.\nSections: Equations of motion, coefficients of statical and dynamical stability\nk\n,\nt\nk, t\nk\n,\nt\n; first approximation. The three standard conditions of the symmetrical aeroplane. Longitudinal stability; usual value of\nt\nt\nt\nin standard normal condition. Standard normal condition:\nk\nk\nk\nof zero order, Lanchester's phugoids;\nk\nk\nk\nsmall, extended phugoids;\nk\nk\nk\nnegligible, neutral phugoids; second approximation, Lanchester's phugoids, the loop. Standard diving condition, diving phugoids. Elevator in rotation during motion, flattening out from a dive. Lanchester's phugoids corrected for drag.\nChapter II.\nLongitudinal Motion with Engines in Action.\nSections: Equations of motion, first approximation. Standard normal condition: moderate power, Lanchester's, extended and neutral phugoids, large power, power phugoids, zooming.\nChapter III.\nThree-dimensional Motion.\nSections: Symmetrical aeroplane: equations of motion, first approximation. Standard normal condition;\nk\nk\nk\nof zero order, three-dimensional phugoids, Immelmann turn;\nk\nk\nk\nsmall, extended three-dimensional phugoids;\nk\nk\nk\nnegligible. Standard stalled conditions, the slow spin. Aeroplane with displaced controls, additional moments. Standard normal condition:\nk\nk\nk\nof zero order; small asymmetry, three-dimensional phugoids; large aileron displacement, the slow roll.\nLecturing seems to have been one of Brodetsky's real strengths. His abilities in this area are described in\n[\n3\n]\nas follows:-\nAs a university teacher for students he could hardly be surpassed. Day in, day out, he kept them spell-bound. His subject matter, clarity of exposition, style of delivery, choice of phraseology made an indelible impression on all his listeners whether derived from the Faculties of Arts, Science or Technology. In addition to purely routine standard mathematics, he made mathematical personalities and the history of mathematics live down the centuries by his vivid presentation. ... On one occasion, he gave a lecture on\nSir Isaac Newton\nin a room in the university constructed to seat an audience of\n250\n,\n400\nturned up and were all accommodated, sitting or standing.\nHowever, it is not only for his contributions to mathematics that Brodetsky is well known. His other contributions are described in\n[\n1\n]\n:-\nAlready at Cambridge Brodetsky had established the pattern of dividing his time between academic work and public service, especially but by no means exclusively for the Jewish community and the Zionist movement. While at Leeds he was active in the affairs of the League of Nations Union\n(\nlater the United Nations Association\n)\nand of the Association of University Teachers. In\n1928\nhe became a member of the World Zionist Executive and head of its political department in London. In\n1940\nhe became president of the Board of Deputies of British Jews, the lay head of British Jewry. His election symbolized a democratic revolution, with the communal leadership being taken over from the old-established families by the descendants of the late nineteenth-century immigration. It also demonstrated that Zionism, towards which much of the establishment had been indifferent or hostile, had now the support of the majority of the community, undoubtedly owing to the traumatic events of the Nazi era and the Second World War.\nW P Milne was Head of Mathematics at Leeds until he retired in\n1946\nwhen Brodetsky took on the role. In\n1948\nhe retired from Leeds University and went to Jerusalem to become the President of the Hebrew University there. This, however, proved much more difficult than Brodetsky expected. He thought he was going to take up a position similar to that of Vice-Chancellor of an English university but many in Jerusalem saw the position as essentially an honorary one, like the Chancellor of an English university. Brodetsky was effective in reforming the Hebrew University but at considerable cost in terms of arguments and disputes. This soon had a detrimental effect on his health and after suffering a heart attack he returned to England in\n1951\n. He resigned as President of the Hebrew University in\n1952\nand led a quiet life for his last couple of years in contrast to the hectic lifestyle he had led for most of his life.\nHe died at his home in Cromwell Road. London, and was buried in the Willesden Jewish cemetery, London, on\n20\nMay\n1954\n.",
  "matematicos_citados_na_biografia": [
    "Senior Wrangler",
    "Isaac Newton",
    "G H Bryan",
    "Sir Isaac Newton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}