{
  "nome_completo": "Sergei Vasilovich Fomin",
  "nome_curto": "Sergei Fomin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fomin/",
  "data_nascimento": "9 December 1917",
  "local_nascimento": "Moscow, Russia",
  "data_morte": "17 August 1975",
  "local_morte": "Vladivostok, Russia",
  "summary": "Sergei Fomin was a Russian mathematician who worked in topology and also in dynamical systems and mathematical biology.",
  "biografia": "Sergei Vasilovich Fomin\n's father was a professor of medicine at the University of Moscow. He began his schooling in\n1925\nat the age of seven and he was placed directly into the second form. His early education was much influenced by\nChaplygin\nwho was a friend of the family. While Fomin was still at school\nChaplygin\n, who had spotted his talents at a young age, advised Fomin to attend lectures at Moscow University.\nWhen he was still\n15\nyears old Fomin decided that he did not wish to study at school any longer and that he would enter Moscow University at the age of\n16\n. He had no school certificate but he sat the university entrance examination and passed with very high marks. Despite his age he became a student and his first interest was in abstract algebra.\nIt was not long before Fomin had proved some new results in the theory of infinite\nabelian groups\n, examining conditions for such a\ngroup\nto be the direct product of a periodic\nsubgroup\nand a torsion\nfree\nsubgroup. These results were published in his first paper while he was\n19\nyears old.\nFomin graduated in\n1939\nand began to undertake research at the University of Moscow under\nKolmogorov\n's supervision.\nKolmogorov\nsuggested problems in the theory of\ndynamical systems\nfor Fomin to investigate, but Fomin was also advised by\nAleksandrov\nto look at some problems in\npoint-set topology\nand he also began to work in this area.\nAleksandrov\nand\nUrysohn\nhad made a conjecture in\n1923\nconcerning necessary and sufficient conditions for a\nHausdorff\nspace to be compact and this was not proved until\n1935\nwhen\nM H Stone\ngave an exceedingly complicated proof using\nrepresentation theory\nof\nBoolean algebras\n.\nAleksandrov\nasked Fomin to try to find a simpler proof and he succeeded with this task, the result becoming his second publication which appeared in\n1940\n. The authors of\n[\n1\n]\nand\n[\n2\n]\nwrite:-\nFomin's\ntopological\npapers are not numerous, but they are undoubtedly classical pieces of general topology.\nThe work for his papers in topology was still going on when World War II broke out and Fomin was conscripted into the Red Army. Quite how he managed to continue with his mathematical researches under difficult army conditions is almost impossible to understand, but indeed he did continue to work for his doctorate. In\n1942\nthe Red Army gave him an assignment in Kazan which was rather fortunate. At the beginning of World War II the\nSteklov\nMathematical Institute had been moved from Moscow to Kazan and it remained there until the spring of\n1943\nwhen it was moved back to Moscow. While Fomin was in Kazan in\n1942\nhe managed to arrange with the\nSteklov\nMathematical Institute for him to defend his thesis and he did so brilliantly.\nWhen the war ended Fomin returned to Moscow University and joined\nTikhonov\n's Department. He was awarded his\nhabilitation\nfor a dissertation\nOn dynamical systems with invariant measure\nin\n1951\n. Two years later he was appointed professor.\nIn\n1964\nFomin became professor in the Department of the Theory of Functions and\nFunctional Analysis\nand two years later he was appointed as a professor in the Department of General Control Problems.\nWe have already mentioned Fomin's work on topology. There are several other areas with which he is associated and in which he made major contributions. One of the areas with which he is particularly associated is\nergodic theory\n. He worked on this early in his career while still influenced by\nKolmogorov\n, publishing a number of important papers such as\nOn dynamical systems in a function space\nin\n1950\n.\nFomin wrote a couple of papers with\nGelfand\nand in the first of these, also published in\n1950\n, they apply the theory of infinite dimensional representations of\nLie groups\nto the theory of dynamical systems.\nIn\n1959\nFomin began to look at applications to mathematical biology. Although he continued his work at Moscow University, and his research in other areas of mathematics, he was appointed Head of the Laboratory of Mathematical Methods in Biology in\n1960\n. Within mathematical biology he worked in a number of areas: the excitation in nerve fibres; receptors in the visual system; control of the human motor system; and artificial intelligence and robots. In\n1973\nhe published an important text with M B Berkinblit\nMathematical problems in biology\nwhich included many of his own results in the subject.\nWhile he was carrying out his work in mathematical biology, Fomin was also studying global analysis which he did from\n1966\nuntil his death. The reason for his interest in this subject came from another of his many interests, namely\nquantum physics\n. In this area he examined the theory of differentiable measures in infinite dimensional spaces and the theory of distributions. He worked with a number of collaborators from\n1973\non the writing of a monograph on\nmeasure theory\nand\ndifferential equations\n.\nHalmos\n, who first met Fomin in the spring of\n1965\n, writes:-\nSome of the mathematical interests of Sergei Vasilovich were always close to some of mine\n(\nmeasure and ergodic theory\n)\n; he supervised the translation of a couple of my books into Russian. We had corresponded before we met, and it was a pleasure to shake hands with a man instead of reading a letter. Three or four years later he came to visit me in Hawaii, and it was a pleasure to see him enjoy, in contrast to Moscow, the warm sunshine.\nA number of important texts written by Fomin ran into several editions and have been translated into English. He wrote\nElements of the theory of functions and functional analysis\nin two volumes. The first appeared in\n1954\nand covered metric and normed spaces. The second volume on measure, the\nLebesgue\nintegral and\nHilbert space\nappeared in\n1960\n. A second revised edition, written with\nKolmogorov\n, was published in\n1968\n, a third edition in\n1972\n, and a fourth in\n1976\n. Concerning this text the authors of\n[\n1\n]\nand\n[\n2\n]\nwrite:-\nFomin was a master of mathematical style; he knew how to set out complex mathematical questions simply and explicitly. ... This excellent work is used and will be used for the study of functional analysis by many generations of students.\nFomin's interests outside mathematics are described in\n[\n1\n]\nand\n[\n2\n]\n:-\nFomin was a man of high inner culture. His spirit responded in a lively manner to scientific problems, to artistic events, and to human stories. He loved music, literature, and painting; he drew well, played a good game of tennis, was an excellent skier, and to the end of his life did not cease to take part in sport.\nHe died in Vladivostok while taking part in a Mathematical Summer School there.",
  "matematicos_citados_na_biografia": [
    "Chaplygin",
    "abelian groups",
    "group",
    "subgroup",
    "free",
    "Kolmogorov",
    "dynamical systems",
    "Aleksandrov",
    "point-set topology",
    "Urysohn",
    "Hausdorff",
    "M H Stone",
    "representation theory",
    "Boolean algebras",
    "topological",
    "Steklov",
    "Tikhonov",
    "habilitation",
    "Functional Analysis",
    "ergodic theory",
    "Gelfand",
    "Lie groups",
    "quantum physics",
    "measure theory",
    "differential equations",
    "Halmos",
    "Lebesgue",
    "Hilbert space"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}