{
  "nome_completo": "Serge Mikhalovich Nikolski",
  "nome_curto": "Serge Mikhalovich Nikolski",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nikolskii/",
  "data_nascimento": "30 April 1905",
  "local_nascimento": "Zavod Talitsa, Perm Province, Russian Empire",
  "data_morte": "9 November 2012",
  "local_morte": "Moscow, Russia",
  "summary": "Serge Nikolski was a Russian mathematician who worked in functional analysis and partial differential equations.",
  "biografia": "Perhaps the first comment we should make at the beginning of this biography is to say that we have not made an error in giving\nSerge\nMikha\nlovich Nikolski\n's dates of birth and death above; he really did live to be\n107\nyears old. The second comment is to say that his name appears in various different transliterations, the most common versions of his first name being\nSerge\nand\nSergey\nwhile that of his family name is\nNikol'ski\n,\nNikolski\n,\nNikolski\n, and\nNikolsky\n. We have never seen anything other than\nMikha\nlovich\nfor his patronymic. His place of birth, the small Zavod Talitsa settlement in Perm Province, is now the city of Talitsa in the Sverdlovsk Region. The final comment to make about the data in our heading regards the date of his birth. When he was born in\n1905\nthe Russians were still using the Old Style Julian Calendar. Only on\n31\nJanuary\n1918\ndid the Bolshevik government adopt the Gregorian Calendar which required\n13\ndays to be added. For this reason his date of birth sometimes appears as\n17\nApril\n1905\n(\ncorrect at the time of his birth\n)\nand, at other times,\n30\nApril\n1905\n(\nthe corrected date in the Gregorian Calendar\n)\n.\nSerge\nMikha\nlovich Nikolski\nwas the son of Mikha\nl Dmitrievich Nikolski\nand Lyudmila Mikha\nlovna Fedorova. Mikha\nl Dmitrievich was a forester who had been trained at the St Petersburg Forestry Institute. As well as being an active forester, he also taught forestry at a specialist school. Lyudmila Mikha\nlovna was a teacher in a country school. Serge\nMikha\nlovich was the fourth of his parents' six children and he spent his early years in the region of Poland which had become part of the Russian Empire in\n1795\nwhen its lands were divided between Prussia, the Austrian Empire and the Russian Empire. Soon after Sergei's birth his father began working at the Augustow forest, near the Prussian border, and the young boy began his education in the city of Suwalki. This town was really Polish but formally part of the Russian Empire.\nAt the end of July\n1914\nFrance began mobilizing its troops and, on\n1\nAugust, Germany declared war on Russia, declaring war on France two days later. With the outbreak of war, the Nikolski\nfamily moved to Chernigov\n(\nnow known as Chernihiv in Ukraine\n)\n, where Sergei Mikha\nlovich continued to study at the\ngymnasium\n. In\n1918\n, after the start of the Russian Civil War, the family moved to the Voronezh region in the same year that a forestry department was opened as part of Voronezh Agricultural Institute. Mikha\nl Dmitrievich worked as a forester at the Shipov Forestry Management Enterprise in the Shipov forest near the village of Livenki in the Pavlovsk district.\nAt the age of fourteen Serge\nMikha\nlovich began working as a forester but also had a job as an observer at the Krasnyi Kordon meteorological station, one of around twenty large and well-equipped meteorological stations then existing in Russia. He then worked as an assistant gardener in the nursery of the Livensky state farm. In\n1919\nhe began his studies in Buturlinovka and continued them in Pavlovsk, graduating from the school there in\n1921\n. His father was fond of mathematics and had taught Serge\nthe basic properties of the differential and integral calculus. At this time he read his first mathematical book,\nElements of Mathematical Analysis\nwhich was written in a very intuitive way. By\n1921\nSerge\n's father Mikha\nl Dmitrievich, seeing that his son was a talented mathematician, thought that Serge\nshould become an engineer. Mikha\nl Dmitrievich was murdered, however, in late\n1921\nby bandits who came to the Shipov Forest\n[\n9\n]\n:-\nThere is now a granite monument in the forest at the spot of his murder. The bandits also destroyed the meteorological station, turning it into a pile of glass and metal. It was not reconstructed in its previous distinctive form.\nAfter Mikha\nl Dmitrievich's murder, Serge\n, his siblings and his mother returned to Chernigov where Serge\nworked at the Professional School of the Local Department of Political Education. He studied on his own, taking examinations at the Chernigov technical school without attending classes. He decided in\n1925\nthat he wanted to study higher education, which he could not do in Chernigov, but this was not easy for a young man unless he had the right connections\n[\n9\n]\n:-\nIn\n1925\nNikolski\ndecided to go to another town in order to attend an institute of higher education. But at the time such institutes admitted students only by recommendations from social organisations. He could not get a recommendation to a technical institute. Nikolski\ntried in\n1925\nto enter the Kiev Polytechnical Institute without a recommendation, but he was rejected, not even given an examination. A trade union offered him a recommendation to Ekaterinoslav University, then called the Institute of National Education, and he went there. Thus, Nikolski\nfound himself in Ekaterinoslav\n(\nnow Dnepropetrovsk\n)\n.\nNikolski\n's family were not able to give him financial support so when he arrived in Ekaterinoslav, in addition to full time study, he took a labouring job in a metallurgical factory. At this stage he was still intending to become an engineer as his father had wanted, so his initial plan was to spend a year at Ekaterinoslav University in the Physics and Mathematics Faculty and then transfer to a technical institute. He soon changed his plan, however, when he discovered his deep love of mathematics. A major factor in this was certainly the lectures of Grigory Alekseevich Gruzintsev\n(1881\n-\n1929)\n.\nGrigory Alekseevich was the son of Aleksii Petrovich Gruzintsev, the professor of physics at Kharkov University. He graduated from a gymnasium in\n1898\nand began his studies in the Physics and Mathematics faculty of Kharkov University. He was sent away from the university in\n1901\nand given no right to return. He became acquainted with\nSergi Bernstein\nand attended seminars of such famous mathematicians as\nFelix Klein\n,\nDavid Hilbert\nand\nHermann Minkowski\n. Gruzintsev graduated with an external degree from Kharkov University in\n1908\nand, in\n1910\n, he was appointed as a\ndocent\nat that university\n[\n44\n]\n:-\nNot long before the\n1914\nwar Gruzintsev, then a lecturer at Kharkov University, was sent to Göttingen to complete his education in the sciences. There he attended a seminar of\nHilbert\n. However, the imperialistic war began, and Gruzintsev had to move to Switzerland and then to Italy, where he was at universities during the whole war, and only after the\n1917\nrevolution did he return to Russia, having been appointed to the post of professor at the recently opened Ekaterinoslav University. There he taught courses in mathematical analysis and foundations of geometry. A serious illness\n(\ntuberculosis\n)\ndid not allow him to implement his research ideas in the area of the foundations of mathematics, but the influence on students of his lectures and seminars, which were infrequent because of sickness, was enormous. He died in\n1929\n.\nWe have given quite a few details about Gruzintsev since we believe that he was important in changing Nikolski\nfrom a career in engineering to one in mathematics.\nLet us explain at this point that the city of Ekaterinoslav was renamed Dnipropetrovsk in\n1926\n. The name change followed the Ukrainian War of Independence\n(1917\n-\n1921)\nafter which Ukraine became part of the Soviet Union. The name Dnipropetrovsk was chosen so that the city was named for Grigory Petrovsky, the Communist leader of the country. Ekaterinoslav University was founded in\n1918\n, but renamed Ekaterinoslav Institute of Education in\n1920\n. After the city changed its name, the Institute became Dnipropetrovsk Institute of Education but in\n1933\nit became Dnipropetrovsk State University. Let us, for simplicity, just refer to it as Dnipropetrovsk University.\nNikolski\ngraduated from Dnipropetrovsk University in\n1929\nand began teaching at the University as an assistant professor. He also taught mathematics and physics at a workers' school in Kamenskoe immediately after he graduated. We note that again there were changes of name and Kamianske was renamed Dniprodzerzhynsk in\n1936\nbut, in\n2016\n, it reverted to its original name of Kamianske. In\n1930\nseveral new educational establishments were set up in Dnepropetrovsk, such as the Institute of Railway Transport Engineers and the State Academy of Civil Engineering and Architecture. Nikolski\ntaught mathematics courses at several of these new educational establishments.\nAfter Aleksii Petrovich Gruzintsev died in\n1929\n, Isaak E Ogievetskii was appointed to the chair of mathematics at Dnipropetrovsk. He was very successful obtaining grants from different institutes to allow him to invite leading mathematicians to lecture at Dnipropetrovsk.\nPavel Sergeevich Aleksandrov\n,\nBenjamin Fedorovich Kagan\n,\nIvan Georgievich Petrovsky\nand\nAndrei Nikolaevich Kolmogorov\nmade frequent visits and gave lectures at Dnipropetrovsk.\nKolmogorov\n, who had been appointed a professor at Moscow University in\n1931\n, was very impressed by Nikolski\n's work and began to advise him on writing a Candidate's thesis\n(\nequivalent to a Ph.D.\n)\n.\nNikolski\nmarried Nina Ivanovna Shlepkina\n(20\nAugust\n1910\n-\n23\nJanuary\n1998)\nwho was born in a small town of Kulebaki, which is located on the Oka river and is famous for metallurgical production. She had graduated from the University of Dnipropetrovsk. They had a son Yuri born\n20\nMarch\n1934\n, a son Mikhail born\n12\nOctober\n1941\nwho became a mathematician, and a daughter Natalia born in\n1946\n.\nNikolski\nwas allowed to spend\n1934\n-\n35\nas a graduate student at Moscow State University where he attended lecture courses on functional analysis by\nAbraham Ezechiel Plessner\nand Lazar Aronovich Lyusternik\n(1899\n-\n1981)\n, as well as seminars by\nKolmogorov\nand Igor' Nikolaevich Khlodovskii\n(1903\n-\n1951)\non approximation theory. Nikolski\nsubmitted his Candidate's Thesis\nLinear equations in Banach space\nin\n1935\nand, after defending his thesis, was awarded the degree. He continued teaching at Dnipropetrovsk until late\n1940\nwhen he moved, with his wife and son Yuri, to Moscow. In Moscow he studied for his doctorate\n(\nequivalent in level to the habilitation or D.Sc.\n)\nat the at the Institute of Mathematics, which was later named the\nSteklov\nMathematical Institute of the\nRussian Academy of Sciences\n. In January\n1941\n, he moved with his wife and son to the Ukhtomskaya suburbs of Moscow.\nWorld War II broke out on\n1\nSeptember\n1939\nwhen German troops entered Poland. On\n22\nSeptember, Russian troops entered Poland occupying Bialystok and five days later Warsaw fell to the Germans and, following the Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union, Poland was partitioned between these two powers. The Molotov-Ribbentrop non-aggression pact meant that the initial years of the World War II had little effect on life in Russia and, in particular, none on Nikolski\n. Things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. German armies advanced towards Moscow and Nikolski\nplayed his part in defending the city by working for the Moscow fire brigade and also, along with Alexey Andreevich Lyapunov\n(1911\n-\n1973)\n(\na mathematician working at the\nSteklov\nMathematical Institute\n)\n, helped with constructing anti-tank fortifications in Maloyaroslavets about\n125\nkm south west of Moscow. The German army captured Maloyaroslavets on\n18\nOctober\n1941\n. Nikolski\nwas later awarded the medal \"For the Defence of Moscow\".\nIn late\n1941\nmembers of the\nRussian Academy of Sciences\nin Moscow were evacuated to Kazan where they were housed in Kazan University and Nikolski\nwas one of those evacuated. He defended his doctoral thesis\nOn the theory of the approximation of functions by polynomials\nin January\n1942\n, while in Kazan, before a committee consisting of\nAleksandr Osipovich Gelfond\n, Boris Mikhailovich Gagaev\n(1897\n-\n1975)\nand\nAbraham Ezechiel Plessner\n. Returning to Moscow, he continued to undertake research at the Steklov Mathematical Institute but also worked as Head of the Department of Mathematics at the Moscow Automobile and Road Institute.\nIn\n1947\nNikolski\nwas appointed as a professor at the Moscow Institute of Physics and Technology\n(\nMIPT\n)\n. This Institute was founded on\n25\nNovember\n1946\nas a Department of Moscow State University but enjoyed considerable autonomy within the University. In the summer of\n1951\n, it was closed down as a Department in Moscow State University. Various leading academics immediately attempted to have MIPT re-established and put their case before Stalin. They succeeded in obtaining Stalin's approval and, on\n17\nSeptember\n1951\n, a government decree re-established it as the Moscow Institute of Physics and Technology, a separate Institute not part of Moscow State University. Over the following fifty years, Nikolski\nworked at the Faculty of Mechanics and Mathematics of Moscow State University, at the Steklov Mathematical Institute, and at MIPT.\nIn September\n1954\nthe International Congress of Mathematicians was held in Amsterdam. Nikolski\nwas a plenary speaker delivering the lecture\nEinige Fragen der Approximation von Funktionen durch Polynome\nⓉ\n(\nSome questions on approximation of functions by polynomials.\n)\n.  For an English translation of the Introduction to Nikolski\n's lecture, see\nTHIS LINK\n.\nTo gain an overview of Nikolski\n's mathematical work we quote from\n[\n55\n]\n:-\nThe solutions of many problems in analysis make use either of the fact that certain functions can be represented by means of an integral involving some of its derivatives\n(\nor differences\n)\nor of the fact that its derivatives have an integral representation\n(\nor approximation\n)\ninvolving the original function and an appropriate kernel. The fundamental theorem of the calculus is the prototype of such integral representations. The possibility of obtaining such formulas leads to the study of various function spaces, defined in terms of certain\nHölder\nconditions\n(\nusually called\nLipschitz\nor Besov spaces\n)\nand differentiability conditions, and the relations among them.\nSuch studies have been carried out by many investigators in several countries. The Russian school in this subject, which is now led by Nikolski\n, has been particularly active during the past two decades. Nikolski\n's book 'Approximation of Functions of Several Variables and Imbedding Theorems'\n(\nSpringer-Verlag,\n1975)\npresented the work of his school done prior to the seventies, which involved, mainly, the study of functions defined in all of\nR\nn\n\\mathbb{R}^{n}\nR\nn\n.\nNikolski\nreceived so many different awards and honours for his contributions that we can only list a few here. He was elected a corresponding member of the\nAcademy of Sciences of the USSR\n(1968)\nbecoming a full member in\n1972\n, elected to the\nHungarian Academy of Sciences\n(1976)\n, and elected to the\nPolish Academy of Sciences\n(1980)\n. He was awarded the Stalin Prize for research on approximation theory\n(1952)\n; awarded the\nP L Chebyshev\nPrize of the\nAcademy of Sciences of the USSR\n(1972)\n; awarded the USSR State Prize for the monograph\nIntegral Representations of Functions and Embedding Theory\n(1977)\n; awarded the\nBolzano\nmedal of the\nCzech Academy of Sciences\n(1979)\n; awarded the USSR State Prize for the three-volume textbook\nHigher Mathematics: A Textbook for High Schools\n(\nco-authored with I S Bugrov\n)\n(1987)\n; awarded the\nI M Vinogradov\nGold Medal of the\nRussian Academy of Sciences\nfor a series of works on the theory of approximations of functions\n(1991)\n; awarded the\nCopernicus\nmedal of the\nPolish Academy of Sciences\n(1992)\n; awarded the State Prize of Ukraine in the field of science and technology for the series of scientific papers\n\"Theory of splines and its application in optimizing approximations\"\n(1994)\n; awarded the\nA N Kolmogorov\nPrize of the\nRussian Academy of Sciences\nfor the series of works\n\"Approximation of Functions on Varieties and Their Continuation\"\n(2000)\n, awarded the\nM V Ostrogradski\nPrize from the\nUkrainian Academy of Sciences\n(2000)\n; awarded the Government of the Russian Federation prize for\n\"Advanced mathematical training of engineering physics and physical and technical University's Specialties\"\n(2002)\n; awarded the Moscow State University M V Lomonosov Prize for his outstanding contribution to the development of education\n(2005)\n.\nAs we noted right at the start of this biography, Nikolski\nlived to be\n1907\nyears old. In fact he began teaching at the Moscow Institute of Physics and Technology in\n1947\n, at the age of\n42\n, and taught there until\n1997\n, when he was age\n92\n. When he was asked to tell people what was his secret of long life, he said he could not explain it rationally, particularly since none of his relations were long-lived, none living to over\n75\n. As a young boy he was not very healthy, suffering very painful sore throats. When he was a student he developed polyarthritis. He said he was not a vegetarian but he always had small helpings of food which he took his time eating. He was a smoker in his youth but gave up when he was\n90\nyears old. He was very active throughout his life, enjoyed swimming and rowing, and went skiing every winter. He enjoyed taking long walks every day. Even when he was over\n100\n, he kept up his interests by watching television, reading newspapers and continuing to enjoy mathematics.\nHe died in Moscow and was buried in the Troekurovsky cemetery on\n14\nNovember\n2012\n.",
  "matematicos_citados_na_biografia": [
    "gymnasium",
    "Sergi Bernstein",
    "Felix Klein",
    "David Hilbert",
    "Hermann Minkowski",
    "docent",
    "Hilbert",
    "Pavel Sergeevich Aleksandrov",
    "Benjamin Fedorovich Kagan",
    "Ivan Georgievich Petrovsky",
    "Andrei Nikolaevich Kolmogorov",
    "Kolmogorov",
    "Abraham Ezechiel Plessner",
    "Steklov",
    "Russian Academy of Sciences",
    "Aleksandr Osipovich Gelfond",
    "THIS LINK",
    "Hölder",
    "Lipschitz",
    "Academy of Sciences of the USSR",
    "Hungarian Academy of Sciences",
    "Polish Academy of Sciences",
    "P L Chebyshev",
    "Bolzano",
    "Czech Academy of Sciences",
    "I M Vinogradov",
    "Copernicus",
    "A N Kolmogorov",
    "M V Ostrogradski",
    "Ukrainian Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}