{
  "nome_completo": "Shams al-Din ibn Ashraf Al-Samarqandi",
  "nome_curto": "Shams al-Din al-Samarqandi",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Samarqandi/",
  "data_nascimento": "about 1250",
  "local_nascimento": "Samarkand, Uzbekistan",
  "data_morte": "about 1310",
  "local_morte": null,
  "summary": "Shams al-Samarqandi was an Islamic mathematician who wrote works on theology, logic, philosophy, mathematics and astronomy.",
  "biografia": "Shams al-Din al-Samarqandi\n's full name is Shams al-din Muhammad ibn Ashraf al-Husayni al-Samarqandi.\nNothing is known of al-Samarqandi's life except that he composed his most important works around\n1276\n. He wrote works on theology, logic, philosophy, mathematics and astronomy which have proved important in their own right and also in giving information about the works of other scientists of his period.\nAl-Samarqandi wrote a work\nRisala fi adab al-bahth\nwhich discussed the method of intellectual investigation of reasoning using dialogue. Such methods of enquiry were much used by the ancient Greeks. He also wrote\nSynopsis of astronomy\nand produced a star catalogue for the year\n1276\n-\n77\n.\nIn mathematics al-Samarqandi is famous for a short work of only\n20\npages which discusses\n35\nof\nEuclid\n's propositions. Although a short work, al-Samarqandi consulted widely the works of other Islamic mathematicians before writing it. For example he refers to writings by\nal-Haytham\n, Omar\nKhayyam\n,\nal-Jawhari\n, Nasir al-Din\nal-Tusi\n, and al-Abhari.\nNot only did al-Samarqandi consult the writings of many other mathematicians before writing his short work, in turn several later mathematicians read al-Samarqandi's\n20\npage work and referred to it in their own writings. For example\nQadi Zada\nmentions al-Samarqandi's short work on\nEuclid\n's propositions.",
  "matematicos_citados_na_biografia": [
    "Euclid",
    "al-Haytham",
    "Khayyam",
    "al-Jawhari",
    "al-Tusi",
    "Qadi Zada"
  ],
  "imagens": []
}