{
  "nome_completo": "Sheila May Edmonds",
  "nome_curto": "Sheila Edmonds",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Edmonds/",
  "data_nascimento": "1 April 1916",
  "local_nascimento": "Kingston, Kent, England",
  "data_morte": "2 September 2002",
  "local_morte": "Cambridge, England",
  "summary": "Sheila Edmonds was an English mathematician who worked infinite series and went on to become Vice-Principal of Newnham College, Cambridge.",
  "biografia": "Sheila Edmonds\nwas the only child of Harold Montagu Edmonds\n(\nborn in Camberwell, Surrey about\n1884)\nwho trained as a telephone engineer,  and his wife, Florence Myra Lilley\n(\nborn about\n1887\nin Stapleford, Nottinghamshire\n)\nwho was a teacher.\nAt Wimbledon High School she excelled in mathematics and in\n1935\nshe entered Newnham College, Cambridge, to study that subject. Newnham College had opened in\n1880\n, although it grew from a house for women students which was established in\n1871\nafter two years of planning. Although women could attend classes and take the examinations at the University of Cambridge in Edmonds' time, they could still not graduate with a degree which only became possible in\n1947\n.\nIn Part II of the Mathematical Tripos Edmonds was a\nWrangler\n(\nplaced in the First Class\n)\nand in Part III, which she took in the following year, she received a distinction. She then began to undertake research under\nG H Hardy\nwho, by this time, was nearing the end of his career. While undertaking research she spent a year at Westfield College,London, and another year at the University of Paris. Edmonds' doctoral thesis\nSome multiplication problems\nwas completed in\n1944\n.\nBefore her thesis was complete she had already published a number of papers which would form part of the work of her thesis. Two papers appeared in\n1942\n:\nOn the multiplication of series which are infinite in both directions\nwas published in the\nJournal of the London Mathematical Society\nwhile\nOn the\nParseval\nformulae for\nFourier transforms\nappeared in the\nProceedings of the Cambridge Philosophical Society\n. We should say a little about the mathematics which these papers contain.\nIn the first of these papers Edmonds looks at the doubly infinite series\n∑\na\nn\n\\sum  a_{n}\n∑\na\nn\n​\nwhere the sum is over both positive and negative integers. The series is said to converge if the two series, one defined over the positive integers, the other defined over the negative integers, both converge. In this case the original series is said to have sum\nA\n=\nA\n′\n+\nA\n′\n′\nA = A' + A''\nA\n=\nA\n′\n+\nA\n′\n′\nwhere\nA\n′\nA'\nA\n′\nand\nA\n′\n′\nA''\nA\n′\n′\nare the sums over the positive and negative integers respectively. The product of two such sequences\n∑\na\nn\n\\sum  a_{n}\n∑\na\nn\n​\nand\n∑\nb\nn\n\\sum  b_{n}\n∑\nb\nn\n​\nis defined to be\n∑\nc\nn\n\\sum  c_{n}\n∑\nc\nn\n​\nwhere\nc\nn\n=\n∑\na\nm\nb\nn\n−\nm\nc_{n} = \\sum  a_{m}b_{n-m}\nc\nn\n​\n=\n∑\na\nm\n​\nb\nn\n−\nm\n​\nwhere the sum is again over all integers\nm\nm\nm\n, both positive and negative. Edmonds proves that even when\n∑\na\nn\n\\sum  a_{n}\n∑\na\nn\n​\nconverges and has sum\nA\nA\nA\n,\n∑\nb\nn\n\\sum  b_{n}\n∑\nb\nn\n​\nconverges and has sum\nB\nB\nB\n, and\n∑\nc\nn\n\\sum  c_{n}\n∑\nc\nn\n​\nconverges and has sum\nC\nC\nC\n, the relation\nC\n=\nA\nB\nC = AB\nC\n=\nA\nB\nneed not hold.\nIn the second of the two papers Edmonds looks at conditions under which the integral from\n0\nto ∞ of the product of two functions\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nand\ng\n(\nx\n)\ng(x)\ng\n(\nx\n)\nis equal to the integral from\n0\nto ∞ of the product of the cosine transforms of the two functions\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\nand\ng\n(\nx\n)\ng(x)\ng\n(\nx\n)\n. Similar questions are investigated for the sine transforms rather than the cosine transforms. In a series of papers published over the following years Edmonds examined a whole variety of different conditions on the functions\nf\nf\nf\nand\ng\ng\ng\nwhich give the required equalities.\nIn\n1957\nEdmonds published\nSums of powers of the natural numbers\n. In it she answered a question which arises very naturally. The formula\n∑\nn\n3\n=\n(\n∑\nn\n)\n2\n\\sum  n^{3} = (\\sum  n)^{2}\n∑\nn\n3\n=\n(\n∑\nn\n)\n2\n(\n*\n)\nhas been known for over\n1000\nyears\n(\ncertainly\nal-Karaji\nknew it around\n1000\nAD\n)\n. Edmonds asks if there are any other formulae of this type, in particular what formulae of the form\n∑\nC\nn\np\n=\n(\n∑\nn\nq\n)\n2\n\\sum  Cn^{p} = (\\sum  n^{q})^{2}\n∑\nC\nn\np\n=\n(\n∑\nn\nq\n)\n2\nare possible for\nC\nC\nC\na constant and\np\n,\nq\np, q\np\n,\nq\nnon-negative integers? In\nSums of powers of the natural numbers\nshe showed that\nal-Karaji\n's formula\n(\n*\n)\nis the only one that exists.\nThe demands made on lecturers at Cambridge were great for they had to tutor students in all branches of pure and applied mathematics. Edmonds wished to give this aspect of her job\n100\n% of her effort, so after\n1957\nshe published no further papers. Teaching was a task in which she excelled\n[\n1\n]\n:-\n... conveying in a characteristically understated manner a deep enthusiasm for her particular subject areas. Her patience, thoroughness and encouragement set a generation of women on the path to careers in mathematics and related subjects.\nEdmonds made important contributions in addition to her teaching. She became Vice-Principal of Newnham College, Cambridge, in\n1960\nand she held this post until she retired in\n1981\n. Other positions in which she served included ones in the\nMathematical Association\n, and the Examination Syndicate, as well as serving several schools by sitting on the board of governers. She held positions of influence in Cambridge such as on the University Faculty Board of Mathematics which she chaired in\n1975\nand\n1976\n.\nAs a person she is described in these terms in\n[\n1\n]\n:-\nSheila Edmonds was fundamentally a shy person but her reticent style concealed a great deal of warmth and real concern for her students, colleagues and friends. On formal occasions, she cut an impressive figure but without any hint of pomposity. After her retirement she was content to live quietly with her newly acquired dog until that was made impossible by the onset of Alzheimer's disease. She had no close relatives.\nProfessor John McCutcheon writes\n[\n2\n]\n:-\nIt is no exaggeration to say that the lectures of Sheila Edmonds were \"wonderfully lucid and inspiring\". I remember her as one of the very best teachers of my undergraduate career. She came across as a most sympathetic lecturer, clearly anxious to assist students in every way.",
  "matematicos_citados_na_biografia": [
    "Wrangler",
    "G H Hardy",
    "Parseval",
    "Fourier transforms",
    "al-Karaji",
    "Mathematical Association"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}