{
  "nome_completo": "Carlos de Siguenza y Gongora",
  "nome_curto": "Siguenza y Gongora",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Siguenza/",
  "data_nascimento": "20 August 1645",
  "local_nascimento": "Mexico City, Mexico",
  "data_morte": "22 August 1700",
  "local_morte": "Mexico City, Mexico",
  "summary": "Siguenza y Gongora was a Mexican astronomer and philosopher.",
  "biografia": "Siguenza y Gongora\n's father was a tutor to the royal family in Spain before sailing to Mexico\n(\nthen known as New Spain\n)\nto make his life in the new world. Siguenza was educated at home, his father being well able to provide the education his son needed. In\n1662\nSiguenza took his first religious vows in the Jesuit College in Tepoztlan where he had begun his training for the Church. From there he moved to Puebla to continue his religious studies at the College of the Holy Spirit.\nThe town of Puebla,\n130\nkm southeast of Mexico City, was characteristically Spanish and had been founded over one hundred years before as Puebla de los Angeles in\n1532\n. It was a great religious centre and a natural place for Siguenza to study. However, in\n1667\nSiguenza was expelled from the College for failing to observe the correct discipline. He returned to Mexico City to study at the university there.\nThe University of Mexico was founded in Mexico City as the Royal Pontifical University by Antonio de Mendoza who was the first viceroy of New Spain. The university was controlled by the Roman Catholic church so, in entering this university, Siguenza was still maintaining his connections with the Church despite the expulsion from the College in Puebla. He also remained a priest, despite the expulsion, and was chaplain to the Amor de Dios Hospital in Mexico City. In\n1672\nSiguenza was appointed to the chair of mathematics at the University. He was to hold this appointment for\n20\nyears and contribute not only to mathematics but also to astronomy and cosmography.\nSiguenza's writings did not always find favour with the Church. Father Eusebio Kino was a Jesuit missionary. He had been educated in Germany, studying mathematics and astronomy, and then entered the Society of Jesus before being sent as a missionary to Mexico City in\n1681\n. Siguenza had published a work in that year which was intended to calm public fears over the appearance of a comet. In reply to criticism of this work, he also published\nEl Belerofonte matematico\nⓉ\n(\nThe mathematical Bellerophon\n)\nin the same year.\nFather Kino strongly disagreed with Siguenza's ideas and published his criticisms. Not one to be intimidated by Jesuit arguments, Siguenza made a strong response to Father Kino's criticism, publishing\nLibra astronomica y philosophica\nⓉ\n(\nAstronomical and philosophical book\n)\nin\n1670\n. This was\n[\n1\n]\n:-\n... a short book of great significance for its sound mathematical background, anti-Aristotelian outlook, and familiarity with modern authors:\nCopernicus\n,\nGalileo\n,\nDescartes\n,\nKepler\n, and\nTycho Brahe\n.\nIn cosmography, Siguenza made maps of New Spain\n(\nthe first by someone born in that country\n)\n, a map of the lakes in the Valley of Mexico, and a map of Pensacola Bay, now northwestern Florida in the United States. There had been Spanish settlement on the coast of the bay from\n1559\nbut the settlement was abandoned in\n1661\n. Siguenza's map of the bay was made in\n1693\nat a time when New Spain were still interested in the area. In fact Siguenza was sent there to investigate the bay with an admiral, and the diary he kept and charts he made are of great value.\nSiguenza intended to write a history of ancient Mexico and spent much time collecting material for this work. It was very unfortunate that his early death prevented him from writing the history, and the extremely valuable manuscripts which he collected were sadly lost.",
  "matematicos_citados_na_biografia": [
    "Copernicus",
    "Galileo",
    "Descartes",
    "Kepler",
    "Tycho Brahe"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}