{
  "nome_completo": "Simon Mayr",
  "nome_curto": "Simon Mayr",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mayr/",
  "data_nascimento": "20 January 1573",
  "local_nascimento": "Gunzenhausen, Bavaria, Germany",
  "data_morte": "26 December 1624",
  "local_morte": "Ansbach, Bavaria, Germany",
  "summary": "Simon Mayr was a German astronomer who may have observed Jupiter's moons before Galileo.",
  "biografia": "Simon Mayr\nis also known as Marius or Mayer but we shall use the version Mayr throughout this biography. His father, Reichart Mayr, was mayor of Gunzenhausen in\n1576\nwhich might suggest that the family were reasonably well off. However, Simon was sent in\n1586\nto Margrave's academy in Heilsbronn, a school for boys who came from poor families yet showed marked academic promise. The school's purpose was to train boys for the Lutheran ministry. While at this school he became interested in astronomy and in\n1594\nhe began to make astronomical and meteorological observations. In\n1596\na comet was seen and Mayr made observations which he incorporated in a publication. In\n1599\nhe published his astronomical tables.\nHe studied at Margrave's academy until\n1601\n, but by this time his publications had earned him a good reputation as a mathematician and astronomer. In that year he was appointed mathematician to the Margrave of Ansbach. He was sent to Prague, with a letter of recomendation dated\n22\nMay\n1601\n, to study under\nTycho Brahe\n. He remained there for four months learning to use\nBrahe\n's instruments.\nBrahe\ndied in October of that year, but Mayr had already left since we know he passed through Moravia on\n25\nSeptember on his way to Vienna and then further south. He then went to Padua where he studied medicine. Mayr was admitted to the Association of German Students of Arts at the University of Padua on\n18\nDecember\n1601\n, donating\n6\nVenetian lire to the association\n(\nhe donated\n10\nlire in each of the following four years\n)\n. He became proctor of the association on\n5\nMarch\n1604\n, then on\n27\nJuly\n1604\nhe was elected librarian to serve until\n14\nApril\n1605\n. His actions in this capacity contributed to him earning a poor reputation for after he had left Padua on\n1\nJuly\n1605\n[\n1\n]\n:-\nThe association's official minutes for\n24\nJuly record that he had misinformed it about the German law students' attitude towards an impending election.\nMayr seems to have been a militant Lutheran and this may have contributed to his actions when in a position of authority in the association. The other event which contributed to his poor reputation concerned a student Baldessar Capra whom he began to tutor in\n1602\n. Mayr and Capra observed a nova which was visible in\n1604\nand Mayr helped Capra write a book on the nova under Capra's name. There was nothing wrong in this but, in\n1607\n, Capra published a manual which he claimed he had written although it had in fact been written by\nGalileo\n. For this Capra was expelled from the university but Mayr, who had left Italy by this time, was thought to be implicated in the fraud.\nGalileo\ncertainly thought so, but he chose not to name Mayr explicitely but described him as his \"old adversary\", and much worse as a \"poisonous reptile\" and an \"enemy of all mankind\".\nHe returned to Germany in\n1605\nto be both mathematician and physician to the Margraves - Christian and Joachin Ernst - in the city of Ansbach. In\n1606\nhe married Felicitas Lauer, the daughter of his publisher. He published the first German translation of Books I to VI of\nEuclid\n's\nElements\nin\n1609\n. In fact\n1609\nbecame a crucial year for Mayr and would lead to a serious dispute with\nGalileo\nwhere this time he named him and wrote a strong condemnation of him which we quote from below.\nHaving heard that a telescope was being sold at the Frankfurt Fair in\n1608\n, Mayr constructed his own. It took him about a year before he had one of sufficient quality to make astronomical observations and claimed to have observed the moons of Jupiter in December of\n1609\n. If that is true his observation is a month before that of\nGalileo\n. His claim is made in his\n1614\nbook entitled\nMundus Iovialis anno M.DC.IX Detectus Ope Perspicilli Belgici\nⓉ\n(\nThe Jovian World, discovered in\n1609\nby means of the Dutch Telescope\n)\n, where he states that he began observing in late November\n1609\nrecorded his observations from\n29\nDecember. However,\nGalileo\nhotly disputed Mayr's claims writing in the\nAssayer\n(1623)\n[\n4\n]\n(\nsee also\n[\n5\n]\n)\n:-\nOf such usurpers I might name not a few, but I shall pass them over now in silence, as it is customary for first offences to receive less severe punishment than subsequent ones. But I shall not remain silent any longer about a second offender who has tried too audaciously to do to me the very same thing which he did many years ago by appropriating the invention of my geometric compass, despite the fact that I had many years previously shown it and discussed it before a large number of gentlemen and had finally made it public in print. May I be pardoned if, against my nature, my habit, and my present intentions - I show resentment and cry out, perhaps with too much bitterness, about a thing which I have kept to myself these many years. I speak of Simon Mayr of Gunzenhausen; he it was in Padua, where I resided at the time, who set forth in Latin the use of the said compass of mine and, appropriating it to himself, had one of his pupils print this under his name. Forthwith, perhaps to escape punishment, he departed immediately for his native land, leaving his pupil in the lurch as the saying goes; and against the latter, in the absence of Simon Mayr, I was obliged to proceed in the manner which is set forth in the Defence which I then wrote and published. Four years after the publication of my 'Sidereal Messenger', this same fellow, desiring as usual to ornament himself with the labours of others, did not blush to make himself the author of the things I had discovered and printed in that work. Publishing under the title of 'The Jovian World', he had the temerity to claim that he had observed these Medicean planets which revolve about Jupiter before I had done so. But because it rarely happens that truth allows herself to be suppressed by falsehood, you may see how he himself, through his carelessness and lack of understanding, gives me in that very work of his the means of convicting him by irrefutable testimony and revealing unmistakably his error, showing not only that he did not observe the said stars before me but even that he did not certainly see them until two years afterwards; and I say moreover that it may be affirmed very probably that he never observed them at all.\n...\nNext, notice the craft with which he tries to show himself prior to me. I wrote in my 'Sidereal Messenger' of making my first observation on the seventh of January,\n1610\n, continuing then with others on the succeeding nights. Along comes Mayr, and, appropriating my very observations, he prints in the title page of his book and again in the opening part of his work that he had already made his observations in the year\n1609\n, trying to give people the idea that he was first. The earliest observation that he produces as made by him is the second one made by me; yet he announces it as made in the year\n1609\n. What he neglects to mention to the reader that since he is outside our church and has not accepted the Gregorian calendar, the seventh day of January of\n1610\nfor us Catholics, is the same as the twenty-eighth day of December of\n1609\nfor those heretics. So much for the priority of his pretended observations.\nAlthough it is impossible to prove whether his claim is true or false, the general opinion among historians of science is that Mayr did observe the moons of Jupiter before\nGalileo\n, but failed to understand the significance of what he saw\n(\ni.e. failed to realise that the moons were orbiting the planet\n)\n. Mayr did, however, name the moons Europa, Io, Ganymede and Callisto - the names by which they are still known. Mayr published a book giving details of the orbits of the moons of Jupiter in\n1614\n. The data he gave is more accurate than that of\nGalileo\n, so this shows convincingly that\nGalileo\nwas wrong in believing that Mayr may never have observed the moons of Jupiter at all. Is it possible that Mayr, the militant Lutheran, may have been attacked more vigorously by\nGalileo\n, the staunch Catholic, partly as a result of their religious differences? It would appear that Mayr did overstep the mark in his claims of priority, but at the same time\nGalileo\noverstepped the mark in his attack on Mayr, so we declare the contest a\n(\nnot too honourable\n)\ndraw!\nMayr was the certainly first to observe the Andromeda galaxy with a telescope, although of course he had no notion that he was observing a distant system of stars. He reports this in his\nMundus Iovialis\nⓉ\n(\nThe Jovian World\n)\nof\n1614\n. He also published a book on the comets of\n1618\n.",
  "matematicos_citados_na_biografia": [
    "Tycho Brahe",
    "Brahe",
    "Galileo",
    "Euclid"
  ],
  "imagens": [
    "mayr.jpg"
  ]
}