{
  "nome_completo": "Abu Said Sinan ibn Thabit ibn Qurra",
  "nome_curto": "Sinan ibn Thabit ibn Qurra",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sinan/",
  "data_nascimento": "about 880",
  "local_nascimento": null,
  "data_morte": "943",
  "local_morte": "Baghdad, (now in Iraq)",
  "summary": "Sinan ibn Thabit was the son and father of other Islamic mathematicians. He is more important for his contributions to medicine than to mathematics.",
  "biografia": "Sinan ibn Thabit ibn Qurra\nwas the son of\nThabit ibn Qurra\nand the father of\nIbrahim ibn Sinan\n. Although Sinan was extremely eminent in medicine his contributions to mathematics were somewhat less major but he still deserves a place in this archive as a contributor to mathematics in this remarkable family of scholars.\nThabit ibn Qurra\n, Sinan's father, was a member of the Sabian sect. The Sabian religious sect were star worshippers from Harran. Of course being worshipers of the stars meant that there was strong motivation for the study of astronomy and the sect produced many quality astronomers and mathematicians such as\nThabit\nhimself. Sinan was trained in medicine, a topic which his father had studied in Baghdad. His father's patron was the Caliph, al-Mu'tadid, one of the greatest of the 'Abbasid caliphs, and Sinan was brought up at the court where his father held the role of court astronomer.\nSinan's father\nThabit\ndied in\n901\nand the caliph al-Mu'tadid died the following year. Al-Mu'tadid had shown great skill in playing the various factions off against each other during his period of power but after his troops were defeated by the Qarmatians, a schismatic sect and political movement. Historians argue whether al-Mu'tadid was poisoned in a palace intrigue, but even if he was not this is an indication of the atmosphere in the court where Sinan lived. By this time Sinan was a man of about\n22\nyears of age but, despite having great medical skills, he seems to have held no positions at this time.\nOn al-Mu'tadid death, his son al-Muktafi became caliph and succeeded in defeating the Qarmatian sect which had lead to his father's downfall. He ruled until\n908\nand Sinan certainly enjoyed a period of great cultural activity in Baghdad which was home to many intellectuals. However in\n908\nal-Muqtadir, who was only a boy at the time, became Caliph. He was a weak leader but his coming to power saw Sinan achieve his first major position in which he directed the hospitals and all medical activities in Baghdad.\nAlthough the government in Baghdad slowly lost control, Sinan achieved the respect of all the factions. He was, as we mentioned at the beginning of the article, a Sabian and not a Muslim. However, he was totally fair in his treatment of people regardless of which religious group they belonged to and for this he gained respect. By\n931\nhe had gained such authority in Baghdad that all doctors had to be tested by him before being allowed to practise.\nAl-Muqtadir's reign ended in\n932\nand he was replaced by al-Qahir. Sinan faced a totally different type of regime, for al-Qahir persecuted the Sabians. Sinan tried to preserve his position by becoming Muslim but this was not sufficient to allow him to continue in Baghdad and he fled to Khurasan. The Abbasid caliphs were rapidly losing control and al-Qahir only survived for two years before ar-Radi became caliph in\n934\n. This allowed Sinan to return to Baghdad but, in\n935\n, the final political crisis occurred and ar-Radi was forced to hand over most of his power to the ambitious general ibn Ra'iq.\nAr-Radi died in\n940\nafter a five year struggle to retain power and the problems only became worse as military leaders struggled for control. Sinan left Baghdad again to move this time to Wasit on the Tigris.\nDespite his high profile medical career, Sinan seems not to have written any works on medicine. He wrote mainly on three topics, political history, mathematics and astronomy. However Sinan's political work in which he set out his ideas for a government modelled on\nPlato\n's\nRepublic\nwere criticised by the historian and traveller al-Mas'udi who known as the \"Herodotus of the Arabs\". Al-Mas'udi stated that Sinan should have\n[\n1\n]\n:-\n... occupied himself with topics within his competence, such as the science of Euclid, the Almagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n, astronomy, the theories of meteorological phenomena, logic,\nmetaphysics\n, and the philosophical systems of Socrates,\nPlato\n, and\nAristotle\n.\nNo works which can definitely be attributed to Sinan have survived although it is claimed that he wrote four mathematical works, although in\n[\n1\n]\nthe author points out that only two of the four could have beed written by Sinan, one on\nArchimedes\nwork\nOn triangles\nand one\nOn the elements of geometry\n.",
  "matematicos_citados_na_biografia": [
    "Thabit ibn Qurra",
    "Ibrahim ibn Sinan",
    "Thabit",
    "Plato",
    "metaphysics",
    "Aristotle",
    "Archimedes"
  ],
  "imagens": []
}