{
  "nome_completo": "Sixto Ríos García",
  "nome_curto": "Sixto Ríos",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rios/",
  "data_nascimento": "4 January 1913",
  "local_nascimento": "Pelahustán, Toledo, Spain",
  "data_morte": "8 July 2008",
  "local_morte": "Madrid, Spain",
  "summary": "Sixto Ríos García was a Spanish mathematician who wrote many important papers in both analysis and statistics.",
  "biografia": "Sixto Ríos\n's parents were José Maria Ríos Moreiro\n(1880\n-\n1970)\nand Maria Cristina Garcia Martin\n(\nborn\n1885)\n, both school teachers. The name Sixto came from an uncle, a brother of his mother. José Ríos taught in school in Pelahustán where children of all ages were taught in a single classroom. There were two children in the family, the other being a girl, Encarnación Ríos Garcia, who was three years younger than Sixto. Although Sixto's parents were both teachers, both his fraternal and maternal grandparents were involved in agriculture. However, his paternal grandfather, Lorenzo Ríos Curto\n(\nborn\n1849)\n, had a passion for reading and even wrote plays. He was an influence on the young Sixto, encouraging him to read and appreciate books. In\n1916\n, when Sixto was three years old, his parents requested a transfer to teach in schools in Los Navalmorales, Toledo, and their request was granted.\nIt was at his father's school in Los Navalmorales that Sixtos began his education. After three years in that town, his parents again requested a transfer, this time to teach at schools in Madrid, mainly so that their children could have a good education. For two years he attended the school in Madrid where his mother taught, then he moved to the Normal School where his father taught. He began his Baccalaureate studies in\n1922\n, taught by his father at home for two years, and examining himself as a free student at the San Isidro Institute. Two years later he entered the San Mauricio College in Madrid, continuing with his Baccalaureate studies and examinations as a free student at the San Isidro Institute. His achievements at school were top quality, and he topped every class. He was taught mathematics by his father and by\nPedro Puig Adam\n, the professor of Mathematics at the San Isidro Institute. He said in the interview\n[\n16\n]\n:-\nThey taught me to differentiate the role of intuition and logic in solving a problem.\nIt was\nPuig Adam\nwho suggested that he try to solve a mathematical problem posed in the\nRevista Matemática Hispano-Americana.\nIn April\n1927\nhis solution was published in that journal. Having obtained his Baccalaureate in\n1928\n, in the September of that year he began his studies of Exact Sciences in the Faculty of Sciences of the Universidad Central de Madrid.\nAlthough Ríos's main studies were in mathematical science, he also studied the two-year course on education following the wishes of his father. He also decided that he needed to have language skills and he taught himself English and German while studying at university. The lecturer he liked best was José Álvarez Ude\n(1876\n-\n1958)\n, who had been professor of Descriptive Geometry at the University of Zaragosa from\n1902\nto\n1916\nand later moved to Madrid. Álvarez Ude used texts by Karl Gustav Hermann Thieme\n(1852\n-\n1926)\n, a German mathematician who wrote on geometry, and the Italians\nFrancesco Severi\nand\nFederigo Enriques\n. He was taught analysis by José Barinaga Mata\n(1890\n-\n1965)\n, who had taught in Madrid from\n1927\nto\n1930\nbefore moving to the University of Barcelona, by\nTomás Rodríguez Bachiller\n(1899\n-\n1980)\n, who became an assistant in Madrid in\n1925\nand taught the first course on topology to be given in Spain in that year, and by Esteban Terrades i Illa\n(1883\n-\n1950)\nwho had studied at Charlottenburg in Berlin, Barcelona and Madrid before becoming a professor in the universities of Zaragoza, Barcelona and Madrid. A few visitors gave talks at Madrid including\nVito Volterra\nand\nLuigi Fantappié\n. One of Ríos's fellow students, but slightly older, was\nLuis Antonio Santaló\n.\nRíos was elected as a student representative on the Faculty Board in\n1930\nand, in the following year, was awarded a scholarship by the Mathematical Seminar and there met\nJulio Rey Pastor\nfor the first time;\nRey Pastor\nwas based in Argentina but spent a short time in Madrid each winter. In the academic year\n1931\n-\n32\nRíos studied a course on Mathematical Statistics taught by\nEsteban Terradas\n. The course was based on work by\nRonald Fisher\n,\nBruno de Finetti\n, and\nAndrey Kolmogorov\n.\nOn\n22\nJune\n1932\nRíos was awarded a Bachelor's degree in Exact Sciences from the Universidad Central de Madrid. His performance was rated \"outstanding\" and he was awarded the first prize. He then proceeded to undertake research for his doctorate, advised by\nJulio Rey Pastor\n. He began publishing papers, both in French and in Spanish:\nSobre una generalización del algoritmo de convergencia de Euler\nⓉ\n(\nOn a generalization of Euler's convergence algorithm\n)\n(1932)\n;\nSur l'ensemble singulier d'une classe des séries potentielles de Taylor qui présentent des lacunes\nⓉ\n(\nOn the singular set of a class of potential Taylor series that have gaps\n)\n(1933)\n;\nEstado actual de la teoría de la hiperconvergencia\nⓉ\n(\nThe current state of hyperconvergence theory\n)\n(1934)\n;\nSopra l'ultraconvergenza delle serie di Dirichlet\nⓉ\n(\nOn the ultraconvergence of Dirichlet series\n)\n(1934)\n;\nAlgunos resultados relativos a la hiperconvergencia en las series de Dirichlet\nⓉ\n(\nSome results concerning hyperconvergence in the Dirichlet series\n)\n(1934)\n; and\nSobre un teorema de M. Mandelbrojt\nⓉ\n(\nOn a theorem of Mandelbrojt\n)\n(1934)\n. This last mentioned paper deserves a little more detail. Ríos said\n[\n16\n]\n:-\nReading a book by\nHadamard\nand\nMandelbrojt\n, I found an error in the proof of an important theorem of the second author, confirmed by\nRey Pastor\n. My \"youthful\" polemic with them, in which\nHadamard\nhimself intervened, was settled in my favour by an elegant and dignified review by\nBieberbach\n...\nAlthough Ríos was undertaking research for his doctorate, he was also appointed as assistant to José Barinaga in Mathematical Analysis I at the Universidad Central de Madrid in\n1932\n-\n33\n. Luis Santaló was at this time also one of Barinaga's assistants. The way Barinaga treated his assistants meant they had quite a challenge\n[\n13\n]\n:-\nProfessor Barinaga barely gave his assistants time to solve the problems before going to class, which made them nervous in case some compromised situation arose in class. One day Ríos placed on the chalkboard, before Barinaga arrived, an easy and simple solution he had found to one of the difficult problems. Barinaga was surprised because the solution he had designed was rather more complicated.\nIn November\n1934\nhe became an assistant to\nTomás Rodríguez Bachiller\n. He submitted his doctoral thesis,\nLa hiperconvergencia de las integrales de Laplace Stieltjes\nⓉ\n(\nThe hyperconvergence of the Laplace-Stieltjes integrals\n)\n, and was awarded a doctorate on\n21\nDecember\n1935\n. His thesis, which was a continuation of\nAlexander Markowich Ostrowski\n's works on potential series, was published in\n1936\n. In July of that year Ríos and his family were on holiday, living in a tent in the Carmelites in El Escorial. While there they learnt of the civil war and its meaning for them quickly became evident when Ríos's father was arrested. After only three or four days his father was released and the family moved to Cercedilla. Ríos was excused military service on health grounds but the Commander of the Military Command of Cercedilla required him to become his assistant secretary, making him teach mathematics to military chiefs.\nIn\n1937\nhe was awarded the First Prize of the\nSpanish Royal Academy of Sciences\nfor his paper\nSobre el problema de hiperconvergencia de las series de Dirichlet cuyas sucesiones de exponentes poseen densidad máxima infinita\nⓉ\n(\nOn the problem of hyperconvergence of the Dirichlet series whose sequence of exponents have infinite maximum density\n)\n(1940)\nand\nConferencias sobre sucesiones de funciones analíticas y sus aplicaciones\nⓉ\n(\nConferences on successions of analytic functions and their applications\n)\n(1940)\n. The delay in publication of the papers\n(\nwritten four years earlier\n)\nwas due to the civil war and similarly there was a delay in Ríos receiving the prize, which did not happen until\n15\nNovember\n1941\n. Before this, however, he was able to return to his university teaching. Along with other academics he was obliged to complete an affidavit on\n15\nApril\n1939\n. He was able to return to the Universidad Central de Madrid but these were difficult times and he only achieved this with help from his uncle, Hermenegildo Alfonso Ríos, Commander of the Carabineros, who managed to arrange all the documents he needed.\nThe\nRoyal Academy of Sciences\ngranted him the Chair of Mathematics in the Foundation Conde de Cartagena in\n1940\n. This was a five year appointment, but was extended for another five years to\n1950\n. In November\n1940\nhe became Assistant Professor of Mathematical Analysis IV at Universidad Central de Madrid. In the following year he became Professor of the Military Academy of Aeronautical Engineers of Madrid, requiring him to be given an honorary military position before he could serve in this role. In the same year he became a Fellow and collaborator of the Higher Council for Scientific Research. On\n26\nAugust\n1941\nhe was appointed to the Chair of Mathematical Analysis of the University of Valencia. In December\n1942\nhe was appointed to the Chair of Special Mathematics at the University of Valladolid.\nIn January\n1943\nRíos became Head of the Analysis Section of the Jorge Juan Institute of the Higher Council of Scientific Research. On\n11\nDecember of the same year Ríos was awarded the Alfonso X El Sabio Prize for his work\nLa prolongación analítica de la integral de Dirichlet Stieltjes\nⓉ\n(\nThe analytic continuation of the integral of Dirichlet-Stieltjes\n)\n. The Chair of Mathematics in the Foundation Conde de Cartagena was better for Ríos than the chair at the University of Valladolid where, he said in an interview\n[\n16\n]\n:-\n... the horizon was more modest and the working conditions worse.\nHe was on the\n5\n-year extension of the Conde de Cartagena chair and knew that this ended in\n1950\n. Also he was looking to move to an area where he could apply mathematics. He explained in\n[\n16\n]\nthat the:-\n... type of research in which one starts from reality, builds a model and draws non-trivial consequences, was more attractive to me than the work of the pure mathematics.\nHaving already done some work in statistics, he therefore applied for Chair of Mathematical Statistics at the University of Madrid when it became vacant. He was appointed to this position on\n5\nJune\n1948\nand from that time on became a major figure in Spanish mathematical statistics. In his Honorary Doctorate address, he gave more details of his move into statistics:-\n... after working for fifteen years in functions of complex variable and theory of integration of real functions, I jumped, for professional needs, to the calculation of probabilities. Then I came in contact with the statistics that was beginning to constitute a unified discipline with the Calculus of Probabilities, thanks especially to the works of\nHarald Cramér\n. Only a few years later I became acquainted with the important multidisciplinary applications made by teams of eminent scientists in the military problems of World War II and soon led, with the name of Operations Research, to the treatment of the decision processes of organising systems, etc., that is to say, in the large systems involving men, machines, energy, information, uncertainties, ...\nFor a version of the whole of this address, see\nTHIS LINK\n.\nOn\n29\nJuly\n1950\n, Ríos married María Jesús Insua Negrao in the Chapel of the Holy Spirit of the Consejo Superior de Investigaciones Científicas. María was twenty-three years old and Ríos was thirty-seven at the time of their marriage. They had six children María Jesús Ríos-Insua, Cristina Ríos-Insua, Sixto Ríos-Insua, Valeria Ríos-Insua, David Ríos-Insua and Alba Ríos-Insua, three of whom became mathematicians undertaking research into similar areas of operations research and statistics as their father, namely Sixto Ríos-Insua, David Ríos-Insúa and María Jesús Ríos-Insua. Let us record at this point that Sixto Ríos-Insua and María Jesús Ríos-Insua co-authored the book\nProcesos de Decision Multicriterio\nⓉ\n(\nMulticriterion decision processes\n)\n(1989)\nwith their father. Ríos with his sons Sixto Ríos-Insua and David Ríos-Insúa collaborated on the six author paper\nAllais phenomena and completeness of preferences\n(1997)\nwith J Pachón, M A Pacios and P García Barreno.\nFor other works that Ríos published with his three mathematical children, see\nTHIS LINK\n.\nBefore taking up the chair of statistics, Ríos had published a number of books on analysis such as\nLectures on the theory of the integral\n(\nSpanish\n)\n(1942)\n,\nLectures on the theory of the analytic continuation of Dirichlet series\n(\nSpanish\n)\n(1943)\n,\nLa Prolongación Analítica de la Integral de Dirichlet-Stieltjes\nⓉ\n(\nThe analytical continuation of the Integral of Dirichlet-Stieltjes\n)\n(1944)\n,\nConferencias sobre la Representación Analítica de Funciones\nⓉ\n(\nConferences on the analytical representation of functions\n)\n(1945)\n, and\nConceptos de Integral\nⓉ\n(\nConcepts of Integral\n)\n(1946)\n. Even after taking up the Chair of Statistics he published the analysis book\nIntroducción à la Teoria de Series Trigonométricas\nⓉ\n(\nIntroduction to the theory of trigonometric series\n)\n(1949)\n. However, soon he was publishing statistics books such as\nIntroducción a los metodos de la estadística\nⓉ\n(\nIntroduction to the methods of statistics\n)\nPart\n1\n(1952)\nand\nIntroducción a los metodos de la estadística\nⓉ\n(\nIntroduction to the methods of statistics\n)\nPart\n2\n(1954)\n.\nPaul Halmos\n, reviewing the first of these, writes\n[\n25\n]\n:-\nThis is a charming and elementary book that fulfils, within the limits the author sets for it, the promise of the title.\nFor a longer extract, see\nTHIS LINK\n.\nReviewing the second part, S Vijda writes\n[\n34\n]\n:-\nThe author of this book is the director of a school of statistics which has been organised in the University of Madrid since the last war. The word \"school\" should, in this context, be understood to mean a teaching establishment rather than a research group, and it is of interest to see how energetically Professor Rios assists his students in catching up with that statistical knowledge to which British and American scholars have, as yet, made significantly more contributions than his fellow countrymen. The volume now under review is the second part of a course in mathematical statistics. It deals with a number of subjects not often found in textbooks.\nFor a longer extract, see\nTHIS LINK\n.\nIn October\n1952\nthe School of Statistics of Madrid University was founded. At this time Ríos gave the address\nNuevas aplicaciones de la Estadistica: La investigacion operacional\nⓉ\n(\nNew applications of statistics: Operational Research\n)\nin which he\n[\n9\n]\n:-\n... gives a general review of the development of O.R.\n[\nHe\n]\nrefers briefly to war-time examples and indicates some industrial applications. Principles and methods are discussed and directions in which it may be useful are indicated.\nWith his move from analysis to statistics, Ríos has a publication list with a remarkable range of important works. Our list of his publications is far from complete but the reader can at least get a flavour of the range of his publications given at\n.\nRíos received many honours, some of which we now list. In\n1958\nRíos was elected a Fellow of the Institute of Mathematical Statistics. In January\n1959\nhe was elected to the\nRoyal Academy of Exact, Physical and Natural Sciences\n. In the following year he was honoured with the street in which he was born in Pelahustán being named 'Sixto Ríos'. In May\n1966\nhe was elected to the Academy of Exact, Physical and Natural Sciences of Buenos Aires. From\n1970\nto\n1984\nhe was President of the Spanish Operational Research Society. From\n1974\nto\n1992\nhe was President of the Exact Sciences Section of the\nRoyal Academy of Exact, Physical and Natural Sciences\n. He was awarded the Francisco Franco Prize for Research in Sciences in September\n1975\nfor his important research work in Mathematics and in the following year he received the National Award for Mathematical Research. He was made an Honorary Fellow of the Royal Statistical Society in\n1978\n. The Universidad Complutense de Madrid awarded him their Gold Medal for fifty years of teaching on\n28\nJanuary\n1983\n. He received an honorary doctorate from the University of Oviedo in January\n2000\nand in April of the following year the University of Seville gave him the same honour.\nIn\n1983\n, at the age of\n70\n, Ríos retired. However, he continued to undertake research, publish articles and books, and attend international conferences. On\n15\nNovember\n2003\nhis wife María Jesús died in Madrid. His son, Sixto Ríos-Insua, died in Madrid on\n11\nJune\n2008\nand less than a month later Ríos died of bronchitis at the Clínica de la Luz in Madrid.",
  "matematicos_citados_na_biografia": [
    "Pedro Puig Adam",
    "Puig Adam",
    "Francesco Severi",
    "Federigo Enriques",
    "Tomás Rodríguez Bachiller",
    "Vito Volterra",
    "Luigi Fantappié",
    "Luis Antonio Santaló",
    "Julio Rey Pastor",
    "Rey Pastor",
    "Esteban Terradas",
    "Ronald Fisher",
    "Bruno de Finetti",
    "Andrey Kolmogorov",
    "Hadamard",
    "Mandelbrojt",
    "Bieberbach",
    "Alexander Markowich Ostrowski",
    "Spanish Royal Academy of Sciences",
    "Royal Academy of Sciences",
    "Harald Cramér",
    "THIS LINK",
    "Paul Halmos",
    "Royal Academy of Exact, Physical and Natural Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}