{
  "nome_completo": "Sporus of Nicaea",
  "nome_curto": "Sporus",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sporus/",
  "data_nascimento": "about 240",
  "local_nascimento": "(possibly) Nicaea (now Iznik), Bithynia (now Turkey)",
  "data_morte": "about 300",
  "local_morte": null,
  "summary": "Sporus was a Greek mathematician who worked on the classical problems of squaring the circle and duplicating the cube.",
  "biografia": "Sporus\nwas taught by Philon of Gadara. In his turn, Sporus taught\nPappus\nof Alexandria, or perhaps was an older pupil at the same time as\nPappus\n, and we know of him through\nPappus\n's writings and the writings of\nEutocius\n.\nSporus worked mainly on the classical problems of\nsquaring the circle\nand\nduplicating the cube\n. His solution of the problem of duplicating the cube is similar to that of\nDiocles\nand in fact\nPappus\nalso followed a similar construction. However, they avoid using the cissoid but instead rotate a ruler about a point until certain intercepts are equal. Sporus also used approximations which are early examples of integration. Not only did Sporus work on squaring the circle and duplicating the cube but he also constructively criticised others work in these areas.\nOne of his contributions, which is described by\nPappus\n, was to criticise the method of squaring the circle using the quadratrix of\nHippias\n. He uses an argument based on the fact that to be able to draw the quadratrix using\nHippias\n's construction, one needs to know the ratio of a radius of a circle to its circumference and being able to construct this ratio is equivalent to being able to square the circle. There seems little doubt that Sporus's criticism is valid.\nSporus also criticised\nArchimedes\nfor not producing a more accurate approximation of π.\nEutocius\nhowever supports\nArchimedes\n, writing\n(\nin\nHeath\n's translation, see for example\n[\n2\n]\n)\n:-\n[\nArchimedes\n]\nobject in this book was to find an appropriate\n[\napproximation of π\n]\nsuitable for use in daily life. Hence we cannot regard as appropriate the censure of Sporus of Nicaea, who seems to charge Archimedes with having failed to determine with accuracy the length of the straight line which is equal to the circumference of the circle, to judge by his passage in his Keria where Sporus observes that his own teacher, meaning Philon of Gadara, reduced the matter to more accurate numerical expression than Archimedes did ...\nSporus also wrote on the size of the Sun and on comets.\nSporus's writings and teaching clearly had a large impact on\nPappus\nwho describes him as having a high reputation.",
  "matematicos_citados_na_biografia": [
    "Pappus",
    "Eutocius",
    "squaring the circle",
    "duplicating the cube",
    "Diocles",
    "Hippias",
    "Archimedes",
    "Heath"
  ],
  "imagens": []
}