{
  "nome_completo": "Stanisław Marcin Ulam",
  "nome_curto": "Stan Ulam",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ulam/",
  "data_nascimento": "13 April 1909",
  "local_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "data_morte": "13 May 1984",
  "local_morte": "Santa Fe, New Mexico, USA",
  "summary": "Stan Ulam was a Polish-American mathematician who solved the problem of how to initiate fusion in the hydrogen bomb. He also devised the Monte-Carlo method widely used in solving mathematical problems using statistical sampling.",
  "biografia": "Stan Ulam\ngrew up in a well-off Polish-Jewish family in Lemberg as it was then called. After World War I it changed its name to Lwów and it is now called Lviv and is in Ukraine. His parents were Józef Ulam\n(1879\n-\n1941)\nand Hania Auerbach\n(1887\n-\n1938)\nknown as Anna. Jozef Ulam was a lawyer who had been born in Lwów.\n(\nAlthough it was actually called Lemberg at that time let us for simplicity call it Lwów throughout this biography.\n)\nJózef's father, Stan's Józef grandfather, was Abraham Berl Ulam who had been an architect and a building contractor. Stan's mother Anna had been born in Stryj, a town about\n65\nkm south of Lemberg which is now in Ukraine. Her father, Michael Auerbach, was an industrialist who dealt in steel and was involved with factories in both Galicia and Hungary. Jozef and Anna Ulam had three children, Stanisław Ulam, born\n1909\nthe subject of this biography, Stefania Teofila Ulam, born\n1912\n, and Adam Bruno Ulam, born\n8\nApril\n1922\n. We shall relate below some details about Stan's sister and brother but first we continue with Stan Ulam's biography.\nWorld War I began in July\n1914\nand by September of that year Russian troops attacked Galicia and soon occupied Lwów. The Ulam family fled to Vienna and lived in a hotel close to St Stephen's Cathedral. Józef Ulam became an officer in the Austrian army and, in contrast to most Poles, the family were supporters of the Central Powers. Józef's army role involved the family in much travelling and Stan could not attend school so they employed a tutor for him. The only place where they stayed for some time was Ostrava where he did attend school. He was taught multiplication tables at the school, an experience he found \"mildly painful.\" The family had been Polish speaking when in Lwów but Stan learnt German during his years in Austria. After World War I ended in\n1918\n, the family returned to Lwów where they lived at\n16\nUlica Kosciuszko.\nSadly, once again they found themselves in a war zone when Ukrainian soldiers attacked Lwów in November\n1918\n. The Ulam's home was in a relatively safe part of the city and all their relatives arrived so the house was filled with over\n30\npeople. The basement provided safety during shelling but it did not last long ending after a couple of weeks when the Polish army arrived. Poland had not existed as an independent country for over\n100\nyears but, in\n1919\n, it was reborn with Lwów a major Polish city.\nAt the age of ten, Ulam entered the gymnasium in Lwów and, about this time, he became interested first in astronomy and then in physics. An uncle gave Ulam a telescope when he was about\n12\nyears old and later Ulam tried to understand\nEinstein\n's special theory of relativity. This, however, required an understanding of mathematics and so, at age\n14\n, he began to study mathematics from books, going well beyond the school level mathematics he was learning. The first mathematics book he read was\nEuler\n's\nAlgebra\nwhich he found in his father's library. He said in the interview\n[\n99\n]\n:-\nBy the time I was fifteen I was reading number theory; there was a fascinating book by\nSierpinski\n- in Polish, of course. And then I read about set theory. At that time I thought that if it's possible at all, or practical, to become a mathematician, I would want to be one. Of course, from the practical point of view, it was very difficult to decide on studying mathematics - only mathematics - at the university because of the exigencies of a career: there were very few positions. To make a living in mathematics was very, very difficult.\nUlam said\n(\n[\n30\n]\nor\n[\n31\n]\n)\n:-\n... I was sixteen when I really learned calculus all by myself from a book by Kowalevski, a German not to be confused with\nSonia Kovalevskaya\n.... Then I read also about set theory in a book by\nSierpinski\n, and I think I understood that. We had a good professor in high school, Zygmunt Zawirski, who was a lecturer in logic at the university. I talked to him about it then and when I entered the Polytechnic Institute.\nIn\n1926\n, when still at the gymnasium, he attended his first lectures by leading mathematicians going to lectures by\nHugo Steinhaus\n,\nStanislaw Ruziewicz\nand\nStefan Banach\non successive days. With interests in astronomy, physics and mathematics, but understanding the difficulty of obtaining a university mathematics position, Ulam applied to the Polytechnic Institute in Lwów to study electrical engineering. The course, however, was full so instead he opted to study in the newly founded Department of General Studies. In\n1927\n, his first year at the university, he took a second year course on set theory given by\nKazimierz Kuratowski\nwho had just been appointed to Lwów. Ulam said\n(\n[\n30\n]\nor\n[\n31\n]\n)\n:-\n[\nKuratowski\n]\ngave an elementary course on set theory, and I asked some questions, then I talked to him after classes, and he became interested in a young student who evidently was interested in mathematics and had some ideas. I was lucky to solve an unsolved problem that he proposed.\nKuratowski\nwrites in\n[\n47\n]\nthat:-\n... immediately after my first lecture Stanislaw Ulam - for whom it was also the first lecture - approached me with a question which gave evidence both of his advancement and intelligence. From that moment I became interested in him and tried to introduce him to mathematics. In a short time he became my collaborator, as well as an independent mathematician and my close friend.\nUlam found\nKuratowski\n's lectures inspiring\n[\n98\n]\n:-\nThe course was attended by some fifteen students and the lectures were, in contrast to my high school experiences, monuments of logic, clarity, systematic presentation, and preparation.\nAmazingly, Ulam was only in his second year at the Polytechnic Institute when he wrote his first two papers. These gave the solutions to the problems that\nKuratowski\nhad posed in his lectures:\nRemark on the generalised Bernstein's theorem\n(1929)\nand\nConcerning functions of sets\n(1929)\n. It is surprising that Ulam chose to write these two\n3\n-page papers, which were both published in\nFundamenta Mathematicae\n, in English.\nWhile still a postgraduate student he was invited to lecture at a number of conferences, in particular at Wilno in\n1931\nand at the International Congress of Mathematicians in Zurich in\n1932\nwhere he gave the lecture\nZum Maßbegriffe in Produkträumen\nⓉ\n(\nOn the concepts of measurement in product spaces\n)\n. He begins this lecture by saying that it is joint work with Zbigniew Łomnicki and ends with a promise that applications of this work on measure theory to the calculus of probabilities will soon be published. Indeed the joint paper\nSur la théorie de la mesure dans les espaces combinatoires et son application au calcul des probabilités\nⓉ\n(\nOn the theory of measurement in combinatorial spaces and its application to the calculation of probabilities\n)\nby Łomnicki and Ulam was published in\n1934\n. Let us record here the sad fact that Zbigniew Łomnicki was murdered by the Germans in July\n1941\n.\nUlam obtained his Ph.D. from the Polytechnic Institute in Lwów in\n1933\nhaving written a thesis with\nKuratowski\nas his advisor. He investigated a problem which originated with\nLebesgue\nin\n1902\nto find a measure on\n[0\n,\n1]\nwith certain properties.\nBanach\nin\n1929\nhad solved a related measure problem, but assuming the Generalised Continuum Hypothesis. Ulam, in\n1930\n, strengthened\nBanach\n's result by proving it without using the Generalised Continuum Hypothesis. He claims in\n[\n93\n]\nthat he wrote his thesis in six hours during a single night.\nFor more information about Ulam's interaction with his teacher\nKuratowski\n, see Ulam's obituary of\nKuratowski\nat\nTHIS LINK\n.\nAfter the award of his doctorate, Ulam made visits to various cities to meet the leading mathematicians. In Vienna he met\nKarl Menger\n, in Zurich he met\nHeinz Hopf\nand\nMarcel Grossmann\n, in Paris he met\nElie Cartan\nand in Cambridge, England, he met\nG H Hardy\n,\nAbram Besicovitch\n,\nArthur Eddington\n,\nLeopold Infeld\n, J J Thomson and\nSubrahmanyan Chandrasekhar\n.\nIn\n1935\nUlam received an invitation from\nvon Neumann\nto visit the Institute for Advanced Study in Princeton for a few months. Planning to spend three months there he sailed on the Aquitania from Cherbourg, France to New York arriving on\n7\nJanuary\n1936\n. For more details of the friendship between Ulam and\nvon Neumann\n, see the discussion between Ulam and\nRota\nabout\nvon Neumann\nat\nTHIS LINK\n.\nAt the Institute for Advanced Study Ulam met\nG D Birkhoff\nwho invited him to Harvard University. Ulam said\n(\n[\n30\n]\nor\n[\n31\n]\n)\n:-\n... I went back to Poland, but the next fall I returned to Cambridge as a member of the so-called Society of Fellows, a new Harvard institution. ... I started teaching right away: first, elementary courses and then quite advanced courses. I became a lecturer at Harvard in\n1940\n, but every year during that time\n1935\n-\n39\nI commuted between Poland and the United States. In the summers I visited my family and friends and mathematicians. In Poland mathematical life was very intense, the mathematicians saw each other often in cafes such as the Scottish Cafe and the Roma Cafe. We sat there for hours and did mathematics. During the summers I did this again. And then in '\n39\n, I actually left Poland about a month before World War II started.\nYou can see more about the Scottish Café at\nTHIS LINK\n.\nIt is interesting to look at the forms completed on Ulam's entry to the United States. On the five entry forms, between\n1936\nand\n1939\n, Ulam's height is given as\n5\nft\n11\nin,\n6\nft,\n6\nft,\n5\nft\n8\nin and\n5\nft\n11\nin. The colour of his eyes is given as Brown, Gray, Green, Green, and Green. On the last of these five trips from Poland to the United States, he was accompanied by his brother Adam Ulam who was seventeen years old. Their father, convinced that Poland was about to be attacked by Germany, persuaded Adam to leave with his brother and continue his education in the United States. They sailed from Danzig, now Gdańsk, on\n11\nAugust\n1939\non the\nPiłsudski\n(\nnot the\nBatory\nas Ulam states in\n[\n93\n]\nand many have copied; the\nPiłsudski\nand the\nBatory\nwere sister ships. See, for example,\n[\n100\n]\n)\n. They arrived in New York on\n21\nAugust\n1939\nand, just over a week later, they were staying in a hotel on Columbus Circle in New York when\nWitold Hurewicz\nphoned to tell them that Germany was bombing Warsaw. Before continuing with Ulam's biography, let us say a little about Ulam's family in Lwów.\nUlam's mother, Anna, became ill and made frequent trips to Vienna to consult doctors. She died in Vienna on\n18\nMarch\n1938\n. Ulam's sister, Stefania, married and became Stefania Kruger. She had a child in\n1940\nand continued living in Lwów which at first was taken by the Russians. In June\n1941\nthe Germans attacked Russia and occupied Lwów by\n30\nJune. Michele Jamiolkowski told how Stefania died\n[\n7\n]\n:-\n... together with Stefania Ulam, and her little child, we lived in hiding in the house of a generous Christian woman who gave us hospitality without any compensation. There were three adults in the hideout: my mother Lusia, her father and Stefania, together with two children, myself\n(11\nyears old\n)\nand Stefania's little child. ... our neighbours betrayed us. We were arrested by the Gestapo and brought to the \"Janowski Lager\" in Lwów ... Our generous Christian benefactress was shot and our group brought to a small detention centre called the \"bunker,\" waiting to be shot the following morning at dawn. But the evening before, the commanding officer came to interrogate us. During the inquisition it appeared quite plain that he was open to bribery and that, against compensation, he would carry us to a camp instead of shooting us. Accordingly, my mother took him to a hideaway in Lwów, where she had hidden jewellery and valuable carpets, after recovering which, he decided that the valuables were not of an adequate amount to save everybody's lives. He would only save two individuals from being killed and gave my mother a few hours to make the tremendous choice on whom would be saved from certain death and be taken, instead, to a concentration camp. ... at dawn my mother and myself were brought to the camp, while Stefania, her baby and my grandfather were killed.\nUlam's father was also killed when the Germans occupied Lwów in\n1941\n.\nThe war meant that the Ulam brothers could not get funds from Poland so both had to survive on the small salary that Stan Ulam was receiving. His fellowship at Harvard ran out in\n1939\nbut\nBirkhoff\nappointed him as a lecturer in Harvard for the year\n1939\n-\n40\n. Adam Ulam began his university studies of history at Brown University in September\n1939\n.\nStan Ulam met Françoise Aron at a party in Cambridge, Massachusetts, in the autumn of\n1939\n. Françoise\n(1918\n-\n2011)\nhad been born in Paris on\n8\nMarch\n1918\n, near the end of World War I. She had gone to the United States in August\n1938\nto study at Mills College in California, then was awarded a scholarship to Mount Holyoke college in Massachusetts. Françoise helped the Ulam brothers by cooking meals for them.\nIn\n1940\nUlam was appointed as an assistant professor at the University of Wisconsin. He married Françoise Aron on\n19\nAugust\n1941\nin Madison; they chose the cheap short wedding service conducted by Judge Roy H Proctor in his office. Stan and Françoise had one child Claire Anne Ulam\n(1944\n-\n2020)\nborn\n15\nJuly\n1944\nin Santa Fe, New Mexico. In\n1943\nUlam became an American citizen. In that year\nvon Neumann\nasked him to undertake some very important war work. They agreed to meet\n(\n[\n30\n]\nor\n[\n31\n]\n)\n:-\n... in Chicago in some railroad station to learn a little bit more about it. I went there, and he could not tell me where he was going. There were two guys, sort of guards, looking like gorillas, with him. He discussed with me some mathematics, some interesting physics, and the importance of this work. And that was Los Alamos at the very start. A few months later I came with my wife ... arriving for the first time in a very strange place.\nThe main work going on at the Los Alamos National Laboratory in New Mexico at this time involved the fission bomb. This project was successfully accomplished on\n16\nJuly\n1945\nwith the detonation of the atomic bomb in the New Mexican desert. Ulam, however, worked in Edward Teller's group which was looking beyond the fission bomb, and studying the possibility of a fusion bomb - the hydrogen bomb.\nRota\n[\n74\n]\ndescribes how Ulam's personality changed in\n1946\n:-\nOne morning in\n1946\n, in Los Angeles, Stanisław Ulam, a newly appointed professor at the University of Southern California, awoke to find himself unable to speak. A few hours later, he underwent a dangerous surgical operation after the diagnosis of encephalitis. ... In time, however, some changes in his personality became obvious to those who knew him. ... his ideas, which he spouted out at odd intervals, were fascinating beyond anything I have witnessed before or since. However, he seemed to studiously avoid going into details. ... he came to lean on his unimpaired imagination for his ideas, and on the\n[\nhard work\n]\nof others for technical support. ...\nA crippling technical weakness coupled with an extraordinarily creative imagination is the drama of Stan Ulam. Soon after I met him, I was made to understand that, as far as our conversations went, his drama would be one of the Forbidden Topics. ... But he knew I knew, and I knew he knew I knew.\nWhile Ulam was at Los Alamos, he developed the 'Monte-Carlo method' which searched for solutions to mathematical problems using a statistical sampling method with random numbers. He explained when the idea came to him\n[\n27\n]\n:-\nThe first thoughts and attempts I made to practice the Monte Carlo method were suggested by a question which occurred to me in\n1946\nas I was convalescing from an illness and playing solitaires. The question was what are the chances that a Canfield solitaire laid out with\n52\ncards will come out successfully?\nThe Monte-Carlo method is now widely used in computer implementations of mathematical software. Ulam's\n1949\npaper\n[\n57\n]\ndescribing the Monte-Carlo method, written jointly with Nicholas Metropolis, has the following Abstract:-\nWe shall present here the motivation and a general description of a method dealing with a class of problems in mathematical physics. The method is, essentially, a statistical approach to the study of differential equations, or more generally, of integro-differential equations that occur in various branches of the natural sciences.\nAfter World War II, Ulam returned to Los Alamos to continue working on the hydrogen bomb. This work is described in\n[\n15\n]\n:-\nWorking with physicist Edward Teller, Ulam solved one major problem encountered in work on the fusion bomb by suggesting that compression was essential to explosion and that shock waves from a fission bomb could produce the compression needed. He further suggested that careful design could focus mechanical shock waves in such a way that they would promote rapid burning of the fusion fuel. Teller suggested that radiation implosion, rather than mechanical shock, be used to compress the thermonuclear fuel. This two-stage radiation implosion design, which became known as the Teller-Ulam configuration, led to the creation of modern thermonuclear weapons.\nThis remarkable insight by Ulam should, perhaps, have seen him known as the 'father of the hydrogen bomb', rather than Teller. Françoise Ulam gives the following description of her husband after he solved the problem\n[\n26\n]\n:-\nI found him at home at noon staring intensely out of a window with a very strange expression on his face. I can never forget his faraway look as peering unseeing in the garden, he said in a thin voice, I can still hear it, \"I found a way to make it work.\"\nUlam's insight only came, however, after many hours of calculations done first by himself and J C Everett, then assisted by a group of women computers employed to operate electronic calculators. Ulam wrote\n[\n68\n]\n:-\nEach morning I would attempt to supply several guesses as to the value of certain coefficients referring to purely geometrical properties of the moving assembly involving the fate of the neutrons and other particles going through it and causing, in turn, more reactions. ... We started each day for four to six hours with slide rule, pencil and paper, making frequent quantitative guesses.\nUlam, with J C Everett, also proposed the 'Orion' plan for nuclear propulsion of space vehicles.\nIn\n1963\n, during a boring lecture, Ulam was doodling on his squared notepad. He arranged the positive integers in a square spiral pattern and noticed that when he marked the prime ones they seemed to concentrate themselves in diagonal lines.\nYou can see more about this at\nTHIS LINK\nHe remained at Los Alamos until\n1965\nwhen he was appointed to the chair of mathematics at the University of Colorado. At the time of his death he was professor of biomathematics at the University of Colorado.\nWhen asked to sum up his work, he gave this modest reply\n(\n[\n30\n]\nor\n[\n31\n]\n)\n:-\nOriginally I worked in set theory and some of these problems are still being worked on intensively. It is too technical to describe: measurable cardinals, measure in set theory, abstract measure. Then in topology I had a few results. ... Then I worked a little in ergodic theory. Oxtoby and I solved an old problem and some other problems were solved in other fields later. In general I would say luck plays a part, at least in my case. Also I had luck with tremendously good collaborators in set theory, in group theory, in topology, in mathematical physics, and in other method, which is not a tremendously intellectual achievement but is very useful, a few things like that.\nUlam's writing include\nA collection of mathematical problems\n(1960)\n,\n(\nwith\nMark Kac\n)\nMathematics and logic: Retrospect and prospects\n(1968)\n,\nSets numbers and universes\n(1974)\n,\nAdventures of a Mathematician\n(1976)\n,\nScience, computers, and people from the tree of mathematics\n(1986)\n, and\nAnalogies between analogies\n(1990)\n. For information about the first and later editions of these books, including extracts from reviews and prefaces, see\nTHIS LINK\n.\nHe was described by\nRota\nin the following way\n[\n74\n]\n:-\nUlam's mind is a repository of thousands of stories, tales, jokes, epigrams, remarks, puzzles, tongue-twisters, footnotes, conclusions, slogans, formulas, diagrams, quotations, limericks, summaries, quips, epitaphs, and headlines. In the course of a normal conversation he simply pulls out of his mind the fifty-odd relevant items, and presents them in linear succession. A second-order memory prevents him from repeating himself too often before the same public.\nHis wife, Françoise Ulam, writing in\n[\n97\n]\ndescribed Ulam's working methods:-\nUlam ... is almost exclusively a talking man, a verbal person. When not thinking ... what he enjoys most is to talk, to discuss, to argue, to converse, with friends and colleagues. Relying on his phenomenal memory, he carries everything in his head. ...\nThe physical act of taking pen to paper has always been painful for him. His mind and his eyes are the obstacles. His mind, because it works much faster than his fingers...; his eyes because one is very myopic the other very presbyopic. ... From childhood fears, then from youthful vanity he spurned wearing glasses, until very recently. Thus Ulam has always had a very hard time bringing himself to write anything for publication, either in long hand or with a typewriter. Machines and other mechanical objects have always turned him off. ... How then does he ever produce a written text? Mainly by talking ...\nLet us end with Claire Ulam's childhood comment about her father\n[\n88\n]\n:-\nOne day when little Claire Ulam was watching some children playing ball with their father, a friend asked whether her father ever played like that with her. The answer was an emphatic \"No! No! All my father does is think, think, think! Nothing but think!\"",
  "matematicos_citados_na_biografia": [
    "Einstein",
    "Euler",
    "Sierpinski",
    "Sonia Kovalevskaya",
    "Hugo Steinhaus",
    "Stanislaw Ruziewicz",
    "Stefan Banach",
    "Kazimierz Kuratowski",
    "Kuratowski",
    "Lebesgue",
    "Banach",
    "THIS LINK",
    "Karl Menger",
    "Heinz Hopf",
    "Marcel Grossmann",
    "Elie Cartan",
    "G H Hardy",
    "Abram Besicovitch",
    "Arthur Eddington",
    "Leopold Infeld",
    "Subrahmanyan Chandrasekhar",
    "von Neumann",
    "Rota",
    "G D Birkhoff",
    "Witold Hurewicz",
    "Birkhoff",
    "Mark Kac"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}