{
  "nome_completo": "Stefan Marian Kaczmarz",
  "nome_curto": "Stefan Kaczmarz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kaczmarz/",
  "data_nascimento": "20 March 1895",
  "local_nascimento": "Sambor, Lwów, Austria-Hungary (now Sambir, Ukraine)",
  "data_morte": "after 4 September 1939",
  "local_morte": "Poland",
  "summary": "Stefan Kaczmarz was a Polish mathematician whose work provided the basis for modern imaging techniques, including the CAT scan.",
  "biografia": "Stefan Kaczmarz\n's parents were Mikolaj Kaczmarz, who was a court clerk, and Emilia Smyczynskich. Stefan was one of four children, having a sister Helena and two brothers Roman and Eustace. When he was growing up, Stefan lived first in Kety, in the Silesian foothills east of Bielsko-Biala, where he attended primary school between\n1901\nand\n1905\n. He began his secondary education in the town of Wadowice, about\n20\nkm east of Kety and\n35\nkm south west of Kraków, where he attended the National Junior High School from\n1905\nto\n1907\n. Then the family moved to Tarnów, about\n35\nkm east of Kraków, where he attended the Second National\nGymnasium\nfrom\n1907\nto\n1913\n. He graduated with distinction on\n17\nJune\n1913\n.\nIn September\n1913\nKaczmarz began his studies of mathematics, physics and chemistry at the Jagiellonian University in Kraków. He was taught by\nStanisław Zaremba\n,\nIvan Śleszyński\n,\nMarian Smoluchowski\n,\nKazimierz Żorawski\n, who worked on\ndifferential geometry\nand fluid mechanics, and\nAntoni Hoborski\n, whose main interest was also in differential geometry. However, he was only one year into his university studies when World War I broke out in August\n1914\n. He enlisted in the Polish Regiment on\n1\nSeptember and he was sent to the western front in the spring of\n1915\n. The Russian army had reached a position east of Warsaw and a combined force of German and Austro-Hungarian forces attacked them in an attempt to regain the initiative. Kaczmarz, who was promoted to sergeant in July\n1915\n, was involved in this Carpathian Campaign which was one of the most tragic of the whole war with great loss of life on both sides with little gained in the end. He fought in the Carpathian Campaign until March\n1917\n. He was transferred to the artillery and sent to the front later in\n1917\n. In January of the following year he was sent to the School of Artillery at Walawa near Przemysl. However, when he refused to swear an oath of allegiance to the emperor he was interned by the Austrian authorities, first at Huszt and later at Bustyahaza. He managed to escape and fled but was captured and sent to another internment camp at Witkowice near Kraków.\nAt the end of March\n1918\nKaczmarz was released and he returned to his studies of mathematics, physics and chemistry at the Jagiellonian University in Kraków. He was taught by\nStanisław Zaremba\n,\nIvan Śleszyński\n,\nKazimierz Żorawski\n,\nAntoni Hoborski\n,\nTadeusz Banachiewicz\n,\nAlfred Rosenblatt\n,\nFranciszek Leja\n,\nWitold Wilkosz\nand Wlodzimierz Stozek\n(1883\n-\n1941)\n. He was not free from military duties, however, for in addition to his academic studies he also served in the Academic Battalion in Kraków from November\n1918\nto February\n1919\n. After a period when he was not in any army units, and having by this time completed seven semesters at the university, he volunteered to join the Polish Army in July\n1920\n. After a short time at an army camp for academic volunteers at Rembertów, near Warsaw, he was sent to the School of Artillery in Poznań. He quickly completed the course at the School of Artillery, graduating on\n5\nNovember\n1920\n. He was then transferred to the Reserve Cadets and returned to the Jagiellonian University in Kraków where he completed the necessary qualifications to become a school teacher. On\n1\nOctober\n1921\nhe was appointed as an assistant in the Department of Mathematics at the Academy of Mining in Kraków. In addition to this teaching, Kaczmarz also taught some classes at a girls' school in Kraków.\nAfter Poland became an independent nation in November\n1918\n, the University of Lwów was renamed the Jan Kazimierz University of Lwów in\n1919\n. It was at this time the third largest of the Polish universities\n(\nonly Warsaw and Kraków were bigger\n)\n.\n(\nLwów is now Lviv in Ukraine\n)\nStefan Banach\nhabilitated\nat the university in April\n1922\nand was appointed as an extraordinary professor of mathematics in July of that year.\nHugo Steinhaus\nwas also a professor at the Jan Kazimierz University of Lwów and\nBanach\n, very keen on building a major research centre at Lwów, arranged for an offer of a position to be made to Kaczmarz. He was appointed to the Department of Mathematics in the Faculty of Mechanical Engineering on\n1\nOctober\n1923\nand would remain in Lwów until September\n1939\n. At this stage Kaczmarz did not have a doctorate so, once on the staff at Lwów, he undertook research advised by\nStanisław Ruziewicz\n.\nRuziewicz\nhad been awarded his doctorate from the University of Lwów before the onset of World War I for his study of continuous functions that are not differentiable. On\n13\nOctober\n1924\n, Kaczmarz was awarded his doctorate for his thesis\nThe relationships between certain functional and differential equations\n. He published results from his thesis in his first paper\nSur l'équation fonctionnelle\nf\n(\nx\n)\n+\nf\n(\nx\n+\ny\n)\n=\nϕ\n(\ny\n)\nf\n(\nx\n+\ny\n/\n2\n)\nf (x) + f (x + y) = \\phi(y) f (x + y/2)\nf\n(\nx\n)\n+\nf\n(\nx\n+\ny\n)\n=\nϕ\n(\ny\n)\nf\n(\nx\n+\ny\n/\n2\n)\nⓉ\n(\nOn the functional equation  f\n(\nx\n)\n+ f\n(\nx + y\n)\n= φ\n(\ny\n)\nf\n(\nx + y /\n2)\n)\nwhich appeared in\nFundamenta Mathematicae\nin\n1924\n. In this paper, which contained results discovered in answering one of\nBanach\n's questions, Kaczmarz thanks\nStanisław Saks\nand\nStanisław Ruziewicz\nfor helpful comments.\nOther papers he published, some coauthored with his colleagues at Lwów, are:\nÜber die Konvergenz der Reihen von Orthogonalfunktionen\nⓉ\n(\nOn the convergence of series of orthogonal functions\n)\n(1925)\n,\nÜber die Summierbarkeit der Orthogonalreihen\nⓉ\n(\nOn the summability of orthogonal series\n)\n(1927)\n,\nÜber Reihen von allgemeinen Orthogonalfunktionen\nⓉ\n(\nOn rows of general orthogonal functions\n)\n(1927)\n,\n(\nwith L Nikliborc\n)\nSur les suites de fonctions convergentes en moyenne\nⓉ\n(\nOn series of functions convergent in the mean\n)\n(1928)\n,\nSur la convergence et la sommabilité des développements orthogonaux\nⓉ\n(\nOn the convergence and summability of orthogonal developments\n)\n(1929)\n,\nZur Theorie der Fourierschen Doppelreihe\nⓉ\n(\nOn the theory of Fourier double series\n)\n(1930)\n,\n(\nWith\nH Steinhaus\n)\nLe système orthogonal de M Rademacher\nⓉ\n(\nAn orthogonal system of Rademacher\n)\n(1930)\n,\nIntegrale vom Dini'schen Typus\nⓉ\n(\nIntegrals of Dini's type\n)\n(1931)\n,\nUne remarque sur les séries\nⓉ\n(\nA comment on series\n)\n(1931)\n,\nAxioms for Arithmetic\n(1932)\n,\nOn Some Classes of Fourier Series\n(1933)\n,\nSur les multiplicateurs des séries orthogonales\nⓉ\n(\nOn multipliers of orthogonal series\n)\n(1933)\n,\nNote on general transforms\n(1933)\n,\nNotes on orthogonal series I\n(1934)\n,\nNotes on orthogonal series II\n(1934)\n,\nNotes on orthogonal series III\n(1936)\n,\n(\nwith\nJ Marcinkiewicz\n)\nSur les multiplicateurs des séries orthogonales\nⓉ\n(\nOn multipliers of orthogonal series\n)\n(1938)\n, and\nSur l'irrationalité des intégrales indéfinies\nⓉ\n(\nOn the irrationality of indefinite integrals\n)\n(1939)\n. In\n1935\nKaczmarz published a book,\nTheorie der Orthogonalreihen\nⓉ\n(\nTheory of orthogonal series\n)\n, coauthored with\nHugo Steinhaus\n.\nJ D Tamarkin\nwrites in a review\n[\n5\n]\n:-\nThe present volume of the excellent Polish Series is devoted to the theory of general orthogonal functions of a single real variable. Desiring not to increase the size of the volume without proportionally increasing its usefulness, the authors omitted almost completely the theory and applications of special orthogonal functions including that of orthogonal polynomials, and concentrated their attention on general orthogonal functions as a tool in pure mathematics. Even in this restricted field no claim is made for \"encyclopaedic completeness.\" Despite these somewhat severe restrictions the authors succeeded in presenting a very interesting material widely scattered in the literature, including also some new contributions of their own. ... The exposition, which is in general clear and concise, in some places shows a tendency to be either somewhat vague, or so condensed that it will be difficult to follow for a reader who is not well versed in the field.\nS Verblunsky\n, reviewing the same book, writes\n[\n6\n]\n:-\nThis book gives a good account of recent researches in orthogonal series, and may be recommended not only to specialists in that subject but also to those interested in trigonometric series and in linear operations. The book is interesting throughout. The authors have done much to simplify the proofs; the most striking characteristic of the book is the effective, indeed the triumphant, use of the theory of linear operations. ... In taking leave of this book, let me thank the authors for a few weeks' interesting, if strenuous, reading matter. I look forward to seeing a second edition, with the misprints corrected, the obscurities elucidated and the language embellished.\nOn\n26\nDecember\n1928\n, Kaczmarz married Helena Firlicinska\n(1904\n-\n1994)\nat the parish church in Nowy Sacz, south east of Kraków. Helena was a primary school teacher in the village of Kasinka Mala, which is south of Kraków and west of Nowy Sacz. On\n4\nJanuary\n1930\ntheir first child, a daughter Krystyna, was born. Their second daughter, Zbyslawa, was born on\n6\nOctober\n1931\n. Shortly after the birth of their second child, Kaczmarz was awarded a scholarship by the National Culture Fund to finance a visit to Cambridge, England, and to Göttingen, Germany. He spent the first half of\n1932\nwith\nG H Hardy\nand\nR E A C Paley\nin Cambridge, where he attended lectures by\nNorbert Wiener\non\nFourier\ntransforms and applications. He then spent two months in Göttingen before returning to Poland.\nFrom\n1923\nto\n1939\nKaczmarz taught many university level courses at Lwów such as: Analytical Geometry, Higher Analysis, Integral Equations, Algebraic Curves, Trigonometric Series, Non-Euclidean Geometry and the Theory of Groups, and Differential Geometry. He also taught various courses on applied mathematics as well as mathematics courses for students of the natural sciences. In addition to teaching at university level, Kaczmarz taught in the local secondary schools where his work received the highest praise.\nThere are a number of aspects of Kaczmarz's mathematical contributions that we must mention in addition to those mentioned above. There is Kaczmarz's algorithm for the approximate solution for systems of linear equations which appears in his paper\nAngenäherte Auflösung von Systemen linearer Gleichungen\nⓉ\n(\nApproximate resolution of systems of linear equations\n)\npublished in the\nBulletin International de l'Académie Polonaise des Sciences et des Lettres\nin\n1937\n. The paper was presented to the\nBulletin\nby\nTadeusz Banachiewicz\nin May\n1937\n. The iterative algorithm which Kaczmarz gave has proved particularly useful in applications, particularly to modern imaging technologies. A topic which Kaczmarz was embarking on at the time war broke out was a theoretical study of the curvature of railway tracks. A train had been derailed near Lwów due to taking a bend too quickly and this may have given him the motivation to start this study.\nKaczmarz's greatest pleasure, other than mathematics, was to walk in the mountains. Every summer, along with his wife and daughters, he would visit family friends in the Bieszczady mountains. His colleagues described him as \"tall and skinny\", \"calm and quiet\", and a \"modest man with rather moderate scientific ambitions.\" They also said what an excellent person he was in mathematical cooperations. He received a number of honours, both for his scientific work and for his support of Polish Independence. He received the Independence Medal on\n29\nApril\n1929\n, the Independence Cross in\n1933\n, the Golden Cross of Merit for his contribution to science in\n1937\n, and the Bronze Medal for Long Service to the University of Lwów in\n1938\n.\nThe details of Kaczmarz's death are unclear. At the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. On\n1\nSeptember\n1939\nGerman troops invaded Poland. On the following day Kaczmarz was assigned to Warsaw as a lieutenant in the reserve. He left Lwów by train on\n3\nSeptember, already in military uniform, on his way to Warsaw. He sent a postcard to his wife Helena from Nisko on evening of the following day saying that he hoped for a good night's sleep in Nisko before continuing the journey. No further information was received from him and there are three different versions as to how he died. The first is that he died at Umiastów, a village about\n20\nkm to the west of Warsaw. In this version, he was killed in fighting against the German advance towards Warsaw. The Germans captured Warsaw on\n27\nSeptember. The second version is that Kaczmarz was killed by the Russians in the Katyn massacre in April or May\n1940\n. The third version is that he was killed on\n5\nSeptember by a German bombing raid on the train in which he was travelling, shortly after the train left Nisko heading for Warsaw. Certain evidence supports all three of these claims\n(\nalthough of course at most one can be correct\n)\n, and this is fully detailed in Lech Maligranda's article\n[\n1\n]\n. It would appear that the theory he died in the Katyn massacre is the least likely of the possibilities, and that almost certainly Kaczmarz died in September\n1939\n.\nStanisław Ruziewicz\n, Kaczmarz's thesis advisor, also died during the war.\nWacław Sierpiński\nwrote:-\nIn July\n1941\none of my oldest students Stanisław Ruziewicz was murdered. He was a retired full professor of Jan Kazimierz University in Lwów, the last rector of the Foreign Trade Academy in Lwów, an outstanding mathematician and an excellent teacher.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Stanisław Zaremba",
    "Ivan Śleszyński",
    "Marian Smoluchowski",
    "Kazimierz Żorawski",
    "differential geometry",
    "Antoni Hoborski",
    "Tadeusz Banachiewicz",
    "Alfred Rosenblatt",
    "Franciszek Leja",
    "Witold Wilkosz",
    "Stefan Banach",
    "habilitated",
    "Hugo Steinhaus",
    "Banach",
    "Stanisław Ruziewicz",
    "Ruziewicz",
    "Stanisław Saks",
    "H Steinhaus",
    "J Marcinkiewicz",
    "J D Tamarkin",
    "S Verblunsky",
    "G H Hardy",
    "R E A C Paley",
    "Norbert Wiener",
    "Fourier",
    "Wacław Sierpiński"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}