{
  "nome_completo": "Stein Arild Stromme",
  "nome_curto": "Stein Arild Stromme",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stromme/",
  "data_nascimento": "12 March 1951",
  "local_nascimento": "Oslo, Norway",
  "data_morte": "31 January 2014",
  "local_morte": "Lambertseter, Norway",
  "summary": "Stein Stromme was a Norwegian mathematician best known for his work in algebraic geometry",
  "biografia": "Stein Arild Stromme\n's parents were Sigmund Elling Stromme\n(\nborn\n8\nApril\n1923\n, Vardo, Finnmark, Norway; died\n26\nMarch\n2008\n, Oslo, Norway\n)\nand Inger Johanne Hafsahl Karset\n(\nborn\n27\nJune\n1925\n; died\n22\nFebruary\n2001)\n. Sigmund Elling Stromme was a publisher spending most of his career with J W Cappelen Publishing, one of the oldest publishing houses of Norway founded in\n1829\n. He was Managing Director,\n1973\n-\n1987\n, and Chairman,\n1987\n-\n1997\n. He was Chairman of the Norwegian Publishers,\n1981\n-\n1984\n. Stein's mother, Inger Johanne Stromme, was a school teacher.\nWe give a brief indication of Stein Arild Stromme's career based on a short obituary in a local newspaper, texts read at his funeral, and Stromme's own CV\n[\n1\n]\n. The obituaries and funeral oration are given in\n[\n4\n]\nin an English translation.\nStein Arild Stromme studied at the Oslo katedralskole\n(\nthe Oslo Cathedral School\n)\n. This ancient school, founded in\n1153\n, had several famous mathematicians among its pupils including\nCaspar Wessel\nand\nNiels Henrik Abel\n. At this school, Stromme studied Norwegian, mathematics, physics, history, English, and physical education. He was awarded his Examen Artium, the university entrance qualification, in\n1970\n. He then entered Oslo University to study mathematics. He was awarded his Candidatus magisterii\n(\nCandidate of Arts\n)\n, the Cand. Mag. degree, in\n1972\nand his Candidatus realium, the Cand. real. degree, in\n1976\n. The Candidatus realium was a Norwegian degree, only awarded in mathematics or natural sciences, which normally took\n7\nto\n8\nyears to complete and involved writing an original dissertation. Essentially equivalent to a Ph.D., it was replaced in Norway by a different degree in\n1985\n. After being awarded the Cand. real. degree, Stromme was appointed as a Research associate at the University of Oslo and there he worked towards his Dr. philos. degree. This doctorate is similar in standard to the D.Sc. or\nhabilitation\n. He was awarded the Dr. philos. degree by the University of Oslo in\n1983\n. During the time he was studying at Oslo he spent several periods abroad undertaking research. These included a research visit to the Mittag-Leffler Institute in Stockholm during the autumn of\n1978\n, and he spent\n1979\n-\n80\nin the United States as a research associate at the University of California, Berkeley. In the early\n1970\ns, he married and had one son Kjetil who followed his grandfather into the publishing business.\nStromme's first paper, published in\n1981\n, was\nStable rank-\n2\nvector bundles on\nP\n3\nw\ni\nt\nh\nc\n1\n=\n0\n<\ni\n>\na\nn\nd\n<\n/\ni\n>\nc\n2\n=\n3\n\\mathbb{P}^{3} with c_{1} = 0 <i>and</i> c_{2} = 3\nP\n3\nw\ni\nt\nh\nc\n1\n​\n=\n0\n<\ni\n>\na\nn\nd\n<\n/\ni\n>\nc\n2\n​\n=\n3\n. It was written jointly with Geir Ellingsrud. In fact, more than half of Stromme's research papers were written jointly with Geir Ellingsrud\n(\nborn\n29\nNovember\n1948)\nwho, as we just mentioned, was his brother-in-law. Ellingsrud had studied at the University of Oslo and taught at Stockholm University\n(1982\n-\n84)\n, the University of Oslo\n(1984\n-\n1989)\n, and the University of Bergen\n(1989\n-\n93)\nbefore returning to the University of Oslo\n(1993\n-\n)\n. Stromme's next four papers were all single authored:\nDeforming vector bundles on the projective plane\n(1983)\n,\nA note on tau-constant families of plane curves\n(1984)\n,\nAmple divisors on fine moduli spaces on the projective plane\n(1984)\n, and\nFamilies of rational plane curves\n(1984)\n.\nAfter the award of his Dr. philos. degree, Stromme was appointed as a Senior lecturer at the University of Bergen in\n1983\n. He was promoted to full professor in\n1993\nand held this position for the rest of his career. He did hold a number of visiting professorships: Brigham Young University in Provo, Utah, USA\n(\nautumn\n1988)\n, University of Utah, Salt Lake City, Utah, USA\n(1991\n-\n92)\nand the University of Chicago\n(\nspring\n1998)\n. In\n1999\nhe was appointed as Head of the Mathematics Institute at the at the University of Bergen. During the eleven years he held this position\n[\n4\n]\n:-\n... major changes took place at the Institute: there were many new appointments to replace people who had retired and this happened under important changes in the funding and teaching at universities. Stein Arild created the balanced and strong research institute that we have today. A book has been written about being a head of department. It says you must expect to make one enemy for each year in office. Stein Arild managed the feat of renewing the department while still remaining friends with his colleagues. He was a member of the science faculty council consisting of deans, the director and other science department heads and he was highly respected in this group. Stein Arild was a man of quiet manner. He sensed rather than pushed his way through.\nLet us quote Stromme's own account of his research interests\n[\n1\n]\n:-\nAlgebraic geometry, in particular intersection theory, geometric\ninvariant theory\n, moduli spaces, enumerative geometry, connections to string theory, vector bundles, effective methods in intersection theory and enumerative geometry, computer aided intersection theory, algebraic combinatorics and\nrepresentation theory\n.\nA detailed account of his mathematical contributions, in particular his development of the Maple package 'Schubert', are given in\n[\n4\n]\n. The 'Schubert' package supports computations in intersection theory and enumerative geometry.\nStromme was an organiser of many conferences held at the\nSophus Lie\nCentre. Beginning in\n1996\n, the universities of Bergen, Oslo and Trondheim organised summer schools in Nordfjordeid. They covered a wide range of topics all with an algebraic theme. The village of Nordfjordeid is on the west coast of Norway, set among fjords and mountains in an area of stunning natural scenery. It is a place with a great significance for mathematicians since it was the birthplace of\nSophus Lie\n. It is a truly delightful place to hold a mathematical meeting, a place that all participants enjoy. Stromme was an organiser of many of the Summer Schools: Deformation theory\n(1996)\n; Representation theory for\nLie\n-algebras\n(1997)\n; Reflection groups\n(1998)\n; Initial ideals\n(1999)\n; Elliptic curves, finite fields and cryptography\n(2000)\n; Motivic Homotopy theory\n(2002)\n; Algebraic Combinatorics\n(2003)\n; Modular forms\n(2004)\n; Representation theory for finite groups\n(2005)\n; and Algebraic statistics, tropical geometry and computational biology\n(2006)\n.\nIn\n1988\nStromme received an award for excellence in research from the Norges almenvitenskapelige forskningsrad\n(\nNAVF\n)\n, the Norwegian research council that funds the natural sciences. This award gave Stromme funds which he administered jointly with Geir Ellingsrud and Christian Peskine. Among the projects funded with this award we mention a Bergen conference over two weeks with\n52\nparticipants in\n1989\n, as well as funding several long term and short term visitors to the University of Bergen. In the same year as he received the award, Stromme's second son was born. His second wife was Leikny and their son Torstein Jarl was born in\n1988\n.\nAmong his many mathematical activities, we mention his period as Managing editor of the journal\nActa Mathematica\nfrom\n1997\nto\n2000\n.\nIn August\n2009\nStromme had an unusual headache and went to see his doctor and an MRI scan was arranged. While waiting for the scan to take place he felt well again and, on\n3\nSeptember, gave the talk\nCohomology of linear graphs\nin the weekly algebra seminar. However, the MRI scan revealed problems. By November a cancerous tumour had been identified in his brain and he underwent major surgery. After a period of radiation and chemotherapy he returned to work in January\n2010\nand resumed his teaching duties. However, he stepped down as head of department in\n2010\n. He underwent routine scans which were clear until February\n2013\nwhen a malignant tumour was seen\n[\n4\n]\n:-\nWhen he stepped down as head of department and the disease seized him, we especially noticed how much he cherished his colleagues. We nevertheless understood when he moved to Oslo and Lambertseter during his last year, to be close to his family.\nHis final time was very difficult. He spent time in Lambertseter nursing homes, the Norwegian Radium Hospital, and a period at Hospice Lovisenberg\n(\na hospital for cancer patients in the final stage\n)\n. After his death a funeral was held at Lambertseter church on Friday\n7\nFebruary\n2014\n.",
  "matematicos_citados_na_biografia": [
    "Caspar Wessel",
    "Niels Henrik Abel",
    "habilitation",
    "invariant theory",
    "representation theory",
    "Sophus Lie",
    "Lie"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}