{
  "nome_completo": "Taira Honda",
  "nome_curto": "Taira Honda",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Honda/",
  "data_nascimento": "2 June 1932",
  "local_nascimento": "Fukui, Japan",
  "data_morte": "15 May 1975",
  "local_morte": "Osaka, Japan",
  "summary": "Taira Honda was a Japanese mathematician who made important contributions to number theory.",
  "biografia": "Taira Honda\nbegan his university studies in\n1951\nwhen he entered Tokyo University. He joined T Tamagawa's seminar his\n1954\n-\n55\nwhich was his final undergraduate year. After graduating in\n1955\nhe continued to study at Tokyo University, undertaking research supervised by Tamagawa.\nIn the autumn of\n1955\nan International Symposium on Algebraic Number Theory was held in Japan. This was an important event as\nIyanaga\nrelates in\n[\n1\n]\n:-\nMathematicians like\nE Artin\n,\nChevalley\nand\nA Weil\ncame to our country for this occasion, and significant contributions to long-standing problems of the theory of complex multiplication by\nGoro Shimura\nand\nYutaka Taniyama\nas well as by\nA Weil\nwere reported at the Symposium. These circumstances surely had a strong influence on the mathematical formation of Honda in addition to the personal direction given to him by Tamagawa.\nHonda published his first paper\nIsogenies, rational points and section points of group varieties\nin\n1960\n[\n1\n]\n:-\nHe restudied and generalised the mathematical theories of\nKummer\nfields and of cyclotomic fields from the standpoint of abelian varieties over algebraic number fields.\nHonda's next three papers all considered the problem of class numbers of\nalgebraic number fields\n. Then in\n1966\nhe published an important paper which began his study of applications of the theory of commutative formal groups to the arithmetical theory of abelian varieties. The main ideas of his doctoral thesis, which continued work which appeared in his first paper, was published in\n1968\n.\nIsogeny classes of abelian varieties over finite fields\nappeared in\nJournal of the Mathematical Society of Japan\nin\n1968\n. In this important paper Honda gives a complete classification of Abelian varieties up to isogeny over a finite field. The paper built on work of\nJ Tate\nwhich had been published two years earlier and used results of\nShimura\nand\nTaniyama\nin its proof. An important consequence is that Honda was able to give a short proof of Manin's conjecture about formal groups.\nFurther work on the class numbers of algebraic number fields saw Honda prove that there are infinitely many real quadratic fields whose class numbers are divisible by\n3\nand also to classify those\nn\nn\nn\nfor which the class number of\nQ\n(\n3\n√\nn\n)\n\\mathbb{Q}(^{3}√n)\nQ\n(\n3\n√\nn\n)\nis a multiple of\n3\n. In\n1970\nhe published\nOn the theory of commutative formal group\n. Many more papers on formal groups followed, in particular relating them to the zeta function.\nWe have described Honda's mathematical research, which was mainly devoted to the investigation of the arithmetic properties of commutative formal groups. However we have not yet described his career following his postgraduate work. He was appointed to Osaka University in\n1961\nand then to Osaka City University in\n1974\n. Shortly after that, however, his brilliant career was cut short when he took his own life.\nIyanaga\nwrites in\n[\n1\n]\nthat Honda was:-\n... a most active mathematician, beloved by his colleagues and students as well as by his family. Most unfortunately, he took his own life for some unknown reason in May\n1975\n.\nDescribing Honda's personality,\nIyanaga\nwrites:-\nAlways frank and friendly, he was popular among both his colleagues and students.",
  "matematicos_citados_na_biografia": [
    "Iyanaga",
    "E Artin",
    "Chevalley",
    "A Weil",
    "Goro Shimura",
    "Yutaka Taniyama",
    "Kummer",
    "algebraic number fields",
    "J Tate",
    "Shimura",
    "Taniyama"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}