{
  "nome_completo": "Michel Pierre Talagrand",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Talagrand/",
  "data_nascimento": "15 February 1952",
  "local_nascimento": "Béziers, Hérault, France",
  "data_morte": null,
  "local_morte": null,
  "summary": "Michel Talagrand is a French mathematician who has made extraordinary contributions to several areas of probability theory. These contributions are both in his research results and in the exceptional books he has written. He has won many major prizes including the Shaw Prize (2019) and the Abel Prize (2024) .",
  "biografia": "Michel Talagrand\nis the son of Pierre Clément Joseph Talagrand\n(1925\n-\n2019)\nand Raymonde Paulette Molly-Mitton\n(1924\n-\n1976)\n. Pierre was born on\n10\nNovember\n1925\nin Lozère, France to Clément Jean Baptiste Félix Talagrand\n(1902\n-\n1981)\nand Noémie Marie Victorine Gibelin\n(1894\n-\n1981)\n. Clément had little education and, after many varied jobs, became a railway worker. Noémie never learnt to write. Pierre's teacher, however, persuaded his parents to keep him in school rather than work to help support the family. He became a professor of mathematics at a Lycée. Raymonde also came from a poor family but studied French and became a school teacher. Pierre and Raymonde were married in\n1950\nand Michel, born in\n1952\nin Béziers, southern France, was their first child.\nIn\n1955\nthe family moved to Lyon when Pierre Talagrand became a mathematics professor at the Lycée du Parc. They built a house in Caluire-et-Cuire, the fifth-largest suburb of the city of Lyon. In\n1957\nMichel lost the sight of his right eye when he suffered from a retinal detachment. From\n1958\nto\n1961\n, Michel attended the École de Vassieux in Caluire-et-Cuire. He developed some interest in science through reading a scientific magazine to which his father subscribed. His performance at the school was, however, very poor\n[\n56\n]\n:-\nMy spelling and grammatical skills were terrible. This was unfortunate, because at the time students were evaluated largely on their spelling skills. ... I could not spell, and therefore I was a bad student, and therefore I should not have been admitted to junior high school.\nTalagrand was fortunate since his father was a mathematics professor at the Lycée du Parc, the best high school in Lyon, and was able to persuade the head of the school to admit his son to the Lycée du Parc in\n1961\n. Although he was admitted, he was put into one of the lowest sections alongside pupils who had no interest in learning. As a consequence, the class was taught by poorly qualified teachers. Talagrand was at best an average pupil, more interested in playing with his fellow pupils than with learning. His father tried to encourage him by teaching him some mathematics, showing him some basic group theory, but it did little to encourage him. Everything changed, however, after he suffered a terrible misfortune at the age of fifteen.\nFor the ten years from five to fifteen he had lived rather differently from other children since, with only sight in one eye, he had not done any sport for fear that he would lose the sight in that eye. Just before his fifteenth birthday, the retina in his left eye began to detach. He suffered continuing problems, including a six month stay in hospital trying to save the sight of his left eye. Although his eyes were bandaged and he could not see, his father came to the hospital every evening and taught him mathematics. The abstract nature of mathematics meant that he could learn without being able to see. Returning to his studies at the Lycée du Parc, he was able to drop language studies and concentrate on science subjects. This was made possible by his father pleading on his behalf with the head of the Lycée.\nTalagrand now lived with the continual fear of losing his sight; it had the effect that he put all his efforts into learning mathematics, the subject at which he was best. Back at the Lycée, he was now an excellent student in mathematics and physics. He benefitted from the fact that in the classes for older pupils he was taught by well-qualified teachers. His attitude to learning now completely changed and he was enthusiastic and diligent, attempting to solve every problem in the textbook. He complained to his mathematics teacher that the examinations were too easy and she then put harder bonus questions into the papers especially for him.\nIn his final year at the Lycée du Parc he sat the Concours Général and was ranked the third best student in France in both mathematics and physics. The natural route for high achievers would now have meant two years of study to prepare for entry to one of the Paris Grandes Écoles. Talagrand parents, however, thought that this highly demanding route would be too stressful given his severe health problems. Consequently, in\n1969\nhe entered his local university, the Université Claude Bernard: Lyon\n1\n; he thrived at this university\n[\n21\n]\n:-\n... at the University of Lyon I was saved again by the high level of the lectures. I would even say too high, because it was too difficult for most of the students, but it saved me, because I could learn things in the proper way. In particular, I took a course in measure theory. I fell in love with measure theory, that was my first mathematical love, and it greatly influenced me during the rest of my life.\nBeing in continual fear that he would go blind, Talagrand felt that he had to obtain a government position and the best for him would be, like his father, a teacher at a Lycée. The route to this was the Agrégation de Mathématiques, the national competition by which secondary school mathematics teachers are selected in France. He therefore put all his efforts into preparing to sit the Agrégation; he scored\n318\nout of\n320\n, a remarkable achievement. By a stroke of good fortune, although he had not undertaken any research at this time, he had already been accepted for a position at the CNRS, the French National Centre for Scientific Research, in\n1974\n. Let us explain the good fortune.\nFrance was still experiencing the so-called \"thirty glorious years\",\n1945\n-\n1975\n. The French economy was growing at\n5\n% a year and there was money for\n17\nnew positions at the CNRS in the year\n1974\n; many more than there were a couple of years later. To fill these positions they would have to hire a very small number of people without research experience. Jean Braconnier\n(1922\n-\n1985)\n, an expert in topological groups and harmonic analysis, was director of the new mathematics teaching and research unit at the University of Lyon. Before Talagrand sat the Agrégation examinations, he suggested that he apply for one of the CNRS research positions.\nJean-Pierre Kahane\nwas on the CNRS hiring committee and, after receiving Talagrand's application with strong recommendations from four Lyon University professors, he wrote to Talagrand asking him to say why they should hire him. Talagrand wrote a long letter explaining his health problems and his achievements; he was offered a research intern position which he quickly accepted.\nTalagrand joined\nGustave Choquet\n's seminar at the Université Paris VI where he undertook research advised by\nChoquet\n[\n55\n]\n:-\nI didn't know anything at all when I arrived in\nChoquet\n's seminar where people have been doing this kind of mathematics for years. I sit there and I have no idea what they are talking about. There's no easy solution because I asked for a paper that I could read, I looked at the paper and in the introduction it mentioned ten other papers which I had no idea about so it was difficult to start.\nHe went to\nChoquet\nand asked him to give him some research problems. He solved some quickly and\nChoquet\nwas impressed and, perhaps even more importantly, it gave Talagrand the confidence he needed. In\n1975\nhe defended his thèse de\n3\ne cycle,\nSommes vectorielles d'ensembles de mesure nulle: Convolution de mesures portées par des surfaces convexes sur une conjecture de H H Corson\nⓉ\n(\nVector Sums of Sets of Zero Measure: Convolution of Measures Carried by Convex Surfaces on a Conjecture of H H Corson\n)\n. He announced results in\nComptes Rendu\nin\n1975\nand published the\n36\n-page paper\nSommes vectorielles d'ensembles de mesure nulle\nⓉ\n(\nVector Sums of Sets of Zero Measure\n)\nin the\nAnnales de l'Institut Fourier Université de Grenoble\nin\n1976\n. He begins the paper as follows:-\nOur starting point was a question posed in\n1973\nat the Introductory Seminar on Analysis by M Goullet de Rugy: If an analytic set A of R is such that for every compact set X in R, with zero\nLebesgue\nmeasure, A + X is also of zero measure, is A countable? We will provide a positive answer to this problem and study its generalisations to\nLie\ngroups and locally compact abelian groups.\nI would like to thank M\nChoquet\nfor the invaluable help he provided me, on the one hand through his unwavering moral support, and on the other hand by suggesting that the framework of\nLie\ngroups concealed the true nature of the problem, and by proposing a much more suitable one, which led me to Theorem\n3\n.\nAlso in\n1975\nhe published the three papers:\nSolution d'un problème de R Haydon\n;\nSur une conjecture de H H Corson\nⓉ\n(\nOn a Conjecture of H H Corson\n)\n; and\nConvolution de mesures portées par une surface convexe\nⓉ\n(\nConvolution of Measures Carried by a Convex Surface\n)\n. He was awarded his doctorate in\n1977\nafter defending his thesis\nMesures invariantes, compacts de fonctions mesurables et topologie faible des espaces de Banach. Tome\n1\n: Simplexes de mesures invariantes. Tome\n2\n: Compacts de fonctions mesurables; espaces de Banach faiblement K-analytiques\nⓉ\n(\nCompacts of Measurable Functions and Weak Topology of Banach Spaces. Volume\n1\n: Simplexes of Invariant Measures. Volume\n2\n: Compacts of Measurable Functions; Weakly K-Analytic Banach Spaces, Invariant Measures\n)\n. We note that MathSciNet lists\n34\npapers which Talagrand published between\n1975\nand\n1978\n.\nIn\n1978\nTalagrand was awarded the Bronze Medal by the CNRS:-\nThe Bronze Medal recognises a researcher's first work, establishing them as a talented specialist in their field. This award represents an encouragement from the CNRS to pursue well-established and already fruitful research.\nTalagrand was invited to spend the autumn of\n1978\nat the University of British Columbia in Vancouver. He greatly enjoyed the visit and he decided to visit a number of places in North America where people he knew were working before returning to France. One of these people was Joseph Diestel\n(1943\n-\n2017)\n, an expert in functional analysis, particularly\nBanach\nspace theory and the theory of vector measures, who was Professor of Mathematics at Kent State University, Ohio. While Talagrand was talking to Diestel in his office, a PhD student, Wansoo Rhee, came to give Diestel a draft of her thesis on probability theory,\nStudies on the Rate of Convergence in the Central Limit Theorem\n. Talagrand wrote\n[\n56\n]\n:-\nI was fascinated, so I arranged lunch with her. After having talked to her I felt madly in love, and remain so to this day. I proposed to her almost immediately. \"You are crazy\" she said. It only took three years and many flights, including a long stay in Korea, to convince her that I was not.\nTalagrand was back at Kent State University in\n1979\nwhen he attended the 'International conference of\nBanach\nspaces and classical analysis' organised by Joe Diestel in August\n1979\n. He wrote\n[\n57\n]\n:-\nI have fond memories of the first class\nBanach\nSpaces conference in Kent that Joe organised in the summer of\n1979\n. I arrived in Kent several weeks before the conference, and, without my asking, Joe managed to fund my stay in a royal way: he did care about people.\nMichel Talagrand and Wansoo Rhee were married in Franklin, Ohio on\n28\nDecember\n1981\n. Wansoo Theresa Rhee had been born in South Korea on\n13\nApril\n1950\n. Talagrand said\n[\n21\n]\n:-\n... her father, who was a very prominent scholar in South Korea, had taught his children that the only real value in life is scholarly knowledge. For a mathematician to find a wife who has been told that as a child, this is an absolute miracle. She always totally respected my work, and I wouldn't be here without her constant support.\nMichel Talagrand and Wansoo Rhee have two sons, Eugene Rhee Talagrand\n(\nborn\n3\nOctober\n1983)\nand Daniel Rhee Talagrand\n(\nborn August\n1986)\n. Speaking about his family, Talagrand said\n[\n65\n]\n:-\nThe most precious resource in life is time. I manage my time very well. You can ask my children, even though I was doing mathematics, I spend a lot of time with them. Time and mental energy is what is in short supply for mathematicians. Time together with the family is number one priority.\nWe note that MathSciNet list\n29\npapers co-authored by Michel Talagrand and Wansoo Rhee. The first is\nOn Berry-Esseen type bounds for m-dependent random variables valued in certain Banach spaces\n(1981)\nand the\n29\nth is\nThe random weighted interval packing problem: the intermediate density case\n(2000)\n.\nBefore his marriage, however, Talagrand had avoided going blind because of what turned out to be a very fortunate incident. In\n1981\nhe made a trip to India and, when in a train station, someone had cut through his bag with a razor blade and stolen his camera lenses and sunglasses. He had been terrified of losing his sight since the age of fifteen but had reacted to it as he grew older by stopping going to an ophthalmologist for a check up. Back in France he had to visit an ophthalmologist to get a prescription for new sunglasses. She insisted he made an appointment to have his retina checked. This showed his retina were about to detach. By this time laser surgery was able to ensure that he would have no further problems. Had he not had this check, he would have become blind in a few months time.\nTalagrand is famed for his extraordinary contributions to probability theory but, up to the early\n1980\ns he had not worked on this topic. In interviews he has given after winning major prizes for his work on probability theory he has played down the contributions he made in the first ten years of his research career, but this were of a very high standard as is evidenced by his being awarded the Bronze Medal by the CNRS in\n1978\n, the Peccot-Vimont Prize by the Collège de France in\n1980\n, and the Servant Prize by the\nAcadémie des Sciences\nin\n1985\n. His move towards probability, in particular to the boundedness of stochastic processes and concentration of measure, was, in large part, due to\nGilles Pisier\nand Vitali Milman. His move towards probability started, however, with his work on measure theory. This was influenced by David Fremlin\n(\nborn\n1946)\nwho worked at the University of Essex, Colchester, England, but held temporary positions at the Université Paris VI in the late\n1970\ns and early\n1980\ns. Fremlin and Talagrand wrote seven joint papers between\n1978\nand\n1985\n, the first, with\nJean Bourgain\nalso a co-author, being\nPointwise compact sets of Baire-measurable functions\n(1978)\nwhich begins:-\nIn this paper we study sets of real-valued functions defined on a topological space which lie within some class of \"measurable\" functions and satisfy some criterion of compactness or relative compactness in that class, which is always given the topology of \"pointwise\" or \"simple\" convergence.\nThe last of the seven papers is\nSubgraphs of random graphs\n(1985)\nin which, among many other results, Fremlin and Talagrand prove a long-standing conjecture of\nErdős\n.\nTalagrand's first book\n[\n47\n]\nwas a measure theory work with title\nPettis integral and measure theory\n(1984)\n. He writes in the Introduction:-\nI was introduced to this kind of measure theory by D H Fremlin back in\n1976\n. This work contains many of his results and is considerably influenced by his powerful ideas. Part of the research presented here, as well as the actual writing of the book was done while I visited the Department of Mathematics at The Ohio State University.\nJ J Uhl, Jr, who co-authored the book\nVector Measures\n(1977)\nwith Joseph Diestel, reviewed Talagrand's book and writes\n[\n62\n]\n:-\nThe memoir is pleasing to read because it begins with elementary material and becomes increasingly deeper and deeper, thus allowing a reader to complete it or to bail out at the right time. ... This impressive memoir will leave its imprint on measure theory for a long time.\nFor more information about this book, and eight other books by Talagrand, see\nTHIS LINK\n.\nWe mentioned above\nGilles Pisier\nand Vitali Milman as two people who were major influences in Talagrand studying the boundedness of stochastic processes and concentration of measure.\nPisier\nwas appointed as a professor at the Université Paris VI in October\n1981\nand he introduced Talagrand to the problem of characterising the boundedness of Gaussian processes. Talagrand soon was highly successful and wrote the paper\nRegularity of Gaussian processes\n(1987)\n. Michael Marcus, in a review of this paper, writes:-\nIn this paper the author obtains necessary and sufficient conditions for the continuity or boundedness of a Gaussian process. ... This is a deep and important paper. An understanding of it is essential for any further serious research in Gaussian processes.\nFrom\n1985\nTalagrand was CNRS Director of Research in the Equipe d'analyse fonctionnelle at the Mathematics Institute of Jussieu, the largest research centre for fundamental mathematics in France. Also from\n1985\n, he spent part of each year at Ohio State University.\nTalagrand has won many major awards for his outstanding contributions including the Line and Michel Loève International Prize in Probability\n(1995)\n, the\nFermat\nPrize\n(1997)\n:-\n... for his fundamental contributions in various domains of probability,\nthe  Shaw Prize\n(2019)\n:-\n... for his work on concentration inequalities, on suprema of stochastic processes and on rigorous results for spin glasses,\nthe\nStefan Banach\nMedal\n(2022)\n:-\n... for groundbreaking results in functional analysis, the theory of\nBanach\nspaces, probability theory and in statistical mechanics: the theory of \"spin glasses,\nand the\nAbel\nPrize\n(2024)\n:-\n... for his groundbreaking contributions to probability theory and functional analysis, with outstanding applications in mathematical physics and statistics.\nFor more information about why Talagrand was awarded these prizes, see\nTHIS LINK\n.\nOf course, these prizes came with a substantial monetary award. He set up the Wansoo Rhee and Michel Talagrand Foundation and endowed it with his prize money. It is required to create a future mathematics prize in probability, functional analysis, theoretical computer science, or combinatorics. It will be awarded every two years, starting in\n2032\n, when he will be\n80\nyears old, or one year after his death if he dies earlier.\nIn addition to these awards and prizes we should mention other honours given to Talagrand. He was invited to lecture in Section\n9\n: Operator Algebras and Functional Analysis at the International Congress of Mathematicians in Kyoto, Japan in August\n1990\n. He gave the lecture\nSome Isoperimetric Inequalities and Their Applications\n. He introduced his lecture as follows:-\nConsider a product of measure spaces, provided with the product measure. Consider a subset A of this product, of measure at least one half. An important fact\n(\nthe so-called concentration of measure phenomenon\n)\nis that even a small \"enlargement\" of A has measure very close to one. The inequalities we present describe this phenomenon for several notions of \"enlargement\".\nHe was invited again to lecture to the International Congress of Mathematicians, this time to deliver a one-hour plenary lecture to the Congress in Berlin in August\n1998\n. He gave the lecture\nHuge Random Structures and Mean Field Models for Spin Glasses\n. The paper based on his lecture in the\nProceedings\nof the Congress has the following Abstract:-\nTo explain\n(\nat least qualitatively\n)\nthe unconventional magnetic behaviour of certain materials, the physicists have been led to formulate and to study simple mathematical models. The concepts and methods they developed in this process appear to apply to a number of important random combinatorial optimisation problems, for which they have proposed remarkable formulas. Their discoveries point towards a new branch of probability theory. Finding rigorous arguments to support their conjectures is a formidable challenge and a long range programme, some steps of which are described in the present paper.\nTalagrand retired in\n2017\nbut five years before that he began a project to understand Quantum Mechanics in a mathematically rigorous way. The final result was the book\nWhat Is a Quantum Field Theory\n?\n(2022)\n. He begins the Introduction as follows\n[\n38\n]\n:-\nAs a teenager in the sixties reading scientific magazines, countless articles alerted me to \"the infinities plaguing the theory of Quantum Mechanics\". Reaching\n60\nafter a busy mathematician's life, I decided that it was now or never for me to really understand the subject. The project started for my own enjoyment, before turning into the hardest of my scientific life. I faced many difficulties, the most important being the lack of a suitable introductory text. These notes try to mend that issue.\nThe book has been very highly praised. From example, Sourav Chatterjee, Stanford University, writes:-\nThis book accomplishes the following impossible task. It explains to a mathematician, in a language that a mathematician can understand, what is meant by a quantum field theory from a physicist's point of view. The author is completely and brutally honest in his goal to truly explain the physics rather than filtering out only the mathematics, but is at the same time as mathematically lucid as one can be with this topic. It is a great book by a great mathematician.\nFor more information about this book including a longer extract from Talagrand's Introduction and extracts from various reviews, see\nTHIS LINK\n.\nTalagrand had terrible worries with his eyesight for many years but, from the age of\n30\n, laser treatment had saved his sight. He then took up activities that he had not done in his youth because of his health problems. Between ages of\n30\nand\n44\n, he ran\n10\nkilometres every day which helped him clear his brain after a day of mathematics. Soon after he turned\n60\n, he developed a new health problem\n[\n56\n]\n:-\nAbout\n10\nyears ago it became clear that blood was not circulating well in my brain, so I had an MRI. It was quite an intense emotion when the radiologist told me that I had holes in my frontal lobes and had me rush to take low doses of aspirin. As I had not felt anything special, I kept living and working as usual. What else could be done? Early\n2020\n, I fainted in my bathroom, had a bad fall, and a brain haemorrhage. The visible consequences were manageable, so again, what could I do but keep doing what was already started? The amazing thing is that I discovered the final word about random\nFourier\nseries after this haemorrhage.\nHe continues to take exercise and climbs\n88\nstairs in his building which takes him about\n20\nminutes.\nLet us end this biography with a two quotes. The first from the mathematicians who nominated Michel Talagrand for the\nBanach\nMedal\n[\n64\n]\n:-\nAstonishing is the richness and value of his achieved results. None of them is \"easy\". They demand a lot of perseverance and extraordinary deep insight. Many of them are solutions of famous old problems.\nThe second quote is from Helge Holden, chair of the\nAbel\nPrize Committee\n[\n35\n]\n:-\nTalagrand is an exceptional mathematician, and a formidable problem solver. He has made profound contributions to our understanding of random, and in particular, Gaussian, processes. His work has reshaped several areas of probability theory. Furthermore, his proof of the celebrated Parisi formula for free energy of spin glasses is an amazing accomplishment.\nFor further information about Talagrand's life and work, see one or both of his autobiographies.\nTalagrand's Shaw Prize autobiography is at\nTHIS LINK\n.\nTalagrand's\nAbel\nPrize autobiography is at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Jean-Pierre Kahane",
    "Gustave Choquet",
    "Choquet",
    "Lebesgue",
    "Lie",
    "Banach",
    "Académie des Sciences",
    "Gilles Pisier",
    "Jean Bourgain",
    "Erdős",
    "THIS LINK",
    "Pisier",
    "Fermat",
    "Stefan Banach",
    "Abel",
    "Fourier"
  ],
  "imagens": [
    "talagrand.jpg"
  ]
}