{
  "nome_completo": "Talitha Michal Washington",
  "nome_curto": "Talitha Washington",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Washington/",
  "data_nascimento": "9 January 1974",
  "local_nascimento": "Frankfort, Indiana, USA",
  "data_morte": null,
  "local_morte": null,
  "summary": "Talitha Washington is an American mathematician who, in 2001 , became the first African American to graduate with a doctorate in mathematics from the University of Connecticut. She became co-leader of the National Science Foundation's 'Improving Undergraduate STEM Education: Hispanic-Serving Institutions' programme and won the 2019 Black Engineer of the Year STEM Innovator Award.",
  "biografia": "Talitha Washington\ngrew up as\nTalitha M Wangerin\nand only became known as Talitha M Washington following her marriage in\n1998\n. For simplicity we shall, however, use the name Talitha Washington throughout this biography. Although born in Frankfort, Indiana, she grew up in Evansville, Indiana. Washington's school education was in Evansville where she attended the Benjamin Bosse High School. At this school her favourite subjects were chemistry and English. She took an Advanced Placement\n(\nAP\n)\nChemistry course, AP courses being College level courses and examinations given at a high school. The English course which particularly attracted her was one on classical plays.\nAn excellent student at high school, she graduated in\n1992\none semester early and studied for six months on an American Field Service exchange programme. She spent the six months February to July\n1992\nat the Liceo Hernán Vargas Ramírez, Juan Vinas, Costa Rica before entering Spelman College in\n1992\nwith the intention of majoring in engineering. Spelman College is a private, liberal arts, historically black, women's college. She wrote\n[\n3\n]\n:-\nAs an undergraduate I went to Spelman College, a Black woman's college in Atlanta, Georgia. College was a huge class shock for me, because I grew up in the inner city of Evansville, Indiana, where many of my friends ended up going to jail or prison. At Spelman, I was immediately blessed with not being the only Black female in the class. For the first time in my educational experience, I did not have to be the \"negro representative\" who is called upon to explain and defend Black people. I did not have to explain my race or why I look this way. Rather, I could simply learn and absorb copious amounts of knowledge centered around my perspective as a Black woman in a multicultural world.\nShe was studying various mathematics courses as part of engineering and she changed from majoring in engineering to majoring in mathematics so that she could graduate in four years rather than five. She said\n[\n6\n]\n:-\nI didn't necessarily choose mathematics as a career - mathematics is something I always did well. When I was an undergraduate at Spelman College, my professors there saw that I had the ability to do mathematics.\nWhile at Spelman College she took positions each summer as an intern. She was a Pharmaceutical Packaging Intern at Bristol-Meyers Squibb, a pharmaceutical company in Evansville, in the summer of\n1993\n. She was a Scholar in the Minority Scholars Summer Institute in Accountancy of Bentley University, a private university in Waltham, Massachusetts which focused on business, in\n1994\n. She was an Actuarial Intern at CIGNA, a health service company in Hartford, Connecticut, in the summer of\n1995\n.\nShe spent time at the Universidad Autónoma de Guadalajara in Mexico in the autumn of\n1995\nwhere she struggled at first with the mathematics course\n[\n4\n]\n:-\n... she took a proof-based linear algebra course and earned a\n0\non her first assignment. Determined to succeed, she rallied her new classmates to study in the library. By the end of the semester, she earned\n100\n's on her assignments. This experience taught her that obstacles can be overcome by cultivating and building a community of learners.\nBack at Spelman, for her junior year, she joined a research programme\n[\n6\n]\n:-\nBy the time I was a junior I participated in a research programme, Scholars in Mathematics at Spelman, and I did research under the guidance of Jeffrey Ehme who then encouraged me to apply for graduate school in my senior year and so I applied to the University of Connecticut ...\nThe research she did under Jeffrey Ehme was related to the\nBlack\n-Scholes option pricing model, and she wrote a senior dissertation with title\nDerivation of Black-Scholes Option Pricing Model\n. She graduated with a B.S. Magna Cum Laude in\n1996\n, majoring in mathematics and having Spanish as a minor subject.\nHaving spent a summer internship at CIGNA in Hartford, Connecticut, she had applied for an actuarial science position there. CIGNA offered her the position but, after receiving an offer of a position for graduate studies at the University of Connecticut with funding from the Packard Foundation, she turned down CIGNA's offer and accepted the University of Connecticut. With no summer internship arranged for the summer of\n1996\n, after the award of her B.S. she spent two months backpacking on her own through southern Mexico, Belize, and Guatemala.\nShe studied for her Master's Degree at the University of Connecticut, which was awarded in\n1998\n, and then proceeded to study for a Ph.D.  She wrote about her time at the University of Connecticut in\n[\n3\n]\n:-\nLife in graduate school at the University of Connecticut was hard. People always asked me what country I was from. That was confusing to me. I later found out that I was the first US Black to enter the program. Fortunately, I had Joe McKenna. I remember sitting in his office, devastated by the environment, workload, and life. He told me, \"You outwork anyone here. You are good.\" These words encouraged me to work even harder and to see it all through. Fortunately, my Spelman training in proofs and analysis prepared me so well that my analysis preliminary exam was actually fun. At the time, I was not interested in modelling the collapse of the Tacoma Narrows Bridge, which is what McKenna researched. I was more interested in mathematical biology; so I completed my dissertation under Yung-Sze Choi on a partial differential equations model of proteins acting as on/off switches.\nShe said in\n[\n6\n]\n:-\nI chose\n[\nTung-Sze Choi\n]\nbecause I was interested in mathematical biology and he was beginning work with the Virtual Cell Project there in Hartford Connecticut. So I participated with him and looked at a protein-protein interaction model which was a system of three partial differential equations. We analysed the system and investigated solutions of the corresponding system.\nWhile at the University of Connecticut, Washington was employed as a Teaching Assistant in the Department of Mathematics from September\n1996\nto August\n2001\n. She also had several other roles including an Instructor in the Center for Academic Programs in the summer of\n1997\nand\n1998\n, and a Research Mentor in the University of Connecticut, Mentor Connection in July\n2000\n.\nWashington was awarded her Ph.D. in\n2001\nfor her thesis \"Mathematical Model of Proteins Acting as On/Off Switches.\" This meant that she was the first African American to graduate with a doctorate in mathematics from the University of Connecticut. Her thesis has the following Abstract:-\nMulticellular organisms have a complex signalling system that allows for efficient intercellular crosstalk. This requires that each cell has a mechanism to read and understand the information coming from other cells. In this thesis, we analyse a theoretical model of protein-protein interaction with respect to cell signalling.\nA paper based on her thesis with the title\nMathematical Model of a Protein-Protein Interaction Network\n, was published in the journal\nNonlinear Studies\nin\n2003\n. The Abstract is as follows:-\nA spatial-temporal model of theoretical protein-protein interactions is developed to analyse the behaviour of a network of proteins that exist in two states: active and inactive. After given an initial protein concentration, the proteins activate and inactivate proteins in the network. After the proteins interact with each other, the concentrations of the proteins reach a unique steady state. This model mathematically explains how a network of proteins generates a specific protein concentration.\nWe note that she married on\n4\nApril\n1998\nin Windham, Connecticut. She was studying at graduate school when her first child was born\n[\n4\n]\n:-\nShe gained assistance with this transitional time in her life by securing a doula, a professional labour support person, and by participating in a network of mothers through La Leche League.\nYung-Sze Choi, Washington's Ph.D. advisor, encouraged her to seek a postdoctoral position. She was appointed as a Research Associate in the Department of Mathematics of Duke University in Durham, North Carolina in\n2001\n, with Michael Reed and Joseph Blum as her research advisors. After two years at Duke University, in\n2003\nshe was appointed as an Assistant Professor in the Department of Mathematics of the College of New Rochelle, in Rochelle, New York. This is a private, Catholic, women's college that is also an Hispanic-Serving Institution. In\n2005\nshe \"returned home\" to the University of Evansville, again as an Assistant Professor, but she was promoted to Associate Professor in\n2011\n. She was a Visiting Associate Professor in the  Department of Mathematics of Howard University in the academic year\n2011\n-\n2012\n, and became an Associate Professor with tenure at Howard in\n2012\n.\nBy the time she went to Howard University, Washington had six publications. Two of these were joint papers with\nEdray Herber Goins\n, namely\nA Tasty Combination: Multivariable Calculus and Differential Forms\n(2009)\nand\nSphere-of-Influence Graphs\n(2010)\n. The first of these has the following Abstract:-\nDifferential Calculus is a staple of the college mathematics major's diet. Eventually one becomes tired of the same routine, and wishes for a more diverse meal. The college math major may seek to generalize applications of the derivative that involves functions of more than one variable, and thus enjoy a course on Multivariate Calculus. We serve this article as a culinary guide to differentiating and integrating functions of more than one variable using differential forms which are the basis for de Rham Cohomology.\nAnother important colleague with whom Washington collaborated was Ronald E Mickens. She wrote\n[\n3\n]\n:-\nMuch of my professional career has been guided by Ronald E Mickens of Clark Atlanta University. I knew him as an undergraduate because Clark Atlanta was literally right across the street from Spelman. I remember that when I was an undergraduate he gave me his book on difference equations, which tended to gather dust over the years. Little did I know that a decade later we would do research together. Over the years we have published papers on the construction of nonstandard finite difference schemes. These schemes discretize dynamical systems and maintain dynamical consistency by incorporating features of the dynamical systems into the discretizations. We now talk a couple of times a week about mathematics, life, and what I should be doing and how I should do it.\nWashington and Mickens have written several joint papers including:\nA Note on an NSFD Scheme for a Mathematical Model of Respiratory Virus Transmission\n(2012)\n;\nA Note on Exact Finite Difference Schemes for the Differential Equations Satisfied by the Jacobi Cosine and Sine Functions\n(2013)\n;\nNSFD Discretizations of Interacting Population Models Satisfying Conservation Laws\n(2013)\n;\nA Note on the Exact Discretization for a Cauchy-Euler ODE: Application to the Black-Scholes Equation\n(2015)\n; and\nUse of Exact Difference Schemes to Construct NSFD Discretizations of Differential Equations\n(2016)\nWashington updated her Teaching Statement in\n2017\n. Here is an extract from that statement\n[\n8\n]\n:-\nTo teach effectively, one must understand, motivate, and challenge students. Through formal interactions in the classroom and informal discussions in the office, I aspire to inspire students to explore a variety of mathematical concepts and applications. In my courses, I want students to grow mathematically, academically, and socially in an atmosphere that is both stimulating and adaptive to their diverse needs. I find that encouraging students in the classroom to contribute to discussions and to present homework solutions have been pivotal in increasing student involvement and enthusiasm. Throughout the lecture, I incorporate just enough humour to make the experience enjoyable and productive. With this style of teaching, students take an active role in their learning in a relaxed environment, while I curtail my role to that of mathematical guide and motivator. I believe that students learn not only by what is shown to them, but by what they accomplish. In many of the courses that I have taught, I assigned writing assignments. Each group would type a report which includes answers to pre-assigned questions. Since this would be the first time students would write a scientific paper, I would encourage the students to come to me for assistance with revisions. I also encouraged students to utilize the writing centre on campus. By working in groups, students would learn how to talk about mathematics in a technical sense, and then organize the information into a technical paper. Writing can be a powerful tool to reinforce concepts. As a result of my research in applied mathematics, I have been able to expose undergraduates to mathematical research. For example, I enhanced students' understanding of calculus through projects that applied the subject to fundamental topics in the sciences. Over the years, I have created a number of topics courses in the areas of mathematical biology and scientific computing which exposed undergraduates to current trends in the field. Topics include utilizing mathematics to describe oscillations made by the Tacoma Narrows Bridge on the days of its collapse, the spread of infectious diseases, and systems in synthetic biology. As a result, the students find that the material \"comes alive;\" they can see interesting ways that mathematics describes the world around them. I look forward to developing more research-based courses so that students can both understand the applicability the mathematics and learn to appreciate the beauty of the subject.\nWashington is active in training school teachers and college professors. She became co-leader of the National Science Foundation's 'Improving Undergraduate STEM Education: Hispanic-Serving Institutions' programme which works to improve the quality of undergraduate STEM education at Hispanic-Serving Institutions and to increase retention and graduation rates of undergraduate students pursuing degrees in science, technology, engineering, and mathematics at these institutions. She won the\n2019\nBlack Engineer of the Year STEM Innovator Award which\n[\n1\n]\n:-\n... is presented to individuals who have made significant advancements in research at Historically Black Colleges and Universities.\nOn receiving the award on\n4\nFebruary\n2019\nshe said\n[\n1\n]\n:-\nI am honoured to receive the STEM Innovator Award and for my contribution in STEM to be recognized. I take great pride in educating and being a steward of future scientists and engineers who will make an impact on the grand challenges of the world.\nAs to Washington's other activities, we quote from\n[\n4\n]\n:-\nIn her spare time, she serves on a number of boards and shares motivational speeches on diversity and mathematics to a wide range of audiences. She balances stress by maintaining a rigorous exercise regimen with fitness guru Cathe Friedrich, that includes kickboxing, step aerobics, strength training, and yoga.  During the warm seasons, you may even find her running down the Rock Creek Park trails in Washington, DC.\nThe boards mentioned in this quote include the Council of the\nAmerican Mathematical Society\nand the Executive Committee of the\nAssociation for Women in Mathematics\n.\nWe gave quotes above from\n[\n3\n]\n. You can read a version of the whole article at\nTHIS LINK\n.\nIn\n2008\nshe wrote an article on\nElbert Frank Cox\nwho was born near where Washington grew up in Evansville, Indiana. You can read a version of her article at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Black",
    "Edray Herber Goins",
    "American Mathematical Society",
    "Association for Women in Mathematics",
    "THIS LINK",
    "Elbert Frank Cox"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}