{
  "nome_completo": "Theodor Estermann",
  "nome_curto": "Theodor Estermann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Estermann/",
  "data_nascimento": "5 February 1902",
  "local_nascimento": "Neubrandenburg, Germany",
  "data_morte": "29 November 1991",
  "local_morte": "London, England",
  "summary": "Theodor Estermann was a German mathematician who worked in the field of analytic number theory.",
  "biografia": "Theodor Estermann\n's parents were Leo Estermann and Rachel Brenner. Leo, who was born in Lithuania, was a Jewish businessman who worked in advertising and management. Rachel, who was born in Latvia, was a corset maker. Leo and Rachel Estermann had two children, the eldest being Immanuel who was born in Berlin on\n31\nMarch\n1900\n. Immanuel Estermann\n(1900\n-\n1973)\nbecame an outstanding physicist. Leo Estermann was a Zionist, a passionate believer in the formation of a state of Israel, and strongly opposed to the integration of Jews into the societies in which they lived. In fact he had named his son Theodor after Theodor Herzl\n(1860\n-\n1904)\nwho is considered as the founder of Zionism. Theodor's first schooling was in Hamburg where, from\n1908\n, he attended the Talmud-Torah School, the oldest Jewish school in Hamburg founded in\n1805\n. At this school he learnt Hebrew as well as German, writing and arithmetic. After attending this school for several years, he studied at a state primary school in Berlin. Theodor felt happier in the state primary than he had in the Talmud-Torah School.\nIn\n1914\nWorld War I began and the Estermann family emigrated from Germany to Palestine where they settled in Jerusalem. At this time Jerusalem was part of the Ottoman empire, controlled by Turkey. The Estermanns became Turkish subjects and both their children attended school in Jerusalem. Theodor studied at the Hebrew Grammar School\n[\n6\n]\n:-\nHere the teachers translated their lesson notes from their own mother-tongues\n(\noften German\n)\ninto Hebrew, and Theodor used to translate his notes back into German when he did his homework.\nAlthough the Estermann family remained in Jerusalem for most of World War I, living conditions became very difficult and they returned to Hamburg before the war ended. Few school places were available in Hamburg and, due to their different ages, the brothers had to attend different schools. Immanuel attended a school where he was able to undertake practical science experiments in laboratories but the school that Theodor attended did not have such facilities for science. It seems that this difference between the schools may have led to Immanuel becoming fascinated by chemistry\n(\nhe later moved to physics\n)\nwhile Theodor developed a passion for mathematics.\nThe Zionist movement believed in a rural way of life with agriculture and rights for those who worked the land being strong beliefs. Because of this, Leo Estermann arranged for his son Theodor to be apprenticed to a farmer after he graduated from the Hamburg high school. However, the farmer quickly realised that his young apprentice would never make a good farmer but had a strong academic desire. He persuaded Estermann's father that he should let his son attend university. Estermann entered the University of Göttingen, the leading German university for mathematics, and there he attended courses by\nDavid Hilbert\nand\nEdmund Landau\n. Estermann, however, missed his family and after a few months, arranged to continue his studies of mathematics at the University of Hamburg.\nWilhelm Blaschke\nhad been appointed to a chair at the University of Hamburg in\n1919\n.\nErich Hecke\nwas appointed to Hamburg in the same year and wanted to build a school of number theory there. In\n1922\nHans Rademacher\n, who had been working on the theory of real functions, was appointed as an extraordinary professor at Hamburg and began to work on number theory. Also in\n1922\n,\nEmil Artin\nwas appointed as an assistant at Hamburg. Theodor Estermann's brother Immanuel became a lecturer in physics at the University of Hamburg in\n1922\nand Theodor undertook research towards his doctorate advised by\nRademacher\n. Now although\nRademacher\nwas by this time turning towards number theory and Estermann's interests were in that area after attending\nEdmund Landau\n's lectures in Göttingen,\nRademacher\nstill did not feel confident enough to suggest a number theory topic to Estermann; instead, he suggested a problem in\nmeasure theory\n. Estermann was awarded his doctorate in\n1925\nfor his thesis\nÜber Carathéodorys und Minkowskis Verallgemeinerungen des Laengenbegriffs\nⓉ\n(\nOn Carathéodory's and Minkowski's generalizations of quantity terms\n)\nand, in the same year, he published a paper with the same title as his thesis.\nWhile Estermann worked for his doctorate at Hamburg, his father had returned to Palestine which was by this time being administered by the British. After he completed his doctorate, Estermann joined his father in Palestine. Work was not easy to obtain and he worked for a while as an assistant in Dr Arthur Biram's Hebrew Reali High School in Haifa. In March\n1926\n, while in Tel-Aviv, he submitted the paper\nZwei neue Beweise eines Satzes von Blaschke und Rademacher\nⓉ\n(\nTwo new proofs of a theorem of Blaschke and Rademacher\n)\nto the\nJahresbericht der Deutschen Mathematiker-Vereinigung\nⓉ\n(\nAnnual report of the German Mathematical Society\n)\n. This paper solves the\n3\n-dimensional case of a problem on convex bodies, the\n2\n-dimensional case having been solved by\nBlaschke\nin\n1920\n.\nNow Estermann had relatives in England for his mother's sister Sarah Brenner, who was also a corset maker, was living in London. In fact Estermann had visited her for a holiday in\n1924\nwhile he was a research student at Hamburg. He now decided that one way to further his career would be to study in London and, in\n1926\n, he came to London to live with his aunt and to study at University College London. He submitted the paper\nOn certain functions represented by Dirichlet\nseries\nto the\nProceedings\nof the London Mathematical Society in November\n1926\n. He writes the following acknowledgement in the paper:-\nI take this opportunity to express my thanks to Mr\nTitchmarsh\nfor having drawn my attention to the subject and for his kind permission to avail myself of a manuscript in which he proved\n[\na special case of\n]\nTheorem\n3\n.\nThe authors of\n[\n6\n]\ncall this paper \"a remarkable piece of work\" describing Estermann's proofs \"elegant\" and \"representing considerable achievements\".\nWhile at University College London, Estermann submitted\nOn a Problem of Analytic Continuation\n(\nsubmitted March\n1927)\nwhich is also called \"a remarkable piece of work\" by the authors of\n[\n6\n]\n. This was a highly productive period for Estermann  with papers:\nÜber den Vektorenbereich eines konvexen Körpers\nⓉ\n(\nOn the vector field of a convex body\n)\n(\nsubmitted September\n1927)\n;\nOn the Representations of a Number as the Sum of Three Products\n(\nsubmitted April\n1928)\n; and\nOn the Divisor-Problem in a Class of Residues\n(\nsubmitted July\n1928)\n. Although mathematically this had been a highly productive period for Estermann, he found it difficult to live on the small amount of money that his father was able to send him. He was awarded a D.Sc. by University College London and returned to Germany at the end of\n1928\n.\nBack in Hamburg, he obtained a temporary position substituting for a professor who was ill. He submitted\nBemerkung zu den kontinuitätsbeweisen des abbildungssatzes für polygone\nⓉ\n(\nComments on showing the continuity of the illustration therem for polygons\n)\nin October\n1928\n. This remark gives more information about the convex bodies problem he had studied while in Palestine. While in Hamburg, he also submitted the paper\nVereinfachter beweis eines satzes von Kloosterman\nⓉ\n(\nSimplified proof of a theorem of Kloosterman\n)\n. The professor for whom he was substituting died and so his temporary position vanished. In May\n1929\nhe returned to London for the degree ceremony to receive his D.Sc and when the staff at University College London learnt that he was unemployed, they arranged for him to be offered an Assistant Lectureship in Mathematics. Back in Hamburg before taking up the position in London, Estermann sent off his paper\nOn the Representations of a Number as the Sum of Two Products\n(\na\n2\n-part paper, the first part submitted June\n1929\n, second part November\n1929)\n. He took up the Assistant Lectureship in Mathematics at University College London in the autumn of\n1929\nand, two years later, was promoted to a Lectureship.\nBeing a Jew, Estermann's brother Immanuel lost his position at the University of Hamburg in\n1933\nwhen the Nazi party came to power. He came to England in that year and, for a while, lived with his brother. Later he went to Carnegie Mellon University in Pittsburgh in the United States. Theodor Estermann was an invited speaker at the Colloquium on the 'Theory of Numbers' held at the University of Bristol in June\n1935\n. He gave the lecture\nThe representation of numbers as sums of squares\n. This was an important occasion for him since the lectures given at this meeting by\nHans Heilbronn\non\nWaring\n's problem led to Estermann making some important contributions over the following years, see for example his paper\nOn Waring's problem for fourth and higher powers\n(1937)\n. Estermann married Tamara K E Pringsheim towards the end of\n1936\n; they had five girls and one boy. Tamara was the grandaughter of\nAlfred Pringsheim\n. Their first address was\n13\nSandringham Road, Speedwell, London. He was promoted to Reader at University College in\n1940\n. In\n1950\nhe visited the United States sailing from Liverpool to New York on the Britannic, departing\n14\nJuly. He lectured at Stanford University while in the United States. He returned to England on the Queen Mary, arriving in Southampton on\n19\nSeptember\n1950\n.\nEstermann published\nIntroduction to Modern Prime Number Theory\nin\n1952\n. He states that his:-\n... main purpose in writing this book was to enable those mathematicians who are not specialists in the theory of numbers to learn some of its non-elementary results and methods without too great an effort.\nNicolaas de Bruijn\nseems to view the book's aims slightly differently from those of the author. He writes in a review:-\nThe main purpose of this book is to give a complete account of\nVinogradov\n's famous theorem that every large odd positive integer can be represented as the sum of three primes. It assumes some knowledge of the elementary theory of numbers, for which\nHardy\n-\nWright\n's treatise is quoted, and some of complex function theory. The exposition is very clear and accurate, and also in other respects reminds one of\nLandau\n's books. Problems, methods or results which do not directly fit in the author's presentation of\nVinogradov\n's theorem are completely neglected, and, therefore, the title of the book may be somewhat misleading. Nevertheless it gives a good impression of analytical number theory.\nEdward M Wright\nis full of praise for the book\n[\n7\n]\n:-\nThe exposition is masterly in its clarity, ease and economy. For example, the proof of\nVinogradov\n's theorem takes only\n16\npages, which includes a careful explanation of the main ideas before the detailed proof begins. Until I read this book I would not have believed it possible to give so lucid and simple an account of the proofs of these three difficult and important theorems. The author has put specialists as well as non-specialists in his debt.\nAn impression of the areas of number theory that attracted Estermann is gained by looking at the headings under which his research is discussed in\n[\n6\n]\n. These are:\nKloosterman\n's sums and applications; Sums of squares, quadratic forms;\nWaring\n's problem; Sieve theory; Additive problems involving primes; and\nSiegel\nzeros and the distribution of primes.\nEstermann published the undergraduate text\nComplex Numbers and Functions\nin\n1962\n.\nJames Clunie\nwrites in a review\n[\n1\n]\n:-\nThis is an excellent book on the foundations of complex analysis. The material covered is, roughly speaking, that required by an honours student in mathematics. The reader is assumed to be familiar with the elements of the theory of real functions of real variables. ... The author's account of\nCauchy\n's theorem is as good as any I have seen.\nHowever,\nClunie\nhas criticisms of Estermann's style of presentation\n[\n1\n]\n:-\nThroughout the book the author avoids any intuitive or formal discussion. This seems to me to detract considerably from the other undoubted merits of the book. While the substitution of intuition and formality for rigour is deplorable, it is nevertheless true that the development of these complementary to rigour greatly increases effectiveness and facility in the subject. In many places some intuitive discussion of the ideas of a proof would have removed much obscurity and apparent arbitrariness. Otherwise the proofs are admirable and are clearly the result of a great deal of thought on the part of the author.\nAlastair MacDougall writes in\n[\n4\n]\nabout this text by Estermann and also about Estermann's personality:-\nDuring the year\n1957\n-\n58\nDr T Estermann had two students on his undergraduate course in functions of a complex variable. I had little idea at that time of the significance of being one of those two. When, nearly a decade later, I bought Estermann's book\n[\nComplex numbers and functions\n(1962)]\n, it was mainly for nostalgia's sake since I had given up hope of becoming a mathematician. His matter-of-fact Germanic accent spoke to me again from every sentence in the book. It must be difficult for readers who have never met Estermann to appreciate the author's personality. For example, one reads on page\n61\nof\n[\n1\n]\n, '\nJordan\n's own supposed proof\n(\nof the\nJordan\ncurve theorem\n)\nis ... very inadequate and marred by serious misconception.' Such language might remind one of a certain type of political polemicist, but when uttered by Estermann it sounded more like an apology, addressed to us students by a mathematician, for the shortcomings of his co-workers. I feel that having been a less than adequate student I at least owe Estermann this 'very inadequate' tribute.\nFurther comments on his personality and interests appear in\n[\n6\n]\n:-\nIn view of Estermann's quiet and modest presence, one was surprised on better acquaintance to find that he was in fact a man of wide interests and many accomplishments. He spoke fluent grammatical German and Hebrew\n(\nand, of course, English\n)\n. In addition, he knew some French and Latin, and studied Swedish in preparation for the Stockholm ICM. He had an extensive knowledge of literature, and knew large parts of Shakespeare's plays by heart. He enjoyed classical music, and as a young man was a keen gymnast.\nKlaus Roth\nrecalls from his research student days that his supervisor, Dr Estermann, could still demonstrate faultless handstands with the same facility with which he made his many erudite\n(\nbut apt\n)\nquotations from Shakespeare and Gothe.\nIn\n1965\n, four years before he retired, University College London promoted Estermann to professor. When he retired in\n1969\nhe was made Professor Emeritus. He continued to undertake research at University College until\n1987\nwhere he was appointed as a Honorary Research Fellow. During these years he found a new proof of the irrationality of √\n2\nwhich has fascinated many mathematicians, see\n[\n2\n]\nand\n[\n5\n]\n.",
  "matematicos_citados_na_biografia": [
    "David Hilbert",
    "Edmund Landau",
    "Wilhelm Blaschke",
    "Erich Hecke",
    "Hans Rademacher",
    "Emil Artin",
    "Rademacher",
    "measure theory",
    "Blaschke",
    "Titchmarsh",
    "Hans Heilbronn",
    "Waring",
    "Alfred Pringsheim",
    "Nicolaas de Bruijn",
    "Vinogradov",
    "Hardy",
    "Wright",
    "Landau",
    "Edward M Wright",
    "Kloosterman",
    "Siegel",
    "James Clunie",
    "Cauchy",
    "Clunie",
    "Jordan",
    "Klaus Roth"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}