{
  "nome_completo": "Thomas Simpson",
  "nome_curto": "Thomas Simpson",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Simpson/",
  "data_nascimento": "20 August 1710",
  "local_nascimento": "Market Bosworth, Leicestershire, England",
  "data_morte": "14 May 1761",
  "local_morte": "Market Bosworth, Leicestershire, England",
  "summary": "Thomas Simpson was an English mathematician who is best remembered for his work on interpolation and numerical methods of integration.",
  "biografia": "Thomas Simpson\n's father was a weaver. Thomas received little formal education. He did attend school in Market Bosworth for a while but his first job was as a weaver. He taught himself mathematics, something which was not uncommon for weavers at that time as we shall see below. He moved away from his home town to take up a position as a schoolmaster in Nuneaton, Warwickshire. From about\n1725\n, when Simpson was fifteen years old, until around\n1733\n, he taught mathematics in Nuneaton.\nSimpson had lodgings in Nuneaton with a lady by the name of Swinfield whom he married in\n1730\n. They had one daughter Elizabeth born in\n1736\nand one son Thomas born in\n1738\n. In fact Simpson and his wife had left Nuneaton before his children were born. The reason which has been reported by his biographers is as follows. He\n[\n2\n]\n:-\n... had to flee to Derby in\n1733\nafter he or his assistant had frightened a girl by dressing up as a devil during an astrology session.\nThis would certainly fit in with the fact that he was known as the:-\n... oracle of Nuneaton, Bosworth and the environs.\nExactly how long he remained in Derby is unknown but we do know that from\n1736\nhe was living in London with his family. He was an early member of the\nSpitalfields Mathematical Society\nbeing one of\n49\nmembers in\n1736\n. This Society operated as a working men's club and we know that it was a natural choice for a weaver who taught mathematics since of the members by\n1744\n:-\n... about half were weavers, and the rest were typically brewers, braziers, bakers, bricklayers.\nSimpson was the most distinguished of a group of itinerant lecturers who taught in the London coffee houses. This may seems strange but in fact at this time coffee houses were sometimes called the Penny Universities because of the cheap education they provided. They would charge an entrance fee of one penny and then while customers drank coffee they could listen to lectures. Different coffee houses catered to specific interests such as art, business, law and mathematics. For example\nDe Moivre\nused Slaughter's Coffee House in St Martin's Lane as a base during these years, and\nWilliam Jones\n, who was a friend of Simpson, was able to make a living lecturing in coffee houses such as Child's Coffee House in St Paul's Churchyard.\nIn\n1743\nSimpson was appointed as the head of mathematics at the Royal Military Academy at Woolwich. In fact this Academy was founded only two years before Simpson took up the post and his appointment there had an impact on the mathematical topics he investigated. In particular he began research on engineering problems and problems relating to fortifications. Two years after his appointment, Simpson was elected a fellow of the\nRoyal Society\n. While we are describing the honours which he received, we should note that he was also elected a fellow of the\nRoyal Swedish Academy of Sciences\nin\n1758\n.\nFrom\n1737\nSimpson began to write texts on mathematics, publishing\nA New Treatise of Fluxions\nin that year\n[\n2\n]\n:-\nThis was a high-quality textbook devoted to the calculus of fluxions, the Newtonian version of the infinitesimal calculus. The topic was advanced -- it was no trivial exercise to write such a book in the\n1730\ns, when the calculus was mastered by only a few mathematicians in Europe.\nSimpson is best remembered for his work on interpolation and numerical methods of integration. However the numerical method known today as \"Simpson's rule\", although it did appear in his work, was something he learned from\nNewton\nas Simpson himself acknowledged. By way of compensation, however, the\nNewton\n-\nRaphson\nmethod for solving the equation\nf\n(\nx\n)\n=\n0\nf (x) = 0\nf\n(\nx\n)\n=\n0\nis, in its present form, due to Simpson.\nNewton\ndescribed an algebraic process for solving polynomial equations which\nRaphson\nlater improved. The method of approximating the roots did not use the differential calculus. The modern iterative form\nx\nn\n+\n1\n=\nx\nn\n−\nf\n(\nx\nn\n)\nf\n′\n(\nx\nn\n)\nx_{n+1} = x_n - \\Large \\frac {f(x_n)}{f^\\prime (x_n)}\nx\nn\n+\n1\n​\n=\nx\nn\n​\n−\nf\n′\n(\nx\nn\n​\n)\nf\n(\nx\nn\n​\n)\n​\nis due to Simpson, who published it in\n1740\n.\nHe also worked on\nprobability theory\nand in\n1740\npublished\nThe Nature and Laws of Chance\n. Much of Simpson's work in this area was based on earlier work of\nDe Moivre\n. In fact he was involved in a dispute with\nDe Moivre\nover issues of priority on the topic of probability and annuities. He worked on the Theory of Errors and aimed to prove that the arithmetic mean was better than a single observation. His justification of this appeared in his\n1757\nmemoir\nAn attempt to show the advantage arising by taking the mean of a number of observations in practical astronomy\n.\nSimpson published\nMathematical Dissertations\nin\n1743\nwhich discussed the attraction of the solid obtained by rotating an ellipse around one of its axes. His two volume work\nThe Doctrine and Application of Fluxions\nin\n1750\ncontains work of\nCotes\nand is considered by many to be the best work on\nNewton\n's version of the calculus published in the\n18\nth\ncentury. Problems in astronomy such as the precession of the equinoxes were discussed by Simpson in\nMiscellaneous Tracts\n(1757)\n.\nIn\n1754\nhe became editor of the\nLadies Diary\n. He had published in the\nLadies Diary\nfrom the time he came to London in\n1736\n. He answered problems posed in this publication, but used a variety of pseudonyms such as Marmaduke Hodgson, Hurlothrumbo, Kubernetes, Patrick O'Cavannah, and Anthony Shallow. It was his obvious mathematical skills demonstrated in these solutions which first brought his to the attention of other mathematicians of the day. Other periodicals which he published in were the\nGentleman's Magazine, Miscellanea Curiosa Mathematica\n, and the\nGentleman's Diary\n.\nIn\n[\n9\n]\nStigler describes an event which occurred near the end of Simpson's life:-\nA newly discovered manuscript fragment shows that Thomas Simpson and\nRoger Boscovich\nmet in\n1760\n, and that\nBoscovich\nposed a problem in least deviations regression to Simpson. ... Simpson's attempt at an analytical solution is interpreted.\nThe following description of Simpson by\nCharles Hutton\n(\nmade\n35\nyears after Simpson's death\n)\nis interesting\n[\n5\n]\n:-\nIt has been said that Mr Simpson frequented low company, with whom he used to guzzle porter and gin: but it must be observed that the misconduct of his family put it out of his power to keep the company of gentlemen, as well as to procure better liquor.\nIt would be fair to note that others described Simpson's conduct as irreproachable.",
  "matematicos_citados_na_biografia": [
    "Spitalfields Mathematical Society",
    "De Moivre",
    "William Jones",
    "Royal Society",
    "Royal Swedish Academy of Sciences",
    "Newton",
    "Raphson",
    "probability theory",
    "Cotes",
    "Roger Boscovich",
    "Boscovich",
    "Charles Hutton"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}