{
  "nome_completo": "Thomas Barker",
  "nome_curto": "Thomas Barker",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Barker/",
  "data_nascimento": "9 September 1838",
  "local_nascimento": "Murcar, Old Machar, Aberdeen, Scotland",
  "data_morte": "20 November 1907",
  "local_morte": "Woodlea, Lightwood Road, Fairfield, Buxton, England",
  "summary": "Thomas Barker had an outstanding undergraduate career, being Senior Wrangler in the mathematical tripos at Cambridge and 1 st Smith's Prizeman in 1862 . He went on to play an important role in Owens College, Manchester where he was professor of pure mathematics for twenty years.",
  "biografia": "Thomas Barker\nwas the son of the farmer Thomas Barker Sr\n(1772\n-\n1849)\nand Margaret Knowles\n(1798\n-\n1857)\n. Thomas Barker Sr, the son of George Barker and Margaret Youngson, had been born on\n19\nJanuary\n1772\n. Margaret had been born on\n21\nJanuary\n1798\nat Belhelvie, Aberdeenshire, Scotland and she married Thomas at Old Machar, Aberdeen on\n24\nJuly\n1832\n. Thomas and Margaret Barker had four children but Thomas, the subject of this biography, was the only one to survive infancy. At the time of the\n1841\ncensus, Thomas Barker Sr\n(\naged\n68)\n, Margaret Barker\n(\naged\n42)\nand Thomas Barker\n(\naged\n2)\nare the only Barkers recorded living at their home but William Knowles\n(\naged\n76)\nis also living with them. Thomas' father died in\n1849\nwhen Thomas was eleven years old and at the time of the\n1851\ncensus he was living with his mother Margaret, Ann Knowles\n(\naged\n43)\nand Jane Knowles\n(\naged\n14)\nat their home.\nThomas attended Aberdeen Grammar School, one of the oldest grammar schools in the country founded in the\n1250\ns. The headmaster of the school at this time was James Melvin\n(1795\n-\n1853)\n, a Latin scholar who also lectured at Marischal College, Aberdeen. Barker graduated from the Grammar School and continued his education at King's College, Aberdeen. We should make it clear that at the time Barker entered King's College, it was a separate university from Marischal College. King's College was the older institution, being founded in\n1495\n. Marischal College was founded almost exactly\n100\nyears later and the two only merged to form the University of Aberdeen in\n1860\n, three years after Barker graduated from King's College. He had excelled in mathematics and, following the tradition of the top Scottish students of the time, following his graduation from King's College in\n1857\n, he went to the University of Cambridge to continue his studies. In fact he was admitted to Cambridge only a few days before the death of his mother on\n29\nMarch\n1857\n.\nBarker was admitted as a\nsizar\nto Trinity College, Cambridge on\n22\nMarch\n1858\nand began his studies of the mathematical tripos at the start of the Michaelmas term in October. Being a sizar meant that he was given financial assistance but had to earn this by acting as a servant to other students. He was a Foundation Scholar in\n1860\nand in\n1861\nhe was a Sheepshanks Astronomical Exhibitioner, meaning that he received a financial scholarship awarded because of his excellent performance. This Exhibition had been set up in\n1859\nwith money donated by Anne Sheepshanks which she inherited after the death of her brother, the astronomer Richard Sheepshanks. Barker was studying the mathematical tripos coached by\nEdward Routh\n.\nRouth\nbecame the most famous of the Cambridge coaches but when he began coaching Barker he was near the beginning of his career. In fact it was the group of students studying for the mathematical tripos along with Barker, with Barker as the best, who established\nRouth\n's reputation as the best Cambridge coach. Barker was the\nSenior Wrangler\nin\n1862\n, meaning he was ranked first among the First Class students. He also received the prestigious\n1\nst Smith's Prize.\nAlready in\n1861\nBarker had been appointed as an Assistant Tutor, a position he held until\n1865\n. In\n1862\n, after graduating, he was elected as a fellow of Trinity College. It was a remarkable achievement but Barker was not at all happy with the system which operated at Cambridge at the time despite having been so successful as a student in that system. He was, therefore, happy to leave Cambridge and did so in\n1865\nwhen he was appointed to the chair of pure mathematics at Owens College, Manchester.\nOwens College had been founded in\n1851\nfollowing a legacy left by the industrialist John Owens. At this time the only university level college in England, other than the universities of Oxford and Cambridge, was in London. Owens College struggled over its first few years since Manchester was famed for merchants who did not see the benefits of educating their sons to a university level, rather they wanted them to join the family business as soon as possible. Owens College, however, began to develop a different educational approach from Oxford and Cambridge, modelling the college more on the German universities. This, of course, meant that Barker was the type of professor they were looking for with his vision of mathematical rigour and building the subject on firm foundations. When he joined, however, Owens College did not have the authority to grant degrees and most of the students prepared for the external examinations of the University of London.\nAfter nearly thirty years, during which time Owens College flourished and expanded into new buildings on Oxford Road in Manchester, the College became the first constituent part of Victoria University in\n1880\n. Barker held the position of Professor of Pure Mathematics\n[\n8\n]\n:-\n... for twenty years, during which the college expanded, gained prestige, and became the nucleus of the Victoria University in Manchester. While doing his share of committee work, Barker kept a low profile within the university administration.\nDuring these years he had a number of noteworthy colleagues in other departments. For example\nOsborne Reynolds\nbecame the first professor of engineering at Owens College in\n1868\n, holding this position until he retired in\n1905\n.\nJohn Steggall\nwas Fielden lecturer at Owens College from\n1880\nto\n1883\n,\nWilliam Stanley Jevons\nworked at Owens College from\n1863\n, becoming Professor of Logic, Mental and Moral Philosophy, and Political Economy in\n1866\n,\nWilliam Jack\nheld the chair of Natural Philosophy at Owens College from\n1866\nto\n1870\nand was succeeded by Balfour Stewart\n(1828\n-\n1887)\n. Barker also taught a number of students who went on to have distinguished careers including\nJohn Hopkinson\n,\nHorace Lamb\n, Joseph John Thomson, and John Henry Poynting. Poynting was a student from\n1867\nto\n1872\nwith a Dalton Entrance Exhibition in Mathematics, then returned for a while as a demonstrator in the Physical Laboratory under Balfour Stewart. Another of Barker's students was John Walton Capstick who entered Owens College in\n1880\n, won the senior Dalton mathematical scholarship in\n1882\nand took first class honours in mathematics at the examination for the B.A. degree at the University of London in\n1883\n. Franz Arthur Friedrich Schuster\n(1851\n-\n1934)\nstudied mathematics under Barker and physics under Balfour Stewart and then returned as the Beyer Professor of Applied Mathematics at Owens College in\n1881\n.\nAlthough Barker had shown outstanding ability as a mathematician, we can find no publications by him either at research level or at the level of a teaching text.\nHorace Lamb\ntried to explain this side of Barker's character in\n[\n8\n]\n:-\nMathematically, Barker turned his back on Cambridge methods and interests. He had a severely critical mind which restrained him from publishing much and inclined him to follow\nDe Morgan\nand\nBoole\n; like them he was interested in certain fundamental aspects of mathematics. In this respect he was ahead of his time, presaging the introduction of 'rigour' into mathematics. In his teaching he endeavoured to set forth the processes of mathematical reasoning as a connected system from their foundation. His lectures consequently had a reputation for being 'unintelligible to all but the elect' but on these few he made a deep impression. His success as a teacher is attested to by a number of distinguished pupils on whom he exercised a great and possibly a determining influence.\nAn area in which Barker excelled was in making good financial investments. He never married, lived a simple life without extravagances so, in\n1885\n, when only\n47\nyears old, he felt he could retire and live off his savings and investment income. Perhaps, given his approach to mathematics and to publishing, it is not surprising that he turned to another of his interests, namely cryptogamic botany which is the study of spore-producing plants and similar spore-producing organisms. The plants which he was most interested in were mosses and\nA Census Catalogue of British Mosses\nwas compiled under the direction of the Moss Exchange Club by Barker and W Ingham.\nAfter he retired, Barker lived first at Whaley Bridge, Derbyshire, and afterwards at Buxton. He died at his home, Woodlea, Lightwood Road, Fairfield, Buxton on\n20\nNovember\n1907\n. He was buried on\n23\nNovember\n1907\nin a Non Conformist Plot in the Southern Cemetery, Chorlton-Cum-Hardy, Greater Manchester. Probate was\n[\n3\n]\n:-\nLondon\n4\nDecember to Margaret Ann Knowles and Sarah Knowles spinsters and Godfrey Davenport Goodman solicitor. Effects £\n46833\n4\ns.\nHe endowed a chair of cryptogamic botany at the University of Manchester\n[\n5\n]\n(\nsee also\n[\n1\n]\n)\n:-\nMANCHESTER,\n27\nJanuary\n1909\n. Under the bequest of the late Thomas Barker, M.A., formerly Professor of Mathematics in the Owens College, a Chair of Cryptogamic Botany has been founded in the University, Mr W H Lang, M.B., D.Sc. Lecturer in Botany in the University of Glasgow, has been appointed to the Chair. Dr Lang was a research scholar of Glasgow University. He has travelled in Ceylon and the Malay Peninsula, collecting and studying especially the crypto gams. Latterly Dr Lang has specialised on the Bryophyta, which includes the mosses, the group of plants in which the late Professor Barker was specially interested, and has contributed publications embodying the results of his researches. Dr Lang has acted for three years as external examiner in the University of Manchester, and is now examiner in the University of London.\nBarker also endowed bursaries at the University of Manchester for poor students in both mathematics and botany.",
  "matematicos_citados_na_biografia": [
    "sizar",
    "Edward Routh",
    "Routh",
    "Senior Wrangler",
    "Osborne Reynolds",
    "John Steggall",
    "William Stanley Jevons",
    "William Jack",
    "John Hopkinson",
    "Horace Lamb",
    "De Morgan",
    "Boole"
  ],
  "imagens": []
}