{
  "nome_completo": "Thomas Carlyle",
  "nome_curto": "Thomas Carlyle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carlyle/",
  "data_nascimento": "4 December 1795",
  "local_nascimento": "Ecclefechan, Dumfriesshire, Scotland",
  "data_morte": "5 February 1881",
  "local_morte": "Chelsea, London, England",
  "summary": "Thomas Carlyle was a Scottish writer who was also interested in mathematics. He translated Legendre's work Éléments de géométrie .",
  "biografia": "Thomas Carlyle\nis best known as an writer but in fact was also a mathematician. His father, James Carlyle, was a stonemason and his mother, Margaret Aitken, the daughter of a bankrupt Dumfriesshire farmer, was James' second wife. James had married Jannet but she died after the death of their son John in\n1791\n. James and Margaret married in\n1794\nand Thomas was the eldest of their nine children. Although James and Margaret were intelligent people they were not well educated and Margaret, for example, could read only with difficulty and could not write at the time of her marriage. They were very religious people and they brought up their family to strict Calvinist principles teaching them frugality and discipline. Thomas first learnt basic arithmetic from his father.\nThomas attended the village school at Ecclefechan until he was six years old and then Hoddam parish school until he was ten years old. He was also taught Latin privately by a local minister so he was well prepared for his secondary schooling. However Annan Academy was six miles away and Thomas's mother did not want him to attend the school. His father, however, insisted and on\n24\nMay\n1806\nhe accompanied his ten year old son on the six mile walk to the Academy where Thomas became a boarder during the school week returning home for the weekends. He excelled academically at Annan Academy, showing particular aptitude for mathematics, but his school days proved difficult and unhappy. His mother told him that he must never use physical force even to defend himself and this, rather naturally given the conditions in the school, meant that he was badly bullied. Eventually he went against his mother and fought back, which certainly made his life more bearable. His teachers provided efficient but uninspiring education which was aimed at making pupils ready to enter university by the age of fourteen. In addition to mathematics, his best subject, he had also enjoyed studying modern languages at school. Almost certainly he had learnt more from studying books on his own than he had from the somewhat second rate teachers.\nCarlyle entered the Edinburgh University in November\n1809\nwhere his parents expected him to train to enter the ministry. The university was eighty miles from Ecclefechan and Carlyle said goodbye to his parents on the edge of his home town then walked the eighty miles during the following three days. Arriving at Edinburgh University he matriculated and began the four year course leading to an M.A. with the prospect of a further three years after that to train for the Church. As all students did, he studied a general course not specialising in any particular topic although he showed particular promise in mathematics. In his first year he was somewhat withdrawn as he had been at school but by his second year he had become more confident, and was making friends with his fellow students. He was described by a fellow student while in his second year as:-\n... distinguished ... by the same peculiarities that still mark his character - sarcasm, irony, extravagant sentiment, and a strong tendency to undervalue others, combined however with great kindness of heart and great simplicity of manner.\nHe was, however, inspired by the mathematics teaching of\nLeslie\nbut one would have to say that his opinions of most of his other lecturers was poor to say the least.\nIn November\n1813\nhe completed his M.A. course but, like many students at this time, chose not to graduate. He enrolled in Divinity Hall of the Church of Scotland in Edinburgh for his divinity training, but as his parents could not afford to have him study full time for three years, he chose the option of one year of full time study followed by six years part-time study during which he had to return to Edinburgh and preach a trial sermon once a year for each of the six years. Carlyle completed the one year of full time study but did not enjoy it. During this year he maintained his mathematics interest by publishing articles in newspapers and greatly enjoyed entering into controversial intellectual discussions. He left Edinburgh in June\n1814\nand returned to Annandale. With a strong recommendation from\nLeslie\n, he was appointed as a mathematics teacher at Annan Academy\n[\n3\n]\n:-\nFrom the start Carlyle anticipated that he would dislike teaching. Moreover, he had to face the irony that Annan Academy was where he had been unhappy for most of his schooldays.\nIn\n1816\nhe moved to another school, again as a mathematics teacher, this time in Kirkcaldy. At least this had the advantage he could get easily to Edinburgh by taking a ferry ride across the Forth. His life was made harder since around this time his mother had a severe mental illness. He continued to study mathematics on his own and in\n1816\nhe tried to read\nNewton\n's\nPrincipia\nbut finding this difficult he read\nDelambre\n's\nAbrégé d'astronomie\nthen returning to the\nPrincipia\nwith more success. He continued his part-time divinity training and returned to Edinburgh to give a trial sermon on the text \"Before I was afflicted I went astray\". In\n1817\nhe tried to understand the Continental approach to the calculus by reading\nWallace\n's article\nFluxions\nwhich was published in the\nEdinburgh Encyclopaedia\nin\n1815\nand used\nLeibniz\n's differential notation. Again he found it difficult and, discovering his mathematical limitations, he began to lose his enthusiasm for the subject. He wrote to a friend in November\n1817\n[\n11\n]\n:-\n[\nGeometrical problem solving\n]\ndepends very much upon a certain slight of hand, that can be acquired without great difficulty by frequent practice - I am not so sure as I used to be that it is the best way of employing one's self - without doubt it concentrates our mathematical ideas and exercises the head; but little knowledge is gained in the process.\nUnhappy with teaching, Carlyle resigned from his post in Kirkcaldy in\n1818\n, and returned to Edinburgh University.\nLeslie\n, seeing that despite being a very competent mathematician, he would never excel at research, advised him to use his mathematical skills by studying engineering and then suggested that he should go to the United States. Carlyle chose not to follow\nLeslie\n's advice but, despite making a little money as a mathematics tutor, he was in severe financial difficulties. He made an attempt to study law taking some classes in\n1819\nbut soon discovered that this was not to his liking. He spent three unhappy years in Edinburgh, eventually deciding that he would change direction again. He began a serious study of German and he turned to history and literature for which he is famed. In mathematics Carlyle is famed for his English translation of\nLegendre\n's\nEléments de géométrie\nwhich David Brewster commissioned him to undertake for £\n50\nin\n1821\n. This translation, which first appeared in\n1824\n, ran to\n33\neditions.\nCarlyle held a number of posts as a tutor after leaving Edinburgh University, having no fixed base. In\n1821\nhe met Jane Baillie Welsh whose father John Welsh had been a respected Haddington doctor but had just died of typhoid. Jane was nineteen years old at the time and her mother Grace Welsh was finding things very difficult. Carlyle was soon sending Jane letters showing his affection, but she found it hard to imagine that she might ever marry. However she wrote to Carlyle, going against her mother's wishes in doing so\n[\n3\n]\n:-\nDespite Jane's warning that he would repent of it, Carlyle went to Haddington the first weekend in February\n1822\n. The visit was a painful disaster: both mother and daughter resented the brash appearance of a young man who did not qualify as a suitor and who was too assertive to be welcomed as a friend.\nDespite little encouragement, Carlyle persisted in his attempts to win Jane over. She worried, however, that she did not love him and she also worried that if they married she would have a much lower standard of living. Carlyle lived for a year at a small isolated farm called Hoddam Hill near the town of his birth. Then, after Jane's mother rented a home on the outskirts of Edinburgh for the couple to live in once they were married, the marriage took place on\n17\nOctober\n1826\n.\nSeveral important events happened in the years between Carlyle meeting his future wife and their marriage. One was that, despite his very religious upbringing, he turned away Christianity and became an atheist. He began to write and his first work\nThe Life of Schiller\nwas published in the\nLondon Magazine\n(1823\n-\n24)\n, then soon after his translation of Goethe's\nWilhelm Meister\nappears in the same publication in\n1824\n. He had also made a short trip to London in\n1824\nwhere he met a number of the leading literary figures at dinners and arranged visits. It was perhaps ironical that the type of mathematics position which would certainly have interested him a few years earlier now came up. He was told that if he applied for the position of Professor of Mathematics at the Royal Military College at Sandhurst in Surrey he was certain of being appointed. However, he felt that his literary career was taking off and that it would be damaged by his holding such a post; he chose not to apply.\nIn the spring of\n1827\nCarlyle and his wife began to consider living at Craigenputtoch, a small farm about\n20\nmiles from Dumfries which Jane had inherited from her father. Carlyle still fancied a university post, however, and in May\n1827\nhe wrote an application letter\n(\nsee\n[\n12\n]\n)\n:-\nI have more than once meditated inquiring of you about that \"London university\" of yours. I learn from the newspapers that the people have advertised for professors. ... to myself it seems that some moral philosophy or rhetoric professorship there would be no such unhansome appointment. I can teach mathematics also, and physics ... and touches of metaphysics. But the fittest place for me would be that \"Jack of all trades\" in case they wanted such a hand.\nPerhaps not surprisingly this rather strange letter of application did not lead anywhere. It is interesting, however, that even at this stage, Carlyle was still interested in teaching mathematics. Carlyle also applied unsuccessfully for the chair of moral philosophy at St Andrews University, and he even applied for the chair of astronomy at Edinburgh University in\n1834\n.\nCarlyle and his wife spent six years living at Craigenputtock, from\n1828\nuntil\n1834\n, after which he went to set up home in London. His first major work was the philosophical play\nSartor Resartus\n. He had completed it in\n1831\nbut despite spending several months in London attempting to find a published he failed. He did however publish\nCharacteristics\nin the\nEdinburgh Review\nin\n1831\n. After he moved to London in\n1834\nhe wrote the three volume historical work\nThe French Revolution\nwhich brought him both popular and academic fame after its publication in\n1837\n. However writing the work proved very dramatic. After completing the manuscript of the first volume he gave it to his friend John Stuart Mill to read. Somehow the manuscript was mistaken for waste paper and used to kindle of fire. Carlyle had to rewrite the whole volume from memory. He also had\nSartor Resartus\npublished in\n1838\n. As well as his historical works Carlyle wrote\nChartism\n(1840)\nwhich opposes conventional economic theory.\nThese works had achieved fame for Carlyle who now received invitations to lecture which solved his financial problems. He gave a series of lectures beginning in May\n1837\non the German influence on Britain, and another series in the following year on European literature. Further lectures series were given in\n1839\nand\n1840\n. His later historical works include\nThe Letters and Speeches of Oliver Cromwell\n(1845)\n, and the six volume work\nThe History of Friedrich II of Prussia, Called Frederick the Great\n(1858\n-\n1865)\n.\nCarlyle became rector of Edinburgh University in\n1865\nafter Gladstone retired from the office. He had been elected by the students in a contest with Disraeli. His installation address\nOn the Choice of Books\n(1866)\nwas published and its tone of high moral exhortation made it very successful. In fact Carlyle was still at the University following his address when news reached him that his wife had died in London on\n21\nApril.\nA O J Cockshut, writing in\n[\n1\n]\n, describes Carlyle in these words:-\nThough incapable of lying, Carlyle was completely unreliable as an observer, since he invariably saw what he had decided in advance that he ought to see. ... Carlyle was never able to respect ordinary men ... His fierceness of spirit was composed of two elements, a serious Calvinistic desire to denounce evil and a habitual nervous ill temper, for which he often reproached himself but which he never managed to defeat.\nFroude, who was a personal friend, sums Carlyle's character up in\n[\n6\n]\n:-\nHe was fierce and uncompromising. To those who saw but the outside of him he appeared scornful, imperious and arrogant. He was stern in his judgment of others ... insincerity ... he could never pardon ... He would not condescend to the conventional politenesses ... He called things by their right names, and in a dialect edged with sarcasm ... His temper had been ungovernable from his childhood; he had the irritability of a dyspeptic man of genius ... he who preached so wisely on 'doing the duty which lay nearest to us', forgot his own instructions ... He was always sad: often gloomy in the extreme.",
  "matematicos_citados_na_biografia": [
    "Leslie",
    "Newton",
    "Delambre",
    "Wallace",
    "Leibniz",
    "Legendre"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}