{
  "nome_completo": "Tibor Radó",
  "nome_curto": "Tibor Radó",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rado/",
  "data_nascimento": "2 June 1895",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "12 December 1965",
  "local_morte": "New Smyrna Beach, Florida, USA",
  "summary": "Tibor Radó was a Hungarian mathematician best known for his solution to the Plateau Problem.",
  "biografia": "Tibor Radó\n's parents were Alexander Radó and Gizella Knappe. He attended school in Budapest, then in\n1913\nhe entered the Polytechnic Institute in Budapest where he studied civil engineering. He had not progressed far into his course when World War I broke out.\nOn\n28\nJuly\n1914\nAustria attacked Serbia and Russia began to mobilise against Austro-Hungary. Two days later Russia mobilised against Germany who in turn declared war against Russia on\n1\nAugust then two days later against France. Austro-Hungary declared war against Russia on\n5\nAugust. Many more declarations of war followed. The Austro-Hungarian army was incompetently led and it suffered great losses in the first nine months of the war with over two million soldiers being killed. Badly overstretched with fighting on three fronts, Russia, Romania and Italy, the Austro-Hungarian army recruited new conscripts in\n1915\n. At this stage Radó enlisted as a lieutenant in the Austro-Hungarian army and was sent to the Russian front.\nThe Russians had been pushed back in\n1915\nbut in\n1916\n, led by General Brusilov, they gained victories over the Austro-Hungarian army. Around\n600000\nmen in the Austro-Hungarian army were killed or captured in the\n1916\nRussian offensive and Radó was one of those taken prisoner by the Russians. He was sent to a prison camp near Tobolsk in Siberia where he spent most of the following four years. Of course the Revolution in Russia in\n1917\nchanged the nature of the country and its relationship with the Allies for it withdrew from the war with other European countries. When World War I ended towards the end of\n1918\nRussia was in the midst of a violent internal conflict.\nIn the camp near Tobolsk Radó had met a fellow prisoner Eduard\nHelly\n. After being shot,\nHelly\nhad been captured by the Russians towards the end of\n1915\nand after a spell in hospital was by then in the same prison camp Radó. However unlike Radó, who had only just begun his university studies,\nHelly\nwas already a research mathematician who had made remarkable progress in his work on functional analysis, proving the\nHahn\n-\nBanach\ntheorem in\n1912\n. In the prison camp\nHelly\nacted as mathematics teacher to Radó who was also able to read books on mathematics.\nSiberia was a difficult place to be in\n1919\n. It was a stronghold of the White Russian forces which had gathered there. There was also a Czech army consisting of around\n50000\nescaped prisoners who joined the White Russians. The Japanese saw a chance of expansion and landed a large force in Siberia, while the Americans also landed forces there. None of this had a significant effect on the Russian Revolution but it did mean that Radó remained a prisoner in the midst of bitter conflict. At the end of the War, his own country of Hungary suffered severely for being on the losing side in World War I. It declared its independence from Austria but the Allies severely reduced its size with Romania taking much of its former land and\n750000\nMagyars found themselves in Czechoslovakia. Eventually in the confusion that was taking place in Siberia Radó was able to escape from the prison camp but returning to his much reduced country forced him to make a most remarkable journey.\nEscaping from the prison camp near Tobolsk, Radó made his way north to the Arctic regions of Russia. There Eskimos befriended him and offered him hospitality as he slowly made his way westwards. After a trek of many thousands of miles Radó reached Hungary in\n1920\n. It was five years since he had been studying as a student in Budapest, but now he returned to his studies, this time at University of Szeged.\nHelly\nhad shown him the fascination of research level mathematics so now it was mathematics rather than civil engineering that he studied.\nAt University of Szeged his teachers included Alfréd\nHaar\nand Frigyes\nRiesz\nand, with an interest in analysis coming from his contacts with\nHelly\n, he undertook research under\nRiesz\n's supervision. His first paper\nOn the roots of algebraic equations\nwas published in\n1921\nand in the following year he published his first paper on conformal mappings. He wrote his thesis in\n1922\nand was awarded his doctorate in the following year, remaining at Szeged as an assistant and\nPrivatdozent\n. Publications came thick and fast; he published three papers in\n1923\n, a further five papers in\n1924\n, four in\n1925\nand five in\n1926\n. This means that he had written around\n20\npapers within five years of starting his formal mathematical education, which is a quite remarkable achievement. There was no sign that this outpouring of mathematics was diminishing either as he continued to produce papers at the same rate over the next few years.\nLet us mention in particular the paper from this period, namely\nÜber den Begriff der Riemannschen Fläche\nⓉ\n(\nOn the concept of Riemann surface\n)\nwhich Radó published in\n1925\n. It gives necessary and sufficient conditions for the triangulability of topological surfaces and in proving these results he completed work on a problem which had been studied by some of the most famous of mathematicians\nRiemann\n,\nPoincaré\n, and\nWeyl\n. Also during this period Radó married Ida Barabás de Albis on\n30\nSeptember\n1924\n. They had two children, Judith Viola Radó and Theodore Alexander Radó.\nThe Rockefeller Foundation awarded Radó a fellowship to enable him to spend\n1928\nworking in Germany; part of the year being spent with\nCarathéodory\nin Munich and part with\nKoebe\nand\nLichtenstein\nin Leipzig. The following year saw Radó visit the United States where he was a visiting lecturer at Harvard University and Rice University. Then in\n1930\nhe was appointed to the faculty of Ohio State University at Columbus where he established the graduate mathematics programme. He remained on the staff at Ohio State University from this time until his retirement in\n1964\n.\nIn\n1930\nRadó published the work for which he is most famous, namely his solution to the\nPlateau Problem\n. Let us explain a little what the problem is about.\nPlateau\nwas a physicist who experimented with dipping thin wire frames into a soap solution and examining the soap film which was then stretched across the wire. Because the soap film is extremely light, gravity can be ignored and the soap film forms what is called a minimal surface, that is a surface of minimal area. Any deformation of the surface, such as might be produced by blowing on the film, increases the area of the surface. In fact\nPlateau\ndid not just examine soap films experimentally, but he also formulated the Plateau problem mathematically.\nPlateau\n's mathematical and physical experiments all suggested that for any bounding contour there is always a minimal surface bounded by that contour.\nThe problem of dealing with a general bounding contour proved extremely difficult. If the bounding contour was planar the problem was easily solved, but the bounding contour might be a complicated curve, even being knotted. Initial progress was made on the problem with proof of the existence of a minimal surface for certain less complicated contours.\nSchwarz\nmade an important contribution in\n1865\nas did\nRiemann\nat about the same time. Next to contribute were\nWeierstrass\nand\nDarboux\nbut even when he made his contribution in\n1914\nDarboux\nwrote about the complexities of the general case:-\nThus far mathematical analysis has not been able to envisage any general method which would permit us to begin the study of this beautiful question.\nGarnier made a major breakthrough in\n1928\nfollowed soon after by independent solutions to the general problem by\nDouglas\nand by Radó. Their approaches were very different, Radó's being via\nconformal mappings\n. He used conformal mappings of polyhedra, applying a limit theorem to certain approximations to obtain the minimal surface required. His solution appeared\n1930\nin\nThe problem of least area and the problem of Plateau\npublished in\nMathematische Zeitschrift\n. He published further papers on the Plateau problem in\n1930\n, namely\nSome remarks on the problem of Plateau\nand\nOn Plateau's problem\n. In\n1933\nhe published his impressive text\nOn the Problem of Plateau\n(\nreprinted in\n1951\nand again in\n1971)\nand another major monograph\nSubharmonic Functions\nappeared in\n1937\n. Let us remark that the solution to the Plateau problem by both\nDouglas\nand by Radó did not exclude the possibility that the minimal surface contained a singularity. In fact it never contains a singularity and this was shown for the first time by Osserman in\n1970\n.\nRadó spent\n1942\nas a visiting professor at the University of Chicago. Of course this was a time when many mathematicians were involved in war related research but he was not involved as this stage. Towards the end of the war, however, he did work for the United States Government as a science consultant to the armed forces. In this capacity he went to Germany at the end of the war to recruit the German scientists which the United States wanted to further its nuclear programme. It was in\n1945\n, the year that the war ended, that Radó was invited to be the\nAmerican Mathematical Society\nColloquium Lecturer. He gave his series of talks on his major contributions on surface area. The lectures he gave at this time formed the basis of his major text\nLength and Area\nwhich was published by the\nAmerican Mathematical Society\nin\n1948\n. The book:-\n... gives a systematic and detailed exposition of most of the contributions to the theory of the\nLebesgue\narea which have been made by C B Morrey, T Radó and Radó's students.\nThe end of the war also marked a time when Radó took on the role as chairman of the Department of Mathematics of Ohio State University, a position he held from\n1946\nto\n1948\n. He was invited to speak at the International Congress of Mathematicians in\n1950\nin Cambridge, Massachusetts and he chose a similar theme to his American Mathematical Society Colloquium Lectures, lecturing on\nApplications of area theory in analysis\n.\nIn\n1949\nRadó and Reichelderfer announced in their paper\nOn n-dimensional concepts of bounded variation, absolute continuity, and generalized Jacobian\ntheir intention to:-\n... develop a theory of bounded variation, absolute continuity, and generalized Jacobians which should be comparable in utility and scope with the classical one-dimensional theory.\nTheir theory was fully explained in the important monograph\nContinuous transformations in analysis : With an introduction to\nalgebraic topology\npublished in\n1955\n.\nThe\nMathematical Association of America\ninvited Radó to give the first Earle Raymond\nHedrick\nLectures at its meeting in the summer of\n1952\n. In the following year he was elected as vice-president of the American Association for the Advancement of Science. Around this time he lectured on\nThe Mathematical Theory of Rigid Surfaces: An Application of Modern Analysis\nat a conference at the University of North Carolina sponsored by the National Science Foundation. Among a large number of contributions to the mathematical life of the United States, he served as an editor of the\nAmerican Journal of Mathematics\n.\nIn the last decade of his life, Radó's interests turned to a new area when he found a fascination in the mathematics behind the newly developing ideas in computer science. He worked on logic and theoretical computer science, particularly\nTuring\nmachines, publishing\nOn non-computable functions\nin\n1962\nand\nComputer studies of\nTuring\nmachine problems\nin\n1965\n.\nIn fact this final publication appeared after he retired in\n1964\n. Sadly it was a short retirement for, after a long illness, he died in New Smyrna Beach, Florida in the following year. He was buried in Bellview Memorial Park, Daytona Beach, Florida.",
  "matematicos_citados_na_biografia": [
    "Helly",
    "Hahn",
    "Banach",
    "Haar",
    "Riesz",
    "Privatdozent",
    "Riemann",
    "Poincaré",
    "Weyl",
    "Carathéodory",
    "Koebe",
    "Lichtenstein",
    "Plateau Problem",
    "Plateau",
    "Schwarz",
    "Weierstrass",
    "Darboux",
    "Douglas",
    "conformal mappings",
    "American Mathematical Society",
    "Lebesgue",
    "algebraic topology",
    "Mathematical Association of America",
    "Hedrick",
    "Turing"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}