{
  "nome_completo": "Timofei Fedorovic Osipovsky",
  "nome_curto": "Timofei Fedorovic Osipovsky",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Osipovsky/",
  "data_nascimento": "2 February 1765",
  "local_nascimento": "Osipovo, Vladimir gubernia, Russia",
  "data_morte": "24 June 1832",
  "local_morte": "Moscow, Russia",
  "summary": "Timofei Fedorovic Osipovsky was a Russian mathematician who wrote some influential textbooks.",
  "biografia": "Timofei Fedorovic Osipovsky\n's name is sometimes written as\nOsipovskii\n. He was born in Osipovo, a town located about\n80\nkm northeast of Vladimir which is one of the oldest Russian communities. Vladimir is the capital of the region containing Osipovo and is situated about\n180\nkilometres northeast of Moscow on the bank of the Klyazma River.\nOsipovsky studied first at the seminary in Vladimir until\n1783\n, then for three years at the St Petersburg Pedagogical Institute leaving in\n1786\n. After graduating from the St Petersburg Teachers Seminary, Osipovsky taught mathematics and physics in Moscow. He later became a professor at Kharkov University which was founded in\n1805\n. The city of Kharkov\n(\nor to give the more usual modern spelling, Kharkiv\n)\n, thanks to its educational establishments, became one of the most important cultural and educational centres of Ukraine. V N Karazin Kharkov National University is one of the oldest universities in Eastern Europe. It was founded in November\n1804\n, on the initiative of the prominent educator V N Karazin and in accordance with the charter of Tsar Alexander I. The opening ceremony was held on\n29\nJanuary\n1805\n. At the time of its opening it had nine professors and\n11\nadjunts.\nOsipovsky was one of the nine professors appointed to Kharkov University in\n1805\n, the year of the foundation of the University. Afanasy I Stoikovich was appointed as the professor of physics at the same time as Osipovsky and he served as rector in\n1807\nand again\n1811\n-\n12\n. In\n1813\nOsipovsky became rector of the University. In\n1816\nMikhail Vasilevich Ostrogradski\nbegan studying at Kharkov University under Osipovsky. However in\n1820\nOsipovsky was suspended from his post on religious grounds and we now explain how this came about.\nIn\n1816\nPrince Aleksandr Golitsyn was appointed Minister of Education. He carried on a religious crusade against \"ungodly and revolutionary tendencies\", and required that science be taught from Christian principles. Kharkov, like other universities, received instructions on how to teach from a Christian viewpoint, demonstrating God's omniscience. In\n1820\n, following Golitsyn's lead, Osipovsky was dismissed by the Curator of Kharkhov University, Z Ia Karneev, because of an alleged lack of fervour when saying \"God lives\" during an oral examination of a graduate student. This had a rather serious consequence for his most famous pupil\nOstrogradski\nwho was examined by Osipovsky in\n1820\n, for, following Osipovsky's dismissal, the Ministry of Education refused to confirm the award of\nOstrogradski\n's doctorate. They required him to retake the examinations\n(\nofficially on the grounds that he had not attended lectures on philosophy and theology\n)\n, but, knowing that the real reason was that he had been examined by Osipovsky, he refused to retake the examinations and never received the degree.\nOsipovsky was one of the best mathematicians in Russia at the beginning of the nineteenth century. His most famous work was the three-volume handbook\nA Course of Mathematics\n(1801\n-\n1823)\nwhich covered function theory, differential equations, and the calculus of variations. This handbook soon became a standard university text and was used in universities for many years, introducing an entire generation of Russians to mathematics. He also translated\nLaplace\n's\nMéchanique céleste\ninto Russian.\nOther work by Osipovsky outside mathematics was in physics, astronomy and philosophy, and it is in this latter subject that he has acquired the greatest lasting fame. In\n1795\nhe gave a lecture in Moscow's Main Public School in which he stressed that Bacon and\nDescartes\nhad alerted philosophers against the teachings of Peripatetics who made no use of observation or experiment. On\n30\nAugust\n1807\nhe delivered a lecture\nOn space and time\nat Kharkov University in which he questioned Kant's ideas on the subject. We quote from the published version of this lecture below. Again in\n1813\n, at the annual lecture sponsored by Kharkov University, he claimed that Bacon and\nDescartes\nhad freed modern science from ancient Greek philosophy.\nIn\nOn space and time\nOsipovsky criticised Kant's doctrine of the\na priori\nnature of geometric notions\n(\nquotation from\n[\n1\n]\n)\n:-\nI agree with the founder of critical philosophy\n[\nKant\n]\nthat it is impossible to deduce irrefutable synthetic conclusions from notions acquired from experience when the acquisition is understood precisely in the sense in which he assumes it, that is, when one acquires ideas about certain special cases belonging to a single whole but not marked with the stamp of universiality. But the notion of space is acquired in a very different manner: it begins with the whole and the parts are already contained in it; for everyone knows, and Mr Kant himself says, that the notion of space precedes the notion of all things that borrow parts of this whole. The possibility of obtaining an idea of the whole space together with its parts is implicit, in the first place, in the very manner in which we acquire this notion, that is, in our sense of vision that is so constructed that the whole is imprinted on it together with all its parts; and in the second place, in that the whole is uniform in its entirety and continuous.\nKant had argued that if space were the condition of existence of things and so were in them and not in us, then there is no way that we could be certain that this property of space that our senses attribute to an object is really a property of that object. Osipovsky in\nOn space and time\nexamines Kant's argument\n[\n1\n]\n:-\nNo one will take it upon himself to prove that the space that we perceive in things is completely the same in them as we perceive it; it is enough that there is in them something that corresponds to what we observe, and that it corresponds in accordance with a constant law of dependence between what is in them and that which imprints on our sensations. If, on the contrary, there is nothing in the thing that corresponds to the notion, related to space, that is born in us when we sense it, that is, if there is no mutual dependence whatever between this thing and our notion, then why will the notion relate to the thing? For example, if nothing corresponds in a sphere to the roundness that we perceive when we look at a sphere why then can we link the notion of roundness to the notion of sphere; for then these ideas will be totally unrelated to one another. In that case, all synthetic chains of ideas proposed and proved in mathematics in relation to space would be pure chimeras, that arise just in our heads in an involuntary but incoherent manner, have no relation whatever to things and are therefore incapable of any application to them; but it is well known that no one ever said anything more true than\nEuclid\nin his 'Elements' and nowhere is there a more precise correspondence than the one between the truths proposed in the 'Elements' and what is actually observed in things.\nIn the same work Osipovsky sums up his ideas on space and time\n[\n1\n]\n:-\nAll that has been said above makes one think that space and time are conditions for the existence of things that exist in nature and in themselves and not only in our form of sensation. As regards space, my view is this: the notion about it arises from impressions that originate in it with the aid of the action of our outer senses on our inner senses.",
  "matematicos_citados_na_biografia": [
    "Mikhail Vasilevich Ostrogradski",
    "Ostrogradski",
    "Laplace",
    "Descartes",
    "Euclid"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}