{
  "nome_completo": "Tobias Mayer",
  "nome_curto": "Tobias Mayer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mayer_Tobias/",
  "data_nascimento": "17 February 1723",
  "local_nascimento": "Marbach, Württemberg, Germany",
  "data_morte": "20 February 1762",
  "local_morte": "Göttingen, Germany",
  "summary": "Tobias Mayer was a German scientist who developed the method of determining longitude by lunar observations.",
  "biografia": "Tobias Mayer\nwas a self taught mathematician. Although born in Marbach, he was brought up in Esslingen where he lived in very poor conditions. His first published work was\nNeue und allgemeine Art, alle Aufgaben aus der Geometrie vermittelst der geometrischen Linien leichter insbesondere wie alle reguläre und irreguläre Vielecke, davon ein Verhältnis ihrer Seiten gegeben, in den Circul geometrisch sollen eingeschrieben werden, sammt einer kurzen nötigen Buchstaben-Rechnenkunst und Geometrie\nⓉ\n(\nIn a new and general way, all the tasks of geometry calculated easily by means of the geometric lines; especially for all regular and irregular polygons included in the circle geometrically, where it has a ratio of its sides, together with a brief necessary letter on Computing Art and Geometry\n)\nwhich was published in Esslingen in\n1741\n. Let us note that he was only eighteen years old when this book was published, a remarkable achievement for anyone but particularly for someone from a poor family. Eric Forbes writes in\n[\n8\n]\n:-\nTobias Mayer's interest in mathematics appears to have stemmed from his reading of the two books: Christian von Wolff's 'Anfangs-Gründe aller mathematuscher Wissenschaften'\nⓉ\n(\nInitial reasons all mathemical sciences\n)\nand\nJohann Christian Sturm\n's 'Mathesis enucleata'\nⓉ\n(\nMathematical spokesman\n)\n. At any rate, he acknowledges his debt to these two books when, on the occasion of his eighteenth birthday, he wrote the preface to his first printed work - a treatise concerned with the application of algebraic methods to problems of elementary and higher geometry. A comparison of Mayer's book with those others indicates that he was dependent upon Wolff for his knowledge of mathematical techniques and upon Sturm for providing the model on which he based his own presentation. The method which is given by the former for determining the area of an irregular polygon\n(\nor irregularly-shaped field\n)\nwas illustrated by Mayer in his next major work, the 'Mathematischer Atlas'\nⓉ\n(\nMathematical Atlas\n)\n(\nAugsburg,\n1745)\n. ...\nHe was employed as a cartographer in Nürnberg from\n1746\n, when he began working for the Homann Heirs company which succeeded the firm established in Nürnberg by the famous cartographer Johann Baptist Homann. In\n1749\n, while working for the Homann Company, Mayer produced a map of the moon measuring seven and a half inches in diameter. It was the first map of the moon which used accurately measured positions of the craters. In fact Mayer measured the positions of\n24\ncraters, which he included in the map, using a micrometer to obtain an accuracy of\n1\n' in latitude and longitude. He also produced a detained map of Switzerland, showing the thirteen Cantons with accurately placed towns, rivers, lakes and political divisions. Mayer's map was published by Homann in\n1751\n. Mayer showed his outstanding abilities by introducing many improvements in cartography, but he also discovered the libration of the Moon which he published in\nKosmographische Nachrichten\nⓉ\n(\nCosmographic News\n)\n(\nNürnberg,\n1750)\n. This and other scientific achievements gained him fame which led to his appointment as Professor of Economics and Mathematics at Göttingen in\n1751\n. Being a map maker, it was natural for Mayer to make a map illustrating his journey from Nürnberg to Göttingen. The route, through Bamberg and Meiningen, is considered the first road map produced in Germany. From the time he took up his position in Göttingen, Mayer corresponded with\nLeonard Euler\n. For details of this correspondence see\n[\n3\n]\n.\nMayer invented a clever improvement to the reflecting circle in\n1752\n. It is described in detail by Joseph de Mendoza Rios who submitted his paper 'On an improved reflecting circle' to the\nPhilosophical Transactions of the Royal Society\nin\n1801\n. De Mendoza Rios writes:-\nAs the reflecting instruments employed at sea are supported by the hand, their weight and scale are limited within a narrow compass; and it seemed very difficult to obviate, by any expedient, the inconveniences arising from the smallness of their size, while it was impossible to increase it. The celebrate Tobias Mayer contrived, however, a method to determine, at one reading, instead of the simple angle observed, a multiple of the same angle; and, by this means, the instrument became, in practice, capable of any degree of accuracy, as far as regards the above mentioned errors. His invention is essentially different from the mere repetition of the observations ...\nIn fact Tobias Mayer's improvements to the reflecting circle were further developed by\nJean Charle de Borda\nand used in the measurements of the arc of the meridian by\nJean Baptiste Delambre\nand\nPierre Méchain\nin their efforts to define the metre.\nIn\n1754\nMayer was made Director of the Göttingen Observatory where he continued to work until his death. During his time in Göttingen, he lectured on mathematics, mechanics and optics, and introduced projective methods into astronomy and geography. On\n1\nMarch\n1755\n, Mayer addressed the\nGöttingen Academy of Sciences\n. His address, given in Latin, was entitled 'De transmutatione figurarum rectilinearum in triangula'\nⓉ\n(\nTransforming rectilinear figures into triangles\n)\n. In this address he gave a method for determining the area of an irregular polygon which was different from that presented in his book\n10\nyears earlier. Eric Forbes makes a conjecture in\n[\n8\n]\n:-\nIt is generally believed that his manuscript of this lecture is lost; but it may never have existed. Bearing in mind that the publication of the Göttingen Commentarii had been suspended owing to an unfortunate dispute with the printer, and that Mayer spoke Latin eloquently, it is not unreasonable to conjecture that he may have decided to base his talk upon\n[\na\n]\nGerman tract preserved among his unpublished writings in the Göttingen University Library.\nMayer began calculating lunar and solar tables in\n1753\nand in\n1755\nhe sent them to the British government. These tables were good enough to determine longitude at sea with an accuracy of half a degree. Mayer's method of determining longitude by lunar distances and a formula for correcting errors in longitude due to atmospheric\nrefraction\nwere published in\n1770\nafter his death.\nIn a preface written to his tables written in\n1760\nMayer says:-\nI am the more unwilling my tables should lie any longer concealed; especially as the most celebrated astronomers of almost every age have ardently wished for a perfect theory of the Moon ... on account of its singular use in navigation. I have constructed theses tables ... with respect to the inequalities of motions, from that famous theory of the great\nNewton\n, which that eminent mathematician Eulerus first elegantly reduced to general analytic equations.\nIn the first issue of the Nautical Almanac there was a description by\nNevil Maskelyne\nof Mayer's tables:-\nThe Tables of the Moon had been brought by the late Professor Mayer of Göttingen to a sufficient exactness to determine the Longitude at Sea to within a Degree, as appeared by the Trials of several Persons who made use of them. The Difficulty and Length of the necessary Calculations seemed the only Obstacles to hinder them from becoming of general Use.\nThe Board of Longitude sent Mayer's widow £\n3000\nas an award for the tables. Despite this being a large amount of money, nevertheless it was much less that the amount on offer for solving the longitude problem. James Bradley, who had like Mayer, put a great deal of work into the production of lunar tables told John Harrison that he and Mayer would have shared the £\n10\n,\n000\nprize money but for Harrison's \"blasted watch.\"\nMayer catalogued stars and made the first study of the proper motions of\n80\nstars. He also made a catalogue of double stars. Beginning in\n1779\n, seventeen years after Mayer's death,\nWilliam Herschel\nbegan searching for double stars. He produced a catalogue of\n269\nsuch pairs,\n227\nof which were first discovered by him. However, when he was given the memoir of Tobias Mayer, published after his death, he found that Mayer had discovered\n31\ndouble stars that he had overlooked. There are other achievements by Mayer which we should mention such as his theories of earthquakes, atmospheric refraction, magnetism, vision, and colour. It is not surprising that someone who spent many hours in careful observations of astronomical objects should be interested in the theory of vision, and in particular the limits of vision for very faint objects. Mayer wrote in\n1755\nthat:-\n... there is a certain visual angle below which an object presented to the eye appears either not distinct enough or not even distinct at all, but only confused and as though it had vanished from sight. ... We shall call this angle the limit of vision, and we shall investigate its angle by experiment. ... objects seen under such circumstances will not be visible unless they subtend in the eye an angle of more than\n34\n'', those subtending a smaller angle will definitely escape visual acuity.\nFinally, let us look briefly at Mayer's theory of colour. It is contained in a lecture he gave to the\nGöttingen Academy of Sciences\nentitled\nDe affinitate colorum commentatio\nⓉ\n(\nCommentary on the affinity of colour\n)\n. His aim, similar to his investigation of the limits of vision, was to attempt to establish how many colours the eye is capable of distinguishing. He took red, blue and yellow as the three basic colours, and then looked at mixing a certain number of twelfth parts of these basic colours. He postulated that amounts smaller than a twelfth part would not be visible to the eye. For example, he would claim that\n19\nparts red to one part blue was indistinguishable from red, but\n11\nparts of red to\n1\npart of blue was distinguishable by the eye from red. Using this\n12\npart rule, he then constructed colours such as green\n(6\nparts blue,\n6\nparts yellow\n)\n. This led him to construct a 'colour triangle' with his three basic colours at the vertices, and\n91\ndifferent colours. He then considered adding up to four parts of black, or white, thereby constructing a three dimensional array of colour triangles each with a different number of parts of black or white. In the end he had\n910\ndifferent colours which he claimed could be distinguished by the eye. Mayer's colour triangle was unpublished at his death but\nJohann Heinrich Lambert\nmade use of the triangle and suggested that it be published, which took place in\n1775\n. In fact\nLambert\nalso made use of Mayer's stellar data in\n1761\nwhen he used Mayer's catalogue of stars with proper motions in his theory of the universe given in his\nCosmological Letters\n.",
  "matematicos_citados_na_biografia": [
    "Johann Christian Sturm",
    "Leonard Euler",
    "Jean Charle de Borda",
    "Jean Baptiste Delambre",
    "Pierre Méchain",
    "Göttingen Academy of Sciences",
    "refraction",
    "Newton",
    "Nevil Maskelyne",
    "William Herschel",
    "Johann Heinrich Lambert",
    "Lambert"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}