{
  "nome_completo": "Victor Amédée Lebesgue",
  "nome_curto": "Victor Amédée Lebesgue",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lebesgue_Victor/",
  "data_nascimento": "2 October 1791",
  "local_nascimento": "Grandvilliers, Oise, France",
  "data_morte": "10 June 1875",
  "local_morte": "Bordeaux, Gironde, France",
  "summary": "Victor-Amédée Lebesgue was a French mathematician who worked on number theory.",
  "biografia": "Let us first note that the two forms of the name 'Lebesgue' and 'Le Besgue' appear to be almost equally common but we will use the form Lebesgue throughout this biography.\nVictor Amédée Lebesgue\n's parents were Simon Pierre Lebesgue\n(\nborn\n8\nMay\n1752)\nand Marie Catherine Denis\n(\nborn\n8\nNovember\n1750\nin Amblainville, Oise\n)\n. Simon Pierre and Marie Catherine were married at Beauvais on\n30\nDecember\n1783\n. At the time Victor Amédée was born, his father Simon Pierre was a commissioner at the court for the district of Grandvilliers. This district was an historical one which only existed in the north east of Oise from\n1790\nto\n1795\n. After this, he became a judge sitting at the Appeals Court in Amiens. Victor Amédée began his schooling at the Lycée in Amiens and there he met and became friends with Charles Alexandre\n(\nborn\n19\nFebruary\n1797\nin Amiens; died\n6\nJune\n1870\nin Paris\n)\n. As will be seen from these dates, there was a six and a half year age difference, but Alexandre attended the Lycée at Amiens from\n1806\nto\n1811\nand, despite the age difference, the two became lifelong friends. Their interests were very different, with Lebesgue more interested in mathematics while Alexandre was interested in ancient languages. However, many years later Alexandre played a role in helping Lebesgue with his career. After leaving the Lycée in Amiens, Lebesgue completed his studies at the Collège de Beauvais in Paris in\n1809\n.\nOnce he had completed his schooling, Lebesgue was required to undertake military service and he enlisted in the army at the end of\n1809\n. He spent a year in the army, employed in the offices of the Administration. The system as it operated in France at this time, called 'remplacement militaire', allowed wealthy citizens to pay a sum of money, essentially the amount required to pay for someone else to serve in their place, to avoid military service. After serving for one year, Lebesgue decided he wanted to return to civilian life and the only way to do that was via the 'remplacement militaire' system. Through sacrifices that he made himself and with the help of one of his parents, he was able to pay the necessary sum and in\n1810\nreturned to civilian life. He studied in Paris and was awarded the degree of Bachelor of Science in\n1813\n.\nAfter graduating, Lebesgue was appointed as a master at the Lycée at Reims. Moving on, over the following years he taught next at the College of Saint-Quentin in\n1814\nand then at the College of Abbeville in\n1817\nwhere he taught for three of four years. He then left school teaching, taking a position as a tutor to an English family. He moved to London where he acted as a tutor to the family for one year. Continuing in his career as a private tutor, Lebesgue next took a position as a tutor to a Russian family and he moved to Russia where he stayed until\n1830\n. While in Russia he had been undertaking research in number theory and he published three papers with the title\nExtrait d'un Mémoire inédit sur les congruences d'un degré quelconque, et à une seule inconnue\nⓉ\n(\nExcerpt from an unpublished memoir on congruences of any degree with a single unknown\n)\n. These were published in the first two volumes of the\nBulletin du Nord\n, published in Moscow in\n1829\n. The three papers appeared in the January\n1829\n, March\n1829\nand May\n1829\nparts of the\nBulletin\n. He returned to France in\n1830\n.\nAt this stage in his career Lebesgue was helped by his friend Charles Alexandre who was head of the Royal Bourbon College and later, in\n1840\n, was appointed inspector-general of studies in place of M Poullet-Delise who retired at this time. Alexandre was a friend of\nSiméon-Denis Poisson\nwho, at this time, was a member of the Royal Council of Public Instruction, of the Directorate General of Mathematical Education. Alexandre asked\nPoisson\nif he could arrange a position for Lebesgue, giving him an excellent recommendation.\nPoisson\narranged for Lebesgue to obtain a position as a lecturer at the Royal College of Nantes, then in the following year as professor at the college of Epinal, where he remained for two years.\nIn\n1834\n, he went to Paris to attend the Sorbonne, with the intention of competing for the\nagrégation\n. Lebesgue had obtained leave from his position to allow him to follow the two year course. In spite of the entreaties of his friends, he did not proceed with this project, and was sent to Neufchateau; he spent the years\n1835\nand\n1836\nthere. Lebesgue was very active in research and published many papers. He corresponded with\nPoisson\n, who was very impressed by the quality and depth of Lebesgue's work.\nAntoine Cournot\nhad obtained a position with the\nAcademy of Sciences\nin\n1833\n, arranged by\nPoisson\n. Again it was due to\nPoisson\n's recommendation that\nCournot\nwas appointed to a newly created chair in analysis at Lyon in\n1834\n. In\n1835\nCournot\nbecame professor of mathematics at Grenoble and rector there. A substitute for Cournot at Grenoble was required and Lebesgue was appointed to this position. He had, at the age of\n46\n, at last become a teacher at a university. Of course, he had never obtained a doctorate, but this was quickly achieved when he submitted\nThèses de Mécanique et d'Astronomie\nⓉ\n(\nTheses on mechanics and astronomy\n)\nto the University of Grenoble in\n1837\n. The thesis was in two parts, the first being\nFormules pour la transformation des fonctions homogènes du second degré à plusieurs inconnues\nⓉ\n(\nFormulas for the transformation of homogeneous functions from the second degree to several unknowns\n)\nwhile the second, much shorter part, was\nApplications.\nThe Faculty of Sciences at Bordeaux was organized at the end of\n1838\n, and Lebesgue was called upon to occupy the Chair of Pure Mathematics. He remained in that position for twenty years until the end of\n1858\n, when he decided to retire. In\n1839\nhe had been ranked third in line for a place as corresponding member in the Geometry Section of the\nAcademy of Sciences\n;\nM Chasles\n, who was ranked in the first place, was elected on this occasion. A new vacancy occurred in\n1847\nand Lebesgue was unanimously elected at the meeting which took place on\n8\nFebruary\n1847\n. Earlier, he had received the decoration of the Légion d'Honneur in\n1845\n.\nOne of his friends was the number theorist Eugène Prouhet\n(1817\n-\n1867)\nwho had been a student of\nCharles-François Sturm\nat the École Polytechnique in Paris. Prouhet assisted Lebesgue in the preparation of his book\nExercices d'Analyse numérique. Extraits, Commentaires et Recherches relatifs à l'Analyse indéterminée et à la Théorie des Nombres\nⓉ\n(\nNumerical analysis exercises. Excerpts, Comments and research related to indeterminate analysis and the theory of numbers\n)\n(\nLibraire Centrale des Sciences, Paris,\n1859)\n. In it he writes:-\nThe various parts of these Exercises being brought together might, by means of some modifications, form an elementary treatise on the theory of numbers.\nHe hoped that sufficient interest would be shown and subscribers found to fund the publication of a second part but this was not the case. However, prince Alphonse de Polignac\n(1826\n-\n1863)\n, himself a number theorist, supported the publication of Lebesgue's second book\nIntroduction à la Théorie des Nombres\nⓉ\n(\nIntroduction to number theory\n)\n(\nMallet-Bachelier, Paris,\n1862)\n. Lebesgue explains these circumstances in the Preface to the work:-\nAs early as\n1858\n, when I left my duties as a professor at the Faculty of Sciences at Bordeaux, I had resolved to devote my leisure to this work. I then published Exercices d'Analyse numérique, and I announced the publication by subscription of the book in question. The small number of subscribers did not allow this intention to be carried out, and I had relinquished it with regret, when prince Alphonse de Polignac\n(1826\n-\n1863)\n, who is himself engaged in number theory research, as can be seen from the reports of the sessions of the\nAcademy of Sciences\n, was kind enough to remove most of the obstacles that prevented me. My gratitude for this service will undoubtedly be shared by all those who, like the prince, think that a clear exposition of the present state of the theory of numbers, especially since it is well-established, cannot fail to serve for the advancement of pure mathematics.\nFor the complete Prefaces to both these books, see\nTHIS LINK\n.\nAlthough Lebesgue had only spent\n20\nyears as professor at Bordeaux, nevertheless by the time he retired in\n1858\nhe had published\n80\nmathematics articles. For a list of Lebesgue's publications, see\nTHIS LINK\n.\nIn fact after retiring from Bordeaux, Lebesgue returned to Paris where he spent the years from\n1858\nto\n1861\nworking on the two books we have just mentioned. It was while he was in Paris that he was able to get the support he needed from prince Alphonse de Polignac. Despite the fact that he was working on his books during these years in Paris, Lebesgue still managed to publish three papers in\n1858\n, seven papers in\n1859\n, and three papers in\n1860\n. In\n1861\nhe returned to Bordeaux, mainly because he found the winters in Paris too severe and wished to return to the warmer climes of Bordeaux. Although he was now retired, nevertheless once back in Bordeaux he again lectured at the University. After he had retired from the Chair of Pure Mathematics at Bordeaux, Jules Hoüel had been appointed to fill the chair which he held from\n1859\nuntil his death in\n1886\n. Lebesgue and Hoüel collaborated and Hoüel did much to help Lebesgue in preparing\nTables diverses pour la Décomposition des Nombres en leurs Facteurs premiers\nⓉ\n(\nVarious tables for the decomposition of Numbers into their prime factors\n)\n(\nGauthier-Villars, Paris,\n1864)\n. Lebesgue writes in the Introduction:-\nM Hoüel, Professor at the Faculty of Science of Bordeaux, was kind enough to take charge of the construction of this table, according to my indications. He has also lent me his help in coordinating the materials contained in this Memoir, and for the correction of the proofs.\nIn this work, he gives tables of divisors of numbers from\n1\nto\n115500\nconstructed by sieve methods. We give a couple of sentences from Lebesgue's Introduction at\nTHIS LINK\n.\nAfter two years at Bordeaux, when he was working on his\nTables\n, Lebesgue again went to Paris but after only a short stay he again returned to south west France, living in Bordeaux. He then moved around, keeping to south west France, living in towns such as Agen which is\n135\nkm south east of Bordeaux, Augouleme, which is north east of Bordeaux, Dax, a spar town south of Bordeaux, and Pau, even further south near the Pyrenees and not far from the Spanish border. He spent the last twelve years of his life in these south east towns where the climate was to his liking; wet and mild in the winter and warm in the summer. He continued to undertake research and published\n23\npapers during these final years of his life. These include questions he posed and solutions to questions of others that he had solved. Two of these papers are posthumous, one of which is included in\n[\n1\n]\n(\nbut not in\n[\n2\n]\n)\nin which Lebesgue gives an overview of his own research contributions. He divides his contributions into: Higher Algebra; Infinitesimal Analysis; and Number Theory, this last being by far the most substantial of the three sections.\nWhile in Pau in May\n1875\nhe was struck down with a serious illness with alarming symptoms. His daughter hurried to his side and arranged for him to be brought back to Bordeaux. He died in Bordeaux at nine o'clock in the evening on\n10\nJune.\nHe is described in\n[\n1\n]\n(\nand\n[\n2\n]\n)\nas follows:-\nVery simple manners, of a character full of frankness, and independence, virtuous at every test, never seeking the opportunities of putting himself to the fore, Lebesgue lived a very solitary life, constantly occupied with his favourite studies.",
  "matematicos_citados_na_biografia": [
    "Siméon-Denis Poisson",
    "Poisson",
    "agrégation",
    "Antoine Cournot",
    "Academy of Sciences",
    "Cournot",
    "M Chasles",
    "Charles-François Sturm",
    "THIS LINK"
  ],
  "imagens": []
}