{
  "nome_completo": "Victor Omololu Sowemimo Olunloyo",
  "nome_curto": "Victor Olunloyo",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Olunloyo/",
  "data_nascimento": "14 April 1935",
  "local_nascimento": "Ibadan, Nigeria",
  "data_morte": "6 April 2025",
  "local_morte": "Ibadan, Nigeria",
  "summary": "Victor Olunloyo is a Nigerian mathematician who published results on number theory. He became governor of Oyo State in Nigeria in October 1983 until unseated by a military coup.",
  "biografia": "Victor Olunloyo\nis the son of Horatio Vincent Sowemimo Olunloyo and Alhaja Bintu Tejumola Abebi. Horatio Olunloyo, a scholar, organist and administrator who also served in the Nigerian Army, died of high blood pressure on\n29\nDecember\n1948\nat the age of\n42\n. He was Christian and was buried in St David's Church Kudeti. Horatio was married to Alhaja\n(\ndied October\n2013\nat the age of\n102)\nwho was a Muslim and they had five children; three girls and two boys. Victor, the subject of this biography was the oldest of the children while Vincent Olusegun Sowemimo Olunloyo\n(1943\n-\n2017)\n, or Segun as he was known, was the third born. Segun became an engineer and a very popular lecturer at the University of Lagos.\nVictor Olunloyo attended Holy Trinity Primary School, Ebute-Ero, Lagos in\n1939\n, a school founded by Anglican missionaries in\n1888\n. In the following year he attended Olowogbowo Methodist Primary School, Lagos, before attending St Peters Primary School, Aremo, Ibadan between\n1941\nand\n1946\n. He completed his primary school education by attending St Paul's Anglican Primary School, Gbongan in\n1947\nand, after passing Standard\n5\n, he applied for a place at Government College, Ibadan. He was one of over\n2000\nstudents who applied for this secondary school and was placed\n10\nth. The top ten students were awarded a scholarship so, in\n1948\n, he began his studies at Government College, Ibadan, funded with a scholarship. Olunloyo was the only one in his class who had come after passing Standard\n5\n, the others all having passed Standard\n6\n. Being less well prepared than the other students he struggled in his first year coming\n21\nst out of\n23\nstudents in his class, but he quickly made up the lost ground and for the rest of his time at Government College he topped his class.\nHoratio Vincent built a house in Molete, Ibadan, which was completed in\n1948\n, one day before he died. Victor was in his first year at Government College when his father died in December\n1948\n. Among his dormitory roommates at that time were Sulaiman Botsende Lagundoye, who became a radiologist and medical professor, Akinwande Oluwole Babatunde Soyinka, who was awarded the Nobel Prize for literature in\n1986\n, Oladipo Olujumi Akinkugbe, who became a professor of medicine, and Olalekan Are, who became \"Nigeria's foremost agronomist, civil/public servant, philanthropist.\" Not only did Victor Olunloyo excel at mathematics at Government College, but he was also an excellent cricketer, an outstanding opening bowler, who played in the school team. Bayo Adeyinka reports on Olunloyo's time at Government College, Ibadan, in the interview\n[\n3\n]\n:-\nWhile at Government College, Ibadan, he actually challenged the teachers to give him a full year's course which he finished and passed in three months. Yet, he decided to wait for his mates in the class to complete that year's course of work. When I asked him what he did during the period of waiting, he told me he taught as a pupil teacher in another school. At another period, he solved a mathematical problem given by the teacher through another method that was not taught by him. When the teacher called him up, he showed the teacher that his own method was simpler and faster than that of the teacher.\nComing top in Ibadan province in the Higher School Certificate\n(\nHSC\n)\nexaminations, he entered University College Ibadan in\n1953\nand studied privately for his A-levels which he was awarded in\n1954\n. He applied for scholarships to fund his university studies in Britain. In\n[\n5\n]\n, Olunloyo spoke about Obafemi Awolowo, his father's friend and lawyer. He related how he came to be a student at the University of St Andrews in Scotland in\n1955\n:-\nI am a special beneficiary of Awolowo's excellent administration. I applied for two overseas scholarships, one Engineering, the other Mathematics. I came first in both interviews with A+. Lady Kofo Ademola, who headed the Students and Scholarship Section, asked me surprisingly one day which of the two would I like to use. I told her \"both.\" She was very fond of me and was a kind of tranquiliser on me whenever I was in her presence. With three A's and a needless C in Chemistry, she got a place for me where her husband, Chief Justice Adetokunbo Ademola, graduated in Selwyn College, Cambridge, which insisted on\n3\nA's in the HSC. We were being prepared to enter BSc the equivalent of HSC. I crossed the HSC barrier in\n3\nmonths. I chose to use the two scholarships which was a rare honour and Mrs Kofo Ademola agreed that in my case, it would be permitted. I could not wait a year before taking my place in Selwyn College, Cambridge, so I opted for the oldest university in Scotland, St Andrews.\nToday the University of St Andrews is located only in the town of St Andrews but, when Olunloyo began his studies there, Queen's College, Dundee, was also part of the University of St Andrews. Mathematics was taught in both Dundee and St Andrews and students sat common examination papers. Engineering and applied sciences were only taught at Queen's College, Dundee. With scholarships in both mathematics and engineering, Olunloyo was a student in Queen's College, Dundee. We note that six years after Olunloyo left the University of St Andrews, Queen's College, Dundee became a separate university in\n1967\n, the University of Dundee. Today it is possible for well qualified students to enter the second year of the four year B.Sc. course at the University of St Andrews, but in the\n1950\ns this route was not available\n[\n2\n]\n:-\nWhen he arrived at the University, he requested that they should allow him to start from\n2\nnd year but the Senate declined. It had never been done before. He went to a professor's house on a rainy day and pleaded that they should give him a test within\n7\ndays. The University agreed and gave him a test on Physics, Chemistry and Mathematics. Each test was for\n3\nhours each. He got\n84\nin Physics,\n88\nin Chemistry and\n98\nin Mathematics. That was how he was allowed to skip year one at the University. So he started from year two.\nHis advisor of studies was John Meadows Jackson\n(1907\n-\n1998)\nwho, after a B.Sc. in Physics from the University of London in\n1927\n, was awarded a B.Sc. in mathematics in the following year. Jackson had obtained a Ph.D. from the University of Cambridge in\n1933\nfor his thesis\nExchange of energy between inert gas atoms and a solid surface\n. After teaching at the University of Manchester and Westfield College of the University of London, he had been appointed as a Lecturer in Mathematics at the University of St Andrews in\n1946\n.  He taught in Dundee and was promoted to Senior Lecturer in Mathematics in\n1953\n. Head of Mathematics in Dundee at this time was\nMurray Macbeath\nand\nHenry Jack\nwas a lecturer in the Department.\nIn\n[\n7\n]\na citation for Olunloyo explains that he:-\n... graduated with B.Sc.\n(\nGeneral Engineering - Civil and Mechanical Engineering\n)\nin June\n1957\nhaving notable first in First Class in Theory of Structures and all Mechanical subjects and First Class in Mechanical Design.\nJohn Jackson wrote to the Students Officer, Western Nigeria Office in London, on\n4\nApril\n1957\nsupporting Olunloyo's scholarship being renewed. Jackson wrote that Olunloyo was\n[\n3\n]\n:-\n... outstanding, able and hardworking. His ability in mathematics is exceptional and he has taken first place in all his mathematical classes.\nThe citation for Olunloyo continues\n[\n7\n]\n:-\nIn July\n1958\n, this rare gem achieved yet another feat by bagging B.Sc.\n(\nFirst Class Honours\n)\ndegree in Mechanical Engineering. He was treated to an adoring and high profile graduation ceremony. The young engineer was specially transferred from the Faculty of Applied Science to the Faculty of Pure Science for a Ph.D. in Mathematics straight away. He completed his PhD. Mathematics in\n2\nyears including\n2\nsummer vacations.\nYou can read more of Olunloyo's reminiscences about his education at\nTHIS LINK\n.\nOlunloyo was not only interested in his mathematical studies for he was also the President of the Musical Society. He graduated with a Ph.D. from the University of St Andrews after submitting his thesis\nOn the Numerical Determination of the Solutions of Eigenvalue Problems of the Sturm-Liouville Type\n. He returned to Nigeria and was appointed as a lecturer in the Department of Mathematics of University College, Ibadan. The University College, Ibadan was established in\n1948\nas a College of the University of London, England; it is the first university in Nigeria. It became an independent university, the University of Ibadan, in\n1962\nafter the country gained its independence from Britain. Later he taught at the University of Ife, Ibadan Branch, Nigeria and he was there when he submitted a paper in June\n1964\n. The University of Ife opened in Ibadan in\n1962\n, brought about because the University of Ibadan had no Engineering Faculty and lacked other areas such as law. In\n1967\nthe University of Ife moved to Ile-Ife and in\n1987\nwas renamed Obafemi Awolowo University, the name by which it is known today.\nBy\n1966\n, Olunloyo was back at the University of Ibadan. Let us note at this stage that there seems to be quite a lot of confusion between Victor Olunloyo and his brother Vincent Olunloyo. Both have the same initials, V O S Olunloyo, and both wrote papers under this name.\nMathSciNet\nbelieves that both Victor and Vincent are the same person and various others have made this error. Vincent Olunloyo spent time at Cornell University in the United States and wrote papers on ordinary and partial differential equations, fluid mechanics and numerical analysis. Despite his engineering scholarship, Victor Olunloyo seems to have only published papers on pure mathematics.\nInterestingly, Victor Olunloyo, the subject of this biography, does not seem to have published papers on the results of his Ph.D. thesis and his first papers are on number theory. Rather strangely, his first two papers are identical. They are written with A D Weiss as co-author and have the title\nOn the completeness of the totitives of a natural number\n. One of the two identical papers appeared in the\nJournal\nof the\nLondon Mathematical Society\nin\n1965\n, the other in the\nAmerican Mathematical Monthly\nin\n1966\n. He published two later papers on number theory.\nOlunloyo did not only have a career as a mathematician, he also had a political career. Moses Adekoyejo Majekodunmi\n(1916\n-\n2012)\nwas a gynaecologist and obstetrician who was elected to the Nigerian Senate in\n1960\nand appointed administrator of Western Region in June\n1962\n. One of Majekodunmi's first tasks was to appoint Olunloyo as Commissioner for Economic Development for the Western Region. Nigeria had seen increasing unrest since independence which was intensified by elections in\n1964\nwith widespread reports of electoral fraud. A military coup in\n1966\nwas put down but resulted in the army taking over. Adeyinka Adebayo\n(1928\n-\n2017)\nbecame governor of the Western region and he re-appointed Olunloyo as Commissioner for Economic Development. He also served as Commissioner for Community Development and, on two occasions, Commissioner for Education. He later served as Chairman of the Western Nigerian Development Corporation.\nIn August\n1983\nOlunloyo, as a member of the National Party of Nigeria\n(\nNPN\n)\n, stood in the election for Governor of Oyo State. The man holding the position was Bola Ige of the Unity Party of Nigeria\n(\nUPN\n)\n. Olunloyo won taking\n58\nper cent of the vote against\n40\nper cent for Bola Ige. The Unity Party of Nigeria disputed the result and the case went to the High Court\n[\n8\n]\n:-\nBola Ige the UPN petitioner failed to provide polling station totals but relied on those from the collation centres. It was found that over\n1\nmillion votes from his home town of Ilesha had been omitted, as had those from Ibadan ... A majority found for the NPN on the grounds that Bola Ige had not proved his case beyond reasonable doubt and had not alternatively sought that the election should be declared void. The minority, including the chairman, held that, in accordance with the Electoral Act, a civil law balance of probability was sufficient and that the criminal law rule of proof beyond reasonable doubt did not apply. ... Olunloyo did not even appear in court.\nOlunloyo's victory was, however, short lived since three months later there was a military coup. Major General Muhammadu Buhari\n(\nborn\n17\nDecember\n1942)\nwas announced as Head of State and made a speech to the country on\n1\nJanuary\n1984\n[\n8\n]\n:-\nThe last general elections could be anything but free and fair ... There is ample evidence that rigging and thuggery were related to the resources available to the parties. This conclusively proved to us that the parties have not developed confidence in the presidential system of government on which the nation invested so much material resources.\nIt is interesting to note that Buhari was elected President of Nigeria in\n2015\nand re-elected in\n2019\n.\nTo read Olunloyo's account of this election and other political adventures, see\nTHIS LINK\n.\nIn November\n2002\n, Olunloyo decided to run again for political office\n[\n6\n]\n:-\nIbadan - Former civilian governor of old Oyo State Dr Omololu Olunloyo at the weekend gave reasons why he is contesting the governorship seat of the state\n20\nyears after he left office. Dr Olunloyo while addressing a large crowd of Peoples Democratic Party\n(\nPDP\n)\nfaithfuls and residents of the state that thronged the historic Mapo Hall for his public declaration for the governorship race stated emphatically that he remained the only aspirant without any record of corruption having held eleven different executive offices in the past. Said he, \"I am an aspirant simply because the degree of decay and deterioration in nearly all facets of our life needs to be arrested swiftly and efficiently calling for as it does, a seasoned, experienced hand\". Dr Olunloyo who paid a glowing tribute to the founding fathers and previous political actors of the state said, \"at times such as this, there should be no room for new comers to governance. ... I am for efficiency, prompt solution to problems, probity and transparency. All these are better said than done but I believe I have been fully tried and tested. .... I am for peace, love and unity. I am for the protection of the rights of all people, foreign or national, North, East, South or West to live in peace here\".\nOlunloyo was not chosen as PDP candidate, however, the choice being Rasheed Ladoja who was duly elected governor of Oyo State on\n29\nMay\n2003\n. In\n2009\nOlunloyo was chair of a panel set up to investigate the collapse of a part of the Pharmacy section of Ladoke Akintola University of Technology. The report was controversial\n[\n9\n]\n:-\nWhile Olunloyo, who chaired the panel allegedly indicted the state government and the contractor who handled the project for poor execution, the state government on its part said the report was shoddily prepared and cannot stand. A newspaper report had quoted the former governor as saying that the government and the contractor handling the project failed to follow the right procedure in the execution of the project. This was said to have angered the governor, Adebayo Alao-Akala, who allegedly moved to prevail on his predecessor to reconsider its position and rewrite the report, but Olunloyo refused.\nOlunloyo was elected chairman of the PDP Planning and Strategy Committee for Ibadanland with the aim of promoting the Party's success in the\n2011\nNigerian election. In addition he chaired the PDP Media and Publicity Committee for the state. It was a difficult Presidential election with arguments over whether the agreement that the Muslim north and the Christian south would alternate was being broken. Goodluck Jonathan of the PDP was elected President. In\n2012\nVictor Olunloyo left the PDP political party and joined the Action Congress of Nigeria party. Dejo Raimi of the PDP blamed his party for Olunloyo's move\n[\n4\n]\n:-\nFor a very long time, nobody talked to Olunloyo from PDP. Nobody gave him what to eat. My friend is hungry and he needs food and relevance. ACN promised to give him what he wants; food and other things and as a result, he dumped PDP and went to ACN. Don\"t forget that a hungry man will eat from his enemy. It is very careless and stupid of PDP to leave its elder statesmen like Omololu Olunloyo ...\nThe Action Congress of Nigeria merged with other opposition parties in\n2015\nto form the All Progressives Congress.\nFinally let us note that Olunloyo was married to Funmilayo, who worked in the Civil Service, being there when she met Olunloyo, and they had ten children. The second of these children was Kemi Omololu-Olunloyo\n(\nborn Olukemi Omololu-Olunloyo,\n6\nAugust\n1964)\nwho became a journalist. She became controversial and has been involved in public arguments with her father. In fact recently the family have been involved in many accusations and counter claims which we choose not to report on here.",
  "matematicos_citados_na_biografia": [
    "Murray Macbeath",
    "Henry Jack",
    "THIS LINK",
    "London Mathematical Society"
  ],
  "imagens": [
    "olunloyo.jpg"
  ]
}