{
  "nome_completo": "Viggo Brun",
  "nome_curto": "Viggo Brun",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brun/",
  "data_nascimento": "13 October 1885",
  "local_nascimento": "Lier, Hordaland County, Norway",
  "data_morte": "15 August 1978",
  "local_morte": "Drobak, Akershus County, Norway",
  "summary": "Viggo Brun was a Norwegian mathematician and number theorist.",
  "biografia": "Viggo Brun\n's father was Soren Markus Brun\n(1838\n-\n1893)\n, an artillery captain, and his mother was Lorentze Thaulow Petersen\n(1842\n-\n1890)\n. Now, from the dates we have just given we can see that Viggo's parents died when he was young. In fact his mother died when he was four and his father died on\n4\nMarch\n1893\nwhen he was seven. However, Viggo was the youngest of his parents' ten children and he had older sisters who brought him up. He entered the University of Oslo in\n1903\nwhere he studied mathematics and natural sciences. The course he took was to qualify him to become a school teacher and it was a broad course requiring him to study a wide range of topics. It did not allow time for much in the way of specialised knowledge. Many bright pupils in Brun's position would have read mathematics books to take them into deeper studies than those being presented in their courses. Brun's approach was, however, different and he tried to develop his own mathematical ideas without having the support of teachers or advanced texts and, as a consequence, he produced some rather original ideas while still an undergraduate.\nIn\n1910\nBrun went to Göttingen University in Germany, the leading mathematics centre in the world at this time, and while he was there he began to work on what were some of the most difficult problems in number theory. We should note that Brun received no financial support for his visit to Göttingen and he funded the visit entirely from his own funds. The number theorist\nEdmund Landau\nhad been appointed to a professorship at Göttingen a year before Brun arrived and\nHilbert\nand\nKlein\nwere also on the staff. There is no evidence that Brun interacted in any meaningful way with any of these, but he must have benefited from listening to\nEdmund Landau\n. Returning to Norway, Brun did receive a research grant to support his work but at this stage he had no job. The outbreak of World War I in\n1914\nsaw Norway adopt a position of neutrality. This, however, proved difficult to maintain and the country was under pressure from both sides. Brun served for a number of years in the Norwegian armed forces.\nHe had attacked two of the most famous number theory problems, namely\nGoldbach's conjecture\nand the\ntwin prime conjecture\n.\nGoldbach\n's conjecture is that every even natural number greater than\n2\ncan be expressed as the sum of two primes. For example,\n4\n=\n2\n+\n2\n,\n6\n=\n3\n+\n3\n,\n8\n=\n3\n+\n5\n,\n10\n=\n5\n+\n5\n, ... Note that, in general, even numbers will be expressible as the sum of two primes in more than one way, for example\n10\n=\n5\n+\n5\n=\n3\n+\n7\n. The\ntwin prime conjecture\nis that there are infinitely many prime pairs\nn\n,\nn\n+\n2\nn, n + 2\nn\n,\nn\n+\n2\n. For example,\n3\n,\n5\n;\n5\n,\n7\n;\n11\n,\n13\n;\n17\n,\n19\n;\n29\n,\n31\n; ... Brun's first results were given in\nÜber das Goldbachsche Gesetz und die Anzahl der Primzahlpaare\nⓉ\n(\nOn Goldbach's theorem and the number of prime pairs\n)\n(1915)\n. In this paper he began to develop the sieve methods which would lead him to some very important results. These sieve methods were refinements, based on the inclusion-exclusion principle, of the sieve of\nEratosthenes\n. They are essentially elementary in nature and few believed that they would lead to significant results. However, the ideas that Brun introduced in this paper, further developed by him and later by others, would lead to a revolution in number theory. In\n1919\nBrun published a remarkable result when he proved that the sum of the reciprocals of twin primes is finite, that is\n1\n3\n+\n1\n5\n+\n1\n5\n+\n1\n7\n+\n1\n11\n+\n1\n13\n+\n1\n17\n+\n1\n19\n+\n1\n29\n+\n1\n31\n+\n.\n.\n.\n\\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{7}\\normalsize  + \\large\\frac{1}{11}\\normalsize  + \\large\\frac{1}{13}\\normalsize  + \\large\\frac{1}{17}\\normalsize  + \\large\\frac{1}{19}\\normalsize  + \\large\\frac{1}{29}\\normalsize  + \\large\\frac{1}{31}\\normalsize  + ...\n3\n1\n​\n+\n5\n1\n​\n+\n5\n1\n​\n+\n7\n1\n​\n+\n1\n1\n1\n​\n+\n1\n3\n1\n​\n+\n1\n7\n1\n​\n+\n1\n9\n1\n​\n+\n2\n9\n1\n​\n+\n3\n1\n1\n​\n+\n.\n.\n.\nis finite. He proved this in the paper\nLa série\n1\n5\n+\n1\n7\n+\n1\n11\n+\n1\n13\n+\n1\n17\n+\n1\n19\n+\n1\n29\n+\n1\n31\n+\n1\n41\n+\n1\n43\n+\n1\n59\n+\n1\n61\n+\n.\n.\n.\n\\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{7}\\normalsize  +\\large\\frac{1}{11}\\normalsize  + \\large\\frac{1}{13}\\normalsize  + \\large\\frac{1}{17}\\normalsize  + \\large\\frac{1}{19}\\normalsize  + \\large\\frac{1}{29}\\normalsize  + \\large\\frac{1}{31}\\normalsize  +  \\large\\frac{1}{41}\\normalsize  + \\large\\frac{1}{43}\\normalsize  + \\large\\frac{1}{59}\\normalsize  + \\large\\frac{1}{61}\\normalsize  + . . .\n5\n1\n​\n+\n7\n1\n​\n+\n1\n1\n1\n​\n+\n1\n3\n1\n​\n+\n1\n7\n1\n​\n+\n1\n9\n1\n​\n+\n2\n9\n1\n​\n+\n3\n1\n1\n​\n+\n4\n1\n1\n​\n+\n4\n3\n1\n​\n+\n5\n9\n1\n​\n+\n6\n1\n1\n​\n+\n.\n.\n.\noù les dénominateurs sont \"nombres premiers jumeaux\" est convergent ou finie\nⓉ\n(\nOn the series\n1\n/\n5\n+\n1\n/\n7\n+\n1\n/\n11\n+\n1\n/\n13\n+\n1\n/\n17\n+\n1\n/\n19\n+\n1\n/\n29\n+\n1\n/\n31\n+\n1\n/\n41\n+\n1\n/\n43\n+\n1\n/\n59\n+\n1\n/\n61\n+ ... where the  denominators are 'twin primes' is convergent or finite\n)\n(1919)\nwhich he published in the\nBulletin des Sciences Mathématiques\n. The proof uses what today is called 'Brun's sieve'. Note that this result is in sharp contrast with the theorem that the sum of the reciprocals of the primes is infinite, first proved by\nLeonhard Euler\nin\n1737\n. Now the first question one would naturally ask is \"What is the approximate value of the sum of the reciprocals of twin primes\"? Unfortunately there is no accepted standard for exactly what series is being summed. The most common definition of 'Brun's constant' is:\nB\n=\n1\n3\n+\n1\n5\n+\n1\n5\n+\n1\n7\n+\n1\n11\n+\n1\n13\n+\n1\n17\n+\n1\n19\n+\n1\n29\n+\n1\n31\n+\n.\n.\n.\nB = \\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{7}\\normalsize  + \\large\\frac{1}{11}\\normalsize  + \\large\\frac{1}{13}\\normalsize  + \\large\\frac{1}{17}\\normalsize  + \\large\\frac{1}{19}\\normalsize  + \\large\\frac{1}{29}\\normalsize  + \\large\\frac{1}{31}\\normalsize  + ...\nB\n=\n3\n1\n​\n+\n5\n1\n​\n+\n5\n1\n​\n+\n7\n1\n​\n+\n1\n1\n1\n​\n+\n1\n3\n1\n​\n+\n1\n7\n1\n​\n+\n1\n9\n1\n​\n+\n2\n9\n1\n​\n+\n3\n1\n1\n​\n+\n.\n.\n.\nand the best estimate for\nB\nB\nB\n, produced in\n2002\n, is\n1\n.\n902160583104\n.\nHowever, as we can see from the title of Brun's paper, he took a slightly different start to his series\n1\n7\n+\n1\n11\n+\n1\n13\n+\n1\n17\n+\n1\n19\n+\n1\n29\n+\n1\n31\n+\n.\n.\n.\n\\large\\frac{1}{7}\\normalsize  + \\large\\frac{1}{11}\\normalsize  + \\large\\frac{1}{13}\\normalsize  + \\large\\frac{1}{17}\\normalsize  + \\large\\frac{1}{19}\\normalsize  + \\large\\frac{1}{29}\\normalsize  + \\large\\frac{1}{31}\\normalsize  + ...\n7\n1\n​\n+\n1\n1\n1\n​\n+\n1\n3\n1\n​\n+\n1\n7\n1\n​\n+\n1\n9\n1\n​\n+\n2\n9\n1\n​\n+\n3\n1\n1\n​\n+\n.\n.\n.\nwhile others take\n1\n3\n+\n1\n5\n+\n1\n7\n+\n1\n11\n+\n1\n13\n+\n1\n17\n+\n1\n19\n+\n1\n29\n+\n1\n31\n+\n.\n.\n.\n\\large\\frac{1}{3}\\normalsize  + \\large\\frac{1}{5}\\normalsize  + \\large\\frac{1}{7}\\normalsize  + \\large\\frac{1}{11}\\normalsize  + \\large\\frac{1}{13}\\normalsize  + \\large\\frac{1}{17}\\normalsize  + \\large\\frac{1}{19}\\normalsize  + \\large\\frac{1}{29}\\normalsize  + \\large\\frac{1}{31}\\normalsize  + ...\n3\n1\n​\n+\n5\n1\n​\n+\n7\n1\n​\n+\n1\n1\n1\n​\n+\n1\n3\n1\n​\n+\n1\n7\n1\n​\n+\n1\n9\n1\n​\n+\n2\n9\n1\n​\n+\n3\n1\n1\n​\n+\n.\n.\n.\nomitting one\n1\n5\n\\large\\frac{1}{5}\\normalsize\n5\n1\n​\nsince\n5\nappears in two prime pairs. Of course, the sums of these variants are easily related to\nB\nB\nB\n. Note that it is still an open question whether\nB\nB\nB\nis rational or irrational. It is known, however, that if\nB\nB\nB\nwere proved irrational it would follow that there are infinitely many twin primes. If\nB\nB\nB\nwere proved rational it would have no bearing on whether there were infinitely many twin primes. Isn't a study of the primes a most fascinating topic!\nIn\n1920\nBrun published\nLe crible de Eratosthène et le théorème de Goldbach\nⓉ\n(\nThe sieve of Eratosthenes and Goldbach's theorem\n)\nin which he used his sieve methods to prove weaker forms of both the\nGoldbach\nconjecture and the twin prime conjecture. In this paper he proved\n(\ni\n)\nthere exist infinitely many integers\nn\nn\nn\nsuch that both\nn\nn\nn\nand\nn\n+\n2\nn + 2\nn\n+\n2\nhave at most nine prime factors; and\n(\nii\n)\nevery sufficiently large even integer\nN\nN\nN\nis the sum of two numbers each having at most nine prime factors. Later mathematicians have strengthened these results, using methods based on those first developed by Brun, but the two conjectures are still open.\nLet us return to Brun's career. He was appointed as an assistant in applied mathematics in Oslo in\n1921\n. Two years later, he was appointed as a professor at the Technical University of Trondheim. He married Laura Elise Michelsen\n(1902\n-\n2004)\nin\n1940\n. Laura, who was born in Frogn, Akershus, Norway, to parents Hjalmar Fredrik Bernhard Michelsen and Eva Gloersen, ran a dressmaking school in Oslo. We note that her home town of Frogn was adjacent to Drobak where Brun's father had bought an old house. Viggo and his wife Laura\n[\n3\n]\n:-\n... lived in an ancient wooden house in Drobak, which had been built in\n1770\nand which his father had bought in\n1888\n. In recent years he and his wife were active in helping to preserve those old houses in Drobak. He loved to go for walks in the forest where he would collect curious pieces of wood or roots from which he produced nice handiwork.\nIn\n1946\nBrun was appointed to a chair at the University of Oslo which he occupied for nine years until he retired in\n1955\nat the age of seventy.\nBrun published two books after he retired, namely\nThe Art of Calculating in Old Norway until the Time of Abel\n(\nNorwegian\n)\n(1962)\nand\nAll is Number, a History of Mathematics from Antiquity to the Renaissance\n(\nNorwegian\n)\n(1964)\n.\nØystein Ore\nwrites\n[\n1\n]\n:-\nViggo Brun has in recent years written two books on the history of mathematics, one dealing with the early history in Norway, the other with the general story of the subject. Both are on a very elementary level, but with many interesting observations by the author.\nBrun explains in his Preface that, before\nNiels Abel\n, Norwegian mathematics:-\n... was in most cases an art of calculating rather than mathematics. No more than four of the scholars I mention could lay claim to the title of mathematician.\nThese four are Fredrich Christian Holberg Arentz\n(1736\n-\n1825)\n, Diderich Christian Fester\n(1732\n-\n1811)\n, Jens Kraft\n(1720\n-\n1756)\nand\nCaspar Wessel\n(1745\n-\n1818)\n.\nChristoph J Scriba, writes in a review that:-\n... the author gives a summary of the knowledge in elementary mathematics in old Norway and Iceland. Apart from archaeological finds bearing geometric designs, the oldest sources revealing knowledge in the art of calculating are contained in the Gulating Law, the Frostating Law and the Kongespeilet\n[\nThe royal mirror, c.\n1260]\n, from the\n12\nth\nand\n13\nth\ncenturies. Hauk Erlendsson, who lived in Norway and Iceland around\n1300\n, composed an \"Algorismus\" mainly based on that of\nSacrobosco\n. The Icelandic arithmetic \"Rymbegla\" is briefly discussed. There is also an account of the teaching of arithmetic in schools, the study of Norwegian students abroad in the Middle Ages and later on, and the establishment of high and technical schools in Denmark and Norway in the\n17\nth\nand\n18\nth\ncenturies.\nChristoph J Scriba also reviewed Brun's\nAll is Number\n, writing:-\nThis paperback in the Norwegian language contains the substance of lectures on the history of mathematics which have been given at the University of Oslo. A summary of pre-historic, Egyptian, Babylonian, Hindu and Arabic mathematics fills the first\n80\npages, while on the next\n100\npages the life and work of about two dozen Greek mathematicians is described. Of these, the great Archimedes receives the fullest treatment\n(34\npages\n)\n- the same number of pages in which the author deals with medieval and Renaissance mathematics in Europe, from\nBoethius\nto\nCardano\nand\nFerrari\n. The author has resisted the temptation to crowd too many facts into the limited space. His presentation of mathematical details is intermingled with information of a more general nature concerning mathematics and mathematicians of the times under discussion. Some items treated by him are not contained in the standard books: The Norwegian \"Kongespeilet\", perhaps composed by Archbishop Einar Gunnarsson, who may have been in personal contact with Sacrobosco at Paris; the \"Algorismus\" of Hauk Erlendsson\n[\nearly\n14\nth\ncentury\n]\n, which is strongly influenced by\nSacrobosco\n, too; and the Icelandic arithmetic \"Rymbegla\"\n[12\nth\n-\n14\nth\ncenturies?\n]\n.\nIn addition to these books on the history of mathematics, Brun wrote many papers on the subject. For example, he wrote the following in Norwegian:\nQuadrature of the circle\n(1941)\n;\nThe study of the prime numbers from antiquity to our time\n(1942)\n;\nWallis's and Brouncker's formulas for π\n(1951)\n;\nNiels Henrik Abel\n(1953)\n;\nThe manuscript of Abel's Paris treatise found\n(1953)\n;\n(\nwith\nBorge Jessen\n)\nA letter by Niels Henrick Abel from his youth\n(1958)\n. He also published biographies of\nCarl Stormer\n(1957)\n,\nCaspar Wessel\n(1959)\n,\nSophus Lie\n(1967)\n, and\nAxel Thue\n(1977)\n. Another topic that interested Brun was the theory of music. In\nMusic and ternary continued fractions\n(1950)\nhe discussed the division of the octave into equally tempered intervals. The paper\nMusic and Euclidean algorithms\n(\nNorwegian\n)\n(1961)\nlooks at four different problems from the theory of music. One might imagine that Brun was musical but\n[\n3\n]\n:-\nBrun himself called it an irony of fate that he, who was very unmusical, should write about music. Though not musically gifted, Viggo Brun had a strong sense for harmony and geometric symmetry. He gave some lectures about mathematics and aesthetics ...\nChristoph Scriba met Brun in\n1955\nat a conference on the history of mathematics at the Oberwolfach mathematics research centre in the Black Forest, Germany. Scriba says of Brun\n[\n3\n]\n:-\nHis wide interests and his humanistic outlook, combined with his modesty, kindness, and totally un-professorial habits made the strongest impression upon me. ... During his long and fruitful life, he also engaged in politics and worked for peace ...\nMany honours were given to Brun for his outstanding contributions. He was awarded the Fridtjof Nansen Award for Excellence in\n1939\n. This award, named after the Norwegian explorer, scientist, and diplomat Fridtjof Nansen, had been awarded since\n1903\nand the previous winner, in\n1938\n, had been\nThoralf Albert Skolem\n. In\n1946\nBrun was awarded the Norwegian Institute of Technology Founder's Prize, and in\n1958\nhe received the Gunnerus medal of the\nRoyal Norwegian Academy of Science and Letters\n. This medal is named after Johan Ernst Gunnerus, the founder of the\nRoyal Norwegian Academy\n. Brun also received an honorary doctorate from the University of Hamburg in\n1966\n. He was elected a member of the scientific societies or academies of Oslo, Trondheim, Uppsala, and the\nFinnish Academy of Sciences\n.",
  "matematicos_citados_na_biografia": [
    "Edmund Landau",
    "Hilbert",
    "Klein",
    "Goldbach's conjecture",
    "twin prime conjecture",
    "Goldbach",
    "Eratosthenes",
    "Leonhard Euler",
    "Øystein Ore",
    "Niels Abel",
    "Caspar Wessel",
    "Sacrobosco",
    "Boethius",
    "Cardano",
    "Ferrari",
    "Borge Jessen",
    "Carl Stormer",
    "Sophus Lie",
    "Axel Thue",
    "Thoralf Albert Skolem",
    "Royal Norwegian Academy of Science and Letters",
    "Royal Norwegian Academy",
    "Finnish Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}