{
  "nome_completo": "Vivienne Malone-Mayes",
  "nome_curto": "Vivienne Malone-Mayes",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Malone-Mayes/",
  "data_nascimento": "10 February 1932",
  "local_nascimento": "Waco, Texas, USA",
  "data_morte": "9 June 1995",
  "local_morte": "Temple, Texas, USA",
  "summary": "Vivienne Malone-Mayes was an American mathematician and educationalist.",
  "biografia": "Vivienne Malone-Mayes\n's name before she married was Vivienne Malone. Her African-American parents were Pizarro Ray Malone, who taught in schools around Waco for many years and also worked for the Urban Renewal Agency, and Vera Estelle Allen, who was also a teacher.\nVivienne's parents were both very keen that she should have the best possible education and she started school at the age of five years, one year earlier than she should have done. She performed exceptionally well at the racially segregated A J Moore High School in Waco and graduated from the school in\n1948\n. She then left her home town of Waco to study at Fisk University in Nashville, which she entered in\n1948\nwith the intention of obtaining a medical degree rather than one in mathematics.\nAt Fisk, Malone met a fellow student James Jeffries Mayes who was studying dentistry. They soon decided to marry, but Mayes persuaded his future wife to change from medicine since he felt that two doctors in one family would not make for a good family life! Malone decided to switch from medicine to mathematics. A big influence on Malone was that she took courses at Fish given by Evelyn Boyd\nGranville\n, one of the first African-American women to receive the Ph.D. in mathematics. Malone-Mayes later wrote:-\nI believe that it was her presence and influence which account for my pursuit of advanced degrees in mathematics.\nGranville\nwas not the only one at Fisk to have a large influence on Malone. She wrote a tribute to\nLee Lorch\n, chairman of the Department of Mathematics at Fisk University from\n1950\n-\n55\n, in\n1976\n. In\nLee Lorch at Fisk: a tribute\nwhich appeared in the\nAmerican Mathematical Monthly\nshe described the profound influence he had on her and her fellow students through his interest and his approach to teaching. She describes how\nLorch\ninfluenced her decision to make mathematics her career.\nMalone graduated from Fisk with a B.A. in\n1952\nand, soon afterwards, on\n1\nSeptember of that year she married James Jeffries Mayes. She continued to study for her Master's degree at Fisk and in\n1954\nshe was awarded an M.A. Although inspired by\nGranville\nto aim at a Ph.D. Malone-Mayes did not set out on that route immediately after the award of her master's degree, rather she returned to Waco where she was Chair of the Mathematics Department at Paul Quinn College, operated by the African Methodist Episcopal Church. Her husband opened a dental practice in Waco and Malone-Mayes spent seven years in this post. She then spent one year at Bishop College in Dallas where she was Chair of the Mathematics Department.\nIn\n1961\nMalone-Mayes decided that she wanted to study more mathematics. She applied to study at Baylor University in Waco but they rejected her because she was an African-American. She later wrote that, although at the time she felt bitter, in retrospect they did her a good turn for Baylor University did not offer Ph.D. courses:-\nIt was a blessing, really. If they'd accepted me at Baylor, I would have just taken a few courses and not pursued a doctorate.\nThe University of Texas was required by Federal law to take African-American students so Malone-Mayes began to take summer courses there:-\nThe first summer gave me the courage to continue full time, especially after I succeeded...\nIt was not easy for she was the only Black student:-\nWhen I made a low grade, I felt I'd let down\n11\nmillion people. That's a heavy burden. Every professor stereotyped Blacks by my performance. You felt like you had no choice but to excel.\nAfter doing well in the summer courses she decided to study for her doctorate. Her supervisor was Don Edmonson but it took real determination to succeed in the prevailing atmosphere\n[\n3\n]\n:-\nIn graduate school she was very much alone. In her first class, she was the only Black, the only woman. Her classmates ignored her completely, even terminating conversations if she came within earshot. She was denied a teaching assistantship, although she was an experienced and excellent teacher.\nIn\n[\n7\n]\nshe wrote:-\n... it took a faith in scholarship almost beyond measure to endure the stress of earning a Ph.D. degree as a Black, female graduate student.\nI could not join my advisor and other classmates to discuss mathematics over coffee at Hilsberg's cafe .... Hilsberg's would not serve Blacks\n.\nSome classes were closed to her despite the fact that the University of Texas was required to take Black students. For example\nR L Moore\nrefused to have any Black students in his classes.\nIn\n1966\nwhen she was awarded a doctorate for her thesis\nA Structure Problem in Asymptotic Analysis\nby the University of Texas at Austin she became the fifth African-American woman to receive a Ph.D. in mathematics. Some results from her thesis were published in\nSome steady state properties of\n(\n∫\nf\n(\nt\n)\nd\nt\n)\n/\nf\n(\nx\n)\n(\\int   f (t) dt) / f (x)\n(\n∫\nf\n(\nt\n)\nd\nt\n)\n/\nf\n(\nx\n)\nwhich she published in the\nProceedings of the American Mathematical Society\nin\n1969\n. She defines a steady state function as follows. Let\nF\n(\nx\n)\nF(x)\nF\n(\nx\n)\nand\nG\n(\nx\n)\nG(x)\nG\n(\nx\n)\nbe two functions defined for\n0\n≤\nx\n<\n∞\n0 ≤ x < ∞\n0\n≤\nx\n<\n∞\n. Then the function\nG\n(\nx\n)\nG(x)\nG\n(\nx\n)\nis defined to be a steady state for\nF\nF\nF\nif for every ε >\n0\nthere is a\nT\n>\n0\nT > 0\nT\n>\n0\nsuch that\n∣\nF\n(\nx\n)\n−\nG\n(\nx\n)\n∣\n<\nϵ\n| F(x) - G(x) | < \\epsilon\n∣\nF\n(\nx\n)\n−\nG\n(\nx\n)\n∣\n<\nϵ\nwhenever\nx\n>\nT\nx > T\nx\n>\nT\n. Malone-Mayes studies those steady states that are periodic and continuous, in which case she proves that they are unique. She looks for necessary and sufficient conditions that certain functions will have a periodic steady state.\nIt was somewhat ironical that after being awarded her doctorate in\n1966\nshe was offered a professorship at Baylor University in Waco which had rejected her application to study there five years earlier. She became the first Black faculty member at Baylor University. Over the first few years there she felt well treated and when writing the article\n[\n6\n]\nin\n1975\nshe wrote:-\nI have never had any complaints about salary or promotions. I have received financial support from the administration for innovative and experimental projects ... An additional safeguard of my welfare has been yearly visits by representatives of the\n[\nfederal\n]\ngovernment. They have checked salaries and promotions to determine if I was being subjected to any discrimination. These reports have always been encouraging to me.\nSurprisingly, and very sadly, the position deteriorated. The yearly visits by representatives of the federal government ended as the political climate under President Regan and President Bush changed with civil rights agencies having severe cuts in their budgets. Malone-Mayes felt that her position at Baylor was weakened by this and she made a number of complaints about her treatment.\nHer research interests moved towards summability theory. In\n1980\nshe published a joint paper Some properties of the Leininger generalized\nHausdorff\nmatrix with B E Rhoades which appeared in the\nHouston Journal of Mathematics\n. Here is the author's summary in the paper:-\nEndl, Harrell, Jakimovski, and Leininger have each defined generalizations of ordinary\nHausdorff\nmatrices. It is shown that the definitions of Harrell and Leininger are formally the same, whereas those of Jakimovski and Leininger agree only for the Endl means. Thus Harrell's definition gives a class of generalized\nHausdorff\nmeans not previously considered. A number of properties of the Leininger method are investigated, including sufficient conditions for regularity and for satisfying the Barone property.\nWe should also give just a little information about her contributions outside mathematics. She served on the Board of Directors for Goodwill Industries, on the Board of Directors for Family Counselling and Children, and on the Board of Directors of Cerebral Palsy. She was a member of the Texas State Advisory Council for Construction of Community Mental Health Centers. Throughout her life she was involved in Church activities, for example she directed the Youth Choir and was Organist at New Hope Baptist Church for fifteen years between\n1960\nand\n1975\n. She was also instrumental in the setting up the first Boys Verse Choir at New Hope Baptist Church in\n1983\n.\nAfter a few years of ill health caused by a chronic inflammatory disease which forced her to retire in\n1994\n, Malone-Mayes suffered a heart attack\nE Falconer\nand\nL Lorch\ngive this tribute to Malone-Mayes in\n[\n3\n]\n:-\nWith skill, integrity, steadfastness and love she fought racism and sexism her entire life, never yielding to pressures or problems which beset her path. she leaves a lasting influence.\nFinally we should record some more of Malone-Mayes's achievements. She was the first Black elected to the Executive Committee of the Association for Women in Mathematics and served on the Board of Directors of the National Association of Mathematicians. She was a member of the\nMathematical Association of America\n, serving as their Director-at-Large for the Texas section and their Director of the High School Lecture Program. She was also a member of the\nAmerican Mathematical Society\nand participated in the Centennial Celebrations in\n1988\n.",
  "matematicos_citados_na_biografia": [
    "Granville",
    "Lee Lorch",
    "Lorch",
    "R L Moore",
    "Hausdorff",
    "E Falconer",
    "L Lorch",
    "Mathematical Association of America",
    "American Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}