{
  "nome_completo": "Vladimir Andreevich Steklov",
  "nome_curto": "Vladimir A Steklov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steklov/",
  "data_nascimento": "9 January 1864",
  "local_nascimento": "Nizhny Novgorod (was Gorky from 1932-1990), Russia",
  "data_morte": "30 May 1926",
  "local_morte": "Gaspra, Crimea, USSR",
  "summary": "Vladimir Steklov was a Russian mathematician who made many important contributions to applied mathematics.",
  "biografia": "Vladimir Steklov\n's father was a clergyman who taught history and Hebrew at the Nizhni Novgorod seminary. His uncle on his mother's side of the family was a famous literary critic. Vladimir Steklov inherited many of these family talents and he himself had considerable literary and musical talents. Had he not made a career from mathematics he could well have made his profession as an opera singer.\nSteklov entered the Alexander Institute in Nizhni Novgorod at the age of\n10\nyears. He studied there for eight years graduating in\n1884\n. He entered Moscow University but, after one year, he transferred to Kharkov University. There he became a student of\nLyapunov\nand, after a highly successful university career, he graduated in\n1887\n. Steklov remained at Kharkov University working towards becoming a university teacher. In\n1891\nhe was appointed Lecturer in Mechanics and worked towards his Master's Degree.\nFor his Master's thesis Steklov worked on the equations of a solid body moving in an ideal non-viscous fluid. There were four cases to be considered in integrating the equations which arose from this problem, and two of these cases had been solved by\nClebsch\nin\n1871\n. Steklov solved the third case in his thesis, the final case being solved by Steklov's supervisor\nLyapunov\nin\n1893\n. In fact\n1893\nwas the year that Steklov was awarded his Master's Degree. Then, in\n1896\n, Steklov was appointed to an extraordinary professorship of mechanics and continued to work for his doctoral dissertation.\nFor his doctoral dissertation Steklov worked on problems that arose in\npotential theory\n, electrostatics and hydromechanics. He reduced problems of this type to\nboundary-value problems\nof Dirichlet type using rigorous mathematical analysis. Steklov was awarded his doctorate in\n1902\nand, in that year, his supervisor\nLyapunov\naccepted an appointment at St Petersburg. Steklov was appointed to the Chair of Applied Mathematics at Kharkov University which\nLyapunov\nhad vacated.\nSteklov had been an active member of the\nKharkov Mathematical Society\n, serving the Society as secretary in\n1891\nand deputy chairman in\n1899\n. In\n1902\n, the year he was appointed to the Chair of Applied Mathematics, Steklov became chairman of the Society and held this post until\n1906\nwhen he moved to St Petersburg to take up the Chair of Mathematics there.\nOne of the most remarkable facts about Steklov was that he kept a diary for about\n20\nyears, documenting in detail every day the events of his life. We must know more of Steklov's life than almost any other mathematician but the diaries are of interest far beyond the world of mathematics as they record events through a particularly dramatic period of Russian history. Steklov's entry for each day would begin with a record of the weather conditions at\n10\na.m. He would record the temperature, atmospheric pressure, the degree of cloud cover, whether there was rain or snow. Then every night he would complete his record of the events of the day. He gave details of letters he had received and letters he had written that day. All those he visited or who visited him are recorded. The final entry was the weather conditions at\n3\n.\n30\na.m. giving the same details as the\n10\na.m. entry.\nThrough the diary we know how well every student that Steklov examined performed in their examination. We know the lectures that he gave on each day. For example on\n10\nSeptember\n1908\n:-\nBegan lecturing at the University on the integration of\npartial differential equations\n. There were quite a lot of people. Before the lecture I said a few words about\nA N Korkin\n[\nwho died on\n8\nSeptember\n1908]\nand suggested that the students pay tribute to his memory by standing up, which of course they did.\nHis lecture course on the integration of partial differential equations was to third year students and the lectures went on until April\n1909\n. He records on\n25\nApril\n1909\n:-\nFinished my lectures on integration of equations. For some reason, the students greeted the end of my lecture with applause\n(\nwere they happy that I had finished?\n)\n.\nSteklov had strong political views at a time when political feelings in Russia ran high. He was strongly against the Tsarist Regime and sympathised with progressive students. In fact this made him a very popular teacher at St Petersburg and, coupled with his excellent lecturing skills, brought many students to study at the Department of Mathematics and Physics. Among the students that he taught at St Petersburg were\nFriedmann\n,\nSmirnov\nand\nTamarkin\n.\nThe outbreak of World War I in\n1914\nbrought an upsurge of patriotic fervour centred on the tsar which was not shared by Steklov . When the German form of the city's name was changed to the Russian name of Petrograd, Steklov wrote in his diary entry of\n2\nSeptember\n1914\n:-\nSt Petersburg has been renamed Petrograd by Imperial Order. Such trifles are all our tyrants can do ... religious processions and extermination of the Russian people by all possible means. Bastards! Well, just you wait. They will get it hot one day!\nIn\n1910\nSteklov had been elected to the\nRussian Academy of Sciences\n. Then in\n1919\nhe became vice-president of the Academy.\nA P Yushkevich\nwrites in\n[\n1\n]\n:-\nDuring the civil war, military conflicts, economic decline, and the early stages of reconstruction, he proved to be a brilliant scientific administrator. For eight years he worked tirelessly to maintain, and later to enlarge, the activity of the Academy and to reorganise it in order to bring science and practical requirements closer together.\nIn\n1921\nSteklov founded the Institute of Physics and Mathematics and served as its director until his death in\n1926\n. In\n1934\nthe Institute was split into two separate Institutes of Physics and of Mathematics and the Mathematics Institute was named the V A Steklov Mathematical Institute.\nSteklov made many important contributions to applied mathematics. In addition to the work for his master's thesis and his doctoral thesis referred to above, he reduced problems to boundary value problems of\nDirichlet\ntype where\nLaplace's equation\nmust be solved on a surface. He wrote\nGeneral Theory of Fundamental Functions\nin which he examined expansions of functions as series in an infinite system of orthogonal\neigenfunctions\n. In fact the term \"Fundamental Functions\", which is due to\nPoincaré\n, means eigenfunctions in today's terminology.\nSteklov was not the first to examine series expansions in terms of infinite sets of orthogonal eigenfunctions, of course\nFourier\nhad examined a special case of this situation many years before. Steklov, however, produced many papers on this topic which led him to a general theory to replace the special cases examined by others. He studied a generalisation of\nParseval\n's equality for\nFourier series\nto his general setting showing this to be a fundamental property. In all his list of publications contains\n154\nitems.\nE A Tropp, V Ya Frenkel and A D Chernin, writing in\n[\n3\n]\n, say of Steklov:-\nHe was not only an outstanding mathematician but also had an unusually bright personality. ... Steklov has bequeathed to us not only classical works in mathematics and mathematical physics, but also works of some literary merit. These include his book To America and back\n(1925)\n, based on his impressions of his trip to the United States, as well as his books about Lomonosov and\nGalileo\n. Yet his vast literary legacy\n[\nhis diary\n]\nis still waiting to be published and commented upon.",
  "matematicos_citados_na_biografia": [
    "Lyapunov",
    "Clebsch",
    "potential theory",
    "boundary-value problems",
    "Kharkov Mathematical Society",
    "partial differential equations",
    "A N Korkin",
    "Friedmann",
    "Smirnov",
    "Tamarkin",
    "Russian Academy of Sciences",
    "A P Yushkevich",
    "Dirichlet",
    "Laplace's equation",
    "eigenfunctions",
    "Poincaré",
    "Fourier",
    "Parseval",
    "Fourier series",
    "Galileo"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}