{
  "nome_completo": "Vladimir Petrovich Potapov",
  "nome_curto": "Vladimir Potapov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Potapov/",
  "data_nascimento": "24 January 1914",
  "local_nascimento": "Odessa, Ukraine",
  "data_morte": "21 December 1980",
  "local_morte": "Kharkov, USSR (now Kharkiv, Ukraine)",
  "summary": "Vladimir Potapov was a Ukrainian mathematician who worked on matrix functions.",
  "biografia": "Vladimir Potapov\ndid not attend school but was taught, from the age of six, by his father who was a lecturer in Old Russian Literature at the University of Odessa. Potapov's father taught him mathematics, history, literature and languages. However he had a special music teacher, as music was at this stage his first love, and his mother also assisted in his education also teaching him literature.\nPotapov entered Odessa conservatory to study music and for three years he followed the course. At this time, see\n[\n3\n]\n:-\nHe was well educated and, although only seventeen, very serious. Whatever he did, he did in a very serious fashion, he walked and spoke slowly, and had his own opinion about everything. Even his teachers at the conservatory respected his profundity and thoroughness and called him 'professor'. And, as time proved, they were not mistaken.\nHowever he did not complete the four year course, transferring instead to the Faculty of Physics and Mathematics at Odessa University.\nAt Odessa University, Potapov was a student of\nLivsic\nand he was also taught by\nLivsic\n's teacher\nKrein\n. After graduating in\n1939\nhe began to work for his doctorate on the problem of divisors of almost periodic polynomials. Europe was disrupted by World War II soon after he began his doctoral work but due to poor eyesight Potapov did not have to undertake military duties. He was sent to the Odessa Institute of Marine Engineer, however, to undertake mathematical work in keeping with the war effort.\nIn\n1941\nPotapov was evacuated from Odessa which is in south-western Ukraine on the Black Sea coast. He taught at a school in Fari but was allowed to return to Odessa in\n1944\nand, much delayed by the war, submitted his doctoral thesis to Odessa University in\n1945\n.\nWhen the war was over people of Jewish descent were victimised. In particular Jewish lecturers at Odessa such as\nKrein\nand\nLivsic\nwere dismissed from their posts. Potapov was not Jewish but he wrote an article attacking the policy of dismissing Jewish lecturers:-\nThe leaders of the university have to correct their mistakes and to revive immediately the famous traditions of the Odessa School of Mathematics. The Faculty of Physics and Mathematics has to become active again, as a really creative centre of scientific and mathematical thought in our city ....\nHe did not stop at an article as is explained in\n[\n3\n]\n:-\nDuring the forties and fifties V P Potapov made many unsuccessful attempts to bring M G Krein and his students back to the university. The leaders of the Faculty of Physics and Mathematics could not forgive him for this. In fact they prohibited the use of any subject connected with Potapov's investigations as a theme for a diploma.\nIn\n1948\nPotapov was invited to the Pedagogical Institute at Odessa. He soon became Head of Mathematics and, from\n1952\n, Dean of the Faculty of Physics and Mathematics. He used his position to invite Livsic and others to the Institute.\nDuring the\n1950\ns Potapov worked on the theory of J-contractive\nmatrix\nfunctions and the analysis of matrix functions became his main work. He published papers on the multiplicative theory of analytic matrix functions in the years\n1950\n-\n55\nwhich contain work from his doctoral thesis. He also worked on interpolation problems.\nFrom\n1974\nPotapov lectured at Odessa Institute of National Economy, then he went to Kharkov to head the Department of Applied Mathematics at the Institute for low temperature physics.",
  "matematicos_citados_na_biografia": [
    "Livsic",
    "Krein",
    "matrix"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}