{
  "nome_completo": "Vladimir Ivanovich Smirnov",
  "nome_curto": "Vladimir Smirnov",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smirnov/",
  "data_nascimento": "10 June 1887",
  "local_nascimento": "St Petersburg, Russia",
  "data_morte": "11 February 1974",
  "local_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "summary": "Vladimir Smirnov was a Russian mathematician who made important contributions in both pure and applied mathematics, and also in the history of mathematics.",
  "biografia": "Vladimir Smirnov\nattended the Second\nGymnasium\n, the oldest secondary school in St Petersburg, and there he won the gold medal for mathematics. From school he entered the Physics and Mathematics Faculty of St Petersburg University.\nSmirnov had become friends with a number of outstanding mathematicians while at the Second Gymnasium. He was particularly friendly with\nFriedmann\nand\nTamarkin\n, who were in the class below him at school. Valentina Doinikova, who was a friend of\nFriedmann\n, describes how the three went around together while undergraduates at St Petersburg University:-\nFriedmann\n,\nTamarkin\nand Smirnov often came together, and they were called 'the boys from the second Gymnasium'. They were always smart and neatly dressed, and always called each other - in public - by their first name and patronymic.\nIn\n1910\nSmirnov graduated from St Petersburg and remained at the University to study for the higher degrees which would allow him to become a university teacher. At the University a circle was formed in\n1911\nto study mathematical analysis and mechanics. Smirnov was a very active member of this circle, for example lecturing on the theory of algebraic equations, particularly the work of\nGoursat\nand\nAppell\n. In session\n1911\n-\n12\nhe gave nine lectures on\nGoursat\n's books.\nSmirnov worked jointly with his friends from the Second Gymnasium. He published a joint paper with\nFriedmann\nin\n1913\nwhich was published in the\nJournal of the Russian Physico-Chemical Society\n(\nPhysics Section\n)\n. He wrote the first volume of his major five volume work\nA Course in Higher Mathematics\njointly with\nTamarkin\n.\nFrom\n1912\nSmirnov taught at the St Petersburg Institute of Railway Engineering. He taught at Simferopol University in the southern Ukraine from\n1919\nto\n1922\n, then he returned to St Petersburg\n(\nby now Leningrad\n)\n. Smirnov was awarded his doctorate in\n1936\nand he became head of the Institute of Mathematics and Mechanics. He became the head of the Mathematics School at the University of Leningrad and was elected to the\nUSSR Academy of Sciences\n.\nIn\n1953\nSmirnov organised the Leningrad Mathematical Seminar. To some extent this Seminar also filled the gap left when the\nLeningrad Mathematical Society\ndisbanded due to political pressure in the late\n1920\ns. Smirnov had been an active member of the\nLeningrad Mathematical Society\nthrough the\n1920\ns and he was a strong believer in relaunching the Society. In\n1959\n, mainly due to the efforts of Smirnov, it became possible to restart the\nLeningrad Mathematical Society\nand Smirnov was elected the honorary president of the Society.\n(\nIn\n1990\nthe name of the Society was changed from the Leningrad Mathematical Society back to the\nSt Petersburg Mathematical Society\n.\n)\nSmirnov's mathematical activity was in both pure and applied mathematics. He wrote the five volume work\nA Course in Higher Mathematics\nreferred to above, which was widely used in Russia. He worked on conjugate functions in multidimensional euclidean space and the theory of functions of a complex variable. With Sobolev he devised a method for obtaining solutions on the propagation of waves in elastic media with plane boundaries. Other applied mathematical work resulted in him developing methods for studying oscillations of elastic spheres.\nIn\n[\n1\n]\nthe authors write:-\n... V I Smirnov was not only an outstanding mathematician and a famous historian of science, but also a person of exceptional nobility, benevolence and culture. All these qualities left a lasting impression even on those who seldom had occasion to meet this remarkable man in person, still more on his pupils and associates. Their love and respect for their teacher's memory were reflected in a three-day scientific conference which was held in Leningrad in June\n1987\nand was dedicated to the centenary of the scientist's birth.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Friedmann",
    "Tamarkin",
    "Goursat",
    "Appell",
    "USSR Academy of Sciences",
    "Leningrad Mathematical Society",
    "St Petersburg Mathematical Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}