{
  "nome_completo": "Vladimir Gilelevich Maz'ya",
  "nome_curto": "Vladimir Maz'ya",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mazya/",
  "data_nascimento": "31 December 1937",
  "local_nascimento": "Leningrad, USSR (now St Petersburg, Russia)",
  "data_morte": null,
  "local_morte": null,
  "summary": "Vladimir Maz'ya is a Russian mathematician who works in mathematical analysis and partial differential equations.",
  "biografia": "Vladimir Maz'ya\n's childhood was difficult. His early years were those of World War II and as a consequence he suffered many hardships. In\n1941\nthe Germans invaded Russia and by September of that year German troops were on the outskirts of Leningrad cutting the city off from the rest of Russia. Vladimir's father was killed fighting on the front. Maz'ya was lucky to be able to leave the besieged city at this time.\nAfter the war, Maz'ya entered the Faculty of Mathematics and Mechanics of Leningrad State University when he was eighteen years old.\nGohberg\n[\n4\n]\ndescribes an event from his first year at university. Maz'ya:-\n... had solved all the problems for both first and second year while participating in the traditional olympiad of the Faculty. As Maz'ya did not make this a secret, his fellow students all decided not to submit their solutions. An unexpected result was that the jury deemed the contest a failure and no prizes were awarded to anyone, including the winner.\nThere was a positive side to this story, however, for\nS G Mikhlin\n, the professor of mathematics, invited the talented young Maz'ya to his home\n[\n4\n]\n:-\nMaz'ya never was a formal student of\nMikhlin\n, but\nMikhlin\nwas for him more than a teacher. Maz'ya had found the topics of his dissertations by himself, while\nMikhlin\ntaught him mathematical ethics and rules of writing, refereeing and reviewing.\nBy the time Maz'ya graduated from Leningrad State University in\n1960\nhe already had published a paper.\nSolution of Dirichlet's problem for an equation of elliptic type\n(\nRussian\n)\nwas published in\n1959\nand\nClasses of domains and imbedding theorems for function spaces\n(\nRussian\n)\nin\n1960\n. After graduating, Maz'ya was appointed as a Junior Research Scientist at the Mathematics and Mechanics Institute of Leningrad University. He published the two papers\nSome estimates of solutions of second-order elliptic equations\n(\nRussian\n)\nand\np-conductivity and theorems on imbedding certain functional spaces into a C-space\n(\nRussian\n)\nin\n1961\n, and then four further papers in\n1962\n, the year in which he was awarded his Candidate degree\n(\nequivalent to a doctorate\n)\nfrom Moscow State University. Also in\n1962\nMaz'ya was awarded the prize for the best junior mathematician by the\nLeningrad Mathematical Society\n.\nIn\n1964\nMaz'ya was promoted to the post of Senior Research Scientist and in the following year he was awarded a D.Sc. in mathematics from Leningrad State University. In addition to his position at the Mathematics and Mechanics Institute of Leningrad University, Maz'ya was appointed as professor in the Department of Mathematics of the Leningrad Shipbuilding Institute in\n1968\n. In\n1986\nhe was appointed as Head of the Laboratory of Mathematical Models in Mechanics at Leningrad Institute of Engineering Studies which was part of the\nUSSR Academy of Sciences\n. In\n1990\nMaz'ya moved to Sweden to become the equivalent of an associate professor in the Department of Mathematics at Linköping University. He was promoted to full professor at Linköping University three years later. In January\n2004\nMaz'ya was appointed as Professor of Mathematics at Ohio State University in the United States and in addition he was appointed Professor of Mathematics at Liverpool University in England in September of the same year.\nMaz'ya lists his mathematical interests as: linear and non-linear PDEs; asymptotic and numerical methods for PDEs, including homogenization and boundary elements; spectral theory; harmonic analysis; approximation theory; wavelets; elasticity theory; function spaces; ill-posed problems; non-linear potential theory; fluid mechanics; and the history of mathematics. This is a remarkable list but then one has to realise that he has around\n430\nitems in his list of publications. One feature of Maz'ya's approach is that he summarises his work on a particular theme by writing a book on the topic bringing together results appearing in various papers. These books are usually written in collaboration with other mathematicians working in the field. Let us briefly mention a few.\nHe published\n(\nwith Ju S Burago\n)\nCertain questions of potential theory and function theory for regions with irregular boundaries\n(\nRussian\n)\nin\n1967\n. The book is in two parts, the first is on the higher-dimensional potential theory and the solution of the boundary problems for regions with irregular boundaries while the second part is on the space of functions whose derivatives are measures. In\n1979\nand\n1981\nhe published his two part work\nImbedding theorems for Sobolev spaces\nand\nOn the theory of Sobolev spaces\n. In collaboration with S A Nazarov and B A Plamenevskii, Maz'ya published\nAsymptotic behavior of solutions of elliptic boundary value problems under singular perturbations of the domain\nin\n1981\n. Here is part of the authors own summary of the work:-\nThe book deals with the construction of asymptotic expansions of solutions of elliptic boundary value problems under singular perturbations of the domains\n(\ni.e. blunted angles, cones or edges, small holes, narrow slits, etc.\n)\nA general approach is suggested, its main feature being systematic application of solutions to the so-called 'limit' problems. Singularities of these solutions do not increase from one step to another. The procedure of rearrangement of discrepancies between different limit problems is essential for the method under consideration.\nThe first chapter is devoted to general boundary value problems for elliptic systems in domains perturbed near conic points. The\nDirichlet\nproblem for an arbitrary order elliptic equation in a domain with a cut off tubular neighbourhood of a smooth closed submanifold is considered in the second chapter. The main term of an asymptotic expansion for a solution of the\nDirichlet\nproblem for the Laplacian in a three-dimensional domain with a narrow slit is obtained in the third chapter. The fourth chapter deals with asymptotic expansions of solutions to a quasilinear equation of the second order.\nIn\n1985\n, together with Tatyana O Shaposhnikova, Maz'ya published\nTheory of multipliers in spaces of differentiable functions\nwhich was based on results discovered by the authors in\n1979\n-\n80\nand published in a number of papers. We should remark at this point that Tatyana Shaposhnikova is Maz'ya's wife. In\n1997\n(\nwith Vladimir Kozlov\n)\nMaz'ya published\nTheory of a higher-order Sturm-Liouville equation\nwhich Eastham summarises by writing that:-\n... the authors have identified a special type of higher-order analogue of the hyperbolic\nSturm\n-\nLiouville\nequation and they have developed a coherent theory based on the\nGreen\n's function. The account is concise but full and written with clarity.\nIn the same year the same two authors in collaboration with J Rossmann published\nElliptic boundary value problems in domains with point singularities\n. Agranovich summarises the work as follows:-\nIt is widely known that the authors have obtained many deep results for elliptic boundary value problems in domains with singularities. Here their experience permits them to present the results in a very complete and accessible form. Without doubt, the book will be interesting for many mathematicians working with elliptic boundary problems in smooth and non-smooth domains, and it would be frequently used in any mathematical library.\nAnother book, which puts together work appearing in papers over a number of years, is\n(\nwith S V Poborchi\n)\nDifferentiable functions on bad domains\nalso published in\n1997\n. In the following year Maz'ya made a remarkable contribution to the history of mathematics when he published\nJacques Hadamard, a universal mathematician\nin collaboration with his wife Tatyana Shaposhnikova. One year later, in\n1999\n, Maz'ya, together with Vladimir Kozlov, published\nDifferential equations with operator coefficients with applications to boundary value problems for partial differential equations\n. Yu V Egorov's summary states:-\nThe book is very well written. The exposition is very clear and detailed, illustrated by many examples of applications of the stated theory. All the proofs are complete and rely on undergraduate university courses on real and complex analysis and some basic facts of\nfunctional analysis\nand of the theory of partial differential equations. As a serious mathematical monograph containing many new results, the book can be widely used by students.\nVery high quality books by Maz'ya continue to appear, adding greatly to the mathematical literature. For example we list a few recent works without detailing the co-authors:\nSpectral problems associated with corner singularities of solutions to elliptic equations\n(2000)\n;\nAsymptotic theory of elliptic boundary value problems in singularly perturbed domains\n(2000)\n;\nSpectral problems associated with corner singularities of solutions to elliptic equations\n(2001)\n; and\nLinear water waves\n(2002)\n.\nGohberg\nwrites in\n[\n4\n]\n:-\nWhatever he writes is beautiful, his love for art, music and literature seeming to feed his mathematical aesthetic feeling.\nMaz'ya has received, and continues to receive, numerous awards for his remarkable contributions. We mentioned above the prize he was awarded by the\nLeningrad Mathematical Society\nearly in his career. Other prizes include the Humboldt Research Prize\n(1999)\n, the Verdaguer Prize of the\nFrench Academy of Sciences\n(2003)\n, and the\nCelsius\nGold Medal of the Royal Society of Sciences at Uppsala\n(2004)\n. He was awarded an honorary degree by the University of Rostock in\n1990\n. He was elected to the\nRoyal Society of Edinburgh\n(2001)\n, and the\nRoyal Swedish Academy of Sciences\n(2002)\n. Several international conferences were organised for the occasion of his\n60\nth\nbirthday and for his\n65\nth\nbirthday.\nMaz'ya was seventy years old on the last day of\n2007\nand two conferences were organised in\n2008\nto honour him for his\n70\nth\nbirthday. From\n30\nJune to\n3\nJuly\n2008\nthe Conference 'Analysis, PDEs and Applications' was held in Rome, and on\n25\n-\n27\nAugust\n2008\nthe Nordic-Russian Symposium was held in Stockholm in his honour. In addition the\nAmerican Mathematical Society\npublished\nPerspectives in Partial Differential Equations, Harmonic Analysis and Applications: A Volume in Honor of Vladimir G Maz'ya's\n70\nth\nBirthday\nin their Proceedings of Symposia in Pure Mathematics series.\nOne should certainly not imagine that Maz'ya's scientific activity has decreased. Remarkably, in\n2007\n, the year of his\n70\nth\nbirthday, he published three books:\n(\nwith S V Poborchii\n)\nImbedding and Extension Theorems for Functions in Non-Lipschitz Domains\n;\n(\nwith Gershon Kresin\n)\nSharp Real-Part Theorems. A Unified approach\n; and\n(\nwith Gunther Schmidt\n)\nApproximate Approximations\n. In\n2009\nhe published, jointly with Tatyana O Shaposhnikova, the major volume\nTheory of Sobolev multipliers. With applications to differential and integral operators\n.\nOn\n3\nJuly\n2009\nthe\nLondon Mathematical Society\nannounced that they had awarded their Senior\nWhitehead\nPrize for\n2009\nto Maz'ya:-\n... in recognition of his contributions to the theory of differential equations.",
  "matematicos_citados_na_biografia": [
    "Gohberg",
    "S G Mikhlin",
    "Mikhlin",
    "Leningrad Mathematical Society",
    "USSR Academy of Sciences",
    "Dirichlet",
    "Sturm",
    "Liouville",
    "Green",
    "functional analysis",
    "French Academy of Sciences",
    "Celsius",
    "Royal Society of Edinburgh",
    "Royal Swedish Academy of Sciences",
    "American Mathematical Society",
    "London Mathematical Society",
    "Whitehead"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}