{
  "nome_completo": "Walter Ledermann",
  "nome_curto": "Walter Ledermann",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ledermann/",
  "data_nascimento": "18 March 1911",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "22 May 2009",
  "local_morte": "London, England",
  "summary": "Walter Ledermann was a refugee from Germany who did his doctorate at St Andrews and taught here until 1946 . He did important work in algebra and in particular in group theory.",
  "biografia": "Walter Ledermann\nwas born in Berlin into a Jewish family. His father was William Ledermann and his mother was Charlotte Apt. He entered the Köllnisches\nGymnasium\nin Berlin in\n1917\n, progressing to the Leibniz Gymnasium in the same city in\n1920\n. There he learnt classics, studying Latin for nine years and Greek for six years. The school also taught French but, as was usual at this time, not much science. Although very little mathematics was taught in German schools in general, Walter had the advantage that the Leibniz Gymnasium taught more mathematics than other schools as a mark of respect for\nLeibniz\nafter whom the school was named. He writes\n[\n2\n]\n:-\nAlthough I was fond of the classics, especially Greek with its wonderful literature, I was fascinated by mathematics immediately after my first lesson at the age of eleven, and I decided there and then to make mathematics my career.\nIn\n1928\n, when he was seventeen years old, Ledermann graduated from the Leibniz Gymnasium and received the necessary certificate which allowed him to study at any German university. He remained in Berlin and entered the University there\n(\nnow the Humboldt University\n)\nto study for the State Examination which was the qualification necessary to enter secondary school teaching.\nAt the University of Berlin Ledermann was taught by many famous mathematicians including\nSchur\n,\nSchmidt\n,\nvon Mises\n,\nPlanck\n,\nSchrödinger\n,\nHopf\n,\nFeigl\n, and others. As one might imagine given this array of famous names, he found it a stimulating experience. Ledermann was most influenced by\nSchur\nand, in\n[\n3\n]\n, he describes attending\nSchur\n's lectures:-\nSchur\nwas a superb lecturer. His lectures were meticulously prepared...\n[\nand\n]\nwere exceedingly popular. I remember attending his algebra course which was held in a lecture theatre filled with about\n400\nstudents. Sometimes, when I had to be content with a seat at the back of the lecture theatre, I used a pair of opera glasses to get at least a glimpse of the speaker.\nHis main subjects were mathematics and physics, but he also had to study chemistry to a lower level and to take an oral examination on philosophy. Ledermann spent one semester in\n1931\nin Marburg but other than this all his courses were taken in Berlin.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. However, there was an exemption clause which exempted non-Aryans who had civil service appointments before the end of World War I. Although\nSchur\nqualified under this clause he was initially expelled from his professorship and was only reinstated after the intervention of\nSchmidt\n. He was not, however, allowed to lecture but he examined Ledermann before the end of\n1933\n.\nLedermann was nearing the end of his studies for the\nStaatsexamen\n(\nwhich would allow him to teach\n)\nwhen Hitler came to power and began passing the anti-Jewish legislation. In order to complete the course he had to write a dissertation and be given an oral examination.\nSchur\ngave him the topic for his dissertation\nOn the various ways of expressing an orthogonal\nmatrix\nin terms of parameters\nand conducted his oral examination in November\n1933\n. At the oral he was examined by\nSchur\nand also by\nBieberbach\nwho was wearing Nazi uniform.\nIt was quite clear to Ledermann that he had to leave Germany to escape the Nazi persecution of the Jews. He had already made many strenuous efforts to find a way to leave Germany before his oral. He won a scholarship from the International Student Service in Geneva to study at the University of St Andrews in Scotland and they supplied him with the necessary papers to allow him to travel to St Andrews in January\n1934\n. Ledermann writes\n[\n5\n]\n:-\nI have a deep affection for St Andrews. For it was the students and the people of St Andrews who saved my life by helping me to escape from the Nazis. It became my home in a real sense.\nAt first it appeared that he might get caught up in the University of St Andrews' regulations. The problem was that the State Examination was just that, in that it was awarded by the Ministry of Education, not by the University of Berlin. Therefore it was not a degree but a diploma. Fortunately Ledermann was spared the stupidity of having to take the undergraduate courses at St Andrews, and, as Ledermann writes in\n[\n2\n]\n:-\n... for the first time in the five hundred years history of the university a person with a German state examination was admitted as a research student.\nLedermann's doctoral studies were supervised by\nTurnbull\nand he was awarded his Ph.D. in\n1936\n. Under\nTurnbull\n, Ledermann studied the problem of finding the canonical form for a pair of real or complex\nn\n×\nn\nn \\times  n\nn\n×\nn\nmatrices under simultaneous equivalence. He also worked on the problem of classifying the stabiliser of the pencil which is a linear combination of the two matrices.\nIn\n1937\nhe became a temporary lecturer in Dundee but the most fruitful work he undertook during this period was as a private assistant to Professor Sir Godfrey Thomson at the University of Edinburgh. Thomson headed the Moray House Group at Edinburgh which was undertaking research into intelligence testing. Ledermann was able to use his expert knowledge of matrix theory to put the work of this group onto a sound mathematical footing. As well as matrix theory he was involved in using statistical methods and he retained this interest in his later research publications. The quality of the work Ledermann undertook at this time is clearly shown from the fact that Edinburgh awarded him a D.Sc. for it in\n1940\n. While in Edinburgh Ledermann also worked with\nMax Born\nand\nA C Aitken\n.\nIn\n1938\nLedermann returned to St Andrews. The letter\n[\n6\n]\nfrom\nTurnbull\nto Ledermann offers him a one year post as an assistant, capable of renewal, at St Andrews for the academic year\n1938\n-\n39\nat a salary of £\n350\n. Turnbull writes\n[\n6\n]\n:-\nIt will involve from\n8\nto\n10\nlectures or tutorials a week in mathematics pure and applied; and the Court understand that I have looked out for one who is competent to teach particularly in Analysis and Applied Mathematics. Your special knowledge of the applications of mathematics to problems involving matrices and statistics is an advantage; but you will realise, Walter, in view of the needs of this Department, that proficiency in teaching Applied Mathematics and the functions connected therewith will be important.\nIn fact Ledermann remained at St Andrews from\n1938\nuntil\n1946\n. During this time he became a British citizen\n(1940)\nand also undertook some war work. In\n[\n5\n]\nhe describes his association with\nFreundlich\nduring this period:-\n...\nFreundlich\nwas very close to me. He was a fatherly friend of whom I have many fond memories, most especially because he introduced me to my wife\n[\nRuth Stefanie\n(\nRushi\n)\nStadler\n]\n, whom I married in\n1946\n. During the war Freundlich and I taught navigation at the Initial Training Wing of the RAF which was stationed in St Andrews. We also published a joint paper in the Monthly Notices of the\nRoyal Astronomical Society\nin\n1944\n... . We had other interests in common apart from mathematics:\nFreundlich\nwas a keen cellist, and we frequently played chamber music where I played the violin or viola. Once we went on holiday together to the West coast of Scotland, when Mrs Freundlich was unable to come. ... he was a tall impressive man, and when we walked side by side through the streets of St Andrews people would say: \"Here come the Sun and Moon\".\nLedermann's wife Ruth\n(\nknown as Rushi\n)\nwas a psychotherapist and the newly married couple decided to move to a bigger city so that Ruth might be able to pursue her work. Ledermann accepted a lectureship at the University of Manchester in\n1946\n. He writes\n[\n4\n]\n:-\nThe sixteen years we spent in Manchester were stimulating and fruitful.\nParticularly of note during his time in Manchester was the fact that he was secretary to the first\nBritish Mathematical Colloquium\nwhich he organised in Manchester at the request of\nHodge\n,\nHenry Whitehead\n, and\nMax Newman\n.\nBy the time he left Manchester, Ledermann had been promoted to a Senior lecturer. In\n1962\nhe accepted a readership at the newly established University of Sussex and three years later he was promoted to professor. He retired in\n1978\nand was made Emeritus Professor. For many years after retiring he continued to teach at Sussex, giving both tutorials and seminars.\nAs well as work in matrix theory which we have commented on above, Ledermann was especially known for his work in\nhomology theory\n,\ngroup theory\n, and\nnumber theory\n. As a result of\nSchur\n's teaching he\n[\n4\n]\n:-\n... developed a liking for \"concrete\" mathematics and a distaste for \"abstraction\" for its own sake.\nThis is evident, even in his work in what is usually thought of as one of the most abstract of topics, homology theory.\nFirst I\n[\nEFR\n]\nwill make some comments on Ledermann's book\nIntroduction to the Theory of Finite Groups\n(1949)\n. It is the book from which I learnt group theory and, although it was not the only influence on my choice of research topic, it was a major factor in my decision to work on group theory problems for my doctoral dissertation. The topics covered in the book look fairly standard but one has to remember that in the\n1940\ns there were few group theory texts and the concept of standard material for such courses did not exist. The little book\n(152\npages\n)\ndiscusses the group axioms, isomorphisms, cyclic groups, coset decompositions,\nLagrange\n's theorem,\npermutation groups\n,\nnormal subgroups\n, quotient groups, homomorphisms, the first and second isomorphism theorems, and the\nJordan\n-\nHölder\ntheorem. The simplicity of the\nalternating groups\nis proved and the Sylow theorems,\np\np\np\n-groups and finitely generated\nabelian groups\nare discussed. Ledermann succeeds admirably in meeting his own aims in that he:-\n... never hesitated to sacrifice completeness for breadth or to reject more modern methods when\n[\nhe\n]\nconsidered alternative presentations to be more intelligible.\nOther books which Ledermann has written for undergraduates include\nComplex numbers\n(1960)\n,\nIntegral calculus\n(1964)\n,\nMultiple integrals\n(1966)\n,\nIntroduction to group theory\n(1973)\n, and\nIntroduction to\ngroup characters\n(1977)\n. This last volume, which still shows\nSchur\n's influence, strikes a good balance between the abstract approach to\nrepresentation theory\nemphasising modules, and the concrete approach built around matrices. It is an outstanding text from which to teach the topic.\nAmong the editorial work undertaken by Ledermann is his editorship of the\nJournal of the London Mathematical Society\n(1968\n-\n71)\nand of the\nBulletin of the London Mathematical Society\n(1974\n-\n77)\n. He is the chief editor of the\nHandbook of Applicable Mathematics\nwhich consists of nine volumes, an index volume and a number of guide books. This project, again very much in line with Ledermann's approach to mathematics, is designed for the \"professional adults\" who:-\n... find themselves needing to understand a particular mathematical idea... will then be able to turn to the appropriate article in the core volume ... and find out just what they want to know.\nLedermann has received honours for his work which include election to the\nRoyal Society of Edinburgh\n(1944)\nand an honorary doctorate from the Open University\n(1993)\n.\nHis son writes\n(\nMay\n2009)\n:-\nIt is with great sadness that I am writing to let you know that my father passed away  peacefully this morning. His energy, enthusiasm and dry humour were with him almost to the end. We shall miss him very much but we all have wonderful memories of his long and fulfilled life.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Leibniz",
    "Schur",
    "Schmidt",
    "von Mises",
    "Planck",
    "Schrödinger",
    "Hopf",
    "Feigl",
    "Staatsexamen",
    "matrix",
    "Bieberbach",
    "Turnbull",
    "Max Born",
    "A C Aitken",
    "Freundlich",
    "Royal Astronomical Society",
    "British Mathematical Colloquium",
    "Hodge",
    "Henry Whitehead",
    "Max Newman",
    "homology theory",
    "group theory",
    "number theory",
    "Lagrange",
    "permutation groups",
    "normal subgroups",
    "Jordan",
    "Hölder",
    "alternating groups",
    "abelian groups",
    "group characters",
    "representation theory",
    "Royal Society of Edinburgh"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}