{
  "nome_completo": "Walther Franz Anton von Dyck",
  "nome_curto": "Walther von Dyck",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Von_Dyck/",
  "data_nascimento": "6 December 1856",
  "local_nascimento": "Munich, Germany",
  "data_morte": "5 November 1934",
  "local_morte": "Munich, Germany",
  "summary": "Von Dyck made important contributions to function theory, group theory ( where a fundamental result on group presentations is named after him ) topology and potential theory.",
  "biografia": "Perhaps we should first comment that\nWalther von Dyck\nwas not known by precisely that name in his youth, but rather by the name Walther Dyck. He was ennobled with the \"von\" only much later in his life.\nWalther's father was Hermann Dyck while his mother was Marie Royko. Hermann Dyck was a painter and he was the Director of the Kunstgewerbeschule in Berlin, that is the Berlin School of Industrial Art. Walther certainly inherited his father's artistic abilities but in addition he had a wide range of skills across the arts and sciences.\nHe studied at a number of German universities, which was the standard pattern for students at that time. After beginning his studies at the University of Munich, he then spent time studying at the Universities of Berlin and Leipzig. He received his doctorate from Munich in\n1879\nfor a thesis entitled\nÜber regulär verzweigte Riemannsche Flächen und die durch sie definierten Irrationalitäten\nⓉ\n(\nOn regularly branched Riemann surfaces and irrationalities defined by them\n)\n. His thesis supervisor was\nKlein\nwho had been appointed to a chair at the Technische Hochschule at Munich a few years before in\n1875\n.\nIn\n1880\nKlein\nleft Munich to take up the chair of geometry at Leipzig. Dyck went to Leipzig to take up a position as\nKlein\n's assistant and there he submitted his\nhabilitation\nthesis, receiving the university lecturing qualification in\n1882\n. During this period Dyck made important contributions to\ngroup theory\nwith the publication of two papers;\nGruppentheoretische Studien\nⓉ\n(\nGroup theoretical studies\n)\nin\nMathematische Annalen\nthe first in\n1882\nand the second in the following year.\nKlein\nwould remain at Leipzig until\n1886\n, but Dyck left two years before that when he was appointed professor at newly established Munich Polytechnikum. In\n[\n3\n]\nDyck's work at the Munich Polytechnikum is studied in detail. In particular Hashagen, the author of\n[\n3\n]\n, examines the way von Dyck tried to solve the problems which arose in the training of engineers. Von Dyck stressed how important a basic knowledge in mathematics was to engineers and he worked hard to construct a consistent course to include varied topics.\nDyck would remain at the Munich Polytechnikum for the rest of his career and gave outstanding service to it in many important ways. He was appointed Director of the Polytechnikum in\n1900\nand under his inspired leadership the institution rose to university status becoming the Technische Hochschule of Munich. He served as rector of the Technische Hochschule for two terms, the first from\n1903\nto\n1906\nand the second from\n1919\nto\n1925\n.\nThere was another important project in which von Dyck played an important role. This was the creation of the Deutsches Museum of Natural Science and Technology. The idea was first suggested by Oskar von Miller who was an electrical engineer who was instrumental in setting up the electric power industry in Germany. In\n1903\nMiller enlisted the help of von Dyck and of Carl von Linde who had been appointed extraordinary professor of machine design at the Munich Polytechnikum in the same year as von Dyck was appointed. They proposed that a museum be built in Munich which would both preserve technological artefacts and let visitors learn about the scientific principles through interactive displays.\nThe Deutsches Museum was first of its kind and its ideas were soon copied by other science museums around the world. Not only was von Dyck one of the three to establish and develop the museum in its early stages, but he was also appointed as the second Director of the Museum in\n1906\n.\nVon Dyck made important contributions to function theory, group theory\n(\nwhere a fundamental result on\ngroup presentations\nis named after him\n)\n,\ntopology\n(\nwhere he was influenced by the work of\nRiemann\n)\n, and to\npotential theory\n. He made significant contributions to the\nGauss\n-\nBonnet\ntheorem.\nAnother important project which von Dyck undertook was one to publish the complete works of\nKepler\n, including all\nKepler\n's letters. He undertook this in his role as class secretary of the Bayerische Akademie der Wissenschaften in\n1906\n. This project has extended well beyond von Dyck's lifetime with Volume\n7\nappearing in\n1953\n, and Volume\n8\nin\n1963\n.\nVon Dyck's character and contribution are summed up in\n[\n1\n]\nas follows:-\nLinguistically gifted and a warm, kind-hearted man of wide-ranging and liberal interests, including art and music, Dyck was an outstanding scholar and organiser and an enthusiastic and inspiring teacher.",
  "matematicos_citados_na_biografia": [
    "Klein",
    "habilitation",
    "group theory",
    "group presentations",
    "topology",
    "Riemann",
    "potential theory",
    "Gauss",
    "Bonnet",
    "Kepler"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}