{
  "nome_completo": "Walter Samuel McAfee",
  "nome_curto": "Walter Samuel McAfee",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McAfee/",
  "data_nascimento": "2 September 1914",
  "local_nascimento": "Ore City, Upshure County, Texas, USA",
  "data_morte": "18 February 1995",
  "local_morte": "South Belmar, New Jersey, USA",
  "summary": "Walter McAfee was an African-American scientist and astronomer, best known for his part in the world's first lunar radar echo experiments.",
  "biografia": "Walter Samuel McAfee\n's African-American parents were Luther F McAfee and Suzie A Johnson. Luther McAfee's father was a minister in the Colored Methodist Episcopal Church which had originated from a movement begun in\n1866\nwithin the Methodist Episcopal Church, South, from which the black members set up an independent Church. Luther McAfee had been educated at Texas College, which was run by the Colored Methodist Episcopal Church, and then became a carpenter. Walter's mother Suzie was the daughter of a farmer. She came from a well-educated family with one of her brothers, an uncle of Walter, was a medical doctor who had first been awarded a Bachelor's Degree. Suzie had studied at Wiley College in Marshall, Texas, and had qualified as an elementary teacher but she never had a teaching position in a school.\nWalter McAfee was the second of his parents nine children. When he was three months old his parents moved from Ore City to Marshall in Harrison county, northeastern Texas. His parents seven other children were all born in Marshall. Although his mother never taught in a school, she did teach all her nine children and she did this well for all nine of them went on to study at college. Walter attended High School in Marshall graduating in\n1930\n. One teacher at the school in particular influenced him:-\nThe man who taught me chemistry was an excellent teacher and he also taught me physics. His name was Freeman Prince Hodge. I sometimes become emotional when I think about him because when I was finishing high school my mother and father came to see the place and Hodge met them in the hallway. He told them, \"I always refer to him as my intellectual giant.\" I'd never known that he had thought that much of me, except that I know that we were more than just a little friendly.\nIn September\n1930\nhe entered Wiley College in Marshall where his mother had studied. Again a teacher there was specially influential:-\n[\nMcCain\n]\ntaught me general physics and sophomore mechanics at Wiley College. He was very instrumental in advising me when I first started taking physics as I was talking about taking engineering.\nMcAfee was awarded a Bachelor's Degree with distinction from Wiley College June of\n1934\nand began to look for jobs. The Depression had begun in October\n1929\nbut lasted for around ten years so in\n1934\njobs were still hard to find. McAfee was only\n19\nyears old so did not worry too much when he did not quickly find a teaching job. he took on a number of temporary jobs such as farm labouring, working as a carpenter's assistant, temporary teaching posts, and working as a door-to-door salesman. He decided during the summer of\n1935\nto continue his education and wrote to Ohio State University in Columbus, Ohio asking if they had a place for graduate studies and he was instantly accepted.\nHe travelled to Columbus by bus and told Graduate Admissions:-\nI'd like to major in theoretical mathematical physics.\nHe was immediately given a place and he worked for his Master's Degree under the supervision of Llewllyn H Thomas. He graduated in\n1937\nand decided to earn money as a teacher while working towards his doctorate:-\nI got my Master's in June of '\n37\nand then I taught in a junior high school in Columbus, Ohio. I taught general science, mathematics, and\n9\nth\ngrade biology there for five years from October '\n37\nto April of '\n42\n.\nDuring this time he met Viola Winston, who taught French at the same junior high school and they married in\n1941\n. McAfee was a hard worker and most summers when the school was on vacation, he studied high level courses at the university. He wanted to contribute to the war effort and began applying for positions. Applications asked for a photograph to be included and McAfee was rejected several times, almost certainly because he was Black. Eventually he applied to join the Electronics Research Command section of the U.S. Army Signal Corps at Fort Monmouth and this time no photograph was required.\nHe would have taken leave of absence from his teaching post while taking on this War Service but his school were not prepared to allow this:-\n... the assistant superintendent ... in charge of secondary education ... tried to get me to stay. He said, \"If you were being drafted to fight the war or if for some particular need, you had some particular talent and they were drafting you to do a job for a certain length of time, we would give you the leave of absence. But we've decided that all of our people with special training or special talents would be leaving us, if we gave them leave of absence. You'll have to resign and when the war is over, you have to come back and apply on the same basis as other people apply.\" I said, \"I think I'll resign.\"\nHe became a member of the Project Diana. This project was to attempt to bounce radar signals off the moon. They certainly knew that their task was hard since two previous attempts had failed. McAfee was well qualified to be on this team for he had published papers on radar-echoing areas, radar cross sections and refraction studies in the atmosphere. McAfee did the necessary mathematical calculations to ensure that Project Diana would succeed:-\nI computed a radar cross section of the moon, a radar coverage pattern, and distance to the moon, so they could tell how big the signal would be when it returned.\nThe project was successful and a radar pulse was sent through a special antenna on\n10\nJanuary\n1946\n, with the echo from the moon being received\n2\n.\n5\nseconds later. The success of the project was publicly announced two weeks later in the\nNew York Times\n(\nsee\n[\n1\n]\n)\n. Official reports of the projects success, however, failed even to mention that McAfee was on the team.\nAfter the completion of Project Diana, McAfee was awarded a Rosenwald Fellowship in May\n1946\nto enable him to complete his doctoral studies at Cornell University:-\nI didn't get any of the publicity until after I got the Rosenwald Fellowship to Cornell, which was announced around May or June of that year. The moon radar was announced in January and then in May or June they wrote big articles about me and then they made some nice statements about how I had worked on the theoretical problems connected with radar.\nMcAfee's Ph.D. was in physics and was supervised by Hans Bethe. He completed the work in\n1948\nand returned to become Head of the Theoretical Unit of the Nucleonics Section at the U.S. Army Signal Corps at Fort Monmouth. His doctorate was awarded by Cornell in February\n1949\n.\nIn\n1953\nhe became Head of the Electromagnetic Wave Propagation Section. His interest in teaching, however, meant that when the opportunity arose he took it:-\nI taught a course in differential and integral calculus in one summer to all of the engineers who were entering Rutgers that fall. I was surprised, some of these engineers didn't have the slightest idea about calculus. Finally, at the end of the class there were only about four people I would have passed in that course in calculus and there were about twenty-nine or thirty in the class.\nIn was the first recipient of the Secretary of the Army Research and Study Fellowship in\n1956\n. It was to study radio astronomy and solar physics and was presented to McAfee by President Eisenhower. As part of this Fellowship he worked at Harvard for a year.\nMcAfee was induced into the Science Hall of Fame at Wiley College in\n1982\n. He retired from the Signal Corps in\n1985\n. In the same year he received the Stevens Award from the Stevens Institute of technology. On\n28\nJuly\n1997\nthe McAfee Center was dedicated at Fort Monmouth. It was the first facility of its kind named after a civilian.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "thumbnail.jpg"
  ]
}