{
  "nome_completo": "Walter Richard Talbot",
  "nome_curto": "Walter R Talbot",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Talbot_Walter/",
  "data_nascimento": "13 December 1909",
  "local_nascimento": "Pittsburgh, USA",
  "data_morte": "26 December 1977",
  "local_morte": "Washington D.C., USA",
  "summary": "Walter R Talbot was an American mathematician who worked in group theory. He was the fourth African American to earn a Ph.D. in Mathematics.",
  "biografia": "Walter R Talbot\n's parents were the African-Americans Jerry Talbot and Carrie E Payne. Jerry Talbot, born on\n14\nSeptember\n1870\nin Forest Depot, Virginia, USA, was a foreman working on street paving. Carrie Payne, born on\n10\nMarch\n1880\nin Campbell County, Virginia, USA, married Jerry Talbot on\n29\nNovember\n1899\nin Allegheny, Pennsylvania, USA. We note that on at least one official document, Carrie's year of birth is given as\n1877\n. Jerry and Carrie Talbot had five children, one dying as a baby. The four surviving children were Helen V Talbot\n(1901\n-\n1951)\n, Reginald P Talbot\n(1904\n-\n1981)\n, Jerry W Talbot Jr\n(1907\n-\n1944)\n, and Walter Richard Talbot\n(1909\n-\n1977)\n, the subject of this biography. At the time Walter was born the family were living in a rented home at\n5635\nMignonette Street, Pittsburgh, together with Carrie's father Richard Payne and her brother William Payne. Walter's parents could read and write and his\n[\n8\n]\n:-\n... parents and grandparents had attained their education in spite of limited opportunities for formal schooling.\nHe wrote about his education in\n[\n1\n]\n:-\nThe tone had been created long before that by grandparents who had no educational opportunities but who practised writing and who virtually taught themselves to read, with occasional help, of course, from their \"learned\" grandchildren. Part of the while I was in elementary school my oldest brother\n[\nReginald\n]\nwas in college, and I can recall his drilling aloud on the mysterious trigonometric functions. The impressions made on me must have been deep because in my teaching I always had my students master, beyond the psychological point of recall, the frequently used basic notions of mathematics.\nAfter elementary school, Talbot progressed to High School in\n1923\n[\n1\n]\n:-\nMy high school was regarded, at least by its students, as one of the better \"academic\" ones, but only the customary two years of mathematics were offered; so in my last two years, I took chemistry and physics. The two chemistry teachers were sincere and encouraging. Dr Gorgas regularly hired a coloured\n(\nterm in vogue then\n)\ngirl as departmental secretary. One of the physics teachers acted as if another student and I had forgotten \"our place\" by taking physics. Our reaction to him was to keep scoring high on every test he gave. ... Calling names is risky because everyone who has been an influence cannot be listed, but I must name a few who set patterns for me. My high school Latin teacher, R N Taylor, provided guidance and encouragement through all four years. In my senior year, I was assigned to Miss Ealy's section of English Literature. She was a brilliant scholar with her vast knowledge of the subject and the influences affecting it, and she was a masterful teacher, as indicated by the ease with which she had her students reading the original works and not the condensed booklets. Maybe she is the one who got me started on teaching without leaning on notes.\nGraduating from high school, Talbot entered the University of Pittsburgh in\n1927\n[\n1\n]\n:-\nThe physical world always fascinated me; so I continued physics in college, almost to having a major. Were it not for the depression that forced me to hold on to a little college-student job that provided meals and streetcar fare but for which the work hours overlapped the laboratory hours, I might have majored in physics.\nThe Pittsburgh Directory for\n1929\nhas him living at his home address with the occupation of 'waiter' which is clearly the college-student job he referred to in the quote above. Continuing to describe his university studies, he said\n[\n1\n]\n:-\nThe depression, then, was a factor in my choosing an intriguing, but non-laboratory major. Fortunately, in mathematics I met some professors who were inspiring and friendly. Professor M M Culver was my advisor for all seven years. Professor Foraker taught me several geometry courses, and after I started teaching, he went out of his way to make sure that I did not make the error of passing up election to Sigma Xi. Several years later, it was Professor Knipp who drew upon the record and his memory in presenting my credentials for alumni membership at the induction ceremonies for Phi Beta Kappa.\nWalter Talbot received a Bachelor of Arts in Mathematics and Physics from the University of Pittsburgh in\n1931\n. In\n1934\nhe received a Ph.D. in Mathematics, also from the University of Pittsburgh. His thesis advisor had been Montgomery Morton Culver\n(1891\n-\n1950)\n, a faculty member in the department of mathematics at University of Pittsburgh from\n1924\n-\n1950\n, and the title of his thesis was\nFundamental regions in\nS_\n6\nfor the simple quaternary\nG_\n60\n, Type I\n. He gives the following Introduction to the thesis:-\nA finite group of order g will permute a point into g points at the most. A set of points which are permuted among themselves by the operators of the group are said to form a conjugate set of points. The complete system of points no two of which are conjugates under a given group may be said to define a fundamental region for the group. There are then g fundamental regions for a collineation group of order g. Some studies of fundamental regions for certain groups have been made\n[\nF Klein\n,\n1890\n; J W Young,\n1911\n; H F Price,\n1918]\nand the problem dealt with in these notes is the determination of the fundamental regions in six-space for the simple quaternary group of order sixty.\nThomas Hales writes in\n[\n4\n]\n:-\nWalter Richard Talbot was the fourth African American to earn a Ph.D. in Mathematics. His doctoral degree is from the University of Pittsburgh in\n1934\nin geometric group theory. As far as I know, research in Pittsburgh on geometric group theory seems to have started with Professors J S Taylor and M M Culver at the University of Pittsburgh, who were both academic descendants of\nFelix Klein\n. They were both members of Talbot's thesis committee. Talbot's research grew out of\nKlein\n's work on fundamental domains. A contemporary research program was the determination of fundamental domains of finite group actions on complex vector spaces.\nAfter the award of his doctorate, Talbot was appointed as an assistant professor at Lincoln University in Jefferson City, Missouri. Lincoln University began as Lincoln Institute in\n1866\nto educate African-Americans. It became Lincoln University in\n1921\ngoverned by a Board of Curators. It became an accredited four-year college of arts and sciences in\n1934\n, the year Talbot was appointed, and graduate instruction was begun in the summer session of\n1940\n. In\n1938\nLincoln University stated:-\nDr Walter Talbot is Lincoln University's youngest Doctor of Philosophy. He is a member of Sigma Xi, national honorary scientific fraternity, and Pi Tau Phi, national scholastic society. He has served as advisor to the class of '\n38\nsince its freshman year.\nTalbot was promoted to associate professor and then to full professor. In\n1939\nhe became Dean of Men and in\n1944\nhe became Head of Mathematics. He said of his colleagues\n[\n1\n]\n:-\n... in post-college days there were colleagues such as President Sherman Scruggs of Lincoln University\n(\nMo.\n)\n, who tolerated differing points of view at a time when many presidents did not, and college teachers who knew not only their fields but also good procedures through familiarity with the literature of the very active accreditation organizations.\nTalbot married Kathleen Almira Mitchell who was born on\n22\nMay\n1915\nin Greensboro, Guilford, North Carolina, USA. She was the daughter of George Henry Mitchell\n(1875\n-\n1933)\nand Lucy Case Smith\n(\nborn\n1888)\nand attended Woodward High School, Cincinnati, Ohio. Walter and Kathleen Talbot had two children, Walter Richard Talbot Jr., born\n11\nDecember\n1938\nin Jefferson City, and Kathleen Talbot, born\n18\nDecember\n1940\nin Cincinnati, Ohio. Walter Richard Talbot Jr. became an oral surgeon and died on\n22\nDecember\n2004\n.\nTwo pieces of data from\n1940\nare as follows. In the\n1940\nCensus Talbot is living at\n504\nLafayette Street, Jefferson City with his wife Kathleen Talbot and his son Walter Talbot. He registered for the Draft on\n16\nOctober\n1940\ngiving an address of\n720\nLafayette Street, Jefferson City. It states he is living with his mother who is his 'Next of Kin' and gives his appearance as follows: Complexion - Light Brown; Eye Colour - Brown; Hair Colour - Black. By October\n1940\n, his wife had gone back to her parents to await the birth of her second child. We note that the house at\n504\nLafayette Street was known as \"The Monastery\" in the\n1930\ns and\n1940\ns and was a popular gathering place for Lincoln University intellectuals and their guests.\nThe local Jefferson City newspapers give a lot of information about Talbot. For example, in April\n1941\nhe was building a five rooms, brick and tile home on Lafayette Street. On Friday\n30\nOctober\n1942\nit states that Walter R Talbot, of\n1008\nLafayette street, entertained for the week-end Mr and Mrs N A Sweets and daughter. Nathaniel A Sweets was a graduate of Lincoln University who became the publisher of the\nSt Louis American\nnewspaper which was a driving force in the St Louis campaign for equal rights, fair housing practices, and better schools for African-Americans. The same Friday\n30\nOctober\n1942\nJefferson City newspaper reports that the Talbot's young daughter Kathleen returned to Cincinnati with her grandmother, Lucy Mitchell. The Friday\n27\nNovember\n1942\nnewspaper even tells us that:-\nWalter R Talbot and Raymond Kemp made a week-end motor trip to St Louis to do some shopping.\nRaymond Kemp\n(1907\n-\n2002)\nwas the Director of Health, Physical Education and Athletics, and coached varsity football, basketball and track and field at Lincoln University.\nOn Friday\n29\nSeptember\n1944\nit is reported that Walter R Talbot resigned as dean of men and became head of the department of mathematics. He was chairman of the University Defense council and registrar from\n1946\nto\n1948\n. We also learn in the Jefferson City newspapers of Talbot's achievements at bridge. For example in November\n1954\nhe was awarded the Pla-Mor trophy for high points and on Friday\n24\nMay\n1963\nhe won first place honours at the Pla-Mor Duplicate Bridge Club.\nIn\n1963\nTalbot left Lincoln University when he succeeded Clarence Stephens\n(1917\n-\n2018)\n, the ninth African-American to receive a Ph.D. in mathematics, as the Chair of the Department of Mathematics at Morgan State University. This University, founded as the Centenary Biblical Institute in\n1867\n, was renamed Morgan College in\n1890\nand then moved to its present site in northeast Baltimore in\n1917\nafter receiving a major grant from Andrew Carnegie. A private institution until\n1939\n, the state of Maryland purchased the College to provide more opportunities for its African-Americans. When Talbot took up his position there, it was still named Morgan College and only in\n1975\n, two years before he retired, did it become a university with the right to award doctorates. After moving to Baltimore, Talbot lived at\n4902\nPilgrim Road.\nThe situation for African-Americans began to improve during Talbot's time at Morgan College. For Talbot's description of the African-American breakthrough to the national mathematical bodies, see\nTHIS LINK\n.\nIn fact Talbot was on the\nAmerican Mathematical Society\nCommittee on Legal Aid in\n1977\n. Johnny L Houston writes\n[\n6\n]\n:-\nTalbot served the\nMathematical Association of America\nin several significant capacities, and he was a major driving force among the seventeen who came together in January\n1969\nto found the\nNational Association of Mathematicians\n(\nNAM\n)\n. More than any other single individual, it was Talbot's leadership, guidance, organizational skills, and networking skills that raised funds for the establishment of NAM.\nThe obituary\n[\n3\n]\ngives details of Talbot's contributions to Morgan State University:-\nAccording to Dr Earl Embree, professor of mathematics at Morgan, Dr Talbot's main contribution to Morgan was the introduction of computer technology and its use to the students. Mrs Cynthia Harvey, an assistant professor, said \"Dr Talbot provided excellent leadership for the department by getting new faculty involved with student activities. He encouraged them to expand their horizons. He encouraged department members to work together for common goals.\" Dr Talbot also directed a summer institute in mathematics at Morgan for secondary school teachers. ... In\n1967\n, he was named to the scientific council of the Maryland Academy of Sciences. Other honours included membership in Phi Beta Kappa. Dr Talbot was a member of the\nAmerican Mathematical Society\n, the\nMathematical Association of America\n, the Central Association of Science and Mathematics Teachers, the Maryland State Teachers Association, Beta Kappa Chi Scientific Society, Sigma Xi, Alpha Phi Alpha and the American and National bridge associations.\nAlthough Talbot did relatively little research after his thesis, concentrating on his teaching, he did submit a paper to the Seventy-Sixth Summer Meeting of the American Mathematical Society held in Pennsylvania State University in September\n1971\n. The paper, co-authored with Volodymyr Bohun-Chudyniv, also of Morgan State College, was On algorithms for constructing distributive idempotent quasi-groups of order\n2\n(\n3\nq\n+\nr\n)\n(\nr\n=\n1\n,\n2\n)\n2(3q + r) (r = 1,2 )\n2\n(\n3\nq\n+\nr\n)\n(\nr\n=\n1\n,\n2\n)\n. The authors' Abstract is as follows:-\nAn idempotent quasi-group is called distributive if for any of its\n3\nelements the following relations hold:\na\n(\nb\nc\n)\n=\na\nb\n.\na\nc\n;\n(\na\nb\n)\nc\n=\na\nc\n.\nb\nc\na(bc) = ab.ac ; (ab)c = ac.bc\na\n(\nb\nc\n)\n=\na\nb\n.\na\nc\n;\n(\na\nb\n)\nc\n=\na\nc\n.\nb\nc\n. In a paper, \"On distributive idempotent quasi-groups defined by\nn\n−\nn-\nn\n−\ntuple systems\" presented at a MAA meeting on April\n29\n,\n1971\n, at Loyola College, Baltimore, the first author\n[\nBohun-Chudyniv\n]\nintroduced the\n4\nnonisotopic types of idempotent quasi-groups and algorithms for constructing them. In this paper the authors introduce distributive idempotent quasi-groups of order\n2\n(\n3\nq\n+\nr\n)\n(\nr\n=\n1\n,\n2\n)\n2(3q + r) (r = 1, 2)\n2\n(\n3\nq\n+\nr\n)\n(\nr\n=\n1\n,\n2\n)\n, and algorithms for constructing them. Each algorithm consists of two parts. Part one is a triple-system of\n3\nq\n+\nr\n(\nr\n=\n1\n,\n2\n)\n3q + r (r =1, 2)\n3\nq\n+\nr\n(\nr\n=\n1\n,\n2\n)\norder. The second part consists of two operators constructed from the triplets of the system. For triple-systems of different orders there are\n24\ndifferent numbers of pairs of operators. Therefore the total number of distributive idempotent quasi-groups equals\n30\n×\n24\n=\n720\n30 \\times  24 =720\n3\n0\n×\n2\n4\n=\n7\n2\n0\ndistributive idempotent quasi-groups of the\n8\nth order.\n30\nis the number of triple-systems of the\n7\nth order. Illustrative examples are given and theorems are proved.\nTalbot suffered kidney problems and retired in May\n1977\n. On Monday\n26\nDecember\n1977\n, he was an outpatient in the renal dialysis unit of Howard University Hospital, Washington D.C. when he suffered a heart attack and died. His funeral was held on Saturday\n31\nDecember\n1977\nat the Stewart Funeral Home,\n4001\nBenning Road, N.E., Washington, D.C. His interment was at Harmony Memorial Park, Hyattsville, Prince George's County, Maryland, which, although racially integtated, is mostly African-Americans.\nVarious honour have been given to Talbot following his death. In\n1978\n, the\nNational Association of Mathematicians\nhonoured Talbot at an \"In Memorial\" luncheon and, in the same year, Morgan State University named a scholarship in his honour. The Cox-Talbot Lecture was inaugurated in\n1990\nin honour of\nElbert Frank Cox\nand Walter Richard Talbot. The first lecture was\nSome Milestones of the Past, Challenges of the Future\ndelivered by Johnny L Houston, a co-founder of the\nNational Association of Mathematicians\n, given during the annual\nNational Association of Mathematicians\nBanquet as part of the Joint Mathematics Meeting at Louisville, Kentucky, in January\n1990\n.",
  "matematicos_citados_na_biografia": [
    "F Klein",
    "Felix Klein",
    "Klein",
    "THIS LINK",
    "American Mathematical Society",
    "Mathematical Association of America",
    "National Association of Mathematicians",
    "Elbert Frank Cox"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}