{
  "nome_completo": "Yuan Wang",
  "nome_curto": "Wang Yuan",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wang_Yuan/",
  "data_nascimento": "29 April 1930",
  "local_nascimento": "Lanxi, Zhejiang province, China",
  "data_morte": "14 May 2021",
  "local_morte": "Beijing, China",
  "summary": "Wang Yuan ass a Chinese mathematician best known for his contributions to the Goldbach conjecture.",
  "biografia": "Wang Yuan\nwas born in Lanhsi, a town on the Lan River. It is in Chekiang province\n(\nalso called Che-chiang or Zhejiang province\n)\n, a coastal province bordering the East China Sea. His father, Wang Maoqing, was a county magistrate. Wang Yuan spent the first seven years of his childhood in Lanhsi which at that time was in an area benefiting from modernization programs, but things changed in\n1937\nwhen war broke out between China and Japan. Chekiang province was in the front line for Japanese attacks and many people left the province and moved to safer areas further west such as to Szechwan  province\n(\nalso called Ssu-ch'uan or Sichuan province\n)\n. This is where Wang Yuan's family moved in\n1937\n, leaving Chekiang province before the Japanese occupied much of it which they did by\n1938\n. The family moved to Jiangbei which is now known as Yubei. It lies close to Chungking\n(\nalso called Ch'ung-ch'ing, or Chongqing\n)\nthe largest city of Szechwan province. There Wang Yuan completed his primary schooling in a modest school since at this stage his family were rather poor.\nIn\n1942\nWang Yuan's father became the chief secretary in the\nAcademia Sinica\n, the Chinese national research organization. Wang Yuan enrolled in the National Second Middle School in Ho-ch'uan\n(\nalso called Ho-yang, Hechuan, or Heyang\n)\n, still in Szechwan province, However, in\n1946\nhis family moved to Nanking\n(\nalso called Nan-ching or Nanjing\n)\nthe capital of Kiangsu province where he attended the middle school attached to the Social Education College. He graduated in\n1948\nand entered Yingshi University to study mathematics. After one year of study Yingshi University became part of Chekiang University\n(\nfounded in\n1897)\nin Hangchow. This was fortunate since Chekiang University had a strong mathematics department with an excellent seminar organised for graduate students. Wang Yuan fell in love with\nanalytic number theory\nand gave a series of lectures to the graduate seminar based on\nIngham\n's book\nThe distribution of prime numbers\n.\nWang Yuan graduated in\n1952\nand was assigned a position by the government in the Institute of Mathematics at the\nAcademia Sinica\nin Nanking.\nChern\nhad acted as director there from\n1946\nto\n1949\nbut had returned to the United States three years before Wang Yuan started to work there. Wang Yuan was assigned to the number theory section where he worked under Professor\nHua Loo Keng\n, the director of the Institute.\nMost of Wang Yuan's research has been in the area of number theory. He looked at sieve methods and applied them to the\nGoldbach Conjecture\n. He also applied circle methods to the\nGoldbach\nConjecture. In\n1956\nhe published\n(\nin Chinese\n)\nOn the representation of large even integer as a sum of a prime and a product of at most\n4\nprimes\nin which he assumed the truth of the\nRiemann hypothesis\nand with that assumption proved that every large even integer is the sum of a prime and of a product of at most\n4\nprimes. He also proved that there are infinitely many primes\np\np\np\nsuch that\np\n+\n2\np + 2\np\n+\n2\nis a product of at most\n4\nprimes. In\n1957\nWang Yuan published four papers:\nOn sieve methods and some of their applications; On some properties of integral valued polynomials; On the representation of large even number as a sum of two almost-primes\n; and\nOn sieve methods and some of the related problems\n. In the first of these he proved, among other results, that for infinitely many integers\nn\n,\nn\n3\n+\n2\nn, n^{3} + 2\nn\n,\nn\n3\n+\n2\nhas at most\n4\nprime factors. In the third paper he proved that every even integer is the sum of two integers each of which has at most\n5\nprime factors. The last of the four\n1957\npapers proved, this time assuming the\nRiemann\nhypothesis, that every sufficiently large even integer is the sum of a prime and a product of at most\n3\nprimes, and there are infinitely many primes\np\np\np\nsuch that\np\n+\n2\np + 2\np\n+\n2\nis the product of at most\n3\nprimes.\nWang Yuan continued to improve his results on the\nGoldbach\nconjecture. In\n1958\nOn sieve methods and some of their applications. I\nshowed that every even integer is the sum of two integers, one of which has at most\n2\nprime factors, the other having at most\n3\nprime factors. He also attacked other questions in number theory in papers such as\nOn the least primitive root of a prime\n(1959)\nand\nOn Diophantine approximations and numerical integrations. I, II\n(1964)\n. Also in\n1964\nhe published two papers on orthogonal Latin squares:\nA note on the maximal number of pairwise orthogonal Latin squares of a given order\n; and\nOn the maximal number of pairwise orthogonal latin squares of order s, an application of the sieve method\n.\nPolitical changes in China meant that his research stopped in\n1966\n. The Chinese Communist Party chairman Mao Zedong launched the Cultural Revolution in August\n1966\n. Schools were shut, there was widespread disorder, and many intellectuals were not only verbally attacked but were physically abused. Higher education was greatly curtailed, for example education at Peking University ceased from\n1966\nto\n1970\n. Wang Yuan was harassed and put through critical interrogation. From\n1966\nto\n1972\nhe did no mathematical research but after\n1972\nhe resumed his research activities, although never as vigorously as before the start of the Cultural Revolution. However he did write a number of books such as:\n(\nwith\nHua Loo Keng\n)\nApplications of number theory to numerical analysis\n(1978)\n;\nGoldbach Conjecture\n(1984)\n;\n(\nwith\nHua Loo Keng\n)\nPopularising mathematical methods in the People's Republic of China\n(1989)\n;\nDiophantine equations and inequalities in algebraic number fields\n(1991)\n;\n(\nwith Fang Kai-Tai\n)\nNumber theoretic methods in statistics\n(1994)\n;\nHua Loo Keng\n(1995)\n; and\n(\nwith Fong Yuen\n)\nCalculus\n(1997)\n.\nIn\n1978\nWang Yuan was promoted to professor at the Institute of Mathematics at the\nAcademia Sinica\nand elected to membership of the\nAcademia Sinica\nin\n1980\n. In\n1984\nhe became director of the  Institute of Mathematics at the\nAcademia Sinica\n. He was elected as president of the\nChinese Mathematical Society\nduring\n1988\n-\n92\n. He was also honoured with many prizes for his books promoting mathematical learning.\nFinally let us note that he became interested in the history of mathematics and published\nAnalytic number theory in China\nin\n2001\n. Wang Yuan once noted that\nBuqing Su\nplayed an important role in helping modern mathematics research in China which really started in the\n1930\ns.",
  "matematicos_citados_na_biografia": [
    "Academia Sinica",
    "analytic number theory",
    "Ingham",
    "Chern",
    "Hua Loo Keng",
    "Goldbach Conjecture",
    "Goldbach",
    "Riemann hypothesis",
    "Riemann",
    "Chinese Mathematical Society",
    "Buqing Su"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}