{
  "nome_completo": "Wawrzyniec Żmurko",
  "nome_curto": "Wawrzyniec Żmurko",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zmurko/",
  "data_nascimento": "10 July 1824",
  "local_nascimento": "Jaworów, Galicia, Austrian Empire (now Yavoriv, Ukraine)",
  "data_morte": "3 April 1889",
  "local_morte": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "summary": "Wawrzyniec Żmurko was an important figure in beginning to build the University of Lwów into a leading mathematics centre. He was an early worker in what later became known as the vector calculus and developed the theory and practical use of mathematical instruments.",
  "biografia": "Wawrzyniec Żmurko\nwas also known by the German version of his name, Lorenz Zmurko. He was born into a family of poor middle-class people who were able to send their son to the gymnasium in Przemyśl for his secondary education. The gymnasium in Przemyśl, now named after the Polish Romantic poet Juliusz Słowacki, has a long history dating back to\n1628\nwhen it was founded by the Jesuits who taught there until\n1787\n. The town had become part of the Austrian Empire in\n1772\nin the First Partition of Poland and teaching at the Gymnasium was in German from\n1788\n. In\n1820\n, a two-year philosophy department was established at the school, the completion of which allowed students to start university studies. Żmurko grew up completely bilingual speaking Polish at home but having his school education in German.\nAt this Gymnasium, Żmurko was taught mathematics by Franz Chlebeczek who was a priest in the Piarist Order and professor of pure elementary mathematics at the Przemyśl Philosophical Institute. Żmurko also studied philosophy at Przemyśl for two years after graduating from the Przemyśl Gymnasium and, taking advice from Chlebeczek, he then went to Vienna in\n1846\nfor further studies in mathematics.\nIn Vienna, Żmurko attended lectures at the Vienna Polytechnic Institute given by\nLeopold Karl Schulz von Strassnitzki\n. He also attended lectures at the University of Vienna given by\nJózeph Miksa Petzval\n. At this stage Żmurko had to support himself financially and he did so by giving private tuition. Both\nSchulz von Strassnitzki\nand\nPetzval\nwere very impressed by the rapid progress that Żmurko made.\nSchulz von Strassnitzki\ntook a special interest in Żmurko's career and soon after\n1848\nhe offered him the position as his assistant at the Vienna Polytechnic Institute. In\n1849\nŻmurko submitted the thesis\nBeitrag zum Integralcalcul\nⓉ\n(\nIntroduction to integral calculus\n)\nand was appointed as an assistant professor at the Vienna Polytechnic Institute.\nIn\n1851\nŻmurko left Vienna and returned to Galicia when he was appointed as an assistant professor on mathematics at Lwów Technical Academy. Let us note that Lwów was in the Austrian Empire at this time and, although it was known as Lwów by Polish people, officially it was known by its German name of Lemberg. Poland had been partitioned in\n1772\nwith Lwów as the capital of Galicia which became a part of the Austrian Empire. The Lemberg Technical Academy had been founded as a technical school in\n1817\nand upgraded to a Technical Academy in\n1844\n. Ever since the partition of Poland there had been attempts by the Poles to re-establish an independent country. Some attempts were less ambitious and only sought for more autonomy and recognition for Polish as the language in educational establishments. There had been a revolution in\n1848\nduring which Austrian troops shelled the Lwów town centre. The Technical Academy buildings were destroyed by fire and until\n1850\nlectures had to be held in temporary accommodation. Work to restore the original building was completed in December\n1850\n, and it was in this newly restored building that Żmurko began teaching in\n1851\n.\nGiven the difficult political situation, it is interesting to look at the ethnic mix of the students in the Technical Academy in the year Żmurko was appointed. There were\n220\nstudents,\n98\nof whom were Polish,\n50\nwere Jewish,\n48\nwere German,\n19\nwere Ukrainian/Ruthenian,\n4\nwere Czech and\n2\nwere Hungarian. Josef Weiser\n(1810\n-\n1881)\nhad been the professor of physics at the Technical Academy and he had proposed that the Academy be reorganised along the lines of the École Polytechnique in Paris. In\n1852\n, the year the reorganisation began, Żmurko was appointed as a full professor of mathematics and head of the Department of Mathematics at the Technical Academy. This marked a major change for the Technical Academy since he was the first Pole to become a professor there. We note that in his\n1861\nbook, Żmurko gives his affiliation as 'Royal Professor of Mathematics at the Technical Faculty in Lwów and active member of the Galician Economic Society'.\nWawrzyniec Żmurko married Henryka Zofalów\n(\nborn\n31\nJanuary\n1828\n, died\n30\nNovember\n1894)\n. They had a daughter Eugenia Żmurków\n(1854\n-\n1922)\nwho married the mathematician\nOskar Fabian\n(\nborn\n28\nFebruary\n1846\nin Nowy Dwór, died\n28\nOctober\n1899\nin Lwów\n)\n. They also had a son Franciszek Żmurko\n(1859\n-\n1910)\nborn in Lwów on\n18\nJuly\n1859\nwho became a famous painter. We will say a little more about Franciszek Żmurko below.\nWe assume that Żmurko taught both in Polish and in German in his early years in Lwów. Certainly his\n2\n-volume book\nMatematyka\nⓉ\n(\nMathematics\n)\n(1861)\nabout his method of teaching, reprinted as\nWykład matematyki na podstawie ilości o dowolnych kierunkach w przestrzeni\nⓉ\n(\nMathematics lectures based on quantities with arbitrary directions in space\n)\n(1864)\n, was written in Polish while some other works like\nDrei Aufsätze aus dem Gebiete der höheren Mathematik\nⓉ\n(\nThree extensions to the world of high mathematics\n)\n(1858)\nare written in German. As far as teaching was concerned, there was a major change beginning in\n1871\nwhen a Decree of Emperor Franz Joseph I of Austria established Polish as an official language for all teaching in Galicia. This produced some problems at both the Technical Academy and the University of Lwów since some of the staff could not teach in Polish and left. This, however, was excellent as far as Żmurko was concerned. In that year, in addition to his position in the Technical Academy, he was appointed as a full professor of mathematics at the University of Lwów. He continued to hold both positions until\n1884\n. Let us note that Lwów Technical Academy became the Lwów Polytechnic in\n1877\n. In\n1884\nhe resigned his professorship at Lwów Polytechnic but continued to hold the chair of mathematics at the University of Lwów.\nŻmurko published books and papers on a variety of mathematical topics. His published works include papers and books on the theory of differential equations, the theory of analytic and real functions, linear algebra and applications of mathematics. One interesting work is the book\nMatematyka\nⓉ\n(\nMathematics\n)\n(1861)\nwhich, in some respects, looks at ideas which later led to the vector calculus. He writes in the Preface to this work\n[\n7\n]\n:-\nSeveral decades ago, several papers appeared showing an almost unanimous tendency to give the so-called imaginary quantities the meaning of reliability in terms of their position in space. For eight years I too had been constantly occupied with this subject; it was not until\n1856\nthat I came into possession of a work of greater size and great importance\n(\n'Situationskalkül'\nⓉ\n(\nSituational calculus\n)\nby Hermann Scheffler, Braunschweig\n1851)\n, that I became convinced that as regards the first principles of mathematics no one had yet gone down the path I had outlined for myself, but that in the further development of the science, both in terms of newly introduced expressions and in terms of calculation in analytic geometry, I had been considerably surpassed.\nThe book\nSituationskalkül\nⓉ\n(\nSituational calculus\n)\nhad been published in\n1851\nby Hermann Scheffler\n(1820\n-\n1903)\n, a German engineer, mathematician and physicist. The book was an:-\nAttempt at an arithmetic representation of lower and higher geometry based on an abstract conception of spatial sizes, forms and movements ...\nAugust Christian Wilhelm Hermann Scheffler worked as a construction supervisor and surveyor from\n1846\n, becoming a financial secretary in\n1851\nand then financial assessor in\n1853\nfor the railway and postal directorate in Braunschweig. In\n1854\nScheffler was appointed building inspector and in\n1870\nsenior building inspector. In his time he was considered an important railway expert, developed construction and operating principles in the railway system and wrote numerous mathematical and physical works. From\n1876\nto\n1885\nhe was railway director in Braunschweig. He was, therefore, an amateur mathematician and physicist with\nSituationskalkül\nⓉ\n(\nSituational calculus\n)\nbeing one of the first his many mathematical works. Żmurko was not discouraged by the fact that ideas that he had worked on had been developed much further. In fact this proved an incentive for him to continuing to undertake research on this topic and also to use the ideas he was developing in his teaching. He says in the Preface to\nMatematyka\nⓉ\n(\nMathematics\n)\nthat he had used the ideas in his teaching from\n1856\n.\nFor an English translation of Żmurko's Preface to\nMatematyka\nⓉ\n(\nMathematics\n)\n(1861)\n, see\nTHIS LINK\n.\nŻmurko was supported in his work by having Włodzimierz Dzieduszycki\n(1825\n-\n1899)\nas a patron. Dzieduszycki, who was a member of the Austrian Council of State, lived on family estates in Poturzyca about\n80\nkm north of Lwów. In\n1847\nhe brought the famous Poturzyce-Zarzecka Library from Poturzyca to Lwów. Dzieduszycki gave Żmurko access to the library and he was able to consult many relevant books there. Dzieduszycki also financed the publication of Żmurko's works. He writes in the Preface of\nMatematyka\nⓉ\n(\nMathematics\n)\n[\n7\n]\n:-\nI consider it a pleasant duty to express my heartfelt thanks to His Excellency Count Włodzimierz Dzieduszycki for facilitating the publication of this work. His constant zeal and readiness to make any sacrifices for the advancement of scientific literature ... encouraged me to accelerate this work, providing me with abundant means to publish it.\nMathematical instruments were one of Żmurko's interests and he submitted a communication to the\nParis Académie des Sciences\non an instrument intended to trace conic sections in a continuous movement. A report by\nJean-Victor Poncelet\non his communication was published in\nComptes rendus\nof the\nAcadémie des Sciences\nin\n1862\n.\nAnother work by Żmurko which we must mention is\nBeitrag zur Erweiterung der Operationslehre der constructiven Geometrie\nⓉ\n(\nContribution to the extension of the operational theory of constructive geometry\n)\n(1873)\nin which he presented the theory and description of a number of mathematical instruments. These include the cycloidograph, the ellipsograph and the parabolograph, These gained him international fame and he was awarded medals and prizes at the exhibition in Vienna in\n1873\n, in Lwów in\n1877\n, in Paris in\n1878\nand in London in\n1878\n.\nŻmurko was president of the Polish\nCopernicus\nSociety of Naturalists in\n1879\n-\n81\n. During his time as president, he delivered the lecture \"On some devices for plotting\" to a meeting of the Polish\nCopernicus\nSociety of Naturalists in Lwów on\n8\nFebruary\n1880\n. You can read the introduction to this lecture at\nTHIS LINK\n.\nIn\n1879\nhe published the book\nBadania w dziedzinie nauki o równaniach oparte na poglądach analityczno-geometrycznych w przestrzeni\nⓉ\n(\nResearch in the science of equations based on analytic-geometrical views in space\n)\nwhich he dedicated to Józef Ignacy Kraszewski. Kraszewski was a writer and musician who worked all his life in the cause of Polish independence. The Austrian authorities, of course, tried to suppress the Polish independence movement and he was arrested and served time in prison. Kraszewski was awarded an honorary degree from the University of Lwów in\n1879\n, the same year as Żmurko dedicated his book to him. Making such a dedication shows clearly Żmurko's views on Polish independence and even to dedicate a book to Kraszewski must have been a somewhat risky thing to do. Is it possible that the reason that the biography of Żmurko in the Biographical Lexicon of the Austrian Empire\n[\n3\n]\nfails to mention this book a result of this dedication? Certainly\n[\n3\n]\nwas written before Polish independence was established. The\n1879\nbook describes instruments that Żmurko spoke about in his lecture on\n8\nFebruary\n1880\n, and perhaps the most interesting instrument described in the book was his integrator, used for graphical solution of integral calculus problems.\nAmong other distinctions, we note that Żmurko was awarded an honorary doctorate by the University of Lwów in\n1878\n. He was dean of the Philosophical Faculty of the University of Lwów in the academic year\n1878\n-\n79\nand rector of the University of Lwów in\n1885\n-\n86\n. He was elected a full member of the Kraków Academy of Sciences in\n1872\nand a full member of the French Academy of Agriculture, Crafts and Commerce in\n1878\n.\nWe will now give a few details of Żmurko son Franciszek Żmurko. Franciszek Józef Jan Żmurko was born in Lwów on\n18\nJuly\n1859\n. He attended schools in Lwów and took his first drawing lessons from the painter and ethnographer Franciszek Tepa. Now Tepa had been offered a professorship at the Academy of Fine Arts in Kraków in\n1872\n, which he had rejected due to his attachment to Lwów. However, he advised Franciszek Żmurko to study at the Academy of Fine Arts in Kraków and he went there in\n1876\n. From\n1880\nhe lived in Kraków but two years later he settled in Warsaw. He gained a worldwide reputation for his paintings, mainly inspired by women, which were dominated by Old Testament, oriental and antique themes.\nIt was Wawrzyniec Żmurko who created the beginnings of the important school of mathematics at Lwów, especially for teaching and advising\nJózef Puzyna\n.\nPuzyna\nattended lectures on mathematics from Żmurko and on applied mathematics by\nOskar Fabian\n. He undertook research towards his doctorate advised by Żmurko and he submitted his thesis\nO pozornie dwuwartościowych określonych całkach podwójnych\nⓉ\n(\nOn apparently two-valued definite double integrals\n)\nwhich was examined by Żmurko and\nOskar Fabian\n.\nPuzyna\n's\nhabilitation\nexamination was held on\n11\nDecember\n1884\nand the questioning was led by Żmurko.\nPuzyna\nbecame Head of the Department of Mathematics at the University of Lwów following the death of Żmurko in\n1889\n.\nPuzyna\nwas not the only person to be awarded a doctorate in mathematics by the University of Lwów while Żmurko was head of the Mathematics Department;\nPuzyna\nwas one of five, the other four being Placyd Dziwinski in\n1881\n, Mieczysław Łazarski in\n1883\n, Jan Rajewski in\n1886\nand Michal Kozłowski in\n1885\n.\nHere are examples of courses that Żmurko taught in the\n1880\ns:\nSummer\n1881\n-\n82\n: Principles of higher analysis\n(4\nhours a week\n)\n, and On the integration of partial differential equations and distinguishing the maxima and minima of definite integrals\n(2\nhours a week\n)\n.\nWinter\n1884\n-\n85\n: Analytical Geometry on the plane and space\n(3\nhours a week\n)\n; and On the determining certain integrals and solving differential equations\n(3\nhours a week\n)\n.\nWinter\n1888\n-\n89\n: The principles of integration of differential equations\n(3\nhours a week\n)\n; and The rules of commutative calculus\n(2\nhours a week\n)\n.\nFollowing Żmurko's death, he was buried in the tomb of the family of Wawrzyniec Żmurko in Łyczakowski Cemetery in Lwów, now known as Lychakiv Cemetery in Lviv.",
  "matematicos_citados_na_biografia": [
    "Leopold Karl Schulz von Strassnitzki",
    "Józeph Miksa Petzval",
    "Schulz von Strassnitzki",
    "Petzval",
    "Oskar Fabian",
    "THIS LINK",
    "Paris Académie des Sciences",
    "Jean-Victor Poncelet",
    "Académie des Sciences",
    "Copernicus",
    "Józef Puzyna",
    "Puzyna",
    "habilitation"
  ],
  "imagens": [
    "zmurko.jpg"
  ]
}