{
  "nome_completo": "Wei-Liang Chow",
  "nome_curto": "Wei-Liang Chow",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Chow/",
  "data_nascimento": "1 October 1911",
  "local_nascimento": "Shanghai, China",
  "data_morte": "10 August 1995",
  "local_morte": "Baltimore, Maryland, USA",
  "summary": "Chow Wei-Liang was a Chinese mathematician  known for his work in algebraic geometry.",
  "biografia": "Wei-Liang Chow\nwas born into a leading Mandarin family in China. His family believed that success for China would come through westernisation, so Wei-Liang Chow never attended school in China but was sent to the United States. He did, however, receive private tutoring in the Chinese language and in Chinese history before going to the United States. He attended Asbury College in Wilmore, Kentucky and then studied at the University of Kentucky. He next went to the University of Chicago where he was awarded his B.S. in\n1931\nand a Master's degree in the following year. It was only during his years in Chicago that he made the decision to concentrate his efforts on the study of mathematics.\nHaving decided to study mathematics there was, without doubt, no better place to go than Göttingen in Germany. However, arriving there in the autumn of\n1932\nhe was soon affected by the rise to power of Hitler and the serious consequences for the mathematics department there due to the racialist policies of the National Socialist party. Chow disliked the atmosphere which had descended on Göttingen due to the Nazis so decided that he would rather go to Leipzig and study for his doctorate under\nvan der Waerden\n. It was\nvan der Waerden\nwho introduced Chow to\nalgebraic geometry\nat this time, pointing him towards the work of\nSeveri\n,\nBertini\nand\nEnriques\n. Chow went to Hamburg for a vacation in the summer of\n1934\nand there he met Margot Victor. Always seeking the best, he decided to live in Hamburg where he could attend lectures by\nArtin\nand talk to\nChern\n. His motives for being a Leipzig student yet living in Hamburg were not entirely mathematical, however, for he had fallen in love with Margot Victor from Hamburg and hoped to marry her. In\n1936\nhe was awarded a doctorate for his thesis\nDie geometrische Theorie der algebraischen Funktionen für beliebige vollkommene Körper\nⓉ\n(\nThe geometric theory of algebraic functions for arbitrary perfect fields\n)\n. Also in July\n1936\nhe married Margot Victor in Hamburg and the newly married couple went to China where Chow began teaching at the National Central University in Nanking in September of that year. His first paper, written jointly with\nvan der Waerden\n, was an important one. In\nZur algebraische geometry IX\n(\npublished in\nMathematische Annalen\nin\n1937)\nhe introduced the notion now known as Chow coordinates. In the same volume of\nMathematische Annalen\nhe published a paper with the same name as his doctoral thesis.\nIf Chow and his family had been in a difficult position in Germany, forced to leave by the racial policy of the Nazi regime, but he was soon in an equally bad position in Nanking. The Sino-Japanese War began with a minor clash between the troops of the two countries near Peking in July\n1937\n. Further fighting broke out and the Japanese soon captured Peking and Tientsin. In August there was savage fighting in Shanghai, but Chow decided that Shanghai was safer than Nanking so in September he escaped from Nanking to Shanghai\n(\nwhich was of course the city of his birth\n)\n. By the end of December the Japanese had captured both Nanking and Shanghai.\nDuring the next two or three years Chow was able to have some contacts with European mathematicians, in particular with\nvan der Waerden\n. Chow had published three further papers in\n1939\none of which was\nÜber Systeme von linearen partiellen Differentialgleichungen erster Ordnung\nⓉ\n(\nOn systems of linear partial differential equations of the first order\n)\nin which he extended results by\nCarathéodory\non Pfaffian systems. In\n1940\nhe published\nOn electric networks\nin the\nJournal of the Chinese Mathematical Society\nbut at this stage he found conditions in Shanghai so difficult that it became impossible for him to continue to study mathematics.\nChern\nwrites\n(\nsee the article\n[\n3\n]\nwhich is reprinted in\n[\n1\n]\n)\n:-\nWe next saw each other in\n1946\nin Shanghai after the war ended. In a decade of war years Wei-Liang had practically stopped his mathematical activities, and the question was whether it was advisable or even possible for him to come back to mathematics. His return to mathematics was most successful; I would consider it a miracle.\nThe 'miracle', of course, was partly due to\nChern\nfor without his help and encouragement it must rate as extremely unlikely that Chow would ever have even attempted to return to mathematics. Chow was admitted to the Institute for Advanced Studies in Princeton thanks to a letter from\nChern\nto\nLefschetz\nand he was a vistor at the Institute from March\n1947\n. He remained there until September\n1948\nwhen he joined the Mathematics Faculty of Johns Hopkins University in Baltimore, Maryland, having been recommended by\nvan der Waerden\n. Appointed first as an associate professor, he was promoted to full professor in\n1950\n. He remained at Johns Hopkins University until he retired in\n1977\n. He served as chairman of the Mathematics Department from\n1955\nto\n1965\n.\nLuca Barbieri Viale gives a beautiful survey of Chow's later mathematical achievements in a review of\n[\n1\n]\n:-\nChow's theorem that a compact analytic variety in a projective space is algebraic was published in\n1949\n. In\n1955\nChow proved the so-called \"Chow's moving lemma\" in algebraic geometry, providing an intersection theory for algebraic cycles based on ideas and results of\nSeveri\n, later also developed by\nvan der Waerden\n,\nHodge\nand\nPedoe\n. The original\n1956\nAnnals of Mathematics paper follows the general setting of\nWeil\n's Foundations. In this paper,\nSeveri\n's idea of intersection by moving cycles in a suitable equivalence class is proven to be appropriate for rational equivalence classes of cycles. Such equivalence classes make up the \"Chow ring\" of a nonsingular projective variety and provide the algebraic counterpart of the topological singular cohomology ring. The \"Chow ring\" is just as fundamental in algebraic geometry as its topological counterpart. Actually, wonderful developments of this analogy were included in\nGrothendieck\n's theory of motives, where algebraic cycles provide correspondences between algebraic varieties and their intersections provide their composition, yielding the category of \"Chow motives\". Notably, \"Chow motives\" are naturally included in\nVoevodsky\n's triangulated category of motives, showing the deepest roots of this analogy.\nIgusa, who was at Johns Hopkins University from\n1955\n, writes about Chow's leadership in\n[\n6\n]\n:-\nIt is a historical fact that this school of algebraic geometry\n[\nat Johns Hopkins University\n]\nwas 'created' by Chow. He was very open and free in expressing his ideas while they were still in a nebulous state. We often saw how many of those ideas evolved into beautiful theorems. We were attracted by his openness and impressed by his superb geometric intuition. Furthermore ... Chow founded this school without causing any financial strain to the university. I might add that Professor Chow's wife, Margot, also contributed to our social closeness at that time. We became almost like relatives - some of us even spent summers together with the Chows at China Lake, Maine.\nW S Wilson writes\n(\nsee\n[\n3\n]\n)\n:-\nIt was always a pleasure to see\n[\nChow\n]\n. He was fascinating to listen to about his personal history. He was a bouncy, cheery, fun person to be around.\nIn addition to his research and leadership of the algebraic geometry group, Chow played an important role as editor-in-chief of the\nAmerican Journal of Mathematics\nfrom\n1953\nto\n1977\n.\nFinally let us mention that among his hobbies was stamp collecting. He took an interest that went well beyond what one would describe as a hobby, being well known among professional stamp collectors and keeping his most valuable stamps in a safe at the bank. It was typical of Chow that every thing he did was at the highest level of expertise.",
  "matematicos_citados_na_biografia": [
    "van der Waerden",
    "algebraic geometry",
    "Severi",
    "Bertini",
    "Enriques",
    "Artin",
    "Chern",
    "Carathéodory",
    "Lefschetz",
    "Hodge",
    "Pedoe",
    "Weil",
    "Grothendieck",
    "Voevodsky"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}