{
  "nome_completo": "Werner Romberg",
  "nome_curto": "Werner Romberg",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Romberg/",
  "data_nascimento": "16 May 1909",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "5 February 2003",
  "local_morte": "Heidelberg, Germany",
  "summary": "Werner Romberg was a German mathematician and physicist. He worked in numerical analysis.",
  "biografia": "Werner Romberg\n's father, Julius Romberg, was a geologist. Werner was brought up in Berlin where he attended school. He entered the University of Heidelberg in\n1928\nwhere he studied mathematics and physical science. His science lecturers included the chemist Karl Johann Freudenberg\n(1886\n-\n1983)\n, and the physicist Philipp Lénárd\n(1862\n-\n1947)\nwhose main contributions were on cathode rays. Lénárd was a Nazi whose political views were abhorrent to Romberg. His mathematics professors at Heidelberg included the geometer Heinrich Liebmann\n(1874\n-\n1939)\nand Arthur Rosenthal\n(1887\n-\n1959)\n. Both Liebmann and Rosenthal were Jewish and both lost their positions when the Nazis came to power. It was standard practice for German students at this time to study at several different universities and, after two years at Heidelberg, Romberg moved to Munich in\n1930\nwhere he continued his studies. His physics teachers in Munich included\nArnold Sommerfeld\nand Walther Gerlach who was the ordinary professor being a successor to Wilhelm Wein. Gerlach discovered the spin quantisation in a magnetic field. Romberg's mathematics lecturers at Munich included\nConstantin Carathéodory\nand\nOskar Perron\n.\nWhile he was at Heidelberg, he had to make a choice between mathematics and physics. He said:-\nDespite the recommendation of Professor Liebmann, that I should stay with the mathematics, I chose physics as my major. I wanted not only to know that the theoretical considerations were consistent, but also to investigate their relation to the real world.\nHe began undertaking research in Munich advised by\nSommerfeld\nwho was particularly pleased to have a young student who was showing such expertise both in mathematics and physics. However, in the early\n1930\ns the Nazi party was gaining ground and Romberg, who had staunch left-wing views, was bitterly opposed to them. He had seen the dangers which the Nazis posed very early in their campaign for power and was very public in his opposition to them. He joined the Socialist Workers Party which had split off from the Social Democratic Party in the autumn of\n1932\n. The left-wing of the Social Democratic Party had been unhappy with the way the leaders were running the party and formed their own organisation which was joined by some disaffected members of the German Communist Party. Romberg wrote\n[\n3\n]\n:-\nI was close to the Socialist Workers Party as it supported the joint fight of the Social Democratic Party and the German Communist Party against the Nazis. We were about\n10\nto\n20\nstudents and therefore known to the Nazis. In\n1932\nSommerfeld\nformulated a prize competition for the University of Munich and suggested that I should participate. I submitted the solution and received the following response: \"The assignment was completely solved by the sender. However, since the sender lacks the necessary maturity of mind, the prize cannot be awarded.\"\nSommerfeld\nsuggested I submit it as a Ph.D. thesis and urged me to hurry. Accordingly I was able to pass the examination with magna cum laude in the summer of\n1933\n.\nSommerfeld\nhad heard about requests for theoretical physicists from the USSR. By was of curing me of my leftist illusions, he recommended me.\nLet us note that Romberg's doctoral thesis was\nPolarisation des Kanalstrahllichtes\nⓉ\n(\nOn the polarization of the channel light beam\n)\n. The position in the USSR referred to in the above quote was in Dnipropetrovsk in Ukraine. The Soviet regime had made a small change to the spelling of the city and, at the time that Romberg went there, it was known as Dnepropetrovsk. It is a large industrial city in south central Ukraine on the Dnieper river. Romberg took up his appointment as a theoretical physicist in the Department of Physics and Technology there in\n1934\n. Joseph Stalin, the Russian dictator, began his purges in\n1935\n. Although mainly aimed at eliminating rivals, these purges also applied to foreigners who were distrusted. Romberg, as a German citizen, had his right to stay in the Soviet Union ended in\n1937\nand so he had to leave his position in Dnepropetrovsk. He travelled through Warsaw to Prague, where he had relatives whom he could live with and, in order to make enough money to live, he worked as a private tutor. He also made contact with staff at the Institute of Astrophysics of the Charles University of Prague. With hindsight, however, it is clear that Prague was not a good choice for Romberg.\nIn March\n1938\nAdolf Hitler absorbed Austria which became a part of Germany. He then turned his attention towards Czechoslovakia and, by May\n1938\n, he was known to have plans to invade that country. The Munich Agreement signed on\n30\nSeptember\n1938\nallowed Hitler to annex the western part of Czechoslovakia. Romberg knew he had to escape and he was fortunate to have the necessary contacts in Prague to help him get in touch with Egil Andersen Hylleraas\n(1898\n-\n1965)\nin Oslo. Hylleraas had worked in Bergen before being appointed as Professor of Theoretical Physics in Oslo in\n1937\n. Romberg offered to work as Hylleraas's assistant and Hylleraas managed to obtain money from the Brogger Committee to enable Romberg to leave Prague and travel to Olso. However, getting out of Czechoslovakia was not easy at this stage as the German military were checking everyone leaving at the border posts. His only solution was to fly from Prague and so avoid the German checks. He flew from Prague to Oslo on\n20\nNovember\n1938\nand indeed worked as Hylleraas's assistant. Together they wrote\nÜber die Schwingungen eines stabil geschichteten, durch Meridiane begrenzten Meeres. II. Berechnung der Eigenfrequenzen\nⓉ\n(\nOn the vibrations of a stably stratified, limited by meridians sea. II. Calculation of natural frequencies\n)\nwhich continued a study already begun by Hylleraas. In this work they investigated the hydrodynamical equations for an ideal incompressible fluid on a rotating sphere which is subjected to the influence of tidal forces. The paper was published in\n1941\n.\nHylleraas was not the only person in Oslo with whom Romberg worked. The authors of\n[\n1\n]\nwrite:-\nHe also worked for a short period with Johan Holtsmark\n(1894\n-\n1975)\n, who built a Van de Graaff generator\n(\nthe second one in Europe and the first particle accelerator in Scandinavia\n)\nfor nuclear disintegration between\n1933\nand\n1937\nat the Norwegian Institute of Technology in Trondheim.\nHowever, Romberg was not safe in Oslo for, on\n9\nApril\n1940\n, German troops invaded Norway and soon occupied Oslo. Romberg, always one step ahead of the German advance, had already left Oslo and crossed the border into Sweden.\nRomberg lived in Uppsala from\n1940\nto\n1944\n. Of course, the Nazis were not too pleased that Romberg was managing to keep out of their clutches. In\n1941\nthe German Reich stripped Romberg of his German citizenship and in\n1943\nthey revoked his doctorate. Late in\n1944\n, when Oslo had been liberated from the Germans, Romberg was able to return there and once again take up his former position as Hylleraas's assistant. He became a Norwegian citizen in\n1947\n. While in Oslo, he worked on the differential analyser. He also studied numerical methods, publishing\nApproximation eines Kurvenstückes durch wenige sin-Funktionen\nⓉ\n(\nApproximation of a short curved arc by  sine functions\n)\nin\n1949\n. In this paper he gives an algorithm to determine an approximation to an experimentally determined function. The method involves successive approximations based on a least square technique.\nHarald Wergeland\n(1912\n-\n1987)\nhad been appointed as professor of physics at the Norwegian Institute of Technology in Trondheim in\n1946\n. He was a friend of Romberg's and well acquainted with his abilities. He encouraged Romberg to apply for the position of dosent in physics at the Norwegian Institute of Technology in Trondheim. This national technology college had been established in\n1900\nalthough it had taken several years before the decision to site it at Trondheim rather than Oslo was accepted. Romberg was appointed as a dosent, which was essentially an assistant lectureship, and left Oslo in\n1949\n. It was while he was in this post at Trondheim that Romberg made his most important contribution when he published the paper\nVereinfachte Numerische Integration\nⓉ\n(\nSimplified numerical integration\n)\nin\n1955\n. This paper contains what today is known as Romberg integration and we now look briefly at this method.\nRomberg's aim with this paper was to increase the speed of convergence of the trapezium rule, a standard numerical integration method. He was not the first to have this aim for\nLewis Fry Richardson\n, in\n1927\n, had introduced a special case of what today is called\nRichardson\nextrapolation. However, the basic ideas involved here go back much further than this, for\nColin Maclaurin\nhad used similar ideas in\n1742\nand even before this\nChristiaan Huygens\nhad already basically used\nRichardson\nextrapolation in his methods to calculate π in\nDe Circuli Magnitudine Inventa\nⓉ\n(\nFinding the magnitude of the circle\n)\nin\n1654\n. In fact, rather remarkably,\nHuygens\n' approximations are better than what would be achieved by\nRichardson\nextrapolation. However, in\n[\n12\n]\nOle Osterby suggests that although\nRichardson\ngave what:-\n... is exactly the same operation which\nHuygens\nperforms but he does it out of a different motivation, namely that of summing a geometric series. I therefore think it is fair to say that Huygens did not invent\nRichardson\nextrapolation although one could easily be led to believe so from looking at the calculations.\nBut the ideas involved here go back much further than this, for\nArchimedes\nwas employing similar techniques in his calculations of π and square roots such as √\n3\n(\nsee\n[\n11\n]\nand\n[\n12\n]\n)\n. What Romberg achieved was a systematic approach to applying extrapolation to the trapezium rule, by successively halving the step size in order to attain higher and higher accuracy. He claimed that similar accuracy could be obtained as other methods with less computational work and illustrated this with numerical examples. Claude Brezinski and Luc Wuytack write in\n[\n4\n]\n:-\nThis method can now be found in every textbook on numerical analysis without any reference to Romberg's original paper, a proof of true fame.  Besides its usefulness, Romberg's method also showed to non-specialists that convergence acceleration methods can be quite powerful. Thus, it had an important impact on the development of this domain of numerical analysis.\nIn\n1963\nJean-Pierre Laurent published a rigorous analysis of Romberg integration and after that the method became widely known and widely used.\nLet us return to give some further details of Romberg's career. Loa Nordal writes in\n[\n10\n]\n:-\nFor some time Romberg was a candidate for the position as director of the Norwegian Computing Centre. He also knew\nKonrad Zuse\nand his machines, and he had written vividly about them in the popular science journal 'Fra fysikkens verden'. Nevertheless, Romberg lacked the political strength and skills needed to realise a pioneering project in Trondheim, and none of his attempts got any support from the funding authorities.\nIn\n1960\nthe Norwegian Institute of Technology established a chair in applied mathematics with the idea that this would boost their position with computers. Romberg was offered the chair which he was happy to accept\n[\n13\n]\n:-\nIn his new position, Romberg gave courses in many areas of applied mathematics, and he established the field of numerical analysis at the Norwegian Institute of Technology.\nThe first course in the Norwegian Institute of Technology curriculum that was devoted to digital computing was Romberg's 'Numerical Methods I and II' from\n1962\n-\n63\n. The course had, from\n1957\n, been a part of the auxiliary education in mathematics. Romberg had then given a short introduction to mechanical and electrical computers, without going into detail on how to program or use them. As an example of his research at this time we mention the paper\nEine Lösungsmethode für Eigenwertprobleme\nⓉ\n(\nA method for solving eigenvalue problems\n)\n(1965)\nwritten jointly with Jan Ole Aasen. The authors give the following summary of this paper:-\nAnalytical eigenvalue problems are usually replaced by finite-dimensional algebraic eigenvalue problems. An iteration scheme related to Sturm sequences for solving such problems is presented. It is also indicated how the method may reduce the labour for obtaining solutions of the analytical eigenvalue problem.\nIn\n1968\n, Romberg returned to Germany when he was appointed to the chair of Mathematical Methods in Science and Numerical Analysis at the University of Heidelberg. He was also the scientific head of the Computer Centre at Heidelberg from its founding in\n1969\nto\n1975\n. Peter Sandner wrote:-\nHe was an open and straightforward man ... and above all a kind and humble person. ... It is because of these characteristics that Werner Romberg was my role model and always will be. This view I share with all the Computer Centre staff who had the opportunity to get to know him personally in the early years of the Computer Centre on the Friedrich-Ebert-Platz.\nRomberg retired in\n1978\nwhen he was\n69\nyears old. He was to enjoy a long retirement. In December\n1988\n, when he was nearly eighty years old, the\nRomberg Seminar on Quadrature, Interpolation, Extrapolation and Rational Approximations\nwas held at the University of Trondheim in his honour\n[\n6\n]\n:-\n... this seminar was given his name to honour him for his services to our country\n[\nNorway\n]\nand our institution in the fields of applied mathematics, numerical analysis and digital computations. The seminar was, a small one with\n11\nparticipants, based on invitations, each invited person was asked to give a lecture. In particular, Professor Romberg was asked to give an informal talk on the introduction of digital computers in Norway.\nAfter his death in February\n2003\n, Willi Jäger wrote:-\nOn\n20\nFebruary Professor Dr Werner Romberg's family, his colleagues and friends, the University of Heidelberg and the Faculty of Mathematics and Computer Science bade farewell to Romberg, who died at the age of almost\n94\nyears after a full life. Werner Romberg was an outstanding scientist with a high international reputation. His life was shaped by science and his work as a university teacher, but also by his resistance against Nazism and his commitment to peace and democracy.",
  "matematicos_citados_na_biografia": [
    "Arnold Sommerfeld",
    "Constantin Carathéodory",
    "Oskar Perron",
    "Sommerfeld",
    "Lewis Fry Richardson",
    "Richardson",
    "Colin Maclaurin",
    "Christiaan Huygens",
    "Huygens",
    "Archimedes",
    "Konrad Zuse"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}