{
  "nome_completo": "Wilhelm Ljunggren",
  "nome_curto": "Wilhelm Ljunggren",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ljunggren/",
  "data_nascimento": "7 October 1905",
  "local_nascimento": "Oslo, Norway",
  "data_morte": "25 January 1973",
  "local_morte": "Oslo, Norway",
  "summary": "Wilhelm Ljunggren was a Norwegian mathematician who specialised in number theory.",
  "biografia": "Wilhelm Ljunggren\n's mother was Louise Johansen and his father was August Ljunggren who was a wheelwright. August himself had been born in Sweden into a Swedish family but had taken up permanent residence in Norway. Wilhelm attended secondary school in Oslo, graduating in\n1925\n. Already at secondary school he had a passion for mathematics and he was an avid reader of the\nNorwegian Mathematical Journal\n.\n(\nNorsk Matematisk Tidsskrift\n)\n. The journal presented a collection of problems and each year the Crown Prince Olav Prize was given to the pupil who gave the best solutions to these problems. Ljunggren won the prize in his final year at secondary school.\nHe then entered the University of Oslo, but already he had become interested in number theory through reading papers in the\nNorwegian Mathematical Journal\n. Papers such as\nFermat's problem\nby\nØystein Ore\nand\nOn the indeterminate equation\nx\n2\n−\nD\ny\n2\n=\n1\nx^{2} - Dy^{2} = 1\nx\n2\n−\nD\ny\n2\n=\n1\nby Trygve Nagell were in the issue which contained the problems that he solved to win his prize and, through studying these and other papers, he was already interested in number theory before beginning his university course. Ljunggren graduated in\n1931\nand\nThoralf Skolem\n, who was a student of\nAxel Thue\n, had advised him during the research for his Master's thesis. Skolem moved to the Christian Michelsen's Institute in Bergen as a Research Associate in\n1930\nand so Ljunggren, who wished to keep in contact with\nSkolem\n, accepted a position as a secondary school teacher in Bergen.\nLjunggren undertook research in number theory during the years he taught at the secondary school in Bergen and he submitted his doctoral thesis to the University of Oslo in\n1937\n.\nSkolem\nworked in Bergen until\n1938\nwhen he returned to Oslo as Professor of Mathematics at the university. Ljunggren followed\nSkolem\nto Oslo, for in\n1938\nhe became a teacher at the Hegedehaugen School. He held this position for ten years before, in\n1948\n, he was appointed as an extraordinary professor at the University of Oslo. The University of Bergen was founded in\n1946\nand, three years later, Ljunggren was appointed as professor of mathematics there. In\n1950\nhe married Else Margrethe Aas.\nAlthough Ljunggren quickly built up a strong teaching department in Bergen he took the opportunity to return to Oslo in\n1956\nwhen he was offered the chair of mathematics there. By this time\nSkolem\nwas retiring and Ljunggren took over the responsibilities of keeping Oslo as a leading institution for mathematics. He did not devote himself completely to his position at the university, however, for he had a friend Georg Schou who was trying to make a strong Technical Institute in Oslo. Ljunggren taught part-time at the Technical Institute to help his friend build its reputation.\nAlmost all of Ljunggren's research was on\nDiophantine equations\n. For example in\nA note on simultaneous Pell equations\n(1941)\nLjunggren studied the simultaneous\nPell\nequations\nx\n2\n−\nD\ny\n2\n=\n1\nx^{2} - Dy^{2} =1\nx\n2\n−\nD\ny\n2\n=\n1\nand\ny\n2\n−\nD\n1\nz\n2\n=\n1\ny^{2} - D_{1}z^{2} = 1\ny\n2\n−\nD\n1\n​\nz\n2\n=\n1\n.\nHe proved that there is only a finite number of solutions and that it is possible to determine an upper limit for this number; in the special case\nD\n=\n2\n,\nD\n1\n=\n3\nD = 2, D_{1} = 3\nD\n=\n2\n,\nD\n1\n​\n=\n3\nhe showed that the only solution is\nx\n=\n3\n,\ny\n=\n2\n,\nz\n=\n1\nx = 3, y = 2, z = 1\nx\n=\n3\n,\ny\n=\n2\n,\nz\n=\n1\n.\nOne of Ljunggren's main interests was Diophantine equations of degree\n4\n. In\n1942\nin the paper\nSätze über unbestimmte Gleichungen\nⓉ\n(\nTheorems on indeterminate equations\n)\nhe made considerable progress on problems posed by\nMordell\n. In\n1923\nMordell\nshowed that the Diophantine equation\nA\nx\n4\n+\nB\nx\n2\n+\nC\n=\nD\ny\n2\nAx^{4} + Bx^{2} + C = Dy^{2}\nA\nx\n4\n+\nB\nx\n2\n+\nC\n=\nD\ny\n2\n,\nwhere the left-hand side has no squared factor in\nx\nx\nx\n, has only a finite number of solutions. However\nMordell\ndid not find the solution, nor was he able to find bounds on the finite number of solutions. In the paper Ljunggren found bounds for the number of integer solutions for some special equations of this type.\nTwo other papers which he published in\n1942\nare\nÜber die Gleichung\nx\n4\n−\nD\ny\n2\n=\n1\nx^{4} - Dy^{2} = 1\nx\n4\n−\nD\ny\n2\n=\n1\nⓉ\n(\nAbout the equation x\n4\n- Dy\n2\n=\n1\n)\nand\nZur Theorie der Gleichung\nx\n2\n+\n1\n=\nD\ny\n4\nx^{2} +1 = Dy^{4}\nx\n2\n+\n1\n=\nD\ny\n4\nⓉ\n(\nOn the theory of the equation x\n2\n+\n1\n= Dy\n4\n)\n. In the first of these he proves that the equation in question has at most two positive integer solutions and gives an example of\nD\n=\n1785\nD = 1785\nD\n=\n1\n7\n8\n5\nwhich does indeed have two solutions, namely\nx\n=\n13\n,\ny\n=\n4\nx = 13, y = 4\nx\n=\n1\n3\n,\ny\n=\n4\nand\nx\n=\n239\n,\ny\n=\n1352\nx = 239, y = 1352\nx\n=\n2\n3\n9\n,\ny\n=\n1\n3\n5\n2\n. In the second of the two papers he proves that, under certain conditions on\nD\nD\nD\n, there are again at most two positive integer solutions.\nHere is one further example of the results obtained by Ljunggren. He proved that the equation\nx\n2\n−\nD\ny\n2\nn\n=\n1\nx^{2} - Dy^{2n} = 1\nx\n2\n−\nD\ny\n2\nn\n=\n1\nwhere\nD\n+\n1\nD + 1\nD\n+\n1\nis not a square has at most two solutions if\nn\n≠\n2\nn ≠ 2\nn\n\n​\n=\n2\n, and if there are two solutions, these will be determined by the fundamental unit of the domain\nZ\n[\n√\nD\n]\n\\mathbb{Z}[√D]\nZ\n[\n√\nD\n]\nand its second or fourth power. For\nn\nn\nn\n=\n2\nand\n3\nthe result holds without condition on\nD\nD\nD\n. In general, if\nD\n+\n1\n=\nu\n2\nD + 1 = u^{2}\nD\n+\n1\n=\nu\n2\nit holds for\nD\nD\nD\nsufficiently large depending only on\nn\nn\nn\n. The\nn\n=\n2\nn = 2\nn\n=\n2\nresult had been previously proved by Nagell.\nRibenboim\nwrites\n[\n3\n]\n:-\n[\nLjunggren\n]\nwas also a very gifted problem solver, contributing many original solutions to problems posed by his peers. On the other hand, Ljunggren submitted also many problems, addressed to university students as well as high-school pupils.\nSelberg\nwrites\n[\n2\n]\n:-\nWilhelm Ljunggren was an outstanding teacher at every level. He asked much of his pupils, but even more of himself. I have been told that when a school teacher, he prepared extra problems which the better pupils could try to do. He also stimulated them to further studies by helping with literature and giving advice. ... Personally I had the pleasure of collaborating with Professor Ljunggren for\n25\nyears, mainly in connection with exam work. His willingness to help when we needed him, his calm and dignified manner, as well as his gentle humour, were qualities making a person one had to get fond of.",
  "matematicos_citados_na_biografia": [
    "Øystein Ore",
    "Thoralf Skolem",
    "Axel Thue",
    "Skolem",
    "Diophantine equations",
    "Pell",
    "Mordell",
    "Ribenboim",
    "Selberg"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}