{
  "nome_completo": "Wilhelm Eduard Weber",
  "nome_curto": "Wilhelm Weber",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weber/",
  "data_nascimento": "4 October 1804",
  "local_nascimento": "Wittenberg, Saxony (now Germany)",
  "data_morte": "23 June 1891",
  "local_morte": "Göttingen, Germany",
  "summary": "Wilhelm Weber was a German physicist who did important work on electricity. He collaborated with Gauss.",
  "biografia": "Wilhelm Weber\n's father was Michael Weber who was professor of theology at the University of Wittenberg from\n1789\nto\n1814\n. Michael Weber and his wife had thirteen children but only four brothers and a sister lived to an advanced age. The oldest of the brothers became a minister in the church while the other three brothers all became scientists. Of the three scientist brothers, Ernst Heinrich Weber\n(\nborn\n24\nJune\n1795)\nwas the eldest, Wilhelm Eduard Weber the subject of this biography was the next, and Eduard Friedrich Weber\n(\nborn\n1806)\nwas the youngest. The family lived in the house of Christian August Langguth, the professor of medicine and natural history in Wittenberg, on the Schlossstrasse. A fellow lodger in the house was Ernst Florens Friedrich Chladni, a physicist famed for his work on sound and vibrations. He gave the brothers a deep interest in physics.\nNapoleon, at the height of his power in\n1806\n, conquered Saxony and made it a kingdom. People in Saxony in general, and Wittenberg in particular, became a staunch supporters of Napoleon. The French, fearing attack by the Prussians, strengthened Wittenberg's fortifications in\n1813\n. However the Prussians did attack and as a result Langguth's house was destroyed. The Weber family left Wittenberg in\n1814\nafter the city fell to the Prussians and the university was closed. They moved to Halle where Michael Weber became professor of theology. The University of Wittenberg and the University of Halle were formally merged in\n1817\n. Wilhelm had been educated at home by his father while they lived in Wittenberg but after they moved to Halle he was sent to the\nGymnasium\nthere. In\n1821\nWilhelm Weber was seventeen years old and studying at the Francke Institute preparing to enter the University of Halle. His brother Ernst was at this time twenty-six years old and undertaking research in physiology as a professor at the University of Leipzig, but Wilhelm was advanced enough to be able to cooperate with his brother. They made a thorough study of the flow of liquids when they carried out experiments investigating water and sound waves. Ernst's research involved the mechanics of circulation, so he was interested in the mechanical properties of arteries. This led the brothers to experiment with fluid flow in elastic tubes. They produced a joint publication of a\n575\n-page monograph\nWellenlehre auf Experimente gegründet\nⓉ\n(\nWave theory based on experiments\n)\n(1825)\nwhich formulated the basic laws of hydrodynamics. The two brothers dedicated the work to Chladni who had taught them physics when they were children. Dolbear explains the significance of this important treatise\n[\n11\n]\n:-\nOne of the discoveries first made known here was that the particles on the surface of a liquid when there is an advancing wave, all revolve in vertical circles in the plane of the direction of propagation of the wave, while the particles lower down move in ellipses whose vertical axis becomes smaller and smaller as the particles are deeper.\nWilhelm Weber entered the University of Halle in\n1822\nwhere he was taught and strongly influenced by the physicist Johann S C Schweigger and the mathematician\nJohann Friedrich Pfaff\n. He wrote his doctoral dissertation under Schweigger's supervision on the theory of reed organ pipes and submitted it to Halle in\n1826\n. After that he taught at Halle from\n1827\nafter completing his\nhabilitation\nthesis on reed organ pipes as coupled oscillators with acoustic coupling of tongue and air cavity. He published a series of papers on this topic between\n1828\nand\n1830\nin\nAnnalen der Physik und Chemie\n[\n1\n]\n:-\nOne of the subjects treated was the use of this coupling to maintain constancy of pitch of a pipe under different intensities of blowing, and the possibility that this might provide an improved standard of pitch.\nHis promotion was rapid for after his appointment as a\nPrivatdozent\nin\n1827\nhe became an Extraordinary Professor of natural philosophy at Halle in the following year. In fact\n1828\nwas quite a significant year for Weber for in September of that year he and his brother Ernst travelled to Berlin to attend the\n7\nth\nmeeting of the Gesellschaft Deutscher Naturforscher und Arzte. The meeting was organised by Alexander von Humboldt who was very impressed with the talk Weber gave on organ pipes. Equally important was the fact that\nCarl Friedrich Gauss\nalso attended Weber's lecture and immediately saw the tremendous potential displayed by the young physicist. At this time\nGauss\nwas interested in geomagnetism and he realised that Weber would make an outstanding co-worker. He spoke to Weber and asked if he would be interested in taking a position in Göttingen if one were to become available. Indeed after the death of Tobias Mayer Jr, Weber was offered a professorship in physics at Göttingen in April\n1831\nwhich he immediately accepted. There followed six years of close friendship and collaboration between Weber and\nGauss\n. He soon gained an excellent reputation as a lecturer, illustrating his lectures with experiments. He felt, however, that students could only learn by doing experiments, not simply by watching them carried out, and he opened the physical laboratory at Göttingen for student use.\nIn\n1832\nWeber and\nGauss\npublished a joint paper which introduced absolute units of measurement of magnetism for the first time. Before this major advance, measurements were made with a pre-calibrated magnetic instrument and were not properly reproducible. This represented an important step forward in the development of magnetism. Weber made major contributions to this work, particularly by developing sensitive magnetometers and other magnetic instruments. Equally important was Weber's later work extending these ideas on magnetic measurements to electrical measurements which we mention again below. This work led to\nMaxwell\n's introduction of some aspects of Weber's distant-action theory into his field theory of electricity and magnetism, see\n[\n10\n]\n. Another joint venture by Weber and\nGauss\nof fundamental importance was their founding of the Göttingen Magnetische Verein in\n1833\n. In\n[\n7\n]\nthe\nGauss\n-Weber telegraph design is discussed. This telegraph was a battery operated line\n3000\nmetres long connecting the Physical Laboratory and the Astronomical Observatory at Göttingen, allowing simultaneous magnetic observations at the two sites.\nGauss\nand Weber jointly published\nAtlas Des Erdmagnetismus: Nach Den Elementen Der Theorie Entworfen\nⓉ\n(\nAtlas of geomagnetism: From the observatioins\n)\nin\n1840\nwhich contains magnetic maps constructed using a network of magnetic observatories which they had organized from\n1836\nonwards to correlate measurements of terrestrial magnetism around the world.\nNot all Weber's work during this time was with\nGauss\n, for he also collaborated with his younger brother Eduard, an anatomist and physiologist, who was interested in the physics of human locomotion, particularly the mechanism of walking. They published the joint work\nMechanik der menschlichen Gehwerkzenge\nⓉ\n(\nMechanics of human movement\n)\nin\n1836\n. Weber also published several important papers on acoustics during these years.\nPolitical events had already had a major impact on Weber's life when as a boy his family had to leave Wittenberg. After six highly productive years at Göttingen, events again conspired to alter the direction of his life. To understand these events we need to look briefly at the history of Hanover which had come under British influence after the fall of Napoleon in\n1814\n. George IV imposed a constitution on Hanover in\n1819\nwhich meant it was dominated by its nobles. An uprising in\n1830\n, shortly before Weber moved to Göttingen, led to William IV introducing a much more liberal and acceptable constitution in\n1833\n. However, William IV died in June\n1837\nand Hanover separated from Britain with Victoria becoming Queen of Britain while her uncle Ernest Augustus became King of Hanover. As King he repealed the constitution of\n1833\n, which he considered far too liberal. Two weeks after this act by the King, seven professors from Göttingen sent a protest letter to the King explaining that the oath they had taken as professors bound them to the\n1833\nconstitution. Weber was one of the \"Göttingen Seven\" who signed the protest and among the others were the brothers Jacob and Wilhelm Grimm, the authors of 'Grimm's Fairy Tales'. As explained in Encyclopaedia Britannica:-\nThrough their part in this protest directed against despotic authority,\n[\nthe Göttingen Seven\n]\nclearly demonstrated the academic's sense of civil responsibilities, manifesting their own liberal convictions at the same time.\nAll seven professors were dismissed while three of them were ordered to leave the kingdom of Hanover. Weber, although dismissed, was not forced to leave Göttingen and he continued to work at the Göttingen Magnetische Verein without holdig any university position.\nGauss\nand von Humboldt appealed to the King to reinstate Weber and the King agreed to do so provided Weber make a public retraction of the views expressed in the letter of protest. Weber, however, was a man of strong principles and he was certainly not prepared to make a public statement which went totally against his views so he refused to make the required public retraction. He remained at Göttingen without a position until\n1843\nbut he did take the opportunity to travel between March and August\n1838\n. He first visited Berlin before travelling on to London, where he enjoyed useful conversations many English scientists including\nJohn Herschel\n, and finally to Paris where he met most of the leading French scientists. In\n1843\nhe became professor of physics at Leipzig joining his brothers Ernst and Eduard who were both professors at the University. He was appointed to fill G T Fechner's chair at Leipzig after Fechner had to take retirement due to blindness. At Leipzig, Weber continued the work on\nAmpère\n's law of electrical force which he had been undertaking in Göttingen from\n1832\nonwards. He published\nElektrodynamische Massenbestimmungen\nⓉ\n(\nElectrodynamic mass determinations\n)\nin\n1846\n[\n1\n]\n:-\nWeber's greatest theoretical contributions appeared in the 'Elektrodynamische Massenbestimmungen'\nⓉ\n(\nElectrodynamic mass determinations\n)\n, seven long works published from\n1846\nto\n1878\n, besides a manuscript published posthumously. In the first of these, Weber introduced his dynamometer to test\nAmpère\n's law of force between electric current elements, to a degree of precision exceeding\nAmpère\n's, and also investigated electromagnetic induction.\nDolbear writes\n[11\n]\n:-\nUntil Weber's work there had been no such thing as electrical measurements. There had been nothing more than comparisons between magnitudes of the same kind. Weber showed how an electrical quantity could be stated in terms of the unit of time, length, and mass, without any reference to other electrical phenomena, and this was a new and great achievement. The\nBritish Association\nCommittee on Electrical Standards adopted Weber's work as a basis for their standards of units. Secondly, he was one of the first to feel the necessity for an adequate mechanical conception of electro-magnetic phenomena, and he worked out in a mathematical way, and gave consistency to the idea of molecular magnets, that is, that every molecule of iron is a magnet by constitution, and the various phenomena of the magnetic field are due to the relative positions of these molecules.\nD'Agostino writes\n[\n10\n]\n:-\nGauss\nand Weber's systematic assignment of absolute units, overshadowed by our four-unit systems, allowed the nineteenth-century analytic formulation of physical laws\n(\na fundamental requisite for theoretical predictions\n)\n...\nIn fact what Weber achieved was a bringing together of three laws, namely that describing the interactions of two electric charges at rest,\nAmpère\n's law for moving electric currents, and the law describing electrical induction.\nIn\n1848\na series of republican revolts against European monarchies spread through France, Germany, Italy, and the Austrian Empire. Ernest Augustus's reign was already a stormy one with trouble between the King and his people and the\n1848\nrevolt forced him to grant Hanover a new much more liberal constitution. The door was thus opened for Weber to return to Göttingen but his position had already been filled by\nJohann Benedict Listing\nin\n1839\ndespite the fact that he had never published a paper. Weber insisted that\nListing\nshould keep the chair so he returned to Göttingen in\n1849\nas the Director of the Astronomical Observatory. By this time\nGauss\nwas over seventy years of age and rather too old for the two scientists to restart the remarkably fruitful collaboration which had begun nearly twenty years earlier.\nGauss\ndied in\n1855\n, and shortly before this Weber began a collaboration with Rudolph Hermann Arndt Kohlrausch who was then at Marburg. Their work on the ratio between the electrodynamic and electrostatic units of charge, published in\n1856\n, proved extremely important and was crucial to\nMaxwell\nin his electromagnetic theory of light. Weber found the ratio was\n3.1074\n×\n1\n0\n8\n3.1074 \\times  10^{8}\n3\n.\n1\n0\n7\n4\n×\n1\n0\n8\nm/sec but failed to take any notice of the fact that this was close to the speed of light. In fact the first use of \"c\" for the speed of light appears in this paper.\nBernhard Riemann\n, who spent eighteen months as Weber's assistant, was present when the experiments were carried out and he did make the connection between light and both electrodynamic and electromagnetic phenomena.\nWeber's later years at Göttingen were devoted to work in electrodynamics and the electrical structure of matter. He was described by\nThomas Hirst\n, who visited Göttingen in the\n1850\ns, in the following way:-\nHe speaks and stutters on unceasingly, one has nothing to do but listen. Sometimes he laughs for no earthly reason, and one feels sorry at being not able to join him.\nWoodruff describes Weber as\n[\n1\n]\n:-\n... friendly, modest and unsophisticated.\nWeber never married but his sister often helped manage his household and, in later years, his niece carried out this task. His pleasures outside of his academic work included hiking and he loved to walk for long distances. He died peacefully in the garden of his home in Göttingen having outlived both his scientist brothers, the elder by\n13\nyears and the younger by\n20\nyears. He is buried in the same cemetery as two famous physicists\nMax Planck\nand\nMax Born\n.\nFor his outstanding achievements Weber received many honours. He was elected to the\nRoyal Society\nof London in\n1850\nand awarded their Copley Medal in\n1859\n. He was elected an honorary fellow of the\nRoyal Society of Edinburgh\non\n2\nMarch\n1874\n. He was also elected to the\nAmerican Academy of Arts and Sciences\n. In\n1879\nhe was awarded the Matteucci Medal by the Italian Society of Sciences. In\n1935\nthe unit of magnetic flux was named the weber in his honour. Actually this is not quite as straightforward as it might at first appear. The unit of electric current is known as the ampere, the term becoming accepted after being proposed by\nHelmholtz\nin\n1881\n. In fact around that time the term weber was quite widely used for the unit of electric current but\nHelmholtz\nhad been in a number of disputes with Weber so he was keen to not have such an important unit named after someone with whom he frequently disagreed. In particular\nHelmholtz\nand Weber held different ideas about the nature of the mass of electric corpuscles; see for example\n[\n9\n]\n. In fact A E Woodruff, in a review of\n[\n6\n]\n, writes:-\nIt is the concept of electrical atomicity, as developed by Weber and elaborated by his followers, which represents his chief conceptual contribution to the growth of physics.\nWriting in\n[\n1\n]\n, Woodruff expresses these views in the following way:-\nAlthough he was perhaps most widely known during his life for his law of force, which was discarded with the triumph of\nMaxwell\n's field theory. Weber left his more lasting impression on physical theory with his atomistic conception of electrical charge and his vision of the role of such charges in determining the electrical, magnetic and thermal properties of matter.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Johann Friedrich Pfaff",
    "habilitation",
    "Privatdozent",
    "Carl Friedrich Gauss",
    "Gauss",
    "Maxwell",
    "John Herschel",
    "Ampère",
    "British Association",
    "Johann Benedict Listing",
    "Listing",
    "Bernhard Riemann",
    "Thomas Hirst",
    "Max Planck",
    "Max Born",
    "Royal Society",
    "Royal Society of Edinburgh",
    "American Academy of Arts and Sciences",
    "Helmholtz"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}