{
  "nome_completo": "Wilhelm Wirtinger",
  "nome_curto": "Wilhelm Wirtinger",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wirtinger/",
  "data_nascimento": "15 July 1865",
  "local_nascimento": "Ybbs an der Donau, Melk, Niederösterreich, Austria",
  "data_morte": "15 January 1945",
  "local_morte": "Ybbs an der Donau, Melk, Niederösterreich, Austria",
  "summary": "Wilhelm Wirtinger was an Austrian mathematician who worked in complex analysis, geometry, algebra, number theory, Lie groups and knot theory.",
  "biografia": "Wilhelm Wirtinger\nwas born in Ybbs, a town on the Danube about half way between Vienna and Linz. His father, Dr Johannes Wirtinger, was a senior consultant medical doctor. In fact Johannes Wirtinger was an outstanding scientist and medical researcher who made significant discoveries concerning typhus. Wilhelm spent his childhood in Ybbs an der Donau and he always held a great affection for his birthplace. In fact, he was so fond of the town that after he retired he returned to live there. When he was eight years old he contracted scarlet fever and diphtheria, a very rare and dangerous combination. He recovered from the illness but it left its mark in that he was left with a permanent deafness which made his life extremely difficult. He attended the Benedictine\nGymnasium\nin Seitenstetten. He moved to the Benedictine Gymnasium in Melk where a new physics laboratory had been built in\n1878\n, and then completed his schooling at the Gymnasium in St Pölten. Here he gained a certain dexterity in the infinitesimal calculus by making a fairly unsystematic reading of the standard textbooks, but also reading original work by\nNewton\nand by\nEuler\nwhich he had access to in the Abbey Library at St Pölten.\nWirtinger studied mathematics at the University of Vienna, beginning his course in\n1884\n. His main lecturers were\nEmil Weyr\nand Gustav von Escherich\n(1849\n-\n1935)\n. Gustav von Escherich had studied at the University of Vienna and worked at Graz before taking up a position in Vienna in\n1884\n, the year Wirtinger began his course. He taught Wirtinger about the new approach to analysis which\nWeierstrass\nhad developed. However, it was\nEmil Weyr\nwho inspired Wirtinger with his courses on synthetic geometry and this led to Wirtinger's first two publications and his doctoral thesis. He received his doctorate from the University of Vienna in\n1887\nfor his thesis\nÜber eine kubische Involution in der Ebene\nⓉ\n(\nOn a cubic involution in the plane\n)\n. His thesis was not published but, as we just noted, he had published two papers before he submitted his thesis, namely\nÜber die Brennpunktkurve der räumlichen Parabel\nⓉ\n(\nOn the focal curve of spatial parabola\n)\n(1886)\nand\nÜber rationale Raumkurven\n4\n.\n0\nrdnung\nⓉ\n(\nOn rational space curves\n4\n: Order\n)\n(1886)\n.\nFor a fairly complete list of all Wirtinger's mathematical publications see\nTHIS LINK\n.\nAfter the award of his doctorate, he continued to study at the University of Vienna. However, the largest influence on the direction of his research came from\nFelix Klein\nwhen he studied at the University of Berlin and at the University of Göttingen. He was able to visit Berlin and Göttingen thanks to a travel grant that he was awarded after obtaining his doctorate which funded his studies in Germany for a year. In Berlin he attended lectures by\nKarl Weierstrass\n,\nLeopold Kronecker\nand\nLazarus Fuchs\nbut these did not make nearly such a lasting impression on him as the time he spent at Göttingen. There he attended\nFelix Klein\n's lectures on Abelian functions and partial differential equations of physics. Along with\nWilliam Osgood\nhe attended\nKlein\n's seminar and Wirtinger and\nKlein\nbecame life-long friends. Wirtinger\nhabilitated\nat the University of Vienna in\n1890\nand, in addition to teaching there, he was appointed as an assistant to\nEmanuel Czuber\nat the Technical University in Vienna.\nCzuber\nhad just been appointed as an ordinary professor. This enabled Wirtinger to get married and, in\n1890\n, he married Amalia Feyertag; they had three sons and two daughters. Sadly two of the sons died just before, or during, World War I. Hans Hornich writes in\n[\n2\n]\nthat Amalia was a loving wife for Wirtinger but she did not play any role in his professional career. Amalia died a few years before her husband.\nThe work he undertook after his appointments in Vienna appeared in a number of papers such as\nÜber eine Verallgemeinerung der Kummer'schen Fläche und ihre Beziehungen zu den Thetafunktionen zweier Variablen\nⓉ\n(\nOn a generalization of Kummer's area and its relations with the theta-functions of two variables\n)\n(1890)\n,\nZur Theorie der Abel'schen Funktionen vom Geschlecht\n3\nⓉ\n(\nOn the theory of Abelian functions of genus\n3\n)\n(1891)\nand\nUntersuchungen über Abel'sche Funktionen vom Geschlecht\n3\nⓉ\n(\nStudies of Abelian functions of genus\n3\n)\n(1891)\n. His most important work during these years, however, was the book\nUntersuchungen über Thetafunktionen\nⓉ\n(\nStudies of theta functions\n)\n(1895)\nwhich led to Wirtinger receiving the Beneke Prize from the Faculty of Philosophy of Göttingen. This book was a work of major importance on the general theta function. In it Wirtinger combined ideas from\nRiemann\n's function theory with ideas from\nKlein\nto prove results of great significance. It was this book, which he had developed from work begun at Göttingen, that brought Wirtinger's name to the fore as a leading mathematician.\nConstantin Caratheodory\nwrites in\n[\n1\n]\n:-\nHowever, Wirtinger was not a specialist who only worked on one problem and did not have a sense for the essentials of science. In his lectures he always stressed the historical context and had a remarkable interest in the philosophical basis of mathematics. He was economical with his publications, but every single paper - even if only a few pages long - does not only contain surprising thought of exceptional beauty but also proof that he could combine his perfect geometrical insight with his rare skill of mastering the mathematical symbolism.\nWirtinger's range of mathematics was quite exceptional. Not only did he write beautiful papers on function theory, he also wrote on geometry, algebra, number theory, plane geometry and the theory of invariants. He also wrote several important papers on\nLie\n's translation manifolds and their application to abelian integrals. This list would certainly make one believe that Wirtinger's range within pure mathematics was very wide but his interests went well beyond pure mathematics. He published results on\nEinstein\n's theory of relativity and other areas of mathematical physics. He also worked and lectured on statistics and wrote a work on rainbows. In fact\nErwin Schrödinger\nattended his lectures on mathematical statistics.\nAs a consequence of the outstanding work he had published, in\n1895\nWirtinger was promoted Extraordinary Professor at Vienna where he lectured on a wide variety of topics and continued to produce outstanding research. Then, later the same year, he accepted a chair at the University of Innsbruck. During his years in Innsbruck he wrote the article\nAlgebraische Funktionen und ihre Integrale\nⓉ\n(\nAlgebraic functions and their integrals\n)\nfor the\nEncyklopädie der mathematischen Wissenschaften\n. He also worked on a paper with Adolf Krazer\n(1858\n-\n1926)\nbut Wirtinger became occupied with other work and the paper appeared with Krazer as the only author. Many mathematicians at this stage in their careers wrote textbooks based on lecture courses they were giving but Wirtinger was so full of new ideas and solving problems that he was totally engrossed in research.\nWirtinger returned to a chair at the University of Vienna in\n1903\n. This chair had been held by\nLeopold Gegenbauer\nbut he had stopped teaching due to ill health in\n1901\nand the chair became vacant following his death in June of\n1903\n. Wirtinger held this chair for\n32\nyears. When he was appointed his colleagues included Gustav von Escherich, who had taught him as a student, and\nFranz Mertens\nwho was appointed as an ordinary professor in Vienna in\n1894\n.\nMertens\nretired in\n1911\nand\nPhilipp Furtwängler\nwas appointed in\n1912\n. Another of Wirtinger's colleagues was\nHans Hahn\nwho was a\nprivatdozent\nin Vienna from\n1905\nand, after several years away, returned to a chair in Vienna in\n1921\n. Wirtinger also took on administrative duties in the University, in particular he was Dean of the Faculty of Arts in the academic year\n1915\n-\n16\n.\nLet us say a little about Wirtinger's teaching at the University of Vienna. The lecturing was based on a three-year cycle and each professor had to give the introductory lectures in the first semester once every three years. In the other two years Wirtinger gave advanced lectures on function theory and on algebraic or\nelliptic functions\n. In addition to these courses, Wirtinger ran a two-hour seminar but he here found it somewhat harder to interact with students due to his deafness and, as a consequence, usually lectured rather than encouraging student contributions. As a teacher of advanced students, he was highly successful, but his lectures required the students to have a good background knowledge before they could benefit. This meant that when he lectured to large classes with varied backgrounds, he did not get nearly as many attending as others teaching similar topics at Vienna. For example in\n[\n2\n]\nHans Hornich notes that it was a period when the universities were overcrowded and introductory classes by\nPhilipp Furtwängler\nor\nHans Hahn\nwould have around\n400\nstudents crowded into the lecture theatre while when Wirtinger taught a similar course there would be barely\n50\nstudents. However, his seminar would attract\n3\nor\n4\nstudents who were undertaking research and they would find the sessions both stimulating and extremely profitable. In fact he trained a number of outstanding young mathematicians in these sessions. We should also mention, when describing his teaching, that Wirtinger was interested in the history of mathematics and also in philosophy. Particularly when he was in the later stages of his career he would hold seminars in the history of mathematics, particularly on the ancient Greek mathematicians. His knowledge of ancient Greek allowed him to tackle these topics reading works in the original Greek.\nIn\n1906\nWirtinger published\nÜber die Entwicklung einiger mathematischer Begriffe in neuerer\nⓉ\n(\nOn the development of some recent mathematical concepts\n)\n. A Press report from\n1906\nincludes the following:-\nThe mathematician Wilhelm Wirtinger, who established his scientific reputation over\n10\nyears ago with the solution of a difficult problem\n(\nthe general theta function\n)\n, reported today in the Academy of Sciences on \"the development of some mathematical concepts in modern times.\" The definition of these terms is not always easy, as Wirtinger shows with the example of an infinite set: \"Even\nGalileo\nhad mentioned that the infinite set of integers seems to be far greater than the set of square numbers, since the square numbers are becoming increasingly rare the further one progresses along the series of numbers, while, on the other hand, the size of both sets would have to be the same because each number corresponds to a perfect square.\"\nFor Wirtinger there seems to have been relatively little outside mathematics. He sometimes travelled through Munich to the Achensee for a summer vacation. Often he would be accompanied by\nHans Hahn\nwho did some teaching at the university of Innsbruck. Others taking their summer vacations on the Achensee would have relaxed and taken the chance to have a break from academic work. Not so Wirtinger, who sat and watched the waves on the lake and thought about the mathematical theory which lay behind them. After his holiday he wrote up his results to provide an improved theory of capillary waves.\nWhen\nKurt Reidemeister\nwas appointed as associate professor of geometry at the University of Vienna in\n1923\nhe became a colleague of Wirtinger. At that time Wirtinger was interested in knot theory and he showed\nReidemeister\nhow to compute the fundamental group of a knot from its projection. Wirtinger's method was first published in work of\nEmil Artin\nin\n1925\n. Wirtinger certainly did not lessen his mathematical activity as he grew older. At the age of\n71\nhe wrote the first of a series ground-breaking papers on higher dimensional spaces.\nAmong the mathematicians who Wirtinger taught while he held the chair at Vienna are\nOtto Schreier\n,\nKurt Gödel\n,\nJohann Radon\nand\nOlga Taussky-Todd\n. We note that Hans Hornich, the author of\n[\n2\n]\n, was also one of Wirtinger's students.\nIt was not only with his research and teaching that Wirtinger contributed to the mathematical sciences but also through his interest in mathematical education. We quote\n(\nwith minor additions\n)\nfrom\n[\n3\n]\nabout his role in the International Commission on Mathematical Instruction:-\nWhen the Austrian sub-committee of the Internationale mathematische Unterrichts-Kommission\n(\nIMUK\n)\nwas established in\n1909\n, Wirtinger was nominated as one of the three delegates and thus became a member of IMUK. He continued in this function until the dissolution in\n1920\n. In\n1936\n, after the reestablishment of IMUK, Wirtinger was elected an honorary member of the committee. For the IMUK meeting in Milan in\n1911\n, he was a member of the committee preparing the reports on the mathematical training of students of the natural sciences and gave the report for Austria. In\n1933\n, he published, together with\nHans Hahn\nand Erwin Kruppa\n(1885\n-\n1967)\n, the report on the training of mathematics teachers in Austria.\nThe report mentioned in this quote was\nDie Ausbildung der Mathematiklehrer an den Mittelschulen Oesterreichs\nⓉ\n(\nThe training of mathematics teachers at the secondary schools of Austria\n)\npublished in\nL'Enseignement Mathématique\n.\nWirtinger received many honours for his achievements. In\n1907\nthe\nRoyal Society\nof London awarded him their\nSylvester\nMedal and Wirtinger travelled to England to receive the honour. He was the third recipient of the medal which had been previously awarded to\nHenri Poincaré\nand\nGeorg Cantor\n, so indeed this ranked him among the very greatest mathematicians of his day. Among other honours was his election to the\nAustrian Academy of Sciences\n(1905)\n, the\nBerlin Academy of Science\n, the\nGöttingen Academy of Sciences\n, the\nAccademia dei Lincei\n(1927)\nand the Bavarian Academy of Sciences and Humanities\n(\nin\n1931)\n. He received honorary doctorates from the University of Hamburg\n(\nin\n1926)\nand the University of Oslo. He was made an honorary member of the International Commission on Mathematical Instruction on\n15\nJuly\n1936\n. The title was conferred on Wirtinger\n(\nand others including\nCastelnuovo\n,\nDickstein\n,\nEnriques\nand\nLoria\n)\nat the International Congress of Mathematicians held in Oslo.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Newton",
    "Euler",
    "Emil Weyr",
    "Weierstrass",
    "THIS LINK",
    "Felix Klein",
    "Karl Weierstrass",
    "Leopold Kronecker",
    "Lazarus Fuchs",
    "William Osgood",
    "Klein",
    "habilitated",
    "Emanuel Czuber",
    "Czuber",
    "Riemann",
    "Constantin Caratheodory",
    "Lie",
    "Einstein",
    "Erwin Schrödinger",
    "Leopold Gegenbauer",
    "Franz Mertens",
    "Mertens",
    "Philipp Furtwängler",
    "Hans Hahn",
    "privatdozent",
    "elliptic functions",
    "Galileo",
    "Kurt Reidemeister",
    "Reidemeister",
    "Emil Artin",
    "Otto Schreier",
    "Kurt Gödel",
    "Johann Radon",
    "Olga Taussky-Todd",
    "Royal Society",
    "Sylvester",
    "Henri Poincaré",
    "Georg Cantor",
    "Austrian Academy of Sciences",
    "Berlin Academy of Science",
    "Göttingen Academy of Sciences",
    "Accademia dei Lincei",
    "Castelnuovo",
    "Dickstein",
    "Enriques",
    "Loria"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}