{
  "nome_completo": "Wilhelm Cauer",
  "nome_curto": "Wilhelm Cauer",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cauer/",
  "data_nascimento": "24 June 1900",
  "local_nascimento": "Berlin, Germany",
  "data_morte": "22 April 1945",
  "local_morte": "Berlin, Germany",
  "summary": "Wilhelm Cauer was a German mathematician and physicist who is best known for his work on the analysis and synthesis of electrical filters.",
  "biografia": "Wilhelm Cauer\n's mother came from a family with a tradition of being academics or ministers of the church. His father, also named Wilhelm Cauer, was professor of railway engineering at the Technical University of Berlin. Wilhelm, the subject of this biography, was the sixth of his parents' children. Few people can have attended a\nGymnasium\nfounded by their great-grandfather situated on a street named after the family - in this case the Cauerstrasse - but this was the start in life that young Wilhelm had. This both encouraged the young lad to study hard but it also made him realise just how much he had to live up to. Emil Cauer, Wilhelm Cauer's son, writes about the family in\n[\n1\n]\n:-\nIn general, the family had a high and idealistic belief in the value of education. Even my grandfather's sisters and their stepmother published books while and were active in the women's liberation movement. In a time when some professors still did not tolerate female students, three of my father's sisters completed their doctor's thesis. But at the same time, the males were distanced from the social problems of those times. They were patriotic in an uncomplicated fashion and believed that science and learning were completely independent of politics. They had a high opinion of individual freedom as well as of individual duty to the 'Fatherland'.\nIt was at the start of his studies at the Mommsen Gymnasium in Berlin that Cauer became fascinated by mathematics and decided that he wanted to make his career in that topic. His mathematics teacher at the Gymnasium was H Beck who was convinced that Cauer should become a university professor. World War I was in progress throughout much of the years he spent in the Gymnasium and when he graduated in June\n1917\nhe was drafted into the army. This was close to the end of the war so Cauer only served for a few months before being able to begin his studies at the Berlin-Charlottenburg Technische Hochschule at Easter\n1918\n. While he was studying here, his former teacher Beck wrote to him in\n1920\n[\n1\n]\n:-\nMy dear Mr Cauer: That's a bit too much - to expect you to become a school teacher. You would be eaten alive by the boys. ... I tell you what you should become - a professor, for this profession has the least to do with life. ... I told your father six or seven years ago that you were a born professor.\nBeck had progressed from being a Gymnasium teacher to becoming professor of mathematics at Bonn University and, in\n1921\n, Cauer went to Bonn to continue his studies of mathematics and theoretical physics at the university there. Back in Berlin, he began to work for his doctorate under Max von Laue at the University of Berlin on\n2\nFebruary\n1923\n. He worked on general relativity and published his first paper on that topic in\n1923\n. However, his relationship with von Laue seems to have broken down and Cauer moved to the Berlin-Charlottenburg Technische Hochschule where he was employed as an assistant to Reissner and began to investigate problems in the area of electrical engineering. He was awarded a diploma in \"Technical Physics\" on\n24\nMarch\n1924\nand later that year, on\n1\nAugust, he started working for the Mix & Genest Company, a branch of the Bell Telephone Company working on communication and telephone systems. The important ideas he began to work on at this time were to lead to major developments\n[\n4\n]\n... many \"ingredients\" of a systematic synthesis theory were in the air when Cauer started his scientific career. Especially Foster's reactance theorem was a first conscious step towards a thorough mathematical description of classes of circuits. Cauer immediately recognised the potentialities of Foster's ideas and started a private correspondence with Foster.\nIn\n1925\nCauer married Karoline Cauer, who was related to him; they had six children including the son Emil\n(\nmentioned above\n)\nwho was one of the authors of\n[\n1\n]\n,\n[\n2\n]\nand\n[\n3\n]\n. Cauer left the Mix & Genest Company in November\n1925\nand continued to work at the Berlin-Charlottenburg Technische Hochschule for his doctorate. He was an assistant to\nGeorg Hamel\nwho acted as his thesis advisor. He was awarded a doctorate for his thesis\nDie Verwirklichung der Wechselstromwiderstände vorgeschriebener Frequenzabhängigkeit\nⓉ\n(\nThe realization of impedances of specified frequency dependence\n)\non\n7\nJuly\n1926\n. This thesis was a significant contribution containing a complete program for network synthesis. Interested in using computers to solve systems of linear equations, he contacted\nRichard Courant\nat Göttingen and Vannevar Bush who was developing mechanical computers at the Massachusetts Institute of Technology. Cauer had prepared his\nhabilitation\nthesis and was ready to submit it by the beginning of\n1928\n. However, there were difficulties regarding him submitting it to the Berlin-Charlottenburg Technische Hochschule so Courant suggested that Cauer transfer to Göttingen. He registered at Göttingen on\n1\nApril\n1928\nand became a research assistant at\nCourant\n's Institute of Mathematics at the University of Göttingen. He submitted his habilitation thesis\nUntersuchungen über ein Problem, das drei positiv definite quadratische Formen mit Streckenkomplexen in Beziehung setzt\nⓉ\n(\nOn a problem where three positive definite quadratic forms are related to one-dimensional complexes\n)\nto Göttingen in June\n1928\n.\nIn February\n1930\nCauer was awarded a scholarship by the Rockefeller Foundation to allow him to visit the United States. He sailed for the United States with his wife later in that year. In the first half of\n1931\nhe visited Vannevar Bush at the Massachusetts Institute of Technology where he also met\nNorbert Wiener\n. An invitation from\nOswald Veblen\nto visit Harvard gave him the chance to meet\nEberhard Hopf\nand\nDavid Tamarkin\n. Before returning to Europe, he worked for the Wired Radio Company in Newark, New Jersey, for three months before sailing back to Germany via Southampton in England. While in the United States he published\nThe Poisson integral for functions with positive real part\nin the\nBulletin\nof the\nAmerican Mathematical Society\n. Back in Göttingen he wanted to build a calculating machine to solve linear equations but, despite having progressed well with the project, this was a time when funding was impossible due to the Depression so it could not proceed. In\n1933\nthe Nazis came to power and, almost immediately, passed their racial laws which saw academics with one Jewish grandparent dismissed from their posts. This had a devastating effect on mathematics at Göttingen but Cauer made efforts to ride out the political storm. Emil Cauer writes\n[\n3\n]\n:-\nBut in those days of hysterical investigations it soon became known that one of Cauer's ancestors had been a certain Daniel Itzig\n(1723\n-\n1799)\n, a banker of the Prussian king Frederick II, among whose descendents were a number of well-known bankers, statesmen and composers. Although this did not mean that my father was going to be affected by the Nazi race laws, he was given to understand that there was no future for him at the University of Göttingen.\nCauer also suffered from the problem that his work was not appreciated, really being too innovative to make an immediate impact. His attempts to obtain a professorship at Darmstadt were unsuccessful and by\n1934\nhe was fully aware that he would never obtain a professorship. He made applications to firms such as Philips, Siemens, Telefunken, Deutsche Versuchsanstalt für Luftfahrt, and the aircraft firms Henschel and Junkers but they all rejected his applications for posts in\n1934\n-\n35\n. In July\n1936\nhe was employed at Fieseler & Storch aircraft company, then in\n1936\nhe became a director of the laboratory at Mix & Genest. This gave him financial security and, from\n1939\nonwards, he lectured at the Technical University of Berlin. Cauer published the papers\nDas Poissonsche Integral und seine Anwendungen auf die Theorie der linearen Wechselstrom-schaltungen\n(\nNetzwerke\n)\nⓉ\n(\nPoisson's integral and its applications to the theory of linear AC circuits\n(\nnetworks\n)\n)\nand\nBemerkung über eine Extremalaufgabe von E Zolotareff\nⓉ\n(\nNote on an extremal problem of Zolotareff\n)\nin\n1940\n. R M Foster, who had corresponded with Cauer for many years, reviewed the first of these papers:-\nThis is an exposition of the theory of the\nPoisson\nintegral, especially designed to exhibit those properties which find immediate application in electrical network theory. The importance of the\nPoisson\nintegral in this field is largely due to the possibility of the representation in this integral form of positive real functions\n(\nfunctions which are regular in the right-hand half-plane, with non-negative real parts in that half-plane, and with real values on the real axis\n)\n, as previously discussed by the author ...\nIn\n1941\nCauer published the first volume of his classic text\nTheorie der linearen Wechselstromschaltungen\nⓉ\n(\nTheory of linear AC circuits\n)\n. He had not found it easy to find a publisher for the book which he had largely written during a sabbatical semester during the years\n1934\n-\n35\n. He offered his book to the publisher Teubner in December\n1935\nbut they rejected it in\n1938\n. He also offered it to Springer in January\n1936\nbut he was successful when he offered it to Akademische Verlagsgesellschaft in November\n1939\n. R Kahal wrote in his review of the second edition of the book which appeared in\n1954\n:-\nThe reappearance of this compendium on linear circuit theory will be a welcome event to network enthusiasts. There is no other text in any language quite comparable with this book. The material included contains a considerable amount of Cauer's own researches as well as the work of other European workers which is not generally well-known in this country. ...\nAn English translation entitled\nSynthesis of linear communication networks\nwas published in\n1958\n. A second volume of the work was written by Cauer but was destroyed in\n1943\nin a bombing raid. He did not despair over this but set about rewriting the text from scratch. Having completed the manuscript of the second volume for the second time, he put it into the safe at Mix & Genest but the Russian soldiers destroyed it after the fall of Berlin. Emil Cauer, who was born in\n1932\n, remembers the war years:-\nI remember my mother ruling over the family, while my father, home from his office, would withdraw into his study to work on mathematical formulae. He even used to work while we crouched in our air raid shelter during World War II bombing attacks. I would not say he was a workaholic, but that he was dedicated to his work and inclined to be single-minded. He did not like to waste time, and he distinguished the important from the unimportant. This helped him to be broadminded and generous. He was warm and gentle towards me as a child, though sparing of words. He liked to play chess with me, patiently waiting for me to make my helpless moves and briefly explaining where I had gone wrong. I remember with particular affection the evening hours when the family would sit in his study whilst he read out loud in German from foreign books such as 'Robinson Crusoe' by Daniel Defoe.\nAs the Russian forces approached Berlin, Cauer took his family to stay with relatives in the small town of Witzenhausen in Hesse, about\n30\nkm from Göttingen. He had given some of his unpublished papers to friends in Göttingen as he felt that this would give them a better chance of surviving. Two days before the American army captured Witzenhausen, Cauer left the town and returned to Berlin. It is not quite clear what his reasons were - possibly to support his colleagues in Berlin, perhaps just out of a determination to carry on with his work. Although his name was on a list of scientists that the Russians wanted to capture and use to help with their own scientific advances, this was not known to the soldiers in the Russian army that entered Berlin on\n22\nApril\n1945\n. He was executed by these soldiers in the garden of his home.\nCauer's family assembled the papers he had left with friends in Göttingen and published them after the war ended.\nSynthesis of Linear Communication Networks\nwas published in New York in\n1958\nand\nTheorie der linearen Wechselstromschaltungen, Vol. II\nⓉ\n(\nTheory of linear AC circuits, Vol. II\n)\nwas published in Berlin in\n1960\n. Some of the material here would have formed part of the lost second volume, although presumably in a rather different form. Let us end this biography by quoting from Pauli\n[\n4\n]\n:-\nCauer's program marked a milestone in the development of network synthesis towards a mathematical description of classes of circuits - and hence towards what we nowadays call mathematical systems theory. It is to Cauer's merit that he turned network and system synthesis into a truly systematic business. He provided it with the appropriate mathematical framework just as the discipline was on the rise starting from Foster's reactance theorem. In contrast to the purely utilitarian or engineering approach, Cauer emphasised the scientific aspects and provided the first precise statement of the network synthesis problem, one that has become a valid paradigm for all synthesis problems.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Georg Hamel",
    "Richard Courant",
    "habilitation",
    "Courant",
    "Norbert Wiener",
    "Oswald Veblen",
    "Eberhard Hopf",
    "David Tamarkin",
    "American Mathematical Society",
    "Poisson"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}