{
  "nome_completo": "William Srecko Feller",
  "nome_curto": "William Feller",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Feller/",
  "data_nascimento": "7 July 1906",
  "local_nascimento": "Zagreb, Austria-Hungarian Empire (now Croatia)",
  "data_morte": "14 January 1970",
  "local_morte": "New York, USA",
  "summary": "William Feller was a Croatian-born American mathematician who worked on probability and is best known as the author of a standard work on Statistics.",
  "biografia": "William Feller\n's parents were Ida Oemichen\n(1870\n-\n1938)\nand Eugen Viktor Feller\n(1871\n-\n1936)\n. In fact his first name was not William. Rather it was Vilibald which was the name of the Saint whose day falls on his birthday. His mother was a Roman Catholic and so he was christened Vilibald Srecko, but chose to be known as Vilim in his homeland from\n1923\nonward, and Willy in Germany and Scandinavia\n(\nhe even used the name Willy Feller on his papers into the\n1940\ns\n)\n. William's father Eugen, who was born in Lemberg\n(\nnow Lviv\n)\n, was a chemist working in industry. Eugen's father David Feller, the paternal grandfather of our mathematician, was Jewish but had converted to Roman Catholicism when marrying Elsa Holzer. William, the ninth of his parents' twelve children, was baptised on\n19\nJuly\n1906\nin the church of St Marko in Zagreb. He had seven older brothers, one older sister and three younger sisters. The seven older boys were Ferdinand\n(1897\n-\n1960)\nwho became a pharmacist, Marko, Vlado, Miroslav\n(1901\n-\n1961)\nwho became a writer and philosopher, Marijan\n(1903\n-\n1974)\nwho became a pianist, Kazimir, and Dragan Karl. The girl who was older than William was Elza\n(\nborn\n1899)\n, the oldest of all the children, while the three younger sisters were Marcia\n(\nborn\n1907)\n, Krista, and Zora. The family was well-off having made much money from Elsa fluid\n(\nnamed after William's paternal grandmother\n)\nwhich claimed to cure everything from headaches to colds to stiff joints. The wealthy family built a home in Jurjevska street in Zagreb which was designed by William's uncle Mathias Feller. Built in\n1911\n, the large grandly decorated house at\n31\na was William's home for most of his childhood. The twelve children were brought up to be bilingual, having both German and Croatian as native languages.\nWilliam was educated by private tutors as well as attending secondary school at the First\nRealgymnasium\n, Zagreb. His private mathematics tutor was Stanko Vlögel, the professor of mathematics and engineering mechanics at the University of Zagreb. William graduated from the Realgymnasium in June\n1923\nand entered the University of Zagreb in October of that year. At Zagreb University he studied\n(\n[\n68\n]\nor\n[\n69\n]\n)\n:-\nMathematics I-IV\n(\nwith Marije Kiseljak\n)\n, Differential and Integral Calculus\n(\nwith Vladimir Varicak\n)\n, Infinite Series\n(\nwith Stjepan Bohnicek\n)\n, Number Theory\n1\n,\n2\n(\nwith Stjepan Bohnicek\n)\n, Theory of Real Functions\n(\nwith Vladimir Vranic\n)\n, Calculus of Variations\n(\nwith Vladimir Varicak\n)\n, and two mathematical seminars\n(\nwith Vladimir Varicak\n)\n, along with a panoply of experimental and theoretical physics, some chemistry, and a sample of courses in pedagogy and psychology.\nA fuller list of courses he took is given in\n[\n80\n]\n. He was also taught by Stanko Hondl\n(1873\n-\n1971)\n, the professor of physics, who had attended\nMax Planck\n's lectures. However, Vladimir Varicak was the lecturer who influenced Feller most. He was\n[\n74\n]\n:-\n... one of the leading European experts on\nEinstein\n's theory of relativity at that time and author of the often quoted book 'Darststellung der Reltivitätstheorie im dreidimenzionalen Lobatschefskijschen Raume'\nⓉ\n(\nRepresentation of relativity theory in four dimensional Lobachevsky space\n)\n(\nZagreb,\n1924)\n.\nFeller was awarded his first degree in\n1925\n(\nafter\n2\nyears instead of the usual\n4\nyears\n)\nand then went to the University of Göttingen to undertake research. His Ph.D. was awarded, suma cum laude, by the University of Göttingen for his thesis\nÜber algebraisch rektifizierbare transzendente Kurven\nⓉ\n(\nOn algebraically rectifiable transcendent curves\n)\nwhen he was only twenty years old. His thesis advisor was\nRichard Courant\n. He completed work on his thesis in\n1926\nand his oral examination was held on\n3\nNovember of that year with examiners\nRichard Courant\n,\nGustav Herglotz\nand James Franck. He was awarded his doctorate by the Faculty of Mathematics and Natural Sciences on\n18\nJuly\n1927\n. The delay was a result of the requirement that the thesis be accepted for publication before the doctorate was awarded. At Göttingen, in addition to\nCourant\n, Feller was also strongly influenced by\nDavid Hilbert\n. After completing work on his thesis, he spent another two years at Göttingen as an assistant of\nRichard Courant\nbefore he accepted an appointment as head of the applied mathematics laboratory at the University of Kiel where he worked until\n1933\n. This was the year that Feller published his first work on probability theory which was his review of\nAndrei Nikolaevich Kolmogorov\n's monograph on probability theory\nGrundbegriffe der Wahrscheinlichkeitsrechnung\nⓉ\n(\nBasic concepts of probability theory.\n)\n. This monograph, published in\n1933\n, built up probability theory in a rigorous way from fundamental axioms in a way comparable to\nEuclid\n's\nElements\n. Feller wrote in his review:-\nThe calculus of probabilities is constructed axiomatically, with no gaps and in the greatest generality, and for the first time systematically integrated, fully and naturally, with abstract measure theory. The axiom system is certainly the simplest imaginable. ... The great generality is noteworthy; probabilities in infinite dimensional spaces of arbitrary cardinality are dealt with. ... The presentation is very precise, but rather terse, directed to the reader who is not unfamiliar with the material.\nMeasure theory\nis assumed.\nHitler came to power in Germany in\n1933\nand there was no way that Feller would accept the requirements placed on academics to sign a Nazi oath. He already knew\nHarald Bohr\nwell since both had been in Göttingen together and\nBohr\nnow undertook to try to help academics fleeing from Hitler's Nazis to find employment elsewhere. Feller went to Copenhagen where he remained until\n1934\n, then he moved to the University of Stockholm where he joined the probability group in the Institute for Insurance Mathematics and Mathematical Statistics headed by\nHarald Cramér\n. Being a research associate of\nCramér\nwas valuable to Feller, as was the fact that he was able to have useful discussions with\nMarcel Riesz\nwho was also working in Sweden. In\n1938\nFeller married Clara Mary Nielsen who had been his student in Kiel; they had no children. Feller and his wife emigrated to the United States in\n1939\nand he became an associate professor of mathematics at Brown University, in Providence Rhode Island.\nFounded in\n1931\nwith\nOtto Neugebauer\nas the editor, the reviewing journal\nZentralblatt für Matematik\nhad rapidly become an indispensable tool for mathematicians world wide. After Hitler came to power in Germany in\n1933\n, production of\nZentralblatt\nbecame increasing difficult and\nHarald Bohr\nhelped\nNeugebauer\nto move to the University of Copenhagen in January\n1934\n. Feller was still in Copenhagen at this time. Neugebauer took the editorial office of\nZentralblatt für Matematik\nto Copenhagen with him and from\n1934\nuntil\n1938\nZentralblatt\ncontinued to flourish from its headquarters there. The struggle to produce the reviewing journal became more difficult throughout this period, however, for the Nazis tried more and more to influence the editorial policy of the journal. Tragically some mathematicians were seduced by the Nazi ideas and mathematicians such as\nWilhelm Blaschke\nattacked the journal. It was clear that the mathematical world required a reviewing journal which was not subjected to political pressures and, when\nNeugebauer\nwas appointed to Brown University, the\nAmerican Mathematical Society\nsaw its chance to produce a major reviewing journal. Feller became the first executive editor of\nMathematical Reviews\nwhich started reviewing articles which appeared from July\n1939\nand the first issue appeared in January\n1940\n. Its successful launch was largely the result of both\nNeugebauer\nand Feller's major efforts to get the journal established.\nFeller became an American citizen in\n1944\n, and in the following year accepted a professorship at Cornell University where he became a colleague and friend of\nMark Kac\nwho had emigrated to the United States in similar circumstances to Feller. He was to work there for five years until he was appointed Eugene Higgins Professor of Mathematics at Princeton in\n1950\n.\nGian-Carlo Rota\nwrites\n[\n62\n]\n:-\nFrom the time he moved from Cornell to Princeton in\n1950\n,\n[\nFeller's\n]\nwhole life revolved around a feeling of inferiority. He secretly considered himself to be one of the lowest ranking members of the Princeton mathematics department ... In retrospect, nothing could be farther from the truth. Feller's treatise on probability is one of the great masterpieces of mathematics of all time.\nFeller worked on mathematical probability using\nKolmogorov\n's measure theoretic formulation. His approach was pure mathematical but he did study applications of probability, particularly to genetics. He transformed the relation between\nMarkov\nprocesses and\npartial differential equations\n. Later he put his results in a\nfunctional analysis\nframework. Feller made notable contributions to the mathematical theory of Brownian motion and diffusion processes during the years\n1930\n-\n1960\n.\nSome of the first papers reviewed by\nMathematical Reviews\nwere written by Feller himself such as\nCompletely monotone functions and sequences\n(\nDuke Journal,\n1939)\nand\nDie Grundlagen der Volterraschen Theorie des Kampfes ums Dasein in wahrscheinlichkeitstheoretischer Behandlung\nⓉ\n(\nFundamentals of Volterra theory of the struggle for existence in a probabilistic treatment\n)\n(1939)\n.\nJoseph Doob\n, in a review of the latter paper in\nMathematical Reviews\n, writes:-\nThe author makes a careful study of the development of a population whose number at time\nt\nt\nt\n,\nN\n(\nt\n)\nN(t)\nN\n(\nt\n)\n, is treated as a random function. Thus if it is supposed that the probability that each individual in a time interval of length\nd\nt\ndt\nd\nt\nhas probability\nl\nd\nt\nl dt\nl\nd\nt\nof producing a second individual, the exact value of the probability of having\nn\nn\nn\nindividuals at time\nt\nt\nt\nis found. ...\nThe review of Feller's article\nOn the logistic law of growth and its empirical verifications in biology\n(1940)\nprovides some background:-\nThe logistic curve exploited by Pearl and others is often accepted as expressing a fundamental law of biological growth and this view\n(\nfrequently plausible in special cases\n)\nseems to find support in the success that has attended the effort at fitting a logistic curve to various data on growth of experimental populations. Instead of being content with achieving a graphical vehicle providing satisfactorily close fit, some writers have sought to infer the necessary working of an autocatalytic reaction and hence to assume that the observed and tabulated growth is controlled by some internal factor resident in the organism, rather than being largely governed by external factors. The author considers the problem as to whether there is evidence to support the universal application of any such reasoning as to the operative causes ...\nOther papers written by Feller while still at Brown University include:\nOn the time distribution of so-called random events\n(1940)\n,\nOn the integral equation of renewal theory\n(1941)\n,\nOn A C Aitken's method of interpolation\n(1943)\n,\nThe fundamental limit theorems in probability\n(1945)\nand\nNote on the law of large numbers and \"fair\" games\n(1945)\n. The second last of these papers on the limit theorems is on a topic that Feller kept returning to over many years.\nFeller's most important work was\nIntroduction to Probability Theory and its Applications\n(1950\n-\n71)\n, a two volume work which he frequently revised and improved with new approaches, new examples and new applications. The first volume, first published in\n1950\n, was produced in a second edition in\n1957\nwith substantial additions:-\n... the exposition is mathematically rigorous and at the same time elegant and lucid. This fascinating book will remain a standard textbook of mathematical probability for many years to come.\nThe first edition was published in\n1950\nbut Feller began writing it in\n1941\n.\nGian-Carlo Rota\nexplains why this classic book took so long to appear in print\n[\n62\n]\n:-\nWhile he was writing the first volume of his book he would cross out entire chapters in response to the slightest critical remark. Later, while reading galleys, he would not hesitate to rewrite long passages several times, each time using different proofs; some students of his claim that the entire volume was rewritten in galleys, and that some beautiful chapters were left out for fear of criticism. The treatment of recurrent events was the one he rewrote most, and it is still, strictly speaking, wrong. Nevertheless, it is perhaps his greatest piece of work. We are by now so used to Feller's ideas that we tend to forget how much mathematics today goes back to his \"recurrent events\"; the theory of formal grammars is one outlandish example.\nA third edition appeared in\n1968\n, and J C Wendel writes:-\nAll probabilists will welcome the latest edition of this classic book. While preserving the unique flavour of the former editions the author has improved the treatment of many topics.\nThis third edition was translated into Russian and\nAndrei Nikolaevich Kolmogorov\nwrote an introduction to this work:-\nThe first edition of Feller's book has already been met with a lot of approval in the USSR. We now bring to the attention to our readers the translation of the second English edition, improved and revised by the author with a lot of details. Such choice of material gives Feller's book a special place among the reference books on the probability theory ... By his choice of problems Feller exposes their solutions by 'direct' and especially probabilistic methods. This tendency to see probabilistic sense behind their analytical transformations represents the most valuable feature of Feller's book. The author's effort to clearly show character and effects of probabilistic laws on carefully chosen examples deserves our attention. In many cases the author succeeds in introducing the reader into quite interesting questions on the comparison between statistical data and probabilistic theory of events. No other book on Probability theory can be compared to this one - in terms of mathematical strictness, excellency of proof and the number of the examples observed. By explaining the most complex mathematical issues he never loses sight of reality where a developed theory can be applied. The character of the book is such that for a long time it will not become out-of-date.\nThe second volume of\nIntroduction to Probability Theory and its Applications\nappeared in two editions in\n1966\nand\n1971\n. For Feller's Prefaces to these books, see\nTHIS LINK\n.\nFor extracts from\n50\nreviews of the various editions of these two classic volumes see\nTHIS LINK\nand other pages linked to it.\nIn addition to opinions of the reviewers, we quote from\nJoseph Doob\n[\n26\n]\n:-\nNo other book even remotely resembles it in its combination of the purest mathematics together with a dazzling virtuosity of techniques and applications, all written in a style which displays the enthusiasm of the author. This style has made the book unexpectedly popular with non-specialists, just as its elegance and breadth, not to mention its originality, has made it an inspiration for specialists.\nFeller was invited to address the International Congress of Mathematicians in Cambridge, Massachusetts, in\n1950\n. He chose to speak on the theory of diffusion which he applied to biology. Feller said that his address\nSome recent trends in the mathematical theory of diffusion\n:-\n... outlines some new results and open problems concerning diffusion theory where we find an intimate interplay between differential equations and measure theory in function space.\nFeller delivered the one hour plenary talk\nSome new connections between probability and classical analysis\nat the International Congress of Mathematicians held in Edinburgh, Scotland, in\n1958\n.\nWork on the theory of diffusion was a major part of Feller's research at Princeton. He also was given the permanent title of visiting professor by Rockefeller University in\n1966\nand he spent several years there working both with geneticists and mathematicians while on leave from Princeton.\nRota\ndescribes in a colourful fashion his experiences attending Feller's lectures\n[\n62\n]\n:-\nHis lectures were loud and entertaining. He wrote very large on the blackboard, in a beautiful Italianate handwriting with lots of whirls. Sometimes only one huge formula appeared on the blackboard during the entire period; the rest was hand waving. His proof - insofar as one can speak of proofs - were often deficient. Nonetheless, they were convincing, and the results became unforgettably clear after he had explained them. The main idea was never wrong. He took umbrage when someone interrupted his lecturing by pointing out some glaring mistake. He became red in the face and raised his voice, often to full shouting range. It was reported that on occasion he had asked the objector to leave the classroom. The expression \"proof by intimidation\" was coined after Feller's lectures\n(\nby\nMark Kac\n)\n. During a Feller lecture, the hearer was made to feel privy to some wondrous secret, one that often vanished by magic as he walked out of the classroom at the end of the period. Like many great teachers, Feller was a bit of a con man. I learned more from his rambling lectures than from those of anyone else at Princeton. I remember the first lecture of his I ever attended. It was also the first mathematics course I took at Princeton\n(\na course in sophomore differential equations\n)\n. The first impression he gave was one of exuberance, of great zest for living, as he rapidly wrote one formula after another on the blackboard while his white mane floated in the air.\nJ L Doob\nwrote the following tribute to Feller\n[\n1\n]\n:-\nThose who knew him personally remember Feller best for his gusto, the pleasure with which he met life, and the excitement with which he drew on his endless fund of anecdotes about life and its absurdities, particularly the absurdities involving mathematics and mathematicians. To listen to him lecture was a unique experience, for no one else could lecture with such intense excitement.\nFeller received many honours. He was elected to the\nCroatian Academy of Sciences and Arts\n(1937)\n, to the\nRoyal Danish Academy of Sciences\n, and to the\nRoyal Statistical Society\nin London, and he was president of the Institute of Mathematical Statistics. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1960\nand was also elected a member of the\nAmerican Academy of Arts and Sciences\nin\n1958\n. He was awarded the\n1969\nNational Medal for Science but died shortly before the presentation was to be made. His wife received the medal on his behalf in a presentation by president Richard Nixon in the White House. The medal was conferred:-\n... for his important contributions to pure and applied mathematics, for his efforts to make probability theory accessible to broad audience, and for his pioneering work in establishing Mathematical Reviews.\nFeller had been nominated for the National Medal for Science by\nOscar Zariski\nand the case for the award was written by\nJoseph Doob\n,\nMark Kac\nand\nJerzy Neyman\n.\nThere was a difficult period when Feller was told that he had terminal cancer. In\n[\n61\n]\nMark Kac\nis quoted as saying:-\nHaving accepted the verdict himself he tried to make it easy for all of us to accept it too. He behaved so naturally and he took such interest in things around him that he made us almost forget from time to time that he was mortally ill.\nLet us quote Charles Ashbacher's assessment of Feller\n[\n4\n]\n:-\nFeller was one of the giants in the development of the modern ideas of probability models and analysis. He was creatively active his entire life, a counterexample to the myth that mathematicians have exhausted their creative energies by the age of\n50\n. Feller is also another example of the incredible value that can be derived from immigration. He was one of the first very talented people to leave Germany due to the rise of the Nazis, eventually settling in the eastern United States.\nLet us end this biography by quoting from\nJoseph Doob\nin\n[\n26\n]\n:-\nThose who knew him personally remember Feller best for his gusto, the pleasure with which he met life, and the excitement with which he drew on his endless fund of anecdotes about life and its absurdities, particularly the absurdities involving mathematics and mathematicians. To listen to his lecture was a unique experience, for no one else could lecture with such intense excitement. No one could generate in himself as well as in his auditors so much intense excitement. In losing him, the world of mathematics has lost one of its strongest personalities as well as one of its strongest researchers.",
  "matematicos_citados_na_biografia": [
    "Realgymnasium",
    "Max Planck",
    "Einstein",
    "Richard Courant",
    "Gustav Herglotz",
    "Courant",
    "David Hilbert",
    "Andrei Nikolaevich Kolmogorov",
    "Euclid",
    "Measure theory",
    "Harald Bohr",
    "Bohr",
    "Harald Cramér",
    "Cramér",
    "Marcel Riesz",
    "Otto Neugebauer",
    "Neugebauer",
    "Wilhelm Blaschke",
    "American Mathematical Society",
    "Mark Kac",
    "Gian-Carlo Rota",
    "Kolmogorov",
    "Markov",
    "partial differential equations",
    "functional analysis",
    "Joseph Doob",
    "THIS LINK",
    "Rota",
    "J L Doob",
    "Croatian Academy of Sciences and Arts",
    "Royal Danish Academy of Sciences",
    "Royal Statistical Society",
    "National Academy of Sciences(United States)",
    "American Academy of Arts and Sciences",
    "Oscar Zariski",
    "Jerzy Neyman"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}