{
  "nome_completo": "William Michael Herbert Greaves",
  "nome_curto": "William Greaves",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Greaves/",
  "data_nascimento": "10 September 1897",
  "local_nascimento": "Barbados, West Indies",
  "data_morte": "24 December 1955",
  "local_morte": "Blackford, Edinburgh, Scotland",
  "summary": "William Greaves graduated from Cambridge and then worked at the Royal Observatory Greenwich. He became Professor of Astronomy in Edinburgh. He worked on both theoretical and practical astronomy.",
  "biografia": "William Greaves\n' family came from the west of England but were living in Barbados where his father, Eustace  C Greaves, was a doctor. William, who was his parents' only son, attended Lodge School, Barbados, from\n1905\nto\n1915\n, and then spent\n1915\n-\n16\nat Codrington College, Barbados. Having won a scholarship to St John's College, Cambridge, he became an undergraduate there studying mathematics and astronomy. He a\nwrangler\nof the mathematical tripos of\n1919\nalso being Tyson Medallist in that year. He continued to undertake research at Cambridge being Isaac Newton Student in\n1921\n-\n3\n, and was elected a Fellow of St John's College in\n1922\n.\nGreaves was appointed Chief Assistant at the Royal Observatory, Greenwich, in\n1924\n. He held this position until\n1938\nwhen he was appointed to the chair of astronomy at the University of Edinburgh and Astronomer Royal for Scotland. He was Professor of Astronomy at Edinburgh from\n1938\nuntil his death in\n1955\n. While at Greenwich, Greaves had married Caroline Grace Kitto in\n1926\n; their only son George Greaves became a mathematician.\nHe was elected a Fellow of the\nRoyal Astronomical Society\nin\n1921\nand served as its President from\n1947\nto\n1949\n. He was elected a Fellow of the\nRoyal Society of Edinburgh\non\n6\nMarch\n1939\nhaving been proposed by James P Kendall,\nMax Born\n, Edmund G Dymond, Ruric W Wrigley, Edwin A Baker, and\nSir E T Whittaker\n. He was Secretary to Ordinary Meetings of the Society\n1940\n-\n5\n, and Vice-President\n1946\n-\n9\n. Greaves was also elected a Fellow of the\nRoyal Society\nin\n1943\n.\nHis obituary in the Edinburgh Mathematical Notes is at\nTHIS LINK",
  "matematicos_citados_na_biografia": [
    "wrangler",
    "Royal Astronomical Society",
    "Royal Society of Edinburgh",
    "Max Born",
    "Sir E T Whittaker",
    "Royal Society",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}