{
  "nome_completo": "Zygmunt William Birnbaum",
  "nome_curto": "William Birnbaum",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Birnbaum/",
  "data_nascimento": "18 October 1903",
  "local_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "data_morte": "15 December 2000",
  "local_morte": "Seattle, USA",
  "summary": "Zygmunt Wilhelm Birnbaum was a Polish-born American mathematician and statistician who contributed to functional analysis, nonparametric testing and estimation, probability inequalities, survival distributions, competing risks, and reliability theory.",
  "biografia": "William Birnbaum\nwas known as Bill to his friends and colleagues but the name that appears on his birth certificate was Zygmunt Wilhelm Birnbaum and, as a child, he was called Wilek\n(\nthe Polish diminutive of Wilhelm\n)\nby his family. His parents, Izak Birnbaum and Lina Nebenzahl, were Jewish but not particularly religious. Izak was a businessman whose main business was running a sawmill but he also had other business interests. When Birnbaum, the subject of this biography, was born, the town of Lwów was in the Austria-Hungarian region\n(\nwith the German name of Lemberg; it is now Lviv in Ukraine\n)\nalthough the family spoke Polish in their comfortable five-room apartment. Birnbaum entered elementary school at the age of six and spent four years in the school. Then, in\n1914\n, he entered a private Real\nGymnasium\nin Lwów run by Dr Niemiec where lessons were in Polish. However, events disrupted his education for later that year, in August, World War I broke out. The Birnbaum family decided that they were safer in Vienna so they moved there.\nIn Vienna, Birnbaum entered a gymnasium which had been set up for Polish speaking refugees so had lessons in Polish. However, he was soon bored at this school, so persuaded his parents to have him educated at home with a private tutor. The tutor spent one hour per day with Birnbaum and he was able to take examinations each year which the Viennese State set specifically for home educated pupils. He passed these examinations in\n1915\n,\n1916\n,\n1917\nand\n1918\nand after World War I ended in\n1918\nthe family returned to Lwów. This was now a Polish city since Poland had declared itself an independent state in November\n1918\n. He enrolled in the H Sienkiewicz State Gymnasium No. X in Lwów but, quickly becoming bored, spent a while being home educated again. He decided to spend the year\n1920\n-\n21\nat the Gymnasium preparing for the matura examination. Here his interests were turned towards mathematics by an inspiring young teacher\n[\n14\n]\n:-\n... mathematics was taught there by a young doctoral student, whose enthusiasm for set theory and topology exceeded his fear of the principal's reprimand for violating the official syllabus. He did not pay too much attention to the logarithmic tables and trigonometry, and talked in class about mathematics in a way that left a permanent impression on Wilhelm.\nDue to the war, the Birnbaum family's financial position was by now much less favourable so it was decided that Birnbaum needed to get a degree in a practical subject - certainly mathematics was not considered to be in this category. He therefore applied to Lwów University to enter the medical faculty and, in case that was unsuccessful, he also applied to enter the engineering faculty. However, Birnbaum was Jewish and there was a strict quota which severely limited the number of Jewish students who could enrol. Both his applications failed so he made a third application to study law and this time he was admitted. He took the necessary courses on law but also took mathematics courses since these were what he really loved. He did well in the law courses and was awarded a government fellowship in law which supported him after he completed the law course. He graduated with a law degree in\n1925\nand joined a law office as a legal clerk. He continued to officially hold this position for several years but he hardly practised law at all for he now enrolled full time in the Faculty of Philosophy, attending lectures and seminars in mathematics by\nKazimierz Kuratowski\n,\nHugo Steinhaus\nand other leading Polish mathematicians. He explained in an interview\n[\n14\n]\n:-\nIt was the student generation of\nJuliusz Schauder\n,\nMark Kac\n,\nStanisław Ulam\n,\nWładysław Orlicz\n,\nMarceli Stark\n, Henryk Auerbach, Ludwik Sternbach,\nStanisław Mazur\nand Julian Schreier. ... I was a part of that generation. Mathematics in that group of infatuated young people was kind of a fever. We would get together at all times of day and night, talking incessantly mathematics.\nHe qualified as a mathematics teacher in\n1926\nand taught for the year\n1926\n-\n27\nat the Dr Adela Karp-Fuchsowa private Gymnasium. It was not a successful year for Birnbaum who failed to keep order in his classes. He transferred to the private Lwów Evangelical coeducational gymnasium where he taught for the two years\n1927\n-\n29\n. Given good advice by an experienced teacher, his teaching improved but he had already published his first paper\nQuelques remarques sur l'intégrale de Cauchy\nⓉ\n(\nSome remarks on Cauchy's integral\n)\n(1927)\nand was participating fully in the mathematical research taking place in Café Roma and the Scottish Café. These nightly sessions\n[\n1\n]\n:-\n... turned into addictive intellectual feasts. Problems were raised, entered in the problem book which was kept by the head waiter, scribbled on marble-top tables\n(\nin pencil - ink was forbidden\n)\n, and often solved.\nDuring these years Birnbaum was working towards his doctorate advised by\nHugo Steinhaus\n. His dissertation\nZur Theorie der schlichten Funktionen\nⓉ\n(\nOn the theory of simple functions\n)\non univalent functions of a complex variable was reviewed by\nBanach\nand\nSteinhaus\nand, after taking the rigorosum, a rigorous oral examination in which the examiners could ask any mathematical questions they chose, he was awarded a doctorate in\n1929\n. Birnbaum, aware of the high reputation that Göttingen had in mathematics, had been saving up his teacher's salary so that he could spend two years there and, on the day after he was awarded his doctorate, he boarded a train in Lwów travelling to Göttingen.\nAfter arriving in Göttingen,\nEdmund Landau\nbecame his advisor, and he attended several lecture courses: differential equations given by\nCourant\n; calculus of variations given by\nCourant\n; power series given by\nLandau\n; higher geometry given by\nHerglotz\n; probability calculus given by\nBernays\n; analysis of infinitely many variables given by\nWegner\n; and attended the mathematical seminar directed by\nCourant\nand\nHerglotz\n. Soon Birnbaum was undertaking research on topics different from those he worked on for his doctorate. He published results he obtained on\nSturm\n-\nLiouville\ntheorems in\nAbschätzung der Eigenwerte eines Sturm-Liouvilleschen Eigenwert-Problems mit Koeffizienten von beschraenkter Schwankung\nⓉ\n(\nEstimating the eigenvalues of a Sturm-Liouville eigenvalue problem with coefficients of bounded variation\n)\n(1930)\nand work on approximation theorems in function space in two papers\nÜber Approximation im Mittel\nⓉ\n(\nOn approximation in the mean\n)\n(1930)\n(\nthe first written with\nWładysław Orlicz\n, the second being single-authored\n)\n. These papers, for the first time, considered approximation with regard to arbitrary means. Also with\nWładysław Orlicz\nhe published the influential work\nÜber die Verallgemeinerung des begriffes der zueinander konjugierten Funktionen\nⓉ\n(\nOn a generalization of the concept of mutually conjugate functions\n)\n(1931)\nwhere spaces now called Birnbaum-\nOrlicz\nspaces were studied. After being in Göttingen for a year,\nEdmund Landau\noffered him an assistantship. This was in\n1930\nbut the signs that the Nazis were becoming increasing powerful was clear to\nLandau\nfor, after offering the assistantship to Birnbaum, he suggested he might be unwise to accept since\n[\n1\n]\n:-\n... there was no future in Germany since he was not sure how long even he would be allowed to keep his chair.\nHe took\nLandau\n's advice seriously and decided to protect his future employment prospects by taking a course given by\nFelix Bernstein\non insurance mathematics and attended his mathematical statistics seminar. In June\n1931\nhe was offered a job working as an actuary for the Phoenix Life assurance Company. The Company's head office was in Vienna and\n[\n1\n]\n:-\nI started working there on the same day as\nEugene Lukacs\n. We were given desks facing each other and were both assigned to\nEduard Helly\nwho was to be our preceptor. This brilliant mathematician ... was a gentle, warm and cheerful human being, who made my stay at the Phoenix Life Insurance Company enjoyable and instructive in many ways. He showed me over and over again how mathematics could be used to look at a specific actuarial transaction, give it a general formulation, obtain a general solution, and make it part of an inventory of techniques to be used in similar situations in the future.\nHe returned to Lwów in\n1932\nwhen appointed as chief actuary of a Polish subsidiary of the Phoenix Life Insurance Company. He rejoined the exciting mathematical life of Lwów but now had no time to undertake research of his own. He continued with this life until\n1936\nwhen, with the economy of Europe rapidly deteriorating, first the Phoenix Life Insurance Company in Vienna was declared bankrupt and then its Polish subsidiary was put into receivership. Birnbaum continued to work for the firm while the receiver attempted to find a buyer, but he decided that, given the political situation in Germany, he should emigrate\n[\n14\n]\n:-\nI left Lwów on May\n3\n,\n1937\n, and was not to see my parents nor my sister, Franciszka seven years my junior, again. They were seen for the last time in the Bergen-Belsen concentration camp. ... An American visa was not easy to obtain. People would wait for them for ten years after filing an application. However, my cousin Ludwik Rubel, who was the editor-in-chief of the Cracow paper 'Ilustrowany Kurjer Codzienny', ... took me to the American consulate and introduced me as his newspaper's reporter. My journey took me to Vienna where I bade farewell to my relatives and acquaintances, and to Paris, where with my reporter's credentials I managed to see the World Exhibition a few days before its official opening. ... I left for America from Le Havre on the liner M S Georgia of the Cunard White Line.\nArriving in New York in June\n1937\n, Birnbaum wrote news reports for the Cracow paper for a couple of months, but he actively looked for work as a mathematician or as an actuary. He tried to contact people he got to known while in Göttingen who were now in the United States. He made contact with\nOtto Neugebauer\nat Brown University and\nRichard Courant\nin New York.\nCourant\nwas helpful but had nothing to offer Birnbaum while\nNeugebauer\nwas keen that he wrote reviews for\nMathematical Reviews\nwhich he was on the point of founding. Indeed Birnbaum began to write reviews and waited for\nFelix Bernstein\n, who was out of town, to return to New York. Eventually, he met up with\nFelix Bernstein\nwhose course on insurance mathematics he had studied while at Göttingen. The anti-Semitic policies of the Nazis had forced\nFelix Bernstein\nto emigrate and he was, by this time, professor of biometry at New York University. He offered Birnbaum a research assistant position in his department which he gladly accepted. He was required to attend lectures and work on a research project concerning\n[\n9\n]\n:-\n... a study of the connection between old age farsighted- ness, presbyopia and life length.\nBernstein\nhad, for a long time, a very strong curiosity about measurable physiological functions in humans that could be used as a yardstick for physiological age. He had arrived at the conclusion that presbyopia, the old age changing in the flexibility of the eye lens, was very strongly correlated with the all-around aging of the organism. It therefore extended some promise of being a predictor for life lengths. Whether that was realistic, I don't know. I suspected at that time that it was not so.\nLater in\n1937\n, Birnbaum began attending\nHarold Hotelling\n's seminar at Columbia University. However, after a year working for\nFelix Bernstein\n, the research funding came to an end and Birnbaum was left without an income. He started up his own statistics consulting firm, renting a room for an office and placing advertisements. He had a few customers but they only presented him with some rather strange projects. He now got to know\nSamuel Wilks\n, who was working at Princeton, tried to learn as much about statistics as he could, and began applying for every conceivable job.\nHotelling\nadvised him to apply for a job advertised at the University of Washington but said not to use him as a referee since he was not on good terms with the department there. Birnbaum got\nRichard Courant\n,\nEdmund Landau\nand\nAlbert Einstein\nto act as his referees and, after an interview in New York by the president of the New School for Social research and by the chief executive of the Sun Oil Company, he was offered an assistant professor position at the University of Washington. The only criticism he received from the interviewers was about his English accent and so, before taking up the appointment, he took a summer course to improve it.\nBirnbaum's appointment in\n1939\nat the University of Washington involved him in teaching mathematics but at the same time was given the task of setting up a mathematical statistics group. The group was set up in the Mathematics Department and only in\n1948\ngot a more formal status as the Laboratory for Statistical Research. Shortly after taking up the appointment in Seattle, he met Hilde Merzbach who was a German who had studied law but, being Jewish, had been forced to leave Germany and had joined other members of her family in Seattle. They met since both were working to assist Jewish refugees coming from Europe. She married Birnbaum in\n1940\n; they had two children Ann, born in\n1941\n, and Richard, born in\n1945\n. Hilde Birnbaum took a Master's Degree in economics at the University of Washington and looked for an academic position. The University had rules which prevented husband and wife both working at the University, so she was forced to take jobs in other colleges around the Seattle area.\nBirnbaum remained at the University of Washington until his retirement in\n1974\n, working for these\n35\nyears in the statistics group within the Department of Mathematics. The group only became a separate Department of Statistics in\n1978\n. To summarise his statistical contributions we quote from his own description in\n[\n1\n]\n:-\nOur work dealt with probabilistic inequalities, with effects of pre-selection or truncation and of non-response in sampling surveys, with properties of\nKolmogorov\n-Smirnov type and related statistics and numerical tabulations of these statistics for small sample sizes, and with the use of computers in unconventional situations.\nIn\n1962\nhe published the book\nIntroduction to probability and mathematical statistics\n. E Parzen writes:-\nThis is an introductory text on probability and statistics. The first\n163\npages provide a careful mathematical development of\nprobability theory\n.... The next\n140\npages discuss some procedures of statistical inference ... . While the emphasis throughout the book is on the statement of theorems rather than the handling of data, a number of numerical examples and exercises are given. However, the author states that the book does not aim to teach the elements of statistical technique. The book satisfactorily achieves its aim as a text for students with good mathematical background being introduced to mathematical statistics.\nHe published the report\nOn the mathematics of competing risks\nin\n1979\n. Bruce Turnbull writes:-\nThis report provides a concise account of the basic mathematical concepts and probabilistic theory of competing risks. It also describes some of the statistical methodology much of which has been developed only quite recently. ...\n[\nit\n]\nwill serve excellently someone seeking a brief introduction or a brief review of the theory of competing risks.\nBirnbaum received a number of honours including being elected a fellow of the Institute of Mathematical Statistics in\n1949\n, the\nAmerican Statistical Association\n, and the International Statistical Institute. He was president of the Institute of Mathematical Statistics in\n1964\n. His greatest honour was the award of the\nS S Wilks\nMedal of the\nAmerican Statistical Association\nin\n1984\nfor:-\n... his theoretical research, wide applications, leadership, inspiration and teaching.\nLet us end by quoting from\n[\n1\n]\nthe range of Birnbaum's activities:-\nIn the course of years I have served as consultant for airplane manufacturers and for companies engaged in managing radioactive waste, for government agencies, as expert witness in law suits, as editor of professional journals, as consulting editor to publishers, and have found this variety of activities stimulating and exciting, with a strong appeal to my sense of adventure.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Kazimierz Kuratowski",
    "Hugo Steinhaus",
    "Juliusz Schauder",
    "Mark Kac",
    "Stanisław Ulam",
    "Władysław Orlicz",
    "Marceli Stark",
    "Stanisław Mazur",
    "Banach",
    "Steinhaus",
    "Edmund Landau",
    "Courant",
    "Landau",
    "Herglotz",
    "Bernays",
    "Wegner",
    "Sturm",
    "Liouville",
    "Orlicz",
    "Felix Bernstein",
    "Eugene Lukacs",
    "Eduard Helly",
    "Otto Neugebauer",
    "Richard Courant",
    "Neugebauer",
    "Bernstein",
    "Harold Hotelling",
    "Samuel Wilks",
    "Hotelling",
    "Albert Einstein",
    "Kolmogorov",
    "probability theory",
    "American Statistical Association",
    "S S Wilks"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}