{
  "nome_completo": "Willem Jacob 'sGravesande",
  "nome_curto": "Willem 'sGravesande",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/SGravesande/",
  "data_nascimento": "26 September 1688",
  "local_nascimento": "'sHertogenbosch, Netherlands",
  "data_morte": "28 February 1742",
  "local_morte": "Leiden, Netherlands",
  "summary": "Willem 'sGravesande was a Dutch mathematician who expounded Newton's philosophy in Europe.",
  "biografia": "Willem 'sGravesande\n's family were originally named Storm van 'sGravesande and even later members continued with the old form of the name, for example Laurens Storm van 'sGravesande was governor of Essequibo from\n1742\nto\n1772\n. Willem's early education was at home with a private tutor named Tourton who was employed to educate Willem and his brothers. Tourton saw that Willem had considerable mathematical talents and he was able to encourage him in that direction even though Willem was expected, as were his brothers, to make a career in the legal profession. He studied law at Leiden University, entering the university in\n1704\n. He wrote a doctoral thesis on 'suicide' and submitted it in\n1707\n.\n'sGravesande and his brothers all became lawyers, practising in The Hague. He maintained an interest in mathematics and science, however, and published\nEssai de perspective\nⓉ\n(\nEssay on perspective\n)\nat Leiden in\n1711\n(\nsee\n[\n3\n]\nfor details\n)\n. He was influential in the setting up of the periodical\nJournal littéraire de la Haye\nin\n1713\n. This journal gave him a natural vehicle for his writings and he contributed several book reviews and essays which were published there. His essays show that he was thinking about problems of the day in quite deep philosophical terms. The most famous of these essays, which was published in volume\n12\nof the journal, was\nEssai d'une nouvelle théorie du choc des corps fondée sur l'expérience\nⓉ\n(\nEssay on a new theory of the collision of bodies based on experience\n)\n. In this essay 'sGravesande discussed one of the major problems of the day, namely that of\nvis viva\n, or living force, which is a\n17\nth\ncentury concept of energy. There were two rival theories, one due to\nHuygens\nand\nLeibniz\n, the other due to\nDescartes\n. The first considered the force acting on a body integrated over the distance travelled, the second integrated over the time. In his essay 'sGravesande argued in favour of the\nHuygens\n-\nLeibniz\ninterpretations stating:-\nThe force of a body is proportional to the mass multiplied by the square of its velocity.\nSamuel Clarke\nattacked the ideas that 'sGravesande presented in this essay, but 'sGravesande was able to reply with a robust defence of his ideas.\nAppointed as secretary to the Dutch Embassy, he was sent to England in\n1715\nto congratulate George I on has accession to the throne. While in London he was elected a Fellow of the\nRoyal Society\non\n9\nJune\n1715\n. He got to know\nNewton\n, Desaguliers and\nJohn Keill\nat this time and, after returning to The Hague in\n1716\n, he continued to correspond with\nKeill\n. In\n1717\n'sGravesande became professor of mathematics and astronomy at the University of Leiden. In addition, he became professor of philosophy there in\n1734\n[\n1\n]\n:-\nBy this time Hermann Boerhaave and sGravesande were established as the twin luminaries of Leiden, attracting hundreds of foreign students each year. From the outset of his teaching in both physics and astronomy 'sGravesande modelled his lectures on the example of\nNewton\nin the 'Principia' and 'Opticks', although in later years they incorporated other influences, especially that of Boerhaave. Moreover, he adopted from\nKeill\nand Desaguliers the notion of demonstrating to his classes the experimental proof of scientific principles ...\n'sGravesande taught and wrote many texts on Newtonian science and\nKeill\n's contributions. He wrote textbooks on mathematics and philosophy. For example he wrote a textbook to teach mathematics which he published in\n1725\n. His writings on philosophy proved somewhat more controversial: for example the philosophy textbook he published in\n1736\nwas highly criticised for his treatment of necessity and freewill. The Latin text, however, enhanced his reputation as a teacher and was translated into Dutch and English. He also published and edited works written by others, for example the\nOpera varia\nⓉ\n(\nVarious works\n)\nand\nOpera reliqua\nⓉ\n(\nOther works\n)\nby\nHuygens\n, several works by\nKeill\nand the\nArithmetica universalis\nby\nNewton\n. This work of\nNewton\nwas published by 'sGravesande in\n1732\nand four years later Voltaire, another strong supporter of\nNewton\non the Continent, travelled to Leiden to have 'sGravesande approve his own work on\nNewton\nElémens de la philosophie de Newton\nⓉ\n(\nElements of Newton's philosophy\n)\n. Voltaire wrote after his visit of both the kindness and the scholarship shown by 'sGravesande.\nThe most influential of sGravesande's publications was the two volume book\nMathematical Elements of Physics\npublished first in Leiden in\n1720\nand\n1721\n. The book was written in Latin and entitled\nPhysices elementa mathematica, experimentis confirmata, Sive introductio ad philosophiam Newtonianam\nⓉ\n(\nPhysical elements of mathematics, the experiments performed as an introduction to Newtonian philosophy\n)\nbut an English translation was quickly made by Desaguliers and the two volumes were each published in the same year as their Latin original. The book went through many editions and 'sGravesande put much effort into the continual updating of the work. The book was popular in Britain and Germany but, although a French translation was prepared and published in\n1746\n, as might be expected, the work did not gain the same popularity in France. Newtonian physics was criticised by most Frenchmen as they rallied behind\nDescartes\n. 'sGravesande begins his text by claiming:-\nI have thought fit to make good the Newtonian method, which I have followed in this work.\nHe also claims:-\nIn physics we are to discover the laws of nature by phenomena, then by induction prove them to be general laws; all the rest is to be handled mathematically.\nHere, of course, he is arguing that experiments will provide the basis for understanding physical laws rather than producing laws though pure thought. Volume I of the text includes:-\n... the theory of matter, elementary mechanics, the five simple machines,\nNewton\n's laws of motion, gravity, central forces, hydrostatics, hydraulics, sound, and wave motion.\nVolume II includes:-\n... three chapters of fire\n(\ncontaining electricity\n)\n, two books on optics, one on the system of the world, and a final book entitled \"The physical causes of the celestial motions\".\nThe motion of the planets, he claims, is due to universal gravitation, by the cause of gravity remains a mystery to him:-\n... and cannot be deduced from laws that are known.\nA rather strange episode occurred in\n1721\nwhen 'sGravesande visited Kassel to examine a machine invented by Orffyreus which purported to be capable of perpetual motion. He was invited by the landgrave of Kassel to pass judgement of whether the machine was genuine or whether Orffyreus was a fraud. 'sGravesande could find no evidence that deception was involved, and also seems to have believed that such a device would not contravene the laws of physics. Following his examination of the machine he wrote\nLettre à Mr Newton sur une machine inventée par Orffyreus: Remarques touchant le mouvement perpétuel\nⓉ\n(\nA letter to Mr Newton on a machine invented by Orffyreus: Remarks concerning perpetual motion\n)\n.",
  "matematicos_citados_na_biografia": [
    "Huygens",
    "Leibniz",
    "Descartes",
    "Samuel Clarke",
    "Royal Society",
    "Newton",
    "John Keill",
    "Keill"
  ],
  "imagens": [
    "sgravesande.jpg"
  ]
}