{
  "nome_completo": "William Hunter McCrea",
  "nome_curto": "William McCrea",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/McCrea/",
  "data_nascimento": "24 December 1904",
  "local_nascimento": "Dublin, Ireland",
  "data_morte": "25 April 1999",
  "local_morte": "Lewes, Sussex, England",
  "summary": "William Hunter McCrea was an English astronomer and mathematician whose research on the composition of the Sun and on star formation led to the development of the big bang theory.",
  "biografia": "William McCrea\nwas known as Bill to his friends and colleagues. He was born in Dublin and remained proud of his Irish roots throughout his life. His parents were Robert Hunter McCrea and Margaret Hutton; Bill was the eldest of their children. Robert McCrea was a schoolmaster who moved to England when Bill was two years old. The family moved briefly to Kent, but settled in Derbyshire, when Robert was appointed to a teaching post at Staveley Grammar School. Bill's primary education was at Chesterfield Central School and his secondary education was at Chesterfield Grammar School. After winning an entrance scholarship to study mathematics at Trinity College, Cambridge, he studied the Mathematical Tripos there and was awarded his degree in\n1926\n[\n4\n]\n:-\nHe specialised in those branches of mathematical physics that were stimulating exciting research at Cambridge, and after graduating he began research as one of the many pupils of\nR H Fowler\nFRS\n(\nlater Sir Ralph Fowler\n)\nto whom he paid warm tribute on his centenary in\n1980\n.\nHis talents were quickly appreciated at Cambridge and in\n1927\nhe was awarded the Cambridge University\nRayleigh\nPrize in Mathematics, a Trinity College\nRouse Ball\nSenior Studentship, a Sheepshanks Exhibition in Astronomy, and an\nIsaac Newton\nStudentship. In\n1928\nhe was awarded\nRouse Ball\nTravelling Studentship which enabled him to spend the year\n1928\n-\n29\nat the University of Göttingen in Germany. His first research topic involved applying advanced mathematical methods to the study of quantum theory and relativity. Later, however, he became interested in a theoretical study of the sun. In\n1929\nhe was awarded his doctorate after submitting his thesis\nProblems concerning the outer layers of the sun\n[\n6\n]\n:-\nAt that time, it was still commonly believed that the main constituent of the sun was iron. In\n1928\nMcCrea followed up a suggestion by Cecilia Payne and by the German astronomer Albrecht Unsöld that in fact hydrogen was dominant. He proved conclusively that this was right in a paper which gave perhaps the first qualitative correct model of the solar atmosphere, with the currently accepted abundance of about three-quarters hydrogen and one-quarter helium by mass, and led to a series of equally authoritative papers on the atmospheres of other stars.\nAfter the award of his doctorate he was appointed as a lecturer in mathematics at the University of Edinburgh. In Edinburgh his professor was\nEdmund Whittaker\nwho had himself a major interest in astronomy having spent six years as Royal Astronomer in Dublin before his appointment to the chair in Edinburgh. However,\nWhittaker\nwas not the person in the department to interact most closely with McCrea, rather it was\nGeorge McVittie\nwho was undertaking research under\nWhittaker\n's supervision. McCrea was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1931\n. While holding the lectureship in Edinburgh he met Marian Nicol Core Webster who was the second daughter of Thomas Webster, an Edinburgh mining engineer. After holding the lectureship in mathematics in Edinburgh for two years, he was appointed Reader in Mathematics at Imperial College, London, then in\n1936\nhe was named Professor of Mathematics at Queen's University Belfast. While at Imperial College he married Marian on\n28\nJuly\n1933\n; they had three children, Isabella, Sheila and Roderick. Also in\n1933\nhe achieved one of his most significant contributions to cosmology when his joint work with\nEdward Milne\nshowed how to approximate relativistic models of the expanding universe by Newtonian models.\nIn\n1935\nMcCrea published\nRelativity Physics\n, a little book of less than\n100\npages. He writes in the Introduction that his aim in writing the book is to:-\n... provide an accessible account of the deduction of results of relativity theory which find common application in physics.\nThe book studies results all taken from the theory of special relativity which are described in terms of three-dimensional vector notation. The work was highly successful and a second edition was published in\n1948\nwith a third edition two years later and a final edition in\n1954\n.\nIn\n1936\nMcCrea was named Professor of Pure Mathematics at Queen's University Belfast. He published his second book in\n1942\nwhich was\nAnalytical Geometry of Three Dimensions\n. This was in the\nOliver and Boyd\nseries and McCrea writes in the Preface:-\nThis book is based upon a short course of lectures to first-year Honours students who have just completed a course on Algebra approximating to that covered by Dr\nAitken\n's 'Determinants and Matrices' in these Texts, and who will have later in their curriculum a course of modern projective geometry. While the original lecture notes have been drastically revised so that the book may, one hopes, meet the needs also of students whose courses are differently arranged, it is still designed primarily for students at about the same stage as those to whom the lectures were addressed.\nThis explanation, as well as the smallness of the book, will account for various omissions. For instance, homographic correspondence is not introduced, largely on the ground that it plays its fundamental part in non-metrical geometry which the student will normally encounter at a later stage. On the other hand, it is hoped that the topics included will be found to be treated with a reasonable standard of rigour. In particular, care has been taken to frame the theory so that it does strictly apply to real space. This explains the avoidance of certain familiar short-cuts, which actually depend on jumping difficulties about reality conditions.\nThe book purports to be a \"University Text.\" This presumably means that it will normally be used in conjunction with lectures or other personal instruction. It would therefore seem merely foolish to include the sort of additional explanation, illustrated by \"trivial\" examples, which is more appropriately given by word of mouth. At any rate, the author has felt justified in assuming that the majority of readers will not be working entirely without supervision, and has allowed this assumption to influence his manner of presenting the subject.\nIt was a remarkably successful text with a second revised edition being published in\n1947\n. He wrote the following Preface:-\nThis edition differs from the first by the inclusion of a small number of new examples designed to amplify some of the discussion in the text. In these additions I have been glad to take advantage, in so far as my treatment of the subject had prepared the way for me to do so, of some suggestions kindly made by Professor\nH S M Coxeter\nand Professor\nA G Walker\n.\nThe second edition was republished in\n1953\n, then again in\n1960\nand finally reprinted by\nDover Publications\nin\n2006\n. McCrea's later books are\nPhysics of Sun and Stars\n(1950)\n,\nCosmology\n(1969)\n,\nThe Royal Greenwich Observatory\n(1975)\n, and\nHistory of the Royal Astronomical Society,\n1920\nto\n1980\n(1987)\n.\nIn\n1943\n, during World War II, McCrea was given leave from Belfast so that he could contribute to the war effort by solving operational research problems with Patrick Blackett's team at the Admiralty - he reached the rank of Captain.  After the war ended, he remained with the Admiralty for a while. His year in Göttingen while he was a research student meant that he was a fluent German speaker, so he was sent to Schleswig Holstein to interview German naval officers. When his war service ended he did not return to Belfast since he had been appointed professor of mathematics at Royal Holloway College, London in\n1944\nwhile working for the Admiralty. In\n1946\nhe took up the appointment at Royal Holloway College, remaining there for\n20\nyears. In\n1966\nhe was appointed professor of theoretical astronomy at the newly founded University of Sussex. He retired in\n1972\nbut remained active as professor emeritus for a further\n25\nyears. Longair writes\n[\n3\n]\n:-\nFrom the\n1950\ns, he pressed for the establishment of a national institute for theoretical astronomy and this led to the formation of the Institute of Theoretical Astronomy in Cambridge, the first Director being Fred Hoyle. The somewhat smaller Astronomy Centre at Sussex, where he became the first Research Professor of Astronomy in\n1966\n, was founded at the same time. Bill was central to maintaining active links between the Astronomy Centre and the Royal Greenwich Observatory, then located at Herstmonceux. Jointly, an outstandingly successful Masters Course in Astronomy was run for many years which gave students the opportunity of converting themselves into potential astronomy research students from a variety of diverse backgrounds. In the\n1980\ns, Bill was energetic in trying to retain the Royal Greenwich Observatory at Herstmonceux. Its subsequent move to Cambridge and its final closure in\n1998\nwere matters of great sorrow to him.\nWe have already mentioned McCrea's work on the mechanical equilibrium of the solar chromosphere and in more generally on solar atmospheres. He also worked throughout his whole career on the physics and the dynamics of stellar formation, and also of planetary formation. In particular he studied the interaction between a star and the interstellar medium surrounding it, showing in particular how a slow moving moderate sized star could become a massive high luminosity star through accretion if it moved through a gas cloud. We have mentioned his text on relativity, but he also published many papers on the topic. In particular he wrote on the 'twin paradox' of relativity which states that the space-travelling member of a pair of twins would age less than the twin who remained on the earth. It is called a paradox since each twin's view of the other is the same. However acceleration is not relative, something misunderstood by some writers. McCrea convincingly showed there is no paradox, and the space-travelling twin would indeed age less\n(\nsomething now verified by experiments of sending accurate clocks into space and back\n)\n. He also worked on cosmology and\n[\n6\n]\n:-\n... was one of the few people to take seriously the steady-state theory developed by\nHermann Bondi\n, Thomas Gold and\nFred Hoyle\n, and he showed how to treat the theory within the framework of general relativity. He later accepted that the theory was ruled out by observational evidence, but he never completely espoused the alternative big bang model and latterly he became increasingly sceptical about all cosmological models.\nMcCrea received many honours and we can list only a few in what follows. He was awarded honorary degrees from the National University of Ireland, the Queen's University of Belfast, the National University at Cordoba, Argentina, the University of Dublin, and the University of Sussex. He was elected a fellow of the\nRoyal Astronomical Society\nin\n1929\n, was Secretary\n(1946\n-\n1949)\n, President\n(1961\n-\n1963)\n, Foreign Correspondent\n(1968\n-\n1971)\nand Treasurer\n(1976\n-\n1979)\n, and was awarded their Gold Medal in\n1976\n. We noted above that he was elected a fellow of the\nRoyal Society of Edinburgh\n(\nproposed by\nSir Edmund Taylor Whittaker\n,\nSir Charles Galton Darwin\n,\nEdward T Copson\n, and\nCharles Glover Barkla\n)\nand he was awarded their Keith Medal\n1939\n-\n41\n. He was also President of Section A of the\nBritish Association for the Advancement of Science\n,\n1965\n-\n1966\n. He received a Knighthood in the\n1985\nNew Years Honours and made a Freeman of the City of London in\n1988\n.\nIn\n[\n4\n]\nMcCrea's character is summed up as follows:-\nBill McCrea was a kindly, slightly shy man, but with hidden reserves of strength, remaining intellectually active into his nineties. His personal integrity was patent; his public services, especially to the\nRoyal Astronomical Society\n, were so much appreciated because everyone trusted him instinctively. His somewhat formal manner was rather misleading; he was in fact a gregarious figure, especially committed to the\nRoyal Astronomical Society\nand the\nRoyal Society\nDining Clubs. His daughter Isabella recalls two things that greatly saddened him - that he did not live to see the next century, and that he would not live to be\n100\nyears old. His passing was mourned world-wide by colleagues and friends, and not least by former undergraduate and graduate students, who recalled with gratitude his help and warm encouragement.",
  "matematicos_citados_na_biografia": [
    "R H Fowler",
    "Rayleigh",
    "Rouse Ball",
    "Isaac Newton",
    "Edmund Whittaker",
    "Whittaker",
    "George McVittie",
    "Royal Society of Edinburgh",
    "Edward Milne",
    "Aitken",
    "H S M Coxeter",
    "A G Walker",
    "Hermann Bondi",
    "Fred Hoyle",
    "Royal Astronomical Society",
    "Sir Edmund Taylor Whittaker",
    "Sir Charles Galton Darwin",
    "Edward T Copson",
    "Charles Glover Barkla",
    "British Association for the Advancement of Science",
    "Royal Society"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}