{
  "nome_completo": "William Molyneux",
  "nome_curto": "William Molyneux",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Molyneux_William/",
  "data_nascimento": "17 April 1656",
  "local_nascimento": "Dublin, Ireland",
  "data_morte": "11 October 1698",
  "local_morte": "Dublin, Ireland",
  "summary": "William Molyneux was an Irish scientist and philosopher who worked on optics.",
  "biografia": "William Molyneux\n's parents were Captain Samuel Molyneux\n(1616\n-\n1693)\nand Anne Dowdall. Captain Samuel Molyneux was a lawyer, master gunner, landowner of English ancestry and also a skilled mathematician.  His ancestry was strongly reinforced by his being a Protestant, making him a member of the \"English ruling class.\" William was the second of his parent's seven children; five sons and two daughters. At this point we should mention in particular his younger brother Thomas Molyneux\n(1661\n-\n1733)\nwho played a significant part in William's short scientific life.  William was educated at home by a private tutor, then attended a grammar school in Dublin. At the age of fourteen, he matriculated at Trinity College, Dublin on the\n10\nApril\n1671\nwhere he took courses in mathematical and scientific topics\n[\n6\n]\n:-\nThe young student spent most of his leisure hours reading the works of Bacon,\nDescartes\n,\nGassendi\n, and Digby, as well as the 'Philosophical Transactions of the Royal Society.'\nHe graduated B.A. on\n27\nFebruary\n1674\nat age seventeen and was sent to London by his father to study law at the Middle Temple.\nMolyneux spent three years in London, but he could not summon up too much enthusiasm for the law, writing\n[\n6\n]\n:-\n... my inclination to the study of the law was not so strong as to make me master of the profession.\nWhen he returned to Dublin, he married Lucy Domville, the youngest daughter of Sir William Domville the attorney-general for Ireland, on\n19\nSeptember\n1678\n. Lucy was\n[\n3\n]\n:-\n... a lady noted for intelligence, amiability, and great beauty, but who fell ill months after the marriage, became blind, and lived in pain until her death in\n1691\n.\nIn fact her illness struck her in November\n1678\nbut the leading doctors of the day in London could find nothing to help her. Molyneux was devastated and he turned to the study of mathematics, his favorite topic, in an attempt to block out his frustration at seeing his young wife suffer. He translated pieces by\nDescartes\nduring the winter of\n1679\n-\n80\nwhich he published under the title\nSix Metaphysical Meditations\nin the spring of\n1680\n. Molyneux began to correspond with\nJohn Flamsteed\nand explained to him how difficult it was to undertake scientific investigations in Ireland. In a letter written in September\n1681\nhe writes\n[\n6\n]\n:-\nLiving here in a Kingdom barren of all things, but especially of ingenious artificers, I am wholly destitute of instruments that I can rely on.\nIn the following year he collaborated with Moses Pitt undertaking to gather the data for the Irish section in the\nEnglish Atlas\nthat Pitt was working on. It was an ambitious undertaking requiring data on climate, soils, minerals, ancient monuments, population, customs and trade. The project came to an end in\n1685\nwhen Pitt was arrested and burnt all that he had written. Before this, however, in the spring of\n1683\n, his brother Thomas had travelled to Leyden spending some time in London on his journey. The brothers corresponded particularly about the meetings of the\nRoyal Society\nthat Thomas attended. William asked Thomas to describe the fellows he had met and among those Thomas gave was\nFlamsteed\n, a\n[\n6\n]\n:-\n... free, affable and humble man, not at all conceited or dogmatical.\nRobert Hooke\nhe described as:-\n... the most ill-natured, self-conceited man in the world ... pretending to have all other inventions when once discovered by their authors to the world.\nWe have mentioned this correspondence since it is likely that it was this that gave William Molyneux the idea of founding a similar society in Ireland. Certainly by October\n1683\nthings were moving. He wrote\n[\n6\n]\n:-\nI first brought together about half a dozen, that met weekly in a private room of the coffee-house, on Cork Hill, merely to discourse of philosophy, mathematics, and other polite literature, as things arose obiter, without any settled rules or forms.\nHe wrote to his brother Thomas, who was in Leiden:-\nI have also here promoted the rudiments of a society for which I have drawn up rules ... About half a score or a dozen of us have met about twelve or fifteen times, and we have very regular discourses concerning philosophical, medical and mathematical matters.\nOne of their first projects, proposed by Molyneux, was to collaborate with societies in London and Oxford to observe the solar eclipse of July\n1684\n. The 'Dublin Philosophical Society for the Improvement of Natural Knowledge, Mathematics and Mechanics' was officially founded in\n1684\nbut, having no publication, the members tended to publish in the\nPhilosophical Transactions of the Royal Society\n. Molyneux himself published\n13\narticles in the\nPhilosophical Transactions\n.\nMolyneux was appointed Chief Engineer and Surveyor-General of the King's Buildings and Works in Ireland in\n1684\nand, in the following year, as part of his duties he went to Flanders to study fortresses there. On his journeys he met, among others,\nHuygens\nin The Hague, Leeuwenhoek in Delft, and\nJean-Dominique Cassini\nat the Paris Observatory. He was shown a range of instruments including microscopes and telescopes. On his return he visited London in September\n1685\n, visiting\nFlamsteed\n. However he went with\nEdmond Halley\nwhich was unfortunate since\nFlamsteed\ndisliked\nHalley\nintensely. On\n3\nFebruary\n1686\nMolyneux was elected a fellow of the\nRoyal Society\n. Later in\n1686\nthe Dublin Philosophical Society's plan to obtain a Royal Charter was thwarted by the Roman Catholic Lord Lieutenant Richard Talbot. The Society ceased to operate in\n1687\n.\nPolitical events became even more dramatic when James II, King of Britain, was deposed since he was a Roman Catholic. He fled from England to France in\n1688\n, then crossed to Ireland landing at Kinsale in\n1689\n. In Parliament the Acts of Settlement and Explanation were repealed and provision was made for the restoration of expropriated Catholics. William and his younger brother Thomas Molyneux and other Protestant members of the Dublin Philosophical Society had both seen the trouble coming and had left Dublin in January\n1689\n. Both Molyneux brothers went to Chester where they remained until December\n1690\n. William III had landed in Ireland to oppose James and the people joined sides according to their religious affiliation. After his defeat at the Battle of the Boyne in\n1690\n, James fled to France, Molyneux returned to Dublin where he played a political role appointed a commissioner of army accounts. James' Catholic supporters continued the fight until defeated at Aughrim and were forced to surrender in\n1691\nat Limerick.\nWilliam Molyneux's son\nSamuel Molyneux\nwas born on\n18\nJuly\n1689\nwhile Molyneux and his wife Lucy were in Chester. Lucy remained in Chester with Samuel when her husband returned to Dublin in December\n1690\nbut they followed him to Dublin in January\n1691\n. Lucy sadly had only a few months left for she died on\n9\nMay\n1691\n. Molyneux had completed work on his book\nDioptrica Nova\nwhile in Chester. The book had the full title\nDioptrica Nova, A treatise of dioptricks in two parts, wherein the various effects and appearances of spherick glasses, both convex and concave, single and combined, in telescopes and microscopes, together with their usefulness in many concerns of humane life, are explained\n; It was published in the first months of\n1692\n. The first part of the book consists of telescope optics, microscopes, and magic lanterns. It presents\n59\npropositions, three of which were due to\nFlamsteed\n, and Molyneux acknowledges this. He had obtained\nFlamsteed\n's permission to include them but somehow\nFlamsteed\nwas displeased and their friendship came to an end at this point. The second part of the book contains miscellaneous material such as refraction and light, grinding lens for telescopes, how to find foci of lenses, testing a telescope, an the relationship between the focal lengths of the objective and the eyepiece. In an often quoted passage he writes:-\nI come now to the last thing proposed concerning telescopic-sights; and that is, to show the dioptrick-reason of their performance and exactness. ... 'Tis manifest by experiments, that the ordinary power of man's eye extends no farther than perceiving what subtends an angle of about a minute, or something less. But when an eye is armed with a telescope, it may discern an angle less than a second. The telescope that magnifies distinctly the appearance of a body, magnifies also distinctly the appearance of extension, space, and motion through this space; so if the minute- hand of a watch, which can but just be perceived to move, be looked upon with a magnifying-glass, we shall see it give a considerable leap at every stroke of the balance. And thus likewise the slow diurnal motion of the sun or stars, which is hardly perceivable by the bare eye ... is most easily perceived through an ordinary telescope of\n18\ninches long: insomuch that we may determine to the greatest niceity and exactness, when a star passes just over the cross-hairs, even to the single beat of a second-pendulum. And let an object in the heavens rise never so little ... and the eye, by means of the eye-glass, perceives this motion, be it never so small.\nThe defeat of James led to the eventual reestablishment of the Dublin Philosophical Society in\n1693\nbut by this stage Molyneux was one of the Dublin University representatives in the Irish House of Commons having been elected on\n17\nSeptember\n1692\n. Another important stage of his life was also reached in\n1692\nfor in that year he began to correspond with John Locke having read his\nEssay concerning human understanding\n(1690)\n. Molyneux proposed to Locke what is now known as the 'Molyneux Problem':-\nSuppose a blind man learnt to distinguish between a cube and a sphere by touch, then recovered his sight and was shown a cube and a sphere. Would be able to correctly name them without touching them?\nMolyneux and Locke were both empiricist, so believed that all knowledge comes from experiences. For them the answer to the Molyneux Problem is \"no.\" However, a rationalist believes that people are born with abilities to reason which would allow the man to recognise the cube and sphere. What do you think?\nThe period following the defeat of James was an extremely difficult one in Irish politics. Molyneux supported the government and was re-elected in the summer of\n1695\n. His most valuable political contribution, however, came in the form of the small book\nThe Case of Ireland's being Bound by Acts of Parliament in England, Stated\nwhich was published in\n1698\n. The book was dedicated to the Protestant King William II, and Molyneux made clear his support of Irish Protestants. However, he argued strongly for equal rights for Ireland, that its parliament was equal to the British parliament and Ireland must not be bound by English acts of parliament\n[\n5\n]\n:-\nThat Ireland should be bound by English acts of parliament Molyneux held to be against reason and the common rights of mankind. Consent alone could give laws force, otherwise they offended against rights of liberty and property.\nIn a letter written to Locke, he said that he had written the work in such a way that:-\nI think I have treated it with that caution and submission that it cannot justly give any offence, insomuch that I ... have presumed to dedicate it to his Majesty.\nThis was not the way that the London parliament saw it for, despite the book being dedicated to William III, they ordered that it be burned. Many see this work by Molyneux, which for the first time argues \"No taxation without representation,\" as being fundamental in the rise of the 'patriot' movements in Ireland.\nMolyneux had suffered all his life with kidney problems. After spending August and the early September\n1698\nas Locke's guest, he returned to Dublin and after a severe attack of the kidney disease, he died. He was buried in St Audoen's Church, Dublin. The authors of\n[\n9\n]\ngive this assessment of Molyneux's importance:-\nWhen Molyneux died, he left a profound and lasting heritage. He was perhaps the single most important figure in the history of Irish science, and one of great political significance. The Royal Dublin Society, the\nRoyal Irish Academy\n, the Institution of Engineers of Ireland, together with numerous other Irish professional societies such as those in mathematics, statistics, political economy, geology, botany, chemistry, physics, and other disciplines trace their origins directly to the Dublin Philosophical Society, and have at various times acknowledged the Society or Molyneux as their inspiration.",
  "matematicos_citados_na_biografia": [
    "Descartes",
    "Gassendi",
    "John Flamsteed",
    "Royal Society",
    "Flamsteed",
    "Robert Hooke",
    "Huygens",
    "Jean-Dominique Cassini",
    "Edmond Halley",
    "Halley",
    "Samuel Molyneux",
    "Royal Irish Academy"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}