{
  "nome_completo": "William James Macdonald",
  "nome_curto": "William James Macdonald",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macdonald_William/",
  "data_nascimento": "14 December 1851",
  "local_nascimento": "Huntly, Aberdeenshire, Scotland",
  "data_morte": "29 December 1941",
  "local_morte": "Edinburgh, Scotland",
  "summary": "William James Macdonald was a Scottish school teacher who was a pioneer of the introduction of modern geometry to the mathematical curriculum.",
  "biografia": "William James Macdonald\nwas the son of James Macdonald, a merchant from Huntly, and Catherine Macdonald. The family moved to St Andrews when William was young and he was educated at Madras College. Founded by Dr Andrew Bell in\n1832\n, Madras College provided an outstanding education and many families moved to St Andrews so that their children could benefit from this education. The school had grown rapidly after its foundation and when Macdonald attended the number of pupils there was many times the number of students at the University in St Andrews. Macdonald was dux of Madras College in\n1868\n.\nAfter completing his school education, Macdonald entered the University of St Andrews, giving the Latin version of his name \"Gulielmus Jacobus Macdonald\" when he matriculated. In his first year\n1868\n-\n9\nhe studied English Literature, Greek\n1\n, Latin\n1\n, and Mathematics\n1\n; in\n1869\n-\n70\nhe studied Logic, Greek\n2\n, Latin\n2\n, and Mathematics\n2\n; in\n1870\n-\n71\nhe studied Moral Philosophy, Political Economy and Mathematics\n3\n; in\n1871\n-\n72\nhe studied Natural Philosophy and Chemistry; finally in\n1872\n-\n73\nhe studied Natural Philosophy and Mathematics\n3\n. He graduated M.A. on\n30\nApril\n1873\n. Macdonald showed his outstanding abilities by gaining prizes in almost all the classes he took. He was awarded the Miller prize, which was awarded for the best work by a student in their year, in\n1870\n,\n1871\nand\n1872\n. He was also awarded the Gray Prize in\n1872\nfor his essay on\nSpectrum Analysis\nand in the same year he was awarded the Arnott prize.\nAfter graduating, Macdonald was appointed as an assistant in the Mathematics Department in Madras College. He only taught there for a short time before accepting an appointment as Mathematics Master at Merchiston Castle School in Edinburgh. In\n1880\nhe moved schools, but remained in Edinburgh, when he went to Daniel Stewart's College. He spent the rest of his career at this College.\nHe was a pioneer in the introduction of modern geometry into the mathematical curriculum, and his book\nA Higher Geometry\nwas widely used in schools and colleges. Macdonald also acted as an external examiner in mathematics for the University of St Andrews for two periods of three years.\nIn June\n1914\nthe Senatus Academicus of the University of St Andrews resolved to confer the degree of LL.D. to William James MacDonald, M.A., F.R.S.E. The citation for the award noted that MacDonald was:-\n... lately Mathematical master in Daniel Stewart's College, Edinburgh. A graduate in Arts of St Andrews, he had held the mathematical mastership in Daniel Stewart's College for upwards of thirty years. He is author of \"A Higher Geometry.\" He was President of the Edinburgh Mathematical Society\n1888\n-\n9\n, and President of the Scottish Secondary School Teachers' Association\n1898\n-\n9\n.\nHowever, Macdonald respectfully declined the honour. He did accept a fellowship of the\nRoyal Society of Edinburgh\n, becoming a fellow on\n1\nFebruary\n1886\n. He was proposed by William Swan,\nJohn Sturgeon Mackay\n,\nGeorge Chrystal\n, and\nSir Thomas Muir\n.\nMacdonald was a founder member of the\nEdinburgh Mathematical Society\n, joining at the first meeting of the Society in February\n1883\n. He was honoured by the Society when elected president for session\n1887\n-\n88\n. Examples of papers Macdonald read to the Society are:\nAn account of Pascal's \"Essais pour les Coniques\"\n(\nFriday\n14\nMarch\n1884)\n;\nA proof of a geometrical theorem\n(\nFriday\n11\nFebruary\n1887)\n; and\nA Suggestion for Improvement of Mathematical Tables\n(\nFriday\n8\nMarch\n1895)\n. He also acted as editor of the\nProceedings\nof the\nEdinburgh Mathematical Society\nin\n1896\n-\n97\n.\nMacdonald's death was recorded with the following announcement on Wednesday\n31\nDecember\n1941\n:-\nMacdonald - At\n15\nComiston Drive. Edinburgh, on\n29\nth\nDecember\n1941\n. William James Macdonald, in his\n91\nst  year, late mathematical master, Daniel Stewart's College. Funeral today\n(\nWednesday\n)\n,\n31\nDecember to Morningside Cemetery. Friends wishing to attend please meet at the cemetery gate at\n3\n.\n20\npm.",
  "matematicos_citados_na_biografia": [
    "Royal Society of Edinburgh",
    "John Sturgeon Mackay",
    "George Chrystal",
    "Sir Thomas Muir",
    "Edinburgh Mathematical Society"
  ],
  "imagens": []
}