{
  "nome_completo": "William Henry Young",
  "nome_curto": "William Young",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young/",
  "data_nascimento": "20 October 1863",
  "local_nascimento": "London, England",
  "data_morte": "7 July 1942",
  "local_morte": "Lausanne, Switzerland",
  "summary": "William Young discovered Lebesgue integration, independently but two years after Lebesgue. He studied Fourier series and orthogonal series in general.",
  "biografia": "William Young\n's father was Henry Young, a grocer, and his mother was Hephzibah Jeal. William was his parents' eldest son and he was brought up by his parents as a Baptist. He attended the City of London School where the headmaster was particularly fascinated by mathematics. This headmaster was\nEdwin A Abbott\n, who was the author of the famous popular mathematical work\nFlatland\n. He immediately saw the potential that Young had for mathematics and he encouraged him in that direction. In\n1881\nYoung entered Peterhouse, Cambridge, to begin his undergraduate studies of mathematics.\nAt Cambridge Young was an outstanding student showing far more mathematical ability than any of the other students in his year. However to achieve the position of First\nWrangler\n(\nthe top position in the list of First Class graduates\n)\nin the Mathematical Tripos required enormous dedication and training in the type of examination questions set in the Tripos. It would be fair to say that the First Wrangler was the most skilled at answering Tripos questions rather than the best mathematician and many of the great mathematicians who attended Cambridge failed to gain this distinction. Young was one such student for he made a very conscious decision that becoming First Wrangler was less important to him than having varied interests, both academic and sporting, at university. He was fourth wrangler in\n1884\n. While at Cambridge he put aside the Baptist religion of his family and was baptised into the Church of England.\nAlthough many famous mathematicians who attended Cambridge failed to become First Wrangler, many of those who failed did become Smith's Prizemen. However Young did not even submit an essay for this prize but submitted an essay for a theology prize instead. He won the theology prize and he decided to remain at Cambridge earning money by privately coaching students for the mathematical tripos. He did not undertake any mathematical research although he was a Fellow of Peterhouse between\n1886\nand\n1892\n. One of the students Young tutored was\nGrace Emily Chisholm\n, who studied mathematics at Girton College. She then went to Göttingen where she was supervised for her doctorate by\nKlein\n, returning in\n1895\nafter the award of the doctorate. It is extremely unlikely that Young would have ever become interested in research had it not been that he married\nGrace Chisholm\n(\nwho, of course, then became\nGrace Chisholm Young\n)\nin\n1896\n, and that\nKlein\nvisited Cambridge to receive an honorary degree in\n1897\n.\nDiscussions with\nKlein\nseems to inspire Young.\nGrace Chisholm Young\nlater wrote that after\nKlein\n's visit:-\n...\n[\nWilliam\n]\nproposed, and I eagerly agreed, to throw up lucre, go abroad, and devote ourselves to research.\nTogether the Youngs, who formed a mathematical married partnership of real significance, left Cambridge and went to Göttingen. After a few months they went to Italy, together with the first of their five children\n(\ntwo sons and three daughters\n)\n, where they lived for over a year. In September of\n1899\nthey returned to Göttingen which was then home for them until\n1908\nwhen they moved to Geneva. However Young returned to Cambridge during term time where he both taught and examined. In fact he was at different times an examiner to the Central Welsh Board\n(1902\nto\n1905)\n, the University of London, and the University of Wales, in addition to his role as examiner at Cambridge. In\n1913\nhe accepted two part-time chairs, one being the Hardinge Professorship of Pure Mathematics in Calcutta University which he held from\n1913\nto\n1917\n, the other being the Professorship of Philosophy and the History of Mathematics at the University of Liverpool which he held from\n1913\nto\n1919\n. He was the first to hold the Hardinge Professorship.\nIn\n1915\n, while holding his two part-time chairs, the Youngs moved their permanent home from Geneva to Lausanne. This remained the family's permanent home even after\n1919\nwhen Young was appointed to the chair of Pure Mathematics at the University College of Wales in Aberystwyth in Wales. He held this post until\n1923\n.\nBurkill\nwrote in\n[\n2\n]\n:-\nHe did not meet the recognition he deserved. This was due in part to his late start, and in part to a certain conservative hostility to the modern theory of real functions - a theory which few Englishmen in the early years of this century understood. Even when his profundity and originality were better appreciated, he was passed over in elections to chairs in favour of men who might be expected to be less exacting colleagues.\nYoung discovered a form of\nLebesgue\nintegration, independently but two years after\nLebesgue\n. His definitions of\nmeasure\nand integration were quite different from those which\nLebesgue\nhad given but were shown to be essentially equivalent. He studied\nFourier series\nand orthogonal series in general, the ideas which he put forward being further developed by\nLittlewood\nand\nHardy\n. His results in this area are described by Burkill\n[\n1\n]\nas:-\n... of striking simplicity and beauty ...\nPerhaps his most important contribution was to the calculus of several variables. He set out this theory beautifully in his treatise\nThe fundamental theorems of the differential calculus\n(1910)\n. All advanced calculus books now use his approach to functions of several complex variables.\nThis\n1910\nbook was one of three which Young wrote. The other two were written jointly with his wife:\nThe first book of geometry\n(1905)\nwas an elementary work clearly written by the Youngs having the teaching of mathematics to their own children in their minds, and\nThe theory of sets of points\n(1906)\n.\nYoung was widely travelled, visiting universities in Europe, America, Asia, and Africa. In\n1936\n-\n37\nhe made a major tour of South America, but with the outbreak of World War II in\n1939\nYoung found himself in the wrong place at the wrong time. He was trapped in Lausanne when France fell in\n1940\n. He was forced to spend the last two years of his life there very unhappy at being separated from his family.\nHe received many honours for his mathematical achievements despite his lack of success in obtaining prestigious chairs. He was elected a Fellow of the\nRoyal Society\non\n2\nMay\n1907\n, receiving the\nSylvester\nmedal from that Society in\n1928\n. He was president of the\nLondon Mathematical Society\nfrom\n1922\nto\n1924\n, having been awarded the Society's\nDe Morgan\nMedal in\n1917\n, and president of the\nInternational Mathematical Union\nfrom\n1929\nto\n1936\n. He received honorary degrees from the universities of Calcutta, Geneva, and Strasbourg.\nBurkill\npaints this picture of Young in\n[\n2\n]\n:-\nThe immediate and abiding impression which Young gave was one of restless vitality; it was shown in his gait, his gestures, and his words. His appearance was striking; in early married life he grew a beard, red in contrast with his dark hair, and he wore it very long in later years. Many stories were current about him, all turning on his energy, mental and physical.",
  "matematicos_citados_na_biografia": [
    "Edwin A Abbott",
    "Wrangler",
    "Grace Emily Chisholm",
    "Klein",
    "Grace Chisholm",
    "Grace Chisholm Young",
    "Burkill",
    "Lebesgue",
    "measure",
    "Fourier series",
    "Littlewood",
    "Hardy",
    "Royal Society",
    "Sylvester",
    "London Mathematical Society",
    "De Morgan",
    "International Mathematical Union"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}