{
  "nome_completo": "William Gentle",
  "nome_curto": "William Gentle",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gentle/",
  "data_nascimento": "19 January 1877",
  "local_nascimento": "Dundee, Angus, Scotland",
  "data_morte": "31 March 1964",
  "local_morte": "Edinburgh, Scotland",
  "summary": "William Gentle graduated from the University of Edinburgh and taught at George Heriot's School Edinburgh. After being wounded in World War I he returned to George Heriot's and eventually became headmaster there.",
  "biografia": "William Gentle\n's father was  William Gentle\n(\nborn in Dundee in\n1838\n; died in\n1890)\nwho was a letterpress printer. His mother was  Marion Drummond Brand\n(\nborn in Torryburn, Fife in\n1843\n; died in\n1929)\n. William Gentle had two older siblings: Alexander\n(\nborn about\n1866)\nand Margaret\n(\nborn about\n1874)\n.\nWilliam Gentle began his school education in Dundee, attending Rosebank School, Dundee, from\n1885\nto\n1887\n, then Morgan Academy, Dundee,\n1887\nto\n1889\n. His family moved to Edinburgh in\n1889\n(\nmoving to\n2\nBlackwood Crescent\n)\nand he completed his schooling at George Heriot's Hospital School. He took the Edinburgh University Leaving Certificate examinations in\n1896\n, passing Mathematics, English, and Dynamics at the Higher level, and Latin at Lower level. After having passed the Preliminary Examination, he first matriculated at Edinburgh University in October\n1896\n.\nAfter matriculating at Edinburgh University, Gentle had an outstanding undergraduate career winning bursaries and prizes. He chose not to take an M.A. but opted instead to take only a B.Sc. degree which was a bold move at a time when it was seen principally as an addition to the traditional M.A. degree. He took courses in Mathematics in\n1896\n-\n97\n, Natural Philosophy and Chemistry in\n1897\n-\n98\n, Geology from Professor Geikie in\n1898\n-\n99\nand\n1899\n-\n1900\n, then Mathematics Advanced Honours from\nProfessor Chrystal\nand Natural Philosophy Advanced Honours from Professor Macgregor in\n1901\n-\n02\n. He graduated in April\n1903\n.\nFollowing graduation, Gentle was appointed as a Mathematics and Physics Master at George Heriot's School in Edinburgh. In\n1908\nthe head of Physics at George Heriot's,\nJ B Clark\n, was appointed as headmaster of the school and Gentle replaced him as Principal Teacher of Physics at a salary of £\n250\nper annum.\nGentle took a temporary break in his career when he signed up for war service during World War I. However he was severely wounded and, after recovering, returned to George Heriot's. He married Jessie Currie Ainslie in\n1924\n. When\nJ B Clark\nretired as Headmaster in\n1926\n, Gentle was appointed to succeed him. A report of his appointment appeared in\nThe Scotsman\non Tuesday\n12\nJanuary\n1926\n:-\nHERIOT'S HEADMASTER\nMR J B CLARK'S SUCCESSOR FORMER PUPIL APPOINTED\nA special meeting of the Heriot Trust Governors was hold in Edinburgh yesterday for the special purpose of appointing a headmaster for George Heriot's School in succession to Mr J B Clark, M.A., F.R.S.E.\nThe Chairman reported that the Education Committee had considered a remit from the last meeting of the Governors as to the filling up of the vacancy. After carefully considering the matter, the Committee resolved not to advertise for candidates, but, in view of his qualifications and record, to recommend that Mr William Gentle, B.Sc., F.R.S.E., of the School staff, and present Depute-Headmaster, be appointed Headmaster in succession to Mr Clark, as from the commencement of next session at a salary of £\n1000\n. They looked forward with very great regret to Mr Clark's retirement, but changes were bound to come, and when vacancies occurred they were bound to be filled. He had very great pleasure in moving the adoption of the recommendation that Mr Gentle be appointed. He was certain that no one could read the record of Mr Gentle without being satisfied that he was undoubtedly fully qualified for the post.\nCouncillor Adam Millar, who seconded, deplored the passing of Mr Clark from the headmastership, but expressed the opinion that no better choice of a successor could have been made.\nCouncillor Wilson M'Laren, Sir Thomas Hudson Beare, and Councillor Bruce Lindsay paid like tributes to Mr Clark, and the view was expressed that Mr Gentle would prove a worthy successor. The motion was agreed to unanimously.\nMr Gentle was then called into the meeting, informed of his appointment, and congratulated. In returning thanks, he said it would be no light task to maintain the traditions which had been established by such able men as Mr Clark and the late headmaster, Dr Lowe. Such ability and energy as he possessed would be devoted wholeheartedly to the charge they had committed to his hand.\nNEW HEADMASTER'S CAREER\nMr Gentle's early education was obtained at Morgan Academy, Dundee, and at George Heriot's School. In\n1896\nhe entered Edinburgh University, and there, in addition to completing a full course for the B.Sc. degree, broadened his field of study by including a number of extra subjects, such as logic and psychology. In all his classes he obtained class distinctions. In addition to medals and prizes, he was awarded the Newton Bursary in Natural Philosophy, the Neil Arnott Scholarship, the Mackay Smith Scholarship, and the Nichol Foundation. In\n1902\nhe graduated as B.Sc. During part of his University career, and for the first six years after graduating, he acted as assistant in the mathematics and physics department of George Heriot's School, preparing pupils for the honours leaving certificate in mathematics and the intermediate and higher certificates in science.\nIn\n1908\nhe succeeded Sir Clark as head of the Physics department, and acted in this capacity during a period of rapid extension of the science work of the school. He prepared the general outline, and supervised the fitting up of the physics laboratories which were opened in\n1912\n. Throughout this period he also assisted Mr Clark with the general organisation of the school, and learned to deal with the various problems connected with classification of pupils, arrangement of curricula, distribution of staff, and general administration. Outside school work he took a keen interest in educational matters generally, and acted as president of the Association of Science Teachers of Scotland, and also as president of the local branch of that Association. In\n1915\nhe entered the Army as an officer of the Royal Field Artillery, and during the next two years had a varied and valuable experience as section commander and battery commander. He was wounded by shell fire at the Messines advance, June\n1917\n, and for the rest of the year was in hospital. In\n1916\n, being still unfit active service, and being interested in the experiments carried out by Count Rumford in connection with the feeding of the Bavarian Army, he took up the pressing problem of the feeding of troops. In this he was successful, and his charge, which included the management of the officers' mess, was rapidly increased, until at the end of six months he was asked to undertake the supply and complete distribution for\n7000\nmen.\nAs regards the Physics department of the school, he had since\n1918\ndeveloped the work of the department so as to keep in line with the rapid advances which have been made in the subject. In the matter of school management he has continued to assist Mr Clark, and has had a thorough practical experience of the work of organisation and administration. He was president of the Heriot Club from\n1920\nto\n1923\n, during which time the club was reorganised and the membership increased from about\n80\nto\n700\n. He has been a monitor of committee of various educational societies, such as the Edinburgh Branch of the Educational Institute of Scotland, the Secondary Teachers' Association, and the Science Teachers' Association. Of the two latter associations he has held the post of president. He was in\n1903\nelected a Fellow of the Royal Society of Edinburgh, and in addition a member of the\nBritish Association\n, a member of the Mathematical Society, and an Associate of the Society of Musicians.\nGentle held this post until he retired.\nWilliam Gentle was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1903\n. He was elected to the\nRoyal Society of Edinburgh\non\n21\nDecember\n1908\n, his proposers being James Gordon MacGregor, David Fowler Lowe, Thomas Burns,\nJohn Brown Clark\n.\nAn obituary, written by W McL Dewar, appears in the\nRoyal Society of Edinburgh\nYear Book\n1965\n, pages\n17\n-\n18\n.\nWe give a version of this obituary at\nTHIS LINK\n.",
  "matematicos_citados_na_biografia": [
    "Professor Chrystal",
    "J B Clark",
    "British Association",
    "Edinburgh Mathematical Society",
    "Royal Society of Edinburgh",
    "John Brown Clark",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}