{
  "nome_completo": "William Leonard Edge",
  "nome_curto": "William Edge",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Edge/",
  "data_nascimento": "8 November 1904",
  "local_nascimento": "Stockport, England",
  "data_morte": "27 September 1997",
  "local_morte": "Bonnyrigg, Scotland",
  "summary": "William Edge graduated from Cambridge and lectured at Edinburgh University. He wrote many papers on Geometry.",
  "biografia": "William Edge\n's parents were both schoolteachers. He was educated at his local school, Stockport Grammar School, and from there he went to Cambridge where he studied mathematics at Trinity College. After graduating, he continued working for his doctorate at Trinity on\nprojective geometry\n. Cambridge was at that time a centre for geometry research with\nBaker\n's school flourishing there. Edge's fellow students included\nP du Val\nand\nJ G Semple\nbut other famous geometers joined the group while Edge was at Cambridge including the slightly younger men\nH S M Coxeter\nand\nJ A Todd\n.\nAfter holding a fellowship at Trinity he was offered a lectureship at the University of Edinburgh by\nE T Whittaker\nwhich he accepted and took up the post in\n1932\n. Edge was to spend the rest of his career at Edinburgh and David Monk, writing in\n[\n2\n]\n, suggests that the reason that Edge never moved to a chair in another university was because:-\n... the Scottish hills and mountains, which he loved, kept him in Edinburgh.\nEdge played a major role in the success of the Mathematics Department at Edinburgh, first under\nWhittaker\n's and then under\nAitken\n's leadership. He formed a close friendship with both these men and supported their work with his high international reputation for research and his lecture courses packed with gems. He did not, however, find administration to his liking and he preferred to avoid this whenever possible.\nAfter studying classical geometry, Edge moved towards the topic which is most associated with him, namely finite geometry. He had an amazing geometrical feel for complex situations as well as a skill at handling intricate combinatorial arguments which were characteristic of his work.\nEdge wrote nearly\n100\npapers and his mastery of the area ranks him with\nCoxeter\nas one of the leading geometers of the\n20\nth\ncentury. His work was a continuation of work started by the great geometers of the late\n19\nth\nand early\n20\nth\ncenturies, in particular\nCastelnuovo\n,\nCayley\n,\nClebsch\n,\nCremona\n,\nFano\n,\nFricke\n,\nHumbert\n,\nKlein\n,\nPlücker\nand\nSchläfli\n.\nGeorges Humbert\ndiscovered a plane sextic curve of genus\n5\nhaving five cusps for its singular points. These have interesting geometrical properties and Edge investigated them in a series of papers spanning\n40\nyears. In\n1890\nCastelnuovo\nstudied and classified algebraic surfaces with\nhyperelliptic\nprime sections. Edge continued and completed\nCastelnuovo\n's investigations.\nCastelnuovo\nproved that a non-ruled surface whose prime sections have genus\n2\nis the projection of a non-singular rational surface of order\n12\nin projective\n11\n-space. Edge explicitly examined one such projection in a paper on\nCastelnuovo\n's normal surface.\nThe equation of the scroll of tangents of the common curve of two\nquadrics\nis due to\nCayley\nin\n1850\n.\nSalmon\n, in his famous text, gave an equation in covariant form. Edge gave a procedure for finding this equation in\n1979\n.\nBring\n's curve was first studied in\nKlein\n's\n1884\nbook in connection with the transformation to reduce the general\nquintic equation\nto the form\nx\n5\n+\ne\nx\n+\nf\n=\n0\nx^{5} + ex + f = 0\nx\n5\n+\ne\nx\n+\nf\n=\n0\n. Some of Edge's work on\nBring\n's curve extends work due to\nClebsch\n.\nEdge investigated a pencil of canonical curves of genus\n6\non a del Pezzo quintic surface in a\n5\n-dimensional projective space. He investigated the\ngroup\nof self-projectivities of the space, which is isomorphic to the\nsymmetric group\nS\n5\nS_{5}\nS\n5\n​\n. He also used geometrical configurations to investigate groups and, although his work was out of fashion at a time when group theorists were moving towards the classification of finite\nsimple groups\n, his work did provide a deeper understanding of some of these groups, for example\nConway\n's simple groups. Edge was not someone uninterested in modern techniques, however, and it may come as a surprise to some that in a\n1991\npaper he included computer-drawn pictures.\nOther topics Edge worked on, all of which exhibit his mastery of the subject, include nets of quadric surfaces, the geometry of the\nVeronese\nsurface,\nKlein\n's quartic,\nMaschke\n's quartic surfaces,\nKummer\n's quartic, the\nKummer\nsurface, Weddle surfaces,\nFricke\n's octavic curve, the geometry of certain groups, finite planes and\npermutation\nrepresentations of groups\narising from geometry.\nHis papers are almost all written as single author papers but he did collaborate with his friends\nCoxeter\nand\nDu Val\n. In fact when he attended the celebrations for\nCoxeter\nin Toronto in\n1979\nit was the first time Edge had crossed the Atlantic and he said only his great friendship with\nCoxeter\nhad made him overcome his reluctance to travel.\nI\n[\nEFR\n]\nasked Edge a few years ago if he would come to St Andrews and give a talk on the history of mathematics. He said he knew nothing of the history of mathematics. I did not give up that easily and asked him if he would not speak on\nCayley\n's mathematics. \"Never met Cayley\" replied Edge. He paused for a second before adding \"Knew his landlady though\".\nFor many years Edge was someone I\n[\nEFR\n]\nexpected to see whenever I went to the Edinburgh University Staff Club. For some reason I never quite understood, there was frequently a note on the blackboard at the entrance to the club saying there was a message for W L Edge. He was a tall straight man with an imposing figure, certainly someone whom one noticed. Typically he wore a green corduroy jacket and his hair blew about in an uncontrolled manner.\nA colleague now at St Andrews, C M Campbell, attended Edge's courses in the\n1960\ns. He described them as difficult lectures which required a lot of work to appreciate their content but, once this work had been put in, the quality and insight in Edge's lectures became apparent. Edge taught the algebra courses at Edinburgh at this time but he taught algebra with a strong geometric flavour reflecting his deep knowledge, feel and love for geometry.\nEdge had a deep concern for his students, both while they were studying at Edinburgh and after they had graduated. He kept in touch with these students in many different ways including sending his best wishes when he saw a notice of marriage in the press.\nMonk\n[\n2\n]\ndescribes Edge's lifestyle and interests outside mathematics as follows:-\nEdge never married. He lived in a succession of lodgings, carefully chosen for the quality of the cooking and space for a piano. Music was an abiding interest and he had a fine singing as well as a sonorous speaking voice.\nMore details of his music are given in\n[\n1\n]\n(\nand have been described to us in similar terms by\nLedermann\n)\n:-\nApart from mathematics his great loves were walking and music, and his lodgings had always to accommodate a grand piano. Together with\nAitken\n(\nviolin\n)\n,\nWalter Ledermann\n(\nviola\n)\nand Robin Schlapp\n(\ncello\n)\n, he formed the \"mathematical quartet\".\nThey performed in particular on the first Friday of each month that the Edinburgh Mathematical Society met. There was always a dinner for the speaker at\nWhittaker\n's house, and\nWhittaker\n, who hated small-talk, would say after dinner, \"Edge, would you care to perform?\"\nThe quartet alternated between Mozart's G minor and his E flat\n(\nhis only two piano quartets\n)\n, and played nothing else on these occasions. Edge was also a capable singer, and performed the solo in a Bach cantata for participants at one of the St Andrews colloquia ...",
  "matematicos_citados_na_biografia": [
    "projective geometry",
    "Baker",
    "P du Val",
    "J G Semple",
    "H S M Coxeter",
    "J A Todd",
    "E T Whittaker",
    "Whittaker",
    "Aitken",
    "Coxeter",
    "Castelnuovo",
    "Cayley",
    "Clebsch",
    "Cremona",
    "Fano",
    "Fricke",
    "Humbert",
    "Klein",
    "Plücker",
    "Schläfli",
    "Georges Humbert",
    "hyperelliptic",
    "quadrics",
    "Salmon",
    "Bring",
    "quintic equation",
    "group",
    "symmetric group",
    "simple groups",
    "Conway",
    "Veronese",
    "Maschke",
    "Kummer",
    "permutation",
    "representations of groups",
    "Du Val",
    "Ledermann",
    "Walter Ledermann"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}