{
  "nome_completo": "Witold Wilkosz",
  "nome_curto": "Witold Wilkosz",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilkosz/",
  "data_nascimento": "14 August 1891",
  "local_nascimento": "Kraków, Galicia, Austrian Empire (now Poland)",
  "data_morte": "31 March 1941",
  "local_morte": "Kraków, Poland",
  "summary": "Witold Wilkosz was a Polish mathematician who produced important pure mathematics, wrote textbooks, invented radio receivers, and popularised science with talks on Polski Radio.",
  "biografia": "Witold Wilkosz\nwas the son of Jan Wilkosz\n(1863\n-\n1915)\nand his wife Józefa Vopalko. Jan Wilkosz, born in Korabniki on\n27\nMay\n1863\n, became a teacher in\n1890\n, teaching first at a school in Nowy Sącz before moving to Kraków where he taught at the\n4\nth Real Gymnasium. He published a number of books on Polish poets, all aimed as school texts. He died on\n13\nMarch\n1915\nin Kraków, was given a solemn funeral and was remembered as an exemplary teacher and person.\nThe young Witold began his secondary school studies at the\n4\nth Real Gymnasium in Kraków where his father was a teacher.\nStefan Banach\nwas also a pupil at the school and the two young boys became close friends and remained close friends for the rest of their lives. Both boys were taught mathematics and physics by Kamil Kraft and they would spend their breaks working on mathematics problems. Kamil Kraft\n(1873\n-\n1945)\n, was a physician being a graduate of medicine and doctor of medical sciences of the Jagiellonian University. He also studied at the Philosophical Faculty of the Jagiellonian University and obtained the qualifications to teach physics and mathematics in gymnasiums and real schools.\nWitold was a brilliant pupil with very broad interests and, despite enjoying solving mathematical problems with\nBanach\n, he also had great linguistic skills. Marian Albiński was a fellow student and writes\n[\n1\n]\n:-\nFrom the lowest grades,\nBanach\nand Wilkosz shared a love of mathematics. During the so-called breaks I often saw them solving mathematical problems, which to me as a humanist were simply Chinese.\nBanach\n's friendship with Wilkosz was not limited to the school grounds; they also met after classes at Wilkosz's house on Zwierzyniecka Street or in the school building, and in the Kraków Planty\n[\na large city park\n]\n. In later times, it would take half the night for the excited students -\nBanach\nand Wilkosz - to walk together through the streets of Kraków when some issue occupied their minds. I did not take part in these mathematical conversations, but I often had equally long discussions with Wilkosz himself, with whom I was more close. In secondary school and after the final exams, we were united by literary interests and ... a weakness for the same female students.\nIn\n1905\n-\n06\nWilkosz and\nBanach\nwere two of the\n42\nstudents in Class IV at the\n4\nth Real Gymnasium. In the final classification, Wilkosz was one of three students to be ranked\n1\nst Class with Distinction while\nBanach\nwas one of\n25\nstudents ranked\n1\nst Class.\nAlthough\nBanach\nremained at the\n4\nth Real Gymnasium until he graduated in\n1910\n, in\n1906\n, for his final school years, Wilkosz became a pupil at the Jan III Sobieski Gymnasium in Kraków. This school had been established in\n1883\nas a tribute to King Jan III Sobieski's\n1683\nvictory over the Ottomans at the Battle of Vienna. The mathematician\nZdzisław Krygowski\nhad been a pupil at this school; he is famed for setting up the cryptology course for Poznań University mathematics students which was attended by\nMarian Rejewski\n,\nHenryk Zygalski\nand\nJerzy Różycki\nwho broke the German Enigma code. At the Jan III Sobieski Gymnasium, Witold studied European and Eastern languages, including Hebrew and Sanskrit. Albiński writes\n[\n1\n]\n:-\nWilkosz had an extraordinary talent for languages; not only did he master French and German very early on, he made extraordinary progress in Latin and Greek, mastered Esperanto in\n3\nhours, but he also studied Sanskrit, Hebrew and other Eastern languages ​​while still in secondary school.\nIn his final school year, Wilkosz wrote an essay on semitology, concerning Semitic languages and literatures, and the history of the Semitic-speaking peoples. This impressive essay earned Wilkosz membership of the Deutsche Morgenländische Gesellschaft, a society founded in\n1845\n:-\n... to promote all aspects of the knowledge of Asia and of the countries closely related to it ... the Society will deal not only with oriental literature but also with the history of these countries and the research of their situation in both earlier and more recent times.\nThe Deutsche Morgenländische Gesellschaft awarded Wilkosz a scholarship which funded his travel to Beirut where he studied languages ​​at the University of Beirut for several months. After graduating from the Jan III Sobieski Gymnasium in\n1910\nhe entered the Jagiellonian University in Kraków to study classical philology and Eastern languages. He spent two years on this study before changing his course to study mathematics. It appears that a lack of funding for overseas travel was a major factor in his decision to change topics. He spent one year studying mathematics at the Jagiellonian University in Kraków before deciding to continue his studies at the University of Turin beginning in\n1912\n. At Turin, he took courses in mathematics from\nGiuseppe Peano\n,\nGuido Fubini\nand\nCorrado Segre\n, and undertook research advised by\nGiuseppe Peano\n. In\n1914\nhe obtained a Ph.D. after submitting a thesis on the theory of\nLebesgue\nintegrals. The outbreak of World War I, however, meant Wilkosz was required to return to Kraków in\n1914\n. He undertook military service in\n1914\n-\n15\nin the Polish Legions.\nBecause of the political situation, he was unable to obtain recognition of his Italian doctorate and so he realised that he would have to register for doctoral studies at the Jagiellonian University in Kraków. His Italian thesis was never published but in that thesis he\n[\n7\n]\n:-\n... had to deal with the problem of composition of absolutely continuous functions. It turned out that the composition of two absolutely continuous functions does not have to be an absolutely continuous function, which may be surprising.\nHe had published an example to show this result in the paper\nSulle funzioni assolutamente continue\nⓉ\n(\nOn absolutely continuous functions\n)\nwhich was published by the\nAccademia dei Lincei\nin\n1915\n. It was his first paper. Following his military service, in\n1915\nhe began to study for a doctorate at the Jagiellonian University in Kraków advised by\nStanislaw Zaremba\n.\nIn\n[\n16\n]\nHugo Steinhaus\nrecalls a famous meeting in Planty Park in Kraków in\n1916\n:-\nEven though Kraków was formally a fortress, one could take walks in Planty in the evenings. During such a walk I heard the words '\nLebesgue\nmeasure' - I went to the bench and introduced myself to two young adherents of mathematics. They told me that they had another companion, Witold Wilkosz, whom they highly praised. They were\nStefan Banach\nand\nOtto Nikodym\n. Since then, we met regularly ...\nIn\n1917\n, while still working on his doctoral thesis, he took up a position as a teacher of mathematics at the Gymnasium in Zawiercie, a town of around\n30\n,\n000\ninhabitants that had received its charter in July\n1915\n.\nIn\n1918\nhe submitted his thesis\nZ teorii funkcji absolutnie ciągłych i całek Lebesgue'a, praca doktorska, rękopis z archiwum rodzinnego\nⓉ\n(\nOn the Theory of Absolutely Continuous Functions and Lebesgue Integrals, Ph.D. Thesis, Manuscript from Family Archives\n)\nto the University of Kraków and was awarded his doctorate. The thesis was never published but was preserved in the family archives. Krystyna Rakoczy-Pindor and Ewa Szostak studied this work and published the paper\n[\n7\n]\nin\n2007\nin which they give full details of the contents of the thesis. They write in their introduction:-\nAt that time, the theory of absolutely continuous functions and\nLebesgue\nintegrals was a particularly important problem, because there was a lack of theorems on substitution in the\nLebesgue\nintegral, analogous to theorems for the\nRiemann\nintegral. The work concerns only the\nLebesgue\nintegral on the real line. Its key concept is the concept of an absolutely continuous function. In all theorems on substitution proved in this work, the assumption of absolute continuity of the integrand is the most important, which is why the author precedes these theorems with a chapter devoted to the properties of absolutely continuous functions.\nAfter teaching at the Gymnasium in Zawiercie, Wilkosz took up a teaching position in Częstochowa, about\n150\nkm north west of Kraków. Częstochowa had been controlled by the Germans during World War I but in November\n1918\nPoland's independence had been re-established and Częstochowa had come under Polish control.\nWilkosz had remarkably broad interests and from\n1917\nto\n1920\n, in addition to teaching in the Gymnasiums in Zawiercie and Częstochowa, he attended lectures at the Jagiellonian University on ecclesiastical law and the history of law. At the same time he was writing his doctoral thesis, then after the award of his doctorate he was working on his\nhabilitation\nthesis. He submitted the habilitation thesis\nO funkcjach ściśle mierzalnych i Duhamelowskich wraz z zastosowaniami do teorii równań całkowych i różniczkowych\nⓉ\n(\nOn Strictly Measurable and Duhamelian Functions with Applications to the Theory of Integral and Differential Equations\n)\nin\n1920\n. It was approved in\n1921\nand he began teaching as a\ndocent\nat Jagiellonian University in Kraków. He was promoted to extraordinary professor in\n1922\nand full professor in\n1936\n.\nLet us quote from\n[\n13\n]\nand\n[\n14\n]\nregarding mathematics at the Jagiellonian University in Kraków from\n1918\nto\n1939\n[\n13\n]\n:-\nIn\n1918\nthere were three professors of mathematics at the Jagiellonian University:\nStanisław Zaremba\n,\nKazimierz Żorawski\nand\nJan Sleszyński\n. Lectures were also given by\nAntoni Hoborski\n,\nAlfred Rosenblatt\nand Włodzimierz Stożek, soon joined by Leon Chwistek, Witold Wilkosz and\nFranciszek Leja\n. The standard curriculum, established before\n1918\n, comprised mathematical analysis\n(\ndifferential and integral calculus\n)\n, analytic geometry, introduction to higher mathematics, differential equations, differential geometry, theory of analytic functions. ... New subjects were added by Witold Wilkosz, who became an extraordinary professor in\n1922\n: foundations of mathematics, set theory, theory of quadratic forms, theory of functions of a real variable, geometric topology, group theory. The course of studies could be concluded with either the teacher's examination or PhD examination. An additional subject was required at the examination\n(\nmost commonly, physics was chosen\n)\n.\nAndrzej Turowicz\nwas an undergraduate at the university in\n1922\n-\n26\n. We have added a few details to the following quote from\n[\n13\n]\n:-\nWhen I came for my first year of studies at the university, there were no assistants. The so-called \"proseminarium\"\n[\na pre-seminar\n]\n, which preceded the recitations, was led by docent\nLeja\n. I was in this pre-seminar of his. He was a high school professor and had contract classes at the university. Only when I entered the second year, Wilkosz took care to have two deputy assistants nominated, that is Jan Józef Leśniak\n(1901\n-\n1980)\nand Irena Wilkosz\n(\nWilkosz's wife, who was a mathematician\n)\n. Then also Stanisław Turski\n(1906\n-\n1986)\nmade it. Even later, there was Krystyn Zaremba\n(1903\n-\n1990)\n(\nStanisław Zaremba\n's son\n)\n.\nIn\n1920\nWilkosz published\nSugli insiemi non misurabili L in Fundamenta Mathematicae.\nⓉ\n(\nOn non-measurable sets L in Fundamenta Mathematicae.\n)\nHe states:-\nThe aim of this study is to present some theorems concerning non-measurable sets in the\nLebesgue\nsense, and thus to pave the way for a general treatment.\nIn\n1921\nhe published three further papers in\nFundamenta Mathematicae.\nOne, written in English, is\nSome properties of derivative functions\n. The paper begins:-\nThe first investigations of properties belonging to the remarkable class of derivative functions are found in the work of\nCauchy\n, the great founder of modern Differential Calculus. The study of them has been pursued by\nDuhamel\nand\nDini\n, and has attained a very considerable development in our time especially by the work of\nLebesgue\nand his successors. In the famous book of\nLebesgue\n\"Sur l'intégration\" we can find nearly all results of the known properties of these functions and we are able to recognise how many questions are hitherto unsolved. The modest scope of my paper is to pursue in some points the considerations of the subject.\nWilkosz's other two\n1921\npapers were written in Italian. They are\nSul concetto del differenziale esatto\nⓉ\n(\nOn the concept of the exact differential\n)\nand\nUna condizione di rapresentazione per le serie\nⓉ\n(\nA way of presenting a series\n)\n. This last mentioned paper has the Abstract:-\nThe purpose of this note is to demonstrate: If the series\nf\n1\n(\nx\n)\n,\nf\n2\n(\nx\n)\n,\n.\n.\n,\nf\nn\n(\nx\n)\n,\n.\n.\n.\nf_{1}(x), f_{2}(x), .., f_{n}(x), ...\nf\n1\n​\n(\nx\n)\n,\nf\n2\n​\n(\nx\n)\n,\n.\n.\n,\nf\nn\n​\n(\nx\n)\n,\n.\n.\n.\nwhich is convergent to a limited\nf\n(\nx\n)\nf(x)\nf\n(\nx\n)\n, has all the terms\nf\nn\n(\nx\n)\n,\nn\n=\n1\n,\n2\n,\n.\n.\n.\nf_{n}(x), n = 1, 2, ...\nf\nn\n​\n(\nx\n)\n,\nn\n=\n1\n,\n2\n,\n.\n.\n.\nRiemannian\n(\nR\n)\nthen the necessary and sufficient condition for\nf\n(\nx\n)\nf(x)\nf\n(\nx\n)\nto be\n(\nR\n)\nis the simply uniform convergence at \"almost\" every point of\n[\na\n,\nb\n]\n[a, b]\n[\na\n,\nb\n]\ni.e. with a possible exception of a set of zero measure.\nHis mathematical interests, however, were very broad as we have seen from the above quote concerning the new topics he introduced into the curriculum. The authors of\n[\n7\n]\nwrite:-\nWitold Wilkosz was a very versatile mathematician. He published about\n40\nworks in various branches of mathematics: set theory, logic, topology, measure theory, mathematical analysis, analytic functions, differential equations, mathematical physics and algebra. His favourite field was mathematical logic and the foundations of mathematics. ...  He understood and appreciated the importance of applied mathematics well. B Średniawa\n[\n8\n]\nwrites about his close cooperation with physicists. Many of W Wilkosz's works became the basis for further research by Polish and foreign mathematicians.\nWitold Wilkosz was also an equally passionate and excellent lecturer. Working with young people gave him great joy. His lectures were very well attended. He taught a wide variety of topics in an innovative way: set theory, topology, theory of functions of real variables, vector analysis and algebra. He also gave lectures for physicists and a seminar on mathematical problems of atomic physics. He was the author of several university textbooks. He was passionate about teaching mathematics not only at the university level, but also at its earlier levels.\nIt is noted in this quote that the foundations of mathematics was a favourite field. In\n[\n11\n]\nUrszula Wybraniec-Skardowska studies an axiom system for the natural numbers proposed by Wilkosz in his\n1932\npaper\nArytmetyka Liczb Całkowitych/System aksjomatyczny\nⓉ\n(\nInteger arithmetic/Axiomatic system\n)\n. Wybraniec-Skardowska's Abstract begins as follows\n[\n11\n]\n:-\nThe systems of arithmetic discussed in this work are non-elementary theories. In this paper, natural numbers are characterised axiomatically in two different ways. We begin by recalling the classical set P of axioms of\nPeano\n's arithmetic of natural numbers proposed in\n1889\n(\nincluding such primitive notions as: set of natural numbers, zero, successor of natural number\n)\nand compare it with the set W of axioms of this arithmetic\n(\nincluding the primitive notions like: set of natural numbers and relation of inequality\n)\nproposed by Witold Wilkosz, a Polish logician, philosopher and mathematician, in\n1932\n. The axioms W are those of ordered sets without largest element, in which every non-empty set has a least element, and every set bounded from above has a greatest element. We show that P and W are equivalent and also that the systems of arithmetic based on W or on P, are categorical and consistent.\nPolski Radio, Poland's national public-service radio broadcaster, was founded on\n18\nAugust\n1925\n. From\n18\nApril\n1926\nit began making regular broadcasts from Warsaw and its first regional station was in Kraków which went into service on\n15\nFebruary\n1927\n[\n6\n]\n:-\nFrom the moment the Kraków radio station was launched, i.e. from\n15\nFebruary\n1927\n, Wilkosz participated in its work. He became a member of the programme council. In the beginning of the station's activity, the programme was dominated by the simplest radio forms - lectures, readings and talks. Specialists from various fields were invited. The largest group of speakers were academics from the Jagiellonian University ...\nOne of the first talks broadcast from the Kraków station was\nWhat is logic?\nby Wilkosz on\n17\nFebruary\n1927\n. He became a regular, giving talks of on wide variety of topics. The paper\n[\n6\n]\nlists\n40\ntalks that Wilkosz broadcast. The first few after\nWhat is logic?\nare: \"\nB Spinoza - on the\n250\nth anniversary of his death\n\"\n(7\nMarch\n1927)\n; \"\nTruth and Falsehood in Science\n\"\n(20\nAugust\n1931)\n; \"\nOn Squares and Magic Figures\n\"\n(4\nSeptember\n1931)\n; \"\nCan Probability Be Measured?\n\"\n(17\nMay\n1932)\n; \"\nThe Middle Ages and the Exact Sciences\n\"\n(27\nMay\n1932)\n; \"\nThe Magic of Numbers\n\"\n(27\nNovember\n1932)\n; and \"\nHow Does a Child Acquire the Difficult Art of Calculation?\n\"\n(15\nAugust\n1933)\n.\nStanisław Broniewski was the programme manager of the Kraków regional station of Polski Radio. He wrote\n[\n12\n]\nin which he writes about Wilkosz's contributions:-\nFrom the moment it was launched, he supplied the Kraków Radio with talks on radio engineering, astronomy, and above all, he popularised mathematics in a great way. ... Witold Wilkosz, quicksilver in front of the microphone, direct and brilliant, conveyed a difficult subject, the intricate nature and beauty of mathematics in an intriguing way ...\nKrystyna Rakoczy-Pindor writes\n[\n6\n]\n:-\nHis radio talks, conducted live with incredible eloquence and freedom, sometimes slightly improvised, won the special sympathy of the listeners. He never had the slightest stumble. He was allowed to appear in front of the microphone without a previously \"read\" text, which was a significant distinction.\nTalks on radio were not Wilkosz's only interest in radio. He was also interested in constructing radio receivers\n[\n6\n]\n:-\nFascinated by radio engineering, Wilkosz worked on designing and improving receivers. Among other things, he designed a very simple and cheap single-tube receiver. This device went down in the history of radio engineering under the name of \"Wilkosz's device\"\n(\nsee\n[\n12\n]\nfor more details\n)\n. Following its design, the first pre-war miniature receiver powered by pocket batteries was later designed, called \"Vademecum\", the prototype of the post-war \"Szarotka\". Wilkosz also built a two-tube receiver of his own design and published a brochure 'Miniaturowy odbiornik dwulampowy'\nⓉ\n(\nA miniature two-valve receiver\n)\n. He founded a factory and at the same time a radio clinic called \"Teleradio - radio equipment factory and research laboratory\", located in Kraków at\n18\nJana Street, where he personally gave all kinds of advice to radio amateurs, completely selflessly.\nOtto Fulton invented the Fultograph in the\n1920\ns which allowed pictures to be transmitted using radio. It was first demonstrated to the public in\n1928\nand Wilkosz was fascinated to learn about this invention. He published\nFultograf i Fultografia\nⓉ\n(\nThe full graph and full graphing\n)\nin\n1929\nwhich explained the principles to the Polish public. He states in his Preface:-\nFultography is the method of transmitting images at a distance using methods improved and brought to ideal simplicity by the English inventor Captain Otto Fulton.\nIn the introduction, he explains the difference between wire and wireless transmission, tells his readers that the fultograph can be added to any radio receiver, and that it takes\n3\nto\n5\nminutes to send one image of normal dimensions.\nThe German invasion of Poland on\n1\nSeptember\n1939\nbegan World War II. By the first week of September\n1939\nthe German army occupied Kraków. A German commander, SS-Sturmbannführer Bruno Müller, ordered Tadeusz Lehr-Spławiński, the rector of the Jagiellonian University, to convene a meeting of all the University's professors in the Collegium Novum on\n6\nNovember\n1939\n. Although Wilkosz's health was not good, he attended the meeting. Müller addressed the meeting saying that the Jagiellonian University had always been a \"source of anti-German attitudes.\" Soldiers entered and arrested\n183\nprofessors and others at the meeting. Wilkosz's illness, however, meant that he was considered unfit to be placed in a concentration camp. On\n9\nNovember\n1939\n, he was released along with\n9\nother professors while the others were taken to the Sachsenhausen concentration camp. He returned home in a considerably worse state of health as a result of his experience. On\n14\nNovember\n1939\n, he was ordered to leave the apartment he occupied with his family at Plac Inwalidów\n4\n. He accepted an offer to take up a teaching position at a trade school located in the former Institute of Mathematics. In order to earn money, he took on an additional job at the General Mutual Insurance Company at\n39\nŁobzowska Street. His health continued to deteriorate, and the cold classrooms added to his problems. Doctors recommended that he go to the Social Insurance Sanatorium in Radziszów near Skawina but his condition only became even more serious and he was sent back to Kraków. He died of pneumonia on\n31\nMarch\n1941\nleaving his family without any means of subsistence.\nWilkosz had married Irena who was also a mathematician and she had been employed at the Jagiellonian University as his assistant. She had been awarded a Master's Degree in Mathematics in\n1932\n-\n33\nfor her thesis\nConvex functions and the functional equation\nf\n(\nx\n+\n1\n)\n=\nx\nf\n(\nx\n)\nf(x+1) = xf(x)\nf\n(\nx\n+\n1\n)\n=\nx\nf\n(\nx\n)\n. Irena Wilkosz died at the age of\n86\non\n10\nFebruary\n1979\nand was buried beside her husband.",
  "matematicos_citados_na_biografia": [
    "Stefan Banach",
    "Banach",
    "Zdzisław Krygowski",
    "Marian Rejewski",
    "Henryk Zygalski",
    "Jerzy Różycki",
    "Giuseppe Peano",
    "Guido Fubini",
    "Corrado Segre",
    "Lebesgue",
    "Accademia dei Lincei",
    "Stanislaw Zaremba",
    "Hugo Steinhaus",
    "Otto Nikodym",
    "Riemann",
    "habilitation",
    "docent",
    "Stanisław Zaremba",
    "Kazimierz Żorawski",
    "Jan Sleszyński",
    "Antoni Hoborski",
    "Alfred Rosenblatt",
    "Franciszek Leja",
    "Andrzej Turowicz",
    "Leja",
    "Cauchy",
    "Duhamel",
    "Dini",
    "Peano"
  ],
  "imagens": [
    "wilkosz.jpg"
  ]
}