{
  "nome_completo": "Yewande Olubummo",
  "nome_curto": "Yewande Olubummo",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Olubummo/",
  "data_nascimento": "8 February 1960",
  "local_nascimento": "Ibadan, Nigeria",
  "data_morte": null,
  "local_morte": null,
  "summary": "Yewande Olubummo is a Nigerian mathematician who works in the United States. In 2006 - 2010 she was chair of the mathematics department at Spelman College. She publishes papers on functional analysis and dynamical systems. With National Science Foundation support she led a programme to encourage minority undergraduates in mathematics to go on to graduate study.",
  "biografia": "Yewande Olubummo\nis the daughter of the mathematician\nAdegoke Olubummo\nand his wife Edak Bassey Adam. We give a description of her education and career here but for her own much fuller description, see\nTHIS LINK\n.\nYewande was the eldest of his parents' there children, having younger siblings Ronke and Gboyega who both studied mathematics. Adegoke Olubummo was a professor of mathematics at the University of Ibadan and for the first ten years of her life, the family lived on the university campus. The University of Ibadan in Ibadan, Nigeria, was established in\n1948\nas a College of the University of London; it is the first university in Nigeria. It became an independent university in\n1962\nafter the country gained its independence from Britain. When Yewande was ten years old, the family moved from their home on the university campus to live in a house in Bodija, a district of Ibadan, Oyo State.\nThe University of Ibadan provided schooling for the children of its staff and Yewande attended the University of Ibadan Staff School for her primary education. Her secondary education was at the International School, Ibadan, which was on the campus of the University of Ibadan. It was founded in\n1963\nto educate both boys and girls, the children of expatriates and Nigerians of high standing. The school was designed to provide a good education for pupils to go on to the University of Ibadan and, after graduating from the high school, this is precisely the course that Olubummo followed. Of course, having her father as a professor of mathematics meant that some of the courses she took at university were delivered by her father. She was keen to live on the university campus since that would mean that she would living with her fellow students, but her father insisted she live at home in Bodija. Although at the time she felt this was the wrong thing to do, nevertheless, in retrospect she felt her father was right.\nOlubummo graduated with a B.Sc. from the University of Ibadan in\n1980\nand then had to spend a year as a Youth Corper. This is the National Youth Service Corps, a scheme set up by the Nigerian government in\n1973\n. Graduates were required to spend a year on this programme which sent them to a different state from that in which they were brought up. Olubummo was sent to Keffi, Plateau State, where she taught mathematics at a high school. Encouraged by her father to undertake postgraduate studies abroad, she applied to several universities and received offers of a place but not financial support from all of them. Yale University in the United States offered her a place and financial support so she accepted.\nThe experiences that Olubummo had at Yale were not good and she explains in the interview about the difficulties; see\nTHIS LINK\n.\nAt Yale she met Donald Frank St Mary, an African American mathematician who worked at the University of Massachusetts, Amherst, and who was visiting Yale. He had been born in Lake Charles, Louisiana, in\n1940\n. He obtained degrees from McNeese State College Louisiana\n(\nB.S.\n1962)\n, the Uniersity of Kansas\n(\nM.A.\n1964)\nand the University of Nebraska\n(\nPh.D.\n1968)\n. He was on the faculty of the University of Massachusetts, Amherst, from\n1968\n. He realised that Olubummo was having problems at Yale so he encouraged her to take an M.S. at Yale and apply to the University of Massachusetts, Amherst, for her Ph.D. She followed his advice.\nOlubummo began her research at the University of Massachusetts, Amherst, in\n1983\nand she was awarded a Ph.D. in\n1991\nfor her thesis\nMeasures on empirical logics and the properties of their associated dual Banach spaces\n. She gives the following summary of the contents of her\n41\n-page thesis:-\nWe show that various spaces of weights defined on a quasimanual are dual\nBanach\nspaces and we construct their preduals. We investigate what it means for these spaces of weights to have the\nJordan\n-\nHahn\nproperty. Lastly, we examine when a finitely-additive state can be decomposed into the sum of a countably-additive state and a purely finitely-additive state.\nHer thesis advisor had been Thurlow Adrean Cook. He had been born on\n2\nJune\n1939\nin Utica, New York, and educated at the University of Rochester and the State University of New York, Buffalo. He worked at the University of Massachusetts, Amherst, from\n1968\n. He was an associate professor of mathematics from\n1975\nand became a full professor from\n1988\nin the middle of the period when Olubummo was undertaking research. Before completing work on her thesis, she taught mathematics at Smith College, Northampton, Massachusetts.\nWhile teaching at Smith College, she met Sylvia Bozeman, an African American who was undertaking an academic audit of the Mathematics Department at Smith College. Sylvia Bozeman had been born in Camp Hill, Alabama in\n1947\n. She obtained degrees from Alabama A&M University in Huntsville, Alabama\n(\nB.S.\n1968)\n, Vanderbuilt University\n(\nM.A.\n1971)\nand Emory University\n(\nPh.D.\n1980)\n. She joined the faculty of Spelman College in Atlanta, Georgia, in\n1972\n. She was chair of the Department of Mathematics from\n1982\nto\n1993\n. Bozeman encouraged Olubummo to apply for a position at Spelman College in Atlanta, which she did and was offered a post. She has been a faculty member of Spelman College since\n1991\n.\nEven before the award of her doctorate, Olubummo had published her first paper, a joint work with her thesis advisor Thurlow Adrean Cook. The paper was\nOperational logics and the Hahn-Jordan property\nand its content is given in a review:-\nThe main result established in this paper is the following: If the base normed space V of completely additive weights is a norm-determining subspace of the space of finitely additive weights V acting on the order unit space spanning the operational logic, then V has the µ-\nJordan\n-\nHahn\nproperty if and only if V has the approximate\nJordan\n-\nHahn\nproperty. Several examples illustrating the theory are given.\nShe published another paper co-authored with Thurlow Cook, namely The predual of an order-unit\nBanach\nspace. This paper was presented to the\n1997\nInternational Quantum Structures Association Meeting held in Atlanta and appeared in the proceedings of the conference which were published in\n1999\n. The Abstract states:-\nWe give a shortened and simplified proof of the known theorem that a\nBanach\nspace which is a predual of an order-unit\nBanach\nspace is a base-normed space.\nAnother paper with Olubummo as the sole author is\nOn duality for a generalized Monge-Kantorovich problem\n(2004)\n. She writes:-\nThe author gratefully acknowledges the support of the Department of Mathematics, Georgia Institute of Technology and NSF Grant DMS\n96\n-\n22734\n.\nShe also gives the following Abstract:-\nThe existence of a minimizer for a special version of the\nMonge\n-\nKantorovich\nproblem is solved using classical tools of functional analysis, and it is shown that the minimizer is not unique. Our variational problem has a connection to the Michell problem in optimal design.\nIn\n[\n2\n]\nthe courses that Olubummo teaches at Spelman College are listed:-\nPrecalculus I, II, Calculus I, II, III, Linear Algebra I, II, Foundations of Mathematics, Differential Equations, Abstract Algebra I, Real Variables I, II.\nHere are two comments by her students:-\n(\ni\n)\nDr Olubummo gives great notes, and does a good job of explaining the material. She always offers her office hours if students need more assistance. She gives a lot of practice problems out of the textbook and she collects it three times out of the semester. Make sure you start working on the problems early so you won't get behind.\n(\nii\n)\nShe's a little eclectic in her mannerisms but she gives great notes and doing the homework problems she assigns really helps. There are also homework worksheets she gives out, they are way harder than her tests and quizzes. She gives out the dates for tests way before hand so make sure to study. Overall, she's a great teacher if you pay attention.\nThe following description of her contribution to Spelman College is given in\n[\n2\n]\n:-\nWhat Dr Olubummo enjoys most is working with students, both inside and outside the classroom, to help build their knowledge, skills and confidence in mathematics She is also interested in improving the pipeline of underrepresented women from the undergraduate to the graduate level in mathematics. Dr Olubummo serves as a faculty mentor for the National Alliance for Doctoral Studies in the Mathematical Sciences, a program focused on fostering a sense of community for underrepresented undergraduate and graduate mathematics students. She has also worked with the Enhancing Diversity in Graduate Education\n(\nEDGE\n)\nsummer program since\n1998\n, serving as local coordinator in\n2004\n, as co-leader of the EDGE Georgia chapter mentoring cluster, and as program instructor for several years.\nFinally, let us end by quoting from\n[\n1\n]\nthe advice that Olubummo gives to parents regarding the mathematical education of their children:-\nParents should try not to communicate their own anxiety to their children around mathematics education. They should be actively involved and encourage their children to enjoy Mathematics. There is a lot of information on the internet now on how a parent, even one who did poorly in Mathematics as a student, can help his or her children. Apart from mathematical activities at home, children should be encouraged to participate in activities such as mathematics fairs and competitions. Girls, especially, should be given attention. Parents can provide information to their children about the many professions they could enter as mathematicians. Mathematics should be made fun, and not something to be dreaded. Parental attitude and encouragement matter a lot in children's perception and performance in Mathematics.",
  "matematicos_citados_na_biografia": [
    "Adegoke Olubummo",
    "THIS LINK",
    "Banach",
    "Jordan",
    "Hahn",
    "Monge",
    "Kantorovich"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}