{
  "nome_completo": "Yozo Matsushima",
  "nome_curto": "Yozo Matsushima",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Matsushima/",
  "data_nascimento": "11 February 1921",
  "local_nascimento": "Sakai, Osaka Prefecture, Japan",
  "data_morte": "9 April 1983",
  "local_morte": "Osaka, Japan",
  "summary": "Yozo Matsushima was a Japanese mathematician who worked in Lie groups and algebras.",
  "biografia": "Yozo Matsushima\nattended Naniwa High School. After graduating he entered Osaka Imperial University\n(\nlater named Osaka University\n)\nwhere he was taught by Kenjiro\nShoda\n, among others. These were difficult years for anyone to be studying in Japan and the next few years, as World War II drew to an end, would be even more difficult. He graduated with the degree of Bachelor of Science in September\n1942\n.\nMatsushima was appointed as an assistant in the Mathematical Institute of Nagoya Imperial University\n(\nlike Osaka and other Japanese universities it would soon drop the name \"Imperial\" from its title\n)\nimmediately he had received his B.Sc. degree, and he was in post in time for the\n1942\n-\n43\nacademic year. There were major difficulties in carrying out research in these war years since, quite apart from military reasons and problems caused by bombing, international mathematical journals were not reaching Japan. Equally, it was very difficult for Japanese mathematicians to publish the results that they were discovering.\nThe first paper which Matsushima published contained a proof that a conjecture of\nZassenhaus\nwas false.\nZassenhaus\nhad conjectured that every semisimple\nLie algebra\nL\nL\nL\nover a field of prime characteristic, with\n[\nL\n,\nL\n]\n=\nL\n[L, L] = L\n[\nL\n,\nL\n]\n=\nL\n, is the direct sum of simple ideal and Matsushima was able to construct a counterexample. He then embarked on research which enabled him to prove that\nCartan\nsubalgebras of a Lie algebra are conjugate, but due to being out of touch with current research, he was to publish this result while unaware that\nChevalley\nhad already published a proof. When he was able to obtain details of another of\nChevalley\n's papers through a review in\nMathematical Reviews\nhe was able to construct the proofs for himself.\nThe\n1947\nvolume of the\nProceedings of the Japan Academy\n, containing two papers by Matsushima, did not appear until\n1950\nwhile the first volume of\nJournal of the Mathematical Society of Japan\ncontained three of his papers. This shows the quantity of mathematics he had managed to produce in the final years of the war and the next couple of years which were almost as difficult ones in which to carry out research in Japan. In\n1952\n-\n53\nhe organised a seminar on\nLie\npseudogroups and differential systems at Nagoya, a topic on which he was now working. One of the students who attended this seminar, Kuranishi, went on to prove a famous result on this topic. Reminiscing on these years later in his life, Matsushima wrote that:-\n... although he himself got relatively little out of differential systems for the time and effort spent, he felt much gratified with Kuranishi's great success.\nHaving earlier being promoted to associate professor, in\n1953\nMatsushima became a full professor at Nagoya University.\nChevalley\nvisited him in Nagoya in the autumn of\n1953\n, spending three months there. It was a visit which Matsushima greatly enjoyed, and which was most useful to him. Equally\nChevalley\nenjoyed the visit and invited Matsushima to spend the following year in France. He left for France in the autumn of\n1954\n, spending time at the University of Strasbourg, and then in Paris as a member of C.N.R.S. at the invitation of\nChevalley\nand\nHenri Cartan\n. Matsushima presented some of his results to\nEhresmann\n's seminar in Strasbourg, extending\nCartan\n's classification of complex irreducible\nLie\nalgebras to the case of real\nLie\nalgebras. Having arrived in Paris by the spring of\n1955\n, he lectured on\nLie\npseudogroups at the Bourbaki seminar. Kobayashi\n(\n[\n2\n]\nor\n[\n3\n]\n)\nwrites:-\nMatsushima returned to Nagoya in December\n1955\n. His sojourn in France seems to have determined the course of his research for the next several years.\nWhen\nShoda\nretired from the Chair of Algebra at Osaka University, Matsushima was appointed to fill the vacant chair in early\n1960\n. His research in Osaka took a somewhat different direction and he wrote a series of papers on cohomology of locally symmetric spaces. In particular he collaborated with Murakami on this topic. In September\n1962\nhe went to the Institute for Advanced Study in Princeton where he spent a year. Back in Osaka, Matsushima jointly began to organise the United States-Japan Seminar in\nDifferential Geometry\nwhich was held in Kyoto in June\n1965\n. Shortly after the end of this seminar, he set off for another visit to France to spend the academic year\n1965\n-\n66\nas visiting professor at the University of Grenoble.\nIn September\n1966\nMatsushima accepted a chair at the University of Notre Dame in Indiana in the United States. While there he did not end the collaboration which he had been carrying out with Murakami and they continued to undertake joint research. He became an editor of the new\nJournal of Differential Geometry\nin\n1967\n, remaining on the editorial board for the rest of his life. Matsushima spent\n14\nyears as a professor at Notre Dame before returning to Japan in\n1980\n. A conference was organised in his honour in May\n1980\nbefore he left Notre Dame.\nHe reached the age of\n60\nin February\n1981\nand a volume of papers by colleagues and former students was published:\nManifolds\nand\nLie groups\n, Papers in honour of Yozo Matsushima\n. The volume contains some papers presented to the conference held in Notre Dame in the previous May. Sadly, after his return to Osaka he had less than three years in his chair before he died from pneumonia at the young age of\n62\n.\nAmong the honours that Matsushima received, perhaps the most prestigious was the Asahi Prize which was presented to him for his research on continuous groups in\n1962\n.\nWe have mentioned several topics on which Matsushima worked in the course of this biography. For completeness we list the topics on which Matsushima's contribution is described by in detail by Kobayashi in\n[\n2\n]\n:-\n(1)\nLie\ntheory -\nLie algebras\nand\nLie groups\n;\nLie\npseudogroups and differential systems;\n(2)\nhomogeneous complex manifolds - homogeneous Kahler manifolds; homogeneous Stein manifolds;\nSchubert\nvarieties;\n(3)\nvector bundle valued harmonic forms -\nBetti\nnumbers of locally symmetric spaces;\ncohomology\nof vector bundles over locally symmetric spaces; second fundamental forms and curvature forms;\n(4)\nautomorphisms of complex manifolds - automorphisms of Siegel domains; first\nChern\nclass and automorphisms of compact Kahler manifolds;\n(5)\ncomplex tori - vector bundles over complex tori; ample bundles and subvarieties of complex tori; affine structures.\nMurakami writes this tribute to Matsushima in\n[\n5\n]\n(\nor see\n[\n6\n]\n)\n:-\nMatsushima's love for mathematics is evidenced by the discipline and diligence he consistently applied to his research. He was a man whose concern lay not only in mathematics, but he had a keen interest in human nature and a constant curiosity about the world that resulted in his being an avid reader of a variety of books and a most interesting conversationalist. His friends and colleagues will miss not only his mathematical talent, but the warmth and cynical humour which lay behind his outwardly serious countenance.",
  "matematicos_citados_na_biografia": [
    "Shoda",
    "Zassenhaus",
    "Lie algebra",
    "Cartan",
    "Chevalley",
    "Lie",
    "Henri Cartan",
    "Ehresmann",
    "Differential Geometry",
    "Manifolds",
    "Lie groups",
    "Lie algebras",
    "Schubert",
    "Betti",
    "cohomology",
    "Chern"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}