{
  "nome_completo": "Yurii Alekseevich Mitropolskii",
  "nome_curto": "Yurii Alekseevich Mitropolskii",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mytropolsky/",
  "data_nascimento": "3 January 1917",
  "local_nascimento": "Charnyshivka, Shyshats'kyi, Poltava gubernia, Ukraine",
  "data_morte": "14 June 2008",
  "local_morte": "Kyiv, Ukraine",
  "summary": "Yurii Alekseevich Mitropolskiy was a Ukrainian mathematician known for his contributions to dynamical systems and nonlinear oscillations.",
  "biografia": "Yurii Alekseevich Mitropolskii\n's name is often transliterated as Mitropolsky or Mytropolsky and occasionally as Mytropolskiy or Mitropolskiy. His father, Aleksei Savvich Mitropolskii, had attended St Petersburg University but was called up for military duty in\n1914\n. When his son Yurii Alekseevich was born, Aleksei Savvich was serving at the front. After he was demobbed in\n1919\nhe went with his family to Kiev where Yurii Alekseevich was brought up from the age of two. As a child he worked in a factory in Kiev. He entered the Faculty of Mechanics and Mathematics of Shevchenko Kiev State University in\n1938\nbut on\n22\nJune\n1941\nthe German armies invaded their former allies pushing rapidly east into Soviet lands. At first their main advance was aimed towards Moscow, but by August they made a strong push in the south deep into Ukraine heading towards Kiev. The University was evacuated from Kiev before the German troops reached the city and Mitropolskii was sent to the front. He was recalled from the front to continue his education at the Department of Physics and Mathematics at Kazakh University in Alma-Ata\n(\nrenamed Almaty in\n1991)\n. Alma-Ata is the Soviet version of the Kazakh name Almaty for the capital of Kazakhstan, meaning \"Father of Apples\". It took this name in\n1921\nhaving previously been named Verny. Kazakh Al-Farabi State University was very new when Mitropolskii studied there, the University being founded in\n1934\n.\nMitropolskii graduated from the Kazakh University in\n1942\nafter studying there for six months. After graduating he attended the Ryazan Military Artillery School and then, from\n1943\nuntil the end of the war, he was sent to the front where he commanded an artillery intelligence platoon. The authors of\n[\n41\n]\nwrite for Mitropolskii's ninetieth birthday:-\nFor services in battle, he was awarded two Orders of the Red Star and military medals. Mitropolskii retains vivid memories of wartime, and he still remembers his comrades in arms and even details of the army life quite well.\nHe continued his military service until he was demobbed in\n1946\nwhen he began research at the Institute of Constructive Mechanics of the\nUkrainian Academy of Sciences\n, working under\nNikolai Nikolaevich Bogolyubov\n. He was awarded his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1948\nfor his dissertation on the problem of resonance phenomena in non-linear oscillatory systems with slowly varying parameters. His approach to the problem used the\nKrylov\n-\nBogolyubov\nasymptotic methods. He continued to work for his doctorate\n(\nequivalent to the\nhabilitation\n)\nand he was awarded this in\n1951\nfor his thesis\nSlow processes in non-linear oscillatory systems with many degrees of freedom\n. In this impressive piece of work he studied problems of non-linear mechanics and mathematical physics which involved investigating non-stationary phenomena in non-linear oscillatory systems. He moved to the Institute of Mathematics of the\nUkrainian Academy of Sciences\nin\n1951\nand, two years later, he was appointed head of the Department of Mathematical Physics and Non-linear Oscillation Theory.\nFrom\n1951\nMitropolskii taught in the Faculty of Mechanics and Mathematics at Kiev University, where he was named as professor in\n1954\n, and continued teaching there when made Director of the Institute of Mathematics in\n1958\n. He held the post of Director of the Institute for\n30\nyears, expanding the work of the Institute.\nVolodymyr Petryshyn\nwrites in\n[\n36\n]\n:-\nDuring Yu Mitropolskii's directorship\n(1958\n-\n88)\n, the Institute experienced a great expansion in research personnel and mathematical disciplines, and an improvement in the quality of research.\nAnatoly Samoilenko\nwas a student of Mitropolskii's who obtained his Ph.D. in\n1963\n. Following this, he worked with Mitropolskii on many joint mathematical projects and, when Mitropolskii retired from the directorship of the Institute in\n1988\n,\nSamoilenko\ntook over the directorship.\nIn\n[\n37\n]\nVolodymyr Petryshyn\nsummarises Mitropolskii's work as follows:-\nMitropolskii has made major contributions to the theory of oscillations and nonlinear mechanics as well as the qualitative theory of\ndifferential equations\n. He further developed asymptotic methods and applied them to the solution of practical problems. He extended the\nKrylov\n-\nBogolyubov\nsymbolic method to nonlinear systems and extended asymptotic methods in the theory of nonlinear mechanics. Using a method of successive substitutes, he constructed a general solution for a system of nonlinear equations and studied its behaviour in the neighbourhood of the quasi-periodic solution. He also successfully applied the averaging method to the study of oscillating systems with slowly varying parameters.\nThe authors of\n[\n9\n]\nlist seven main areas in which Mitropolskii made significant contributions:-\nthe creation and mathematical justification of algorithms for constructing asymptotic expansions for non-linear differential equations describing non-stationary oscillatory processes\n;\nthe development of a method for investigating monofrequency processes in oscillatory systems\n;\nthe investigation of systems of non-linear differential equations describing oscillatory processes in gyroscopic systems and strongly non-linear systems\n;\nthe development of the theory of integral manifolds in non-linear mechanics and the consideration of related questions that arise on stability of motion\n;\nthe development of the averaging method for equations with slowly varying parameters, as well as for equations with non-differentiable and discontinuous right-hand sides, for equations with delayed argument, for equations with random perturbations, and for partial differential equations and equations in functional spaces\n;\nthe development of the method of accelerated convergence in problems of non-linear mechanics\n;\nthe development of the theory of reducibility in linear differential equations with quasi-periodic coefficients, and other equations\n.\nIn\n1955\nMitropolskii and\nBogolyubov\npublished a monograph on asymptotic methods in nonlinear oscillations. In particular this book contained the results the authors had obtained during the ten years from\n1945\nto\n1955\n.\nSolomon Lefschetz\nbegins a review with the following paragraph:-\nThe present book is the fourth or fifth major treatise published in recent years by Soviet scientists on the general topic of non-linear oscillations, which serves to indicate the great value which is attached in the USSR to this general topic. The general program of the book is not too far from the program of the\n1937\nKrylov\n-\nBogolyubov\nmonograph\n[\nIntroduction to non-linear mechanics\n(1937)]\n. However, although the book is addressed primarily to physicists and engineers, its mathematical treatment is most careful, which was by no means the case with the\n1937\nmonograph. The book is also much more orderly and most readable: an excellent contribution in every respect.\nThis work was to lead to further advances by the Kiev school, in particular they applied asymptotic methods to partial and functional differential equations. An English translation of the second Russian edition of the book\n(\ncontaining an additional chapter on single-frequency oscillations in systems with many degrees of freedom\n)\nappeared as\nAsymptotic methods in the theory of non-linear oscillations\nin\n1961\n. A French translation appeared in\n1962\nwith a German translation three years later. The method developed by the authors and presented in this and later editions of the monograph have come to be known as the KBM method\n(\nKrylov\n-\nBogolyubov\n-Mitropolskii\n)\n. This book was the first of many books written by Mitropolskii, the majority co-authored with his former doctoral students. The authors of\n[\n8\n]\nlist\n31\nmonographs published by Mitropolskii between\n1955\nand\n2005\n. Among the single authored texts we mention:\nNonstationary processes in non-linear oscillatory systems\n(1955)\n;\nProblems in the asymptotic theory of non-stationary oscillations\n(1964)\n;\nLectures on the method of averaging in non-linear mechanics\n(1966)\n;\nThe method of averaging in nonlinear mechanics\n(1971)\n;\nNonlinear mechanics. Asymptotic methods\n(1995)\n;\nNon-linear mechanics. Monofrequency oscillation\n(1997)\n; and\nMethods of non-linear mechanics. A first textbook\n(2005)\n. A reviewer of the\n1964\nmonograph writes:-\nThe book is written for readers interested in the application of the techniques described. Asymptotic solutions of differential equations are worked out in great detail, the author always being willing to go the second mile with the reader in obtaining the inherently complicated formulas that arise. A large number of physical problems are presented, again in careful and lengthy detail.\nLet us also quote from the Preface of the\n1971\nmonograph:-\nWe deal with the method of averaging in nonlinear mechanics. We include numerous results of further development and generalization of the basic ideas of\nN N Bogolyubov\n. We give various algorithms, schemes and rules for constructing approximate solutions of equations with small and large parameters, and obtain examples which in many cases graphically illustrate the effectiveness of the method of averaging and the breadth of its application to various problems which are, at first glance, very disparate. The theorems that we include reveal the depth and mathematical rigour of the method of averaging. We discuss the basic trends and developments of the method of averaging, and as illustrations we give typical examples of nonlinear oscillatory systems, revealing the effectiveness of the method.\nAmong the many co-authored works we mention\nLectures on the application of asymptotic methods to the solution of partial differential equations\n(1968)\nco-authored with his former student Boris Illich Moseenkov,\nLectures on the methods of integral manifolds\n(1968)\nco-authored with his former student Olga Borisovna Lykova,\nLectures on the theory of oscillation of systems with lag\n(1969)\nco-authored with his former student Dmitrii Ivanovich Martynyuk,\nAsymptotic solutions of partial differential equations\n(1976)\nco-authored with his former student Boris Illich Moseenkov,\nPeriodic and quasiperiodic oscillations of systems with lag\n(1979)\nalso co-authored with D I Martynyuk,\nMathematical justification of asymptotic methods of nonlinear mechanics\n(1983)\nco-authored with his former student Grigorii Petrovich Khoma,\nGroup-theoretic approach in asymptotic methods of nonlinear mechanics\n(1988)\nco-authored with his former student Aleksey Konstantinovich Lopatin, and\nAsymptotic methods for investigating quasiwave equations of hyperbolic type\n(1991)\nco-authored with his former students G P Khoma and Miron Ivanovich Gromyak. We give three examples of complimentary comments from reviewers of these texts:-\nThe book constitutes a welcome addition to the literature on this subject\n.\nThis is an excellent monograph whose main purpose is to present a mathematical justification of the method of averaging and in particular of the\nKrylov\n-\nBogolyubov\nasymptotic method\n.\nThe book is well written and it may be recommended to researchers and students interested in oscillatory processes\n.\nThis list of works will already have given the impression that Mitropolskii had many outstanding research students. In fact the full list of his Ph.D. students is quite remarkable containing almost\n100\nnames. He attracted many international students to the Institute and the list of his Ph.D. students contains students from Vietnam, Uzbekistan, Georgia, Bulgaria, and Yugoslavia. As remarkable is the fact that\n500\nstudents at the Institute of Mathematics of the\nUkrainian Academy of Sciences\nobtained a Ph.D. during the years that Mitropolskii was the director. Certainly he worked to have schools covering a wide range of topics in the Institute such as algebra, the theory of random processes, function theory, functional analysis, and mathematical physics.\nWe should also mention his important contribution to mathematics as an editor of several different journals. Some of these were Ukrainian journals such as the differential equations journal\nDifferentsial'nye Uravneniya\n, while others were international journals such as the\nInternational Journal of Nonlinear Sciences and Numerical Simulations\n, the journal\nNonlinear Analysis\n, the journal\nNonlinear Dynamics\n, and the\nInternational Journal of Nonlinear Mechanics\n. He was also interested in the history of mathematics and served on the editorial board of the\nHistory of the Ukrainian Academy of Sciences\nand\nEssays on the development of mathematics in the USSR\n. To illustrate this interest let us mention his book\nThe Institute of Mathematics: Academy of Sciences of the Ukrainian SSR\nwritten jointly with V V Strok and published in\n1988\n.\nMitropolskii was elected to the\nUkrainian Academy of Sciences\nin\n1961\n, to the Bologna Academy of Sciences\n(1971)\n, and to the\nAcademy of Sciences of the USSR\nin\n1984\n. He was also honoured by the award of the A M Lyapunov Gold Medal in\n1987\n. He was a speaker at the International Congress for Mathematicians in Edinburgh in\n1958\n, in Stockholm in\n1962\n, in Moscow in\n1966\n, in Nice in\n1970\n, in Vancouver in\n1974\n, in Warsaw in\n1983\n, in Berkeley in\n1986\n, and in Kyoto in\n1990\n. In\n1965\nhe was awarded the Lenin Prize:-\n... for his outstanding achievements in the theory of nonlinear differential equations and nonlinear oscillations.\nHe was also honoured with the award of the\nKrylov\nPrize\n(1969)\n, the\nBogolyubov\nPrize\n(1994)\n, State Prizes of Ukraine\n(1980\nand\n1996)\n, and the\nLyapunov\nGold Medal\n(1986)\n:-\n... for the development of asymptotic methods in nonlinear mechanics.\nFor the same work he was awarded the Silver Medal of the\nCzech Academy of Sciences\n(1978)\n:-\n... for services to science and mankind.\nHe was made a Hero of Ukraine in January\n2007\nand, on the occasion of his ninetieth birthday, he was presented with the V I Vernadskii Gold Medal by the President of the National\nUkrainian Academy of Sciences\n.\nAs to his personal characteristics, his colleagues write of his:-\n... extraordinary creative energy, vigour, and optimism.",
  "matematicos_citados_na_biografia": [
    "Ukrainian Academy of Sciences",
    "Nikolai Nikolaevich Bogolyubov",
    "Krylov",
    "Bogolyubov",
    "habilitation",
    "Volodymyr Petryshyn",
    "Anatoly Samoilenko",
    "Samoilenko",
    "differential equations",
    "Solomon Lefschetz",
    "N N Bogolyubov",
    "Academy of Sciences of the USSR",
    "Lyapunov",
    "Czech Academy of Sciences"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}