{
  "nome_completo": "Zdzisław Ignacy Pawlak",
  "nome_curto": "Zdzisław Pawlak",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pawlak/",
  "data_nascimento": "10 November 1926",
  "local_nascimento": "Łódź, Poland",
  "data_morte": "7 April 2006",
  "local_morte": "Warsaw, Poland",
  "summary": "Zdzislaw Pawlak was a Polish mathematician and computer scientist who was known for his contribution to many branches of theoretical computer science.",
  "biografia": "Zdzisław Pawlak\nwas brought up in Łódź, a city south west of Warsaw. His father was fond of wood carving and he gave his young son a love for art. In particular, his father helped him develop a skill in painting which the boy loved. Throughout his life he would paint scenes from places he visited in the same way that others might use a camera. He attended primary school in Łódź and was preparing to begin his secondary education when Germany invaded Poland on\n1\nSeptember\n1939\n. Quickly the city came under sustained attack and was captured by the Germans on\n8\nSeptember. The annexed city was renamed Litzmannstadt after the German general who captured it during World War I. Many Poles were forced to work for German firms at this time, particularly to contribute to the German war effort. One such firm was Siemens engineering company and Pawlak was forced to work for them. It was a difficult time for the young lad who had to work in poor conditions. He was able, with difficulty, to continue with his education as well so, after the war ended, he was fairly soon in a position to take the final high school examinations as an external candidate. The Germans left Łódź in January\n1945\nand Russian troops entered the city. In\n1946\nPawlak, now twenty years old, took his high school examinations and, in the following year began to study in the Electrical Engineering Faculty of the Łódź University of Technology.\nThe Łódź University of Technology was only founded in May\n1945\nand so it was a very young institution when Pawlak began his studies there. It had originally been in temporary accommodation but a permanent site was formed around the former Rosenblatt factory. The Electrical Engineering Faculty was one of the first faculties to be founded. Pawlak studied there from\n1947\nto\n1949\nbefore going to study at the Faculty of Telecommunications of the Technical University of Warsaw. In\n1950\n, after one year of study, he submitted his first project which was the design of a computer he named GAM-\n1\n. The group GAM\n(\nGroup for Mathematical Machines in Polish\n)\nhad been founded by\nKazimierz Kuratowski\nin\n1949\nand was headed by the logician Henryk Greniewski\n(1903\n-\n1972)\n. Other members of the team were Romuald Marczyński\n(1921\n-\n2000)\n, Krystyn Bochenek\n(1922\n-\n1966)\nand Leon Łukasiewicz\n(1923\n-\n2013)\n. All these influenced Pawlak, in particular Marczyński and Bochenek who both acted as his advisors at different stages of his studies.\nIn\n1951\nPawlak was awarded a Master's Degree in Telecommunication Engineering for his thesis\nA clock for the electronic computing machine\nwhich had been supervised by the computer pioneer Romuald Marczynski. After graduation, he was appointed as an assistant at the Institute of Mathematical Sciences of the\nPolish Academy of Sciences\n. He wrote\n(\nsee for example\n[\n17\n]\n)\n:-\nMy first experience of scientific work occurred in\n1951\nat the State Mathematical Institute, where, after graduating from the Warsaw University of Technology, a group of scientists headed by engineer Romuald Marczynski was building the first Polish computer. This group was called \"Mathematical Machines Group\"\n(\nGAM\n)\n. Dealing with a totally new area of science, both in Poland and all over the World, I found myself in an unusual situation for a fresh graduate of the University of Technology. At that time, the only existing computer\n(\nas we know them now\n)\nwas located at the Cambridge University. We, the builders, had a complete lack of knowledge, literature and, the most important, skilled 'masters' that would be able to lead our group of inexperienced, young scientists. There was a large group of outstanding, world renown mathematicians working at the Institute of Mathematics of the\nPolish Academy of Sciences\nincluding Professors\nKarol Borsuk\n,\nWacław Sierpiński\n,\nKazimierz Kuratowski\n,\nAndrzej Mostowski\n,\nRoman Sikorski\n,\nJerzy Łoś\n,\nStanisław Mazur\n, Andrzej Grzegorczyk, and others. However, the area of computing machines, which is how computers were then called, was of no interest to them. Work at the Institute of Mathematics gave me an opportunity to interact with many great mathematicians, even from the outside of the Institute, for instance Professors\nHelena Rasiowa\n, Kazimierz Ajdukiewicz,\nHugo Steinhaus\n, Klemens Szaniawski, and others. Moreover, thanks to the work at the Institute, I had the opportunity to meet some of the greatest mathematicians of the\n20\nth century, including\nAlfred Tarski\n,\nStanisław Ulam\n,\nSamuel Eilenberg\n,\nAlonzo Church\n, Leon Henkin, Dana Scott,\nLászló Kalmar\n,\nAlfréd Rényi\n,\nRózsa Péter\n,\nAndrey Kolmogorov\n,\nBoris Trakhtenbrot\n,\nBoris Gnedenko\n, Andrei Markov,\nAndrei Tikhonov\n, and others. These contacts had no direct impact on my scientific development but the atmosphere dominating the Institute and daily contacts with eminent scholars indirectly influenced my personal scientific interests a lot. In the case of dealing with our team' s specific problems, everybody had to find his own solution. Actually, this had some advantages, because it left us a significant area of independence, but today, I tend to think that disadvantages of that situation overwhelmed its positive sides.\nThe work which Pawlak undertook for his Master's thesis led him to develop a pseudo-random number generator. This in turn led to his publication\nOn probability calculus\n(\nPolish\n)\n(1953)\nfollowed by\nFlip-flop as generator of random binary digits\nin\n1956\nin the journal\nMathematical Tables and Other Aids to Computation\n. It is claimed that this\n1956\npublication is the first by a Polish author on a computer science topic to be published in an international journal. Pawlak begins this paper by writing:-\nThe aim of the present note is to show that a well known electronic element of digital computers, the flip-flop, may be used for generating a series of random binary digits with equal probabilities.\nOther publications around this time include:\nDo they think, or not? Principles of operation of digital machines\n(\nPolish\n)\n(1956)\n, and\n(\nwith A Wakulicz\n)\nUse of expansions with a negative basis in the arithmometer of a digital computer\n(1957)\n.\nFor two years,\n1957\n-\n59\n, he worked on the development of the first Polish computer at the Technical University of Warsaw. During this time, in\n1958\n, Pawlak was awarded a Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nfor his thesis\nApplication of Graph Theory to the Decoder Synthesis\n. His thesis advisor had been Krystyn Bochenek. His work at this time at the Technical University of Warsaw is described in\n[\n17\n]\n:-\nBetween\n1957\nand\n1959\n, he worked at the Warsaw University of Technology, at the Chair and the Section of Telecommunications and Radio Broadcasting, which was a very active research and construction projects centre, concerned with digital electronics\n(\ncalled impulse technology then\n)\nand \"computing machines\" ... . In\n1956\n, a computing machine called PARK\n(\ndesigned by Gerard Kudelski\n)\nwas built there. Based on the experience gathered during the construction of reliable, complex electronic devices in the\n1950\ns, the PARK group attempted to build its own \"mathematical machine.\" Professor Pawlak played a crucial role in the project. Under his supervision and according to his design, an experimental computing machine was built at the Warsaw University of Technology. Its innovation consisted of using the positional numeral system with a negative radix\n(\n-\n2)\nand the concept of microinstruction. Based on Professor Pawlak's ideas, an Electronic Digital Machine and, later\n(\nafter Pawlak's transfer to the Mathematical Institute of Polish Academy of Sciences\n)\n, a prototype\n(1960)\nand five machines of the test series of Universal Digital Machine\n(\nUMC-\n1)\nwere built. ... Although the period of Professor's work\n[\non UMC\n]\nbetween\n1957\nand\n1959\nmay appear short, it was of crucial importance for the Warsaw University of Technology, the Faculty and especially for the department which was later transformed into the Institute of Computer Science\n(\nin\n1975\n.\n)\nIt was the beginning of digital and electronic computing techniques development\n(\nthe contemporary name of Computer Science\n)\n. Research and development work done then resulted in the long-term development plan of the Department. It also contributed to the fact that the Department was one of the first few centres of Computer Science. ... After his transfer from the Department to the Institute of Mathematics, Pawlak's involvement with the personnel of the Department continued. He organised a seminar devoted to problems of contemporary computer science and digital electronics\n(\nresearchers from the Warsaw University of Technology were also involved in the seminar\n)\n. Moreover, Professor taught students specialising in building of mathematical machines and worked with many graduates from the Department and the Faculty of Electronic Engineering.\nAfter\n1959\nPawlak was appointed to the Institute of Mathematics of the\nPolish Academy of Sciences\nand, in\n1963\n, he was awarded his\nhabilitation\nfrom the\nPolish Academy of Sciences\nfor his monograph\nOrganization of Address-less Machines\n(\nPolish\n)\n. In this work he investigated parenthesis-free languages which generalised the polish notation introduced by\nJan Lukasiewicz\n. From that time on he worked both at the University of Warsaw and at the\nPolish Academy of Sciences\n. At the Institute of Mathematics of the\nPolish Academy of Sciences\n, along with Andrzej Ehrenfeucht\n(1932\n-\n)\nwho was married to\nAlfred Tarski\n's daughter, Pawlak ran a seminar. Viktor Marek attended this seminar and wrote in\n[\n6\n]\n:-\nThe atmosphere there was very informal ... and this informality and relaxed atmosphere certainly appealed to people like myself. The audience was, unlike in other seminars, very diverse: logicians, probabilists, philosophers, computer scientists and even medical researchers. A number of papers devoted to automated theorem proving were read there.\nLet us record the details of the rest of Pawlak's career. He was an Associate Professor at the Institute of Mathematics of the\nPolish Academy of Sciences\nfrom\n1971\nand, also from that date, he was Deputy Director of Science at the\nPolish Academy of Sciences\n' Computer Centre. In\n1978\nhe became a full Professor at the Institute of Computer Science of the\nPolish Academy of Sciences\n. The Computer Centre had been renamed the Institute of Computer Science in\n1976\n. He was elected a corresponding member of the\nPolish Academy of Sciences\nin\n1983\nand became a full member in\n1991\n. In addition to these, however, Pawlak held other positions. He was director of the Institute of Informatics of the Silesian University of Technology from\n1979\nto\n1986\n; he worked at the Institute of Theoretical and Applied Informatics of Polish Academy of Sciences in Gliwice from\n1985\n; he was the director of the Institute of Computer Science of the Warsaw University of Technology from\n1989\nto\n1996\n; and he also worked at the University of Applied Computer Science and Management in Warsaw from\n1998\n.\nPawlak wrote over\n200\npapers on a wide variety of topics including mathematical linguistics, automata theory, automated theorem proving, knowledge representation, artificial intelligence, representation of incomplete information and handling uncertainty. His most important contributions are almost certainly his introduction of \"rough set theory\". As an indication of its importance, we note that MathSciNet lists\n(\nas of November\n2016)\n428\nitems where the phrase \"rough set theory\" occurs either in the title or in the review text. For a good description of \"rough set theory\" we quote Roman Slowinski\n[\n18\n]\n:-\nFrom set theory point of view, rough set theory is one of known escapes from \"\nCantor\n's paradise\". It is based on the observation that knowledge about objects of a given universe is granular - objects described with the same information are indiscernible and form the so-called elementary sets, i.e. the granules of knowledge about the universe. If we want to express a concept concerning a given set of objects in the terms of knowledge about the universe, to which the objects belong, we generally encounter a situation that the considered concept cannot be precisely expressed using the available granules; in other words, the union of elementary sets having nonempty intersection with the given set of objects is not equal to the set. This given set or concept may be expressed approximately only, using a pair of classical sets called the lower and the upper approximation - the lower approximation is the union of all such elementary sets\n(\ngranules\n)\nwhich are entirely included in the given set, the upper approximation is the union of all the granules which have a nonempty intersection with the given set. The difference between the upper and the lower approximation is called the boundary region, which consists of the vague objects, those impossible to resolve with certainty whether they belong or do not belong to the considered set. Distinguishing between the certain knowledge, represented by the lower approximation, and doubtful knowledge, represented by the boundary region, has a crucial impact on the reasoning process. Rough set theory is complementary to fuzzy set theory and soft computing. Together they provide the best available today tools for analysis of data bearing some kind of \"imperfectness\", such as vagueness, ambiguity, imprecision, incompleteness, and uncertainty.\nTowards the end of his life Pawlak became interested in logic and the foundations of mathematics, in particular in the work of\nGottlob Frege\n,\nJan Łukasiewicz\n,\nStanisław Leśniewski\nand\nBertrand Russell\n. He also worked on probability and the connection between rough sets and\nBayes\n' theorem. For example he wrote the paper\nLogic, probability, and rough sets\n(1999)\nto which he gave the following summary:-\nThe paper analyzes some properties of decision rules in the framework of rough set theory and knowledge discovery systems. With every decision rule two conditional probabilities are associated, called the certainty and coverage factors, respectively. It is shown that these coefficients satisfy the\nBayes\n' theorem. This relationship can be used as a new approach to Bayesian reasoning, without referring to prior and posterior probabilities, inherently associated with classical Bayesian inference. Decision rules are implications and the relationship between implications and\nBayes\n' theorem first was revealed by\nŁukasiewicz\nin connection with his multivalued logic.\nAmong the honours he received we mention the Polish State awards of the Chivalry Cross\n(1984)\nand Officer's Cross of the Polonia Restituta Order\n(1999)\n. He was awarded an honorary doctorate from the Poznań University of Technology in\n2002\n.\nWe have mentioned his love of painting at the beginning of this article. James Peters writes in\n[\n10\n]\n:-\nHis paintings capture various moments in the four seasons in the Polish countryside and offer his perception of the symmetries and singular beauty of the woods, gently rolling terrain, farmland furrows, waterways, lakes, and shorelines found in parts of Poland. He was a gifted painter. In fact, he was extraordinarily perceptive in his rendition of the changing face of the woods that border lakes and waterways that he visited.\nWe give four examples of his paintings at\nTHIS LINK\n.\nWe learn about Pawlak's character from several of the obituaries referenced below. For example, Viktor Marek writes in\n[\n6\n]\n:-\nZdzisław was a true renaissance man, with many interests besides computer science he produced artistic short movies, wrote poetry, but also did practical things. Whatever he did the same enthusiasm and pervasive optimism present in his scientific work demonstrated itself in his actions. I, of course, benefited when he decided to build a shower stall in my small cottage in the country. Certainly the contrast between an academician living in \"ivory tower\" and a mason with his bricklayer trowel could not be bigger. Among many passions Zdzisław had was antique restoration. Like everything he did, this passion was contagious. So, when he and I brought to my apartment in Warsaw a round table bought in a consignment store\n(\nand in obvious need of restoration\n)\nmy family was not pleased, and I had a new occupation for few months. I recall discussing with Zdzisław heating water using solar energy\n(\nyes, this was in\n1970\ns!\n)\nand other innovations.\nThe authors of\n[\n12\n]\nwrite:-\nZdzisław Pawlak gave generously of his time and energy to help others. His spirit and insights have influenced many researchers worldwide. During his life, he manifested an extraordinary talent for inspiring his students and colleagues as well as many others outside his immediate circle. For this reason, he was affectionately known to some of us as Papa Pawlak.",
  "matematicos_citados_na_biografia": [
    "Kazimierz Kuratowski",
    "Polish Academy of Sciences",
    "Karol Borsuk",
    "Wacław Sierpiński",
    "Andrzej Mostowski",
    "Roman Sikorski",
    "Jerzy Łoś",
    "Stanisław Mazur",
    "Helena Rasiowa",
    "Hugo Steinhaus",
    "Alfred Tarski",
    "Stanisław Ulam",
    "Samuel Eilenberg",
    "Alonzo Church",
    "László Kalmar",
    "Alfréd Rényi",
    "Rózsa Péter",
    "Andrey Kolmogorov",
    "Boris Trakhtenbrot",
    "Boris Gnedenko",
    "Andrei Tikhonov",
    "habilitation",
    "Jan Lukasiewicz",
    "Cantor",
    "Gottlob Frege",
    "Jan Łukasiewicz",
    "Stanisław Leśniewski",
    "Bertrand Russell",
    "Bayes",
    "Łukasiewicz",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}