{
  "nome_completo": "Zhang Heng",
  "nome_curto": "Zhang Heng",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zhang_Heng/",
  "data_nascimento": "AD 78",
  "local_nascimento": "Nan-yang, China",
  "data_morte": "AD 139",
  "local_morte": "China",
  "summary": "Zhang Heng was a Chinese mathematician, astronomer and geographer. He became chief astrologer and minister under the Emperor An'ti of China.",
  "biografia": "Zhang Heng\nwas born at the time of the Eastern Han\n(\nsometimes called Later Han\n)\ndynasty, the second half of the longest lasting Chinese dynasty. The Eastern Han was established in\n25\nAD after the brief\n15\nyear reign of Wang Mang's Hsin dynasty had replaced the Western Han dynasty. At the time of Zhang Heng's birth the Emperor was Chang-ti, the third of the Eastern Han emperors. The capital of the country had moved to Lo-yang where a large ornate palace had been built. In\nEncyclopaedia Britannica\nthe aims and achievements of the Han rulers are described as follows:-\n... the Han came to require cultural accomplishment from their public servants, making mastery of classical texts a condition of employment. The title list of the enormous imperial library is China's first bibliography. Its text included works on practical matters such as mathematics and medicine, as well as treatises on philosophy and religion and the arts. Advancement in science and technology was also sought by the rulers, and the Han invented paper, used water clocks and sundials, and developed a seismograph. Calendars were published frequently during the period.\nOver the years that Zhang Heng grew up, Chinese influence and prestige were growing rapidly and reached their peak in around\n90\nwhen he was about\n12\nyears old. This was the period during which Ho-ti was the emperor and the court began to be influenced by family members seeking to extend their own power. Zhang, who had been born into an important family, was educated in the moral and political philosophy of Confucianism. For ten years he studied literature and trained as a writer. He published a number of literary works which gained him considerable fame. We shall give more information below on these aspects of Zhang's achievements as well as examples of his poetry. Zhang was thirty years old before his interests turned from literature to scientific matters, and at that time he became particularly interested in astronomy.\nIn around\n116\nhe was appointed an official at the Emperor's court in Lo-yang. The court, however, was beginning to provide a less efficient government due to the weakness of successive emperors who were manipulated by those around them seeking advantage for themselves. This was hardly surprising since many emperors came to the throne as children. If China began to suffer due to ambitious people seeking to further their own influence, this was certainly not the case for Zhang. His biography in\nThe History of the Eastern Han Dynasty\n(\nsee\n[\n5\n]\n)\nsuggests that he was not as successful an official as he might have been precisely because of a lack of ambition. This seemed to stem, at least in part, from his strong moral beliefs based in Confucianism. He refused advancement in his career on several occasions when he turned down posts that were offered to him, and he also spent periods away from the capital when he lived in isolation and thought about the nature of the universe and about a wide variety of scientific topics. His highest position at court was when he became chief astrologer and minister under the emperor An-ti. He held the position of chief astrologer on a number of occasions.\nWe will describe below some of Zhang's outstanding scientific achievements. However, as we indicated above, he first achieved fame as a poet and writer of over twenty works, and in this capacity he had a lasting influence on Chinese culture. His works\nSi Chou Shi\n(\nFour Chapters of Distressed Poems\n)\nand\nGui Tian Fu\n(\nTo Live in Seclusion\n)\nare considered literary masterpieces. Zhang's poem, in his highly influential style of prose poetry, which we now quote comes from\n[\n1\n]\n. It is a telling criticism of the last rulers of the Western Han dynasty:-\nThose who won this territory were strong;\nThose who depended on it endured.\nWhen a stream is long, its water is not easily exhausted.\nWhen roots are deep, they do not rot easily.\nTherefore, as extravagance and ostentation were given free reign,\nThe odour became pungent and increasingly fulsome.\nZhang wrote the\nFour Stanzas of Sorrow\nwhich is the first seven-syllabic poem which we know of in China. We quote\n(\nin translation of course\n)\nonly the first of its four stanzas:-\nIn Taishan stays my dear sweetheart,\nBut Liangfu keeps us long apart;\nLooking east, I find tears start.\nShe gives me a sword to my delight;\nA jade I give her as requite.\nI'm at a loss as she is out of sight;\nWhy should I trouble myself all night?\nIn ancient China there was a belief that an emperor received his right to rule from heaven. Changing the calendar was seen as one of the duties of the office, establishing the emperor's heavenly link on earth. After a change of ruler, and even more significantly after a change of dynasty, the new Chinese emperor would seek a new official calendar thus establishing a new rule with new celestial influences. It was natural therefore that Zhang having become an expert in astronomy should become involved in calendar reform by the year\n123\n. In that year he corrected the calendar to bring it into line with his accurate astronomical observations.\nIn\n132\nZhang invented the first seismograph for measuring earthquakes. One has to understand how significant earthquakes were in China at this time, not only for the destructive power which they unleashed but also because they were seen as punishment from the gods for poor governance of the country. In his role as chief astrologer he was responsible for detecting signs of bad government which were indicated by earthquakes. Zhang's device, which he called Hou Feng Di Dong Yi, was made of copper. It was in the shape of an egg with eight dragon heads around the top, each with a copper ball in its mouth, and a pendulum in the centre. Around the bottom were eight frogs, each directly under a dragon head. When an earthquake occurred, a ball fell out of a dragon's mouth into a frog's mouth, making a noise. In fact the seismograph detected an earthquake in February of\n138\nand Zhang reported this fact to the Emperor despite no other evidence of the earthquake being felt in the capital Lo-yang. He was even able to indicate that the earthquake was to the west of the capital. He achieved fame when reports of an earthquake more than a thousand kilometres north west reached the capital several days later.\nZhang appears to have been the first person in China to construct an equatorial armillary sphere. It consisted of a system of rings corresponding to the great circles of the celestial sphere with a central tube which was used to line up stars and planets. With this instrument Zhang was able to make more accurate star maps than earlier Chinese astronomers. He wrote about his instrument in the work\nHun-i chu\nwhere he described his version of the universe as follows:-\nThe sky is like a hen's egg, and is as round as a crossbow pellet, the Earth is like the yolk of the egg, lying alone at the centre. The sky is large and the Earth small.\nIn another work,\nLing Xian\n(\nMystical Laws\n)\n, he describes the stars:-\nNorth and south of the equator there are\n124\ngroups which are always brightly shining.\n320\nstars can be named. There are in all\n2500\n, not including those which the sailors observe. Of the very small stars there are\n11520\n.\nOnly the first part of this text by Zhang has survived.\nIn mathematics Zhang studied\n3\nby\n3\nmagic squares\n. He also proposed, in a treatise on inscribed and circumscribed circles of a square, that π = √\n10\nor approximately\n3\n.\n162\n. Although this is not particularly accurate the significance of his work is pointed out by S K Mo in\n[\n8\n]\n. As Mo notes, the significance here is that all earlier attempts to calculate were based on practical measurement, whereas the work by Zhang was based on a theoretical calculation.\nZhang also gave formulae for the volume of a sphere in terms of the volume of the circumscribing cube. These results are not very accurate and\nLiu Hui\nin his commentary on the\nNine Chapters on the Mathematical Art\nwrites:-\nIn an attempt to make his statement consistent and harmonise his philosophy of yin and yang, and the doctrine of odd and even,\n[\nZhang\n]\nneglected the precision of the data.\nLi Chunfeng\nwrote in his commentary on the\nNine Chapters\non the\nMathematical Art:-\nZhang Heng followed the ancients blindly, making himself a laughing stock for later generations.\nOne interesting point to note in some of Zhang's mathematical work is that he leaves square roots as unevaluated. Some historians believe that Zhang understood the difference between rational and\nirrational\nnumbers but this seems to be stretching things a bit too far.",
  "matematicos_citados_na_biografia": [
    "magic squares",
    "Liu Hui",
    "Nine Chapters on the Mathematical Art",
    "Li Chunfeng",
    "Nine Chapters",
    "irrational"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}