{
  "nome_completo": "Zhao Youqin",
  "nome_curto": "Zhao Youqin",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zhao_Youqin/",
  "data_nascimento": "26 July 1271",
  "local_nascimento": "Poyang, now Jiangxi province, China",
  "data_morte": "about 1335",
  "local_morte": "Longyou Mountains, Zhejiang province, China",
  "summary": "Zhao Youqin was a Chinese mathematician and astronomer who published work on the structure of the universe. He described how to calculate π.",
  "biografia": "Zhao Youqin\n's name is sometimes written as Chao Yu-Chhin or Chao Yu-Ch'in. He was born at a time of conflict when the Mongol leader Kublai Khan began attacking the Song Dynasty of China. The Song imperial family surrendered in\n1276\nand the last of the resistance was crushed in\n1296\n. One source suggests that Zhao was injured in the fighting surrounding these dramatic events. When he was a young man he learnt astronomy and obtained a secret book on alchemy from a Daoist master. He joined the northern branch of the Quanzhen sect of Daoism and became a Daoist hermit, spending ten years writing a commentary on the\nBook of Changes\n. No trace of this commentary has survived. He later became the patriarch of the Quanzhen\n(\nComplete Perfection\n)\nSchool of Song-Yuan Daoism, ordained by the preceding patriarch, Zhang Mo.\nZhao Youqin was skilled in a large range of topics. He was an expert in astronomy, mathematics and physics, with particular skills in optics. He was also, however, a religious philosopher and a specialist in alchemy. Before he died he gave a copy of the manuscript of his book\nGe xiang xin shu\n, to his disciple Zhu Hui. The manuscript was passed from Zhu Hui to Zhang Jun who published the work.\nThe\nGe xiang xin shu\nis usually translated as\nNew Elucidation of the Heavenly Bodies\nbut in\n[\n5\n]\nVolkov suggests\nNew Writing on the Image of Alteration\n. He writes:-\nThe 'alteration' was traditionally related to the changes in numerical data of celestial phenomena and to the establishment of a new calendar. Thus, it appears plausible to suggest New Writing on the Image of Alteration as a tentative rendering of the title. This suggestion is reinforced by Zhao Youqin's remark in the section entitled 'Li fa gai ge'\n(\n'On Changes and Alterations\n(\nge\n)\nof Calendrical Methods'\n)\nof the first chapter of the treatise. There, he states that the accumulation of small errors in numerical data on heavenly phenomena led to changes of the values of parameters of calendars used in China from antiquity to his time.\nIn this treatise, Zhao is concerned with the structure of the universe. For him this consists of a flat Earth inside spherical heavens. He gives an explanation of eclipses of both the moon and of the sun. There is also an interesting description of optical experiments he has carried out trying to determine the relationship between the apparent luminosity of a source and its distance from the observer. These experiments are carried out with a pinhole source and so relate to a camera obscura. Zhao also looks at various instruments which can be used for surveying. In particular he describes a gnomon which he uses to determine the distances of the sun, moon and stars from the earth. He also describes an instrument he has designed to measure the difference in right ascension between objects on the celestial sphere. Another of the instruments he has designed allows him to calculate the angle between a given star and the north pole. One of the most interesting features of the book, however, relates to Zhao's calculation of π.\nHere is Volkov's translation of a part of Zhao's text\n(\nquoted in\n[\n5\n]\n)\n:-\nLet us take the small square and develop it with calculational procedures in order to obtain the image of a circle and to achieve the circle's perimeter which is to be established. Start from the square which has four angles and widen it in order to obtain a 'circle' of\n8\nangles and sides, this is the first step. If we perform the second step, then what we research has\n16\nsides. If we perform the third step, then what we research has\n32\nsides. If we perform the fourth step, then what we research has\n64\nsides. In all cases, if the number of steps is increased by one, the number of sides is necessarily doubled. If we reach the\n12\nth\nstep, then what we research will have\n16\n,\n384\nsides. The starting small square is gradually increased and developed, the circle is gradually completed and filled. The greater the number of angles, the more what once was a square is no longer a square but is transformed into a circle!\nWe see that Zhao is describing an iterative procedure, calculating the length of the side of the regular\n2\nn\n2^{n}\n2\nn\n-gon at each step. He ends by saying:-\nTo summarize, the square is the beginning of the calculations\n[\nor 'numbers'\n(\nshu\n)]\n, the circle is the end of the calculations. The circle starts from the square, the square ends in the circle. This is the procedure of the Zhou bi\n[\nsuan jing\n]\n, and nothing goes beyond its bounds!\nThe\nGe xiang xin shu\nis not the only book by Zhao to have survived. There is a second work, namely the\nXian Fo tongyuan\n, which is concerned with the teachings of Transcendentals and Buddhas. This is a work on alchemy whose aim was to attain immortality using meditation.",
  "matematicos_citados_na_biografia": [],
  "imagens": [
    "zhao_youqin.jpg"
  ]
}