{
  "nome_completo": "Vasily Yakovlevich Zinger",
  "nome_curto": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zinger/",
  "data_nascimento": "30 January 1836",
  "local_nascimento": "Moscow, Russia",
  "data_morte": "16 February 1907",
  "local_morte": "Moscow, Russia",
  "summary": "Vasily Zinger was a Russian mathematician who was a major figure in Moscow University in the 19 th century. He wrote a number of works on geometry, mechanics and hydrodynamics, as well as on botany and philosophy. He was a founding member and later president of the Moscow Mathematical Society.",
  "biografia": "Vasily Yakovlevich Zinger\nwas the son of Yakov Khristianovich Zinger and Anna Vasilievna Volkova. Before we continue with our biography let us note the following. The name Zinger is sometimes transliterated from the Russian as Ysinger. The dates of his birth and death that we give above are according to the calendar used in Russia at the time but, in terms of our present calendar, these dates are\n11\nFebruary\n1836\nand\n1\nMarch\n1907\n. One further comment on these dates. Zinger's obituary in the\nMoscow Mathematical Society\ngives his date of death as\n17\nFebruary\n1907\nbut we have used\n16\nFebruary\n1907\nthat appears on the official documents.\nYakov Khristianovich Zinger, the father of the subject of this biography, came from an aristocratic family. He trained as a mathematics teacher but he never took up a teaching position, although he did give private lessons. Anna Vasilievna Volkova, the mother of the subject of this biography, was the daughter of a merchant. Yakov Khristianovich and Anna Vasilievna had four children: Yulia Yakovlevna Zinger\n(\nborn\n8\nJuly\n1832)\n; Vasily Yakovlevich Zinger\n(\nborn\n30\nJanuary\n1836)\n, the subject of this biography; Nikolai Yakovlevich Zinger\n(7\nMay\n1837\n-\n26\nAugust\n1837)\n; and Nikolai Yakovlevich Zinger\n(19\nApril\n1842\n-\n3\nOctober\n1918)\n. We note that after the death of their second son in\n1837\nwhen under a year old, they gave their next son, born in\n1842\n, the same name. Nikolai Yakovlevich Zinger became an astronomer and geodesist, was appointed a professor and became a leading member of the Russian Geographical Society. He was elected a corresponding member of the\nImperial St Petersburg Academy of Sciences\n.\nYakov Khristianovich died when his son Vasily Yakovlevich was eleven years old. Even before the death of his father, Vasily Yakovlevich had lived with his paternal grandfather Christian Ivanovich Zinger. He had been born in Germany but had lived in Moscow since the last years of the\n18\nth century. He became the manager of the Golitsyn Hospital and was able to prevent the hospital from being looted during Napoleon's occupation of Moscow in September-October\n1812\n. He had been awarded the title of hereditary nobleman for his service to Russia.\nVasily Yakovlevich studied at the First Moscow Gymnasium. He later spoke of his experiences at this school saying that he disliked the educational system which operated there that he considered formal and boring. This meant that, particularly in the lower grades, he performed poorly since he did not find any of the subjects interesting; he did not find any satisfaction in learning facts by rote. When he moved to the upper grades in the school things improved. The teaching became more interesting and after the age of fifteen he impressed his teachers with his excellent memory and his abilities to think quickly and logically. He graduated from the First Moscow Gymnasium in\n1853\nobtaining qualifications which allowed him to enter any Russian university without taking an entrance examination.\nZinger entered the Physics and Mathematics Department of Moscow University in\n1853\n. His outstanding qualifications from the First Moscow Gymnasium meant he was able to live in a student residence funded with a government grant. The conditions in the residence did not come up to the living standards he was used to and he was unhappy living there. Since his mother was living in Moscow he left the student accommodation and lived with his mother. He also did some private mathematics tuition to earn some extra money to help with the family finances.\nThere were a number of first class professors in the Physics and Mathematics Department of Moscow University who influenced Zinger; we note that the three most important were:\nAugust Yulevich Davidov\n, professor of applied mathematics;\nNikolai Dmetrievich Brashman\nwho gave inspiring courses on analytical geometry; and Nikolai Efimovich Zernov\n(1804\n-\n1862)\n. Nikolai Efimovich Zernov was the son of a postal officer. After taking his undergraduate degree at Moscow University in\n1822\n, Zernov had studied for a master's degree in astronomy and, in\n1832\n, had been appointed astronomer-observer at the university observatory. Passed over for the position of astronomer, Zernov succeeded in obtaining the appointment of professor of pure mathematics at Moscow University. In\n1837\nhe had been the first to defend a doctoral thesis in Russia.\nZinger graduated from Moscow University in\n1857\nand then he continued to study at the university, aiming to gain qualifications to allow him to become a mathematics professor. In\n1862\n, Zinger defended his dissertation for a Master's Degree on the topic of \"The Method of Least Squares\"\n(\nRussian\n)\n, in the same year he was elected by the Council of Moscow University to the full-time position of associate professor of the Department of Pure Mathematics.\nIn\n1865\nZinger married Magdalena Ivanovna Raevskaya\n(1838\n-\n1888)\n. They had four children: Nikolai Vasilyevich Zinger\n(11\nMay\n1866\n-\n18\nMay\n1923)\n, who became a botanist and professor at the Novo-Alexandria Institute of Agriculture and Forestry; Alexander Vasilyevich Zinger\n(16\nMay\n1870\n-\n24\nDecember\n1934)\n, who became a physicist and teacher and wrote many textbooks; Elizaveta Vasilyevna Zinger\n(\ndates unknown\n)\n; and Ivan Vasilyevich Zinger\n(\ndates unknown\n)\n.\nZinger was one of the founders of the\nMoscow Mathematical Society\nin\n1864\nand he became its first secretary. In\n1866\nthe first president\nNikolai Dmetrievich Brashman\ndied and\nAugust Yulevich Davidov\n, who had been vice-president, became president. Zinger was elected as vice-president at this time. The Society began publishing its journal\nMatematicheskii Sbornik\nin\n1866\nand Zinger began publishing papers in the journal. He published the paper\nRelative motion of thrown mass\n(\nRussian\n)\nin\n1866\nin the first part of volume\n1\nof\nMatematicheskii Sbornik\n. The paper begins:-\nIn determining relative motions, one usually uses general differential equations, which are obtained from the equations of absolute motion through a transformation of coordinates. For solving particular problems, such a method in most cases turns out to be insufficient, because integration of the equations of relative motion is rarely accessible. The complex form of these equations presents another inconvenience, that the meaning of the heterogeneous terms entering into them is not always sufficiently clear; and this circumstance can easily be the cause of inaccuracy or obscurity of exposition.\nBut the connection between absolute and relative coordinates, which is expressed by the transformation formulas and which serves to obtain differential equations, can obviously lead us directly to the integrals of relative motion, and precisely in those cases when the absolute motion is known.\nIn\n1867\n, he defended his doctoral dissertation with the title\nOn the Motion of a Free Liquid Mass\n(\nRussian\n)\n. Here is a short extract from the paper of the same name which he published in Volume\n2\nof\nMatematicheskii Sbornik\nin\n1867\n:-\nLacking the ability to integrate the general equations of hydrodynamics, we are forced to resort to an indirect method, the verification method, to solve problems about the motion of a fluid; we can, for example, make some assumption about the motion of the particles of the fluid, give the function p a certain form, and then, using the general equations, draw conclusions about the conditions under which the assumptions made take place. Obviously, for lack of anything better, this method can lead us to the solution of many problems of hydrodynamics; but even in this direction, little has been done; in the simplest case, when the movement of a homogeneous and completely free liquid mass is considered, only one question is developed about the uniform rotational movement of the liquid without changing the relative position of its particles and, consequently, without changing the appearance of the surface.\nZinger began lecturing at Moscow University in\n1862\n. One of the students he taught near the start of his career was\nNikolai Egorovich Zhukovsky\nwho is famed for his pioneering work on aerodynamics and is best known today for the so-called Joukowski aerofoil.\nZhukovsky\nwas a student at Moscow University from\n1864\nto\n1868\nand during these years he attended lectures on mechanics from both Zinger and Fyodor Alekseevich Sludsky\n(1841\n-\n1897)\nwho had been a student of\nBrashman\nand\nDavidov\n.\nZhukovsky\nspoke of the contrasting styles of these two lecturers; Zinger's teaching of the subject was visual, geometrically clear, while Sludsky's presentation of the material was exclusively abstract, consisting only of formulas, without any geometric illustrations.\nZhukovsky\nalso said that he chose to follow Zinger's style when he himself became a lecturer and became a follower of the visual method. After Zinger's death,\nZhukovsky\nspoke about the influence Zinger style had on him\n(\nsee for example\n[\n19\n]\n)\n:-\nWith his love for figurative geometric thinking, Zinger captivated young mechanics, directing their work along the path followed by the great geometers\nNewton\n,\nPoinsot\n,\nPoncelet\n, and\nChasles\n.\nIn both teaching and research Zinger had broad mathematical interests. In addition to mechanics, he taught higher algebra, differential calculus, analytical geometry, projective geometry, etc. His lectures were original, visual, carefully thought out and always attracted a large number of listeners. In\n[\n20\n]\nhis teaching is described as follows:-\nThe elegance of his presentation and the depth of his scientific ideas attracted many students to Zinger... One of the most significant features of Zinger's lectures was that in them he drew the attention of his listeners ... to the guiding ideas and forced them to clearly grasp the difference between the inner meaning of each question or method and those established ... techniques and transformations that constitute, as it were, the outer shell of pure speculation.\nOn\n19\nFebruary\n1869\nhe delivered the talk\nOn the fundamental theorem of higher geometry\nto the annual meeting of the\nMoscow Mathematical Society\n. He explained that he had chosen the topic because of its:-\n... special interest and deserves attention in many respects. Higher geometry, unfortunately still very little widespread, especially among us, is one of the sciences that has arisen and developed only in recent times: it is also called new geometry; and yet, both in content and in its fundamental principles, and especially in its method, it stands closer than all other sciences to the geometry of the ancients.\nYou can read an English translation of his talk at\nTHIS LINK\n.\nZinger continued to publish in\nMatematicheskii Sbornik\nwith papers such as:\nConstruction of a curve of the third order from nine given points\n(\nRussian\n)\n(1868)\n;\nRotational motion of a fluid ellipsoid with change of form\n(\nRussian\n)\n(1872)\n;\nOn a case of equilibrium of a liquid\n(\nRussian\n)\n(1873)\n; and\nOn the geometrical significance of inequalities\n(\nRussian\n)\n(1875)\n.\nToday Zinger is remembered both as a mathematician and as a botanist. We have looked at some of his mathematical contributions but so far have not mentioned his achievements in botany. He had been brought up in Moscow and for many years had no cause to become interested in the countryside. This changed in\n1865\nwhen he married Magdalena Ivanovna since her family lived on an estate in the village of Melekhovka in the Tula region about\n170\nkm south of Moscow. Zinger would spend free time there with his family and he often went for walks with Nikolay Nikolayevich Kaufman, a professor of botany at Moscow University. Zinger said\n[\n22\n]\n:-\nWhen I watched Kaufman collect and study plants, when I listened to his stories, my eyes were opened: the grass, the forest, and the soil appeared to me in a completely new light, full of the deepest interest.\nAlthough botany began as a hobby for Zinger, it steadily grew into a serious scientific study. He became friends with Dmitry Aleksandrovich Kozhevnikov who was a student in natural sciences in the Physics and Mathematics Department of Moscow University, graduating in\n1878\n. Zinger and Kozhevnikov began a systematic study of the flora of the Tula region in\n1877\nand in\n1880\npublished a joint work\nEssay on the Flora of the Tula Province\n(\nRussian\n)\n. In July\n1882\n, together with the botanist Dmitry Ivanovich Litvinov, Zinger explored Galichya Gora in the Zadonsky District, where there are limestone cliffs on the right bank of the Don River. They returned several times over the following years and discovered plants that were not typical for the East European Plain. The area has become a nature reserve. Zinger also undertook investigations of plants with the botanist Rudolf Ernestovich Trautfetter of the University of Dorpat.\nIn total Zinger wrote five botanical works, the most famous being the\n500\n-page work\nCollection of Information on the Flora of Central Russia\npublished in the \"Scientific Notes of Moscow University\" in\n1885\n. He wrote in the Preface\n[\n23\n]\n:-\nThere is no need to be a specialist to study our native flora successfully and profitably; what is needed is that love for the work and desire which transforms the considerable and not always easy work of collecting and identifying plants into a familiar favourite pastime and little by little turns a simple amateur into an experienced connoisseur. Unfortunately, our circumstances are such that of the many amateurs, very few manage to cope with the various difficulties that are inevitable for any beginner. In most cases, an amateur, interested and enthusiastic about the matter, from the very beginning gets lost in a heap of errors, contradictions, difficulties and cannot find not only advice or instructions from an experienced guide, but even a satisfactory book, so much as applicable to his needs. Involuntarily, despite his enthusiasm and desire, he has to abandon the matter and stop at the first step. On the other hand, there can be no good guides to local flora until the necessary factual material is collected with the help of the same amateur work. We believe that in the activities of our learned societies one of the most important duties and essential tasks should consist in encouraging and developing amateur work and in attracting to it the greatest possible number of people, because only with their assistance can we obtain from a multitude of unexplored places those factual data of which we are still so poor and which we have needed for so long.\nIn addition to his works on mathematics and botany, Zinger wrote two articles of a more philosophical nature, namely\nExact Sciences and Positivism\n(\nRussian\n)\n(1874)\nand\nMisunderstandings in Views on the Fundamentals of geometry\n(\nRussian\n)\n(1894)\n. L M Lopatin writes\n[\n7\n]\n:-\nHis few articles devoted to philosophical issues are always distinguished by the clarity of the author's fundamental views and the unique depth of his conclusions. One may not agree with his views, but even the harshest critic must give credit to the serious thoughtfulness and independent firmness of his philosophical convictions.\nYou can read some information about these two articles, including a number of quotes from the articles, at\nTHIS LINK\n.\nIn addition to his teaching, his mathematical research and his botanical research, Zinger held important roles in Moscow University. He was elected secretary of the Physics and Mathematics Faculty three times in the years between\n1870\nand\n1876\n. During these years,\n1870\n-\n1876\n, he was also a member of the university court. From June\n1876\nto February\n1878\n, Zinger was the dean of the Physics and Mathematics Faculty. From February\n1878\nto March\n1880\n, he held the position of vice-rector of Moscow University, but in March\n1880\n, he resigned from that role. In June\n1880\n, Zinger was elected for a second time as dean of the Physics and Mathematics Faculty and held this position until October\n1885\n.\nZinger also made an important contribution to Russian mathematics through translating works by\nMichel Chasles\n. Natalia Vasilievna Lokot writes\n[\n6\n]\n:-\nThe translation by V Ya Zinger of the work of\nMichel Chasles\n(1793\n-\n1880)\ndevoted to the history of geometry was a landmark in the period of infancy of the Russian history of mathematics. ... Neither the translator's nor the editor's name was provided on the cover of the Russian publication. However, it is common knowledge that Vasily Yakovlevich Zinger was the translator and the editor of this publication. ... His student, Konstantin Alekseevich Andreev\n(1848\n-\n1921)\n, stated that \"as a young man Vasily Yakovlevich was very passionate about Chasles' works and closely scrutinised them. . . He translated one of\nChasles\n' fundamental works ... into Russian in full, however, he did not do it diligently, he did not pursue editing details; instead, he did it as quickly as he was reading and speaking, because he always had a ready-to-use clear and precise phrase for each established or accepted idea.\" Thus, owing to the efforts of Moscow Society of Mathematics and V Ya Zinger, Russian historians of science were able to read the work of\nM Chasles\n, the acknowledged leader of French school of geometry of that time, in their native language.\nIn\n1888\nZinger's wife Magdalena Ivanovna died suddenly. Soon after her death, he married for the second time. He had for a long time been friends with Alexey Vasilyevich Letnikov\n(1837\n-\n1888)\n, a mathematician who worked on analytic geometry and the theory of differential equations. Zinger's second marriage was to Letnikov's daughter, Ekaterina Alekseyevna Letnikova. They had several children including Alexey Vasilyevich Zinger\n(1892\n-\n1945)\n, who became a Russian naval officer and a teacher of naval astronomy but lived in exile in France after the civil war; Natalya Vasilievna Zinger\n(1897\n-\n1977)\n, a professor of botany; and Vera Vasilievna Zinger\n(1900\n-\n1993)\n, who married Evgeny Alekseevich Chudakov\n(1890\n-\n1953)\nand their son Alexander Evgenyevich Chudakov\n(1921\n-\n2001)\nbecame a leading physicist.\nWhen Zinger reached the age of\n62\nin\n1898\n, he gave up lecturing at Moscow University and with his wife Ekaterina Alekseyevna and their children, moved to Melehovka. There they had an elementary school built which provided education for peasant children from the surrounding villages. During the Christmas holidays, the Zingers had a Christmas tree in their home which they invited the local children to visit; they gave the children who came presents and books to read. Ekaterina Alekseyevna was often ill with heart problems and she died in\n1903\n. On\n30\nAugust\n1904\n, Zinger married for the third time to\n25\n-year-old Anna-Maria-Elizaveta Aboling and the went to live in Moscow to bring up Zinger's young family. During the winter of\n1906\n-\n07\nZinger became ill with pneumonia and died in February\n1907\n. The funeral service took place in the university church of Saint Tatiana on Mokhovaya and he was buried in the Vagankovskoye Cemetery in Moscow.\nZinger received several honours. In\n1900\nhe was elected a corresponding member of the\nSt Petersburg Academy of Sciences\n. He was awarded the title of Honorary Doctor of Botany by the University of Dorpat. In\n1888\nbe became an honorary professor of pure mathematics at Moscow University. He was elected president of the\nMoscow Mathematical Society\nin\n1886\nand served in this role until\n1891\n. He is remembered today by botanists since at least two species of plants are named for Zinger.\nEleven days after his death a meeting of the\nMoscow Mathematical Society\nwas held at which a minute's silence was observed in memory of Vasily Yakovlevich. The Society decided to commission a portrait of Zinger to be hung in the meeting room of the Society, and asked for various articles on Zinger and his work to be prepared for a meeting on\n4\nApril\n1908\n. The articles which were presented on that occasion were printed in the\nMathematical Collection\nin\n1911\n; see\n[\n1\n]\n,\n[\n3\n]\n,\n[\n7\n]\n,\n[\n8\n]\nand\n[\n17\n]\n.\nLet us end this biography with a quote from the speech\nNikolai Egorovich Zhukovsky\nmade at an evening dedicated to the memory of Zinger on\n4\nApril\n1908\n(\nsee\n[\n17\n]\n)\n:-\nProfessor Zinger did not gain fame by the abundance of his scholarly works, but by the nature of these works. Everything he wrote, with its depth of content, was distinguished by clarity, completeness and concreteness of form. There are mathematical works which, once read, are remembered forever, just as a painting by a famous artist, briefly seen in an art gallery, is then clearly depicted in the imagination. The works of V Ya Zinger belong to this kind of works... His students, both mathematicians and mechanics, also tried to work in this direction... We honour the memory of a mathematician who can rightly be called the head of the Russian geometric school.",
  "matematicos_citados_na_biografia": [
    "Moscow Mathematical Society",
    "Imperial St Petersburg Academy of Sciences",
    "August Yulevich Davidov",
    "Nikolai Dmetrievich Brashman",
    "Nikolai Egorovich Zhukovsky",
    "Zhukovsky",
    "Brashman",
    "Davidov",
    "Newton",
    "Poinsot",
    "Poncelet",
    "Chasles",
    "THIS LINK",
    "Michel Chasles",
    "M Chasles",
    "St Petersburg Academy of Sciences"
  ],
  "imagens": [
    "zinger.jpg"
  ]
}