{
  "nome_completo": "Zoárd Geöcze",
  "nome_curto": "Zoárd Geöcze",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Geocze/",
  "data_nascimento": "23 August 1873",
  "local_nascimento": "Budapest, Hungary",
  "data_morte": "26 November 1916",
  "local_morte": "Budapest, Hungary",
  "summary": "Zoárd Geöcze was a Hungarian mathematician famous for his theory of surfaces.",
  "biografia": "Zoárd Geöcze\n's father taught at the Military Academy in Budapest. In fact Budapest had been created from the union of the towns of Pest, Buda, and Obuda in the year before Zoárd was born there, although it had operated as a single town from the time that the Chain Bridge across the Danube was opened in\n1849\n. Zoárd was brought up in Budapest in the period just after the Compromise put Hungary onto a different political footing.\nAfter an attempt to gain independence in\n1848\n, Hungary had been defeated and then controlled by the Habsburg Empire. However that Empire was weakened by external conflicts over the following decades and in the Compromise of\n1867\nthe Hungarian Kingdom and the Austrian Empire became independent states within the Austro-Hungarian Monarchy. Some Hungarians were happy with this arrangement, while others were not and would be satisfied with nothing short of full independence. Zoárd Geöcze's father was one of the leading Hungarian experts in military science at the time that the Compromise came into effect and he made a major contribution to developing Hungarian military terminology.\nGeöcze attended two secondary modern schools in Budapest where his performance was about average, and showed nothing of the brilliant mathematical abilities which he would later display. He completed his schooling and entered the University of Budapest intending to train to become a school teacher. He studied mathematics and wrote a Master's thesis on the construction of curves with special properties. However, things did not go particularly well for Geöcze for he managed to fall out with his professor\nJulius König\n.\nKönig\nran a seminar at the University of Budapest which inspired Geöcze who submitted a paper to\nKönig\nas his entry in a competition.\nKönig\nwas not happy with the way that the paper was written and Geöcze, instead of taking the good advice that\nKönig\nwas giving him, swore at his professor. No professor likes to be sworn at by their students, so\nKönig\n's reaction is entirely understandable; he withdrew his support from Geöcze so that it became essentially impossible for him to obtain an academic position.\nDespite the research potential that Geöcze had demonstrated, the only career now open to him in mathematics was as a secondary school teacher. Indeed he obtained a job as a mathematics teacher in a secondary school in Podolin, and there he met and married Irma Lippóczy. She was\n[\n1\n]\n:-\n... an ideal partner and devoted helper of her husband through the difficulties of life. ... Their marriage was blessed with seven sons and a daughter, and Geöcze adored his children, although the happiness of the family was overcast with grave financial difficulties.\nIn\n1899\nGeöcze left Podolin and took up a position in Ungvár. The town is today Uzhgorod, in western Ukraine, but when Geöcze went to teach there\n(\nand for\n20\nyears after that\n)\nit was in Hungary. It was in Ungvár that Geöcze published his first mathematics paper, in the\n1904\n-\n5\nyearbook of the school where he taught. In this paper he constructed a function which was continuous everywhere but in every interval, no matter how small, it had infinite length. In\n1957\nthe function was shown to also have the property that it was nowhere differentiable. In the yearbook for the following year,\n1905\n-\n6\n, Geöcze published another paper this time dealing with the problems of surface area. Here is how Geöcze defined the area of a surface.\nSuppose we have a region\nF\nF\nF\non a surface. Subdivide\nF\nF\nF\ninto\nF\n1\n,\nF\n2\n,\n.\n.\n.\n,\nF\nn\nF_{1}, F_{2}, ... , F_{n}\nF\n1\n​\n,\nF\n2\n​\n,\n.\n.\n.\n,\nF\nn\n​\nand let\na\nj\n,\nb\nj\n,\nc\nj\na_{j}, b_{j}, c_{j}\na\nj\n​\n,\nb\nj\n​\n,\nc\nj\n​\nbe the areas of\nF\nj\nF_{j}\nF\nj\n​\nwhen projected onto the\nx\ny\nxy\nx\ny\n-plane, the\nx\nz\nxz\nx\nz\n-plane, and the\ny\nz\nyz\ny\nz\n-plane, respectively. Then Geöcze defined the area of\nF\nF\nF\nto be the supremum of\n√\n(\na\nj\n2\n+\nb\nj\n2\n+\nc\nj\n2\n)\n√(a_{j}^{2} + b_{j}^{2} + c_{j}^{2})\n√\n(\na\nj\n2\n​\n+\nb\nj\n2\n​\n+\nc\nj\n2\n​\n)\nover all possible subdivisions of\nF\nF\nF\n.\nGeöcze's papers were seen by a professor at the University of Kolozsvár who suggested that he write up his ideas and submit them to\nComptes Rendus\nfor publication. This he did and the paper\nQuadrature des surfaces courbes\nappeared in volume\n144\npublished in\n1907\n. On the basis of this Geöcze was awarded a scholarship to study in Paris for a year. He spent\n1908\nin Paris where he learnt of the effective theory of the measure of sets of points being developed by\nBorel\n,\nBaire\nand\nLebesgue\n. This work marks the beginning of the modern theory of functions of a real variable, but before arriving in Paris Geöcze had not been familiar with this theory; in particular he had not known of\nLebesgue\n's definition of surface area. See\n[\n4\n]\nfor a description of Geöcze's work on surface measurement and a discussion of how his ideas have been taken forward.\nIt appears that although Geöcze had brilliant ideas, he did not have the skill to express these ideas in a way that was easily understood by other mathematicians. The reason why as an undergraduate he fell out with his professor\nKönig\nwas through frustration at his difficulty communicating his ideas. Again in Paris he had similar difficulties, for\nLebesgue\nalso found it hard to understand a paper which Geöcze asked him to comment on, and returned it to Geöcze saying that the style of the paper, together with the large amount of notation and definitions meant he had given up trying to understand it.\nGeöcze returned to Ungvár where he taught during\n1909\n, but then returned to Paris in\n1910\nwhen he was awarded a doctorate from the Sorbonne. With an increasing international reputation as a mathematician, but still only a secondary school teacher in Hungary, Geöcze decided that he would be better moving to Budapest. This he did, again getting a job as a secondary school teacher and in\n1913\nhe was also appointed as a\ndozent\nin \"functions of a real variable\" at Budapest University. Having just made his breakthrough into the academic world, his career was ruined by the outbreak of World War I.\nRelations with Serbia and Romania had deteriorated as the result of their attempts to stir up feelings of discontent among non-Hungarian speaking workers in the border regions of Hungary. After the assassination of the Archduke Francis Ferdinand on\n28\nJune\n1914\nin Sarajevo, the Austro-Hungarian authorities issued an ultimatum demanding that anti-Austro-Hungarian newspapers in Serbia be suppressed and anti-Austro-Hungarian teachers be dismissed. By July\n1914\nthe countries were at war and Germany soon joined the Austro-Hungarian side. Geöcze was called up into the Austro-Hungarian army and sent to the front where the army was attacking Serbia. The Serbians, however, forced the Austro-Hungarian army to retreat and Geöcze's regiment suffered extreme hardship. Geöcze was one of the survivors and he, together with other survivors, was put into a regiment which was then sent to the fighting on the northern front near Chernovitsy\n(\nnow in southwestern Ukraine\n)\n.\nThe commander of the regiment saw that Geöcze was better suited to tasks other than trench warfare, and put him in charge of a power station and its network of supply lines. Although the work was extremely hard, Geöcze found time to continue his mathematical research and sent papers containing his results to Budapest by military post. However the hardship took its toll and Geöcze became ill and was sent from Chernovitsy to Vienna. His health, however, did not improve and he was sent back to Budapest where, in the spring of\n1916\nhe was taken to hospital. He suffered heart problems and edema, an accumulation of watery fluid in the tissue and died in the autumn of\n1916\n.\nThe Mathematical and Physical Society met in Budapest on\n7\nDecember\n1916\nand\nLoránd Eötvös\ngave a commemorative speech for Zoárd Geöcze\n(\nsee for example\n[\n1\n]\nor\n[\n2\n]\n)\n:-\nThe great mathematician, our dear colleague Zoárd Geöcze, who used to inform us here of his sensational results on the theory of surfaces, died on\n26\nth\nof last month of a disease contracted at the front. No difficulties at home, no noise from his children, no horrors of the trenches or the thunder of guns were able to distract Zoárd Geöcze from concentrating on the solution of his favourite problem and making efforts to widen and deepen our knowledge of the subject.",
  "matematicos_citados_na_biografia": [
    "Julius König",
    "König",
    "Borel",
    "Baire",
    "Lebesgue",
    "dozent",
    "Loránd Eötvös"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}