{
  "nome_completo": "Zoltán Tibor Balogh",
  "nome_curto": "Zoltán Balogh",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Balogh/",
  "data_nascimento": "7 December 1953",
  "local_nascimento": "Debrecen, Hungary",
  "data_morte": "19 June 2002",
  "local_morte": "Oxford, Ohio, USA",
  "summary": "Zoltán Balogh was a Hungarian-born mathematician, specialising in set-theoretic topology.",
  "biografia": "Zoltán Balogh\nwas the son of Tibor Balogh\n(1930\n-\n1972)\nand his wife Ilona Kelemen\n(1931\n-\n2015)\n. His friends and colleagues all called him Zoli, and in fact the biography\n[\n2\n]\nis simply entitled \"Zoli.\" His father, Tibor Balogh, was a mathematician whose research interests were in matrix-valued stochastic processes. He was a professor at the Kossuth Lajos University of Debrecen and published papers such as\nThe solution of a minimum problem\n(1961)\n,\nMatrix-valued stochastical processes\n(1961)\n, and\nThe estimation of the mean value of a matrix-valued discrete stationary stochastic process\n(1962)\n. Ilona Kelemen was a chemist and also a professor at the Kossuth Lajos University. Zoltán\nhad a younger sister Agnes who trained as a medical doctor and practised in Debrecen.\nBalogh was educated in Debrecen where he attended the Fazekas Mihaly\nGymnasium\n. As did many Hungarian school children with mathematical talents at this time, he entered the mathematics competitions organised by KöMal, the Középiskolai Matematikai és Fizikai Lapok\n(\nHigh School Mathematics and Physics Journal\n)\n. This Journal had begun posing competition problems for high school children in\n1894\nand, after a couple of short breaks due to World War I and World War II, had continued the competitions. Balogh entered these competitions and won awards. In the same year that the problem solving journal KöMal was launched, the Hungarian Mathematical and Physical Society decided to start up a mathematical competition for those graduating from secondary schools. It was called the\nEötvös\nCompetition, in honour of\nLoránd Eötvös\nwho was, in that year, made minister of education in the Hungarian government. The competition renamed the\nKürschák\nMathematical Competition after World War II, always consisted of three problems and those entering the competition had to answer the questions under examination conditions in an afternoon. The\n1972\ncompetition, the\n72\nnd\nKürschák\nCompetition, posed the following three questions:\nA triangle has sides with lengths\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\n. Prove that\na\n(\nb\n−\nc\n)\n2\n+\nb\n(\nc\n−\na\n)\n2\n+\nc\n(\na\n−\nb\n)\n2\n+\n4\na\nb\nc\n>\na\n3\n+\nb\n3\n+\nc\n3\n.\na(b - c)^{2} + b(c - a)^{2} + c(a - b)^{2} + 4abc > a^{3} + b^{3} + c^{3}.\na\n(\nb\n−\nc\n)\n2\n+\nb\n(\nc\n−\na\n)\n2\n+\nc\n(\na\n−\nb\n)\n2\n+\n4\na\nb\nc\n>\na\n3\n+\nb\n3\n+\nc\n3\n.\nA class has\nn\n>\n1\nn > 1\nn\n>\n1\nboys and\nn\nn\nn\ngirls. For each arrangement\nX\nX\nX\nof the class in a line let\nf\n(\nX\n)\nf (X)\nf\n(\nX\n)\nbe the number of ways of dividing the line into two non-empty segments, so that in each segment the number of boys and girls is equal. Let the number of arrangements with\nf\n(\nX\n)\n=\n0\nf (X) = 0\nf\n(\nX\n)\n=\n0\nbe\nA\nA\nA\n, and the number of arrangements with\nf\n(\nX\n)\n=\n1\nf (X) = 1\nf\n(\nX\n)\n=\n1\nbe\nB\nB\nB\n. Show that\nB\n=\n2\nA\nB = 2A\nB\n=\n2\nA\n.\nA\nB\nC\nD\nABCD\nA\nB\nC\nD\nis a square side\n10\n. There are four points\nP\n1\n,\nP\n2\n,\nP\n3\n,\nP\n4\nP_{1}, P_{2}, P_{3}, P_{4}\nP\n1\n​\n,\nP\n2\n​\n,\nP\n3\n​\n,\nP\n4\n​\ninside the square. Show that we can always construct line segments parallel to the sides of the square of total length\n25\nor less, so that each\nP\ni\nP_{i}\nP\ni\n​\nis linked by the segments to both of the sides\nA\nB\nAB\nA\nB\nand\nC\nD\nCD\nC\nD\n. Show that for some points\nP\ni\nP_{i}\nP\ni\n​\nit is not possible with a total length less than\n25\n.\nBalogh entered the\n1972\nKürschák\nCompetition and produced an outstanding performance.\nIn\n1972\nBalogh graduated from the Fazekas Mihaly Gymnasium and entered the Kossuth Lajos University of Debrecen to begin the five year course which would reach the level of a Master's Degree. In the year he entered university his father died from a circulatory disease at the age of\n42\n. Balogh was aware that this disease was due to his father's genetic makeup and so he was likely to inherit similar health problems. While still an undergraduate, Balogh began to undertake research. He attended the Fourth Prague Topological Symposium in\n1976\nand delivered the lecture\nRelative compactness and recent common generalizations of metric and locally compact spaces\n. He presented a paper with this title to the conference proceeding and the\n8\n-page paper was published in\n1977\n. It became his first publication and is remarkable for introducing the concept of \"relative compactness.\" This outstanding paper led to Balogh being awarded the Renyi Kato Memorial Prize by the\nJanos Bolyai Mathematical Society\nin\n1977\n. The Society awards this Prize to \"an outstanding young researcher in mathematics.\" In the same year he graduated from the Kossuth Lajos University of Debrecen.\nWith such an outstanding start to his research career, it was natural for Balogh to continue to undertake research at the Kossuth Lajos University of Debrecen. While undertaking research, he was employed as a Teaching Assistant and, later, as a Research Fellow. He attended the Fourth Colloquium in Budapest in\n1978\nand presented the paper\nOn the heredity of being a paracompact M-space and its relation to the normal Moore space conjecture\nwhich was published in the Proceedings. He also attended the Meeting on General Topology at the University of Trieste in\n1978\nand presented the paper\nOn recent common generalizations of metrizable and compact\nT\n2\nT_{2}\nT\n2\n​\nspaces\nwhich was published in the Proceedings of that conference. His third publication in\n1978\nwas\nRelative compactness and recent common generalizations of metric and locally compact spaces.\nThree of his papers were published in\n1979\n, namely\nMetrization theorems concerning relative compactness; On the structure of spaces which are paracompact p-spaces hereditarily\n; and\nRelative countable compactness.\nAs a result of these publications, the\nJanos Bolyai Mathematical Society\npresented Balogh with their Grunwald Geza Memorial Prize, which they award annually to an outstanding researcher under the age of\n30\n. In\n1980\nBalogh was awarded a Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin Topology and Set-theory from he Kossuth Lajos University of Debrecen and a Ph.D. from the\nHungarian Academy of Sciences\n.\nWhile Balogh was an undergraduate at the Kossuth Lajos University of Debrecen he got to know Eva Balicza who was a student in the same class. They were married in\n1976\nwhen Balogh was still studying for his first degree. Their two daughters, Agnes\n(\nborn\n1978)\nand Judit\n(\nborn\n1979)\n, were born before Balogh completed studying for his Candidate's Degree. The marriage, however, did not last and Balogh and his wife were divorced in\n1981\n.\nAfter the award of his Candidate's Degree in\n1980\n, Balogh remained at the Kossuth Lajos University of Debrecen. He had already been appointed as a Junior Research Fellow in August\n1979\nand during the next years he was promoted first to Research Fellow and then to Senior Research Fellow. He continued to hold this position until May\n1984\n. He spent the summer of\n1984\nin Canada. He had been offered a visiting professor position at the University of Toronto for three months and spent June\n1984\nto August\n1984\nin Toronto. In September\n1984\nhe returned to Debrecen and in November he married Agnes Polgar. Agnes was an undergraduate at the Kossuth Lajos University of Debrecen studying chemistry. Balogh, together with his wife Agnes, left Debrecen less than two months after their marriage and travelled to the United States where Balogh had been offered a Visiting Associate Professorship at Texas Tech University in Lubboch, Texas. This institution had been founded in\n1923\nas Texas Technological College and had formally become Texas Tech University in\n1969\n. He had only been there for a few months when he had major heart problems\n[\n2\n]\n:-\nIn June of\n1985\nZoli was faced with his first life-threatening medical emergency when he underwent open heart surgery for a bypass operation. Zoli had been having some chest pains and only a few days earlier, he and a friend had noticed an unusual shortness of breath. While in the hospital, being prepared for surgery, Zoli had a heart attack and only the proximity of immediate medical help saved his life. He was\n31\nyears old. In every other way, Zoli was a healthy young man - certainly, his weight was good and he was a non-smoker. Because his father died at an early age, Zoli knew that he had a genetic predisposition for circulatory disease. He began to watch his diet more carefully and for many years became an avid practitioner of various types of aerobic exercises, including walking, running, and bicycling.\nIn July\n1986\n, Balogh and his wife returned to Hungary and he was again employed at the Kossuth Lajos University of Debrecen. now as an Associate Professor. His wife Agnes had been near the end of her undergraduate chemistry course when she married and left for the United States so she now completed her degree. Their first son Adam was born in\n1987\n. Balogh worked on his\nhabilitation\nthesis and he submitted\nSet-theoretic investigations on the classes of compact and locally compact spaces\n(\nHungarian\n)\nto the\nHungarian Academy of Sciences\nin\n1988\n. He returned to the United States in\n1988\nwhen he was appointed as a Distinguished Visiting Professor in the Department of Mathematics and Statistics of Miami University in Ohio. He planned to spend two years in the United States before returning to Hungary and in\n1989\nhis habilitation thesis was accepted by the\nHungarian Academy of Sciences\nso everything was set for his return. First he had his second year as a visiting professor in the United States and he spent the first semester of this second year, September\n1989\nto January\n1990\n, as a Visiting Associate Professor at the University of Wisconsin at Madison. For the second semester of\n1989\n-\n90\nhe returned to his visiting position at the Miami University.\nAt Miami University Balogh was working on the exceedingly beautiful Oxford campus in Oxford, Ohio. This city, a college town based largely on serving the university, is in the Miami Valley in south west Ohio. Balogh had fallen in love with the university and so when he was offered a tenure track position there he decided that he would not return to Hungary as he had originally planned but he would accept the permanent position at Miami University. He took up this position of Associate Professor in August\n1990\n. Soon after, in January\n1991\n, Zoli and Agnes Balogh's second son Daniel was born.\nDennis Burke and Gary Gruenhage give a detailed account of Balogh's mathematics in\n[\n1\n]\n. Let us quote here their introduction:-\nZoli's research was in set-theoretic topology. ... Deep infinitary combinatorics lie at the heart of many problems in this field, and thus their solutions frequently make use of the tools of modern set theory, e.g. special axioms such as the continuum hypothesis or Martin's Axiom, or building models of set theory by\nCohen\n's method of forcing. Statements shown to be true using special axioms or models are thereby proven consistent with the usual axioms of ZFC\n(\nthe\nZermelo\n-\nFraenkel\naxioms plus the\naxiom of choice\n)\n. Sometimes the negation of a consistent statement is also shown to be consistent, and hence the statement is independent of ZFC. ... A problem in set-theoretic topology is not considered \"solved\" until either its statement is proven independent, or a positive or negative answer in ZFC is found. Some of Zoli's best results were finding ZFC solutions to problems for which previously only a consistent answer was known. Zoli's research spans\n25\nyears or so, and includes many significant contributions in diverse areas within set-theoretic topology. ... What makes Zoli's research especially stand out are a series of solutions to several long-standing problems in the field, which he obtained at an amazing pace starting in the mid-\n1980\ns, continuing essentially until his death.\nBalogh had always known that his health might let him down again and indeed it did in the summer of\n1999\n. He suffered a massive stroke but was saved by some innovative new medical treatment. You can read an extract from\n[\n4\n]\nin which his collapse and subsequent treatment are described in detail at\nTHIS LINK\n.\nHis recovery was remarkable, so much so that only a couple of weeks after his stroke he was on a flight to New York to attend the\n1999\nSummer Conference on Topology and its Applications. Balogh certainly did not ease up following this major stroke for he continued to undertake research with three papers appearing in print in\n2001\nand a further three in\n2002\n. He continued to attend conferences and he was invited to speak in the set-theoretic topology section of the 'International Conference on Topology and its Applications' held at Shimane University in Matsue City, Japan from\n24\nto\n28\nJune\n2002\n. He was to lecture on\nJig-sawed bases and metrization\n. He received another invitation to lecture in Tsukuba, Japan, before attended the conference in Matsue City. He died suddenly on the morning of the\n19\nth\nJune, the day he was due to fly to Japan. In fact six papers by Balogh appeared in print in\n2003\nand later, submitted for publication before his death.\nLet us end with the tribute from the Editors of\nPublicationes Mathematicae Debrecen\n[\n3\n]\n:-\nHe was a man of wide interests and of a broad intellectual horizon. He like to meet old and new friends and talk with them about mathematics. His early departure at the height of his creative power is a considerable loss for mathematics both in Hungary and in the USA. He was full of promising plans which will be realised no more. With him we lost an outstanding mathematician, a warm-hearted colleague, a good friend and a member of our Editorial Board.",
  "matematicos_citados_na_biografia": [
    "Gymnasium",
    "Eötvös",
    "Loránd Eötvös",
    "Kürschák",
    "Janos Bolyai Mathematical Society",
    "Hungarian Academy of Sciences",
    "habilitation",
    "Cohen",
    "Zermelo",
    "Fraenkel",
    "axiom of choice",
    "THIS LINK"
  ],
  "imagens": [
    "thumbnail.jpg"
  ]
}