{
  "nome_completo": "Zu Geng",
  "nome_curto": "Zu Geng",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zu_Geng/",
  "data_nascimento": "about 450",
  "local_nascimento": "Jiankang, (now Nanjing, Kiangsu province), China",
  "data_morte": "about 520",
  "local_morte": "China",
  "summary": "Zu Geng was a Chinese mathematician whose greatest achievement was to compute the diameter of a sphere of a given volume.",
  "biografia": "Zu Geng\nis also known by the name\nGeng Zhi Zu, Zu Xuan\nor\nTsu Keng.\nHe was the son of\nZu Chongzhi\nand so came from a famous family who had for many generations produced outstanding mathematicians. The family was originally from Hopeh province in northern China. Zu Geng's great great grandfather was an official at the court of the Eastern Chin dynasty which had been established at Jiankang\n(\nnow Nanking\n)\n. Weakened by court intrigues, the Eastern Chin dynasty was replaced after a revolt by the Liu-Sung dynasty in\n420\n. Zu Geng's great grandfather, grandfather, and father\nZu Chongzhi\n, all served as officials of the Liu-Sung dynasty which also had its court at Jiankang\n(\nnow Nanking\n)\n.\nThe Zu family was an extremely talented one with successive generations being, in addition to court officials, astronomers with special interests in the calendar. They handed their mathematical and astronomical skills down from father to son and, indeed, this was one of the main ways that such skills were transmitted in China at this time. Zu Geng, in the family tradition, was taught a variety of skills as he grew up. In particular he was taught mathematics by his talented father\nZu Chongzhi\n.\nZu Geng's greatest achievement was to compute the diameter of a sphere of a given volume. We know of this work through the commentary of\nLi Chunfeng\non the\nNine Chapters on the Mathematical Art\n. The final two problems in Chapter\n4\n: Short Width ask for the diameter of a sphere of given volume. For example Problem\n25\n, the final problem in Chapter\n4\n, states:-\nGiven a volume of\n1644866437500\ncubic chi, tell what is the diameter of the sphere.\nThe answer given is\n14300\nchi but\nLi Chunfeng\nnotes that the precise answer should be\n14643\n3\n4\n14643\\large\\frac{3}{4}\\normalsize\n1\n4\n6\n4\n3\n4\n3\n​\nchi. He then writes\n(\nsee for example\n[\n3\n]\n)\n:-\nZu Geng said that both\nLiu Hui\nand\nZhang Heng\ntook the cylinder for the square rate and its inscribed sphere for the circle rate. And, therefore, Zu suggested a new hypothesis himself. His Rule states: \"Double the given volume and extract its cube root, and we have the diameter of the sphere.\" But why should this be?\nLi Chunfeng\nthen goes on to indicate how Zu Geng proved his result.\n(\nNotice of course, that the formula presented assumes that π =\n3\n.\n)\nThe proof is based on what is now called the principle of\nLiu Hui\nand Zu Geng, namely:-\nThe volumes of two solids of the same height bear a constant ratio if the areas of the plane sections at equal heights have the same ratio.\nThis is a generalisation of what is often called\nCavalieri\n's principle. Zu cut his circumscribed cube into\n8\nsmall equal cubes. He now only has to consider one of the small cubes. He makes two dissections of the small cubes by cylindrical cuts, obtaining\n4\nsmaller pieces. He then applies his principle to find the volumes of his pieces.\nAfter showing how Zu Geng used the principle to justify the formula for the volume of a sphere,\nLi Chunfeng\ngoes on to give Zu Geng's more precise form:-\nAccording to the precise rate, the volume of the sphere is the cube of the diameter multiplied by\n11\nand divided by\n21\n.\nNotice that this version is the same rule as given above, yet now with\nπ\n=\n22\n7\n\\pi = \\large\\frac{22}{7}\\normalsize\nπ\n=\n7\n2\n2\n​\n. This is significant, for Zu Geng has seen the link between squaring the circle and cubing the sphere, and has been able to translate progress on the first of these two problems into progress on the second.\nAs a final comment let us note that Zu Geng was certainly not the last member of the famous Zu family to make important contributions. Zu Geng's son, Zu Hao, was also well known as a mathematical astronomer making contributions to the science of the calendar.",
  "matematicos_citados_na_biografia": [
    "Zu Chongzhi",
    "Li Chunfeng",
    "Nine Chapters on the Mathematical Art",
    "Liu Hui",
    "Zhang Heng",
    "Cavalieri"
  ],
  "imagens": []
}