{
  "nome_completo": "Abigail A Thompson",
  "nome_curto": "Abigail Thompson",
  "ano_nascimento": "1958",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thompson_Abigail/",
  "lugar_nascimento": "Norwalk, Connecticut, USA",
  "lugar_morte": null,
  "biografia": "Abigail Thompson\nattended Wellesley College, a private women's liberal arts college in Wellesley, Massachusetts, on the shore of Lake Waban. She graduated with a B.A. in\n1979\n.  Thompson undertook research at Rutgers University in New Jersey where she was advised by Martin George Scharlemann and Julius L Shaneson. She was awarded a Ph.D. in\n1986\nfor her thesis\nProperty P for Some Classes of Knots\n. Now let us give some technical details about her thesis. A knot in\nS\n3\nS^{3}\nS\n3\nhas property\nP\nP\nP\nif no non-trivial\nDehn\nsurgery yields a\n3\n-sphere. There is a conjecture that all non-trivial knots in\nS\n3\nS^{3}\nS\n3\nhave property\nP\nP\nP\n, but this appears still to be open. What is known is that many classes of knots do have property\nP\nP\nP\nand, in her thesis, Thompson added two further classes. We should note, however, that proving these classes satisfied property\nP\nP\nP\nwas quite a significant step in adding weight to the belief that the conjecture had a positive answer. In particular the second chapter of her thesis shows that knot with a non-trivial band-connect sum has property\nP\nP\nP\n. She published this result in her first paper\nProperty P for the band-connect sum of two knots\n(1987)\n.\nFollowing the award of her doctorate Thompson spent the academic year\n1986\n-\n87\nat the Hebrew University in Jerusalem, the leading university in Israel. This year was funded by a Lady Davis Fellowship and, following this, she was awarded a University of California President's Postdoctoral Fellowship which funded the year\n1987\n-\n88\nat Berkeley. In\n1988\nshe joined the Davis Faculty of the University of California and she was awarded a National Science Foundation Postdoctoral Fellowship for the three years\n1988\n-\n91\n. The last of these three years,\n1990\n-\n91\n, she spent as a member of the Institute for Advanced Study at Princeton. Ten years later she again spent a year\n(2000\n-\n01)\nat the Institute for Advanced Study but between these two years spent at Princeton she had produced outstanding research which led to her being awarded the Ruth Lyttle Satter Prize in Mathematics by the\nAmerican Mathematical Society\nin\n2003\n. Before quoting from the citation for the award, we will give a more elementary overview of knots. First we quote from summary of an undergraduate lecture\nKnots, Links and\n3\n-Manifolds\nwhich Thompson delivered to the Mathematics Department Colloquium at California State University, Fresno:-\nThe mathematical theory of knots is a very active field of modern mathematics with a long history. Natural questions like: \"How many really different knots are there?\" turn out to be quite complicated and are still not efficiently understood. Examples of knots and links and the notion of when two knots are the same will be presented. Crossing number and other important invariants of knots will be discussed. Knot theory is an important part of the general theory of three-dimensional topological spaces and connections with that will also be discussed.\nAn overview of her research appears in\n[\n4\n]\n:-\nProfessor Abigail Thompson studies combinatorial methods in\n3\n-dimensional topology. Despite the recent influence of algebraic and geometric techniques such as quantum groups, hyperbolic geometry, and algebraic varieties in the study of\n3\n-manifolds, most of the fundamental arguments involve or can be reduced to cutting and pasting surfaces and manifolds and studying their possible combinatorial configurations. Knots and links are an especially good starting point for such reasoning, both because complements are representative examples of\n3\n-manifolds, and because the knots and links in a\n3\n-manifold are a fundamental part of its structure.\nLet us now return to the more technical citation for the\n2003\nSatter Prize which reads\n[\n1\n]\n:-\nThe Ruth Lyttle Satter Prize in Mathematics is awarded to Abigail Thompson for her outstanding work in\n3\n-dimensional topology. As a consequence of her work, the concept of thin position, first introduced by Gabai for the study of knots in the\n3\n-sphere, has emerged as a major tool for attacking some of the fundamental problems in the study of\n3\n-manifolds. Her paper \"Thin position and the recognition problem for\nS\n3\nS^{3}\nS\n3\n\"\n(1994)\n, used the idea of thin position to reinterpret Rubenstein's solution to the recognition problem of the\n3\n-sphere in a startling way. Her papers with Martin Scharlemann, \"Thin position for\n3\n-manifolds\"\n[\ndelivered at the Geometric Topology Conference in Haifa,\n1992]\n(1994)\n; and \"Thin position and\nHeegaard\nsplittings of the\n3\n-sphere\"\n(1994)\n, provide remarkable applications of thin position to\nHeegaard\nsplittings of\n3\n-manifords. Her\n1997\npaper \"Thin position and bridge number for knots in the\n3\n-sphere\"\n(1997)\n, gives a completely unexpected connection in the case of knots in\n3\n-spheres between thin position and the much more classical notion of bridge position.\nIn her response after receiving this prestigious award, Thompson thanked some of those who had supported her\n[\n1\n]\n:-\nI am very grateful to the\nAmerican Mathematical Society\nand the Satter Prize Committee for awarding me this prize. I have been supported and encouraged throughout my career by many mathematicians, especially Ann Stehney, Bill Menasco, and\nRob Kirby\n. I am also deeply indebted to my long-time collaborator, Marty Scharlemann. The Satter Prize is particularly meaningful to me, because\nJoan Birman\n, whose generosity funded the prize, has been a great inspiration to me in my field.\nAs a final comment on her research, let us quote the Abstract of the lecture\nThe stabilization problem for\n3\n-manifolds\nwhich Thompson gave at the University of Texas Distinguished Women in Mathematics Lecture Series in the spring of\n2009\n:-\nSurprisingly, any closed orientable\n3\n-manifold can be split into two simple pieces, called handlebodies. The simplicity stops there, sadly, and understanding the relationships among different splittings of the same manifold is an ongoing task. I'll describe the stabilization problem for such splittings of\n3\n-manifolds, and some recent examples which underscore the difficulty of the problem. This is joint work with Joel Hass and\nWilliam Thurston\n.\nThe work described by Thompson in this lecture related to her paper\n(\nwith Joel Hass and\nWilliam Thurston\n)\nStabilization of Heegaard splittings\n(2009)\n.\nThere are other aspects of Thompson's contributions which we wish to highlight in this biography. One of these is the contribution she has made to reform of mathematics education in California's schools. Thompson is married with three children and first became aware of the educational problems when her daughter started attending state education in Davis. She said\n[\n3\n]\n:-\nI realized she wasn't learning any mathematics.\nThompson claimed, in an editorial in the\nDavis Enterprise\nnewspaper, that\n[\n2\n]\n:-\n... every child finishing sixth grade should be able, without a calculator, to compute any percentage of anything, to add, subtract, multiply, and divide positive and negative whole numbers of any size, any fractions and decimals.\nThe proposed reform consisted of introducing a new curriculum supported by resources called Mathland. Thompson attacked the Mathland material in a letter to\nDavis Enterprise\n[\n5\n]\n:--\nThe new curriculum, and particularly the proposed Mathland materials, addresses neither our children's lack of basic skills nor their poor performance on tests. It instead wholeheartedly embraces the philosophy of the mathematics \"reform\" movement popular for the last ten years or so, a movement that is being seriously questioned by both the mathematical and the educational community. One tenet of this movement is that standardized tests are an inappropriate way to measure mathematical skills. Instead, interviews with students, essay questions, and evaluations of portfolios of student work are substituted. These are the primary methods of evaluation in the Mathland curriculum. Another tenet is that drill in basic computational skills is not only unnecessary but probably harmful. This is also reflected in the Mathland materials. The level of computational skills required of the students is very low, and the quantity of computational work is minimal. ... The Mathland materials have some attractive features. They do indeed seem to make math \"fun\" for many students, they are well-organized, which should make life much easier for the teachers, and they are cohesive across the grades. In addition to the above flaws, however, they emphasize activities over ideas, and they provide no way for children to work independently. The instructions in the student workbooks are so poorly written that students could not be expected to follow them without considerable help. While the Mathland materials might be a useful component of a program containing a substantial amount of more \"traditional\" mathematics, it would be foolish to adopt something with such obvious inadequacies.\nBut Thompson not only pointed out problems with education reforms in California but she made considerable efforts to improve the situation by helping to launch \"Starting With Math\", a University of California at Davis programme aimed at strengthening teachers' knowledge of mathematics. She was also the director of COSMOS, the California State Summer School in Mathematics and Science consisting of a month-long residential course run at Davis for the best high school pupils.\nFinally we look at the considerable contribution that Thompson has made to the\nAmerican Mathematical Society\n. She served as editor of the\nTransactions\nof the\nAmerican Mathematical Society\nduring\n2001\n-\n2003\nand served on the Centennial Prize Committee during\n2002\n-\n2004\n(\nbeing chair of the Committee during\n2003\n-\n2004)\n. In\n2004\nshe was elected to the Editorial Boards Committee of the\nAmerican Mathematical Society\n. Here is the Statement which she made when putting herself forward for this position:-\nThe principal obligation of the Editorial Boards Committee is to ensure the continued high quality of the Society's publications by appointing\n1)\nexcellent and\n2)\nwell-organized mathematicians to be editors.\nFinding people to satisfy both criteria is not a small task. While the first is not so hard, most of the people satisfying the second went into accounting where they are making twice our average salaries. In addition to this I would work to introduce some of the successful electronic practices from other journals designed to speed the time to decision on papers. That is, when we appoint someone not satisfying criterion #\n2\n(\nno names will be mentioned here, except possibly my own\n)\nthe journal system for processing papers should provide a back-up to prevent unnecessary delays. Famous stories about editors surrounded by stacks of papers never sent out for review are amusing only in retrospect.\nAmerican Mathematical Society\njournals must remain competitive both in quality and in efficiency with both traditional and on-line journals."
}