{
  "nome_completo": "Abraham bar Hiyya Ha-Nasi",
  "nome_curto": "Abraham bar Hiyya",
  "ano_nascimento": "1070",
  "ano_morte": "1136",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Abraham/",
  "lugar_nascimento": "Barcelona (now Spain)",
  "lugar_morte": "Provence, France",
  "biografia": "Abraham bar Hiyya\nwas a Spanish Jewish mathematician and astronomer. In the Hebrew of his time 'Ha-Nasi' meant 'the leader' but he is also known by the Latin name\nSavasorda\nwhich comes from his 'job description' showing that he held an official position in the administration in Barcelona.\nAbraham bar Hiyya is famed for his book\nHibbur ha-Meshihah ve-ha-Tishboret\n(\nTreatise on Measurement and Calculation\n)\n, translated into Latin by Plato of Tivoli as\nLiber embadorum\nin\n1145\n. This book is the earliest Arab algebra written in Europe. It contains the complete solution of the general\nquadratic\nand is the first text in Europe to give such a solution. Rather strangely, however,\n1145\nwas also the year that\nal-Khwarizmi\n's algebra book was translated by Robert of Chester so Abraham bar Hiyya's work was rapidly joined by a second text giving the complete solution to the general quadratic equation.\nIt is interesting to see the areas of mathematics and the mathematicians with which Abraham was familiar. Of course he knew geometry through the works of\nEuclid\n, but he also knew the contributions to geometry from other Greek texts such as\nTheodosius\n's\nSphaerics\nin three books,\nOn the Moving Sphere\nwhich is a work on the geometry of the sphere by\nAutolycus\n,\nApollonius\n's\nConics\n, and the later contributions by\nHeron\nof Alexandria and\nMenelaus\nof Alexandria. Abraham had also studied some of the important works on algebra by Arab mathematicians, in particular\nal-Khwarizmi\nand\nal-Karaji\n.\nAmong other texts written by Abraham bar Hiyya was\nYesod ha-Tebunah u-Migdal ha-Emunah\n(\nThe Foundation of Understanding and the Tower of Faith\n)\n. This work is an encyclopaedia of mathematics, astronomy, optics and music. It is the first encyclopaedia in the Hebrew language.\nAbraham also wrote a number of texts on astronomy; in particular he wrote on the form of the Earth and the calculation of the paths of the stars on the\ncelestial sphere\n. His book\nTables of the Prince\nrefers to the tables of\nal-Battani\nwhile Abraham's treatise\nSefer ha-Ibbur\n(\nBook of Intercalation\n)\n, written in\n1122\n-\n23\n, is the first Hebrew work devoted exclusively to a study of the calendar.\nIn the philosophical treatise\nHegyon ha-Nefesh ha-Azuva\n(\nMeditation of the Sad Soul\n)\nAbraham deals with the nature of good and evil and\nethics\n.\nMegillat ha-Megalleh\n(\nScroll of the Revealer\n)\noutlines Abraham's view of history based on astrology. It claims to forecast the messianic future.\nPerhaps one of the most important features of Abraham bar Hiyya's work is the fact that it appears to have stimulated an interest in Arabic mathematics and, together with the work of\nAbraham ibn Ezra\n, marks the beginning of Hebrew scholarly study of mathematics. As the author of\n[\n5\n]\nwrites:-\nThe major part of the mathematical 'classics' in Hebrew were translated from Arabic between the second third of the thirteenth century and the first third of the fourteenth century, within the northern littoral of the western Mediterranean. This movement occurred after the original works by Abraham bar Hiyya and\nAbraham ibn Ezra\nbecame available to a wide readership.\nIt is rather difficult to place Abraham bar Hiyya in the development of mathematics since in most respects he did not fit nicely into one culture but spanned several. It may indeed be for just that reason that he is important since he produced a cross-fertilisation of ideas between these cultures. As Levey, the author of\n[\n6\n]\n, writes in\n[\n1\n]\n, Abraham:-\n... did not definitely belong definitely to one mathematical group. He spent most of his life in Barcelona, an area of both Arab and Christian learning, and was active in translating the masterpieces of Arab science. ... he deplored the lack of knowledge of Arab science and language among the people of Provence. He wrote his own works in Hebrew, but he helped translate ... works into Latin...."
}