{
  "nome_completo": "Abraham Seidenberg",
  "nome_curto": "Abraham Seidenberg",
  "ano_nascimento": "1916",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Seidenberg/",
  "lugar_nascimento": "Washington, D.C., USA",
  "lugar_morte": "Milan, Italy",
  "biografia": "Abraham Seidenberg\nstudied at the University of Maryland and was awarded his B.A. in\n1937\n. His doctoral studies in algebra were at Johns Hopkins University where his research was supervised by\nOscar Zariski\n. After submitting his Ph.D. thesis\nValuation Ideals in Rings of Polynomials in Two Variables\nhe was awarded his doctorate in\n1943\n. In\n1945\nSeidenberg was appointed as an instructor in mathematics at the University of California at Berkeley. He was promoted rapidly and in\n1958\nreached the rank of full professor. He retired in\n1987\nand was made Professor, Emeritus at that time.\nSeidenberg married the writer Ebe Cagli. She was born in Ancona, Italy, on\n23\nFebruary\n1915\ninto a family of Jewish origins. She left Italy with the other members of her family in\n1938\nafter racial persecution and they emigrated to the United States. After a stay in New York she married Seidenberg. Ebe was the author of novels on the exile of the Jews during Fascism. Her brother Corrado Cagli was famed as a painter. Seidenberg and his wife frequently visited Italy. He held a Visiting Professorship at the University of Milan and he gave several series of lectures there. In fact he was in Milan in the middle of giving a lecture series at the time of his death. Ebe Seidenberg died in a clinic in Rome at the age of\n87\n.\nM A Rosenlicht, G P Hochschild, and P Lieber in an obituary, describe other features of their colleague Seidenberg's career at Berkeley:-\nHis career included a Guggenheim Fellowship\n[\nawarded\n1953]\n, visiting Professorships at Harvard and at the University of Milan, and numerous invited addresses, including several series of lectures at the University of Milan, the National University of Mexico, and at the\nAccademia dei Lincei\nin Rome. At the time of his death, he was in the midst of another series of lectures at the University of Milan.\nSeidenberg contributed important research to commutative algebra,\nalgebraic geometry\n, differential algebra, and the history of mathematics. In\n1945\nhe published\nValuation ideals in polynomial rings\nwhich included results from his doctoral thesis. In the following year he published\nPrime ideals and integral dependence\nwritten jointly with I S Cohen which greatly simplified the existing proofs of the going-up and going-down theorems of ideal theory. An example of one of his papers on algebraic geometry is\nThe hyperplane sections of normal varieties\n(1950)\nwhich has proved fundamental in later advances. He also wrote a book\nElements of the theory of algebraic curves\n(1968)\n. W E Fulton, in a review, describes it as:-\n... a well-written text on the theory of algebraic curves. ... the leisurely style, with plenty of motivational discussion, makes it especially useful for an introduction to the subject. Concepts such as plane curve, intersection multiplicity, branch, genus, and linear series are introduced in a concrete, computational way; the necessary abstract algebra is kept in a secondary position whenever possible. Novel features are a chapter on ground fields of positive characteristic and one on \"infinitely near points\".\nSeidenberg's papers on differential algebra include\nSome basic theorems in differential algebra\n(\ncharacteristic p, arbitrary\n)\n(1952)\nand\nSome basic theorems in partial differential algebra\n(1958)\n. Kolchin writes the following in a review of this paper:-\n[\nSeidenberg\n]\nreexamines certain known theorems. In the first part he shows that the usual definition of \"\n(\ndifferentially\n)\nalgebraic\" is equivalent to one using induction on the number of derivation operators. Certain desired properties follow more easily from the first definition, and others from the second. By including all these properties and the equivalence in one inductive proof, he effects a certain economy. In the subsequent parts he proves that, in a separable differential field extension, every differential transcendence basis is separating, a result previously proved by him in the case of ordinary differential fields; and he also discusses the connection between the condition that every finitely generated extension of a differential field F be simply generated and the condition that\n0\nbe the only differential polynomial over F vanishing identically on F.\nThroughout his career Seidenberg published important papers on the history of mathematics. For example\nPeg and cord in ancient Greek geometry\n(1959)\nin which he argues that the whole of Greek geometry had a ritual origin. In\nThe diffusion of counting practices\n(1960)\nSeidenberg argues that counting was diffused from one centre and was not discovered again and again as is commonly believed. History of mathematics papers published after he retired include\nThe zero in the Mayan numerical notation\n(1986)\nand\nOn the volume of a sphere\n(1988)\n. In this latter paper Seidenberg compares the methods for calculating the volume of a sphere: in Greek mathematics, namely that by Archimedes; in Chinese mathematics, namely in the\nNine Chapters on the Mathematical Art\n; in Babylonian mathematics; and in Egyptian mathematics. He argues, as he does in other papers, that there were two traditions in ancient mathematics, see\n[\n3\n]\nwhere this is discussed fully. One was a geometric-constructive tradition and the other an algebraic-computational tradition. These, he claims, originated from a common source prior to Greek, Babylonian, Chinese, and Vedic mathematics. He also argues that the use methods of the\nCavalieri\ntype to determine volume go back to this common source. In\nGeometry and Algebra in Ancient Civilizations\nVan der Waerden\nputs forward similar views for which he gives credit to Seidenberg, saying that Seidenberg made him look at the history of mathematics a new way.\nWe must not suppose that Seidenberg neglected his algebraic research in the latter part of his career. He continued to publish papers such as\nOn the\nLasker\n-\nNoether\ndecomposition theorem\n(1984)\nwhich asks:-\nWhen does the\nLasker\n-\nNoether\ndecomposition theorem, which says that an ideal in a commutative Noetherian ring is the intersection of a finite number of primary ideals, hold in a constructive sense?\nIn the paper he gives conditions on the ring\nR\nR\nR\nso that given generators for an ideal in a\nR\n[\nx\n1\n,\n.\n.\n.\n,\nx\nn\n]\nR[x_{1}, ... , x_{n}]\nR\n[\nx\n1\n​\n,\n.\n.\n.\n,\nx\nn\n​\n]\nthen there is an algorithm to compute generators of the primary ideals and of their associated prime ideals.\nM A Rosenlicht, G P Hochschild, and P Lieber end their obituary with these words:-\nThose who knew Seidenberg well, including many students, remember his warmth, compassion and integrity. He had a number of very dear friends."
}