{
  "nome_completo": "Adam Wilhelm Siegmund Günther",
  "nome_curto": "Adam Günther",
  "ano_nascimento": "1848",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Guenther/",
  "lugar_nascimento": "Nuremberg, Germany",
  "lugar_morte": "Munich, Germany",
  "biografia": "Adam Günther\n's father was Ludwig Leonard Günther, who was a Nuremberg businessman, and his mother was Johanna Weiser. Günther began his university studies of mathematics and physics in\n1865\n. It was common at this time for students in Germany to study at several different universities, and indeed Günther carried this out with enthusiam for he studied at the universities of Erlangen, Heidelberg, Leipzig, Berlin and Göttingen. While he was undertaking research for his doctorate political events intervened to interrupt his studies.\nIn\n1870\nthe political situation between France and Prussia was deteriorating. The popularity of Napoleon III, the French emperor, was declining in France and he thought a war with Prussia might change his political fortunes since his advisers having told him that the French Army could defeat Prussia. Bismarck, the Prussian chancellor, saw a war with France as an opportunity to unite the South German states. With both sides feeling that a war was to their advantage, the Franco-Prussian War became inevitable. On\n14\nJuly, Bismarck sent a telegram aimed at infuriating the French government. He succeeded, for on the\n19\nJuly France declared war on Prussia. Günther participated in the war which ended in the defeat of France in\n1871\n.\nAt the end of the war Günther returned to complete his doctoral dissertation and the degree was awarded by Erlangen for\nStudien zur theoretischen Photometrie\nⓉ\n(\nStudies in theoretical photometry\n)\nin\n1872\n. He also took his examinations to qualify as a teacher of mathematics and physics and, in\n1872\n, he began teaching mathematics at a school in Weissenburg, Bavaria. In the following year he submitted a\nhabilitation\nthesis to Erlangen:\nDarstellung der Näherungswerte der Kettenbrüche in independenter Form\nⓉ\n(\nShowing the approximate values of continued fractions in Independent form\n)\n.\nWith his qualification to teach in universities, Günther became a\ndocent\nat Munich Polytechnicum in\n1874\n. There he taught mathematics, then two years later he was appointed professor of mathematics and physics at the\nGymnasium\nin Ansbach also in Bavaria.\nAfter holding this position for ten years, Günther moved back to Munich in\n1886\nwhen he was appointed as professor of geograghy at the Technische Hochschule there. He held this post until he retired in\n1920\nbut, in addition, he was rector of the school from\n1911\nto\n1914\n.\nThe legislature of the German Empire became known as the Reichstag from\n1871\n. This revived the name of the legislature of the Holy Roman Empire which was used from the\n12\nth\ncentury to\n1806\n. Günther served on the Reichstag from\n1878\nto\n1884\nas a member of the Liberal Party, then he served on the Bavarian Landtag, the state parliament of Bavaria, from\n1884\nto\n1899\nand again from\n1907\nto\n1918\nagain as a Liberal. During World War I he headed the Bavarian flying weather service.\nGünther's contributions to mathematics include a treatise on the theory of determinants\n(1875)\n, hyperbolic functions\n(1881)\n, and the parabolic logarithm and parabolic trigonometry\n(1882)\n. He also wrote\n[\n1\n]\n:-\n... numerous books and journal articles\n[\nwhich\n]\nencompass both pure mathematics and its history, and physics, geophysics, meteorology, geography, and astronomy. The individual works on the history of science, worth reading even today, bear witness to a thorough study, a remarkable knowledge of the relevant secondary literature, and a superior descriptive ability."
}