{
  "nome_completo": "Adolf Kiefer",
  "nome_curto": "Adolf Kiefer",
  "ano_nascimento": "1857",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kiefer_Adolf/",
  "lugar_nascimento": "Selzach, Solothurn canton, Switzerland",
  "lugar_morte": "Zürich, Switzerland",
  "biografia": "Adolf Kiefer\n's father Jakob was a farmer, as well as the village's mayor and a member of the cantonal parliament. Adolf first attended primary school in Selzach, then the Bezirksschule in Grenchen, and finally the Kantonsschule in Solothurn. In\n1876\nhe matriculated at the Polytechnic in order to study mathematics and physics in the Department for Mathematics and Physics Teachers. Four years later he obtained his diploma as mathematics teacher.\nHis first teaching post was at the Concordia Institute, a college in Zürich, from\n1881\n-\n1882\n. He also seems to have attended lectures at the University of Zürich, though the university's matriculation register only lists his son Adolf\n(1892\n-\n1951)\n[\n3\n]\n. In any case Kiefer senior obtained his doctorate from the University of Zürich in\n1881\nfor his thesis\nDer Kontakt höherer Ordnung bei algebraischen Flächen\nⓉ\n(\nHigher order contact of algebraic surfaces\n)\n.   From\n1882\n-\n1894\nKiefer taught geometry and technical drawing at the Kantonsschule in Frauenfeld\n(\ncanton Thurgau\n)\n, primarily at the school's vocational section, the Industrieschule. In\n1886\nhe became deputy head and two years later headmaster. However, 'much to the regret of his superiors, colleagues and pupils'\n[\n2\n]\nhe left the school in\n1894\n, as he became Director of the Concordia Institute. The college was closed after the First World War, but Kiefer found teaching posts at the Kantonsschule, the technical college and the teachers' college in Zürich.\nKiefer published almost forty papers, most of which are on geometry. Among his papers are\nÜber Kräftezerlegung\nⓉ\n(\nOn the resolution of forces\n)\n(1904)\n,\nÜber die Kettenlinie\nⓉ\n(\nOn the catenary\n)\n(1915)\n,\nVon der Cykloide\nⓉ\n(\nOn the cycloid\n)\n(1917)\n,\nZum Normalenproblem bei den Flächen zweiten Grades\nⓉ\n(\nOn the problem of normals of a quadratic surface\n)\n(1921)\n, and\nZwei spezielle Tetraeder\nⓉ\n(\nTwo special tetrahedrons\n)\n(1925)\n. He became an honorary member of the Schweizerische Naturforschende Gesellschaft in\n1928\n.\nKiefer joined the enlarged committee of the first International Congress of Mathematicians, as well as the committee in charge of board and lodging, in December\n1896\n. His duties included organising accommodation for the Swiss secondary school teachers who attended the congress -- a certain Mr Bertsch, of the Concordia Institute in Zürich, offered Swiss teachers free accommodation there in July\n1897\n.\nAdolf Kiefer retired in\n1926\nafter having fainted in his classroom. He died three years later."
}