{
  "nome_completo": "Adrien Auzout",
  "nome_curto": "Adrien Auzout",
  "ano_nascimento": "1622",
  "ano_morte": "1691",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Auzout/",
  "lugar_nascimento": "Rouen, France",
  "lugar_morte": "Rome (now Italy)",
  "biografia": "Adrien Auzout\n's parents were Adrien Auzout and Jeanne Piedelièvre. Adrien and Jeanne were married in\n1618\nand they had seven children. Adrien, the subject of this biography, was the eldest of the children, having three younger brothers and three younger sisters. Adrien Auzout Senior was an administrator in the Rouen law courts. He preserved the court records but was not himself a lawyer. This was not a particularly well paid job and, having a large family, it was hard for them to make ends meet. Adrien, the subject of this biography, grew up in Rouen in a difficult period; the government had imposed very high taxes to pay for the Thirty Years War and epidemics of the bubonic plague swept the area in the\n1620\ns and\n1630\ns.\nAdrien Auzout was fortunate to be the eldest of the children, for the family finances would not have stretched to educating the younger children. He was able to study at the Jesuit College in Rouen and, although there is no record of Auzout knowing\nBlaise Pascal\naround\n1640\n, both must have attended the Rouen Jesuit College at this time, so probably did know each other. Some sources claim that Auzout and\nPascal\ncollaborated after\nPascal\nsettled in Rouen in\n1639\n. What is undoubtedly true is that both became interested in the vacuum around\n1646\nwhether working together of individually. Certainly Auzout was present when\nPascal\ngave public demonstrations in Rouen of variations on\nTorricelli\n's experiments inverting a column of mercury in a tube and observing the space above it which he correctly claimed must be a vacuum.\nPascal\nnot only carried out the experiment with tubes containing mercury but also with much longer tubes containing water and wine.\nAuzout's father expected his eldest son to follow the family tradition, which certainly stretched back at least two generations, and become an administrator in the law courts. It was not to be for Auzout had other ideas about his future. In\n1647\nhe left Rouen and settled in Paris, some sources claiming that he went with\nPascal\nin the spring of that year. There he joined\nMersenne\n's circle, sometimes called the Montmor Academy, where he deepened his knowledge of mathematics and physics interacting with the other leading scientists of the day who were part of the group. He told\nGassendi\nof the experiments he had seen\nPascal\ncarry out. In the autumn of\n1647\nAuzout\n[\n1\n]\n:-\n... designed an ingenious experiment - creating one vacuum inside another - in order to prove that the weight of a column of air pressing on a barometer causes the mercury to rise inside.\nHe designed the apparatus in which a mercury barometer was inside a vacuum created by inverting a tube of mercury. The mercury in the barometer completely descended into the vessel below showing that air pressure caused it to rise.\nWhen his father died in\n1652\n, Auzout inherited some money but, given the financial state of the family, it would not have been a lot. Sturdy investigates in\n[\n2\n]\nwhere his income came from; it was sufficient apparently let him live fairly comfortably in Paris:-\nHe also practised astrology, augmenting his income by casting horoscopes for prominent Parisian nobilities; and by\n1666\nhe was receiving gratifications of\n1500\nlivres a year from the crown. By these and perhaps other means Auzout evidently made enough money to survive in Paris, even if he was not necessarily a wealthy man. Little is known of his marriage. His wife would have brought a dowry, but almost certainly kept most of it for her personal rather than their joint use. Their relationship was far from happy, and when he departed from France in\n1668\nhe left her behind.\nWe do have a couple of pieces of information concerning people for whom Auzout undertook work. We know that in the summer of\n1648\nhe left Paris to undertake work for Jacques de Crevant de Brigueil, the abbée de Saint-Maixent in Poitou. Later he worked for Alexandre d'Elbène; he administed some of d'Elbène's estates and received a substantial sum in\n1662\nfor his efforts to increase the estate's revenue.\nAuzout's interest in mathematics led to him arguing that a treatise on the quadrature of the circle was in error. He wrote a treatise on proportion and produced a method to construct an ellipse which he sent to\nFrans van Schooten\n. By\n1660\nAuzout had become totally absorbed by his interest in astronomical instruments. He wrote to King Louis XIV in\n1664\nindicating that there was a need for a public observatory, and that the Compagnie des Sciences et des Arts was ready to begin work on the project if it received Royal sponsorship. This is of interest since the Observatory was established in\n1667\nas a result of the petition, and also since it suggests that Auzout was leading a group from\nMersenne\n's circle who were seeking a formal status. The Compagnie was a bridge between\nMersenne\n's circle, called the\nMontmor Academy\n, and the\nAcadémie Royale des Sciences\nfounded in\n1666\n.\nAuzout produced a pamphlet concerning the orbit of the first of two comets of\n1665\n, predicting an orbit for the comet based on about five observations he had made. The\nRoyal Society\nin London decided to try to verify or disprove Auzout's predicted orbit by looking at observations of the comet made by others. Observations by\nJohannes Hevelius\nhad led him to disagree with Auzout's predictions and a controversy between the two arose, particularly over one observation of the comet by\nHevelius\non\n18\nFebruary\n1665\n. The\nRoyal Society\nresolved the dispute in favour of Auzout, declaring\n[\n3\n]\n:-\n... that whatever\nHevelius\nhad seen on the night of\n18\nFebruary near the first star of Aries, it had not been the comet.\nThe importance of Auzout's work on comets is his belief that they followed regular orbits and were thus permanent members of the solar system. He also hoped that the distance to the comet and its magnitude could be calculated, and so a proof given that the Earth is in motion.\nWorking mainly with\nJean Picard\n, Auzout worked on instruments to improve telescopes and surveying instruments\n[\n1\n]\n:-\nHe made a significant contribution to the final development of the micrometer and to the replacement of open sights by telescopic sights. ... By the summer of\n1666\nAuzout and\nPicard\nwere making systematic observations with fully developed micrometers.\nIn a letter sent on\n28\nDecember\n1666\nto Henry Oldenburg, the first secretary of the\nRoyal Society of London\n, Auzout explained how his new micrometer, with two parallel wires either of silk of silver, one of which could be moved by a screw, could be used to calculate the diameters of the planets and the parallax of the moon. He also considered the question of why, in the last eclipse of the sun, the diameter of the moon appeared larger towards the end of the eclipse that at the beginning. Auzout was not the first to invent a micrometer but it is his design which has become the basis of the modern instrument. Wolf explains further in\n[\n6\n]\n:-\nThe turns and fractions of a turn of a micrometer screw could be converted into angular measurements after the instrument had been calibrated... The pendulum clock, used in this calibration, found its principal application in enabling the times at which selected stars crossed the meridian to be accurately noted. The interval between the transits of two stars measures their difference of right ascension; and upon\nPicard\n's procedure is based the standard method of determining, on the one hand, the absolute right ascensions of stars, and, on the other, the local sidereal time of the place of observation.\nIn\n1666\nAuzout was one of a group of scientists making astronomical observations from Jean-Baptiste Colbert's Paris residence. In addition to Auzout the others involved were\nChristiaan Huygens\n,\nPierre de Carcavi\n,\nGilles de Roberval\n,\nBernard Frénicle de Bessy\nand Jacques Buot. In many ways this can be seen as a meeting of the\nAcadémie des Sciences\nbefore its official foundation. Colbert, who was the French Minister of Finance, chose the small group who met in the King's Library on\n22\nDecember\n1666\n, which was the founding meeting of the\nAcadémie Royale des Sciences\n. Auzout was one of these founding members and he quickly made a contribution. The records of the Academy contain the following:-\nOn the eleventh day of January\n1667\nM Auzout presented to the assembly a memoir which was read to the company on the observations that should be made at Madagascar.\nThis was the first known proposal for a scientific expedition and Auzout presented it to the Academy only three weeks after its first formal meeting. He clearly expected the Academy to get to work quickly. Olmsted writes:-\nAuzout distinguishes astronomical observations which can be made anywhere, but which should be confirmed in the southern hemisphere, from those which can be made only in a place like Madagascar. Of the latter, those requiring corresponding or simultaneous observations at Paris are differentiated from those which may be made independently at Madagascar. The sixteen types of astronomical observations proposed constitute a comprehensive observational programme, adequate for a permanent observatory, and for the most part significant. In addition, some eleven terrestrial or physical observations are proposed, quite a number to be made during the course of the voyage to the island.\nIn fact Auzout, despite being one of the most vigorous in pushing for the opening of the Academy, was already showing frustration that things were not going as he had hoped. In the letter to Henry Oldenburg written on\n28\nDecember\n1666\n, only a week after the first official meeting of the Academy\n(\nthe letter we have already referred to above\n)\nhe wrote\n[\n4\n]\n:-\nAlthough I had the honour to be appointed by the King as mathematician and physicist, I can't give you any more details than are known to everybody, because we have not been kept fully informed and things have not reached the point we were led to hope for. ...\n[\nduring the summer of\n1666]\nwhile we lacked instruments ... the constant hope of getting them\n[\nfrom the new Academy when it opened\n]\nresulted in individuals failing to undertake what they would normally have done.\nA year later, on\n29\nDecember\n1667\n, he again wrote to Oldenburg sounding fed up:-\nI am hardly ever in a humour to write. I do not excuse myself with the weight of my work, because you may well believe I have none.\nIn\n1668\nAuzout resigned from the\nAcadémie des Sciences\nand left France. It is said that he had a disagreement, although no details are known, but it may simply be his disappointment that the Academy was not living up to his\n(\nperhaps ridiculously high\n)\nexpectations of it. He had always had a strong interest in architecture and had spent much time with\nChristopher Wren\nwhen\nWren\nvisited Paris in the summer of\n1665\n. Auzout had studied\nVitruvius\nthroughout most of his life and was fascinated by Roman architecture. It is therefore no surprise that he moved to Rome where he lived until his death in\n1691\n. There he was well known for his particular interest in ancient architecture and engineering hydraulics. During his stay in Rome he was considered one of the real scholars of his day. He was the first to decipher the cancelled line on the Arch of Septimius Severus, in the Roman Forum, and served on the committee to tap the water of Lake Bracciano,\n40\nkm north-west of Rome, for drinking water for the Acqua Paola fountain in Rome. Auzout did not completely cut himself off from his previous life, however, for when William Petty claimed that London was greater than Paris and Rouen combined, quoting population statistics to prove his case, Auzout responded vigorously in November\n1686\n. The Petty-Auzout controversy continued for some time.\nLeibniz\n, in a letter written in December\n1703\n, refers to Auzout being in Rome:-\nI have learned that you intended to give me a copy of the 'Intellectual System' by the late Mr Cudworth ... The first time I saw this book was in Rome, where Mr Auzout, a French mathematician of great reputation, bought it ..."
}