{
  "nome_completo": "Abu Arrayhan Muhammad ibn Ahmad al-Biruni",
  "nome_curto": "Al-Biruni",
  "ano_nascimento": "973",
  "ano_morte": "1048",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Biruni/",
  "lugar_nascimento": "Kath, Khwarazm (now Kara-Kalpakskaya, Uzbekistan)",
  "lugar_morte": "Ghazna (now Ghazni, Afganistan)",
  "biografia": "Abu Rayhan al-Biruni\nwas born in Khwarazm, a region adjoining the Aral Sea now known as Karakalpakstan. The two major cities in this region were Kath and Jurjaniyya. Al-Biruni was born near Kath and the town were he was born is today called Biruni after the great scholar. He lived both in Kath and in Jurjaniyya as he grew up and we know that he began studies at a very early age under the famous astronomer and mathematician\nAbu Nasr Mansur\n. Certainly by the age of seventeen al-Biruni was engaged in serious scientific work for it was in\n990\nthat he computed the latitude of Kath by observing the maximum altitude of the sun.\nOther work which al-Biruni undertook as a young man was more theoretical. Before\n995\n(\nwhen he was\n22\nyears old\n)\nhe had written a number of short works. One which has survived is his\nCartography\nwhich is a work on map projections. As well as describing his own projection of a hemisphere onto a plane, al-Biruni showed that by the age of\n22\nhe was already extremely well read for he had studied a wide selection of map projections invented by others and he discusses them in the treatise. The comparatively quiet life that al-Biruni led up to this point was to come to a sudden end. It is interesting to speculate on how different his life, and contribution to scholarship, might have been but for the change in his life forced by the political events of\n995\n.\nThe end of the\n10\nth\ncentury and beginning of the\n11\nth\ncentury was a period of great unrest in the Islamic world and there were civil wars in the region in which al-Biruni was living. Khwarazm was at this time part of the Samanid Empire which ruled from Bukhara. Other states in the region were the Ziyarid state with its capital at Gurgan on the Caspian sea. Further west, the Buwayhid dynasty ruled over the area between the Caspian sea and the Persian Gulf, and over Mesopotamia. Another kingdom which was rapidly rising in influence was the Ghaznavids whose capital was at Ghazna in Afghanistan, a kingdom which was to play a major role in al-Biruni's life.\nThe Banu Iraq were the rulers of the Khwarazm region and Abu Nasr\nMansur\n, al-Biruni's teacher, was a prince of that family. In\n995\nthe rule by the Banu Iraq was overthrown in a coup. Al-Biruni fled at the outbreak of the civil war but it is less clear what happened to his teacher\nAbu Nasr Mansur\nat this stage. Describing these events later al-Biruni wrote\n[\n1\n]\n:-\nAfter I had barely settled down for a few years, I was permitted by the Lord of Time to go back home, but I was compelled to participate in worldly affairs, which excited the envy of fools, but which made the wise pity me.\nExactly where al-Biruni went when he fled from Khwarazm is unclear. He might have gone to Rayy\n(\nnear to where the city of Tehran stands today\n)\nat this time, but certainly he was there at some time during the following few years. He writes that he was without a patron when in Rayy, and lived in poverty.\nal-Khujandi\nwas an astronomer who was working with a very large instrument he had built on the mountain above Rayy to observe meridian\ntransits\nof the sun near the\nsolstices\n. He made observations on\n16\nand\n17\nJune\n994\nfor the summer solstice and\n14\nand\n17\nDecember\n994\nfor the winter solstice. From these values he calculated the\nobliquity of the ecliptic\n, and the latitude of Rayy but neither are particularly accurate.\nAl-Khujandi\ndiscussed these observations, and his large sextant, with al-Biruni who later reported on them in his\nTahdid\nwhere he claimed that the aperture of the sextant settled by about one span in the course of\nal-Khujandi\n's observations due to the weight of the instrument. Al-Biruni is almost certainly correct in pinpointing the cause of\nal-Khujandi\n's errors. Since\nal-Khujandi\ndied in\n1000\n, we can be fairly certain that al-Biruni spent part of the time between\n995\nand\n997\nat Rayy. He must also have spent part of this time in Gilan, which is bordered by the Caspian Sea on the north, for around this time he dedicated a work to the ruler of Gilan, ibn Rustam, who had connections with the Ziyarid state.\nWe know certain dates in al-Biruni's life with certainty for he describes astronomical events in his works which allow accurate dates and places to be determined. His description of an eclipse of the moon on\n24\nMay\n997\nwhich he observed at Kath means that he had returned to his native country by this time. The eclipse was an event that was also visible in Baghdad and al-Biruni had arranged with\nAbu'l-Wafa\nto observe it there. Comparing their timings enabled them to calculate the difference in longitude between the cities. We know that al-Biruni moved around frequently during this period for by\n1000\nhe was at Gurgan being supported by Qabus, the ruler of the Ziyarid state. He dedicated his work\nChronology\nto Qabus around\n1000\nand he was still in Gurgan on\n19\nFebruary\n1003\nand\n14\nAugust\n1003\nwhen he observed eclipses of the moon there. We should record that in the\nChronology\nal-Biruni refers to seven earlier works which he had written: one on the decimal system, one on the\nastrolabe\n, one on astronomical observations, three on astrology, and two on history.\nBy\n4\nJune\n1004\nal-Biruni was back in his homeland, for on that day he observed another eclipse of the moon from Jurjaniyya. Ali ibn Ma'mun had ruled over Khwarazm and he remained at the court when his brother Abu'l Abbas Ma'mun succeeded him as ruler. Both the Ma'mun brothers married sisters of the ruler Mahmud from the powerful state at Ghazna which would eventually take control of Abu'l Abbas Ma'mun's kingdom.\nBoth Ali ibn Ma'mun and Abu'l Abbas Ma'mun were patrons of the sciences and supported a number of top scientists at their court. By\n1004\nAbu'l Abbas Ma'mun was ruler and he provided generous support for al-Biruni's scientific work. Not only did al-Biruni work there but\nAbu Nasr Mansur\n, his former teacher also worked there, allowing the pair to renew their collaboration. With Abu'l Abbas Ma'mun's support al-Biruni built an instrument at Jurjaniyya to observe solar meridian transits and he made\n15\nsuch observations with the instrument between\n7\nJune\n1016\nand\n7\nDecember\n1016\n.\nWars in the region were to disrupt the scientific work of al-Biruni and\nAbu Nasr Mansur\nand eventually both left Khwarazm in about\n1017\n. Mahmud was extending his influence over the region from his base in Ghazna and made a demand of Abu'l Abbas Ma'mun in\n1014\nto have his name inserted into the Friday prayers. This was a signal that he wanted an end to Ma'mun's rule and he was making a bid for the region to come under his control. After Ma'mun had at least partially agreed to Mahmud's demands, he was killed by his own army for what they considered to be an act of treachery. Following this Mahmud marched his army into the region and gained control of Kath on\n3\nJuly\n1017\n. Both al-Biruni and\nAbu Nasr Mansur\nleft with the victorious Mahmud, perhaps as his prisoners.\nThere follows a strange period during which there is evidence in al-Biruni's own writings that he suffered great hardships but he also seems to have been supported by Mahmud for some scientific work. Some reports that Mahmud was cruel to al-Biruni may have some basis despite the limited patronage al-Biruni received from the ruler. Some dates and places from this period can again be deduced from descriptions of astronomical events recorded by al-Biruni. He was in Kabul on\n14\nOctober\n1018\nbut, despite having no instruments with which to observe, he was able to make an observation with an ingenious instrument he made from materials at hand. At Lamghan, north of Kabul, on\n8\nApril\n1019\nhe observed an eclipse of the sun, writing\n[\n2\n]\n:-\n... at sunrise we saw that approximately one-third of the sun was eclipsed and that the eclipse was waning.\nBetween\n1018\nand\n1020\n, supported by Mahmud, al-Biruni made observations from Ghazna which allowed an accurate determination of its latitude. On\n17\nSeptember\n1019\nthere was a lunar eclipse observed by al-Biruni from Ghazna and\n[\n2\n]\n:-\nHe gives precise details of the exact altitude of various well known stars at the moment of first contact.\nThe relationship between Mahmud and al-Biruni is interesting. It is likely that al-Biruni was essentially a prisoner of Mahmud and was not free to leave. However Mahmud's military excursions into India meant that al-Biruni was taken to that country, and there can have been few experiences that al-Biruni would have enjoyed more. He may have wished for better treatment from Mahmud but al-Biruni's scientific work certainly benefited. From around\n1022\nMahmud's armies began to have success in taking control of the northern parts of India and in\n1026\nhis armies marched to the Indian Ocean. Al-Biruni seems only to have been in the northern parts of India, and we are uncertain how many visits he made, but observations he made there enabled him to determine the latitudes of eleven towns around the Punjab and the borders of Kashmir. His most famous work\nIndia\nwas written as a direct result of the studies he made while in that country.\nThe\nIndia\nis a massive work covering many different aspects of the country. Al-Biruni describes the religion and philosophy of India, its caste system and marriage customs. He then studies the Indian systems of writing and numbers before going on to examine the geography of the country. The book also examines Indian astronomy, astrology and the calendar.\nAl-Biruni studied Indian literature in the original, translating several Sanskrit texts into Arabic. He also wrote several treatises devoted to certain aspects of Indian astronomy and mathematics which were of particular interest to him. Al-Biruni was amazingly well read, having knowledge of Sanskrit literature on topics such as astrology, astronomy, chronology, geography, grammar, mathematics, medicine, philosophy, religion, and weights and measures. See\n[\n65\n]\nfor further details.\nMahmud died in\n1030\nand he was succeeded by his eldest son Mas'ud, although not before a difficult political situation in which the two sons of Mahmud each tried to follow their father as ruler. Clearly al-Biruni was unsure who would succeed for he chose not to give a dedication in his\nIndia\nwhich appeared at this time. Better to have no dedication than to choose the wrong one! Mas'ud proved to be a ruler who treated al-Biruni more kindly than his father had done. If al-Biruni had been a virtual prisoner before, he now seems to have become free to travel as he pleased. Mas'ud was murdered in\n1040\nand succeeded by his son Mawdud who ruled for eight years. By this time al-Biruni was an old man but he continued his enormous output of scientific works right up to the time of his death.\nThe total number of works produced by al-Biruni during his lifetime is impressive. Kennedy. writing in\n[\n1\n]\n, estimates that he wrote around\n146\nworks with a total of about\n13\n,\n000\nfolios\n(\na folio contains about the same amount as a printed page from a modern book\n)\n. We have mentioned some of the works above, but the range of al-Biruni's works cover essentially the whole of science at his time. Kennedy writes\n[\n1\n]\n:-\n... his bent was strongly towards the study of observable phenomena, in nature and in man. Within the sciences themselves he was attracted by those fields then susceptible of mathematical analysis.\nWe have mentioned al-Biruni's astronomical observations many time above. It is worth noting that he had a better feel for errors than did\nPtolemy\n. In\n[\n66\n]\nthe author comments that\nPtolemy\n's attitude was to select the observations which he thought most reliable\n(\noften that meant fitting in with his theory\n)\n, and not to tell the reader about observations that he was discarding. Al-Biruni, on the other hand, treats errors more scientifically and when he does chose some to be more reliable than others, he also gives the discarded observations. He was also very conscious of rounding errors in calculations, and always attempted to observe quantities which required the minimum manipulation to produce answers.\nOne of the most important of al-Biruni's many texts is\nShadows\nwhich he is thought to have written around\n1021\n. Rosenfel'd has written extensively on this work of al-Biruni\n(\nsee for example\n[\n52\n]\n,\n[\n55\n]\n, and\n[\n59\n]\n)\n. The contents of the work include the Arabic nomenclature of shade and shadows, strange phenomena involving shadows, gnomonics, the history of the tangent and secant functions, applications of the shadow functions to the astrolabe and to other instruments, shadow observations for the solution of various astronomical problems, and the shadow-determined times of Muslim prayers.\nShadows\nis an extremely important source for our knowledge of the history of mathematics, astronomy, and physics. It also contains important ideas such as the idea that acceleration is connected with non-uniform motion, using three rectangular coordinates to define a point in\n3\n-space, and ideas that some see as anticipating the introduction of polar coordinates.\nThe book\n[\n5\n]\ndetails the mathematical contributions of al-Biruni. These include: theoretical and practical arithmetic, summation of series, combinatorial analysis, the rule of three,\nirrational\nnumbers, ratio theory, algebraic definitions, method of solving algebraic equations, geometry,\nArchimedes\n' theorems,\ntrisection of the angle\nand other problems which cannot be solved with\nruler and compass\nalone,\nconic sections\n, stereometry,\nstereographic projection\n, trigonometry, the sine theorem in the plane, and solving spherical triangles.\nImportant contributions to geodesy and geography were also made by al-Biruni. He introduced techniques to measure the earth and distances on it using triangulation. He found the radius of the earth to be\n6339\n.\n6\nkm, a value not obtained in the West until the\n16\nth\ncentury\n(\nsee\n[\n50\n]\n)\n. His\nMasudic canon\ncontains a table giving the coordinates of six hundred places, almost all of which he had direct knowledge. Not all, however, were measured by al-Biruni himself, some being taken from a similar table given by\nal-Khwarizmi\n. The author of\n[\n27\n]\nremarks that al-Biruni seemed to realise that for places given by both\nal-Khwarizmi\nand\nPtolemy\n, the value obtained by\nal-Khwarizmi\nis the more accurate.\nAl-Biruni also wrote a treatise on time-keeping, wrote several treatises on the astrolabe and describes a mechanical calendar. He makes interesting observations on the velocity of light, stating that its velocity is immense compared with that of sound. He also describes the\nMilky Way\nas\n... a collection of countless fragments of the nature of nebulous stars.\nTopics in physics that were studied by al-Biruni included hydrostatics and made very accurate measurements of specific weights. He described the ratios between the densities of gold, mercury, lead, silver, bronze, copper, brass, iron, and tin. Al-Biruni displayed the results as combinations of integers and numbers of the form\n1\nn\n,\nn\n=\n2\n,\n3\n,\n4\n,\n.\n.\n.\n,\n10\n\\large\\frac{1}{n}\\normalsize , n = 2, 3, 4, ... , 10\nn\n1\n​\n,\nn\n=\n2\n,\n3\n,\n4\n,\n.\n.\n.\n,\n1\n0\n.\nMany of al-Biruni's ideas were worked out in discussions and arguments with other scholars. He had a long-standing collaboration with his teacher Abu Nasr\nMansur\n, each asking the other to undertake specific pieces of work to support their own. He corresponded with\nAvicenna\n, in a rather confrontational fashion, about the nature of heat and light. In\n[\n4\n]\n, eighteen letters which\nAvicenna\nsent to al-Biruni in answer to questions that he had posed are given. These letters cover topics such as philosophy, astronomy and physics. Al-Biruni also corresponded with\nal-Sijzi\n. The paper\n[\n10\n]\ncontains a letter that al-Biruni wrote to\nal-Sijzi\n(\ntranslated into English in\n[\n63\n]\n)\nwhich contains proofs of both the plane and spherical versions of the sine theorem. Al-Biruni says were due to his teacher\nAbu Nasr Mansur\n.\nFinally we should say a little about the personality of this great scholar. In contrast with the works of many others, we find out a lot about al-Biruni from his writings. Despite the fact that no more than one fifth of his works have survived, we get a clear picture of the great scientist. We see a man who was not a great innovator of original theories, mathematical or otherwise, but rather a careful observer who was a leading exponent of the experimental method. He was a great linguist who was able to read first hand an amazing number of the treatises that existed and he clearly saw the development of science as part of a historical process which he is always careful to put in proper context. His writings are therefore of great interest to historians of science.\nIt appears clear that, despite his many works on astrology, al-Biruni did not believe in the 'science' but used it as a means to support his serious scientific work. A devout Muslim, he did write religious texts to suit his patrons particular sect. He shows no prejudice against different religious sects or races, but he does have strong words to say about various acts they committed. For example the Arab conquerors of Khwarazm destroyed ancient texts - what sin could be worse than that to the scholar as dedicated to learning and history as was al-Biruni. On the Christian faith al-Biruni considered the doctrine of forgiveness, writing in\nIndia\n[\n1\n]\n:-\nUpon my life, this is a noble philosophy, but the people of this world are not all philosophers. ... And indeed, ever since Constantine the Victorious became a Christian, both sword and whip have been ever employed.\nAn indication of the sarcasm that he employed against those he saw to be foolish we give the reply that he made to a religious man who objected to the fact that an instrument which al-Biruni was showing him to determine the time for prayers had Byzantine months engraved on it. Al-Biruni reports in\nShadows\nthat he said to him:-\nThe Byzantines also eat food. Then do not imitate them in this!"
}