{
  "nome_completo": "Kamal al-Din Abu'l Hasan Muhammad Al-Farisi",
  "nome_curto": "Al-Farisi",
  "ano_nascimento": "1260",
  "ano_morte": "1320",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Farisi/",
  "lugar_nascimento": null,
  "lugar_morte": "Tabriz, Iran",
  "biografia": "Al-Farisi\nis also known as\nKamal al-din\n. His full name is Kamal al-din Abu'l Hasan Muhammad ibn al-Hasan al-Farisi. He made two major contributions to mathematics, one on light, the other on\nnumber theory\n. His work on light, colour and the rainbow is discussed in\n[\n1\n]\nbut no mention of his work on number theory\n(\nnor mention of any other work at all by al-Farisi\n)\noccurs in that article written by R Rashed. On the other hand his contributions to number theory are discussed the references\n[\n2\n]\n,\n[\n3\n]\n,\n[\n4\n]\n,\n[\n7\n]\n,\n[\n8\n]\n, and\n[\n9\n]\n, most of which are also written by R Rashed but relate to discoveries made after the article\n[\n1\n]\nwas written.\nAl-Farisi was a pupil of the astronomer and mathematician Qutb al-Din al-Shirazi\n(1236\n-\n1311)\n, who in turn was a pupil of\nNasir al-Din al-Tusi\n. His work on light was prompted by a question put to him concerning the\nrefraction\nof light. Al-Shirazi advised him to consult the\nOptics\nof\nibn al-Haytham\nand al-Farisi made such a deep study of this treatise that al-Shirazi suggested that he write what is essentially a revision of that major work. Al-Shirazi himself was writing a commentary on works of\nAvicenna\nat the time.\nThen al-Farisi went much further, for he undertook a project to study all the optical work of\nibn al-Haytham\n. His major work the\nTanqih\n(\nwhich means revision\n)\nwas far more than a commentary on\nibn al-Haytham\n's optical writings. Al-Farisi does not seek merely to explain the works of a master in a more elementary form, rather he is quite prepared to suggest that some of\nibn al-Haytham\n's theories are incorrect and to propose alternative theories himself.\nThe most important part of this work by al-Farisi is his theory of the rainbow.\nIbn al-Haytham\nhad indeed proposed a theory, but al-Farisi considered both this theory and another proposed by\nAvicenna\nbefore giving his own. The theory proposed by al-Farisi was the first mathematically satisfactory explanation of the rainbow.\nIbn al-Haytham\nhad proposed that light from the sun is reflected by a cloud before reaching the eye. It was a theory which did not allow for a possible experimental verification. Al-Farisi, on the other hand, proposed a model where the ray of light from the sun was refracted twice by a water droplet, one or more reflections occurring between the two refractions. This model did allow an experiment to be conducted with a transparent sphere filled with water. Of course this introduced two additional sources for refraction, namely at the surface between the glass container and the water. Al-Farisi was able to show that the approximation obtained by his model was good enough to allow him to ignore the effects of the glass container.\nIn order to explain the colours in the rainbow, however, al-Farisi had to produce some new ideas about how colours were formed. The view before al-Farisi was that colours were produced a mixing darkness with light. This could not explain the rainbow so, based on the experimental evidence of the colours that he had observed with his transparent sphere experiment, al-Farisi proposed that the colours occurred because of the superimposition of different forms of the image on a dark background. He wrote\n(\nsee for example\n[\n1\n]\n)\n:-\n... If the images then interpenetrate, the light is again intensified and produces a bright yellow. Next, the blended image diminishes and becomes a darker and darker red until it disappears when the sun is outside the cone of rays refracted after one reflection.\nThere have been arguments between modern scholars as to whether al-Farisi's theory of the rainbow was due to him or whether it was a theory proposed by his teacher al-Shirazi. Boyer writes in\n[\n5\n]\n:-\n... the discovery of the theory should presumably be ascribed to\n[\nal-Shirazi\n]\n, its elaboration to\n[\nal-Farisi\n]\n.\nRashed discusses the claims of Boyer and others that the innovation in the theory of the rainbow was from al-Shirazi, but gives sound arguments for his claim that ascribing the theory to al-Shirazi is unconvincing.\nAl-Farisi made a number of important contributions to number theory. He noted the impossibility of giving an integer solution to the equation\nx\n4\n+\ny\n4\n=\nz\n4\nx^{4} + y^{4} = z^{4}\nx\n4\n+\ny\n4\n=\nz\n4\nbut he attempted no proof of this case of\nFermat's Last Theorem\n. Al-Farisi's most impressive work in number theory is on\namicable numbers\n. Suppose that, in modern notation,\nS\n(\nn\n)\nS(n)\nS\n(\nn\n)\ndenotes the sum of the aliquot parts of\nn\nn\nn\n, that is the sum of its proper quotients. The numbers\nm\nm\nm\nand\nn\nn\nn\nare called amicable if\nS\n(\nn\n)\n=\nm\nS(n) = m\nS\n(\nn\n)\n=\nm\n, and\nS\n(\nm\n)\n=\nn\nS(m) = n\nS\n(\nm\n)\n=\nn\n.\nIn\nTadhkira al-ahbab fi bayan al-tahabb\n(\nMemorandum for friends on the proof of amicability\n)\nal-Farisi gave a new proof of the following theorem by\nThabit ibn Qurra\non amicable numbers:\nFor\nn\n>\n1\nn > 1\nn\n>\n1\n, let\np\nn\n=\n3.\n2\nn\n−\n1\np_{n} = 3.2^{n} - 1\np\nn\n​\n=\n3\n.\n2\nn\n−\n1\nand\nq\nn\n=\n9.\n2\n2\nn\n−\n1\n−\n1\nq_{n} = 9.2^{2n-1} - 1\nq\nn\n​\n=\n9\n.\n2\n2\nn\n−\n1\n−\n1\n. If\np\nn\n−\n1\np_{n-1}\np\nn\n−\n1\n​\n,\np\nn\np_{n}\np\nn\n​\n, and\nq\nn\nq_{n}\nq\nn\n​\nare\nprime numbers\n, then\na\n=\n2\nn\np\nn\n−\n1\np\nn\na = 2^{n}p_{n-1}p_{n}\na\n=\n2\nn\np\nn\n−\n1\n​\np\nn\n​\nand\nb\n=\n2\nn\nq\nn\nb = 2^{n}q_{n}\nb\n=\n2\nn\nq\nn\n​\nare amicable numbers.\nIt was not a simple modification that al-Farisi made. Rather he produced a major new approach to a whole area of number theory, introducing ideas concerning factorisation and combinatorial methods. In fact al-Farisi's approach is based on the unique factorisation of an integer into powers of prime numbers, and, according to Rashed, he states and attempts to prove this, the so-called fundamental theorem of arithmetic, in this work. Whether al-Farisi proved or attempted to prove the fundamental theorem of arithmetic is also discussed in\n[\n4\n]\n.\nAt the end of his treatise al-Farisi gives the pairs of amicable numbers\n220\n,\n284\nand\n17296\n,\n18416\n, obtained from using\nThabit\n's rule with\nn\n=\n2\nn = 2\nn\n=\n2\nand\nn\n=\n4\nn = 4\nn\n=\n4\nrespectively. To check that\nThabit\n's theorem gives amicable numbers with\nn\n=\n4\nn = 4\nn\n=\n4\n, al-Farisi has to show that\np\n3\n,\np\n4\np_{3}, p_{4}\np\n3\n​\n,\np\n4\n​\n, and\nq\n4\nq_{4}\nq\n4\n​\nare prime numbers. Now\np\n3\n=\n23\n,\np\n4\n=\n47\np_{3} = 23, p_{4} = 47\np\n3\n​\n=\n2\n3\n,\np\n4\n​\n=\n4\n7\nand\nq\n4\n=\n1151\nq_{4} =1151\nq\n4\n​\n=\n1\n1\n5\n1\nand, to show that\n1151\nis prime al-Farisi uses a number of lemmas including an application of the sieve of\nEratosthenes\n.\nThe pair of amicable number\n17296\n,\n18416\nare known as\nEuler\n's amicable pair. There is no doubt that al-Farisi proved these to be amicable numbers long before\nEuler\n. However, al-Farisi was probably not the first to discover these amicable numbers. In\n[\n6\n]\nHogendijk argues that they were known to\nThabit ibn Qurra\nhimself.\nAl-Farisi saw the relation between\npolygonal numbers\nand the\nbinomial coefficients\nand he presented arguments, using an early type of mathematical induction, which showed a relation between\ntriangular numbers\n, the sums of triangular numbers, the sums of the sums of triangular number, etc., and the\ncombinations\nof\nn\nn\nn\nobjects taken\nk\nk\nk\nat a time."
}