{
  "nome_completo": "Abu'l Abbas al-Fadl ibn Hatim Al-Nayrizi",
  "nome_curto": "Al-Nayrizi",
  "ano_nascimento": "875",
  "ano_morte": "940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Nayrizi/",
  "lugar_nascimento": "possibly Nayriz, Iran",
  "lugar_morte": "possibly Baghdad, Iraq",
  "biografia": "Al-Nayrizi\nwas probably born in Nayriz which was a small town southeast of Shiraz now in central Iran. Certainly he must have been associated with this town in his youth to have been called al-Nayrizi. Little is known of his life but we do know that he dedicated some of his works to al-Mu'tadid so he almost certainly moved to Baghdad and worked there for the caliph.\nThe period during which al-Nayrizi was growing up was a turbulent one in the region in which he lived. Following the assassination of the caliph al-Mutawwakil in\n861\nthere was a period of anarchy and civil war. The Caliph al-Mu'tamid and his brother al-Muwaffaq who was a military leader, reunited the empire from\n870\nbut a rebellion was eventually put down in\n883\nonly after many years of military campaigns by al-Muwaffaq and his brother al-Mu'tadid. Al-Mu'tamid died in\n892\nand, since al-Mu'tadid had forced him to disinherit his own son, al-Mu'tadid became caliph in that year.\nAl-Mu'tadid reorganised the administration and reformed finances, and he demonstrated great skill and ruthlessness in dealing with the many factions that had arisen. There followed a period of great cultural activity, with Baghdad home to many intellectuals. Al-Nayrizi must have worked for al-Mu'tadid during his ten year of rule, for he wrote works for the caliph on meteorological phenomena and on instruments to measure the distance to objects. If al-Mu'tadid's reign had begun with political intrigue then it seemed to end in the same way, the general opinion being that, in\n902\n, al-Mu'tadid was poisoned by his political enemies. Al-Mu'tadid's son al-Muktafi became caliph in\n902\nand ruled until\n908\n. It seems likely that al-Nayrizi would continue to work in Baghdad for the new caliph since the same support for intellectuals in Baghdad continued.\nThe\nFihrist\n(\nIndex\n)\nwas a work compiled by the bookseller Ibn an-Nadim in\n988\n. It gives a full account of the Arabic literature which was available in the\n10\nth\ncentury and in particular mentions al-Nayrizi as a distinguished astronomer. Eight works by al-Nayrizi are listed in the\nFihrist\n. A later work, written in the\n13\nth\ncentury, described al-Nayrizi as both a distinguished astronomer and as a leading expert in geometry.\nAl-Nayrizi's works on astronomy include a commentary of\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nand\nTetrabiblos\n. Neither have survived. He is most famous for his commentary on\nEuclid\n's\nElements\nwhich has survived. The Leiden manuscript referred to in the title of\n[\n3\n]\ncontains the revision by al-Nayrizi of the second Arabic translation of\nEuclid\n's\nElements\nby al-Hajjaj. The translation by al-Hajjaj has not survived and the article\n[\n3\n]\nexamines to what extent al-Nayrizi changed the translation, arguing that indeed he made considerable changes. The paper\n[\n4\n]\nlooks at different manuscripts containing versions of al-Nayrizi's commentary, some in Arabic, one a Latin version.\nIn dealing with ratio and proportion in his commentary on the\nElements\n, al-Nayrizi adopts concepts proposed by al-Mahani who had worked in Baghdad, probably before al-Nayrizi arrived there. Al-Nayrizi wrote a work on how to calculate the direction of the sacred shrine of the Ka'bah in Mecca\n(\nto was important for Muslims to be able to do this since they had to face that direction five times each day when performing the daily prayer\n)\n. In this work he effectively uses the tan function, but he was not the first to use these trigonometrical ideas.\nThe article\n[\n2\n]\nis a translation into Russian of the short treatise by al-Nayrizi on\nEuclid\n's fifth postulate. In his work on proofs of the\nparallel postulate\n, al-Nayrizi quotes work by a mathematician named Aghanis. In\n[\n1\n]\nSabra argues convincingly that Aghanis is the Athenian philosopher Agapius who was a pupil of\nProclus\nand\nMarinus\nand taught around\n511\nAD."
}