{
  "nome_completo": "Albert Einstein",
  "nome_curto": "Albert Einstein",
  "ano_nascimento": "1879",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Einstein/",
  "lugar_nascimento": "Ulm, Württemberg, Germany",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Around\n1886\nAlbert Einstein\nbegan his school career in Munich. As well as his violin lessons, which he had from age six to age thirteen, he also had religious education at home where he was taught Judaism. Two years later he entered the Luitpold\nGymnasium\nand after this his religious education was given at school. He studied mathematics, in particular the calculus, beginning around\n1891\n.\nIn\n1894\nEinstein's family moved to Milan but Einstein remained in Munich. In\n1895\nEinstein failed an examination that would have allowed him to study for a diploma as an electrical engineer at the Eidgenössische Technische Hochschule in Zürich. Einstein renounced German citizenship in\n1896\nand was to be stateless for a number of years. He did not even apply for Swiss citizenship until\n1899\n, citizenship being granted in\n1901\n.\nFollowing the failing of the entrance exam to the ETH, Einstein attended secondary school at Aarau planning to use this route to enter the ETH in Zürich. While at Aarau he wrote an essay\n(\nfor which was only given a little above half marks!\n)\nin which he wrote of his plans for the future, see\n[\n13\n]\n:-\nIf I were to have the good fortune to pass my examinations, I would go to Zürich. I would stay there for four years in order to study mathematics and physics. I imagine myself becoming a teacher in those branches of the natural sciences, choosing the theoretical part of them. Here are the reasons which lead me to this plan. Above all, it is my disposition for abstract and mathematical thought, and my lack of imagination and practical ability.\nIndeed Einstein succeeded with his plan graduating in\n1900\nas a teacher of mathematics and physics. One of his friends at ETH was\nMarcel Grossmann\nwho was in the same class as Einstein. Einstein tried to obtain a post, writing to\nHurwitz\nwho held out some hope of a position but nothing came of it. Three of Einstein's fellow students, including\nGrossmann\n, were appointed assistants at ETH in Zürich but clearly Einstein had not impressed enough and still in\n1901\nhe was writing round universities in the hope of obtaining a job, but without success.\nHe did manage to avoid Swiss military service on the grounds that he had flat feet and varicose veins. By mid\n1901\nhe had a temporary job as a teacher, teaching mathematics at the Technical High School in Winterthur. Around this time he wrote:-\nI have given up the ambition to get to a university ...\nAnother temporary position teaching in a private school in Schaffhausen followed. Then\nGrossmann\n's father tried to help Einstein get a job by recommending him to the director of the patent office in Bern. Einstein was appointed as a technical expert third class.\nEinstein worked in this patent office from\n1902\nto\n1909\n, holding a temporary post when he was first appointed, but by\n1904\nthe position was made permanent and in\n1906\nhe was promoted to technical expert second class. While in the Bern patent office he completed an astonishing range of theoretical physics publications, written in his spare time without the benefit of close contact with scientific literature or colleagues.\nEinstein earned a doctorate from the University of Zürich in\n1905\nfor a thesis\nOn a new determination of molecular dimensions\n. He dedicated the thesis to\nGrossmann\n.\nIn the first of three papers, all written in\n1905\n, Einstein examined the phenomenon discovered by\nMax Planck\n, according to which electromagnetic energy seemed to be emitted from radiating objects in discrete quantities. The energy of these quanta was directly proportional to the frequency of the radiation. This seemed to contradict classical electromagnetic theory, based on\nMaxwell\n's equations and the laws of thermodynamics which assumed that electromagnetic energy consisted of waves which could contain any small amount of energy. Einstein used\nPlanck\n's quantum hypothesis to describe the electromagnetic radiation of light.\nEinstein's second\n1905\npaper proposed what is today called the special theory of relativity. He based his new theory on a reinterpretation of the classical principle of relativity, namely that the laws of physics had to have the same form in any frame of reference. As a second fundamental hypothesis, Einstein assumed that the speed of light remained constant in all frames of reference, as required by\nMaxwell\n's theory.\nLater in\n1905\nEinstein showed how mass and energy were equivalent. Einstein was not the first to propose all the components of special theory of relativity. His contribution is unifying important parts of classical mechanics and\nMaxwell\n's electrodynamics.\nThe third of Einstein's papers of\n1905\nconcerned\nstatistical mechanics\n, a field of that had been studied by\nLudwig Boltzmann\nand Josiah\nGibbs\n.\nAfter\n1905\nEinstein continued working in the areas described above. He made important contributions to\nquantum theory\n, but he sought to extend the special theory of relativity to phenomena involving acceleration. The key appeared in\n1907\nwith the principle of equivalence, in which gravitational acceleration was held to be indistinguishable from acceleration caused by mechanical forces. Gravitational mass was therefore identical with inertial mass.\nIn\n1908\nEinstein became a lecturer at the University of Bern after submitting his\nHabilitation\nthesis\nConsequences for the constitution of radiation following from the energy distribution law of black bodies\n. The following year he become professor of physics at the University of Zürich, having resigned his lectureship at Bern and his job in the patent office in Bern.\nBy\n1909\nEinstein was recognised as a leading scientific thinker and in that year he resigned from the patent office. He was appointed a full professor at the Karl-Ferdinand University in Prague in\n1911\n. In fact\n1911\nwas a very significant year for Einstein since he was able to make preliminary predictions about how a ray of light from a distant star, passing near the Sun, would appear to be bent slightly, in the direction of the Sun. This would be highly significant as it would lead to the first experimental evidence in favour of Einstein's theory.\nAbout\n1912\n, Einstein began a new phase of his gravitational research, with the help of his mathematician friend\nMarcel Grossmann\n, by expressing his work in terms of the\ntensor\ncalculus of\nTullio Levi-Civita\nand\nGregorio Ricci-Curbastro\n. Einstein called his new work the general theory of relativity. He moved from Prague to Zürich in\n1912\nto take up a chair at the Eidgenössische Technische Hochschule in Zürich.\nEinstein returned to Germany in\n1914\nbut did not reapply for German citizenship. What he accepted was an impressive offer. It was a research position in the\nBerlin Academy of Sciences\ntogether with a chair\n(\nbut no teaching duties\n)\nat the University of Berlin. He was also offered the directorship of the Kaiser Wilhelm Institute of Physics in Berlin which was about to be established.\nAfter a number of false starts Einstein published, late in\n1915\n, the definitive version of general theory. Just before publishing this work he lectured on general relativity at Göttingen and he wrote:-\nTo my great joy, I completely succeeded in convincing\nHilbert\nand\nKlein\n.\nIn fact\nHilbert\nsubmitted for publication, a week before Einstein completed his work, a paper which contains the correct field equations of general relativity.\nWhen British eclipse expeditions in\n1919\nconfirmed his predictions, Einstein was idolised by the popular press. The London\nTimes\nran the headline on\n7\nNovember\n1919\n:-\nRevolution in science - New theory of the Universe - Newtonian ideas overthrown.\nIn\n1920\nEinstein's lectures in Berlin were disrupted by demonstrations which, although officially denied, were almost certainly anti-Jewish. Certainly there were strong feelings expressed against his works during this period which Einstein replied to in the press quoting\nLorentz\n,\nPlanck\nand\nEddington\nas supporting his theories and stating that certain Germans would have attacked them if he had been:-\n... a German national with or without swastika instead of a Jew with liberal international convictions...\nDuring\n1921\nEinstein made his first visit to the United States. His main reason was to raise funds for the planned Hebrew University of Jerusalem. However he received the Barnard Medal during his visit and lectured several times on relativity. He is reported to have commented to the chairman at the lecture he gave in a large hall at Princeton which was overflowing with people:-\nI never realised that so many Americans were interested in tensor analysis.\nEinstein received the Nobel Prize in\n1921\nbut not for relativity rather for his\n1905\nwork on the photoelectric effect. In fact he was not present in December\n1922\nto receive the prize being on a voyage to Japan. Around this time he made many international visits. He had visited Paris earlier in\n1922\nand during\n1923\nhe visited Palestine. After making his last major scientific discovery on the association of waves with matter in\n1924\nhe made further visits in\n1925\n, this time to South America.\nAmong further honours which Einstein received were the Copley Medal of the\nRoyal Society\nin\n1925\nand the Gold Medal of the\nRoyal Astronomical Society\nin\n1926\n.\nNiels Bohr\nand Einstein were to carry on a debate on quantum theory which began at the Solvay Conference in\n1927\n.\nPlanck\n,\nNiels Bohr\n,\nde Broglie\n,\nHeisenberg\n,\nSchrödinger\nand\nDirac\nwere at this conference, in addition to Einstein. Einstein had declined to give a paper at the conference and:-\n... said hardly anything beyond presenting a very simple objection to the probability interpretation .... Then he fell back into silence ...\nIndeed Einstein's life had been hectic and he was to pay the price in\n1928\nwith a physical collapse brought on through overwork. However he made a full recovery despite having to take things easy throughout\n1928\n.\nBy\n1930\nhe was making international visits again, back to the United States. A third visit to the United States in\n1932\nwas followed by the offer of a post at Princeton. The idea was that Einstein would spend seven months a year in Berlin, five months at Princeton. Einstein accepted and left Germany in December\n1932\nfor the United States. The following month the Nazis came to power in Germany and Einstein was never to return there.\nDuring\n1933\nEinstein travelled in Europe visiting Oxford, Glasgow, Brussels and Zürich. Offers of academic posts which he had found it so hard to get in\n1901\n, were plentiful. He received offers from Jerusalem, Leiden, Oxford, Madrid and Paris.\nWhat was intended only as a visit became a permanent arrangement by\n1935\nwhen he applied and was granted permanent residency in the United States. At Princeton his work attempted to unify the laws of physics. However he was attempting problems of great depth and he wrote:-\nI have locked myself into quite hopeless scientific problems - the more so since, as an elderly man, I have remained estranged from the society here...\nIn\n1940\nEinstein became a citizen of the United States, but chose to retain his Swiss citizenship. He made many contributions to peace during his life. In\n1944\nhe made a contribution to the war effort by hand writing his\n1905\npaper on special relativity and putting it up for auction. It raised six million dollars, the manuscript today being in the Library of Congress.\nBy\n1949\nEinstein was unwell. A spell in hospital helped him recover but he began to prepare for death by drawing up his will in\n1950\n. He left his scientific papers to the Hebrew University in Jerusalem, a university which he had raised funds for on his first visit to the USA, served as a governor of the university from\n1925\nto\n1928\nbut he had turned down the offer of a post in\n1933\nas he was very critical of its administration.\nOne more major event was to take place in his life. After the death of the first president of Israel in\n1952\n, the Israeli government decided to offer the post of second president to Einstein. He refused but found the offer an embarrassment since it was hard for him to refuse without causing offence.\nOne week before his death Einstein signed his last letter. It was a letter to\nBertrand Russell\nin which he agreed that his name should go on a manifesto urging all nations to give up nuclear weapons. It is fitting that one of his last acts was to argue, as he had done all his life, for international peace.\nEinstein was cremated at Trenton, New Jersey at\n4\npm on\n18\nApril\n1955\n(\nthe day of his death\n)\n. His ashes were scattered at an undisclosed place."
}