{
  "nome_completo": "Alexander Craig Aitken",
  "nome_curto": "Alec Aitken",
  "ano_nascimento": "1895",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aitken/",
  "lugar_nascimento": "Dunedin, New Zealand",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Alec Aitken\n's family on his father's side were from Scotland, and on his mother's side were from England. Alec's mother, Elizabeth Towers, emigrated with her family to New Zealand from Wolverhampton, England, when she was eight years old. Alexander Aitken, Alec's grandfather on his father's side, had emigrated from Lanarkshire in Scotland to Otago in New Zealand in\n1868\n, and began farming near Dunedin. Alec's father, William Aitken, was one of his fourteen children and William began his working life on his father's farm. However he gave this up and became a grocer in Dunedin. William and Elizabeth had seven children, Alec being the eldest.\nHe attended the Otago Boys' High School in Dunedin, where he was head boy in\n1912\n, winning a scholarship to Otago University which he entered in\n1913\n. Surprisingly, although he had amazed his school friends and teachers with his incredible memory, he had shown no special mathematical abilities at school. He began to study languages and mathematics at university with the intention of becoming a school teacher but his university career was interrupted by World War I.\nIn\n1915\nhe enlisted in the New Zealand Expeditionary Force and served in Gallipoli, Egypt, and France, being wounded at the battle of the Somme. His war experiences were to haunt him for the rest of his life. After three months in hospital in Chelsea, London, he was sent back to New Zealand in\n1917\n. The following year he returned to his university studies, graduating in\n1920\nwith First Class Honours in French and Latin but only Second Class Honours in mathematics in which he had no proper instruction. In the year he graduated, Aitken married Mary Winifred Betts who was a botany lecturer at Otago University. They had two children, a girl and a boy.\nAitken followed his original intention and became a school teacher at his old school Otago Boys' High School. His mathematical genius bubbled under the surface and, encouraged by R J T Bell the new professor of mathematics at Otago University, Aitken came to Scotland in\n1923\nand studied for a Ph.D. at Edinburgh under\nWhittaker\n. Aitken's wife, Mary, had continued to lecture at Otago up to the time they left for Edinburgh. His doctoral studies progressed extremely well as he studied an actuarially motivated problem of fitting a curve to data which was subject to statistical error. Rather remarkably, his Ph.D. thesis was considered so outstanding that he was awarded a D.Sc. for it in\n1926\n. Even before the award of the degree, Aitken was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1925\n.\nHe was appointed to Edinburgh University in\n1925\nwhere he spent the rest of his life. After holding lecturing posts in actuarial mathematics, then in statistics, then mathematical economics, he became a Reader in statistics in\n1936\n, the year he was elected a Fellow of the\nRoyal Society\n. Ten years later he was appointed to\nWhittaker\n's chair.\nAitken had an incredible memory\n(\nhe knew π to\n2000\nplaces\n)\nand could instantly multiply, divide and take roots of large numbers. He describes his own mental processes in the article\n[\n4\n]\n. Although some may suggest this has little to do with mathematical ability, Aitken himself wrote:-\nFamiliarity with numbers acquired by innate faculty sharpened by assiduous practice does give insight into the profounder theorems of algebra and analysis.\nAitken's mathematical work was in statistics, numerical analysis, and algebra. In numerical analysis he introduced the idea of accelerating the convergence of a numerical method. He also introduced a method of progressive linear interpolation. In algebra he made contributions to the theory of\ndeterminants\n. He also saw clearly how\ninvariant theory\nfitted into the theory of\ngroups\nbut wrote that he had never followed through his ideas because of:-\n... various circumstances of anxiety, or duty, or bad health ... I have observed my talented younger contemporary\nDudley Littlewood\n's assault and capture most of this terrain.\nAitken wrote several books, one of the most famous being\nThe theory of canonical\nmatrices\n(1932)\nwhich was written jointly with\nTurnbull\n. With\nRutherford\nhe was editor of a series of the University Mathematical Texts and he himself wrote for the series\nDeterminants and matrices\n(1939)\nand\nStatistical Mathematics\n(1939)\n. In\n1962\nhe published an article very dear to his heart, namely\nThe case against decimalisation\n.\nIn\n[\n3\n]\n, describing his period of recovery from a small operation in\n1934\nAitken writes:-\nThe nights were bad, in the daytime colleagues and other friends visited me, and I tried to think about abstract things, such as the theory of\nprobability\nand the theory of groups - and I did begin to see more deeply into these rather abstruse disciplines. Indeed I date a change in my interests and an increase in competence, from these weeks of enforced physical inactivity.\nAlso in\n[\n3\n]\nAitken describes the reaction of other mathematicians to his work:-\n... the papers on numerical analysis, statistical mathematics and the theory of the\nsymmetric group\ncontinued to write themselves in steady succession, with other small notes on odds and ends. Those that I valued most, the algebraic ones, seemed to attract hardly any notice, others, which I regarded as mere application of the highly compressed and powerful notation and algebra of matrices to standard problems in statistics or computation found great publicity in America...\nColin M Campbell, now a colleague of the authors of this archive at the University of St Andrews, was a student in Edinburgh in the early\n1960\n's. He writes:-\nProfessor Aitken's first year mathematics lectures were rather unusual. The fifty minutes were composed of forty minutes of clear mathematics, five minutes of jokes and stories and five minutes of 'tricks'. For the latter Professor Aitken would ask for members of the class to give him numbers for which he would then write down the reciprocal, the square root, the cube root or other appropriate expression. From the five minutes of 'stories' one also recalls as part of his lectures on probability a rather stern warning about the evils and foolishness of gambling!\nIn fact Aitken's memory proved a major problem for him throughout his life. For most people memories fade in time which is particularly fortunate for the unpleasant things which happen. However for Aitken memories did not fade and, for example, his horrific memories of the battle of the Somme lived with him as real as the day he lived them. He wrote of them in\n[\n2\n]\nnear the end of his life. These memories must have contributed, or perhaps were the entire cause, of the recurrent ill health he suffered. Collar writes\n[\n1\n]\n:-\nThese black periods must have been harrowing in the extreme, but were borne with great fortitude and courage.\nThe illness eventually led to his death. The book\n[\n2\n]\n, which he wrote to try to put the memories of the Somme behind him, may not have had the desired effect but the book led to Aitken being elected to the Royal Society of Literature in\n1964\n.\nFinally we should mention Aitken's love of music. He played the violin and composed music to a very high standard and a professional musician said:-\nAitken is the most accomplished amateur musician I have ever known."
}