{
  "nome_completo": "Aleksandr Gennadievich Kurosh",
  "nome_curto": "Aleksandr G Kurosh",
  "ano_nascimento": "1908",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kurosh/",
  "lugar_nascimento": "Yartsevo (near Smolensk), Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Aleksandr Gennadievich Kurosh\n's father was a clerk in a cotton factory. His life became harder at age six with the outbreak of World War I and his family wrote that, despite his young age, Shura\n(\nas he was known\n)\nfollowed the events in the newspapers. In the middle of the war, in\n1916\n, Shura entered school, going straight into the third class. After the war Shura's life soon became even harder when, in\n1920\n, his father died of tuberculosis. The family were poor and, in order to survive, Kurosh had to work as well attend school.\nKurosh left school at the age of\n15\nand went to Moscow to take the examinations for the Textile Institute. He achieved very high grade passes in the entrance examinations but was judged to be too young to enter the Institute. He was sent back to his home in Yartsevo where he obtained a job as an accountant. Kurosh never intended to spend his life as an accountant and he studied at evening classes after a full working day. Up to this time, unlike many great mathematicians, he had no particular passion for the subject. His special topic at the evening classes was the stream engine.\nIn\n1924\nKurosh became a student at Smolensk University. It was at this time that his interest moved towards mathematics and he later wrote how he was influenced towards algebra:-\nIn\n1926\nPavel Sergeevich\nAleksandrov\nbegan to give lectures at the university. ... I attended his lectures on the theory of sets, the theory of functions, and\ntopology\n. In\n1928\nI was kept on at the university by\nAleksandrov\nas a postgraduate student. At that time\nEmmy Noether\nwas in Moscow and gave a course at Moscow State University on abstract algebra, which\nAleksandrov\nattended. Under the fresh impression of these lectures he gave a course on modern algebra at Smolensk. It was then that my scientific interests were formed.\nIn\n1929\nKurosh was assigned to the Institute of Mathematics and Mechanics at Moscow State University. This was done at\nAleksandrov\n's request since he was by this time in Moscow and wished to continue to supervise Kurosh's work. However, although Kurosh's first results were in topology, solving problems posed by\nAleksandrov\n, he was already interested in the\ntheory of groups\n. He had read O Yu Schmidt's group theory papers while still in Smolensk so when he found himself able to attend Schmidt's seminar at Moscow State University, his interest in groups increased further. However, after attending Schmidt's group theory course in\n1930\n, he found himself taking over some of Schmidt's duties when he left the university in the autumn of that year.\nKurosh was appointed an assistant at Moscow State University in\n1930\nbecoming a lecturer in\n1932\nand a professor there in\n1937\n. The professorial appointment came after Kurosh was awarded his doctorate for a thesis entitled\nResearch on infinite groups\nwhich he defended on\n22\nApril\n1936\n. It should be mentioned that the doctorate was a much higher degree than the present British/American PhD which compares in level with the Master's Degree in Russia. In\n1949\nhe became a director at Moscow State University where he continued to work throughout his career.\nThe Chair of Higher Algebra at Moscow State University was created in\n1929\nand\nO Yu Schmidt\nwas the first occupant of the Chair. Kurosh was the second holder of the Chair, holding the Chair from\n1949\nuntil his death in\n1971\n. Like most Russian academics of that period, Kurosh had a variety of other attachments teaching courses and lectured at a number of other institutions in Moscow.\nAs mentioned above, Kurosh's first significant results were in topology, solving a problem set by\nAleksandrov\n. Quickly he moved to research in group theory and his first paper on this topic appeared in\n1932\non direct decompositions of groups. Shortly after completing this work, Kurosh came across\nSchreier\n's papers on free products of groups. Soon he was producing important results on the topic and two papers came out of his work on free products. The second of these papers appeared in\nMathematische Annalen\nand contains a proof of the celebrated Kurosh\nsubgroup\ntheorem, which describes subgroups of a free product of groups. This paper brought Kurosh international fame.\nKurosh is best known for his book\nThe Theory of Groups\nwhich was written in two volumes. He completed writing the book in\n1940\nbut the events of World War II prevented publication of the book until\n1944\n. In\n1952\nKurosh brought out a second edition of the book which was almost a new book given that it attempted to cover the large amount of progress during the years\n1940\n-\n52\n. The book, in the words of Kurt\nHirsch\nwho translated the book into English in\n1955\n:-\nhas been widely acclaimed as the first modern text on the general theory of groups, with major emphasis on infinite groups.\nThe book includes many of Kurosh's own results on groups, in particular the Kurosh Subgroup Theorem mentioned above. However, Kurosh did not spend all his research efforts on group theory. In\n[\n1\n]\nthe progression of his work is described in these terms:-\nGradually, along with papers on group theory, Kurosh began to publish papers on ring theory, linear algebra and lattices; later, also papers on category theory and the theory of multi-operator groups, rings and linear algebras.\nSome of this work was described in his other famous textbook\nLectures on General Algebra\npublished in\n1960\nwhich became an internationally famous text. As with\nThe Theory of Groups\nthis text was also translated into English by\nHirsch\n.\nDuring the\n1950\ns he concentrated on Universal algebra and category theory, organising a major seminar on category theory in\n1958\n. Many mathematicians participated in this seminar and it led to the birth of the Moscow School of Category Theory. In his last years Kurosh worked in an area best described in his own words taken from a lecture that he gave in\n1970\n:-\n... between the theory of universal algebras and the classical branches of general algebra there exists a big uncultivated space. Research has begun only in a few places, isolated, sometimes random ... One has to expect that it is precisely in this no-man's land where the basic branches of general algebra will move in the next decades. In accordance with the general tendencies of contemporary science ... new objects of study, new theories will appear ... more and more often. To stop this process is impossible, to try to stop it is unreasonable. One can only direct this process.\nKurosh's whole life was involved in teaching at all levels from directing the research of young people, to lecturing, to designing new courses. As the authors of\n[\n1\n]\nwrite:-\nKurosh belonged to that category of scientists who could not conceive of their creative work without attracting wide circles of youths to science.\nNot only did Kurosh work with university students but he gave many popular lectures to school children. Twice he organised the Moscow University Olympiads for school mathematics. There were other ways too in which he served mathematics. One way was his long involvement with the\nMoscow Mathematical Society\n.\nIn\n1931\n, while he was still an assistant, Kurosh joined the\nMoscow Mathematical Society\nand he was elected to its governing body in\n1933\n, only a year after his appointment as a lecturer. In that year he gave his first lecture to the Society on Fundamental trends in finite group theory. During the years\n1943\n-\n48\nKurosh served the Society as its Librarian and then for\n22\nyears from\n1948\nhe served continuously on the governing body of the Society. During six of these years he was Vice-President."
}