{
  "nome_completo": "Aleksandr Petrovich Kotelnikov",
  "nome_curto": "Aleksandr P Kotelnikov",
  "ano_nascimento": "1865",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kotelnikov/",
  "lugar_nascimento": "Kazan, Russia",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Aleksandr Kotelnikov\n's father P I Kotelnikov was a colleague of\nLobachevsky\nand, in fact, the only one of his colleagues to publicly praise his great geometrical achievements during his lifetime. This connection between Kotelnikov's father and\nLobachevsky\nis important since the\nLobachevsky\nconnection was to play a large role in Kotelnikov's work throughout his life.\nKotelnikov was educated at the University of Kazan, graduating in\n1884\n. After this he taught at a\ngymnasium\nin Kazan before entering the Department of Mechanics at Kazan to work for his university teachers qualification. He began teaching at Kazan University in\n1893\n, then in\n1896\nhe received his Master's Degree.\nThe thesis he presented for the Master's Degree was\nThe Cross-Product Calculus and Certain of its Applications in Geometry and Mechanics\n. This thesis applied vector methods in theoretical mechanics, and he was to teach this vector approach to mechanics throughout his life.\nKotelnikov obtained his doctorate in\n1899\nfor a thesis\nThe Projective Theory of Vectors\nwhich generalised the vector calculus to the\nnon-euclidean spaces\nof\nLobachevsky\nand\nRiemann\n. He also applied this to mechanics in non-euclidean spaces. Much of his career is spent working on physics and non-euclidean geometry.\nIn\n1899\n, the year he received his doctorate, he was appointed professor and Head of the Department of Pure Mathematics at the University of Kiev. Perhaps it is worth pointing out that in many countries today a doctorate is a lower degree, essentially a degree of a level to start university teaching. This was equivalent to the Master's Degree referred to here, where the doctorate was really the qualification necessary to become a professor.\nIn\n1904\nKotelnikov left Kiev and returned to Kazan to become professor and Head of the Department of Pure Mathematics at the University. After\n10\nyears he went back to Kiev again, this time o become Head of Theoretical Mechanics at the Polytechnical Institute. After another\n10\nyears he moved, in\n1924\n, to Moscow, where he worked at the Bauman Technical College until his death in\n1944\n.\nIn\n1927\nhe published one of his most important works,\nThe Principle of Relativity and\nLobachevsky\n's Geometry\n. He also worked on\nquaternions\nand applied them to mechanics and geometry.\nAmong his other major pieces of work was to edit the Complete Works of two mathematicians,\nLobachevsky\nand\nZhukovsky\n. He received many honours for his work, being named Honoured Scientist in\n1934\n, then one year before he died he was awarded the State Prize of the USSR."
}