{
  "nome_completo": "Alessandro Faedo",
  "nome_curto": "Alessandro Faedo",
  "ano_nascimento": "1913",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faedo/",
  "lugar_nascimento": "Chiampo, Vicenza, Italy",
  "lugar_morte": "Pisa, Italy",
  "biografia": "Alessandro Faedo\nwas usually known as Sandro Faedo; in fact almost all his papers are written under the name Sandro Faedo. His father, Marco Faedo,  was a merchant, and his mother was Armida Peretti. Sandro was the oldest of his parents' five children, all sons. Sadly, Sandro was still a child when his mother Armida died. His secondary education was at a boarding school in Padua. After graduating, he studied at the Scuola Normale Superiore in Pisa where he was taught by\nLeonida Tonelli\nwho had been appointed to Pisa in\n1930\n. The Scuola Normale was originally founded in\n1810\nby a decree of Napoleon Bonaparte and intended to be a sister institute of the École Normale Supérieure in Paris. It had become an institute of higher education linked to the University of Pisa in\n1932\nwhile Faedo was studying there. He obtained his laurea in\n1936\nafter writing a thesis with\nTonelli\nas his advisor. The topic of the thesis was the Calculus of Variations and he developed ideas on the \"direct method\" introduced by\nTonelli\nin the\n1920\ns. After graduating, he was appointed as a substitute lecturer in geometry at the Scuola Normale in Pisa. His early publications include:\nOrdine di grandezza dei coefficienti di Eulero-Fourier delle funzioni di due variabili\nⓉ\n(\nOrders of magnitude of the Euler-Fourier coefficients of functions of two variables\n)\n(1937)\nand\nSulla sommabilità per linee e per colonne delle serie doppie di Fourier\nⓉ\n(\nOn the summability for rows and columns for double Fourier series\n)\n(1938)\n.\nIn\n1937\nhe was appointed as an assistant to\nFederigo Enriques\nwho held the chair of higher geometry in Rome. The authors of\n[\n9\n]\nexplain how this came about:-\nDuring the winter of\n1936\n-\n37\n[\nFaedo\n]\nmet\nEnriques\nwho arrived in Pisa with the alleged purpose of meeting the students of the Normale, but he really wanted to find among\nTonelli\n's students an assistant who could take the place of Campedelli, who had become a professor.\nEnriques\n' choice fell on Faedo, who moved to Rome in March\n1937\nafter overcoming certain perplexities associated with the relocation and to the discipline itself\n(\ngeometry\n)\nin which he had not earned a degree. The following year Faedo substituted for\nEnriques\n, teaching his courses for a brief period during his trip to Scotland for an honorary degree\n[\nfrom St Andrews University\n]\n.\nThe events before, during, and following World War II all had a huge impact on Faedo's career. The Italian Fascist movement had started around\n1921\nas a nationalist movement following on from the Italian irredentism movement. Led by Benito Mussolini, the Fascists came to power in\n1923\nand although they did not adopt racial policies at first, in the\n1930\ns they began to adopt similar anti-Semitic laws to those being enacted in Nazi Germany, in particular enacting the Manifesto della razza\n(\nManifesto of Race\n)\nin July\n1938\n.\nFederigo Enriques\nwas Jewish, so he was forced to resign from teaching later that year. Faedo had established a collaboration with\nEnriques\nand was able to keep him informed about events in the Mathematical Institute which\nEnriques\nwas barred from entering. However, suddenly Faedo had no assistant position in Rome and he had to look for an alternative post.\nLeonida Tonelli\n, although retaining his chair in Pisa, was transferred to Rome during\n1939\n-\n42\n. However, he did not spend all his time in Rome, treating the appointment as only nominal. The fact that he was covering for Jewish mathematicians who had been dismissed was an embarrassment to\nTonelli\n. This did, however, provide Faedo with an excellent opportunity and he was appointed as\nTonelli\n's assistant\n[\n9\n]\n:-\nTonelli\nspent the early part of the week in Rome, where he arrived on Monday and left on Wednesday. Faedo helped him with the small issues related to a new residence and their relations became less \"professional\". ... In Rome Faedo developed relationships with\nSeveri\nand\nPicone\nbut ... there were a few problems.\nThese problems were due to the fact that\nTonelli\n's relations with the others at Rome was not that good, particularly his relations with\nSeveri\n, and this made difficulties for Faedo as his assistant. Faedo attended the Second Congress of the Italian Mathematical Union in Bologna in April\n1940\n. He presented the paper\nDeformazione di una piastra a spessore variabile soggetta a pressione\nⓉ\n(\nDeflection of a plate of variable thickness subject to pressure\n)\nto the Congress.\nWilliam Prager\ndescribes the results of this paper:-\nApplying the theory of the circular elastic plate of variable thickness the author determines the deformation of a spherical biconcave or biconvex lens supported by a circular ring and subjected to a uniform pressure on one side.\nFaedo published several papers in\n1940\n-\n41\non a variety of different topics:\nIl principio di Zermelo per gli spazi astratti\nⓉ\n(\nThe principle of Zermelo for abstract spaces\n)\n(1940)\n,\nSulle trasformate multiple di Laplace\n(1941)\n;\nContributo alla sistemazione teorica del metodo variazionale per l'analisi dei problemi di propagazione\nⓉ\n(\nContribution to the theoretical system of the variational method for the analysis of propagation problems\n)\n(1941)\n,\nSu gli insiemi chiusi di misura nulla\nⓉ\n(\nOn closed sets of measure zero\n)\n(1941)\n, and\nIl principio di Zermelo per lo spazio delle funzioni continue\nⓉ\n(\nThe principle of Zermelo for the space of continuous functions\n)\n(1941)\n. This last mentioned paper:-\n... sets down a rule for selecting a definite function from an arbitrary closed class of continuous functions of a single real variable. The functions of the class need not all be defined on the same interval, and the intervals of definition may be finite or infinite.\nIn\n1941\nFaedo became a\ndocent\nin Rome but, by this time, Italy was taking part in World War II. Italy kept out of the war for the first few months but then joined the hostilities of World War II, declaring war on Britain and France on\n10\nJune\n1940\n, only days before France surrendered to the Germans. The Scuola Normale continued to operate despite the war, but there were some limitations and practical difficulties. The Scuola Normale Superiore of Pisa suffered severely during the war. Pisa was bombed by the Americans on\n31\nAugust\n1943\nand the director of the Scuola Normale, Luigi Russo, being threatened with arrest, fled.\nLeonida Tonelli\nbecame the new director and he did much to preserve the Scuola Normale which was being used as a German barracks. Pisa was liberated by the Allies on\n2\nSeptember\n1944\nand on\n25\nSeptember\n1945\nrestoration of the Scuola Normale began while a number of war veterans signed up as students.\nTonelli\ndied in March\n1946\nand Faedo entered the competition to fill the vacant chair. He was successful and appointed first as professor of infinitesimal analysis and later, in\n1950\n, as an ordinary professor and head of mathematics at Pisa. He worked tirelessly to make the Scuola Normale a world leading centre for mathematics\n[\n5\n]\n:-\nThe presence of Faedo in Pisa marked a turning point for Pisan mathematics. With his great energy and his skills as an organizer, innovator and promoter he rebuilt a great mathematical school and revitalized the Mathematics Institute in Pisa bringing it to levels of absolute excellence. From\n1958\nto\n1972\nhe was Rector of the University of Pisa. Early in his tenure he was able to secure the appointment as professors of an amazing constellation of mathematical talents including\nAldo Andreotti\n,\nJacopo Barsotti\n,\nEnrico Bombieri\n(\nwho was to receive the\nFields\nmedal in\n1974)\n,\nEnnio De Giorgi\n,\nGuido Stampacchia\n, Gianfranco Capriz,\nGiovanni Prodi\nand many other scholars. From the mid-\n1960\ns onward, Faedo essentially ceased his research activities to dedicate all his time and energy to his work as a manager and organizer.\nBefore looking at Faedo's contributions as a 'manager and organiser' we should say more about Faedo's mathematical contributions. We have already seen that he made contributions to a wide variety of areas such as the calculus of variations, the theory of linear ordinary differential equations, the theory of partial differential equations,\nmeasure theory\n, the\nLaplace\ntransform for functions of several variables, questions relating to existence for linear equations in\nBanach spaces\n, and foundational problems such as his work on\nZermelo\n's principle in infinite-dimensional function spaces. However, he is best known for his\n41\n-page paper\nUn nuovo metodo per l'analisi esistenziale e quantitativa dei problemi di propagazione\nⓉ\n(\nA new method for the quantitative analysis of the existential and propagation problems\n)\npublished in\n1949\n. This paper contains a description and analysis of a method for solving time-dependent partial differential equations which is today known as the Faedo-\nGalerkin\nmethod\n[\n5\n]\n:-\nThis method, which has since become classical, has been widely applied and extended by a number of researchers and has been shown to be an effective tool, both computational and theoretical, in the study of complex problems such as the\nNavier\n-\nStokes\nsystem in incompressible fluid dynamics and many others.\nLet us return to our discussion of Faedo's other achievements. At Pisa he held a number of positions of importance, for example he was dean of the Faculty of Science from\n1953\nand rector of the University of Pisa from\n1958\nto\n1972\nsucceeding Enrico Avanzi. He realized the need to establish a permanent conference of rectors of all Italian universities and he was appointed the first president of that body. One of his most significant achievements as rector was his efforts to bring the teaching of computer science to Pisa. He established the degree of Master of Science in Computer Science at Pisa in\n1969\n, the first degree in Computer Science in Italy. This aspect of Faedo's contributions are important and we describe in more detail how this came about.\nEnrico Fermi\nsaw the importance of computer science and approached the rector of the University of Pisa, Enrico Avanzi, suggesting that the university should be involved in these new highly significant developments.\nThe text of\nFermi\n's letter is at\nTHIS LINK\n.\nTowards the end of\n1954\n, the rector asked Faedo to set up a team to look into building a computer. The Centro Studi Calcolatrici Elettroniche was set up and Faedo's team, which included physicists and electrical engineers, designed and built the Calcolatrice Elettronica Pisana. Completed in\n1961\nand inaugurated on\n13\nNovember of that year, this was the first computer designed and built in Italy. Faedo served on the steering committee of the Centro Studi Calcolatrici Elettroniche from\n1954\nto\n1958\n. Realising that the United States had become the world leader in computer technology, Faedo visited the United States in the early\n1960\ns to learn more about the most recent developments. He was able to purchase an IBM\n7090\n, which at that time was the best and most powerful computer in production, for the University of Pisa. In\n1964\nFaedo founded the National University Computing Centre as a part of the Italian National Research Council. Despite many recognising the significance of computing developments, other colleagues of Faedo's did not see this as more than a passing phase of little or no academic significance. It is a tribute to his belief and his ability to persuade his colleagues that he was able to oversee the setting up of the Master of Science in Computer Science at Pisa in\n1969\n. He had to ensure that Pisa had staff with the skills necessary to teach this new topic and he was able to appoint a number of young computer scientists, most of them from Milan. The Italian National Research Council saw Faedo's abilities and achievements at Pisa and elected him as their president, a role in which he served from\n1972\nto\n1976\n. Of course, the Italian National Research Council was involved in many developments in addition to computers, in particular the Sirius satellite program. Faedo played a leading role in the successful launch of this satellite for research into the use of new very short wavebands for telecommunications.\nIn\n1976\nFaedo's term as president of the Italian National Research Council came to an end. One might have though that after this period of intense organising and administration, Faedo might have looked for a quieter time. However, he went in what one might call exactly the opposite direction beginning a period of intense parliamentary activity. From\n1976\nto\n1983\n, he was elected to be a Senator of the Italian Republic, serving for two terms. His educational expertise was put to good use by appointing him as chairman of the Senate Education Committee. In this role he was responsible for overseeing major reforms in the Italian university system.\nFaedo married Irma Sulis, a graduate in Chemistry. They had four children, three girls and a boy, and their eldest daughter, Lucia Faedo, became professor of Roman Archaeology at the University of Pisa.\nFaedo was elected to membership in many scientific academies. For example he was elected to the Accademia Olimpica di Vicenza in\n1951\nand served as its president from\n1990\nto\n1994\n. In a meeting dedicated to his memory, the Academy stated:-\nWith the light of his knowledge, the charm of his personality and the mature wisdom throughout his long career, he has given the Olympic Academy an operating boost and new prestige.\nAmong many other honours given to Faedo we mention: the Cavaliere di Gran Croce dell'Ordine al Merito della Repubblica Italiana and his being made an Officier de la Légion d'Honneur. The Institute of Information Science and Technologies was constituted in September\n2000\nand named after Faedo. It became fully operational in Pisa in\n2002\n. Let us end with a tribute by Giorgio Letta\n[\n11\n]\n:-\nIt was in fact the cream of Italian mathematics which met in Pisa. All mathematicians of the highest level, who were often enticed by offers from prestigious foreign universities, it was Faedo who \"chased and hunted\" them with obstinacy, sometimes having to overcome tough resistance or overcome bureaucratic obstacles. Under Sandro Faedo's fatherly, caring and enlightened leadership\n(\ntrue \"guardian angel\" of our Institute, as affectionately defined by playful Edoardo Vesentini\n)\n, there was a spectacular revival of mathematics in Pisa. Pisa was not only placed at the top in Italy, but assigned a respectable position on the international scene. Today the members of the department in Pisa and, more generally, members of the Italian mathematical community, are mostly students, direct or indirect, of the masters of that glorious period. It is natural that they look to Sandro Faedo with affection and gratitude."
}