{
  "nome_completo": "Alessandro Marco Benedetto Terracini",
  "nome_curto": "Alessandro Terracini",
  "ano_nascimento": "1889",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Terracini/",
  "lugar_nascimento": "Turin, Piedmont, Italy",
  "lugar_morte": "Turin, Piedmont, Italy",
  "biografia": "Alessandro Terracini\nwas the son of Beniamino Moise Benedetto Terracini\n(1848\n-\n1899)\nand Eugenia Levi\n(1862\n-?\n)\n. Benedetto Terracini was born in Asti, Piedmont, Italy on\n12\nJanuary\n1848\n. He became a wealthy merchant and goldsmith, and married Eugenia Levi, who was born on\n26\nFebruary\n1862\n. Benedetto and Eugenia Terracini had two sons, Aron Jona Benvenuto Terracini\n(1886\n-\n1968)\n, known as Benvenuto, and Alessandro Terracini\n(1889\n-\n1968)\n, the subject of this biography. The family was Jewish and, given the Fascist Racial Laws brought in by Mussolini's government in the\n1930\ns, both sons would later suffer discrimination. Benvenuto Terracini was born in Turin on\n12\nAugust\n1886\n. He studied at the Massimo d'Azeglio classical high school in Turin, then at the University of Turin and at the École des Hautes Études in Paris. He became an expert in historical linguistics and was a professor at the universities of Cagliari, Padua and Milan.\nBenedetto Terracini died on\n8\nDecember\n1899\nwhen Alessandro was ten years old but the family was sufficiently wealthy that Eugenia Terracini, a person of great energy, was able to give both her sons a top quality education. Alessandro began his secondary education at the liceo classico Massimo d'Azeglio in Turin. This school had been founded in\n1831\nas the Collegio di Porta Nuova and acquired various names before being named for Massimo d'Azeglio in\n1882\n. Alessandro spent three years at this school, then in\n1902\nhe transferred to the Liceo Classico Cavour, the oldest high school in Turin, founded in\n1568\nand renamed for Camillo Benso, conte di Cavour in\n1865\n. At this school he was fortunate to have Rodolfo Bettazzi\n(1861\n-\n1941)\nas his mathematics teacher. Bettazzi had graduated from the University of Pisa in\n1882\nand spent four years as\nUlisse Dini\n's assistant before becoming a teacher at the Liceo Classico Cavour in\n1891\n. In\n1895\nhe was one of the founders of Mathesis and became its first president. He wrote a number of outstanding textbooks, for example\nLa risoluzione dei problemi numerici e geometrici\nⓉ\n(\nThe resolution of numerical and geometric problems\n)\n(1893)\nand was elected to the\nAccademia dei Lincei\n. Alessandro was an outstanding student, winning many prizes and he graduated with honours on\n31\nOctober\n1907\n.\nWhile at this school he was an enthusiastic problem solver, sending solutions to the problems posed in the journals\nSupplemento al Periodico di matematica\n,\nIl Pitagora\n, and\nMathesis\n. In the two years from January\n1905\nto December\n1906\nhe submitted over\n70\nsolutions to problems posed in\nSupplemento al Periodico di matematica\nand from December\n1906\nto March\n1908\nhe solved six problems in\nMathesis\nand had two articles\nNote sur les coniques\nⓉ\n(\nNotes on conics\n)\n, and\nThéorèmes sur les transversals\nⓉ\n(\nTheorems on transversals\n)\npublished in it.\nCristoforo Alasia\nmade the following comment on one of the competitive questions set in\nSupplemento al Periodico di matematica\n[\n1\n]\n:-\nThe work of Mr Terracini is the most extensive, as he wrote about\n80\npages which in various points are not without merit. He demonstrates that he has a broad spirit of observation and great ease of deduction, showing he must profitably have read more than one work on the recent geometry of the triangle.\nWhile Terracini was still at school his teacher Rodolfo Bettazzi had put him in contact with\nCorrado Segre\nat the University of Turin so when Terracini began his studies of mathematics at this university he had already been introduced to university studies. He attended courses by\nSegre\nand also by other leading mathematicians such as\nEnrico D'Ovidio\n,\nGino Fano\n,\nGiuseppe Peano\n,\nTommaso Boggio\n, and Gustavo Sannia\n(1875\n-\n1930)\n. He also took mathematical physics courses given by Carlo Somigliana\n(1860\n-\n1955)\nand Ernesto Laura\n(1879\n-\n1949)\n. Terracini, however, made a point of learning as much as he could from\nSegre\n, taking three of his advanced courses:\nReview of concepts and methods of modern geometry\n(1908\n-\n1909)\n;\nSurface of the\n3\nrd order and plane curves of the\n4\nth order\n(1909\n-\n1910)\n; and\nAlgebraic curves and surfaces, from the point of view of the Geometry of birational transformations\n(1910\n-\n11)\n. He wrote in his autobiography\n[\n28\n]\n:-\nCorrado Segre\n's lectures were usually only attended from the third year of university, but I began to attend them in my second year, that is, in\n1908\n-\n1909\n. They were held on Tuesday, Thursday and Saturday morning from\n10\nto\n11\n, formerly on the first floor in the hall that occupied the place then taken by the room that currently precedes the aula magna, and later, I believe, in room XVII on the second floor of the University Building in Via Po, around the walls of which there ran the glass cabinets with the geometrical models of Brill which later, I think, were destroyed in a bombing.\nIn\n1909\nhe published his first research paper\nNota su una classe di determinanti\nⓉ\n(\nNote on a class of determinants\n)\n. He asked\nSegre\nfor a thesis topic and was assigned a problem in differential projective geometry. In\n[\n28\n]\nhe explained how\nSegre\ngave thesis topics to his students:-\n… he assigned the degree theses in writing with a long and detailed exposition of the state of the question that the graduate had to deal with … he examined his students quite often, always formulating in writing his criticisms and any suggestions for the continuation of their work.\nSegre\nproposed a problem on hyperspatial varieties for Terracini's thesis which he solved with an outstanding piece of work. He graduated on\n5\nJuly\n1911\nhaving submitted the thesis\nSulla teoria delle varietà luoghi di spazi\nⓉ\n(\nOn the theory of locus varieties of spaces\n)\n. In November of\n1911\nhe was appointed as an assistant to\nGino Fano\n.\nTerracini attended the International Congress of Mathematicians held in Cambridge, England on\n22\n-\n28\nAugust\n1912\n. Although he did not give a lecture, he attended the lecture\nRecenti progressi nella geometria proiettiva differenziale degli iperspazi\nⓉ\n(\nRecent advances in the differential projective geometry of hyperspaces\n)\nby\nEnrico Bompiani\nwho talked extensively of\nSegre\n's work and mentioned the contributions by Terracini.\nBompiani\nhad been a student of\nCastelnuovo\nwho had informed\nSegre\nand Terracini in the spring of\n1910\nthat\nBompiani\nwas working on similar problems to Terracini. The Congress in Cambridge, however, was the first time that Terracini and\nBompiani\nhad met. Terracini also met\nEnriques\n,\nSeveri\nand\nCastelnuovo\nand wrote in his autobiography\n[\n28\n]\n:-\nAmong the mathematicians I saw in Cambridge, the venerable figure of\nMittag-Leffler\n(1846\n-\n1927)\nand Prof\nEdmund Landau\n(1877\n-\n1938)\nmade a particular impression on me and, as for the places, the solemn atmosphere, rich in historical memories, and the austere halls of the Colleges left an indelible memory in me.\nAfter the Congress Terracini and\nBompiani\ncorresponded but although they had proved similar results, their methods were quite different and, as\nBompiani\nwrote in one of his letters, \"leave us equal merit.\" After meeting in Bologna they agreed to publish their work in separate papers in the same volume of the journal\nAtti della Accademia delle scienze di Torino\nand these were published in November\n1913\n. Terracini wrote\n(\nin English\n)\nabout the beginnings of his research when looking to leave Italy due to the racial laws of the late\n1930\ns\n(\nsee\n[\n12\n]\n)\n:-\nThe moment I began to undertake my researches on projective differential geometry happened to coincide with the years in which this branch had just left its initial period. Some of the methods were already formed and had been put to the test through the easier problems which always present themselves at the dawn of a new theory; the opportunity of contriving other methods was still kept for the future. Among the first the most important was doubtless the method based on the use of linear partial differential equations. This method was already classical for the curves, and\nWilczynski\nhad successfully employed it in the theory of surfaces. But it is with the consideration of loci in hyperspaces that the most interesting problems arise. I have endeavoured to use such a method to confront the manifold new problems which presented themselves.\nWorld War I began in July\n1914\nbut Italy, despite being a member of the Triple Alliance with Germany and Austria-Hungary, declared its neutrality. In May\n1915\nItaly, after negotiations with the Allies and the promise of the South Tyrol and other areas if victorious, joined the Allies and declared war on Austria-Hungary in May\n1915\nand on the German Empire in August\n1916\n. Terracini clearly approved of Italy joining the war on the side of the Allies. He served first in Rome in the Battalion of the Railway Engineers, then after attending courses in the Military Academy of Turin, was assigned to the\n22\nnd Miners Company and assisted in building fortifications in Gorizia in north east Italy, the scene of fierce fighting between Italy and Austria-Hungary. In the spring of\n1916\nhe went to Gemona, north of Udine, then in the autumn of\n1917\nto Schio, north of Vienza, where he served in the Artillery Command of the Fifth Army Corps. There he met\nMauro Picone\nwhom he had already met when\nPicone\nwas serving as\nFubini\n's assistant at the Polytechnic of Turin. For his exceptional wartime service, Terracini was awarded the silver medal of military valour in\n1917\n. In February\n1918\nboth\nPicone\nand Terracini were assigned to the Artillery Command of the Sixth Army in Breganze, also north of Vienza. Here, together with General Roberto Segre and\nPicone\n, Terracini calculated firing charts for use in the mountains.\nPicone\nwrites\n[\n25\n]\n:-\nIn our little office, located in the attic of a country farm, I and the collaborators I had been able to obtain worked ... I had five calculating machines ... We worked day and night ... for a long time, one of my collaborators - a friend and a genius - was Alessandro Terracini ... with whom, in the\n6\nth Army, supported by the commander of the artillery general Roberto Segre, we founded a real Calculation Institute.\nAt the end of World War I, Terracini returned to Turin but Ermenegildo Daniele\n(1875\n-\n1949)\n, the professor of Rational Mechanics at the University of Modena, offered him a position in Modena and, in the autumn of\n1919\n, he took up a position of assistant at the University of Modena. He taught Algebraic Analysis and Descriptive Geometry with Drawing and continued his research. The political situation in Italy was, however, beginning to be difficult. Terracini wrote\n[\n24\n]\n:-\nThose were the torrid years in which fascism asserted itself, accompanied also by violent aspects among which I cannot fail to mention the fire - in the central Piazza Mazzini - with which the house of the communist deputy Pio Donati, brother of professor Mario, was destroyed.\nMario Donati\n(1879\n-\n1949)\n, held the chair of surgical pathology at the University of Modena at this time. In\n1923\nTerracini returned to Turin when appointed to Analytical Geometry at the University. In February\n1924\nhe was declared the winner of the competition for a chair at the University of Cagliari and also for a chair at the University of Catania. In the position of being able to choose between the two, he decided on Catania. On\n16\nApril\n1924\nhe married Giulia Sacerdote\n(1899\n-\n1974)\n.\nEnrico Bompiani\nwas a witness at the wedding. Giulia, the daughter of Cesare Lazzaro Sacerdote and Michelina Terracini, had been born on Como, Lombardy, Italy on\n6\nNovember\n1899\n. They had three children, Lore Terracini born on\n6\nAugust\n1925\nin Turin, Cesare Benedetto Terracini born on\n15\nJuly\n1927\nin Turin, and Benedetto Terracini born in\n1931\nin Turin. Now Alessandro and Giulia's three children were all born in Turin since Terracini returned to Turin in\n1925\nwhen he was appointed to the chair of Analytical Geometry and as head of Higher Geometry. He was back in his home town and at the university where he was happiest. His friend\nFrancesco Tricomi\nwas also appointed to Turin at about the same time and wrote\n(\nin\n1972)\n[\n31\n]\n:-\nAfter Terracini and I came to Turin, the mathematics section of the Faculty of Sciences reached - at least from a numerical point of view - a level never exceeded. Indeed, we mathematicians, including the geodesist and the astronomer, were then\n7\nout of a total of\n15\n, while today they are not many more out of a total of\n35\n!\nAlso in\n[\n30\n]\nTricomi\nwrites that the Turin mathematician formed two groups:-\n... on the one hand, the 'Jewish' or 'rich men' one, which was headed by the illustrious\nCorrado Segre\n(1863\n-\n1924)\nwho died prematurely the year before, and it was then reduced to\nGino Fano\n(1871\n-\n1952)\nand\nGuido Fubini\n(1879\n-\n1943)\n...; and on the other hand the 'vectorialist' group which, in addition to\nGiuseppe Peano\n(1858\n-\n1932)\n..., included\nTommaso Boggio\n(1877\n-\n1963)\nand the intemperate\nCesare Burali-Forti\n(1861\n-\n1931)\n.\nTerracini and\nTricomi\nboth joined the \"Jewish group\".\nIn September\n1928\nthe International Congress of Mathematicians was held in Bologna. At this Congress, delegates were welcomed by the Podestà of Bologna, Hon L Arpinati, who said:-\nFascist Bologna is proud to welcome you and to be able to show you what it has become under the vivifying impulse of Fascism.\nTerracini was certainly no lover of Fascism but he tried to keep out of politics completely. At the Congress he gave the lecture\nUn nuovo problema di geometria proiettiva differenziale\nⓉ\n(\nA new problem in geometry differential projective\n)\non Thursday\n6\nSeptember. Keeping out of politics became harder though for in August\n1931\nthe oath of loyalty to fascism was imposed on Italian University professors. It includes the words:-\n... I swear to respect the National Fascist Party's Statute and the other laws of the State, and to fulfil my teacher's and all academics' duties with the aim of preparing industrious and righteous citizens, patriotic and devoted to the Fascist regime.\nIn\n1933\nthe rector of the University of Turin put pressure on all academic staff to join the Fascist Party. In his attempt to keep out of politics, Terracini joined the Fascist Party but later regretted it\n[\n28\n]\n:-\nAfter some time I must confess that our, and in particular my, behaviour was not too brilliant, in the sense that we soon followed the pressing invitation; I am ashamed to say it ...\nTerracini only wanted to concentrate on mathematics both teaching it and undertaking high quality research. Indeed he did so, extremely effectively, but life became increasingly difficult. In\n1936\nthe International Congress of Mathematicians was held in Oslo. Norway, however, had sanctioned Italy for invading Ethiopia in October\n1935\nand as a consequence the Italian government refused to allow its academics to travel to the Congress in Oslo. He chose not to attend the first Congress of the\nItalian Mathematical Union\n(\nUMI\n)\nin Florence in\n1937\ndespite being a member since its founding in\n1922\n. This was, almost certainly, because he knew what his colleagues were about to do there\n[\n14\n]\n:-\nThere was opportunistic behaviour in the exaggeratedly celebratory tones of the inaugural speeches ... In their introductory speeches, the rector of the University of Florence, Giorgio Abetti, and the president of the UMI,\nLuigi Berzolari\n, exalted the work of the regime and emphasised the greatness of Mussolini who was the \"omnipresent, wonderful architect of the national renaissance.\" Even\nSeveri\n, in his plenary lecture entitled \"Pure science and applications of science,\" enthusiastically praised Mussolini. In particular, he claimed that mathematicians were ready to collaborate \"for getting the maximum of national autarchy.\"\nKeeping out of politics came to an end for Terracini in\n1938\n. In July of that year the anonymous Manifesto of Racist Scientists was published and, following a speech by Mussolini in Trieste on\n3\nSeptember, the government began passing a series of laws excluding Italian Jews from the schools, the academias, politics, finances, the professional world, and all sectors of public and private life.\nOn\n3\nSeptember Terracini wrote to his brother Benvenuto\n(\nsee\n[\n17\n]\n)\n:-\n... so it happened and much more than that all of us expected. There's nothing to do but take the blow, as philosophically as possible, and think about what it will be necessary to do.\nTerracini was dismissed from his chair of analytical geometry on\n29\nSeptember\n1938\nand he was expelled from the Academy of Sciences of Turin and the\nItalian Mathematical Union\non\n10\nNovember. Being a member of the National Fascist Party and having been decorated for his World War I service should have meant he was not subject to dismissal and he appealed on these grounds; his appeal was angrily and rapidly refused. He began helping with plans to set up Jewish educational institutions for those now banned from state high schools and universities. A number of his friends were very supportive, providing him with material so that he could continue research.\nFrancesco Tricomi\nsuggested that he publish the high school algebra textbook\nAlgebra elementare ad uso dei licei\nⓉ\n(\nElementary Algebra for high school use\n)\n. Because Jews were not allowed to publish,\nTricomi\nsuggested that the book be published under\nTricomi\n's name. The book\n[\n17\n]\n:-\n... constituted Terracini's first foray into the field of mathematics education and represented a unique work in his bibliography. In fact, showing a taste for refined logical-deductive rigour, which one would hardly expect from a geometer belonging to the Italian school of geometry, here he fully developed the modern theory of real numbers according to\nDedekind\n's construction. The fundamental aim to which every author of school texts aspires - claimed Terracini in the preface - is clarity.\nDespite the help from his friends, Terracini felt that he had to look for a position abroad. This was not easy for several reasons. German Jews had been looking for positions in Britain and the United States ever since\n1933\nand, by\n1939\n, a Jew in Germany was in extreme danger of their life while those in Italy were not. Terracini was unsuccessful in his applications for the vacant chairs of mathematics in Aberdeen and Durham in Britain. He contacted\nOswald Veblen\n,\nSolomon Lefschetz\n,\nGeorge Birkhoff\nand\nVirgil Snyder\nabout possible academic positions in the United States, even temporary ones, but although\nVeblen\nand others said they would try their best, they gave Terracini little hope. Broadening his search for possible destinations to South America proved successful. On\n9\nJune\n1939\nhe received a letter from the University of Tucumán in Argentina offering him a chair of mathematics; Terracini rapidly accepted.\nTerracini, with his wife and children, sailed from Italy on\n16\nSeptember\n1939\n, two weeks after Germany invaded Poland, and arrived in Buenos Aires, Argentina, on\n3\nOctober. From there they travelled by train on the\n1300\nkm journey to Tucumán, arriving on\n9\nOctober at their accommodation in Provincia de Salta street in San Miguel de Tucumán. Two days later Terracini delivered his inaugural lecture\n[\n17\n]\n:-\nRevealing a remarkable linguistic ability, he quickly managed to positively integrate into his workplace. His desire to affirm himself within the global scientific positioning of Argentina and a determination to show gratitude to the country that had welcomed him, as well as the moral imperative to \"do one's duty,\" all acted as motivational stimuli. Thrilled with his new surroundings, he resumed publishing and took up research, shrugging off the demotivation that the last months spent in Italy had left him feeling. His production, in quantitative terms, was impressive ...\nLet us note that in Argentina, Terracini was known as Alejandro Terracini. For more information about his time in Argentina, see\nLuís Antoni Santaló\n's obituary of Terracini at\nTHIS LINK\n.\nIn Argentina Terracini had many opportunities to meet leading mathematicians, for example\nG D Birkhoff\nand\nM H Stone\nvisited Tucumán in the autumn of\n1942\n. There was much happiness for Terracini in Tucumán but also a great anxiety about what was happening back in Italy. Only in the summer of\n1944\ndid he manage to contact his relations back in Italy. The end of World War II in Europe in May\n1945\ncertainly made his return possible for the racial laws had by then been repealed. He did feel torn between staying in Argentina, the country which had offered him a haven and to which he felt much affection, or returning to Italy where he could help in its recovery. By the beginning of\n1946\nhe had decided to prepare for returning. He served as president of the\nUnion Matemática Argentina\nduring\n1945\n-\n1947\n, then left Argentina in February\n1948\n.\nBack in Turin, Terracini continued to produce excellent research works and also to put much effort into his teaching. His student Errera Foà wrote\n(\nsee\n[\n13\n]\n)\n:-\nThey were wonderful lessons. ... He had a way of explaining clearly and clearly, and he managed to simplify even those topics that were not so simple in reality, at least for us! ... for this reason, he made extensive use of examples, tables and diagrams, presentations of the same concept from different points of view, intuitive demonstrations\n(\nobviously followed by rigorous ones\n)\n. ... He deeply loved his subject, he had the inestimable gift of knowing how to transmit this love to his students.\nIn\n[\n4\n]\nhis mathematical research contributions are summarised as follows:-\nHis scientific production ranged from geometry to analysis, and from algebra to the history of mathematics. His contributions in the field of projective differential geometry are especially noteworthy, in which he continued the research of\nCorrado Segre\nand\nGuido Fubini\n, but his works on the incidence of the tangent spaces of hyperspatial varieties, on the geometry of differential equations and on the geometric properties \"valid in a certain order of approximation\" are equally valuable.\nBut he also made other important contributions. Before we look at these, however, let us point out how difficult it was for Terracini to fit back into both his work in Turin and his involvement with Italian mathematics on a broader scale. Many of those he now had to work with had supported the Fascists and had taken advantage of the\n1938\nexclusion of Jews from the scientific and academic community, for example\nEnrico Bompiani\nand\nFrancesco Severi\n. Terracini resumed relations with these colleagues without showing any resentment. As to his roles outside teaching and research, an important one was replacing\nTricomi\nas the manager of the Mathematical Library, which at that time acted as a Mathematical Institute. He also took charge of the Mathematical Seminar of the University and Polytechnic of Turin and of its journal\nRendiconti del Seminario Matematico. Università e Politecnico di Torino\nwhich, starting from\n1947\n-\n48\n, began to publish original research papers. He was reinstated as a member of the\nItalian Mathematical Union\n, from which he had been expelled in\n1938\n. He was elected vice-president during\n1952\n-\n58\nand president for the two subsequent three-year terms,\n1958\n-\n1963\n. He wrote in his autobiography\n[\n28\n]\n:-\n... and I think back now to the years spent in management positions of the\nItalian Mathematical Union\n. I certainly have the impression of having spent a lot of time and a lot of effort: however, I do not have the impression of having wasted them, because in the end these are sometimes unpleasant tasks - or even very unpleasant, when it is necessary to induce people or organisations to fork out money, and to convince them that it is not a question of closing a charity but of the need for them to contribute to certain expenses -; however, someone must also take care of them and indeed in an efficient manner. When I left the Presidency of the\nItalian Mathematical Union\n, I certainly breathed a sigh of relief, like that of someone who, after a long interruption, is finally returned to his own work, but I also breathed it with the intimate satisfaction of having given - so I think - my work in the most efficient way that was possible for me.\nTerracini played a role in the setting up of the\nGroupement des mathématiciens d'expression latine\nand was elected as a member of its executive committee. In\n1958\nhe was on the board of directors of the Istituto Nazionale di Alta Matematica, a research institution which had been founded by\nFrancesco Severi\nin\n1939\n. He also served as an Italian delegate to the\nInternational Mathematical Union\n. He was elected as a corresponding member of the\nAccademia dei Lincei\nin\n1948\nand became a full member in\n1960\n.\nIn\n1963\nhe retired from his chairs in Turin and became professor emeritus. He was awarded the Medaglia ai benemeriti della scuola, della cultura e dell'arte by the Ministry of Public Education. A few days before his death at the age of\n78\n, his autobiography\n[\n28\n]\nand the two volumes of\nSelecta\nof his\n180\npublications were published."
}