{
  "nome_completo": "Alexis Bouvard",
  "nome_curto": "Alexis Bouvard",
  "ano_nascimento": "1767",
  "ano_morte": "1843",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bouvard/",
  "lugar_nascimento": "Contamines, Haute-Savoie, France",
  "lugar_morte": "Paris, France",
  "biografia": "Alexis Bouvard\ncame from a poor background, in fact he was born in a hut in the Alpine region south of Lake Geneva. As one might imagine this gave him a difficult start and it is hard to imagine how he managed to end up a respected scholar with a world-wide reputation given this beginning. There were few chances to obtain schooling so he had little education as a boy, growing up to learn the skills of being a shepherd boy in the hills. However in\n1785\n, when aged\n18\n, he went to live in Paris and received mathematics lessons so that he could earn his living as a computer. These days we think of a computer as a machine but at this time a computer was a person who carried out numerical calculations. Although he had little in the way of money to pay for an education, the Collège de France did offer free courses and Bouvard studied there. He became fascinated by astronomy after a visit to the Paris Observatory. He also realised that this was an area where his calculating skills could be particularly useful. He entered the Observatory as a student astronomer in\n1793\nand in\n1795\nwas appointed as an astronomer.\nIn\n1794\nBouvard met\nLaplace\nwho was at that time working on his great masterpiece\nMéchanique céleste\nⓉ\n(\nCelestial Mechanics\n)\n.\nLaplace\nrecognised Bouvard's computing skills and soon had him carrying out the complex calculations required for his theory. Realising Bouvard's potential,\nLaplace\narranged for him to be offered a position in the important Bureau de longitudes in\n1794\n. Bouvard worked there for the rest of his career earning a reputation as a careful observer as well as an able mathematician. He supplied tables for the\nAnnuaire\n(\nthe French equivalent to the\nNautical Almanac\n)\nover the many years he worked there. A completely different aspect of his work was annotating Caussin's translation of the work of the Islamic mathematician\nIbn Yunus\n, known for his astronomical observations and for his many trigonometrical and astronomical tables.\nAs an observer Bouvard's skill is marked by the fact that he discovered eight comets, and his skill as a calculator is seen from his computation of their orbits. The first four comets he observed appeared in\n1797\n,\n1798\n,\n1801\nand\n1805\n. After computing the orbit of one which was visible in\n1818\n, he realised it was the same comet as he had observed\n(\nand computed its orbit\n)\nin\n1805\n. This comet is now known as comet\nEncke\n. His work on lunar theory based on over\n4000\nobservations he had made, was a remarkable achievement and earned him a prize from the Institut de France in\n1800\n. He received other significant honours indicating the high esteem in which he was held by the international community, for example he was elected to the\nAcademy of Sciences\nin\n1803\nand elected a fellow of the\nRoyal Society of London\nin\n1826\n.\nOne of his most significant contributions was his prediction of a planet beyond the orbit of Uranus. His first step in this process was his publication in\n1808\nof\nTables astronomique\nⓉ\n(\nAstronomical tables\n)\n- tables for the orbits of Jupiter and Saturn. When he published this work Uranus had only been studied for seven years from the time of its discovery in\n1801\n. He wanted to include tables for Uranus in a new edition of the\nTables\nhe planned for\n1821\n. By this time eleven records of the position of Uranus during ninety years before its discovery\n(\nof course without realising that the observation was of a planet\n)\nhad been found. Since Uranus had an\n84\n-year period, Bouvard attempted to find further pre-discovery records to improve the calculation of its orbit. Three of the pre-discovery records were due to Pierre Lemonnier, so Bouvard went through\n15\nfolios of his old observations in an attempt to find further sightings. He found nine more records of sightings made between\n1736\nand\n1780\ngiving him a total of\n20\npre-discovery records. He also had at his disposal two fine series of post-discovery observations, one by the Paris observatory, the other by the Greenwich observatory.\nUsing all the data at his disposal, Bouvard produced a system of\n77\nequations but was unable to find a possible orbit for the planet from them. At first he assumed that there were errors in the pre-discovery data and, despite all the efforts he had made to obtain this pre-discovery data, he only used post-discovery data to compute his\nTables\n. However this did not turn out to solve the problem since after a few years the planet was observed to be far from its predicted position. Bouvard believed this was due to another planet perturbing the orbit of Uranus but, although he asked an astronomer at the Paris Observatory to follow up the idea, nothing came of it since unfortunately for Bouvard the astronomer left soon after he made his request. Bouvard himself died before he could follow it up but his ideas formed the foundation of the work by\nAdams\nand\nLe Verrier\n. Their predicted position of a perturbing planet\n(\nlater named Neptune\n)\nin\n1846\nled to its discovery three years after Bouvard's death. After its discovery it was realised that Neptune had accelerated the motion of Uranus up to\n1821\n, then had retarded it after that. In fact if the positions of these two planets in their orbits had been markedly different from what it happened to be, it may have taken much longer for astronomers to realise that Uranus was being perturbed by another planet.\nAlexander ends his biography\n[\n1\n]\nas follows:-\nBrilliant but modest, Bouvard was an indefatigable calculator, and engaged in computation until the eve of his death. It could well be said of him that he ceased calculating only when he ceased living.\nCape Bouvard in Australia was named after him by French sailors when they discovered Western Australia."
}