{
  "nome_completo": "Alexander Durie Russell",
  "nome_curto": "Alexander Durie Russell",
  "ano_nascimento": "1872",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Russell_A_D/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Alexander Durie Russell\n's father was Thomas Russell who was born in Ecclesmachan, West Lothian, a small village between Edinburgh and Linlithgow,  on\n6\nOctober\n1839\nto James Russell and Elizabeth Aitken. Thomas, the youngest of his parents' five children, became a grocer. He married Janet Durie in Edinburgh on\n23\nAugust\n1869\n. Janet was born in Midcalder in\n1837\nto parents Alexander Durie, a dairyman, and his wife Janet. Thomas and Janet Russell settled in Edinburgh after their wedding and in\n1871\nwere living at\n5\nSalisbury Street, Edinburgh. Their first child James Russell was born in Newington, Edinburgh on\n24\nJune\n1870\n. He appears on the\n1871\ncensus but since we can find no further trace of him, it seems likely that he died as a child.\nAlexander Durie Russell, the subject of this biography, was born in Newington, Edinburgh in July\n1872\n.\nAt the time of the\n1881\ncensus, the Russell family are living at\n56\nClerk Street, Edinburgh. Alexander is a school pupil, his father Thomas is a grocer, but the family also have two lodgers, James Miller, a law apprentice, and David Murray Maxwell, a Law Clerk. By\n1891\nthe family are living at\n19\nGraham Street, Edinburgh. Alexander is a university student, his father is a retired grocer, and now they have two boarders, William Asmit, a retired confectioner, and Peter White, a school pupil, as well as the lodger David Murray Maxwell, now a cashier in a Law Office, and Jeanie R Gordon, a visitor.\nLet us go back a little and to look at Alexander Durie Russell's secondary schooling. He attended the famous George Heriot's School in Edinburgh where he was taught mathematics by\nJohn Brown Clark\n. He passed the Preliminary Examinations of the Scottish Educational Department in English, Mathematics, Latin, Dynamics, French, and German in June\n1889\nand June\n1890\n. He first matriculated at the University of Edinburgh in October\n1890\n.\nRussell then studied Chemistry with Alexander Crum Brown, Mathematics with\nGeorge Chrystal\n, Natural Philosophy with\nPeter Guthrie Tait\n, Botany with Isaac Bayley Balfour, and Natural History with James Cossar Ewart. He graduated with a B.Sc. from the University of Edinburgh in\n1896\n. He was awarded the Neil Arnott Scholarship in Experimental Physics\n[\n2\n]\n:-\n... Russell was educated at Edinburgh University, where he had a distinguished academic career. As an outstanding student he was selected to serve for a period at the Ben Nevis Observatory\n(\nnow disused\n)\nas a mathematician.\nLet us look briefly at the Ben Nevis Observatory. Ben Nevis is the highest mountain in the British Isles, with a height of\n1343\nm. The prevailing winds come across the Atlantic and strike the mountain so, in the\n19\nth century, it was an ideal place to have a meteorological observatory, particularly since there was a flat plateau at the top where the Observatory could to sited. First proposed in\n1877\n, funded mostly by private donations, it was built and opened in October\n1883\n. Conditions, particularly in winter, were very difficult for those working there with intense cold, deep snow and very strong winds. The staff took readings of observations. It is worth noting that the physicist and meteorologist, Charles Thomson Rees Wilson, worked at the Observatory around the time that Russell worked there. Wilson's observations at the Observatory led him to invent a cloud chamber to detect ionising radiation which, in\n1927\n, earned him the Nobel Prize.\nAfter working for a year as a Demonstrator in Physics at the University of Edinburgh, Russell was appointed to Morelands School, Edinburgh, where he taught mathematics for one year. He then became a Mathematics Master at Stranraer High School, Wigtownshire, teaching there for two years. In\n1899\nhe became a Mathematics Master at Falkirk High School, Stirlingshire. This was quite a new school when Russell was appointed there, for it had been founded in\n1886\n. Later, he was promoted to Head of Mathematics at Falkirk High School. He remained there for the rest of his career, retiring in\n1937\n. He received considerable praise or his teaching\n[\n2\n]\n:-\nRussell was a born mathematician, and had a gift for imparting his enthusiasm for mathematical studies to his pupils, many of whom benefited considerably from contact with his first-rate mathematical mind.\nA similar assessment appears in\n[\n1\n]\n:-\nIn Falkirk, he rendered signal service to the High School and also to the Science and Art School, where he conducted continuation classes. He proved himself to be an inspiring and successful teacher, and his contribution to the general good of the Falkirk district would be hard to overestimate.\nThe Falkirk Science and Art School was slightly older than the High School, being officially opened in September\n1878\n. Falkirk played a big part in the Industrial Revolution in Scotland and was a major centre for iron casting. The Science and Art School was intended to train workers in the iron industry giving them both technical and artistic skills. In\n1889\n, however, it merged with the High School but continued classes for iron workers. Russell taught both school children and iron workers.\nAlthough Russell was teaching in Falkirk from\n1899\n, at the\n1901\ncensus he was living with his parents at\n3\nBernard Terrace in Edinburgh. David Murray Maxwell was still a lodger and Russell's father, Thomas, is now listed as a fish merchant. In fact at the time of the\n1911\ncensus he is still living with his father in Edinburgh, but by that time his mother had died. On\n12\nApril\n1930\n, Russell married  Margaret Wilson Swan Fisher in Blythswood, Glasgow. Margaret\n(1898\n-\n1958)\n, the daughter of James Fisher and Isabella Swan, was living at\n3\nMelville Street, Falkirk in\n1901\nand was brought up in Falkirk. She was the first of her parents two children, having a brother James born around\n1905\n. In fact Russell was almost exactly the same age as Margaret's father James Fisher. Alexander and Margaret Russell were living at\n14\nHeugh Street, Falkirk in\n1938\n, the house where Russell was living before his marriage since he gives this address in the list of\nEdinburgh Mathematical Society\nmembers of\n1927\n. Rather strangely, they were living next door at\n12\nHeugh Street, Falkirk in\n1941\n. By\n1951\nthey were living at\n3\nWoodlands Crescent, Falkirk.\nRussell was proposed for election as a Fellow of the\nRoyal Society of Edinburgh\non\n12\nDecember\n1905\nby\nWilliam Peddie\n,\nJohn Brown Clark\n, Robert Traill Omond, and\nCargill Gilston Knott\n. He was elected to the Society on\n18\nDecember\n1905\n. He had been elected a Fellow of the\nRoyal Astronomical Society\non\n13\nJanuary\n1905\n.\nAt the meeting of the\nEdinburgh Mathematical Society\nin February\n1897\nhe became a member of the Society. He served on the Committee during\n1906\n-\n09\n, was honorary treasurer during\n1909\n-\n1915\n, and was then honoured with election as President for session\n1915\n-\n16\n. He also contributed to the scientific work of the Society, for example he read the paper\nA special case of the dissection of any two triangles into mutually similar pairs of triangles\nto the meeting of the Society on Friday\n8\nDecember\n1899\n. The paper was published in the\nProceedings\nof the Society in\n1900\n. We now list some of Russell's papers, with some extracts from Abstracts where appropriate.\nAlexander Durie Russell, A special case of the dissection of any two triangles into mutually similar pairs of triangles,\nProceedings of the Edinburgh Mathematical Society\n18\n(1900)\n,\n28\n-\n29\n.\nThis note is intended to be supplementary to the paper, by Mr\nMuirhead\n, on \"The dissection of any two triangles into mutually similar pairs of triangles.\" The constructions given there, for the general case of this problem, yield no real solution if one angle of one triangle be greater than the sum of any two angles of the other triangle. For this particular case, the following constructions supply the necessary requirements; the first leads to a division of the triangles into three parts, the second to a division into four parts.\nAlexander Durie Russell, Geometrical Proofs of the Trigonometrical Ratios of\n2\nÏ\n2\\pi\n2\nÏ\nand\n3\nÏ\n3\\pi\n3\nÏ\n,\nProceedings of the Edinburgh Mathematical Society\n38\n(1919)\n,\n56\n-\n57\n.\nAlexander Durie Russell, Geometrical proof of\ntan\nâ¡\nB\nâ\nC\n2\ntan\nâ¡\nB\n+\nC\n2\n=\nb\nâ\nc\nb\n+\nc\n\\Large \\frac {\\tan \\large \\frac{B-C} 2}{\\tan \\large\\frac{B+C} 2}\\normalsize =\\Large\\frac{b-c}{b+c}\nt\na\nn\n2\nB\n+\nC\nâ\nt\na\nn\n2\nB\nâ\nC\nâ\nâ\n=\nb\n+\nc\nb\nâ\nc\nâ\n,\nProceedings of the Edinburgh Mathematical Society\n38\n(1919)\n,\n58\n.\nAlexander Durie Russell, Trigonometrical Ratios of\n(\nA\nÂ±\nB\n)\n(AÂ±B)\n(\nA\nÂ±\nB\n)\n,\nProceedings of the Edinburgh Mathematical Society\n40\n(1921)\n,\n60\n-\n61\n.\nAlexander Durie Russell, Theorem regarding a regular polygon and a circle cutting its sides, with corollary and application to trigonometry,\nEdinburgh Mathematical Notes\n22\n(1924)\n,\n7\n-\n10\n.\nTheorem.\nIf a circle cut all the sides\n(\nproduced if necessary\n)\nof a regular polygon, the algebraic sum of the intercepts, on the sides, between the vertices and the circle is zero.\nAlexander Durie Russell, Geometrical proof of\ntan\nâ¡\nB\nâ\nC\n2\n=\nb\nâ\nc\nb\n+\nc\ncot\nâ¡\nA\n2\n\\tan \\large\\frac{B-C} 2 \\normalsize =\\Large\\frac{b-c}{b+c}\\normalsize  \\cot \\large \\frac A 2\ntan\n2\nB\nâ\nC\nâ\n=\nb\n+\nc\nb\nâ\nc\nâ\ncot\n2\nA\nâ\n,\nEdinburgh Mathematical Notes\n35\n(1945)\n,\n9\n.\nAlexander Durie Russell, A note on equilateral polygons,\nEdinburgh Mathematical Notes\n37\n(1949)\n,\n23\n-\n24\n.\nTheorem.\nIf a circle cut all the sides\n(\nproduced if necessary\n)\nof an equilateral polygon, the algebraic sum of the intercepts between the vertices and the circle is zero;Â i.e., if any sideÂ\nA\nB\nAB\nA\nB\nÂ of the polygon be cut by the circle inÂ\nP\nP\nP\nÂ andÂ\nQ\nQ\nQ\n, then\nâ\n(\nA\nP\n+\nB\nQ\n)\n=\n0\n\\sum  (AP + BQ) = 0\nâ\n(\nA\nP\n+\nB\nQ\n)\n=\n0\n, the intercepts being signed by fixing a positive direction round the contour of the polygon.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nIn this obituary Russell is described as being\n[\n1\n]\n:-\n... a keen churchman and was an elder of St Modan's Church, Falkirk. He was highly respected in the community for his personal character, ability and devotion to duty, and he will be greatly missed.\nSt Modan's Church, Falkirk has an interesting history through the time that Russell taught in Falkirk. About\n100\nmembers of the congregation of the Evangelical Union Church in Meek's Road, Falkirk, split away in\n1896\nand, in the following year, bought the old Evangelical Union building on Bank Street. They named it St Modan's in honour of the sixth century saint. They then proceeded to build a new church which was dedicated in\n1915\n.\nRussell retired in\n1937\nfrom his position of Head of Mathematics at Falkirk High School but continued his interest in mathematics publishing the occasional paper. He continued living in Falkirk at\n3\nWoodlands Crescent until a serious illness meant that he had to be transferred to a nursing home in Kelvingrove, Glasgow where he died in\n1955\n[\n2\n]\n:-\nIt was with deep regret that his many friends in Falkirk learned of the death, which took place in a Glasgow nursing home on\n20\nJanuary\n1955\n, after a painful illness ... Mr Russell is survived by his widow, to whom much sympathy is expressed in her bereavement."
}