{
  "nome_completo": "Alexis Fontaine des Bertins",
  "nome_curto": "Alexis Fontaine",
  "ano_nascimento": "1704",
  "ano_morte": "1771",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fontaine_des_Bertins/",
  "lugar_nascimento": "Claveyson, Drôme, France",
  "lugar_morte": "Cuiseaux, Saône-et-Loire, France",
  "biografia": "Alexis Fontaine\n's father was Jacques Fontaine and his mother was Madeleine Seytres. Jacques Fontaine was a royal notary, so he served the king in a legal capacity. Alexis enjoyed an upbringing in a fairly well off family and he was educated at the Collège de Tournon.\nIn\n1732\nFontaine went to live near Paris, where he had acquired a residence, and he began to study mathematics under\nCastel\n. Around this time he became friends with\nClairaut\nand\nMaupertuis\n, and he began to submit memoirs to the\nAcadémie des Sciences\n. As a result of these papers Fontaine was elected to the Academy in\n1733\nas an adjoint mécanicien and he was promoted geometer\n(\na term used to mean mathematician at this time\n)\nin\n1739\n. Although associated with the Academy for the rest of his life he did not participate in the work of the Academy, rather preferring to pursue his own agenda.\nHe led a solitary life showing little interest in the work of others. His papers are rather confused, and ignorant of the work of others, but do contain some very original ideas in the\ncalculus of variations\n,\ndifferential equations\nand the theory of equations. Taton writes in\n[\n1\n]\n:-\nFontaine's work is of limited scope, often obscure, and willfully ignorant of the contributions of other mathematicians. Nevertheless, its inspiration is often original and it presents, amid confused developments, a number of ideas that proved fertile ...\nIn\n1732\nFontaine gave a solution to the\nbrachistochrone\nproblem, in\n1734\nhe gave a solution of the\ntautochrone\nproblem which was more general than that given by\nHuygens\n,\nNewton\n,\nEuler\nor\nJacob Bernoulli\n, and in\n1737\nhe gave a solution to an orthogonal trajectories problem. The methods which he developed to solve these problems led to the calculus of variations. He used what he called the \"fluxio-differential\" method, so called because it used two independent first-order\nLeibniz\ntype differential operators. This technique was praised by\nJohann Bernoulli\n,\nEuler\nand\nd'Alembert\n. Fontaine then used differential coefficients instead of differentials and Greenberg in\n[\n5\n]\nshows how Fontaine progressed from a calculus of variations to a calculus of several variables.\nHowever Fontaine rather spoilt this fine contribution by, in\n1767\nand\n1768\n, unjustly criticising\nLagrange\n's method of variation presented in\n1762\n. Fontaine had retired in\n1765\nto a country estate in Burgundy the purchase of which had stretched his finances to the point of almost leaving him bankrupt.\nIn\n[\n3\n]\nGreenberg considers Fontaine's work and that of his contemporaries who are usually given credit for laying the foundations for the calculus of several variables. Greenberg discusses the question of priority in\n[\n3\n]\nand also in\n[\n4\n]\n. One of the reasons that Fontaine has come off badly was his apparent attempts to gain credit for ideas which had first been presented by others. For example\n[\n1\n]\n:-\nIn his work of\n1764\nFontaine included a study of dynamics dated\n1739\nand based on a principle closely analogous to the one that\nd'Alembert\nhad made the foundation of his treatise of\n1743\n. Although Fontaine did not raise any claim of priority, he attracted the hostility of a powerful rival who subsequently took pains to destroy the reputation of his work, which - without being of the first rank - still merits mention for its original inspiration and for certain fecund ideas that it contains."
}