{
  "nome_completo": "Alexis Thérèse Petit",
  "nome_curto": "Alexis Petit",
  "ano_nascimento": "1791",
  "ano_morte": "1820",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Petit/",
  "lugar_nascimento": "Vesoul, Haute-Saône, France",
  "lugar_morte": "Paris, France",
  "biografia": "Alexis Petit\n's parents were Jean Jacques Petit and Anne Gérard. Alexis was a child prodigy. He attended the École Centrale in Besançon where he amazed everyone with the quality of his work, particularly in languages and mathematics. By the age of ten and a half Petit had achieved the entry standard to become a student at the École Polytechnique but the entrance requirements insisted that students could not enter until they were sixteen years old. He therefore had to wait for around five years before he could enter, which of course he did at the earliest possible date being ranked first among all the entering students.\nPetit did not sit and do nothing for these five years but rather continued his education at the École des Sciences et Belles-lettres. This preparatory École had been founded in\n1802\nby the classicist and philosopher Jean-François Thurot\n(1768\n-\n1832)\ntogether with\nSylvestre François Lacroix\n,\nSiméon Denis Poisson\n,\nJean Nicolas Pierre Hachette\nand other professors from the École Polytechnique. Thurot was director of the École des Sciences et Belles-lettres. Of the other teachers we mentioned above,\nPoisson\nhad been named a deputy professor at the École Polytechnique in\n1802\n,\nLacroix\nhad been appointed to the chair of analysis at the École Polytechnique in\n1799\nand\nHachette\nhad become a full professor there in the same year. It was\nHachette\nwho had a reputation as someone who went out of his way to help the best students take on advanced projects and indeed he was the person who did most for Petit at the École des Sciences et Belles-lettres.\nEntering the École Polytechnique in\n1807\n, having been ranked first in the entrance examinations, he was in the same class as\nJean-Victor Poncelet\nwho was nearly three years older than Petit. In\n1809\nPetit graduated from the École Polytechnique and his performance had been so remarkable that, being totally in a class of his own, he was ranked \"hors de ligne\" and the student who was the second best was actually ranked \"first\".\n[\nPoncelet\ntook an extra year through illness so did not graduate at the same time as Petit.\n]\nAfter graduating Petit immediately joined the teaching staff as an assistant lecturer in analysis, a position he held for one year before becoming an assistant in physics. He was awarded a doctorate in\n1811\nfor an outstanding thesis on capillary action. In fact he submitted two theses, the first being a thesis on mechanics entitled\nThéorie mathématique de l'action capillaire\nⓉ\n(\nMathematical theory of capillary action\n)\nsubmitted to the Faculty of Science on\n30\nNovember\n1811\n. The thesis begins:-\nAll bodies are composed of material molecules that attract one another. This attractive force is the cause of chemical affinities. The modifications which it experiences due to the form of the molecules, and by the expansive caloric force, produce the various states of aggregation under which the bodies present themselves. The refraction and elevation or depression of the liquids in the capillary spaces immediately result, with this difference however, that the refraction is produced by the total attraction of the molecules of the refracting body, while the capillary phenomena are, as we shall see later, the result of the same cause modified by the curvature of the surfaces.\nHe ends his thesis with the following paragraph:-\nThe principles which we have explained suffice to subject to calculation the different phenomena which depend on molecular attraction. The work in which M\nLaplace\nhas deduced from a rigorous analysis the explanation and the laws of these phenomena, contains, moreover, the solution of several important questions, which depend, by their nature, on the general cause of the capillary effects. The remarkable conformity of the results of observation, and of those to which calculation leads, assures us in an incontestable manner as to the legitimacy of the hypothesis which forms the basis of this theory.\nThe second minor thesis that Petit submitted was the Programme for the Astronomy thesis, entitled\nLa théorie des réfractions astronomiques\nⓉ\n(\nThe Theory of astronomical refraction\n)\n, which he submitted on\n18\nDecember\n1811\n. To see Petit's programme, see\nTHIS LINK\n.\nHowever, by the time Petit submitted his theses, he was already teaching physics at the Lycée Bonaparte where he had been appointed in\n1810\n. In fact on his thesis he writes \"M. PETIT, Professeur de Physique au Lycée Bonaparte, Répétiteur à l'École Polytechnique.\" Robert Fox writes\n[\n1\n]\n:-\nAs a teacher he was both popular and successful, and when he succeeded to J-H Hassenfratz's chair of physics at the École Polytechnique in\n1815\n, after a year as assistant professor, he extended and improved the courses in his subject.\nPetit married Adélaïde Françoise Louise Carrier\n(\nborn\n25\nJune\n1790)\non\n4\nNovember\n1814\n. Most biographies say this meant he was related to\nFrançois Arago\nso let us now explain exactly what was that relationship. Adélaïde Carrier's parents were François Bernard Carrier, an engineer at the Ponts-et-Chaussées, and Lucie Françoise Besombes. François and Lucie had been married in Rivesaltes, southern France, on\n16\nJanuary\n1788\nand they had a second daughter, who, taking both parents' names in a non-standard order, was named Lucie Carrier Besombes\n(\nborn in Bar-sur-Aube in\n1788)\n. She had married\nFrançois Arago\nthree years before Petit was married. Let us note that Pierre Louis Dulong, who plays a large role in the work we describe below, was a witness at Petit's wedding.\nPetit and\nArago\ncollaborated on experiments on the refraction of light in gases. In particular, they examined the effect of temperature on the refractive index of gases. Petit had been taught physics at the École Polytechnique of the conventional nature of his time. This means he had been taught that light is composed of corpuscles, so it is not surprising that in\n1814\n-\n15\n, when he himself was teaching physics at the École, he was presenting the same views to his students as those he had been taught. His work with\nArago\nin\n1815\n, however, made him take a different view on the nature of light and in December of that year he stated his position as a believer in the wave theory of light.\nPetit worked with Pierre Louis Dulong from\n1815\nwith the aim of submitting an entry for the\n1818\nGrand Prix of the\nAcademy of Sciences\nwhich had been set on the topic of thermometry and the laws of cooling\n[\n3\n]\n:-\nThe competition in question was announced by the First Class of the French Institute\n[\nthe name the Academy of Sciences had at this time\n]\non\n9\nJanuary\n1815\n. Competitors were asked to measure the expansion of mercury in a thermometer between\n0\n°C and\n200\n°C and then to determine the rate at which a body cooled both in a vacuum and in certain specified gases\n(\nair, hydrogen and carbon dioxide\n)\nat different temperatures and pressures.\nIt is unclear how Petit and Dulong became friends but clearly they were close before the announcement of the prize since Dulong was Petit's witness at his wedding in\n1814\n. The most likely way the two became friends is through their mutual friendship with\nArago\n. They presented their jointly authored paper\nRecherches sur les lois de dilatation des solides, des liquides et des fluides elastiques, et sur la mesure exacte des températures\nⓉ\n(\nResearch on the laws of dilatation of solids, liquids and elastic fluids, and on the exact measurement of temperatures\n)\nto the Institute on\n29\nMay\n1815\nand from its contents it is clear that by this time they were already working on the Grand Prix. However, they did not continue with the experiments proposed in this paper and in\n1816\nthey published it in its original form, clearly at this stage having given up their aim of entering the competition for the Grand Prix. The judges for the competition declared they had not received entries of sufficient merit and so the same topic was proposed for the Grand Prix for the following year.\nIn\n1818\nPetit and Dulong won the\nAcademy\nPrize for their work on the law of cooling but at this stage they had not yet discovered the Dulong-Petit law for which they are best known. Their prize essay reported on their\n[\n1\n]\n:-\n... classic experimental investigation, which established the gas thermometer as the only reliable standard and put the approximate nature of\nNewton\n's law of cooling beyond all doubt.\nThe following year, in April\n1819\n, they published the Dulong-Petit law on the theory of heat. The two scientists formulated an empirical law concerning the specific heat of elements which states that the specific heat of all elements is the same on a per atom basis. The law has exceptions and was not fully understood until\nquantum theory\nwas used. However, it gave chemists, who at that time were having difficulty determining atomic weights and distinguishing them from equivalent weights, a means of estimating the approximate weight of an element merely by measuring its specific heat. Robert Fox writes\n[\n3\n]\n:-\n... the paper of\n1819\ncontained far more than the announcement of a now familiar law and ... the attacks on established opinion which it delivered were seen as being no less important, both by Dulong and Petit themselves and by their contemporaries. The attacks were directed on two major fronts - the nature of heat and the atomic theory.\nIn\n1818\nPetit also published on the general principles of machine theory. This work, in addition to his exceptional doctoral thesis, showed that he was at least as great a mathematician as he was experimental physicist. Sadly, however, Petit did not live to make further scientific discoveries\n[\n1\n]\n:-\nHis last years ... were clouded by grief and illness; shortly after the death of his young wife, in\n1817\n, he contracted tuberculosis, the disease from which he died.\nShortly after his death\n[\n5\n]\nwas written which states that after his marriage:-\n... everything seemed to promise him henceforth in the interior of his house this sweet life, agreeable to the scholar occupied with profound studies, when sixteen months after his marriage, death robbed him of his wife. Struck by the mortal blow from that moment on, he was now only languishing, his mind fell into complete inactivity, and his organs, already fatigued by premature labour, could not bear the burden of pain; a chest disease consumed him for two years. Neither the care of his father of whom he was the honour and glory, nor the consolations of friendship, could save him from dying; he died on\n21\nJune\n1820\n.\nIn\n[\n5\n]\nthere is also a description of Petit's funeral and gravestone:-\nThe professors, administrators, and pupils of the École Polytechnique made it their duty to accompany his funeral. The most distinguished men in science, among whom we noticed M de Humboldt, came to associate their grief with that which formed the most remarkable pageantry of that sad ceremony. Messrs.\nAmpère\nand Gay-Lussac, in delivering his éloge, praised not only his learning; but an excellent heart, a noble character, a sure friend, and the sweetest businessman. The pupils of the École Polytechnique, anxious to give a testimony to their gratitude to their professor and their just regrets, had caused an ancient stone marker to be erected on his tomb, in which is embedded a bronze mortuary plaque. Here is the dedication:\n\"The students of the École Polytechnique\n                     to Petit,\n        Their professor of physics.\"\nThe small column of stone placed close-by to the left indicates the remains of his beloved wife, whose loss brought him into the grave. It displays this epitaph:\n\"Adélaïde Françoise Louise Carrier, wife of M A T Petit, born\n25\nJune\n1790\n, married\n3\nNovember\n1814\n, died on the\n5\nApril\n1817\n.\"\nWe note that, despite this epitaph claiming that Petit was married on\n3\nNovember\n1814\n, the marriage certificate\n(\nwhich is surely correct\n)\ngives the date as\n4\nNovember\n1814\n.\nDespite his short life\n(\nhe was only\n28\nyears old when he died\n)\nhe had already been honoured with election to the Societé Philomatique in February\n1818\n. He died too young to have made it to the\nAcademy of Sciences\nbut there is little doubt that his election would have come soon given the exceptional quality of his work."
}