{
  "nome_completo": "Alexander Obiefoka Enukora Animalu",
  "nome_curto": "Alexander Animalu",
  "ano_nascimento": "1938",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Animalu/",
  "lugar_nascimento": "Oba, Idemili South Local Government Area of Anambra State, Nigeria",
  "lugar_morte": null,
  "biografia": "Alexander Animalu\n's parents were Michael Animalu Nwakudu and Josephine Nkenwa. It was a large family with Alexander being his parents' fifth child. His primary school education was at St Paul's Church Mission Society Church School, Isu-Oba\n(1943\n-\n44)\n, St. Thomas's Church Mission Society Church School, Okuzu\n(1944\n-\n45)\n, and the Church Mission Society Central School, Isu-Oba\n(1945\n-\n51)\n. All these primary schools were run by the Church Mission Society which had been founded in\n1799\nin the City of London, England. One of the founders was William Wilberforce who, like all the founders, was passionately committed to the abolition of the slave trade. Another founder was John Venn, the grandfather of the mathematician\nJohn Venn\n. The Society's mission work spread through Africa, Asia and the Middle East.\nAfter attending these three Church Mission Society primary schools, Alexander progressed to secondary education and attended Dennis Memorial Grammar School\n(1952\n-\n58)\n. This school, also founded and run by the Church Mission Society was founded in\n1925\n, nearly\n70\nyears after the Society began its mission in the area. This long delay was due to the Society believing for a long time that its role was the propagation of Christianity for which secondary education was not necessary. During the period that Animalu attended the Memorial Grammar School, its principals were Rev P J Ross\n(1952\n-\n54)\nand S J Cookey\n(1954\n-\n59)\n. The school had been improving over many years and this period saw the introduction of courses leading to pupils gaining Higher School Certificate qualifications in science subjects. It is also worth noting that there was great emphasis on cleanliness and orderliness with regular weekly inspections of dormitories with pupils awarded marks depending on how tidy there area was. Each pupil also had to look after a patch of the gardens and again marks were awarded during the weekly inspection.\nAnimalu earned Grade\n1\nin the West African School Certificate in\n1956\nand, specialising in science subjects, a Cambridge Higher School Certificate in\n1958\n. He was awarded the London Advanced Level Certificate\n(\nin Arts subjects\n)\nin January\n1959\n. Later in the same year he entered University College, Ibadan, having been awarded a Shell-BP Scholarship. The University of Ibadan was established in\n1948\nas a College of the University of London, England; it was the first university to be established in Nigeria. It became an independent university in\n1962\nafter the country gained its independence from Britain. At the university he was taught by\nChike Obi\nand\nJames Ezeilo\n, two of the three first Nigerian professors of mathematics. He graduated with B.Sc.\n(2(\ni\n)\nHonours in Mathematics\n)\n, won the Faculty of Science Prize for the best performance for two consecutive years\n(1961\nand\n1962)\nand also the Crowe's Prize for Abstract Algebra and the Theory of Numbers\n(1962)\n. We note that Animalu graduated from the University of Ibadan in the year it became an independent university so he was one of the last students at the University to be awarded a University of London degree. He was awarded a University of Ibadan Postgraduate Scholarship which funded his studies at the University of Cambridge, England.\nMatriculating at the University of Cambridge in October\n1962\nhe studied first for a B.A. which he was awarded in\n1963\nand then continued his studies for his doctorate in Theoretical Solid State Physics. His advisor at Cambridge was Volker Heine, a theoretical physicist born in\n1930\nin Hamburg, Germany. Heine was educated in New Zealand and then came to the University of Cambridge where he had been awarded a Ph.D. in\n1956\n. When he was Animalu's advisor he was a member of a Theory Group at the Cavendish Laboratory and Animalu also became a memebr of the Cavendish Laboratory.\nThe quality and speed with which Animalu produced research was truly remarkable. He only completed his B.A. in\n1963\nand in September\n1964\nhe submitted his paper\nNon-local dielectric screening in metals\nto the\nPhilosophical Magazine.\nIt was published in\n1965\nand has proved highly influential with\n177\ncitations. The Abstract of the paper reads as follows:-\nThe potential seen by an electron in a metal is frequently set up by starting the pseudo-potential or model potential of the bare ion, and dividing by a dielectric constant to take account of the screening of the conduction electrons. Such a procedure assumes that the pseudo-potential is a 'local' potential. But in reality the pseudo-potential is a non-local operator, and the theory is extended in the present paper to take this correctly into account. Numerical calculations have been made with the model potential of Heine and Abarenkov\n(1964)\n. The results are in somewhat better agreement with experiments than those of the local screening approximation, but the difference between them is not as large as might have been expected.\nIn July\n1965\nAnimalu and his thesis advisor Volker Heine submitted a joint paper,\nThe screened model potential for\n25\nelements\nto the\nPhilosophical Magazine\n. It was published in\n1965\nand has proved so influential as to be rated as one of the most cited papers published by Cambridge scientists with\n742\ncitations. The Abstract of the paper reads as follows:-\nThe\nFourier\ntransform of the self-consistent screened model potential has been calculated for\n25\nelements. The results are presented in a form applicable to the potential in the solid or liquid metal or semiconductor, or to the electron-phonon interaction. They are reliable to about\n0\n.\n01\nryd. The calculations are a continuation of the work by Heine and Abarenkov\n(1964)\n, using the screening theory of Animalu\n(\nNon-local dielectric screening in metals\n)\n. The behaviour at high wave numbers and other points of detail are discussed much more thoroughly than before. Some average band effective masses are also calculated.\nAnimalu continued with this work with his single-authored paper\nThe total electronic band structure energy for\n29\nelements\nbeing published by the\nRoyal Society of London\nin\n1966\n.\nHe was awarded a Ph.D. in\n1965\nfor his thesis\nModel Potential in Solids\n, which contained the screening theory published in his single-authored\n1965\npaper and used to great effect in his joint paper\n1965\nwith Volker Heine and also in his\n1966\npaper. While still at the Cavendish Laboratory in Cambridge, he had been given leave of absence to visit Bologna in Italy where he worked with F Bonsignori and V Bortolani and wrote two joint papers with them\n(\nsee below\n)\n. After this he spent several years in the United States; from January\n1966\nto December\n1967\nas a Research Associate in the Division of Applied Physics at the W W Hansen Laboratories of Stanford University; from January\n1968\nto August\n1968\nat the Department of Physics of the University of North Carolina at Chapel Hill where he was a visiting scientist; from September\n1968\nto\n1970\nas an Assistant Professor of Physics at the University of Missouri at Rolla, Missouri; from\n1970\nto April\n1972\nas an Associate Professor of Physics at Drexel University in Philadelphia, Pennsylvania; and from April\n1972\nto\n1976\nas a Research Physicist at the Lincoln Laboratory of the Massachusetts Institute of Technology.\nDuring these years Animalu published many significant papers, almost all of which are single author papers. We list most of these in the following list:\nThe spin-orbit interaction in metals and semiconductors\n(1966)\n;\n(\nwith F Bonsignori and V Bortolani\n)\nElectron-phonon contribution to the specific heat of alkalines\n(1966)\n;\n(\nwith F Bonsignori and V Bortolani\n)\nThe phonon spectra of alkali metals and aluminium\n(1966)\n;\nOptical conductivity of simple metals\n(1967)\n;\nSelf-consistent theory of optical transitions in simple metals\n(1967)\n;\nThe pressure dependence of the electrical resistivity thermopower and phonon dispersion in liquid mercury\n(1967)\n;\n(\nwith B Vasvari and V Heine\n)\nElectronic structure of Ca, Sr, and Ba under pressure\n(1967)\n[\nNote: Vasvari was a Hungarian who worked at Cambridge, England, while in receipt of a scholarship. Animalu writes, \"This work was completed, supported in part by the Advanced Research Projects Agency through the Center for Materials Research, Stanford University, Stanford, California\n]\n;\nMany-electron effects in the optical conductivity of simple metals by Kubo formula\n(1970)\n;\nGeneral theory of magnetic-field-induced surface states\n(1970)\n;\nMass ratio of quarks\n(1971)\n;\nCharge spectrum of four-component fields with O\n(4\n,\n2)\nsymmetry\n(1971)\n;\nBound states and mass spectra of hadrons in the quark model\n(1971)\n;\nScale symmetry\n(1972)\n;\nLepton and hadron currents in O\n(4\n,\n2)\ncurrent algebra\n(1972)\n;\nHigh-field magnetoresistance of metals by Kubo-Mott formula\n(1972)\n;\nPseudopotential approach to magnetic energy bandstructure and magnetic breakdown in metals\n(1972)\n;\nJosephson current in tunneling between coupled superconductors\n(1973)\n;\nA relativistic model of quark-quark strong interactions\n(1973)\n;\nElectronic structure of transition metals. I. Quantum defects and model potential\n(1973)\n;\nElectronic structure of transition metals. II. Phonon spectra\n(1973)\n;\nElectronic structure of transition metals. III. d-band resonance and Regge-pole theory\n(1974)\n; and\nLattice dynamics of transition metals in the resonance model\n(1976)\n.\nIn\n1977\nAnimalu published the book\nIntermediate Quantum Theory of Crystalline Solids\n. It was reviewed by Timothy Sluckin\n[\n4\n]\n:-\nThere are many textbooks of solid state physics, and some good ones have not had a just reward. Animalu has written a good book, and it would be unfortunate if it were to suffer this fate. As the title indicates, it represents an intermediate approach ... In an attempt to be both self-contained and complete, however, the author is sometimes unsure of the level of his readership. ... Animalu sensibly emphasizes the magnitudes of physical quantities involved in his exposition, and he gives useful tables of physical quantities for particular substances. ... The historical introductions to each chapter do much to make the subject come alive. ... for those who want a comprehensive knowledge of workaday solid state physics, I recommend it highly.\nThe work certainly did not suffer the unfortunate fate that Sluckin refers to in this review since an Indian edition was published in\n1978\n, it was translated into Russian in\n1981\n, reprinted in the United States in\n1994\nand is still readily available.\nIn\n1976\nhe left the United States and returned to Nigeria when he was appointed as Professor of Theoretical Solid State Physics at the University of Nigeria, Nsukka, in\n1976\n. He was awarded a University of Nigeria Senate Research Grant Award for the Energy and Materials Science Laboratory Project\n1976\n-\n1977\n. Let us give details of his career from that point on by giving a slightly modified version of\n[\n2\n]\n:-\nProfessor Animalu rose in academic positions becoming Head of Department of Physics, University of Nigeria, Nsukka, in\n1981\nand\n1994\n, and Dean of the Faculty of the Physical Sciences, University of Nigeria, Nsukka in\n1987\n-\n88\n. Professor Animalu was the\n1990\nAhiajoku lecturer, the highest Igbo academic forum. His theory of high-temperature superconductivity based on the novelty of the pairing mechanism for electrons was published in the 'Hadronic Journal' in\n1991\n.\nHe has trained many Nigerians in the field of theoretical physics and solar energy and established two youth organizations, the Society for Promotion of Indigenous Inventions and Creativity and the Century-\n21\nClub. Professor Animalu was appointed Director and Chief Executive of the National Mathematical Centre, Abuja, holding the position from April\n1999\nto January\n2001\n. He retired in June\n2001\nand was made Emeritus Professor of Physics. He chose to retire at this time in order to become the founding Chairman/CEO of the International Centre for Basic Research.\nFor his contributions to national development, Professor Animalu received the\n2000\nNigerian National Order of Merit Award for Basic Science.\n(\nThis is Nigeria's highest award for intellectual and academic achievement.\n)\nHe was elected President of the Nigerian Academy of Science\n(\nthe leading scientific organization in Nigeria\n)\nserving in\n2001\n-\n02\n. Also in\n2001\n, he was appointed a member of the Honorary Presidential Advisory Council on Science and Technology in Nigeria. He is the only African member up to the present date of the Advisory Board of the 'Euro-Journal Physica\n(\nB\n)\n' and the only African member of the Editorial Board of the USA-based international 'Hadronic Journal' and 'Hadronic Journal Supplement'. He is also the founding editor of the 'Nigerian Journal of Solar Energy' and one of the pioneering editors of the 'Bulletin' of the Nigerian Institute of Physics. He was the Foundation President of the Solar Energy Society of Nigeria, and the foundation editor of the 'Nigerian Journal of Solar Energy'.\nReaching the age of\n70\nin\n2008\n, he began to organise annual conferences - the International Seminar on Theoretical Physics and National Development - in partnership with the National Mathematical Centre, Abuja and the International Centre for Basic Research, Abuja. Professor Animalu is author of numerous scientific articles in refereed journals and more than\n30\nbooks in both the sciences and the humanities, including the biographies of the Rt Hon Dr Nnamdi Azikiwe, Professor\nChike Obi\n, Professor Kenneth Dike, Professor Samuel Okoye, Professor\nJames Ezeilo\n, Professor Chukwuedu Nwokolo and Professor Agodi Onwumechili among others. He is a member of the Nigerian Institute of Physics, the Nigerian Mathematical Society, and the American Physical Society.\nFor a description of Patrick O Okigbo III's meeting with Animalu on a flight from Enugu to Abuja in\n2017\n, see\nTHIS LINK\n.\nAs a final comment, we should note that he published the book\nAsp, From African Symbols to Physics: the meaning of the snake symbol in African novels and the implcations for modern physics\nin\n1968\n. This book was jointly authored with Willy A Umezinwa. The book has the following contents:\nPreface.\n1\n.   Analogous Symbols of Thought in African Novels and Modern Phyiscs\n1\n.\n1\nIntroduction\n1\n.\n2\nA case study of Achebe's Arrow of God\n1\n.\n3\nSymbols of Thought: A Principle of Cultural Relativity\n1\n.\n4\nApplication of Semiotic Theory to Society\n1\n.\n5\nGeometry and Physics\n1\n.\n6\nConclusion\n1\n.\n7\nReferences\n2\n.   A Semiotic Theory of Curvilinear Form in the African Novel\n2\n.\n1\nIntroduction\n2\n.\n2\nThe Architectural Curve and Circle\n2\n.\n3\nTotemic Curve\n2\n.\n4\nFertility Circle and Spiral\n2\n.\n5\nThe Circle, Agricultural Growth and Social Activities\n2\n.\n6\nReflexive Power and the Curvilinear Form\n2\n.\n7\nOld Tradition, Mimetic Dance and Concept of Growth\n2\n.\n8\nGeometrical Figure in Modern Dance\n2\n.\n9\nConclusion: Conflict of Forms and Meaning\n3\n.   The Realities and Prospects of the Curvilinear Form in the African Culture and system of Thought: A Critical Review of Insight and Reactions\n3\n.\n1\nIntroduction\n3\n.\n2\nControversy Over Symbol of Action in Traditional Africa\n3\n.\n3\nPhilosophy and Curvilinear Form\n3\n.\n4\nConclusion\n3\n.\n5\nReferences\n4\n.   Unified Geometry of Matter, Antimatter and Light\n4\n.\n1\nIntroduction\n4\n.\n2\nEinstein\n's Field Equation and its Complement\n4\n.\n3\nKepler\n's \"Tetrahedral Law\"\n4\n.\n4\nProton + Antiproton = Light: A Tetrahedral Law\n4\n.\n5\nConclusion"
}