{
  "nome_completo": "Alexander Yule Fraser",
  "nome_curto": "Alexander Yule Fraser",
  "ano_nascimento": "1857",
  "ano_morte": "1890",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fraser/",
  "lugar_nascimento": "Cargill, near Perth, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "Alexander Yule Fraser\n's father was  Thomas Fraser\n(\nborn in Caputh, Perthshire about\n1832)\nwho was a shopman. His mother was  Elisabeth Fraser\n(\nborn in Little Dunkeld, Perthshire about\n1832)\n. Alexander  had three younger siblings: Jessie\n(\nborn about\n1860)\n, Donald\n(\nborn about\n1862)\n, and Frederick\n(\nborn about\n1877)\n.\nAlexander Fraser's was educated at the University of Aberdeen where he specialised in mathematics and physics. He graduated M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1881\nand was then appointed Second Mathematics Master, George Watson's College, Edinburgh\n[\n1\n]\n:-\nWhen George Heriot's Hospital was opened as a day school. Mr Fraser was entrusted with the charge of the Mathematical and Physical departments; and it is not too much to say that not a little of the success of this school is due to the energy with which he threw himself into the work of his department. He spared no pains in providing for the due equipment of the Physical Laboratory, and in preparing courses of Practical Geometry and Experimental Physics suitable for boys.\nIn\n1889\nFraser was appointed as Headmaster of Allen Glen's Institution in Glasgow. However he had only been in the post for two months when he suffered from a severe attack of pleurisy and felt that he could not continue in the post so offered his resignation. It was not accepted, however, and the governors gave him nine months leave during which time they hoped that he would recover his health. He went to South Africa, believing that the climate would help him recover. Indeed he did make a good recovery and returned to Glasgow for the start of the session\n1890\n-\n91\n. Once back in Glasgow his health rapidly deteriorated again and he resigned his post intending to take up permanent residence in South Africa. Sadly he died before he could leave Scotland.\nThe\nEdinburgh Mathematical Society\nwas founded in February\n1883\nand it was Fraser together with\nAndrew Jeffrey Gunion Barclay\n, also a mathematics master at George Watson's College at the time, together with\nCargill Gilston Knott\n, an Assistant to the Professor of Natural Philosophy in Edinburgh University, who issued a circular\n'to gentlemen in Edinburgh, in Cambridge and throughout Scotland generally whom they deemed likely to take an interest in such a Society'\ncalling for a Mathematical Society to be set up. The circular read as follows:-\nEDINBURGH UNIVERSITY,\nJANUARY\n23\n,\n1883\n.\nDear Sir,\nWe, the undersigned, beg to call your attention to the following proposal, in the hope that you will find it in your power to give it your support:-\nIt is proposed to establish, primarily in connection with the University, a Society for the mutual improvement of its members in the Mathematical Sciences, pure and applied.\nAmongst the methods by which this object might be attained may be mentioned: Reviews of works both British and Foreign, historical notes, discussion of new problems or new solutions, and comparison of the various systems of teaching in different countries, or any other means tending to the promotion of mathematical Education.\nIt is suggested that the Society be formed, in the first instance, of all those who shall give in their names on or before February\n2\n,\n1883\n, and who are\n(1)\npresent or former students in either of the Advanced Mathematical Classes of Edinburgh University,\n(2)\nHonours Graduates in any of the British Universities, or\n(3)\nrecognised Teachers of Mathematics; and that, after the above mentioned date, members be nominated and elected by ballot in the usual manner.\nIt may be added that Professors\nTait\nand\nChrystal\nhave expressed themselves as highly favourable to the project, as one that may lead to important results.\nIf there are any of your friends who might take an interest in the Society, kindly inform them of its objects, and invite them to attend the Preliminary Meeting, to be held in the MATHEMATICAL CLASS ROOM here, on Friday, February\n2\n,\n1883\n, at Eight p.m., at which meeting your presence is respectively requested.\nWe are,\nYours faithfully,\nCARGILL G. KNOTT, D.Sc.\n(\nEdin.\n)\n, F.R.S.E.\nA. J. G. BARCLAY, M.A.\n(\nEdin.\n)\n.\nA. Y. FRASER, M.A.\n(\nAberdeen\n)\n.\nFraser became a founder member of the\nEdinburgh Mathematical Society\nand was Secretary during\n1883\n-\n88\n, and Treasurer during\n1883\n-\n85\n. At the meeting on Friday\n8\nJanuary\n1886\nFraser gave an account of the methods for the quadrature of areas, especially by planimeters. He exhibited and described several of these instruments, including two of his own instruments. He was elected President for the session\n1889\n-\n90\n.\nAt the meeting on Friday\n14\nNovember\n1890\n,\nR E Allardice\n, vice-president of the Society, was in the chair. He referred to the loss the Society had suffered through the death of its president, Mr A Y Fraser:-\nMr Fraser was a distinguished graduate of Aberdeen University, where he took first-class mathematical honours. After leaving the University he became second mathematical master at George Watson's College. On the opening of George Heriot's Hospital as a day school, Mr Fraser was appointed head of the mathematical and physical departments, to the equipment and organisation of which be devoted himself with energy and success. A little over a year ago Mr Fraser was appointed to the headmaster-ship of Allan Glen's Institution in Glasgow, but failing health compelled him to give it up, and be resigned with the intention of going to South Africa. He was on the eve of his departure when he succumbed a week ago to an attack of pneumonia at the early age of\n33\n. While Mr Fraser was still a junior master at Watson's College, the idea occurred to him that there was room in Edinburgh for a Mathematical Society. This led to the foundation of the\nEdinburgh Mathematical Society\n, which is now in its ninth session, and has\n150\nmembers.\nIn fact Fraser had been intending to address the meeting of the Society on Friday\n14\nNovember\n1890\non the topic of the history of the controversy concerning the differential calculus.\nFraser was elected to a fellowship of the\nRoyal Society of Edinburgh\non\n1\nJune\n1885\n. He was proposed by\nGeorge Chrystal\n,\nPeter Guthrie Tait\n,\nJohn Sturgeon Mackay\n, and Thomas Harvey. The President, Sir Douglas Maclagan, address the Society on\n1\nDecember\n1890\n. He spoke of Alexander Fraser\n[\n1\n]\n:-\nMr Fraser was remarkable, among other things, for the activity of his intellect, an intellect that could never be idle; and for the energy with which he devoted himself to any work he undertook. His friends always found a talk with him to have a stimulating effect, and many will find in the future want of this stimulus a loss which is not easy to make good."
}