{
  "nome_completo": "Alfred Tarski",
  "nome_curto": "Alfred Tarski",
  "ano_nascimento": "1901",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tarski/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Alfred Tarski\n's father was Ignacy Teitelbaum, a Jewish shopkeeper and businessman who traded in wood. One might reasonably ask why Tarski's father was not named \"Tarski\" and we will explain in a moment why Alfred Teitelbaum changed his name to Alfred Tarski. Let us just note for now that Alfred Tarski was actually born with the family name of Teitelbaum, and for about the first\n22\nyears of his life was known as Alfred Teitelbaum. Ignacy Teitelbaum had married Rosa Prussak and, although Rosa never had a career, and therefore never had the opportunity to show her intellect, it was through his mother rather than his father that Tarski inherited his brilliance. Alfred had a brother Wacław Teitelbaum to whom he was close as they were growing up.\nAlfred grew up in a well off family who valued education. He attended the Schola Mazowiecka\n(\nthe Nizina Mazowiecka is the part of the lowland area of Poland in which Warsaw is situated\n)\nwhich was a High School for the intellectuals. The school gave Alfred a broader education than he would otherwise gave received. He studied subjects such as Russian, German, French, Greek and Latin in addition to the standard school topics. Of course he studied mathematics at the high school, and his teachers recognised that he had extraordinary talents in that topic, but it was not the subject that he intended to specialise in at university, rather he made the decision to study biology.\nThere were major changes in Poland during the years that Alfred Teitelbaum was growing up and we need to look briefly at the background in order to understand events. Since the partition of Poland in\n1772\n, Russia had controlled that part of the country called Congress Poland, which included Warsaw. The University of Warsaw had been closed and only a Russian language university operated there. At the outbreak of World War I, the Central Powers\n(\nGermany and Austria- Hungary\n)\nattacked Congress Poland. In August\n1915\nthe Russian forces withdrew from Warsaw - at this time Alfred Teitelbaum was studying in high school and we have to see his brilliant school career against the military action and dramatic political change taking place around him. Germany and Austria-Hungary took control of most of the country and a German governor general was installed in Warsaw.\nOne of the first moves after the Russian withdrawal was the refounding of the University of Warsaw and it began operating as a Polish university in November\n1915\n. Rapidly a strong school of mathematics grew up in the University.\nŁukasiewicz\nwas appointed to the new University of Warsaw when it reopened in\n1915\n.\nMazurkiewicz\nbecame a professor of mathematics at this time. It was an exciting time in Poland and a new Kingdom of Poland was declared on\n5\nNovember\n1916\n. Alfred Teitelbaum\n(\nwho had still not changed his name to Tarski\n)\nspent a short while in the Polish army after leaving school and then entered the University of Warsaw in\n1918\n, beginning a course which he intended would lead to a degree in biology. It was a time of great excitement as the university had become a leading international institution almost overnight.\nLesniewski\naccepted the chair of the philosophy of mathematics at Warsaw in\n1919\nand\nSierpiński\nwas appointed at the same time. These appointments were of great significance since Alfred took a course on logic given by\nLesniewski\nwho quickly saw his genius and persuaded him to change from biology to mathematics. It was a defining moment for Alfred who now came under the influence not only of\nLesniewski\nbut also of\nŁukasiewicz\n,\nSierpiński\n,\nMazurkiewicz\n, and the philosopher Kotarbinski. He attended courses by all these leading academics and showed his genius by quickly matching the brilliance of his teachers. In\n1920\nhe had a short spell in the Polish army in the middle of his studies.\nIt was around\n1923\nthat Alfred Teitelbaum changed his name to Alfred Tarski. There were a number of reasons for the name change and for the other major change to his life which he decided to make at the same time, namely to change his religion from the Jewish faith to become a Roman Catholic. It was not just Alfred who made these two major moves, for his brother Wacław took the name of Tarski and embraced Roman Catholicism at the same time. We have explained the new beginnings that Poland had experienced in the few years before this, and there were strong nationalist feelings in the country. There is no doubt that Tarski was strongly influenced by these feelings and wished to be a Pole and not a Jew. Both the name change and the change of religion made him more Polish. There was also the realisation that anti-Semitic views in the country made it almost impossible for a Jew to be appointed to a university post and Tarski, nearing the end of his doctoral studies, certainly wished to follow an academic career.\nTarski's first paper was published in\n1921\nwhen he was only\n19\nyears old. In this paper he investigated set theory questions, and in fact set theory would be a continuing research interest for Tarski throughout his life. His doctoral studies were supervised by\nLesniewski\nand he submitted his doctoral thesis for examination in\n1923\n. In\n1924\nTarski graduated with a doctorate, and became the youngest person ever to be awarded the degree by the University of Warsaw. Tarski's first major results were published in\n1924\nwhen he began building on the set theory results obtained by\nCantor\n,\nZermelo\nand\nDedekind\n. He published a joint paper with\nBanach\nin that year on what is now called the\nBanach\n-Tarski paradox. This is not a paradox at all, the only reason that it is given this name is that it is counter-intuitive. The result proves that a sphere can be cut into a finite number of pieces and then reassembled into a sphere of larger size, or alternatively it can be reassembled into two spheres of equal size to the original one.\nTarski taught logic at the Polish Pedagogical Institute in Warsaw from\n1922\nto\n1925\nthen in that year he was appointed\nDocent\nin mathematics and logic at the University of Warsaw. He later became\nŁukasiewicz\n's assistant but these university positions did not give him enough money to live on, so he had to earn his living with a second job. He became a mathematics professor at Zeromski's Lycée in Warsaw in\n1925\nand until\n1939\nhe held these two full-time posts. On\n23\nJune\n1929\nTarski married Maria Witkowski who was a teacher at Zeromski's Lycée. Given Tarski's Polish patriotism which we mentioned above, it may be relevant to note that Maria was a Roman Catholic and she had worked as a courier for the army during Poland's fight for independence.\nThis was a time when Tarski's international reputation continued to grow. He visited the University of Vienna in February\n1930\nwhere he lectured to\nMenger\n's colloquium. In Vienna he met\nGödel\nwho had recently been awarded his doctorate and who became a member of the faculty later in that year. In\n1933\nTarski published\nThe concept of truth in formalized languages\nwhich is his now famous paper on the concept of truth:-\n... which is among the most important papers ever written on mathematical logic. ... Not only does this paper provide a mathematically rigorous articulation of several ideas that had been developing in earlier mathematical logic, it also presents foundations on which later logic could be built.\nTarski was awarded a fellowship to allow him to return to Vienna in January\n1935\nand he worked with\nMenger\n's research group until June. The Vienna Circle of Logical Positivists which flourished, particularly in the\n1920\ns in Vienna, had led to the development of the Unity of Science group and this group met in Paris in\n1935\n. Tarski presented his ideas on truth in a lecture at this meeting. Niiniluoto, in\n[\n47\n]\nargues:-\n... for the thesis that Alfred Tarski's original definition of truth, together with its later elaboration in\nmodel theory\n, is an explication of the classical correspondence theory of truth. In defending Tarski against some of his critics, I wish to show how this account of truth can be formulated, understood, and further developed in a philosophically satisfactory way.\nTarski published\nOn the concept of logical consequence\nin\n1936\n. In this he claimed that the conclusion of an argument will follow logically from its premises if and only if every model of the premises be a model of the conclusion. This work on logical consequence has had a profound influence and has been discussed by many authors; see for example\n[\n5\n]\n,\n[\n13\n]\n,\n[\n23\n]\n,\n[\n36\n]\n,\n[\n53\n]\n,\n[\n56\n]\n, and\n[\n70\n]\n.\nIn\n1937\nhe published another classic paper, this time on the deductive method, which presents clearly his views on the nature and purpose of the deductive method, as well as considering the role of logic in scientific studies.\nIn\n1939\nTarski applied for the chair of philosophy at Lwów but failed to be appointed. It is hard to be certain why one candidate may be preferred to another in a competition for a chair so it is impossible to say with certainty that anti-Semitism played a role in the decision. However, it is certainly fair to say that by\n1939\nTarski had an outstanding international reputation but was still forced to support himself by teaching mathematics in a high school. It is certainly reasonable to believe that changing one's name and religion would not allow Jews to escape from the discrimination which was widespread throughout Europe at this time.\nIn August\n1939\nTarski travelled to Harvard University in the United States to attend another Unity of Science meeting. At\n12\n.\n40\non\n31\nAugust\n1939\nHitler gave the order for his troops to attack Poland at\n4\n.\n45\nthe next morning. Tarski had been in the United States for two weeks at the time. It was extremely fortunate for him that he was not in Poland when the German armies attacked, for there is no doubt that despite the change of name and religion, he would still have qualified as a Jew as far at the Nazi regime were concerned.\nBy this time Tarski had two children, a son Jan and a daughter Ina, and both his wife and children had remained in Poland when he travelled to the United States in\n1939\n. Tarski was successful in obtaining permission to remain in the United States, and he then tried, with the help of many European friends, to arrange for his family to escape and join him in the United States. He failed to achieve this but fortunately all three survived the war and were able to join Tarski in\n1946\n. However, his father, mother, brother and sister-in-law all died at the hands of the Nazis during the war.\nCertainly Tarski's life was saved by being in the United States but he still had to secure a job. Permanent posts were not easy to obtain since many outstanding academics had fled from Europe to the United States in the years immediately prior to the outbreak of war. Tarski held a number of temporary research positions: Harvard from\n1939\nto\n1941\n; City College of New York in\n1940\n; and the Institute for Advanced Study at Princeton in\n1941\n-\n42\nwhen he held a Guggenheim Fellowship. At Princeton Tarski met\nGödel\nagain for he had also fled from the Nazi threat. During this period, in\n1941\n, he published an important paper calculus of relations.\nAfter these years of temporary jobs, Tarski obtained a permanent post after he joined the staff at the University of California at Berkeley in\n1942\n. At first he was appointed to a one year post but he was soon given tenure. He was promoted to associate professor there in\n1945\n, becoming Professor of Mathematics in\n1949\n. He remained at Berkeley for the rest of his career, becoming professor emeritus in\n1968\n. Although officially retired at that stage, he was asked to continue to teach until\n1973\nand he also continued supervising research students and undertaking research up to the time of his death. In\n[\n3\n]\nwe are told about Tarski's students in Berkeley.\nHis seminars at Berkeley fast became a power-house of logic. His students, many of them now distinguished mathematicians, recall the awesome energy with which he would coax and cajole their best work out of them, always demanding the highest standards of clarity and precision.\nTarski certainly did not lead a quite life in Berkeley, but rather took many opportunities to visit other places. He was Sherman memorial lecturer at University College London in\n1950\n, then a lecturer at the\nHenri Poincaré\nInstitute in Paris in\n1955\n. He was research professor at the Miller Institute of Basic Research in Science in\n1958\n-\n1960\n, then in\n1966\nreturned to University College London when he was again Sherman memorial lecturer. In\n1967\nhe was Flint professor of philosophy at the University of California at Los Angeles and in\n1974\n-\n75\nhe was in South America at the Catholic University of Chile.\nTarski is recognised as one of the four greatest logicians of all time, the other three being\nAristotle\n,\nFrege\n, and\nGödel\n. Of these Tarski was the most prolific as a logician and his collected works, excluding his books, runs to\n2500\npages. Tarski made important contributions in many areas of mathematics: set theory,\nmeasure theory\n,\ntopology\n, geometry, classical and universal algebra, algebraic logic, various branches of formal logic and metamathematics. He produced axioms for 'logical consequence', worked on deductive systems, the algebra of logic and the theory of definability. He can be considered a mathematical logician with exceptionally broad mathematical interests. We have looked briefly at some of Tarski's work and we shall examine a little more of his work but it is impossible in a biography of this length to give a proper view of the range of his contributions.\nMetamathematics, introduced by\nHilbert\nin\n1922\nmeaning \"proof theory\" as a part of his programme to establish the consistency of arithmetic, was transformed by Tarski when he introduced semantic methods leading to his development of model theory with its combination of semantic and syntactic relations. Sinaceur writes\n[\n60\n]\n:-\nIn\n[\nTarski's\n]\nview, metamathematics became similar to any mathematical discipline. Not only its concepts and results can be mathematized, but they actually can be integrated into mathematics. ... Tarski destroyed the borderline between metamathematics and mathematics. He objected to restricting the role of metamathematics to the foundations of mathematics.\nFormal scientific languages can be subjected to more thorough study by the semantic method that he developed. He worked on model theory, mathematical decision problems and with universal algebra.\nTarski presented his paper\nThe axiomatic method : with special reference to geometry and physics\nto the International Symposium held at the University of California at Berkeley from\n26\nDecember\n1957\nto\n4\nJanuary\n1958\n. His paper, appearing in the Proceedings of the Conference in\n1959\n, gives his axiom system for geometry. This axiomatic system gives a newer approach to the problem which had been tackled by\nHilbert\nin\nGrundlagen der Geometrie\nⓉ\n(\nFoundations of geometry\n)\n.\nIn\n1968\nTarski wrote another famous paper\nEquational logic and equational theories of algebras\nin which he presented a survey of the metamathematics of equational logic as it then existed as well as giving some new results and some open problems. In the following year Tarski's paper\nTruth and proof\nappeared which:-\n... is one of the finest pieces of expository writing in all of mathematical logic.\nThe paper considers\nGödel\n's incompleteness theorem as well as Tarski's undefinability theorem and look at their consequences for the axiomatic method in mathematics.\nTarski wrote nineteen monographs in different areas of mathematics. His work includes\nGeometry\n(1935)\n,\nIntroduction to Logic and to the Methodology of Deductive Sciences\n(1936)\n,\nA decision method for elementary algebra and geometry\n(1948)\n,\nCardinal Algebras\n(1949)\n,\nUndecidable theories\n(1953)\n,\nLogic, semantics, metamathematics\n(1956)\n, and\nOrdinal algebras\n(1956)\n.\nIntroduction to Logic and to the Methodology of Deductive Sciences\nis an introduction written at the level of an undergraduate course in logic and axiomatics. In\nA decision method for elementary algebra and geometry\nTarski showed that the first-order theory of the real numbers under addition and multiplication is decidable which is in contrast, in a way which is really surprising to non-experts, to the results of\nGödel\nand\nChurch\nwho showed that the first-order theory of the natural numbers under addition and multiplication is undecidable.\nCardinal Algebras\npresents a study of algebras satisfying certain properties which capture the arithmetic of cardinal numbers. In\nUndecidable theories\nTarski showed that\ngroup theory\n, lattices, abstract\nprojective geometry\n, closure algebras and others mathematical systems are undecidable. He had already made clear how pleased mathematicians should be that there is no solution to the general decision problem. In a lecture given at Harvard during\n1939\n-\n40\nTarski said:-\n... the solution of the decision problem in its most general form is negative. ...\n[\nSurely\n]\nmany mathematicians experienced a profound feeling of relief when they heard of this result. Perhaps sometimes in their sleepless nights they thought with horror of the moment when some wicked metamathematician would find a positive solution, and design a machine which would enable us to solve any mathematical problem in a purely mechanical way.... The danger is now over ...\n[\nand\n]\nmathematicians ... can sleep quietly.\nIn\nOrdinal algebras\nTarski defines an algebra which captures the properties of the additive theory of order types. It differs most strongly from the algebras which he presented in\nCardinal algebras\nby having non-commutative addition.\nThe collected papers of Tarski were produced in four volumes edited by Steven R Givant and Ralph N McKenzie. John Corcoran, reviewing these volumes, writes:-\nThe mathematical community owes a debt of gratitude to Givant and McKenzie for their efforts in producing this invaluable collection of Alfred Tarski's works. It is only when we see Tarski's papers collected in one place that we can begin to appreciate the scope and profundity of his influence on modern mathematical thought and, in particular, on modern mathematical logic. Mathematical logic as we know it today is almost inconceivable without Tarski's contributions.\nG H Moore writes in\n[\n1\n]\ndescribed Tarski's character:-\nTarski was extroverted, quick-witted, strong-willed, energetic, and sharp-tongued. He preferred his research to be collaborative - sometimes working all night with a colleague - and was very fastidious about priority.\nA B Feferman also describes aspects of his character writing in\n[\n25\n]\n:-\nA charismatic leader and teacher, known for his brilliantly precise yet suspenseful expository style, Tarski had intimidatingly high standards for students, but at the same time he could be very encouraging, and particularly so to women - in contrast to the general trend. Some students were frightened away, but a circle of disciples remained, many of whom became world-renowned leaders in the field.\nTarski was honoured by being elected to the\nNational Academy of Sciences\n, the\nRoyal Netherlands Academy of Sciences\n, and the British Academy. He was made honorary editor of\nAlgebra Universalis\nand served as President of the Association for Symbolic Logic from\n1944\nto\n1946\nand the International Union for the History and Philosophy of Science in\n1956\n-\n57\n. He received honorary degrees from the Catholic University of Chile\n(1975)\nand the University of Marseilles\n(1977)\n. In\n1981\nBerkeley awarded him the Berkeley Citation."
}