{
  "nome_completo": "Allen Lowell Shields",
  "nome_curto": "Allen Shields",
  "ano_nascimento": "1927",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Shields/",
  "lugar_nascimento": "New York City, USA",
  "lugar_morte": "Ann Arbor, Michigan, USA",
  "biografia": "Allen Shields\n' parents were Esther Lowell and Art Shields. Art, who was born in Barbados in October\n1888\n, was the son of a Moravian church preacher. He was a member of the United States Communist Party, and while working in the shipyard in Seattle in\n1919\nwrote a leaflet calling for a general strike. He later became a reporter for the labour-based Federated Press, then joined the staff of the Daily Worker in\n1924\nas a labour reporter. Allen's mother, Esther, was also a labour journalist. Allen was his parents' only child and he grew up in a home in which there was\n[\n6\n]\n:-\n... an atmosphere of gentleness and courtesy.\nAlthough Allen shared his parents' views of the social injustices in the United States, he did not accept their ideology nor their belief that Communism was a panacea\n[\n6\n]\n:-\nThis did not seem to vitiate his affectionate relationships with his parents ...\nShields was an undergraduate at the City College New York where his lecturers included\nEmil Post\nand\nLee Lorch\n. After enlisting in the United States Army in\n1944\nand serving in Berlin from\n1945\nto\n1946\nafter the end of World War II, he completed his undergraduate studies in New York and was awarded his bachelor's degree in\n1949\n. Shapiro, who knew him during his final undergraduate year, gives this description\n[\n6\n]\n:-\nA tall, slim, redhead, he usually wore army clothing and plaid flannel shirts. He was very tidy and always had his homework done. With his rustic appearance and Anglo-Saxon name he seemed rather exotic in that population of typically urban, predominantly Jewish students.\nHis doctoral studies were at the Massachusetts Institute of Technology under\nWitold Hurewicz\n's supervision and he received his doctorate in\n1952\nfor his thesis\nOn Additive Properties of Real Numbers\n. Despite the fact that\nHurewicz\nwas Shields' official supervisor, he was unofficially supervised by\nRaphaël Salem\n. At that time,\nSalem\nspent half the year in Paris and half at M.I.T. Shapiro, who was a close friend of Shields and his roommate while they were undertaking research at M.I.T., writes in\n[\n6\n]\nof the good and bad aspects of this time:-\nOne professor, a champion of austere formalism, often needed to draw a diagram to see what was going on, but in order not to \"corrupt\" us he would hide it with his body, then erase it before the class could see it. This became a standing joke between Allen and me, and perhaps it influenced the evolution of his own lecturing style into the model of clarity and vividness that was his hallmark. ... One of my fondest memories from M.I.T. years is running into Allen in the library at ungodly hours of the night. We shared reverential feelings for \"classical\" mathematics and had acquired the habit of browsing in sources like Fundamenta Mathematica and\nCrelle\n's Journal. We compared notes on what we were reading or working on. I'll never forget that atmosphere - we were the only living souls around; it seemed truly amazing that we had access to the departed, to\nBanach\nand\nPoincaré\n, to the\nUrysohn\nmetricisation theorem as seen through the eyes of\nUrysohn\n, and rather clearer than in our\ntopology\ncourse.\nShields' first post was as a Research Instructor in Mathematics at Tulane where he learnt a lot of\nfunctional analysis\nand wrote papers on topological\nsemigroups\n. This post, funded by the Office of Naval Research, had a reduced teaching load. Here he began to collaborate with Paul Mostert on topological semigroups. Over the following years they published joint papers such as:\nOn a class of semigroups on\nE\nn\nE_{n}\nE\nn\n​\n(1956)\n,\nOn continuous multiplications on the two-sphere\n(1956)\n,\nOn the structure of semigroups on a compact manifold with boundary\n(1957)\n,\nSemigroups with identity on a manifold\n(1959)\n, and\nOne-parameter semigroups in a semigroup\n(1960)\n.\nIn\n1955\n, Shields was appointed to the University of Michigan at Ann Arbor, taking up his appointment in the following year, and remained there for the rest of his career except for two years\n(1959\n-\n61)\nspent in New York. In\n[\n2\n]\nDuran recounts the story, told to him by George Piranian, of how Shields was appointed to the University of Michigan.\nIn\n1955\n, on the first day of the American Mathematical Society Summer Meeting in Ann Arbor, George\n[\nPiranian\n]\nasked Chairman T H Hildebrandt for leave of absence for the Winter Term of\n1956\n. Immediately Hildebrandt declared that he could not grant the request unless George found a replacement. On his way from Hildebrandt's office to one of the lecture sessions, George ran into Allen Shields, whom a year earlier he had met at the Summer Meeting at Laramie. Allen was cooperative, and George dashed back to report that he had found a substitute and that, after fifteen more minutes the substitute would present a ten-minute paper. ... Young as he was, Allen had already mastered the art of beginning his blackboard work in the upper left-hand corner and ending neatly at the lower right, with one minute to spare. Hildebrandt was so impressed that on the spot he offered Allen a one-term appointment. Later, the department persuaded both Shields and Hildebrandt to extend the arrangement.\nSoon after George Piranian returned from his leave, he began working with Shields and they published the joint paper\nThe sets of Luzin points of analytic functions\n(1957)\n. Shields worked on a wide range of mathematical topics including\nmeasure theory\n, complex functions, functional analysis and operator theory. F W Gehring described his work in these words:-\nAllen's standards were high, his taste impeccable, and his ideas deep. He was one of the world's most versatile practitioners in the art of applying functional analysis to gain insight on and solve problems of classical function theory. He had a profound effect on the development of this subject through his research and his personal contacts with colleagues and students.\nS Axler, in dedicating the second part of the twelfth volume of\nThe Mathematical Intelligencer\nto Shields, writes\n[\n1\n]\n:-\nAllen was one of the world's leading authorities on spaces of analytic functions. He directed more Ph.D. theses than anyone in the history of the Mathematics Department of the University of Michigan, where he served as chair for a few years\n[\nbeginning in\n1975]\n. In\n1979\nthe University of Michigan awarded Allen its Distinguished Faculty Achievement Award. ... Allen's 'Years Ago' columns\n[\nin The Mathematical Intelligencer\n]\nsparkle with insight and demonstrate his unusual knowledge of history as well as mathematics.\nJ H Shapiro was one of Shields' many PhD students. He also notes that Shields advised the greatest number of mathematics PhD theses at the University of Michigan, but as a student was able to give insight into the style of Shields' supervision. He writes\n[\n7\n]\n:-\n... I want you to know that beneath that gentle exterior lurked a very tough advisor. If you were his student, then under his guidance, you settled on your own topic, within which you found your own problem. And there was no guarantee that you could crack that problem. Allen kept to the sidelines but always made himself available to guide us to the literature, offer opinions, suggest options, lighten the mood with gentle wisecracks, and generally shout encouragement. Any student who got a degree with him really earned it, and in the process learned how to find the dreaded \"post-thesis\" research problem, and the ones after that, too.\nShields married Smilka Zdravkovska who had come to the United States with her daughter Bojana from Skopje, Yugoslavia. She writes\n[\n8\n]\n:-\nI probably fell in love with Allen the first time I heard him lecture\n(\nit was on power series, in the University of Michigan Math Club\n)\n. Here was this tall, lean, red-haired boy\n(\nit was only later that I found out he wasn't a junior faculty member in the Mathematics Department, but rather its acting chairman\n)\n...\nP Duren wrote joint papers with Shields.  In\n[\n2\n]\n, he gives a feel for what it was like working with him. Duren writes:-\nDoing mathematics with Allen was fun. He was creative and powerful, yet childlike in his enthusiasm. His lectures were models of clarity and inspiration. He was a wonderfully gregarious mathematician who found excitement in mathematical discussions with colleagues and students. Throughout his career, he always had a strong tendency to collaborate. The record shows that of his\n80\nresearch papers, all but\n15\nwere written jointly with other mathematicians. He had\n44\ndifferent coauthors.\nH S Shapiro tells us that, in addition to mathematics, there were many other skills that Allen Shields possessed\n[\n6\n]\n:-\nLooking back on Allen's life one sees that \"the elements were mixed in him\" and he could have done well in several professions. He loved history and, like his father, had a phenomenal memory. He was a fine amateur linguist\n[\nfluent in Spanish, German, Russian and French\n]\n. He could have been a journalist - he loved to travel about the country\n(\nlater, the world\n)\ndrinking in local atmosphere and history, hitching or offering rides, always curious to talk with people he met en route ...\nTragically Shields was struck down with cancer in the summer of\n1988\n. A conference was held in his honour in August\n1989\nwhich he attended, although he was gravely ill, and joked with the participants. He died a few weeks later."
}