{
  "nome_completo": "Ambrosius Paul Speiser",
  "nome_curto": "Ambros Speiser",
  "ano_nascimento": "1922",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Speiser/",
  "lugar_nascimento": "Basel, Switzerland",
  "lugar_morte": "Aarau, Switzerland",
  "biografia": "Ambros Speiser\n's father Ernst F Speiser\n(\nborn\n6\nJune\n1889)\nwas a Swiss business man of international standing who at the time of Ambros's birth was working in London, England. Ambros was the eldest of his parents' three children. The family were living in Surbiton in Surrey, England and Ambros was brought up there, attending elementary school in Surbiton. In\n1931\n, when Ambros was eight years old, the family moved to Baden in the canton of Aargau in Switzerland. He continued his education in Baden before going to college in Aarau, the capital of the Aargau canton. He explains in\n[\n4\n]\nhow he became interested in computers:-\nAfter college, I served in the antiaircraft troops for two years, advancing to lieutenant. The gun-sight director that I had to operate was an electromechanical analog computer. It interested me considerably, I studied its intricate mechanism in depth, and, accordingly, I could serve as an instructor to my colleagues. This was my first contact with computing.\nSpeiser entered the Eidgenössische Technische Hochschule Zürich\n(\nETH\n)\nin\n1944\nwhere he studied electrical engineering. He visited Maurice Wilkes' computing laboratory in Cambridge, England, in\n1947\nand realised the potential of the digital computers that were being designed there. It was this experience that made him decide that he wanted to make digital computers a major part of his life. Returning to the ETH, he made contact with\nEduard Stiefel\nwho was working towards founding the Institute for Applied Mathematics in ETH.\nStiefel\n's original interests were in topology but his aim was to build an institute where the mathematical implications of computers could be studied\n[\n4\n]\n:-\nStiefel\nwas quite well-informed about the current state of the art, although he had personally never seen a digital computer. I told him what I had observed in Wilkes's department, I outlined the concept of the\nvon Neumann\nmachine\n(\nalthough this name was not in use at that time\n)\n, and I was pleased to observe that\nStiefel\nshowed considerable interest. He explained that he planned to send two assistants to the United States for a year in order to familiarize themselves with computer technology; after their return, they would build a computer for ETH, since commercially available machines for mathematical purposes did not exist and were not in the foreseeable future.\nSpeiser completed his electrical engineering degree at ETH in\n1948\n, specialising in low-voltage technology. He then became one of two assistants to\nStiefel\nat the new Institute for Applied Mathematics which was founded in the year Speiser graduated.\nStiefel\ndecided that the Institute for Applied Mathematics at ETH should build its own electronic computer, so he sent\nHeinz Rutishauser\nand\nAmbros Speiser\non a fact finding visit to the United States in January\n1949\n. Their assignment was to study the state-of-the-art in computing in the United States and then to start a suitable project at the ETH.\nRutishauser\nand Speiser spent most of\n1949\nat Harvard with\nHoward Aiken\nand at Princeton with\nJohn von Neumann\n. They also visited a number of other computer installations, including the ENIAC at Aberdeen, Maryland, and the MARK II at Dahlgren. Returning to the ETH in December\n1949\n, Speiser discovered that plans had changed since\nStiefel\nhad managed to persuade the ETH to rent the use of\nKonrad Zuse\n's Z\n4\n. Accordingly the plan was to put on hold the idea that the ETH would build its own digital computer and first to gain experience installing and working with the Z\n4\n. Speiser explains\n[\n6\n]\n:-\nAll these specifications of the Z\n4\n, as seen in\n1949\n, were very convincing for\nStiefel\n,\nRutishauser\nand Speiser. It must be borne in mind that at this time there were hardly a dozen program-controlled computers in operation, all of them in US. Less than a handful were in use for research in numerical mathematics, the others performed routine calculations. There were no doubts that Z\n4\ncould be used for serious mathematical research. ... When the Z\n4\nmachine was installed, significant work started almost immediately. Within a few years Zürich rose to be one of the foremost centres in numerical analysis. ... The creative spirit that was ever-present, the continuous expression and evaluation of new ideas, the thoroughly based academic knowledge and the sound scientific judgment were daily realities, I am almost tempted to say: This was the air that we were breathing. I can hardly believe, that\nStiefel\n, when he decided to acquire the Z\n4\n, would have dared to hope for success of this degree! The Z\n4\nwas also extensively used in education. As early in\n1951\n, we offered to students a course in computer programming with practical exercises on the machine. We believe we were the first on the European continent to do so. This should be taken in consideration by those who often criticize that Swiss Universities were late in recognizing the importance of informatics.\nThe contract to rent the Z\n4\nwas signed by ETH by July\n1949\nand the computer was operational in Zürich by August\n1950\n. In the same year Speiser married the pianist Margrit Schenk; they had four children. Since becoming\nStiefel\n's assistant, Speiser had been working on his doctorate under\nStiefel\n's supervision. The degree was awarded in\n1950\nfor his thesis\nEntwurf eines elektronischen Rechengerätes unter besonderer Berücksichtigung der Erfordernis eines minimalen Materialaufwandes bei gegebener mathematischer Leistungsfähigkeit\nⓉ\n(\nDraft of an Electronic Calculation Tool under Special Considerations of the Requirements of a Minimal Expense in Material at a Given Mathematical Capacity\n)\n. The thesis was published and reviewed by\nHerman Goldstine\nwho was a major player in the development of digital computers in the United States.\nGoldstine\nwrites:-\n... the author gives a quite complete account of an electronic digital computer, being considered by the computation laboratory at the Technical Institute in Zürich. The machine is to have a magnetic drum memory of\n1200\nword capacity, each word being\n12\ndecimal digits. The multiplication speed is\n30\nms. and the average access time to the memory is\n16\nms. The author gives a comprehensive discussion of all relevant mathematical phases of the problem as he poses it. This is to construct a low cost, rapid machine for a modest size computation laboratory. The machine described is to have about\n1000\nvacuum tubes and\n300\nrelays.\nThere followed a series of four papers by\nStiefel\n,\nRutishauser\nand Speiser,\nProgrammgesteuerte digitale Rechengeräte\n(\nelektronische Rechenmaschinen\n)\nⓉ\n(\nProgram-controlled digital computing devices\n(\nelectronic calculators\n)\n)\nappearing in\n1950\nand\n1951\n.\nHerman Goldstine\n, who also reviewed these papers, writes:-\nIn this series of papers the authors discuss in very considerable detail a number of the important mathematical questions that naturally arise in the design of a digital computer. These topics include possible number systems, the questions of \"fixed\" vs \"floating\" point and complementation, the arithmetic processes, the grouping of numbers to achieve higher than normal precisions, conversion between number systems, the structure of finite approximation methods, error analysis, programming and coding as well as the physical organs of a machine. In many of these considerations the authors have compared the various points of view expressed by others in the field to give a comprehensive picture of the situation as understood at the present time.\nIn\n1952\nSpeiser\nhabilitated\nat ERH and was appointed as a\nprivatdozent\n.\nSpeiser had been actively working on the project to build a digital computer at ETH from the time he spent the year\n1949\nin the United States with\nRutishauser\n. Although much work was done with the Z\n4\nat ETH, in parallel Speiser and\nRutishauser\nwere working on the construction of ETH's own computer ERMETH\n(\nElektronische Rechenmaschine an der ETH\n)\n. Speiser was the chief engineer for the project and ERMETH became operational in\n1955\n. While this work was ongoing, a number of interested people visited ETH to see how the work was progressing. These included Walter F Herzog, general manager of IBM Switzerland, and later Arthur L Samuel, research advisor to IBM. After taking a decision to establish a research laboratory in Europe, IBM first tried to site it in England in February\n1955\nbut various conditions were imposed by the English which made this unattractive. Switzerland was their next choice and this proceeded. They decided that their first choice of director was Speiser, but at this stage he was unaware of this decision. Samuel took the unusual step of talking to Speiser's father who was the representative of the canton of Aargau to the Swiss Council of the States or Ständerat as it is called\n(\na role he held from\n1948\nto\n1961)\n. Speiser writes\n[\n4\n]\n:-\nThe advice to talk to my father before contacting me was, indeed, unusual. Evidently, Samuel and my father had agreed to keep their meeting confidential -- I learned about it only many years later through a casual remark by my father, but, of course, I did not resent it in the least. But, one point is worth mentioning: When the offer from IBM came in\n1955\n, I almost simultaneously received an offer for employment from a Swiss company that looked quite interesting. I asked my father what he thought about it. He encouraged me to decide for IBM.\nSpeiser was appointed Director of the IBM research laboratory in Zürich in\n1956\n. At first the laboratory was in a rented building in Adliswil, but in\n1961\nhe persuaded IBM to build a new laboratory at Rüschlikon\n(\nclose to Zürich\n)\n. The building was completed near the end of\n1962\n. In the same year Speiser was appointed as Professor at ETH. During his years with IBM he wrote two books:,\nImpulsschaltungen\n(\nPulse circuits\n)\n(1963)\n, and\nDigitale Rechenanlagen\n(\nDigital Calculation Systems\n)\n(1965)\n.\nBy\n1965\nover\n100\npeople were employed in the laboratory at Rüschlikon\n[\n4\n]\n:-\nBy\n1966\n, the laboratory had well-established itself in the new building. Research management did not anticipate further growth, at least for the coming few years.\nThis seemed to Speiser a good time to move on to another venture\n[\n2\n]\n:-\nIn\n1966\n, I decided to make a complete change in my life and to accept the position of Director of Corporate Research of Brown Boveri, a large international corporation based in Switzerland, active mainly in the electric power field. Accordingly, steam turbines and electric generators, rather than computers, became the objects of my daily work.\nHe worked for this company until he retired in\n1987\n. He died at the age of\n81\n, having suffered a stroke on the previous day.\nSpeiser received a number of honours for his contributions including election as president of the International Federation for Information Processing from\n1965\nto\n1968\n. He had been secretary-treasurer of the Federation since\n1959\n. He received an honorary doctorate for his pioneering work in the computer sciences from ETH in\n1986\n. Then, from\n1987\nto\n1993\n, he was president of the Swiss National Academy of Engineering."
}