{
  "nome_completo": "Claude Ambrose Rogers",
  "nome_curto": "Ambrose Rogers",
  "ano_nascimento": "1920",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rogers/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Islington, London, England",
  "biografia": "Ambrose Rogers\n' father, Leonard Rogers\n(1868\n-\n1962)\n, was a distinguished doctor who served in the Indian Medical Service. Leonard Rogers married Una Elsie North\n(1883\n-\n1951)\nin\n1914\nin Calcutta, West Bengal, India. They had three children, Gordon Leonard Rogers\n(1916\n-\n2006)\n, who became a physicist specialising in optics\n(\nhe was a professor at the University of Aston in Birmingham, England\n)\n, and twins Claude Ambrose Rogers, the subject of this biography, and Stephen Clifford Rogers\n(1920\n-\n1995)\n. The twins were born in Cambridge in\n1920\n, the year in which their father returned from India. Leonard Rogers retired from the Indian Medical Service in\n1921\nand the family lived in London where Leonard took on many duties such as lecturing on tropical medicine, serving on the India Office medical board, and being the medical adviser to the secretary of state.\nAmbrose, as he was known, spent his early childhood years in London and then was a boarder at Berkhamsted School, an independent school in Hertfordshire, England about\n45\nkm northwest of London. He graduated from Berkhamsted School in\n1938\nand, later that year, matriculated at University College, London where he studied mathematics. He was awarded his B.Sc. from the University of London in\n1941\nhaving spent part of his undergraduate studies in Bangor where University College had been evacuated to since the bombing of London made that city too dangerous for students. However, the years of World War II had more impact on Rogers than just going to Bangor, for he did war work as an Experimental Officer with the Ministry of Supply from\n1940\nuntil the end of the war in\n1945\n. Other mathematicians such as David Kendall also held similar posts with the Ministry of Supply.\nAfter the war ended, Rogers returned to his mathematical studies. He was appointed a lecturer in mathematics at University College, London in\n1946\nand worked for his doctorate at Birkbeck College, London while lecturing at University College. His thesis advisors at Birkbeck were\nLancelot Stephen Bosanquet\nand Richard G Cooke and in his first paper,\nLinear transformations which apply to all convergent sequences and series\n, published in\n1946\nin the\nJournal\nof the\nLondon Mathematical Society\n, he thanked them writing:-\nI am indebted to\nDr L S Bosanquet\nand Dr R G Cooke for advice and encouragement during the preparation of this note.\nIn fact he had done this work in a part-time capacity while he was undertaking war work. It was a slightly disappointing start to Rogers publishing career for he published an Addendum in the same volume of the\nJournal\nexplaining that the results of his first paper could be obtained more easily from a theorem of\nStefan Banach\nand also reported that the first of his theorems was proved by the American mathematician Ralph Palmer Agnew\n(1900\n-\n1986)\nin\n1939\n. However, this was only the first of a remarkable number of papers that Rogers published while a research student:\nA note on a theorem of Blichfeldt\n(1946)\n;\n(\nwith\nHarold Davenport\n)\nHlawka's theorem in the geometry of numbers\n(1947)\n;\nA note on a problem of Mahler\n(1947)\n;\nA note on irreducible star bodies\n(1947)\n;\nExistence theorems in the geometry of numbers\n(1947)\n;\n(\nwith J H H Chalk\n)\nThe critical determinant of a convex cylinder\n(1948)\n;\nA problem of Hirsch\n(1948)\n;\nThe product of the minima and the determinant of a set\n(1949)\n;\nThe product of n homogeneous linear forms\n(1949)\n;\nThe successive minima of measurable sets\n(1949)\n;\nOn the critical determinant of a certain nonconvex cylinder\n(1949)\n;\n(\nwith\nHarold Davenport\n)\nA note on the geometry of numbers\n(1949)\n; and\n(\nwith J H H Chalk\n)\nThe successive minima of a convex cylinder\n(1949)\n. This list is quite exceptional but these were only the papers which appeared in print before\n1949\n. Others such as\nThe signatures of the errors of simultaneous Diophantine approximations\nand\nThe asymptotic directions of n linear forms in n\n+\n1\nintegral variables\n, were submitted by Rogers to the\nProceedings\nof the\nLondon Mathematical Society\non\n6\nSeptember\n1947\nbut did not appear in print until\n1951\n.\nRogers was awarded a Ph.D. in\n1949\nfor his thesis\nThe Transformation of Sequences by Matrices\nin which he studied divergent series. A paper with the same title as his thesis, containing\n21\ntheorems, was submitted to the\nProceedings\nof the\nLondon Mathematical Society\nin August\n1948\nbut only appeared in print in\n1951\n. Rogers writes:-\nThis paper forms part of a thesis approved for the Degree of Ph.D. in the University of London.\nBefore the award of his Ph.D., Rogers began working with\nHarold Davenport\nand, in addition to their joint papers given above, they published two joint papers\nOn the critical determinants of cylinders\nand\nDiophantine inequalities with an infinity of solutions\n. Both were submitted for publication in June\n1949\nand appeared in print in\n1950\n. The second of these is a major work with\n34\npages and the authors give the following abstract:-\nMany results in the geometry of numbers assert, in effect, that inequalities of a certain type are soluble in integers, the constant on the right of the inequality being the best possible. Recent work of\nMahler\noften enables one to prove that such an inequality has infinitely many solutions. In this paper we develop the theory of inequalities with infinitely many solutions, and investigate more deeply some of the questions which naturally arise.\nThrough\nDavenport\n, Rogers became interested in packing and covering. After being awarded a Commonwealth Fund Fellowship, in the autumn of\n1949\nhe went to the Institute for Advanced Study in Princeton. His paper\nA note on coverings and packings\n(1950)\nwas written while he was in Princeton. While in Princeton, he met the Russian born Israeli mathematician Aryeh Dvoretzky\n(1916\n-\n2008)\nand, working together, they solved a conjecture which had stood for twenty years. They proved:-\nAbsolute convergence is equivalent to unconditional convergence of series of points of a Banach space if and only if the space is finite-dimensional.\nThe result was published in their joint paper\nAbsolute and unconditional convergence in normed linear spaces\n(1950)\n.\nRogers married Joan Marion North\n(1920\n-\n1999)\n, the daughter of metallurgist Frank Wevil North and Gladys May Paybody, in\n1950\n. Joan North was an author of children's books; they had two daughters, Jane Nee Rogers born\n1955\nand Petra Nee Rogers born\n1956\n. Returning to his position at University College London, Rogers was awarded a D.Sc. in\n1952\n. At University College, Rogers was promoted to reader before he moved to Birmingham University in\n1954\nas the Mason Professor of Pure Mathematics\n[\n1\n]\n:-\nIn collaboration with\nGeoffrey Shephard\nand James Taylor during that period his interest in convex geometry and\nHausdorff\nMeasure Theory widened. In particular, with\nGeoffrey Shephard\n, he produced sharp bounds for the volume of a difference body, a problem which had been open for\n30\nyears.\nAfter four years in Birmingham, Rogers returned to London, this time as the Astor Professor of Mathematics at University College. He succeeded\nHarold Davenport\nas the Astor Professor of Mathematics who had moved to Cambridge in\n1958\n. His cousin and brother-in-law Jeremy North writes:-\nVisiting Jo and Ambrose in Gray Close, Hampstead, was always amazing. Ambrose had the largest desk piled high with totally incomprehensible research papers. Towards the end of his life he had to have a second desk which quickly became covered too. At the last Birthday party I attended there, the room was full of mathematical colleagues who might have been on a different planet. Over these occasions my sister presided invariably with a cold collage for lunch or a polite tea. Domestic considerations were never high on their agenda.\nRogers held this post until he retired in\n1986\n, when he became professor emeritus and remained at University College.\nRogers produced a remarkable mathematical output having published around\n180\npapers and books. As related above, his early work was on\nnumber theory\n, and he wrote on Diophantine inequalities and the geometry of numbers. Jointly with\nPaul Erdős\n, he wrote\nThe covering of n-dimensional space by spheres\n(1953)\nand\nCovering space with convex bodies\n(1961)\n, writing many other articles on coverings and packings including\nCovering space with equal spheres\nwith\nDonald Coxeter\n. His later work covered a wide range of different topics in geometry and analysis including\nBorel\nfunctions,\nHausdorff\nmeasure and local measure,\ntopological\nproperties of\nBanach spaces\nand upper semicontinuous functions. Rogers has written three important books,\nPacking and Covering\nin\n1964\n,\nHausdorff Measures\nin\n1970\n, and\n(\nwith John E Jayne\n)\nSelectors\n(2002)\n. Much of\nPacking and Covering\nwas written in\n1961\nwhile Rogers was spending a year in Canada at the University of British Columbia in Vancouver. The Publisher of the book,\nCambridge University Press\n, writes:-\nProfessor Rogers has written this economical and logical exposition of the theory of packing and covering at a time when the simplest general results are known and future progress seems likely to depend on detailed and complicated technical developments. The book treats mainly problems in\nn\nn\nn\n-dimensional space, where\nn\nn\nn\nis larger than\n3\n. The approach is quantitative and many estimates for packing and covering densities are obtained. The introduction gives a historical outline of the subject, stating results without proof, and the succeeding chapters contain a systematic account of the general results and their derivation. Some of the results have immediate applications in the theory of numbers, in analysis and in other branches of mathematics, while the quantitative approach may well prove to be of increasing importance for further developments.\nWe quote briefly from reviews of\nPacking and Covering\n. R P Bambah writes:-\nThis monograph, based on the work of the author and his collaborators, gives a very elegant and readable account of many important results in the theory of packings and coverings, lattice as well as non-lattice. The author has managed in most cases to include proofs of best known results without affecting the readability of this book, which is entirely self-contained.\nDonald Coxeter\nwrites\n[\n2\n]\n:-\nThis little book maintains the high standard of scholarly exposition which has distinguished the Cambridge Tracts for several generations.\nE A Maxwell\nwrites\n[\n3\n]\n:-\nThe style is brisk, clear and interesting, without any fuss, and I have no doubt at all that the book will be found a most valuable source of information in a very readable setting.\nEdwin Hewitt\n, reviewing\nHausdorff Measures\nwrites:-\nThis beautifully written and beautifully printed little book contains an astonishing amount of information. ... this book is a combination, unique as far as the reviewer knows, of pedagogy and description of an active if special field of analysis as it now exists. A bright student can pick up this book and read it by himself. When he has finished the book, he will be able to ask questions of his own and will also have a useful guide to the literature. Mature mathematicians who need facts about Hausdorff measures for their own purposes - surface theory, harmonic analysis, and so on - will find clear statements, clear proofs, and abundant references for further pursuit.\nHere is an extract from the authors' Preface to\nSelectors\n:-\nFor sometime we have thought that the theory of measurable selectors was somewhat lacking, in that one knows little about the topological properties of measurable functions. It is surprising that in very general circumstances upper semi-continuous set-valued maps do have selectors that, although not continuous, are of the first\nBaire\nclass; that is, are point-wise limits of sequences of continuous functions. In the book we are mainly concerned with proving results showing the existence of selections of the first\nBaire\nclass. We give a number of geometrically interesting examples, and some unexpected consequences for\nfunctional analysis\n.\nRogers wrote an obituary of\nHarold Davenport\nfor the\nLondon Mathematical Society\nwhich was published in\n1972\n, the year after Rogers wrote a survey of\nDavenport\n's work. He was one of the editors of\nThe collected works of Harold Davenport\npublished in four volumes in\n1977\n.\nRogers was elected a fellow of the\nRoyal Society\nin\n1959\nand served on the Council of the\nRoyal Society\nfor two spells, first from\n1966\nto\n1968\nand then again in\n1983\n-\n84\n. He also served as the\n55\nth\nPresident of the\nLondon Mathematical Society\nfrom\n1970\nto\n1972\nand was honoured with the award of the\nLondon Mathematical Society\n's Junior Berwick Prize in\n1957\nand the\nDe Morgan\nMedal in\n1977\n. An extract from the citation for the\nDe Morgan\nMedal reads:-\nIn the period after the Second World War, Rogers rapidly emerged in the forefront of the renaissance of the geometry of numbers. His work on the lattice constants of cylinders both convex and non-convex, on the reducibility of star bodies and on the implications for the existence of infinitely many lattice points in automorphic bodies, and on the successive minima of general sets with respect to a lattice remains definitive. Since about\n1958\n, Professor Rogers' main research interests moved to the theory of\nHausdorff\nmeasures, of analytic sets and of general convex bodies, to all of which he has made important contributions.\nHe was a plenary speaker at the British Mathematical Colloquium in\n1964\ngiving the lecture\nThe Brunn-Minkowski theorem and related inequalities\n. On two other occasions he was a specially invited morning speaker at the British Mathematical Colloquium, in\n1955\nand\n1984\n. He was also invited to address the special meeting of the\nMathematical Association\nto celebrate its centenary. He began his talk\nLength, area and volume\nas follows\n(\nsee\n[\n5\n]\n)\n:-\nI will discuss the elementary concepts of Length, Area and Volume from an advanced standpoint. Although my readers will have acquired a clear intuitive understanding of these basic geometric quantities, they may not realise that these quantities are very far from elementary. Many deep investigations have been necessary to refine the concepts and many basic problems remain with only inadequate answers."
}