{
  "nome_completo": "Andrey Nikolaevich Kolmogorov",
  "nome_curto": "Andrey Kolmogorov",
  "ano_nascimento": "1903",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kolmogorov/",
  "lugar_nascimento": "Tambov, Tambov province, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Andrei Nikolaevich Kolmogorov\n's parents were not married and his father took no part in his upbringing. His father Nikolai Kataev, the son of a priest, was an agriculturist who was exiled. He returned after the Revolution to head a Department in the Agricultural Ministry but died in fighting in\n1919\n. Kolmogorov's mother also, tragically, took no part in his upbringing since she died in childbirth at Kolmogorov's birth. His mother's sister, Vera Yakovlena, brought Kolmogorov up and he always had the deepest affection for her.\nIn fact it was chance that had Kolmogorov born in Tambov since the family had no connections with that place. Kolmogorov's mother had been on a journey from the Crimea back to her home in Tunoshna near Yaroslavl and it was in the home of his maternal grandfather in Tunoshna that Kolmogorov spent his youth. Kolmogorov's name came from his grandfather, Yakov Stepanovich Kolmogorov, and not from his own father. Yakov Stepanovich was from the nobility, a difficult status to have in Russia at this time, and there is certainly stories told that an illegal printing press was operated from his house.\nAfter Kolmogorov left school he worked for a while as a conductor on the railway. In his spare time he wrote a treatise on\nNewton\n's laws of mechanics. Then, in\n1920\n, Kolmogorov entered Moscow State University but at this stage he was far from committed to mathematics. He studied a number of subjects, for example in addition to mathematics he studied metallurgy and Russian history. Nor should it be thought that Russian history was merely a topic to fill out his course, indeed he wrote a serious scientific thesis on the owning of property in Novgorod in the\n15\nth\nand\n16\nth\ncenturies. There is an anecdote told by\nD G Kendall\nin\n[\n10\n]\nregarding this thesis, his teacher saying:-\nYou have supplied one proof of your thesis, and in the mathematics that you study this would perhaps suffice, but we historians prefer to have at least ten proofs.\nKolmogorov may have told this story as a joke but nevertheless jokes are only funny if there is some truth in them and undoubtedly this is the case here.\nIn mathematics Kolmogorov was influenced at an early stage by a number of outstanding mathematicians.\nP S Aleksandrov\nwas beginning his research\n(\nfor the second time\n)\nat Moscow around the time Kolmogorov began his undergraduate career.\nLuzin\nand\nEgorov\nwere running their impressive research group at this time which the students called 'Luzitania'. It included\nM Ya Suslin\nand\nP S Urysohn\n, in addition to\nAleksandrov\n. However the person who made the deepest impression on Kolmogorov at this time was\nStepanov\nwho lectured to him on trigonometric series.\nIt is remarkable that Kolmogorov, although only an undergraduate, began research and produced results of international importance at this stage. He had finished writing a paper on operations on sets by the spring of\n1922\nwhich was a major generalisation of results obtained by\nSuslin\n. By June of\n1922\nhe had constructed a summable function which diverged almost everywhere. This was wholly unexpected by the experts and Kolmogorov's name began to be known around the world. The authors of\n[\n7\n]\nand\n[\n8\n]\nnote that:-\nAlmost simultaneously\n[\nKolmogorov\n]\nexhibited his interest in a number of other areas of classical analysis: in problems of differentiation and integration, in measures of sets etc. In every one of his papers, dealing with such a variety of topics, he introduced an element of originality, a breadth of approach, and a depth of thought.\nKolmogorov graduated from Moscow State University in\n1925\nand began research under\nLuzin\n's supervision in that year. It is remarkable that Kolmogorov published eight papers in\n1925\n, all written while he was still an undergraduate. Another milestone occurred in\n1925\n, namely Kolmogorov's first paper on\nprobability\nappeared. This was published jointly with\nKhinchin\nand contains the 'three series' theorem as well as results on inequalities of partial sums of random variables which would become the basis for\nmartingale\ninequalities and the stochastic calculus.\nIn\n1929\nKolmogorov completed his doctorate. By this time he had\n18\npublications and\nKendall\nwrites in\n[\n10\n]\n:-\nThese included his versions of the strong law of large numbers and the law of the iterated logarithm, some generalisations of the operations of differentiation and integration, and a contribution to\nintuitional logic\n. His papers ... on this last topic are regarded with awe by specialists in the field. The Russian language edition of Kolmogorov's collected works contains a retrospective commentary on these papers which\n[\nKolmogorov\n]\nevidently regarded as marking an important development in his philosophical outlook.\nAn important event for Kolmogorov was his friendship with\nAleksandrov\nwhich began in the summer of\n1929\nwhen they spent three weeks together. On a trip starting from Yaroslavl, they went by boat down the Volga then across the Caucasus mountains to Lake Sevan in Armenia. There\nAleksandrov\nworked on the\ntopology\nbook which he co-authored with\nHopf\n, while Kolmogorov worked on\nMarkov\nprocesses with continuous states and continuous time. Kolmogorov's results from his work by the Lake were published in\n1931\nand mark the beginning of diffusion theory. In the summer of\n1931\nKolmogorov and\nAleksandrov\nmade another long trip. They visited Berlin, Göttingen, Munich, and Paris where Kolmogorov spent many hours in deep discussions with\nPaul Lévy\n. After this they spent a month at the seaside with\nFréchet\nKolmogorov was appointed a professor at Moscow University in\n1931\n. His monograph on probability theory\nGrundbegriffe der Wahrscheinlichkeitsrechnung\nⓉ\n(\nBasic concepts of probability theory\n)\npublished in\n1933\nbuilt up probability theory in a rigorous way from fundamental axioms in a way comparable with\nEuclid\n's treatment of geometry. One success of this approach is that it provides a rigorous definition of conditional expectation. As noted in\n[\n10\n]\n:-\nThe year\n1931\ncan be regarded as the beginning of the second creative stage in Kolmogorov's life. Broad general concepts advanced by him in various branched of mathematics are characteristic of this stage.\nAfter mentioning the highly significant paper\nAnalytic methods in probability theory\nwhich Kolmogorov published in\n1938\nlaying the foundations of the theory of\nMarkov\nrandom processes, they continue to describe:-\n... his ideas in set-theoretic topology, approximation theory, the theory of turbulent flow,\nfunctional analysis\n, the foundations of geometry, and the history and methodology of mathematics.\n[\nHis contributions to\n]\neach of these branches ...\n[\nis\n]\na single whole, where a serious advance in one field leads to a substantial enrichment of the others.\nAleksandrov\nand Kolmogorov bought a house in Komarovka, a small village outside Moscow, in\n1935\n. Many famous mathematicians visited Komarovka:\nHadamard\n,\nFréchet\n,\nBanach\n,\nHopf\n,\nKuratowski\n, and others.\nGnedenko\nand other graduate students went on\n(\n[\n7\n]\nand\n[\n8\n]\n)\n:-\n... mathematical outings\n[\nwhich\n]\nended in Komarovka, where Kolmogorov and\nAleksandrov\ntreated the whole company to dinner. Tired and full of mathematical ideas, happy from the consciousness that we had found out something which one cannot find in books, we would return in the evening to Moscow.\nAround this time\nMalcev\nand\nGelfand\nand others were graduate students of Kolmogorov along with\nGnedenko\nwho describes what it was like being supervised by Kolmogorov\n(\n[\n7\n]\nand\n[\n8\n]\n)\n:-\nThe time of their graduate studies remains for all of Kolmogorov's students an unforgettable period in their lives, full of high scientific and cultural strivings, outbursts of scientific progress and a dedication of all one's powers to the solutions of the problems of science. It is impossible to forget the wonderful walks on Sundays to which\n[\nKolmogorov\n]\ninvited all his own students\n(\ngraduates and undergraduates\n)\n, as well as the students of other supervisors. These outings in the environs of Bolshevo, Klyazma, and other places about\n30\n-\n35\nkilometres away, were full of discussions about the current problems of mathematics\n(\nand its applications\n)\n, as well as discussions about the questions of the progress of culture, especially painting, architecture and literature.\nIn\n1938\n-\n1939\na number of leading mathematicians from the Moscow University joined the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\nwhile retaining their positions at the University. Among them were\nAleksandrov\n,\nGelfand\n, Kolmogorov,\nPetrovsky\n, and\nKhinchin\n. The Department of Probability and Statistics was set up at the Institute and Kolmogorov was appointed as Head of Department.\nKolmogorov later extended his work to study the motion of the planets and the turbulent flow of air from a jet engine. In\n1941\nhe published two papers on turbulence which are of fundamental importance. In\n1954\nhe developed his work on\ndynamical systems\nin relation to planetary motion. He thus demonstrated the vital role of probability theory in physics.\nWe must mention just a few of the numerous other major contributions which Kolmogorov made in a whole range of different areas of mathematics. In topology Kolmogorov introduced the notion of\ncohomology groups\nat much the same time, and independently of,\nAlexander\n. In\n1934\nKolmogorov investigated chains, cochains,\nhomology\nand cohomology of a finite cell complex. In further papers, published in\n1936\n, Kolmogorov defined cohomology groups for an arbitrary locally compact topological space. Another contribution of the highest significance in this area was his definition of the cohomology ring which he announced at the International Topology Conference in Moscow in\n1935\n. At this conference both Kolmogorov and\nAlexander\nlectured on their independent work on cohomology.\nIn\n1953\nand\n1954\ntwo papers by Kolmogorov, each of four pages in length, appeared. These are on the theory of dynamical systems with applications to Hamiltonian dynamics. These papers mark the beginning of KAM-theory, which is named after Kolmogorov, Arnold and Moser. Kolmogorov addressed the International Congress of Mathematicians in Amsterdam in\n1954\non this topic with his important talk\nGeneral theory of dynamical systems and classical mechanics\n.\nN H Bingham\n[\n10\n]\nnotes Kolmogorov's major part in setting up the theory to answer the probability part of\nHilbert\n's Sixth Problem \"to treat ... by means of axioms those physical sciences in which mathematics plays an important part; in the first rank are the theory of probability and mechanics\" in his\n1933\nmonograph\nGrundbegriffe der Wahrscheinlichkeitsrechnung\nⓉ\n(\nBasic concepts of probability theory\n)\n. Bingham also notes:-\n...\nPaul Lévy\nwrites poignantly of his realisation, immediately on seeing the \"Grundbegriffe\", of the opportunity which he himself had neglected to take. A rather different perspective is supplied by the eloquent writings of\nMark Kac\non the struggles that Polish mathematicians of the calibre\nSteinhaus\nand himself had in the\n1930\ns, even armed with the \"Grundbegriffe\", to understand the\n(\napparently perspicuous\n)\nnotion of stochastic independence.\nIf Kolmogorov made a major contribution to\nHilbert\n's sixth problem, he completely solved\nHilbert\n's Thirteenth Problem in\n1957\nwhen he showed that\nHilbert\nwas wrong in asking for a proof that there exist continuous functions of three variables which could not be represented by continuous functions of two variables.\nKolmogorov took a special interest in a project to provide special education for gifted children\n[\n10\n]\n:-\nTo this school he devoted a major proportion of his time over many years, planning syllabuses, writing textbooks, spending a large number of teaching hours with the children themselves, introducing them to literature and music, joining in their recreations and taking them on hikes, excursions, and expeditions. ...\n[\nKolmogorov\n]\nsought to ensure for these children a broad and natural development of the personality, and it did not worry him if the children in his school did not become mathematicians. Whatever profession they ultimately followed, he would be content if their outlook remained broad and their curiosity unstifled. Indeed it must have been wonderful to belong to this extended family of\n[\nKolmogorov\n]\n.\nSuch an outstanding scientist as Kolmogorov naturally received a whole host of honours from many different countries. In\n1939\nhe was elected to the\nUSSR Academy of Sciences\n. He received one of the first State Prizes to be awarded in\n1941\n, the Lenin Prize in\n1965\n, the Order of Lenin on six separate occasions, and the\nLobachevsky\nPrize in\n1987\n. He was also elected to the many other academies and societies including the\nRomanian Academy of Sciences\n(1956)\n, the\nRoyal Statistical Society\nof London\n(1956)\n, the\nLeopoldina Academy of Germany\n(1959)\n, the\nAmerican Academy of Arts and Sciences\n(1959)\n, the\nLondon Mathematical Society\n(1959)\n, the American Philosophical Society\n(1961)\n, The Indian Statistical Institute\n(1962)\n, the\nRoyal Netherlands Academy of Sciences\n(1963)\n, the\nRoyal Society of London\n(1964)\n, the\nNational Academy of the United States\n(1967)\n, the\nFrench Academy of Sciences\n(1968)\n.\nIn addition to the prizes mentioned above, Kolmogorov was awarded the Balzan International Prize in\n1962\n. Many universities awarded him an honorary degree including Paris, Stockholm, and Warsaw.\nKolmogorov had many interests outside mathematics, in particular he was interested in the form and structure of the poetry of the Russian author Pushkin."
}