{
  "nome_completo": "Andrzej Tadeusz Alexiewicz",
  "nome_curto": "Andrzej Alexiewicz",
  "ano_nascimento": "1917",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alexiewicz/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Poznań, Poland",
  "biografia": "Andrzej Alexiewicz\nwas born in Lwów at a time when the city was at the centre of battles by the forces of Austria-Hungary, who had controlled the city for many years, and Russian forces. After World War I ended in\n1918\n, Ukrainian soldiers who had been part of the Austrian army tried to take over the city and make it part of Ukraine. However, after Poland was again recognised as an independent country with Lwów a major Polish city, Russian armies again attacked the city in\n1920\n. They were repelled and Lwów was recognised by the international community as part of Poland in March\n1923\n. The city quickly became an important Polish centre for learning and culture and it was in this atmosphere that Andrzej's education took place.\n(\nLwów is now Lviv in Ukraine.\n)\nHis parents were both medical doctors and were able to give their son a good education. He attended the Sixth Classical Grammar School in Lwów, graduating in\n1935\nat the age of eighteen.\nAfter graduating from High School, Alexiewicz began his studies at the Jan Kazimierz University in Lwów. It was the third largest of Poland's universities, having around\n6000\nstudents when Alexiewicz began to study there. After his first year of study,\n1935\n-\n36\n, during which he studied mathematics and physics, he concentrated exclusively on mathematics. He was taught by world-leading mathematicians such as Herman Auerbach\n(1901\n-\n1942)\n,\nStefan Banach\n,\nStefan Kaczmarz\n(1895\n-\n1939)\n,\nStanisław Mazur\n,\nWładysław Orlicz\n,\nJulius Schauder\n,\nHugo Steinhaus\n, and\nEustachy Żyliński\n(1889\n-\n1954)\n. This outstanding School of Mathematics in Lwów was about to be completely devastated by World War II. For example, Auerbach was Jewish and murdered by the Nazis in\n1942\n.\nKaczmarz\nalso died during the war. Some say he was murdered by the Russians, others say he was killed in fighting.\nŻyliński\n, however, who worked on number theory, algebra, logic and the foundations of mathematics, survived the war and taught in Gliwice from\n1946\nto\n1951\n. He was supervising Alexiewicz's Master's thesis when World War II started.\nŻyliński\nhad supervised\nWładysław Orlicz\n's doctoral thesis on orthogonal series and it was\nOrlicz\nwho became a friend, advisor and collaborator of Alexiewicz.\nAt the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack - the Germans from the west and the Russians from the east - quickly defeated the Polish army and Lwów was taken over by the Soviet Union. Although it was now under Soviet control, the university attempted to continue to operate as normally as possible despite many arrests and deportations carried out by the occupiers. This was not easy for, in the period from September\n1939\nto June\n1941\n, the Soviets murdered over a dozen of the Jan Kazimierz University faculty. In\n1941\nAlexiewicz was appointed as an assistant lecturer at the Lwów State University, but in June\n1941\nGermany attacked its former ally, the Soviet Union. On\n1\nJuly\n1941\nGerman troops entered Lwów and on the following day\n36\nprofessors who had worked at the university were arrested. All but one of the professors were shot by the Germans. The university could no longer operate, so Alexiewicz had to give up his position there.\nAfter the Germans occupied Lwów they ordered Rudolf Weigl to set up a vaccine production plant at his Institute in the city. Many people worked there, including many academics, Jews, and people in the Polish underground. Alexiewicz was one of the academics working there, but he also taught in an underground university, and continued to undertake research towards his doctorate.\nWładysław Orlicz\nwas his thesis advisor and in August\n1944\n, he defended his thesis\nOn sequences of operations\nbefore a committee consisting of his supervisor,\nWładysław Orlicz\n, the dean of mathematics and science at the underground Jan Kazimierz University, August Zierhoffer\n(1893\n-\n1969)\n, and the physicist, Jan Nikliborc\n(1902\n-\n91)\n. In fact, several years later, Alexiewicz submitted a two-part paper\nOn sequences of operations\nbased on his thesis to\nStudia Mathematica\nwhich was published in volume\n11\nin\n1949\n-\n50\n. It contains the following note:-\nPresented, with some minor differences, as a PhD thesis on\n10\nMarch\n1944\nin secret to the University of Lwów, during the terror of the German occupation.\nNow, as the war entered its final stages, Alexiewicz realised that Lwów would not remain a part of Poland when the war ended. By this time Alexiewicz was married with children; his son Władysław Alexiewicz, who became a famous physicist, was born in November\n1943\n.\nOrlicz\nhad been appointed to a chair at Poznań University in\n1937\nbut had been on holiday in Lwów when the war started. There had been no point in him returning to Poznań, as we explain below, so he had spent the war years in Lwów. Once the war ended, however, he could return to Poznań. This made Poznań a natural choice for Alexiewicz since he would remain a colleague of\nOrlicz\n. Together with his family, Alexiewicz arrived in Poznań on\n5\nMay\n1945\n.\nOrlicz\n, who held the chair of mathematics, and Alexiewicz then faced a major task rebuilding the department of mathematics at Poznań which had been completely destroyed during the war.\nIn fact the University of Poznań had been closed by the Germans in October\n1939\n, and many of the faculty were arrested. In\n1941\nthe Germans opened a new German University of Poznań, but it was not well received; it operated until\n1944\n. The reopened Polish University of Poznań, to which\nOrlicz\nand Alexiewicz were appointed, was a small institution with hardly any infrastructure and few teaching staff. Alexiewicz was awarded a doctorate in July\n1945\non the basis of his thesis which had been examined in Lwów. Over the next few years he had to work extremely hard, with an exceptionally heavy teaching and administrative load, to continue to undertake research which would allow his career to move forward. He submitted his\nhabilitation\nthesis\nOn the Denjoy integral of abstract functions\nto the University of Poznań in\n1948\nand became a\ndocent\nat the university. It is in this work that Alexiewicz introduced the 'Alexiewicz norm', which is an integral norm that makes a certain space of integrable functions into a topological vector space. In fact, because of the disruption caused by the war, his habilitation thesis was published before his doctoral thesis, but he had already a number of earlier publications such as:\n(\nwith\nW Orlicz\n)\nRemarque sur l'équation fonctionelle\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nf (x + y) = f (x) + f (y)\nf\n(\nx\n+\ny\n)\n=\nf\n(\nx\n)\n+\nf\n(\ny\n)\nⓉ\n(\nNote on the functional equation f\n(\nx + y\n)\n= f\n(\nx\n)\n+ f\n(\ny\n)\n)\n(1945)\n;\nLinear operations among bounded measurable functions I and II\n(1946)\n;\nOn Hausdorff classes\n(1947)\n;\nOn multiplication of infinite series\n(1948)\n; and\nLinear functionals on Denjoy-integrable functions\n(1948)\n.\nIn\n1953\nAlexiewicz was promoted to associate professor, becoming an ordinary professor in\n1961\nafter a reorganisation had taken place at the University of Poznań. In the academic year\n1961\n-\n62\nthe chair of mathematics at Poznań was divided into two: the Chair of Mathematics I, headed by\nOrlicz\nand the Chair of Mathematics II, headed by Alexiewicz. In\n1970\nthere was a major reorganisation of Polish universities. The affect of these changes on mathematics at Poznań was to combine the two Chairs of Mathematics with the Chair of Logic. A new Institute of Mathematics was created, its first head being Alexiewicz who held this position until he retired in\n1987\n.\nDuring his time at Poznań, Alexiewicz held a number of important positions in the university. From\n1951\nto\n1954\nhe served as associate dean of the Faculty of Mathematics, Physics and Chemistry, then serving as dean in\n1954\n-\n55\n. He was elected vice-rector of the Adam Mickiewicz University of Poznań serving in this role between\n1956\nand\n1959\n, a position where the candidate was chosen by popular vote among the academic community. We should also mention his work with the Poznań branch of the\nPolish Mathematical Society\n. He served as president of this branch for several years. In particular in\n1955\n-\n56\nhe, together with three of his colleagues, formed a regional Poznań committee of the Society to oversee the organisation of the Seventh Polish Mathematical Olympiad for secondary schools.\nWe have indicated above some of the mathematical areas that Alexiewicz worked on. Let us quote from\n[\n7\n]\nthe main areas of his research:-\nScalar and vector measurable functions; sequences of linear operators; the\nDenjoy\nintegral; differentiation of vector functions; differential equations and equations with vector functions; two norm spaces and two norm algebras and their applications in summability theory; analytic functions; and applications of functional analysis to classical problems of mathematical analysis.\nHe wrote two important Polish language texts:\nDifferential geometry\n(1966\n, second edition\n1970)\nand\nFunctional analysis\n(1969)\n. The second of these, the first major Polish text on functional analysis after\nStefan Banach\n's\nTeoria operacyj\n:-\n... presents the basic theory of\nBanach\nspaces, rich material on non-locally convex and non-measurable linearly topological spaces and numerous examples of applications of functional analysis.\nThe authors of\n[\n7\n]\nsum up his mathematical contributions as follows:-\nThe scientific output of Andrzej Alexiewicz indicates his immense creativity and intellectual power. It reveals his ability to understand the core of a problem, grasp the inter-relations and dependencies between different notions, and solve natural, well-motivated problems in a clear and elegant way.\nHowever, mathematics was not the only passion for Alexiewicz and his son Władysław writes in\n[\n3\n]\nabout his father's passion for painting and music:-\nArt played a special role in the life of Andrzej Alexiewicz. His greatest passions were mathematics, painting and music. He painted whenever he could. He would take his easel when going for walks outside Poznań, on holidays at the seaside or in the mountains, where he worked in unique places that he found. He often made sketches to fix colours and landscapes so that he was able to remember them later in his university office which he had partially converted into a studio. In his house, pictures on walls often changed but the most important place was always occupied by a beautifully framed large oil-landscape from Czarnohora, painted in\n1935\n. The painting presented the waterfall \"Huk\" in Kosmacz, one of the favourite places of professor Alexiewicz. The professor was especially fascinated with the continually changing colours of the sea and the sky, with conversations with curious tourists as he set up his easel on beaches in Mielno, Dziwnow or Kolobrzeg, and on family walks at sunrises and sunsets by the Baltic sea. He painted numerous views of the sky and sea-waves, often presented in abstract forms. He also fixed his vision of the world in many mountainous landscapes from the Eastern Carpathians, the Tatras, the Pieniny and California, and also in numerous pictures painted directly out of windows of his studio. In those last landscapes he showed unknown Poznań, its plants, the changeable lights and colours of seasons of the year in the city. ... Professor Andrzej Alexiewicz had a discerning musical taste. He appreciated classical symphonic music, especially compositions of Johann Sebastian Bach, whom he held to be the greatest composer. He often went to concerts with the whole family to the University hall. The professor especially enjoyed the famous film \"Amadeus\" by Milo Forman. He saw it many times, encouraged all his friends to see it and later asked about the number of visits in the cinema. After his seminars and lectures he often invited students to listen to music together in his office. He also listened to music while painting. Sometimes after an especially successful symphonic concert he would go to his studio, where he, touched by music, started to paint. He was always interested in the opinions of guests about his paintings. He was very glad when his studio was visited by painters and he could hold discussions with them."
}