{
  "nome_completo": "André Lichnerowicz",
  "nome_curto": "André Lichnerowicz",
  "ano_nascimento": "1915",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lichnerowicz/",
  "lugar_nascimento": "Bourbon-l'Archambault, Allier, France",
  "lugar_morte": "Paris, France",
  "biografia": "André Lichnerowicz\nhad a Polish name through his paternal grandfather who had fled from Poland to France in\n1860\n. At this time Poland was partitioned and he had been involved in the nationalist movement opposing Prussian rule. In France he married a woman from the Auvergne and their two children Jean Lichnerowicz, the father of André the subject of this biography, and his sister Jeanne Lichnerowicz achieved much. Jeanne became a well-known literary figure and achieved fame particularly through her translations of William Butler Yeats. Jean Lichnerowicz, André's father, received the\nagrégation\nin classics and went on to achieve fame in the literary world, becoming a professor of literature. Although Jean Lichnerowicz was an expert in the arts, he had quite an interest in mathematics which he had studied for his own enjoyment. André's mother had received her university education at the École Normale Supérieure de Jeunes Filles at Sèvres just outside Paris. She was awarded the agrégation in mathematics, being one of the first women to obtain this qualification, and went on to become a mathematics teacher. André, his parents' only son, was brought up in a home where learning and culture played a huge role. Conversations ranged from the ancient world to the modern world, and from ancient languages to modern languages. Science, in particular mathematics and physics, were given an equal standing and the young boy discussed mathematics frequently with his mother, but often too with his father who, as we noted above, had a love of the subject. At meal times, mathematics was often the topic of conversation around the table.\nWe have painted a picture of a rather idyllic childhood, but André had very poor health which made life very difficult for him. As he was growing up his heath was so poor that he missed school for two or three months each year. This, however, had its positive aspects as he explained in\n[\n22\n]\n:-\nI had very bad health, but this had its good side too. I was able to get into the habit of working and thinking alone, with the encouragement of my parents of course. One of these diseases was severe scarlet fever that left me completely deaf for a few years, two or three years. I remained completely deaf in one ear.\nOnce he was in secondary school, however, he knew that mathematics was the subject that he wanted to study more than any other. In every year he topped his class in mathematics. Perhaps at this point we should note that Lichnerowicz was known as André to his friends, but as Lichné to his students. However, for the rest of this biography we will refer to him as Lichnerowicz.\nLichnerowicz entered the École Normale Supérieure on Rue d'Ulm in\n1933\n. There he studied mathematics for three years and was strongly influenced by one of his teachers, the famous\nÉlie Cartan\n. He continued to study for his doctorate advised by\nGeorges Darmois\nand received the degree in\n1939\nfrom the Faculty of Science in Paris for his thesis\nProblèmes\nglobaux en mécanique relativiste\nⓉ\n(\nGlobal problems in relativistic mechanics\n)\n. His thesis was published under this title, and also under the title\nSur certains problèmes globaux relatifs au système des équations d'Einstein\nⓉ\n(\nOn some global issues relating to the system of the Einstein equations\n)\n.\nHoward Percy Robertson\nexplains in a review that the thesis:-\n... is devoted mainly to the discussion of two propositions concerning\ndifferential geometry\nin the large, the truth of which is held to be of fundamental importance for the relativistic theory of gravitation. ... Chapter I\n(\nAxiomatique de la théorie de la gravitation\nⓉ\n(\nAxiomatics of the theory of gravitation\n)\n)\n[\ngives\n]\nrelevant results on the initial value problem associated with the field equations of general relativity; most important for the sequel are those which deal with the continuation of an \"interior field,\" in a region containing matter, across a boundary into an \"exterior field\" in regions free of matter. Chapter II\n(\nEspaces-temps extérieurs réguliers partout\nⓉ\n(\nExternal regular space-time everywhere\n)\n)\ndeals with the simpler of the two fundamental propositions, according to which every such field must of necessity be Euclidean, subject to hypotheses concerning its asymptotic behaviour at large distances. ... Chapter III\n(\nSur les singularités du champ extérieur\nⓉ\n(\nOn the singularities of the external field\n)\n)\n... discusses the more difficult proposition: The introduction of matter into a given exterior field can only be accomplished in regions in which this field admits singularities. This he establishes, for fields of the types considered in the preceding chapter, with the aid of a further hypothesis concerning the quasistationary flow of the matter involved.\nWorld War II had begun on\n1\nSeptember\n1939\nwhen German forces entered Poland. On the following day, Britain, France and several other countries, declared war on Germany but over the following months France was not involved in any fighting, but spent time trying to build defences to protect the country from an invasion by Germany. In September\n1939\n, as part of these preparations, the inhabitants of Strasbourg had been evacuated and the University of Strasbourg was displaced to Clermont-Ferrand. The war changed dramatically for France on\n10\nMay\n1940\nwhen the German army crossed the Dutch and Belgium borders and, by June, France had surrendered and fighting had ended. However, the Germans regarded the university in Clermont-Ferrand as their particular enemy, because of the history of French and German periods of the University of Strasbourg from the time of the Franco-Prussian war in\n1870\n. Lichnerowicz was appointed as an assistant lecturer in mechanics at the University of Strasbourg, by then located in Clermont-Ferrand, in\n1941\n.\nIt was a period of extraordinary danger for Lichnerowicz as\nLaurent Schwartz\ndescribed in\n[\n3\n]\n:-\nOne day Lichnerowicz contrived to be in a police station and, while an officer was inattentive, he managed to borrow a stamp and apply it to a false identity card which he, himself, did not need, but which could save the life of a colleague or a student. To survive the war years in France with some honour was itself a great achievement.\nIn fact Lichnerowicz only just survived the war years. In November\n1943\nthe Germans carried out a raid on the University of Strasbourg, in Clermont-Ferrand, and they arrested Lichnerowicz. Somehow he managed to escape and survived the war. After the war ended in\n1945\n, the University of Strasbourg returned to the city of Strasbourg where Lichnerowicz continued to perform his duties. He had continued to work on relativity theory during the war and he spoke in\n[\n22\n]\nabout a particular problem from that time:-\nThere was a question that I began to think about when I was very young, it was in\n1939\n. With the German occupation, very few scientific papers were available; I realized that if one wanted relativity to work well, there was a fundamental question which arose. But in\n1944\n, during the occupation,\nEinstein\nwho was at Princeton and\nPauli\nwho was with him, had published a paper on the same question which gave results different from mine. They were not even comparable since they were deduced under two different assumptions, yet they gave the same conclusion that did not satisfy us. I corresponded with\nEinstein\nand\nPauli\nat that time. Neither what I had done before, nor what they had done, satisfied all three of us. Then, in\n1945\n, during a very cold winter, with little means of heating\n(\nI was a professor at Strasbourg at this time\n)\nsuddenly one Sunday, I said: \"Well, it will work like that.\" And I verified it. And in two hours, a problem that had troubled me, and had troubled much greater minds than mine, since\n1939\nhas been resolved, and that was complete satisfaction.\nThe physicist Georges Bruhat\n(1887\n-\n1945)\n, the father of\nYvonne Choquet-Bruhat\nand\nFrançois Bruhat\n, had been appointed as deputy director of the École Normale Supérieure in\n1935\nand held that position for most of the time that Lichnerowicz studied there. Bruhat understood the problems of teaching undergraduates in France because of a lack of up-to-date texts. He had suggested that what was needed was a series of books on mathematical physics. Lichnerowicz followed Bruhat's suggestion for the first of these books, and set about writing the textbook,\nAlgèbre et Analyse Linéaires\nⓉ\n(\nLinear Algebra and Analysis\n)\nbased on lectures he gave at Strasbourg. It was published in\n1947\nand reviewed by H Pollard:-\nWhile intended for physicists, this book is an extremely valuable introduction to linear mathematics for students of pure mathematics. The treatment is systematic and rigorous. It is divided into two parts, devoted to algebra and analysis, respectively. The first part treats linear equations, determinants and matrices, Hermitian forms, characteristic roots and resolvents, and tensor algebra. The second surveys the theory of exterior differential forms, the general form of\nStokes\n's theorem and its specialization to two and three dimensions, orthogonal series,\nFourier\nintegrals, bounded linear operators in\nHilbert\nspace, and the classical theory of integral equations for\nL\n2\nL^{2}\nL\n2\nintegrable kernels.\nAn English translation of this book was published in\n1967\nunder the title\nLinear Algebra and Analysis\n. E B Leach writes in a review\n[\n17\n]\n:-\nThe book succeeds admirably in its intention of making more modern mathematics accessible to physicists. It covers a great deal of territory, and does so clearly and rigorously. ... this is a valuable book for any physicist or young mathematician.\nIn\n1949\nLichnerowicz was named professor at the University of Paris, where he established the diploma Mathematical Methods in Physics. He published\nEléménts de Calcul Tensoriel\nⓉ\n(\nElements of tensor calculus\n)\n, which is an introduction to Riemannian geometry and its applications, in\n1950\n.\nHarold Ruse\nwrites in a review:-\nThe approach is that of\nÉlie Cartan\n, whose method of the \"repère mobile,\" satisfying in its naturalness, is applicable to more general types of geometry. Apart from its intrinsic merits, not the least of which is its simple and clear style, the book therefore provides a good introduction to the works of\nCartan\n...\nIn\n1952\nLichnerowicz was elected to a chair at the Collège de France which he continued to hold until he retired in\n1986\n. The first course he gave there in the academic year\n1952\n-\n53\nwas on the general theory of relativity. His lecture notes were published as\nÉtude mathématique des théories relativistes de la gravitation et de l'électromagnétisme. I. Relativité générale classique\nⓉ\n(\nMathematical study of relativistic theories of gravitation and electromagnetism. I. Classical General Relativity\n)\n(1953)\n.\nJohn Synge\nexplains in a review that Lichnerowicz believes:-\n... that general relativity, now nearly forty years old, has passed from theoretical into mathematical physics and should be treated with mathematical rigour like the theory of potential. In this spirit he presents relativity axiomatically, with much more attention to mathematical precision than has been customary and much less attention to its physical aspects.\nTwo years later he published\nThéories relativistes de la gravitation et de l'électromagnétisme. Relativité générale et théories unitaires\nⓉ\n(\nRelativistic theories of gravitation and electromagnetism: general relativity and unitary theories\n)\nwhich gives a rigorous mathematical treatment of more advanced topics in general relativity. In\n1957\nhe published an important text on differential geometry,\nThéorie globale des connexions et des groupes d'holonomie\nⓉ\n(\nComprehensive theory of connections and holonomy groups\n)\n. In the following year\nGéométrie des groupes de transformations\nⓉ\n(\nGeometry of transformation groups\n)\nappeared giving, in book form, the latest developments on transformation groups leaving differential-geometric objects invariant.\nWe have already said a little about Lichnerowicz's work on\nEinstein\n's theory of general relativity. He did important work on Riemannian geometry, in particular his results on the equivalence of various definitions of a Kähler manifold are now part of the standard theory. He put the theory of spinors into a rigorous setting and produced many important results in this area throughout his career. In\n1964\nhe posed a famous conjecture on differential geometry in his paper\nSur les transformations conformes d'une variété riemannienne compacte\nⓉ\n(\nOn conformal transformations of a Riemannian manifold\n)\n. In the\n1970\ns he worked on the geometric theory of dynamical systems writing papers such as\nVariétés symplectiques, variétés canoniques et systèmes dynamiques\nⓉ\n(\nSymplectic varieties, canonical varieties and dynamic systems\n)\n(1976)\n. In the late\n1970\ns and the\n1980\ns he worked on infinite dimensional\nLie\nalgebras writing important papers such as\nLes variétés de Poisson et leurs algèbres de Lie associées\nⓉ\n(\nPoisson varieties and their associated Lie algebra\n)\n(1977)\n,\nLes variétés de Jacobi et leurs algèbres de Lie associées\nⓉ\n(\nJacobi varieties and their associated Lie algebra\n)\n(1978)\nand\n(\nwith F Guédira\n)\nGéométrie des algèbres de Lie de Kirillov\nⓉ\n(\nThe geometry of Kirillov Lie algebras\n)\n(1984)\n. He made a selection of his own papers which he published as the book\nChoix d'œuvres mathématique\nⓉ\n(\nSpecial mathematical works\n)\n(1982)\n. The papers are divided into three sections: relativity theory, differential geometry, and infinite-dimensional\nLie algebras\n.\nIn\n[\n22\n]\nhe explained how he did research:-\n... you ask yourself a question, you worry about a problem. You start to work in an obvious way at a table with a piece of paper, but not for very long. The goal is out - more often the problem is a pretext - the goal is to find a method from it or to create mathematical entities which will shine in the network of mathematical knowledge. For a long time then you apparently do not work, but you are working all the time. That is to say, you laboriously end up by reaching a kind of trance which lasts three weeks, a month, when you think almost all the time about the same question and your thinking is not all the logical, that come later. You have acquired a kind of state, a mathematical universe, a state of direct understanding and you play with it indefinitely ... while you're walking, getting on a bus, etc. ... and that's the part that takes the longest. And then, at some point something clicks and you feel, before having any proof, you have made a major advance and then you return to your desk, you check and finally expose the things you have discovered to precise logic. But this is not the most essential part of the work - the most essential part of the work, both in time and in quality, is spent between both and usually without writing.\nLichnerowicz made important contributions to mathematics other than research. For example he was president of the\nFrench Mathematical Society\n(1959\n-\n60)\n, served on the Committee for Scientific Research and Technological Progress\n(1959\n-\n63)\n, chaired the Commission for the Reform of mathematics teaching in France\n(1966\n-\n73)\n, and chaired the Committee for the investigation of computer research\n(1973\n-\n76)\n.\nYvonne Choquet-Bruhat\n, who was Lichnerowicz's student in Paris, writes\n[\n6\n]\n:-\nAndré Lichnerowicz was an immensely cultured man, interested throughout his life in the most varied problems, scientific or philosophical, and in their impact on the world in which we live. His mind was brilliant, clear, rapid, and tirelessly active. A great intellectual, Lichnerowicz was also very human. He had a strong desire to communicate his ideas and a sure loyalty to his friends. Lichnerowicz considered himself responsible for everyone who had been his student, and he had many of them. He carried for them unfailing support, particularly when they had difficulties in their professional or private lives.\nIn\n1963\n, at the age of only\n48\n, Lichnerowicz was elected to the\nAcadémie des Sciences\nin Paris. Yvette Kosmann-Schwarzbach writes in\n[\n14\n]\n:-\nWhen Lichnerowicz was elected to the\nAcadémie des Sciences\nde Paris ... his students, as was customary, collected money to offer him his Academician's sword.\n(\nThe sword is the only part of the Academician's very elaborate uniform that reflects his or her personality and accomplishments.\n)\nBut two years later, for his fiftieth birthday, they contributed nearly as much to offer him something more to his taste, ...  a pipe! Indeed we could not imagine him without his pipe at any time ... except during his lectures when he would fill the blackboard with equations in his dense handwriting, equations almost always comprising many tensorial indices. It is a fact that he can be seen in every photograph ... with his pipe.\nLichnerowicz was married Susa and they had a son Jérôme Lichnerowicz. R Kerner writes in\n[\n13\n]\n(\nsimilar sentences appear in Jean-Pierre Bourguignon's article\n[\n6\n]\n)\n:-\nWith his wife Susa, who was born in Peru and taught Spanish in a Paris high school for many years, he formed an extremely interesting blend of different sensitivities. The two of them were sharp, remarkably cultivated, and open to many cultures. Nothing would escape their vigilance. An after-conference dinner with the Lichnerowicz couple\n(\nshe often accompanied him on his scientific trips\n)\nwas surely an enriching experience. André's knowledge of French history, literature and geography, of French food and wines paralleled his deep learning in mathematics, and he could entertain his neighbours at the table on any subject.\nLichnerowicz received many honours, in addition to election to the\nAcademy of Sciences\nwe mentioned above, including election to the\nPontifical Academy\nand the\nAccademia dei Lincei\n. He was awarded honorary degrees from several universities world-wide. We end this biography by quoting Lichnerowicz's words in\n1987\n, a year after he retired from teaching\n[\n18\n]\n:-\nA mathematician is first of all an artisan learning by throwing himself against his own spirit, a necessary humility. He dreams and is a bit of an artist ... I believe that if my neurophysiologist colleagues took electroencephalograms of mathematicians, they would discover no difference between those of a working mathematician and a composer of music. ... mathematics carries a form of witness of all that the spirit of humans have in common, since mathematics does not depend on a civilisation or a culture."
}