{
  "nome_completo": "Annie Louise MacKinnon Fitch",
  "nome_curto": "Annie Fitch MacKinnon",
  "ano_nascimento": "1868",
  "ano_morte": "1940",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacKinnon/",
  "lugar_nascimento": "Woodstock, Ontario, Canada",
  "lugar_morte": "Kirkland, Oneida County, New York, USA",
  "biografia": "Annie MacKinnon Fitch\nis known both as\nAnnie MacKinnon\nand by her married name of\nAnnie MacKinnon Fitch\n. Annie was the daughter of Malcolm MacKinnon\n(1838\n-\n1903)\nand Annie Louise Gilbert\n(1842\n-\n1919)\n. Malcolm MacKinnon, born\n12\nFebruary\n1838\nin Vaughan, Ontario, Canada, married Annie Gilbert on\n31\nDecember\n1863\nin Oxford, Ontario, Canada. Annie Gilbert had been born on\n11\nJuly\n1842\nin Toronto, Canada. Malcolm and Annie MacKinnon had five children: Gilbert J MacKinnon\n(1866\n-\n1877)\n, Annie Louise McKinnon\n(1868\n-\n1940)\n, the subject of this biography, Malcolm MacKinnon\n(1870\n-\n)\n, Frederick Benjamin Mackinnon\n(1872\n-\n)\n, and Donald Stanley MacKinnon\n(1879\n-\n1975)\n. The first two children were born in Ontario, Canada, but the family moved to Concordia, Kansas, USA in\n1869\nand their final three children were all born in Concordia. Malcolm MacKinnon declared his intention to become a naturalised American citizen on\n25\nJanuary\n1871\nand was naturalised on\n9\nJune\n1875\n. As his daughter, Annie also became a naturalised American on\n9\nJune\n1875\n. The\n1870\nUS census records Malcolm as a real estate agent, but in the\n1880\ncensus he is recorded as a hardware merchant.\nAnnie grew up in Concordia and was educated at Concordia High School. She graduated from the High School in\n1875\nand in that year began her studies at the University of Kansas in Lawrence, about\n40\nkm west of Kansas City. This university had only been opened in\n1866\nand the first class graduated in\n1873\n, only two years before MacKinnon began her studies there. The Chancellor of the University was John Fraser, a military general born in Cromarty, Scotland, who also taught mathematics at the University. MacKinnon majored in mathematics and graduated with a B.S. in\n1889\n; she then continued to undertake graduate work at the University. This meant that she was certainly the first woman graduate student in mathematics at the University of Kansas; only two men had enrolled as mathematics graduate students before her.\nWhile continuing to study for a Master's Degree, she was appointed as a mathematics teacher at Lawrence High School. This school had opened in\n1857\nin the basement of a Unitarian Church to serve the growing population of the city. Its first specially built building was completed in\n1865\n. MacKinnon was awarded a Master's Degree from the University of Kansas in\n1891\nand continued to teach at Lawrence High School for one further year while she undertook research at the University of Kansas advised by Henry Byron Newson\n(1860\n-\n1910)\n. Henry Newson had been appointed as a professor of mathematics at the University of Kansas one year before. He was working on the book\nContinuous groups of projective transformations treated synthetically\nwhich he published in\n1895\n. We note that Henry Newson married the mathematician\nMary Frances Winston\nin\n1900\n.\nMacKinnon spent one year as Henry Newson's student before she enrolled at Cornell University in October\n1892\nto undertake research for a Ph.D. advised by James Edward Oliver\n(1829\n-\n1895)\n. We quote the description of Oliver taken from\n[\n8\n]\n:-\nProfessor Oliver was born in Salem, Massachusetts, of Quaker parentage, in\n1829\n. He was the poet of the class of\n1849\nat Harvard, and the favourite pupil of Professor\nBenjamin Peirce\n, who always declared that \"Jimmy Oliver was the best mathematician who had ever come under his notice.\" As a teacher, Professor Oliver was thorough, painstaking, considerate, and, above all, inspiring by his wealth of suggestiveness and depth of intellectual insight. His methods in the classroom were very informal, and he seldom lost an opportunity of making a good joke, even when the joke was on himself. As he was happiest when the textbook could be laid aside and he could follow his own bent, it is possible that he did not always attain the best results with a miscellaneous class of undergraduates; but with an \"audience fit though few,\" he was wont to open up new vistas, sometimes forgetting the lapse of time in his enthusiasm. His publications are not numerous, for the drudgery of working up an article for permanent form was peculiarly irksome to him, especially after the freshness of discovery had passed away; and, during his best years, he had small leisure for writing, as he had then comparatively few assistants, and his recitation hours sometimes amounted to more than twenty in the week. His high original power was of the kind that shows itself not so much in published writings as in familiar classroom talks, and in the inspiration which they impart to others; and it is thus he would wish his name to live. As regards the silent influence of his life, there must be many hundreds of students and others who still derive inspiration from the memory of his high standards, and the rare beauty of his life and character with its unusual freedom from self-consciousness.\nMacKinnon was awarded the Erastus Brooks Fellowship for session\n1893\n-\n94\nand was awarded a Ph.D. in\n1894\nfor her thesis\nConcomitant Binary Forms in Terms of the Ro\nots. The paper\n[\n9\n]\n, published in the\nAnnals of Mathematics\n, is labelled:-\nDissertation presented to the Faculty of Cornell University in partial fulfilment of the requirements for the degree of Doctor of Philosophy.\nShe also presented for the degree, first - minor quantics and statics, and second - minor mathematical physics. In the thesis she thanks James McMahon\n(1856\n-\n1922)\nfor his help with the third chapter. McMahon was an Irish mathematician who had been awarded an A.B. from Dublin\n(1881)\n. He had sailed to New York in January\n1883\nand was an instructor at Cornell\n(1884\n-\n90)\n, and an assistant professor\n(1890\n-\n1904)\n, during the time MacKinnon studied for her Ph.D. He was appointed to a full professorship in\n1904\n.\nYou can read the Preface to MacKinnon's Ph.D. thesis, as presented in the paper\n[\n9\n]\n, at\nTHIS LINK\n.\nAn Association of Collegiate Alumnae European Fellowship funded MacKinnon for postdoctoral work at Göttingen in\n1894\n-\n95\nto be supervised by\nFelix Klein\n. This Fellowship had been set up in\n1889\n-\n90\nby a committee chaired by\nChristine Ladd-Franklin\n. They had raised\n500\ndollars for a European Fellowship to be awarded only for study abroad. In the following year\nRuth Gentry\nhad become the first mathematician to be awarded the Fellowship which had allowed her to study in Berlin. A Women's Education Association of Boston European Fellowship funded MacKinnon for a second year at Göttingen. The Women's Education Association of Boston had been founded in\n1871\nto promote better education for women, both in primary and secondary schools and in the field of higher education. It became a force for improving education for women both locally and nationally and one of its functions was the award of fellowships for female scholars in higher education from around the country.\nThree Americans who were studying at Göttingen at the same time as MacKinnon should be mentioned here. John H Tanner, who was awarded a B.S. in\n1891\n, had been an Instructor in Mathematics at Cornell in\n1892\n-\n94\n, the two years that MacKinnon was at Cornell, and was then two years at Göttingen, the same two years\n1894\n-\n96\nduring which MacKinnon studied there. He returned to Cornell in\n1896\nas an assistant professor. The second person to mention was\nMary Frances Winston\nwho was at Göttingen from\n1893\nto\n1996\nstudying for her Ph.D. She also had a year funded by an Association of Collegiate Alumnae European Fellowship. As we mentioned above, she later married Henry Newson who had been MacKinnon's advisor for a year. The third person who was at Göttingen at this time that we must mention was Edward Fitch, an assistant professor of Greek at Hamilton College, who was undertaking research for his doctorate. He later became MacKinnon's husband so we will give more details about him below.\nAfter she returned to the United States from the two years spent in Göttingen, MacKinnon was appointed Professor of Mathematics at Wells College in\n1896\n. This women's College had been founded in July\n1868\nin Aurora, New York by Henry Wells, the co-founder of Wells-Fargo. It was a small college and MacKinnon was the only member of the mathematics department, teaching the whole mathematics syllabus. She took on even more work when she was college registrar in\n1900\n-\n01\n.\nIn\n1897\nshe was one of the first women to join the\nAmerican Mathematical Society\n. See\nTHIS LINK\n.\nOn\n3\nJuly\n1901\nMacKinnon married Edward Fitch\n(1864\n-\n1946)\nin Lakeside, Ohio. Edward Fitch had been born on\n21\nMay\n1864\nto George William Fitch and Harriet Sinclair in Walton, New York. He was awarded an A.B. by Hamilton College in\n1886\nand a Ph.D. by Göttingen in\n1896\nfor his thesis\nDe Argonautarum Reditu Quaestiones Selectae\nⓉ\n(\nSelected Questions on the Return of the Argonauts\n)\n. He was Professor of Greek at Park College from\n1886\n-\n89\n, then Assistant Professor of Greek at Hamilton College from\n1889\n, promoted to Associate Professor of Greek in\n1899\n[\n3\n]\n:-\nHe devoted his life to teaching young men Greek at provincial Hamilton College in northern New York State. A graduate of the college, he always lived near it and is buried on its grounds. He had two great students, Benjamin D Meritt and the poet Ezra Pound. He published little, for he had no library and little time; but nothing that he published was foolish. He was a loyal man, loyal to Hamilton and loyal to his teacher Ulrich von Wilamowitz-Moellendorff.\nMacKinnon gave up her career when she married Edward Fitch\n[\n7\n]\n:-\nIn the late\n1920\ns, she reported to the American Association of University Women that \"after\n[\nher\n]\nmarriage\n[\nshe\n]\ncontinued upon mathematical investigations started some years before.\"\nNow MacKinnon only had two publications, both from work done for her Ph.D. The first contained the note, given after the references:-\nThe tables referred to in Part I, Chapter III, will be given in a future number of the 'Annals'.\nThese tables were published in the second paper\n[\n10\n]\npublished four years later. It states:-\nThis paper is supplementary to that which appeared in Nos.\n4\nand\n5\nof Vol. IX, and contains the Tables to which reference was made.\nTables of the irreducible Covariants and Invariants of the lower quantics including the Sextic, and of pairs of the first four quantics\n(\nincluding the linear quantic\n)\n.\nThe four year delay was the result of her two years in Göttingen and then her extremely heavy teaching and administrative duties at Wells College. While at Göttingen she had continued her research but she was not able to complete and publish it due to the heavy work at Wells. After her marriage, she did go back to this work but never published it.\nThe years of World War I, from\n1914\nto\n1918\n, were quite difficult ones for both Annie and her husband because of their strong German connections\n[\n3\n]\n:-\nFitch resisted the anti-German hysteria of World War I, typified by Paul Shorey and J A Scott. Rather, with men like B L Gildersleeve and W A Oldfather he defended German philology in reviews and in refutations of the excesses of the chauvinists. This earned him the gratitude of his teacher. Wilamowitz cited his dissertation with approval in the most influential book ever written on Hellenistic poetry: \"The American, E Fitch, earned his doctorate with a valuable dissertation and today is still a good friend of mine, perhaps the only one over there who really knows the Hellenistic poets.\"\nAnnie Fitch was active in promoting women\n[\n14\n]\n:-\nShe devoted much time and energy to encouraging women to take a public spirited interest in their local, state and national communities.\nWe also learn from\n[\n6\n]\n:-\nAnnie Fitch was a member of the League of Women Voters and was on the book committee of a nearby town library.\nShe continued her mathematical interests throughout her life\n[\n6\n]\n:-\nShe was a charter member of the\nMathematical Association of America\nand maintained that membership until her death at age seventy-two. She died at her home in Clinton, New York, after a long illness, having written to Helen Owens in May\n1940\n, a few months before her death: \"It seems to me worthwhile that some women are intelligent about things mathematical even if their own accomplishments are not great.\"\nWe note that we have given Kirkland, Oneida County, New York, as the place of Annie Fitch's death. This does not contradict the above quote since Kirkland, where the Fitchs lived, is in the Clinton area, as is Hamilton College. Annie Fitch was buried in Hamilton College Cemetery, Clinton. Her husband, Edward Fitch, died on\n15\nApril\n1946\n.\nThe New York Times\nreported:-\nCLINTON, N.Y., April\n15\n- Dr Edward Fitch, Edward North Professor Emeritus of Greek at Hamilton College and dean from\n1926\nto\n1932\n, died this morning in Walton, N.Y., where he had made his home in recent years. He had been ill for many months. His age was\n81\n.\nAnnie and Edward Fitch share a grave in Hamilton College Cemetery where Edward Fitch is described as \"Professor of Greek\" while Annie Fitch is described as \"His Wife.\"\nFollowing her death, the Annie L MacKinnon Scholarship was established by her husband Edward Fitch at Hamilton College with the stipulation that preference be given to a student whose record shows ability and interest in mathematics."
}