{
  "nome_completo": "Annie Jump Cannon",
  "nome_curto": "Annie Jump Cannon",
  "ano_nascimento": "1863",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cannon/",
  "lugar_nascimento": "Dover, Delaware, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "American astronomer\nAnnie Jump Cannon\nwas born on\n11\nDecember\n1863\nto parents Wilson Lee Cannon\n(1817\n-\n1905)\nand Mary Elizabeth Jump\n(1839\n-\n1893)\n. Wilson Cannon was a Delaware shipbuilder and state senator who had four children with his first wife Ann Scotten\n(1818\n-\n1859)\n, namely Henry White Cannon\n(\nborn\n1845)\n, Ella Cannon\n(\nborn about\n1847)\n, Mary Elizabeth Cannon\n(\nborn\n1850)\nand Hattie Hester Cannon\n(\nborn\n1856)\n. Annie, the subject of this biography, was the eldest of Wilson's three children with his second wife, Mary Jump, having two younger brothers, Wilson Lee Cannon\n(\nborn about\n1866)\nand Robert Barrett Cannon\n(\nborn about\n1869)\n. Mary Jump had a childhood interest in star-gazing and is credited with having initially inspired daughter Annie to pursue an interest in astronomy. Mary had also studied astronomy in a Quaker finishing school near Philadelphia.\nIt was with Mary's encouragement of the subject that Annie would, in the attic of their house using an old astronomy textbook, learn the constellations and identify stars. It would not be until\n1898\nthat she would discover her first star, and confirmation of it would not come until\n1905\n. It was also from her mother that Annie learnt household economics, something she would later put to use in the organisation of her research.\nAs a student from\n1877\nto\n1880\nat Wilmington Conference Academy\n(\nnow Wesley College\n)\nin Dover, Delaware, she showed promise, especially in mathematics. One of the first to enrol, from\n1880\nAnnie attended Wellesley College in Massachusetts, one of the top academic schools for women at the time.\nCecilia Payne-Gaposchkin\nwrites\n[\n17\n]\n:-\nNot long ago she was recalling those early days\n[\nat Wellesley College\n]\n, \"One might have expected the girls to be very serious and earnest,\" she said, \"but they always seemed to be laughing.\" And in that spirit she went through life, always endowing what seemed to many people to be an impossibly laborious and exacting occupation with joy and vitality.\nShe graduated in\n1884\nas the valedictorian with a degree in physics. Following the completion of her degree, she returned to Delaware for the following decade.\nIt was during this time that she developed her interest and skill at photography. She sailed to Spain in\n1892\nand there took photographs with her Kameret camera. For the\n1893\nChicago World's Columbian Exposition, her photographic work was published alongside her own prose in a pamphlet titled\nIn the footsteps of Columbus\n. Here is an extract from the pamphlet to illustrate Cannon's prose:-\nO Espana, home of the Cid, of Isabella the Catholic, of Columbus, thou hast charms no other land possesses! Thy Castilian valleys weave poetry into the plainest soul. Thy Andalusian mountains breathe romance and song into the very spirit. I am not an artist, but thy splendid sun has painted on my Blair films scenes more truthful than brush or pencil could portray, I am not a poet, but my Kamaret photographs sing thy praise better than song or sonnet.\nFor a longer extract from the pamphlet, see\nTHIS LINK\n.\nIt was not long after this that she was rendered almost deaf by a bout of scarlet fever. It was this disability that potentially held her career back in some areas, but may also have helped her in the long-run. It is believed that Raymond Pearl of John Hopkins would not vote her in as a member of the\nNational Academy of Sciences\non account of her being deaf. Thus a female astronomer was not elected to the Academy until\n1978\n. However, it is also thought that her deafness made it hard for her to socialise, leading her to a lifestyle whereby she could immerse herself in her work.\nShe neither married nor had any children. She credited her success to hard work and a lack of distractions\n[\n11\n]\n:-\nI deserve no particular credit; I have concentrated on my work - that is all. I find it so fascinating and absorbing that nothing else exists. The trouble with most women is they do not stick to their work. They marry and drop it. Mind, I believe marriage is a fine thing, if a woman marries the right man. But it should not stop a woman's work any more than it does a man's.\nWith the death of her mother in\n1893\n, life grew more difficult at home. Annie returned to Wellesley for graduate study in mathematics, physics and astronomy. Under the guidance of Professor Sarah Frances Whiting\n(1847\n-\n1927)\n, one of the few female physicists in the United States at the time, Annie gained an interest in the spectroscopic analysis of light. It was with this subject that she would spend the rest of her life.\nElectromagnetic radiation from a star is analysed by passing it through a prism or diffraction grating. It displays the rainbow of colours divided by spectral lines, each line indicating a particular chemical element. It is the strength of the line that dictates the abundance of that element in the star.\nTo advance her work, and access a better telescope, Cannon enrolled at Radcliffe College in Cambridge, Massachusetts as a 'special student'. Radcliffe was set up near Harvard College in order to allow the Radcliffe women to benefit from the addresses given by the Harvard professors, who would go over and repeat their lectures.\nFollowing her studies at Radcliffe, she was hired as an assistant to Edward C Pickering\n(1846\n-\n1919)\n, the newly elected director of the Harvard College Observatory. He had put Williamina P Fleming\n(1857\n-\n1911)\nin charge of hiring a staff of female assistants, so-called \"\nPickering's Women\n\". She added Annie to the team in\n1896\n. Between\n1885\nand\n1900\n, Fleming selected\n20\nassistants to sort through photographs of stellar spectra. The\nSecond Catalogue of Variable Stars\nwas produced by Annie Cannon and published in\n1907\nin the\nAnnals of the Astronomical Observatory at Harvard College\nas Volume\n55\nPart I. It states on the title page that it is \"by Annie J Cannon, Assistant in the Observatory, under the direction of Edward C Pickering, Director of the Observatory.\" For the Preface written by Edward Pickering, and an Extract of the Introduction by Annie Cannon, see\nTHIS LINK\n.\nAnnie and her work were highly praised by Pickering\n(\nquoted by many sources, for example\n[\n11\n]\n)\n:-\nMiss Cannon is the only person in the world - man or woman - who can do this work so quickly.\nWhen she first started classifying stellar spectra, she could classify\n1000\nstars in three years, but by\n1913\n, she was working on\n200\nan hour. The job at hand was to complete the Henry Draper Catalogue which had been started in\n1885\n. The Catalogue eventually gave spectroscopic classifications of\n225\n,\n300\nstars and was published between\n1918\nand\n1924\n. The goal was to map and define every star in the sky to a photographic magnitude of about\n9\n. In the first volume, published in\n1918\n, Pickering wrote:-\nThe classification of the spectra required for the Henry Draper Catalogue was begun by Miss Annie J Cannon on October\n2\n,\n1911\n, and practically completed September\n30\n,\n1915\n. Some additional spectra were taken from later plates, where faint stars had not been classified previously. The total number of spectra classified is\n242\n,\n093\n, relating to about\n222\n,\n000\nstars. The greater portion of the northern stars were classified from\n709\nplates taken with the\n8\n-inch Draper Telescope, mounted at Cambridge. In like manner,\n1\n,\n409\nplates of the southern stars were used, taken with the Bache Telescope, mounted at Arequipa, Peru.\nIt was here that Annie would conduct the work for which she would be remembered. Fleming had initially classified stellar spectra by letters from A to Q, according to the strength of their hydrogen spectral lines. Antonia Maury, another assistant working at the observatory, however used a scheme involving\n22\ngroups from I to XXII, further adding\n3\nsubdivisions based on the sharpness of spectral lines. Cannon saw an easier way. She simplified Fleming's scheme by removing and reordering some letters, to give the classes O, B, A, F, G, K, M. She also kept P for planetary nebula and Q for unusual stars. She also made use of Maury's numerical divisions, by introducing\n10\nsteps, from\n0\nto\n9\n.\nSoon it was realised that Cannon's scheme of stellar classification was based upon the stars' temperatures, where the ordering is from O the hottest to M the coolest, and it was established that it was a suitable method. Her spectral classifications were thus universally adopted from\n9\nMay\n1922\n, when the\nInternational Astronomical Union\npassed the decision. It was with this classification method that Cannon et al. were able to publish their\n9\nvolumes as the Henry Draper Catalogue. A further\n47\n,\n000\nadditional classifications were made for what was to become the Henry Draper Extension, in two volumes, published in\n1925\nand\n1949\n. With only minor adaptations, the method of classification Cannon implemented is still used today.\nIt was not long after she began her career that her work and work ethic were honoured. After finishing her studies at Wellesley in\n1907\n, receiving her masters, in\n1911\n, she succeeded Fleming as the Curator of Astronomical Photographs at Harvard, and in\n1914\nwas made an honorary member of the\nRoyal Astronomical Society\n. She became the first woman to receive an honorary doctorate from a European university: in\n1922\n, Groningen University in the Netherlands awarded her a doctor's degree in mathematics and astronomy. Soon after, she was awarded the first honorary doctorate to be given to a woman by Oxford University in England\n[\n22\n]\n:-\nFor hundreds of years, Oxford University has been giving honorary degrees to leading men in the fields of science and art, but for the first time, a woman was so honoured when the degree of Doctor of Science was conferred on Miss Annie Jump Cannon, of Harvard College Observatory, in recognition of a long series of valuable contributions to astronomy, chief of which is the completion of a catalogue of\n225\n,\n300\nstars - \"The Henry Draper Catalogue of Stellar Spectra.\" ... Miss Cannon sailed for Europe on June first and received the degree in person. She will visit astronomers in other parts of England and France and will attend the triennial meeting of the\nInternational Astronomical Union\nat Cambridge, England, in July. She is a member of the Union's International Committee on Spectral Classification.\nIn\n1931\n, the Henry Draper Medal was presented to her by the\nNational Academy of Sciences\n[\n14\n]\n:-\nOne of the most marked distinctions in the American astronomical world was recently conferred on Dr Annie Jump Cannon, of the Harvard College Observatory at a meeting of the\nNational Academy of Sciences\nin New Haven last November, when she was awarded the Henry Draper Medal for outstanding achievement in astronomical physics. Perhaps no single item of information about the stars finds its way into so many different aspects of astronomical research as does the knowledge of their spectra. In problems of distance, brightness, temperature, size, motions, distribution in space, variation, and physical structure, the spectrum of a star plays a revealing role. And it is to Miss Cannon's untiring work during the past thirty years that much of the present knowledge of stellar spectra owes its existence.\nIn the following year she was awarded the Ellen Richards Research Prize. She turned over this money to the American Astronomical Society allowing the establishment of the Annie Jump Cannon Award, a prize given to a female astronomer, within five years of her receiving her doctorate, for her distinguished contribution to astronomy. The first award was made in\n1934\n.\nShe became a member of the faculty at Harvard in\n1938\n, appointed as William Cranch Bond, Professor of Astronomy.\nHer list of achievements and career trajectory were certainly not common for a woman of her time. In this line of work, women rarely rose above the level of assistant, and many were only paid\n25\ncents an hour to work\n7\nhours a day for\n6\ndays a week. One of the other women working in the observatory who also made significant contributions was\nHenrietta Swan Leavitt\n, who, like Annie, was deaf.\nOther than her work in the observatory, Cannon played a major role in the development, and the gain in popularity, of astronomy. She helped broker partnerships and exchanges of equipment between men in the international community, assuming an ambassador-like role for astronomy. She wrote books and articles, increasing the field's status and went on to represent professional women at the World's Fair in Chicago.\nMoreover, she was a member of the National Women's Party, and in\n1929\n, the National League of Women voters listed her as one of the\n12\ngreatest living American women. She was one of the few women ever elected to the American Philosophical Society and was one of the first women to become an officer in the American Astronomical Society.\nCannon officially retired from the observatory in\n1940\n, but continued researching until her death the following year.\nHer contribution to astronomy is seen as invaluable, impacting on many other problems and areas of research. It helped progress the science of astronomy from one of simply observation to one of great theoretical and philosophical content. During her life, she discovered about\n300\nvariable stars,\n5\nnovae and\n1\nspectroscopic binary. She manually classified more stars in a lifetime than anyone else, with a grand total of about\n350\n,\n000\n. Not only was she very fast, but she was also accurate.\nOver a career of more than\n40\nyears, Annie not only boosted the reputation of astronomy, but also helped women gain acceptance and respect within the scientific community.\nShe died of heart failure following a month-long illness on\n13\nApril\n1941\nin Cambridge, Massachusetts aged\n77\n, having continued to work on astronomy until only a few weeks prior."
}