{
  "nome_completo": "Antiphon the Sophist",
  "nome_curto": "Antiphon",
  "ano_nascimento": "480 BC",
  "ano_morte": "411 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Antiphon/",
  "lugar_nascimento": "(possibly) Athens, Greece",
  "lugar_morte": "Athens, Greece",
  "biografia": "Antiphon\nwas an orator and statesman who took up\nrhetoric\nas a profession. He was a\nSophist\nand a contemporary of\nSocrates\n. These definite assertions are, however, disputed by some historians. The problem seems to revolve round whether there was one Sophist philosopher named Antiphon who lived around this time or whether there are two, or as some experts claim, three distinct Antiphons.\nIn what follows we shall assume that at least the orator named Antiphon was the same person as the Sophist who made the mathematical advances. This is the same line as taken in\n[\n1\n]\nwhile in\n[\n2\n]\nonly Antiphon as an orator is discussed without reference to the philosophical or mathematical works. In\n[\n7\n]\nthe hypothesis that Antiphon is one, or several different men is discussed without any definite view being preferred either way.\nA number of speeches which were written by Antiphon have been preserved. Three of these speeches were real speeches made by Antiphon as the prosecutor in murder trials. Twelve speeches are specimen speeches written by Antiphon for use in teaching students the skills of prosecuting and defending clients in cases. The speeches come as three collections of four; two prosecution speeches and two defence speeches for each of three different cases.\nAntiphon published a number of works on philosophy which have been lost except for a small number of fragments which have been discovered together with some quotations from the works in the writings of other authors. These works include\nOn Truth, On Concord, The Statesman\n, and\nOn Interpretation of Dreams\n. The work\nOn Truth\nis written to support the views of\nParmenides\nwho believed that there was a single sole reality and that the apparent world of many things was unreal. In this work Antiphon is defending the same philosophical ideas which\nZeno of Elea\nsupported with his paradoxes.\nIn\nOn Concord\nAntiphon\n[\n1\n]\n:-\n... defends the authority of the community as a safeguard against anarchy and recommends the ideals of concord and self-restraint both within communities and within the individual soul. Most probably he was only concerned to criticise the laws of a city by asking whether or not they satisfy the \"natural\" needs of the individual.\nHobbs in\n[\n7\n]\nnotes that:-\n... some have doubted whether the same man could have written \"On Truth\" and the conventional gnomic utterances of \"On Concord\".\nIn\n[\n7\n]\nthree reasons are given to support at least the same author for these two philosophical works:-\n(1)\n\"On Truth\" is not as radical as it appears, but simply a plea for legal reform\n;\n(2)\nits doctrines, although radical, are not endorsed by Antiphon\n;\n(3)\nAntiphon changed his mind\n.\nFinally while discussing which works were written by Antiphon it is worth remarking that some historians reject the idea that Antiphon wrote the two other works attributed to him\nThe Statesman\nand\nOn Interpretation of Dreams\n.\nAntiphon made an early and important contribution to mathematics when he made an attempt to\nsquare the circle\n. In doing so he became the first to propose a\nmethod of exhaustion\nalthough it is not entirely clear how well he understood his own proposal. He proposed successively doubling the number of sides of a regular polygon\ninscribed\nin a circle so that the difference in areas would eventually become exhausted.\nWe know of his work via\nAristotle\nand his commentators.\nAristotle\nclaims that a geometer only needs to show that false arguments are false if they are based on geometry, otherwise he can ignore them.\nAristotle\nwrites in his\nPhysics\n(\nsee for example\n[\n4\n]\n)\n:-\n... thus it is the geometer's business to refute the\nquadrature\nby means of segments, but it is not his business to refute that of Antiphon.\nIn case the reader is wondering what\nAristotle\nrefers to with his phrase 'quadrature by means of segments' then it is almost certain that he means the method of\nlunes\nof\nHippocrates\n.\nHowever\nSimplicius\nfailed to properly understand what Antiphon was doing. He thought that Antiphon was claiming to have squared the circle. He wrote\n(\ntranslation by\nHeath\ngiven in\n[\n4\n]\n)\n:-\nAntiphon thought that in this way the area of the circle would be used up, and we should some time have a polygon inscribed in the circle the sides of which, owing to their smallness, coincide with the circumference of the circle. And as we can make a square equal to any polygon ... we shall be in a position to make a square equal to a circle.\nHowever, according to\nHeath\n, this was not what Antiphon claimed\n[\n4\n]\n:-\nAntiphon therefore deserves an honourable place in the history of geometry as having originated the idea of exhausting an area by means of inscribed regular polygons with an ever increasing number of sides, an idea upon which ...\nEudoxus\nfounded his epoch-making method of exhaustion.\nKerferd in\n[\n1\n]\nsuggests that Antiphon may have regarded a circle as a polygon with a large number of sides:-\nIn modern times it has often been supposed that Antiphon was simply making a bad mistake in geometry by supposing that any approximation could ever amount to coincidence between a polygon with however many sides and a continuously curved circumference of a curved circle. ... This may not be the right view to take. Antiphon appears to have believed that complete coincidence could be achieved by his method ... This may mean that Antiphon regarded the circle as a polygon with a very large\n(\nor possibly infinite\n)\nnumber of sides.\nAntiphon was involved in an anti-democratic revolution which failed. Thucydides' in his famous\nHistory\nbelieves that Antiphon was the leader of the revolution\n[\n2\n]\n:-\n[\nAntiphon\n]\nconceived the whole matter and the means by which it was brought to pass.\nDespite his profession as a writer of defence speeches, his brilliant speech, described by Thucydides as:-\n... the greatest ever made by a man on trial for his life...\nfailed to save him when he was tried for treason and he was executed."
}