{
  "nome_completo": "Antoine Arnauld",
  "nome_curto": "Antoine Arnauld",
  "ano_nascimento": "1612",
  "ano_morte": "1694",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arnauld/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Brussels, Spanish Netherlands (now Belgium)",
  "biografia": "Antoine Arnauld\n, sometimes called\nThe Great Arnauld,\nwas the son of Antoine Arnauld senior\n(1560\n-\n1619)\nand Catherine Marie de Druy. Antoine Arnauld senior and his wife were the founders of a French family of the lesser nobility who became the leading Jansenist family of France.\nJansenists were followers of Cornelist Otto Jansen\n(1585\n-\n1638)\nwho led a Roman Catholic reform movement named after him. Jansen put forward his views in\nAugustinus\n(1640)\nwhich he based on the teachings of St Augustine, particularly St Augustine's arguments against Pelagius. Pelagius had argued that men can achieve salvation through their actions but Jansen argued that men cannot achieve salvation through their actions since it is predestined who Christ will lead to eternal life, the select few, and who are doomed to damnation, the multitude.\nAntoine Arnauld senior was a highly respected Parisian lawyer who with his wife Catherine Marie de Druy had twenty children, ten of whom survived to adulthood. Their oldest child was Robert, born in\n1588\n, while their youngest was Antoine Arnauld, the subject of this biography. When Antoine was born in\n1612\nhis eldest brother Robert was\n24\nyears old. In fact Antoine Arnauld senior died when his son Antoine was only seven years old. He had become famous when he defended the University of Paris against the Jesuits in\n1594\n. He was so successful in pleading the case that his speech was known as \"the original sin of the Arnaulds\" and considered by the Jesuits as the beginning of their battle against the Arnauld family who would later become Jansenists. Antoine Arnauld junior, the subject of this biography, would carry on his father's battle against the Jesuits.\nThe Arnauld family, already opposed to the Jesuits, became Jansenists through the influence of Jean Duvergier de Hauranne. He had studied with Jansen and became a strong supporter of Jansen's views before becoming abbot of Saint-Cyran in\n1620\n. Saint-Cyran, as he was known after this, got to know Robert Arnauld, Antoine's eldest brother, in the year he became abbot. Through the influence of Saint-Cyran nine of the ten Arnauld children, and many of their children, became staunch Jansenists. Saint-Cyran and the Arnauld family also strongly opposed the views of Cardinal Richelieu and Saint-Cyran was imprisoned from\n1638\nuntil Richelieu's death in\n1642\n.\nAntoine Arnauld, the subject of our biography, studied at the Collège Calvi, then at the Collège Lisieux at the Sorbonne. He received a bachelor's degree in\n1635\nand a doctorate in theology in\n1641\n, the same year in which he was ordained. He became closely associated with Saint-Cyran after his release from prison and he entered the Sorbonne in\n1643\n. Arnauld, with spiritual advice from Saint-Cyran, wrote\nOn Frequent Communion\nin\n1643\nand, in the same year,\nMoral Theology of the Jesuits\n. The first of these supported the Jansenists views on Holy Communion, while the second was an attack on the Jesuits. Supporting Jansen was already becoming dangerous since Pope Urban VIII had ordered Catholics not to read Jansen's\nAugustinus\nin\n1642\n. In\n1655\nArnauld supported the Jansenists in two pamphlets and again he was on dangerous ground since Pope Innocent X had condemned five propositions in the\nAugustinus\ntwo years earlier.\nArnauld called himself a follower of St Augustine, which of course was not unreasonable since Jansen had based his beliefs on those of St Augustine. However, the Jesuits called Arnauld a Jansenist and in\n1656\nafter heated theological arguments he was expelled from the Sorbonne for his Jansenist views. He spent some time living in the monastery Port-Royal des Champs but also spent periods in hiding both before and after his expulsion from the Sorbonne. We should explain that Port-Royal des Champs was a Jansenists monastery south of Versailles. The buildings fell into disrepair and the nuns moved to Paris in\n1626\nwhere they set up a another monastery called Port-Royal de Paris. Jacqueline-Marie-Angélique Arnauld, one of Antoine Arnauld's sisters, was the abbess at Port-Royal des Champs when the community moved to Paris and she continued to be abbess at Port-Royal de Paris. Arnauld's mother joined Port-Royal de Paris in\n1629\nwhere another of her daughters Jeanne-Catherine-Agnès Arnauld was twice abbess. In\n1638\nthe building of Port-Royal des Champs was occupied again by the Solitaires under the spiritual guidance of Saint-Cyran. The Solitaires were Jansenists and included several members of the Arnauld family. Robert Arnauld, Antoine Arnauld's eldest brother, entered Port-Royal des Champs in\n1644\n.\nOther important people were also converts to the Jansenists.\nPascal\nbecame acquainted with the Jansenists in\n1644\nand entered Port-Royal des Champs in January\n1655\n.\nPascal\nwrote a series of\n18\nletters now known as\nLes Provinciales\nduring the years\n1656\nand\n1657\nin defence of Arnauld. In these letters\nPascal\nattacked the moral teachings of the Jesuits which he saw as the weak point in their controversy with Port-Royal and Arnauld. The letters also supported the views that Arnauld had expressed in\nOn Frequent Communion\nin\n1643\nand, with\nPascal\n's support, these ideas would indeed eventually became accepted. The Jansenists, however, were persecuted between\n1661\nand\n1669\nand during this time Arnauld led the resistance to their persecutors. Alexander VII had become Pope in\n1655\nand he ordered bishops of France to make all of the priests, monks, and nuns sign a formulary condemning Jansen. When, in\n1665\n, the nuns at Port-Royal de Paris refused to sign they were sent to Port-Royal des Champs.\nIn fact although\nPascal\ndied in\n1662\n, his influence on Arnauld was clearly seen in the important works which he produced through the period that he led the resistance to the attacks on the Jansenists. He published\nPort-Royal Grammar\nin\n1660\nwhich was strongly influenced by\nDescartes\n'\nRegulae\n. In\nPort-Royal Grammar\nArnauld argued that mental processes and grammar are virtually the same thing. Since mental processes are carried out by all human beings, he argued for a universal grammar. Modern linguistic theorists consider this work as the beginnings of the modern approach their subject. Arnauld's next work was\nPort-Royal Logic\nwhich was another book of major importance. It was also strongly influenced by\nDescartes\n'\nRegulae\nand also gave a first hand account of Pascal's\nMéthode\n. This work presented a theory of ideas which remained important in philosophy courses until comparatively recent times. In\n1667\nArnauld published\nNew Elements of Geometry\n. This work was based on\nEuclid\n's\nElements\nand was intended to give a new approach to teaching geometry rather than new geometrical theorems. Nathan writes in\n[\n1\n]\n:-\nAs mathematics, it is characterised by the mastery of the contemporary literature and by its clear and fresh exposition ... If Arnauld's pedagogical concerns are insufficiently appreciated, it may be because the role of what are properly pedagogical concerns in the habits and 'methods' of modern science is insufficiently understood ...\nIt was not only the Pope who was opposed to Arnauld and the Jansenists. Louis XIV saw them as a threat to the unity of his kingdom and had also tried to eliminate them. However, in January\n1669\nPope Clement IX made an agreement, called the Peace of Clement IX, which suspended persecution of the Jansenists and Arnauld had ten years of relative peace. During this period there was a disagreement between Louis XIV and the Pope which meant that their attention was diverted from the Jansenists and Louis XIV saw a Catholic ally in Arnauld who turned his writings to attacking Calvinists rather than Jesuits. It was a period when Arnauld also found favour with Pope Clement XI who was particularly pleased with his writings on disputed areas between the Roman Catholic and Protestant Churches. Clement XI seemed about to make Arnauld a cardinal when the problem of the Jansenists came up again.\nIt was a result of the mending of relations between Louis XIV and the Pope which let them turn their attention again on the problem of the Jansenists and Louis XIV, wanting to see a united France, began to press for their elimination. Renewed persecution against the Port-Royal monastery led to Arnauld's self-imposed exile in\n1679\n. He went first to The Netherlands, then in\n1682\nhe took up permanent residence in Brussels where he spent the last\n12\nyears of his life.\nAlmost all his writings in the last part of his life were a consequence of his disagreements with\nNicolas Malebranche\n. In particular he attacked\nMalebranche\n's three volume treatise\nDe la recherche de la vérité\nⓉ\n(\nIn the search of truth\n)\n(1674\n-\n75)\n. Arnauld's criticisms led to a further publication by\nMalebranche\nin\n1680\n, but this work\nTraité de la nature et de la grâce\nwas not pleasing to the Catholic Church which banned it ten years later.\nArnauld corresponded with many of the leading mathematicians and scientists throughout his life and exerted quite a considerable influence. In particular early in his career he corresponded at great length with\nDescartes\nand then much later with\nLeibniz\n. Nathan writes in\n[\n1\n]\nthat Arnauld's:-\n... voluminous correspondence with\nDescartes\nand\nLeibniz\nand others bears witness to his own influence and acumen."
}