{
  "nome_completo": "Anzelm Iwanik",
  "nome_curto": "Anzelm Iwanik",
  "ano_nascimento": "1946",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iwanik/",
  "lugar_nascimento": "Tomaszów Mazowiecki, Poland",
  "lugar_morte": "Wrocław, Poland",
  "biografia": "Anzelm Iwanik\n's parents were Hipolit Iwanik, a chemical engineer, and Ludwika Lechowska who was a dentist. There were three children in the family, Anzelm being the youngest. Let us note at this point that his family and friends called him Anek; rather unusually, it was a nickname he chose himself. He completed his school education in\n1963\nand in the same year entered the Technical University of Wrocław. His main subject was electronics and, in\n1969\n, he was awarded a Master's degree in that topic. However before completing his degree in electronics he had already decided to make a move towards mathematics and he enrolled at Wrocław University in\n1968\nas an extramural student of mathematics. After the award of his Master's degree in electronics he was appointed to the Technical University of Wrocław as an assistant at the Institute of Electric Metrology. He continued to study mathematics at Wrocław University, his research being supervised by\nEdward Marczewski\n, while carrying out his duties as an assistant at the Technical University.\nIn\n1972\nIwanik was awarded a Master's degree in mathematics from Wrocław University for his thesis\nComplete algebras with infinite support\n. We give an indication of the contents.  A universal algebra  <\nA\n;\nF\nA ; F\nA\n;\nF\n> is said to be complete if each\nn\nn\nn\n-ary operation on\nA\nA\nA\ncan be obtained as a superposition of elements of\nF\nF\nF\n. Iwanik investigated algebras <\nA\n;\nF\nA ; F\nA\n;\nF\n> for which\nA\nA\nA\nis infinite and\nF\nF\nF\ncontains unary operations only. The question he tried to answer was the following: under what conditions does <\nA\n;\nF\n⋃\n{\ng\n}\nA ; F \\bigcup  \\{g\\}\nA\n;\nF\n⋃\n{\ng\n}\n>  become complete for a suitable binary operation\ng\ng\ng\n? He was able to give some sufficient conditions for this to happen and published two papers from the thesis, the first\nRemarks on infinite complete algebras\n(1972)\nstating the results and the second\nOn infinite complete algebras\ncontaining proofs. After the award of his Master's thesis in mathematics, which he was awarded with distinction, Iwanik moved from the Institute of Electric Metrology to the Institute of Mathematics remaining in the Technical University of Wrocław.\nWith Czeslaw Ryll-Nardzewski as advisor, Iwanik worked on his doctoral dissertation and after submitting his thesis\nPoint realizations of transformation semigroups\nhe was awarded his doctorate in\n1974\n. He submitted a dissertation\nExtreme operators on classical Banach spaces\nto the Scientific Council of the Institute of Mathematics of the\nPolish Academy of Sciences\nand was awarded an\nhabilitation\ndegree in\n1978\n. This thesis comprised the four papers\nMultiplicative operators on symmetric commutative algebras\n(1977)\n;\nExtreme contractions on certain function spaces\n(1978)\n;\nExtreme operators on AL-spaces\n(1979)\n; and\nWeak convergence and weighted averages for groups of operators\n(1979)\n. Iwanik was promoted to professor of mathematics at the Technical University of Wrocław in\n1990\n, and full professor in\n1996\n.\nWe have already looked at some of Iwanik's early work on universal algebra, semigroups, and the theory of operators on function spaces. By\n1980\nhe had again broadened his work publishing\nApproximation theorems for stochastic operators\nin that year. One of the results proves\n(\nin Iwanik's own words\n)\n:-\n... an analogue of the classical result of\nHalmos\non the residuality of ergodic transformations in the measure preserving invertible ones. Next it is shown that 'most' stochastic operators are conservative and ergodic; this can be viewed as an extension of a similar result obtained recently by J R Choksi and S Kakutani for invertible positive isometries.\nIn the same general area is Iwanik's work on\nMarkov\noperators published in papers such as\nOn pointwise convergence of Cesaro means and separation properties for Markov operators on\nC\n(\nX\n)\nC(X)\nC\n(\nX\n)\n(1981)\nand\nUnique ergodicity of irreducible Markov operators on\nC\n(\nX\n)\nC(X)\nC\n(\nX\n)\n(1984)\n. The authors of\n[\n2\n]\nwrite:-\nAnother important subject of Iwanik's research on\nMarkov\noperators is the phenomenon of multiple recurrence\n(\nor multi-recurrence, in more modern terminology\n)\n, i.e., recurrence of a point to its neighbourhood simultaneously under the action of several operators.\nAn example of one of his papers on that topic is\nMultiple recurrence for discrete time Markov processes\n(1987)\n.\nBy the time this last mentioned paper was published Iwanik was working on topological dynamics. Examples of papers he published on this topic are\n(\nwith J Mioduszewski\n)\nIndependence with respect to families of characters\n(1988)\n,\nPeriod structure for pointwise periodic isometries of continua\n(1988)\n, and\nIndependence and scrambled sets for chaotic mappings\n(1991)\n. Iwanik summarises this\n1991\npaper as follows:-\nA notion of independence is applied to obtain large scrambled sets for chaotic mappings of the interval. Under mixing conditions, scrambled sets are obtained as independent sets of transitive points. Thus several known results on scrambled sets are strengthened and simplified.\nThe authors of\n[\n2\n]\nwrite:-\nAmong the main achievements of Iwanik in topological dynamics is an application of the\nWeyl\npseudometric to the study of certain properties of\ndynamical systems\n, especially to the study of\nToeplitz\nflows.\nIwanik began working on another topic during the years that he was also working on topological dynamics, namely the spectral theory of measure-preserving transformations. A great deal of his work in this area involved studying Anzai skew products which had been introduced by H Anzai in\n1951\n. These are transformations\nT\nT\nT\non a\n2\n-torus satisfying\nT\n(\nx\n,\ny\n)\n=\n(\nx\n+\na\n,\ny\n+\nm\nx\n+\nf\n(\nx\n)\n)\nT(x, y) = (x + a, y + mx + f (x))\nT\n(\nx\n,\ny\n)\n=\n(\nx\n+\na\n,\ny\n+\nm\nx\n+\nf\n(\nx\n)\n)\nmod\n1\n,\nwhere\na\na\na\nis irrational,\nm\nm\nm\nis an integer and\nf\nf\nf\nis a real\n1\n-periodic continuous function.\nFor ten years Iwanik jointly ran a seminar at the Institute of Mathematics of the Technical University on ergodic theory. He was a co-organiser of two conferences on\nergodic theory\n, the first in\n1989\nand the second in\n1997\n. He was an enthusiastic participant in conferences world-wide and made numerous research visits\n[\n2\n]\n:-\nIn the\n70\ns and\n80\ns he held several visiting positions in the USA\n(\nCarbondale, Illinois; Fullerton, California\n)\nand Canada\n(\nMontreal\n)\n. In the\n90\ns he was a frequent guest at French universities\n(\nAix-Marseille I, Aix-Marseille II, Brest, Paris XIII, Rouen\n)\n.\nIwanik played an important role in seminars and on research visits\n[\n2\n]\n:-\nHe was able to quickly absorb new ideas; he made apt remarks and asked penetrating questions. He was an authority not only on matters of research; his opinions on other matters of scientific life were also held in great esteem in the mathematical community.\nIwanik was a talented teacher who made high demands of his students. In addition to his research and teaching, he played several different roles in the work of the Institute of Mathematics and, more generally, in mathematics in Poland, and although he carried out such tasks exceptionally well he did not actively look for administrative posts. For example he had two terms as Vice-Director of the Institute as well as serving as President of the Wrocław Branch of the Wrocław branch of the\nPolish Mathematical Society\nin\n1987\n-\n1989\n.\nAs to interests outside mathematics, these are noted in\n[\n2\n]\n:-\nAnek had many interests outside mathematics. He liked learning foreign languages; he was fluent in English and French, good at Russian, and well-read in the literature of those languages. He took pleasure in visiting museums, and was especially interested in paintings. He was a keen tourist; mountains and lakes attracted him most. Summer canoe wanderings were among his favourite ways of spending a holiday. He was also a good swimmer, and he enjoyed picking mushrooms and bird-watching."
}