{
  "nome_completo": "Aristotle",
  "nome_curto": "Aristotle",
  "ano_nascimento": "384 BC",
  "ano_morte": "322 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aristotle/",
  "lugar_nascimento": "Stagirus, Macedonia, Greece",
  "lugar_morte": "Chalcis, Euboea, Greece",
  "biografia": "Aristotle\nwas not primarily a mathematician but made important contributions by systematising deductive logic. He wrote on physical subjects: some parts of his\nAnalytica posteriora\nshow an unusual grasp of the mathematical method. Primarily, however, he is important in the development of all knowledge for, as the authors of\n[\n2\n]\nwrite:-\nAristotle, more than any other thinker, determined the orientation and the content of Western intellectual history. He was the author of a philosophical and scientific system that through the centuries became the support and vehicle for both medieval Christian and Islamic scholastic thought: until the end of the\n17\nth\ncentury, Western culture was Aristotelian. And, even after the intellectual revolutions of centuries to follow, Aristotelian concepts and ideas remained embedded in Western thinking.\nAristotle was born in Stagirus, or Stagira, or Stageirus, on the Chalcidic peninsula of northern Greece. His father was Nicomachus, a medical doctor, while his mother was named Phaestis. Nicomachus was certainly living in Chalcidice when Aristotle was born and he had probably been born in that region. Aristotle's mother, Phaestis, came from Chalcis in Euboea and her family owned property there.\nThere is little doubt that Nicomachus would have intended Aristotle to become a doctor, for the tradition was that medical skills were kept secret and handed down from father to son. It was not a society where people visited a doctor but rather it was the doctors who travelled round the country tending to the sick. Although we know nothing of Aristotle's early years it is highly likely that he would have accompanied his father in his travels. We do know that Nicomachus found the conditions in Chalcidice less satisfactory than in the neighbouring state of Macedonia and he began to work there with so much success that he was soon appointed as the personal physician to Amyntas III, king of Macedonia.\nThere is no record to indicate whether Aristotle lived with his father in Pella, the capital of Macedonia, while Nicomachus attended to king Amyntas at the court there. However, Aristotle was certainly friendly with Philip, king Amyntas's son, some years later and it seems reasonable to assume that the two, who were almost exactly the same age, had become friendly in Pella as young children.\nWhen Aristotle was about ten years old his father died. This certainly meant that Aristotle could not now follow in his father's profession of doctor and, since his mother seems also to have died young, Aristotle was brought up by a guardian, Proxenus of Atarneus, who was his uncle\n(\nor possibly a family friend as is suggested by some authors\n)\n. Proxenus taught Aristotle Greek,\nrhetoric\n, and poetry which complemented the biological teachings that Nicomachus had given Aristotle as part of training his son in medicine. Since in latter life Aristotle wrote fine Greek prose, this too must have been part of his early education.\nIn\n367\nBC Aristotle, at the age of seventeen, became a student at\nPlato's Academy\nin Athens. At the time that Aristotle joined the\nAcademy\nit had been operating for twenty years.\nPlato\nwas not in Athens, but rather he was on his first visit to Syracuse. We should not think of\nPlato's Academy\nas a non-political organisation only interested in abstract ideas. The\nAcademy\nwas highly involved in the politics of the time, in fact\nPlato\n's visit to Sicily was for political reasons, and the politics of the\nAcademy\nand of the whole region would play a major role in influencing the course of Aristotle's life.\nWhen Aristotle arrived in Athens, the\nAcademy\nwas being run by\nEudoxus\nof Cnidos in Plato's absence.\nSpeusippus\n, Plato's nephew, was also teaching at the\nAcademy\nas was\nXenocrates\nof Chalcedon. After being a student, Aristotle soon became a teacher at the\nAcademy\nand he was to remain there for twenty years. We know little regarding what Aristotle taught at the\nAcademy\n. In\n[\n10\n]\nDiogenes Laertius\n, writing in the second century AD, says that Aristotle taught rhetoric and\ndialectic\n. Certainly Aristotle wrote on rhetoric at this time, issuing\nGryllus\nwhich attacked the views on rhetoric of Isocrates, who ran another major educational establishment in Athens. All Aristotle's writings of this time strongly support\nPlato\n's views and those of the\nAcademy\n.\nTowards the end of Aristotle's twenty years at the\nAcademy\nhis position became difficult due to the political events of the time. Amyntas, the king of Macedonia, died around\n369\nBC, a couple of years before Aristotle went to Athens to join the\nAcademy\n. Two of Amyntas's sons, Alexander II and Perdiccas III, each reigned Macedonia for a time but the kingdom suffered from both internal disputes and external wars. In\n359\nBC Amyntas's third son, Philip II came to the throne when Perdiccas was killed fighting off an Illyrian invasion. Philip used skilful tactics, both military and political, to allow Macedonia a period of internal peace in which they expanded by victories over the surrounding areas.\nPhilip captured Olynthus and annexed Chalcidice in\n348\nBC. Stagirus, the town of Aristotle's birth, held out for a while but was also defeated by Philip. Athens worried about the powerful threatening forces of Macedonia, and yet Aristotle had been brought up at the Court of Macedonia and had probably retained his friendship with Philip. The actual order of events is now a little uncertain.\nPlato\ndied in\n347\nBC and Speusippus assumed the leadership of the\nAcademy\n. Aristotle was certainly opposed to the views of Speusippus and he may have left the\nAcademy\nfollowing\nPlato\n's death for academic reasons or because he failed to be named head of the\nAcademy\nhimself. Some sources, however, suggest that he may have left for political reasons before\nPlato\ndied because of his unpopularity due to his Macedonian links.\nAristotle travelled from Athens to Assos which faces the island of Lesbos. He was not alone in leaving the\nAcademy\nfor\nXenocrates\nof Chalcedon left with him. In Assos Aristotle was received by the ruler Hermias of Atarneus with much acclaim. It is likely that Aristotle was acting as an ambassador for Philip and he certainly was treated as such by Hermias. Aristotle married Pythias, the niece and adopted daughter of Hermias, and they had one child, a daughter also called Pythias. However, Aristotle's wife died about\n10\nyears after their marriage. It is thought that she was much younger than Aristotle, being probably of age of about\n18\nwhen they married.\nOn Assos, Aristotle became the leader of the group of philosophers which Hermias had gathered there. It is possible that\nXenocrates\nwas also a member of the group for a time. Aristotle had a strong interest in anatomy and the structure of living things in general, an interest which his father had fostered in him in his early years, that helped him to develop a remarkable talent for observation. Aristotle and the members of his group began to collect observations while in Assos, in particular in zoology and biology. Barnes writes in\n[\n6\n]\nthat Aristotle's:-\n... studies on animals laid the foundations of the biological sciences; and they were not superseded until more than two thousand years after his death. The enquiries upon which those great works were based were probably carried out largely in Assos and Lesbos.\nAristotle probably begun his work\nPolitics\non Assos as well as\nOn Kingship\nwhich is now lost. He began to develop a philosophy distinct from that of\nPlato\nwho had said the kings should be philosophers and philosophers kings. In\nOn Kingship\nAristotle wrote that it is:-\n... not merely unnecessary for a king to be a philosopher, but even a disadvantage. Rather a king should take the advice of true philosophers. Then he would fill his reign with good deeds, not with good words.\nHowever, Aristotle's time in Assos was ended by political events. The Persians attacked the town and Hermias was captured and executed. Aristotle escaped and stopped on the island of Lesbos on his way to Macedonia. It was more than a passing visit for he remained there for about a year and must have had the group of scientists from Assos with him for they continued their biological researches there.\nMacedonia was now at peace with Athens, for Philip had made a treaty in\n346\nBC. In\n343\nBC Aristotle reached the Court of Macedonia and he was to remain there for seven years. The often quoted story that he became tutor to the young\nAlexander the Great\n, the son of Philip, is almost certainly a later invention as was pointed out by Jaeger, see\n[\n16\n]\n. Grayeff in\n[\n12\n]\nsuggests that Philip saw in Aristotle a future head of the\nAcademy\nin Athens. Certainly this would have suited Philip well for Speusippus, the then head of the\nAcademy\n, was strongly opposed to Philip and strongly encouraging Athens to oppose the rise of Macedonia.\nThe treaty between Athens and Macedonia began to fall apart in\n340\nBC and preparations for war began. The following year Speusippus died but Aristotle, although proposed as head of the\nAcademy\n, was not elected. The position went to\nXenocrates\nand Philip lost interest in his support for Aristotle. He moved back to his home in Stagirus and took with him to Stagirus his circle of philosophers and scientists.\nAristotle did not marry again after the death of his wife but he did form a relationship with Herpyllis, who came from his home town of Stagirus. It is not clear when they first met but together they had a son, Nicomachus, named after Aristotle's father.\nPhilip was now at the height of his power but, as so often happens, that proved the time for internal disputes. Aristotle supported Alexander, Philip's son who soon became king. Alexander decided on a policy similar to his father in regard to Athens and sought to assert his power by peaceful means. Alexander protected the\nAcademy\nand encouraged it to continue with its work. At the same time, however, he sent Aristotle to Athens to found a rival establishment.\nIn\n335\nBC Aristotle founded his own school the Lyceum in Athens. He arrived in the city with assistants to staff the school and a large range of teaching materials he had gathered while in Macedonia; books, maps, and other teaching material which may well have been intended at one stage to support Aristotle in his bid to become head of the\nAcademy\n. The Academy had always been narrow in its interests but the Lyceum under Aristotle pursued a broader range of subjects. Prominence was given by Aristotle to the detailed study of nature and in this and all the other subjects he studied\n[\n6\n]\n:-\nHis own researches were carried out in company, and he communicated his thoughts to his friends and pupils, never thinking to retain them as a private treasure-store. He thought, indeed, that a man could not claim to know a subject unless he was capable of transmitting his knowledge to others, and he regarded teaching as the proper manifestation of knowledge.\nWhether the works that come down to us are due to Aristotle or to later members of his school was questioned by a number of scholars towards the end of the\n19\nth\ncentury. The reasons are discussed by Jaeger\n[\n16\n]\n, but in this work Jaeger argues that the apparent differences in the approach by Aristotle in different works can be explained by his ideas developing over a number of years. Grayeff\n[\n6\n]\nexamines certain texts in detail and again claims that they represent developments in the ideas of Aristotle's school long after his death. He writes:-\nAccording to a tradition which arose about two hundred and fifty years after his death, which then became dominant and even today is hardly disputed, Aristotle in these same years lectured - not once, but two or three times, in almost every subject - on logic, physics, astronomy, meteorology, zoology,\nmetaphysics\n, theology, psychology, politics, economics,\nethics\n, rhetoric, poetics; and that he wrote down these lectures, expanding them and amending them several times, until they reached the stage in which we read them. However, still more astounding is the fact that the majority of these subjects did not exist as such before him, so that he would have been the first to conceive of and establish them, as systematic disciplines.\nAfter the death of Alexander the Great in\n323\nBC, anti-Macedonian feeling in Athens made Aristotle retire to Chalcis where he lived in the house which had once belonged to his mother and was still retained by the family. He died the following year from a stomach complaint at the age of\n62\n.\nIt is virtually impossible to give an impression of Aristotle's personality with any certainty but the authors of\n[\n2\n]\nwrite:-\nThe anecdotes related of him reveal him as a kindly, affectionate character, and they show barely any trace of the self-importance that some scholars think they can detect in his works. His will, which has been preserved, exhibits the same kindly traits; he makes references to his happy family life and takes solicitous care of his children, as well as his servants.\nBarnes\n[\n6\n]\nwrites:-\nHe was a bit of a dandy, wearing rings on his fingers and cutting his hair fashionably short. He suffered from poor digestion, and is said to have been spindle-shanked. He was a good speaker, lucid in his lectures, persuasive in conversation; and he had a mordant wit. His enemies, who were numerous, made him out to be arrogant and overbearing. ... As a man he was, I suspect, admirable rather than amiable.\nWe have commented above on the disputes among modern scholars as to whether Aristotle wrote the treatises now assigned to him. We do know that his work falls into two distinct parts, namely works which he published during his lifetime and are now lost\n(\nalthough some fragments survive in quotations in works by others\n)\n, and the collection of writings which have come down to us and were not published by Aristotle in his lifetime. We can say with certainty that Aristotle never intended these\n30\nworks which fill over\n2000\nprinted pages to be published. They are certainly lecture notes from the courses given at the Lyceum either being, as most scholars believe, the work of Aristotle, or of later lecturers. Of course it is distinctly possible that they are notes of courses originally given by Aristotle but later added to by other lecturers after Aristotle's death.\nThe works were first published in about\n60\nBC by Andronicus of Rhodes, the last head of the Lyceum. Certainly\n[\n2\n]\n:-\nThe form, titles, and order of Aristotle's texts that are studied today were given to them by Andronicus almost three centuries after the philosopher's death, and the long history of commentary upon them began at this stage.\nWhat do these works contain? There are important works on logic. Aristotle believed that logic was not a science but rather had to be treated before the study of every branch of knowledge. Aristotle's name for logic was \"analytics\", the term logic being introduced by\nXenocrates\nworking at the\nAcademy\n. Aristotle believed that logic must be applied to the sciences\n[\n6\n]\n:-\nThe sciences - at any rate the theoretical sciences - are to be axiomatised. What, then, are their axioms to be? What conditions must a proposition satisfy to count as an axiom? again, what form will the derivations within each science take? By what rules will theorems be deduced from axioms? Those are among the questions which Aristotle poses in his logical writings, and in particular in the works known as Prior and Posterior Analytics.\nIn fact in\nPrior Analytics\nAristotle proposed the now famous Aristotelian syllogistic, a form of argument consisting of two premises and a conclusion. His example is:-\n(\ni\n)\nEvery Greek is a person\n.\n(\nii\n)\nEvery person is mortal\n.\n(\niii\n)\nEvery Greek is mortal\n.\nAristotle was not the first to suggest axiom systems.\nPlato\nhad made the bold suggestion that there might be a single axiom system to embrace all knowledge. Aristotle went for the somewhat more possible suggestion of an axiom system for each science. Notice that\nEuclid\nand his axiom system for geometry came after Aristotle.\nAnother topic to which Aristotle made major contributions was natural philosophy or rather physics by today's terminology.\n(\nI\n[\nEFR\n]\nshow my age and the traditional nature of St Andrews University if I remark that in the\n1960\ns a pass in 'General Natural Philosophy' formed part of my degree.\n)\nAristotle looks at matter, change, movement, space, position, and time. He also made contributions to the study of astronomy where in particular he studied comets, geography with an examination of features such as rivers\n)\n, chemistry where he was interested in processes such as burning, as well as meteorology and the study of rainbows.\nAs well as important works on zoology and psychology, Aristotle wrote his famous work on metaphysics. This, according to Aristotle, studies\n[\n2\n]\n:-\n... the most general or abstract features of reality and the principles that have universal validity. ... metaphysics studies whatever must be true of all existent things just insofar as they exist,\n[\nand\n]\nit studies the general conditions which any existing thing must satisfy.\nAlthough Aristotle does not appear to have made any new discoveries in mathematics, he is important in the development of mathematics. As Heath explains in\n[\n14\n]\n:-\nThe importance of a proper understanding of the mathematics in Aristotle lies principally in the fact that most of his illustrations of scientific method are taken from mathematics.\nClearly Aristotle had a thorough grasp of elementary mathematics and believed mathematics to have great importance as one of three theoretical sciences. However, it is fair to say that he did not agree with\nPlato\n, who elevated mathematics to such a prominent place of study that there was little room for the range of sciences studied by Aristotle. The other two theoretical sciences, Aristotle claimed, were\n(\nusing modern terminology\n)\nphilosophy and theoretical physics.\nHeath\nnotes in the introduction to\n[\n14\n]\nsome of the mathematics referred to by Aristotle in his works:-\n... Aristotle was aware of the important discoveries of\nEudoxus\nwhich affected profoundly the exposition of the Elements by\nEuclid\n. One allusion clearly shows that Aristotle knew of\nEudoxus\n's great Theory of Proportion which was expounded by\nEuclid\nin his Book V, and recognised the importance of it. Another passage recalls the fundamental assumption on which\nEudoxus\nbased his '\nmethod of exhaustion\n' for measuring areas and volumes; and, of course, Aristotle was familiar with the system of\nconcentric spheres\nby which\nEudoxus\nand\nCallippus\naccounted theoretically for the independent motions of the sun, moon, and planets. ...\nThe\nincommensurable\nis mentioned over and over again, but the case mentioned is that of the diagonal of a square in relation to its side; there is no allusion to the extension of the theory to other cases by\nTheodorus\nand\nTheaetetus\n...\nHeath\n[\n14\n]\nalso mentions the mathematics which Aristotle, perhaps surprising, does not refer to. There is:-\n... no allusion to\nconic sections\n, to the\ndoubling of the cube\n, or to the\ntrisection of an angle\n. The problem of\nsquaring the circle\nis mentioned in connection with the attempts of\nAntiphon\n,\nBryson\n, and\nHippocrates\nto solve it; but there is nothing about the curve of\nHippias\n...\nWhile\nHeath\n[\n14\n]\ndiscusses the many mathematical references in Aristotle, the book\n[\n5\n]\nattempts to construct\n(\nor reconstruct\n)\na work on Aristotle's view of the philosophy of mathematics. As Apostle writes in\n[\n5\n]\n:-\n... numerous passages on mathematics are distributed throughout the works we possess and indicate a definite philosophy of mathematics, so that an attempt to construct or reconstruct that philosophy with a fairly high degree of accuracy is possible.\nWe end our discussion with an illustration of Aristotle's ideas of 'continuous' and 'infinite' in mathematics.\nHeath\n[\n15\n]\nexplains Aristotle's idea that 'continuous':-\n... could not be made up of indivisible parts; the continuous is that in which the boundary or limit between two consecutive parts, where they touch, is one and the same...\nAs to the infinite Aristotle believed that it did not actually exist but only potentially exists. Aristotle writes in\nPhysics\n(\nsee for example\n[\n15\n]\n)\n:-\nBut my argument does not anyhow rob mathematicians of their study, although it denies the existence of the infinite in the sense of actual existence as something increased to such an extent that it cannot be gone through; for, as it is, they do not need the infinite or use it, but only require that the finite straight line shall be as long as they please. ... Hence it will make no difference to them for the purpose of proofs."
}