{
  "nome_completo": "Arnold Scholz",
  "nome_curto": "Arnold Scholz",
  "ano_nascimento": "1904",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scholz_Arnold/",
  "lugar_nascimento": "Charlottenburg, Berlin, Germany",
  "lugar_morte": "Flensburg, Germany",
  "biografia": "Arnold Scholz\n's father, Reinhold Scholz\n(1857\n-\n1933)\n, was a mathematician and physicist who was head of department at the Military Testing Office in Berlin. Arnold's mother was Johanna Diesfeld\n(1874\n-\n1957)\n. In\n1911\nScholz began his schooling at a primary school in Charlottenburg and later he moved to the Kaiserin Augusta\nGymnasium\n, also in Charlottenburg, which had been founded in\n1818\nand named for Princess Augusta of Saxe-Weimar-Eisenach in\n1876\n. At this Gymnasium Scoltz was taught mathematics by Fritz Neiss\n(1883\n-\n1952)\nwho had published books on Number Theory, and\nDeterminants\nand Matrices. While he was at the Gymnasium, Scholz was unsure whether to continue his studies in mathematics or in music. He had learnt to play the piano and violin when he was young and later his favourite composers were Schubert and Beethoven. His love of music was so great that, in later life, he often said he was surprised that he had chosen to study mathematics rather than music. However, he did not give up studying music since he continued with this at university.\nIn\n1923\n, while at the Kaiserin Augusta Gymnasium, Scholz was awarded his\nAbitur\n, giving him the right to study at university. He entered the University of Berlin in the summer semester of\n1923\nwhere he studied mathematics, philosophy and musicology. Many German students of this time took courses at a number of different German universities but Scholz chose to spend only one semester away from Berlin and that was at the University of Vienna in the summer of\n1927\n. By this time in his career, Scholz was undertaking research for his doctorate advised by\nIssai Schur\nand his research had taken him into areas to which\nPhilipp Furtwängler\nhad made substantial contributions. In Vienna he worked with\nFurtwängler\nwho had, by that time, been a professor at Vienna for over ten years.\nFurtwängler\nwas severely disabled by this stage in his tenure of the chair of mathematics and was confined to a wheelchair. One of the students who was undertaking research in Vienna advised by\nFurtwängler\nwas\nOlga Taussky\n(\nlater\nTaussky-Todd\n)\n. She writes\n[\n8\n]\n:-\nWhile I was working on my thesis, a young German, a pupil of\nSchur\n, turned up. He was working on his thesis, which was related to Furtwängler's ideas. I saw him talk to\nFurtwängler\n. I gathered that he was very gifted and interested in computing.\nScholz was looking at the inverse\nGalois\ngroup problem, namely whether a given finite group can be the\nGalois\ngroup of some extension of the rational numbers. The problem in general is still unsolved but Scholz was solving special cases.\nEven before going to Vienna, Scholz had read material produced by\nHelmut Hasse\non class field theory. He wrote to\nHasse\non\n22\nApril\n1927\n, on the day before travelling to Vienna, suggesting ways that proofs of\nHasse\n's results could be substantially simplified and, as a result, Scholz and\nHasse\nwrote the joint paper\nZur Klassenkörpertheorie auf Takagischer Grundlage\nⓉ\n(\nOn class field theory based on Takagi\n)\nwhich was published in\nMathematische Zeitschrift\nin\n1928\n. It became Scholz's first paper.\nAfter his semester in Vienna, Scholz returned to Berlin in September\n1927\nand continued work on his thesis\nÜber die Bildung algebraischer Zahlkörper mit auflösbarer Galoisscher Gruppe\nⓉ\n(\nOn forming algebraic number fields with solvable Galois group\n)\n. On\n1\nApril\n1928\nhe was appointed as an assistant to\nErhard Schmidt\n. In October\n1928\nScholz wrote to\nHasse\nsaying that he had constructed number fields with arbitrarily large class field towers. This was an important result and\nHasse\nimmediately informed\nEmil Artin\n. Scholz published this result in his paper\nZwei Bemerkungen zum Klassenkörperturm\nⓉ\n(\nTwo remarks on the class field tower\n)\nwhich appeared in\nCrelle\n's Journal in\n1929\n. He submitted his doctoral dissertation and was examined by\nIssai Schur\nand\nErhard Schmidt\non\n19\nDecember\n1928\n. He was awarded his doctorate, magna cum laude, in the following year. Scholz adds the same words to both his thesis and to the paper consisting of his thesis material published in\nMathematische Zeitschrift\nin\n1929\n:-\nI would like to express my special thanks to Professor\nI Schur\nand Professor\nPh Furtwängler\nfor their friendly advice on the preparation of this work.\nThis paper consisting of his thesis material was one of four papers by Scholz published in\n1929\n. The other three are:\nReduktion der Konstruktion von Körpern mit zweistfiger\n(\nmetabelscher\n)\nGruppe\nⓉ\n(\nReducing the construction of fields with two-step\n(\nmetabelian\n)\ngroups\n)\n;\nAnwendung der Klassenkörpertheorie auf die Konstruktion von Körpern mit vorgeschriebener Gruppe\nⓉ\n(\nApplication of class field theory to the construction of bodies with specified group\n)\n; and\nZwei Bemerkungen zum Klassenkörperturm\nⓉ\n(\nTwo remarks on the class field tower\n)\nmentioned above.\nIn April\n1929\n, after the award of his doctorate, Scholz was appointed as an assistant to\nAlfred Loewy\nat the University of Freiburg. This position had become vacant since\nReinhold Baer\n, who had been\nLoewy\n's assistant at Freiburg from\n1926\n, had moved to Halle in\n1928\n. Scholz\nhabilitated\nat the University of Freiburg.\nErnst Zermelo\nhad held a chair in Zürich but had been forced through ill health to resign this chair in\n1926\n. However, he had been appointed to an honorary chair in Freiburg and so became an important colleague for Scholz. On\n8\nJuly\n1929\nScholz wrote\n(\nsee for example\n[\n5\n]\n)\n:-\nI have much more free time in Freiburg ... I just have to take care of\nLoewy\n's seminar. I am also receiving sufficient suggestions from\nLoewy\nto look at various papers.\nZermelo\n, however, is much more interesting to me. After having got through Warsaw in good shape, he is currently in Zoppot. He will return here in August.\nIn fact Scholz's interest in\nZermelo\n's ideas is clear from the fact that he published\nZermelos neue Theorie der Mengenbereiche\nⓉ\n(\nZermelo's new theory of quantity ranges\n)\nin\n1931\n.\nWe mentioned above that\nOlga Taussky\nhad met Scholz when he spent the summer of\n1927\nin Vienna. She met him again in\n1930\nand they began a joint collaboration at that time.\nOlga Taussky\nwrites\n[\n8\n]\n:-\nIn\n1930\nI went to Königsberg where a meeting of the\nDeutsche Mathematiker-Vereinigung\ntook place\n(\nHilbert\ngave a famous lecture on logic there\n)\n. I gave a lecture on my thesis and met famous people like\nNoether\nand\nHasse\n. I recognised Scholz and since our mathematical interests were clearly related\n(\nhe was a few years older and had already several publications by then\n)\nwe started a conversation. Soon after I returned to Vienna I had a letter from him suggesting joint work by correspondence ...\nAnother professor at Freiburg when Scholz began working there was Lothar Wilhelm Julius Heffter\n(1862\n-\n1962)\n. Heffter, who had been a student of\nLazarus Fuchs\n, had been a professor in Freiburg since\n1911\n. He retired from his chair in\n1931\nbut continued to live in Freiburg. In the summer of\n1931\nGustav Doetsch\nwas appointed to succeed Heffter and, at this time, Scholz changed from being\nLoewy\n's assistant to become an assistant to\nGustav Doetsch\n. However, it was\nZermelo\nwith whom Scholz formed a close friendship and he tried hard to arrange a meeting between\nZermelo\nand\nKurt Gödel\nat the\nDeutsche Mathematiker-Vereinigung\nmeeting held in Bad Elster in September\n1931\n.\nOlga Taussky\n, who was at the same meeting, wrote\n[\n9\n]\n:-\nI worked then with the number theoretician Arnold Scholz, who was a great class field expert. Both Scholz and\nZermelo\nworked in Freiburg. Scholz was eager to help\nZermelo\nand thought a discussion with\nGödel\nwould achieve this. ... The trouble with\nZermelo\nwas that he felt he had already achieved\nGödel\n's most admired result himself. Scholz seemed to think that this was in fact the case, but he had not announced it and perhaps would never have done so. ...\nIn the spring of\n1932\nScholz, together with\nZermelo\n, went on the \"Hellas Tour\" for teachers and students from German High Schools. The cruise with the steamship \"Oceana\" was from\n19\nApril to\n4\nMay and visited mainly places in Greece, but also places of interest in Italy and North Africa. In early\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. At first it might look as if the Aryan Scholz would be unaffected by this but in fact this was far from the case and over the next few years Scholz's life was made extremely difficult because of the Nazi agenda. The immediate problem in April\n1933\nwas that\nLoewy\n, who was a Jew, was dismissed and this left\nDoetsch\nas the only full professor at Freiburg.\nDoetsch\ngave his wholehearted support to the ideas of National Socialism as put forward by the Nazis and declared that algebra and number theory had become, like all areas under Jewish influence, completely abstract and un-German. Within three months of the Nazis coming to power, Scholz was trying to get away from Freiburg.\nIn the summer of\n1933\n, Scholz visited Berlin and while there he talked with\nErhard Schmidt\nabout the possibility of transferring his habilitation to Berlin. Later that year he applied for a grant from the Emergency Association. Both Heffter and\nDoetsch\nwere asked their opinion of Scholz's work by those deciding whether to award him a grant from the Emergency Association and they replied at the end of April and the beginning of May, rspectively. In\n1934\nScholz was awarded the grant and, resigning as\nDoetsch\n's assistant, he continued to search for another position. He explained his reasons in a letter to\nOlga Taussky\n, saying that\nWilhelm Süss\nhad been appointed to fill the chair that had become vacant when\nLoewy\nwas dismissed. Scholz has been told by\nGeorg Feigl\nthat\nSüss\nwas a very nice person but he was not an algebraist. Meanwhile\nDoetsch\nhad essentially eliminated higher algebra lectures from the Freiburg syllabus so Scholz now felt superfluous.\nScholz next wrote to\nHasse\nasking if he could transfer his habilitation to Göttingen.\nHasse\nhad been appointed to Göttingen after\nHermann Weyl\n, who had a Jewish wife, had resigned his chair there.\nHasse\n, however, told Scholz he had no chance of a position at Göttingen. Friedrich Karl Schmidt\n(1901\n-\n1977)\nsuggested to Scholz that he might be able to get an appointment in Kiel. On\n31\nJuly\n1934\n,\nDoetsch\nwrote a letter to Erhard Tonier about Scholz which illustrates the extremely difficult situation that Scholz was in at Freiburg and shows why he was so keen to move\n(\nsee\n[\n1\n]\nor\n[\n5\n]\n)\n:-\nI can only say one thing, that in my experience such a lack of a sense of duty at German universities has not yet occurred. ... I do not ask anyone whether he is a National-Socialist, I'm not even a party member. I would, in line with the intentions of the government, promote only someone who at least has a positive attitude to the present state. There can be no question about Scholz. He is the opposite, known here together with his only friend he has, namely\nZermelo\n, as the typical complainers who saw nothing better than that the National Socialist Government disappears as soon as possible because, in contrast to previous governments, it threatens to pursue such characters as him. It is, however, out of the question that such a softy as Scholz would be able to exert a political influence. ... But if people like Scholz see that today, despite all government announcements, they are doing very well,\n[\nFootnote: Six months ago, he received a grant for himself from the Emergency Committee; the matter was initiated behind my back\n]\nnobody should not be surprised if they continue their mischief calmly and are even more insolent. ... You will now perhaps understand that I was utterly amazed that this man is to be awarded a teaching position, just at a time when the fiercest battle has been announced against such drones. ... Students are opposed to him, completely dismissive, in the previous semester they even wanted to take action against him, probably mainly because he went around exclusively with Jews and Communists.\nIn\n1935\nScholz's grant from the Emergency Association ended and in August he made his first visit to Kiel. He settled there in October, but doubled his efforts to get a permanent appointment. However his refusal to conform to what the Nazis wanted made this exceptionally hard. Reports on him stated that\n(\nsee for example\n[\n5\n]\n)\n:-\nPolitically Scholz is not reliable. ... at Freiburg he was permanently together with Jews and former communists. Scholz will not understand Nazism.\nIn the summer of\n1935\nScholz had applied for a position as an assistant to Friedrich Karl Schmidt at Jena. Negotiations went on until October but, at that time, he received a letter from the rector of Jena saying that the Reich Ministry of Culture wanted him to remain in Kiel. F K Schmidt wrote to\nHasse\nin late October regretting that he was not able to employ Scholtz but, since the Reich Ministry of Culture had said that he should stay in Kiel, Schmidt expected Scholtz to get a teaching position in Kiel. However, by December Schmidt was writing again to\nHasse\nsaying\n(\nsee for example\n[\n5\n]\n)\n:-\nMuch to my surprise I heard a few days ago from Scholz that he has still not received the teaching position in Kiel. ... In any event as long as it is still a possibility for Scholz to get something in Kiel, I think it would be unwise if he leaves his post and takes on a foreign appointment.\nScholz certainly considered trying to get a position abroad but he did not want to leave Germany and he was being advised to remain in Kiel. He did consider a number of possibilities such as Amsterdam, Cambridge Massachusetts, and Yugoslavia. He also asked\nHasse\nif\nOystein Ore\ncould find a way to support him at Yale.\nOre\nreplied to\nHasse\nin January\n1936\n(\nsee for example\n[\n5\n]\n)\n:-\nI met Scholz in Hamburg last year and he made the best impression upon me. I am afraid I shall have to be rather discouraging about the possibilities for obtaining a position in America at the present time, but there might still be some chances. ... I should, however, not be too hopeful on the outcome of an application. The Institute of Advanced Study in Princeton announces a set of fellowships in the last number of the Bulletin of the\nAmerican Mathematical Society\n. Scholz may also apply for one of these ... .\nScholz continued to seek positions, for example in Tübingen. However, in addition to a continual stream of high quality research papes, he published the little book\nEinführung in die Zahlentheorie\nⓉ\n(\nIntroduction to Number Theory\n)\nin\n1939\n. This was reprinted in\n1945\nwithout changes, and in\n1955\nan edited version was published. Reviewing the\n1939\nedition\nLouis Mordell\nwrites\n[\n6\n]\n:-\nThis is an introduction in the more proper sense of the word. The author gives a strictly logical development of the elements of the classical theory, using, however, modern ideas and modes of expression when they are appropriate. He also, when it fits in with his scheme, gives some more advanced results not usually found in elementary books but none the less most welcome in enlarging the reader's horizon. ... It is quite clear that the author has produced an excellent little book. It contains a great deal in a small compass but does not suffer in any way from condensation. It can be strongly recommended to all desirous of a cheap, convenient and rapid introduction into number theory which takes note of the influence of modern algebra upon the subject.\nReviewing the\n1945\nreprint,\nHarold Davenport\nwrites:-\nThe book gives, in a small compass, a good account of classical number-theory, with occasional inclusion of more recent results. It consists of six chapters:\n(1)\nthe arithmetic of the natural numbers,\n(2)\ndivisibility properties,\n(3)\ncongruences,\n(4)\nquadratic residues,\n(5)\nquadratic forms,\n(6)\nalgorithmic calculation. ... The author pays greater attention to logical structure than is usual in elementary books, and also stresses the general concepts of group, ring and field at appropriate points. The exposition is somewhat condensed\n(\ne.g.,\nFermat\n's proof of the insolubility of\nx\n4\n+\ny\n4\n=\nz\n2\nx^{4}  + y^{4}  = z^{2}\nx\n4\n+\ny\n4\n=\nz\n2\ntakes only\n8\nlines\n)\n, but is always adequate. The book may be strongly recommended to anyone who seeks a concise account of elementary number-theory.\nReviewing the\n1955\nedition, which had been revised by B Schoeneberg,\nAlbrecht Fröhlich\nwrites\n[\n4\n]\n:-\nThis little book should prove to be an attractive and stimulating introduction to Number Theory. It cannot attempt to touch upon all the main branches of the subject, but instead concentrates on a few principal topics and thus succeeds in leading the reader up to interesting fundamental results of a comparatively advanced nature.\nWhile in Kiel Scholz supervised the doctoral studies of Gunter Hannink. However, in May\n1940\nScholz was conscripted into the army and sent as a radio operator to the East. In\n1941\nhe was assigned to the naval college in Flensburg-Mürwik as a teacher of mathematics. The naval station and academy at Flensburg had been established before World War II, and served an important role for Germany throughout the war. At Flensburg, Scholz was a colleague of\nOtt-Heinrich Keller\n. In December\n1941\nhe was told that he might not be allowed to return to Kiel after the war ended. However, this quickly became irrelevant since Scholz died on\n1\nFebruary\n1942\nin Flensburg. It is unclear exactly what caused his death but a form of pulmonary tuberculosis seems the most likely.\nAlthough Scholz published results of major importance in the top journals, his work seems not to have been influential except perhaps in as far as it influenced\nHasse\n. The reason for the lack of influence may be that Scholz was one of those brilliant mathematicians who are so far ahead of their time that they fail to make an impact since contemporaries fail to understand the significance of their results. For example the editors of\n[\n2\n]\nwrite:-\nIt is not an exaggeration to say that in the\n1930\ns, Arnold Scholz belonged to the elite of the younger algebraic number theorists in Germany. In particular, he worked on the generalisation of\nHasse\n's norm theorem to arbitrary normal extensions. ... It seems, however, that few people except\nHasse\nhad any idea about the depth of Scholz's work on the norm theorem because his article is, to say the very least, very difficult to read. It was Jehne\n[\nWolfram Jehne, On knots in algebraic number theory. In memoriam Arnold Scholz\n(1979)]\nwho realised that Scholtz had basically formulated\nTate\n's result\n[\nJohn Tate\n, Global class field theory\n(1967)]\non the obstruction to\nHasse\n's norm theorem in non-cohomological terms and remarked that \"Scholz's investigations have been forgotten for almost\n40\nyears\"."
}