{
  "nome_completo": "Arnold Droz-Farny",
  "nome_curto": "Arnold Droz-Farny",
  "ano_nascimento": "1856",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Droz-Farny/",
  "lugar_nascimento": "La Chaux-de-Fonds, Switzerland",
  "lugar_morte": "Porrentruy, Switzerland",
  "biografia": "Arnold Droz-Farny\nadopted the name Farny later in life after he married. He was named Arnold Droz, and was the son of Édouard Droz and his wife Louise. He studied mathematics in the canton of Neufchâtel and then continued his studies in Munich where he attended analysis lectures by\nKlein\n. By this time he had developed a strong preference for geometry. He married Lina Farny who was also from La Chaux-de-Fonds. She was the daughter of Constant and Anna Farny, and was a little older than her husband being born on\n26\nApril\n1854\n. On marriage they both changed their name to Droz-Farny.\nAfter studying in Munich, he was appointed as a teacher \"in an important institute of German-speaking Switzerland\".  In\n1880\nDroz-Farny was appointed as a professor of physics and mathematics at the cantonal School in Porrentruy near Basel in Switzerland. He taught there until\n1908\n.\nEduardo L Ortiz writes\n[\n2\n]\n:-\nAll I know of his personal life is that he seems to have been very sociable, liked mountain climbing and horse races, and kept correspondence with a number of mathematicians, among them Virginio Retali in Italy, and Juan Jacobo Duran Loriga in Spain. With the latter he kept correspondence between\n1889\nto\n1910\nwhen Duran Loriga died.\nAyme writes\n[\n1\n]\n:-\n[\nDroz-Farny\n]\nis known to have written four books between\n1897\nand\n1909\n, two of them about geometry. He also published in the Journal de Mathématiques élemantaires et Spéciales\n(1894\n,\n1895)\n, and in L'intermédiare des Mathématiciens and in the Educational Times\n(1899)\nas well as in Mathesis\n(1901)\n.\nDroz-Farny is best known for results published in the publications of\n1899\nand\n1901\nmentioned in this quote. The first of these was\nQuestion\n14111\nin\nThe Educational Times\n71\n(1899)\n,\n89\n-\n90\n. In this he stated the following remarkable theorem without giving a proof:\nIf two perpendicular straight lines are drawn through the orthocentre of a triangle, they intercept a segment on each of the sidelines. The midpoints of these three segments are collinear.\nThis is known as the Droz-Farny line theorem, but it is not known whether Droz-Farny had a proof of the theorem. Looking at other work by Droz-Farny, one is led to conjecture that indeed he would have constructed a proof of the theorem.\nYou can see the diagram for the Droz-Farny line theorem at\nTHIS LINK\n.\nThe\n1901\npaper we mentioned above is, for example, one in which he gives a proof of a theorem stated by\nSteiner\nwithout proof. Droz-Farny's proof appears in the paper\nNotes sur un théorème de Steiner\nⓉ\n(\nNotes on Steiner's theorem\n)\nin\nMathesis\n21\n(1901)\n,\n268\n-\n271\n. The theorem is as follows:\nIf equal circles are drawn on the vertices of a triangle they cut the lines joining the midpoints of the triangle in six points. These six points lie on a circle whose centre is the orthocentre of the triangle.\nYou can see the diagram for the Droz-Farny circle theorem at\nTHIS LINK\n.\nDroz-Farny died of \"a long and painful disease\"."
}