{
  "nome_completo": "Arnold Johannes Wilhelm Sommerfeld",
  "nome_curto": "Arnold Sommerfeld",
  "ano_nascimento": "1868",
  "ano_morte": "1951",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sommerfeld/",
  "lugar_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Munich, Germany",
  "biografia": "Arnold Sommerfeld\n's mother was Cäcile Matthias and his father was Franz Sommerfeld. Franz was a medical doctor who came from a leading Königsberg family. Franz was\n48\nyears old when Arnold was born while his wife Cäcile was\n29\n; they had been married for six years. Arnold wrote autobiographical notes in around\n1917\n(\nwhich he updated towards the end of his life\n)\nand we give some quotations from these throughout this biography. In particular let us quote what Arnold said about his parents\n(\nsee for example\n[\n1\n]\n, or Sommerfeld's\nCollected Works\nwhich contains the full autobiographical article\n)\n:-\nMy father, the practicing physician, ... was a passionate collector of natural objects\n(\namber, shells, minerals, beetles, etc.\n)\nand a great friend of the natural sciences. ... To my energetic and intellectually vigorous mother I owe an infinite debt.\nSommerfeld entered the Altstädtisches\nGymnasium\nin Königsberg in\n1875\n. Two slightly older pupils at the same school were\nMinkowski\nand\nWien\n. At this High School, he excelled in all his subjects and it was not clear to him what subjects he should pursue further:-\nI was almost more interested in literature and history than in the exact sciences; I was equally good in all subjects including the classical languages.\nHe took his final school examinations\n(\nthe\nAbitur\n)\nin\n1886\nand decided that he would concentrate on mathematics at University. Sommerfeld entered the University of Königsberg immediately after passing the Abitur but although mathematics was his main subject, he followed his all round interests by attending lectures in natural sciences, philosophy, and political economy as well. The Mathematics Department at Königsberg at this time was remarkable for the talented staff who were teaching there.\nHilbert\n,\nHurwitz\nand\nLindemann\nall lectured to Sommerfeld and, after attending a course by\nHilbert\non the theory of ideal numbers, he felt that abstract pure mathematics was the right subject for him.\nAt this time the University of Königsberg was famous for its school of Theoretical Physics which had been founded by\nFranz Neumann\n. However Sommerfeld's interests were in mathematics rather than physics. He was also much involved in student life and he joined the Burschenschaft, a student society, which proved a major distraction\n[\n1\n]\n:-\nActive participation in\n[\nthe Burschenschaft\n]\n, with its compulsory drinking bouts and fencing duels, prevented systematic and concentrated study in his first few years at university.\nIn fact he received a long fencing scar on his forehead from this time. It was the custom of German students to move from one university to another, yet Sommerfeld did not do so, remaining in Königsberg. Later in life he regretted not moving because of the time he ended up wasting with the Burschenschaft, but at the time the inspiration he received from his remarkable mathematics teachers kept him in Königsberg.\nLindemann\nwas Sommerfeld's doctoral thesis advisor and, in\n1891\n, he was awarded his doctorate from Königsberg for his thesis\nDie willkürlichen Functionen in der mathematischen Physik\nⓉ\n(\nThe arbitrary functions of mathematical physics\n)\n. It was a thesis which, during the summer of\n1891\n:-\n... I conceived and wrote out in a few weeks.\nIn this thesis he studied the representation of arbitrary functions by the eigenfunctions of\npartial differential equations\nand other given sets of functions.\nAfter completing his doctorate, Sommerfeld remained at Königsberg to work for the teaching diploma which would let him teach mathematics and physics at a Gymnasium. After passing his teaching diploma examinations in\n1892\n, he then began a year of military service. Many academics find military service a necessary evil to be suffered but not so Sommerfeld. He did his military service in the reserve regiment in Königsberg and for the following eight years continued to undertake voluntary eight week military exercises - he really enjoyed the life and in many ways looked the part\n[\n1\n]\n:-\nDespite his squat build, by middle age, with the aid of a turned up waxed moustache, he managed to give the impression of a colonel of the hussars.\nIn\n1893\n, after completing his military training in the September, Sommerfeld went to Göttingen, knowing it to be \"the seat of mathematical high culture\", and he first spent a year as an assistant in the Mineralogical Institute. However he quickly fell under\nKlein\n's spell:-\nOverwhelming was the impression which I received, in lectures and discussions, from\nFelix Klein\n's grand personality.\nIn September\n1894\nhe became\nKlein\n's assistant. He wrote in his autobiographical notes:-\nConsciously and systematically\nKlein\nsought to enthral me with the problems of mathematical physics, and to win me over to his conception of these problems as he had developed it in lecture courses in previous years. I have always regarded\nKlein\nas my real teacher, not only in things mathematical, but also in mathematical physics and in connection with mechanics.\nHe soon came to know\nKlein\n's lectures very well since one of his duties was to manage the Mathematical Reading Room, and to make copies of\nKlein\n's lectures available there for the use of students\n(\nno photocopiers in those days!\n)\n. As indicated, the direction of Sommerfeld's research was immediately influenced by\nKlein\nwho at this time was heavily involved in applying the theory of functions of a complex variable, and other pure mathematics, to a range of physical topics from astronomy to dynamics. Sommerfeld's first work under\nKlein\n's supervision was an impressive piece of work on the mathematical theory of diffraction. His work on this topic contains important theory of partial differential equations. Other important work which he undertook while at Göttingen included the study of the propagation of electromagnetic waves in wires, and the study of the field produced by a moving electron.\nIn March\n1895\nSommerfeld presented his\nhabilitation\nthesis\nThe mathematical theory of diffraction\nto Göttingen and became a\nprivatdozent\nin mathematics. He lectured on a wide range of topics, giving lectures on\nprobability\nand also on the partial differential equations of physics. The lectures\nKlein\ngave in\n1895\n-\n96\non the spinning top led to\nKlein\nand Sommerfeld starting a joint project to write a four volume text on the theory of gyroscopes. This would eventually be published in\n1909\n-\n1910\n, the first two volumes dealing with the mathematical theory, while the final two volumes deal with applications to geophysics, astronomy and technology. While at Göttingen he had met Johanna Höpfner, the daughter of Ernst Höpfner who was the curator of university, but they could not marry while Sommerfeld was a privatdozent with insufficient income to support a wife.\nFrom October\n1897\nSommerfeld taught at Clausthal where he became professor of mathematics at the mining academy. This was not an exciting job from the teaching point of view, but it provided sufficient salary for him to marry, and it was also close enough to Göttingen to allow him to continue collaborating with\nKlein\nand others there. The marriage between Sommerfeld and Johanna Höpfner produced three sons and one daughter.\nAt\nKlein\n's request he took on the editorship of Volume V of the\nEncyklopädie der mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of mathematical sciences\n)\nwhich dealt with mathematical physics. This was a big undertaking which occupied a lot of his time long after he had left Clausthal. Reich writes in\n[\n11\n]\n:-\nIn\n1901\nSommerfeld sent a directive of\n8\npages to all contributors of this volume. In his note he proposed a special way of denoting vectors, vector calculus and the electromagnetic magnitudes, which became obligatory for all contributors. In September\n1903\nKlein\nfounded a so-called \"vector commission\" consisting of Sommerfeld, Ludwig Prandtl, and Rudolf Mehmke. Its aim was to create a unified vector symbolism and calculus.\nThree years after taking up the appointment in Clausthal, he became professor of mechanics at the Technische Hochschule in Aachen. This appointment had much to do with\nKlein\n. It was he who strongly believed that engineering should be based on a strong mathematical base, so he had pressed hard for Sommerfeld to be appointed to this professorship. However Sommerfeld's new colleagues at Aachen did not have the same vision as\nKlein\nand had to be won over:-\nAlthough my Aachen colleagues and students at first regarded the 'pure mathematician' with suspicion, I soon had the satisfaction of being accepted as a useful member not merely in teaching but also in engineering practice; thus I was requested to render expert opinions and to participate in the Engineering Society.\nIn\n1906\nhe became professor of theoretical physics at Munich. There an institute was set up for him, with rooms for seminars, rooms for assistants, and laboratories for experimental work. Despite being a mathematical physicist, he wanted to be able to direct experimental work aimed at checking his theories. In fact he supervised a large number of students at Munich, many in theoretical physics, but for others he directed them in programmes of experimental research. His most famous students include Peter Debye\n(\ndoctorate in\n1908)\n, Peter Ewald\n(\ndoctorate in\n1912)\n,\nWolfgang Pauli\n(\ndoctorate in\n1921)\n,\nWerner Heisenberg\n(\ndoctorate in\n1923)\n, and\nHans Bethe\n(\ndoctorate in\n1928)\n. In total he supervised nearly\n30\ndoctoral students at Munich.\nMax Born\n, in\n[\n7\n]\n, gives an insight into Sommerfeld's way of supervising his students:-\nTheoretical physics is a subject which attracts youngsters with a philosophical mind who speculate about the highest principles without sufficient foundations. It was just this type of beginner that he knew how to handle, leading them step by step to a realisation of their lack of actual knowledge and providing them with the skill necessary for fertile research. ... He had the rare ability to have time to spare for his pupils, in spite of his duties and scientific work. ... In this friendly and informal way of teaching a great part was played by invitations to join a skiing party on the 'Sudelfeld' two hours by rail from Munich. There he and his mechanic ... were joint owners of a ski hut. In the evenings, when the simple meal was cooked, the dishes were washed, the weather and snow properly discussed, the talk invariably turned to mathematical physics, and this was the occasion for the receptive students to learn the master's inner thoughts.\nOne of the first topics he worked on at Munich was atomic spectra. He studied the hypothesis that X-rays were waves and proved this by using crystals as three dimensional diffraction gratings. From\n1911\nhis main area of interest became\nquantum theory\n. Sommerfeld's work led him to replace the circular orbits of the\nNiels Bohr\natom with elliptical orbits; he also introduced the magnetic quantum number in\n1916\nand, four years later, the inner quantum number. It was theoretical work attempting to explain the inner quantum number that led to the discovery of electron spin.\nIn the later part of his career, Sommerfeld used\nstatistical mechanics\nto explain the electronic properties of metals. This replaced an earlier theory due to\nLorentz\nin\n1905\nbased on classical physics. Sommerfeld's approach was to regard electrons in a metal as a degenerate electron gas. He was able to explain features which were unexplained by the earlier classical theory. His important treatise\nAtomic structure and spectral lines\nwhich ran to six editions, reflects the development of theoretical spectroscopy between\n1916\nand\n1946\n.\nMorris Kline\nwrites about the last part of Sommerfeld's life:-\nSommerfeld's life was saddened toward the end of his career by events in Germany. Anti-Semitism, always present in that country, became virulent in the Hitler period and Sommerfeld was obliged to witness the emigration of famous colleagues, including\nEinstein\n.\nLet us break into this quote to provide another quote, this one being in a letter Sommerfeld wrote to\nEinstein\nabout a year after Hitler came to power:-\nI can assure you that the misuse of the word 'national' by our rulers has thoroughly broken me of the habit of national feelings that was so pronounced in my case. I would now be willing to see Germany disappear as a power and merge into a pacified Europe.\nAfter this interjection, let us continue with\nMorris Kline\n's quote:-\nAll he could do was use the friendships he had built up during a one-year stay in the United States and a one-year round-the-world trip to help place the refugees. The loss of so many of its best men in this way together with World War II, destroyed the scientific strength of Germany, and Sommerfeld felt obliged to continue teaching until\n1947\n, long after the usual retirement age of\n65\n. His life was ended by another tragedy. Somewhat deaf in his old age he failed to hear a warning\n[\nwhen out walking with his grandchildren\n]\nand was struck by a truck in the spring of\n1951\n. He died of the injuries two months later.\nKline\nalso gives this tribute to Sommerfeld:-\n[\nHe\n]\nwas at the forefront of the work in electromagnetic theory, relativity and quantum theory and he was the great systematizer and teacher who inspired many of the most creative physicists in the first thirty years of this century.\nFinally let us give a brief indication of the many honours Sommerfeld received. He won the\nLorentz\nGold Medal, the\nPlanck\nMedal, and the Oersted Medal. He was elected to the\nRoyal Society of London\n, The\nNational Academy of Sciences\nin Washington, the Academies of\nBerlin\n, Munich, Vienna,\nGöttingen\n,\nBudapest\n, Uppsala, and Madrid, as well as the\nAcademia dei Lincei\nof Rome, The\nAcademy of the U.S.S.R\nin Moscow, and the\nIndian Academy of Sciences\n. He received honorary degrees from many universities including Rostock, Aachen, Calcutta, and Athens."
}