{
  "nome_completo": "Arthur Lee Dixon",
  "nome_curto": "Arthur Lee Dixon",
  "ano_nascimento": "1867",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dixon_Arthur/",
  "lugar_nascimento": "Pickering, Yorkshire, England",
  "lugar_morte": "Sandgate, Kent, England",
  "biografia": "Arthur Lee Dixon\nwas the second son of the Rev George Thomas Dixon\n(\nborn in Brigg, Lincolnshire about\n1838)\n, who was the Wesleyan Minister of Northallerton. His mother was Ellen Cardew\n(\nborn in Alford, Lincolnshire about\n1842)\nand he was the younger brother of\nAlfred Cardew Dixon\n. Arthur was educated at Kingswood School in Bath which he attended from\n1879\nto\n1885\n. This school was a Methodist school founded by Wesley, the founder of Methodism. After leaving Kingswood School Arthur Dixon entered Worcester College, Oxford, where he studied mathematics, graduating in\n1889\n.\nArthur Dixon won a prize fellowship to Merton College, Oxford, where he was appointed in\n1891\n. Merton College was one of the Oxford Colleges with a strong historical mathematical connection, since the first school of mathematics there was organised by Thomas\nBradwardine\nin the middle of the\n14\nth\nCentury.\nHe was elected to a further fellowship when he became Tutorial Fellow in\n1898\n, and four years later, in\n1902\n, he married Catherine Rieder in Paris. However Dixon experienced problems due to his wife's health:-\nThe climate of Oxford proved disastrous to Mrs Dixon's health and she was compelled to spend much of her married life outside Oxford, in Pau and elsewhere.\n[\nPau is a town in the Pyrénées, in southwest France.\n]\nDixon's fellowship allowed him to remain at Merton College until he was appointed to the Savilian chair of pure mathematics in Oxford in\n1922\n. Arthur and Catherine Dixon had one daughter and after Catherine's death in\n1930\n, Dixon made his home with his daughter who by this time was married to F J Baden Fuller and living in Sandgate, Kent. He continued to hold the Savilian chair of pure mathematics at Oxford until he retired in\n1945\n.\nArthur Dixon always said that the biggest influences on his study of mathematics were\nElliott\n, who inspired his particular line of research, and C L\nDodgson\nwhom he once met. His mathematics, very much in the English tradition of\nCayley\n, studied applications of algebra to geometry,\nelliptic functions\nand\nhyperelliptic functions\n.\nIn\n1908\nDixon began a series of publications on algebraic eliminants, carrying the subject forward from the point where\nCayley\nhad left it. He also published a number of papers on the cubic surface, studying lines on the surface, and other topics such as the\nSchur\nquadric\n. In the latter part of his career, Dixon published a series of around twelve joint papers with W L\nFerrar\non\nanalytic number theory\n, summation formulae,\nBessel functions\nand other topics in analysis.\nIn\n1912\nArthur Dixon was honoured by being elected a Fellow of the\nRoyal Society\n. He was also a strong supporter of the\nLondon Mathematical Society\n, serving as its President in\n1924\n-\n26\n. His younger brother,\nAlfred Cardew Dixon\n, would hold this same office five years later.\nArthur Dixon shared with\nElliott\n, who had inspired him, an old-fashioned approach to mathematics. Chaundy, writing in\n[\n2\n]\n, describes Dixon's feelings on this as follows:-\nHe had no great sympathy with much of the mathematics now in vogue.\nMatrices\n, he agreed, meant something; but so often in modern writing, when one had mastered a notation and terminology that were unfamiliar\n(\nand you suspected, repellent\n)\n, one discovered it was something one had known all along.\nDixon had many talents in addition to his mathematical ones. He was a great sportsman who played hockey, tennis, squash and croquet. Another side of this many talented man was his skills as a linguist and his great musical talents\n(\nhe played the flute in a local orchestra\n)\n.\nChaundy, in\n[\n2\n]\n, describes Dixon's character:-\nHe was a man of the sunniest disposition, radiating bonhomie, welcome in every company and with a wide circle of friends. He was gentle in manner, somewhat reserved in speech, with a quiescence that was never to be thought inertia.\nIn\n[\n1\n]\nhe is described as:-\n... essentially a man of peace, loathing all quarrels. When conflicts of a personal character threatened to arise between colleagues he would shrink into silence; even in disputes of a mathematical nature he was reluctant to take part, though\n(\nas one learnt privately\n)\nhe held clear and definite views on many of them. ... He was a genial personality, but with a certain oracular reserve. In mathematics he strove to preserve something of what seemed a more staid and sober tradition ..."
}