{
  "nome_completo": "Arthur Cayley",
  "nome_curto": "Arthur Cayley",
  "ano_nascimento": "1821",
  "ano_morte": "1895",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cayley/",
  "lugar_nascimento": "Richmond, Surrey, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Arthur Cayley\n's father Henry Cayley\n(1768\n-\n1850)\n, although from a family who had lived for many generations in Yorkshire, England, worked as a merchant in St Petersburg, Russia. Henry Cayley was married to Maria Antonia Doughty\n(1794\n-\n1875)\n, a daughter of William Doughty. Henry and Maria Cayley had five children: Sophia Cayley\n(1816\n-\n1889)\n, William Henry Cayley\n(1818\n-\n1819)\n, Arthur Cayley the subject of this biography, Charles Bagot Cayley\n(1823\n-\n1883)\nand Henrietta-Caroline Cayley\n(1828\n-\n1886)\n. As is evident from these dates, their eldest child William Henry died as an infant. The connection with St Petersburg was more than just where Henry Cayley's job had taken him for his father, Arthur Cayley's paternal grandfather, John Cayley\n(1730\n-\n1795)\n, had served as Consul General in St Petersburg. The family, although living in St Petersburg, returned to England for the summers and it was on such a summer visit in\n1821\nthat Arthur Cayley was born. His younger brother Charles Bagot was born in Russia and went on to distinguish himself as translator of Dante and Homer. Arthur spent the first seven years of his life in St Petersburg where he came in contact with several languages, particularly Russian, English and French - the international business language there was French. The family returned to live permanently in England in\n1828\nand took up residence in a fine house at\n29\nYork Terrace near Regent's Park in London, where Henry, now aged sixty, became a director of the London Assurance Corporation. It was after the family returned to London that Arthur Cayley's sister Henrietta-Caroline was born there. While we are describing the Cayley family we should mention that Sir George Cayley, F.R.S.\n(1773\n-\n1857)\n, a pioneer of aerial navigation and aeronautical engineering, was Arthur Cayley's fourth cousin. There is, however, no evidence of contact between them.\nArthur showed great skill in numerical calculations at a private school in Blackheath and, after he moved to King's College School in\n1835\n, at age\n14\nrather than the usual age of entry of\n16\n, his aptitude for advanced mathematics became apparent. However, it was not only mathematics at which he excelled, for he won prizes in many subjects. In particular, he won the Chemistry Prize in each of his final two years despite not specialising in science. His mathematics teacher advised his parents that Arthur be encouraged to pursue his studies in this area rather than follow his father's wishes to enter the family business as a merchant.\nIn\n1838\nArthur began his studies at Trinity College, Cambridge, having\nGeorge Peacock\nas tutor in his first year. He was coached by\nWilliam Hopkins\nwho encouraged him to read papers by continental mathematicians. His favourite mathematical topics were linear transformations and analytical geometry and while still an undergraduate he had three papers published in the newly founded\nCambridge Mathematical Journal\nedited by\nDuncan Gregory\n. Cayley graduated as Senior\nWrangler\nin\n1842\nand won the first Smith's prize. After the examinations, Cayley and his friend Edmund Venables led a reading party of undergraduates to Aberfeldy in Scotland. One of these undergraduates was\nFrancis Galton\nwho described his tutor Cayley\n(\nquoted in\n[\n11\n]\n)\n:-\nNever was a man whose outer physique so belied his powers as that of Cayley. There was something eerie and uncanny in his ways, that inclined strangers to pronounce him neither to be wholly sane nor gifted with much intelligence, which was the very reverse of the truth ... he appeared so frail as to be incapable of ordinary physical work.\nWhile on the trip, Venables wrote to\nGeorge Stokes\nin Cambridge\n(\nquoted in\n[\n11\n]\n)\n:-\nWe are surrounded by some of the highest mountains in Scotland, among which the most beautiful is certainly Schiehallion famous in the history of gravitation; I have been trying in vain to induce Cayley to repeat Dr\nMaskelyne\n's experiments on its summit and to acquire to himself a never dying fame; but alas he has no desire for notoriety, and has a rooted aversion to experiments and calculations of all kinds: he is now sitting by my side carrying on those dreadful investigations commenced in the Mathematical Journal, in which having exhausted all the letters of the Greek and English alphabets, he is fain to turn his δελτα s tops turvy, and have recourse to the old English.\nFor four years Cayley taught at Cambridge having won a Fellowship and, during this period, he published\n28\npapers in the\nCambridge Mathematical Journal\n. He worked on a large variety of mathematical topics including algebraic curves and surfaces,\nelliptic functions\n,\ndeterminants\nand the theory of integration. For example he published\nOn a theory of determinants\nin\n1843\nin which he extended the idea of a\n2\n-dimensional determinant\n(\nrows and columns\n)\nto multidimensional arrays. In\n1844\nhe began a correspondence with\nGeorge Boole\nwhich proved valuable to both mathematicians. For example he wrote to\nBoole\nin\n1845\n(\nBoole\nwas teaching at a school in Lincoln, England, at the time\n)\n:-\nI wish I could manage a visit to Lincoln, I should so much enjoy talking over some things with you, not to mention the temptation of your Cathedral. I think I must contrive it some time in the next six months, in spite of there being no railway, which one begins to consider oneself entitled to in these days.\nIn\n1844\nCayley, along with his friend Edmund Venables, made a trip to the Swiss Alps, also visiting Italy. He took a much more international approach than many of his fellow English mathematicians, publishing papers in the French\nJournal de Mathématiques Pures et Appliquées\nand in\nCrelle\n's journal\nJournal für die reine und angewandte Mathematik\n. Two papers he published in\n1845\nand\n1846\nare regarded as laying the foundations for\ninvariant theory\n.\nThe Cambridge fellowship had a limited tenure, since Cayley was not prepared to take Holy Orders, so he had to find a profession. He chose law and began training in April\n1846\n. While still training to be a lawyer Cayley went to Dublin to hear\nWilliam Rowan Hamilton\nlecture on\nquaternions\n. He sat next to\nGeorge Salmon\nduring these lectures and the two were to exchange mathematical ideas over many years. Cayley was a good friend of\nHamilton\n's although the two disagreed as to the importance of the quaternions in the study of geometry. Another of Cayley's friends was\nJames Joseph Sylvester\nwho was also in the legal profession. The two both worked at the courts of Lincoln's Inn in London and they discussed deep mathematical questions during their working day. Others at Lincoln's Inn who were active mathematicians included\nHugh Blackburn\n. He wrote to\nWilliam Thomson\nabout his work with Cayley:-\nWe have been busy\n(\nwhen we ought to have been drawing acts of parliament and such sublunary matters\n)\nin constructing the developable surface generated by the tangent to the curve of intersection of the straight cylinder and sphere of double its radius ...\nIn fact Cayley and\nThomson\nwere also good friends. About a year after he began legal training Cayley began a correspondence with\nThomas Kirkman\n. He was a referee of\nKirkman\n's famous paper in the\nCambridge and Dublin Mathematical Journal\nin which he shows the existence of what today are called\nSteiner\nsystems. Cayley wrote in his report:-\nKirkman\n's paper is decidedly interesting and his main result a very elegant one.\nHe was admitted to the bar on\n3\nMay\n1849\n. He spent\n14\nyears as a lawyer but Cayley, although very skilled in conveyancing\n(\nhis legal speciality\n)\n, always considered it as a means to make money so that he could pursue mathematics.\nGeorge Halsted\nwrites\n[\n21\n]\n:-\nThe law was always drudgery to him. The superabundant verbiage of legal forms was always distasteful to him. He once remarked that \"the object of law was to say a thing in the greatest number of words, of mathematics to say it in the fewest.\"\nDuring these\n14\nyears as a lawyer Cayley published about\n250\nmathematical papers - how many full time mathematicians could compare with the productivity of this 'amateur'? However, Tony Crilly writes\n[\n11\n]\n:-\nAt Cambridge, and even as a pupil barrister, he could retire to his study. As a newly qualified barrister, with a growing scientific reputation, it became obligatory to adopt a more public persona, a role which did not sit easily with his retiring disposition. Cayley maintained contact with Cambridge and from serving as Senior Examiner at the annual Trinity College examinations, he progressed to the responsibility of being Senior Moderator for the Mathematical Tripos in\n1851\nand Senior Examiner in\n1852\n.\nAs a result he began to look for academic appointments and, to improve his chances of a professorship he began to increase his already remarkably high rate of publication of mathematics papers. For example, during the years\n1853\n-\n1856\nhe averaged ten published  papers per year, but as he sought to raise his profile, he published on average thirty papers per year during\n1857\n-\n1860\n. He had not been successful in his application in\n1856\nfor the chair of natural philosophy at Marischal College, Aberdeen. He was also interested in the Lowndean Chair of Geometry and Astronomy at Cambridge in\n1858\nand the chair of astronomy at Glasgow University in the following year. However, he failed to obtain both these and other positions. Perhaps one reason was that, despite a remarkable research record, he had little experience of teaching.\nIn\n1863\nCayley was appointed Sadleirian professor of Pure Mathematics at Cambridge. He was successful despite there being other high quality applicants such as\nIsaac Todhunter\n,\nNorman Ferrers\n, and\nEdward Routh\n. This appointment involved a very large decrease in income for Cayley who now had to manage on a salary only a fraction of that which he had earned as a skilled lawyer. However Cayley was very happy to have the chance to devote himself entirely to mathematics. As Sadleirian professor of Pure Mathematics his duties were:-\n... to explain and teach the principles of pure mathematics and to apply himself to the advancement of that science.\nCayley was to more than fulfil these conditions. However, before we look briefly at his remarkable research achievements, we note that he married in\n1863\n, the year of his appointment as Sadleirian professor. On\n8\nSeptember he married Susan Moline\n(1831\n-\n1923)\nfrom Greenwich, the daughter of Robert Moline. Arthur and Susan Cayley had two children: Henry Cayley\n(1870\n-\n1949)\nwho studied mathematics at Cambridge but decided that he couldn't live up to his father's achievements so became an architect, and Mary Cayley\n(1872\n-\n1950)\n. In\n1864\nCayley purchased Garden House, Little St Mary's Lane, in Cambridge. On\n8\nNovember\n1863\nCayley gave his inaugural lecture\nAnalytical geometry - Introductory lecture\n. However, his lectures over the following years were often based on his latest researches and students did not find them relevant to the Tripos examination in which they all aimed at getting the greatest possible marks\n[\n10\n]\n:-\nCayley was concerned with mathematics 'per se', while most students wanted competence in a circumscribed syllabus. Any deviation from it was regarded as a waste of time and effort.\nHe published over\n900\npapers and notes covering nearly every aspect of modern mathematics. The most important of his work is in developing the algebra of matrices, work on non-euclidean geometry and\nn\nn\nn\n-dimensional geometry. Of his work on matrices, Richard Feldmann writes\n[\n17\n]\n:-\nAlthough the term \"matrix\" was introduced into mathematical literature by\nJames Joseph Sylvester\nin\n1850\n, the credit for founding the theory of matrices must be given to Arthur Cayley, since he published the first expository articles on the subject. ... Cayley's introductory paper in matrix theory was written in French and published in a German periodical\n[\nin\n1855]\n. ...\n[\nHe\n]\nintroduces, although quite sketchily, the ideas of inverse matrix and of matrix multiplication, or \"compounding\" as Cayley called it. The above basic properties are expanded in a second expository article\n[\nof\n1858]\nwhich also lists many additional properties of matrices.\nAs early as\n1849\nCayley had written a paper linking his ideas on permutations with\nCauchy\n's. In\n1854\nCayley wrote two papers which are remarkable for the insight they have of abstract groups. At that time the only known groups were permutation groups and even this was a radically new area, yet Cayley defines an abstract group and gives a table to display the group multiplication. He gives the 'Cayley tables' of some special permutation groups but, much more significantly for the introduction of the abstract group concept, he realised that matrices and quaternions were groups. Here is a part of his definition of an abstract group:-\n... the symbol\n1\nwill naturally denote an operation which\n(\neither generally or in regard to the particular operand\n)\nleaves the operand unaltered. .... A symbol xy denotes the compound operation, the performance of which is equivalent to the performance, first of the operation y, and then of the operation x; xy is of course in general different from yx. But the symbols x, y, ... are in general such that x\n(\nyz\n)\n=\n(\nxy\n)\nz etc, so that xyz, xyzt, etc. have a definite signification independent of the particular mode of compounding the symbols ...\nCayley developed the theory of algebraic invariance, and his development of\nn\nn\nn\n-dimensional geometry has been applied in physics to the study of the space-time continuum. His work on matrices served as a foundation for quantum mechanics, which was developed by\nWerner Heisenberg\nin\n1925\n. Cayley also suggested that euclidean and non-euclidean geometry are special types of geometry. He united projective geometry and metrical geometry which is dependent on sizes of angles and lengths of lines.\nYou can see reviews of  Cayley's papers by\nG B Halsted\nat\nTHIS LINK\n.\nHe only published one book, namely\nAn Elementary Treatise on Elliptic Functions\n(1876)\n. However, he did contribute Chapter\n6\nto\nPeter Guthrie Tait\n's\nAn Elementary Treatise on Quaternions\n(1890)\nand published the six-penny booklet,\nThe Principles of Book-Keeping by Double Entry\n(1894)\n.\nIn\n1881\nhe was invited to give a course of lectures at Johns Hopkins University in the United States, where his friend\nSylvester\nwas professor of mathematics. He spent January to May of\n1882\nat Johns Hopkins University where he lectured on Abelian and Theta Functions. After he returned to England, the\nRoyal Society\nawarded him their Copley Medal. In\n1883\nCayley became President of the\nBritish Association for the Advancement of Science\n. In his presidential address Cayley gave an elementary account of his own views of mathematics. His views of geometry were:-\nIt is well known that\nEuclid\n's twelfth axiom, even in\nPlayfair\n's form of it, has been considered as needing demonstration: and that\nLobachevsky\nconstructed a perfectly consistent theory, wherein this axiom was assumed not to hold good, or say a system of non-Euclidean plane geometry. My own view is that\nEuclid\n's twelfth axiom in\nPlayfair\n's form of it does not need demonstration, but is part of our experience - the space, that is, which we become acquainted with by experience, but which is the representation lying at the foundation of all external experience.\nRiemann\n's view ... is that, having 'in intellectu' a more general notion of space\n(\nin fact a notion of non-Euclidean space\n)\n, we learn by experience that space\n(\nthe physical space of our experience\n)\nis, if not exactly, at least to the highest degree of approximation, Euclidean space. But suppose the physical space of our experience to be thus only approximately Euclidean space, what is the consequence which follows? Not that the propositions of geometry are only approximately true, but that they remain absolutely true in regard to that Euclidean space which has been so long regarded as being the physical space of our experience.\nTwo descriptions of Cayley, both of him as an old man, are interesting.\nMacfarlane\n[\n15\n]\nsays:-\n... I attended a meeting of the\nMathematical Society of London\n. The room was small, and some twelve mathematicians were assembled round a table, among them was Prof Cayley ... At the close of the meeting Cayley gave me a cordial handshake and referred in the kindest terms to my papers which he had read. He was then about\n60\nyears old, considerably bent, and not filling his clothes. What was most remarkable about him was the active glance of his grey eyes and his peculiar boyish smile.\nThomas Hirst\n, one of his friends, wrote:-\n... a thin weak-looking individual with a large head and face marked with small-pox: he speaks with difficulty and stutters slightly. He never sits upright on his chair but with his posterior on the very edge he leans one elbow on the seat of the chair and throws the other arm over the back.\nHere is\nG B Halsted\n's tribute\n[\n23\n]\n:-\nCayley, in addition to his wondrous originality, was assuredly the most learned and erudite of mathematicians. Of him in his science it might be said he knew everything, and he was the very last man who ever will know everything. His was a very gentle, sweet character.\nSylvester\ntold me he never saw him angry but once, and that was\n(\nboth were practicing law!\n)\nwhen a messenger broke in on one of their interviews with a mass of legal documents - new business for Cayley. In an access of disgust, Cayley dashed the documents upon the floor.\nWe end by giving this tribute from\n[\n8\n]\n:-\nCayley was Britain's outstanding pure mathematician of the nineteenth century. An algebraist, analyst, and geometer, he was able to link these vast domains of study. More than fifty concepts and theorems of mathematics bear his name. By the end of his life he was revered by mathematicians the world over.\nIn addition to the Copley Medal we mentioned above, we note that Cayley was elected a fellow of the\nRoyal Society\nin\n1852\nand received their Royal Medal in\n1859\n. The\nLondon Mathematical Society\nawarded him their\nDe Morgan\nMedal in\n1884\n. He was president of the Society\n1868\n-\n1870\n. He was elected a fellow of the\nRoyal Society of Edinburgh\nin\n1865\n. He was elected a fellow of the\nRoyal Astronomical Society\nin\n1857\nand served as editor of the Society's publications from\n1859\nto\n1881\n. In\n1872\nhe was made an honorary fellow of Trinity College, Cambridge. He received honorary degrees from the universities of Cambridge, Oxford, Edinburgh, Dublin, Göttingen, Heidelberg, Leyden and Bologna. A crater on the moon is named for Cayley. He was an honorary foreign member of the French Institute and was elected a fellow of the academies of Berlin, Göttingen, St Petersburg, Milan, Rome, Leyden, Upsala, and Hungary.\nAfter a long period of suffering he died at his home, Garden House, Cambridge. He was buried on\n2\nFebruary\n1895\nin Mill Road cemetery, Cambridge. Many representatives from foreign countries attended his funeral in addition to many of the leading British scholars."
}