{
  "nome_completo": "Attia Abdel Salam Ashour",
  "nome_curto": "Attia Ashour",
  "ano_nascimento": "1924",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ashour/",
  "lugar_nascimento": "Damietta, Egypt",
  "lugar_morte": "Cairo, Egypt",
  "biografia": "Attia Ashour\nwas born in Damietta, also known as Damiata, or Domyat, an Egyptian city on the Nile delta, about\n15\nkm from the Mediterranean Sea. We note that some sources give his date of birth as\n14\nSeptember\n1923\nbut his own account gives\n13\nSeptember. At the time he was born, the Kingdom of Egypt was an independent state for its internal affairs but the British controlled foreign affairs, defence and similar matters. This political set-up lasted until\n1953\nwhen the Republic of Egypt was founded but it was only in\n1956\nthat all British troops were withdrawn.\nAttia's father was a farmer and the family lived in a house just outside the southern side of Damietta, surrounded by fields. He was one of his parents' six children, having four older sisters and one younger brother Ehsan.\nYou can read Attia Ashour's autobiographical account of his upbringing at\nTHIS LINK\n.\nHe showed great skill in arithmetical calculations from a very young age and, when he was seven years old he attended the primary school in Damietta. He studied there for four years and he described it in\n[\n1\n]\n:-\nAlthough the education was not comprehensive, it was a good education and the teachers were really interested in teaching us, although some of them were very harsh. I remember a teacher who beat us very harshly. And he was a huge man who taught us mathematics. In the four years of study, mathematics was very easy for me. It was based on learning arithmetic and computation, which I easily mastered. This may not be a measure of mathematical ability, but at the time it was a measure of excellence. To go to school we looked for someone who was going to Damietta with a donkey to take me with him, or I walked for a long distance on the side of the Sharqiya canal that is now closed, and then a train track was on the other side. Damietta is a very rainy country and has muddy land. My mother would be standing on the roof of the house watching me as I was going to school in a far area of Damietta. Despite this hardship, we would love to go to school and feel comfortable going there.\nHe completed his primary school studies in\n1935\nbut, since there was no secondary school in Damietta, the only possibility to continue his education was to go to Cairo. At this stage his father was keen that Attia, as the eldest boy, should finish his education at this stage and work on the farm with him. His mother, however, supported him in his wish to continue his education. He wrote\n[\n1\n]\n:-\n... my mother, to whom I owe much, was determined that I should complete my studies, and she changed the life of the whole family to achieve this.\nAshour moved to Cairo to continue his education. This was not easy since it meant leaving Damietta where their farm provided them with plentiful supplies of food and everything needed to live a comfortable life, and move to live in Cairo where essentially he had nothing. He settled in the Abbassia district of Cairo and began his studies at the Fuad I secondary school\n(\nnow Abbassia secondary school\n)\n. The choice of school was made because education at this school was free and certainly the family were in no position to pay school fees.\nHe described his time at this school which you can read at\nTHIS LINK\n.\nThe standard course was for four years of secondary education which Ashour completed in\n1939\n. The qualification from these four years study did not allow for admission to university and one further year was required to achieve the university entry certificate. He received this qualification in\n1940\n, but already times were difficult since World War II had begun in\n1939\nand there were food shortages, even getting bread was a problem. At this stage Ashour had to make a decision as to what subjects to study at university. His love was for mathematics and so he wanted to enter the Faculty of Science. Many members of his family, however, were against this and would have liked to see him study medicine or agriculture. At this stage his father did not put pressure on him either way while his mother insisted that he should be allowed to choose the course he wanted. He was always grateful to his mother for the influence and support she was to him.\nIn\n1940\nAshour began his studies in the Faculty of Science at the King Fuad I University in Cairo. In fact the year\n1940\nwas the one when the Egyptian University, founded in\n1908\n, changed its name to the King Fuad I University. It only had this name for twelve years and, in\n1952\nit was renamed again to Cairo University, the name by which it is known today. Ashour studied pure mathematics and applied mathematics, chemistry and physics in his first year but quickly discovered that, although he had a talent for mathematics and theoretical subjects, he was one of the poorest of the students at practical physics experiments. Students worked in a mathematical laboratory where they were taught to calculate with\n7\n-figure logarithms, and also had to study spherical geometry. By the third year he was attending courses on multivariable calculus, mathematical analysis and astronomy. At this time the King Fuad I University was training students to take the external University of London degree examinations, so the courses that they followed were similar to those taught at the University of London in England. This had the advantage that when he graduated with a B.Sc. in\n1944\nhe had a qualification which would let him be accepted for postgraduate studies in England.\nAfter graduating from the Faculty of Science of King Fuad I University, he was appointed as an assistant there on\n3\nOctober\n1944\n. He taught at King Fuad I University for just over a year before leaving in December\n1945\nto travel to England to study for a doctorate. There were two options for scholarships to support students undertaking postgraduate studies, one funded by an insurance company which required the holder to work for the insurance company after receiving a postgraduate degree, and one from the Faculty of Science which would have him return to work at the Faculty of Science. He said he wanted the Faculty of Science scholarship but he was told this was silly since he would earn many times a university salary if he worked for an insurance company. Money, however, was not important to Ashour, and so he took the Faculty of Science scholarship.\nThe head of department at King Fuad I University said that he should do a Ph.D. with a professor in Scotland but Ashour wanted to go to London. One of the applied mathematics lecturers knew\nSydney Chapman\n, a professor at Imperial College, University of London, and arranged an interview for Ashour with\nChapman\n. The interview went very well, and\nChapman\nadmitted Ashour as a doctoral student. Although\nChapman\nwould have liked to be Ashour's advisor, since he was soon to leave Imperial College to take up a position at the University of Oxford, he arranged for Albert T Price to become Ashour's advisor. He was awarded a Ph.D. in\n1948\nfor his work on electromagnetic induction in a non-uniform ionosphere which he described in his thesis\nThe Reduction of Electric Currents in Non-uniform Thin Plane Sheets and Spherical Shells, Having Special Distributions of Conductivity with Application of Geomagnetism\n. In April\n1948\nhe submitted the paper,\nThe induction of electric currents in a non-uniform ionosphere\n, written jointly with his Ph.D. supervisor Albert Price, to the\nRoyal Society of London\nand it was published in December of that year. The Abstract of the paper reads:-\nCalculations are made of the distribution and the magnetic field of the currents induced in a non-uniformly conducting ionospheric shell by an external magnetic field, which is either periodic or subject to sudden changes. Assuming that the initial phase of magnetic storms is due to field changes outside the ionosphere, it is shown that its mean integrated conductivity is probably not much greater than\n1\n0\n−\n7\n10^{-7}\n1\n0\n−\n7\ne.m.u. It is found that electromagnetic shielding by the ionosphere has an important effect on the distribution of field changes observed on the earth, and may lead to an apparent diurnal variation of frequency of occurrence of sudden commencements at a given station. Simple explanations are suggested for some known features of micropulsations, and for some well-known phenomena of magnetic disturbance, including Sangster's rotating disturbance vector.\nAshour returned to Cairo University in early\n1949\nwhere he was appointed as a lecturer. In July of that year he submitted the single authored paper\nThe induction of electric currents in a uniform circular disk\nto the\nQuarterly Journal of Mechanics and Applied Mathematics\nand it was published in January\n1950\n. In the paper Ashour acknowledges Albert Price's help:-\nI wish to thank Professor A T Price of the Imperial College, London, for suggesting this investigation and for his interest and help in its development.\nHere is Ashour's Introduction to the paper:-\nThe induction of electric currents in a conducting circular disk by a varying magnetic field was discussed by\nHorace Lamb\nby treating the disk as the limit of a thin spheroidal shell when its axis becomes vanishingly small. In this way he obtained solutions for those cases in which the resistance at distance r from the centre of a disk of radius a is a special function of\n(\na\n2\n−\nr\n2\n)\n1\n/\n2\n(a^{2} - r^{2} )^{1/2}\n(\na\n2\n−\nr\n2\n)\n1\n/\n2\n, but he was unable to obtain the solution for the case when the resistance is uniform. He was able, however, to estimate a lower limit for the principal time constant of a uniform disk by regarding it as an intermediate case of two known solutions. As far as the writer knows there has been no further mathematical treatment of the uniform disk problem, though J McGarva Bruckshaw has made an experimental investigation of the resulting induced field, with the object of obtaining results useful in geophysical prospecting. In the present paper a method suggested to the writer by Professor A T Price is developed for treating the problem when the conductivity of the disk and the inducing field have axial symmetry. The disk is regarded as composed of a large number of concentric annular circuits, and the problem thereby reduced to the solution of a\nFredholm\nintegral equation. Two methods of solving this equation are described and illustrated with a numerical example. The time constant for a uniform disk is calculated and agrees approximately with the value estimated by\nLamb\n.\nIn\n[\n4\n]\nthere is a summary of Ashour's career. We give a version below which we have updated:-\nHe successively became a Lecturer, Senior Lecturer, Assistant Professor and Professor of Applied Mathematics, Faculty of Science, Cairo University,\n1948\n-\n1984\n. He was Head of the Mathematics Department, Faculty of Science, Cairo University:\n1959\n-\n1960\n,\n1965\n-\n1969\n,\n1971\n-\n1976\n,\n1980\n-\n1984\n. Professor Ashour was appointed Professor Emeritus of Applied Mathematics, Cairo University, in\n1984\n.\nProfessor Ashour was a visiting scientist at Queen Mary College, London University in\n1954\n; at the Physics Institute, Bonn University,\n1955\n;\n1955\n-\n1956\n, at the Institute de Radium, University de Paris;\n1962\n-\n1963\n, Exeter University, UK; and\n1972\n, Physics Department, Ibadan University, Nigeria. He was an external examiner for BSc examinations\n(\nMathematics\n)\nand PhD theses\n(\nMathematics and Physics\n)\nat several British, Indian and Nigerian Universities.\nHe was Director of the Advanced Schools on the Physics of the Earth, International Centre of Theoretical Physics, Trieste Italy,\n1977\n,\n1980\n,\n1994\n, and visiting professor, Institute of Geophysics, Potsdam, GDR,\n1969\n,\n1980\n(\non the invitation of the GDR Academy of Sciences\n)\n.\nProfessor Ashour was past president of the Mathematical and Physical Society of Egypt and the editor of the 'Proceedings' of the Society. He was a member of the Egyptian Mathematical Society, the\nEgyptian Academy of Sciences\n, the Egyptian Geophysical Society, the \"Institute d'Egypte,\" and the Egyptian Academy of the Arab Language\n(1990)\n.\nOn the international scene, Professor Ashour was a Member of the Editorial Boards of the Journals: 'Africa Mathematica', 'Arab Journal of Mathematics', and the 'Journal of Geophysics'. Moreover, he was a Fellow of the\nRoyal Astronomical Society\nfrom\n1954\n; a Fellow of the American Geophysical Union from\n1964\n; the Chairman of the Inter-divisional Working Group on Internal and External Fields of the International Association of Geomagnetism and Aeronomy,\n1973\n-\n1979\n; the Vice-President of six International Union of Geodesy and Geophysics,\n1971\n-\n1975\n; and President of the International Union of Geodesy and Geophysics\n1975\n-\n1979\n. He was Chairman of the International Union of Geodesy and Geophysics Committee on Geodesy and Geophysics,\n1974\n-\n1983\n. He was President of the Arab Union of Mathematicians and Physics,\n1975\n-\n1977\n; Vice-President of the\nAfrican Mathematical Union\n,\n1976\n-\n1986\n; elected a Fellow of the Third World Academy of Sciences,\n1985\n; a Founding Fellow and Vice President of the African Academy of Sciences,\n1985\n; the President of the International Centre of Pure and Applied Mathematics, Nice, France,\n1992\n-\n1996\n; and a member of the International Union of Pure and Applied Physics,\n1988\n-\n1994\n.\nFor some time, Professor Ashour was a member of the Advisory Board to the Director General of UNESCO on Science and the\n21\nst Century. He was awarded the Order of Merit of Arts and Sciences, First Grade, three times:\n1966\n,\n1986\nand\n1988\n; the Order of Merit of Republic of Egypt, Fifth Grade,\n1954\nand of the Second Grade\n1984\n; Chevalier dans l'Ordre de la Palme Academique, France,\n1985\n; the Medal of the\nAfrican Mathematical Union\n,\n1990\n; and the Chevalier dans l'Ordre National de Mérite, France,\n1995\n. Professor Ashour co-authored the books covering the Mathematics Syllabus of the General Certificate of Education as early as\n1958\n. He was the Chief Editor of four books on Geophysics written specially for the scientists in the developing countries. Professor Ashour has authored more than\n50\nscientific papers in as many years. He was elected a Fellow of the Islamic World Academy of Sciences in\n2000\n.\nFor the obituary\n[\n3\n]\n, see\nTHIS LINK\n.\nLet us end with the Closing Remarks of Uri Shamir to the General Assembly of the International Union of Geodesy & Geophysics\n[\n6\n]\n:-\n... it is my pleasure to present a special award, which is a surprise, to a person who has been a guiding light for the International Union of Geodesy & Geophysics since at least\n1971\n, when he was elected Vice President of the International Union of Geodesy & Geophysics. He was then elected President from\n1975\n-\n1979\n, and then was elected to the Finance Committee in\n1983\n- a position to which he was re-elected three more times. During his last term,\n1995\n-\n1999\n, he served as the President of the Finance Committee. This person can be no other than Dr Attia Ashour, a much respected and much loved member of our community. Dr Ashour, please accept this small gift and the gratitude of the International Union of Geodesy & Geophysics for your\n22\nyears of service."
}