{
  "nome_completo": "Augustin Louis Cauchy",
  "nome_curto": "Augustin-Louis Cauchy",
  "ano_nascimento": "1789",
  "ano_morte": "1857",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cauchy/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Sceaux (near Paris), France",
  "biografia": "Paris was a difficult place to live in when\nAugustin-Louis Cauchy\nwas a young child due to the political events surrounding the French Revolution. When he was four years old his father, fearing for his life in Paris, moved his family to Arcueil. There things were hard and he wrote in a letter\n[\n4\n]\n:-\nWe never have more than a half pound of bread - and sometimes not even that. This we supplement with the little supply of hard crackers and rice that we are allotted.\nThey soon returned to Paris and Cauchy's father was active in the education of young Augustin-Louis.\nLaplace\nand\nLagrange\nwere visitors at the Cauchy family home and\nLagrange\nin particular seems to have taken an interest in young Cauchy's mathematical education. Lagrange advised Cauchy's father that his son should obtain a good grounding in languages before starting a serious study of mathematics. In\n1802\nAugustin-Louis entered the École Centrale du Panthéon where he spent two years studying classical languages.\nFrom\n1804\nCauchy attended classes in mathematics and he took the entrance examination for the École Polytechnique in\n1805\n. He was examined by\nBiot\nand placed second. At the École Polytechnique he attended courses by\nLacroix\n,\nde Prony\nand\nHachette\nwhile his analysis tutor was\nAmpère\n. In\n1807\nhe graduated from the École Polytechnique and entered the engineering school École des Ponts et Chaussées. He was an outstanding student and for his practical work he was assigned to the Ourcq Canal project where he worked under\nPierre Girard\n.\nIn\n1810\nCauchy took up his first job in Cherbourg to work on port facilities for Napoleon's English invasion fleet. He took a copy of\nLaplace\n's\nMécanique Céleste\nⓉ\n(\nCelestial mechanics\n)\nand one of\nLagrange\n's\nThéorie des Fonctions\nⓉ\n(\nTheory of functions\n)\nwith him. It was a busy time for Cauchy, writing home about his daily duties he said\n[\n4\n]\n:-\nI get up at four o'clock each morning and I am busy from then on. ... I do not get tired of working, on the contrary, it invigorates me and I am in perfect health...\nCauchy was a devout Catholic and his attitude to his religion was already causing problems for him. In a letter written to his mother in\n1810\nhe says:-\nSo they are claiming that my devotion is causing me to become proud, arrogant and self-infatuated. ... I am now left alone about religion and nobody mentions it to me anymore...\nIn addition to his heavy workload Cauchy undertook mathematical researches and he proved in\n1811\nthat the angles of a convex polyhedron are determined by its faces. He submitted his first paper on this topic then, encouraged by\nLegendre\nand\nMalus\n, he submitted a further paper on polygons and polyhedra in\n1812\n. Cauchy felt that he had to return to Paris if he was to make an impression with mathematical research. In September of\n1812\nhe returned to Paris after becoming ill. It appears that the illness was not a physical one and was probably of a psychological nature resulting in severe depression.\nBack in Paris Cauchy investigated symmetric functions and submitted a memoir on this topic in November\n1812\n. This was published in the Journal of the École Polytechnique in\n1815\n. However he was supposed to return to Cherbourg in February\n1813\nwhen he had recovered his health and this did not fit with his mathematical ambitions. His request to\nde Prony\nfor an associate professorship at the École des Ponts et Chaussées was turned down but he was allowed to continue as an engineer on the Ourcq Canal project rather than return to Cherbourg.\nPierre Girard\nwas clearly pleased with his previous work on this project and supported the move.\nAn academic career was what Cauchy wanted and he applied for a post in the Bureau des Longitudes. He failed to obtain this post,\nLegendre\nbeing appointed. He also failed to be appointed to the geometry section of the Institute, the position going to\nPoinsot\n. Cauchy obtained further sick leave, having unpaid leave for nine months, then political events prevented work on the Ourcq Canal so Cauchy was able to devote himself entirely to research for a couple of years.\nOther posts became vacant but one in\n1814\nwent to\nAmpère\nand a mechanics vacancy at the Institute, which had occurred when Napoleon Bonaparte resigned, went to Molard. In this last election Cauchy did not receive a single one of the\n53\nvotes cast. His mathematical output remained strong and in\n1814\nhe published the memoir on definite integrals that later became the basis of his theory of complex functions.\nIn\n1815\nCauchy lost out to\nBinet\nfor a mechanics chair at the École Polytechnique, but then was appointed assistant professor of analysis there. He was responsible for the second year course. In\n1816\nhe won the Grand Prix of the\nFrench Academy of Sciences\nfor a work on waves. He achieved real fame however when he submitted a paper to the Institute solving one of\nFermat\n's claims on\npolygonal numbers\nmade to\nMersenne\n. Politics now helped Cauchy into the\nAcademy of Sciences\nwhen\nCarnot\nand\nMonge\nfell from political favour and were dismissed and Cauchy filled one of the two places.\nIn\n1817\nwhen\nBiot\nleft Paris for an expedition to the Shetland Islands in Scotland Cauchy filled his post at the Collège de France. There he lectured on methods of integration which he had discovered, but not published, earlier. Cauchy was the first to make a rigorous study of the conditions for convergence of infinite series in addition to his rigorous definition of an integral. His text\nCours d'analyse\nⓉ\n(\nCourse of analysis\n)\nin\n1821\nwas designed for students at École Polytechnique and was concerned with developing the basic theorems of the calculus as rigorously as possible. He began a study of the calculus of residues in\n1826\nin\nSur un nouveau genre de calcul analogue au calcul infinitésimal\nⓉ\n(\nOn a new kind of calculus similar infinitesimal calculus\n)\nwhile in\n1829\nin\nLeçons sur le Calcul Différentiel\nⓉ\n(\nLessons on differential calculus\n)\nhe defined for the first time a complex function of a complex variable.\nCauchy did not have particularly good relations with other scientists. His staunchly Catholic views had him involved on the side of the Jesuits against the\nAcadémie des Sciences\n. He would bring religion into his scientific work as for example he did on giving a report on the theory of light in\n1824\nwhen he attacked the author for his view that\nNewton\nhad not believed that people had souls. He was described by a journalist who said:-\n... it is certain a curious thing to see an academician who seemed to fulfil the respectable functions of a missionary preaching to the heathens.\nAn example of how Cauchy treated colleagues is given by\nPoncelet\nwhose work on\nprojective geometry\nhad, in\n1820\n, been criticised by Cauchy:-\n... I managed to approach my too rigid judge at his residence ... just as he was leaving ... During this very short and very rapid walk, I quickly perceived that I had in no way earned his regards or his respect as a scientist ... without allowing me to say anything else, he abruptly walked off, referring me to the forthcoming publication of his Leçons à 'École Polytechnique where, according to him, 'the question would be very properly explored'.\nAgain his treatment of\nGalois\nand\nAbel\nduring this period was unfortunate.\nAbel\n, who visited the Institute in\n1826\n, wrote of him:-\nCauchy is mad and there is nothing that can be done about him, although, right now, he is the only one who knows how mathematics should be done.\nBelhoste in\n[\n4\n]\nsays:-\nWhen\nAbel\n's untimely death occurred on April\n6\n,\n1829\n, Cauchy still had not given a report on the\n1826\npaper, in spite of several protests from\nLegendre\n. The report he finally did give, on June\n29\n,\n1829\n, was hasty, nasty, and superficial, unworthy of both his own brilliance and the real importance of the study he had judged.\nBy\n1830\nthe political events in Paris and the years of hard work had taken their toll and Cauchy decided to take a break. He left Paris in September\n1830\n, after the revolution of July, and spent a short time in Switzerland. There he was an enthusiastic helper in setting up the Académie Helvétique but this project collapsed as it became caught up in political events.\nPolitical events in France meant that Cauchy was now required to swear an oath of allegiance to the new regime and when he failed to return to Paris to do so he lost all his positions there. In\n1831\nCauchy went to Turin and after some time there he accepted an offer from the King of Piedmont of a chair of theoretical physics. He taught in Turin from\n1832\n.\nMenabrea\nattended these courses in Turin and wrote that the courses\n[\n4\n]\n:-\nwere very confused, skipping suddenly from one idea to another, from one formula to the next, with no attempt to give a connection between them. His presentations were obscure clouds, illuminated from time to time by flashes of pure genius. ... of the thirty who enrolled with me, I was the only one to see it through.\nIn\n1833\nCauchy went from Turin to Prague in order to follow Charles X and to tutor his grandson. However he was not very successful in teaching the prince as this description shows:-\n... exams .. were given each Saturday. ... When questioned by Cauchy on a problem in descriptive geometry, the prince was confused and hesitant. ... There was also material on physics and chemistry. As with mathematics, the prince showed very little interest in these subjects. Cauchy became annoyed and screamed and yelled. The queen sometimes said to him, soothingly, smilingly, 'too loud, not so loud'.\nWhile in Prague Cauchy had one meeting with\nBolzano\n, at\nBolzano\n's request, in\n1834\n. In\n[\n16\n]\nand\n[\n18\n]\nthere are discussions on how much Cauchy's definition of continuity is due to\nBolzano\n,\nFreudenthal\n's view in\n[\n18\n]\nthat Cauchy's definition was formed before\nBolzano\n's seems the more convincing.\nCauchy returned to Paris in\n1838\nand regained his position at the\nAcademy\nbut not his teaching positions because he had refused to take an oath of allegiance.\nDe Prony\ndied in\n1839\nand his position at the Bureau des Longitudes became vacant. Cauchy was strongly supported by\nBiot\nand\nArago\nbut\nPoisson\nstrongly opposed him. Cauchy was elected but, after refusing to swear the oath, was not appointed and could not attend meetings or receive a salary.\nIn\n1843\nLacroix\ndied and Cauchy became a candidate for his mathematics chair at the Collège de France.\nLiouville\nand\nLibri\nwere also candidates. Cauchy should have easily been appointed on his mathematical abilities but his political and religious activities, such as support for the Jesuits, became crucial factors.\nLibri\nwas chosen, clearly by far the weakest of the three mathematically, and\nLiouville\nwrote the following day that he was:-\ndeeply humiliated as a man and as a mathematician by what took place yesterday at the Collège de France.\nDuring this period Cauchy's mathematical output was less than in the period before his self-imposed exile. He did important work on\ndifferential equations\nand applications to mathematical physics. He also wrote on mathematical astronomy, mainly because of his candidacy for positions at the Bureau des Longitudes. The\n4\n-volume text\nExercices d'analyse et de physique mathématique\nⓉ\n(\nExercises in analysis and mathematical physics\n)\npublished between\n1840\nand\n1847\nproved extremely important.\nWhen Louis Philippe was overthrown in\n1848\nCauchy regained his university positions. However he did not change his views and continued to give his colleagues problems.\nLibri\n, who had been appointed in the political way described above, resigned his chair and fled from France. Partly this must have been because he was about to be prosecuted for stealing valuable books.\nLiouville\nand Cauchy were candidates for the chair again in\n1850\nas they had been in\n1843\n. After a close run election\nLiouville\nwas appointed. Subsequent attempts to reverse this decision led to very bad relations between\nLiouville\nand Cauchy.\nAnother, rather silly, dispute this time with\nDuhamel\nclouded the last few years of Cauchy's life. This dispute was over a priority claim regarding a result on inelastic shocks.\nDuhamel\nargued with Cauchy's claim to have been the first to give the results in\n1832\n.\nPoncelet\nreferred to his own work of\n1826\non the subject and Cauchy was shown to be wrong. However Cauchy was never one to admit he was wrong. Valson writes in\n[\n7\n]\n:-\n...the dispute gave the final days of his life a basic sadness and bitterness that only his friends were aware of...\nAlso in\n[\n7\n]\na letter by Cauchy's daughter describing his death is given:-\nHaving remained fully alert, in complete control of his mental powers, until\n3\n.\n30\na.m.. my father suddenly uttered the blessed names of Jesus, Mary and Joseph. For the first time, he seemed to be aware of the gravity of his condition. At about four o'clock, his soul went to God. He met his death with such calm that made us ashamed of our unhappiness.\nNumerous terms in mathematics bear Cauchy's name:- the Cauchy integral theorem, in the theory of complex functions, the Cauchy-\nKovalevskaya\nexistence theorem for the solution of\npartial differential equations\n, the Cauchy-\nRiemann\nequations and Cauchy sequences. He produced\n789\nmathematics papers, an incredible achievement. This achievement is summed up in\n[\n4\n]\nas follows:-\n... such an enormous scientific creativity is nothing less than staggering, for it presents research on all the then-known areas of mathematics ... in spite of its vastness and rich multifaceted character, Cauchy's scientific works possess a definite unifying theme, a secret wholeness. ... Cauchy's creative genius found broad expression not only in his work on the foundations of real and complex analysis, areas to which his name is inextricably linked, but also in many other fields. Specifically, in this connection, we should mention his major contributions to the development of mathematical physics and to theoretical mechanics... we mention ... his two theories of elasticity and his investigations on the theory of light, research which required that he develop whole new mathematical techniques such as Fourier transforms, diagonalisation of\nmatrices\n, and the calculus of residues.\nHis collected works,\nOeuvres complètes d'Augustin Cauchy\nⓉ\n(\nThe complete works of Augustin Cauchy\n)\n(1882\n-\n1970)\n, were published in\n27\nvolumes."
}