{
  "nome_completo": "Autolycus of Pitane",
  "nome_curto": "Autolycus",
  "ano_nascimento": "360 BC",
  "ano_morte": "290 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Autolycus/",
  "lugar_nascimento": "Pitane, Aeolis, Asia Minor (now Turkey)",
  "lugar_morte": null,
  "biografia": "We know some information about the life of\nAutolycus of Pitane,\nbut not really enough to date him accurately. He was a teacher of\nArcesilaus\nwho was born in\n315\nBC so Autolycus must have lived until after\n300\nBC. It is generally assumed that he was older than\nEuclid\n. As\nHeath\nwrites in\n[\n3\n]\n:-\nThat he wrote earlier than\nEuclid\nis clear from the fact that\nEuclid\n... makes use of theorems appearing in Autolycus, though, as usual in such cases, giving no indication of their source.\nHowever, before we accept\nHeath\n's 'clear' argument, it is reasonable to put a counter argument from\nNeugebauer\n[\n4\n]\n:-\nThe generally accepted argument in favour of Autolycus's priority is singularly naive. Theorem\n2\nof\nEuclid\n's Phaenomena consists of four propositions with proofs for only three of them while the missing one is replaced by the remark \"that this is the case has been shown elsewhere\"; indeed theorem and proof are found as Theorem\n10\nin Autolycus's 'Rotating Sphere'. That a remark of this kind should be genuine in any Greek mathematical treatise, Euclidean or not, seems to me utterly implausible; I would assume the obvious, i.e. that a scholion replaced, perhaps in a damaged copy, the first of four proofs by a simple reference to generally known theorems. In fact I see no reason why\nEuclid\n(\npresumably in Alexandria\n)\nand Autolycus\n(\npresumably in Athens\n)\nshould not have written independently, and perhaps even simultaneously, on the mathematical theory of astronomical phenomena.\nHuxley, writing in\n[\n1\n]\n, agrees with\nHeath\n, and the paper\n[\n4\n]\neven has the title\nAutolycus of Pitane, predecessor of\nEuclid\n. The priority argument is certainly not an unimportant one for the interdependence of\nEuclid\nand Autolycus on each other is significant since Autolycus writes his propositions in exactly the same general style as\nEuclid\n. This means that a theorem in Autolycus's work has first a general statement, then a construction related to a particular figure with points in the figure denoted by letters, next comes the demonstration of the theorem, and finally a conclusion relating to the general statement is sometimes drawn. Despite the arguments above, one must still draw the same conclusion whichever treatise was written first, namely that this style of mathematical exposition accepted today as so characteristic of\nEuclid\n, was certainly not invented by him. Despite the style being used by Autolycus, nobody credits him with inventing it either.\nWe have been taken down a fascinating road by the comparisons with\nEuclid\n, but we should return to give the only other detail of Autolycus's life which is reported by\nDiogenes Laertius\n, when he relates that Arcesilaus was accompanied by his teacher Autolycus on a journey to Sardis.\nAnother important fact regarding Autolycus is that two of his books have survived in the original Greek and we believe that they are the earliest two mathematics works to have survived. Of these books,\nOn the Moving Sphere\nis a work on the geometry of the sphere which is the same as being a mathematical astronomy text. The second work\nOn Risings and Settings\nis a book more on observational astronomy.\nTheodosius\n,\n200\nyears later, wrote\nSphaerics\n, a similar book on the geometry of the sphere, also written to provide a mathematical background for astronomy. It is thought that\nTheodosius\n's\nSphaerics\nand Autolycus's work\nOn the Moving Sphere\nare based on the same pre-Euclidean textbook which is now lost. It is conjectured, on rather little evidence one would have to say, that\nEudoxus\nwrote this earlier text. There seems to be no way in which the speculation on this point can ever be settled.\nThat Autolycus relys heavily on Eudoxus for his view of astronomy is not in doubt. He is a strong supporter of\nEudoxus\n's theory of\nhomocentric spheres\nwhich consisted of a number of rotating spheres, each sphere rotating about an axis through the centre of the Earth. This theory had a difficulty which had been quickly noticed, namely that Venus and Mars varied in brightness and there was no mechanism for this in\nEudoxus\n's theory. Again eclipses of the sun were sometimes total, sometimes annular where moon appears smaller than the sun and a ring of the sun is visible right round the moon. Despite Autolycus's attempts to explain these observations within\nEudoxus\n's theory, he had no real answer to these problems.\nOn Risings and Settings\nis a work which consists of two books. Schmidt's interesting article\n[\n7\n]\nwas written to show that in fact these are not two parts of a single two volume work but rather they were both versions of the same piece of work. The second book is actually a revised and expanded edition of the first, which contains quite a bit of new material. It is also a better constructed book and it is interesting to see how Autolycus's book has developed and improved between the two editions."
}