{
  "nome_completo": "Béla Bollobás",
  "nome_curto": "Béla Bollobás",
  "ano_nascimento": "1943",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bollobas/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": null,
  "biografia": "Béla Bollobás\n's father was a physician. Béla was brought up in Budapest where he attended school. He also had private tutors, not to teach him school subjects but to teach him other activities. These tutors, who had held important positions in Hungary before the Communists took over, had been forced out of their jobs and had taken up teaching. They included a former general, a count, a baroness and a former judge. Bollobás entered the mathematical competitions which were part of the Hungarian school tradition and, when he was fourteen years old, he won a national competition. By this time\nPaul Erdős\nwas spending most of his time in Israel but returning to Hungary quite frequently. He was in Budapest for a couple of weeks when he heard that Bollobás had won the competition so he invited him to meet him at his hotel. They had lunch together and from that time on\nErdős\nkept in touch with Bollobás, usually by letter but also seeing each other at times when\nErdős\nwas in Budapest. Much of Bollobás's early mathematical work was strongly influenced by\nErdős\nand in fact his first paper\nExtremal problems in graph theory\n(\nHungarian\n)\n, written while still at high school, was a joint publication with\nErdős\nappearing in\n1962\n.\nBollobás attended Budapest University where he joined the research group headed by László Fejes Tóth who worked on discrete geometry. However, Bollobás considers\nErdős\nto be his real advisor while he was undertaking research for his doctorate for it was\nErdős\nwho kept in contact suggesting problems for him to look at. For example Bollobás published\nOn graphs without two independent circuits\n(\nHungarian\n)\nin\n1963\nwhich solves a special case of a problem posed by\nErdős\nwhile\nOn generalized graphs\n(1965)\ngeneralises a result by\nErdős\n,\nHajnal\nand Moon. He also worked on packings, coverings, and tilings for his doctorate, publishing papers such as\nFilling the plane with congruent convex hexagons without overlapping\n(1963)\n.\nDonald Coxeter\nreviewed this paper:-\nThe problem of filling and covering the Euclidean plane with congruent\n(\nbut not necessarily \"equivalent\"\n)\npolygons was discussed by\nKepler\n,\nHilbert\n... The author obtains some significant restrictions on the possible kinds of convex hexagons that can serve as a tile. In particular, he proves that if the plane can be filled with congruent hexagons, it can be filled with the same hexagons in such a way that each vertex belongs to exactly three of them. On the other hand, vertices of higher valency can easily occur; for instance, the author has drawn a pattern of irregular\n(\nbut equilateral\n)\nhexagons having the symmetry of a regular pentagon.\nSince travelling to different countries was difficult for Hungarians during these years of Communist control, Bollobás always felt claustrophobic and wanted to travel. While an undergraduate he had asked\nErdős\nto help him visit Israel\n(\nwhere\nErdős\nwas spending most of his time\n)\nbut\nErdős\nsuggested that it would be more sensible for him to visit Cambridge in England. A strong recommendation from\nErdős\nto\nHarold Davenport\nand a long frustrating campaign to get permission from the Communist authorities eventually paid off. Bollobás spent a year in Cambridge and, soon after returning to Hungary, received the offer of a scholarship from Cambridge to complete his Ph.D. there. However, he was not allowed to take this up and, in\n1967\n, completed his doctorate in Budapest. He was also offered a scholarship to study in Paris, but again the authorities refused permission for him to leave the country.\nTravel to Russia was more acceptable to the Hungarian authorities so, after completing his doctorate in Budapest, Bollobás spent a highly productive year in Moscow working with\nIsrail Moiseevic Gelfand\n. While in Moscow,\nGelfand\nsuggested that Bollobás should try to visit\nMichael Atiyah\nor\nFrank Adams\nin England. A while after he had returned to Budapest from Moscow, he received the offer of a scholarship from Oxford where\nAtiyah\nheld the Savilian Chair of Geometry. This time he was given permission and spent a year at Christ Church, Oxford, travelling there with his wife Gabriella\n[\n5\n]\n:-\nBy then, I said to myself, \"If I ever manage to leave Hungary, I won't return.\" So when I arrived in Oxford, I decided to take up my old scholarship to Cambridge rather than return to Hungary. That way I didn't have to apply for anything because it had been sitting there for years. But then within a year, I got a fellowship from Trinity College, which was better than getting a PhD. There was no pressure on me whatsoever to submit for another PhD. But I thought that as the College had given me a scholarship to do a PhD, it was my duty to get one.\nLet us say a little at this point about Gabriella Bollobás. She, like her husband, was born in Budapest. She worked in Hungary as an actress, musician, and singer before the family moved to England where she trained as a sculptor. She has produced busts of many famous mathematicians, for example\nPaul Dirac\n,\nJohn von Neumann\n,\nGeorge Batchelor\n,\nBill Tutte\n, and\nStephen Hawking\n, as well as a cast bronze of\nDavid Hilbert\n.\nThe fellowship from Trinity College mentioned in the above quote was awarded to Bollobás in\n1970\nand, although\nFrank Adams\nbecame his official thesis supervisor, he found the problems from the Functional Analysis Seminar. He was awarded a second Ph.D. in\n1972\nfor his thesis\nBanach Algebras and the Theory of Numerical Ranges\n. His main area of research, however, was in combinatorics, particularly in graph theory. Two areas of graph theory were of most interest to him. One was extremal graph theory which, in the early\n1970\ns, was a popular area of research in Hungary but not in western Europe or in the United States. Bollobás started to write a book on the subject\n[\n5\n]\n:-\nI very much wanted to show that extremal graph theory was a pretty serious subject and not only a collection of random problems that\nErdős\nthought up and popularized. ... my aim was to show that there is such a theory - extremal graph theory. I started to write \"Extremal graph theory\" very soon after I arrived in Cambridge but it took me ages to finish. I had to take a sabbatical to find enough time to finish it.\nIn fact\nExtremal graph theory\nwas published in\n1978\n. Michael Albertson writes in a review:-\nThe author interprets extremal graph theory as \"structural results and any relations among the invariants of a graph, especially those concerned with best possible inequalities''. Thus the content of this book is not as narrow as the title might suggest. ... This is an excellent second book in graph theory. The reviewer has on a number of occasions opened this book up to look for a specific result and been seduced into reading for hours.\nThe second area of graph theory which particularly interested Bollobás was random graph theory. This topic, initiated by\nErdős\nand\nRényi\naround\n1960\n, began to attract world-wide attention by the early\n1970\ns and Bollobás's interest was fired during a term that\nErdős\nspent working with him in Cambridge on the topic. The monograph that Bollobás wrote entitled\nRandom graphs\nwas published in\n1985\n. Colin McDiarmid writes in a review:-\nThere are many beautiful results in the theory of random graphs, and the main aim of the book is to introduce the reader to these results and to methods which prove them. ... This book is the first systematic and extensive account of a substantial body of methods and results from the theory of random graphs. It is largely self-contained, with wide coverage. It deals with probabilistic rather than enumerative approaches .... It is very well written and the material is covered in depth ... The author is a major figure who has considerably advanced the theory of random graphs, and it is fitting that he should write what will surely be the standard text.\nBut Bollobás was interested in graph theory not only as a research topic but also as an area which should be taught in undergraduate courses. He published\nGraph theory. An introductory course\nin\n1979\nand he makes clear in the preface why he wrote the textbook:-\nThis book is intended for the young student who is interested in graph theory and wishes to study it as part of his mathematical education. Experience at Cambridge shows that none of the currently available texts meet this need. Either they are too specialised for their audience or they lack the depth and development needed to reveal the nature of the subject. We start from the premise that graph theory is one of several courses which compete for the student's attention and should contribute to his appreciation of mathematics as a whole. Therefore, the book does not consist merely of a catalogue of results but also contains extensive descriptive passages designed to convey the flavour of the subject and to arouse the student's interest. Those theorems which are vital to the development are stated clearly, together with full and detailed proofs. The book thereby offers a leisurely introduction to graph theory which culminates in a thorough grounding in most aspects of the subject. ... Throughout this book the reader will discover connections with various other branches of mathematics, including optimization theory, linear algebra, group theory, projective geometry, representation theory,\nprobability theory\n, analysis, knot theory and ring theory. Although most of these connections are not essential for an understanding of the book, the reader would benefit greatly from a modest acquaintance with these subjects.\nFrank Harary\n, a leading researcher in graph theory, writes:-\nThis is an important and useful book. It contains a wealth of up-to-date material some of which is not readily available except in research papers.\nThe output of high quality publications from Bollobás is remarkable. As of early\n2011\n, MathSciNet lists\n433\npublications by Bollobás written with\n141\nco-authors. We must, however, give details of his career following his appointment at the University of Cambridge in\n1971\n. He remained at Cambridge until\n1996\nbut he made many extended visits to the Louisiana State University at Baton Rouge. In\n1996\nhe was offered the Jabie Hardin Chair of Excellence in Combinatorics at the Department of Mathematics of the University of Memphis, Tennessee. In fact he had been persuaded that he should take this chair by\nErdős\n[\n5\n]\n:-\n... we went to Memphis because my wife got absolutely fed up with Cambridge, finding it claustrophobic, and\nErdős\nsuggested that I go to Memphis, which he had visited many times, often several times a year. In Memphis I have a really wonderful job - no lecturing, no administration, a great assistant to look after me, funds to invite visitors, funds to travel, very clever and kind colleagues, an excellent gym, and so on. Although I do not have to lecture, I always give a graduate course on a topic I hope to write a book on.\nHowever, Bollobás kept his connections with Cambridge. He retained his fellowship at Trinity College when he went to Memphis in\n1996\nand, since\n2005\n, has been a Senior Research Fellow of Trinity College, Cambridge. He has received honours including election to that\nHungarian Academy of Sciences\nand the award of the Senior\nWhitehead\nPrize by the\nLondon Mathematical Society\nin\n2007\n. The citation for this award reads:-\nBéla Bollobás is a world leader in combinatorics and has made fundamental contributions to almost every aspect of this huge area of mathematics. As well as all his papers, he has written a string of extraordinarily influential textbooks, many of which have had the effect of defining\n(\nor in some cases redefining\n)\nwhole areas of research.\nLet us look at some of his more recent books. He published the undergraduate text\nLinear analysis. An introductory course\nin\n1990\n. Steve Abbott, reviewing the second edition\n(1999)\nof the book, writes\n[\n1\n]\n:-\nBéla Bollobás writes with clarity and has clearly thought about the needs of his readers. First-time students of\nfunctional analysis\nwill thank him for his willingness to remind them about notation and to repeat definitions that he has not used for a while. He also guides the reader by motivating the definitions and theorems. ... Bollobás has written a fine book. It is an excellent introduction to functional analysis that will be invaluable to advanced undergraduate students\n(\nand their lecturers\n)\n.\nIn\n1998\nBollobás published\nModern graph theory\n. He writes in the Preface:-\nThe time has now come when graph theory should be part of the education of every serious student of mathematics and computer science, both for its own sake and to enhance the appreciation of mathematics as a whole. This book is an in-depth account of graph theory, written with such a student in mind; it reflects the current state of the subject and emphasizes connections with other branches of mathematics, like optimization theory, group theory, matrix algebra, probability theory, logic, and knot theory.\nJerrold Grossman writes in a review:-\nThis well-crafted and well-written work, by one of the leading researchers and expositors in graph theory\n(\nespecially extremal graph theory and random graphs\n)\n, brings the author's vast knowledge, expertise, taste, and judgment to bear on an increasingly important and mainstream subject, which has long since emerged from its denigrated beginnings in the \"slums of topology''. The work is full of insights ..., interpreting the material and explaining what is important, what open problems are likely to be difficult to solve\n(\ne.g., the perfect graph conjecture\n)\n, and how things inter-relate\n(\ne.g.,\nJones\npolynomials of link diagrams and\nTutte\npolynomials of graphs\n)\n. We are made to feel that the author is leading us through the subject, engaging us in conversation, rather than just lecturing\n(\nfor example, in the exposition of\nCayley\ngraphs\n)\n.\nBollobás's two most recent books, both published in\n2006\n, are\n(\nwith Oliver Riordan\n)\nPercolation\n, and the single-authored work\nThe art of mathematics. Coffee time in Memphis\n. The publisher,\nCambridge University Press\n, describes this last mentioned work as follows:-\nCan a Christian escape from a lion? How quickly can a rumour spread? Can you fool an airline into accepting oversize baggage? Recreational mathematics is full of frivolous questions in which the mathematician's art can be brought to bear. But play often has a purpose, whether it's bear cubs in mock fights, or war games. In mathematics, it can sharpen skills, or provide amusement, or simply surprise, and collections of problems have been the stock-in-trade of mathematicians for centuries. Two of the twentieth century's greatest players of problem posing and solving,\nErdős\nand\nLittlewood\n, are the inspiration for this collection, which is designed to be sipped from, rather than consumed in one sitting. The questions themselves range in difficulty: the most challenging offer a glimpse of deep results that engage mathematicians today; even the easiest are capable of prompting readers to think about mathematics. All come with solutions, many with hints, and most with illustrations. Whether you are an expert, a beginner, or an amateur, this book will delight for a lifetime.\nFinally, let us note that among his many distinguished research students is Imre Leader, Jonathan Partington, Luke Pebody and the Fields Medallist\nTimothy Gowers\n."
}