{
  "nome_completo": "Barry Edward Johnson",
  "nome_curto": "Barry Johnson",
  "ano_nascimento": "1937",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Johnson_Barry/",
  "lugar_nascimento": "Woolwich, London, England",
  "lugar_morte": "Newcastle upon Tyne, England",
  "biografia": "Barry Johnson\n's father was an engineer whose first jobs used his skill as a toolmaker then later he became a planning engineer. Barry's mother was a secretary at Warner Brothers. Barry was the oldest of his parents three children, having one younger brother and a younger adopted sister. He was educated at Epsom County Grammar School in Surrey, England, and then at Hobart State High School in Tasmania after the family moved there in\n1951\n. After his family returned to England, Johnson remained at Hobart High School since the headmaster had told them of his\n[\n1\n]\n:-\n... exceptional high all-round intelligence\npersuading him to remain there to study for a place at university.\nAlthough only\n16\nyears of age, he won an entrance scholarship to the University of Tasmania in March\n1954\n. He entered the University of Tasmania, living with a\n[\n1\n]\n:-\n... kind family, but with little spare cash for clothing or luxuries.\nJohnson studied mathematics as his main subject but he was also extremely successful in his subsidiary subjects of physics and chemistry, winning a prize from the Royal Australian Chemical Institute. During the university vacations he undertook National Service so that he was exempted from the otherwise compulsory military service when he returned to England. He was awarded a B.Sc. with First Class Honours from the University of Tasmania in\n1956\n. Peter Sprent, who taught him during his undergraduate years, writes\n[\n1\n]\n:-\nFew students have ever inspired their lecturers as did Barry Johnson at the University of Tasmania in the\n1950\ns. It was then the practice in the mathematics department to encourage honours students to give seminars for fellow students and lecturers. Johnson's contribution to these, as well as his penetrating and challenging\n(\nbut never aggressive\n)\nquestioning of views expressed in lectures left no doubt among his teachers that we were contributing in a modest way to the training of a mathematical giant. A small incident that epitomises this remains fresh in my memory. Berated by colleagues for having set too hard an examination paper, my defences crumbled when a senior colleague's response to my request to justify the charge was: \"Of course, it was. Barry Johnson only got\n98\nper cent.\" I pleaded guilty.\nIn order to undertake research in pure mathematics Johnson returned to England but he first taught at a grammar school in Tamworth before he began research in\nfunctional analysis\nat Gonville and Caius College of the University of Cambridge in October\n1958\n. He held a Rhondda Memorial Scolarship at Cambridge where his postgraduate studies were supervised by John Williamson. Johnson later wrote:-\nThis was probably the luckiest thing that happened to me because I was supervised by Professor J H Williamson who had a remarkable record as a supervisor. I met a number of research students who now have university teaching positions and also gained a lot of experience of life to transform me from a very dull bookish type to a more socially acceptable individual.\nJohnson completed his doctorate in\n1961\nwith a thesis\nCentralisers in topological algebras\n. The work studies, in particular, algebras whose left and right structures are very different. He was then appointed as an instructor in mathematics at the University of California at Berkeley spending the year\n1961\n-\n62\nat Berkeley. He remained in the United States in the following year, spending\n1962\n-\n63\nas a visiting lecturer at Yale University. While in the United States Johnson married Jennifer Munday in Reno. The couple had met in Cambridge and they had one daughter and two sons. The newly married couple returned to England in\n1963\nwhen Johnson was appointed as a lecturer in mathematics at the University of Exeter. After two years at Exeter, he was appointed as a lecturer in mathematics at the University of Newcastle-upon-Tyne. Promoted to Reader at Newcastle in\n1968\n, he became Professor of Pure Mathematics in the following year\n[\n2\n]\n:-\nBarry enjoyed lecturing at all levels from service teaching, even first year agriculture students, to postgraduate students and would initially describe himself to total outsiders as a 'teacher'.\nJohnson spent the year\n1970\n-\n71\nas a visiting professor at Yale University. In\n1976\nhe became Head of the Department of Pure Mathematics at Newcastle and in the following year he was separated from his wife. Soon after this he met Margaret Jones who had three children from a previous marriage; they married in Santa Barbara in\n1991\n. This was during a year in which Johnson was visiting professor at the University of California at Los Angelos, at Santa Barbara, and at Berkeley.\nIn\n1978\nJohnson was honoured by being elected a fellow of the\nRoyal Society of London\n. He served as Head of the School of Mathematics at Newcastle from\n1983\nto\n1986\nand then he became Dean of the Faculty of Science, holding this office from\n1986\nuntil\n1989\n. He visited the United States again in the academic year\n1990\n-\n91\nas we mentioned above.\nJohnson served the\nLondon Mathematical Society\nas a member of the Council during\n1975\n-\n78\n, then as the\n60\nth\npresident of the Society in\n1980\n-\n82\n. This was a particularly difficult period to hold the presidency since the International Congress of Mathematicians was held in Warsaw during a time of great political tension. Johnson firmly believed, however, that the\nLondon Mathematical Society\nmust remain totally non-political and that members of the Society could express their political views only as individuals. He also served the\nLondon Mathematical Society\nas editor of their Newsletter for four years. In\n1993\nhe was appointed as auditor for the Higher Education Quality Control Council in the Division of Quality Audit. This Council rates the teaching quality of the universities in England. Johnson was a governor of the Royal Grammar School in Newcastle from\n1987\n. He was a member of the Pure Mathematics Research Assessment Exercise panel in\n1992\nand was chair of the panel in the next exercise which took place four years later.\nJohnson is well known for his work on\nBanach\nalgebras and operator algebras, in particular, studying\ncohomology\nin these algebras. His mathematical publications started in\n1964\nwith a series of papers on topological algebras, measure algebras and\nBanach\nalgebras. In these he examined the theory of centralizers and the continuity of transformations. In\n1964\nhe wrote a joint paper with\nRingrose\nDerivations of operator algebras and discrete group algebras\nand his next papers continued to examine the continuity of homomorphisms, derivations and linear operators.\nIn\n1972\nJohnson wrote a joint paper with\nRingrose\nand\nKadison\non cohomology of operator algebras and in the same year his book\nCohomology in Banach algebras\n(1972)\nappeared. We mentioned above that Johnson was President of the\nLondon Mathematical Society\nduring\n1980\n-\n82\n. His presidential address to the Society was on\nNoncommutative generalisations in mathematics\nwhich reported on progress in using ideas from commutative operator theory and applying them to the noncommutative case. Particularly, he reported on applications to noncommutative\nalgebraic topology\n, noncommutative integration and noncommutative\ndynamical systems\n.\nIn later work on group algebras both for semisimple\nLie groups\nand more general groups, he showed that every derivation is inner.\nHis way of doing mathematics is described in\n[\n1\n]\nas follows:-\nBarry Johnson was a highly influential pure mathematician. He liked to work alone, often sitting at home in an armchair with pencil and clipboard, but the theorems he brought to life sometimes had worldwide influence.\nHis interests are described in\n[\n2\n]\n:-\nBarry was a voracious reader, reading anything and everything: histories, biographies, novels, and travel books. The other important thing in his life was walking regularly. He walked through many of his mathematical problems, and in any crisis would go off alone and walk. Barry also liked listening to music and doing his own repairs and alterations to their house and their cottage on the Scottish borders.\nHe developed cancer on February\n2000\nand fought the disease bravely. Despite his deteriorating physical condition, he continued to undertake cutting edge mathematical research. He died of cancer in St Oswald's Hospital in Newcastle upon Tyne aged\n64\n."
}