{
  "nome_completo": "Bernhard Hermann Neumann",
  "nome_curto": "Bernhard Neumann",
  "ano_nascimento": "1909",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neumann_Bernhard/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Canberra, Australia",
  "biografia": "Bernhard Neumann\n's father was Richard Neumann, an engineer who worked for the electricity company AEG. The family lived in a wealthy district of Berlin. Bernhard attended school in Berlin spending three years in primary school followed by nine years at the Herderschule. As one might imagine mathematics was his best subject but at first he did not enjoy his other subjects very much at all. He found the teaching at the Herderschule rather uninspiring particularly the lessons on French and Latin. However, later in his school career things changed and Latin in particular became one of his favourite subjects. He began reading Latin for pleasure and found some Latin texts on scientific topics of particular interest.\nNeumann entered the University of Freiburg to study mathematics in\n1928\nand spent two semesters there before moving to the Friedrich-Wihelms University in Berlin. There he was influenced by an impressive collection of teachers including\nSchmidt\n,\nRobert Remak\nand\nSchur\n, together with his assistant\nAlfred Brauer\n, and near contemporaries of Neumann such as\nHurt Hirsch\n,\nRichard Rado\nand\nHelmut Wielandt\n. In fact it was\nRemak\n, more than any of the others, who influenced Neumann to turn towards group theory for at first he intended to become a topologist.\nHopf\nhad given him a love of topology and this seemed the topic on which he would undertake research. However his reading on the topic involved studying a paper by\nJakob Nielsen\n, and he realised how a certain result on the number of generators of a group could be strengthened.\nSchur\nadvised him to apply the same methods to prove results on wreath products of groups and his doctoral dissertation followed on naturally from this first excursion into group theory.\nIn November\n1931\nNeumann submitted his doctoral dissertation which was examined by\nSchur\nand\nSchmidt\n. He was awarded his doctorate by the University of Berlin in July\n1932\nand after that remained there attending lectures and acting as an unpaid assistant in the experimental physics laboratory. At the University of Berlin at this time he met Hanna von Caemmerer who was an undergraduate. A particularly difficult time was approaching, however, which would have a major effect on his life and that of Hanna von Caemmerer who later became\nHanna Neumann\nafter they married. When Hitler came to power in\n1933\n, only a couple of months after Bernhard and Hanna first met, life in Germany became very hard for those of Jewish origin. Neumann realised immediately the dangers of remaining in Germany and quickly left the country, going first to Amsterdam before being advised that Cambridge was the best place for a mathematician to go. At the University of Cambridge he registered for a Ph.D. despite already holding a doctorate. In taking this course he followed the route adopted by most of those arriving in Cambridge fleeing from the Nazis, but in doing so he went against the advice of\nHardy\nwho said all that was necessary was to produce top quality mathematics.\nRegistering for a doctorate, Neumann was assigned\nPhilip Hall\nas a supervisor.\nHall\ngave him a research problem on rings of polynomials but Neumann did not make much progress on it. Returning to questions in group theory which he had studied while in Berlin, he made rapid progress and was awarded his second doctorate in\n1935\n. Even a mathematician as outstanding as Neumann was not guaranteed a lecturing post at that time and he spent two years unemployed. He remained at Cambridge for a year teaching a preparatory course to give students the right background to take\nOlga Taussky-Todd\n's algebraic number theory course. He was appointed to an assistant lectureship in Cardiff in\n1937\n, the post being a temporary one for three years. He was joined there by\nHanna Neumann\nwho left Germany in\n1938\nand the two were married in July of that year.\nThe year\n1939\nsaw the start of World War II and now Neumann's position as a German in England became a difficult one despite having fled there to escape from the Nazis. He was briefly interned as an enemy alien but, in\n1940\n, he was released. The University of Cardiff had not requested that he return there\n(\nif they had he would have been released earlier\n)\nso he joined the Pioneer Corps. Later he joined the Royal Artillery, and lastly the Intelligence Corps for the duration of the war. After the war ended Neumann volunteered for service in Germany with the Intelligence Corps and he was able to make contact with his wife's family at that time. Turning down an offer to return to Cardiff on the grounds that they had not helped him when he was interned, Neumann searched for an academic appointment again, and this time was appointed as a lecturer at Hull in\n1946\n. The Neumann's were fortunate in that\nHanna Neumann\n, who by this time had obtained her doctorate, was soon able to join him on the staff as an assistant lecturer in Hull.\nIn\n1948\nNeumann was appointed to the University of Manchester, after being approached by\nMax Newman\n, although he continued to live in Hull where\nHanna\nstill worked. In\n1958\nHanna\nwas appointed to a post in Manchester and the Neumanns then moved to a house in Manchester in which they lived for three years before Bernhard accepted an offer from the Australian National University of a professorship and the Head of the Mathematics Department at the Institute of Advanced Studies. He retired in\n1974\nbut continued to live in Canberra.\nNeumann is one of the leading figures in group theory who has influenced the direction of the subject in many different ways. While still in Berlin he published his first group theory paper on the\nautomorphism group\nof a\nfree group\n. However his doctoral thesis at Cambridge introduced a new major area into group theory research. In his thesis he initiated the study of varieties of groups, that is classes of groups defined which are by a collection of laws which must hold when any group elements are substituted into them.\nOne of the questions raised in Neumann's thesis was the finite basis problem:-\nCan each variety be defined by a finite set of laws?\nNeumann himself made many contributions to this question over many years but the answer to the problem was not given until\n1969\nwhen Ol'sanskii proved that the problem had a negative answer.\nAn indication of some of the topics which interested Neumann can be seen from looking at the material covered in\nLectures on topics in the theory of infinite groups\n(1960)\n. The notes provide an introduction to universal algebras, groups, presentations, word problems, free groups, varieties of groups, cartesian products and wreath products. He goes into greater detail when discussing varieties of groups, embedding theorems for groups and amalgamated products of groups. His methods here are based on wreath products and permutational products. Then he studies embeddings of nilpotent and soluble groups and finally looks at Hopfian groups. Frank Levin, reviewing the work, writes:-\nThe author's leisurely but informative style make these notes a pleasure to read and profitable even for the novice with no background in infinite groups.\nAmong the many important concepts which Neumann introduced we should note in particular that of an HNN extension, which appears in the paper\nEmbedding theorems for groups\n(1949)\nwritten jointly with\nHanna Neumann\nand\nGraham Higman\n. Their results proved that every countable group can be embedded in a\n2\n-generator group.\nOne of Neumann's many research students,\nGilbert Baumslag\n, began a paper dedicated to Neumann on his\n70\nth\nbirthday with the paragraph:-\nIn\n1955\nwhen I first arrived in Manchester to work with B H Neumann he suggested that I read his paper 'Ascending derived series' which had only just been submitted for publication. This was a beautifully crafted paper, filled with ideas and very stimulating. The present note, written in gratitude, affection and esteem, in Bernhard Neumann's honour, comprises some simple variations on the themes of that paper.\nThe history of mathematics first interested Neumann when he was at Manchester. At that time he was given access to the papers which had come from\nAugusta Ada Lovelace\n. These papers were loaned to him by the\nLovelace\nfamily and he was particularly interested in the correspondence between\nLovelace\nand her mathematics tutor\nDe Morgan\n. In\n1973\nNeumann published a paper\nByron's daughter\nin the\nMathematical Gazette\nwhich gives an account of the mathematical activities of\nAda Lovelace\n, her correspondence with\nDe Morgan\n, and details of her friendship with\nBabbage\n. Following on from this work he later wrote a fascinating account of\nDe Morgan\n's life which was published in the\nBulletin of the London Mathematical Society\nin\n1984\n.\nBut Bernhard Neumann's contribution to mathematics goes far beyond his leadership in research. As the authors of\n[\n3\n]\nwrite:-\n... he always had a very deep appreciation of the need to serve the mathematical community in other ways. He was a member of the Council of the\nLondon Mathematical Society\nbetween\n1954\nand\n1961\n, and its Vice-President between\n1957\nand\n1959\n. His scholarly influence stretched much further than Britain ... . His contributions to mathematics in Australia have been many and varied. Not only did he form a department of very able mathematicians at the ANU specialising in group theory and\nfunctional analysis\n, he also took a deep interest in the Australian Mathematical Society.\nNeumann served the Australian Mathematical Society as Vice-President on a number of occasions and was President during\n1966\n-\n68\n. Neumann worked to set up the Bulletin of the\nAustralian Mathematical Society\nand was editor for ten years after it was founded in\n1969\n. He played a crucial role in setting up the Australian Association of Mathematics Teachers and the\nNew Zealand Mathematical Society\n, see\n[\n2\n]\n.\nMany honours have been given to Neumann for his outstanding contribution and continue to be awarded. He received the Wiskundig Genootschap te Amsterdam Prize in\n1949\n, and the\nAdams\nPrize from the University of Cambridge. He was elected a Fellow of the\nRoyal Society of London\nin\n1959\nand a Fellow of the\nAustralian Academy of Sciences\nin\n1963\n."
}