{
  "nome_completo": "Bonaventura Francesco Cavalieri",
  "nome_curto": "Bonaventura Cavalieri",
  "ano_nascimento": "1598",
  "ano_morte": "1647",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cavalieri/",
  "lugar_nascimento": "Milan, Duchy of Milan, Habsburg Empire (now Italy)",
  "lugar_morte": "Bologna, Papal States (now Italy)",
  "biografia": "Bonaventura Cavalieri\nwas given the name Francesco when he was born. His father's name was Bonaventura Cavalieri but when Francesco joined the religious order of the Jesuati in Milan in\n1615\nhe took the name Bonaventura. He is always known by that name. The religious order of the Jesuati, which he joined, was founded by Giovanni Colombini of Siena and his friend Francesco Miani in\n1360\n. Originally the Jesuati cared for those afflicted with the Black Death, but the order recruited fewer as time went on. In\n1606\nan attempt was made to encourage more young men to join. Although they had some success in recruiting, and in particular Cavalieri joined, nevertheless the order eventually failed and was dissolved by pope Clement IX in\n1668\n. The order was named Jesuati because their sermons always began and ended with the name of 'Jesus' being shouted out. As a Jesuati, Cavalieri would have always worn sandals and flagellated himself daily.\nAfter a year in Milan, in\n1616\nhe transferred to the Jesuati monastery in Pisa, the San Girolamo monastery, where, except for one year spent in Florence in around\n1617\n, he remained until\n1620\n. In Pisa, Cavalieri was taught mathematics by\nBenedetto Antonio Castelli\n, a lecturer in mathematics at the University of Pisa.\nCastelli\nhad been appointed to Pisa in\n1611\nand had a reputation as a fine teacher, students coming from many different regions to study with him.\nCastelli\nwas a Benedictine but, as there was no Benedictine monastery in Pisa,\nCastelli\nlived in the Jesuati monastery there. He taught Cavalieri geometry and introduced him to the ideas of\nGalileo\n. Cavalieri's interest in mathematics had been stimulated by\nEuclid\n's\nElements\nand, after meeting\nGalileo\n, he considered himself a disciple of the astronomer. The meeting with\nGalileo\nwas set up by Cardinal Federico Borromeo, who had corresponded with\nCastelli\n. The Cardinal himself saw clearly the genius in Cavalieri while he was at the monastery in Milan\n[\n12\n]\n:-\nThis resulted in more than\n100\nletters from Cavalieri to\nGalileo\nin the period\n1619\n-\n1641\n.\nGalileo\ndid not answer all of them, but sent an occasional letter to Cavalieri; of these all but a very few have disappeared.\nCavalieri showed such promise that he sometimes took over\nCastelli\n's lectures at the university. Urbano Diviso, Cavalieri's pupil and first biographer writing about\n30\nyears after Cavalieri's death, claimed that\nCastelli\ntold Cavalieri to study of mathematics since that would cure him of depression. However, there is no other evidence for this claim and certainly some checkable claims in Diviso's account of Cavalieri's life are incorrect.\nIn\n1619\nCavalieri applied for the chair of mathematics in Bologna, which had become vacant following the death of\nGiovanni Antonio Magini\n, but was not successful since he was considered too young for a position of this seniority. He also failed to get the chair of mathematics at several other universities including Rome and Pisa when\nCastelli\nleft for Rome in\n1626\n. Cavalieri himself blamed the fact that he was in the Jesuati order as the reason for his lack of success in these applications. He felt that the order was not popular in Rome, which was certainly true, but whether this did indeed explain his failed applications it is impossible to say. He did progress in his clerical career, however. In\n1621\nCavalieri became a deacon and assistant to Cardinal Federico Borromeo at the monastery of San Girolamo in Milan. It was during his time in Milan that he began to develop his method of indivisibles for which he is famed today. He taught theology in Milan until\n1623\nwhen he became prior of St Peter's at Lodi. After three years at Lodi he went to the Jesuati monastery in Parma where he was the prior\n[\n1\n]\n:-\nIn the autumn of\n1626\n, during a trip from Parma to Milan, he fell ill with the gout, from which he had suffered since childhood and which was to plague him to the end of his life. This illness kept him at Milan for a number of months.\nHe spend the three years\n1626\n-\n1629\nat Parma. On\n16\nDecember\n1627\nhe wrote to\nGalileo\nand to Cardinal Federico Borromeo telling them that he had completed his book\nGeometria\n. This contains the method of indivisibles which became a factor in the development of the integral calculus. In\n1629\nCavalieri was appointed to the chair of mathematics at Bologna. His application had been supported by\nGalileo\nwho\n[\n1\n]\n:-\n... in\n1629\n, wrote to Cesare Marsili, a gentleman of Bologna and member of the\nAccademia dei Lincei\n, who had been commissioned to find a new lecturer in mathematics. In his letter,\nGalileo\nsaid of Cavalieri, \"few, if any, since\nArchimedes\n, have delved as far and as deep into the science of geometry.\" In support of his application to the Bologna position, Cavalieri sent Marsili his geometry manuscript and a small treatise on\nconic sections\nand their applications in optics.\nGalileo\n's testimonial, as Marsili wrote him, induced the \"Gentlemen of the Regiment\"  to entrust the first chair in mathematics to Cavalieri, who held it continuously from\n1629\nto his death.\nThe chair of mathematics at Bologna was not the only position he received for he was also appointed prior of the Jesuati convent in Bologna attached to the Church of Santa Maria della Mascarella. This was an ideal situation for Cavalieri who now had the peace to undertake mathematics research at the Jesuati convent while teaching mathematics at the university where he could have contacts with other mathematicians. He published eleven books during his eighteen years in Bologna. However, his health deteriorated around the time of his appointment to Bologna, and he suffered from problems with his legs which persisted throughout the rest of his life. In fact Cavalieri's appointment to Bologna had, in the first instance, been for a\n3\n-year trial period but, as we explain below, it was extended.\nCavalieri's geometry manuscript which had been a factor in his appointment to Bologna, although completed in December\n1627\n, was not published until\n1635\n. The theory of indivisibles, presented in his\nGeometria indivisibilibus continuorum nova quadam ratione promota\nof\n1635\n, was a development of\nArchimedes\n'\nmethod of exhaustion\nincorporating\nKepler\n's theory of infinitesimally small geometric quantities. This theory allowed Cavalieri to find simply and rapidly the area and volume of various geometric figures. Howard Eves writes\n[\n26\n]\n:-\nCavalieri's treatise on the method of indivisibles is voluble and not clearly written, and it is not easy to learn from it precisely what Cavalieri meant by an \"indivisible.\" It seems that an indivisible of a given planar piece is a chord of the piece, and a planar piece can be considered as made up of an infinite parallel set of such indivisibles. Similarly, it seems that an indivisible of a given solid is a planar section of that solid, and a solid can be considered as made up of an infinite parallel set of this kind of indivisible. Now, Cavalieri argued, if we slide each member of a parallel set of indivisibles of some planar piece along its own axis, so that the endpoints of the indivisibles still trace a continuous boundary, then the area of the new planar piece so formed is the same as that of the original planar piece, inasmuch as the two pieces are made up of the same indivisibles. A similar sliding of the members of a parallel set of indivisibles of a given solid will yield another solid having the same volume as the original one.\n(\nThis last result can be strikingly illustrated by taking a vertical stack of cards and then pushing the sides of the stack into curved surfaces; the volume of the disarranged stack is the same as that of the original stack.\n)\nThese results give the so-called Cavalieri principles:\n1\n. If two planar pieces are included between a pair of parallel lines, and if the lengths of the two segments cut by them on any line parallel to the including lines are always equal, then the areas of the two planar pieces are also equal.\n2\n.  If two solids are included between a pair of parallel planes, and if the areas of the two sections cut by them on any plane parallel to the including planes are always equal, then the volumes of the two solids are also equal.\nThe method of indivisibles was not put on a rigorous basis and his book was widely attacked. In particular,\nPaul Guldin\nattacked Cavalieri\n[\n8\n]\n:-\nThe debate between Cavalieri and\nGuldin\nis usually mentioned in connection with the objections made by\nGuldin\nto Cavalieri's use of indivisibles. Although that is probably the main issue between Cavalieri and\nGuldin\n, a more careful reading of the debate will allow us to indicate the existence of other interesting issues ...\nThe argument really centres around the fact that\nGuldin\nwas a classical geometer following the methods of the ancient Greek mathematicians. His first point, however, was to accuse Cavalieri of plagiarising\nKepler\n's\nStereometria Doliorum\n(1615)\nand Sover's\nCurvi ac Recti Proportio\n(1630)\n. There is something in his argument relating to\nKepler\nsince in that work\nKepler\ndoes regard a circle as an infinite polygon composed of\ninfinitesimals\n. However, Cavalieri's indivisibles are different from\nKepler\n's infinitesimals. As to the reference to Sover, Cavalieri, in his defence, pointed out that he wrote his book before Sover's book was published.\nGuldin\nattacked Cavalieri's indivisibles by arguing that when a surface is generated by rotating a line about the axis, the surface is not just a set of lines. He writes\n(\nsee\n[\n8\n]\n)\n:-\nIn my opinion no geometer will grant Cavalieri that the surface is, and could, in geometrical language be called \"all the lines of such a figure\"; never in fact can several lines, or all the lines, be called surfaces; for, the multitude of lines, however great that might be, cannot compose even the smallest surface.\nAs Mancosu writes\n[\n8\n]\n:-\nGuldin\nwas a \"classicist\" geometer, steeped in the idea of explicit construction, sceptical of considerations of infinity in the domain of geometry, and wary of the risk of ending up with an atomistic theory of the continuum.\nIf one asks whether\nGuldin\nor Cavalieri is right, then the answer must be Cavalieri. However, a positive side to\nGuldin\n's attack was that Cavalieri improved his exposition publishing\nExercitationes geometricae sex\n(1647)\nwhich became the main source for\n17\nth\nCentury mathematicians.\nCavalieri was also largely responsible for introducing logarithms as a computational tool in Italy through his book\nDirectorium Generale Uranometricum\n. We mentioned above that his appointment to Bologna had been initially for a\n3\n-year period. This book of logarithms was published by Cavalieri as part of his successful application to have the position extended. The tables of logarithms which he published included logarithms of trigonometric functions for use by astronomers\n[\n31\n]\n:-\nThe work is divided into three parts, devoted to logarithms, plane trigonometry, and spherical trigonometry. In addition to noteworthy innovations in terminology, the work includes important demonstrations of\nJohn Napier\n's rules of the spherical triangle and the theorem of the squaring of each spherical triangle that, attributed to\nAlbert Girard\n, was later claimed by\nJoseph Lagrange\n.\nGalileo\npraised Cavalieri for his work on logarithms, in particular the book he wrote entitled\nA hundred varied problems to illustrate the use of logarithms\n(1639)\n.\nCavalieri also wrote on conic sections, trigonometry, optics, astronomy, and astrology. He developed a general rule for the focal length of lenses and described a reflecting telescope. He also worked on a number of problems of motion. Piero Ariotti writes that, regarding the reflecting telescope\n[\n13\n]\n:-\n... Cavalieri's work of interest is his 'Specchio ustorio', printed in\n1632\nand reprinted in\n1650\n. In this work Cavalieri concerned himself with reflecting mirrors for the express purpose of resolving the age-long dispute of how\nArchimedes\nallegedly burned the Roman fleet that was besieging Syracuse in\n212\nB.C. The book, however, goes well beyond the stated purpose and systematically treats the properties of conic sections, reflection of light, sound, heat\n(\nand cold!\n)\n, kinematic and dynamic problems, and the idea of the reflecting telescope.\nCavalieri's claim that one would obtain a telescope by combining concave mirrors with concave lens have led some historians to claim that Cavalieri invented the reflecting telescope before\nJames Gregory\nor\nIsaac Newton\n.\nHe even published a number of books on astrology, one in\n1639\nentitled\nNuova pratica astromlogica\nand another, his last work,\nTrattato della ruota planetaria perpetua\nin\n1646\n. However, although these use the terminology of astrology, they are serious astronomical works. Cavalieri did not believe that one could predict the future from astrological considerations, and certainly did not practice astrology. He states this clearly in his\n1639\nwork.\nCavalieri corresponded with many mathematicians including\nGalileo\n,\nMersenne\n, Renieri, Rocca,\nTorricelli\nand\nViviani\n.\nTorricelli\nwas full of praise for Cavalieri's methods writing\n(\nsee\n[\n1\n]\n)\n:-\nI should not dare affirm that this geometry of indivisibles is actually a new discovery. I should rather believe that the ancient geometricians availed themselves of this method in order to discover the more difficult theorems, although in their demonstration they may have preferred another way, either to conceal the secret of their art or to afford no occasion for criticism by invidious detractors. Whatever it was, it is certain that this geometry represents a marvellous economy of labour in the demonstrations and establishes innumerable, almost inscrutable, theorems by means of brief, direct, and affirmative demonstrations, which the doctrine of the ancients was incapable of. The geometry of indivisibles was indeed, in the mathematical briar bush, the so-called royal road, and one that Cavalieri first opened and laid out for the public as a device of marvellous invention.\nIn fact,\nTorricelli\ncontinued to develop the ideas that Cavalieri introduced in\nArithmetica infinitorum\n(1655)\n. Perhaps Cavalieri's most famous student was\nStefano degli Angeli\n. He studied with Cavalieri at Bologna at a time when Cavalieri was quite old and suffering from arthritis.\nAngeli\nwrote many of the letters which Cavalieri sent to his fellow mathematicians during his time of study.\nWe mentioned Cavalieri's problems with his legs that began around\n1629\nand also his longstanding problems with gout. In\n1636\nhe was suffering badly from gout and, to seek a cure, went to the health spa in Arcetri where he spent the summer. This was at a time when\nGalileo\nwas living under house arrest in Arcetri, and Cavalieri spent the summer discussing mathematics with him. Returning to Bologna, life became increasingly difficult for Cavalieri. His health had not improved and he was being pressed by the university authorities to work on astronomy rather than on mathematics, the topic that Cavalieri loved. He had the chance to leave Bologna when he was offered the chair of mathematics at Pisa, but he turned it down. Cardinal Federico Borromeo offered him a position at the Biblioteca Ambrosiana in Milan, but again Cavalieri chose to remain in Bologna. By\n1646\nhis health had become so poor that he was forced to give up teaching. By the time of his death in the following year he was totally crippled and unable to walk. He was buried in the church of Santa Maria della Mascarella in Bologna."
}