{
  "nome_completo": "Branko Grünbaum",
  "nome_curto": "Branko Grünbaum",
  "ano_nascimento": "1929",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grunbaum/",
  "lugar_nascimento": "Osijek, Yugoslavia (now Croatia)",
  "lugar_morte": "Seattle, USA",
  "biografia": "Branko Grünbaum\nwas the son of Vlado Grünbaum\n(1903\n-\n1983)\nand Margareta Banderier\n(1909\n-\n1999)\n. Vlado, the son of Jakob and Flora Grünbaum, was Jewish; he had one older sister Slava and one younger sister Sida. Jakob died in\n1908\nand Vlado and his sisters were brought up by Margareta who worked as a hairdresser. The family finances prevented Vlado studying medicine, as he would have wished, but he was able to complete his studies at a commercial college. Margareta Banderier was the daughter of Gustav and Emma Banderier who were French and had been married in the Catholic Church. Gustav worked for a French company managing a sawmill which made oak barrels for wine. He was murdered by one of the workers in\n1925\nand Vlado, who worked for him, was promoted to manager of the sawmill. Vlado and Margareta were married and their son Branko, the subject of this biography, was born while his father managed the sawmill.\nOne of the workers at the sawmill was a German and he played with young Branko and taught him German. In the early\n1930\ns the Great Depression hit Europe and the French company went bankrupt in\n1935\n. Emma, Branko's maternal grandmother, received some compensation and bought a house near Osijek where she earned money tutoring French and German to high school students. Branko played while his grandmother taught and he learnt more German and some French. His father Vlado eventually was out of work from\n1935\nto\n1938\nand times were hard for the family. In\n1938\nhe managed to get a job managing a sawmill near Klenak, now in Serbia, and the family moved to Sabac on the opposite side of the Sava river.\nIn\n1940\n-\n41\n, Hitler pressed Yugoslavia to join the Axis powers. They refused despite Hitler's anger but without modern weapons they feared their position. Eventually, in March\n1941\n, the Yugoslav government agreed to join the Axis with several conditions, one being that Germany would not cross Yugoslavia if their troops were going to invade Greece. There was a coup in Yugoslavia by troops not wanting the country to join the Axis and, on\n6\nApril\n1941\n, German troops attacked Yugoslavia. On\n17\nApril an armistice was signed and by the end of April racial laws had been introduced against Jews and others. Branko Grünbaum's family were immediately in danger. Jews were forced to wear the yellow armband with the star of David but there was a decree which meant that those in a mixed marriage did not have to register. They were, however, forced to help in the concentration camps. Vlado was part of this and was able to help many children leave the camps, pretending they required medical aid, and then have them escape. It was an extremely risky thing to do, but somehow he got away with it.\nThe Grünbaum family somehow survived the war. Vlado started a successful lumberyard but was arrested. He was released after agreeing to give part of the lumberyard to the city. Branko, who had wanted to leave the country for several years, became even more determined to do so but this was not possible. Very few Jews were left in Osijek by the end of the war in\n1945\nand Branko frequently met up with seven other Jewish High School students. One of them was Zdenka Bienenstock who had been born in Osijek on\n6\nJuly\n1930\n. Branko said\n(\nsee\n[\n26\n]\n)\n:-\nZdenka had difficulties with the mathematics she was supposed to study. I offered to help. She proved to be extraordinarily bright.\nZdenka, being Jewish, had been banned from school in\n1941\n. Her parents, in an attempt to save themselves and their daughter, converted to become Roman Catholics. They took Zdenka to the Catholic convent of the Sisters of the Holy Cross in Dakovo where her identity was changed and she survived thanks to the bravery of the nuns in sheltering a Jewish girl. Zdenka's parents, however, were not saved by changing religion and they died in the Auschwitz concentration camp. At the convent Zdenka had been given an educations and, after the war ended, she was looked after by Olga Mrljak, a friend of her mother's, in Osijek.\nIn\n1948\nGrünbaum, unhappy with the Communist government, wanted to leave Yugoslavia and he also wanted to marry Zdenka. There was a possibility for Jews to go to Israel in the summer of\n1948\nwhen it was announced that if they registered, the government would provide a ship. Grünbaum, however, felt it might be a trick to identify 'trouble makers', so did not register. His parents told him he should wait until he could financially support a wife before he married Zdenka and he took this advice. He graduated from high school and entered the University of Zagreb in October\n1948\nbeginning his university studies of mathematics and physics. He was taught by, among others, the geometer Stanko Bilinski\n(1909\n-\n1998)\n.\nThe Jews who had registered for the ship to Israel left and Grünbaum realised it was not a trick. When Jews were invited to register for a second ship, he persuaded all his family to register and for Zdenka to go with them. Zdenka recalled\n(\nsee\n[\n26\n]\n)\n:-\nWe joined the second 'aliyah' in July\n1949\n. The Yugoslav authorities required that we surrender our identification cards, renounce our citizenship, and abandon without compensation all property, such as our houses. They inspected our crates to prevent export of valuables from the country. The few items of my mother's jewellery that Ms Mrljak saved I sewed into the seams of my coat.\nI was\n18\nyears old and had finished seven out of eight grades of high school. I did not have a high school certificate and did not speak or read Hebrew. I could not take any money and did not know how I would survive. I was not strong enough for manual labour, and I had no marketable skills. But I had found Branko, the love of my life, and I was following him to Israel. We left Osijek by train to Rijeka, boarded the ship Radnik II and landed in Haifa on July\n25\nth\n1949\n.\nArriving in Israel, they were all given Israeli nationality, but life in Israel was hard with the family living in refugee camp tents for a while. Branko's father, Vlado, was given a grant to open a car repair shop. Branko worked for a textile machinery firm and Zdenka was able to continue her schooling. Both Branko and Zdenka tried to learn Hebrew and, in October\n1950\n, at age\n21\n, Branko Grünbaum was able to begin his studies of mathematics at the Hebrew University in Jerusalem. He spoke about this time\n[\n26\n]\n:-\nDuring the first week of classes I enrolled in a seminar by Professor\nAbraham Fraenkel\n, who assigned research articles or book chapters to students to present to the class. In the first week Professor\nFraenkel\nasked for volunteers. There were none. After some hesitation, I tentatively agreed. When I explained that I was not familiar with the Hebrew terms corresponding to the English terms in the article, Professor\nFraenkel\ninvited me to come to his apartment the next day at\n6\n:\n30\na.m. I showed up on time, learned the proper terms and presented the article to the class the following week. Volunteering was one of the most fortunate actions I ever took, as Professor\nFraenkel\n'took me under his wings' and helped me get small helpful jobs.\nGrünbaum was awarded an M.Sc. in\n1954\n. He had already submitted his first two papers\nA characterisation of compact metric spaces\n(\nHebrew\n)\nand\nOn a theorem of L A Santaló\n. This second paper, written in English, was published in the\nPacific Journal of Mathematics\n. It was received on\n22\nSeptember\n1953\nand contains the following note:-\nThis work was done in a seminar on convex bodies conducted by Prof\nA Dvoretzky\nat the Hebrew University, Jerusalem.\nZdenka was told to report for military service so, to avoid her doing that, Branko and Zdenka were married on\n30\nJune\n1954\n. Grünbaum was by this time undertaking research for his Ph.D. advised by\nAryeh Dvoretzky\n. Marriage did not prevent him being called for military service, however, which happened in\n1955\n. He was able to work on setting up an Operation Research unit where he could use his mathematical skills and was allowed to spend \"one day a week in Jerusalem, officially, to consult with Professor\nDvoretzky\nbut practically it was to discuss his PhD research.\" Branko and Zdenka's first child, Ram Grünbaum, was born in Kfar Saba, Israel, on\n27\nJune\n1956\n. Zdenka who by this time had an M.Sc. in Chemistry and was working for the Israeli army, gave up her job. In\n1957\nBranko Grünbaum submitted his thesis,\nOn Some Properties of Minkowski Spaces\n(\nHebrew\n)\nand was awarded a Ph.D. He continued his army service until\n1958\nand by this time, despite three years of military service, he had eleven papers in print. His paper\nOn some covering and intersection properties in Minkowski spaces\npublished in the\nPacific Journal of Mathematics\nin\n1959\nwas submitted in\n12\nNovember\n1958\nand contains the following note:-\nThe results of this paper form part of Chapter\n5\nof the author's Ph.D. thesis, \"On some properties on Minkowski space\"\n(\nin Hebrew\n)\n, prepared under the guidance of Professor\nA Dvoretzky\nat The Hebrew University in Jerusalem. The author wishes to express his sincere gratitude to Professor\nDvoretzky\nfor his helpful suggestions and criticism. The results have also been incorporated in a report on \"Extensions, Retractions, and Projection,\" prepared in part under Contract AF\n61\n(052)\n-\n04\n.\nA scholarship allowed Grünbaum to spend from September\n1958\nto June\n1960\nat the Institute for Advanced Study at Princeton, USA. Branko and Zdenka, with their son Ram, sailed on the T.S.S.\nOlympia\narriving in New York on\n5\nSeptember\n1958\nhaving left Lisbon exactly one month earlier. From New York they travelled by train to Princeton. After two years at Princeton, they spent one year in Seattle at the University of Washington where their second son Daniel Grünbaum was born on\n2\nNovember\n1960\n. The family had spent the summer of\n1960\nat the University of California, Los Angeles, living during this time in Santa Monica. While in Seattle, Grünbaum accepted a position at the Hebrew University in Jerusalem.\nThere now arose a complication with his marriage. Branko and Zdenka's Orthodox Jewish marriage had been annulled because Branko's mother was not Jewish. In the City of Seattle, on\n5\nSeptember\n1961\n, Branko Grünbaum and Zdenka Bienenstock were married by a Justice of the Peace at\n9\n:\n30\na.m. just before they left the United States for Jerusalem. Back at the Hebrew University his career went extremely well and he was promoted to Associate Professor in\n1964\n. By this time he had over fifty publications and, let us note at this point, that he carried on with a remarkably high publication rate throughout his life; MathSciNet list\n271\npublications in total.\nGrünbaum now felt slightly uneasy in Israel since, despite having a Jewish father, he had been declared a non-Jew since his mother was not Jewish. This eventually contributed to his decision to leave Israel and emigrate to North America. In\n1965\nhe went to Michigan State University to spend a sabbatical year. While there he learnt of another marriage being annulled in similar circumstances to his own and the Israeli immigrant from the mixed marriage had her passport and citizenship revoked; this tipped the balance. It was not an easy decision, however, since Zdenka had been half way through her Ph.D. studies in Chemistry when they left Israel and she would have liked to have returned to complete the degree. Grünbaum had two possible places in North America which were particularly attractive because of his interest in geometry, the University of Toronto where\nDonald Coxeter\nwas a professor, and the University of Washington in Seattle where he could work with Victor Klee. He chose the University of Washington where he was appointed to a full professorship in\n1966\nand remained there for the rest of his career until he retired in\n2001\n.\nGrünbaum's son Daniel had been born in Seattle, so had American citizenship. Branko, Zdenka and Ram were \"lawfully admitted to the United States for permanent residence on February\n1\n,\n1968\n.\" Ram petitioned to become a naturalised citizen on\n1\nOctober\n1971\nand had his name changed to Rami. Branko and Zdenka petitioned to become naturalised citizens on\n6\nJune\n1973\n. Their address at this time was\n5512\nNortheast\n63\nd Street, Seattle.\nIn the\n1981\npaper\n[\n16\n]\nthe following short description of Grünbaum's career is given:-\nBranko Grünbaum is Professor of Mathematics at the University of Washington in Seattle. He was born in Yugoslavia in\n1929\n, and educated in Yugoslavia and in Israel. After receiving his Ph.D. from the Hebrew University in Jerusalem in\n1958\n, he spent two years at the Institute for Advanced Study in Princeton, NJ. Since then he has taught at Hebrew University, Michigan State University, and the University of Washington. His main fields of interest are geometry\n(\nin particular, convex sets and polytopes, tilings and patterns, arrangements of lines, and other areas of intuitive geometry\n)\nand combinatorics\n(\nin particular, graph theory\n)\n. He has published two books and some\n120\nresearch and survey papers on these topics. He received the\nLester R Ford\naward for\n1975\nand the Carl B Allendoerfer award for\n1978\nfrom the\nMathematical Association of America\n. He has served on the editorial boards of \"Aequationes Mathematicae,\" \"Combinatorica,\" \"Discrete Mathematics,\" \"Geometriae Dedicata,\" \"Israel Journal of Mathematics\" and \"Structural Topology.\" Since\n1974\n, he has served as a lecturer in the Program of Visiting Lecturers of the\nMathematical Association of America\n.\nThe paper\n[\n16\n]\nalso contains several quotes indicating Grünbaum's thoughts on geometry:-\n(\ni\n)\n... geometry is a special way of replacing objects of the real world by \"simpler\", \"idealised\" \"figures and shapes\", and then investigating the mutual relations of these. This, I believe, is what geometry - \"intuitive geometry \"- is, and should be.\n(\nii\n)\nAnybody who thinks he can \"see,\" or find in nature, a Euclidean point\n(\nor a straight line, or a differentiable curve\n)\nneeds urgent medical attention.\n(\niii\n)\nMost mathematicians are totally unaware of the fact that the elementary, intuitive approach to geometry continues\n(\nand will continue\n)\nto generate mathematically profound and interesting problems and results.\n(\niv\n)\nThe opinion that the interest in visual-geometric aspects of a topic is lost or negligible just because the topic can be translated into algebraic language is as fallacious as the\n(\nlong prevailing\n)\nview that if a problem is solvable in a finite number of steps, further consideration must be boring - the whole challenging field of computational complexity refutes such a stance.\n(\nv\n)\n... why do I see geometry in colleges and universities in a very gloomy light? The simple answer is that we teach very little geometry, and that what we do teach is rather misleading.\n(\nvi\n)\n... we often follow \"tradition\" and pretend to be teaching the \"classical\" Euclidean geometry, holding it up as an example of a logically perfect deductive science. But we all know that this is intellectually dishonest and mathematically impractical.\n(\nvii\n)\nWhat is missing from our curricula in colleges\n(\nas well as in high schools\n)\nis the accent on the many aspects of reality which are susceptible of meaningful geometric interpretation. Equally absent are the elementary geometric considerations which - besides intrinsic interest - can contribute in very significant ways to the students' comprehension of topics in other sciences, in engineering and in art, as much as help guide future progress in mathematics.\nWe hope these quotes might encourage the reader to find and read the whole paper.\nIn\n1983\nthe German Democratic Republic issued a stamp on the\n200\nth anniversary of\nEuler\n's death. Grünbaum wrote the paper\n[\n17\n]\npointing out that the icosahedron depicted on the stamp is wrong:-\nI noticed that the drawing of the regular icosahedron shown in it\n(\nand I have no doubt that it was meant to show a regular icosahedron\n)\nis wrong. This is not a question of which kind of perspective or projection was used, it is just a logical error\n(\nrepeated twice\n)\n: if three of the five vertices of a plane pentagon project into one line, then the other two vertices must project into the same line.\nSee the stamp at\nTHIS LINK\n.\nIn the same paper he points out that the logo of the\nMathematical Association of America\nhad shown an incorrect drawing of an icosahedron since\n1972\n[\n34\n]\n:-\nThe MAA, much to its credit, immediately revised its logo and started using one with greater respect for geometry. Unfortunately, Branko caught them using the bad one again a few years later, but a follow up letter from him on the question seems to have permanently resolved the issue.\nSee the old and new MAA logos at\nTHIS LINK\n.\nWe mentioned above some of the honours that were awarded to Grünbaum. He also received the Leroy P Steele Prize from the\nAmerican Mathematical Society\nin\n2005\nfor his book\nComplex polytopes\n(1967\n, Second Edition\n2002)\n. The citation states that:-\n... much of the development that led to the present, thriving state of polytope theory owes its existence to this book, which served as a source of information for workers in the field and as a source of inspiration for them to enter the field.\nGordon Williams writes about this book in\n[\n34\n]\n:-\nThis was an indispensable reference for mathematicians working in the theory of convex polytopes, linear programming, and related combinatorial problems in geometry for at least the next two decades. Its value came not only from the thoroughness of his treatment, but the care and skill he applied in presenting some of the latest ideas and techniques in the study of convex polytopes, and the wealth of material he had collected from sometimes obscure references and then presented in an approachable and clear style.\nFor more information about this book and Grünbaum's other books, see\nTHIS LINK\n.\nGordon Williams undertook research for a Ph.D. advised by Grünbaum. He writes in\n[\n34\n]\n:-\nAs a mathematics graduate student, a visit to Branko's office was like a visit to the candy store. His office was filled with models he had built over the years to help him think through geometric problems. They covered shelves and hung from the ceiling tiles on bits of string\n(\nwhich I'm sure caused the fire marshal fits of apoplexy\n)\n, and they were colourful and intriguing. It seemed like every time I went into his office I noticed something new, and he was always happy to explain the maths behind the model and pull a copy of a preprint from his filing cabinet of the paper that had provided the need for the model in the first place. Questions I brought to Branko were often answered by him pulling a model from a shelf to illustrate a point, and would lead us into a discussion of other questions the model helped to illuminate. One of my most prized possessions is a model he built, and I was immensely proud when he asked me to contribute a copy of a model I had built for my own research into his collection. The garage at his house was equally a treasure trove of mathematical models, and interesting examples often made their way from his home to lecture halls at the university. In this way I learned the importance of visualisation and model building as tools to gain deeper insight into geometric questions, and as an important step in verifying my understanding of mathematical ideas\n(\nif I couldn't build it, I clearly didn't understand it\n)\n.\nZdenka Grünbaum died in her sleep on\n28\nDecember\n2015\n. Branko Grünbaum survived her by three years, dying in\n2018\na few weeks before his\n89\nth birthday."
}