{
  "nome_completo": "Brook Taylor",
  "nome_curto": "Brook Taylor",
  "ano_nascimento": "1685",
  "ano_morte": "1731",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Taylor/",
  "lugar_nascimento": "Edmonton, Middlesex, England",
  "lugar_morte": "Somerset House, London, England",
  "biografia": "Brook Taylor\n's father was John Taylor and his mother was Olivia Tempest. John Taylor was the son of Natheniel Taylor who was recorder of Colchester and a member representing Bedfordshire in Oliver Cromwell's Assembly, while Olivia Tempest was the daughter of Sir John Tempest. Brook was, therefore, born into a family which was on the fringes of the nobility and certainly they were fairly wealthy.\nTaylor was brought up in a household where his father ruled as a strict disciplinarian, yet he was a man of culture with interests in painting and music. Although John Taylor had some negative influences on his son, he also had some positive ones, particularly giving his son a love of music and painting. Brook Taylor grew up not only to be an accomplished musician and painter, but he applied his mathematical skills to both these areas later in his life.\nAs Taylor's family were well off they could afford to have private tutors for their son and in fact this home education was all that Brook enjoyed before entering St John's College Cambridge on\n3\nApril\n1703\n. By this time he had a good grounding in classics and mathematics. At Cambridge Taylor became highly involved with mathematics. He graduated with an LL.B. in\n1709\nbut by this time he had already written his first important mathematics paper\n(\nin\n1708)\nalthough it would not be published until\n1714\n. We know something of the details of Taylor thoughts on various mathematical problems from letters he exchanged with\nMachin\nand\nKeill\nbeginning in his undergraduate years.\nIn\n1712\nTaylor was elected to the\nRoyal Society\n. This was on the\n3\nApril, and clearly it was an election based more on the expertise which Machin,\nKeill\nand others knew that Taylor had, rather than on his published results. For example Taylor wrote to Machin in\n1712\nproviding a solution to a problem concerning\nKepler\n's second law of planetary motion. Also in\n1712\nTaylor was appointed to the committee set up to adjudicate on whether the claim of\nNewton\nor of\nLeibniz\nto have invented the calculus was correct.\nThe paper we referred to above as being written in\n1708\nwas published in the\nPhilosophical Transactions of the Royal Society\nin\n1714\n. The paper gives a solution to the problem of the centre of oscillation of a body, and it resulted in a priority dispute with\nJohann Bernoulli\n. We shall say a little more below about disputes between Taylor and\nJohann Bernoulli\n. Returning to the paper, it is a mechanics paper which rests heavily on\nNewton\n's approach to the differential calculus.\nThe year\n1714\nalso marks the year in which Taylor was elected Secretary to the\nRoyal Society\n. It was a position which Taylor held from\n14\nJanuary of that year until\n21\nOctober\n1718\nwhen he resigned, partly for health reasons, partly due to his lack of interest in the rather demanding position. The period during which Taylor was Secretary to the\nRoyal Society\ndoes mark what must be considered his most mathematically productive time. Two books which appeared in\n1715\n,\nMethodus incrementorum directa et inversa\nand\nLinear Perspective\nare extremely important in the history of mathematics. The first of these books contains what is now known as the\nTaylor series\n, though it would only be known as this in\n1785\n. Second editions would appear in\n1717\nand\n1719\nrespectively. We discuss the content of these works in some detail below.\nTaylor made several visits to France. These were made partly for health reasons and partly to visit the friends he had made there. He met\nPierre Rémond de Montmort\nand corresponded with him on various mathematical topics after his return. In particular they discussed infinite series and\nprobability\n. Taylor also corresponded with\nde Moivre\non probability and at times there was a three-way discussion going on between these mathematicians.\nBetween\n1712\nand\n1724\nTaylor published thirteen articles on topics as diverse as describing experiments in capillary action, magnetism and thermometers. He gave an account of an experiment to discover the law of magnetic attraction\n(1715)\nand an improved method for approximating the roots of an equation by giving a new method for computing logarithms\n(1717)\n. His life, however, suffered a series of personal tragedies beginning around\n1721\n. In that year he married Miss Brydges from Wallington in Surrey. Although she was from a good family, it was not a family with money and Taylor's father strongly objected to the marriage. The result was that relations between Taylor and his father broke down and there was no contact between father and son until\n1723\n. It was in that year that Taylor's wife died in childbirth. The child, which would have been their first, also died.\nAfter the tragedy of losing his wife and child, Taylor returned to live with his father and relations between the two were repaired. Two years later, in\n1725\n, Taylor married again to Sabetta Sawbridge from Olantigh in Kent. This marriage had the approval of Taylor's father who died four years later on\n4\nApril\n1729\n. Taylor inherited his father's estate of Bifons but further tragedy was to strike when his second wife Sabetta died in childbirth in the following year. On this occasion the child, a daughter Elizabeth, did survive.\nTaylor added to mathematics a new branch now called the \"calculus of finite differences\", invented integration by parts, and discovered the celebrated series known as Taylor's expansion. These ideas appear in his book\nMethodus incrementorum directa et inversa\nof\n1715\nreferred to above. In fact the first mention by Taylor of a version of what is today called Taylor's Theorem appears in a letter which he wrote to Machin on\n26\nJuly\n1712\n. In this letter Taylor explains carefully where he got the idea from.\nIt was, wrote Taylor, due to a comment that\nMachin\nmade in Child's Coffeehouse when he had commented on using \"Sir\nIsaac Newton\n's series\" to solve\nKepler\n's problem, and also using \"Dr Halley's method of extracting roots\" of polynomial equations. There are, in fact, two versions of Taylor's Theorem given in the\n1715\npaper which to a modern reader look equivalent but which, the author of\n[\n8\n]\nargues convincingly, were differently motivated. Taylor initially derived the version which occurs as Proposition\n11\nas a generalisation of\nHalley\n's method of approximating roots of the\nKepler\nequation, but soon discovered that it was a consequence of the\nBernoulli\nseries. This is the version which was inspired by the Coffeehouse conversation described above. The second version occurs as Corollary\n2\nto Proposition\n7\nand was thought of as a method of expanding solutions of fluxional equations in infinite series.\nWe must not give the impression that this result was one which Taylor was the first to discover.\nJames Gregory\n,\nNewton\n,\nLeibniz\n,\nJohann Bernoulli\nand\nde Moivre\nhad all discovered variants of Taylor's Theorem.\nGregory\n, for example, knew that\narctan\n⁡\nx\n=\nx\n−\n1\n3\nx\n3\n+\n1\n5\nx\n5\n−\n1\n7\nx\n7\n+\n.\n.\n.\n\\arctan x = x - \\large\\frac{1}{3}\\normalsize x^{3} + \\large\\frac{1}{5}\\normalsize x^{5} - \\large\\frac{1}{7}\\normalsize x^{7} + ...\narctan\nx\n=\nx\n−\n3\n1\n​\nx\n3\n+\n5\n1\n​\nx\n5\n−\n7\n1\n​\nx\n7\n+\n.\n.\n.\nand his methods are discussed in\n[\n13\n]\n. The differences in\nNewton\n's ideas of Taylor series and those of\nGregory\nare discussed in\n[\n15\n]\n. All of these mathematicians had made their discoveries independently, and Taylor's work was also independent of that of the others. The importance of Taylor's Theorem remained unrecognised until\n1772\nwhen\nLagrange\nproclaimed it the basic principle of the differential calculus. The term \"Taylor's series\" seems to have used for the first time by\nLhuilier\nin\n1786\n.\nYou can see more about Taylor's Series at\nTHIS LINK\n.\nThere are other important ideas which are contained in the\nMethodus incrementorum directa et inversa\nof\n1715\nwhich were not recognised as important at the time. These include singular solutions to\ndifferential equations\n, a change of variables formula, and a way of relating the derivative of a function to the derivative of the inverse function. Also contained is a discussion on vibrating strings, an interest which almost certainly come from Taylor's early love of music.\nTaylor, in his studies of vibrating strings was not attempting to establish equations of motion, but was considering the oscillation of a flexible string in terms of the isochrony of the pendulum. He tried to find the shape of the vibrating string and the length of the isochronous pendulum rather than to find its equations of motion. Further discussion of these ideas is given in\n[\n14\n]\n.\nTaylor also devised the basic principles of perspective in\nLinear Perspective\n(1715)\n. The second edition has a different title, being called\nNew principles of linear perspective\n. The work gives first general treatment of vanishing points. Taylor had a highly mathematical approach to the subject and made no concessions to artists who should have found the ideas of fundamental importance to them. At times it is very difficult for even a mathematician to understand Taylor's results. The phrase \"linear perspective\" was invented by Taylor in this work and he defined the vanishing point of a line, not parallel to the plane of the picture, as the point where a line through the eye parallel to the given line intersects the plane of the picture. He also defined the vanishing line to a given plane, not parallel to the plane of the picture, as the intersection of the plane through the eye parallel to the given plane. He did not invent the terms vanishing point and vanishing line, but he was one of the first to stress their importance. The main theorem in Taylor's theory of linear perspective is that the projection of a straight line not parallel to the plane of the picture passes through its intersection and its vanishing point.\nThere is also the interesting inverse problem which is to find the position of the eye in order to see the picture from the viewpoint that the artist intended. Taylor was not the first to discuss this inverse problem but he did make innovative contributions to the theory of such perspective problems. One could certainly consider this work as laying the foundations for the theory of descriptive and\nprojective geometry\n.\nTaylor challenged the \"non-English mathematicians\" to integrate a certain differential. One has to see this challenge as part of the argument between the Newtonians and the Leibnitzians. Conte in\n[\n7\n]\ndiscusses the answers given by\nJohann Bernoulli\nand\nGiulio Fagnano\nto Taylor's challenge. We mentioned above the arguments between\nJohann Bernoulli\nand Taylor. Taylor, although he did not win all the arguments, could certainly dispute with\nJohann Bernoulli\non fairly equal terms. Jones describes these arguments in\n[\n1\n]\n:-\nTheir debates in journals occasionally included rather heated phrases and, at one time, a wager of fifty guineas. When\nBernoulli\nsuggested in a private letter that they couch their debate in more gentlemanly terms, Taylor replied that he meant to sound sharp and to \"show an indignation\".\nJones also explains in\n[\n1\n]\nthat Taylor was a mathematician of far greater depth than many have given him credit for:-\nA study of Brook Taylor's life and work reveals that his contribution to the development of mathematics was substantially greater than the attachment of his name to one theorem would suggest. His work was concise and hard to follow. The surprising number of major concepts that he touched upon, initially developed, but failed to elaborate further leads one to regret that health, family concerns and sadness, or other unassessable factors, including wealth and parental dominance, restricted the mathematically productive portion of his relatively short life."
}