{
  "nome_completo": "Caius Iacob",
  "nome_curto": "Caius Iacob",
  "ano_nascimento": "1912",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iacob/",
  "lugar_nascimento": "Arad, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Caius Iacob\nwas born two years before the start of World War I. His father, Laza Iacob, was a professor of law at the University and was much involved in the development of modern Romania. World War I was a decisive event in this development for, in\n1916\n, Romania entered the war on the side of the allies on the promise from France and Britain that Romania would gain territory\n(\nparticularly Transylvania\n)\n. Laza Iacob was one of the official delegates at the Union of Romania conference to set this up on\n1\nSeptember\n1918\n.\nCaius attended the lycée \"Moise Nicoara\" in Arad for three classes, then moved to the lycée \"Emil Gojdu\" where he spent his final year. Graduating from school at the age of sixteen, having obtained the highest marks of anyone in the whole of Romania in the baccalaureate examination, he entered the University of Bucharest in\n1928\n. When he graduated with his licence in\n1931\nhe was still only nineteen years of age. He then went to Paris to continue his studies and at the Faculty of Science  his thesis was Henri Villat. Iacob submitted his thesis\nSur la determination des fonctions harmoniques conjuguees par certaines conditions aux limites. Applications a l'hydrodynamique\nⓉ\n(\nOn the determination of harmonic functions conjugate under certain boundary conditions. Applications to hydrodynamics\n)\nand defended it before a committee at the Sorbonne on\n24\nJune\n1935\n.\nReturning to Romania, Iacob decided that he wanted a career in higher education and scientific research. He was appointed as an assistant at the Scola Politehnica at Timișoara in\n1935\n. On\n15\nMarch\n1938\nhe was named assistant in the Faculty of Science at the University of Cluj. At Cluj he worked in the departments of Analytic Geometry, descriptive Geometry, Analysis, and Complex Functions. We should say a little about the history of the University of Cluj since this is relevant to Iacob's career. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n.\n(\nThe Hungarian university in Cluj moved first to Budapest, then to Szeged.\n)\nThe university in Cluj was named King Ferdinand I University and it was at this university that Iacob was appointed in\n1938\n.  However in\n1940\n, after the start of World War II, the Hungarian university was moved back from Szeged to Cluj, and the Romanian university in Cluj moved to Sibiu and Timișoara. In\n1945\n, following the end of World War II, the Romanian University returned to Cluj and was named Babeș University\n(\nafter the Romanian natural scientist Victor Babeș\n)\n. Parts of the Hungarian university in Cluj moved back to Szeged, while that part which remained in Cluj was named the Bolyai University\n(\nafter\nJános Bolyai\n)\n.\nIacob had moved away from Cluj in\n1939\nwhen he was appointed as an assistant in the Faculty of Mechanics at Bucharest University, but he returned to the University of Cluj in\n1942\nwhen he was appointed as a lecturer in the Department of General Mathematics. At this time D V Ionescu was Dean of the Faculty but Ionescu, who was professor in the Department of Mechanics, moved to the Department of Analysis in\n1943\n. Following this Iacob was named professor in the Department of Mechanics on\n30\nDecember\n1943\n. From this time he worked in Cluj until he was named professor of mechanics in the Department of Mechanics and Physics at the University of Bucharest on\n14\nOctober\n1950\n. In\n1952\n-\n53\nhe was vice-rector of the University but he was not to end his association with Cluj for he returned there for the two years\n1967\n-\n69\n. He came back to Cluj into a new section of Fluid Mechanics which had just been set up and there he introduced an aerodynamics course. Even though he was only back at Cluj for a comparatively short period, he organised research seminars on fluid mechanics and many members of the existing staff became his doctoral students at this time. After returning to Bucharest, he worked there until he retired in\n1982\n.\nThe scientific biography\n[\n4\n]\nwas written to celebrate Iacob's\n60\nth\nbirthday. Already in this work\n152\npublications are listed. We give just a flavour of his work by listing a few:\nOn some harmonic functions of two variables\n(\nRomanian\n)\n(1940)\n,\nOn a necessary condition for the transformation into satellites of the planet of bodies projected from a planet\n(\nRomanian\n)\n(1949)\n,\nThéorie de l'aile angulaire aux vitesses supersoniques\nⓉ\n(\nTheory of angular wings at supersonic speeds\n)\n(\nRomanian\n)\n(1950)\n,\nSur quelques écoulements lents des fluides visqueux\nⓉ\n(\nOn the slow flow of viscous fluids\n)\n(\nRomanian\n)\n(1953)\n, and\nRecherches sur la théorie des mouvements coniques supersoniques\nⓉ\n(\nResearch on the theory of supersonic conical movements\n)\n(\nRomanian\n)\n(1954)\n.\nIacob's most important monograph was\nMathematical introduction to the mechanics of fluids\n(\nRomanian\n)\nwhich was published in\n1952\n. This contained material on classical hydrodynamics and compressible-flow theory which Iacob had included in his lecture courses at Cluj during\n1947\n-\n49\nand also material which he had delivered at conferences in Bucharest in\n1950\n. J H Giese writes:-\nIt deals almost entirely with steady irrotational non-viscous flows. Except for chapters on determination of velocity fields corresponding to given vorticity fields, on Prandtl's lifting-line theory of wings of finite span, and sections on conical supersonic flow fields, the problems considered are strictly two-dimensional. As the title implies, the point of view is exclusively theoretical; there is no extended consideration of calculation of aerodynamic coefficients, practical treatment of wind-tunnel corrections, etc. The author's more than twenty years' research on boundary-value problems for plane harmonic functions is reflected in a thorough account of the potential-theoretical background for the solution of plane incompressible-flow and linearized compressible-flow problems.\nThis book by Iacob consisted of over\n800\npages, but a French version of the text\nIntroduction mathématique à la mécanique des fluides\nⓉ\n(\nMathematical Introduction to fluid mechanics\n)\n(1959)\ncontained over\n1200\npages. His thesis advisor Henri Villat wrote a preface to this work. One further book by Iacob deserves mention, namely\nApplied mathematics and mechanics\n(\nRomanian\n)\nwhich he published in\n1989\nas a book for secondary school mathematics teachers. A review of the text explains its level and aims:-\nOne should emphasize, however, that the level of presentation is quite challenging for the \"normal\" high-school student, so the textbook is more appropriate for special \"after-school\" seminars for above-average students interested in mathematics and mechanics, rather than for usual classroom lectures. The author's declared goal is to stimulate both the teacher and his disciples to go beyond the material usually offered in courses on geometry and mechanics.\nThe contents of this book are given at\nTHIS LINK\nIacob received many awards and honours for his contributions. He was awarded the prestigious mechanics prize Henri de Parville in\n1940\nby the\nAcademy of Sciences\nin Paris. His important book on fluid mechanics earned him the State Prize for the period\n1951\n-\n52\n. He was elected a corresponding member of the\nRomanian Academy of Sciences\non\n2\nJuly\n1955\n, becoming a full member on\n21\nMarch\n1963\n. On\n19\nMarch\n1980\nhe was elected President of the Mathematics Section of the Academy and he continued to hold this position until his death.  The Institute of Applied Mathematics of the University of Bucharest was named the \"Caius Iacob Institute\".\nRomania became a communist country under Soviet influence after World War II. In\n1965\nNicolae Ceausescu became head of the Romanian Communist Party but under his control the economic position of the country slowly deteriorated. After twenty years in control of Romania, Ceausescu had created a police state with himself in total domination. However December\n1989\nsaw his overthrow with riots across the country and his execution on\n25\nDecember. Elections were held in May\n1990\nand Iacob was elected as a senator for the PNT party. He continued in this role until his death in early\n1992\n."
}