{
  "nome_completo": "Carl David Tolmé Runge",
  "nome_curto": "Carl Runge",
  "ano_nascimento": "1856",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Runge/",
  "lugar_nascimento": "Bremen, Germany",
  "lugar_morte": "Göttingen, Germany",
  "biografia": "Carl Runge\n's parents were Julius Runge and Fanny Tolmé. Julius Runge was from a family of merchants but he went to Havana, Cuba, around\n1836\n. He returned frequently to Bremen but lived mostly in Havana for around\n20\nyears. Fanny Tolmé was the daughter of the English merchant Charles David Tolmé who was living in Havana. Tolmé does not sound very English, and indeed it is not for the family was of Huguenot descent. Julius and Fanny were married in Havana on\n16\nMay\n1846\n. Carl was the third of his parents' four sons. There were also four daughters from the marriage. Although Carl was born in Bremen, he spent his early years in Havana. Carl, who was always very close to his mother, was brought up like a typically British child. In fact Julius and Fanny spoke English at home so the children grew up with English as their first language. Three of Carl's four older siblings eventually settled in England. After Julius retired, the family returned to live permanently in Bremen, but Julius had only a short retirement for he died on\n18\nJanuary\n1864\n. Fanny was left on her own to bring up the eight children. Forman writes\n[\n1\n]\n:-\nThere was thus a strong British element in his upbringing, particularly an emphasis upon sport, self-reliance, and fair play that, in combination with the civic traditions of the Hanseatic town, influenced his political and social views.\nCarl attended the Lyceum in Bremen and, in\n1875\n, passed the examinations required for university entrance. After leaving school in\n1875\n, Carl Runge spent six months with his mother visiting the cultural centres of Italy. On his return to Germany he enrolled at the University of Munich at Easter\n1876\nto study literature and philosophy. His three elder brothers had not been interested in pursuing academic careers and they had all opted to enter the commercial world. Runge's career as a student of literature was, however, short lived for after six weeks of the course he changed to mathematics and physics. Runge attended courses with fellow student\nMax Planck\nand they became close friends, remaining so for the rest of their lives.\nIn the autumn of\n1877\nPlanck\nand Runge both went to Berlin but Runge turned to pure mathematics after attending\nKarl Weierstrass\n's lectures. He had not found the lectures on mathematical physics given by\nKirchhoff\nand by\nHelmholtz\nparticularly attractive. On the other hand, he loved the courses given by\nErnst Kummer\nas well as those given by\nWeierstrass\n. Although Runge had committed himself to the study of pure mathematics he did not lose his initial interest in philosophy. He attended Friedrich Paulsen's course on David Hume in the winter semester of\n1878\n-\n79\n. Paulsen had just been appointed as an extraordinary professor at Berlin and Runge rated him extremely highly. He wrote that Paulsen was one of the two\n[\n1\n]\n:-\n... to whom I owe the best of my knowledge and ability.\nHis doctoral dissertation, submitted to the University of Berlin on\n23\nJune\n1880\n, dealt with\ndifferential geometry\n. The title of the thesis was\nÜber die Krümmung, Torsion und geodätische Krümmung der auf einer Fläche gezogenen Curven\nⓉ\n(\nOn curvature, torsion and geodesic curvature of the surface curves on a solid\n)\nand it was examined by\nFerdinand Rudio\n, W Sachse, and Adolf Piltz who was a doctoral student of\nKummer\nand\nWeierstrass\n. Now, although\nWeierstrass\nwas his advisor, he had not suggested the topic of Runge's thesis; rather this had come out of discussions he had with other students in the Mathematischer Verein in which he was actively engaged.\nAfter qualifying to be a\nGymnasium\nteacher during session\n1880\n-\n81\n, he completed the necessary examinations and returned to Berlin where he began to collaborate with\nKronecker\n. Runge then worked on a procedure for the numerical solution of algebraic equations in which the roots were expressed as infinite series of\nrational functions\nof the coefficients. There were three standard methods for the numerical solution of such equations, namely by\nNewton\n,\nBernoulli\nand\nGräffe\n, and the method found by Runge had all three of the standard methods as special cases. He included these results in his\nHabilitation\nthesis which he submitted to Berlin in February\n1883\n. This entitled him to lecture at the University of Berlin, and there he continued to undertake research on algebra and function theory as part of the group of mathematicians which had built up around\nKronecker\n.\nRunge had published little at this stage in his career but after visiting\nMittag-Leffler\nin Stockholm in September\n1884\nhe was persuaded by\nMittag-Leffler\nto write up the results he had produced. With this encouragement, he wrote a number of papers which were printed in\nMittag-Leffler\n's journal\nActa mathematica\nin\n1885\n. Runge was not only making his mark as a mathematician, he was also entering into the social life of Berlin\n[\n1\n]\n:-\nRunge - tall, lean, with a large finely sculptured head - had developed exceptional skill as an ice skater in his youth; and in Berlin in the early\n1880\ns when that activity was becoming extremely fashionable, he cut a striking figure.\nOne of the most impressive professors at Berlin was Émile du Bois-Reymond, older brother of the mathematician\nPaul du Bois-Reymond\n. Émile du Bois-Reymond was interested in physiology, medicine and philosophy and gave a famous speech at the\nBerlin Academy of Science\nin\n1880\nin which he listed seven riddles which, he declared, science could not explain. These included: the ultimate nature of matter and force; the origin of motion; the origin of life; and the question of freewill. Runge became friendly with Émile du Bois-Reymond's family, particularly with his children. He became engaged to Aimée du Bois-Reymond in\n1885\nbut her father, who had been brought up a Pietist and had strict views, said that they would not be allowed to marry until Runge had obtained a professorship. Fortunately this did not prove to be an obstacle for long for in March\n1886\nRunge obtained a chair at the Technische Hochschule at Hannover. He married Aimée in August\n1887\nand remained in Hannover for\n18\nyears. Paschen\n(\nwho collaborated with Runge for seven years, see below\n)\nwrites about Runge and his family life in Hannover\n[\n4\n]\n:-\nThey had four daughters and two sons, one of whom was killed in the war\n[\nWorld War I\n]\n. Runge's home at Hannover ... will never be forgotten by those who had the privilege of entering it. The family cultivated many sciences and arts. Runge himself played the piano, and he and his children would often render musical classics such as the 'Matthäus Passion'. Runge was a man of affairs and of great personal charm. He was fond of all kinds of sports and practised bicycling, gymnastics, and swimming. At Hannover he used to ride his bicycle a distance of about eight kilometres from his house top the Technische Hochschule four times a day. In all his activities he placed scientific things foremost and was willing to sacrifice everything to their advancement.\nWithin a year of taking up the professorship at Hannover, Runge had moved away from pure mathematics to study the wavelengths of the spectral lines of elements other than hydrogen.\n(\nJ J\nBalmer\nhad constructed a formula for the spectral lines of helium.\n)\nIn fact Runge's interest in this topic came though Émile du Bois-Reymond in the year before Runge had married his daughter. Du Bois-Reymond had attended a lecture at the\nBerlin Academy\nby Heinrich Kayser on the topic, which had interested him, and after Kayser was appointed as Professor of Physics at the Technische Hochschule of Hannover in the autumn of\n1885\n, all three men began to work on the problem together. Kayser and Runge published seven joint papers in the Proceedings of the\nBerlin Academy of Science\nover a period of seven years. These papers, covering over\n350\npages, made important contributions. In one of these papers, published in\n1888\n, they write that this problem of the wavelengths of the spectral lines of elements other than hydrogen was\n[\n1\n]\n:-\n... affording a much deeper insight into the composition and nature of atoms than any other physical process.\nRunge did a great deal of experimental work and published a great quantity of results. He succeeded in arranging the spectral lines of helium in two spectral series and, until\n1897\n, this was thought to be evidence that hydrogen was a mixture of two elements. After working with Kayser for seven years, Kayser left Hannover in\n1894\nto take up the chair of physics at the University of Bonn. This had become vacant through the tragic death of\nHeinrich Hertz\nat age\n36\nfrom blood poisoning. Runge continued his work on spectroscopy alone for six months but then persuaded Friedrich Paschen to join him. Paschen was an experimentalist and they worked together at Hannover for seven years. Runge visited England in\n1895\nand became friendly with\nLord Rayleigh\n. Two years later he travelled to the United States where he became friends with A A Michelson. While in the United States he visited Yerkes Observatory and was offered a professorship by George E Hale but he declined. Paschen writes about their joint work in Hannover\n[\n4\n]\n:-\nWe investigated the spectrum of helium when this gas was first discovered by Ramsay. We then turned to the spectra of oxygen, sulphur, and selenium. In these spectra we found for the first time series systems of two different multiplicities.\nIn\n1901\nPaschen left Hannover when he was appointed professor of physics at the University of Tübingen. At this stage Runge continued his work with Julius Precht who had previously held the Extraordinary Chair of Theoretical Physics at Heidelberg. Runge and Precht worked\n[\n4\n]\n:-\n... on the spectrum of radium and on the Zeeman effects on its lines. They found the principal groups of lines in the arc and in the spark spectrum and classified them as belonging to that of an alkali-earth.\nIt is interesting to consider why Runge remained so long at the Technische Hochschule at Hannover while others were appointed to more prestigious chairs. The reason almost certainly is that Runge did not fit in. On the one hand he was considered a traitor to mathematics by many having left the area to undertake research in physics. Physicists, however, considered Runge a mathematician and would have not considered him entirely suitable for a chair of physics at one of the leading institutions. It is worth remarking at this point that Runge always considered himself a mathematician\n.\nIn\n1904\nKlein persuaded Göttingen to offer Runge a chair of Applied Mathematics, a post which Runge took up in the October of that year and held until he retired in\n1925\n[\n4\n]\n:-\nAt Göttingen he was appointed for teaching and research in applied mathematics. He worked out many numerical and graphical methods, gave numerical solutions of differential equations, etc. He was the pioneer in introducing this kind of mathematics into Germany.\nAt Göttingen, Runge became highly involved in teaching and undertook less research. He published\nAnalytische Geometrie der Ebene\nin\n1908\nand the book\nVorlesungen über numerisches Rechnen\nⓉ\n(\nLectures on numerical computing\n)\n, co-authored with H König, in\n1924\n. He lectured on\nGraphical methods\nat Columbia University in New York from October\n1909\nto January\n1910\n, being Kaiser Wilhelm Professor of German History and Institutions for the year\n1909\n-\n1910\n.\nHere is the\nIntroduction to\nGraphical methods\n.\nRunge was a highly influential figure in the University of Göttingen\n[\n1\n]\n:-\nDespite his liberal political views - open opposition to the annexations during World War I and membership in the Democratic Party afterwards - Runge retained the confidence of his colleagues and his influence in the university.\nRunge reached the retirement age of\n68\nin\n1923\nbut he continued to run his Institute until his successor,\nGustav Herglotz\n, arrived in\n1925\n. We should note, however, that the name of the chair ceased to be 'Applied Mathematics' when\nHerglotz\ntook over.\nWe have noted above that Runge was very sporting, a fit and active man even as he grew older, and on his\n70\nth\nbirthday he entertained his grandchildren by doing handstands. He was still mathematically active with several ambitious projects underway. However six months later he had a heart attack and died. His mother Fanny had died in\n1910\n."
}