{
  "nome_completo": "Carlo Miranda",
  "nome_curto": "Carlo Miranda",
  "ano_nascimento": "1912",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Miranda/",
  "lugar_nascimento": "Naples, Italy",
  "lugar_morte": "Naples, Italy",
  "biografia": "Carlo Miranda\n's parents were Elena Nimmo and Giovanni Miranda, a physician and professor at the University of Naples where he served as rector during the years\n1921\n-\n22\nwhen his son Carlo was growing up. Carlo attended school in Naples, completing his secondary education at the age of fifteen. Entering the University of Naples in\n1927\n, he studied mathematics with\nMauro Picone\nand graduated on\n16\nJuly\n1931\nat the age of eighteen. His thesis, on singular\nintegral equations\nof the first and second kind with non-symmetric kernel, and the related question of the integral representation of a square integrable function, was inspired by the research of\nTage Gills Torsten Carleman\n. Miranda had not just been influenced by\nPicone\nwhile he studied at Naples, but he had also learnt much from\nPicone\n's assistant\nRenato Caccioppoli\nand from\nCaccioppoli\n's thesis advisor Ernesto Pascal.\nAfter graduating, Miranda became an assistant in infinitesimal calculus, supporting the chair of mathematics held by\nPicone\n. In fact\nPicone\nhad another three assistants at that time,\nRenato Caccioppoli\n,\nGianfranco Cimmino\nand Giuseppe Scorza Dragoni. These four assistants are referred to as \"\nMauro Picone\n's four musketeers\" in Scorza Dragoni's article\n[\n12\n]\n. They worked in the \"Institute for Calculus\" which had been founded by\nPicone\nin Naples in\n1927\n. After a year working with this distinguished team of scholars, Miranda left Naples in\n1932\nwith\nPicone\nwhen he moved his Institute to Rome on being appointed to the chair of Higher Analysis there. Mario Salvadori explained in his autobiography\nA Tangential Life\n(\nsee\n[\n13\n]\n)\nhow this move came about:-\nPicone\n, a vivacious, bright and aggressive Sicilian had been the first mathematician in Italy to recognize the importance of numerical analysis ... the pure mathematicians at the University of Rome despised the subject, although the Germans had already given it high status in some of their universities. With admirable single mindedness and great political skill\nPicone\nsucceeded in getting appointed to a chair of mathematical analysis in Rome, left Naples University together with his brilliant assistant Miranda and, besides teaching the kind of mathematics acceptable to his illustrious colleagues, obtained a small grant from the newly established Italian National Research Council to start in a small apartment in Rome in a new section of town the high-sounding \"Institute for the Applications of the Calculus.\"\nMiranda continued to work as part of the National Institute for the Applications of the Calculus\n(\nINAC\n)\nin Rome. He visited Paris in the academic year\n1934\n-\n35\n, supported by a scholarship, and attended lectures by\nJacques Hadamard\nand\nPaul Montel\n. During this time in Paris he became friendly with several mathematicians, including\nJean Leray\nand\nHans Lewy\n. Miranda returned to Rome for the academic year\n1935\n-\n36\nwhen he was put in charge of teaching the theory of functions at the University of Rome. He continued in this role in\n1936\n-\n37\nbut, during\n1937\n, he won the competition for the chair of Algebra and Infinitesimal Calculus at the University of Genoa. He took up this chair towards the end of\n1937\n, and the course he taught there in\n1937\n-\n38\nbecame the book\nLezioni di analisi algebrica\nⓉ\n(\nLessons on algebraic analysis\n)\n. He left Genoa in\n1939\nwhen he was appointed to the Turin Polytechnic. Examples of his work around this time are:\nSu un problema di Minkowski\nⓉ\n(\nOn a  problem of Minkowski\n)\n(1939)\nwhich considers the problem of determining a convex surface of given Gaussian curvature;\nSu alcuni sviluppi in serie procedenti per funzioni non necessariamente ortogonali\nⓉ\n(\nOn some developments in the proceeding series for not necessarily orthogonal functions\n)\n(1939)\nwhich examines expansion theorems in terms of the characteristic solutions of an integral equation whose kernel, although symmetric, involves the characteristic parameter;\nNuovi contributi alla teoria delle equazioni integrali lineari con nucleo dipendente dal parametro\nⓉ\n(\nNew contributions to the theory of linear integral equations with kernel dependent on parameters\n)\n(1940)\nwhich examines the development of the\nHilbert\n-\nSchmidt\ntheory for a particular type of linear integral equation; and\nObservations on a theorem of Brouwer\n(1940)\nwhich gave an elementary proof of the equivalence of\nBrouwer\n's fixed point theorem and a special case of\nKronecker\n's index theorem.\nIn September\n1939\nWorld War II began with the German invasion of Poland. Italy did not enter the war at this point and only in June\n1940\ndid Italy declare war on Britain and France. However, days later France fell and so only in October\n1940\ndid the war take shape for Italy when they attacked Greece. Miranda was teaching in Italy and the right age to be drafted into the army but he managed to avoid being called up. This was largely due to the efforts of\nPicone\nwho made Miranda a consultant for the National Institute for the Applications of the Calculus\n(\nINAC\n)\nand argued that the Institute was vital for military research and therefore its staff\n(\nincluding consultants such as Miranda\n)\nmust remain in post and not be drafted into the army.\nPicone\nwas a member of the Fascist party and had made a strong argument that the INAC was undertaking \"Fascist mathematics\". He had indicated in a report in\n1938\nthat the Institute was undertaking important theoretical work, and here he emphasised Miranda's work on the calculus of variations and eigenvalue problems. The report also listed the military work commissioned by the Ministry of National Defence.\nMiranda continued to work at the Turin Polytechnic where he was promoted to full professor in\n1941\n. He requested a transfer to the University of Naples where he moved at the beginning of the academic year\n1943\n-\n44\n. At the beginning of the academic year\n1944\n-\n45\nhe moved to the chair of Algebraic and Infinitesimal Analysis. The war had gone badly for Italy and Mussolini was deposed in July\n1943\n. This was largely due to Pietro Badoglio who became prime minister, and arranged an unconditional surrender to the Allies in September\n1943\n. The Fascist party was dissolved and Italy declared war on Germany in October. However, German armies defended Italy against the Allied advance from the south. In October the Allies entered Naples but their advance was stopped at this point. During the occupation of Naples by the allied troops, the buildings of the Faculty of Mathematics, Physics and Natural Sciences, located in the Via Mezzocannone, were requisitioned and used by the U.S. Army Military Police. They continued to occupy the buildings until Rome fell to the Allies in June\n1944\n. It was impossible to move around Italy during these years of violent conflict and half of the mathematicians employed at the University of Naples were unable to reach the city. Only two mathematicians, Miranda and\nCaccioppoli\ntogether with the astronomer Vittorio Nobile, were teaching there at this time, with one further mathematician, G Andreoli, suspended by the Allies because of his uncompromising adherence to fascism.\nWith World War II finally over, it was left to Miranda and\nCaccioppoli\nto rebuild mathematics at the University of Naples. However,\nCaccioppoli\nhad no practical or organisational skills so it was left to Miranda, in his early thirties, to revive mathematics at the University of Naples on his own. He was offered little help and had few resources, but he had a clear vision of how he wanted to develop mathematics based on an Institute of Mathematics with single well stocked library. The Institute began to operate from\n1944\n, with Miranda as its director. He held this role until\n1963\nand was personally responsible for many years for the remarkable growth of the library. This, however, was not easily achieved for although many books had survived the war, they were randomly piled up and the old library catalogues had been destroyed. The teaching load during the post-war years was particularly heavy for Miranda, since he restarted a full lecture programme with only\nCaccioppoli\nto assist with lectures and a few assistants in charge of exercise classes. However, between Miranda and\nCaccioppoli\nthere was a profound scientific and human bond - they complemented each other perfectly due to their different character traits; both were brilliant but\nCaccioppoli\nwas totally disorganised while Miranda was a superb organiser.\nGuido Stampacchia\nhad been a student at Pisa when, due to the war, he had to undertake military service. He was able to return to his home town of Naples after the Allies took control of the city in October\n1943\n. However, the Liberation Army then put him to work on administrative duties and he was not discharged from his military duties until June\n1945\n. He was able to take advantage of a special dispensation which allowed students to complete their degrees so he studied at Naples taught by Miranda and\nCaccioppoli\n. A scholarship enabled him to continue his research at the University of Naples under the supervision of\nCaccioppoli\nand Miranda, and he also undertook tutorial work to assist the Professor of Algebraic Analysis, although this was done on a voluntary basis.\nStampacchia\nfelt that contact with\nCaccioppoli\nand Miranda was important for him and\nLeonida Tonelli\nadvised him to take a position as an assistant at the Naval Institute at Naples. In addition to teaching at the Naval Institute he taught at the University on a voluntary basis and was able to add to both the teaching there and to the vigorous research team which Miranda had begun to build at the Institute.\nMiranda had married Ersilia Sterlacci and they lived in Naples at\n31\nVia F Crispi; they had one daughter Elena.\nAntonio Avantaggiati describes Miranda's mathematical contributions in detail in\n[\n1\n]\nand divides these contributions into the following areas:\n(\na\n)\nIntegral equations, series expansions, summation methods;\n(\nb\n)\nHarmonic mappings, potential theory, holomorphic functions;\n(\nc\n)\nCalculus of variations, differential forms, elliptic systems;\n(\nd\n)\nNumerical analysis;\n(\ne\n)\nPropagation problems;\n(\nf\n)\nDifferential geometry\nin the large;\n(\ng\n)\nGeneral theory for elliptic equations; and\n(\nh\n)\nFunctional transformations. Jesus Hernández writes in a review of\n[\n1\n]\n:-\nSeveral of these contributions are treated with some detail: results concerning normal families and approximation theory, the equivalence between Brouwer's fixed point theorem and a result for the zeroes of some systems of continuous functions, the\nCauchy\n-\nDirichlet\nproblem for the propagation equation, the numerical integration of the Thomas-\nFermi\nequation, integral equations\n(\nintroducing the notions of pseudofunction and singular eigenvalue\n)\n, problems of differential geometry \"in the large\", etc. His work on partial differential equations, especially on first order linear systems in dimension greater than\n2\n(\nwhere conformal mapping cannot be used\n)\n, is very interesting, and the same thing can be said about the integration of exterior differential forms of any degree\n(\nestablishing for the first time in\n1953\nthe algebraic-topological nature of the index for some elliptic problems\n)\n. The proof of the maximum modulus principle for elliptic equations of order\n2\nm is also remarkable. We point out his very special interest in two of the main tools of the \"modern\" theory of partial differential equations, namely a priori estimates and the application of functional analysis. Some attention is paid to his important book on partial differential equations.\nThis book,\nEquazioni alle derivate parziali di tipo ellittico\nⓉ\n(\nPartial differential equations of elliptic type\n)\n(1955)\n, was translated into Russian and published in\n1957\n, and an English translation appeared in\n1970\n.\nGaetano Fichera\nbegins a review of the\n1955\nItalian text as follows:-\nThis monograph is essentially a complete and thorough review of various methods that have been introduced in the mathematical literature to prove existence theorems for problems concerning second order partial differential equations of elliptic type, both linear and nonlinear. With powerful synthesis and truly wonderful discerning exposition, the author succeeds in this goal by providing students of partial differential equations with a work of fundamental importance.\nEarlier than this, in\n1949\n, Miranda had published his lecture notes for the academic year\n1948\n-\n49\non\nProblemi di esistenza in analisi funzionale\nⓉ\n(\nExistence problems in functional analysis\n)\n. This was reissued in\n1975\n. He published another set of lectures under the title\nSu alcuni problemi di geometria differenziale in grande per gli ovaloid\nⓉ\n(\nOn some problems of differential geometry in the large for the ovaloid\n)\nin\n1973\n. These lectures had been given in\n1971\n-\n72\n.\nAlthough Miranda was assisted by\nCaccioppoli\nin building a school of mathematics in Naples for over ten years, this tragically ended in\n1959\nwith\nCaccioppoli\n's suicide. Miranda was, by this time, Dean of the Faculty of Sciences at Naples, a role he held for ten years from\n1958\n. Also in\n1958\nhe had become vice-president of the\nUnione Matematica Italiana\n(\nItalian Mathematical Union\n)\n, holding this position until\n1964\n. He founded the journal\nRicerche di Matematica\nin\n1952\nand, with\nCaccioppoli\n, relaunched the\nGiornale matematiche di Battaglini\n. He served on the editorial board of the\nAnnali di matematica pura ed applicata\n(\nMilan\n)\nand the\nMemorie di matematica\n, which is a journal published by the\nNational Academy of Sciences of Italy\n(\nthe Academy of Forty\n)\n.\nMiranda was honoured with election to the\nAccademia dei Lincei\nin\n1968\n. This academy had already awarded him the prestigious Presidente della Repubblica prize, in\n1961\n. He was also elected to a number of other academies. He was awarded the Urania Prize by the City of Naples in\n1954\nand the Gold Medal for Science, Culture and the Arts in\n1960\n. Following his sudden death, he was honoured by the Academy of Science Physics and Mathematics of Naples who set up an award in his name for young Italian analysts specialising in the study of elliptic equations. The mathematics library at the University of Naples is named for him, as are two high schools. An international conference on\nMethods of functional analysis and theory of elliptic equations\nwas held in his honour in Naples\n13\n-\n16\nSeptember\n1982\n."
}