{
  "nome_completo": "Cesare Burali-Forti",
  "nome_curto": "Cesare Burali-Forti",
  "ano_nascimento": "1861",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Burali-Forti/",
  "lugar_nascimento": "Arezzo, Italy",
  "lugar_morte": "Turin, Italy",
  "biografia": "Cesare Burali-Forti\n's parents were Cosimo Burali-Forti\n(1834\n-\n1905)\nand Isoletta Guiducci. Cosimo was Chief Secretary of the Province of Arezzo. He was described as a\n[\n8\n]\n:-\n... man of a thousand interests, a versatile genius, who took charge of legal and administrative disciplines, was a student of local history, a painter, but particularly a passionate lover of music that became his favourite activity.\nAfter schooling in Arezzo, Cesare attended the Military College in Florence, completing his secondary level studies there in\n1879\n. The years he was growing up were difficult years in the new Italy with widespread unrest which eased after Rome became part of Italy in\n1870\n. He entered the University of Pisa in December\n1879\n, where his teachers included\nUlisse Dini\n,\nLuigi Bianchi\n,\nEnrico Betti\n, and\nVito Volterra\n.\nBurali-Forti studied at Pisa from\n1879\nto\n1884\n. Documents show that he progressed from the first to the second year of studies in the Faculty of Mathematics and Physics on\n13\nNovember\n1880\n, and began his third year of studies on\n7\nNovember\n1881\n, without having taken the Physics and the Chemistry examinations. He moved from the third year to the fourth in November\n1882\n. During these years he was taught by several mathematicians, the most influential being those we mentioned above.\nDini\nheld the chair of analysis and higher geometry as well as the chair of infinitesimal analysis.\nBianchi\nhad been a student at Pisa but had studied abroad before returning to Pisa in\n1881\nwhere he taught\ndifferential geometry\n.\nBetti\n, although his interests had been in algebra and topology, was by this time becoming interested in mathematical physics and held the chair of celestial mechanics. For the first part of Burali-Forti's studies at Pisa,\nVolterra\nwas a research student but he became Professor of Mechanics in\n1883\n. With rapidly developing political events in the new country of Italy, several of Burali-Forti's lecturers were also involved in politics. For example after serving in local government,\nDini\nwas elected to the national Italian parliament in\n1880\nas a representative from Pisa. Among the courses taken by Burali-Forti we mention those on infinitesimal analysis and higher analysis by\nDini\n, and courses on rational mechanics, celestial mechanics and mathematical physics taught by\nBetti\n. He graduated with his laurea in mathematics on\n19\nDecember\n1884\nafter submitting his dissertation\nCaratteristiche dei sistemi di coniche\nⓉ\n(\nCharacteristics of conical systems\n)\n. At his final examination he had to answer questions on mathematical physics topics that\nBetti\nhad discussed with\nRiemann\nduring his visits to Pisa in the\n1860\ns.\nImmediately after graduating Burali-Forti taught at the Technical Institute in Augusta, Sicily, where he was appointed on\n29\nAugust\n1886\n, but he moved to Turin in\n1887\nwhen he was successful in the competition for an extraordinary professorship at the Military Academy of Artillery and Engineering. He could not marry before obtaining a position with an income which would allow him to support a wife and family and this appointment, starting on\n1\nSeptember\n1887\n, certainly meant that he was now financially secure. He also taught at the Sommeiller technical school in Turin until\n1894\nwhich provided him with further income. On\n29\nOctober of\n1887\n, he married Gemma Viviani; they had a son Umberto who was born on\n9\nAugust\n1889\n. His appointment in\n1887\nhad been on a temporary basis but on\n30\nJune\n1900\nhis position was made permanent. On\n30\nOctober\n1902\nhe was promoted to extraordinary professor first-class and then in\n1906\nhe became a full professor, holding the chair of projective geometry. He was the only professor at the Military Academy who was not himself a military man. Burali-Forti spent the rest of his career at the Military Academy.\nRoberto Marcolongo\n[\n25\n]\n, described him as a lecturer:-\n... the teacher of many generations of military officers, the scholarly man was fondly remember as the gruff but kindly professor and they studied his elegant and rich courses of analytic and projective geometry.\nSome of Burali-Forti's colleagues at the Military Academy were particularly important in his developing research interests. On\n13\nNovember\n1887\n, just a few weeks after Burali-Forti was appointed,\nGiuseppe Peano\njoined the faculty of the Military Academy. The two became good friends and collaborated with each other in mathematical investigations. Through the years Burali-Forti did much to bring\nPeano\n's work to a wider audience.\nPeano\ntaught mathematics there until\n1901\nas well as having university appointments. Also\nMario Pieri\nwas hired as a professor in the Military Academy in the same year as Burali-Forti and remained there until\n1\nMay\n1900\n, when he moved to Sicily, having won the competition for a professorship in projective and descriptive geometry at the University of Catania.\nA university teaching position would have been more to Burali-Forti's liking but in this he had difficulties. He was a great believer in vector methods but, at this time, these were not in favour. It is hard to believe from our present view of mathematics that vector methods would ever be less than welcomed. However, at this time many mathematicians opposed vector methods and unfortunately these views prevailed on the committee that considered Burali-Forti's submission for a\nlibera docenza\n, the necessary qualification to hold positions in a university and to enter competitions for a university chair. He was failed on these grounds, never tried again, and as a consequence was never able to teach officially in a university, although he did give informal lecture courses there.\nSomething of the different opinions on the vector calculus, and in particular on Burali-Forti's approach to it are at\nTHIS LINK\n.\nThe fact that he was working at the Military Academy and not a university put Burali-Forti in a more difficult position regarding research than other academics. For example in\n1912\nhe could not attend the International Congress of Mathematicians held at Cambridge, England, in August of that year, despite having presented a communication\nSur les lois générales de l'algorithme des symboles de fonction et d'operation\nⓉ\n(\nOn the general laws of the algorithm function symbols and operation\n)\n, because in August he had to deliver his courses at the Academy. He refers to this in the letter sent from Turin on\n22\nMarch\n1912\nto\nBertrand Russell\n, the organiser of the Philosophical Section of the Congress. See\nTHIS LINK\n.\nIn\n1893\n-\n94\nBurali-Forti gave an informal series of lectures on mathematical logic at the University of Turin. After the course the lectures were written up as the book\nLogica matematica\nand Burali-Forti presented a copy of the book to the Academy of Sciences of Turin in June\n1894\n.  We have translated the Preface of this book into English and present our version  at\nTHIS LINK\n.\nAt the start of the\n1894\n-\n95\nacademic session, Burali-Forti became\nPeano\n's assistant at the University of Turin. He was to hold this position until\n1896\n.\nThe first International Congress of Mathematicians was held in Zürich from\n9\nto\n11\nAugust\n1897\n. Burali-Forti attended the Congress and presented a paper\nPostulats pour la géométrie d'Euclide et de Lobatschewsky\nⓉ\n(\nPostulates for Euclidean geometry and Lobatschevsky's geometry\n)\nto the Geometry section of the Congress.\nBurali-Forti is famed as the first discoverer of a set theory paradox in\n1897\nwhich was framed in technical terms but in essence reduces to a 'set of all sets' paradox.\nCantor\nwas to discover a similar paradox two years later. Burali-Forti's paradox appeared in his paper\nUna questione sui numeri transfiniti\nⓉ\n(\nA question on transfinite numbers\n)\n(1897)\n. In this he considered the set of all ordinal numbers\nW\nW\nW\n. He showed that one easily obtains the contradiction\nW\n+\n1\n>\nW\nW + 1 > W\nW\n+\n1\n>\nW\nand\nW\n+\n1\n≤\nW\nW + 1 ≤ W\nW\n+\n1\n≤\nW\n.\nOne might have expected this to create a great deal of interest but its impact was minimal. One reason certainly seems to be that Burali-Forti had confused\nCantor\n's well-ordered sets with what he called 'perfectly ordered sets'. He quickly realised his error and published a correction in a\n1\n-page paper\nSulle classi ben ordinate\nⓉ\n(\nOn well-ordered classes\n)\n(1897)\n. Irving Copi writes\n[\n16\n]\n:-\nHe concluded the note with the observation that his result could be established on the basis of the correct definition of well-ordered set as easily as for the \"perfectly ordered sets\" for which it had first been obtained.\nHowever, despite the fact that the corrected result clearly demonstrated a contradiction, the original mistake and the resulting confusion of many, led to his result being attributed to a 'misunderstanding'.\nGeorg Cantor\nwrote, most unfairly:-\nWhat Burali-Forti has produced is thoroughly foolish. If you go back to his articles in the 'Circolo Matematico' you will remark that he has not even understood properly the concept of a well-ordered set.\nEven after\nBertrand Russell\nhad discovered his own \"set of all sets\" paradox in\n1903\n, he did not seem to realise that it had any connection to Burali-Forti's paradox.\nRussell\n[\n16\n]\n:-\n... observed that he could not accept Burali-Forti's conclusion that ordinal numbers are not necessarily comparable, preferring to accept\nCantor\n's results in this connection as established. He urged that Burali-Forti's contradiction could be simply resolved by denying the premise that the series of all ordinal numbers is well-ordered, \"... since, so far as I know, it is incapable of proof.\"\nCopi gives another reason for Burali-Forti's paradox being ignored\n[\n16\n]\n:-\nBurali-Forti had written his article in the logical symbolism of\nPeano\n. This new mathematical logic of\nPeano\n, which had far-reaching implications and tremendous importance, achieving its culmination in the 'Principia Mathematica' of\nWhitehead\nand\nRussell\n, was then but little known. Burali-Forti's language was new and strange, and intelligible to but few mathematicians. This circumstance undoubtedly contributed to the relative neglect of his paradoxical result.\nAs well as set theory and vector analysis, Burali-Forti also worked on linear transformations and their applications to differential geometry\n[\n23\n]\n:-\nBurali-Forti investigated the applications of vector calculus in a very wide variety of fields - from projective and differential geometry to the continuum mechanics, from optics to\nLorentz\ntransformations and to hydrodynamics - and introduced the fundamental notion of the derivative of a vector as compared with a point, which allowed him to unify and considerably simplify the foundations of vector analysis.\nEdgar Odell Lovett\n(1871\n-\n1957)\nreviewed Burali-Forti's book\nIntroduction à la géométrie différentielle suivant la méthode de H Grassman\n(1897)\nin\n[\n22\n]\n. He writes:-\nBurali-Forti's work, though by no means a pioneer in the application of\nGrassmann\n's theories to differential geometry ..., shows the elegant power and simplicity of the geometrical calculus in elementary differential geometry and points the student to a vast field of transformations and researches in higher geometry.\nFor a list of Burali-Forti's publications see\nTHIS LINK\n.\nAnother important contribution by Burali-Forti is discussed by Erika Luciano and Clara Silvia Roero in\n[\n23\n]\n:-\nThe sound mastery of the methods and language of ideographic logic made Burali-Forti one of the first and most active collaborators on the 'Formulaire de Mathématiques'. He wrote the chapter on arithmetics and the theory of magnitudes for the first edition of the treatise\n(1895)\n; he edited the sections on curvature, torsion, relative torsion, ordinary points, inflection points, cusps, cycloid and epicycloid for the\n1902\n-\n03\nedition and in conclusion drafted those on algebra, in particular on the \"producto logico\"\n(\nintersection\n)\nand \"summa logica\"\n(\nunion\n)\nfor the final,\n1908\nedition.\nPeano\nalso inserted in the fourth volume of the 'Formulario'\n(1902\n-\n03)\nsome notions of projective geometry taken from Burali-Forti's three reports entitled 'Il metodo di Grassmann nella Geometria proiettiva'\nⓉ\n(\nThe Grassmann method in projective geometry\n)\n.\nNot only was Burali-Forti a prolific writer, with over\n200\npublications, he was also very interested in how to teach mathematics. The \"Mathesis\" Italian Society of Mathematicians, aimed at school teachers of mathematics, was founded in\n1895\n. Burali-Forti joined Mathesis in academic year\n1897\n-\n98\n. He played a major role in the first congress of the Society which was held in Turin in September\n1898\n.\nWe have mentioned that Burali-Forti was a close friend of\nPeano\n's but his closest friend and mathematical collaborator was\nRoberto Marcolongo\n. Burali-Forti and\nMarcolongo\nwere called the \"vectorial binomial\" by their friends. However this collaboration ended when they differed in their views on relativity. Burali-Forti never understood the theory of relativity and, in\n1924\n, Burali-Forti, in collaboration with\nTommaso Boggio\n(1877\n-\n1963)\n, published\nÉspaces Courbes Critique de la Relativité\nⓉ\n(\nCurved spaces:  Critique of relativity\n)\n. The authors write that they want:-\n... to consider Relativity under its mathematical aspect, wishing to point out how arbitrary and irrational are its foundations. ...\n[\nThey state in the Preface\n]\nWe wish to shake Relativity in all its apparent foundations, and we have reason for hoping that we have succeeded in doing it.\n[\nThey conclude\n]\nHere then is our conclusion. Philosophy may be able to justify the space-time of Relativity, but mathematics, experimental science, and common sense can justify it NOT AT ALL.\nMarcolongo\nwrites in\n[\n25\n]\nthat their disagreement on the theory of relativity was:-\n... the only time that the peace and solidity of the 'vector binomial' seemed to be compromised ... . It was not possible for them to agree, first on the new range to be given to vector methods; then, even more deeply, on the essence of the whole theory. Despite the interest he felt for all the modern physical questions and above all for those of high and absorbing philosophical interest, he remained firmly obedient to the classical systems and in attack as in defence he could not remain calm and objective.\nKennedy writes in\n[\n4\n]\n(\nsee also\n[\n1\n]\n)\n:-\nMany of his publications were highly polemical, but in his family circle and among friends he was kind and gentle. He loved music, Bach and Beethoven being his favourite composers. He was a member of no academy. Always an independent thinker, he asked that he not be given a religious funeral.\nRoberto Marcolongo\n[\n25\n]\n, described Burali-Forti as:-\n... witty and terribly caustic! A really terrible polemist, a true noble fearless knight, he cared not where and against whom his blows were struck; so that those who had never come near him formed a strange, mistaken concept of his intractable personality. Yet I have never known a better soul, so exquisitely gentlemanly, a man of few words, but of refined conversation, witty and learned. It was enough to approach him to appreciate his culture, to see what an old-style gentleman he was. ...\nBurali-Forti died in Turin's Mauriziano Hospital suffering from stomach cancer. As we noted above, he requested that there should be no religious funeral service."
}