{
  "nome_completo": "Chaim Samuel Hönig",
  "nome_curto": "Chaim Samuel Hönig",
  "ano_nascimento": "1926",
  "ano_morte": "2018",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Honig/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "São Paulo, Brazil",
  "biografia": "Chaim Samuel Hönig\nwas the son of Moisés E Hönig and his wife Rachela. Moisés and Rachela were both from Jewish Polish families and they were married in Poland in the early\n1920\ns. They moved to Germany and were living in Berlin when their first child Chaim Samuel Hönig, the subject of this biography, was born in\n1926\n. Three years later, in\n1929\n, their second child, a daughter Eugenia Hönig, was born. Chaim began his schooling in Germany but he explained in a\n2003\ninterview that he did not excel in his studies at this time. The only subject which he did well in was mathematics and this was largely due to the influence of his father Moisés who was passionate about the subject. Moisés taught Chaim basic mathematics and encouraged him by setting challenging little problems for his son to solve.\nFor a Jewish boy studying in Germany at this time, life must have been extremely difficulty and this may well explain why Chaim only excelled in a subject he was taught by his father. On\n30\nJanuary\n1933\nHitler had come to power and on\n7\nApril\n1933\nclause three of the Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired, with exemptions for participants in World War I and pre-war officials. Not only did Jewish people fear that their children had no future in Germany, but they became increasingly frightened that they were not safe. The Hönig family decided to emigrate.\nOf course it was not simple for Jewish families to emigrate at this time since many countries did not open their borders to Jewish refugees. Returning to Poland, or to another country bordering Germany, already looked like a bad move to the Hönigs. They thought that South America provided their best option and in many ways they were fortunate. Countries like Brazil, and others, only allowed Jewish immigrants to come if they were joining a relative who was already living there. The Hönigs were fortunate in that Chaim's uncle, Don Leistner\n(1900\n-\n1955)\n, had been living in Porto Alegre, Rio Grande do Sul, Brazil, since the\n1920\ns so they decided to join him. They made the trip in\n1937\nand settled in Porto Alegre.\nChaim was eleven years old and his sister Eugenia was eight when the family arrived in Brazil. It proved relatively easy for young children to adapt to a different language and a different way of life. Within three months, Chaim and Eugenia were only speaking Portuguese to each other, although for a while they still needed to speak German with their parents who took longer to learn the language. Speaking about these times in an interview, Chaim said:-\n... this shows that, in adapting to a new language, the decisive factor is puberty. Foreigners who came before puberty had no problem, while those who came after puberty took three to four years to adapt.\nHönig began his schooling in Porto Alegre in\n1937\n, attending a Junior School until\n1939\n. In\n1939\nhe entered that Colégio Estadual Júlio de Castilhos in Porto Alegre. This excellent school had been founded in\n1900\nby João José Pereira Parobé as the Gymnasio do Rio Grande do Sul. Parobé was a founder and director of the Escola de Engenharia of Rio Grande do Sul and the school continued to keep strong links to the School of Engineering. In fact when Hönig began his studies there in\n1939\nthe school was named Instituto Júlio de Castilhos\n(\nnamed in honour of a Rio Grande do Sul politician\n)\nbut, halfway through his studies, its name became Colégio Estadual Júlio de Castilhos. Unlike his experience in the German school system, Hönig now showed himself a brilliant student in all his subjects. His mathematics teacher was very impressed and realised that Hönig was capable to being taught at a much higher level so he suggested that, while continuing to study at the school, he also attended mathematics lectures by Antônio Rodrigues\n(1918\n-\n2003)\nand Ary Nunes Tietbõhl\n(1912\n-\n1998)\nat the Faculty of Education, Sciences and Letters of Porto Alegre\n[\n1\n]\n:-\nAccording to Professor Chaim, attending these courses was fundamental to his career. After all, although he had had an interest in Mathematics since he was a child, he was unaware of the existence of institutions in which it was possible to study Mathematics exclusively. In addition, the two aforementioned professors had graduated from the Faculdade de Filosofia, Ciências e Letras of the University of São Paulo and, therefore, were already teaching courses along the lines of that institution. It was through them that Chaim learned about the existence of the undergraduate course in Mathematics at the Faculdade de Filosofia, Ciências e Letras of the University of São Paulo.\nHönig was advised by the two professors who told him that if he wanted to study mathematics in Brazil, the best place was at the Faculdade de Filosofia, Ciências e Letras of the University of São Paulo. This decision, however, did not find favour with his parents. It was certainly understandable that seeing their son ranked as the best student at the Colégio Estadual Júlio de Castilhos with a brilliant engineering career in front of him, they would find his wishes to study mathematics at São Paulo as near stupidity. When he passed the oral entrance examinations in Portuguese, Mathematics, Physics and Chemistry for the Faculdade de Filosofia, Ciências e Letras of the University of São Paulo in\n1946\n, Hönig's parents relented and agreed to fund their son for a year at São Paulo. They may have thought that after a year he would \"see sense\" and change to engineering but this was not the case. His performance in the first year was so good that he received scholarships to support him for the remainder of his undergraduate studies and he did not require any further financial support from his parents.\nIn\n1939\nOmar Catunda\nhad been appointed, on an interim basis, as professor responsible for the chair of Mathematical and Higher Analysis in the Department of Mathematics at the University of São Paulo. In\n1945\nElza Gomide\nwas appointed as\nCatunda\n's assistant and in the same year\nAndré Weil\nwas appointed to the chair which\nCatunda\nhad filled on a temporary basis.\nCândido Lima da Silva Dias\n, who had himself been a student in the Department, was by this time a professor with\nLuiz Henrique Jacy Monteiro\nas his assistant.\nJean Dieudonné\nwas appointed professor of mathematics at São Paulo for\n1946\n-\n47\n. In addition,\nJean Delsarte\nspent four summer months as Professor at the University of São Paulo in each of the years\n1948\n,\n1949\n,\n1950\n,\n1951\n. It was indeed an excellent Department containing leading international mathematicians that provided Hönig with an inspiring environment in which to study. He was awarded a Bachelor's Degree in Physics and in Mathematics in\n1948\nand, in\n1949\n, he graduated with a Licentiate in Mathematics.\nEdison Farah\n(1915\n-\n2006)\nhad studied mathematics at São Paulo and had graduated in\n1941\n. He was appointed as\nCatunda\n's assistant for Higher Analysis in\n1944\nand then\nAndré Weil\n's assistant for the same topic in the following year. When\nAndré Weil\nleft São Paulo, Farah took over the teaching of Higher Analysis. He was awarded a Ph.D. in\n1950\nfor his thesis entitled \"Sôbre a medida de Lebesgue.\" In\n1951\n, Hönig was appointed as Farah's assistant in Higher Analysis, becoming in charge of the exercise classes. Hönig had become a Brazilian citizen in\n1950\n, something which was necessary before he could be appointed to an academic position. His appointment as Farah's assistant had been made on the recommendations of\nOmar Catunda\nand\nCândido Lima da Silva Dias\n. Hönig had been undertaking research for his doctorate from the time he graduated with a Licentiate in Mathematics, officially advised by Edison Farah although in practice he received most help from\nLeopoldo Nachbin\n.\nHönig submitted his\n44\n-page thesis\nSôbre um método de refinamento de topologias\nⓉ\n(\nOn a topology refinement method\n)\nand was awarded his doctorate in\n1952\n. The examining committee consisting of Edison Farah\n(\nchairman\n)\n,\nOmar Catunda\n,\nCândido Lima da Silva Dias\n,\nLeopoldo Nachbin\nand\nCharles Ehresmann\napproved the degree \"with distinction.\" He had already had two papers in print, namely\nClassification of the additive groups of rational numbers\n(\nPortuguese\n)\n(1948)\nand\nOn a method of refinement of topologies\n(\nPortuguese\n)\n(1951)\n. The\n1951\npaper is, in fact, Hönig's Ph.D. thesis in which he constructs examples of curious topological spaces. His methods reproduced much of the theory of semi-regular spaces expounded by\nMarshall Harvey Stone\n.\nCândido Lima da Silva Dias\nsuggested that, because the teaching and research at São Paulo had been heavily influenced by members of\nBourbaki\n, Hönig would benefit from postdoctoral studies in Paris. With financial support from both the Brazilian National Council for Scientific and Technological Development and from the French Centre national de la recherche scientifique, Hönig was a postdoctoral fellow at the\nHenri Poincaré\nInstitute in France from\n1953\nto\n1955\n. During this period he studied with world-leading mathematicians such as Marc Krasner,\nLaurent Schwartz\n,\nAlexander Grothendieck\n,\nJean-Louis Koszul\n,\nHenri Cartan\nand\nAndré Lichnerowicz\n. Returning to São Paulo, he again took up his duties as an assistant of Edison Farah. In\n1955\nhe was elected as an associate member of the\nBrazilian Academy of Sciences\n. He would become a full member in\n1968\n.\nIn\n1957\nthe series of Brazilian Mathematics Colloquia was begun by Hönig. He was the organiser of the First Brazilian Mathematics Colloquium from\n1\nJuly to\n20\nJuly\n1957\n. He also delivered one of the main lecture courses on\nÁlgebra Multilinear e Variedades Diferenciáveis\nⓉ\n(\nMultilinear algebra and differentiable manifolds\n)\n. At the Second Brazilian Mathematics Colloquium held from\n5\nJuly to\n18\nJuly\n1959\nhe was a member of the organising committee and also gave the course\nClassificação dos A-Módulos do Corpo de Frações de um Anel de Dedekind\nⓉ\n(\nClassification of fractional body A-Modules of a Dedekind ring.\n)\n. He also gave a lecture on the Development of Mathematics in Brazil where he set out the need for planning the best use of existing research centres, the need to attract talented young people into a scientific career, and the need to increase exchanges between Brazilian and foreign researchers. At the Third Brazilian Mathematics Colloquium held from\n2\nJuly to\n15\nJuly\n1961\n, he delivered the six lecture course\nAplicações da Topologia à Análise\nⓉ\n(\nApplications of topology to analysis.\n)\n. Also at this meeting he set up an exhibition on teaching mathematics in Brazilian high schools. By the time of the Sixth Brazilian Mathematics Colloquium held from\n2\nJuly to\n22\nJuly\n1967\nthere had been a change in format and Hönig delivered the Improvement course\nIntrodução às Funções de uma Variável Complexa\nⓉ\n(\nIntroduction to functions of a complex variable.\n)\n. At the Eighth Brazilian Mathematics Colloquium held from\n5\nJuly to\n23\nJuly\n1971\nhe delivered one of the four standard courses, namely\nAnálise Funcional e o Problema de Sturm-Liouville\nⓉ\n(\nFunctional analysis and the Sturm-Liouville problem\n)\n. We note that he published this course as a\n178\n-page book in\n1971\n.\nMore information about the Brazilian Mathematics Colloquium  is given at\nTHIS LINK\n.\nThe Instituto Nacional de Matemática Pura e Aplicada\n(\nIMPA\n)\nwas founded in Rio de Janeiro in\n1952\n. In\n1959\n,\nLeopoldo Nachbin\ninvited Hönig to work simultaneously at the IMPA and at the Mathematics Department in São Paulo. In the early\n1960\ns Hönig was told that he was no longer required as an assistant in Higher Analysis. Immediately he was offered the position of assistant to\nMário Schenberg\n, the professor of Rational Mechanics and Celestial Mechanics. Hönig spent the years from\n1961\nto\n1964\n, working as a visiting professor at the Faculté des Sciences in Rennes, France. He returned to Brazil in March\n1964\n, only days before a military dictatorship was established in Brazil following a military coup. He later said that, had he still been in France at the time of the military coup, he may never have returned to Brazil. Although some academics were repressed, according to Hönig, mathematicians were relatively unaffected\n(\nsee\n[\n1\n]\n)\n:-\n... there were people who tried to use the military period, spread rumours, that they were going to catch that one and that they were going to hunt this one, but at the Instituto Militar de Engenharia, as far as I know, none of this took place. ... The most targeted areas were the human sciences, social sciences, then these things were more important .. But in Mathematics this did not happen ...\nIn\n1969\nthe\nBrazilian Mathematical Society\nwas founded during the Seventh Brazilian Mathematics Colloquium. Hönig was leading the move to establish the Society and he was elected as the first President. The Society began publishing a\nBulletin\nin\n1970\nand Hönig wrote the Introduction to the first part of the first volume. We present an English translation of his Introduction at\nTHIS LINK\n.\nHe published both textbooks aimed at undergraduates or postgraduates and research monographs. For example:\nAplicações da topologia à análise\nⓉ\n(\nApplications from topology to analysis\n)\n(1961)\n;\nAnálise de Fourier em espaços\nL\n2\nL_{2}\nL\n2\n​\ne teoremas do tipo de Sobolev\nⓉ\n(\nFourier analysis on L\n2\nspaces and Sobolev type theorems\n)\n(1965)\n;\nAnálise functional e aplicações\nⓉ\n(\nFunctional analysis and applications\n)\n. Vols. I, II\n(1970)\n;\nIntrodução às funções de uma variável complexa\nⓉ\n(\nIntroduction to functions of a complex variable\n)\n(1971)\n;\nAnálise funcional e o problema de Sturm-Liouville\nⓉ\n(\nFunctional analysis and the Sturm-Liouville problem\n)\n(1971)\n;\nThe abstract Riemann-Stieltjes integral and its applications to linear differential equation with generalized boundary conditions\n(1973)\n; and\nVolterra Stieltjes-integral equations\n(1975)\n. For more information about some of these books, see\nTHIS LINK\n.\nThe\n1965\npublication\nAnálise de Fourier em espaços\nL\n2\nL_{2}\nL\n2\n​\ne teoremas do tipo de Sobolev\nⓉ\n(\nFourier analysis in spaces L\n2\nand Sobolev type theorems\n)\nwas Hönig's thesis which he submitted in his application to became a full professor at the Faculty of Philosophy, Sciences and Letters. In\n1973\n, he was approved in a competition for a Full Professorship at the Institute of Mathematics and Statistics at the University of São Paulo. He continued in this chair until he reached the age of\n70\nin\n1996\nwhen he was required to retire.\nHönig made many contributions to supporting the development of the mathematical sciences in Brazil\n[\n6\n]\n:-\nIn the late\n1960\ns and early\n1970\ns, Hönig was part of the organising commission for important scientific events in the field of Mathematical Analysis, among them the three Quinzenas de Análise Funcional\n[\nFunctional Analysis and Differential Equations Fortnights\n]\nheld at the Instituto Tecnológico de Aeronáutica\n(\nAeronautics Institute of Technology\n)\n, in\n1967\n,\n1969\nand\n1970\n, and the I Escola Latino-Americana de Matemática\n[\nLatin American School of Mathematics\n]\n, held in Rio de Janeiro in\n1968\n. A founding partner in\n1969\nof the Sociedade Brasileira de Matemática\n(\nBrazilian Mathematical Society\n)\n, Hönig was its first president, from\n1969\nto\n1971\n, as well as one of the founders in\n1974\nof the Academia de Ciências do Estado de São Paulo\n[\nSão Paulo State Academy of Sciences\n]\n. ... Hönig also acted as coordinator of the Mathematics Advisory Board of the Coordenação de Aperfeiçoamento de Pessoal de Nível Superior - CAPES\n(\nCoordination for the Improvement of Higher Educational Personnel\n)\n, of the Conselho Nacional de Desenvolvimento Científico e Tecnológico - CNPq\n(\nNational Council for Scientific and Technological Development\n)\nand Fundação de Amparo e Pesquisa do Estado de São Paulo - FAPESP\n(\nSão Paulo Research Foundation\n)\n.\nIn\n1998\nhe was honoured with the award of the National Order of Scientific Merit.\nHönig's death notice from the Universidade Federal do ABC states\n[\n7\n]\n:-\nIt is with regret that we inform you of the death of Professor Chaim Samuel Hönig, a pioneer in Mathematics in Brazil and who played an important role in structuring the mathematical community. We are especially grateful to Professor Chaim for his immense generosity in donating his personal collection to our library. Burial will be on\n23\nMarch\n2018\nat\n1\n:\n30\npm at the Embu das Artes Israeli Cemetery, Keishi Matsumoto Road\n7\n. The wake begins at\n12\n:\n30\npm."
}