{
  "nome_completo": "Charles Augustin de Coulomb",
  "nome_curto": "Charles Augustin Coulomb",
  "ano_nascimento": "1736",
  "ano_morte": "1806",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coulomb/",
  "lugar_nascimento": "Angoulême, France",
  "lugar_morte": "Paris, France",
  "biografia": "Charles Augustin Coulomb\n's father was Henry Coulomb and his mother was Catherine Bajet. Both his parents came from families which were well known in their fields. His father's family were important in the legal profession and in the administration of the Languedoc region of France, and his mother's family were also quite wealthy. After being brought up in Angoulême, the capital of Angoumois in southwestern France, Coulomb's family moved to Paris. In Paris he entered the Collège Mazarin, where he received a good classical grounding in language, literature, and philosophy, and he received the best available teaching in mathematics, astronomy, chemistry and botany.\nAt this stage in his education there was a crisis for Coulomb. Despite his father's good standing, he had made unsuccessful financial speculations, had lost all his money and moved from Paris to Montpellier. Coulomb's mother remained in Paris but Coulomb had a disagreement with her over the direction his career should take so he left Paris and went to Montpellier to live with his father. At this stage Coulomb's interests were mainly in mathematics and astronomy and while in Montpellier he joined the Society of Sciences there in March\n1757\nand read several papers on these topics to the Society.\nCoulomb wanted to enter the École du Génie at Mézières but realised that to succeed in passing the entrance examinations he needed to be tutored. In October\n1758\nhe went to Paris to receive the tutoring necessary to take the examinations.\nCamus\nhad been appointed as examiner for artillery schools in\n1755\nand it was his\nCours de mathématiques\nⓉ\n(\nA course of mathematics\n)\nthat Coulomb studied for several months. In\n1758\nCoulomb took the examinations set by\nCamus\nwhich he passed and he entered the École du Génie at Mézières in February\n1760\n. He formed a number of important friendships around this time which were important in his later scientific work, one with\nBossut\nwho was his teacher at Mézières and the other with\nBorda\n.\nCoulomb graduated in November\n1761\n. He was now a trained engineer with the rank of lieutenant in the Corps du Génie. Over the next twenty years he was posted to a variety of different places where he was involved in engineering, in structural design, fortifications, soil mechanics, and many other areas. His first posting was to Brest but in February\n1764\nhe was set to Martinique in the West Indies. Martinique fell under the sovereignty of France under Louis XIV in\n1658\n. However Martinique was attacked by a number of foreign fleets over the following years. The Dutch attacked it in\n1674\nbut were driven off, as were the English in\n1693\nand the English again in\n1759\n. Martinique was finally captured by the English in\n1762\nbut were returned to France under the terms of the Treaty of Paris in\n1763\n. The French then made attempts to make the island more secure by building a new fort.\nCoulomb was put in charge of the building of the new Fort Bourbon and this task occupied him until June\n1772\n. It was a period during which he showed the practical side of his engineering skills which were needed to organise the construction, but his experiences would play a major role in the later theoretical memoirs he wrote on mechanics. As far as Coulomb's health was concerned these were difficult years and the illnesses which he suffered while on Martinique left him in poor health for the rest of his life.\nOn his return to France, Coulomb was sent to Bouchain. However, he now began to write important works on applied mechanics and he presented his first work to the\nAcadémie des Sciences\nin Paris in\n1773\n. This work,\nSur une application des règles, de maximis et minimis à quelque problèmes de statique, relatifs à l'architecture\nⓉ\n(\nOn an application of the rules of maxima and minima to some problems in statics  related to architecture\n)\nwas written\n(\nin Coulomb's words, see for example\n[\n1\n]\n)\n:-\n... to determine, as far as a combination of mathematics and physics will permit, the influence of friction and cohesion in some problems of statics.\nPerhaps the most significant fact about this memoir from a mathematical point of view is Coulomb's use of the calculus of variations to solve engineering problems. As Gillmor writes in\n[\n1\n]\n:-\nIn this one memoir of\n1773\nthere is almost an embarrassment of riches, for Coulomb proceeded to discuss the theory of comprehensive rupture of masonry piers, the design of vaulted arches, and the theory of earth pressure. In the latter he developed a generalised sliding wedge theory of soil mechanics that remains in use today in basic engineering practice. A reason, perhaps, for the relative neglect of this portion of Coulomb's work was that he sought to demonstrate the use of variational calculus in formulating methods of approach to fundamental problems in structural mechanics rather than to give numerical solutions to specific problems.\nIt is often the case that a sophisticated use of mathematics in an application to an area where most have less mathematical sophistication, gives the work a long term values which is not often seen at the time. The memoir was certainly highly valued by the\nAcadémie des Sciences\nfor it led to him being named as\nBossut\n's correspondent on\n6\nJuly\n1774\n. From Bouchain, Coulomb was next posted to Cherbourg. While he was there he wrote a famous memoir on the magnetic compass which he submitted for the Grand Prix of the\nAcadémie des Sciences\nin\n1777\n.\nThis\n1777\npaper won Coulomb a share of the prize and it contained his first work on the torsion balance\n[\n1\n]\n:-\n... his simple, elegant solution to the problem of torsion in cylinders and his use of the torsion balance in physical applications were important to numerous physicists in succeeding years. ... Coulomb developed a theory of torsion in thin silk and hair threads. Here he was the first to show how the torsion suspension could provide physicists with a method of accurately measuring extremely small forces.\nAnother interesting episode occurred during the time which Coulomb spent at Cherbourg. Robert-Jacques Turgot was appointed comptroller general by Louis XVI on\n24\nAugust\n1774\n. He began to feel threatened by his political opponents in\n1775\nand began a series of reforms. Among these was the reform of the Corps du Génie and Turgot called for memoirs on its possible reorganisation. Coulomb submitted a memoir giving his ideas and it is a fascinating opportunity to understand his political views. Coulomb wanted the state and the individual to play equal roles. He proposed that the Corps du Génie in particular, and all public service in general, should recognise the talents of its individual members in promotion within the organisation.\nIn\n1779\nCoulomb was sent to Rochefort to collaborate with the Marquis de Montalembert in constructing a fort made entirely from wood near Ile d'Aix. Like Coulomb, the Marquis de Montalembert had a reputation as a military engineer designing fortifications, but his innovative work had been criticised by many French engineers\n[\n2\n]\n:-\nViewing fortresses as nothing more than immense permanent batteries designed to pour overwhelming fire on attacking armies, Montalembert simplified the intricate geometric designs of Vauban and relied on simple polygonal structures, often with detached peripheral forts instead of projecting bastions.\nDuring his time at Rochefort, Coulomb carried on his research into mechanics, in particular using the shipyards in Rochefort as laboratories for his experiments. His studies into friction in Rochefort led to Coulomb's major work on friction\nThéorie des machines simples\nⓉ\n(\nTheory of simple machines\n)\nwhich won him the Grand Prix from the\nAcadémie des Sciences\nin\n1781\n. In this memoir Coulomb\n[\n1\n]\n:-\n... investigated both static and dynamic friction of sliding surfaces and friction in bending of cords and in rolling. From examination of many physical parameters, he developed a series of two-term equations, the first term a constant and the second term varying with time, normal force, velocity, or other parameters.\nBecause of this prize winning work, the authors of\n[\n5\n]\nwrite:-\nCoulomb's contributions to the science of friction were exceptionally great. Without exaggeration, one can say that he created this science.\nIn fact this\n1781\nmemoir changed Coulomb's life. He was elected to the mechanics section of the\nAcadémie des Sciences\nas a result of this work, and he moved to Paris where he now held a permanent post. He never again took on any engineering projects, although he did remain as a consultant on engineering matters, and he devoted his life from this point on to physics rather than engineering. He wrote seven important treatises on electricity and magnetism which he submitted to the\nAcadémie des Sciences\nbetween\n1785\nand\n1791\n. These seven papers are discussed in\n[\n6\n]\nwhere the author shows that Coulomb:-\n... had obtained some remarkable results by using the torsion balance method: law of attraction and repulsion, the electric point charges, magnetic poles, distribution of electricity on the surface of charged bodies and others. The importance of Coulomb's law for the development of electromagnetism is examined and discussed.\nIn these he developed a theory of attraction and repulsion between bodies of the same and opposite electrical charge. He demonstrated an inverse square law for such forces and went on to examine perfect conductors and dielectrics. He suggested that there was no perfect dielectric, proposing that every substance has a limit above which it will conduct electricity. These fundamental papers put forward the case for action at a distance between electrical charges in a similar way as\nNewton\n's theory of gravitation was based on action at a distance between masses.\nThese papers on electricity and magnetism, although the most important of Coulomb's work over this period, were only a small part of the work he undertook. He presented twenty-five memoirs to the\nAcadémie des Sciences\nbetween\n1781\nand\n1806\n. Coulomb worked closely with\nBossut\n,\nBorda\n,\nde Prony\n, and\nLaplace\nover this period. Remarkably he participated in the work of\n310\ncommittees of the Academy. He still was involved with engineering projects as a consultant, the most dramatic of which was his report on canal and harbour improvements in Brittany in\n1783\n-\n84\n. He had been pressed into this task against his better judgement and he ended up taking the blame when criticisms were made and he spent a week in prison in November\n1783\n.\nHe also undertook services for the respective French governments in such varied fields as education and reform of hospitals. In\n1787\nhe made a trip to England to report on the conditions in the hospitals of London. In July\n1784\nhe was appointed to look after the royal fountains and took charge of a large part of the water supply of Paris. On\n26\nFebruary\n1790\nCoulomb's first son was born, although he was not married to Louise Françoise LeProust Desormeaux who was the mother of his son.\nWhen the French Revolution began in\n1789\nCoulomb had been deeply involved with his scientific work. Many institutions were reorganised, not all to Coulomb's liking, and he retired from the Corps du Génie in\n1791\n. At about the same time that the\nAcadémie des Sciences\nwas abolished in August\n1783\n, he was removed from his role in charge of the water supply and, in December\n1793\n, the weights and measures committee on which he was serving was also disbanded. Coulomb and\nBorda\nretired to the country to do scientific research in a house he owned near Blois.\nThe\nAcadémie des Sciences\nwas replaced by the Institut de France and Coulomb returned to Paris when he was elected to the Institute in December\n1795\n. On\n30\nJuly\n1797\nhis second son was born and, in\n1802\n, he married Louise Françoise LeProust Desormeaux, the mother of his two sons. We mentioned above that Coulomb was involved with services to education. These were largely between\n1802\nand\n1806\nwhen he was inspector general of public instruction and, in that role, he was mainly responsible for setting up the lycées across France.\nLet us end with quoting the tribute paid to him by\nBiot\nwho wrote:-\nIt is to\nBorda\nand to Coulomb that one owes the renaissance of true physics in France, not a verbose and hypothetical physics, but that ingenious and exact physics which observes and compares all with rigour."
}