{
  "nome_completo": "Charles Lutwidge Dodgson",
  "nome_curto": "Charles Lutwidge Dodgson",
  "ano_nascimento": "1832",
  "ano_morte": "1898",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dodgson/",
  "lugar_nascimento": "Daresbury, England",
  "lugar_morte": "Guilford, England",
  "biografia": "Charles Lutwidge Dodgson\nis better known by the pseudonym \"Lewis Carroll\". Although he was a mathematician, he is best known as the author of\nAlice's adventures in wonderland\n(1865)\nand\nThrough the looking glass\n(1872)\n, children's books that are among the most popular of all time. They are distinguished as satire and as examples of verbal wit. Dodgson wrote mathematical works under his own name but for his children's books he invented the pen name \"Lewis Carroll\" by translating his first two names \"Charles Lutwidge\" into Latin as \"Carolus Lodovicus\", then anglicising and reversing their order.\nCharles Lutwidge Dodgson's father was the Reverend Charles Dodgson. Charles Dodgson senior was born in\n1800\nand studied at the University of Oxford where he gained a First Class degree in both mathematics and classics. He was appointed as a mathematics lecturer at Oxford where he held a Fellowship but, on marrying his cousin Frances Jane Lutwidge in\n1827\n, he had to give up his Oxford Fellowship. He then became a curate at All Saints' Church in Daresbury and it was in that town that ten of Charles and Frances' eleven children were born.\nCharles Lutwidge was the eldest of his parents three boys, having two elder sisters Fanny, born in\n1828\n, and Elizabeth, born in\n1830\n. Charles was baptised on\n11\nJuly\n1832\nin his father's church and grew up in a strict Christian household. His early education, like that of his brothers and sisters, was provided by his parents. He read mostly religious books as a child and an indication of his rapid progress is that he had read\nPilgrim's Progress\nby the time he was seven. Charles looked up to his father and wished to be like him. Since mathematics was his father's favourite subject, it is easy to see how Charles gained an early love for it. Not only did Charles model himself on his father, but his father also wanted his son to follow in his footsteps by studying mathematics at Oxford, then obtaining a Fellowship, marrying and becoming a vicar.\nAt Daresbury the Dodgson family had to struggle financially, so it was a relief when Charles's father moved to become vicar at Croft-on-Tees in Yorkshire in\n1843\nwhere his income was substantially increased. At Croft the family lived in a large rectory with a wonderful garden but chose to live much more simply than they might have done. On\n1\nAugust\n1844\nCharles enter Richmond School as a boarder, living in the headmaster's house. The school was only ten miles from his home and so his parents were able to visit him just over a week after he arrived. They found that he was settling in well and indeed at this school he received an excellent foundation for his education, excelling in mathematics.\nOn\n27\nJanuary\n1846\n, Charles' fourteenth birthday, he enrolled at Rugby School. This was a famous school but one where Charles found things extremely difficult. A shy, sensitive boy with a stammer, he suffered bullying from the older boys and, as Clark writes\n[\n7\n]\n:-\nFrom every point of view life at Rugby was a personal disaster for young Dodgson.\nDespite being deeply unhappy, Dodgson achieved high standards in his school work, receiving a steady stream of prizes. Again mathematics was his favourite subject but he also excelled at divinity. A number of illnesses which he suffered from in\n1848\nhad a lasting effect. The first was whooping cough which he caught in the spring. He was left with a persistent cough which returned at various times throughout his life. In the autumn he contracted mumps and this left him somewhat deaf in his right ear, a problem which never improved. He wrote afterwards of his time at Rugby\n(\nsee for example\n[\n9\n]\n)\n:-\nDuring my stay I made I suppose some progress in learning of various kinds, but none of it was done with love, and I spent an incalculable time in writing out impositions - this last I consider one of the chief faults of Rugby School. I made some friends there ... but I cannot say that I look back upon my life at a Public School with any sensations of pleasure, or that any earthly considerations would induce me to go through my three years again.\nHe left Rugby in December\n1849\nand in the following May he travelled to the University of Oxford to make the necessary arrangements to begin his studies there.\nAs his father wished, Dodgson matriculated at Christ Church, Oxford, which had been his father's College. Things did not start very well for him, however, for there was a shortage of accommodation and he had to return to his parent's home in Croft and wait until accommodation could be arranged before starting his university studies. On\n24\nJanuary\n1851\nDodgson returned to Oxford to live with the Rev. Jacob Ley, a friend of his father. Two days later his mother died suddenly at the age of\n47\nand again he had to return to Croft. When he returned to Oxford he was filled with a determination to work hard so that he might win scholarships and become financially independent. He was able to mix social and cultural activities with hard work at mathematics and in November\n1851\nhe was awarded a Boulter Scholarship worth\n20\npounds a year. After receiving a Second Class in classics and a First Class in mathematics in December\n1852\nhe was awarded a Fellowship of\n25\npounds a year for life. This came with the right to live in Christ Church, but although there were no requirements to any further academic achievements, he was required to take Holy Orders and to remain unmarried.\nDodgson's father was absolutely delighted with his son's success and, moreover, he himself had been made Canon of Ripon Cathedral in\n1852\n, going on to become Archdeacon of Richmond two years later. This was the year when Dodgson completed his studies receiving a Third Class Degree in Classics but topping the list of those receiving First Class honours in mathematics by a good margin. The challenges ahead were now the senior scholarship competition and he knew that success in that would almost certainly lead to his appointment as a lecturer in mathematics. At this point, however, the usually conscientious Dodgson became too taken up with leisure and cultural activities and failed to put in the necessary work at mathematics. He did begin to take pupils, although not as an official university tutor, and this too must have taken much of his time. Disappointed with his own performance in the two scholarship examination papers on\n22\nMarch\n1855\n, and that on the morning of the following day, he gave up and did not turn up to sit the final paper on the afternoon of\n23\nMarch\n(\nonly two students did sit it\n)\n. Of course he did not receive the scholarship and wrote in his diary\n(\nsee for example\n[\n9\n]\n)\n:-\nIt is tantalizing to think how easily ... I might have got it, if I had only worked properly during this term, which I fear I must consider as wasted. However, I have now got a year before me, and with this past term as a lesson ... I mean to have read by next time, Integral Calculus, Optics\n(\nand theory of light\n)\n, Astronomy, and higher Dynamics. I record this resolution to shame myself with, in case March\n1856\nfinds me still unprepared, knowing how many similar failures there have been in my life already.\nHe still had a hectic schedule, coaching pupils, and he also had, since February\n1855\n, an official appointment as sub-librarian at Christ Church. In another scholarship examination he again failed to win an award but then took on coaching fourteen pupils for the Mathematical Examiner. This task\n(\nsee for example\n[\n9\n]\n)\n:-\n... will give me no official position as it is merely a private arrangement between ourselves: it is decidedly favourable to my getting the lectureship hereafter, though it by no means secures it.\nDuring the summer of\n1855\nDodgson taught at his father's school in Croft and by the time he returned to Oxford in October it was as a Mathematics Lecturer, the position that he had sought. It meant that he now did not need to take the scholarship examinations in March\n1856\nas he had planned. Dodgson remained at Christ Church, Oxford, lecturing on mathematics and writing treatises and guides for students until\n1881\n. Although he took deacon's orders in\n1861\n, Dodgson was never ordained a priest, partly because he was afflicted with a stammer that made preaching difficult and partly, perhaps, because he had discovered other interests such as the theatre. It seems likely, however, that as time went on he found it harder to accept the view that non-Christian were condemned and, as a man of great honesty, would therefore find the oaths he would be required to swear to become a priest unacceptable.\nAmong Dodgson's hobbies was photography, at which he became highly proficient. His interest began when visiting his uncle in\n1855\n, and at that time he took some photographs with his uncle's equipment. He purchased his own camera and developing chemicals in March\n1856\nand began to experiment with pictures of landscapes, architecture, sculptures and, most of all, of people. His family, friends and colleagues became the subjects of his photographs but he excelled especially at photographing children, which was his greatest pleasure. Alice Liddell, one of the three daughters of Henry George Liddell, the dean of Christ Church, was one of his photographic subjects and the model for the fictional Alice. Other subjects were the children of the writer George Macdonald and the sons of the poet Alfred, Lord Tennyson. Not only did Dodgson enjoy photographing children, but he also enjoyed their company. In\n1932\nAlice Liddell recalled how she and her sisters Lorina and Edith:-\n... used to sit on the big sofa on each side of him, while he told us stories, illustrating them by pencil or ink drawings as he went along ... He seemed to have an endless store of these fantastical tales, which he made up as he told them, drawing busily on a large sheet of paper all the time. They were not always entirely new. Sometimes they were new versions of old stories; sometimes they started on the old basis, but grew into new tales owing to the frequent interruptions which opened up fresh and undreamed-of possibilities.\nIt was in\n1862\nthat Dodgson wrote down the stories at Alice's request. Henry Kingsley, the author, visited the Liddells and happened to pick up Dodgson's stories. He made it very clear that Dodgson had to be persuaded to publish his writings. Three years later, after polishing them and adding some more material, Dodgson published his first \"Alice book\" as\nAlice's Adventures in Wonderland\n.\nAs a mathematician, Dodgson was rather conservative but certainly thorough and careful. He was the author of a fair number of mathematics books including:\nA syllabus of plane algebraical geometry\n(1860)\n,\nTwo Books of Euclid\n(1860)\n,\nThe Formulae of Plane Trigonometry\n(1861)\n,\nCondensation of Determinants\n(1866)\n,\nElementary Treatise on Determinants\n(1867)\n,\nExamples in Arithmetic\n(1874)\n,\nEuclid and his modern rivals\n(1879)\n,\nCuriosa Mathematica, Part I: A New Theory of Parallels\n(1888)\n, and\nCuriosa Mathematica, Part II: Pillow Problems thought out during Sleepless Nights\n(1893)\n. None of his mathematics books have proved of enduring importance except for\nEuclid and his modern rivals\n(1879)\nwhich is of historical interest. Dodgson wrote it to defend using\nEuclid\n's\nElements\nas a means of teaching geometry. The book is written in the form of a play in which the ghost of\nEuclid\nreturns to defend his book to modern geometers.\nEuclid\nsums up saying:-\nLet me carry with me the hope that I have convinced you of the importance, if not the necessity, of retaining my order and numbering, and my method of treating straight lines, angles, right angles, and\n(\nmost especially\n)\nparallels. Leave me these untouched, and I shall look on with great contentment while other changes are made ...\nIt is a serious work with well argued cases on all sides regarding the teaching of geometry. It contains much evidence of Dodgson's humour too as for example after the ghost of\nEuclid\nmakes his first appearance he leaves saying:-\n... that concludes our present interview; so we will meet again when you have reviewed my Modern Rivals one by one. If you had any slow music handy, I would vanish to it: as it is ...\n[\nVanishes without slow music\n]\nAlthough Dodgson argued here for retaining\nEuclid\n's way of treating parallels, in\nCuriosa Mathematica, Part I: A New Theory of Parallels\npublished nine years later, he presented his own ideas on dealing with the parallel axiom.\nAs a mathematical logician, he was interested in increasing understanding by treating it as a game. He published\nThe Game of Logic\nin\n1887\nand\nSymbolic Logic Part I\nin\n1896\n. In the latter work Dodgson presented a way of visually representing propositions in a diagram which is similar to Venn diagrams, developed by\nJohn Venn\nin\n1881\n, but Dodgson's pictures have certain advantages. However,\nVenn\ndiagrams are today much used and Dodgson's gameboard method is forgotten.\nSymbolic Logic Part I\ncontains the statement that:-\nI have a quantity of manuscript in hand for Parts II and III, and hope to be able - should life, and health, and opportunity, be granted to me - to publish them...\nIn fact between\n1959\nand\n1970\nportions of the missing parts were found by William Warren Bartley and published for the first time in\n1977\n. In the article\n[\n23\n]\nBartley claims that the previously unpublished material shows specific achievements which can be credited to Dodgson. These are:-\nBy\n1896\nDodgson had developed a mechanical test of validity for a large part of the logic of terms, an achievement usually credited to\nLeopold Löwenheim\n[\nin\n1915]\n.\nAs early as\n1894\nDodgson used truth tables for the solution of specific logic problems. The application of truth tables and matrices did not come into general use until\n1920\n.\nBy\n1896\nDodgson had developed the method of trees for determining some validity, which bears a resemblance to the trees frequently employed by contemporary logicians\n.\nOther recent work has again put Dodgson's mathematical contributions in a much more favourable light than it was previously seen. For example in\n[\n20\n]\nAbeles writes:-\nA discussion is given of three pamphlets on elections and committees by C L Dodgson\n(\nLewis Carroll\n)\nwritten between\n1873\nand\n1876\n. It is argued that Dodgson's work on cycles anticipates a stochastic model proposed by Thompson and Remage in\n1964\nand includes ideas that are basic to maximum likelihood estimation.\nIn\n[\n18\n]\nwe also have a very positive view of Dodgson's numerous contributions to the theory of elections, perhaps his most significant being\nParliamentary Elections\nand\nThe Principles of Parliamentary Representation\nboth written in\n1884\n:-\nDodgson's work present a complete and unified approach to the electoral reform issues which were being discussed at the time, but in doing so he developed and contributed ideas to game theory and apportionment which are well in advance of the\n1880\ns.\nFinally we should mention Dodgson's love of puzzles\n[\n9\n]\n:-\nHe was good at charades, he sang, he told stories. Soon enough, jokes, puzzles, games, questions-and-answers, tricks with numbers and with words, and mental exercises became for him a means of everyday amusement and for his family and friends source of fun and diversion. He also played traditional games - chess, croquet, billiards, cards - but his mind was not content with these, and he expanded, extended, and experimented with all forms and fashions, pushing traditional entertainments to their outer limits and inventing new ones. in the\n1870\ns he created a veritable cornucopia of conundrums and mental challenges, brilliant additions to the store of magic and game playing ... He was so creative and so productive that his games and diversions fill sizeable anthologies.\nThe book\n[\n14\n]\ncontains \"\n42\ndelightfully diverting mind-benders\", puzzles which Dodgson was working on at the time he died. His death was sudden. He contracted a cold in early January\n1898\nwhich at first seemed very minor but it developed into a chest problem and his doctor insisted he go to bed. His breathing became more and more difficult and he died at\n2\n.\n30\nin the afternoon of\n14\nJanuary.\nDodgson, writing as Lewis Carroll, contributed wonderful examples of nonsense verse the best known of which is 'Jabberwocky' from\nThrough the Looking-Glass\n. This begins:-\n'Twas brillig, and the slithy toves\nDid gyre and gimble in the wabe;\nAll mimsy were the borogoves,\nAnd the mome raths outgrabe.\nThe Hunting of the Snark\n, published by Dodgson\n(\nas Lewis Carroll in\n1876)\n, has been called:-\n... the longest and best sustained nonsense poem in the English language.\nSeveral words from his nonsense poems have entered standard English language usage. For example, the word 'chortle', a word that combines 'snort' and 'chuckle', appears in 'Jabberwocky'."
}