{
  "nome_completo": "Charlotte Angas Scott",
  "nome_curto": "Charlotte Angas Scott",
  "ano_nascimento": "1858",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Scott/",
  "lugar_nascimento": "Lincoln, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Charlotte Angas Scott\n's father, the Rev Caleb Scott\n(1831\n-\n1919)\n, was a Congregational Church minister and in\n1865\nhe became Principal of the Lancashire Independent College, Whallay Range, Manchester. This college trained nonconformist ministers. Caleb was born in Rothwell, Northampton on\n24\nMay\n1831\nand baptised on\n13\nNovember of the same year. He was the son of the Rev Walter Scott who was also a Congregational Church minister and a strong champion of the working classes. Charlotte's mother was Eliza Ann Exley\n(1837\n-\n1899)\nand she was born in Wakefield, York. Caleb and Eliza were married in York in\n1855\n. Charlotte was the second of her parents' seven children; Elsie Somerville Scott\n(\nborn\n1857)\n, Charlotte Angas Scott\n(\nthe subject of this biography, born\n1858)\n, Charles Herbert Scott\n(\nborn\n1860)\n, Mary Gertrude Scott\n(\nborn\n1862)\n, Walter Scott\n(\nborn\n1863)\n, Margaret Ethel Scott\n(\nborn\n1865)\n, and Maud Lilian Scott\n(\nborn\n1873\n, but only lived a few months\n)\n. We note at this point that the Rev Caleb Scott, B.A., LL. B., D.D., retired from the position of Principal of Lancashire College on\n19\nJune\n1902\n.\nThe fact that Charlotte was the daughter and granddaughter of Congregational Church ministers is highly relevant to the fact that she was able to become a leading mathematician. The Congregational Church supported women's rights at a time when few others did so. In fact there were only two secondary schools in England taking women pupils at this time and neither was anywhere near to where Charlotte lived. However, after he became Principal of the Lancashire Independent College, Caleb Scott could provide tutors for his daughter\n(\nwho was seven at the time\n)\nand it was from these tutors that Charlotte Scott was first introduced to mathematics.\nShe won a Goldsmith's Company Scholarship in\n1876\nto Hitchin College, Cambridge, soon to be renamed Girton College. This was not at this time an official college of the University of Cambridge but over the years its ties with the University became stronger. However, it was not until\n1948\nthat it become an official College of the University of Cambridge. This College, the first women's college in England, had been founded in\n1869\n, only a few years before Scott began her studies there. She was one of eleven students who began their studies in\n1876\n, the largest intake for that the young College up to that date. Life at the College was very basic\n[\n14\n]\n:-\nWhen retiring for study after an extremely simple 'tea' in the Common Room, they would pick up three things en route to their rooms ... two candles, a bucket of coals, and a chamber pot.\nFour years later, in\n1880\n, she was given special permission to sit the University of Cambridge Mathematical Tripos examinations and was placed eighth but, as a woman, she was not allowed to graduate and she was not awarded a degree. She was not even given the title of Eighth\nWrangler\nwhich a man with the same marks would have received. In fact she was not allowed to be present at the graduation ceremony and her name was not included in the list which was read out. However, male students made their feelings of injustice at this situation well known. Kenschaft, writing in\n[\n14\n]\n, quotes a report of the graduation ceremony in\n1880\n:-\nThe man read out the names and when he came to 'eighth', before he could say the name, all the undergraduates called out 'Scott of Girton', and cheered tremendously, shouting her name over and over again with tremendous cheers and raising of hats.\nThe ladies of Girton College certainly marked the occasion with much celebration. One of the students present described the events\n(\nsee for example\n[\n12\n]\n)\n:-\nAt dinner we clapped and cheered her. ... Then we told her there would be College Songs in Hall at\n9\n. She was led in by Miss Welsh up an avenue of students to the top of the hall, while 'See the conquering hero comes' was played on the piano and sung by us all. At the top Miss Herschel was standing on a sort of dais, and when we had finished singing she recited an ode to Miss Scott, composed by Miss Welsh for the occasion, and then crowned her with laurels, while we clapped and applauded with all our might.\nIt wasn't only the ladies of Girton who celebrated Scott's success and saw the injustice of the situation. The radical weekly paper\nPunch\n, founded in\n1841\nand very influential in the second half of the\n19\nth\ncentury, carried an article in February\n1880\ncongratulating Miss Scott on being bracketed eighth Wrangler and Lady Butler being elected to the Royal Academy:-\nAt last Punch may say, and with pride he says it, the Ladies are looking up - looking up to the high places of Science and Art, which should never have been held beyond their reach, and which will be graced by their occupancy. But when the Academy doors are reopened to Ladies, let them be opened to their full width. Let us not hear of any petty restrictions or exclusions from this or that function or privilege ...\nA petition was circulated asking the University of Cambridge to allow women to take the university examinations as a right and give them the right to graduate. It was signed by over\n8000\npeople in three months. In fact Scott's achievement in the Mathematical Tripos had a significant effect on women's education at Cambridge for in the year after she graduated, women were officially allowed to study the Mathematical Tripos. It was, however, only a partial victory since women were still not allowed to graduate with a degree. This did not happen at Cambridge for many years after Scott's time and it was as late as\n1948\nbefore women could be awarded a Cambridge degree.\nScott continued research at Girton on algebraic geometry under\nArthur Cayley\n's supervision. She writes\n[\n26\n]\n:-\nMy own acquaintance with Professor\nCayley\ndates back to\n1880\n, the first of the four years in which I attended his lectures. His subjects in the different years were Modern Algebra, the Abelian Functions, the Theory of Numbers, the Theory of Substitutions, the Theory of Seminvariants. To my great regret I never had the opportunity of hearing him lecture on Geometry. His lectures differed strikingly from his memoirs in that the subject was presented in less synthetic style. It was a recognized fact that he lectured on what he himself was working out at the time, and consequently his class was privileged to obtain some insight into the workings of his mind.\nHowever, since she had no degree she decided to take an external University of London degree which was open to women. She was awarded her B.Sc. with First Class honours in Mathematics in\n1882\nand received her doctorate in\n1885\n. She had been appointed as a lecturer in mathematics at Girton College in\n1880\nand held this position until\n1884\n. Scott became only one of three members of the academic staff at Girton. She also gave lectures at Newnham College from\n1880\nto\n1883\n.\nIn the year\n1885\nBryn Mawr College in Pennsylvania, United States, opened. The College was founded by Joseph Taylor, a Quaker, and it was set up with Quaker beliefs although it operated as a nondenominational college. It was the first higher education institution in the United States offering graduate training for women. On Cayley's recommendation, Scott was appointed there and became the first head of the Bryn Mawr mathematics department. In fact, when the university opened in\n1885\n, Scott was the only mathematician among the eight members of the academic staff\n[\n9\n]\n:-\nShe was an exceptionally capable and gifted teacher, and although she had little time for the lazy she did her utmost to help less able students who worked hard. Her sense of moral responsibility was a strong one, and not to be subordinated the administrative convenience. In cases of hardship or handicap she spared no effort to provide whatever assistance she could. There are records of her setting out her opinion over no less than seven pages on behalf of a student who had been dismissed because of a crippling illness: she argued that it was nothing short of cruel to deprive the girl of the possibility of intellectual work when she was already limited in other activities. Despite an initial agreement that her lecturing responsibilities would be decreased as other commitments became greater, her load of ten to eleven hours a week remained unchanged over thirty years. In her lectures to advanced students Scott brought a sense of elegance and excitement; she gave them a sense of mathematical style.\nTo get some idea of Scott's ideas on teaching see\nTHIS LINK\n.\nScott urged those teaching in other Colleges in the United States to set up a joint examination board for secondary school students. As the result of her initiative, the College Board was set up in\n1901\nand Scott acted as the chief mathematics examiner in\n1902\nand\n1903\n.\nAt Bryn Mawr, Scott supervised the theses of seven Ph.D. students:\nRuth Gentry\n(1894)\n,\nAda Isabel Maddison\n(1896)\n, Virginia Ragsdale\n(1906)\n, Louise D Cummings\n(1914)\n, Mary Gertrude Haseman\n(1917)\n, Bird M Turner\n(1920)\n, and\nMarguerite Lehr\n(1925)\n. Scott set up the Bryn Mawr College Mathematics Journal Club which was designed to provide a meeting place for Ph.D. students, recent graduates and members of staff where they would lecture on their recent mathematical research or on mathematical papers they had been reading and found to be important.\nIn\n1894\nScott published an important textbook\nAn Introductory Account of Certain Modern Ideas and Methods in Plane Analytical Geometry\n.\nFrancis Macaulay\nexplains the level and content of the book in\n[\n23\n]\n:-\nIt aimed at explaining the fundamental ideas of Geometry, including all the most important and most recent. Though essentially only introductory, the book still maintains its place, and is as fresh and readable as when it was written. The trend of the book may be gathered from the title of its first chapter, \"Point and line coordinates\", which plunges straight into the heart of matters from the start. Among the topics placed in the forefront, besides the principle of duality, are point and line singularities, transformation of singularities and of curves, with a full account of linear transformation and of projection in three-dimensional space, theory of\n(1\n,\n1)\ncorrespondence, transition from metric to projective properties by way of the Absolute, and invariants and covariants with their related variants.\nFor reviews of this book, and later editions, see\nTHIS LINK\n.\nIn\n1899\nshe became an editor of the\nAmerican Journal of Mathematics\nand continued an impressive publication record. See\nTHIS LINK\n.\nThe introduction to four of these papers is given at\nTHIS LINK\n.\nFrancis Macaulay\ngives a detailed analysis of some of these papers in\n[\n23\n]\n. We give his overview:-\nMiss Scott was a geometer who whenever possible brought to analytical geometry the full resources of pure geometrical reasoning. She was also an enthusiastic searcher and propounder of new ideas and an interpreter of the work of others, adding simplifications and extensions of her own. ... Her rank as a writer was of the highest and all of her writing was singularly clear and attractive. Her inherited literary powers added much to the distinction and influence of her work.\nIn\n1891\n, six years after she took up the post at Bryn Mawr, Scott became active in the\nNew York Mathematical Society\nwhich had been founded in\n1888\n. She was, therefore, a founder member of the\nAmerican Mathematical Society\nwhen the\nNew York Mathematical Society\nwas renamed in\n1894\n. She also served on the first Council of the\nAmerican Mathematical Society\nin\n1894\nand was again a council member in\n1895\n-\n97\nand\n1899\n-\n1901\n. She served as the Society's vice-president in\n1905\n-\n06\n, the first woman to hold this post.\nSee\nTHIS LINK\n.\nScott's health began to deteriorate from\n1904\nwhen she suffered a bad bout of rheumatoid arthritis. Her hearing, which had been poor even when she was teaching at Girton, steadily became worse which caused her much frustration. However, her lecturing skills seemed unaffected even when she became almost totally deaf. Of course, if students asked questions she was unable to hear them and so had a graduate student with her to answer difficulties the students might be experiencing.\nFormer students of the Department of Mathematics of Bryn Mawr College organised a mathematical meeting in Taylor Hall on Tuesday,\n18\nApril\n1922\n, to honour Scott on the completion of her thirty-seventh year as head of the Department of Mathematics in Bryn Mawr College. The welcome address was given by the President Martha Carey Thomas, and the introductory address was by Marion Reilly\n(1879\n-\n1928)\n, an educator and philanthropist who, after obtaining her A.B. from Bryn Mawr in\n1901\nhad carried out advanced studies in mathematics and physics at Bryn Mawr\n(1901\n-\n1906)\n. The main speaker at the meeting was\nAlfred North Whitehead\nwho gave the lecture 'Relativity and Gravitation. Group Tensors and Their Application to the Formulation of Physical Laws'.\nAlfred North Whitehead\n, speaking of Scott's achievements, said:-\nA friendship of peoples is the outcome of personal relations. A life's work such as that of Professor Charlotte Angas Scott is worth more to the world than many anxious efforts of diplomatists. She is a great example of the universal brotherhood of civilisations.\nShe retired from teaching in\n1924\nand, after spending one further year at Bryn Mawr, during which time she completed the supervision of her final doctoral student, she returned to England. After her return to Cambridge in\n1925\n, Scott's hearing prevented her taking much part in life at the University. A young member of Scott's family wrote these words about her in\n[\n1\n]\n:-\nAunt Charlie, as she was known to her nephews and nieces, was always accessible and only too pleased to chat with us on matters great and small. She had a tremendous sense of humour, and a twinkle was never far from her eyes. Recently, on telling her of our decision to take a small flat while on leave, despite the kind offer to put us up, she remarked, \"I always say I would rather mismanage my own house than be well managed in someone else's!\". She was a clever and witty speaker, and would often say she loved words; indeed she was never at a loss for words out of the common, and an increasing deafness made her find talking easier than listening. She out-lived most of her family of the same generation, but with admirable courage, after\n30\nyears in America, settled down in Cambridge for the few years left to her.\nAs to hobbies, she played lawn tennis and introduced the game for women when at Girton. She took up golf when at Bryn Mawr and became quite good at the game. We must see these sporting interests as being highly unusual for a woman in the\n19\nth\ncentury and again she was making an important move for women. Another of her interests was gardening and, like so many of the things that Scott did, she took it very seriously. As well as having a beautiful garden, she even won an award for a new variety of chrysanthemum she developed.\nFinally, let us note that Scott never seemed to find life in America particularly happy. She lived in an apartment on the campus at Bryn Mawr for her first years in the United States, the only academic to do so. However, she seems to have been disappointed that Martha Carey Thomas did not encourage informal contact. Carey Thomas was the dean of the faculty from\n1885\nto\n1894\nwhen she became the second president of Bryn Mawr. In\n1897\nScott bought a house of her own and arranged for a cousin to come from England to act as her housekeeper. Her father made a number of visits to the United States during which times he would visit his daughter. In fact he was on his way back to England after such a visit in\n1899\nwhen his wife, who had remained in England, died. Having never really made a social life for herself in the United States, Scott left returned to England as soon as she felt she had completed her duties after retirement and bought a home in Cambridge where she lived out the last few years of her life."
}