{
  "nome_completo": "Charles Étienne Louis Camus",
  "nome_curto": "Charles-Étienne Camus",
  "ano_nascimento": "1699",
  "ano_morte": "1768",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Camus/",
  "lugar_nascimento": "Crécy-en-Brie (near Paris), France",
  "lugar_morte": "Paris, France",
  "biografia": "Charles-Étienne Camus\n's father, Étienne Camus, was a surgeon. His mother was Marguerite Maillard. Charles-Étienne showed a great talent for mathematics and he also showed a considerable mechanical skill. He was keen to have the best education and he persuaded his parents to let him study at the Collège de Navarre of the University of Paris.\nAfter his studies at the Collège de Navarre, Camus continued to work on advanced topics in mathematics aided by\nVarignon\n. He\n[\n1\n]\n:-\n... also undertook work in civil and military architecture, mechanics, and astronomy.\nHe first made his name in mathematics when he entered for the Grand Prix of the\nAcadémie des Sciences\nin\n1727\n. The topic for the prize that year was the masts of ships. Both Camus and\nBouguer\nentered memoirs for the competition which were deemed worth of winning the prize and both the prize money and the award was split between the two.\nCamus not only won a share of the prize, but he also became known to the\nAcadémie\nas a talented mathematician. On\n13\nAugust\n1727\nhe was elected as an assistant in the mechanics division of the\nAcadémie\non the strength of his memoir. It was the beginning of a long association of Camus with the\nAcadémie des Sciences\nfor he served the academy as an administrator for forty years and also took an active scientific role in many of the academy's projects. On the administrative side he was the director of the\nAcadémie\nin\n1750\nand again in\n1761\n.\nCamus went with\nMaupertuis\n,\nClairaut\nand Lemonnier to Lapland in\n1736\non an expedition to determine the shape of the Earth.\nJean Picard\nhad measured the length of the arc of the meridian, the measurements appear in\nMesure de la Terre\nⓉ\n(\nMeasuring the Earth\n)\n(1671)\n. Camus,\nMaupertuis\n,\nClairaut\nand Lemonnier, after their joint work on the Lapland expedition, also worked on measuring the length of the arc of the meridian and examining\nJean Picard\n's work. With\nBouguer\n, Pingré and Cassini de Thury, Camus was involved in another\nAcadémie des Sciences\nproject relating to further work on the measurement of the earth.\nCamus was involved with cartography helping to produce, again with\nBouguer\n, Pingré and Cassini de Thury, the\nCarte de la France\nwhich the\nAcadémie des Sciences\npublished between\n1744\nand\n1787\n.\nMany of Camus's publications appeared in the\nMémoires de l'Académie royale des Sciences\nand they are both on mathematics and mechanics. Discussing some of this work in\n[\n3\n]\n, Iltis writes:-\nCharles-Étienne Camus related the force of rising and falling bodies to Bernoulli's Leibnizian analysis of expanding springs.\nHis other mechanics work includes\n[\n1\n]\n:-\n... treatment of toothed wheels and their use in clocks, studies of the raising of water from wells by buckets and pumps, an evaluation of an alleged solution to the problem of perpetual motion, and works on devices and standards of measurement.\nThe\nAcadémie des Sciences\nwas not the only academy which Camus was elected to, and which he served in an administrative capacity. In\n1730\nhe was elected to the Academy of Architecture and served as its secretary. He was then named as Professor of Geometry to the Academy of Architecture and in this capacity he lectured to students of architecture. Camus wrote a\nCours de mathématiques\nⓉ\n(\nA course of mathematics\n)\nfor his teaching of the trainee architects. This work was to be in four parts, arithmetic, geometry, mechanics, and hydraulics. Between\n1749\nand\n1751\nCamus published the first three parts of his\nCours\n, but despite the fact that he lived for a further seventeen years after this, the fourth part was never published. After Camus's death a work on hydraulics was found among his papers and it is believed that this was intended to be the final part of the\nCours\n.\nPerhaps the reason that Camus never published the final part of his\nCours\nwas his appointment in\n1755\nas examiner for artillery schools. As examiner, Camus was able to base his examinations on the three parts of his\nCours\nwhich were in print and this had, as one might expect, the result that his books sold widely and in great numbers. However, Chapin points out in\n[\n1\n]\nthat this was:-\n... due more to Camus's monopoly on examinations than to its intrinsic merit. In point of fact, the \"Cours\" came under increasing attack in the\n1760\ns as inappropriate for artillery students and too elementary for those at Mézières.\nIn fairness to Camus, he had never written the\nCours\nfor artillery students so one should not hold this against him scientifically but, of course, one can criticise him for using his position as examiner to force his own inappropriate\nCours\non artillery students."
}