{
  "nome_completo": "Charles Niven",
  "nome_curto": "Charles Niven",
  "ano_nascimento": "1845",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Niven_Charles/",
  "lugar_nascimento": "Peterhead, Scotland",
  "lugar_morte": "Aberdeen, Scotland",
  "biografia": "Details of\nCharles Niven\n's career and scientific achievements are given in the\nRoyal Society\nobituary at\nTHIS LINK\n.\nHere we give a few details which are additional to this\nRoyal Society\nobituary.\nCharles Niven\n's parents were Charles Niven\n(\nborn around\n1802)\n, a ginger beer brewer and spirit dealer, and Barbara Davidson\n(\nborn\n1810\nor\n1811)\nof Monquhitter, Aberdeenshire. Charles and Barbara married on\n28\nNovember\n1833\nand had nine children: John Gibb Niven\n(\nborn\n1834)\n; Thomas Niven\n(\nborn\n1836)\n;\nWilliam Davidson Niven\n(\nborn\n1842)\n; Charles Niven\n(\nborn\n1845)\n; Barbara Niven\n(\nborn\n1848)\n; James Niven\n(\nborn\n1851)\n; Alexander Niven\n(\nborn\n1854)\n; Thomas Niven\n(\nborn\n1855)\n; and George Niven\n(\nborn\n1859)\n. Charles was one of three distinguished mathematical brothers, William and James also being Cambridge\nWranglers\n.\nWilliam Niven\n, who became vice-president of the\nRoyal Society\nand was knighted, has a biography in this archive. James Niven studied at Queens' College, Cambridge and was bracketed eighth wrangler in the mathematical tripos of\n1874\n. He went on to study medicine and became medical officer of health for Manchester. Charles Niven married Mary Stewart, daughter of Sir David Stewart and Mary Irvine; they had one son and two daughters.\nCharles Niven was\n41\nyears as Professor of Natural Philosophy at the University of Aberdeen, being appointed in\n1880\n. On\n3\nJune\n1880\nhe was elected a fellow of the\nRoyal Society\n. He is best known in Aberdeen for building up Natural Philosophy in Marischal College but we note that Marischal College was only opened in\n1906\nwhen Niven had already been Professor for\n26\nyears. On Thursday\n27\nSeptember\n1906\nMarischal College was opened by the King and the\n400\nth\nanniversary of the founding of the University was celebrated. Professor Charles Niven was presented to the King during the ceremony.\nNiven's work with the Aberdeen Observatory is mentioned in a report in\nThe Scotsman\non Saturday,\n21\nSeptember\n1912\n:-\nABERDEEN OBSERVATORY\nThe work of a first order station has been continued as heretofore by Mr Clark, under the direction of Professor Charles Niven, F.R.S. The Dines pressure tube anemometer, which was installed some years ago for the purpose of comparison with the Robinson anemometer, was lent for a time during the summer to Mr E M Wedderburn, for use in connection with investigation of seiches in the Scottish lochs. Mr Clarke has presented to the office from time to time numerous photographs and sketches of sounds, and has formed an admirable collection of photos illustrating various cloud forms and phases of cloud formation, from which lantern slides for the illustration of lectures can be prepared. A set of consecutive photos included in this collection, taken within an hour and a half, was selected for reproduction in Geophysical Memoirs No.\n2\n, in illustration of the hypothesis of cloud formation there put forward. By arrangement with Professor Niven, a pair of the odolites have been lent to the Observatory for the observation of pilot balloons. Suitable bases have been selected, and a number of soundings have already been made.\nThe\nEdinburgh Mathematical Society\nwas founded in\n1883\nand at the meeting in June of that year Niven was elected as an honorary member.\nNiven's funeral took place on Tuesday\n15\nMay\n1923\nand\nThe Scotsman\nreported on the funeral on the following day:-\nFuneral of Professor Niven, Aberdeen\nThe funeral of Emeritus Professor Charles Niven, LL.D., F.R.S., who for\n42\nyears occupied the Chair of Natural Philosophy at the University of Aberdeen, took place yesterday from King's College Chapel to Banchory-Devenick United Free Churchyard. At the university chapel a service was conducted by Principal Sir George Adam Smith and the Rev. Charles McGlashan, Oldmachar Cathedral, and Professors Fulton and Cowan. The chief mourners were Mrs Niven\n(\nthe widow, daughter of the late Sir David Stewart of Banchory-Devenick\n)\n, Mr Charles D Niven, B.Sc\n(\nson\n)\n, and Miss Niven and Miss M S Niven\n(\ndaughters\n)\n. At the graveside a short service was conducted by Professor Fulton and the Rev. Dr J Ironside Still. The pall-bearers were:- Mr Charles D Niven\n(\nson\n)\n, Dr James Niven, late Medical Officer of Health, Manchester\n(\nbrother\n)\n; Colonel D B D Stewart; Banchory House; and Dr George L Stewart, Ipswich\n(\nbrothers-in-law\n)\n; Professors Harrower and Reid, Aberdeen University; Dr Fyvie and Dr Geddes, of the Natural Philosophy Department, Marischal College. Floral tributes, in addition to family wreaths, were forwarded from the Natural Philosophy Department, the Association of University Teachers, the students and the sacrists of King's and Marischal Colleges, and others."
}