{
  "nome_completo": "Pierre Charles François Dupin",
  "nome_curto": "Charles Dupin",
  "ano_nascimento": "1784",
  "ano_morte": "1873",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dupin/",
  "lugar_nascimento": "Varzy, France",
  "lugar_morte": "Paris, France",
  "biografia": "Charles Dupin\n's father was Charles-André-Dupin and his mother was Cathérine Agnès Dupin. In fact Dupin was both her married and maiden name. Charles' father was a lawyer and Charles himself was brought up in Nivernais, the region of his birth. Nivernais was not part of the French crown when he was born there, being owned from\n1659\nby Cardinal Mazarin and his descendants until\n1790\nwhen it became the département of Nièvre. Charles was the middle of the three sons of his parents; his older brother André also achieved fame in his profession as a lawyer.\nDupin was educated at the École Polytechnique in Paris, where he learnt geometry from\nMonge\n. While an undergraduate he made his famous discovery of what are called today 'Dupin's cyclides' guided in this work by\nMonge\n. He graduated in\n1803\nand then became a naval engineer. He often went on long sea voyages which resulted in his publications being much delayed. After being assigned to duties in Antwerp, Genoa and then Toulon, he was sent to Corfu in\n1807\nto take charge of the damaged naval arsenal there.\nWhile in Corfu he carried out his naval engineer's duties of repairing the port, but he also carried out tasks relating to his scientific interests. He was appointed as secretary to the Ionian Academy which had been founded only a short time before and he undertook deep research on mathematical topic, in particular studying the\ndifferential geometry\nof surfaces, and applied mechanics where he investigated the resistance of materials.\nAfter three years in Corfu he set out to return to France but, while passing through Pisa, he was taken ill. It took him a while to recover from the illness, but Dupin was not idle while recovering in Pisa. Rather he worked on this occasion on preparing for publication the writings of a friend who had died. In\n1813\nhe was in Toulon, and there he set up a maritime museum which was highly influential in the way that maritime museums were organised.\nAlso in\n1813\nDupin published his\nDéveloppments de géométrie\nⓉ\n(\nDevelopments in geometry\n)\nwhich\n[\n1\n]\n:-\n... contains many contributions to differential geometry, notably the introduction of conjugate and asymptotic lines on a surface ...\nOther contributions to differential geometry which occur in this work include his invention of the 'Dupin indicatrix' which gives an indication of the local behaviour of a surface up to the terms of degree two.\nThe year\n1813\nsaw Dupin elected to the Institut de France, the new organisation set up to replace the\nAcadémie des Sciences\nafter the French Revolution. With the reestablishment of the\nAcadémie des Sciences\n, Dupin was elected to that body in\n1818\n.\nDupin was appointed professor at Conservatoire des Arts et Métiers in Paris in\n1819\n. He held this post until\n1854\nand he gave many public lectures on the applications of mathematics and mechanics to industry. These lectures proved extremely popular, mainly since Dupin was an exceptional lecturer. But he not only had an academic life, publishing further important works on the applications of differential geometry to industry and the arts, but he also took a major part in politics from\n1828\n. In that year he was elected as a deputy for Tarn, a département in southern France.\nIn\n1830\n, at the age of\n45\n, Dupin married Rosalie Anne Joubert. His political career continued and his expertise as a naval engineer clearly stood him in good stead when he was appointed as minister of maritime affairs in\n1834\n. Four years later he became a peer and in\n1852\nhe was appointed to the Senate.\nStruik\nwrites in\n[\n1\n]\nthat Dupin:-\n... tirelessly encouraged the establishment of schools and libraries, the founding of savings banks, the construction of roads and canals, and the use of steam power.\nAs well as the honour of election to the Institut de France and the\nAcadémie des Sciences\nwhich we referred to above, he was also honoured with election to the Académie des Sciences Morales et Politique in\n1832\n."
}