{
  "nome_completo": "Charles de Bouvelles",
  "nome_curto": "Charles de Bouvelles",
  "ano_nascimento": "1471",
  "ano_morte": "1553",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bouvelles/",
  "lugar_nascimento": "Soyecourt, near Amiens, Picardy, France",
  "lugar_morte": "Noyon, Picardy, France",
  "biografia": "Charles de Bouvelles\nis also known as Carolus Bovillus. Charles' father was an aristocrat and Charles was born into the wealthy Bovelles family. However Soyecourt, the town of his birth, was in the Ponthieu region of Picardy and during Charles' childhood the region was being fought over. The dukes of Burgundy had acquired Ponthieu in\n1435\nunder the Treaty of Arras which had been signed by Philip the Good of Burgundy and Charles VII of France. After much fighting the region was retaken by France under Louis XI in\n1477\n. Picardy was for many years on the frontier and as a consequence subjected to frequent invasions.\nDe Bouvelles was educated in Paris. There he was a student of Jacques Lefèvre d'Etaples\n(1455\n-\n1536)\nwho was a famous humanist, theologian, and translator. Ordained a priest, Lefèvre taught philosophy in Paris from about\n1490\nand it was about the time that de Bouvelles came to Paris. Lefèvre was, of course, from d'Etaples so like de Bouvelles he came from Picardy. While de Bouvelles was studying under him, Lefèvre began to produce student manuals on physics and mathematics and he began working on new annotated translations of\nAristotle\n's works on ethics, metaphysics, and politics. Lefèvre had considerable influence on his student de Bouvelles, who went on to improve on the methods of his teacher.\nIn\n1495\nthe plague hit Paris and de Bouvelles left without, it appears, taking a degree. In the following years he worked on mathematical topics, in particular trying to solve the classical Greek problem of squaring the circle. In\n1501\n, while trying to solve this problem, he introduced the hypotrochoid\n(\nalthough he did not use this name\n)\nwhich is the curve traced by a point\nP\nP\nP\non a circle of radius\nb\nb\nb\nwhich rolls round inside a fixed circle of radius\na\na\na\n. Using this curve, de Bouvelles was able to give a mechanical means of squaring the circle.\nIn\n1503\nhe published\nGeometricae introductionis\nin Latin. The book discussed the problem of squaring the circle and gave an account of his various attempts to solve the problem. It was after he completed work on his book that de Bouvelles set out travelling first to Switzerland, and Mainz in Germany. Later he travelled through Italy, Spain, and France. On his return he became a Catholic priest and then became a canon in the Gothic collegiate church at St Quentin back in his home region of Picardy.\nAfter being a canon at St Quentin, de Bouvelles became a canon at the Cathedral of Notre-Dame in Noyon, north-northeast of Paris and still in the Picardy region. The Cathedral there was a fine transitional late\n12\nth\ncentury Romanesque-Gothic building in an important ecclesiastical centre. The Bishop of Noyon was Charles de Hangest and he was very pleased with his canon de Bouvelles, granting him much free time to undertake his studies of mathematics, philosophy and theology. In particular Bishop de Hangest had a country estate which provided the peace and quiet that de Bouvelles needed to concentrate on his studies.\nIn\n1509\nhe published a philosophy book\nDe Sapiente\nin which de Bouvelles presented a dualism between the observer and the observed. He saw human beings as:-\n... no longer part of the universe but as its eye and mirror; and indeed as a mirror that does not receive the images of things from outside but that rather forms and shapes them in itself.\nSo the human observer sees the world as something to dominate and exploit. This work would have considerable influence on\nDescartes\nwho took de Bouvelles' ideas still further.\nIn\n1510\nde Bouvelles published another work on mathematics. This was\nLiber de XII numeris\nwhich studied\nperfect numbers\n. It is not a particularly deep work and some of the properties that de Bouvelles gives are left unjustified. Another work\nGeometrie en francoy\nhas the distinction of being the first geometrical treatise printed in French. We noted that\nGeometricae introductionis\nwas first published in Latin but the work proved quite popular and so translations were in order. A French translation was published in\n1542\nand, five years later, the work appeared in Dutch.\nDe Bouvelles remained in Noyon for the rest of his life, teaching philosophy but seldom celebrating mass."
}