{
  "nome_completo": "Charles Frederick Fraser MacKenzie",
  "nome_curto": "Charles MacKenzie",
  "ano_nascimento": "1825",
  "ano_morte": "1862",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacKenzie_Charles/",
  "lugar_nascimento": "Portmore, Peeblesshire, Scotland",
  "lugar_morte": "Malo Island, Shire River, Malawi",
  "biografia": "Charles MacKenzie\n's parents were Colin MacKenzie\n(1770\n-\n1830)\nand Elizabeth Forbes\n(1781\n-\n1852)\n. Colin MacKenzie was a clerk of session and one of Walter Scott's friends. Elizabeth Forbes was the daughter of Sir William Forbes\n(1739\n-\n1806)\n, sixth baronet. Colin MacKenzie married Elizabeth Forbes in Edinburgh in May\n1803\n. Colin and Elizabeth MacKenzie had fifteen children: Alexander MacKenzie\n(1804\n-\n1805)\n(\nborn\n27\nMay\n1804)\n; Alexander Neil MacKenzie\n(1806\n-\n1822)\n(\nborn\n13\nJanuary\n1806)\n; William Forbes MacKenzie\n(1807\n-\n1862)\n(\nborn\n18\nApril\n1807)\n; Colin MacKenzie\n(1808\n-\n1870)\n(\nborn June\n1808)\n; James Hay MacKenzie\n(1809\n-\n1865)\n(\nborn\n12\nOctober\n1809)\n; Elizabeth MacKenzie\n(1811\n-\n1855)\n(\nborn\n31\nMay\n1811)\n; John MacKenzie\n(1812\n-\n1900)\n(\nborn\n1\nApril\n1812)\n; Anne MacKenzie\n(1813\n-\n1877)\n(\nborn\n16\nSeptember\n1813)\n; Katharine MacKenzie\n(1814\n-\n1832)\n(\nborn\n12\nOctober\n1814)\n; Jane MacKenzie\n(1816\n-\n1820)\n(\nborn\n27\nSeptember\n1816)\n; Sutherland MacKenzie\n(1818\n-\n1843)\n(\nborn\n15\nJanuary\n1818)\n; George Salvador MacKenzie\n(1819\n-\n1844)\n(\nborn\n23\nFebruary\n1819)\n; Alice MacKenzie\n(1823\n-\n1912)\n(\nborn\n8\nSeptember\n1823)\n; Charles Frederick Fraser MacKenzie\n(1825\n-\n1862)\n(\nborn\n10\nApril\n1825)\n; Margaret MacKenzie\n(1827\n-\n1915)\n. We see, therefore, that Charles MacKenzie, the subject of this biography, was the last son, and fourteenth child of whom eleven were still living when he was born. His father died on\n16\nSeptember\n1830\nwhen Charles was five years old. Following his father's death, Charles was brought up by his eldest sister Elizabeth who was, at that time, nineteen years old.\nMacKenzie attended a private school before studying at the Edinburgh Academy. The Academy was relatively new at this time, having been founded in\n1824\n. Its first rector was John Williams\n(1792\n-\n1858)\nwho, after leaving to take the position as Professor of Roman Language and Literature at the University of London in\n1828\n-\n29\n, returned as rector of the Edinburgh Academy, having that position when MacKenzie studied there. The mathematics master James Gloag\n(1795\n-\n1870)\nwas appointed when the Academy was founded and served for forty years, teaching MacKenzie mathematics. He began teaching\nJames Clerk Maxwell\nand\nPeter Guthrie Tait\nthe year after MacKenzie left. At this time, the Edinburgh Academy aimed to train boys to enter the University of Edinburgh but MacKenzie's family wanted him to matriculate at the University of Cambridge. Therefore, in\n1840\n, he became a boarder in the Grange School, in Sunderland. The Grange School was run by James Cowan who had been born in Lanark in\n1798\nand had moved to Sunderland in\n1822\n. He first ran Cowan's Green Street Academy which moved to the Grange in\n1830\n. Although the school took some day pupils, it was mostly a high reputation boarding school:-\n... the historical record attests to the high social standing of some of the pupils, as well as the successful careers for which the Grange helped them prepare.\nIndeed the Grange fostered MacKenzie's love of mathematics, already flowering though Gloag's teaching at the Edinburgh Academy, and prepared him to study the mathematical tripos at the University of Cambridge. He was admitted to St John's College, Cambridge, on\n4\nMay\n1844\n.\nIsaac Todhunter\nwas admitted to St John's College at the same time but he was five years older than MacKenzie having already obtained a B.A. from University College London in\n1842\nand then an M.A. in\n1844\n. MacKenzie changed colleges after a year, moving to Gonville and Caius College on\n1\nMay\n1845\n. In\n[\n6\n]\nit is stated:-\nHe went into residence as a pensioner of St John's College, Cambridge ... but, finding that he would as a Scot be disqualified from holding a fellowship there, moved the next May to Gonville and Caius College.\nI\n[\nEFR\n]\ndo not understand this statement, for I have never come across anyone else prevented from holding a fellowship at St John's College because they were a Scot. Certainly MacKenzie moved to Gonville and Caius College and in January\n1848\ngraduated as second wrangler in the mathematical tripos,\nIsaac Todhunter\nbeing the senior wrangler. When congratulated on his achievement as Second Wrangler, MacKenzie said\n[\n2\n]\n:-\nI only did what was natural under the circumstances.\nMacKenzie was made a fellow of Gonville and Caius College in\n1848\n. He was a mathematics tutor and, from May\n1848\nto\n1855\n, served as a secretary to the Cambridge Board of Education. In\n1852\nhe served as an Examiner for the mathematical tripos and was a Moderator in\n1853\n-\n54\n[\n2\n]\n:-\nWhen acting as Mathematical Examiner for Honours, he noticed a student who seemed nervous and faint, but who, according to rule, could not leave the presence of the examiners during the time allotted to the papers in hand. Mackenzie spoke to him, and took him out, made him swallow some soup, and brought him back to pass his examination.\nThe book\nSolutions of the Problems and Riders Proposed in the Senate-House Examination for\n1854\n, was published by W Walton, M.A. of Trinity College, and C F MacKenzie, M.A. of Caius College in\n1854\n. They write:-\nThe Moderators and Examiners have been induced to publish the present volume, mainly on the following account. The value of a problem frequently depends in great measure upon its illustrating clearly some general principle or exemplifying some analytical process; and thus a solution, which is as it were forced out, and which misses the method designed, is worth little in point of the instruction it affords. It is hardly possible for any but the framers of the questions to produce a complete series of solutions, showing the method which they wished the student to pursue. In the present instance the writers have availed themselves of their opportunities of inspecting the answers returned by the candidates for honours, and have appended to their own solutions some of the more striking of those which were submitted to them.\nCambridge, October\n1854\n.\nJust for illustration, here are two of the problems:\n(\ni\n)\nA piece of uniform wire is bent into three sides of a square\nA\nB\nC\nD\nABCD\nA\nB\nC\nD\n, of which the side\nA\nD\nAD\nA\nD\nis wanting; show that, if it is hung up by the points\nA\nA\nA\nand\nB\nB\nB\nsuccessively, the angle between the two positions of\nB\nC\nBC\nB\nC\nis\ntan\n⁡\n−\n1\n18\n°\n\\tan^{-1}18°\ntan\n−\n1\n1\n8\n°\n.\n(\nii\n)\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\nare three fixed points, and\nP\nP\nP\na point which moves first halfway to\nA\nA\nA\n, then halfway to\nB\nB\nB\n, then halfway to\nC\nC\nC\n. then halfway to\nA\nA\nA\nagain, and so on for ever; show that from whatever position\nP\nP\nP\nstart, its path approximates to the perimeter of a certain triangle whose area is one-seventh the area of the triangle\nA\nB\nC\nABC\nA\nB\nC\n.\nBoth as an undergraduate and as a fellow he played a full role in the sporting life of his College\n[\n6\n]\n:-\nTall, well made, and muscular, he delighted in athletic exercise, was an oarsman and cricketer, and rowed and played cricket with the undergraduates of the college after his election as fellow.\nWe have followed MacKenzie's mathematical career which continued at Cambridge until\n1862\n. He had, however, a parallel career in the Church. He was ordained deacon by Thomas Turton, Bishop of Ely, in Ely Cathedral on Trinity Sunday\n1851\n(15\nJune\n1851)\n. He was ordained priest in\n1852\nand served as a curate at Haslingfield, Cambridgeshire from\n1851\n-\n54\n. Haslingfield is a village about\n10\nkm south west of Cambridge so it was not difficult for MacKenzie to carry out his duties as curate at All Saints church in Haslingfield and at the same time act as tutor, examiner and moderator for mathematics at the University of Cambridge.\nThe Rev John S Jackson, a fellow of Caius College, had been appointed by the Society for the Propagation of the Gospel as Senior Missionary and Professor to establish a Missionary and Collegiate Institution at Delhi, India. In April\n1853\nJackson tried to persuade MacKenzie to go to Delhi with him. Mackenzie wrote\n[\n2\n]\n:-\nAfter he left me, I read a bit of Henry Martyn's Life before he left England, and I determined for the first time, and prayed to God to help me, to think what was best to be done, and to do it. I thought chiefly of the command, \"Go and baptize all nations,\" and how someone ought to go; and I thought how in another world one would look back and rejoice at having seized this opportunity of taking the good news of the gospel to those who had never heard of it, but for whom, as well as for us, Christ died. I thought of the Saviour sitting in heaven and looking down upon this world, and seeing us who have heard the news selfishly keeping it to ourselves.\nThis first desire for missionary work did not lead to his joining Jackson's Delhi Mission, however, but a second request in the following year saw MacKenzie decide on missionary work in Africa. When MacKenzie had matriculated at St John's College in\n1844\n, one of the mathematics fellows at the College was\nJohn Colenso\n. In\n1853\nColenso\nbecame bishop of Natal\n(\nnow KwaZulu-Natal\n)\nin South Africa. He spent ten weeks surveying his South African diocese, then returned to England in\n1854\nto recruit others to join him.\nColenso\nasked MacKenzie to become his Archdeacon and, in November of\n1854\n, he offered\nColenso\nhis services.\nColenso\n, with MacKenzie, MacKenzie's sister Anne, and other helpers, sailed for South Africa on\n7\nMarch\n1855\n. Arriving in Durban, MacKenzie was the parish priest for the British living there for around eighteen months. Sadly, however, his congregation were strongly opposed to the fact that he preached in a surplice\n[\n3\n]\n:-\n... preaching in a surplice appeared to some to be only Popery in disguise.\nThis was not the only problem, for MacKenzie followed the wishes of\nColenso\nwho stressed that God loved every race on earth, and that His aim was to defeat sin rather than to punish those who sinned. This may not sound like an extreme view but it contradicted the teaching of the Church of England at that time. It resulted in a split with some of the congregation at Durban who worshiped separately in a service conducted by a laymen.\nIn\n1857\n, a third member of the MacKenzie family joined the team when MacKenzie's sister Alice arrived in South Africa. MacKenzie\n[\n4\n]\n:-\n... playfully called them his white and black sister\n[\nAnne and Alice respectively\n]\n, in allusion to the interest felt by the one in the European and by the other in the native races.\nMacKenzie worked hard in ministering to various settlers and soldiers in a broad area around Durban. At a conference held in Pietermaritzburg he proposed a church synod in which black and white congregations had an equal voice but this was defeated. After becoming seriously ill, he returned to England in the summer of\n1859\n.\nWhile MacKenzie had been in South Africa, the Oxford and Cambridge Mission to Central Africa\n(\nthe Universities Mission\n)\nhad been set up in England which aimed to provide funds to send six  missionaries to Central Africa led by a Bishop. After a year, the Universities Mission had to decide on a leader and met on\n1\nNovember\n1859\nin the Senate House of the University of Cambridge. At this time MacKenzie was back in Cambridge with over four years of African missionary experience. It was decided to offer him the position of leader of the University Mission which he promptly accepted. MacKenzie organised the team to contain not only church people but also medical men and agricultural and industrial experts. These experts were added to the team since MacKenzie aimed to made every possible effort to stop the slave trade. His sister Anne, who had returned to England with him, was also in the team. The universities of Durham and Dublin had by now also joined the Universities Mission.\nOn\n2\nOctober\n1860\na farewell service was held in Canterbury Cathedral addressed by Samuel Wilberforce, Bishop of Oxford.\nOn\n1\nJanuary\n1861\nMacKenzie was consecrated as the first Bishop of the Universities Mission in St George's Cathedral in Cape Town, South Africa. He took the following oath:-\nIn the Name of God, Amen. I, Charles Frederick Mackenzie, chosen Bishop of the Mission to the tribes dwelling in the neighbourhood of the Lake Nyasa and River Shire, do profess and promise all due reverence and obedience to the Metropolitan Bishop and Metropolitical Church of Cape Town, and to their successors. So help me God, through Jesus Christ.\nCape Town had a separate coloured congregation\n(\nSt Paul's\n)\n, many of whom were liberated slaves, and MacKenzie preached there and asked for volunteers to join his party. From twelve volunteers, he selected three to join his team. They set off in two ships from Simon's Bay, near Cape Town, sailing first to Natal where MacKenzie visited the mission he had set up and making contact with his sister Alice who was still based there. The party continued in the two ships to the mouth of the Zambezi River and there met up with David Livingstone who assisted them in reaching Shire. There were difficulties in trying to avoid territory claimed by the Portuguese, difficulties in trying to navigate the Rovuma River which proved impossible, but eventually, with Livingstone's help, they reached Shire. MacKenzie had not wanted to try the Rovuma River but Livingstone was keen to explore it. MacKenzie felt they wasted time with this failed route and he narrowly escaped being eaten by a crocodile on that river. The Rovuma River had been attempted in March\n1861\nand only after entering the Zambezi River in May did they succeed in reaching Shire in July.\nThe work of the Mission was made very much more difficult than it might have been since there were wars between the local tribes. Not only did the Mission try to get peaceful settlements but they ended up fighting and defeating a group who had come to capture slaves. Unfortunately they also became involved in the tribal wars and many of the native people mistook them for slave traders. MacKenzie writes\n[\n4\n]\n:-\nI myself had in my left hand a loaded gun, in my right the crozier they gave me in Cape Town, in front a can of oil, and behind a bag of seeds, which I carried the greater part of the day. I thought of the contrast between my weapon and my staff, the one like Jacob, the other like Abraham, who armed his trained servants to rescue Lot. I thought of the seed which we must sow in the hearts of the people, and of the oil of the Spirit that must strengthen us in all we do.\nIn many ways the Mission were ill-prepared for the complex situation they were in and struggled to improve the lot of the people.\nThe Mission had arranged with Livingstone that they would meet him at the Isle of Malo at the confluence of the Ruo and the Shire rivers at the beginning of January\n1862\n. The second last letter MacKenzie wrote explains what happened\n(\nsee\n[\n4\n]\n)\n:-\nMonday, January\n13\n. - Our suspense is at an end. We got here, the Ruo mouth, on Saturday, to learn that Livingstone had passed down not many days before. This, though ... involving our staying here a good while, seemed good news to me, inasmuch as we have not detained him by arriving ten days after the time. We had, on the whole, a prosperous journey down. The chief at Chibisa's undertook to send us down to a chief, Turuma, where we should be likely to get a larger boat.\nAccordingly on Thursday we set off at three, and got to Turuma's in half an hour. It was delicious, the floating down that broad, green-banked river. The uncertainty as to the length of the voyage gave it a dreaminess, like some parts of Southey's 'Thalaba'. But, like 'Thalaba', our difficulties were not at an end. Turuma refused to see us, and declined to hire his boat to us. ... Just then two of the Makololo, Zomba and Siseho, joined us, having walked down the bank. These\n(\nwith Charlie\n)\nundertook to go down with us. So off we started, wondering at the way God was leading us.\nNext morning we set off early. Burrup was far from well. At night we drew to the shore. By this time the mosquitoes were very troublesome. One of the men said, \"We are going on.\" It was better, they thought, to work by moonlight than to be eaten up by insects. After half an hour we found ourselves stranded on the flooded bank. In a few minutes Zomba, the bowman, gave the signal for a start, and off we were again in silence. This time we were sooner in coming to grief. A sudden turn, which our bowman did not see in time, landed us again on a point where the stream parted in two; the two men in the stern jumped out, up to their middle; I followed immediately, Burrup after me. But in vain; the canoe continued to fill, and we began to pull out our things ... till we could get the canoe raised and baled out. Then the things were put in again, all soaking, and we wet up to our middles. We were thankful our losses had been no worse, though it was not till next day we remembered that all our medicine was gone, and our spare powder.\nFortunately the night was far from cold, or we might have taken harm; as it is, Burrup is none the better for it. I think I have escaped any ill consequences. In the meantime we have been led to a very nice village. A benign, oldish chief, Chikanza, with a large population, occupying, I should think, about a hundred huts, willing that we should remain here. ... I have my hopes that our being here in this way may be intended to prepare the village for being one of the stations to be worked by our Mission steamer\n(\nthe University boat\n)\n, for which I hope to write by this mail. So matters stand at present. Burrup is very low, and we have no medicine. Quinine, which we ought to be taking every day, there is none. But He who brought us here can take care of us without human means. If we should be down at once, Charlie will take care of us.\nMacKenzie became ill with fever and, with no quinine and Burrup too ill to help him, he died on\n31\nJanuary\n1862\nafter being unconscious for a week. Although MacKenzie died on the Isle of Malo, he was buried on the mainland. The article\n[\n8\n]\ndetails later visitors to MacKenzie's grave. Burrup, who left a letter giving details of the site of MacKenzie's grave, died on\n22\nFebruary, three weeks after MacKenzie.\nCharles Mackenzie is commemorated in the Calendar of the Scottish Episcopal Church on\n31\nJanuary. The following Collect is used on that day:-\nAlmighty and everlasting God, we thank you for your servant Charles Mackenzie, whom you called to preach the Gospel to the people of Nyasaland. Raise up in this and every land evangelists and heralds of your kingdom, that your Church may proclaim the unsearchable riches of our Saviour Jesus Christ; who lives and reigns with you and the Holy Spirit, one God, now and for ever. Amen."
}