{
  "nome_completo": "Clive William Kilmister",
  "nome_curto": "Clive William Kilmister",
  "ano_nascimento": "1924",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kilmister/",
  "lugar_nascimento": "Epping, Essex, England",
  "lugar_morte": "Lewes, East Sussex, England",
  "biografia": "Clive Kilmister\nwas the son of William Kilmister\n(1898\n-\n1973)\nand Doris Cookson\n(1900\n-\n1992)\n. William Kilmister, born in Harlow, Essex, on the\n31\nJanuary\n1898\n, became an engineers pattern maker, working in wood. He was a skilled craftsman who made patterns for the iron foundry which, at that time, was the largest employer in Epping. William had served in the Royal Navy during World War I, serving on HMS President II, the accounting base at Chatham, from\n5\nJune\n1916\n, then serving on the HMS Queen II at Malta in October\n1917\n. He married Doris Cookson in\n1922\nat Steyning, Sussex and their only son, Clive Kilmister, the subject of this biography, was born in Epping.\nAfter primary education in Epping, Kilmister, after taking the scholarship examination, attended Leyton County High School for Boys, a selective grammar school taking pupils from\n11\nto\n18\n. The Headmaster was Dr Leonard Couch, nephew of the author Arthur Thomas Quiller-Couch. The masters at the school were good teachers who aimed to have their pupils take the University of London's General Schools Certificate which gave the best pupils automatic entry to the University of London. Kilmister was fifteen years old and in the middle of his secondary education at the school when World War II broke out. This was a particularly difficult time, especially in London where there were evacuations of children to safer parts of the country. Kilmister graduated from the High School in\n1942\nand gained entry to Queen Mary College, London.\nThe Principal of Queen Mary College had quickly arranged for the College to be evacuated to King's College, Cambridge, soon after war was declared in\n1939\n. By the time that Kilmister began his university studies in\n1942\nthe arrangement was working well with Queen Mary College students allowed to enter the King's College clubs and societies. RAF soldiers were also billeted at the College and students were able to undertake military service while taking shortened university courses. Kilmister graduated in\n1944\nwith first class honours having completed his studies in two years and at the same time having undertaken military service with the Royal Artillery. He was awarded a University of London Sherbrooke Studentship.\nC P Snow, who had trained as a physicist but is now better known as an author, was looking for talented students to undertake war related projects. He was particularly involved in the training of scientists for radar work and he recommended Kilmister to the Plessey Company who, among many other wartime projects, were working on developing radar. Kilmister spent the three years,\n1944\n-\n47\n, working on developing radar at Plessey before returning to Queen Mary College, now back in London, to continue his education which had been disrupted by the war. His first postgraduate study was for an M.Sc. degree and for this he took courses on complex functions and on electromagnetic theory. The M.Sc. was by examination, not by dissertation, and he was awarded the degree in\n1948\n. He then began research for his Ph.D. advised by\nGeorge McVittie\n.\nMcVittie\nhad begun research in Edinburgh with\nEdmund Whittaker\nand continued at Cambridge under\nArthur Eddington\n. He had been on the staff at the University of London from\n1936\n, first as a reader at King's College, and from\n1948\nas a professor at Queen Mary College. Kilmister's\n[\n26\n]\n:-\n... research topic ... dealt with some of\nEddington\n's ideas and included the writing of\nEddington\n's E-numbers in terms of quaternions. This was a rather surprising area of research.\nMcVittie\nhad long thought that\nEddington\nhad lost touch with real physics. According to Kilmister,\nMcVittie\nconsidered\nEddington\n's last works \"scandalous\", and he hoped Kilmister would \"get rid of this scandal\" ...\nAlso in\n1948\nKilmister met Peggy Joyce Hutchins\n(1927\n-\n2012)\nwho at that time was reading English at Queen Mary College. Peggy, born in Wembley, London, was the daughter of Cyril Edmund Hutchins\n(1898\n-\n1965)\nand Rebecca Elizabeth Isaacs\n(1899\n-\n1948)\n. Cyril began a career with the Post Office in November\n1914\nbut in\n1916\n, when he reached the age of eighteen, he was called up for military service during World War I. He did not report for war service and was brought before a Court Martial on\n4\nDecember\n1916\nat Newton Abbot. He was registered as a Conscientious Objector and sentenced to\n112\ndays hard labour in Dartmoor Prison. Clive and Peggy Kilmister were married in Kensington, London in March\n1955\n; they had three children: Andrew, Sally and Penny.\nLet us return to Kilmister's research at Queen Mary College. In\n1949\n, before submitting his Ph.D. thesis, he had three publications. The paper\nThe use of quaternions in wave-tensor calculus\nwas published in\n1949\nin the\nProceedings\nof the\nRoyal Society of London\n. The Abstract states:-\nQuaternions are used to obtain some of\nEddington\n's results in a general affine space, and a more convenient notation for E-numbers is suggested. As an example,\nDirac\n's equations are derived, their connexion with the affine space of distant parallelism is explained, and\nEddington\n's views on their 'Euclidean' nature are discussed.\nAt the end of the paper, Kilmister acknowledges the help from his advisor\nGeorge McVittie\n:-\nThe author wishes to thank Professor\nG C McVittie\nfor suggesting this subject to him, and for helpful advice and encouragement in the course of the work.\nAlso in\n1949\n,\nA note on minimum integrals in field theory\nwas published in the\nLondon, Edinburgh, and Dublin Philosophical Magazine and Journal of Science\n. The Abstract states:-\nA unification of the minimum energy theorems encountered in electromagnetic theory has been stated, and the extension of the theorem to non-isotropic dielectrics and conductors has been made. An application of the theorem to the magnetic field suggests a modified form for the density of the magnetic force-function which agrees which Livens's expression for this quantity.\nA third publication in\n1949\nis a joint one by Kilmister and Edward William Bastin, namely the letter\nPhysics Tomorrow\n. E W Bastin\n(1926\n-\n2011)\n, who was known as \"Ted\" and even published as \"T Bastin\", was a research student in mathematics at Queen Mary College. His interests were very similar to those of Kilmister and the two published joint papers and books for the whole of their careers. Their first joint publication\nPhysics Tomorrow\n[\n14\n]\ncontains ideas they would continue to develop throughout their careers; you can read a version at\nTHIS LINK\n.\nIn\n1950\nKilmister was awarded a Ph.D. for his thesis\nThe use of quaternions in wave-tensor calculus.\nThis contained results from the\n1949\npaper with the same title we mentioned above, but he published a further paper,\nTensor identities in wave-tensor calculus\n, in\n1951\nwhich also appeared in the\nProceedings\nof the\nRoyal Society of London\n. The Abstract states:-\nThe quaternion methods of a previous paper are used to formulate clearly the problem of\nEddington\n's 'tensor identities' in both single and double frames. As examples, the single-frame theory is used to calculate the well-known gyromagnetic ratio of the electron, and the double-frame to deduce a complete set of equations, of which\nEddington\nhas given a few, which include equations having the form of the field equations of general relativity. A discrepancy with\nEddington\n's results is noted, and reasons given for preferring the present equations.\nAt the end of the paper, Kilmister acknowledges the help from his advisor\nGeorge McVittie\n:-\nMost of the results of this paper are to be found proved by longer, but more elementary methods in a thesis\n(\nKilmister\n1950)\n. This work was undertaken at Queen Mary College and the author wishes to thank Professor\nG C McVittie\nfor constant advice, and interest in the course of the work.\nKilmister was appointed as an assistant lecturer in King's College, London in the autumn of\n1950\n. This was a temporary, three or four year, appointment. Before its end, however, he was appointed to a lectureship in King's College, London in\n1953\nand he continued to work there for the rest of his career. John Silvester writes\n[\n29\n]\n:-\nIn later years Clive recalled the small department he joined as being a very happy place. Departmental bureaucracy was essentially confined to a half hour meeting after the summer examinations although, as he said, it did sometimes run over to nearly three quarters of an hour. In\n1954\nHermann Bondi\njoined the Department and, together with Clive and Felix Pirani, established the gravitational theory group. The King's group quickly became internationally renowned. It was one of a small number largely responsible for the post-war renaissance of research into\nEinstein\n's theory of general relativity. He had broad interests, and his publications range over\nEddington\n's work and applications of his algebraic approach in other fields, and also general relativity and unified field theories, special relativity, mechanics\n(\nincluding quantum mechanics\n)\nboth in relation to teaching and foundations, history and philosophy of science, and applications of mathematics in the social sciences. With his long-term collaborator Ted Bastin he was involved in attempts to construct an abstract approach to physics, and they were founding members of the Alternative Natural Philosophy Association. This latter work he regarded as his most important and the most likely to endure, though perhaps also his most heterodox. He was author of more than a dozen books ...\nDavid C Robinson writes\n[\n27\n]\n:-\nKilmister was delighted when\nBondi\nand Pirani were appointed. \"Everything changed\" he later said although his personal work on gravity was never more than a small part of his research. The latter did include explorations of alternatives to general relativity. For example he undertook one of the early investigations of what later tended to be called Yang's theory of gravity ... Kilmister was elected to the committee of the International Society on General Relativity from\n1971\nto\n1974\nbut by then his many other activities were crowding out his interest in general relativity ..\nSome of these \"other activities\" involved, as mentioned in the previous quote, writing \"more than a dozen books.\" These books, some of which are co-authored, are:\nSpecial Relativity for Physicists\n(1958)\n;\nEddington's statistical theory\n(1962)\n;\nHamiltonian Dynamics\n(1964)\n;\nThe Environment of Modern Physics: Study in Relativistic Mechanics\n(1965)\n;\nRational Mechanics\n(1966)\n;\nMen of Physics: Sir Arthur Eddington\n(1966)\n;\nLagrangian Dynamics: An Introduction for Students\n(1967)\n;\nLanguage, Logic and Mathematics\n(1967)\n;\nPhysical Applications of Vectors and Tensors\n(1969)\n;\nThe Nature of the Universe\n(1971)\n;\nGeneral Theory of Relativity\n(1973)\n;\nEddington's Search for a Fundamental Theory: A Key to the Universe\n(1994)\n;\nCombinatorial physics\n(1995)\n; and\nThe origin of discrete particles\n(2009)\n. For more information about these books such as extracts from Prefaces, Introductions, Contents, and reviews, see\nTHIS LINK\n.\nIn many ways\nEddington's Search for a Fundamental Theory\nis an account of a major aspect of Kilmister's life-long research. We give a substantial extract from the Preface at\nTHIS LINK\n.\nHere let us give a short extract to illustrate our comment in the last paragraph:-\nIt is half a century since I first succumbed to the Eddingtonian magic ... in 'Relativity Theory of Protons and Electrons', which\nEddington\nhad published ... in\n1936\n. I had already enjoyed his authoritative 'Mathematical Theory of Relativity' with no more difficulty than that produced by the complex mathematical techniques which were new to me. Looking back on it, it surprises me that I could take in without a qualm so many of the unorthodox philosophical views in that book. But 'Relativity Theory of Protons and Electrons' was a different matter. Another clutch of mathematical techniques was not enough to obscure a radically new position. ...\nIn\n1941\nmuch of\n[\nthe\n]\nbackground was unknown to me and I was just fascinated by the book on its own terms. As time went on I learnt more and more of the difficulties and the task became that of reconstructing\nEddington\n's work in such a way as to avoid them. In\n1945\n'Fundamental Theory' appeared after\nEddington\n's death. It was a disappointment to me, for it did not seem to address the real obscurities of the earlier book. I spent a good deal of time clearing up the algebraic aspects of the theory but when this had been done the basic ideas were not much clearer. Yet they continued to dazzle: flashes of insight grouped round a frame of numerical results. I kept returning to\nEddington\n's work and puzzling over it between the other enterprises that filled my working life. I owe a debt of great gratitude to Ted Bastin who often gave me guidance and help over\nEddington\nduring this forty-five years.\nResearch in mathematical physics was not the only thing to occupy Kilmister's interests. He was an active member of the\nMathematical Association\n, being a member of a committee in\n1962\nwhich reported on the teaching of modern mathematics and a committee in\n1965\nwhich reported on the teaching of mechanics in secondary schools. He was elected President of the\nMathematical Association\n, serving in\n1979\n-\n80\n, and delivered his Presidential Address entitled\nZeno, Aristotle, Weyl and Shuard: two-and-a-half millenia of worries over number\nwas delivered on\n9\nApril\n1980\n. We give a version of his Address at\nTHIS LINK\n.\nLet us mention his involvement with the Logistics Research Project, sponsored in part by the Office of Naval Research with ran at the George Washington University in Washington D.C. from\n1950\nto\n1968\n. Kilmister participated in this project flying from Manchester, England, to New York on\n5\nDecember\n1958\n.\nHe was also much involved with the British Society for the Philosophy of Science serving on its committee during\n1963\n-\n66\nand serving as President during\n1981\n-\n83\n. He was a founder member of the British Society for the History of Mathematics in\n1971\nand served as its second President in\n1974\n-\n76\n. He was a great enthusiast for the history of mathematics and wrote in\n[\n15\n]\n:-\nYears ago books on the history of mathematics, especially those addressed to the general public, were written by second-rate mathematicians who had turned themselves into something less than second-rate historians. More recently things have improved greatly and there are first-rate historians producing works of real scholarship.\nHe was promoted reader at KCL in\n1959\n, and professor in\n1966\n. From\n1972\n-\n1988\n, he was Gresham Professor of Geometry. He took on many administrative tasks including Dean of the Faculty of Natural Science, and Chair of the Department of Mathematics. He writes\n[\n16\n]\n:-\nIn\n1967\nI was appointed to the Chair of Mathematics\n(\nwhich had been vacant for a year\n)\n. I found a Department of\n11\n, or rather\n10\nand\n2\nhalves, one post being shared with the Institute of Computer Science and one with the Philosophy Department. In the course of the next few years both were converted to full posts, giving us a strength of\n12\n. Professor John S Griffith left in\n1968\nto take up a split appointment between Bloomington and the CSIRO in Sydney\n(\nhe died only\n5\nyears later\n)\n. He was succeeded in\n1969\nby R F Streater, an applied mathematician with very broad interests in pure mathematics. During the next dozen years, when lecturers were relatively scarce, there was a turnover of about one staff member per year, and we were usually able to get people whose interests were represented in the Department, with the result that distinct research groups could be formed, in algebra, logic and quantum field theory. This was also reflected in the growing number of research students, research fellows and the steady stream of overseas visitors to the Department. At the same time the interests of the undergraduates were not forgotten; the syllabus had become more 'algebraic', but efforts were made to provide a balanced fare. In the third year it was possible to attend courses at other colleges, and there was a\n(2\n-way\n)\ninterchange with both University College and Westfield College, and to a lesser extent King's College. At the postgraduate level there was the M.Sc. which was truly intercollegiate, and it could easily happen that the class for an M.Sc. course was larger than one for an optional second year course.\nJohn Silvester writes in\n[\n29\n]\nabout working with Kilmister:-\nI have many reasons to be grateful to Clive. As a young lecturer I quickly realised that he was among the most approachable, generous and helpful of my senior colleagues, and I picked his brains and benefited from his advice on innumerable occasions. He encouraged me early on to take an interest in what went on in schools by arranging for me to be involved in examining for the London Teaching Certificate and, much later, by suggesting I might like to become Admissions Tutor. And, knowing that I lived a long way out from London, year after year he so organised the timetable that I could avoid too often having to travel uncomfortably and expensively in the rush-hour. Clive was a devoted husband and family man. He and Peggy shared interests in theatre, opera, art, and music, in particular lieder.\nAfter he retired in\n1984\n, Kilmister and his wife went to live permanently in a cottage in Lewes, East Sussex, which had previously been their weekend retreat. He continued to undertake research and write papers and books\n[\n29\n]\n:-\nHe sometimes suffered from insomnia, and would do mathematics to pass away the hours of darkness ...\nIn\n2090\nhe began to suffer from cancer and died a year later in his home in Lewes."
}