{
  "nome_completo": "Cornelius Lanczos",
  "nome_curto": "Cornelius Lanczos",
  "ano_nascimento": "1893",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lanczos/",
  "lugar_nascimento": "Székesfehérvár, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Cornelius Lanczos\nwas born Kornél Löwy but when there was a reaction in Hungary against German names he, along with large numbers of his countrymen, changed his name from the German form and became Kornél Lánczos\n(\nor rather, Lánczos Kornél since Hungarians put the family name first\n)\n. His family were of Jewish origins, his father being a lawyer. Lanczos attended a Jewish elementary school where he learn several foreign languages, then he entered the local\nGymnasium\nwhich was a Catholic school run by the Cistercians.\nHe graduated from the gymnasium in\n1910\nand, the following September, he entered the University of Budapest. There he had several inspiring teachers who were to make a great impression on Lanczos. His physics teacher was\nEötvös\nwho first interested Lanczos in relativity. His mathematics teacher was\nFejér\nand Lax writes in\n[\n2\n]\n:-\nLanczos was much influenced by\nFejér\n; he learnt from him about\nFourier series\n, orthogonal polynomials, and interpolation. It is likely that Lanczos was influenced by\nFejér\n's style of lecturing...\nAfter graduating in\n1915\n, Lanczos was appointed an assistant at the Technical University of Budapest. He worked on relativity theory and after writing his dissertation\nRelation of Maxwell's Aether Equations to Functional Theory\nhe sent a copy to\nEinstein\n. It impressed\nEinstein\nwho replied:-\nI have read your work in as much detail as my present excess of work allows. I can say that it is sound and original thinking. It makes you worthy of the doctorate. I am pleased to give you my permission to honour me by dedicating it to me.\nLanczos received his doctorate in\n1921\nand, because of laws in Hungary against Jews, he went to Germany taking up a post at the University of Freiburg. He spent three years in Freiburg, then took up a post in Frankfurt am Main where he became a colleague of\nPaul Epstein\n. During the year\n1928\n-\n29\nLanczos was\nEinstein\n's assistant in Berlin, returning to Frankfurt in\n1929\n.\nIn\n1931\nLanczos spent a year as a visiting professor at Purdue University in West Lafayette, Indiana. Returning to Germany he found that the political situation there becoming unacceptable for someone of Jewish origin and he returned to a Professorship at Purdue in\n1932\n. As Gellai writes in\n[\n3\n]\n:-\nHad he not been compelled to leave Germany for the United States, the field of applied mathematics might lack today several very useful and elegant mathematical methods.\nDuring his time at Purdue, Lanczos published mathematical physics papers at first but in\n1938\nhe published his first work in numerical analysis. Two years later he published a\nmatrix\nmethod of calculating Fourier coefficients which, over\n25\nyears later, was recognised as the 'Fast Fourier Transform' algorithm described by\nTukey\n. Lanczos continued to work on his first love of relativity and corresponded with\nEinstein\nboth on a scientific level and as a friend. A new young man was appointed as Head of Physics at Purdue and Lanczos felt his work there was no longer appreciated. He wrote to\nEinstein\n:-\nThis brings me into a most difficult situation and I am trying desperately to get away from here.\nLanczos spent the year of\n1944\nworking for the Boeing Aircraft Company and, in\n1946\n, he resigned his post in Purdue to take up a permanent appointment with Boeing. There he worked on applications of mathematics to aircraft design and was able to develop new numerical methods to solve the problems.\nIn\n1949\nhe moved to the Institute for Numerical Analysis of the National Bureau of Standards in Los Angeles. Here he worked on developing digital computers and was able to produce versions of the numerical methods he had developed earlier to program on the digital computers. At the Institute for Numerical Analysis he had\nOtto Szász\n,\nTaussky-Todd\nand her husband\nJohn Todd\nas colleagues.\nHowever during the early\n1950\ns United States senator Joseph R McCarthy whipped up strong feelings against communism in the USA. At the Institute for Numerical Analysis, as in many other institutions, there were investigations and suspicions and the atmosphere became unpleasant. Lanczos was therefore delighted to receive an offer from\nSchrödinger\nto head the Theoretical Physics Department at the Dublin Institute for Advance Study in Ireland. He took up the post in\n1952\nand, as Gellai writes in\n[\n3\n]\n:-\nA very special, and in some ways the most beautiful, period of his life started there when he returned again to his 'first love' in science, devoting himself primarily to the study of the theory of relativity. Indeed, this position offered the support and the circumstances which he had longed for his entire life.\nLanczos published over\n120\npapers and books in a career spanning over\n40\nyears. About half of these papers and books were published after he took up the position in Dublin. He certainly travelled widely during this period, most often in the United states. While on a visit to the\nEötvös Loránd\nUniversity in Budapest in\n1974\nhe had a sudden heart attack and died in hospital the following day."
}