{
  "nome_completo": "Daniel Gorenstein",
  "nome_curto": "Daniel Gorenstein",
  "ano_nascimento": "1923",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gorenstein/",
  "lugar_nascimento": "Boston, Massachusetts, USA",
  "lugar_morte": "Martha's Vineyard, Massachusetts, USA",
  "biografia": "Daniel Gorenstein\nbecame interested in mathematics at a young age. He taught himself calculus at the age of\n12\nyears. His secondary schooling was at Boston Latin School from which he graduated, entering Harvard University. There he worked under\nSaunders Mac Lane\nand became interested in finite\ngroups\n, the subject he would return to after a few years studying\nalgebraic geometry\nto make it his life's major work.\nGorenstein graduated in\n1943\nand, to contribute to the war effort, he accepted a teaching position at Harvard to teach mathematics to army personnel. At the end of World War II, Gorenstein returned to Harvard, this time to undertake graduate work with\nZariski\n. This work led to a thesis on algebraic geometry in which he introduced rings which are now named after him.\nAfter the award of his doctorate in\n1950\nGorenstein accepted a post at Clark University in\n1951\n. He remained there, except for the year\n1958\n-\n59\nwhich he spent as a visiting professor at Cornell, until he moved to Northeastern University in\n1964\n. In\n1968\n-\n69\nhe was a member of the Institute for Advanced Study at Princeton. After five years at Northeastern, Gorenstein accepted a professorship at Rutgers University where he remained until his death.\nAt Rutgers, Gorenstein was chairman of the Mathematics Department from\n1975\nuntil\n1981\n. In\n1984\nRutgers appointed him as Jacqueline B Lewis Professor of Mathematics and then, in\n1989\n, he became Director of the newly founded National Science Foundation Science Technology Center in Discrete Mathematics and Theoretical Computer Science. This Center was a joint project between Rutgers University and Princeton University with AT&T Bell Laboratories and Bell Communications research as partners.\nHe returned from algebraic geometry to his early research topic of finite groups in\n1957\n, stimulated by a collaboration with\nHerstein\n. His involvement in the classification of finite\nsimple groups\nbegan in the year\n1960\n-\n61\nwhen he attended the\nGroup Theory Year\nat the University of Chicago. He wrote\n[\n3\n]\n:-\nMy first foray into simple group theory dated from the famous\n1960\n-\n61\ngroup theory year at the University of Chicago, during which\nWalter Feit\nand\nJohn Thompson\nsettled the solvability of groups of odd order. It was there that I began a long collaboration with\nJohn\nand\nWalter\nand met many of the leaders in the field:\nBrauer\n,\nSuzuki\n,\nGraham Higman\n, and\nIto\n.\n(\nIt was only somewhat later that I met\nPhilip Hall\nand\nWielandt\n.\n)\nAlperin was spending the year in Chicago to write his thesis with\nHigman\n, while still a graduate student at Princeton.\nThe classification of finite simple groups involved contributions by a host of mathematicians world wide. However it was Gorenstein who took an overview of the whole project and steered it to a successful conclusion. It is for the classification of finite simple groups that his name will always be remembered, certainly the mathematical achievement of the\n20\nth\ncentury. If Gorenstein was the man with the best overview of this achievement, then surely we can do no better than to quote his own description of events. We quote from his response to the award of a Steele prize in\n1989\ngiven in\n[\n3\n]\n:-\nLargely under the impetus of the odd order theorem, there was an awakening interest in finite group theory. Throughout the next decade and a half a long list of gifted young mathematicians, who were to play a prominent role in the classification proof, were attracted to the field. In the United States,\nJohn Thompson\nhad a string of outstanding graduate students: Sims, Goldschmidt, Lyons, Griess. Glauberman was a student of Bruck's at the beginning of the period and Aschbacher near the end. Ronald Solomon wrote his thesis with\nFeit\n, Seitz with Curtis, Stephen Smith with\nHigman\nat Oxford, O'Nan with me, and Shult was essentially self-taught.\nBut the attraction was not limited to the United States. Janko in Australia. Conway in England, and Fischer in Germany, each discovering three new sporadic groups, stimulated considerable additional interest, leading to an intensification of the search for further simple groups.\nTits\n(\nentering the field somewhat earlier\n)\nhad deepened our understanding of the\nChevalley\ngroups and their Steinberg-Suzuki-Ree variations, Bender in Germany was to prove the fundamental strongly embedded subgroup classification theorem, and Harada was beginning his career in Japan. At the end of the period, there were a number of others: Foote from Canada working with\nJohn Thompson\nin Cambridge, England, Geoffrey Mason from England, coming to the United States, and writing his thesis with Fong, himself a student of\nBrauer\n, and in Germany, Timmesfeld and Stellmacher, students of Fischer, and Stroth, a student of Huppert, but writing his thesis on a problem suggested by Held, who had himself been a student of Janko.\nThere were a great many other group theorists as well who made significant contributions to the classification proof. But it was Aschbacher's entry into the field in the early\n1970\ns that irrevocably altered the simple group landscape. Quickly assuming a leadership role in a single minded pursuit of the full classification theorem, he was to carry the entire \"team\" along with him over the following decade until the proof was completed.\nI was fortunate indeed to have interacted in one way or another during this twenty year period with most of the mathematicians I have mentioned.\nSimultaneously with this burgeoning research effort, finite simple group theory was establishing a well-deserved reputation for inaccessibility because of the inordinate lengths of the papers pouring out. The\n255\npage proof of the odd order theorem, filling an entire issue of the Pacific Journal, had set the tone, but it was by far not the longest paper. Moreover, the techniques being developed, no matter how seemingly powerful for the problems at hand, appeared to have no applications outside finite group theory. Although there was admiration within the mathematical community for the achievements, there was also a growing feeling that finite group theorists were off on the wrong track. No mathematical theorem could require the number of pages these fellows were taking! Surely they were missing some geometric interpretation of the simple groups that would lead to a substantially shorter classification proof.\nThe view from the inside was quite different: all the moves we were making seemed to be forced. It was not perversity on our part, but the intrinsic nature of the problem that seemed to be controlling the directions of our efforts and shaping the techniques being developed.\nGorenstein's books on finite groups and the classification of finite simple groups are\nFinite groups\n(1968)\n,\nFinite simple groups : an introduction to their classification\n(1982)\n,\nThe local structure of finite groups of characteristic\n2\ntype\n(\njointly written with Richard Lyons\n)\n(1983)\nand\nThe classification of the finite simple groups\n(\njointly written with Richard Lyons and Ronald Solomon\n)\n(1994)\n.\nGorenstein received many honours for his work. In\n1972\n-\n73\nhe was both Guggenheim Fellow and Fulbright Research Scholar. During\n1978\nhe was Sherman Fairchild Distinguished Scholar at the California Institute of technology. He was elected to the\nNational Academy of Sciences\n(1978)\nand the\nAmerican Academy of Arts and Sciences\n(1978)\n. He also received the Steele Prize from the\nAmerican Mathematical Society\nin\n1989\n. There are three Steele Prizes awarded and Gorenstein received the award for expository mathematical writing at the\nAmerican Mathematical Society\nSummer Meeting in Boulder, Colorado, USA. The citation for the award states\n[\n3\n]\n:-\nGorenstein was a major figure in setting the direction of the classification program. He coordinated the activities in the program, functioning as the \"coach\" to a team, with optimism, perseverance, and technical power. His expository articles and books ... are beautiful accounts of this fantastic intellectual adventure. His presentation of theorems and definitions, as well as the flow of argument and the evolution of ideas, is precise and generous and reaches out to the reader."
}