{
  "nome_completo": "David Jack",
  "nome_curto": "David Jack",
  "ano_nascimento": "1896",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jack/",
  "lugar_nascimento": "Scarfskerry, Caithness, Scotland",
  "lugar_morte": "St Andrews, Fife, Scotland",
  "biografia": "David Jack\nattended Thurso High School, Caithness, and completed his education there in\n1914\n. From there went to the University of Edinburgh but soon after this World War I started. At first he was able to continue with his studies and, for example, he was awarded a First Class Certificate in the Second Ordinary Class in Mathematics at the University of Edinburgh taught by\nLester R Ford\nin June\n1915\n. However, after this Jack's undergraduate years were interrupted with two years of military service. He returned to university after his war service and graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1920\n. In the same year he obtained a B.Sc.\nAfter graduating, Jack began research in physics at Edinburgh University under\nGeorge Carse\n. He spent session\n1923\n-\n24\nat the Carnegie Institute of Technology, Pittsburgh, U.S.A. where he was appointed as Associate Professor of Mathematics. He returned to Scotland in\n1924\nwhen appointed as a Carnegie Teaching Fellow in the Natural Philosophy Department at the University of St Andrews. He was promoted to Lecturer in\n1930\nand then Reader in\n1948\n. He lectured to me\n[\nEFR\n]\nin\n1961\n-\n62\nwhen I took the General Class in Natural Philosophy at St Andrews. He retired in\n1963\n.\nJack was a member of the\nEdinburgh Mathematical Society\n, joining in December\n1920\nimmediately after graduating from Edinburgh with his first degree. He was also a fellow of the Institute of Physics and a member of the St Andrews Preservation Society. He was elected to the\nRoyal Society of Edinburgh\non\n3\nMarch\n1930\n, his proposers being Herbert Stanley Allen,\nHerbert Westren Turnbull\n, William Saddler,\nCharles Glover Barkla\n.\nAn obituary, written by\nE T Copson\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1976\n, pages\n54\n-\n55\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nDavid Jack married Isabel Grace Jack in\n1927\n; they had two sons."
}