{
  "nome_completo": "David Jackson Tweedie",
  "nome_curto": "David J Tweedie",
  "ano_nascimento": "1870",
  "ano_morte": "1926",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tweedie_D_J/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Stichill, Roxburgh, Scotland",
  "biografia": "David J Tweedie\nwas one of several members of the Edinburgh Mathematical Society with the name of Tweedie. There is, rather confusingly, also a\nDavid Tweedie\nwho was a member at much the same time.\nDavid Tweedie's father was  David Tweedie\n(\nborn in Cleish, Kinrossshire about\n1847)\nwho was a colliery clerk and book keeper. His mother was  Jemima Tweedie\n(\nborn in Perth, Perthshire about\n1845)\n. He had several younger siblings, Marjory\n(\nborn about\n1875\nwho was a Pupil Teacher in\n1891)\n, Alice\n(\nborn about\n1877)\n, James\n(\nborn\n1881)\nand John\n(\nborn about\n1885)\n.\nTweedie obtained passes at Higher level in Latin, Greek, and Mathematics. After having passed the Preliminary Examination he first matriculated at the University of Edinburgh in October\n1889\n. He seems to have set out on a course studying classics for he took courses in English, Latin and Greek during his first three years of university study. However in\n1892\nhe began to take courses in Mathematics, Natural Philosophy and Chemistry. He graduated with an M.A. in\n1895\nbut there is no record of him taking Honours courses so it appears that he graduated with a broad Ordinary degree.\nTweedie married Jeanie\n(\nJessie\n)\nFleming Allison on\n13\nApril\n1879\nand they had children: Jean\n(\nEna\n)\n(1898\n-\n1963)\nand David\n(1901\n-\n1987)\n.\nIn January\n1897\nTweedie joined the\nEdinburgh Mathematical Society\n. At this time he was teaching at George Heriot's Hospital School in Edinburgh. In the following year he was appointed as Headmaster, Public School, Kilconquhar, Fife. The move from Edinburgh seems to have made Tweedie decide that his membership of the\nEdinburgh Mathematical Society\nwas not now useful, and he left the Society in the following year."
}