{
  "nome_completo": "David Eisenbud",
  "nome_curto": "David Eisenbud",
  "ano_nascimento": "1947",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Eisenbud/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "David Eisenbud\n's parents were Leonard Eisenbud and Ruth-Jean Rubinstein. Leonard Eisenbud's parents, Boris and Katherine Eisenbud, were Russian but had emigrated to the United States in\n1902\n. Leonard Eisenbud\n(1913\n-\n2004)\nwas a student of\nEugene Wigner\nand together they co-authored the important book\nNuclear Structure\n(1958)\n. During World War II, Leonard had undertaken research on radar, and with\nWigner\n, had lectured on quantum mechanics at the Clinton Laboratories at Oak Ridge. In\n1947\n, shortly after their son David was born, the Eisenbuds moved to a newly purchased house in Patchogue after accepting the offer to join the new Brookhaven National Laboratory's Physics Department situated on Long Island, Upton, New York. Francis Bonner describes what happened next\n[\n2\n]\n:-\nI hadn't been there very long when I was shocked to learn that Leonard Eisenbud's \"Q\" clearance was in jeopardy: he had received an \"interrogatory\" asking him to respond to a broad range of questions about his and his wife's political affiliations. It was no secret that Ruth-Jean's mother and sister were members of the Communist Party, and the charges against Leonard began and wandered off from there. Indignant and dispirited, and believing the probability of his receiving clearance to be vanishingly small, Leonard chose not to pursue it to the stage of formal hearings and left to accept an appointment at the Bartol Research Foundation in Swarthmore, PA.\nDavid Eisenbud was brought up in Swarthmore where his father worked until\n1958\nwhen the State University of New York set up the State University College on Long Island at Oyster Bay, and Leonard Eisenbud was appointed Professor of Physics and Acting Chairman of the Department of Physics. So far we have not mentioned the career of David's mother Ruth-Jean Eisenbud\n(1915\n-\n2004)\n- we should note that she was a childhood polio victim but went on to become a psychotherapist and a professor at New York University and Adelphi University.\nEisenbud entered the University of Chicago where he went on to undertake both undergraduate and graduate studies. He was only nineteen years old when he graduated with a B.S. in\n1966\nand continued to graduate studies, being awarded his Master's degree in\n1967\n. He then undertook research with his thesis advisor\nSaunders Mac Lane\nbut he was given considerable help by J C Robson whom he considered as an unofficial advisor. He wrote of\nMac Lane\n:-\nHe was a great figure, and very important for me personally.\nBut others at Chicago were also strong influences on the young Eisenbud\n[\n1\n]\n:-\nWhile I was a graduate student at the University of Chicago\n(1967\n-\n1970)\n, I listened at every chance I got to the beautiful lectures of\nIrving Kaplansky\n. He was then just finishing his book 'Commutative Rings', and lectured from it. I admired him and it a great deal, but - in the style of a rebellious adolescent - I was quite ready to proclaim that a lot was left out.\nOn\n3\nJune\n1970\n, Eisenbud married Monika Margarete Schwabe; they had two children David and Alina. Also in\n1970\n, Eisenbud received his Ph.D. from Chicago for his thesis on non-commutative ring theory\nTorsion Modules over Dedekind Prime Rings\n. Eisenbud's first paper was not on ring theory, however, but rather on group theory with\nGroups of order automorphisms of certain homogeneous ordered sets\n(1969)\n. In\n1970\nhe published a number of papers on non-commutative ring theory:\nSubrings of Artinian and Noetherian rings\n;\n(\nwith J C Robson\n)\nModules over Dedekind prime rings\n; and\n(\nwith J C Robson\n)\nHereditary Noetherian prime rings\n. He was appointed as a lecturer at Brandeis University in\n1970\nand taught there for twenty-seven years. J C Robson, an English ring theorist, was at the University of Leeds in England and Eisenbud visited him in\n1971\n[\n1\n]\n:-\nIn the fall of\n1971\n, visiting at the University of Leeds in England, I had a chance to lecture on ... Noether normalization\n(\nin a version borrowed from\nNagata\n's book, 'Local Rings'\n)\n.\nHe was promoted at Brandeis University to Assistant Professor in\n1972\n. In the following year, he was awarded a Sloan Foundation Fellowship which allowed him to spend the two academic years\n1973\n-\n75\non research visits. He was a visiting scholar at Harvard University during\n1973\n-\n74\nand then was an invited speaker at the International Congress of Mathematicians in Vancouver in August\n1974\n. Continuing his research visits, he was a Fellow at the Institut des Hautes Études Scientiques\n(\nBures-Sur-Yvette\n)\nduring\n1974\n-\n75\n:-\n... thoroughly enjoying the French for their mathematics, culture, and good life. ... About half way through that year I was invited by Wolfgang Vogel, whom I had never met, to come to Halle, in East Germany, to visit, give a lecture, and discuss mathematics. ...  A refugee from neighbouring Leipzig when she was five, my wife hadn't been back since then and came along. The trip seemed exotic and slightly risky.  We had plenty of adventures that first visit! On the train from Leipzig to Halle my wallet - with my passport - mysteriously disappeared from my coat, a loss that we discovered as soon as I tried to check in at the University guest house.\nReturning to Brandeis University, Eisenbud was promoted to Associate Professor in\n1976\n. He was a Visiting Professor at the University of Bonn during the academic year\n1979\n-\n80\n, then promoted to full professor at Brandeis in\n1980\n.\nBarry Mazur\ndescribes his research achievements in\n[\n9\n]\n. We give some extracts:-\nDavid Eisenbud's research accomplishments extend broadly through algebra and its applications. His publications\n(\nover a hundred of them!\n)\nhave made significant contributions to fundamental issues in the subject. David also has a marvelous gift for mathematical collaboration. The sweep of his interests and the intensity of his mathematical interactions have brought him into fruitful co-authorship with many mathematicians of different backgrounds and different viewpoints.\nShortly after his graduate days, David began a joint project with Buchsbaum. Among other things, they established an elegant geometric criterion for exactness of a finite free complex that has many applications in the homological study of commutative rings. ... In the middle\n1970\ns David worked with Harold Levine on the topology of finite C\n∞\nmap germs ...\nV I Arnold\nonce referred to\n[\nthe\n]\ncelebrated formula of Eisenbud-Levine, which links calculus, algebra and geometry, as a \"paradigm\" more than a theorem that provides a local manifestation of interesting global invariants and that \"would please\nPoincaré\nand\nHilbert\n(\nalso\nEuler\n,\nCauchy\nand\nKronecker\n, to name just those classical mathematicians, whose works went in the same direction\n)\n.\" Given this early work, it was natural for David's attention to turn to the study of singularities and their topology. In this period, David wrote a book with the topologist Walter Neumann\n[\na son of\nBernhard Neumann\nand\nHanna Neumann\n]\non the topology of the complements of the sort of knots that appear in the theory of plane-curve singularities. David next became interested in\nalgebraic geometry\n, beginning a long and important collaboration with Joe Harris. Together, they developed the theory of Limit Linear Series and used it to solve a number of classical problems about the moduli spaces of complex algebraic curves.\nDuring\n1982\n-\n84\n, Eisenbud was Chairman of the Department of Mathematics at Brandeis University. Following this he again took research leave spending the academic year\n1986\n-\n87\nas a Visiting Professor at the Mathematical Sciences Research Institute at Berkeley and the following academic year as a Visiting Professor at Harvard University. Back at Brandeis, he was again Chairman of the Department of Mathematics during\n1992\n-\n94\n. He made a research visit after this period as Chairman, spending the autumn term of\n1994\nat Harvard University and the spring term of\n1995\nat l'Institut\nHenri Poincaré\nin Paris. In\n1997\nhe was appointed as Director of the Mathematical Sciences Research Institute\n(\nMSRI\n)\nat Berkeley and a Professor at University of California, Berkeley. Although in some sense these two posts were complementary, we should note that MSRI is not part of the University of California. This has advantages in that it gives it independence, but it also means that it is far less secure financially as it stands alone. There were many challenges and opportunities for Eisenbud taking on this new post\n[\n4\n]\n:-\nMSRI is a large operation, with about\n1\n,\n300\nvisitors coming through each year and about\n85\nin residence at any one time. It is also large in terms of its coverage of mathematics. Over the years it has hosted programs in mathematical economics, mathematical biology, string theory, and statistics, as well as in a wide variety of areas in pure mathematics. Indeed, Eisenbud notes that a distinctive feature of MSRI in the world of mathematics institutes is its combination of pure and applied areas. As he puts it, \"We have continued to have a fundamental emphasis, and we mix it with applied areas.\"\nHowever, he took up the post wanting to be far more than an administrator\n[\n7\n]\n:-\nEisenbud is looking forward not only to being the director of MSRI but also to being a mathematician there. \"My own work has involved a number of different fields, and I like learning mathematics a lot,\" he remarks. \"So I feel that I'll profit personally by the flow of mathematics through there, as well as helping the Institute.\"\nHe held this position as director for ten years and, during that time, he was also president of the\nAmerican Mathematical Society\nfrom\n2003\nto\n2005\n. In fact the excellent work he was doing at MSRI was a factor in his election as president. Margaret Wright writes\n[\n9\n]\n:-\nDavid has served the mathematical community as chair of the mathematics department at Brandeis, on advisory and evaluation committees for the National Science Foundation, as a member of the Board on Mathematical Sciences, and as vice president of the AMS. But his service that is most visible nationally and internationally has been as director of MSRI, where he moved in\n1997\nafter twenty-seven years at Brandeis. A fundamental strength of mathematicians is their ability to generalize, and I believe that David's performance as AMS president can be predicted with high accuracy by generalizing from his success at MSRI. In fact, his leadership at MSRI exemplifies the qualities needed by the AMS president. With David as its director, MSRI has continued its tradition of superlative programs in fundamental mathematics while simultaneously expanding into a broader and more diverse selection of fields. David has furthered a deliberate policy of outreach into new areas, and MSRI's influence and reputation increasingly extend beyond core mathematics into areas on the boundaries between mathematics and science as well as into applications ranging from imaging to cryptography to finance.\nEisenbud has published a number of important books. In\n1982\n, in collaboration with Corrado De Concini and Claudio Procesi, he published the monograph\nHodge algebras\n. Three years later, this time in collaboration with Walter Neumann, he published\nThree-dimensional link theory and invariants of plane curve singularities\n. In\n1992\n, in collaboration with Joe Harris, he produced\nSchemes. The language of modern algebraic geometry\n. Alexey Rudakov writes in a review:-\nThis book is intended to introduce basic notions of modern algebraic geometry. These are schemes in general, affine schemes, projective schemes and the functor of points. The authors discuss the motivation behind most of their definitions and give many examples. The reader who works through them will become comfortable with schemes as far as flatness and characterization of a space by its functor of points are concerned, as well as with the notion itself. These topics are important in the developing field of noncommutative geometry, where scheme-theoretic thinking is involved, and this book provides a good exposition for students.\nHis most significant book, however, was\nCommutative algebra: With a view toward algebraic geometry\nwhich was published in\n1995\n. Matthew Miller begins a detailed review with the following paragraph:-\nWith so many texts on commutative algebra available, one's reaction to this one might be \"Why yet another one?\", and \"Why is it so fat?\" The answer to the second question answers the first as well - this text has a distinctively different flavour than existing texts, both in coverage and style. Motivation and intuitive explanations appear throughout, there are many worked examples, and both text and problem sets lead up to contemporary research.\nThis important book earned Eisenbud the\n2010\nSteele prize from the\nAmerican Mathematical Society\n. The citation indicates why the book is so significant:-\nEisenbud's book was designed with several purposes in mind. One was to provide an updated text on basic commutative algebra reflecting the intense activity in the field during the author's life. Another was to provide algebraic geometers, commutative algebraists, computational geometers, and other users of commutative algebra with a book where they could find results needed in their fields, especially those pertaining to algebraic geometry. But even more, Eisenbud felt that there was a great need for a book which did not present pure commutative algebra leaving the underlying geometry behind. In his introduction he writes, \"It has seemed to me for a long time that commutative algebra is best practised with knowledge of the geometric ideas that played a great role in its formation: in short, with a view toward algebraic geometry.\"\nTwo further books by Eisenbud are important.\nThe geometry of schemes\n(2000)\n, again written with Joe Harris:-\n... is a wonderful introduction to the way of looking at algebraic geometry introduced by\nAlexandre Grothendieck\nand his school. The style of this book, however, differs greatly from that of\nBourbaki\n; it is not formal and systematic, but friendly and inviting .... Thus this book introduces big ideas with seemingly simple, concrete examples, generalizes from them to an appropriate abstract formulation, and then applies the concept to interesting classical problems in a meaningful way. It is a pleasure to read.\nFinally we mention Eisenbud's\n2005\nbook\nThe geometry of syzygies. A second course in commutative algebra and algebraic geometry\nand look forward to further fascinating books.\nWe have noted several honours given to Eisenbud, including the\n2010\nSteele Prize, but among those we have not yet mentioned is his election to the\nAmerican Academy of Arts and Sciences\nin\n2006\nand the creation of the Eisenbud Professorship at Berkeley's Mathematical Sciences Research Institute made possible by a US$\n10\nmillion gift from the Simons Foundation in May\n2007\n. We end this biography with his own descriptions of his non-mathematical interests:-\nMy interests outside mathematics include hiking, juggling, and, above all, music. Originally a flutist, I now spend most of my musical time singing art-songs\n(\nSchubert, Schumann, Brahms, Debussy, ...\n)\n."
}