{
  "nome_completo": "David Kennedy-Fraser",
  "nome_curto": "David Kennedy Fraser",
  "ano_nascimento": "1888",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kennedy-Fraser/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Milngavie, Dunbartonshire, Scotland",
  "biografia": "David Kennedy Fraser\n's father was  Alec Yule Fraser\n(1850\n-\n1890)\n. His mother was  Marjory Kennedy\n(1857\n-\n1930)\n. David's father died when he was two years old. His mother, Marjory, then lived in Mayfield Road, Edinburgh, with her own mother Elizabeth Kennedy and her two sisters Margaret and Jessie. David had a younger sister, Helen\n(\nborn\n1890)\n.\nDavid Kennedy Fraser attended George Watson's Boys' College in his home town of Edinburgh from\n1893\nto\n1904\n. Fraser passed Latin at Higer level in the Scottish Leaving Certificate examinations in\n1903\n, then, also at the Higher grade, Mathematics\n(\nHonours\n)\n, Dynamics, and English in the following year. After having passed the Preliminary Examination for Edinburgh University, he first matriculated there in October\n1904\nat the age of sixteen. When he first matriculated he gave his address as\n3\nMayfield Road, Edinburgh, but it was scored out and replaced by\n95\nA George Street, Edinburgh.\nIn\n1904\n-\n05\n, his first year of study, he took classes at Ordinary level in Mathematics, Latin, and Natural Philosophy. In\n1905\n-\n06\nhe studied Logic and Chemistry at Ordainary level and Intermediate Mathematics at Honours level. After taking a Chemistry Laboratory course in the summer of\n1906\n, he then studied Honours Advanced Mathematics in\n1906\n-\n07\n. He took courses on Electricity, and Constitution of matter in the summer of\n1907\n, then, in session\n1907\n-\n08\n, he took Honours courses on Advanced Mathematics, Dynamics and Thermodynamics, and Electrostatics. He completed his degree with courses on Electrokinetics and on Function Theory in\n1908\n-\n09\n.\nKennedy-Fraser was awarded a B.Sc.\n(\nPure\n)\nin\n1908\nand an M.A. with Second Class Honours in Mathematics and Natural Philosophy in\n1909\n. He then studied at the University of Leipzig and at Moray House in Edinburgh before going to the Cornell University in\n1913\nto study under G M Whipple. In the following year he was appointed Assistant Professor in the Department of Education at Cornell University. In May\n1914\nCornell University newspaper contained this report:-\nD Kennedy Fraser, a graduate of the University of Edinburgh, was elected assistant professor in the department of education, on account of the coming retirement of Professor De Garmo. Mr Fraser studied at the Teachers' Training College at Edinburgh and also at the University of Leipzig. During the last year he has been a student here under Professor G M Whipple.\nIn October\n1914\nthere was a further report:-\nDr D Kennedy-Fraser, a graduate of the University of Edinburgh, who was assistant in the educational laboratory in\n1913\n-\n14\n, has been appointed assistant professor of education for the coming year. He will carry on the courses of instruction announced by Dr Whipple and will have full charge of the educational laboratory. Dr Fraser is a man of broad education, thoroughly conversant with his field, and familiar with the methods which have made the work of the educational laboratory famous.\nBack in Scotland, Kennedy-Fraser was appointed as a Lecturer in Education at Edinburgh University in\n1919\nand also at Moray House. He held these posts until\n1923\nwhen he was appointed as a Psychologist to Glasgow Education Authority and at the same time Lecturer in Psychology at Jordanhill Training College.\nDavid Kennedy Fraser joined the\nEdinburgh Mathematical Society\nin June\n1908\nwhile he was still a student at the University of Edinburgh. He served the Society as a member of the library committee from November\n1908\n, remaining in the post for several years. He was elected to the\nRoyal Society of Edinburgh\non\n4\nMarch\n1929\n, his proposers being James Drever,\nGeorge Alexander Carse\n, James Hartley Ashworth,\nSir Edmund T Whittaker\n.\nAn obituary, written by 'A Former Colleague', appears in the\nRoyal Society of Edinburgh\nYear Book\n1963\n, pages\n18\n-\n19\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nHe was also a Fellow of the British Psychological Society, and of the Educational Institute of Scotland."
}