{
  "nome_completo": "David Gale",
  "nome_curto": "David Gale",
  "ano_nascimento": "1921",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gale/",
  "lugar_nascimento": "Manhattan, New York, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "David Gale\nwas born in Manhattan. During the years in which he was growing up and attending school, his home was sometimes in New York City, sometimes in the surrounding district. He studied at Swarthmore College, Swarthmore, Pennsylvania, and was awarded a B.A. in mathematics in\n1943\n. He then went to the University of Michigan to study for a Master's Degree which he was awarded in\n1947\n. For his doctoral research he went to Princeton where he undertook research in game theory with\nAlbert W Tucker\nas his thesis advisor. He was a Procter Fellow during\n1948\nand received a Ph.D. in\n1949\nfor his thesis\nSolutions of Finite Two-Person Games\n.\nIn\n1950\nGale published a number of papers with various coauthors. Related to his thesis were the papers\n(\nwith S Sherman\n)\nSolutions of finite two-person games\n, and two papers written jointly with H W Kuhn and\nA W Tucker\n,\nOn symmetric games\n, and\nReductions of game matrices\n. The paper on symmetric games shows that if a zero-sum two-person game has an\nm\n×\nn\nm \\times  n\nm\n×\nn\npay-off matrix, then an optimal solution is immediately derivable from an optimal solution of a symmetric zero-sum two-person game with a square pay-off matrix of order\nm\n+\nn\n+\n1\nm+n+1\nm\n+\nn\n+\n1\n. The paper on reductions examines several types of transformations which can be applied to the pay-off matrix\nA\nA\nA\nof a zero-sum two-person game to yield a matrix\nA\n∗\nA^{*}\nA\n∗\n. In each case the matrix\nA\n∗\nA^{*}\nA\n∗\nhas fewer rows and/or columns than\nA\nA\nA\n, so that the game with pay-off matrix\nA\n∗\nA^{*}\nA\n∗\nis in general easier to study than the matrix\nA\nA\nA\n. Also in\n1950\nhe published\nCompact sets of functions and function rings\nin which he generalised S B Myers' characterization of compact sets of mappings of a space\nX\nX\nX\n(\neither locally compact or satisfying the first countability axiom\n)\ninto a metric space\nY\nY\nY\n.\nWe mention one further paper which in many ways is typical of the delightfully simple yet deep questions that Gale often investigated. In\n1956\nhe published\nNeighboring vertices on a convex polyhedron\nwhich was summarised by\nDonald Coxeter\nas follows:-\nRemarking that Kuhn has discovered\n(\noral communication\n)\na polytope in eleven dimensions such that every two vertices form an edge\n(\nso that there are no \"diagonals\"\n)\n, the author proves that such a phenomenon already arises in four dimensions\n(\nfor any given number of vertices\n)\n. In fact, he gives an ingenious but indirect proof that for any two integers\nm\n>\n0\n,\nn\n>\n2\nm\nm > 0, n > 2m\nm\n>\n0\n,\nn\n>\n2\nm\n, there exists a\n2\nm\n2m\n2\nm\n-dimensional polytope having\nn\nn\nn\nvertices of which every\nm\nm\nm\nform a simplex which is an\n(\nm\n−\n1\n)\n(m-1)\n(\nm\n−\n1\n)\n-dimensional element\n(\ne.g. an edge when\nm\n=\n2\nm = 2\nm\n=\n2\n)\n.\nFollowing the award of his doctorate from Princeton, Gale spent the year\n1949\n-\n50\nas an Instructor in Mathematics at Princeton. He was then appointed to the mathematics department of Brown University in Providence, Rhode Island. He spent fifteen years at Brown, but spent time away in other institutions, for example in Denmark in\n1953\n-\n54\nafter being awarded a Fulbright Research Fellowship, and taking the year\n1957\n-\n8\nas a sabbatical at the RAND Corporation in Santa Monica, California. He was a Guggenheim Fellow during\n1962\n-\n63\n, then left Brown in\n1965\n, spending the year\n1965\n-\n66\nas Miller Professor at the University of California at Berkeley. In\n1966\nhe was appointed as a full professor in both mathematics and operations research at Berkeley, being also appointed to the economics faculty in the following year. He remained at Berkeley for the rest of his career.\nHe met Julie B Skeby while he was in Denmark in\n1953\n. They later married and had three daughters, Karen, Katharine, and Kirsten. The marriage ended in divorce in\n1974\n. He died at Alta Bates Medical Center in Berkeley after a heart attack.\nLet us look now at some of Gale's books since this gives a good overview of both his research interests and of courses he taught. In\n1957\nhe published\nThe theory of matrix games and linear economic models\nwriting in the Introduction:-\nThese notes are based on lectures given as part of a graduate course in the Mathematics Department of Brown University ... Their purpose is to give a unified mathematical treatment of ... linear economic models..\nR Solow writes in a review:-\nThe result is an extraordinarily neat and compact survey of zero-sum two-person games, linear programming, pure exchange models\n(\nand, implicitly, the elementary properties of finite Markov chains\n)\n, and pure production models of the Leontiev and\nvon Neumann\ntypes. Economic interpretations are usually given, but on the whole the treatment is abstract.\nIn\n1960\nGale published\nThe theory of linear economic models\n. R M Thrall writes about this book:-\n... the author has brought together a surprising variety of linear mathematics with appropriate applications. ... An important feature of the book is the substantial collection of problems at the end of each chapter. These are not mere routine exercises but contain substantial theorems extending the development in the body of the text. Since the text itself is very lean and meaty these problems should aid the reader to add some desirable intuitive \"fat\".\nGale wrote the Mathematical Entertainments column of\nThe Mathematical Intelligencer\nfrom\n1991\nto\n1997\n. In\n1998\nhe published these articles in the book\nTracking the automatic ant. And other mathematical explorations\n.\nGale received many honours and prizes for his outstanding contributions. In particular he was awarded the\nLester Ford\nPrize\n1979\n-\n80\n, and the\nJohn von Neumann\nTheory Prize,\n1980\n. The prestigious\nJohn von Neumann\nTheory Prize was awarded jointly to David Gale, Harold W Kuhn, and\nAlbert W Tucker\n:-\nTheir research played a seminal role in laying the foundations of game theory, linear and non-linear programming - work that continues to be of fundamental importance to modern operations research and management science. The early research of the founders of the 'Princeton School,' concerned the mathematical theory of linear inequalities as applied to linear programs, matrix games, the now-classical formulations of symmetric games, games in extensive form,\nn\nn\nn\n-person games, games of perfect recall, and the value of information. The list of their accomplishments, not to mention distinguished students and collaborators, is too long to present in detail. Pure mathematics played a strong role in their research. ... Gale's research is known for its mathematical elegance. His contributions range from optimal assignment problems in a general setting to major contributions to mathematical economics such as his solution of the\nn\nn\nn\n-dimensional 'Ramsey Problem' and his important theory of optimal economic growth.\nMany paid tribute to Gale after his death. Kenneth Arrow, professor emeritus of economics at Stanford University who was awarded the Nobel Prize in economics in\n1972\n, wrote that Gale's\n[\n6\n]\n:-\n... intellectual depth, originality of insight, and thorough liveliness were apparent from the beginning and have remained a source of joy and inspiration to all of us. His life's influence is a permanent heritage.\nIn fact Alvin Roth, professor of economics at Harvard University, had nominated Gale for the Nobel Prize in economics. He wrote\n[\n6\n]\n:-\nI'm sorry that this now won't happen. But David's work will be remembered for generations to come, in books and journal articles and seminars and workshops, as well as in the very concrete allocation procedures that have been built upon his insights.\nGale's daughter Katharine\n[\n6\n]\n:-\n... recalled that her father would discuss his mathematical work at the dinner table and share with his children his fascination with chess puzzles, card games, puzzle blocks and interlocking puzzles, as well as with all types of math games. Throughout his life, Gale would insist that visitors look at the newest puzzle he was working on. According to his daughter, just before his death, Gale e-mailed a colleague to discuss the mathematics of Sudoku ...\nIn addition to his fascination with mathematical puzzles, Gale had several hobbies. He was an enthusiastic skier, tennis player, traveller and was very knowledgeable about jazz."
}