{
  "nome_completo": "David Ryan Hayes",
  "nome_curto": "David Hayes",
  "ano_nascimento": "1937",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hayes_David/",
  "lugar_nascimento": "Raleigh, North Carolina, USA",
  "lugar_morte": "Athol, Massachusetts, USA",
  "biografia": "David Hayes\n's parents were Woodrow R Hayes and Eleanor Crocker. Woodrow Hayes was a musician playing for the Jimmy Poyners Orchestra and as the bandleader of the Woody Hayes Trio. The autobiography\n[\n1\n]\nis dedicated by Woodrow Hayes to his:-\n... wife Eleanor of fifty years, who raised four beautiful children while I was on the road.\nIn addition to their son David, the subject of this biography, Woody and Eleanor Hayes had three daughters: Sally Hayes\n(\nnow Sally Stevens\n)\n, Betsy Hayes\n(\nnow Betsy Hunt\n)\n, and Jenny Hayes\n(\nnow Jenny Lewis\n)\n. David, like his father, attended Needham B Broughton High School in Raleigh, founded in\n1929\nand one of the oldest of the high schools in Wake County, graduating in the spring of\n1955\n. Later that year he entered Duke University, in Durham, North Carolina, where he majored in mathematics for his Bachelor's Degree which he was awarded in\n1959\n. He remained at Duke University undertaking research for his Ph.D. with\nLeonard Carlitz\nas his thesis advisor. Hayes writes\n[\n3\n]\n:-\nWhile a graduate student at Duke University in the early\n1960\ns, I was privileged to take\nLeonard Carlitz\n's course \"The arithmetic of polynomials.\" At the first class meeting, Leonard gave each student a detailed set of notes that served as a textbook for the course. These notes were neatly typed and reproduced by ditto machine, the leading-edge copying technique of that era. My own copy, still readable in faded ditto purple, occupies a special place on my office bookshelf. Of course the notes evolved over time. The version I have is\n277\npages long and divided into\n29\nchapters.\nHayes was awarded a Ph.D. by Duke University in\n1963\nfor his\n86\n-page thesis\nThe distribution of irreducibles in\nGF\n[\nq\n,\nx\n]\n[q, x]\n[\nq\n,\nx\n]\n. In it he studied the distribution of irreducibles in arithmetic progressions in a polynomial ring over a finite field. The main results of his thesis were published in a paper in the\nTransactions\nof the\nAmerican Mathematical Society\nin\n1965\n. This was not his first publication for he had published a\n2\n-page paper\nA polynomial analog of the Goldbach conjecture\nin the\nBulletin\nof the\nAmerican Mathematical Society\nin\n1963\n. In\n1965\nhe published\nA Goldbach theorem for polynomials with integral coefficients\nin the\nAmerican Mathematical Monthly\n.\nD E Littlewood\nwrites in a review:-\nThe author proves a theorem analogous to the\nGoldbach\nconjecture that every even integer greater than\n2\ncan be expressed as the sum of two primes.\nZ\n(\nx\n)\n\\mathbb{Z}(x)\nZ\n(\nx\n)\nis the domain of polynomials in x with integral coefficients. The theorem is that every polynomial of degree\nn\n≥\n1\nn ≥ 1\nn\n≥\n1\ncan be expressed as a sum of two irreducible polynomials each of degree n.\nAfter graduating with his Ph.D., Hayes was appointed as an assistant at the University of Tennessee in the autumn of\n1963\n. He worked there for three years before spending the academic year\n1966\n-\n67\nas a Postdoctoral Fellow at Harvard University. He was appointed as an Associate Professor of Mathematics at the University of Massachusetts in September\n1967\nand, five years later, in the autumn of\n1972\n, he was promoted to a full professorship at the University of Massachusetts. He remained on the faculty there until he retired in\n2002\n. He served as chairman of the Mathematics Department from\n1991\nto\n1994\n. During his career at Massachusetts, he was the thesis advisor to six Ph.D. students, Michael Nutt\n(\nPh.D.\n1974)\n, Gove Effinger\n(\nPh.D.\n1981)\n, Mizan Khan\n(\nPh.D.\n1990)\n, Daniel Carter\n(\nPh.D.\n1993)\n, Zesen Chen\n(\nPh.D.\n1996)\n, and Maura Murray\n(\nPh.D.\n1999)\n. In addition to his permanent position at Massachusetts, Hayes spent the academic year\n1974\n-\n75\nat the University of Oxford in England. He made research visits to Harvard University in autumn of\n1981\n, to the University of California at San Diego in autumn of\n1983\n, to Imperial College of Science and Technology in London, England, in the spring of\n1989\n, and to Harvard University in autumn of\n1999\n.\nMichael Rosen writes about some of Hayes other activities\n[\n4\n]\n:-\nFor many years David was a leading figure at the Five College Number Theory Seminar which is held weekly at Amherst College. In the summer of\n1991\n, David, along with David Goss and myself, organized a large conference\n(\nover\n100\nparticipants from all over the world\n)\nat Ohio State University on the subject of \"The Arithmetic of Function Fields\". The conference proceedings were published a year later by Walter de Gruyter Publishers. David Hayes and I also organized a three day conference \"A Mini-Conference on the Arithmetic of Function Fields\" held at Brown University in April of\n1996\n.\nLet us look at some of Hayes' publications. In\n1966\n-\n67\nhe published three papers\nA polynomial generalized Gauss sum\n,\nThe expression of a polynomial as a sum of three irreducibles\n, and\nA geometric approach to permutation polynomials over a finite field\n. A permutation polynomial is one for which the associated polynomial function is a one-to-one mapping of a finite field into itself.\nL E Dickson\nclassified all permutation polynomials of degree less than seven over a finite field. This classification showed that if the order of the finite field is sufficiently large there are no permutation polynomials of degree\n4\nor\n6\n. Hayes was able to show that, with certain extra conditions, this result generalised to show that if the finite field is sufficiently large there are no permutation polynomials of even degree. In the second of the three papers he published in\n1966\n-\n67\n, Hayes proved a polynomial version of\nVinogradov\n's theorem that every sufficiently large odd integer is the sum of three primes.\nHayes was an invited speaker at many conferences. For example at the 'Number Theory Conference' held at the University of Colorado, Boulder, Colorado in\n1972\nhe delivered the lecture\nAdelic analysis in additive number theory\n. He:-\n... discussed the\nHardy\n-\nLittlewood\ncircle method from the point of view of analysis on the ring of\nQ\n\\mathbb{Q}\nQ\n-adèles. The singular series associated with a given additive problem is interpreted as a certain\nRadon\n-\nNikodym\nderivative.\nAt the conference on 'Number theory related to\nFermat\n's last theorem' held at Cambridge, Massachusetts in\n1981\nhe gave the lecture\nElliptic units in function fields\n. Jürgen Ritter writes that, in the lecture, Hayes showed:-\n... that Robert's results on elliptic units in class fields H of an imaginary quadratic number field F have \"more or less\" exact analogues over a global function field with finite field of constants. ... The interested reader will certainly appreciate reading the introduction of the paper\n[\nin the conference proceedings\n]\n, in which the general strategy is laid out and which gives much more information ...\nAt the conference 'Applications of curves over finite fields' in Seattle, Washington, in\n1997\nhe delivered the lecture\nDistribution of minimal ideals in imaginary quadratic function fields\n. At the conference '\nStark\n's conjectures: recent work and new directions' he gave the lecture\nStickelberger functions for non-abelian Galois extensions of global fields\n. In fact the\nStark\nconjectures, both in number fields and in function fields, became the area of mathematics that he worked on most intensely during the last part of his career. We mentioned above that Hayes spent time at Harvard University in the autumn of\n1999\nand while he was there he delivered a series of lectures on the\nStark\nconjectures. He always intended to use these lectures as the basis for a monograph on the\nStark\nconjectures but he never completed the project. He did, however, publish a monograph in\n1991\nin collaboration with Gove Effinger\n(\na former Ph.D. student\n)\nentitled\nAdditive Number Theory of Polynomials Over a Finite Field\n.\nHayes' marriage to his first wife ended in divorce but there were three sons from that marriage, Robert Hayes, Christopher Hayes, and Jonathan Hayes. In November\n2004\nHayes married Irene\n(\nTruchinskas\n)\nBrown and became step-father to Carl Dickson, Mark Brown, and James Brown. David and Irene Hayes enjoyed travelling together but sadly they only had six years together before Hayes died on Sunday,\n10\nApril\n2011\n, at the Quabbin Valley Healthcare in Athol. Let us end this biography by quoting the personal comments by Michael Rosen who writes of Hayes' \"richness of his interests and the significance of his contributions\". Rosen writes\n[\n4\n]\n:-\nI want to make some comments on David's style as a mathematician. He was very serious about his work. He worked on subjects of fundamental mathematical importance and he went deeply into them. He had excellent taste and an abundance of mathematical talent, but also resolve and persistence. If a seemingly insuperable problem appeared, he would keep attempting a solution until all roadblocks were cleared and the way to further progress was open. I deeply admire his work. It is beautiful, important, and of lasting value. Let me conclude with a few personal comments. As time went by our professional relationship turned into a lasting personal friendship. We both liked the outdoors. During my visits to the Amherst area we would often go for hike in the surrounding countryside. My wife and I have a vacation home in New Hampshire. David would visit us there to hike in the autumn and ski in the winter. Of course, he and I would sneak in some mathematical discussions on the side, but mainly these were social occasions where everyone would enjoy the country air, the physical exertions, and the good comradeship. We also enjoyed good food and good wine. We would spend at least part of the evenings indulging in both. Many people who knew David describe him as very intelligent, quiet, modest, and gentle. This is all true. He was also very generous with his time and his ideas. In every way he was a person with exceptional qualities. It was a privilege to have known him and to have been his friend."
}