{
  "nome_completo": "Delfino Codazzi",
  "nome_curto": "Delfino Codazzi",
  "ano_nascimento": "1824",
  "ano_morte": "1873",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Codazzi/",
  "lugar_nascimento": "Lodi (now Italy)",
  "lugar_morte": "Pavia, Italy",
  "biografia": "Delfino Codazzi\nwas born and brought up in Lodi, the capital of the Lombardy region of northern Italy, lying on the right bank of the Adda River to the south east of Milan. His father was Domenico Codazzi. After completiing his education, Delfino taught mathematics and natural science at the secondary school in Lodi, then he moved to Pavia where he taught mathematics at the secondary school there. Although he was teaching in secondary schools, which one might have thought not the best place to undertake deep research, nevertheless this was an extremely important and productive period for Codazzi. His research led him into deep results in geometry and he began to think that submitting an entry for the Grand Prix of the Paris\nAcademy of Sciences\nwould let his research become known to the top mathematicians. The topic for the\n1859\nprize of the Academy was:-\n... to find all surfaces of a given linear element\nand this was exactly in the right area for Codazzi's research in\ndifferential geometry\n.\nThe\n1859\nPrize of the\nAcademy of Sciences\nhad three high quality entries. They were from the two Frenchmen\nBour\nand\nBonnet\n, and from the Italian Codazzi. All three pieces of work are important contributions to differential geometry but, although the manuscripts of\nBour\nand\nBonnet\nwere published  in\nComptes-Rendus des séances de l'Académie des sciences\nfairly soon after the prize was awarded, Codazzi's entry was not published until\n1883\n(10\nyears after his death\n)\n. Codazzi's submission for the prize contained a result which gave necessary and sufficient conditions for one surface to be mapped to another.  It also contained his famous formulas which proved important in the theory of surfaces. These are now called the Mainardi-Codazzi formulas and we explain below the role played by Gaspare Mainardi in their discovery. The formulas give two relations between the first and second quadratic forms over a surface together with an equation, already found by\nGauss\n, which gives necessary and sufficient conditions for the existence of a surface which admits two given quadratic forms.\nBonnet\nused Codazzi's formulas to prove an existence theorem in the theory of surfaces.\nCodazzi was not the first to discover these formulas since Mainardi, who taught at the University of Pavia, had published them in a paper of\n1856\n. The two mathematicians, however, made their discoveries completely independently of each other. Although the two contributions were equivalent, Codazzi gave a simpler formulation, and much wider applications than Mainardi. The article\n[\n3\n]\nshows that, in\n1853\n, Karl M Peterson, then a student of\nMinding\nat the University of Dorpat\n(\nnow named Tartu\n)\n, submitted a dissertation containing a derivation of two equations equivalent to those of Mainardi and Codazzi and outlining a proof of the fundamental theorem of surface theory.\nCertainly Codazzi became well known for his contributions to differential geometry and this led to his appointment to a chair of algebra and analytic geometry at the University of Pavia in\n1865\n. He was now in a much better position to extend his research with the security of a university post meaning he felt under far less pressure than he had before. His researches after his appointment were on curvilinear coordinates and he published these results in\nSulle coordinate curvilinee d'una superficie e dello spazio\nⓉ\n(\nOn the curvilinear coordinates of an area and space\n)\n, a five part paper the first of which appeared in\n1867\n, the second and third parts in the following year, with the final two parts in\n1870\nand\n1871\n. Although, as we mentioned above, Codazzi's submission for the\n1859\nGrand Prix was not published until ten years after his death, nevertheless his famous formulas appear in this five part paper. He remained at the University of Pavia for the rest of his life, although he only lived for a further eight years after his appointment to the chair of algebra and analytic geometry. He did, however, hold the chair of theoretical geodesics at Pavia for a while.\nCodazzi also published on isometric lines, geodesic triangles and the stability of floating bodies."
}