{
  "nome_completo": "Diophantus of Alexandria",
  "nome_curto": "Diophantus",
  "ano_nascimento": "200",
  "ano_morte": "284",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Diophantus/",
  "lugar_nascimento": "(probably) Alexandria, Egypt",
  "lugar_morte": "(probably) Alexandria, Egypt",
  "biografia": "Diophantus\n, often known as the 'father of algebra', is best known for his\nArithmetica\n, a work on the solution of algebraic equations and on the theory of numbers. However, essentially nothing is known of his life and there has been much debate regarding the date at which he lived.\nThere are a few limits which can be put on the dates of Diophantus's life. On the one hand Diophantus quotes the definition of a\npolygonal number\nfrom the work of\nHypsicles\nso he must have written this later than\n150\nBC. On the other hand\nTheon\nof Alexandria, the father of\nHypatia\n, quotes one of Diophantus's definitions so this means that Diophantus wrote no later than\n350\nAD. However this leaves a span of\n500\nyears, so we have not narrowed down Diophantus's dates a great deal by these pieces of information.\nThere is another piece of information which was accepted for many years as giving fairly accurate dates.\nHeath\n[\n3\n]\nquotes from a letter by Michael Psellus who lived in the last half of the\n11\nth\ncentury. Psellus wrote\n(\nHeath's translation in\n[\n3\n]\n)\n:-\nDiophantus dealt with\n[\nEgyptian arithmetic\n]\nmore accurately, but the very learned Anatolius collected the most essential parts of the doctrine as stated by Diophantus in a different way and in the most succinct form, dedicating his work to Diophantus.\nPsellus also describes in this letter the fact that Diophantus gave different names to powers of the unknown to those given by the Egyptians. This letter was first published by\nPaul Tannery\nin\n[\n7\n]\nand in that work he comments that he believes that Psellus is quoting from a commentary on Diophantus which is now lost and was probably written by\nHypatia\n. However, the quote given above has been used to date Diophantus using the theory that the Anatolius referred to here is the bishop of Laodicea who was a writer and teacher of mathematics and lived in the third century. From this it was deduced that Diophantus wrote around\n250\nAD and the dates we have given for him are based on this argument.\nKnorr\nin\n[\n16\n]\ncriticises this interpretation, however:-\nBut one immediately suspects something is amiss: it seems peculiar that someone would compile an abridgement of another man's work and then dedicate it to him, while the qualification \"in a different way\", in itself vacuous, ought to be redundant, in view of the terms \"most essential\" and \"most succinct\".\nKnorr\ngives a different translation of the same passage\n(\nshowing how difficult the study of Greek mathematics is for anyone who is not an expert in classical Greek\n)\nwhich has a remarkably different meaning:-\nDiophantus dealt with\n[\nEgyptian arithmetic\n]\nmore accurately, but the very learned Anatolius, having collected the most essential parts of that man's doctrine, to a different Diophantus most succinctly addressed it.\nThe conclusion of\nKnorr\nas to Diophantus's dates is\n[\n16\n]\n:-\n... we must entertain the possibility that Diophantus lived earlier than the third century, possibly even earlier that Heron in the first century.\nThe most details we have of Diophantus's life\n(\nand these may be totally fictitious\n)\ncome from the Greek Anthology, compiled by Metrodorus around\n500\nAD. This collection of puzzles contain one about Diophantus which says:-\n... his boyhood lasted\n1\n6\n\\large\\frac{1}{6}\\normalsize\n6\n1\n​\nth of his life; he married after\n1\n7\n\\large\\frac{1}{7}\\normalsize\n7\n1\n​\nth more; his beard grew after\n1\n12\n\\large\\frac{1}{12}\\normalsize\n1\n2\n1\n​\nth more, and his son was born\n5\nyears later; the son lived to half his father's age, and the father died\n4\nyears after the son.\nSo he married at the age of\n26\nand had a son who died at the age of\n42\n, four years before Diophantus himself died aged\n84\n. Based on this information we have given him a life span of\n84\nyears.\nThe\nArithmetica\nis a collection of\n130\nproblems giving numerical solutions of determinate equations\n(\nthose with a unique solution\n)\n, and indeterminate equations. The method for solving the latter is now known as\nDiophantine analysis\n. Only six of the original\n13\nbooks were thought to have survived and it was also thought that the others must have been lost quite soon after they were written. There are many Arabic translations, for example by\nAbu'l-Wafa\n, but only material from these six books appeared.\nHeath\nwrites in\n[\n4\n]\nin\n1920\n:-\nThe missing books were evidently lost at a very early date.\nPaul Tannery\nsuggests that\nHypatia\n's commentary extended only to the first six books, and that she left untouched the remaining seven, which, partly as a consequence, were first forgotten and then lost.\nHowever, an Arabic manuscript in the library Astan-i Quds\n(\nThe Holy Shrine library\n)\nin Meshed, Iran has a title claiming it is a translation by Qusta ibn Luqa, who died in\n912\n, of Books IV to VII of\nArithmetica\nby Diophantus of Alexandria. F Sezgin made this remarkable discovery in\n1968\n. In\n[\n19\n]\nand\n[\n20\n]\nRashed compares the four books in this Arabic translation with the known six Greek books and claims that this text is a translation of the lost books of Diophantus. Rozenfeld, in reviewing these two articles is, however, not completely convinced:-\nThe reviewer, familiar with the Arabic text of this manuscript, does not doubt that this manuscript is the translation from the Greek text written in Alexandria but the great difference between the Greek books of Diophantus's Arithmetic combining questions of algebra with deep questions of the theory of numbers and these books containing only algebraic material make it very probable that this text was written not by Diophantus but by some one of his commentators\n(\nperhaps\nHypatia\n?\n)\n.\nIt is time to take a look at this most outstanding work on algebra in Greek mathematics. The work considers the solution of many problems concerning linear and\nquadratic equations\n, but considers only positive\nrational\nsolutions to these problems. Equations which would lead to solutions which are negative or\nirrational\nsquare roots, Diophantus considers as useless. To give one specific example, he calls the equation\n4\n=\n4\nx\n+\n20\n4 = 4x + 20\n4\n=\n4\nx\n+\n2\n0\n'absurd' because it would lead to a meaningless answer. In other words how could a problem lead to the solution -\n4\nbooks? There is no evidence to suggest that Diophantus realised that a quadratic equation could have two solutions. However, the fact that he was always satisfied with a rational solution and did not require a whole number is more sophisticated than we might realise today.\nDiophantus looked at three types of quadratic equations\na\nx\n2\n+\nb\nx\n=\nc\n,\na\nx\n2\n=\nb\nx\n+\nc\nax^{2} + bx = c, ax^{2} = bx + c\na\nx\n2\n+\nb\nx\n=\nc\n,\na\nx\n2\n=\nb\nx\n+\nc\nand\na\nx\n2\n+\nc\n=\nb\nx\nax^{2} + c = bx\na\nx\n2\n+\nc\n=\nb\nx\n. The reason why there were three cases to Diophantus, while today we have only one case, is that he did not have any notion for zero and he avoided negative coefficients by considering the given numbers\na\n,\nb\n,\nc\na, b, c\na\n,\nb\n,\nc\nto all be positive in each of the three cases above.\nThere are, however, many other types of problems considered by Diophantus. He solved problems such as pairs of simultaneous quadratic equations.\nConsider\ny\n+\nz\n=\n10\n,\ny\nz\n=\n9\ny + z = 10, yz = 9\ny\n+\nz\n=\n1\n0\n,\ny\nz\n=\n9\n. Diophantus would solve this by creating a single quadratic equation in x. Put\n2\nx\n=\ny\n−\nz\n2x = y - z\n2\nx\n=\ny\n−\nz\nso, adding\ny\n+\nz\n=\n10\ny + z = 10\ny\n+\nz\n=\n1\n0\nand\ny\n−\nz\n=\n2\nx\ny - z = 2x\ny\n−\nz\n=\n2\nx\n, we have\ny\n=\n5\n+\nx\ny = 5 + x\ny\n=\n5\n+\nx\n, then subtracting them gives\nz\n=\n5\n−\nx\nz = 5 - x\nz\n=\n5\n−\nx\n. Now\n9\n=\ny\nz\n=\n(\n5\n+\nx\n)\n(\n5\n−\nx\n)\n=\n25\n−\nx\n2\n9 = yz = (5 + x)(5 - x) = 25 - x^{2}\n9\n=\ny\nz\n=\n(\n5\n+\nx\n)\n(\n5\n−\nx\n)\n=\n2\n5\n−\nx\n2\n, so\nx\n2\n=\n16\n,\nx\n=\n4\nx^{2} = 16, x = 4\nx\n2\n=\n1\n6\n,\nx\n=\n4\nleading to\ny\n=\n9\n,\nz\n=\n1\ny = 9, z = 1\ny\n=\n9\n,\nz\n=\n1\n.\nIn Book III, Diophantus solves problems of finding values which make two linear expressions simultaneously into squares. For example he shows how to find\nx\nx\nx\nto make\n10\nx\n+\n9\n10x + 9\n1\n0\nx\n+\n9\nand\n5\nx\n+\n4\n5x + 4\n5\nx\n+\n4\nboth squares\n(\nhe finds\nx\n=\n28\nx = 28\nx\n=\n2\n8\n)\n. Other problems seek a value for\nx\nx\nx\nsuch that particular types of polynomials in\nx\nx\nx\nup to degree\n6\nare squares. For example he solves the problem of finding\nx\nx\nx\nsuch that\nx\n3\n−\n3\nx\n2\n+\n3\nx\n+\n1\nx^{3} - 3x^{2} + 3x + 1\nx\n3\n−\n3\nx\n2\n+\n3\nx\n+\n1\nis a square in Book VI. Again in Book VI he solves problems such as finding\nx\nx\nx\nsuch that simultaneously\n4\nx\n+\n2\n4x + 2\n4\nx\n+\n2\nis a cube and\n2\nx\n+\n1\n2x + 1\n2\nx\n+\n1\nis a square\n(\nfor which he easily finds the answer\nx\n=\n3\n2\nx = \\large\\frac{3}{2}\\normalsize\nx\n=\n2\n3\n​\n)\n.\nAnother type of problem which Diophantus studies, this time in Book IV, is to find powers between given limits. For example to find a square between\n5\n4\n\\large\\frac{5}{4}\\normalsize\n4\n5\n​\nand\n2\nhe multiplies both by\n64\n, spots the square\n100\nbetween\n80\nand\n128\n, so obtaining the solution\n25\n16\n\\large\\frac{25}{16}\\normalsize\n1\n6\n2\n5\n​\nto the original problem. In Book V he solves problems such as writing\n13\nas the sum of two square each greater than\n6\n(\nand he gives the solution\n66049\n10201\n\\large\\frac{66049}{10201}\\normalsize\n1\n0\n2\n0\n1\n6\n6\n0\n4\n9\n​\nand\n66564\n10201\n\\large\\frac{66564}{10201}\\normalsize\n1\n0\n2\n0\n1\n6\n6\n5\n6\n4\n​\n)\n. He also writes\n10\nas the sum of three squares each greater than\n3\n, finding the three squares\n1745041\n505521\n,\n1651225\n505521\n,\n1658944\n505521\n\\large\\frac{1745041}{505521}\\normalsize , \\large\\frac{1651225}{505521}\\normalsize , \\large\\frac{1658944}{505521}\\normalsize\n5\n0\n5\n5\n2\n1\n1\n7\n4\n5\n0\n4\n1\n​\n,\n5\n0\n5\n5\n2\n1\n1\n6\n5\n1\n2\n2\n5\n​\n,\n5\n0\n5\n5\n2\n1\n1\n6\n5\n8\n9\n4\n4\n​\n.\nHeath\nlooks at\nnumber theory\nresults of which Diophantus was clearly aware, yet it is unclear whether he had a proof. Of course these results may have been proved in other books written by Diophantus or he may have felt they were \"obviously\" true due to his experimental evidence. Among such results are\n[\n4\n]\n:-\n... no number of the form\n4\nn\n+\n3\n4n + 3\n4\nn\n+\n3\nor\n4\nn\n−\n1\n4n - 1\n4\nn\n−\n1\ncan be the sum of two squares;\n... a number of the form\n24\nn\n+\n7\n24n + 7\n2\n4\nn\n+\n7\ncannot be the sum of three squares.\nDiophantus also appears to know that every number can be written as the sum of four squares. If indeed he did know this result it would be truly remarkable for even\nFermat\n, who stated the result, failed to provide a proof of it and it was not settled until\nLagrange\nproved it using results due to\nEuler\n.\nAlthough Diophantus did not use sophisticated algebraic notation, he did introduce an algebraic symbolism that used an abbreviation for the unknown and for the powers of the unknown. As Vogel writes in\n[\n1\n]\n:-\nThe symbolism that Diophantus introduced for the first time, and undoubtedly devised himself, provided a short and readily comprehensible means of expressing an equation... Since an abbreviation is also employed for the word \"equals\", Diophantus took a fundamental step from verbal algebra towards symbolic algebra.\nOne thing will be clear from the examples we have quoted and that is that Diophantus is concerned with particular problems more often than with general methods. The reason for this is that although he made important advances in symbolism, he still lacked the necessary notation to express more general methods. For instance he only had notation for one unknown and, when problems involved more than a single unknown, Diophantus was reduced to expressing \"first unknown\", \"second unknown\", etc. in words. He also lacked a symbol for a general number\nn\nn\nn\n. Where we would write\n12\n+\n6\nn\nn\n2\n−\n3\n\\Large\\frac{12 + 6n}{n^{2} -3}\nn\n2\n−\n3\n1\n2\n+\n6\nn\n​\n, Diophantus has to write in words:-\n... a sixfold number increased by twelve, which is divided by the difference by which the square of the number exceeds three.\nDespite the improved notation and that Diophantus introduced, algebra had a long way to go before really general problems could be written down and solved succinctly.\nFragments of another of Diophantus's books\nOn polygonal numbers\n, a topic of great interest to\nPythagoras\nand his followers, has survived. In\n[\n1\n]\nit is stated that this work contains:-\n... little that is original,\n[\nand\n]\nis immediately differentiated from the Arithmetica by its use of geometric proofs.\nDiophantus himself refers to another work which consists of a collection of lemmas called\nThe Porisms\nbut this book is entirely lost. We do know three lemmas contained in\nThe Porisms\nsince Diophantus refers to them in the\nArithmetica\n. One such lemma is that the difference of the cubes of two rational numbers is equal to the sum of the cubes of two other rational numbers, i.e. given any numbers\na, b\nthen there exist numbers\nc\n,\nd\nc, d\nc\n,\nd\nsuch that\na\n3\n−\nb\n3\n=\nc\n3\n+\nd\n3\na^{3} - b^{3}= c^{3} + d^{3}\na\n3\n−\nb\n3\n=\nc\n3\n+\nd\n3\n.\nAnother extant work\nPreliminaries to the geometric elements\n, which has been attributed to\nHeron\n, has been studied recently in\n[\n16\n]\nwhere it is suggested that the attribution to\nHeron\nis incorrect and that the work is due to Diophantus. The author of the article\n[\n14\n]\nthinks that he may have identified yet another work by Diophantus. He writes:-\nWe conjecture the existence of a lost theoretical treatise of Diophantus, entitled \"Teaching of the elements of arithmetic\". Our claims are based on a scholium of an anonymous Byzantine commentator.\nEuropean mathematicians did not learn of the gems in Diophantus's\nArithmetica\nuntil\nRegiomontanus\nwrote in\n1463\n:-\nNo one has yet translated from the Greek into Latin the thirteen Books of Diophantus, in which the very flower of the whole of arithmetic lies hid...\nBombelli\ntranslated much of the work in\n1570\nbut it was never published.\nBombelli\ndid borrow many of Diophantus's problems for his own\nAlgebra\n. The most famous Latin translation of the Diophantus's\nArithmetica\nis due to\nBachet\nin\n1621\nand it is that edition which\nFermat\nstudied. Certainly\nFermat\nwas inspired by this work which has become famous in recent years due to its connection with\nFermat's Last Theorem\n.\nWe began this article with the remark that Diophantus is often regarded as the 'father of algebra' but there is no doubt that many of the methods for solving linear and quadratic equations go back to Babylonian mathematics. For this reason Vogel writes\n[\n1\n]\n:-\n... Diophantus was not, as he has often been called, the father of algebra. Nevertheless, his remarkable, if unsystematic, collection of indeterminate problems is a singular achievement that was not fully appreciated and further developed until much later."
}