{
  "nome_completo": "Donald Cecil Pack",
  "nome_curto": "Donald Pack",
  "ano_nascimento": "1920",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pack/",
  "lugar_nascimento": "Higham Ferrers, Northamptonshire, England",
  "lugar_morte": "Bearsden, Glasgow, Scotland",
  "biografia": "Donald Pack\n's parents were John Cecil Pack and Minnie Spavins. John Cecil Pack was a shoe machine operator living at\n24\nCollege Street, Higham Ferrers, the son of Arthur George Pack, a commercial traveller. Minnie Spavins, who worked in the shoe trade, lived at\n72\nHarborough Road, Rushden. She was the daughter of Hezekiah Spavins, a pressroom foreman. Here is a description of their wedding as it appeared in a local newspaper:-\nOn Christmas Day\n1914\nat the Congregational Church, Rushden, the wedding took place of Miss Minnie Spavins\n(\nage\n24)\n, second daughter of Mr and Mrs Hezekial Spavins, of Harborough-road, Rushden, and Mr John Cecil Pack, second son of Councillor and Mrs A Pack, of Higham Ferrers. The Rev C J Keeler was the officiating minister. The bride, charmingly attired in white silk with a bridal veil, carried a bouquet of lilies of the valley, tulips, and chrysanthemums. She was given away by her father. Four bridesmaids attended - Miss Ethel Spavins, sister of the bride, wore a dress of marine blue velvet, the Misses Elsie and Florence Pack, sisters of the bridegroom, were suitably attired in white silk. Miss Lily Wood, friend of the bride, wore a dress of saxe blue satin, all the bridesmaids wearing black hats with white feathers. They each also wore a gold pendant, the gift of the bridegroom. Mr A Pack, brother of the bridegroom carried on the duties of best man. Mr W L Sargent officiated at the organ, and gave a spirited rendering of the Wedding March. A reception was subsequently held in the Congregational Schoolrooms, about\n70\nguests being present. Mr and Mrs Pack were the recipients of many valuable presents.\nWe note that Higham Ferrers and Rushden were adjacent towns which today have almost merged into one. Donald's early years were spent in Higham Ferrers where he attended the Primary School. He was interested in music from a very young age and by the age of eight years he had learnt to read music. In\n1930\n, at the age of ten, he won a scholarship to Wellingborough School, in Wellingborough, Northamptonshire. This boarding school, founded in\n1595\n, is one of the oldest schools in England. It had moved to a new site in\n1881\nand there, as well as the strong academic teaching, Donald was able to enjoy the sporting emphasis with a new pavilion being opened on the playing fields one year before he began his studies there. He enjoyed soccer, cricket and tennis and represented the school in all three sports. He also enjoyed the musical side of the school too, becoming leader of the school orchestra. In his final year at the school,\n1937\n-\n38\n, he was Head Boy. Of the academic subjects, he enjoyed mathematics most and he sat the Oxford Scholarship examinations winning a College Open Major Scholarship, in addition to a State Scholarship, to study mathematics at New College, Oxford.\nPack matriculated at New College, Oxford, in\n1938\nbut before he began his second year of studies, World War II broke out in September\n1939\n. At this time Pack was nineteen years of age and so eligible for military service as were all men between the ages of\n18\nand\n41\n. However, Pack was one of only four mathematics undergraduates who were told to continue their education at Oxford and complete their degree course before beginning war service. Pack, therefore, continued his studies and was awarded a BA with First Class Honours in mathematics in\n1941\n. After graduating, he was told to go to the Mathematical Laboratory in Cambridge and, as a Science officer, he worked for the Ordinance Board on calculations for anti-aircraft ballistics. After a year at Cambridge working in the Mathematical Laboratory, in\n1942\nPack was awarded a BA by the University of Cambridge. After this year at Cambridge, Pack was sent to the Royal Armament Research and Development Establishment at Fort Halstead, near Sevenoaks, Kent, where he was Scientific officer, Ministry of Supply.\nAt Fort Halstead, Pack joined a team led by Nevill Mott\n(1905\n-\n1996)\n, working on problems involving armaments and set up to advise military designers on problems relating to explosives, fragmentation bombs, the attack and defence of tanks and other similar problems. Among his colleagues with whom he collaborated were Rodney Hill\n(1921\n-\n2017)\n, W M Evans, H J James as well as Nevill Mott. They produced theoretical research reports for the Armament Research Department and, after the end of the war, these were published in journals. You can see the titles, 'Abstracts' and some 'Introductions' to these papers at\nTHIS LINK\n.\nIn\n1944\nMott was attached to the British Army of the Rhine as an acting captain, and carried out scientific work in Germany. He remained in Germany until late\n1946\nand, in January\n1947\n, he was appointed as a lecturer at University College, Dundee, at that time part of the University of St Andrews. Later that year, on Wednesday\n19\nNovember\n1947\n, Pack married Constance Mary Gillam\n(1922\n-\n2010)\n, known as Connie.  Connie was also on the staff of the mathematics department in Dundee being, like Pack, an Oxford graduate. She had authored the paper\nThe Van der Waals force between a proton and a hydrogen atom. II, Excited states\nwith\nCharles Coulson\nwhich was published in\n1947\n. The professor at University College, Dundee, was\nEdward Copson\nso Donald and Connie asked him if they could have the day off to get married.\nCopson\nreplied that was not possible, but if they gave their lectures in the morning they could have the afternoon off. Few couples can both have given a lecture on the morning of their wedding! Donald and Connie Pack had three children, John Richard Pack, Alan Donald Pack, and Catherine Mary Pack.\nPack had never studied for a Ph.D. since he had gone straight from being an undergraduate to undertake war work. This had meant that his research topics were determined by the needs of wartime research and he continued to work in associated areas for the rest of his career. While working in Dundee he submitted a thesis for a D.Sc. and in\n1951\nhe was awarded the degree by the University of St Andrews. The award of a Fulbright Travel Award allowed him to spend the year\n1951\n-\n52\nat the University of Maryland in the United States as a Visiting Research Associate. There he worked on supersonic shock waves and jets, publishing papers in this area such as\n(\nwith S I Pai\n)\nSimilarity laws for supersonic flows\n(1954)\n,\nLaminar flow in an axially symmetrical jet of compressible fluid, far from the orifice\n(1954)\n, and\n(\nwith A G Mackie\n)\nTransonic flow past finite wedges\n(1955)\n. Returning to Britain after his year in the United States, Pack was appointed as a lecturer at the University of Manchester taking up the position in the autumn of\n1952\n. Not long after he had been appointed, he was informed that the University were paying him too much for someone only\n32\nyears old. This meant that he felt that he was not being disloyal when, soon after this incident, he applied for the chair of mathematics at the Glasgow Royal Technical College.\nThe Glasgow Royal Technical College that Pack had joined was an ancient institution, founded in\n1796\nas the Andersonian Institute. Known as Anderson's University from\n1828\nto\n1887\n, it was renamed the Glasgow and West of Scotland Technical College in\n1887\n, and then the Royal Technical College in\n1912\n. The Mathematics Department that Pack headed was small, consisting of only six members of staff, and before Pack's appointment it undertook no research, offered no degree in mathematics, and only provided service teaching for other science and engineering departments. Adam McBride explains how Pack transformed the Mathematics Department\n[\n4\n]\n:-\nDonald set in train two processes which led to the evolution of the department into its present form as the Department of Mathematics and Statistics at the University of Strathclyde. Firstly, based on his own experience, he felt that the time was ripe for a course for Mathematics students who wanted to work in industry. He therefore established a four-year Honours course in Applied Mathematics which led to an Associateship of the Royal Technical College. This course contained two features which were novel at the time. At the end of the third year, students were to undertake a\n6\n-month placement in an industrial or scientific establishment. Then after their final written exams in April of fourth year, students were to embark on a major project during the long vacation, at the conclusion of which they had to produce a substantial report. Although the industrial placement has long gone, the various B.Sc. Honours degrees now offered by the Department of Mathematics and Statistics still contain a project, albeit of much more modest proportions. The second innovation was the initiation of a research culture in the Department. Donald set up a group studying transonic flow which soon gained international recognition, not least by the United States Air Force Office of Scientific Research which provided funding over a period of almost\n10\nyears. In the early\n60\ns, Donald's research interests moved into the areas of non-equilibrium flow and rarefied gas dynamics.\nThe Royal Technical College had become the Royal College of Science and Technology in\n1956\nbut it soon began to plan to gain university status and for this Pack's building a research environment was exactly what was required. In\n1964\nthe institution changed its name yet again when it became the University of Strathclyde. In the ten years that he had led the Department, Pack had changed it from one doing essentially no research into the leading Applied Mathematics department in Scotland. On the university level, he served as Vice-Principal from\n1968\nto\n1972\n. During his career he published over\n50\ntop quality papers, and it is interesting to note that after he retired in\n1982\nhis publication rate increased with joint papers, many with J Mika and Bob Cole\n(\nthe author of\n[\n1\n]\nand\n[\n2\n]\n)\n. These include\nThe development of bivariational principles for the calculation of upper and lower bounds\n(1983)\n,\nUpper and lower bounds of bilinear functionals in nonlinear problems\n(1984)\n,\nComplementary bounds for inner products associated with nonlinear equations\n(1984)\n,\nOptimal bounds for bilinear forms associated with linear equations\n(1985)\n,\nApproximation to inverses of normal operators\n(1986)\nand\nApplication of the superconvergence properties of the Galerkin approximation to the calculation of upper and lower bounds for linear functionals of solutions of integral equations\n(1987)\n.\nDuring his career Pack made visits to a number of different European institutions. For example, he was a Guest Professor at the Technische Universität in  Berlin in\n1967\n, at Bologna University in\n1980\nand, in the same year, at the Politecnico Milano. In the following year of\n1981\nhe was a guest professor at the Technische Hochschule of Darmstadt. He also held various other visiting appointments such as at the University of Warsaw in\n1977\n. He made particularly important visits to Kaiserslautern in\n1980\nand again in\n1984\nwhere he was able to continue a long-term collaboration with Helmut Neunzert. Other European links came though his membership of\nGesellschaft für Angewandte Mathematics und Mechanik\n, serving as a council member in\n1977\n-\n1983\nand as an honorary fellow of the European Consortium for Mathematics in Industry which he received in\n1988\nafter being proposed by Helmut Neunzert.\nWe must mention the number of important roles that Pack played in supporting school mathematics in Scotland. He served as a member of the Dunbartonshire Education Committee from\n1960\nto\n1966\n; he served on the General Teaching Council for Scotland from\n1966\nto\n1973\n; he was chairman of Scottish Certificate of Education Examination Board from\n1969\nto\n1977\n; and he chaired the Committee of Inquiry into Truancy and Indiscipline in Schools in Scotland for three years from\n1974\nwhich produced Pack Report. On a UK level, he played an important role in the founding of the\nInstitute of Mathematics and its Applications\nin\n1964\n, and was the first treasurer of the Institute from its founding in\n1964\nuntil\n1972\n. Pack was awarded a OBE for his services to education in\n1969\nand, nine years later in\n1978\n, he was awarded a CBE, also for services to education.\nAt the very start of his career, Pack was directed towards military applications of mathematics due to World War II. He continued throughout his career to support the Royal Armament Research and Development Establishment at Fort Halstead, which later was renamed the Defence Evaluation and Research Agency\n(\nDERA\n)\n. He was a visiting fellow at the DERA from\n1999\nto\n2001\n. He also served on the Defence Scientific Advisory Council from\n1975\nto\n1980\nand he was a consultant to the Ministry of Defence from\n1984\nto\n2001\n.\nWe mentioned Pack's love of music at the beginning of this biography but we should say more about this since he made some remarkably important contributions. First let us recount a delightful story from\n[\n4\n]\n:-\nDonald was on one of his frequent trips to Germany and heard someone upstairs playing the piano. He decided to introduce himself to the pianist who turned out to be none other than the theoretical physicist\nWerner Heisenberg\n, famous for his Uncertainty Principle. Donald fetched his violin and the two of them ended up playing duets.\nPack was only ever an amateur violinist, playing for pleasure, but for many years he enjoyed playing in a string quartet in his own home. However, his role with the National Youth Orchestra of Scotland is very important. He served as founding chairman of the Orchestra from\n1978\nto\n1988\nand as honorary President from\n1988\nuntil his death. It was in December\n1978\nthat Pack received the first £\n5000\ninstalment of a £\n20000\npump-priming grant from the Carnegie Trust and formally announced the founding of the Orchestra. Nigel Kennedy, now a world famous violinist, performed with the Orchestra in December\n1981\n. Percussionist Evelyn Glennie\n(\nnow Dame Evelyn Glennie\n)\nfeatured in the Orchestra's winter tour of\n1987\n. Ten years later, in April\n1997\n, Nicola Benedetti was orchestra leader of the National Children's Orchestra of Scotland. Nicola Benedetti was the soloist for the summer tour of the National Youth Orchestra of Scotland in\n2012\n. Pack and his wife usually travelled with the Orchestra when they made tours. He was a member of the European Music Year Committee and served as chairman of the Scottish subcommittee from\n1982\nto\n1986\n. He was invited to take up this role by Sir William Rees-Mogg, Chairman of the Arts Council of Great Britain. He organised many of the Scottish events of the European Music Year\n1985\nin Scotland, in particular a concert given by Scottish schoolchildren in the Usher Hall, Edinburgh, on\n21\nJune\n1985\n.\nAlthough music was Pack's greatest hobby, he also enjoyed gardening and golf. He was a devoted family man who, by the last years of his life, had his children, his six grandchildren and his five great grandchildren. Bob Cole writes:-\nIn his later years, his sight and hearing suffered, but not his sharp mind and impressive memory. He was at heart a humble man."
}