{
  "nome_completo": "Donald Samuel Ornstein",
  "nome_curto": "Donald Ornstein",
  "ano_nascimento": "1934",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ornstein/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": null,
  "biografia": "Donald Ornstein\nis known to his friends and colleagues as Don. His parents were Harry Ornstein and Rose Wisner. He was educated at Swarthmore College, Pennsylvania, and then entered the University of Chicago where he undertook research towards his Ph.D. advised by\nIrving Kaplansky\n. He was initiated as a member of the Chicago Chapter of Sigma Xi in autumn\n1956\n. He submitted his thesis\nDual Vector Spaces\nto the University of Chicago and was awarded a Ph.D. in\n1957\n. However, by the time he was awarded his doctorate, Ornstein was already at Institute for Advanced Study at Princeton where he spent two academic years\n1956\n-\n58\n. Following these years when he concentrated on research, he was appointed as an Instructor in Mathematics at the University of Wisconsin, spending two academic years\n1958\n-\n60\nin this post.\nOrnstein's first publication appeared in\n1959\nin the\nAnnals of Mathematics\n. Not surprisingly, this first paper was based on his Ph.D. thesis and had the same title\nDual Vector Spaces\n. However, his second paper, written jointly with R V Chacon, was on ergodic theory, the topic for which Ornstein is now best known. The paper\nA general ergodic theorem\n(1960)\ncontained a proof of a conjecture that had been made by\nEberhard Hopf\n. Two further publications appeared in\n1960\n, namely\nThe differentiability of transition functions\nand\nOn invariant measure\n. Both were single authored and, in the second paper, he gave a negative answer to a long-standing question in the theory of measurable transformations. In\n1960\nOrnstein was appointed as an Assistant professor at Stanford University. He continued to hold a position at Stanford for the rest of his career, being promoted to an associate professor in\n1963\nand also being a Sloan fellow during\n1963\n-\n65\n. During this period he married Shari Richman in\n1964\n; they had two sons and one daughter. He continued as an associate professor at Stanford during\n1965\n-\n66\nand he was promoted to full professor in\n1966\n. During the academic year\n1967\n-\n68\nhe was a visiting professor at Cornell University and at New York University's\nCourant\nInstitute.\nThe year\n1968\nwas an important one for Ornstein for in that year he began proving a number of exceptionally important results which led to major advances in\nergodic theory\nin the following years. He was invited to write the paper\n[\n2\n]\ndescribing these advances and to give the James K Whittemore Lectures in Mathematics given at Yale University describing his breakthroughs. The Yale lectures were published as the monograph\nErgodic theory, randomness, and dynamical systems\nin\n1974\n. Also in\n1974\nthe\nAmerican Mathematical Society\nawarded Ornstein their\nBôcher\nMemorial Prize:-\n... in recognition of his paper \"Bernoulli shifts with the same entropy are isomorphic\"\n(1970)\n.\nTo understand what Ornstein proved in this papers, we quote from his own description in\n[\n1\n]\n:-\nErgodic theory, the study of measure-preserving transformations or flows, arose from the study of the long-term statistical behaviour of\ndynamical systems\n. Consider, for example, a billiard ball moving at constant speed on a rectangular table with a convex obstacle. The state of the system\n(\nthe position and velocity of the ball\n)\n, at one instant of time, can be described by three numbers or a point in Euclidean\n3\n-dimensional space, and its time evolution by a flow on its state space, a subset of\n3\n-dimensional space. The\nLebesgue\nmeasure of a set does not change as it evolves and can be identified with its probability. One can abstract the statistical properties\n(\ne.g., ignoring sets of probability\n0)\nand regard the state-space as an abstract measure space. Equivalently, one says that two flows are isomorphic if there is a one-to-one measure-preserving\n(\nprobability-preserving\n)\ncorrespondence between their state spaces so that corresponding sets evolve in the same way\n(\ni.e., the correspondence is maintained for all time\n)\n. It is sometimes convenient to discretize time\n(\ni.e., look at the flow once every minute\n)\n, and this is also referred to as a transformation. Measure-preserving transformations\n(\nor flows\n)\nalso arise from the study of stationary processes. The simplest examples are independent processes such as coin tossing. The outcome of each coin tossing experiment\n(\nthe experiment goes on for all time\n)\ncan be described as a doubly-infinite sequence of heads H and tails T. The state space is the collection of these sequences. Each subset is assigned a probability. For example, the set of all sequences that are H at time\n3\nand T at time\n5\ngets probability\n1\n4\n\\large\\frac{1}{4}\\normalsize\n4\n1\n​\n. The passage of time shifts each sequence to the left\n(\nwhat used to be time\n1\nis now time\n0)\n.\n(\nThis kind of construction works for all stochastic processes, independence and discrete time are not needed.\n)\nThe above transformation is called the\nBernoulli\nshift B\n(\n½, ½\n)\n. If, instead of flipping a coin, one spins a roulette wheel with three slots of probability\np\n1\n,\np\n2\n,\np\n3\np_{1}, p_{2}, p_{3}\np\n1\n​\n,\np\n2\n​\n,\np\n3\n​\n, one would get the\nBernoulli\nshift B\n(\np\n1\n,\np\n2\n,\np\n3\np_{1}, p_{2}, p_{3}\np\n1\n​\n,\np\n2\n​\n,\np\n3\n​\n)\n.\nBernoulli\nshifts play a central role in ergodic theory, but it was not known until\n1958\nwhether or not all Bernoulli shifts are isomorphic.\nA N Kolmogorov\nand\nYa G Sinai\nsolved this problem by introducing a new invariant for measure-preserving transformations: the entropy, which they took from\nShannon\n's theory of information. They\n[\nused entropy to prove\n]\nthat not all\nBernoulli\nshifts are isomorphic. The simplest case of the Ornstein isomorphism theorem\n(1970)\n, states that two\nBernoulli\nshifts of the same entropy are isomorphic.\nPaul C Shields, reviewing Ornstein's book\nErgodic theory, randomness, and dynamical systems\n(1974)\nwrites:-\nIn\n1969\n, the author solved one of the most difficult problems in ergodic theory when he showed that two\nBernoulli\nshifts with the same entropy are isomorphic. This immediately led to many new results about measure-preserving transformations including proofs that many transformations of physical and mathematical interest are just disguised versions of\nBernoulli\nshifts. In these lectures the author gives a clear and thorough discussion of the ideas which are the basis for this growing new branch of ergodic theory. ... Since the publication in\n1974\nof this book the subject has continued to grow. There is now an extensive theory of isomorphism of flows, group actions\n(\nincluding Ising models\n)\n, and even communications channels.\nOrnstein published other significant papers in\n1970\nin addition to\nBernoulli shifts with the same entropy are isomorphic\nfor which he received the\nBôcher\nMemorial Prize, although it is clear that it was this paper which was the starting point for all that followed. These other\n1970\npapers were\nFactors of Bernoulli shifts are Bernoulli shifts\nand\nImbedding Bernoulli shifts in flows\nwhich contained a generalisation of the results of his prize-winning paper. He continued to produce papers in the following couple of years which pushed understanding of the topic significantly forward:\nA Kolmogorov automorphism that is not a Bernoulli shift\n;\nA K-automorphism with no square root and Pinsker's conjecture\n; and\nThe isomorphism theorem for Bernoulli flows\n. The paper\n[\n2\n]\ngives a very clear overview of this work.\nAfter the publication of this outstanding work, Ornstein was a visiting professor at the Hebrew University in Jerusalem in\n1975\n-\n76\nand at the University of California's Mathematical Sciences Research Institute at Berkeley in\n1983\n-\n84\n.\nPerhaps the greatest honours that Ornstein has received was his election to the\nNational Academy of Sciences\nin\n1981\nand to the\nAmerican Academy of Arts and Sciences\nin\n1991\n."
}