{
  "nome_completo": "Doris Jean Wood Schattschneider",
  "nome_curto": "Doris Schattschneider",
  "ano_nascimento": "1939",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schattschneider/",
  "lugar_nascimento": "Staten Island, New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Doris Schattschneider\nwas given the name\nDoris Wood\nand was only known as Doris Schattschneider after her marriage. In this biography we will call her Doris up to the time of her marriage and  Schattschneider from that time onwards. Her parents were Robert W Wood, Jr\n(30\nDecember\n1907\n-\n14\nAugust\n1992)\n, and Charlotte Lucile Ingalls\n(22\nAugust\n1908\n-\n6\nNovember\n2000)\n. Robert Wood's parents were Robert Walter Wood\n(1881\n-\n1939)\nand Maude Marguerite Tuthill\n(1883\n-\n1952)\n. He was born in Richmond, New York, had graduated from the City College of New York and was employed as a mechanical engineer for the City of New York's Bureau of Bridges. Doris's mother, Charlotte Ingalls' parents were Frank G Ingalls and Leona E Smith. She was born in Staten Island, New York, and had become a classical scholar having a Master's Degree in Classics from Cornell University. She taught Latin at several High Schools on Staten Island and had authored a popular Latin textbook. Doris was the second of her parents four children having one older sister Leona A Wood and one younger sister Charlotte L Wood and a younger brother Robert A Wood.\nAt the time of the April\n1940\ncensus, the family were living at\n72\nOtis Street, Staten Island, New York. However, the United States entered World War II on\n8\nDecember\n1941\n, the day after Japan attacked the U.S. fleet at Pearl Harbour. The result of this was that Doris's father served as an engineer in the\n36\nth Engineers of the U.S. Army and was posted overseas, mainly in North Africa and Sicily. While he was away the rest of the family moved to Lake Placid, New York. It was there that Doris began her schooling which she enjoyed. In fact she had learnt to read and print write at the age of four so found primary school easy. By the time the war was over and the family returned to Staten Island, she was well ahead of the children of her age. She enjoyed all her subjects and for a time considered a career as a nurse.\nDoris attended Public School\n41\nand New Dorp High School in New Dorp, Staten Island. There she was concerned with the success of her fellow students more than her own success and she tutored her friends for the Regents Examinations. These are state-wide examinations in New York State leading to a Regents Diploma which was required to graduate. The examinations covered core subjects, one of which was mathematics, and it was mathematics that Doris helped her friends to score well in. It was at this high school that she exhibited her natural love and skill for teaching. At this school she was encouraged by the mathematics teacher who gave her the challenge that she was seeking. Her experiences with physics were less encouraging for, although she enjoyed the subject, her lecturer at College dissuaded her from continuing her studies in that subject. Another of her loves was art but her main university subject was mathematics. She graduated from the University of Rochester, New York, with an A.B. in\n1961\n.\nShe married David Allen Schattschneider on\n2\nJune\n1962\nat Staten Island, New York. David, the only child of Allen Wilbur Schattschneider and Naomi Wartman, was born on\n30\nMarch\n1939\nin Philadelphia, Pennsylvania. He had received a Bachelor of Arts degree from the Moravian College in\n1960\n, a Master of Divinity from Yale University in\n1964\n, and a Ph.D. from the University of Chicago in\n1975\n. He was ordained a Deacon in the Moravian Church on\n11\nMay\n1969\nand consecrated a Presbyter\n2\nOctober\n1977\n. Doris and David had one daughter, Laura Ellen Schattschneider.\nAfter graduating from the University of Rochester, Doris Schattschneider studied at Yale University. She was awarded an M.A. and then in\n1966\na Ph,D. for her\n45\n-page thesis\nRestricted roots of a semi-simple algebraic group\n. Her thesis advisors were Tsuneo Tamagawa and Ichiro Satake. A paper giving the main results of her thesis appeared in\n1969\nwith the title\nOn restricted roots of semi-simple algebraic groups\n. Schattschneider spent a year teaching at Northwestern University, in Evanston, Illinois and then taught for three years at University of Illinois's Chicago Circle campus, before being appointed to Moravian College, Bethlehem, Pennsylvania, in the autumn of\n1968\n. We note that her husband David Schattschneider was awarded the degree of Master of Arts from the University Chicago Divinity School in\n1966\nand was appointed as an Instructor in church history at Moravian Theological Seminary, Bethlehem, in\n1968\n. Doris Schattschneider taught at Moravian College for the rest of her career. Her husband taught at Moravian Theological Seminary, Bethlehem, for the rest of his career, also serving as Dean of the Seminary from\n1988\nuntil his retirement in\n2001\n.\nWe must now take a brief look at the contributions that Schattschneider has made to mathematics\n[\n15\n]\n:-\nDoris Schattschneider worked on many aspects of mathematics. Symmetry and geometric models have long held a special fascination with her. Doris was interested in both geometry and art and this led naturally to the study of tiling problems and the work of the Dutch artist\nM C Escher\n. She has written many scholarly articles that have dealt with many subjects within mathematics.\nHer papers published prior to\n1990\ninclude\nA multiplicative metric\n(1976)\n,\nThe plane symmetry groups: their recognition and notation\n(1978)\n,\nTiling the plane with congruent pentagons\n(1978)\n,\nWill it tile? Try the Conway criterion!\n(1980)\n,\nThe taxicab group\n(1984)\n,\nThe Mystery of the MAA Logo\n(1985)\n,\nIn black and white: how to create perfectly colored symmetric patterns\n(1986)\n,\nEscher's classification system for his colored periodic drawings\n(1986)\n,\nThe Pólya-Escher connection\n(1987)\n,\nExtending the Conway criterion\n(1988)\n,\nEscher: a mathematician in spite of himself\n(1988)\n. Let us look at her interest in tilings by quoting from her paper\nThe Fascination of Tiling\n(1992)\n:-\nDutch artist\nM C Escher\n(1898\n-\n1972)\noften described regular divisions of the plane as \"the richest source of inspiration I have ever struck.\" Interlocking shapes displayed in majolica tile, inlaid wood, brickwork, carved stucco, stone pavement, sewn patchwork or printed fabric hold a special fascination for many people that goes far beyond the aesthetic pleasure that these patterns provide. Tiling can serve as a paradigm: it is wholly visual\n(\nand perhaps seems to be purely in the provenance of design\n)\nyet incredibly rich as a source of mathematical questions. Many of these questions have implications for those who\n(\nlike\nEscher\n)\ndesign intricate and unusual tilings. Other questions probe the limits of possibilities for tilings, investigate the structure of tilings, aim to produce methods of classification or link tilings to physical structures in nature or to invented mathematical structures. Mathematicians seek to know how tiles can pave surfaces - not just the Euclidean\n(\nflat\n)\nplane, but also the hyperbolic plane and the surfaces of three-dimensional objects such as spheres, tori\n(\ndoughnuts\n)\nor\nMöbius\nbands. They also investigate tilings on surfaces impossible to fully represent in our three-dimensional world, such as a\nKlein\nbottle or surfaces in higher dimensions. And tiling problems are not only restricted to surfaces - there are marvellous problems that ask questions about how three-dimensional 'tiles'\n(\nsuch as polyhedra\n)\ncan pack space, or how higher-dimensional spaces can be packed with tiles. Most of these problems are difficult, and most are unsolved.\nAs two further examples, let us look at extracts from two reviews of her papers. First a review by\nDonald Coxeter\nof Schattschneider's paper\nThe Pólya-Escher connection\n(1987)\nsummarises the contents of the paper:-\nOne of\nM C Escher\n's favourite activities, inspired by his two visits to the Alhambra, was to draw a pattern of congruent replicas of a particular shape so as to fill and cover the plane, leaving no gaps. In this project, he was encouraged by his geologist brother, B G Escher, who showed him, in\n1936\n, a paper by\nG Pólya\n(1924)\n. In that paper,\nPólya\nhad rediscovered Fedorov's enumeration of the seventeen two-dimensional space groups, cleverly illustrating each group by a plane-filling in\nEscher\n's style: the author's Figure\n1\n.\nEscher\ncopied the whole paper, enlarged the illustrations, and added his own two special contributions. The first contribution, anticipating the subsequent work of Russian crystallographers, was his introduction of perfect colouring, more systematic than the often haphazard use of colours by the Moors in the Alhambra and Mezquita. The second contribution was his deformation of\nPólya\n's simple motifs\n(\nbounded by line segments or arcs of circles\n)\ninto recognizable birds, lizards, fishes, etc. The author's Figure\n2\nis a photograph of a particularly striking entry in one of\nEscher\n's unpublished notebooks, where he used\n3\ncolours to enhance\nPólya\n's\nD\n°\n3\nD°_{3}\nD\n°\n3\n​\n.\nOur second quote is a review by\nMarjorie Senechal\nof Schattschneider's paper\nIn black and white: how to create perfectly colored symmetric patterns\n:-\nThis article is intended primarily for students, teachers and designers who are interested in exploring the field of colour symmetry but are bewildered by the inconsistency and lack of clarity in the mathematical literature on the subject. The author carefully discusses the isometries of the plane and how they can be used to generate patterns and tilings, explains how designs are classified by symmetry, and thoroughly analyzes the problem of colouring a design with two colours in a way that is compatible with its symmetry. Her sensitivity to the concerns of the artist is manifest throughout; especially interesting is the discussion of the interpretation of figure and ground in coloured patterns.\nWe gain further insight into Schattschneider's work by looking at reviews of her books. We give some extracts from reviews of three of her books at\nTHIS LINK\n.\nAnother project in which Schattschneider played a major role was the Visual Geometry Project\n[\n3\n]\n:-\nAs senior associate of the Visual Geometry Project, a project funded by the National Science Foundation, she collaborated with colleagues\n(\nincluding Eugene Klotz from Swarthmore College\n)\nto develop and produce three activity books with hands-on geometric models and computer animated videotapes. These materials, designed to teach about two- and three-dimensional forms, include three videotapes and the computer program \"The Geometer's Sketchpad\" to be used in teaching geometry.\nSchattschneider attended many conferences on topics related to her interests and, not surprisingly, she attended the\nEscher\nCentennial Congress in June\n1998\n.\nMarjorie Senechal\n, a conference participant, wrote\n[\n1\n]\n:-\nAfter three days of lectures, expositions, and discussions in Rome - home to\nM C Escher\nand his family from\n1925\nto\n1935\n- the Congress moved south to Ravello, a small mountain town that\nEscher\nhad loved.\nAnother participant at that conference was Michele Emmer who explained that Schattschneider's research had involved Ravello many years before\n[\n1\n]\n:-\nYears ago when Doris Schattschneider was preparing her book \"Visions of Symmetry\" she sent me a letter asking me if I could help to locate some Arabic mosaics she thought might be in Ravello; she had found loose sketches of them in\nEscher\n's materials. I contacted a friend of mine, Francesco Fortunato, an architect who lives in Ravello and is a great fan of\nEscher\n, who immediately recognized the sketches by\nEscher\n. You can find the original mosaics adorning the pulpit of the Duomo in Ravello. Doris thought that it was rare to find Arabic mosaics or motifs in Ravello. In fact it is not; the Moors occupied the Amalfi coast for centuries. They are part of the history of Ravello, a place so loved by\nEscher\n; he was in Ravello many times. In particular, at the Hotel Toro it is possible to see an Escherian motif on the wall, made to commemorate his staying there.\nLet us mention one other conference that Schattschneider attended, namely \"Renaissance Banff: Mathematics, Music, Art, Culture\" held\n30\nJuly to\n3\nAugust,\n2005\n, in Banff, Canada. Schattschneider wrote an article 'Math and Art in the Mountains' for the\nMathematical Intelligencer\n28\n(3)\n(2006)\ndescribing the conference, summarising the talks given at it, as well as describing the conference outings. This piece clearly shows Schattschneider's love of travel and her love of walking in mountains.\nWe next give some indication of the high quality of her teaching. The following was written after she was awarded the\n1991\nMeritorious Service Award from the Eastern Pennsylvania and Delaware section of the\nMathematical Association of America\n[\n21\n]\n:-\nHer students say Schattschneider's enthusiasm for mathematics is contagious, and her penchant for visual teaching tools helps them to better \"see\" complex mathematical concepts. \"Doris is well-respected and highly effective in the classroom,\" states the award nomination, \"In a recent evaluation of all professors at Moravian, conducted by students and published in the campus newspaper, Doris scored an overall score of\n3\n.\n66\nout of\n4\n.\n0\n, one of the highest on campus. She was praised by students as a great mathematician and teacher. Students felt that she understood her material extremely well and presented it to the class in the same way. One math major wrote, 'Her enthusiasm for the subject made me want to do better'.\" \"Certainly, seeing students go on and mature, that's a great satisfaction,\" she said. \"Many do keep in touch. It's also satisfying to see some students I've guided teaching today. I've been supervising student teachers for the last seven years. I really enjoy that.\"\nIn\n1991\nthe\nMathematical Association of America\ninstituted Awards for Distinguished College or University Teaching of Mathematics in order to honour college or university teachers who had been widely recognized as extraordinarily successful and whose teaching effectiveness had been shown to have had influence beyond their own institutions. In\n1993\nthe Board of Governors of the\nMathematical Association of America\nrenamed the award to honour Deborah and Franklin Tepper Haimo and in that year made the award to Doris W Schattschneider, Moravian College. In reply to receiving the award she said\n[\n18\n]\n:-\nI am deeply honoured by this recognition by my colleagues in the MAA. I especially want to thank the teachers, including my mother, who inspired me - those who awakened my sense of curiosity, showed me that there was 'wow!' in mathematics and appealed to the ham in me.\nIn\n1995\nshe was made the\nMathematical Association of America\n's\nEarle Raymond Hedrick\nLecturer.\nIt was not only for teaching that Schattschneider received awards; she also received awards for her papers. In\n1979\nthe\nMathematical Association of America\ngave her their Carl B Allendoerfer Award, given to authors of exceptional expository articles published in\nMathematics Magazine\n. It was Schattschneider's article\nTiling the plane with congruent pentagons\n(1978)\nfor which she received the award.\nSchattschneider was active in the\nMathematical Association of America\n, being editor of\nMathematics Magazine\n1981\n-\n1985\n, and First Vice President in\n1994\n-\n95\n[\n3\n]\n:-\nIn addition to her extensive professional affiliation with the MAA, Schattschneider is involved with the\nAmerican Mathematical Society\n; the Association for Women in Mathematics; the National Council of Teachers of Mathematics. She is a member of Phi Beta Kappa and Pi Mu Epsilon, having served as national councillor for several years.\nShe was also the first woman to deliver Pi Mu Epsilon's J Sutherland Frame Lecture\n(1988)\n. In\n2012\nshe was honoured by being elected a Fellow of the\nAmerican Mathematical Society\n.\nSchattschneider's husband David died at their home in Bethlehem Pennsylvania on Thursday,\n29\nSeptember\n2016\n."
}