{
  "nome_completo": "Clarisse Doris Hellman",
  "nome_curto": "Doris Hellman",
  "ano_nascimento": "1910",
  "ano_morte": "1973",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hellman/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "New York City, New York, USA",
  "biografia": "Doris Hellman\n's parents were the obstetrician Alfred Myer Hellman\n(1880\n-\n1955)\nand Clarisse Bloom\n(1882\n-\n1973)\n. It was a family that had a great interest in scholarship in general and the sciences in particular, and Doris soon gained an appreciation of the sciences from her parents. We will get a better understanding of Doris's upbringing if we give some further details of her parents.\nAlfred Hellman was born on\n8\nSeptember\n1880\nin New York, to Myer Hellman and Amelia Bernheim. He studied at Columbia University\n(\nA.B.\n1902\n, M.D.\n1905)\nand became a well known obstetrician and gynaecologist in New York. He wrote several books such as\nAmnesia and analgesia in parturition\n(\ntwilight sleep\n)\n(1915)\n. In this book he is described as \"Adjunct Attending Gynecologist and Obstetrician, Lebanon Hospital New York; Attending Gynecologist, German Hospital Dispensary, New York; Fellow, New York Academy of Medicine.\" He was also an avid collector of historical books, manuscripts, and typescripts. He possessed a collection of Abraham Lincoln Portraits and Memorabilia as well as D H Lawrence material and John Steinbeck material. Clarisse Bloom was born in\n1882\nin New York to Jacob N Bloom and Sallie Thurnauer. She married Alfred Myer Hellman on\n12\nOctober\n1908\nat Temple Emanuel. She was the only woman on the Board of Directors for the Sydenham Hospital from\n1917\nuntil\n1929\n.\nDoris Hellman attended the Horace Mann School from which she graduated with honours in\n1926\n. This school, founded in\n1887\n, was originally designed as a laboratory for the Teachers College of Columbia University in New York but, although retaining its links to Columbia University when Hellman studied there, it was by that time not being used as a laboratory for Columbia. Situated at\n120\nth\nStreet in Morningside Heights, it was a girls school when Hellman was a student. After graduating from the Horace Mann School she entered Vassar College where she studied mathematics and astronomy. Vassar College, founded in\n1861\nby Matthew Vassar, was a women's liberal arts college in Poughkeepsie, New York. She graduated with the degree of B.A. with honours in\n1930\nhaving been elected to Phi Beta Kappa. We note that Grace Brewster Murray\n(\nbetter known by her married name of\nGrace Hopper\n)\nwas four years older than Hellman and graduated Phi Beta Kappa from Vassar College in\n1928\nwith a bachelor's degree in mathematics and physics.\nIn\n1930\n, Hellman entered Radcliffe College as a Vassar College Fellow. We note that, at that time, Radcliffe College in Cambridge, Massachusetts, served as a women's college coordinating with the famous men's Harvard College. Students at Radcliffe were taught by professors employed at Harvard College. She received a Master of Arts degree in the history of science in\n1931\n. It was one of the first postgraduate degrees in the history of science to be awarded in the United States. In the year she graduated from Radcliffe College she returned to New York having been awarded a scholarship from Columbia University. In the following year she received a prestigious Columbia University Fellowship, the highest scholastic award attainable by a graduate student there.\nIn\n1933\nshe took a break in her studies when she married Morton Pepper\n(1906\n-\n1988)\nwho was a well-known New York attorney. Pepper, who had graduated from Harvard College and Harvard Law School, practised law in Manhattan from\n1930\n. Morton and Doris Pepper had two daughters, Alice\n(\nborn in\n1937)\nand Carol\n(\nborn in\n1940)\n. Edward Rosen writes in\n[\n12\n]\n:-\nParents and children at all times formed a closely knit family, Mrs Pepper being a devoted wife and affectionate mother.\nLet us record at this point that Alice Pepper married Robert L Cooper\n(1932\n-\n2012)\nwhile Carol Pepper married his brother Paul R Cooper in June\n1961\n. Robert Cooper became Professor of Sociology and Education at the Hebrew University of Jerusalem while Paul Cooper was a professor of English, theatre and drama for\n15\nyears before becoming a computer programmer.\nDoris Hellman Pepper was awarded a Ph.D. from Columbia University in\n1943\nfor her thesis\nThe Comet of\n1577\n: Its Place in the History of Astronomy\n. Her thesis was published in\n1944\nas a\n488\n-page book by Columbia University Press. You can read two reviews of the book at\nTHIS LINK\n.\nWe note that, although she was now married to Morton Pepper, she continued to use the name C Doris Hellman on her published papers. She published\nNotes & Correspondence\n(1947)\n, and papers such as\nAdditional Tracts on the Comet of\n1577\n(1948)\n. In this\n1948\npaper she wrote:-\nOne of the joys of working in the history of science is that one is never finished. It was with great pleasure that I found additional information for 'A bibliography of tracts and treatises on the comet of\n1577\n', which I originally published in 'Isis\n22\n(1934)\n,\n4\n-\n68\n', and later corrected and augmented as the appendix to my book, 'The comet of\n1577\n: Its Place in the History of Astronomy'\n(\nColumbia University Press,\n1944)\n. This new information takes three forms:\n(\ni\n)\nworks not known to me in\n1944\n;\n(2)\ndifferent editions of items previously cited; and\n(3)\nfurther information about items which had been cited, but copies of which were not available.\nShe was elected as a member of the Council of History of Science Society in\n1949\nand in\n1951\nshe was appointed to the Pratt Institute. This Institute, founded in\n1887\n, had its main campus at the Clinton Hill neighbourhood of Brooklyn, New York and a second campus in Manhattan. As soon as she was appointed, she began to give a course on the history of science. Details are given in\n[\n2\n]\n:-\nIn the summer of\n1951\nProfessor Roland E Partridge and Dr C Doris Hellman inaugurated a new course in the Department of Social Studies of the Division of General Studies at Pratt Institute in Brooklyn. The course is for third-year college students and has the title 'Impact of Science'. Its aim is to trace historically the effect of scientific development on the culture of the time\n(\neconomic, material and social\n)\nas well as to point out the converse effect of the culture on the development of science. The hope is that in this scientific age, the students will gain an understanding of what science is and of how it affects them personally and that they will become more intelligent citizens and voters. The course will be repeated in the academic year\n1951\n-\n52\nby Professor Partridge, Professor Howard Nechamkin and Dr Hellman.\nThe Clinton Hill area proved increasingly unattractive during the\n1950\ns and\n1960\ns as it changed from being an affluent area into a poor crime-filled one. This had an unfortunate impact on the Pratt Institute as student numbers fell. Although Hellman remained on the faculty at the Pratt Institute until\n1966\n, she also taught as an adjunct professor of history of science at New York University for the years from\n1964\nto\n1966\n. She left both these positions in\n1966\nwhen she was appointed to Queens College of the City University of New York. As well as teaching at Queens College, she also taught at the City University of New York's Graduate Center.\nOne of Hellman's great achievements was her contribution to the founding of the Metropolitan New York Section of the History of Science Society. Mary Louise Gleason gives an excellent account of the founding of this Section in\n[\n7\n]\nand we give below some extracts to show the important role played by Hellman:-\nThe founding and early history of the Metropolitan New York Section of the History of Science Society\n(\n\"the New York Section\"\n)\nis closely identified with a small, dedicated, and enthusiastic group of scholars. Three academicians, C Doris Hellman, a historian of science at Pratt Institute and later at Queens College/CUNY, and\nCarolyn Eisele\nof Hunter College/CUNY and\nCarl Boyer\nof Brooklyn College/CUNY, both mathematicians, provided the principal inspiration and impetus for the new society, along with Lynn Thorndike, the distinguished historian of science at Columbia University, who served as Honorary Chairman during the first decade of the Section. The diligence, determination, and prescience of these founders and leaders of the Metropolitan New York Section of the History of Science Society helped establish an enduring legacy of collegial support and camaraderie for historians of science in New York City. ...\nCarolyn Eisele\nwent to Boston on December\n28\n,\n1949\n, to attend the annual meeting of the History of Science Society at the Club of Odd Volumes on Beacon Hill. ...\nEisele\nsat between Doris Hellman and Philippe LeCorbeiller and opposite Bern Dibner, none of whom she had met before but all of whom were to influence and support her personally and professionally over the course of a lifetime. ... Doris Hellman and\nCarolyn Eisele\ntravelled home from Boston by train together the next day, promising to stay in touch, wondering how to \"flush out a few historians of science\" in New York. ... Hellman and\nEisele\ndiscussed the idea of a New York group frequently, but more than two years passed before a July evening in\n1952\nwhen\nEisele\njoined Hellman and her family at dinner. Exploring what action to take, they began drawing up the short list of names. ... On February\n24\n,\n1953\n, Doris Hellman sent an announcement to several colleagues proposing to create \"a regional section of the History of Science Society, to serve Greater New York.\" The announcement notes that \"in Connecticut a similar section has proved valuable both to its members, by furnishing the opportunity of hearing papers and entering into discussions on the history of science, and to the national society, by introducing new members to its organization.\" ... In a letter several years later, Doris Hellman described the founding of the New York Section: \"A small but interested group met in my apartment in March\n1953\n. Among those present were the late Prof\nJekuthiel Ginsburg\nof Yeshiva and the late Prof D A Steele of Fordham, Prof\nCarl B Boyer\nof the mathematics department of Brooklyn College, Prof William Stahl of N.Y.U. but now Chairman of the Department of Classics and World Literature at Brooklyn College.\" ... From what I can conclude from talking with others who were closely involved with the very early years of the New York Section, the organization owed a lasting debt to\nCarolyn Eisele\nand Doris Hellman. They spent countless hours, in addition to their teaching and research, working to strengthen and enhance the Section. Their dynamism and enthusiasm were infectious. The New York Section and its members built upon their leadership and drew inspiration from them.\nIn\n1960\n, Hellman addressed the new Section she had done so much to set up\n[\n7\n]\n:-\nOn February\n29\n,\n1960\n, Doris Hellman presented a paper, \"Tracing the New Star of\n1572\nthrough the Libraries of Europe,\" sharing with her colleagues the fruits of her research during the previous five months in \"a Florentine library\" as a senior postdoctoral fellow sponsored by a National Science Foundation grant. Hellman's brief note to\nEisele\n, dated January\n30\n,\n1960\n, suggested some changes for the announcement of her paper and observed in her inimitable style: \"Some day, I'll belong to an organization with a short title\n(\nlike 'Metropolitan New York Section of the History of Science Society'\n)\n. That should make it easier to write me up. It took me months to learn the full title of IUHPS.\" Hellman's reputation preceded her, and the meeting generated such enthusiasm that \"two hundred students provided cookies.\" Her paper received recognition in the New Yorker - excellent publicity, introducing the work of a small, esoteric group of scholars to a broad non-professional audience.\nWe note that IUHPS, mentioned in this quote, is International Union of the History and Philosophy of Science and Hellman mentions this in January\n1960\nsince she had been appointed by the National Academy of Sciences National Research Council of the United States as a delegate to the International Union of the History and Philosophy of Science Congress on the History of Science held in Barcelona and Madrid in September\n1959\n. She received a grant from the American Council of Learned Societies to support her attendance at the Congress. The article\n[\n8\n]\nis Hellman's report on this International Congress which describes both the academic and social aspects of the meeting. The following International Congress of the History of Science was held at held at Cornell University, Ithaca, New York in\n1962\n. Hellman was the Secretary of this Congress.\nAnother important publication by Hellman was 'Kepler, by Max Caspar', which she translated and edited. You can read extracts from reviews which refer to Hellman's editing and translating at\nTHIS LINK\n.\nFinally we mention Hellman's work in relation to her father's publications. In\n1952\nAlfred Hellman, Doris's father, published\nA Collection of early obstetrical books\n. Alfred Hellman died in\n1955\nand, three years later, Doris Hellman produced a joint work with her late father\nAdditions to the Alfred M Hellman collection of early obstetrical books\n. Alfred Hellman's collections of\n400\nitems in\n14\nboxes as well as Abraham Lincoln Portraits and Memorabilia passed to his daughter Doris Hellman and, after her death, were donated to the Rare Book and Manuscript Library of Columbia University by her husband Morton Pepper.\nHer early death was announced in\n[\n10\n]\n:-\nDr C Doris Hellman, Professor of History at Queens College, and for many years a member and true friend of the History of Science Society, died at the age of sixty-three on March\n28\n,\n1973\n, at Lenox Hill Hospital in New York."
}