{
  "nome_completo": "Dugald Stewart",
  "nome_curto": "Dugald Stewart",
  "ano_nascimento": "1753",
  "ano_morte": "1823",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stewart_Dugald/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Dugald Stewart\n's father was\nMatthew Stewart\nwho was Professor of Mathematics at the University of Edinburgh at the time Dugald was born.\nMatthew Stewart\nhad married Marjorie Stewart, the only daughter of Archibald Stewart, writer to the signet, on\n20\nMay\n1750\n. Dugald was their only child who survived beyond childhood. He attended Edinburgh high school from\n1761\nto\n1765\nand then entered the University of Edinburgh where he took an arts degree although he attended courses in natural philosophy\n[\n7\n]\n:-\nFrom his classes in natural philosophy Stewart carried away the greatest admiration for \"the inductive method\".\nAdvised by his moral philosophy professor Adam Ferguson to attend the lectures of Thomas Reid in Glasgow, Stewart spent the year\n1771\n-\n72\nthere. He was particularly influenced by Reid's\nAn Inquiry into the Human Mind on the Principles of Common Sense\n(1764)\n. Stewart returned to Edinburgh in\n1772\nand by that time his father's health was deteriorating so Dugald Stewart assisted his father with teaching mathematics. In fact\nMatthew Stewart\nwas forced give up teaching and went to live on his estate at Catrine in Ayrshire. Dugald completely took over the duties of mathematics professor and he performed these duties so well that in\n1775\nhe was elected joint professor with his father.\nAlthough he was now the Professor of Mathematics at Edinburgh, his interests were firmly in philosophy and he also taught moral philosophy at Edinburgh during session\n1778\n-\n79\nwhile Adam Ferguson was in America. Stewart taught mathematics at Edinburgh for\n13\nyears until Adam Ferguson resigned in\n1785\nwhen he was appointed to the philosophy chair and resigned from the chair of mathematics. The following comment in\n[\n1\n]\nlinks Stewart's mathematics and philosophy:-\n[\nDugald\n]\nStewart, like Reid, held that philosophy should be a scientific discipline unfettered by metaphysical speculations and categories, though he objected to some of Reid's formulations of his new science of mind. Stewart's affinity for the scientific approach to philosophical problems is reflected in his mathematics career, and he often made analogies between the axioms of mathematics and the laws that govern human thinking.\nIn\n1783\nStewart married Helen Bannatyne; they had one son Matthew. Sadly Helen died in\n1787\n. On\n29\nJuly\n1790\nStewart married Helen D'Arcy Cranstoun; they also had one son George who died in\n1809\n. After the death of George, Stewart was greatly affected and his health began to deteriorate. He resigned from his chair in\n1810\n.\nStewart had been involved in an interesting controversy in\n1805\nover the appointment of\nLeslie\nto the chair of mathematics at Edinburgh. The story of this controversy, and Stewart's part in it, is told in\n[\n10\n]\nand it is an interesting one since it revolves round whether the Church could control the scientific views taught in the universities:-\nBefore his election the Edinburgh moderates had insinuated that\nLeslie\nwas an atheist. They adduced note xvi of his \"Heat\" in which he had written favourably about the doctrine of the sceptical David Hume that causation was nothing more than an observed constant and invariable sequence of events. When they brought forward their own candidate, Thomas MacKnight, an Edinburgh clergyman, Stewart and\nPlayfair\nprotested against the uniting of clerical and academic posts and objected to the intended clerical domination of the University of Edinburgh on the pattern of St Andrews. After\nLeslie\n's election the Edinburgh moderates, determined to oust\nLeslie\n, took the affair to the general assembly of the Church of Scotland, its highest forum, which decided in May\n1805\nby the narrow majority of\n96\nto\n84\nthat the affair be dropped and\nLeslie\nbe left undeposed from his mathematics chair.\nIn fact Stewart, in his role as an elder, supported\nLeslie\nwhen he addressed the General Assembly where\nLeslie\nwas charged with atheism. Stewart was a staunch believer in intellectual freedom and his views supporting\nLeslie\nwere set out in\nA short statement of some important facts\n(1805)\n.\nStewart was a philosopher of high international standing\n[\n8\n]\n:-\nStewart followed Reid in claiming that any philosophy which contravenes the principles of common sense must be false, and the problem is to discover and eliminate the premise which yields such results. he added the requirement that philosophical propositions must not change the meanings of concepts of ordinary life ...\nStewart's publications include\nOutlines of Moral Philosophy\n(1793)\n,\nPhilosophical Essays\n(1810)\n, and\nPhilosophy of the Active and Moral Powers of Man\n(1828)\n. His major publication, however, was\nElements of the philosophy of the human mind\nwhich appeared in three parts over a period of\n35\nyears. The first appeared in\n1792\n, the second in\n1814\nand the third part in\n1827\n. Grave writes in\n[\n8\n]\n:-\nNatural philosophy became science,\n[\nStewart\n]\nheld, when inquiry, freed from metaphysical conjecture, was directed towards discovering by observation and experiment the laws governing the connection of physical phenomena. The science of nature has advanced by bringing these uniformities, by the same method, under laws of higher generality ... The transformation of the philosophy of the mind is similar. It requires that the phenomena of consciousness be approached without conjecture and that the laws of connection be inductively established. The aim of the science of the mind is to arrive at a knowledge of the \"general laws of constitution\", which would correspond to Newtonian principles in physics and, like them, would make possible the deductive explanation of a great range of phenomena.\nIn fact Stewart's influence on physics is especially interesting and it form the main topic of\n[\n4\n]\nwhere Olson argues that Stewart's view of mathematics put geometry at its foundations rather than algebra, and that his views on this influenced the physical thinking of\nMaxwell\nand\nRankine\n. We end this brief description of Stewart's philosophical ideas with the following summary from\n[\n8\n]\n:-\nStewart was perfectly aware of the tensions in his own thinking. On the one hand, he was a thorough inductionist in philosophy and psychology ... On the other hand, he was sensitive to the realistic interpretations of\nKepler\nand\nGalileo\n, who saw that hypotheses were not simply instrumental devices. He was pulled both ways, and his work emerges as a significant connecting link between naive inductivism and later technical views on scientific theory ...\nThe following comment occurs in\nEncyclopaedia Britannica:-\n[\nDugald\n]\nStewart's affinity for the scientific approach to philosophical problems is reflected in his mathematics career, and he often made analogies between the axioms of mathematics and the laws that govern human thinking."
}