{
  "nome_completo": "Edith Hirsch Luchins",
  "nome_curto": "Edith Hirsch Luchins",
  "ano_nascimento": "1921",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Luchins/",
  "lugar_nascimento": "Brzeziny, Poland",
  "lugar_morte": "Suffern, New York, USA",
  "biografia": "Edith Hirsch Luchins\nwas the daughter of Max Hirsch. She was born in Brzeziny, about\n20\nkm east of Łódź in Poland. Edith Hirsch was brought up in Poland for the first six years of her life then, in\n1928\n, her family emigrated to the United States. Settling in New York City, she attended elementary school there, developing an interest in mathematics at this early stage in her education. She attended high school, also in New York City, and followed her interest in mathematics by taking every possible mathematics course the school offered. She also played a major role in the school mathematics club and used her skill in mathematics to her tutor other pupils.\nHer undergraduate years were spent at Brooklyn College, graduating with a B.A. in\n1942\n. While at high school Edith had taken a course on psychology taught by Abraham Samuel Luchins\n(\nborn\n8\nMarch\n1914)\n, who was then a graduate student in educational psychology at New York University. Not only did this course give her a life-long interest in psychology but a friendship with Abraham Luchins developed and they married a few months after Edith obtained a B.A. At this time Abraham Luchins was Max Wertheimer's research assistant. Edith Luchins spent the year\n1942\n-\n43\nworking as a government inspector of Antiaircraft Director at the Sperry Gyroscope Company, Long Island, as part of the war effort. She then studied for a Master's Degree at New York University entering in\n1943\nwhile Abraham Luchins served in the army. She was awarded an M.S. by New York University in\n1944\nand then began to work for a Ph.D. undertaking research under\nKurt Friedrichs\nand\nRichard Courant\n. As well as undertaking research, Luchins also was appointed as an instructor in mathematics at Brooklyn College. Her work towards a doctorate was progressing well, but was interrupted by the birth of her first child in\n1946\n. A second child born in\n1948\nmeant that she never completed her doctorate under\nFriedrichs\nand\nCourant\nfor in\n1949\nAbraham Luchins was appointed to a post in McGill University in Montreal, Canada. This child, born on\n1\nJuly, was Daniel Jonathan Luchins who became a leading psychiatrist, writing works with his two parents.\nDespite having to interrupt her doctoral studies, Luchins began to publish a series of papers with her husband including:\nTowards Intrinsic Methods in Testing\n(1946)\n,\nA Structural Approach to the Teaching of the Concept of Area in Intuitive Geometry\n(1947)\n,\nThe Satiation Theory of Figural After-Effects and Gestalt Principles of Perception\n(1953)\n, and\nVariables and Functions\n(1954)\n.\nThe Luchins family spent five years in Montreal during which time they had two further children. Edith did not give up academic work despite having four children to bring up but, as indicated by the publications we noted above, worked with her husband on the psychology of mathematical education. In\n1954\nAbraham Luchins was appointed to a position at the University of Oregon and despite having four children under eight years of age, she registered for a Ph.D. in mathematics at the University of Oregon. At Oregon her thesis advisor was Bertram Yood, and Luchins submitted her thesis\nOn Some Properties of Certain Banach Algebras\nin\n1957\n. She was awarded a Ph.D. from University of Oregon in\n1957\n. The American Association of University Women awarded her the New York State Fellowship for\n1957\n-\n58\nand during this year she prepared two papers for publication based on the results she had obtained in her doctoral thesis. In\n1958\nher fifth child was born and in the following year the two papers\nOn radicals and continuity of homomorphisms into\nBanach\nalgebras\nand\nOn strictly semi-simple Banach algebras\nappeared, both in the\nPacific Journal of Mathematics\n. Reviewing the first,\nFrank Bonsall\nwrites:-\nA\nBanach\nalgebra is said to be absolute if every homomorphism of a\nBanach\nalgebra into it is continuous, and is said to be strictly semi-simple if its two-sided regular maximal right ideals have zero intersection. It is proved that an absolute\nBanach\nalgebra contains no non-zero nilpotent elements, and that a strictly semi-simple\nBanach\nalgebra is absolute. For certain special\nBanach\nalgebras\n(\nincluding semi-simple annihilator algebras\n)\nit is proved that if B contains no non-zero nilpotent elements, then B is strictly semi-simple\n(\nand hence absolute\n)\n.\nReviewing the second, C E Rickart writes:-\nThe author defines the \"strict radical\" of an algebra to be the intersection of those of its\n2\n-sided ideals which are regular maximal right ideals. If the strict radical is zero, the algebra is called strictly semi-simple\n(\nsss\n)\n. An example of a sss\nBanach\nalgebra is the real algebra\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\nof all\nquaternion\n-valued functions which are continuous and vanish at infinity on the locally compact\nHausdorff\nspace\nX\nX\nX\n. Also, any subalgebra of\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\nis sss. It is proved that a real\nBanach\nalgebra is sss if and only if it is isomorphic with a subalgebra of\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\n. Thus any subalgebra\n(\nclosed or not\n)\nof a sss real\nBanach\nalgebra is sss. Finally it is proved that the strict radical of a real\nBanach\nalgebra contains the set of topologically nilpotent elements.\nAlso in\n1959\nher book\nRigidity Of Behavior,\nwritten jointly with her husband, was published by the\nUniversity Of Oregon Press\n. Luchins held faculty positions at Brooklyn College and the University of Miami before she was appointed to the Rensselaer Polytechnic Institute in Troy, eastern New York, in\n1962\n. Rensselaer, founded in\n1824\n, was unusual in being specifically dedicated from its foundation to the study of science and civil engineering. She was appointed a full professor at Rensselaer becoming the first woman to hold such a position. She retained her chair until\n1992\nwhen she formally retired but was made professor emeritus. She had spent the year before she formally retired,\n1991\n-\n1992\n, as distinguished visiting professor of mathematics at the United States Military Academy in West Point. Her husband spent the year in West Point with the Department of Behavioral Sciences and Leadership.\nLuchins wrote many books and papers, many jointly with her husband, and it is impossible to give more than just a brief indication of their range. Books written with her husband include:\nLogical Foundations Of Mathematics For Behavioral Scientists\n(1965)\n,\nWertheimer's Seminars Revisited: Problem Solving And Thinking\n(1970)\n, and\nMax Wertheimer's Life And Background: Source Materials\n(2\nVols.\n)\n(1991\n-\n1993)\n. Papers written with her husband include:\nLogicism\n(1964)\n,\nEffects of preconceptions and communications on impressions of a person\n(1970)\n,\nPrescriptive Dimensions of Gestalt Psychology: A Critical Evaluation\n(1978)\n, and\nGeometric Problem Solving Related to Differences in Sex and Mathematical Interests\n(1979)\n. Also in\n1979\nshe published\nSex Differences in Mathematics: How Not to Deal with Them\nin the\nAmerican Mathematical Monthly\n. Let us quote from this paper to gain an impression of the strong influence she had on the mathematical education of women:-\nEven casual observation of this distinguished assemblage reveals sex differences among mathematicians. There are both male and female mathematicians! This may seem to be a vehement way of expressing the obvious. But it seems to be not at all obvious to those who portray the history of mathematics. A case in point is an important collection of portraits and biographies of mathematicians throughout the ages on a wall map entitled \"Men of Modern Mathematics\". There is a woman among them,\nEmmy Noether\n. But absent are other women who, despite enormous obstacles, contributed significantly to mathematics, e.g.,\nSophia Germain\nand\nSonya Kovalevskaya\n. In a similar vein, a well-known and otherwise excellent textbook on the history of mathematics has no women listed in the name index - and seemingly not mentioned in the text- not even\nEmmy Noether\n, although her father,\nMax Noether\n, is listed. Still another well-known text on the history of mathematics referred to\nHypatia\nof the fourth century as the first woman mathematician to be mentioned in the history of mathematics - but it referred to no other women, at least not in its first three editions, even as recently as\n1969\n; however, there is a brief reference to\nEmmy Noether\nin the most recent edition of the text.\nThese are illustrations of ways in which not to deal with sex differences in mathematics. Do not ignore or overlook or hide the achievements of one sex. Let us find out more about these achievements and make them known to our colleagues, our students and the general public.\nTrue, famous women mathematicians throughout history can be counted on one's fingers. But when mathematics students were asked to name such women, they usually did not reach even the first finger. For example, when the request to name famous women mathematicians was made of\n26\nmathematics majors in a junior-senior level algebra class,\n24\ndid not list any names. In contrast, when they were then asked to name three to five famous mathematicians,\n22\nstudents answered, listing an average of four\n(\nmale\n)\nmathematicians. It is important to increase the awareness of the contributions of women mathematicians in the past.\nNor should we belittle the women's contributions. At a recent conference on women in the history of mathematics, one of the participants remarked that on the whole she was disappointed in the achievements of the women whose names were recalled. She need not have been, if she took into account the conditions under which they worked. Nor should their accomplishments be attributed to others. I am thinking of the allegation that\nSonya Kovalevskaya\n's mathematics was really due to her mentor,\nKarl Weierstrass\n. It was a male mathematician who made the quip that there is some doubt about whether\nKovalevskaya\nwas a mathematician and whether\nEmmy Noether\nwas a woman. It is not worth repeating, except to illustrate the depths to which we can sink in belittling the accomplishments of women in the history of mathematics. Let us give them their due.\nThis should be done not only for women in the past, but also for contemporary women mathematicians. Yet even women are not doing so. How many of us have portraits in our offices of women mathematicians to motivate the interest of our students and colleagues? How many of us use our initials in publications so that the author is not readily identified as a woman? How many of us do not bother to publish what some of our male colleagues might readily rush into print? This point was revealed to me while interviewing male and female recent Ph.D.'s in mathematics. More women than men thought that their doctoral theses were not worthy of publication, even when other mathematicians, including their male advisors, thought that they were. How many of us know outstanding contemporary women mathematicians? Informal surveys which I have conducted at mathematics meetings suggest that women are less informed in this respect than men. When asked to name five outstanding contemporary women mathematicians, fewer women than men named them, and many women admitted that they did not know any.\nOf course this was written by Luchins in\n1979\nand much has changed in the thirty years since then. But let us stress that the changes in attitudes today which make the piece above sound very dated are in no small part due to Luchins herself.\nMany of her works are concerned with applications of mathematics to philosophy and psychology. However, she returned to the topics of her doctoral dissertation writing\nCompletion of norms for\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\npublished in\n1971\nwhich she summarised as follows:-\nLet\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\ndenote the algebra of all continuous quaternion-valued functions vanishing at infinity on a locally compact\nHausdorff\nspace\nX\nX\nX\n. Under the natural norm\n(\nthe sup norm\n)\nand under the spectral radius norm\nr\n(\nf\n)\nr(f)\nr\n(\nf\n)\n, which is equivalent to the sup norm,\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\nis a\nBanach\nalgebra. Let\nd\n(\nf\n)\nd(f)\nd\n(\nf\n)\nbe any normed algebra norm for\nC\n(\nX\n,\nH\n)\nC(X,\\mathbb{H})\nC\n(\nX\n,\nH\n)\n. It is shown that\nd\n(\nf\n)\nd(f)\nd\n(\nf\n)\n, whether or not it is complete, majorizes the natural norm and\nr\n(\nf\n)\nr(f)\nr\n(\nf\n)\n. Under certain conditions on the radical of the completion of\nd\n(\nf\n)\n,\nd\n(\nf\n)\nd(f), d(f)\nd\n(\nf\n)\n,\nd\n(\nf\n)\nis equivalent to the natural norm and\nr\n(\nf\n)\nr(f)\nr\n(\nf\n)\n.\nIn\n1973\n, in collaboration with K C Mastan, she published\nQuasinilpotent operators as norm limits of nilpotent operators\n. A Lambert writes in a review:-\nThe authors announce some results concerning the closure of the set of nilpotent operators on a\nBanach\nspace. Primary attention is paid to a radical algebra\nT\nT\nT\nof operators on\nC\n[\n0\n,\n1\n]\nC [0,1]\nC\n[\n0\n,\n1\n]\nwith the property that the closure of the set of nilpotent elements of\nT\nT\nT\nforms a maximal ideal.\nLuchins received many honours for her outstanding contributions including the Rensselaer Distinguished Teaching Award, the Darrin Counseling Award, the Martin Luther King Jr Award, and the Rensselaer Alumni Association Outstanding Faculty Award. She also received the Award for Distinguished Public Service at West Point. In\n1998\nshe was made an honorary member of the Society for Gestalt Theory and Its Applications.\nEdith Hirsch Luchins died at the Good Samaritan Hospital in Suffern, New York. She was buried in the New Mount Carmel Cemetery in Cypress Hills, Queens. Abraham Luchins died on\n27\nDecember\n2005\n."
}