{
  "nome_completo": "Edwin Plimpton Adams",
  "nome_curto": "Edwin P Adams",
  "ano_nascimento": "1878",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Adams_Edwin/",
  "lugar_nascimento": "Prague, Bohemia, Austro-Hungary (now Czech Republic)",
  "lugar_morte": "Princeton, USA",
  "biografia": "Edwin P Adams\nstudied at Beloit College, giving his Valedictory Address there entitled 'Ether' on\n21\nJune\n1899\n. He studied in Harvard, Berlin, Göttingen and Cambridge, England, obtaining his doctorate in\n1904\nfrom Harvard. He became Professor of Physics at Princeton University in\n1909\n.\nIn\n1917\nAdams took leave from Princeton and joined the Royal Engineers in the British Army for active service in France. He wrote several letters describing his day-to-day experiences during the war. These brief glimpses provide an understanding of the daily life of those serving in the War. Here is one example of a quotation from his letters:-\nIt is rather hard to write a detailed account of myself during the last few days; but we were driven back several times and have been on the move for the last three days. All of our men got away safely in perfect good order and we saved most of our equipment. How we all escaped I do not know nor understand as we were under rather heavy fire for some time...\nHis greatest fame came in\n1921\nwhen\nEinstein\nfirst visited Princeton to deliver five Stafford Little lectures on the theory of relativity and to accept an honorary degree. Each lecture, which\nEinstein\ndelivered in German, was followed with a résumé in English by Princeton physicist Edwin P Adams, who was, the\nDaily Princetonian\nnoted, among the leading American expositors of the relativity theory, along with his Princeton colleagues mathematician\nLuther P Eisenhart\nand astrophysicist Henry Norris Russell. After being submitted to\nEinstein\nfor revision and final approval, a transcript of the lectures was translated into English by Professor Adams for publication by Princeton University Press, which gained the distinction of being the first United States publisher to bring out a book by the world's most acclaimed living scientist.\nThe Meaning of Relativity\nhas been republished in five editions and is still in print. Adams's translations appeared in the\nNew York Evening Post\n(\nthe first four lectures\n)\nand the\nNew York Times\n(\nthe fifth lecture\n)\na day after the respective lectures.\nAdams was elected to the American Philosophical Society in\n1915\n. In November of the same year he became a member of the\nEdinburgh Mathematical Society\n, remaining in the Society through his career. In\n1945\nhe retired from Princeton and was made Professor Emeritus.\nFor further biographical information on Edwin Adams, see\nTHIS LINK\n.\nFinally we give two examples of Adams' mathematical papers. In\n1920\nhe published\nThe potential of ring-shaped discs\n. In\n1940\nhe published\nNote on a problem in electrostatics\n.\nL M Milne-Thomson\nwrites in a review of this latter paper:-\nThe solution of two-dimensional electrical and hydrodynamical problems connected with a grating of rounded bars was obtained by\nH W Richmond\nbeginning with a grating of bars of rectangular section. The present paper extends this method to the case where the bars are mid-way between parallel planes. The consequent numerical calculations are performed with the aid of the reviewer's tables of elliptic functions."
}