{
  "nome_completo": "Edwin Ford Beckenbach",
  "nome_curto": "Edwin Beckenbach",
  "ano_nascimento": "1906",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Beckenbach/",
  "lugar_nascimento": "Dallas, Texas, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Edwin Beckenbach\nwas known as Ed. His parents were Charlie Geiger Beckenbach and Lucy Emma Richardson. He entered The Rice Institute\n(\nnow Rice University\n)\nin Houston as an undergraduate and was awarded his B.A. in\n1928\n, continuing his studies there and obtaining his M.A. in the following year. His research at Rice was supervised by Lester Ford, and Beckenbach was awarded his doctorate in\n1931\nfor his dissertation\nMinimal Surfaces in Euclidean N-Space\n.\nAfter being awarded his doctorate Beckenbach was awarded a National Research Council Fellow for the two years\n1931\n-\n33\nwhich enabled him to study at Princeton, Ohio State University and the University of Chicago. He married Madelene Shelby Simons on\n30\nAugust\n1933\n. They had three children, Edwin Simons Beckenbach, Madelene Lenann Beckenbach\n(\nlater Lenann Nye\n)\n, and Sonya Suzann Beckenbach\n(\nlater Suzann Morse\n)\n. Beckenbach returned to Rice in the autumn of\n1933\nwhere he was appointed as an instructor in mathematics. In\n1940\nhe was appointed as an Assistant Professor of Mathematics at the University of Michigan, then two years later as an Associate Professor of Mathematics at the University of Texas at Austin. In\n1945\nhe moved to the University of California at Los Angeles as a Professor of Mathematics and held this post until he retired in\n1974\n.\nJohn W Green,\nErnst Straus\n, and Kirby Baker, colleagues of Beckenbach who wrote an obituary of him, described his major contributions to the University of California at Los Angeles:-\nAt UCLA, he was a leader in developing the graduate program, from the moment of his arrival. The first Ph.D. in Mathematics at UCLA was awarded in\n1947\nto a student of his\n(\njointly with W T Puckett\n)\n. He also was Acting Chairman of the Mathematics Department for a year. In addition, he made two very important special contributions. First, he almost single-handedly brought to bear the influence that caused the creation in\n1948\nof the Institute for Numerical Analysis on the UCLA campus. This was a branch of the National Bureau of Standards devoted to computing and the construction and use of computing machines. Its SWAC computing machine, built at UCLA, was for a number of years one of the half dozen most powerful computers in the world. The group of mathematicians who gathered in connection with it made UCLA well known world-wide and influenced the development of mathematics here ever after. Second, he was\n(\ntogether with\nFrantišek Wolf\n, of Berkeley\n)\na main influence in the establishment in\n1951\nof the Pacific Journal of Mathematics, a major international mathematical research journal sponsored by a dozen or more West Coast universities. Its headquarters and Managing Editors, of whom Ed was the first, have always been at UCLA - something that has contributed strongly to mathematics at UCLA and to the visibility of its mathematical group.\nIn June\n1960\nBeckenbach and Madelene were divorced and he married Alice Curtiss Tucker on\n24\nJune\n1960\n. His colleagues write:-\nWe will long remember the hospitality they extended so often and graciously to local and visiting scientists and their other friends. Not the least of these events were the famous \"Mother-ins.\" These were receptions, held on or near Mothers Day, to which all UCLA mathematicians and their families were invited to hike, swim, and have a good time.\nAmong Beckenbach's first publications are\nThe area and boundary of minimal surfaces\n(1932)\n, and two papers written jointly with Tibor\nRadó\nand published in the\nTransactions of the American Mathematical Society\nin\n1933\n, namely\nSubharmonic functions and minimal surfaces\nand\nSubharmonic functions and surfaces of negative curvature\n. He wrote a series of books and acted as editor for several more texts. For example he edited\nModern mathematics for the engineer\n(1956)\nwhich was in three parts, namely mathematical models, probabilistic problems, and computational considerations. Each part consisted of a number of chapters, each having been given as a lecture in an extension course at the University of California, Los Angeles, and also at the Corona Laboratories of the National Bureau of Standards. In\n1961\nhe edited a second series of\nModern mathematics for the engineer\nwhich was divided into three parts as was the earlier volume. The lectures on which the chapters were based had been given at the University of California during session\n1958\n-\n59\n.\nHe also wrote texts for the Monograph Project of the School Mathematics Study Group which were aimed at able high school students. One such text, written jointly with Richard Bellman, was\nAn introduction to inequalities\n(1961)\n. The book begins with a study of axiomatics, then examines several classical inequalities of analysis such as the relationship between the arithmetic mean and geometric mean, the\nCauchy\n,\nHölder\n, and\nMinkowski\ninequalities, and the triangle inequality. Applications to geometric maximum and minimum problems are given, and the final chapter studies some special distance functions. C Brumfiel, reviewing the text, writes:-\nThis is not a light, popular treatment of the subject. Students with a superficial interest in mathematics will soon lose interest as they are confronted with details of proofs. But the excellent student who works through the book carefully will acquire valuable skills and understandings.\nThe topic of inequalities was of interest to Beckenbach for many years. As well as the above text, and a second\nInequalities\nalso written with Richard Bellman and published in\n1971\n, he helped organise three international conferences on the topic at Oberwolfach in Germany in\n1976\n,\n1978\nand\n1981\n. He was an editor of the Proceedings of these three conferences which were published in\n1978\n,\n1980\nand\n1982\nrespectively.\nBeckenbach contributed to mathematics with a series of texts for schools and colleges. We have mentioned one such text above, but let us give an incomplete list:\nCollege Algebra\n(1964)\n,\nModern Introduction to Analysis\n(1964)\n,\nApplied Combinatorial Analysis\n(1964)\n,\nEssential of College Algebra\n(1965)\n,\nIntegrated College Algebra and Trigonometry\n(1966)\n,\nModern School Mathematics\n(1967)\n,\nAlgebra\n(1968)\n,\nPre-algebra\n(1970)\n,\nModern College Algebra and Trigonometry\n(1969)\n,\nAnalysis of Elementary functions\n(1970)\n,\nIntermediate Algebra for College Students\n(1971)\n,\nModern Analytic Geometry\n(1972)\n,\nConcepts of Communications: Interpersonal, Intrapersonal and Mathematical\n(1972)\n, and\nCollege Mathematics for Students of Business and the Social Sciences\n(1987)\n.\nAnother major contribution made by Beckenbach was through his work for the\nAmerican Mathematical Society\n. He served as a member of the Council and as Chairman of the Committee for printing and publishing from\n1956\nto\n1961\nand Chairman of the Committee to study the financial problems of Mathematical Reviews from\n1963\nto\n1964\n. He also did extensive committee and editorial work for the\nMathematical Association of America\nbeing Chairman of their publications committee from\n1971\nto\n1982\n. He was elected a fellow of the\nAmerican Academy of Arts and Sciences\n, the\nIndian Mathematical Society\n, the\nFrench Mathematical Society\n, and the\nMathematical Circle of Palermo\n. The\nMathematical Association of America\ndecided to give him their Award for Distinguished Service for outstanding service to mathematics, apart from research, and shortly before his death he received word of this decision. The award was presented posthumously at the meeting of the Association in January\n1983\n.\nAs to his interests outside mathematics:-\nAny report on Ed Beckenbach would be hopelessly incomplete without mentioning his\n(\nand Alice's\n)\nlove of tennis. In fact his interest in tennis may have extended over a longer period than his interest in inequalities. He played intercollegiate tennis at Rice, was Captain of the team and later was Coach. He played a game of tennis the morning of the day he suffered his fatal stroke."
}