{
  "nome_completo": "Edwin Bailey Elliott",
  "nome_curto": "Edwin Elliott",
  "ano_nascimento": "1851",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Elliott/",
  "lugar_nascimento": "Oxford, England",
  "lugar_morte": "Oxford, England",
  "biografia": "Edwin Elliott\n's father was Edwin Litchfield Elliot. He was educated at Magdalen School in Oxford then, in\n1869\n, he entered Magdalen College of the University of Oxford to study mathematics. After outstanding achievements at university, Elliott became a Fellow and Mathematical Tutor of Queen's College, Oxford, in\n1874\n.\nIn addition to his Fellowship at Queen's College, Elliott was appointed a lecturer in mathematics at Corpus Christi College in Oxford in\n1884\n. These appointments came to an end in\n1892\nwhen Elliott became the first Waynflete professor of Pure Mathematics. This chair was named after William of Waynflete, the English lord chancellor and bishop of Winchester who founded Magdalen College in the\n15\nth\ncentury. The Waynflete chair came with a Fellowship at Magdalen College so Elliott was again attached to his old College. One year after being appointed to the Waynflete Chair of Pure Mathematics, Elliot married Charlotte Amelia Mawer.\nElliott held the Waynflete chair for\n29\nyears until his retirement in\n1921\n. During this time he was much involved with the\nLondon Mathematical Society\n, being President of the Society from\n1896\nto\n1898\n. A few years before this, in\n1891\n, he had been honoured by being elected a Fellow of the\nRoyal Society\n. As Chaundy writes in\n[\n2\n]\n:-\nElliott's mathematical life circulated round the twin foci of Oxford and London. Besides his work in formal teaching and lecturing at Oxford, he was one of the founders\n(1888)\nof the Oxford Mathematical Society, its first secretary, and later its president.\nHis mathematical work included algebra,\nalgebraic geometry\n, synthetic geometry,\nelliptic functions\nand the theory of convergence. However his most important contribution was the book\nAn introduction to the algebra of quantics\nwhich was first published in\n1895\n. This work was a major contribution to\ninvariant theory\n.\nIn the book Elliott presented a wealth of material on invariant theory which had been developed on the Continent of Europe, but he presented it in a style which was more familiar to English mathematicians familiar with the work of\nCayley\nand\nSylvester\n. It was a popular book and, in\n1913\n, Elliott published a second revised edition.\nHis contributions to teaching at Oxford are described in\n[\n1\n]\n:-\nAs a teacher he found his chief satisfaction in being of use to others, and was unsparing in his help and encouragement, not only of his more promising pupils but to some very poor mathematicians.\nAll ageing mathematicians should be particularly pleased to learn that a second piece of work by Elliott, which was again of major importance, was his contribution to the theory of\nintegral equations\nwhich he made after he retired. In fact he was aged\n77\nwhen he produced these important results.\nIn\n[\n2\n]\nhis work is described as:-\n... like all good mathematics .. distinguished by simplicity and naturalness, surprising results being often achieved by the exploitation, with real insight, of ideas in themselves elementary.\nElliott wrote well and he always produced clear rigorous arguments. He could not abide sloppy mathematics and anyone producing hand-waving proofs was likely to be severely criticised by him. He was not only critical of others, in many ways he was his own hardest critic.\nOutside mathematics, Elliott had many interests. Music, natural history and literature were all high on his list of hobbies. However these were often more than mere hobbies. For example he founded the oldest literary society in Queen's College.\nChaundy, in\n[\n2\n]\n, describes him as:-\n... modest and retiring, hesitant in speech, unfailing in helpfulness to others, a much loved man.\nIt is fair to say, however, that his impact in the development of mathematics was less than might be expected of someone of his great mathematical gifts. This is almost certainly because he was a rather old-fashioned mathematician whose work:-\n... looked back to a closing epoch. It was typically English, it could be called Victorian; it lacked sympathy with more recent developments, but it had honesty and dignity..."
}