{
  "nome_completo": "Einar Carl Hille",
  "nome_curto": "Einar Carl Hille",
  "ano_nascimento": "1894",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hille/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "La Jolla, California, USA",
  "biografia": "First we should note that\nEinar Carl Hille\nwas not given this name at birth. His name was Carl Einar Heuman and he was the son of Carl August Heuman, a civil engineer, and Edla Eckman. Hille's parents separated before his birth and he was brought up by his mother. The name Hille was simply a mistake for Heuman but Hille's mother adopted the name even although it came from an error and called herself Edla Hille. That was the name by which Einar Hille was always known. Hille did not meet his father until\n1937\n.\nAlthough he was born in the United States, Hille's parents were Swedish. When Einar Hille was two years old his mother returned to Sweden and lived in Stockholm. Hille would spend the next\n24\nyears of his life in Sweden only returning to the United States when he was\n26\nyears old. In\n1900\nEinar entered the Palmsgrenska Samskola, a private school in Stockholm. When he left in\n1911\nit was not mathematics in which he intended to make his career, rather it was chemistry.\nHille entered the University of Stockholm in\n1911\nwith the intention of reading for a degree in chemistry. In fact he studied the subject for two years at university and he was taught by an exceptional chemist in Hans von Euler-Chelpin. He had been appointed professor of general and inorganic chemistry in\n1906\nand he worked on the biochemistry of sugar and phosphates and he was awarded the Nobel prize for chemistry in\n1929\nfor his work on enzymes in the fermentation of sugar. He also helped determine the chemical structures of several vitamins. Hille made an impressive start to his career in chemistry with his first publication in\n1913\nbeing jointly with Euler-Chelpin. However, Hille decided that he did not have the necessary dexterity to make a career in a subject which involved delicate experiments. He therefore decided to give up his work with Euler-Chelpin and to study a topic which required no experimental expertise at all, namely mathematics.\nHille was fortunate in not only having a world class chemist to work under in Stockholm, but also world class mathematicians. He began to study under Ivar\nBendixson\nand Helge von\nKoch\n. Hille was awarded his first degree in mathematics in\n1913\nand the equivalent of a Master's degree in the following year. Then Hille began working with\nMarcel Riesz\non conformal mappings and submitted a thesis on that topic in\n1916\n; for this he was awarded a Lic. Ph. During this time at Stockholm he was also strongly influenced by\nMittag-Leffler\n.\nBy this time Europe was engulfed by World War I and Hille undertook war work, serving in the Swedish army for two years as a typist. While in the army he decided to undertake research for his Ph.D. and this he did without any further supervision. He received a Ph.D. from Stockholm in\n1918\nfor a doctoral dissertation entitled\nSome Problems Concerning Spherical Harmonics\n. In\n1919\nHille was awarded the\nMittag-Leffler\nprize for his outstanding contributions, and was given the right to teach at the University of Stockholm. He was employed in the Swedish civil service for two years starting from the end of World War I.\nHille obtained a fellowship to work with\nBirkhoff\nin Harvard and he returned to the land of his birth in\n1920\n, spending the academic year\n1920\n-\n21\nat Harvard where, as well as working with\nBirkhoff\n, he also studied with\nKellogg\n. In academic year\n1921\n-\n22\nHille was\nBenjamin Peirce\nInstructor at Harvard then, in\n1922\n, he went to Princeton as an instructor.\nIn\n1923\nHille was promoted to assistant professor at Princeton, and in\n1927\nto associate professor. In\n1933\n, he was appointed full professor at Yale University and four years later, in\n1937\n, he married Kirsti Ore, who was the sister of his Yale colleague, the mathematician\nØystein Ore\n. Kirsti Hille wrote the article\n[\n5\n]\nafter the death of her husband. Kirsti and Einar had two children, both sons. Hille was appointed director of graduate studies in\n1938\nand he held this position, and his chair, at Yale until he retired in\n1962\n.\nHille's main work was on\nintegral equations\n,\ndifferential equations\n,\nspecial functions\n,\nDirichlet\nseries and\nFourier series\n. Later in his career his interests turned more towards\nfunctional analysis\n. Zund writes in\n[\n9\n]\n:-\nHille was one of the few mathematicians who brought to his study of functional analysis - operator theory some twenty years experience in classical analysis. Moreover, he was almost unique among mathematicians in applying functional analysis to investigate classical problems, rather than simply considering abstract situations for their own sake.\nHe is well known as an author of a number of texts. The first of these was\nFunctional analysis and\nsemigroups\n(1948)\n.\nStone\n, reviewing the book, writes:-\nIt is impossible in a review of this kind to give an adequate account of the wealth of material covered in the book, or to emphasize the interest of specific results. It is appropriate to note the systematic, incisive and polished character of the author's treatment. His scholarly handling of the subject will be appreciated by all users of the book, as will the clarity of his expository style.\nAmong Hille's other texts were\nAnalytic function theory\nVol\n1\n(1959)\n, Vol\n2\n(1964)\n;\nAnalysis\nVol\n1\n(1964)\n, Vol\n2\n(1966)\n;\nLectures on ordinary differential equations\n(1969)\n;\nMethods in classical and\nfunctional analysis\n(1972)\n; and\nOrdinary differential equations in the complex domain\n(1976)\n. In the preface of\nMethods in classical and functional analysis\nHille explains both about his aims in writing the text and his view of mathematics:-\nModes come and go in mathematics as in most fields. During the half-century and more that I have worked in the vineyard I have heard many dire predictions for the fate of my ideas and interests. Abstraction has been in the saddle during most of the time and has ridden us mercilessly. In a modest way I have taken part in this development. I did not believe in abstraction per se, one should know what one is trying to generalize and one should show that the generalization is significant. I have tried to keep at least one foot on the ground while craning my neck to look into Heaven. What is Heaven? There are some doubts, and the more extravagant claims of the abstract mathematicians to be the sole dispenser of the true faith and the arbiters of values are received with a healthy scepticism.... This book may be regarded as part of the backlash. If the book has a thesis, it is that a functional analyst is an analyst, first and foremost, and not a degenerate species of a topologist. His problems come from analysis and his results should throw light on analysis.... It seemed to me that I could do some useful work in giving the student a historical perspective and in showing how the multitude of abstract concepts have arisen and are present in Euclidean spaces.\nThe article\n[\n2\n]\nlist\n175\npapers and\n12\nbooks written by Hille. The book\n[\n1\n]\nreproduces\n47\nselected papers of Hille, published in the years\n1922\n-\n1969\n. The book also contains a personal account of Hille's mathematical career which he gave at the Yale Colloquium in May\n1962\n. The same autobiographical paper appears as\n[\n4\n]\n.\nHille served as president of the\nAmerican Mathematical Society\n(1937\n-\n38)\nand was the Society's Colloquium lecturer in\n1944\n. As well as editorial work with the\nAnnals of Mathematics\n(1929\n-\n33)\nand the\nTransactions of the American Mathematical Society\n(1937\n-\n43)\nhe received many honours including election to the\nNational Academy of Sciences\n(1953)\nand the Royal Academy of Sciences of Stockholm. He was honoured by Sweden with their award of the Order of the North Star."
}