{
  "nome_completo": "Elbert Frank Cox",
  "nome_curto": "Elbert Cox",
  "ano_nascimento": "1895",
  "ano_morte": "1969",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cox_Elbert/",
  "lugar_nascimento": "Evansville, Indiana, USA",
  "lugar_morte": "Washington, D.C., USA",
  "biografia": "Elbert Cox\n's parents were Eugenia D Talbot and Johnson D Cox who were African Americans. Johnson Cox was the principal of a high school, having taken courses at Evansville College and graduate studies at Indiana University. The district of Evansville, where Elbert was brought, was racially mixed but schooling was segregated. His family were deeply religious with a love for education.\nAt high school Elbert showed talents which made his choice of career a difficult one. He was a talented violinist but also showed remarkable talents in mathematics and physics. What must have made a decision harder to make was that Cox was awarded a music scholarship which would have enabled him to travel to Europe to study at the Prague Conservatory of Music. His love of mathematics won and he entered Indiana University, receiving an A.B. in\n1917\nhaving majored in mathematics and scored an \"A\" in every mathematics examination he took. The transcript which he was presented with had \"COLORED\" printed across it. He was appointed as a mathematics teacher at Alves Street School in Henderson, Kentucky, but early in\n1918\nhe resigned and enlisted in the army. World War I was drawing to a close but Cox was sent to France where he served until\n1919\nwhen he was discharged.\nAfter returning to the United States, Cox was appointed to Shaw University in Raleigh, North Carolina, where he became chairman of the Department of Natural Sciences. In December\n1921\nhe applied for a graduate scholarship at Cornell University, then only one of seven universities in the United States offering a PhD programme in mathematics. One of his referees praised him highly but expected:-\n... certain difficulties for the young man because of the fact he is of the colored race.\nCox received the scholarship and entered Cornell in September\n1922\n. His doctoral studies were supervised by William Lloyd Garrison Williams. In\n1924\nhe was awarded a Erastus Brooks Fellowship and he spent some time in McGill University in Montreal in that year since his supervisor was working there. In\n1925\nCox was awarded his doctorate for his thesis\nPolynomial solutions of difference equations\n. Williams felt that since Cox was the first person of his race in the world to be awarded a doctorate in mathematics it was necessary for him to have the recognition by a university outside the United States. Universities in England and Germany refused to consider his doctoral thesis but the Imperial University in Sandai, Japan, accepted it. Carey writes\n[\n2\n]\n:-\nHis accomplishment helped to make it possible for other black mathematicians, such as\nDudley Welcon Woodard\n, William Waldron Shiefflin Claytor,\nMarjorie Lee Browne\n,\nEvelyn Boyd Granville\nand\nDavid Blackwell\n, to receive their doctorates from American universities.\nThe authors of\n[\n3\n]\nillustrate the difficulties that Cox had to endure to obtain his doctorate. In particular they point out that America produced a total of only\n28\nPh.D.'s in mathematics in\n1925\n(\none of whom was Cox\n)\n, while this was the erea of the Ku Klux Klan with\n31\nAfrican-Americans being murdered by lynching in\n1926\n.\nAfter receiving his doctorate Cox was appointed as professor of physics at West Virginia State College. This was a College for black students and was very poorly funded. Cox was only the second faculty member to hold a doctorate and he set about trying to raise the level of the College which did not even possess a science library. On\n14\nSeptember\n1927\nCox married Beulah P Kaufman, the daughter of a former slave, who was an elementary school teacher. They had three children, James, Eugene, and Elbert. In the year after his marriage, Cox was appointed associate professor of mathematics at Howard University in Washington, D.C. The University was open to students of any race, colour, or creed, but it had been founded in\n1867\n(\nnamed after General Oliver Otis Howard who persuaded Congress to provide funding\n)\nto provide advanced studies for black students.\nCox had little opportunity to continue with his research. As Donaldson and Fleming write\n[\n3\n]\n:-\nThe heavy workloads and lack of financial support in the historically black colleges made it nearly impossible to carry on any type of research program and produce publications needed to achieve a scientific reputation.\nHowever Cox was an outstanding teacher of mathematics.\nBlackwell\n, who was appointed to Howard University in\n1944\n, wrote\n(\nsee\n[\n3\n]\n)\n:-\nYear after year, our master's students consistently did much better in departmental oral examinations on material they'd studied with Cox than on material they'd studied with me or from our colleagues Woodward, Claytor, and others.\nDuring the years of World War II Cox contributed to the war effort by teaching engineering science and war management from\n1942\nto\n1944\nand also headed a specialist army training programme from\n1943\nto\n1945\n. He was promoted to full professor at Howard University in\n1947\nand served twice as head of mathematics before it combined with physics in\n1957\n[\n1\n]\n:-\nIn\n1957\nthe departments of mathematics and physics were merged, and Cox chaired the combined department until\n1961\n. He retired in\n1966\nwith the reputation of having supervised more master's theses than any other member of Howard's faculty.\nAlthough the mathematics PhD programme at Howard only started after Cox's death, he did much to make it possible\n[\n4\n]\n:-\nWhile Cox did not live to see the inauguration of the Ph.D. program at Howard, it is believed by many that Cox did much to make it possible.  Cox helped to build up the department to the point that the Ph.D. program became a practical next step.  He gave the department a great deal of credibility; primarily because of this personal prestige as a mathematician, as being the first Black to receive a Ph.D. in mathematics, because of the nature and kinds of appointments to the faculty that were made while he chaired the Department, and because of the kinds of students that he attracted to Howard to study mathematics at both the undergraduate and master's levels.\nAfter Cox retired he hoped to be able to return to research and writing about mathematics. However his health was not sufficiently good to let him achieve that. He died at Cafritz Memorial Hospital after a short illness.\nHoward University set up the Elbert F Cox Scholarship Fund in\n1975\nto help Black students progress to studying graduate level mathematics. The National Association of Mathematicians honoured Cox with the inauguration of the annual Cox-\nTalbot\nAddress in\n1980\n."
}