{
  "nome_completo": "Enoch Beery Seitz",
  "nome_curto": "Enoch Beery Seitz",
  "ano_nascimento": "1846",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Seitz/",
  "lugar_nascimento": "Rush Creek Township, Fairfield County, Ohio, USA",
  "lugar_morte": "Kirksville Benton Township, Adair, Missouri, USA",
  "biografia": "Enoch Beery Seitz\n' parents were Daniel Seitz and Catherine Beery. Daniel\n(\nborn in\n1791\nin Rockingham County, Virginia\n)\nwas a farmer. He married Elizabeth Hite in June\n1813\nand they had eleven children but Elizabeth died in\n1831\n. Following the death of his first wife, he married Catherine Beery\n(\nborn in\n1808\nin Fairfield County, Ohio\n)\n, a second cousin, on\n15\nApril\n1832\n. Enoch Beery Seitz was one of Daniel and Catherine's eight children, being the third of their four sons. He was brought up on the family farm and had little formal education at this stage, only taking the common-school course. However, the boy was always keen to learn and it is said that he would plough the fields reading a book propped up on the plough.\nFinkel\nwrites\n[\n6\n]\n:-\nPossessing a great thirst for learning, he applied himself diligently to his books in private and became a very fine scholar in the English branches, especially excelling in arithmetic. It was told to the author, by his nephew Mr Huddle, that when Seitz was in the field with a team, he would solve problems while the horses rested. Often he would go to the house and get in the garret where he had a few algebras upon which he would satiate his intellectual appetite. This was very annoying to his father who did not see the future greatness of his son, and many and severe were the floggings he received for going to his favourite retreat to gain a victory over some difficult problem upon which he had been studying while following the plough. Though the way seemed obstructed, he completed algebra at the age of fifteen, without an instructor.\nHis father Daniel died in October\n1864\nand, in about\n1866\n, his mother Catherine, together with Enoch and another couple of her children, moved to Greenville, Ohio. Seitz attended a normal school at Greenville and then enrolled at the Wesleyan College in Delaware, Ohio. He did not take mathematics courses at the College but continued to study mathematics in his own time. He left the Wesleyan College in\n1870\nwithout graduating and, in\n1872\n, was appointed as an assistant teacher at the Greenville Normal School. On\n24\nJune\n1875\n, Seitz married Anna Elizabeth Kerlin. Anna, whose parents were William Kendrick Kerlin and Hannah Jefferis, was born in Wayne County, Indiana on\n27\nDecember\n1854\n. She had moved with her parents to Greenville, Ohio in\n1865\nwhere her father was a banker. Anna became a school teacher in\n1872\nand taught until her marriage to Seitz. Enoch and Anna Seitz had four sons: Ray E Seitz studied law at the University of Cincinnati; Willie Kerlin Seitz became a science teacher in Lancaster, Missouri; Clarence D Seitz died in\n1886\nat the age of four; and Enoch Beery Seitz excelled in science and mathematics. Seitz's contributions to Greenville were spoken about in an address to the Darke County Teachers' Association following his death\n[\n4\n]\n:-\n... while he was perfectly at home in the sciences, mathematics seemed to be his delight. The more difficult the question, the more determined was he to master it, and from\n[1872\nto\n1879]\n, I never knew him to fail in the solution of any problem he undertook. ... For a number of years he filled the position of principal in the Greenville high school with ability and entire satisfaction. As a member of the board of county school examiners, the teachers will remember him as being consistent, kind and obliging; ever willing to encourage the despondent, assist the needy, and by influence and example lead them to a higher sphere of usefulness. As chairman of the executive committee of our Institute, he was honest, conscientious, and, whether in the discharge of financial duty, or in a demonstration before the Institute, he seemed to possess the same earnest determination to do his whole duty faithfully.\nIn\n1879\nSeitz was appointed as a teacher at the North Missouri State Normal school in Kirksville, Missouri\n(\nnow called Truman State University\n)\n[\n4\n]\n:-\nWhen he left Greenville for his field of labour in Missouri, nearly a hundred teachers accompanied him to the train, and he was cheered and encouraged by their kind wishes and congratulations.\nThe family moved to Kirksville, but Seitz died of typhoid fever four years later. He had just accepted the position of professor of mathematics at the University of Texas but died before being able to take up the post\n[\n8\n]\n:-\nFollowing Enoch's death in\n1883\n, Anna returned to Greenville and resumed her teaching career for nine years. She then returned to Kirksville as a professor at the Normal School and principal or supervisor of its demonstration school from\n1894\nto\n1898\n. Her three surviving sons began attending the Normal School. During this period, Anna also began attending Columbian School of Osteopathy, from which she graduated in\n1899\n, becoming a doctor of osteopathy. She practised in Richmond, Indiana, Cape Girardeau, Missouri, and Phoenix, Arizona. In early\n1904\n, Anna completed for a post-graduate course at Kirksville's American School of Osteopathy\n(\nat the time a separate institution from Columbian\n)\n. In February of that year, she returned to Greenville, Ohio, where she became the only female osteopathic practitioner in Darke County. Anna died on\n19\nFebruary\n1918\n.\nWe have said nothing yet of Seitz's mathematical contributions. A Memorial Plaque, dedicated to Seitz's memory in\n1929\n, is in the old Bremen High School. It reads:-\nTo the Memory of Enoch Beery Seitz, One of the World's Greatest Mathematicians.\nBenjamin Finkel\n[\n5\n]\ndescribes Seitz as:-\n... the most distinguished mathematician of his day.\nAlthough these might appear as exaggerated claims, one has to see them in the context of mathematics in the United States in the\n1870\ns. This must be seen as a period when there was little research level mathematics being done anywhere in the country yet there was a lively interest in challenging mathematical problems and puzzles which set the scene for the later rapid move to high powered research. Seitz, although he died at the age of\n37\n, contributed over\n500\npublished problems and solutions in the\nAnalyst\n, the\nMathematical Visitor\n, the\nMathematical Magazine\n, the\nSchool Visitor\n, and the\nEducational Times\nof London.\nArtemas Martin\nhad founded the\nMathematical Visitor\nand the\nMathematical Magazine\n, and he wrote following Seitz's death:-\nA star has fallen ... in the early prime of manhood, and the scientific world is called to mourn the untimely loss of one of the brightest mathematical intellects ever imprisoned in mortal clay.\nSeitz was particularly fond of problems involving averages and probabilities. We give six examples of problems he posed or solved:\nFind the average area of a spherical triangle.\nA cube is thrown into the air and a random shot fired through it; find the chance that the shot passes through the opposite side.\nIf\nA\n,\nB\n,\nC\nA, B, C\nA\n,\nB\n,\nC\n, and\nD\nD\nD\nare four points taken at random in the surface of a given circle; find the probability that\nE\nE\nE\n, the intersection of the straight lines through\nA\n,\nB\nA, B\nA\n,\nB\nand\nC\n,\nD\nC, D\nC\n,\nD\n, lies between\nA\n,\nB\nA, B\nA\n,\nB\nand between\nC\n,\nD\nC, D\nC\n,\nD\n.\nFind the equation to the locus of the centres of all the circles that can be incribed in a given semi-ellipse.\nA straight tree growing vertically on the side of a mountain was broken off by the wind, but not severed; find the chance that the top reaches the ground.\nA boy stepped upon a horizontal turn-table while it was in motion, and walked across it keeping all the time in the same vertical plane. The boy's velocity is supposed to be uniform in his track on the table, and the motion of the table toward him. The velocity of a point In the circumference of the turn-table is\nn\nn\nn\ntimes the velocity of the boy along the curve he describes. Required the nature of the curve the boy describes on the table, and the distance he walks while crossing it\n(1)\nwhen\nn\nn\nn\nis less than\n1\n,\n(2)\nwhen\nn\nn\nn\nequals\n1\n,\n(3)\nwhen\nn\nn\nn\nis greater than\n1\n.\nAlthough Seitz died in Kirksville, his body was taken to Greenville, Ohio where he was buried. J P Blanton was head of the North Missouri Normal School in Kirksville where Seitz taught for the final four years of his life. He brought Seitz's body back to Greenville and gave the following tribute to Seitz at the burial\n[\n4\n]\n:-\nFour years ago, on an August day, there was great commotion in your usually quiet village. The man whose dust lies before us today, with his young wife, was bidding farewell, to the home of their childhood, he to resume the responsibilities of an honourable position in a distant western state; she, with Naomi-like spirit, to be his help meet to kindle the fires upon a new hearthstone. Then, as today, crowds assembled, teachers, pupils and friends of all callings came around him to bid him good speed, to shake his hands, to predict for him a brilliant career in his new sphere of labour, and to congratulate him that his great abilities had been recognized in a fitting manner. If tears were shed then, they were tears mingled with glad smiles, they were the tears of those who wept with a hope that that manly form would again be a familiar figure on the streets, and that possibly after years of successful labour at his profession he would spend the evening of life here among his earliest friends. Alas! alas! all that Missouri can send back of Ohio's gifted son is his poor dust to rest in her bosom until the resurrection morn.\nDid I say all? Nay, it is not all. She sends back to you the record of his life, as pure and unsullied as an angel's wing. She bids me say to you that his work and life have left a lasting impression upon thousands of her noblest youth, that his memory is enshrined in the hearts of her people and that the tears of devoted students, fellow teachers and citizens of all classes have stained his coffin lid. From the beginning of his sickness, which was of unusual severity from the very first, every possible attention has been shown him, physicians gave up their practice and spent their days and nights by his bedside; medical skill exhausted every resource.\nThe students, all of whom loved him like a brother, vied with each other in their ministrations. They were the first to be with him and some of them were bending over him when the last feeble breath left his body. Even the little children on the streets would stop me and say, \"How is Professor Seitz today?\" And when I would sometimes cheer them with hopes that I hardly dared to entertain, their brightening faces were eloquent of love and esteem in which he was held by his fellow townsmen.\nEnoch Beery Seitz was an extraordinary man. He commanded, without effort, the respect of everybody. He was a man of the most singularly blameless life I ever knew. His disposition was amiable, his manner quiet and unobtrusive, and his decision, when circumstances demanded it, was prompt and firm and immovable as rocks. He did nothing from impulse; he carefully considered his course, and with almost infallible judgment came to conclusions that his conscience approved, and then nothing could move him. While he never made an open profession of religion, he was a profoundly religious man. He rested his hopes of salvation in the sacrifice of the tender and loving Saviour, and I am thoroughly convinced he has entered into that rest which remains for the people of God. What a comfort this must be to the tender, brave, faithful young wife he has left behind him, to his bereaved old mother, and to all his mourning friends assembled around his ashes today. No need, dear partner of my dear friend, no need, bereaved mother, no need, dear mourning friends, for you to ask human sympathy or skill to pluck from your memories a rooted sorrow, to raise out the withering troubles of the brain with some sweet oblivious antidote cleanse the stifled bosom of that perilous grief that now weighs so heavily on your hearts. No need, I say, to sorrow. ...\nProfessor Seitz' external life was that of a modest, deep hearted, perfect gentleman. His great ambition was to be good and true, true to himself, true to his family, true to his friends, and true to his country's welfare. He had a thoroughly healthy, well balanced, harmonious nature, accepting life as it came, with its joys and sorrows, and living it beautifully and hopefully, without a murmur. Though the grim monster, Death, removed him from his sphere of action before he fully reached the meridian of his greatness, yet the work he performed during his short but faithful life, will be a lasting monument to his memory, amply sufficient to immortalize his name."
}