{
  "nome_completo": "Erasmus Reinhold",
  "nome_curto": "Erasmus Reinhold",
  "ano_nascimento": "1511",
  "ano_morte": "1553",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reinhold/",
  "lugar_nascimento": "Saalfeld, Thuringia (now Germany)",
  "lugar_morte": "Saalfeld, Thuringia, Germany",
  "biografia": "Erasmus Reinhold\n's father was Johann Reinhold\n(1479\n-\n1558)\n, a tax collector and also the secretary of the last abbot of the Benedictine monastery at Saalfeld. Little is known about Erasmus's youth and early education. He had a brother, named Johann like their father, who became Professor of Mathematics at Greifswald in\n1549\n. Both Erasmus\nand his brother died in\n1553\n. Erasmus studied at the Stadtschule in Saalfeld then, in\n1530\n, he enrolled in the University of Wittenberg which was at that time a young institution having been founded in\n1502\n. He studied mathematics under Jakob Milich\n(1501\n-\n1559)\n, and graduated as Magister in\n1535\n.\nAfter Professor Johannes Volmar's death in\n1536\n, at the instigation of Philipp Melanchthon, Reinhold obtained the professorship of \"Mathematum Superiorum\" in the University of Wittenberg, which included astronomy, while his colleague\nGeorg Joachim Rheticus\nbecame \"Mathematum Inferiorum\". Volmar had studied at Kraków and Wittenberg before moving to the University of Leipzig. He returned to Wittenberg where he was appointed as professor of mathematics in\n1519\n. His most famous student was\nJoachim Rheticus\n. Philipp Melanchthon\n(1497\n-\n1560)\n, Martin Luther's \"right hand man\", was a theologian, Greek professor and educator who reorganised the whole educational system of Germany, founding and reforming several of its universities. Melanchthon played a major role in getting both Reinhold and\nRheticus\nappointed to teach mathematics and astronomy at the University of Wittenberg in\n1536\n.\nRheticus\n, however, spent the three years\n1538\n-\n1541\naway from Wittenberg, two of these years being spent with Copernicus.\nReinhold was elected dean in the college of arts, holding the position during the winter of\n1540\n-\n41\n, and then dean in the college of philosophy during the summer of\n1549\n. He became rector in the winter of\n1549\n-\n50\n. This was a difficult time for those in Wittenberg which was a focal point of the Protestant Reformation which had begun in\n1517\nwhen Martin Luther nailed his\n95\ntheses to the door of the castle in Wittenberg. Reinhold, like the majority of those in Wittenberg, was a Lutheran. The city was the capital of Saxony, ruled by the Elector of Saxony. The Schmalkaldic War of\n1546\n-\n47\nsaw the Lutherans fighting against the Roman Catholic Emperor Charles I. When Charles I captured Wittenberg in\n1547\nthe war was over and the Capitulation of Wittenberg was signed which compelled the Elector of Saxony to resign. Reinhold remained at the University attempting to continue his work during these dramatic events.\nReinhold, along with\nRheticus\n, was one of the first scholars to draw attention towards the Copernican theories of heliocentrism in Germany. In his\n1542\nTheorciae novae Planetarum\nⓉ\n(\nTheory of new planets\n)\n, he called\nCopernicus\na \"second\nPtolemy\n, who restores the decaying building of education\". However, Reinhold continued to recite Ptolemaic doctrine in his lectures. This might have been in part due to the theological establishment in Wittenberg, which considered\nCopernicus\n's model to be heretical, but Reinhold's comments on his own copy of\nCopernicus\n's\nDe Revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nseem to indicate that he was only interested in the mathematical aspects of the model and not in the cosmological theory.\nThe identification of Reinhold's annotations on his copy of\nDe Revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nwas made by Owen Gingerich in\n1970\nwhen he examined the copy of\nDe Revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\nheld in the Royal Observatory in Edinburgh, Scotland. Here is Gingerich's description of this important discovery\n[\n3\n]\n:-\nI searched in vain for an owner's name. The manuscript inscriptions at the beginning and end provided nary a clue. Then I looked more closely at the heavy pigskin binding. ... Around the edges were long patterned strips with biblical figures. Below an empty central panel was the date\n1543\n, and above the panel I noticed the initials ER. I reacted with shock. Could the initials stand for Erasmus Reinhold, the leading mathematical astronomer in the generation after\nCopernicus\n... ? I seized a pencil and paper to make a rubbing of the dim impression and, to my dismay, found not two, but three, initials: ERS. It seemed my hypothesis had just evaporated. Back in Cambridge ... I soon discovered that those three initials, ERS, were exactly what was required for Erasmus Reinholdus Salveldiensis, for in the sixteenth century a man's birthplace - in this case Saalfeld - was a part of his formal designation. ... specimens\n[\nof Reinhold's handwriting\n]\neventually confirmed my original deduction.\nThe authors of\n[\n4\n]\ndiscuss the annotations made by Reinhold in this copy of\nDe Revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n:-\nReinhold's annotations are extensive and thorough: it is difficult to find an error in the text not already marked by him. Throughout, Reinhold proves remarkably aware of Copernicus's sources\n(\nsuch as Giorgio Valla,\nJohannes Werner\n, or\nRegiomontanus\n's 'Epitome'\n)\n, even when\nCopernicus\ndoes not credit them explicitly. Reinhold sums up his approach to\nCopernicus\n's opus by a motto inscribed on the title page, a paraphrase of the chapter title I,\n4\n'The Axiom of astronomy: Celestial motion is uniform and circular, or composed of uniform and circular motions'. There is nothing here about a revolutionary new cosmology, nothing about the earth orbiting like a planet about a stationary sun. Instead, Reinhold is fascinated by the use of pure circles to replace the Ptolemaic equant by an alternative mechanism. The marginalia throughout the volume verify this interpretation of Reinhold's interests. The cosmological chapter is virtually unglossed except for the correction of the periods of Venus and Mercury. Book III, concerning the precession and the relative motion of the earth and the sun, in contrast to the cosmological sections is generously annotated. Several long glosses discuss chronology. Others concern the observational basis for precession and the obliquity, where Reinhold regularly includes\nJohannes Werner\n, an antagonist whom\nCopernicus\nassiduously avoids mentioning.\nThe University of Wittenberg lacked an observatory so Reinhold had to make do with a wooden quadrant. He did publish some ephemerides, but most of his work was not observational. As stated above, he published a commented edition of\nGeorg van Peurbach\n's\n(1423\n-\n1461)\nTheorciae novae Planetarum\nⓉ\n(\nTheory of new planets\n)\n, which was still at use in many universities, in\n1542\n. In his comments, he showed that the orbits of Mercury and the Moon describe an oval figure and he makes the first published description of a camera obscura. In\n1549\n, he published the first book of\nPtolemy\n's\nAlmagest\nin Greek with a Latin translation, under the title\nPtolomaei Mathematicae constructionis liber primus\nⓉ\n(\nThe first book of Ptolemaic mathematical constructions\n)\n. In his dedication of this work Reinhold wrote:-\nFor the advantage and happiness of the public schools, I began an edition of\nPtolemy\n's excellent work, in which the universal theory of heavenly motions is raised on its first foundations. The present edition of the first book is aimed at making students familiar with the basics of astronomy, which are preliminary to a correct understanding of the other books of the 'Almagest'. Without any doubt, it is very useful to present to young people these sources of the discipline. Still, since beginners are not yet conversant with the Greek language, I have added a Latin translation, for whose inaccuracy I beg the pardon of the experts. I also hope that somebody will eventually accomplish a complete and clear translation of\nPtolemy\nfor public interest. Moreover, to help students, I have commented and explained some difficult passages. I hope that all these efforts will be pleasing to God and that all experts will approve them. My intention is, in fact, that the young will not strive merely for the empty shadow of the doctrine, but that they are made familiar with mathematics and with this art that is useful for human life and peace.\nHe intended to finish this work, but his early death did not allow him. Posthumously, in\n1554\n, his\nPrimus liber Tabularum Directionarum\nⓉ\n(\nThe first book of directional tables\n)\nwas published, an improvement of\nRegiomontanus\n's trigonometric tables that includes the sines for every minute of the quadrant. He also teaches students how to use the tables to solve spherical problems.\nReinhold was dissatisfied with the tables included in\nCopernicus\n's\nDe revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n, so he decided to remake them in a more useful form. For this project, he found a patron in Duke Alfred of Prussia. In\n1551\n, after seven long years of work, he published his\nPrutenicae Tabulae Coelestium Motuum\nⓉ\n(\nTables of Prussian celestial movements\n)\n. They were a series of astronomical tables that showed that the heliocentric model was applicable in practice. They remained the most important resource for astronomical calculation until\nKepler\n's\nTabulae Rudolphinae\nⓉ\n(\nRudolphine Tables\n)\n(1627)\n. A testament of their importance is the fact that they received four printings in thirty-five years: in\n1551\n,\n1562\n, and\n1571\nin Tubingen, and in\n1585\nin Wittenberg. He wrote in the tables\n(\nsee\n[\n9\n]\n)\n:-\nCopernicus\n, the most learned man whom we are able to name other than Atlas and\nPtolemy\n, even though he taught in a most learned manner the demonstrations and causes of motion based on observation, nevertheless fled from the job of constructing tables, so that if anyone computes from his tables, the computation is not even in agreement with his observations on which the foundation of the work rests. Therefore first I have compared the observations of\nCopernicus\nwith those of\nPtolemy\nand others as to which are the most accurate, but besides the bare observations, I have taken from\nCopernicus\nnothing other than traces of demonstrations. As for the tables of mean motion, and of prosthaphaereses and all the rest, I have constructed these anew, following absolutely no other reasoning than that which I have judged to be of maximum harmony.\nReinhold married twice: first with Margaretha Bauer\n(\ndied\n7\nOctober\n1548)\n, the daughter of a burgher from Saalfeld, on\n22\nJanuary\n1537\n; and later with Martha\n(\ndied\n1552)\nin\n1550\n. Both of his wives died in childbirth. His first marriage gave him a son, also named Erasmus\n(1538\n-\n92)\n. He also had two daughters, Margareta and Katharina. Erasmus Jr\n[\n12\n]\n:-\n... studied mathematics and medicine in Wittenberg under the care of Melanchthon, and then in Jena, and became doctor of medicine and municipal doctor in Amberg and Saalfeld. Later he became 'mountain steward' to the Elector of Saxony, and wrote works on land surveying as well as calendars, which appeared regularly for many years in Erfurt.\nIn\n1552\n, Reinhold moved to stay with his parents in Saxony, fleeing from the bubonic plague, but he eventually succumbed to it. His last words were \"\nVixi et quem dederas cursum mihi, Christe, peregi\n\"\nⓉ\n(\nI lived and the life that you have given me, O God, I carried through to the end\n)\n. His student, Kaspar Peucer\n(1525\n-\n1602)\n, succeeded him as professor of mathematics in Wittenberg in\n1554\n.\nIn\n1575\n,\nTycho Brahe\nvisited Reinhold's son in Wittenberg and studied his annotated copy of the\nDe Revolutionibus\nⓉ\n(\nOn the revolutions\n(\nof the heavenly spheres\n)\n)\n. Reinhold's notes inspired\nBrahe\nto consider alternative arrangements of planetary circles that led to his own geo-heliocentric system. In fact Christoph Rothmann, court mathematician of Kassel, wrote in\n1588\nwhen\nBrahe\npublished\nDe mundi aetherei recentioribus phaenomenis\nⓉ\n(\nOn the most recent phenomena in the ethereal world\n)\n:-\nI did not consider this geo-heliocentric theory to be a new approach but precisely\nCopernicus\n's, apart from the fact that I could treat the matter in the reverse manner by bringing\nCopernicus\n's hypotheses back to the solar motion. Moreover, I assumed that\nRheticus\nand Reinhold also took that same approach into consideration."
}