{
  "nome_completo": "Daniel Friedrich Ernst Meissel",
  "nome_curto": "Ernst Meissel",
  "ano_nascimento": "1826",
  "ano_morte": "1895",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Meissel/",
  "lugar_nascimento": "Neustadt-Eberswalde, Brandenburg, Prussia (now Germany)",
  "lugar_morte": "Kiel, Herzogtum Holstein, Prussia (now Germany)",
  "biografia": "Ernst Meissel\nwas born in Neustadt-Eberswalde, a town about\n75\nkm northeast of Berlin in northern Brandenburg. He attended the Friedrich-Wilhelm\nGymnasium\nin Berlin, completing his secondary education in\n1847\n. He then spent three years studying mathematics at the University of Berlin working under\nJacobi\n. He also had contacts with\nDirichlet\nwho was teaching at the University of Berlin at the time Meissel was studying there. His doctorate was obtained from Halle in\n1850\nfor the dissertation\nDe serie quaedam Jacobiana\nⓉ\n(\nOn some series of Jacobi\n)\n.\nAfter obtaining his doctorate, Meissel remained in Berlin studying for the necessary qualifications to become a secondary school teacher of mathematics. He completed his training around April\n1852\nand became a mathematics teacher at the Bergakademie in Berlin. This Academy had been founded in\n1770\nby the Prussian King Friedrich II to train students in mineralogy. He also taught at the Bauakademie, the Academy of Architecture, which had opened in\n1836\n. The Academy was housed in a beautiful building designed by the famous architect Karl Friedrich Schinkel and built during the years\n1832\n-\n36\non the west bank of the Spree river in Berlin.\nMeissel left Berlin, and his positions there, in\n1852\nwhen he was appointed as director of the Royal Provinzialgewerbeschule in Iserlohn, which is situated about\n25\nkm south of Dortmund. He held this post until\n1871\nwhen he moved to Kiel as director of the Knabenbürgerschule. Two years after taking up the post his school became a Realschule, then in\n1882\nan Oberrealschule. Today the school is called Humboldt-Schule and is situated in Knooper Weg in central Kiel. He remained at this school in Kiel until the end of his life.\nLittle is known of Meissel's private life. We do know that he was married and had at least two sons. One son, W Meissel, worked for Norddeutscher Lloyd, Bremerhaven. Certainly it is known that in\n1901\nhe was based in Hong Kong and he refloated the steamship München which had run aground on Yap, Caroline Islands. The only information about the other son is tragic since it is reported that he died at a young age after being hit by a snowball.\nMeissel's mathematical work covers a number of areas. Peetre writes in\n[\n2\n]\n:-\nMeissel's mathematical interests covered the following fields:\nnumber theory\n(\nin particular, properties of\nprime numbers\n)\n, theta functions,\nelliptic functions\n, spherical trigonometry, hydrodynamics, ordinary differential equations, asymptotic expansions, and\nBessel\nfunctions. In particular, Meissel was a master calculator, as witnessed by the many tables he worked out and the extensive numerical calculations he performed. These evoked admiration among his contemporaries ...\nHe worked on prime numbers and found, in the\n1870\ns, a method for computing individual values of\nπ\n(\nx\n)\n\\pi(x)\nπ\n(\nx\n)\n, the counting function for the number of primes less than or equal to\nx\nx\nx\n. His method was based on recurrences for partial sieving functions, and he used it to compute\nπ\n(\n1\n0\n7\n)\n\\pi(10^{7})\nπ\n(\n1\n0\n7\n)\n,\nπ\n(\n1\n0\n8\n)\n\\pi(10^{8})\nπ\n(\n1\n0\n8\n)\n, and\nπ\n(\n1\n0\n9\n)\n\\pi(10^{9})\nπ\n(\n1\n0\n9\n)\n. He found that there are\n664\n,\n599\nprimes less than\n1\n0\n7\n10^{7}\n1\n0\n7\n, there are\n5\n,\n761\n,\n455\nprimes less than\n1\n0\n8\n10^{8}\n1\n0\n8\nand\n50\n,\n847\n,\n478\nprimes less than\n1\n0\n9\n10^{9}\n1\n0\n9\n. However\nDerrick Lehmer\nsimplified and extended Meissel's method\n70\nyears later, and showed Meissel's value of\nπ\n(\n1\n0\n9\n)\n\\pi(10^{9})\nπ\n(\n1\n0\n9\n)\nwas too small by\n56\n. Recently Deléglise and Rivat, using a technique based on that of Meissel and\nDerrick Lehmer\n, showed that\nπ\n(\n1\n0\n18\n)\n=\n24\n,\n739\n,\n954\n,\n287\n,\n740\n,\n860.\n\\pi(10^{18}) = 24,739,954,287,740,860.\nπ\n(\n1\n0\n1\n8\n)\n=\n2\n4\n,\n7\n3\n9\n,\n9\n5\n4\n,\n2\n8\n7\n,\n7\n4\n0\n,\n8\n6\n0\n.\nAnother piece of work by Meissel on number theory is discussed in\n[\n1\n]\n.\nIn addition to his work on primes, Meissel did other number theory work, namely on\nMöbius\ninversion and the theory of partitions. He also wrote on\nBessel functions\n, asymptotic analysis,\nrefraction\nof light in the earth's atmosphere, and the\nthree body problem\n. His work on the three body problem is discussed in detail in\n[\n3\n]\n.\nHis main skill was in numerical calculations and manipulation of complicated expressions. His work was based on the mathematics he learnt as a student and he appears not to have kept up with new developments. Peetre gives this conclusion in\n[\n2\n]\n:-\nMeissel must be judged as a classical mathematician, continuing a tradition from an earlier epoch associated with names like\nEuler\n,\nLaplace\n,\nLegendre\n,\nGauss\n,\nJacobi\n, and\nDirichlet\n. His work is based entirely on things that he learnt during his student days\n(\nbefore\n1850)\n, whereas he seems to have been ignorant of newer developments in analysis such as the theory of functions of one complex variable. In other respects he was ... a forerunner\n(\nin the theory of\nBessel\nfunctions, in connection with Emden's equation etc.\n)\n. Moreover he was extremely skilled in numerical calculations and in manipulating complicated analytic expressions."
}