{
  "nome_completo": "Ernst Jacobsthal",
  "nome_curto": "Ernst Jacobsthal",
  "ano_nascimento": "1882",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jacobsthal/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Überlingen, Bodensee, Germany",
  "biografia": "Ernst Jacobsthal\n's parents were Martin Jacobsthal and Ida Rosenstern. Martin Jacobsthal was a physician as had been his father. Ernst had an older brother Paul, born in\n1880\n, who later became an eminent archaeologist. Ernst Jacobsthal studied mathematics at the University of Berlin where he was taught by\nGeorg Frobenius\n,\nHermann Schwarz\nand\nIssai Schur\n.\nFrobenius\nand\nSchur\nsupervised his doctoral studies and he was awarded his doctorate in\n1906\nafter submitting his thesis\nAnwendung einer Formel aus der Theorie der quadratischen Reste\nⓉ\n(\nApplication of a formula from the theory of quadratic residues\n)\n. The obituary\n[\n1\n]\nwritten by Sigmund Selberg is the memorial speech delived by him at the meeting of the Det Kongelige Norske Videnskabers Selskabs Forhandlinger on\n5\nth\nof April\n1965\n. The speech and the article\n[\n1\n]\nare in Norwegian. We give below a translation by Jan Kristian Haugland made at the request of Keith Matthews:\nOn the\n6\nth\nof February this year, our member Ernst Jacobsthal passed away at the age of\n82\nyears. When news of his death came, many of us felt as if one of our closest had left us. Jacobsthal had a strange ability of bonding with anyone he came in touch with. His crowd of friends also became like a big family, in which the individual members did not need to be in touch directly, yet knew each other through the central figure - Ernst Jacobsthal. His interests ranged over such a huge spectrum, from difficult mathematical problems to the small ups and downs of everyday life, that he could reach everyone's mind. Indeed, he was so humanly simple and natural, that you had to be fond of him.\nProfessor Ernst Jacobsthal was born on the\n16\nth\nof October\n1882\nin Berlin with parents Dr Martin Jacobsthal and Ida, neé Rosenstern. Both his father and his grandfather were physicians. This is presumably the reason why Professor Jacobsthal was always interested in medical research. However, he did not go down this road himself.\nIn\n1906\n, Jacobsthal graduated and earned his doctoral degree from Berlin University. His teachers in his major, mathematics, were the well-known mathematicians\nFerdinand Georg Frobenius\nand\nHermann Amandus Schwarz\n. His doctoral thesis had the title\nAnwendungen einer Formel aus der Theorie der quadratischen Reste\nⓉ\n(\nApplication of a formula from the theory of quadratic residues\n)\n. It is a piece of work that by now is a classic, and which is frequently referred to in most major textbooks on number theory.\nIn the thesis he gives, among other things, a very beautiful proof that every prime number\np\np\np\nof the form\n4\nn\n+\n1\n4n + 1\n4\nn\n+\n1\ncan be written as a sum of two square numbers. He also showed that it is possible to find a solution\np\n=\nx\n2\n+\ny\n2\np = x^{2} + y^{2}\np\n=\nx\n2\n+\ny\n2\nwhere\nx\nx\nx\nand\ny\ny\ny\ncan be expressed with simple sums over Legendre symbols.\nIn\n1909\n, Jacobsthal became a teacher at Kaiser Wilhelms high school\n(\nrealgymnasium\n)\nin Berlin. In addition, he was an assistant to Professor E Lampe at the College of Technology in Berlin, and in\n1913\nbecame a private senior lecturer at the same place.\nIn\n1918\nhe received the title Professor and, in\n1922\n, he became ausserordentlicher Professor at the College of Technology in Berlin. To us, it seems strange that he was a professor and a teacher on leave simultaneously. When Jacobsthal was associated with the College of Technology, it was however not in order to teach prospective engineers mathematics. In Germany, as in many other countries after World War I, there was a shortage of teachers in high school. In order to graduate more mathematics teachers, science was introduced at numerous technical colleges, including the one in Berlin. Thus, the purpose of Jacobsthal's association with the College was primarily to lecture mathematics to prospective teachers in high school.\nIn\n1918\n, Jacobsthal married Anne-Marie, neé Coste. With this marriage, a long and rich partnership began in which she helped him in his work by organising everything, as far as possible, so that he could concentrate undisturbed on his research. She also typed most of his manuscripts.\nWhen Hitler seized power in Germany, the seed was sown for the game of fate that later brought Jacobsthal to Norway. He was born into a minority that was unwanted in the Third Reich. Already on the\n29\nth\nof March\n1934\n, Jacobsthal received a letter from the Preussian Ministry of Science with the following wording:-\nAuf Grund von §\n6\ndes Gesetzes zur Wiederherstellung des Berufsbeamtentums vom\n7\n. April\n1933\nentziehe ich Ihnen hiermit Wirkung vom\n1\n. Oktober\n1934\ndie Lehrbefugnis an der Technischen Hochschule Berlin\nⓉ\n(\nOn the basis of section\n6\nof the Law for the Restoration of Civil\n7\nth April\n1933\ndeprivation of the right to teach at the Technical University Berlin hereby applies from\n1\nOctober\n1934\n,\n)\n.\nIn other words, Jacobsthal was fired from his professorship. The only activity that was still open to him was returning to the position as a teacher at Kaiser Wilhelm's high school. However, it was clear that this position would also be taken from him within a short time. Jacobsthal, who was a researcher with his whole life and soul, and who probably was not very interested in teaching in the lower grades, realized that the only sensible thing to do was to resign his teacher position. It may be of interest here to include his letter of resignation, with this wording:-\nAbschied\nAuf Ihren Antrag vom\n29\n. August\n1934\nwerden Sie, Herr Studiendrat Professor Dr Ernst Jacobsthal unter Gewährung des gesetzlichen Ruhegehalts zum\n30\n. September\n1934\nin den dauernden Ruhestand versetzt.\nFür Ihren dem Staate in langjähriger treuer Pflichterfüllung geleisteten Dienste spreche ich Ihnen die Anerkennung und den Dank der Staatsregierung hierdurch aus.\nⓉ\n(\nAt your request of August\n29\n,\n1934\nand issuance of the statutory retirement pension,  you, Professor Dr Ernst Jacobsthal, are displaced into retirement from September\n30\n,\n1934\n.\nFor your  many years of faithful duty and services rendered to the state I express the appreciation and gratitude of the government.\n)\nBerlin W\n35\n, den\n13\n. September\n1934\nDer Oberpräsident der Provinz Brandenburg\nAbteilung für höheres Schulwesen\nIm Auftrag\nZander.\nOne could say that this letter has a very cold, yet polite form. The latter emphasizes the former.\nIn the spring of\n1939\n, the conditions in Germany prompted Jacobsthal to decide that it was best to leave the Third Reich while it was still possible. His only brother, Paul, who was a well-known archaeologist, had already left Germany and had become a professor in Oxford. In the summer of\n1939\n, Jacobsthal left Berlin to join his brother in England. On the way he stopped in Norway, where he wanted to visit his friend\nMax Dehn\n, who was acting as a substitute for Professor\nViggo Brun\nin Trondheim. During Jacobsthal's stay in Trondheim, World War II broke out and a trip to England was no longer an easy task. Jacobsthal stayed in Trondheim during the autumn and felt comfortable in the mathematical environment there.\nIn the spring of\n1940\n, Jacobsthal planned to continue his journey, but an injured foot made him stay in Trondheim until the\n9\nth\nof April\n[\nwhen the war broke out in Norway\n]\n. The occupation of Norway must have come as a shock to both Jacobsthal and his wife, who had stayed behind in Berlin. The best that Professor Jacobsthal could now hope for, was that the war would be short and have an outcome that would make it possible for him to go back to Germany.\nWe can all understand that he was, mildly speaking, in a desperate situation with almost no means of living. Jacobsthal stayed in Trondheim until January\n1943\n. Then the situation in Norway also made it necessary for him to get away, if he wanted to save his life. The Czech mathematician Paul Kuhn, who had come to Trondheim to work with Professor Brun, was in the same situation. Regarding this difficult time, I would like to quote an extract from an obituary of Jacobsthal that\nViggo Brun\nwrote in\nMorgenbladet\non the\n17\nth\nof February of that year:-\nIn the beginning, they did not meet great difficulties from the occupation force, but the situation became critical in\n1942\n. We tried to plan an escape across the border to Sweden, but how would this work out during winter? None of them were skiers. But from Professor Tambs Lyche, who for a long time had been in the concentration camp in Falstad, we received the message: \"Even if they have to creep on their bellies across the border, they have to get away\". We then got in touch with a refugee organization in Oslo where Diderich Lund was a leading figure, and after a few weeks waiting time in Trollheimen, they came across the border to Uppsala.\nWhen liberation came, Jacobsthal wanted to return to Trondheim to his friends and the mathematical environment there. He succeeded in having a personal position established for him at the Norwegian Institute of Technology\n(\nNorges Tekniske Hogskole\n)\n. It should be mentioned that our current King became involved in helping this case through. This time Jacobsthal arrived in Trondheim with his wife and, shortly after, they both became Norwegian citizens.\nBoth Jacobsthal and Mrs Jacobsthal were very hospitable by nature. As soon as they had established a home of their own, it became a beloved gathering place for all their friends.\nWhen the Freie Universität in West Berlin was founded after the war, Jacobsthal was very soon invited to be a guest lecturer during the summer term. He accepted this invitation. The new Germany, as he came to know it in West Berlin, became a joy to him and took away the fear from the Nazi days. There was not only one visit to Berlin. In the following years, he lectured there every summer until the summer of\n1957\n. That year he became ill during the stay in Berlin. His heart began to fail.\nJacobsthal was a good ambassador for the new university in Berlin and obtained many good contacts for it. For his great achievements for Die Freie Universität, he was honoured on his\n70\nth\nbirthday by becoming the first honorary citizen of the university.\nDue to deteriorating health, Jacobsthal was precluded from further lecturing following the autumn of\n1957\n. It also made it difficult for him to remain living in Norway. The winter was long, and he felt an urge for a warmer climate. Thus, in the fall of\n1958\n, Jacobsthal and his wife moved to Überlingen ver Bodensee. He stayed here until his death.\nProfessor Jacobsthal was a very significant and versatile mathematician. He has written papers in such diverse fields as algebra, analysis, function theory and number theory. He was also a very productive researcher and wrote more than\n70\nscientific papers in total. He retained the joy and ability of research until his last years. I think I can say for certain that he is the mathematician that has published most dissertations in our community. His time in Trondheim was very productive.\nJacobsthal became a member of our community in\n1946\nand of the\nNorwegian Academy of Sciences\n(\nNorske Videnskapsakademi\n)\nin Oslo from\n1950\n.\nOn his death, not only has a significant scientist passed away, but also a tremendously colourful personality, who will be missed by many.\nLet us honour his memory by standing up."
}