{
  "nome_completo": "Ernst Fiedler",
  "nome_curto": "Ernst Fiedler",
  "ano_nascimento": "1861",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fiedler_Ernst/",
  "lugar_nascimento": "Chemnitz, Saxony, Germany",
  "lugar_morte": "Zurich, Switzerland",
  "biografia": "Ernst Fiedler\nwas the oldest son of the mathematician\nWilhelm Fiedler\n.\nWilhelm Fiedler\nmarried Elise Springer in\n1860\n, in Chemnitz and Ernst was born there. He had two brothers and four sisters, among them Alfred Fiedler\n(1863\n-\n1894)\n, who lectured on zoology at the University of Zürich.\nThe family moved to Prague in\n1864\n. Three years later\nWilhelm Fiedler\nwas appointed to fill the chair of descriptive geometry at the Polytechnic in Zürich, which had been vacant since Wolfgang von Deschwanden's death. The family stayed in Zürich then, and they became Swiss citizens in\n1875\n.\nErnst attended the\nGymnasium\nin Zürich and, from\n1879\nonwards, the Polytechnic, where he studied mathematics at the Department for Mathematics and Physics Teachers. Among his lecturers were his own father,\nFrobenius\nand\nGeiser\n. In\n1882\nhe moved to Berlin, where he attended lectures by\nKummer\n,\nKirchhoff\n,\nHelmholtz\nand\nWeierstrass\nin particular. Two years later he moved to Leipzig in order to study under\nKlein\nand the philosophy professor Wilhelm Wundt. They both supervised his doctoral thesis,\nÜber eine besondere Klasse der Modulargleichungen der elliptischen Funktionen\nⓉ\n(\nOn a special class of modular equations of elliptic functions\n)\n, which he completed in\n1885\n. He then became\nPrivatdozent\nfor mathematics at the Polytechnic and assistant teacher at the Kantonsschule in Zürich. In\n1889\nhe became professor for mathematics at the Industrieschule in Zürich. Fiedler was influential in the school's development, especially after having become Director of the school in\n1904\n, when it was re-organised and renamed as Oberrealschule. He held this post until his retirement in\n1926\n. Under his guidance, the school became 'an acknowledged institution preparing for studies at the Polytechnic'\n[\n6\n]\n. Fiedler seems to have been very good at choosing his teaching staff; he also supported extra-curricular activities, founding both the school's orchestra and rowing club\n[\n5\n]\n.\nFiedler did not produce any mathematical research papers; he was very much a schoolteacher and not a research mathematician. His publications include a couple of secondary school textbooks on descriptive geometry, a graduation speech entitled\nLebenserfahrung und Bescheidenheit\nⓉ\n(\nLife experience and modesty\n)\n(\nZürich,\n1908)\nthat he gave at his school in\n1908\n, and several papers on ballistics and military education.\nEarly on Fiedler made a name for himself in the Swiss army, which he joined in\n1881\n. After a swift career he became the then youngest colonel at the age of forty-three. From\n1889\nonwards he lectured on ballistics and shooting theory at the Polytechnic, instead of mathematics. He retired from this post in\n1923\n.\nIn\n1899\n, the Polytechnic's Board decided that the school's assistants would no longer be asked to work during the entry examinations. Instead,\nBleuler\nasked Fiedler to assist with the exams in descriptive geometry, conducted by his father, who remarked that 'due to the amount of candidates it is absolutely necessary to have two experts in the hall'\n[\n3\n]\n. Since similar requests were sent to Fiedler in the two following years, we can assume that he was responsive to\nBleuler\n's pleas\n[\n2\n]\n.\nFiedler was a member of the\nSchweizerische Gesellschaft für Schulgesundheitspflege\n, a society taking charge of all aspects of health and hygiene in Swiss schools. He was also a consultant of the\nSchweizerische Rektorenkonferenz\n(\nSwiss Universities Association\n)\nand served on the supervisory board of the Teachers' College in Küsnacht. It is due to Fiedler that shorthand was introduced as an optional subject in secondary schools. Furthermore, he was the creator and first curator of the Archive of Secondary Schools. Following a nervous breakdown, Fiedler became heavily involved in the temperance movement of the late\n19\nth\nand early\n20\nth\ncenturies, educating the public on the dangers of alcohol abuse.\nFiedler is only mentioned once in the minutes of the committee of the first International Congress of Mathematicians: he attended the meeting on\n08\nDecember\n1896\n. Having said that, there does not exist an attendance record for every meeting so he may have attended more meetings. He attended the congress but did not give a talk.   Fiedler attended two further congresses, the\n1908\nICM in Rome and the\n1912\nICM in Cambridge, but did not give a talk at either.\nHe married Lina Knoch in\n1886\n; the marriage lasted until Lina's death in\n1949\n. The couple had four sons and one daughter. Two of his sons also studied at the Polytechnic: Karl\n(1892\n-\n1965)\n, the oldest son, became a civil engineer; the third son Max\n(1893\n-\n1944)\nwas a mechanical engineer.\nThe obituary in\n[\n4\n]\ngives\n6\nOctober\n1954\nas his day of death, whereas\n[\n6\n]\nclaims that he died on\n16\nJuly\n1954\n."
}