{
  "nome_completo": "Erwin Nick Hiebert",
  "nome_curto": "Erwin Hiebert",
  "ano_nascimento": "1919",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hiebert/",
  "lugar_nascimento": "Waldheim, Saskatchewan, Canada",
  "lugar_morte": "Waltham, Massachusetts, USA",
  "biografia": "Erwin Hiebert\n's parents were Cornelius Nikolai Hiebert\n(1881\n-\n1975)\nand Katharina \"Tina\" Harms\n(1885\n-\n1942)\n. Cornelius, the son of Nickolai C Hiebert\n(1852\n-\n1923)\nand Maria Wiens\n(1850\n-\n1916)\n, wrote\n[\n4\n]\n:-\nI did not have the opportunity of attending school regularly, since my parents were poor and I had to work out to help support the family. However I did attend school long enough so that I came to the\n7\nth\ngrade. Many of our German speaking people had moved to North Dakota on a new settlement. Due to scarcity of teachers there, I together with J F Thiesen were called to North Dakota in\n1903\nwhere the county superintendent gave us each a Permit to teach in this new settlement for a few months in summer time.\nAfter working on a farm Cornelius Hiebert became a distributor of Bibles and other religious material travelling round various states. While in Oklahoma he met Tina Harms, the daughter of David Harms\n(1861\n-\n1931)\n, who also distributed Bibles, and Eva Unruh\n(1862\n-\n1936)\n. Cornelius and Tina shared the same Russian Mennonite Brethren faith and were married on\n24\nSeptember\n1908\nin the home of David and Eva Harm in Medford, Oklahoma. Cornelius and Tina Hiebert had eleven children: Esther, Martha\n(\ndied when a baby\n)\n, Walter\n(\ndied when a baby\n)\n, Ruben\n(\ndied when a baby\n)\n, Hulda\n(\ndied when a baby\n)\n, Albert, Erwin\n(\nthe subject of this biography\n)\n, Martha, Ruth, Naomi, and Clarence. Although Erwin was the seventh of his parents' children, because four of the children had died, he only had one older sister and one older brother. Erwin was brought up in a number of different places. His parents moved to Los Angeles soon after he was born where his father studied at the Bible Institute\n(\nnow Biola University\n)\n. In\n1921\nthey returned to Saskatchewan but moved to Winnipeg, Manitoba, Canada in\n1925\nwhen Cornelius took over mission work for the Mennonite Brethren in that city.\nErwin was six years old when his family moved to Winnipeg and there he attended Faraday Grade School and completed his schooling at Sir Isaac Newton High School. Both these schools are in the North District of Winnipeg, the Faraday Grade School being an Elementary School and the Sir Isaac Newton High School being, as the name indicates, a High School. The family certainly could not afford to support Erwin in higher education but he had spent his summers earning money so that he could attend college. During the summers, he worked\n[\n5\n]\n:-\n... long hours on Mennonite farms harvesting wheat in Oklahoma\n(\nhome of his mother's side of the family\n)\n, Kansas, and Nebraska and moving north up to the Dakotas as the harvest progressed. In this way he earned enough money to put himself through college.\nHaving saved enough to begin his college education, Hiebert enrolled at Tabor College in Hillsboro, Kansas. He studied there for two years before moving to Bethel College in North Newton, Kansas where he earned a B.Sc. in\n1941\n. We note that both Tabor College and Bethel College are affiliated to the Mennonite Brethern Church so were natural places for Hiebert to study. We also note that Hillsboro and Newton are relatively close being less than\n40\nkm apart. Hiebert's main subjects at these colleges had been chemistry and mathematics. He continued his studies going to the University of Kansas in Lawrence where he studied Chemistry and Physics. He was awarded his Master's Degree in\n1943\n.\nWhile he was at Tabor College in Hillsboro he had met a music student Elfrieda Franz and the two were married in\n1943\n. Elfrieda was a talented pianist, having won the National Music Competition in Colorado Springs, Colorado, in\n1938\n. After marrying they moved to Whiting, Indiana where Hiebert was employed as a Research Chemist at Standard Oil Company of Indiana. Of course this was during World War II and Standard Oil Company was contributing to the Manhattan Project in Chicago, part of the U.S. government's research project aimed at producing the first atomic bomb. After the end of the war, Hiebert moved to Washington, D.C. where he was employed as Assistant to the Chief of the Scientific Branch of the War Department General Staff. He only spent one year in this job,\n1946\n-\n47\n, before returning to research in chemistry at the Institute for the Study of Metals of the University of Chicago. Hiebert's wife Elfrieda had been studying at the University of Chicago where she was awarded a Bachelor's degree in music in\n1945\nand a Master's degree in the following year. She also worked as an assistant music librarian at the University. Hiebert was still keen on studying and he did a second Master's degree, this time in physical chemistry at the University of Chicago. He received the degree in\n1949\n. The Hieberts' first child, Catherine Anne, was born in Chicago in\n1948\n.\nIf the reader is familiar with Hiebert's main contributions to science, they will know that he was a major figure in the history of science. Many of the leading historians of science studied for their doctorate under Hiebert. It must therefore be quite surprising that we have reached this stage in his career without mentioning the topic for which he is famed. He was thirty years old by the time he received his second Master's degree from the University of Chicago, but his interests had already begun to more towards the history of science\n[\n13\n]\n:-\nThe University of Chicago was a stopping-off place for an international constellation of scholars in all disciplines after the war, and while working on his master's degree in physical chemistry he also took a broad range of courses in history, philosophy, and sociology. The one that made the most lasting impression on him was a course given by Alexandre Koyré on \"Scientific Thought in the Age of Newton.\" He began to read everything Koyré had written, and encouraged especially by the physical chemist Farrington Daniels, he decided to pursue his interests in the history of science further at the University of Wisconsin.\nAt the University of Wisconsin at Madison Hiebert studied for his doctorate, beginning in\n1950\n, on the History of Science and Physical Chemistry. Part way through his research towards his Ph.D., in\n1952\nhe was appointed as an Assistant Professor of Chemistry at San Francisco State College. The Hieberts' second child, Margaret Helen, was born in San Francisco in\n1954\n. He was awarded his Ph.D. in\n1954\nand left San Francisco, moving to Germany where he was a Fulbright Lecturer at the\nMax-Planck\n-Institut für Physik in Göttingen during\n1954\n-\n55\n. While in Göttingen, the Hieberts' third child, Thomas Nels, was born in\n1955\n. Returning to the United States, he was appointed as an Instructor in the History of Science at Harvard University. He held this position from\n1955\nto\n1957\nbefore returning to the University of Wisconsin. At Wisconsin he was rapidly promoted and served as chairman of the Department from\n1960\nto\n1965\n.\nDuring this period at Wisconsin, Hiebert was an American Scholar in Kabul\n(\nin summer\n1961\nat the International Education Exchange Program\n)\n, was a Fellow at the Institute for Advanced Studies in Princeton, New Jersey in\n1961\n-\n62\nand again in\n1968\n-\n69\n, Visiting Professor at the University of Tübingen, Germany in\n1964\n-\n65\n, and Visiting Professor at Harvard in\n1965\n. He supervised the Ph.D. studies of eighteen postgraduate students while at Wisconsin. You can see their names and the titles of their theses at\nTHIS LINK\n.\nYou can see the description\n(\nextracted from\n[\n13\n]\n)\nby one of these students, Roger H Stuewer\n(\nthe author of\n[\n12\n]\nand\n[\n13\n]\n)\n, of how he become one of Hiebert's students and his experiences at the beginning of his doctoral studies at\nTHIS LINK\n.\nStuewer writes in\n[\n12\n]\nthat Hiebert:-\n... pursued a steady personal research program, especially in the history, philosophy, and religious ramifications of physical science and thought. At the same time he attracted and supervised an astonishingly large number of graduate students in the history of science - far more than anyone else in the profession. The demand on his was so great, in fact, that he easily could have increased the number significantly if he had not insisted on accepting only those he considered most promising.\n(\nNote. The reference\n[\n12\n]\nwas written\n32\nyears before Hiebert died and he supervised many more students after this reference was written. We have changed the tense of the extract above from present to past tense.\n)\nIn\n1970\nHiebert moved from Wisconsin to Harvard. Roger Stuewer describes the events which led to this in\n[\n13\n]\n. Stuewer received a letter from Hiebert in February\n1970\n:-\nHe had just received several telephone calls from John Murdoch at Harvard trying to persuade him to leave Wisconsin and join the Harvard department. That, as Erwin told me in a letter of January\n29\n, precipitated a flurry of activity at Wisconsin, with all sorts of people trying to persuade him to remain there. He was \"just bewildered\" as to what to do, but he and Elfrieda were flying to Boston the next day to investigate things. He closed with a postscript, quoting Stephano in Shakespeare's 'Tempest': \"Prithee, do not turn me about; my stomach is not constant.\" In early June he sent me a clipping from the Madison 'Capitol Times' with the headline, \"Science Historian Hiebert Leaving U.W. for Harvard,\" and above it was the caption, \"Wife Gets Musicology Ph.D.\"\nJoan Richards was an undergraduate at Harvard when Hiebert arrived there in the autumn of\n1970\n[\n11\n]\n:-\nI knew of Erwin Hiebert for several years before I knew him. He came to the Harvard History of Science Department when I was a senior there, but I neither took any courses with him nor even met him that year. I did hear of him though, and what I heard was somewhat daunting; a kind of awed intensity surrounded everyone's references to the new professor from Wisconsin. Throughout the process of writing my senior thesis on\nPoincaré\nthere lurked in the back of my mind, the shadowy figure of Erwin Hiebert who would, in the end, evaluate my efforts. When I finally got my comments, I was relieved and somewhat surprised. Whereas I had thought he would have little time for my efforts, this newcomer read my work with remarkable care; he commented on everything from the translations, to the importance and persuasiveness of the thesis, to the chapter titles\n(\nor lack thereof\n)\n. His remarks were insightful, helpful, somewhat humorous and most of all interesting.\nLater, Joan Richards became one of the nineteen Ph.D. students that Hiebert advised while at Harvard\n[\n11\n]\n:-\nI well remember my surprise when, early in my first year as his student he asked me my position within a controversy we were considering. I had carefully studied the different positions and meticulously analysed the perspectives which fed into each person's approach, but was wholly unprepared to venture a stand of my own. Erwin had little patience with that kind of intellectual ducking; I realized on that day that he cared about my opinion which meant that first I had to have one. After that day I always did. I then was in the position to learn a second big lesson from Erwin. He insisted that I take the material seriously and commit myself, which meant that there was now the possibility that he and I would disagree. This could be frightening at first, but soon became heady and stimulating. Erwin is a master at serious disagreement without personal cost; he will argue passionately against your point of view, even while keeping it clear throughout that it is not at your expense that you are disagreeing. ... Erwin did not merely model for his students how to interact with him but, also, how to work with each other. I well remember in my first year, his constant glowing references to other graduate students - their strengths and achievements. ... My dissertation, like many others, was brought to completion in the context of weekly lunches among Erwin's finishing students. By the time we had finished we recognized our validity to be not only as individual scholars but as part of an intellectual community.\nHiebert was Chairman of the Department of History of Science at Harvard University from\n1977\nto\n1984\n. During his years at Harvard, Hiebert made many visits abroad as a Visiting Lecturer or Visiting Scholar. He was at the University of Bielefeld in Germany in\n1978\n-\n79\n, in Jerusalem in\n1973\nand in\n1981\n, at Churchill College, Cambridge University, England in\n1980\n,\n1981\n,\n1982\nand\n1984\n-\n85\n, at Beijing, China in\n1985\n, and in Berlin in\n1987\n-\n88\n. In\n1989\nhe reached the age of seventy and he retired from Harvard, being made Professor Emeritus. He continued to make visits abroad as a Visiting Professor after retiring from Harvard, for example Göttingen in\n1991\n-\n92\nand Berlin in\n1998\n,\n2002\n, and\n2007\n.\nHe published many papers and three books:\nThe Impact of Atomic Energy\n(1961)\n;\nHistorical Roots of the Principle of Conservation of Energy\n(1962)\n; and\nThe Conception of Thermodynamics in the Scientific Thought of Mach and Planck\n(1968)\n. He explains in the text of the first of these his reasons for writing the book:-\nWe have presented this historical and technical information because of the conviction that the knowledge of some basic facts is the minimum for any intelligent action on the part of individuals who feel that they have some personal or group responsibility to the current nuclear bomb-testing program and the question of radioactive fallout. We have tried to show that it will not do to simply banish all future nuclear energy investigations because of the tremendous potential peacetime benefits for all the nations of the world. On the other hand, we have noted that the concepts of atomic energy for peace and atomic energy for war are abstract concepts which cannot be entirely separated in practice.\nWe quote short extracts from two review of this book. First one by Arthur H Compton\n[\n3\n]\n:-\nErwin Hiebert, an American with a Canadian background, is professionally interested in the history of science, but his book, 'The Impact of Atomic Energy'\n(1961)\nis primarily concerned with group reactions of governments, scientists, and religious bodies toward the development of nuclear weapons and the peaceful uses of nuclear energy. In his opening discussion Hiebert reviews the growth of knowledge of nuclear science during the early\n20\nth\ncentury. In this summary he wisely attempts to correct the impression that this development was primarily an American achievement but shows that, in fact, it was rather an achievement of scientists throughout the world.\nNext we quote a very short extract from a review by David Anderson\n[\n1\n]\n:-\n'The Impact of Atomic Energy' can be recommended to a variety of readers: to the intelligent and concerned layman, to the student who wishes to find out what his professors have been living through in the last twenty years, and to scholars who want a convenient summary and ready bibliography for that large contemporary area in which technology and culture not only meet but veritably merge.\nWe also quote a short extract from the review\n[\n9\n]\nby Max Jammer of Hiebert's second book\nHistorical Roots of the Principle of Conservation of Energy\n(1962)\n:-\nProfessor Hiebert's proclaimed aim in his recent work is to trace 'the historical roots of the principle of conservation of energy within the framework of mechanics' prior to the middle of the eighteenth century. One of the major difficulties encountered in the study of the historical development of a scientific concept is the question of the unambiguous identification of the concept in the source material of periods prior to the time when the concept was finally given its currently accepted name. The conception of energy, for instance, played undoubtedly an important role in scientific thought long before\nJohn Bernoulli\nintroduced the term 'energy'\n1717\nin his letter to\nPierre Varignon\nof the\nParis Academy of Science\nand long before Young,\nThomson\n, and\nRankine\npromulgated in their writings the word as a 'terminus technicus' in its modern sense.\nOf the many honours that Hiebert received we mention that he was elected a Fellow of the\nAmerican Academy of Arts and Sciences\nin\n1975\n. He served as Vice President\n(1971\n-\n72)\nand then President\n(1973\n-\n74)\nof the national History of Science Society. He was Chairman of the History and Philosophy of Science Section of the American Association for the Advancement of Science from\n1982\nto\n1986\n. He  was also elected President of the Division of the History of Science of the International Union of the History and Philosophy of Science, serving from\n1982\nto\n1985\n. He was a member of the advisory board of the\nDictionary of Scientific Biography\nwhich is references frequently throughout this Archive.\nThe Harvard University obituary for Hiebert\n[\n3\n]\nstates:-\nHe was known for the intellectual zeal with which he engaged students in his seminars and notably never taught the same course the same way twice; he was perpetually looking for ways to bring new understandings to topics of research and study.  One of his strongest convictions was that in order to study the history of science, it was essential to have basic grounding in the science itself. ... He played the clarinet for most of his long life and is affectionately remembered for his spirited participation in informal evenings of music-making with the family.\nElfrieda Hiebert died in September\n2012\n, two months before her husband. A memorial service for Hiebert was held at Memorial Church in Harvard Yard on\n17\nFebruary\n2013\n."
}