{
  "nome_completo": "Estienne de La Roche",
  "nome_curto": "Estienne de la Roche",
  "ano_nascimento": "1470",
  "ano_morte": "1530",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/La_Roche/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "France",
  "biografia": "Estienne de la Roche\n's family lived on the rue Neuve in Lyon and also owned property near the town of Villefranche. Because of where he lived when young, La Roche was sometimes known as 'Villefranche.' This is almost the total information about his life which is known. It comes from the Lyon tax register of\n1493\n, which also describes de la Roche as a qualified master of 'argorisms.' This is a rather unusual spelling of 'algorisms,' but let us note that de la Roche uses the same spelling 'argorisms' in his book. De la Roche's date of birth is unknown, and the date we have given of\n1470\nis simply a guess based on the fact that he had to be old enough to be described as a qualified master of 'argorisms' by\n1493\n. At the time when de la Roche lived in Lyon it was the commercial capital of France so it is natural that someone living there would become interested in the mathematics of the time relevant to commerce. La Roche taught commercial arithmetic in Lyon for\n25\nyears. Clearly he was well thought of as a teacher of arithmetic since he was often called a 'master of ciphers.'\nIt is postulated by most historians the he learned mathematics from\nNicolas Chuquet\nfor he certainly had in his possession many manuscripts in\nChuquet\n's hand making it appears that he was on good terms with\nChuquet\n. This fact is known since a number of copies of\nChuquet\n's manuscripts still exist which have marginal annotations in de la Roche's handwriting. See the end of this article for a description of the route the manuscripts took to reach us today.\nDe la Roche published\nLarismetique nouellement composée\nⓉ\n(\nArithmetic newly presented\n)\nin\n1520\nwhich was considered an excellent arithmetic book with good notation for powers and roots. However in\n1880\nAristide Marre published\nChuquet\n's\nTriparty\nⓉ\n(\nThe science of numbers in three parts\n)\n. It was immediately discovered that the first part of de la Roche's\nLarismetique\nⓉ\n(\nArithmetic newly presented\n)\nis essentially a copy of\nChuquet\n's\nAlgebra\n.\nFlorian Cajori\n, in volume\n1\nof his\nA History of Mathematical Notations\npublished in\n1928\nwrites:-\nDe la Roche mentions\nChuquet\nin two passages, but really appropriates a great deal from his distinguished predecessor, without, however, fully entering into his spirit and adequately comprehending the work. It is to be regretted that\nChuquet\ndid not have in de la Roche an interpreter acting with sympathy and full understanding.\nIt was thought at this time that de la Roche was simply a plagiarist. However more recent work has come to a less harsh conclusion about de la Roche. It now appears that de la Roche was trying to teach important mathematics which was not available to the French public. For instance Barbara Moss argues\n[\n5\n]\n:-\n... that the charge of plagiarism against Estienne de la Roche is largely an anachronism, and that the difference in emphasis may be explained by the readers he had in mind and by the climate of mathematical opinion, while the similarities are close enough to indicate how far his potential readership would have been receptive to a more faithful presentation of\nChuquet\n's ideas. ... If de la Roche had been more faithful to\nChuquet\n's notation and terminology and had used it consistently, and especially if this had given rise to some controversy in the literature, then\nBombelli\n's work, at least, might have been enhanced. In this sense, and in this sense only, can de la Roche be held responsible for\nChuquet\n's ideas remaining in obscurity.\nLet us now look at some examples of notation from de la Roche's\nLarismetique nouellement composée\nⓉ\n(\nArithmetic newly presented\n)\n. He used the same notation as\nChuquet\nfor + and -, namely\np\np\np\nand\nm\nm\nm\nwith a ~  above each. He used several notations for roots, so where we would write √\n5\nhe would write ℞\n2\n5\n^{2} 5\n2\n5\nwhere there is a line through the right hand leg of the R. For the cube root of\n5\nhe would write either ℞\n3\n5\n^{3} 5\n3\n5\nor ℞\n5\n. This strange use of a square to denote the cube only appears in de la Roche, not being followed by anyone else. As well as ℞\n4\n5\n^{4} 5\n4\n5\nhe would use H℞\n5\nfor the fourth root of\n5\n, and H℞\n5\nfor the sixth root.\nHere is his description of numbers, powers and the unknown\n(\na thing\n)\n. We follow\nCajori\n's translation:-\nAnd a number may be considered as a continuous quantity, in other words, a linear number, which may be designated a thing or as primary, and such numbers are marked by the apposition of unity above them in this manner\n1\n2\n1\n12^{1}\n1\n2\n1\nor\n1\n3\n1\n13^{1}\n1\n3\n1\n, etc., or such numbers are indicated also by a character after them, like\n12\n.p. or\n13\n.p. ... Cubes one may mark\n12\n.\n3\n12.^{3}\n1\n2\n.\n3\nor\n13\n.\n3\n13.^{3}\n1\n3\n.\n3\nand also\n12\nor\n13\n.\nHere is an example of one of his problems with solution which we have put into modern notation:-\nNext find a number such that, multiplied by its root, the product is\n10\n.\nSolution: Let the number be\nx\nx\nx\n. Then\nx\nx\nx\nmultiplied by\n√\nx\n√x\n√\nx\ngives\n√\nx\n3\n√x^{3}\n√\nx\n3\n=\n10\n. Now, as one of the sides is a radical, multiply each side by itself. You obtain\nx\n3\n=\n100\nx^{3} = 100\nx\n3\n=\n1\n0\n0\n. Solve. There results the cube root of\n100\n, i.e.\n3\n\\sqrt [3]{}\n3\n​\n100\nis the required number. Now to prove this, multiply\n3\n\\sqrt [3]{}\n3\n​\n100\nby\n6\n\\sqrt [6]{}\n6\n​\n100\n. But first express\n3\n\\sqrt [3]{}\n3\n​\n100\nas a sixth root, by multiplying\n100\nby itself, and you have\n6\n\\sqrt [6]{}\n6\n​\n10000\n. This multiplied by\n6\n\\sqrt [6]{}\n6\n​\n100\ngives\n6\n\\sqrt [6]{}\n6\n​\n1000000\n, which is the square root of the cube root, or the cube root of the square root, or\n6\n\\sqrt [6]{}\n6\n​\n1000000\n. Extracting the square root gives\n3\n\\sqrt [3]{}\n3\n​\n1000\nwhich is\n10\n, or reducing by the extraction of the cube root gives the square root of\n100\n, which is\n10\n, as before.\nDe la Roche was writing a commercial arithmetic, and as such it was highly successful. He says that he is writing:-\n... with only a little addition to what I have found and experimented with in my time in practice: and of all this I have made a little tract entitled 'The arithmetic of Estienne de la Roche.'\nHe says of his own work that it is:-\n... the flower of several masters, experts in the art, ...\nsuch as:-\n...\nNicolas Chuquet\nfrom Paris, Philippe Friscobaldi from Florence, and\nLuca Pacioli\nfrom Burgo.\nThis statement itself suggests that de la Roche was not trying to hide his dependence on others, for many mathematicians of this period would have made no acknowledgement to others at all. Indeed de la Roche took parts of\nChuquet\n, parts of Pacioli and parts of Philippe Friscobaldi, a French banker who is considerably less well known as a mathematics writer than the other two. The unfortunate part is that de la Roche lacked any real skill in forming them into his teaching book.\nAristide Marre's introduction to his\n1880\nedition of\nChuquet\n's\nTriparty\nⓉ\n(\nThe science of numbers in three parts\n)\ntells us how the manuscript which de la Roche owned\n(\nand annotated\n)\ncame down to us today\n[\n2\n]\n:-\nAfter it had been in the possession of de la Roche, it was bought by an Italian, Leonardo de Villa, according to a note written in Latin at the beginning of the work. It then passed into the famous library of Jean Baptiste Colbert\n(1619\n-\n1683)\n, the finance minister of King Louis XIV who was also the founder of the French Academy ... In\n1732\n, some eight thousand volumes, formerly in Colbert's possession, passed into the royal library of King Louis XV, among which was\nChuquet\n's manuscript. ... Today it is ... in the Bibliothèque Nationale.\nAs de la Roche's birth date is unknown, so is his death date. It appears he was still alive when his\nLarismetique nouellement composée\nⓉ\n(\nArithmetic newly presented\n)\nwas published in\n1520\n, but since Gilles Huguetan revised the work for publication in\n1538\n, de la Roche must have died a few years before\n1538\n. The given date of\n1530\nis simply a guess using this small amount of information."
}