{
  "nome_completo": "Ethel Mary Elderton",
  "nome_curto": "Ethel Elderton",
  "ano_nascimento": "1878",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Elderton/",
  "lugar_nascimento": "Fulham, London, England",
  "lugar_morte": "Stanborough Park, near Watford, Hertfordshire, England",
  "biografia": "Ethel Elderton\nwas a daughter of William Alexander EldertonÂ\n(1839\n-\n1890)\nand his wife Â Sarah Isabella LapidgeÂ\n(1852\n-\n1931)\n. William Elderton had been born in Kendal, Westmorland, but had been brought up in Marylebone, London, where his father Charles Merrick Elderton was a practising barrister. William had studied the mathematical tripos at the University of Cambridge becoming a Wrangler, and was awarded a B.A. He was also a French scholar interested in history and English literature. He had then become a private tutor with a reputation as an outstanding teacher. He had married Sarah Lapidge on\n14\nOctober\n1875\nat the District Church in St Ann's, Lambeth, Surrey. Sarah Lapidge had been born in Ramsgate, Kent to Charles Horace Lapidge and his wife Eliza Caroline Lapidge. William and Sarah EldertonÂ had eight children: Robert Lapidge Elderton\n(1876\n-\n1958)\n; William Palin Elderton\n(1877\n-\n1962)\n; Ethel Mary Elderton\n(1878\n-\n1954\n, the subject of this biography\n)\n; Isabel Edith Elderton\n(1880\n-\n1975)\n; Margaret Florence Elderton\n(1882\n-\n1972)\n; Merrick Beaufoy Elderton\n(1884\n-\n1939)\n; Thomas Howard Elderton\n(1886\n-\n1970)\n; and Silvia Ruth Elderton\n(1888\n-\n1972)\n.\nBefore was give details of Ethel Elderton's life, let us say a little about her siblings. Most of Ethel's brothers had careers involving mathematics: Robert Lapidge Elderton was for many years a member of the staff of the National Provident Institution and an Associate of the Institute of Actuaries; William Palin Elderton became an actuary and was the joint author of a statistics book with his sister Ethel; Thomas Howard Elderton, later Sir Thomas Elderton, K.C.I.E., became Chairman of the Calcutta Port Trust; and Merrick Beaufoy Elderton studied mathematics at Clare College Cambridge and was appointed a mathematics master at Sherborne School. He became a housemaster ofÂ AbbeylandsÂ House, Sherborne School, and was Dorset County cricket captain. Ethel's sisters all became schoolmistresses: Isabel did not marry; Margaret married Robert Kelsall, who had a military career, in December\n1918\n; and Silvia married the schoolmaster Charles Arthur Freer Green in April\n1915\n.\nAt the time of the\n1881\ncensus, Ethel Elderton is two years old and living at Parsons Green Rectory House, Fulham where her father was running a school with the help of a tutor. There were six pupils and several servants all living at the school. At the time of the\n1891\ncensus, Ethel Elderton is twelve years old and living at\n32\nMontrell Road, Streatham with her mother, her seven siblings, and two domestic servants. Her father had died on\n17\nMarch in\n1890\nat\n2\nColville Square, Notting Hill, London and her mother had taken a job as a school teacher to support the family. Ethel was a pupil at Streatham High School, graduating in\n1895\nand later that year began her studies at Bedford College, London. This college had been founded in\n1847\nto provide higher education for women; in fact it was the first college in the UK to provide such an education for women. In\n1874\nthe College moved from its first site in Bedford Square to two houses in York Place, close to Baker Street, in Marylebone. Percy John Harding taught mathematics at Bedford College, starting in\n1870\nwhen\nOlaus Henrici\nleft to replace\nThomas Hirst\nat University College. At first Harding, like all his predecessors, did not teach mathematics to degree level but in\n1879\n-\n80\nhe taught the first higher mathematics classes that Bedford College had started up due to increased demand. Harding was still the professor of mathematics at Bedford College when Elderton studied there.\nAlice Lee\nwas Harding's assistant, she taught Elderton and was impressed by her abilities.\nElderton passed the matriculation examination for the University of London in\n1897\n. At this time Bedford College was not part of the University of London but many students took University of London degrees after studying at the College. In fact, three years later, Bedford College became a part of the University of London. Although Elderton, having matriculated, was in a position to take a degree she chose not to take a degree becoming a school teacher. She lived with her mother in Streatham and at the time of the\n1901\ncensus the family are living at\n15\nTelford Avenue, Streatham. Elderton's mother and the three oldest girls are all school mistresses, the girls assisting their mother run the school, while Silvia is still studying at school. William Palin Elderton is the only one of the children not to be living there.\nAfter about seven years school teaching, Elderton was appointed to the Eugenics Record Office\n[\n10\n]\n:-\nIn January\n1905\nEdgar Schuster was chosen from ten applicants as the first Fellow in National Eugenics. Schuster was a student of Professor\nW F R Weldon\n, the prime mover in the foundation of the \"biometric school.\" Miss E M Elderton was appointed as an assistant to Schuster and together they made up the staff of the Eugenics Record Office which was under\nGalton\n's general oversight. The office was situated in rooms belonging to University College.\nIn fact Elderton had been recommended by\nAlice Lee\nwho had taught her at Bedford College.\nKarl Pearson\nwrites\n[\n14\n]\n:-\nGalton\n, when he returned to England, circularised many folk, issuing small finger-printing apparatus, and asking for the prints of the two forefingers of as many relatives to be taken as possible. To aid him in the reduction of these and other data\nGalton\ndesired to find an assistant. On the advice of Dr\nAlice Lee\n, he selected Miss Ethel M Elderton - a most happy choice. She received her first training from\nFrancis Galton\n, then became successively Secretary to the Eugenics Record Office,\nGalton\nResearch Scholar in the Eugenics Laboratory, then\nGalton\nFellow ... Perhaps this was the best result that flowed from the forefingers-print collection!\nElderton quickly impressed with her remarkable abilities to calculate and the amount of work she was able to process. In a letter to\nGalton\n, written on\n25\nOctober\n1906\n,\nPearson\nwrites\n[\n14\n]\n:-\nI would suggest that Miss Elderton be no longer spoken of as a clerk, but be made a\nFrancis Galton\nScholar. She is quite capable of doing original work. I should give her a little additional instruction in statistical methods, and set her on to research work either alone or in conjunction with Heron, so that her name would appear on the publication of it. I would further suggest that her stipend be raised. My reasons for this are as follows. ... She is very competent and is now fairly well trained, and it is very desirable that we should retain her services. She is keen on the work.\nFor many references to the outstanding work that Ethel Elderton was doing, see extracts from letters mainly between\nPearson\nand\nGalton\nwhich we give at\nTHIS LINK\n.\nIn\n1907\nElderton co-authored with Edgar Schuster the paper\nThe Inheritance of Psychical Characters\n, published in\nBiometrika\n. She published the single authored paper\nOn the Association of Drawing with Other Capacities in School Children\nin\nBiometrika\nin\n1909\n. For short extracts from these papers, and from other papers published by Elderton, see\nTHIS LINK\n.\nOne of Elderton's most influential papers was\nA first study of the influence of parental alcoholism on the physique and ability of the offspring\n. This was written as a single author work \"with the assistance of\nKarl Pearson\n\" and appeared in\n1910\n. This work was, however, much criticised, for example J M K\n[\nJohn Maynard Keynes\n]\nwrites in the review\n[\n12\n]\n:-\nThe second investigation is concerned with a much more definite and important problem. It examines all the children, about\n1\n,\n400\nin number and drawn from nearly\n700\nfamilies, who were attending a certain school; and it is claimed that they fairly represent a random sample of the population. The authors find that whether we take the height, the weight, the general health, the intelligence, or the eyesight of the children, there is little to choose between the offspring of drunken and of temperate parents ... there are two points of statistical method in which the memoir seems open to criticism. In the first place no adequate attempt is made to display to the reader the real character of the evidence upon which it is based. ... In the second place, it may be doubted whether, in several instances, anything has been gained by the calculation of coefficients of correlation. ... the tables in this memoir are not at all complex, and in most of them it can be easily seen with the naked eye that no significant degree of correlation is present. The elaborate calculations, upon which an immense amount of trouble must have been expended, and the careful corrections for age and so forth are, therefore, labour wasted. Miss Elderton has spent her time and her manifest skill on material which, it should have been obvious from the beginning, could not repay her. Trouble which might have been better spent on improving the original material has been needlessly expended on computations, which add little to our knowledge, and which confuse, though they may also impress, all readers outside a very restricted class.\nAlso in\n1910\nPearson\nand Elderton replied to the criticism in\nA second study of the influence of parental alcoholism on the physique and ability of the offspring\n:-\nA second study of the influence of parental alcoholism on the physique and ability of the offspring being a reply to certain medical critics of the first memoir and an examination of the rebutting evidence cited by them.\nIt is worth looking at the two different driving forces behind Elderton's work. There is no doubt that she firmly believed that good statistical evidence had to be produced before sensible solutions to social problems should be sought. There is also strong evidence that she was a talented statistician able to produce high quality statistical evidence. The other driving force, however, was the aims of those behind the ideas of eugenics, particularly\nPearson\nand\nGalton\n. In would appear that Elderton accepted these aims. As Lyndsay Andrew Farrall writes in\n[\n10\n]\n:-\nThe phrases 'race progress,' 'national efficiency,' and 'national fitness' which occur in Elderton's writings as they do in those of the other research workers from the Eugenics Laboratory clearly indicate an ideological commitment of these eugenists to nationalism and racism.\nThere is, however, some evidence that Elderton may not have totally accepted the aims of eugenics but have been merely following the lead provided by\nPearson\nand\nGalton\n. In\n1907\nGalton\ndelivered the 'Herbert Spencer' lecture and in it he sketched out a proposal for an elementary statistics text. He later wrote in the Preface of the resulting text:-\nI expressed the hope that some competent teacher would elaborate a course of instruction on these lines. I entertain a strong belief that such a course would be of great service to those who are interested in statistics, but who, from want of mathematical aptitude and special study, are unable to comprehend the results arrived at, even as regards their own subjects.\nThe suggestion was taken up by Ethel Elderton and her brother William Palin Elderton, who had also undertaken work for\nPearson\n. By March\n1909\nthe Eldertons had essentially completed the text but a title had to be decided on and a publisher found.\nGalton\nwrote to\nPearson\n(22\nMarch\n1909)\n:-\nI write now about the Eldertons' little elementary book, for the cost of publication of which I am responsible. It never occurred to me before, but the Eugenics Education Society are just the people to publish it. ... I am writing to Miss Elderton.\nPearson\nreplied:-\nI have not yet seen the Eldertons' MS but I suppose I shall eventually. I shall be quite ready to publish it as a Laboratory publication if that seems desirable to those concerned. I am not at all sure, however, that it would not be well to try it with a good publisher first of all. It would save the expense of publication and get a reasonable amount of notice from the Press and advertisement. I think Mr Elderton is a little frightened of the idea of the Eugenics Education Society.\nIt may indeed be Palin Elderton who was against the eugenics connection, but we suggest that Ethel Elderton, with whom\nGalton\nand\nPearson\nwere corresponding about publishing the book, must also have taken that view. As to the title,\nGalton\nwrote to\nPearson\n(16\nJune\n1909)\n:-\nIf, as you suggest, it is called a Primer, it ought to be of Biometry and Eugenics. The two latter words are important.\nIt must have been quite difficult for the Eldertons to argue against\nGalton\n, but clearly they did so since the book appeared with the title\nA Primer of Statistics\n.\nFor more details of the correspondence of\nGalton\nand\nPearson\nabout the book, see\nTHIS LINK\n.\nFor more information about\nA Primer of Statistics\nincluding extracts from reviews, see\nTHIS LINK\n.\nIn\n1925\nPearson\nfounded the\nAnnals of Eugenics\nwhich he edited with Ethel Elderton's help. The foreword to the first part of the first volume, written jointly by\nPearson\nand Elderton, begins:-\nThe time seems fully ripe for the issue of a journal which shall devote its pages wholly to the scientific treatment of racial problems in man. Several journals allot some of their space to original memoirs dealing with eugenics and the general problems of race hygiene. Others of a minor character spend their main energies in popular articles, book-reviews and accounts of matter published elsewhere. Our journal will differ from existing journals in that bibliographical matter will be reduced to a minimum, that no other topics than the problems of race in man will be dealt with, and that the papers published will be the work of trained scientists rather than of propagandists and dilettanti. Naturally a journal issued by the\nGalton\nLaboratory will be sympathetic to the methods of its founder summed up in the title of his Herbert Spencer Lecture \"Probability the Foundation of Eugenics.\" But this does not signify that contributions dealing with heredity in man from any scientific standpoint will not be acceptable.\nThe journal still exists today but, with eugenics coming under increasing criticism, it changed its name to the\nAnnals of Human Genetics\nin\n1954\n.\nFarrall gives this overview of Elderton's contributions\n[\n10\n]\n:-\nThe work of Ethel Elderton was in three main areas. Most of it was concerned with the question of determining the relative importance of the contributions of heredity and environment to the fashioning of physical and mental characteristics in man. A second area of research for her was the measurement of resemblance between different sets of relatives she also carried out some work analysing vital statistics of the British population\nRosaleen Love writes\n[\n13\n]\n:-\nIt was Ethel Elderton of all the women at the Eugenics Laboratory who did most to wear down\nFrancis Galton\n's prejudice that women were intuitive unintellectual creatures incapable of sound academic work. One of her first tasks with\nGalton\nwas to help him with the collection and collation of data on 'large and thriving families'. Most of this work came to nothing. The projected Golden book of noteworthy families, a kind of eugenist Who's who, never appeared. At the\nGalton\nLaboratory she moved on to collect information on the resemblances between different sets of relatives, as part of a larger study of the inheritance of ability. Much of her work examined important social issues of the day from the eugenist viewpoint that social problems were to be related to factors inherent in the individual.\nLet us quote the first paragraph of Love's description of one of Elderton's research papers\n[\n13\n]\n:-\nEthel Elderton's \"Report on the English birthrate. Part I: England north of the Humber\"\n(1914)\nis perhaps the most revealing example of a eugenist research programme which is given an extra dimension by being related to the actual lives of individual women. The dry title of the paper conceals a wealth of fascinating social detail on the lives of working men and women of the time, and in particular her account of abortion practices given in the words of the Northern women as reported by their chemists and physicians is horrifying. In this respect here was a pioneering work, the first population study to give extensive references to the prevalence of induced abortion in England at the end of the nineteenth and the beginning of the twentieth century,\n...\nIt would hardly be expected that a eugenist would endorse the practice of family limitation to one or two children in the worthy artisan ranks of society, and the Report concluded with a gloomy picture of the future of the British people and their Empire if the trend continued. Similarly, contraception was disapprovingly seen as a factor in the growing trend towards promiscuity. What the Report does do is to illustrate that by and large it was the women who were taking decisions on the control of fertility, and the contribution women could make was one factor that the eugenist programme often completely overlooked.\nWe should note the high regard that both\nPearson\nand\nGalton\nhad for Elderton. She was awarded the\nWeldon\nMemorial Prize by the University of Oxford inÂ\n1919\n. This was awarded to the person who \"in the ten years next preceding the date of the award, published the most noteworthy contribution to the development of mathematical or statistical methods applied to problems in Biology.\" In\n1931\nElderton was awarded a D.Sc. by the University of London and, in the same year, was promoted to a readership in the University of London. She retired in\n1933\nand in\n1939\nshe was living at Yew Tree Cottage, Northchapel, Sussex. She died in\n1954\nin Stanboroughs Hydro Nursing Home, Stanborough Park, Garston, Hertfordshire."
}