{
  "nome_completo": "Eugène Charles Catalan",
  "nome_curto": "Eugène Catalan",
  "ano_nascimento": "1814",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Catalan/",
  "lugar_nascimento": "Bruges, French Empire (now Belgium)",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Eugène Catalan\nwas born in Bruges and although we have given this as being in Belgium, it actually was in France at the time of his birth. Belgium had been part of the Austrian Netherlands until\n1793\nbut was under the Napoleonic consulate and part of the French empire from\n1799\nto\n1814\n. After the defeat of Napoleon, the Allied powers were determined not to leave Belgium in the possession of France. The Kingdom of the Netherlands was confirmed by the Congress of Vienna in June\n1815\nbut it was established for the convenience of Europe without considering the desires of the Belgians and the Dutch. Prince William of Orange took the throne on\n16\nMarch\n1815\n, taking the title William I, and he was crowned on\n27\nSeptember. Catalan was therefore born in France, and so rightly considered himself French. However the town of his birth became part of the Kingdom of the Netherlands before he was one year old. His name was registered on his birth certificate as Eugène Charles Bardin. His mother, Jeanne Bardin, was the seventeen year old daughter of Jean Bardin. She had been born in Beaune and was living with her parents in Bruges at the time her son was born. She was unmarried, and her son was registered under her name of Bardin. Although Jean Bardin appears on official records as a bookseller, in reality he was a travelling salesman of cheap books who had moved from Beaune to Bruges. Eugène's mother earned some money as a dressmaker in the years when her young son was growing up. Although at first she lived with her parents, she eventually left their home and in\n1820\nshe spent several months in Brussels. Eugène's father, Joseph Victor Étienne Catalan, was originally from Paris. He married Jeanne Bardin in\n1821\nand, on\n1\nMarch of that year, acknowledged that he was the father of her son who was nearly seven years old. Joseph was a jeweller but, in reality, he made money with various schemes such as selling pictures and perfume. In May\n1822\n, Joseph and Jeanne Catalan were living in Lille with their son. Eugène certainly had had some education and was able to write excellent French by the age of ten. At this time, in\n1824\n, he became an apprentice jeweller. However, he only kept up this apprenticeship for three months, giving up because he lacked ability.\nIt is unclear just when the family moved to Paris, but this must have occurred around\n1825\n. Eugène rapidly fell in love with the city and his parents allowed him to roam the streets. He watched the jubilee procession through Paris which took place on\n3\nMay\n1826\n, when the corner-stone of a monument to Louis XVI was laid and dedicated, and he described it in detail in a letter. Although he was only twelve years old at the time, Eugène's dislike of the monarchy is clearly and forcibly expressed. For the rest of his life he considered himself a Parisian. It is unclear exactly when Jeanne Catalan died, but it must have been soon after the family moved to Paris. Joseph Catalan, who had now become an architect, married Adélaïde Vitry on\n2\nAugust\n1828\nin the church of Saint Nicolas des Champs. Eugène was set to follow his father and become an architect and, although he had notattended a lycée, he entered the École Royale Gratuite de Dessin et de Mathématiques en Faveur des Arts Mécaniques. He was very happy at this school, and was particularly impressed by professors Jean Paul Douliot\n(1788\n-\n1834)\nand Jean-Baptiste-Omer Lavit\n(1771\n-\n1836)\n. In addition to attending courses at the École Gratuite de Dessin, Catalan attended courses at the École des Beaux-Arts. He remained a pupil at the École Gratuite de Dessin until\n1831\nbut, in\n1829\n, after a competition, he was appointed to teach geometry to his fellow pupils at the school. He retained this teaching post until\n1833\n, but while he was at the school, he became more politically active, spurred on by the revolution of\n1830\n. This revolution had repercussions across Europe, in particular in Belgium where dissatisfaction with King William I's rule led to moves against the monarchy culminating in the \"Belgian Revolution\" of August-September\n1830\n, following the July Revolution in Paris earlier that year. On\n20\nJanuary\n1831\n, an international conference in London recognized Belgium as an independent state.\nAt the École Gratuite de Dessin, Catalan was taught by Louis Lefébure de Fourcy who had been appointed as an admissions examiner for the École Polytechnique in\n1826\n. He encouraged Catalan, who showed an outstanding aptitude for mathematics, to prepare himself to take the admission examinations for the prestigious university. He studied at the institution run by Monsieur de Reusse on the Rue de Vaugirard. He also attended a mathematics course given by Antoine Delisle\n(\nauthor of\nÉléments de trigonométrie rectiligne et sphérique\nⓉ\n(\nElements of rectilinear and spherical trigonometry\n)\n)\nat the Lycée Saint-Louis, nearby on the Boulevard Saint-Michel, as well as a course by\nLouis Francoeur\nat the Sorbonne on the same Boulevard. He won the first prize in the Concours Général de Mathématiques Spéciales in the summer of\n1833\n. Rather than carry on studying, Catalan spent August and September of that year back in Bruges, the first time he had been in that city since he was eleven years old. He went back there to celebrate the birthday of his grandmother on\n20\nSeptember. Having taken the entrance examinations for the École Polytechnique, he was admitted in November of\n1833\nranked\n53\nrd\nin the list of accepted students, although he almost certainly would have been ranked higher but for the break in his studies. At the École Polytechnique, Catalan attended mathematics courses given by\nJoseph Liouville\nand\nGabriel Lamé\n. However, he also studied other topics including the literature and history of France reading authors such as Voltaire, Molière and La Bruyère.\nThe students at the École Polytechnique were much involved in the political events which were taking place in France at this time. It was a time of great political instability and, in April\n1834\n, there were serious disturbances in Paris following the passing of a law to curtail the activities of the Republican Society of Human Rights. The disturbances were brutally put down by the army. The authorities tried to ensure that the students did not become involved and they send down a number of students who had trumpeted their Republican sympathies. Despite his strong Republican beliefs, Catalan kept out of trouble. In November\n1834\nhe completed his first year of study, being ranked\n49\nth\nout of\n145\nstudents. He was to proceed to his second year but, his father received a letter dated\n15\nDecember informing him that his son had been dismissed from the École Polytechnique and was returning home. Catalan had not been singled out for this punishment, for it appears that the whole of his year suffered the same fate. In fact during this forced vacation Catalan took the opportunity to become engaged to Charlotte Augustine Renée Perin\n(\nknown as Eugénie\n)\nwho was two years his elder. She had been born in Lille, where Catalan had spent several years. They were engaged to be married on\n2\nJanuary\n1835\nand spent the rest of their lives together.\nCatalan had to apologise for an \"act of subordination\" before he was allowed to return to the École Polytechnique in the middle of January\n1835\n. He must have found that a difficult thing to do but he knew that he had to do such things if he was to complete his education. He studied hard and graduated in the summer of\n1835\n, ranked\n16\nth\nout of the\n140\nstudents who had qualified for public service. He was placed\n13\nth\namong the students who were qualified to enter the École des Ponts et Chaussées but decided that this was not the route that he wanted to take. He was appointed as professor at the École des Arts et Métiers at Châlons-sur-Marne, taking up his appointment in the autumn of\n1835\n. On\n4\nJanuary\n1836\nCatalan's father died and on\n8\nApril his grandfather Jean Bardin died, but he went ahead with his marriage to Eugénie Perin on\n28\nApril. In spite of the fact that he was not a practising Christian, they was married in the church of Saint Eustache in Paris. Their first child, a daughter Marie Adélaïde, was born in Châlons-sur-Marne.\nLiouville\nbegan publication of\nJournal de Mathématiques Pures et Appliquées\nin\n1836\nand a paper by Catalan,\nSolution d'un problème de Probabilité relatif au jeu de rencontre\nⓉ\n(\nSolution of probability problem relating to the game of meeting\n)\n, was published in the second volume in\n1837\n. In the same journal, he published two papers in\n1838\n:\nNote sur un Problème de combinaisons\nⓉ\n(\nNote on a problem of combinations\n)\n, and\nNote sur une Équation aux différences finies\nⓉ\n(\nNote on a finite difference equation\n)\n. The second of these contains the 'Catalan numbers' which appears in the solution of the problem of dissecting a polygon into triangles by means of non-intersecting diagonals. Four papers by Catalan are published in Volume\n4\nin\n1839\n:\nNote sur la Théorie des Nombres\nⓉ\n(\nNote on the theory of numbers\n)\n;\nSolution nouvelle de cette question: Un polygone étant donné, de combien de manières peut-on le partager en triangles au moyen de diagonales?\nⓉ\n(\nA new solution to the problem: Given a polygon, in how many ways can we  trianglulate it using diagonals?\n)\n;\nAddition à la Note sur une Équation aux différences finies\nⓉ\n(\nAddition to note on a finite difference equation\n)\n; and\nMémoire sur la réduction d'une classe d'intégrales multiples\nⓉ\n(\nMemoir on the reduction of multiple integrals of class\n)\n.\nYou can see more about the Catalan numbers at\nTHIS LINK\n.\nCatalan was keen to return to Paris and he applied for the professorship at the École Gratuite de Dessin which had become vacant on the death of his former professor Jean-Baptiste-Omer Lavit in\n1836\n. He was unsuccessful. He wrote to\nLiouville\nin January\n1837\nwho replied encouraging him to come to Paris in the Easter holidays to discuss his future with him. He suggested that Catalan needed further qualifications, such as the baccalaureate, in order to make a successful career. Later that year, Catalan resigned his position at Châlons-sur-Marne and returned to Paris. Along with\nCharles-François Sturm\nand\nJoseph Liouville\n, he founded the École Sainte-Barbe near the Sorbonne. The school, whose aim was to train pupils for admission to the École Polytechnique, opened in\n1838\n. In the same year, on\n20\nNovember, he was appointed assistant tutor\n(\nrépétiteur\n)\nin descriptive geometry at the École Polytechnique, assisting Charles François Antoine Leroy who was teaching this topic. Catalan lectured on part of the descriptive geometry course in\n1840\n, the year in which his second daughter Fanny was born. In\n1839\nhe had been appointed as a deputy examiner at the École Polytechnique. As soon as he had returned to Paris, in addition to these other tasks, Catalan had taken\nLiouville\n's advice regarding his baccalaureate, and began studying hard. He was awarded a double baccalaureate in\n1839\nand continued to study, receiving his \"licence in mathematical sciences\" in the following year. He was awarded his doctorate in mathematics in\n1841\nfor his main thesis in Mechanics\nAttraction d'un ellipsoïde homogène sur un point extérieur ou sur un point intérieur\nⓉ\n(\nAttraction of a homogeeous ellipsoid on an external point or a point inside\n)\n, and a further thesis\nSur le mouvement des étoiles doubles\nⓉ\n(\nOn the motion of double stars\n)\nin Astronomy. In\n1845\n, he was awarded a \"licence in physical sciences\".\nAugustin-Louis Cauchy\n, a fervent Royalist, had left Paris in\n1830\nand, failing to swear an oath of allegiance to the new regime, had lost all his positions there. However, he returned to Paris in October\n1838\nregaining his position at the\nAcadémie des Sciences\nbut not his teaching positions because he still refused to take an oath of allegiance. In July\n1839\nCauchy\ninvited Catalan and\nLejeune Dirichlet\nto dinner. Although this was an honour for the young Catalan, given that their political views were at the opposite ends of the spectrum, this was never going to develop into a close friendship. Catalan was, however, still supported by\nLiouville\nwho proposed him for membership of the Société Philomatique. After being unsuccessful in\n1839\n, Catalan was elected to the Society in May\n1840\nand began publishing articles in the Society's journal. In\n1841\nhe gave the general change-of-variable theorem for\nn\n-dimensional integrals in\nSur la transformation des variables dans les integrales multiples\nⓉ\n(\nOn the transformation of variables in multiple integrals\n)\nwhich was published in the\nMémoires Couronnés\nof the Academie Royale des Sciences et Belles-Lettres de Bruxelles. In\n1843\nhe published for the first time in\nCrelle\n's\nJournal für die reine und angewandte Mathematik\n. This contains the 'Catalan Conjecture':-\nI beg you, sir, to please announce in your journal the following theorem that I believe true although I have not yet succeeded in completely proving it; perhaps others will be more successful. Two consecutive whole numbers, other than\n8\nand\n9\n, cannot be consecutive powers; otherwise said, the equation\nx\nm\n−\ny\nn\n=\n1\nx^{m} - y^{n} = 1\nx\nm\n−\ny\nn\n=\n1\nin which the unknowns are positive integers only admits a single solution.\nPiotr Tchihatchef was a Russian geographer and geologist who was spending the winter of\n1842\n-\n43\nin Paris. He approached Louis Francoeur asking to be tutored in mathematics and Francoeur advised him to approach Catalan. This in fact proved fortunate for Catalan since Tchihatchef had been given a paper by the Russian mathematician\nPafnuty Chebyshev\nto submit for publication in Paris. Tchihatchef showed Catalan the paper and Catalan began to correspond with\nChebyshev\n; a correspondence which continued for fifty years.\nChebyshev\n's paper appeared in\nLiouville\n's\nJournal de mathématiques pures et appliquées\nin May\n1843\n. It was followed in the same journal by a short paper by Catalan proving a formula for the transformation of a multiple integral stated without proof in\nChebyshev\n's paper. On\n6\nJanuary\n1844\nCatalan was appointed as secretary of the Société Philomatique.\nGiven his achievements, Catalan's university teaching career should have been progressing but any prospects of a smooth path was damaged by his continuing political activities and his strong left-wing Republican views. In November\n1844\nhe was ranked first by the Council for the position of tutor at the École Polytechnique but\nOssian Bonnet\nwas appointed to the position and Catalan remained as an assistant tutor.\nAdolphe Quetelet\n, the Belgium scientist with whom he had corresponded since his\n1841\nMémoires couronnés\nⓉ\n(\nCurrent memoirs\n)\nin the\nAcademie Royale des Sciences et Belles-Lettres de Bruxelles\n, encouraged him to seek a university position in Belgium because of his lack of progress in Paris. He had received another setback in his career in December\n1844\nwhen, after\nFrancoeur\nhad indicated that he wanted Catalan as his deputy at the Sorbonne, he had been rejected by the Royal Council. Instead, they appointed\nJoseph Bertrand\nto the position. In\n1846\nCatalan competed in the\nConcours d'agrégation\n(\na contest to become a university teacher\n)\nand was placed first. However, he was given no appointment. Catalan was paying a high price for his strong, publicly expressed Republican views.\nIn September\n1846\nCatalan wrote to\nQuetelet\nindicating that he was beginning to regret having remained in Paris instead of following his suggestion to move to Belgium. However, in November he was appointed to take charge of teaching higher mathematics at the Collège de Charlemagne but then became involved in the political unrest in France in\n1848\n. This revolution materialised without any very definite cause, although food shortages from\n1846\nonwards had caused much economic trouble and discontent of which the Republicans took advantage. The trigger appears to have been the cancellation by the government of a major banquet arranged for February\n1848\nby the Republicans. Catalan took a highly active role in the disturbances, leading a band of workers who entered the Hôtel-de-Ville immediately after a group of students from the École Polytechnique. The revolution led to the Second Republic, and the voters chose Louis-Napoleon Bonaparte to become president. This fitted well with Catalan's Republican views and he offered himself for election to the National Assembly. Here is an extract from his manifesto:-\nI was brought up to be contemptuous of kings and I greeted the fall of Charles X rapturously. I submitted, but protesting with indignation, to the master schemers and dupes we imposed on ourselves at that time. I myself was fooled for a moment, but I stopped being fooled at the retreat of the virtuous Dupont\n(\nde l'Eure\n)\n, and before the end of\n1830\n, I was a Republican. Since then, I have not missed a single day without contributing my wishes, my words and deeds, to the overthrow of the man that France supported too long!\nYou can see the full manifesto at\nTHIS LINK\n.\nHis career seemed to be going well again when he was appointed to the Lycée Saint Louis in\n1849\n. At the École Polytechnique, however, he continued to be disappointed. Two admission examiners were appointed in\n1848\nand, although Catalan was on the list of four offered to the Ministry,\nCharles Hermite\nand\nJoseph Serret\nwere appointed with Abel Transon and\nPierre Bonnet\nas their deputies. Although Transon\n(1805\n-\n1876)\n, like Catalan, was a socialist, he took little part in politics after the age of thirty.\nIn June\n1850\na commission was chaired by\nUrbain Le Verrier\nto reorganise teaching at the École Polytechnique.\nJean-Victor Poncelet\nand\nJean-Marie Duhamel\nwere the mathematicians on the commission. It reported in November and Catalan did not like either the academic changes that were proposed, particularly the considerable reduction in pure mathematics, nor did he like the fact that much more work was to be undertaken by the tutors. He resigned his position as assistant tutor later that month. In his letter of resignation he pointed out that he had been an assistant tutor for twelve years, and also explained that he would be unable to undertake the extra teaching required due to his duties at the Lycée Saint Louis. Catalan was not the only one to leave the École Polytechnique following the report of\nLe Verrier\n's commission;\nMichel Chasles\n,\nJoseph Liouville\nand\nCharles-François Sturm\nalso immediately resigned in protest.\nThe Second Republic only lasted three years. On\n2\nDecember\n1851\nthere was a coup d'état with Louis-Napoléon Bonaparte assuming absolute power and dissolving the National Assembly. Exactly one year later he became Emperor taking the title Napoleon III. This was bad for Catalan who disliked the Bonapartes as much as he disliked kings. He refused to take the required oath of allegiance and as a consequence lost his job. For the next few years he lived in Paris, teaching mathematics, but without any proper employment. He had published many articles in\nLiouville\n's\nJournal de mathématiques pures et appliquées\nbut in\n1854\nhe stopped publishing there, preferring to publish in the\nComptes rendus\nof the\nAcadémie des Sciences\n. This was, almost certainly, part of Catalan's strategy to get elected to the\nAcadémie des Sciences\n. For example, he published\nSur des surfaces dont les rayons de courbure en chaque point sont égaux et de signes contraires\nⓉ\n(\nOn surfaces whose radii of curvature at each point is equal and opposite\n)\n(1855)\nwhich looks at the 'Catalan minimal surface' associated with 'Catalan's minimal curve'. He also published in\nComptes rendus\n:\nNote de M Catalan à l'occasion d'un théorème de M Serret\nⓉ\n(\nA note by M Catalan about a theorem of M Serret\n)\n(1856)\n,\nSur le calcul de la latitude par la méthode de M Babinet\nⓉ\n(\nOn the computation of latitude by the method of M Babinet\n)\n(1856)\n,\nSur quelques points de la théorie des séries\nⓉ\n(\nOn some points of the series of theory\n)\n(1856)\n,\nSur un cas particulier de la formule du binôme\nⓉ\n(\nOn a special case of the binomial theorem\n)\n(1857)\n, and\nSur la théorie des développées\nⓉ\n(\nOn the theory of developments\n)\n(1857)\n. By\n1860\nBertrand\n,\nHermite\nand\nSerret\nhad all been elected to the\nAcademy\n. When\nSerret\nwas elected in\n1860\n, Catalan was on the list to be considered but was only ranked fourth equal, behind\nSerret\n,\nBonnet\nand\nPuiseux\n. The\nAcademy\nproposed a question on polyhedra for the\n1861\nprize and Catalan submitted an entry. He was asked to submit a new version of his memoir in\n1862\nwhich was considered by a panel consisting of\nBertrand\n,\nChasles\n,\nLiouville\nand\nSerret\n.\nChasles\nand\nLiouville\nrecommended that he receive the prize, but the others proposed that the prize should not be awarded.\nThe polyhedra that Catalan discovered are now called the\nCatalan solids\n. You can see more about them at\nTHIS LINK\n.\nIn\n1859\nCatalan had tried to persuade the Ministry of Public Instruction to name him as a Professor of Mathematics at one of the lycées in Paris. He was not successful. In January\n1865\n, having had no permanent position for\n13\nyears, he was appointed to the chair of mathematics at the University of Liège. Since Catalan was born in Bruges it might be supposed that he would feel as if he was coming back to his homeland when he took up the position in Liège. However, Catalan always considered himself French, having earlier undergone considerable efforts to reinstate his French citizenship. He held this chair until he retired in\n1884\n, then continued to live in Liège until his death ten years later. However, tragedy struck Catalan's family soon after they arrived in Liège. He arrived there with his wife, two daughters, and his mother-in-law Louise Perin who had lived with the family throughout their married life in Paris. Some biographies state that Catalan also had a son who died in Paris before the family moved to Liège but we have been unable to confirm whether this is true. Marie, their eldest child, was already ill before the family moved to Liège and she died there in May\n1865\n. By the end of this year, his mother-in-law had died at the age of\n79\n, while his second daughter, Fanny, also became ill. Catalan's wife took Fanny back to Paris in the hope that this would see her health improve but it was not to be and Fanny died in the spring of\n1866\n.\nThe Franco-Prussian war of\n1870\n-\n71\ndid not affect neutral Belgium but Catalan, with his great love of France, was greatly saddened by the humiliation of the French by the Prussians. However, the resulting fall of Napoleon and the setting up of the Third Republic of France certainly gave him pleasure. Catalan had never respected the Légion d'Honneur which had been created by Napoleon Bonaparte in\n1802\n. However, when the Third Republic awarded him the Knight's Cross of the Légion d'Honneur on\n30\nDecember\n1887\n, his joy at France now being a Republic was greater than his dislike of \"Bonaparte's honour\" and he gladly accepted the honour. The\nAcadémie des Sciences\n, however, discussed at length electing Catalan during the\n1870\ns but failed to do so.\nMélanges mathématiques\nⓉ\n(\nMathematics mixtures\n)\nwas published by the Royal Society of Sciences of Liège in\n1868\n. It contains\n69\nof Catalan's papers starting from\nSur les combinaisons avec répétition\nⓉ\n(\nOn combinations with repetition\n)\n(1838)\nand ending with his paper\nDémonstration d'une formule de Poisson\nⓉ\n(\nDemonstration of a Poisson formula\n)\n(\nFebruary\n1867)\n. In\n1887\n-\n88\nan updated version of\nMélanges mathématiques\nin three volumes was published by the Royal Society of Sciences of Liège. This work contained\n299\nof Catalan's papers, the last paper being\nSur une application du théorème de Bayes, faite par Laplace\nⓉ\n(\nOn an application of Bayes' theorem made by Laplace\n)\n(\nAugust\n1888)\n. The second volume contains Catalan's retirement speech and the third volume also lists Catalan's publications; the list contains\n406\nitems.\nCatalan was elected to the\nBelgian Académie Royale des Sciences, des Lettres et des Beaux Arts\non\n15\nDecember\n1865\n. He was also elected to the Académie des Sciences de Toulouse and the Société des Sciences de Lille. He was a corresponding member of the\nSt Petersburg Academy of Sciences\n, the\nTurin Academy of Sciences\n, the\nAccademia Pontificia dei Nuovi Lincei\n, the Mathematical Society of Amsterdam, the National Institute of Geneva, the Societé Havraise d'Études Divers and the Societé d'Agriculture de la Marne. He was a member of the Science Society of Liège, the Mathematical Society of France and, as we mentioned above, the Société Philomatique of Paris. The Belgium government honoured Catalan by awarding him the Cross of the Knight of the Order of Léopold in\n1879\n. Catalan retired on\n1\nJune\n1884\n, becoming professor emeritus. His retirement was marked on\n7\nDecember of that year by a celebration attended by many of his friends\n(\nincluding\nChebyshev\nwho had come from St Petersburg especially for the occasion\n)\n, colleagues and former students. He was presented with his portrait, commissioned by some of his friends, painted by Émile Delpérée. In this portrait, Catalan is proudly wearing the Knight's Cross of the Order of Léopold. In\n1890\nthe Belgium government elevated Catalan to an Officer of the Order of Léopold.\nYou can see Catalan's speech at his retirement\nTHIS LINK\n.\nCatalan wrote several texts which were very popular and many ran into several editions. He wrote:\nElements de géométrie\nⓉ\n(\nElements of geometry\n)\n(1843)\n; the two volume work\nTraité élémentaire de géométrie descriptive\nⓉ\n(\nTreatise of elementary descriptive geometry\n)\n(1850\n-\n52)\nwhich ran to\n5\neditions with the last appearing in\n1881\n;\nThéorèmes et problèmes de géométrie élémentaire\nⓉ\n(\ntheorems and elementary geometry problems\n)\n(1852)\nwhich ran to\n6\neditions with the last appearing in\n1879\n;\nNouveau manuel des aspirants au baccalauréat ès sciences\nⓉ\n(\nNew manual of candidates for BSc\n)\n(1852)\nwhich ran to\n12\neditions;\nSolutions des problèmes de mathématique et de physique donnés à la Sorbonne dans les compositions du baccalauréat ès sciences\nⓉ\n(\nSolutions of mathematical and physical problems given at the Sorbonne in the compositions of the B.Sc.\n)\n(1855\n-\n56)\n; two volumes of\nManuel des candidats à l'École Polytechnique\nⓉ\n(\nManual for candidates to the Ecole Polytechnique\n)\n(1857\n-\n58)\n;\nNotions d'astronomie\nⓉ\n(\nAstronomy Basics\n)\n(1860)\nwhich ran to\n6\neditions;\nTraité élémentaire des séries\nⓉ\n(\nElementary treatise on series\n)\n(1860)\n;\nHistoire d'un concours\nⓉ\n(\nHistory of a contest\n)\n(1865)\nwith a second edition published in\n1867\n; and\nCours d'analyse de l'université de Liège\nⓉ\n(\nAnalysis Course of the University of Liège\n)\n(1870)\nwith a second edition published in\n1880\n.\nIn\n1894\nthe École Polytechnique planned to celebrate the centenary of its founding. Catalan, one of the oldest living former pupils, planned a final visit to Paris to take part in the celebrations. However, it was not to be. His wife became ill at the beginning of February\n1894\nthen, on\n9\nFebruary, Catalan collapsed and was taken to hospital suffering from pneumonia. His wife, Eugénie, died on\n11\nFebruary and Catalan himself died three days later.\nYou can see an appreciation of Catalan by the rector of the University of Liège at\nTHIS LINK\n."
}