{
  "nome_completo": "Eustachy Karol Żyliński",
  "nome_curto": "Eustachy Żyliński",
  "ano_nascimento": "1889",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zylinski/",
  "lugar_nascimento": "Kuna, near Haisyn, Russian Empire (now Ukraine)",
  "lugar_morte": "Łódź, Poland",
  "biografia": "Eustachy Żyliński\nwas born in Kuna, a village about\n5\nkm south west of Haisyn\n(\nor Gaysin as it was known at the time of his birth\n)\nin the Russian Empire. He was the only child of Janusz Mikolaj Żyliński\n(\nknown as Jan\n)\nand Kazimiera Zmudzinskich. Jan worked as a clerk but the family were quite poor. When he was ten years old, Eustachy entered the First\nGymnasium\nin Kiev where he studied for the next ten years. He was an outstanding pupil and, on\n7\nJune\n1907\n, he graduated from the Gymnasium with a gold medal. He then entered the Imperial University of Saint Volodymyr in Kiev where he studied in the Department of Physics and Mathematics. He graduated with a first degree from the University of Kiev in\n1911\nafter submitting his dissertation\nFoundations of the theory of ordered rational numbers\n(\nRussian\n)\n. He was awarded a silver medal for outstanding work for the essay\nRecent developments in the theory of ideals\n(\nRussian\n)\n, submitted as a competition entry to the Department of Physics and Mathematics. He had been taught at the University of Kiev by\nDmitry Aleksandrovich Grave\nwho published\nElementary course in number theory\n(1909\n-\n10)\n. In his memoirs,\nGrave\nacknowledges Żyliński's help with this first edition of his book.\nIn\n1912\nŻyliński was awarded a\n4\n-year scholarship to fund his studies abroad so that he could undertake research with the aim of becoming a professor of mathematics. He spent the year\n1912\n-\n13\nat the University of Göttingen, in Germany, studying under\nEdmund Landau\n. He published\nZur Theorie der ausserwesentlichen Diskriminantenteiler algebraischer Körper\nⓉ\n(\nOn the theory of the exceptional discriminant in algebraic fields\n)\nin\nMathematische Annalen\nin\n1913\n, submitted in July\n1912\nwhile he was visiting Göttingen. In this paper he extended results published earlier by\nKurt Hensel\n. He then went to the University of Marburg where he studied with\nHensel\nand finally he spent time at the University of Cambridge in England where he studied with\nG H Hardy\n. In\n1914\nhe was awarded his Master's Degree\n(\nequivalent to a Ph.D.\n)\nby the University of Saint Volodymyr in Kiev after taking examinations in algebra and number theory, and defending his thesis\nOn the domain of p-adic numbers\n. In addition to his foreign visits, Żyliński participated in\nGrave\n's seminar in Kiev during the period\n1912\n-\n1916\n. In April\n1916\nhe was drafted into the Russian army and, for the first few months, completed his engineering degree at the Engineering School in Kiev. In September\n1916\nhe was sent to St Petersburg where he attended the Electrotechnical University. He took various courses there, passing examinations on the internal combustion engine on\n6\nOctober\n1916\n, on electrical engineering on\n22\nNovember\n1916\n, and on telegraphy on\n6\nFebruary\n1917\n. He was promoted to second lieutenant at the time of unrest which began in St Petersburg near the end of February and led eventually to the Russian Revolution. He served in Berdichev and Kamianets-Podilskyi, lecturing on electrical topics, at the time when the Russian Empire was collapsing and Ukraine was seeking independence.\nżyliński's military service ended in November\n1917\nand, shortly afterwards, he was appointed as an assistant professor of mathematics at the Polish College of the University of Kiev. This was the beginning of a short period of independence for Ukraine with Kiev as the capital of the Ukrainian People's Republic. In addition to teaching analytic geometry, set theory and higher algebra at the Polish College, he also taught at the Ukrainian State University and at the Higher Technical Institute. While in Kiev he had volunteered to serve in the\n1\nst\nPolish Corps and, in February\n1919\n, he went to Warsaw where he served for a few months as an officer in the Polish army. His duties were as a lecturer teaching electrical topics at the Military School. He was offered a position at the Ukrainian State University in Kamianets-Podilskyi but turned this down in favour of a position at the Jan Kazimierz University of Lwów\n(\nnow Lviv in Ukraine\n)\n. After\n120\nyears of partition, Poland had become an independent country following World War I and the Polish government had named the University after Jan Kazimierz in November\n1919\n. It was the third largest Polish university after Warsaw and Kraków. Żyliński took up his appointment as associate professor of mathematics at the University of Lwów on\n1\nOctober, having been released from the army in the previous month at the request of the University of Lwów.\nThe position in Lwów became vacant following the death of Józefa Puzyny\n(1856\n-\n1919)\nand the departure of\nWacław Sierpiński\nfollowing his move from Lwów to Warsaw. Żyliński became a colleague of\nHugo Steinhaus\nand soon they were joined in Lwów by\nStefan Banach\nwho was an assistant at the Lwów Technical University from\n1920\n. Banach\nhabilitated\nat the Jan Kazimierz University of Lwów in\n1922\n. On\n27\nJuly of that year Żyliński was appointed as a full professor of mathematics at the Jan Kazimierz University. Herman Auerbach\n(1901\n-\n1942)\nwas appointed as his assistant in\n1923\n. During these years in Lwów, he had been living with his mother. However, in\n1925\nhe made a home of his own when he married Kazimiera Ramlau\n(1900\n-\n1976)\non\n16\nApril. Kazimiera's parents, Aleksander Ramlau and Zofia Kepinska. had both died in\n1904\nwhen she was only three years old.\nEustachy and Kazimiera had two children, a daughter Maria\n(1926\n-\n1990)\nand a son Janusz\n(1931\n-\n)\n.\nMark Kac\n, who began his studies of mathematics in Lwów in September\n1931\n, describes Żyliński as a lecturer\n[\n1\n]\n:-\nThe first lecture, which I attended was in theoretical arithmetic. This course was designed to introduce in rigorous, axiomatic way the number system. It started with the famed axioms of\nGiuseppe Peano\nfor non-negative integers and ended with irrational numbers. This was my first encounter with abstract mathematics and I took to it like a duck to water. In fact I was so good at it that the professor who taught the course, Eustachy Żyliński, asked me to help in preparing lecture notes which were mimeographed and, I believe, sold. I was so pleased to have been thus singled out that I failed to notice that no remuneration was offered for what had been a considerable amount of work. My name, however, did appear on the title page, though less prominently than the name of the professor, who had done almost no work at all. Concurrently, I attended a proseminar on algebra and number theory. It was very loosely connected to the course in theoretical arithmetic and it was under the nominal supervision of Żyliński. It was run, however, by\nMarcel Stark\n, a junior assistant at the Mathematical Institute.\nKac\nalso describes a rather unusual mechanics examination by Żyliński\n[\n1\n]\n:-\nIt is curious that I drew Żyliński as an examiner four out of five times. The a priori probability of this happening is a little less than\n1\n.\n5\npercent, small enough to cause one to raise one's statistical eyebrows. Żyliński was very polite to me, and when I arrived at his office for the oral examination in mechanics, he looked up at me from some work, which he pored over, and said, \"Oh, it's you. You have an A.\" When I said: \"But won't you ask me at least one question?\" He said, \"Very well. Can you tell me what is the\nSchrödinger\nequation?\" I said: \"I don't know,\" and then he said: \"All right. You still have an A\". The\nSchrödinger\nequation is the fundamental equation of\n(\nnon-relativistic\n)\nquantum mechanics, which was not part of the syllabus, and I am quite sure that Żyliński himself didn't know the\nSchrödinger\nequation.\nHowever,\nKac\nmakes a rather unfriendly comment when explaining that he needed support for an application for a fellowship. He wrote:-\nTo have a chance at all, I needed a strong recommendation.\nStark\nwouldn't do because he was too junior, and I didn't quite trust Żyliński.\nWorld War II meant that the University of Lwów, and all its staff, went through incredibly difficult times. At the start of World War II in\n1939\n, Russia and Germany had a pact, the so-called Ribbentrop-Molotov pact, to divide Poland between them. The two-pronged attack, the Germans from the west and the Russians from the east, quickly defeated the Polish army and Lwów was taken over by the Soviet Union. Although it was now under Soviet control, the university attempted to continue to operate as normally as possible despite many arrests and deportations carried out by the occupiers. This was not easy for, in the period from September\n1939\nto June\n1941\n, the Soviets murdered over a dozen of the Jan Kazimierz University faculty. Żyliński was called up as an army reservist in the summer of\n1939\nand at that time his wife, together with their children, left Lwów and went to live in her home town of Szczytniki; they did not return to Lwów until\n1943\n. Żyliński was in Lwów when the Soviets attacked in September\n1939\n. He became head of the Department of Algebra in December\n1939\nand survived with difficulty in this role until June\n1941\n. At this time everything changed for in June\n1941\nGermany attacked its former ally, the Soviet Union. On\n1\nJuly\n1941\nGerman troops entered Lwów and on the following day\n36\nprofessors who had worked at the university were arrested. All but one of the professors were shot by the Germans; the university could no longer operate and was closed. Żyliński worked as a statistician in the transport office during the German occupation but, although the Jan Kazimierz University of Lwów was officially closed, secret teaching was organised by a number of the former staff.\nWładysław Orlicz\nand Żyliński were the main mathematics teachers at this underground university. In August\n1944\n, the Soviets took control of Lwów again and, at this time, they opened the State University of Lwów with Żyliński as head of the Department of Algebra and Number Theory.\nAs the war entered its final stages, it was clear that Lwów would not remain part of Poland when treaties were drawn up. In August\n1945\nit was announced that Lwów would become part of the USSR and Żyliński, together with\nStanisław Mazur\nwho was also teaching in Lwów, signed up for voluntary repatriation to Poland. In May\n1946\nŻyliński, together with his wife and children, left Lwów and travelled to Łódź. He worked for the Ministry of Foreign Affairs for a while, being appointed as consul to Kiev, but he resigned this position. From\n1\nOctober\n1946\nuntil he retired on\n30\nSeptember\n1951\nŻyliński was a professor and head of the Department of Mathematics, Engineering and Construction at the Silesian University of Technology in Gliwice. He lived at the University of Gliwice while working there, but retained a permanent home in Łódź. After he retired he continued to live in Łódź but seems to have given up mathematics. His health deteriorated and he suffered a series of strokes. He died in the Barlickiego Hospital after suffering his third stroke. He was buried in the St Joseph Roman Catholic Cemetery in Łódź. His wife Kazimiera continued to live in Łódź with their daughter Maria who did not marry. Kazimiera died in\n1963\nand was buried beside her husband.\nConcerning Żyliński's mathematical contributions, Lech Maligranda writes in\n[\n3\n]\n:-\nEustachy Żyliński worked in number theory, algebra, logic and foundations of mathematics. He has written over\n20\nscientific papers and\n6\ntextbooks.\nThese textbooks are\n(\nall in Polish\n)\n:\n(\nwith\nStanisław Ruziewicz\n)\nAlgebra: handbook for the higher classes of secondary schools\n(1926)\n;\n(\nwith\nStanisław Ruziewicz\n)\nAlgebra: handbook for the higher classes of middle schools\n(1926)\n;\n(\nwith\nStanisław Ruziewicz\n)\nIntroduction to Mathematics, Algebra\nI\n(1927)\n;\n(\nwith\nStanisław Ruziewicz\n)\nAlgebra: handbook for the higher classes of secondary schools\n(1928)\n;\nIntroduction to arithmetic theory\n(1932)\n; and\nAnalytical Geometry\n(1938)\n.\nMarcelli Stark\nentered the Jan Kazimierz University of Lwów as an undergraduate in\n1926\n. He later became an assistant at the university and a colleague of Żyliński. He was much influenced by Żyliński's courses on Analytical Geometry, assisting in their teaching, and published\nAnalytic Geometry with Particular Regard to the Textbook of Eustachy Żyliński\nin\n1951\n. Further editions of this popular text appeared in\n1958\n,\n1967\n,\n1970\n(\nenlarged\n)\n,\n1972\nand\n1974\n. Vaclav Hlavaty writes in a review of the\n1951\nedition:-\nThis textbook deals with metric, affine and projective geometry of linear and quadratic varieties in the plane as well as in the three-space. The author does not confine himself only to real plane\n(\nreal space\n)\nbut considers also the complex plane\n(\ncomplex space\n)\n. Besides items usually dealt with in textbooks of elementary analytic geometry the reader finds here the introduction to synthetic projective geometry, to the theory of matrices\n(\nand\ndeterminants\n)\nwith the usual applications and to the\n(\nthree-dimensional\n)\nelementary vector calculus.\nFinally let us note Żyliński's interests outside mathematics. He enjoyed hunting, played tennis, skied and was also a bridge player."
}