{
  "nome_completo": "Evgenii Yakovlevich Khruslov",
  "nome_curto": "Evgenii Yakovlevich Khruslov",
  "ano_nascimento": "1937",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Khruslov/",
  "lugar_nascimento": "Kharkov, Ukraine",
  "lugar_morte": null,
  "biografia": "Evgenii Yakovlevich Khruslov\nwas born in the Ivanivka district of Kharkov\n(\nnow usually written as Kharkiv\n)\n. His father Yakov Khruslov was working class but life changed dramatically for the family with the outbreak of World War II. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Ukraine. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. Evgenii's father, Yakov Khruslov, was called to serve in the Red Army. Kharkov was soon threatened by the advancing German armies and the city was captured by the Germans on\n24\nOctober\n1941\n. The city remained close to the front and was fought over for a long time. In the summer of\n1942\nthe Soviets attempted to retake the city but, after much fighting, failed in their objective.  A third battle of Kharkov in February\n1943\nsaw the German invaders repulsed. The city had a population of around\n1\nmillion when the war began but by the time of its liberation in\n1943\nonly about one fifth of the population survived.\nWhat happened to Evgenii and his family through this period? His father was presumed killed while serving in the Red Army and Evgenii was brought up by his mother. She managed to survive the war through a combination of skill, luck, and help from friends and relatives. There was little food to be had in the city and thousands died from hunger. Evgenii's mother managed to escape with her son from the city into the countryside where some of her relatives lived. However, the people in this tiny community supplied food to some of those who were resisting the German occupation and fighting a guerrilla action. Learning of this, the Germans burnt down all the homes in the tiny village leaving Evgenii and his mother, and others, alive but with no protection from the weather. They returned to their home in Kharkov which had suffered some damage in the fighting and had large cracks in the walls. Evgenii managed to find some old maps printed on strong paper which they used to fill cracks. At one point a German soldier saw Evgenii with his mother and threaten to kill the boy believing that he was helping the Soviet resistance movement. The German soldier threatened him with a gun and told him to confess. Fortunately they were able to convince the German that they meant no harm and their lives were spared.\nAfter these years of terror, life improved for Khruslov when he began his schooling on\n1\nSeptember\n1944\n. He graduated from high school in\n1954\n, having been awarded a silver medal, and he had the obtained the necessary level to enter a university without taking further examinations. He loved mathematics and physics but since the young man liked airplanes, he dreamed of a profession in aviation, so completed the necessary documents to enter the Kharkov Aviation Institute. However, his wish to have a career in aviation were soon dashed. There was a compulsory medical examination at the end of the introductory course and only those with\n20\n-\n20\nvision were allowed to continue. Khruslov's eyesight was not perfect, so he failed the medical examination and was forced to look for another higher education Institution. The first institution that he found that would accept him was the Kharkov Polytechnic Institute and, more by chance than design, he enrolled in the Faculty of Electrical Engineering at this Polytechnic Institute. He graduated from the Kharkov Polytechnic Institute in\n1959\nand took a job as an engineer at the industrial Tyazhpromelectroproject Institute. This was the Ukrainian State Project and Project Construction Institute which developed electrotechnical equipment. He was sent to the city of Kryvyi Rih in central Ukraine where he worked on the commissioning of a new steel mill at the Krivorozhstal plant. This was an integrated steel plant which took in iron ore and carbon, and did all the necessary processing to produce completed steel products. In the evenings he would study to increase his knowledge, partly to improve his ability to carry out his job, but perhaps more just out of curiosity to learn new things.\nMathematics was one of the topics that had fascinated Khruslov ever since his days at school. When at the Tyazhpromelectroproject Institute, he began to read advanced mathematics texts and one of his colleagues, the senior laboratory engineer Gleb D Klyagin, saw him reading mathematics texts and was curious. Klyagin had been very interested in mathematics and had kept up his friendship with\nVladimir Aleksandrovich Marchenko\n- the two boys had been at school together. He had noticed that Khruslov's colleagues always asked for his help when they had a mathematical problem to solve so Klyagin approached Khruslov and offered to introduce him to\nMarchenko\nwhom he described as \"a real mathematician\". The meeting went ahead and this marked the beginning of a life-long friendship between Khruslov and\nMarchenko\n. Shortly before their first meeting,\nMarchenko\nhad been approached by Leonid Shubenko-Shubin the chief designer at the Kharkov Turbine Plant\n(\nnow \"Turboatom\"\n)\nasking for help in solving an applied mathematics problem concerning optimising steam turbine blades. Realising that Khruslov was a skilled engineer,\nMarchenko\nexplained the problem to him. Despite the fact that Khruslov did not have a solid background in mathematics at this time, he was able to make good progress with the problem in under a week using an unconventional approach.\nMarchenko\n, amazed at how quickly and how deeply Khruslov had penetrated into the problem and, realising what potential he had, suggested to him that he study for a Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nat the at the Institute for Low Temperature Physics and Engineering.\nMarchenko\n, who had just been appointed as head of that Institute, offered to be his thesis advisor. Although Khruslov had large gaps in his mathematical knowledge,\nMarchenko\npersuaded him that these could be quickly filled if he was working with mathematicians. Alexander Smirnov sees the route that took Khruslov to mathematics being an excellent example of the saying\n(\nby\nYuri Ivanovich Manin\n)\n[\n4\n]\n:-\nWe do not choose mathematics, it is mathematics that chooses us.\nThe Tyazhpromelectroproject did not want to lose their excellent engineer Khruslov but they released him from his duties so that he could study at the Institute for Low Temperature Physics and Engineering. In\n1961\nKhruslov began research at the Institute working on problems suggested by\nMarchenko\n. In\n1964\nKhruslov and his advisor published the joint paper\nBoundary value problems with fine-grained boundary\nin the journal\nMathematics Miscellany\n. In\n1965\nKhruslov was awarded a Candidate's Degree for the innovative work on differential equations in his thesis\nDirichlet boundary value problems in domains with fine-grained boundary for self-adjoint elliptic operators\n. He continued to work at the Institute for Low Temperature Physics and Engineering after the award of his Candidate's Degree.\nIn\n1972\nhe defended his doctoral thesis\n(\nequivalent to a D.Sc. or\nhabilitation\nin standard\n)\nBoundary-value problems in domains with fine-grained boundary\n. In\n1974\n, in a joint publication with\nVladimir Marchenko\n, he published a Russian book with the same title as his thesis. Here is the publisher's description of that book:-\nDifferent processes that go on in media with heterogeneous intrusions are described by the solutions of elliptic boundary value problems with various boundary conditions on the boundaries of these intrusions. When the number of intrusions is large, the domains in which such boundary value problems are posed have an extremely complex structure and even with the use of numerical methods it is practically impossible to find their solutions. So the question of how and under what conditions one can reduce problems of this type to significantly simpler problems for a homogeneous medium and find equations describing them is of great importance. In this monograph the authors develop a general mathematical theory giving an answer to this question and covering a large number of concrete problems. As an illustration the authors consider its applications to some problems of radiophysics, acoustics, elasticity theory and fluid mechanics.\nThe authors of\n[\n2\n]\nwrite:-\nThis book has received wide acclaim among both mathematicians and physicists.\nIn\n2005\nthe same two authors published\nHomogenization of partial differential equations\n(\nRussian\n)\n. An English translation appeared one year later. This book was reviewed by I Aganovic who begins the review as follows:-\nThe authors of this book are among the pioneers in homogenization theory: they considered differential equations in perforated domains in the early\n1960\ns and their monograph 'Boundary value problems in domains with a fine-grained boundary'\n(\nRussian\n)\nwas the first integral text on the subject. In the present book the authors study the problems in microhomogeneous media leading to \"nonstandard\" macroscopic models. The methods and results are along the lines of the monograph cited above. The approach is more general than those represented in other widely known books on homogenization and is applicable to very singular cases.\nTypical of Khruslov's work on fluid flow is his paper\n(\nwith V A L'vov\n)\nPerturbation of a viscous incompressible fluid by small particles\n(\nRussian\n)\n(1978)\n. Here is the authors' own summary:-\nWe consider a boundary value problem for a system of\nNavier\n-\nStokes\nequations describing the flow of a viscous incompressible fluid around a large number of small particles with random distribution of their coordinates and velocities. We study the asymptotic behaviour of the velocity vector of the fluid when the number of particles increases without limit, and their diameters tend to zero. We obtain equations describing the 'averaged' motion of a perturbed fluid.\nIn\n1986\nKhruslov was appointed head of the Department of Mathematical Modelling of Physical Processes at the Institute for Low Temperature Physics and Engineering. In\n1996\nhe became the Director of the Mathematical Department at the Institute of Low Temperature Physics. This was a difficult time to take on such a role. In December\n1991\nUkraine had voted to become an independent state. This marked the end of an era and led to a new freedom of movement. Top Ukrainian scientists were offered inducements to work in other countries. This presented Khruslov with problems as a number of top researchers from his Institute left the country\n[\n3\n]\n:-\nAt that time, many were very sceptical about the possibility of the development of fundamental science and particularly mathematics in the country. But Khruslov was always an optimist - not only by his words but, first and foremost, by working hard on getting talented young people into research work ... A distinctive feature of Khruslov's approach is that he promotes the disciples of his colleagues with the same energy as he does his own pupils.\nKhruslov did not just work at the Institute for Low Temperature Physics and Engineering for he also has been giving lectures on various topics at the Kharkov National University where he has supervised a number of PhD students. He takes all his duties very seriously often preferring to undertake a task himself rather than to delegate. The authors of\n[\n3\n]\nwrite:-\nHe is always perfectly kind and frank with people, ready to provide help, and involuntarily inspires people with his optimism.\nAlexander Smirnov writes\n[\n4\n]\n:-\nPeople who know Khruslov, speak of his kindness, his modesty, his naturalness, and his willingness to share his knowledge and to help other.\nKhruslov has been honoured in several different ways. He received the State Award of Ukraine in\n1989\n, and the\nA N Krylov\naward from the\nNational Academy of Sciences of Ukraine\nin\n1996\n. He was elected as a Corresponding Member of the\nNational Academy of Sciences of Ukraine\nin\n1993\nand became a full member of the Academy in\n2003\n. He had received the medal of honour from the Academy in\n1986\n. He has been invited to address a number of major conferences, for example the 'Composite media and homogenization theory' conference in Trieste in\n1990\n, the 'International Conference on Mathematical Physics' in Paris in\n1994\nand the 'International Congress of Mathematicians' in Zürich in the same year.\nOutside mathematics, Khruslov's main hobby is sport. When he was a student, the sport which interested him most was wrestling. Later in life, he often spent his summer holidays in a small company of his colleagues enjoying canoeing on small rivers both in Ukraine and in Russia. On these trips he was an excellent companion, always ready to help others, being patient with those less skilled than he was, and always being in a cheerful mood. He also enjoyed winter sports, his favourite being skiing  which he approached with real passion."
}