{
  "nome_completo": "Felix Hausdorff",
  "nome_curto": "Felix Hausdorff",
  "ano_nascimento": "1868",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hausdorff/",
  "lugar_nascimento": "Breslau, Prussia (now Wrocław, Poland)",
  "lugar_morte": "Bonn, Germany",
  "biografia": "Felix Hausdorff\n's father was Louis Hausdorff, who was a merchant dealing in textiles, and his mother was Hedwig Tietz; both were Jewish. Felix was born into a wealthy family and this had quite an influence on his life and career since he never had the problem of having to work to support himself financially. Felix was still a young boy when the family moved from Breslau to Leipzig, and it was in Leipzig that he grew up. At school he had wide interests and, in addition to mathematics, he was attracted to literature and music. In fact he wanted to pursue a career in music as a composer but his parents put pressure on him to give up the idea of becoming a composer. They achieved this, but only after quite an effort for Felix had his heart set on the idea, and after this he turned towards mathematics as the subject to study at university.\nHausdorff studied at Leipzig University under\nHeinrich Bruns\nand\nAdolph Mayer\n, graduating in\n1891\nwith a doctorate in applications of mathematics to astronomy. His thesis was titled\nZur Theorie der astronomischen Strahlenbrechung\nⓉ\n(\nOn the theory of astronomical refraction\n)\nand studied refraction and extinction of light in the atmosphere. He published four papers on astronomy and optics over the next few years and he submitted his\nhabilitation\nthesis to Leipzig in\n1895\n, also based on his research into astronomy and optics. His methods were based on those of\nBruns\nwho had developed his own method of determining refraction and extinction, based on an idea of\nBessel\n.\nHowever Hausdorff's main interests were in literature and philosophy and his circle of friends consisted almost entirely of writers and artists, such as the composer Max Reger, rather than scientists. He also seemed keen to make a name for himself in the world of literature, more so than in the world of mathematics, and he published his literary work under the pseudonym of Paul Mongré. In\n1897\nhe published his first literary work\nSant' Ilario: Thoughts from Zarathustra's Country\nwhich was a work of\n378\npages. He published a philosophy book\nDas Chaos in kosmischer Auslese\nⓉ\n(\nThe chaos in cosmic selection\n)\n(1898)\nwhich is a critique of metaphysics contrasting the empirical with the transcendental world that he rejected. His next major literary work was a book of poem\nEkstases\nⓉ\n(\nEcstasy\n)\n(1900)\nwhich deals with nature, life, death and erotic passion, and in addition he wrote many articles on philosophy and literature. As Segal writes in\n[\n6\n]\n:-\nAs the child of a wealthy family, he did not have to worry about making a career as a mathematician; for him, mathematics, both as research and as a subject to teach, was more an avocation than anything else.\nHausdorff married Charlotte Sara Goldschmidt in Leipzig in\n1899\n. Charlotte and her sister Edith were from Jewish parents but had converted to Lutheranism. Although still a\nPrivatdozent\n, Hausdorff was well off, so marriage at this stage in his career presented no financial difficulties. In\n1902\nhe was promoted to an extraordinary professorship of mathematics at Leipzig and turned down the offer of a similar appointment at Göttingen. This clearly indicates that at this time Hausdorff was keener to remain in his literary and artistic circle in Leipzig than he was to progress his career in mathematics. He continued his literary interests and in\n1904\npublished a farce\nDer Arzt seiner Ehre\nⓉ\n(\nIn honour of the doctor\n)\n. In many ways this marked the end of his literary interests but this farce was performed in\n1912\nand was very successful.\nAfter\n1904\nHausdorff began working in the area for which he is famous, namely\ntopology\nand set theory. He introduced the concept of a partially ordered set and from\n1901\nto\n1909\nhe proved a series of results on ordered sets. In\n1907\nhe introduced special types of ordinals in an attempt to prove\nCantor\n's\ncontinuum hypothesis\n. He also posed a generalisation of the continuum hypothesis by asking if\n2\nto the power\nℵ\na\n\\aleph _{a}\nℵ\na\n​\nwas equal to\nℵ\na\n+\n1\n\\aleph _{a+1}\nℵ\na\n+\n1\n​\n. Hausdorff proved further results on the cardinality of\nBorel\nsets in\n1916\n.\nHausdorff taught at Leipzig until\n1910\nwhen he went to Bonn. It was\nStudy\nwho in many ways motivated Hausdorff to become more involved in both mathematical research and also in developing his career in mathematics. Partly the lack of mathematical drive in his early career had been due to his extreme modesty, so his friendship with\nStudy\nwas an important factor in turning him towards important problems and his subsequent rise to fame. Having encouraged Hausdorff to move to Bonn,\nStudy\nencouraged him to move again in\n1913\n, this time to become an ordinary professorship at Greifswald. A year later, in\n1914\n, Hausdorff published his famous text\nGrundzüge der Mengenlehre\nⓉ\n(\nGeneral set theory\n)\nwhich builds on work by\nFréchet\nand others to created a theory of topological and metric spaces. Earlier results on topology fitted naturally into the framework set up by Hausdorff as Katetov explains in\n[\n1\n]\n:-\n[\nHausdorff's\n]\nbroad approach, his aesthetic feeling, and his sense of balance may have played a substantial part. He succeeded in creating a theory of topological and metric spaces into which the previous results fitted well, and he enriched it with many new notions and theorems. From the modern point of view, the Grundzüge contained, in addition to other special topics, the beginnings of the theories of topological and metric spaces, which are now included in all textbooks on the subject.\nThe\nGrundzüge\nⓉ\n(\nGeneral set theory\n)\nwas republished in revised form in\n1927\nand\n1937\n. The\n1914\nedition was reprinted in\n1949\nand\n1965\nby Chelsea, the\n1927\nedition was published in\n1937\nin Russian, and the\n1937\nedition was translated into English and also published by Chelsea in\n1957\n.\nHausdorff returned to Bonn in\n1921\n, by this time an eminent mathematician, and he worked there until\n1935\nwhen he was forced to retire by the Nazi regime. Although as early as\n1932\nhe sensed the oncoming calamity of Nazism he made no attempt to emigrate while it was still possible. He swore the necessary oath to Hitler in November\n1934\nbut by the following January a new law forced him to give up his position. He continued to undertake research in topology and set theory but the results could not be published in Germany. Certainly he wanted to continue research and wished to emigrate for in\n1939\nhe wrote to Courant asking if he could find a research fellowship for him. Sadly Courant could not do so.\nAs a Jew his position became more and more difficult. In\n1941\nhe was scheduled to go to an internment camp but managed to avoid being sent. Erich Bessel-Hagen, the only colleague from Bonn who kept in touch with Hausdorff after his forced retirement, wrote in a letter to a friend in the summer of\n1941\n(\nsee\n[\n24\n]\nand\n[\n6\n]\n)\n:-\nI often had great anxiety about the Hausdorffs. Mrs Hausdorff was for a long time seriously ill from an old ailment - I don't know what it is. Scarcely was she over the worst than there came the agitation about the intended internment of the Jews. Here the procedure was mad. In the early part of the year, old nuns were forcibly driven out of a cloister on the Kreuzberg; these poor old women who never harmed anyone and only carried on a retiring life devoted to their pious usages ... Now all Jews still living in Bonn will be compulsorily interned in this stolen building; they must either auction their things, or place them for preservation in \"faithful\" hands.\nBonn University requested that the Hausdorffs be allowed to remain in their home and this was granted. By October\n1941\nthey were forced to wear the \"yellow star\" and around the end of the year they were informed that they would be sent to Cologne. Bessel-Hagen wrote that he knew this was\n(\nsee\n[\n24\n]\nand\n[\n6\n]\n)\n:-\n... a preliminary to deportation to Poland. And what one hears concerning the accommodation and treatment of Jews there is completely unimaginable.\nThey were not sent to Cologne but in January\n1942\nthey were informed that they were to be interned in Endenich. Together with his wife and his wife's sister, he committed suicide on\n26\nJanuary. He wrote to a friend on Sunday\n25\nJanuary\n(\nsee\n[\n24\n]\nand\n[\n6\n]\n)\n:-\nDear Friend Wollstein\nBy the time you receive these lines, we three will have solved the problem in another way - in the way which you have continually attempted to dissuade us. ...\nWhat has been done against the Jews in recent months arouses well-founded anxiety that we will no longer be allowed to experience a bearable situation. ...\nForgive us, that we still cause you trouble beyond death; I am convinced that you will do what you are able to do\n(\nand which perhaps is not very much\n)\n. Forgive us also our desertion! We wish you and all our friends will experience better times\nYours faithfully\nFelix Hausdorff\nOn the night of Sunday\n25\nJanuary all three took barbiturates. Both Hausdorff and his wife Charlotte were dead by the morning of the\n26\nJanuary. Edith, Charlotte's sister, survived for a few days in a coma before dying.\nWe have mentioned above Hausdorff's early work on astronomy, his work on philosophy, and his literature. We also mentioned his work on ordered sets and his masterpiece on set theory and topology\nGrundzüge der Mengenlehre\nⓉ\n(\nGeneral set theory\n)\n(1914)\n. Let us add that one famous paradoxical result, namely that half a sphere and one third of a sphere can be congruent to each other, is contained in this work\n(\nsee\n[\n28\n]\nfor details\n)\n. Let us now examine other important contributions made by Hausdorff. In\n1919\nhe introduced the notion of Hausdorff dimension in the seminal paper\nDimension und äusseres Mass\nⓉ\n(\nDimension and outer measure\n)\n. The idea was a generalisation of one which had been introduced five years earlier by\nCarathéodory\nbut Hausdorff realised that\nCarathéodory\n's construction made sense, and was useful, for defining fractional dimensions. Hausdorff's paper includes a proof that the dimension of the middle-third\nCantor\nset is log\n2\n/log\n3\n. Chatterji writes\n[\n10\n]\n:-\nWithin the mathematical work of Hausdorff the two publications devoted explicitly to measure theory occupy a significant place: they are not only important for\nmeasure theory\nbut have also contributed fundamentally to its development. It is not well known that throughout his life Hausdorff had been interested in various fundamental problems of measure and integration theory and had made important contributions at different times. This becomes quite evident if one studies his lecture notes and other Nachlass papers.\nOne such lecture course was given on\nprobability theory\nby Hausdorff in Bonn in the summer of\n1923\n. He studied the Gaussian law of errors, limit theorems and problems of moments, and set theory and the strong law of large numbers, which he based on measure theory."
}