{
  "nome_completo": "Feodor Theilheimer",
  "nome_curto": "Feodor Theilheimer",
  "ano_nascimento": "1909",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theilheimer/",
  "lugar_nascimento": "Gunzenhausen, Germany",
  "lugar_morte": "Chevy Chase, Montgomery County, Maryland, USA",
  "biografia": "Feodor Theilheimer\n's parents were Gustav Theilheimer\n(\nborn on\n25\nMarch\n1866\nin Dittenheim, died on\n8\nMarch\n1933)\nand Rosa Waldmann\n(\nborn on\n26\nDecember\n1869\nin Dittenheim, died on\n8\nNovember\n1929)\n. We note that Dittenheim is a village about\n5\nkm south of Gunzenhausen. Gustav, the son of Raphael Löw Theilheimer and Therese Bauer, and Rosa, the daughter of Veiss Nathan Waldmann and Regina Steiner, were married on\n18\nAugust\n1898\n. Gustav Theilheimer was a cattle dealer and also bought hops. Gustav's parents had bought a house at\n15\nBrunnenstrasse in Gunzenhausen in\n1885\nand Gustav moved into it before his marriage in\n1898\n. The family were Jewish which, of course, played a very significant part in their future after the Nazis came to power in\n1933\n.\nGustav and Rosa Theilheimer had six children, all born in the house on Brunnenstrasse. These were Thekla\n(\nborn\n19\nMay\n1899)\n, Regina\n(\nborn\n26\nMay\n1901\nbut died when one year old\n)\n, Bella\n(\nborn\n3\nNovember\n1902)\n, Hedwig\n(\nborn\n4\nJanuary\n1904)\n, Richard\n(\nborn\n30\nMarch\n1905)\n, and Feodor\n(\nthe subject of this biography, born\n18\nJune\n1909)\n. Before we give a biography of Feodor, we give some details of what happened to his four siblings who survived to adulthood. As Jews they were all forced to leave Germany in the\n1930\ns. Thekla married Bernhard Gutmann in\n1926\nand they emigrated to Argentina in early\n1938\nwhere they remained. Bella married Max Stoll in\n1935\nand they left Germany in\n1939\nmaking their way via England to Denver, Colorado in the United States. Hedwig emigrated to London, England in\n1937\nand remained there until the war ended when she emigrated to Denver, Colorado, United States where, in\n1948\n, she married Berthold Maier. Richard emigrated to New York City in\n1935\nwhere he married Charlotte Strauss in\n1937\n.\nFeodor Theilheimer began his education in a one-room Jewish school in Gunzenhausen. There were about thirty children of different ages all being educated in the one room but they were divided into different classes. Feodor found the material taught to his class too trivial and preferred to listen to the lessons that were being taught to the older children. In\n1919\n, after four years at this school, he entered the Realschule in Gunzenhausen studying there until\n1925\nwhen he was sixteen years old. This school was non-sectarian and had an entrance examination but this was not a challenge to Theilheimer. At this school Jews, Protestants and Catholics were all given separate religious instruction. Theilheimer was given religious instruction by Hauptlehrer Marx who had taught him in the Jewish school.\nIn order to attend a university a student had to spend three years studying at either a\nGymnasium\nor at an Oberrealschule. However, Gunzenhausen did not have either of these schools so Theilheimer went to Nuremberg in\n1925\nto spend three years studying at the Oberrealschule there. Graduating from the Oberrealschule in\n1928\n, he went to Lithuania to study at the Telshe Yeshiva in Telsiai. This rabbinical college was at that time under the leadership of Rabbi Yosef Leib Bloch. After three years in Telsiai, he returned to Germany in\n1931\nto attend the Hildesheimer Rabbiner Seminar in Berlin. This seminary, founded in\n1873\n, trained rabbis in the tradition of Orthodox Judaism. Theilheimer only spent one year at this seminary before entering the Friedrich-Wilhelm University of Berlin in\n1932\nto study mathematics. In\n1933\nTheilheimer's father died, his mother having died five years earlier and, with his siblings Thekla, Bella, Hedwig, and Richard, he continued to treat half of the house at\n15\nBrunnenstrasse as his home.\nAmong the mathematicians at Berlin when Theilheimer was studying there were\nLudwig Bieberbach\n,\nAlfred Brauer\n,\nGeorg Feigl\n,\nErhard Schmidt\n,\nRichard von Mises\n, and\nIssai Schur\n. Theilheimer entered the university before the Nazis came to power in January\n1933\nbut once the Nazis took over the government things became exceptionally difficult both for Jewish professors and for Jewish students. On\n1\nApril\n1933\n, on 'Boycott Day', posters carried the message 'Germans defend yourselves against Jewish atrocity propaganda: buy only at German shops'. Jewish shops were boycotted and Jewish professors and lecturers were not allowed to enter the university. On\n7\nApril\n1933\nthe Nazis passed a law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent, with exemptions for participants in World War I and pre-war officials. Despite\nSchur\nsatisfying the exemption conditions, his lectures were cancelled and there was an outcry among the students and professors, for\nSchur\nwas respected and very well liked.\nTheilheimer was able to continue to study at Berlin, mainly taking courses by\nSchur\nand\nSchmidt\n, and undertook research on invariant theory for his doctorate advised by\nIssai Schur\n. In\n1935\nSchur\nwas dismissed from his chair in Berlin but he continued to work there suffering great hardship and difficulties. Despite this humiliating situation for\nSchur\nand his student, Theilheimer submitted his thesis\nEin Beitrag zur Theorie der charakteristischen Invarianten\nⓉ\n(\nA contribution to the theory of characteristic invariants\n)\nand was awarded his doctorate in\n1936\n. His diploma certificate contains the remark:-\nAdmitted as a non-Aryan within the percentage according to decree U I\n1331\n.\nHe became\nSchur\n's last Ph.D. student. We note that the thesis was published in\nMathematische Zeitschrift\nin\n1936\n. In that paper Theilheimer writes:-\nThis work was accepted by the Philosophy Faculty of the Friedrich-Wilhelm University of Berlin as a dissertation.\nHowever, clearly for political reasons, he does not thank\nSchur\nor acknowledge his help in any way.\nTheilheimer taught in a school in Berlin for a year after the award of his doctorate. The position of Jews in Nazi Germany had become quite impossible and his brother Richard Theilheimer had, as we mentioned above, emigrated to the United States in\n1935\nand was living in New York City. Richard had worked as a salesman in Germany before the anti-semitic laws forced him to stop work. In the United States he became involved in selling children's wear. It was Richard who made it possible for his brother Feodor to emigrate to the United States in November\n1937\nby signing an affidavit. However, after arriving in the United States was difficult for Theilheimer to find work suited to his academic attainments.\nFrom\n1937\nto\n1941\nhe was engaged in private tutoring of Jewish subjects in St Louis, where he had been sent by an organisation caring for Jewish refugees. Then, he made a move to applied mathematics through the summer school at the University of Chicago in\n1941\n. He attended the forty-eighth Annual Meeting of the\nAmerican Mathematical Society\nwhich was held at Lehigh University, Bethlehem, Pennsylvania, from Monday,\n29\nDecember to Wednesday,\n31\nDecember\n1941\n. It was held in conjunction with meetings of the\nMathematical Association of America\n, the Association for Symbolic Logic, and the National Council of Teachers of Mathematics. On Tuesday\n30\nDecember, Theilheimer was introduced by\nRichard von Mises\nand delivered the talk\nThe potential of curvilinear distributions\nto the Applied Mathematics Section. During\n1941\n-\n42\n, he took the 'Program of Advanced Research and Instruction in Mechanics' at Brown University. He published\nSwept-back wings with arbitrary lift distribution\n(1942)\nand\nThe influence of sweep on the spanwise lift distribution of wings\nin the\nJournal of Aeronautical Science\nin\n1943\n.\nIn September\n1942\nTheilheimer was appointed as an instructor in mathematics at Trinity College, Hartford, Connecticut. He was at Trinity College, when he joined the\nAmerican Mathematical Society\nin\n1943\n. On\n16\nFebruary\n1943\n, the\nTrinity Tripod\ncarried the article\nTrinity Math Instructor Contributes to Science. Feodor Theilheimer Carrying on Extensive Study in Special Field of Aerodynamics\n:-\nDr Feodor Theilheimer, Trinity College Math instructor, who was one of the more brilliant scientists in Germany before his exile in\n1937\n, is now continuing his extensive study in the field of aerodynamics. He has just completed a paper dealing with aeronautics, which will soon appear in the \"Journal of Aeronautical Sciences. Dr Theilheimer, German born and bred, received his degree from the University of Berlin. In\n1937\nhe came to the United States and became a member of the faculty of Brown University, where he did his first important American work in the aerodynamics sphere. Dr Theilheimer resigned from the Brown faculty in\n1942\nto accept the post of instructor in mathematics at Trinity College in September of that year. In addition to all this research that he is conducting, Dr Theilheimer is instructing the Freshmen and other Math\n1\nmajors in the principles of plane trigonometry and elementary calculus. He is also conducting extension courses in aerodynamics and advanced mathematics besides teaching Math\n2\n.\nThree years later, in\n1946\n, he was promoted to assistant professor at Trinity College. He was given leave so that he could visit the Institute for Advanced Study at Princeton from\n1\nJanuary\n1946\nto\n30\nJune\n1946\n. In\n1948\nhe joined the Naval Ordnance Research Laboratory\n[\n1\n]\n:-\nAfter the war\n(1948\n-\n77)\n, Theilheimer worked for the U.S. Department of Defense, contributing with his mathematical work to the theory of spline functions. The conditions of his emigration prevented him from returning to work as an academic teacher.\nAlso in\n1948\n, Theilheimer married Henriette Rubel\n(4\nFebruary\n1916\n-\n22\nMay\n2013)\n, known as Henny, originally from Hochspeyer in Germany, and they lived in Chevy Chase, Maryland. In fact the Theilheimer family lived at\n2608\nSpencer Road, Chevy Chase, Montgomery County, Maryland. They had one child, Rachel Theilheimer born\n1950\n. His address in\n1949\nis given as Naval Ordnance Laboratory, White Oak, Maryland,\n914\nFlower Avenue, White Oak\n12\nand in\n1951\nas Naval Ordnance Laboratory, White Oak, Maryland,\n2213\nWashington Avenue, Silver Spring, Maryland. He spent\n1952\n-\n3\nas a lecturer in mathematics at the University of Maryland.\nThe\nAmerican Mathematical Society\nreported:-\nIn\n1954\nDr Feodor Theilheimer, who has been at the Naval Ordnance Laboratory, Silver Spring, Maryland, has a position with David Taylor Model Basin, Carderock, Maryland.\nIn fact he went to the Applied Mathematics Laboratory at the David Taylor Model Basin. Ray Mejia writes:-\n[\nI\n]\nbecome interested in numerical analysis, and\n[\nthat\n]\nresulted in several years of work at a Navy research laboratory, the David Taylor Model Basin\n(\nnow the Naval Ship Warfare Center in Carderock, MD\n)\n. At the same time I began graduate work at the University of Maryland ...The years at the Model Basin were great fun, working with many dedicated mathematicians and scientists in several disciplines, including ... Feodor Theilheimer ...\nTheilheimer was much involved with the\nMathematical Association of America\n. He attended the Association meeting at Yale University, New Haven, Connecticut on\n1\n-\n2\nSeptember\n1947\n. He also attended the Association meeting at Columbia University, New York City, on\n30\nDecember\n1949\n, and the meeting at Johns Hopkins University, Baltimore, Maryland on\n31\nDecember\n1953\n. He attended the Maryland District Section of the\nMathematical Association of America\nmeeting on many occasions, for example at the American University, Washington D.C. on\n10\nDecember\n1949\n, at the Catholic University, Washington D.C. on\n9\nDecember\n1950\n, at Howard University, Washington D.C. on\n6\nDecember\n1952\n, at The George Washington University, Washington D.C. on\n5\nDecember\n1953\n, and at Georgetown University, Washington D.C. on\n4\nDecember\n1954\n. The references\n[\n9\n]\nto\n[\n17\n]\nbelow describe these meetings of the\nMathematical Association of America\n.\nIn\n1961\n, in collaboration with William Starkweather, he published the paper\nThe fairing of ship lines on a high-speed computer\n. This paper gives a good indication of the type of work Theilheimer was carrying out at the Model Basin. The authors write in the Introduction to the paper:-\nBefore the actual construction of a ship can begin, considerable time and effort has to be spent in the drawing of the ship lines. The purely graphical methods of determining ship lines are very tedious and time-consuming. Therefore, the problem of implementing the graphical methods by analytic procedures has been studied for a considerable time.  ... The analytical approach to the ship line problem has become particularly attractive since high-speed computers became available. This offers an opportunity to eliminate much of the drudgery inherent in the graphical method. When ship lines are found by an analytic method, they may possess unwanted fluctuations. It is, therefore, desirable to have an analytic criterion which permits us to determine whether or not a line is free of unwanted fluctuations. This paper furnishes such a criterion and gives a method of finding lines without such fluctuations.\nIn\n1961\n, Theilheimer and Pao C Pien were awarded the David W Taylor Award for Scientific Achievement. The\nDavid Taylor Model Basin Bulletin\ndescribed the award\n[\n3\n]\n:-\nDuring a ceremony held on\n13\nJuly\n1961\nin the presence of the Management Council, Captain J A Obermeyer, Commanding Officerand Director, announced that Drs Pao Pien and Feodor Theilheimer have been selected as the first recipients of the David W Taylor Award for Scientific Achievement. Dr Theilheimer was present to receive the award letter and citation. ...\nDr Feodor Theilheimer. By developing a mathematical technique for calculating ship profiles with the use of a high speed calculator, you have made it practical for the first time to calculate ship profiles automatically. Your methods have been tested on several Navy vessels and the results obtained have proved their feasibility. They will have a profound impact on the design of ships in the future, making possible a systematic approach to the study of more complex ship design problems as a function of specific mathematical parameters. For this outstanding accomplishment you richly deserve the David W Taylor Award for Scientific Achievement.\nIn\n1969\nTheilheimer published the paper\nMatrix Version of the Fast Fourier Transform\nin the\nIEEE Transactions on Audio and Electroacoustics\n. He writes:-\nThe fast\nFourier\ntransform is considered to owe its speed to the fact that a certain matrix, none of whose elements is zero, can be factored into matrices with very many zeros. This paper describes and discusses a procedure for explicitly carrying out such a factorization. This paper is not intended to give a new, improved, or speedier version of the fast\nFourier\ntransform. It only attempts to formulate an answer to a question which is often posed by colleagues who have heard about the fast\nFourier\ntransform. They ask: What makes the fast\nFourier\ntransform so fast?\nHe received further honours for his outstanding work:-\nFeodor Theilheimer, Naval Ship R&D Center Bethesda, MD was elected to full membership of the Sigma Xi, The Scientific Research Society in\n1975\n.\nHe was a member of the\nAmerican Mathematical Society\n, the\nMathematical Association of America\n, the\nSociety for Industrial and Applied Mathematics\n, and the Association for Computing Machinery.\nAfter retiring in\n1977\nTheilheimer taught mathematics courses at the University of Maryland until\n1983\n. Theilheimer and his wife continued to live in Chevy Chase after he retired and, in December\n2000\n, he died there. Henny Theilheimer, his wife, moved to New York after the death of her husband and died there on Wednesday,\n22\nMay\n2013\n."
}