{
  "nome_completo": "Frank Featherstone Bonsall",
  "nome_curto": "Frank Bonsall",
  "ano_nascimento": "1920",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bonsall/",
  "lugar_nascimento": "Crouch End, London, England",
  "lugar_morte": "Harrogate, England",
  "biografia": "Frank Bonsall\n's parents were Sarah and Wilfred Cook Bonsall. Sarah was from the North of England, having been brought up in North Yorkshire, while Wilfred was a Derbyshire man. Sarah and Wilfred had two children: the elder was Arthur Wilfred Bonsall and the younger Frank, the subject of this biography. Let us note at this stage that Arthur Bonsall went on to become the director of the Government Communications Headquarters at Cheltenham from\n1973\nto\n1978\nand was knighted in\n1977\n.\nWhen Frank was three years old, in\n1923\n, the family moved to Welwyn Garden City and he was brought up in this new town. The town, about\n30\nkm north of London, was only founded in\n1920\nand was a small place when the Bonsalls moved there. Frank was educated at Fretherne House Preparatory School in Welwyn Garden City until he was thirteen years old when his parents sent him to Bishops Stortford College as a boarder in\n1933\n. This independent school, for both day pupils and boarders, took only boys. Despite not being particularly happy at the boarding school, Bonsall excelled academically enjoying particular success in mathematics. In\n1938\nhe graduated from Bishops Stortford College and matriculated at the University of Oxford, entering Merton College, one of the oldest of the Colleges founded in the\n13\nth\nCentury, to study mathematics\n[\n2\n]\n:-\nLater, he recalled how much he enjoyed the freedom of university life, as well as his first encounters with rigorous analysis, the area of mathematics that was to become his speciality.\nHe did not get the chance to enjoy much more of his university career at this time for World War II broke out in September\n1939\nwhen German troops invaded Poland. In\n1940\nhe was called up for military service and he became a cadet in the Corps of Royal Engineers. On\n21\nJune\n1941\nhe was promoted from cadet to\n2\nnd\nlieutenant after training at the Officer Cadet Training Unit. Bonsall spent six years in the Royal Engineers, spending two years in\n1944\n-\n46\nin India where his task was to try out equipment to test how it functioned under extreme jungle conditions. He did not completely give up mathematics during these years for he took\nEdward Titchmarsh\n's book\nThe theory of functions\n(1932)\nwith him. It is said that \"a generation of mathematicians learned the theory of analytic functions and\nLebesgue\nintegration from\n[\nTitchmarsh\n's book\n]\n, and also learned\n(\nby observation\n)\nhow to write mathematics\" and, indeed Bonsall was one of this \"\nTitchmarsh\ngeneration\".\nAfter the end of World War II in\n1945\nit took a while before things began to return to normal and for some time Bonsall continued to serve in India. He returned to take up his undergraduate studies at Oxford in\n1946\nand this proved a significant year in more ways than one since he quickly became friends with Gillian Patrick, one of his fellow mathematics undergraduates at Oxford. Jill, as she was known to her friends, became Bonsall's wife in\n1947\n. After the award of his first degree, Bonsall had to choose between remaining at Oxford to undertake research or take up a temporary one-year lectureship at the University of Edinburgh in Scotland. He chose to spend the year lecturing in Edinburgh and there he met\nW W Rogosinski\nwho had just been appointed to the chair of mathematics at Newcastle. In the following year, Bonsall moved to Newcastle to join\nRogosinski\nand to take up a lectureship there. Bonsall had had no research training before his first appointment but the influence of\nRogosinski\nguided the young talented lecturer into becoming an excellent researcher. His first paper\nNote on a theorem of Hardy and Rogosinski\n(1949)\ncontained an elementary proof of a known theorem. His next papers were\nOn generalized subharmonic functions\n(1950)\n,\nThe characterization of generalized convex functions\n(1950)\nand\nInequalities with non-conjugate parameters\n(1951)\n. In this last mentioned paper,\nR P Boas, Jr\nexplains in a review, that Bonsall:-\n... discusses a variety of inequalities, mostly connected with\nHilbert\n's double series theorem ... . He applies a new technique which yields much simplified proofs of known results as well as new results.\nBonsall spent the academic year\n1950\n-\n51\non study leave on the Stillwater campus of Oklahoma State University. Up to this time his research had been along fairly classical lines but at Stillwater he began to undertake research in functional analysis, the topic on which he undertook research for the rest of his life. In collaboration with Morris Marden, Bonsall published\nZeros of self-inversive polynomials\n(1952)\nand, in collaboration with\nAlfred Goldie\n,\nAlgebras which represent their linear functionals\n(1953)\n. Back in Newcastle after his year at Stillwater, Bonsall soon became one of the leading functional analysts, becoming a leading expert on\nBanach\nalgebras. When\nRogosinski\nretired from the Newcastle chair in\n1959\n, Bonsall was appointed to succeed him. Alastair Gillespie writes\n[\n2\n]\n:-\nIn\n1963\n, the University of Edinburgh instituted a second chair of mathematics, the\nMaclaurin\nchair. Bonsall applied and was interviewed by a committee chaired by the principal, Sir Edward Appleton, who immediately wrote to offer him the position. This was one of Appleton's last acts as he died suddenly that night. Bonsall took up the chair in\n1965\nbut spent the following academic year at Yale, where he was already committed to a visiting professorship. On his return he did much to strengthen the position of\nfunctional analysis\n. Along with\nJohn Ringrose\nand Barry Johnson at Newcastle, he founded the North British Functional Analysis Seminar, one of the first inter-university seminars in mathematics, and a model for many others.\nLet us look briefly at some of the books that Bonsall published. His first was\nLectures on some fixed point theorems of functional analysis\n(1962)\n. This book was the lecture notes from a course Bonsall had given at the Tata Institute of Fundamental Research, Bombay, India. H H Schaefer writes in a review:-\nThe present set of notes is concerned with the application of several fixed point principles\n(\nin particular, the\nBrouwer\n-\nSchauder\n-\nTikhonov\ntheorem\n)\nto linear and nonlinear functional analysis. The exposition is easy to read, and though a more accurate reproduction\n(\nomission of symbols\n)\nwould do the underlying lectures greater justice, these notes supply a great deal of information to readers with even a modest mathematical background. But the expert also is likely to find something of interest to him in each of the different sections.\nBonsall's other books were all written in collaboration with John Duncan, who had been one of his research students graduating with a Ph.D. from Newcastle in\n1964\n. The first of these books was\nNumerical ranges of operators on normed spaces and of elements of normed algebras\n(1971)\nto which the authors added a second volume\nNumerical ranges. II\n(1973)\n. T W Palmer, reviewing the second of these books, writes:-\nThis book is a continuation of the authors' work 'Numerical ranges of operators on normed spaces and of elements of normed algebras'. The text of the present book was prepared with astonishing rapidity after the July\n1971\n, Conference on Numerical Ranges held at Aberdeen University. With the exception of a body of results on semigroup generators, the book together with its predecessor discusses essentially all developments in the subject through\n1971\n.\nThe other important text jointly authored by Bonsall and Duncan was\nComplete normed algebras\n(1973)\n. I Suciu writes:-\nThe authors of this book, as they themselves state in the Introduction, \"have devoted almost the whole of our professional lives to the study of\nBanach\nalgebras\". From this large experience they extract a useful and attractive presentation of the principal lines of the general theory of\nBanach\nalgebras, having constantly in mind the needs of people working in the deep problems which appear either in special\nBanach\nalgebras like\nC\n∗\nC^{*}\nC\n∗\n-algebras, operator and function algebras, group algebras, etc., or in the spectral theory of operators.\nIn\n1984\n, Bonsall retired from his chair at the University of Edinburgh and, together with his wife Jill, moved to Harrogate and there he was able to indulge his passion for gardening as well as continuing to undertake research and write papers. He often attended seminars at the University of Leeds and at the University of York, both within easy access of Harrogate. In\n2002\nBonsall and his wife moved into a retirement home in Harrogate and there he spent the final years of his life.\nBonsall received many honours to mark his mathematical contributions. These honours include election as a fellow of the\nRoyal Society of Edinburgh\nin\n1966\nand to the\nRoyal Society\nin\n1970\n. The University of York awarded him an honorary degree in\n1990\n. He gave great service to the\nLondon Mathematical Society\nserving on the Council - the Society awarded him their Senior Berwick Prize in\n1966\n. He served the\nEdinburgh Mathematical Society\nas President in\n1976\n-\n77\n. He also served on several committees of the\nRoyal Society\nand on the Science Research Council.\nFinally we should mention Bonsall's passion for climbing the Scottish mountains\n[\n3\n]\n:-\nBeyond mathematics, Bonsall had a great interest in mountain climbing, ascending his\n280\nth\nMunro in\n1977\n. He also contributed to the debate as to when two close tops count as separate Munros\n(\nthat is, as separate mountains of height at least\n3000\nfeet\n)\n. In two articles in the Scottish Mountaineering Club Journal in\n1973\nand\n1974\n, Bonsall developed a rule for determining this. His rule yields a list very close to the original one compiled by Sir Hugh Munro in\n1891\nand has influenced some subsequent revisions of Scottish Mountaineering Club's definitive list."
}