{
  "nome_completo": "Francisco Javier González Acuña",
  "nome_curto": "Francisco González Acuña",
  "ano_nascimento": "1942",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Acuna/",
  "lugar_nascimento": "Tampico, Tamaulipas, México",
  "lugar_morte": null,
  "biografia": "Francisco González Acuña\nis known simply as Fico among his friends and colleagues. He studied mathematics at the Universidad Nacional Autónoma de México\n(\nUNAM\n)\nin Mexico City graduating with a bachelor's degree in\n1963\n. At UNAM he was taught by, among others,\nJosé Adem\nand\nRoberto Vázquez García\n.\nSolomon Lefschetz\nvisited UNAM almost every summer between\n1944\nand\n1966\nand gave courses and seminars which González Acuña attended. Being taught by these exceptional topologists, González Acuña was undertaking research in topology as an undergraduate and, while still a student at UNAM, published the paper\nIndependencia de la métrica en la\nC\n0\nC^{0}\nC\n0\ntopología fina de un espacio de funciones\nⓉ\n(\nIndependence of the metric in the C\n0\nfine topology of a function space\n)\nin\n1963\n[\n3\n]\n:-\nFico became interested in this problem after reading an article by the eminent British mathematician\nJ H C Whitehead\n, where he proves the theorem under very restrictive assumptions. Fico's result is still little known as it was written in Spanish and in a small-circulation magazine that disappeared more than\n40\nyears ago. However, it is so deep and important that over the years articles with partial proofs have continued to appear, and even other articles where it is stated, erroneously, that the result is false in general.\nFor this reason, the paper was translated into English with title\nIndependence of the metric in the fine\nC\n0\nC^{0}\nC\n0\n-topology of a function space\nand put in\narXiv.org\non\n16\nJanuary\n2014\n. The present version of this paper on the\narXiv\nis dated\n19\nApril\n2021\n. It has the following abstract\n[\n5\n]\n:-\nWe prove that, for any topological space X and any metric space\n(\nY, d\n)\n, the fine topology on the space of continuous functions from X into Y is independent of the metric d.\nAfter the award of his Bachelor's Degree, he was appointed to the temporary position of \"Special Researcher\" in the Institute of Mathematics of the Universidad Nacional Autónoma de México.\nLefschetz\nwas at Princeton University and both\nJosé Adem\nand\nRoberto Vázquez García\nhad studied there for their Ph.D., so it is not surprising that Princeton University became a natural choice for González Acuña's doctoral studies. As with other outstanding students at UNAM, it was\nLefschetz\nwho helped arrange support for González Acuña. At Princeton University, González Acuña studied first for a Master's Degree, then continued to undertake research for a Ph.D. in Mathematics in\n1970\nadvised by the topologist\nRalph H Fox\n.\nGonzález Acuña submitted his thesis\nOn homology spheres\nto the Faculty of Princeton University for the degree of Doctor of Philosophy in\n1969\nand it was recommended for acceptance by the Department of Mathematics in September\n1969\n. In the thesis, he wrote\n[\n5\n]\n:-\nI wish to express my deep gratitude to my adviser, Professor\nRalph H Fox\n, to whom, for his valuable orientation, help and advice, I owe the completion of this thesis. I want to thank\nDennis Sullivan\nfor introducing\nH\n3\nH^{3}\nH\n3\nto me. For very helpful conversations and explanations I wish to thank Professors\nW Browder\n, W Massey and C D Papakyriakopoulos, as well as S Lopez de Medrano, M O'Nan and E Winkelnkemper. I also would like to express my indebtedness to Professors\nSolomon Lefschetz\n,\nJosé Adem\nand\nRoberto Vázquez García\n.\nI have received financial support from the UNAM, the Institute Nacional de la Investigacion Cientifica and Princeton University.\nLast but not least, I want to thank my wife Susana for typing the thesis and for her constant encouragement.\nAs one can see from these acknowledgements, he had married Susana Romero. He graduated with a Ph.D. in\n1970\nwith this outstanding thesis\n[\n3\n]\n:-\nIn his thesis Fico studies a type of differentiable varieties known as \"homological spheres\", whose study is of the utmost importance and stems from the famous \"\nPoincaré\nConjecture\". Fico's thesis contains such a quantity of quality results that we can well say that it contains enough material for two very good theses. In the first part he studies cobordism groups of smooth homological n-spheres, and proves that for dimensions other than\n3\n, such a group is isomorphic to the group of smooth homotopic spheres defined by Kervaire and\nMilnor\n. He also considers the cobordism group of homologous n-spheres embedded in a m-sphere, and proves that for dimensions other than\n3\nand\n4\n, it is isomorphic to the group of pairs of homotopic n-spheres embedded in a m-sphere, defined by Levine. To do all this one needs to have extensive knowledge of the differential topology of higher-dimensional manifolds. For the case n =\n3\n, this group is still unknown, but in the second part of his thesis Fico studies the homological\n3\n-spheres obtained by\nDehn\n's surgery in knots. ...\nGonzález Acuña published the third chapter of his thesis as the paper\nDehn's construction on knots\n(1970)\nin the\nBulletin\nof the\nMexican Mathematical Society\n. This important paper was widely cited. In particular some of the results were generalised in the paper\nKnots, homology spheres, and contractible\n4\n-manifolds\nby Cameron McA Gordon published in\nTopology\nin\n1975\n.\nAfter returning to the Institute of Mathematics of the UNAM in Mexico City González Acuña was given tenure as a \"Special Researcher\". In\n1973\n, at the age of\n31\n, he was promoted to the position of Senior Researcher \"C\". His outstanding research contributions are discussed in several of the references below, in particular in\n[\n2\n]\n,\n[\n3\n]\nand\n[\n11\n]\n. His highly technical work goes beyond the level we wish to present in this archive, but we give a couple of examples so that the reader might get a feel for its importance.\nIn\n1975\nGonzález Acuña published\nHomomorphs of knot groups\nin the\nAnnals of Mathematics\n. In this paper he answered in the affirmative an important problem posed by the American mathematician Lee Paul Neuwirth, a problem that had been left unanswered for more than ten years. Neuwirth himself, upon learning of Fico's result, wrote the following to him in a letter:-\nI have looked at your paper and you have a lovely and important result. I recommend that you aim very high where you send the paper. I would try the 'Annals of Mathematics'.\nIndeed the article was published in the\nAnnals of Mathematics\nand reviewed by Lee Paul Neuwirth who wrote\n[\n11\n]\n:-\nIn this paper the author proves the following remarkable theorem: A group G is a homomorph of some knot group if and only if G is finitely generated and has weight at most one. The weight of a group is the smallest n such that there exist n group elements whose normal closure is the whole group. Knot groups have weight one, and the homomorph of a weight one group has weight one. Knot groups are finitely generated and the homomorph of a finitely generated group is finitely generated, so the power of the theorem is evident; finite simple groups, for example, are homomorphs of knot groups.\nOur second example is the book\nImbedding of three-manifolds groups\n, written in collaboration with Wilbur Whitten and published in\nMemoirs\nof the American Mathematical Society in\n1992\n. Klaus Johannson write in the review\n[\n8\n]\n:-\nA well-known theorem in the theory of\n3\n-manifolds says that isomorphisms between\n(\nHaken\n)\n3\n-manifold groups are in most cases induced by homeomorphisms. All the cases in which this is not true are well understood. In fact, it is well understood when a homotopy equivalence between Haken\n3\n-manifolds fails to be a homeomorphism. The authors are interested in finding out when essential maps between knot spaces fail to be homeomorphisms. The answer is again that this happens much less than expected.\nJose Maria Montesinos Amilibia\n(\nborn\n1944)\nwrites in\n[\n9\n]\nabout working with González Acuña. He writes that in the summer of\n1977\n:-\n... Fico invited me to the Institute of Mathematics, he met me at the airport in his nondescript car, and we spent three months working together. This was one of the experiences that every time it is repeated, on the occasion of our mutual encounters, gives me greater pleasure. Anyone who has been lucky enough to talk to Fico about mathematics knows this. We talked about it in the car; on the street; at the dentist's surgery; buying tortillas; playing baseball; in his house, surrounded by children and with his better half, the ineffable Susana, who, I remember, made all kinds of extra-mathematical comments. Finally, everywhere. But Fico did not lose his temper or the thread. It was patience in person. And from one day to the next, he continued to keep his pulse on whatever the problem was.\nFor more of Montesinos Amilibia's description of working with González Acuña, see\nTHIS LINK\n.\nGonzález Acuña, in addition to his remarkable research career, has made many contributions to teaching and to supporting the mathematical community in Mexico. As a lecturer, he has given one course per semester throughout his long career although, as noted in\n[\n3\n]\n, he has not recorded them all in his CV since, for much of his career, CVs were relatively unimportant. He has supervised the Bachelor's and Master's theses of at least eleven students and supervised the Ph.D. studies of María de la Paz Álvarez Scherer\n(\nYear:\n1993)\n, Víctor Manuel Núñez Hernández\n(\nThesis:\n3\n-variedades no orientables y cubiertas ramificadas\nⓉ\n(\nNon-orientable\n3\n-varieties and branching covers\n)\n; Year:\n1993)\n, Enrique Ramírez Losada, Lorena Armas Sanabria\n(\nThesis:\nGrupos de trenzas y cerraduras de trenzas puras\nⓉ\n(\nBraid Groups and sheer Braid locks\n)\n; Year:\n2000)\nand Jesús Rodríguez Viorato\n(\nThesis:\nLa Conjetura Z para algunos Nudos Pretzel\nⓉ\n(\nThe Z Guess for some Pretzel knots\n)\n; Year:\n2014)\n. He has influenced many others, however, including: Hamish Short who undertook postdoctoral studies with González Acuña; Mariel Vázquez who studied for a Ph.D. with González Acuña's team; Jose Maria Montesinos who describes his contacts with González Acuña in\n[\n9\n]\n; and Abigail Thompson whose Ph.D. thesis,\nProperty P for Some Classes of Knots\n, is closely related to González Acuña's work. She received her doctorate from Rutgers University, New Brunswick, USA, in\n1986\n.\nThe\nBulletin\nof the\nMexican Mathematical Society\nwas founded by\nJosé Adem\nwho edited it until his death in\n1991\n. After a period when the\nBulletin\nsorely missed\nJosé Adem\n's inspiring leadership, González Acuña took over as editor in\n1996\n. He did a remarkable job for\n18\nyears in this role and:-\n... Fico, with his dedication, prestige and editorial skills, gave credibility to the Bulletin.\nOn Wednesday,\n12\nFebruary\n2020\n, the University Council of the Universidad Nacional Autónoma de México appointed Francisco González Acuña \"Fico\" as an Emeritus Researcher. Several mathematicians wrote in support of Fico's appointment and some extracts are given in\n[\n3\n]\n. We give an English translation of some extracts at\nTHIS LINK\n.\nNow let us give a couple of quotes on González Acuña's contributions to mathematics. First from\n[\n12\n]\n:-\nFico has been a leading topologist, and in general, a leading mathematician for over\n45\nyears. He has been a pillar in the development of a research community of mathematics in México, and more particularly, he has played an essential rôle in the development of topology in México. Fico has a deep knowledge of many and varied branches of mathematics, and his contributions to the topology of low-dimensional manifolds are influential and wide ranging.\nNext from\n[\n9\n]\n:-\nThe influence of a great teacher and superb mathematician is measured by his published work, by the published works of his disciples, and, perhaps most important, for the mathematical atmosphere it created and helped to maintain. I think that in these three facets Fico's work is equally memorable.\nThe author of\n[\n3\n]\nwrites:-\nVarious international tributes and congresses of the highest level have been organised in Fico's honour, with the presence in Mexico of world leaders in the area. This has put Mexico on the map of world mathematics in the area, and has opened multiple doors for young Mexicans. ... His in-depth knowledge of various areas of mathematics amazes everyone who has had the opportunity to speak with him. When you ask him anything, he doesn't answer immediately, but ponders it carefully, and when he does give his answer, a few minutes, hours, or days later, it is invariably much more interesting and profound than the original question. Exemplary academic, with an amazing ability to listen, understand and contribute ideas, regardless of the subject, without expecting anything in return. His careful intellectual ethics has been an example for many generations of mathematicians, and has earned him the respect, affection, and admiration of the national and international mathematical community.\nFinally this summary of his career up to\n2017\nfrom\n[\n1\n]\n:-\nFico is a mathematician who has dedicated his life to high quality research. He published his first paper as an undergraduate student and did an exceptional doctoral thesis. He continued to do high-quality research after his doctorate, as can be seen from his articles published in the 'Annals of Mathematics', which is why, when the National System of Researchers was formed in\n1984\n, Fico received the level III distinction in that system, which he has maintained ever since. His work is widely recognised abroad, and his articles have received more than\n600\ncitations. Fico has been a reference for the new generations that have come to the Institute of Mathematics since the\n1980\ns, since he has maintained his style, that of publishing only transcendent and high-quality articles.\nWe have illustrated González Acuña's impressive research career but we should also mention his love of games and the popular lectures he has given, many combining his research interests and games. Examples are:\nChess problems in knot theory\n(1972)\n;\nGame theory: a domino model\n(1977)\n;\nPenalties: Game Theory in Soccer\n(1987)\n; Knots and DNA\n(1989)\n; and\nDominoes with\n8\ntiles\n(1991)\n. Now this interest was inherited by his son Alejandro González Romero whose research interests include artificial intelligence, computer chess and Scrabble. Father and son collaborated with others to publish papers such as\nA Scrabble Heuristic Based on Probability That Performs at Championship Level\n(2009)\n,\nHuman-like Heuristics in Scrabble\n(2009)\n,\nEl método de anagramas: un rápido y novedoso algoritmo para generar jugadas de scrabble\nⓉ\n(\nThe Anagram Method: A fast novel algorithm for generating Scrabble plays\n)\n(2018)\nand\nA Scrabble Playing Engine Using a Probability-Based Heuristic\n(2021)\n. Alejandro González Romero was awarded a Ph.D. in Artificial Intelligence from the Universitat Politècnica de Catalunya on\n22\nDecember\n2021\n. In his thesis\nA novel computer Scrabble engine based on probability that performs at championship level\nhe writes\n[\n7\n]\n:-\nTo my beloved parents, Susana and Fico, who have loved, helped and supported me unconditionally all my life. Thanks so much for believing in me, for bringing me to life, for everything."
}