{
  "nome_completo": "Dominique François Jean Arago",
  "nome_curto": "François Arago",
  "ano_nascimento": "1786",
  "ano_morte": "1853",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arago/",
  "lugar_nascimento": "Estagel, Roussillon, France",
  "lugar_morte": "Paris, France",
  "biografia": "François Arago\n's father was Bonaventure Arago, who was the mayor of Estagel which is a small town about\n18\nkm north west of Perpignan, and his mother was Marie Roig. The Arago family came from the eastern Pyrenees, and in fact the name Arago has Spanish connections with the Aragon region of Spain which is quite close by. François' parents had nine children, four boys and five girls.  François was the eldest of the boys, having brothers Jean, Jacques, and Étienne. Jean Arago\n(1788\n-\n1836)\nemigrated to North America and had a military career; Jacques Étienne Victor Arago\n(1799\n-\n1855)\ntook part in the voyage of\nl'Uranie\nled by Louis de Freycinet to conduct magnetic and oceanographic researches in the Pacific; and Étienne Vincent de Arago\n(1802\n-\n1892)\nwas an author and dramatist.\nThe Arago family were involved in politics, having leftist republican views, and also had military connections. At first François Arago showed an interest in a military career and it was with this in mind that he was educated at the Municipal College of Perpignan where he came to love mathematics. In\n1803\nhe was examined at Toulouse for admission to the École Polytechnique in Paris. His examiner was Louis Monge, the brother of\nGaspard Monge\nwho was at the time director of the École Polytechnique, and Arago was placed as one of the top five students in the ranked entrance list. He entered the École Polytechnique in\n1803\nand took up lodgings in a Paris apartment owned by a friend of his father. This friend introduced Arago to\nPoisson\nwho was five years older than Arago and had been appointed at an assistant professor at the École Polytechnique in the year before Arago entered the school. Arago and\nPoisson\nbecame friends, not really behaving as student and teacher.\nPoisson\nwould frequently visit Arago in his apartment in the evenings and the two would discuss politics and mathematics. Although, as we have said, the two were not like student and teacher, nevertheless\nPoisson\ndid influence his younger friend very considerably. Despite being taught by some of the leading mathematicians in the world, Arago did not find their abilities to teach come anywhere close to their abilities for research. In\n1805\nPoisson\nwas able to offer Arago a task of far more importance than one would have expected a young student to be asked to undertake. He asked Arago to help in measuring the meridian.\nDelambre\nand\nMéchain\nmeasured the meridian from Dunkerque\n(\nDunkirk\n)\nto Barcelona between\n1792\nand\n1798\n. Using their data the length of the metre was set but\nMéchain\nhad remained keen to obtain more data. In September\n1801\nthe Bureau des longitudes requested that an expedition be sent to extend the meridian measurements south of Barcelona.\nMéchain\nwas keen to lead this new expedition and in April of\n1803\nhe left for Spain. He triangulated down the Catalan coast in June, and by January of\n1804\nhe had crossed to Ibiza and Mallorca\n(\nMajorca\n)\n. However he died in September of\n1804\nwith the task incomplete.\nLaplace\nasked\nPoisson\nto find someone who would continue the work, and\nPoisson\nproposed his young friend Arago. The challenge was a daunting one, and Arago took some time to make a decision. However he finally decided that he would accept the prestigious offer, was nominated  formally on\n22\nFebruary\n1805\nand then moved into the Paris Observatory which would become his headquarters.\nBiot\nwas assigned to become the second member of the team and the pair spent about eighteen months learning the necessary techniques. In fact they were asked to carry out a second scientific task at the same time for they were asked to use a pendulum to measure the force of gravity at the various locations on their travels so that the data might be used for a more accurate estimate of the exact shape of the Earth.\nOn\n3\nSeptember\n1806\nArago and\nBiot\nset out for Spain. They continued the task which\nMéchain\nhad been undertaking on his final expedition and by\n1808\nthey were on Mallorca, an important point which allowed the Paris meridian to be continued south of Barcelona. They had been operating in Spain at an extremely difficult time, given that they were French. Napoleon had turned his attention towards Spain and Portugal in\n1807\nand marched his armies through Spain to Portugal in October\n1807\n. They conquered Portugal and occupied parts of Spain. In May\n1808\nNapoleon declared his brother Joseph Bonaparte as Spanish ruler and the War of Independence began.\nBiot\nand Arago must have looked extremely suspicious; two Frenchmen with sophisticated measuring instruments working on Spanish territory.\nBiot\nfled back to France but Arago remained on Mallorca, disguised as a Spaniard, trying to complete his measurements which he had recorded in a logbook. However lighting of fires on the top of Mount Galatzo was pretty suspicious so he was arrested as a spy and put in prison.\nArago managed to persuade the commander of the prison that he was a scientist, not a spy, and the commander agreed to give Arago a chance to escape. He did so on\n29\nJuly\n1808\nand, still carrying his precious logbook, managed to find a fishing boat heading for Algiers, which he boarded. Reaching Algiers on\n3\nAugust he went to the French consul who supplied him with a forged Austrian passport and by\n16\nAugust he was on a boat heading to Marseille. This might have been a remarkable adventure had it ended at that point, but more drama was to come. The boat on which Arago was sailing was captured while on its way to France by a Spanish warship and he was back in captivity again. Arago was held in a Spanish prison in Roses but after only a short spell the Spanish decided to send their prisoners to Palamos since the French armies were advancing through Spain. However Arago was lucky and, having been recognised by the authorities, was released an put on another boat for Marseille on\n28\nNovember.\nIt was not to be, however, for again Arago failed to reach his homeland. A storm blew the boat back to Bougie on the north African coast where he was captured by Moslems. After further adventures during which he persuaded his captors that he wished to convert to Islam to obtain favourable treatment, he was allowed to return to Algiers which he did overland, arriving there on\n25\nDecember. A new local leader in Algiers was opposed to the French and Arago found himself in prison waiting to be shipped off to a penal colony. However the French consul again came to his rescue and, on\n21\nJune\n1809\n, Arago was put, for the third time, on a ship bound for Marseille. This time he reached his destination without mishap and on\n2\nJuly\n1809\nhe was standing on French soil.\nArriving back in Paris with his logbook containing the measurements he was treated as a hero. He became an assistant professor at the École Polytechnique and a member of the\nAcademy of Sciences\n. He also worked at the Paris Observatory for the rest of his career. One experiment which he carried out at the Observatory in\n1810\nconcerned light. He reasoned that since light was refracted by a prism through an angle depending on the ratio of the velocity of light outside the prism to that inside it, then he should be able to detect differences in the velocity of light depending on the speed of the Earth towards and away from the source.\nOf course we now know, from\nEinstein\n, that this reasoning is incorrect. Arago knew roughly what the velocities should be, so he knew that the effect he was looking for was well within what he should be able to detect. In fact detecting the differences in velocities due to the rotation of the Earth should have been possible. Arago made observations of stars on\n19\nand\n27\nMarch\n1810\n. He made observations when the Earth was rotating towards the sources and also when it was rotating away from the same sources. To his surprise he did not detect any differences in the velocity of light. He observed the same sources on\n8\nOctober when the Earth when the difference in velocity should have been twice the Earth's orbital velocity. Again he was puzzled that the velocity of light seemed unaffected by the velocity of the observer towards or away from the source. He presented his results to the\nAcademy of Sciences\non\n10\nDecember\n1810\n. How did Arago explain the puzzling results? He suggested that light particles travel at a variety of different velocities but the human eye of only sensitive to light travelling at one particular velocity. This would explain why the velocity appeared independent of the velocity of the observer.\nArago married Lucie Carrier-Bescombes in\n1811\n; one of their sons, Alfred Arago\n(1816\n-\n92)\n, became an Inspector of Fine Arts, another son Emmanuel Arago served with his father on the National Assembly for many years. In\n1813\nArago began to give popular lectures on astronomy. He continued to give these lectures every year until\n1845\n. He became Director of the Paris Observatory. Arago was also active in other ways. He served for many years as secretary of the\nAcademy of Sciences\nand in this capacity he inaugurated the\nProceedings of the Academy of Sciences\nin\n1835\n.\nHe was active politically for the republican cause and filled several political roles in government in addition to his scientific duties. His political career began in\n1830\nwhen he was elected as a deputy from the Pyrénées-Orientales region. Later he served as a deputy from Paris. In the provisional government which took power after the\n1848\nRevolution he was elected on\n23\nApril and he served as minister of war and the navy. He introduced many reforms while holding this government position including the abolition of slavery throughout France and its many possessions. This government established universal manhood suffrage in France, a cause championed by Arago. He was elected to the Executive Power Commission on\n10\nMay\n1848\n, being named as president of the Commission since he was elected with the largest number of votes. We should also note that he used his political positions to advance science, such as obtaining money to fund the publication of the works of\nFermat\nand\nLaplace\n, supporting the development of railways and of the telegraph. He was also able to get funding for the latest astronomical instruments for the Observatory and able to gain financial support for the\nAcademy of Sciences\n.\nArago made early discoveries on the corpuscular theory of light in\n1811\n. Working with\nFresnel\nhe discovered that two beams of light polarised in perpendicular directions do not interfere, leading to the transverse theory of light waves. His theory of light predicted that the velocity of light should decrease as it passes into a denser medium. In\n1838\nhe described a test to compare the velocity of light in air and in water or glass. However difficulties with the experiment meant that Arago was not in a position to try his experiment until\n1850\n. By this time however his sight had become poor, so it was left to others to carry out a refined version of the experiment. Successful results were obtained by\nFizeau\nand\nLéon Foucault\nbefore Arago died.\nBertrand\n, in his obituary of Arago, wrote:-\nArago smiled at the beautiful experiment\n[\nof\nFizeau\nand\nFoucault\n]\nwhich, with its well deserved praise, brought back pleasant memories of his own glory days when he beat\nLaplace\n,\nPoisson\n, and\nBiot\n, to gain his place in the\nAcademy of Sciences\n.\nIn\n1820\nthe Danish physicist H C Orsted produced experimental results on electricity and magnetism. Arago carried out further experiments of this type and demonstrated several effects which led\nFaraday\nlater to explain them as induction. It appears that Arago was the first person to construct an electromagnet.\nWorking with\nBiot\n, Arago made measurements of arc length on the Earth which led to the standardisation of the metric system of lengths. We described above the adventures he had in taking readings in the south, but later, in\n1821\n, the two extended their results to the north making measurements of the force of gravity using a pendulum in Scotland at Leith, near Edinburgh, and in the Shetland Islands.\nHe suggested that his student\nLe Verrier\ninvestigate irregularities in Uranus's orbit and, after Neptune was discovered, participated in the argument regarding naming the planet and disputed with\nAdams\nregarding priority. Although many have criticised Arago for his part in this dispute, particularly for his efforts to get the new planet named\nLe Verrier\n, one has to feel that he did the right thing in championing his own student who had made the discovery following his advice.\nOther contributions made by Arago include work on the polarization of light, investigations of the solar corona and chromosphere, and measurements of the diameters of the planets. He also worked on the velocity of sound.\nOn\n2\nDecember\n1851\nthere was a coup d'état in France with Louis-Napoleon Bonaparte assuming absolute power and dissolving the National Assembly. Exactly one year later he became Emperor taking the title Napoleon III. Leaders in various field were required to swear allegiance and Arago held two such positions, as Director of the Observatory and as secretary of the\nAcademy of Sciences\n. Arago, a staunch republican, refused to swear allegiance. He remained at the Paris Observatory, which Napoleon II had renamed the Imperial Observatory. Arago requested that the\nAcademy of Sciences\nreplace him as Secretary, not because of the problems with Napoleon III, but rather because he felt that his health was failing, in particular his eyesight was by now very weak, and he could not properly carry out his duties. He was suffering from a build-up of fluid between his tissues, diabetes, and inflammation of the kidneys.\nOn\n22\nAugust\n1853\nArago attended the\nAcademy of Sciences\nfor the final time then, despite his health problems, he set out on the difficult journey to his family in the Roussillon region. After giving them advice on a wide range of matters he returned to Paris where he died shortly after. He was buried in the Père Lachaise cemetery in Paris.\nArago was honoured with the award of the\nRoyal Society\nCopley Medal in\n1825\nand the Rumford Medal in\n1850\n. Craters on both the Moon and Mars have been named after him, as has a ring of Neptune. The\nAcademy of Sciences\ninaugurated the Arago Medal in\n1893\n."
}