{
  "nome_completo": "Frank Harary",
  "nome_curto": "Frank Harary",
  "ano_nascimento": "1921",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Harary/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": "Las Cruces, New Mexico, USA",
  "biografia": "Frank Harary\n's parents, Joseph Harary and Mary Laby, were Jewish immigrants who were born in Greece around\n1895\nand Russia around\n1898\nrespectively. The Harary family, however, originally came from Syria. Frank, the first of their children, was brought up in New York where he attended school. He studied at Brooklyn College, New York, and was awarded an M.A. in\n1941\n. He continued to study for a Master's Degree at Brooklyn College, but spent the year\n1943\n-\n44\nat Princeton University studying theoretical physics. He was awarded an M.A. by Brooklyn College in\n1945\nand then went to New York University where he studied applied mathematics during the academic year\n1945\n-\n46\n. His interests had moved steadily from theoretical physics towards pure mathematics and he undertook research at the University of California at Berkeley for his doctorate on Boolean-like rings. He was advised by\nAlfred Leon Foster\nwhose research interests at this time involved generalising Boolean rings and he had just published his classic paper\nThe theory of Boolean-like rings\nin the\nTransactions of the American Mathematical Society\nin\n1946\n. Harary was awarded his doctorate in\n1948\nfor his thesis\nThe Structure of Boolean-like Rings\n.\nHarary was appointed as an Instructor in the Department of Mathematics at the University of Michigan in\n1948\n. His first publication appeared in\n1949\nand it was not, as one would expect, on Boolean rings but it was entitled\nOn the algebraic structure of knots\n. He explained in a note the motivation for this paper:-\nThis note was motivated by a Colloquium address at the University of Michigan by Professor H Seifert, now at the University of Heidelberg.\nIn\n1950\nHarary published a paper containing results from his doctoral thesis. This paper,\nAtomic Boolean-like rings with finite radical\n, had a difficult publication record. Harary notes that it was submitted to the\nAmerican Mathematical Society\nin November\n1948\nbut was then sent to Duke Mathematical Journal in March\n1949\n. It was revised three times before being published in the Duke Mathematical Journal in\n1950\n. Harary was steadily promoted in the Department of Mathematics at the University of Michigan becoming an assistant professor in\n1953\n, an associate professor in\n1959\n, and a professor of mathematics in\n1964\n. In addition to his position in the Department of Mathematics, he also became a research associate in the Institute of Social Research in the University of Michigan in\n1950\n. He also had a number of visiting positions which were important for the development of his career, working at the Bell Laboratories in New Jersey in the Summer of\n1953\nand again in\n1957\n-\n58\n. He also worked at the Institute for Advanced Study, Princeton at various times during\n1957\n-\n59\nand held a visiting position at the Department of Mathematics, Princeton University in\n1958\n-\n59\n. He went on to hold many visiting professorships in many different countries throughout his career.\nHarary's research moved towards graph theory. He published\n(\njointly with George Uhlenbeck\n)\nOn the number of Husimi trees\n(1953)\n, and over the following few years rapidly gained an international reputation for work in graph theory. His first book on the topic was\nStructural models: An introduction to the theory of directed graphs\n(1965)\nwritten jointly with Robert Norman and Dorwin Cartwright.\nBill Tutte\nbegins a review of this book as follows:-\nThis book is an introduction to the theory of directed graphs\n(\nor \"digraphs\"\n)\n. These are presented as mathematical models for some structures commonly encountered in many fields of study, including the social sciences, engineering, physics and pure mathematics. It is a welcome addition to the literature of graph theory. Very little in the way of mathematical background is required of the reader. The rules of addition and multiplication of matrices, for example, are explained in full. As a rule the theory is presented as a sequence of simple theorems, each with a clear and precise proof. Occasionally a theorem is stated whose proof is thought too difficult for inclusion in the book, and the reader is referred to the original papers. Many of the proofs, regarded as logical structures, are excellent examples of digraphs.\nFor extracts of further reviews of this book and other Harary books see\nTHIS LINK\nHarary spent the academic year\n1962\n-\n63\nin London, England, where he visited the Department of Mathematics of the University College and the Tavistock Institute of Human Relations. He visited London again in\n1966\n-\n67\nwith visits to Mathematics at University College and also to the Department of Statistics at the London School of Economics. The second half of the\n1960\ns saw another side of the activities of Harary and his wife Jayne Perlman. They began buying property in Ann Arbor in\n1965\nand four years later a very critical article was published in\nThe Michigan Daily\nabout these activities. We give extracts from this article without further comment\n[\n17\n]\n:-\nThe chief figure in the property drama is Frank Harary, University mathematics professor and highly reputed graph theorist. ... since\n1965\nhe and his wife Jayne have acquired over $\n200\n,\n000\nworth of old houses throughout Ann Arbor. \"Their pattern is to buy old houses, divide them into apartments, maintain them as poorly as possible, raise the rents,\" says a Human Relations Commission study made in\n1967\n- and chalk up scores of building code violations\n(\nincluding six condemned houses in the past two years\n)\n. ... \"We just wanted these properties for the land value,\" claims Harary, \"we wanted to move the tenants out.\" \"But we don't want to see the tenants in the streets,\" adds Mrs Harary. ... \"We just can't get plumbers or electricians out to the houses. ... I've sat on the phone all day trying to get an electrician. ... We've wanted to help poor blacks find better housing, but we've taken the rap again and again.\"\nHaving mentioned Harary's wife Jayne let us also note that Frank and Jayne Harary had six children, Miriam, Natalie, Judith, Thomas, Joel and Chaya.\nHarary's most famous book was his classic\nGraph theory\npublished in\n1969\n. M E Watkins begins a review of this book by explaining Harary's view of graph theory:-\nSome graph theorists conceive of their field as deeply imbedded in combinatorial mathematics, set theory, algebra, or even topology.\nW T Tutte\nand the late\nØystein Ore\nrepresent this point of view. Others regard graph theory as standing apart from, although \"intimately related to many branches of mathematics, including group theory, matrix theory,... and combinatorics\". The quote is from the Preface of the author's book which places him as perhaps the staunchest proponent of the latter school. Whereas to members of the former group, graphs are essentially intuitively appealing representations or motivation for and special cases of more abstract systems, to the author they are the means and the end in themselves. The book under review fully reflects this philosophy. ... This book is not the work of a builder or unifier of theories, but of a master problem-solver and experienced expositor and teacher. His flair and wit are in evidence throughout. No student ought find this to be a dry book.\nFor extracts of further reviews of this book and other Harary books see\nTHIS LINK\nI\n[\nEFR\n]\nfirst met Harary in\n1972\nwhen he was one of the plenary speakers at the\nEdinburgh Mathematical Society\nColloquium in St Andrews. This was the first conference in which I played a major organising role. Harary gave a series of inspiring lectures on graph theory which had a major influence of me and soon after I introduced graph theory into my undergraduate teaching.\nLet us quote Harary's own description of the areas of graph theory that were of most interest to him:-\nMy field, graph theory, is expanding explosively, both in abstract theory and in applications to many fields. Being interested in both, I am currently exploring applications to knots, groups, combinatorial designs, computing,\n2\n-complexes, kinematic chains in mechanical engineering, kinship and marriage networks and chemical bonds. Within graph theory, I am investigating sum and difference graphs, new domination invariants, forcing concepts, and new games.\nHarary wrote five further books, each one written jointly with a colleague.\nGraphical enumeration\n(1973)\nwas written jointly with Edgar Palmer and addresses the question \"How many non-isomorphic graphs are there with\np\np\np\nvertices,\nq\nq\nq\nedges, satisfying some property\nP\nP\nP\n?\" The other four are all books that emphasise the application of graph theory to other topics. It is clear from the title to what topic\nStructural Models in Anthropology\n(1983)\n, written with Per Hage, applies graph theory.\nDistance in graphs\n(1990)\nwas written jointly with Fred Buckley. R A Melter begins a review as follows:-\nThis is an important and timely book. The mathematical community has been well served by the authors bringing together a body of results which hitherto had been accessible only in research journals. The book is also self-contained and includes exercises in every section. Thus it would be an excellent choice as a text in a course at the advanced undergraduate or higher level. Workers in anthropology, architecture, biology, chemistry, computer science, economics, environmental conservation, psychology and telecommunications will find it to be an invaluable reference tool.\nThe final two books published by Harary were both jointly written with Per Hage. These are\nExchange in Oceania: A Graph Theoretic Analysis\n(1991)\nand\nIsland Networks: Communication, Kinship, and Classification Structures in Oceania\n(2007)\n.\nFor extracts of further reviews of these books and other Harary books see\nTHIS LINK\nWe should also record that in\n2002\nHarary, together with Sandra Arlinghaus and William Arlinghaus, published John Wiley & Sons first ebook entitled\nGraph theory and geography\n. The authors begin their Preface as follows:-\nProfessionals in fields other than mathematics often prefer to see problems\n(\nsynthetic or analytic\n)\nin context, and they find the abstract discussions of these problems by mathematicians too obscure. For this reason, we have chosen to take a different approach in this volume. The necessary collection of relevant definitions and theorems is presented here in an interactive manner. We provide geographic examples from Los Angeles to Berlin and from freeways to pneumatic tube networks, not only to show the synthetic nature of geography as well as of graph theory but also to build the reader's interest so that new applications will ensue. We hope that the manner of presentation, as well as the actual content, will pique the interest of a wide range of readers living in this vibrant world of the second millennium.\nIt is quite impossible to give even an indication of the papers that Harary wrote due to the remarkable number. MathSciNet lists around\n600\nitems as authored by Frank Harary, but this does not tell the whole story since over\n100\nof his papers appeared in journals concerned with topics other than mathematics, not covered by MathSciNet. About half of his papers are joint works and he wrote papers with over\n300\ndifferent co-authors. Many people considered Harary to be the world-leading graph theorist and he was in much demand to lecture to universities, societies, academies and other organisations. Some were mathematical societies but there were also computing societies, chemical societies, engineering societies and management societies. He kept a record of all of the places in which he lectured and the list includes\n87\ncountries. In a rather outdated CV\n(\nprobably written in\n1998)\n, Harary recorded that he had lectured in\n166\ndifferent cities in the United States and\n274\ncities in other countries. The University of Michigan Faculty History Project\n[\n15\n]\nnotes:-\nHe particularly was proud of having given lectures in cities with names beginning with every letter of the alphabet. He finally got his 'X' with a lecture in the excavated Roman amphitheater in Xanten, Germany.\nIn\n1986\n, at the age of\n65\n, he retired from his professorship at the University of Michigan and, in the following year, was appointed as Distinguished Professor of Computer Science in the Computer Science Department at New Mexico State University in Las Cruces. He continued to hold this position until his death in\n2005\n.\nHarary received many honours for his contributions. He received honorary degrees from Brooklyn College\n(1962)\n, the University of Aberdeen, Scotland\n(1975)\n, the University of Lund, Sweden\n(1978)\n, the University of Exeter, England\n(1992)\n, the University of Macedonia, Thessaliniki and the University of Louisville. He was made a life member of the Malaysian Mathematical Society in\n1974\n, and made an honorary fellow of the National Academy of Sciences of India in\n1985\n. He served as an editor of around\n20\njournals including the\nJournal of Graph Theory\nand the\nJournal of Combinatorial Theory\n. For  both of these journals he was a founding editor. He was elected an honorary life member of the Calcutta Mathematical Society and of the South African Mathematical Society.\nDesh Ranjan, Head of the Department of Computer Science at New Mexico State University gave this tribute following Harary's death from a postoperative infection:-\nDr Harary was a true scholar with a genuine love for graph theory which was an endless source of new discoveries, beauty, curiosity, surprises and joy for him till the very end of his life.\nHarary and his wife Jayne were divorced. He was survived by two sons, Tom, of Las Cruces, and Joel, of Kandy, Sri Lanka, and by two daughters, Mimi, of Ann Arbor, and Natalie, of Las Cruces."
}