{
  "nome_completo": "Francesco Severi",
  "nome_curto": "Francesco Severi",
  "ano_nascimento": "1879",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Severi/",
  "lugar_nascimento": "Arezzo, Tuscany, Italy",
  "lugar_morte": "Rome, Italy",
  "biografia": "Francesco Severi\n's father, Cosimo Severi, was a notary but he had a literary bent and loved writing poems and hymns which he published. He was an Italian patriot who had fought, alongside his three brothers, in Garibaldi's war of independence against the Austrians. Francesco's mother, Licinia Cambi, was\n[\n16\n]\n:-\n... a woman of high religious feelings, hardworking, thrifty, full of wise foresight and affection in reserve, tenacious, courageous and strong-willed though also apparently submissive ...\nThe Severi family was large with Francesco being the ninth of his parents' nine children. He grew up in an austere environment, receiving little affection, where his father saw little, spoke little, but gave all the orders. The eldest son, fifteen years older that Francesco, was the favoured child and badly spoiled by his parents. However, he emigrated to Buenos Aires cutting himself off completely from the family. This sadness, together with financial problems, led to Cosimo committing suicide on\n4\nJanuary\n1889\n; Francesco was nine years old. His mother Licinia was in severe financial difficulty with a very small pension but too proud to ask for help bringing up the four children\n(\nFrancesco and three of his sisters\n)\nwho were still living at home at this time. The hardship, of course, came from the death of Cosimo but one feels that the family should not have had to suffer in this way as they had wealthy relatives.\nLeonard Roth\n, in\n[\n14\n]\n, suggests that Francesco's character must have been influenced by this lack of assistance. While at school Francesco had to earn money to help out and did this with a variety of tutoring jobs. It was a childhood of considerable poverty and hard work and Severi said in later life that he had been\n[\n16\n]\n:-\n... sentenced to a life of hard labour in a penal colony.\nWhile at school Severi became interested in politics and was attracted to the Socialist movement which at this time was growing in popularity. We note at this point that Severi had rather strange political allegiances, with his political position moving between the left and the right at various times. He completed his secondary education at the Technical Institute of Arezzo in\n1896\nand he won a university scholarship from the Fraternità dei Laici. He studied at Turin University where, despite the scholarship, he had very little money and had to continue tutoring privately in order to make enough to live. His wealthy relatives could easily have funded his studies but chose not to help him at all. He enrolled in the engineering course, since this had been his father's wish, but soon changed after studying under\nCorrado Segre\nwho persuaded him to study pure mathematics. Severi had not studied Latin at secondary school and now required that subject to enrol for a degree in pure mathematics. He overcame this problem by learning Latin on his own. Once in the pure mathematics course, Severi was taught by\nCorrado Segre\n,\nGiusepe Peano\nand\nVito Volterra\n. He became fascinated by geometry and, under\nCorrado Segre\n's supervision, he went on to obtain his doctorate in\n1900\n. He was highly appreciative of\nCorrado Segre\ndescribing him as an\n[\n5\n]\n:-\n... incomparable teacher. With assiduous care he trained my intellect\n[\nand taught me to appreciate\n]\nrigorous scientific investigations ...\n[\nstirring my\n]\nheart to the highest filial feelings.\nIn addition to his advisor\nCorrado Segre\n, Severi also benefited from the friendship of\nGaetano Scorza\nwho, although an assistant of\nEugenio Bertini\nin Pisa, spent the year\n1899\n-\n1900\nas an assistant to\nCorrado Segre\n. Severi writes:-\nI remember the long walks together in Valentino park or on the small, shady, quiet roads in the Turin hills. Solitary walks on cold winter days or intoxicated by the bright and harmonious awakening in spring when nature was bursting into life: spring in the world around and in our lives.\nSeveri contrasts\nScorza\n's personality with his own. He described himself as follows:-\nI am restless, impulsive, easy to disdain, to rebuke and forgive, to get enthusiastic, to dream, yes, but tempered by the realistic spirit of my land.\nHis doctoral thesis,\nSopra alcune singolarità delle curve di un iperspazio\nⓉ\n(\nOn some singularities of curves of hyperspace\n)\n, together with a series of other papers which he published had published while an undergraduate, deal with enumerative geometry, a subject which had been started by\nHermann Schubert\n. After being awarded his doctorate, Severi accepted a post in Turin as assistant to\nEnrico D'Ovidio\nfor the academic year\n1900\n-\n01\n. He had married Rosanna Orlandini on\n10\nOctober\n1900\n; she had been a friend from childhood. She was a great support to Severi during the\n52\nyears of their marriage; she died in\n1952\n. From Turin, Severi and his wife moved to Bologna where he became an assistant to\nFederigo Enriques\nin\n1902\n. His final post as assistant was in Pisa in\n1903\nwhere this time he was assistant to\nEugenio Bertini\n.\nIn\n1904\nSeveri was appointed to the Chair of Projective and Descriptive Geometry at Parma.\nRoth\nwrites\n[\n14\n]\n:-\nThe interview which led to this appointment must be unique in Italian university annals, for the selection committee insisted on Severi's giving a trial lesson in descriptive geometry at the blackboard\n(\nand this at a time when the candidate had publications which placed him in the front rank\n)\n. After the meeting,\nCastelnuovo\n(\nwho was not on the committee\n)\nmade his way to Rome railway station, sought out Severi, who was sitting in the train for Arezzo, and gave him the good news: again an unusual proceeding.\nSeveri only worked at Parma for one year, accepting the chair at Padua in\n1905\n. In a letter to\nBeniamino Segre\nin\n1938\n,\nGuido Castelnuovo\nexplains how his work and that of\nEnriques\n, interacted with that of Severi over the period\n1904\n-\n08\n[\n6\n]\n:-\nOne last comment regarding the historical issues. ... The notion of a continuous system\n[\nnow called an algebraic system\n]\nof curves on some special surfaces already appears in some works of\nEnriques\nand mine that precede the work of Severi. ... In some special cases I suggested the definition of the characteristic series of a continuous system to Severi. But since this suggestion had been given in an unpublished letter, and subsequently Severi brilliantly developed the idea mentioned in it, it is not useful to make a claim of priority here. I only mention this matter to show you how much caution is needed when you assign scientific priorities in periods in which the research was often done in collaboration, or was suggested by elders to their more youthful colleagues. It was the good fortune of the Italian school of\nalgebraic geometry\nto have this disinterested collaboration between\n1890\nand\n1910\n. But this makes it necessary to smooth out certain overly clean divisions between the work of one and the other. What is undoubtedly due to Severi in the period\n1904\n-\n1908\nare the following: the theorem that the existence of\nPicard\nintegrals of the\n1\nst  and\n2\nnd kind on an algebraic surface depends on the irregularity of the surface\n(1904)\n, a theorem that was successively stated precisely by both of us; the theory of the algebraic equivalence of curves on a surface; and the Theorem of the Base\n[\nthis has evolved into the Néron-Severi Theorem\n]\n. That is more than enough to show his great worth.\nSeveri continued his left-wing political position by joining the Blocco Popolare Patavino after taking up the chair in Padua. This led to his appointment as director of the municipal gas and water company in Padua. He joined the Socialist party in\n1910\nand was immediately elected as a Socialist Party councillor for Padua. He was also the party's education spokesman. In\n1914\n, when Severi held his chair in Padua, World War I broke out but, shortly after hostilities began on\n3\nAugust, Italy declared that it would not commit troops to the fighting. This was despite having an alliance with Germany and Austria-Hungary. Italy revoked this alliance on\n3\nMay\n1915\nand later that month declared war on Austria-Hungary. Severi's tenure of the chair at Padua was interrupted by the war and he volunteered for military service as soon as Italy joined the war in\n1915\n. At this time he resigned from the Socialist Party which had a policy of Italian neutrality. He served with distinction in the artillery for the duration of the war, he was promoted several times and decorated for valour. In May\n1916\n, he was in the Val Lagarina area when the Austrians attacked with a well planned advance. The Italians fought with determination for several days and, although falling back, continued to put up a spirited resistance.\nAfter he was demobbed, Severi returned to his chair in Padua where he remained until\n1922\nwhen he was appointed to the Faculty of Mathematical Sciences at the University of Rome. There he began teaching a variety of courses from calculus to higher geometry. In August\n1924\nhe was an invited plenary speaker at the International Congress of Mathematicians in Toronto giving the talk\nLa géométrie algébrique\nⓉ\n(\nAlgebraic geometry\n)\n. The Italian Fascist movement had started around\n1921\nas a nationalist movement. Led by Benito Mussolini, the Fascists came to power in\n1923\n. Giovanni Gentile, a philosopher who became an ardent supporter of the Fascist philosophy, was minister of education from\n1922\nto\n1924\n.  In\n1923\nGentile recommended that Severi, in addition to his role in mathematics, be appointed rector of the university. Now Giacomo Matteotti\n(1885\n-\n1924)\nwas a member of the Socialist Party who was elected to the Chamber of Deputies and on\n30\nMay\n1924\nhe made a speech in the Chamber highly critical of the Fascists. Only a few days later, on\n10\nJune, Matteotti was murdered by six Fascist thugs. Severi protested and later declared that he gave up politics at this time. Along with many of his fellow mathematicians in Rome, he also signed Benedetto Croce's anti-Fascist manifesto, a fact made public in\n1925\n. As a consequence, Severi resigned as rector of the University of Rome to avoid becoming criticised in an enquiry which was being set up to investigate these matters. The record shows that Severi, despite his previous membership of the Socialist Party, now began to seek favour with Mussolini and the Fascists\n[\n13\n]\n:-\nSeveri began sending the Fascist leader a steady stream of articles, several embellished with a flowery personal note. ... the historical record suggests that he wanted to play a prominent role in the intellectual life of the new Fascist state. Indeed, Severi used his considerable political connections to promote his advancement.\nFor example, on\n31\nJanuary\n1929\n, Severi sent a document to Mussolini from which we quote\n(\nsee, for example\n[\n2\n]\n)\n:-\nAfter having resigned from the socialist party in the first months of\n1915\n, I enrolled as a volunteer when the war broke out, and I was always a fighter at the front. When the war finished, in Padua, where I was Director of that School of Engineers, I faced up to the Bolshevik movement with the fighters. I did not support Fascism, whose structure of admirable coordination of national and economic-social activities, later revealed to me, I had not yet glimpsed; but today I am very close to it, even if on some particular problem, as the press one, my ideas are less orthodox, and agree with what lately an influential fascist Gentile could freely expose. ... I have been abroad several times for scientific reasons and spent a long time, after the accession of Fascism, in America in\n1924\n, in Russia in\n1925\n, in Spain and in Switzerland in\n1928\n. And now I am about to return to Spain. And I never performed any deeds nor pronounced any judgement that, not even for a moment, could be interpreted as adverse to the Regime.\nIt would appear that his changed political views, moving from the Socialist Party to the Fascist Party, had more to do with his desire for advancement that with his political views. In particular he tried to make sure that his name was put forward for the new, state-sponsored Reale Accademia d'Italia. He was nominated in\n1929\nbecoming the only mathematician in the Academy and, three years later, he joined the Fascist Party. In\n1933\nhe published\nFascismo e Scienza\nⓉ\n(\nFascism and science\n)\nwhich extolled the virtues of Italian mathematics and of Fascism telling all Italians it was their patriotic duty to support it. Although the Fascists had not been anti-Semitic at the beginning of the movement, they enacted the Manifesto della razza\nⓉ\n(\nManifesto of Race\n)\nin July\n1938\nwhich forced those of Jewish origins out of the universities. Although Severi would later say that he was appalled to see his Jewish colleagues dismissed, there is considerable evidence that he was leading the call for their dismissal. From this period until Rome was liberated by the Allies in\n1944\n, Severi was the leading Italian mathematician filling leading positions left vacant as his Jewish colleagues were dismissed.\nAfter the end of World War II, various commissions were set up to investigate those who had been active Fascists or who had continued to support Mussolini after he was deposed in September\n1943\n. Severi was suspended from his duties while the investigation took place but the commission cleared him, stating the he:-\n... had not received from Fascism anything more than was his due as a distinguished scientist.\nHowever, the\nAccademia dei Lincei\ndismissed Severi and refused to readmit him even after the favourable findings of the Commission. Only in\n1948\nwhen a general amnesty was enacted was Severi re-elected to the\nAccademia dei Lincei\n. He strongly defended his actions writing in\n1953\n:-\nI have never recanted nor repudiated any of the acts of my life that were, and are, expressions of the strongest attachment to my country.\nWe must not allow the arguments over Severi's political position to detract from his exceptional mathematical contributions. His most important contributions are to algebraic geometry and we have seen in the quote above\nCastelnuovo\n's description of Severi's contributions in\n1904\n-\n08\n. Severi, who gets the highest praise from some colleagues but severe criticism from others, criticised the work of his contemporaries as lacking rigour and relying too heavily on intuition. However, his own work was, by today's standards, not rigorous. The authors of\n[\n13\n]\nstate:-\nSeveri, perhaps more than any other major mathematician of his day, stated more true theorems whose proofs were \"irreparable\" by modern standards or \"almost true\" theorems that required modifications to make them true or that were just plain false \"theorems\".\nRoth\n, in\n[\n14\n]\n, summarises Severi's contributions in the following way:-\nSeveri's scientific work presents several features which, when taken together, must make his career a rarity. To begin with, there is the uniformly high level of his very considerable scientific production: as a rule Severi attacks only important questions of general character and usually of great difficulty. ... In the second place, one cannot fail to observe an essential unity of outlook. Severi maintains a balance between geometry and analysis - he has actually made outstanding contributions to function theory. But within his geometrical work itself the same unity is manifest ...\nAfter work on enumerative geometry, Severi turned to birational geometry of surfaces, a topic which\nCastelnuovo\nand\nEnriques\nhas spent ten years developing before Severi began to work on it. He introduced many concepts into geometry, for example the notion of algebraic equivalence. He gave necessary and sufficient conditions for the linear equivalence of two curves on a surface in\n1905\n. Some rate Severi's discovery of a base of algebraically independent curves on any surface as his most important contribution. He published this in\nMathematische Annalen\nin\n1906\nand\nMax Noether\nwrote to Severi concerning these results saying:-\nYou have shed a great light on geometry.\nIn\n1907\nEnriques\nand Severi won the Prix Bordin from the French Academy of Sciences for a work on hyperelliptic surfaces. We have only scratched the surface for it is impossible to give in this short article any real indication of the range of the contributions which Severi made. For example, in\n[\n13\n]\nBeniamino Segre\nlists over\n400\npublications by Severi. Six volumes of\nOpere matematiche: memorie e note\nⓉ\n(\nMathematical works: memories and notes\n)\ncontain\n196\nof these papers. J S Joel writes in a review:-\n... the first four of a planned six, contain\n142\nmathematical papers of Severi\n(1879\n-\n1961)\n, principally concerning algebraic geometry\n(\nsurfaces\n)\nand function theory of two\n(\nor more\n)\ncomplex variables. ... One remarkable thing is that topics touched upon in the first volume recur later on\n(\nwith deeper results\n)\n; inversion theorems, theories of equivalence, correspondences, surfaces admitting a continuous group of birational transformations, base loci, intersection multiplicities,\nRiemann\n-\nRoch\ntheorems, enumerative problems.\nRoth\ndescribes Severi's teaching abilities in\n[\n14\n]\nwriting:-\n... it was as a teacher of geometry that Severi excelled. His lectures on his own work were unforgettable, the style was beautifully simple ... and the presentation masterly. He was greatly interested in teaching for its own sake, and his didactic skill found an outlet in a whole stream of books ...\nDespite the incredible output of mathematics from Severi, he had an amazing number of outside interests. Again we quote\n[\n14\n]\n:-\nAs he approached middle age, mathematics came to occupy less and less of his time, it had to compete with a host of other occupations. For Severi by then was\n(\namong other things\n)\nPresident of an Arezzo bank, head of the engineering faculty at Padua, an expert agriculturist who managed his own estate.\nHis most impressive work came before he went to Rome but, despite spending less time on mathematics, after this he still managed to produce work of the greatest importance like the solution of the Dirichlet problem and his development of the theory of rational equivalence. We have already seen much of Severi's character in the above biography but let\nRoth\n[\n14\n]\ngive us this summary:-\n[\nHe considered\n]\nthat the world at large failed to treat him with due consideration. For, incredible as it may seem, although during the whole period of his maturity honours were showered upon him and invitations poured in, yet he remained forever unsatisfied. Intellectually, materially and socially, he had nearly everything a man could hope for; he possessed a towering presence, with a leonine head, he was a superb talker - and writer, a connoisseur of art and the humanities in general, a world traveller - but despite all this he seemed more or less permanently aggrieved. He was fond of appearing as a martyr, a part that he played with conviction. ... Personal relationships with Severi, however complicated in appearance, were always reducible to two basically simple situations: either he had just taken offence or else he was in the process of giving it - and quite often genuinely unaware that he was doing so. Paradoxically, endowed as he was with even more wit than most of his fellow Tuscans, he showed a childlike incapacity either for self-criticism or for cool judgement. Thus he meddled in politics, whereas it would have been far better had he left them alone.\nAmong the honours given to Severi we have already mention his election to the\nAccademia dei Lincei\nin\n1910\n. He was elected to the\nParis Academy of Sciences\nin\n1957\nand was made an honorary member of the\nLondon Mathematical Society\nin\n1959\n. He was elected to the\nNational Academy of Sciences of Italy\n(\nthe \"Academy of XL\"\n)\nin\n1919\nand served as its president from\n1949\nto\n1955\n, and re-elected from\n1955\nto\n1961\n. He was awarded the gold medal from the\nNational Academy of Sciences of Italy\n, the Guccia gold medal and, as we mentioned above, the Bordin prize from the\nParis Academy of Sciences\n."
}