{
  "nome_completo": "Frank Stephen Baldwin",
  "nome_curto": "Frank Baldwin",
  "ano_nascimento": "1838",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baldwin/",
  "lugar_nascimento": "New Hartford, Connecticut, USA",
  "lugar_morte": "Denville, New Jersey, USA",
  "biografia": "Frank Baldwin\n's father owned an architectural business. In the summer of\n1840\nthe family left New Hartford and settled in Nunda, Livingston County, New York, a town which is about\n65\nkm south of Rochester. There he attended the first free school founded by New York State and progressed to the Nunda Institute where he concentrated on the study of mathematics. He displayed unusual talents while at the Institute as he describes in\n[\n2\n]\n:-\nIn a class competition, I surprised my teachers by memorizing the decimal of Pi to\n128\nplaces, and ever since that time I have been able to write it without effort.\nAfter graduating from the Nunda Institute, he continued his studies at Union College in Schenectady, New York, entering in\n1854\n. This liberal arts college, founded in\n1795\n, had become the first to offer courses in engineering in\n1845\n. Shortly after he began his studies, however, his father was seriously injured in an accident, and Baldwin had to leave the College to take over the running of the family architectural business. His father was crippled for the rest of his life.\nBaldwin's life as an inventor began soon after he left Union College and, in\n1855\n, he applied for a patent on a self-coupler for railway carriages. He became more determined to follow a life as an inventor when the patent was refused. His first successful application for a patent was in\n1860\nafter he had moved with his family to Fort Wayne, Indiana\n[\n2\n]\n:-\nIn\n1860\n, business took me to Fort Wayne, Indiana. An uncle at Carlyle, Illinois, had designed a corn-planter for which I assisted in securing a patent. This was a pioneer of machines of this class. Early in\n1861\n, I went over to Carlyle to build the first model and arrange for the manufacture of the device.\nHowever, his plans were completely upset by the outbreak of the American Civil War on\n12\nApril\n1861\nwhen hostilities began in Charleston, South Carolina. At this stage he was in Carlyle and he enrolled in the Carlyle Home Guard. Abraham Lincoln, the President, had asked volunteers to sign up for three months, and this is what Baldwin did. However, the Civil War lasted much longer than first anticipated and, after the initial three months, Lincoln asked for volunteers for three years. At this stage Baldwin did not volunteer for further service, however, and he left Carlyle and returned to Fort Wayne, Indiana. He remained there for the duration of the Civil War, which ended in\n1865\n, taking no further part. In\n1869\nBaldwin moved to St Louis to become the manager of the lumber firm Peck's Planning Mills. Around this time he became more enthusiastic with ideas for inventions and he invented a metal latch to fasten shoes, an anemometer to record wind direction, a step for a street-car to record the number of passengers carried, and an indicator for a street-car to show the street name operated from the axle of the car. Soon after this he had an idea to build a calculating machine, the invention for which he is most famous.\nIn\n1872\nhe married Mary K Denniston who came from Williamsport, Pennsylvania; they had six children including Frank\n(\nborn\n1874)\n, Emma\n(\nborn\n1878)\n, Eugene\n(\nborn\n1880)\nand Blanche\n(\nborn\n1888)\n. Frank and Mary had met while Mary was visiting relatives in St Louis. In the year following their marriage, they moved to Philadelphia where Baldwin rented a small shop and began to build his calculating machines. He built ten machines, for which he had sent full details to the United States Patent Office on\n5\nOctober\n1872\n, and he soon sold eight of these machines. One was sold to the Pennsylvania Rail Road Company in Philadelphia and he received a letter from them written on\n8\nAugust\n1874\n(\nsee\n[\n4\n]\n)\n:-\nDear Sir, I have used for the last four months one of your large machines daily in this department and have no hesitation in saying it performs its work rapidly and reliably, and for the purpose used does the work of at least three men, with a certainty of correctness, and greater rapidity. For Railroad Companies, calculating mileages and tonnages, it is, I consider, invaluable.\nThe machine had a single cylinder and sets of nine pins which could be retracted or extended. A handle was positioned at one of the digits\n1\nto\n9\nand this in turn extended the required number of pins. These extended pins engaged cogs on an intermediate pinion, so the number of extended pins determined the rotation of the pinion. The machine also contained a wedge which was used to \"carry one\" if this was required. While he was constructing this large calculating machine he had an idea for a smaller machine\n[\n2\n]\n:-\nWhile thus engaged, I saw the expediency of a small machine to supplement the larger one, and designed an adding machine which I named the 'Arithmometer,' and this patent, dated July\n28\n,\n1874\n, was the first one of the kind granted me by the United States Patent Office. It was also one of the first adding machines sold in the United States. I placed both machines on exhibition at the Franklin Institute, Philadelphia, and was awarded the John Scott Medal for the most meritorious invention of the year.\nHe sold his calculator to various insurance companies in New York, and to various government departments in Washington. While showing his calculator to these government departments he was taken to the National Observatory and there introduced to\nSimon Newcomb\n. His introduction to\nNewcomb\nwas as follows:-\nI want to present Mr Baldwin, who writes and recites Pi to\n128\nplaces.\nNewcomb\nstudied the operation of the calculator and highly complimented Baldwin on his invention. In fact the basic ideas of Baldwin's calculator were taken up by Willgodt Theophile Odhner from Sweden. Baldwin claimed that Odhner had basically stolen his ideas\n[\n2\n]\n:-\nIt was about this time that one of my\n1875\nmodels found its way to Europe, falling into the hands of a Mr Odhner, a Swede. He took out patents in all European countries on a machine that did not vary in any important particular from mine, and several large manufacturing companies in Europe took it up. It is now appearing under ten to fifteen names in Europe, the more important being 'Brunsviga' and 'Triumpator', manufactured in Germany.\nLocke, in\n[\n4\n]\n, notes that Odhner took out a U.S. Patent on his machine\n(\ngranted on\n29\nOctober\n1878)\n:-\n... very similar in design to the Baldwin machine and embodying the two distinctive features of Mr Baldwin's invention, the cam operated radial pins and the sliding wedge carrying mechanism. Odhner interchanged the Baldwin static and moving parts, placing the numeral wheels in the carriage and the selector mechanism in the frame ... Otherwise the disposition of parts and operation are very similar to those of the Baldwin machine.\nBaldwin did not entirely concentrate on calculating machines for he was granted a U.S. Patent for a Cement Mixer on\n12\nMay\n1891\n, and for a Roundabout on\n7\nJune\n1892\n. However, he returned to further inventions relating to the calculator and he was awarded a U.S. Patent for the Baldwin Computing Engine on\n9\nJanuary\n1900\n. This machine performed multiplication or division with one stroke for each digit. Next, he was awarded a U.S. Patent for the Baldwin Calculator on\n5\nAugust\n1902\n[\n4\n]\n:-\nI went back to first principles in this machine, employing the reverse action in dividing and subtracting, the carrying motion being provided on a separate shaft, reducing the diameter of the main cylinder to one half the size of that of the\n1875\nmachine.\nThis machine was capable of doing a calculation such as\n54679285\n×\n3298\n=\n180332281930\nin about\n20\nseconds with eight turns of the handle. See a picture at\nTHIS LINK\nBaldwin designed a listing machine in\n1905\nwith only ten keys and a spacer. After the award of a further Patent in\n1908\nfor the Baldwin Recording Calculator, which combined the listing facilities of the\n1905\nmachine with a calculator, he collaborated with Jay Randolph Monroe, of the Western Electric Company in New York City, from\n1911\nonwards. Together they added a keyboard and modified Baldwin's Recording Calculator so that it was suitable for commercial production. Monroe purchased the rights to the computer from Baldwin and began selling the calculator under the name Model G. The Monroe Calculating Machine Company, founded by Jay Monroe, manufactured the calculator.\nBaldwin's death is recorded in\n[\n3\n]\n:-\nFrank Stephen Baldwin, inventor of the calculating machine and the lace hook for shoes, died yesterday at Dr Hill's private hospital at Morriston, N. J., following an operation."
}