{
  "nome_completo": "Frank Morley",
  "nome_curto": "Frank Morley",
  "ano_nascimento": "1860",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morley/",
  "lugar_nascimento": "Woodbridge, Suffolk, England",
  "lugar_morte": "Baltimore, Maryland, USA",
  "biografia": "Frank Morley\nwas born into a Quaker family. His mother was Elizabeth Muskett, and his father was Joseph Roberts Morley. Joseph ran a china shop in Woodbridge. Frank attended Seckford Grammar School in Woodbridge before he entered King's College, Cambridge, in\n1879\n, having won an open scholarship. An important influence on his school career was\nAiry\nwho Frank had met through their shared passion for chess. It was\nAiry\n's encouragement which saw Frank compete for the scholarship.\nHowever ill health disrupted Morley's undergraduate course and he was forced to take an extra year because of these health problems. Morley only achieved the eighth place in the First Class Honours. To say 'only' here may seem strange since this was an extremely good result in an examination which saw\nMathews\nfirst and\nWhitehead\nfourth. Richmond writes in\n[\n4\n]\n, however:-\nIll health beyond all doubt had prevented him from doing himself justice, but the disappointment was keen. In middle life he was loath to speak of his student days...\nMorley graduated from Cambridge with a B.A. in\n1884\nbut his relatively poor performance meant that he had no hope of a fellowship. He took a job as a school master, teaching mathematics at Bath College until\n1887\n. This was an important period for Morley since he was able to overcome his health problems and with the improvement in health came a renewed confidence in his own mathematical abilities. He settled in the United States and was appointed an instructor at the Quaker College in Haverford, Pennsylvania, in\n1887\n. The following year he was promoted to professor. At Haverford, Morley worked, not with others at the College, but with the mathematicians\nScott\nand James Harkness, both also graduates of Cambridge, England, who were at Bryn Mawr which was close to Haverford.\nIn\n1889\nhe married Lilian Janet Bird, who was a musician and poet. We should note that the marriage produced three sons, Christopher\n(\nborn in Haverford on\n5\nMay\n1890)\n, Felix, and Frank, who all went on to become Rhodes scholars. Christopher Darlington Morley\n(1890\n-\n1957)\nbecame a novelist, and his works include\nThe Trojan Horse, Kitty Foyle\nand\nThe Old Mandarin\n. Felix M Morley\n(1894\n-\n1982)\nbecame editor of the\nWashington Post\nand was also president of Haverford College from\n1940\nto\n1945\n. Frank Vigor Morley\n(1899\n-\n1985)\nbecame a director of the publishing firm Faber and Faber but was also a mathematician who collaborated with his father for over twenty years.\nMorley was appointed Professor of Mathematics at Johns Hopkins University in\n1900\n. The University had been a leading one in the United States over the period while\nSylvester\nworked there, but he had left in\n1883\n. The strong graduate programme in mathematics which had been set up there continued to flourish but by\n1900\nit had begun to decline and Morley's appointment was a very definite attempt to reinvigorate the programme. Certainly he proved an excellent choice leading by example and supervising\n48\ndoctoral students over his years at Johns Hopkins. Coble writes that Morley made it\n(\nsee\n[\n1\n]\nor\n[\n2\n]\n)\n:-\n... a cardinal point to have on hand a sufficient variety of thesis problems to accommodate particular tastes and capacities.\nWe should look now at Morley's mathematical achievements. He wrote papers mainly on geometry but also on algebra. We mentioned that while at Haverford he had collaborated with Harkness. They jointly authored a text\nA treatise on the theory of functions\nwhich was published in\n1893\nand revised as\nIntroduction to the theory of analytic functions\nin\n1898\n. These were excellent advanced level texts published at a time when very few such advanced mathematics books were being produced in the United States. Many years later, in\n1933\n, he published\nInversive geometry\nwritten jointly with his son Frank V Morley.\nMorley's own favourite among his geometry papers was\nOn the\nLüroth\nquartic curve\nwhich he published in\n1919\n. He is perhaps best known, however, for a theorem which is now known as Morley's Theorem:-\nIf the angles of any triangle be trisected, the triangle, formed by the meets of pairs of trisectors, each pair being adjacent to the same side, is equilateral.\nYou can see the diagram for this result at\nTHIS LINK\n.\nMorley loved posing mathematical problems and over a period of\n50\nyears, starting in his undergraduate days, he published over\n60\nproblems in the\nEducational Times\n. Most are of a geometric nature. Here is an example, see\n[\n1\n]\n:-\nShow that on a chess-board the number of squares visible is\n204\n, and the number of rectangles\n(\nincluding squares\n)\nvisible is\n1296\n; and that, on a similar board with\nn\nn\nn\nsquares in each side, the number of squares is the sum of the first\nn\nn\nn\nsquare numbers\n, and the number of rectangles\n(\nincluding squares\n)\nis the sum of the first\nn\nn\nn\ncube numbers.\nWe mentioned that Morley was a chess enthusiast while at school and, indeed, he was an exceptionally good chess player, so the problem above reflects one of his hobbies. He played at the highest level and beat\nLasker\non one occasion while\nLasker\nwas World Chess Champion.\nZund writes about the significance of Morley's mathematical work:-\nToday much of Morley's research seems of less than compelling significance, and one is tempted to regard his interests as those of a talented amateur - an artist who took delight in small and beautiful things - rather than those of a professional mathematician. Yet, whatever the significance one chooses to attach to them, Morley must be given credit for both finding and solving such questions.\nMorley made a major contribution to mathematics in the United States. He undertook editorial work for the\nBulletin of the American Mathematical Society\nand the\nAmerican Journal of Mathematics\nwhile at Haverford. Later, when at Johns Hopkins University, became the editor of the\nAmerican Journal of Mathematics\nand held this position for\n30\nyears. In\n1919\n-\n20\nhe served as president of the\nAmerican Mathematical Society\n.\nHe is described by Cohen in\n[\n2\n]\nas:-\n... a striking figure in any group. Deliberate in manner and speech, there was a suggestion of shyness about him. He was generally very well informed and interested in a strikingly wide range of subjects. He was of an artistic temperament. While many of his papers and lectures seemed involved to the uninitiated, they all possessed a characteristic artistic charm.\nHis son, Frank V Morley, gives this description of his father:-\n... then he would begin to fiddle in his waistcoat pocket for a stub of pencil perhaps two inches long, and there would be a certain amount of scrabbling in a side pocket for an old envelope, and then there would be silence for a long time; until he would get up a little stealthily and make his way toward his study - but the boards in the hall always creaked, and my mother would call out, \"Frank, you're not going to work!\" - and the answer would always be, \"A little, not much!\" - and the study door would close.\n(\nIt wasn't hard to gather that my father was working at geometry, and I knew pretty well what geometry was, because for a long time I had been drawing triangles and things; but when you examined the envelope he left behind, what was really mysterious was that there was hardly ever a drawing on it, but just a lot of calculations in Greek letters. Geometry without pictures I found it hard to approve; indeed, I prefer it with pictures to this present day.\n)"
}