{
  "nome_completo": "Gilbert Leslie Frewin",
  "nome_curto": "G Leslie Frewin",
  "ano_nascimento": "1902",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frewin/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Leicester, England",
  "biografia": "G Leslie Frewin\n's father was James Gilbert Frewin. Leslie was born in Glasgow but his family had moved to Portobello, near Edinburgh, before he entered George Watson's Boy's College, Edinburgh, in\n1908\njust before he was six years old. He studied for twelve years at the school obtaining passes in the Scottish Higher Leaving Certificate examinations in Latin, French, English, Mathematics, Analytical Geometry, and Geometry of Conics. He passed the Preliminary Examination for Edinburgh University in October\n1920\nand matriculated to begin his studies in session\n1920\n-\n21\n. At his first matriculation he gave his home address as\n52\nDuddingston Park, Portobello, and his religious denomination as Wesleyan Methodist.\nIn his first session Frewin studied Second Ordinary Mathematics, Natural Philosophy, and Latin. In his next session,\n1921\n-\n22\n, he took Honours courses in Intermediate Mathematics, Intermediate Natural Philosophy, Experimental physics, Heat, Electricity, and Applied Mathematics. After taking Honours courses in Mathematics and Natural Philosophy he gradeuated with an M.A. with First class Honours in his honours subjects in July\n1923\n. He was awarded the Sir David Baxter Scholarship in Mathematics, also in July\n1923\n. It is worth noting that Frewin was in the same class at university as\nW V D Hodge\n.\nFrewin joined the Edinburgh Mathematical Society in December\n1923\n, immediately following his graduation. At the meeting of the Society on Monday\n10\nDecember\n1923\nthe paper\nThe Numerical Evaluation of Double Integrals\n, by\nMr A C Aitken\nand Mr G L Frewin was read. The paper was published as\nA C Aitken\nand G L Frewin, The Numerical Evaluation of Double Integrals,\nProc. Edinburgh Math. Soc\n.\n42\n(1923)\n. Frewin the went to New College, Oxford where he undertook further study and returned to Edinburgh in\n1925\nwhen appointed to George Watson's College, Edinburgh.\nAfter teaching for ten years at George Watson's College, Frewin moved to Inverness. He married Ethel Gillespie and in June\n1936\na son was born. The announcement of the birth read:\n13\nJune\n1936\nat Inverness, on\n10\nJune\n1936\nto Ethel\n(\nnée Gillespie\n)\nwife of G Leslie Frewin a son\n."
}