{
  "nome_completo": "Gaspard Monge",
  "nome_curto": "Gaspard Monge",
  "ano_nascimento": "1746",
  "ano_morte": "1818",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Monge/",
  "lugar_nascimento": "Beaune, Bourgogne, France",
  "lugar_morte": "Paris, France",
  "biografia": "Gaspard Monge\nbecame the\nComte de Péluse\nlater in his life and he is sometimes known by this name. His father was Jacques Monge, a merchant who came originally from Haute-Savoie in southeastern France. Gaspard's mother, whose maiden name was Jeanne Rousseaux, was a native of Burgundy and it was in the town of Beaune in Burgundy that Gaspard was brought up. Around the time that Gaspard was born Beaune, after a period of decline, was becoming prosperous again due to the success of the wine trade.\nMonge attended the Oratorian College in Beaune. This school was intended for young nobles and was run by priests. The school offered a more liberal education than other religious schools, providing instruction not only in the humanities but also in history, mathematics, and the natural sciences. It was at this school that Monge first showed his brilliance. In\n1762\n, at the age of\n16\n, Monge went to Lyon where he continued his education at the Collège de la Trinité. Despite being only\n17\nyears of age at the time, Monge was put in charge of teaching a course in physics. Completing his education there in\n1764\n, Monge returned to Beaune where he drew up a plan of the city.\nThe plan of Beaune that Monge constructed was to have a major influence in the direction that his career took, for the plan was seen by a member of staff at the École Royale du Génie at Mézières. He was very impressed by Monge's work and, in\n1765\n, Monge was appointed to the École Royale du Génie as a draftsman. Of course, in this post Monge was undertaking tasks that were not entirely to his liking, for he aspired to a position in life which made far more use of his mathematical talents. However the École Royale du Génie brought Monge into contact with Charles\nBossut\nwho was the professor of mathematics there. At first Monge's post did not require him to use his mathematical talents, but Monge worked in his own time developing his own ideas of geometry.\nAbout a year after becoming a draftsman, Monge was given a task which allowed him to use his mathematical skill to attack the task he was given. Asked to draw up a fortification plan which prevented an enemy from either seeing or firing at a military position no matter what the position of the enemy, Monge devised his own graphical method to construct such a fortification rather than use the complicated methods then available. This method made full use of the geometrical techniques which Monge was developing in his own time. His mathematical abilities were now recognised at the École Royale du Génie and it was realised that Monge was someone with exceptional abilities in both theoretical and practical subjects.\nBossut\nwas elected to the\nAcadémie des Sciences\nin\n1768\nand he left the École in Mézières to become professor of hydrodynamics at the Louvre. On\n22\nJanuary\n1769\nMonge wrote to\nBossut\nexplaining that he was writing a work on the\nevolutes\nof curves of double curvature. He asked\nBossut\nto give an opinion on the originality and usefulness of the work. Bossut must have replied in a very positive fashion for in June a publication in the\nJournal Encyclopédique\nby Monge\n(\nhis first publication\n)\nappeared giving a summary of the results which he had obtained. This paper, in which Monge generalised the results obtained by\nHuygens\non space curves\n(\nas part of\nHuygens\n's investigation of the pendulum\n)\nand added many important new discoveries, is described in detail in\n[\n19\n]\n. The completed work was submitted to the\nAcadémie des Sciences\nin Paris in October\n1770\nand read before the\nAcadémie\nin August\n1771\n(\nalthough it was not published by the\nAcadémie\nuntil\n1785)\n.\nWhen\nBossut\nleft the École Royale du Génie at Mézières, Monge was appointed to succeed him in January\n1769\n. In\n1770\nhe received an additional post at the École Royale du Génie when he was appointed as instructor in experimental physics. Although this was a large step forward for Monge's career, he was more interested in making his name as a mathematician in the highest circles. Realising that he had to obtain advice from the leading mathematicians, Monge approached\nd'Alembert\nand\nCondorcet\nearly in\n1771\n.\nCondorcet\nmust have been impressed with the depth of the mathematics that Monge showed him, for he recommended that he present memoirs to the\nAcadémie des Sciences\nin each of the four areas of mathematics in which he was undertaking research.\nThe four memoirs that Monge submitted to the\nAcadémie\nwere on a generalisation of the\ncalculus of variations\n,\ninfinitesimal\ngeometry, the theory of\npartial differential equations\n, and combinatorics. Over the next few years he submitted a series of important papers to the\nAcadémie\non partial differential equations which he studied from a geometrical point of view. His interest in subjects other than mathematics began to grow and he became interested in problems in both physics and chemistry.\nIn\n1777\nMonge married Cathérine Huart and, since his wife had a forge, he became interested in metallurgy in addition to his wide range of mathematical and scientific interests. Still deeply involved in teaching at the École Royale du Génie at Mézières he organised the setting up of a chemistry laboratory there. From\n1780\n, however, he devoted less time to his work at the École at Mézières since in that year he was elected as adjoint géomètre at the\nAcadémie des Sciences\nin Paris. From that time he spent long periods in Paris, teaching a course in hydrodynamics as a substitute for\nBossut\nas well as participating in projects undertaken by the\nAcadémie\nin mathematics, physics and chemistry. It was not possible to do all this and to teach all his courses at Mézières but he kept his posts there and received his full salary out of which he paid others to teach some courses in his place.\nAfter three years of dividing his time between Paris and Mézières, Monge was offered yet another post, namely to replace\nBézout\nas examiner of naval cadets. Monge would have liked to keep all these positions, but after attempting to organise an impossible schedule for about a year, he decided that he would have to resign his posts in Mézières, which he did in December\n1784\n. Over the next five years, despite heavy duties as an examiner, Monge undertook research in a wide range of scientific subjects presenting papers to the\nAcadémie\non\n[\n1\n]\n:-\n...the composition of nitrous acid, the generation of curved surfaces, finite\ndifference equations\n, partial differential equations\n(1785)\n; double\nrefraction\nand the structure of Iceland spar, the composition of iron, steel, and cast iron, and the action of electricity sparks on carbon dioxide gas\n(1786)\n; capillary phenomena\n(1787)\n; and the causes of certain meteorological phenomena\n(1788)\n; and a study in physiological optics\n(1789)\n.\nOf course\n1789\nwas an eventful year in French history with the storming of the Bastille on\n14\nJuly\n1789\nmarking the start of the French Revolution. This was to completely change the course of Monge's life. At the onset of the Revolution he was one of the leading scientists in Paris with an outstanding research record in a wide variety of sciences, experience as an examiner and experience in school reforms which he had undertaken in\n1786\nas part of his duties as an examiner. Politically Monge was a strong supporter of the Revolution, and his first actions were to show his support by joining various societies supporting the Revolution, but he continued his normal duties as an examiner of naval cadets, and as a major figure in the work of the\nAcadémie\n. By this time he was on the major\nAcadémie\nCommission on Weights and Measures.\nLouis XVI attempted to flee the country on\n20\nJune\n1791\n, but was stopped at Varennes and brought back to Paris, and this put an end to attempts to share government between the king and an assembly. Relations with Europe deteriorated when the National Assembly declared that a people had the right of self-determination. France declared war on Austria and Prussia on\n20\nApril\n1792\n. French defeats led to unrest in France and, on\n10\nAugust\n1792\n, there was further revolutions by the people with nobles and clergy murdered during September. On\n21\nSeptember the monarchy was abolished in France and a republic was declared. Monge was offered the post of Minister of the Navy in the government by the National Convention.\nWithout disrespect to Monge, it was impossible to satisfy the quite extreme views of many people, and Monge's period as Minister of the Navy cannot be viewed as a success. Although he tried hard in difficult circumstances, he survived only eight months in the post before he gave up the incessant battle with those around him, and he submitted his resignation on\n10\nApril\n1793\n. For a few months Monge returned to his work with the\nAcadémie des Sciences\nbut this did not last long for, on\n8\nAugust\n1793\n, the\nAcadémie des Sciences\nwas abolished by the National Convention.\nStill a strong republican and supporter of the Revolution, Monge worked on various military projects relating to arms and explosives. He wrote papers on the topics and also gave courses on these military topics. He continued to serve on the Commission on Weights and Measures which survived despite ending the\nAcadémie des Sciences\n. He also proposed educational reforms to the National Convention but, despite being accepted on\n15\nSeptember\n1793\n, it was rejected on the following day. Such was the volatile nature of decisions at this unstable time.\nMonge was appointed by the National Convention on\n11\nMarch\n1794\nto the body that was put in place to establish the École Centrale des Travaux Publics\n(\nsoon to become the École Polytechnique\n)\n. Not only was he a major influence in setting up the École using his experience at Mézières to good effect, but he was appointed as an instructor in descriptive geometry on\n9\nNovember\n1794\n. His first task as instructor was to train future teachers of the school which began to operate from June\n1795\n. Monge's lectures on infinitesimal geometry were to form the basis of his book\nApplication de l'analyse à la géométrie\n.\nAnother educational establishment, the École Normale, was set up to train secondary school teachers and Monge gave a course on descriptive geometry. He was also a strong believer in the\nAcadémie des Sciences\nand worked hard to see it reinstated as the Institut National. The National Convention approved the new body on\n26\nOctober\n1795\n. However from May\n1796\nto October\n1797\n, Monge was in Italy on a commission to select the best art treasures for the conquerors and bring them to France. Of particular significance was the fact that he became friendly with Napoleon Bonaparte during his time in Italy. Napoleon had defeated Austria and signed the Treaty of Campo Formio on\n17\nOctober\n1797\nwhich was an exceptionally good treaty for France, preserving most of the French conquests. Monge returned to Paris bringing the text of the Treaty of Campo Formio with him.\nBack in Paris Monge slotted back into his previous roles and was appointed to the prestigious new one of Director of the École Polytechnique. By February\n1798\nMonge was back in Rome, involved with the setting up of the Republic of Rome. In\n[\n17\n]\nthe author describes these events using letters which Monge sent to his wife from Rome at that time. In particular Monge proposed a project for advanced schools in the Republic of Rome. Napoleon Bonaparte now asked Monge to join him on his Egyptian expedition and, somewhat reluctantly, Monge agreed.\nMonge left Italy on\n26\nMay\n1798\nand joined Napoleon's expeditionary force. The expedition, which included the mathematicians\nFourier\nand\nMalus\nas well as Monge, was at first a great success. Malta was occupied on\n10\nJune\n1798\n, Alexandria taken by storm on\n1\nJuly, and the delta of the Nile quickly taken. However, on\n1\nAugust\n1798\nthe French fleet was completely destroyed by Nelson's fleet in the Battle of the Nile, so that Napoleon found himself confined to the land that he was occupying. Monge was appointed president of the Institut d'Egypte in Cairo on\n21\nAugust. The Institut had twelve members of the mathematics division, including\nFourier\n, Monge,\nMalus\nand Napoleon Bonaparte. During difficult times with Napoleon in Egypt and Syria, Monge continued to work on perfecting his treatise\nApplication de l'analyse à la géométrie\n.\nNapoleon abandoned his army and returned to Paris in\n1799\n, he soon held absolute power in France. Monge was back in Paris on\n16\nOctober\n1799\nand took up his role as director of the École Polytechnique. He discovered that his memoir\nGéométrie descriptive\nⓉ\n(\nDescriptive geometry\n)\nhad been published earlier in\n1799\n. This had been done at his wife's request and had been put together by\nHachette\nfrom Monge's lectures at the École Normale. On\n9\nNovember\n1799\nNapoleon and two others seized power in a coup and a new government, the Consulate, was set up. Napoleon named Monge a senator on the Consulate for life. Monge accepted with pleasure, although his republican views should have meant that he was opposed to the military dictatorship imposed by Napoleon on France. The truth must be that Monge was\n[\n1\n]\n:-\n... dazzled by Napoleon ... and accepted all the honours and gifts the emperor bestowed upon him: grand officer of the Legion of Honour in\n1804\n, president of the Senate in\n1806\n, Count of Péluse in\n1808\n, among others.\nOver the next few years Monge continued a whole range of activities, undertaking his role as a senator while maintaining an interest in research in mathematics but mostly his mathematical work involved teaching and writing texts for the students at the École Polytechnique. Slowly he became less involved in mathematical research, then from\n1809\nhe gave up his teaching at the École Polytechnique as his health began to fail.\nIn June\n1812\nNapoleon assembled his Grande Armée of about\n453\n,\n000\nmen, including men from Prussia and from Austria who were forced to serve, and marched on Russia. The campaign was a disaster but by September Napoleon's army had entered a deserted Moscow. Napoleon withdrew, the Prussians and Austrians deserted the Grande Armée and in there were attempts at a coup against Napoleon in Paris. Monge was dismayed at the situation and his health suddenly collapsed. Slowly his health returned after Napoleon left the remains of his army and returned to Paris to assert his authority. After Napoleon had some military success in\n1813\n, the allied armies against him strengthened. Monge was sent to Liège to organise the defence of the town against an attack.\nThe allied armies began to move against France and Monge fled. When Napoleon abdicated on\n6\nApril\n1814\n, Monge was not in Paris, but soon after he did return and tried to pick up his life again. Napoleon escaped from Elba, where he had been banished, and by\n20\nMarch\n1815\nhe was back in Paris. Monge immediately rallied to Napoleon and gave him his full support. After Napoleon was defeated at Waterloo, Monge continued to see him until he was put on board a ship on\n15\nJuly. By October Monge feared for his life and fled from France.\nMonge returned to Paris in March\n1816\n. Two days after his return he was expelled from the Institut de France and from then on his life was desperately difficult as he was harassed politically and his life was continually threatened. On his death the students of the École Polytechnique paid tribute to him despite the insistence of the French Government that no tributes should be paid.\nIn\n[\n9\n]\nMonge's political career is treated kindly but G Jorland, in a review of that paper, takes a harder view:-\n[\nMonge's\n]\ntenure at the Ministry of the Navy was a complete failure and he presided over the cultural pillage of Italy and Egypt. If Napoleon actually said that Monge loved him like a mistress, it proves that the utmost mathematical clarity can go hand in hand with political blindness.\nWe have commented quite frequently regarding Monge's scientific work above. He is considered the father of\ndifferential geometry\nbecause of his work\nApplication de l'analyse à la géométrie\nwhere he introduced the concept of lines of curvature of a surface in\n3\n-dimensional space. He developed a general method of applying geometry to problems of construction. He also introduced two planes of projection at right angles to each other for graphical description of solid objects. These techniques were generalised into a system called géométrie descriptive, which is now known as orthographic projection, the graphical method used in modern mechanical drawing.\nThe basic philosophy behind Monge's approach to mathematics is discussed in\n[\n13\n]\nwhere the author states that Monge's aims were the:-\n... geometrisation of mathematics based on:\n(\na\n)\nthe analogy or correspondence of operations in analysis with geometric transformations;\n(\nb\n)\nthe genetic classification and parametrisation of surfaces through analysis of the movement of generating lines.\nMonge regarded analysis as being\n[\n13\n]\n:-\n... not a self-contained language but merely the 'script' of the 'moving geometrical spectacle' that constitutes reality.\n...\n[\nHis\n]\nnew approach addressed itself to the most profound, intimate and universal relations in space and their transformations, putting him in a position to interconnect geometry and analysis in a fertile, previously unheard-of fashion. Practical concerns induced Monge to perceive the object and function of mathematics in a new way, in violation of the formalistic\n(\nlinguistic\n)\nstandards set by the approved patrons of mathematics ..."
}