{
  "nome_completo": "Gene Howard Golub",
  "nome_curto": "Gene Golub",
  "ano_nascimento": "1932",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Golub/",
  "lugar_nascimento": "Chicago, USA",
  "lugar_morte": "Stanford, USA",
  "biografia": "Gene Golub\n's mother was Bernice Gelman and his father was Nathan Golub. Bernice was from Latvia and emigrated to the United States in\n1923\n, going to Chicago where her sister lived. Nathan was from Zhitomir in  Ukraine and he also emigrated to the United States in\n1923\n, also going to Chicago where he had a brother. Both Nathan and Bernice were Jewish. They were not well educated, coming from relatively poor families. They met for the first time in Chicago and later married, having two sons with Alvin the older and Gene the younger. The language spoken in their home was Yiddish but, after he began his schooling, his parents tried to speak English on occasions. Golub spoke of his upbringing\n[\n3\n]\n:-\nMy father, through the years that I can remember, sold bread. ... He would get up early in the morning and collect lots of bread from the bakery and then distribute it either to homes or to mom-and-pop shops. His day was somewhat different - he didn't work on Saturday, this was a Jewish bakery. My mother went to work when I was about five years old and going to kindergarten. In fact, I went to kindergarten just a half-year earlier than necessary because my mother wanted to go to work. She worked in making boys' caps. That was a big industry in Chicago then. ... She spent a good part of her life sewing the interiors of baseball caps.\nGolub's home was not in the Jewish area of Chicago, but he attended Haugan Elementary School which was in the Jewish area. Especially after World War II began, he suffered anti-Semitism and had a stressful journey to school every day. From the age of twelve he attended Roosevelt Junior High School which involved a longer journey each day. He spoke of the school\n[\n3\n]\n:-\nThere were some good teachers and a lot of poor teachers, too. Maybe they faced discipline problems, but I don't think we were especially difficult kids. It was a nice school. It was boys and girls all together; it was coed. I had friends, but almost nobody was interested in science.\nHe proved to be a reasonably good pupil but in no way stood out although mathematics was his best subject. One reason for not shining at school may have been that he had to work to make money which he did selling shoes and working in a pharmacy. The family were too poor to let him buy tickets to attend concerts and the theatre so he worked as an usher to see performances a few times a year. After four years at Roosevelt Junior High School he decided that he would like to be a teacher. The family could not afford to provide funds for him to live away from home so his options were limited. He entered Wright Junior College, spending two years there. He then matriculated at the University of Chicago, still living at home. This gave him two problems. First he had a journey of about and hour and a half to reach the university so this gave him three hours travelling time each day. Second his education up to that point had not prepared him well for a university course. There were other problems too; he had no room of his own at home so studying was difficult. He decided to leave home and complete his university studies at the University of Illinois where one of his friends had gone. He graduated with a B.S. in the spring of\n1953\n.\nIn his final semester Golub had taken the Digital Computer Programming course and he was offered a position as an assistant in the computing laboratory. In addition to this half-time position he took courses for his Master's Degree. He was awarded his M.A. in mathematical statistics in\n1954\n. A report written on his achievements as a part-time research assistant for the first six months of\n1954\nreads:-\nMr Golub has been studying the problems associated with factor analysis and is also working on other problems associated particularly with matrix operations. He has programmed Rao's Maximum Likelihood Factor Analysis Method, and has obtained new results, which he will publish. This summer, he presented a paper on tests of significance in factor analysis at the International Psychological Congress in Montreal, and in September will present another at the meeting of the American Psychological Association in New York.\nHad it not been for the Korean War, Golub may have ended his education at this point but remaining at the University of Illinois to study for a doctorate allowed him to get a draft deferment. He then undertook research for a doctorate with Abraham Taub as his thesis advisor. He was awarded a Ph.D. in\n1959\nfor his thesis\nThe Use of Chebyshev Matrix Polynomials in the Iterative Solution of Linear Equations Compared to the Method of Successive Overrelaxation\nwhich developed ideas in a paper by\nvon Neumann\n. Golub criticised his thesis supervisor\n[\n3\n]\n:-\nTaub didn't know that field so well himself. He just put me into it. So I was no longer doing statistics, although I was getting my degree in statistics, I was doing numerical analysis. ... I was subject to a lot of abuse by Taub. He would just yell and scream at me. ... I think the weaker you are as a person, the more he hammered at you. He was really a nasty piece. At any rate, I finished the thesis.\nFollowing the award of his doctorate, Golub had a number of short-term posts. During\n1959\n-\n60\nhe was an NSF Fellow at the Mathematical Laboratory at the University of Cambridge in England. There he worked with Maurice Wilkes' EDSAC II group, sharing an office with William Kahan. During that year he collaborated by mail with\nR S Varga\non his first major paper\nChebyshev semi-iterative methods, successive over-relaxation iterative methods, and second-order Richardson iterative methods\nwhich they published in two parts in\n1961\n. Returning to the United States he was employed at University of California, Lawrence Radiation Laboratory during\n1960\n-\n61\n, then spent\n1961\n-\n62\nas a member of the technical staff of the Space Technology Laboratories, Inc. The next two years,\n1962\n-\n64\n, he spent as Visiting Assistant Professor in the Computer Science Division at Stanford University. He was invited by Eugene Isaacson to spend the year\n1965\n-\n66\nat the\nCourant\nInstitute of Mathematical Sciences, New York University where he was an Adjunct Assistant Professor. After this year he returned to Stanford University as an Associate Professor. He spent the rest of his career at Stanford, being promoted to full professor in\n1970\n. He was Chairman of the Stanford University Computer Science Department during\n1981\n-\n84\n.\nAfter publishing a few papers such as\nBounds for eigenvalues of tridiagonal symmetric matrices computed by the LR method\n(1962)\n,\nBounds for the round-off errors in the Richardson second order method\n(1962)\n,\nOn a lower bound for the rank of a partitioned square matrix\n(1963)\n, and\nComparison of the variance of minimum variance and weighted least squares regression coefficients\n(1963)\n, his next highly significant work was\nNumerical methods for solving linear least squares problems\n(1965)\n. He said\n[\n3\n]\n:-\nThat paper had a great influence on a lot of people, even though it in some sense was well-known before. For instance, Lawson and Hanson referred to that very often.\nIt is impossible in an article such as this to give a full description of his work for he was extremely prolific publishing over\n250\nbooks and papers. We simply look briefly at some of his books. In\n1983\nhe published\nMatrix computations\nwritten jointly with Charles F Van Loan:-\nNumerical linear algebra is a large and expanding subject which has a growing impact in mathematics and computer science. As the authors declare in the preface, they have written the present book in order to impart a sense of unity to this exciting field.\nIn\n1980\nGolub lectured on the numerical solution of large linear systems at a summer school in France. The lectures formed the basis of the book\nRésolution numérique des grands systèmes linéaires\npublished in\n1983\nas a joint work with Gérard A Meurant who filled in many details and proofs. The main topics covered are the method of least squares, fast\nPoisson\nsolvers, and iterative methods.\nIn\n1992\nGolub, jointly with James M Ortega, published\nScientific computing and differential equations\n. The authors write in the Preface:-\nA large part of scientific computing is concerned with the solution of differential equations, and thus differential equations are an appropriate focus for an introduction to scientific computing. The need to solve differential equations was one of the original and primary motivations for the development of both analog and digital computers, and the numerical solution of such problems still requires a substantial fraction of all available computing time. It is our goal in this book to introduce numerical methods for both ordinary and partial differential equations with concentration on ordinary differential equations, especially boundary value problems. Although there are many existing packages for such problems, or at least for the main subproblems such as the solution of linear systems of equations, we believe that it is important for users of such packages to understand the underlying principles of the numerical methods. Moreover, it is even more important to understand the limitation of numerical methods: 'black boxes' cannot solve all problems. Indeed, it may be that one has several excellent black boxes for solving classes of problems, but the combination of such boxes may yield less than optimal results.\nThe same two authors published\nScientific computing: An introduction with parallel computing\nin the following year. Translations of these two books into German appeared in\n1995\nand\n1996\n. Then in\n2005\n, jointly with Moody T Chu, Golub published\nInverse eigenvalue problems: theory, algorithms, and applications\n.\nThe list of honours Golub received for his outstanding contributions is too long to list here. Let us simply list those universities that awarded him an honorary degree: Linköping University\n(1984)\n, University of Grenoble\n(1986)\n, University of Waterloo\n(1987)\n, The University of Dundee\n(1987)\n, University of Illinois\n(1991)\n, Universitat Louvain\n(1992)\n, University of Umea, Sweden\n(1995)\n, Australian National University\n(1996)\n, Rostov State University, Rostov, Russia\n(2002)\n, Hong Kong Baptist University\n(2002)\n.\nHe had accepted an honorary degree from Eidgenössische Technische Hochschule Zürich\n(\nETH\n)\nwhich he was due to receive on\n17\nNovember\n2007\n, the day after he died. The events surrounding his death are described by Philipp Birken:-\nOn his trip to China two weeks ago, Gene had apparently got flu, which was readily fixed by a doctor with antibiotics. However, his condition got worse nevertheless, he was feeling generally unwell and in particular his legs hurt very much. On Sunday, I drove him to the hospital, where they thought that he had a thrombosis from the long distance flight and kept him there for further tests. Still, he was hoping he could fly to Zürich on Wednesday, as he was very excited about the honorary degree the ETH was going to award him. On Tuesday, they diagnosed Leukemia. They gave him a life expectancy of half a year if he chose a light treatment or much longer if he opted for a four weeks chemotherapy. His situation worsened unexpected and dramatically during the night from Thursday to Friday and he passed away in the morning in the presence of some of his best friends.\nAs to Golub's personality, Trefethen writes in\n[\n5\n]\n:-\nGolub was a bachelor for most of his life, and his colleagues were his family. No family ever had a more loving, attentive or exasperating father. As he liked to say, \"Every numerical analyst has a second home at Stanford\". Countless colleagues enjoyed a glass of wine at his home there, and hundreds of them stayed over for a night or even a month at his invitation. How did he remember all our birthdays and reading tastes and children's names? Golub could not spend a day without other people. He would eat dinner with them, talk matrices with them, organize conferences with them, write papers and books with them, argue academic politics with them - an endless dance of interactions, plans and projects. Anywhere in the world, a numerical analyst knows who is meant by 'Gene'. About\n250\nof them were his co-authors. They knew that it would fall to them to do most of the writing; but Golub saw the connections, knew the literature, and made the paper happen. ... Gene Golub was restless and never entirely happy. He was a demanding friend; behind his back, we all had Gene stories to tell. It was a huge back: Gene was big, dominating any room he was in, and grew more impressive and imposing with the years. Graduate students around the world admired and loved him, and he bought them all dinner when he got the chance."
}