{
  "nome_completo": "George Olatokunbo Okikiolu",
  "nome_curto": "George Olatokunbo Okikiolu",
  "ano_nascimento": "1941",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Okikiolu_George/",
  "lugar_nascimento": "Aba, Nigeria",
  "lugar_morte": null,
  "biografia": "George Olatokunbo Okikiolu\nwas the son of James Adekunle Okikiolu\n(1907\n-\n1998)\nand Anwan Obong\n(1911\n-\n1970)\n. James Okikiolu was a Yoruba from Abeokuta in Western Nigeria while Anwan was a daughter of the Obong of Calabar, a title which essentially means the King of Calabar. James was a medical doctor and he met Anwan, who had trained as a nurse, while both of them were working in a hospital in Abeokuta in Western Nigeria. At this time Nigeria was a British colony and most of the doctors and other staff in the hospital were British. George had a twin sister Elizabeth O Okikiolu. Their parents gave their children the names George and Elizabeth after the recently crowned king and queen of Great Britain.\nOkikiolu explained about his early education and upbringing in\n[\n1\n]\n:-\nAfter early primary schooling in Lagos and at Ibadan, my secondary schooling was at Baptist Boys' High School in Abeokuta, where I lived during term times. I was often away from school to recuperate at home from feverish complaints, but I made sure my performance at school was not below my usual best. Although my childhood experiences in and around hospitals made me feel that I would like to grow up to be a medical doctor, my interests in mathematics and the physical sciences had developed, and I pursued those subjects at university ...\nIn\n1959\nGeorge, his twin sister Elizabeth, and a younger brother Victor O Okikiolu\n(\nborn\n6\nMay\n1944)\nsailed from Lagos to England on the ship\nAureol\n. After calling at Takoradi and Freetown, they arrived in Liverpool, England, on\n13\nJuly\n1959\n. They all give the address at which they will first reside as\n24\nThornton Lodge Road, Huddersfield, Yorkshire. George and his twin sister Elizabeth took accommodation at\n29\nRavenshaw Street, Hampstead, London, and George Okikiolu matriculated at Sir John Cass College on Jewry Street. This College, which has an interesting history, had been the Sir John Cass Technical Institute from\n1902\nto\n1950\nwhen it changed its name to the Sir John Cass College in recognition of its broadening provision of courses. The College could not award degrees but it delivered courses which were aimed at students taking the University of London examinations to qualify for a University of London external degree. The college is now part of the Metropolitan University of London.\nWhile studying mathematics at the Sir John Cass College, Okikiolu met a fellow student, an English girl Patricia Natasha Edwards\n[\n2\n]\n:-\n... from a family with a trade-union background and a central interest in class struggle.\nGeorge and Patricia Okikiolu were married on\n19\nSeptember\n1962\n. After the marriage Okikiolu, his wife, and his sister, all lived at\n29\nRavenshaw Street, Hampstead. In\n1963\nOkikiolu graduated with a B.Sc. degree with First Class Honours in Mathematics, from the University of London. Later that same year, on\n30\nDecember, he submitted his first paper for publication to the\nLondon Mathematical Society\n. The paper,\nA generalisation of the Hilbert transform\n, was published in the Journal of the\nLondon Mathematical Society\nin\n1965\n. His address on the paper is Department of Mathematics, Sir John Cass College, Jewry Street, London.\nAfter the award of his first degree, in\n1964\nOkikiolu accepted an assistant lectureship at Battersea College, London, while continuing to study for a Master's Degree from the University of London. In his Master's thesis on real and complex variable analysis, he looked in particular at lower densities in measure theory. He was awarded an M.Sc. in\n1964\n. While on the one-year appointment at Battersea College, Okikiolu applied for assistant lectureships in various universities and was offered an appointment at the University of Sussex. He began teaching there in the autumn of\n1965\n. His second daughter was born shortly before he took up the appointment at the University of Sussex so let us comment briefly about his two children. We note that by\n1965\nonly Elizabeth Okikiolu is at\n29\nRavenshaw Street, Hampstead, while George and Patricia Okikiolu were living at\n11\nBeverley Gardens, Richmond upon Thames, England.\nGeorge and Patricia Okikiolu's first child was Jeannie Adetokunbo Okikiolu. She was awarded an MA from the University of Cambridge where she studied mathematics. She trained as a chartered accountant before working as a forensic accountant. Their second daughter, Katherine Adebola Okikiolu\n(\nborn\n1965)\n, known at\nKate Okikiolu\n, became a mathematician and has a biography in this archive.\nAfter one year at the University of Sussex, Okikiolu was offered an appointment at the University of East Anglia in Norwich, Suffolk, which he took up in\n1966\n. Okikiolu did not write a Ph.D. thesis but published extensively in the leading mathematical journals. His paper\nOn integral operators associated with the Hilbert transform\n, where he gives the address Mathematics Division, The University of Sussex, Brighton\n(\nEngland\n)\n, was submitted for publication\n17\nMarch\n1965\nand published later that year. On\n24\nJune\n1965\nhe submitted the paper\nFourier transforms and the operator\nH_{Â±}\n. It appeared in\n1966\nwith the following abstract:-\nThis is one of a number of papers in which the author studies the properties of the transformÂ\nH_{Â±}(f)\nand allied operators. In this case, identities involving these operators and the\nFourier\ntransform are obtained, and these are applied in giving alternative proofs to certain inversion processes derived by the author elsewhere.\nIndeed it was one of \"a number of papers\", being one of the nine papers that Okikiolu published in\n1966\n. One of these papers,\nBounded linear transformations inÂ L\np\n-space\n, was submitted to the\nLondon Mathematical Society\non\n19\nOctober\n1964\nand was published in the Journal of the\nLondon Mathematical Society\nin\n1966\n. It has two addresses, Mathematics  Division, The University of Sussex, Falmer, Brighton, and University of East Anglia, Norwich.\nKate Okikiolu\nwrites\n[\n2\n]\n:-\nMy father ... went on to a position in the mathematics department of the University of East Anglia. While I was growing up, the elementary school I attended was extremely ethnically homogeneous. I was unable to escape from heavy issues concerning race, which my mother always explained in a political context.\nBy\n1970\nOkikiolu had published\n24\npapers and was writing the book\nAspects of the Theory of Bounded Integral Operators in L\np\nSpaces\n, which was published by\nAcademic Press\nin\n1971\n. The Preface to the book begins as follows:-\nIn this text I have endeavoured to present a fairly detailed account of some of the techniques usually employed in the study of integral operators in L\np\n-spaces. The methods apply to various special operators, some of which are treated in detail. Although most of the book is concerned with L\np\n-spaces and operators in L\np\n-spaces, I have introduced, in the first chapter, some of the basic results in normed linear spaces which apply in particular to L\np\n-spaces. The second chapter contains a treatment of measures on measure spaces and the\nLebesgue\nintegral. These chapters, which are introductory, may be omitted by the reader who is familiar with the general theory; they have been included to make the book to a large extent self-contained, and will be found suitable for undergraduate students studying analysis in their last year at university. The chapters also provide an introduction for the graduate student in the subjects treated.\nThe other chapters of the book are arranged as follows:\nChapter\n3\ndeals with most of the result involving L\np\n-spaces which will be applied in considering operators. This chapter, which is a sequel to Chapter\n2\n, contains some of the basic results used in the proofs of conclusions in subsequent chapters.\nIn Chapter\n4\n, the general inequalities which justify the boundedness of some integral operators in L\np\n-spaces are considered. These include some results which have previously not appeared in books, as do some later chapters. The inequality of\nYoung\nfor convolutions of functions defined on Euclidean spaces is derived as a special case of a general inequality from which other well-known results may also be obtained. Also included here are the inequalities for homogeneous  kernels; extensions of the well-known inequality of\nSchur\n, which have proved useful for treating fractional integrals and allied transforms. Among the general theorems are results involving convolution operators which approximate to the identity. Various identities and inversion processes are also included.\nThe results of Chapter\n5\nare concerned mainly with the theory of interpolation of bounded operators between L\np\n-spaces, and the theory of rearrangements of functions. Having treated the\nRiesz\n-Thorin convexity theorem and one of its extensions, the\nMarcinkiewicz\n-\nZygmund\ninterpolation theorem is considered after a preliminary treatment of distribution functions. Most of the detailed analysis involving the non-increasing rearrangements of functions is considered in this chapter ...\nOkikiolu took his\n24\npapers and this book and submitted them to the University of London for a D.Sc. which he was awarded in\n1971\n. In\n1972\nhe set up the Okikiolu Science and Industrial Organisation, London, and began to create inventions and apply for patents for them. By\n1974\n, unhappy that he was not being promoted to a professorship despite having published around\n30\npapers in the ten years\n1965\n-\n74\n, he decided to resign his university appointment and concentrate on his inventions. In fact his paper\nUniformly bounded projections and semi-groups of operators\n, published in\n1974\n, gives his address as Okikiolu Science and Industrial Organisation,\n23\nÂ Mile End Road,Â Norwich. Since we mention this paper, let us give its Abstract:-\nClasses of operators called uniformly bounded projections defined on Banach spaces have been formally introduced, and their connexions with semi-groups of operators considered. Notable cases of such operators include the Dirichlet integrals which are connected with the semi-group of Poisson operators inÂ L\np\n.Â In the main conclusions of this paper, there is an exposition of the connexion between classes of uniformly bounded projections and semi-groups of operators. In particular, it is shown that certain uniformly bounded analytic semi-groups of operators give rise to classes of uniformly bounded projections. Various of the known special cases inÂ L\np\nÂ are also considered as Fourier transform multiplier operators with characteristic functions of intervals as multipliers.\nHis daughter\nKate Okikiolu\nwrites\n[\n2\n]\n:-\nMy parents separated after my father resigned his university position to focus on his inventions, and my mother then finished her education and became a school mathematics teacher. We moved to a very cosmopolitan area of London, which was like a new birth for me; it was there that my interest in mathematics really began.\nOkikiolu and his wife separated in\n1974\nand were formally divorced in\n1980\n.\nIn\n[\n1\n]\nOkikiolu writes about his inventions:-\nMy initial inventions included a proton extractor, electro-chemical oscillator, and magnetic-wave generator, but they were not very promising for commercial development, so I considered other new ideas. Two of my main inventive projects include photoconverter technology and television cameras for infrared and other wave forms. Television cameras for various wave forms relate especially to some of my inventions which operate as remote effect devices involving systems for generating pressure waves affecting human subjects. Other notable inventions include polarvisible inscriptions, which are visible only to viewers equipped with suitable polarizer elements; linear and rotary motor assemblies; light-operated photocell-inductor motors for operating electrical generators; hydraulic projections of electrical terminals for various electrical effects; various forms of television assemblies; composite motor-generators for electrical equipment and electrical vehicles; and nuclear fusion systems. By\n1975\n, I had accumulated and published twenty-five United Kingdom patent specifications. As with some forms of industrial developments, productions relating to my inventive projects have been limited by financial considerations.\nDespite this work on inventions, Okikiolu continued to published many mathematical papers and books. His two volume work,\nSpecial integral operators\n, was published in\n1980\n,\n1981\nby his own Okikiolu Science and Industrial Organisation. The two volumes, of around\n300\nand\n500\npages respectively, are subtitled\nWeierstrass operators and related integrals\nand\nPoisson operators, conjugate operators, and related integrals\n. He had published a small book in\n1976\n, namely\nCompletion of the Magic Square of Even Order\n, again published by his own Organisation.\nIn\n1981\nOkikiolu began publishing a mathematical journal with the title\nBulletin of Mathematics\n. By\n1986\ntwenty-one parts had been published each part containing\n2\n,\n3\nor\n4\npapers by Okikiolu. The journal stopped publication in\n1986\nand by that time Okikiolu had published around\n60\npapers in it. Only one paper by a mathematician other than Okikiolu  appears to have been published in this journal. In\n1989\nhe published another book, namely\nDivisibility and Numbers\n. In\n[\n1\n]\nhe writes:-\nIn\n1990\n, I commenced publication of my books ...\nbut we have been unable to find any books published by Okikiolu after\n1989\n."
}