{
  "nome_completo": "George Peacock",
  "nome_curto": "George Peacock",
  "ano_nascimento": "1791",
  "ano_morte": "1858",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peacock/",
  "lugar_nascimento": "Thornton Hall, Denton, County Durham, England",
  "lugar_morte": "Pall Mall, London, England",
  "biografia": "George Peacock\n's father was the Rev Thomas Peacock, a Church of England priest who was for\n50\nyears the perpetual curate at Denton, near Darlington, County Durham, where he also ran a local school. Thomas Peacock married Ann Hodgson, the daughter of John Hodgson of Denton and his wife Ann, on\n9\nNovember\n1781\n. They had several children but Ann Peacock died young and Thomas Peacock remarried on\n2\nMay\n1789\n. His second wife, Jane Thompson, was the mother of his fifth son, George, the subject of this biography. His final child, and third daughter, Hannah Mary Anne Peacock was born to Thomas and Jane Peacock on\n12\nFebruary\n1798\n. The year that George Peacock was born,\n1791\n, and the year\n1798\nthat his eighth and final child Hannah were born were the years in which Thomas Peacock published mathematics books. These were\nThe tutor's assistant modernised\n(1791)\nand\nThe Practical Measurer\n(1798)\n. The full titles of these books are:-\nThe tutor's assistant modernised\nor: A regular system of practical arithmetic: comprising of all the modern improvements in that art, that are necessary for the man of business and the practical scholar.\nand\nThe Practical Measurer\ncontaining the Uses of Logarithms, Gunter's Scale, the Carpenter's Rule, and the Sliding Rules: the best and most approved Modes of drawing Geometrical Figures: the Doctrine of Plane Trigonometry and its Application to Heights and Distances: the Mensuration of Superficies, Solids, and Artificers' Works; and the Methods of Surveying, Planning, and Dividing Land.\nWe give the Preface to\nThe tutor's assistant modernised\nat\nTHIS LINK\n.\nGeorge was educated at home by his father and, because of his father's mathematical interests, it is clear that George must have received a good grounding in mathematics from a skilled teacher. Then he attended Sedbergh School until he was\n17\nyears old when, in\n1808\n, he entered Richmond School, Yorkshire\n(\nRichmond is one of the nearest towns to Denton\n)\nto prepare for entering the University of Cambridge. The master of Richmond School was James Tate, a former fellow of Sidney Sussex College, Cambridge, who had a excellent reputation in training boys for Cambridge. Only elementary mathematics was necessary for entry to Cambridge so, although he knew more advanced material, George excelled in the elementary topics taught at Richmond. He also distinguished himself in classics where the much more advanced level allowed him to show his great potential. Peacock completed his schooling in\n1809\n, being ranked as the top student. He was admitted as a\nsizar\nat Trinity College, Cambridge, on\n21\nFebruary\n1809\n. He was coached during the summer by John Brass, an undergraduate at Trinity College, Cambridge, who was taking the Mathematical Tripos. In the autumn of\n1809\nPeacock matriculated as a student at Trinity College, Cambridge.\nAs an undergraduate at Cambridge he made friends with\nJohn Herschel\nand\nCharles Babbage\n. In fact it was through a common friend, Edward Bromhead, that they first met on\n7\nMay\n1811\n. Bromhead\n[\n29\n]\n:-\n... invited a small group to meet in his rooms to discuss the possible formation of a society whose aim would be to encourage the study of analytical methods in Cambridge. It was then that\nBabbage\n,\nHerschel\nand Peacock first met each other. Feeling at the meeting was favourable to the formation of a society and the formal inaugural meeting of the Analytical Society took place very shortly afterwards. ... Bromhead played no subsequent role of any importance in the Cambridge reform movement ... It is clear that Cambridge needed the Analytical Society to bring together the young reformers. Its formation sparked off feverish activity among the leaders.\nWe note that there is some argument between historians over the date the Analytic Society was formed.\nBabbage\nclaimed it was in\n1812\n, but the general view is that he misremembered the year and in fact it was\n1811\n. In\n1812\nPeacock graduated, placed second to\nJohn Herschel\nin the Mathematical Tripos examinations. He also won the second Smith's prize. In\n1814\nPeacock was awarded a fellowship to Trinity and, in the following year, he became a tutor and lecturer in Trinity College.\nIn\n1816\nthe Analytical Society produced a translation of\nSylvestre Lacroix\n's\nTraité élémentaire de calcul differéntiel et du calcul intégral\n(1802)\nwhich was written in the Continental style for the differential and integral calculus. The English translation appeared under the title\nAn Elementary Treatise on the Differential and Integral Calculus\n(1816)\nand contained over\n100\npages of added notes by Peacock and\nHerschel\n.\nBabbage\n,\nHerschel\nand Peacock began to work on this translation when the Analytic Society was formed, so it is reasonable to ask why it took so long for the translation to appear. The reason for the delay seems to have been due to Peacock who, although a keen supporter of the\nd\ny\nd\nx\n\\Large\\frac{dy}{dx}\\normalsize\nd\nx\nd\ny\n​\nnotation, found other aspects of\nLacroix\n's book not to his liking.\nBabbage\n,\nHerschel\nand Peacock certainly, although agreeing a common aim with the Analytical Society, nevertheless had rather different views on mathematics itself and how it should be taught. Only after the addition of the copious notes was Peacock happy to publish the book. The following year,\n1817\n, Peacock was moderator of the Mathematical tripos examinations at Cambridge and used his position to further his reforms setting examinations using\nLeibniz\n's calculus notation.\nWilliam Whewell\nwrote to\nHerschel\nin March\n1817\n(\nsee\n[\n29\n]\n)\n:-\nYou have I suppose seen Peacock's examination papers. They have made a considerable outcry here and I have not much hope that he will be moderator again. I do not think he took precisely the right way to introduce the true faith. He has stripped his analysis of its applications and turned it naked among them. Of course all the prudery of the University is up and shocked at the indecency of the spectacle. The cry is 'not enough philosophy'. Now the way to prevent such a clamour would have been to have given good, intelligible, but difficult physical problems, things which people would see that they could not do their own way and which would excite their curiosity sufficiently to make them thank you for your way of doing them.\nPeacock responded to criticism that he received, writing to one of his friends saying\n(\nsee\n[\n21\n]\n, or\n[\n23\n]\n)\n:-\nI assure you that I shall never cease to exert myself to the utmost in the cause of reform, and that I will never decline any office which may increase my power to effect it. I am nearly certain of being nominated to the office of Moderator in the year\n1818\n-\n19\n, and as I am an examiner in virtue of my office, for the next year I shall pursue a course even more decided than hitherto, since I shall feel that men have been prepared for the change, and will then be enabled to have acquired a better system by the publication of improved elementary books. I have considerable influence as a lecturer, and I will not neglect it. It is by silent perseverance only, that we can hope to reduce the many-headed monster of prejudice and make the University answer her character as the loving mother of good learning and science.\nWe note that he was moderator of the tripos again, namely in\n1819\nand in\n1821\n. He was influenced, however, by a visit of\nJean-Baptiste Biot\nto Cambridge in\n1818\n.\nBiot\nargued that French mathematicians had neglected the applications of the calculus that\nIsaac Newton\nhad introduced. In the\n1819\nexaminations Peacock again used\nLeibniz\n's notation, but this time with a considerable amount of applied mathematics, and thereafter it became standard practice. Peacock published\nCollection of Examples of the Application of the Differential and Integral Calculus\nin\n1820\n, a publication which sold well and helped further the aims of the Analytical Society. In some ways this was intended to answer some of the criticisms for the Continental approach to calculus which was entirely theoretical while the Cambridge approach was based on using the calculus to solve problems. With this book of problems solved using the Continental style of calculus, Peacock was making the Continental approach more palatable at Cambridge. However, a book published in\n1820\ncontinued the attack on Peacock's reforms\n(\nsee\n[\n29\n]\n)\n:-\nAcademic education should be strictly confined to subjects of real utility and as far as the lucubrations of French analysts have no immediate bearing on philosophy, they are as unfit subjects of academic examination as the Aristotelian jargon of the old schools ... nor is it right or reasonable that young men should be obliged to read them in order to attain the honours of the Senate House.\nBabbage\nhad produced a number of manuscripts which were unpublished but he had discussed them with Peacock. These manuscripts, as now held in the British Museum, are:\n(1)\nOn Notation;\n(2)\nOf the influence of general signs in analytical reasonings,\n(3)\nGeneral notions respecting Analysis\n(\nmy theory of identity\n)\n;\n(4)\nInduction;\n(5)\nGeneralisation;\n(6)\nAnalogy;\n(7)\nOf the law of Continuity;\n(8)\nOf the value of a first book;\n(9)\nOf Artifices;\n(10)\nOf problems requiring new methods where the difficulty generally consists in putting it into Analytical language. It is unclear whether Peacock refers to the same ordering as now exists, but here is an extract from a letter he wrote to\nBabbage\non\n7\nMay\n1822\n:-\nI shall send your essays tomorrow morning by coach. I have read the greater part of them over very attentively, a task which you will readily acknowledge as of some difficulty considering the manner in which they are written; in some cases I have been completely baffled in my attempt particularly in the latter part of the first essay and in the greatest part of the second. I have, before expressed my opinion concerning them; they must form when completed a work of very great interest, abounding as they do with so much of original research and with illustrations of the most interesting kind; the essay on artifices and on questions requiring new methods of Analysis will be charming when completed\nIn\n[\n12\n]\nDubbey argues that Peacock's famous\nTreatise on Algebra\n, which he published in\n1830\n, contains ideas remarkably similar to those in\nBabbage\n's third paper. In\n[\n5\n]\nBecher suggests that these ideas go back even further, pointing to the work of\nRobert Woodhouse\nat Cambridge. However, Menachem Fisch presents a rather different suggestion in\n[\n15\n]\nregarding Peacock's approach to algebra which has much merit. But before looking at Fisch's ideas, we must look at the\nTreatise on Algebra\n.\nPeacock's ideas are expressed in a long Preface to the book and we have given an extract from the Preface at\nTHIS LINK\n.\nIn\nTreatise on Algebra\n, Peacock attempted to give algebra a logical treatment comparable to\nEuclid\n's\nElements\n. First he looks at what \"algebra\" is:-\n'Algebra' may be defined to be, the science of general reasoning by symbolical language. . . . it has been termed Universal Arithmetic: but this definition is defective, in as much as it assigns for the general object of the science, what can only be considered as one of its applications.\nPeacock describes in detail in the Preface\n(\nsee\nTHIS LINK\n)\nhow algebraic symbols have, up to that time, been thought merely to stand for numbers. He points to the difficulties in this approach and his purpose in the book is to make algebra a much more general science. He has two types of algebra, arithmetical algebra and symbolic algebra. In the book he describes symbolic algebra as:-\n... the science which treats the combinations of arbitrary signs and symbols by means defined through arbitrary laws.\nHe also wrote:-\nWe may assume any laws for the combination and incorporation of such symbols, so long as our assumptions are independent, and therefore not inconsistent with each other.\nDubbey summarises the main thesis of Peacock's ideas in the book\n[\n12\n]\n:-\n(1)\nAlgebra had previously been considered only as a modification of Arithmetic.\n(2)\nAlgebra consists of the manipulation of symbols in a way independent of any particular interpretation.\n(3)\nArithmetic is only a special case of Algebra - a \"Science of Suggestion\" as Peacock put it.\n(4)\nThe sign \"=\" is to be taken as meaning \"is algebraically equivalent to\".\n(5)\nThe principle of the permanence of equivalent forms\n.\nThis fifth principle allowed Peacock to extend the rules of arithmetic using what he called the principle of the permanence of equivalent forms to give his symbolic algebra. He was not as bold in practice, therefore, as the abstract ideas for symbolic algebra which he gives in theory. He investigated the basic properties of numbers, such as the distributive property, that underlie the subject of algebra. This property allowed Peacock to 'prove' that\n(\n-\n1)(\n-\n1)\n=\n1\n, and it would appear that his attempt is more convincing that earlier attempts, for instance by\nEuler\n. Peacock's proof, which is in the second edition of the book, published in\n1845\n, goes as follows:\n(\na\n−\nb\n)\n(\nc\n−\nd\n)\n=\na\nc\n+\nb\nd\n−\na\nd\n−\nb\nc\n(a - b)(c - d) = ac + bd - ad - bc\n(\na\n−\nb\n)\n(\nc\n−\nd\n)\n=\na\nc\n+\nb\nd\n−\na\nd\n−\nb\nc\nholds for arithmetic when\na\n>\nb\na > b\na\n>\nb\nand\nc\n>\nd\nc > d\nc\n>\nd\n. By the principle of permanence, this holds in symbolic algebra. Put\na\n=\n0\n,\nc\n=\n0\n,\nb\n=\n1\na = 0, c = 0, b = 1\na\n=\n0\n,\nc\n=\n0\n,\nb\n=\n1\n, and\nd\n=\n1\nd = 1\nd\n=\n1\nto get\n(\n-\n1)(\n-\n1)\n=\n1\n.\nWe now give Menachem Fisch's comparison of the two approaches of\nBabbage\nand Peacock\n[\n15\n]\n:-\nBabbage\n's essays were not written with a view to making sense of algebra as he found it. They do not represent an interpretive or explanatory undertaking, at least not primarily so. They are an attempt, or rather an outline of an attempt, to explore the foundations, reformulate the objectives, and lay down the foundational principles of a new, and austere conception of mathematical analysis. It was the undertaking of a working mathematician; not a 'study' of mathematics, but a 'work' of mathematics. In this respect Peacock's algebraic project was very different. ... the 'Treatise' was essentially a comment 'on' algebra, a critique performed with a view to articulating what algebra was, and analyzing what it could therefore achieve. In order to understand it, Peacock's work aspired to dismantle\n(\nto deconstruct\n)\nan existing area of mathematics.\nIn\n1831\nthe\nBritish Association for the Advancement of Science\nwas set up. One of its first aims was to obtain reports on the state and progress of various sciences from leaders in their fields.\nHamilton\nwas asked to prepare a report on mathematics but he declined. Peacock was then asked and he accepted although he restricted his report to Algebra, Trigonometry and the Arithmetic of Sines. He read his report at the\n1833\nmeeting of the Association in Cambridge and the report was subsequently printed. Remarkably, in\n1940\n, about\n100\nyears after Peacock first published his\nTreatise on Algebra\n, the book was reprinted in two volumes. See\nTHIS LINK\nfor extracts from two reviews of the\n1940\nedition.\nWe should fill in some details of Peacock's career which we have passed over in looking at his algebra. He was ordained a deacon in\n1819\nand, on\n22\nSeptember\n1822\n, he was ordained a priest at Norwich. He served as Vicar of Wymewold from\n1826\nto\n1835\n. In\n1836\nhe was appointed Lowndean professor of astronomy and geometry at Cambridge and three years later was appointed dean of Ely cathedral, spending the last\n20\nyears of his life there\n[\n6\n]\n:-\nAs dean of Ely, Peacock threw himself into the restoration of Ely Cathedral, both in directing the restoration and in raising funds. He was a prolocutor of the lower house of the convocation of Canterbury from\n1841\nto\n1847\nand from\n1852\nuntil\n1857\n, when failing health prompted his resignation. He also brought about improvements in the city of Ely's drainage system and fostered the education of the middle and lower classes. In addition to his other ecclesiastical appointments, from\n1847\nonwards he was rector of Wentworth, near Ely.\nPeacock published\nObservations on the Statutes of the University of Cambridge\n(1841)\nand\nThe life of Thomas Young\n(1855)\n. He also edited the first two volumes of\nMiscellaneous works of the Late Thomas Young\n(1855)\n. Andrew Robinson writes about Peacock as\nThomas Young\n's biographer in\n[\n4\n]\n:-\nPeacock was repeatedly requested to write the life by Mrs Young and was reluctant to agree, given his heavy professional commitments, illness and the daunting nature of the subject. He had access to\nYoung\n's journals and private papers and the many frank letters\nYoung\nwrote to Hudson Gurney - almost all of which have since disappeared ... Peacock's book is therefore invaluable for quoting at length from now vanished original sources. On the other hand, Peacock is a prolix Victorian writer whose attempt to describe\nYoung\n's scientific ideas entirely in words, without a single diagram ... quickly become self-defeating.\nIn\n1847\n, at the age of\n56\n, Peacock married Frances Elizabeth Selwyn. She was the second daughter of the Queen's Council William Selwyn, who was a graduate of Trinity College, Cambridge. George and Frances Peacock did not have children. It was about the time of his marriage that his health began to deteriorate. Peacock does not seem to have had much respect for the doctors whom he consulted. He writes\n(\nsee\n[\n4\n]\n)\n:-\nIt is the peculiar misfortune of the medical profession that its members can rarely dare to confess their ignorance, thinking it more or less necessary - in order to maintain their influence with their patients and with the world - to speak with equal decision, whether they are authorised by their knowledge to do so or not ... The real fact is that the prestige of a reputation once attained, whether through the influence of charlatanism, good fortune, or superior merit, is not easily destroyed, and the very eccentricities and extravagances which repel patients of sense and delicacy, tend to confirm the prepossessions of those who are wanting in these qualities, and who are naturally apt to wonder at or admire what they do not understand.\nAmong the honors that Peacock received, we note that he was elected to the\nRoyal Society of London\nin January\n1818\n, and he joined the\nRoyal Astronomical Society\nin\n1820\n, the year it was founded. Although Peacock was not at the founding meeting, he had discussed the founding of the Society with\nBabbage\nand\nHerschel\nabout ten days before that meeting.\nHerschel\nrecords in his diary:-\nSaturday,\n1\nJanuary\n1820\n: - Dined with Peacock and\nBabbage\nat Provost Goodall's at Eton, and met Col. Thackeray, Vice-Provost Roberts, Capt. Roberts, etc,\nSunday\n2\nJanuary\n1820\n: - Peacock and\nBabbage\nleft Slough after spending a few days here.\nPeacock was a reformer for his whole life. He worked hard to reform the statutes of Cambridge University and, when the Government set up a Commission to propose reforms, he was appointed to it. Although he attended meetings of the Commission, he died before the report was finished. Although he died at\n16\nSuffolk Street, Pall Mall, London, he was buried in Ely cemetery. We note that his widow, Frances Peacock, married W H Thompson in\n1866\n. Thompson had been one of Peacock's students at Trinity College."
}