{
  "nome_completo": "Georg Simon Klügel",
  "nome_curto": "Georg Klügel",
  "ano_nascimento": "1739",
  "ano_morte": "1812",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Klugel/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Halle, Germany",
  "biografia": "Georg Klügel\n's father, Augustin Klügel, was a businessman working in Hamburg. His mother, Sara Hünten, was the daughter of Anton Christian Hünten and was also from Hamburg. Klügel, who was his parents' first son, attended the Johanneum Grammar School, the renowned humanistic school in Hamburg. From that school he progressed to the Hamburg\nGymnasium\nAcademicum where he received a solid mathematical education. He was strongly encouraged by the mathematics teacher at the Hamburg Gymnasium, Johann Georg Büsch\n(1728\n-\n1800)\n, and, under his guidance, made a deeper study of mathematics and physics than the curriculum required. Büsch, who had studied at Hamburg and Göttingen, had been appointed to the Hamburg Gymnasium as a professor in\n1856\nand taught Klügel for his first four years in the post. Despite his love and talent for the subject at the Gymnasium, Klügel did not decide to follow a mathematical career at this stage, however, and he entered Göttingen University in\n1760\nwith the intention of reading for a degree in theology.\nAt Göttingen University Klügel took a mathematics course as part of his theology degree and so he met\nAbraham Kästner\nwho quickly saw his talents in mathematics. Klügel was fascinated by the topic and was soon ready to follow\nKästner\n's advice and change his course to read for a degree in mathematics. Again following\nKästner\n's advice he wrote a thesis on the\nparallel postulate\nentitled\nConatuum praecipuorum theoriam parallelarum demonstrandi recensio\nⓉ\n(\nConatuum principal theory parallels demonstrating review\n)\n. In an introduction to his thesis, he writes:-\nThere are few truths which can be demonstrated in geometry without the help of the theorem of the parallels, the fewer there are, which may be necessary, to prove that. In addition, as long as we have no exact terms of straight and curved lines, given by their definitions, the situation cannot be developed. These concepts are always quite obscure due to their nature. It is, however, not the geometry which appears a disgrace, when a proposition established by its principles will certainly be known, whose truth is not shown by precise observation, but from the clear concept we have of the straight line.\nIn this work he listed nearly\n30\nattempts to prove the fifth axiom, including the important attempt by Giovanni Saccher in\nEuclides ab Omni Naevo Vindicatus\nⓉ\n(\nEuclid vindicated of all faults\n)\n(1733)\n. This was particularly important since, up to the time Klügel studied it, the work had been totally neglected. Other attempts which Klügel examined in his thesis were by\nProclus\n, Nicolas de Malézieu\n(1650\n-\n1727)\n,\nNasir al-Din al-Tusi\n,\nJohann Andreas von Segner\n,\nJohann Gustav Karsten\n,\nSamuel König\n,\nAbraham Kästner\n, Giordano Vitale\n(1633\n-\n1711)\n, Friedrich Gottlob Hanke\n(1751)\n,\nChristopher Clavius\n,\nAndrea Tacquet\n,\nPietro Cataldi\n,\nPeter Ramus\n(\nwith additions from the editor Lazarus Schoner\n)\nand Christian Wolff\n(1679\n-\n1754)\n. He found weaknesses in all the 'proofs' he examined and correctly concluded that the 'proofs' were all false. His work is cited by almost all later contributors to\nnon-euclidean geometry\n. He defended his thesis on\n20\nAugust\n1763\nand after this he continued to undertake mathematical research in Göttingen.\nKlügel remained in Göttingen until\n1765\nwhen he moved to Hanover to take up the appointment as editor of the\nIntelligenzblatt\n. He married Elisabeth Karoline Henriette Berendes\n(1750\n-\n1832)\nat Hamburg in\n1769\n. She was the daughter of the postmaster W A Berendes; Georg and Elisabeth Klügel had eight children. In March\n1767\nhe was appointed professor of mathematics at Helmstedt. This city, east of Brunswick, had a university from\n1576\nwhich was for many years one of the leading seats of Protestant learning. The university, however, was closed in\n1810\n, twenty years after Klügel left it, when it was incorporated into Göttingen University. It was at Easter\n1788\nthat Klügel moved to the chair of mathematics and physics at the University of Halle. This chair had become vacant following the death of\nJohann Gustav Karsten\nin April\n1787\n. He remained in this post for the rest of his career, serving as rector of the university during\n1797\n-\n1798\n. After twenty years in this post, he retired in\n1808\nwhen he became seriously ill. It is said that his illness was caused by over exertion. He died four years later.\nIt was while he worked at the Universities of Helmstedt and Halle that Klügel made his most important contributions to mathematics. These were somewhat of a mixture between encyclopaedic style accumulation of facts together with some real innovative ideas in mathematics and its applications to various areas such as optics and meteorology. For example, Klügel made an exceptional contribution to trigonometry, unifying formulae and introducing the concept of trigonometric function, in his\nAnalytische Trigonometrie\nⓉ\n(\nAnalytical trigonometry\n)\n(1770)\n.\nLeonhard Euler\n, who studied similar problems nine years later, in some respects achieved less than Klügel in this area. Jaroslav Folta writes in\n[\n1\n]\nthat Klügel's concept of trigonometric function:-\n... in a coherent manner defines the relations of the sides in a right triangle. He showed that the theorems on the sum of the sines and cosines already \"contain all the theorems on the composition of angles\" and extended the validity of six basic formulas for a right spherical triangle. ... Klügel's trigonometry was very modern for its time and was exceptional among the contemporary textbooks.\nIn\n1774\nhe published\nEinrichtung von Feuerspritzen\nⓉ\n(\nEstablishment of fire engines\n)\n, an outstanding work on fire engines. In the following year, the first part of his translation of Joseph Priestley's 'The History and Present State of Discoveries Relating to Vision, Light and Colours' was published, with additions by Klügel, as\nGeschichte und gegenwärtiger Zustand der Optik mach der Englischen Priestleys bearbeitet\nⓉ\n(\nHistory and present condition of the optics as the English Priestley showed\n)\n. The second part of the translation, again with additions by Klügel, was published in\n1776\n. Two years later\nAnalytische Dioptrik\nⓉ\n(\nAnalytical dioptrics\n)\nappeared. Between\n1782\nand\n1784\nhe published his\n3\n-part encyclopaedia\nEnzyklopädie oder zusammenhängender Vortrag der gemeinnützigsten Kenntnisse\nⓉ\n(\nEncyclopedia or coherent presentation of profitable knowledge\n)\n. A second edition was published in seven parts between\n1792\nand\n1817\n. An important work on stereographic projection\nGeometrische Entwicklung der Eigenschaften der stereographischen Projection\nⓉ\n(\nGeometric development of the properties of the stereographic projection\n)\nwas published in\n1788\n. This work, years ahead of its time, studied the properties of the transformation of a spherical surface onto a plane from a geometrical perspective.\nIn\n1795\nKlügel published\nÜber die Lehre von den entgegengesetzten Grössen\nⓉ\n(\nOn the theory of opposite sizes\n)\nwhich is remarkable for recognising how different motivations to develop mathematics could lead to different discoveries. He compared the analytic method with the synthetic method in the developing the concept of negative numbers:-\nThe analytic differs from the synthetic method particularly in that the former embraces several cases in a single formula, while the synthetic discusses each case separately. The reason for this is that analysis expresses the connection of the quantities by equations, and that it uses the general properties of the equations, as well as the rules for connecting them, to give the value of each quantity by those belonging together with it, or to develop their relations. According to the synthetic method, one must seek a separate path for each problem, having no other general formulas for calculating than the propositions together with their modifications, except for the propositions already found. One must therefore always make an effort to discover identical ratios. While the synthetic method avails itself of such propositions which state an equality, it does not use algebraic equations.\nHe believed that mathematicians should always aim to generalise to make progress:-\nMoreover, it is necessary to present all related cases of a connection between quantities in one calculation, to economise on repetition, and to avoid a too cumbersome set of propositions, as well as in particular to survey all the differences in a formula at a glance.\nKlügel believed that the ancient Greeks had not followed the path of seeking to generalise and had, as a consequence, not discovered negative numbers. The English mathematicians were, claimed Klügel, following the same road as the ancient Greeks and trying to avoid negative numbers:-\nThings here are just as with the geometry of the ancients, and of the Englishmen imitating them, according to whom negative quantities will not occur in any proposition, since it is determined in any case what is a sum, or what is a difference, and since it can never be demanded, for a given difference, to subtract the whole from the part.\nIt was his mathematical dictionary, however, which led to his fame. This was the three volume work\nMathematisches Wörterbuch oder Erklärung der Begriffe, Lehrsätze, Aufgaben und Methoden der Mathematik\nⓉ\n(\nMathematical Dictionary or Explanation of the concepts, doctrines, tasks and methods of mathematics\n)\nwhich appeared between\n1803\nand\n1808\n. The work includes articles such as \"Abacus\", \"Algebra\", \"Analysis\", \"Geometry\", \"Logarithms\", \"Parallels\" and a host of similar ones. His definitions often illustrate the state of mathematics at this time and are now of interest to historians of mathematics. In fact, although Klügel is clearly not thinking in terms of giving a historical account of these topics, he does show some interest in the history and gives certain useful pointers. To illustrate the style of the dictionary we give a couple of examples. He defines 'continuous' in the first volume published in\n1803\nas follows:-\nContinuum, the continuous, or the immediately connected. A quantity is called a continuous one, a continuum, if its parts are all connected in such a way that where one ends, the other immediately begins.\nHere is another example of one of his definitions, this time of 'limit' which is taken from the second volume published in\n1805\n. Note that it is a reasonably good definition but is very geometrical in nature and contains no symbols:-\nThe limit of a quantity is that quantity which the latter, considered as a variable one, may approach ever more closely in such a way that the difference may become smaller than any quantity, however small it may be assumed.\nThe examples he quotes for limits confirm that he is thinking geometrically for they are the circle as the limit of inscribed polygons or circumscribed polygons, and the cylinder as the limit of prisms. In the third volume he has an article on 'parallels' which refers to his own contributions to the topic:-\nIt is known that the theory of parallels makes difficulties which is strange, in fact, because it is one of the first elements of geometry. You might believe that the whole of the science is jeopardized by an uncertain logic. So many attempts are made to make the justification of the geometry quite perfect in consideration of the parallels, but it is also something to remember is present. I have, in an attempt in Göttingen in the year\n1763\n, elaborated under\nKästner\n's advice an academic writing studying twenty-eight more or less different types of evidence and judged them.\nHis illness in\n1808\nprevented him from doing any further work on the project. Another three volumes were added between\n1823\nand\n1836\nby\nKarl Brandan Mollweide\nand Johann August Grunert and the dictionary was widely used for several generations making Klügel's name widely known. We should note that in the above biography we have mentioned a number of Klügel's major works but he also published around\n70\nminor works in\n14\nscholarly journals.\nAmong the honours which Klügel received for his contributions to mathematics was election to the\nBerlin Academy\nwhich took place on\n27\nJanuary\n1803\n."
}