{
  "nome_completo": "Ferdinand Georg Frobenius",
  "nome_curto": "Georg Frobenius",
  "ano_nascimento": "1849",
  "ano_morte": "1917",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frobenius/",
  "lugar_nascimento": "Berlin-Charlottenburg, Prussia (now Germany)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Georg Frobenius\n's father was Christian Ferdinand Frobenius, a Protestant parson, and his mother was Christine Elizabeth Friedrich. Georg was born in Charlottenburg which was a district of Berlin which was not incorporated into the city until\n1920\n. He entered the Joachimsthal Gymnasium in\n1860\nwhen he was nearly eleven years old and graduated from the school in\n1867\n. In this same year he went to the University of Göttingen where he began his university studies but he only studied there for one semester before returning to Berlin.\nBack at the University of Berlin he attended lectures by\nKronecker\n,\nKummer\nand\nWeierstrass\n. He continued to study there for his doctorate, attending the seminars of\nKummer\nand\nWeierstrass\n, and he received his doctorate\n(\nawarded with distinction\n)\nin\n1870\nsupervised by\nWeierstrass\n. In\n1874\n, after having taught at secondary school level first at the Joachimsthal\nGymnasium\nthen at the Sophienrealschule, he was appointed to the University of Berlin as an extraordinary professor of mathematics.\nFor the description of Frobenius's career so far, the attentive reader may have noticed that no mention has been made of him receiving his\nhabilitation\nbefore being appointed to a teaching position. This is not an omission, rather it is surprising given the strictness of the German system that this was allowed. Details of this appointment are given in\n[\n3\n]\nbut we should say that it must ultimately have been made possible due to strong support from\nWeierstrass\nwho was extremely influential and considered Frobenius one of his most gifted students.\nFrobenius was only in Berlin for a year before he went to Zürich to take up an appointment as an ordinary professor at the Eidgenössische Polytechnikum. For seventeen years, between\n1875\nand\n1892\n, Frobenius worked in Zürich. He married there and brought up a family and did much important work in widely differing areas of mathematics. We shall discuss some of the topics which he worked on below, but for the moment we shall continue to describe how Frobenius's career developed.\nIn the last days of December\n1891\nKronecker\ndied and, therefore, his chair in Berlin became vacant.\nWeierstrass\n, strongly believing that Frobenius was the right person to keep Berlin in the forefront of mathematics, used his considerable influence to have Frobenius appointed. However, for reasons which we shall discuss in a moment, Frobenius turned out to be something of a mixed blessing for mathematics at the University of Berlin.\nThe positive side of his appointment was undoubtedly his remarkable contributions to the\nrepresentation theory\nof\ngroups\n, in particular his development of\ncharacter theory\n, and his position as one of the leading mathematicians of his day. The negative side came about largely through his personality which is described in\n[\n5\n]\nas:-\n... occasionally choleric, quarrelsome, and given to invectives.\nBiermann, in\n[\n3\n]\n, looks more closely at his character\n(\nno pun intended!\n)\n, and how it affected the success of mathematical education at the university. He describes the strained relationships which developed between Frobenius and his colleagues at Berlin. He had such high standards that in the end these did not serve Berlin well. He\n[\n3\n]\n:-\n... suspected at every opportunity a tendency of the Ministry to lower the standards at the University of Berlin, in the words of Frobenius, to the rank of a technical school ... Even so,\nFuchs\nand\nSchwarz\nyielded to him, and later\nSchottky\n, who was indebted to him alone for his call to Berlin. Frobenius was the leading figure, on whom the fortunes of mathematics at Berlin university rested for\n25\nyears. Of course, it did not escape him, that the number of doctorates,\nhabilitation\n, and\ndocents\nslowly but surely fell off, although the number of students increased considerably. That he could not prevent this, that he could not reach his goal of maintaining unchanged the times of\nWeierstrass\n,\nKummer\nand\nKronecker\nalso in their external appearances, but to witness helplessly these developments, was doubly intolerable for him, with his choleric disposition.\nWe should not be too hard on Frobenius for, as Haubrich explains in\n[\n5\n]\n, Frobenius's attitude was one which was typical of all professors of mathematics at Berlin at this time:-\nThey all felt deeply obliged to carry on the Prussian neo-humanistic tradition of university research and teaching as they themselves had experienced it as students. This is especially true of Frobenius. He considered himself to be a scholar whose duty it was to contribute to the knowledge of pure mathematics. Applied mathematics, in his opinion, belonged to the technical colleges.\nThe view of mathematics at the University of Göttingen was, however, very different. This was a time when there was competition between mathematians in the University of Berlin and in the University of Göttingen, but it was a competition that Göttingen won, for there mathematics flourished under\nKlein\n, much to Frobenius's annoyance. In\n[\n3\n]\nBiermann writes that:-\nThe aversion of Frobenius to\nKlein\nand\nS Lie\nknew no limits ...\nFrobenius hated the style of mathematics which Göttingen represented. It was a new approach which represented a marked change from the traditional style of German universities. Frobenius, as we said above, had extremely traditional views. In a letter to\nHurwitz\n, who was a product of the Göttingen system, he wrote on\n3\nFebruary\n1896\n(\nsee\n[\n4\n]\n)\n:-\nIf you were emerging from a school, in which one amuses oneself more with rosy images than hard ideas, and if, to my joy, you are also gradually becoming emancipated from that, then old loves don't rust. Please take this joke facetiously.\nOne should put the other side of the picture, however, for in\n[\n9\n]\nSiegel\n, who knew Frobenius for two years from\n1915\nwhen he became a student until Frobenius's death, relates his impression of Frobenius as having a warm personality and expresses his appreciation of his fast-paced varied and deep lectures. Others would describe his lectures as solid but not stimulating.\nTo gain an impression of the quality of Frobenius's work before the time of his appointment to Berlin in\n1892\nwe can do no better than to examine the recommendations of\nWeierstrass\nand\nFuchs\nwhen Frobenius was elected to the\nBerlin Academy of Sciences\nin\n1892\n. Fairly extensive quotes from this document, and another similar document from\nFuchs\nand\nHelmholtz\n, are given in\n[\n4\n]\nbut we quote a short extract to show the power, variety and high quality of Frobenius's work in his Zürich years.\nWeierstrass\nand\nFuchs\nlist\n15\ntopics on which Frobenius had made major contributions:-\nOn the development of analytic functions in series\n.\nOn the algebraic solution of equations, whose coefficients are\nrational functions\nof one variable\n.\nThe theory of linear\ndifferential equations\n.\nOn\nPfaff\n's problem\n.\nLinear forms with integer coefficients\n.\nOn linear substitutions and bilinear forms\n...\nOn adjoint linear differential operators\n...\nThe theory of elliptic and\nJacobi\nfunctions\n...\nOn the relations among the\n28\ndouble tangents to a plane of degree\n4\n.\nOn\nSylow\n's theorem\n.\nOn double cosets arising from two finite groups\n.\nOn\nJacobi\n's covariants\n...\nOn\nJacobi\nfunctions in three variables\n.\nThe theory of biquadratic forms\n.\nOn the theory of surfaces with a differential parameter\n.\nIn his work in group theory, Frobenius combined results from the theory of algebraic equations, geometry, and\nnumber theory\n, which led him to the study of abstract groups. He published\nÜber Gruppen von vertauschbaren Elementen\nⓉ\n(\nOn groups of interchangeable elements\n)\nin\n1879\n(\njointly with Stickelberger, a colleague at Zürich\n)\nwhich looks at permutable elements in groups. This paper also gives a proof of the structure theorem for finitely generated\nabelian groups\n. In\n1884\nhe published his next paper on finite groups in which he proved\nSylow\n's theorems for abstract groups\n(\nSylow\nhad proved his theorem as a result about\npermutation groups\nin his original paper\n)\n. The proof which Frobenius gives is the one, based on conjugacy classes, still used today in most undergraduate courses.\nIn his next paper in\n1887\nFrobenius continued his investigation of conjugacy classes in groups which would prove important in his later work on characters. In the introduction to this paper he explains how he became interested in abstract groups, and this was through a study of one of\nKronecker\n's papers. It was in the year\n1896\n, however, when Frobenius was professor at Berlin that his really important work on groups began to appear. In that year he published five papers on group theory and one of them\nÜber die Gruppencharactere\non group characters is of fundamental importance. He wrote in this paper:-\nI shall develop the concept\n[\nof character for arbitrary finite groups\n]\nhere in the belief that through its introduction, group theory will be substantially enriched.\nThis paper on group characters was presented to the\nBerlin Academy\non July\n16\n1896\nand it contains work which Frobenius had undertaken in the preceding few months. In a series of letters to\nDedekind\n, the first on\n12\nApril\n1896\n, his ideas on group characters quickly developed. Ideas from a paper by\nDedekind\nin\n1885\nmade an important contribution and Frobenius was able to construct a complete set of representations by complex numbers. It is worth noting, however, that although we think today of Frobenius's paper on group characters as a fundamental work on representations of groups, Frobenius in fact introduced group characters in this work without any reference to representations. In was not until the following year that representations of groups began to enter the picture, and again it was a concept due to Frobenius. Hence\n1897\nis the year in which the representation theory of groups was born.\nOver the years\n1897\n-\n1899\nFrobenius published two papers on group representations, one on induced characters, and one on\ntensor\nproduct of characters. In\n1898\nhe introduced the notion of induced representations and the Frobenius Reciprocity Theorem. It was a burst of activity which set up the foundations of the whole of the machinery of representation theory.\nIn a letter to\nDedekind\non\n26\nApril\n1896\nFrobenius gave the irreducible characters for the\nalternating groups\nA\n4\n,\nA\n5\nA_{4}, A_{5}\nA\n4\n​\n,\nA\n5\n​\n, the\nsymmetric groups\nS\n4\n,\nS\n5\nS_{4}, S_{5}\nS\n4\n​\n,\nS\n5\n​\nand the group\nP\nS\nL\n(\n2\n,\n7\n)\nPSL(2,7)\nP\nS\nL\n(\n2\n,\n7\n)\nof order\n168\n. He completely determined the characters of symmetric groups in\n1900\nand of characters of alternating groups in\n1901\n, publishing definitive papers on each. He continued his applications of character theory in papers of\n1900\nand\n1901\nwhich studied the structure of Frobenius groups.\nOnly in\n1897\ndid Frobenius learn of\nMolin\n's work which he described in a letter to Dedekind as \"very beautiful but difficult\". He reformulated\nMolin\n's work in terms of\nmatrices\nand then showed that his characters are the traces of the irreducible representations. This work was published in\n1897\n. Frobenius's character theory was used with great effect by\nBurnside\nand was beautifully written up in\nBurnside\n's\n1911\nedition of his\nTheory of Groups of Finite Order\n.\nFrobenius had a number of doctoral students who made important contributions to mathematics. These included\nEdmund Landau\nwho was awarded his doctorate in\n1899\n,\nIssai Schur\nwho was awarded his doctorate in\n1901\n, and\nRobert Remak\nwho was awarded his doctorate in\n1910\n. Frobenius collaborated with\nSchur\nin representation theory of groups and character theory of groups. It is certainly to Frobenius's credit that he so quickly spotted the genius of his student\nSchur\n. Frobenius's representation theory for finite groups was later to find important applications in\nquantum mechanics\nand theoretical physics which may not have entirely pleased the man who had such \"pure\" views about mathematics.\nAmong the topics which Frobenius studied towards the end of his career were positive and non-negative matrices. He introduced the concept of irreducibility for matrices and the papers which he wrote containing this theory around\n1910\nremain today the fundamental results in the discipline. The fact so many of Frobenius's papers read like present day text-books on the topics which he studied is a clear indication of the importance that his work, in many different areas, has had in shaping the mathematics which is studied today. Having said that, it is also true that he made fundamental contributions to fields which had already come into existence and he did not introduce any totally new mathematical areas as some of the greatest mathematicians have done.\nIn\n[\n5\n]\nHaubrich gives the following overview of Frobenius's work:-\nThe most striking aspect of his mathematical practice is his extraordinary skill at calculations. In fact, Frobenius tried to solve mathematical problems to a large extent by means of a calculative, algebraic approach. Even his analytical work was guided by algebraic and linear algebraic methods. For Frobenius, conceptual argumentation played a somewhat secondary role. Although he argued in a comparatively abstract setting, abstraction was not an end in itself. Its advantages to him seemed to lie primarily in the fact that it can lead to much greater clearness and precision."
}