{
  "nome_completo": "George William Hill",
  "nome_curto": "George Hill",
  "ano_nascimento": "1838",
  "ano_morte": "1914",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hill/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "West Nyack, New York, USA",
  "biografia": "George Hill\n's mother was Catherine Smith and his father was John William Hill who was an artist specialising in engraving. In\n1846\n, when Hill was eight years old, his family moved to a farm near West Nyack, in New York, where George attended school. He received a somewhat basic education at secondary school, yet he shone in the mathematics classes. After graduating from high school he entered Rutgers College in\n1855\n. It had been an institution of higher education from\n1766\nand had been renamed Rutgers College thirty years before Hill studied there. Hill had graduated just before the Morrill Act of\n1862\nled to Rutgers College becoming New Jersey's land-grant college in\n1864\n.\nCertainly Hill's undergraduate studies at Rutgers College were highly unusual for American students of this period. He was taught at the College by a very able mathematician named Theodore Strong who was a friend of\nBowditch\n. Strong had a fine library of classic mathematics texts which he was pleased to allow the talented undergraduate Hill to study. These texts included\nLacroix\n'\nTraité du calcul différentiel et intégral\nⓉ\n(\nTreatise on differential and integral calculus\n)\n,\nLagrange\n's\nMéchanique analytique\nⓉ\n(\nAnalytical mechanics\n)\n,\nLaplace\n's\nMéchanique céleste\nⓉ\n(\nCelestial Mechanics\n)\nand\nLegendre\n's\nFonctions elliptiques\nⓉ\n(\nElliptical functions\n)\n. Hill graduated from  Rutgers College in\n1859\nwith his A.B. The following year he began his study of the lunar theory of\nDelaunay\nand Hansen. He was to continue this study for twelve years before he produced any publications of his own. He was awarded his A.M. by Rutgers in\n1862\n.\nIn\n1861\nHill joined the Nautical Almanac Office working in Cambridge, Massachusetts. In the same year he won first prize for his essay\nOn the confrontation of the Earth\nin a competition which was run by\nRunkle's Mathematical Monthly\n. After two years in Cambridge, Massachusetts he returned to West Nyack where he worked from his home. This suited the reclusive Hill who prefered being on his own. Except for a period of\n10\nyears from\n1882\nto\n1892\nwhen he worked in Washington on the theory and tables for the orbits of Jupiter and Saturn, this was to be the working pattern for the rest of his life.\nWriting in\n[\n4\n]\n,\nE W Brown\nsays:-\nHe was essentially of the type of scholar and investigator who seems to feel no need of personal contacts with others. While the few who knew him speak of the pleasure of his companionship in frequent tramps over the country surrounding Washington, he was apparently quite happy alone, whether at work or taking recreation.\nHe began his studies of the transits of Venus soon after joining the Nautical Almanac Office and at this early stage he mastered the methods set out by\nDelaunay\nin his two volume treatise\nThéorie du mouvement de la lune\nⓉ\n(\nTheory of the movement of the moon\n)\n. Hill was the first to use infinite\ndeterminants\nto study the orbit of the Moon in\nOn the part of the motion of the lunar perigee which is a function of the mean motion of the sun and moon\n. He published this work at his own expense in\n1877\n(\nit was reprinted in\nActa Mathematica\nin\n1886)\n. His\nResearches in Lunar Theory\nappeared in\n1878\nin the newly founded\nAmerican Journal of Mathematics\n.  This publication contains important new ideas on the three-body problem. He also introduced infinite determinants and other methods to give increased accuracy to his results.\nBrown\nwrote in\n1915\nthat Hill's memoir\nResearches in Lunar Theory\n:-\n... of but fifty quarto pages has become fundamental for the development of celestial mechanics in three different directions. ...\nPoincaré\n's remark that in it we may perceive the germ of all progress which has been made in celestial mechanics since its publication is doubtless fully justified.\nNewcomb\npersuaded Hill to develop a theory of the orbits of Jupiter and Saturn and Hill's work on this topic is another major contribution to mathematical astronomy. Hill's most important work dealt with the gravitational effects of the planets on the Moon's orbit so in this work he was considering the\n4\n-body problem. Examples of papers he published in the\nAnnals of Mathematics\ninclude:\nOn the lunar inequalities produced by the motion of the ecliptic\n(1884)\n,\nCoplanar motion of two planets, one having a zero mass\n(1887)\n,\nOn differential equations with periodic integrals\n(1887)\n(\nthese differential equations are now called Hill's differential equation\n)\n,\nOn the interior constitution of the earth as respects density\n(1888)\n,\nThe secular perturbations of two planets moving in the same plane; with application to Jupiter and Saturn\n(1890)\n,\nOn intermediate orbits\n(1893)\n,\nLiteral expression for the motion of the Moon's perigee\n(1894)\nand\nApplication of Chebyshev's principle in the projection of maps\n(1908)\n. He also published\nOn the extension of Delaunay's method in the lunar theory to the general problem of planetary motion\nin the\nTransactions of the American Mathematical Society\nin\n1900\n.\nAlthough he must be considered a mathematician, his mathematics was entirely based on that necessary to solve his orbits problems. His new idea on how to approach the solution to the three body problem involved solving the restricted problem. In this he assumed that the three bodies lie in the same plane, that two bodies orbited their common centre of mass, and that the third body orbited the other two but it was assumed to be of negligible mass so did not affect the orbits of the two\n(\nassumed massive\n)\nbodies. He had no interest in any modern developments in other areas of mathematics which did not relate to solving problems about orbits. In fact Hill worked on very similar problems to\nAdams\n. It is no coincidence that\nAdams\nwas also led to investigate infinite determinants and he did this work quite independently of Hill.\nFrom\n1898\nuntil\n1901\nHill lectured at Columbia University, but\n[\n4\n]\n:-\n... characteristically returned the salary, writing that he did not need the money and that it bothered him to look after it.\nZund writes in\n[\n12\n]\n:-\nHill never married and spent most of his life on the family farm at West Nyack. His income was small, but so were his needs, and several of his brothers lived nearby. Although a virtual recluse, he was happiest there among his large library, where he was free to pursue his research. He died at his home in West Nyack.\nHill was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1874\n. He was elected a Fellow of the\nRoyal Society\n(1902)\nreceiving its Copley Medal in\n1909\n. He was elected to the\nRoyal Astronomical Society\nand they awarded him their Gold Medal in\n1887\n; it was presented by\nGlaisher\nwho was president of the Society. Hill was president of the\nAmerican Mathematical Society\nfrom\n1894\nto\n1896\ndelivering his presidential address on\nRemarks on the progress of celestial mechanics since the middle of the century\n. He was elected to the\nFrench  Academy of Sciences\nwho awarded him their  Damoiseau Prize in\n1898\n, and to the\nRussian Academy of Sciences\nwho presented him with their Schubert Prize\n(1905)\n. The Astronomical Society of the Pacific awarded him their Bruce Medal in\n1908\n. He was also elected to the\nRoyal Society of Edinburgh\nin\n1908\n, the\nRoyal Belgium Academy of Science\n(1909)\n, the\nNorwegian Academy of Science\n(1910)\n, the\nRoyal Swedish Academy of Sciences\n(1913)\n, and the\nAccademia dei Lincei\nin Rome\n(1913)\n."
}