{
  "nome_completo": "George Ballard Mathews",
  "nome_curto": "George Mathews",
  "ano_nascimento": "1861",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mathews/",
  "lugar_nascimento": "Canonbury, London, England",
  "lugar_morte": "Liverpool, England",
  "biografia": "George Ballard Mathews\n' father was George Mathews, a linen draper, born at Preston on Wye, Herefordshire on\n26\nSeptember\n1813\nto the yeoman farmer William Mathews and his wife Elizabeth. His mother was Harriet Hannah Ballard, daughter of George Ballard\n(1784\n-\n1865)\n, an under secretary at the Inland Revenue, and his wife Hannah Alcock\n(\ndied\n1851)\n. Harriet was born in Shoreditch, Middlesex on\n20\nSeptember\n1826\n. George and Harriet Mathews were married at St Mary, Islington, on\n8\nOctober\n1858\n. At the time of the\n1861\nUK Census, the family are living at\n27\nCanonbury Square, Islington, London. The head of the family is the widowed George Ballard, with his daughter Harriet H Mathews and her husband George Mathews, and one month old George Ballard Mathews. They have three servants, two female house servants and one man servant. George, the subject of this biography, was baptised at St Paul, Canonbury, Islington, on\n8\nMay\n1861\n. He had two younger siblings, Harriet Hannah Mathews and Arthur Mathews, twins born in July\n1865\nin Canonbury, Islington.\nIn\n1866\n, following the death of George Ballard, the family moved to Herefordshire. At the time of the\n1871\nUK Census, the family are living at\n36\nWestbrook Villa, Richard's Castle, Herefordshire. There is George Mathews, now described as a landowner, his wife Harriet and their three children, all of whom are at school. They have two servants, a female domestic servant, and a male groom and gardener. In\n1872\nGeorge Ballard\nMathews entered Ludlow Grammar School in Ludlow, Shropshire. Living in Herefordshire and going to school in Shropshire sounds strange, but Richard's Castle is on the Herefordshire-Shropshire border and the school was less than\n4\nkm from his home. Ludlow Grammar School was at this time a boys' school which had been founded in around\n1200\nmaking it one of England's oldest educational establishments. At Ludlow Grammar School\n[\n5\n]\n:-\n... his brilliant intellect soon asserted itself. Records of\n1875\nstate that he was first in the top form with prizes in Mathematics, French, Drawing, Form Prize, and Parents' Prize. During the four years,\n1874\n-\n78\n, he was captain of the school. From the Rev W C Sparrow, one of the most successful Headmasters of the school, he received instruction in Hebrew as well as in Greek and Latin.\nWe note that the Rev W C Sparrow published articles in the\nTransactions of the Shropshire Archaeological Society\n.\nAfter graduating from Ludlow Grammar School Mathews went to University College, London where he studied mathematics taught by\nOlaus Henrici\nand also began to study Sanskrit. He spent the year\n1878\n-\n79\nat University College, still undecided whether to continue his studies in mathematics or in classics. In fact in\n1879\nSt John's College, Cambridge offered him a senior scholarship in either mathematics or classics, leaving Mathews to make his choice of subjects.\nHe then studied at St John's College, Cambridge, entering on\n30\nApril\n1879\n, where he was coached by William Henry Besant\n(1828\n-\n1917)\n. The most successful coach at Cambridge over many years had been\nEdward John Routh\nand, when Mathews matriculated at Cambridge,\nRouth\nhad coached every Senior\nWrangler\nin the Mathematical tripos since\n1862\n. It was Mathews who broke\nRouth\n's run of\n22\nconsecutive Senior Wrangler's when he graduated as Senior Wrangler in\n1883\n. Mathews explains in\n[\n12\n]\nBesant's coaching method:-\nBesant's method was rather odd but very effective with the right sort of man. At the cost of immense labour he had written out with his own hand, a set of \"bookwork and rider\" papers covering the whole range of the examination. The pupil, on each of his three weekly visits, found one of these papers awaiting him in the outside room, and proceeded to answer it as well as he could on the backs of old examination scripts. If he had not brought a pen of his own, he had to search among a lot of ancient quills until he could find one that was not hopelessly spoiled. Presently, the student would be politely summoned to an inner parlour, where his last exercise would be returned to him corrected and annotated, and if he had failed to answer any question he would be either shown a solution or given a hint how to proceed. Of course, it was not every pupil that was taken separately like this; some of them were taken in small batches\n(\nnot exceeding five or six\n)\n, but the general method was the same. It should be added that once every week each pupil took away with him a printed problem paper to be done at leisure in his own rooms. The results were marked, and the list was available for inspection.\nThe year after graduating,\n1884\n, Mathews was elected a Fellow of St John's College and awarded a Smith's Prize, and later in the same year he was appointed to the chair of mathematics at the University College of North Wales at Bangor, this being the year the university opened.\nAndrew Gray\nwrites in his obituary of Mathews\n[\n10\n]\n:-\nI first saw the late G B Mathews on June\n4\n,\n1884\n, at the Queen's Hotel, Chester, when the staff of the newly founded University College of North Wales was appointed. He was chosen for the Chair of Mathematics, and almost from that time we were linked together in friendship as well as in our offices as teachers of intimately related subjects in the same institution. I well remember his youthful and striking yet attractive appearance. He was the senior wrangler of the previous year, and came full of eager enthusiasm for the teaching of mathematics and for original mathematical work, and for ten years laboured hard in the hope of founding something like a school of mathematical study in North Wales. But alas! these hopes were dashed. Perhaps he was a little impatient, and I certainly did my best to counsel him to wait, and to find out the effect of the new Welsh university on the studies of the place, but without effect.\nHe taught at the University College of North Wales in Bangor and in Cambridge for periods through his life. He resigned his chair at Bangor in\n1896\nto return to Cambridge, for the reasons which\nAndrew Gray\ngave in the above quote. Back at Cambridge, he was appointed as a Lecturer in Mathematics. During the following years he served on the Council of the\nLondon Mathematical Society\nfrom\n1897\nto\n1904\nand acted for the year\n1904\n-\n95)\nas the Mathematical Secretary to the Philosophical Society. In\n1911\n, however, he resigned from Cambridge and was appointed to a special lectureship in the North Wales College at Bangor. Back at Bangor, he acted as Professor during the two academic years\n1917\n-\n19\n.\nMost of Mathews' research was on\nnumber theory\nbut he also wrote texts on\nBessel functions\nand on\nprojective geometry\n. In his work\nTheory of numbers\n(1892)\ntopics covered included\nGauss\n's theory of\nquadratic forms\nand their development by mathematicians such as\nDirichlet\n,\nEisenstein\nand\nSmith\n. The book also discusses\nprime numbers\nand\nRiemann\n's memoir on primes but, since it was written two or three years before the\nprime number theorem\nwas proved, this part of the work became dated rather quickly. It was published at his own expense by Deighton Bell, the Cambridge bookseller, and was intended to be Part I of a more comprehensive treatise, but no further parts appeared. A corrected reprint omitting the words Part I was published by the Chelsea Publishing Company in\n1961\n.\nFor more information, including extracts from prefaces and reviews, about this book and others written by Mathews, see\nTHIS LINK\n.\nThe book\nA treatise on Bessel functions and their applications to physics\n(1895)\nwas written by Mathews in collaboration with\nAndrew Gray\nwho was the professor of physics at Bangor. It was the first major treatise on\nBessel\nfunctions in English and covered topics such as applications of\nBessel\nfunctions to electricity, hydrodynamics and diffraction. Here Mathews was luckier than with the number theory work, since even when\nWatson\n's treatise on\nBessel\nfunctions was published in\n1922\n, it did not cover the applications of Mathews' book which continued to be useful and well used.\nMathews also wrote\nAlgebraic equations\n(1907)\nwhich is a clear exposition of\nGalois theory\n, and\nProjective geometry\n(1914)\n. This latter book develops the subject of projective geometry without using the concept of distance and it bases projective geometry on a minimal set of axioms. The book also treats\nvon Staudt\n's theory of complex elements as defined by real involutions. The book contains a wealth of information concerning the projective geometry of\nconics\nand\nquadrics\n.\nIn addition to his treatises and many papers on the classical theory of numbers, Mathews also wrote some articles for\nEncyclopaedia Britannica\n, in particular writing the article on universal algebra and the one on number. He also wrote numerous articles for\nNature\n[\n5\n]\n:-\nEver since the mid-eighties Mathews was a frequent contributor to 'Nature' on mathematical topics. His articles and reviews, most of which appeared over the initials \"G. B. M.\" were always written in a careful and scholarly style; they contained his considered opinion on the book or point concerned. His keen yet kindly criticism was undoubtedly of the greatest service to the many writers whose work passed through his hands. In conversation with the present writer he once expressed the opinion that some of his best work had appeared in 'Nature' reviews.\nAnother role Mathews played in mathematics teaching and administration was as an examiner to the Universities of Ireland and to the University of Manchester. He is described by\nT A Broadbent\nin\n[\n1\n]\nas follows:-\nMathews was an accomplished classical scholar; and besides Latin and Greek he was proficient in Hebrew, Sanskrit and Arabic. He also possessed great musical knowledge and skill. His versatility led a colleague at Bangor to assert that Mathews could equally well fill four or more chairs at the college.\nAndrew Gray\nhad personal knowledge of these talents by Mathews\n[\n10\n]\n:-\nMathews had a knowledge of Latin and Greek as minute and accurate as that generally possessed by professional classical scholars. He wrote pure and elegant Latin. I remember his amusing himself by turning into Latin prose an original philosophical dissertation which happened to come into his hands and arrested his attention. I remember also some Latin verses which he published anonymously and which were much praised by a very eminent scholar.\nHe wrote also charming English essays in the style of Charles Lamb, of whom he was a great admirer. These I fear are lost, but one of them, \"On a cock-loft,\" was a perfect gem, a charming piece of the most natural and simple prose, somewhat after the manner exemplified more recently by Kenneth Grahame in his \"Golden Days.\" He gave much time to Arabic in later years, and it is to be hoped that his translations of Arabic poetry will ultimately be published. I have seen some of them, which certainly seemed very remarkable.\nAnother of the many talents of this remarkable man was music\n[\n5\n]\n:-\nMathews' knowledge of music, again, was fully as advanced as that of most professional musicians. His copies of\nGauss\nand Bach were placed together on the same shelf, and he considered some of Sir Edward Elgar's compositions to be as fine as the work of Beethoven and Handel.\nAndrew Gray\ntells us about Mathews' personality in\n[\n9\n]\n:-\nHis mind was quick and his tongue sharp, and often his repartees in discussion were appropriate and caustic in a high degree. I remember his crushing reply to a person not remarkable for quickness of perception who raised a discussion on mass and weight, and advanced the statement that mass and density meant the same thing. \"Not at all,\" said Mathews, \"there is all the difference in the world between a massive intellect and a dense one!\" ...\nHis life was a rather solitary one. He smoked and worked and read in his rooms when he would have been better in the open air; but he was not a mere recluse. He much enjoyed talking over current events with his friends. I remember that when he stayed with me in Strathspey in\n1913\nhe was eloquent in appreciation of the character of Lord Kitchener, and talked with much vigour and information of all Kitchener's work for Egypt. Mathews was exceedingly sensitive, and almost morbidly afraid of appearing to put himself forward in any way, so that he hardly received the recognition which was his due.\nMathews was honoured, however, with election to the\nRoyal Society of London\nin\n1897\n. His certificate of election was read to the\nSociety\nat its meeting of\n5\nMarch\n1896\n. He was described as an eminent mathematician and a list of his 'works of merit in connection with mathematics' was attached. It was signed by an impressive list of proposers:\nE J Routh\n; W M Hicks;\nW Burnside\n; M J M Hill;\nE W Hobson\n;\nA B Kempe\n;\nA R Forsyth\n;\nA G Greenhill\n;\nJ W L Glaisher\n;\nE B Elliott\n; W H Besant;\nJ Larmor\n;\nP A MacMahon\n;\nA E H Love\n;\nJ J Sylvester\n;\nJ J Walker\n;\nAndrew Gray\n.\nYou can see his nomination form at\nTHIS LINK\nWe learn something of Mathews' attitude towards mathematics in\n[\n13\n]\n:-\nWe may venture to assert that the intellectual state of a country may be estimated fairly well by its attitude towards mathematics and its progress therein. In this respect England is much inferior to other and smaller nations. For instance, in England many private libraries have been either given to the nation or placed at the disposal of genuine students: very few of these are wholly or mainly mathematical. Contrast with this the\nMittag-Leffler\nendowment .... The founders expressly emphasised the supreme importance of pure mathematics from a national point of view. Again, no one can dispute the practical efficiency of the American nation; compare their treatment of mathematical professors with ours. An American university teacher may be a specialist devoted to the most abstract and \"unpractical\" parts of his science; he is left perfectly free to pursue his researches; he is provided with a sufficient staff of assistants; the university library contains an ample store of mathematical books, and all other necessary equipment is supplied. Every seventh year the professor is relieved of his official duties; and the use which he generally makes of his respite may be illustrated by the \"History of the Theory of Numbers\"\n(\nnow in course of publication\n)\n, by Prof\nL E Dickson\n. His special subject is the highly abstract one of group-theory: but he spent his sabbatical year in ransacking the libraries of Europe, as well as of the United States, for works on the higher arithmetic. The result is an extraordinary display of laborious and accurate research: the first volume alone contains summaries, almost all of them based upon the author's personal examination, of thousands of papers. The value of the work, when complete, can scarcely be overestimated.\nMany articles by Mathews appeared in\nNature\nduring\n1920\n-\n22\n, but these were extremely difficult years for him for he was suffering from cancer and underwent a series of operations. He died in a Liverpool nursing home on\n19\nMarch\n1922\nand was cremated two days later."
}