{
  "nome_completo": "Gertrude Mary Cox",
  "nome_curto": "Gertrude Cox",
  "ano_nascimento": "1900",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cox/",
  "lugar_nascimento": "Dayton, Iowa, USA",
  "lugar_morte": "Durham, North Carolina, USA",
  "biografia": "Gertrude Cox\n's parents were Allen and Emma Cox. She was born in Webster County, east of the city of Des Moines. In\n[\n3\n]\nthe influence of the area on her as a young child is explained:-\nIt was along the Des Moines River that as a child she learned to dream grand dreams about what could be accomplished in the future. The ethics of moral uprightness, hard work and a determination of steel were instilled in most Iowa children of the early twentieth century.\nGertrude, herself, wrote about her childhood\n[\n2\n]\n:-\nI was raised on a farm where I had several years for roaming in the woods by the river and over the hills. I learnt from my mother the value and joy of doing for other people. She nursed the sick and raised us to be active church workers. There were four of us, two boys and two girls. We had responsibilities at home. I liked best making the homemade bread for our family because I was allowed to sell one pan of biscuits.\nThe Cox family moved to Perry, Iowa, where Gertrude studied at Perry High School, graduating in\n1918\n. At this time she decided to become a deaconess in the Methodist Church and worked towards that end\n[\n2\n]\n:-\nMy main ambition was to help others so after high school, I took a two-year special social service course of study and worked two years as housemother for\n16\nlittle orphan boys in Montana.\nHowever, in\n1925\n, she decided to continue her education at Iowa State College in Ames where she majored in mathematics, also taking courses in psychology, sociology, and craftwork. She made much needed money by undertaking computing work\n(\ndoing hand calculation with data sets\n)\n. Iowa State College had set up a Mathematics Statistical Service in\n1927\nwith George W Snedecor and A E Brandt in charge. As an undergraduate at Iowa State College, Cox worked part-time for the Mathematics Statistical Service. She was awarded a B.S. in\n1929\n[\n6\n]\n:-\nDuring the years\n1929\n-\n31\n, with Professor Snedecor's patience in checking the manuscript she completed her thesis and on June\n15\n,\n1931\nreceived the first M.S. degree in Statistics at Iowa State College, awarded through the Department of Mathematics.\nHer M.S. thesis was\nA Statistical Investigation of a Teacher's Ability as Indicated by the Success of His Students in Subsequent Courses\n. From\n1931\nto\n1933\nCox undertook graduate studies in psychological statistics at the University of California at Berkeley, where she was also a graduate assistant. Her intention had been to work towards a Ph.D. but she gave up her doctoral studies in\n1933\nafter George Snedecor offered her a job at Iowa State College running the newly created the Statistical Laboratory. Here she worked on the design of experiments, a topic on which she undertook research as well as teaching it to graduate students. Anderson writes\n[\n2\n]\n:-\nHer courses were built around a collection of real-life examples in a variety of experimental areas. She taught from mimeographed materials, which formed part of the famous Experimental Designs\n[\ntreatise\n]\n... She had three major principles in setting up an experiment:\n(\ni\n)\nthe experimenter should clearly set forth his or her objectives before proceeding;\n(\nii\n)\nthe experiment should be described in detail; and\n(\niii\n)\nan outline of the analysis should be drawn up before the experiment is started. She emphasized the role of randomization and stressed the need to ascertain if the size of the experiment was sufficient to demonstrate treatment differences if they existed ...\nShe worked with George Snedecor and A E Brandt but, in the autumn of\n1936\n, Snedecor began writing his book\nStatistical methods\n. He wrote at home, and Brandt and Cox were given charge of the administrative and consulting tasks in statistics. Cox assisted Snedecor as he worked on his book by providing him with the data sets he needed for his examples. Cox and Snedecor also collaborated in writing three research papers around this time:\nDisproportionate subclass numbers in tables of multiple classification\n(1935)\n;\nCovariance used to analyse the relation between corn yield and acreage\n(1936)\n; and\nAnalysis of covariance of yield and time to first silks in maize\n(1937)\n. In\n1939\nshe was appointed assistant research professor of statistics at Iowa State University.\nIn\n1940\nCox was appointed professor of statistics at North Carolina State College at Raleigh\n[\n3\n]\n:-\nThe choice of a woman to hold such a post was unusual at that time and came about in a curious way. G W Forster of North Carolina State College contacted Professor Snedecor for names of individuals who would be viable candidates for the position. Professor Snedecor prepared a list of persons\n(\nall males\n)\nand before mailing it to Dr Forster showed the list to Miss Cox. Her immediate reaction was, \"Why didn't you put my name on the list?\" Her name was then added in a footnote to the letter, \"Of course if you would consider a woman for this position I would recommend Gertrude Cox of my staff.\" The choice of a woman on the basis of a footnote was an administrative decision which had far-reaching effects.\nOn Saturday\n14\nSeptember\n1940\nshe received a telegram from North Carolina State College:-\nWould you consider appointment head of Statistics Laboratory here. Write Experience, Training, Salary if interested.\nShe wrote in her diary:-\nI wrote and mailed it off before I got cooled down. Not expecting anything.\nAt North Carolina State College, Cox headed the new department of Experimental Statistics in the School of Agriculture. The North Carolina State College of Agriculture and Engineering reported her appointment in their paper\nExtension Farm News\nin November\n1940\n:-\nFirst woman professor in the history of State College is Miss Gertrude Cox, shown above at work in her office in the Agricultural Economics department,\n1911\nDormitory Building. Miss Cox is professor of Experimental Statistics. She has been at Iowa State College for seven years, doing the same type of work. Dean Schaub says Miss Cox will establish a statistical laboratory and teach advanced courses in statistical methods. In addition she will be available for consultation with the staffs of all units of the Greater University of North Carolina in helping to plan research work.\nIn\n1944\nshe became director of the Institute of Statistics of North Carolina State. In the following year this became the Institute of Statistics of the Consolidated University of North Carolina, and the Statistics Research Division of the North Carolina State College which was run by\nWilliam Cochran\n. In the same year of\n1945\nCox became the editor of\nBiometrics Bulletin\nand of\nBiometrics\n, holding this editorship for\n10\nyears. In\n1947\nshe was a founder member of the Biometrics Society.\nCochran\nhad visited the Iowa Statistical Laboratory in\n1938\n, accepting a post there in\n1939\n. His task was to develop the graduate programme in statistics within the Mathematics Department. At this time he had begun working with Cox on a book based on their course notes. He joined the newly created North Carolina Institute of Statistics in\n1946\n, again to develop the graduate programme in statistics. This brought Cox and\nCochran\ntogether again and they were able to continue writing their text.  In\n1950\nthey published their treatise\nExperimental Design\nwhich quickly became a classic text. Philip J Clark writes in a review:-\nWritten by two of the foremost authorities on its subject it is intended as a guide for the research worker in planning and executing carefully controlled experiments. It discusses the relative merits and methods of analysis of a wide variety of experimental designs and answers such perplexing questions as how many observations are needed and how they can best be allocated to the various factors under investigation.\nMore details of the contents are given in a review by A M Mood:-\nThe book consists of a thorough exposition of the practical aspects of experimental designs. The first three chapters give a preliminary discussion of the role of statistics in experimentation, of the general nature of experimental designs, and of the numerical analysis of experimental data. Then follows a detailed presentation of all the important designs: randomized blocks, Latin and Greco-Latin squares, factorial designs, balanced and partially balanced incomplete blocks, lattices and lattice squares, together with various combinations of these designs using different methods of confounding. The special properties of the designs are clearly described and the analyses of the designs are completely illustrated by experiments that have actually been performed and with all the data and computations included.\nCox received many honours in addition to some already mentioned. She was elected a fellow of the\nAmerican Statistical Association\nand a fellow of the Institute of Mathematical Statistics, both in\n1944\n. In\n1949\nshe became the first woman elected into the International Statistical Institute. She was elected an honorary member of Société\nAdolphe Quetelet\nin Brussels in\n1954\n. She was elected President of the\nAmerican Statistical Association\nand, on\n9\nSeptember\n1956\n, she delivered her presidential address at the annual meeting of the Association held in Detroit, Michigan. She began her address as follows:-\nI am going to ask you to look forward as we try to discern, as best we can, what the future holds for statisticians. If ten years ago we had predicted some of the things we are doing today, we would have been ridiculed. Now, my concern is that we may become too conservative in our thinking. Civilisation is not threatened by atomic or hydrogen bombs; it is threatened by ourselves. we are surrounded with ever widening horizons of thought, which demand that we find better ways of analytic thinking. We must recognise that the observer is part of what he observes and that the thinker is part of what he thinks. We cannot passively observe the statistical universe as outsiders, for we are all in it. The statistical horizon looks bright. Exciting experiences lie ahead for those young statisticians whose minds are equipped with knowledge and who have the capacity to think constructively, imaginatively, and accurately.\nIn\n1957\nshe was elected an honorary fellow of the\nRoyal Statistical Society\nand, in the following year, Iowa State College awarded her an honorary D.Sc. In presenting her for the award, the dean said:-\nI have the honour of presenting Gertrude Mary Cox, stimulating leader in experimental statistics. She is Director of the Institute of Statistics for North Carolina State College and for the Consolidated Universities of that state. Her influence is worldwide, contributing to the development of national and international organizations, publications, and councils of her field. One of our graduates, she has helped to build the accomplishments of our first century.\nAnother honour given to her was the University of North Carolina's Oliver Max Gardner Award in\n1959\n.\nIn\n1960\nshe retired from her positions at North Carolina State College and took up her final post as Director of the Statistics Research Division at the Research Triangle Institute between Raleigh, Chapel Hill and Durham, North Carolina. In fact she had played a major role in the late\n1950\ns in planning for the founding of this non-profit Institute, providing contract research to government and industry. She held this directorship until she retired\n(\nfor the second time\n)\nin\n1964\n, becoming a senior consultant for the Institute at that time. However, despite retiring twice, Cox set off on another consulting trip to Egypt in\n1964\nas a consultant for the Ford Foundation to Cairo University's Institute of Statistical Studies and Researches. Arriving in Cairo on\n5\nSeptember\n1964\n, by the end of October she\n[\n8\n]\n:-\n... had established something of a routine. She was teaching a weekly class for research workers and a graduate course of nine students twice a week, with plans being made for an elementary course for diploma students. Her busy consulting schedule included agricultural studies, research on infant mortality and family planning, and work for the university's School of Pharmacology\nAmong the other consulting task she undertook during her retirement, we mention one to Thailand.\nFurther honours came her way. She was presented with the International Award for Distinguished Service to Agriculture by Gamma Sigma Delta in\n1960\n, and given Honorary Life Membership of the Biometric Society in\n1964\n(\nshe was President of the Society\n1968\n-\n69)\n. In\n1970\n, Cox Hall was named and dedicated at North Carolina State University in her honour:-\nThe modern six-storey building houses the office of the dean of the School of Physical and Mathematical Sciences, and the Department of Physics and Statistics. The building contains administrative and faculty offices, classroom and laboratory space, an electronic computer facility, work and study space for graduate students, and a shop for the construction of special research equipment.\nIn\n1975\nshe received what must be the greatest honour given to her, being elected to the\nNational Academy of Sciences\n.\nAmong her many interests outside statistics we note her love of entertaining, gardening\n(\nparticularly growing orchids\n)\n, collecting dolls and silver spoons, and batik. For example, in\n1930\nwhile she was studying for her Master's Degree, Cox sent some of her craft to the New York Society of Craftsmen. They replied on\n11\nDecember:-\nAt a meeting last evening the Jury accepted your batik hanging\n(\nscenery\n)\n, the woven handbag, with which they were particularly pleased, and both of the cotton hangings. ... We shall be glad to hear from you again and hope that you will send us more of your things.\nHer last couple of years are described by Anderson\n[\n2\n]\n:-\nIn\n1976\nGertrude learned that she had leukemia but remained sure that she would conquer it up to the end. She even continued construction of a new house, unfortunately not completed until a week after her death. While under treatment at Duke University Hospital she kept detailed records of her progress, and her doctor often referred to them. With characteristic testy humor she called herself \"the experimental unit\", and died as she had lived, fighting to the end.\nLet us give the last thoughts to\nFrank Yates\n[\n13\n]\n:-\nShe was a good person to know, both personally and professionally. She regarded her staff and their children very much as her family, and had their interests very much at heart."
}