{
  "nome_completo": "Gherard of Cremona",
  "nome_curto": "Gherard",
  "ano_nascimento": "1114",
  "ano_morte": "1187",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gherard/",
  "lugar_nascimento": "Cremona (now Italy)",
  "lugar_morte": "Toledo, Castile (now Spain)",
  "biografia": "Gherard of Cremona\n's name is often written as Gerard or sometimes Gerhard. After being educated in Italy, he realised that European education was narrow and that he decided that he would try to make the riches of Arabic science available to European scholars through Latin translations of the major works in Arabic.\nFor this reason Gherard went to Toledo in Spain where his intention was to learn Arabic so he could read\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nsince no Latin translations existed at that time. Although we do not have detailed information of the date when Gherard went to Spain, he was certainly there by\n1144\n.\nHe remained there for most of the rest of his life and although he does not appear to have gathered a school around him, he certainly appears to have had quite a lot of assistance. He may have employed helpers who assisted him in the copying and checking of manuscripts and other chores associated with the great translation industry that he started. In all over a period of forty years, Gherard translated around eighty works from Arabic to Latin. The complete list of works which he translated is given in\n[\n1\n]\n. Some of these translations were of Arabic works while others were of Greek works which had been translated into Arabic. Often however, the works were a mixture in the sense that they were Arabic commentaries on Greek works.\nIt was not the case that these works were all mathematical. Some were on science in general, others were on medicine. The most important, however, were on astronomy, geometry and other branches of mathematics. Gherard is mentioned in the archive as the translator of\n(\ni\n)\nworks by the Banu Musa brothers,\n(\nii\n)\nthe\nTabulae Jahen\n(\nto give them the Latin name as translated by Gherard\n)\nof\nal-Jayyani\n,\n(\niii\n)\nal-Nayrizi\n's commentary on\nEuclid\n's\nElements\nwhich themselves were based on al-Hajjaj's Arabic translation of the\nElements\nfrom the Greek,\n(\niv\n)\nwork by\nThabit ibn Qurra\n,\n(\nv\n)\nwork by\nAbu Kamil\n, and\n(\nvi\n)\nAhmed\nibn Yusuf's work on ratio and proportion.\nIn addition, of course, Gherard translated the\nAlmagest\nbut there is a slight puzzle over this. The translation which we have today appeared in\n1175\n(\nor at least this date is stated on the manuscript\n)\n. We know that Gherard went to Toledo with the intention of translating the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n, and it seems beyond belief that such a prolific translator would have waited until he was sixty-one years old before completing what he considered his most important task. It must have been completed\n25\nyears earlier, and this may be a revised edition or simply a new copy which has been given the date of copying instead of the date of first completion.\nIt seems hard to believe that, given the size of the task that he undertook, Gherard would have had much time for anything other than translating. He did however give public lectures and, in so doing, gained a high reputation as a man of great learning.\nOne of the decisions made by Gherard in his translating was to render the Arabic word for sine into the Latin sinus, from where our sine function comes. It is interesting to realise that had Gherard made a different decision in his translation, this function, which is well-known to all who have made even a brief study of mathematics, would be known by a different name today.\nIn\n[\n5\n]\nGherard's contribution is summed up as follows:-\nBecause of the abundance and systematic nature of his production, his thoroughly critical approach to textual tradition, and his faithful adherence to literalness, together with a steady flow of the twelfth century, Gerard's translations soon came to obtain the preference of Latin scholars through the succeeding centuries. The tremendous upsurge of interest in Arabic and Greek science and philosophy in medieval universities from the start of the thirteenth century owes its stimulation in greater part to the work of Gerard of Cremona."
}