{
  "nome_completo": "Gian-Carlo Rota",
  "nome_curto": "Gian-Carlo Rota",
  "ano_nascimento": "1932",
  "ano_morte": "1999",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rota/",
  "lugar_nascimento": "Vigevano, Italy",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Gian-Carlo Rota\n's father, Giovanni Rota, was a civil engineer and architect who specialised in anti-earthquake structures. Giovanni Rota was a prominent anti-fascist and his name appears on a death list constructed by Mussolini. Gian-Carlo was born into a talented family in Vigevano, many members of his family had achieved fame in their areas of expertise, for example one of Gian-Carlo's uncles, Flaiano, wrote scripts for Federico Fellini's films, including\nLa Dolce Vita\n.\nGian-Carlo was educated in Italy up to the age of thirteen in\n1945\n. This was near the end of World War II and, due to Giovanni Rota's anti-fascist views, the family was forced to leave Vigevano to escape Mussolini's death squads. Giovanni Rota took his family to northern Italy where they hide for a time before crossing the border into Switzerland. The family eventually escaped to Ecuador where Gian-Carlo completed his secondary school education. The positive side to this remarkable escape story was that Rota was fluent in English, Italian, Spanish and French.\nRota entered the United States in\n1950\nat the age of eighteen to undertake his university studies. He entered Princeton University in\n1950\nand received a BA summa cum laude in\n1953\n. After graduating, Rota entered Yale University where he studied for his Master's Degree in Mathematics which was awarded in\n1954\n. He then undertook doctoral studies, supervised by Jacob T Schwartz, and he was awarded a PhD from Yale in\n1956\nfor his thesis\nExtension theory of differential operators\n. His thesis supervisor wrote:-\n[\nRota\n]\nwas my first graduate student at Yale. He began as a functional analyst and after a few years moved on to combinatorics, where he became a leading national and international figure. He really loved mathematics all his life very passionately. He was also a person of great cultural and literary attainment. He loved to write, loved to edit. He was a gourmet of mathematics. He was ebullient, a bit of a raconteur.\nIn this same year that he was awarded his doctorate, Rota married Teresa Rondón and he received a Postdoctoral Research Fellowship to undertake research at the Courant Institute at New York University. After spending the year\n1956\n-\n57\nin New York, Rota was appointed as\nBenjamin Peirce\nInstructor at Harvard University. He held this post until\n1959\nwhen he joined the faculty at Massachusetts Institute of Technology. With the exception of two years,\n1965\nto\n1967\n, when he was at the Rockefeller University, Rota remained at MIT for the rest of his career.\nRota was given the title Professor of Applied Mathematics at MIT but in\n1972\nhis title was changed to Professor of Applied Mathematics and Philosophy. He is the only professor at MIT ever to have such a title. However, he had many other roles outside MIT. Rota had a long association with the Los Alamos Scientific Laboratory where he enjoyed being with his friend\nUlam\nand collaborating with him. He served as a consultant to the Laboratory from in\n1966\nand, in\n1971\n, he was made a Senior Fellow of the Laboratory. M Waterman writes in\n[\n3\n]\n:-\nRota soon became part of Los Alamos. He gave lectures that were deeply informative, polished works of art that made him known throughout the Lab. The topics were wide-ranging:\ndifferential equations\n,\nergodic theory\n, nonstandard analysis,\nprobability\n, and of course, combinatorics.\nRota was also a consultant with the Rand Corporation from\n1966\nto\n1971\nand with the Brookhaven National Laboratory from\n1969\nto\n1973\n.\nAs we have indicated above, Rota worked on\nfunctional analysis\nfor his doctorate and, up to about\n1960\n, he wrote a series of papers on operator theory. Two papers in\n1959\n-\n60\n, although still in the area of operator theory, looked at ergodic theory which is an area which requires considerable combinatorial skills. These papers seem to have led Rota away from operator theory and into the area of combinatorics. His first major work on combinatorics, which was to change the direction of the whole subject, was\nOn the Foundations of Combinatorial Theory\nwhich Rota published in\n1964\n.\nRota received the Steele Prize from the\nAmerican Mathematical Society\nin\n1988\n. The Prize citation singles out the\n1964\npaper\nOn the Foundations of Combinatorial Theory\nas:-\n... the single paper most responsible for the revolution that incorporated combinatorics into the mainstream of modern mathematics.\nThis paper was the first of a series of ten papers with this main title, all ten have subtitles\n(\nfor example this first one was subtitled\nTheory of Möbius functions\n)\nand all the remaining nine have between one and three additional co-authors. Papers two to nine were all published between\n1970\nand\n1974\nwith the tenth being published in\n1992\n.\nRichard Guy, reviewing\n[\n1\n]\nin\n1980\n, writes:-\nCombinatorists owe much to Gain-Carlo Rota, already a \"respectable\" mathematician when he interested himself in combinatorics and embarked on his gallant crusade to unify the subject which almost everyone regarded as being at best a bag of clever isolated tricks; to reverse the tide of abstraction in mathematics; to return to the concreteness of a century ago. ... Rota observes that combinatorics is providing the essential continuing link between mathematics and the sciences: biology\n(\nstructure of large molecules\n)\n, linguistics\n(\ncontext-free languages, automata theory\n)\n, physics\n(\nstatistical mechanics\n, phase transition problems, elementary particles\n)\n.\nRota received many awards for his outstanding contributions to numerous areas. In addition to the Steele Prize mentioned above, he was awarded the Medal for Distinguished Service from the National Security Agency in\n1992\n. He was elected to the\nNational Academy of Sciences\nin\n1982\n, was vice-president of the\nAmerican Mathematical Society\nin\n1995\n-\n97\nand the Society's Colloquium Lecturer in\n1998\n. He was also a fellow of the\nAmerican Academy of Arts and Science\n, a member of the Academia Argentina de Ciencias, a fellow of the Institute of Mathematical Statistics, the Heidegger Circle, the American Association for the Advancement of Science and the Husserl Circle. He received the\n1996\n-\n97\nJames R Killian Jr Faculty Achievement Award from MIT for his work as a:-\n... leading innovator and theorist in the transformation of combinatorics from a disparate collection of facts and techniques unworthy of serious mathematical consideration into an active, systematic and profound branch of modern pure and applied mathematics.\nHe held four honorary degrees from the University of Strasbourg\n(1984)\n, the University L'Aquila\n(1990)\n, the University of Bologna\n(1996)\n, and Brooklyn Polytechnical University\n(1997)\n.\nE F Beschler writes in\n[\n3\n]\n:-\nGian-Carlo Rota was a mathematician and a philosopher, and the richness of his writing in these fields was known to both communities. I also like to think of him as a poet - not in the formal sense, since to the best of my knowledge he never wrote a poem - but in the larger sense of a person who expresses himself with imaginative power and beauty of thought, even when many of these thoughts were sardonic reflections on people, ideas, institutions, and the general condition of humanity. His sense of humour was biting and deep - and full of truth. And his modes of expression poetic in a fundamental sense of the word.\nRota died in his sleep and was found in bed on the afternoon of\n19\nApril\n1999\n. He had been due to give a series of three lectures at Temple University, the Groswald Memorial Lectures, on the previous day and, when he failed to arrive in Philadelphia, a check was made at his home. The cause of his death was atherosclotic cardiovascular disease. There were many tributes to Rota after his death, for example David Sharp wrote:-\nThe first thing you noticed about Gian-Carlo was his love for the life of the mind. He lived and breathed mathematics and philosophy. He had a passion for ideas, an uncompromising dedication to the truth, and a boundless curiosity.\nBrian D Taylor, one of the last of Rota's forty-two doctoral students, wrote:-\nI remember Rota's characteristic generosity: The research problems he shared freely, not just with his graduate students, but with anyone he talked to or taught; the dinners out at good restaurants ... I remember travelling to his apartment in Harvard square to talk about my work even when he wasn't going to be at MIT. I remember telling him about results in my thesis, drawing tableaux on the slightly rickety easel he had up in his living room. And I remember a weekend spent at his apartment, mostly sitting at the Macintosh in his bedroom redrafting my first paper; when I shown him my first draft of our work, he asked \"are you trying to hide your techniques from your readers?'' By the time that weekend was over, the techniques, and the paper were clear."
}