{
  "nome_completo": "Gilbert Agnew Hunt",
  "nome_curto": "Gilbert Hunt",
  "ano_nascimento": "1916",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hunt/",
  "lugar_nascimento": "Washington D.C., USA",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Gilbert Hunt\n's parents were Gilbert Agnew Hunt, who was an engineer who built bridges, and his wife May Winfield. Gilbert, who was their only child, played tennis to a high standard from the time he was a young child. He grew up in Washington, D.C. where he attended primary school, then later became a pupil at Eastern High School. At age\n16\n, while attending this school, he became a national tennis star being ranked No.\n1\nin national junior indoor tennis. Bob Considine, a\nWashington Post\nsportswriter, wrote that Hunt was taking:-\n... six majors ...\n[\nHe\n]\nattacks the harpsichord armed with something more than a knowledge of chopsticks.\n[\nYoung Mr Hunt\n]\nonce took this column to task for printing poetry in a scrambled 'didactic hexameter' or some such heinous charge.\nTwo years later Hunt was again ranked No.\n1\nin national junior indoor tennis. This was the year that he entered Massachusetts Institute of Technology, studying mathematics there from\n1934\nto\n1936\nwhen he decided to give up his university education to concentrate on playing tennis. However, he soon returned to his university studies, this time at George Washington University in his home town of Washington, D.C. He was awarded a bachelor's degree in mathematics in\n1938\n, then enrolled at Brown University for postgraduate studies.\nDuring these years, Hunt had continued his tennis career in parallel with his university studies. Among his famous victories was one in\n1938\nagainst Bobby Riggs, the No.\n2\nplayer in the United States. The\nWashington Post\nreported:-\nRiggs had been a\n10\n-\n1\nfavourite when he took the court. But the frail Washington mathematician constantly out-manoeuvred and pressed the husky Chicago 'playboy'.\nIn July\n1939\n, the\nWashington Post\nreported on another tennis match:-\nGiddy Gilbert Hunt, George Washington University's mathematical wizard and eccentric extraordinary, forgot his cute capers long enough to come up with one of his great local tennis performances and whip Byran\n(\nBitsy\n)\nGrant in an exhibition on Rock Creek courts.\nOne reason that Hunt's tennis exploits gained so much publicity was that he was highly eccentric, so making a good story for the newspapers. Bob Considine, a Washington Post sportswriter, wrote frequently about Hunt, for example noting in\n1939\n:-\nHe is an extraordinarily gifted mathematics scholar and teacher, but somewhere in his curious makeup is a streak of daffiness that occasionally prompts him to remove his shoes in the middle of a match, and entertain his galleries by picking up objects with his toes. This, we might add, is done with a strange faraway look in his brooding black eyes, and an air of complete detachment. But shoeless or shod, when he is hot he is the hottest thing in an otherwise cold and clammy crop of cup defenders.\nHunt's studies at Brown University were interrupted in\n1941\nwhen the United States entered World War II. He was drafted into the US Army and\n[\n2\n]\n:-\n... was assigned principally to the research section of the air weather service. During that time, he achieved the rank of captain and used his mathematical prowess to help develop weather forecasts to ensure the success of D-Day and the Allied invasion on the Normandy coast.\nReleased from military service in\n1946\n, Hunt went to Princeton where he studied for his doctorate advised by\nSalomon Bochner\nbut at the same time acted as an assistant to\nJohn von Neumann\nat the Institute for Advanced Study. He was awarded a Ph.D. in\n1948\nfor his thesis\nOn Stationary Stochastic Processes\nbut continued to work for\nvon Neumann\nuntil\n1949\n. He then worked at Cornell University, Ithaca, New York, producing some impressive papers over the next years.\nIn\n1951\nHunt published\nRandom Fourier transforms\n.\nMark Kac\n, in a review, remarked that:-\nAlthough the methods used are closely related to those of\nPaley\nand\nZygmund\nthey are used in a powerful way to yield a wealth of new results. ... Theorem\n12\n, for example, contains as a special case the law of the iterated logarithm for the\nWiener\nprocess. The ingenious use of\nergodic theory\nis particularly noteworthy.\nHe then wrote\nChanges of sign of sums of random variables\njointly with\nPaul Erdős\nwhich was published in\n1953\n. In this paper Hunt gives his address both as Cornell University and as National Bureau of Standards, Los Angeles. He includes a note that:-\nThe preparation of this paper was sponsored\n(\nin part\n)\nby the Office of Naval Research, USN.\nHunt then published\nAn inequality in probability theory\n(1955)\nand a number of papers in\n1956\n. For example\nA theorem of Élie Cartan\n(1956)\nin which Hunt states:-\nAndré Weil\nand\nHopf\nand\nSamelson\nhave given a topological proof of the following theorem of\nÉlie Cartan\n. \"Two maximal abelian subgroups of a compact connected\nLie\ngroup G are conjugate within G.\" I present a simple metric proof.\nIn\nSemigroups of measures on Lie groups\n(1956)\n, he explains:-\nThis paper grew out of discussions with\nS Bochner\n. It would be hard now to disengage his contributions from mine. We shall characterise those families of finite positive measures on a\nLie\ngroup G which are weakly continuous and form a semigroup under convolution.\nAlso in\n1956\nhe published\nSome theorems concerning Brownian motion\n. Given a\nMarkov\nprocess and a random time, Hunt defines a new\nMarkov\nprocess. He writes:-\nAlthough mathematicians use this extended\nMarkov\nproperty, at least as a heuristic principle, I have nowhere found it discussed with rigour. We begin by proving a version for\nBrownian motion\n. Our statement has the good points that the hypotheses are easy to verify, and the proof is thoroughly elementary\n(\nit even avoids conditional probabilities\n)\n, and that it holds for all processes with stationary independent increments. I have not pushed the scope of the proof to the limit ...\nIn\n1957\nand\n1958\nhe published three papers with the title\nMarkov processes and potentials\n. In the first of these he gave a generalization of the well known relation of Brownian motion to potentials. A review of the next one begins as follows:-\nThis very important and original article establishes close connections between the general theory of potential and homogeneous\nMarkov\nprocesses.\nHunt was appointed to the faculty at Princeton on\n1959\n, teaching there until\n1962\nwhen he moved back to Cornell University. After spending the three years\n1962\n-\n65\nat Cornell, Hunt returned to Princeton where he taught until he retired in\n1986\n.\nHunt was an invited speaker at the International Congress of Mathematicians held\n15\n-\n22\nAugust\n1962\nin Stockholm. His lecture,\nTransformation of Markov processes\n, gave a direct treatment of the entrance boundary in the theory of Martin boundaries for diffusion or\nMarkov\nprocesses. In Europe for the Congress, Hunt spent part of session\n1962\n-\n63\nat Orsay in France where he gave a course of lectures on\nMartingales et processus de Markov\n. The notes, published in\n1966\n, provide:-\n... an introduction to the potential theory of\nMarkov\nprocesses, a theory to which the author has been a major contributor. ... The first chapter ... includes a discussion of conditional probabilities and independence, but the main emphasis is on obtaining some of the principal properties of\nmartingales\n. The second chapter deals with\nMarkov\nprocesses, principally with stationary transition probabilities. The theorems which state that under mild assumptions on the transition probabilities and state-space the corresponding process will have nice properties, such as right sample function continuity, quasi-left continuity, and strong Markov property, are established. A proof is given of the fact that the first entrance time into an analytic set is a stopping time. In the last section potential theory is reached and some important results are proved: the completed maximum principle for potentials, balayage, and the almost-\nBorel\nmeasurability of excessive functions.  The monograph is very readable.\nThe\n1960\ns, however, proved a very difficult period for Hunt. At the height of his mathematical powers, he suffered from macular degeneration and began to go blind. He could no longer play tennis, but even doing mathematics became more and more difficult as he tried to develop ways to enable him to continue his research.\nHunt married twice, and was twice divorced. His first marriage was to Mary with whom he had two children, Laurence and Margaret. His second marriage was to Helen with whom he had four children, Diana, Christopher, Lisa, and Gregory.\nWe have commented on Hunt's eccentric style of playing tennis. We also note that\n[\n1\n]\n:-\n... he liked to play barefoot, would sometimes wear a floppy farmer's hat and, if he did not think he was playing well, would walk off the court.\nOne of his colleagues at Princeton spoke of his wide interests\n[\n3\n]\n:-\nHe was very interested in all areas of mathematics, not just his own specialty. He was a Renaissance person, with a deep interest in literature and music as well as many other areas."
}