{
  "nome_completo": "Giordano Bruno",
  "nome_curto": "Giordano Bruno",
  "ano_nascimento": "1548",
  "ano_morte": "1600",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bruno_Giordano/",
  "lugar_nascimento": "Nola near Naples, Kingdom of Naples (now Italy)",
  "lugar_morte": "Rome, Papal States (now Italy)",
  "biografia": "Giordano Bruno\n's father, Giovanni Bruno, was a professional soldier who married Fraulissa Savolino. They baptised their son Filippo Bruno but later Filippo was called \"Il Nolano\" after the town of his birth which stands on the northeastern slope of Vesuvius. Only at the age of\n17\nwhen he entered the Dominican convent of San Domenico Maggiore in Naples, where Thomas Aquinas had taught, did Filippo take the name Giordano.\nBruno left his home town of Nola to travel to nearby Naples when he was\n14\nyears old to study there. He attended lectures on humanities, logic and dialectics in Naples and it was at this time that he was influenced by one of his teachers towards Averroism. This was Christian philosophy based on an interpretation of\nAristotle\n's works through the Muslim philosopher Averroes. Its basic belief was that reason and philosophy are superior to faith and knowledge founded on faith. We shall see as we relate the story of Bruno's life how he continued to be influenced by the ideas of Averroism.\nAfter his studies in Naples, Bruno entered the Dominican convent of San Domenico Maggiore in\n1565\ntaking at this time the name Giordano. His views were considered heretical by many in the convent, but nevertheless he was ordained a Catholic priest in\n1572\n. Returning to San Domenico Maggiore he took courses on theology, completing the full range of course there, but he was upset by certain points in the Christian teaching which was presented to him. He wrote later that the teaching:-\n... attempted to draw me from worthier and higher occupations, to lay my spirit in chains, and from a free man in the service of virtue to make me the slave of a miserable and foolish system of deceit.\nNever one to accept what he was taught without probing deeper into contrary views, Bruno read various banned texts and in particular discussed Arianism. This was the belief that Christ was inferior to God, but greater than man, making him divine but not God. The Church began to prepare to try Bruno for heresy but he avoided the trial by fleeing to Rome in February\n1576\n. Things went from bad to worse, for in Rome he was falsely accused of murder so in April\n1576\nhe fled again to avoid another impending attempt to excommunicate him.\nEnding up in Geneva, Bruno joined the Calvinist Church, but he soon discovered that this was no more tolerant of free thinkers than was the Roman Catholic Church. Arrested in Geneva, he found himself excommunicated from the Calvinist Church but after retracting he was allowed back into the that Church and was then free to leave Geneva. He went to France where he attempted to rejoin the Catholic Church while in Toulouse but his application was refused. From there he went to Lyon where he wrote Clavis Magna on the art of remembering which was a topic he specialised in. Moving on to Paris in\n1581\nBruno became a lecturer in philosophy at the University of Paris where he continued to develop his art of memory-training.\nParis seemed to provide an answer to Bruno's problems for his views were not seen to be a problem there. On the contrary he found favour with the French King Henry III who appointed him a Royal Lecturer in\n1582\n. In the following year Bruno went to London with a letter of introduction supplied by Henry III himself. Oxford seemed a place of learning that looked attractive to Bruno who visited there in the summer of\n1583\nand gave a series of lecturers on\nCopernicus\n's theory that the Earth rotated round the fixed Sun. It was probably Bruno's attitude rather than his scientific beliefs which were found unacceptable by the scholars of Oxford University and Bruno had little option but to return to London. He seems to have had a knack of falling out with people, even those with similar views to his own. However, one undergraduate student who attended his lectures in Oxford was Francis Godwin, who, as a consequence, wrote the first story of space travel in English literature\nThe Man in the Moone\n.\nBack in London, Bruno was soon in favour at the court of Elizabeth I and he made a number of highly influential friends. He continued to discuss\nCopernicus\n's theory but his discussions with several learned men degenerated into a quarrel. At this point Bruno decided to write down his ideas and this he did in three dialogues on cosmology and three dialogues on morality. His ideas on cosmology are quite remarkable for he not only argued for a moving Earth, but he also argued for an infinite universe containing other stars like the Sun and other worlds like the Earth. Of course Bruno was aware that this contradicted the Biblical version of the universe, but he put forward the same argument as\nGalileo\nwould some years later, namely that the Bible should be seen as providing moral teaching, not the teaching of physics. In his writings Bruno also argues that Christianity is a religion which is held through faith, not through philosophical or scientific reasoning.\nBruno also attacked\nAristotle\n's physics in these works and, after he returned to Paris in October\n1585\n, these views were to land him in trouble again. We should comment by way of explanation that due to Thomas Aquinas in the\n13\nth\ncentury,\nAristotle\n's philosophy and physics had become absorbed into Christianity. By the time Bruno returned to Paris the atmosphere had changed. The tolerant face which he had experienced before had gone and in its place there were struggles between the various religious factions. Bruno was never one to keep his head down, and he lectured publicly opposing the views of\nAristotle\n. He also attacked a young Catholic mathematician Fabrizio Mordente, publishing four dialogues which made fun of Mordente's views. Bruno was forced to leave Paris and he went to Germany where he travelled around the universities lecturing on his beliefs, and attacking the views of mathematicians and philosophers.\nHis teachings that different Christian Churches should be allowed to coexist and that they should respect each others views does not look to our eyes a major crime but it did not go down well in the religious climate which then prevailed. His teachings of peace between churches led to his being excommunicated from the Lutheran Church in January\n1589\nwhile he was in Helmstedt. He remained in Helmstedt where he wrote a number of texts and poems on what can best be described as mathematical magic but, like so much of his work, they contain some remarkable insights among the magic, including an atomic theory for matter. Bruno went to Frankfurt in\n1590\nwhere he hoped to publish these works but was not welcome in the town. He lived for a while in a Carmelite convent and continued to lecture on his views.\nIn the following year Bruno was invited to return to Italy and, thinking that the Catholic Church was now more tolerant following the death of the strict Pope Sixtus V, he accepted. Many believe that the invitation was a trick to bring him before the Inquisition, and Bruno fell for it. He was clearly aware that Padua were looking to fill the chair of mathematics and Bruno thought that this would give him just the platform he wanted to make his views more widely known. He went to Padua where he wrote\nLectures on Geometry\nand\nArt of Deformation\n. He also taught a private course for German students in Padua at this time. However by late\n1591\nthe University of Padua made it clear to Bruno that they wanted\nGalileo\nto fill the vacant chair mathematics and not him. Bruno then went to Venice where he was a guest of Mocenigo, one of the most famous patrician families of the Venetian Republic. It was Mocenigo who handed him over to the Inquisition with written accusations, which is why many feel that they tricked him with the invitation.\nInvolved in discussions with those who shared his views that investigation of natural philosophy should be possible even if it led to ideas which were not accepted by the Church, he was an obvious target for the Venetian Inquisition which had him arrested on\n22\nMay\n1592\n. He had always advocated \"Libertas philosophica\" - the freedom to think and to make philosophy. A trial was set up at which Bruno defended his right to hold views on the nature of the universe which, he claimed, were not theological. It appeared that his line of argument was going to win the day, but at this point the Roman Inquisition demanded that he be sent to Rome to be tried by them.\nIn January\n1593\nBruno arrived in Rome and his trial began which was to drag on for seven years. At first Bruno defended himself with the same arguments as he had used when tried by the Venetian Inquisition. The Roman Inquisition, however, declared that his views on physics and cosmology were theological and demanded that he retract. Bruno answered quite honestly that he did not know what he was being asked to retract, trying to convince the Inquisition that his views were in accord with Christianity. Pope Clement VIII demanded that Bruno be sentenced as a heretic and the Inquisition passed the death sentence on him. On hearing the sentence he responded:-\nPerhaps your fear in passing judgment on me is greater than mine in receiving it.\nHe was gagged so that onlookers would not be seduced by any of his heretical statements and burned alive at the Campo de' Fiori on\n17\nFebruary\n1600\n. It is now generally recorded that Bruno was burned at the stake for his belief that the universe is infinite, but as we have seen the whole affair was considerably more complicated than that. In a strange way Bruno almost seems to have challenged the Inquisition to try him. Perhaps he thought this would give him the best possible platform from which to make his beliefs known.\nIt is hard to give an accurate assessment of Bruno's views. Certainly he presented some ideas which are quite remarkable for their inspired insight. In\nOn Cause, Principle, and Unity\nhe wrote:-\nThis entire globe, this star, not being subject to death, and dissolution and annihilation being impossible anywhere in Nature, from time to time renews itself by changing and altering all its parts. There is no absolute up or down, as Aristotle taught; no absolute position in space; but the position of a body is relative to that of other bodies. Everywhere there is incessant relative change in position throughout the universe, and the observer is always at the centre of things.\nOther insights amaze physicists today who can see ideas of quantum theory in Bruno's writings. However, others feel that the inclusion of much which is magic into his works minimises the importance of those remarkable insights. Another reason for Bruno to be downgraded for his achievements is that his knowledge of mathematics and science was not that great and this makes some historians tend to believe that his insights were more luck than understanding. He is seen by some to be a martyr for science, while others see his actions as foolish and describe him as:-\n... brilliant, contentious, and ultimately self-destructive."
}