{
  "nome_completo": "Giovanni Antonio Amedeo Plana",
  "nome_curto": "Giovanni Plana",
  "ano_nascimento": "1781",
  "ano_morte": "1864",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plana/",
  "lugar_nascimento": "Voghera (now Italy)",
  "lugar_morte": "Turin, Italy",
  "biografia": "Giovanni Plana\n's father was Antonio Maria Plana while his mother was Giovanna Giacoboni. Two of Giovanni's uncles lived in Grenoble and his father sent him there in\n1796\n, at age about\n15\n, to complete his schooling. In Grenoble he became a close friend of Henri Beyle, the famous French author better known by his pseudonym Stendhal.\nWe should mention the political events which occurred in Europe around this time and had a large influence on the lives of many of the mathematicians we study in this archive. In April\n1796\nthe French army under the command of Napoleon had invaded Italy. There followed a period when many intellectuals moved to a new way of thinking and enthusiastically took part in the democratic movement. Plana, although a young man at the time, was certainly one of those who embraced this new way. This aspect of his life between\n1796\nand\n1799\nis studied in\n[\n4\n]\n.\nIn\n1800\nPlana entered the École Polytechnique in Paris. There he was greatly influenced by\nLagrange\nwho was one of his teachers and, of course, also someone of Italian birth.\nFourier\n, like\nLagrange\n, was greatly impressed by Plana's abilities and he tried to arrange for him to be appointed to the chair of mathematics at the school of artillery at Grenoble. However,\nFourier\nfailed in his attempt on behalf of Plana, so he tried again, this time to have Plana appointed to the chair of mathematics at the school of artillery in the Piedmont which was located part in Turin and part in Alessandria. This attempt was successful and Plana returned to Italy in\n1803\nto take up this post.\nAfter further victories by Napoleon, the Treaty of Pressburg was signed by Austria and France on\n26\nDecember\n1805\n. Austria was forced to give up much territory to France, and in particular Napoleon wanted Austrian influence completely removed from Italy. As a consequence Piedmont was given to France so Plana found himself in France again without making a move! In\n1811\nLagrange\nrecommended Plana for the chair of astronomy at the University of Turin, and Plana was appointed to the position. He would teach in Turin for the rest of his life, teaching both astronomy and mathematics, and teaching both at the university and at the school of artillery there.\nTopics Plana worked on, in addition to astronomy, were integrals,\nelliptic functions\n, heat, electrostatics and geodesy. In astronomy his most famous work relates to the motion of the moon. Plana had already worked with Francesco Carlini on geodesy, and the director of the observatory in Milan suggested to Plana that he might collaborate with Carlini on problems relating to the motion of the moon. This episode is described in detail in\n[\n5\n]\nand we quote here part of the summary of that paper:-\nIn\n1818\nLaplace\nproposed that the\nAcadémie des Sciences\nin Paris set up a prize to be awarded to whoever succeeded in constructing lunar tables based solely on the law of universal gravity. In\n1820\nthe prize was awarded to Carlini and Plana and to Damoiseau by a committee of which\nLaplace\nwas a member. But\nLaplace\nstrongly criticised the Carlini-Plana approach to lunar theory. A dispute ensued ... letters\n[\nwere\n]\nexchanged between Carlini-Plana and\nLaplace\n, and ... papers published in Connaissance des temps and in Zach's Correspondance. After the exchanges, public and private, between Carlini-Plana and\nLaplace\n, the latter concluded that the results of the Italian astronomers and those arrived at by Damoiseau following the method of\nLaplace\n's 'Mecanique céleste' were fairly close, and that the purpose of the\nAcadémie\nin establishing the prize had been reasonably fulfilled.\nIn fact Plana fell out with Carlini and Carlini withdrew from the collaboration. Plana continued with the work on his own and published\nThéorie du mouvement de la lune\nin Turin in\n1832\n. By this time Plana was astronomer royal, and he went on to become a hereditary baron in\n1844\nand a senator in\n1848\n. When he was nearly\n80\nyears old, in\n1860\n, he was elected a member of the\nAcadémie des Sciences\nin Paris.\nFinally let us return to talk a little of Plana's association with the\nTurin Academy of Sciences\n. The article\n[\n3\n]\ndescribing the\nAcademy of Sciences\nstates that Plana's studies on lunar motion were the most important presented to the Academy at the beginning of the nineteenth century. An important event for mathematics in Turin occurred when\nCauchy\nlived in Turin during the year\n1832\n-\n33\n. He held the chair of mathematical physics at the University of Turin during a period when he was highly active in research, yet political events forced him to leave Paris.\nCauchy\nand Plana certainly interacted during this time and their relationship is discussed in\n[\n6\n]\n.\nAnother famous scientist who interacted with Plana was\nBabbage\n. He was elected to the\nTurin Academy of Sciences\nin\n1841\nand the article\n[\n7\n]\nexamines his relations with the Academy and with some of its members, including in particular Plana.\nPerhaps the most important aspect of Plana's contribution is summed up by Tricomi in\n[\n1\n]\nas follows:-\nPlana is generally considered one of the major Italian scientists of his age because, at a time when the quality of instruction at Italian universities had greatly deteriorated, his teaching was of the highest quality, quite comparable with that of the grandes écoles of Paris, at which he had studied."
}