{
  "nome_completo": "Gladys Isabel Mackenzie",
  "nome_curto": "Gladys Mackenzie",
  "ano_nascimento": "1903",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mackenzie/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "North York, Ontario, Canada",
  "biografia": "Gladys Mackenzie\n's father was Lachlan Paterson Mackenzie, an ironfounder, of Polwarth Terrace, Edinburgh. Her mother, Helen Macgregor Martin, was a teacher. Gladys attended Craigmount School, Edinburgh, from\n1913\nto\n1919\nand, in passing, we note a news item which tell us that in\n1914\nshe took part in \"a fancy dress frolic for children under twelve dressed as a Normandy Peasant.\" She sat the Scottish Leaving Certificate Examinations and obtained passes at Higher level in English, French, Latin, and Mathematics, having obtained a pass in Lower mathematics in the previous year.\nIn\n1919\nMackenzie matriculated in the Faculty of Arts at the University of Edinburgh giving Church of Scotland as her Religious Denomination. She studies a wide range of courses. At Ordinary level: Mathematics\n(1\nst\nand\n2\nnd\nOrdinary\n)\n, Chemistry, Natural Philosophy, Philosophy. At Honours level: Natural Philosophy, Mathematics, Final Natural Philosophy, Final Mathematics, Calculus, General Analysis, Heat, Electricity I and II, General Physics, Higher Algebra and Geometry. She graduated M.A. on\n17\nJuly\n1924\nwith First Class Honours in Mathematics and Natural Philosophy. She was also awarded a B.Sc.\nMackenzie was appointed as an Assistant in the Department of Natural Philosophy in the University of Edinburgh. She worked with\nCharles Glover Barkla\n, the Professor of Natural Philosophy, and wrote two joint papers with him both published in the\nPhilosophical Magazine: Notes on the superposition of x-rays and on scattering: the J phenomenon\n(\nPart III\n)\n(\nFebruary\n1926)\nand\nNotes on scattered x-rays: the J phenomenon\n(\nPart V\n)\n(\nNovember\n1926)\n.\nAfter working in Edinburgh for two years, Mackenzie was appointed to a Lectureship in Physics at Newnham College, Cambridge in\n1926\n. The announcement of her appointment appeared in August\n1926\n:-\nIn August\n1926\n: Miss Gladys I Mackenzie, daughter of Mr I P Mackenzie of Polwarth Terrace, Edinburgh, and at present an Assistant in the Department of Natural Philosophy in the University of Edinburgh, has been appointed to the Lectureship in Physics at Newnham College, Cambridge. Miss Mackenzie graduated with First-Class Honours in Mathematics and Natural Philosophy as recently as\n1924\n.\nThe Newnham College Roll letter of January\n1927\n(\nreporting for\n1926)\nsays:-\nMiss G I Mackenzie has been appointed to succeed Miss Slater as Lecturer in Physics. Miss Mackenzie is an M.A. and B.Sc. of Edinburgh University, and she was a demonstrator in the Physics Laboratory of Edinburgh University at the time of her appointment.\nGladys Mackenzie joined the\nEdinburgh Mathematical Society\nin March\n1925\n. She continued her membership when she went to Newnham College, Cambridge but she left the Society in\n1930\n.\nOn\n14\nMarch\n1929\nMackenzie married Wallace Russell Harper, Ph.D. who was also a physicist; they had one son. In\n1930\nthe Newnham College Roll letter\n(\nreporting for\n1929)\nsays:-\nMrs W R Harper\n(\nMiss G I Mackenzie\n)\n, who had been lecturer in Physics since\n1926\n, resigned her post this year, and the Council appointed Miss A C Davies\n(\nD.Sc. Lond.\n)\nto succeed her.\nGladys Harper, now her married name, was a Bristol University Carnegie Research Scholar in\n1929\n-\n30\n, then a Research Fellow from\n1930\nto\n1933\n. She was employed part-time at Bristol University to undertake both teaching and research from\n1933\nto\n1939\n, then she was appointed as a lecturer in the Department of Physics, a position she held until\n1947\n. Papers published by Harper during this period include:\nG I Harper and E Salaman, Measurements on the Ranges of Alpha-Particles,\nProc. Roy. Soc\n. A\n127\n(1930)\n,\n175\n-\n185\n.\nG I Harper, On Crystal and Slit Systems for X-Ray Monochromatization and Spectroscopy,\nProc. Roy. Soc\n.  A\n151\n(872)\n(1935)\n,\n118\n-\n141\n.\nIn the Introduction to this latter paper Harper writes:-\nCrystal and slit systems are used for four purposes in X-ray physics:\n(\ni\n)\nanalysis of crystal structure,\n(\nii\n)\nwave-length determinations;\n(\niii\n)\nspectroscopic analysis of composite radiations; and\n(\niv\n)\nthe production of monochromatic beams.\nThe theory of\n(\ni\n)\nand\n(\nii\n)\nhas been discussed by many authors; but hitherto the theory of\n(\niii\n)\nand\n(\niv\n)\nhas received but little attention,\n(\nsee G I Harper, Proc. Camb. Phil. Soc., vol.\n29\n(1933\n, Page\n408)\nthough Richtmyer has pointed out that serious errors may arise from a neglect of the proper consideration of\n(\niv\n)\n. In this paper a systematic theory of\n(\niii\n)\nand\n(\niv\n)\nwill be presented, and some results will be obtained that could hardly have been anticipated on general grounds. Furthermore, an application of the theory to the design of monochromators leads to notable departures from the conventional pattern.\nIn\n1952\nHarper was appointed as a part-time teacher at Channing School in Highgate, London. She taught there until\n1958\nwhen she became a part-time Lecturer in Physics at Queen Elizabeth College, London. She continued in this position until she retired in\n1970\n, the year her husband died, when she was made an Honorary Lecturer of the College. Mary Embleton, who was a pupil at Channing School, writes\n[\n3\n]\n:-\nShe was, apparently, an excellent physics teacher\n(\nthough I didn't take physics\n)\n, and although she was known as Mrs I think she had a doctorate. She was a fearfully intelligent woman, married to a professor at Imperial\n(\nalso a scientist\n)\n. Although apparently something of a bluestocking type, she drove a very racy Bristol\n(\nso clearly they weren't short of the odd bob\n)\n. I seem to remember that she had a couple of sons - though I can't recall even where they went to school\n(\npossibly Westminster??\n)\n. She was a great friend of my Spanish teacher, Mary Levy, now deceased."
}