{
  "nome_completo": "Francisco Gomes Teixeira",
  "nome_curto": "Gomes Teixeira",
  "ano_nascimento": "1851",
  "ano_morte": "1933",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Teixeira/",
  "lugar_nascimento": "São Cosmado, Armamar, Viseu, Portugal",
  "lugar_morte": "Porto, Portugal",
  "biografia": "Gomes Teixeira\n's parents were Manuel Gomes Teixeira Pinto, a merchant, and his wife Maria Magdalena Machado. Gomes had two brothers, Pedro who became a military engineer, and Sebastiao who became a trader in Sao Cosmado. He also had a sister Victoria Carolina. Gomes was baptised on\n6\nFebruary in the church of his home town. His godparents were his cousin Dr Francisco Gomes de Carvalho and Maria Jose Teixeira.\nGomes began his education in his home town of São Cosmado, which is about\n80\nkm east of Porto. This small town had around\n600\ninhabitants when Gomes was born there and his initial education, where he was taught reading and writing, was at a primary school which, in July\n1924\n, was renamed \"School EB\n2\n/\n3\nGomes Teixeira.\" For his secondary education, however, he had to move to the larger town of Lamego, about\n12\nkm north west of São Cosmado. There he lived in the house of his cousin Francisco Carvalho, who was a doctor in the town, and attended the Padre Roseira College. This college had been founded in\n1859\nand, at the time that Teixeira studied there, the director was the founder of the College, António Joaquim Lopes Roseira. As Teixeira's education progressed he was drawn in two different directions. His father was keen that he should study theology or law and wanted him to train in both these areas. The cousin, whom he was staying with, saw that Teixeira was a talented scientist and suggested that he should study mathematics and physics at university. Many years later, talking about his time at school, he said\n[\n1\n]\n:-\nThe subject that most attracted my attention was Physics, since it explained phenomena I saw every day. I had no affection or aversion to mathematics, I studied it, and well, just to do my schoolwork.\nHis father asked young Teixeira which of these options he would prefer and, perhaps surprisingly, he said he was happy to follow either the theology or the science option. His father then told him to let luck decide and, after tossing a coin, luck chose the science option. It turned out to be a lucky toss of the coin but, as we see from the quote above, at this stage Teixeira was more attracted to physics than to mathematics.\nThere was a problem, however, since the College in Lamego did not train their pupils for the examinations which would give university entry. He therefore went, in\n1868\n, to Coimbra where he studied at the S Bento College preparing to take the examinations. In\n1869\nTeixeira enrolled in the Mathematics Faculty of the University of Coimbra and he lived in the house of Filipe Quental\n(1824\n-\n1892)\n. Quantal, after studying mathematics and philosophy, had gone on to study medicine and was a professor in the medical school at Coimbra. Things did not go well at first for Teixeira, mainly because his health was poor. After attending the first few mathematics lectures, he returned to Sao Cosmado with the idea that he should change to a different faculty and study a different topic. However, after returning to the university, Teixeira was taught by Tôrres Coelho who strongly influenced him to become a mathematician. He explained in an interview later in his life how Coelho encouraged him\n(\nsee\n[\n1\n]\n)\n:-\n... I went to the University of Coimbra, with the plan that, if I could succeed in the mathematics course, then I would proceed to follow military engineering. One of my teachers, Dr Torres Coelho, after encouraging me twice to his lectures, went to tell Dr Filipe Quental, in whose house I was living, that he considered me to be the best student on the course. Knowing this, I felt stimulated. This fact has decided on my final predilections. Since then I have devoted myself exclusively to mathematics ....\nIn his first year of study,\n1869\n-\n70\n, Teixeira took courses on Higher Algebra, Inorganic Chemistry and Technical Drawing. He won a prize for his performance in algebra. In his second year of study,\n1870\n-\n71\n, he took the course on Differential and Integral Calculus, for which he was awarded a prize, and courses on Organic Chemistry, Analytic Chemistry and Physics. His performance had been outstanding and in\n1871\n, while still an undergraduate, he wrote\nDesenvolvimento das funçoes em fracçao continua\nⓉ\n(\nDevelopment of functions as continuous fractions\n)\nwhich showed how to develop functions as continued fractions and applied these techniques to approximate roots of equations using rapidly converging series. One of Teixeira's lecturers at the University of Coimbra was\nDaniel Augusto da Silva\n(16\nMay\n1814\n-\n6\nOctober\n1878)\n. He had been a naval officer before becoming a lecturer at Coimbra and had been elected a full member of the\nRoyal Academy of Sciences of Lisbon\nin\n1859\n. He was impressed with Teixeira's paper and encouraged him to submit some of his work to the Royal Academy of Sciences and, in\n1872\n,\nda Silva\npresented Teixeira's paper\nAplicaçao das fracçoes continuas à determinaçao das raizes das equaçoes\nⓉ\n(\nApplication of the continuous fractions to the determination of the roots of the equations\n)\nto the\nRoyal Academy of Sciences of Lisbon\nand it was published in volume\n4\n(1872\n-\n73)\nof their\nJournal\n.\nIn\n1871\n-\n72\nhe took courses on Rational Mechanics, Descriptive Geometry and Physics. In his fourth year,\n1872\n-\n73\n, he studied Practical Astronomy, Geodesy and Botany. In his final year,\n1873\n-\n74\n, he studied Celestial Mechanics, Mathematical Physics and Mineralogy. After graduating with his first degree on\n21\nJuly\n1874\nwith the highest possible grade, Teixeira continued to undertake research at Coimbra and on\n8\nJanuary\n1875\nsubmitted his thesis\nImportância da observaçao do transito de Venus pelo disco do sol para a determinaçao da paralaxe solar. Apreciaçao dos diversos methodos de observaçao\nⓉ\n(\nImportance of observing the transit of Venus by the disk of the sun for the determination of solar parallax. Appreciation of the various methods of observation.\n)\n. On\n19\nJune he submitted his thesis\nNota sobre o numero das funçoes arbitrarias que entram no integral de uma equaçao ás derivadas parciaes\nⓉ\n(\nNote on the number of arbitrary functions that enter into the integral of an equation of the partial derivatives\n)\n. On\n30\nJune\n1875\nhe defended his inaugural thesis\nIntegraçao das equaçoes à derivadas parciais de segunda ordem\nⓉ\n(\nIntegration of equations of second order partial derivatives\n)\nand his second thesis\nTheses de Mathematicas puras e applicadas\nⓉ\n(\nThesis on pure and applied mathematics.\n)\n. Just over two weeks later, on\n18\nJuly, he graduated as a \"Doctor of Mathematics\" with the highest possible grade.\nAt the age of\n25\n, in\n1876\n, Teixeira was appointed as a Substitute Lecturer at the University of Coimbra. In the same year he was elected as a corresponding member of the\nRoyal Academy of Sciences of Lisbon\n. At this time his work became better known internationally when he published\nSobre o emprego dos eixos coordenados obliquos na Mecanica analytica\nⓉ\n(\nOn the use of the oblique coordinate axes in analytical mechanics\n)\n(1876)\n. Among the papers he published in the following few years we mention several in French, namely\nSur la décomposition des fractions rationnels\nⓉ\n(\nOn the decomposition of rational fractions\n)\n(1877)\n,\nSur le nombre des fonctions arbitraires des intégrales des équations aux dérivées partielles\nⓉ\n(\nOn the number of arbitrary functions of integrals of partial differential equations\n)\n(1878)\n,\nSur les dérivées d'ordre quelconque\nⓉ\n(\nOn derivatives of any order\n)\n(1880)\nand\nSur les principes du calcul infinitésimal\nⓉ\n(\nOn the principles of infinitesimal computation\n)\n(1880)\n.\nIn\n1877\nTeixeira founded the journal\nJornal de Ciências matemáticas e astronómicas\nwhich was published by Coimbra University Press. This journal played an important role in encouraging research in mathematics and astronomy in Portugal and it was published for\n28\nyears. After that it was integrated into the journal\nAnais Scientificos da Academia Politécnica do Porto.\nIn the second volume of this journal, which appeared in\n1880\n, Teixeira published a paper on the integration of second order linear partial differential equations and an obituary of\nGiusto Bellavitis\n.\nA rather strange career move happened in\n1878\n. Teixeira was named as third astronomer at the Astronomical Observatory of Lisbon in that year. Although this does not seem particularly strange, in fact he only remained in that position for four months and after that time he returned to the University of Coimbra. As well as his mathematical interests, Teixeira was involved in politics and in\n1879\nhe joined the Regenerator Party and was elected to the Parliament. The Regenerator Party was a conservative, right wing party which had been formed in\n1851\nand was one of the two major political parties that held power in Portugal during the second half of the\n19\nth century. At the time that Teixeira was elected, the leader of the party was Fontes Pereira de Melo who was Prime Minister of Portugal from January\n1878\nto May\n1879\nand again from November\n1881\nto February\n1886\n. In addition to his academic duties, Teixeira participated in parliamentary sessions and on\n19\nMay\n1883\nhe became a member of a parliamentary committee:-\n... whose powers were extended to inquire into the negotiations of the public administration in the overseas provinces.\nAlthough Teixeira does not seem to have played a major role in the Regenerator Party, it is clear from a number of letters that he received that he was very well respected by the other members.\nIn November\n1879\n, Teixeira took charge of the teaching of mathematical analysis at Coimbra and, in February of the following year, he was named as Professor.\nIn\n1881\n, Teixeira married Ana Arminda Cardoso who was\n17\nyears old. Ana, the only daughter of a trader, had been born in Porto. Gomes and Ana Teixeira had a son who was stillborn, and three daughters. In\n1883\n, for family reasons, Teixeira moved to Porto where he was appointed to the Polytechnic Academy. In Porto, the Teixeira family lived in Rua de Costa Cabral in the house where Ana's parents lived. At the Polytechnic Academy, Teixeira occupied the chair of differential and integral calculus. In\n1886\nhe was named as Director of the Polytechnic Academy, a position he held until\n1911\n. Although the family lived in Rua de Costa Cabral for most of the year, they owned a second house in Rua do Godinho in the centre of the town of Matosinhos, only a short distance north of Porto. The family spent holidays in this second home in Matosinhos.\nIn\n1892\nthe\nSpanish Royal Academy of Sciences\nproposed a prize problem requiring:-\nAn orderly list of all the curves of every kind to which definite names have been assigned, accompanying each with a succinct exposition of its form, equations and general properties, and with a statement of the books in which, or the authors by whom, it was first made known.\nThe problem was posed again in\n1895\nand, in\n1899\nTeixeira was awarded the prize for his entry which was published as\nTratado de las Curvas Especiales Notables\nⓉ\n(\nTreatise on notable special curves\n)\nin\n1905\n. For an extract from a review of this work by Charles H Sisam, see\nTHIS LINK\n.\nWhen Teixeira moved to Porto, the city had no university. The Polytechnic Academy, which had been founded in\n1837\n, was one of a number of institutions which trained students. Others included the Nautical Class\n(\nestablished\n1762)\n, the Drawing Class\n(\nestablished\n1779\nand becoming the Porto School of Fine Arts in\n1881)\n, the Royal Academy of Maritime and Trade Affairs\n(\nestablished\n1803)\n, and the Royal School of Surgery\n(\nestablished\n1825)\n. Up to\n1910\n, Portugal was a constitutional monarchy but, following the\n5\nOctober\n1910\nrevolution, the Portuguese Republic was established. Soon after that, on\n22\nMarch\n1911\n, the University of Porto was founded which incorporated some of the earlier educational institutions. Initially, the university had two faculties, Science and Medicine. Teixeira was appointed as the first president of the University of Porto and served in that role from\n1911\nto\n1917\n. After his term as president ended, he was made honorary president. During these years as President and honorary President, he continued to teach mathematics in the Chair of Differential and Integral Calculus.\nTeixeira had an amazing publication record and Henrique de Vilhena in\n[\n4\n]\nlists nearly\n300\npublications. As well as numerous papers, he also wrote books in Portuguese, Spanish and French. We give a selection of extracts from reviews of these books at\nTHIS LINK\n.\nTo show the high regard for these works, we give a few sentences here from these reviews.\nJames Pierpont\nreviewing Teixeira's Portuguese three volumes work\nCourse of Infinitesimal Analysis\n(1892\n-\n96)\nwrites\n[\n13\n]\n:-\n[\nTeixeira\n]\n, the distinguished director of the Academia Polytechnica at Porto, has been uniformly successful in the difficult task of selecting from the immense material available. The manner of presentation leaves nothing to be desired. The style is lucid and elegant, and the whole work bears in a refreshing manner the imprint of an original mind.\nThe anonymous reviewer\n[\n4\n]\nwrites:-\nDr Teixeira has laid under tribute practically the whole of available mathematical literature. Vast as is his display of erudition, he has marshalled, modernised, and presented his material with great skill.\nRaymond C Archibald\n, reviewing another of Teixeira's books, writes\n[\n8\n]\n:-\nWe heartily recommend Professor Gomes Teixeira's book for every mathematical library, as no other publication of the kind can take its place. The little book is characterized by marked individuality.\nAfter he retired from teaching at the University of Porto, Teixeira embarked on his last major work, namely a history of mathematics in Portugal. This work,\nHistória das matemáticas em Portugal\nⓉ\n(\nHistory of mathematics in Portugal,\n)\n, only appeared in\n1934\n, the year after he died. The book begins as follows:-\nThe object of this book is the history of the culture of Mathematics in Portugal from the foundation of the Kingdom until the middle of the nineteenth century and the relations of this culture with the political evolution of the country. In order to appreciate the state of the studies of that history at the time this book appears, we briefly mention and analyse the works previously published on this subject; and in order to place the special subject which is the subject of this book within the framework of the general history of mathematical thought, we will give a detailed account of the evolution of this thought from antiquity to the emergence of the sciences in Portugal. These are the subjects that we are going to study in this Introduction. Pure mathematics is closely linked to Cosmology, which illuminates it, and Philosophy, which directs scientific thought; so to the history of those sciences we will join the history of Astronomy, a science that in Portugal played a great role in nautical studies, and, from time to time, some notions of the history of Physics and Philosophy.\nFor an extract from this book, in which Teixeira writes about his teacher\nDaniel da Silva\n, see\nTHIS LINK\n.\nTeixeira received many honours. He was awarded honorary doctorates by the University of Madrid and the University of Toulouse. He received the Binoux Prize for the History of Mathematics from the\nAcademy of Sciences of Paris\nin\n1917\n. There are streets and squares named for him in a number of towns: the Gomes Teixeira Square in Porto; the Rua Professor Doutor Francisco Gomes Teixeira, Porto; Rua Professor Doutor Francisco Gomes Teixeira in Carnaxide, Oeiras, Lisbon; and the Rua Francisco Gomes Teixeira in Setubal.\nFollowing his death in\n1933\n, Teixeira was buried in the cemetery of the Church of São Cosmado."
}