{
  "nome_completo": "Grigori Yakovlevich Perelman",
  "nome_curto": "Grigori Yakovlevich Perelman",
  "ano_nascimento": "1966",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Perelman/",
  "lugar_nascimento": "Leningrad, USSR (now St Petersburg, Russia)",
  "lugar_morte": null,
  "biografia": "Grigori Yakovlevich Perelman\n's parents are Yakov Perelman, an electrical engineer, and Lubov Lvovna, who was a teacher of mathematics at a technical college. They were Jewish, which would present their son with some problems in a country where it was feared that those of Jewish descent had divided loyalty. Grigori Yakovlevich, their first child, is often known by the name Grisha. As a young child Grisha was taught to play the violin both by his mother and by a private tutor. His father also had a major influence in developing his son's problem solving skills. Speaking about his father, Perelman said\n(\nsee\n[\n11\n]\n)\n:-\nHe gave me logical and other maths problems to think about. He got a lot of books for me to read. He taught me how to play chess. He was proud of me.\nHis mother also helped develop his mathematical skills and, by the time he was ten, he had taken part in district mathematics competitions and shown a marked talent. Lubov sought advice about how best to develop Grisha's mathematical talents and was advised to send him to a mathematics club run by a nineteen year old coach named Sergei Rukshin. The club met twice a week at the Palace of Pioneers at the end of the school day and Rukshin, an undergraduate student at Leningrad University, had some novel ways of getting the best out of the boys who came to the club.\nRukshin quickly  saw Perelman's potential even though at first there was little to distinguish him from other bright children in the group. There developed a bond, an understanding, between the two with Perelman becoming Rukshin's favourite pupil. In the summer of\n1980\nRukshin tutored Perelman in English so that he could enter Leningrad's Special Mathematics and Physics School Number\n239\nin September of that year. To allow Perelman to get this intense tuition, learning the English covered in four years of schooling in a few weeks, the Perelman family had to remain in Leningrad over the summer rather than going to the country which would have been the norm. Lessons were conducted walking round the parks of Leningrad and successfully achieved their aim.\nThe class that Perelman entered in School\n239\nwas unusual in that the group of highly talented mathematicians tutored by Rukshin were put into the same class. At the school Valery Ryzhik became both their class teacher and their mathematics teacher. Ryzhik was an extraordinarily talented mathematics teacher but the class containing Rukshin's collection of mathematical geniuses proved almost an impossible challenge for him. As well as mathematics, Ryzhik ran a chess club on one evening a week which Perelman attended, showing considerable talents at the game. When he was fifteen, Perelman attended the summer camp run by Rukshin. This was the first time that he had spent a night away from his mother but the bond between Rukshin and Perelman helped the potentially difficult situation. Rukshin not only trained his club boys to be the best solvers of mathematics problems but also tried to broaden their interests. Perelman was already interested in the violin and classical music but Perelman was able to broaden his musical interests. Although he would attend camps with Rukshin, Perelman never took part in the trips arranged by Ryzhik.\nIn January\n1982\nPerelman was chosen as a potential member of the\n1982\nSoviet Mathematical Olympiad team. He attended a selection session in Chernogolovka, about\n80\nkm north of Moscow, where in addition to the mathematical training they were subjected to stiff physical exercises in the gym. Perelman excelled and the next step was a two-day session in Odessa in April when they were given harder problems than those expected at the Olympiad competition. Perelman achieved full marks as he did at the International Mathematical Olympiad competition in Budapest in July. He received a gold medal and a special prize for achieving a perfect score. Being a member of the Soviet team gave Perelman automatic entry to university.\nPerelman entered Leningrad State University in autumn\n1982\n. There he was particularly influenced by Viktor Zalgaller and\nAleksandr Danilovic Aleksandrov\n. During his undergraduate years he assisted Rukshin as a mathematics tutor, going to summer camps, but his incredibly high standards gave even outstanding students an almost impossible time. Eventually Rukshin had to stop Perelman assisting at the summer camps. His university work, however, was exceptional and he graduated in\n1987\n. He had already published a number of papers:\nRealization of abstract k-skeletons as k-skeletons of intersections of convex polyhedra in\nR\n2\nk\n−\n1\n\\mathbb{R}^{2k-1}\nR\n2\nk\n−\n1\n(\nRussian\n)\n(1985)\n;\n(\nwith I V Polikanova\n)\nA remark on Helly's theorem\n(\nRussian\n)\n(1986)\n; a supplement to\nA D Aleksandrov\n's,\nOn the foundations of geometry\n(\nRussian\n)\n(1987)\nin which Perelman discussed the equivalence of a\nPasch\n-style axiom of\nAleksandrov\nand some of its consequences; and\nOn the k-radii of a convex body\n(\nRussian\n)\n(1987)\n.\nOne might imagine that his achievements would mean that he would be welcomed as a graduate student at the Leningrad branch of the Steklov Mathematics Institute with open arms. However, under\nIvan Vinogradov\n's leadership the\nSteklov\nMathematics Institute had accepted no Jews and, although it now had a new director, the old policies persisted.\nAleksandr Danilovic Aleksandrov\nwrote to the director requesting that Perelman be allowed to undertake graduate work under his supervision at the Leningrad branch of the\nSteklov\nMathematics Institute. The request, highly unusual coming from someone of\nAleksandrov\n's high standing, was granted but, although\nAleksandrov\nwould be his official advisor, in practice it was Yuri Burago who took on the role. Perelman defended his thesis\nSaddle Surfaces in Euclidean Spaces\nin\n1990\n. He had already published one of the main results of the thesis in\nAn example of a complete saddle surface in\nR\n4\n\\mathbb{R}^{4}\nR\n4\nwith Gaussian curvature bounded away from zero\n(\nRussian\n)\n(1989)\n.\nBurago contacted\nMikhael Leonidovich Gromov\nwho had been a professor at Leningrad State University, but was at this time a permanent member of the Institut des Hautes Études Scientifiques outside Paris. He explained to\nGromov\nthat he had an outstanding student and asked if an invitation could be issued for him to spend time at IHES. The invitation allowed Perelman to spend several months at IHES working with\nGromov\non\nAleksandrov\nspaces. Perelman's first major paper, written jointly with Burago and\nGromov\n, was\nA D Aleksandrov spaces with curvatures bounded below\n(1992)\n. Tadeusz Januszkiewicz begins a review as follows:-\nThis is an important paper in many respects. It contains a careful and fairly detailed discussion of basic facts of the theory, including various equivalent forms of definitions. It recognizes that the home of various important theorems of Riemannian geometry is the theory of\nAleksandrov\nspaces, that both statements and proofs become more satisfactory\n(\nbut not necessarily easier\n)\nin this context, and other theorems emerge naturally to complete the picture. It develops useful tools for studying\nAleksandrov\nspaces with curvature bounded below in full generality. Finally, it contains an ample discussion of further results and open problems.\nAfter visiting the IHES near Paris, Perelman returned to the\nSteklov\nMathematics Institute in Leningrad but, thanks to\nGromov\n, Perelman was invited to the United States to talk at the\n1991\nGeometry Festival held at Duke University in Durham, North Carolina. He lectured on the work which he had done on\nAleksandrov\nspaces with Burago and\nGromov\n(\nwhich had not been published at that time\n)\n. In\n1992\nPerelman was invited to spend the autumn semester at the\nCourant\nInstitute, New York University, on a postdoctoral fellowship, and the spring\n1993\nsemester at Stony Brook, a campus of the State University of New York, again funded by a fellowship. Masha Gessen describes Perelman at this time\n[\n1\n]\n:-\nBy the time Perelman arrived in the United states, he was twenty-six, no longer pudgy but tall and apparently fit. His beard had passed out of its extended awkward-tuft stage and was thick, black and bushy. His hair was long. He did not believe in cutting hair or fingernails ...\n[\nhe wore\n]\nthe same clothes every day - most notably a brown corduroy jacket ...\n[\nhe ate\n]\na particular kind of black bread that could be procured only from a Russian store in Brooklyn Beach, where Perelman walked from Manhatten.\nWhile Perelman was in the United States in\n1992\n, his mother stayed with friends in New York, his father had earlier emigrated to Israel, and Perelman's young sister Lena was still being educated in St Petersburg\n(\nLeningrad returned to its original name of St Petersburg in\n1991)\n. He got to know Jeff Cheeger and Gang Tian, and the three of them regularly travelled to Princeton to attend seminars at the Institute for Advanced Study. Perelman attended a conference in Israel in\n1993\nthen accepted a two-year Miller Research Fellowship at the University of California, Berkeley. He published some remarkable papers during these years.\nElements of Morse theory on Aleksandrov spaces\n(\nRussian\n)\n(1993)\ninvestigates the local topological structure of\nAleksandrov\nspaces.\nManifolds of positive Ricci curvature with almost maximal volume\n(1994)\nsolves a conjecture about a complete Riemannian manifold\nM\nn\nM^{n}\nM\nn\n. If such a manifold has\nRicci\ncurvature ≥\nn\n−\n1\nn - 1\nn\n−\n1\nand volume close to that of the sphere then Perelman proved it is homeomorphic to the sphere. The biggest breakthrough, however, was his paper\nProof of the soul conjecture of Cheeger and Gromoll\n(1994)\nwhich answered a question asked by Cheeger and\nGromoll\ntwenty years earlier. Perelman was invited to address the International Congress of Mathematicians in Zürich in\n1994\nand he gave the lecture\nSpaces with curvature bounded below\n.\nTo understand the problems that Perelman was beginning to think about around this time, we give the description of the\nPoincaré\nConjecture and the\nThurston\nGeometrization Conjecture from\n[\n16\n]\n:-\nA\n2\n-manifold with positive curvature can be deformed into a\n2\n-sphere; one with zero curvature can be deformed into a torus; and one with negative curvature can be deformed into a torus with more than one hole. The\nPoincaré\nConjecture, which originated with the French mathematician\nHenri Poincaré\nin\n1904\n, concerns\n3\n-dimensional manifolds, or\n3\n-manifolds. ... Can every simply connected\n3\n-manifold be deformed into the\n3\n-sphere? The\nPoincaré\nConjecture asserts that the answer to this question is yes. Just as with\n2\n- manifolds, one could also hope for a classification of\n3\n-manifolds. In the\n1970\ns,\nFields Medalist\nWilliam Thurston\nmade a new conjecture, which came to be called the\nThurston\nGeometrization Conjecture and which gives a way to classify all\n3\n-manifolds. The\nThurston\nGeometrization Conjecture provides a sweeping vision of\n3\n-manifolds and actually includes the\nPoincaré\nConjecture as a special case.\nThurston\nproposed that, in a way analogous to the case of\n2\n-manifolds,\n3\n-manifolds can be classified using geometry. But the analogy does not extend very far:\n3\n-manifolds are much more diverse and complex than\n2\n-manifolds.\nA possible approach to attacking the\nPoincaré\nConjecture had been developed by\nRichard Hamilton\nwho had introduced a significant idea in\n1982\nwhen he began to study a particular equation he called the\nRicci\nflow. When Perelman was going to lectures at the Institute for Advanced Study he attended a lecture there by\nHamilton\nand talked with him after the lecture. Perelman recalled\n[\n11\n]\n:-\nI really wanted to ask him something. He was smiling, and he was quite patient. He actually told me a couple of things that he published a few years later. He did not hesitate to tell me.\nHamilton\n's openness and generosity -- it really attracted me. I can't say that most mathematicians act like that. I was working on different things, though occasionally I would think about the\nRicci\nflow. You didn't have to be a great mathematician to see that this would be useful for geometrization. I felt I didn't know very much. I kept asking questions.\nWhen he was a Miller fellow at Berkeley, Perelman attended some further lectures by\nHamilton\nand he began to understand why\nHamilton\ncould not make any further progress towards proving the\nPoincaré\nConjecture using the\nRicci\nflow.\nWhile he was in the United States, Perelman received several requests asking him to apply for professorships. These came from top institutions such as Stanford and Princeton. He was offered a full professorship, without making any application, by Tel Aviv University in Israel, but he turned down all the offers and returned to the St Petersburg branch of the\nSteklov\nMathematics Institute after his Miller fellowship came to an end in the summer of\n1995\n. Basically he was able to live on the savings he had made from the money paid to him in the United States which was quite considerable since he had lived exceptionally frugally. He refused to accept a\nEuropean Mathematical Society\nprize in\n1996\n. Perelman had realised that\nHamilton\nwas making no progress with the\nPoincaré\nConjecture when he read a paper\nHamilton\npublished in\n1995\nand, in the following year, he wrote to\nHamilton\nexplaining that he might have a way round the problem and offering to collaborate with him. When he received no reply, Perelman seems to have decided to work on solving the\nPoincaré\nConjecture alone.\nOn\n11\nNovember\n2002\n, Perelman put his paper\nThe Entropy Formula for the Ricci Flow and Its Geometric Applications\non the web. Although he did not claim in the paper to be able to solve the\nPoincaré\nConjecture, when experts in the subject read it they realised that he had made the breakthrough necessary to solve the Conjecture. Quickly he received invitations to visit the Stony Brook campus of the State University of New York and the Massachusetts Institute of Technology. He began making plans for the visits and, before setting off, he posted a second paper\nRicci flow with surgery on three-manifolds\non the web continuing his proof. He arrived in the United States in April\n2003\nand went first to the Massachusetts Institute of Technology where he gave talks on his work for most days in the two weeks he was there. He spent two similar weeks at Stony Brook followed by visits to Columbia University and Princeton University where he gave lectures. He turned down all offers of professorships that were made to him, becoming annoyed at the pressure some put on him to accept.\nHe returned to St Petersburg at the end of April\n2002\nand, in July, put\nFinite extinction time for the solutions to the\nRicci\nflow on certain three-manifolds\n, the third instalment of his work, on the web. It took some time for experts in the field to convince themselves that Perelman had solved the\nPoincaré\nConjecture and a little longer to work through the details to see that he had also solved the\nThurston\nGeometrization Conjecture. He continued working at the\nSteklov\nMathematics Institute in St Petersburg where he was promoted to Senior Researcher. However in December\n2005\nhe resigned, saying that he was disappointed in mathematics and wanted to try something else. In August\n2006\nhe was awarded a\nFields\nmedal:-\nFor his contributions to geometry and his revolutionary insights into the analytical and geometric structure of the\nRicci\nflow.\nJohn Lott described Perelman's work leading to the award of a\nFields\nMedal in a lecture he gave to the International Congress of Mathematicians in Zürich in August\n2006\n[\n8\n]\n.\nFor an extract of Lott's talk, giving some technical details, see\nTHIS LINK\n.\n(\nNote the careful choice of Lott's language. He says the Perelman \"proved the so-called Soul Conjecture,\" but only that he \"presented proofs of the\nPoincaré\nconjecture and the geometrization conjecture.\"\n)\nPerelman refused the invitation to be a plenary speaker at the\n2006\nInternational Congress of Mathematicians. He also refused the award of the\nFields\nMedal, the first person to have done so. If his hope had been to avoid publicity he was highly unsuccessful since huge public interest was generated and he was hounded by the press. In March\n2010\nthe Clay Mathematics Institute announced that Perelman had met the conditions for the award of one million US dollars which they had offered for the solution of the\nPoincaré\nConjecture. In July\n2010\nPerelman refused to accept the million dollars, saying:-\nI do not like their decision, I consider it unfair. I consider that the American mathematician\nHamilton\n's contribution to the solution of the problem is no less than mine.\nLet us end this biography by quoting\nMikhael Gromov\n(\nsee\n[\n1\n]\n)\n:-\n[\nPerelman\n]\nhas moral principles to which he holds. And this surprises people. They often say he acts strangely because he acts honestly, in a nonconformist manner, which is unpopular in this community - even though it should be the norm."
}