{
  "nome_completo": "Guacolda Antoine Lazzerini",
  "nome_curto": "Guacolda Lazzerini",
  "ano_nascimento": "1908",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lazzerini/",
  "lugar_nascimento": "Santiago de Chile, Chile",
  "lugar_morte": "Santiago de Chile, Chile",
  "biografia": "Guacolda Antoine Lazzerini\nwas the daughter of Fernando Antoine and Minerva Lazzerini. Fernando was born in Bordeaux, France, and came to Chile with his family when he was a child. He began his studies in Chile in a religious school, but his father decided to take him away from the school and after that he was self-educated. Minerva's family were from Florence, Italy and Guacolda spoke about them\n(\nsee\n[\n15\n]\n)\n:-\nMy maternal grandfather was from Florence. There he bought forests, cut them down and sold the wood, and he continued to do that until a forest caught fire and his capital ran out. So he thought of coming to Chile, building up his capital again and returning to Italy. But when my grandfather went to work in Santiago he never collected money because he was a very honest man.\nAfter arriving in Chile Minerva was educated at a private Italian school. She wanted to go back to Italy for a university education but her family did not have enough money for this so she remained at the private Italian school helping the teacher. Fernando and Minerva married in\n1907\nwhen he was\n22\nyears old and she was\n19\n. Guacolda, the subject of this biography, was their first child born in\n1908\n. She was named Guacolda since her father wanted to emphasise that she was Chilean; Guacolda is a name from Mapuche mythology. She was the first of her parents' seven children and spoke about her schooling which began in Santiago de Chile\n(\nsee\n[\n15\n]\n)\n:-\nI started studying at a public school that was in Vicuña Mackenna near Marín, and at the age of four I already knew how to read. I was there until\n1914\nwhen my parents went to Chillán\n[\nabout\n400\nkm south of Santiago\n]\n. My dad invented a system to have hot water in the kitchen and had already made several sales in that area. I remember that in Chillán we bought from a French grocery store. There I was at the American Lyceum for Young Ladies, which was where the Humanities were studied. I entered the first year and studied there for two years. Since I was a good student, they offered me a scholarship until I finished school, but my mother did not accept it and preferred to send me to study in Santiago, where I went to live in Aunt Hortensia's house. When she passed away, she left behind two children, one was two years old and the other nine. My parents, and then me, took care of them.\nAntoine attended the Liceo de Niñas de Santiago No.\n2\n. This school, a girls' annex of the Application Lyceum, had been founded in\n1904\nto provide an institution where students from the Pedagogical Institute could carry out teaching practice. Liceo No.\n2\nwas situated next to the Pedagogical Institute of the University of Chile and as well as providing facilities where students could get practical teaching experience, it also provided an excellent education for girls who wanted to attend the Pedagogical Institute and qualify as teachers. While she was studying at this school, her father died and her mother was left with nine children to bring up. Antoine being the oldest of the children, felt a responsibility for helping out with the family finances. She did this by earning some money teaching and she explained how this came about\n(\nsee\n[\n16\n]\n)\n:-\nI was in my last year at the Liceo de Aplicación and a German mathematics teacher would take us out to the blackboard to do exercises. I was the only one who could solve them, and with that system I learned a lot, but my classmates didn't. So, for the final examination, I had the idea to teach my classmate and they all did well. The teacher was surprised and I felt that teaching was for me.\nShe also made some money by teaching mathematics to the sons and daughters of wealthy families. This was not her first experience of teaching, however, for she had always helped her younger brothers and sisters with their school work. Her first thought of a career had not been teaching but had been to become a ballet dancer. Many of her friends advised her to study medicine but her experience teaching her classmates convinced her that she wanted to become a mathematics teacher. She graduated from Liceo No.\n2\nin December\n1923\nand in\n1924\nshe entered the Pedagogical Institute to train as a mathematics teacher. She joined a small class with four men and two women students.\nWe should say a little about mathematical education in Chile to put Antoine's biography into context. In Chile, mathematics teaching was done primarily by engineers up to the end of the\n19\nC. José Manuel Balmaceda, the\n10\nth President of Chile\n1886\n-\n1891\n, argued strongly for the reform of education and the Pedagogical Institute was founded in\n1889\nto bring this about. The German Ricardo Poenisch\n[\n13\n]\n:-\n... arrived in Chile in the second half of\n1889\n, in compliance with a contract signed at the Chilean Legation in Berlin on\n2\nJuly of that year, to render his services as professor of mathematics, physics and cosmography. ...\nAugusto Tafelmacher, who had a doctorate in mathematics from the University of Göttingen, arrived in Chile soon after Poenisch and good quality mathematics courses were established at the Pedagogical Institute. By the time that Antoine began her studies at the Pedagogical Institute in\n1924\nit was giving high quality courses on mathematics and on the teaching of mathematics.\nFor more information about the Pedagogical Institute, see\nTHIS LINK\n.\nIn\n1928\nshe qualified as a teacher of mathematics and physics having written the mathematical education dissertation\nAlgunos tópicos sobre resoluciones de ecuaciones diferenciales y su implementación como nueva asignatura en las carreras de Pedagogía e Ingeniería\nⓉ\n(\nSome topics on resolutions of differential equations and their implementation as a new assignment in the careers of teachers and engineers\n)\n.\nAfter graduating in June\n1928\n, Antoine was appointed as a teacher at the José Victorino Lastarria Men's Liceo No.\n5\n. This school had been founded in\n1913\nbut suffered a major fire in\n1928\nwhich completely destroyed the original building. The school director was Juan N Durán Munoz and Antoine was appointed to the school despite the fact that it was a school for boys. In fact she was not the first woman teacher at the school for there was already a woman chemistry teacher in post. Antoine taught at this school for thirty years but this was not the only post she held.\nAntoine began her career at an extremely difficult period in world history, namely the years of the Great Depression, which hit Chile particularly badly. The worldwide Great Depression began in\n1929\nand in that year Antoine was appointed to teach at the Higher Institute of Commerce of Chile. It was in\n1930\nthat Chile was badly hit by the Great Depression and in the following few years suffered from political instability and poverty. Antoine worked at the Higher Institute of Commerce until\n1931\nand during these years she took the opportunity to qualify as an actuary. This was not Antoine's only appointment in\n1929\nfor in that year she was also employed to teach Analytical Geometry at the Pedagogical Institute. Here she came into contact with Karl Grandjot who had a considerable influence on her as a teacher. Let us give a little background.\nKarl Grandjot\n(1900\n-\n1979)\n(\nknown as Carlos in Chile\n)\nwas a German who had studied mathematics at the University of Göttingen and was awarded a doctorate in\n1922\nfor his thesis\nÜber das absolute Konvergenzproblem der Dirichletschen Reihen\nⓉ\n(\nOn the absolute convergence problem of the Dirichlet series\n)\n. He had been advised by\nEdmund Landau\n[\n12\n]\n:-\nDr Grandjot, as his students called him, arrived in Chile on the\n1\nMay\n1929\n, from Germany, hired by the Government to \"provide his services as a Mathematics Professor in the educational establishments of the Republic. He would have the obligation to serve up to fifteen hours a week of classes, including seminars.\" Upon arriving, he began teaching \"classes on Higher and Elementary Mathematics, Philosophy and Physics at the Pedagogical Institute of the University of Chile.\"\nAntoine learnt much from Grandjot although she thought he had a strange way of teaching\n[\n15\n]\n:-\n... when they appointed me an assistant\n[\nat the Pedagogical Institute\n]\n, they also appointed two high school teachers, that is, it was two teachers and me. They gave me the third course and there I had to work with Grandjot. He explained to me what exercises he had to do and it became clear to me that the Germans had a different method of teaching. It was something very singular, I don't know if it was better or worse.\nTeaching at the Liceo Lastarria and the Pedagogical Institute during the critical years of the Great Depression meant that she was able to support her brothers and cousins, providing the necessary finance for them all to complete their studies. Chile was led by General Carlos Ibáñez del Campo who had suspended parliamentary elections and was ruling by decree. Although popular at first, Ibáñez came in for heavy criticism after the Depression hit the country hard. Ibáñez left the country going into exile on\n26\nJuly\n1931\n. There followed a period of political instability until Arturo Alessandri was re-elected in December\n1932\n. Antoine was too busy working to find time to be involved in politics, but she always considered herself \"a woman of the left, close to the socialists but never militant.\"\nWhile teaching at the Liceo Lastarria, Antoine met Arcadio Escobar Zapata\n(1912\n-\n1989)\n. He was a student of law at the University of Chile and was acting as an honorary inspector at the High School. When they met Antoine was still responsible for supporting her brothers and nephews through their education and Escobar, still a student, was not in a position to marry. They agreed that they would marry once circumstances permitted and indeed they did marry in\n1944\n. Antoine continued teaching at the Liceo and at the Pedagogical Institute and, in\n1946\nand\n1948\n, their children Fernando Escobar Antoine and Alvaro Escobar Antoine were born. Between the two births, in\n1947\n, she was appointed professor at the School of Industrial Engineers. In\n1953\nthe School of Industrial Engineers became part of the Universidad Técnica del Estado.\nAlexandre Tarragó i Borràs\n(1907\n-\n1980)\nwas born in Tarragona, Spain, and became a teacher. At the end of World War II, Franco expelled him from Spain and he went into exile in Santiago de Chile. In\n1950\n, together with other Spanish teachers who were now also in exile, Tarragó set up an educational project \"The Kent School\", a school that he directed until his death in\n1980\n. It was founded with the principles of secularism, tolerance and renewal. In\n1953\n, recognising that 'The Kent School' was an innovative educational concept, Antoine joined them. She also had her two sons educated at this school\n[\n15\n]\n:-\nHer son, Fernando Escobar Antoine, recounts that in that period, together with her teaching activity at the University of Chile, at the Universidad Técnica del Estado, at the Liceo Lastarria and at the Kent School, Guacolda developed an intense interest in relation to the new methods of teaching mathematics. Along with all the teaching activity, she also assumed managerial responsibilities at the Technical University, where she served as Secretary of the Teaching Council of Mathematics, Physics and Chemistry between\n1954\nand\n1958\nand for the period\n1958\n-\n1962\nshe was elected president of the same Teaching Council, a position equivalent to that of dean of a faculty at the University of Chile. In the latter, she was Head of the Mathematics Department of the Faculty of Philosophy and Education in\n1959\nand between\n1960\nand\n1962\n.\nFernando continues to explain that his mother represented the Universidad Técnica del Estado at the Congress of Latin American Universities held in Buenos Aires in\n1957\nand was a delegate of the Chilean Universities before the Commission for the Preparation of the Scientific Teaching Report in\n1960\n. That same year she was appointed Head of the Baccalaureate Commission in Mathematics, a position she held until\n1965\n. At the same time, together with a group of colleagues, she began an intense activity to improve teaching at the Centre for Mathematics and Physics teachers in Santiago, where she was elected president for the period\n1960\n-\n1963\n. In\n1962\nshe received an invitation from the Governments of the German Federal Republic and France to visit universities, industrial training centres and other educational establishments.\nFernando says that at the end of\n1962\nhis mother retired from all her positions after having completed\n35\nyears of service. But the following year the University of Chile honoured her by appointing her an Extraordinary Professor in the Faculty of Philosophy and Education, to which she returned to teach at the Pedagogical Institute and at the School of Psychology of the University of Chile. Between\n1963\nand\n1968\nshe was head of the Department of Mathematics of the Faculty of Philosophy and Education of the same University. Between\n1964\nand\n1973\nshe served as president of the Centre for Teachers of Mathematics and Physics of Santiago. In an effort to spread the teaching of modern Mathematics - specifically, set theory - she, together with Professor María Lara, published the book \"New Mathematics for Parents.\" She continued to teach at the Kent School until\n1985\n, the year in which she formally ceased teaching. She was then\n77\nyears old.\nIn\n1992\nshe was nominated for the National Prize for Education but, unfortunately, despite her undoubted merits, she was not awarded the prize. In April\n2008\n, on her\n100\nth birthday, Antoine received the Medal of Scientific Merit, awarded annually by the Faculty of Sciences of the Universidad de Santiago de Chile, for her contribution to the mathematical training of important contingents of students from secondary and university education. Juanita Gallardo Ramírez writes\n[\n15\n]\n:-\nShe is a small woman, with sparkling eyes, white hair, dressed in bright colours, an easy smile, a firm voice to tell me that sometimes she forgets a name. It is hard to believe that she is over\n70\nyears old, but I have come to her house knowing that when she turned\n100\n, in April\n2008\n, she received the Medal of Scientific Merit from the Faculty of Sciences of the University of Santiago de Chile.\nOn Saturday,\n1\nJune\n2013\n, the Liceo José Victorino Lastarria celebrated its centenary. The director of the Liceo Lastarria, Malva Venegas, gave a speech in which she related the history of the school. Then Antoine, who was one of the guests, asked to be allowed to speak. Venegas said\n[\n2\n]\n:-\nIt was not contemplated that she would speak, because we thought that at her age she would not want to, but she herself asked for it. She got up on the stage, used the microphone and recalled her years teaching at the Liceo Lastarria. She mentioned that she not only started to take classes there, but she also met her future husband.\nBoris Chornik had been taught by Antoine and then taught in the Physics Department at the University of Chile. He spoke in\n2013\nabout visiting his\n105\nyear old teacher\n[\n2\n]\n:-\nTwo years ago, a colleague challenged me with a geometry theorem. It was a mental exercise, to remember the things we learned in high school, but for me, more linked to physics, it was complicated. One day I went to Antoine's house, I put the problem to her and the next day she called me to give the answer. I often visit her and we talk about current affairs, politics and, of course, mathematics.\nAntoine replied:-\nIt was an easy problem that I was able to solve. ... I like to prove theorems, although I'm not looking for new ones, I prefer to read and do sudokus. But if people come to ask me something, I try to help.\nMarta Macho Stadler writes\n[\n16\n]\n:-\nDoña \"Guaco\" - as she was called by people close to her - passed away on\n22\nAugust\n2015\nat the age of\n107\n. She attributed her good physical and emotional state to the yoga exercises that she practiced for thirty years, until the late\n1990\ns, when she injured her shoulder. From then on she devoted herself to wushu martial arts. Until shortly before her death, she was still doing gymnastics a couple of times a week, reading historical novels and spending part of her time doing sudoku puzzles. She also, from time to time, received a student who needed help to solve a mathematics problem."
}