{
  "nome_completo": "Guido Stampacchia",
  "nome_curto": "Guido Stampacchia",
  "ano_nascimento": "1922",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stampacchia/",
  "lugar_nascimento": "Naples, Italy",
  "lugar_morte": "Paris, France",
  "biografia": "Guido Stampacchia\n's parents were Emanuele Stampacchia and Giulia Campagnano. Emanuele ran a factory which manufactured iron tools. His family followed the Valdese\n(\nor Waldense\n)\nreligion, a sect which had broken away from the Roman Catholic Church in the\n11\nth\nCentury. Guido's mother came from a Jewish family who owned a factory which produced hand-made embroidered linen goods. When Guido was thirteen years old, Mussolini decided to send Italian armies into Ethiopia. Italians were, at this time, required to join the Fascist party and when Guido's father refused, he was forced to sell his factory.\nStampacchia attended the Liceo-Ginnasio Gian Battista Vico in Naples where he studied classics but excelled in mathematics and physics. After graduating from the high school, in autumn of\n1940\nhe entered the Science Faculty of the Scuola Normale Superiore of Pisa to study pure mathematics. For three years he produced outstanding examination results in a wide range of courses such as Tutorial Sessions in Analysis and in Geometry, Calculus of Variations, Theory of Functions, and Ordinary Differential Equations. However, when in the third year of the four-year course he was drafted into the Air Force. He informed the university authorities on\n24\nMarch\n1943\nthat he had to report for military service on\n28\nMarch. He was given permission to take the university examinations in Pisa in June before being sent to Rome towards the end of month to undergo military training. He began his training but in September he joined the Resistance Movement against the Germans on the day Italy's capitulation to the Allies was announced. After many adventures he was able to join up with his parents and sisters in Isernia, a town situated in the centre of Italy, due north of Naples. On\n1\nOctober the British\n5\nth\nArmy entered Naples and after the Allies were in control Stampacchia returned to the city. The Liberation Army then put him to work on administrative duties and he was not discharged from his military duties until June\n1945\n.\nNow once Stampacchia was in Naples, despite having to undertake duties for the Liberation Army, he was able to take advantage of a special dispensation which allowed students to complete their degrees. His fourth year of study was therefore at the University of Naples rather than in Pisa. He obtained his Laurea with distinction from the University of Naples in November\n1944\nwith a thesis written with\nRenato Caccioppoli\nas his advisor\n[\n9\n]\n:-\nHis thesis was concerned with an adaptation of an approximation procedure for\nVolterra\nintegral equations due to\nTonelli\nto boundary value problems for systems of ordinary differential equations.\nAt this stage he won a scholarship to enable him to continue his research at the University of Naples under the supervision of\nRenato Caccioppoli\nand Carlo Miranda, and he also undertook tutorial work to assist the Professor of Algebraic Analysis, although this was done on a voluntary basis. He also studied for the Final Examinations of the Scuola Normale Superiore of Pisa which he passed with distinction in November\n1945\n. Stampacchia was now offered a position in Pisa but declined the offer and accepted instead a position as an assistant at the Naval Institute at Naples. At this stage he was struggling to find a direction for his studies. He wrote\n[\n9\n]\n:-\nDuring the period I stayed in Pisa, I tried in several ways to develop a special interest in something, but I wandered among many different topics due to an absolute lack of a guide. Thereby, the reasons for the sacrifices I would have to make if I remained in Pisa became all the more meaningless.\nHe had been much influenced by\nLeonida Tonelli\n, who taught him for a year at Pisa before leaving for Rome, but by this time\nTonelli\n's health was poor; he died in the spring of\n1946\n. Stampacchia felt that contact with\nCaccioppoli\nand Miranda was important for him, and\nTonelli\nadvised him to take this route, hence his decision to accept the position in Naples. In addition to teaching at the Naval Institute he taught at the University on a voluntary basis. With his financial position now secure, he married Sara Naldini in October\n1948\n; they had four children Mauro, Renata, Giulia, and Franca born in\n1949\n,\n1951\n,\n1955\nand\n1956\n.\nFrom the time Stampacchia took up his appointment in Naples, his research output was impressive consisting mainly of papers on differential equations and the calculus of variations. For example, he published five papers in\n1947\n:\nSulle condizioni che determinano gli integrali di un sistema di due equazioni differenziali ordinarie del primo ordine\nⓉ\n(\nThe conditions that determine the integrals of two ordinary differential equations of the first order system\n)\n;\nSulla definizione assiomatica dell'area di una superficie rettificabile\nⓉ\n(\nOn the definition of the axioms for a rectifiable surface\n)\n;\nSulle condizioni che determinano gli integrali dei sistemi di equazioni differenziali ordinarie del primo ordine\nⓉ\n(\nOn the conditions that determine the integrals of the ordinary differential equations of first order systems\n)\n;\nAlcuni teoremi sull'estremo assoluto degli integrali doppi del calcolo delle variazioni dipendenti dalle derivate del secondo ordine\nⓉ\n(\nSome theorems on the extreme of absolute integrals of the calculus of variations dependent on derivatives of the second order\n)\n; and\nSulla semicontinuità degli integrali doppi, in forma ordinaria, nel calcolo delle variazioni\nⓉ\n(\nOn semicontinuity of double integrals, in ordinary form in the calculus of variations\n)\n. In\n1948\n-\n49\nhe was awarded a National research Council scholarship to enable him to undertake research on the calculus of variations and functional analytic methods.\nWith an impressive research record, Stampacchia was appointed as an assistant to the Professor of Mathematical Analysis at the University of Naples in July\n1949\n. He presented fourteen papers for his Libera Docenza\n(\nequivalent to the German\nHabilitation\n)\nin\n1951\n[\n9\n]\n:-\nThe years that Stampacchia spent in Pisa and Naples characterize the formation of his personality as an analyst: he was a passionate specialist in calculus of variations and in the theory of partial differential equations, a practitioner and an inspirer of research works of considerable depth and originality of thought. As is well known, his work has contributed notably to the progress of mathematics and the fields of research opened by him are still drawing the attention of the international mathematical community.\nStampacchia was nominated for a Professorship at the University of Genoa in December\n1952\n. This was a probationary position which became a full professorship in December\n1955\n. His research continued to flourish and he became a leading figure of Italian mathematics. His\n326\npage text\nEquations elliptiques du second ordre à coefficients discontinus\nwas published in\n1966\n, then in\n1967\nhe was elected President of the\nItalian Mathematical Union\n(\nUnione Matematica Italiana\n)\n. It was around this time that he became one of the two 'founding fathers' of variational inequalities which grew out of his work on defining the capacitory potential associated to a non symmetric bilinear form.  Not surprisingly, he was nominated for a chair in Rome and in November\n1968\nhe was invited to fill the Chair of Mathematical Analysis in the Faculty of Sciences of the University of Rome \"La Sapienza\". He moved to Rome, taking with him an impressive group of young researchers. This was a difficult period, however, when there was student unrest in many European countries. Rome suffered badly in this respect and Stampacchia found that he could not provide the leadership he wished to give since many of the teaching staff joined with the students in their protests. He became highly involved in the dispute although all he wanted was to be able to effectively teach and undertake research. When he was invited to return to the Scuola Normale Superiore in Pisa as professor of Higher Analysis in\n1970\n, he gladly accepted.\nIn Pisa he undertook a heavy workload. However, in the autumn of\n1973\nhe suffered heart problems and had to take a period of rest in order to recover. He was advised to reduce his workload when he returned to his duties but Stampacchia was never one to take things easy and he ignored this medical advice and returned to work as hard as ever. He was a visiting professor at the University of Sussex in February\n1976\n, then spent a month at the Collège de France in Paris in May/June. He spent the period March to May of\n1977\nat the\nCourant\nInstitute in New York and at the School of Mathematics of the University of Minnesota at Minneapolis. He returned to Paris for another visit in February\n1978\nand while there he suffered a serious heart attack. He was taken to the Boucicaut Hospital where he slowly recovered. He was to leave the hospital on\n27\nApril, but on this day he suffered another major heart attack and died.\nOne of the main projects Stampacchia had undertaken during his period as professor of Higher Analysis in Pisa was to work on a book on variational inequalities. He began working on the project himself, but later it turned into a collaboration with David Kinderlehrer. The book was still incomplete at the time of his death but completed by Kinderlehrer and published in\n1980\n. Haim Brezis writes in a review:-\nThe theory of variational inequalities was born in Italy in the early sixties. The \"founding fathers\" were G Stampacchia and G Fichera. Stampacchia was motivated by potential theory, while Fichera was motivated by mechanics. Less than twenty years later the theory of variational inequalities has become a rich source of inspiration both in pure and applied mathematics. On the one hand, variational inequalities have stimulated new and deep results dealing with nonlinear partial differential equations. On the other hand, variational inequalities have been used in a large variety of questions in mechanics, physics, optimization and control, linear programming, engineering, etc... ; today variational inequalities are considered as an indispensable tool in various sectors of applied mathematics.\nGarroni writes a tribute to Stampacchia in\n[\n2\n]\n. We give a short quote:-\nMany of you, at least those closer to him, have come here not only to honour the memory of a great mathematician, but also in the name of the friendship and the affection for a friend and, in the case of the younger participants, for a real master. The personality of Stampacchia was both strong and simple, open and helpful. His human qualities are well known to all of you.\nWe end this biography by quoting from Mazzone in\n[\n9\n]\nconcerning Stampacchia's character. He:-\n... was always proud of his native Naples and of the family background in which he was born; in fact, he was very happy of being born in such a special place and in an unusual family. These peculiar roots were particularly suited to his personality, rather nonconformist, and certainly contributed to his formation. Part of his characteristic nature was that of a very amiable and easy-going gentlemanliness, a simplicity coupled with the consciousness of his important position in the mathematical community, a very strong sense of criticism and a great sense of humour. Very frank in expressing clearly whatever he thought, he had a very generous and free attitude towards friends and students which was reciprocated with affection."
}