{
  "nome_completo": "Gustave Dumas",
  "nome_curto": "Gustave Dumas",
  "ano_nascimento": "1872",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dumas/",
  "lugar_nascimento": "L'Etivaz, Vaud canton, Switzerland",
  "lugar_morte": "Lausanne, Switzerland",
  "biografia": "Gustave Dumas\n' father was a priest. Dumas attended secondary school in Lausanne; after having completed his baccalaureate he stayed there to study mathematics at the university. Having obtained his diploma, he gained a second one from the Sorbonne, again in mathematics. Despite his university studies he seems to have been assistant at the Polytechnic at the time of the first International Congress of Mathematicians.\nDumas then went to Berlin for some months, where he attended lectures by\nGeorg Frobenius\n,\nHermann Schwarz\nand\nKurt Hensel\n. He returned to Paris, and in\n1904\nhe was awarded a doctorate for his thesis\nSur les fonctions à caractère algébrique dans le voisinage d'un point donné\nⓉ\n(\nOn the algebraic character functions in the neighborhood of a given point\n)\n. Two years later he\nhabilitated\nat the Polytechnic in Zürich, with the paper\nSur quelques cas d'irréductibilité des polynômes à coefficients rationnels\nⓉ\n(\nOn some cases of irreducibility of polynomials with rational coefficients\n)\n. In both of these papers he used new notions introduced by\nHensel\n[\n4\n]\n. Dumas taught higher mathematics as a\nPrivatdozent\nat the Polytechnic; he was promoted to Titularprofessor in\n1913\n.\nIn the same year he was appointed to a professorship in mathematics at the Engineering School of the University of Lausanne. He became an ordinary professor in\n1916\n. Dumas stayed at his alma mater until he retired in\n1942\n, teaching mainly differential and integral calculus to future engineers and mathematicians. Among his students was\nGeorges de Rham\n, who became Dumas's assistant in the mid-\n1920\ns. Dumas's own research interests would be classed 'as classical algebraic geometry\n(\nover the complex field\n)\n'\n[\n3\n]\ntoday. He was also very interested in\nPoincaré\n's work. His mathematical papers cover various topics in algebra, analysis and geometry, and include\nNote relative aux abaques à alignement\nⓉ\n(\nNote on the charts in alignment\n)\n(1906)\n,\nSur les singularités des surfaces\nⓉ\n(\nOn the singularities of surfaces\n)\n(1912)\n, and his lectures\nNotes de calcul différentiel et integral\nⓉ\n(\ndifferential calculus and integral Notes\n)\n(1925)\n. In addition, Dumas wrote a couple of papers on technical education in the French-speaking part of Switzerland.\nDumas joined the organising committee of the first International Congress of Mathematicians at the preliminary meeting in July\n1896\n, as the French-speaking secretary. He is mentioned by name only a couple of times, when specific jobs were given to him: He wrote the letter to\nGreenhill\n, inviting him again to attend the congress\n[\n2\n]\n, and finalised the congress programme with\nGeiser\n,\nFranel\nand\nHirsch\non\n2\nAugust.\nRudio\nand\nFranel\n, the two general secretaries at the congress, also had their personal secretaries,\nHirsch\nand Dumas. It can be assumed that Dumas, as the native French speaker, was\nFranel\n's secretary. Dumas did not give a talk at the congress, but he was among the signatories of the invitations.   Dumas attended more ICMs than most of his colleagues on the organising ccommittee. Representing the University of Lausanne, he attended the\n1920\nICM in Strasbourg, the\n1928\nICM in Bologna, and the\n1932\nICM in Zürich. He gave a talk in Bologna, entitled\nSur les singularités des surfaces\nⓉ\n(\nOn the singularities of surfaces\n)\n, in section II-B\n(\ngeometry\n)\n. Dumas also served on the organising committee of the\n1932\ncongress in Zürich.\nDumas became a member of the\nSwiss Mathematical Society\n(\nSchweizerische Mathematische Gesellschaft: SMG\n)\nwhen it was founded in\n1910\n. He gave a number of talks at the society's annual meetings and served as secretary-treasurer from\n1920\n-\n1922\n. From\n1922\n-\n1924\nand again from\n1930\n-\n1931\nhe was president of the SMG. In\n1944\nhe was made an honorary member of the society.  In\n1923\nhe co-founded the so-called\nColloque mathématique des Universités romandes\nⓉ\n(\nMathematical Colloquium of French-speaking Universities\n)\n, later renamed as\nCercle mathématique de Lausanne\nⓉ\n(\nMathematical Circle of Lausanne\n)\n. This was a 'very rigorous group'\n[\n3\n]\nthat organised lectures and meetings until the\n1980\ns.   Furthermore, Dumas was a member of the\nEuler\n-Kommission from\n1919\n-\n1943\n. He was awarded an honorary doctorate from the University of Lausanne when he retired in\n1942\n.\nApart from mathematics and education, Dumas also had a strong interest in literature and philosophy."
}