{
  "nome_completo": "Gyula Farkas",
  "nome_curto": "Gyula Farkas",
  "ano_nascimento": "1847",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Farkas/",
  "lugar_nascimento": "Sárosd, Fejér County, Hungary",
  "lugar_morte": "Pestszentlorinc, Hungary",
  "biografia": "Gyula Farkas\n's father was the steward on the Sárosd estate, situated in Fejér megye\n(\ncounty\n)\nin central Hungary. He was sent to Györ, in northwest Hungary, for his secondary education from the Benedictines. Just southeast of Györ is Pannonhalma Apátság, a Benedictine abbey founded in\n969\nby Prince Géza. After completing his schooling by the Benedictines, Farkas went to Pest with the intention of studying law and music. However, neither of these two subjects proved suitable for him to follow as a career since he came to dislike law, and he did not have the talent necessary to become a professional musician.\nWe should look at the political events which formed the background to Farkas's upbringing. In\n1849\n, when he was two years old, the Hungarians had defeated the Habsburgs and declared Hungarian independence on\n14\nApril. Following this a combined force from Russia and Austria retook the country and the Hungarian army surrendered on\n13\nAugust. A period followed where many Hungarians were shot or imprisoned. However, the Habsburg Empire was weakened by external conflicts over the following decades and in the Compromise of\n1867\nthe Hungarian Kingdom and the Austrian Empire became independent states within the Austro-Hungarian Monarchy. Some Hungarians were happy with the arrangement, others were not and would be satisfied with nothing short of full independence. However, the Compromise led to raising standards of education in mathematics and the sciences and Farkas would play his part in bringing the country up to international levels.\nFarkas worked as a private tutor for a while before returning to university to study physics and chemistry. He then returned to his native county of Fejér, teaching at the Modern School in the county town of Székesfehérvár. In\n1874\nhe went to work for Géza Batthyany, the Count of Polgárdi, teaching his children mathematics and physics. Farkas now had time to undertake research both in mathematics and physics, and to help him in this he had the use of a specially designed physics laboratory which the Count of Polgárdi had built to help with his children's education. Farkas was also given the opportunity to make visits abroad to broaden his background in mathematics and physics.\nBy\n1880\nFarkas had an impressive publication record in\nComptes Rendus\nand was appointed as a\ndozent\nin function theory at the university in Pest. His career continued to flourish and in January\n1887\nhe was appointed as an extraordinary professor at the University of Kolozsvár\n(\nwhich had been founded in\n1872)\n, and in the following year he became an ordinary professor there. Filep writes in\n[\n4\n]\n:-\nFifty years ago, on December\n26\n,\n1930\n, the outstanding Hungarian mathematician and physicist Gyula Farkas died. He was a member of the\nHungarian Academy of Sciences\nand an honorary member of the Loránd Eötvös Mathematics and Physics Institute. After his death both he and his accomplishments for the most part fell into obscurity. However, at present renewed attention is being given to his results in optimisation theory and mechanics.\nReaders may have noted that we have given\n27\nDecember as the day of Farkas's death, rather than\n26\nDecember given by Filep in the quotation above. There appears to be some uncertainty as to which is correct.\nIn fact he is remembered for Farkas theorem which is used in linear programming and also for his work on linear inequalities. In\n1881\nGyula Farkas published a paper on\nFarkas Bolyai\n's iterative solution to the trinomial equation, making a careful study of the convergence of the algorithm. In a paper published three years later, Farkas examined the convergence of more general iterative methods. He also made major contributions to applied mathematics and physics, particularly in the areas of mechanical equilibrium, thermodynamics, and electrodynamics. Szénássy writes\n[\n1\n]\n:-\nOne of the greatest personages of Hungarian theoretical physics and an inventive user of mathematical tools was Gyula Farkas. His essays on the conditions of stable thermodynamic equilibrium and his article of\n1895\nin which he obtained the so-called\nCarathéodory\nprinciple of thermodynamics\n14\nyears ahead of\nCarathéodory\nhimself stirred an international sensation. He began a new study of the nearly forgotten\nFourier\nprinciple; the articles he devoted to this subject containing several original mathematical results as well\n[\npublished in\n1896\nand\n1902]\n.\nNot only did Farkas serve the University of Kolozsvár as a professor, but he also served as Dean and as Rector of the University. In\n1915\nhe resigned his position at the University since his eyesight was deteriorating to such an extent that he felt unable to carry out his duties properly. He retired to Budapest where he lived in retirement for\n15\nyears. After Farkas's first wife had died, he remarried but his second wife died before he retired and he lived alone in his retirement until he moved in with one of his relations a few months before his death."
}