{
  "nome_completo": "Hanno Rund",
  "nome_curto": "Hanno Rund",
  "ano_nascimento": "1925",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rund/",
  "lugar_nascimento": "Schwerin, Germany",
  "lugar_morte": "Tucson, Arizona, USA",
  "biografia": "Hanno Rund\nwas born in Schwerin, a town in northern Germany. His parents were Victor Rund and Martha von Neumann. Victor was an academic with doctorates in law, theology, and philosophy. Victor and Martha had two children, the eldest being a daughter Armgard\n(1921\n-\n2014)\nwho was nearly five years older than her brother Hanno, the subject of this biography. The reason that Victor and Martha chose the names Armgard and Hanno for their children was that they were fans of the\n1897\nnovel\nBuddenbrooks\nby Thomas Mann about a family from northern Germany and these names were those of two characters in the novel.\nOn\n30\nJanuary\n1933\nHitler came to power in Germany and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course removing those of Jewish descent from other roles. This made the Rund family decide to emigrate and, later in\n1933\n, they travelled to Eldoret in Kenya. After a short while in Eldoret, the family moved again, this time to South Africa. Victor Rund earned a living as a teacher of German, teaching in schools in Natal and the Cape of Good Hope. Hanno, at the age of ten, attended a primary school in Cape Town.\nThe Groote Schuur Primary School, in Rondebosch, a southern suburb of Cape Town, was founded in January\n1936\nand Hanno Rund attended the school from the time it opened in temporary accommodation. For his secondary education he attended the Rondebosch Boys High School, founded February\n1897\nin Rondebosch, which by the time Rund entered had achieved a high reputation. He graduated from the school in\n1942\n. Although he was interested in science, and in mathematics in particular, he won a King's Entrance Scholarship to the University of Cape Town for his performance in Latin and English. At the University of Cape Town, Rund took courses in Pure Mathematics, Applied Mathematics and Physics and graduated with a B.Sc. in\n1946\n.\nRund was appointed to the University of Cape Town and began teaching there in\n1946\n. In\n1948\nhe moved to the University of Natal in Pietermaritzburg and taught there for one year before returning to the University of Cape Town in\n1949\n. He undertook research for his Ph.D. advised by Christian Yvon Pauc\n(1911\n-\n1981)\n. Pauc was a Frenchman who had studied at the École Normale Supérieure in Paris, in Vienna with\nKarl Menger\n, and in Rome. Then he was awarded a doctorate from the Sorbonne for his thesis\nLes methodes directes en calcul des variations et en geometrie differentielle\nⓉ\n(\nDirect methods in the calculus of variations and in differential geometry\n)\nhaving been advised by\nMaurice Fréchet\n. After teaching in Germany and France Pauc was appointed to the University of Cape Town in\n1948\n. Rund submitted his thesis\nThe Geometry of Finsler Spaces Considered as Generalized Minkowskian Spaces\nto the University of Cape Town in August\n1950\n. He dedicated his thesis to \"\nAlexander Brown\n, Professor of Applied Mathematics, University of Cape Town\n(1904\n-\n1947)\n.\" In the thesis Rund writes:-\nMy best thanks are due to Prof\nL C Young\nwho first introduced me to the Calculus of Variations, and to Dr C Y Pauc for his encouragement and many very valuable suggestions.\nLaurence Chisholm Young\nhad been appointed as Professor of Mathematics at the University of Cape Town in\n1938\nwhere he was the first head of the Department of Mathematics. He was very successful in building the Department at Cape Town during the ten years he spent there.\nWilhelm Süss\nwas appointed as the external examiner of Rund's thesis.\nSüss\n, as well as being professor of mathematics at the University of Freiburg, Germany, was also the director of the Oberwolfach Mathematical Research Institute in the Black Forest in southwest Germany. Rund went to Germany in\n1950\nspending some time at Oberwolfach before being appointed as a docent at the University of Freiburg in\n1951\n. He sailed from Durban, South Africa, on the\nWinchester Castle\n, arriving in Southampton, England, on\n11\nAugust\n1950\n. From England he travelled to Germany.\nRund began publishing papers, the first to appear being\nÜber die Parallelverschiebung in Finslerschen Räumen\nⓉ\n(\nOn the parallel shift in Finsler spaces\n)\n(1951)\n. In this paper he gives his address as Cape Town. The paper was written in German, as were a number of his early papers, but from\n1957\nonwards all his papers were written in English. He attended the Colloque de Topologie de Strasbourg in\n1951\nand gave a lecture entitled\nA theory of curvature in Finsler spaces\n. The published version is a\n12\n-page paper reviewed by\nShiing-shen Chern\nwho writes:-\nThis is a summary of a theory of curvatures in\nFinsler\nspaces. Most of the results have since been published in detail in other papers\n[\nby Hanno Rund\n]\n. The main idea is a notion of parallelism different from the classical ones of\nBerwald\nand\nCartan\n. It has the advantage of depending only on the point and not on the direction, but the disadvantage that the length of a vector is not preserved. In a sense the resulting curvature measures the difference of a\nFinsler\nmetric from the tangent Minkowskian metric. The author shows how various notions in the differential geometry of\nFinsler\nspaces can be established on the basis of this parallelism.\nHis next papers were\nZur Begründung der Differentialgeometrie der Minkowskischen Räume\nⓉ\n(\nJustification of the differential geometry of the Minkowski spaces\n)\n(1952)\n, with the address Cape Town, and\nDie Hamiltonsche Funktion bei allgemeinen dynamischen Systemen\n(1952)\nwhich gives Freiburg im Breisgau as his address. This last mentioned paper has the acknowledgement:-\nI would like to take this opportunity to thank the \"Royal Commissioners for the Exhibition of\n1851\n\" for their generous support.\nIn\n1952\nRund\nhabilitated\nin Freiburg, sponsored by\nWilhelm Süss\nand Gerrit Bol\n(1906\n-\n1989)\n. He was then appointed as a Diätendozent at the University of Bonn. A Diätendozent is a university teacher who has habilitated but is still self-employed as they were when a\ndocent\n. In July\n1954\nhe was appointed as an Assistant Professor of Applied Mathematics at the University of Toronto in Canada but before taking up the appointment he returned to South Africa. The\nRondebosch Magazine\n[\n6\n]\nhas an item in the Old Boys' Notes:-\nHanno Rund, after three years at Bonn University, during part of which time he was senior lecturer, has been appointed professor of mathematics at Toronto University. He spent five weeks with his parents at Rondebosch before proceeding to Canada.\nAbout eighteen months after arriving in Canada, Rund met the girl who would become his wife a few months later\n[\n3\n]\n:-\nOn Christmas day in\n1955\nhe met Marian Iris\n(\nFrances\n)\nBiddlecomb in Toronto, and they were married four months later.\nMarian Biddlecomb, daughter of R W Biddlecomb, was English, being born in London on\n19\nMarch\n1934\n. She had sailed from Southampton to New York in May\n1955\non route to Canada. She gave her occupation as 'hairdresser'. Hanno and Marian were married on\n27\nApril\n1956\nthen, three weeks later, they sailed on the\nHomeric\nfrom Quebec, Canada, to Southampton, England, on their way to South Africa. Rund had been appointed Professor and Head of the Department of Mathematics at the University of Natal. On\n21\nApril\n1958\nHanno and Marian's daughter Ingrid was born. He served as Dean of the Faculty of Science at Natal in\n1958\nwhile he was working on writing his first monograph. In\n1959\nhe published\nThe differential geometry of Finsler spaces\n. A Kawaguchi writes in a review:-\nThis is the first well-arranged book furnishing a reasonably comprehensive account of the new field, theory of\nFinsler\nspaces, developed by a large number of geometers very rapidly in the last\n30\nyears. The method of tensor calculus is used, mainly, and it is intended that this book may serve also as an introduction to a branch of differential geometry which is closely related to various topics in theoretical physics, notably analytical dynamics and geometrical optics.\nRund moved from Natal to the University of South Africa where he was a Research Professor from\n1962\nto\n1966\n. He published a second major book in\n1966\n, namely\nHamilton-Jacobi Theory in the Calculus of Variations: Its Role in Mathematics and Physics\n. The publisher's description is as follows:-\nThis rigorous self-contained account demonstrates the role of the calculus of variations in unifying some of the most fundamental branches of pure mathematics and theoretical physics. The importance of the\nHamilton\n-\nJacobi\ntheory is stressed from the start, and so the pure mathematician gains immediate access to the theory of first-order partial differential equations, to that of some second-order partial differential equations, and to metric geometries. The theoretical physicist is shown how the theory of non-homogeneous single integral problems give rise to relativistic particle mechanics, in which the special invariant Hamiltonian function permits a particularly simple method of quantization, from which the relativistic wave equations\n(\nDirac\n, Kemmer, etc.\n)\nmay be obtained directly. A very substantial part is devoted to multiple integral problems, with special reference to modern field theories and areal spaces. The same fundamental methods are used to discuss rigorously the problem of\nLagrange\n, and they therefore lead to an analysis of fundamental dynamical laws for both holonomic and non-holonomic systems. The fundamental pure mathematics is derived from\nCarathéodory\n's approach to the calculus of variations, of which no account exists in English, although his methods may be said to have revolutionized the most basic aspects of the subjects. Many of the methods and some of the results now presented are original, and their is little overlap with existing literature, particularly on multiple integral theories.\nLeopold Pars\nwrites in the review\n[\n7\n]\n:-\nThis book is concerned with problems in the Calculus of Variations, with particular emphasis on the use of\nHamilton\n's equations and of the\nHamilton\n-\nJacobi\ntheorem. The approach is not that of the familiar derivation of\nHamilton\n's equations from the\nEuler\n-\nLagrange\nequations, but is based on\nCarathéodory\n's notion of the \"complete figure\". ... The design is highly ambitious, and the author is to be congratulated on a courageous attempt to present a comprehensive account, including much recent work, of these difficult topics.\nIn\n1966\nRund became Professor and Head of the Department of Mathematics at the University of the Witwatersrand in Johannesburg. He continued in this role until\n1969\nwhen he moved to Canada. After the year\n1970\n-\n71\nas Professor and Chairman of the Department of Applied Mathematics at the University of Waterloo in Ontario, Canada, he moved to Tucson, Arizona in the United States where he would remain for the rest of his career living at\n3150\nN Bear Canyon Road. Appointed to the University of Arizona in\n1971\nhe was Chairman of the Department of Mathematics from that time until\n1978\nwhen he became a Professor in the Committee on Applied Mathematics. Richard Pierce writes that Rund\n[\n8\n]\n:-\n... energetically pursued the development program ... adding more than a dozen new faculty members. One of the important occurrences in the history of mathematics at the University of Arizona was the introduction around\n1977\nof an interdisciplinary group in Applied Mathematics. Mathematics is used and taught in many of the university programs. The faculty members who view themselves as mathematicians are by no means confined to the Mathematics Department. The formal recognition of a common bond of interest that links a large group of people on campus came about with the formation of the Committee on Applied Mathematics. This committee consists of several dozen faculty members from various areas, including the Mathematics Department of course. Some of the most interesting and exciting mathematical developments in Arizona during the last eight years have occurred under the stimulus of the Applied Mathematics Committee.\nIn\n1975\nRund, together with David Lovelock, published the book\nTensor, differential forms, and variational principles\n. The authors write in the Preface:-\nThe objective of this book is two-fold. Firstly, it is our aim to present a self-contained, reasonably modern account of tensor analysis and the calculus of exterior differential forms, adapted to the needs of physicists, engineers, and applied mathematicians in general. Secondly, however, it is anticipated that a substantial part of the material included in the later chapters is of interest also to those who have some previous knowledge of tensors and differential forms: we refer in particular to the remarkable interaction between the concept of invariance and the calculus of variations, which has profound implications in almost all physical field theories.\nAbraham Haskel Taub, in the review\n[\n9\n]\n, describes the book as \"well-written\" and its \"purpose is well accomplished.\"\nLet us say a little about Rund's co-author David Lovelock since his career is closely connected with Rund's. Lovelock was born in\n1938\nin Bromley, Kent, England. His family emigrated to Durban, South Africa, in\n1947\nand he studied for his B.Sc. at the University of Natal from\n1956\nto\n1959\n. Here he was taught by Rund and, after graduating, he studied for a Ph.D. advised by Rund. He was a professor of Applied Mathematics at the University of Waterloo, Canada, during the time that Rund was there, then moved to the University of Arizona in\n1974\nwhere again he became Rund's colleague. Both remained at the University of Arizona for the rest of their careers.\nWe note that although Rund held his position at the University of Arizona for the rest of his career, he did spend the year\n1983\n-\n84\nback in South Africa at the University of Cape Town. We quote now from\n[\n3\n]\n:-\nThroughout his academic career Hanno Rund lectured widely and often throughout the United States, Canada, Western Europe , and South Africa, on topics ranging from differential geometry and\nLie\ntheory to the calculus of variations to theoretical physics and gauge field theory. At age\n34\nhe was the youngest person ever to be awarded the Havenga Prize by the South African Academy of Arts and Sciences, and in\n1983\nhe was the first recipient of the\nSouth African Mathematical Society\nAward. He was awarded honorary doctorates by the Universities of Natal\n(1982)\nand Waterloo\n(1984)\n. He served on the editorial boards of several journals, including 'Algebras, Groups and Geometries', 'Aequationes Mathematicae', 'Journal of Mathematical and Physical Sciences', 'Quaestiones Mathematicae', 'Resultate der Mathematik', 'Tensor', and 'Utilitas Mathematica'. He was an unusually conscientious contributor to reviewing journals such as 'Mathematical Reviews' and 'Zentralblatt fur Mathematik'; he once estimated that he had reviewed more than\n2500\narticles. Ever very popular as a teacher and adviser, Rund continually supervised Ph.D. candidates throughout his teaching career.\nThis last statement is significant since Rund had a major impact on African mathematics particularly through the many Ph.D. students he advised while at various South African universities. For example,\nJames Ray Vanstone\n(1959)\n, John Wainwright\n(1965)\n, Johannes Christiaan Du Plessis\n(1965)\n, Duncan H Martin\n(1965)\n, John Henry Swart\n(1969)\n, Stanley Paul Lipshitz\n(1970)\n, and Sarel Venter\n(1975)\nwere all students of Rund and are listed in\nAfrican men with a doctorate in mathematics\n1\nat\nTHIS LINK\n.\nIn addition to Rund's books that we mentioned above, we also note that he published\nInvariant theory of variational problems on subspaces of a Riemannian manifold\n(1971)\n,\n(\nwith his Ph.D. student Jonathan H Beare\n)\nVariational properties of direction-dependent metric fields\n(1972)\n, and\nGeneralized connections and gauge fields on fibre bundles\n(1981)\n.\nIn addition to the Havenga Prize mentioned above, he was honoured with the award of a D.Sc.\n(\nhonoris causa\n)\nfrom the University of Natal in\n1982\nand a Dr Math\n(\nhonoris causa\n)\nfrom the University of Waterloo in\n1984\n. He received the\nSouth African Mathematical Society\nAward in\n1983\n.\nRund was a keen mountaineer and was a member of the Mountain Club of South Africa. His other hobbies include listening to classical music."
}