{
  "nome_completo": "Hans Lewy",
  "nome_curto": "Hans Lewy",
  "ano_nascimento": "1904",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lewy/",
  "lugar_nascimento": "Breslau, Germany (now Wrocław, Poland)",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Hans Lewy\n's mother was Margaret Rossel and his father was Max Lewy. He spent his boyhood in Breslau before becoming a student at Göttingen. His research work was supervised at Göttingen by Richard\nCourant\nand he was awarded his doctorate in\n1926\nfor his thesis\nÜber einen Ansatz zur numerischen Lösung von Randwertproblem\nⓉ\n(\nOn an approach to the numerical solution of boundary value problem\n)\n. He was appointed to Göttingen as a\nPrivatdozent\nin\n1927\nand continued to work there for six years.\nDuring the years when Lewy held a position at Göttingen he was awarded two Rockefeller Foundation Fellowships, the first allowing him to spend session\n1929\n-\n30\nat the University of Rome and second allowing him to spend session\n1930\n-\n1931\nat the University of Paris. These years were one in which he produced some outstanding mathematics. With\nCourant\nand\nFriedrichs\nhe wrote\nÜber die partiellen Differentialgleichungen der mathematischen Physik\nⓉ\n(\nOn the partial differential equations of mathematical physics\n)\nwhich appeared in\nMathematische Annalen\nin\n1928\n. In this paper criteria are given for determining conditions which guarantee the stability of numerical solutions of certain classes of differential equations. This work proved even more important after the advent of computers when the stability of numerical methods became crucial. In the following year he published, in the same journal,\nNeuer Beweis des analytischen Charakters der Lösungen elliptischer Differentialgleichungen\nⓉ\n(\nNew evidence of the analytical character of the solutions of elliptic differential equations\n)\n.\nM Protter,\nJ L Kelley\n,\nT Kato\n, and\nD H Lehmer\n, in an obituary of Lewy, write about his achievements up to\n1933\n:-\n... he published a series of fundamental papers on partial differential equations and the calculus of variations. He solved completely the initial value problem for general non-linear hyperbolic equations in two independent variables. On the basis of this, and using the daring idea of converting an elliptic equation into a hyperbolic one by penetrating into the complex domain, he developed a new proof of the analyticity of solutions of analytic elliptic equations in two independent variables, one which far exceeded the known proof in its elegance and simplicity. He proved the well-posedness of the initial value problem for wave equations in what is now called\nSobolev\nspaces two decades before these spaces became a common tool for specialists. The revolutionary character of these works is reflected in the fact that\nJ Hadamard\n, a world authority at that time, devoted a special appendix to Lewy's theory in his newly published book on the Cauchy Problem\n(1932)\n.\nOn\n30\nJanuary\n1933\nHitler came to power and Lewy realised that he could not remain in Germany and that he had to emigrate. He went to the United States where he was appointed to Brown University for the two years\n1933\n-\n35\n, and he was then appointed to the University of California at Berkeley as a lecturer in\n1935\n. His career at Berkeley saw him promoted regularly with appointment as Assistant Professor in\n1937\n, Associate Professor in\n1941\n, and then full professor in\n1945\n. During the Second World War he made his contribution to the war effort with an appointment at the Aberdeen Proving Ground. He married Helen Crosby on\n9\nJune\n1947\nand they had one son, Michael R Lewy. Lewy retired in\n1972\nbut continued to produce deep mathematics. He died after a brief illness.\nManfred Kracht, reviewing\n[\n1\n]\nand\n[\n2\n]\n, writes that:-\nLewy's work is ... extremely original and inventive: He created many ideas which have opened new fields and are still waiting to be developed or extended in the future.\nNirenberg\n[\n6\n]\nlists Lewy's mathematical papers under the following topics:\n(\ni\n)\npartial differential equations involving existence and regularity theory for elliptic and hyperbolic equations, geometric applications, approximation of solutions;\n(\nii\n)\nexistence and regularity of variational problems, free boundary problems, theory of minimal surfaces;\n(\niii\n)\npartial differential equations connected with several complex variables;\n(\niv\n)\npartial differential equations connected with water waves and fluid dynamics;\n(\nv\n)\noffbeat properties of solutions of partial differential equations. Among the first papers he published after emigrating to the United States were\nA priori limitations for solutions of\nMonge\n-\nAmpère\nequations\n(\ntwo papers, the first in\n1935\n, the second two years later\n)\n, and\nOn differential geometry in the large :\nMinkowski\n's problem\n(1938)\n.\nMinkowski\n's problem is to construct a convex surface in three dimensional space that realises a given curvature as a function of the direction of the normal. He published\nWater waves on sloping beaches\nin\n1946\nstudying the progressive wave on sloping beaches in two dimensions neglecting compressibility and assuming zero viscosity.\nThe dock problem\n, written jointly with\nFriedrichs\ntwo years later, gives an explicit solution for the dock problem over a fluid of infinite depth. The solution is given by the sum of two integrals of\nLaplace\ntype taken over a complex path of integration.\nAnother paper of major importance which Lewy published in\n1951\nwas\nOn minimal surfaces with partially free boundary\nwhich examines the continuation of minimal surfaces across analytic boundary arcs. His paper\nAn example of a smooth linear partial differential equation without solution\n(1957)\ngave a simple partial differential equation which has no solution, a result which had a substantial impact on the area. This work led Lewy to two later papers on the theory of functions of several complex variables for which he received the Steele Prize of the\nAmerican Mathematical Society\nin\n1979\n.\nLewy received many honours for his mathematical contributions. He was elected a member of the\nNational Academy of Sciences\n(\nUnited States\n)\n, the\nAmerican Academy of Arts and Sciences\n, and the\nAccademia dei Lincei\n(\nRome\n)\n. We mentioned above that the\nAmerican Mathematical Society\nawarded him its Steele Prize in\n1979\n. In\n1986\nhe was awarded the prize of the Wolf Foundation along with\nKodaira\n. In\n1986\nhe received an honorary doctorate from the University of Bonn.\nLewy had wide-ranging talents and interests both within and outside mathematics. He loved music and languages, demonstrated an energy and enthusiasm for everything he undertook, showing a modesty, lack of pretension, and flair for philosophising. M Protter,\nJ L Kelley\n,\nT Kato\n, and\nD H Lehmer\nwrite:-\nHe was noted in Berkeley for being a warm person with a fine sense of humour.\nThey also illustrate his character with the following episode:-\n[\nHe\n]\nwas known as a person of integrity and strong moral principles. In\n1950\n, he refused to sign a special loyalty oath imposed on the faculty by the University of California's Board of Regents; for this reason he and a number of other professors were fired. They were later vindicated and reinstated when the courts determined that taking the oath would have violated their civil rights."
}