{
  "nome_completo": "Hans Reichenbach",
  "nome_curto": "Hans Reichenbach",
  "ano_nascimento": "1891",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Reichenbach/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Hans Reichenbach\n's parents were Bruno Reichenbach and Selma Menzel. Bruno was a prosperous wholesale merchant, and Hans was one of his parents' five children. Both Bruno and Selma Reichenbach were members of the Reformed Church but Bruno's parents were Jewish. Although this Jewish connection would seem a small point to bring out, nevertheless for someone living in Germany through the first half of the\n20\nth\ncentury it would be highly significant. Certainly Hans was born into a family which\n[\n1\n]\n:-\n... was cultured, with a lively interest in music, chess, books and the theatre.\nHans attended primary and secondary schools in Hamburg. He left school in\n1910\nwith the intention of becoming an engineer and he entered the University of Stuttgart taking engineering courses. However his interests moved towards more theoretical aspects of science and he left Stuttgart in\n1911\nafter one year of study and took mathematics, physics and philosophy courses at Berlin, Munich and Göttingen. Being at three different universities over the course of four years was certainly not unusual, for at this time most German students took courses at several different universities. The theoretical physicists\nPlanck\n,\nBorn\n,\nEinstein\nand\nSommerfeld\n, the mathematician\nHilbert\n, and the neo-Kantian philosopher Cassirer were among his teachers. Reichenbach was also active in the universities outside his immediate academic studies. He had strong views on society and was outspoken on social topics, taking advantage of student politics to air his views. In\n1915\nhe received his doctorate from the University of Erlangen for his thesis on philosophical aspects of the\ntheory of probability\nDer Begriff der Wahrscheinlichkeit für die mathematische Darstellung der Wirklichkeit\nⓉ\n(\nThe concept of probability and the mathematical representation of reality\n)\n. The reason that his doctorate was awarded by Erlangen was slightly strange. The thesis had a mathematical part and a philosophy part, and Reichenbach went to several universities trying to find someone to accept the thesis. He did not find anyone at Erlangen but rather he had his thesis accepted by two people, one who accepted the mathematical part, the other the philosophical part. In\n1916\nhis thesis was published.\nAfter completing his doctorate he served for\n30\nmonths in the Signal Corps of the German army, which by this time was heavily engaged in fighting on several different fronts during World War I. He was sent to the Russian front where he contracted a severe illness. He was sent back to Berlin where by\n1917\nhe was one of only five people who attended\nEinstein\n's first course on relativity. The topic intrigued Reichenbach and he launched himself into undertaking research on its philosophical aspects. Research, however, was only a part-time job for Reichenbach at this time for he was employed full-time in the radio industry. He remained in Berlin until\n1920\nwhen he was appointed professor at the Polytechnic at Stuttgart. There he taught a wide variety of topics showing both the breadth of his interests and his background: relativity, philosophy of science, history of philosophy, surveying, and radio techniques. In the year he took up this position he published his first major text on relativity\nRelativitatstheorie und Erkenntnis apriori\nⓉ\n(\nThe theory of relativity and a priori knowledge\n)\nwhich attacked Kant's synthetic a priori theory of space and time, and of physics. This was followed by papers such as\nBericht über eine Axiomatik der Einsteinschen Raum-Zeit-Lehre\nⓉ\n(\nReport on  axiomatisation of Einstein's space-time law\n)\n(1921)\nand\nDer gegenwartige Stand der Relativitatsdiskussion\nⓉ\n(\nThe present state of the discussion on relativity\n)\n(1922)\nbefore his second major book\nAxiomatik der relativistischen Raum-Zeit-Lehre\nⓉ\n(\nAxiomatisation of the theory of relativity\n)\nwas published in\n1924\n. This work again examined the philosophical meaning of the theory of relativity. Two further important papers followed:\nDie Bewegungslehre bei Newton, Leibniz und Huyghens\nⓉ\n(\nThe theory of motion according  to  Newton, Leibniz and Huygens\n)\n)\n(1924)\nand\nDie Kausal-strukture der Welt und der Unterschied von Vergangenheit und Zukunft\nⓉ\n(\nThe causal-structure of the world and the difference between past and future\n)\n(1927)\nHe became a candidate for a professorship in the philosophy of physics in Berlin but there was strong opposition to his appointment. His views had become known when he was politically active in his student days, and someone with these views, who was as outspoken as Reichenbach, was certainly not acceptable to many in Germany at this time. However he had a major figure who supported his appointment with great vigour, namely\nEinstein\n. Even then it proved a struggle to push the appointment through, but\nEinstein\nwon the argument. Appointed to the chair in the philosophy of physics at the University of Berlin in\n1926\nReichenbach took a very different approach to teaching than that used throughout the German system at that time. He encouraged discussion and made himself available to students who could debate topics in the courses with him. He founded the Gesellschaft für empirische Philosophie\n(\nSociety for empirical philosophy\n)\nin Berlin in\n1928\n, known as the Berlin Circle. Carl Gustav Hempel,\nRichard von Mises\n,\nDavid Hilbert\nand Kurt Grelling all became members of the Berlin Circle and Reichenbach took on another major role in\n1930\nwhen, together with Carnap, he took on the editorship of the journal\nErkenntnis\n(\nKnowledge\n)\n. During these years in Berlin, Reichenbach published further important works on the problems of space and time associated with the new physics.\nPhilosophie der Raum-Zeit-Lehre\nⓉ\n(\nThe philosophy of space and time\n)\nwas an important text published in\n1928\n, followed two years later by another major book\nAtom und kosmos. Das physikalische Weltbild der Gegenwart\nⓉ\n(\nAtom and cosmos; the world of modern physics\n)\n. In fact Reichenbach became well-known to a wide range of German people at this time for he broadcast the lectures which made up\nAtom und kosmos\nⓉ\n(\nAtom and cosmos; the world of modern physics\n)\non German state radio. In\n1931\nhe published a further paper\nZiele und Wege der heutigen Naturphilosophie\nⓉ\n(\nAims and methods of modern philosophy of nature\n)\n.\nWhen Hitler came to power in\n1933\nReichenbach realised immediately that he would be in trouble. Not only did he have Jewish grandparents, but he had a high profile through his radio broadcasts and his views were completely at odds with those of National Socialism. Letters of dismissal, both from his professorship at the University of Berlin and from his position with the state radio, arrived too late to have any effect for, anticipating them, and had left for Turkey before they arrived. He became head of the Department of Philosophy at the University at Istanbul and served in that role from\n1933\nto\n1938\n. In many ways Reichenbach was isolated in his new position, certainly the contrast with Berlin where he had been the centre of a flourishing school must have been striking. However he was very active in giving the Department of Philosophy in Istanbul a much broader outlook, introducing interdisciplinary seminars and lecture courses on scientific topics. He also published a major text while in this post, namely\nWahrscheinlichkeitslehre; eine Untersuchung über die logischen und mathematischen Grundlagen der Wahrscheinlichkeitsrechnung\nⓉ\n(\nTheory of probability; a study of the logical and mathematical foundations of probability theory\n)\n(1935)\n. B O Koopman, reviewing the English translation which appeared in\n1949\n, begins at follows:-\nBasically, two tasks face any treatment of the foundations of probability:\n(\nI\n)\nthe establishment of laws of consistency of probability statements\n(\nlaws permitting the derivation of new probabilities from given probabilities\n)\n; and\n(\nII\n)\nthe formulation of explicit rules for assigning probabilities in the first place, in situations where no probability is given. Both\n(\nI\n)\nand\n(\nII\n)\nentail the question of the meaning of probability and the problem of its application. As the author shows, the latter problem has a unique form in probability: the application problem in other sciences makes use of probability. The whole subject bears not only on the laws of thought, but on induction and thus on the bases of scientific knowledge. It is on this level that the book is written.\nReichenbach attempted to define probability as the limit of a frequency but many criticised this approach. He argues that if\nn\nn\nn\ntrials have been carried out, the only evidence one might use to predict the next trial is the frequency observed in the\nn\nn\nn\ntrials. This, he writes is:-\n... the most that can be expected of a theory.\nHaving signed a five year contract for his Turkish position, he emigrated to the United States at its termination in\n1938\n. There he worked as a professor at the University of California at Los Angeles. In the year he arrived in the United States he published with the University of Chicago Press his book\nExperience and prediction: an analysis of the foundations and the structure of knowledge\n. Of course this book had been written during his years in Istanbul.\nSalmon writes in\n[\n7\n]\n:-\nReichenbach was not only a philosopher of science but also a scientific philosopher. He insisted that philosophy should adhere to the same standard of precision and rigour as the natural sciences. He unconditionally rejected speculative metaphysics and theology because their claims could not be substantiated either a priori, on the basis of logic and mathematics, or a posteriori, on the basis of sense-experience. In this respect he agreed with the logical positivists of the Vienna Circle, but because of other profound disagreements he was never actually a positivist. He was, instead, the leading member of the group of logical empiricists centred in Berlin.\nWe have seen that Reichenbach wrote on induction, probability and the philosophy of science. However, in the United States he also wrote major works on the philosophical foundations of\nquantum mechanics\nand on time. On the first of these topics he published the book\nPhilosophic foundations of quantum mechanics\n(1944)\n, and the two papers\nÜber die erkenntnistheoretische Problemlage und den Gebrauch einer dreiwertigen Logik in der Quantenmechanik\nⓉ\n(\nOn the epistemological problem situation and the use of a three-valued logic in quantum mechanics\n)\n(1951)\nand\nLes fondements logiques de la théorie des quanta. Utilisation d'une logique à trois valeurs\nⓉ\n(\nThe logical foundations of quantum theory. Use of a three-valued logic\n)\n(1954)\n. He claimed that:-\n... there is not any exhaustive interpretation of quantum mechanics which is free from causal anomalies.\nA casual anomaly of where action at a distance takes place and action by contact is violated. In the two papers be examines using\nŁukasiewicz\n's three-valued logic in quantum mechanics. This contains the truth value \"undecided\", as well as that of \"true\" and \"false\".\nAmong other works, published after he emigrated, are\nElements of Symbolic Logic\n(1947)\nand\nThe Rise of Scientific Philosophy\n(1951)\n. Both are popular texts, the second being the most successful book he wrote in terms of sales.\nHeyting\n, writing about the first, states:-\nThis textbook, not primarily intended for mathematicians, emphasizes more the interpretation and application of formal logic than the construction of the formal system itself. Logical expressions are considered throughout as having a meaning; in particular, existence is interpreted as meaning physical existence. Everywhere the author's extreme physicalist position in philosophy is explicit.\nReichenbach was working on two books at the time of his death:\nNomological statements and admissible operations\n(1954)\n, and\nThe direction of time\n(1956)\n. These were published posthumously thanks to the efforts of his wife, Dr Maria Reichenbach. In this fascinating study of time, Reichenbach distinguishes between the order of time and the direction of time. He defines order by:-\n... event A occurs before event B if event A can produce a physical effect on event B.\nAs to the direction of time, he writes that the:-\n... direction of time is definable only by means of irreversible processes ...\nin other word by means of increasing entropy.\nThere is a large collection of letters, lecture notes, and manuscript material in \"The Hans Reichenbach Collection\" at the University of Pittsburgh."
}