{
  "nome_completo": "Harold Stanley Ruse",
  "nome_curto": "Harold Ruse",
  "ano_nascimento": "1905",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ruse/",
  "lugar_nascimento": "Hastings, England",
  "lugar_morte": "Leeds, England",
  "biografia": "Harold Ruse\n's father was Frederick Ruse\n(\nborn Silverhill, Sussex about\n1872)\nwho was a greengrocer. His mother was Lydia Ruse\n(\nborn Brighton, Sussex about\n1879\n; died\n20\nSeptember\n1954\nat Royal East Sussex Hospital, Hastings\n)\n. She gives Assistant in Business as an occupation in the\n1911\ncensus.\nHarold Ruse was educated at Hastings Grammar School, Sussex, before matriculating at Jesus College, Oxford University. After taking a B.A. at Oxford he was awarded the Bruce of Grangehill Research Scholarship by the University of Edinburgh. He was appointed as a Lecturer in Mathematics in Edinburgh University in\n1928\nand held this position until\n1937\n. During this time Ruse spent session\n1933\n-\n34\nin Princeton where he was supported by a Rockefeller Research Fellowship.\nIn\n1937\nRuse was appointed as Professor of Mathematics at University College, Southampton. He was unmarried and lived at Connaught Hall in Southampton. Ruse remained there for nine years until he was appointed as Professor of Pure Mathematics at Leeds University in\n1946\n. He remained at Leeds until he retired in\n1970\nat the age of\n65\n. From\n1948\nto\n1968\nhe was Head of the Department of Mathematics at Leeds, then for his final two years at Leeds he was Chairman of the School of Mathematics.\nRuse joined the\nEdinburgh Mathematical Society\nin January\n1927\n. He served the Society as Secretary from\n1930\nto\n1933\n, and was then honoured by the Society when elected president for session\n1935\n-\n6\n. From\n1929\nhe was a member of the\nLondon Mathematical Society\n, serving on its Council from\n1938\nto\n1945\n. He was elected to the\nRoyal Society of Edinburgh\non\n2\nMarch\n1931\n, his proposers being\nSir Edmund T Whittaker\n,\nSir Charles G Darwin\n,\nEdward Thomas Copson\n,\nCharles Glover Barkla\n. The Society awarded him their Keith Prize for papers he published during\n1935\n-\n7\n.\nAn obituary, written by A W Goldie, appears in the\nRoyal Society of Edinburgh\nYear Book\n1975\n, pages\n47\n-\n48\n.\nWe give a version of this obituary at\nTHIS LINK\n."
}