{
  "nome_completo": "Hector Munro Macdonald",
  "nome_curto": "Hector Macdonald",
  "ano_nascimento": "1865",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Macdonald/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Aberdeen, Scotland",
  "biografia": "Both of\nHector Macdonald\n's parents, his mother Annie Munro and his father Donald Macdonald, were from Kiltearn. Hector was the older of his parents two sons and, as a young child, he lived in Edinburgh. However, not long after he began his schooling in the Scottish capital, the family moved to a farm near Fearn, in Easter Ross. Fearn is north of the Cromarty Firth which runs along the northern side of the Black Isle, which is a peninsula just to the north of Inverness. Even today this is a fairly isolated community and it would have been much more so when the Macdonald family moved there. After arriving in Fearn, Hector attended the local school before attending the Royal Academy in Tain which is no more than a small village about\n5\nkm north west of Fearn. He completed his school education at the Old Aberdeen Grammar School before entering Aberdeen University in\n1882\n.\nAfter studying mathematics at Aberdeen University, he graduated with First Class Honours in\n1886\nand won a Fullerton Scholarship. As many Scottish mathematicians of this era, Macdonald proceeded to Cambridge to take the Mathematical Tripos after completing his first degree in Scotland. Entering Clare College, Cambridge, as a foundation scholar, he graduated as fourth\nWrangler\nin the Mathematical Tripos of\n1889\n(\nmeaning that he was ranked fourth among those obtaining a First Class degree\n)\n, was awarded a fellowship at Clare in the following year and, in\n1891\n, was awarded the second Smith's Prize.\nMacdonald began his research career at Cambridge working on topics in pure mathematics. Edmund\nWhittaker\ndescribes this work as being on:-\n... the relations between convergent series and asymptotic expansions, the zeros and the addition theorem of the\nBessel\nfunctions, various\nBessel\nintegrals, spherical harmonics and\nFourier series\n.\nHis research changed direction, however, when in\n1899\nCambridge University announced that the topic for the\n1901\nAdams\nPrize would be:-\nThe improvement of existing knowledge in respect of ... the modes and periods of free electric vibrations in systems of charged bodies, and the radiation from them ...\n[\nand\n]\nthe theory of wireless telegraphy.\nMacdonald submitted an essay\nElectric waves\nwhich won the\n1901\nAdams\nPrize and was published in the following year. We will give some details below concerning the main question and theory produced by Macdonald concerning wireless signals, but for the moment we continue to describe his career. He was elected to the\nRoyal Society\nin\n1901\n, then left Cambridge in\n1904\nafter he was appointed professor of mathematics at Aberdeen University.\nIn\n1907\nMacdonald was appointed to the Court of Aberdeen University and he remained on this administrative body for the rest of his life.\nWhittaker\ndescribes his major contributions:-\nBrought up on a farm, and with the further experience of estate management gained as acting senior bursar of Clare, he naturally took up specially the oversight of the university lands and buildings; his conception of a cité universitaire for the neighbourhood of King's College has left a permanent impression on that region.\nHis manner of conducting himself on this body is described in\n[\n1\n]\n:-\nHe spoke little, and when he spoke he was always brief, but what he said was usually decisive and always undeviatingly to the point.\nMacdonald held his fellowship at Clare College until\n1908\nbut in\n1914\nhe was awarded an honorary fellowship of his former College. He was awarded the\nRoyal Society\n's Royal Medal in\n1916\nand, during\n1916\n-\n18\nserved as president of the\nLondon Mathematical Society\n. During World War I, Macdonald did war service in London attached to the Ministry of Munitions where he dealt with wages.\nMacdonald worked on electric waves and solved difficult problems regarding diffraction of these waves by summing series of\nBessel functions\n. He corrected his\n1903\nsolution to the problem of a perfectly conducting sphere embedded in an infinite homogeneous dielectric in\n1904\nafter a subtle error was pointed out by\nPoincaré\n. The major problem which he tackled was that of wireless waves. About the time that Macdonald published his prize winning essay on electric wave, Guglielmo Marconi was successful in the transmission of the first wireless signals across the Atlantic. However, this posed a major problem, since according to the theory as then developed this should have been impossible. Why is this?\nThe problem was simple. Light and wireless waves are both electric waves of different wavelengths, but both have a wavelength which is very small compared with the radius of the Earth. Light does not bend round the Earth, yet wireless waves do as is proved by transmitting them across the Atlantic. What mechanism can explain this? The answer that Macdonald came up with is that the explanation is due to refraction. This is partially true but not completely so as experimental evidence showed since wireless waves bent round the Earth more than could be explained by refraction alone. The answer, we now understand, is due to reflection of waves of particular wavelengths by the upper atmosphere but Macdonald's theory was an important step towards such an understanding.\nJohn Laird, who held the Regius Chair of Moral Philosophy at Aberdeen University, knew Macdonald well and wrote an appreciation\n[\n1\n]\n:-\nThe simplicity of the man had a winning quality that can never be effaced from the memory of his friends so long as they live, and his humour, sympathy and forbearance were as remarkable as his grasp of detail and his astonishing industry.\nLaird also described his appearance:-\nHis rugged, powerful, massive, middle-sized figure and strong, sensitive face made him seem an exemplar of what the Highlands could produce, but his heart had warmed for half a century or more, to the cold granite of Aberdeen, and he included a vast humanity in his acquired nature.\nA correspondent, writing in\n[\n1\n]\n, noted that:-\n... he had the capacity to make himself rapidly an authority on any subject to which he gave his attention. His faultless memory was illustrated by his knowledge of the name of every winner of the Derby with the correct date since the first. It was a source of delighted surprise to his friends to discover his expert knowledge of food and wines."
}