{
  "nome_completo": "Ernst Heinrich Bruns",
  "nome_curto": "Heinrich Bruns",
  "ano_nascimento": "1848",
  "ano_morte": "1919",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bruns/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Heinrich Bruns\n's parents were Caroline Henriette Hasse and Christian Gerhard Bruns who was a landscape painter. Bruns studied in Berlin from\n1866\nto\n1871\n, obtaining a doctorate under\nWeierstrass\nand\nKummer\nin\n1871\nfor his thesis\nDe proprietate quadam functionis potentialis corporum homogeneorum\nⓉ\n(\nThe property of a potential function of a homogeneous body\n)\n. After graduating he was employed as a calculator at the Observatory in Pulkovo, near St Petersburg, Russia. This Observatory was founded in\n1839\nby Friedrich Georg Wilhelm von Struve who became its first director. The\n15\n-inch refracting telescope installed there in\n1839\nwas the largest in the world, and the observatory had quickly acquired an outstanding reputation for the quality of observations made there. When Bruns worked there the director was Otto Vasiliyevich Struve, son of the first director. At the Pulkovo Observatory Bruns met another calculator, Marie Wilhelmine Schleussner who was two years younger than Bruns, and the two married.\nIn\n1873\nBruns left Pulkovo to take up the position of observer at the Dorpat Observatory\n(\nnow Tartu, Estonia\n)\n. Peter Carl Ludwig Schwarz had taken over from\nThomas Clausen\nwhen he retired as director in the year before Bruns arrived at the Observatory. After three years at Dorpat, Bruns was appointed as Professor of Mathematics at the University of Berlin where he remained until\n1882\n. On leaving Berlin he took up the chair of astronomy in the Philosophy Faculty of the University of Leipzig, becoming director of the Leipzig Observatory. The Observatory, the second at the University of Leipzig, had been built in\n1860\n-\n1861\nat the west edge of the Johannistal. Bruns was the second director, the first being Carl Christian Bruhns who held the position from\n1861\nuntil his death in\n1881\n. Bruns held these positions until his death in\n1919\n. His most famous doctoral student at Leipzig was\nFelix Hausdorff\nwho graduated with his doctorate in\n1891\nawarded for his thesis\nZur Theorie der astronomischen Strahlenbrechung\nⓉ\n(\nOn the theory of astronomical refraction\n)\nwhich studied refraction and extinction of light in the atmosphere.\nBruns was interested in astronomy, mathematics and geodesy. He worked on the\nthree-body problem\nshowing that the series solutions of the\nLagrange\nequations can change between convergent to divergent for small perturbations of the constants on which the coefficients of the time depend. The three-body problem was one of major importance to both mathematicians and astronomers. The Earth-Moon-Sun system was the most important astronomical applications for here none of the gravitational forces could be ignored. Energy and angular momentum are conserved in a three-body system but it was hoped that other quantities, such as the integrals of the motion, might be conserved. Bruns showed in\n1887\nthat there could be no conserved quantities which could be expressible as algebraic functions of the positions and velocities of the three bodies. A few years later\nPoincaré\nextended Bruns' work to show that no solution to the three-body problem was possible given by algebraic expressions and integrals.\nIn addition to this major contribution to the three-body problem, Bruns also published major contributions to potential theory. He was interested in the figure of the Earth, as were a large number of scientists at the time when he worked, and he asserted that geodetic measurements can only give the true figure of the Earth when they are taken in conjunction with other types of measurements."
}