{
  "nome_completo": "Helmut Grunsky",
  "nome_curto": "Helmut Grunsky",
  "ano_nascimento": "1904",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grunsky/",
  "lugar_nascimento": "Aalen, Württemberg, Germany",
  "lugar_morte": "Würzburg, Bavaria, Germany",
  "biografia": "Helmut Grunsky\n's father was Heinrich Grunsky and his mother was Lydia Stahl. Helmut was brough up in Aalen where he attended high school. At this stage, although he took a great interest in mathematics, it was not the topic which he intebded to pursue at university, rather he was interested in physics and engineering. In\n1922\nhe entered the Institute of Technology in Stuttgart where he studied physics.\nAfter three years at the Institute of Technology in Stuttgart, in\n1925\nhe entered the Institute of Technology in Berlin. After two years study there he was awarded the degree Diplom-Ingenieur. At this stage he began to undertake research in mathematics at the University of Berlin with a view to a doctorate in mathematics. Grunsky worked on complex analysis for his doctorate but he took a job before submitting his thesis.\nIn November\n1930\nGrunsky took a job with the journal\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nwhich was published by the Preussische Akademie der Wissenschaften. For his doctorate he was using contour integration to study different problems concerning functions which are univalent in a domain of finite connectivity. He submitted his thesis\nNeue Abschätzungen zur konformen Abbildung ein- und mehrfach zusammenhängender Bereiche\nⓉ\n(\nNew assessments for conformal mappings on  multiply connected regions\n)\nto the University of Berlin in\n1932\nand was awarded his Dr. phil.\nAt this stage Grunsky continued his work for the journal\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nwhile he worked on his\nhabilitation\nthesis. In\n1935\nGrunsky married Irma Schenk; they had three children Wolfgang\n(\nborn in\n1936)\n, Hiltrud\n(\nborn in\n1938)\n, and Eberhard\n(\nborn in\n1941)\n. In the same year that he married Grunsky became editor of the journal and, three years later he published\nKoeffizientenbedingungen für schlicht abbildende meromorphe Funktionen\nⓉ\n(\nCoefficient conditions for simple imaging meromorphic functions\n)\nin\nMathematische Zeitschrift\n. This was Grunsky's thirteenth paper which was written as an habilitation dissertation. As for his doctoral thesis, this work again looks at applications of contour integration\n[\n2\n]\n:-\nThis paper presents a study of coefficients for functions in a domain of finite connectivity on the sphere containing the point at infinity.\nGrunsky became qualified to lecture just before the start of World War II. The war made it impossible for him to begin an academic career at this stage and he also had to leave his position as editor of the\nJahrbuchs über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nin\n1939\n. Difficulties at the end of the war did not allow him to enter university teaching even then so in\n1945\nGrunsky took a position as a high school teacher in Trossingen, Württemberg. He continued to teach mathematics at the high school until\n1949\nwhen he became a\nPrivatdozent\nat the University of Tübingen. It is worth noting that due to various circumstances Grunsky did not enter university teaching until he was\n45\nyears old.\nGrunsky have an invited address at the International Congress of Mathematicians held at Cambridge, Massachusetts in\n1950\n. For the academic year\n1950\n-\n51\nhe was Visiting Professor at Washington State College in Pullman, Washington. Returning to Germany he was appointed as Extraordinary Professor at the University of Mainz. In\n1958\nGrunsky moved to the University of Würzburg where he became a full Professor. In\n1963\n-\n64\nhe spent the academic year as a visiting professor at the Middle East Technical University in Ankara, Turkey. He remained in this position at Würzburg until he retired in\n1972\n. Following this he had some other positions, first as research consultant at Washington University, St Louis in\n1973\n, then visiting professor at the State University of New York in Albany in\n1975\n, finally back to Washington University, St Louis as research consultant in\n1977\n.\nGrunsky published three books and\n44\npapers, and he supervised eight doctoral students. All are listed in\n[\n2\n]\n. Of the three book one was\nLectures on the theory of functions in multiply connected domains\npublished in\n1978\n. It\n[\n2\n]\n:-\n... is most closely related to Helmut Grunsky's overall activity and consists of a reworking of some of his most significant contributions to function theory, in many cases with a considerable simplification of exposition.\nThe final book he wrote was\n[\n1\n]\nThe general\nStokes\n's theorem\npublished in\n1983\n. Grunsky writes that the aim of the book is to give\n[\n1\n]\n:-\n... an intrinsic and easily comprehensible presentation of\nStokes\n's theorem.\nThe treatise begins with an intuitive discussion of\nStokes\n's theorem in the plane, which is then used as a model for generalising the result to higher dimensions. Grunsky first proves\nStokes\n's theorem for suitable\nk\nk\nk\n-dimensional region in\nR\nk\n\\mathbb{R}^{k}\nR\nk\n, and then for\nk\nk\nk\n-dimensional regions in\nR\nn\n\\mathbb{R}^{n}\nR\nn\n. He then introduces the calculus of alternating multilinear forms and gives a proof of\nStokes\n's theorem for manifolds."
}