{
  "nome_completo": "Henri Paul Cartan",
  "nome_curto": "Henri Cartan",
  "ano_nascimento": "1904",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cartan_Henri/",
  "lugar_nascimento": "Nancy, France",
  "lugar_morte": "Paris, France",
  "biografia": "Henri Cartan\nis the son of\nÉlie Cartan\nand Marie-Louise Bianconi. When Henri was five years old, his father was appointed as a lecturer at the Sorbonne and the family moved from Nancy to Paris. There he attended the Lycée Buffon and the Lycée Hoche in Versailles. He had a sister and two younger brothers Jean and Louis who both died tragically. Jean, a composer, died of tuberculosis at the age of\n25\nwhile Louis, a physicist, was arrested by the Germans in\n1942\n, deported to Germany in February\n1943\n, and executed after\n15\nmonths in captivity.\nHenri grew up in a home in which music was very important with all the children playing music. Despite Henri's father being a mathematician, he did not try to influence his children towards a career in mathematics. Although always prepared to answer Henri's questions about mathematics as he was growing up, he never emphasised the subject more than others. Despite this Henri always knew from a very young age that he would be a mathematician.\nAfter completing his school education Henri studied at the École Normale Supérieure in Paris and soon became friendly with\nAndré Weil\nwho was one year ahead. Among Henri Cartan's teachers at the École Normale were\nGaston Julia\nand his father\nÉlie Cartan\n. The students at the École Normale also had to attend general courses at the Sorbonne, so Henri studied there too. His doctoral studies were supervised by\nPaul Montel\n, whose research interests were the theory of analytic functions of a complex variable, and Cartan received his\nDocteur ès Sciences mathématiques\nin\n1928\n. After being awarded his doctorate, Cartan taught at the Lycée Caen from\n1928\nto\n1929\n, then at the University of Lille from\n1929\nto\n1931\n.\nIt had been Cartan's friend\nAndré Weil\nwho had suggested that he work on analytic functions of several complex variables and\nWeil\ntold him about the work of\nCarathéodory\n. Cartan published\nLes transformations analytiques des domaines cerclés les uns dans les autres\nⓉ\n(\nAnalytical transformations of bounded spaces into each other\n)\nin\n1930\nand, since this paper contained generalisations of results proved by\nHeinrich Behnke\n, he was invited by\nBehnke\nto visit Germany in May\n1931\nand give a series of lectures at Münster in Westphalen where\nBehnke\ntaught. While there he met Peter Thullen,\nBehnke\n's assistant, and they began a collaboration which resulted in the joint paper\nZur Theorie der Singularitäten der Funktionen mehrerer Komplexen Veränderlichen\nⓉ\n(\nOn the theory of singularities of functions of several complex variables\n)\npublished in\nMathematische Annalen\nin\n1932\n. Thullen\n(\nalthough he was not Jewish\n)\nleft Germany after the Nazis came to power in\n1933\nso the collaboration came to an end. Cartan did visit\nBehnke\nin Münster in Westfalen for a second time before the start of World War II, accepting an invitation to go there in\n1937\n.\nA joint paper written by Henri and his father\nÉlie Cartan\n,\nLes transformations des domaines cerclés bornés\nⓉ\n(\nTransformations of bounded spaces into each other\n)\nappeared in\n1931\n. Most of the time the two mathematicians worked independently, but for this paper they were able to use\nÉlie Cartan\n's expertise on\nLie groups\nto tackle questions that Henri had been interested in. The year in which this joint paper appeared was the one when Cartan left his position in Lille and, starting in November\n1931\n, he took up a post at the University of Strasbourg. He married Nicole Antoinette Weiss on\n14\nSeptember\n1935\n. They had two sons and three daughters: Jean, Francoise, Étienne, Mireille, and Suzanne.\nA very important part of Cartan's mathematical life was taken up with\nBourbaki\n. The first meeting of the group of mathematicians who called themselves \"Bourbaki\" took place on\n14\nJanuary\n1935\n. In\n[\n8\n]\nCartan explains the background to\nBourbaki\n:-\n[\nA\n]\nfter the First World War, there were not so many scientists, I mean good scientists, in France, because most of them had been killed. We were the first generation after the war. Before us there was a vacuum, and it was necessary to make everything new. Some of my friends went abroad, notably to Germany, and observed what was being done there. This was the beginning of a mathematical renewal. It was due to such people as\nWeil\n,\nChevalley\n, de Possel .... The same people, responding to\nAndré Weil\n's initiative, came together to form the Bourbaki group.\nLeray\nand\nPaul Dubreil\nattended the January\n1935\nmeeting, but dropped out before membership of the group was finalised in July of\n1935\n. In addition to Henri Cartan the founding members of\nBourbaki\nat that July meeting were\nAndré Weil\n,\nJean Dieudonné\n,\nSzolem Mandelbrojt\n,\nClaude Chevalley\n, René de Possel, and\nJean Delsarte\n. Cartan described how the group operated\n[\n8\n]\n:-\nWe often disagreed, we often had big arguments - but we remained good friends. For each subject, a \"rédacteur\" was appointed. Later, his rédaction was read aloud and thoroughly examined. The next \"rédacteur\" was given the appropriate instructions, and so on. For each chapter there could be up to nine rédactions. But in the end, everybody was fatigué - tired. And\nDieudonné\nwould say, \"It is finished now. I shall write the last rédaction.\" Which he did. And eventually, although it seemed to be impossible to reach a complete agreement, there was an agreement. But it took time. It is perhaps not the best way in terms of teamwork, but that was the way we took.\nCartan was teaching at the University of Strasbourg when World War II started\n[\n8\n]\n:-\nBut in September\n1939\n, the inhabitants of Strasbourg had to be evacuated. The university was displaced to Clermont-Ferrand, where I taught for a year before I was appointed professor at the Sorbonne in Paris, in November\n1940\n(\nin fact, I was to be in charge of the mathematics students at the École Normale\n)\n. Throughout the war I was not permitted to go to my apartment in Strasbourg. One day,\nBehnke\noffered to try and retrieve some mathematical papers I had left there. He actually went to Strasbourg, but to no avail. He tried again and succeeded. He managed to get hold of some documents, which he left with the library of the University of Freiburg. In\n1945\n, some members of the French Forces in Germany happened to find them there and returned them to me.\nIt has to be remembered that the period of the war was one of great tragedy for the Cartan family. Henri's brother Louis was a member of the Resistance fighting in France against the occupying German forces. After his arrest in February\n1943\nthe family received no further news but they feared the worst. Only in May\n1945\ndid they learn that he had been beheaded by the Nazis in December\n1943\n. Late in\n1945\n, when World War II had ended, Cartan returned to the University of Strasbourg and taught there for a further two years. He renewed contacts with his German colleagues when he visited the Research Institute in Oberwolfach, in the Black Forrest, in November\n1946\n[\n8\n]\n:-\nIt was very cold; there was snow and ice. I saw Professor\nSüss\n(\nthe founder of Oberwolfach\n)\nand Frau Süss, and also\nHeinrich Behnke\n. I remember they asked me to play the piano. It was a beautiful piano - there were two pianos there. The old château at Oberwolfach doesn't exist anymore. I visited Oberwolfach several times after that.\nCartan had been invited to the United States in\n1942\nbut he decided that he had to remain in France for the sake of his family, particularly his father who by this time was an old man. He was invited by\nAndré Weil\nto visit Chicago in January\n1948\n, and he received an invitation to visit Harvard University for four months, February to May\n1948\n. He flew into the United States in December\n1947\nand was met in the airport at New York by\nSamuel Eilenberg\n. His major collaboration with\nEilenberg\nwas the book\nHomological Algebra\nfirst published in\n1956\n. It is a classic text which has had a profound influence on the subject over a period of nearly half a century.\nWe explained above that Cartan was appointed professor at the Sorbonne in Paris in November\n1940\n. He taught in Paris from that time until\n1969\nand then at the Université de Paris-Sud at Orsay from\n1970\nto\n1975\n. He retired in\n1975\n. At the École Normale Supérieure he started the Séminaire Cartan at the time that\nSerre\nwas one of his doctoral students. It was\nSerre\nwho suggested that the seminars should be written up for publication and fifteen ENS-Seminars written by Cartan were published between\n1948\nand\n1964\n.\nCartan worked on analytic functions, the theory of sheaves,\nhomological theory\n,\nalgebraic topology\nand\npotential theory\n, producing significant developments in all these areas. Some of his work is put in context by R O Wells Jr reviewing\n[\n2\n]\n:-\nThe theory of functions of several complex variables has gone from its infancy with the work of Hartogs, Levi and\nPoincaré\nshortly after the turn of the century to its current role as a central field of modern mathematics, much as its predecessor, function theory in one complex variable, did in the\n19\nth\ncentury. A central figure in this development has been Henri Cartan, whose series of papers in this field starting in the\n1920\n's dealt with fundamental questions relating to\nNevanlinna\ntheory, generalizations of the\nMittag-Leffler\nand\nWeierstrass\ntheorems to functions of several variables, problems concerned with\nbiholomorphic\nmappings and the biholomorphic equivalence problem, domains of holomorphy and holomorphic convexity, etc. The major developments in the theory from\n1930\nto\n1950\ncame from Cartan and his school in France,\nBehnke\n's school in Münster, and\nOka\nin Japan. The central ideas up to that time were synthesized in Cartan's Séminaires in the early\n1950\n's, and these were very influential to the next several generations of mathematicians. Cartan's accomplishments were broad and he influenced mathematics through his writing, his teaching, his seminars, and his students in a remarkable manner.\nIn the Preface of\n[\n2\n]\nRemmert and\nSerre\nwrite:-\nThe reader should be aware that these volumes do not fully reflect H Cartan's work, a large part of which is also contained in his fifteen ENS-Seminars\n(1948\n-\n1964)\nand in his book Homological algebra with\nS Eilenberg\n. In particular one cannot appreciate the importance of Cartan's contributions to sheaf theory, Stein manifolds and analytic spaces without studying his\n1950\n/\n51\n,\n1951\n/\n52\nand\n1953\n/\n54\nSeminars. Still, we trust that mathematicians throughout the world will welcome the availability of the 'Oeuvres' of a mathematician whose writing and teaching has had such an influence on our generation.\nWe should mention another aspect of Cartan's work which has been involved with politics and in particular supporting human rights. In\n1974\na case arose when the Russian authorities placed the mathematician Leonid Plyushch in a special psychiatric hospital. Andrei Sakharov pointed out that this was a political act and Cartan began a strenuous campaign for Plyushch's release. The International Congress of Mathematicians was held in Vancouver in\n1974\nand this presented an opportunity to gain wide international support for Plyushch with a thousand signatures to a petition for his release. After the Congress Cartan played a major role in setting up the\nComité des Mathématiciens\nto support Plyushch in particular, and all dissident mathematicians. In January\n1976\nthe Soviet authorities released Plyushch which was a major success for Cartan and the\nComité des Mathématiciens\n. But the Committee did not stop after this success. It has supported other mathematicians who have suffered for their political views, such as the Uruguayan mathematician\nJosé Luis Massera\n. For his outstanding work in assisting dissidents Cartan received the Pagels Award from the\nNew York Academy of Sciences\n.\nCartan is a member of the\nAcadémie des Sciences\nof Paris and of other academies in Europe, the United States, and Japan. He was elected to membership of the\nRoyal Danish Academy of Sciences\n(1962)\n, The\nRoyal Society of London\n(1971)\n, the\nAmerican Academy\n(1950)\n, the\nNational Academy of Sciences\nin Washington\n(1972)\n, The Royal Academy of Belgium\n(1978)\n, the\nAkademie der Wissenschaften Göttingen\n(1971)\n, the Royal Academy of Science Madrid\n(1971)\n, Bayerische Akademie der Wissenschaften\n(1974)\n, the Academy of Japan\n(1979)\n, the Academy of Finland\n(1979)\n, the\nRoyal Swedish Academy of Sciences\n(1981)\n, the\nPolish Academy of Sciences\n(1985)\n, the\nRussian Academy\n(1999)\n. Among the many honours which have been awarded to him was honorary membership of the\nLondon Mathematical Society\nin\n1959\n. He has received honorary doctorates from several universities including ETH Zürich\n(1955)\n, Münster\n(1952)\n, Oslo\n(1961)\n, Sussex\n(1969)\n, Cambridge\n(1969)\n, Stockholm\n(1978)\n, Oxford\n(1980)\n, Zaragoza\n(1985)\n, and Athens\n(1992)\n. He also received the Gold Medal of the National Centre for Scientific research\n(1976)\n, the Wolf Prize in Mathematics in\n1980\nand was made Commandeur de la Légion d'Honneur in\n1989\n."
}