{
  "nome_completo": "Henry John Stephen Smith",
  "nome_curto": "Henry Smith",
  "ano_nascimento": "1826",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Smith/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Oxford, England",
  "biografia": "Henry Smith\n's father was John Smith, an Irish barrister, and his mother was Mary Murphy from near Bantry Bay. Henry's father John died when he was less than two years old and Mary was left to bring up their four children, of whom Henry was the youngest. One of his older sisters Eleanor Elizabeth Smith, born in\n1822\n, went on to make a major contribution to education, and in particular to women's education in Oxford. The family moved several times, but eventually found a permanent home in Ryde on the Isle of Wight in\n1831\n.\nHenry was a bright child who was taught first by his mother, then by private tutors in Hyde from\n1838\n. He attended Rugby public school from the age of\n15\nas a boarder. He was outstanding over a range of subjects and his ambition was a scholarship to Balliol College, Oxford. This was made harder since his health was poor\n(\na brother and sister had both died\n)\nand he was taken to Italy after the death of his brother in\n1845\ninstead of completing his final year at Rugby. He undertook private reading while in Italy and was still able to win the scholarship.\nAt\n19\nhe became a student at Balliol, but while spending the summer vacation in Italy his health problems became acute when he contracted smallpox. He was able to recommence his studies but while on holiday in France in the following year he contracted malaria. He could not return to Oxford but this had the advantage that he was able to study with some of the top mathematicians at the Sorbonne and the Collège de France such as\nArago\n. After his health recovered he returned to Oxford in\n1847\nand in\n1849\nwas awarded a double first in mathematics and classics.\nSmith became a fellow, then a tutor at Balliol College. In\n1860\nhe was appointed Savilian professor of geometry despite a strong field of applicants including\nGeorge Boole\n. In\n1861\nhe was elected a fellow of the\nRoyal Society\nbut despite the status of the Savilian chair he could not afford to give up his income from lecturing and continued teaching at Balliol. This arrangement continued until\n1873\nwhen he was made a fellow of Corpus Christi College which provided him with an income but no duties. This enabled him to give up his teaching position at Balliol.\nSmith did not marry but lived in Oxford with his mother until her death in\n1857\n. At this time his sister Eleanor moved in with him to effectively become his housekeeper. At the time that Eleanor moved in, Smith was living in St Giles' but in\n1874\nhe was appointed as keeper of the University Museum and moved into the keeper's house in the Museum in South Parks Road.\nWhile on the continent during his school and undergraduate years he had been learnt French, German and Italian and read widely. He had been most influenced by the work of\nGauss\n. Smith said:-\nIf we except the great name of\nNewton\n(\nand the exception is one that the great\nGauss\nhimself would have been delighted to make\n)\nit is probable that no mathematician of any age or country has ever surpassed\nGauss\nin the combination of an abundant fertility of invention with an absolute vigorousness in demonstration...\nInfluenced by\nGauss\n, Smith's most important contributions are in\nnumber theory\nwhere he worked on elementary divisors. He proved that any integer can be expressed as the sum of\n5\nsquares and as the sum of\n7\nsquares, showing in how many ways this could occur. In addition to solving these cases explicitly, he gave a method which would yield the number of ways that an integer can be expressed as the sum of\nk\nk\nk\nsquares for any fixed\nk\nk\nk\n. He published his results in\nThe orders and genera of\nquadratic forms\ncontaining more than three indeterminates\npublished in the Proceedings of the Royal Society in\n1867\n.\nEisenstein\nhad earlier proved the result for\n3\nsquares and\nJacobi\nfor\n2\n,\n4\nand\n6\nsquares. Smith also extended\nGauss\n's theorem on real quadratic forms to complex quadratic forms.\nFrom\n1859\nto\n1865\nhe prepared a report in five parts on the\nTheory of Numbers\n. In it Smith analyses the work of other mathematicians but adds much of his own. This work has been described as the:-\n... the most complete and elegant monument ever erected to the theory of numbers.\nSmith also wrote on geometrical topics. His first two papers were on geometry and, in\n1868\n, he wrote\nCertain cubic and biquadratic problems\nwhich won him the\nSteiner\nprize of the\nRoyal Academy of Berlin\n.\nSmith is remembered for the Smith normal form for\nmatrices\n. It appears to be less well known that, in\n1875\n, he gave examples of discontinuous sets which are similar to the\nSierpiński\ngasket, see\n[\n6\n]\n. His paper on this topic in the\nProceedings of the London Mathematical Society\nfor\n1875\ncontains a description of the\nCantor\nset eight years before\nCantor\n.\nHe is described in\n[\n2\n]\nas follows:-\nHe was a tall, good-looking man, renowned for his charm, generosity, warmth, and spontaneous wit ...\nWe learn much of Smith from the following comment from John Conington, the professor of Latin at Oxford,\n(\nsee for example\n[\n3\n]\n)\n:-\nI do not know what Henry Smith may be at the subjects of which he professes to know something; but I never go to him about a matter of scholarship, in a line where he professes to know nothing without learning more from him than I can get from any one else.\nSmith joined the\nLondon Mathematical Society\nduring the first year of its existence and he became its sixth president in\n1874\n-\n76\n. He gave his presidential address\nOn the present state and prospects of some branches of pure mathematics\nwhich was published in the\nProceedings of the London Mathematical Society\nin\n1876\n. He received many honours including honorary degrees from the universities of Cambridge and Dublin. He was appointed to two royal commissions, the royal commission into scientific instruction and the royal commission into the universities.\nDespite health problems when he was a student, Smith mostly enjoyed excellent health until\n1881\nwhen his heath began to deteriorate, mainly due to the extremely high level of work that he continued to undertake. A rather unusual event happened near the end of his life. The\nAcademy of Sciences\nin Paris set the question for the\n1882\nGrand Prix in Mathematics to be precisely the problem on the number of ways that an integer can be expressed as the sum of\nk\nk\nk\nsquares that Smith had solved in his\n1867\npaper\nThe orders and genera of quadratic forms containing more than three indeterminates\n. Smith wrote to\nHermite\nwho then realised that the\nAcademy of Sciences\nhad blundered by setting a problem which had already been solved.\nHermite\nasked Smith if he would cooperate in trying not to make the Academy look foolish, and simply submit a solution to the Grand Prix question. This Smith did but died before the prize was awarded. After his death the Academy awarded two full prizes, one to Smith and one to\nMinkowski\n."
}