{
  "nome_completo": "Henry Burchard Fine",
  "nome_curto": "Henry Fine",
  "ano_nascimento": "1858",
  "ano_morte": "1928",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fine_Henry/",
  "lugar_nascimento": "Chambersburg, Pennsylvania , USA",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Henry Fine\n's parents were Mary Ely Burchard and Lambert Suydam Fine who was a Presbyterian minister of Dutch ancestry. Henry was the eldest of his parents four children, having a younger brother and two younger sisters. His brother John became the founder of the Princeton Preparatory School, while one of his sisters, May Margaret, became the founder of Miss Fine's School. Lambert Fine died in\n1869\nwhen Henry was ten years old, and his mother moved to Ogdensburg, New York, for a period and then to Winona, Minnesota, and finally in\n1875\nshe came with her children to Princeton so they might have a good education\n[\n4\n]\n:-\nShe was, by all accounts, a woman of great ability and force of character and launched all her children on honourable careers.\nBefore coming to Princeton, life had not been too easy\n[\n4\n]\n:-\nFine's early years were those of a country boy under pioneer conditions. He was always enthusiastic about the two great rivers, the St Lawrence and the Mississippi, beside which he lived in those years and on which he learned to row. Rowing, by the way, was the only college sport in which he took an active part, though he was always keen on athletics and gave much time and energy to the direction of them up to the end of his life.\nHe received private coaching before entering the College of New Jersey in\n1876\n,\n130\nyears after it was founded. The College of New Jersey's name was changed to Princeton University in\n1896\n. Fine entered the College with the intention of studying classics and he began to study these subjects as well as Sanskrit. However, at Princeton he came across\nHalsted\nwho had studied under\nSylvester\nat Johns Hopkins University and spent the years\n1878\nto\n1881\nas an instructor in postgraduate mathematics at Princeton.\nHalsted\ninspired Fine to turn towards mathematics.\nAfter receiving his A.B. in\n1880\n, Fine was appointed a fellow in experimental science at Princeton but, never happy with experimental work, he happily changed to be a tutor in mathematics in\n1881\n. Fine then, as was the custom of the day, decided to study in Germany. He travelled to Leipzig in\n1884\nand there attended lectures by\nKlein\n,\nCarl Neumann\nand others. He worked for his doctorate on a topic suggested by\nStudy\n, and approved by\nKlein\n, and the degree was awarded for the dissertation\nOn the singularities of curves of double curvature\nin May\n1885\nby the University of Leipzig.\nFine spent the summer of\n1885\nin Berlin attending\nKronecker\n's lectures on eliminants which made a strong impression on him. Returning to the United States from Berlin, he was appointed assistant professor at Princeton. On\n6\nSeptember\n1888\nhe married Philena Fobes of Syracuse, New York; they had three children. Despite great promise as a research mathematician, Fine moved into other areas. As Archibald writes in\n[\n1\n]\n:-\n... Fine published a few research papers\n(1887\n-\n1890)\n, and another of some importance as late as\n1916\n. But his time was mainly devoted to teaching, administration, and the logical exposition of elementary mathematics.\nHis first research paper was\nOn the singularities of curves of double curvature\nwhich was his thesis, published in the\nAmerican Journal of Mathematics\nin\n1886\n. In the following year he published a generalisation of these results to\nn\nn\nn\ndimensions in the same journal. Two further paper\nOn the functions defined by differential equations with an extension of the Puiseux polygon construction to these equations\n, and\nSingular solutions of ordinary differential equations\nappeared in\n1889\nand\n1890\nrespectively. The later, rather significant, research publication refered to in the above quote was\nOn Newton's method of approximation\n(1917)\n.\nAmong the elementary texts he wrote are\nNumber system of algebra treated theoretically and historically\n(1891)\n,\nA college algebra\n(1905)\n,\nCoordinate geometry\n(1909)\n, and\nCalculus\n(1927)\n.\nFine's most important contributions were to the\nAmerican Mathematical Society\nand to Princeton University. He served the\nAmerican Mathematical Society\nas vice-president\n1992\n-\n93\nand as president\n1911\n-\n12\n. He gave his retiring address as president on\nAn unpublished theorem of Kronecker respecting numerical equations\n.\nAt Princeton he was promoted to a full professorship in\n1889\nand in\n1898\nhe was appointed Dod professor of mathematics. However, he moved into administration around\n1903\n. In part this was due to his undergraduate friend Woodrow Wilson being appointed as president of Princeton. It was in\n1903\n, shortly after becoming president, that Wilson appointed Fine as Dean of the Faculty. Together Wilson and Fine worked to lift the standards at Princeton, both by improving the curriculum  and in making strong faculty appointments. After Wilson left Princeton in\n1910\nto move forward in his political career by becoming governor of New Jersey, Fine stood in to run the university for two years until a new president was appointed\n(\nmany expected that Fine would be appointed president but it was not to be\n)\n. He then resigned as dean, but accepted the appointment as Dean of the Departments of Science. He chaired the committee set up in\n1925\nto obtain funds for research in the sciences at Princeton. Largely due to his efforts three million dollars were raised by\n1928\n.\nVeblen\ndescribes his character\n[\n4\n]\n:-\nHis firmness of character and wisdom in counsel made him the pre-eminent figure among his colleagues of the faculty up to the very end. He was the man to whom they turned more than to anyone else for leadership or advice, both in public and private affairs. These qualities were widely recognized outside Princeton, for he had more than one opportunity to become a University President, and President Wilson made several efforts to induce him to take important posts in his administration. But as he said quite simply, he preferred to continue as a professor of mathematics.\nHis other interests are described in\n[\n1\n]\n:-\nIn early days Fine played the flute in the college orchestra ... His knowledge of music was extensive... He took keen interest in games and in the daily life of the undergraduates.\nThe end of Fine's life was tragic. His wife died in April\n1928\nbut two of his three children had died earlier. However he visited Europe in the summer of\n1928\n, meeing again old friends and revisiting places from his past. He returned to the United States in August, and seemed to be looking towards an active furure. Fine died after a bicycle accident while he was going to visit his brother John at the Princeton Preparatory School:-\nIn the uncertain evening light he was riding his bicycle on a road in the outskirts of Princeton and was struck from behind by an automobile, the driver of which failed to see that he was starting to make a left turn. He died the next morning without having recovered consciousness.\nFine Hall, home of the Princeton Mathematical Department, is a memorial which keeps his name before mathematicians at one of the most important centres of mathematics in the United States, and the world."
}