{
  "nome_completo": "Henry Aldrich",
  "nome_curto": "Henry Aldrich",
  "ano_nascimento": "1648",
  "ano_morte": "1710",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Aldrich/",
  "lugar_nascimento": "Westminster, London, England",
  "lugar_morte": "London, England",
  "biografia": "Henry Aldrich\n's parents were Judith Francis and Captain Henry Aldrich. Captain Aldrich served the Berkeley family for many years, in particular he served John Berkeley who became commissioner of the navy. Henry was born in Westminster, an inner borough of London, lying on the north bank of the River Thames. He was the eldest of his parents sons. He attended school in Westminster and was awarded a scholarship in\n1658\n.\nOn\n19\nJuly\n1662\nAldrich entered Christ Church, Oxford, see\n[\n2\n]\n. He was awarded his M.A. in\n1666\nand his M.A. in the following year, then became a tutor at Christ Church. He had wide interests including mathematics, music, and architecture. He was well known as a humorist and Suttle\n[\n3\n]\ndescribes him as:-\n... a punner of the first value.\nIn\n1674\nhe published\nElementa geometricae\nwhich led to him being described by his Christ Church colleagues as\n[\n3\n]\n:-\n... a great mathematician of our house.\nHe was interested in ecclesiastical affairs and on\n4\nFebruary\n1682\nhe was appointed as a canon at Christ Church. He was awarded the divinity degrees of B.D. and D.D. a couple of weeks later. The Oxford Philosophical Society was founded in October\n1683\n, and Aldrich was a founder member giving a lecture at the first meeting of the Society. He sang in the Christ Church Cathedral choir and organised weekly music meetings associated with the choir but covered a much wider range of musical activities and styles\n[\n1\n]\n:-\nThe gatherings were remembered for their conviviality; Aldrich was a renowned drinker and pipe smoker. He was 'a highly competent composer' ...\nAlthough Aldrich was a natural choice to take over as Dean of Christ Church when the position fell vacant in\n1686\n, the king appointed a Roman Catholic to the position for religious reasons. However after the revolution of\n1688\nsuch things changed dramatically and Aldrich was appointed dean in April\n1689\n.\nIn\n1691\nhe published\nArtis logicae compendium\na treatise on logic which was to be the main text on the topic for\n150\nyears in England. Even when Richard Whately published\nElements of logic\nin\n1826\nit still took Aldrich's work as his starting point, but then this much more modern text took over the role which\nArtis logicae compendium\nhad held for so long; see\n[\n4\n]\nfor further details.\nFor three years, from\n4\nOctober\n1692\n, Aldrich was vice-chancellor of Oxford University. He composed music to be used in university ceremonies and also experimented with using movable type to print music. We mentioned above his interest in architecture and we should mention that he supervised the repair of St Mary's Church, Oxford, in\n1675\nand\n1676\n. Handley writes\n[\n1\n]\n:-\nHe was probably the original architect of All Saints' Church, Oxford, constructed between\n1701\nand\n1710\n, and was certainly the designer of the Peckwater quadrangle in Christ Church, begun in\n1706\nbut not finished until\n1714\n, after Aldrich's death.\nHe took ill in November\n1707\nbut recovered well enough to carry on his duties. However, when his health deteriorated in\n1710\nhe went to London to seek treatment and it was while he was in London that he died. He was buried in Christ Church on\n22\nDecember."
}