{
  "nome_completo": "Henry Jack",
  "nome_curto": "Henry Jack",
  "ano_nascimento": "1917",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jack_Henry/",
  "lugar_nascimento": "Menzieshill, near Dundee, Scotland",
  "lugar_morte": "Dundee, Scotland",
  "biografia": "Henry Jack\n's father, also named Henry Jack, was a farmer from Menzieshill, near Dundee. Henry, the subject of this biography, had his birth registered in Benvie, Angus, a few km west of Dundee. His secondary education was at Dundee High School where he was taught mathematics by\nJohn George Brotchie Meiklejohn\n, the Head of Mathematics at the school. Before he entered\nMeiklejohn\n's classes, Jack had been more interested in rugby than in any academic subjects but\nMeiklejohn\n's teaching changed the course of Jack's life. He writes in\n[\n1\n]\nabout\nMeiklejohn\n's teaching and, in particular, his experiences in his class:-\n[\nMeiklejohn\n's\n]\noutstanding success as a teacher depended on three things -\n(1)\nhe was a first-class mathematician with a great love for his subject;\n(2)\nhe prepared every lesson with meticulous care;\n(3)\nhe was a strict disciplinarian. His teaching was most intensive and there was never a moment of relaxation in any of his classes. No class was ever late in assembling, for awaiting them on the blackboard would be three examples headed \"Just Now\" and the tawse for anyone who had not submitted one correct example within ten minutes. If he was a \"terror,\" he was a most genial human terror, for those at the top had continually to justify their place, while those at the bottom had only to fear the tawse for a really abysmal lack of knowledge. Too busy with his teaching to produce original work, he kept his mind sharp by reading new books on advanced mathematics. New methods were all carefully kept in a series of notebooks for use in his class-work. The present writer well remembers being taught the simpler inequalities from\nHardy\n,\nLittlewood\nand\nPolya\nand, on later seeing a copy of this book, finding that it had just been published.\nMeiklejohn\nencouraged Jack to study mathematics at University and he also encouraged him to enter the Bursary Competition for Edinburgh University. Jack was awarded a Dalhousie Bursary and matriculated at Edinburgh University in the autumn of\n1936\n. At Edinburgh he was taught by, among others,\nEdmund Whittaker\nand\nLeonard Edge\n. His performance was excellent and he received many prizes and class medals during his four undergraduate years, He graduated in\n1940\nwith an M.A. with First Class Honours in Mathematics and Natural Philosophy. However, Edinburgh had a very classical syllabus at this time and although he took courses on analysis and geometry, he gained little experience in algebra. Later he regretted this writing in\n1976\n[\n2\n]\n:-\nThere was no group theory taught in Edinburgh between\n1936\n-\n40\n.\nBoth\nEdmund Whittaker\nand\nLeonard Edge\nhad taken the Cambridge Tripos so it was natural that they advised their star pupil to continue to study mathematics at Cambridge. Although it might look strange that someone with an Honours Degree would take the Cambridge Tripos, nevertheless, this was the traditional route for Scottish students at this time. Jack matriculated at Christ's College, Cambridge in the autumn of\n1940\nbut by this time Britain was fighting in World War II and young men were being called up for military service. Indeed, Jack was waiting to be called up when he matriculated at Cambridge and soon after he arrived there he was called up for service with the Royal Air Force and began undertaking meteorological work\n[\n4\n]\n:-\nHe became a commissioned officer and saw service in both the Middle and near East as well as in Britain.\nA nice story that Jack recounted from his wartime experiences was when he was stationed on the Scottish island of Tiree, in the Inner Hebrides. Sitting in a tin hut, Jack and his colleagues suddenly heard a loud noise and immediately there was an alert believing it could be a possible German invasion. Actually it was a cow rubbing itself on the tin hut! Arthur Sands sees Jack's military service as influencing his ability to help his students\n[\n3\n]\n:-\nPerhaps he developed then that talent and liking for forecasting, which he was to apply later to the performance of University students.\nAfter serving in the Royal Air Force for six years, he was demobbed in\n1946\nand was able to return to his studies at Cambridge. He took the Mathematical Tripos, taking Part II in\n1948\nand Part III in the following year. He was awarded a B.A. with First Class Honours. Arthur Sands describes how Jack helped his fellow undergraduates during these years\n[\n3\n]\n:-\nHe was one of that generation of ex-servicemen who brought a maturity to university life in those days. Other younger Scottish students who went up directly from their undergraduate courses in Scotland have mentioned to me his kindness to them and his concern to see that they made this transition successfully.\nAfter taking Part III, Jack remained at Cambridge undertaking research. He still attended some courses\n[\n2\n]\n:-\nI attended one\n[\ngroup theory\n]\ncourse at Cambridge after I had taken Part III in\n1949\n.\nHe was, however, unfortunate in his research for he was just getting some interesting results when someone else published a paper on the problem he was working on. Also, because of the war and having taken two undergraduate degrees, he was now much older than most of the other research students at Cambridge. When he was offered a position as a lecturer in mathematics at University College, Dundee by\nEdward Copson\nhe decided to accept, giving up his research at Cambridge. At this time,\nCopson\nheld the chair of mathematics at University College, Dundee. We note that University College, Dundee, was then part of the University of St Andrews. It was renamed Queen's College in\n1954\n, still being a college of the University of St Andrews, and only became the University of Dundee in\n1967\n. When Jack became a lecturer in Dundee, he joined a small department\n[\n5\n]\n:-\nThe department at that time had a family atmosphere, decisions were taken during morning coffee, there were few official meetings, no teaching aids, no secretarial assistance, classes were small but teachers knew their students personally. Every member of the small staff might be called upon to lecture in any branch of mathematics ...\nEdward Copson\nmoved to the Regius Chair of Mathematics in St Andrews soon after Jack's appointment in Dundee and Murray Macbeath became the new professor of mathematics in Dundee. At this stage in his career, Jack lived in student residences, serving as a sub-warden of Airlie Hall, then as warden of the William Low residence which housed medical students. He married Jean Mills\n(\nknown as Winkie\n)\nin\n1956\nand they lived at\n77\nBlackness Avenue, Dundee. She was a widow with three sons at secondary school, so he became step-father to three boys. Jack remained a Lecturer in Mathematics until\n1964\nwhen he was promoted to Senior Lecturer. He was promoted to Reader in\n1970\n.\nWhen he was first appointed to Dundee, Jack concentrated on teaching and did not undertake original research. As well as teaching mathematics students, Jack taught the large contingent of engineering students. He was well liked by the students and had a habit of beginning his lectures with a joke. The engineering students would chant \"Joke, Jack. Joke, Jack. Joke, Jack.\" when he came in to give his lectures\n[\n3\n]\nBoth with a class and with individuals he established a relationship which was paternal, even authoritarian, and yet friendly because he was clearly interested in them and their good. He is remembered with affection by successive generations. He became an Adviser of Studies in the Faculty of Science and then, when Dundee University became independent, he was elected as the first Dean of Students. ... He was adept at finding rescue courses for students who had fallen foul of the system, especially if he felt that they had been misled by those more interested in numbers in honours classes than in the welfare of the particular student. He was also good at encouraging depressed students to believe in themselves and to work again.\nAlthough he continued to enjoy teaching, he began joint research with Murray Macbeath leading to a joint publication\nThe volume of a certain set of matrices\n(1959)\n. This was the first of his research papers but it was soon followed by further papers:\nAn application of the addition theorem for determinants\n(1962)\n;\nAn integral over the interior of a simplex\n(1963)\n;\nThe gamma function without infinite products\n(1964)\n;\nA generalisation of Dirichlet's multiple integral\n(1964)\n; and\nJacobians of transformations involving orthogonal matrices\n(1965)\n. These all appeared in the\nProceedings\nof the\nEdinburgh Mathematical Society\n. His next few papers were either published in the\nProceedings\nof the\nEdinburgh Mathematical Society\nor in the\nProceeding\nof the\nRoyal Society of Edinburgh\n. However, it was in\n1970\nthe Jack published his most important paper. Murray Macbeath gave, in\n1979\n, the following summary of Jack's research contributions\n(\nsee for example\n[\n4\n]\n)\n:-\nJack's interest in integration spaces of matrices had its origin in a problem which arose in connection with certain work of\nC A Rogers\nand myself in the geometry of numbers. There were certain results which we were practically certain were true but further progress depended on being able to make an estimate of the order of magnitude of certain integrals as a parameter tended to infinity. We managed with some difficulty to get rather clumsy estimates which were sufficient for the purpose we had in mind, but at that time I drew Jack's attention to the problem, mentioning how much more satisfactory it would be if an exact evaluation were possible. Within a few weeks Jack produced a complete solution in the case of the first two or three dimensions and then with later studying he solved the problem completely, with the use of very elegant combinations of algebraic and analytical techniques. Encouraged by this success Jack began to look through the literature and saw that the techniques which he had applied in that particular case were capable of very much improving and simplifying much of the work that had been done in connection with multivariate analysis in statistics. In fact he was able to give much shorter and elegant derivations of many known results, but I think that quite a lot of this work of his has remained unpublished. He did also find naturally new applications of his method, and he has produced in the years between\n1959\nand now\n(1978)\nsome ten papers on various applications of his method. Perhaps the most interesting of these is one, which has appeared in the Proceedings of the\nRoyal Society of Edinburgh\n.\n(\nThis is the paper 'A class of symmetric polynomials with a parameter'\n(1970))\n. This paper is not only merely an evaluation of an integral, but it relates his integrals to classes of symmetric polynomial, which are of importance in the theory of representations of the symmetric group. He has discovered a natural basis for the symmetric polynomials different from those which have already been described.\nWalter Ledermann\n, also in\n1979\n, realised the importance of these contributions by Jack writing\n(\nsee for example\n[\n4\n]\n)\n:-\nHis long paper on polynomials associated with partitions has a bearing on the difficult topic of zonal polynomials and I feel that this particular piece of work is most likely to have an impact on further research.\nHis work was seen to be important and the\nRoyal Society of Edinburgh\nawarded him their Keith Prize in\n1970\nand, in the same year, elected him to a fellowship of the\nRoyal Society of Edinburgh\n. He continued to try to develop his ideas and made a number of conjectures. In\n1976\nJack wrote to\nG de B Robinson\nat the University of Toronto trying to interest him in the ideas that he was developing and, in particular, in his conjectures. He wrote\n[\n2\n]\n:-\nIf I am anything at all, I am an ageing classical analyst who was led to study these zonal polynomials as a result of working on various multiple integrals.\nA manuscript\nA class of polynomials in search of a definition, or the symmetric group parametrised,\nunpublished during Jack's lifetime, was eventually published in V B Kuznetsov and S Sahi\n(\neds.\n)\n,\nJack, Hall-Littlewood and Macdonald polynomials\n(\nContemp. Math\n.\n417\nAmer. Math. Soc., Providence, RI,\n2006)\n. We should note that all the conjectures that he made have subsequently been proved true. However, illness cut short Jack's career. In September\n1977\nhe was diagnosed with liver cancer and underwent radiotherapy treatment in Ninewells Hospital, at that time a very new hospital on the outskirts of Dundee. His condition deteriorated rapidly, however, and he died in early January\n1978\n.\nAs to his interests outside mathematics, Arthur Sands writes\n[\n3\n]\n:-\nThe casual acquaintance might not have recognised in him the connoisseur of claret or the collector of Mason China."
}