{
  "nome_completo": "Henry Ernest Dudeney",
  "nome_curto": "Henry Ernest Dudeney",
  "ano_nascimento": "1857",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dudeney/",
  "lugar_nascimento": "Mayfield, Sussex, England",
  "lugar_morte": "Lewes, Sussex, England",
  "biografia": "Henry Ernest Dudeney\ncame from a family which had a mathematical tradition and also a tradition of school teaching. Henry's father Gilbert Dudeney\n(\nborn in Mayfield, Sussex about\n1825)\nwas a schoolmaster and his father, Henry's paternal grandfather, although he began life as a shepherd, taught himself mathematics and astronomy and left his life on the hills to become a schoolmaster in Lewes. Heny's mother was Lucy Ann Rich\n(\nborn in Bridgewater, Somerset about\n1832)\n. Henry had one older brother Thomas\n(\nborn about\n1855)\n. He had four younger sisters Lucy\n(\nborn about\n1862)\n, Kate\n(\nborn about\n1863)\n, Emily\n(\nborn about\n1864)\n, and Alice\n(\nborn about\n1865)\n.\nHenry learnt to play chess at a young age and soon became interested in chess problems. From the age of nine he was composing problems and puzzles which he published in a local paper. Although he only had a basic education, never attending college, he had a particular interest in mathematics and studied mathematics and its history in his spare time. As he pointed out:-\nThe history of mathematical puzzles entails nothing short of the actual story of the beginnings and development of exact thinking in man.\nCertainly, as he realised in reading about the history of mathematics, its development is closely linked with puzzle solving.\nDudeney worked as a clerk in the Civil Service from the age of\n13\nbut continued to study mathematics and chess. He began to write articles for magazines and joined a group of authors which included Arthur Conan Doyle. At this stage he was doing well publishing mathematical puzzles under the pseudonym 'Sphinx'. In\n1884\nDudeney married and his wife, a popular novelist of the day, helped to make the family very well off financially.\nSam Loyd\nstarted sending his puzzles to England in\n1893\nand a correspondence started between him and Dudeney. The two were the main creators of mathematical puzzles and recreations of their day and it was natural that they should exchange ideas. Of the two puzzle experts it was Dudeney who showed the more subtle mathematical skills. He sent a large number of his puzzles to\nLoyd\nand became very upset when\nLoyd\nbegan to publish them under his own name.\nIn\n[\n5\n]\nNewing describes how one of Dudeney's daughters:-\n... recalled her father raging and seething with anger to such an extent that she was very frightened and, thereafter, equated\nSam Loyd\nwith the devil.\nWe have indicated that Dudeney had a mathematical talent and this is very clear looking at some of his famous puzzles. For example, one of the most famous of his geometrical puzzles is the 'haberdasher's problem' which asks how one can cut an equilateral triangle into four pieces that can be reassembled to form a square. He had a model made which was hinged in such a way that it could be formed into a square or an equilateral triangle. The\nRoyal Society\nwas interested in this geometrical novelty and in\n1905\nDudeney demonstrated his geometrical puzzle at a meeting of the Society.\nDudeney contributed to the\nStrand Magazine\nfor over\n30\nyears, beginning after his collaboration with\nLoyd\nended, and from around the same time he began publishing in\nBlighty, Cassell's, The Queen, Tit-Bits\n, and the\nWeekly Dispatch\n. Dudeney's very popular collections of mathematical puzzles\nThe Canterbury Puzzles\n(1907)\n,\nAmusements in Mathematics\n(1917)\n, and\nModern Puzzles\npublished in\n1926\n, contain a wealth of fascinating examples which would provide any teacher of mathematics with a treasure trove of material.\nSince we are looking at the more mathematical aspects of Dudeney's work, the chapter headings of\nAmusements in Mathematics\nwill prove interesting. These are: Arithmetical and Algebraical Problems; Geometrical Problems; Points and Lines Problems; Moving Counter Problems; Unicursal and Route Problems; Combination and Group Problems; Chessboard Problems; Measuring, Weighing, and Packing Puzzles; Crossing River Problems; Problems concerning Games; Puzzle Games; Magic Square Problems; The Paradox Party; Unclassified Problems.\nHe wrote about the psychology of puzzles in the Prefaces to some of his books:-\nThe fact is that our lives are largely spent in solving puzzles; for what is a puzzle but a perplexing question? And from our childhood upwards we are perpetually asking questions or trying to answer them.\nAgain he wrote:-\nThe solving of puzzles consists merely in the employment of our reasoning faculties, and our mental hospitals are built expressly for those unfortunate people who cannot solve puzzles.\nOne would have to say that there is rather a lot of evidence against this latter point of view!\nYou can read the Preface to\nAmusements in Mathematics\nat\nTHIS LINK\n.\nAs we mentioned, chess was one of his first encounters with puzzles and it remained an interest throughout his life. He was a founding member of the British Chess Problem Society in\n1918\n, chairing its first meeting. Like\nLoyd\n, Dudeney produced many non-standard chess problems such as one where the White pieces are in their initial position, while Black only has a King which is on its own initial square. The problem is to find a mate in\n6\nfor White.\nAfter Dudeney's death his wife helped edit a collection of his puzzles\nPuzzles and Curious Problems\n(1931)\nand later on she again helped edit a second collection which was entitled\nA Puzzle Mine\n.\nReferences\n[\n2\n]\nand\n[\n3\n]\nshow that Dudeney's puzzles are still of interest to many mathematicians. In\n[\n2\n]\na generalisation of Problem\n229\nin\nMartin Gardner\n's\nH E Dudeney's\n536\npuzzles and curious problems\n(1967)\nis discussed. In\n[\n3\n]\nthe following problem of Dudeney, posed first in\n1905\nand appearing in\nAmusements in mathematics\n(1917)\n, is discussed:-\nIs it possible to seat\nn\nn\nn\npeople at a round table on\n1\n2\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\n\\large\\frac{1}{2}\\normalsize (n - 1)(n - 2)\n2\n1\n​\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\noccasions so that each person has the same pair of neighbours exactly once.\nA proof is given in\n[\n3\n]\nfor\nn\nn\nn\neven, but the case of\nn\nn\nn\nodd still appears to be open.\nLet us now look at a few more examples of Dudeney's puzzles. First one called\nCatch the hogs\nwhich is from\nThe Canterbury Puzzles\n(1907)\n:-\nIn the illustration Hendrick\n(\nH\n)\nand Katrun\n(\nK\n)\nare seen engaged in the exhilarating sport of attempting the capture of a couple of hogs\n(\nBP the black pig, and WP the white pig\n)\n. Why did they fail?\nHe then goes on to explain the rules of the game. Player one moves first and moves both Hendrick\n(\nH\n)\nand Katrun\n(\nK\n)\none square each in any direction, but not diagonally. Player two then moves the hogs\n(\nBP and WP\n)\neach one square, again not diagonally. Try the game and see if Hendrick and Katrun can catch the hogs!\nClick\nTHIS LINK\nfor the solution.\nHere is another problem from\nThe Canterbury Puzzles\nwhich is easily solved with a little mathematics:-\nIt used to be told at St Edmondsbury that many years ago they were overrun with mice that the good abbot gave orders that all the cats from the country round should be obtained to exterminate the vermin. A record was kept, and at the end of the year it was found that every cat had killed an equal number of mice, and the total was exactly\n1111111\nmice. How many cats do you suppose there were?\nOther puzzles simply reduced to systems of linear equations if a mathematical solution was sought. For example Problem\n3\nfrom\nAmusements in Mathematics:-\nThree countrymen met at a cattle market. \"Look here, \" said Hodge to Jakes, \"I'll give you six of my pigs for one of your horses, and then you'll have twice as many animals here as I've got.\" \"If that's your way of doing business,\" said Durrant to Hodge, \"I'll give you fourteen of my sheep for a horse, and then you'll have three times as many animals as I.\" \"Well, I'll go better than that, \" said Jakes to Durrant; \"I'll give you four cows for a horse, and then you'll have six times as many animals as I've got here.\"\nNo doubt this was a very primitive way of bartering animals, but it is an interesting little puzzle to discover just how many animals Jakes, Hodge and Durrant must have taken to the cattle market.\nProblem\n11\nfrom the same book reduces to a quadratic equation:-\n'Twas last Bank Holiday, so I've been told,\nSome cyclists rode abroad in glorious weather.\nResting at noon within a tavern old,\nThey all agreed to have a feast together.\n\"Put it all in one bill, mine host,\" they said,\n\"For every man an equal share will pay.\"\nThe bill was promptly on the table laid,\nAnd four pounds was the reckoning that day.\nBut, sad to state, when they prepared to square,\n'Twas found that two had sneaked outside and fled.\nSo, for two shillings more than his due share\nEach honest man who had remained was bled.\nThey settled later with those rogues, no doubt.\nHow many were they when they first set out?\nDudeney invented something he called Verbal Arithmetic. One of his examples of this is the famous\nS E N D\nM O R E\nM O N E Y\nIn this addition sum each letter represents a digit, different letters being different digits. Find the sum.\nFinally let us give an example of a geometrical problem from\nAmusements in Mathematics\n.\nThis is the\nJoiner's problem\n:-\nA joiner had two pieces of wood of the shapes and relative proportions shown in the diagram. He wished to cut them into as few pieces as possible so that they could be fitted together, without waste, to form a perfectly square table-top. How could he have done it? There is no necessity to give measurements, for if the smaller piece\n(\nwhich is half a square\n)\nbe made a little too large or small, it will not effect the method of solution.\nClick\nTHIS LINK\nfor the solution.\nDudeney's final illness is described in\n[\n1\n]\n:-\nHe had been in failing health for some time, but, even through his illness, he continued to write his articles for London journals."
}