{
  "nome_completo": "Henry Frederick Baker",
  "nome_curto": "Henry Baker",
  "ano_nascimento": "1866",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Baker/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Henry Baker\n's parents were Sarah Ann Britham and Henry Baker. His father, also called Henry, was a domestic butler. He attended a number of small schools in Cambridge before being educated at Perse School in Cambridge. He won a\nsizarship\nto St John's College in the summer of\n1883\nbut remained at Perse School to prepare for the Cambridge Scholarship examinations, which he sat in December\n1883\n.\nIn the examinations he won a scholarship to St John's College, Cambridge, matriculating in October\n1884\n. In\n1887\nhe was Senior\nWrangler\nin the Mathematical Tripos. In fact he was first equal, being bracketed in top place with two other students. He was elected a Fellow of St John's College in\n1889\nand, in the same year, won the first Smith's prize.\nBaker would remain at Cambridge for the whole of his career, strongly influencing the teaching of pure mathematics in that university and in the rest of Great Britain. From\n1890\nto\n1895\nhe was a College Lecturer, being influenced by\nCayley\nduring this period, then he became a University Lecturer until\n1914\n. From\n1903\nto\n1914\nhe also held the\nCayley\nLectureship in Mathematics, then from\n1914\nuntil he retired in\n1936\nhe was Lowndean Professor of Astronomy and Geometry. He justified the 'astronomy' title in his chair by lecturing on periodic orbits and other astronomical topics but he continued to undertake research exclusively in pure mathematics.\nBaker, while on a visit to Göttingen, was inspired by\nKlein\nto study algebraic function theory. He wrote the important\nAbel's Theorem and the Allied Theory of Theta Functions\nin\n1897\nand another major contribution\nMultiply Periodic Functions\nin\n1907\n. The first of these was reprinted by Cambridge University Press in\n1995\n.\nHe also came in contact with the Italian School of geometry and made their work the subject of his\n1911\nLondon Mathematical Society\npresidential address. From\n1911\nhe studied birational geometry publishing his most important contribution, a six volume masterpiece\nPrinciples of Geometry\nfrom\n1922\nto\n1925\n. The first two volumes cover the foundations of Euclidean geometry and the introduction of a coordinate system, volume\n3\nstudies solid geometry considering quadrics, cubic curves in space, and cubic surfaces. Volume\n4\nconsiders higher dimensions, mainly dimensions four and five, while the final two volumes cover the analytical principles of the theory of curves and the theory of algebraic surfaces and higher loci.\nIn\n1943\nBaker published\nAn Introduction to Plane Geometry\nwhich was reprinted in\n1971\n. Its contents are as follows: Euclid's theory of parallel lines; Propositions of incidence; The symbolic representation and Pappus's theorem; Theorems proved from the propositions of incidence; The fundamental hypothesis; The symbols of the real points of a line; Involution and harmonic ranges; Related ranges and pencils; Conics; Assignment of two absolute points, properties of circles; The parabola; The rectangular hyperbola; Theorems on conics; Length and distance; Equation of conic and line.\nBaker also undertook the extremely large task of editing\nSylvester\n's papers. The four volumes of the\nCollected Mathematical Papers of James Joseph Sylvester\nwere edited and published by Baker between\n1904\nand\n1912\n, and with these volumes he produced a fitting tribute to the great mathematician.\nElected to a Fellowship of the\nRoyal Society\nin\n1898\n, it was indeed highly appropriate that Baker won the Society's\nSylvester\nMedal in\n1910\n. He was secretary of the Cambridge Philosophical Society in\n1897\nand he won the\nDe Morgan\nMedal of the\nLondon Mathematical Society\nin\n1905\n, being president of the Society in\n1910\n-\n11\n. He was elected President of Section A of the\nBritish Association\nmeeting held in Birmingham in\n1913\n. His address to the Association provided an opportunity for Baker to explain his feelings about the relation of pure mathematics to other sciences. He said\n[\n1\n]\n:-\nThe mathematician is as sensitive as others to the marvel of each recurring springtime. ... Pure mathematics is an art, a creative art. ... Pure mathematics is not the rival, even less is it the handmaid, of other branches of science. Properly pursued it is the essence and soul of them all.\nBaker inspired a younger generation of geometers. He founded the Saturday afternoon seminar or 'tea party' which became the focus of activity in geometry. His personality is described in\n[\n3\n]\n:-\nIn appearance Baker was a heavily built man, with a thick moustache. this made him rather formidable to strangers and as he was also very shy some found him difficult to approach at first. But once the barriers were broken down his pupils found him less awe-inspiring, although they always treated him with great respect. The protocol at his \"tea-parties\" was strict, and a pupil could not stay away without an acceptable excuse; but provided the rules were obeyed the atmosphere was extremely friendly."
}