{
  "nome_completo": "William Henry Fox Talbot",
  "nome_curto": "Henry Fox Talbot",
  "ano_nascimento": "1800",
  "ano_morte": "1877",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Talbot/",
  "lugar_nascimento": "Melbury Sampford, Dorset, England",
  "lugar_morte": "Lacock Abbey (near Chippenham), Wiltshire, England",
  "biografia": "Henry Fox Talbot\nis usually known today under this version of his name. However, he greatly disliked this version and always made it known that he wished to be Henry F Talbot or H F Talbot. We shall at least go some way towards his wishes and refer to him as Talbot\n(\nor Henry\n)\nthroughout this article.\nHenry's father was William Davenport Talbot and his mother was Elisabeth Theresa Fox-Strangways. Davenport Talbot owned Lacock Abbey in Wiltshire which had been in the possession of the Talbot family since the\n1500\ns but this only happened because two husbands took their wife's name of Talbot to keep the Talbot family name from dying out. Lady Elisabeth Fox-Strangways was the eldest child of Henry Thomas Fox-Strangways, second earl of Ilchester, and was from a family which moved in the highest political circles. Given the status of the families one might expect Henry to be born into a wealthy but, on the contrary, when he was born, Lacock Abbey was £\n30\n,\n000\nin debt, this being a substantial sum in those times. Financial problems was not the only difficulty the family had, for Davenport Talbot died was Henry was only five months old leaving Lady Elisabeth in a somewhat tricky situation. Henry's mother was a rather remarkable woman, however, being highly intelligent and very well educated. She was very interested in politics and fluent in French, Latin, and Greek. Her skilful management of the Lacock Abbey estate would mean that Henry would eventually face no financial problems.\nOf course Lady Elizabeth's family owned a number of properties and Henry and his mother lived in a number of these at different times. She married Captain Charles Feilding\n(\nhe was later promoted to a Rear-Admiral\n)\nin\n1804\n. He was a devoted step-father to Henry who never lacked a father's love from that time. Daughters from the marriage of Elizabeth and Charles were born in\n1808\nand\n1810\n. Henry met the astronomer\nWilliam Herschel\nwhen he was eight years old, in the same year as he entered Rottingdean boarding school\n[\n2\n]\n:-\nHe was a brilliant student and eager to learn, but was painfully shy and reclusive by nature.\nIn\n1810\nHenry went to Harrow school where he remained until\n1815\nafter which his preparation for university was completed with two years private tuition at home. As a boy he had shown great curiosity about the world and remarkably wide interests, particularly in mathematics, languages, politics, botany, optics, and astronomy. He had enjoyed chemistry at school and got himself into trouble over causing explosions while experimenting with chemicals. He entered Trinity College, Cambridge, in\n1817\nand there he won prizes for Greek verse, and graduated with the classical medal in\n1821\nbeing twelfth\nwrangler\nin mathematics\n(\nthat is he was placed twelfth in the ranked list of First Class students\n)\n. He had now reached the age of\n21\nand, as we mentioned above, his mother's skilful management of the Lacock Abbey estate had restored it to a healthy financial position now free from the debts it faced at the time of his birth. Talbot received a healthy income from the estate. He was elected a Fellow of the newly founded\nRoyal Astronomical Society\nin\n1822\n. He worked hard at mathematical research but also enjoyed himself travelling widely on the Continent; he was particularly pleased to visit Italy.\nTalbot wrote papers on\nelliptic integrals\n, building on work of\nEuler\n,\nLegendre\n,\nJacobi\nand\nAbel\n. By the time he met\nJohn Herschel\nin Munich in\n1824\n(\nthe son of\nWilliam Herschel\nwhom he had met at age\n8)\nhe had published six mathematics papers and the two had many scientific interests in common, for example both were fine mathematicians and fellows of the\nRoyal Astronomical Society\n. They quickly became firm friends and Talbot's interests turned more towards the study of light. David Brewster, the Scottish physicist, was also experimenting with light at this time and he published a number of Talbot's articles. Talbot was elected a Fellow of the\nRoyal Society\nin\n1831\nfor his mathematical work. In addition to his work on mathematics and physics, Talbot also published on astronomy. On\n20\nOctober\n1833\nhe married Constance Mundy from Markeaton in Derbyshire. Shortly after this he was elected to serve as Member of Parliament for Chippenham which he did until\n1835\n. He would continue to have an interest in politics after the election of\n1835\nbut he chose not to stand for Parliament again in that election.\nAn important idea, which would change his whole life, came to him while he was in Italy in October\n1833\n. This was part of a holiday to France, Switzerland, and Italy that he was taking with his wife Constance. He was trying to make sketches on Lake Como in the north of Italy using a\ncamera lucida\nwhich is a drawing instrument\n(\ndo not be confused by the word camera - this instrument had no relation to photography\n)\n. In the introduction to\nThe Pencil of Nature\nwhich he published in\n1844\n, Talbot explains his thoughts in Italy on that October day:-\n[\nI\n]\nn October,\n1833\n, I was amusing myself on the lovely shores of the Lake of Como in Italy, taking sketches with a camera lucida, or rather, I should say, attempting to make them; but with the smallest possible amount of success ... After various fruitless attempts I laid aside the instrument and came to the conclusion that its use required a previous knowledge of drawing which unfortunately I did not possess. I then thought of trying again a method which I had tried many years before.\n[\nI\n]\nreflected on the inimitable beauty of the pictures of nature's painting which the glass lens of the camera obscura throws upon the paper in its focus - fairy pictures, creations of a moment, and destined as rapidly to fade away ... It was during these thoughts that the idea occurred to me ... how charming it would be if it were possible to cause these natural images to imprint themselves durably and remain fixed upon the paper!\nHe returned from Italy to continue his work as a Member of Parliament but by the spring of\n1834\nhe was living at Lacock Abbey carrying out experiments with photography. His expertise in chemistry and light were important factors in his success.\nJohn Herschel\nwas very interested in Talbot's experiments and devised many of the terms still in use today. He gave the name \"negative\" to the inverted image that Talbot was producing on his paper covered with suitably chosen chemicals, and \"fixing\" to the process that Talbot perfected of treating the paper with further chemicals to prevent further action by light. We have an example of a negative produced by Talbot in August\n1835\nwhich is a picture of the Oriel window in the South Gallery at Lacock Abbey. A copy of the negative is on display at Lacock where I have greatly enjoyed viewing the exhibits from Talbot's early experiments. Here is Talbot's own description:-\n... I constructed\n[\na camera obscura\n]\nout of a large box, the image being thrown upon one end of it by a good object-glass fixed at the opposite end. The apparatus being armed with a sensitive paper, was taken out in a summer afternoon, and placed about one hundred yards from a building favourably illuminated by the sun. An hour or so afterwards I opened the box and I found depicted upon the paper a very distinct representation of the building, with the exception of those parts of it which lay in the shade. A little experience in this branch of the art showed me that with a smaller camera obscura the effect would be produced in a smaller time. Accordingly I had several small boxes made, in which I fixed lenses of shorter focus, and with these I obtained very perfect, but extremely small pictures ...\nTalbot was able to find a way to print back his negatives onto sensitive paper giving a correct representation of the scene pictured. Moreover he could print multiple copies from a single negative. Photography was not his only interest, however, and he continued to work on mathematics and on light over the next few years without making public his photographic discoveries. He gave the Bakerian lecture to the\nRoyal Society\nin\n1837\nwith the title\nFurther observations on the optical phenomena of crystals\nand he received the Royal Medal from the\nRoyal Society\nin\n1838\nfor his mathematical achievements.\nBy the autumn of\n1838\nTalbot took up again his photographic work and began to contemplate writing a paper to be submitted to the\nRoyal Society\ndescribing his discoveries. However in January\n1839\nhe was shocked to read an announcement by\nArago\nand Daguerre claiming that Daguerre had developed a means of obtaining permanent images from a camera obscura. Talbot quickly moved to publicise his own work sending examples of his photographs to the Royal Institution in London less than a week after he heard of the French announcement, and he wrote to\nArago\nclaiming priority a couple of days later. He submitted a paper\nSome account of the art of photogenic drawing\non his photographic methods to the\nRoyal Society\non\n31\nJanuary\n1839\n. Later papers by Talbot on photography, however, the Society chose not to publish. In\n1840\nTalbot made further brilliant advances, discovering how to use chemicals to bring out an image from his sensitive paper after it had only been exposed for a very short time. He patented the process under the name\ncalotype\n.\nTwo factors meant that Talbot's process would not achieve the widespread use that Daguerre's process did. One was simply that Daguerre made his process freely available while Talbot charged a fee for anyone to use his, and secondly Daguerre's process produced much sharper image. This said, however, nobody can look at the images produced by Talbot without being impressed by their great beauty. In\n1844\nhe published\nPencil of nature\nthe first photographically illustrated book; we have quoted from the text above. Things went badly for him over his photographic patents for when he tried to use them to prevent others using similar methods, the court ruled in\n1854\nthat he was\n[\n2\n]\n:-\n... the true inventor of photography but ruled that newer processes were outside his patent. The acrimonious proceedings had stained Talbot's reputation so severely that the prejudices raised continue to surface in historical literature.\nHe did gain some recognition from the\nRoyal Society\nfor the his photographic work with the award of their Rumford medal in\n1842\n. He went through a period of bad health towards the latter years of the\n1840\ns but his health improved again in the next decade and he was able to undertake research with much the same vigour as he had in the\n1830\ns. He worked on producing images in ink and took out further patents regarding his printing processes. Although he never achieved commercial success with methods he was developing, he was going down precisely the right path towards modern methods of printing from a photographic plate.\nTalbot's home was Lacock Abbey but he spent much time in Scotland. He visited Edinburgh in the early\n1840\ns and published\nSun Pictures of Scotland\nin\n1845\nwhich contains photographs of Scotland including the Scott Monument on Princes Street in Edinburgh. From\n1855\nhe certainly lived for part of each year in Scotland during the next\n12\nyears or so. He was awarded an honorary degree by Edinburgh University in\n1863\n:-\n... because of his pre-eminence in literature and science, and the benefits his discoveries have conferred upon society.\nHis interests during his later years were not exclusively associated with photography and he became increasingly interested in archaeology being one of the first to translate the cuneiform writing from Nineveh. Schaaf writes in\n[\n2\n]\n:-\nThe inventor's name is preserved in various scientific fields: in mathematics, there is Talbot's curve; in physics Talbot's law and the Talbot\n(\na unit of luminous energy\n)\n; in botany two species are named after him; in astronomy a crater of the moon is named after him; and there is the persistent testimony of an art that has become so pervasive in society that its products are sometimes as invisible to us as are his latent images. In his lifetime, Talbot had published seven books and nearly sixty scientific and mathematical articles.\nDuring his final years he suffered from heart disease and this was the cause of his death which occurred in his study at Lacock Abbey."
}