{
  "nome_completo": "Henri Georges Garnir",
  "nome_curto": "Henri Garnir",
  "ano_nascimento": "1921",
  "ano_morte": "1985",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Garnir/",
  "lugar_nascimento": "Jemeppe sur Meuse, near Liège, Belgium",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Henri Garnir\nwas born in Jemeppe sur Meuse. This town was one of four, the others being Seraing, Ougrée and Boncelles, which in\n1977\nmerged into the single town of Seraing. The community of four towns were all situated within\n5\nto\n15\nkm of Liège. It was in Seraing that Garnir attended high school. He studied at the Athénée Royal, on the edge of the town of Seraing, and he graduated in\n1939\nwith a special prize for his achievements in mathematics. He entered the University of Liège in\n1939\nbut in May\n1940\nthe German armies invaded Belgium and quickly took control of the country. For the rest of his undergraduate studies at Liège the country was under German occupation. Garnir obtained his bachelor's degree in physical science in\n1943\nand a bachelor's degree in mathematical science in the following year. Florent J Bureau supervised Garnir's studies for this mathematics degree and he continued to supervise Garnir's doctoral studies, most of which were carried out after Belgium had been freed by the Allies. In\n1946\nhe was awarded his doctorate for his thesis\nSur les matrices hermitiennes apparaissant dans la théorie du méson\nⓉ\n(\nOn Hermitian matrices appearing in the theory of mesons\n)\n. He had been appointed as an assistant in rational mechanics at the University of Liège in\n1945\n.\nGarnir published a number of papers relating to his research during this period. In\nSur la théorie de la lumière de M L de Broglie\nⓉ\n(\nOn de Broglie's theory of light\n)\n(1945)\nhe compared the approach by Kemmer to the theory of the meson to\nde Broglie\n's modifications of\nMaxwell\n's equations. In\n1946\nGarnir published four articles:\nSur la détermination des matrices satisfaisant à un système de relations de la théorie du méson\nⓉ\n(\nOn the determination of matrices satisfying a system of relations in the theory of mesons\n)\n;\n(\nwith J Toussaint\n)\nSur la théorie des valences dirigées\nⓉ\n(\nOn the theory of directed valences\n)\n; and the two-part article\nUne question de théorie des groupes et son application à un problème de vibrations posé par la chimie théorique\nⓉ\n(\nGroup theory and its application to a vibration problem posed by theoretical chemistry\n)\n. In the first part of this article, representations of certain finite groups of two and three rowed matrices are analyzed while the second part discusses the way that such representations arise in the theory of vibrations. Special attention is given to molecular structure.\nIn\n1948\nGarnir married Noëlly Pierre who was a school teacher; they had two children, Dominique\n(\nwho became a medical doctor\n)\nand Henri-Pierre\n(\nwho became a university lecturer in physics\n)\n. In year following his marriage, Garnir spent four months undertaking research in Paris. Then in\n1950\nhe spent time at Nancy with\nJean Delsarte\n,\nJean Dieudonné\nand\nLaurent Schwartz\n. His research during this period involved the\nrepresentation theory\nof the symmetric and alternating groups and he published the\n100\n-page paper\nThéorie de la représentation linéaire des groupes symétrique\nⓉ\n(\nTheory of linear representations of symmetric groups\n)\nin\n1950\nand the\n22\n-page paper\nThéorie de la représentation linéaire des groupes alternés\nⓉ\n(\nTheory of linear representations alternate groups\n)\nin the following year. For this work he was awarded his Agrégé de l'Enseignement Supérieur in\n1951\n. This degree is similar to the German\nhabilitation\nand confers the right to lecture in universities. Garnir was made Chef de travaux at Liège in\n1950\n.\nThe authors of\n[\n1\n]\nbegin their detailed discussion of Garnir's mathematical contribution by giving the following overview:-\nHis fields of research were broad, including algebra and mathematical analysis, in particular the very active field of functional analysis, and the still booming area of partial differential equations, especially boundary value problems. Apart from his seven books, there are some fifty research papers\n(\nthat appeared in at least twenty-two different Journals or Conference Proceedings in fourteen countries\n)\n, three memoirs\n(\nranging from\n23\nto\n101\npages\n)\n, at least thirty-three seminar reports or mimeographed lecture notes\n(\ntotalling\n3\n,\n500\npages\n)\n, plus six published Conference Proceedings\n(\nabout\n1\n,\n700\npages\n)\n. ... His entire work reveals that he was a particular kind of analyst - one who derived his original experience from, and sought his goals in, the physical sciences. Even his most theoretical researches had a physical background or goal. This was perhaps one of the reasons for his great strength as a mathematician.\nAs the above quote indicates, Garnir's research interests did not remain in the area of applications of group theory. We have indicated some of his contributions up to\n1951\nand this is precisely the period in which his interests were mainly in algebra. His interest in matrices led him to work with linear algebraic inequalities which he applied to linear programming and game theory. He worked on distribution theory, publishing an important paper\nSur la transformation de Laplace des distributions\nⓉ\n(\nOn the Laplace transform of distributions\n)\n(1952)\n. In this paper he initiated the study of\nLaplace transformations\nin distribution theory. Garnir's research in this area had been strongly influenced by his visit to\nLaurent Schwartz\nin Paris. He also became interested in several different areas of analysis such as\nfunctional analysis\n, particularly the theory of locally convex spaces, and\nHilbert space\ntheory with works such as\nEspaces de Hilbert et problèmes aux limites de la physique\nⓉ\n(\nHilbert spaces and boundary value problems of physics\n)\n(1956)\n. Another of his interests was in the theory of boundary value problems for partial differential equations. In particular, he studied\nGreen\n's functions as solutions to boundary value problems for the wave and diffusion equations. He also looked at such boundary value problems in the context of distribution theory. In the later part of his career, Garnir became interested in the propagation of singularities of solutions of boundary value problems for evolution partial differential equations.\nMention of the later part of Garnir's career means that we should indicate how his career developed at the University of Liège. In\n1955\nhe became Agrégé de Faculté and three years later Chargé de cours for those students taking mathematical, physical and engineering science. He was appointed to the Chair of Mathematical Analysis and Algebra at Liège in\n1960\nand held this position until his death in\n1985\n. We should also give details some of the seven books he wrote\n(\nreferred to in the above quotation\n)\n. The first was\nLes problèmes aux limites de la physique mathématique. Introduction à leur étude générale\nⓉ\n(\nThe boundary problems of mathematical physics. Introduction to their general study\n)\n(1958)\n. A N Milgram begins a review as follows:-\nIn recent years the use of such tools as operators in\nHilbert\nand\nBanach spaces\n, the theory of distributions and other methods of functional analysis has become commonplace in investigations of problems in partial differential equations. Despite the very wide literature in this field there are but few books dealing with the subject from this point of view. The present book is designed to help fill this gap.\nHe published the two-volume book\nFonctions de variables réelles\nⓉ\n(\nFunctions of real variables\n)\n(\nvolume\n1\nin\n1963\n, volume\n2\nin\n1965)\n. The first volume is designed for a first university course in mathematical analysis. Reviewing volume\n2\n, W H Fleming writes:-\nThis book, taken together with Volume I, amounts to a rather complete 'cours d'analyse' in a modern vein. On the other hand, by a sound choice of topics and a wealth of good exercises, the classical tradition is not lost.\nWith M De Wilde and J Schmets, Garnir published the three-volume text\nAnalyse fonctionnelle\nⓉ\n(\nFunctional Analysis\n)\n. The first volume\n(\npublished in\n1968)\nstudies a constructive theory of seminormed linear spaces, the second volume\n(\npublished in\n1972)\nis concerned with a constructive theory of linear topological vector spaces. The final volume\n(\npublished in\n1973)\ngives a functional analytic treatment of a number of classes of special spaces of functions encountered in applications. The use of the words 'constructive theory' should be explained. By this the authors indicate that all three volumes present functional analysis that can be developed without the use of the\naxiom of choice\n.\nAs to Garnir's character, the authors of\n[\n1\n]\nwrite:-\nGarnir was an enthusiastically enterprising person. His dynamism, intelligently tempered by true kindness, permitted him to overcome the slowness and reticence sometimes encountered in university life. He communicated a great joy of life. It was a pleasure to sit at his table during a conference and to listen to him telling about his trips or episodes from university life; his kind cheerfulness was truly radiant. He was a man of exceptional pedagogical talents. His students were stimulated by his exemplary attitude, his scientific curiosity, the new paths of his research and the intensity of his work. He devoted his time and his experience to his students but also offered his friendship. He was attached to them and they to him. Essentially, Garnir was a man whose charisma, stability and true goodness were immensely beneficial to all who had the luck to have known him.\nGarnir was in good health and in the middle of many mathematical projects when he was struck by a heart attack from which he died. At the time, he was preparing several papers for publication and had begun writing two further books.\nFinally let we quote from\n[\n1\n]\nregarding Garnir's founding a Centre of Functional Analysis at Liège:-\nIn\n1964\n, Garnir consolidated his school at Liege by the establishment of a 'Centre of Functional Analysis of Liege' under his management and supervision .... At this Centre, at the time of his death, there were four professors, four 'chefs de travaux', three premier assistants and four assistants, as well as some five other collaborators. In early\n1973\n, when the Centre was not even nine years old and adequate financial support was not forthcoming, opinions concerning the reputation of the Centre and its research achievements were requested from many mathematicians throughout the world. Already then some fifty mathematicians generally recognised that the Centre was Belgium's best known and most reputed centre of research in mathematics. Some of them noted that the only other comparable centre in Europe was the functional analysis group at the Polish Academy of Sciences at Warsaw. Others regarded the Centre as one of the best in the world in regard to functional analysis and its applications, because of its many expert members, both very young and older, of its team work on a large scale, and of its exceptionally many, highly qualified visitors who spent a few days or longer periods at the Centre. Thus from its very beginning it was a Centre of international cooperation in the broad realms of functional analysis and partial differential equations. Several hundred foreign mathematicians must have visited and/or lectured at Liege from\n1960\nonwards."
}