{
  "nome_completo": "Herman Hollerith",
  "nome_curto": "Herman Hollerith",
  "ano_nascimento": "1860",
  "ano_morte": "1929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hollerith/",
  "lugar_nascimento": "Buffalo, New York, USA",
  "lugar_morte": "Washington D.C., USA",
  "biografia": "Herman Hollerith\n's parents were immigrants to the United States from Germany in\n1848\nafter political disturbances in that country. School was not very easy for Herman despite the fact that he was clever. Ashurst recounts\n[\n4\n]\n:-\nHerman is said to have been a bright and able child at school, but had an inability to learn spelling easily. His determined teacher made his life miserable to the extent that he used to avoid school whenever possible and run away when his teacher showed renewed effort to improve his spelling.\nThe consequence of these school problems were that Herman was eventually taken away from school and he was tutored privately at home by the family's Lutheran minister.\nHollerith entered the City College of New York in\n1875\nand he became an engineering graduate of the Columbia School of Mines in\n1879\n, obtaining a distinction in his final examinations. His undergraduate record had been outstanding and one of his teachers, Professor W P Trowbridge, was so impressed that he asked Hollerith to become his assistant.\nSo after graduating Hollerith became an assistant to Trowbridge, first at Columbia University but later he joined the US Census Bureau as a statistician when Trowbridge was appointed Chief Special Agent to the Census Bureau. This appointment was very significant because it was in solving the problems of analysing the large amounts of data generated by the\n1880\nUS census that Hollerith was led to look for ways of manipulating data mechanically. The idea in fact came from Dr John Shaw Billings who Hollerith came in contact with in his work for the US Census Bureau. Hollerith wrote much later\n(\nsee\n[\n6\n]\n)\n:-\nOne evening at Dr B's tea table he said to me 'There ought to be a machine for doing the purely mechanical work of tabulating population and similar statistics'.\nIn a slightly different version of the same story Dr Billings was reported to have said\n(\nsee for example\n[\n4\n]\n)\n:-\nThere ought to be some mechanical way of doing this job, something on the principle of the Jacquard loom, whereby holes in a card regulate the pattern to be woven.\nIn\n1882\nHollerith joined the Massachusetts Institute of Technology where he taught mechanical engineering. At this time he investigated Billings suggestion, examining the way that the Jacquard loom worked with a view to seeing if it could be used in census work. He found that in most respects the function of the Jacquard loom was too far removed from what might be useful to the census work, however he did realise that the punched cards were an efficient way to store information. Another idea struck him one day on a train journey as he watched the ticket collector punch tickets. This was an easy way to punch information onto cards.\nWhile he worked at the Massachusetts Institute of Technology Hollerith began his first experiments. These used a paper tape, rather than cards, with pins which would go through a hole in the tape and complete an electrical contact. The idea was nearly right but the tape had drawbacks since it had to stop to allow the pin to go through the hole to make the contact. Hollerith realised that cards would provide a better solution.\nHollerith did not enjoy teaching so he soon sought another job. In\n1884\nhe obtain a post in the U.S. Patent Office in Washington, D.C. This was either good luck or a brilliant career move depending on how far sighted Hollerith was in seeing that he would be in the best possible position to make full use of skills learnt in the patent office in patenting his own inventions.\nIn\n1884\nHollerith applied for his first patent\n(\nhe would receive more than\n30\npatents from the United States during his career and many overseas patents\n)\n. He developed the early work he had done at the Massachusetts Institute of Technology on methods to convert the information on punched cards into electrical impulses. These impulses in turn would activate mechanical counters. He used at first the punch that was used for tickets on the railway to make the holes in the cards. This showed that the system worked but since the punch could only make holes near the edge of the card, the full potential was not being used.\nHollerith designed punches specially made for his system, the Hollerith Electric Tabulating System. He also improved the machines which read the cards. Engineering developments improved the accuracy of the pin going through the hole in the card to make an electrical connection with mercury placed beneath. The resulting electrical current activated a mechanical counter and the amount of information which could be handled on each card rapidly increased.\nHollerith's system was first tested on tabulating mortality statistics in Baltimore, New Jersey in\n1887\nand again in New York City. This punched card system was in use by the time of the\n1890\nUS census but it was not the only system to be considered for use with the census. It won convincingly in competition with two other systems considered for the\n1890\ncensus showing that it could handle data more quickly.\nHaving won, Hollerith now had to have punches and counting devices manufactured. The punches were made by Pratt and Whitney, later famed for building engines for aircraft. The punch was constructed in a similar way to a typewriter having a simple keyboard. The counting machines were made by the Western Electric Company. Everything was in place by June\n1890\nand the first data from the census arrived in September of that year. The counting was completed by\n12\nDecember\n1890\nhaving taken about three months to process instead of the expected time of two years if counting had been done by hand. The total population of the United States in\n1890\nwas found to be\n62\n,\n622\n,\n250\n.\nSpeed was not the only benefit of using Hollerith's system. It was possible to gather more data, and data such as the number of children born in a family, the number of children still alive in a family, and the number of people who spoke English were part of the\n1890\ncensus.\nAlthough Hollerith had left the academic world, he clearly was still attracted to certain aspects of it, for he wrote up the details of his tabulating systems and submitted the work for a doctorate at the Columbia School of Mines. Hollerith was awarded his doctorate in\n1890\n.\nThe Hollerith system was clearly a great leap forward. It saved the United States\n5\nmillion dollars for the\n1890\ncensus by completing the analysis of the data in a fraction of the time it would have taken without it and with a smaller amount of manpower than would have been necessary otherwise. The system was again used for the\n1891\ncensus in Canada, Norway and Austria and later for the\n1911\nUK census.\nHonours came to Hollerith from all sides for his outstanding invention. He was awarded the prestigious Elliot Cresson Medal by the Franklin Institute of Philadelphia in\n1890\n. He received the Gold Medal of the Paris Exposition and the Bronze Medal of the World's Fair in\n1893\n. He was asked to address learned societies around the world, for example he spoke to the\nRoyal Statistical Society\nin London.\nIn\n1896\nHollerith founded the Tabulating Machine Company to exploit his inventions. By this time he had added a mechanism to feed the cards automatically and other automatic sorting procedures which added sophistication to the original simple mechanical counting process. His system was used again for the US census of\n1900\n, but by this time he was asking such a high price for the use of his technology that questions began to be asked about the wisdom of using the system. Because Hollerith had a virtual monopoly he had set the price well beyond what it would have cost to count the\n1900\ncensus data by hand.\nThe Census Bureau became a permanent institution by an Act of Congress in\n1903\nand it began to prepare for the\n1910\ncensus. The cost of using Hollerith's system in\n1900\nmade them decide to develop their own system and, despite the short time and the difficulty of getting round Hollerith's patents, they were able to have more advanced machines ready in time for the\n1910\ncensus. There is a rather strange twist to this story for the engineer who was in charge of the development of the rival machines at the Census Bureau, James Powers, was strangely allowed to patent these more advanced machines in his own name.\nPowers was now in a strong position and in\n1911\n, after the census, he left the Census Bureau and formed the Powers Tabulating Machine Company which was now more than a match for Hollerith's Tabulating Machine Company. A merger with another company saw Hollerith's company become the Computer Tabulating Recording Company in\n1911\nbut the new company largely was forced out of the market for counting machines.\nHollerith served as a consulting engineer with the Computer Tabulating Recording Company until he retired in\n1921\n. The Computer Tabulating Recording Company had recovered its leading role by\n1920\n, due not to Hollerith but to Thomas J Watson who joined the company in\n1918\n. The company was renamed International Business Machines Corporation\n(\nIBM\n)\n, in\n1924\n.\nAlthough Hollerith made a very significant contribution to the development of the modern electronic computer with his punched card technology not all his ideas were similar great successes. In the\n1880\ns, at the same time as he was developing his first punched card system, he invented a new brake system for trains. However his electrically actuated brake system lost out to the Westinghouse steam-actuated brake.\nHollerith died of a heart attack in\n1929\n, eight years after retiring."
}