{
  "nome_completo": "Herta Taussig Freitag",
  "nome_curto": "Herta Freitag",
  "ano_nascimento": "1908",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Freitag/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Roanoke, Virginia, USA",
  "biografia": "We have based the following biography of\nHerta Taussig Freitag\nmainly on references quoted below which were written after the authors had interviewed Herta, on the material supplied to us by George Phillips who was a friend of Herta's collaborating with her on at least ten papers, and on EFRs personal knowledge of her through the\nFibonacci\nconferences.\nHerta Freitag\n, only known as Freitag after her marriage, was given the name\nHerta Taussig\n. She was the daughter of Josef Heinrich Israel Taussig\n(1876\n-\n1942)\nand Paula Caroline Sara Taussig\n(1880\n-\n1967)\n. Josef had been born in Vienna on\n26\nJuly\n1876\nand Paula was born on\n1\nMay\n1880\n, also in Vienna. Herta had an older brother, Walter Adolf Taussig\n(1908\n-\n2003)\n, born in Vienna on\n9\nFebruary\n1908\n. We note that it is unusual for two siblings to have the same year of birth yet not be twins\n[\n18\n]\n:-\n[\nHerta\n]\ncredits her wonderful home life for the success that both she and her brother ultimately enjoyed. Evenings were spent with the entire family together - mother, father, brother, and Herta - each doing what they most enjoyed. Her brother Walter would be composing, her mother would be doing needlework, her father would be reading 'Die Neue Presse'\n(\nhe was managing editor of this Austrian newspaper\n)\n, and Herta would be doing mathematics.\nBefore we continue with Herta's biography, let us give some details of her brother Walter Taussig\n[\n17\n]\n:-\n[\nWalter Taussig\n]\nstudied at Music Academy in Vienna, working on harmony, composition and piano with Franz Schmidt, the composer, and conducting with Robert Heger. He also studied the oboe. ... After graduating in\n1928\n, Mr Taussig worked as a conductor and coach in a number of theatres, from Finland through Germany and even to Istanbul, but Vienna remained home base. However, the climate in the German-speaking world was not healthy for a Jewish conductor, even one who had been baptized as a Lutheran as a safeguard, and Mr Taussig ultimately crossed the Atlantic, conducting the Havana Philharmonic\n(\nwhere he was succeeded by Erich Kleiber\n)\n. He then worked at the Montreal Opera, the Chicago Opera and the San Francisco Opera. ...\nAfter\n1949\n, when he became its assistant chorus master, the Metropolitan Opera was his main employer. He went on to the post of associate conductor ... For\n18\nyears, starting in\n1964\n, he was also an assistant conductor at the Salzburg Festival, working with long-time friends and colleagues Herbert von Karajan and Karl Böhm. He was also a coach for the record company Deutsche Grammophon.\nLet us return to details of Herta Taussig's education. She began her education at a kindergarten in Vienna. In\n1921\n, when she was twelve years old she wrote in her diary\n[\n3\n]\n:-\nI have finally found a subject where I do not need to memorise, but can think things out myself - mathematics.\nA little later she wrote in her diary\n[\n16\n]\n:-\nI want to be a teacher of mathematics. I don't know whether I will be good enough.\nAfter kindergarten, she studied at a gymnasium in Vienna where mathematics was given pride of place. It was never taught as the first lesson since the pupils might by sleepy and never as the last lesson before lunch since the pupils might not concentrate enough if they were hungry. By the time she had completed her studies at the gymnasium she wrote in her diary\n[\n16\n]\n:-\nI don't want just to be a teacher of mathematics. I want to be a good teacher of mathematics.\nHerta entered the University of Vienna with the aim of training to become a teacher of mathematics at a gymnasium. She lived at home with her family and did a little mathematics tutoring to help with the family finances. She recalled in the interview on which\n[\n18\n]\nis based how she and her fellow students felt at that time:-\nWe were exceedingly idealistic at that time. We loved mathematics and were preparing for teaching at gymnasium. We all knew that the chance of obtaining a position was practically nil as Vienna was overrun with professionals, and mathematics professors were anything but in short supply, but we really wanted to teach mathematics.\nShe received the degree Magister Rerum Naturalium, in Mathematics and Physics, from the University of Vienna in\n1934\n. She impressed during teacher training and the certificate she was awarded stated\n(\nsee, for example,\n[\n18\n]\n)\n:-\nThe candidate has an extraordinary command of her language to make even complicated mathematics topics easily accessible to her students.\nHerta taught in Vienna from\n1934\nto\n1938\n, first as a student teacher for one year, then as a \"Gymnasium Professur\". Life changed for the Taussig family on\n11\nMarch\n1938\nfor on that day Hitler sent an ultimatum to the Austrian Chancellor saying that if Austrian Nazis were not immediately put in control of the country, Germany would invade. In fact, without waiting for an answer Hitler ordered his army to invade and on the morning of\n12\nMarch they crossed the border. The Germans were greeted enthusiastically by many Austrians and, on\n13\nMarch, Austria and Germany were united. Josef Taussig, as editor of\nDie Neue Frei Presse\n, had written several editorials warning of the dangers of Nazism and knew immediately that he was in great danger. Herta recalled\n[\n16\n]\n:-\nHitler took over on Friday March\n13\n. I will never forget father's toneless voice when he said to me, \"There is no Austria anymore.\" By the following Wednesday he was dismissed.\nHerta's brother was involved in a music tour of the United States at this time and was not in any danger. Herta and her parents, however, feared for their lives and decided to move immediately to a summer cottage they owned in the mountains around Vienna so they could plan their next moves. The best result for Herta, she decided, was to emigrate to the United States and continue her career as a teacher. This, however, was not easy to achieve. A sponsor in the United States was required and even when, though a friend of a friend, a surgeon in St Louis was asked and agreed to sponsor Herta, still there was a quota on numbers resulting in a long wait of an unknown length. Fearing for their safety, Herta decided to agree to travel to England where a visa could be obtained if she agreed to become a maid. This she did and shortly after this her parents were able to follow her.\nOn\n1\nSeptember\n1939\nGermany invaded Poland and on\n3\nSeptember the United Kingdom and France declared war on Germany. The Taussig family, of course, as Germans living in England were enemy aliens and, unless they could claim exemption from internment, they would be imprisoned. Josef and Paula's application to a Tribunal was decided on\n3\nOctober\n1939\n. Their nationality is given as \"German by annexation,\" their address as \"'Willow Mount', Beacon Road, Crowborough, Sussex,\" their present occupation as \"None\", and both declared they did not desire to be repatriated. The decision of the Tribunal was \"Exempted from all restrictions.\" Herta's application to the Tribunal was settled on\n18\nNovember\n1939\n. Her nationality is given as \"Austrian, German by annexation,\" her address as \"'Letmans', Jarvis Brook, Sussex,\" her normal occupation \"Teacher in Secondary School. Has title of 'Professor',\" her present occupation as \"Domestic servant employed by Miss Cicely H Washington, 'Letmans', Jarvis Brook, Sussex,\" and she declared she did not desire to be repatriated. The decision of the Tribunal was \"Exempted from all restrictions.\"\nHerta had various jobs in England over the following years, as a housemaid, governess, waitress and finally as a teacher. Her father, Josef Taussig, died in Cirencester on\n28\nNovember\n1942\n[\n18\n]\n:-\n... content in the knowledge that his family had escaped Austria and would ultimately be reunited in the United States.\nHerta and her mother eventually obtained visas for the United States and they embarked from Liverpool on the ship\nDelftdijk\non\n5\nApril\n1944\n. The crossing to New York was hazardous since the United States and Britain were still at war with Germany and German submarines threatened any ships of these countries. The\nDelftdijk\nwas part of a convoy of ninety-eight ships which included protecting navy vessels. To avoid German submarines, the convoy took a lengthy route and, as a consequence, took\n21\ndays to make the crossing. They arrived in New York on\n25\nApril, in thick fog so were not able to see the Statue of Liberty. Soon, however, they were able to disembark and were met by Herta's brother Walter.\nIt was now Herta's aim to find a teaching position and she signed up at an agency who found her a position at Greer School in Dutchess County, New York. This school, originally called Hope Farm School, had been founded in\n1906\nas a school for disadvantaged children. It had been renamed Greer School in\n1940\nfor its founder David Hummell Greer. Herta said\n[\n16\n]\n:-\nMy first teaching job in America was in Upstate New York at a school for poor children from broken homes. Naturally, I was apprehensive. Would the kids accept me? They accepted me once they discovered that I had been kicked around too.\nHer mathematics career was thus rescued, although it had been effectively suspended for six years. These years, however, she didn't consider as wasted. In the lecture\nA Last Lecture - How Kind of you to Want to Know Me\nshe said of these times\n(\nsee\n[\n3\n]\n)\n:-\nAll of this is a blessing - at least I see it this way. It has given me a greatly heightened sense of appreciation of life in my adopted land, a sharpened delight in small joys, and a deep love for all that is good in the world. And, for me, one of the best things in this world is mathematics.\nShe taught at Greer School from\n1944\nto\n1948\nand, in her second year there, she met the mathematics teacher Arthur Henry Freitag\n(1898\n-\n1978)\n, whom she married in\n1950\n. But Herta had ambitions to teach mathematics at a higher level and every summer she studied at Columbia University for her Master's Degree; she graduated M.A. in\n1948\n.\nIn\n1948\nshe moved to Hollins College\n(\nnow University\n)\n, a private college for women in Roanoke, Virginia, where she was appointed as a mathematics instructor\n[\n18\n]\n:-\nThrough great perseverance she established a mathematics department, where she was the sole member and taught seven courses in a language that was not her native tongue. At the same time she was working on a Ph.D. at Columbia.\nShe was particularly influenced at Columbia by\nEdward Kasner\nand Howard Eves\n(1911\n-\n2004)\n[\n11\n]\n:-\nThroughout life, her early \"love affair\" with mathematics kept deepening. Number theory, especially recursive sequences, continued to tighten their grip on her fascination with numbers, and with problem posing and solving. She feels deeply moved when she is called a \"problemist.\" \"I don't call myself a mathematician,\" she states, \"but rather a student of mathematics, albeit quite an addicted one.\" The happiest hours in her life have been spent \"at the feet\" of\nEdward Kasner\nand Howard Eves.\nIn\n1953\nshe was awarded a Ph.D. from Columbia University for her thesis\nThe Use of the History of Mathematics in its Teaching and Learning on the Secondary Level\n. Let us quote a few lines from the Abstract of the thesis:-\nThe fusion of the history of mathematics with its teaching and learning promises desirable outcomes for both student and teacher. Some of the possible contributions are in the nature of increasing results which may be obtained in the traditional way. Others lie in areas which cannot so readily be reached by the usual method. When mathematical ideas and the language of mathematics are studied in an evolutionary manner, better understanding may result. Meanings take on greater significance as their development shows the obstacles that had to be surmounted and as their values for human civilisation are recognised. Mathematical processes and methods are learned with more ease and greater retentivity. Awareness of mathematical situations becomes keener as understandings are deepened and interests are kindled. The interaction between mathematics and other forms of human accomplishments are seen. ...\nAt Hollins College her career progressed from instructor to full Professor and departmental chairman, until\n1971\nwhen she took early retirement to care for husband who had become ill. Her husband, Arthur Freitag, taught mathematics at the Jefferson Senior High School, Roanoke, then at the William Fleming Senior High School, Roanoke. Herta and Arthur Freitag wrote a number of joint papers. As an example we mention\nNeopythagorean triangles\n(1956)\n, and\nUsing the history of mathematics in teaching on the secondary school level\n(1957)\nwhich begins as follows:-\nMore than two thousand years ago,\nPythagoras\nlectured on the power of number, meaning only integers and fractions. He reiterated again and again, \"Number rules the universe; the essence of all things is number.\" Then one day he evaluated the diagonal of a unit-sided square. Alas, there was no number as he understood number which gave an answer.\nLegend has it that one of his grief stricken students contrary to the rules of\nPythagoras\n' esoteric school divulged this number fiasco to an outsider. The student was drowned. Students are no longer drowned for breaking the rules of a school. But to know the difference between rational and irrational numbers is as important today as it was then.\nAny educator interested in improving the teaching of mathematics must consider a more intelligent use of historical material. In ancient times, man was a local creature. During the Middle Ages he grew in social awareness and became provincial in his outlook. At the onset of modern history, nationality became his important social interest. Today not only do nearly all our problems affect the entire world, but many of them can be understood only in the light of their history. When discussing the uses of historical material in teaching secondary school mathematics, pertinent questions naturally arise. How does the knowledge and proper use of historical material aid both the teacher and learner of secondary school mathematics? Which historical approach will be most beneficial? Should the historical material be presented as part of an integrated course, or should specific units be given separately? Should it be chronological facts, as well as the biographies of the great mathematicians? And above all of these questions, do we have any valid criteria to offer as a basis of selection from these many possible approaches?\nThey also wrote the book\nThe Number Story\n(1960)\nwhich has the following Introduction:-\nDuring the sixth century B.C., the world's earliest scientific society was holding meetings in Greece.\nPythagoras\n, a pioneer in the teaching of mathematics, had founded a brotherhood of young men and women in which secrecy, magic, and religion were conglomerated with number inquiries. These inquiries laid a profound groundwork for the future development of mathematics.\nPythagoras\ndiscovered that the pitch of a note produced by a plucked string is closely related to its length; mathematics may, therefore, be used for describing musical intervals. With this insight he conjectured that mathematical language is qualified to help unravel nature's, secrets, and thus mathematical physics was born.\nThe startling discovery that revealed an interdependence between number and physical phenomena intrigued the master. He thought he had found the nucleus of man's most cherished dream - an understanding of the universe in which he lives. \"Number is a universal measure of everything,\" he reiterated, \"number rules the universe,\" \"the essence of all things is number.\"\nWhat did he mean by \"number\"? How have more than two millennia in the evolution of mathematics affected his notions? Was\nPythagoras\nright in his philosophy that number is the key for an understanding of our world?\nFor more than\n2000\nyears generations of mathematicians have endeavoured to understand numbers fully. The concept of number has been extended and mathematical reasoning has become more rigorous and generalised. Has modern man, on the basis of these developments, lost\nPythagoras\n' viewpoint?\nThe book was reviewed by Frances Flournoy in\n[\n4\n]\n. The review begins:-\nThrough the ages, man has gradually developed number ideas, he has observed, noted relationships, and endeavoured to prove conclusively the general nature of ideas developed. In this monograph, the authors have presented some of the highlights in this story of the evolution of number from the first steps taken by prehistoric man to the mathematics of our present day. The historical development of the growth of number notions in regard to natural numbers, fractions, zero, and negative numbers, irrational numbers, and complex numbers is briefly presented. The authors also give a somewhat intuitive mathematical development of this structure.\nDuring her years at Hollins College, and throughout her even longer period of retirement, she received many awards. For example, she received the first Virginia College Mathematics Teacher of the Year award in\n1980\n. In May\n1997\nshe was presented with the Humanitarian Award of the National Conference of Christians and Jews. The citation states:-\nTo have known her all these years, to have seen her joy of living expressed in so many ways, to have felt her gentle and guiding hand on the careers of so many, to have seen her look beyond hatred and see sharing, all these cannot be summarised better than to say wherever she has gone, whomever she has seen, she has left them richer and hoping to become more like her.\nShe was the first woman to become President of the Virginia, Maryland, and District of Columbia Section of the\nMathematical Association of America\n.\nHer lectures, always meticulously crafted and beautifully illustrated in her inimitably artistic calligraphy, are delivered so enthusiastically and yet so modestly, as if she fears that her personality might take any of the glory or attention away from Mathematics. One of her most inspired remarks concerns mathematicians' fondness for generalising results:-\nA mathematician is like a lover - give him a little finger and he wants the whole hand!\nA colleague, with echoes of\nGauss\n's description of Mathematics as the Queen of the Sciences, and Number Theory as the Queen of Mathematics, named Herta Freitag as the Queen of the\nFibonacci\nAssociation. For she has attended and given a paper at every International Conference of the Association since the first one in\n1984\n. She has also contributed prodigiously to the\nElementary Problems and Solutions Section\nof the\nFibonacci Quarterly\nand published many papers in that journal. For example:\nOn summations and expansions of Fibonacci numbers\n(1963)\n,\n(\nwith George M Phillips\n)\nA congruence relation for certain recursive sequences\n(1986)\n,\n(\nwith Piero Filipponi\n)\nFibonacci autocorrelation sequences\n(1994)\n, and\n(\nwith Piero Filipponi\n)\nDivision of Fibonacci numbers by k\n(1999)\n.\nMost appropriately, the\nFibonacci Quarterly\nchose to honour her not on her\n90\nth birthday, but on the threshold of her\n89\nth year, since\n89\nis a number in the\nFibonacci\nsequence. The dedication\n[\n2\n]\nmentions one of Herta's favourite stories:-\nWhen two non-mathematicians meet on the street and one says, \"I've got problems,\" the other answers, \"I'm so sorry for you.\" When two mathematicians meet and one says, \"I've got problems,\" the other says, \"Oh, goody!\"\nWe noted that Herta took early retirement in\n1971\nto care for her husband. He died in October\n1978\nand the article\n[\n16\n]\n,\nHerta Taussig to teach again\n, appeared in November. It ends as follows:-\nShe has a small apartment with a view of the Blue Ridge Mountains in a complex called Friendship Manor. \"It is a place for old fogeys,\" she said, \"politely called a retirement home.\" If Friendship Manor is for old fogeys, Herta Freitag is in the wrong place. She bought a tricycle and rides it\n10\nmiles a day. She swims two hours a day. Her step has a lilt to match her eyes, especially when they suddenly brighten, as the other day. \"I have good news,\" she said, \"I had a call from Hollins College. They asked me to come back next year to teach. Will I? Of course I will.\"\nFinally let us end by quoting Caren Diefenderfer's memories of Herta Freitag\n[\n3\n]\n:-\nOne of my favourite memories of Herta Taussig Freitag is the\n48\nhours that I spent with her and one of her college friends in Vienna during the summer of\n1980\n. When we viewed the Danube, Professor Freitag declared with joy in her eyes, \"It is only blue to those who are in love.\" We travelled to Belvedere Palace to view the painting of her relative, Tina Blau, ate fine Viennese pastries and enjoyed an even finer friendship and joy. Sharing this time with Herta in Vienna was an amazing gift and a tribute to why Hollins is special to those who have taught and studied here. Herta's portrait, a gift from the class of\n1953\nand the mathematics majors from\n1949\n-\n1976\n, greets me every day when I come to my office. The portrait serves as a reminder of our shared passions: travel, music, swimming, and most important, the joy of solving mathematics problems.\nHerta died in Roanoke at the age of\n91\n. She donated her body to medical science."
}