{
  "nome_completo": "Hieronymous Georg Zeuthen",
  "nome_curto": "Hieronymus Georg Zeuthen",
  "ano_nascimento": "1839",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zeuthen/",
  "lugar_nascimento": "Grimstrup, West Jutland, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Hieronymus Georg Zeuthen\n's father was the minister in Grimstrup where his son was born and began his education. However Zeuthen's father moved in\n1849\nfrom a church in Grimstrup to a church in Soro and at this time Zeuthen began his secondary education. After completing his schooling in Soro in\n1857\nhe entered the University of Copenhagen to study mathematics.\nAt Copenhagen Zeuthen studied a broad mathematics course attending courses on topics in both pure and applied mathematics. In\n1862\nhe graduated with a Master's degree and was awarded a scholarship to enable him to study abroad. He decided to visit Paris and there he studied geometry with\nChasles\n. This was extremely important for Zeuthen since his research areas of mathematics were firmly shaped by\nChasles\nduring this period. The first topic on which Zeuthen undertook research was enumerative geometry.\nIn\n1865\nhe submitted his doctoral dissertation on a new method to determine the characteristics of conic systems to the University of Copenhagen. Haas describes the thesis in\n[\n1\n]\n:-\nIn this work Zeuthen adhered closely to\nChasles\n's theory of the characteristics of conic systems but also presented new points of view: for the elementary systems under consideration, he first ascertained the numbers for point or line conics in order to employ them to determine the characteristics.\nUp until\n1875\nZeuthen worked almost exclusively on enumerative geometry. He was appointed as an extraordinary professor at the University of Copenhagen in\n1871\nand, in the same year, he became an editor of\nMatematisk Tidsskrift\n, a position he held for\n18\nyears. He was the secretary of the\nRoyal Danish Academy of Sciences\nfor\n39\nyears, during which time he was also a lecturer at the Polytechnic Institute. He continued teaching at the University of Copenhagen where he was promoted to ordinary professor in\n1886\n. He was twice Rector of the University.\nAfter\n1875\nZeuthen's contributions to mathematics became more varied. He began to write on mechanics and he also made significant contributions to\nalgebraic geometry\n, particularly the theory of algebraic surfaces. As we mentioned above, he developed the enumerative calculus, proposed by\nChasles\n, for counting the number of curves touching a given set of curves. The move towards rigour in geometry led to this theory being neglected for many years but recently some of the remarkable numerical results produced by it have been confirmed.\nHe was also an expert on the history of medieval mathematics and produced important studies of Greek mathematics. He wrote\n40\npapers and books on the history of mathematics, some of which have become classics. Unlike many historians of science Zeuthen explained the ancient texts in the manner of a colleague of the ancient mathematicians.\nHis historical studies covered many topics and several periods. In a major work in\n1885\nhe looked in detail at the work of\nApollonius\non conic sections and showed that\nApollonius\nused oblique coordinates. Caveing, in\n[\n3\n]\n, looks at Zeuthen's ideas on the discovery of irrational numbers. Zeuthen argued that\nPythagoras\nhimself discovered that\n2\nwas irrational when computing the diagonal of a square. The passage from\nPlato\n's\nTheaetetus\nwhere it states that\nTheodorus\nproved the irrationality of\n3\n,\n5\n, ...\n17\nwas also carefully studied by Zeuthen. He suggested that the end of\nTheodorus\n's proof somehow involved the continued fractions for\n17\nand\n19\n, a conjecture which is very much in line with modern ideas about Greek mathematics.\nZeuthen's largest historical work was published in\n1896\n. It looked in detail at the work of\nDescartes\n,\nViète\n,\nBarrow\n,\nNewton\nand\nLeibniz\nas he traced the development of algebra, analytic geometry and analysis.\nIn\n[\n7\n]\nLützen and Purkert compare the historical approaches of\nMoritz Cantor\nand Zeuthen. They write:-\nMoritz Cantor\nand Hieronymus Georg Zeuthen were probably the two most outstanding historians of mathematics at the end of the\n19\nth\ncentury. However, their methods of work differed strikingly.\nMoritz Cantor\nwas an encyclopaedist who ... followed the development of mathematics in a survey of an almost innumerable collection of original and secondary sources from antiquity to the end of the\n18\nth\ncentury. ... Zeuthen's papers and books, on the other hand, present deep mathematical analyses of the methods found in classical works mostly from antiquity and from the\n16\nth\nand\n17\nth\ncenturies in an attempt to capture their fundamental ideas.\nKleiman gives an interesting biography of Zeuthen in\n[\n6\n]\n. This indicates that:-\n[\nZeuthen\n]\nwas in many ways a leading light of the burgeoning intellectual life of his country, and with a selfless and generous disposition he seems happily to deserve\nCoolidge\n's epithet of the \"ever kindly\".\nFinally we quote Hass's comments in\n[\n1\n]\non Zeuthen's style. He writes:-\nZeuthen saw things intuitively: he constantly strove to attain an overall conception that would embrace the details of the subject under investigation and afford a way of seizing their significance. This approach characterised his historical research equally with his work on enumerative methods in geometry."
}