{
  "nome_completo": "Hilda Phoebe Hudson",
  "nome_curto": "Hilda Hudson",
  "ano_nascimento": "1881",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hudson/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "London, England",
  "biografia": "Hilda Hudson\nwas born into a family with great mathematical talents. Her father was William Henry Hoar Hudson\n(11\nDecember\n1838\n-\n21\nSeptember\n1915)\nwho had been educated at King's College London and St John's College, Cambridge. In\n1862\nhe was appointed a Mathematical Lecturer at St Catherine's College, Cambridge and later at St John's College, Cambridge where he taught from\n1869\nto\n1881\n. He was in his final year of holding the mathematics lectureship at St John's College when his daughter Hilda Phoebe Hudson was born and shortly after the family moved to London. William Hudson was appointed Professor of Mathematics at King's College London in\n1882\nholding the post until\n1903\n. During this same period he was also Professor of Mathematics at Queen's College, London, holding this post until\n1905\n. While he held these posts he published works such as\nNotes on the first principles of dynamics\n(1884)\n;\nOn the teaching of elementary algebra\n(1886)\n; and\nOn the teaching of Mathematics\n(1893)\n.\nHilda's mother was also a mathematician who had read mathematics at Newnham College, Cambridge, so perhaps it was not entirely surprising that William and his wife should have had children with outstanding mathematical talents who went on to study mathematics at Cambridge. Hilda had an older brother, R W H T Hudson, who was Senior\nWrangler\nin the Mathematical Tripos at Cambridge in\n1898\nwhile her sister was bracketed with the\n8\nth\nWrangler in the Mathematical Tripos of\n1900\n. At this time only the men were ranked in the Tripos Examination but women who took the examination were made aware of their place by being told they were placed between the\nn\nn\nn\nth and\n(\nn\n+\n1\n)\n(n+1)\n(\nn\n+\n1\n)\nst man or equal to the\nn\nn\nn\nth man. The fact that Hilda's sister was bracketed with the\n8\nth Wrangler meaning that she had come\n8\nth equal among the First Class students.\nHilda entered Newnham College, Cambridge in\n1900\n, the year in which her sister sat the mathematical Tripos. In the examinations of\n1903\nshe went one place better than her sister when she was bracketed with the\n7\nth Wrangler meaning that she had come\n7\nth equal among the First Class students but, as was still the custom, her achievement was still not officially classed. In the following year,\n1904\n, there was tragedy for the Hudson family when Hilda's brother died in a mountaineering accident in Wales. This cut short what had promised to be a stunning mathematical career with his brilliant book\nKummer's quartic surface\nbeing published by Cambridge University Press in the year of his death.\nAfter leaving Cambridge, Hilda Hudson went to Germany for a year spending the time studying at the University of Berlin with\nSchwarz\n,\nSchottky\n,\nEdmund Landau\nand others. She returned to Cambridge in\n1905\nwhen she was appointed as a lecturer at Newnham College. After holding this position for five years she was appointed Associate Research Fellow at Newnham. In\n1912\nthe International Congress of Mathematicians was held in Cambridge, England. In the list of participants Hilda Hudson is listed as accompanying her father Professor W H H Hudson, but in fact she gave a communication to the Congress, being the only woman to do so.\nHudson was Associate Research Fellow at Newnham College until the end of the academic year\n1912\n-\n1913\n, but she spent this last academic year at Bryn Mawr College, a private women's college founded in\n1885\nin Pennsylvania in the United States.\nCharlotte Angas Scott\n, who had studied under\nCayley\nand shared Hudson's interests in\nalgebraic geometry\n, was Head of the Mathematics department there. It was a remarkably productive period for Hudson who published her first paper in the\nProceedings of the London Mathematical Society\nin\n1911\n, followed by three papers in\n1912\n, and six papers on topics such as\nCremona\ntransformations, nodal curves, pinch-points, and algebraic surfaces in\n1913\n.\nAfter spending the academic year\n1912\n-\n13\nat Bryn Mawr, Hudson returned to England. She was appointed as a lecturer at West Ham Technical Institute where she worked for four years. One interesting monograph which she published during this time was\nRuler and Compass\nin\n1916\n. This was a work\n[\n1\n]\n:-\n... in which\n[\nHudson\n]\nincluded a lot of elegant geometry in an exposition of the range and limitations of ruler and compass constructions.\nOf course World War I started while during her years at West Ham Technical Institute and, while the War was still underway, Hudson joined the Civil Service to undertake work for the Air Ministry. At this point she showed her versatility as a mathematician working on applied mathematics problems. Already while at West Ham Institute she had worked on applied probability problems, and now while working for the Air Ministry she published two papers in\n1920\n, one on\nThe strength of lateral loaded struts\nin\nThe Aeroplane\n, the other on\nIncidence wires\nin the\nAeronautical Journal\n.\nIn\n1919\n, after the war had ended, Hudson was appointed as a technical assistant at Parnell and Company in Bristol. After two years she retired from this position to devote herself to writing the treatise\nCremona transformations in plane and space\nwhich was published in\n1927\n. She dedicated this work to her brother who had been so tragically killed in\n1904\n.\nSemple\ndescribes this book in the following terms\n[\n1\n]\n:-\nThis was indeed her magnum opus, the culminating achievement of many years of scholarly research, in which she gathered into one connected account all the essential elements of what had long been a fashionable field of research and supplemented it with an impressive bibliography\n(37\npages and\n417\nitems\n)\ncovering sixty to seventy years of publications on the subject.\nDuring the years in which she was writing her major treatise Hudson returned to publishing on\nCremona\ntransformations and algebraic surfaces. However she essentially gave up publishing mathematics after her treatise appeared in print, except for one notable exception which was an article on\nAnalytic geometry, curve and surface\nin the\n14\nth\nedition of Encyclopaedia Britannica published in\n1929\n.\nSemple\nwrites\n[\n1\n]\n:-\nMiss Hudson was a distinguished mathematician, of great erudition and integrity; and she was also, throughout her long life, a woman of high ideals and standards. She will long be remembered by the mathematical world for her contributions to geometry and by Newnham and Cambridge as one of their distinguished alumni.\nShe received a number of very significant honours for her outstanding contributions including a Sc.D. from Trinity College Dublin in\n1913\nand an O.B.E. in\n1919\n."
}