{
  "nome_completo": "Horace Yomishi Mochizuki",
  "nome_curto": "Horace Mochizuki",
  "ano_nascimento": "1937",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mochizuki/",
  "lugar_nascimento": null,
  "lugar_morte": "Santa Barbara, California, USA",
  "biografia": "Horace Mochizuki\n's father was Edward Mochizuki. Horace was brought up on a farm in the Great Central Valley, in California, U.S.A. Horace was only four years old when over\n180\nJapanese aircraft attacked Pearl Harbour on\n7\nDecember\n1941\n. The United States then entered World War II and the immediate consequence for the Mochizuki family was that, as United States citizens of Japanese ancestry, they were interned. When the war ended Horace was eight years old and for a short while the family lived in New York. However they soon returned to the farm near Madera, California.\nMochizuki was very musical and while at high school he also attended the Music Academy of the West in Santa Barbara where he played the violin. After graduating from high school he entered the University of Redlands in Redlands, San Bernardino county, southern California. After graduating with a B.A. he went to University of Washington where he studied ring theory for his doctorate under the supervision of James P Jans. He received his Ph.D. in\n1963\nfor his thesis\nFinitistic homological dimensions and duality theory for rings\n. Appointed to the University of California at Berkeley in\n1963\nhe spent two years there undertaking postgraduate work before being appointed to University of California at Santa Barbara in\n1965\n.\nMochizuki's first three papers were on ring theory.\nFinitistic global dimension for rings\nwas published in the\nPacific Journal of Mathematics\nin\n1965\n. In the same year\nOn the double commutator algebra of QF-\n3\nalgebras\nwas published and in the following year\nA characterization of QF-\n3\nrings\nappeared written jointly with L E T Wu and his former doctoral supervisor James P Jans. For anyone interested let us record that a\nQ\nF\nQF\nQ\nF\n-\n3\nring is defined as a ring\nR\nR\nR\nwhich, considered as a left\nR\nR\nR\n-module, can be imbedded in a projective injective left\nR\nR\nR\n-module Q. When Mochizuki arrived in Santa Barbara he soon met another young mathematician Seymour Bachmuth and in December\n1965\nthey began a collaboration. From this time on Mochizuki contributed to the theory of groups. Bachmuth writes\n[\n1\n]\n:-\nIn many of Horace's papers one finds theorems or crucial computations in rings be they group rings,\nLie\nrings, polynomial rings, matrix rings, rings of characteristic zero, rings of prime characteristic, rings of one sort or another. But apart from his thesis and first three papers, most, if not all, were motivated and established to prove results about groups.\nAfter beginning his collaboration with Seymour Bachmuth their first papers together were\nCyclotomic ideals in group rings\n(1966)\nand\nAutomorphisms of a class of metabelian groups\nII\n(1967)\n. This last paper is typical of the interplay between rings and groups to which Bachmuth referred in the above quote, for in it the units of the group rings of free abelian groups of finite rank over the integers modulo m are completely described and then used as a tool to obtain results on the automorphism group of the free metabelian group with derived group of exponent\nm\nm\nm\n.\nMochizuki's work on\nBurnside\ngroups received special recognition when he received a special award from the National Science Foundation for:-\n... projects of high scientific merit involving scientists with a record of outstanding research accomplishments ...\nWe should make special mention of Mochizuki's paper\nUnipotent matrix groups over division rings\n(1978)\nwhere he presented a non-commutative version of \"Kolchin's Theorem\" which solved a famous problem of\nKaplansky\n. Perhaps his most famous work, however, was on automorphism groups. He visited the University of St Andrews in\n1981\nfor the first of the four-yearly International Groups St Andrews meetings. This was when I\n[\nEFR\n]\nmet Horace for the first time. He gave an outstanding lecture at the conference and he wrote\n(\njointly with Seymour Bachmuth\n)\na survey paper for the conference proceedings. Four years later Mochizuki did not attend the Groups St Andrews conference but contributed an important survey paper\nAutomorphisms of solvable groups II\n. This paper presented a thorough survey of results concentrating on the automorphism groups of free soluble groups. He was an invited speaker for the Groups St Andrews\n1989\nconference but sadly became ill in March of that year. The paper\n[\n1\n]\nis a record of the memorial lecture given by Bachmuth at that conference reviewing the outstanding contribution made by Mochizuki. It was a highly emotional occasion with many of us greatly affected by the loss of our friend and colleague.\nSeymour Bachmuth, Kenneth Millett, and James Robertson in an obituary, describe the contributions of their colleague at Santa Barbara:-\nHorace was one of the most unselfish and valued members of the Mathematics Department at Santa Barbara. He was recently vice chair of the department, an extremely time consuming task, for a four-year period. The junior faculty especially appreciated Horace's advice and encouragement. He was also an excellent teacher who gave very generously of his time to students. Horace loved teaching and doing mathematical research and felt fortunate to be able to do these things.\nThey also write of his interests outside mathematics:-\nHorace was devoted to his garden, which became a vivid expression of his love of beauty. He also enjoyed athletic activities such as mountain hiking and swimming. In Santa Barbara he took up running and enjoyed competing in marathons and other long-distance races.\nThe obituary ends with this tribute:-\nHis friends and colleagues cherish Horace for his warmth and humanity. His inner strength formed the basis of his extraordinary personal integrity. He asked total honesty of himself and of his students, his colleagues, and others. He treated others with the same respect and consideration that he desired for himself. The faithfulness of his friendship leaves an enduring legacy in the lives of those who knew him. The loss to all who knew him is indescribable."
}