{
  "nome_completo": "Hugo Dyonizy Steinhaus",
  "nome_curto": "Hugo Steinhaus",
  "ano_nascimento": "1887",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Steinhaus/",
  "lugar_nascimento": "Jasło, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Wrocław, Poland",
  "biografia": "Hugo Steinhaus\nwas born in Galicia into a Polish family of Jewish intellectuals. The town of his birth, Jasło, was in Galicia, about half way between Kraków and Lemberg\n(\nalso known as Lwów but now called Lviv\n)\n(\nalthough a bit nearer Kraków than Lwów\n)\n. Galicia was attached to Austria in the\n1772\npartition of Poland. However, by the time Steinhaus was born in Jasło, Austria had named the region the Kingdom of Galicia and Lodomeria and given it a large degree of administrative autonomy. Hugo's parents were Bogusław Steinhaus\n(1854\n-\n1933)\nand Ewelina Lipszyc\n(1855\n-\n1948)\n. Bogusław, who had a store and traded in tobacco and tobacco products, married Ewelina in\n1880\n. They had four children: Felicja Steinhaus\n(1881\n-\n1964)\n; Hugo Steinhaus\n(1887\n-\n1972)\n, the subject of this biography; Irena Steinhaus\n(1889\n-\n1982)\n; and Olga Maria Steinhaus\n(1892\n-\n1962)\n. Their house in Jasło had been part of a monastery which the family had acquired in\n1853\n. Part of the same complex was a grocery store with wines, alcoholic drinks and liqueurs established by Hugo's grandfather Józef. Hugo described his father as follows\n[\n39\n]\n:-\nFather laughed readily, loved life, loved his home and family, good food and drink, good company, his fields and gardens, his brickworks, and the horses in his stable. He believed that greed and ambition, excessive zeal and social climbing are just as much obstacles to happiness as idleness, prodigality, incompetence, and readiness to associate with just anybody. He enjoyed good weather, a well-constructed building, or a beautiful apple tree in the garden more than a big bank account.\nSteinhaus's uncle, Ignacy Steinhaus\n(1860\n-\n1928)\n, was an important person being a politician in the Austrian parliament. He had a very different personality to Hugo's father, and played a large part in his young years.\nWhen Hugo was seven years old and still had not started school, his father gave up his store and began working in the building trade. Soon after Hugo began his schooling in the county school, situated on an upper floor above a jail. At age nine he entered the local Gymnasium and began learning Latin and German. He wrote\n[\n39\n]\n:-\nLearning was treated as a serious business in the school. History caused me considerable difficulties because I could not learn facts by heart and couldn't think of a better way of mastering the subject.\nWhen he was twelve years old he contracted whooping cough and was sent to live with his aunt in Kołobrzeg on the Baltic coast. Seeing the sea or the first time was an amazing experience. He returned home to Jasło but developed large red blotches on his calf and had to stay in bed for nearly three months; he was very bored. His parents employed a nanny to look after their children and, after two attempts which were not successful, they employed a French girl from Lyon who did very well for the children and taught them much.\nHugo graduated from the Junior Gymnasium to the Senior Gymnasium and soon after this his eldest sister got married. He began to consider what career he should follow and at first thought of an army career, but his maternal grandfather was an ardent pacifist who soon persuaded Hugo to give up that idea. He explains in\n[\n39\n]\nhow he decided to become a mathematician:-\nAmong my Father's acquaintances was a young engineer named Ludwik Silberman, who, in addition to qualifying in engineering at the Polytechnic, had also completed the mathematics programme of the philosophical faculty of the university. When, at the first opportunity, I asked him where one might learn more mathematics, he told me that the university was the place for it. It was then that I made my decision.\nOf course, Steinhaus was studying mathematics at school but he decided to learn more working on his own. He read Placyd Dziwinski's\nLectures on Mathematics\naimed at students at Lwów Polytechnic, Franz Vendt's book on differential and integral calculus, and Adam von Burg's book on analysis aimed at students at the University of Vienna. He was now approaching the time to take the\nMatura\nexaminations in May\n1905\n. He sat written examinations in mathematics, physics, Polish, German, Latin, Greek, and history. Because these written papers were of a high standard, he avoided oral examinations in mathematics, physics and history but had orals in the other topics. Now accepted by Lwów University, Steinhaus had five months vacation before beginning his university studies. He went on an expedition to the Tatra Mountains.\nAccommodation in Lwów proved easy to arrange since his cousin Dyk was already there studying law. Steinhaus lived with Dyk in the flat rented by Dyk's widowed mother. He writes in\n[\n39\n]\n:-\nWe were lectured on mathematics by\nJózef Puzyna\nwho had been a student of\nFuchs\nin Berlin - too bad he hadn't studied there earlier when\nWeierstrass\nwas in Berlin! ... I also took courses on philosophy and social sciences.\nSteinhaus was enjoying his studies in Lwów when in spring\n1906\n, Stanisław Jolles, professor of descriptive geometry at the Charlottenburg Polytechnic in Berlin, arrived in Lwów. Jolles had not come to visit the University but rather he was accompanying his wife who was on a business trip to factories she owned nearby. Professor Jolles' wife knew the mother of Hugo Steinhaus's cousin and came on a visit with her husband to the flat where Dyk and Hugo were living. On hearing that Steinhaus wanted to be a mathematician, Jolles said forcibly to him, \"Young man, pack your trunk and go to Göttingen.\" At the end of the academic year\n1905\n-\n06\n, Steinhaus returned to his parent's home in Jasło and told them about Jolles' \"order.\" Steinhaus's father was not keen that his son should go to Göttingen but his mother fully supported the idea. It was easily arranged that he would continue his mathematical studies at Göttingen beginning in the autumn of\n1906\n.\nIn good time for the start of the term, Steinhaus travelled to Göttingen via Wrocław, Berlin, Halle and Eichenberg. The university supplied him with a list of boarding houses and he took a room with board close to the University. At this time there were around\n2000\nstudents at the university; about\n400\nof whom were foreign. He spent five years studying mathematics at the University of Göttingen where he was influenced by an amazingly strong group of mathematicians including\nFelix Bernstein\n,\nCarathéodory\n,\nCourant\n,\nHerglotz\n,\nHilbert\n,\nKlein\n,\nKoebe\n,\nEdmund Landau\n(\nalthough he only arrived in Göttingen after Steinhaus had been there three years\n)\n,\nRunge\n,\nToeplitz\n, and\nZermelo\n. His social life was around visits to the café National and he went twice a week to the municipal swimming pool. His academic life centred round the mathematics library.\nAlthough he had studied philosophy as a minor subject at Lwów, he decided not to take philosophy courses at Göttingen but rather to take applied mathematics as his minor subject\n[\n39\n]\n:-\nThis included such topics as mechanics, analytic geometry, graphical statistics, numerical analysis, and geodesy. Thus I diligently attended classes at the Institute of Applied Mathematics on Prinzenstrasse, made drawings, and, under Emil Wiechert's guidance, took measurements of polygons on the city streets with a theodolite.\nFor his doctorate Steinhaus studied under\nHilbert\n's supervision. He was awarded his doctorate, with distinction, for a dissertation\nNeue Anwendungen des Dirichlet'schen Prinzips\nⓉ\n(\nNew applications of the Dirichlet principle\n)\nin\n1911\n. After the award of his doctorate\n[\n55\n]\n:-\nHe returned to Galicia, and being without an academic post, he spent the period of\n1911\n-\n1914\nas a \"private scholar\"\n(\nto use Steinhaus's own term\n)\ntravelling between Jasło and Kraków. At that time, he published a few works, played tennis and rowed on the Vistula river. He also travelled to Italy and France.\nThe main influence on the direction that Steinhaus's research would take was, rather surprisingly, none of the major mathematical figures at Göttingen but rather the influence came from\nLebesgue\n. Steinhaus studied\nLebesgue\n's two major books\nLeçons sur l'intégration et la recherche des fonctions primitives\nⓉ\n(\nLectures on integration and the search for primitive functions\n)\n(1904)\nand\nLeçons sur les séries trigonmétriques\nⓉ\n(\nLectures on trigonometric series\n)\n(1906)\naround\n1912\nafter completing his doctorate.\nIn\n1914\nWorld War I broke out and Steinhaus went with his family to live in Vienna. He undertook military service in the Polish Legion and was involved in the Volhynia campaign as a gun crew commander in the\n1\nst Regiment of Legionary Artillery. Following his discharge, he lived in Kraków. He relates in\n[\n41\n]\nhow, despite the war, it was safe to walk in the Planty Gardens in Kraków in\n1916\n:-\nDuring one such walk I overheard the words \"Lebesgue measure\". I approached the park bench and introduced myself to the two young apprentices of mathematics. They told me they had another companion by the name of\nWitold Wilkosz\n, whom they extravagantly praised. The youngsters were\nStefan Banach\nand\nOtto Nikodym\n. From then on we would meet on a regular basis, and ... we decided to establish a mathematical society.\nThe mathematical society which Steinhaus proposed was started as the Mathematical Society of Kraków and, shortly after the war ended, it became the\nPolish Mathematical Society\n. Steinhaus described the beginnings of the new mathematical society in\n[\n41\n]\nin a passage which tells us quite a lot about his life in Kraków at the time:-\nAs initiator of the idea, I made my room available for meetings and, as the first step in preparations, nailed an oilcloth blackboard to the wall. When the French manager of the boarding house saw what I had done, she was terrified - what was the proprietor going to say? I calmed her down reminding her that the owner of the building was my uncle's brother-in-law, and she forgave my transgression. However, I had made a mistake. Mr L took the position of a traditional, hard-nosed landlord and was unmoved by the lofty goal the blackboard was supposed to serve. The society expanded - it was the first ray of light of this kind in Poland.\nAlso at this time Steinhaus started a collaboration with\nBanach\nand their first joint work\nSur la convergence en moyenne de séries de Fourier\nⓉ\n(\nOn the convergence on average of Fourier series\n)\n(1918)\nwas completed in\n1916\n. He married Stefania Szmosz\n(1896\n-\n1983)\n, the daughter of the railway engineer Marek Szmosz and his wife Pepka Grünwald. Stefania had been born in Kraków on\n2\nMay\n1896\n. Hugo and Stefania Steinhaus had a daughter Lidka Joanna Steinhaus\n(1919\n-\n2000)\nwho was born in Lwów on\n6\nApril\n1919\n.\nSteinhaus took up an appointment as an assistant at the Jan Kazimierz University in Lwów\n(\nas Lemberg University had become\n)\nand, around\n1920\n, he was promoted to Extraordinary Professor. Banach was by this time on the staff at Lwów and the school rapidly grew in importance.\nKac\n, who was a student of Steinhaus in Lwów during the\n1930\ns, described the influence of\nLebesgue\n's work on the Lwów school:-\nThe influence of\nLebesgue\non the Lwów school was very direct. The school, founded ... by Steinhaus and\nBanach\n, concentrated mainly on functional analysis and its diverse applications, the general theory of orthogonal series, and probability theory. There is no doubt that none of these theories would have achieved today's level of prominence without an essential understanding of the\nLebesgue\nmeasure and integral. On the other hand, the ideas of\nLebesgue\nmeasure and integral found their most striking and fruitful applications there in Lwów.\nSteinhaus was the main figure in the Lwów School up till\n1941\n. In\n1923\nhe published in\nFundamenta Mathematicae\nthe first rigorous account of the theory of tossing coins based on measure theory. In\n1925\nhe was the first to define and discuss the concept of strategy in game theory. Steinhaus published his second joint paper with\nBanach\nin\n1927\nSur le principe de la condensation des singularités\nⓉ\n(\nOn the principle of condensation of singularities\n)\n. In\n1929\n, together with Banach, he started a new journal\nStudia Mathematica\nand Steinhaus and\nBanach\nbecame the first editors. The editorial policy was:-\n... to focus on research in functional analysis and related topics.\nAnother important publishing venture in which Steinhaus was involved, begun in\n1931\n, was a new series of\nMathematical Monographs\n. The series was set up under the editorship of Steinhaus and\nBanach\nfrom Lwów and\nKnaster\n,\nKuratowski\n,\nMazurkiewicz\n, and\nSierpinski\nfrom Warsaw. An important contribution to the series was a volume written by Steinhaus jointly with\nKaczmarz\nin\n1937\n,\nThe theory of orthogonal series\n. For more information about this book, see\nTHIS LINK\n.\nSteinhaus is best known for his book\nMathematical Snapshots\nwritten in\n1937\n.\nKac\n, writing in\n[\n17\n]\nsays:-\n... to understand and appreciate Steinhaus's mathematical style, one must read\n(\nor rather look at\n)\nsnapshots. ... designed to appeal to \"the scientist in the child and the child in the scientist\" ... it expresses, not always explicitly and at times even unconsciously, what Steinhaus thought mathematics is and should be. To Steinhaus mathematics was a mirror of reality and life much in the same way as poetry is a mirror, and he liked to \"play\" with numbers, sets, and curves, the way a poet plays with words, phrases, and sounds.\nFor much more information about\nMathematical Snapshots\n, see\nTHIS LINK\n.\nStark\n[\n38\n]\ndescribes Steinhaus lectures in Lwów:-\nMy class was guided by Professor Steinhaus. It was a very big class, and the analysis lecture was attended by over\n220\nstudents squeezed into a smallish and poorly ventilated lecture room, standing in the aisles, and sitting on the window sills. ... His figure, perched high on the podium by a small five by five foot blackboard dominated the crowded room. ... despite Steinhaus's attention to preparation, the lectures were too difficult for the average student.\nThe mathematicians of the Lwów school did a great deal of mathematical research in the cafés of Lwów. The Scottish Café was the most popular with the mathematicians in general but not with Steinhaus who\n(\naccording to\nUlam\n)\n:-\n... usually frequented a more genteel tea shop that boasted the best pastry in Poland.\nThis was Ludwik Zalewski's Confectionery at\n22\nAkademicka Street. It was in the Scottish Café, however, that the famous\nScottish Book\nconsisting of open questions posed by the mathematicians working there came into being. Steinhaus, who sometimes joined his colleagues in the Scottish Café, contributed ten problems to the book, including the final one written on\n31\nMay\n1941\nonly days before the Nazi troops entered the town.\nYou can see more about the Scottish Café at\nTHIS LINK\n.\nWhen the prospect of war was looming in\n1938\n, Steinhaus proposed\nLebesgue\nfor an honorary degree from Lwów. Steinhaus joked to\nKac\nthat\n[\n17\n]\n:-\nIt will not be a bad record to leave behind, to have had Banach as the first and\nLebesgue\nas the last doctoral candidate.\nThe reception for\nLebesgue\n, after the award of his degree, was held in the Scottish Café but only fifteen mathematicians attended, showing that the school of mathematics in Lwów had shrunk considerably due to the political situation. He writes in\n[\n39\n]\n:-\nAt three in the morning on Sunday\n22\nJune\n1941\n, I was awoken by the droning of a great fleet of planes. I looked out of the window and saw in the grey light of early dawn a pink sky over the whole of which white puffs of smoke were bursting intermittently. These were exploding shells from Soviet batteries. Down in the street I saw a squadron of Soviet soldiers running by in formation - and not singing! All this was more than enough to convince me that war had indeed broken out. I woke my wife to tell her the ghastly news. Of course, we didn't doubt for an instant that the Germans would take Lwów.\nJews were soon in great danger:-\n... all those arrested in the last few days had been summarily executed before the Soviets' departure. ... The Germans immediately issued a press release stating that there were no Jews among the victims, and the murderers had been Jews ... Within the space of a few days some\n3000\nJews had perished in and around Lwów. ... The Germans took no part in the massacre, considering that the spontaneity of the treatment meted out to the Jews by ordinary people served to confirm before the world the nationalist-socialist thesis of Jewish guilt for unspeakable crimes.\nAfter being interrogated and assaulted by SS men, Steinhaus and his wife left their home in Lwów through a hole they had made in their back garden fence on\n4\nJuly\n1941\n. This was their last day at their home for they spent the war years from then hiding from the Nazis, suffering great hardships, going hungry most of the time but Steinhaus was always thinking about mathematics\n[\n17\n]\n:-\n... even then his sharp restless mind was at work on a multitude of ideas and projects.\nContinually moving to different houses in Lwów, sometimes separating, they were helped by some friends but others refused. With fake birth certificates claiming they were Greek Orthodox, they left Lwów in November\n1941\nand went to Rudno. They survived since they were very careful to cover their tracks, and leave false leads. On\n11\nJuly\n1942\nthey moved again, this time to Stróze. Reading Steinhaus's wartime experiences in\n[\n39\n]\ngives a vivid account of the terror he, and other Jews, suffered at this time. Steinhaus was able to give private teaching at times, but this carried extra danger. The terror only ended when the war ended.\nIn\n1945\nSteinhaus went to Kraków and while there accepted an offer of a professorship at the University of Wrocław where he had the task of organising a Department of Mathematics and Natural Science. Over the following years he made many visits to universities in the United States including Notre Dame.\nKac\nin\n[\n17\n]\nwrites:-\n... it was he who, perhaps more than any other individual, helped to raise Polish mathematics from the ashes to which it had been reduced by the Second World War to the position of new strength and respect which it now occupies.\nAfter the end of World War II the\nScottish Book\n, which seems to have been preserved through the war by Steinhaus, was sent by him to\nUlam\nin the United States. The book was translated into English by\nUlam\nand published. Steinhaus, now in the University of Wrocław, decided that the tradition of the\nScottish Book\nwas too good to end. In\n1946\nhe extended the tradition to Wrocław starting the\nNew Scottish Book\n.\nLet us finally examine some of Steinhaus's mathematical contributions which we have not mentioned above. In\n1944\nSteinhaus proposed the problem of dividing a cake into\nn\nn\nn\npieces so that it is proportional\n(\neach person is satisfied with their share\n)\nand envy free\n(\neach person is satisfied nobody is receiving more than a fair share\n)\n. For\nn\n=\n2\nn = 2\nn\n=\n2\nthe problem is trivial, one person cuts the cake, the other chooses their piece. Steinhaus found a proportional but not envy free solution for\nn\n=\n3\nn = 3\nn\n=\n3\n. An envy free solution to Steinhaus's problem for\nn\n=\n3\nn = 3\nn\n=\n3\nwas found in\n1962\nby\nJohn H Conway\nand, independently, by John Selfridge. For general\nn\nn\nn\nthe problem was solved by Steven Brams and Alan Taylor in\n1995\n.\nSteinhaus's bibliography, see\n[\n22\n]\n, contains\n170\narticles. He did important work on functional analysis, but he himself described his greatest discovery in this area as\nStefan Banach\n. Some of Steinhaus's early work was on trigonometric series. He was the first to give some examples which would lead to marked progress in the subject. He gave an example of a trigonometric series which diverged at every point, yet its coefficients tended to zero. He also gave an example of a trigonometric series which converged in one interval but diverged in a second interval.\nAs we have noted above, other contributions by Steinhaus were on orthogonal series, probability theory, real functions and their applications. In particular he is associated with the theory of independent functions, arising from his work in probability theory, and he was the first to make precise the concepts of \"independent\" and \"uniformly distributed\". He gave applications of\nBayes\n' principle in\nProbability, verisimilitude, credibility\n(\nPolish\n)\n(1954)\n. He had earlier defended\nBayes\n' principle writing\nQuality control by sampling\n(\na plea for Bayes' rule\n)\n(1951)\n. Bernard Koopman writes in a review:-\nThe author examines briefly some examples of modern statistical methods of quality control and their refinements by sequential analysis, and gives two accounts of them: in terms of the\nBayes\n' notion of a priori probability, and in terms of the present fashion of repudiating such a notion. He shows some superiorities of the former approach, and emphasizes his view that the second avoids\nBayes\n' notion in appearance only. He concludes by attempting an answer to a well-known objection to the assumption of uniform a priori distribution of the parameter α to be estimated\n(\nthe objection, namely, that\nα\n2\n\\alpha^{2}\nα\n2\nor some other function β of\nα\n\\alpha\nα\nwill then not be uniformly distributed\n)\n. His answer is that for quality control\nα\n\\alpha\nα\nis just one thing, the proportion of good items in the population; this is the variable which\n(\napparently by convention\n)\nmust be taken as uniformly distributed, not\nβ\n\\beta\nβ\n.\nHe made contributions to the theory of games, for example in the paper\nMeasurement by successive comparison\n(\nPolish\n)\n(1958)\nwritten in collaboration with Stanisław Trybuła.\nIn addition to his famous book\nMathematical Snapshots\nhe also wrote the highly acclaimed\nOne Hundred Problems\nin elementary mathematics\n. For information on these books, see\nTHIS LINK\n.\nSteinhaus played a major role in supporting mathematics in Poland\n[\n55\n]\n:-\nHe was the president of the Lwów Branch of the\nPolish Mathematical Society\nand the Wrocław Branch of that society in the\n1937\n-\n1938\nand\n1946\n-\n1948\nterms respectively, and also the vice-president of the society. He was a corresponding member of the Polish Academy of Learning\n(\nelected in\n1945)\n. He was also among the founders of the Wrocław Scientific Society, which was established in\n1946\n, its secretary general until\n1947\n, and its president in\n1956\n-\n1958\n. He also took part in organising the State Mathematical Institute\n(\nestablished in\n1947\n-\n1948\n, later transformed into the Institute of Mathematics of the\nPolish Academy of Sciences\n)\n, was its vice-director until\n1952\n, and later the head of the Department of Natural and Economic Applications. He was the chairman of the Commission of Anthropometry of the\nPolish Academy of Sciences\n. Since\n1951\n, he was an ordinary member of the\nWarsaw Scientific Society\n, and since\n1951\n, a full member of the\nPolish Academy of Sciences\n. He participated in the foundation of the Wrocław-based periodical \"Colloquium Mathematicum\"\n(\npublished since\n1947)\n, in\n1948\n, he re-established the previously Lwów-based \"Studia Mathematica\", and in\n1953\n, he founded \"Zastosowania Matematyki\" in Wrocław\n(\nnow titled \"Applicationes Mathematicae\"\n)\n.\nHe received many awards and we list only a few. The\nPolish Mathematical Society\nawarded him the\nStefan Banach\nAward\n(1946)\nand the\nStefan Mazurkiewicz\nAward\n(1951)\n. He received the Award of the Polish Academy of Learning\n(1948)\n, the First Degree State Award\n(1951)\n, the City of Wrocław Award\n(1960)\n, and the Alfred Jurzykowski Award. He received honorary doctorates from the universities of Warsaw, Poznan and Wrocław, and from the Wrocław Medical Academy. He was awarded the Officer's Cross of the Order of Polonia Restituta, the Commander's Cross with Star\n(1957)\n, the Order of the Work Flag First Class\n(1959)\nand several others.\nSteinhaus died in Wrocław aged\n85\nin February\n1972\n. He was buried in the Holy Family Parish Cemetery; his headstone reads, \"Between spirit and matter, there is mathematics.\""
}