{
  "nome_completo": "Hypatia of Alexandria",
  "nome_curto": "Hypatia",
  "ano_nascimento": "370",
  "ano_morte": "415",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hypatia/",
  "lugar_nascimento": "Alexandria, Egypt",
  "lugar_morte": "Alexandria, Egypt",
  "biografia": "Hypatia of Alexandria\nwas the first woman to make a substantial contribution to the development of mathematics.\nHypatia was the daughter of the mathematician and philosopher\nTheon\nof Alexandria and it is fairly certain that she studied mathematics under the guidance and instruction of her father. It is rather remarkable that Hypatia became head of the Platonist school at Alexandria in about\n400\nAD. There she lectured on mathematics and philosophy, in particular teaching the philosophy of\nNeoplatonism\n. Hypatia based her teachings on those of\nPlotinus\n, the founder of Neoplatonism, and\nIamblichus\nwho was a developer of Neoplatonism around\n300\nAD.\nPlotinus taught that there is an ultimate reality which is beyond the reach of thought or language. The object of life was to aim at this ultimate reality which could never be precisely described. Plotinus stressed that people did not have the mental capacity to fully understand both the ultimate reality itself or the consequences of its existence. Iamblichus distinguished further levels of reality in a hierarchy of levels beneath the ultimate reality. There was a level of reality corresponding to every distinct thought of which the human mind was capable. Hypatia taught these philosophical ideas with a greater scientific emphasis than earlier followers of Neoplatonism. She is described by all commentators as a charismatic teacher.\nHypatia came to symbolise learning and science which the early Christians identified with paganism. However, among the pupils whom she taught in Alexandria there were many prominent Christians. One of the most famous is Synesius of Cyrene who was later to become the Bishop of Ptolemais. Many of the letters that Synesius wrote to Hypatia have been preserved and we see someone who was filled with admiration and reverence for Hypatia's learning and scientific abilities.\nIn\n412\nCyril\n(\nlater St Cyril\n)\nbecame patriarch of Alexandria. However the Roman prefect of Alexandria was Orestes and Cyril and Orestes became bitter political rivals as church and state fought for control. Hypatia was a friend of Orestes and this, together with prejudice against her philosophical views which were seen by Christians to be pagan, led to Hypatia becoming the focal point of riots between Christians and non-Christians. Hypatia,\nHeath\nwrites,\n[\n4\n]\n:-\n... by her eloquence and authority ... attained such influence that Christianity considered itself threatened ...\nA few years later, according to one report, Hypatia was brutally murdered by the Nitrian monks who were a fanatical sect of Christians who were supporters of Cyril. According to another account\n(\nby\nSocrates Scholasticus\n)\nshe was killed by an Alexandrian mob under the leadership of the reader Peter. What certainly seems indisputable is that she was murdered by Christians who felt threatened by her scholarship, learning, and depth of scientific knowledge. This event seems to be a turning point as described in\n[\n2\n]\n:-\nWhatever the precise motivation for the murder, the departure soon afterward of many scholars marked the beginning of the decline of Alexandria as a major centre of ancient learning.\nThere is no evidence that Hypatia undertook original mathematical research. However she assisted her father\nTheon\nof Alexandria in writing his eleven part commentary on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. It is also thought that she also assisted her father in producing a new version of\nEuclid\n's\nElements\nwhich has become the basis for all later editions of\nEuclid\n.\nHeath\nwrites of\nTheon\nand Hypatia's edition of the\nElements\n[\n4\n]\n:-\n.. while making only inconsiderable additions to the content of the \"Elements\", he endeavoured to remove difficulties that might be felt by learners in studying the book, as a modern editor might do in editing a classical text-book for use in schools; and there is no doubt that his edition was approved by his pupils at Alexandria for whom it was written, as well as by later Greeks who used it almost exclusively...\nIn addition to the joint work with her father, we are informed by Suidas that Hypatia wrote commentaries on\nDiophantus\n's\nArithmetica\n, on\nApollonius\n's\nConics\nand on\nPtolemy\n's astronomical works. The passage in Suidas is far from clear and most historians doubt that Hypatia wrote any commentaries on\nPtolemy\nother than the works which she composed jointly with her father.\nAll Hypatia's work is lost except for its titles and some references to it. However no purely philosophical work is known, only work in mathematics and astronomy. Based on this small amount of evidence Deakin, in\n[\n8\n]\nand\n[\n9\n]\n, argues that Hypatia was an excellent compiler, editor, and preserver of earlier mathematical works.\nAs mentioned above, some letters of Synesius to Hypatia exist. These ask her advice on the construction of an\nastrolabe\nand a hydroscope.\nCharles Kingsley\n(\nbest known as the author of\nThe Water Babies\n)\nmade her the heroine of one of his novels\nHypatia, or New Foes with an Old Face\n. As Kramer writes in\n[\n1\n]\n:-\nSuch works have perpetuated the legend that she was not only intellectual but also beautiful, eloquent, and modest."
}