{
  "nome_completo": "Ida Martha Metcalf",
  "nome_curto": "Ida Metcalf",
  "ano_nascimento": "1856",
  "ano_morte": "1952",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Metcalf/",
  "lugar_nascimento": null,
  "lugar_morte": "Lexington, Massachusetts, USA",
  "biografia": "Ida Martha Metcalf\nwas the daughter of Charles Edward Metcalf and Martha Curtis Williams. Charles Metcalf was born in Ashburnham, Massachusetts on\n16\nFebruary\n1823\nand by\n1850\nhe was married and working in Louisiana as a bookkeeper. He had married Martha Williams, who had been born in Plainfield, Vermont on\n9\nAugust\n1823\n. They had three children, Helen E Metcalf, born in\n1850\nin Louisiana, Ida Metcalf, the subject of this biography, born in Texas in\n1856\n, and Edward C Metcalf, born in New Orleans, Louisiana in about\n1861\n.\n[\nLet us note here that several official records give Ida M Metcalf's birthdate as\n26\nAugust\n1857\nand several as\n26\nAugust\n1856\n.\n]\nThe\n1860\ncensus records the family living in New Orleans, Louisiana; Charles Metcalf is recorded as a clerk. Charles died before\n1870\nand soon after Ida, her brother and her mother travelled to the Boston area by boat. The\n1870\ncensus records Martha Metcalf living in Needham, Norfolk, Massachusetts with her father Silas Williams, her sisters Marilla Williams and Mary F Williams, and her daughter Ida and son Edward.\nIn\n1874\nMetcalf was teaching in Peterborough, New Hampshire. We see the report in\n[\n23\n]\n:-\nPeterborough, New Hampshire, District No\n8\n. Winter Term. Teacher, Miss Ida M Metcalf: This teacher came from Massachusetts well recommended, and really endeavoured to do her work well and faithfully, but some disturbing elements in the school and out of it, prevented as great success as could have been desired. The school closed without an examination on account of a severe snow storm that rendered the roads impassable.\nIda Metcalf attended Framingham Normal School in Framingham, Massachusetts.\nThe New England Journal of Education\nof\n5\nFebruary\n1876\ngives the following details\n[\n12\n]\n:-\nThe semi-annual examination of the Framingham Normal School, at the close of the winter term, took place last week. This school\n[\nwas\n]\nestablished in\n1812\n... During the last term it has had\n127\npupils, divided as follows: first advanced class\n5\n; second advanced class\n7\n; senior class\n15\n; second class\n24\n; third class\n24\n; fourth class\n52\n. It is at present under the management of Miss Ellen Hyde, who has conducted it as acting principal since the departure of Miss Johnson to take charge of Bradford Academy. The usual examinations took place in the morning, which reflected great credit upon teachers and pupils. In the afternoon essays were read by the graduating class. ... The following young ladies graduated ... Ida M Metcalf, Newton.\nIn\n1877\nMetcalf entered the Girls' Department of the High School, Providence\n(\nsee\n[\n1\n]\n)\n. In\n1878\nshe is listed as Third Assistant in the Hillside School in Elm Street, Jamaica Plain, Massachusetts. Her address is given as\n68\nWarrenton Street and she is teaching Class III in Room\n3\non the\n2\nnd Storey\n(\nsee\n[\n17\n]\nand\n[\n1\n]\n)\n. In\n1879\nand\n1880\nshe is still listed in the same position\n(\nsee\n[\n5\n]\n)\nbut, on\n12\nApril\n1880\nshe resigned this position\n(\nsee\n[\n18\n]\n)\n.\nThe\n1880\ncensus records Martha Metcalf, her two sisters and her son Edward still living in Needham, Norfolk, Massachusetts. Ida, however, was a student living in Framingham, Massachusetts. In\n1882\n, Metcalf is\n1\nst Assistant in Phillips School, Boston\n(\nsee\n[\n2\n]\n)\n. She had resigned a position in the Spring of\n1882\n[\n19\n]\n:-\nEarly in the Spring term, Miss Ida M Metcalf resigned her position as Principal of the Saxonville Grammar School ...\nIn\n1883\nMetcalf entered Boston University as a special student. In\n1885\nshe is listed in\n[\n25\n]\nas being eligible as a teacher in Public Schools having been certified in August of that year. She continued to study at Boston University for a further year and in\n1886\nhe was awarded the degree of Ph.B. She had written the thesis\nThe Origin and Development of Styles of Architecture\n. She was a graduate student in mathematics at Cornell University in\n1888\n-\n89\nstudying for a Master's Degree; she wrote the thesis\nThe Theory of Illumination by Reflected and Refracted Light\n. At Cornell University's Twenty-First Annual Commencement in the Gymnasium Hall on Thursday\n20\nJune\n1889\n, Metcalf was awarded a Master of Science Degree.\nAfter the award of her Master's Degree, in February\n1891\nMetcalf took a position teaching at Bryn Mawr School in Baltimore:-\nThe Bryn Mawr School\n[\nopened\n]\nin\n1885\nin order to provide girls and young women with the same educational benefits that boys enjoyed. The curriculum was daring and liberal for its time, including both modern and classical languages, English, history, mathematics, the latest scientific theories, and a focus on physical education - all of which stretched the limits of imagination and acceptance.\nMetcalf, however, was aiming at a doctorate in mathematics and, while teaching at Bryn Mawr School, she made enquiries about returning to Cornell. In\n1892\nshe was back at Cornell University undertaking research and also attending courses. At this time James Edward Oliver\n(1829\n-\n1895)\nwas head of mathematics with the other two senior members of the department being Lucian Augustus Wait\n(1846\n-\n1913)\nand George William Jones\n(1837\n-\n1911)\n. None of these three had a doctorate, nor had they been primarily interested in research, but the department had built up quite a strong graduate programme by the time Metcalf was back as a doctoral student. Formally her advisor was Oliver so we should give details of him, quoting\n[\n9\n]\n:-\nProfessor Oliver was born in Salem, Massachusetts, of Quaker parentage, in\n1829\n. He was the poet of the class of\n1849\nat Harvard, and the favourite pupil of Professor\nBenjamin Peirce\n, who always declared that \"Jimmy Oliver was the best mathematician who had ever come under his notice.\" As a teacher, Professor Oliver was thorough, painstaking, considerate, and, above all, inspiring by his wealth of suggestiveness and depth of intellectual insight. His methods in the classroom were very informal, and he seldom lost an opportunity of making a good joke, even when the joke was on himself. As he was happiest when the textbook could be laid aside and he could follow his own bent, it is possible that he did not always attain the best results with a miscellaneous class of undergraduates; but with an \"audience fit though few,\" he was wont to open up new vistas, sometimes forgetting the lapse of time in his enthusiasm. His publications are not numerous, for the drudgery of working up an article for permanent form was peculiarly irksome to him, especially after the freshness of discovery had passed away; and, during his best years, he had small leisure for writing, as he had then comparatively few assistants, and his recitation hours sometimes amounted to more than twenty in the week. His high original power was of the kind that shows itself not so much in published writings as in familiar classroom talks, and in the inspiration which they impart to others; and it is thus he would wish his name to live. As regards the silent influence of his life, there must be many hundreds of students and others who still derive inspiration from the memory of his high standards, and the rare beauty of his life and character with its unusual freedom from self-consciousness.\nGeorge Jones had studied at Yale, being awarded an A.B. in\n1859\nand an A.M. in\n1862\n. He was giving graduate courses covering advanced work in analytic geometry of two and three dimensions, lines and surfaces of first and second orders, and also a course in modern synthetic geometry. In addition to courses in geometry and analysis, Metcalf took a projective geometry course taught by George Jones. Although Oliver was officially Metcalf's supervisor, it is likely that Jones was an unofficial advisor since her thesis was on a topic close to Jones' lecture course. Metcalf also helped Jones with the book he was writing,\nDrill-book in Algebra\n(1892)\n. In the Preface Jones gives thanks:-\n... to Miss Ida M Metcalf, who spent half a year in giving form to the text and preparing the questions and exercises.\nShe was awarded her Ph.D., magna cum laude, for her\n48\n-page thesis\nGeometric duality in space\nat Cornell University's Twenty-Fifth Annual Commencement in the Gymnasium Hall on Thursday\n15\nJune\n1893\n.\nAfter the award of her Ph.D., Metcalf hoped for a position as a mathematics lecturer but she failed to be appointed to such a post. In September\n1897\nshe was back to school teaching but as a second assistant for history, not mathematics, at the Girls' High School, New York City. In the\n1900\nUS census she is recorded as living with her mother Martha and her brother Edward at\n17\nWashington Street, Wellesley, Norfolk, Massachusetts. Her occupation is given as \"teacher of mathematics\", fully employed, while her brother's is \"house carpenter\" employed for nine months in the preceding year.\nIn June\n1900\nthe\nAtlantic Monthly Advertiser\nran the following advertisement:-\nNewton Lower Falls. Study by the Sea. Tutoring during July and August at a beautiful, restful, and inexpensive place on the coast of Maine. Address Ida M Metcalf, Ph.D., Newton Lower Falls, Massachusetts\"\nTwo years later the following advertisement appeared\n[\n24\n]\n:-\nIda M Metcalf M.S. Ph.D.\n1275\nBedford Avenue, Brooklyn. Tutor in Elementary and Advanced Mathematics.\nIn the same year of\n1902\n, Metcalf published the article\nPampered Children of the Poor\ngiving her address as Bryn Mawr, Pennsylvania; presumably she wrote it while at Bryn Mawr College. She writes\n[\n14\n]\n:-\nThe explicit statements in this essay are based on personal experience in high-school teaching in a great city with a very large foreign population, and on the testimony of others engaged in the same work.\nThe final paragraph of the essay is as follows\n[\n14\n]\n:-\nA slight infusion of the Stoic philosophy would greatly ennoble the views of life held by our school children. Tell them plainly that hard tasks simply call for more earnest endeavour; that they are at liberty to dislike certain work as heartily as they please, but that to offer this dislike as an excuse for leaving their work undone is to play a part unworthy of men and women. Even young children are capable of the conception of duty as a powerful dynamic force. If upon pupils of higher school age this conception has not dawned, they are in danger of developing into incompetent whiners at life's tasks, cowards under life's hardships, pitiable egotists, intellectual and moral invertebrates.\nYou can read a version of the whole article at\nTHIS LINK\n.\nMetcalf continued as a teacher over the following years. In\n1904\nshe had a position in the East Side Evening High School for Women in New York\n(\nin place of Mary V Linden\n)\n. She still teaches there in\n1906\nand is still living at\n1275\nBedford Avenue, Brooklyn. By the time of the April\n1910\nUS census she is living at the same Bedford Avenue address in Brooklyn, New York as one of five lodgers in the house of the widowed statistician Aletta M Jordan and her two sons. Metcalf's occupation is given as teacher and she has been in full time work over the previous year. This, however, marks the end of Metcalf's career as a teacher for later in\n1910\nshe took the competitive examination for a civil service position with the City of New York.\nAlthough Metcalf appears to have given up research after her Ph.D., her interest must have still been in it for in\n1909\nshe published what she claimed to be a proof of\nFermat\n's Last Theorem. The reviewer pointed out the error in the following year.\nIt was clear from Metcalf's\nPampered Children of the Poor\npaper that she was unhappy with school standards. In\n1911\nshe published\nHumor in the Regents' Examinations\nwhich begins\n[\n15\n]\n:-\nEvery high-school pupil, and every parent of such a child in New York State, knows the Regents' tests as a name of weighty import; but for the benefit of other readers, let it be explained that these are the uniform examinations given by the Department of Education of the Empire State. It goes without saying that among the three hundred thousand or so papers sent to Albany after the June examinations there are many answers not only somewhat startling, but also provocative of a smile from even the most ardent devotees of exact knowledge. The following article contains a few gems extracted from this mine of wisdom and folly, of fact and fiction, often oddly combined.\nShe presented many illustrations which, she believed, illustrated\n[\n15\n]\n:-\n... the degree of confusion, misconception, and inarticulateness that may, and often does, exist in the minds of some of our young people.\nOn\n17\nJuly\n1912\nThe New York Times\npublished Metcalf's letter to the editor in which she was even more direct in her criticism of the school system, stating that:-\n... the real mission of the schools, the development of intellect and character, is not only shirked, but belittled.\nIn\n1910\nMetcalf was\n54\nyears old and yet she gave up teaching and began a new career becoming a civil service examiner in New York. She was the first woman to be appointed to such a role and it is believed that her performance in the examination for the job had been so outstanding that it overcame any objections on the grounds that it was not the job for a woman. Two years later, in\n1912\n, she became a statistician for the New York Finance Department. But, given her background, she wished to become a statistician for the New York Education Department. She was not, however, allowed to take the examination for that role and the excuse given was that she did not have sufficient experience. One would have thought that the men trying to prevent her getting that job would have been able to think up a better excuse! The\nReport\nof an investigation into the Municipal Civil Service Commission and of the Administration of the Civil Service Law and Rules in the City of New York in\n1915\nnoted that her 'lack of experience' was\n[\n20\n]\n:-\n... though she had three college degrees, had taught public and private school most of her life and had been statistician in the department of finance over two years ...\nShe continued working as a statistician for the New York Finance Department until she retired in\n1922\n.\nMetcalf was certainly not someone who tried to avoid controversy and she was very prepared to stand up for what she believed was right. We have seen above some of her criticisms of the education system. On\n17\nOctober\n1915\nshe made another controversial move. She placed the following advertisement in\nThe New York Times\n:-\nTo teachers and philanthropic workers: Free home and liberal education will be given little girl\n8\nor\n9\nyears old with capacity to become a woman of high type if given opportunities for development, but now lacking such opportunities.\nThe next day\nThe New York Times\npublished the article\nWants to Educate Girl\ncommenting on Metcalf's advertisement. Despite criticism of her advertisement, Metcalf was able to adopt an\n8\nyear old girl, namely Theresa Maria Kalab. Theresa Kalab had been born on\n7\nJanuary\n1906\nin Hodelein, Austria. She emigrated with her mother Therese Kalab to the United States on the Chemnitz, arriving in New York on\n19\nOctober\n1906\n. Therese Kalab was going to join her husband Rudolf who was already in New York. Certainly Metcalf did well in giving Theresa Kalab opportunities; she has an entry in\nWho's Who in America\n1940\n[\n11\n]\n:-\nKalab, Theresa, author and illustrator juvenile books; b. Hodelein, Austria; adopted by Dr Ida M Metcalf at age of\n8\n; student Columbia University and Grand Central School of Art and Art League. Has done commercial illustration, largely fashion sketches for newspapers. ...\nIn\n1917\nMetcalf became the secretary to the Commission on Administration of the Tax Law\n[\n13\n]\n:-\nAt the first meeting, held on February\n26\n, Mr Robert B McIntyre was chosen as chairman and Miss Ida M Metcalf, a statistician in the Department of Finance, was appointed as secretary to the Commission.\nMetcalf had ever reason to feel highly aggrieved at her treatment as a woman for she was certainly denied the opportunities that would have been open to a man with her qualifications and talent. She made a forceful entry into arguments over working women in\n1914\n. Let us quote from Gail Bederman who sets the scene in\n[\n2\n]\n:-\nWilliam T Sedgwick\n[\nhead of Massachusetts Institute of Technology's department of biology and public health\n]\ninsisted that women's reproductive physiology precluded their participating in the wider civilisation; that civilised advancement rested on the widest possible exaggeration of sexual differences; that woman belonged only in the home. At the same time, however, Sedgwick's premises about masculinity were disturbingly like Gilman's\n[\nCharlotte Perkins Gilman, novelist\n]\n. Both agreed masculinity was composed of desire, egotism, and combat. Yet Gilman assumed men would be ashamed of that fact, while Sedgwick clearly relished modern man's kinship to the primal rapist. \"There is a lot of the primitive in all of us, both men and women,\" he insisted; women enjoyed \"being mastered,\" and men enjoyed \"mastering\" them.\nSedgwick's opinions touched off an extensive reaction in the United States, .... The New York Times praised Sedgwick for openly saying \"things which have not been said before so plainly.\" Feminists were less complimentary. lda M Metcalf wrote a letter to the editor asking whether, in the combative \"charming ... future civilisation\n[\nthat Sedgwick envisioned\n]\nall men unable to hold their own against a prize-fighter will be forcibly subdued and held in subjection?\" This was a low blow. In\n1914\n, when Metcalf wrote, the most famous American prize-fighter was the exiled but still undefeated Jack Johnson, and white men remained uncomfortably aware that prize-fighting was an unstable way to assert white male dominance.\nLet us quote more fully from Metcalf's letter\nThe rule of brute force\nto\nThe New York Times\nprinted in the paper on\n25\nJanuary\n1914\n[\n16\n]\n:-\nProf Sedgwick told us complacently ... that if women persist in claiming the same rights as other citizens, men will exert their superior muscular force and reduce them to literal slavery. ... Are we to understand that all the men unable to hold their own against a prize-fighter will be forcibly subdued and held in subjugation if they ask for fair play and venture upon economic competition with their stronger fellow beings? Apparently the dictum of science, as expressed by this prophet, is that we are evolving backward toward the ancestor we share with the gorilla.\nIn\n[\n8\n]\nwe see a little more of Metcalf's views:-\nOn October\n11\n,\n1922\n, Metcalf expressed her views on \"discrimination in business circles against women of middle age, a condition the existence of which is readily admitted by employers.\" She wrote, \"The thinking women of today of any age are asking for our sex not privilege but 'a fair field and no favour,' and intelligent employers, if they would bring their business acumen and judgment to bear upon the matter, would ... seek the most competent and conscientious worker quite irrespective of such incidental qualities as age, sex, complexion, political affiliation or religious creed.\nIn\n1922\nMetcalf retired\n[\n10\n]\n:-\nThat the Board of Estimate and Apportionment ... does retire from city-service said Ida M Metcalf to take effect January\n1\n,\n1922\n, and hereby awards to her an annual retirement allowance of seven hundred and fifty-one dollars and fifty-five cents, being in part a pension of seven hundred twenty-three dollars and fifty-five cents, based on her years of service and her average annual earnable compensation during her last ten years of city-service.\nBy the time of the\n1930\ncensus, Metcalf is recorded as living at\n13\nNarragansett Avenue, Jamestown, Newport, Rhode Island. This home, which she had owned for many years and spent her summers there, now became her permanent home. In\n1948\n, now\n92\nyears old, Metcalf became ill and moved to a nursing home in Washington, Connecticut. Around the middle of the year\n1951\nshe moved to the Fairlawn Nursing Home in Lexington, Massachusetts. She died a little over a year later from arteriosclerosis and was buried in Lincoln Cemetery, Lincoln, Massachusetts."
}