{
  "nome_completo": "Ilya Iosifovich Piatetski-Shapiro",
  "nome_curto": "Ilya Iosifovich Piatetski-Shapiro",
  "ano_nascimento": "1929",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Piatetski-Shapiro/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Tel Aviv, Israel",
  "biografia": "Ilya Iosifovich Piatetski-Shapiro\n's parents were Iosif Grigor'evic Piatetski-Shapiro and Sofia Arkadievna. Iosif Grigor'evic, who had a doctorate in chemical engineering, was originally from Berdichev\n(\nnow Berdychiv\n)\nin Ukraine, while his wife was originally from Gomel\n(\nor Homel\n)\nin Belarus. Both were Jewish, from cities which had originally been Polish, and had been well-off until the\n1917\nRevolution. However, by the time Ilya was born, the family was very poor. His first interest in mathematics, according to his biographical notes, was at the age of ten when he was captured \"by the charm and unusual beauty of negative numbers\" shown to him by his father.\nPiatetski-Shapiro entered Moscow University and was awarded his first degree in\n1951\n. In the following year the\nMoscow Mathematical Society\nawarded him their Young Mathematician Prize for his work\nOn the problem of uniqueness of expansion of a function in a trigonometric series\nwhich he had undertaken while an undergraduate. He had given a solution to a problem which had been posed by\nRaphaël Salem\n. Despite his outstanding mathematical achievements as an undergraduate, his application to undertake research at Moscow University was turned down. Clearly this was a decision based on the fact that he was Jewish rather than on any academic grounds. He had been strongly supported in his application by his professor,\nAleksandr Osipovich Gelfond\n, but this was not enough to see him succeed although, almost certainly due to Gelfond's efforts, he was allowed to enter the Moscow Pedagogical Institute. He was advised by Aleksandr Buchstab and he made outstanding progress with his research with\nOn the distribution of prime numbers in sequences of the form\n[\nf\n(\nn\n)\n]\n[f (n)]\n[\nf\n(\nn\n)\n]\n(\nRussian\n)\nbeing published in\n1953\n, a paper containing what is now called the Piatetski-Shapiro\nprime number theorem\n. However, in\n1952\nhe had received a letter from government officials telling him to go to Kazakhstan to take up a position as a high school mathematics teacher. Piatetski-Shapiro's parents advised him to do what the letter said for they feared he would be sent to a labour camp if he refused. However, he ignored the letter and about a year later he received another letter telling him that he did not have to take up the teaching post. He was awarded his Master's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1954\n.\nAfter obtaining this postgraduate degree, Piatetski-Shapiro spent three years teaching in Kaluga, a town about\n160\nkm southwest of Moscow. Returning to Moscow he studied at the Stecklov Institute of the\nUSSR Academy of Sciences\nworking with\nIgor Rostislavovich Shafarevich\n. He appeared to have overcome the discrimination when his career flourished with appointment as professor of mathematics at the Moscow Institute of Applied Mathematics in\n1958\n, and, in addition, a professorship at Moscow State University in\n1965\n. He could not fully participate in the international mathematical scene, however. For example, when given a highly prestigious invitation to address the International Congress of Mathematicians in Stockholm in\n1962\nhe was not allowed to travel abroad by the Soviet authorities and his lecture to the Congress was read by\nShafarevich\n. The next International Congress of Mathematicians was held in Moscow in\n1966\nand Piatetski-Shapiro was invited to give one of the plenary one-hour talks; he spoke on\nAutomorphic Functions and Arithmetic Groups\n. In the same year of\n1966\nhe published the highly influential monograph\nTheory of representations and automorphic functions\nwritten jointly with\nI M Gelfand\nand M I Graev.  Despite many invitations to speak at international conferences during this period he was never allowed to attend by the Soviet authorities, except on one occasion for a conference held in Hungary. It was made clear to him that he would have to join the Communist Party before trips outside the Soviet block could be contemplated by the authorities. He replied simply that membership of the Communist Party would distract him from his work.\nIn\n1968\nhe signed a letter asking Soviet authorities to release a mathematician from a mental institution where he had been sent because of his political views. As a result he was dismissed from his professorship at Moscow State University. Shafarevic, who also signed the petition, suffered a similar consequence. Piatetski-Shapiro's problems became even more severe in the\n1970\ns. He had married Inna with whom he had a son, but the marriage ended in divorce. Inna and her son emigrated to Israel in\n1973\nand in the following year Piatetski-Shapiro also applied to be allowed to emigrate to Israel. Not only was his application refused, but he was dismissed from his professorship at the Institute of Applied Mathematics. Even worse, he was even forbidden to use mathematical libraries and was subjected to constant KGB surveillance. Mathematicians in Europe and North America were certainly aware of Piatetski-Shapiro's plight and they made efforts to help him. Continuing to apply to be allowed the emigrate to Israel, he was successful in\n1976\nafter mathematicians pleaded with the Council of the\nNational Academy of Sciences\nto use their influence. Although this was a very positive development, one side effect was the break-up of his second marriage. He broke up with his second wife when she decided that she would remain in Moscow.\nPiatetski-Shapiro was given a professorship at Tel-Aviv University in Israel in\n1977\n, but now he could travel world-wide and his outstanding reputation meant that he was also able to accept a position at Yale University in the United States in the same year. He divided his time between the two universities, and supervised doctoral students in both. Accepting a third invitation to address the International Congress of Mathematicians in\n1978\nhe was able to travel to Helsinki.\nLet us summarise Piatetski-Shapiro's main mathematical contributions by quoting from the citation when he was awarded the\n1990\nWolf Foundation Prize in Mathematics:-\nFor almost\n40\nyears Professor Ilya Piatetski-Shapiro has been making major contributions in mathematics by solving outstanding open problems and by introducing new ideas in the theory of automorphic functions and its connections with number theory, algebraic geometry and infinite dimensional representations of\nLie\ngroups. His work has been a major, often decisive factor in the enormous progress in this theory during the last three decades.\nAmong his main achievements are: the solution of\nSalem\n's problem about the uniqueness of the expansion of a function into a trigonometric series; the example of a non symmetric homogeneous domain in dimension\n4\nanswering\nCartan\n's question, and the complete classification\n(\nwith E Vinberg and G Gindikin\n)\nof all bounded homogeneous domains; the solution of Torelli's problem for K\n3\nsurfaces\n(\nwith\nI Shafarevich\n)\n; a solution of a special case of\nSelberg\n's conjecture on unipotent elements, which paved the way for important advances in the theory of discrete groups, and many important results in the theory of automorphic functions, e.g., the extension of the theory to the general context of semi-simple\nLie\ngroups\n(\nwith\nI Gelfand\n)\n, the general theory of arithmetic groups operating on bounded symmetric domains, the first 'converse theorem'  for GL\n(3)\n, the construction of L-functions for automorphic representations for all the classical groups\n(\nwith S Rallis\n)\nand the proof of the existence of non arithmetic lattices in hyperbolic spaces of arbitrary large dimension\n(\nwith\nM Gromov\n)\n.\nWe note that he shared this\n1990\nWolf Prize with\nEnnio De Giorgi\n. This was certainly not the only honour to be given to Piatetski-Shapiro for his outstanding mathematical contributions. We have already mentioned three invitations to address the International Congress of Mathematicians, but remarkably he received a fourth invitation to address the Congress in Beijing in\n2002\n. By this time he was too ill to give the address himself, but it was delivered for him by his collaborator James W Cogdell. He was elected to the\nIsrael Academy of Sciences\n(1978)\nand received the Israel Prize in Mathematics\n(1981)\n. A conference was held at Yale in\n1999\n\"in honour of\nDan Mostow\nand Ilya Piatetski-Shapiro\". In the following year, a volume of his\nSelected Works\nwas published by the\nAmerican Mathematical Society\n. Solomon Friedberg writes in a review:-\nThis is an impressive collection of papers by a mathematician of striking influence and originality. The editors are to be sincerely thanked for helping bring it to press. This volume will be a valuable and even inspirational addition to the desk or bookshelf of many a mathematician.\nAlthough his most important contributions were to pure mathematics, Piatetski-Shapiro's mathematical interests were remarkably broad\n[\n2\n]\n:-\nDuring a career that spanned sixty years, he made major contributions to applied science, as well as theoretical mathematics. These contributions range from cell biology, geophysics, automata, and homogeneous networks, to digital computers.\nJames Cogdell, who we mentioned above, was Piatetski-Shapiro's first Ph.D. student at Yale, being awarded a doctorate in\n1981\n. He became a collaborator and friend and together they wrote the monograph\nThe arithmetic and spectral analysis of Poincaré series\npublished in\n1990\n.\nIn Israel, Piatetski-Shapiro met Edith Libgober, also a mathematician, and she became his third wife. Edith was a great strength to him through the latter part of his life which became increasingly difficult due to Parkinson's disease. He suffered from this disease for the last\n30\nyears of his life, and over the final ten years he became almost completely immobile and was hardly able to speak. Yet somehow, with the help of his wife and of James Cogdell, he continued to produce important mathematics\n[\n2\n]\n:-\nMost striking was the fact that he continued to perform research at the highest level until the end of his life, in spite of a deteriorating condition, that left him severely handicapped, and often deprived him of speech. Even when he could barely move, he travelled the world, attending conferences, in order to exchange thoughts with colleagues about their latest researches.\nAs to his interests outside mathematics, we mention his love of chess and, in the years before his health problems prevented it, he loved hiking and camping. As to his character, Miller writes\n[\n4\n]\n:-\nHe was such a modest and unpretentious man, not afraid to ask basic questions....  I was thrilled to have the opportunity to come to Yale ... as his last post-doc. The Yale department is very friendly and close-knit, and Edith and Ilya were really like family. I was frequently at their house, and was impressed by how they had such close relationships with a large spectrum of mathematicians even more impressed to see their constant admiration of Ilya. Their Passover seder guests could include graduate students one year and\nMikhail Gromov\nthe next. They treated me like their son."
}