{
  "nome_completo": "Imre Lakatos",
  "nome_curto": "Imre Lakatos",
  "ano_nascimento": "1922",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lakatos/",
  "lugar_nascimento": "Debrecen, Hungary",
  "lugar_morte": "London, England",
  "biografia": "Imre Lakatos\nwas given the name\nImre Lipschitz\nat birth, born into a Jewish family as his name clearly indicated. His life would be dominated by the chaos that resulted from the Nazi rise to power and World War II, the war breaking out when Imre was in his final years at school.\nIt was a difficult period for Hungary, with the country unsure whether to side with Hitler or with the allies, but in many ways Hungary had few options. Hitler decided that he could not leave his vital communications at the mercy of an uncommitted Hungarian regime. In March\n1944\nHitler offered Hungary the choice of either cooperating with Germany or the German armies would occupy the country. Hungary chose cooperation and appointed a government to collaborate with Hitler. The Germans did as they pleased, suppressing opponents and arresting anyone who spoke out against them. Jews were compelled to wear a yellow star and their property was taken away.\nImre had spent the war years at the University of Debrecen and he graduated in\n1944\nwith a degree in mathematics, physics and philosophy. To avoid the Nazi persecution of Jews he changed his name to\nImre Molnár\n, and he survived while others of Jewish descent were deported to the gas chambers of German concentration camps. More than\n550\n,\n000\nof Hungary's\n750\n,\n000\nJews were killed by the Nazis during the war, including Imre's mother and grandmother who both died in Auschwitz.\nAfter the war ended Imre, who by this time was an active communist, realised that he would have difficulty wearing his old shirts with \"I. L.\" on them when his name was now Imre Molnár. Hungary was in grave financial trouble and getting a new collection of shirts was harder than changing one's name so he changed his name, not back to the Jewish Lipschitz but rather, in keeping with his political views, to the Hungarian working class name of Lakatos. He may have borrowed the name from the Hungarian general Géza Lakatos who headed a peace seeking Hungarian government for a short while before the Germans put their own man in charge. At least Imre Lakatos could now wear his \"I. L.\" shirts again!\nIn\n1947\nImre Lakatos obtained a post in the Hungarian Ministry of Education. However he was not good at taking orders from Russian authorities without questioning them and Lakatos soon found that his views had put him in political trouble. In\n1950\nhe was arrested and served three year in a Stalinist prison\n[\n1\n]\n:-\nHe used to say afterwards that two factors helped him to survive: his unwavering communist faith and his resolve not to fabricate evidence.\n(\nHe also said, and one believes it, that the strain of interrogation proved too much - for one of his interrogators!\n)\nOn his release in\n1953\n, the year of Stalin's death,\nRényi\nhelped Lakatos find work. Lakatos earned his living translating mathematics books into Hungarian. Among the books that he translated at this time was\nPólya\n's book\nHow to Solve it\n.\nIn\n1956\nthere was revolution in Hungary against the Russian regime which controlled the country. On\n1\nNovember\n1956\nHungary withdrew from the Warsaw Pact and asked the United Nations to recognise it as a neutral state, under the protection of the United Nations. Two days later Russian tanks were in position and a puppet government was set up. Many people were sent to the Soviet Union and many of those never returned. Around\n200\n,\n000\nrefugees escaped to the West, a substantial proportion being Hungary's educated classes. Lakatos realised that he was about to be arrested and fled to Vienna.\nEventually Lakatos found his way to England and he began to study at the University of Cambridge for a doctorate in philosophy. His work was influenced by Popper and by\nPólya\nand he went on to write his doctoral thesis\nEssays in the Logic of Mathematical Discovery\nsubmitted to Cambridge in\n1961\n. At\nPólya\n's suggestion his thesis took as its theme the history of the\nEuler\n-\nDescartes\nformula\nV\n−\nE\n+\nF\n=\n2\nV - E + F = 2\nV\n−\nE\n+\nF\n=\n2\n. In\n1960\nLakatos was appointed to the London School of Economics and he taught there for\n14\nyears until his death. His lecturing is described in\n[\n1\n]\n:-\nWhen he lectured, the room would be crowded, the atmosphere electric, and from time to time there would be a gale of laughter.\nAgain in\n[\n1\n]\nErnest Gellner writes:-\nHe lectured on a difficult, abstract subject riddled with technicalities, the philosophy and history of mathematics and science; but he did so in a way which made it intelligible, fascinating, dramatic and above all conspicuously amusing even for non-specialists.\nLakatos published\nProofs and Refutations\nin\n1963\n-\n64\nin four parts in the\nBritish Journal for Philosophy of Science\n. This work was based on his doctoral thesis and is written in the form of a discussion between a teacher and a group of students. Worrall\n[\n17\n]\ndescribes the paper:-\n... as well as having great philosophical and historical value, was circulated in offprint form in enormous numbers.\nDuring his lifetime Lakatos refused to publish the work as a book since he intended to improve it. However, in\n1976\n, two years after his death, the work did appear as a book: J Worrall and E G Zahar\n(\neds.\n)\n,\nI Lakatos : Proofs and Refutations : The Logic of Mathematical Discovery\n.\nWorrall\n[\n17\n]\ndescribes the work:-\nThe thesis of 'Proofs and Refutations' is that the development of mathematics does not consist\n(\nas conventional philosophy of mathematics tells us it does\n)\nin the steady accumulation of eternal truths. Mathematics develops, according to Lakatos, in a much more dramatic and exciting way - by a process of conjecture, followed by attempts to 'prove' the conjecture\n(\ni.e. to reduce it to other conjectures\n)\nfollowed by criticism via attempts to produce counter-examples both to the conjectured theorem and to the various steps in the proof.\nHersh\n[\n9\n]\nsays that\nProofs and Refutations\nis:-\n... an overwhelming work. The effect of its polemical brilliance, its complexity of argument and self-conscious sophistication, its sheer weight of historical learning, is to dazzle the reader.\nLakatos wrote a number of papers on the philosophy of mathematics before moving on to write more generally on the philosophy of science. However, like his doctoral thesis, he often used historical case studies to illustrate his arguments. I\n[\nEFR\n]\nwould strongly recommend the article in\nThe Mathematical Intelligencer\n(3)\n(1978)\n,\n151\n-\n161\nby Lakatos. This article,\nCauchy and the Continuum : The Significance of\nNon-Standard Analysis\nfor the History and Philosophy of Mathematics\nis one of the most enjoyable that I have read. Hersh\n[\n9\n]\nexplains the point of the approach to history that Lakatos uses in this article:-\nThe point is not merely to rethink the reasoning of\nCauchy\n, not merely to use the mathematical insight available from\nRobinson\n's non-standard analysis to re-evaluate our attitude towards the whole history of the calculus and the notion of the\ninfinitesimal\n. The point is to lay bare the inner workings of mathematical growth and change as a historical process, as a process with its own laws and its own 'logic', one which is best understood in its rational reconstruction, of which the actual history is perhaps only a parody.\nAs a research supervisor, Lakatos was extremely effective\n[\n1\n]\n:-\nHe inspired a group of young scholars to do original research: he would often spend days with them on their manuscripts before publication.\nLakatos died at a time when he was highly productive with many plans to publish new work, make replies to his critics and apply his ideas to new areas. Worrall\n[\n17\n]\nhowever points out that the achievement of which Lakatos would have been most proud was leaving:-\n... a thriving research programme manned, at the London School of Economics and elsewhere, by young scholars engaged in developing and criticising his stimulating ideas and applying them to new areas.\nHis character is described in\n[\n1\n]\n:-\nWith his sharp tongue and strong opinions he sometimes seemed authoritarian; but he was \"Imre\" to everyone; and he invited searching criticism of his ideas, and his writings over which he took endless trouble before they were finally allowed to appear in print."
}