{
  "nome_completo": "Irving Ezra Segal",
  "nome_curto": "Irving Segal",
  "ano_nascimento": "1918",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Segal/",
  "lugar_nascimento": "Bronx, New York, USA",
  "lugar_morte": "Lexington, Middlesex, Massachusetts, USA",
  "biografia": "Irving Segal\n's parents, Aaron Segal and Fannie Weinstein, were Jewish. Although born in the Bronx, he was brought up and attended high school in Trenton, New Jersey. He graduated from Trenton High School in\n1934\nat the age of fifteen and later that year entered Princeton University. At this time it is believed that Princeton had a quota for Jewish students although the university has always denied this. Whatever the truth about the Jewish quota, it is certain that he faced difficulties because he was Jewish. He graduated with an A.B. from Princeton in\n1937\n, winning the George B Covington Prize in Mathematics, and proceeded to Yale University to study for his doctorate advised by\nEinar Hille\n[\n2\n]\n:-\n[\nHille\n]\nsuggested that Segal continue his and\nTamarkin\n's investigation of the ideal theory of the algebra of\nLaplace\n-\nStieltjes\ntransforms absolutely convergent in a fixed half-plane. But, Segal wrote, \"For conceptual clarification and for other reasons, an investigation of the group algebra of a general\n[\nlocally compact\n]\nabelian group was of interest.\" And the thesis was not restricted to abelian groups.\nSegal submitted his thesis\nRing Properties of Certain Classes of Functions\nto Yale in\n1940\nand was awarded a Ph.D. in June of that year. It was in\n1940\nthat his first paper was published. This was a short one-page article\nThe automorphisms of the symmetric group\nin which he gave an easy proof that, except when\nn\n=\n6\nn = 6\nn\n=\n6\n, the symmetric group of degree\nn\nn\nn\nis isomorphic to its automorphism group. Segal was appointed as an Instructor of Mathematics at Harvard University in\n1941\nbut when the United States entered World War II he undertook war work, first at Princeton from\n1941\nto\n1943\nand then ballistics research at the Aberdeen Proving Ground in Maryland from\n1943\nto\n1945\n. During this latter period Segal worked as a researcher in the United States Army. This war work meant that Segal did not publish the detailed results of his thesis until\n1947\nwhen they appeared in the paper\nThe group algebra of a locally compact group\n. However he had submitted the paper\nThe group ring of a locally compact group  I\nto the\nProceedings of the National Academy of Sciences\nin June\n1941\n. The paper\n[\n8\n]\n:-\n... contains a definition of a \"group ring\" for a general locally compact group and the basic properties of this group ring. ... One of Segal's main goals in the study of his group ring was to provide an appropriately general setting for the Wiener Tauberian theory, the theory of almost periodic functions, and harmonic analysis on locally compact groups.\nAfter the war ended in\n1945\n, Segal was appointed as\nOswald Veblen\n's assistant at the Institute for Advanced Study at Princeton. He remained at Princeton until\n1948\n, supported in his final year by a Guggenheim Fellowship. He moved to the University of Chicago in\n1948\nto take up an appointment as Assistant Professor of Mathematics. He was promoted to Associate Professor of Mathematics at Chicago in\n1953\nand he spent the academic year\n1954\n-\n54\nas a Visiting Associate Professor at Columbia University in New York. On\n15\nFebruary\n1955\nhe married the artist Osa Skotting; they had two sons William and Andrew, and a daughter Karen. In\n1957\nSegal became a full professor at the University of Chicago and, three years later, he moved to the Massachusetts Institute of Technology where he was appointed as a Professor of Mathematics.\nDuring the winter of\n1946\n-\n47\nwhile at Princeton, Segal gave talks on his paper\nPostulates for general quantum mechanics\n. Here he presented a set of axioms which formed a modification of those put forward by\nvon Neumann\nin\n1932\n. In fact, although Segal went on to contribute to several different areas of mathematics, all these had as their motivation the mathematical needs of quantum theory. For example there was his impressive work on infinite dimensional integration theory which began with his paper\nA non-commutative extension of abstract integration\n(1953)\n. Also, building on his early work on representations of arbitrary locally compact groups he went on to consider representations of groups related to quantum mechanics, namely groups of symmetries of the commutation or anti-commutation relations. Leonard Gross was one of Segal's Ph.D. students being awarded his doctorate in\n1958\n. He writes in\n[\n2\n]\nabout the driving force behind Segal's work:-\n... after I returned to Yale I received letters from him raising interesting questions close to my area of expertise. In retrospect I realize that he was driven not only by his sense of duty to provide his intellectual progeny with plenty of food for the mind but also by his single-minded determination to solve one of the big problems of mathematical physics: the existence of interacting quantum fields. Although much of his work may seem to many mathematicians to be motivated simply by the usual aesthetic considerations - and is certainly justified by the intrinsic beauty of his ideas - Irving told me a few years ago that all of his work was aimed in one way or another at understanding quantum physics.\nThe main aim of Segal's work during the latter part of his career was contributing to cosmology\n[\n4\n]\n:-\nIrving Ezra Segal ... has devoted much of his life to an axiomatic theory of spacetime, called chronometric cosmology\n(\nCC\n)\n, which is generally ignored by astrophysicists. The axioms are properties of\nMinkowski\nspacetime M' and admit only one other model M which can briefly be described as the supposedly discredited cosmological model known as the\nEinstein\nuniverse first proposed by\nEinstein\nin\n1917\n. CC assumes special relativity\n(\nSR\n)\nas a local theory inasmuch as this can be identified with M'. Otherwise CC does not assume general relativity\n(\nGR\n)\nbut is compatible with it. Hence Segal's approach to M is quite unlike that of\nEinstein\n.\nThe papers which he wrote developing this theory include\nA variant of special relativity and long-distance astronomy\n(1974)\nand\nTheoretical foundations of the chronometric cosmology\n(1976)\n. He set out his theory of chronometric cosmology in detail in his\n1976\nbook\nMathematical Cosmology and Extragalactic Astronomy\n. He wrote, both in the\n1974\npaper and in the Preface to the book:-\nThe broad acceptance of the expansion of the universe as a physically real phenomenon has been rooted in part in the apparent lack of an alternative explanation of the red shift. Since its discovery more than a half-century ago, many new observational phenomena have been uncovered, of which the microwave background radiation and the quasars appear to be particularly fundamental and striking. Nevertheless there seem to have been few attempts to rework the foundations of cosmology in a way which might tie together these phenomena in a scientifically more economical way. This is probably due more to the momentum of the theoretical studies based on the expansion theory than to its agreement with observation, which has been quite limited and increasingly equivocal.\nSegal's theory, which is a variant of special relativity, is based on the idea that there are two kinds of time. Segal wrote:-\nThe key point is that time and its conjugate variable, energy, are fundamentally different in the\nEinstein\nUniverse from the conventional time and energy in the local flat\nMinkowski\nspace that approximates the\nEinstein\nUniverse at the point of observation.\nOne might think that experimental evidence would allow one to see if Segal is right but, as he pointed out in the first of the two papers mentioned above, the two coordinate systems:-\n... deviate by less than one part in\n1\n0\n15\n10^{15}\n1\n0\n1\n5\nout to distances of\n1\nlightyear, or of less than\n1\npart in\n1\n0\n6\n10^{6}\n1\n0\n6\nout to galactic distances. There is no apparent means to detect such differences in classical observations.\nSegal's theory is opposed to the big bang theory and\nHubble\n's law for the expansion of the universe does not hold in Segal's theory. He discussed redshift data, which he claimed supported his theory, in papers such as\nThe nature of the redshift and directly observed quasar statistics\n(1991)\nand\nThe redshift-distance relation\n(1993)\n. Segal continued to argue for his model of the universe after he retired as Professor of Mathematics at Massachusetts Institute of Technology in\n1989\n. As Aubert Daigneault and Arturo Sangalli write\n[\n5\n]\n:-\nSegal never let up in his crusade against the expansionary theory, alternating sound scientific arguments with emotional tirades.\nAfter Segal's marriage to Osa ended in\n1977\n: she married\nSaunders Mac Lane\nin\n1986\nand Segal married Martha Fox in\n1985\n. Irving and Martha Segal had a daughter Miriam Elizabeth. In\n[\n1\n]\nJohn Baez, who was a Ph.D. student of Segal's in the\n1980\ns, paints a picture of Segal at this time:-\nHe was always impeccably dressed in a suit, he wore a goatee shaved short in a no-nonsense sort of way, and he made up for his lack of height by an erect posture and commanding manner. ... Segal's office was a cozy, lived-in place, cluttered with decades of accumulated papers. He had a couch where sometimes he would take short naps. He also made coffee in his office, refusing to touch the stuff served in the math department lounge. He took coffee very seriously, grinding the beans in his office, using only distilled water, and heating it to a precisely optimized temperature.\n(\nHe claimed to have done a study to determine this optimal temperature.\n)\nHe often let me work on his computer while he worked at his desk or typewriter. Sometimes when he wanted to prove a theorem he made a great show of setting a kitchen timer, allowing himself no more than\n30\nminutes to get the job done. This was but one of many ways he emphasized the importance of a businesslike attitude. ... He never slacked off; he often came to the office on weekends, and his retirement seemed not to slow him down in the least. Everyone who knows Segal will recall his inability to do things any way other than his own. He was never one to accept something merely because others did. At various times I recall him making scathing criticisms of all the scientific disciplines in which he engaged.\nHe remained active to the end of his life. In fact he died from cardiovascular disease after collapsing while walking near his home.\nLet us look briefly at some of the books Segal published in addition to\nMathematical Cosmology and Extragalactic Astronomy\n(1976)\nwhich we mentioned above. Before we do, however, let us quote a typical reaction to Segal's work on cosmology as expressed by A H Taub in his review of the\n1976\nbook\n[\n11\n]\n:-\nI do not agree with comments made by Segal about general relativity and its degree of experimental verification. This book has not convinced me that chronometric theory is a replacement for general relativistic cosmology, a branch of a theory which contains\nNewton\n's theory of gravitation as a limiting case and which provides observed corrections to that theory.\nHis\n1963\nbook\nMathematical problems of relativistic physics\nwas a published version of a course of lectures he gave at the\n1960\nSummer Seminar on Applied Mathematics at Boulder, Colorado. He writes in the Preface that it is his:-\n... conviction that quantum field theory is on the verge of becoming mathematically firmly established, an will in fact in a few years be recognised as closely parallel to the analytical theory of functionals over infinite dimensional non-linear manifolds admitting group-invariant differential-geometric structures.\nIn\n1968\n, in collaboration with Ray Kunze, he published\nIntegrals and operators\n. The authors write in the Preface:-\nThis book is intended as a first graduate course in contemporary real analysis. It is focused about integration theory, which we believe is appropriate. We assume that the reader is already familiar with the rudiments of modern mathematics\n(\nby this we mean the most elementary aspects of set theory,\ngeneral topology\n, and algebra, as well as some exposure to rigorous analysis\n)\n. The book has been built around material of maximal current mathematical importance and depth, a technical mastery of which should go hand in hand with an appreciation of the general ideas.\nA second, revised and enlarged, edition of this book was published in\n1978\n. Finally we mention\nIntroduction to algebraic and constructive quantum field theory\n(1992)\nwhich Segal wrote in collaboration with John Baez and Zheng-Fang Zhou. Giuseppina Epifanio writes in a review:-\nThis book is a rigorous treatment of the fundamental mathematical topics in algebraic and analytic quantum field theory. It correlates the mathematical theories with the explanation of the relevant observed phenomena which consist essentially in creation and annihilation of particles and particle-wave duality. The book is addressed to researchers who wish to deepen their understanding of these arguments along the line of advanced mathematical physics; it can be considered as an extended introduction to the theory rather than as a general treatise.\nSegal received many honours for his contributions. He was elected to the\nAmerican Academy of Arts and Sciences\nin\n1971\n, the\nNational Academy of Sciences\nin\n1973\nand to the\nRoyal Danish Academy of Sciences\n. He received the Alexander von Humboldt Research Award in\n1981\n. We have mentioned the Guggenheim Fellowship that he was awarded in\n1947\nbut this was only the first of three Guggenheim Fellowships that he received, the other two being in\n1951\nand\n1967\n."
}