{
  "nome_completo": "Irving John Good",
  "nome_curto": "Irving John Good",
  "ano_nascimento": "1916",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Good/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Radford, Virginia, USA",
  "biografia": "Irving John Good\n, whose name was originally Isidore Jacob Gudak, was known to his friends and colleagues as Jack. His parents were Morris Edward Good\n(1885\n-\n1958)\n(\nalso known by the Yiddish name Moshe Oved\n)\nand Sophia Polikoff. Morris Good was born in Poland at a time when it was part of the Russian Empire, He learnt the trade of a watchmaker before emigrating to England at the age of seventeen. In London he set up an antique jewellery shop. He wrote the autobiography\nVisions and Jewels\n(\nLondon,\n1952)\nunder the name Moshe Oved and is described by his publisher as an:-\n... author, actor, jeweller, Zionist\n[\nand\n]\nalso the founder of the Ben Uri Gallery in London.\nSophia Polikoff was born in Russia and came to London at age eight with her parents. Morris and Sophia met in London and married. Jack Good showed remarkable mathematical talents when he was still a child. For example when he was nearly ten years old he caught diphtheria and was confined to bed for around six weeks. He occupied himself calculating the square root of\n2\nto about\n12\ndecimal places. Quickly realising that the calculation would never terminate, he found rational approximations from\nPell\n's equation\nx\n2\n−\n2\ny\n2\n=\n1\nx^{2} - 2y^{2} = 1\nx\n2\n−\n2\ny\n2\n=\n1\n, discovering this method for himself. He then was able to prove that √\n2\ncould not be rational by discovering for himself the standard '\nreductio ad absurdum\n' proof.\nJack attended Haberdashers' Aske's school in Hampstead from\n1928\nto\n1935\n. He was encouraged by his mathematics teachers to go well beyond what they were teaching the other boys. At the age of thirteen he did the puzzles in\nHenry Dudeney\n's book\nAmusements in Mathematics\nand as a result of one of the problems, he discovered for himself the principle of induction. He continued to read mathematics books, for example when he was older he read Joseph Edward's\nDifferential Calculus with Applications and Numerous Examples\nand\nG H Hardy\n's\nPure Mathematics\n. Good entered Jesus College, Cambridge where he attended lectures by\nA E Ingham\n,\nJ C Burkill\n, F P White and\nG H Hardy\n. His undergraduate tutor was\nL A Pars\nwhom Good described in\n[\n1\n]\nsaying:-\nHe was a splendid mathematician and an excellent tutor. He later became the master of the college and he wrote a very well received book on classical mechanics published after my time. He always had slick proofs, but they were too slick. He taught us quite a bit about complex variables.\nAs an undergraduate Good was extremely shy so, he said\n[\n1\n]\n:-\n... I didn't enjoy life as much as I might have done at that age.\nHe played a lot of chess, particularly with John Francis O'Donovan who played board one for Ireland. Good won the Cambridgeshire Chess Championship in\n1939\n. After being awarded a B.A. in\n1938\nhe went on to do research, supervised first by\nA S Besicovitch\nand then by\nG H Hardy\n. He was awarded a Smith's Prize in\n1940\nfor his essay on fractional dimensions of sets of simple\ncontinued fractions\n, and he received his doctorate in\n1941\nfor his thesis\nThe topological concept of partial dimension based on the ideas of Henri Lebesgue\n. His first publications appeared at this time:\nThe approximate local monotony of measurable functions\n(1940)\n,\nThe fractional dimensional theory of continued fractions\n(1941)\n, and\nNote on the summation of a classical divergent series\n(1941)\n.\nBy this time World War II had been in progress for some considerable time but as a mathematician Good had not been called up but put on the reserve list. He was given the choice of working on radar or at Bletchley Park and chose to work at Bletchley. One of those who interviewed him for the position at Bletchley was\nHugh Alexander\n, who had twice been British Chess Champion and whom Good knew, having played chess with him.\nHugh Alexander\nbecame his boss at Bletchley when he took up his appointment in May\n1941\n. Good said\n[\n1\n]\n:-\nBletchley Park liked chess players - they believed that chess players and mathematicians had an aptitude for cryptanalysis. Hugh's closest friend was probably Stuart Milner-Barry, another chess master. I met him at a chess match a week or two before going to Bletchley, and I asked \"Are you working on German ciphers?\" and he said \"No, my address is Room\n47\n, Foreign Office,\" but when I arrived at Bletchley Park I found, sure enough, that he was working on German ciphers.\nAt first Good worked in Hut\n8\nheaded by\nAlan Turing\nbut after a year\nTuring\nmoved to a different area and\nHugh Alexander\nbecame head of Hut\n8\n. In\n1943\nGood moved to the \"Newmanry\", working under\nMax Newman\n. He also worked with Donald Michie and later was joined by\nHenry Whitehead\n[\n5\n]\n:-\nIn\n1943\nGood was one of a small group who helped specify Mark\n2\nof a large-scale\n(\nclassified\n)\nbinary electronic digital computer called Colossus. Colossus was the first large-scale digital computer but not quite general-purpose. ... The main users at first were\nNewman\n, Michie and Good, and some months later about twenty mathematicians. Good was a main user and produced more than half the theory for the use of the Colossi.\nGood described other aspects of life at Bletchley Park\n[\n1\n]\n:-\nI played chess and Go and had intellectual and mathematical discussions with\nAlan Turing\nand\nDavid Rees\n. For example,\nTuring\nand I discussed the possibility of machine intelligence and automatic chess.\nAfter the war ended, Good was appointed as a lecturer in Pure Mathematics at the University of Manchester working for\nMax Newman\nwho had been appointed as professor. While at Manchester, Good was also involved in the project to develop an electronic computer. He remained there until\n1948\nwhen he took up a position at GCHQ\n(\nGovernment Communications Headquarters\n)\n. During his years at Manchester he began publishing again having published little while working at Bletchley Park. For example:\nOn the regularity of a general method of summation\n(1946)\n,\nNormal recurring decimals\n(1946)\n,\nA note on positive determinants\n(1947)\n, and\n(\nwith\nGerd Edzard Harry Reuter\n)\nBounded integral transforms\n(1948)\n.\nOne reason for Good leaving Manchester was that his book\nProbability and the Weighing of Evidence\nhad been rejected by a publisher. However it was accepted by Charles Griffin & Co., Ltd., London and appeared in\n1950\n. A H Copeland begins his review of the book as follows:-\nThis book is concerned with the foundations of the\ntheory of probability\nand an analysis of scientific inductive reasoning. The author produces rather convincing evidence to support the contention that every application of the theory of probability is based on some probability which is subjectively estimated. He develops a subjective theory in which probability is interpreted as a degree of belief depending on the state of mind of the individual doing the believing. For a body of beliefs to be reasonable the degrees of belief are required to possess a partial order which is invariant under changes in state of mind. Moreover when an individual assigns numerical probabilities to his beliefs then the partial order of the degrees of belief must agree with the numerical order of probabilities.\nHe ends with the comment:-\nThis book is interesting reading whether or not one agrees with the author. It is a significant contribution to a field in which contributions are badly needed.\nGood worked at GCHQ from\n1948\nuntil\n1959\n. During this time he spent the summer of\n1955\nas a Visiting Research Associate Professor at Princeton and during\n1958\n-\n59\nworked for a few weeks as a consultant to IBM. During his years at GCHQ Good continued to publish papers such as\nRational decisions\n(1952)\nwhich,\nJimmie Savage\nwrites:-\n... deals first with the relationship between the theory of probability and the theory of rational behaviour. A method is then suggested for encouraging people to make accurate probability estimates, a connection with the theory of information being mentioned.\nExamples of his many papers published during this time are:\nConjectures concerning the Mersenne numbers\n(1955)\n,\nThe likelihood ratio test for Markoff chains\n(1955)\n, and\nSome terminology and notation in information theory\n(1956)\n. He continued to play chess at a very high level being runner-up in the West of England Chess Championship of\n1958\n. In\n1959\nGood resigned from his position at GCHQ when offered a chair at the University of Chicago. However, he changed his mind, deciding not to accept the position. After working for IBM in the United States for a few weeks, he was then appointed to the Admiralty Research Laboratory in England where he worked for three years until\n1962\n. At that time he returned to the United States and worked at the Communications Research Division of the Institute for Defense Analysis for two years. During this time he worked on writing the book\nThe estimation of probabilities. An essay on modern Bayesian methods\nwhich was published in\n1965\n.\nJimmie Savage\nwrote an interesting review which tells us much about Good's approach to probability:-\nThis book reviews, from the author's provocative and unusual viewpoints, the general and pervasive statistical problem of estimating probabilities from data too scant to permit the usual large-sample employment of success ratios and standard deviations inferred from them. Perhaps problems of estimating a single probability from scant data could be discounted as academic. But, as the author emphasizes, science and ordinary life constantly confront us with such problems as estimation of the probability associated with one of thousands or millions of entries in a contingency table on the basis of data, which, though absolutely extensive, may involve far fewer observations than there are entries in the table. Such problems are hard, but are generally felt to be important and not insurmountable. They can, however, be met only by exploring some sort of hypotheses of analogy or regularity. There are many different hypotheses that might be entertained, depending on the particular structure and context of the problem. The author has heretofore, and in this monograph, made a great diversity of attacks on scant-data problems, which he sees as not only important in themselves, but as a challenge to one's philosophy of statistics. His own present philosophy is an eclectic one in which subjective, logical, and frequency probabilities are all held to be real and pertinent to statistics. It emphasizes the impossibility of perfection: \"In our theories, we rightly search for unification, but real life is both complicated and short, and we make no mockery of honest adhockery\"\nIn\n1964\nGood returned to England, and he also returned to the academic life, when he accepted an offer from\nJohn Hammersley\nof a three-year appointment as a Senior Research Fellow at Trinity College, Oxford, and at the Atlas Computer Laboratory. The fellowship was funded by the Science Research Council. During this time he published\nSpeculations Concerning the First Ultraintelligent Machine\n(1965)\n. In this he wrote:-\nLet an ultraintelligent machine be defined as a machine that can far surpass all the intellectual activities of any man however clever. Since the design of machines is one of these intellectual activities, an ultraintelligent machine could design even better machines; there would then unquestionably be an 'intelligence explosion,' and the intelligence of man would be left far behind. Thus the first ultraintelligent machine is the last invention that man need ever make.\nAt the end of the three-year fellowship at Oxford, in July\n1967\n, he took up an appointment as Research Professor of Statistics at Virginia Polytechnic Institute and State University. He said\n[\n1\n]\n:-\nI arrived in Blacksburg in the seventh hour of the seventh day of the seventh month of year seven of the seventh decade, and I was put in apartment\n7\nof block\n7\nof Terrace View Apartments, all by chance. I seem to have had more than my fair share of coincidences.\nIn November\n1969\nhe was made a University Distinguished Professor and remained at Virginia Polytechnic Institute throughout the rest of his career. We mention two further books:\n(\njointly with David B Osteyee\n)\nInformation, weight of evidence, the singularity between probability measures and signal detection\n(1974)\nand\nGood thinking. The foundations of probability and its applications\n(1983)\n. This last mentioned book collects together many of Good's more philosophical and less mathematical papers. In a review, D V Lindley writes:-\nIn the introduction the author says: \"clear reasoning about many important practical and philosophical questions is impossible except in terms of probability\". The thinking of the title is concerned with the relationship between mathematics and the real world; it is about \"applicable philosophy\". Mathematicians, quite properly, concentrate on the manipulative aspect of the subject. The author, in this book, is interested in how the results of those manipulations in the probability calculus can be used in practical circumstances. Thus, to a mathematician, a probability is a real number: the author is concerned with how that number can be found. Those who agree with the quote that begins this paragraph will find this book important. Here we have a marvellous opportunity to read what one of the major thinkers on probability has to say about many topics.\nGood retired and was made Professor Emeritus in July\n1994\n. Throughout his career he received a large number of honours for his remarkable contributions. We list only a few: Outstanding Educators of America\n(1970)\n, Horsley Prize\n(\nVirginia Academy of Science\n)\n(\nshared with his student R A Gaskins\n)\n(1972)\n, Member of\nNew York Academy of Sciences\n(1974)\n, Fellow of\nAmerican Academy of Arts and Sciences\n(8\nMay\n1985)\n, Honorary Member of the International Statistical Institute\n(1990)\n, Fellow of Virginia Academy of Science\n(1993)\n, International Order of Merit\n(1993)\n, Computer Pioneer Award\n(\nMedal\n)\nfrom the Computer Society of IEEE\n(1998)\n, American Medal of Honor\n(2002)\n, Congressional Medal of Excellence\n(2004)\n, and Honorary Fellow of the\nRoyal Statistical Society\n(2004)\n.\nGood died of natural causes at the age of\n92\n. A memorial service was held on\n19\nApril\n2009\nat the Blacksburg Jewish Community Center in Blacksburg, Virginia."
}