{
  "nome_completo": "Isadore Manuel Singer",
  "nome_curto": "Isadore Singer",
  "ano_nascimento": "1924",
  "ano_morte": "2021",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Singer/",
  "lugar_nascimento": "Detroit, Michigan, USA",
  "lugar_morte": "Boxborough, Massachusetts, USA",
  "biografia": "Isadore Singer\nis known as\nIs\nor\nIz.\nHis parents, Simon Singer and Freda Rose, were Polish. They emigrated to Toronto, Canada, in\n1917\nand married in that city before moving to Detroit, Michigan. Isadore enjoyed both science and reading while at school but when he entered the University of Michigan in September\n1941\nhe decided to study physics rather than English literature. Because of World War II, courses were compressed and he graduated with a B.S. in January\n1944\n. He then spent three years in the U.S. Army Signal Corps. After initial training, Singer was sent to the Philippines to run a Signal Corps school. While there he spent the evenings preparing himself for studying physics at the University of Chicago. In particular he studied group theory and\ndifferential geometry\nrealising the importance of having a strong background in mathematics.\nSinger entered the University of Chicago in January\n1947\n, still intending to undertake research in physics. However, still thinking that he would be in a better position to make advances in physics if he had a strong mathematical background, he took a Master's degree in mathematics. He was awarded an M.S. in\n1948\nbut by this time was so excited by mathematics that he decided to continue with research in that topic. He was awarded a Ph.D. in\n1950\n. His thesis advisor at Chicago was\nIrving Segal\nand his thesis was entitled\nLie Algebras of Unbounded Operators\n. R S Doran writes:-\nAt the time the department\n[\nat Chicago\n]\nwas under the visionary leadership of\nMarshall Stone\n, who had assembled one of the finest mathematical faculties in the world. Senior members among this group included\nS S Chern\n,\nS Mac Lane\n,\nA Weil\n, and\nA Zygmund\n.\nIrving Kaplansky\n,\nIrving Segal\n, and\nPaul Halmos\nwere active young researchers in the department with interests, among many other things, in operator theory and operator algebras. In addition, a large number of distinguished visitors and extraordinary graduate students came to Chicago to study with this illustrious faculty. This is the exciting initial environment underlying the work\n[\nSinger carried out\n]\n.\nAfter the award of his doctorate, Singer was appointed C L E Moore Instructor at the Massachusetts Institute of Technology in\n1950\n. After two years at MIT he was appointed as an Assistant Professor of Mathematics at the University of California, Los Angeles. In\n1954\nhe went to the Columbia University where he spent the academic year\n1954\n-\n55\nas a Visiting Assistant Professor. The next academic year was also sent in a visiting position, this time at the Institute for Advanced Study at Princeton. His publications in these early years of his career include:\n(\nwith\nRichard V Kadison\n)\nSome remarks on representations of connected groups\n(1952)\n;\nUniformly continuous representations of Lie groups\n(1952)\n;\n(\nwith Warren Ambrose\n)\nA theorem on holonomy\n(1953)\n;\n(\nwith Richard Arens\n)\nFunction values as boundary integrals\n(1954)\n.\nIn\n1953\nKaplansky\nasked Singer what derivations the algebra of continuous complex-valued functions on a compact\nHausdorff\nspace possessed. Singer had answered the question by the following day, showing the answer was\n0\n, and this led to considerable work on the topic including further work by Singer, jointly with J Wermer, published in the paper\nDerivations on commutative normed algebras\n(1955)\nin which they showed that all bounded derivations on a semisimple commutative normed algebra are\n0\n.\nSinger returned to the Massachusetts Institute of Technology in\n1954\nwhere he was appointed as an Assistant Professor. He was promoted to Associate Professor in\n1958\n, and then to full professor in\n1959\n. In\n1961\nhe married Sheila Ruff and they had a daughter Natascha Singer\n(\nwho is a reporter for the NYTimes\n)\n. That marriage broke up in the mid\n70\n's and eventually he married Rosemarie and they had two daughters, Emily and Annabelle, in Berkeley. He was named\nNorbert Wiener\nProfessor of Mathematics at MIT in\n1970\n. In\n1977\nSinger went to the University of California at Berkeley where he spent two years as a Visiting Professor. Offered a permanent post at Berkeley, he resigned from MIT in\n1979\ntaking up the professorship at Berkeley. He was named Miller Professor at Berkeley in\n1982\nbut left in the following year to return to MIT where he was named John D MacArthur Professor of Mathematics. He was appointed as an Institute Professor in\n1987\n.\nDoran writes:-\nSinger is justifiably famous among mathematicians for his deep and spectacular work in geometry, analysis, and topology, culminating in the\nAtiyah\n-Singer Index theorem and its many ramifications in modern mathematics and quantum physics.\nIn the citation for the Steele Prize for Lifetime Achievement which Singer received in\n2001\n, his work on the\nAtiyah\n-Singer Index theorem is highlighted\n[\n15\n]\n:-\nSinger's series of five papers with\nMichael F Atiyah\non the Index Theorem for elliptic operators\n(\nwhich appeared in\n1968\n-\n71)\nand his three papers with\nAtiyah\nand\nV K Patodi\non the Index Theorem for manifolds with boundary\n(\nwhich appeared in\n1975\n-\n76)\nare among the great classics of global analysis. They have spawned many developments in differential geometry,\ndifferential topology\n, and analysis ...\nIn his reply to receiving the Steele Prize, Singer spoke of his collaboration with Michael\nAtiyah\n:-\nMy collaboration with\nSir Michael Atiyah\nfor more than twenty years has been very exciting, and our work continues to have great impact. Sir Michael is a remarkable human being who - mathematics aside - has devoted much time and energy in the support of science throughout the world. I've been fortunate in having many collaborators in mathematics and physics with whom I have enjoyed working and who have become close friends. It is a pleasure to acknowledge them, over thirty in number - too many to list here.\nThe citation also mentions other outstanding contributions by Singer:-\nHowever,\n[\nthe Index Theorem\n]\nrepresents only a small part of his contributions to geometry and analysis. Other significant contributions to geometry were his work with D B Ray on analytic torsion, the precursor of much modern work on \"determinant\" invariants in geometry, and an influential textbook joint with J A Thorpe, Lecture Notes on Elementary Topology and Geometry .... Moreover, in addition to his work in pure mathematics, Singer has laboured for two decades to bring together mathematicians and theoretical physicists. This has been not simply a matter of interpersonal relations and seminar talks, but has entailed a long effort to understand, rework, and make available to mathematicians the deepest results of modern theoretical physics. This renaissance of serious interaction between mathematicians and physicists, which dates from the mid-\n1970\ns, has had a dramatic effect on mathematics, and Singer has played a major role in this development.\nSinger has been honoured with election to the\nNational Academy of Sciences\nand to the\nAmerican Academy of Arts and Sciences\n. Among the many awards which Singer has received, in addition to the Steele Prize, we mention the\nBôcher\nPrize Memorial Prize from the\nAmerican Mathematical Society\n(1969)\n, the\nEugene Wigner\nMedal\n(1988)\n, the National Medal of Science\n(1983)\n, the Award for Distinguished Public Service from the\nAmerican Mathematical Society\n(1992)\n, the\nAbel\nPrize\n(2004)\n, and the James Rhyne Killian Faculty Achievement Award\n(2005)\n. He served on the Council of the\nNational Academy of Sciences\n, the Governing Board of the National Research Council, and the White House Science Council. Singer was vice president of the\nAmerican Mathematical Society\nduring\n1970\n-\n72\n.\nThe\n2004\nAbel Prize was a joint award to\nAtiyah\nand Singer:-\n... for their discovery and proof of the index theorem, bringing together topology, geometry and analysis, and their outstanding role in building new bridges between mathematics and theoretical physics.\nTeaching has also played a large role in Singer's life. He said\n[\n15\n]\n:-\nFor me the classroom is an important counterpart to research. I enjoy teaching undergraduates at all levels, and I have a host of graduate students, many of whom have ended up teaching me more than I have taught them.\nHis liking for teaching \"at all levels\" was emphasised in the citation for the Killian Award\n[\n4\n]\n:-\nHe is perhaps the only American mathematician to hold a Distinguished University Professorship who regularly teaches ordinary\n(\nas opposed to Honours\n)\nfirst semester calculus.\nAs to interests outside mathematics, Singer list literature, hiking and tennis. He said\n[\n13\n]\n:-\nI love to play tennis, and I try to do so two or three times a week. That refreshes me, and I think that it has helped me work hard in mathematics all these years."
}