{
  "nome_completo": "Issai Schur",
  "nome_curto": "Issai Schur",
  "ano_nascimento": "1875",
  "ano_morte": "1941",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schur/",
  "lugar_nascimento": "Mogilev, Russian Empire (now Belarus)",
  "lugar_morte": "Tel Aviv, British Mandate for Palestine (now Israel)",
  "biografia": "Although\nIssai Schur\nwas born in Mogilev on the Dnieper, he spoke German without a trace of an accent, and nobody even guessed that it was not his first language. He went to Latvia at the age of\n13\nand there he attended the\nGymnasium\nin Libau, now called Liepaja.\nIn\n1894\nSchur entered the University of Berlin to read mathematics and physics.\nFrobenius\nwas one of his teachers and he was to greatly influence Schur and later to direct his doctoral studies.\nFrobenius\nand\nBurnside\nhad been the two main founders of the\ntheory of representations of groups\nas\ngroups\nof\nmatrices\n. This theory proved a very powerful tool in the study of groups and Schur was to learn the foundations of this subject from\nFrobenius\n. Schur then made major steps forward, both in work of his own and work done in collaboration with\nFrobenius\n.\nIn\n1901\nSchur obtained his doctorate with a thesis which examined rational representations of the general linear group over the complex field. Functions which Schur introduced in his thesis are today called\nS\nS\nS\n-functions, where the\nS\nS\nS\nstands for Schur. Interest in the results of Schur's thesis continues today; for example\nJ A Green\npublished an account of these results in a modern setting in\n1980\n.\nIn\n1903\nSchur became a lecturer at Berlin University and then, from\n1911\nuntil\n1916\n, he held a professorship in mathematics at the University of Bonn. He returned to Berlin in\n1916\nand there he built his famous school and spent most of the rest of his life there. He was promoted to full professor in Berlin in\n1919\n, three years after he returned there, and he held this chair until he was dismissed by the Nazis in\n1935\n.\nSchur is mainly known for his fundamental work on the representation theory of groups but he also worked in\nnumber theory\n, analysis and other topics described below. Between\n1904\nand\n1907\nhe worked on projective representations of groups and\ngroup characters\n. One of the most fundamental results which he discovered at this time is today called Schur's Lemma.\nIn a series of papers he introduced the concept now known as the 'Schur multiplier'. This is an extremely important abstract concept which arose from the concrete problems that Schur was studying. Much later, in\n1949\n,\nEilenberg\nand\nMac Lane\ndefined\ncohomology groups\n. They were unaware at that time that the second cohomology group with coefficients in the nonzero complex numbers is the Schur multiplier, and therefore that Schur had made some of the first steps forty years earlier.\nAround\n1914\nSchur's interest in representations of groups was put to one side while he worked on other topics but, around\n1925\n, developments in theoretical physics showed that group representations were of fundamental importance in that subject. Schur returned to work on representation theory with renewed vigour and he was able to complete the programme of research begun in his doctoral dissertation and give a complete description of the rational representations of the general linear group.\nSchur was also interested in reducibility, location of roots and the construction of the\nGalois group\nof classes of polynomials such as\nLaguerre\nand\nHermite\npolynomials. In\n[\n1\n]\nan indication of the other topics that Schur worked on is given:-\nFirst there was pure group theory, in which Schur adopted the surprising approach of proving without the aid of characters, theorems that had previously been demonstrated only by that means.\nSecond, he worked in the field of matrices.\nThird, he handled algebraic equations, sometimes proceeding to the evaluation of roots, and sometimes treating the so-called equation without affect, that is, with symmetric Galois groups. He was also the first to give examples of equations with\nalternating\nGalois groups.\nFourth, he worked in number theory;\nFifth, in divergent series;\nSixth, in\nintegral equations\n;\nand lastly in function theory.\nThe school which Schur built at Berlin was of major importance not only for the representation theory of groups but, as indicated above, for other areas of mathematics. The school partly worked through the Schur's lecturing\n[\n7\n]\n:-\n...there are\n[\nmany\n]\nmathematicians who went to Schur's lectures and seminars in Berlin and were strongly influenced by him...\nThe school also worked with collaborations\n[\n1\n]\n:-\nA lively interchange with many colleagues led Schur to contribute important memoirs .... Some of these were published as collaborations with other authors, although publications with dual authorship were almost unheard of at that time.\nThis school was certainly the most coherent and influential group of mathematicians in Berlin, and among the most important in all of Germany. Schur's charismatic leadership inspired those around him to push forward with research on group representations. Schur's own impressive contributions were extended by his students in a number of different directions. They worked on topics such as\nsoluble groups\n, combinatorics, and matrix theory.\nAmong the students who completed their doctorates under Schur were\nRichard Brauer\n,\nAlfred Brauer\n(\nRichard Brauer\n's brother\n)\n,\nRobert Frucht\n,\nBernhard Neumann\n,\nRichard Rado\n, and\nHelmut Wielandt\n. There were others who worked under Schur such as\nKurt Hirsch\n,\nWalter Ledermann\n,\nHanna Neumann\nand\nMenahem Max Schiffer\n.\nLedermann\nin\n[\n7\n]\ndescribes Schur as a teacher:-\nSchur was a superb lecturer. His lectures were meticulously prepared...\n[\nand\n]\nwere exceedingly popular. I remember attending his algebra course which was held in a lecture theatre filled with about\n400\nstudents. Sometimes, when I had to be content with a seat at the back of the lecture theatre, I used a pair of opera glasses to get at least a glimpse of the speaker.\nIn\n1922\nSchur was elected to the\nBerlin Academy\n, proposed by\nPlanck\n, the secretary of the Academy.\nPlanck\n's address which listed Schur's outstanding achievements had been written by\nFrobenius\n, at least five years earlier, as\nFrobenius\ndied in\n1917\n.\nFrom\n1933\nevents in Germany made Schur's life increasingly difficult.\nHirsch\nspoke of the events of\n1\nApril\n1933\nwhen posters carried the message 'Germans defend yourselves against jewish atrocity propaganda : buy only at German shops':-\nThat was the so-called 'Boycott Day', the day on which Jewish shops were boycotted and Jewish professors and lecturers were not allowed to enter the university. Everybody who was there had to make a little speech about the rejuvenation of Germany etc. And\nBieberbach\ndid this quite nicely and then he said 'A drop of remorse falls into my joy because my dear friend and colleague Schur is not allowed to be among us today'.\nOn\n7\nApril\n1933\nthe Nazis passed a law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent, with exemptions for participants in World War I and pre-war officials. Schur had held an appointment before World War I which should have qualified him as a civil servant, but the facts were not allowed to get in the way, and he was 'retired'.\nSchiffer\nwrote\n[\n8\n]\n:-\nWhen Schur's lectures were cancelled there was an outcry among the students and professors, for Schur was respected and very well liked. The next day\nErhard Schmidt\nstarted his lecture with a protest against this dismissal and even\nBieberbach\n, who later made himself a shameful reputation as a Nazi, came out in Schur's defence. Schur went on quietly with his work on algebra at home.\nSchur saw himself as a German, not a Jew, and could not comprehend the persecution and humiliation he suffered under the Nazis. In fact Schur's dismissal was revoked and he was able to carry out some of his duties for a while. By November\n1933\nwhen\nWalter Ledermann\ntook his\nStaatsexamen\nhe was examined by Schur together with\nBieberbach\nwho was wearing Nazi uniform.\nThere were invitations to Schur to go to the United States and to Britain but he declined them all, unable to understand how a German was not welcome in Germany. For example\nLedermann\nobtained a scholarship to go to St Andrews in Scotland in the spring of\n1934\nand he tried unsuccessfully to persuade Schur to join him in St Andrews.\nSchur continued to suffer the humiliation that was heaped on him.\nSchiffer\nrecalls an event in\n[\n8\n]\nrelating to Schur's\n60\nth\nbirthday on\n10\nJanuary\n1935\n:-\nSchur told me that the only person at the Mathematical Institute in Berlin who was kind to him was\nGrunsky\n, then a young lecturer. Long after the war, I talked to\nGrunsky\nabout that remark and he literally started to cry: \"You know what I did? I sent him a postcard to congratulate him on his sixtieth birthday. I admired him so much and was very respectful in that card. How lonely he must have been to remember such a small thing.\"\nLater in\n1935\nSchur was dismissed from his chair in Berlin but he continued to work there suffering great hardship and difficulties.\nAlfred Brauer\nwrites in\n[\n6\n]\n:-\nWhen\nLandau\ndied in February\n1938\n, Schur was supposed to give an address at his funeral. For that reason he was in need of some mathematical details from the literature. He asked me to help him in this matter. Of course I was not allowed to use the library of the mathematical institute which I had built up over many years. Finally I got an exemption for a week and could use the library of the Prussian Staatsbibliothek for a fee. ... So I could answer at least some of Schur's questions.\nPressure was put on Schur to resign from the\nBerlin Academy\nto which he had been honoured to be elected in\n1922\n. On\n29\nMarch\n1938\nBieberbach\nwrote below Schur's signature on a document of the\nBerlin Academy\n:-\nI find it surprising that Jews are still members of academic commissions.\nJust over a week later, on\n7\nApril\n1938\n, Schur resigned from Commissions of the Academy. However, the pressure on him continued and later that year he resigned completely from the Academy.\nSchur left Germany for Palestine in\n1939\n, broken in mind and body, having the final humiliation of being forced to find a sponsor to pay the 'Reichs flight tax' to allow him to leave Germany. Without sufficient funds to live in Palestine he was forced to sell his beloved academic books to the Institute for Advanced Study in Princeton. He died two years later on his\n66\nth\nbirthday."
}