{
  "nome_completo": "Ivan Vidav",
  "nome_curto": "Ivan Vidav",
  "ano_nascimento": "1918",
  "ano_morte": "2015",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vidav/",
  "lugar_nascimento": "Opcine, near Trieste, Italy",
  "lugar_morte": "Ljubljana, Slovenia",
  "biografia": "Ivan Vidav\nwas born in a village named Opcine\n(\nItalian Villa Opicina\n)\n, near Trieste, which at the time of his birth was in the Austro-Hungarian Empire but, soon after the end of World War I, it came under the rule of the Kingdom of Italy. Ivan was the youngest of four sons of a small-time farmer, also called Ivan Vidav, and his wife Josipina Sosic. Josipina had first married Ivan's uncle before her marriage to Ivan. Ivan junior, the subject of this biography, also had a step-sister who was fourteen years his elder.\nIn\n1920\nthe Vidav family moved to the vicinity of Maribor in Yugoslavia. Because of poor management of their small farm in the difficult conditions created by the worldwide economic crisis at the end of the\n1920\ns, the family found itself in a very bad material situation just when Ivan went to secondary school. He was studying at the grammar school in Maribor from\n1929\nuntil\n1937\n. In the higher grades he tutored other pupils in mathematics in order to earn a living and even earned enough to help support his family. His family suffered heavy losses during World War II; only his mother, despite being confined in a Nazi concentration camp, Ivan, and his step-sister survived.\nIn\n1937\nVidav began to study mathematics at the University of Ljubljana. The leading professor there was\nJosip Plemelj\nwho was renowned for solving the\nRiemann\n-\nHilbert\nproblem\n(\ni.e. the\n21\nst  problem on\nHilbert\n's famous list\n)\n. The professor soon realized the outstanding mathematical ability of his student. They often discussed mathematics of all kinds and on one occasion, after his lecture in\n1940\n,\nPlemelj\nmentioned to Vidav an open problem concerning homogeneous linear differential equations. Then, during the summer holidays of\n1940\n, the\n22\nyear old Vidav solved the problem and passed the solution to professor\nPlemelj\nat their first meeting at the beginning of the autumn semester. We can see\nPlemelj\n's big surprise by quoting his own words:-\nI hadn't ever thought that he would even take the problem into consideration and by no means to be able to succeed. ...  His work identifies and explains fully the various problems in the theory of linear differential equations, problems that intrigued many mathematicians but none was able to penetrate to their core.  ... Every mathematician would be proud to have such a masterpiece among his bibliography. Although this is the first paper of Ivan Vidav, it contains no beginner's deficiency; on the contrary, it has the flavour of a mature mathematician's work.\nThis first original scientific work of Vidav, in which he considered the so-called Fuchsian differential equation with five singular points, became the basis of his dissertation entitled\nThe theorems of Klein in the theory of linear differential equations\n. It is worth mentioning that Vidav was awarded his diploma and the Ph.D. degree\n(\nwith\nPlemelj\nas advisor\n)\nin the same year,\n1941\n, just when the war was spreading to South-East Europe.\nHe studied in Rome in\n1941\n-\n42\n. After the war, in\n1946\n, he became an Assistant Professor and, in\n1853\n, a Full Professor at the University of Ljubljana. At first he continued working on problems in differential equations. For instance, he participated at the\n11\nth\nInternational Congress of Mathematicians at Harvard University in Cambridge, USA, from\n30\nAugust to\n6\nSeptember in\n1950\n, where he gave a short report on his own results on Fuchsian equations with five or six singularities. During his rapid academic ascent in the next few years he made several short visits to Paris, where he met\nSzolem Mandelbrojt\n, who influenced his later research in approximation theory. In this period he published in\nActa Mathematica\nand\nComptes rendues de l'Academie des sciences\n(\nin French\n)\nas well as in\nMathematische Zeitschrift\n(\nin German\n)\nand in some local Yugoslavian journals. For a selection of some of his papers, see\nTHIS LINK\n.\nIn the mid-fifties, he became interested in\nfunctional analysis\n. In this area he contributed to some of the basic notions and results in the theory of\nBanach\nalgebras and C*-algebras. He wrote a fundamental paper on metric characterization of Hermitian elements in a\nBanach\nalgebra, published as\nEine metrische Kennzeichnung der selbstadjungierten Operatoren\nⓉ\n(\nA metric labeling of self-adjoint operators\n)\nin\nMathematische Zeitschrift\nin\n1956\n. The main result is a characterization of C*-algebras among\nBanach\nalgebras, obtained under some additional assumptions which were removed a decade later by E Berkson, B W Glickfeld and T W Palmer\n(\nindependently\n)\n. The final result is called the 'Vidav-Palmer theorem'. Some other notions and results are named after Vidav: a definition of Hermitian elements, a lemma about their numerical range, an involution, and an algebra. In the following years Vidav published further papers on functional analysis, some in German, some in French, and later some in English. Because of his international success in this area he was elected as a member of\nSlovenian Academy of Arts and Sciences\nin\n1962\n.\nIn the mid-sixties, physicists attracted Vidav to consider various problems in neutron transport theory. He published several results on strongly continuous semigroups of operators, connected with the linear\nBoltzmann\nequation\n(\nmostly in\nJournal of Mathematical Analysis and Applications\n)\n, sometimes in cooperation with other mathematicians and physicists. For his work in this applied area of functional analysis he received the most prestigious Slovene scientific award at the time in\n1970\n. He continued to undertake research also on the isometric structure of Banach spaces and on analytic operator functions. During his almost three decades of active mathematical investigations in functional analysis, he became a thesis advisor to sixteen Ph.D. students. He encouraged them to explore several different areas of mathematics.\nVidav became, as a long-time chair, the master architect of the Mathematics Department at the University of Ljubljana after\n1960\n. He was responsible for all major curriculum reforms in the education of young mathematicians in the sixties and the seventies, modernizing the study of mathematics in Ljubljana to become comparable to foreign universities. He initiated many new trends and improvements in the teaching process, including the opening of regular graduate studies in mathematics at the beginning of the seventies. He was often the first and the main lecturer, an excellent one; he never used notes in the classroom. He wrote several textbooks for students of mathematics, e.g. a classic three-volume calculus course\n(\nHigher mathematics\n)\nand standard monographs on algebra, affine and projective geometry, differential geometry, elliptical curves and functions, and several graduate texts on\nBanach\nalgebras,\nC\n∗\nC^{*}\nC\n∗\n-algebras, linear operators in\nBanach spaces\n,\ngroup theory\n, and\nK\nK\nK\n-theory\n(\nall in Slovenian\n)\n. He also wrote several little gems of books popularizing mathematics, e.g.\nSolved and unsolved problems in mathematics\n(\nin Slovenian\n)\n.\nAfter his retirement in\n1986\nhe continued for twenty years still publishing articles in these areas, mostly in mathematical journals in Slovenia, such as\nObzornik za matematiko in fiziko\nⓉ\n(\nSurvey of Mathematics and Physics\n)\nand\nPresek\nⓉ\n(\nIntersection\n)\n. Some of these articles, primarily intended to introduce mathematics to youngsters, contain original mathematical works.\nBesides his scientific and pedagogical obligations he was an active member of the Society of Mathematicians, Physicists and Astronomers of Slovenia from the foundation of the Society, serving as its chairman from\n1951\nto\n1954\n, its vice chairman from\n1955\nto\n1959\n, for many years the organizer of the national competition in mathematics for grammar school pupils, the main editor of several book series published by the Society, and more. He became an honorary member of this Society in\n1988\n. He was also awarded some of the highest academic honours by the University of Ljubljana and also some of the highest state awards in the area of scientific research and developmental activities in Slovenia as well as in former Yugoslavia.\nProfessor Vidav was a leading scientific and moral authority in Slovenian mathematics after World War Two until his retirement. He was a teacher of many generations of students and a master of mathematical writing. Throughout his active life he felt a responsibility for the development of mathematics at the University of Ljubljana and for the whole mathematical community in Slovenia. Moreover, with his high standards and an almost proverbial modesty, he remained a man of strong personal integrity."
}