{
  "nome_completo": "Jack Carl Kiefer",
  "nome_curto": "Jack Kiefer",
  "ano_nascimento": "1924",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kiefer/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "Berkeley, California, USA",
  "biografia": "Jack Kiefer\nwas the son of Carl J Kiefer and Marguerite K Rosenau. He entered the Massachusetts Institute of Technology in\n1942\nbut after one year of study of engineering and economics he left to undertake war work. He served as\n1\nst  Lieutenant in the U.S. Air Force and spent part of the time teaching radar. After a break of three years he returned to MIT in the spring of\n1946\nbut it was not clear at this stage in which area Kiefer wanted to make a career.\nThe theatre was one of Kiefer's passions and he had the opportunity at MIT to become involved in writing, directing and producing plays. MIT put on an annual musical comedy show, the Tech Show, and he produced the\n1947\nshow, then wrote and directed the show in the following year. His economics professor Harold Freeman said\n[\n6\n]\n:-\nI think I was the one to interest him in statistics. If that's true, it was certainly one of the best things I ever did for statistics. By the way, Jack was really torn between show biz and statistics. Statistics won but it was a close thing.\nHe received his B.S. in Electrical Engineering and his M.S. in Economics and Engineering both in June\n1948\n. His Master's thesis\nSequential determination of the maximum of a function\nhad been supervised by Harold Freeman. After graduating Kiefer attended a summer school at Berkeley where courses of lectures were given by Michel Loève and\nAbraham Wald\n. In the autumn he began research for his doctorate in the Department of Mathematical Statistics at Columbia University working under\nAbraham Wald\nand\nJacob Wolfowitz\n. In December\n1950\nWald\ndied and\nWolfowitz\nwas appointed professor of mathematics at Cornell University in\n1951\n. Kiefer moved to Cornell as an instructor in the Department of Mathematics and continued working for his doctorate with\nWolfowitz\n. He received his doctorate from Columbia University in\n1952\nfor his thesis\nContributions to the Theory of Games and Statistical Decision Functions\n.\nAfter Kiefer was awarded his doctorate in\n1952\nhe was promoted at Cornell from an instructor to as assistant professor. After holding this position from\n1952\nto\n1955\nhe was promoted to associate professor, becoming Professor of Mathematics in\n1959\n. Before this, on\n15\nSeptember\n1957\n, he had married Dooley Sciple who had been one of his undergraduate students at Cornell\n[\n6\n]\n:-\nDooley and Jack shared a love of music. Jack aspired at one time to become a proficient pianist. Although he practised conscientiously, he eventually abandoned that goal with reluctance because of other demanding and conflicting interests. Dooley and Jack were devoted parents of two children, Sarah Elizabeth and Daniel Jonathan Baird, with whom they shared their love of music, stamp collecting, and mushroom hunting.\nIn July\n1973\nKiefer was elected the first Horace White Professor at Cornell University, a position he held until\n1979\nwhen he retired and joined the faculty at the University of California at Berkeley.\nKiefer's main research area was the optimal design of experiments, and about half his\n100\npublications dealt with that topic. However he also wrote papers on a whole variety of topics in mathematical statistics including decision theory, inventory theory, stochastic approximation, queuing theory, nonparametric inference, estimation, sequential analysis, and conditional inference. His first paper\nAlmost subminimax and biased minimax procedures\nwritten jointly with his fellow graduate student at Columbia, Peter Frank, was published in\n1951\n. A paper\nSequential minimax search for a maximum\nwhich Kiefer published in the\nProceedings of the American Mathematical Society\nin\n1953\nwas based on his master's thesis. The method of search proposed in the paper, namely the\nFibonacci\nSearch, became a widely used tool.\nLet us note a few other examples of Kiefer's work. In\n1958\nhe published\nOn the nonrandomized optimality and randomized nonoptimality of symmetrical designs\n. He discussed:-\n... various criteria of optimality of experimental designs. Extending rather special results due to\nA Wald\nand S Ehrenfeld he shows that many commonly employed symmetrical designs\n(\nsuch as balanced incomplete block designs, Latin squares,\nYouden\nsquares, etc.\n)\npossess optimum properties among the class of non-randomized designs. He then proceeds to show that, surprisingly, all these optimum results fail to hold if randomized designs are considered.\nIn this paper Kiefer generalised the notions of a balanced incomplete block design and a\nYouden\nsquare, to the balanced block design and generalized\nYouden\nsquare. In a paper\nBalanced block designs and generalized Youden designs. I. Construction\nwhich he published in\n1975\n, he described some methods to construct such designs. Another important paper\nOptimum designs in regression problems\n, which Kiefer wrote in collaboration with\nWolfowitz\n, appeared in\n1959\n. In the same year, while on a research visit to Oxford University, he wrote\nOptimum experimental designs\nwhich was published in the\nJournal of the\nRoyal Statistical Society\n. In the paper he explains that he intends providing:-\n... methods for verifying whether or not given designs satisfy certain optimality criteria, and for comparing designs which satisfy such criteria. ... the approach being in the spirit of\nWald\n's decision theory.\nIn\n1975\nhe published\nOptimal design: variation in structure and performance under change of criterion\nwhich discussed the robustness of designs against a chosen optimality criterion.\nIn\n1980\nKiefer went to China as part of Berkeley's China Exchange Program. He gave eight lectures at Beijing University covering topics such as multivariate analysis, sequential methods, nonparametric estimation, robustness and efficiency of nonparametric methods, fundamentals of experimental design, complete class and regression design, factorial experiment, and nonlinear models, sequential design, and robust design.\nKiefer received many honours. He was a Fellow of the Institute of Mathematical Statistics and the\nAmerican Statistical Association\n, President of the Institute of Mathematical Statistics\n(1969\n-\n70)\n, the\nWald\nlecturer in\n1962\n, and a Guggenheim fellow at Stanford\n(1962\n-\n63)\n. He was elected to the\nAmerican Academy of Arts and Sciences\n(1972)\nand to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1975\n. His fascination with mushrooms from the early\n1960\ns saw him move from amateur status to professional standing as a mycologist. This interest led to him being a member of the Mycological Society of America and the North American Mycological Association. His passion for human rights saw him become a member of the American Civil Liberties Union.\nE L Lehmann, D R Brillinger, and I M Singer, give details of his character in an obituary:-\nJack Kiefer was a gentle man with a great capacity for love and friendship; this was combined, however, with a fierce and sometimes combative determination to uphold the exacting standards he demanded of others, but especially of himself.\nHis collaborator Zvi Galil writes\n(\nsee\n[\n5\n]\n)\n:-\nHaving cooperated with Jack over many years, I can tell you how wonderful it was working with him, and how one learned by doing so ... Jack was unbelievably humble, especially for a man of his stature. He would not hesitate to praise a student by favourably comparing the student's work with his own. He was very kind and considerate and spent a lot of time with his students. ... Jack was very critical. He would fight and not give in for a just cause. But mostly he was critical, probably too critical and demanding, of himself.\nAnother tribute by Bechhofer\n[\n6\n]\npaints the following picture:-\nJack was warm sensitive and sincere - always willing to fight for the causes that he believed in: human rights, civil liberties, the protest against the war in Vietnam. He worked to help Soviet scientists leave Russia, and he and Dooley fought fervently for various environmental causes. ...\nKiefer's suffered for many years from an arthritic hip condition which by\n1971\nsaw him severely disabled. However in that year he underwent an operation to insert artificial joints in both hips. This was a great success and enabled him to resume most of his normal activities. However he was only\n57\nwhen he died of a heart attack not long after he had been appointed as Miller Research Professor at Berkeley. The two volume proceeding\n[\n4\n]\nwas the result of a conference held in his honour. It states in the Preface:-\nMemorial sessions were held in\n[\nhis\n]\nhonour at various meetings of learned societies, as is fitting for scientists of\n[\nhis\n]\nrank. However, for reasons of heart as well as science, we felt that a special tribute should be paid to\n[\nhim\n]\nat Berkeley, where\n[\nhe\n]\nhad so many friends. A meeting was eventually organized. It took place from June\n20\nto July\n1\n,\n1983\n. Jack's friends at Cornell felt similarly. They organized a meeting that took place immediately after the Berkeley conference.\nIn\n1987\n, six years after his death, Kiefer's\nIntroduction to statistical inference\nwas published. This text, edited by Gary Lorden, was based on lecture notes developed by Kiefer for a course in statistical inference he taught at Cornell University:-\nIt presents the central ideas of mathematical statistics as developed by\nNeyman\nand\nWald\nin a decision-theoretic framework, referring to the earlier work of\nFisher\nand others as based on \"intuitive\" considerations and misleading in certain situations.\nLet us end with this tribute from Bechhofer\n[\n6\n]\n:-\nJack was a special human being. There was a friendliness and a charm about him, a lilt to his voice, a twinkle in his eye, a smile that attracted everyone. He was a witty, delightful conversationalist, maintaining long and deep relationships, and was beloved by many. He was honest, and true to his high ideals."
}