{
  "nome_completo": "Jacob Levitzki",
  "nome_curto": "Jacob Levitzki",
  "ano_nascimento": "1904",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Levitzki/",
  "lugar_nascimento": "Kherson, Ukraine",
  "lugar_morte": "Jerusalem, Israel",
  "biografia": "Jacob Levitzki\nlived for the first eight years of his life in Ukraine, at that time part of the Russian Empire. In\n1912\nhis family emigrated to Palestine, and Jacob and his brother Asher were educated there. At this time the country was part of the Ottoman Empire and, of the population of around\n500\n,\n000\n, about\n80\n,\n000\nwere Jews and\n70\n,\n000\nChristians. The family lived in Tel Aviv, at that time a Jewish Community just outside the city of Jaffa. World War I was a difficult time for those in Tel Aviv and, in\n1917\n, the Ottoman authorities evacuated Jews. However, when the war ended in\n1918\n, the Ottomans were defeated and the British took control allowing the inhabitants of Tel Aviv to return to their homes.\nLevitzki was educated at the Herzliya\nGymnasium\nin Tel Aviv, the country's first Hebrew school. It was situated on Herzi Street and the building formed an impressive landmark in the town. It was not mathematics that was Levitzki's favourite school subject but rather he loved chemistry and, after graduating from the Herzliya Gymnasium in\n1922\n, he travelled to Germany intending to read for a degree in chemistry at the University of Göttingen.\nBenjamin Amirà, also known as Binyamin Amirà, was born in\n1896\nin what is now Ukraine and emigrated with his family to Palestine in\n1910\n, two years before the Levitzki family. Like the Levitzki family, the Amirà family lived in Tel Aviv and Benjamin attended the Herzliya Gymnasium. Although Benjamin Amirà was eight years older than Levitzki, the two families were very friendly. After graduating from the Herzliya Gymnasium, Amirà studied mathematics at the University of Geneva. Then Amirà went to the University of Göttingen in\n1921\nto undertake research for his doctorate advised by\nEdmund Landau\n. He was in Göttingen until\n1924\nso, when Levitzki arrived there to study chemistry in\n1922\nhe was pleased to meet up again with Amirà who persuaded him to attend one of\nEmmy Noether\n's lecture courses. Levitzki was captivated by\nNoether\n's mathematics and changed from chemistry to study mathematics from that point on. He continued to undertake research at Göttingen advised by\nEmmy Noether\n(\nand also by\nEdmund Landau\n)\nand was awarded his doctorate in\n1929\nfor his thesis\nÜber vollständig reduzible Ringe und ihre Unterringe\nⓉ\n(\nOn completely reducible rings and sub-rings\n)\n. During his studies at Göttingen he had followed the German tradition and spent one semester at the University of Cologne.\nAfter spending the academic year\n1928\n-\n29\nat the University of Kiel in Germany, Levitzki went to the United States where he was a Sterling Research Fellow at Yale University until\n1931\n. He presented his paper\nOn normal products of algebras\n, written while he was at Yale, to the Society on\n3\nApril\n1931\nand it was published in the following year. Leaving Yale later in\n1931\n, Levitzki returned to Israel where he was appointed to the Hebrew University of Jerusalem. In fact this was a new university set up in the\n1920\ns and he was aware of much of the foundation process since his friend Amirà, and particularly Amirà's supervisor\nEdmund Landau\n, had been closely involved in establishing the Hebrew University of Jerusalem.\nLandau\nwas a member of the advisory committee of the university, delivered the lecture\nSolved and Unsolved Problems in the Elementary Theory of Numbers\nin\n1925\nwhen the University opened.\nLandau\n, with Amirà as his assistant, headed the Institute of Mathematics at the Hebrew University from its opening in\n1927\n.\nEdmund Landau\nhad left Jerusalem and returned to Germany by the time Levitzki took up his appointment at the Hebrew University, but Amirà was continuing to develop the Institute of Mathematics there along the lines that\nLandau\nhad established.\nLet us quote from\n[\n1\n]\nregarding Levitzki's research:-\nThe beginning of his research was in the period when finiteness in algebra was being replaced by chain conditions and the first steps in extending\nWedderburn\nStructure theorems of associative algebras met with the wall of nilpotent elements. It is not surprising that Levitzki's first interest was nilpotent elements and nil subrings. One of his well known result in this area is the nilpotency of the nil subrings of matrix rings and of nil ideals in rings with ascending chain conditions, a result which since has been a source for many generalizations. His work on nilpotent elements played a role in developing the now trivial notion of a rank of a matrix over non-commutative fields and also led to a different notion of rank of elements in I-rings, which was not completely exploited because of his early death.\nThe papers referred to in this quote are all given in our list of Levitzki's papers which we give at\nTHIS LINK\n.\nLevitzki married Charlotte Ascher\n(9\nJune\n1910\n-\n7\nOctober\n1997)\n, the daughter of Max Ascher and Elsa Gabriele Gumpert. Jacob and Charlotte\n(\nknown as Lotte\n)\nLevitzki had a son, Alexander Levitzki, was born on\n13\nAugust\n1940\n. Alexander chose to study chemistry, the subject his father had intended to study before turning to mathematics. Alexander studied at the Hebrew University of Jerusalem and the Wiseman Institute of Science. After a doctorate in Biochemistry and Biophysics and postdoctoral work at Berkeley in California, he joined the faculty of the Wiseman Institute of Science and later the Hebrew University of Jerusalem where he became Professor of Biochemistry.\nThe\nWedderburn\nstructure theorem is a fundamental result proved by\nJoseph Wedderburn\nin his\n1908\npaper\nOn hypercomplex numbers\nwhich appeared in the\nProceedings\nof the\nLondon Mathematical Society\n. In it he showed that every semisimple algebra is a direct sum of simple algebras and that a simple algebra was a matrix algebra over a division ring.\nEmil Artin\n, in\n1927\n, generalised this result\n[\n1\n]\n:-\n... to rings with ascending and descending chain conditions on one-sided ideals left open the problem of necessity of both conditions. Only in\n1938\n-\n39\ndid both Hopkins\n(\nusing left ideals and Levitzki\n(\nwith right ideals\n)\nsimultaneously and independently, in two different parts of the world, prove the now classic structure theorems of rings with the descending chain condition. It was unfortunate for Levitzki that his paper was sent to the editor of a European journal and the situation in Germany and the Second World War prevented his work from being presented to the world until much later.\nIn fact, Levitzki's paper\nOn rings which satisfy the minimum condition for the right-hand ideals\nwas published in\n1939\n. It was reviewed by\nSaunders Mac Lane\nwho wrote:-\nThe generalizations of the\nWedderburn\nstructure theorems for linear algebras lead to the consideration of rings A satisfying a minimal condition for left ideals\n(\nM L I\n)\n; that is, each non-empty set of left ideals contains an ideal properly contained in no other ideal of the set. For these rings the behavior of the nilpotent elements is of major interest. One problem proposed by\nKöthe\n(1930)\nand treated by Levitzki was recently solved by Charles Hopkins, who proved that in an M L I ring any subring consisting only of nilpotent elements is itself nilpotent\n[\nDuke Math. J.\n4\n(1938)\n; Ann. of Math.\n(1939)]\n. The present paper contains a new proof of Hopkins' result\n(\nsubmitted after publication of Hopkins' first paper\n)\n. It contains also certain related theorems; for example, a non-nilpotent M L I ring A is a direct sum of a nilpotent left ideal and certain minimal potent left ideals. ... Levitzki's proof is longer than Hopkins', but will later be applied to further classes of rings.\nThese two reviews almost seem to contradict each other, so we will now quote the note that Levitzki appended to his paper\nOn rings which satisfy the minimum condition for the right-hand ideals:-\nThe present note was sent for publication in October\n1938\n. In December\n1938\na note by Charles Hopkins was published \"Nilrings with minimum condition for admissible left ideals\"\n(\nDuke Math. J.\n4\n(1938)\n,\n664\n-\n667)\nin which some of the main results of the present note are proved by a different method. Nevertheless I trust that the present note might be still of some interest since the method used here can be applied also to other interesting classes of rings as I hope to show in a following communication.\nLevitzki did indeed produce a further generalisation of the\nWedderburn\nstructure theorem in his paper\nOn the radical of a general ring\n(1943)\n.\nSaunders Mac Lane\n, in the above review, mentions questions posed by\nGottfried Köthe\n. Another of these questions was whether the maximal condition on the right ideals of a ring insures the nilpotence of nil-ideals. Levitzki proved this to be the case and indeed proved an even stronger result in his paper\nSolution of a problem of G Koethe\n(1945)\n. Let us note that Koethe was an Austrian mathematician who, like Levitzki, began his university career studying chemistry and changed to mathematics.\nShimshon Avraham Amitsur\n(1921\n-\n1994)\n, the author of\n[\n1\n]\n, was a doctoral student of Levitzki's at the Hebrew University being awarded a Ph.D. in\n1950\n. He wrote about Levitzki as a lecturer in\n[\n1\n]\n:-\nLevitzki was known as an excellent teacher, and he had a feeling for advances of modern mathematics. This led him to introduce vector spaces, modules and linear transformation in the first year courses\n(\nundergraduate\n)\nin algebra at the Hebrew University as early as\n1946\n. His students heard him saying that these notions and notations will prevail in modern mathematics and the young generation of mathematicians must encounter them as early as possible - and this he turned into practice.\nIn\n1954\nLevitzki and Amitsur were each winners of the first Israel Prize for Exact Sciences:-\n... for their work on the laws of noncommutative rings.\nLet us record that Levitzki's son, Alexander, won the Israel Prize for Life Sciences in\n1990\n. Alexander Levitzki established the Levitzki Prize in memory of his parents Jacob and Charlotte Levitzki. The prize is awarded by the Israel Mathematical Union every two years:-\n... to a young Israeli mathematician for research in algebra or related areas.\nThe first award was made in\n2009\nto Nir Avni of the Hebrew University."
}