{
  "nome_completo": "Jacques Cassini",
  "nome_curto": "Jacques Cassini",
  "ano_nascimento": "1677",
  "ano_morte": "1756",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cassini_Jacques/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Thury, France",
  "biografia": "Jacques Cassini\nwas the son of\nJean-Dominique Cassini\nand Geneviève de Laistre. To avoid confusion with other members of the Cassini family\n(\nhis\nfather\n,\nson\nand\ngrandson\n)\n, he is sometimes known as Cassini II.\nJean-Dominique Cassini\nwas head of the Paris Observatory at the time of his marriage to Geneviève in\n1674\nand, two years previously, had become a French citizen, changing his name from Giovanni Domenico\nCassini\n. Geneviève was the daughter of the lieutenant general of the compté of Clermont and they owned the Château de Thury in the Oise which became their summer residence. Jacques, the second of his parents two sons, was born at their home at the Observatory in Paris. It was a wealthy family and Jacques received the finest education possible.\nThe Paris Observatory where his family lived provided an excellent place to educate a young boy with enthusiastic interests in science. This is where Jacques had his earliest education, after which he studied at the Collège Mazarin in Paris.\nVarignon\nhad been appointed professor of mathematics at the Collège Mazarin in\n1688\nand he supervised Cassini's thesis on optics. In August\n1691\n, at the age of fourteen, Cassini defended his thesis. An early biographer\n[\n3\n]\nstates that, when he was fifteen years old, he dedicated a thesis on mathematics to the Duc de Bourgogne. It is unclear whether these two references to theses refer to the same work or to two separate ones.\nIn\n1694\nCassini was admitted to the\nAcadémie des Sciences\nand began to undertake scientific work on projects which his father was carrying out. The following year he travelled with his father in Italy and they made numerous geodesic observations, as well as visiting Bologna where they repaired the gnomon at the Church of San Petronio which Cassini's father had designed nearly thirty years before. Cassini, like his father, was interested in making both astronomical observations and also interested in accurate surveys. After the Italian trip, Cassini visited Flanders and then England in around\n1698\n. While in England he met\nNewton\n,\nFlamsteed\n, and\nHalley\nand was elected to the\nRoyal Society of London\n. After returning to France he published the astronomical and geodesic data which he had gathered on his travels.\nIn\n1700\nCassini's father undertook a project to measure the meridian from Paris to Perpignan, which is\n13\nkm west of the Mediterranean coast. Cassini assisted his father on this project and they obtained results which wrongly suggested that the Earth was elongated at the poles. In\n1713\nhe proposed a new method for determining longitude by means of the eclipses of the stars and planets by the moon. Applying this method, and using data from the\n1700\nParis to Perpignan survey, he claimed to have proved\n[\n1\n]\n:-\n... that the degrees of the terrestrial meridian grow smaller from the equator towards the pole.\nIt was unfortunate that Cassini resolutely stuck to this position throughout his life, refusing to acknowledge the flattening despite the scientific evidence which was put forward. Whether this was due to a false sense of patriotism, believing that he was supporting the French view against the English view which was a consequence of\nNewton\n's gravitational theory\n(\nwhich Cassini never accepted\n)\n, or whether it was through a false sense of family loyalty supporting his father's views, we shall never know. Perhaps indeed both may have contributed without Cassini being fully aware that they were affecting his scientific judgement, or perhaps he was so convinced that the results of the\n1700\nsurvey were correct that he could never accept the contrary. The real problem with the data from the survey was, as pointed out in\n1733\nby Giovanni\nPoleni\n, that both the elongation proposed by Cassini or the flattening proposed by others, fell within the experimental error of the instruments used.\nCassini had some legal training but not so much that one would expect him to play a substantial role in this field but, in addition to his scientific work, he did undertake a second parallel career. He was appointed to the Chambre des Comptes in\n1706\n, which was a financial court with administrative and legal duties relating to the King's accounts and in particular to the land owned by the Crown. He gained a high reputation for honesty in this position but was sometimes criticised for being indecisive. Later, in\n1716\nhe was an advocate in the Court of Justice, and in\n1722\nhe became a Councillor of State.\nHis scientific role was one of major importance, playing a major role in the\nAcadémie des Sciences\nand taking over as head of the Paris Observatory from his father. Around\n1709\nhis father's health began to fail and Cassini took on more and more of the duties of head. It is worth noting that at this time there was no official post of Director of the Observatory, which was in theory run by the\nAcadémie des Sciences\n, but Cassini like his father before him effectively ran it. In the following year\n1710\nhe married Suzanne-Françoise Charpentier from Charmois. They had three sons, Dominique-Jean, César-François who was later known as Cassini III or\nCassini de Thury\n, and Dominique-Joseph, and two daughters Suzanne-Françoise and Elisabeth-Germaine. The eldest son Dominique-Jean followed his father into the Chambre des Comptes while the youngest son followed a military career.\nCassini continued both his astronomical and surveying work. He undertook the measurement of the Paris meridian north to Dunkerque in\n1718\n. He published the results, which again supported his incorrect theory of elongation at the poles, in\nDe la grandeur et de la figure de la terre\nⓉ\n(\nOn the size and shape of the earth\n)\nin\n1722\n. This important treatise surveyed the results which had been obtained on measuring the Earth over the preceding fifty years. However, those like\nMaupertuis\nwho believed that the Earth was flattened at the poles argued ever more strongly against Cassini's theory and, in an attempt to gain further evidence to support his case, Cassini organised another project in\n1733\n, this time to measure the perpendicular to the meridian from Saint-Malo to Strasbourg. As he had accompanied his father when he was a young man, on this measuring project Cassini had the assistance of his own son César-François Cassini\n(\nwho appears in this archive under the name\nCassini de Thury\n)\n. The data they collected during the years\n1733\n-\n34\nseemed to support the elongation theory but this only encouraged those members of the\nAcadémie\nsuch as\nMaupertuis\nwho supported the Newtonian view, to organise further scientific expeditions in an attempt to settle the argument in their favour. By\n1738\nthe geodesic measurements carried out in Peru by\nBouguer\nand\nLa Condamine\nin\n1735\nand Lapland by\nMaupertuis\nin\n1736\nto measure the length of a meridian degree had produced very strong evidence for the flattening at the poles. Although Cassini never deviated from his belief, he began to scale back his scientific work from\n1740\n.\nAs to his contributions to astronomy, Cassini published many papers in the journals of the\nAcadémie des Sciences\nand two major treatises in\n1740\n, namely\nElements of Astronomy\nand\nAstronomical Tables of the Sun, Moon, Planets, Fixed Stars, and Satellites of Jupiter and Saturn\n. These showed his excellent abilities as an observer and he made impressive contributions with his study of the moons of Jupiter and Saturn and his study of the structure of Saturn's rings. Most notable of his discoveries was that of the proper motions of the stars which he made in\n1738\n. Here for the first time the ancient belief in the unchanging sphere of the stars had been shown to be incorrect by direct measurement.\nCassini's work was not restricted to that of astronomy and geodesy. He wrote papers on a variety of other topics on the applications of mathematics, particularly on electricity, barometers, the recoil of firearms, and mirrors. Although after\n1740\nhis scientific activity decreased, he did assist his son\nCassini de Thury\nin his project to produce an accurate map of France.\nLet us end by stressing that Cassini made an extremely important contribution to the major scientific debates of his time. Although he supported an incorrect hypothesis regarding the shape of the Earth, nevertheless his contribution is extremely important. It is in the nature of scientific progress that hypotheses get put forward and tested. We should in no way consider Cassini's contribution any the less important because he was on the wrong side in the debate.\nOn\n15\nApril\n1756\nwhen he was on a visit to his Château at Thury, his carriage overturned and he died as a result of this accident on the following day. He was buried in the Church at Thury."
}