{
  "nome_completo": "Jacqueline Lelong-Ferrand",
  "nome_curto": "Jacqueline Ferrand",
  "ano_nascimento": "1918",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferrand/",
  "lugar_nascimento": "Alès, France",
  "lugar_morte": "Sceaux, France",
  "biografia": "Jacqueline Ferrand\nis also known by the name\nJacqueline Lelong-Ferrand\nwhich she used during the time she was married to the mathematician\nPierre Lelong\n. Jacqueline was born in Alès, which is in southern France about\n70\nkm from the coast and about\n40\nkm north of Nimes. Her parents were Auguste Ferrand and Jeanne Chambon. Her father, Auguste, was a school teacher of Latin and Greek. Jacqueline attended the lycée de Jeunes Filles in Nimes, a school which was founded in\n1832\nand celebrated its\n50\nth\nanniversary during the time that she studied there. The school moved to Feuchères in Nimes in\n1931\n. Ferrand performed outstandingly in all the subjects she took at the lycée but it was mathematics which was her greatest love and she received the first prize in a national competition in mathematics. In\n1936\nthe École Normale Supérieure changed its admission policy to allow women to compete in the entrance examination for the small number of places. Let us say a little more about the history behind this decision.\nMarie-Louise Jacotin\n(\nknown by her married name of\nDubreil-Jacotin\n)\nhad been ranked second for admission to the École Normale Supérieure, on Rue d'Ulm, in\n1926\nbut, because she was a woman, she had been moved down the list to a position too low for entry. At this time women had to attend the École Normale Supérieure de Jeunes Filles at Sèvres just outside Paris. After arguing her case, and supported by influential friends, she had been given special permission to attend the École on Rue d'Ulm but it continued its general policy of not admitting women students. However, for admission in\n1936\nthe École allowed women to compete for one of about\n20\nplaces for mathematics. To get an idea how difficult admission was, it was typical that around\n250\nstudents competed for these\n20\nplaces. Ferrand performed brilliantly at the École Normale Supérieure and she came first equal in the\nAgrégation de Mathematiques\nin\n1939\n. The other candidate who came first equal with Ferrand was\nRoger Apéry\n.\nJean Dieudonné\nwas an examiner for analysis and he wrote:-\nI was a member of the agrégation jury, for the only time in my life, by the way, and I gave a rather unusual analysis problem. Only two of the papers impressed me with their sense of analysis and precocious maturity very rare among candidates for the agrégation. Those two were by\nRoger Apéry\nand Jacqueline Ferrand.\nAfter graduating, Ferrand was appointed to teach at the École Normale Supérieure de Jeunes Filles at Sèvres. She taught there from\n1939\nto\n1943\n, tutoring for the Agrégation de Mathematiques. However, during these years she undertook deep research on conformal representations. She published three notes, each of three or four pages, in\n1941\n, namely\nSur la représentation conforme au voisinage d'un point frontière\nⓉ\n(\nOn the conformal representation in the vicinity of a boundary point\n)\n,\nSur l'itération des fonctions analytiques\nⓉ\n(\nOn iteration of analytic functions\n)\n, and\nSur les conditions d'existence d'une dérivée angulaire dans la représentation conforme\nⓉ\n(\nOn the existence conditions for an angular derivative in the conformal representation\n)\n. In the following year she published three further short notes and three major papers relating to her doctoral thesis. Two of these major papers, of around\n100\npages in total,\nÉtude de la correspondence entre les frontières dans la représentation conforme\nⓉ\n(\nStudy of the connection between the borders in the conformal representation\n)\nand\nÉtude de la représentation conforme au voisinage de la frontière\nⓉ\n(\nStudy of the conformal representation in the vicinity of the boundary\n)\nformed her doctoral thesis which she defended in June\n1942\n. The president of the jury was\nPaul Montel\n, while the examiners on the jury were\nArnaud Denjoy\nand\nGeorges Valiron\n. In this thesis she investigated the behavior of conformal transformations in the neighborhood of a boundary point. She expressed her thanks to those who had supported her doctoral work in the second of these papers:-\nI have to thank very specially\nM Denjoy\nwho suggested the subject of this study and has been continually encouraging me. I'm pleased to record here the expression of my gratitude. I extend my deepest gratitude and respect to M\nMontel\nwho kindly presented my 'Notes' for publication and accepted this Memoir for the 'Annals of the École Normale Supérieure'. M\nValiron\nhas constantly given me active sympathy; I thank him sincerely. Finally, I recall that I am indebted to M Wolff who, despite the difficulties of correspondence, kept me informed of the most recent work.\nThis remarkable work was recognised by the\nAcadémie des Sciences\nwhen she was awarded their Prix Girbal-Baral in\n1943\n. In the same year she was appointed as an assistant professor at the University of Bordeaux. After two years at Bordeaux, she moved to the University of Caen, again as an assistant professor. On\n22\nNovember\n1947\nshe married\nPierre Lelong\n, a mathematics professor in Lille. He had studied at the École Normale Supérieure and had taught at the University of Grenoble before being appointed to the University of Lille.\nPierre Lelong\n's name is attached to several mathematical concepts, for example the\nPoincaré\n-Lelong equation, the Lelong-Demailly numbers, Lelong's problem, and the Lelong-Skoda transform. The couple had four children, Jean, Henri, Françoise and Martine. While she was married to\nPierre Lelong\n, Jacqueline Ferrand published under the name Jacqueline Lelong-Ferrand. However, we shall continue to refer to her as Ferrand in this biography. We note at this point that, in\n1977\n, Ferrand separated from her husband and reverted to publishing under the name Jacqueline Ferrand.\nReturning to Ferrand's career, she was promoted to full professor at Caen in\n1948\nand, later in the same year, she was appointed to the chair of calculus and higher geometry at the University of Lille, filling the chair left vacant when Bertrand Gambier\n(1879\n-\n1954)\nretired. Her research during these years moved towards potential theory and she produced important papers such as\nSur le principe de Julia-Carathéodory et son extension à l'espace à p-dimensions\nⓉ\n(\nOn the principle of Julia-Caratheodory and its extension to the p-dimensional space\n)\n(1949)\nin which she generalised results due to\nGaston Julia\nbased on her study of certain potentials of double layers, and\nExtension du théorème de Phragmen-Lindelöf-Heins aux fonctions sous-harmoniques dans un cône ou dans un cylindre\nⓉ\n(\nExtension of the theorem Phragmén-Lindelof-Heins sub-harmonic functions in a cone or a cylinder\n)\n(1949)\nin which she generalised the Phragmen-\nLindelöf\ntheorem. In\n1955\n, returning to her earlier interest in conformal representation, she published the book\nReprésentation conforme et transformations à intégrale de Dirichlet bornée\nⓉ\n(\nConformal representation and transformations of the bounded Dirichlet integral\n)\n.\nWalter Hayman\nwrites in a review\n[\n3\n]\n:-\nThis is an original and stimulating book. ...\n[\nIt presents\n]\ndeep theorems, many of which, although having considerable interest have not previously been included in books. The author deserves our thanks for having made them available to us, in an account which is lucid and gives full proofs. At the beginning of each chapter there is a short summary of the material contained in it and at the end a historical note, referring us to an extremely copious bibliography and index. ... This book is advanced in scope and in many instances brings us right up to the boundary of present knowledge. Perhaps only those who already know something of the more orthodox approach to problems of conformal mapping will be able to appreciate the power and originality of the present author's approach. Her book will be essential for anyone interested in the more theoretical aspects of conformal or quasi-conformal mapping.\nIn\n1954\nJacques Chapelon\n(1884\n-\n1973)\nretired from his positions in Paris which provided vacant positions for which Ferrand applied. She was appointed to the Sorbonne during\n1955\n-\n56\nbut before taking up her position there she visited the Institute for Advanced Study at Princeton along with her husband and children\n[\n1\n]\n:-\nIn\n1956\n[\nJacqueline Ferrand\n]\nand her husband,\nPierre Lelong\n, also professor at the University of Paris, were in residence at the Institute for Advanced Study, carrying on research on Riemann manifolds and functions of several complex variables, respectively. In visiting the United States, the Lelongs did not interrupt their family life, for they brought to Princeton with them their three children, Jean Henri, and Françoise, aged seven, five, and four at the time.\n(\nAnother daughter, Martine, was born to the Lelongs in January\n1958)\n.\nWhile she was at the Institute for Advanced Study at Princeton, Ferrand worked on ideas which she announced in\nApplication of Hilbert Space Methods to Lie Groups Acting on a Differentiable Manifold\n(1957)\n.\nOn returning from Princeton, Ferrand took up her chair at the University of Paris, a position she continued to hold until she retired in\n1984\n. During these years when she taught in Paris, she published a number of textbooks aimed at undergraduate teaching based on courses she had delivered. For example H W Guggenheimer, reviewing Ferrand's book\nGéométrie différentielle\nⓉ\n(\nDifferential geometry\n)\n(1963)\n, writes:-\nThis is a textbook for the geometry part of the course \"Mathématiques II\" according to the new French undergraduate program. This explains the fact that a textbook of\ndifferential geometry\ncontains a chapter on non-euclidean geometry and one on the axiomatics of euclidean geometry, the first with a minimum, the second without any use of differential methods. As a whole the book is a striking example of the success of the reform of French university instruction and the decisive modernization of the curriculum.\nShe published her textbook on advanced calculus\nCours d'analyse\nⓉ\n(\nAnalysis course\n)\n(1968\n-\n70)\nin three volumes. Volume I covered multivariable differential calculus, with a little differential geometry. Volume II covered series, elementary functions of a complex variable, and elementary measure and integration. Volume III covered multivariable integral calculus, further topics in functions of a complex variable,\nFourier series\nand ordinary differential equations. In\n1971\nshe published, in collaboration with Jean-Marie Arnaudiès, the first volume of\nCours de mathématiques\nwhich covered algebra. The second volume, published in\n1974\n, covered analysis\n(\nmultivariable differential calculus and one-variable integral calculus\n)\nwhile the third volume, published in the following year covered geometry with applications to mechanics. The fourth and final volume was published in\n1974\nand covered ordinary differential equations, multivariable integral calculus and holomorphic functions. Ferrand continued to publish books aimed at undergraduate teaching, for example\nExercices résolus d'analyse\nⓉ\n(\nSolved exercises in analysis\n)\n(1977)\nwhich has the very convincing approach that the best way to learn mathematics is to solve problems. Having produced these books intended for students, Ferrand then published\nLes fondements de la géométrie\nⓉ\n(\nThe foundations of geometry\n)\n(1985)\nwhich was a text on the foundations of geometry intended for teachers of mathematics.\nWe must not give the impression that after a brilliant start to her research career, Ferrand became more interested in teaching mathematics than in research. Far from it, she continued to make some remarkable research contributions. In\n1964\nAndré Lichnerowicz\nposed a famous conjecture on differential geometry in his paper\nSur les transformations conformes d'une variété riemannienne compacte\nⓉ\n(\nOn conformal transformations of a Riemannian manifold\n)\n. Over the following years some partial results were achieved as mathematicians attacked the problem. However, in\n1969\nFerrand gave a complete proof of the conjecture in her paper\nTransformations conformes et quasiconformes des variétés riemanniennes; application à la démonstration d'une conjecture de A Lichnerowicz\nⓉ\n(\nConformal and quasiconformal transformations of Riemannian manifolds; application to a conjecture of A Lichnerowicz\n)\n. She continued to produce further work on the topic in papers such as\nTransformations conformes et quasi-conformes des variétés riemanniennes compactes\n(\ndémonstration de la conjecture de A Lichnerowicz\n)\nⓉ\n(\nConformal and quasiconformal transformations of Riemannian manifolds;\n(\nproof of a conjecture  of A Lichnerowicz\n)\n)\n(1971)\n. This led to her being an invited speaker in the Section on 'Differential Geometry and Analysis on Manifolds' at the International Congress of Mathematicians held in Vancouver in August\n1974\n. She gave a talk entitled\nProblèmes de géométrie conforme\nⓉ\n(\nConformal geometry problems\n)\nwhich was published in the\nProceedings\nof the Congress in\n1975\n. However, still more remarkable results followed and she published further generalisations of the\nLichnerowicz\nproblem in\nAction du groupe conforme sur une variété riemannienne\nⓉ\n(\nAction of a group on a Riemannian manifold\n)\n(1994)\nand\nThe action of conformal transformations on Riemannian manifolds\n(1996)\n. It is worth noting that these remarkable research contribution were done when Ferrand was approaching\n80\nyears of age.\nLet us end this biography by quoting Pansu's conclusion from\n[\n4\n]\n:-\nJacqueline Ferrand's work has had a significant influence in several branches of mathematics. However, they are little known in France. She has not sought to establish a school. As she says modestly, she hesitated to lead young people on tracks she considered insufficiently promising. Jacqueline Ferrand has undertaken some collaborations abroad, especially in Finland, where she enjoys high esteem. However, her intellectual path has been mostly solitary. The value of her work was not fully recognized except when her current mathematical achievements became known, which occurred in\n1942\nat the time of her thesis, in\n1969\nwith the problem of\nLichnerowicz\nand again in\n1996\n."
}