{
  "nome_completo": "Adolphe-Louis Jacques Bertillon",
  "nome_curto": "Jacques Bertillon",
  "ano_nascimento": "1851",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bertillon/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Valmondois, near Paris, France",
  "biografia": "Jacques Bertillon\n's father, Louis-Adolphe Bertillon\n(1821\n-\n1883)\n, was a statistician appointed as professor of demography at the School of Anthropology in Paris. Louis-Adolphe taught the first course in demography at the Paris Medical School\n(1875)\nand was the director of the Bureau de Statistique Municipale in Paris. Jacques's maternal grandfather, Achille Guillard\n(1799\n-\n1876)\n, is famed as the person who coined the term 'demography' in\n1855\n. Jacques had a younger brother, Alphonse Bertillon, who was born on\n24\nApril\n1853\n. Both Jacques and Alphonse achieved fame and collaborated on a number of projects.\nBertillon was educated as a physician before he turned his attention to statistics, but he invariably applied his statistics techniques to problems of a social nature. Clark writes\n[\n5\n]\n:-\nJacques Bertillon was one of the most prolific and influential quantitative social scientists in France near the turn of the century. His work grew out of a tradition pioneered by\nAdolphe Quetelet\nand developed by Bertillon's grandfather, Achille Guillard, and father, Louis-Adolphe Bertillon.\nSome of Bertillon's early statistical work involved comparative studies of divorce rates and suicide rates between different countries which he published in\nAnnales de démographie internationale\n; he became the editor of the journal in\n1882\n. In\nLa Nature\nhe published articles such as\nOuverture des cours d'anthropologie\nⓉ\n(\nA beginning course in anthropology\n)\n(1877)\n,\nStatistique des bègues en France\nⓉ\n(\nStatistics of stutterers in France\n)\n(1880)\n,\nInfluence du mariage sur la tendance au suicide\nⓉ\n(\nThe Influence of marriage on suicide\n)\n(1880)\n, and\nNains et Géants\nⓉ\n(\nGiants and Dwarfs\n)\n(1880)\n.  Also in\n1880\nhe published a major work entitled\nLa Statistique humaine en France\nⓉ\n(\nHuman statistics in France\n)\n. In\n1883\nBertillon's father, Louis-Adolphe, died and Jacques Bertillon succeeded him as director of the Bureau de Statistique Municipale in Paris; he held this post for thirty years until\n1913\n. In the same year of\n1883\nhe published another major work\nÉtude démographique du divorce et de la séparation de corps dans les différents pays de l'Europe\nⓉ\n(\nDemographic study of divorce and separation in the various countries of Europe.\n)\n.  In\n1896\nhe published\nCours élémentaire de Statistique administrative\nⓉ\n(\nBasic course of administrative statistics\n)\nto improve the methods of collecting data by French government offices. Falkner, in the review\n[\n9\n]\nwrites:-\nIt must have been an extreme modesty or a very generous conception of the limits of statistical science which lead the author to characterise his book as an elementary one. We should be inclined to designate it as a most elaborate treatment of the subject. The point of view which distinguishes his treatment is the administrative character of statistical investigation, and the object with which it was prepared was to place in the hands of those who present themselves as candidates for the public service in France, a suitable guide through the labyrinth off the statistical work of the government. It appeals, therefore, in the first instance to the French. It appeals to others through the fact that its pages give a precise and definite account of the statistical activity of a typical modern nation and through its admirable treatment of the more general aspects of statistical work.\nA study of the causes of death led him to introduce the 'Bertillon classification'. He first introduced it at the Chicago Conference of the International Statistical Institute in\n1893\n. His classification was adopted by the American Health Association in\n1897\nand then it was approved as the international standard by an International Commission in Paris in\n1900\n. In\n1895\nhe founded the Free College of Social Sciences in Paris and he taught statistics and demography there for more than ten years. He was also Professor of Demography at the École d'Anthropolie. From\n1879\nhe was a member of the Statistical Society of Paris and in\n1897\nhe was elected president of the Society. During World War I he was head of medical-surgical statistics for the French army, collecting and studying the statistics of disease among the French soldiers, and he established an inventory of injuries and illnesses at all hospitals.\nThere were two topics which became the most important for Bertillon\n[\n5\n]\n:-\nBertillon was a deeply patriotic Frenchman with strong social convictions. Through his statistical work, he became aware of the extent of two phenomena which he came to consider as the most serious social problems that France had to face: alcoholism and \"depopulation.\" Attempting to develop a more thorough understanding of each of these phenomena, he undertook careful analyses of the statistics available on them.\nAs to alcoholism he wrote several works perhaps the most significant being in\n1904\nwhen he published\nL'Alcoolisme et les moyens de le combattre jugés par l'expérience\nⓉ\n(\nAlcoholism and ways to combat it judged by experience\n)\n. His attempts to combat depopulation included publications such as the major book\nLa dépopulation de la France, ses conséquences, ses causes, mesures à prendre pour la combattre\nⓉ\n(\nThe depopulation of France, its consequences, causes and measures to combat it\n)\n(1911)\n, the founding of the\nAlliance nationale pour l'accroissement de la population française\nⓉ\n(\nNational alliance for the increase in the French population\n)\nin\n1896\n, and the founding of the bi-weekly journal\nLa femme et l'enfant\nin\n1918\n. What did he think were the reasons for the decline in the population of France? He suggests that high taxation and small apartments both were factors in parents deciding to have few children. Among his suggestions to combat the decline was a proposal that parents should receive a cash bonus for their fourth child. The arguments that he put to the French government, mostly through the\nConseil Supérieur de la Natalité\n, led to the passing of a law in\n1920\nwhich made it illegal to give information about methods of birth control. Of course, Bertillon was well known to members of the government being on various bodies such as the Higher Council of Statistics, which advised the government on statistical matters, and the Committee on Public Hygiene.\nHe also put forward arguments, backed up by statistical studies, encouraging men and women to marry\n[\n11\n]\n:-\nMarry if you want to live to a good age. The married man or woman has thrice as much chance of a good, long run of life as a bachelor or spinster. To you, Monsieur, I say marry and you will do well even from a selfish standpoint; but watch carefully over your wife's health as, even from this egotistical point of view, her loss will be a terrible misfortune; for your life depends in a great measure on her own. And to you, Mademoiselle, I give counsel to marry in your most selfish interest, as mortality among married women is less than among spinsters of the same age, at least after the age of\n20\n... Mortality among widows is distinctly much greater than among married women of the same age. 'The sweet state of widowhood' is, on the contrary, fatal to young widows. Their death rate, from\n20\nto\n25\nyears of age, is twice that of married women at the corresponding age. ... Married people lead a more regular life. They are more controlled, discreet though this control may be, and it must be discreet if it is to be useful. Their physical life, like their moral life, is healthier, quieter, and more natural. Other explanations may be assigned but, in my opinion, they are not worth this one.\nCertainly not all of Bertillon's arguments have been accepted. Riley, in\n[\n10\n]\n, gives an example where Bertillon has failed to take into account certain relevant facts:-\nJacques Bertillon compared sickness and death rates from several countries in\n1892\n, finding that sickness rates in the British friendly societies were higher than those in counterpart sick funds in France and Italy. He reasoned from analogy: mortality rates were similar in the three countries, hence morbidity rates should be similar. Since they were not, he expressed doubt about the reliability of the sickness rates reported for the British friendly societies. Bertillon also ventured a guess about why sickness rates were higher in English societies: those societies were richer and thus better able to pay benefits. ... But Bertillon is guilty of being systematically inattentive to the significant details of the thing he purported to study. Specifically, he neglected the following important differences, with the result that he grossly understated sickness rates in the continental societies.\nRiley then makes five points which Bertillon has overlooked, the first being:-\nThe French and Italian societies paid benefits only for the first six to nine months of an episode of sickness, rather than for an indefinite period, as most British friendly societies did, albeit often at a reduced rate. Hence they omitted protracted sicknesses, except in their early stages.\nWe should also mention another important contribution made by Bertillon in collaboration with his brother Alphonse Bertillon who was in the Police Force. Together they developed anthropometry, an identification system based on physical measurements which was used by police to identify criminals. Later Bertillon invented the fingerprint system but it was his brother Alphonse who saw the practical implementation and use by the police.\nAmong the many honours given to Bertillon, let us note that the Vital Statistics Section of The American Public Health Association unanimously adopted the following at its meeting in New York City on\n18\nNovember\n1921\n:-\nDr Jacques Bertillon, Paris, France.\nWhereas, Dr Jacques Bertillon has served for over twenty years as the Secretary General of the International Commission which has recently made the third decennial revision of the International List of Causes of Death,\nWhereas, Dr Jacques Bertillon is recognised the world over as the father of international nosologic nomenclature,\nWhereas, Dr Jacques Bertillon, though in ill health, has recently carried through successfully the arduous labours connected with the third decennial session of the Commission already referred to,\nBe it resolved, that the Vital Statistics Section of The American Public Health Association express to Dr Jacques Bertillon, Secretary General of the International Commission for the Revision of the International List of Causes of Sickness and Death, appreciation of his untiring efforts to procure comparable international statistics of sickness and mortality, and extend to him the good wishes of the Association for his rapid and complete recovery.\nIn\n[\n6\n]\nhis death is reported as follows:-\nParis July\n7\n.- Dr Jacques Bertillon, the famous criminologist, died here today. Obituaries printed in the Paris newspapers this afternoon were written by the aged savant himself several days ago."
}