{
  "nome_completo": "Jaime Alfonso Escalante",
  "nome_curto": "Jaime Escalante",
  "ano_nascimento": "1930",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Escalante/",
  "lugar_nascimento": "La Paz, Bolivia",
  "lugar_morte": "Roseville, California, USA",
  "biografia": "Jaime Escalante\n's full name was\nJaime Alfonso Escalante Gutiérrez\n but he was known as Jaime Escalante. He was the son of Zenobio Escalante Rodríguez and Sara Gutiérrez Valle, both of whom were teachers at elementary schools in the town of Achacachi. They had five children, with Jaime the second eldest of them. He was born in the Sopocachi area of the city of La Paz rather than Achacachi since his mother thought the medical facilities better there and went to stay with relations shortly before his birth. His siblings were Olimpia\n(\nborn about\n1928)\n, Bertha\n(\nborn about\n1934)\nand the twins Félix and Raúl\n(\nborn about\n1940)\n. Olimpia became a chemistry teacher, and Bertha became a psychology teacher so it was certainly a family tradition to become teachers. Escalante explained in a\n2007\ninterview\n(\nsee\n[\n36\n]\n)\n:-\nI am originally from La Paz. My parents were teachers and they were assigned to the Umasuyos province whose first capital is Achacachi. I spent my childhood in Achacachi. I practically grew up with the Indians. I was more with the Aymaras, because my aunt had her farms and I was more with the Indians on the farms. I did not speak Spanish, I did not know Spanish, because my first language was Aymara.\nWhen Jaime was very young, his grandfather, José Gutiérrez, taught him to read and write when he was five or six years old. His mother also taught him about geometry using oranges as examples. He would invent his own games to play in his back garden and often went for walks with his grandfather who was a retired philosophy professor. He received his early education from\n1941\nat the Escuela México primary school in La Paz. His mother had moved from rural Achacachi to teach in La Paz so Jaime had the benefit of better education in the city. He went directly into the fourth grade at the school but his fellow pupils made fun of him saying he was a country boy who did not know anything. He also had language problems since the teaching was in Spanish. He explained\n[\n36\n]\n:-\nLittle by little, as time went by, I went to the fifth grade of elementary education and I had a very good teacher and I learned the language, which gave me some confidence.\nHe was encouraged and advised by his teacher Humberto Bilbao who saw he had talent but spoke Spanish poorly and did not behave well. Bilbao spoke to Escalante's mother and advised that he should be moved to a school which would bring out his potential. So he left the Escuela México primary school, and he entered the Colegio La Salle, a secondary school in La Paz. This, however, did not go well and he was expelled for failing to respect the mathematics teacher. His secondary education continued from\n1944\nat the Colegio San Calixto, a prestigious Jesuit primary and secondary school in La Paz which had been founded by the Society of Jesus in\n1882\n, named for the third century Pope Callixtus who was martyred. At this school Escalante developed a keen interest in mathematics and engineering. He represented the school in a mathematics and physics competition where they won first place. His reports from the school, however, were bad. He could not sit still and was always making jokes. The family moved to a new house and Escalante became fascinated by physics continually doing experiments, sometimes working with his sister Bertha.\nAfter he graduated from the Colegio San Calixto he would have loved to go to the Faculty of Engineering, but there was no way his family could afford this. His father had died and Escalante had to get some jobs to earn money. He undertook compulsory military service beginning in May\n1949\nwhich had been introduced because of unrest in the country. In\n1950\n, he made a sudden decision to study at the Normal School \"Simón Bolívar\" of La Paz where students were taught to enter the teaching profession. He took the course to qualify as a teacher of mathematics and physics. He was unimpressed with the teaching methods\n[\n36\n]\n:-\nWhen I went to the Normal School, I did not agree with the way the teachers gave the classes. ... If the student comes without ... preparation, he will not respond, because the student has to understand to respond. But the students of this course did not respond, either because they did not have adequate preparation, or they did not have the will to do so.\nOne of the teachers, however, was Humberto Bilbao who had taught Escalante at primary school. He involved Escalante in experiments which he loved. During his second year on the teacher training course, he began to undertake teaching. In that year he was sent to teach physics at the American Institute where there was a vacancy. Bolivia experienced a revolution in\n1952\nwith a rebellion which began in La Paz. This disrupted Escalante's teacher training course and Bilbao found him a position as a mathematics teacher at the Bolívar National School and he also taught at the newly opened Gualberto Villarroel school. Escalante wrote\n[\n6\n]\n:-\nIn\n1952\n, while still an undergraduate in La Paz, Bolivia, I began teaching mathematics and physics - first at one high school, then a second, and finally a third. Early in my career I found that children learn faster when learning is fun, when it is a game and a challenge. From the beginning I cast the teacher in the role of \"coach\" and students in the role of the \"team.\" I made sure that my students knew that we were all working together on the same team. In La Paz in the fifties and early sixties, our \"opponent\" was the annual secondary school mathematics competition. Our goal: to reign as the champions over all the local schools.\nAfter qualifying to become a teacher, he obtained a scholarship to study for a postgraduate degree at the University of Puerto Rico where he took courses on science and mathematics. After completing this course, he returned to Bolivia where he had three teaching positions. In the mornings he taught at the Colegio San Calixto, in the afternoons he taught at the National Bolívar High School, and in the evenings at the Commercial High School.\nWhile a student at the Normal School \"Simón Bolívar\" he had met Fabiola Tapia. They were married on\n25\nNovember\n1954\nat the Calama Street Baptist Church in Cochabamba and their first child, Jaime Jr, was born in\n1955\n. Fabiola had brothers who had studied at college in California and she thought that they should emigrate to the United States where they would have a better family life. Escalante hesitated but in\n1961\nhe took part in President Kennedy's 'Alliance for Progress' which was a ten year plan aimed at improving relations between the USA and Latin America. He spent a year in Puerto Rico on the training for science teachers course offered by  'Alliance for Progress'. As part of the programme he visited several schools in the United States where he was impressed with the equipment and other facilities available to the teachers. This experience, together with the wish of his wife to emigrate to the United States, made him decide to emigrate.\nEscalante travelled without his family to the United States, arriving in Los Angeles on\n24\nDecember\n1963\n. A teaching job was out of the question for he knew no English, so he managed to get a job as a cleaner in Van de Kamp's restaurant in Pasadena, across the road from Pasadena City College where he enrolled in English classes. Fabiola and Jaime Jr joined him in Pasadena where they lived in a guest house owned by Sam Tapia, Fabiola's brother. Escalante was promoted to cook at the coffee shop and was able to enrol in evening classes for an Associate Degree in mathematics and physics at the Pasadena City College. This, however, was not the life he wanted; he wanted to be a teacher. He discovered that his qualifications from Bolivia were worthless in the United States so to become a teacher he would have to take a degree and qualify as a teacher in the United States. Encouraged by his wife, he decided to apply for a job at the electronics firm Burroughs. At first he worked in the parts department earning less than he had at Van de Kamp's restaurant but he rapidly showed he had clever ideas to improve efficiency and he was rapidly promoted.\nIn\n1969\nJaime and Fabiola's second son Fernando was born. In the same year he graduated from Pasadena City College with an Associate Degree. He now enrolled for a Bachelor of Arts degree in mathematics at California State University. In\n1972\nBurroughs offered him the position of supervisor of a new plant they were opening in Guadalajara, Mexico. It was a tempting offer, but Escalante wanted to teach even though he understood that he would earn less than he would if he accepted Burroughs' offer. He turned down the offer and, in\n1973\n, he graduated with a mathematics degree from California State University. Of course, he still was not qualified to teach. His professor at California State University encouraged him to compete for a National Science Foundation Scholarship which would fund full-time studies at university so he could qualify in one year. The scholarship provided money for tuition, books, and living expenses at California State University, Los Angeles.\nQualified to teach, he applied to the Los Angeles Unified School District for a teaching position and was given an interview\n[\n36\n]\n:-\nThe man took out a map, put it on his desk and unfolded it in front of Escalante, to show the communities settled by different ethnic groups. There was the black community, the Anglo community, and the Chicano community. Escalante was interested in teaching in a Latino school. He chose the Chicano community because he knew the language. Furthermore, this neighbourhood was the closest to Monrovia, where he lived. Escalante had three institutions to choose from: Belvedere School and two high schools, Roosevelt and Garfield in East Los Angeles, overwhelmingly populated by Hispanics. In May\n1974\n, Jaime Escalante visited Garfield for the first time. He was impressed by the jacaranda trees that were dropping their blossoms and by the treatment he received from Garfield's Director, Alex Avilez. When he looked at the pages of Escalante's curriculum, he realised that the professor had extensive knowledge of computers and was perfect for his project of implementing these courses. When Avilez asked Escalante if he would be a computer teacher for a new program developed here, and Escalante said, \"Wonderful. Oh thank you sir. That's exactly what I wanted.\" Escalante decided to stay at Garfield High School. He was hired as a computer teacher. He was fascinated with this position because it was what he wanted. He immediately called Fabiola to cancel the interview with the other schools.\nEscalante began teaching at Garfield High School in the autumn term of\n1974\n. He found he had been assigned to teach the lowest level mathematics class consisting of badly behaved pupils who did not want to study mathematics. He decided he had to motivate his students; he explained the way he tried to do this in\n[\n6\n]\n:-\nFew students today have not been lectured on the necessity and importance of a good education, but the dictum \"Get a good education\" may be too nebulous for easily distracted young minds. Their focus easily shifts to other more pressing problems, particularly when they are living in poverty. The AP test provides a formidable opponent that galvanises each of the students and their teacher in a united charge toward a tangible and inexorable deadline: the second week of May. Over the years I have found it easy to focus student attention on this challenge and its very real rewards of possible college credit and advanced placement in college mathematics courses.\nNot all students who take the Advanced Placement Calculus Test score the grade of three or better which enables them to receive college credit in mathematics at over\n2\n,\n000\nuniversities, but those who sit for the exam have already won the real game being played. They are winners because they have met a larger challenge than any single examination could present. They have attained a solid academic background in basic skills, especially mathematics and science, and are prepared to move on and compete well against the challenges of both higher education and life. Many of my former students who have gone on to college mathematics or calculus courses often call me. \"Kimo,\" they tell me\n(\n\"Kimo\" is the shortened, student-preferred spelling of \"Kerno Sabe,\" the nickname I was given by one of my gang kids in the\n1970\ns\n)\n, \"this is easy after your course!\"\nAs the number of students enrolled in my program who are studying calculus alone has grown to between\n140\nand\n200\n, Advanced Placement activities at Garfield have also exploded in other technical subjects such as physics, chemistry, biology, and computer science. Many of my students now take two, three, and sometimes even four Advanced Placement tests in various subjects. In\n1989\nthe school set a record with over\n450\nAdvanced Placement tests administered\n16\ndifferent subjects. By comparison, in\n1978\n, the year before I started my program, only\n10\ntests were administered for the entire school and not one student sat for the calculus examination.\nAs Escalante explained in this quote he began teaching Advanced Placement calculus in\n1978\nknowing that if just one student sat Advanced Placement calculus it would be an improvement on the previous year. In fact in that first year five of his students sat the examination and two passed. By\n1981\nhe had\n15\nstudents taking the examination, all but one of whom passed. The following year he achieved even better results with all eighteen of his students passing, seven of whom gained the highest grade. Success, however, was short lived. The examinations were administered by the Educational Testing Service who claimed that\n14\nof these students must have been cheating since their solutions contained some similarities and their scores were declared invalid. The school felt that the Educational Testing Service were racially biased and had based their claims on the belief that lower-income Mexican Americans could not achieve such excellent marks. Twelve of the\n14\nstudents chose to take the examination again under conditions to make certain that cheating could not occur; all\n12\npassed. In\n1988\nthe highly praised film 'Stand and Deliver' was based on these events. It is fairly accurate but Escalante said the film \"made it seem like I achieved academic excellence overnight, but the process of getting my kids to understand the likes of calculus was a long, tough road.\"\nThis incident, although extremely stressful for Escalante, actually produced much publicity and led to large numbers of students taking the Advanced Placement calculus examination at Garfield. By\n1987\nonly four schools in the whole of the country had more pupils passing Advanced Placement calculus than Garfield. His remarkable achievements were quickly recognised. In\n1988\nhe received the Presidential Medal for Excellence in Education, awarded by President Ronald Reagan, and was a Hispanic Heritage Awards Honoree in the same year. In\n1989\nhe was made an Honorary Doctor of Science by the University of Massachusetts, Boston, and in the following year an honorary Doctor of Humanities by California State University, Los Angeles, an honorary Doctor of Education by Concordia University, Montreal, and an honorary Doctor of Laws by the University of Northern Colorado. Also in\n1990\nhe received the Jefferson Award for Greatest Public Service Benefiting the Disadvantaged.\nSuccess brought its problems, however. By\n1990\nover\n400\nstudents were taking mathematics at Garfield forcing class sizes to be over\n50\n, well in access of the limit of\n35\nset by the teaching union. Escalante's success as a teacher and the popularity of the film 'Stand and Deliver' led to jealousy among his colleagues, and Escalante received threats by letter. He resigned in\n1991\ngiving as his reasons the jealousy of colleagues and the policies being followed by Garfield High School. After he left, there was a rapid decline in the number of mathematics students at Garfield and the number passing fell sharply. Escalante moved to become a teacher at Hiram W Johnson High School in Sacramento, California. This school had been established in\n1958\n, named for the\n23\nrd governor of California.\nBy the mid-\n1990\ns, Escalante had a new campaign, namely to stop bilingual teaching in schools in California and have all lessons in English. He said in a BBC interview in June\n2003\n(\nsee for example\n[\n36\n]\n)\n:-\nAt first I believed a lot in the bilingual system because I believed that the student had to be taught in the language he understood, but in the field of science, special languages   must be learned, so I saw that the student had to be taught in the language that was going to be successful. I have been part of the elimination of bilingual education, because I have seen that the language in which the student was going to be successful is English. Unfortunately everything, be it job applications or interviews, came in one language. The student had to have command of that language. The university entrance tests\n(\nS.A.T\n)\nwere only in English, as were all the texts that were used, even in bilingual schools.\nFor an English translation of this interview, see\nTHIS LINK\n.\nAlthough the campaign to stop bilingual education in Californian schools was successful, Escalante made many enemies in the teaching association. He retired in\n1998\nat the age of sixty-seven, tired of the politics that went on in the American education system. He returned to East Los Angeles and met up with former students who welcomed him joyfully. He was very moved and said \"coming back here with these children, remembering the good life of the past, is the best reward.\"\nHis retirement prompted the award of many further honours. He was awarded an Honorary Doctor of Humane Letters from Wittenberg University in\n1998\nand, in the same year, the Andrés Bello prize, from the Organization of American States. In\n1999\nhe was inducted into the National Teachers Hall of Fame. In\n2001\nhe returned to Bolivia and taught at the Universidad Privada del Valle in Tiquipaya. After a few years he became ill with bladder cancer and was admitted to the Century Wellness Clinic in Reno, Nevada. It was a long illness and, when it was clear that he was close to the end, he was driven by Edward James Olmos, the actor who played him in 'Stand and Deliver', to the home of his son Jaime Jr in Roseville, California where he died the next day. Following his wishes, his coffin was placed for one day in the classroom of Garfield High School where he had taught. This classroom had been arranged to look as close as possible to how it was when he had taught there. His funeral started from the classroom and proceeded to Rose Hills Memorial Park, Whittier, Los Angeles County where he was buried.\nIn\n2016\nthe United States Postal Service issued a stamp to honour Escalante, \"the East Los Angeles teacher whose inspirational methods led supposedly 'unteachable' high school students to master calculus.\" See\nTHIS LINK\n.\nLet us end by quoting from Escalante what one needs to be able to teach\n[\n7\n]\n:-\nTo be able to teach, you need three things. Number one is the knowledge of the subject. You have to have the domain of what you're going to teach. I'm not going to be able to teach biology. I'm not going to be able to do it, because I don't know too much about it. I have to have the blueprint in my head to follow. The second thing is I have to motivate the concept I'm going to be teaching. For example, I introduce the concept of illegal defence - that in mathematics you cannot divide by zero. So I want this to be clear, and I put a zero denominator and the whole class they shout \"Illegal defence!\" And I ask them, you're going to have to help me out. If somebody comes and asks \"what's illegal defence?\" They are going to say \"You can't divide by zero.\" With each new concept I have to do exactly the same thing, I have to use some toy or something for the concept itself. So from that you start. Third, you have to understand human relations. you have to look at the kid as a person. And you respect the kid. And that way, you motivate them. And you develop that gradually over a whole semester or two weeks or three weeks, that good relationship. And if you do that, when you have the feedback from the student, mathematically speaking, then the kid speaks back and you know he is learning."
}