{
  "nome_completo": "James Archibald",
  "nome_curto": "James Archibald",
  "ano_nascimento": "1862",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Archibald_James/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "James Archibald\n's father was William Archibald\n(\nborn in Liberton, Lanarkshire, Scotland about\n1837)\nwho was a gardener. His mother was Jane Porteous Archibald\n(\nborn in Yarrow, Selkirkshire about\n1833)\n. he had siblings: Isabella\n(\nborn about\n1865)\nWilliam\n(\nborn about\n1868)\n, Richard\n(\nborn about\n1870)\nand Janet\n(\nborn about\n1874)\n.\nOn Thursday,\n26\nth\nJune\n1924\nthe following report appeared in\nThe Scotsman\n. It gives details of James Archibald's education and subsequent career:\nPresentation to an Edinburgh Headmaster.\nMr James Archibald, MA, F.R.S.E., until recently headmaster of Dalry School, Edinburgh, has been made the recipient of gifts from the pupils and staff of the school, and from associates during his career as a teacher Mr Herbert, acting head master, made the presentation. Mr Archibald had a serious breakdown in health during the winter, and this has necessitated his giving up active service. Beginning as a pupil-teacher in Stockbridge School, Edinburgh, he entered the Training College and Edinburgh University, where he had a distinguished career. Having served in various schools as assistant and first assistant, he was appointed headmaster, of St Bernard's School in\n1905\n, where he remained till\n1918\n, when he was promoted to the headmastership of Dalry School. For many years Mr Archibald was an active and enthusiastic member of the Mathematical Society. He had\n47\nyears' service as a teacher, first under the Edinburgh School Board; and later under the Education Authority.\nArchibald was educated at Northern District School for four years, then at Stockbridge School for two years, and finally two further years at North Canongate School. He first matriculated at the University of Edinburgh in\n1881\nand graduated M.A. in\n1889\n.\nHe joined the\nEdinburgh Mathematical Society\nin December\n1889\n. He was Treasurer of the Society during\n1899\n-\n1905\n, then President for session\n1906\n-\n07\n. He was elected a fellow of the\nRoyal Society of Edinburgh\non\n24\nJune\n1907\n. He was proposed for the fellowship by\nJohn Alison\n,\nAlexander Morgan\n,\nGeorge Alexander Gibson\n, and\nWilliam Peddie\n.\nArchibald's death was reported in\nThe Scotsman\non Tuesday,\n17\nth\nNovember\n1925\n:\nDeath of Edinburgh ex-Headmaster.\nThe death occurred yesterday morning, at his residence,\n31\nLeamington Terrace, Edinburgh, of Mr James Archibald F.R.S.E., formerly headmaster of Dalry Road Public School. Mr Archibald retired a year and a half ago, after spending\n45\nyears as a teacher in Edinburgh. He was keenly interested in mathematics, and for many years acted as treasurer of the\nEdinburgh Mathematical Society\n, of which Society he was an ex-president. He was an enthusiastic worker in Roseburn United Free Church, which he acted as session clerk, He was also an examiner under the United Free Church Bursary Committee. Only last month he returned from a six months' visit to Canada and the United States of America."
}