{
  "nome_completo": "James Cockle",
  "nome_curto": "James Cockle",
  "ano_nascimento": "1819",
  "ano_morte": "1895",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cockle/",
  "lugar_nascimento": "Great Oakley, Essex, England",
  "lugar_morte": "Bayswater, London, England",
  "biografia": "James Cockle\n's father, also named James Cockle, was a doctor who both treated patients and manufactured his own medicine to sell. James\n(\nsenior\n)\nmarried Elizabeth\n(\nwhose maiden name was probably Moss\n)\nin\n1814\n; they had five sons and one daughter. The family moved from Great Oakley to London when James, the subject of this biography, was still a child. James entered Stormond House, Kensington in\n1825\nand was educated there until\n1829\nwhen he attended Charterhouse as a day pupil for two years. From\n1831\nto\n1836\nhe attended a private school in Ramsgate where his talent for mathematics became apparent.\nAfter completing his school education in\n1836\nhe spent a year travelling in the West Indies, Cuba, and America. On\n18\nOctober\n1837\nhe entered Trinity College, Cambridge where he took the mathematical tripos. Many intending to enter the legal profession studied mathematics at this time and indeed Cockle began his legal training at the Middle Temple in\n1838\n. He was ranked\n33\non the mathematical tripos of\n1841\nand graduated with a B.A. in the following year. Despite the relatively low position in the tripos, Cockle had demonstrated his mathematical abilities by having a paper published while still an undergraduate. Cockle was called to the bar in November\n1846\nand, although a barrister by profession, he maintained his interest in mathematics.\nCockle married Adelaide Catharine Wilkin on\n22\nAugust\n1855\n; they had nine children. His legal career continued to flourish and he was appointed chief justice for Queensland, Australia, in\n1863\n. His effort there in difficult circumstances were quite outstanding. The chief justice said\n[\n3\n]\n:-\nI have had much knowledge of judicial men, and I am sure the Queen has never had a servant who more thoroughly earned every farthing of the wages he hoped to receive ...\nFor his efforts in Australia, then of course a British Colony, Cockle was knighted in\n1869\n. He remained in Queensland until\n1878\n, when he returned to England. He was supposed to spend a year in England, then return to Queensland, and indeed the people of Queensland were keen to see him return. However he resigned his post, deciding to retire and spend his retirement in England.\nDespite the positions of high authority that Cockle held, he was remarkably productive as a mathematician publishing over\n100\npapers. He wrote papers on both pure and applied mathematics, as well as on the history of science. On the former topic he wrote on fluid dynamics and magnetism. Most of his work, however, was in pure mathematics where he studied algebra, the theory of equations, and differential equations. He had a collaborator on mathematical work, a Congregationalist minister named Robert Harley. Harley is the author of the articles\n[\n3\n]\nand\n[\n4\n]\n. Describing Cockle's contributions to differential equations Harley explained that his\n[\n4\n]\n:-\n... mode of dealing with the theory of differential equations was marked by originality and independence of mind.\nCockle joined the\nRoyal Astronomical Society\nin\n1854\n, the Cambridge Philosophical Society in\n1856\n, and the\nLondon Mathematical Society\nin\n1870\n. He served as president of the\nLondon Mathematical Society\nfrom\n1886\nto\n1888\n. Much earlier, in\n1865\n, he had been honoured with election to the\nRoyal Society of London\n. After his presidency of the\nLondon Mathematical Society\n, Cockle became a member of the Council of the\nRoyal Astronomical Society\n, serving in this role from\n1888\nto\n1892\n. Given the office he had held in Australia one would have expected him to take a leading role in many of the discussions. However\n[\n5\n]\n:-\nOn committees or councils he was singularly reticent, rarely venturing a suggestion unless appealed to, but the regularity of his attendance testified to the keen interest he took in the management of business.\nAfter a brief illness, Cockle died at his home in St Stephen's Road, Bayswater. He was buried at Paddington cemetery."
}