{
  "nome_completo": "James Dickson Murray",
  "nome_curto": "James Murray",
  "ano_nascimento": "1931",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Murray/",
  "lugar_nascimento": "Moffat, Scotland",
  "lugar_morte": null,
  "biografia": "James Murray\n, the son of Peter and Sarah Murray, came from a family of plumbers. The family tradition would have seen James become a plumber but after contracting polio as a child, this was not a possibility. He said\n[\n14\n]\n:-\nI started in Moffat, a very rural and isolated part of Scotland, where there was only one non private school and you only attended until you were\n14\n. After that everyone left to get a job. However, there were two of us that went off to Dumfries Academy.\nHe spent three years at Dumfries Academy where the head of the mathematics department, Mr Ross, told him he would never make it as a mathematician! However James said that Mr Ross was an excellent mathematics teacher. Leaving Dumfries Academy, he entered the University of St Andrews where he began his university career studying chemistry. This was the result of Mr Ross's opinion of Murray's mathematical abilities. After one year he was bored with chemistry and changed to study physics. He said\n[\n14\n]\n:-\nHowever, I also found that to be boring. Alongside this I did keep up the mathematics and found I kept getting prizes and medals in it. This, of course, made me think that perhaps the teacher hadn't been right.\nIn\n1950\n-\n51\nMurray entered the Junior Honours class in mathematics. He won the class medal\n(\nfirst equal\n)\nand was awarded the Tullis Prize. In Honours Mathematics he studied the compulsory courses of geometry, algebra, analysis, statics and dynamics. He also took two special topic papers, namely fluid mechanics and partial differential equations. His most outstanding performance was in fluid dynamics. In\n1953\nMurray graduated from the University of St Andrews when he was awarded a B.Sc. with\n1\nst  class Honours in Mathematics. His performance was outstanding and he was awarded the Carstairs Medal for his performance in mathematics and the Miller Prize as the most distinguished graduate in science. It was not all work for Murray at university, however, for he won the University of St Andrews' first blue in table tennis and was captain of the university's billiard team. Any thoughts he had of getting a job in industry were soon changed after his experience of a summer internship at the end of his third year\n[\n14\n]\n:-\nI did a summer internship in an aircraft industry, Fairey Aviation Company, near London. I worked in the theoretical division, but they had me doing the most boring jobs you could imagine. No wonder the company went bust! So, I decided against going into industry.\nSo, after taking his first degree, Murray remained at St Andrews to study for a Ph.D. having been awarded a Carnegie Research Scholarship. His thesis advisor was\nRon Mitchell\nand he suggested to Murray a topic in boundary layer fluid dynamics. In these days the Air Ministry published a list of their top ten problems in fluids. Problem Number\n6\nat that time was flow into a pitot tube: was the speed of flow which was registered the correct speed of the aircraft? This was Murray's PhD problem. In\n1954\nMitchell\nand Murray submitted the paper\nTwo Dimensional Flow with Constant Shear Past Cylinders with Various Cross Sections\nto\nZeitschrift für Angewandte Mathematik und Physik\n. It was published in the following year. In the paper they give the following acknowledgement:-\nThe authors are indebted to Dr\nD Borwein\nof the Mathematics Department, St Andrews University, for some helpful criticism during the preparation of this paper.\nA review of the paper states:-\nFor the problem of two-dimensional flow with constant shear past cylinders, the author shows that the original Tsien's method of solution\n[(1943)]\ncan be greatly simplified by using the natural co-ordinates where they exist. For examples, flows over elliptic and parabolic cylinders are calculated.\nHaving completed the work for his Ph.D. Murray was appointed as a Lecturer in Applied Mathematics, at King's College, Durham University in Newcastle upon Tyne in\n1955\n. He had to wait for three years from his first matriculation as a research student before he was allowed to graduate with a Ph.D. by the University of St Andrews for his thesis\nRotational Flow in Fluid Dynamics\nin\n1956\n.\nIt was the first Ph.D. in Applied Mathematics awarded by the University of St Andrews. In March of the same year he submitted\n(\njointly with\nRon Mitchell\n)\nthe paper\nFlow with Variable Shear Past Circular Cylinders\nto the\nQuarterly Journal of Mechanics an Applied Mathematics\n. The paper, published in\n1957\n, has the following abstract:-\nStream functions are obtained for two variable shear flows past a circular cylinder. The shear distributions in the free stream are of the ' linear' and ' boundary layer' type respectively. In both flows, the stagnation streamline is displaced in the free stream towards a region of higher Velocity. This is in agreement with the results obtained by the present authors\n(1)\nin the case of constant shear flow past a cylinder and with the experimental results of Young and Maas\n(2)\nfor a pitot tube of circular cross-section in a low-speed shear flow. The displacements in both variable shear flows are comparable in magnitude to the values obtained in the constant shear case but are considerably smaller than the experimental values of Young and Maas.\nAfter spending a year at King's College in Newcastle, Murray, who had always wanted to go to the United States, went to Harvard University where he spent\n1956\n-\n57\nas a postdoctoral student supported by a Sir James Caird Travelling Scholarship. He remained at Harvard for two further years\n(1957\n-\n59)\nas Gordon MacKay Lecturer and Research Fellow in Applied Mathematics. During this time he was also a Tutor in Applied Mathematics at Leverett House, the largest Residential House at Harvard.\nMurray married Sheila Campbell in\n1959\n; they had two children Mark and Sarah. Soon he was back in England because of what he described as \"family pressure\"\n[\n14\n]\n:-\nI came back to England, to University College London and two years later was elected Mathematics Fellow in Hertford College, Oxford. I actually got the position by mistake. The college fellow in charge of the appointment was a physicist who said to me that any person who gets a strong recommendation from Goldstein, must be good. It turns out the Goldstein he was thinking of was not the same Goldstein that had written my reference!\nThe excessive teaching was too much, he could not do any research so he handed in his resignation after a year which greatly upset the Principal. He returned to the United States in\n1963\nand was appointed as Research Associate in Engineering and Applied Physics at Harvard. After a year he moved to the University of Michigan where he was appointed as Associate Professor of Engineering Mechanics. After a year at Michigan he was promoted to full Professor of Engineering Mechanics.\nMurray had continued to work on fluid dynamics and had published papers such as\nNon-uniform shear flow past cylinders\n(1957)\n,\nThe flow of a conducting fluid past a magnetized cylinder\n(1960)\n,\nThe boundary layer on a flat plate in a stream with uniform shear\n(1961)\n,\nStrong cylindrical shock waves in magnetogasdynamics\n(1961)\n,\nOn the mathematics of fluidization. I. Fundamental equations and wave propagation\n(1965)\nand\nOn the mathematics of fluidization. II. Steady motion of fully developed bubbles\n(1965)\n. In\n1965\nhe gave an Invited survey lecture\nMathematical aspects of bubble motion in fluidized beds\nat the Symposium on Fluidized Particles run by the American Institute for Chemical Engineers in Houston, Texas.\nIt was while he was at the University of Michigan that Murray became interested in mathematical biology. He said\n[\n14\n]\n:-\nA professor of botany approached the department and asked if they could recommend anyone who could help him quantify how oxygen got into pea nodules. When the guy phoned me up he thought I was a graduate student and said he could offer me $\n5\nan hour! So, that was my introduction into mathematical biology: oxygen diffusion in pea nodules. After writing a few papers on it I found it quite interesting even though there was nothing too difficult about the mathematics as it was just singular perturbation analysis of the diffusion equation. I don't know how, but someone from anatomy heard about me and got in touch. His problem was on pilot ejection seat injuries. I got interested and the model consisted of a one-dimensional compressible material on one end of which we applied a force to simulate the chair lifting rapidly. This lead to a wave travelling up the rod, but the wave equation was nonlinear and so a shock developed.\nIn\n1967\nMurray was appointed as Professor of Mathematics at New York University but, after two years he returned to England where he was made a fellow and tutor at Corpus Christi College of the University of Oxford. He remained at Oxford for the remainder of his career, although he spent a number of months at various universities worldwide as a visiting professor.\nFrom\n1966\nuntil\n1973\nMurray published papers both on fluid dynamics and on mathematical biology. For example\nA theoretical study of the effect of impulse on the human torso\n(1966)\n,\nA simple method for obtaining approximate solutions for a class of diffusion-kinetic enzyme problems\n(\nPart I,\n1968\n; Part II,\n1968)\n,  and\nOn the molecular mechanism of facilitated oxygen diffusion by haemoglobin and myoglobin\n(1971)\nare on mathematical biology while\nA simple method for determining asymptotic forms of Navier-Stokes solutions for a class of large Reynolds number flows\n(1967)\n,\nSingular perturbations of a class of nonlinear hyperbolic and parabolic equations\n(1968)\nand\nOn Burgers' model equations for turbulenc\ne\n(1973)\nare on fluid dynamics. After\n1974\nall of Murray's publications\n(\naround\n200\nfrom\n1974\nup to\n2015)\nare on mathematical biology.\nMurray gave the\nIntroductory Remarks\nat the 'Theories of biological pattern formation', a Royal Society of London conference held on\n25\nand\n26\nMarch\n1981\n. These remarks give an interesting account of Murray's interest in Mathematical biology - an extract is available at\nTHIS LINK\n.\nMurray has published three single authored books\nAsymptotic Analysis\n(1974)\n,\nLectures on Nonlinear Differential Equation Models in Biology\n(1977)\n,\nMathematical biology\n(1989)\n, and, in addition, one multi-author work\nThe mathematics of marriage: dynamic nonlinear models\n(2002)\n, with John M Gottman, Catherine C Swanson, Rebecca Tyson and Kristin R Swanson. He has also been the editor\n(\nalong with S Brenner and L Wolpert\n)\nof the Proceedings of\nTheories of Biological Pattern Formation\n(1981)\n, the editor\n(\nalong with W Jäger\n)\nof the Proceedings of\nModelling of Patterns in Space and Time\n(1984)\n, and the editor\n(\nalong with H G Othmer, P K Maini\n)\nof the Proceedings of\nExperimental and Theoretical Advances in Biological Pattern Formation\n(1993)\n. We give extracts from reviews of various editions of Murray's four books at\nTHIS LINK\n.\nAt Oxford, Murray was a Reader in Mathematics from\n1972\nto\n1986\n, and Professor of Mathematical Biology from\n1986\n. He was Director of the Centre for Mathematical Biology at Oxford from\n1983\n. In\n1992\nMurray retired both from his chair of Mathematical Biology and from the Directorship of the Centre for Mathematical Biology. When he retired, Oxford made him an Emeritus Fellow at Corpus Christi College and an Emeritus Professor of Mathematical Biology. However, from\n1987\nMurray had, in addition to the Oxford positions, held appointments at the University of Washington in the United States. He was Robert F Philip Professor there from\n1987\nto\n1994\nand, in addition, Professor of Applied Mathematics, Adjunct Professor of Zoology. From\n1997\nto\n2000\nhe was Boeing Professor at the University of Washington and, in\n2000\n, he was made Emeritus Professor of Applied Mathematics at the University of Washington. In\n2010\n, now in his eightieth year, Murray became a Senior Scholar in Applied and Computational Mathematics at Princeton University and a Visiting Professor in Ecology and Evolutionary Biology at Princeton. He continues to undertake research at Princeton.\nDuring his long career, Murray has held numerous positions as Visiting Professor. These include: the National Tsing Hua University, Taiwan; the University of Florence; Massachusetts Institute of Technology; the University of Iowa; the University of Utah, Salt Lake City; the California Institute of Technology; the University of British Columbia, Vancouver; the University of Heidelberg; the University of Guelph; the Southern Methodist University, Dallas; the Los Alamos National Laboratory; the Neurosciences Institute, Rockefeller University, New York; the Institut de Biologie Théorique, Université d'Angers; and the University of Paris\n(\nIX-Dauphine\n)\n.\nFor his outstanding contributions to mathematical biology, Murray has received many honours and awards. These include election as a Fellow of the\nRoyal Society of Edinburgh\n(1979)\n, as a Fellow of the\nRoyal Society of London\n(1985)\n. He was awarded the\nLondon Mathematical Society\n's Naylor Prize in Applied Mathematics\n(1989)\n, became a Membre de l'Insitut de France\n(\nForeign member Académie des sciences\n)\n(2000)\n, was elected an Honorary Fellow, Corpus Christi College, University of Oxford\n(2001)\n,\nLectio doctoralis\n, University of Milan\n(2004)\n, and was awarded the Akiro Okubo Prize\n(2005)\n. The University of Washington created a donor endowed chair in perpetuity: the James D Murray Chair of Applied Mathematics in Neuropathology in\n2006\n. He was made an Honorary Member of the\nEdinburgh Mathematical Society\nin\n2008\n, received the\nRoyal Society\n's Bakerian Medal and Prize Lecture\n(2009)\n, Institute of Mathematics and its Applications, Gold Medal\n(2009)\n, European Academy of Sciences'\nLeonardo da Vinci\nMedal\n(2011)\n, and the William Benter Prize in Applied Mathematic\n(2012)\n. He has received honorary degrees from the University of St Andrews\n(1994)\n, the University of Strathclyde\n(1999)\n, the University of Milan\n(2004)\n, the University of Waterloo\n(2006)\nand the University of Dundee\n(2011)\n."
}