{
  "nome_completo": "James Joseph Sylvester",
  "nome_curto": "James Joseph Sylvester",
  "ano_nascimento": "1814",
  "ano_morte": "1897",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sylvester/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "James Joseph Sylvester\n's father was Abraham Joseph who was a merchant. The first strange fact\n(\nwhich the careful reader may already have noticed!\n)\nis that Sylvester's father had the surname Joseph, and not Sylvester. Indeed the subject of this biography grew up with the name James Joseph and it was only shortly before he began his university studies that he decided to add the surname Sylvester. One might ask at this point why he added an extra name. The reason was that his eldest brother decided at this time to emigrate to the United States and he was required to have at least three names before he was allowed to gain residence. We should also mention at this point the fact that Sylvester was born into a Jewish family, and brought up in the Jewish faith, which would lead to difficulties later in his life which we describe below.\nSylvester attended two schools in London, the first one being a boarding school in Highgate which he attended up to\n1827\n, after which he undertook a further eighteen months study at a school in Islington. In\n1828\n, at the age of fourteen, he entered University College London, and began his studies in the first year that the College received students. This was a sensible choice since, unlike some other British universities, it was non-sectarian. It also had the very talented\nDe Morgan\nas its professor of mathematics. However things did not go well for Sylvester for, when only five months into his studies, he was accused of threatening a fellow student with a knife in the College refectory. Sylvester's family withdrew him from University College immediately after the allegations were made. Realising that, although Sylvester was able to profit from university education, he was not yet mature enough for university life, his family sent him to continue his schooling at the Royal Institution in Liverpool.\nOn\n7\nJuly\n1831\nSylvester matriculated as a student at St John's College, Cambridge, although his studies were interrupted when he was forced to take most of the two years\n1833\n-\n34\nand\n1834\n-\n35\nout due to a lengthy illness. After regaining his health he took the mathematical tripos examination in\n1837\n. Two other famous mathematicians took the tripos examination in the same year as Sylvester, namely\nDuncan Gregory\nand\nGeorge Green\n. Sylvester came second,\nGreen\nwho was\n20\nyears older than the other two came fourth, with\nDuncan Gregory\nfifth.\n(\nThe mathematician who came first, William Griffin, did little work of importance after graduating: this was not at all uncommon a result of the 'speed test' which the tripos was at that time.\n)\nWe were careful to say that Sylvester took the tripos examination in\n1837\nrather than saying he graduated in that year, for he was not able to graduate. At this time it was necessary for a student to sign up to the Thirty-Nine Articles of the Church of England before graduating and Sylvester, being Jewish, naturally refused to take the necessary oath so could not graduate. For the same reason he was not eligible for a Smith's prize nor was he eligible to compete for a Fellowship.\nFor the three years from\n1838\nSylvester held the chair of natural philosophy at the University of London, one of the few places which did not bar him because of his religion. His former teacher\nDe Morgan\nwas one of his colleagues. However Sylvester was a mathematician and it was mathematics, not physics, that he wished to teach. He was a very active researcher and by the time he resigned the chair of natural philosophy in\n1841\nhe had published fifteen papers on fluid dynamics and algebraic equations. Sylvester might have been a professor for three years but he still had no degree for the reason we indicated above. He remedied this in\n1841\nwhen he was awarded a B.A. and an M.A. by Trinity College, Dublin. In fact it was legislation which allowed Roman Catholics to take degrees at Trinity College which also meant that Jews could graduate there.\nAt the age of\n27\nhe applied for, and was appointed to, the chair of mathematics in the University of Virginia in Charlottesville in the United States. His application was strongly supported by\nDe Morgan\n,\nJohn Herschel\nand\nCharles Babbage\n. For example\nDe Morgan\nwrote:-\nNo person of his years in this country has more reputation than Mr Sylvester as an original mathematician, or bids fairer to extend the exact sciences by his labours. From my own knowledge of what he has done, I can safely say that he is a mathematician of great power, well acquainted with the most modern forms of the science, and very zealous in the persecution of his inquiries.\nHowever he resigned after only a few months in post. The following version of events is recorded by Feuer in\n[\n11\n]\n. A student who had been reading a newspaper in one of Sylvester's lectures insulted him and Sylvester struck him with a sword stick. The student collapsed in shock and Sylvester believed\n(\nwrongly\n)\nthat he had killed him. He fled to New York where one of his elder brothers was living. Although this story is probably accurate in one sense, in another it gives a quite false impression of events. There is no doubt that the students at the University of Virginia were very badly behaved and their behaviour was made worse by drink. It is also likely that they reacted more against Sylvester as a foreigner although there are many records of abusive behaviour before Sylvester arrived. Certainly Sylvester complained to the Faculty on\n1\nFebruary\n1842\nabout the behaviour of a particular first year student. The abuse suffered by Sylvester from this student got worse after this. Although the student was reprimanded by the university authorities, no sanctions were made against him. Sylvester objected to the lenient attitude of the Faculty on\n19\nMarch and resigned three days later.\nIn New York he began to look for university positions. After two unsuccessful bids for posts at Columbia College and Harvard, he boarded a ship back to England on\n20\nNovember\n1843\n. He suffered another upset while in New York. He met a local girl, Miss Marston, and became very fond of her. He proposed marriage but she turned him down on the grounds that he was of the Jewish religion.\nOn his return to England Sylvester worked as an actuary and was secretary at the Equity Law and Life Assurance Company. However, he also gave mathematics tuition with his pupils including\nFlorence Nightingale\n. He decided to study law and, by good fortune,\nCayley\nwas also studying to become a lawyer. Both met at the courts of Lincoln's Inn in London and they discussed mathematics as they walked around the courts and, although very different in temperament, they became life long friends.\nSylvester tried hard to return to being a professional mathematician and he applied for a lectureship in geometry at Gresham College, London in\n1854\nbut he was not appointed. Another failed application was for the chair in mathematics at the Royal Military Academy at Woolwich, but, after the successful applicant died within a few months of being appointed, Sylvester became professor of mathematics at Woolwich.\nSylvester did important work on\nmatrix theory\n, a topic in which he became interested during walks with\nCayley\nwhile they were at the courts of Lincoln's Inn. In\n1851\nhe discovered the\ndiscriminant\nof a\ncubic equation\nand first used the name 'discriminant' for such expressions of\nquadratic equations\nand those of higher order.\nYou can see more about the discriminant at\nTHIS LINK\n.\nHe published important papers in\n1852\nand\n1853\n, namely\nOn the principle of the calculus of forms\nand\nOn the theory of syzygetic relations and two rational integer functions\n. In particular he used matrix theory to study higher dimensional geometry. He also contributed to the creation of the theory of elementary divisors of lambda matrices.\nDe Morgan\nwas the first president of the\nLondon Mathematical Society\n. Sylvester became the second president of that Society in\n1866\n. He was the first recipient of the gold medal which the Society awarded to honour\nDe Morgan\n. He had also been elected to the\nParis Academy of Sciences\nin\n1863\nand had been a fellow of the\nRoyal Society of London\nsince\n1839\n. Being at a military academy Sylvester was forced to retire at age\n55\n. Parshall writes\n[\n21\n]\n:-\nDuring his last five years there, in fact, Sylvester frequently found himself at odds with the military authorities over his teaching duties and increasingly sensed the diminishment of his mathematical talents.\nAfter retiring in\n1870\nhe lived in London, spending most days at the Athenaeum Club\n(\nhe had been elected a member of the Club in\n1856)\n. At first it looked as though he might give up mathematics since he published his only book at this time and it was on poetry. Clearly Sylvester was proud of this work, entitled\nThe Laws of Verse\n, since after this he sometimes signed himself \"J J Sylvester, author of The Laws of Verse\". Parshall writes\n[\n21\n]\n:-\nSylvester's love of poetry and language manifested itself in notable ways even in his mathematical writings. His mastery of French, German, Italian, and Greek was often reflected in the mathematical neologisms - like \"meicatecticizant\" and \"tamisage\" - for which he gained a certain notoriety. Moreover, literary illusions, poetic quotations, and unfettered hyperbole spiced his published papers and lectures.\nFor three years Sylvester appears to have done no mathematical research but then\nChebyshev\nvisited London and the two discussed mechanical linkages which can be used to draw straight lines. After working on this topic Sylvester lectured on it at an evening lecture entitled\nOn recent discoveries in mechanical conversion of motion\nwhich he gave at the Royal Institution. One mathematician in the audience at this lecture was\nKempe\nand he became absorbed by this topic.\nKempe\nand Sylvester worked jointly on linkages and made important discoveries.\nIn\n1877\nSylvester accepted a chair at Johns Hopkins University and he founded in\n1878\nthe\nAmerican Journal of Mathematics\n, the first mathematical journal in the United States. In fact the seven years that Sylvester spent at Johns Hopkins saw a resurgence in his mathematical interests. For the first time in his career he was teaching and undertaking research in a proper university environment and, moreover, he was able to  give leadership in a way that had not been possible throughout the rest of his career. For the first time he had research students around him whose studies he could supervise in directions which his interests took him. In fact he supervised the doctorates of nine students during his seven years at Johns Hopkins. His research interests reinvigorated, he involved his students in important ideas in the theory of partitions which he undertook during these years. He published this work in the\nAmerican Journal of Mathematics\nwhich he had founded. Given that he was so successful at Johns Hopkins, one has to ask why he left when he did. We know of his reasons through a personal letter he wrote to\nKlein\nwho considered succeeding him but found the salary and conditions insufficient. Sylvester certainly wanted to return to his native land and had some personal reasons to return. However, his main reason was\n(\nsee\n[\n5\n]\n)\n:-\n... because I did not consider that my mathematical rerudition was sufficiently extensive nor the vigour of my mental constitution adequate to keep me abreast of the continually advancing tide of mathematical progress to that extent which ought to be expected from one on whom practically rests the responsibility of directing and moulding the mathematical education of\n55\nmillion of one of the most intellectual races of men upon the face of the earth.\nWhen\nSmith\ndied in\n1883\nSylvester, although\n68\nyears old at this time, was appointed to the Savilian chair of Geometry at Oxford. However Sylvester only liked to lecture on his own research and this was not well liked at Oxford where students wanted only to do well in examinations. In\n1892\n, at the age of\n78\n, Oxford appointed a deputy professor in his place and Sylvester, by this time partially blind and suffering from loss of memory, returned to London where he spent his last years at the Athenaeum Club.\nMacfarlane\n[\n17\n]\ndescribes Sylvester in the following way:\nSylvester was fiery and passionate ... Sylvester never wrote a paper without foot-notes, appendices, supplements, and the alterations and corrections in his proofs were such that the printers found their task well-nigh impossible. ... Sylvester satisfied the popular idea of a mathematician as one lost in reflection, and high above mundane affairs. ... Sylvester was an orator, and if not a poet, he at least prided himself on his poetry.\nOne of Sylvester's students at Johns Hopkins University describes his teaching there:-\n... the substance of his lectures had to consist largely of his own work, and, as a rule, of work hot from the forge. The consequence was that a continuous and systematic presentation of any extensive body of doctrine already completed was not to be expected from him. Any unsolved difficulty, any suggested extension, such would have been passed by with a mention by other lecturers, became inevitably with him the occasion of a digression which was sure to consume many weeks, if indeed it did not take him away from the original object permanently. Nearly all of the important memoirs which he published, while in Baltimore, arose in this way. We who attended his lectures may be said to have seen these memoirs in the making.\nThe following quote, from\nThomas Hirst\n, tells us something about Sylvester's personality:-\nOn Monday having received a letter from Sylvester I went to see him at the Athenaeum Club. ... He was, moreover, excessively friendly, wished we lived together, asked me to go live with him at Woolwich and so forth. In short he was eccentrically affectionate.\nSylvester sent the following puzzle to the\nEducational Times\n. It tells us of one of his hobbies as well as his interest in puzzles:-\nI have a large number of stamps to the value of\n5\nd and\n17\nd only. What is the largest denomination which I cannot make up with a combination of these two different values.\n[\nThe answer is\n63\nd. Can you prove this!\n]"
}