{
  "nome_completo": "James MacCullagh",
  "nome_curto": "James MacCullagh",
  "ano_nascimento": "1809",
  "ano_morte": "1847",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/MacCullagh/",
  "lugar_nascimento": "Landahussy (near Strabane), Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "James MacCullagh\n's father was James MacCullagh\n(1777\n-\n1857)\nand his mother was  Margaret MacCullagh\n(1784\n-\n1839)\n. He was the eldest of his parents' twelve children, only eight of whom\n(5\nboys and\n3\ngirls\n)\nsurvived early childhood.\nJames began his education at the school in Castledamph and then the family moved to Strabane so that he could receive a good education. His mathematical talents were soon evident, see\n[\n2\n]\n:-\nIn Strabane he was, while very young, placed at the only respectable school at that time in the town. Here his genius soon displayed itself. After school hours he was almost constantly employed in solving mathematical problems...\nTo take up a study of the classics he was sent to another school, this time in Lifford. At the age of fifteen MacCullagh entered Trinity College, Dublin. His undergraduate career was one in which he received the highest grade in almost every examination he took. He graduated in\n1829\nand, after graduating, he entered the Fellowship examinations. In\n[\n4\n]\nhis attempt in this examination is related:-\nMacCullagh entered for the highly competitive fellowship examination, conducted orally in Latin. He was unsuccessful, a hardly surprising result when it is realised how much cramming was required. However, given his youth and inexperience, his performance was nor discreditable, his mark in mathematics being equal to that awarded to the two successful candidates...\nNot long after failing the Fellowship examination MacCullagh submitted his first papers for publication. One was a paper on giving geometrical results on\nconic sections\n, the other was on light, in particular on double\nrefraction\nin which he gave a clear construction of the\nFresnel\nwave surface.\nHamilton\nwrote a review of these papers in\n1830\n.\nTwo years later MacCullagh tried again for a Fellowship but this time, after being told that his first answer to the first mathematics question was wrong he refused to answer any further questions. Not surprisingly he failed but immediately he learnt this he sent a letter containing geometrical theorems on the theory of rotations to the examiners. The results were original but, unfortunately for MacCullagh, had been obtained independently by\nPoinsot\nwho published them in\n1834\n.\nMacCullagh did succeed in obtaining a fellowship in\n1832\nand he was appointed junior assistant to the mathematics professor in Dublin.\nIn\n1833\nHamilton\nannounced his discovery of conical refraction of light. This was a major discovery and, following\nHamilton\n's announcement, MacCullagh published a note on conical refraction in which he claimed at least partial priority for the discovery of conical refraction. He wrote:-\nThe indeterminate cases of my own theorems, which, optically interpreted, mean conical refraction, of course occurred to me at the time...\nMacCullagh was particularly cross since he knew\nHamilton\nhad studied his\n1830\npapers containing these theorems since\nHamilton\nhad reviewed them.\nHamilton\nwas equally cross that his priority for the discovery of conical refraction was being challenged. MacCullagh was forced to admit, what was clearly the truth, that although conical refraction could be deduced from his theorems he had only made that deduction after\nHamilton\nhad announced the discovery. MacCullagh had been close to a great discovery but had just failed to make the final step.\nIn\n1835\nMacCullagh published on crystalline refraction and reflection. Later he discovered that\nFranz Neumann\nhad read a paper on the subject to the\nBerlin Academy\nin December\n1835\nwhich was published in\n1837\n. The two theories were identical except that\nFranz Neumann\ndeveloped the theory much further. MacCullagh wrote:-\nFranz Neumann\n's paper is very elaborate, and supersedes, in a great measure, the design which I had formed of treating the subject more fully at my leisure...\nAlthough MacCullagh had priority,\nFranz Neumann\nhad stolen the glory and again MacCullagh had missed out. He produced several other papers on light, the most important being in\n1839\nwhen he applied methods used by\nGreen\nto study reflection and refraction of waves at a surface. Also in\n1839\nMacCullagh was made an honorary member of the St Andrews Literary and Philosophical Society which had been founded by David Brewster.\nIn\n1842\nat a meeting of the\nBritish Association\nin Manchester, there was a discussion on the wave or particle nature of light in which\nHamilton\n, MacCullagh,\nBessel\n,\nJacobi\n,\nPeacock\n, David Brewster and others took part. Later in\n1842\nMacCullagh was awarded the Copley medal of the\nRoyal Society\n, a particularly great achievement since\nBessel\nwas among those considered for the award.\nIn February\n1843\nMacCullagh was elected a fellow of the\nRoyal Society\n. Also in\n1843\nMacCullagh published his most important work on geometry, namely\nOn surfaces of the second order\nwhich described how surfaces such as the ellipsoid could be generated. Although he produced much less work on geometry than on light, it is his work on geometry which has survived and proved in the end the more important. His work on light was of course of less importance after\nMaxwell\npublished his electro-magnetic theory of light in\n1865\n.\nMacCullagh corresponded with many scientists, in particular with\nJohn Herschel\nand with\nBabbage\n. He also met with many scientists, some of which have been mentioned above, but during a visit to Turin in\n1840\nhe was invited to\nBabbage\n's apartments and there met, among others,\nPlana\nand\nMenabrea\n.\nOn Sunday\n24\nOctober\n1847\nMacCullagh committed suicide in his rooms in Dublin. The reasons for his suicide are hard to determine but the best clue may be in a letter which he wrote to\nBabbage\nfive years before in which he wrote\n(\nsee\n[\n4\n]\n)\n:-\n... I have grown very stupid of late, and regularly fail at everything I attempt. What the reason may be I cannot tell. But I begin to be of\nNewton\n's opinion, that after a certain age, a man may as well give up mathematics. ..."
}