{
  "nome_completo": "James Waddell Alexander",
  "nome_curto": "James Alexander",
  "ano_nascimento": "1888",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Alexander/",
  "lugar_nascimento": "Sea Bright, New Jersey, USA",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "James Alexander\n's father was John White Alexander and his mother was Elizabeth Alexander. The name Waddell came through his grandfather on his mother's side, John Waddell Alexander who was the President of the Equitable Life Assurance Society. John White Alexander was quite famous in his own right as an artist and painter of murals.\nAlexander studied mathematics and physics at Princeton, where he was a student of\nVeblen\n, obtaining a B.S. degree in\n1910\nand an M.S. degree in\n1911\n. From\n1911\nto\n1912\nhe served as an instructor in the mathematics department at Princeton. Then in\n1912\nhe went to Europe to further his studies.\nDuring this period abroad, Alexander studied at Paris and Bologna. He returned to Princeton where he submitted his dissertation\nFunctions which map the interior of the unit circle upon simple regions\nand, in\n1915\n, was awarded his Ph.D. He was appointed as a instructor at Princeton in\n1915\n, being made a lecturer in\n1916\n. Of course this was the time when the United States required the expertise of mathematicians to solve problems which related to the military needs created by World War I. In\n1917\n, after marrying Natalia Levitzkaja on\n15\nJanuary, later that year Alexander served as a lieutenant in the U.S. Army Ordnance Office at the Aberdeen Proving Ground. This was a military weapons testing site, established in\n1917\nin Aberdeen, Maryland.\nBy the end of the war Alexander had reached the rank of captain. Leaving military service, he returned to Princeton where he was an assistant professor from\n1920\n, being promoted to associate professor in\n1926\nand full professor in\n1928\n. From\n1933\nuntil he retired in\n1951\nhe was a member of the Institute for Advanced Study in Princeton. Alexander, however, never drew a salary from the Institute for Advanced Study. He had become a millionaire through inherited wealth and, a rich man, was in no need of a salary. During World War II, Alexander again did war work, but on this occasion he did not rejoin the army. He worked during World War II as a civilian for the U.S. Army Air Force at their Office of Scientific Research and Development.\nDuring the early\n1950\ns senator Joseph R McCarthy whipped up strong feelings against communism in the United States. Alexander, who held left-wing political views, began to come under suspicion from authorities who saw imaginary problems everywhere. Alexander had virtually become a recluse after he retired in\n1951\nand the McCarthy era resulted in his disappearance from public life. The last time he was seen in public was July\n1954\nwhen he signed a statement of support for J Robert Oppenheimer who had lost his security clearance.\nIn a collaboration with\nVeblen\n, he showed that the\ntopology\nof\nmanifolds\ncould be extended to polyhedra. Before\n1920\nhe had shown that the\nhomology\nof a simplicial complex is a topological invariant. Alexander's work around this time went a long way to put the intuitive ideas of\nPoincaré\non a more rigorous foundation. Also before\n1920\nAlexander had made fundamental contributions to the theory of algebraic surfaces and to the study of\nCremona\ntransformations.\nSoon after arriving in Princeton, Alexander generalised the\nJordan\ncurve theorem and continued his work, now exclusively on topology, with an important paper on the\nJordan\n-\nBrouwer\nseparation theorem. This latter paper contains the Alexander Duality Theorem and Alexander's lemma on the\nn\nn\nn\n-sphere. In\n1924\nhe introduced the now famous Alexander horned sphere.\nIn\n1928\nhe discovered the Alexander polynomial which is much used in\nknot theory\n. In the same year the\nAmerican Mathematical Society\nawarded Alexander the\nBôcher\nPrize for his memoir,\nCombinatorial analysis situs\npublished in the\nTransactions of the American Mathematical Society\ntwo years earlier. Knot theory and the combinatorial theory of complexes were the main topics on which he worked over the following few years.\nThe theory which is now called the Alexander-Spanier cohomology theory, was introduced in\n1935\nby Alexander but was generalised by Spanier in\n1948\nto the form seen today. Also around\n1935\nAlexander discovered\ncohomology\ntheory, at essentially the same time as\nKolmogorov\n, and the theory was announced in the\n1936\nMoscow Conference.\nZund, in\n[\n4\n]\nwrites:-\nA mathematician of unusual depth and power, Alexander was a principal figure in the American development of\nalgebraic\n/combinatorial topology. ... His papers were very carefully written and were very influential in the United States and abroad. Much of his work was of such a basic character that it became common knowledge in topology, with its discoverer being forgotten as a result...\nAlexander's character is also described in\n[\n4\n]\n, where he is said to have been:-\n... an imposing figure who possessed great charm and a very \"youthful\" view of mathematics, being one of the first American mathematicians to fully appreciate the use of modern algebraic methods in topology. Colleagues remember his great fondness for limericks and his passion for mountain climbing.\nAmong the many honours bestowed on Alexander was his election to the\nAmerican Academy of Sciences\nin\n1930\n."
}