{
  "nome_completo": "Jan Łukasiewicz",
  "nome_curto": "Jan Łukasiewicz",
  "ano_nascimento": "1878",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lukasiewicz/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "Jan Łukasiewicz\n's father, Luke Łukasiewicz, was a captain in the Austrian army. Although his father was Polish speaking, he was living in Lemberg\n(\nwhich is now known as Lviv and is in Ukraine\n)\nwhich is in Galicia and was attached to Austria in the\n1772\npartition of Poland. However, by the time Łukasiewicz was born in Lemberg, Austria had named the region the Kingdom of Galicia and Lodomeria and given it a large degree of administrative autonomy. Jan's mother, Leopoldine Holtzer, was the daughter of an Austrian civil servant and both Leopoldine and Luke were Roman Catholics.\nŁukasiewicz was interested in mathematics at school and he entered the University of Lemberg where he studied mathematics and philosophy. Following his undergraduate studies, he continued to work for his doctorate which was awarded in\n1902\nwith the highest distinction possible. Wishing to lecture in universities, Łukasiewicz continued to study for his\nhabilitation\n, submitting his thesis to the University of Lemberg in\n1906\n.\nOnce he had been awarded his habilitation, Łukasiewicz began to lecture at a\nPrivatdozent\n. Then in\n1911\nhe was promoted to an extraordinary professor at Lemberg. Soon large changes in Poland would present new opportunities to Łukasiewicz.\nSince the partition of Poland, Russia had controlled that part of the country called Congress Poland, which included Warsaw. The University of Warsaw had been closed and only a Russian language university operated there. At the outbreak of World War I, the Central Powers\n(\nGermany and Austria- Hungary\n)\nattacked Congress Poland. In August\n1915\nthe Russian forces withdrew from Warsaw. Germany and Austria-Hungary took control of most of the country and a German governor general was installed in Warsaw. One of the first moves after the Russian withdrawal was the refounding of the University of Warsaw and it began operating as a Polish university in November\n1915\n.\nŁukasiewicz was invited to the new University of Warsaw when it reopened in\n1915\n. It was an exciting time in Poland and a new Kingdom of Poland was declared on\n5\nNovember\n1916\n. Łukasiewicz was Polish Minister of Education in\n1919\nand a professor at Warsaw University from\n1920\nto\n1939\n. During this period between the wars Łukasiewicz was twice rector of Warsaw University.\nDuring this time Łukasiewicz and\nLesniewski\nfounded the Warsaw School of Logic.\nTarski\n, who was a student of\nLesniewski\n, would make this school internationally famous. Łukasiewicz published his famous text\nElements of mathematical logic\nin Warsaw in\n1928\n(\nthe English translation appeared in\n1963)\n:\n[\n1\n]\n:-\n... viewing mathematical logic as an instrument of enquiry into the foundations of mathematics and the methodology of empirical science, Łukasiewicz succeeded in making it a required subject for mathematics and science students in Polish universities. His lucid lectures attracted students of the humanities as well.\nŁukasiewicz had married Regina Barwinska and they suffered great hardships during World War II. Łukasiewicz wrote an autobiography in\n1953\nand, after his death it was published by his widow Regina Łukasiewicz\n[\n6\n]\n. The suffering of Łukasiewicz is graphically illustrated in this autobiography. Łukasiewicz and his wife fled from Poland and in\n1946\nthey were in exile in Belgium when he was offered a chair by the University of Dublin in Ireland.\nHe worked on mathematical logic, wrote essays on the principle of non-contradiction and the excluded middle around\n1910\n, developed a three value propositional calculus\n(1917)\nand worked on many valued logics.\nŁukasiewicz introduced the 'Polish notation' which allowed expressions to be written unambiguously without the use of brackets and his studies were to form the basis for\nTarski\n's work.\nIn November\n2022\n, Łukasiewicz's remains were transferred from Dublin to Warsaw and buried in Warsaw's Old Powązki Cemetery."
}