{
  "nome_completo": "Jean-Marie Le Roux",
  "nome_curto": "Jean-Marie Le Roux",
  "ano_nascimento": "1863",
  "ano_morte": "1949",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Le_Roux/",
  "lugar_nascimento": "Prat, Côtes-d'Armor, France",
  "lugar_morte": "Rennes, France",
  "biografia": "Jean-Marie Le Roux\nwas the son of Louis Le Roux and Marie Anne Geffroy. He was born in Prat, a small town in Brittany near the north coast of France between Lannion and Guingamp, where his parents were farmers. He was from a Roman Catholic family and followed that faith throughout his life. He grew up bilingual, speaking both French and the Breton language. In fact in the later part of his life he made translations into Breton and proposed a unified spelling. We say more about his work with Breton dialects at the end of this biography.\nWe have found it difficult to sort out exactly how Le Roux achieved his mathematical education. The first definite date that we have is that he became a primary school teacher in Guingamp in\n1882\nwhen he was nineteen years old. The primary school in Guingamp was actually situated in the Chateau de Pierre II and Le Roux taught there for seven years until he passed his agrégation examination in mathematics in\n1889\n. The agrégation is a competitive examination which qualifies students to teach in lycées and, having passed the examination, Le Roux became a teacher of mathematics at the lycée at Brest in\n1889\n. Brest is a port on the north western peninsula of France. It is in Brittany and the lycée would be bilingual with teaching both in French and Breton.\nWhile Le Roux was Professor of Special Mathematics at the lycée in Brest, he was also working towards his doctorate. He submitted his doctoral thesis\nSur les intégrales des équations linéaires aux dérivées partielles du second ordre à deux variables indépendantes\nⓉ\n(\nOn integrals of linear second order partial differential equations with two independent variables\n)\nto the Sorbonne in Paris in\n1894\nand he was examined by the jury consisting of\nGaston Darboux\n,\nGabriel Koenigs\nand\nPaul Appell\non\n24\nJanuary\n1895\n. In his thesis he described himself as a pupil of Paul Morin of the University of Rennes. Paul Morin held the chair of rational mechanics in the Faculty of Sciences at Rennes from\n1877\n. Le Roux writes in the thesis:-\nThe purpose of this work is to study some properties of functions defined by a linear homogeneous equation with second-order partial derivatives, of\nLaplace\nform. It is divided into three Parts: In the first, I demonstrated the existence of an infinity of particular integrals from which we can deduce more general solutions by quadratures with variable limits relating to an arbitrary function. I called them 'principal integrals'. I have studied the series developments of these functions and of some of the integrals which follow from them. The second Part is devoted to the study of places of what I call 'accidental singular points', namely those which derive from the initial data defining the integrals and not from the particular form of the coefficients of the equation. I have defined normal integrals and demonstrated that they cannot have accidental singular curves other than characteristics. After having studied the form of the integrals in the vicinity of the critical points, I have shown how one can integrate the equation starting from it, particular solutions which admit singular moveable characteristics. In the third Part, I applied the previous theories to some simple equations. I have endeavoured, as far as possible, to deduce all the results with a general and uniform method.\nIt is unclear whether Le Roux studied for a first degree at the University of Rennes or whether he just received support from Paul Morin. Certainly the level of science teaching at the University of Rennes was low at this time so, whatever route Le Roux adopted, he must have reached a high level of mathematical achievement mainly though his own studies. Le Roux published a\n20\n-page paper with the same title as his thesis in the\nAnnales scientifiques de l'École Normale Supérieure\nin\n1895\n. This paper is essentially his thesis while the thesis itself was published in Paris by Gauthier-Villars et Fils, also in\n1895\n. In the same year he published the paper\nSur les intégrales analytique de l'équation\n∂\n2\nz\n/\n∂\ny\n2\n=\n∂\nz\n/\n∂\nx\n\\partial ^{2}z/\\partial y^{2} = \\partial z/\\partial x\n∂\n2\nz\n/\n∂\ny\n2\n=\n∂\nz\n/\n∂\nx\nⓉ\n(\nOn analytical integrals of the equation ∂\n2\nz\n/∂\ny\n2\n= ∂\nz\n/∂\nx\n)\nin the\nBulletin des Sciences Mathématiques\nwhich had been founded by\nGaston Darboux\nin\n1870\nand at that time was known as the\nDarboux Bulletin\n.\nLe Roux moved from Brest to Montpellier in\n1896\n. His two publications of\n1895\nwere the first of many papers he published over the following years. For example, his next publications were\nSur une équation linéaire aux dérivées partielles du second ordre\nⓉ\n(\nOn a linear second-order partial differential equation\n)\n(1896)\n,\nSur une forme analytique des intégrales des équations linéaires aux dérivées partielles à deux variables indépendantes\nⓉ\n(\nOn an analytical form of the integrals of linear partial differential equations with two independent variables\n)\n(1897)\n,\nSur l\"équation des télégraphistes\nⓉ\n(\nOn the equation of telegraph operators\n)\n(1897)\n,\nSur l\"équation linéaire aux dérivées partielles du premier ordre\nⓉ\n(\nOn a linear first-order partial differential equation\n)\n(1897)\n,\nSur les invariants des équations linéaires aux dérivées partielles à deux variables indépendantes\nⓉ\n(\nOn the invariants of linear partial differential equations with two independent variables\n)\n(1898)\n,\nSur l\"intégrabilité des équations linéaires aux dérivées partielles du second ordre par la méthode de Laplace\nⓉ\n(\nOn the integrability of linear second order partial differential equations by the Laplace method\n)\n(1898)\n, and\nSur les équations linéaires aux dérivées partielles\nⓉ\n(\nOn linear partial differential equations\n)\n(1898)\n.\nThe last mentioned of these publications\nSur les équations linéaires aux dérivées partielles\nⓉ\n(\nOn linear partial differential equations\n)\nwas published as a\n50\n-page paper in the\nJournal des Mathématiques Pures et Appliquées\nand as a\n50\npage book in Paris. This is an in-depth study of linear partial differential equations of higher order with two independent variables, based on the results obtained for those of second order. This work contains results already published in earlier papers by Le Roux and may have been written for him to gain admission as a university teacher since it reads like an\nhabilitation\n.\nLe Roux married Rose Marie Laurence Tregoat in Callac, Côtes-d'Armor, Brittany, on\n18\nOctober\n1897\n. Rose Marie, the daughter of François Marie Trégoat and Marie Gabrielle Le Rudulier, had been born on\n8\nDecember\n1876\nin Callac. She was the fourth of her parents' nine children\n(\nsix boys and three girls\n)\n, having three older brothers. She came from a religious family and she was given the name Laurence because of the church of Saint-Laurent in Callac. Her primary education had been with the Sisters of the Holy Spirit on the Rue du Cleumeur, and her secondary education was at a boarding school in Plestin-les-Grèves. In\n[\n2\n]\nLe Roux is described as a \"young widower of\n34\n\" at the time of the marriage. We have not been able, however, to find any information about his previous marriage. Let us quote from\n[\n4\n]\n:-\nThe marriage took place on\n18\nOctober\n1897\nand the ceremony was the occasion to see famous people arriving at Callac by the new means of transport put into service by the Breton Network\n[\nrailway\n]\nin\n1893\n; let us quote\nGabriel Koenigs\n, famous professor of the Faculty of Paris, and friend of Jean Marie Le Roux: \"Rose Marie was not left on her own because she was accompanied by her older brother, Pierre, a merchant in Lannion and her younger brother, Joseph Gilles, polytechnician and Lieutenant of the Marine Artillery garrison in Cherbourg. Her father, François Marie, previously a\n1\nst class surveyor of roads, then retired from the post for health reasons in\n1880\n, had become a trader, timber merchant and municipal councillor.\" The very happy couple soon travelled to the distant city of Montpellier, passing through Paris and travelling first on the Compagnie de L\"Ouest\n[\nearly French railway company\n]\nthen on the Paris-Lyon-Marseille\n(\nPLM\n)\nrailway. In the following year, in July, they went the opposite way for the birth of their daughter Gabrielle Marie Laurence Le Roux on\n12\nAugust\n1898\nin Callac. Jean Marie Le Roux had just been appointed a Lecturer in Mathematics at the Faculty of Science at the University of Rennes.\nAt the time of his marriage, Le Roux was working in Montpellier. In\n[\n4\n]\nhe is described as being an assistant lecturer at the Faculty of Science in Montpellier but other sources\n(\nfor example\n[\n5\n]\n)\nsay that he was a professor at the lycée in Montpellier. The first of these seems more likely since Le Roux was very much a Brittany person so one would not expect him to go from a lycée in Brest to a lycée Montpellier. To go to Montpellier to an appointment in the Faculty of Science would make more sense as would his return from Montpellier to Rennes in\n1898\nto an assistant lecturer position at the University of Rennes. Certainly in\n1898\nLe Roux was appointed as an assistant lecturer at the University of Rennes, was promoted to Professor of Applied Mathematics in\n1902\n, and remained at Rennes for the rest of his career.\nWe listed above his publications up to\n1898\n. Here are his eleven publications from\n1899\nto\n1903\n:\nExtension de la méthode de Laplace aux équations linéaires aux dérivées partielles d\"ordre supérieur au second\nⓉ\n(\nExtension of the Laplace method to linear equations with partial derivatives of higher order than the second\n)\n(1899)\n,\nSur une inversion d\"intégrale double\nⓉ\n(\nOn a double integral inversion\n)\n(1900)\n,\nSur l\"intégration des équations linéaires aux dérivées partielles\nⓉ\n(\nOn the integration of linear partial differential equations\n)\n(1900)\n,\nSur l\"intégration des équations linéaires à discriminant non nul\nⓉ\n(\nOn the integration of  linear equations with non-zero discriminants\n)\n(1900)\n,\nSur un invariant d\"un système de deux triangles et la théorie des intégrales doubles\nⓉ\n(\nOn an invariant of a system of two triangles and the theory of double integrals\n)\n(1900)\n,\nSur les fonctions qui dépendent d\"une infinité de constantes arbitraires\nⓉ\n(\nOn functions which depend on an infinity of arbitrary constants\n)\n(1902)\n,\nSur une classe de groupes infinis\nⓉ\n(\nOn a class of infinite groups\n)\n(1902)\n,\nSur les intégrales des équations linéaires aux dérivées partielles\nⓉ\n(\nOn integrals of linear partial differential equations\n)\n(1903)\n,\nRecherches sur les équations aux dérivées partielles\nⓉ\n(\nResearch on partial differential equations\n)\n(1903)\n,\nIntégration d\"une èquation aux dérivées partielles à une infinité de variables indépendantes\nⓉ\n(\nIntegration of a partial differential equation with an infinity of independent variables\n)\n(1903)\n, and\nLes fonctions d\"une infinité de variables indépendantes\nⓉ\n(\nThe functions of an infinity of independent variables\n)\n(1903)\n.\nThe Second International Congress of Mathematicians was held in Paris in\n1900\n. Le Roux attended the Congress but did not give a lecture. He did not attend any of the other three International Congresses before the outbreak of World War I in\n1914\n. In fact Le Roux has a strong publication record up to\n1914\n, having at least\n38\npublications up to this time. It is difficult to single out one paper from this list which is the most important but looking at the citations to his papers it would appear that\nÉtude géométrique de la torsion et de la flexion dans la déformation infinitésimale d'un milieu continu\nⓉ\n(\nGeometric study of torsion and bending in the infinitesimal deformation of a continuous medium\n)\n(1911)\nis the one most often referenced. Here is Le Roux's Introduction:-\nIn his famous Memoirs on torsion and bending of prisms,\nBarré de Saint-Venant\nplaced himself above all others from the point of view of statics, seeking the deformations which result from certain distributions of forces. The object of this work is quite different. I only take care of the geometric study of deformations without any consideration of static or dynamic. Torsion and bending do not exist in homogeneous deformation. Their analytical representation in the vicinity of a point depends on the second derivatives of displacements. They are consequently differential elements of the second order of the deformation, whose role can be compared to that of curvature in the theory of surfaces. On the contrary the dilation and the average rotation are elements of the first order, like the tangent plane and the linear element in geometry. It seemed to me that knowing the necessary laws of the distribution of second order deformations could be as useful an introduction to the study of the mechanics of continuous media as knowing the elements of curvature when studying mechanics of a point. It has been found, moreover, that this theory, in addition to its practical utility, presents its own interest by the simple manner in which the results are grouped and are coordinated. I mainly had in mind the infinitesimal strains, but most of the calculations and methods apply without great modifications to the case of finite strains.\nAugustus Love\nwrites in\n[\n2\n]\n:-\nAn interesting extension of\n[\nSaint-Venant\n's\n]\ntheory, involving the introduction of secondary elements of strain, has been made by J Le Roux ... The secondary elements of strain are the curvature and twist of slender filaments, and the curvature of thin sheets of the material, the filaments and sheets being straight and plane in the unstrained state.\nThere is a seven year gap in Le Roux's publications with nothing appearing between\n1914\nand\n1921\n.\nIn\n1920\nthe first International Congress of Mathematicians after World War I was held in Strasbourg and Le Roux attended the meeting. He delivered the lecture\nSur la géométrie des déformations des milieux continus\nⓉ\n(\nOn the geometry of deformations of continuous media\n)\non the afternoon of\n25\nSeptember in Section II\n(\nGeometry\n)\n. It was a busy day for him for he had been the Chairman of the morning session of Section II\n(\nGeometry\n)\non the same day. He was invited to be a plenary speaker at the following International Congress of Mathematicians which was held in Toronto in\n1924\n. He sailed\n2\nnd class on the ship\nSuffren\n, leaving Le Havre on\n28\nJuly and arriving in New York on\n5\nAugust. We note that over\n20\nprofessors of mathematics who were going to the International Congress of Mathematicians in Toronto were on the same ship. Le Roux gives his French address as\n47\nAubourg de Fougères, Rennes, and the immigration details also give his height as\n5\nft\n5\nins, hair grey and eyes blue. He delivered his plenary address\nConsidérations sur une équation aux dérivées partielles de la physique mathématique\nⓉ\n(\nConsiderations on a partial differential equation of mathematical physics\n)\non Saturday\n16\nAugust: it was the last lecture of the Congress. We note that Le Roux had a number of other roles at this Congress. He was a member of the Special Mission of the French Ministry of Public Instruction which was chaired by\nGabriel Koenigs\nand, in addition to Le Roux, had members\nÉmile Borel\n,\nÉlie Cartan\n,\nMaurice Fréchet\nand Jean Mascart. Le Roux was also a member of the French National Committee of Mathematics along with Jules Haag and Jean Mascart.\nIn fact Le Roux attended all the International Congresses of Mathematicians between World War I and World War II. He gave the lecture\nLa relativité du langage et la théorie de la Gravitation\nⓉ\n(\nThe relativity of language and the theory of gravitation\n)\nat the\n1928\nCongress in Bologna, the lecture\nLes groupes de transformations et la théorie de la relativité\nⓉ\n(\nTransformation groups and the theory of relativity\n)\nat the\n1932\nCongress in Zurich and attended the\n1936\nCongress in Oslo but did not deliver a lecture.\nWe see from the titles of the lectures that Le Roux gave at the\n1928\nand\n1932\nCongresses that he had turned his attention to relativity theory. This led to an unfortunate end to Le Roux's research career for during the last\n25\nyears of his life he argued strongly against the general theory of relativity. It is surprising that, despite his excellent earlier work, he now seemed to fail to understand the mathematics. Let us give some details about this part of Le Roux's career.\nThe\nParis Academy of Sciences\nbasically ignored\nEinstein\n's theory of relativity until\n1921\n.\nEinstein\npublished the special theory of relativity in\n1905\nand the general theory of relativity in\n1915\n. The theory explained the discrepancy in the advance of the perihelion of the planet Mercury. In\n1919\nArthur Eddington\nverified that the bending of light passing close to the sun agreed with the value predicted by relativity theory. When the\nParis Academy of Sciences\ntook notice of this around\n1921\nthey were, in general, opposed to the theory of relativity. Le Roux led the opposition at this time and it would be fair to say that a majority of members of the\nAcademy\ntook the same view. In May\n1921\nLe Roux published\nSur la théorie de la relativité et le mouvement séculaire du périhélie de Mercure\nⓉ\n(\nOn the theory of relativity and the secular movement of the perihelion of Mercury\n)\nin which he wrote:-\nThe discovery of a law of gravitation capable of explaining the movement of the perihelion of Mercury was considered to be a vivid confirmation of the theory of relativity. Judicious criticism observes that this result has been obtained with regard to the theory of relativity, but that it is not a consequence of it and does not even constitute an argument in its favour.\nHis argument in this paper is not unreasonable, since he is claiming that to verify a scientific theory it must make predictions which can then he checked experimentally. The discrepancy in the advance of the perihelion of the planet Mercury was known before the general theory of relativity was propounded. This was not Le Roux's only paper on relativity in\n1921\n, for he also published\nLe temps dans la mécanique classique et dans la théorie de la relativité\nⓉ\n(\nTime in classical mechanics and in the theory of relativity\n)\nand\nLa loi de gravitation et ses conséquences\nⓉ\n(\nThe law of gravitation and its consequences\n)\n. He continued to publish numerous papers opposing relativity. For example in\nSur la gravitation dans la mécanique classique et dans la théorie d\"Einstein\nⓉ\n(\nOn gravitation in classical mechanics and in Einstein's theory\n)\n(1922)\nhe writes:-\nThe results provided by\nEinstein\n's theory of gravitation seemed, at first glance, to agree remarkably well with observation, particularly in the case of the secular movement of the perihelion of Mercury. However, to reach this conclusion, we must admit that the perturbations due to the mutual actions of the planets keep in\nEinstein\n's theory the same values as in classical mechanics. If the disturbances are removed, the concordance disappears. Now it happens that\nEinstein\n's fundamental hypothesis is incompatible with the existence of mutual actions and disturbances as they are considered in classical mechanics. ... The confrontation with experience in the particular case of the movement of Mercury gives rise to the following observations. The secular advance observed is\n574\n''.\nNewton\n's theory, which causes the disturbances, provides a satisfactory explanation up to a maximum limit of\n536\n'', with an unexplained minimum residue of\n38\n''. In\nEinstein\n's theory, the movement deduced from the\nd\ns\n2\nds^{2}\nd\ns\n2\ncalculated by\nSchwarzschild\nwould give Mercury a secular advance of\n43\n''. But, as this theory excludes disturbances due to mutual actions, there remains an unexplained residue of\n531\n''. ... In the meantime, it should be noted that\nEinstein\n's theory, in its current state, neither makes it possible to explain or predict, even with the roughest approximation, the secular movement of Mercury.\nMarcel Brillouin\npublished a reply to Le Roux in November\n1922\nwith the paper\nGravitation einsteinienne et gravitation newtonienne; à propos d\"une récente note de M Le Roux\nⓉ\n(\nEinsteinian gravitation and Newtonian gravitation; comments on a recent note from M Le Roux\n)\n.\nBrillouin\nwrites:-\nEveryone knows that\nEinstein\n's theory of gravitation includes\nNewton\n's as a first approximation. The Note from M Le Roux shows that it is nevertheless useful to recall it. ... The criticisms, of M Le Roux, are completely unfounded.\nAlso in\n1922\nLe Roux published\nRelativité restreinte et géométrie des systèmes ondulatoires\nⓉ\n(\nRestricted relativity and geometry of wave systems\n)\nin which he writes:-\nThe very clear conclusion we come to is this. The principle of special relativity, in the sense of\nEinstein\n, is sometimes superficial and sometimes absurd, depending on the field to which it is applied.\nHermann Weyl\nwrites in a review:-\nThe work is violently anti-relativistic. But the statements of the author break open doors when he shows again in long calculations that for the theory of a wave process with constant propagation speed due to the wave equation a relativity principle of the Lorentzian type applies. The actual difficulties, which the special theory of relativity overcame, for example the different behaviour of sound and light waves, he could have made clear but he did not understand.\nBy\n1924\nit would appear that Le Roux was a lone voice in the\nParis Academy of Sciences\nopposing\nEinstein\n's theory. This, however, did not stop him continuing his opposition. In addition to many papers\n(\nover\n30\nin the\n3\nyears\n1931\n-\n33\nand\n10\nmore in\n1935)\n, he wrote the two books\nPrincipes mathématiques de la théorie de la gravitation\nⓉ\n(\nMathematical principles of the theory of gravitation\n)\n(1931)\nand\nPrincipes et méthodes de la mécanique invariante\nⓉ\n(\nPrinciples and methods of invariant mechanics\n)\n(1935)\n.\nGeorg Hamel\nwrites in a review of the\n1935\nbook:-\nIt says at the beginning of the second part, after in the first part the group theoretical foundations have been explored, \"The purpose of invariant dynamics is to express the general laws of dynamics, and in particular of gravitation, in a form valid for any reference system.\" One would like to expect a general theory of relativity, but that's not the point here. On the contrary, the theory of relativity is not invariant in the sense of the theory presented here. ... If the sentence quoted were to be accepted absolutely, the mechanics of the author would not exist ...\nJ L Synge\n, reviewing the same book, writes:-\nThe author starts from the requirement of\nEinstein\nthat the laws of physics are to be expressed in a form valid for all arbitrarily moving systems of reference, but his theory is not in agreement with\nEinstein\n's relativity because he accepts an absolute simultaneity. The time is a parameter as in classical mechanics, and is not one of the coordinates subject to transformation. In fact, the author accepts the Newtonian kinematics of rigid bodies, but with a generalisation.\nFinally, let us note that Le Roux was making translations into Breton and attempting to standardise spelling in different Breton dialects at around the same time that he was involved in arguments over relativity. He published\nLe roman de Pérédur\nⓉ\n(\nThe novel of Peredur\n)\nin\n1923\n. It is subtitled,\nTexte Gallois, Tranduit en Breton par J Le Roux, Professer à l'Université de Rennes avec une traduction Française d'après J Loth\nⓉ\n(\nA Welsh text, Translated into Breton by J Le Roux, Professor at the University of Rennes with a French translation by J Loth\n)\n. We note that Joseph Loth was a linguist who specialised in Celtic languages. He was a professor at the University of Rennes from\n1883\nto\n1910\nbut by the time he translated Le Roux's Breton into French he was a professor at the Collège de France. Le Roux gives a lengthy section,\nStudy of the transcription of the Breton language\n, in the Introduction to the book which begins:-\nIn the transcription of the Breton text I have departed on a few points from the common usage of modern writers. It seemed to me that the orthographic system used since the Le Gouidec reform has various drawbacks which oppose the unification of the written language.\nIwan Wmffre discusses Le Roux's contributions in\n[\n1\n]\n."
}