{
  "nome_completo": "Jean Frédéric Frenet",
  "nome_curto": "Jean Frenet",
  "ano_nascimento": "1816",
  "ano_morte": "1900",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Frenet/",
  "lugar_nascimento": "Périgueux, France",
  "lugar_morte": "Périgueux, France",
  "biografia": "Jean Frenet\n's father was Pierre Frenet, a wig maker. The wig became an important item of attire in France from\n1665\nonwards, but since it was a distinctive class symbol, the wig industry went into serious decline with the advent of the French Revolution.\nFrenet entered the  École Normale Supérieure in\n1840\n, then studied at the University of Toulouse. The University was an ancient establishment founded by Pope Gregory IX in\n1229\n, being the first university founded by a Pope. However the University was suppressed during the French Revolution and by the time Frenet went there to study it had been broken up into separate faculties of law, theology, science, letters, and medicine. It was not reconstituted as a university until\n1896\n.\nAt Toulouse Frenet undertook research in geometry and he wrote a doctoral thesis there which he submitted in\n1847\n. His thesis was entitled\nSur les fonctions qui servent à déterminer l'attraction des sphéroides quelconques. Programme d'une thèse sur quelque propriétés des courbes à double courbure\nⓉ\n(\nOn the functions that determine the attraction of spheroids. Programme of a thesis on some properties of curves of double curvature\n)\nand published in Toulouse in\n1847\n. In his thesis Frenet presented the idea of attaching to each point of an arbitrary curve in space a frame. As this frame moves along the curve, we can look at its rate of change to determine how the curve turns and twists, two ideas that actually describe the whole geometry of the curve. The part of Frenet's thesis which contains the theory of space curves gives the formulas now known as the\nSerret-Frenet formulas\n. Frenet gave only six formulas while\nSerret\ngave all nine. Frenet published this part of his thesis as the paper\nSur quelque propriétés des courbes à double courbure\nⓉ\n(\nOn some properties of curves of double curvature\n)\nin the\nJournal de mathematique pures et appliques\nin\n1852\n. In a further paper\nThéorèmes sur les courbes gauches\nⓉ\n(\nTheorems on space curves\n)\n, published in the\nNouvelles annales de mathématiqe\nin\n1853\n, Frenet explained how the formulas could be applied. In\n[\n2\n]\nGodeaux\nsuggests a publication of the first Frenet formula by a Belgian mathematician G M Pagani in\n(1847)\nmay predates Frenet's publication of the formulas. It is likely that this was produced at about the same time as Frenet's work and that the two were independent.\nFrenet was appointed as a professor at the University of Toulouse, then in\n1848\nhe was appointed professor of mathematics at the University of Lyon, the most important educational centre outside Paris. He was also director of the astronomical observatory there and, in this capacity, he conducted meteorological observations. He published these observations in the\nMémoires de l'Académie impériale de Lyon\nin a continuing series, first in\n1853\n, next in\n1856\n, and again in\n1858\n. A Drian took over publishing the series of meteorological observations. Frenet retired at the age of\n52\nin\n1868\nand went to live on the family estate of Bayot in Périgueux. He had never married and, once back living on the family estate, he lived with his sister.\nFrenet's exercise book on the calculus\nRecueil d'exercises sur le calcul infinitésimal\nⓉ\n(\nCollection of exercises on calculus\n)\n, first published in\n1856\n, ran to seven editions, the seventh being published in\n1917\n[\n1\n]\n:-\nIt contains problems with full solutions and often historical remarks.\nStruik\nwrites\n[\n1\n]\n:-\nFrenet was a man of wide erudition and a classical scholar who was respected in the community, but his mathematical production was limited."
}