{
  "nome_completo": "Jerzy Słupecki",
  "nome_curto": "Jerzy Słupecki",
  "ano_nascimento": "1904",
  "ano_morte": "1987",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slupecki/",
  "lugar_nascimento": "Harbin, Manchuria, (now China)",
  "lugar_morte": "Wrocław, Poland",
  "biografia": "Jerzy Słupecki\n's parents were Stanisław Słupecki\n(1865\n-\n1929)\nand Szczęsna Jaszewska. Stanisław and Szczęsna were Polish although this is not strictly accurate since they were born at a time when Poland did not exist as an independent country but was partitioned between Russia, Austria and Prussia. Stanisław Słupecki was actually born in Podolia and studied engineering in St Petersburg. The reason that Jerzy was born in Manchuria was that his father, Stanisław, although a captain in the military, had been working on the construction of the East China Railway since\n1900\n. This also explains why he was born in Harbin since this town only came into existence when it became the construction centre of the East China Railway through Manchuria built by the Russians at the end of the\n19\nth and the beginning of the\n20\nth century. By the time Jerzy was born, the railway linked the Trans-Siberian Railway from Lake Baikal in Siberia through Harbin in Manchuria to the Russian port of Vladivostok in Siberia on the Sea of Japan. Both Russia and Japan sought to control Manchuria and, as a result, they fought a war in\n1904\n-\n05\n. Harbin was the Russian military base in Manchuria during this war, which was taking place at the time Jerzy was born.\nThe younger of his parents' two sons, Jerzy was brought up in Harbin where his parents enjoyed a good life style since his father Stanisław was well paid being promoted to colonel in\n1912\nand commander of a battalion in the\n35\nth Siberian Rifle Regiment in\n1914\n. Jerzy's childhood was a time of great joy growing up in an environment with mixed races and nations, all with their different languages and customs, cultures and religions. He did not attend school in Harbin but was educated at home up to the age of\n15\n. At this time he was sent to Tyumen to attend secondary school there. Tyumen is on the Trans-Siberian Railway, where it crosses the Tura River, about\n300\nkm east of Yekaterinburg. Although connected to Harbin by the Trans-Siberian Railway, the two towns are an enormous distance apart, namely about\n4500\nkm by rail. In October\n1917\nthe Russian Revolution saw the tsar, Nicholas II, deposed and in July\n1918\nhe was executed in Yekaterinburg. Jerzy's parents felt that their son would be safer if he were with them in Harbin so he returned there in\n1918\n. His father had been released from military service with the Soviet authorities in January\n1918\n. However, the end of World War I ended over\n100\nyears of Poland being partitioned between the three major powers, and the Polish Republic was restored on\n11\nNovember\n1918\n.\nWith Poland existing again as an independent country, the Słupecki family decided to return from Harbin to their own country. This, however, proved not to be easy and only Stanisław Słupecki managed to return at this time and he joined the Polish army in December\n1918\n.  Szczęsna Słupecka and her two sons failed in their attempt to return to Poland and were forced to remain in Siberia from\n1918\nto\n1921\n. The conditions were harsh and Jerzy's brother contracted tuberculosis. Jerzy himself suffered poor health but had to work to support the family financially. Eventually, in\n1921\n, all the family returned to Warsaw where Jerzy was able to continue his much interrupted education.\nSłupecki had lost at least three years of secondary education but he was able to pass the grade four examinations and was admitted to the Tadeusz Rejtan VI State High School in Warsaw. This school, founded in\n1905\n, was one of the best schools in Warsaw. Słupecki graduated from this High School in\n1926\nand, later in the same year, entered the Warsaw Technical University where he studied his favourite subject, namely architecture. Sadly, his health had suffered during the Siberian winters and he now had a lung infection which forced him to terminate his studies of architecture. After some improvement in his health, he decided to study mathematics at Warsaw University. Mathematics had always been a second favourite for Słupecki but, later in life when he was enjoying a highly successful career, he still regretted having to give up studying architecture.\nOnce again Słupecki encountered unfortunate difficulties with his studies at Warsaw University. His father Stanisław had retired in\n1923\n, by which time he was a Brigadier General in the Polish Army, and died in Warsaw on\n24\nNovember\n1929\n. Suddenly the family, who had always been well off, were in financial difficulties. Słupecki tried to help out the family finances with a variety of different jobs, some with the Warsaw Municipal Council and some with the Historical Museum. The consequence was that up to\n1932\nhe had little time to devote to his mathematical studies and only in\n1932\nwas he able to resume these studies with the attention that he wanted to give them. His mathematics professors at Warsaw University included\nKazimierz Kuratowski\n,\nStanisław Leśniewski\n,\nStefan Mazurkiewicz\n,\nJan Łukasiewicz\n,\nWacław Sierpiński\n,\nAdolf Lindenbaum\nand\nAlfred Tarski\n.\nAdolf Lindenbaum\nwas only two months older than Słupecki but had been awarded a doctorate in\n1928\n, the difference being simply a consequence of the problems which had hindered Słupecki's education. Also\nTarski\n, who was only two years older than Słupecki, had been teaching at Warsaw university since\n1925\n.\nAs well as the important influence of these lecturers, an equally important influence on Słupecki from this time on was\nAndrzej Mostowski\n.\nMostowski\nwas nine years younger than Słupecki but had begun his studies at Warsaw University in\n1931\n. Słupecki and\nMostowski\nmet regularly in Lourse's Café in Krakówskie Przedmieście, one of the most prestigious streets in Warsaw. Other friends who met with them in this café included the mathematics students Stanisław Hartman\n(1914\n-\n1992)\nand Julian Perkal\n(1913\n-\n1965)\n. The authors of\n[\n12\n]\nwrite:-\nIt was a difficult time in the academic life of Poland, especially in Warsaw. Right-wing political organizations ventured a harsh anti-Semitic campaign and the leadership of the Mathematical-Physical Club of the students of the Warsaw University decided to expel the students of Jewish origin. Słupecki and his friends firmly opposed the anti-Semitic measures; Jerzy, because he was considerably older than his fellow-students, was in a sense an authority among his friends\nIt was during these years when he studied in Warsaw that Słupecki's interests turned towards mathematical logic. In many ways this is not surprising since it was a period when the Polish School of Logic, based in Warsaw, was flourishing and transmitting enthusiasm to students. Słupecki graduated with a Master's degree from the University of Warsaw in\n1935\nhaving written a thesis advised by\nJan Łukasiewicz\n. Słupecki's thesis was outstanding and it received the Department Council's award. Although he would have wished to remain at the University of Warsaw and study there for his doctorate, this was not possible in a situation where, despite having a school of extraordinary talents, it was not possible to employ someone as gifted as Słupecki. He therefore took a position as a mathematics teacher at the Curie-Skłodowska State Gymnasium in Warsaw which allowed him to continue to be a part of the Warsaw School of Logic. With\nŁukasiewicz\nas his research advisor, Słupecki worked on his doctoral thesis while being a full-time secondary school teacher.\nIn\n1937\nhe married Stanisława Izydorzak. In the following year he submitted his thesis\nA proof of the axiomatizability of full systems of many-valued propositional calculus\n(\nPolish\n)\nand was awarded a Ph.D.\nWacław Sierpiński\nwas an examiner of Słupecki's thesis. In his student days he had met with friends in Lourse's Café in Krakówkie Przedmieście, but now, in addition to his friends, he met the professors from the university, in particular\nŁukasiewicz\nand\nLeśniewski\n. The life of all these people soon changed dramatically with the outbreak of World War II.\nOn\n1\nSeptember\n1939\nGerman troops entered Poland and the German Luftwaffe began bombing all strategically important sites. By\n4\nSeptember they were within\n60\nkm of Warsaw which they encircled with two pincer movements coming from the north and south, one to the east of Warsaw the other to the west. On\n22\nSeptember, Russian troops entered Poland occupying Lwów and on\n27\nSeptember Warsaw surrendered. The Germans and Russians had agreed to partition Poland between them and this now came about. Warsaw was occupied by the Germans who closed the University of Warsaw. The university buildings became a military barracks. In fact the Germans closed all higher education establishments in Poland for their idea was that they would make use of Poles to carry out their menial tasks so there was no need to educate them.\nAlthough education was now banned in Poland, and punishable by death, many risked their lives to educate young people in secret. In particular Helena Rzeszotarska\n(1879\n-\n1976)\nran an underground Gymnasium to teach young people and Słupecki taught in this school. Helena, the daughter of the metallurgist Alfons Jan Kapiston Rzeszotarski who was a professor at St Petersburg, had operated a girls' school for poor families in Warsaw since before World War I. During the German occupation it operated in secret.\nAlthough the buildings of the University of Warsaw had become a military barracks, many of the professors risked their lives continuing to run clandestine lectures for their students. Słupecki taught in this underground university along with several of his friends and teachers such as\nŁukasiewicz\nand\nMostowski\n. In addition to these highly dangerous teaching duties, Słupecki also took part in the Konrad Żegota Committee, part of the Polish Resistance. This organisation was set up on\n27\nSeptember\n1942\nto help Jews in German occupied Poland. It helped find places of safety for Jews and provided them with aid. Although it operated in several Polish cities, the largest part of the organisation was in Warsaw. It managed to get aid to around one third of the Jews trapped in Warsaw. The authors of\n[\n12\n]\nwrite:-\nHe regarded his conspiratory activities in the underground during the years of war as something very important, perhaps even the most important, in his life. He was preparing for the Warsaw Uprising in Praga - the right-bank district of the city, but as is well known, German troops brought the situation under control in this part of the city.\nMany Poles were forced to undertake work for the Germans and, in mid-August\n1944\n, Słupecki was sent to Germany as a labourer. In December, seeing that his health was not good enough to give the Germans the hard labour required, they sent him back to Warsaw. There he undertook a few odd jobs before the city was liberated. On\n17\nJanuary\n1945\nWarsaw was liberated by Russian troops but at this stage, with the city and university largely destroyed, it was unclear whether the city and its university would be rebuilt. However staff and students who had survived the war began returning to the university. Słupecki volunteered to teach at the School of Telecommunications in the Praga district of Warsaw and he also taught at the Curie-Skłodowska State Gymnasium, back in the position he had held before the German invasion.\nLater in\n1945\nSłupecki was appointed as an Assistant Professor at the University of Lublin. He worked on his\nhabilitation\nthesis and he presented\nFrom the investigations into Aristotle's syllogistic\n(\nPolish\n)\nto the Jagiellonian University in Kraków, which led to his appointment as an Extraordinary Professor of Logic and Methodology of Science at Wrocław University and at Wrocław Polytechnic. He continued to hold positions at Wrocław University until he retired in\n1974\n, becoming a full professor there from\n1962\n.\nDetails of Słupecki's research papers are given in\n[\n12\n]\nand we refer the reader there for details. We give a summary of his contributions\n[\n12\n]\n:-\n... the creative work of Jerzy Słupecki comprised five areas:\n(1)\nmany-valued sentential calculi,\n(2)\ntheory of deductive systems including metalogic of classical and non-classical logic and the consequence operation of rejection,\n(3)\nhistory of logic\n(\ni.e. modern investigations onto the syllogistic of\nAristotle\n)\n,\n(4)\nLeśniewski\n's systems, and\n(5)\ndidactics of logic and mathematics. Słupecki was conscious of the aim of his logical investigations as consisting in continuation, ramification and popularization of the logical investigations of his masters from the Warsaw school.\nSłupecki was also the author of a number of books co-authored with colleagues and students. Some of these are listed with extracts from reviews at\nTHIS LINK\n.\nAt Wrocław University, Słupecki was Dean of the Faculty of Mathematics, Physics and Chemistry in\n1953\n-\n55\n. He became a full professor in\n1962\nwhen he headed the Department of Logic and Methodology. Later this was renamed the Department of Mathematical Logic and Methodology of Teaching Mathematics. However, from\n1950\nthis was only one of Słupecki's two positions and perhaps the one that interested him the least.  In\n1950\nhe was appointed to the Higher Pedagogical School in Wrocław. Four years later, this School moved to Opole, a city which had only been returned to Poland in\n1945\n. At this time the city was German but returning it to Poland saw the largely German population slowly replaced by a Polish one. On the Oder river, Opole was both a river port and important place on the railway from Wrocław to Upper Silesia. Słupecki certainly considered his work in Opole to be his most important contribution and in this, despite making many other significant contributions, he was probably correct. Let us quote from the article\n[\n8\n]\non the Opole website:-\nHe was a co-founder of Opole Pedagogical University and a tireless experimenter in teaching mathematics. He served as chair of the foundations of mathematics at the University of Opole for nearly\n20\nyears, and in the years\n1962\n-\n1966\n, as Rector of the Higher Pedagogical School, contributed much to the strengthening of human resources, bringing it on the road to becoming the University of Opole. Słupecki is considered the spiritual father and founder of mathematics and logic at the university in Opole. In Opole he educated dozens of masters, doctors and assistant professors. ... Jerzy Słupecki was the author of many articles in an encyclopaedia and was a great populariser of mathematical logic. He edited the journal \"Studia Logica\" and a newsletter for teachers \"Mathematics\". Together with the Opole logicians and mathematicians he developed many lecture notes and textbooks, and actively participated in the work of the Opole Society of Friends of Science. He lectured and organised seminars. He liked our city. Here he had devoted friends, and his own colleagues, who helped him achieve great esteem. He was associated with Opole for over\n30\nyears.\nLet us end this biography by quoting from\n[\n12\n]\n:-\nWhen on the cold morning of\n21\nJanuary\n1987\n, we took our final leave from Jerzy Słupecki, it must have occurred to many participants of that sad ceremony that they were witnessing literally the end of the Warsaw school of logic. ... Słupecki was the last Warsaw logician alive who began his scientific career in the golden twenty years of Polish logic\n(1919\n-\n1939)\n."
}