{
  "nome_completo": "Jesse Ramsden",
  "nome_curto": "Jesse Ramsden",
  "ano_nascimento": "1735",
  "ano_morte": "1800",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramsden/",
  "lugar_nascimento": "Salterhebble, near Halifax, Yorkshire, England",
  "lugar_morte": "Brighton, Sussex, England",
  "biografia": "Jesse Ramsden\n's father was Thomas Ramsden who was an innkeeper. The family were not well off and Jesse attended a free school in Halifax from\n1744\nto\n1747\n. At this stage Ramsden was sent to live with his uncle, Mr Craven, in the North Riding of Yorkshire, and he spent four years there studying mathematics taught by the Revd Mr Hall.\nAround\n1751\nhe was apprenticed to a cloth maker, and he spent until\n1755\nserving his apprenticeship. He went to London at this stage and was given a job as a clerk in a cloth warehouse but, in\n1756\nat the age of\n21\n, he chose to become an apprentice to Mark Burton, a mathematical instrument maker in Denmark Street in the Strand. By the age of\n27\nhe had his own business in London in the Strand where he became acknowledged as the most skilful designer of mathematical, astronomical, surveying and navigational instruments in the\n18\nth\ncentury. A near neighbour was John Dollond, a fellow of the\nRoyal Society\nand a skilled designer of optical instruments. Ramsden spent much time at Dollond's house learning about optical instruments. There he met Sarah Dollond, John Dollond's daughter, and they were married on\n16\nAugust\n1766\n. Of their two sons and two daughters, only one son, John Ramsden, survived to adulthood. Marriage gave Ramsden a share in the patent that John Dollond had taken out on his most famous invention, the achromatic lens. Ramsden soon opened a new business in Haymarket, near Little Suffolk Street.\nThe French scientist N Cassegrain proposed a design of a reflecting telescope in\n1672\n. It was Ramsden, however,\n100\nyears later who found that this design reduces blurring of the image caused by the sphericity of the lenses or mirrors. Optical instruments at this time were important for a number of reasons, but the big problem of the day which many scientists attacked, was solving the problem of computing longitude at sea. One method involved using tables of the moon's position which had been produced by\nTobias Mayer\nand he sent to the British government in\n1755\n.\nMaskelyne\nhad also compiled lunar tables but accurate instruments were needed to be able to take bearings from ships before they were useful. Ramsden produced such an instrument in\n1767\nbut it did not give as accurate results as was hoped. A second version produced in\n1775\nwas considerably better and led to Ramsden being awarded £\n300\ntwo years later by the longitude commissioners. See\n[\n6\n]\nwhere Ramsden's contribution to the longitude problem is discussed.\nAlthough he was highly successful in his business, Ramsden does not appear to have been so successful with his marriage for his wife did not move with him when he opened larger premises in\n1773\n. Sarah and their son John moved into a house owned by the Dollond family, but Sarah seems to have continued to assist Ramsden in his business. Indeed Ramsden continued to expand his business, enlarging his premises in\n1780\n. His also continued to devise important new inventions, one of these being the circular dividing engine. This allowed for the mass production of instruments such as sextants, for the dividing engine provided mechanical graduation of scales. The instrument is described in\n[\n5\n]\nwhere Brooks provides the following summary:-\nThe development of the circular dividing engine in England is traced from Henry Hindley and Jesse Ramsden through the improvements introduced by Ramsden's successors to the self-acting engine of William Simms. Particular emphasis is given to the invention, evolution and transmission of the methods used to achieve accuracy in dividing the wheel, ratcheting the teeth and matching them to the endless screw, and mounting the cutter. The procedures adopted by Ramsden and\nTroughton\nfor correcting initial dividing marks are also described.\nRamsden was elected fellow of the\nRoyal Society\non\n12\nJanuary\n1786\nand received the Copley Medal in\n1795\nfor:-\n... various inventions and improvements to philosophical instruments.\nHe was elected to the\nSt Petersburg Academy of Sciences\nin\n1794\n.\nIn\n[\n4\n]\ndetails of Ramsden's appearance and character are given. He was:-\n... above the middle size, slender, but extremely well-made, and to a late period of life, possessed of great activity. His countenance was a faithful index of his mind, full of intelligence and sweetness. His forehead was open, and high, with a very projecting and expressive brow. His eyes were dark hazel, sparkling with animation. He had a good musical voice.\nThis quote was by the Revd Louis Dutens who also said that Ramsden\n[\n2\n]\n:-\n... spent his evenings in the kitchen with his apprentices, eating bread and butter, discussing ideas, and perfecting designs. Several of his apprentices went on to distinguished careers in their own right ...\nRamsden's health deteriorated and he was advised to go to Brighton to aid his recovery. This did not happen and Ramsden died there."
}