{
  "nome_completo": "Johann Francesco Melchiore Salvemini Castillon",
  "nome_curto": "Johann Castillon",
  "ano_nascimento": "1704",
  "ano_morte": "1791",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Castillon/",
  "lugar_nascimento": "Castiglione, Tuscany (now Italy)",
  "lugar_morte": "Berlin (now Germany)",
  "biografia": "Johann Castillon\n's parents were Giuseppe Salvemini and Maria Maddalena Lucia Braccesi. On his father's side, the Salvemini family was an ancient noble one which can be traced back to the\n14\nth\ncentury. His mother's family was also a noble one originating in Pisa. Johann Castillon was named Giovanni Francesco Melchiore Salvemini and was known by that name until he was over thirty years of age. His education was given at home up to the time he entered the University of Pisa. There he studied law and mathematics obtaining a doctorate in jurisprudence from Pisa in\n1729\n. He continued to live in Italy occupying himself with translating texts; for example he published his translation of Alexander Pope's poem 'An Essay on Man' in\n1733\nwith an equal number of Italian verses as the original had English verses.\nAs a young man Castillon was irreligious. John Christian Laursen writes\n[\n6\n]\n:-\nHe made his way to Switzerland in\n1736\n, apparently fleeing the Inquisition. His mother had admonished him not to dishonour the family name, so he took the name 'Castiglione'\n(\nin Italian; 'Castilloneus' in Latin and 'Castillon' in French\n)\nafter 'Castiglion Fiorentino', the location of the family home.\nCastillon taught at Vevey, a town on the north shore of Lake Geneva, where he became the director of the humanistic school. He continued to earn money as a translator, and he taught rhetoric, humanities, and mathematics. During this period he published two mathematical papers, written in Latin giving his name as J Castillioneus, in the\nPhilosophical Transactions\nof the\nRoyal Society of London\n. In the first of these\nDe curva cardioide, de figura sua sic dicta\nⓉ\n(\nThe cardioid curve\n)\n, dated April\n1741\n, he named and investigated the cardioid curve. The second paper\nDe polynomia\nⓉ\n(\nOn polynomials\n)\n, on\nNewton\n's polynomial theorem, was read to the Society on\n6\nMay\n1742\n. He edited three volumes of\nNewton\n's works which were first published in Lausanne and Geneva in\n1744\n. The first volume contains\nNewton\n's mathematical essays, the second volume contains the philosophical treatises which mainly consist of\nNewton\n's \"Optical Lectures\", which were originally delivered in Latin at Cambridge in\n1669\n,\n1670\n, and\n1671\n. The third volume contains\nNewton\n's philological works, mainly historical essays, including a chronicle of ancient history. Roger Ward Babson describes these volumes:-\nThese three volumes\n[\nwere\n]\ncollected and edited by Giovanni Francesco Salvemini, called Castillionaeus, who supplied a Preface and life of\nNewton\n. They are a fine piece of bookmaking.\nUp to this time Castillon had been an atheist, but in\n1744\nhe became a Calvinist. His views on religion are, however, somewhat unclear and we will discuss these further below. In\n1745\nhe took up a teaching position in Lausanne and in the same year he married Elisabeth du Frèsne; they had three children but only one son survived his father, namely Maximilian Friedrich Gustav Adolf. Also in\n1745\nhe published the correspondence between\nJohann Bernoulli\nand\nGottfried Leibniz\n; then in\n1748\nhe published the\nIntroductio in analysin infinitorum auctore Leonhardo Eulero\n, the treatise by\nEuler\nwhich he had edited. Between\n1749\nand\n1751\nCastillon taught both at Lausanne and also at Bern. During this time he made efforts to obtain a more prestigious position and applied for a professorship in mathematics in Bern and a professorship in theology in Lausanne. He was unsuccessful in both of these applications, but it is interesting to note that having only become a Calvinist in\n1744\nhe was ready for a professorship in theology a few years later. In the summer of\n1751\nhe received offers of positions at St Petersburg and also at Utrecht. This proved a difficult decision for Castillon and he took several months to make up his mind. In December\n1751\nhe went to the University of Utrecht to lecture on mathematics and astronomy. He obtained a doctorate from Utrecht in\n1754\n, being advised by Johannes Horthemels, and Castillon became an ordinary professor of mathematics and philosophy there in\n1755\n. Three years later Castillon became rector of the University. During these years Castillon had received a number of distinctions being made a Fellow of the\nRoyal Society of London\nand a member of the\nGöttingen Academy of Sciences\n, both in\n1753\n. In\n1757\nCastillon's wife Elisabeth died; he married to Madeleine Ravène two years later.\nJean-Jacques Rousseau, the French philosopher, writer, and political theorist, published\nDiscours sur l'origine de l'inegalité parmi les hommes\nⓉ\n(\nDiscourse on the origin of inequality among men\n)\nin\n1755\n. Castillon replied to Rousseau in\nRéponse\nⓉ\n(\nResponse\n)\n, giving his own defence of progress and modern civility. Published in Amsterdam in\n1756\n, Castillon's work was addressed to\nMaupertuis\n, as President of the\nBerlin Academy of Science\n. Castillon opposed the views of Rousseau and his supporters, favouring the ideas of thinkers of the English Enlightenment. He also translated John Locke's\nElements of Natural Philosophy\ninto French with the title\nAbrégé de physique\nⓉ\n(\nPhysics Abstract\n)\n, publishing this in\n1758\n. He wrote a detailed commentary on\nNewton\n's\nArithmetica universalis\nⓉ\n(\nUniversal arithmetic\n)\npublishing a Latin edition of the work with his commentary in Amsterdam in\n1761\n.\nJames Boswell, the famous Scottish lawyer, diarist, and author, travelled in Holland in October\n1763\nand met with Castillon in Utrecht on several occasions. Boswell recounts a number of incidents which give us some insight into Castillon at this time. For example\n[\n3\n]\n:-\nIt is said that the Dutch language is a language for horses. Monsieur Castillon said so, after having lived in Utrecht for several years. He was on an Amsterdam barge when he made that comparison, and if there had not been a man there who knew him, I believe that a stout Dutchman would have thrown him into the canal.\nBoswell and Castillon discussed free will while in Utrecht. These discussions are summarised in\n[\n4\n]\n:-\nAt first Castillon maintained that he could \"conceive the most perfect prescience without restraining liberty\" - the position which Jerusalem had taken but which Boswell now rejected as \"absurd.\" Thereupon, Castillon, giving the subject a more philosophical cast, explained that since God offered man part of His own nature, He has granted man some of this will.\nIn\n1763\nFrederick the Great, the King of Prussia, invited Castillon to Berlin offering him the position of professor of mathematics at the Artillery School. Also in that year Castillon, on the personal recommendation of Frederick the Great, was elected to the Mathematics Section of the\nBerlin Academy of Science\n. Following the death of\nMaupertuis\nin\n1759\n,\nLeonhard Euler\nhad been made head the Academy but also remained as Director of the Mathematics Section until replaced in that role by\nLagrange\non\n6\nNovember\n1766\n. When Boswell was with Castillon in Utrecht in October\n1763\nit was already known that he would be moving to Berlin in the following year. Boswell paints the following rather unpleasant picture of Castillon\n[\n3\n]\n:-\nMonsieur Castillon, although a very learned man, is a sad example of\n[\nsomeone who cannot eat meat\n]\n. His teeth are so bad that for several years he has eaten nothing but hash. Unknown to him are the robust joys of greedily devouring a great piece of beef or mutton. Poor man! He is going to Berlin. I hope with all my heart that that jesting rogue the Marquis d'Argens never sees him eat, for fear that he will turn him to ridicule.\nIn July\n1764\nBoswell was in Berlin and there met up again with Castillon who took him to a meeting of the\nBerlin Academy of Science\n. Irma Lustig describes some of their conversations in Berlin\n[\n4\n]\n:-\nBoswell had studied with Castillon in Utrecht without enthusiasm, but now that both were newcomers to Berlin, they sought each other's company. On one occasion, Castillon acknowledged with remarkable frankness that he considered God a being to be revered but that he disapproved of emotional worship, which he called \"the fancy of fanatics.\" He also declared that only the Gospels were \"truly Christian scriptures,\" that the Epistles might be useful \"sometimes,\" but that \"the Christian religion had not added much to morality.\"\nBoswell, in his journal on\n26\nSeptember\n1764\n, records the following conversation with Castillon when visiting the Court of Dessau\n[\n2\n]\n:-\nWhere are all my gloomy speculations at Utrecht, when I imagined that I knew all the circumstances that could arrive in human life, and that the result was only insipidity? Castillon gave me no bad answer to this. \"You know,\" said he, \"all the circumstances of human life, as you know the ingredients of which a dish may be made; but in neither of the cases can you know what will be the effect of a selection and mixture, till you try.\nIn\n1765\nFrederick the Great named Castillon 'Royal Astronomer' at the Berlin Observatory. He received further honours from foreign academies, being appointed a member of the Bologna Academy in\n1768\n, the Mannheim Academy in\n1777\n, the Padua Academy in\n1784\n, and the Prague Academy in\n1785\n.\nLagrange\nhad been Director of the Mathematics Section of the\nBerlin Academy of Science\nfrom\n6\nNovember\n1766\nto\n18\nMay\n1787\nwhen he left Berlin. At this time Castillon was appointed Director of the Mathematics Section, a role he kept until his death. However, in November\n1787\nhe suffered a stroke from which he recovered mentally, but not physically. After his death his only surviving child, his son Maximilian Friedrich Gustav Adolf, wrote an eulogy to his father\n[\n11\n]\nwhich was published by the\nBerlin Academy of Science\n.\nWe have already noted his two mathematical papers in the\n1740\ns. He also studied\nconic sections\n,\ncubic equations\nand artillery problems. Among his later mathematical publications we note:\nMémoire sur la règle de Cardan, et sur les équations cubique, avec quelques remarques sur les équations en général\nⓉ\n(\nA memoir on Cardan's rule, and the cubic equations, with some remarks on the equations in general\n)\n(1783)\nand two memoirs in\n1790\nand\n1791\nentitled\nExamen philosophique de quelque principes de l'algèbre\nⓉ\n(\nPhilosophical examination of some principles of algebra\n)\n. He is also known for 'Castillon's problem' which is:-\nTo inscribe in a given circle a triangle the sides of which pass through three given points.\nThis problem was posed by\nGabriel Cramer\nand solved by Castillon in\n1776\n. Calinger\n[\n1\n]\nwrites about the style of Castillon's mathematics:-\nThroughout his mathematical work there is a preference for synthetic, as opposed to analytic, geometry, which is perhaps a reflection of his preoccupation with\nNewton\n's mathematics.\nFinally let us examine the rather puzzling question about Castillon's religious beliefs. He certainly was an atheist as a young man and later converted to Calvinism. However, his views on Christianity, as quoted above in his conversations with Boswell, show that he did not hold conventional Calvinist beliefs. The situation becomes even more complicated when we examine the religious views he expressed in his publications and the particular works he chose to translate. For example Castillon's\n1771\ntranslation of\nObservations on the System of Nature\n(1770)\nby Paul-Henri Dietrich d'Holbach\n[\n10\n]\n:-\n... amply answered the atheism of d'Holbach, in subtle confutation of the brief and wholly political, even inflammatory, answer of Frederick Castillon's work reintroduced the principles of up-to-date Protestant theology from Clarke to Bonnet, his themes running from the existence of God... to the notion of virtue as philanthropy and dedication to the common good, which he identified with Christianity.\nIn\n1774\nCastillon published his translation of the English translation\n(\nyes - it was a translation of a translation\n)\nby Charles Blount of Philostratus's\nLife of Apollonius of Tyane\n. This was an extremely anti-Christian work and seen as such at the time that Castillon translated it. By\n1774\nCastillon was working for Frederick the Great who believed in rational argument and was sceptical of religious beliefs. Carlo Antonio Pilati wrote the following in his book\nVoyages en Différents Pays de l'Europe en\n1774\n,\n1775\n, et\n1776\npublished in\n1777\n:-\nThis M Castillon is a mathematician who greatly loves theology, against the ordinary custom of mathematicians who are attached only to demonstrations; I think that the king wanted to mortify him for the theological books he has written by ordering him to translate into French the life of Apollonius of Thyane written by Philostratus, of which there is an English translation, at least of the first two books, to which the translator has adjoined notes very likely to clash with all species of theology; the king wanted M Castillon to begin his French translation of that translation without omitting the notes.\nIn\n[\n6\n]\nJohn Laursen argues that Castillon's translation from Latin into French of Cicero's\nAcademica\n, published in\n1779\n, was again required by Frederick 'intended to mortify the pious'. In\n[\n6\n]\nexamples are given of how Castillon worked Christian ideas into his translation 'under the guise of providing interpretative guidance and scholarly apparatus'. However, the remarks he made to Boswell suggest he was not really as 'pious' as his published works made him appear. Lustig suggests that he was deliberately being cautious in his published works\n[\n4\n]\n:-\nThat would explain Boswell's commiserating with him for having had to hide his philosophical thought while in Utrecht.\nIt is also possible that once he went to Berlin, Castillon was influenced by\nLeonhard Euler\nwho was a very devout Christian."
}