{
  "nome_completo": "Johann Georg Rosenhain",
  "nome_curto": "Johann Rosenhain",
  "ano_nascimento": "1816",
  "ano_morte": "1887",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rosenhain/",
  "lugar_nascimento": "Königsberg, Prussia (now Kaliningrad, Russia)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Johann Rosenhain\nwas born into a Jewish family. His parents were Nathan Rosenhain and Röschen Joseph. He studied at Friedrich College in Konigsberg, then at the University of Königsberg where he was taught by\nCarl Jacobi\nand Julius Richelot. He was close to\nJacobi\nand was inspired by him to undertake mathematical research into topics that interested\nJacobi\n. While he was still a student he attended\nJacobi\n's lectures and he edited them for publication. This was an outstanding start to his career and over the next few years he was exceptionally successful. He was awarded a doctorate by Königsberg for his thesis. In his thesis, which he wrote with\nJacobi\nas his thesis advisor, he examined periodic functions in two variables.\nIn\n1844\nRosenhain submitted his\nHabilitation\nthesis to the University of Breslau and was appointed as a\nPrivatdozent\nthere in that year. In\n1846\nthe\nAcademy of Sciences\nin Paris announced that the topic for the next Grand Prix would be on the inverse problem for an abelian integral on a curve of genus two. He was awarded the prize in\n1851\nfor his memoir\nSur les Fonctions de Deux Variables et à Quatre Periodes, Qui Sont les Inverses des Intégrales Ultra-élliptiques de la Première Classe\nⓉ\n(\nOn functions of two variables and four periods which are the inverses of ultra-elliptic integrals of the first class\n)\n.\nAdolph Göpel\nindependently solved the same problem but he did not submit his solution for the Paris Academy prize so basically they only received one solution to the problem. Perhaps not surprisingly, Rosenhain's methods are more closely linked to those of\nJacobi\nthan are the methods of\nGöpel\n. The memoir was published in\n1851\nin the\nMémoires des Savants\nof the\nAcademy of Sciences\n. In this Rosenhain introduced sixteen theta functions in two variables\n(\nas did\nGöpel\n, by the way\n)\n. Burau writes\n[\n1\n]\n:-\nMost important, Rosenhain demonstrated that the squares of the quotients of these sixteen theta functions can be conceived of as functions of the product surface of a hyperelliptic curve of genus\n2\nwith itself. Starting from this point ... Rosenhain succeeded in demonstrating more simply than\nGöpel\nthat these quotients solve the inverse problem for genus\n2\n.\nAs we said above, these years for Rosenhain had been stunningly successful. He had solved one of the major questions of the day, a question considered so important that it had been chosen as a Grand Prix topic by the\nAcademy of Sciences\n. It was political events which now seemed to suddenly stop his progress, namely the revolution which swept across Europe in\n1848\n. The revolution was triggered by events in France at the end of February\n1848\nand soon spread to Germany, where it became known as the March Revolution. In the south and the west of Germany, large popular assemblies and mass demonstrations took place. The main demands of the protestors were freedom of the press, freedom of assembly, arming of the people and a national German parliament. Supporters, however, wanted to achieve this change by non-violent means and sadly it seems that peaceful protest usually fails. Rosenhain joined the revolution on the side of the people but those who participated were soon in deep trouble when the king had gained full control. The failed revolution was followed by a period of political repression. Many of the former leaders of the movement were suspended from their duties and had to suffer under the repression organized by the monarch's secret police. Rosenhain's position at Breslau became untenable; he had no future there\n[\n1\n]\n:-\nHis participation in the revolutionary activities of\n1848\ndeprived him any chance to further his career in Breslau. He therefore qualified as a lecturer again in\n1851\n, this time at the University of Vienna.\nRosenhain went to the University of Vienna in\n1851\n. Then, in\n1857\n, he returned to Königsberg as an extraordinary professor and he taught there until\n1886\n. Returning to Königsberg was in itself a difficult move since he was moving back to Prussia where he had been marked as a supporter of democracy. Certainly the authorities could not risk Rosenhain returning to his democratic cause so they required him to sign an official declaration that he would not give any support to democratic movements. It is impossible to be certain why Rosenhain never published anything other than his Academy Prize paper despite having shown outstanding mathematical abilities. It is tempting to believe that the disruption to his career caused by the\n1848\nMarch Revolution was highly significant. Another possibility is that\nJacobi\n's death in\n1851\n, at a critical stage in Rosenhain's career, caused him to lose interest in research. However, we should note that he had never been that keen to publish; for example his Ph.D. thesis was never published nor did he write any papers using the results of the thesis.\nIt was not only as a mathematician that Rosenhain was extremely gifted for he was also gifted in languages and music. He taught until the winter semester\n1884\n-\n85\nin Königsberg, then was given leave and he went to Berlin. He died there."
}