{
  "nome_completo": "John Warner Backus",
  "nome_curto": "John Backus",
  "ano_nascimento": "1924",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Backus/",
  "lugar_nascimento": "Philadelphia, Pennsylvania, USA",
  "lugar_morte": "Ashland, Jackson, Oregon, USA",
  "biografia": "John Backus\n's parents were Cecil Franklin Backus\n(1885\n-\n1966)\nand Elizabeth Warner Edsall\n(1904\n-\n1933)\n. Cecil Backus graduated with a degree in chemistry from the University of Virginia in\n1906\nand worked for the Eastern Laboratory of the E I Dupont De Nemours Powder Company before moving to work for the Atlas Powder Company in Wilmington, Delaware. He worked for the investment banking firm of Gillespie & Meeds from\n1920\nto\n1922\n. This firm became Laird, Bissell & Meeds and he was a partner from\n1923\nto\n1940\n. Elizabeth Edsall, John's mother, was the daughter of a Wilmington physician. Cecil and Elizabeth were married on\n28\nMay\n1921\nin Wilmington, New Castle, Delaware. They had three children, Anne Hall Backus\n(\nborn\n25\nMarch\n1922)\n, John Warner Backus\n(\nthe subject of this biography\n)\nand Cecil Franklin Backus Jr. The family were well off and during the years that Cecil and Elizabeth Backus were married they collected high quality American antique furniture. After John's mother Elizabeth died, his father married Alice Beaver Candee\n(1901\n-\n1992)\non\n12\nJune\n1935\nin Wilmington, New Castle, Delaware. John spent his first years in Wilmington, Delaware and then attended the Hill School in Pottstown, Pennsylvania. This family boarding school, founded in\n1851\n, was highly regarded and run by the headmaster James I Wendell. Backus graduated from the Hill School in\n1942\nalthough, according to his own account, he did not take his studies there too seriously\n[\n5\n]\n:-\nI flunked out every year. I never studied. I hated studying. I was just goofing around. It had the delightful consequence that every year I went to summer school in New Hampshire where I spent the summer sailing and having a nice time.\nJohn Backus entered the University of Virginia to study chemistry at his father's request. In his first semester he enjoyed the theory part of chemistry but disliked the laboratory work intensely. He enjoyed the social life, however, and was at every party that he could find. He wrote in\n2004\n:-\nAll anyone seemed to do at the University of Virginia was drink themselves silly.\nHe was no more diligent than at school, however, and in his second semester he only enrolled in one course - a music appreciation class. This was not what the University of Virginia expected of their students and in\n1943\nhis studies were terminated. With America playing a major role in World War II, in that year he joined the army. He was given the rank of corporal and put in charge of an antiaircraft crew at Fort Stewart, Georgia\n[\n2\n]\n:-\nI only stayed there for a few months, and then I was selected for army specialized training. Then I went to some little place in Alabama to get classified.\nWhen he took this army aptitude test, his performance led to him being sent to the University of Pittsburgh to take the pre-engineering programme\n[\n2\n]\n:-\nThen I went to the University of Pittsburgh, which I enjoyed enormously because I was supposed to be learning all this stuff that I had already studied. So I spent a lot of time there. There's a place called the \"Pittsburgh Playhouse,\" which was really a bar. A very friendly place.\nGiven a medical aptitude test by the army, he was now sent to Haverford College to take pre-medical training. Later in life he thought that this may have saved his life since many of his friends at Pittsburgh were sent to Europe to serve on the Western Front. The Battle of the Bulge, the major German offensive in December\n1944\n, saw the largest number of American casualties in the war and many of Backus's friends were killed. After a while at Haverford College, Backus was sent to an Atlantic City hospital where he worked in a neurosurgery ward that treated head wounds\n[\n2\n]\n:-\nSo I stayed in Atlantic City working in this hospital\n12\nhours a day for a while, living in the Traymore Hotel on the Boardwalk.\nStrangely, a large bump on his head was noticed and he was found to have a bone tumour. After an operation to remove the tumour he had a plate fitted in his head. For a while he was recovering, he had no duties and was able to enjoy the nightlife of Atlantic City. Now medical training seemed to be the right direction for Backus but after nine months of medical school at Flower and Fifth Avenue Hospital, now known as the New York Medical College, he gave this up too\n[\n5\n]\n:-\nI hated it. They don't like thinking in medical school. They memorize - that's all they want you to do. You must not think.\nAgain without any idea which direction he should take, he took an apartment on East\n71\nst  Street in New York. The plate that had been put in his skull was giving problems so had a new one with the correct curvature fitted at a hospital on Staten Island. While in New York he met up with one of his friends from the University of Virginia. This friend took him to an apartment shared by three girls. One of the girls was Marjorie Ruth Jamison\n(30\nSeptember\n1922\n-\n24\nMay\n2010)\n. Backus married Marjorie; they had two daughters Karen and Paula.\nHe describes\n(\nsee\n[\n5\n]\n)\nwhat happened next:-\nI really did not know what the hell I wanted to do with my life. I decided that what I wanted was a good hi-fi set because I liked music. In those days, they did not really exist so I went to a radio technicians' school. I had a very nice teacher - the first good teacher I ever had - and he asked me to cooperate with him and compute the characteristics of some circuits for a magazine. I remember doing relatively simple calculations to get a few points on a curve for an amplifier. It was laborious and tedious and horrible, but it got me interested in math. The fact that it had an application - that interested me.\nAs a consequence, Backus entered Columbia University, New York, to study mathematics. He enjoyed the algebra courses but found calculus tedious. He graduated was a B.S. in Mathematics in\n1949\nand continued to a Master's Degree being awarded an M.S. in Mathematics in\n1950\n. Just before he graduated he visited the IBM Computer Center on Madison Avenue. When he told the guide that he was looking for a job she told him to talk to a director\n[\n5\n]\n:-\nI said no, I could not. I looked sloppy and dishevelled. But she insisted and so I did. I took a test and did OK.\nThe test was a puzzle set by Robert R Seeber, known as Rex, and after Backus solved it he was offered a job on the spot. Backus joined IBM as a programmer in the Pure and Applied Science Departments in\n1950\n. The first problem he worked on was to write a program in machine code for the Selective Sequence Electronic Calculator\n(\nSSEC\n)\nto calculate the position of the moon from a function given by a series expansion with about\n1000\nterms. The SSEC was not a computer in the sense we would understand today since it had no storage and programs were punched paper tape. Understanding the difficulties of programming, Backus invented a program he named Speedcoding. He explained\n[\n2\n]\n:-\n... programming in machine code was a pretty lousy business to engage in ... all that was available was a sort of a very crude assembly program. So I figured, well, let's make it a little easier.\n[\nSpeedcoding\n]\nwas a rotten design, if I may say so, but it was better than coding in machine language.\nIn\n1954\nhe was appointed as manager of the Programming Research Department at IBM, a position he held for four years. He is considered the inventor of FORTRAN, the first high level computer language to be developed, for his role as manager of the development team from\n1954\nto\n1958\n. The team, appointed by Backus to assist him develop FORTRAN whose specifications he had already drawn up, was headed by Backus. They published a paper in the autumn of\n1954\nwith the title\nPreliminary Report, Specifications for the IBM Mathematical FORmula TRANslating System, FORTRAN\n. It was designed for mathematician and scientists and became commercially available in\n1957\n. Describing his early work on FORTRAN, Backus said:-\nWe did not know what we wanted and how to do it. It just sort of grew. The first struggle was over what the language would look like. Then how to parse expressions - it was a big problem and what we did looks astonishingly clumsy now. ...\nIn\n1959\nhe invented what is now called the Backus Naur Form\n(\nBNF\n)\n, a standard notation to describe the syntax of a high level programming language.\n(\nPeter Naur invented a similar scheme in\n1960\n.\n)\nHis third major contribution to computer science was to develop a functional programming language called FP, which advocates a mathematical approach to programming. He proposed this in his lecture\nCan Programming be liberated from the von Neumann Style? A Functional Style and its Algebra of Programs\nwhich he gave on the occasion of receiving the\nTuring\nAward from the Association for Computing Machinery in\n1977\n. He explained the purpose of his lecture in its Introduction:-\nFor twenty years programming languages have been steadily progressing toward their present condition of obesity; as a result, the study and invention of programming languages has lost much of its excitement. Instead, it is now the province of those who prefer to work with thick compendia of details rather than wrestle with new ideas. Discussions about programming languages often resemble medieval debates about the number of angels that can dance on the head of a pin instead of exciting contests between fundamentally differing concepts. Many creative computer scientists have retreated from inventing languages to inventing tools for describing them. Unfortunately, they have been largely content to apply their elegant new tools to studying the warts and moles of existing languages. After examining the appalling type structure of conventional languages, using the elegant tools developed by Dana Scott, it is surprising that so many of us remain passively content with that structure instead of energetically searching for new ones. The purpose of this article is twofold; first, to suggest that basic defects in the framework of conventional languages make their expressive weakness and their cancerous growth inevitable, and second, to suggest some alternate avenues of exploration toward the design of new kinds of languages.\nLet us return to give a few more details of Backus's personal life. In\n1966\nBackus and his wife Marjorie were divorced. Just before they split up, Marjorie introduced Backus to Barbara Una Stannard\n(1927\n-\n2004)\nwho was born Barbara Garlitz. Backus and Barbara, a poet and author with a Ph.D. from Harvard, were married on\n18\nJuly\n1968\nin San Francisco County, California.\nBackus received many honours for his outstanding contributions to computer science. He received the W Wallace McDowell Award from the Institute of Electrical and Electronic Engineers Computer Society in\n1967\n:-\nFor his early and continuing contribution to the field of higher-level languages, in particular for is conception and leadership resulting in the completion of the first FORTRAN projects; and for his work in syntactical forms incorporated in ALGOL.\nHe received the President's National Medal of Science from the National Science Foundation in\n1975\n:-\nFor his pioneering contributions to computer programming languages, especially development of the FORTRAN language which made the modern digital computer directly available to countless scientists and engineers.\nThe Medal was presented by President Ford in a ceremony at the White House on\n18\nOctober\n1976\n.\nHe received the\nA M Turing\nAward from the Association for Computing Machinery in\n1977\n:-\nFor profound, influential, and lasting contributions to the design of practical high-level programming systems, notably through his work on FORTRAN, and for seminal publication of formal procedures for the specification of programming languages.\nThis was the award which led to his lecture\nCan Programming be liberated from the von Neumann Style? A Functional Style and its Algebra of Programs\nfrom which we quoted above. In\n1993\nhe was awarded the Charles Stark Draper Prize from the National Academy of Engineering:-\nFor his development of FORTRAN\n,\nthe first widely used, general purpose, high-level computer language.\nIn\n1997\nhe received the Computer History Museum Fellow Award:-\nFor his development of FORTRAN, contributions to computer systems theory and software project management.\nWe should say a few words about Backus's political views. He was a member of Computer Professionals Against ABM which campaigned against the U.S. anti-ballistic missile system around\n1965\n-\n75\n. This organisation made it clear that their opposition was on purely technical grounds although many of those who joined opposed the system on other grounds as well. Backus was also an opponent of the U.S. Strategic Defense Initiative set up in\n1984\n. His opposition was again based on technical grounds since he believed that developing computer software to manage the course of a battle was well beyond the present state of knowledge.\nAs to hobbies, we have already noted his love of music but he also liked to read books on history and biographies. Backus retired in\n1991\nand, after the death of his wife in\n2004\n, he went to live in Ashland, Oregon to be near one of his daughters. Let us end this biography with a final quotation by Backus which comes from\n[\n5\n]\n:-\nMost scientists are scientists because they are afraid of life. It's most wonderful to be creative in science because you can do it without clashing with people and suffering the pain of relationships, and making your way into the world. It is a wonderful out - it's sort of this aseptic world where you can use the very exciting faculties you have and not encounter any pain. The pain in solving a problem is small potatoes compared with the pain you encounter in living. Introspection is not a scientific activity: it's not repeatable, there are no good theories about how to do it, what you expect to find. It's strange that by looking into yourself you really get an appreciation of the mystery of the universe. You don't by trying to find the laws of physics."
}