{
  "nome_completo": "John Craig",
  "nome_curto": "John Craig",
  "ano_nascimento": "1663",
  "ano_morte": "1731",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Craig/",
  "lugar_nascimento": "Hoddom, Dumfries, Scotland",
  "lugar_morte": "High Holborn, London, England",
  "biografia": "John Craig\n's father was James Craig who was a priest at Hoddom in Dumfries, Scotland. John was his parents second son, having a brother William six years his senior. Craig was a pupil of\nDavid Gregory\nin Edinburgh. He entered the University of Edinburgh in\n1684\nand graduated with an M.A. in\n1687\n. However, during his time as an undergraduate in Edinburgh, he travelled down to Cambridge in\n1685\nwhere he published a mathematical text of which we give some details below. In\n1689\nhe moved to England and became a curate in London following the same vocation as his brother William. He continued his career was in the church and was vicar at a number of places in Wiltshire, first at Potterne, Wiltshire, from\n1692\n. In the following year, on\n27\nJuly, he married Agnes Cleland. They had six children.\nAs well as his life as Church of England clergyman, Craig also had a life as a mathematician. He tutored mathematics taking pupils at his home, became a friend of\nNewton\n, continued his contacts with\nDavid Gregory\n, was friendly with\nHalley\nand\nde Moivre\n, and corresponded with other Scottish mathematicians such\nMaclaurin\n. Craig published three major mathematical works which contain the earliest example of the\nd\ny\nd\nx\n\\Large\\frac{dy}{dx}\\normalsize\nd\nx\nd\ny\n​\nnotation of\nLeibniz\nin Britain and also contained the integration symbol ∫ . While he was still a student in Edinburgh, Craig published\nMethodus figurarum lineis rectis et curvis comprehensarum quadraturas determinandi\nⓉ\n(\nA method of determining the shapes of straight lines and curves including their quadrature\n)\nwhich contains\nLeibniz\n's\nd\ny\nd\nx\n\\Large\\frac{dy}{dx}\\normalsize\nd\nx\nd\ny\n​\nnotation. This notation is also used in the work he published in\n1693\n,\nTractatus mathematicus de figurarum curvilinearum quadraturis et locis geometricis\nⓉ\n(\nA mathematical tract on the quadrature of curves and geometrical loci\n)\nwhich was the first text published in England to contain the integration symbol\n∫\n\\int\n∫\n. Dale writes\n[\n2\n]\n:-\nThe standard of his work was such that he was noted as a mathematician of the first order ... and the \"Acta Eruditorum\" of Leipzig ranked him among the originators of the calculus\n(\nafter\nLeibniz\n, but before\nNewton\n)\n.\nCraig published several more papers on topics such as the logarithmic curve, the curve of quickest descent, and on the\nquadrature\nof figures. He published eight papers on these topics between\n1697\nand\n1710\nin the\nPhilosophical Transactions of the Royal Society\nand was elected a fellow of the\nRoyal Society\non\n30\nNovember\n1711\n. However, he was involved in a dispute with\nJacob Bernoulli\nover the calculus and he also had a dispute with\nTschirnhaus\n.\nIn\n1699\nhe published\nTheologiae Christianae Principia Mathematica\nⓉ\n(\nMathematical Principles of Christian Theology\n)\nwhich applies\nprobability\nto show that the evidence of the truth of the gospels is diminished through time. He claimed that it reaches\n0\nin the year\n3144\n, and so \"proves\" that this is an upper bound for the second coming. Stigler examines this work in detail in\n[\n6\n]\nclaiming that this is an \"underappreciated book\" containing\n[\n2\n]\n:-\n... a formula tantamount to a logistic model for posterior odds: that is, Craig's probability should be understood as the logarithm of the ratio of the probability of the historical testimony as received at the present time, given the historical hypothesis in question, to the probability of the same testimony, given the negation of that hypothesis.\nThese arguments appear in the first two chapters of the\nTheologiae Christianae Principia Mathematica\nⓉ\n(\nMathematical Principles of Christian Theology\n)\nwhile the remaining four chapters give a mathematical argument in support of\nPascal\n's wager, namely that:-\n... if God does not exist, the sceptic loses nothing by believing in him; but if he does exist, the sceptic gains eternal life by believing in him.\nAs an aside, I\n[\nEFR\n]\nmust say I have never found\nPascal\n's argument\n(\nand that of Craig\n)\nconvincing since for all we know God may grant the honest sceptic eternal life but find it totally unacceptable that someone chooses to believe in Him purely through self-interest.\nIn\n1718\nCraig published a work on optics\nQuibus subjunguntur libri duo de optica analytica\nⓉ\n(\nTwo books on the subject of analytical optics\n)\n. It is worth noting that despite using\nLeibniz\n's notation for the calculus in his earlier works, in this later one Craig used\nNewton\n's fluxion notation.\nWe left our description of Craig's church career at the point where he was vicar of Potterne in Wiltshire. In\n1696\nhe became vicar of Gillingham Major while on\n2\nNovember\n1708\nhe was also given a stipend from the revenue of Durnford and became a canon at Salisbury Cathedral. His brother William, who had been held the spiritual charge of Gillingham, died in\n1721\nand on\n28\nJune\n1726\nCraig was appointed to the Gillingham role formerly held by William. In the last part of his life Craig went to London in the hope that his mathematical abilities would be noticed. He was buried on\n14\nOctober in the churchyard of St James's, Clerkenwell, London."
}