{
  "nome_completo": "John Hymers",
  "nome_curto": "John Hymers",
  "ano_nascimento": "1803",
  "ano_morte": "1887",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hymers/",
  "lugar_nascimento": "Ormesby, Yorkshire, England",
  "lugar_morte": "Brandesburton, Holderness, Yorkshire, England",
  "biografia": "John Hymers\nwas born in White House Farm, Ormesby, the son of Thomas Hymers\n(1762\n-\n1834)\nand Esther Parrington\n(1767\n-\n1831)\n. Thomas Hymers, was baptised on\n20\nMarch\n1762\nin St Cuthbert's Church, Ormesby, and became a tenant farmer. The church\n[\n2\n]\n:-\n... is a small, and very ancient structure; the living is a vicarage, in the patronage of the Archbishop of York. Here is a public school, supported by voluntary contributions. James Pennyman, Esq was a loyalist in the time of King Charles I and had a large sum levied upon him for his loyalty, by the sequestrators; to defray which, he was obliged to dispose of part of his estate, at Ormesby ...\nThomas Hymers' farm, White House Farm, was on land owned by Sir William Henry Pennyman who lived in Ormesby Hall, a little distance from the village.\nEsther Parrington was a daughter of the Rev John Parrington\n(1736\n-\n1816)\n, Rector of Skelton in Cleveland, and Esther Beaumont\n(1734\n-\n1803)\n. Esther Parrington was a cousin of Mary Hutchinson Wordsworth, the wife of the poet William Wordsworth. Thomas and Esther Hymers were married on\n11\nJune\n1801\nin St Cuthbert's Church, Ormesby. They had five children, the first two being twins: Thomas Hymers\n(1802\n-\n1831)\n; Esther Parrington Hymers\n(1802\n-\n1864)\n; John Hymers\n(1803\n-\n1887)\n, the subject of this biography; Jane Hymers\n(1805\n-\n1831)\n; and Robert Hymers\n(1807\n-\n1893)\n.\nHymers attended the school of the Rev George Newby in Witton-le-Wear. Newby had been appointed Master of Witton-le-Wear Grammar School in\n1806\n, and sub-curate of the parish. He was a very effective teacher gaining the esteem and affection of his pupils. In\n1815\n, Hymers\n[\n9\n]\n:-\n... well recollected Mr Newby going down the street waving his hat and the newspaper containing the news of Waterloo.\nA version of\nRobert Forsyth Scott\n's obituary of Hymers from which this quote is taken is available at\nTHIS LINK\n.\nLeaving Witton-le-Wear Grammar School, Hymers entered Sedbergh School in August\n1821\n. This school was founded Roger Lupton\n(1456\n-\n1540)\n, who served as chaplain to both Henry VII and Henry VIII, around\n1525\n. Lupton endowed\n[\n13\n]\n:-\n... his new School with a liberal supply of scholarships and fellowships; six of the former, augmented a few years afterwards to eight, and two of the latter. These were all to be held at St John's College, Cambridge, by scholars chosen \"only of Sedbergh School and no other.\" From this date the close, almost parental, relation, in which the College has, until quite recently, stood to the School.\nThe headmaster of Sedbergh School, who had arrived in\n1819\nwas Henry Wilkinson\n[\n13\n]\n:-\nMr Wilkinson was of St John's College, second\nWrangler\nand second Smith's Prizemen in\n1814\n, and fellow in the same year.\nWilliam Whewell\nconsidered his one of the finest intellects he had ever known, and personally he was loved and respected by all who were under him.\nHymers was admitted to St John's College, Cambridge on\n22\nOctober\n1821\n. He left Sedbergh School in October\n1822\nand matriculated at the College at the start of the Michaelmas Term\n1822\n. He studied the mathematical tripos along with fellow students\nHenry Moseley\nand John Hallowes Miller\n(1801\n-\n1880)\nwho were also at St John's College. Thomas Turton\n(1780\n-\n1864)\nwas the Lucasian Professor of Mathematics having been appointed in the\n1822\n, the year Hymers matriculated. He seems, however, to have been more interested in divinity than mathematics. Hymers attended lectures given by\nGeorge Peacock\nand\nWilliam Whewell\n, among others. He became a scholar in\n1825\nand was awarded a B.A. in the examinations of\n1826\nwhen he was ranked as second Wrangler. The Senior Wrangler that year was William Law\n(1802\n-\n1859)\n. Law had studied at Trinity College, was Senior Wrangler and received the first Smith's Prizeman in\n1826\n. He was an assistant tutor in Trinity College between\n1834\nand\n1836\n. He then was Rector of the parish of Orwell, Cambridgeshire\n(1836\n-\n1859)\nand Rector of the church of All Saints, Little Shelford, Cambridgeshire\n(1849\n-\n1852)\n. He died on\n14\nJanuary\n1859\nin St Leonards-on-Sea, England, at age\n56\n. Both Hymers' fellow students at St John's,\nHenry Moseley\nand John Hallowes Miller, were also Wranglers.\nIn\n1827\nHymers was appointed as a fellow of St John's College and in\n1832\nhe became a tutor. He was Moderator of the mathematical tripos in the years\n1833\nand\n1834\n, but he followed one of the standard career paths for fellows at Cambridge in these times, also studying divinity. He became a deacon in\n1833\n, was ordained priest in the following year, was awarded a B.D. in\n1836\nand a D.D. in\n1841\n. In\n1838\nhe became a senior fellow of St John's College and in the same year was elected a fellow of the\nRoyal Society of London\n. We note that the Cambridge University Calendar for\n1847\n[\n6\n]\nshows that:-\nSt John's College: ... President, John Hymers; ... Tutor, John Hymers; ... Head Lecturer, John Hymers.\nBetween\n1830\nand\n1841\nHymers published a whole series of textbooks. The following list may not be complete but it includes all those we could find:\nA Treatise on the Analytical Geometry of Three Dimensions, containing the Theory of Curve Surfaces and of Curves of Double Curvature\n;\nA Treatise on the Integral Calculus containing the Integration of Explicit Functions of One Variable together with the Theory of Definite Integrals and of Elliptic Functions\n;\nA Treatise on Conic Sections and the Application of Algebra to Geometry\n;\nA Treatise on the Theory of Algebraic Equations\n;\nA Treatise on Differential Equations and the Calculus of Finite Differences\n;\nThe Elements of the Theory of Astronomy; Treatise on Spherical Trigonometry, together with a Selection of Problems and their Solution\n; and\nA Treatise on Plane and Spherical Trigonometry and on Trigonometrical Tables and Logarithms\n.\nSome of these books ran to third or fourth editions with the editions being major rewrites with lots of added material and changes to the presentations. Fourth editions were published around\n1858\n.\nRobert Forsyth Scott\nwrites\n[\n9\n]\n:-\nThe value of these works lay not so much in their presenting the result of Dr Hymers' own researches as in their bringing into the reading of the University the methods and discoveries of continental mathematicians.\nFor more information about these books, see\nTHIS LINK\n.\nOne of Hymers' pupils described his approach to teaching\n(\nsee\n[\n9\n]\n)\n:-\nMy recollection of him is of a remarkably handsome man, very cool and clear-headed, very patient and painstaking with his pupils, perhaps a little cold and reserved in manner, so that although all his pupils liked and respected him, they were never very intimate. He was a man of varied attainments, and I can recollect, after an hour's hard work at mathematics, having discussions with him on Wordsworth's poetry and characters in Shakespeare's plays.\nAmong Hymers students we should mention\nJohn Colenso\n,\nJohn Couch Adams\nand\nJames Joseph Sylvester\n.\nThe dates given at the beginning of this article show that between\n1831\nand\n1834\nHymers lost both his parents, a brother and a sister\n[\n8\n]\n:-\nJohn Hymers was a man who made college life his home for the first part of his life. His mother, father and two of his siblings died in the early\n1830\ns prompting him to go on a grand tour of Europe, which he followed with several years in college, preferring to remain unmarried. However, he slowly became disillusioned with the incursion of the university into the independent life of the colleges and in\n1852\nhe left St John's for the rich college living of Brandesburton in the East Riding of Yorkshire. He tried to return soon after but St John's refused him his old post with the result that he spent the rest of his life in an isolated Yorkshire parish. However, it was a living that provided £\n1500\nper annum, a sum that he regularly spent on books, paintings, railway shares, railway travel and on setting up a local school and library. The church gradually became ruinous and accounts of his value as a parish priest are not flattering.\nThe following account of Hymers as a parish priest by the Rev Edmund L H Tew is somewhat mixed\n[\n11\n]\n:-\nThere is very little to say about Dr Hymers as a parish priest, the system must be blamed that sends a man without experience and of mature age into a country parish. The want of this knowledge certainly struck me forcibly when I was his guest on coming to see the living that I now hold. But honour to whom honour is due. I believe that he was conscious of this defect, and tried to remedy it so far as he could. Many instances of his kindness have come to my knowledge, and I have frequently heard my dear late vicar speak of the way in which he would put himself out of the way to befriend and help men at St John's. He never in my time attended any gatherings of the clergy, and his bête noire was a rural dean.\nNow there have been two references to William Wordsworth in what we have presented above, one that his mother was a cousin of Wordsworth's wife and the other that Hymers liked to discuss Wordsworth's poetry. In fact Hymers was friendly with the poet and, in\n1831\n, he arranged for a portrait of Wordsworth to be painted for St John's College. He consulted Wordsworth about whom he would like to paint his portrait and the specialist portrait painter Henry William Pickersgill was chosen. Hymers then set about organising the funding of the portrait by collecting subscriptions from fellows of the College. The portrait was painted at Rydal Mount, Wordsworth's family home, beginning in September\n1832\nand completed in\n1833\n; it now hangs in the College. In\n1886\nHymers presented a sonnet to the College Library which Wordsworth had addressed to the portrait. Written in Wordsworth's own hand, it reads:-\nTo my Portrait\nPainted by Pickersgill at Rydal Mount\nFor St John's College Cambridge\n- - - - - - - - - - - - -\nGo, faithful Portrait! & where long hath knelt\nMargaret, the saintly Foundress, take thy place;\nAnd if Time spare the Colours for the grace\nWhich to the work surpassing skill hath dealt\nThou, on thy rock reclined, tho kingdoms melt\nIn the hot crucible of Change, wilt seem\nTo breathe in rural peace, to hear the stream,\nTo think and feel as once the Poet felt.\nWhate'er thy fate, those features have not grown\nUnrecognized thro' many a starting tear\nMore prompt, more glad to fall, than drops of dew\nBy morning shed around a flower half-blown;\nTears of delight that testified how true\nTo Life thou art, and in thy truth, how dear!\n- - - - - - - - - - - - -\nWm Wordsworth\nYou can see this portrait at\nTHIS LINK\nHymers' older sister Esther Parrington Hymers married George Jackson\n(1799\n-\n1848)\non\n5\nJuly\n1832\nat Ormesby. They had seven children one of whom was Esther Jane Jackson, born on\n5\nMay\n1836\nin Northallerton, Yorkshire. Hymers became close to his sister and her family. In the\n1850\ns Esther Jane Jackson, Hymers' niece, became his housekeeper. In each of the\n1861\n,\n1871\nand\n1881\ncensuses, Hymers and his niece are living in the Rectory of Brandesburton; they have two servants in\n1861\nand\n1871\nbut only one in\n1881\n[\n8\n]\n:-\nJohn Hymers was a man who combined focused miserliness with focused generosity. Though he let his church fall apart, he did spend money on the village ...\nHe became rich through investments, particularly in railway stocks and shares. Rather strangely, Hymers became more famous after he died than he had been in his lifetime for reasons we will describe below. He had good health all his life, living to the age of\n83\n, and died at his home in the Rectory at Brandesburton. He was buried in the churchyard of the church at Brandesburton.\nThe\nEducational Times\nreported his death on\n1\nMay\n1887\n[\n12\n]\n:-\nThe Rev John Hymers, D.D., late Fellow and Tutor of St John's College, Cambridge, Second Wrangler in the Tripos of\n1826\n, died on the\n7\nth April at his residence, Brandesburton Rectory, East Yorkshire. He had held the living for thirty-five years. His Mathematical works, especially his 'Theory of Equations' and 'Integral Calculus', were in common use amongst mathematical students thirty or thirty-five years ago. Dr Hymers was a Yorkshire man, the son of a Hull tradesman, and it is plain, from the disposition he has made of his property, that that local feeling which has produced so many noble foundations in England, was very strong in him.  It has been announced in the public press that he has left a sum approaching £\n150\n,\n000\nfor the foundation of a school in his native town of Hull.\nAt the meeting of the\nLondon Mathematical Society\non\n30\nNovember\n1887\n, the President,\nG G Stokes\n, reported Hymers' death in his address\n[\n10\n]\n:-\nJohn Hymers was a mathematician well known as a Cambridge man of some standing. He was the author of various mathematical textbooks, which for a long time were those chiefly used in their respective subjects by Cambridge students for mathematical honours.\nHis personal estate was valued at £\n167\n,\n997\n18\ns\n9\nd, a very large sum which would correspond to the buying power of roughly £\n17\nmillion today. Probate was on\n9\nMay\n1887\n:-\nThe Will of the Reverend John Hymers late of Brandesburton in the County of York Clerk Rector of Brandesburton who died\n7\nApril\n1887\nat Brandesburton domiciled in England was proved at York by the Reverend John Thomas Grey of Hibaldstow in the County of Lincoln Clerk Vicar of Hibaldstow and James Mills of Beverley in the County of York Solicitor the Executors.\nThe will made specific bequests to his younger brother Robert and to various members of the family of his sister Esther, particularly her daughter Esther Jane Jackson who had acted as his housekeeper for many years. In his will, he left money to a number of local charities including: the Society for the Propagation of the Gospel in Foreign Parts; the Infirmary in Hull; the Seaman's orphanage in Hull; and the Sea Bathing Convalescent Home in Scarborough. The main part of his wealth, however, around £\n150\n,\n000\n, was to:-\n... found and endow\n[\na new college\n]\nfor the training of intelligence in whatever social rank of life it may be found among the vast and varied population of the town and port of Hull.\nHowever, Hymers had drawn up his will without consulting his solicitor James Mills, and it was declared invalid because of the words \"found and endow\". The legal details are too technical to try to explain in detail here. Let us simply say that the problem was with the Mortmain Act. This act prevented the acquisition of land by religious and charitable organisations. Hymers' will required the purchase of land to \"found\" a school so the will was declared invalid. His wealth then went to his heir, his closest relative, which was his younger brother Robert Hymers who decided to carry out his brother's wishes regarding founding a school. After much correspondence about the will involving Hymers' solicitor James Mills, Robert Hymers offered £\n40\n,\n000\nto Hull Corporation to build a school. Further negotiation led to this offer being increased to £\n50\n,\n000\n[\n4\n]\n:-\nHymers College opened in\n1893\nas a school for boys on the site of the old Botanic Gardens of Hull. It soon established itself as one of the leading schools in the northeast for its academic, sporting and musical achievements.\nAs a final comment, let us note that Peter Neumann, the son of\nBernhard Neumann\nand\nHanna Neumann\nwas educated at Hymers College,\nArthur Milne\nwas also a pupil at Hymers College and\nHenry Forder\nwas a teacher there."
}