{
  "nome_completo": "John Mackie",
  "nome_curto": "John Mackie",
  "ano_nascimento": "1888",
  "ano_morte": "1955",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mackie/",
  "lugar_nascimento": "Leith, near Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "John Mackie\nwas brought up in Leith, near Edinburgh, and he studied at Leith Academy which he entered in\n1899\n. He passed English in\n1901\n, and Mathematics in\n1902\n, both at the Higher level, in the Leaving Certificate examination and he was Dux of the Academy in\n1902\n. He decided to enter the teaching profession by becoming a pupil-teacher under the Leith School Board. He taught at Leith Academy but continued to study there passing French in\n1904\n, and Latin in\n1905\n, both at the Higher level, in the Leaving Certificate examination.\nHe attended the University of Edinburgh, first matriculating in October\n1906\n. He also attended courses at the training college. He took Mathematics at Ordinary level in his first session at university, then Chemistry, Latin, Natural Philosophy, and Education all at Ordinary level in session\n1907\n-\n08\n. He took Honours courses in Intermediate Mathematics, Intermediate Natural Philosophy, Advanced Mathematics, Function Theory, Electrokinetics, Advanced Dynamics, and Advanced Experimental Physics between October\n1908\nand summer\n1911\n.\nMackie graduated with an M.A. in July\n1911\nwith First Class Honours in Mathematics and Natural Philosophy and was awarded a B.Sc.\n(\nPure\n)\nin the same year. He then proceeded to teach mathematics at schools in Leith, following a short spell teaching at the university. He was awarded the Sir David Baxter Scholarship in Mathematics in June\n1913\nbut the start of World War I in\n1914\ninterrupted his studies, and he served with the Royal Scots Regiment during the First World War.\nAfter submitting his thesis\nAn inquiry into the tetrad difference method of testing the two factor theory of intelligence\nto the University of Edinburgh, Mackie was awarded a D.Sc. in\n1929\n.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n4\nMarch\n1929\nhaving been proposed by\nAlexander Morgan\n, Godfrey Hilton Thomson,\nSir Edmund Taylor Whittaker\n, and Ralph Allan Sampson. By this time he was Principal Teacher of Mathematics in Leith Academy and in\n1933\nhe became Rector of the Academy. Allen writes\n[\n1\n]\n:-\nAs pupil, pupil-teacher, principal teacher, rector of a school which he loved, in a town where he was brought up and of whose history and tradition few men were more knowledgeable, he was found to be a quiet-voiced, patient and kindly gentleman. Staff, pupils and former pupils held him in high esteem and affection.\nMackie held this position for\n20\nyears until he retired in February\n1953\n.\nIn February\n1921\nMackie joined the\nEdinburgh Mathematical Society\n. At this time he was living at\n19\nBeresford Avenue, Leith, where he continued to live until\n1938\nwhen he moved to\n7\nYork Road, Edinburgh. He was honoured by being elected as President of the Society in session\n1945\n-\n46\n.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n."
}