{
  "nome_completo": "Cecil John Alvin Evelyn",
  "nome_curto": "John Evelyn",
  "ano_nascimento": "1904",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Evelyn/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Deptford, Kent, England",
  "biografia": "John Evelyn\nwas the son of John Harcourt Chichester Evelyn\n(1876\n-\n1922)\n, the son of William John Evelyn and Frances Harriet Chichester, and Frances Edith Ives\n(1878\n-\n1935)\n, the daughter of Major-General Cecil Robert St John Ives and the Honourable Susan Ann Talbot. John Harcourt Chichester Evelyn was a pupil at the leading independent school Eton College before studying at Christ Church, University of Oxford. He became a military man who served in the Boer War and World War I. He was wounded in World War I and, although he lived for a few more years, he died from his wounds in January\n1922\n. He had married Frances Edith Ives on\n27\nJanuary\n1902\nand they had three children, Susanna Frances Evelyn, Cecil John Alvin Evelyn\n(\nthe subject of this biography\n)\n, and Peter George Evelyn\n(1909\n-\n1945)\n. Peter George Evelyn, like his father, became a military man rising to major in the Grenadier Guards. He was killed in action in Tunisia during World War II. Let us note that the aristocratic Evelyn family were descended from the famous diarist John Evelyn\n(1620\n-\n1706)\n.\nJohn Evelyn, the subject of this biography, was known to his friends as Jack. Like his father, he attended Eton College, the famous independent school in Windsor, Berkshire, England founded in the mid-fifteenth century. It was at Eton that Evelyn became fascinated by mathematics, particularly by number theory and geometry. He decided to study mathematics at university and, continuing to go to the same educational institutions as his father, he matriculated at Christ Church, University of Oxford. He graduated with a B.A. in\n1927\n. At Oxford he had become friendly with\nHubert Linfoot\nwho was one year older than Evelyn.\nLinfoot\ngraduated in\n1926\nbut had remained at Oxford undertaking research advised by\nG H Hardy\n. Both Evelyn and\nLinfoot\nwere interested in number theory at this time and they worked together on some problems which we now describe.\nBetween\n1929\nand\n1933\n, Evelyn and\nLinfoot\nproduced six joint papers, all with the title\nOn a problem in the additive theory of numbers\n. These concerned\nr\nr\nr\n-free integers:\nIf\nr\nr\nr\n≥\n2\n, then an integer is called\nr\nr\nr\n-free if it is not divisible by the\nr\nr\nr\nth\npower of any prime.\nIn the first of their joint papers,\nOn a problem in the additive theory of numbers\n(1929)\n, they found an asymptotic formula, with estimation of the remainder, for the number of representations of a large integer\nn\nn\nn\nas the sum of\ns\nr\ns r\ns\nr\n-free integers. They improved and extended their results in five later papers\n(\nmaking six in total\n)\n. Among the variants to this problem they studied in these later papers, we mention that of determining the asymptotic behaviour, as\nn\nn\nn\ntends to infinity, of the number of representations of\nn\nn\nn\nas the sum of\ns\nr\ns r\ns\nr\n-free integers which are congruent to\nk\nk\nk\n(\nmod\nq\nq\nq\n)\n. These problems continue to be of interest to number theorists and among the papers which contain results that extend and improve of those of Evelyn and\nLinfoot\nwe list six below, namely\n[\n2\n]\n,\n[\n3\n]\n,\n[\n5\n]\n,\n[\n6\n]\n,\n[\n7\n]\n, and\n[\n8\n]\n.\nEvelyn had no need to look for employment since his family fortune provided him with an income which allowed him to live the life of a gentleman of leisure devoting himself to those pursuits that interested him. He had many interests other than mathematics and we shall say a little about these below. First we continue to describe his contributions to mathematics. After the joint papers with\nLinfoot\n, Evelyn did not publish any further mathematics papers for over\n30\nyears. He began to produce further work in the mid-\n1960\ns. His papers from that time are:\nA relationship for the Möbius function\n(1966)\n;\n(\nwith Theodore William Chaundy\n)\nSome inequalities\n(1967)\n;\nRelations between arithmetical functions\n(1967)\n;\n(\nwith J A Carroll and R Cordner\n)\nA new extension of Hölder's inequality\n(1970)\n; and\n(\nwith D R Heath-Brown\n)\nArithmetical functions and inversion formulae\n(1974)\n. Note that this was David Rodney \"Roger\" Heath-Brown's first paper. He has, to date, published over\n170\nitems listed in\nMathematical Reviews\n. We also note Evelyn's address on his papers. In his papers with Linfoot, he gives his address as 'Wotton'.\n[\nWotton is in Surrey, England.\n]\nIn the\n1966\nand\n1967\npapers he gives his address as 'St James' Club, Piccadilly, London'. In\n1974\nhe gives '\n33\nGrosvenor Square, London'.\nA book was to be Evelyn's final mathematical publication. He published the book\n(\nwith G B Money-Coutts and J A Tyrrell\n)\nThe seven circles theorem and other new theorems\n(1974)\nwhich was translated into French and published as\n(\nwith G B Money-Coutts and J A Tyrrell\n)\nLe théorème des sept cercles\n(1975)\n. R D Nelson, Ampleforth College, York, writes\n[\n4\n]\n:-\nThis elegant book will please all geometers, amateur and professional, and deserves a place in every library. Using a variety of essentially elementary methods, the authors present and prove a number of new or little known theorems in plane geometry. To emphasise the aesthetic appeal of these results and to assist the argument in places, over forty of its pages carry diagrams of high quality. The book has three independent sections but the style of writing is uniform. The authors invite and sometimes require the co-operation of the reader as he works through the book and, in this way, they prepare him for the intricacies of the final and most difficult section. The first part re-introduces an algebra of vectors, due to Silberstein, in which the laws of addition and equivalence are such that few of the usual properties are obvious. For example, associativity of addition requires two applications of\nDesargues\n' theorem for its proof. No use is made of this algebra. The second section opens with a delightful new theorem concerning seven\nPascal\nlines derived from a heptagon inscribed in a conic. This is followed by a number of extensions and generalisations of the theorems of\nPascal\nand\nBrianchon\n. ... Finally there are four new theorems about closed chains of six circles ... In the first theorem each circle touches a seventh, in the second the circles alternately touch a pair of parallel lines, in the third each circle touches two of the sides of a triangle and in the fourth each circle touches two out of three fixed circles making a configuration of nine circles in all. The first theorem, beautifully proved by inversion, gives the book its title.\nThe remarkable thing about this book is that the theorem of the title is an elementary geometry theorem which appears to have been first discovered by the authors of this book. The theorem concerns six circles, all inside and touching a seventh circle. These six circles all touch each other. Join each of the six points on the outer circle where the six inner circles touch it, to the point of contact directly opposite it. The theorem states that these three lines are concurrent.\nWe mentioned above that Evelyn had many interests in addition to mathematics. In fact\n[\n9\n]\n:-\n... loved to travel\n(\nand did so regularly for the greater part of his life\n)\n, and he loved to write; he produced many books of poetry, written in a lyrical style very reminiscent of Swinburne, and a number of prose works that reveal, among other things, his great curiosity about matters supernatural.\nAs to poetry he published\nPoems\n(1937)\n,\nAena, and other poems\n(1938)\n,\nThe Wanderer. Poems\n(1950)\n,\nPandora. Poems\n(1954)\n,\nA book of poems\n(1956)\n. He also wrote\nFortuna, and new lyrics\n(1936)\n,\nThe comedy of Faust\n(\na verse play\n)\n(1959)\n,\nThe tragedy of Faustus\n(\na verse play\n)\n(1959)\n, and\nWalpurgis Nacht\n(\na verse play\n)\n(1961)\n. Finally we mention the intriguing\nThe Dupont Theory. The theory of gravitation in mental fields ... An essay on the nature of human understanding\n...\n(1957)\n.\nHis two plays about Faust, one called a comedy and the other a tragedy, need a little explanation. We quote from Eric A Blackwell, writing in\n[\n1\n]\n:-\nThe play\n[\nFaust\n]\nis difficult to interpret and inconclusive. Evelyn called it a tragedy \"to mislead the readers,\" as he says in his Preface. The questions remain questions, but they are basically concerned with tension between contemplation of possibilities and the specific actualities of choice and action. Evelyn later produced a 'Comedy of Faust'. The tragedy, if it had been finished, was to have had a happy ending, he tells us. These two plays, taken together, suggest that the drama could have ended either way.\nEvelyn had other interests as we are told in\n[\n9\n]\n:-\nHe also had a consuming passion for music, and was never happier than when entertaining his friends at the opera or ballet; I know that I share, with many members of the\nLondon Mathematical Society\n, the most delightful memories of evenings that he organised at the Royal Opera House. His generosity, however, was not only enjoyed by individual members; the Society as a whole was always close to his heart, and he demonstrated this by the many gifts of books and journals that he presented to the Library over the years; no one who uses the Library at all regularly can have failed to notice the extent of these donations.\nTyrrell sums up Evelyn's character as follows\n[\n9\n]\n:-\nIn his mathematics, as in everything else, Jack Evelyn was not a man to follow fashions. He did what he did because he enjoyed doing it. His mathematical interests were fairly closely circumscribed and, perhaps for that reason, one did not get to know him very easily; but his friendship, once given, was a lasting one and its loss, to those of us who knew it, will not easily be forgotten.\nHe died after suffering a painful illness over several years. A 'Service of Remembrance and Thanksgiving' was held on Wednesday,\n30\nJune\n1976\n, in St James's Church, Piccadilly, London."
}