{
  "nome_completo": "John Miller",
  "nome_curto": "John Miller",
  "ano_nascimento": "1871",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Miller_John/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Victoria Infirmary, Glasgow, Scotland",
  "biografia": "John Miller\n's father was  John Miller\n(\nborn in Cambuslang, Lanarkshire about\n1840)\nwho was a power loom weaver. His mother was  Mary Miller\n(\nborn in Eaglesham, Renfrewshire about\n1847)\n. He had two older sisters Margaret\n(\nborn about\n1868)\n, and Jane\n(\nborn about\n1870)\nand one younger sister and five younger brothers: Robert\n(\nborn about\n1874)\n, Mary\n(\nborn about\n1877)\n, James\n(\nborn about\n1881)\n, William\n(\nborn about\n1883)\n, Thomas\n(\nborn about\n1886)\nand David\n(\nborn about\n1888)\n.\nJohn Miller attended John Street School, followed by the Free Church Training College for Teachers. He studied at the University of Glasgow and was awarded an M.A. in\n1896\n. He had taken a range of subjects including Latin, Greek, Mathematics and Natural Philosophy and his degree was awarded with First Class Honours in Mathematics and Physics. Following this he went to Göttingen to continue his study of mathematics.\nReturning from Germany he was appointed as a teacher in Maybole but after a short while he returned to the University of Glasgow in\n1897\nto continue his studies supported by a George A Clark scholarship. His research earned him a D.Sc. from Glasgow in\n1909\n. He was appointed as an Assistant to\nGeorge A Gibson\nat the Royal College of Science and Technology in Glasgow in\n1899\n, continuing in this position for ten years before being appointed Professor at the same institution in\n1909\nafter\nGibson\nleft to take up a chair at the University. He held this post until he retired in\n1934\n.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\non\n21\nFebruary\n1910\nhaving been proposed by\nGeorge A Gibson\n, Magnus Maclean,\nAndrew Gray\n, and\nWilliam Jack\n.\nHis obituary in the Edinburgh Mathematical Notes is at"
}