{
  "nome_completo": "John Mackintosh Howie",
  "nome_curto": "John Howie",
  "ano_nascimento": "1936",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Howie/",
  "lugar_nascimento": "Chryston, Lanarkshire, Scotland",
  "lugar_morte": "St Andrews, Scotland",
  "biografia": "John Howie\n's parents were David Yuille Howie and Janet Macdonald Mackintosh. There were three children in the family, with John having an elder sister and a younger brother. The Rev David Howie was a Church of Scotland minister at the Parish Church in Chryston at the time John was born. The family left Chryston in\n1937\nand moved to Keith, about\n45\nmiles northwest of Aberdeen, where John attended primary school. The family moved again in\n1946\n, this time to Aberdeen, where John's secondary education was at Robert Gordon's College. He entered the College in\n1948\nand completed his school education in\n1954\nas Modern Dux of the College. Then he entered the University of Aberdeen where he studied from\n1954\nto\n1958\n, graduating with an M.A. in Mathematics and Natural Philosophy with First Class Honours. It was an extremely successful undergraduate career and he was awarded the Dr\nJ A Third\nprize, awarded annually to the best student of mathematics, as well as the Simpson Prize and Rennet Gold Medal in Mathematics. In addition he received the Lyon Prize for the most distinguished graduate in the Faculty of Arts.\nAfter graduating from the University of Aberdeen, Howie spent the academic year\n1958\n-\n59\nteaching as an Assistant in Mathematics at the University of Aberdeen. In October\n1959\nhe matriculated at Balliol College, University of Oxford, to undertake research for a D.Phil. with\nGraham Higman\nas his thesis advisor. However\n[\n2\n]\n:-\n...\nHigman\nwas on leave for part of the time and John was supervised instead by\nGordon Preston\n, who had recently returned to live in Oxford after a two-year stint with\nA H Clifford\nin New Orleans. In view of this, it was not surprising that John found himself steered into semigroup theory and he wrote his D.Phil. thesis on amalgamation theory - a new topic then and one that has remained of central interest to him throughout his career.\nHowie explained in\n[\n1\n]\nhow\nGordon Preston\ninfluenced him:-\nI met\nGordon Preston\nfirst in\n1959\n, when I arrived in Oxford as a graduate student working under the supervision of\nGraham Higman\n. Gordon lived in Oxford - Shrivenham, his place of work, is just\n30\nkm away - and he was a regular attender at the\nHigman\nalgebra seminar. For the final year of my study at Oxford, when\nHigman\nwas on sabbatical leave in Chicago,\nPreston\nwas my supervisor, and it is a pleasure now to be able to pay public tribute to the quality of the help and encouragement I received from him during that period.\nHowie was awarded his D.Phil. in\n1961\nfor his thesis\nSome problems in the theory of semigroups\n. Results from his thesis were published in\nEmbedding theorems with amalgamation for semigroups\nwhich appeared in the\nProceedings\nof the\nLondon Mathematical Society\nin\n1962\n. This paper investigated conditions under which the amalgam of semigroups with one amalgamated subsemigroup is embeddable in a semigroup. While he was a research student, Howie had married Dorothy Joyce Mitchell Miller, the daughter of Alfred James Miller OBE, from Aberdeen, in King's College Chapel Aberdeen on\n5\nAugust\n1960\n. John and Dorothy had met while both were undergraduates in Aberdeen through both being squash players. They had two daughters, Anne\n(\nborn\n1961)\nand Katharine\n(\nborn\n1963)\n.\nAfter the award of his D.Phil. from the University of Oxford, Howie returned to Scotland where he was appointed as an Assistant in Mathematics at the University of Glasgow. After two years in this temporary position, Howie was appointed to a permanent Lectureship in Mathematics at the University of Glasgow in\n1963\n. He gained experience with research visits in the United States, spending six weeks at Pennsylvania State University in\n1963\nand then ten months at Tulane University in\n1964\n-\n65\n. The University of Stirling was a new university which opened in\n1967\nand Howie, as a founder member of the university staff, made a significant contribution to the early years.\nDouglas Munn\n, who became the first Professor of Mathematics at the new university, writes\n[\n2\n]\n:-\n... when I moved to the newly-created Stirling University in\n1967\n,\n[\nJohn Howie\n]\naccompanied me as a Senior Lecturer.\n[\nFor\n]\nthree years, ... he made an enormous contribution to many aspects of the life of this rapidly expanding institution ...\nI\n[\nEFR\n]\nfirst met John Howie soon after the University of Stirling opened. I was nearing completion of my Ph.D. and was looking for a university position. I wondered if there were openings at Stirling and went there and spoke to John Howie and\nDouglas Munn\n. I remember that John asked me if I was musical - sadly the answer was no. In\n1968\nI was appointed to the University of St Andrews.\nIn the autumn of\n1969\nEdward Copson\nretired as Regius Professor of Mathematics at the University of St Andrews. Jim Tatchell acted as head of the Department of Pure Mathematics during\n1969\n-\n70\nwhile a new Regius Professor was being sought. John Howie was appointed and, after appointing John O'Connor as a lecturer, took up his duties in October\n1970\n. Also in\n1970\n, Howie was awarded a D.Sc. by the University of Aberdeen for his thesis\nContributions to the algebraic theory of semigroups\n. The next few years were difficult ones as the Department of Pure Mathematics and the Department of Applied Mathematics tried to find a way to cooperate in teaching mathematics at St Andrews. Howie, as Head of Pure Mathematics, had a tricky role to play particularly as the number of lecturers in pure mathematics slowly reduced.\nLet us quote from\nDouglas Munn\n[\n2\n]\nfor a brief overview of Howie's research contributions:-\nJohn's research has been entirely in the algebraic theory of semigroups. It is not possible to give a detailed critique of this here but, as can be seen from his list of publications, two main areas stand out: amalgamations and transformation semigroups. In one of his early papers, he showed that certain regular semigroups of transformations could be generated by their idempotents; and the notion of idempotent-generation was then taken up eagerly by others. Much of his later work on transformations has had a combinatorial and indeed number-theoretic flavour. Many of his ideas were adapted and developed by his research students, with whom he often published joint work. Amongst his early papers, we might single out two interesting examples which do not fall under the main headings above: his work on idempotent-separating congruences on inverse semigroups and that on epimorphisms and dominions\n(\nwith John Isbell\n)\n. Other work outside the aforementioned categories concerns semigroup presentations.\nPerhaps Howie's most significant contribution to semigroup theory was the outstanding book\nAn introduction to semigroup theory\n(1976)\n. Tom Hall writes in a review:-\nThe author's aim is to provide an updated introduction to purely algebraic semigroups, i.e., semigroups with no further structure. The book more than succeeds in this aim. First, it is a top-rate book for its main intended audience, students with some knowledge of algebra and mathematical sophistication, who are approaching semigroups for the first time. The material is made absolutely clear and the style is interesting and informative. Of particular interest and importance are the many discussions of how sections of the theory are related to one another. In places, an air of excitement is generated as the author takes the reader through the possible thought processes of the researcher trying to produce a result, a mere five years earlier. Second, a study of the entire book will provide for the potential researcher a strong background in material not previously available in book form.\nDouglas Munn\nwrote\n[\n2\n]\nthirty years after Howie's classic text was published, so he was able to see clearly the enormous impact the book enjoyed:-\nThe year\n1976\nsaw the publication of his monograph: 'An introduction to semigroup theory'. It would be hard to over-estimate the impact that this made on the subject. For many years previously the main repository of knowledge in this field had been the pioneering English-language text by\nClifford\nand\nPreston\n: 'The algebraic theory of semigroups'\n(\nvol.\n1\n,\n1961\n; vol.\n2\n,\n1967)\n. It had attempted to provide a comprehensive account of the subject and, although immaculately written, might have been somewhat daunting to a newcomer! John's book was less ambitious in its coverage: moreover, it included recent topics and had a clearly-defined theme\n(\nregular semigroups\n)\n. Coupled with the fact that it was written in his typically appealing style, it was a winner from the start. Certainly it must have attracted many students worldwide to the subject.\nPerhaps this is the time to look at the other monographs Howie wrote. These are\nAutomata and languages\n(1991)\n, and\nFundamentals of semigroup theory\n(1995)\n. The second of these began life as a new edition of\nAn introduction to semigroup theory\nbut soon took on a life of its own becoming much more than just an updated edition. Peter Higgins writes in a review:-\nThe original book described itself as pitched at the undergraduate/graduate level, while the present work is called a graduate introduction. This perhaps says more about the lower standards expected of undergraduates than about a true change in the nature of the book, but it has freed the author, allowing him to be a little more thorough and uncompromising. ... the book remains the most suitable on which to base a modern introductory course in algebraic semigroups.\nNik Ruskuc came to St Andrews in\n1992\nand undertook doctoral studies advised by me\n[\nEFR\n]\nand John Howie. At a Thanksgiving Service for the Life of John Howie, in Hope Park and Martyr's Parish Church, St Andrews on\n5\nJanuary\n2012\n, Nik gave an address where he gave a moving account of his weekly sessions in John Howie's office.\nSee\nHowie Thanksgiving Service\n.\nJohn Howie was an outstanding lecturer and taught a wide variety of courses while at St Andrews. As well as his administrative duties in Pure Mathematics, he took on wider university roles, particularly as Dean of the Faculty of Science during the three years\n1976\n-\n79\n. He also played major roles in the Scottish and UK educational scenes. He served on the Mathematics Panel of the Scottish Examination Board during\n1967\n-\n73\nand was convener of this panel during\n1970\n-\n73\n. He was Chairman of the Scottish Central Committee for Mathematics from\n1975\nto\n1981\n, and served as President of the\nEdinburgh Mathematical Society\nduring\n1973\n-\n74\n. He was a member of the Dunning Committee\n(1975\n-\n77)\nwhich carried out a review of school examinations, and chaired the Howie Committee\n(1990\n-\n92)\nset up to review Fifth and Sixth Years in Scottish secondary schools. The Howie Committee's report\nUpper Secondary Education in Scotland,\npublished on\n5\nMarch\n1992\n, proposed radical changes to the Scottish school curriculum which\n(\nvery sadly in my opinion\n)\nwere largely ignored.\nSee\nHowie Committee - proposals and reactions\n.\nJohn was an active member of the\nLondon Mathematical Society\nserving as a member of the Council\n(1982\n-\n88\nand\n1989\n-\n92)\n, Chairman of the Education Committee\n(1985\n-\n89)\n, Chairman of the Public Affairs Committee\n(1990\n-\n92)\nand Vice-president of the Society for two terms, first in\n1986\n-\n88\nand again in\n1990\n-\n92\n. He was elected to the\nRoyal Society of Edinburgh\nin\n1971\n, served on its Council from\n1992\nto\n1995\nand was Curator of the Society\n2006\n-\n2011\n. The\nRoyal Society of Edinburgh\nawarded Howie their Keith Prize for the papers he published in their\nProceedings\nduring the period\n1979\n-\n81\n. He was Chairman of Governors of Dundee College of Education during\n1983\n-\n87\nand, following its amalgamation with the Aberdeen College, he served as a Governor of the Northern College of Education during\n1987\n-\n2001\n.\nJohn Howie also served the mathematical community world-wide with the editorial duties he performed. He was Editor of\nSemigroup Forum\n1976\n-\n1998\n, being Executive Editor\n1990\n-\n94\nand serving on the Council\n1994\n-\n1998\n. He was made an Honorary Editor in\n1999\n. He also served as Editorial adviser for\nProceedings A\nof the\nRoyal Society of Edinburgh\nfor two spells, namely during\n1988\n-\n91\n, and again during\n1997\n-\n2000\n. For five years from\n1994\nhe was Editor of\nCommunications in Algebra\nand he served on the Editorial Board of\nPortugaliae Mathematica\nfrom\n1989\n.\nHowie had another passion that we have not yet mentioned, namely his love of music. He played the organ and sang making a huge contribution to the musical life of St Andrews with both of these talents. He was Organist and Director of the Choir at Hope Park Parish Church, St Andrews from\n1978\nto\n2010\n. He sang in the St Andrews Chorus and was its President\n1995\n-\n97\n. He was Director of University Music\n1996\n-\n97\n, and Treasurer of St Andrews Music Club\n1999\n-\n2010\n. Related to his love of music was his love of Scottish County Dancing and, as well as participating in this over many years, he also served as President of the University Staff Country Dance Group in\n1996\n-\n97\nand again in\n1999\n-\n2000\n.\nIn\n1997\nJohn Howie took early retirement - his contract as Regius Professor would have allowed him to continue in post until he was\n70\nyears old so he could have continued in post for almost ten more years. Retirement certainly did not mean that he gave up mathematics. Quite the reverse, for retirement gave him the opportunity to undertake certain mathematical tasks once he was free from administrative duties. He continued to write research papers, most of which involved collaborations with colleagues around the world. He also wrote three undergraduate texts:\nReal analysis\n(2001)\n;\nComplex analysis\n(2003)\n; and\nFields and Galois Theory\n(2006)\n. All three show John Howie's outstanding skills in writing and explaining mathematical ideas. They have been very well-received - a review of\nReal analysis\nstates:-\nThe most striking feature of 'Real Analysis' is not so much its content\n(\nwhich is absolutely standard fare\n)\nbut the author's\nFerrar\n-like concern for the reader's understanding which shines through on every page of this carefully written and carefully paced text.\nLet us end this brief biography of John Howie by quoting a review by D C Jackson of Howie's paper\nSemigroups, past, present and future\npresented to the International Conference on Algebra and its Applications in Bangkok in\n2002\n:-\nThis is a view of semigroup theory, past, present and future, by eminent semigroup theorist J M Howie. His thoughts and comments are captured in a succinct and informative paper which looks at the history of semigroup theory and its development over the years as he notes the most influential results, papers and books. He also touches on subjects such as what is meant by good mathematics and, indeed, good semigroup theory, and quality in mathematics. He believes that semigroup theory has the potential to be an important and indispensable part of mathematics, but that it will not happen unless links with other parts of mathematics are actively pursued. He comments that, in the future, he would like to see semigroup theory develop in ways that establish links with other areas of learning, both within and beyond pure mathematics.\nFinally, in addition to the many honours given to John Howie which he have mentioned above, we note that he received a C.B.E. in\n1993\n:-\n... for services to education."
}