{
  "nome_completo": "John James Waterston",
  "nome_curto": "John Waterston",
  "ano_nascimento": "1811",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Waterston/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "John Waterston\n's paternal grandfather, William Waterston, married Catherine Sandeman from the family of port wine importers. She came from the Christian religious sect known as the Glasites, or Sandemanians, where independence of thought was highly valued. William and Catherine's son George Waterston, an Edinburgh sealing wax manufacturer and stationer, married Jane Blair from Dunkeld. They had nine children of which John Waterston, the subject of this biography, was the sixth. The family were well off, led a happy life having interests in literature, science and music, and the children had the best possible education.\nJohn Waterston studied at Edinburgh High School, then entered Edinburgh University to study mathematics and physics while at the same time being an apprentice in the engineering firm of Grainger and Miller. At Edinburgh University he was a pupil of\nJohn Leslie\nwho gave him an excellent training in mathematical physics. Waterston published his first paper on mathematical physics while a student. However, his interests were broad and he also attended lectures in chemistry, anatomy and surgery. His interests were broader than just science for he enthusiastically took part in the activities of the university student literary society.\nWaterston went to London in\n1832\nto work for James Walker, a leading civil engineering firm, where he worked as a surveyor for laying railway tracks. He worked for this firm for three years but his real aim was to undertake mathematical and scientific research and the family ethos was that the best strategy to attain this was to have employment which was not directly associated with ones research interests. His surveying job left him little time and he costantly had to move round the country so, to better accomplish his research aims, he first took a job with the Hydrography Department of the Admiralty where he worked under Francis Beaufort, then in\n1839\ntook up a well-paid post as a naval instructor with the Bombay Academy of the East India Company. He remained in India for nearly\n20\nyears. He had now a job which gave him the necessary free time to pursue his ambition to undertake science research but being outside the established scientific community, he found it difficult to get the recognition he deserved.\nHe published papers on many scientific topics including astronomy, physics, chemistry, and physiology. Astronomical topics covered included comets, solar radiation, and lunar occultations. Becoming interested in calculating the age of the sun, he studied the kinetic theory of gases realising that chemical processes alone were insufficient to explain the solar output. His approach was statistical and in this respect he certainly deserves the credit of coming up with the main approach of\nClausius\nand\nMaxwell\nat least\n20\nyears before they did. He was able to derive theoretically several of the laws, such as those of\nBoyle\n, which had only been postulated empirically. He published the book\nThoughts on the Mental Functions\nin\n1843\n. D Levermore writes\n[\n6\n]\n:-\nIn\n1843\nhe published a book that included some of his early results on the kinetic theory of gases. His most significant conclusion was that \"equilibrium of temperature depends on molecules, however different in size\" having the same kinetic energy. This was a special case of what later became known as the \"equipartition theorem.\" There is no evidence that any physical scientist read the book; perhaps it was overlooked because of its misleading title, 'Thoughts on the Mental Functions'.\nWaterston's most significant contribution came two years later when he submitted a long paper on the kinetic theory of gases to the\nRoyal Society\n. Jefferies writes\n[\n1\n]\n:-\nIn\n1845\nWaterston's paper was communicated to the\nRoyal Society\nin London, where it was read but rejected for publication by the Society's referees. As was the practice, Waterston's manuscript was not returned to him, but instead became the property of the\nRoyal Society\nand was retained in the archives. Waterston had not made a copy of this complex manuscript and was unable to reconstruct it in sufficient detail to submit it for publication elsewhere. By the time he realised it would not be published by the\nRoyal Society\n, his interest had passed on to the physical chemistry of liquids and gases.\nIn\n1851\nWaterston submitted a paper to the\nBritish Association for the Advancement of Science\nfor their annual meeting held at Ipswich in that year\n[\n6\n]\n:-\nThe published abstract of that paper clearly states that in gas mixtures, the average kinetic energy of each kind of molecule is the same; thus he established his priority for the first statement of the equipartition theorem. He also indicated in this abstract that Avogadro's hypothesis follows from the kinetic theory.\nIn\n1857\nhe returned to Scotland after becoming unhappy at the problems he was having in getting his work published. He continued his researches with his main interest now being in physical chemistry.\nWaterston's death was rather mysterious. He went for a walk along the waterfront close to Edinburgh and was never seen again. It was assumed that he had had a dizzy spell and fallen into the water and drowned. His body, however, was never recovered. The belief that he had suffered a dizzy spell was not unreasonable since he had suffered from dizzy spells since he contracted heatstroke while living in India.\nIt was\nRayleigh\nwho discovered Waterston's unpublished paper in\n1891\nand the\nRoyal Society\nthen published it when he pointed out that its importance in light of the later work along the same lines by\nClausius\nand\nMaxwell\n.\nRayleigh\nsaid that the paper represented:-\n... an immense advance in the direction of the now generally received theory. The omission to publish it at the time was a misfortune which probably retarded the development of the subject by ten or fifteen years.."
}