{
  "nome_completo": "John Purser",
  "nome_curto": "John Purser",
  "ano_nascimento": "1835",
  "ano_morte": "1903",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Purser/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Dublin, Ireland",
  "biografia": "John Purser\n's parents were John Tertius Purser\n(1809\n-\n1893)\nand Anna Benigna Fridlezius\n(1803\n-\n1881)\n. Tertius Purser was born on\n25\nMay\n1809\n, in Ransford Street, Dublin, Ireland. In\n1824\nhe joined the Dublin brewery business A Guinness, Son & Co., in which his father and other family members had a major role. He had a brother Edward Purser who was General Manager and Chief Engineer of the Ottoman Railway. Another brother Benjamin Purser, born in\n1815\n, was a miller and grain merchant in Dungarvan, Co. Waterford. Benjamin Purser had a daughter Sarah Purser\n(1848\n-\n1943)\nwho became a well-known artist, see\n[\n1\n]\n. Tertius Purser had a sister, also named Sarah Purser, who married Richard W Biggs in Dublin on\n18\nJune\n1839\n. Dr Richard W Biggs ran a school at Devizes, Wiltshire. Some of people we have just mentioned played a part in the life of John Purser, the subject of this biography and we will meet them again later in this article. Tertius Purser married Anna Benigna Fridlezius in\n1834\n. Anna, who was Swedish, was a member of the religious sect the Moravian Brotherhood and Tertius joined the Moravian Brotherhood when he married Anna. This church, which originated in Moravia in the fifteenth century, had an Irish branch founded by John Cennick in Dublin in\n1746\n. The Moravian Church was situated at\n40\nLower Kevin Street in Dublin and members of the Church were classified as dissenting Protestants.\nTertius Purser made good money working for the Guinness brewery and in June\n1834\n, around the time of his marriage, he purchased Rathmines Castle on Upper Rathmines Road in Dublin. This was not an ancient building when he purchased it, for it had been built in\n1820\nby a Colonel Wynne.\nThe Dublin Penny Journal\ndescribed the castle in\n1833\nas having round Norman towers connected by curtain walls, embattled parapets, mullioned windows with hood mouldings, oriels and machicolations. The\nDublin Penny Journal\nexplained that:-\n... it is only an imitation although a happy one.\nFor a picture of Rathmines Castle, see\nTHIS LINK\n.\nTertius and Anna Purser had three children: John Purser, the subject of this biography born in\n1835\n; Anna Benigna Fridlezius Purser, known as Nina, born in\n1837\n; and Frederick Purser, born\n1839\n, who became a Fellow of Trinity College Dublin and Professor of Natural Philosophy in Dublin. In\n1871\nAnna Benigna Fridlezius Purser married Sir John Purser Griffith\n(1848\n-\n1938)\n, the son of a long-standing friend of her father Tertius Purser. John Purser Griffith studied engineering at Trinity College Dublin and had an outstanding career in civil engineering which led to his knighthood.\nJohn Purser, the subject of this biography, received his early education at the private boarding school run by his uncle, Dr Richard W Biggs, at Devizes, Wiltshire. We note that his brother Frederick Purser and John Purser Griffith, his future brother-in-law, were both educated at the same school. Purser completed his schooling at Devizes and began his university studies when he entered Trinity College, Dublin. He was the best mathematician of his year at the University and in\n1855\nhe gained the Lloyd Exhibition. He was classed as Senior Moderator with the first gold medal in Mathematics. He continued to receive prizes for his outstanding performance in mathematics and was awarded the Bishop Law's mathematical premium and the\nMacCullagh\nPrize, graduating B.A. in\n1856\nas first senior moderator in mathematics and mathematical physics\n[\n2\n]\n:-\nIn the ordinary course of events a man of his outstanding ability could look forward to gaining the Fellowship, but at that time and until\n1873\nthe Trinity Fellowships could only be held by members of the Established Church, and the Purser family belonged to the Moravian body. On leaving college Purser's first appointment was that of tutor to the sons of Lord Rosse at Parsonstown.\nThe requirement that fellows of Trinity College, Dublin, had to be members of the established Church of Ireland was only abolished by Fawcett's Act in\n1873\n. Purser became a tutor to the four sons of William Parsons,\n3\nrd\nEarl of Rosse\n(1800\n-\n1867)\nin\n1857\n. Lord Rosse had married Mary Field, daughter of John Wilmer Field, on\n14\nApril\n1836\nand only four of their thirteen children reached adulthood: Lawrence\n(\nborn\n1840)\n; Randal\n(\nborn\n1848)\n; Richard Clere\n(\nborn\n1851)\nwho went on to develop railways in South America; and Charles Algernon\n(\nborn\n1854)\nwho is known for inventing the steam turbine. Lord Rosse's\n72\n-inch telescope, built in\n1845\nand colloquially known of as the \"Leviathan of Parsonstown\", was the world's largest telescope when it was built and continued to hold this distinction until the early\n20\nth\ncentury. As well as acting as tutor to the children, Purser did become involved in Lord Rosse's interest in astronomy but he did not do any observing.\nIn\n1858\nTertius Purser's father died and Tertius was offered a partnership in the Guinness brewery. He refused the partnership because of the austere principles that he derived from his Moravian beliefs. At this time the Guinness family became sole owners of the firm but Tertius Purser continued as General Manager until the business was floated as a Limited Company in\n1886\n. Tertius's religious beliefs always seemed somewhat in conflict with the brewery business since he objected to Sunday drinking in pubs. After he retired, he went to the United States and set up a flour milling business in San Francisco. It was not a success.\nGeorge M Slesser was Senior\nWrangler\nin the mathematical tripos at the University of Cambridge in\n1858\n. He was the first student coached to the senior wrangler position by\nEdward Routh\nand, after graduating, Slesser began research on moving axes. He became Professor of Mathematics at Queen's College, Belfast, in\n1860\nbut died in\n1862\naged just\n28\n. Purser was appointed to fill Slesser's chair at Queen's College, Belfast, in\n1863\n[\n2\n]\n:-\nIt was a fortunate choice for the College. During the long period of\n38\nyears, ending with his resignation in\n1901\n, the Professor of Mathematics rendered services whose value it would be difficult to overestimate. In\n1878\nhe was made Registrar. He discharged the duties of this office with wisdom and tact, but it is as a teacher that he will be chiefly remembered by the many generations of Queen's men who were privileged to be his pupils. He was truly a great teacher. His lectures were models of clearness, and he had an extraordinary faculty for making his subject interesting, infusing freshness and beauty into everything he touched. If ever there was an artist in mathematics John Purser was one. He published very little original work. He was keenly interested in new developments, and talked about them with brilliant suggestiveness, but he did not feel strongly the impulse to produce. His inventiveness found scope rather in devising elegant propositions to be set as examination questions.\nA student of Purser's, many years later wrote an article in\nThe Northman\nin\n1945\n. He wrote\n[\n3\n]\n:-\nPurser, the mathematician, was the greatest and most enthusiastic teacher and lecturer one could ever imagine. He threw his physical as well as mental energy into his demonstrations, his students always following his movements - and he was always moving - as well as his ideas with admiration and delight.\nThe article\n[\n4\n]\nstates:-\nHe was an enthusiastic and inspiring teacher and the testimony of his students shows that he produced a profound and lasting impression upon them. Three of his students became Senior Wranglers, viz., the Rev A J C Allen in\n1878\n, Professor\nJoseph Larmor\nin\n1880\n, and Professor\nWilliam McFadden Orr\nin\n1888\n.\nIn addition to these three, Purser also taught John Henry MacFarland who became Chancellor of Melbourne University.\nAlthough Purser is much better known as a teacher than as a researcher, he did produce one particularly notable result\n[\n2\n]\n:-\n... when the necessary stimulus came from without he was capable of producing work of the very highest quality. An example of this occurred when the\nBritish Association\nmet in Belfast in\n1874\n. It was suggested to Purser that he should write a paper for the occasion. He turned to a problem which had been puzzling the best astronomers and mathematicians of the day, including the Astronomer Royal and the French astronomer\nCharles Eugene Delaunay\n. This was, to quote from the title of Purser's short paper, \"The Source from which the Kinetic Energy is Drawn that Passes into Heat in the Movement of the Tides.\" He showed conclusively that the earth's rotation is the source in question, and so made a beginning in a subject afterwards worked out by Sir\nGeorge Darwin\n. When the\nBritish Association\nnext came here in\n1902\nPurser was elected President of Section A. His presidential address was a valuable history of the great Dublin school of mathematics to which he himself belonged.\nPurser never married. When his father died on\n5\nApril\n1893\n, Rathmines Castle passed to him. He died at Rathmines Castle in\n1903\n, a very wealthy man. In his will he left £\n100\n,\n000\nto his brother Frederick Purser, £\n40\n,\n000\nto his sister Anna Griffith and £\n5\n,\n000\nto each of her children. In addition to the money, Purser owned property in Blessington Street, Essex Street and Eustace Street which he left to his brother-in-law John Purser Griffith. Other properties and interests that he owned he divided between his brother Frederick and his sister Anna. After Purser's death, his sister Anna and her husband John Purser Griffith moved into Rathmines Castle although, at this time, its ownership had gone to Frederick Purser. After Frederick died in August\n1910\n, the Castle and his considerable wealth passed to Anna.\nFinally let us note that the painting of Purser which is attached to this biography was painted by the artist Sarah Purser, the daughter of Tertius Purser's brother Benjamin Purser. The portrait hangs in Queen's College, Belfast."
}