{
  "nome_completo": "John Guthrie Kerr",
  "nome_curto": "John Kerr",
  "ano_nascimento": "1853",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kerr/",
  "lugar_nascimento": "Girvan, Ayrshire, Scotland",
  "lugar_morte": "Inverbruie, Aberdeen, Scotland",
  "biografia": "John Kerr\n's father was  James Drynan Kerr\n(\nborn in Girvan, Ayrshire in\n1825)\nwho was a coal merchant. His mother was  Sarah Guthrie born in Girvan, Ayrshire in\n1824)\n. John Kerr had an older brother William\n(\nborn about\n1851)\nand younger sisters Helen\n(\nborn about\n1855)\n, Ettie\n(\nborn about\n1857)\n, Janet\n(\nborn about\n1860)\n, Grace\n(\nborn\n1861)\nand Annie\n(\nborn about\n1864)\n.\nJohn Kerr was educated at Dumbarton Academy. He was awarded the Browne Bursary in his final year at the Academy and entered the University of Glasgow in\n1871\n. He won prizes in Mathematics, Greek and Natural Philosophy. He matriculated at Balliol College on\n20\nOctober\n1874\nage\n21\n. He was a Snell Exhibitioner\n1874\n-\n77\n. He taught at Kilmarnock Academy\n1876\n-\n77\n.  He married Euphemia Fleming on\n3\nJuly\n1877\nin Dunbarton and they had children: George, James and Barbara.\nJames Barr\n(1862\n-\n1949)\n, minister of religion and politician, wrote\n[1]\n:-\nIn February,\n1877\n, I entered Kilmarnock Academy , then in North Hamilton Street , where Dr Hugh Dickie was Rector and the leading teacher was Dr John G Kerr, later of Allan Glen's School, Glasgow. I was fortunate beyond measure. Dr Kerr was a Snell Exhibitioner of Balliol College, Oxford. He was equally distinguished in Classics and in Mathematics. I soon came under his spell and within a fortnight of entering his class in Mathematics I took up\nEuclid\nat the sixteenth proposition in the first book and read on with great delight proposition after proposition. At the end of six months I was awarded the first prize in the Junior section, and two years thereafter I won the gold medal for Mathematics and was declared dux of the school.\nKerr was a lecturer in Mathematics and Physics at the Church of Scotland Teacher-Training College\n(1877\n-\n90)\n. During this period he joined the\nEdinburgh Mathematical Society\n, becoming a member in April\n1884\nafter attending\nMuir\n's lecture on\nThe Promotion of Research with Special Reference to the Present State of the Scottish Universities and Secondary Schools\nin the previous month. He resigned from the Society on\n13\nNovember\n1896\n.\nAllan Glen's School, Glasgow, was established under the will of Allan Glen after his death in\n1850\n. In\n1876\n, the governors of Allan Glen's School obtained the Allan Glen's Institution Act and embarked upon an extensive programme of scientific and technical education. In\n1890\nJohn Kerr was appointed Headmaster of Allan Glen's School. Andrew McCance writes\n[\n3\n]\n:-\n...\n[\nIn the early\n1900\ns James McFadyen McNeill\n]\nwon a scholarship to Allan Glen's School in Glasgow. Under the headmastership of Dr John G Kerr, an outstanding character and teacher, this school was then at the height of its influence as a school where science teaching occupied an important part of the curriculum on both the theoretical and practical sides - a very unusual feature in schools of that period.\nThe character of the School during this period can be seen from the advertising material:-\n... mathematical and practical science are relied on to develop and fortify the mind ... Latin plays an unimportant part in the training and Greek, by regulations of the school, is expressly excluded.\nMangan, in\n[\n2\n]\n, writes:-\nKerr was always to insist that training in science and workshop exercises offered by the specialised curriculum of the school, was valuable, not so much on account of its direct utility to the boy in his career but rather because of its value as an aid to intellectual growth.\nKerr died in\n1932\nin Inverbruie, Aberdeen.\nKerr's article on\nThe Present State of Technical Education\nis at\nTHIS LINK\n."
}