{
  "nome_completo": "John Farey",
  "nome_curto": "John Farey",
  "ano_nascimento": "1766",
  "ano_morte": "1826",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Farey/",
  "lugar_nascimento": "Woburn, Bedfordshire, England",
  "lugar_morte": "London, England",
  "biografia": "John Farey\nhas been included in this archive despite being a geologist and not a mathematician. The reason we have included him is that he made one mathematical observation and, from this, the Farey series of fractions has been named. We shall discuss below Farey's contribution to mathematics and also look at others who contributed to Farey series.\nFarey attended a local school in Woburn until he was sixteen years of age when he went to a school in Halifax, Yorkshire, where he studied mathematics, drawing and surveying. He married in\n1790\nand, the following year, his first son\n(\nalso called John Farey\n)\nwas born. John Farey Jnr\n(1791\n-\n1851)\nwent on to become a civil engineer and also has an entry in the\nDictionary of National Biography\nimmediately following that of his father.\nFrancis, the fifth Duke of Bedford had extensive estates in Bedfordshire and, in\n1792\n, he appointed Farey as the land steward for his Woburn estates. Farey held this post for ten years and it was during this time that he was able to gain expertise in geology.\nIn October\n1801\nWilliam Smith, the engineer and geologist who is best known for his development of the science of stratigraphy\n(\nwhich is the study of rock successions and relation to the historical time scale\n)\n, was employed by the Duke of Bedford. Farey had already become interested in soils and rocks through carrying out his duties as land steward and he now took the opportunity to learn all that he could from Smith about stratification. When the Duke died suddenly in\n1802\n, the Duke's brother John dismissed Farey from his post. At this point Farey went to London where he\n[\n4\n]\n:-\n... established an extensive practice as a consulting surveyor and geologist.\nThere are two aspects to Farey's contributions to science. On the one hand he applied the skills in geology which he had learnt from Smith and made some important contributions. Perhaps the word \"important\" here is overstating the case which Eyles in\n[\n1\n]\nespresses as follows:-\nAs a geologist Farey is entitled to respect for the work which he carried out himself, although it has scarcely been noticed in the standard histories of geology.\nLet us note that this work included producing a map of the strata visible between London and Brighton\n(\na journey he made frequently to visit his brother who lived in Brighton\n)\n, and his\nSurvey of the county of Derbyshire\nwhich studied the soils and the succession of strata in that county.\nThe second aspect of Farey's work was his scientific writings. These are important, in part because he argued strongly for William Smith to be recognised as a major figure in geology and without his efforts Smith's contributions may not have been so readily appreciated.\nFarey published around sixty scientific articles between\n1804\nand\n1824\n, most in\nRees's Encyclopaedia\n, the\nMonthly Magazine\nand the\nPhilosophical Magazine\n. His first article, written in\n1804\nin the\nPhilosophical Magazine\nwas\nOn the mensuration of timber\nwhile the last, in the same publication, was\nOn the velocity of sound and on the Encke planet\n. Neither the biographies\n[\n1\n]\nnor\n[\n4\n]\nmention Farey's contribution to mathematics.\nFarey's article which is relevant to our history of mathematics archive was also published in the\nPhilosophical Magazine\nand appeared in\n1816\n. It was called\nOn a curious property of vulgar fractions\nand it was sent to the editor from Howland Street in London, the residence of Farey's eldest son where he spent the last years of his life\n(\nin fact he died in that house\n)\n.\nThe article consists of only four paragraphs. In the first paragraph Farey says that he noted the \"curious property\" while examining the tables of\nComplete decimal quotients\nproduced by Henry Goodwin. In the second paragraph he defines the Farey series and states the \"curious property\".\nThe Farey series\n(\nreally a sequence\n)\nis defined as follows. For a fixed number\nn\nn\nn\n, consider all\nrationals\nbetween\n0\nand\n1\nwhich, when expressed in their lowest terms, have denominator not exceeding\nn\nn\nn\n. Write the sequence in ascending order of magnitude beginning with the smallest. Then the \"curious property\" is that each member of the sequence is equal to the rational whose numerator is the sum of the numerators of the fractions on either side, and whose denominator is the sum of the denominators of the fractions on either side.\nIn the third paragraph of his article Farey gives an example. He takes\nn\n=\n5\nn = 5\nn\n=\n5\n. Then the Farey sequence is:\nF\n5\nF_{5}\nF\n5\n​\n=\n(\n0\n1\n,\n1\n5\n,\n1\n4\n,\n1\n3\n,\n2\n5\n,\n1\n2\n,\n3\n5\n,\n2\n3\n,\n3\n4\n,\n4\n5\n,\n1\n1\n)\n\\large \\left( \\frac{0}{1},\\frac{1}{5},\\frac{1}{4},\\frac{1}{3},\\frac{2}{5},\\frac{1}{2},\\frac{3}{5},\\frac{2}{3},\\frac{3}{4},\\frac{4}{5},\\frac{1}{1} \\right)\n(\n1\n0\n​\n,\n5\n1\n​\n,\n4\n1\n​\n,\n3\n1\n​\n,\n5\n2\n​\n,\n2\n1\n​\n,\n5\n3\n​\n,\n3\n2\n​\n,\n4\n3\n​\n,\n5\n4\n​\n,\n1\n1\n​\n)\nFarey illustrates the \"curious property\" with the example\n2\n5\n=\n1\n+\n1\n3\n+\n2\n\\large \\frac{2}{5} = \\frac{1+1}{3+2}\n5\n2\n​\n=\n3\n+\n2\n1\n+\n1\n​\n. To help the reader we note the further examples\n1\n3\n=\n1\n+\n2\n4\n+\n5\n\\large \\frac{1}{3} = \\frac{1+2}{4+5}\n3\n1\n​\n=\n4\n+\n5\n1\n+\n2\n​\n,\n1\n2\n=\n2\n+\n3\n5\n+\n5\n\\large \\frac{1}{2} = \\frac{2+3}{5+5}\n2\n1\n​\n=\n5\n+\n5\n2\n+\n3\n​\nand\n2\n3\n=\n3\n+\n3\n5\n+\n4\n\\large \\frac{2}{3} = \\frac{3+3}{5+4}\n3\n2\n​\n=\n5\n+\n4\n3\n+\n3\n​\n.\nThe final paragraph of\n[\n5\n]\nreads:-\nI am not acquainted, whether this curious property of vulgar fractions has been before pointed out?; or whether it may admit of some easy or general demonstration?; which are points on which I should be glad to learn the sentiments of some of your mathematical readers ...\nOne mathematical reader\n(\nat least of a French translation\n)\nwas\nCauchy\n, and he gave the necessary proof in his\nExercices de mathématiques\nwhich was published in the same year as Farey's article. This might have been the end of the story but the there is more to tell.\nFarey was not the first to notice the property. Haros, in\n1802\n, wrote a paper on the approximation of decimal fractions by common fractions. He explains how to construct what is in fact the Farey sequence for\nn\n=\n99\nn = 99\nn\n=\n9\n9\nand Farey's \"curious property\" is built into his construction. However, this is certainly not a proof, nor for that matter a general statement of the \"curious property\".\nHistorical references to the Farey sequence have been examined by the authors of\n[\n3\n]\n. The standard reference for the Farey sequence is\n[\n2\n]\nin which\nHardy\nwrites:-\n[\nFarey\n]\ngave no proof, and it is unlikely that he had found one, since he seems to have been at the best an indifferent mathematician.\nThe quotation we gave above shows that Farey explicitly states he has no proof.\nHardy\ncontinues:-\nFarey has a notice of twenty lines in the Dictionary of National Biography, where he is described as a geologist. As a geologist he is forgotten, and his biographer does not mention the one thing in his life which survives.\nThis is, in my opinion, unnecessarily cruel and not strictly accurate. Even worse, and certainly completely inaccurate, is\nHardy\n's comment in\nA mathematician's apology\nwhere he writes:-\n... Farey is immortal because he failed to understand a theorem which Haros had proved perfectly fourteen years before ...\nIn fact the newer editions of the Dictionary of National Biography\ndo\ncontain a discussion of Farey sequences.\nThe article\n[\n3\n]\ncontains other interesting information on Farey's sequence, its relation to\nPick\n's area theorem, and the inaccurate historical comments made about the sequence over many years."
}