{
  "nome_completo": "John Robinson Airey",
  "nome_curto": "John Airey",
  "ano_nascimento": "1868",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Airey/",
  "lugar_nascimento": "Hunslet, Leeds, England",
  "lugar_morte": "Llwynon, Newtown, Montgomeryshire, Wales",
  "biografia": "John Airey\n's father, William Airey was born about\n1843\nin Preston Lancashire. He was a stone mason. John's mother, Elizabeth Airey born about\n1844\nalso in Preston. John had three younger siblings, Elizabeth Ann\n(\nborn\n1870)\n, Edwin\n(\nborn about\n1878)\nand Maud\n(\nborn about\n1880)\n. In the\n1871\ncensus, when John was\n2\nyears old the family was living at Hunslet and in\n1881\nthey were living at\n28\nGrosvenor Street, West Leeds.\nJohn Airey was educated at Blenheim Board School and Leeds Central High School. He then took up a teaching post at Leeds Central High School while, at the same time, studying at Yorkshire College for a University of London external B.Sc. He was awarded the degree in\n1894\n.\nAirey taught as a Mathematics Master at Porth Intermediate School, Glamorganshire, until\n1903\nwhen, at the age of\n35\n, he gave up his job to matriculate at St John's College, Cambridge to study the Natural Science Tripos. He was awarded his B.A. in\n1906\n, with first class honours in both Part I and Part II. The quality of his performance is indicated by the fact the he was awarded the Wright, Hockin and Hughes Prizes.\nAfter graduating, Airey became headmaster of Morley Grammar School, holding the post from\n1906\nto\n1912\n. He was principal of the West Ham Technical Institute\n1912\n-\n1918\n, and principal of the City of Leeds Training College\n1918\n-\n33\n. He became a member of the Mathematical Tables Committee of the\nBritish Association for the Advancement of Science\nin\n1911\nand was its secretary\n1916\n-\n29\n. He was co-editor of the\nPhilosophical Magazine\n. In the Mathematical Tables and Other Aids to Computation, in\nProceedings\nof the London Physical Society, and in Reports of the\nBritish Association for the Advancement of Science\n, he published many of his tables. His brother, Sir Edwin Airey was head of a large firm of building contractors and engineers.\nIn\n1910\nAirey married Gwenllian\n(\nborn Ystradyfodwg, Glamorgan about\n1880)\n.\nHere are a few examples of the fine papers he produced while carrying out highly demanding jobs:\nJohn R Airey, The Roots of the Neumann and Bessel Functions,\nProc. Phys. Soc. London\n23\n(1910)\n,\n219\n-\n224\n.\nJohn R Airey, The Vibrations of Circular Plates and their Relation to Bessel Functions, Proc. Phy. Soc. London\n23\n(1)\n(1910\n-\n1911)\n,\n225\n-.\nJohn R Airey, Sines and cosines of angles in circular measure,\nBritish Association for the Advancement of Science\nReport\n1916\n,\n60\n-\n91\n.\nJohn R Airey, The Lommel-Weber Ω Function and Its Application to the Problem of Electric Waves on a Thin Anchor Ring, Proc. Roy. Soc. London, Series A,\n94\n(661)\n(1918)\n,\n307\n-\n314\n.\nJohn R Airey. Zonal Harmonics of High Order in Terms of Bessel Functions,\nProc. Roy. Soc. London\n, Series A,\n96\n(674)\n(1919)\n,\n1\n-\n8\n.\nJohn R Airey, The Radiation Integrals,\nPhil. Mag\n.\n25\n(167)\n(1938)\n,\n273\n-\n282\n.\nAirey joined the\nEdinburgh Mathematical Society\nin November\n1913\nwhen he was the Principal of The Technical Institute, West Ham, London. He remained a member of the Society for the rest of his life. He was also a fellow of the\nRoyal Astronomical Society\nfrom\n1912\n.\nHis obituary appeared in Obituary: John Robinson Airey,\nMonthly Notices of the Royal Astronomical Society\n98\n(1938)\n,\n243\n-\n244\n.\nWe give a version of this obituary at\nTHIS LINK\n."
}