{
  "nome_completo": "John Collins",
  "nome_curto": "John Collins",
  "ano_nascimento": "1624",
  "ano_morte": "1683",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Collins/",
  "lugar_nascimento": "Wood Eaton (4km north of Oxford), England",
  "lugar_morte": "London, England",
  "biografia": "John Collins\n's father was a minister who died when John was\n13\nyears of age and he had to earn a living from that time. His first job was as an apprentice bookseller in Oxford, a job which he did for around three years. In\n1641\nhe became a clerk at Court and in this position began to learn mathematics. He recounted his early life to a friend with whom he corresponded on mathematical topics\n(\nsee\n[\n6\n]\n)\n:-\nBeing a poor minister's son born within three miles of Oxford, and a while instructed in the Grammar school I went out betimes, my parents being dead, apprentice to a bookseller in Oxford, who failing I lived three years at Court and in that space forgot the Latin I had...\nHutton tells us in\n[\n5\n]\nthat because of Collins brilliance:-\n... for the study of the mechanical and mathematical sciences that he was taken under the tuition of Mr Marr, who drew several dials which were placed in different positions in the King's garden, under whom Collins made no small progress in the mathematics...\nIn\n1642\nthe Civil War had broken out and the King, together with the Court, had moved to Christ's College Oxford. It was the King's gardens in Oxford that are referred to above. Collins seems to have decided to leave England because of the Civil War and he became a seaman. For seven years he served, and during this time he continued to study mathematics while at sea. His own account of this is quoted in\n[\n6\n]\n:-\n.. the wars here breaking out, I went seven years to sea, most of it in the Venetian service against the Turk, wherein my hazard was almost as various as those of Dr Johnson set out in his sermon in print; and enjoying some leisure I recovered so much Latin that in\n1646\nI translated some books into English.\nIn\n1649\nhe became a mathematics teacher in London, a post he held until\n1660\n. From\n1660\nonwards Collins worked at a number of jobs but most often as an accountant for various different organisations. From\n1667\nhe worked as librarian for the\nRoyal Society\nin London, in addition to his other jobs. He was elected to the\nRoyal Society\non\n17\nOctober\n1667\nwhere\n[\n6\n]\n:-\n... he seems to have been a Barnabas among those mathematical apostles, his tact and devotion in calming the headstrong and drawing out the reticent being above all praise.\nCollins describes his jobs, other than the\nRoyal Society\npost, in his own words as follows\n[\n6\n]\n:-\n... I have been employed for a livelihood\n(\nbeing born to no estate nor any left me which, by reason of the wars, my relations either lost or spent\n)\nin clerkship and keeping of accounts, particularly those of the Allom farmers whose shipping of Allom to many parts beyond seas have furnished me with a correspondence abroad and a means of procuring books from most parts. I lately\n[\nuntil Christmas\n1670]\nwas employed at Brookhouse under the Commissioner of Accounts but at present\n[1672]\nI am one of the clerks attending in His Majesty's Council of trades and plantations.\nCollins also held a position as an accountant in the Excise Office from\n1668\nto\n1670\n. However times were not easy and Collins only received a small fraction of his proper salary from the Council of Plantations. He therefore resigned in September\n1672\nand was given a job in the Farthing Office. The Farthing Office was a part of the Mint and Charles II had introduced, in\n1672\n, the copper half-penny and farthing with the Britannia type.\nIn\n1671\nCollins had moved to a house in Westminster close to that of William Austin who was the King's chef. Austin's daughter Bellona Austin was the Queen's laundress. Collins married Bellona.\nCollins's importance is, as\nBarrow\nsaid, being \"the English\nMersenne\n\" . He corresponded with\nBarrow\n,\nDavid Gregory\n,\nJames Gregory\n,\nNewton\n,\nWallis\n,\nBorelli\n,\nHuygens\n,\nLeibniz\n,\nTschirnhaus\nand\nSluze\n.\nSome extracts from his letters to\nGregory\nare at\nTHIS LINK\nand some letters from\nGregory\nto Collins are at\nTHIS LINK\n.\nCollins published books by\nBarrow\nand\nWallis\nand left a collection of\n2000\nbooks and an uncounted number of manuscripts.\nHe did publish works of his own, however. For instance he published works on sundials, trigonometry for navigation and the use of the quadrant. He had a paper on cartography published and also wrote on accounting, compound interest and annuities. His major works were\nAn introduction to merchant's accounts\n(1652)\n,\nThe sector on a quadrant\n(1658)\n,\nGeometrical dialling\n(1659)\n,\nThe mariner's plain scale new plained\n(1659)\nand, in\n1664\n, he published\nDoctrine of Decimal Arithmetick\n.\nCollins's character and interests are described in\n[\n6\n]\n:-\nCollins was sociable and musical, and played the viol da gamba. Besides tracts, highly acceptable to the public - a plea for bringing over Irish cattle, and keeping out fish caught by foreigners; for the promotion of the English fishery; for the working of tin mines, and the like. He was frequently consulted in nice and critical cases of accounts...\nA canal was proposed to join the river Isis\n(\nthe name given to the upper part of the river Thames in Oxford\n)\nand the river Avon\n(\nwhich flows west\n)\n. This project had earlier been considered by\nHenry Briggs\n. Collins went to Oxford in\n1683\nto survey the proposed route of the canal. On this trip, however, he became ill\n[\n6\n]\n:-\n... contracted a disorder by drinking cider when he was too warm...\nand although he returned to London, he never recovered from the illness."
}