{
  "nome_completo": "Jonas Moore",
  "nome_curto": "Jonas Moore",
  "ano_nascimento": "1627",
  "ano_morte": "1679",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Moore_Jonas/",
  "lugar_nascimento": "Whitelee, Pendle Forest, Lancashire, England",
  "lugar_morte": "Godalming, England",
  "biografia": "Jonas Moore\nbecame clerk to the Chancellor of Durham. In\n1640\n, at the age of\n13\n, he took up the study of mathematics. Moore was greatly influenced by\nOughtred\nin his mathematical studies. In\n1647\nhe became mathematics tutor to the Duke of York, brother of the future King Charles II, but he did not hold this job for very long since he was removed from the post by political intrigue. Indeed this was a time of political turmoil in England with battles and religious argument. Only two years later Charles I was executed and his son proclaimed Charles II by the Scots in defiance of the English. Charles II was defeated by Cromwell in\n1650\nand by\n1651\nwas in exile in France.\nAfter loosing his post as tutor to the Duke of York\n(\nwhose father Charles I was still King at this time\n)\nMoore went to London where he hoped to make a living as a teacher of mathematics. However, he found it difficult to find sufficiently many pupils so Moore was happy to be appointed as a surveyor in\n1649\n. His task was to work on the draining of the Fens, a natural region of about\n40\n,\n100\nsq km of reclaimed marshland in eastern England between Lincoln and Cambridge. Around the same time as he took up this post as a surveyor, he published a mathematical textbook\nArithmetick\n(1650)\n.\nMoore made a reputation for himself in this job and soon was appointed to other surveying jobs. In\n[\n3\n]\nMoore's work at this time is described as follows:-\nHe gained reputation by his success in keeping the sea out of Norfolk, surveyed the coasts, and constructed a map of Cambridgeshire...\nThe Convention Parliament of\n1660\ndeclared the restoration of the king and lords. They disbanded the army and established an income for the king, Charles II, by keeping the parliamentary innovation of the excise tax. Charles II returned to London and Moore republished his\nArithmetick\ntogether with\nA New Contemplation General upon the\nEllipsis\nand\nConical Sections\ntaken from\nMydorge\n. The dedication of the republished work shows that Moore was working hard to find favour with the new regime.\nIn\n1663\nMoore was sent to Tangier to conduct a survey and to report on its fortifications. Here he was involved in the ambitious project to build a massive harbour wall. He received a knighthood in\n1669\nand was appointed to high office as Surveyor-General of the Ordnance.\nHowever Moore is not particularly famous for the mathematics which he did: as a mathematician he is best known as the first to use the notation\ncot\n. Rather Moore is famous for his strong support of mathematics and astronomy which made many other mathematical and astronomical advances possible. Perhaps his most important contribution was in his efforts to set up the Royal Observatory at Greenwich and his efforts to support\nFlamsteed\n. In\n1674\nhe invited\nFlamsteed\nto London, see\n[\n3\n]\n:-\n... with the design of installing him in a small observatory of his own in Chelsea College, but procured from the king instead the foundation of the Royal Observatory. He furnished him, moreover, at his private expense, with a seven foot sextant employed in Flamsteed's observations until\n1688\nas well as two clocks...\nThese clocks were used by\nFlamsteed\nin his work involving finding the longitude. A recent work by Willmoth\n[\n2\n]\ngoes futher than earlier authors in describing Moore's contribution to the founding of the Royal Observatory claiming, with much supporting evidence, that he was:-\n... the sole driving force behind the scheme.\nMoore, together with the famous diary writer Samuel Pepys, founded the Royal Mathematical School within Christ's Hospital. This School was set up with the specific aim of training boys in navigation techniques so that they could serve the King at sea. Moore became a governor of the school and together with Perkins, a master at the school, he wrote a major mathematical work intended for use at the Royal Mathematical School. Moore died however before the work could be published. The work,\nA New system of the Mathematicks\nappeared in\n1681\n. Moore wrote the sections on arithmetic, geometry, trigonometry and cosmography while the sections on algebra,\nEuclid\nand navigation were written by Perkins.\nAubrey describes Moore in\n[\n1\n]\nas:-\n... one of the most accomplished gentlemen of his time: a good mathematician, and a good fellow. ... he was tall and very fat, thin skin, fair, clear grey eyes ...\nMoore died in\n1679\nwhile on a journey from Portsmouth to London. He wrote several books, other than those described above, including\nModern Fortification\n(1673)\nand\nA Mathematical Compendium\n(1674)\n. His\nArithmetick\nwas published for a third time in\n1698\n, nearly\n20\nyears after his death."
}