{
  "nome_completo": "Joseph Liouville",
  "nome_curto": "Joseph Liouville",
  "ano_nascimento": "1809",
  "ano_morte": "1882",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Liouville/",
  "lugar_nascimento": "Saint-Omer, France",
  "lugar_morte": "Paris, France",
  "biografia": "Joseph Liouville\n's father was an army captain in Napoleon's army so Joseph had to spend the first few years of his life with his uncle. His father was certainly fortunate to survive the wars and after Napoleon was defeated he retired to live with his family. The family then settled in Toul where Joseph attended school. From Toul he went to the Collège St Louis in Paris where he studied mathematics at the highest levels. After reading articles in\nGergonne\n's Journal he proved some geometrical results which he wrote up as papers although they were never published.\nLiouville entered the École Polytechnique in\n1825\nand attended\nAmpère\n's\nCours d'analyse et de mécanique\nⓉ\n(\nCourse on analysis and mechanics\n)\nin session\n1825\n-\n26\n. He also attended courses by\nArago\nat the École Polytechnique as well as a second course by\nAmpère\nat the Collège de France. Although Liouville does not seem to have attended any of\nCauchy\n's courses, it is clear that\nCauchy\nmust have had a strong influence on him. Liouville graduated in\n1827\nwith\nde Prony\nand\nPoisson\namong his examiners.\nAfter graduating from the École Polytechnique Liouville entered the École des Ponts et Chaussées. However his health suffered when he had to undertake engineering projects and he spent some time at his home in Toul recovering. By now Liouville was set on an academic career and he found it impossible to study away from Paris. After a number of periods of leave, one of which allowed him to marry and have a few days honeymoon, it became clear to him that he must resign from the École des Ponts et Chaussées. This he did in October of\n1830\nbut even at this stage he had written a number of papers which he had submitted to the\nParis Academy\non electrodynamics,\npartial differential equations\nand the theory of heat.\nIn\n1831\nLiouville was appointed to his first academic post, as assistant to\nClaude Mathieu\nwho had been appointed to Ampère's chair at the École Polytechnique. He was also appointed to a number of private schools and to the École Centrale. It is remarkable that during this period of his life Liouville taught between\n35\nand\n40\nhours a week at the different institutions. Perhaps with a schedule this heavy it is not surprising that some courses would not go particularly well and it appears that he lectured at too high a level for some of the less able students.\nIn\n1836\nLiouville founded a mathematics journal\nJournal de Mathématiques Pures et Appliquées\n. This journal, sometimes known as\nJournal de Liouville\n, did much for mathematics in France throughout the\n19\nth\ncentury. Liouville had already gained an international reputation with papers published in\nCrelle\n's Journal but at the same time the quality of\nCrelle\n's Journal made him aware of deficiencies in the avenues for mathematical publications which there were in France. Certainly he was unhappy with the style of the Paris Journals for he wrote in\n1836\n:-\n.. a peculiar spirit of emigration has seized some critics and we have seen them heap abuse on one after the other of the men who in various fields of science have honoured France with great dignity. ... this sharp and peremptory style ... will never be mine, for it dishonours both the character and talent of those who adopt it.\nLiouville became favourite to fill the chair at the École Polytechnique which fell vacant when\nNavier\ndied in\n1836\n. However, after a close competition,\nDuhamel\nwas appointed. In\n1837\nLiouville was appointed to lecture at the Collège de France as a substitute for\nBiot\n. In\n1838\nLiouville was appointed Professor of Analysis and Mechanics at the École Polytechnique.\nThe following year he was elected to the astronomy section of the\nAcadémie des Sciences\nbut this was only after strong opposition from\nLibri\n. In fact the quarrel between Liouville and\nLibri\nintensified after his election to the\nAcadémie\n. In\n1840\n, after a vacancy resulting from the death of\nPoisson\n, Liouville was elected to the Bureau des Longitudes.\nIn many ways\n1840\nwas a turning point in Liouville's career. As Lützen writes in\n[\n4\n]\n:-\nBefore\n1840\n, Liouville had pursued some clear paths to secure his own career; during the following twenty years, the promotion and development of other mathematicians' ideas became the central issue.\nLife for Liouville developed into a year with two distinct parts. During the long summer period, spent at Toul, he undertook research, wrote papers and carried out editing duties. From November to July he lived in Paris and carried out his teaching and administrative duties.\nNot everything went Liouville's way however. When\nLacroix\ndied in\n1843\n, Liouville applied for his chair at the Collège de France where he lectured only as a substitute for\nBiot\n. However after a close election\nLibri\nwas appointed. Liouville immediately resigned from the Collège de France, writing in his resignation letter:-\nI am profoundly humiliated as a person and as a geometer by the events that took place yesterday at the Collège de France. From this moment it is impossible for me to lecture at this institution.\nAnother aspect of Liouville's life was his involvement in politics. One of his friends, and mathematical colleagues, was\nArago\nwho entered the Chamber of Deputies in\n1831\nand became leader of the Republican Party. Other mathematical colleagues had also become involved with the political events of the time, for example\nCatalan\n, whose political views were similar to the republican views of Liouville, had damaged his mathematical career. Liouville certainly never let his political views hold him back as he advanced his mathematical career, unlike\nCauchy\nwho had refused to swear the oaths of allegiance to the King that Liouville and even\nArago\nhad been prepared to do.\nEncouraged by\nArago\n, Liouville stood for election to the Constituting Assembly in\n1848\n. In his recommendation of Liouville as a candidate\nArago\nwrote:-\n... Mr Liouville is one of my best friends. He is a very eminent man, a patriot, an experienced republican. God grant that the National Assembly will contain many members of this calibre.\nElected on\n23\nApril\n1848\n, Liouville took his seat among the moderate republican majority. However there was unrest in Paris as workers felt that their revolution had been taken over by the bourgeoisie. When\nArago\ntried to address the crowds a heckler shouted the telling comment:-\nMr\nArago\n, you have never been hungry.\nLiouville continued his political career by being renominated for the Assembly elections in\n1849\nbut the tide had turned against the moderate republicans and he was not elected.\nThe election defeat proved another turning point in Liouville's life. As Lützen writes in\n[\n4\n]\n:-\nThe political defeat changed Liouville's personality. In earlier letters, he was often depressed because of illness, and could vent his anger towards his enemies such as\nLibri\n, but he always fought for what he believed was right. After the election in\n1849\n, he resigned and became bitter, even towards his old friends. When he sat down at his desk, he did not only work, ... he also pondered his ill fate. ... his mathematical notes were interrupted with quotes from poets and philosophers...\nLibri\nescaped from France during the\n1848\nrevolution, not for political reasons, but to avoid a prison sentence for stealing precious books and manuscripts. His chair at the Collège de France was declared vacant in\n1850\nand\nCauchy\nand Liouville competed for the post. In a close contest Liouville triumphed and began his lectures at the Collège de France in\n1851\n.\nAlthough Liouville's mathematical output had been greatly reduced while he was involved with politics, it picked up again in the\n1850\ns despite health problems. In fact\n1856\nand\n1857\nwere two of Liouville's most productive years. However after being appointed to the chair of mechanics at the Faculté des Sciences in\n1857\nhis teaching load began to take its toll on him. Not only did he have a high teaching load but Liouville was a perfectionist which meant that when he felt that he could not devote all the time necessary to give the best possible lectures he began to suffer. He continued to publish but mostly results he had discovered during his highly productive year of\n1856\nand these without the proofs which now he could not find time to polish.\nAnother blow to Liouville was the death of\nDirichlet\nin\n1859\n. This was a serious blow to him mathematically for, as well as losing a close friend, he lost his main mathematical correspondent.\nLiouville's mathematical work was extremely wide ranging, from mathematical physics to astronomy to pure mathematics. One of the first topics he studied, which developed from his early work on electromagnetism, was a new topic, now called the fractional calculus. He defined differential operators of arbitrary order\nD\nt\nD^{t}\nD\nt\n. Usually\nt\nt\nt\nis an integer but in this theory developed by Liouville in papers between\n1832\nand\n1837\n,\nt\nt\nt\ncould be a\nrational\n, an\nirrational\nor most generally of all a complex number.\nLiouville investigated criteria for integrals of algebraic functions to be algebraic during the period\n1832\n-\n33\n. Having established this in four papers, Liouville went on to investigate the general problem of integration of algebraic functions in finite terms. His work at first was independent of that of\nAbel\n, but later he learnt of\nAbel\n's work and included several ideas into his own work.\nAnother important area which Liouville is remembered for today is that of\ntranscendental\nnumbers. Liouville's interest in this stemmed from reading a correspondence between\nGoldbach\nand\nDaniel Bernoulli\n. Liouville certainly aimed to prove that\ne\ne\ne\nis transcendental but he did not succeed. However his contributions were great and led him to prove the existence of a transcendental number in\n1844\nwhen he constructed an infinite class of such numbers using\ncontinued fractions\n. In\n1851\nhe published results on transcendental numbers removing the dependence on continued fractions. In particular he gave an example of a transcendental number, the number now named the Liouvillian number\n0\n.\n1100010000000000000000010000\n...\nwhere there is a\n1\nin place\nn\n!\nn!\nn\n!\nand\n0\nelsewhere.\nHis work on\nboundary value problems\non\ndifferential equations\nis remembered because of what is called today\nSturm\n-Liouville theory which is used in solving\nintegral equations\n. This theory, which has major importance in mathematical physics, was developed between\n1829\nand\n1837\n.\nSturm\nand Liouville examined general linear second order differential equations and examined properties of their\neigenvalues\n, the behaviour of the eigenfunctions and the series expansion of arbitrary functions in terms of these eigenfunctions.\nLiouville contributed to\ndifferential geometry\nstudying\nconformal transformations\n. He proved a major theorem concerning the measure preserving property of Hamiltonian dynamics. The result is of fundamental importance in\nstatistical mechanics\nand\nmeasure theory\n.\nIn\n1842\nLiouville began to read\nGalois\n's unpublished papers. In September of\n1843\nhe announced to the\nParis Academy\nthat he had found deep results in\nGalois\n's work and promised to publish\nGalois\n's papers together with his own commentary. Liouville was therefore a major influence in bringing\nGalois\n's work to general notice when he published this work in\n1846\nin his Journal. However he had waited three years before publishing the papers and, rather strangely, he never published his commentary although he certainly wrote a commentary which filled in the gaps in\nGalois\n's proofs. Liouville also lectured on\nGalois\n's work and\nSerret\n, possibly together with\nBertrand\nand\nHermite\n, attended the course.\nIn\nnumber theory\nLiouville wrote around\n200\npapers, working on\nquadratic reciprocity\nand many other topics. He wrote over\n400\npapers in total."
}