{
  "nome_completo": "Joseph Leo Doob",
  "nome_curto": "Joseph Doob",
  "ano_nascimento": "1910",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Doob/",
  "lugar_nascimento": "Cincinnati, Ohio, USA",
  "lugar_morte": "Clark-Lindsey Village, Urbana, Illinois, USA",
  "biografia": "Joseph Doob\n's parents were Mollie Doerfler and Leo Doob. Joseph's interest in science started when he was at grammar school. There he became interested in radio and constructed his own crystal radio set. When he was at high school his interest in radio increased. He learnt Morse code, obtained a licence to transmit radio signals, and started to use a radio transmitter which he had built himself. At this stage in his education, given his hobby, he felt that physics was the right subject for him to study at university, and having sought advice from the principal of his high school, he applied to study at Harvard. When he entered Harvard in September\n1926\nhe registered for courses in physics but, by the end of his first year of study, Doob had decided that he did not want to proceed to a physics degree. His favourite course during his first year had been calculus and its applications so, since he had always enjoyed mathematics, there was an obvious direction in which to take his studies.\nIn his second year of study Doob registered for courses in mathematics. He was taught calculus by\nOsgood\nand this led to his taking the third year calculus course at the same time. He said in an interview\n[\n3\n]\n:-\n[\nOsgood\n]\ntaught my sophomore calculus course, using his own textbook. I did not suspect that he was an internationally famous mathematician and of course I had no idea of mathematical research, publication in research journals, or what it took to be a university professor.\nOsgood\nwas a large, bearded portly gentleman who took life and mathematics very seriously and walked up and down in front of the blackboard making ponderous statements. After a few weeks of his class I appealed to my adviser\nMarshall Stone\nto get me into a calculus section with a more lively teacher. Of course\nStone\ndid not waste sympathy on a student who complained that a teacher got on his nerves, and he advised me that if I found sophomore calculus too slow I should take junior calculus at the same time! ... Through the fortunate accident of having a tedious instructor I had gained a year! The analytic function course, taken in my junior year with\nOsgood\nas teacher, was my first course in rigorous analysis and I took to it right away in spite of his mannerisms.\nDoob was awarded a AB by Harvard in\n1930\nand asked his advisor\nMarshall Stone\nif he would supervise his doctorate.\nStone\nsuggested that he would be better with J L Walsh as his supervisor. Doob wrote:-\nWalsh accepted me and we had a fine relationship: he never bothered me, and conversely. Harvard suited my character in that there was so little supervision that I could neglect classes for a considerable time while cultivating a side interest, sometimes mathematical sometimes not.\nHe obtained a Master's Degree in\n1931\n, the same year he married Elsie Haviland Field\n(\non\n26\nJune\n1931)\n. Joe and Elsie had three children; Stephen, Peter and Deborah. He continued research and was awarded his doctorate in\n1932\nfor a thesis entitled\nBoundary Values of Analytic Functions\n. The ideas which led him to study the relation between analytic functions and their limit values at the boundaries of their domains came through questions that he was asked by Wladimir Seidel who was a postdoctoral assistant at Harvard at the time. However, the level of undergraduate mathematics at Harvard at this time was not particularly high, so with only two years of highly specialised research after his undergraduate degree, Doob had not obtained a broad mathematical education:-\nGetting a Ph.D. in two years left me woefully ignorant of almost everything in mathematics not connected with my thesis work. I had missed fertile contact with\nBirkhoff\n,\nKellogg\n, and\nMorse\n, all three at Harvard and leaders in their fields.\nAfter completing his doctorate, Doob was supported by\nBirkhoff\nin an application for a two year National Research Council Fellowship. Since in\n1932\nElsie, Doob's wife, was a medical student in New York, he had applied to work at Columbia University with J F Ritt. However, these were difficult times and Doob could not look forward to the future with any confidence. The Great Depression had begun in\n1929\nand by\n1932\n, the year Doob went to New York, one quarter of the workers in the United States were unemployed. Despite his efforts to look for academic positions he could see little chance of success. He was advised to speak to\nHarold Hotelling\n, the professor of statistics at Columbia University, since statistics was one subject that was expanding despite the Depression.\nHotelling\nmanaged to obtain a Carnegie fellowship to enable Doob to remain at Columbia University and work with him on probability during the year\n1934\n-\n35\n.\nHe was appointed as Associate Professor at the University of Illinois in\n1935\n. He said:-\nI was charmed by the small town atmosphere of Urbana as soon as I arrived and never wanted to leave, even though the atmosphere changed through the years.\nHis first student was\nPaul Halmos\nwho completed his doctorate with the thesis\nInvariants of certain stochastic transformation: The mathematical theory of gambling systems\nin\n1938\n. At the same time Doob was supervising Warren Ambrose whose thesis\nSome properties of measurable stochastic processes\nwas submitted a year later. Doob's next outstanding doctoral student was\nDavid Blackwell\nwho entered the University of Illinois in the year Doob was appointed there and completed his doctorate on\nProperties of Markov chains\nin\n1941\n. Doob became a full professor at the University of Illinois in\n1945\n. However before this he had a period away from Urbana undertaking war work during World War II. In\n1942\nVeblen\napproached him to work in Washington for the navy on mine warfare. He worked there until\n1945\nwhen he returned to the University of Illinois.\nDoob's work was in\nprobability\nand\nmeasure theory\n, in particular he studied the relations between probability and\npotential theory\n. The paper\n[\n1\n]\nlooks at many of the areas of probability to which Doob made major contributions such as separability, stochastic processes,\nmartingales\n, optimal stopping, potential theory, and classical potential theory and its probabilistic counterpart. Doob built on work by\nPaul Lévy\nand, during the\n1940\n's and\n1950\n's, he developed basic martingale theory and many of its applications. Doob's work has become one of the most powerful tools available to study stochastic processes. In\n1953\nhe published a book which gives a comprehensive treatment of stochastic processes, including much of his own development of martingale theory. This book\nStochastic Processes\nhas become a classic and was reissued in\n1990\n. In fact he undertook the work of writing the book because he had become intellectually bored while undertaking war work in Washington and so was enthusiastic when, in\n1945\n,\nShewhart\ninvited him to publish a volume in the Wiley series in statistics. In the introduction to\nStochastic Processes\nDoob states that:-\n...\n[\na stochastic process is\n]\nany process running along in time and controlled by probabilistic laws ...\n[\nmore precisely\n]\nany family of random variables\n{\nx\nt\n∣\nt\n∈\nT\n}\n\\{x_{t}| t  \\in  T\\}\n{\nx\nt\n​\n∣\nt\n∈\nT\n}\n[\nwhere\n]\na random variable is ... simply a measurable function.\nThe spirit of the book is clear by his statement:-\n... probability theory is simply a branch of measure theory, with its own special emphasis and field of application ...\nDavid Kendall\nreviewing\nStochastic Processes\nwrites:-\nVery few readers will work steadily through the whole of this difficult book, but it cannot fail to exercise a decisive influence on the development of its subject.\nAnother classic text by Doob is\nClassical potential theory and its probabilistic counterpart\nfirst published in\n1984\nand reprinted in\n2001\n. His interest in potential theory went back to\n1955\nwhen he was invited to speak at the Berkeley Symposium on Probability and Statistics. He decided to speak on Axiomatic Potential Theory and from then on he undertook research on the subject. He corresponded with Brelot, a leading expert on the topic, and many years later Brelot said that he wanted to write a text on modern potential theory. He asked Doob to cooperate with him in writing the sections on probability theory but in the end Doob wrote the whole book. Sharpe, reviewing the book writes:-\nThis is the long-awaited book by the author, developing in parallel potential theory and part of the theory of stochastic processes. It is divided into two quite distinct parts, each occupying about half the volume. The first half concerns the potential theory of the\nLaplace\noperator\n(\ni.e. classical potential theory\n)\nand of the heat operator and its adjoint\n(\ni.e. parabolic potential theory\n)\n, while the second half treats the probabilistic counterparts\n(\ninterpreted liberally\n)\nto the objects in the first half. ...\nGraduate students and researchers in probability or classical analysis will find much to learn from this fine book by a master of both areas.\nDoob is also the author of a well known book on measure theory published in\n1994\nwhen he was\n84\nyears old. It presents:-\n... what measure theory every would-be analyst should learn.\nChatterji, reviewing the text writes:-\n... this text, written by one of the most illustrious probabilists alive, is an interesting addition to the textbook literature in measure theory; every serious mathematical library should acquire it and teachers of measure theory - especially those who are analysts by profession - should not fail to consult it for their future courses.\nAs we indicated above, Doob was a member of the faculty of the University of Illinois from the time of his appointment in\n1935\n. He retired in\n1978\nbut remained extremely active continuing to write books and research papers. One fact which we should mention is that he was Commissar of the Champaign-Urbana Saturday Hike for about\n25\nyears. The tradition of the Saturday Hike started in\n1909\nand Doob joined the hikers in\n1939\nand went regularly every Saturday.\nDoob was elected a member of the\nNational Academy of Sciences\nand was also elected to French\nAcademy of Sciences\n. He was honoured with election as President of the Institute of Mathematical Statistics\n(1950)\nand President of the\nAmerican Mathematical Society\n(1963\n-\n1964)\n. He was awarded an honorary D.Sc. from the University of Illinois in\n1981\n. He received several other prestigious awards for his outstanding achievements, in particular the National Medal of Science in\n1979\nand the Steele Prize of the\nAmerican Mathematical Society\nin\n1984\n. The Steele Prize was awarded at the summer meeting of the Society in Eugene for\n[\n4\n]\n:-\n... his fundamental work in establishing probability as a branch of mathematics and for his continuing profound influence on its development."
}