{
  "nome_completo": "Joseph Winlock",
  "nome_curto": "Joseph Winlock",
  "ano_nascimento": "1826",
  "ano_morte": "1875",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Winlock/",
  "lugar_nascimento": "Shelby County, Kentucky, USA",
  "lugar_morte": "Cambridge, Massachusetts, USA",
  "biografia": "Joseph Winlock\nwas the eldest son of Fielding Winlock\n(1789\n-\n1874)\nand Nancy Peyton\n(1792\n-\n1850)\n. Fielding Winlock was the son of General Joseph Winlock who fought in the American Revolution at age eighteen, and then became a surveyor. Fielding, who was born in Kentucky, studied law and then fought alongside his father in the War of\n1812\n. On a later census he gives his occupation as Police Judge. He married Nancy Peyton in Bullitt County, Kentucky, on\n8\nSeptember\n1816\n. Nancy Peyton was the daughter of the surveyor William Peyton and his wife Mary Ross. Fielding and Nancy Winlock had four children, all born in Shelby County, Kentucky: Elizabeth Winlock\n(1825\n-\n1871)\n; Joseph Winlock\n(1826\n-\n1875\n, the subject of this biography\n)\n; William Fielding Winlock\n(1828\n-\n1897)\n; and Effie Winlock\n(1833\n-\n1909)\n.\nWinlock was educated at Shelby College in Shelbyville, Kentucky. This college had been founded as Shelbyville Academy in\n1798\nwith Joseph Winlock, the paternal grandfather of the subject of this biography, on the board of trustees. It was run as a private school for upper class young men. The Academy moved to College Street in Shelbyville in\n1836\nand was renamed Shelby College. By\n1840\nthe College had\n65\nstudents and two professors. The Episcopal Church took over in\n1841\nbut the school continued to only have a small number of students. Winlock excelled in mathematics while at Shelby College and graduated in\n1845\n.\nAn effort was made to revitalise Shelby College and the Reverend William J Waller was brought in to modernise the school. He proposed a major building programme with laboratories, an astronomical observatory and the purchase of a large German telescope. Although Winlock had only just graduated, he was appointed as Professor of Mathematics and Astronomy. In order to learn about the latest advances in astronomy, he spent his savings on purchasing volumes of\nAstronomische Nachrichten\n. This journal had been founded in\n1821\nand had begun publication in\n1823\nso there was over twenty years of material for Winlock to study. There was a problem, however, since the papers were written in German. In order to learn to read German, Winlock would rise early in the morning and talk German with one of the father's labours who was employed on the family farm. He quickly became an expert in the latest developments\n[\n14\n]\n:-\nProfessor Winlock was an excellent mathematician and astronomer, and had a remarkably retentive memory, not only for facts relating to his branch of science, but for the sources of information concerning those facts.\nWhile teaching at Shelby College, Winlock became familiar with the construction and use of a telescope. The College had purchased an excellent\n7\n1\n2\n7\\large\\frac{1}{2}\\normalsize\n7\n2\n1\nâ\ninch Merz refracting telescope made by the German firm of Georg Merz and Sons\n(1793\n-\n1867)\nand Winlock was involved in its installation and subsequent use\n[\n16\n]\n:-\nThis telescope was ordered in\n1848\nfrom the establishment of Merz & Mahler, of Munich, for the use of Shelby College, Shelbyville, Kentucky. It was received at Shelbyville in November,\n1850\n, and cost, when mounted, $\n4\n,\n000\n. It was mounted under the direction of Prof Joseph Winlock, and used by him while he was a professor in that institution.\nIn May\n1851\nthe American Association for the Advancement of Science met in Cincinnati. Also at that meeting was the leading American mathematician of that day, namely\nBenjamin Peirce\n.\nBenjamin Peirce\nhad published a number of textbooks:\nAn Elementary Treatise on Plane Trigonometry\n(1835)\n,Â\nFirst Part of an Elementary Treatise on Spherical Trigonometry\nÂ\n(1836)\n,Â\nAn Elementary Treatise on Sound\nÂ\n(1836)\n,Â\nAn Elementary Treatise on Algebra : To which are added Exponential Equations and Logarithms\nÂ\n(1837)\n,Â\nAn Elementary Treatise on Plane and Solid Geometry\nÂ\n(1837)\n,Â\nAn Elementary Treatise on Plane and Spherical Trigonometry\nÂ\n(1840)\n, andÂ\nAn Elementary Treatise on Curves, Functions, and ForcesÂ\nVolÂ\n1\nÂ\n(1841)\n, VolÂ\n2\nÂ\n(1846)\n.Â Although these all claimed to be \"elementary\" in fact they were found too hard for most students at that time. When he discovered that Winlock had read these texts and found them easy and enjoyable,\nBenjamin Peirce\nrealised that Winlock was a bright young mathematician and asked him if he would like to go to Cambridge, Massachusetts, to work at the newly founded American Nautical Almanac Office.\nThe United States wanted to produce their own Nautical Almanac rather than use the British\nNautical Almanac and Astronomical Ephemeris\nwhich had been published since\n1767\n. The American Nautical Almanac was approved in March\n1849\nand Charles Henry Davis was appointed as the first Superintendent. Let us note that both Charles Henry Davis and\nBenjamin Peirce\nwere married to daughters of U.S. Senator Elijah Hunt Mills. The Nautical Almanac Office was established in Cambridge, Massachusetts and Davis began to recruit staff. One of the first computers he recruited was\nBenjamin Peirce\nand, with his recommendation, Winlock was appointed. He resigned from his position at Shelby College and in\n1852\nhe began working as a computer at the American Nautical Almanac Office in Cambridge, Massachusetts. Davis produced a Division of Work for\n1852\nwhich gives\n[\n3\n]\n:-\nProfessor Peirce - The general theory; planets generally; Mars particularly.\nMr J B Bradford, assistant.\nProfessor Winlock - Sun and Mercury, Astraea, Egina.\nWe note that Astraea and Egina are minor planets.\nA list of annual salaries for the year gives Winlock as one of three computers with a salary of $\n1\n,\n200\n(\nworth about $\n47\n,\n000\nin\n2023)\nwith only one computer more highly paid being\nBenjamin Peirce\nwith a salary of $\n1\n,\n500\n(\nworth about $\n59\n,\n000\nin\n2023)\n. Now recognised as a leading American mathematician, Winlock was elected a Fellow of the\nAmerican Academy of Arts and Sciences\n, in the Section of Mathematics, on\n28\nSeptember\n1853\n.\nOn\n9\nDecember\n1856\n, Winlock married Mary Isabella Lane\n(1832\n-\n1912)\nin Shelby County, Kentucky. Isabella Lane was born on\n6\nMay\n1832\nat Palmyra, Marion, Missouri, USA, to parents George Washington Lane Sr\n(1790\n-\n1841)\nand Frances Tolson Adams\n(1792\n-\n1844)\n. Joseph and Isabella Winlock had six children:\nAnna Winlock\n(1857\n-\n1904)\n; William Crawford Winlock\n(1859\n-\n1896)\n; Louisa Winlock\n(1860\n-\n1916)\n; George Lane Winlock Sr\n(1862\n-\n1948)\n; Isabella L Winlock\n(1865\n-\n1926)\n; and Mary Peyton Winlock\n(1867\n-\n1942)\n. Let us give a few details of these children before continuing with Winlock's biography.\nAnna Winlock\nbecame a computer at the Harvard College Observatory and has a biography in this archive. William Crawford Winlock made observations of the force of gravity for the United States Coast Survey, then graduated from Harvard University in\n1880\n. He was then employed at the United States Naval Observatory in Washington. He spent the years from\n1889\nworking for the Smithsonian Institute. Louisa Winlock worked at Harvard College Observatory for\n29\nyears from\n1886\nto\n1915\n, She assisted her sister\nAnna Winlock\nand\nMina Fleming\nwith numerical computations. Mary Peyton Winlock was educated at the School of the Museum of Fine Arts, Boston in the\n1890\ns. She became a master silversmith specialising in creating jewellery and serving pieces embellished with exquisite enamel work.\nTwo weeks before his marriage, Winlock was appointed Superintendent of the American Nautical Almanac. This appointment, however, was not straightforward\n[\n2\n]\n:-\nWith\nBenjamin Peirce\n's support, Winlock got the directorship in spite of the claim of Truman Henry Safford, the one-time child prodigy who later distinguished himself at Chicago until the great fire and then at Williams College.\nWinlock served in the role of Superintendent from\n23\nNovember\n1856\nto\n10\nAugust\n1859\nand from\n18\nSeptember\n1861\nto\n1\nMay\n1866\n. In fact in\n1857\nhe had been appointed as Professor of Mathematics in the United States Navy and was an assistant at the Naval Observatory in Washington for several months. In\n1859\nhe resigned as Superintendent of the American Nautical Almanac when he became head of the Mathematics Department at the Naval Academy at Annapolis, Maryland. The Academy moved to Newport, Rhode Island when the Civil War broke out in\n1861\nand at this point Winlock resigned and returned to the American Nautical Almanac Office in Cambridge, Massachusetts where again he became Superintendent. While serving as Superintendent for the second time, Winlock became one of the fifty charter members of the\nNational Academy of Sciences\nwhen it was founded on\n3\nMarch\n1863\n.\nThe Merz telescope which Winlock had helped install and operate at Shelby College\n[\n10\n]\n:-\n... was afterwards borrowed by Mr Winlock, and mounted at Cambridge, for a time, for his private use. With this exception, his scientific labours had been exclusively in the way of higher mathematics, either as teacher or computer.\nMore details of Winlock's use of this telescope is given in\n[\n16\n]\n:-\nThe great telescope belonging to Shelby College was loaned to Prof Joseph Winlock, and was removed to Cambridge, Massachusetts, where temporary accommodations were provided for it, and this establishment is known by the name of Cloverdon Observatory ... Numerous observations on comets, and on some of the newly discovered planets, have been made with this telescope by Dr B A Gould and Prof Joseph Winlock, some of which have been published in \"Gould's Astronomical Journal.\"\nFor the\nAmerican Ephemeris\n, Winlock constructed new tables based on\nLe Verrier\n's formulas.\nIn\n1866\nWinlock resigned from the American Nautical Almanac when he was appointed as Phillips Professor of Astronomy at Harvard College and Director of the Harvard College Observatory. This Observatory had been established in\n1839\nwith William Cranch Bond\n(1789\n-\n1859)\nas its first Director. His son George Phillips Bond\n(1825\n-\n1865)\nwas the second Director, who was awarded the\nRoyal Astronomical Society\n's Gold Medal in\n1865\n, but the medal did not arrive until several days after his death. Winlock was appointed in\n1866\nfollowing George Bond's early death\n[\n10\n]\n:-\nMr Winlock was not long in inspiring the friends of the Observatory with that large measure of confidence in his capabilities and his sound judgement which prompted them to contribute over $\n12\n,\n000\n[\n$\n222\n,\n000\nby\n2023\nvalues\n]\nfor the purchase of a new meridian circle. In the autumn of\n1867\n, Mr Winlock went to Europe, and spent four months in visiting the principal observatories, and acquainting himself with the latest improvements in instruments, and especially in circles. Having studies the advantages and defects in the highest class of meridian instruments, he blindly copied no one of them; but suggested valuable modifications, with the view of securing greater stability, increased precision of movement, and the most complete facility of observation.\nIn\n1867\nBenjamin Peirce\nstopped working for the American Nautical Almanac when he was appointed Superintendent of the United States Coast Survey. In this capacity he asked Winlock to lead a party to Kentucky to observe the total eclipse of\n7\nAugust\n1869\n. The obvious place to go was to Shelby College in Shelbyville, where Winlock had studied and taught. The following report appears in\nHarper's Weekly\non\n28\nAugust\n1869\n[\n20\n]\n:-\nThe observations of the solar eclipse here today were very satisfactory, and in many respects gratifying. The following persons comprised the Joint Board of Observation for Shelbyville: Professor Joseph Winlock, of Harvard University, in charge of observations of phenomena, assisted by Alvan G Clark, Professor of Cambridge; Assistant George W Dean of the Coast Survey, in charge of observations of precision, assisted by T Blake, Jr, of the Coast Survey; J A Whipple, of Boston, assisted by George Clark and J Pendergast, had charge of the photographs; Professor G M Searle, of New York, devoted himself to observations of general phenomena, and during the total phase was to search for inter-mercurial planets. Also present were T H Agnew, R E Sharrod of Louisville, Professor Seymour of Louisville, and Robert Lewis of Shelbyville. Among the amateurs present was Mr Bowditch, of Boston, son of the celebrated astronomer.\nThe sky was perfectly clear, and every thing seemed to propitiate the success of the observations. There were ten or twelve mounted instruments in use on the occasion, the principal one of which was the Shelbyville College telescope, which was handled by Professor Winlock. This is a fine instrument, costing $\n4000\n. It once ranked third in the United States.\nWhen the sunlight commenced to become dim a large number of citizens rushed to the college grounds, the headquarters of the observers. Some minutes before the total phase the usual phenomena of distraction among birds of the air and cattle occurred. Six minutes before totality a deathly ashen hue overspread the countenances of all present, and for a while the faint-hearted were terrified. The scene during the totality was an awful one, and when the sunlight appeared again a shout of exultation went up from the great crowd in the college grounds.\nObtaining high quality instruments for the Observatory was not easy at this time\n[\n22\n]\n:-\nAlthough Alvan Clark in Cambridgeport ground beautiful lenses, precision instruments still had to be ordered from abroad. In January\n1869\n, the London Instrument maker William Simms wrote to Joseph Winlock at Harvard that his new meridian circle was \"completed\"; the following June he reported it \"nearly finished\"; the instrument arrived in Cambridge in the summer of\n1870\n. Winlock's great spectroscope ordered from John Browning in London never arrived.\nWinlock reported regularly to meetings of the\nAmerican Academy of Arts and Sciences\nand details were published in the\nProceedings\nof the\nAcademy\n. We give below three reports delivered to the\nAcademy\nbetween\n1871\nand\n1873\n. The first is from the meeting on\n11\nOctober\n1870\n[\n17\n]\n:-\nProfessor Joseph Winlock exhibited a contrivance for recording the position of lines in the spectrum, especially adapted to solar eclipses. A silver plate is attached to the telescope of a spectroscope, and a graver to its stand. By a simple motion the position of any line may be permanently recorded and afterwards measured. The principal lines of the solar spectrum are first recorded, the plate is then moved slightly backwards, and a number of spectra may be drawn on the same plate and compared with one another. Since the spider-lines may be invisible on account of the darkness, a break is made in the one which is vertical, and a spark from a Ruhmkorff coil passed through it, thus giving a bright spot of light. He proposed to apply this method of recording to determine the declination of a star in meridian instruments.\nIn the second report of the meeting of the\nAmerican Academy of Arts and Sciences\non\n11\nApril\n1871\n, Winlock speaks about two solar eclipses he has observed, the first in\n1869\nin Kentucky and the second in Spain on\n22\nDecember\n1870\n[\n18\n]\n:-\nProfessor Joseph Winlock exhibited some pictures of the eclipse of\n1870\n, and pointed out the resemblance between the photographs of\n1869\nand of\n1870\n. He also stated that in his recording spectroscope it is not essential that the registering point should be attached to the telescope, but to the part which is moved for pointing on the lines of the spectrum. In Professor Young's spectroscope, in which the prisms move, the registering apparatus is attached to them.\nThe third report from the meeting of\n11\nMarch\n1873\nconcerns studies of nebulae and sunspots\n[\n19\n]\n:-\nProfessor Joseph Winlock exhibited a method of representing the nebulae, being a reproduction of the original drawings by the heliotype process. He also made a communication on the sunspot observations taken at the Kew Observatory during the year\n1872\nby Warren de la Rue, with the corresponding observations at Cambridge, Massachusetts.\nIn\n1872\na time service was started at the Harvard College Observatory using a system designed by Winlock. When Edward Charles Pickering wrote the article\n[\n13\n]\nin\n1892\nthis system had been in operation for twenty years. Pickering wrote\n[\n13\n]\n:-\nThe time-service of this observatory has been maintained for nearly twenty years upon the system originated by the late Professor Joseph Winlock. Continuous signals, that is, signals throughout the entire twenty-four hours instead of for a short time each day have been furnished to the cities of Boston and Cambridge, and have been used to strike the bells of the fire-alarm daily at noon. For many years a time-ball has been dropped, thus furnishing a precise time-signal to many citizens and to the shipping in the harbour. The continuous signals have been sent also to the railroads centring in Boston, and to the Boston office of the Western Union Telegraph Company, and have been distributed by them over a large part of New England. Many cities and corporations, although not subscribing for the time-signals, have been in the habit of taking them from the railway and telegraph stations, thus extending their use. The time-service in New York City was thus supplied with our signals for many years. The signals, again, have been furnished to the principal jewellers in Boston and vicinity, and used by them in the rating of fine watches. The lines transmitting the time-signals in these various directions affected the telephone lines by induction and otherwise, and thus many other persons obtained the signals by merely listening at the telephone.\nThe\nScientific American\narticle\n[\n14\n]\npublished shortly after Winlock's death, lists what the author considers are his greatest achievements:-\n(1)\nThe mounting of large meridian circles in such a manner as to allow the piers to be shortened, so that the graduated circles are wholly above the piers, and the steadiness of the whole instrument is increased. The theoretical advantage of this arrangement cannot here be discussed; it has been tested by five years' experience at Harvard College Observatory with very gratifying results; it has been adopted in other observatories, and will probably come into general use.\n(2)\nThe application of a diagonal eyepiece, moved by a rack and pinion, to any large telescope, in such a manner as to dispense with the customary finder, and to enable the principal object glass to be used in finding faint objects which are to be examined with the spectroscope or otherwise. This invention has also been for some years in use in Harvard College Observatory.\n(3)\nA method of registering spectroscopic observations by marking lines upon a silver plate without requiring the removal of the eye from the spectroscope, or the use of artificial light. Professor Winlock registered in this manner his observations of the solar eclipse of December,\n1870\n, which he observed in Spain.\n(4)\nThe use of a lens of long focus and of a plane mirror in making photographs of the sun. Apparatus of this kind was brought into daily use in July,\n1870\n, at Harvard College Observatory. Priority in this invention is claimed by some other astronomers; but it does not appear that any one actually used the combination of the mirror with the lens of long focus until some years after Professor Winlock. It should also be noticed that in\n1869\nProfessor Winlock first photographed the solar corona without enlarging the image by an eyepiece.\nWinlock died suddenly at the age of forty-nine. The\nHarvard Crimson\nof\n18\nJune\n1875\ncontains an obituary which begins as follows\n[\n12\n]\n:-\nIt becomes our painful duty, this week, to chronicle the death of Professor Joseph Winlock, Director of the Observatory. In him we feel that we have lost, not only the eminent scientific investigator, but the revered and loved instructor. Ever ready to appreciate merit and aid the deserving, it is not too much to say that he won the personal affection of every one who knew him. He had complained of indisposition for several days; but nothing serious was apprehended until Thursday night, when his malady suddenly increased, causing his death at an early hour on Friday morning.\nThe crater Winlock on the far side of the moon is named for Joseph Winlock."
}