{
  "nome_completo": "Josip Plemelj",
  "nome_curto": "Josip Plemelj",
  "ano_nascimento": "1873",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Plemelj/",
  "lugar_nascimento": "Grad on Bled, Austrian Empire (now Slovenia)",
  "lugar_morte": "Ljubljana, Yugoslavia (now Slovenia)",
  "biografia": "Josip Plemelj\nwas born in Grad on Bled, a village on the shores of Lake Bled. This glacial lake, in the extreme north-west of Slovenia, is situated northwest of Ljubljana and is\n475\nmetres above sea level at the foot of the Julian Alps. Josip's father was Urban Plemelj, a carpenter in the village who farmed a small piece of land, while his mother was Marija Mrak. Urban died was Josip was only one year old and it was left to Marija to bring up her family in very difficult circumstances.\nSlovenia was under Austrian Habsburg rule when Plemelj was born, as it had been for most of the preceding\n500\nyears. However it was around this time that the Slovenes, Serbs, and Croats began to seek independence from Austria and various ideas of political union of these groups began to be discussed. It was a political atmosphere which would later have a great influence on Plemelj's career but, given the poor financial circumstances of his family, he was lucky to receive an education which would allow him to display his talents. At primary school he soon showed his mathematical abilities which were quickly recognised. His mother was able to send him to Ljubljana where he attended high school from\n1886\nto\n1894\n.\nAfter four years at high school Plemelj had covered the whole school mathematics syllabus. He then showed his inclination to teach by tutoring the other pupils at the school for their final examinations although he was much younger than the pupils he helped. From his fifth year he began to study more advanced mathematics. He was soon making his own mathematical discoveries, for example he discovered for himself the series expansion for\nsin\n⁡\nx\n\\sin x\nsin\nx\nand for\ncos\n⁡\nx\n\\cos x\ncos\nx\n. The way he did this was to first find the series expansion for\narcsin\n⁡\nx\n\\arcsin x\narcsin\nx\nand then invert the series to obtain that for\ncos\n⁡\nx\n\\cos x\ncos\nx\n. He also developed a love for solving geometrical problems while at high school and some of the research topics he later worked on, such as his construction of a regular seven sided polygon, clearly developed out of the investigations he began to make while at school. Topics other than mathematics also interested him, especially physics and astronomy. He studied both the theoretical aspects of astronomy and also the practical aspects spending many evenings observing the stars and planets.\nIn\n1894\nPlemelj took his final school examinations and entered the Faculty of Arts of the University of Vienna to study his three favourite school subjects of mathematics, physics and astronomy. He was lucky to have some excellent lecturers at Vienna, many of whom were newly appointed. He was taught analysis by von Escherich while\nGegenbauer\n(\nappointed a professor in Vienna in\n1893)\nand\nMertens\n(\nappointed to Vienna in\n1894)\ntaught him algebra and number theory. His physics lecturer was\nBoltzmann\n, perhaps the best known of all his teachers who was appointed to the chair of theoretical physics in Vienna in\n1894\n, while his astronomy lecturer was Edmund Weiss. Plemelj undertook research under von Escherich's supervision and in May\n1898\nwas awarded his doctorate for a thesis on linear homogeneous differential equations with uniform periodical coefficients:\nüber lineare homogene Differentialgleichungen mit eindeutigen periodischen Koeffizienten\nⓉ\n(\nOn linear homogeneous differential equations with unique periodic coefficients\n)\n.\nThe years which Plemelj spent at the University of Vienna were ones in which political events were taking place which would lead to Slovenia gaining independence from Austrian rule and the eventual formation of Yugoslavia. The first political parties in Slovenia were formed during this time and Plemelj strongly supported their aims. After his doctorate Plemelj travelled to Germany where he studied with\nFrobenius\nand\nFuchs\nfor the academic year\n1899\n-\n1900\n. He then went to Göttingen where he spent the following academic year studying under\nKlein\nand\nHilbert\n.\nAn important mathematical event occurred while he was at Göttingen, for that was the year in which Holmgren lectured on\nFredholm\n's theory of\nintegral equations\nat Göttingen.\nHilbert\nimmediately saw the he importance of\nFredholm\n's theory and work at Göttingen on this topic began immediately. Plemelj was a major contributor to this work and he was among the first to make major advances. The contributions he made to integral equations and potential theory were brought together in a work he published in\n1911\nfor which he was awarded the Prince Jablonowski Prize.\nIn April\n1902\nhe was appointed as a\nprivatdozent\nat the University of Vienna where he remained until\n1906\nwhen he was appointed as an assistant professor at the Technical University of Vienna. He only spent one year in this post for in\n1907\nhe was appointed associate professor at the University of Chernivtsi. Chernivtsi is now in south-western Ukraine, but at the time Plemelj was working there it was part of Austria-Hungary. After only one year he was appointed to the position of full professor of mathematics and around this time he produced some of his most outstanding contributions to mathematical research.\nRiemann\n's problem, concerning the existence of a linear differential equation of the Fuchsian class with prescribed regular singular points and monodromy group, had been reduced to the solution of an integral equation by\nHilbert\nin\n1905\n. Plemelj discovered equations relating to boundary values of holomorphic functions which are now called the \"Plemelj formulae\" and shortly after this was able to solve\nRiemann\n's problem in his paper\nRiemannian classes of functions with given monodromy group\npublished in\nMonatshefte für Mathematik und Physik\nⓉ\n(\nMathematics and physics monthly\n)\nin\n1908\n. The equations are today important in a number of different fields, including neutron transport theory where a singular integral equation is encountered. We should note that the Plemelj formulae are sometimes called the\nSokhotsky\n-Plemelj formulae since, as Kechkic writes in\n[\n5\n]\n:-\n... the so-called Plemelj formulae are ... due to\nSokhotsky\n, who published them in his doctor's thesis in\n1873\n, that is to say\n35\nyears before Plemelj.\nPlemelj's methods for solving the\nRiemann\n's problem were further developed by Nikolai Ivanovich Mushelisvili into the theory of singular integral equations. Also important are Plemelj's contributions to the theory of analytic functions which he developed while investigation the problem of uniformization of algebraic functions\n[\n2\n]\n:-\nHe was the first to discover the sharp formulation of Koebe's distortion theorem. Within the theory of differential equations he worked mostly on equations of the\nFuchs\ntype and on\nKlein\n's theorems.\nAnother contribution that we should mention was Plemelj's simple proof of the\nn\n=\n5\nn = 5\nn\n=\n5\ncase of\nFermat's Last Theorem\nwhich he published in\n1912\n. During\n1912\n-\n13\nPlemelj was Dean of the Faculty at the University of Chernivtsi. This was a period during which he received many honours, for his book on potential theory not only led to him receiving the Prince Jablonowski Prize, which we mentioned above, but also the Richard Lieben Prize in\n1912\n. This latter prize was awarded to him in Vienna for:-\n... the most outstanding work in the field of pure and applied mathematics written by an Austrian mathematician in the previous three years.\nPlemelj certainly qualified as an Austrian mathematician but it was ironical that he would be described as such during a period when the various nations which formed the Austrian empire were beginning to look towards independence and Plemelj himself was strongly associated with such aims. He continued to work at the University of Chernivtsi through the first years of World War I, but the movement for independence of Slovenia from Austria continued to strengthen. With Austria allied with Germany against the Allies, the independence movement grew in strength with the Yugoslav Committee, consisting of exiles in Paris and London, founded in April\n1915\n. In\n1917\nthe government forced Plemelj to leave Chernivtsi because of his political views and he fled north into Bohemia. On\n20\nJuly\n1917\n, the Yugoslav Committee in conjunction with the exiled Serbian government issued the Corfu Declaration which paved the way for a South Slav state of Serbs, Croats, and Slovenes. The Kingdom of Serbs, Croats, and Slovenes\n(\nwhich would became Yugoslavia in\n1929)\nwas formed on\n1\nDecember\n1918\n. In fact at the end of World War I, among the many changes to the map of Europe, Chernivtsi became Romanian.\nThe Slovene Provincial Government set up a University Commission to oversee the reopening of the University of Ljubljana as a Slovene University and Plemelj was appointed a member of this Commission. In fact the University of Ljubljana had been founded in\n1595\nbut now an important step towards Slovenian independence from Austrian rule was the creation of a Slovene University. The University of Ljubljana reopened as a Slovene university in\n1919\nwith Plemelj as its first Rector. He was also appointed Professor of Mathematics in the Faculty of Arts.\nVidav\n, who was a student of Plemelj at Ljubljana, writes in\n[\n2\n]\n:-\nAccepting a chair at the University of Ljubljana, Plemelj in fact sacrificed his scholarly career. What with the post-war lack of contact with the scientific world, his professional loneliness, and his illness, Plemelj taught, rather than created much new during his Ljubljana years.\nHowever his time in Ljubljana was very beneficial for his country\n[\n2\n]\n:-\nPlemelj's presence in Ljubljana was of paramount importance for the development of mathematics and other exact sciences among Slovenes. Several generations of mathematicians benefited from his teaching. He used to hold a general course of mathematics and a three-year cycle of lectures on differential equations, the theory of analytic functions, and algebra including number theory.\nThese courses became the basis of three of his textbooks published by the Slovene Academy of Sciences and Arts. They were\nThe theory of analytic functions\n(1953)\n,\nDifferential and integral equations. The theory and the application\n(1960)\n, and\nAlgebra and the number theory\n(1962)\n. His final work,\nProblems in the Sense of\nRiemann\nand\nKlein\nappeared in\n1964\nand described those parts of mathematics to which Plemelj had been a major contributor.\nPlemelj received many honours in addition to the Prince Jablonowski Prize and the Richard Lieben Prize which we mentioned above. He was elected to the Yugoslav Academy in Zagreb in\n1923\n, the\nSerbian Academy\nin\n1930\n, and the Slovene Academy of Sciences and Arts when it was founded in\n1938\n. In\n1954\nhe received the Presernova nagrada Prize and was elected to the Bavarian Academy in the same year. The University of Ljubljana awarded him an honorary doctorate in\n1963\non the occasion of his\n90\nth\nbirthday.\nWe end this biography with a few comments about Plemelj's style as a lecturer. He always lectured without notes, seemingly without having prepared the lecture at all. He did prepare each lecture, however, thinking carefully about it as he walked between his home and the university. He was interested in calligraphy, writing his lectures in beautifully drawn characters. Language also fascinated him and he chose his words carefully, expecting his students to do the same. Although much is lost from the following quotation in the translation, it does illustrate the importance he attached to shades of meaning:-\nThe engineer who does not know mathematics never needs it. But if he knows it, he uses it frequently.\nPlemelj retired in\n1957\nwhen he was\n83\nyears old and died in Ljubljana in his\n94\nth\nyear. He is buried in his home town of Bled where his Villa was bequeathed by him to the Society of Mathematicians, Physicists and Astronomers of Slovenia. Today it contains a memorial to one of the most famous mathematicians of Slovenia."
}