{
  "nome_completo": "Juan Caramuel y Lobkowitz",
  "nome_curto": "Juan Caramuel",
  "ano_nascimento": "1606",
  "ano_morte": "1682",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Caramuel/",
  "lugar_nascimento": "Madrid, Spain",
  "lugar_morte": "Milan (now Italy)",
  "biografia": "Juan Caramuel\n's parents were the Luxembourg engineer Lorenzo Caramuel and Catalina de Frisia. As well as being a professional engineer, Lorenzo was also an amateur astronomer and he taught his son mathematical and astronomical skills at a young age. Juan was a highly intelligent boy and by the age of twelve he was constructing his own astronomical tables. As well as being taught by his father, Juan had several private tutors before starting his first formal education at a Jesuit school where he learnt grammar and rhetoric. After this he entered the University of Alcalá\n(\nnear Madrid\n)\nwhere he studied philosophy and the humanities. He received an M.A. from the University of Alcalá having written a dissertation on\nInfinite Logic\n, after which he entered the Cistercian Order at the Monasterio de la Espina near Medina de Rioseco, Valladolid. He studied philosophy at the Monasterio de Montederramo, Orense, before going to the Santa Maria del Destierro of Salamanca to study theology. He was a brilliant scholar with an amazing flair for languages; he learnt to speak twenty languages including Latin, Greek, Arabic, Syriac, Hebrew and Chinese. Fleming writes about this period spent in Salamanca\n[\n2\n]\n:-\nBy Caramuel's day, Salamanca's golden age as a theological centre had passed, but\n[\nCaramuel\n]\nreveals that his training there greatly influenced his thinking about probabilism. Years later, he would credit a \"great man\", the Cistercian scholar Angel Manrique, with teaching him to understand the essence of intrinsic probability.\nAfter leaving Salamanca he taught in the Cistercian college in Alcalá and in Santa Maria de Palazuelos in Valladollid. He travelled widely, going to Portugal and to Belgium in\n1632\nwhere he spent time at the Monastery of Dunes in Flanders. Settling in Louvain\n[\n2\n]\n:-\n... he decided to supplement his academic credentials by applying for admission to the doctorate in theology.\nHe received a doctorate in theology from Louvain on\n22\nSeptember\n1638\n. He was appointed Abbot of Melrose, in Scotland, but this was only a nominal appointment and he did not visit Scotland. He taught at Louvain until\n1644\nand, while there, he planned the defence of the city and published works on military engineering. He also wrote at this time on other topics such as a work in which he argued that the King of Spain to had the right to rule Portugal. He published the philosophy work\nRationalis et realis philosophia\nⓉ\n(\nRational and real philosophy\n)\nin\n1642\nand, in the following year, published his theological work\nTheologia moralis ad prima atque clarissima principia reducta\nⓉ\n(\nMoral theology reduced to first principles\n)\nwhich sought solutions to theological problems through applying mathematical rules. Much of Caramuel's scientific work was done during the period in Louvain\n[\n2\n]\n:-\nHe published works in mathematics and astronomy, corresponded with important scholars, and even experimented with a pendulum by hanging weights from a library roof. Yet what he failed to do, despite his continued efforts, was to obtain a permanent academic or ecclesiastical position.\nAt this time the Roman Catholic Church had many different Orders promoting their own version of the truth. In addition Protestant Churches were gaining support and the Catholic Church was working to reverse that trend. Caramuel was a Cistercian and in his writings he attacked Jansenism, a movement within the Catholic Church which considered itself following the teachings of St Augustus, but was attacked by its opponents, particularly the Jesuits, as having views close to Protestants. Caramuel, therefore, found favour with the Jesuits and also from the highly influential Fabio Chigi. His opposition to the Jansenists, however, prevented him from gaining the academic appointment in Louvain which he fully deserved for his scholarship.\nHe was appointed Abbot of Disibodenberg near Mainz and left Louvain on\n9\nFebruary\n1644\nto journey to his new monastery. After stopping in Cologne he reached Frankfurt where he purchased\nGassendi\n's\nObjections\nto\nDescartes\n'\nMeditations\n. After another stop in Kreuznach he reached Disibodenberg. He had been sent to this difficult area in an attempt to invigorate the Catholics in that part of Germany in their opposition to the spreading Protestant faith. This proved an almost impossible task - when he arrived he found the monastery half in ruins and the fighting between Catholics and Protestants in the area meant that he had to flee in fear of his life on several occasions. In\n1647\nhe became Abbot of the Benedictine Monastery in Vienna and also Abbot of the Emaus Monastery in Prague, the residence of the Spanish Benedictines of Montserrat. He lived in Prague and, on\n26\nJuly\n1648\n, he helped defend the city from an attack by the Swedes, one of the last pieces of military action of the Thirty Years War. He was honoured for this act with the award of a gold medal by the Emperor. However, his support for the Peace of Westphalia, which declared Catholics and Protestants equal, angered Fabio Chigi and other leading Catholics who refused to recognise the Treaty. Caramuel continued to write and publish many works, the most significant being\nTheologia moralis fundamentalis, praeterintentionalis, decalogica, sacramentalis, canonica, regularis, civilis, militaris\nⓉ\n(\nFundamental moral theology, including the ten commandments and sacramental, regular, civil, military and canonical matters,\n)\n(1652)\n. His position within the Catholic Church was always difficult and he feared many times that the Inquisition would move against him. When his patron Fabio Chigi was elected pope in April\n1655\n(\nbecoming Pope Alexander VII\n)\n, Caramuel seems to have decided that he would be safer in Rome. Fabio Chigi, now pope, never quite supported Caramuel with the same enthusiasm following their earlier disagreements. However, in Rome Caramuel served as consulter to the Congregation of Rites and to the Holy Office. He did amazing work during an outbreak of the plague, disregarding his own safety by looking after the many ill people and arranging for those who had died to be buried. There were still problems concerning his views, and the Congregation of the Index banned some of his propositions and required him to \"correct\"\nTheologia moralis fundamentalis\nⓉ\n(\nA fundamental moral theology\n)\nand issue a new edition. This second edition appeared in\n1656\n, although scholars largely ignore this edition today, knowing that Caramuel's views are more correctly expressed in the first edition. He seems to have deflected most attacks on his writings, still having support from Pope Alexander VII. Although they did not attack Caramuel personally, leading Jansenists such as\nAntoine Arnauld\nand\nBlaise Pascal\nwere strongly opposed to his views.\nIn July\n1657\nPope Alexander VII made Caramuel bishop of Satriano in southern Italy and he moved there in\n1659\n. This move appears to have been made by the pope because Caramuel was attracting too much controversy. Perhaps the pope warned him to keep his head down, for Caramuel published nothing during his first four years in Satriano. When he did publish again, it was\nApologema pro Antiquisima et Universalissima Doctrina de Probabilitate\nⓉ\n(\nApologia for the oldest  and most universal doctrine of probability\n)\n(1663)\nwhich was quickly added to the Index of prohibited books. He reacted to the lack of support from the pope by setting up a printing press in Satriano to distribute his work. He wrote the fascinating\nSyntagma de arte typographica\nⓉ\n(\nConstruction of the art of printing\n)\n(1664)\ndescribing his methods of printing and publishing. In the encyclopaedia of mathematics\nMathesis biceps, vetus et nova\nⓉ\n(\nTwo parts of mathematics: the old and the new\n)\n, published in\n1670\n, he expounded the general principle of numbers to base\nn\nn\nn\npointing out the benefits of some other bases than\n10\n.\nDonald Knuth\nwrites in\nThe Art of Computer Programming\nVolume\n2\n:-\nThe first published discussion of the binary system was given in a comparatively little-known work by a Spanish bishop, Juan Caramuel Lobkowitz, 'Mathesis biceps'\n(\nCampaniae,\n1670)\npp.\n45\n-\n48\n: Caramuel discusses the representation of numbers in radices\n2\n,\n3\n,\n4\n,\n5\n,\n6\n,\n7\n,\n8\n,\n9\n,\n10\n,\n12\n, and\n60\nat some length, but gave no examples of arithmetic operations in nondecimal systems\n(\nexcept for the trivial operation of adding unity\n)\n.\nIn\n1673\nhe was transferred to Vigevano near Milan. Certainly he was not going to allow the move to stop him printing his works so he set up a printing press in Vigevano. It was on this press that his important work on architecture\nArchitectura civil recta y obliqua\nwas published in\n1678\n. Caramuel still had to resist attacks against views he had put forward forty years earlier\n[\n2\n]\n:-\nIn\n1677\n, three members of the University of Louvain's theological faculty, journeying to Rome for the condemnation, made a detour to Vigevano to urge Caramuel to retract his propositions. The unexpected confrontation reduced the elderly bishop to a short fit of weeping. But after so long, Caramuel was hardly prepared to yield. Those who had not understood his views had distorted them, he told the unwelcome visitors.\nCaramuel's eyesight became poor in the last years of his life but he was able to continue with his duties as bishop. In fact he was at an evening service in the cathedral when he died suddenly.\nWe have described many of Caramuel's contributions above but let us end with a few more details. He loved puzzles and published a collection containing some that he had composed when he was only ten years old. Mathematical puzzles and games of chance form part of\nMathesis bicep\ns\n(1670)\n. He proposed a new method of\ntrisecting an angle\nand developed a system of logarithms to base\n109\nwhere log\n1010\n=\n0\nand log\n1\n=\n10\n. He was the first to publish log tables in Spanish. Among Caramuel's other scientific work we mention a system he developed to determine longitude using the position of the moon. He wrote widely on grammar, linguistics and rhetoric but perhaps his most interesting proposal in this area was to argue for the creation of a universal language."
}