{
  "nome_completo": "Judita Cofman",
  "nome_curto": "Judita Cofman",
  "ano_nascimento": "1936",
  "ano_morte": "2001",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cofman/",
  "lugar_nascimento": "Vrsac, Vojvodina, Yugoslavia (now Serbia)",
  "lugar_morte": "Debrecen, Hungary",
  "biografia": "Judita Cofman\nwas born in Vrsac, a town about\n70\nkm north east of Belgrade and\n100\nkm east of Novi Sad, in which, at the time she was born, roughly half the population spoke German and half a Yugoslav language. Her name in the official register of births is Judit Zoffmann, but she always used the Serbian form of Judita Cofman. Her father, Åkos Zoffmann\n(1910\n-\n1974)\n, was brought up in an Hungarian speaking family but was educated in Germany. He was an expert in brewing beer and in wine production having his own brewery in Vrsac. Judita's mother, Lujza Kozics, came from a Hungarian family of lawyers on her father's side. The family spoke Hungarian at home.\nJudita was only three years old when World War II broke out in\n1939\nand in\n1941\nGerman troops occupied the town of her birth. She began her primary education at a Hungarian school in Vrsac but there were large changes in\n1944\nwhen the defeated German troops left the town together with the citizens who were ethnically German. The Soviet troops moved in and the town became part of Socialist Yugoslavia. In\n1946\nthe brewery which had been owned by the Zoffmann family for several generations was nationalised. There were no Hungarian secondary schools in Vrsac so Cofman attended a Serbian High School. Despite being brought up in a war-torn land, her upbringing was a happy one\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nThe family home, full of love and harmony, installed in her a great feeling that work, study, reading and knowledge of foreign languages are necessary preconditions for success in life.\nHer schooling in two different languages was not a problem\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nBesides being gifted for mathematics, Judita had a talent for languages, so, besides her mother tongue of Hungarian and the official Serbian language, as a child she learned German, Russian and, which was rare at that time, English. She later learned French and Italian.\nThe University of Novi Sad was founded on\n28\nJune\n1960\nbut some of its faculties were founded in Novi Sad before this date. The first two to begin operating were the Faculty of Philosophy and the Faculty of Agriculture, both in\n1954\n. The Faculty of Philosophy taught six subjects in its first year: History, South Slavic Languages, South Slavic Literature, English Language and Literature, German Language and Literature, and Mathematics with Physics. Of course, only first year studies were taught in this first year of operation and the mathematics syllabus was essentially that of the first year at the University of Belgrade. Most of the teaching was by professors who were employed by the University of Belgrade. In this first year there were\n66\nstudents studying mathematics in the Faculty of Philosophy at Novi Sad, one of them being Cofman. All of the\n66\nwhich, may we suggest, is a surprising high number, were intending to become teachers of mathematics. As Cofman progressed at Novi Sad, the younger students came to rely on her help since their professors were living and teaching in Belgrade and only travelled to Novi Sad to carry out their teaching duties there. Aleksander M Nikolic writes\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\nThe professional literature in the Serbian language was still insufficient at that time, and students could not use foreign titles because their knowledge of foreign languages was modest. The only person who was able to answer at any moment a variety of questions by curious students was Judita Cofman. As her knowledge of foreign languages was high, she was almost the only one among the students who could use German, English and Russian textbooks and widen her knowledge of mathematics, which she used to unselfishly share with her colleagues. They felt that she knew all there was to know about mathematics!\nMileva Prvanovic\n(\nborn\n16\nJuly\n1929)\nstudied mathematics at the University of Belgrade from\n1947\nto\n1951\n, then undertook research in geometry at the University of Zagreb being awarded a Ph.D. in\n1955\n. From\n1951\nto\n1955\n, she taught at the Mathematical Institute of the Serbian Academy of Sciences in Belgrade. In\n1955\nshe was appointed to the Faculty of Philosophy in Novi Sad. There she taught Cofman who excelled in her studies and graduated with an outstanding degree in\n1958\n. Following her graduation, Cofman taught at Zrenjanin High School. This school on Gimnazijska street in Zrenjanin, a town about\n40\nkm east of Novi Sad, was founded in\n1848\nand enlarged in\n1937\n. Cofman taught there for two years before returning to the Faculty of Philosophy in Novi Sad in\n1960\nwhen she was appointed as an assistant to Mileva Prvanovic. She taught ruler-and-compass construction and her lecture notes, entitled\nRuler-and-compass Constructions\n, were published by the Faculty of Philosophy in Novi Sad. It was the first mathematics publication by the Faculty of Philosophy.\nCofman, advised by Prvanovic, was studying for a Ph.D. in finite geometries. In\n1961\nshe went to Rome where she studied with Lucio Lombardo-Radice\n(1916\n-\n1982)\nwho, only a couple of years earlier, had published\nPiani grafici finiti non desarguesiani\nⓉ\n(\nPlane finite non-desarguesian graphics\n)\n(1959)\non finite non-desarguesian planes. Lombardo-Radice had been imprisoned during World War II for his opposition to the Fascist Regime but served as an assistant at La Sapienza University in Rome from\n1945\nto\n1956\nwhen he was appointed as an extraordinary professor at the University of Palermo. He had returned to La Sapienza in Rome in\n1960\nand he advised Cofman on her research into finite non-desarguesian planes. Cofman returned to Novi Sad in\n1963\nand submitted her Ph.D. thesis entitled\nFinite non-desarguesian planes generated by quadrangles\n. She was examined by a committee consisting of Lucio Lombardo-Radice, Mirko Stojakovic\n(1915\n-\n1985)\nand Mileva Prvanovic. She was awarded the degree and became the first to be awarded a Ph.D. in mathematics from the University of Novi Sad.\nFollowing the award of her Ph.D., Cofman spent the year\n1964\n-\n65\nat the University of Frankfurt am Main financed by an Alexander von Humboldt scholarship. From\n1965\nto\n1970\nshe worked in England where she was a lecturer at Imperial College, University of London. There she continued her work on finite geometries and published papers such as:\nOn a characterization of finite desarguesian projective planes\n(1966)\n;\nDouble transitivity in finite affine planes\n(1967)\n;\nTriple transitivity in finite Möbius planes\n(1967)\n;\nTranslations in finite Möbius planes\n(1968)\n;\nOn Baer involutions of finite projective planes\n(1970)\n; and\nSimple groups and Möbius planes of even order\n. During these years that Cofman worked at Imperial College, London, she returned to Novi Sad every Christmas and delivered lectures at the university.\nCofman spent\n1970\nas a visiting professor funded by the Consiglio Nazionale delle Ricerche at the University of Perugia in Italy. The conference\nGeometria Combinatoria e sue Applicazioni\nⓉ\n(\nCombinatorial geometry and its applications\n)\nwas held at this university from\n11\nto\n17\nSeptember\n1970\n. Cofman gave the lecture\nOn automorphism groups of finite geometries\nand it was published in the Proceedings of the conference which was published in\n1971\nby the Istituto di Matematica, Università degli Studi di Perugia. In\n1971\nshe was appointed to the University of Tübingen in Germany and continued to undertake research in the same areas. Papers she published while at Tübingen include:\nBaer subplanes in finite projective and affine planes\n(1972)\n; and\nOn subplanes of affine and projective planes\n(1973)\n. She attended the 'International Colloquium on the Theory of Combinatorics' in Rome in\n1973\nand gave the lecture\nOn combinatorics of finite Sperner spaces\nwhich was published in the proceedings of the conference. In the following year she attended the conference on the\nFoundations of geometry\nat the University of Toronto in Canada. Her\n38\n-page paper\nConfigurational propositions in projective spaces\nwas published in the conference proceedings. By\n1976\nshe had moved to the University of Mainz, publishing the paper\nOn ternary rings of derivable planes\n(1977)\n. At this stage in her career, Cofman made a major change of direction when she became a school teacher and her research interests moved from finite geometries to mathematical education.\nIn\n1978\n, at the age of\n42\n, she became a teacher of mathematics at Putney High School, London. She remained there until\n1993\nand during these years she began publishing articles on mathematical education. For example, she published:\nMathematics and the Christmas Tree\n(\nA Classroom Experience\n)\n(1980)\n;\nPlay with tangram - The activities of a Maths Club\n(1980)\n,\nTangram and Pangram\n(\nExperience of a Maths Club\n)\n(1980)\n; and\nOperations with Negative Numbers\n(1981)\n. You can read extracts from some of these papers as well as some extracts from Cofman's\nRole of Geometry in Contemporary Mathematical High School Education\n(1996)\nat\nTHIS LINK\n.\nShe also became involved in summer teaching camps which gave her the opportunity to experiment with getting talented children to cooperate rather than to compete. She wrote in\n[\n4\n]\n:-\nThe National Association for Gifted Children in Great Britain organizes residential courses for its \"Explorers\". In\n1981\nI was asked to conduct a week's course on mathematics for teenagers. This most interesting enterprise was followed by two more Explorers' courses in the two subsequent summers. It was encouraging to see a substantial number of participants returning from year to year. ... At the meeting in\n1983\n, participants asked for talks on various aspects of topology and quantum mechanics to be arranged; answers to specific questions on permutations were also in demand. In addition, two important decisions were made:\n(1)\nTo extend the duration of next year's course from one week to a fortnight, and\n(2)\nto invite participants from abroad. ... At this stage we had to depart from the Explorers. Our wishes had become too specialized, and we had to prepare a \"camp\" in\n1984\non our own. We were very fortunate to receive excellent response and generous aid from all the people we asked for support. Guest speakers, tutors and houseparents have done voluntary work sacrificing parts of their holidays, and this was greatly appreciated. We have spent a rewarding and inspiring time with thirty-three youngsters from nine countries. ... The second camp took place in the summer of\n1985\n; this time we met in Germany, since we felt that we would all benefit from \"moving around\". We had invaluable support from German University teachers. Professor Pickert from Giessen and Professor\nHirzebruch\nfrom Bonn arranged various lectures at the camp and at the Max Planck Institute in Bonn where we spent a day.\nIn the Preface of her book\nWhat to solve?\nCofman wrote about the problems posed to children at these summer camps. You can read extracts from this Preface at\nTHIS LINK\n.\nIn\n1993\nCofman left high school teaching and returned to universities when she was appointed as professor of didactics of mathematics at the University of Erlangen, Nürnberg. She became the head of the Department of Mathematics Teaching Methods. She worked there until\n2001\nwhen she was appointed as a professor in the Department of Postgraduate Studies for Mathematics Teaching Methods in the Faculty of Natural Sciences at Kossuth Lajos University in Debrecen, Hungary. She died a couple of months after taking up this appointment.\nMileva Prvanovic writes in\n[\n7\n]\nabout Cofman's interest in educating young mathematicians:-\nJudita Cofman dedicated the greatest part of her work in mathematics to fostering young mathematicians. The results of such work were a great number of articles dedicated to mathematics teaching methods, which were published in several international journals. In the last decade of her professional career, Judita Cofman published three books for young mathematicians, where she presented various mathematical problems and tasks, experiences in their solving, as well as an outstanding methodical approach to solving non-standard mathematical problems.\nShe published three books:\nProblems for young mathematicians\n(1981)\n;\nWhat to solve? Problems and suggestions for young mathematicians\n(1990)\n;\nand Numbers and shapes revisited. More problems for young mathematicians\n(1995)\n.\nYou can read extracts from some reviews of the second and third of these books at\nTHIS LINK\n.\nYou can read extracts from\n(\nA\n)\nthe Preface,\n(\nB\n)\nthe Acknowledgements,\n(\nC\n)\nIntroduction to Chapter I,\n(\nD\n)\nIntroduction to Chapter II,\n(\nE\n)\nIntroduction to Chapter III, and\n(\nF\n)\nIntroduction to Chapter IV of\nWhat to solve?\nat\nTHIS LINK\n.\nMileva Prvanovic also writes about her character\n[\n7\n]\n:-\nJudita Cofman was adorned with the finest human characteristics. So greatly talented and educated\n(\nshe spoke several languages\n)\n, she was very modest, communicative, always ready to help, not only her friends and colleagues, but also anyone who would turn to her for help. She was always polite and considerate towards her colleagues as well as anyone coming into contact with her. She cared to keep every single promise she gave. Everyone admired her hard work and dedication, feeling her stimulating enthusiasm."
}