{
  "nome_completo": "Jyesthadeva",
  "nome_curto": "Jyesthadeva",
  "ano_nascimento": "1500",
  "ano_morte": "1575",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Jyesthadeva/",
  "lugar_nascimento": "Kerala, India",
  "lugar_morte": "Kerala, India",
  "biografia": "Jyesthadeva\nlived on the southwest coast of India in the district of Kerala. He belonged to the Kerala school of mathematics built on the work of\nMadhava\n,\nNilakantha\nSomayaji,\nParamesvara\nand others.\nJyesthadeva wrote a famous text\nYuktibhasa\nwhich he wrote in Malayalam, the regional language of Kerala. The work is a survey of Kerala mathematics and, very unusually for an Indian mathematical text, it contains proofs of the theorems and gives derivations of the rules it contains. It is one of the main astronomical and mathematical texts produced by the Kerala school. The work was based mainly on the\nTantrasamgraha\nof\nNilakantha\n.\nThe\nYuktibhasa\nis a major treatise, half on astronomy and half on mathematics, written in\n1501\n. The\nTantrasamgraha\non which it is based consists of\n432\nSanskrit verses divided into\n8\nchapters, and it covers various aspects of Indian astronomy. It is based on the epicyclic and eccentric models of planetary motion. The first two chapters deal with the motions and longitudes of the planets. The third chapter\nTreatise on shadow\ndeals with various problems related with the sun's position on the celestial sphere, including the relationships of its expressions in the three systems of coordinates, namely ecliptic, equatorial and horizontal coordinates.\nThe fourth and fifth chapters are\nTreatise on the lunar eclipse\nand\nOn the solar eclipse\nand these two chapters treat various aspects of the eclipses of the sun and the moon. The sixth chapter is\nOn vyatipata\nand deals with the complete deviation of the longitudes of the sun and the moon. The seventh chapter\nOn visibility computation\ndiscusses the rising and setting of the moon and planets. The final chapter\nOn elevation of the lunar cusps\nexamines the size of the part of the moon which is illuminated by the sun and gives a graphical representation of it.\nThe\nYuktibhasa\nis very important in terms of the mathematics Jyesthadeva presents. In particular he presents results discovered by\nMadhava\nand the treatise is an important source of the remarkable mathematical theorems which\nMadhava\ndiscovered. Written in about\n1550\n, Jyesthadeva's commentary contained proofs of the earlier results by\nMadhava\nand\nNilakantha\nwhich these earlier authors did not give. In\n[\n4\n]\nGupta gives a translation of the text and this is also given in\n[\n2\n]\nand a number of other sources. Jyesthadeva describes\nMadhava\n's series as follows:-\nThe first term is the product of the given sine and radius of the desired arc divided by the cosine of the arc. The succeeding terms are obtained by a process of iteration when the first term is repeatedly multiplied by the square of the sine and divided by the square of the cosine. All the terms are then divided by the odd numbers\n1\n,\n3\n,\n5\n, .... The arc is obtained by adding and subtracting respectively the terms of odd rank and those of even rank. It is laid down that the sine of the arc or that of its complement whichever is the smaller should be taken here as the given sine. Otherwise the terms obtained by this above iteration will not tend to the vanishing magnitude.\nThis is a remarkable passage describing\nMadhava\n's series, but remember that even this passage by Jyesthadeva was written more than\n100\nyears before\nJames Gregory\nrediscovered this series expansion. To see how this description of the series fits with\nGregory\n's series for arctan\n(\nx\nx\nx\n)\nsee the biography of\nMadhava\n. Other mathematical results presented by Jyesthadeva include topics studied by earlier Indian mathematicians such as integer solutions of systems of first degree equation solved by the kuttaka method, and rules of finding the sines and the cosines of the sum and difference of two angles.\nNot only does the mathematics anticipate work by European mathematicians a century later, but the planetary theory presented by Jyesthadeva is similar to that adopted by\nTycho Brahe\n."
}