{
  "nome_completo": "Karl Mikhailovich Peterson",
  "nome_curto": "Karl Peterson",
  "ano_nascimento": "1828",
  "ano_morte": "1881",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peterson/",
  "lugar_nascimento": "Riga, Russia (now Latvia)",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Karl Peterson\n's mother was Maria Mangelson and his father was Mikhail Peterson. Mikhail was a Latvian land worker from the lower class. Karl was born into a country which had been dominated by Russia since the end of the\n18\nth\ncentury although Riga had been taken by the Russians long before. The Russian emperor Alexander I had granted freedom to the peasants a few years before Karl was born, but they did not grant serfs like Mikhail Peterson rights to buy land until the second half of the\n19\nth\ncentury. This caused unrest in the Latvian lands throughout much of Peterson's life.\nKarl attended the\nGymnasium\nin Riga and he graduated in\n1847\nwith excellent qualifications which meant that he as able to study at the University of Dorpat\n(\nnow Tartu\n)\n. Although a university had existed in Tartu since\n1632\n, Peterson entered the Kaiserliche Universität zu Dorpat in Tartu\n(\nDorpat\n)\nwhich had been established in\n1802\n. At this University, Peterson studied under\nFerdinand Minding\n.\nMinding\nhad come to Dorpat in\n1843\nhaving followed a very unorthodox route to becoming a university professor. He did not study mathematics at university, but rather taught himself mathematics during his undergraduate years while taking courses in other topics. He then became a school teacher, undertaking research for a doctorate in his spare time. He was to have a strong influence on Peterson and give him the urge to undertake mathematical research. Peterson would follow in the footsteps of his professor in undertaking deep research while a school teacher, but unlike his professor he never became a university teacher.\nPeterson wrote an unpublished \"candidate's\" thesis,\nÜber die Biegung der Flächen\nⓉ\n(\nOn the bending of surfaces\n)\n(\nDorpat,\n1853)\non\ndifferential geometry\n. This dissertation was written in German but although it was retained in the archives of the University of Dorpat, it remained virtually unknown until it was published in Russian translation one hundred years later in\n1952\n. The dissertation contains a derivation of two equations equivalent to those of Mainardi and\nCodazzi\n, and in it Peterson outlined a proof of the fundamental theorem of surface theory. The thesis also contains what has become known as\nBonnet\n's theorem, published by Pierre\nBonnet\nfifteen years later in\n1867\n. In\n[\n8\n]\nEsther Phillips makes a strong case not only for Peterson's priority over Mainardi,\nCodazzi\nand\nBonnet\n, but also for the greater elegance and simplicity of his approach.\nAfter obtaining his candidate's degree, Peterson worked in Moscow as a teacher of mathematics. His first post was in a private school, then from\n1865\nhe taught at the German Peter and Paul School.\nHis main work is in differential geometry but he obtained an honorary doctorate for his work on\npartial differential equations\n. This was in\n1879\nfrom the Novorossiiskii University of Odessa in recognition for his outstanding contributions to the theory of characteristics of partial differential equations\n[\n1\n]\n:-\n... by means of a uniform general method, he deduced nearly all the devices known at that time for finding general solutions of different classes of equations.\nLargely because he was not at a university his results were not well known but they did influence\nEgorov\nin Moscow, but Peterson gained an international reputation only when\nDarboux\nand\nBianchi\nused his results. Belatedly he has gained the recognition he deserves; for example a class of surfaces is named after him. Another of the areas of his investigation was that of surfaces with nets. A conjugate system on a surface is a conical net, if it is formed by contact curves of circumscribed cones. Surfaces with such nets were first studied by Peterson in\n1866\n.\nIn\n[\n6\n]\nthis work is described as follows:-\nPeterson's most important paper was 'On the ratios and relationships between curved surfaces'\n(1866)\n, devoted to deformation of surfaces, which laid the foundation for a series of papers on the problem of bending on a principal basis, i.e., preserving the conjugacy of a certain net on the surface, the first example of which for deformation of surfaces of revolution on a surface of revolution was found by\nMinding\n...\n(1838)\n. Peterson's paper 'On curves on surfaces'\n(1867)\nand the book 'Über Curven und Flächen'\nⓉ\n(\nOn curves and surfaces\n)\n(1868)\nwere devoted to differential geometry. Some of the results of these papers of Peterson were later duplicated by\nG Darboux\nand other foreign geometers, but after\nE Cosserat\n's translations of Peterson's main works from\n1866\n-\n1867\nwere published in Toulouse in\n1905\n, his work achieved general recognition.\nAs mentioned in the quote, in\n1905\n, nearly\n25\nyears after his death, his papers were published in French translation by the University of Toulouse. These included:\nSur l'intégration des équations aux dérivées partielles\nⓉ\n(\nOn the integration of partial differential equations\n)\n;\nSur la déformation des surfaces du second ordre; Sur les courbes tracées sur les surfaces\nⓉ\n(\nOn the deformation of the second order surfaces; On the curves drawn on surfaces\n)\n; and\nSur les relations et les affinités entre les surfaces courbes\nⓉ\n(\nOn the relations and affinities between the curved surfaces\n)\n.\nIn addition to his mathematical research while he taught in Moscow schools, Peterson also worked with\nBrashman\nand\nDavidov\nin founding the\nMoscow Mathematical Society\n. In fact the first such Society had been founded in\n1810\nbut had ceased to function and a totally new Society, which Peterson helped found and organise, started to operate in\n1864\n.\nMathematicheskii Sbornik\n, the journal of the Society, first appeared in October\n1866\nand from that time on Peterson published almost all his research papers in that journal."
}