{
  "nome_completo": "Kathleen Hylda Valerie Booth",
  "nome_curto": "Kathleen Booth",
  "ano_nascimento": "1922",
  "ano_morte": "2022",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Booth_Kathleen/",
  "lugar_nascimento": "Stourbridge, Worcestershire, England",
  "lugar_morte": "Sooke, Vancouver Island, Canada",
  "biografia": "Kathleen Booth\nwas given the name\nKathleen Hylda Valerie Britten\nand only after her marriage in\n1950\nbecame known with the surname Booth. She was the daughter of Frederick John Britten\n(\nborn on\n18\nOctober\n1897\nin Bromsgrove, Worcestershire, England; died\n13\nDecember\n1995)\nand Gladys May Kitchen\n(\nborn on\n18\nMarch\n1897\nin Sutton Coldfield, Warwickshire, England; died on\n16\nJuly\n1966)\n. Frederick Britten was a tax inspector who married Gladys Kitchen in\n1921\n. Kathleen, the second of their three children, is the subject of this biography. Their son Mickey was born in\n1931\n; he died in\n1936\n.\nKathleen began her schooling in\n1929\nat St Paul's Convent in Sutton Coldfield. This school had been run by the Sisters of Charity since\n1925\n. Her primary education was at this school then, in\n1932\n, she began her secondary education at Sutton Coldfield High School, a girls' school which had been founded in\n1929\n. After a year at Sutton Coldfield High School, Kathleen moved to West Bromwich Secondary School. Again she only spent a year at this school before entering King Edward VI's High School for Girls, Birmingham in\n1934\n. This school, founded in\n1883\non New Street, encouraged students to go from elementary school through grammar school and high school to university. When war was declared in\n1939\n, the girls were evacuated to Pates Grammar School in Cheltenham and it was there that Kathleen completed her schooling.\nOn\n2\nOctober\n1941\n, Kathleen entered Royal Holloway College, London having won a scholarship of £\n40\nfor\n3\nyears. Her university record gives her father's address as\n58\nDriffold, Sutton Coldfield, Warwickshire. She studied B.Sc. Special Mathematics and, in her first year, also studied Chemistry. She said in an interview\n(\nsee\n[\n25\n]\n)\n:-\nMathematics was the subject I was best at ... a much more pleasant thing to do than studying languages, for instance.\nIn\n1944\nshe was awarded a B.Sc. Special Mathematics and won the College Prize. With World War II still in progress, Britten became a junior scientific officer at the Royal Aircraft Establishment in Farnborough where she was involved in making structural tests on materials which were used in aircraft manufacture. In November\n1946\nshe published the report\nCompression Tests on Dural-Celluboard Sandwich Panels\non this work. The Introduction reads:-\nMuch interest had been shown recently in sandwich construction as practical and theoretical investigations have indicated that sandwich panels can be equally or more efficient than the more conventional stringer and corrugated panels for carrying end loads.\nThis report describes tests made on\n56\nflat Dural-Celluboard panels with birch, spruce and whitewood centres, and compares the results with those obtained from Dural-Balsa and all-metal panels.\nKathleen's daughter Amanda said that her mother\n[\n26\n]\n:-\n... used to say that, in an odd way, the war did her a favour. It opened science-based jobs to women who had previously been limited to teaching.\nThe war ended in\n1945\nand in\n1946\nBritten left the Royal Aircraft Establishment and joined a research group working on X-ray crystallography at Birkbeck College, London. The team was led by John Desmond Bernal\n(1901\n-\n1971)\nand Andrew Donald Booth\n(1918\n-\n2009)\nwho had joined in\n1945\nafter completing a Ph.D. in crystallography at the University of Birmingham in\n1944\n. In\n1946\n, the year Britten joined, the research group had moved into premises supplied by the British Rubber Producers Research Association and the Association were sponsoring Andrew Booth's work on computers. This was seen as a way to improve the X-ray crystallography work where much numerical calculation was necessary. The team were part of a larger group whose efforts eventually led to the discovery of the double helix structure of DNA.\nOn\n28\nFebruary\n1947\nboth Kathleen Britten and Andrew Booth left Southampton on the S S\nQueen Elizabeth\nand arrived in New York on\n5\nMarch. Britten is described as a 'Research Assistant' with final destination the Institute for Advanced Study at Princeton. The length of her visit is given as six months and it was being paid for by the British Rubber Producers Research Association. It was her first visit to the United States and the passenger list gives details such as: Height:\n5\nFeet,\n9\nInches, Hair Colour: Brown, Eye Colour: Blue, Complexion: Fair. Andrew Booth had visited New York in the United States in\n1946\n, returning to England in September. He gives his destination as the Rockefeller Foundation, New York, and his trip was funded by a Rockefeller Fellowship.\nDuring their time in the United States, Britten and Booth spent time working at the Computer Project of the Institute for Advanced Study at Princeton and at the U.S. Ordnance Department. At the Institute for Advanced Study they had many very useful discussions on both the practical and the theoretical aspects of computers with both\nJohn von Neumann\nand\nHerman Goldstine\n[\n17\n]\n:-\nWhen they arrived they found that actually very little was going on by way of computer construction but there was a lot of theory to absorb - in particular\nvon Neumann\narchitecture.\nWhile at the Institute for Advanced Study, Britten and Booth co-authored the reports\nGeneral considerations in the design of an all-purpose electronic digital computer\n(1947)\nand\nCoding for the A.R.C.\n(1947)\n. You can read extracts from these reports at\nTHIS LINK\n.\nIn June\n1947\nAndrew Booth made a visit to Canada, returning to the Institute for Advanced Study. They travelled back to England on different ships, Britten arriving back in Southampton on the S S\nQueen Elizabeth\non\n8\nSeptember\n1947\nwhile Booth arrived in Liverpool on\n12\nSeptember\n1947\non the Cunard White Star ship\nMedia\n. In November\n1947\nthey submitted the joint paper\nPrinciples and progress in the construction of high-speed digital computers\nto the\nQuarterly Journal for Mechanics and Applied Mathematics.\nThe paper was revised in July\n1948\nand published in\n1949\n.\nOn\n1\nOctober\n1947\nAndrew Booth and Kathleen Britten submitted the paper\nThe accuracy of atomic co-ordinates derived from Fourier series in X-ray crystallography. V\nto the\nRoyal Society\n. This paper continued work that Andrew Booth had been undertaking but developing it further with mathematical skills from Britten. The Abstract of the paper reads:-\nIn the first paper of this series\n[\nby Andrew Booth\n]\n, the effect of experimental errors in the\nFourier\ncoefficients, upon the derived atomic co-ordinates was investigated. The assumption was made that the probable errors were independent of the magnitudes of their parent Bragg reflexions.\nIt has been suggested that a more accurate assumption would be to take the probable error of any coefficient as being proportional to the magnitude of that coefficient. The present paper develops the theory on this basis, and a solution in closed form is obtained.\nThe question of how the experimental error in the co-ordinates varies with the position of the atom in relation to its neighbours is also investigated, and it is shown that the variation is much smaller than that previously derived for finite summation errors.\nBritten was registered to study for a Ph.D. in Applied Mathematics at King's College London and she was awarded the degree by the University of London in\n1950\nfor her thesis\nWind Tunnel Blockage\n. In the same year she married Andrew Booth. Kathleen spoke about these two\n1950\nevents in an interview\n(\nsee\n[\n25\n]\n)\n:-\nIt meant quite hard work. No weekends off or gadding around. But I didn't mind. I was enjoying it.\nAndrew and Kathleen Booth had two children: Ian J Booth, who became a physicist, and Amanda Booth\n(\nborn March\n1962)\n, who became a vet.\nAndrew and Kathleen were involved in the construction and programming of three computers\n[\n32\n]\n:-\nThe construction of their first electronic computer, called SEC\n(\nSimple Electronic Computer\n)\n, was completed around\n1950\n. Andrew wrote up the project in his MSc dissertation, which appears to make him the first computing graduate at Birkbeck and hence the Department's earliest alumnus.\nThe couple's best-known machine, APEC\n(\nAll-Purpose Electronic Computer\n)\n, was designed in\n1949\n. In\n1951\n, the British Tabulating Machine Company used its hardware circuits as the basis of the design of their HEC\n1\n(\nHollerith Electronic Computer\n)\ncomputer, which evolved directly by the end of the\n1950\ns into the bestselling British computer, with a total of nearly\n100\nmachines installed.\n...\nFrom the start, Kathleen was closely involved in the building and testing of the computers that Andrew designed. Getting these early machines to work involved a combination of testing the electronics and then checking that the programmes executed correctly.\nAndrew and Kathleen Booth co-authored the book\nAutomatic digital calculators\nwhich was published in\n1953\n. Ewan Page writes in the review\n[\n31\n]\n:-\nThis book is an introduction to the design, construction, and use of automatic digital computers. In the early chapters the historical development of digital computers is described and an account given of the logical design of a computer and its main components. The engineering devices which have been or may be used for the construction of these components are discussed in more detail in Chapters\n8\n-\n12\n. The last part of the book is devoted to an introduction to the use of machines and to the problems of coding. Some examples of programming with the two-address code of APEXC both with and without optimum coding are worked. The final chapter gives an outline of some of the less common applications of automatic computers. A classified and cross-referenced bibliography is included before name and subject indices.\nFor more information about this book, see\nTHIS LINK\n.\nThe work of the Booths on Machine Translation is told in\n[\n6\n]\nwhere it is put into context with the contributions of others. While at the Institute for Advanced Studies in\n1947\nthey had had discussions with\nWarren Weaver\n, Director of the Natural Sciences Division of the Rockefeller Foundation, about funding a computer in London.\nWeaver\nsaid\n[\n6\n]\n:-\n... that the Foundation was unlikely to fund a machine at London for numerical work but that a submission indicating interest in Machine Translation would be well received. This was duly submitted and was successful.\nBack in London, Kathleen Booth directed the development of suitable programs for translation. On\n11\nNovember\n1955\nthe Birkbeck Computer Laboratory gave a public demonstration of machine translation. As far as we know this was the first ever public demonstration of text translation by computer. Kathleen Booth typed into her computer\n(\nsee\n[\n26\n]\n)\n:-\nC'est un exemple d'une traduction fait par la machine à calculer installée au laboratoire de Calcul de Birkbeck College, Londres.\nThe computer printed out:-\nThis is an example of a translation made by the machine for calculation installed at the laboratory of computation of Birkbeck College, London.\nAlthough this does not seem remarkable to us today, it was totally new in the\n1950\ns to see a computer doing anything other than numerical calculations.\nKathleen Booth and her husband travelled to Australia to attend a week long computer conference at the Weapons Research Establishment at Salisbury, South Australia in June\n1957\n. They returned via the United States, travelling from New York to Southampton on the\nQueen Mary\n, arriving on\n27\nMay. On the list of passengers, Kathleen describes her occupation as 'mathematician' while her husband gives 'physicist'.\nKathleen and Andrew Booth were working in Birkbeck College's Computer Laboratory but in\n1957\na Governors' Resolution converted that into a separate university department named the Department of Numerical Automation. Andrew Booth was head of the Department, which some claim to be the first department in the UK to teach computing. Kathleen Booth taught courses on programming in the Department of Numerical Automation and this led naturally to her writing a book on programming. In\n1958\nKathleen Booth published the book\nProgramming for an automatic digital calculator\n. She wrote in the Introduction:-\nThe years since the second World War have seen a remarkable change in the field of calculation brought about by the availability, in rapidly increasing numbers, of electronic computing machines has meant the emergence of the new technique of preparing calculations for these machines, usually known as programming. The process of organising a calculation can be divided into two parts - the mathematical formulation and the actual programming. The first of these may involve such things as the choice of a suitable finite difference relationship to replace the continuous processes of differentiation and integration, the representation of an analytic function by a power series and the estimation of errors involved in the calculation. The second consists of translating the results of the mathematical formulation into the language of the computing machine, its order code. Obviously the first stage of preparation may involve a considerable knowledge of mathematics but although both parts are often done by the same person - usually a mathematician - in fact the technique of programming can be acquired by anyone with a capacity for accurate detailed thinking, and a talent for solving puzzles. Moreover, it has been our experience that it is possible to train people to do useful programming in a matter of two weeks, although the acquiring of the more subtle tricks of the trade naturally takes longer.\nFor more information about this book, see\nTHIS LINK\n.\nKathleen was working on other ideas on how to use computers\n[\n21\n]\n:-\nThe College Annual Report of\n1958\n/\n59\n, in a foretaste of much more recent work, reports Dr Kathleen Booth developing a program to simulate a neural network to investigate ways in which animals recognise patterns. The following year reports a neural network for character recognition.\nKathleen and Andrew Booth did outstanding work at Birkbeck College but felt that they were not being given the credit they deserved. In particular, Andrew Booth was head of the very successful Department of Numerical Automation but was not being promoted to a professorship. In\n1962\nboth Kathleen and Andrew Booth resigned their positions at Birkbeck College and decided to make a new life for themselves in Canada. Andrew Booth wrote\n[\n5\n]\n:-\nI had made several attempts to get the University to create a permanent Chair in Computer Science and even obtained a guarantee of funds from Industrial friends to support it. It was rejected on the grounds that \"It is too soon to see if computer science will have a long term existence!\" It must be said however that this may have been due to the malice of another academic at another University. I learned of this much later along with evidence of his complete dishonesty.\nIn\n[\n19\n]\nthe loss of Andrew Booth is described as a serious mistake by Birkbeck:-\nIn retrospect this was a massive loss to the College and, from today's perspective, totally incomprehensible given his key contributions to computer technology and his huge research output.\nIn Canada, both Kathleen and Andrew Booth worked at the University of Saskatchewan in Saskatoon. Kathleen was appointed as a research fellow and a lecturer. In\n1965\nshe became director of a national project on machine translation of language. She returned to England for a conference held in Cambridge\n1\n-\n9\nJuly\n1967\n[\n1\n]\n:-\nWhen the\n2\nnd International Conference of Women in Engineering and Science was held in\n1967\n, Kathleen represented Canada and undertook a survey of the attitudes towards women in engineering at the time.\nKathleen Booth delivered the paper\nCanadian attitudes towards the employment of women in the technical professions\nand it was published in the\nConference Proceedings\n. In the paper she writes:-\nThe author of this article, having worked in the mathematical field for nearly twenty years in a variety of posts in England, came to Canada nearly five years ago, and for most of the time since then has been employed in a teaching and research post in the University of Saskatchewan. This is not intended to be the autobiography of a Pioneer on the Prairies, but one must remark here on the extreme friendliness and cooperation of Canadians at all levels to the newcomer which makes the process of transplantation much more agreeable than might appear.\nDave Bocking took a course given by Kathleen Booth at the University of Saskatchewan in\n1971\n. He said\n[\n33\n]\n:-\nShe was really modest. She didn't say anything about her past contributions to the development of computers. It was only in later years that I came to know what achievements she and her husband had made in their careers just after the Second World War and through the\n50\ns. They were really, really innovators, but we never knew that.\nKathleen and Andrew Booth left the University of Saskatchewan in\n1972\n. Andrew wrote in\n[\n5\n]\n:-\nBy the time I left Saskatoon in\n1972\nI had a reasonably qualified staff and a graduate school enrolment of about\n300\n. This was the fourth largest in Canada. On the side our work on Movable Type had continued under the supervision of Dr Kathleen Booth and our system had been demonstrated to the Queen's Printer.\nIn\n1972\nAndrew Booth was appointed as President of Lakehead University, Thunder Bay, Ontario. Kathleen Booth also left the University of Saskatchewan at this time and was appointed as an honorary Professor of Mathematics at Lakehead University. In\n1978\nthey both retired and moved to Sooke on Vancouver Island where they set up the computer consulting business Autonetics Research Associates. Their home, Timberlane,\n5317\nSooke Road, Sooke, British Columbia, was a large rural property. Kathleen remained active in her research on neural networks and, in\n1993\nshe published the joint paper\nUsing neural nets to identify marine mammals\nwhich she co-authored with her son Ian J Booth. Both Kathleen and Ian Booth give their address on the paper as Autonetics Research Associates, Inc., Sooke, BC, Canada. Kathleen Booth's publication topics are listed as:-\n... acoustic signal processing, aquaculture, back propagation, bioacoustics, biological techniques and instruments, biology computing, feedforward neural nets, geophysics computing, oceanographic techniques, speech recognition, underwater sound, zoology.\nThe paper has the following Abstract:-\nA software neural net model to recognise the calls of individual seals has been constructed and has been shown to perform satisfactorily with all of the mammals in the available set. It has also proved stable in the presence of both man made and natural noise. Operating and conditioning times on typical computers are provided.\nAndrew Booth was\n91\nyears old when he died in a hospital of heart and kidney failure on\n29\nNovember\n2009\nin Victoria. Kathleen continued to live at Sooke\n[\n25\n]\n:-\nShe was a keen vegetable grower, taking produce long to the annual autumn fair, and her garden had more than\n60\nvarieties of wild flowers. Before the onset of mobility issues she and her husband enjoyed hiking and walking. She continued to follow developments in computing and\n18\nmonths ago, approaching her\n99\nth birthday, used an iPad to record her memories.\nShe celebrated her\n100\nth birthday on\n9\nJuly\n2022\n. Shortly before, on\n9\nJune\n2022\n, the Andrew and Kathleen Booth Memorial Lecture was given at Birkbeck College and Kathleen sent a video message which was played after the main lecture. Birthday wishes were sent from the meeting to Kathleen. She died in September, a few weeks after her\n100\nth birthday.\nSince Kathleen and Andrew Booth worked in close cooperation for almost the whole of their careers, it is difficult to separate their achievements. One very important contribution that Kathleen made was developing assembly language. Rick Bunt said\n(\nsee\n[\n5\n]\n)\n:-\nWhat she was doing, she was doing before there was an industry, before there was an academic field. They were really early pioneers. ... Without assembly language, I think computers would have been much less widely accepted. Assembly languages were the first way that normal people like us were able to start using computers. ... Andrew was a very outgoing figure … where Kathleen was very quiet and kind of worked in the background. So it doesn't surprise me at all that a lot of the credit for their joint accomplishments is given to Andrew. But they would admit they worked together constantly.\nTogether they produced the \"Booth multiplier algorithm\" and the first rotating storage device. Kathleen wrote many influential papers including:\nThe Mechanical Efficiency of Pneumatic Shuttle Propulsion in Looms\n(1954)\n,\n(\nwith A D Booth\n)\nOn magic squares\n(1955)\n,\n(\nwith A D Booth\n)\nAutomatic digital calculators\n(1956)\n,\nVariations in tension of an unwinding thread\n(1957)\n,\nStatistical parsing by computer\n(1960)\n,\n(\nwith I A Harris\n)\nThe effect of elastically reflected electrons on the characteristic of a thermionic diode\n(1961)\n,\n(\nwith D R Cox\n)\nSome systematic supersaturated designs\n(1962)\n,\nAn experiment in mechanical translation\n(1963)\n,\nMachine aided translation with a post-editor\n(1967)\n,\n(\nwith J A Macnaughton\n)\nSASLIP, a simple list processor\n(1973)\n,\n(\nwith I J Booth\n)\nUsing neural nets to identify marine mammals\n(1993)\n,\n(\nwith A D Booth\n)\nThe beginnings of MT\n(2000)\n, and\nMetalanguage\n(2003)\n.\nBirkbeck College has set up a\n[\n4\n]\n:-\n... fully-funded PhD studentship, which recognises the contribution of pioneering computer scientist Dr Kathleen Booth,\n[\nit\n]\nis made possible with support from Google. ... Professor George Roussos, Head of the Department of Computer Science and Information Systems, said: \"We are delighted to offer the Kathleen Booth Anniversary PhD Studentship in Computer Science with support from Google to celebrate Kathleen's contributions and achievements as one of the earliest women computer science pioneers. This award reaffirms our commitment to offer career development opportunities for women in a still highly gender-imbalanced discipline.\"\nBirkbeck has run the Andrew and Kathleen Booth Memorial Lecture each year since\n2015\n."
}