{
  "nome_completo": "Kenkichi Iwasawa",
  "nome_curto": "Kenkichi Iwasawa",
  "ano_nascimento": "1917",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Iwasawa/",
  "lugar_nascimento": "Shinshuku-mura (near Kiryu), Gumma Prefecture, Japan",
  "lugar_morte": "Tokyo, Japan",
  "biografia": "Kenkichi Iwasawa\nattended elementary school in the town of his birth but went to Tokyo for his high school studies which were at the Musashi High School. In\n1937\nhe entered Tokyo University where he was taught by Shokichi\nShokichi Iyanaga\nand Zyoiti\nSuetuna\n. At this time Tokyo University had become a centre for the study of algebraic number theory as a result of Teiji\nTakagi\n's remarkable contributions.\nTakagi\nhad retired in\n1936\n, the year before Iwasawa began his studies, but his students\nIyanaga\nand\nSuetuna\nwere bringing to the university many ideas which they had developed during studies with the leading experts in Europe.\nIwasawa graduated in\n1940\nand remained at Tokyo University to undertake graduate studies. He also was employed as an Assistant in the Mathematics Department. Although the great tradition in number theory at Tokyo inspired him to an interest in that topic, some of his early research contributions were to group theory. The Second World War disrupted life in Japan and essentially ended\nSuetuna\n's research career.\nIyanaga\ndid not fare much better. He wrote:-\n... towards the end of the War, Tokyo and other Japanese cities were often bombarded and we had to find refuge in the countryside. Everyone was mobilised in one way or another for the War.\nClearly Iwasawa found this a most difficult period in which to try to complete work for his doctorate. However, despite the difficulties he succeeded brilliantly, and was awarded the degree of Doctor of Science in\n1945\n. It was not without a high cost, however, for after being awarded his doctorate he became seriously ill with pleurisy and this prevented him returning to the University of Tokyo until April\n1947\n.\nFor a glimpse of the research that Iwasawa undertook at this time we look briefly at the paper\nOn some types of topological groups\nwhich he published in the\nAnnals of Mathematics\nin\n1949\n. Iwasawa's results are related to\nHilbert\n's fifth problem which asks whether any locally Euclidean topological groups is necessarily a\nLie\ngroup. In his\n1949\npaper Iwasawa gives what is now known as the 'Iwasawa decomposition' of a real semisimple\nLie\ngroup. He gave many results concerning\nLie\ngroups, proving in particular that if a locally compact group\nG\nG\nG\nhas a closed normal subgroup\nN\nN\nN\nsuch that\nN\nN\nN\nand\nG\n/\nN\nG/N\nG\n/\nN\nare\nLie\ngroups then\nG\nG\nG\nis a\nLie\ngroup.\nIn\n1950\nIwasawa was invited to give an address at the International Congress of Mathematicians in Cambridge, Massachusetts. He then received an invitation to the Institute for Advanced Study at Princeton and he spent two years there from\n1950\nuntil\n1952\n.\nArtin\nwas at the Institute during Iwasawa's two years there and he was one of the main factors in changing the direction of Iwasawa's research to\nalgebraic number theory\n. In\n1952\nIwasawa published\nTheory of algebraic functions\nin Japanese. The book begins with an historical survey of the theory of algebraic functions of one variable, from analytical, algebraic geometrical, and algebro-arithmetical view points. Iwasawa then studies valuations, fields of algebraic functions giving definitions of prime divisors, ideles, valuation vectors and genus. A proof of the\nRiemann\n-Roch theorem is given, and the theory of\nRiemann\nsurfaces and their topology is studied.\nIt was Iwasawa's intention to return to Japan in\n1952\nafter his visit to the Institute for Advanced Study but when he received the offer of a post of assistant professor at the Massachusetts Institute of Technology he decided to accept it.\nCoates\n, in\n[\n2\n]\n, describes the fundamental ideas which Iwasawa introduced that have had such a fundamental impact on the development of mathematics in the second half of the\n20\nth\ncentury. Iwasawa introduced:-\n... a general method in arithmetical\nalgebraic geometry\n, known today as Iwasawa theory, whose central goal is to seek analogues for algebraic varieties defined over number field of the techniques which have been so successfully applied to varieties defined over finite fields by H\nHasse\n, A\nWeil\n, B Dwork, A\nGrothendieck\n, P\nDeligne\n, and others. ... The dominant theme of his work in number theory is his revolutionary idea that deep and previously inaccessible information about the arithmetic of a finite extension F of Q can be obtained by studying coarser questions about the arithmetic of certain infinite\nGalois\ntowers of number fields lying above F.\nIwasawa first lectured on his revolutionary ideas at the meeting of the\nAmerican Mathematical Society\nin Seattle, Washington in\n1956\n. The ideas were taken up immediately by\nSerre\nwho saw their great potential and gave lectures to the Seminaire Bourbaki in Paris on Iwasawa theory. Iwasawa himself produced a series of deep papers throughout the\n1960\ns which pushed his ideas much further. R Greenberg, who became a student of Iwasawa's in\n1967\nwrote:-\nBy the time that I became his student, Professor Iwasawa had developed his ideas considerably. The theory had become richer, and at the same time, more mysterious. Even though only a few mathematicians had studied the theory thoroughly at that time, there was a general feeling that the theory was very promising. When I look back at the developments that have taken place in the last three decades, that promise has been fulfilled even beyond expectations.\nIn\n1967\nIwasawa left MIT when he was offered the Henry Burchard Fine Chair of Mathematics at Princeton and it was not long after he arrived there that he took on Greenberg as a research student. We learn a lot about Iwasawa if we look at Greenberg's description of how Iwasawa supervised his studies:-\nIt was the tradition at Princeton to have tea every afternoon in fine Hall. This provided one of the best opportunities for graduate students to informally discuss mathematics with their professors. Professor Iwasawa usually came to the afternoon teas. It was then that he often suggested problems for me to think about and every few weeks he would ask me if I had made any progress on some of these problems. I recall that these problems seemed quite hard, but sometimes I was able to report some real progress, and then we would go to his office so that he could hear what I had done. He would help me push some of my ideas forward, but it was quite clear that he wanted me to accomplish as much as I could on my own. I often had the feeling that he was purposely not revealing everything that he knew about a specific problem.\nIn the late\n1960\ns Iwasawa made a conjecture for algebraic number fields which, in some sense, was the analogue of the relationship which\nWeil\nhad found between the zeta function and the divisor class group of an algebraic function field. This conjecture became known as \"the main conjecture on cyclotomic fields\" and it remained one of the most outstanding conjectures in algebraic number theory until it was solved by Mazur and\nWiles\nin\n1984\nusing modular curves.\nIwasawa remained as Henry Burchard Fine Professor of mathematics at Princeton until he retired in\n1986\n. Then he returned to Tokyo where he spent his final years. He published\nLocal class field theory\nin the year that he retired:-\nThis carefully written monograph presents a self-contained and concise account of the modern formal group-theoretic approach to local class field theory.\nIwasawa was much honoured for his achievements. He received the Asahi Prize\n(1959)\n, the Prize of the Academy of Japan\n(1962)\n, the\nCole\nPrize from the\nAmerican Mathematical Society\n(1962)\n, and the Fujiwara Prize\n(1979)\n.\nThe importance of his work is summed up by\nCoates\n[\n2\n]\n:-\n... today it is no exaggeration to say that Iwasawa's ideas have played a pivotal role in many of the finest achievements of modern arithmetical algebraic geometry on such questions as the conjecture of B Birch and H Swinnerton-Dyer on elliptic curve; the conjecture of B Birch,\nJ Tate\n, and S Lichtenbaum on the orders of the K-groups of the rings of integers of number fields; and the work of\nA Wiles\non the modularity of elliptic curves and\nFermat's Last Theorem\n."
}