{
  "nome_completo": "Kenneth Ira Appel",
  "nome_curto": "Kenneth Appel",
  "ano_nascimento": "1932",
  "ano_morte": "2013",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Appel/",
  "lugar_nascimento": "Brooklyn, New York, USA",
  "lugar_morte": "Dover, New Hampshire, USA",
  "biografia": "Kenneth Appel\n's parents were Irwin Appel\n(1903\n-\n1994)\nand Lillian Sender\n(1905\n-\n1987)\n. Irwin Appel was born in Russia but emigrated to the United States. He graduated from Cooper Union for the Advancement of Science and Art in New York City and became an electrical engineer working for the water department. He married Lillian on\n17\nSeptember\n1924\n. She was born in New York and before her marriage had been working there in an office. Neither Irwin nor Lillian had attended College. As well as Kenneth, the subject of this biography, Irwin and Lillian Appel had a daughter Lois who was about five years younger than their son. Kenneth lived the first few years of his life in Brooklyn but was brought up in Queens, New York, where the family moved after\n1935\n.\nAppel was educated in New York. He received a bachelor's degree in mathematics from Queens College in New York in\n1953\n. This College had been established in the Queens district of New York in\n1937\nto provide an affordable, but good quality, education for local students. After graduating, Appel spent a short spell working as an actuary before serving for two years in the US army. He was stationed at the army post of Fort Benning, near Columbus, Georgia, before being sent to Baumholder, Birkenfeld, Rhineland-Palatinate, in Germany. The United States garrison at Baumholder was the largest stationed in Germany during the\n1950\ns. After two years of army service, Appel enrolled in the graduate programme at the University of Michigan in\n1955\n. He was awarded a Master's Degree by Michigan in\n1956\nand then continued to undertake research towards a Ph.D. His thesis advisor was\nRoger Lyndon\nand he was awarded the degree in\n1959\nfor his thesis\nTwo Investigations on the Borderline of Logic and Algebra\n. Also in\n1959\nhis paper\nHorn sentences in identity theory\nappeared and, two years later, the paper\nPartition rings of cyclic groups of odd prime power order\nwas published which formed part of his thesis. Appel writes in\n[\n2\n]\nabout his years as\nLyndon\n's doctoral student:-\nI fondly remember my experiences working as a thesis student in the years\n1957\n-\n59\n. My conversations with\nLyndon\noften took place in the newly established common room, which was supplied with a large coffee percolator. As a \"morning person,\" I would want to discuss my work with\nLyndon\nas soon as he arrived at Angell Hall. It soon became clear to me that no mathematical discussion was possible until he had consumed at least two cups of coffee, so during my last two years of graduate work I was the unofficial coffee preparer for the common room.\nLyndon\nproduces elegant mathematics and thinks in broad and deep ideas. ... I tend to work from the combinatorial aspects of particular problems without thinking of abstract structural considerations. While I was a graduate student, many of my conversations with\nLyndon\nproceeded as follows. I would announce proudly that I could prove a lemma and write it on the blackboard, and he would copy it down. I would then proceed through a detailed if rough hewn proof. When I had finished, he would admit that he had not followed much of what I had said. A day later, working from the statement of my lemma and a few recollections of my methods, he would show me an extremely elegant proof. It often took me quite a while to understand what he had done, and I learned a good bit of mathematics in the process. I have become fascinated with several problems that he has attacked in his papers and the methods he has developed to work on them. This interest has led me to study these problems further and proceed a bit further along the path. Thus he has continued to inspire my work in the more than twenty years since I have left Ann Arbor.\nAnother important event in Appel's life happened while he was a graduate student. During these years he met Carole S Stein who later became his wife\n[\n9\n]\n:-\nDuring Carole's first week of graduate school at the University of Michigan, she met Ken through the outing club. Eight days later, the two shared a canoe, talking about various subjects, including Carole's recent purchase of a season ticket to a classical music concert series. Ken, who was in his fourth year of his Ph.D. studies, also had a ticket, but his seat was in the orchestra, unlike Carole's seat in the balcony. When the two agreed to go to a concert together the following day, Ken gave his seat up to the man who was sitting beside Carole. For the rest of the year, the two sat together - in the balcony. \"It was like him to do that,\" she said. \"When he saw something that was worth doing, he plunged in and did it, and if he thought meeting me was worth it, look, he plunged in and did it.\" That year, Ken's professor gave him a problem to solve for his thesis, a problem that typically takes months to complete. Ken solved the problem over the weekend. \"You need something more difficult,\" Ken's thesis professor told him. He was told to find something that connected logic and algebra and he worked on the problem for months. That same year, once it was complete and Carole received her masters, in\n1959\n, Ken and Carole got married back in Carole's home city of Philadelphia.\nCarole and Kenneth Appel had three children, Andrew Wilson Appel\n(1960\n-\n)\nwho became professor of computer science at Princeton University, Laurel\n(1962\n-\n2013)\nwho became a professor of biology at Wesleyan University, and Peter\n(1964\n-\n)\nwho is Administrator of the US Research and Innovative Technology Administration.\nThree months after he was married, Appel began a two-year appointment with the Institute for Defense Analyses. This institute, which is involved in national security issues, set up the Center for Communications Research in Princeton, New Jersey with the aim of protecting the information and communications of the United States government, and also studying foreign signals intelligence. Appel worked at this Center in Princeton using both his mathematical and computing expertise. In particular he was involved in research on cryptography. Following his two years with the Institute for Defense Analyses in Princeton, Appel was offered a assistant professorship at the University of Illinois at Urbana. Taking up the appointment in\n1961\n, he taught mathematics and undertook research in group theory and computability theory. He published papers over the next few years including:\n(\nwith F M Djorup\n)\nOn the group generated by a free semigroup\n(1964)\n;\n(\nwith Thomas G McLaughlin\n)\nOn properties of regressive sets\n(1965)\n;\nNo recursively enumerable set is the union of finitely many immune retraceable sets\n(1967)\n;\nThere exist two regressive sets whose intersection is not regressive\n(1967)\n; and\n(\nwith E T Parker\n)\nOn unsolvable groups of degree\np\n=\n4\nq\n+\n1\np = 4q + 1\np\n=\n4\nq\n+\n1\n, p and q primes\n(1967)\n.\nOne of the two theorems presented in the last mentioned paper uses a computer to prove that there is no unsolvable transitive permutation group of degree\np\np\np\n=\n29\n,\n53\n,\n149\n,\n173\n,\n269\n,\n293\n, or\n317\nproperly contained in the alternating group of degree\np\np\np\n. This result using computers to prove a mathematical theorem, was a technique that Appel used to great effect as we explain below. In\n[\n3\n]\nhe writes about this group theory result:-\nI believe that the program was correct, but it was not an easy program and was written in assembly language for a machine that was unique. Since the result was negative it was not something that was likely to be independently checked; indeed our hope was to find such groups and we regarded their nonexistence as a disappointment. I cannot believe that most mathematicians could have accepted our announcement as utterly convincing, although later work in the classification of simple groups showed it to be correct.\nAppel is best known, however, for his work with his colleague at the University of Illinois at Urbana, Wolfgang Haken where again he used computers to prove a theorem. Together they solved one of the biggest open problems in mathematics, namely the \"Four Colour Conjecture\".\nFor a history of this conjecture see:\nTHIS LINK\n.\nAppel and Haken published their first step towards a proof with\nThe existence of unavoidable sets of geographically good configurations\nin\n1976\n. They write:-\nA set of configurations is unavoidable if every planar map contains at least one element of the set. A configuration C is called geographically good if whenever a member country M of C has any three neighbours\nN\n1\n,\nN\n2\n,\nN\n3\nN_{1}, N_{2}, N_{3}\nN\n1\n​\n,\nN\n2\n​\n,\nN\n3\n​\nwhich are not members of C then\nN\n1\n,\nN\n2\n,\nN\n3\nN_{1}, N_{2}, N_{3}\nN\n1\n​\n,\nN\n2\n​\n,\nN\n3\n​\nare consecutive\n(\nin some order\n)\nabout M. The main result is a constructive proof that there exist finite unavoidable sets of geographically good configurations. This result is the first step in an investigation of an approach towards the four colour conjecture.\nThey announced that they had a proof of the Four Colour Theorem in\nEvery planar map is four colorable\n(1976)\n. Frank Bernhart begins a review of the paper as follows:-\nThis is an announcement of a proof of the 'four colour conjecture'\n(\nto appear in two parts in Illinois J. Math.\n)\n. The reviewer has seen and studied this proof in the form of a technical report, though not exhaustively. Nearly every year there is a spate of alleged 'four colour conjecture' proofs. A few of them require careful and lengthy scrutiny. Except for the proof announced here, none of them appears to survive technical examination. What makes the claim of Appel and Haken more convincing? One reason is simply that the approach is different. There is no special trick of induction, and no unfamiliar equivalent form of the 'four colour conjecture'. There is no surprise attack from algebra. Rather, the proof hinges on several complex elaborations of the classical approach through reducible configurations. The difficulties that arise are largely computational. In fact,\n1200\nhours of computer time were used for reductions.\nThe proof appeared in two papers, each with substantial microfiche supplements, in\n1977\n, namely\nEvery planar map is four colorable. I. Discharging\nand\nEvery planar map is four colorable. II. Reducibility\n. Although much of the proof was verified by computer calculations, nevertheless Appel enlisted help from his children to check that the diagrams displayed in the papers corresponded to the computer printouts\n[\n7\n]\n:-\nAppel's son, Andrew, said his sister, Laurel, found some\n800\nmistakes, most of which she could fix herself.\nThe proof was published in\n1989\nby Appel and Haken in the form of a book with title\nEvery planar map is four colorable\n. This presented their proof without the microfiche supplements. Frank Bernhart reviewed the book and begins his review as follows:-\nThe confirmation of the Four Colour Conjecture stands out as a major mathematical achievement in our time. It is a distinct pleasure to have the\n1977\nproof and the microfiche supplement brought together in a book, which replaces and updates the original. Missing\n(\nof course!\n)\nis the computer-assisted proof of reducibility for a host of configurations. Nearly fifteen hundred are required, most of them not previously published. Verifying the new reductions consumed over\n1100\nhours of time on three computers at the University of Illinois. There are oft-heard objections to the validity of such a proof. But where a very long, dull computation is called for, surely mechanical aids shorten the time and enhance the accuracy - recall the celebrated hand calculation of  to\n707\ndecimal places, in which only\n526\nwere correct. That error was undetected for seventy years. In recent years we have computer-assisted factoring of large integers, and the nonexistence of a projective plane of order ten. In the Four Colour Conjecture case, the basic technique is over sixty years old, and specific programs that embody it can be checked in a number of ways, to give weight to certification.\nFor their remarkable achievement, Appel and Haken were awarded the Delbert Ray Fulkerson prize by the\nAmerican Mathematical Society\nand the Mathematical Programming Society in\n1979\n.\nIn\n1993\nAppel left the University of Illinois and moved to New Hampshire when he was appointed as the Chairman of the Mathematics Department at the University of New Hampshire. Carole Appel explained in\n[\n9\n]\nhow this move came about:-\nCarole said a single phone call from her brother on the Fourth of July pushed them to move back to the East Coast. Carole's second grandson had just been born and her brother called to brag about the \"cutest little baby\" sitting on his lap. \"I hung up the phone and I said to Ken, 'We have to leave. My brother gets to see my grandchildren every few weeks and I see them twice a year,'\" Carole said, adding she was jealous. Carole and Ken immediately began looking for jobs out East. Ken called Carole at work after he found an ad in a mathematics journal for an opening for a department head at the University of New Hampshire. He asked if she would be interested in moving to the Granite State. Carole said as long as she could get The New York Times on the same day it was published, she would go. Driving into Dover in May of\n1993\n, looking at the sailboats on the Great Bay and the shores of Southern Maine, Carole said she knew she wanted Ken to get the job. Ken formally accepted the position of chair of the math department in June\n1993\nand the two of them settled in their new home in Dover.\nHe retired in\n2003\nand was made professor emeritus at that time. Retirement did not end Appel's involvement with teaching mathematics, however, for he was keen to participate in mathematics enrichment programmes in Dover schools and other southern Maine schools. As part of this voluntary work he worked with students of all levels and abilities but he got the most satisfaction working with the gifted students\n[\n14\n]\n:-\nHe felt that all students, at any level, deserved to be working at the level they are able to work at and not be restricted by what grade they are in and also not to have to skip a grade because they should be able to stay with their age group and socialize with their age group and not go to college at\n16\n.\nHe also served on the Dover School Board and for a time was the treasurer of the Strafford County Democratic Party.\nAppel's hobbies included playing tennis, collecting stamps, playing Go, and baking bread. In\n[\n14\n]\n(\nsee also\n[\n7\n]\n)\nthere is a quote from Kevin Short, who was his colleague at the University of New Hampshire. Short described Appel as \"an incredibly humble man\":-\nOne of the things he prided himself on was trying to help other faculty members in general, but in particular, young faculty members, to get them started in a research career.\nIn October\n2012\nAppel was diagnosed with esophageal cancer. He died in April\n2013\na month after the death of his daughter Laurel. After a funeral at Tasker Funeral Home in Dover on\n22\nApril\n2013\n, he was buried at Pine Hill Cemetery."
}