{
  "nome_completo": "Kollagunta Gopalaiyer Ramanathan",
  "nome_curto": "Kollagunta Ramanathan",
  "ano_nascimento": "1920",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramanathan/",
  "lugar_nascimento": "Hyderabad, India",
  "lugar_morte": "Bombay, (now Mumbai) India",
  "biografia": "Kollagunta Ramanathan\nwas born and brought up in Hyderabad the capital of Andhra Pradesh state, in southern India. He attended Osmania University, which had been established in Hyderabad in\n1918\n, named after Osman Ali the ruler of Hyderabad who patronized its founding. Ramanathan obtained his B.A. from Osmania University, then went to the University of Madras to take a Master's Degree. After completing work for his M.A. he remained at the University of Madras where he undertook research in number theory and did some teaching.\nHe began publishing papers in\n1941\nwhen\nOn Demlo numbers\nappeared in print. The problem he investigated in this paper was that of describing the digits of the product of two factors in terms of the digits of the factors. The paper examines some special cases. Further papers were\nCongruence properties of s\n(\nn\n)\n, the sum of the divisors of n\n(1943)\n,\nMultiplicative arithmetic functions\n(1943)\n,\nCongruence peoperties of\nσ\na\n(\nn\n)\n\\sigma_{a}(n)\nσ\na\n​\n(\nn\n)\n(1945)\n,\nSome applications of Ramanujan's trigonometrical sum\nC\nm\n(\nn\n)\nC_{m}(n)\nC\nm\n​\n(\nn\n)\n(1944)\nand\nCongruence properties of Ramanujan's function\nt\n(\nn\n)\nt(n)\nt\n(\nn\n)\n(1945)\n. Reviewing this last paper,\nDerrick Lehmer\nwrites:-\nThis paper is concerned with a sum which is, in fact, the sum of the nth powers of the primitive mth roots of unity. The author points out its connection with partitions\nm\nm\nm\n, the sum in question being the excess of the number of partitions of\nn\nn\nn\ninto an even number of incongruent parts modulo\nm\nm\nm\nover those into an odd number of such parts. Simple proofs are given of a number of known theorems, such as the one that asserts that the product of\n2\nsin\n⁡\nπ\n(\nn\n/\nm\n)\n2\\sin \\pi( n/m)\n2\nsin\nπ\n(\nn\n/\nm\n)\ntaken over all\nn\nn\nn\nless than and prime to\nm\nm\nm\nhas the value\np\np\np\nor\n1\naccording as\nm\nm\nm\nis or is not a power of the prime\np\np\np\n.\nThe turning point in his career came when he went to the Institute for Advanced Study at Princeton. There he undertook further study and also was employed as an assistant to\nHermann Weyl\n. At Princeton Ramanathan undertook research for a doctorate advised by\nEmil Artin\n. He was also heavily influenvced by\nCarl Siegel\nand much of the research he undertook in the years following his stay at Princeton was influenced by\nSiegel\n's mathematics. He submitted his doctoral thesis\nThe Theory of Units of Quadratic and Hermitian Forms\nin\n1951\nand was awarded the degree for this work in which, among other things, he studied properties unit groups such as their finite generation and the finiteness of their covolume. After this he returned to India where he worked at the Tata Institute of Fundamental Research in Bombay from\n1951\nonwards. After a series of papers published in North American journals such as\nIdentities and congruences of  Ramanujan type\n(1950)\n,\nThe Theory of Units of Quadratic and Hermitian Forms\n(1951)\n,\nAbelian quadratic forms\n(1952)\n, and\nUnits of quadratic forms\n(1952)\n, he returned to publishing his research in Indian journals. For example he published\nA note on symplectic complements\n(1954)\n,\nThe Riemann sphere in matrix spaces\n(1955)\nand\nQuadratic forms over involutorial division algebras\n(1956)\nin the\nJournal\nof the\nIndian Mathematical Society\n.\nRamanathan built up a strong school of number theory at the Tata Institute of Fundamental Research. Raghavan writes\n[\n2\n]\n:-\nHis abiding enthusiasm for the propagation of good mathematics and the spread of wholesome mathematical culture has been much instrumental in the moulding and flowering of several fine mathematicians and in the betterment of teaching and pursuit of research in Mathematics in many of our universities.\nThe work of\nRamanujan\nmotivated a number of Ramanathan's early papers and later in his career he began to study his unpublished contributions\n[\n2\n]\n:-\nFor several years, Professor Ramanathan had been actively interested in the study of published and unpublished work of\nSrinivasa Ramanujan\n, expounding, elucidating and extending\nRamanujan\n's beautiful work on singular values of certain modular functions,\nRogers\n-\nRamanujan\ncontinued fractions\nand\nhypergeometric series\n. Many mathematicians in the West had made a tremendous advance in respect of many aspects of\nRamanujan\n's unpublished work. In the light of the mathematical prospects so unveiled, he strongly urged many colleagues in India to take seriously to this fascinating domain, even if such activity might be cold-shouldered by \"peers\" from within.\nA biography of\nRamanujan\n, as well as descriptions of some topics to illustrate\nRamanujan\n's contributions, are given in\nRamanujan's Notebooks\n(1987)\n. An example of a paper motivated by his study of\nRamanujan\n's work is\nHypergeometric series and continued fractions\n(1987)\n.\nR A Askey\nwrites in a review:-\nWhen trying to understand, or to obtain a continued fraction expansion, or when trying to evaluate a continued fraction, one natural method is to look at the three-term recurrence relation that generates the continued fraction and try to find hypergeometric functions whose contiguous relations contain the recurrence relation, or try to find three-term contiguous relations which are then used to generate continued fractions. This is done for some of\nRamanujan\n's continued fractions ... Once this is done, there is almost surely a basic hypergeometric extension.\nHeine\nstarted the systematic search for such hypergeometric functions. The author extends much of the work mentioned above to basic hypergeometric series. The resulting continued fractions have many important special cases, including some found by\nEisenstein\n,\nHeine\n,\nRogers\n,\nRamanujan\n,\nSelberg\n,\nAndrews\nand others.\nAnother fascinating paper is\nRamanujan's modular equations\n(1990)\n. B D C Berndt writes:-\nThe present author commences with a very informative historical survey of modular equations. ...  Of course, in a paper of only\n18\npages in length, the author can only discuss a small portion of\nRamanujan\n's modular equations and he concentrates therefore on equations of composite degree. He gives some proofs, shows connections to previous work, and offers insights into how\nRamanujan\nmay have discovered some of his equations. ...\nFor most of his life his health had been smewhat poor and he developed serious illnesses in the last few years of his life following his retirement from the Tata Institute in December\n1985\n. He underwent cerebral surgery and suffereed from Parkinson's disease.\nRamanathan received many honours. He was elected a Fellow of the Indian National Science Academy and of the\nIndian Academy of Sciences\n. In addition he was a Founder Fellow of the Maharashtra Academy of Sciences. He received a number of prizes including the Shanti Swarup Bhatnagar Prize, the Jawaharlal Nehru Fellowship, the Indian National Science Academy's Homi Bhabha Medal and the Padma Bhushan. He was a strong supported of the\nIndian Mathematical Society\nand served a term as its President. He was also Life President of the Bombay Mathematical Colloquium. He served the mathematical community in his role as editor of the\nJournal\nof the\nIndian Mathematical Society\nfor more than\n10\nyears, and in addition he was a member of the Editorial Board for\nActa Arithmetica\nfor around thirty years.\nAs to his character we quote from\n[\n2\n]\n:-\nHis interests in English, Telugu and Tamil literature with his unfailing knack for pulling out apt quotations were just as remarkable as his erudition in music. A good conversationalist, he had been heard to remark a couple of times in his later years that the reason for his company being sought was probably that he was considered to be \"well-rounded\"! However, his occasional quips could have put off a few. He shunned publicity as much as he abhorred those who craved for power and ephemeral glory through the media; those who happened to know him somewhat closely could not have failed to note his simplicity and inner humility.\nWe end this biography by quoting from the K G Ramanathan Memorial Issue of the\nProceedings\nof the\nIndian Academy of Sciences\nwhich was published in February\n1994\n:-\nProfessor K G Ramanathan was small of build but had a big influence on the post-independence Indian mathematical scene. Despite the legacy of the legendary\nSrinivasa Ramanujan\nand several other mathematicians of high standing early in this century, pursuit of mathematics had remained rather weak in Indian till the fifties. He was one of the few people responsible for the fortification which has put India firmly back on the international mathematical map. He not only was himself a front-ranking mathematician of international reputation, but also contributed a great deal to the emergence of a strong mathematical base at the Tata Institute of Fundamental Research as also to the overall development of research and teaching of mathematics in India and, to an extent, even beyond our shores. He was well recognized for his achievements in Number Theory, especially the analytic and arithmetic theory of quadratic forms over division algebras with involution."
}