{
  "nome_completo": "Kristen Nygaard",
  "nome_curto": "Kristen Nygaard",
  "ano_nascimento": "1926",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nygaard/",
  "lugar_nascimento": "Oslo, Norway",
  "lugar_morte": "Oslo, Norway",
  "biografia": "Kristen Nygaard\n's father, William Martin Nygaard, was born in Kristiania\n(\ncalled Christiania from\n1624\nto\n1878\nand then Oslo after\n1924)\non\n14\nOctober\n1893\n. William Nygaard taught at a high school in Voss, was a literary consultant and instructor at the National Theatre in Bergen, then was programme secretary for Norwegian National Broadcasting. He married Dina Serine Aasen, a schoolteacher, on\n25\nMarch\n1926\nin Oslo. Dina\n(\nborn\n28\nNovember\n1906\nin Nedre Eiker\n)\nwas the daughter of the farmer Haakon Aasen and his wife Anna Idsoe. Kristen was the oldest of his parents' four children who were all born in Oslo, the others being Haakon Aasen Nygaard\n(\nborn\n29\nMarch\n1931)\n, Svein Sophus Nygaard\n(\nborn\n19\nJune\n1935)\nand Sonja Nygaard\n(\nborn\n18\nApril\n1945)\n.\nKristen attended Fagerborg high school, Pilestredet, Oslo. Of course these were difficult years due to World War II, and he later recounted many war-time stories from this period. At first the country declared itself neutral. However, the Germans invaded Norway on\n9\nApril\n1940\n, bombs were dropped in the Oslo area, and the Norwegian authorities fled from the city. Resistance took place until\n10\nJune\n1940\nwhen Norway surrendered and the Germans took control. Teachers were required to sign a declaration of loyalty to the Nazis and promise they would teach Nazi ideology. The teachers resisted the Nazi moves. Teaching stopped but restarted in the autumn of\n1940\n. During\n1942\nthere were mass arrests of teachers but schools continued to operate. Nygaard graduated from Fagerborg high school in\n1945\n. He then studied science at the University of Oslo where his main interest was first in astronomy, and later in applied mathematics. In\n1948\nhe took up a full-time appointment with the Norwegian Defence Research Establishment. He writes that he\n[\n3\n]\n:-\n.... started his conscript service at the Norwegian Defence Research Establishment in\n1948\nas assistant to Jan V Garwick - the father of computer science in Norway. Their first main task was to carry out resonance absorption calculations related to the construction of Norway's first nuclear reactor. After extensive work had been invested in a traditional numerical approach, Monte Carlo simulation methods\n(\nby \"hand\"\n)\nwere successfully introduced instead in\n1949\n-\n1950\n.\n[\nI\n]\nheaded the \"computing office\" until mid\n1952\n, and then became a full time\noperational research\nworker.\nNygaard married Johanna Ur in Oslo on\n27\nJanuary\n1951\n. Johanna, who was born in Ardal in Ryfylke on\n13\nDecember\n1924\n, was the daughter of the farmer Bertel Ur and his wife Otelie Lunde. Kristen and Johanna Nygaard had three children including twins, a son and daughter born on\n16\nMay\n1951\nin Oslo.\nWe have seen in the quote above that Nygaard was using Monte Carlo methods in his work for the Norwegian Defence Research Establishment. In\n1952\nhe published\nOn the solution of integral equations by Monte-Carlo methods\nas a Norwegian Defence Research Establishment Report. Four years later he was awarded a Master's Degree by the University of Oslo for a thesis\nTheoretical Aspects of Monte Carlo Methods\n. In\n1959\nhe was cofounder of the Norwegian Operational Research Society and became its first chairman, holding the position until\n1964\n. In\n1960\nhe changed his employment\n[\n3\n]\n:-\nIn May\n1960\n[\nI\n]\nleft the Norwegian Defence Research Establishment to build up the Norwegian Computing Centre as a research institute in computer science, operational research and related fields. Many of the civilian tasks turned out to present the same kind of methodological problems: the necessity of using simulation, the need of concepts and a language for system description, lack of tools for generating simulation programs. This experience was the direct stimulus for the ideas which in\n1961\ninitiated the SIMULA development.\nSIMULA, which Nygaard refers to in this quotation, is the object-oriented programming language of which he was the co-inventor. It is the achievement for which he is today most famed. He wrote a letter on\n5\nJanuary\n1961\nto the operational research expert Charles Salzmann explaining where his thinking was on the development of the language\n[\n3\n]\n:-\nThe status of the Simulation Language\n(\nMonte Carlo Compiler\n)\nis that I have rather clear ideas on how to describe queueing systems, and have developed concepts which I feel allow a reasonably easy description of large classes of situations. I believe that these results have some interest even isolated from the compiler, since the presently used ways of describing such systems are not very satisfactory. I hope that later developments, for which I have a number of ideas, will include e.g. stochastic inventory situations amongst the situations which may be described by the language. The work on the compiler could not start before the language was fairly well developed, but this stage seems now to have been reached. The expert programmer who is interested in this part of the job will meet me tomorrow. He has been rather optimistic during our previous meetings.\nThe 'expert programmer' that Nygaard referred to in this letter was Ole-Johan Dahl, now recognised as the other co-inventor of SIMULA. Nygaard rose rapidly in the Norwegian Computing Centre, becoming its Director of Research in\n1962\n. In\n1975\nhe was appointed to a professorship at Aarhus University, Denmark. One year later he returned to Norway when he was appointed as a professor at Oslo University. The appointment was part-time until\n1984\nwhen it became a full-time appointment. He remained in this post until he retired in\n1996\n, although he did spend time at other institutions such as Stanford University, Palo Alto, USA in\n1987\n. Also while in the United States in\n1987\nhe was a Visiting Scientist at Xerox PARC in Palo Alto, and a consultant at Apple Computer's Advanced Technology Group where he also gave lectures.\nIf we ended this biography here we would get a totally false impression of Nygaard for he would simply come across as a brilliant computer scientist and mathematician. Certainly he was exactly that, but much more\n[\n2\n]\n:-\nIn the\n1970\n's, Nygaard's research interests increasingly turned to the impact of technology on the labour movement, and he became involved in other political, social and environmental issues. He was the first chairman of the environment protection committee of the Norwegian Association for the Protection of Nature. He was also the Norwegian representative for the Organization for Economic Cooperation and Development's activities on information technology. He also helped run an experimental program to create humane living conditions for alcoholics. In the mid\n1960\n's he became a member of the National Executive Committee of the Norwegian party Venstre, a left-wing non-socialist party, and chairman of that party's strategy committee. In\n1988\nhe became chairman of a group that successfully opposed Norway's membership in the European Union.\nEven after Norway voted \"no\" to the European Union in a referendum on\n28\nNovember\n1994\n, Nygaard did not give up opposing the European Union. He worked hard during\n1996\nto establish The European Anti-Maastricht Movement which was to bring together those inside and outside the European Union opposed to the Maastricht Treaty and Economic and Monetary Union.\nHe received many honours for his remarkable contributions with the introduction of SIMULA. For example he was awarded the\nNorbert Wiener\nPrize in October\n1990\nfrom the American Association of Computer Professionals for Social Responsibility.\nComputerworld\npresented him with a prize in\n1992\nfor:-\n... having made Norway known internationally in the information technology field.\nIn\n1999\nthe co-inventors of SIMULA, Nygaard and Dahl, were awarded the Rosing Prize by the Norwegian Data Association:-\n...  for exceptional professional achievements.\nThe Object Management Group awarded Nygaard an Honorary Fellowship for:-\n... his originating of object technology concepts.\nNygaard and Dahl received the\nA M Turing\nAward for\n2001\nby the Association for Computing Machinery:-\nFor ideas fundamental to the emergence of object oriented programming, through their design of the programming languages Simula I and Simula\n67\n.\nThe Association for Computing Machinery gave this appreciation of the contributions of Nygaard and Dahl:-\nTheir work has led to a fundamental change in how software systems are designed and programmed, resulting in reusable, reliable, scalable applications that have streamlined the process of writing software code and facilitated software programming. Current object-oriented programming languages include C++ and Java. They are both widely used in programming a wide range of applications from large-scale distributed systems to small, personal applications, including personal computers, home entertainment devices, and standalone arcade applications. The\nA M Turing\nAward carries a $\n25\n,\n000\nprize. The discrete event simulation language\n(\nSimula I\n)\nand general programming language\n(\nSimula\n67)\ndeveloped by Dahl and Nygaard at the Norwegian Computing Centre in Oslo, Norway in the\n1960\n's, led the way for software programmers to build software systems in layers of abstraction. With this approach, each layer of a system relies on a platform implemented by the lower layers. Their approach has resulted in programming that is both accessible and available to the entire research community.\nAlso in\n2001\nthe two co-inventors received the\nJohn von Neumann\nMedal, awarded by the Institute of Electrical and Electronic Engineers:-\nFor the introduction of the concepts underlying object-oriented programming through the design and implementation of SIMULA\n67\n.\nHe also received honorary doctorates from Lund University, Sweden\n(\nJune\n1990)\nand Aalborg University, Denmark\n(\nJune\n1991)\n. In August\n2000\n, he was made a Commander of the Order of Saint Olav by King Harald V of Norway.\nNygaard died after suffering a heart attack while spending the weekend at his family's holiday home at Tjome."
}