{
  "nome_completo": "Kurt Gödel",
  "nome_curto": "Kurt Gödel",
  "ano_nascimento": "1906",
  "ano_morte": "1978",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Godel/",
  "lugar_nascimento": "Brünn, Austria-Hungary (now Brno, Czech Republic)",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Kurt Gödel\n's father was Rudolf Gödel whose family were from Vienna. Rudolf did not take his academic studies far as a young man, but had done well for himself becoming managing director and part owner of a major textile firm in Brünn. Kurt's mother, Marianne Handschuh, was from the Rhineland and the daughter of Gustav Handschuh who was also involved with textiles in Brünn. Rudolf was\n14\nyears older than Marianne who, unlike Rudolf, had a literary education and had undertaken part of her school studies in France. Rudolf and Marianne Gödel had two children, both boys. The elder they named Rudolf after his father, and the younger was Kurt.\nKurt had quite a happy childhood. He was very devoted to his mother but seemed rather timid and troubled when his mother was not in the home. He had rheumatic fever when he was six years old, but after he recovered life went on much as before. However, when he was eight years old be began to read medical books about the illness he had suffered from, and learnt that a weak heart was a possible complication. Although there is no evidence that he did have a weak heart, Kurt became convinced that he did, and concern for his health became an everyday worry for him.\nKurt attended school in Brünn, completing his school studies in\n1923\n. His brother Rudolf said:-\nEven in High School my brother was somewhat more one-sided than me and to the astonishment of his teachers and fellow pupils had mastered university mathematics by his final\nGymnasium\nyears. ... Mathematics and languages ranked well above literature and history. At the time it was rumoured that in the whole of his time at High School not only was his work in Latin always given the top marks but that he had made not a single grammatical error.\nGödel entered the University of Vienna in\n1923\nstill without having made a definite decision whether he wanted to specialise in mathematics or theoretical physics. He was taught by\nFurtwängler\n,\nHahn\n,\nWirtinger\n,\nMenger\n,\nHelly\nand others. The lectures by\nFurtwängler\nmade the most impact on Gödel and because of them he decided to take mathematics as his main subject. There were two reasons:\nFurtwängler\nwas an outstanding mathematician and teacher, but in addition he was paralysed from the neck down so lectured from a wheel chair with an assistant who wrote on the board. This would make a big impact on any student, but on Gödel who was very conscious of his own health, it had a major influence. As an undergraduate Gödel took part in a seminar run by Schlick which studied\nRussell\n's book\nIntroduction to mathematical philosophy\n.\nOlga Taussky-Todd\n, a fellow student of Gödel's, wrote:-\nIt became slowly obvious that he would stick with logic, that he was to be\nHahn\n's student and not Schlick's, that he was incredibly talented. His help was much in demand.\nHe completed his doctoral dissertation under\nHahn\n's supervision in\n1929\nsubmitting a thesis proving the completeness of the first order functional calculus. He became a member of the faculty of the University of Vienna in\n1930\n, where he belonged to the school of logical positivism until\n1938\n. Gödel's father died in\n1929\nand, having had a successful business, the family were left financially secure. After the death of her husband, Gödel's mother purchased a large flat in Vienna and both her sons lived in it with her. By this time Gödel's older brother was a successful radiologist. We mentioned above that Gödel's mother had a literary education and she was now able to enjoy the culture of Vienna, particularly the theatre accompanied by Rudolf and Kurt.\nGödel is best known for his proof of \"Gödel's Incompleteness Theorems\". In\n1931\nhe published these results in\nÜber formal unentscheidbare Sätze der Principia Mathematica und verwandter Systeme\nⓉ\n(\nOn formally undecidable propositions of 'Principia Mathematica' and related systems\n)\n.\nSee\nTHIS LINK\n.\nHe proved fundamental results about axiomatic systems, showing in any axiomatic mathematical system there are propositions that cannot be proved or disproved within the axioms of the system. In particular the consistency of the axioms cannot be proved. This ended a hundred years of attempts to establish axioms which would put the whole of mathematics on an axiomatic basis. One major attempt had been by\nBertrand Russell\nwith\nPrincipia Mathematica\n(1910\n-\n13)\n. Another was\nHilbert\n's formalism which was dealt a severe blow by Gödel's results. The theorem did not destroy the fundamental idea of formalism, but it did demonstrate that any system would have to be more comprehensive than that envisaged by\nHilbert\n. Gödel's results were a landmark in\n20\nth\n-century mathematics, showing that mathematics is not a finished object, as had been believed. It also implies that a computer can never be programmed to answer all mathematical questions.\nGödel met\nZermelo\nin Bad Elster in\n1931\n.\nOlga Taussky-Todd\n, who was at the same meeting, wrote:-\nThe trouble with\nZermelo\nwas that he felt he had already achieved Gödel's most admired result himself.\nScholz\nseemed to think that this was in fact the case, but he had not announced it and perhaps would never have done so. ... The peaceful meeting between\nZermelo\nand Gödel at Bad Elster was not the start of a scientific friendship between two logicians.\nSubmitting his paper on incompleteness to the University of Vienna for his\nhabilitation\n, this was accepted by\nHahn\non\n1\nDecember\n1932\n. Gödel became a Privatdozent at the University of Vienna in March\n1933\n.\nNow\n1933\nwas the year that Hitler came to power. At first this had no effect on Gödel's life in Vienna; he had little interest in politics. In\n1934\nGödel gave a series of lectures at Princeton entitled\nOn undecidable propositions of formal mathematical systems\n. At\nVeblen\n's suggestion\nKleene\n, who had just completed his Ph.D. thesis at Princeton, took notes of these lectures which have been subsequently published. However, Gödel suffered a nervous breakdown as he arrived back in Europe and telephoned his brother Rudolf from Paris to say he was ill. He was treated by a psychiatrist and spent several months in a sanatorium recovering from depression.\nDespite the health problems, Gödel's research was progressing well and he proved important results on the consistency of the\naxiom of choice\nwith the other axioms of set theory in\n1935\n. However after Schlick, whose seminar had aroused Gödel's interest in logic, was murdered by a National Socialist student in\n1936\n, Gödel was much affected and had another breakdown. His brother Rudolf wrote:-\nThis event was surely the reason why my brother went through a severe nervous crisis for some time, which was of course of great concern, above all for my mother. Soon after his recovery he received the first call to a Guest Professorship in the USA.\nHe visited Göttingen in the summer of\n1938\n, lecturing there on his set theory research. He returned to Vienna and married Adele Porkert in the autumn of\n1938\n. In fact he had met her in\n1927\nin Der Nachtfalter night club in Vienna. She was six years older than Gödel and had been married before and both his parents, but particularly his father, objected to the idea that they marry. She was not the first girl that Gödel's parents had objected to, the first he had met around the time he went to university was ten years older than him.\nIn March\n1938\nAustria had became part of Germany but Gödel was not much interested and carried on his life much as normal. He visited Princeton for the second time, spending the first term of session\n1938\n-\n39\nat the Institute for Advanced Study. The second term of that academic year he gave a beautiful lecture course at Notre Dame. Most who held the title of\nprivatdozent\nin Austria became paid lecturers after the country became part of Germany but Gödel did not and his application made on\n25\nSeptember\n1939\nwas given an unenthusiastic response. It seems that he was thought to be Jewish, but in fact this was entirely wrong, although he did have many Jewish friends. Others also mistook him for a Jew, and he was once attacked by a gang of youths, believing him to be a Jew, while out walking with his wife in Vienna.\nWhen the war started Gödel feared that he might be conscripted into the German army. Of course he was also convinced that he was in far too poor health to serve in the army, but if he could be mistaken for a Jew he might be mistaken for a healthy man. He was not prepared to risk this, and after lengthy negotiation to obtain a U.S. visa he was fortunate to be able to return to the United States, although he had to travel via Russia and Japan to do so. His wife accompanied him.\nIn\n1940\nGödel arrived in the United States, becoming a U.S. citizen in\n1948\n(\nin fact he believed he had found an inconsistency in the United States Constitution, but the judge had more sense than to listen during his interview!\n)\n. He was an ordinary member of the Institute for Advanced Study from\n1940\nto\n1946\n(\nholding year long appointments which were renewed every year\n)\n, then he was a permanent member until\n1953\n. He held a chair at Princeton from\n1953\nuntil his death, holding a contract which explicitly stated that he had no lecturing duties. One of Gödel's closest friends at Princeton was\nEinstein\n. They each had a high regard for the other and they spoke frequently. It is unclear how much\nEinstein\ninfluenced Gödel to work on relativity, but he did indeed contribute to that subject.\nHe received the\nEinstein\nAward in\n1951\n, and National Medal of Science in\n1974\n. He was a member of the\nNational Academy of Sciences\nof the United States, a fellow of the\nRoyal Society\n, a member of the Institute of France, a fellow of the British Academy and an Honorary Member of the\nLondon Mathematical Society\n. However, it says much about his feelings towards Austria that he refused membership of the Academy of Sciences in Vienna, then later when he was elected to honorary membership he again refused the honour. He also refused to accept the highest National Medal for scientific and artistic achievement that Austria offered him. He certainly felt bitter at his own treatment but equally so about that of his family.\nGödel's mother had left Vienna before he did, for in\n1937\nshe returned to her villa in Brno where she was openly critical of the National Socialist regime. Gödel's brother Rudolf had remained in Vienna but by\n1944\nboth expected German defeat, and Rudolf's mother joined him in Vienna. In terms of the treaty negotiated after the war between the Austrians and the Czechs, she received one tenth of the value for her villa in Brno. It was an injustice which infuriated Gödel; in fact he always took such injustices as personal even although large numbers suffered in the same way.\nAfter settling in the United States, Gödel again produced work of the greatest importance. His masterpiece\nConsistency of the axiom of choice and of the generalized\ncontinuum-hypothesis\nwith the axioms of set theory\n(1940)\nis a classic of modern mathematics. In this he proved that if an axiomatic system of set theory of the type proposed by\nRussell\nand\nWhitehead\nin\nPrincipia Mathematica\nis consistent, then it will remain so when the axiom of choice and the generalized continuum-hypothesis are added to the system. This did not prove that these axioms were independent of the other axioms of set theory, but when this was finally established by\nCohen\nin\n1963\nhe built on these ideas of Gödel.\nConcerns with his health became increasingly worrying to Gödel as the years went by. Rudolf, Gödel's brother, was a medical doctor so the medical details given by him in the following will be accurate. He wrote:-\nMy brother had a very individual and fixed opinion about everything and could hardly be convinced otherwise. Unfortunately he believed all his life that he was always right not only in mathematics but also in medicine, so he was a very difficult patient for doctors. After severe bleeding from a duodenal ulcer ... for the rest of his life he kept to an extremely strict\n(\nover strict?\n)\ndiet which caused him slowly to lose weight.\nAdele, Gödel's wife, was a great support to him and she did much to ease the tensions which troubled him. However she herself began to suffer health problems, having two strokes and a major operation. Towards the end of his life Gödel became convinced that he was being poisoned and, refusing to eat to avoid being poisoned, essentially starved himself to death\n[\n3\n]\n:-\nA slight person and very fastidious, Gödel was generally worried about his health and did not travel or lecture widely in later years. He had no doctoral students, but through correspondence and personal contact with the constant succession of visitors to Princeton, many people benefited from his extremely quick and incisive mind. Friend to\nEinstein\n,\nvon Neumann\nand\nMorgenstern\n, he particularly enjoyed philosophical discussion.\nHe died\n[\n18\n]\n:-\n... sitting in a chair in his hospital room at Princeton, in the afternoon of\n14\nJanuary\n1978\n.\nIt would be fair to say that Gödel's ideas have changed the course of mathematics\n[\n3\n]\n:-\n... it seems clear that the fruitfulness of his ideas will continue to stimulate new work. Few mathematicians are granted this kind of immortality."
}