{
  "nome_completo": "Kurt Otto Friedrichs",
  "nome_curto": "Kurt Friedrichs",
  "ano_nascimento": "1901",
  "ano_morte": "1982",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Friedrichs/",
  "lugar_nascimento": "Kiel, Germany",
  "lugar_morte": "New Rochelle, New York, USA",
  "biografia": "Kurt Friedrichs\nwas known as Kurt when he was young but in later life he decided that he disliked the name Kurt because it sounded sharp and he was called\nFrieder.\nHis parents were Karl Friedrichs, who was a lawyer and expert on Civil Service law, and Elisabeth Entel from Silesia. Friedrichs mother was\n[\n6\n]\n:-\n... an exceptionally lovely woman whom the boy Friedrichs adored ...\nwhile his father was:-\n... maddeningly fussy in small matters ... but superb and very wise in the big things ...\nKurt Otto was the middle of his parents three children, having an older sister and a younger brother. He was a timid, very shy, child and this was made worse by heath problems such as asthma which prevented him mixing normally with other children. His problem with asthma lessened as he grew older but always troubled him to some extent.\nThe Friedrichs family were long established in Schleswig-Holstein, and Kurt was born in its capital Kiel. However the family moved when he was very young and by the time he reached school age they had settled in Dusseldorf. Kurt's father became friendly with a fellow lawyer in Dusseldorf who was the brother of\nFelix Klein\n. This friendship would play a role in Kurt's future. He attended the\nRealgymnasium\nin Dusseldorf, solving while there a problem in relativity, then entered the University of Dusseldorf. It was the custom that German students at this time spent periods in several different universities during their degree course. Friedrichs followed this custom and spent a term in Greifswald, a year in Freiburg, and a term in the Austrian university of Graz. In Freiburg he studied philosophy, particularly that of Husseri and Heidegger, and he would retain this interest throughout his life. He was also interested in mathematical physics which he studied at these universities. In\n1922\nhe decided to go the Göttingen to complete his studies, and set out with a letter of introduction from\nFelix Klein\n's lawyer brother. He first met\nKlein\non\n25\nJune\n1922\n, one day after the assassination of the Foreign Minister, Walter Rathenau. He described the meeting in detail in an interview in\n1982\n, see\n[\n7\n]\n, where Friedrichs describes\nKlein\nas having \"grace and charm\" yet being upset by the political events of the previous day.\nLife at Göttingen was quite difficult. Friedrichs lived in a former prisoner-of-war camp and, like the other students, found that conditions due to the high inflation were so bad that students scarcely had enough to eat. Yet the quality of the lecturers was remarkable, and Friedrichs was amazed at the broad mathematical knowledge of\nCarl Ludwig Siegel\nand\nEmil Artin\n. He soon made friends with a fellow student who arrived in the same year, namely\nHans Lewy\n, and the two would collaborate on a number of papers.\nLewy\nwrote that, at this time, Friedrichs\n(\nsee for example\n[\n6\n]\n)\n:-\n... was a very retiring person, not much at ease with himself or the rest of the world. I guess on most people he would have made a negative impression as to his abilities. Oh yes, I was impressed by him; but I was, you see, a student and on the same level with him. But thinking how he would have appeared to a teacher, I think it took keen observation as well as a really intense human interest on\nCourant\n's part to see what was there.\nCourant\nhad just published a book on function theory with\nHurwitz\n(\nHurwitz\nhad died in\n1919\nbut his lectures formed part of the text\n)\n. Friedrichs read the book and later wrote that the\nHurwitz\nchapters were:-\n... very neat, very clear, to the point, you could learn from them ...\n[\nbut\n]\n... the\nCourant\nsection, the third chapter - when I got hold of that chapter, I started reading one morning, I read morning and night without stopping. It was the most breathtaking book I have ever read in mathematics.\nHis first publication appeared in\n1927\non\nEinstein\n's general covariance postulate, and his next, in the same year,  was his doctoral dissertation\nDie Randwert-und Eigenwertprobleme aus der Theorie der elastischen Platten\nⓉ\n(\nThe boundary value and eigenvalue problems in the theory of elastic plates\n)\non the theory of elastic plates. He had written his thesis under\nCourant\n's supervision and he then became\nCourant\n's assistant for two years helping with the\nCourant\n-\nHilbert\nbook. He collaborated with\nLewy\non linear hyperbolic\npartial differential equations\nand they wrote a joint paper in\n1927\n, and another joint paper, with\nCourant\nand\nLewy\n, considered the stability of difference schemes for partial differential equations.\nFriedrichs went to Aachen in\n1929\nto take up a position as assistant to\nTheodore von Kármán\n. It was\nCourant\nwho had set this up and leaving Göttingen was difficult for Friedrichs.\nLewy\nsaid:-\nCourant forced him out into what at the time were unpleasant situations. I remember saying goodbye to Friedrichs at the station when he left for Aachen, and he was in a daze and very unhappy. He was a man, you see, who wouldn't want to change, ... . I think if it had not been for\nCourant\nhe would have become a gymnasium teacher.\nIn\n1929\nFriedrichs returned to Göttingen and presented his\nhabilitation\nthesis there. He was now interested in operators on\nHilbert spaces\nand applied these tools to initial value problem for hyperbolic equations. See\n[\n3\n]\nwhere Friedrichs describes meeting with\nvon Neumann\n, and how\nvon Neumann\n's ideas influenced his own.\nFriedrichs became professor at the Technische Hochschule in Braunschweig in\n1931\n. He said about this time\n(\nsee for example\n[\n6\n]\n:-\nA tremendous teaching load, many hours, and I had never taught the courses before so I had to work from morning to night to prepare them. Yet I have never done scientific work more intensely than during that year. It's a general observation of mine that if you have all the time you want for your scientific research, you just end up consulting a psychiatrist. If you have to fight against obstacles, if you have to fight for your time, you do much better. Unless, of course, it goes too far.\nIn January\n1933\nHitler came to power in Germany. Just days after this Friedrichs met Nellie Bruell, a young Jewish girl, as a ball in Braunschweig. It became increasingly clear that, although Friedrichs was not directly affected by the Nazis laws against Jews, many of his friends and colleagues were directly affected in a very serious way.\nLewy\nhad left Germany as soon as Hitler came to power, and soon\nCourant\nwas dismissed from his post and was forced to emigrate to the United States. Nellie, who was now Friedrichs' girlfriend, was also dismissed from her position as an assistant at the Technische Hochschule. Friedrichs visited\nCourant\nin New York in the summer of\n1935\n, officially to work with him on the second volume of\nCourant\n-\nHilbert\n, but in fact mainly to see if it might be possible for him to emigrate. Of course obtaining positions in the United States was not easy but\nCourant\nsaid he would do everything he could.\nBy the time Friedrichs had returned to Braunschweig, the Nazis had passed laws forbidding marriage between Aryans and non-Aryans. Not only could he now not marry Nellie but he was forbidden to see her. They met infrequently in secret at the house of a friend. He began to make plans to emigrate, but he did not tell even his parents so that they could truthfully say that they were unaware of what he was about to do if questioned after he had left. He used a trick to escape, getting a visa to go to Paris to visit his sister who was living there. Nellie did not have the same problems leaving since her father's home was in Lyon and she held a French passport. She also left Germany and went to Lyon to await instructions from Friedrichs.\nFriedrichs arrived in New York on\n4\nMarch\n1937\n. He had not been allowed to take any money out of Germany but\nCourant\narranged accommodation for him. He said\n(\nsee\n[\n6\n]\n)\n:-\nSo I was his assistant again. I lived in a room near him in New Rochelle.\nHe sent a letter of resignation to the Technische Hochschule in Braunschweig, but went to Princeton to post it so that his whereabouts in the United States could not be traced\n(\nhe was still trying to protect his parents\n)\n.\nCourant\nworked hard to find a post for Friedrichs for he certainly did not have the personality to push himself forward. As soon as he was offered a temporary post that summer at New York University he sent for Nellie to join him and after making a trip to Canada to satisfy certain immigration requirements, they were married in the United States. They had five children between\n1940\nand\n1950\n, Walter, Liska, David, Christopher, and Martin.\nLewy\nsaid:-\nDue to\nCourant\nand to Nellie, his wife - and also due to Hitler probably - Friedrichs really blossomed. He became a different person from what he was as a student.\nFriedrichs published\nOn certain inequalities and characteristic value problems for analytic functions and for functions of two variables\nin the\nTransactions of the American Mathematical Society\nin\n1937\n. He published two papers in the\nProceedings of the National Academy of Sciences\nin\n1939\n:\nThe finite Stieltjes momentum problem\n;  and\nThe non-linear boundary value problem of the buckled plate\n. This second paper gives an exact solution to the problem of the behaviour of a thin circular plate after buckling under a uniform edge force applied in the plane of the plate. Also important in his early work at New York University was his collaboration with James J Stoker. For example they published\nBuckling of the circular plate beyond the critical thrust\nin\n1942\nwhich examines a flat plate subjected to compressive forces at its edges and in its plane. The plate becomes unstable when the compressing forces reach certain critical values, but the forces can be increased considerably beyond this without causing a collapse of the plate.\nIn\n1948\nCourant\nand Friedrichs published the classic work\nSupersonic Flow and Shock Waves\n.\nBers\n, reviewing the book, writes:-\nThe book is written in the clear and vivid style for which the authors are known. Open problems and unresolved difficulties are carefully noted, and the reader is never left in doubt as to whether he is presented with a mathematical theorem or with a conjecture based on physical experience. Numerous excellent drawings, a bibliography of almost\n200\ntitles and a carefully prepared index add to the value of this treatise which is certainly destined to become standard.\nMorawetz\ndescribed the way that the collaboration proceeded:-\nOne or the other of them would take a section from the manual and rewrite it. If\nCourant\ndid it, then it went to Friedrichs. And Friedrichs would look at it and grumble that it wasn't sufficiently exact. He would rewrite it, and it would become all \"ifs\" and \"buts\". Then\nCourant\nwould take it and he would mumble and groan that it was much too complicated. Then he would rewrite it. Then Friedrichs would take it back and say it wasn't precise enough. The process went on many, many times for each section. When it came back to Friedrichs, he would put in again some of what he had had before, but not so much. Then the next time\nCourant\nwouldn't take out so much. They were both pretty determined about what the end product should be, and they were both quite willing to do an awful lot of work. But I never remember a single session where they both sat down together over the manuscript.\nDuring the\n1950\ns Friedrichs wrote five articles on\nMathematical aspects of the quantum theory of fields\nwhich eventually became part of his book with the same title. He writes in the introduction that the work is aimed at:-\n... mathematicians who are familiar with the fundamental concepts of quantum theory of single particles and who would like to learn which mathematical concepts are involved in the simplest problems of field quantum theory.\nHe took a rather different approach to the topic in\nPerturbation of spectra in Hilbert space\npublished in\n1965\n, but based on lectures he gave in\n1960\nat the Summer Seminar on Applied Mathematics held in Boulder.\nAlso of interest is the book\nFrom Pythagoras to Einstein\n(1965)\n.  Friedrichs writes in the Preface:-\nThe present book is not addressed to a well defined group of readers. The first chapter is based on a lecture given to a special mathematics class of the sixth grade. The material of the second chapter belongs to elementary algebra; that of the third, fourth and fifth chapters may be studied by students of the twelfth grade. The subject of the sixth and seventh chapters may be accessible to selected high school seniors, but might just as well be read by college seniors. Knowledge of elementary Euclidean geometry is presupposed, and some familiarity with the basic notions of physics will be helpful.\nFriedrichs received many honours. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1959\nand to the\nAmerican Academy of Arts and Sciences\n. He received many honorary degrees\n(\nAachen, Uppsala, Braunschweig, Columbia, and New York University\n)\n, and received many awards, in particular the Applied Mathematics and Numerical Analysis Award of the National Academy, and the National Medal of Science in\n1976\n:-\n... for bringing the powers of modern mathematics to bear on problems in physics, fluid dynamics and elasticity.\nDuring the last part of his life he travelled extensively to Israel, Japan, India, Africa, and especially back to his native country of Germany. His health began to deteriorate, however, and in particular he became deaf which made life increasingly isolated."
}