{
  "nome_completo": "László Kalmár",
  "nome_curto": "László Kalmár",
  "ano_nascimento": "1905",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kalmar/",
  "lugar_nascimento": "Edde (N of Kaposvar), Hungary",
  "lugar_morte": "Mátraháza, Hungary",
  "biografia": "László Kalmár\n's father was Zsigmond Kalmár and his mother was Rósa Krausz. Zsigmond Kalmár was a bailiff on an estate in Transdanubia in northwestern Hungary, the estate being located about\n30\nkm from Lake Balaton. Zsigmond Kalmár died while László was a young boy and Rósa Kalmár then moved to Budapest with László.\nKalmár began his secondary schooling in Budapest during World War I. He proved an outstanding pupil and was soon working on his own far in advance of his fellow pupils in mathematics. By the time he was thirteen he had read advanced texts such as ones by\nCesàro\n. However, while still at secondary school Kalmár's mother also died so by the time he entered the University of Budapest in\n1922\nhe was an orphan. The tragedy that had hit his young life did not hold him back in his studies of mathematics and physics, however. Again he was in a different league in mathematics from his fellow students who treated him with the reverence which his brilliance deserved.\nAs a student at the University of Budapest Kalmár had teachers who were leading mathematicians so he received teaching which brought him to the cutting edge of research.\nKürschák\nand\nFejér\nwere among these quality teachers. He also had fellow students who also played a role in his development, particularly\nRósa Péter\n. Kalmár would later provide important help to\nPéter\nin her career.\nKalmár graduated in\n1927\nand the direction of his work was influenced when he visited Göttingen in\n1929\n. There he became interested in mathematical logic and this was a field in which he was to make major contributions. After the award of his doctorate in Budapest he took up a post in Szeged.\nAfter World War I the Hungarian government had been forced to sign the Treaty of Trianon on\n4\nJune,\n1920\n. Hungary was left with less than one third of the land that had previously been Hungary. Romania, Czechoslovakia and Yugoslavia all took over large areas but Austria, Poland and Italy also gained land from Hungary. Kolozsvár, which was the site of one of Hungary's major universities, was no longer in Hungary after the Treaty of Trianon but rather it was in Romania and was then renamed Cluj, so the Hungarian University there had to move to within the new Hungarian borders. It moved to Szeged in\n1920\n, where there had previously been no university. The appointment of\nHaar\nand\nRiesz\nresulted in Szeged rapidly becoming a major mathematical centre. At Szeged Kalmár acted at first as a research assistant to both\nHaar\nand\nRiesz\n.\nIn\n1933\nKalmár married Erzsébet Arvay and they had four children. Kalmár was appointed a full professor at Szeged in\n1947\n. He founded at Szeged the first chair for the Foundations of Mathematics and Computer Science anf then became the first to occupy the chair. This was not all he founded at Szeged, for he also set up the Cybernetic Laboratory and the Research Group for Mathematical Logic and Automata Theory.\nHe worked on mathematical logic solving certain cases of the decision problem for the first order predicate calculus, simplified results of\nBernays\n, and worked on ideas of\nPost\n,\nGödel\nand\nChurch\n. He was acknowledged as the leader of Hungarian mathematical logic.\nKalmár was also involved in theoretical computer science and promoted the development of computer science and the use of computers in Hungary. His special fields of interest in computer science included programming languages, automatic error correction, non-numerical applications of computers and the connection between computer science and mathematical logic.\nFor his outstanding contributions to mathematics and computer science Kalmár received many honours. He was elected to the\nHungarian Academy of Sciences\nin\n1949\n, becoming a full member in\n1961\n. He received awards such as the Kossuth Prize in\n1950\nand the Hungarian State Prize in\n1975\n. These were the highest honours which his country could bestow on him. He was also elected to honorary positions such as honorary president of the\nJanos Bolyai Mathematical Society\nand the\nJohn von Neumann\nSociety for Computer Science.\nAdam, in\n[\n1\n]\n, writes:-\nKalmár's scholarly personality was vivid and well rounded. ... He was enthusiastically inclined towards various sorts of personal contacts in his profession: regular teaching of university students, informal discussions with colleagues, lectures to general audiences.\nHis most important lasting contribution to Hungarian science for which he will be remembered most will be\n[\n1\n]\n:-\n... his ceaseless effort in promoting the development of computer science and the use of computers in his country."
}