{
  "nome_completo": "Lalla",
  "nome_curto": "Lalla",
  "ano_nascimento": "720",
  "ano_morte": "790",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lalla/",
  "lugar_nascimento": null,
  "lugar_morte": "India",
  "biografia": "Lalla\n's father was Trivikrama Bhatta and Trivikrama's father, Lalla's paternal grandfather, was named Samba. Lalla was an Indian astronomer and mathematician who followed the tradition of\nAryabhata I\n. Lalla's most famous work was entitled\nShishyadhividdhidatantra\n. This major treatise was in two volumes. The first volume,\nOn the computation of the positions of the planets\n, was in thirteen chapters and covered topics such as: mean longitudes of the planets; true longitudes of the planets; the three problems of diurnal rotation; lunar eclipses; solar eclipses; syzygies; risings and settings; the shadow of the moon; the moon's crescent; conjunctions of the planets with each other; conjunctions of the planets with the fixed stars; the patas of the moon and sun, and a final chapter in the first volume which forms a conclusion.\nThe second volume was\nOn the sphere\n. In this volume Lalla examined topics such as: graphical representation; the celestial sphere; the principle of mean motion; the terrestrial sphere; motions and stations of the planets; geography; erroneous knowledge; instruments; and finally selected problems.\nIn\nShishyadhividdhidatantra\nLalla uses Sanskrit numerical symbols. Ifrah writes in\n[\n2\n]\n:-\n... over the centuries, Sanskrit has lent itself admirably to the rules of prosody and versification. This explains why Indian astronomers\n[\nlike Lalla\n]\nfavoured the use of Sanskrit numerical symbols, based on a complex symbolism which was extraordinarily fertile and sophisticated, possessing as it did an almost limitless choice of synonyms.\nDespite writing the most famous treatise giving the views of\nAryabhata I\n, Lalla did not accept his theory given in the\nAryabhatiya\nⓉ\n(\nThe work of Aryabhata\n)\nthat the earth rotated. Lalla argues in his commentary, like many other Indian astronomers before him such as\nVarahamihira\nand\nBrahmagupta\n, that if the earth rotated then the speed would have to be such that one would have to ask how do the bees or birds flying in the sky come back to their nests? In fact Lalla misinterpreted some of\nAryabhata I\n's statements about the rotating earth. One has to assume that the idea appeared so impossible to him that he just could not appreciate\nAryabhata I\n's arguments. As Chatterjee writes in\n[\n3\n]\n, Lalla in his commentary:-\n... did not interpret the relevant verses in the way meant by\nAryabhata I\n.\nAstrology at this time was based on astronomical tables and often the horoscopes allow one to identify the tables used. Some Arabic horoscopes were based on astronomical tables calculated in India. The most frequently used tables were by\nAryabhata I\n. Lalla improved on these tables and he produced a set of corrections for the Moon's longitude. One aspect of\nAryabhata I\n's work which Lalla did follow was his value of π. Lalla uses π =\n62832\n20000\n\\large\\frac{62832}{20000}\\normalsize\n2\n0\n0\n0\n0\n6\n2\n8\n3\n2\n​\n, i.e. π =\n3\n.\n1416\nwhich is a value correct to the fourth decimal place.\nLalla also wrote a commentary on\nKhandakhadyaka\nⓉ\n(\n'edible bite' or 'morsel of food'\n)\n, a work of\nBrahmagupta\n. Lalla's commentary has not survived but there is another work on astrology by Lalla which has survived, namely the\nJyotisaratnakosa\n. This was a very popular work which was the main one on the subject in India for around\n300\nyears."
}