{
  "nome_completo": "Lars Valerian Ahlfors",
  "nome_curto": "Lars Ahlfors",
  "ano_nascimento": "1907",
  "ano_morte": "1996",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ahlfors/",
  "lugar_nascimento": "Helsingfors, Finland, Russian Empire (now Helsinki, Finland)",
  "lugar_morte": "Pittsfield, Massachusetts, USA",
  "biografia": "Lars Ahlfors\ndescribed his ancestors in\n[\n6\n]\n:-\nMy father was born in the Aland Islands, which is a part of Finland but has a Swedish population and is completely Swedish-speaking. My ancestors came to Mariehamm in the Aland Islands from Bjorneborg, a smaller city on the mainland. I think that some of them were sea captains, with sailing ships that traded all over the world. My grandfather had a grocery store, and he must have done fairly well because he was able to send his children to school on the mainland. This was good since there were practically no schools on the Aland Islands. That's how my father was able to become first an engineer and then a professor of engineering at the Polytechnical Institute in Helsinki.\nAs he related, his father, Karl Axel Mauritz Ahlfors\n(1874\n-\n1961)\n, who used the name Axel, was professor of mechanical engineering at the Polytechnic Institute in Helsingfors. Tragically his mother, Sievä Matilda Helander\n(1881\n-\n1907)\n, died in childbirth when he was born. Lars had two older sisters, Aune\n(1902\n-\n1921)\nand Isa\n(1905\n-\n1990)\n. For the first three years of his life, Lars was looked after by two of his aunts on the Aland Islands. He returned to Helsingfors to live with his father when he was three years old. Although Lars was looked after well by his father, he later described him as a very stern man. The family were Swedish speaking and Lars only learnt Finnish later in life. We could mention at this point that his family called him by the nickname 'Lasse'. Also worth noting is that his father remarried Héléne Alice Palmroth\n(1884\n-\n1973)\n, who used the name Alice. Their daughter Unga, Lars' half-sister, was born in\n1917\n.\nAt the time that Ahlfors was growing up, Finland, although part of the Russian Empire, was treated reasonably and his father Axel was quite well off employing a maid, a cook, and a governess. However this situation did not last, since in\n1914\nWorld War I broke out and, following the Russian Revolution of\n1917\n, Finland gained independence. However, the revolutionary Reds gained control of the Social Democratic Party and, in\n1918\n, they took over Helsingfors and other towns in the south of Finland. Civil war followed, food was scarce and Axel Ahlfors was taken prisoner by the Reds. However, with German support for the White army, the Reds were quickly defeated and Axel Ahlfors was released. Lars Ahlfors was educated at a private Swedish language high school, the Nya Svenska Samskolan. He describes his early years in\n[\n3\n]\n:-\nAs a child I was fascinated by mathematics without understanding what it was about, but I was by no means a child prodigy. As a matter of fact I had no access to mathematical literature except in the highest grades. Having seen many prodigies spoilt by ambitious parents, I can only be thankful to my father for his restraint. The high school curriculum did not include any calculus, but I finally managed to learn some on my own, thanks to clandestine visits to my father's engineering library.\nAhlfors had little interest outside his school work during these years. He hated sports and was only happy on school days, hating Sundays and school vacations. His greatest joy was doing his mathematics homework making him rather different from the typical school student! Among his favourite school subjects we should mention languages and among those he detested we should mention history. He said\n[\n6\n]\n:-\nWhy memorize the years associated with various events and people? One might just as well memorize telephone numbers. It didn't make any sense to me, and it seemed rather silly. My history teacher was not very fond of me.\nAt first his father wanted him to become an engineer but, realising that his son was passionate about mathematics and unable to master anything mechanical, when Ahlfors was about\n15\nyears old his father told him that he would become a professor of mathematics. He entered Helsingfors University at the age of\n17\nin\n1924\n, and there he was taught by\nErnst Lindelöf\nand\nRolf Nevanlinna\n[\n6\n]\n:-\nI took advanced calculus as a freshman, which I was not supposed to do. On the first day of school, when I went to\nNevanlinna\nto ask permission to take his course, he asked me, \"Do you know any calculus?\" \"Oh, yes,\" I said, \"I have studied calculus.\" I didn't tell him it was all on my own.\nLindelöf\ndid not like my jumping ahead, and he made me take all of the tests from the prerequisite courses that I had not attended. I liked advanced calculus; I was very interested in my work.\nHe graduated from Helsingfors with a Candidate's degree in\n1928\n.\nNevanlinna\nreplaced\nHermann Weyl\nin Zürich for the session\n1928\n/\n29\nwhile\nWeyl\nwas on a research visit to the United States.\nLindelöf\ntold Ahlfors that he should go to Zürich with\nNevanlinna\nand he approached Ahlfor's father persuading him that his son would benefit greatly from the experience. In Zürich\nNevanlinna\nlectured on a different level to what he had done in Finland. Ahlfors said\n[\n6\n]\n:-\nZürich was my first encounter with mathematics as it should be taught. It was contemporary mathematics, not the history of mathematics as our courses usually were. In Zürich,\nNevanlinna\ncould talk on the research level, which made a completely different impression on me. I came to understand what mathematics was about, and that I was supposed to do mathematics, not just learn it. This had not been clear to me before.\nNevanlinna\ntalked about\nDenjoy\n's conjecture, made\n21\nyears earlier, on the number of asymptotic values of an\nentire function\n. Ahlfors suddenly became known internationally when he solved this conjecture. He modestly writes in\n[\n3\n]\n:-\nI had the incredible luck of hitting upon a new approach, based on conformal mappings, which, with very considerable help from\nNevanlinna\nand\nPólya\n, led to a proof of the full conjecture.\nHe published his breakthrough in two papers, both appearing in\n1929\n:\nSur le nombre des valeurs asymptotique d'une fonction entire d'ordre fini\nⓉ\n(\nOn the number of asymptotic values of an entire function of finite order\n)\nand\nÜber die asymptotischen Werte der ganzen Funktionen endlicher Ordnung\nⓉ\n(\nOn the asymptotic values of entire functions of finite order\n)\n. After Zürich, Ahlfors went to Paris with\nNevanlinna\nfor three months before returning to Finland. In Paris he met\nArnaud Denjoy\nwho told him that\n21\nhad now become his favourite number since his conjecture was solved by a\n21\nyear old mathematician\n21\nyears after he made it. Back in Finland he was appointed lecturer in mathematics at the Swedish language Abo Akademi in Turku. He presented his doctoral thesis in\n1930\n, in which he gave his proof of\nDenjoy\n's conjecture. This states that if an entire function has\np\np\np\ndistinct asymptotic values, then its order is ≥ ½\np\np\np\n.\nDenjoy\nhad proved a special case of the conjecture and\nTorsten Carleman\nhad proved a weaker version of the conjecture in\n1921\n. Mikhail Sodin sketches proofs of the work of\nDenjoy\n,\nCarleman\n, and Ahlfors in\n[\n30\n]\nwhere he also mentions later developments.\nIn the year\n1930\n-\n32\nAhlfors made a number of visits to Paris, supported by a fellowship from the Rockefeller Foundation, and to other European centres. In\n1933\nhe took up the position of adjunct professor at the University of Helsinki. Also in\n1933\nhe married Erna Martha Liesbeth Lehnert who had been born in Vienna but had moved with her parents first to Sweden and then to Finland. Lars and Erna Ahlfors had three daughters: Cynthia Mary, Vanessa Elisabeth, and Caroline Gertrud. Their son Christopher, died while still an infant.\nIn\n1935\n,\nConstantin Carathéodory\n, whom Ahlfors had met in Munich during his travels, recommended him for a post at Harvard in the United States. Ahlfors agreed to a three year trial period. This seems a good place to quote briefly from\n[\n13\n]\nabout his early mathematical contributions:-\nFunction theory already had a long tradition in Finland and Ahlfors began his career just after the first waves from the theory developed by his teacher,\nRolf Nevanlinna\n, had crested. ... The main direction of Ahlfors's work was to return to the foundations of the subject, and view it from a more geometric\n(\nand differential geometric\n)\npoint of view. This has provided the basis of almost all subsequent generalizations. We also find here the genesis of later work in quasiconformal mappings, conformal metrics and extremal length.\nIn\n1936\nhe was one of the first two recipients of a\nFields\nMedal at the International Congress in Oslo. He wrote\n[\n3\n]\n:-\nI was in for the surprise of my life when in\n1936\n, at the International Congress in Oslo, I was told only hours before the ceremony that I was to receive one of the first two\nFields medals\never awarded. The prestige was perhaps not yet the same as it is now, but in any case I felt singled out and greatly honoured. The citation by\nCarathéodory\nmentions explicitly my paper \"Zur Theorie der Überlagerungsflächen,\" which threw some new light on\nNevanlinna\n's theory of meromorphic functions. The award contributed in great measure to the confidence I felt in my work.\nIt was in this paper, which was a major factor in his receiving the\nFields\nMedal, that the term 'quasiconformal mapping' appears for the first time.\nCarathéodory\nsaid that this paper opened a completely new chapter in analysis, one that could be called \"metric topology.\" Ahlfors, in a commentary on this paper in\n[\n3\n]\nwrote:-\nLittle did I know at the time what an important role quasiconformal mappings would come to play in my own work.\nIn\n1938\nAhlfors was offered a chair in mathematics at the University of Helsinki and, being rather homesick, he accepted this rather than remain permanently at Harvard. However a difficult time was approaching with World War II about to begin. The war led to severe problems in Finland and the universities were closed. Ahlfors was unfit for military service so, as he states in\n[\n3\n]\n:-\nParadoxically I was myself able to do a lot of work during the war, although without the benefit of accessible libraries.\nAhlfors' family was evacuated to Sweden during the war where they lived with relatives. Ahlfors remained in Helsinki where the university was closed because there were too few male students. This meant that despite the lack of library resources, he was able to concentrate on research, much of which was carried out in air raid shelters. After the winter war, his family returned to Helsinki but after Germany attacked the Soviet Union in\n1941\nFinland supported Germany. At first the Soviet Union was too occupied trying to stop the German advance to pay much attention to Finland but once they had turned the tide against the Germans they attacked Finland. When Ahlfors was offered a chair in Zürich in\n1944\nit seemed a good chance to improve the difficult position that he and his family were in. At this stage Ahlfors' health was poor and he had an irregular heartbeat so he was allowed to go with his family in Sweden, where\nArne Beurling\ngave them a great deal of help and friendship\n[\n6\n]\n:-\nWhen I was able to leave Finland and go to Sweden, I was not allowed to take more than\n10\ncrowns with me. So what did I do? I smuggled out my\nFields\nMedal, and I pawned it! I'm sure it is the only\nFields\nMedal that has been in a pawn shop. As soon as I got a little money some people in Sweden helped me retrieve it.\nHowever the war made the trip to Switzerland to take up his position in Zürich close to impossible. A flight from Stockholm to Prestwick in Scotland was arranged on a moonless night and, in March\n1945\n, they made the trip\n[\n3\n]\n:-\nThe plane was a reconditioned Flying Fortress, with perhaps a dozen passengers. It was not pressurised, and breathing was accomplished by individual oxygen masks. Life jackets were worn by all. Our children, ages\n5\nand\n6\n, were quite capable of understanding the implications of danger.\nFrom Glasgow they travelled by train to London, then they made the difficult journey across the Channel to Dieppe, across France via Paris to Switzerland. He writes\n[\n3\n]\n:-\nMy first disappointment came when I learned that I would be responsible for Descriptive Geometry, a subject that for some reason had survived in the Swiss high school and undergraduate curriculum. My second shock was that it was to be taught from\n7\nto\n9\no'clock in the morning. Nevertheless, I slowly adjusted to my work, which even included some serious, although not very advanced, mathematics. Professor\nFueter\nand his colleague Professor\nFinsler\nwere getting on in years, and it became clear that the reason for inviting me was that no competent native successor was in sight. I took over a class of students in their formative years, and I am happy to say that many have remained my friends and are now important mathematicians in their own right. I cannot honestly say that I was happy in Zürich. The post-war era was not a good time for a stranger to take root in Switzerland. ... My wife and I did not feel welcome outside the circle of our immediate colleagues.\nAn offer from Harvard in\n1946\nwas therefore gladly accepted and, on this occasion, he remained there, retiring in\n1977\n. Two years after taking up the appointment at Harvard, Ahlfors was elected Chairman of the Mathematics Department. In\n1964\nhe was named William Caspar Graustein Professor of Mathematics. James Jenkins writes about Ahlfors' early years at Harvard in\n[\n10\n]\n:-\nAhlfors was very conscientious in meeting with his graduate students, but his role was largely reactive rather than presenting suggestions or ideas\n(\nat least in my case\n)\n. In the spring of\n1947\nAhlfors gave a course on the method of the extremal metric, which was then in its infancy. In the year\n1947\n-\n48\nhe gave a course on the calculus of variations. In the year\n1948\n-\n49\nhe gave a course on\nRiemann\nsurfaces, directed largely to a generalization of his work on\nSchwarz\n's lemma to finite-bordered\nRiemann\nsurfaces. Ahlfors did not conduct a regular seminar at any time during my stay. One year he gave a series of talks on\nTeichmüller\n's papers, probably with a view to preparing himself for his work on quasiconformal mappings.\nAn excellent overview of Ahlfors' mathematics is given in\n[\n17\n]\nwhere his contributions are given under the headings: Conformal geometry; Kleinian groups; and Quasiconformal mappings. These sections are reproduced in\n[\n16\n]\n.\nHis books are of lasting importance. These are\nComplex analysis\n(1953)\n,\nRiemann surfaces\n(\nwith Leo Sario\n)\n(1960)\n,\nLectures on quasi-conformal mappings\n(1966)\n,\nConformal invariants: topics in geometric function theory\n(1973)\nand\nMöbius transformations in several dimensions\n(1981)\n.\nWe give slightly modified\n(\nor translated\n)\nshort extracts from reviews of these books at\nTHIS LINK\n.\nAllow me\n[\nEFR\n]\na personal note on Ahlfors'\nComplex analysis\n. This was the text recommended to me by\nEdward Copson\nwho taught me complex analysis and it is indeed a tribute to Ahlfors that\nCopson\n, who had himself written a superb book on complex analysis, should recommend Ahlfors' book rather than his own. I found Ahlfors'\nComplex analysis\nbeautifully written, an example of the very highest quality in mathematical texts, combining clarity with an excitement for the topic.\nWe give the reader the chance to read the Preface to the first edition at\nTHIS LINK\nand brief extracts from the text at\nTHIS LINK\n.\nAhlfors received many honours for his outstanding contributions to mathematics. The award of the first\nFields\nmedal, mentioned above, must rank as the most important but other great honours were the award of Finland's International Prize in\n1968\nand the Wolf Prize in Mathematics in\n1981\n:-\n... for seminal discoveries and the creation of powerful new methods in geometric function theory.\nThe citation for the Wolf Prize gave a fine overview of his achievements:-\nFor over half a century the theory of functions of a complex variable was guided by the thought and work of Professor\n(\nEmeritus\n)\nLars Ahlfors. His achievements include the proof of the\nDenjoy\nconjecture, the geometric derivation of the\nNevanlinna\ntheory, an important generalization of the\nSchwarz\nlemma, the development\n(\nwith\nBeurling\n)\nof the method of extremal length, and numerous decisive results in the theories of\nRiemann\nsurfaces, quasi-conformal mappings and\nTeichmuller\nspaces. Ahlfors celebrated finiteness theorem for Kleinian groups, and his work on the limit set, revitalized an important area of research. He is now doing pioneering work on quasiconformal deformations in higher dimensions. Ahlfors' influence was pervasive and beneficial. His methods combine deep geometric insight with subtle analytic skill; he presents them with utter clarity and simplicity. Time and again he attacked and solved the central problem in a discipline. Time and again other mathematicians were inspired by work he did many years earlier. Every complex analyst working today is, in some sense, his pupil.\nOther honours he received included honorary degrees from Boston University\n(1953)\n, the Abo Adademi\n(1970)\n, the University of Zürich\n(1977)\n, and the University of London\n(1978)\n. He was elected to the Societas Scientiarum Fennica, the\nFinnish Academy of Science\n, the\nNational Academy of Sciences\n, the\nRoyal Swedish Academy of Sciences\n, and the\nRoyal Danish Academy of Sciences\n.\nLet us end this biography by quoting Troels Jorgensen\n[\n10\n]\n:-\nIt was my good fortune to know Lars Ahlfors for a quarter of a century. He was an inspiring mathematician and a very special person. His intuition for and joy in mathematics, combined with a great capacity for work, made him a harmonious craftsman through a career that spanned over sixty years. He savored the recognition and awards he received yet was very modest about his accomplishments. At a banquet celebrating his seventieth birthday Ahlfors said, \"I liked to go fishing where the fish are, rather than trying exclusively for the big one.\""
}