{
  "nome_completo": "Laurence Chisholm Young",
  "nome_curto": "Laurence Chisholm Young",
  "ano_nascimento": "1905",
  "ano_morte": "2000",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young_Laurence/",
  "lugar_nascimento": "Göttingen, Germany",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Laurence Chisholm Young\n's parents were\nGrace Chisholm Young\nand\nWilliam Henry Young\n. Laurence was the fifth of their six children and was born while his parents had their home in Göttingen, which they did until\n1908\n. An interesting story about Laurence as a child is told in\n[\n3\n]\n. When he was two years old, his parents:-\n... had left him in Germany with a nanny while they made a professional visit to Cambridge University. He decided to follow them; on his own, he walked down to the train station and got on a train going from Germany to France, while declaring proudly to everyone within earshot that he was going to England. Even at the frontier, it was assumed that he was with someone - he was so full of confidence and conviction.\n(\nHe was caught by the Dutch police at the second border; they entertained him until he was picked up.\n)\nIn\n1908\nthe Youngs moved to Switzerland where they set up home. Laurence\n(\nor Laurie as he was often called\n)\nwas of course greatly influenced growing up in a family who devoted themselves totally to mathematics. The family were poor; they grew most of their own food, and the children all helped with growing vegetables, keeping chickens and rabbits, and making meals. Laurence was taught languages and music by his mother, who generally saw that the children were progressing well academically.\nLaurence attended the\nGymnasium\nin Lausanne and completed his studies two years early. However at this stage he contracted scarlet fever and he later believed that surviving this illness made him especially healthy when he was old. It was a difficult period for Laurence, ready intellectually to be studying at university, but held back by the illness. However, he did not waste the time and he read mathematics and physics books while he recovered from scarlet fever. He went first to Munich in\n1924\nwhere he studied with\nCarathéodory\n, then matriculated at Trinity College, Cambridge. He rowed for Trinity College while there, was involved in founding the Cambridge University Chess Club, and worked on writing his first book\nThe theory of integration\n. The book is an introduction to\nLebesgue\n-\nStieltjes\nintegration using techniques based on monotone sequences of functions and was published by\nCambridge University Press\nin\n1927\n.\nYoung was\nIsaac Newton\nStudent at Cambridge in\n1930\n, was awarded an MA in\n1931\nafter studying with\nFowler\nand\nLittlewood\n, and he was elected to a fellowship in\n1931\n. Young first met Joan Elizabeth Mary Dunnett in\n1927\nwhen he was asked by Geoffrey Miller to come with him when he went to have tea with his cousin Elizabeth.\n[\nPerhaps it is worth noting that Elizabeth Mary acquired the extra name of Joan since she was christened on St Joan's day, but she was known as Elizabeth.\n]\nYoung married Elizabeth on\n9\nJune\n1934\nand the first two of their six children were born while Young worked at Cambridge. He was appointed as Professor of Mathematics at the University of Cape Town in\n1938\nwhere he was the first head of the Department of Mathematics. He was very successful in building the Department at Cape Town during the ten years he spent there. He left South Africa in\n1948\n, spending part of a year at Ohio State University in the United States before taking up an appointment as Professor of Mathematics at the University of Wisconsin-Madison. He was chairman of the Department\n1962\n-\n64\nand during this time he initiated the \"Wisconsin Talent Search\" to discover talented students in schools around Wisconsin. The search is based on challenging mathematical problems, culminating in a day of activities at the University when various awards are made to the most talented students. Young remained at Wisconsin-Madison for the rest of his career, retiring in\n1975\nat the age of\n70\n.\nIn\n1969\nYoung published\nLectures on the calculus of variations and optimal control theory\n. This book is based on the theory of generalised curves, a topic which Young himself founded. Hestenes, reviewing the book, writes:-\nEarly in his career,\n[\nYoung\n]\nrecognized that the difficulties encountered in establishing existence theorems in variational theory was due to a large extent to an inadequate concept of curves or surfaces. In his view, a curve or surface should be determined by its action on variational integrands. From this point of view a curve or a surface can be identified with a linear functional over the class of variational integrands. This is similar to the concept of distributions introduced later by\nSchwartz\n. This enlargement of the concept of a curve enables him and others to establish existence theorems for variational and optimal control problems which heretofore have been unattainable by any other method.\nIn fact when Young was\n92\nhe gave a lecture in which he described how he had come to think of generalised curves\n[\n3\n]\n:-\n... the notion was inspired by bicycling and pedalling in a zig-zag fashion up a hill, and by sailing and tacking against the wind; he realised that other wandering wavy paths might be the most efficient.\nBefore leaving\nLectures on the calculus of variations and optimal control theory\nlet us note that Hestenes gives this assessment:-\nThe book is an important contribution to the calculus of variations and optimal control theory. .... The book is well written with an unusual and lively style. It is filled with historical remarks and with comments which enlarge one's outlook on the role of mathematics and mathematicians in our society. This feature alone makes it worth while to read the book casually even though one might not be interested in the subject matter at hand. The casual reader will obtain a broad view of important aspects of variational theory.\nAnother important book written by Young was\nMathematicians and their times: History of mathematics and mathematics of history\npublished in\n1981\n. This book is an outstanding one based on Young's reading of the original source material. The book also tells us a great deal about the way Young himself approached mathematics. He writes in the Preface:-\nThese lectures were given at the request of colleagues, in view of my long acquaintance with distinguished mathematicians. From early childhood, I have known almost legendary figures .... Mathematics became for me, not a store of past knowledge, but creative activity of the highest form, directed towards the future. Yet I learned that to study the newest developments is not enough: we have to go back to the sources ... The past is a laboratory of human experience, from which to learn .... This is by no means the usual historical procedure .... This implies a more complex relationship to time, and without it much that occurs cannot be properly understood. In this way, history becomes anachronistic and mathematical: we need a mathematics of history.\nOf course to read original sources requires a great knowledge of languages and this Young certainly possessed. In addition to English he read French, Italian, German, Russian, Danish, Polish, Latin and Greek. He was an accomplished pianist and chess player, winning the Heart of America Competition in\n1955\n. He played tennis, loved walking and gardening, and in winter often skated from his home on the shore of Lake Mendota across the frozen lake to the University. After he moved to Wisconsin, he took part in theatrical performances and appeared several times on television. In fact he claims that he first grew a beard to play the part of Polonius in Hamlet since he did not like wearing a false beard. In fact he was forced to withdraw from that production, but he kept the beard for the rest of his life.\nAfter he retired, Young taught students at the University of Campinas in Brazil for many years. Among the honours he received was an honorary doctorate from the University of Paris-Dauphine in\n1984\n; see\n[\n2\n]\nfor the laudatio and Young's reply. In the last decade of his life he entertained himself by translating classic poetry from Ancient Greek into  French, German, English and Italian.\nHis wife Elizabeth died in\n1995\nand Young died of cancer five years later."
}