{
  "nome_completo": "Leonardo da Vinci",
  "nome_curto": "Leonardo da Vinci",
  "ano_nascimento": "1452",
  "ano_morte": "1519",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Leonardo/",
  "lugar_nascimento": "Vinci, near Empolia  (now Italy)",
  "lugar_morte": "Cloux, Amboise, France",
  "biografia": "Leonardo da Vinci\nwas educated in his father's house receiving the usual elementary education of reading, writing and arithmetic. In\n1467\nhe became an apprentice learning painting, sculpture and acquiring technical and mechanical skills. He was accepted into the painters' guild in Florence in\n1472\nbut he continued to work as an apprentice until\n1477\n. From that time he worked for himself in Florence as a painter. Already during this time he sketched pumps, military weapons and other machines.\nBetween\n1482\nand\n1499\nLeonardo was in the service of the Duke of Milan. He was described in a list of the Duke's staff as a\npainter and engineer of the duke\n. As well as completing six paintings during his time in the Duke's service he also advised on architecture, fortifications and military matters. He was also considered as a hydraulic and mechanical engineer.\nDuring his time in Milan, Leonardo became interested in geometry. He read Leon Battista\nAlberti\n's books on architecture and Piero della\nFrancesca\n's\nOn Perspective in Painting\n. He illustrated\nPacioli\n's\nDivina proportione\nand he continued to work with\nPacioli\nand is reported to have neglected his painting because he became so engrossed in geometry.\nLeonardo studied\nEuclid\nand\nPacioli\n's\nSuma\nand began his own geometry research, sometimes giving mechanical solutions. He gave several methods of\nsquaring the circle\n, again using mechanical methods. He wrote a book, around this time, on the elementary theory of mechanics which appeared in Milan around\n1498\n.\nLeonardo certainly realised the possibility of constructing a telescope and in\nCodex Atlanticus\nwritten in\n1490\nhe talks of\n... making glasses to see the Moon enlarged.\nIn a later work,\nCodex Arundul\nwritten about\n1513\n, he says that\n... in order to observe the nature of the planets, open the roof and bring the image of a single planet onto the base of a concave mirror. The image of the planet reflected by the base will show the surface of the planet much magnified.\nSee\n[\n28\n]\nfor more details of this quotation and more of Leonardo's ideas about the Universe. He understood the fact that the Moon shone with reflected light from the Sun and he correctly explained the 'old Moon in the new Moon's arms' as the Moon's surface illuminated by light reflected from the Earth. He thought of the Moon as being similar to the Earth with seas and areas of solid ground.\nIn\n1499\nthe French armies entered Milan and the Duke was defeated. Some months later Leonardo left Milan together with\nPacioli\n. He travelled to Mantua, Venice and finally reached Florence. Although he was under constant pressure to paint, mathematical studies kept him away from his painting activity much of the time. He was for a time employed by Cesare Borgia as a\nsenior military architect and general engineer.\nBy\n1503\nhe was back in Florence advising on the project to divert the River Arno behind Pisa to help with the siege of the city which the Florentines were engaged in. He then produced plans for a canal to allow Florence access to the sea. The canal was never built nor was the River Arno diverted.\nIn\n1506\nLeonardo returned for a second period in Milan. Again his scientific work took precedence over his painting and he was involved in hydrodynamics, anatomy, mechanics, mathematics and optics.\nIn\n1513\nthe French were removed from Milan and Leonardo moved again, this time to Rome. However he seems to have led a lonely life in Rome again more devoted to mathematical studies and technical experiments in his studio than to painting. After three years of unhappiness Leonardo accepted an invitation from King Francis I to enter his service in France.\nThe French King gave Leonardo the title of\nfirst painter, architect, and mechanic of the King\nbut seems to have left him to do as he pleased. This means that Leonardo did no painting except to finish off some works he had with him,\nSt. John the Baptist, Mona Lisa\nand the\nVirgin and Child with St Anne\n. Leonardo spent most of his time arranging and editing his scientific studies."
}