{
  "nome_completo": "Leonard Eugene Dickson",
  "nome_curto": "Leonard Dickson",
  "ano_nascimento": "1874",
  "ano_morte": "1954",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dickson/",
  "lugar_nascimento": "Independence, Iowa, USA",
  "lugar_morte": "Harlingen, Texas, USA",
  "biografia": "Leonard Dickson\n, or\nL E Dickson\nas he was often called, was born in Iowa but since his family moved to Texas when he was a young child he always considered himself a Texan. His parents were Lucy Tracy and Campbell Dickson, who worked as a banker. Campbell was also a merchant and made money through investing in real estate. Leonard attended both primary and secondary school in his home town of Cleburne. He entered the University of Texas and quickly came under the influence of\nHalsted\nwho encouraged him to study mathematics. Dickson studied widely within mathematics but specialised in\nHalsted\n's own subjects of euclidean and\nnon-euclidean geometry\n. Dickson received his B.S. in\n1893\nand his  M.S. in\n1894\n, again under\nHalsted\n's supervision.\nDickson applied for doctoral fellowships at both Harvard and Chicago. He accepted an offer from Harvard but, on receiving a later offer from Chicago, changed his mind.  At Chicago he was supervised by\nEliakim Moore\n, but others there influenced him, for example\nBolza\nand\nMaschke\n. Dickson received a Ph.D. from the University of Chicago in\n1896\nfor a dissertation entitled\nThe Analytic Representation of Substitutions on a Power of a Prime Number of Letters with a Discussion of the Linear Group\n. It was the first mathematics doctorate awarded by Chicago.\nDickson then spent some time with\nLie\nat Leipzig and later with\nJordan\nin Paris. On returning to the United States he became an instructor at the University of California in Berkeley. He was appointed as associate professor at the University of Texas at Austin in\n1899\n. However\nEliakim Moore\nand his colleagues in Chicago were keen that Dickson should return there and they offered him a permanent post on the faculty. He accepted immediately and served as assistant professor at the University of Chicago from\n1900\nto\n1907\n, then associate professor to\n1910\nwhen he was promoted to full professor. He remained as a professor at Chicago for the rest of his career, retiring in\n1939\nwhen he was made professor emeritus. He did spend periods during these years away from Chicago, principally at the University of California where he was a visiting professor in\n1914\n,\n1918\n, and\n1922\n. Dickson married Susan McLeod Davis in\n1902\n; they had two children.\nDickson's mathematical output was vast and his list of published works contains\n275\nitems. He worked on finite fields and extended the theory of linear associative algebras initiated by\nWedderburn\nand\nCartan\n. He proved many interesting results in\nnumber theory\n, using results of\nVinogradov\nto deduce the ideal\nWaring\ntheorem in his investigations of additive number theory.\nIn\n1901\nhis famous book\nLinear groups with an exposition of the Galois field theory\nwas published. Perhaps the first comment to make is that it was published by Teubner of Leipzig, probably partly because of\nKlein\n's advice, but mainly because there was no well-established American scientific publisher. The book was a revised and expanded version of his\n1896\ndoctoral thesis. However we should note that before publishing the book, Dickson had already published\n43\nresearch papers in the preceding five years which, with the exception of seven, were all on finite linear\ngroups\n. In the proposal for his book, sent to\nKlein\n, Dickson wrote:-\nThe book here announced proposes to treat of linear congruence groups, or more generally, of linear groups in a\nGalois field\n, a subject enriched by the labors of\nGalois\n,\nBetti\n, Mathieu\n[\nÉmile Mathieu\n]\n,\nJordan\nand many recent writers.\nIn his letter to\nKlein\n, Dickson also talks of:-\n... introducing marked simplifications ...\nand\n... presenting parts of the theory without the difficult calculations given in the published papers.\nParshall in\n[\n20\n]\ndescribing the book writes:-\nDickson presented a unified, complete, and general theory of the classical linear groups - not merely over the prime field GF\n(\np\n)\nas\nJordan\nhad done - but over the general finite field GF\n(\np\nn\n)\n, and he did this against the backdrop of a well-developed theory of these underlying fields. ... his book represented the first systematic treatment of finite fields in the mathematical literature.\nDickson published\n17\nbooks in addition to\nLinear groups with an exposition of the Galois field theory\n. The\n3\n-volume\nHistory of the Theory of Numbers\n(1919\n-\n23)\nis another famous work still much consulted today. The three volumes cover: Divisibility and primality; Diophantine analysis; and Quadratic and higher forms. The work contains little interpretation and makes no attempt to build a context for the results being described, yet it contains essentially every number theoretic idea from the very beginning of mathematics up to the\n1920\ns.\nDerrick Lehmer\ndescribed it\n(\nperhaps rather harshly\n)\nas:-\n... list of references from which a history might be written.\nAbraham Albert\nremarks in\n[\n3\n]\nthat Dickson's three volume work:-\n... would be a life's work by itself for a more ordinary man.\nDespite its comprehensive nature, quadratic reciprocity is not discussed and the reason for this is explained in\n[\n14\n]\nwhere details of a planned fourth volume, which was never published, are given. In\n[\n12\n]\nthe question of why Dickson chose to devote so much time to this project when at the height of his research powers is considered. Three reasons are given: he simply wanted to know all of the work which had been done in the subject; he wanted to create an American work reporting in detail on a mathematical subject which matched similar reports being compiled in Europe; and finally the reason which Dickson gave himself, namely that it:-\n... fitted in with my conviction that every person should aim to perform at some time in his life some serious useful work for which it is highly improbable that there will be any reward whatever other than his satisfaction therefrom.\nDickson published\nModern Elementary Theory of Numbers\nin\n1939\n. Brinkmann, reviewing this book, writes:-\nThe first four chapters of this book furnish a brief but satisfactory introduction to the usual elementary topics of number theory, including a short account of binary quadratic forms. This part of the book can be easily read by a beginner and there are many problems suitable for such a reader. The remaining two hundred pages deal with more advanced subjects, most of them \"additive\" in character. The proofs are \"elementary\"\n(\nexcept for the Appendix\n)\nand are, in general, simpler than those in the literature. There are several chapters dealing with quadratic forms. One of these contains generalizations of the classical theorem on representing a natural number as the sum of three squares. ...\nThe final area of Dickson's research which we should look at is his work on algebras.\nEliakim Moore\nand Dickson had done much work on fields but it was the arrival of\nWedderburn\nin Chicago in\n1904\nwhen work began there on finite division algebras. In\n1905\nWedderburn\nproved the commutativity of finite division algebras but\n[\n21\n]\ngives much insight into the interactions of Dickson in this work. In fact\nWedderburn\ndiscovered a proof which was subsequently seen to contain a gap but nobody noticed this at the time. Dickson, who at first looked for a counterexample, was led to find a\n(\nrather obscure\n)\nproof himself which he showed to\nWedderburn\n. Then\nWedderburn\ndevised two further elegant proofs using ideas from Dickson's proof. Dickson's search for a counterexample led him to consider non-associative algebras and in a series of papers he determined all three and four-dimensional\n(\nnon-associative\n)\ndivision algebras over a field. He published the major texts\nLinear algebras\nin\n1914\n,\nAlgebras and their arithmetics\nin\n1923\n, and\nModern algebraic theories\nin\n1926\n.\nAbraham Albert\nwrites in\n[\n9\n]\nthat:-\nDickson was an inspiring teacher.\nHowever Parshall writes\n[\n22\n]\n:-\nAlthough not especially gifted in the classroom, Dickson adeptly engaged the interests of the graduate students at the University of Chicago in his work as an advisor.\nIn fact Fenster in\n[\n17\n]\nasks the question of how Dickson could attract\n67\ndoctoral students into research in algebra and number theory when he was recognised as not particularly good at classroom teaching\n[\n17\n]\n:-\nHe delivered terse and unpolished lectures and spoke sternly to his students. He frequently assigned readings from a textbook\n(\noften one of his own\n)\nand he either called on students to present and analyse the material or he lectured the entire hour. ... Given Dickson's intolerance for student weaknesses in mathematics, however, his comments could be harsh, even though not intended to be personal. He did not aim to make students feel good about themselves.\nHer answer to why he was so successful is by his example as a leading research mathematician, something his students wished to emulate, rather than because of his role as an advisor. Perhaps the fact that he was so demanding before accepting students worked in his favour rather than against him\n[\n17\n]\n:-\nDickson had a sudden death trial for his perspective doctoral students: he assigned a preliminary problem which was shorter than a dissertation problem, and if the student could solve it in three months, Dickson would agree to oversee the graduate student's work. If not the student had to look elsewhere for an advisor.\nDickson was awarded many honours. He was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1913\nand was also a member of the American Philosophical Society, the\nAmerican Academy of Arts and Sciences\n, the\nLondon Mathematical Society\n, the\nFrench Academy of Sciences\nand the\nUnion of Czech Mathematicians and Physicists\n. The American Association for the Advancement of Science decided to set up a prize for the most major contribution to the advancement of science. Dickson was the first recipient of the prize, being awarded $\n1\n,\n000\nin\n1924\nfor his work on the arithmetics of algebras. He was also the first recipient of the\nCole\nPrize for algebra awarded by the\nAmerican Mathematical Society\nin\n1928\nfor his book\nAlgebren und ihre Zahlentheorie\npublished in Zürich and Leipzig in\n1927\n. Dickson was much involved with the\nAmerican Mathematical Society\n, becoming its president in\n1917\n-\n1918\nhaving earlier, in\n1913\n, been its Colloquium Lecturer. He gave his presidential address in December\n1918\non the topic\nMathematics in War Perspective\nin which he criticised the United States for falling short of making the mathematical preparations of Britain, France, and Germany. He said:-\nLet it not again become possible that thousands of young men shall be so seriously handicapped in their army and navy work by lack of adequate preparation in mathematics.\nAs a final comment on honours given to Dickson, we note that Princeton\n(1941)\nand Harvard\n(1936)\nwere among the universities that awarded him honorary degrees.\nWe mentioned at the beginning of this article that Dickson always considered himself a Texan, so it was natural that he should return 'home' after he retired. His level of research activity throughout his career had been higher than most mathematicians could imagine, and perhaps because of this he effectively gave up research during the fifteen years of his retirement.\nAs to Dickson's character he is described in\n[\n22\n]\nas follows:-\nA hard-bitten character, Dickson tended to speak his mind bluntly; he was always sparing in his praise for the work of others. ... he indulged his serious passions for bridge and billiards and reportedly did not like to lose at either game.\nHe certainly had a major impact on mathematics in America and it was in large part due to him that America's role in research into algebra was transformed."
}