{
  "nome_completo": "Leopold Kronecker",
  "nome_curto": "Leopold Kronecker",
  "ano_nascimento": "1823",
  "ano_morte": "1891",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kronecker/",
  "lugar_nascimento": "Liegnitz, Prussia (now Legnica, Poland)",
  "lugar_morte": "Berlin, Germany",
  "biografia": "Leopold Kronecker\n's parents were well off, his father, Isidor Kronecker, being a successful business man while his mother was Johanna Prausnitzer who also came from a wealthy family. The families were Jewish, the religion that Kronecker kept until a year before his death when he became a convert to Christianity. Kronecker's parents employed private tutors to teach him up to the stage when he entered the\nGymnasium\nat Liegnitz, and this tutoring gave him a very sound foundation to his education.\nKronecker was taught mathematics at Liegnitz Gymnasium by\nKummer\n, and it was due to\nKummer\nthat Kronecker became interested in mathematics.\nKummer\nimmediately recognised Kronecker's talent for mathematics and he took him well beyond what would be expected at school, encouraging him to undertake research. Despite his Jewish upbringing, Kronecker was given Lutheran religious instruction at the Gymnasium which certainly shows that his parents were openminded on religious matters.\nKronecker became a student at Berlin University in\n1841\nand there he studied under\nDirichlet\nand\nSteiner\n. He did not restrict himself to studying mathematics, however, for he studied other topics such as astronomy, meteorology and chemistry. He was especially interested in philosophy studying the philosophical works of\nDescartes\n,\nLeibniz\n, Kant, Spinoza and Hegel. After spending the summer of\n1843\nat the University of Bonn, which he went to because of his interest in astronomy rather than mathematics, he then went to the University of Breslau for the winter semester of\n1843\n-\n44\n. The reason that he went to Breslau was certainly because of his interest in mathematics because he wanted to study again with his old school teacher\nKummer\nwho had been appointed to a chair at Breslau in\n1842\n.\nKronecker spent a year at Breslau before returning to Berlin for the winter semester of\n1844\n-\n45\n. Back in Berlin he worked on his doctoral thesis on\nalgebraic number theory\nunder\nDirichlet\n's supervision. The thesis,\nOn complex units\nwas submitted on\n30\nJuly\n1845\nand he took the necessary oral examination on\n14\nAugust.\nDirichlet\ncommented on the thesis saying that in it Kronecker showed:-\n... unusual penetration, great assiduity, and an exact knowledge of the present state of higher mathematics.\nIt may come as a surprise to many Ph.D. students to hear that Kronecker was questioned at his oral on a wide range of topics including the\ntheory of probability\nas applied to astronomical observations, the theory of definite integrals, series and\ndifferential equations\n, as well as on Greek, and the history of philosophy.\nJacobi\nhad health problems which caused him to leave Königsberg, where he held a chair, and return to Berlin.\nEisenstein\n, whose health was also poor, lectured in Berlin around this time and Kronecker came to know both men well. The direction that Kronecker's mathematical interests went later had much to do with the influence of\nJacobi\nand\nEisenstein\naround this time. However, just as it looked as if he would embark on an academic career, Kronecker left Berlin to deal with family affairs. He helped to manage the banking business of his mother's brother and, in\n1848\n, he married the daughter of this uncle, Fanny Prausnitzer. He also managed a family estate but still found the time to continue working on mathematics, although he did this entirely for his own enjoyment.\nCertainly Kronecker did not need to take on paid employment since he was by now a wealthy man. His enjoyment of mathematics meant, however, that when circumstances changed in\n1855\nand he no longer needed to live on the estate outside Liegnitz, he returned to Berlin. He did not wish a university post, rather he wanted to take part in the mathematical life of the university and undertake research interacting with the other mathematicians.\nIn\n1855\nKummer\ncame to Berlin to fill the vacancy which occurred when\nDirichlet\nleft for Göttingen.\nBorchardt\nhad lectured at Berlin since\n1848\nand, in late\n1855\n, he took over the editorship of\nCrelle's Journal\non\nCrelle\n's death. In\n1856\nWeierstrass\ncame to Berlin, so within a year of Kronecker returning to Berlin, the remarkable team of\nKummer\n,\nBorchardt\n,\nWeierstrass\nand Kronecker was in place in Berlin.\nOf course since Kronecker did not hold a university appointment, he did not lecture at this time but was remarkably active in research publishing a large number of works in quick succession. These were on\nnumber theory\n,\nelliptic functions\nand algebra, but, more importantly, he explored the interconnections between these topics.\nKummer\nproposed Kronecker for election to the\nBerlin Academy\nin\n1860\n, and the proposal was seconded by\nBorchardt\nand\nWeierstrass\n. On\n23\nJanuary\n1861\nKronecker was elected to the Academy and this had a surprising benefit.\nMembers of the\nBerlin Academy\nhad a right to lecture at Berlin University. Although Kronecker was not employed by the University, or any other organisation for that matter,\nKummer\nsuggested that Kronecker exercise his right to lecture at the University and this he did beginning in October\n1862\n. The topics on which he lectured were very much related to his research: number theory, the theory of equations, the theory of\ndeterminants\n, and the theory of integrals. In his lectures\n[\n1\n]\n:-\nHe attempted to simplify and refine existing theories and to present them from new perspectives.\nFor the best students his lectures were demanding but stimulating. However, he was not a popular teacher with the average students\n[\n1\n]\n:-\nKronecker did not attract great numbers of students. Only a few of his auditors were able to follow the flights of his thought, and only a few persevered until the end of the semester.\nBerlin was attractive to Kronecker, so much so that when he was offered the chair of mathematics in Göttingen in\n1868\n, he declined. He did accept honours such as election to the\nParis Academy\nin that year and for many years he enjoyed good relations with his colleagues in Berlin and elsewhere. In order to understand why relations began to deteriorate in the\n1870\ns we need to examine Kronecker's mathematical contributions more closely.\nWe have already indicated that Kronecker's primary contributions were in the theory of equations and higher algebra, with his major contributions in elliptic functions, the theory of algebraic equations, and the theory of\nalgebraic numbers\n. However the topics he studied were restricted by the fact that he believed in the reduction of all mathematics to arguments involving only the integers and a finite number of steps. Kronecker is well known for his remark:-\nGod created the integers, all else is the work of man.\nKronecker believed that mathematics should deal only with finite numbers and with a finite number of operations. He was the first to doubt the significance of non-constructive existence proofs. It appears that, from the early\n1870\ns, Kronecker was opposed to the use of\nirrational\nnumbers, upper and lower limits, and the\nBolzano\n-\nWeierstrass\ntheorem, because of their non-constructive nature. Another consequence of his philosophy of mathematics was that to Kronecker\ntranscendental\nnumbers could not exist.\nIn\n1870\nHeine\npublished a paper\nOn trigonometric series\nin\nCrelle's Journal\n, but Kronecker had tried to persuade\nHeine\nto withdraw the paper. Again in\n1877\nKronecker tried to prevent publication of\nCantor\n's work in\nCrelle's Journal\n, not because of any personal feelings against\nCantor\n(\nwhich has been suggested by some biographers of\nCantor\n)\nbut rather because Kronecker believed that\nCantor\n's paper was meaningless, since it proved results about mathematical objects which Kronecker believed did not exist. Kronecker was on the editorial staff of\nCrelle's Journal\nwhich is why he had a particularly strong influence on what was published in that journal. After\nBorchardt\ndied in\n1880\n, Kronecker took over control of\nCrelle's Journal\nas the editor and his influence on which papers would be published increased.\nThe mathematical seminar in Berlin had been jointly founded in\n1861\nby\nKummer\nand\nWeierstrass\nand, when\nKummer\nretired in\n1883\n, Kronecker became a codirector of the seminar. This increased Kronecker's influence in Berlin. Kronecker's international fame also spread, and he was honoured by being elected a foreign member of the\nRoyal Society of London\non\n31\nJanuary\n1884\n. He was also a very influential figure within German mathematics\n[\n1\n]\n:-\nHe established other contacts with foreign scientists in numerous travels abroad and in extending to them the hospitality of his Berlin home. For this reason his advice was often solicited in regard to filling mathematical professorships both in Germany and elsewhere; his recommendations were probably as significant as those of his erstwhile friend\nWeierstrass\n.\nAlthough Kronecker's view of mathematics was well known to his colleagues throughout the\n1870\ns and\n1880\ns, it was not until\n1886\nthat he made these views public. In that year he argued against the theory of irrational numbers used by\nDedekind\n,\nCantor\nand\nHeine\ngiving the arguments by which he opposed:-\n... the introduction of various concepts by the help of which it has frequently been attempted in recent times\n(\nbut first by\nHeine\n)\nto conceive and establish the \"irrationals\" in general. Even the concept of an infinite series, for example one which increases according to definite powers of variables, is in my opinion only permissible with the reservation that in every special case, on the basis of the arithmetic laws of constructing terms\n(\nor coefficients\n)\n, ... certain assumptions must be shown to hold which are applicable to the series like finite expressions, and which thus make the extension beyond the concept of a finite series really unnecessary.\nLindemann\nhad proved that π is transcendental in\n1882\n, and in a lecture given in\n1886\nKronecker complimented\nLindemann\non a beautiful proof but, he claimed, one that proved nothing since transcendental numbers did not exist. So Kronecker was consistent in his arguments and his beliefs, but many mathematicians, proud of their hard earned results, felt that Kronecker was attempting to change the course of mathematics and write their line of research out of future developments. Kronecker explained his programme based on studying only mathematical objects which could be constructed with a finite number of operation from the integers in\nÜber den Zahlbergriff\nⓉ\n(\nOn the number of terms\n)\nin\n1887\n.\nAnother feature of Kronecker's personality was that he tended to fall out personally with those whom he disagreed with mathematically. Of course, given his belief that only finitely constructible mathematical objects existed, he was completely opposed to\nCantor\n's developing ideas in set theory. Not only\nDedekind\n,\nHeine\nand\nCantor\n's mathematics was unacceptable to this way of thinking, and\nWeierstrass\nalso came to feel that Kronecker was trying to convince the next generation of mathematicians that\nWeierstrass\n's work on analysis was of no value.\nKronecker had no official position at Berlin until\nKummer\nretired in\n1883\nwhen he was appointed to the chair. But by\n1888\nWeierstrass\nfelt that he could no longer work with Kronecker in Berlin and decided to go to Switzerland, but then, realising that Kronecker would be in a strong position to influence the choice of his successor, he decided to remain in Berlin.\nKronecker was of very small stature and extremely self-conscious about his height. An example of how Kronecker reacted occurred in\n1885\nwhen\nSchwarz\nsent him a greeting which included the sentence:-\nHe who does not honour the Smaller, is not worthy of the Greater.\nHere\nSchwarz\nwas joking about the small man Kronecker and the large man\nWeierstrass\n. Kronecker did not see the funny side of the comment, however, and never had any further dealings with\nSchwarz\n(\nwho was\nWeierstrass\n's student and\nKummer\n's son-in-law\n)\n. Others however displayed more tact and, for example,\nHelmholtz\nwho was a professor in Berlin from\n1871\n, managed to stay on good terms with Kronecker.\nThe\nDeutsche Mathematiker-Vereinigung\nwas set up in\n1890\nand the first meeting of the Association was organised in Halle in September\n1891\n. Despite the bitter antagonism between\nCantor\nand Kronecker,\nCantor\ninvited Kronecker to address this first meeting as a sign of respect for one of the senior and most eminent figures in German mathematics. However, Kronecker never addressed the meeting, since his wife was seriously injured in a climbing accident in the summer and died on\n23\nAugust\n1891\n. Kronecker only outlived his wife by a few months, and died in December\n1891\n.\nWe should not think that Kronecker's views of mathematics were totally eccentric. Although it was true that most mathematicians of his day would not agree with those views, and indeed most mathematicians today would not agree with them, they were not put aside. Kronecker's ideas were further developed by\nPoincaré\nand\nBrouwer\n, who placed particular emphasis upon intuition.\nIntuitionism\nstresses that mathematics has priority over logic, the objects of mathematics are constructed and operated upon in the mind by the mathematician, and it is impossible to define the properties of mathematical objects simply by establishing a number of axioms."
}