{
  "nome_completo": "Lewis Fry Richardson",
  "nome_curto": "Lewis Fry Richardson",
  "ano_nascimento": "1881",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Richardson/",
  "lugar_nascimento": "Newcastle upon Tyne, Northumberland, England",
  "lugar_morte": "Kilmun, Argyll, Scotland",
  "biografia": "Lewis Fry Richardson\nwas born into a Quaker family. His mother was Catherine Fry who came from a family of corn merchants, and his father was David Richardson who came from a family of tanners, and he had gone himself into the family business. David and Catherine Richardson had seven children, and Lewis was the youngest of this large family. He attended Newcastle Preparatory School where his favourite subject was the study of\nEuclid\n. Then in\n1894\nhe entered Bootham school in York which was a Quaker school established in\n1823\n, originally intended it to be for 'the sons of wealthy Quakers'. The education he received at Bootham school was important for him for, on the one hand he was directed towards science by J Edmund Clark, a master at the school who was an expert in meteorology, while on the other hand the Quaker beliefs in high morals and pacifism which he had been taught by his parents were reinforced. Despite gaining a love for science at this school he left believing that:-\n... science ought to be subordinate to morals.\nIt is interesting to see just how much this belief was reflected in the way he led his life and in the research topics in which he devoted so much effort. He left Bootham school in\n1898\nto spend two years in Newcastle attending the Durham College of Science. There he studied mathematics, physics, chemistry, botany and zoology. His education was completed at King's College, Cambridge, graduating with a First Class degree in the Natural Science Tripos in\n1903\n.\nRichardson held a large number of posts. He worked in the National Physical Laboratory\n(1903\n-\n04\n,\n1907\n-\n09)\nand the Meteorological Office\n(1913\n-\n16)\n, and he held university posts at University College Aberystwyth\n(1905\n-\n06)\nand Manchester College of Technology\n(1912\n-\n13)\n. In addition he was a chemist with National Peat Industries\n(1906\n-\n07)\nand in charge of the physical and chemical laboratory of the Sunbeam Lamp Company\n(1909\n-\n12)\n. He married Dorothy Garnett in\n1909\nand although they had no children of their own, they adopted two sons and a daughter.\nWhen World War I broke out in\n1914\nRichardson was working for he Meteorological Office as superintendent of the Eskdalemuir Observatory. In line with his Quaker beliefs he declared himself a conscientious objector so he could not be drafted into the military. However, being a conscientious objector meant that he was never again eligible for university posts. Being a conscientious objector, however, did not mean that Richardson was not involved in the War. On the contrary he did outstanding war work serving from\n1916\nto\n1919\nin the Friend's Ambulance Unit which was attached to the\n16\nth\nFrench Infantry Division.\nAfter his work with the Friend's Ambulance Unit had ended, he returned to his position in the Meteorological Office. However in\n1920\nthe Meteorological Office became part of the Air Ministry which would have meant that Richardson would have become part of the military. There was no way that his pacifist beliefs would allow him to continue in the Meteorological Office after this change, so he resigned. From\n1920\nto\n1929\nRichardson was head of the Physics Department at Westminster Training College, then from\n1929\nto\n1940\n, he was Principal of Paisley College of Technology and School of Art in Scotland. He retired in\n1940\nat the age of\n59\nso that he could concentrate on his research.\nIt was Richardson who was the first to apply mathematics, in particular the method of finite differences, to predicting the weather in\nWeather Prediction by Numerical Process\n(1922)\n. He first developed his method of finite differences in order to solve differential equations which arose in his work for the National Peat Industries concerning the flow of water in peat. Having developed these methods by which he was able to obtain highly accurate solutions, it was a natural step to apply the same methods to solve the problems of the dynamics of the atmosphere which he encountered in his work for the Meteorological Office. In this important treatise he used data from work by Vilhelm Bjerknes published in\nDynamical meteorology and hydrography\nand constructed, in his own words:-\n... a scheme of weather prediction which resembles the process by which the Nautical Almanac is produced in so far as it is founded upon the differential equations and not upon the partial recurrence of phenomena in their ensemble.\nMaking observations from weather stations would provide data which defined the initial conditions, then the equations could be solved with these initial conditions and a prediction of the weather could be made. It was a remarkable piece of work but in a sense it was ahead of its time since the time taken for the necessary hand calculations in a pre-computer age took so long that, even with many people working to solve the equations, the solution would be found far too late to be useful to predict the weather. He calculated himself that it would need\n60\n,\n000\npeople involved in the calculations in order to have the prediction of tomorrow's weather before the weather actually arrived. Despite this, Richardson's work laid the foundations for present day weather forecasting.\nIn addition to his\n1922\nbook, Richardson published about\n30\npapers on the mathematics of the weather and in these he made contributions to the calculus and to the theory of diffusion, in particular eddy-diffusion in the atmosphere. The 'Richardson number', a fundamental quantity involving gradients of temperature and wind velocity is named after him. His achievements were recognised by election to the\nRoyal Society\nin\n1926\n.\nAnother application of mathematics by Richardson was in his study of the causes of war and he published the results of his analysis in a number of major books:\nGeneralized Foreign Politics\n(1939)\n,\nArms and Insecurity\n(1949)\n, and\nStatistics of Deadly Quarrels\n(1950)\n. Again Richardson made novel applications of mathematics. Previously it had been assumed that war was a rational national policy, to be used in the interests of a nation. However the way that Richardson modelled the causes of war was quite different, giving systems of differential equations which governed the interactions between countries caused by such things as attitudes and moods. Here were quantities which were little to do with individual leaders yet, he claimed, were major factors. Psychology of a whole population was what was relevant, an underlying factor which emerged when attitudes of individuals were averaged. As he wrote:-\nThe equations are merely a description of what people would do if they did not stop and think.\nHis first paper on this topic\nThe mathematical psychology of war\nwas written in\n1919\nand privately printed at that time. It was not widely published until\n1935\n. In fact before this Richardson had returned to university study and obtained a B.Sc. in psychology as an external University College, London, student in\n1929\n.\nHe set up equations governing arms build-up by nations, taking into account factors such as the expense of an arms race, grievances between states, ambitions of states, etc. Choosing different values for the various parameters in the equation he then tried to investigate when situations were stable and when they were unstable. It is clear that in all this work he had no false illusions regarding its value for contributing to the prevention of wars, yet he was clearly motivated by his strong hatred of war. Unlike some who believe that war is part of the normal behaviour of nations, he clearly treated war as an affliction from which the human race was suffering.\nAfter he retired from Paisley College of Technology in\n1940\nRichardson began another major piece of work related to wars. He gathered data on all \"deadly quarrels\" that had taken place since the end of the Napoleonic Wars. He developed a magnitude scale for such quarrels defined to be the logarithm of the number who were killed. He then analysed a large number of factors associated with such \"deadly quarrels\" looking for relations between them. Is there a relation between the frequency or wars and their magnitude? Is there a relation between frequency and a common language for the two sides? Is there a relation between frequency and a common religion? Is there one between frequency and common frontiers?\nHe looked for factors which would reduce the frequency of wars. Do sporting fixtures between nations reduce the frequency of war? Does strong military force on each side reduce the chance of war? Does a common hatred of a third country reduce the chance of war between two countries? It is a fascinating approach to try to understand war, yet none of the factors Richardson investigated seemed statistically significant. The most promising factor to prevent war between two countries appeared to be strong international trade between them. Rapoport writes in\n[\n6\n]\n:-\n... hardly anything in the way of new knowledge as to the \"causes\" of wars has emerged from this monumental analysis, unless one views as new the refutation of established notions by negative results. In particular, neither armed might nor collective security measures\n(\ncontrary to widespread opinion\n)\nemerge as significant war-preventing influences.\nGold writes in about Richardson's character in\n[\n5\n]\n:-\nResearch for Richardson was the inevitable consequence of the tendency of his mental machine to run almost, but not quite, by itself. So he was a bad listener, distracted by his thoughts, and a bad driver, seeing his dream instead of the traffic. The same tendency explains why he sometimes appeared abrupt in manner, otherwise inexplicable in one of his character. In the motor convoy in France he evoked the affection of all and demonstrated the dignity of service by the simplicity with which he performed the most menial tasks; that character of kindness and service was maintained at Westminster and Paisley."
}