{
  "nome_completo": "Linda Goldway Keen",
  "nome_curto": "Linda Goldway Keen",
  "ano_nascimento": "1940",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Keen/",
  "lugar_nascimento": "New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Linda Goldway Keen\nwas Linda Goldway until her marriage. Her father was an English teacher in New York but, despite his area of academic interest, he was happy to see his daughter Linda attend the Bronx High School of Science in New York City which of course specialised in science. At this High School she was turned on to mathematics by her study of geometry. As sometimes happens, although her father was always highly supportive of the direction his daughter wished to take, there was also an element of reacting against her father's subject. She said\n[\n1\n]\n:-\n... not only was mathematics fascinating, but it seemed as far away from English as I could get.\nGraduating from the Bronx High School of Science, Goldway she entered the City College of New York, gaining a B.S. in\n1960\n. Remaining in New York, she was awarded a Master's Degree by New York University in\n1960\n, then studied for her Ph.D. at the\nCourant\nInstitute of Mathematical Sciences.\nHer doctoral supervisor was\nLipa Bers\nwho had worked at the Courant Institute for about\n10\nyears before he began to supervise Keen. He left the Institute in\n1964\n, the year in which Keen was awarded her Ph.D. Her research involved studying the interplay between the analytic and geometric aspects of classifying\nRiemann\nsurfaces. She described the background to this work in the\nEmmy Noether\nLecture which she gave in\n1993\n. This part was summarised as follows:-\nIn the early\n1960\ns,\nBers\nand\nAhlfors\nshowed that the space of conformal structures on a given\nRiemann\nsurface can be modelled on a Banach space with a real analytic structure. Keen defined the set of parameters for this space in terms of the hyperbolic structure of a given surface determined by the conformal structure.\nAfter receiving her Ph.D. Keen spent a year at the Institute for Advanced Study at Princeton. During this year she published\nCanonical polygons for finitely generated Fuchsian groups\nin\nActa Mathematica\n. In it Keen showed that for each standard fundamental region for a finitely generated Fuchsian group, acting on the unit disk, there exists a convex\nFricke\npolygon which has the same set of generators. The method of proof followed variational techniques which had been introduced earlier by her Ph.D. supervisor\nBers\n. In the following year she used methods which she had developed in this first paper to give a geometrical approach to the problem of moduli in\nIntrinsic moduli on\nRiemann\nsurfaces\npublished in the\nAnnals of Mathematics\n. In this paper she constructed a fundamental polygon for the Fuchsian group representing a marked\nRiemann\nsurface.\nAfter spending\n1964\n-\n65\nat the Institute for Advanced Study, Keen took up posts in the City University of New York. There she was attached to the Graduate School and University Center, and also to Hunter College. Hunter College had started out as a teacher-training institution for women but from\n1921\nit had accepted men to graduate studies. It became a fully coeducational autonomous College of the City University of New York in\n1964\n, shortly before Keen took up her post there.\nIn\n1968\nLehman College, which had been Hunter College's Bronx campus since it opened in\n1931\n, split off as a separate autonomous College affiliated with CUNY. When Lehman College split from Hunter College, Keen joined it and has remained on the staff since that time. She was promoted to a full professor in\n1974\nand later held dual appointments in both the Mathematics and Computer Science Departments.\nWe should mention some more important work undertaken by Keen. In the\n1980\ns she collaborated with Caroline Series on work on\nRiemann\nsurfaces which returned to ideas that she had studied for her doctoral thesis:-\nBy this time,\nBers\nhad proved that the space of conformal structures on\nRiemann\nsurfaces admits a complex analytic structure, and Maskit had defined an embedding of that space into complex\nn\nn\nn\n-dimensional space for appropriate\nn\nn\nn\n. Using powerful techniques developed by\nThurston\nthat involve hyperbolic three-manifolds, Keen and Series gave a geometric interpretation to Maskit's parameters.\nMuch of Keen's work has been done in collaborations with other mathematicians and after her work with Caroline Series she teamed up with Paul Blanchard, Robert Devaney, and Lisa Goldberg to produce important results on dynamical systems. She teamed up again with Caroline Series for their joint article\nPleating invariants for punctured torus groups\n(2004)\n. John R Parker writes:-\nThe details of how the pleating planes fill out quasi-Fuchsian punctured torus space and how their boundaries meet the space of Fuchsian punctured torus groups are determined by the combinatorial patterns of how the laminations intersect and the analysis of their length functions. There is much subtlety and the whole picture is strikingly elegant.\nKeen, working with Nikola Lakic, wrote the book\nHyperbolic geometry from a local viewpoint\nwhich was published in\n2007\nby Cambridge University Press in the\nLondon Mathematical Society\nStudent Texts series. The text on the back cover of the book reads:-\nWritten for graduate students, and accessible to upper-level undergraduates, this book presents topics in two-dimensional hyperbolic geometry. The authors begin with rigid motions in the plane, which are used as motivation for a full development of hyperbolic geometry in the unit disk. The approach is to define metrics from an infinitesimal point of view: first the density is defined and then the metric via integration. The study of hyperbolic geometry in arbitrary domains requires the concepts of surfaces and covering spaces as well as uniformization and Fuchsian groups. These ideas are developed in the context of what is used later. The authors then provide a detailed discussion of hyperbolic geometry for arbitrary plane domains. New material on hyperbolic and hyperbolic-like metrics is presented. These are dynamical generalizations of the Kobayashi and Carathéodory metrics for plane domains. The book concludes with applications to\nholomorphic\ndynamics, including new results and accessible open problems.\nWe have quoted above from the summary of her\nEmmy Noether\nLecture\nHyperbolic Geometry and Spaces of Riemann Surfaces\ngiven at San Antonio, Texas in\n1993\n. The\nEmmy Noether\nLectures are a prestigious series of lectures organised by the Association for Women in Mathematics. Keen served as President of this organisation during\n1985\n-\n1986\n. Later, during\n1992\n-\n1995\n, she was honoured by being elected to serve as Vice-President of the\nAmerican Mathematical Society\n. She chaired the Committee on Professional Ethics which sought to draw up guidelines for professional mathematicians on issues such as giving credit to others for their contributions, responsible refereeing of papers, and important issues involving interactions between mathematicians and governments, and mathematicians and industry.\nAmong other contributions made by Keen, we should mention her editorial work with publications such as the\nJournal of Geometric Analysis\n, the\nAnnales of the\nFinnish Academy of Sciences\n, and the\nProceedings of the\nAmerican Mathematical Society\n.\nShe has acknowledged the help of those around her with her career:-\nI feel very lucky. First my father, then my thesis advisor, and finally my husband and children have been extremely supportive."
}