{
  "nome_completo": "Lodovico Ferrari",
  "nome_curto": "Lodovico Ferrari",
  "ano_nascimento": "1522",
  "ano_morte": "1565",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferrari/",
  "lugar_nascimento": "Bologna, Papal States (now Italy)",
  "lugar_morte": "Bologna, Papal States (now Italy)",
  "biografia": "Lodovico Ferrari\n's grandfather, Bartholomew Ferrari, was forced to leave his home town of Milan and settled in Bologna. This was a particularly difficult time for those living in the north of Italy for not only did powerful families control towns and try to extend their influence by force, but also the French, the Holy Roman Emperor, and the Pope, all tried to take territory with their armies. Bartholomew Ferrari had two sons, Vincent Ferrari and Alexander Ferrari, the latter being the father of Lodovico who is the subject of this biography. Initially brought up in his father's house, Lodovico went to live with his uncle Vincent after his father was killed. Vincent Ferrari had a son named Luke, a difficult young man, who decided to run away from home and seek employment. Luke went to Milan and there discovered that\nCardan\nwas looking for a servant. Work did not suit Luke much and after working for\nCardan\nfor a while he decided that things were better back home and, without telling\nCardan\n, just left his house.\nCardan\ncontacted Vincent Ferrari requesting that he send his son back to continue his employment as a servant in his house. Vincent, however, saw his chance to keep his own son at home and offload the responsibility of supporting his cousin Lodovico, so instead of sending Luke back to\nCardan\nin Milan, he sent Lodovico.\nLodovico arrived at\nCardan\n's house on\n30\nNovember, a fourteen year old boy ready to take over his cousin Luke's position and become a servant.\nCardan\n, upon the discovery that the lad could read and write, exempted him from menial tasks and appointed the youngster as his secretary. It was soon clear to\nCardan\nthat his secretary was an exceptionally gifted young man and he decided to teach him mathematics. Ferrari repaid his master by helping him with his manuscripts and, when he was eighteen years old, he began to teach. When\nCardan\ngenerously resigned his post at the Piatti Foundation in Milan to make way for him in\n1541\n, Ferrari easily defeated Zuanne da Coi, his only rival for the post, in a debate and, at the age of twenty, became a public lecturer in geometry.\nCardan\nand Ferrari made remarkable progress on the foundations that\nTartaglia\nhad unwillingly given them. They worked on problems set by Zuanne da Coi and eventually were able to extend solutions discovered in these special cases. Ferrari discovered the solution of the\nquartic equation\nin\n1540\nwith a quite beautiful argument but it relied on the solution of\ncubic equations\nso could not be published before the solution of the cubic had been published. However, there was no way to make this public without the breaking the sacred oath made by\nCardan\n. Despairing of ever publishing their ground breaking work,\nCardan\nand Ferrari travelled to Bologna to call upon their mathematical colleague, Annibale della Nave, who had been appointed there on the death of Scipione del\nFerro\n.\nCardan\nand Ferrari satisfied della Nave that they could solve the ubiquitous\ncosa\nand cube problem, and della Nave showed them in return the papers of the late del\nFerro\n, proving that\nTartaglia\nwas not the first to discover the solution of the cubic.\nCardan\npublished both the solution to the cubic and Ferrari's solution to the quartic in\nArs Magna\nⓉ\n(\nThe great art\n)\n(1545)\nconvinced that he could break his oath since\nTartaglia\nwas not the first to solve the cubic.\nTartaglia\nwas furious and Ferrari wrote to\nTartaglia\n, berating him mercilessly and challenging him to a public debate.\nTartaglia\nwas extremely reluctant to dispute with Ferrari, still a relatively unknown youngster, against whom even a victory would do little material good.\nTartaglia\nwrote back to Ferrari, trying to bring\nCardan\ninto the debate. Ferrari and\nTartaglia\nwrote fruitlessly to each other for about a year, trading the most offensive personal insults but achieving little in the way of resolving the dispute. Things seemed to fizzle out when suddenly, in\n1548\n,\nTartaglia\nreceived an impressive offer of a lecturing position in his home town, Brescia. To establish he was the man for the job,\nTartaglia\nwas asked to journey to Milan and conclude the contest with Ferrari.\nOn\n10\nAugust\n1548\n, the contest which all Italy wanted to see, for the correspondence between the two antagonists had taken the form of open letters, took place in the Church in the Garden of the Frati Zoccolanti in Milan. A huge crowd had gathered, and the Milanese celebrities came out in force, with Don Ferrante di Gonzaga,  governor of Milan, the supreme arbiter. Ferrari was confident of success, despite his inexperience in such matters, and brought a large crowd of friends and supporters. Alone but for his brother,\nTartaglia\nwas a vastly experienced disputant and also fancied his chances.\nBy the end of the first day, it was clear that things were not going\nTartaglia\n's way. He was unwilling to give Ferrari time to respond to his criticisms and when he did, it was Ferrari who got in the more telling blows. Ferrari clearly understood the cubic and quartic equations more thoroughly than his opponent who decided that he would leave Milan that very night and thus leave the contest unresolved, so victory went to Ferrari. On the strength of this challenge, Ferrari's fame soared and he was inundated with offers of employment, including a request from the emperor himself, who wanted a tutor for his son.\nFerrari fancied a more financially rewarding position though, and took up an appointment as tax assessor to the governor of Milan, Ferrando Gonzaga. After transferring to the service of the church, he retired as a young and very rich man. He moved back to his home town of Bologna where he lived with his widowed sister Maddalena, and was called to a professorship of mathematics at the University of Bologna in\n1565\nbut, sadly, Ferrari died later that year. It is claimed that he died of white arsenic poisoning, administered by his own sister. Certainly, according to\nCardan\n, Maddalena refused to grieve at her brother's funeral and, having inherited Ferrari's fortune, she remarried two weeks later. Having transferred all her possessions to her new husband, he promptly left her and she died in poverty."
}