{
  "nome_completo": "Louis de Branges de Bourcia",
  "nome_curto": "Louis de Branges",
  "ano_nascimento": "1932",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Branges/",
  "lugar_nascimento": "Neuilly-sur-Seine, Paris, France",
  "lugar_morte": null,
  "biografia": "Louis de Branges\nwas born in Neuilly-sur-Seine, a residential suburb of Paris lying to the northwest of the centre of the city. His father, also named Louis de Branges, had been born into a French-American family living in Wayne, a suburb of Philadelphia in the United States. On\n8\nAugust\n1931\nin Ontario, Canada, he married Diane McDonald, the daughter of Ellice McDonald, a surgeon and professor at the University of Pennsylvania. Shortly after Louis de Branges, who was twenty-five years old, sailed with his wife to France where they settled into an apartment in the Square du Roule, Paris. He obtained a position with the Compagnie Générale Transatlantique, a major French shipping company. Louis and Diane had three children, Louis\n(\nthe subject of this biography\n)\n, Elise\n(\nborn\n1935)\n, and Eéonore\n(\nborn\n1938)\n. One of the perks of working for a shipping company was a free trip to New York each year and this trip was always made by Diane and children so Louis\n(\nthe subject of this biography\n)\n, although brought up in France, was in the United States when a child and met his American relations.\nLouis began his education in Louveciennes, in the western suburbs of Paris, in\n1937\n. In\n1939\n, when Louis was seven years old, World War II began and his father enlisted in the French Army. In May\n1940\nthe German army attacked France and quickly forced the French and British armies to retreat to Dunkirk where they were evacuated to England. Louis's father was among the French troops evacuated but he soon returned by ship to France. Despite the war Louis continued his education at Louveciennes spending his third year at the school although by this time the school buildings could not be used as they had been taken over as a German military headquarters and the de Branges' home was occupied by German soldiers. In\n1941\nDiane's father persuaded his daughter to return to the United States and she went with her children, taking a train to Lisbon from where they managed to get a passage on a ship sailing to New York. Louis's father remained in France.\nThe family settled first in Rehoboth Beach, Delaware but then moved to a house near Wilmington and de Branges entered Saint Andrew's School in Middletown, Delaware. He writes\n[\n2\n]\n:-\nThe transition to English as a language seems to have stimulated mathematical ability. ... The end of childhood was caused by two events when I was twelve. I entered the second form at Saint Andrew's School as the cottage in Rehoboth was sold. My new home was the house near Wilmington which my grandparents were building when I came from France. My grandmother replaced my mother as the central person in family life.\nAt Saint Andrew's School, de Branges studied hard aware that his grandmother was finding life harder because of the dependence of his mother and her children. He solved hundreds of algebra problems on his own but he was driven to work hard on a problem given to him by Irénée du Pont, a wealthy friend of de Branges' grandfather. The problem was to find integers\na\n,\nb\na, b\na\n,\nb\nand\nc\nc\nc\nsuch that\na\n3\n+\nb\n3\n=\n22\nc\n3\na^{3} + b^{3} = 22c^{3}\na\n3\n+\nb\n3\n=\n2\n2\nc\n3\n.\nThis problem, known as the\nLagrange\nproblem, took de Branges over a year to solve, but during that time he learnt a lot of mathematics\n[\n2\n]\n:-\nThe\nLagrange\nproblem taught me to work without expecting reward and yet believing that I would benefit from the work done. The\nLagrange\nproblem also taught me to search for mathematical information from non-mathematical sources.\nIt was de Branges' grandfather who decided that he should go to university, but the choice of the Massachusetts Institute of Technology was probably made at Irénée du Pont's suggestion. After graduating from Saint Andrew's School, de Branges took the entrance examinations and began his studies in Boston in September\n1949\n[\n2\n]\n:-\nI treated my undergraduate studies as if I were a graduate student. George Thomas was writing a text on the calculus and analytic geometry which was tested on the incoming freshman class. Professor Thomas himself taught the section in which I was placed. I worked through the exercises for all four semesters and was exempted from the remaining three semesters by a proficiency examination. Professor Thomas was pleased by my reading of his untested lecture notes. ... I was freed in the second semester to take a graduate course in linear analysis taught by\nWitold Hurewicz\n. ... In the summer break I read the recently published Lectures on Classical Differential Geometry by\nDirk Struik\n. When my knowledge was tested in a proficiency examination, Professor\nStruik\ngave me more than a perfect score since I had to correct the statement of one of the problems before solving it.\nIn his second year de Branges took\nWalter Rudin\n's course on the 'Principles of Mathematical Analysis'. By his third year he had made a decision that he would try to prove the\nRiemann hypothesis\n, an aim which would dominate his life from that point on. After graduating from the Massachusetts Institute of Technology in\n1953\n, de Branges went to Cornell University to undertake graduate studies for a doctorate\n[\n2\n]\n:-\n... in graduate years at Cornell University, ... I obtained a teaching assistantship on the recommendation of George Thomas. I approached graduate studies as if I were a postdoctoral fellow.\nHe attended a symposium on harmonic analysis at Cornell University in the summer\n1956\nand a problem arose in a lecture on the spectral theory of unbounded functions given by\nSzolem Mandelbrojt\n. He was encouraged to study this problem by Harry Pollard, and Wolfgang Fuchs advised him on the relevant literature\n[\n2\n]\n:-\nMy thesis, 'Local operators on Fourier transforms', clarifies the appearance of\nentire functions\nin the spectral theory of unbounded functions.\nHe was awarded a Ph.D. from Cornell University for this thesis in\n1957\n. After the award of his doctorate, de Branges was appointed as an Assistant Professor of Mathematics at Lafayette College in Easton, Pennsylvania. He spent two years at Lafayette, leaving in\n1959\nto spend the academic year\n1959\n-\n60\nat the Institute for Advanced Study at Princeton. He was appointed for the year\n1960\n-\n61\nas a lecturer at Bryn Mawr College following which he spent the year\n1961\n-\n62\nat the Courant Institute of Mathematical Sciences in New York. He was appointed as an Associate Professor of Mathematics at Purdue University in West Lafayette, Indiana, in\n1962\nand promoted to Professor in the following year. He has been on the Faculty at Purdue from that time onwards. In\n1963\n-\n66\nhe was an Alfred P Sloan Foundation Fellow, and in\n1967\n-\n68\na Guggenheim Fellow. He is currently Edward C Elliot Distinguished Professor of Mathematics at Purdue University.\nIn\n[\n7\n]\nde Branges spoke of his personal life, in particular about his first marriage which led to divorce:-\nI'd married a student from Bryn Mawr College, and all of a sudden she just left, asking for a very substantial amount of money which I didn't in any way contest. And then staying around in Lafayette for about ten years, that greatly created a circle of opposition within the community, because, you see, I was a person that was seen as being in the wrong by my colleagues, and also by the community. The divorce was seen as a criticism of myself, of my performance.\nDe Branges remarried on\n17\nDecember\n1980\nto Tatiana Jakimov. They have one son Konstantin.\nLet us now look at the remarkable mathematics de Branges has produced. After completing his doctorate, de Branges worked on\nHilbert spaces\nof entire functions. After publishing the results from his thesis in\n1958\n, he published five papers in\n1959\n, namely:\nThe Stone-Weierstrass theorem\n;\nSome mean squares of entire functions\n;\nSome Hilbert spaces of entire functions\n;\nThe Bernstein problem\n; and\nThe a-local operator problem\n. Following this, he published five papers entitled\nSome Hilbert spaces of entire functions\nwhich appeared in\n1960\n-\n62\n. The treatment of entire functions developed in these and subsequent papers by de Branges was published in his\n326\n-page book\nHilbert spaces of entire functions\nin\n1968\n.\nMost mathematicians will from time to time have errors in their work, usually in the form of missing steps in a proof. There are occasions when the phrase \"it is easily seen that\" hides an incorrect statement. Some would suggest that de Branges has made more mistakes than most, and if this is so then it is probably because of his remarkably innovative approach to mathematics\n[\n1\n]\n:-\nIt was observed by Rolf Schwarzenberger that mathematicians strive to be original but seldom in an original way. Louis de Branges is a courageous exception; his originality is his own.\nOf these errors, de Branges himself said\n[\n7\n]\n:-\nThe first case in which I made an error was in proving the existence of invariant subspaces for continuous transformations in\nHilbert\nspaces. This was something that happened in\n1964\n, and I declared something to be true which I was not able to substantiate. And the fact that I did that destroyed my career. My colleagues have never forgiven it.\nHowever, de Branges solved one of the most important conjectures in mathematics in\n1984\n, namely he solved the\nBieberbach conjecture\nwhich, as a result, is now called 'de Branges' theorem'. For this achievement he was awarded the\nOstrowski\nPrize, presented to him on\n4\nMay\n1990\nat the Mathematical Institute of the University of Basel. The citation reads\n[\n3\n]\n:-\nLouis de Branges of Purdue University has received the first\nOstrowski\nPrize for developing powerful\nHilbert\nspace methods which led him to a surprising proof of the\nBieberbach\nConjecture on power series for conformal mappings. ... After receiving his Ph.D. ... he began investigating the question of whether every bounded linear operator on\nHilbert\nspace has a non-trivial invariant subspace, and also worked on the\nRiemann\nhypothesis. However, his greatest accomplishment was the\n1984\nproof of the\nBieberbach\nConjecture, which surprised the mathematical world accustomed to small steps forward. In addition to that proof, he obtained certain more general results concerning conformal maps. His\nHilbert\nspace theory has contributed substantially to the understanding of these and other problems.\nHe was also awarded the\nAmerican Mathematical Society\n's\n1994\nSteele Prize. The citation gives details of his achievement\n[\n1\n]\n:-\nThe\nBieberbach\nConjecture, formulated in\n1916\nand the object of heroic efforts over the years by many outstanding mathematicians, was proved by de Branges in\n1984\n. The Steele Prize is awarded to him for the paper \"A proof of the\nBieberbach\nconjecture\" published in 'Acta Mathematica' in\n1985\n. The conjecture itself is simply stated. If\nf\n(\nz\n)\n=\nz\n+\na\n2\nz\n2\n+\na\n3\nz\n3\n+\na\n4\nz\n4\n+\n.\n.\n.\nf (z) = z + a_{2} z^{2} + a_{3} z^{3} + a_{4} z^{4} + ...\nf\n(\nz\n)\n=\nz\n+\na\n2\n​\nz\n2\n+\na\n3\n​\nz\n3\n+\na\n4\n​\nz\n4\n+\n.\n.\n.\nconverges for\n∣\nz\n∣\n<\n1\n|z| < 1\n∣\nz\n∣\n<\n1\nand takes distinct values at distinct points of the unit disc, then\n∣\na\nn\n∣\n≤\nn\n|a_{n}| ≤ n\n∣\na\nn\n​\n∣\n≤\nn\nfor all\nn\nn\nn\n. Equality is achieved only for the Koebe functions\nz\n(\n1\n+\nw\nz\n)\n2\n\\Large\\frac{z}{(1+wz)^2}\n(\n1\n+\nw\nz\n)\n2\nz\n​\nwhere\nw\nw\nw\nis a constant of absolute value\n1\n.\nThe classical ingredients of the proof, the\nLoewner\ndifferential equation and the inequalities conjectured by Robertson and Milin, as well as the\nAskey\n-Gasper inequalities from the theory of special functions, are clearly described in the volume 'The Bieberbach Conjecture'\n(\npublished by the\nAmerican Mathematical Society\n)\n. So is the generous reception of the Leningrad mathematicians to the efforts of de Branges to explain it and their help in the composition of the eminently readable 'Acta' paper.\nThe Milin inequality was known to imply the\nBieberbach\nconjecture, and Loewner had used his techniques in the\n1920\ns to deal with the third coefficient. For de Branges it was of capital importance that, in contrast to the Bieberbach conjecture itself, the Milin and Robertson conjectures were quadratic and thus statements about spaces of square-integrable analytic functions. The key was to find norms for which the necessary inequalities could be propagated by the Loewner equation. de Branges constructed the necessary coefficients from scratch, reducing the verification of the Milin conjecture\n(\nand thus of the\nBieberbach\nconjecture\n)\nfor a given integer\nn\nn\nn\nto a statement that was almost immediate for very small\nn\nn\nn\n, that could be verified numerically for small\nn\nn\nn\n, yielding many new cases of the conjecture, and that ultimately revealed itself to be an inequality established several years earlier by Askey and Gasper. The entire construction required a thorough mastery of the literature, formidable analytic imagination, and great tenacity of purpose.\nThe proof is now available in a form that can be verified by any experienced mathematician as analysis that is \"hard\" in the original aesthetic sense of\nHardy\n- simple algebraic manipulations linked by difficult inequalities. Although the mathematical community does not attach the same importance to the general functional-analytic principles that led to them as the author does, it is well to remember when recognising his achievement in proving the\nBieberbach\nconjecture that for de Branges its appeal, like that of other conjectures from classical function theory, is as a touchstone for his contributions to interpolation theory and spaces of square-summable analytic functions. Without anticipating the future in any way, the Society expresses its appreciation and admiration of past success and wishes him continuing prosperity and good fortune.\nIn his reply, de Branges spoke about his proof of the\nBieberbach\nconjecture and also about some later work\n[\n1\n]\n:-\nThis report begins with two acknowledgements. One is made to the\nAmerican Mathematical Society\nfor its continued endorsement of research related to the\nBieberbach\nconjecture. The Steele Prize is only the latest expression of its interest. It should be unnecessary to say that fundamental research cannot be sustained for long periods without the support of learned societies. The\nAmerican Mathematical Society\nhas earned a reputation as the world's foremost leader in fundamental scientific research.\nAnother acknowledgement is due to\nLudwig Bieberbach\nas a founder of that branch of twentieth century mathematics which has come to be known as functional analysis. This mathematical contribution has been obscured by his political allegiance to National Socialism, which caused the mass emigration of German mathematical talent, including many of the great founders of\nfunctional analysis\n. The issue which divided\nBieberbach\nfrom these illustrious colleagues is relevant to the present day because it concerns the teaching of mathematics.\nBieberbach\noriginated the widely held current view that mathematical teaching is not second to mathematical research. As a research mathematician he exhibited intuitive talent which surpassed his more precise colleagues. Yet the proof of his conjecture is a vindication of their more logical methods.\nThe proof of the\nBieberbach\nconjecture is difficult to motivate because it is part of a larger research programme whose aim is a proof of the\nRiemann\nhypothesis. ...\nDifficult problems were left unsolved by the proof of the\nBieberbach\nconjecture. Some of these have since been clarified. Progress has been made, for example, in the structure theory of canonical unitary linear systems and its applications to analytic function theory. Of particular interest is a generalisation of the\nBeurling\ninner-outer factorisation. This result is the culmination of a series of publications on canonical unitary linear systems whose state space is a\nKrein\nspace. They supplement a previous series on canonical unitary linear systems whose state space is a\nHilbert\nspace.\nProgress has also been made towards the initial objective of a proof of the Riemann hypothesis. The results are conjectured to be also relevant to the proof of the\nBieberbach\nconjecture. A positivity condition has been found for\nHilbert\nspaces of entire functions which is suggested by the theory of the gamma function. The condition appears, for example, in the structure theory of plane measures with respect to which the\nNewton\npolynomials form an orthogonal set.\nAt the International Congress of Mathematicians held in Berkeley, California, in August\n1986\n, de Branges was an invited plenary speaker and gave the address\nUnderlying concepts in the proof of the Bieberbach conjecture\n.\nNow we mentioned earlier that de Branges' life has been dominated by his aim to prove the\nRiemann\nhypothesis and he indicated in the above quote that his proof of the\nBieberbach\nconjecture is, in many ways, a consequence of the work he was doing attacking the\nRiemann\nhypothesis. In June\n2004\nhe announced on his website that he had a proof of the\nRiemann\nhypothesis and put a\n124\n-page paper up on the website to substantiate the claim. He has continued to revise the paper and also to work on another paper which would prove more general results but have the\nRiemann\nhypothesis as a corollary. This paper is now on his website. Most mathematicians doubt that de Branges' proof is correct but, of course, even if it is not correct it is not impossible that the ideas that it contains could eventually lead to a correct proof. In December\n2008\n, de Branges posted a paper on his website which claimed to prove the invariant subspace conjecture of which he had given an incorrect proof in\n1964\n.\nThe paper\n[\n7\n]\ngives details of an interview with de Branges. In this interview he gave some fascinating insights into his ways of thinking:-\nMy mind is not very flexible. I concentrate on one thing and I am incapable of keeping an overall picture. So when I focus on the one thing, I actually forget about the rest of it, and so then I see that at some later time the memory does put it together and there's been an omission. So when that happens then I have to be very careful with myself that I don't fall into some sort of a depression or something like that. You expect that something's going to happen and a major change has taken place, and what you have to realise at that point is that you are vulnerable and that you have to give yourself time to wait until the truth comes out.\nLet us end this biography by giving two quotes, the first from\nAtle Selberg\n[\n7\n]\n:-\nThe thing is it's very dangerous to have a fixed idea. A person with a fixed idea will always find some way of convincing himself in the end that he is right. Louis de Branges has committed a lot of mistakes in his life. Mathematically he is not the most reliable source in that sense. As I once said to someone - it's a somewhat malicious jest but occasionally I engage in that - after finally they had verified that he had made this result on the\nBieberbach\nConjecture, I said that Louis de Branges has made all kinds of mistakes, and this time he has made the mistake of being right.\nSecond, let us quote\nBela Bollobás\nwho writes\n[\n7\n]\n:-\nDe Branges is undoubtedly an ingenious mathematician, who established his excellent credentials by settling\nBieberbach\n's Conjecture ... Unfortunately, his reputation is somewhat tainted by several claims he made in the past, whose proofs eventually collapsed. I very much hope that this is not the case on this occasion: it is certainly not impossible that this time he has really hit the jackpot by tenaciously pursuing the\nHilbert\nspace approach. Mathematics is always considered to be a young man's game, so it would be most interesting if a\n70\n-year-old mathematician were to prove the\nRiemann\nHypothesis, which has been considered to be the Holy Grail of mathematics for about a hundred years."
}