{
  "nome_completo": "Louis Melville Milne-Thomson",
  "nome_curto": "Louis Melville Milne-Thomson",
  "ano_nascimento": "1891",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Milne-Thomson/",
  "lugar_nascimento": "Ealing, London, England",
  "lugar_morte": "Sevenoaks, Kent, England",
  "biografia": "Louis Melville Milne-Thomson\n's mother was Eva Mary Milne, the daughter of the Revd J Milne, and his father was Colonel Alexander Milne-Thomson who was a physician and surgeon. Louis was the eldest of his parents' sons. Milne-Thomson entered Clifton College in Bristol in\n1906\nas a classical scholar and in his final year at the College he won a scholarship to study mathematics at Corpus Christi College, Cambridge. Entering Cambridge in\n1909\nhe took part I of the Mathematical Tripos in\n1911\n, achieving a First Class, and graduated with distinction as a\nWrangler\nin\n1913\n.\nMilne-Thomson was appointed as an assistant mathematics master at Winchester College in\n1914\n. This is one of the oldest of the famous public schools of England, founded in\n1382\n, and is situated in Winchester, Hampshire. On\n12\nSeptember\n1914\n, shortly after he took up his appointment, Milne-Thomson married Gertrude Frommknecht; the marriage produced three daughters. After teaching for seven years at Winchester College, Milne-Thomson left in\n1921\nto take up an appointment as professor of mathematics at the Royal Naval College in Greenwich.\nThe most important topic that Milne-Thomson undertook research on near the start of his career was compiling tables. His first publication on this topic was undertaken jointly with an established table constructor, L J Comrie. Their\nStandard Four Figure Mathematical Tables\n(1931)\nwas used for many years. A year later he published\nStandard table of square roots\nand\nJacobian Elliptic Function Tables\n. The second of these was written in German but it was published in English in\n1950\n. S C van Veen, reviewing the tables, writes:-\nThe chief problem in using\nelliptic functions\nhas always been the lack of suitable numerical tables. Therefore the collection of tables, compiled by the author is an excellent manual, which supplies a long-felt want. ... A comprehensive collection of formulae is included, and many numerical examples are given in order to illustrate the use of these tables. The formulae have been carefully chosen with a view to facilitating calculations which may present themselves. Formulae special to particular branches of knowledge are not included, with the exception of some conformal transformations which cover ground common to several sciences.\nOf course the main mathematical tool used in constructing tables was the method of finite differences and in\n1933\nMilne-Thomson published his first textbook,\nThe Calculus of Finite Differences\n, a text in which he set out to explain to students the techniques which he used in table making. He taught these methods to his students in the Royal Naval College in Greenwich and they found his clearly written text a great asset. The book became a classic student text and the original text was reprinted in\n1951\n.\nHis next text was also to become a classic but it marked a change in direction in Milne-Thomson's research interests. This text was\nTheoretical Hydrodynamics\nwhich was first published in\n1938\n. A second edition of the work appeared in\n1950\nand contained some additional material, partly based on his own work during the intervening years. He writes:-\nApart from rearrangements and new methods of presentation this edition differs from its predecessor in three important particulars: the introduction of the circle theorem\n[\nMilne-Thomson\n(1940)]\n, whereby the disturbance of a given two-dimensional flow by the introduction of a circular cylinder can be written down without calculation; the corresponding theorem for the sphere\n[\nP Weiss\n(1944)]\n; the addition of a chapter on the flow of compressible fluids.\nThree further additions of new material were added for the third edition which was published in\n1956\n, then still more material was added for the fourth edition in\n1960\nand again for a fifth edition which appeared in\n1968\n. Similarly\nTheoretical Aerodynamics\n, first published in\n1948\n, went though a number of editions with the fourth appearing twenty years later in\n1968\n.\nIn\n1956\nMilne-Thomson reached the age of sixty-five years and retired from the Royal Naval College in Greenwich. He then took up various posts as Visiting Professor at institutions throughout the world: Applied Mathematics at Brown\nUniversity, Rhode Island; the US Army Mathematics Research Center at the University of Wisconsin from\n1958\nto\n1960\nwhere he worked on plane and antiplane elastic problems; the University of Arizona from\n1961\nto\n1970\nwhere he led a very active group of research students; the University of Rome in\n1968\n; the University of Queensland in\n1969\n; the University of Calgary in\n1970\n; and the University of Otago in\n1971\n. By\n1971\nhe had reached the age of eighty and felt that he really did want to retire and went to live in Sevenoaks, Kent.\nLet us now look briefly at some papers which Milne-Thomson published between\n1940\nand his final paper in\n1972\n. In\nHydrodynamical images\n(1940)\nhe finds the flow about any two-dimensional cylinder. In\n1948\nhe published\nApplications of elliptic functions to wind tunnel interference\nwhile in\n1957\nhe wrote a review paper\nA general solution of the equations of hydrodynamics\nwhich M G Scherberg reviews as follows:-\nTo write a review having at least the brevity of this elegant use of mathematics was not easy. The paper treats compressible or incompressible fluids of constant viscosity and finds the density, velocity and stress distribution in terms of an arbitrary function and a second rank arbitrary tensor.\nIn another paper\nSome hydrodynamical methods\nwritten in the same year Milne-Thomson gives us a flavour of his views on mathematics:-\nMathematics is about the logical consequences of assumed propositions, nowadays called axioms. Thus all mathematics is one. The fancied distinction between 'pure' and 'applied' is a modern and false dichotomy unknown to\nEuler\nand\nCauchy\n.\nAnother topic which interested him was stress. For example he wrote\nConsistency equations for the stresses in isotropic elastic and plastic materials\n(1942)\n, and\nStress in an infinite half-plane\n(1947)\n. He gave two lectures in Madrid in\n1951\non the elements of finite elasticity theory, the first lecture covering the topics of deformation tensors, stress, equations of motion, and energy. He published a monograph\nPlane elastic systems\nin\n1960\nand it was noted in a review that:-\n[\nt\n]\nhe particular clearness of the treatment as well as the mathematical accuracy are to be noticed.\nTwo years later Milne-Thomson published a sequel entitled\nAntiplane elastic systems\n. His final paper\nSome aspects of antiplane stress\nwas on similar topics. Here is his own summary of its contents:-\nImportant problems in the linear theory of the equilibrium of beams of isotropic elastic material have usually been approached by the so-called semi-inverse method, whereby a system of stresses or displacements is guessed and subsequently verified. It is, however, possible to look at these problems in such a way that guesswork is eliminated and reliance placed solely on the boundary conditions. Thus in the case of a cylinder suspended with its axis vertical under gravity, the mere fact that the lateral surface and the lower face are unloaded suffices to solve the problem. Again in the case of torsion the presence of a couple about the axis suffices to give the distribution which leads to the solution. In our opinion too much attention has in the past been given to displacements and strain coefficients and not enough to stress. It is stress, not strain, which should be stressed!\nMilne-Thomson received many honours for his achievements. He was elected a fellow of the\nRoyal Society of Edinburgh\non\n6\nMarch\n1933\n. He was also elected to the Royal Astronomical Society and the Cambridge Philosophical Society. In\n1952\nhe was made a CBE. Finally let us record that he listed sailing and foreign travel as his favourite recreations."
}