{
  "nome_completo": "Louis Lefébure de Fourcy",
  "nome_curto": "Louis Lefébure de Fourcy",
  "ano_nascimento": "1787",
  "ano_morte": "1869",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lefebure/",
  "lugar_nascimento": "Port-au-Prince, Saint-Domingue, now Haiti",
  "lugar_morte": "Paris, France",
  "biografia": "Louis Lefébure de Fourcy\nwas born in Port-au-Prince, a city laid out by the French in\n1749\nwhen it was named L'Hôpital. In\n1770\nit became the capital of the French colony of Saint-Domingue. His father, Étienne-Louis Lefebvre, called himself Lefebvre du Coudray but, when he married in Saint-Domingue, it was under the name Étienne-Louis Lefebvre de Fourcy. The French colony of Saint-Domingue was, by the middle of the\n18\nth\ncentury, the most prosperous of France's possessions. Its wealth came from plantation agriculture and it was in this business that Étienne-Louis worked. The environmental damage caused by clearing trees for plantations led to marked drops in productivity and this, together with political problems from a growing independence movement, meant that Étienne-Louis had hit hard times by the time his son was born. His son was given the name Louis Lefébure de Fourcy and this version appears on surviving baptismal records. The child only spent the first couple of years of his life in Saint-Domingue for, by\n1789\n, his mother had brought him to France. His father remained in Saint-Domingue where rebellions against French rule broke out in\n1891\n. Étienne-Louis Lefebvre died in Saint-Domingue in\n1794\n.\nLouis Lefébure de Fourcy spent his childhood in Nantes but was sent to Paris to complete his education at the Collège de la Marine et des Colonies. From there he won a scholarship to study at the École Polytechnique which he entered in\n1803\nat the age of sixteen. Among those who entered in the same year, we mention\nFrançois Arago\n,\nCharles-Julien Brianchon\nand\nClaude-Louis Mathieu\n. These were the early years of the École Polytechnique during which it operated out of buildings attached to the Palais Bourbon, where the French parliament met. The three years that Lefébure de Fourcy spent at the École Polytechnique were, of course, years during which France was in the grip of the French Revolution. One consequence of this was that Lefébure, as we shall name him for the remainder of this biography, dropped the aristocratic \"de Fourcy\" in his name. Rather more surprising, however, is that he registered under his father's name so during his studies he was known as Étienne-Louis Lefebvre. France had adopted the revolutionary calendar so Lefébure and his fellow students studied for eight and a half days in each\n10\nday week at the École Polytechnique. Ivor Grattan-Guinness writes\n[\n3\n]\n:-\nThe dominant role of mathematics soon led the students to deploy the catchword 'X' as a name for the school.\nNote that Roland Brasseur refers to the École Polytechnique as X throughout the article\n[\n2\n]\n. Lefébure graduated from the École Polytechnique in\n1805\nand enrolled in the École d'artillerie in Metz. However, he left almost immediately and was appointed to the Pont-Levoy College in Loir-et-Cher. His circumstances had changed in January\n1806\nwhich may have been the reason for the change in his plans. After the death of his father in\n1794\n, his mother had remarried and had two sons before separating from her new husband. She died in January\n1806\nand this left Lefébure responsible for bringing up his two half-brothers. By May\n1807\nhe was back in Paris at the École Polytechnique where he was appointed as an assistant répétiteur in analysis. Things had changed since he was a student. Napoleon Bonapart was now emperor of France and he had given the École Polytechnique a more military look. It had also moved from the buildings it had occupied when Lefébure was a student, to occupy two colleges not far from the Panthéon. He was awarded a doctorate in\n1811\nafter submitting two theses. One, on mechanics,\nÉquations générales du mouvement des fluides et application de ces équations à la théorie du son\nⓉ\n(\nGeneral equations of fluid motion and application of these equations to the theory of sound\n)\nconsisted of five pages, while the second, on astronomy,\nDe l'attraction des sphéroïdes et de la figure des planètes\nⓉ\n(\nOn the attraction of spheroids and the shape of planets\n)\n, contained eleven pages. He dedicated these works to\nSylvestre Lacroix\nwho must have acted as an advisor.\nHe became a répétiteur in analysis in\n1813\nand in applied analysis in the following year. Around this time there were major changes in France with the defeat of Napoleon in\n1814\nand the restoration of the monarchy. As a result of these changes, Lefébure stopped using his father's name and went back to signing himself Louis Lefébure de Fourcy. He became a répétiteur in descriptive geometry in\n1815\nand, from\n1817\nto\n1820\n, he was an examiner in descriptive geometry and the 'graphic arts'. In addition to his duties at the École Polytechnique, Lefébure was appointed to teach mathematics at the College Louis-le-Grand in December\n1814\n. He had married Marie Françoise Victoire Peyron and they had two sons, Michel-Eugene Lefébure de Fourcy born in November\n1812\nand Charles Lefébure de Fourcy born in\n1815\n. Michel-Eugene became an engineer and married three times. His first wife was Anne Lassale\n(1809\n-\n1844)\n, his second wife Victoire-Anaïs Mousset\n(1824\n-\n1847)\n, and his third wife being Marie Stéphanie Lamé\n(1824\n-\n1909)\n,\nGabriel Lamé\n's daughter. Charles Lefébure de Fourcy became Inspector General of Roads and Bridges and participated in the building of the Suez Canal. He married Nathalie Hennequin\n(1822\n-\n1903)\n.\nAt Louis-le-Grand, Louis Lefébure de Fourcy was promoted to teach the special class in October\n1817\n. Of the\n21\nstudents in the special class of\n1817\n-\n18\n, one was the poet, novelist, and dramatist, Victor Hugo. Many years later, he spoke about his mathematics teacher:-\nProfessor M Lefebure de Fourcy, lanky with shoulders which incongruously supported a long pockmarked face, had energy and wit. He crossed the class in a stride, giving rapid demonstrations, streaking the table with lines.\nThe special mathematics class was held every afternoon, Monday to Saturday. As to its content, Victor Hugo explained that the course did not have:-\n... a detailed plan, but a list of books by which it is taught, and the authors for the mathematics texts are\nEuler\n,\nLagrange\nand\nLacroix\nin algebra,\nLacroix\nor\nBiot\nfor applications of algebra to geometry,\nMonge\nand\nPoinsot\nfor statics, and\nDelambre\nor\nBiot\nfor astronomy.\nThe Royal College of Saint-Louis was founded in\n1820\nand Lefébure was appointed as professor of mathematics. There he taught the special class and among his pupils we mention in particular\nJoseph Liouville\n. Lefébure taught at the College of Saint-Louis for five years, leaving in December\n1825\nwhen he was appointed as an assistant to\nSylvestre Lacroix\nat the faculty of Science in Paris. This led to his appointment as admissions examiner for the École Polytechnique in\n1826\n. Ivor Grattan-Guinness explains\n[\n3\n]\n:-\nStudents were chosen by admissions examiners. The country was divided into four regions, and also Paris, and an examiner travelled in a region for some weeks during the summer to interview promising young boys nominated by local families or dignitaries. The examiners and some school officers then met and chose the enrolment for the following autumn.\nThe École Polytechnique declared that being an admissions examiner was incompatible with teaching, so Lefébure had free time which he devoted to writing student textbooks. He began publishing a series of books in\n1827\nand over the next few years various texts appeared:\nLeçons de géométrie analytique\nⓉ\n(\nLessons in analytic geometry\n)\n(1827)\n,\nThéories du plus grand commun diviseur algébrique et de l'élimination entre deux équations à deux inconnue\nⓉ\n(\nTheories of the algebraic greatest common divisor  and the elimination between two equations with two unknowns\n)\n(1827)\n,\nTraité de géométrie descriptive\nⓉ\n(\nTreatise on descriptive geometry\n)\n(2\nvols.\n1829\n-\n1830)\n,\nÉléments de trigonométrie\nⓉ\n(\nElements of trigonometry\n)\n(1830)\n,\nLeçons d'algèbre\nⓉ\n(\nAlgebra lessons\n)\n(1833)\n.\nThe title page of\nLeçons de géométrie analytique\nⓉ\n(\nAnalytic geometry lessons\n)\n(1827)\nlists Lefébure as:-\nChevalier de la Légion-d'Honneur, Examinateur des Aspirans à l'École Royale Polytechnique, à l'École Spéciale Militaire, à l'École de Marine et à l'École Forestière.\nⓉ\n(\nChevalier of the Legion of Honor, Examiner of midshipmen at the Royal Polytechni  School, the Military Academy and the School of Marine and Forestry School.\n)\nThis book contained a version of the lectures that Lefébure had given at the Royal College of Saint-Louis while he occupied the chair of Special Mathematics. The popularity of this book is indicated by the fact that by\n1881\na tenth edition had been produced.\nTraité de géométrie descriptive\nⓉ\n(\nTreatise on descriptive geometry\n)\nwas essentially translated into English by Thomas Grainger Hall, of King's College, London, when he wrote his book\nThe elements of descriptive geometry\n(1841)\n. In the Preface, Hall explains the position of descriptive geometry:-\nInvented by the genius of\nMonge\n, and pursued with ardour and success by the most eminent French geometricians, it is now taught in almost all universities and in the principal schools of the continent. In England it was unknown, as a branch of instruction, until lectures were given upon it by Mr\nBradley\n, in the Engineering Department of King's College; and the present work has been undertaken to supply the students with a text book, that by it they might the more profitably attend to what they heard in the lecture room: and as an elementary book was necessary for beginners, it has been thought expedient to place before the students, in an English dress, one which has stood the test of experience. The treatise on Descriptive geometry, by Mr Lefébure de Fourcy has, therefore, been selected, and the following pages are, for the most part, translated from it.\nLefébure's text was very popular and in\n1881\nthe eighth edition of the book was published. By\n1858\na seventh edition of\nÉléments de trigonométrie\nⓉ\n(\nElements of trigonometry\n)\nwas in print while\nLeçons d'algèbre\nⓉ\n(\nAlgebra lessons\n)\n, much revised over the years, was in its tenth edition in\n1893\n. In the Preface to the original\n1833\nedition of\nLeçons d'algèbre\nⓉ\n(\nAlgebra lessons\n)\n, Lefébure states:-\nIf I had limited the contents to that which is required for admission to the École Polytechnique, it would have formed a much less extensive volume.\nLefébure's books are praised by his son in\n[\n1\n]\nas having:-\n... good ordering of materials, elegant methods, and clarity of style.\nHowever, other have criticised them for being \"totally devoid of original ideas.\" It would be tempting to believe that their popularity might have come from the fact that many students trying to gain entry to top education institutions had to be examined by Lefébure. However, the popularity of these texts continued long after Lefébure ceased being an examiner.\nAs an examiner, Lefébure had a reputation which made the candidates extremely fearful. Together with\nLouis Benjamin Francoeur\nand\nJean Nicolas Pierre Hachette\n, Lefébure examined\nÉvariste Galois\nfor his baccalaureate on\n14\nDecember\n1828\n. By two votes to one, the decision of the examiners was that\nGalois\nshould not enter the École Polytechnique. Most students dreaded being examined by Lefébure and a report by an Inspector from the Paris\nAcademy of Sciences\nlets us see the reason:-\nSeveral times I attended oral examinations by Mr Lefébure de Fourcy and this is my impression. The professor cannot be considered a benevolent reviewer, his voice is harsh, his tone is dismissive, also he questioned in a very firm stiff manner, and showed no mercy for any errors of logic.\nIt was not only with students that Lefébure was severe and demanding, but he behaved in the same way towards his own sons. He prepared his son Michel-Eugene for the entrance examinations of the École Polytechnique. Michel-Eugene wrote\n[\n1\n]\n:-\nTwice a week, my father brought us together, one of my friends and I, in front of his old blackboard. I dreaded like fire these sessions, sometimes stormy bringing me to tears. If fear is the beginning of wisdom, perhaps that was how I entered the École Polytechnique at the first examination\n[\nin\n1829]\n.\nIn May\n1843\nLacroix\ndied and, in July of the same year, Lefébure succeeded him in the chair of differential and integral calculus at the Faculty of Science in Paris. He gave up his role of admissions examiner at the École Polytechnique at this time. However, he did not distinguish himself as a higher education lecturer. A report by an Inspector from the Paris\nAcademy of Sciences\n, written in\n1860\n, states that:-\n... his teaching is of a low standard, and has no originality. The Professor simply repeats what he has learned previously.\n[\nLefébure, who\n]\nacquired a good reputation in secondary education, is far from successful, however, in higher education.\nIt was around this time that his health began to fail and Lefébure retired from the Faculty of Science in September\n1863\n. His wife died in December of the following year after a painful illness throughout which, his son wrote, Lefébure suffered in silence. He died on\n12\nMarch\n1869\nand his funeral was held three days later at the Church of Saint-Sulphice. At the Montparnasse Cemetery an address was given by\nJoseph Serret\n."
}