{
  "nome_completo": "Lucien Auguste Godeaux",
  "nome_curto": "Lucien Godeaux",
  "ano_nascimento": "1887",
  "ano_morte": "1975",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Godeaux/",
  "lugar_nascimento": "Morlanwelz, Belgium",
  "lugar_morte": "Liège, Belgium",
  "biografia": "Lucien Godeaux\nwas the son of Auguste Godeaux\n(1850\n-\n1932)\nand his wife Léontine Godeaux\n(1848\n-\n1891)\n, in fact he was their sixth child and only son. Auguste Godeaux had married his German cousin Léontine, the daughter of a brother of his father, in\n1875\n. Of their five daughters, two died in infancy, and one Marthe-Augusta Godeaux\n(1876\n-\n1953)\nbecame famous as a poet and writer who published many works. For more information about Marthe-Augusta Godeaux, see\n[\n36\n]\n.\nAuguste Godeaux had been born into a simple working-class family in Chapelle-lez-Herlaimont, Belgium. In\n1864\n, at the age of\n14\n, he joined the Nicolas Gambier workshops in Morlanwelz. Work began at five in the morning and ended at seven in the evening, six days a week. Later he became a steam locomotive fitter-assembler in the Haine-Saint-Pierre construction workshops, then, in\n1867\n, he moved to the Mariemont coal mines as a maintenance fitter. He was able to work his way up through evening and weekend classes and studying books on his own. In\n1883\n, he became director of the \"École Industrielle\" in Morlanwelz. Léon Bartholomé writes in\n[\n2\n]\n:-\nA methodical mind, a stubborn, persevering and conscientious worker, a profoundly honest and just man, the son of a worker, a simple worker himself at the beginning of his career, Auguste Godeaux owed the position he occupied to his qualities alone; his life is a lesson and, something rare in such cases, he has been able to acquire perfect distinction.\nAs director of the \"École Industrielle\" in Morlanwelz, Auguste Godeaux demanded a lot from his staff, but set an example through his own hard work. He published many works, for example in Publications of the Society of Engineers of Hainaut, in the Universal Review of Mines, in Technical Education and his reports were published in the acts of the Councils of Technical Education of the provinces of Hainaut and Brabant.\nLucien was only three years old when his mother died in\n1891\n. Three years later his father Auguste Godeaux married a widow whose son, Raoul Le-chien\n(1881\n-\n1958)\n, became director of the Auxiliary Electricity Company. Lucien, however, suffered much through the loss of his mother. His schooling began in Morlanwelz, continued at several Athenaeums, and for the final years of his secondary education he studied at the Athénée d'Ath. In this school he impressed his teachers with his remarkable abilities. He was introduced to higher mathematics by his teachers Prosper Junius, Armand Nollet and Modeste Soons. They not only taught Godeaux beyond the school syllabus but they also allowed him to study further advanced texts which they had in their own libraries. In\n1905\nModeste Soons gave him a volume of the\nMemoirs\nof the Royal Society of Sciences of Liège containing two works, one written by Jacques Deruyts, the other by François Deruyts, which were a revelation to him. He also had access to his teachers'\nMathesis\ncollection and to the\nBulletins\nof the Academy in the city of Ath library. He began to publish mathematical papers in\n1905\nwhile at the school in Alt, the first being in\nMathesis\n. He then published\nApplication des méthodes géomctrographiques au tracé mécanique des courbes planes\nⓉ\n(\nApplication of geometrical methods to the mechanical tracing of plane curves\n)\nin\nL'Enseignement mathématique\nin March\n1906\n. The paper, written in December\n1905\n, begins:-\nIn this short note, we propose to show how we could extend the ideas which form the basis of Geometrography to the tracing of plane curves by means of curvigraphs.\nHe continued to develop these ideas in the paper\nSur la géometrographiques des courbes planes\nⓉ\n(\nOn the geometry of plane curves\n)\n, also published in\n1906\n, and in the same year he published\nSphères de Malfatti dans le tétraèdre régulier\nⓉ\n(\nMalfatti spheres in the regular tetrahedron\n)\nin\nMathesis\n.\nLucien Godeaux was passionate about mathematics and wanted to study mathematics at the University of Liège. His father, however, wanted his son to become an engineer so, having graduated from the Athénée d'Ath in\n1906\n, he enrolled at the École des Mines du Hainaut in Mons at the beginning of session\n1906\n-\n7\n. Being a student engineer was not going to stop Godeaux continuing his passion for mathematics and he published a series of many papers. For example he submitted the three papers:\n1\n.\nSur un complexe du quatrième ordre\nⓉ\n(\nOn a fourth-order complex\n)\n;\n2\n.\nSur un complexe de Grassmann du sixième ordre et de la sixième classe\nⓉ\n(\nOn a Grassmann complex of the sixth order and sixth class\n)\n; and\n3\n.\nConstruction d'un complexe formé par les plurisécantes d'un système de courbes planes\nⓉ\n(\nConstruction of a complex formed by the plurisecants of a system of plane curves\n)\nto the Académie Royale des Sciences, des Lettres et des Beaux-Arts de Belgique for publication. These papers, written while he was still at school, extended work in previous papers by\nJoseph Neuberg\nand Jacques Deruyts both of whom were professors of mathematics at the University of Liège. The papers were given to\nJoseph Neuberg\nto referee; he wrote in his report:-\nI am bringing together in a single report the examination of these three small papers on ruled geometry. They are of some interest, because they relate to a relatively recent branch of mathematics and use the symbolic notations of\nAronhold\nand\nClebsch\n.\nThe first work treats by two methods the complex of lines passing through a variable point of a plane α and a point of a conic of another plane β, the conic being linked to the first point by a biquadratic form. Only one of the two methods can succeed. Fr Deruyts had already studied in the Bulletin of our Académie\n(1892\n, p.\n571)\nthe complex of lines joining any point of a plane system α to any point of the corresponding line of a second plane system β reciprocal with the first. M Godeaux was inspired by this work; one can regret that his study is not more in-depth.\nIn the second work, the author studies a generalisation of the third-order complex that I studied, under the name of\nGrassmann\ncomplex, in Mathesis,\n1902\n, page\n221\n. He deals with the complex of lines that meet four groups of three planes given in groups of three points of a\nI\n2\n3\nI_{2}^{3}\nI\n2\n3\n​\n. The remarkable elements of this complex would have deserved a more developed examination.\nFinally, the third memoir deals with the complex of straight lines that are based on m plane curves each belonging to a sheaf. The author finds the equation of the complex, but without pushing his research further.\nIn any case, these three notes could appear in the Bulletin under the common title; \"On some particular complexes\", after the author has improved and simplified the wording.\nGodeaux carried out the revisions suggested by\nNeuberg\nand the single paper combining the three was completed in December\n1906\nwhen he had just begun studying engineering at the École des Mines. His father, by now, realised that he had to accept that his son wanted to be a mathematician and not an engineer. He was allowed to end his studies at the École des Mines du Hainaut after one year and, in the autumn of\n1907\n, he entered the University of Liège to study mathematics. He was taught by\nNeuberg\nand writes about this in\n[\n15\n]\n:-\nNeuberg\nwas an excellent teacher, extremely benevolent and of boundless devotion. I only met him at the end of his career; at that time, the reputation of our Faculty attracted a considerable number of foreign students to Liège. Three times a week Neuberg gave three one-hour lessons in succession in front of overcrowded audiences, maintaining the attention of the students, and this without apparent fatigue. Even better, he often completed his morning with an exercise session for the students studying for doctorates in Physical and Mathematical Sciences, thus filling a serious gap in the official programmes.\nThrough Jacques Deruyts, Godeaux was put in touch with Modeste Stuyvaert who had been awarded a doctorate by the University of Ghent for his thesis\nÉtude de quelques surfaces algébriques engendrées par des courbes du second et du troisième ordre\nⓉ\n(\nStudy of some algebraic surfaces generated by curves of the second and third order\n)\nin\n1902\n. Godeaux wrote in\n[\n14\n]\n:-\nI met Stuyvaert in\n1907\n; at that time, the study of the works of Fr Deruyts and his colleagues had excited me; our colleague was kind enough to take my first attempts into consideration and a regular correspondence was established between us; it lasted until the time when I left to go abroad to complete my studies. I have retained a deep gratitude for Stuyvaert's concern for me during these four years.\nGodeaux was awarded a doctorate in\n1911\nfor his thesis\nSur le lieu des points de contact double des surfaces de deux systèmes linéaires\nⓉ\n(\nOn the locus of the points of double contact of the surfaces of two linear systems\n)\n. By the time he was awarded his doctorate, Godeaux had already published over\n60\npapers. The paper\n[\n13\n]\nwritten by Godeaux's two sons, says that his political views made him travel abroad to complete his education:-\nThe homogeneous right-wing governments of the time closed the doors of the University to him\n(\nhis father, a notable liberal, was in fact in the opposition\n)\n, so he undertook to complete his education abroad.\nInvited to visit Bologna by\nFrederigo Enriques\n, Godeaux won the Travel Grant Competition and the University Competition in\n1912\nto fund his research visits and he set off to spend time in Bologna. After his visit to Bologna, Gordeaux continued his travels, spending time in Padua and Göttingen before going to Paris at the invitation of\nÉmile Picard\n. As the political situation deteriorated in the summer of\n1914\n, he realised that war was about to break out and on\n1\nAugust\n1914\nhe returned to Belgium. Only three days later, German troops invaded Belgium so that they could attack France avoiding the fortifications along the boarder. Liège was attacked on\n4\nAugust and fell to the Germans on\n7\nAugust. Godeaux volunteered to fight in the Belgium army and in December\n1914\nhe managed to get to the Yser Front. This front in the north west of Belgium had been held by the Belgium troops in the Battle of Yser in October\n1914\nand they continued to hold this for the rest of World War I. By the end of the war in\n1918\n, Godeaux had reached the rank of second lieutenant but war had not prevented him from continuing his mathematical research and during the war years from\n1914\nto\n1918\nhe still managed to publish around\n20\npapers mainly in French journals. He writes in\n[\n14\n]\n:-\nThe armistice of\n1918\nfound us in a battery at Zwartegat, a small hamlet on the left bank of the Scheldt, south of Ghent; the very next day, I visited Stuyvaert, whom I found very worried about the state of health of his wife and, it seemed to me, a little embittered. Perhaps the very difficult years he had just lived through were the cause. Heart of gold, our brother had suffered deeply from seeing the principles of the most basic justice trampled underfoot for four years.\nIn fact Godeaux had been awarded the Francois Deruyts Prize by the\nRoyal Belgium Academy\nin\n1914\nfor his researches in algebraic geometry. This Prize, established in\n1902\n, had been awarded first to Modeste Stuyvaert. It was awarded every four years but, because of World War I, no award could be made in\n1918\n. In fact the war prevented news of Godeaux winning the prize from becoming known and it was not until\n1920\nthat the\nAmerican Mathematical Society\nmade the announcement\n[\n27\n]\n:-\nThe\nBelgium Academy of Sciences\nhas awarded the Deruyts prize to Dr Lucien Godeaux, for his researches in algebraic geometry.\nGodeaux had met Maria Luthers in\n1908\nand they were married in\n1919\n[\n13\n]\n:-\nIn\n1908\n, he had the chance to meet Maria Luthers who would become his wife in\n1919\nafter three years of travelling abroad and four years spent on the Yser front. In his in-laws, he found the support and affection he lacked.\nLucien and Maria Godeaux had two sons, Jean E A Godeaux, who became a university professor of zoology, and Paul Godeaux, who became a civil engineer.\nGodeaux remained in military service at the end of World War I and in\n1919\nwas appointed as a tutor in mathematics at the École Militaire on the Avenue de la Renaissance in Brussels. In the following year he was appointed as an extraordinary professor of analysis at the École Militaire. He wrote the article\nL'Enseignement des mathématiques a l'École Militaire de Belgique section de l'Artillerie et du Génie\nⓉ\n(\nThe Teaching of Mathematics at the Belgian Military School, Artillery and Engineering Section\n)\nin June\n1925\ngiving a detailed description of the mathematics teaching there\n[\n20\n]\n:-\nEach theory taught is illustrated by at least two examples, and whenever possible, these examples are taken from the practical courses. The organisation of the École Militaire provides, after each lesson, a session in the study room of the same duration\n(1\nh.\n30\nm.\n)\n. During this session, the professor goes into the study room and provides the students with the explanations that they ask him for. If necessary, he provokes these requests for explanations. The students have at their disposal the text of the lessons, written by the School.\nIn\n1921\n, along with Alfred Errera and Théophile De Donder, Godeaux became a founder member of the\nBelgium Mathematical Society\n. Also in\n1921\nGodeaux was awarded the Class of Sciences Prize by the\nRoyal Academy of Belgium\n.\nJoseph Fairon\n(1863\n-\n1925)\n, professor at the University of Liège, died in\n1925\nand Godeaux was appointed to succeed him; the professorship covered analytic, projective and higher geometry. His appointment was confirmed on the\n30\nDecember\n1925\nby the Minister of Arts and Education, Camille Huysmans.\nLet us now look at one of Godeaux's passions, namely mathematical congresses. He attended the\n1920\nInternational Congress of Mathematicians in Strasbourg but his passion seems to have been born four years later at the\n1924\nInternational Congress of Mathematicians in Toronto. He sailed on the Suffren from Le Havre to New York, where he arrived on\n5\nAugust\n1924\n. The list of passengers on this ship is remarkable for the large number of European mathematicians all on their way to Toronto. On entry to the United States, Godeaux gives the following personal data: Height,\n5\nft\n7\nins; Hair Colour, Auburn; Eye Colour, Blue; Complexion, Fair. He went to the\n1924\nCongress as an appointed representative of the Belgium Government, of the National Committee of Belgium Mathematicians and of the Belgium École Militaire. He lectured at the Congress giving the talk\nSur les involutions régulières d'ordre deux, appartenant à une surface irrégulière\nⓉ\n(\nOn regular involutions of order two, belonging to an irregular surface\n)\nin Section II, Geometry. His talk began:-\nWe have devoted some papers to the study of involutions having only a finite number of coincidence points, belonging to an algebraic surface. We propose to make known some results concerning involutions of this nature, regular, of order two, belonging to an irregular surface.\nSome special cases are known: we have studied regular involutions of order two belonging to\nJacobi\nand\nPicard\nsurfaces, which leads to generalised\nKummer\nsurfaces. Another special case was considered by\nGeorges Humbert\nand is related to curves of genus three.\nHe attended the\n1928\nInternational Congress of Mathematicians in Bologna and was President of the Section of Geometry II-A, which was held at\n4\np.m. on Wednesday\n5\nSeptember\n1928\n. The following is published in the Proceedings:-\nProf L Godeaux has left, in the Secretary's office, the following observations for publication:\n\"Several of the communications made this afternoon to the Section of Geometry II-A, meeting under the presidency of Prof Godeaux, dealt with Cremona transformations. Their authors were MM\nFano\n, Emch,\nSnyder\n, Bydzovsky. Regarding the communication of M\nFano\n, M\nSeveri\nindicated the connection between some of the points encountered by the author and unpublished research that he had previously done. Other communications on algebraic varieties were made by MM Schaake, Torroja and Sisam. A last communication on hydrodynamics was made by M Riabouchinsky. The Section decided to send its greetings to Prof\nF Enriques\n(\nfrom Rome\n)\ncurrently in Buenos Aires and elected M\nCastelnuovo\nas President for the Thursday session of the Section of Geometry II-A\"\nHe gave the lecture\nSur la théorie des surfaces et l'espace réglé\nⓉ\n(\nOn the theory of surfaces and ruled spaces\n)\nin Section II-B on Thursday\n6\nSeptember\n1928\n.\nHe attended the\n1932\nCongress in Zurich. He was President of Section IIIa on Monday\n5\nSeptember\n1932\n. He also gave the lecture\nRemarques sur les involutions appartenant à une surface algébrique\nⓉ\n(\nRemarks on involutions belonging to an algebraic surface\n)\nto Section IIIa on Wednesday\n7\nSeptember\n1932\n. Since Alfred Errera could not attend, he gave Errera's talk\nSur un problème de M Bricard\nⓉ\n(\nOn a problem of M Bricard\n)\n. He attended the\n1936\nCongress in Oslo and gave the talk\nSur les involutions cycliques appartenant à une variété algébrique\nⓉ\n(\nOn cyclic involutions belonging to an algebraic variety\n)\n. The outbreak of World War II in\n1939\nprevented the International Congress of Mathematicians from meeting again until\n1950\n.\nGodeaux's enthusiasm for mathematical congresses led him to found\nLe Centre Belge de Recherches Mathématiques\nin\n1948\n. You can read Godeaux's own account to this Research Centre and the conferences it organised at\nTHIS LINK\n.\nWe continue to give details of his attendance at the International Congresses of Mathematicians since the titles of the lectures he gave tell us about his research interests. In\n1950\nhe attended the Congress in Cambridge, Massachusetts, USA. He is listed as representing the\nBelgium Académie Royale\n, the\nCentre Belge de Recherches Mathématiques\n, the Comité Belge de Mathématiques and the University of Liège. On Thursday\n31\nAugust\n1950\nhe delivered his lecture\nSingularités des points de diramation isolés des surfaces multiples\nⓉ\n(\nSingularities of isolated branch points of multiple surfaces\n)\nto Section III Geometry and Topology. Four years later, he attended the\n1954\nCongress in Amsterdam with his wife. He gave the lecture\nFaisceaux de surfaces algébriques irrégulières\nⓉ\n(\nSheaves of irregular algebraic surfaces\n)\nin Section IIIc and was the chair of Section IIIb on Monday\n6\nSeptember\n1954\n. It is also worth noting that\nBeniamino Segre\ngave the lecture\nGeometry on an algebraic variety\nin Symposium B Algebraic Geometry in which he referenced eight of Godeaux's papers. He attended the\n1958\nCongress in Edinburgh, Scotland and gave the lecture\nConstruction de surfaces projectivement canoniques\nⓉ\n(\nConstruction of projectively canonical surfaces\n)\n. He attended the\n1962\nCongress in Stockholm, Sweden and delivered the lecture\nSurfaces algébriques régulières dépourvues de courbe canonique possédant un système bicanonique irréductible\nⓉ\n(\nRegular algebraic surfaces devoid of canonical curve possessing an irreducible bicanonical system\n)\n.\nIn\n1946\n, Godeaux took over the chair of analysis and algebra at the University of Liège from his late colleague Louis Fouarge; he off-loaded his previous courses to Octave Rozet\n(1907\n-\n1983)\n, with the exception of higher geometry. This arrangement continued until he retired and was awarded emeritus status in\n1958\n.\nAs a lecturer, he always appeared to be presenting the material without having any lecture notes. The lectures were exciting and it looked as though they were spontaneous. He had, however, always carefully prepared each lecture before giving it and written down on a tiny piece of paper the statements of the results to be dealt with that day.\nLet us note that Godeaux's publication record is extraordinary. He published at least\n21\nbooks. We give details of these at\nTHIS LINK\n.\nHe was much interested in the history of mathematics and wrote papers on the topic and the book\nEsquisse d'une histoire des mathématiques en Belgique\nⓉ\n(\nOutline of a history of mathematics in Belgium\n)\n(1943)\n. Jean Pelseneer begins his review\n[\n29\n]\nas follows:-\nIt is with great pleasure that we have read the little book by M Lucien Godeaux. This 'Sketch' will render the most useful service not only to the student, but to the specialist in the history of science and, more generally, to the cultivated man. The 'Sketch of a History of Mathematical Sciences in Belgium', which could also be entitled, to a certain extent, \"Sketch of the History of Physical Sciences\", constitutes a substantial contribution to the already considerable historical work of the eminent geometer of the University of Liège; moreover and above all, it represents the most extensive overall work devoted to the subject since the publication of\nQuetelet\n's two volumes some eighty years ago.\nIn addition, Godeaux wrote biographies for the\nBiographie nationale\n, published by the\nAcadémie Royale des Sciences des Lettres et de Beau-arts\n.\nWe list\n50\nsuch biographies at\nTHIS LINK\n.\nAs we mentioned above, the number of publications by Godeaux is almost unbelievable. His own list of his publications contains over\n1200\nworks. Of these, about\n700\nare listed in MathSciNet. Jean Mawhin sums up his contributions in\n[\n25\n]\n:-\nIt is very difficult to describe in a few words Godeaux's contributions to algebraic geometry and differential projective geometry ... . He was the initiator and the main architect of the theory of involutions on algebraic surfaces. The scale of his scientific work is almost unique in the history of mathematics: some\n1200\ntitles, ranging from original notes and memoirs in Belgian and foreign scientific journals to research monographs, including didactic and popular works and works on the history of science. Each volume of the Bulletin de la Classe des Sciences de l'\nAcadémie Royale de Belgique\n, between\n1921\nand\n1975\n, contains at least one note by Godeaux and, among the first\n44\nvolumes of the Bulletin de la Société Royale des Sciences de Liège, from\n1932\nto\n1975\n, there are only volumes\n23\n,\n29\nand\n36\nto which Godeaux did not contribute, an infidelity largely compensated by the five or six articles that the other volumes contain, on average.\nEven if the progress of abstract algebra, topology and the theory of functions of several complex variables have profoundly transformed the face of algebraic geometry, compared to the Italian tradition which Godeaux remained steeped in, the work of our compatriot remains cited in recent publications and Godeaux surfaces\n(\nnon-rational surfaces of zero arithmetic and geometric genera\n)\nare still at the center of contemporary research.\nDespite the incredible amount of mathematics produced by Godeaux, he found time to devote to other causes. Paul Delforge writes in\n[\n8\n]\n:-\nThe mathematician was also interested in public affairs, in the defence of language but especially in the rights of peoples. Co-founder of the Liège section of the Ligue des Intellectuels wallons\n(1938)\n, he was one of the promoters of the Association for the Intellectual and Artistic Progress of Wallonia, which he chaired from\n1943\n. Vice-president of the Walloon National Congress held in Liège on\n20\nand\n21\nOctober\n1945\n, he spoke out in favour of federalism. Summarising Walloon grievances in cultural matters, he expressed concern about the disappearance of French-speaking centres in Flanders, the progressive Flemishisation of Belgian structures and a waste of financial resources through sprinkling justified by purely linguistic concerns. In\n1947\n, he was one of the signatories of the petition La Wallonie en alerte, denouncing the marginalisation of the Walloon country. Active in Walloon movements until the\n1960\ns, he was, without a doubt, one of the pillars of the Association for the Intellectual and Artistic Progress of Wallonia.\nWe have mentioned above some of the awards given to Godeaux. There were other prestigious awards which he received including in\n1940\nthe Prix\nPoncelet\nfrom the\nFrench Academy of Sciences\nand in\n1950\nthe Decennial Prize for Pure Mathematical Sciences for the period\n1934\n-\n1943\nfrom the\nRoyal Academy of Belgium\n. He was a member of the\nBelgium Mathematical Society\n, the\nFrench Mathematical Society\n, the\nSpanish Mathematical Society\n, the\nItalian Mathematical Union\nand the\nPolish Mathematical Society\n. He received honorary doctorates from, among others, the University of Bordeaux in\n1947\n, the University of Lille in\n1955\n, the University of Aix-Marseille in\n1956\nand the University of Dijon in\n1957\n. From\n1962\nto\n1965\n, he chaired the\nUnion of Latin-speaking Mathematicians\n.\nGodeaux died in Liège in\n1975\nat the age of\n87\nand he was buried in the Robermont Cemetery. In\n1985\n, the Société Royale des Sciences de Liège set up the Lucien Godeaux Prize in Mathematics, one of four prizes awarded in honour of the\n150\nth anniversary of the founding of the Society. The prize is awarded every five years. The\nBelgium Mathematical Society\nset up the Godeaux Lecture Prize which was first awarded in\n2007\n.\nSee\nTHIS LINK\n."
}