{
  "nome_completo": "Marília de Magalhães Chaves Peixoto",
  "nome_curto": "Marília Peixoto",
  "ano_nascimento": "1921",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Peixoto_Marilia/",
  "lugar_nascimento": "Sant'Ana do Livramento, Rio Grande do Sul, Brazil",
  "lugar_morte": "Rio de Janeiro, Brazil",
  "biografia": "Marília Chaves Peixoto\nwas the daughter of Tullio de Saboia Chaves\n(1884\n-\n1971)\n, Professor at the Surgical Medical School at Rio de Janeiro, and Zillah da Costa Magalhães\n(1899\n-\n2001)\n. Tullio de Saboia Chaves had studied medicine at the University of Geneva in Switzerland returning to Brazil in\n1918\n. Tullio Chaves and Zillah Magalhães were married on\n31\nMay\n1920\n, in Rio de Janeiro. They had three children, Marilia de Magalhães Chaves, the subject of this biography, Lúcia de Magalhães Chaves\n(18\nMay\n1924\n-\n25\nFebruary\n1980)\n, and Livio de Magalhães Chaves\n(1926\n-\n2016)\n.\nManchete\nwas a Brazilian weekly news magazine published from\n1952\nand in its first year, in the fifth issue on\n24\nMay\n1952\n, it published an interview with Marília Chaves Peixoto. She spoke of her upbringing in this interview, saying\n(\nsee for example\n[\n16\n]\n)\n:-\nI was lucky, my parents encouraged me. So much so that I went to a high school in Santana do Livramento, where girls couldn't study. By the kindness of the priests, I attended secondary school as a private student and was able to take the tests with the boys. Then the family helped me to study what interested me.\nLater she went to Rio de Janeiro and spent at least one year at the Colégio Andrews since the Brazilian newspaper in\n1939\nlists her as graduating as an outstanding student from the College. The Colégio Andrews had been founded by Isabella Robinson Andrews in\n1918\nand she was still running the school when Marília Chaves studied there. It offered a secular education to both boys and girls, which was unusual in Brazil at this time. When Marília Chaves studied there the college had around\n1500\npupils in Primary, Secondary and \"Superior\" courses, which prepared students, both boys and girls, to enter the schools of Medicine, Law and Engineering. Marília was by this time intent on studying mathematics and was taking the \"Superior\" course at the Colégio Andrews preparing to enter the National School of Engineering at the University of Brazil in Rio de Janeiro. In fact Marília qualified for entry in\n1939\nto the National School of Engineering and achieved third place among the\n73\nstudents approved for entry. This was unusual in Brazil at this time\n[\n16\n]\n:-\nWomen were not absent in the building of the scientific field of mathematics in Brazil, but only a small number of them had access to specific training. As Brazilians only had access to mathematics through the Polytechnic Schools, and this was traditionally a male stronghold, it was only with the emergence of faculties of philosophy, in the\n1930\ns, that women really began to occupy lecture theatres. The presence of women in engineering schools was not very common at the beginning of the century, but in\n1939\nMarília de Magalhaes Chaves was enrolled at the National School of Engineering ...\nAt the National School of Engineering,\nMaurício Matos Peixoto\nand\nLeopoldo Nachbin\nwere both her fellow students, all three beginning their studies in the same year.\nMaurício Peixoto\nsaid in the interview\n[\n14\n]\n:-\nDuring the five years of the engineering course,\nLeopoldo\nand I were inseparable companions. ... Marília's influence was very strong during these \"golden years\" ... Both Marília Chaves and\nLeopoldo Nachbin\nwere important influences in my becoming a mathematician. This in the sense of trying to live for and by mathematics.\nIn\n1943\nMarília Chaves graduated with a civil engineering degree but she never intended to have a career as an engineer. Mathematics was always the subject for her and throughout her engineering course Marília Chaves,\nMaurício Peixoto\nand\nLeopoldo Nachbin\nall studied advanced mathematics. They attended lectures at the National Faculty of Philosophy at the University of Brazil given by Luigi Sobrero and Gabriele Mammana. Luigi Sobrero\n(1909\n-\n1979)\nhad been born in Turin, Italy, and was awarded an engineering degree from the University of Rome in\n1931\nand a mathematics degree two years later. Between\n1939\nand\n1943\nhe was a visiting professor of theoretical physics at Rio de Janeiro. Gabriele Mammana\n(1893\n-\n1942)\nwas also an Italian mathematician who had graduated from Pisa and then became\nMauro Picone\n's assistant at the University of Catania. He taught in Livorno, Cagliari, Catania and Naples before teaching at the Federal University of Rio de Janeiro between\n1939\nand\n1942\n. He was an analyst working on differential equations.\nOn\n6\nSeptember\n1946\nMarília Chaves married the mathematician\nMaurício Matos Peixoto\nin Rio de Janeiro.\nMaurício\nand Marília had two children, Marta Chaves Peixoto\n(\nborn\n31\nMarch\n1949)\nand Ricardo Chaves Peixoto\n(\nborn\n24\nMarch\n1953)\n.\nIn\n1949\n, Marília Peixoto took part in the competition to become a professor of Infinitesimal Calculus at the National School of Engineering. She submitted the thesis\nOn the inequalities\ny\n′\n′\n′\n≥\nG\n(\nx\n,\ny\n,\ny\n′\n,\ny\n′\n′\n)\ny''' ≥ G(x, y, y', y'')\ny\n′\n′\n′\n≥\nG\n(\nx\n,\ny\n,\ny\n′\n,\ny\n′\n′\n)\nfor the competition for the post for which she was the only candidate. Her thesis, published as the paper\n[\n4\n]\n, was reviewed by\nEdwin Beckenbach\nin\n[\n2\n]\n. The description in\n[\n2\n]\nis technical, but a much less technical description in given in\n[\n1\n]\n:-\nHer competition thesis for Licentiate Teaching constitutes an original research contribution on third-order differential inequalities. In this work, she managed to extend to the case of third-order inequalities theorems that had been demonstrated in the case of second-order differential inequalities by her husband,\nMaurício Matos Peixoto\n.\nThis thesis was accepted for a doctorate in mathematics making Marília Peixoto the first Brazilian woman to be awarded a Ph.D. in mathematics.\nMarília Peixoto was appointed to the professorship at the National School of Engineering where she taught differential and integral calculus. She taught courses on other topics as well, for example she taught a Modern Algebra course in\n1952\nat the Centro Brasileiro de Pesquisas Físicas. She also held seminars on topological groups at this Brazilian Centre for Physical Research and in\n1951\ndelivered the course 'Introduction to General Topology'.\nMarília Peixoto and her husband travelled to Chicago in\n1949\n. They both attended the International Congress of Mathematicians held in Cambridge Massachusetts from\n30\nAugust to\n6\nSeptember\n1950\n. Perhaps due to an error by the Congress organisers, Marília's name only appears as her husband's partner and not as a participant in her own right. On\n18\nSeptember\n1950\nthey both flew from New York to Rio de Janeiro but on\n5\nOctober\n1950\nMaurício Peixoto\nreturned without his wife on a flight from Rio de Janeiro to New York on his way back to Chicago.\nOn\n1\nJuly\n1951\nMarília Peixoto was elected to the\nBrazilian Academy of Sciences\n. The president of the Academy made a speech in which he said\n[\n1\n]\n:-\nMarília Chaves Peixoto has, among other merits, that of being the first woman to cross the austere thresholds of the\nBrazilian Academy of Sciences\n.\nMarília Peixoto was elected as an associate member of the\nBrazilian Academy of Sciences\nbecoming the first Brazilian woman to be elected to the Academy. In fact Marie Curie had been elected as a foreign associate member of the\nBrazilian Academy of Sciences\nin\n1926\n.\nIn\n1955\nshe published the\n130\n-page book\nCálculo vetorial\nⓉ\n(\nVector calculus\n)\n. This book is aimed at students of engineering and certainly does not prove all the results stated but is rich in applications of vector calculus. In the book, she notes that there are several different ways to approach vector calculus, the geometric point of view, the point of view of abstract algebra, or that of invariants of transformations. There are many exercises, for example: \"An observer is on a train that moves horizontally with speed\nv\nv\nv\n. Rain falls vertically with speed\nu\nu\nu\n. At what angle to the horizontal does the observer see the rain fall?\" Three years after Marília Peixoto died, the book was republished with a Preface by\nMaurício Peixoto\n. He writes in the Preface:-\nClear, methodical, objective and well-prepared, it is a good reflection of her didactic qualities and her exemplary dedication to teaching.\nIn\n1955\n, in the library of the Institute of Pure and Applied Mathematics,\nMaurício Peixoto\ncame across a\n1952\narticle by H F DeBaggis entitled\nDynamical Systems with Stable Structure\n[\n18\n]\n:-\nThe encounter, apparently accidental, followed by the active browsing through it, had launched\nPeixoto\n's insightful mathematical intuition. At home, he worked on the article until late hours. Afterwards he also discussed it with his wife Marília C Peixoto, also an engineer, mathematician and his assistant in the Chair of Mechanics. They decided that, in due time, he should prepare a presentation on Structural Stability in the Seminar he directed, which had the participation of Marília, selected students and teaching assistants of the Chair of Mechanics.\nWe see that Marília Peixoto and her husband worked together of the structural stability of dynamical systems and she would make a substantial contribution to the result that today is known as Peixoto's Theorem, which gives the characterisation of structurally stable systems in two-dimensional manifolds.\nSolomon Lefschetz\nwas very interested in their work and\nMaurício\nand Marília Peixoto, with support from the Brazilian National Council for Scientific and Technological Development, visited Princeton in\n1957\n-\n58\n. Renate Watanabe and her husband, the Brazilian physicist Shigueo Watanabe, were also visiting Princeton and Renate writes about becoming friends with Marília Peixoto while there\n(\nsee, for example,\n[\n16\n]\n)\n:-\nI chose to attend a mathematics course at Princeton which was at a suitable time, that is, at a time when Shigueo could be with the children\n(\nErnesto was a new born\n)\n. I went to talk to Professor\nDonald Spencer\nto ask what were the prerequisites needed to follow his course. His answer was: none. I went to the first class. Marília and\nMaurício\nwere there, but I didn't know them yet. In less than\n10\nminutes I realised that I didn't know what he was talking about. Later, ... Ricardo\n[\nMarília Peixoto's son\n]\nand Shigueo Jr met in the same kindergarten class and that's how\nMaurício\n, Marília, Shigueo and I got to know each other. Instead of belittling me for my ignorance of mathematics, Marília started teaching me. I remember that she taught me, among other things, the first notions about sets. It was thanks to this initial impulse that I started to attend some courses and it was thanks to Marília that I did well in the initial course, here in São Paulo, which gave rise to GEEM\n[\nthe Mathematics Teaching Study Group\n]\n.\nIn\n1959\nMarília Peixoto and her husband published the joint paper\nStructural stability in the plane with enlarged boundary conditions\n. The article was sent for publication on\n16\nSeptember\n1958\nand was published on\n30\nJune\n1959\n. See reference\n[\n12\n]\nfor the paper and\n[\n10\n]\nfor a review of the paper. This was one of four papers on the structural stability of dynamical systems, the other three being by\nMaurício Peixoto\n, which produced what today is known as Peixoto's Theorem.\nMaurício Peixoto\nsaid in\n1986\n[\n13\n]\n:-\nI would like to point out that this work on structural stability was basically carried out in several articles mentioned below, one of which was in collaboration with my first wife Marília\n[\nStructural Stability in the plane with enlarged boundary conditions\n(1959)]\n, who did not live to see the end of this adventure. However, her influence was great in those golden days, decisive and already distant days, in the autumn of\n1957\nat Princeton.\nAfter this address by\nMaurício Peixoto\n,\nLaurent Schwartz\nsaid\n(\nsee\n[\n16\n]\n)\n:-\nSince you speak about your first wife Marília, let me add that I knew her at the same time as I got to know you when I came to Rio de Janeiro in\n1952\n; and already at this time it was very well known that you were both very good mathematicians.\nMarília Peixoto died on\n5\nJanuary\n1961\n. Later that year Maria Laura Mozinho gave a lecture at\nBrazilian Academy of Sciences\nin which she said\n(\nsee\n[\n17\n]\n)\n:-\nSeeing that calm girl, with very large and expressive eyes, it was necessary for someone to whisper to us that she was an outstanding Professor of Calculus and Mechanics at the National School of Engineering, energetic and, at the same time, generous, in addition to having an acute intelligence that turned to mathematical research.\nA number of honours have been given to Marília Peixoto after her death. A street in her home town of Sant'Ana do Livramento is named Rua Marília Chaves Peixoto. It is a predominately residential street in the Prado district of the town. Marília's husband\nMaurício Peixoto\nfounded the school 'Municipal School Marília Chaves Peixoto' in the Controes region of Petrópolis, in\n1971\n. In\n1969\nhe had been awarded the Moinho Santista Award by the Bunge Foundation for Peixoto's Theorem and he used the money from the award to fund the school. Alciléa Augusto,\nMaurício\n's third wife, explained\n(\nsee for example\n[\n16\n]\n)\n:-\nBack in\n1945\n,\nMaurício\n, Marília's fiancé at the time, got to know the Controes region, in the confines of the municipality of Petrópolis, a rural region, where Marília's father, Dr Túlio Chaves, had a farm. ...\nMaurício\nrealised that many of the local residents were illiterate, and that the nearest school was about\n10\nkm away. ... On land donated by Dr Túlio, the Municipal School Marília Chaves Peixoto was inaugurated in\n1971\n. ... For almost\n40\nyears, in this single building, with kitchen and cafeteria, more than\n300\nstudents attended primary school. ...\nMaurício\nbought a bicycle for one teacher, paid for petrol for another. ... and provided lunch when the city failed to do so. ... In Controes, there are no more illiterate people!\nThe Brazilian politician and university professor Dorinha Seabra Rezende introduced in the Chamber of Deputies a Resolution to give the name Marília Chaves Peixoto to Plenary\n13\nof Annex II of the Chamber of Deputies in\n2020\n. Here is part of the Resolution\n[\n15\n]\n:-\n.. in addition to the unquestionable value of the research she developed, Marília Peixoto bravely broke through a virulent and ingrained discourse that dislodged women from dedicating themselves to certain areas of knowledge and certain work activities, a discourse normally based on the idea of existence of an unequivocal relationship between biological attributes of gender, in which the female is limited to the exercise of domestic functions and a very small number of professions, usually with lower social prestige and remuneration. By becoming a leading professional in an area considered, until then, as exclusively male, mathematician Marília Peixoto opens a precedent of dignity for all Brazilian women, who still remain in the fight for equality in the field of formal study and work."
}