{
  "nome_completo": "Marceli Stark",
  "nome_curto": "Marceli Stark",
  "ano_nascimento": "1908",
  "ano_morte": "1974",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stark/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Marceli Stark\n's parents were Ignacy Stark and Franciszka Sak. When he was born, the town of Lwów was in the Austria-Hungarian region\n(\nwith the German name of Lemberg ; it is now Lviv in Ukraine\n)\nand only after World War I did it officially become a Polish city since Poland declared itself an independent state in November\n1918\n. Marceli was brought up in Lwów where he first attended an elementary school and then a\ngymnasium\n. In\n1926\n, when he was seventeen years old, he completed his secondary education and later that year he entered the Jan Kazimierz University of Lwów.\nAt the University of Lwów, Stark was taught by\nStefan Banach\n,\nHugo Steinhaus\nand other leading Polish mathematicians. In his second year of study\nKazimierz Kuratowski\nwas appointed as a professor at the university. Not only did Lwów have an impressive collection of lecturers but perhaps even more remarkable is the list of outstanding students who studied with Stark over the following few years including\nJuliusz Schauder\n,\nMark Kac\n,\nStanisław Ulam\n,\nWładysław Orlicz\n,\nWilhelm Birnbaum\n, Henryk Auerbach, Ludwik Sternbach,\nStanisław Mazur\nand Julian Schreier.\nBirnbaum\nspoke about this group of talented students:-\nMathematics in that group of infatuated young people was kind of a fever. We would get together at all times of day and night, talking incessantly mathematics.\nIn\n1929\n, while still an undergraduate, Stark was appointed as a junior assistant to\nBanach\n, who held the chair of mathematics, at the Mathematical Institute. Stark graduated from the Faculty of Mathematics and Natural Sciences in Lwów in\n1933\nand continued to work at the Mathematical Institute.\nMark Kac\ngot to know Stark when he attended a proseminar on algebra and number theory. Stark was very ready to help everyone and, in particular, he assisted\nKac\nin many ways including translating his first serious mathematical note into English - the note was published in\n1934\n.\nOn\n1\nSeptember\n1939\nGermany attacked Poland and World War II began. Stark was in Warsaw when the city fell to the Germans before the end of September when those defending the city were forced to surrender through lack of supplies. About\n30\n% of the inhabitants of Warsaw were Jewish and, after the Germans took control of the city, they constructed a ghetto in the Jewish district where this\n30\n% were forced to live in an area of less than\n3\n% of the city. Stark was one of the half million confined to the ghetto were he lived for a while. The Germans never intended the Warsaw ghetto to be permanent, rather they saw it as a holding area until they had decided what to do with those confined there. In the summer of\n1942\nthey began to transfer the inhabitants of the ghetto who had survived\n(\nmany had died of starvation and disease in the confined space\n)\nto concentration camps.\nStark survived the Warsaw ghetto and was transferred to several concentration camps. He spent time in four different camps, Majdanek, Plaszów, Ravensbrück and Sachsenhausen. Majdanek, on the outskirts of Lublin, Poland, was a forced labour camp where exterminations were not carried out but, nevertheless, many thousands of the inhabitants died. Plaszów, close to Kraków, was also a forced labour camp but those unfit to work were killed. Ravensbrück, in northern Germany, was a concentration camp mainly for women but some men, such as Stark, were also kept there. Less than one fifth of those sent to Ravensbrück survived. Sachsenhausen was a concentration camp in Oranienburg, Germany. Remarkably, against all the odds, Stark survived this horrific experience and, after the defeat of Germany in\n1945\n, was able to return to Poland.\nIn\n1946\nStark was appointed as a teaching associate at the University of Wrocław. In\n1948\nhe published\nOn a functional equation\nand, in the following year, the paper\nOn a ratio test of Frink\nin which he gives an extension of Raabe's test for convergence. In\n1948\nhe produced a set of mimeographed notes, in Polish, of the course on algebra that he was giving at the University of Wrocław. He was appointed as a research associate at the State Institute of Mathematics in\n1949\n, one of the first appointments following the founding of the Institute on\n20\nNovember\n1948\n.\nKazimierz Kuratowski\nwas appointed to head the Institute in\n1949\n. Stark continued to work for the Institute, which became part of the\nPolish Academy of Sciences\nfollowing its foundation in\n1952\n. After the Academy was set up, the Institute was known as the Mathematics Institute of the\nPolish Academy of Sciences\n, and Stark worked at the Institute for the rest of his life. His position at the University of Wrocław ended in\n1950\nand, in\n1954\n, he was promoted from research associate at the Mathematics Institute to assistant professor and given the title of\ndocent\n.\nStark published several textbooks which were very popular in Poland and some were translated into other languages. He published the\n629\n-page textbook\nAnalytic Geometry\n(\nPolish\n)\nin\n1951\n. An indication of its popularity is the fact that further editions were published in\n1958\n,\n1967\n,\n1970\n(\nenlarged\n)\n,\n1972\nand\n1974\n. V Hlavaty writes in a review:-\nThis textbook deals with metric, affine and projective geometry of linear and quadratic varieties in the plane as well as in the three-space. The author does not confine himself only to real plane\n(\nreal space\n)\nbut considers also the complex plane\n(\ncomplex space\n)\n. Besides items usually dealt with in textbooks of elementary analytic geometry the reader finds here the introduction to synthetic projective geometry, to the theory of matrices\n(\nand determinants\n)\nwith the usual applications and to the\n(\nthree-dimensional\n)\nelementary vector calculus.\nAll the rest of Stark's textbooks were written in collaboration with\nAndrzej Mostowski\nwho had been appointed head of the division for the foundations of mathematics at the Mathematics Institute in the year the Institute was set up. Their first joint publication was the book\nHigher algebra\n(\nPolish\n)\npublished in three volumes; Volume\n1\nappeared in\n1953\n, Volume\n2\nin\n1954\nand Volume\n3\nalso in\n1954\n. All three volumes were reviewed by\nAntoni Zygmund\nwho begins a review of the first volume as follows:-\nThis is primarily a university textbook beginning with the material for first year students. The style is clear, proofs given in great detail and the didactic aspect of the presentation receives considerable attention. In line with this the presentation in the first half of the book follows the classical pattern and the more abstract methods are postponed to the second half.\nFor the second volume,\nZygmund\nwrites:-\nThe present volume contains the theory of polynomials with numerical coefficients, and together with the first volume contains all the material to be covered during the first year of the university. Abstract methods are avoided; elements of abstract algebra are to be given in volume three.\nZygmund\n's review of the third volume begins:-\nIt is intended as an introduction to Modern Algebra, is written, as are the preceding volumes, with great care and attention to didactic aspects, and contains a large number of examples and problems.\nA second edition was published in\n1959\nand a third edition in\n1967\n. The two authors collaborated on two further textbooks.\nLinear algebra\n(\nPolish\n)\nwas first published in\n1958\nwith further editions in\n1966\n,\n1968\n, and\n1973\n. J W Andrushkiw writes in a review:-\nThe presentation may be said to be \"classical'': the discussion confines itself to the real and complex number fields and the concept of the group is not used. However, a very clear presentation, a careful attention to didactic aspects, instructive examples and satisfactory number of problems make this volume a valuable textbook for an introductory course in linear algebra.\nThe final collaboration between Stark and\nMostowski\nled to\nThe elements of higher algebra\n(\nPolish\n)\nwhich was essentially a rewrite of the first two volumes of their earlier\nHigher Algebra\ntextbook although it certainly did not replace the earlier work as further editions of the earlier work continued to be produced after\nElements of higher algebra\nwas published. The first edition of\nElements of higher algebra\nappeared in\n1958\nwith further editions in\n1963\n,\n1965\n,\n1968\n,\n1970\n, and\n1972\n. An English translation was published in\n1964\n. Reviewing the original\n1958\nPolish edition, M Fiedler writes:-\nThe book is written clearly, with great stress on didactic principles of the presentation.\nStark concentrated much of his efforts in the later part of his career on publishing. He was head of the publishing department of the\nPolish Mathematical Society\n, managing editor\n(\nlater editorial secretary\n)\nof\nStudia Mathematica\nand, from\n1958\n, editorial secretary of\nActa Arithmetica\n[\n2\n]\n:-\nHe had great knowledge and experience in publishing matters and his editorial services were also sought by other journals\n(\n'Colloquium Mathematicum', 'Dissertationes Mathematicae'\n)\n.\nAlso, he was an editor for the\nWorks\nof\nJuliusz Pawel Schauder\n, which was not published until\n1978\n, four years after Stark's death, and an editor of the\nSelected Works\nof\nWacław Sierpiński\npublished in three volumes between\n1974\nand\n1976\n.\nThere were other roles that Stark took in addition to these relating to publishing. He was secretary of the Mathematics Committee of the\nPolish Academy of Sciences\nand, between\n1962\nand\n1967\n, he was Deputy Director of the Mathematics Institute of the\nPolish Academy of Sciences\n.\nOver the last few years of his life he battled against health problems, particularly a painful heart disease. Despite these years of ill health, his final death was sudden and unexpected."
}