{
  "nome_completo": "Dame Mary Lucy Cartwright",
  "nome_curto": "Mary Cartwright",
  "ano_nascimento": "1900",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cartwright/",
  "lugar_nascimento": "Aynho, Northamptonshire, England",
  "lugar_morte": "Cambridge, England",
  "biografia": "Mary Cartwright\n's father was William Degby Cartwright\n(\nborn in Tilney Street, London about\n1865)\n, and at the time of Mary's birth he was the Vicar at Aynho. Her mother was Lucy Harriette Maud Cartwright\n(\nborn in Paddington, London about\n1869)\n. Mary had four siblings: John\n(\nborn about\n1896)\n, Nigel\n(\nborn about\n1898)\n, Jane\n(\nborn about\n1905)\nand William\n(\nborn about\n1907)\n.\nWhen she was eleven years old, Mary Cartwright was sent away to school, first attending Leamington High School, then later attending the Godolphin School in Salisbury. Her best subject at school was history but it had the disadvantage of requiring much effort in learning endless lists of facts. When she was encouraged in her studies of mathematics in her final year at school, Mary realised that it was a topic where one could succeed without the long hours of learning facts. It became the topic that she wanted to study at university.\nIn October\n1919\nCartwright entered St Hugh's College in Oxford to study mathematics. At that time she was one of only five women in the whole university who were studying mathematics. This was a difficult time to enter university since, World War I having just ended, there were large numbers of men returning from the army who were either restarting the university studies they had begun before the war or were taking up their studies for the first time. The lecture halls were crowded and often Cartwright had to copy up notes of lectures which she could not get into because of the crowds.\nAfter two years of study she took her Mathematical Moderations examinations and was awarded second class. It was not only Cartwright who had found the crowded conditions hard, for there were very few first class awards that year. This did nothing, however, to stop a deep sense of disappointment at failing to get the first class that she had aimed for, and Cartwright seriously considered giving up mathematics altogether and returning to her first love of history. It was a painful decision, over which she agonised for some time. However, she was enjoying mathematics so much and she still remembered the long hours of learning facts when studying history at school. She decided to stick with her mathematics course but\n[\n4\n]\n:-\nHer decision to remain in mathematics did not diminish her interest in history. Many of her mathematical papers include historical perspectives that add an interesting dimension to her work. She wrote several biographical memoirs that portray her exceptional sense of history.\nHaving made her decision to complete the mathematics honours course, Cartwright was fortunate to meet a fellow student\nV C Morton\n.\nMorton\nwas a fine mathematician - he later became Professor of Mathematics at Aberystwyth - and he gave her very sensible advice. He told her to read\nWhittaker\nand\nWatson\n's\nModern analysis\nand to attend\nHardy\n's evening sessions. These sessions took place after dinner on Monday and consisted of a talk and then mathematical discussions until later in the evenings. Having received permission to attend these inspiring sessions which\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\n... set the course of her career ...\nCartwright went on to be awarded a first class degree in Final Honours, and graduated from Oxford in\n1923\n.\nCartwright then taught in schools for four years before returning to Oxford to read for her D.Phil. The reason for not continuing to her doctorate in\n1923\nseems to have been a wish not to impose further strains on her family's finances. She taught first at Alice Ottley School in Worcester, and then at Wycombe Abbey School in Buckinghamshire. This second post also carried with it a position of assistant mistress and Cartwright soon found that she was being diverted from teaching by the administration. Also\n[\n3\n]\n:-\n... teaching and method content were strictly dictated at the school. Having no room to experiment led Cartwright to feel discontent with her career.\nBack to Oxford in\n1928\n, she was supervised by\nHardy\nin her doctoral studies. During the academic year\n1928\n-\n29\nHardy\nwas at Princeton, and it was\nTitchmarsh\nwho took over the duties as a supervisor. Her thesis on zeros of integral functions was examined by\nJ E Littlewood\nwhom she met for the first time as an external examiner in her oral examination for the D.Phil. She could never have guessed on that stressful occasion that she would become a major collaborator with\nLittlewood\nover many years.\nIn\n1930\nCartwright was awarded a Yarrow Research Fellowship and she went to Girton College, Cambridge, to continue working on the topic of her doctoral thesis. Attending\nLittlewood\n's lectures, she solved one of the open problems which he posed. Her theorem, now known as Cartwright's Theorem, gave an estimate for the maximum modulus of an analytic function which takes the same value no more than\np\np\np\ntimes in the unit disc. To prove the theorem she used a new approach, applying a technique introduced by\nAhlfors\nfor\nconformal mappings\n. From this time her research flourished and\n(\n[\n5\n]\nor\n[\n6\n]\n)\n:-\n... in a long series of papers she continued to explore the theory of complex\n(\nespecially entire\n)\nfunctions; particularly their strange behaviour where they \"blow up\" ... Some of the complexity has been captured in modern pictures of fractals, many of which are created by iterating functions of this kind. Cartwright's work describes, among other things, deep and delicate phenomena which can appear near fractal boundaries, and has found new applications in this field.\nCartwright was appointed, on the recommendation of both\nHardy\nand\nLittlewood\n, to an assistant lectureship in mathematics in Cambridge in\n1934\n, and she was appointed a part-time lecturer in mathematics the following year. In\n1936\nshe became director of studies in mathematics at Girton College, and in\n1938\nshe began work on a new project which had a major impact on the direction of her research. The Radio Research Board of the Department of Scientific and Industrial Research produced a memorandum regarding certain\ndifferential equations\nwhich came out of modelling radio and radar work. They asked the\nLondon Mathematical Society\nif they could help find a mathematician who could work on these problems and Cartwright became interested in their memorandum.\nThe dynamics which lay behind the problems was unfamiliar to Cartwright and so she approached\nLittlewood\nfor help with this aspect. They began to collaborate studying the equations.\nLittlewood\nwrote:-\nFor something to do we went on and on at the thing with no earthly prospect of \"results\"; suddenly the whole vista of the dramatic fine structure of solutions stared us in the face.\nThe fine structure which\nLittlewood\ndescribes here is today seen to be a typical instance of the \"butterfly effect\". The collaboration led to important results, and these have greatly influenced the direction that the modern theory of\ndynamical systems\nhas taken. In\n1947\n, largely on the basis of her remarkable contributions in the collaboration with\nLittlewood\n, she was elected a Fellow of the\nRoyal Society\nand, although she was not the first woman to be elected to that Society, she was the first woman mathematician.\nCartwright was appointed Mistress of Girton in\n1948\nthen, in addition, a Reader in the Theory of Functions in Cambridge in\n1959\n, holding this appointment until\n1968\n. As Mistress of Girton\n[\n5\n]\n:-\n... without imposing her views, but carrying her responsibilities to the full, she guided the College with wise and clear headed decisions.\nAlthough the administration involved in her role at Girton was substantial she found time for research, particularly her work on cluster sets in the\n1950\ns. After retiring she found more time for the travelling which she so enjoyed. She spent extended periods at various institutions in the United States and Europe; in particular she spent the academic year\n1968\n-\n69\nat Brown University then Claremont Graduate College, with the University of Wales and Poland being visited in\n1969\n-\n70\n.\nShe received many other honours including the\nSylvester\nMedal of the\nRoyal Society\nin\n1964\n:-\n... in recognition of her distinguished contributions to analysis and the theory of functions of a real and complex variable.\nShe was the first woman to receive the\nSylvester\nMedal and, the first woman to serve on the Council of the\nRoyal Society\n. Cartwright was President of the\nLondon Mathematical Society\nin\n1961\n-\n62\nbecoming the first woman president, and until now the only woman president. She also received the\nDe Morgan\nMedal of the Society in\n1968\n. In\n1969\nshe received the distinction of being honoured by the Queen, becoming Dame Mary Cartwright, Commander of the Order of the British Empire.\nA remarkable person in many different ways, Cartwright is described in\n[\n3\n]\nas:-\n... a person who had a gift for going to the heart of a matter and for seeing the important point, both in mathematics and in human affairs.\nHer sense of humour is described in\n[\n3\n]\n,\n[\n5\n]\n, and\n[\n6\n]\nas \"wry\" and Caroline Series writes in\n[\n6\n]\n:-\nEven at the age of\n96\n, the TV documentary \"Our brilliant careers\" captured the sharp sparkle of her wit.\nI\n[\nEFR\n]\nwatched the TV documentary and fully agree with Caroline Series' comment. It was a wonderful experience to see the sparkle in Cartwright's eyes.\nHer other interests are mentioned in\n[\n1\n]\n:-\nShe was no narrow specialist, being exceptionally well informed on a wide variety of subjects, among them painting and music. Stanley Spencer's portrait of her will convey to future generations at Girton some idea of Dame Mary as scholar and administrator, but they may miss the warm sense of humour and sympathy that her friends knew."
}