{
  "nome_completo": "Matthew O'Brien",
  "nome_curto": "Matthew O'Brien",
  "ano_nascimento": "1814",
  "ano_morte": "1855",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/OBrien/",
  "lugar_nascimento": "Ennis, County Clare, Ireland",
  "lugar_morte": "Petit Ménage, Jersey",
  "biografia": "Matthew O'Brien\n's parents were Matthew O'Brien Sr., a well-respected medical doctor in Ennis with a large practice, and Ellen Macmahon. Matthew, the subject of this biography, had an older brother Charles O'Brien, born\n1807\n, who became a military man, serving in India and reaching the rank of Colonel. Charles committed suicide in October\n1857\n.\nMatthew's schooling was in Ennis but he left there in July\n1830\n, when he was sixteen years old, and entered Trinity College Dublin. At this time\nWilliam Rowan Hamilton\nwas Andrews' Professor of Astronomy in Trinity College Dublin while Franc Sadleir\n(1775\n-\n1851)\nwas Erasmus Smith professor of mathematics.\nJames MacCullagh\nwas appointed junior assistant to the mathematics professor in\n1832\n.\nBartholomew Lloyd\nwas Erasmus Smith professor of Natural and Experimental Philosophy when O'Brien entered but he became Provost of Trinity College Dublin in\n1831\nand was succeeded as professor of Natural and Experimental Philosophy by his son\nHumphrey Lloyd\n. O'Brien graduated from Trinity College Dublin in\n1834\nand, on\n3\nNovember of the same year, he matriculated at Caius College, Cambridge. He was admitted as a pensioner, meaning that he had to support himself financially.\nAt Cambridge O'Brien was tutored by\nWilliam Hopkins\nand soon showed great promise. From\n1835\nto\n1837\nhe was a scholar, indicating that he had been awarded a scholarship. In\n1838\nO'Brien graduated with a B.A. and was Third\nWrangler\nin the Mathematical Tripos, meaning that he was ranked third in the list of candidates graduating with a First Class degree. One year ahead of O'Brien at Cambridge were\nJames Joseph Sylvester\n,\nDuncan Gregory\nand\nGeorge Green\nwho all were Wranglers in the Mathematical Tripos examinations of\n1837\n. Among those teaching at Cambridge at this time we mention in particular\nGeorge Peacock\nwho had done much to bring the Continental approach to the calculus to Cambridge. Another who was doing interesting work in areas to which O'Brien later made major contributions was the Irishman\nRobert Murphy\nalthough he had to leave Cambridge when O'Brien was halfway through his undergraduate studies. Remaining at Cambridge after graduating with a B.A., O'Brien published\nOn the variation of the longitude of the perihelion in the planetary theory\nin the\nCambridge Mathematical Journal\nin\n1838\n. He was elected to a fellowship at Caius College, Cambridge, in\n1840\n. In that year he published\nMathematical Tracts, Part I, On Laplace's Coefficients, The Figure of the Earth, The Motion of a Rigid Body about its Centre Of Gravity, and Precession and Nutation\n. You can read O'Brien's Preface to this book at\nTHIS LINK\n.\nIn\n1841\nO'Brien was awarded an M.A. but in the same year resigned his fellowship at Caius College, Cambridge. In the following year he published the book\nAn Elementary Treatise on the Differential Calculus, in which the Method of Limits is Exclusively made use of\n. He describes himself as 'Rev M O'Brien, M.A., Late Fellow of Caius College, Cambridge' on the title page so by this time O'Brien had been ordained. You can read the Preface to this interesting calculus text at\nTHIS LINK\n.\nOn\n8\nMarch\n1854\nO'Brien was appointed as Professor of Natural Philosophy and Astronomy in King's College, London. In the same year he published another textbook entitled\nA Treatise on Plane Co-Ordinate Geometry or, the Application of the Method of Co-Ordinates to the Solution of Problems in Plane Geometry. Part I\n. He describes himself as 'Rev M O'Brien, Professor of Natural Philosophy and Astronomy in King's College, London, and Late Fellow of Caius College' on the title page. You can read the Preface to this textbook at\nTHIS LINK\n.\nO'Brien retained his professorship of Natural Philosophy and Astronomy in King's College, London until\n1854\nalthough he took on an additional appointment as lecturer in practical astronomy at the Royal Military Academy, Woolwich, in\n1849\n. While holding these positions he published further books including:\nLectures on Natural Philosophy, given at Queen's College, London\n(1849)\n; and\nA Treatise on Mathematical Geography, Part I. A Manual of Geographical Science\n(1852)\n.\nIn\n1854\nO'Brien applied for the position of Professor of Mathematics at the Royal Military Academy in Woolwich. Other applicants for this position included\nGeorge Gabriel Stokes\n, the Lucasian Professor of Mathematics at Cambridge, and\nJames Joseph Sylvester\n. Despite the quality of the other applicants, O'Brien was appointed on\n2\nAugust\n1854\n.\nSylvester\n, whose referees had included\nSir William Rowan Hamilton\n,\nCharles Graves\n,\nPhilip Kelland\n, James Challis,\nJean-Victor Poncelet\n,\nMichel Chasles\n,\nJean-Marie Duhamel\n,\nJoseph Serret\n,\nCharles Hermite\nand\nJoseph Bertrand\n, was none too pleased that he had not been appointed. He wrote a letter on\n9\nAugust in which he was clearly upset that O'Brien had been appointed rather than himself\n(\nhe lists his referees who supported his application \"in the strongest language in which a recommendation could be clothed\"\n)\n. He also sounds surprised that\nStokes\n\"was one of the unappointed candidates.\" We look in a moment at O'Brien's research contributions, but let us say here that\nSylvester\ndid not have long to wait to be appointed Professor of Mathematics at the Royal Military Academy in Woolwich since O'Brien died in\n1855\nand\nSylvester\nfilled his chair. After becoming ill, O'Brien had travelled to Petit Ménage, Jersey, in order to recover his health. However, he died there in August\n1855\n.\nWe know little of O'Brien's private life but we do know that he had a son, Arthur Evanson O'Brien, who was born at Norwood, Middlesex, on\n25\nJanuary\n1849\n. Arthur O'Brien, who was only six years old when his father died, attended school in Thirsk, Yorkshire, before entering Trinity College, Cambridge in October\n1866\n. He graduated from Cambridge in\n1871\nand was ordained deacon in\n1872\nbecoming a priest in the following year. He was a curate at St George, Barrow in Furness in\n1873\n.\nWe must return now to give an indication of the mathematical contributions that O'Brien made in addition to the books that we have mentioned above. First let us note that we list twenty-four of O'Brien's papers, including all those relevant to the discussion below, at\nTHIS LINK\n.\nBefore we discuss O'Brien's most significant work we note that a number of O'Brien's papers involve comments and replies to papers of\nPhilip Kelland\n(\nsee papers\n(3)\n,\n(4)\n,\n(6)\n, and\n(7)\nat\nTHIS LINK\n)\n. The argument between these two mathematicians seems to have arisen through a misunderstanding. O'Brien found an error in one of\nKelland\n's papers which he pointed out.\nKelland\nreplied with a paper justifying his results and O'Brien responded again with a more detailed description of\nKelland\n's error. The whole episode seems to have ended in a draw when\nKelland\nadmits:-\nI confess no more than this - that there is an error in the equations, which error has never been propagated to other parts of my writings ...\nThe most significant of O'Brien's contributions is his early work on the vector calculus before the work of\nJ Willard Gibbs\nand\nOliver Heaviside\nwhich was only developed\n30\nyears after O'Brien's death. It is clear that O'Brien made a substantial contribution with the introduction of the vector and scalar product but, perhaps not surprisingly for this early attempt, there were weaknesses in his approach. Between\n1847\nand\n1852\nhe published seven papers on the application of vector methods to mechanics. We give an abstract of one of O'Brien's final papers on the topic at\nTHIS LINK\n.\nO'Brien's notation is different from the modern one. He wrote\nu × v\nfor what today is called the dot product\nu.v\n. O'Brien also uses\nu.v\nor D\nu.v\nfor what today is called the vector product. He deduced many results which were rediscovered by\nGibbs\nand are published in his\nVector Analysis\n. A weakness of his approach, however, is the fact that he never realised that the vector product is not associative. This does not mean that there are errors in his papers because of this, it simply means that he never considered, in today's notation,\n(\nu × v\n)\n× w\n. Discussing O'Brien's\n1846\npaper\nOn a new notation for expressing various conditions and equations in geometry, mechanics, and astronomy\n, Gordon Charles Smith writes\n[\n6\n]\n:-\nHaving defined vector and scalar products and derived some properties, O'Brien shows how these ideas enable one to express conveniently and concisely certain basic results in mechanics. In Sections\n17\n-\n25\nof his paper he considers applications in statics. The main results, stated in Section\n18\nand proved in Sections\n19\n-\n22\n, are the necessary and sufficient conditions for a system of forces\n(\nwith assigned lines of action\n)\nacting upon a rigid body to be in equilibrium ... The final sections,\n25\n-\n29\n, concern dynamics. O'Brien begins by setting out the fundamental equations of motion of a rigid body ...\n[\nThese sections\n]\ncontain an application of these equations to computing the solar precession and nutation.\nIn\n1847\nO'Brien published another paper on vectors in which he tried to develop ideas of differential geometry. With the tools he has developed he\n[\n6\n]\n:-\n... finds the osculating and normal planes at a point on a given curve.\nIn a second\n1847\npaper\nOn the symbolic equation of vibratory motion of an elastic medium whether crystallized or uncrystallized\nhe attempts to give the equations:-\n... in their most general form ... without making any assumption as to the nature of the molecular forces\n[\nand\n]\nto exemplify the use of the symbolical method.\nGordon Smith writes\n[\n6\n]\n:-\n... O'Brien adopts in this paper a vector notation in which the three operations,\nΔ\n,\nD\n\\Delta , D\nΔ\n,\nD\n, and\ncorrespond to the scalar product, the vector product, and the Laplacian\n<\nl\na\np\nl\na\nc\ni\na\nn\n>\n<laplacian>\n<\nl\na\np\nl\na\nc\ni\na\nn\n>\n, respectively. Furthermore he recognizes the utility of these operations in vector theory.\nBy\n1851\nO'Brien had realised that his ideas had not made an impact and so he tried to make them more acceptable. In\nOn the interpretation of the product of a line and a force\n(1851)\nhe wrote that in the three papers we have just mentioned:-\nI employed a new notation to express these results, and so far obscured their meaning. I am now able to put them all into the ordinary notation of algebra without introducing anything novel in principle, or assuming any but the simplest symbolic laws.\nHowever, in the following year he published papers returning to his original attempts at the vector calculus.\nLet us end by quoting from Peter Lynch\n[\n4\n]\n:-\nO'Brien came quite close to constructing the system of vector algebra as it is used today. Yet, despite his innovative work, his ideas were almost completely ignored by his contemporaries, and it was several decades before\nGibbs\n's \"Vector Analysis\" lit a bright flame. One of the reasons was that\nHamilton\nwas a figure of towering influence and he and his supporters worked indefatigably to promote the recognition and use of\nquaternions\n. O'Brien's work was completely overshadowed by this 'publicity campaign'. O'Brien might have achieved much more had he had more leisure to pursue his research. But he was overburdened with teaching responsibilities, and his life was cut short at just forty-one years. While his formulation of vector analysis was incomplete, and imperfect in some respects, it merits recognition as a significant contribution."
}