{
  "nome_completo": "Matyáš Lerch",
  "nome_curto": "Matyáš Lerch",
  "ano_nascimento": "1860",
  "ano_morte": "1922",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lerch/",
  "lugar_nascimento": "Milínov (near Sušice), South Bohemia (now Czech Republic)",
  "lugar_morte": "Sušice, Czechoslovakia (now Czech Republic)",
  "biografia": "Mathias Lerch\n's name is the first thing we have to mention. Like most people from that part of the world in that period he has both a German version of his name,\nMathias\n, and a Czech version,\nMatyáš\n. However, things are not quite so simple since his given name\n(\nthe one that appears on his birth certificate\n)\nis\nMatěj\n. However there is no evidence that he ever used the name Matěj and he always used Matyáš. His parents were Vojtěch Lerch and Barbora Adamovská, who worked on a farm, and had five children who survived past the baby stage, two boys and three girls. However, after the two eldest died as babies, a third boy, Vojtěch, died when a young child and a girl, Marie, drowned in a water tank on the farm when\n3\nor\n4\nyears old. The remaining children, Matyáš\n(\nthe subject of this biography\n)\n, Ružena and Marie all grew to adulthood.\nLerch should have begun his education at an elementary school at the age of six. However, although he had been a bright agile child up to that age, sadly when he was six years old he had a serious accident which left him badly crippled. Even after quite a while he was only able to walk with crutches, and could not attend school. When Lerch was eight years old the family moved to Sušice, about\n5\nkm from the small village of Milínov. Although now more able to get around, but still badly handicapped with a bent knee, he spent his days in the fields and meadows on the outskirts of the town. It was there that the burgomaster of Sušice spotted him and thought that he was fit enough to attend the elementary school. He was nine years old when he entered the elementary school in Sušice, three years older than the official starting age. However, he soon showed his abilities\n[\n17\n]\n:-\nLerch later often mentioned a mathematics class episode from the elementary school when he pointed out a slip in a teacher's solution of a problem on the blackboard. The episode made waves in the town.\nAfter the elementary school, which he left older than other pupils because of his late start, Lerch progressed to the lower secondary burgher school of Sušice. There he was fortunate to have Emil Seifert as his mathematics teacher. Seifert was only four years older than his talented pupil and just starting out on his teaching career. They developed both a teacher-pupil relationship and also, given the closeness in age, a real friendship. After studying at the burgher school, Lerch reached the end of his compulsory schooling in\n1877\n. At this time his teachers tried to persuade him to continue his education but the family were poor and his parents were keen that he should bring in a wage. He became clerk at František Scheinhost's match factory in Sušice. However, it only took him a few weeks to decide that this was not for him and, despite knowing that he would face an extremely difficult financial position, he decided to continue his education. He left his job at František Scheinhost's match factory at the end of summer\n1877\nand enrolled in the Realschule in Pilsen, entering into the\n5\nth grade, thereby making up one of the years he had lost. He corresponded with his former teacher Emil Seifert and we see from these letters that he was reading advanced mathematics texts and often criticising the methods used in them and suggesting better ones.\nFrom Lech's letters to Seifert we know that in\n1878\nhe was reading\nEmil Weyr\nand\nEduard Weyr\n's\nZáklady vyšší geometrie\nⓉ\n(\nBasics of Higher Geometry\n)\n, František Josef Studnička's\nZáklady vyšší matematiky\nⓉ\n(\nFundamentals of Higher Mathematics\n)\nand Friedrich Autenheimer's\nElementarbuch der Differential- und Integralrechnung\nⓉ\n(\nElementary book of differential and integral calculus\n)\n. It seems that a religious dispute with one of his teachers led to Lerch leaving the school in Pilsen and attending a secondary school at Rakovník, due west of Prague, in\n1879\n. He graduated from this school on\n13\nJuly\n1880\n. His final certificate gives his examination results: mathematics, outstanding; descriptive geometry, excellent; physics, excellent; Czech, excellent; French, good; history, good; geography, good; chemistry, good; natural history, good; religion, satisfactory; German, satisfactory; and drawing, satisfactory. He had spent three years at the schools in Pilsen and Rakovník having to survive on very little money. He had been able to make a little from tutoring but life at this stage was incredibly hard.\nAt this time in his education, Lerch was aiming at becoming a school teacher and, in the autumn of\n1880\n, he enrolled in the Czech Polytechnic in Prague. However, not long after he began his studies he was told that becoming a teacher was impossible since with his crippled leg he would never obtain the necessary health certificate. With most career paths now closed to him, Lerch decided at this time to aim at becoming a university teacher. In his first year\n1880\n-\n81\nhe took courses on mathematics and physics, while later he took courses on algebra, geometry, mechanics, statics, dynamics, and elasticity. In addition to attending courses at the  Czech Polytechnic, he also attended courses at the German Polytechnic. Among his teachers were Anton Karl Grünwald\n(1838\n-\n1920)\n, František Josef Studnička\n(1836\n-\n1903)\nand\nEduard Weyr\n. In the year\n1883\n-\n84\nLerch wrote six papers, his first paper\nBeitrag zur Theorie der Kegelschnitte\nⓉ\n(\nContribution to the theory of conic sections\n)\n(1881)\nhaving been written in his first year at university.\nAlthough Lerch had been interested in geometry during his early studies, he moved to analysis and studied the work being published by\nHermann Laurent\n,\nOtto Stolz\nand\nJohannes Thomae\n. Finding their approach unsatisfactory he decided he had to build his own approach so, to gain the necessary expertise, he decided that he should study in Germany. Therefore, he went to the University of Berlin where he studied during\n1884\n-\n85\nand was taught by\nKarl Weierstrass\n,\nLeopold Kronecker\n,\nCarl Runge\nand\nLazaras Fuchs\n. He attended courses on the theory of elliptic functions by\nWeierstrass\n, and courses on the theory of algebraic equations and on simple and multiple integrals by\nKronecker\n. He also attended several lecture courses by\nFuchs\n, namely\n(\ni\n)\nIntroduction to the theory of infinite series,\n(\nii\n)\nIntegration of differential equations,\n(\niii\n)\nThe theory of linear differential equations, and\n(\niv\n)\nInvariant theory. He also took\nRunge\n's courses on the solution of equations, on convergence and continuity, and on the differentiation of analytic expressions. In some of these lectures he sat beside\nSofia Kovalevskaya\n. Although he had gone to Berlin expecting to move to research in areas covered by\nWeierstrass\n, he left having been more influenced by\nKronecker\n. This set the direction of his future research to be on\nspecial functions\n, infinite series and analytic functions.\nIn\n1886\nLerch\nhabilitated\nat the Czech Technical Institute in Prague and on\n14\nSeptember of that year joined the teaching staff there. Over the next few years Lerch produced, on average, about one paper per month, a quite stunning achievement. However as the years went by it became clear that he was not going to be promoted to a professorship in Prague. In fact during these years he only held positions of assistant to\nEduard Weyr\nfrom\n1885\nto\n1888\nand assistant to Gabriel Blažek\n(1842\n-\n1910)\n, from\n1888\nto\n1896\n, who, in addition to working on pure mathematics, was a politician and a banker. Lerch lectured on analytical functions and on the geometry of rational curves while an assistant to\nEduard Weyr\n, but, after becoming an assistant to Blažek, he gave lectures on potential theory, higher algebra, the theory of numbers, analytic geometry, and the theory of functions.\nThere is a slightly strange episode in\n1886\nwhen Lerch was awarded a travel scholarship by Prague City Council. He never made the study trip that he had requested the scholarship to cover and in the year\n1887\nhe was awarded another scholarship to fund his writing a textbook on differential and integral calculus. Again he never carried out the task that the money was meant allow him to undertake. Of course Prague City Council were not happy that they had awarded two scholarships to Lerch without him doing the allotted tasks and asked him to return the money. In\n1900\nLerch was awarded the Grand Prix from the\nAcademy of Sciences\nin Paris for his paper\nEssais sur le calcul du nombre des classes de formes quadratiques binaires aux ceoffcients entiers\nⓉ\n(\nEssay on the calculation of the number of classes of quadratic binary forms with integer ceoffcients\n)\nand he used the prize money to repay the debt he had with Prague City Council. Of course failing to carry out the duties he had been paid for did not improve the attitude of either Lerch's colleagues nor of the administrative bodies towards him. There were other actions which displeased the authorities such as his lecturing to the\nRoyal Czech Academy of Sciences\nin\n1884\nin Czech when the accepted language of lectures was German.\nIn\n[\n5\n]\nOtakar Boruvka\n(1899\n-\n1995)\n, a student of Lerch's, gives what he believes are the reasons for Lerch's failure to be promoted:-\nThe faculty of the Czech universities and polytechnics, which, moreover, were concentrated in Prague, were often enlightened men, but their wishes and actions were muted by the views held by the Imperial and Royal dignities, and their actions were subject to the approval of governing bodies in Vienna. Therefore, it is not surprising that thirty-six year old Matyáš Lerch, who it appears had directed his criticism and sharp wit against the mentioned dignities, despite being the author of about\n120\nscientific papers published in many international journals and having lectured on the results in these at the University of Paris, despite being an associate member of the\nRoyal Czech Academy of Sciences\nand of the\nCzech Academy\nsince\n1893\n, was not able to find a reasonable position in his Czech homeland after ten years of being an instructor in Prague, and therefore had to move abroad.\nIn\n1896\nhe was appointed to a chair when he accepted a professorship at the University of Fribourg in Switzerland.\nCharles Hermite\nwrote to him about his move to the University of Fribourg.\nI have noted with great satisfaction the major change which happened to you in the last few days and the happy result of your appointment as a full professor at the University of Fribourg in Switzerland. You have reasons to believe in Providence, which interferes in our lives in order to secure and save those with the courage to go straight ahead crowning with success all their actions, and whose aim is science and not success. I am prejudiced against Bohemia, which should have retained you for its honour and should have recognized long ago the great importance of the papers which you wrote and which placed you in the top rank of contemporary mathematicians. This leads me to a question, Sir, whether you will publish your discoveries in the 'Transactions of the Bohemian Academy' which you have enriched with a large number of beautiful mathematical memoirs, and whose mathematical section would be much poorer from your absence. Rather, I am inclined to believe that you will remain firmly attached to your fatherland.\nAt the University of Fribourg, Lerch lectured in French and German on\nelliptic functions\nand similar topics. Between\n1900\nand\n1907\nhe did not publish any papers in the Czech language. In general he was unhappy with the students at Fribourg, except for a couple, especially\nMichel Plancherel\nwhom he found to be an outstanding Ph.D. student.\nPlancherel\n's thesis was\nSur les congruences\n(\nmod\n2\nm\n)\nrelatives au nombre des classes des formes quadratiques binaires aux coefficients entiers et à discriminant négatif\nⓉ\n(\nOn congruences\n(\nmod\n2\nm\n)\nof the number of classes of binary quadratic forms with integer coefficients and with negative discriminant\n)\n(1907)\n. Lerch was Dean of the Faculty of Science in the academic year\n1900\n-\n01\n. He returned to the Czech Republic in\n1906\nwhere he was appointed professor of mathematics at the Czech Technical Institute in Brno. Over the following fourteen years he wrote\n31\npapers on infinite series, geometry, special functions, and\nnumber theory\n.\nTomás Masaryk was a political leader who liberated the Czechs and Slovaks from Austrian rule. In\n1918\nMasaryk was elected president of Czechoslovakia. A year after the founding of Czechoslovakia, a new university, named the Masaryk University after the first president, was founded in Brno and Lerch became the first professor of mathematics there in\n1920\n. His inaugural lecture was held on\n19\nOctober\n1920\nin the lecture hall of the Czech Technical College in Gorkého Street. Lerch married Roůžena Sejpková on\n13\nJanuary\n1921\n.\nLerch wrote\n238\npapers, listed in\n[\n20\n]\n, mostly on analysis\n(\nabout\n150\npapers\n)\nand number theory\n(\nabout\n40\npapers\n)\n. Some of his work is fundamental in modern operator calculus. He also wrote on geometry and numerical methods. Matti Jutila, in his review of\n[\n2\n]\n, describes Lerch's work in number theory as follows:-\nMatyáš Lerch\n(1860\n-\n1922)\nwas a remarkable Czech mathematician who published about\n250\npapers, some fifty of which were devoted to number theory. His favourite topics in number theory included binary\nquadratic forms\n,\nquadratic residues\n,\nGauss\nsums and\nFermat\nquotients. Also, the Lerch zeta-function is a well-known generalization of\nRiemann\n's\nzeta-function\ndue to him ... this contribution to\nanalytic number theory\n[\nis\n]\npublished in 'Acta Mathematica' in\n1887\n...\nIn\n[\n2\n]\nthere is a short biography of Lerch and the reviews of his number-theoretic papers given in the\nJahrbuch über die Fortschritte der Mathematik\nⓉ\n(\nYearbook on the progress of mathematics\n)\nare reproduced. Also quoted in full in\n[\n2\n]\nis the first paper Lerch wrote on number theory and two other papers which he wrote on\nFermat\nquotients. It also contains a summary of a paper on quadratic residues and forms which was published after his death.\nThe authors of\n[\n19\n]\nwrite:-\nIt is necessary to mention the fact that M Lerch very much liked dealing with factual problems and avoided general proofs. He considered the solution of a given problem finished if he could present its numerical calculation. For this purpose he even bought a\n20\n-digit calculator for his institute at Brno Technical University. He did not like formulas inaccessible to numerical calculation. That is why among his papers there are many dealing with new methods of calculation of problems solved before by other mathematicians. This is also linked to his preference of the theory of numbers where he achieved eminent success.\nAs we mentioned above, Lerch won the Grand Prize of the\nParis Academy of Sciences\nin\n1900\nwith a work on number theory, a great honour for any mathematician and an even greater achievement for a mathematician from outside France. He was also honoured with honorary membership of the\nUnion of Czech Mathematicians and Physicists\nin\n1907\nand an honorary degree from the Czech University in Prague in\n1909\n. Today he is honoured with a grammar school in Brno being named for him as well as an elementary school in Sušice.\nHe is also well known, however, for his work in analysis. In that topic he studied infinite series, and the\ngamma function\nas well as other special functions. He also studied elliptic functions and integral equations. Often the importance of his work is in the methods which he introduced rather than the specific results themselves. He introduced an auxiliary parameter for\nmeromorphic\nfunctions. He also studied the principle of most rapid convergence of a series. He is remembered today for his solution of integral equations in operator calculus and for the 'Lerch formula' for the derivative of\nKummer\n's trigonometric expansion for\nlog\n⁡\nG\n(\nv\n)\n\\log G(v)\nlo\ng\nG\n(\nv\n)\n.\nLerch suffered from diabetes which cased his health to progressively worsen over the years although staying at health resorts in the vacations improved things temporarily. In July\n1922\nhe went to Sušice and several times bathed in the river. The day after his\n31\nJuly swim, he felt ill and on\n2\nAugust the doctors diagnosed pneumonia. With his health already greatly weakened with diabetes, he died on the morning of\n3\nAugust."
}