{
  "nome_completo": "Max Noether",
  "nome_curto": "Max Noether",
  "ano_nascimento": "1844",
  "ano_morte": "1921",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Noether_Max/",
  "lugar_nascimento": "Mannheim, Baden, Germany",
  "lugar_morte": "Erlangen, Germany",
  "biografia": "Max Noether\n's mother was Amalia Würzburger and his father was Hermann Noether. The family were Jewish so a little explanation is required as to why they had German names. In fact Max's paternal grandfather was Elias Samuel, the founder of a business in Bruchsal. Elias had nine children, one being a son Hertz Samuel. In\n1809\nthe State of Baden made the Tolerance Edict which required Jews to adopt Germanic names. Elias Samuel chose the surname Nöther, becoming Elias Nöther, but also changed the given names of his children, giving Hertz the name Hermann. When he was eighteen years old, Hermann Nöther left his home town of Bruchsal and studied theology at the University of Mannheim. Then in\n1837\n, together with his brother Joseph, he set up a wholesale business in iron hardware. Hermann Nöther and his wife Amalia had five children, the third of which was Max. The two children older than Max were Sarah\n(\nborn\n6\nNovember\n1839)\nand Emil. It is worth noting at this point that the Nöther iron-wholesaling business remained a family firm for exactly one hundred years, until the Nazis removed Jewish families from their own businesses in\n1937\n. One other comment is necessary at this point. Although the family name was chosen to be Nöther by Max's grandfather, Max and his family always used the form Noether\n(\nexcept on Max's wedding certificate where the form Nöther appears\n)\n.\nMax attended school in Mannheim but his studies at the\ngymnasium\nwere interrupted in\n1858\n. He suffered an attack of polio when he was\n14\nyears old and it left him with a handicap for the rest of his life. For two years he was unable to walk and was unable to attend the Gymnasium. However, his parents arranged for him to receive lessons at home and so he was able to complete the Gymnasium curriculum without returning to school. At this stage Noether was interested in astronomy, so before beginning his university studies he spent a short period at Mannheim Observatory.\nHe entered the University of Heidelberg in\n1865\nand spent three semesters there before obtaining a doctorate on\n5\nMarch\n1868\n. At Heidelberg he was taught by\nJacob Lüroth\nwho was awarded a doctorate in\n1865\n, but mainly he was influenced by\nGustav Kirchhoff\nwho was the professor of physics. His doctorate from Heidelberg was on astronomy, and Noether was not required to write a dissertation. He was given an oral examination in the Dean's room, with the only requirement being that the candidate had to supply the wine for the examiners. After the award of his doctorate Noether spent time in Giessen working with\nAlfred Clebsch\n. Like Noether,\nClebsch\nhad begun his career working on physics, but had collaborated with\nPaul Gordan\non\nTheorie der Abelschen Funktionen\nⓉ\n(\nTheory of Abelian functions\n)\nin\n1866\n. While at Giessen, Noether met\nAlexander von Brill\nwho was a\nprivatdozent\nthere. The two became friends and collaborators, writing important papers together.\nClebsch\nleft Giessen to take up an appointment in Göttingen in\n1969\nand Noether went with him. In\n1870\nhe submitted his\nhabilitation\nthesis\nÜber Flachen welche Schaaren rationaler Curven besitzen\nⓉ\n(\nOn surfaces which possess families of rational curves\n)\nto Heidelberg and was appointed there as a privatdozent.\nThe journal\nMathematische Annalen\nwas founded in\n1868\nby\nAlfred Clebsch\nand\nCarl Neumann\n. Given Noether's friendship with\nClebsch\nit is not surprising that he would make his journal the main outlet for his publication. He puublished\nZur Theorie des eindeutigen Entsprechens algebraischer Gebilde von beliebig vielen Dimensionen\nⓉ\n(\nOn the theory of algebraic structures of any number of dimensions with unique conformity\n)\nin the second volume of the journal published in\n1870\n, and in the third volume, also published in\n1870\n, he published his habilitation thesis\nÜber Flächen, welche Schaaren rationaler Curven besitzen\nⓉ\n(\nOn surfaces which possess families of rational curves\n)\n, and another paper\nÜber die eindeutigen Raumtransformationen, insbesondere in ihrer Anwendung auf die Abbildung algebraischer Flächen\nⓉ\n(\nOn the unique space transformations, especially in its application to the illustration of algebraic surfaces\n)\n. Noether published many papers in\nMathematische Annalen\nwith a major contribution appearing almost every year between\n1870\nand\n1921\n. He joined the editorial staff of the journal in\n1893\n.\nAppointed a privatdozent in Heidelberg in\n1870\n, Noether was promoted to extraordinary professor there on\n25\nSeptember\n1874\n. In the following year he moved to Erlangen where he was appointed as an extraordinary professor, being named as an ordinary professor there on\n16\nApril\n1888\n. He married Ida Amalia Kaufmann\n(\nborn\n1852\n, died\n1915)\n, the daughter of a wealthy Jewish merchant family from Cologne, on\n28\nAugust\n1880\n. Ida had a brother who was a professor at the University of Berlin. Max and Ida had four children, one of whom was the famous mathematician\nEmmy Noether\n; we give further details below of their children.\nMax Noether was one of the leaders of nineteenth century\nalgebraic geometry\n. He was influenced by\nAbel\n,\nRiemann\n,\nCayley\nand\nCremona\n. Following\nCremona\n, Max Noether studied the invariant properties of an algebraic variety under the action of birational transformations.\nMacaulay\nwrites\n[\n3\n]\n:-\nHe contributed greatly to the advancement of mathematical science in three distinct ways: by the new and fruitful ideas contained in his original researches, by the patient investigation and encouragement he gave to other writers, and by his acutely critical and detailed historical work.\nIn\n1873\nNoether proved an important result on the intersection of two algebraic curves in the paper\nÜber einen Satz aus der Theorie der algebraischen Functionen\nⓉ\n(\nOn a set from the theory of algebraic functions\n)\npublished in volume\n6\nof\nMathematische Annalen\n. This result showed that given two algebraic curves\nf\n(\nx\n,\ny\n)\n=\n0\n,\ng\n(\nx\n,\ny\n)\n=\n0\nf (x, y) = 0, g(x, y) = 0\nf\n(\nx\n,\ny\n)\n=\n0\n,\ng\n(\nx\n,\ny\n)\n=\n0\nwhich intersect in a finite number of isolated points, then the equation of an algebraic curve which passes through all those points of intersection can be expressed in the form\na\nf\n+\nb\ng\n=\n0\naf + bg = 0\na\nf\n+\nb\ng\n=\n0\n, where\na\na\na\nand\nb\nb\nb\nare polynomials in\nx\nx\nx\nand\ny\ny\ny\n, is and only if certain conditions are satisfied. These conditions are now known as \"Notherian conditions\". This theorem gives\n[\n1\n]\n:-\n... necessary and sufficient conditions for the case where the curves have common multiple points with contact of any degree of complexity.\nVolume\n7\nof\nMathematische Annalen\ncontains the important paper\nÜber die algebraischen Functionen und ihre Anwendung in der Geometrie\nⓉ\n(\nOn the algebraic functions and their applications in geometry\n)\nwhich was written jointly by Noether and\nBrill\n.\nLet us also note that Noether wrote many obituaries. For example, he wrote obituaries of\nOtto Hesse\n(1875)\n,\nArthur Cayley\n(1895)\n,\nJames Joseph Sylvester\n(1898)\n,\nFrancesco Brioschi\n(1898)\n,\nSophus Lie\n(1900)\n,\nCharles Hermite\n(1901)\n,\nLuigi Cremona\n(1904)\n,\nGeorge Salmon\n(1905)\n,\nJacob Lüroth\n(1911)\n,\nPaul Gordan\n(1914)\n, and\nHieronymus Georg Zeuthen\n(9121)\n. He was also an editor of\nLudwig Otto Hesse\n's Complete Works, published in\n1897\n. Many of the articles in this archive use material from Noether's obituaries.\nIn\n1882\nhis daughter\nEmmy Noether\nwas born. Emmy became interested in many similar topics to her father and generalised some of his theorems. In\n1883\nMax and Ida Noether had a son named Alfred, who later studied chemistry. He died before his father in\n1918\n. Fritz, who was born in\n1884\n, went on to become a mathematician. Forced to leave Germany under the Nazi anti-Semitic policies, he went to the Soviet Union and was appointed as a professor of mathematics at the University of Tomsk. He was arrested under Stalin's\n1937\n-\n38\nGreat Purge for being a German spy, sentenced to\n25\nyears in prison, then accused of anti-Soviet propaganda while in prison and shot in\n1941\n. Max and Ida Noether's fourth child was Gustav Robert, born in\n1889\n. He suffered ill health for most of his life and died in\n1928\n.\nMacaulay gives an interesting insight into Max Noether's thinking in\n[\n3\n]\n:-\nNoether's mind was naturally intuitive, but he mistrusted intuition, and was apt to let anything suggested by it pass out of his thoughts. It seemed as if this cramped his powers to some extent in his later years. He found perhaps in his subject that intuition was often liable to mislead. He was of course never content without algebraic or arithmetic proof but had sometimes to be satisfied with an incomplete proof. Although naturally impatient he would take infinite pains to understand the thoughts of others, and to give them abundant help out of his own ample resources. There are many, including the writer of this note, who are grateful to him for his help. He had searching and peculiar methods of his own for testing the truth of things."
}