{
  "nome_completo": "Michael Fekete",
  "nome_curto": "Michael Fekete",
  "ano_nascimento": "1886",
  "ano_morte": "1957",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fekete/",
  "lugar_nascimento": "Zenta, Bácska, Austria-Hungary (now Senta, Serbia)",
  "lugar_morte": "Jerusalem, Israel",
  "biografia": "Michael Fekete\n's given name was\nMihály\nbut he later adopted the name Michael. He was born into a Jewish-Hungarian family in Zenta which was in Hungary, but it was part of the Austro-Hungarian Empire at the time of his birth. Today Zenta is in Serbia. His parents, Alexander and Emma Fekete, owned a bookshop in Zenta and they also edited a local newspaper. Michael, one of his parents' four children, attended elementary school in Zenta and then moved on to study at the local\nGymnasium\n. While he was at the Gymnasium he helped his parents both with editing the newspaper and also helping by contributing short stories which were published in the newspaper.\nAfter graduating from the Gymnasium, Fekete entered the University of Budapest to study mathematics. He was taught by\nLipót Fejér\nand greatly influenced by him - this is hardy surprising, since\nFejér\ninspired a whole generation of Hungarian mathematicians. Just a little note at this point; in Hungarian 'Fekete' means 'black' and 'Fejér' means 'white' so the student and his advisor were 'black and white'! Fekete was awarded a doctorate by the University of Budapest in\n1909\nbut already he had a number of papers related to his doctoral thesis in print:\nA general treatment of linear congruence systems\n(\nHungarian\n)\n(1908)\n,\nÜber die additive Darstellung einiger zahlentheoretischer Funktionen\nⓉ\n(\nOn the additive representation of some number theoretical functions\n)\n(1908)\n, and\nOn the additive representation of some number theoretical functions\n(\nHungarian\n)\n(1909)\n. After the award of his doctorate, Fekete went to Göttingen to undertake postdoctoral studies in\n1909\n-\n10\nat the Georg-August University of Göttingen. There he worked with\nEdmund Landau\nand during his year in Göttingen wrote a number of further papers including:\nOn necessary and sufficient conditions for the summability of power series\n(\nHungarian\n)\n(1910)\n,\nSur les séries de Dirichlet\nⓉ\n(\nOn the Dirichlet series\n)\n(1910)\n, and\nSur un théorème de M Landau\nⓉ\n(\nOn a theorem of Landau\n)\n(1910)\n. However, it was\nFejér\n, not\nEdmund Landau\n, who was the greatest influence on Fekete as\nRogosinski\nexplains\n[\n2\n]\n:-\nFekete as a mathematician was very typically an analyst of the school of\nL Fejér\n. From him he inherited the delight in a particular isolated problem. From him too he learned the elegant simplicity of his analytical technique and style. Very little influence of his second teacher\nEdmund Landau\nis seen in this.\nAfter his year in Germany, Fekete returned to Budapest where he taught in secondary schools for eighteen years. He met the mathematics teacher Dora Lenk and, in\n1914\n, they married. Michael and Dora Fekete had two sons but, sadly, Dora died in\n1922\n. During these years in which he was a school teacher, Fekete also taught at the university as a\ndocent\n. One of the university students he taught was\nJohn von Neumann\nand they published the joint paper\nÜber die Lage der Nullstellen gewisser Minimum Polynome\nⓉ\n(\nOn the location of the minimum zeros of certain polynomials\n)\nin\n1922\n. In fact Fekete had taught\nvon Neumann\nwhile he was still at school as he had been employed as a private tutor. By this time Fekete had already published about\n20\npapers, but this was\nvon Neumann\n's first paper published only one year after he completed his studies at the Gymnasium. This paper looked at the transfinite diameter of a set, a concept which Fekete worked on throughout the rest of his career.\nFekete emigrated in\n1928\nwhen he became a lecturer at the Hebrew University of Jerusalem. It was a new university, founded on Mount Scopus three years before Fekete took up the lectureship there. After working as a lecturer for a year, he was made a professor and appointed as Director of the University's\nEinstein\nInstitute of Mathematics\n[\n2\n]\n:-\nAt the university he played an important role in the administration, was Dean of Science, and later the Rector from\n1945\n-\n1948\n.\nHis period as rector was important for the Hebrew University for in\n1948\nJerusalem was divided into Israeli and Jordanian sectors with Mount Scopus in the east part which became Jordanian. The university was then moved to Giv'at Ram in the Israeli part. Fekete retired in\n1955\nand in the year of his retirement he attended the International Congress of Mathematicians in Amsterdam. He gave his lecture\nTransfinite diameter and Fourier series\nto the congress on Monday,\n6\nSeptember, to Section IId with\nJean Leray\nin the chair. Also in the year in which he retired he received his greatest honour when presented with the Israel Prize for Exact Sciences.\nRetirement did not mean that Fekete gave up research but continued working on ideas that had fascinated him throughout his career. In\n1958\n, one year after his death, his paper\nNew methods of summability\nwas published by the\nLondon Mathematical Society\n. V F Cowling begins a review\n(\nwhich explains how it came to be written\n)\nas follows:-\nIn\n1916\nthe author showed that analytic continuation of a power series can be represented as a matrix-transformation of the partial sums by\n[\na specific\n]\nupper triangular matrix .... This appeared in a Hungarian textbook by Beke\n(1916)\nan English summary of which is to be found in a paper of Vermes\n(1949)\n. This method of summability has subsequently been called the 'Taylor method'. In the present note\n(\na summary of a lecture given by the author in\n1954\nas compiled by P Vermes\n)\ntwo new methods of summability are introduced.\nIn\n[\n2\n]\nFekete's last few years are described; note that he married Erna Baruch during these late years:-\nFekete was a genuine and enthusiastic mathematician and a very fertile one, as can be seen from the long list of his publications\n[\ncontaining\n77\nitems\n]\n. Even as an old man he had preserved his youthful enthusiasm and his capacity for work - in fact, he died over his desk doing mathematics. He travelled widely in his late years, both in Europe and in the United States of America, and loved lecturing on his problems wherever he could. The small energetic man with fiery eyes and an unruly\nEinstein\nmane of white hair on his fine large head was a well-known visitor and speaker at mathematical conferences and seminars everywhere.\nFekete advised several doctoral students who went on the become world-leading mathematicians, perhaps the most famous being\nAryeh Dvoretzky\nand\nMenahem Max Schiffer\n.\nLet us end this short biography by recording\nRogosinski\n's debt to Fekete\n[\n2\n]\n:-\nFekete's genuine love of mathematics showed also in his keen interest in the work of other, and in particular younger, mathematicians. I myself met him first in\n1923\nat a conference at Innsbruck when his interest in some early work of my own was so encouraging to me at the beginning of my career. My case is not isolated, and in this way he has made himself many life-long friends."
}