{
  "nome_completo": "Mikhail Iosiphovich Kadets",
  "nome_curto": "Mikhail Iosiphovich Kadets",
  "ano_nascimento": "1923",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kadets/",
  "lugar_nascimento": "Kiev, Soviet Empire (now Kyiv, Ukraine)",
  "lugar_morte": "Kharkov, Ukraine",
  "biografia": "Mikhail Iosiphovich Kadets\n' father was Iosiph Mikhailovich Kadets. The\n1930\ns was a difficult time to be growing up in the Soviet Union. In the early years of the decade workers and peasants were arrested who did not fit in with Joseph Stalin's vision but, beginning in\n1936\n, a different terror was imposed when Stalin had his party members, the intellectuals and the military men, arrested. Iosiph Mikhailovich was arrested in\n1937\n, the year that the 'Great Terror' was at its worst, and declared to be one of the 'Enemies of the People'. He was sent to one of Stalin's Gulags, the forced labour camps, where he died. Mikhail Iosiphovich attended secondary school in Kharkov, and was in the middle of his studies in\n1939\n, the year in which World War II began. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Kharkov and Kadets continued his secondary school education. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. In fact this occurred only a few days after Kadets graduated from secondary school. German troops advanced towards Kharkov and Kadets was evacuated from the city and underwent military training. After completing this training he served in the army for the duration of the war. He was released from military service in\n1946\nand only at this time was he able to continue his education.\nIn\n1946\nKadets enrolled in the Faculty of Physics and Mathematics of Kharkov State University. Two of his teachers were particularly important in influencing the future direction of his interests in mathematics, namely V K Baltaga and\nBoris Yakovlevich Levin\n[\n2\n]\n:-\nBoth were excellent lecturers. Baltaga, who gave the course on mathematical analysis, drew Kadets' attention to the question of infinite-dimensional extensions of the theorem of\nSteinitz\non conditionally convergent series. Later this became one of the directions of Kadets' scientific activity. Kadets attended\nLevin\n's special courses on \"Almost periodic functions\" and \"Banach spaces\", which played an important part in determining his scientific interests.\nBanach\nhad published his monograph\nThéorie des opérations linéaires\nⓉ\n(\nTheory of linear operations\n)\nin\n1932\nbut at this time it was only available in French. In\n1948\na Ukrainian translation was published and Kadets began to study the book. Of course the book presented many powerful methods which Kadets found very useful but it was the problems that\nBanach\nposed in this work which provided the most fascination.\nBanach\n's problems were a constant challenge to Kadets throughout his life and they inspired much of his mathematical output. In some ways one might consider\nBanach\nas Kadets' supervisor, not of course in any personal sense because\nBanach\ndied before Kadets began his university studies, but rather through the inspiration and guidance that his book provided. Although\nLevin\ndidn't suggest research problems for Kadets to work on, nevertheless, it was\nLevin\nwho provided him with good advice and was a strong influence on him. Many students do some teaching but this was not the case for Kadets who concentrated on research.\nAfter completing his first degree in\n1950\n, Kadets went to Makeevka in the Donetsk region where he was employed as a research assistant in the Scientific Research Institute of the Ministry of Coal Mining. One of the departments of the Institute of Coal Mining was 'Fire-fighting technology' and Kadets taught mathematics and physics in this department. However, he never considered this as a permanent place of work and while he was there he continued research with the aim of eventually getting a university position. Of course he had little contact with mathematicians interested in similar problems to those he was studying, and during the years in Makeevka it was\nBanach\n's monograph which underpinned his efforts. By\n1955\nhe had sufficient results to write a Ph.D. thesis and in that year he submitted\nTopological equivalence of some Banach spaces\n(\nRussian\n)\nto Kharkov State University and was awarded the degree.\nThe problem that Kadets worked on for his Ph.D. was the\nFréchet\n-\nBanach\nproblem on the topological equivalence of all separable infinite-dimensional\nBanach spaces\n. The first steps towards a solution had been taken by\nStanisław Mazur\n, a student of\nBanach\n's, in\n1929\nand then by\nStefan Kaczmarz\n, a colleague of\nBanach\n's, in\n1932\n. Kadets was able to solve a special case of the\nFréchet\n-\nBanach\nproblem in his first publication which appeared in\n1953\n. He continued to extend his results to successively wider classes. The authors of\n[\n4\n]\nexplain the way that Kadets attacked the problem:-\nTo the solution of the problem he applied arguments of approximation theory suggested by\nBernstein\n's theorem on the recovery of a continuous function from its least deviations from polynomials. Since the best approximations in a normed space behave the more regularly the \"more convex\" the norm of this space is, an essential part of the method is the introduction in the given space of an equivalent norm having sufficiently good properties. The combination of the technique of best approximations with the technique of equivalent norms enabled Kadets to prove the homeomorphic property successively in still wider classes: uniformly convex, reflexive, conjugate.\nHaving been awarded his Ph.D. in\n1955\n, Kadets remained working at the Ministry of Coal Mining in Makeevka for another two years. In\n1957\n, however, he returned to Kharkov where he spent the rest of his career working in various higher education establishments in that city. He continued to work towards a complete solution of the\nFréchet\n-\nBanach\nproblem and achieved this in\n1966\n. He announced that he had proved that all infinite-dimensional, separable\nBanach\nspaces are homeomorphic in\nOn topological equivalence of separable Banach spaces\n(\nRussian\n)\n(1966)\nand gave a complete proof in\nA proof of the topological equivalence of all separable infinite dimensional Banach spaces\n(\nRussian\n)\n(1967)\n. Today this important result is often known as 'Kadets Theorem'. This result brought Kadets international fame and he was invited to the Symposium on Infinite Dimensional Topology to be held at Louisiana State University in Baton Rouge in the United States in March\n1967\n. Kadets applied to be allowed to travel to the symposium but, as was usual, his application was refused. The participants at the Symposium wrote a letter to Kadets:-\nWe send you greetings from the Symposium on Infinite Dimensional Topology and we express our regrets that you were unable to join us.\nThe letter was signed by over\n40\nof the participants.\nBefore publishing his work on topological equivalence, Kadets published in\n1964\na result which today is often known as 'Kadets\n1\n4\n\\large\\frac{1}{4}\\normalsize\n4\n1\n​\n-Theorem'. This result solved the famous\nPaley\n-\nWiener\nproblem on the basis property for systems of exponentials in\nL\n2\nL^{2}\nL\n2\n. We choose not to describe the long list of highly significant results on\nBanach\nspaces that Kadets proved throughout his career but we refer the reader to the articles in the references where a good overview of these important contributions is given.\nFrom\n1965\n, Kadets worked at the Kharkov State Academy of Municipal Economy as well as at Kharkov University where he gave courses on\nFunctional Analysis\nand, in particular, high powered courses on\nBanach\nspaces such as 'Series in Banach spaces', 'Biorthogonal systems and bases', 'Theory of renormings' and similar specialist topics related to his research interests. His students described his lecturing style as\n[\n9\n]\n:-\n... a disciplined, keen, and concise language on a background of meticulous techniques of analysis and geometry.\nKadets married Diamara Lazarevna Dun and their son Vladimir Mikhailovich Kadets, born in Kharkov in\n1960\n, became a mathematician working in a similar area to his father. We give information about Vladimir Mikhailovich Kadets' career below. The two Kadets, father and son, coauthored the book\nRearrangements of series in Banach spaces\n(\nRussian\n)\n(1988)\n. The authors express their gratitude to Diamara Lazarevna:-\n... the spouse of the senior and the mother of the junior of the authors, who took upon herself the worries of everyday life - without the freedom she thus provided we would never have decided to undertake the work whose results are now offered to the reader.\nGraham Jameson writes in a review of their book:-\nThe central theme of this book stems from a theorem of\nE Steinitz\ndating from\n1913\n. The \"sum-set\" of a series will mean the set of all sums of convergent rearrangements of the series.\nSteinitz\n's theorem says that if\n∑\nx\nn\n\\sum x_{n}\n∑\nx\nn\n​\nis a convergent series in a finite-dimensional Banach space X, with sum s, then its sum-set is a linear subset of X ... An example of\nMarcinkiewicz\n(\nwrongly recorded in the \"Scottish book\" and later reconstructed by Kornilov\n)\nshowed that in infinite-dimensional spaces the sum-set need not be convex. The book under review gives a full account of later developments related to this theorem; some are quite recent, and several are the work of the authors themselves. In particular, a result of V M Kadets states that every infinite-dimensional space contains series with nonconvex sum-set. ... The book also includes some of the theory of unconditionally convergent series\n(\nfor which, of course, rearrangement introduces no new points\n)\n. This part of the material is more standard and largely covered in other books. ... A wealth of supplementary information is gathered in the form of exercises\n(\nsome far from trivial, but hints are given\n)\n, and the book concludes with a survey of unsolved problems.\nThis important book was translated into English and published by the\nAmerican Mathematical Society\nin\n1991\n. The two authors published\nSeries in Banach spaces. Conditional and unconditional convergence\n(1997)\n. The Introduction begins as follows:-\nSeries of scalars, vectors, or functions are among the fundamental objects of mathematical analysis. When the arrangement of the terms is fixed, investigating a series amounts to investigating the sequence of its partial sums. In this case the theory of series is a part of the theory of sequences, which deals with their convergence, asymptotic behaviour etc. The specific character of the theory of series manifests itself when one considers rearrangements\n(\npermutations\n)\nof the terms of a series, which brings combinatorial considerations into the problem studied. The phenomenon that a numerical series can change its sum when the order of its terms is changed is one of the most impressive facts encountered in a university analysis course. The present book is devoted precisely to this aspect of the theory of series whose terms are elements of\nBanach\n(\nas well as other topological linear\n)\nspaces. The exposition focuses on two complementary problems. The first is to characterise those series in a given space that remain convergent\n(\nand have the same sum\n)\nfor any rearrangement of their terms; such series are usually called unconditionally convergent. The second problem is, when a series converges only for certain rearrangements of its terms\n(\nin other words, converges conditionally\n)\n, to describe its sum range, i.e. the set of sums of all its convergent rearrangements.\nThis monograph updated their previous book by simply adding new material to include the later developments:-\nA new chapter devoted to non-norm topologies presents the authors' results showing that a sum range can be non-convex for the weak topology and for convergence in measure, and the theorem of Banaszczyk stating that the\nSteinitz\nproperty holds in nuclear metrizable spaces. Finally, a\n20\n-page appendix describes recent work by the authors on the set of limits of\nRiemann\nsums I\n(\nf\n)\nof a vector-valued function f on a real interval, showing close analogies with the earlier results of sum ranges.\nThe authors of\n[\n6\n]\ngive the following comment about Kadets' school at Kharkov:-\nKadets devoted much time and effort to his pedagogical activities. Nineteen of his students defended their Ph.D. dissertations and among them seven became doctors of the sciences. He was generous in sharing his mathematical ideas with his students. His Kharkov school was well known internationally. ... Mikhail Iosifovich Kadets was a brilliant and an exceptionally deep mathematician, a kind and sympathetic person, witty and pleasant to talk with. That is how he will remain in our thoughts.\nThe authors of\n[\n2\n]\nwrite:-\nAll who know Kadets esteem highly his independent character and the great demands he makes on himself, the breadth of his scientific interests and his sense of humour.\nHe was honoured by being awarded the title Honoured Scientist of Ukraine in\n1991\nand he received the State Prize of the Ukraine in\n2005\n.\nFinally, let us mention some further details of the career of Kadets' son Vladimir Mikhailovich. He studied at Kharkov State University, graduating with a Master's Degree in mathematics in\n1982\n. He continued to undertake research at Rostov-on-Don State University with Naum Samoilovich Landkof\n(\nborn\n1915)\n, who had been a student of\nMikhail Alekseevich Lavrent'ev\n, as his thesis advisor. He was awarded a Ph.D. in\n1985\n. Then he worked at the Kharkov Institute of Civil Engineering, Kharkov State University, and Kharkov National University. His interests are very similar to those of his father, namely\nBanach\nspace theory, in particular the study of sequences and series, bases, vector-valued measures and integration, isomorphic and isometric structures of\nBanach\nspaces, and operators in\nBanach\nspaces."
}