{
  "nome_completo": "Mikhail Mikhailovich Postnikov",
  "nome_curto": "Mikhail Mikhailovich Postnikov",
  "ano_nascimento": "1927",
  "ano_morte": "2004",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Postnikov/",
  "lugar_nascimento": "Shatura, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Mikhail Mikhailovich Postnikov\n's father was an electrical engineer, working at the local power station, while his mother was a school teacher. He only spent the first few years of his life in Shatura since the family moved to Perm. However, in\n1937\n, when Mikhail Mikhailovich was ten years old, his father was arrested and sent to the Gulag. He was never seen again and presumably died in the Gulag but some time later he was exonerated. Postnikov attended school in Perm for eight years but it was not a good experience for him since he was far ahead of his fellow pupils but was not allowed to skip classes. Some of the teachers allowed him to read advanced books in their classes although they always demanded that he could answer their questions on the current lesson.\nIn September\n1942\n, when still only\n14\nyears of age, he was allowed to take the entrance examinations for Perm University despite the regulations which required him to have spent ten years at school. The reason that the regulations were relaxed was due to the difficulties encountered during World War II - the intention was to make it possible for soldiers to enter university but Postnikov took his chance and, passing the entrance examinations, entered Perm University in\n1942\n.\n(\nIn fact Perm had been renamed Molotov in\n1940\nso it was in fact Molotov University that he entered - however, we shall continue to was the name Perm for both the city and its university.\n)\nAlthough Postnikov was not at all impressed by most of his professors, whom he felt were simply reading lectures from a textbook, he did find one professor,\nSof'ja Aleksandrovna Janovskaja\n, inspiring.\nJanovskaja\nhad been a professor at Moscow University but she had been evacuated to Perm when it looked as if the German advance would threaten to capture Moscow. She had with her a brilliant third year student,\nEugene Borisovich Dynkin\n, and quickly Postnikov became convinced that he would only have top quality lecturers if he attended Moscow University.\nOnce the threat of the German army capturing Moscow had receded,\nJanovskaja\nand\nDynkin\nreturned to Moscow in\n1943\n. Postnikov had wanted to travel with them but special permission was required before anyone was allowed into Moscow and Postnikov was denied permission. Somehow or other, in November\n1943\nsome time after\nJanovskaja\nhad begun teaching again in Moscow, Postnikov arrived there on a train having hidden away and, knowing\nJanovskaja\n's address, was able to arrive unannounced at her home. She made him welcome and the next day took him to the Department of Mechanics and Mathematics of Moscow State University where she taught. The chairman of the Department was\nIvan Georgievich Petrovsky\nand he accepted\nJanovskaja\n's advice that Postnikov was capable of passing the first year examinations and entering second year courses. By December\n1943\nPostnikov had passed not only the first year examinations but some second year ones too and he began his studies. Once the quality of the young student was recognised, arrangements were made to allow him the right to be in Moscow.\nPostnikov, still only seventeen years old, graduated from Moscow State University in the summer of\n1945\nwith a Master's degree. He explained in\n[\n6\n]\nhow he came to have\nLev Semenovich Pontryagin\nas thesis advisor for his senior thesis:-\nThe assistant dean ... called me in to say, \"Postnikov, you need to have an advisor for your senior thesis. Who do you want, Lusternik or\nAleksandrov\n? ... At this point a very strange thing happened. Without a moment's hesitation I blurted out, \"I want\nLev Semenovich Pontryagin\n!\" The reason why this was so strange is that I did not know Pontryagin, and had only taken his very boring, formalistic course of homological algebra. Yet my spontaneous choice turned out to be an unusually good one: if it weren't for\nPontryagin\nit's hard to say what would have become of me. ... The day after my conversation with the assistant dean, seeing\nPontryagin\nin the hall, I said to him \"Lev Semenovich! My name is Postnikov, I am a fifth-year student, and I told the dean that you are to be my advisor!\"\nPontryagin\nwas startled, but answered, \"Fine, come to see me at home tomorrow, and we'll talk.\" That is how I became\nPontryagin\n's student.\nContinuing to work with\nPontryagin\n, Postnikov was awarded his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\nin\n1949\n. He published results from his senior thesis and his Ph.D. thesis in a number of papers\n(\nall written in Russian\n)\n:\nThe structure of the ring of intersections of three-dimensional manifolds\n(1948)\n,\nThe classification of continuous mappings of a three-dimensional polyhedron into a simply connected polyhedron of arbitrary dimension\n(1949)\n,\nHomology invariants of continuous mappings\n(1949)\n,\nClassification of the continuous mappings of an arbitrary n-dimensional polyhedron into a connected topological space which is aspherical in dimensions greater than unity and less than n\n(1949)\n, and\nClassification of continuous mappings of an\n(\nn\n+\n1)\n-dimensional complex into a connected topological space which is aspherical in dimensions less than n\n(1950)\n.\nAfter the award of his Ph.D., Postnikov began working in\nPontryagin\n's Department in the\nSteklov\nMathematical Institute in Moscow. During the following two years he completed a remarkable piece of work concerning the homotopy classification of polyhedra and their maps. He announced his results in a number of papers\n(\nall written in Russian\n)\n:\nDetermination of the homology groups of a space by means of the homotopy invariants\n(1951)\n,\nOn the homotopy type of polyhedra\n(1951)\n, and\nOn the classification of continuous mappings\n(1951)\n.\nPeter Hilton\n, who reviewed them, was impressed and circulated details to his colleagues. In\n1953\nJ C H Whitehead\ndescribed Postnikov's results as \"the greatest achievement in\nalgebraic topology\nin recent years\". For this work, Postnikov was awarded the Lenin Prize in\n1961\n. The authors of\n[\n5\n]\nwrite:-\nPostnikov played an enormous role in establishing and developing algebraic topology in the USSR. He worked in the Faculty of Mechanics and Mathematics at Moscow State University for more than twenty years and directed the scientific research seminar\n(\nin the last ten years, together with A V Chernavskii\n)\n. Almost all the Soviet books on algebraic topology that have been published since the war have appeared with his active participation\n(\ndirect authorship, translation, editing, recommendation for translation, and so on\n)\nand almost all the Moscow algebraic topologists are either students of Postnikov or students of his students, or students of students of his students.\nLet us look briefly at some of the Postnikov's books referred to in this quotation. All were originally written in Russian but they were translated into English, and some into other languages.\n1\n.\nFoundations of Galois theory\n(1960)\n. H Schwerdtfeger writes:-\nAccording to the preface, this book has been written for students in their second or third year in the university who, after a preliminary introduction to higher algebra, wish to proceed to\nGalois theory\n. Complicated technicalities have been avoided and with regard to its restricted aims the straightforward exposition is up-to-date in method and statement of results.\n2\n.\nThe variational theory of geodesics\n(1967)\n. W Klingenberg writes:-\nThe book contains a clear and detailed presentation of the basic theorems of Riemannian manifolds. A careful derivation of the variational properties of geodesics then follows. Highlights are\nMorse\n's and\nBott\n's quadratic form and the index theorem.\n3\n.\nIntroduction to Morse theory\n(1971)\n. Alan Weinstein writes:-\nMost of this book consists of a well-written, self-contained text on homotopy theory and\ndifferential geometry\n, in preparation for chapters on Morse theory on finite dimensional manifolds, the variational theory of geodesics, and the study of path spaces by finite-dimensional approximation.\n4\n.\nIntroduction to the theory of algebraic numbers\n(1978)\n. J B Roberts writes:-\nThe aim of the book is to give an exposition of the theory of algebraic numbers showing how the subject arises in a natural way from the investigation of\nFermat\n's \"last theorem''.\n5\n.\nStable polynomials\n(1981)\n.\n6\n.\nLectures in algebraic topology\n(1984\n,\n1985)\n. This book is based on special lectures delivered by Postnikov to undergraduate and graduate students at Moscow State University. The first volume\n(\nsubtitled\nElements of homotopy theory\n)\nis devoted to general homotopy theory and to homotopy groups. The second volume\n(\nsubtitled\nHomotopy theory of cell complexes\n)\nconcentrates, as the title suggests, on homotopy theory of cell complexes.\nWe have changed the chronological sequence of Postnikov's publications slightly to list finally the six textbooks which he wrote corresponding to six series of lectures on geometry given to undergraduate and graduate students at Moscow State University.\n7\n.\nLie groups and algebras\n(1982)\n. Rolf Sulanke writes:-\nThe textbook is a profound description of lectures about Lie groups and\nLie algebras\ngiven by the author at Moscow State University. ... The author's aim is to develop the\nLie\ntheory from the very beginning up to\nE Cartan\n's theorem about the equivalence of the category of simply connected\nLie\ngroups with the category of\nLie\nalgebras.\n8\n.\nLinear algebra and differential geometry\n(1986)\n. B Reichstein writes:-\nWritten by a famous author and mathematician with a worldwide reputation, a winner of the Lenin prize, the highest honour that a Soviet mathematician can be awarded, the book gives a very clear and at the same time rigorous presentation of different topics in linear algebra and their numerous applications to modern geometry and analysis. The main emphasis is on the ideas rather than on computational techniques.\n9\n.\nAnalytic geometry\n(1986)\n.\n10\n.\nSmooth manifolds\n(1987)\n.\n11\n.\nDifferential geometry\n(1988)\n.\n12\n.\nRiemannian geometry\n(1998)\n. Robert J. Low writes:-\nThis volume is the sixth in Postnikov's series of lecture notes in differential geometry, and provides an advanced overview of various topics in Riemannian geometry. ... I found the presentation insightful and stimulating.\nWe should also comment on Postnikov's quality as a lecturer which is emphasised in all the references\n[\n3\n]\n:-\nFrom\n1954\nuntil\n1960\nhe lectured in the higher geometry and topology department at Moscow State University. His brilliant lectures, once heard, were never forgotten.\nHe also made an impact in other ways\n[\n3\n]\n:-\nThe interests of Postnikov are not restricted to pure mathematics. He has assembled a huge collection of puzzles and games. Postnikov's articles and television appearances concerning the reform of the education system have made a large impact on society at large.\nFinally we note that among his other interests were travel, chess and bridge."
}