{
  "nome_completo": "Moshé Flato",
  "nome_curto": "Moshé Flato",
  "ano_nascimento": "1937",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Flato/",
  "lugar_nascimento": "Tel Aviv, British Mandate for Palestine (now Israel)",
  "lugar_morte": "Paris, France",
  "biografia": "Moshé Flato\n's parents were Shlomo Flato and Anna Lunski. Anna left Russia and arrived in Palestine in\n1922\nwith her parents. She was a student of psychology when she met Shlomo Flato in a Tel Aviv cafe. Shlomo was an engineer who had trained in Dantzig before the Nazis came to power in Germany. He had been born into a leading Polish Jewish family and after graduation he had gone to Palestine to escape the anti-Semitic policies of the Nazi regime having foreseen the tragedy which was about to befall Poland. Shlomo Flato brought various members of his family to Palestine before the outbreak of World War II but almost all who remained in Poland were exterminated by the Nazis. Shlomo was appointed as chief engineer for public works and moved to Jerusalem during World War II but returned to Tel Aviv when the war ended.\nMoshé's mother wanted to continue her career after her child was born and so a governess was employed to look after Moshé. However, Moshé did not appreciate the arrangement so eventually his mother had to give up her ambitions regarding a career, and bring up her child. Moshé's parents spoke to him in Hebrew but he was surrounded by family members who spoke Polish and Russian. Other family friends spoke German so Moshé grew up speaking many languages. At first his performance at school was good but not outstanding. Only in mathematics did he shine. However when he was given an IQ test he achieved the highest grade since the test had been introduced and his teachers realised that they had an outstanding pupil who was not being motivated by the slow pace of the standard classroom teaching. However Moshé was not the 'ideal pupil' and continued to play pranks which led to frequent punishments.\nHe received piano lessons from Daniel Barenboim's mother and showed real musical talent. He considered making a career as a pianist for a while but his love for mathematics and physics eventually won the day. He passed his final high school examination in\n1955\nwith a mark of 'excellent' but after that was required to undertake military service. A special scheme for gifted students allowed him to study at university and undertake basic military training in the vacations. It still meant that he was required to serve as an officer for three years after graduating. He led a small group of soldiers into Jordan in\n1955\nbut they were ambushed and seven of the ten were killed. Flato survived but insisted on telling the truth about the operation rather than giving an 'official version'. He was punished, eventually serving a month in prison. As well as the military service, he studied at the Hebrew University of Jerusalem, being awarded a Master's degree in\n1960\nwith physics as his main subject and mathematics as his secondary subject. In fact deciding between physics and mathematics had been a difficult task and at one point he thought he might study algebra with\nAmitsur\nbut had settled for theoretical physics with Giulio Racah.\nAfter the award of his Master's degree, Flato served as a lieutenant in the Israeli Air Force. He was asked to set up a programme to teach mathematics and aerodynamics to Israeli pilots.  Athough still in the Air Force, he taught a group theory course at the Hebrew University. In\n1961\nhe was made head of the theory group working for the military on an experimental nuclear reactor. In this role he\n[\n12\n]\n:-\n... sometimes refused politically motivated but scientifically hazardous instructions.\nHe also taught a solid state physics course as Bar-Ilan University.\nHe was given permission to attend a theoretical physics summer school in Italy in\n1962\n. However he was involved in a car accident which meant that for the next six months he was receiving treatment, partly in Geneva partly in Tel Aviv. He was allowed to end his military service because of his injuries and began undertaking research towards his doctorate. He was awarded a grant by the French government to undertake research at the Institut Henri Poincaré in Paris\n[\n12\n]\n:-\nThe arrival in Paris of the 'sabra' bull-in-a-china-shop that Moshé was then, and remained to the very end, created quite a stir. He was recognised immediately by\nLouis de Broglie\nand\nAndré Lichnerowicz\n...\nAfter his scholarship ended he remained in France, accepting a position in physics at the University of Lyon in\n1964\n. He remained in Lyon until\n1967\n, defending his Doctorat-ès-Science Physiques in Paris in\n1965\nbefore a committee chaired by\nLichnerowicz\n. Some of the papers he wrote around this time are\nSur les formules de masses fortes et électromagnétiques des particules élémentaires\nⓉ\n(\nOn the formulas of strong and electromagnetic masses of elementary particles\n)\n(1964)\n,\nLe groupe conforme comme possibilité de symétrie unifée en physique des interactions fortes\nⓉ\n(\nThe conformal group as a possibility of unified symmetry in strong interaction physics\n)\n(1965)\n,\nAlgèbres unifiantes; application à l'algèbre de Lie du groupe de Poincaré\nⓉ\n(\nUnifying algebras; application to the Lie algebra of the Poincaré group\n)\n(1965)\n,\nOn the \"space-time character\" of internal symmetries of elementary particles\n(1965)\n,\nRemarks on the connection between external and internal symmetries\n(1965)\n,\nOn the connection between external and internal symmetries of strongly interacting particles\n(1966)\n. These were co-authored with several mathematical physicists including his friend Daniel Sternheimer\n(\nthe author of\n[\n12\n]\nand\n[\n13\n]\n)\n. The theme of these papers is to connect the external symmetry properties of a physical system as represented by its invariance under the inhomogeneous\nLorentz\ngroup\n(\ncalled by Flato the\nPoincaré\ngroup\n)\nor its\nLie\nalgebra, and the internal symmetry properties as represented by various unitary groups.\nFlato became a French citizen on\n10\nMarch\n1967\nand in\n1968\nhe was appointed as Professor of Mathematics at the University of Dijon.\nIn\n[\n13\n]\nSternheimer writes:-\nThe notion of symmetry guided Moshé throughout his scientific career, both as a mathematician and as a theoretical physicist, and led him to make a number of significant contributions. Even on the mathematical side, the motivation for the study of symmetry comes from physics and the mathematical theory has physical applications. In this connection I can mention two directions which his work ... took. The first is the theory of analytic vectors in\nLie\ngroup representations, suggested by the problems that arise in passing from\nLie algebras\nto\nLie\ngroups. The second is the cohomological study of nonlinear representations of covariance groups of nonlinear partial differential equations which leads to important mathematical developments with nontrivial physical consequences ...\nIn\n1977\nFlato was appointed to the Gevrey's chair of mathematics at Dijon. Fedosov writes\n[\n3\n]\n:-\nI vividly remember the day when I came to Dijon to talk at a seminar. It began at the restaurant at the Dijon station where I was invited to lunch by a telephone call from Paris. Moshé's energy and outstanding personality produced an unforgettable impression upon me from the moment I saw him. During the lunch he acquainted me with French cuisine and discussed many things: mathematics, politics, art and music.\nSternheimer writes\n[\n12\n]\n:-\nHe was extraordinarily quick minded, had a unique intuition and a fantastic ability to interact strongly at the appropriate level with everyone, friend and foe alike.\nHe received many honours for his contributions. In\n1980\nhe was awarded the interdisciplinary Saintour Prize by the Collège de France. He was a consultant for the Nobel Prize for physics from\n1971\nuntil his death. He served as president of the Scientific Council of the Union des Assurances de Paris from\n1984\nto\n1992\n."
}