{
  "nome_completo": "Mikhail Samuilovich Livsic",
  "nome_curto": "Moshe Livsic",
  "ano_nascimento": "1917",
  "ano_morte": "2007",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Livsic/",
  "lugar_nascimento": "Pokotilova (near Uman), Ukraine",
  "lugar_morte": "Be’er Scheva, Israel",
  "biografia": "Moshe Livsic\n's family moved to Odessa when he was four years old since his father had been appointed professor of mathematics at the Academy there. The family were Jewish and Livsic brought up in a very religious household. He was introduced to mathematics from a young age at his home where\nChebotaryov\n,\nKagan\nand\nShatunovsky\nwere frequent visitors.\nLivsic graduated from school in\n1931\nand, with a school friend, planned his future studies. His aim was to study philosophy but first he would have to study physical sciences. However to be successful in the physical sciences Livsic and his friend would first have to become knowledgeable in mathematics. However, as he wrote, see\n[\n1\n]\n:-\nI succeeded in thoroughly studying some fields in mathematics. I succeeded less in studying some fields in physics. There was no time for philosophy.\nLivsic began studies at Odessa technical College aimed at his becoming a radio technician but, in\n1933\n, he entered the Department of Physics and Mathematics at Odessa State University. This department had only recently opened. There he was taught by\nM G Krein\n, M A\nNaimark\nand, a couple of years later, by\nB Ya Levin\n. He was particularly interested in the courses in complex variable,\nintegral equations\nand\ndifferential equations\n. These courses presented the latest research results.\nLivsic took part in the\nfunctional analysis\nseminar and studied analytic functions. In fact\n[\n1\n]\n:-\nHe used the ideas, techniques and methods of analytic function theory throughout all his research.\nHe remained at Odessa working for his doctorate under\nKrein\n's supervision. However his interests changed over time. His Master's Degree was achieved with a thesis in quasianalytic functions, then he became interested in operator theory which came out of earlier work he had done on the moment problem. At this time Livsic's studies were much influenced from his reading works by M H\nStone\n,\nvon Neumann\n,\nN I Akhiezer\nand\nA Y Plessner\n.\nDuring World War II Livsic avoided military service since his eyesight was poor. However he had to leave Odessa as the German armies advanced and his studies were somewhat disrupted. It was\n1942\nbefore he was able to defend his doctoral thesis on Hermitian operator theory and the generalised moment problem. His\nhabilitation\nthesis on generalisations of\nvon Neumann\n's extension theory was examined in\n1945\nby a powerful groups of mathematicians, namely\nBanach\n, Gelfand,\nNaimark\nand\nPlessner\nat the\nSteklov\nInstitute.\nAt the end of World War II, Livsic as not invited to return to his post at Odessa since:-\n... he was not suited to represent the Ukrainian culture...\nKrein\nwas dismissed from his post and the school of functional analysis closed.\nAfter working at Kirovograd, Livsic returned to Odessa to teach at the Hydrometerological Institute which was a minor institution. He remained there until\n1957\n, publishing results on applications of his functional analysis results to\nquantum theory\n. From\n1957\nuntil\n1962\nLivsic was head of mathematics at Kharkov Mining Institute, joining\nAkhiezer\nat Kharkov State University in\n1962\n.\nIn\n1975\nKharkov made active moves to enable him to go to Israel. He first took a post in the Institute of Agricultural Machines in Tbilisi, then after three years he was able to go to Israel where he was appointed to Ben Gurion University in\n1978\n. Again he began building a research school in operator theory. He is described in\n[\n2\n]\nas follows:-\nMoshe has always been very active and dedicated to his work. His recent breakthroughs in the theory of characteristic functions for several commuting operators indicate that in spite of his seventy years, mathematically Moshe is still a young man. He is loved by his friends, colleagues and students for his wonderful qualities of integrity, honour and benevolence, and respected as a great mathematician."
}