{
  "nome_completo": "Nicole-Reine Etable de Labrière Lepaute",
  "nome_curto": "Nicole-Reine Lepaute",
  "ano_nascimento": "1723",
  "ano_morte": "1788",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lepaute/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Saint-Cloud, France",
  "biografia": "Nicole-Reine Etable de Labrière\nwas born in the Palais du Luxembourg in Paris where her father was in the service of the Queen of Spain, Elisabeth d'Orléans. One day the royal clockmaker Jean-Andre Lepaute\n(1709\n-\n1789)\nand his brother arrived at the Palais du Luxembourg to install a new type of clock. Nicole-Reine met Jean-Andre Lepaute on this occasion and their friendship blossomed. The two were married on\n27\nAugust\n1749\nand lived at the Palais du Luxembourg. Nicole-Reine helped her husband in his work, in particular keeping the Lepaute accounts. It is interesting to realise that the couple were living in the Palais du Luxembourg when Louis XV exhibited a selection of the royal collection of paintings in\n1750\n. This exhibition moved to the Louvre to become the basis for the famous art gallery.\nIt was not  long after Nicole-Reine married that\nJérôme Lalande\n, who was at that time a law student, became fascinated by astronomy and was given a room above the porch of the Palais du Luxembourg to use as an observatory.\nLalande\nquickly became a friend of Nicole-Reine and Jean-Andre Lepaute. He was sent to the Cape of Good Hope to make astronomical observations and, returning to Paris in\n1753\nafter a very successful trip, he was elected to the\nAcademy of Sciences\n. Jean-Andre Lepaute had designed a clock with a new type of escapement and\nLalande\nwas asked by the Academy to evaluate it for astronomical use. This prompted Jean-Andre Lepaute to become interested in building astronomical clocks and he published\nTraité d'Horlogerie contenant tout ce qui est nécessaire pour bien connoître et pour régler les pendules et les montres\nⓉ\n(\nTreatise on clock-making  containing all that is necessary to be well acquainted and to set clocks and watches\n)\nin Paris in\n1755\n. This work contains the first mathematical work by Nicole-Reine Lepaute who calculated the tables of oscillations of a pendulum which were contained in her husband's work.\nIn June\n1757\nLalande\ndecided that he would like to attempt to calculate a precise date for the return of\nHalley\n's comet. It was known to have been seen in\n1305\n,\n1380\n,\n1456\n,\n1531\n,\n1607\nand\n1682\nand\nHalley\n, taking into account perturbations to the orbit caused by the gravitational effects of Jupiter, had predicted that the comet would return reaching perihelion in December\n1758\n. However the only way to get a more accurate prediction of its date of return was to calculate the perturbations to the orbit caused by the gravitational effects of both Jupiter and Saturn.\nLalande\napproached\nAlexis Clairaut\nfor help and\nClairaut\nprovided a basic programme of work requiring an extraordinary amount of computation.\nLalande\nthen asked Nicole-Reine Lepaute to assist him in the computations.\nLalande\nwrote in\nBibliographie Astronomique\n(1803)\n(\nsee for example\n[\n6\n]\n)\n:-\nDuring six months we calculated from morning to night, sometimes even at meals. ... The assistance of Mme Lepaute was such that, without her I should never have been able to undertake the enormous labour, in which it was necessary to calculate the distance of each of the two planets Jupiter and Saturn from the comet, separately for each successive degree for\n150\nyears.\nOn\n14\nNovember\n1758\nClairaut\nreported to the\nAcademy of Sciences\nthat they predicted the comet would reach perihelion by mid-April\n1759\n. In fact the team had completed the calculations just in time for, on\n25\nDecember\n1758\n, the comet was sighted. It actually reached perihelion on\n13\nApril\n1759\n, within the margin of error given for the prediction.\nClairaut\npublished\nThéorie des comètes\nⓉ\n(\nTheory of comets\n)\n(\nParis,\n1760)\ndescribing how the calculations had been carried out. He listed those who had assisted in the computations but did not put Nicole-Reine Lepaute's name on the list. It has been claimed that this deliberate omission was to please his girlfriend Mademoiselle Goulier who was jealous of Lepaute. Whatever the reason, the omission caused a rift between\nLalande\nand\nClairaut\n, and the two men never again collaborated on an astronomical project.\nLalande\ngave Nicole-Reine Lepaute the credit she deserved in his own publication; see the quote above.\nIn\n1759\nLalande\nwas asked if he would take over the editorship of the astronomical almanac\nConnaissance des temps\n. He was editor from\n1760\nuntil\n1776\n, and Nicole-Reine Lepaute assisted him in computing the tables in this annual publication of the\nAcademy of Sciences\n. Although her contributions are thought to have been substantial, we do not have any precise details of which part of the work she undertook. There are, however, many areas where we do know of her contributions. The\nEphémérides des mouvements célestes\nⓉ\n(\nAlmanac of celestial movements\n)\ngave tables of the sun, the moon and planets covering a period of ten years. Lepaute was the main person responsible for producing Volume VII, covering the period\n1775\n-\n1784\n, and Volume VIII, covering the period\n1783\n-\n1792\n. Alic writes\n[\n1\n]\n:-\nFor this last volume she alone made all the computations for the positions of the sun, moon and planets.\nAlic also claims in\n[\n1\n]\nthat Lepaute published a memoir containing observations of the transit of Venus across disk of the sun in\n1761\n. This may have been one of the memoirs which\nLalande\nsays that she wrote for the l'Académie de Béziers but these have not been found. Since she was elected a member of l'Académie de Béziers around this time it is likely that this information is correct. The letter confirming her election the this Academy was published in\n[\n4\n]\n. Other specific tasks carried out by Lepaute that are specified by\nLalande\ninclude calculations for elements of the comet observed in\n1762\n.\nAnother piece of work which is certainly due to Lepaute is the calculation concerning the annular eclipse of the sun on\n1\nApril\n1764\n. She produced a chart giving the path of the eclipse across Europe which was published in the Jesuit journal the\nMémoires de Trévoux\nin June\n1762\n. Alic writes\n[\n1\n]\n:-\nHer calculations required that she prepare a table of parallactic angles\n(\nthe angle of displacement of an object caused by a change in the observer's position\n)\n, her extended version of which was published by the French government.\nThousands of copies of Lepaute's chart were distributed in Paris.\nFinally we mention that a crater on the moon has been named in honour of Lepaute."
}