{
  "nome_completo": "Niels Nielsen",
  "nome_curto": "Niels Nielsen",
  "ano_nascimento": "1865",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Nielsen/",
  "lugar_nascimento": "Orslev, Denmark",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Niels Nielsen\n's father was a farmer and the family were quite poor. Perhaps as a consequence of his background, he began his time at high school intending to study practical subjects. He had decided to enter the Polytechnic Institute to begin these studies but while still at school developed a love of pure mathematics so decided that it would be more appropriate for him to study at university.\nNielsen entered the University of Copenhagen in\n1885\nand graduated from there in\n1891\n. In fact he had begun to teach in secondary schools in\n1887\nwhile still working for his degree at the University of Copenhagen and he continued teaching while working for his doctorate which was awarded in\n1895\n. He gave preparatory courses for the Polytechnic Institute beginning in\n1900\nand from\n1903\nuntil\n1906\nhe was on the University Inspectorate for Secondary Schools. Nielsen became a university teacher in\n1905\nand he succeeded\nPetersen\nas professor at Copenhagen in\n1909\n.\nHe wrote on\nspecial functions\n, particularly the\ngamma function\n, building on theory introduced by\nJensen\n. Early papers which he published while still teaching in schools include:\nSur le produit de deux fonctions cylindriques\nⓉ\n(\nOn the product of two cylindrical functions\n)\n(1899)\n;\nSur la développement du zéro en séries de fonctions cylindriques\nⓉ\n(\nOn the development of zero series of cylindrical functions\n)\n(1899)\n;\nRecherches sur les séries de fonctions cylindriques dues à C Neumann et W Kapteyn\nⓉ\n(\nResearch series of cylindrical functions due to C. Neumann and W Kapteyn\n)\n(1901)\n;\nNote sur la convergence d'une série neumannienne de fonctions cylindriques\nⓉ\n(\nNote on the convergence of a series of Neumann's cylindrical functions\n)\n(1901)\n; and\nRecherches sur les séries de factorielles\nⓉ\n(\nResearches on the series of factorials\n)\n(1902)\n.\nIn\n1904\nhe published rather a large number of works including the papers\nSur une intégrale définie; Note sur les séries de fonctions bernoulliennes\nⓉ\n(\nOn a definite integral; Note the series of functions bernoulliennes\n)\n; and\nLes séries de factorielles et les opérations fondamentales\nⓉ\n(\nSeries of factorials and the fundamental operations\n)\n. In the same year he published the widely used text\nHandbuch der Theorie der Zylinderfunktionen\nⓉ\n(\nHandbook of the theory of cylindrical functions\n)\nwhich gave formulas for partial derivatives of\nBessel functions\nwith respect to order at integral values. Two years later he published another widely used text\nHandbuch der Theorie der Gammafunktion\nⓉ\n(\nHandbook of theory of the gamma function\n)\n(\nTeubner, Leipzig,\n1906)\nin which he brought together work which he had completed over the preceeding twenty years. It was the first major work devoted to the study of the gamma function since a treatise by\nLegendre\n. In the same year he published\nTheorie des Integrallogarithmus und verwandter Transzendenten\nⓉ\n(\nTheory of the logarithmic integral and related transcendent functions\n)\n(\nTeubner, Leipzig,\n1906)\n. These two texts were reprinted by the\nChelsea Publishing Company\nof New York in\n1965\n, bound into a single volume.\nIn the couple of years before World War I, Nielsen published papers such as\nRecherches sur le développement d'une fonction analytique en série de fonctions hypergéometriques\nⓉ\n(\nResearch on the development of an analytic function in series of hypergeometric functions\n)\n(1913)\nand\nRecherches sur les résidus quadratiques et sur les quotients de Fermat\nⓉ\n(\nResearch on quadratic residues and Fermat quotients\n)\n(1914)\n. During the war, however, in\n1917\n, he suffered a breakdown from which he never fully recovered. He did, however, continue to produce quality mathematics books. He turned to\nnumber theory\nand studied\nBernoulli numbers\nin\nTraité élémentaire des nombres de Bernoulli\nⓉ\n(\nElementary treatise of the Bernoulli numbers\n)\n(\nGauthier-Villars, Paris,\n1923)\nand\nFermat\n's equation writing good textbooks on these topics. His textbooks, however, contained little original mathematics but they were well written texts with much skill in organising the material.\nHe also wrote two books on the history of Danish mathematics and two books on the history of French mathematics\n[\n1\n]\n:-\n... he occupied himself primarily with accounts of personalities and the historical development of specific problems.\nFor example he wrote the two volume text on Danish mathematics, the first volume covering the years\n1528\nto\n1800\n, and the second volume covering the yeras\n1801\nto\n1908\n. It was published in\n1910\n.\nGéomètres français sous la révolution\nⓉ\n(\nFrench Surveyors in the revolution\n)\n, containing biographies of\n76\nmathematicians was published in\n1929\n(\nand has proved very useful to the authors of this archive\n)\nand\nGéomètres français du dix-huitième siècle\nⓉ\n(\nFrench Surveyors of the eighteenth century\n)\n, containing biographies of\n153\nmathematicians, was published after Nielsen's death.\nOettel writes in\n[\n1\n]\n:-\nHe was a master in the treatment of unmethodical calculations and came up with a multitude of particular points. He playfully conceived new things that were not always in a complete form, and he was a significant influence on his students."
}