{
  "nome_completo": "Oliver Dimon Kellogg",
  "nome_curto": "Oliver Kellogg",
  "ano_nascimento": "1878",
  "ano_morte": "1932",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kellogg/",
  "lugar_nascimento": "Linwood, Pennsylvania, USA",
  "lugar_morte": "Greenville, Maine, USA",
  "biografia": "Oliver Kellogg\n's parents were Sarah Cornelia Hall and Day Otis Kellogg who, at the time of Oliver's birth, was an Episcopal priest. However Oliver's father was also an academic and he later left the priesthood to take up a professorship of English literature at the University of Kansas. Day Otis Kellogg was also important as the American editor of\nEncyclopaedia Britannica\n. Oliver studied as an undergraduate at Princeton University, entering in\n1895\n. There he attended lectures by\nFine\nwho fired his interest in mathematics. After receiving his A.B. in\n1899\n, Kellogg continued his studies for a Master's Degree at Princeton. He was awarded the Master's Degree in\n1900\nand received a John S Kennedy Fellowship to allow him to study in Europe.\nKellogg spent the year\n1900\n-\n01\nat the University of Berlin, then moved to Göttingen where he spent\n1901\n-\n02\nworking for his doctorate. He attended lectures by\nHilbert\nwho suggested he undertake research on the\nDirichlet\nproblem for plane regions bounded by a finite number of plane curves which met at points where the boundary was not differentiable.\nFredholm\nhad just published a major work on the\nDirichlet\nproblem but\nFredholm\n's methods did not apply to the regions which\nHilbert\nsuggested Kellogg investigate.\nIn\n1902\nKellogg published his first paper giving a direct proof of\nFredholm\n's inversion formula. In January of the following year he received his doctorate for his dissertation\nZur Theorie der Integralgleichungen und des Dirichlet'schen Prinzips\non the\nDirichlet\nproblem but he remained in Germany to the end of the academic year, returning to the United States to take up the post of instructor in mathematics at Princeton. During these years he published two further papers which developed from the work of his thesis.\nHowever Kellogg soon became less than happy with these papers. Partly he had failed to answer the questions\nHilbert\nhad asked him to solve though this was understandable since they were much harder than\nHilbert\nhad realised. Secondly some of Kellogg's results were incomplete and others were incorrect. Again it is hard to criticise him too much over this since very similar errors were later made by both\nHilbert\nand\nPoincaré\n.\nKellogg was appointed to the University of Missouri in\n1905\nwhere, despite a heavy teaching and administrative load he was able to publish impressive papers on\npotential theory\n. In\n1908\nhe published three papers, namely\nPotential functions on the boundary of their regions of definition\nand\nDouble distributions and the Dirichlet problem\n, both in the\nTransactions of the American Mathematical Society\n, and\nA necessary condition that all the roots of an algebraic equation be real\nin the\nAnnals of Mathematics\n.  In\n1912\nhe published the important work\nHarmonic functions and Green's integral\nin the\nTransactions of the American Mathematical Society\n. This paper includes what today is called 'Kellogg's theorem' on harmonic and\nGreen\n's functions. He was promoted to professor at the University of Missouri in\n1910\nand, in the following year, he married Edith Taylor; they had one daughter.\nAlthough he would return to potential theory, Kellogg next published a number of papers on sets of real orthogonal functions. However his work was disrupted by World War I when he was assigned as scientific advisor to the United States Coast Guard Academy at New London, Connecticut. There he worked on mathematical problems which arose in the design of devices to detect submarines. At the end of the war he was appointed to Harvard University to replace\nMaxime Bôcher\nwho died in September\n1918\n. His first appointment to Harvard was as a lecturer but in\n1920\n, the year following his appointment, he was promoted to associate professor, then to full professor in\n1927\n.\nKellogg published the paper Invariant points in function space  jointly with\nG D Birkhoff\nin\n1922\n. This contains the\nBirkhoff\n-Kellogg Theorem which generalises the\nBrouwer\nfixed point theorem. Kellogg published the classic text\nFoundations of potential theory\nin\n1929\n(\nit was reprinted in\n1967)\n. Zund writes:-\nAccessible to both advanced undergraduates and beginning graduate students, it was noteworthy for its rigour and felicitous style. While not specifically mentioned, many of the proofs in the volume - even of well-known results - are original and due to Kellogg himself. This volume also includes the first statement of the celebrated Kellogg-Evans Lemma\n(\nproven in generality by\nGriffith C Evans\nin\n1933)\n.\nIn addition to his work on potential theory and orthogonal set of functions he published a short paper on the problem of the maximum value\na\nn\na_{n}\na\nn\n​\nof a positive integer belonging to a set of\nn\nn\nn\npositive integers whose reciprocals add to\n1\n. In fact the answer is given by\na\nn\n+\n1\n=\na\nn\n(\na\nn\n+\n1\n)\na_{n+1} = a_{n}(a_{n} + 1)\na\nn\n+\n1\n​\n=\na\nn\n​\n(\na\nn\n​\n+\n1\n)\nwhere\na\n1\n=\n1\na_{1} = 1\na\n1\n​\n=\n1\n.\nKellogg also wrote a number of papers on the existence of certain sets of functions in analysis as well as generalisations of polynomials due to\nSergei Bernstein\n.\nHe wrote a number of articles on the teaching of mechanics, and published a textbook, written jointly with\nHedrick\n,\nApplications of the calculus to mechanics\n(1909)\n. He published\nSome properties of spherical curves, with applications to the gyroscope\nin  the\nTransactions of the American Mathematical Society\nin\n1923\n.\nKellogg continued to work at Harvard until his death which resulted from a heart attack which he suffered while climbing near Greenville, Maine.\nBirkhoff\nwrites in\n[\n1\n]\n:-\nHis quick, generous nature and unusual charm of personality were united with a versatile and original mind. The full story of Kellogg's many successful efforts to help others would be an extraordinary one ... in order to judge his mathematical achievements, it is necessary not only to consider his published work but to take into account his modesty and his readiness to share his nascent ideas with others.\nAt the time of his death he was working on an advanced volume to supplement\nFoundations of potential theory\n.  After his death\nConverses of Gauss' theorem on the arithmetic mean\nwas published in the\nTransactions of the American Mathematical Society\n."
}