{
  "nome_completo": "Ludwig Otto Hölder",
  "nome_curto": "Otto Hölder",
  "ano_nascimento": "1859",
  "ano_morte": "1937",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Holder/",
  "lugar_nascimento": "Stuttgart, Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Otto Hölder\nworked on the convergence of\nFourier series\nand in\n1884\nhe discovered the inequality now named after him. He became interested in\ngroup theory\nthrough\nKronecker\nand\nKlein\nand proved the uniqueness of the\nfactor groups\nin a composition series. His father was Otto Hölder\n(1811\n-\n1890)\n, professor of French at the Polytechnikum in Stuttgart, the son of Christian Gottlieb Hölder\n(1776\n-\n1847)\n, who was a professor at the\nGymnasium\nin Stuttgart, and Friederike Karoline Gaupp\n(1784\n-\n1813)\n. The mother of Otto, the subject of this biography, was Pauline Christiane Ströbel\n(1821\n-\n1894)\n, the daughter of August Friedrich Ströbel and Friederika Christiane Moser. Otto and Pauline were married on\n17\nMay\n1845\nin Stuttgart. They had three sons: Alfred, born\n2\nJanuary\n1846\n, Eduard Otto, born\n27\nNovember\n1847\nand Ludwig Otto, the subject of this biography, who was born on\n22\nDecember\n1859\nand baptised on\n2\nFebruary\n1860\n. In\n1864\nthe family were living at\n18\nHermannstrasse, Stuttgart. All three sons became professors. Eduard Otto Hölder studied law in Tübingen and became a professor of law at several different universities.\nOtto Hölder studied at a Gymnasium in Stuttgart, in fact at one of the earliest Gymnasiums specialising in science, graduating in\n1876\n. He then entered the polytechnic in Stuttgart to study engineering but found himself more attracted to mathematics than to engineering. One of his father's colleagues suggested that Stuttgart Polytechnikum was not the best place to study mathematics and that Hölder would be better to go to the University of Berlin which had one of the top mathematics schools in the world. In\n1877\nhe entered the University of Berlin and began to study mathematics there. He was a fellow student of\nCarl Runge\nand he attended lectures by\nKarl Weierstrass\n,\nLeopold Kronecker\nand\nEduard Kummer\n. In his first year of study he attended\nWeierstrass\n's lectures on the theory of functions which covered the fundamentals of analysis.\nWeierstrass\nmade a marked impression of the young Hölder and his influence showed on Hölder throughout his career.\nRunge\n[\n9\n]\n:-\n... recalled much later that\nWeierstrass\n's lectures left a deep and lasting impression\n[\non Hölder\n]\n, even though they were not polished and well constructed.\nWeierstrass\nwould sometimes get in a muddle improvising a proof, only to put it right imperturbably next time. But\nWeierstrass\nwas a sympathetic tutor, who listened attentively to his students and really responded to the question ...\nHölder's interest in algebra came partly through the influence of\nKronecker\nat this time and\nKronecker\n's liking for rigour almost certainly was to have a profound influence on Hölder's later work in algebra. When asked a question,\nKronecker\n[\n9\n]\n:-\n... could not be made to listen but always changed the subject straight away to talk about his own work. On the other hand,\nKronecker\nwas a far more approachable person, and many young people would be invited to his hospitable home.\nAfter studying in Berlin, Hölder went to the Eberhard-Karls University of Tübingen where he was advised by\nPaul du Bois-Reymond\n. He presented his dissertation,\nBeiträge zur Potentialtheorie\nⓉ\n(\nContributions to potential theory\n)\n, which investigates analytic functions and summation procedures by arithmetic means, to the University of Tübingen in\n1882\n. These summation procedures are now the known as the \"Hölder summation method\". His dissertation also contains the continuity condition for volume density which now is known as the \"Hölder condition\" on a function. After the award of his doctorate, Hölder went to Leipzig.\nFelix Klein\nwas there at the time but there seems to have been little interaction between the two during the two years that he was there. Hölder at this time was still interested in function theory, although\nKlein\nhad a strong influence on Hölder later in his career. He was denied the opportunity to\nhabilitate\nat Leipzig so he moved to Göttingen.\nStrangely, Göttingen did not recognise Hölder's Tübingen doctorate so, in\n1884\n, he submitted a thesis for a second doctorate at Göttingen and, in the same year, habilitated at the University of Göttingen. His habilitation thesis examined the convergence of the\nFourier\nseries of a function that was not assumed to be either continuous or bounded. At first at Göttingen he continued to work on the convergence of\nFourier\nseries. Shortly after be started working at Göttingen he discovered the inequality now named after him which appeared in his paper\nÜber einen Mittelwerthsatz\nⓉ\n(\nOn a mean value theorem\n)\n(1889)\n. It appears that Hölder became interested in group theory while at Göttingen, partly through discussions with\nWalther von Dyck\nand partly through\nFelix Klein\nwho was lecturing on\nGalois theory\n. The university faculty at Göttingen wanted to offer Hölder an assistant lectureship but such appointments could only be made by the Prussian Ministry of Culture and, despite repeated requests, they felt that he did not have sufficient lecturing experience for such a post. Hölder was offered a post in Tübingen in May\n1889\nbut unfortunately he suffered a mental collapse. Receiving treatment in a clinic in Erlangen, he was in no position to reply to Tübingen's offer so his brother Eduard, who was by this time a professor of law at Tübingen, accepted the offer on behalf of his brother. The faculty at Tübingen were unsure how to proceed when they learnt that Hölder was ill and in a clinic but, after much discussion, they kept their confidence in Hölder. He made a steady recovery, giving his inaugural lecture in June\n1890\n.\nKlein\n's lectures on\nGalois\ntheory at Göttingen had interested Hölder who began to study the\nGalois\ntheory of equations and from there he was led to study composition series of groups. Hölder proved the uniqueness of the factor groups in a composition series, the theorem now called the\nJordan\n-Hölder theorem, and published the result in\nMathematische Annalen\nin\n1889\nin the paper\nZurückführung einer beliebigen algebraischen Gleichung auf eine Kette von Gleichungen\nⓉ\n(\nRecycle any algebraic equation in a chain of equations\n)\n. Although Hölder did not consider that he invented the notion of a factor group, the concept appears clearly for the first time this paper of Hölder's. He clarified the concept which he claimed was neither new nor difficult but was not sufficiently appreciated\n[\n13\n]\n:-\nDieudonné\ncommented on the\nJordan\n-Hölder Theorem that it would assume its definitive form only with Hölder. This could also be said of the concept of quotient group: in both cases\nJordan\n's ideas were early formulations which later gave way to the accepted 'standard' forms.\nWith the help of group theory and\nGalois\ntheory methods Hölder returned to a study of the irreducible case of the\ncubic\nin the\nCardan\n-\nTartaglia\nformula in\n1891\n. We have made minor corrections to the following quote from\n[\n9\n]\n:-\nHölder was one of the first to give a rigorous account of the famous classical case where a splitting field is not a radical extension: the irreducible cubic equation over the rationals with three real roots, where it is nonetheless necessary to adjoin complex roots of unity. Hölder's proof of this result, which had long been suspect, was accompanied by three accounts by other people which appeared around the same time and were summarised in the second volume of\nNetto\n's book 'Vorlesungen über Algebra'\nⓉ\n(\nLectures on algebra\n)\n(1900)\n.\nHölder made many other contributions to group theory. He searched for finite\nsimple groups\nand in the\n1892\npaper\nDie einfachen Gruppen im ersten und zweiten Hundert der Ordnungszahlen\nⓉ\n(\nThe simple groups in the first and second hundred of the ordinal numbers\n)\nin\nMathematische Annalen\nhe showed that all simple groups up to order\n200\nare already known. His methods use the\nSylow\ntheorems in a similar way to how the problem would be solved today. Hölder also studied groups of orders\np\n3\n,\np\nq\n2\n,\np\nq\nr\np^{3}, pq^{2}, pqr\np\n3\n,\np\nq\n2\n,\np\nq\nr\nand\np\n4\np^{4}\np\n4\nfor\np\n,\nq\n,\nr\np, q, r\np\n,\nq\n,\nr\nprimes, publishing his results in\n1893\n. His proofs again heavily rely on the use of\nSylow\ntheorems.\nConcepts which were introduced by Hölder include inner and outer automorphisms. In\n1895\nhe wrote a long paper on extensions of groups. Often\nOtto Schreier\nis said to be the one to have initiated the study of extensions of groups but Julia Nicholson writes\n[\n2\n]\n:-\nSchreier\n's approach to and development of the theory of extensions seems to follow on directly from that of Otto Hölder: much of Hölder's methodology was borrowed by\nSchreier\n. The difference between their work is that\nSchreier\ndrew out each idea to its logical conclusion, whereas Hölder had been motivated initially by the wish to classify particular sorts of groups and therefore developed the theory with this fixed aim in mind.\nIn\n[\n22\n]\nvan der Waerden\nwrites:-\n... reading Hölder's papers again and again is a profound intellectual treat.\nIn\n1889\nHölder was appointed as an Extraordinary Professor of Mathematics at the University of Tübingen. He left Tübingen in\n1896\nwhen he was appointed as a full professorship at the University of Königsberg. In\n1899\nHölder married Helene\n(1871\n-\n1927)\n, the daughter of the attorney, bank director, and politician Karl Ernst Lautenschlager\n(1828\n-\n1895)\nand his wife Sophie Wilhelmina Faber\n(1831\n-\n1902)\n. Helene and Otto Hölder had four children: Ernst Otto\n(\nborn\n1901)\n, Charlotte Sophie\n(\nborn\n1902)\n, Irmgard Luise\n(\nborn\n1904)\n, and Wolfgang Carl\n(\nborn\n1906)\n. Ernst Hölder became a mathematician working mainly in the field of mathematical physics. He was awarded a doctorate by the University of Leipzig in\n1926\nfor his thesis\nGleichgewichtsfiguren rotierender Flüssigkeiten mit Oberflächenspannung\nⓉ\n(\nEquilibrium figures of rotating fluids with surface tension\n)\n. His thesis advisor was\nLeon Lichtenstein\n. In\n1899\n, the same year that he married, Hölder was appointed as an Ordinary Professor of Mathematics at the University of Leipzig, succeeding to the chair that had been occupied by\nSophus Lie\n. He was Dean of the Faculty of Arts of the University of Leipzig in\n1912\n-\n13\nand Rector of the University of Leipzig in\n1918\n. Although he remained at Leipzig, he did apply for the chair in Berlin in\n1902\n.\nDavid Hilbert\nwas ranked first,\nFriedrich Schottky\nwas ranked second and Hölder was ranked third.\nSchottky\nwas appointed to the chair.\nFrom\n1900\nHölder became interested in the geometry of the projective line and philosophical questions, which had interested him throughout his career, began to play a prominent role. Let us now look at some of these works. Perhaps we should begin by looking at the paper by Hölder, published in\n1892\n, in which he gives his reaction to Robert Grassmann's\nDie Zahlenlehre oder Arithmetik - streng wissenschaftlich in strenger Formelentwicklung\nⓉ\n(\nThe theory of numbers or arithmetic - strictly scientific in strict formula development\n)\n(1891)\n. Mircea Radu writes\n[\n16\n]\n:-:-\nHölder's paper is important for at least three reasons: First, it represents what might be called Hölder's research manifesto on the foundations of mathematics, containing a wealth of ideas which Hölder gradually developed in a variety of publications until the end of his life. Second, Hölder's analysis of Robert Grassmann's foundational ideas provides an important assessment of the contribution of Hermann and Robert Grassmann to the axiomatisation of arithmetic, a contribution which, though often mentioned, is itself still not widely acknowledged and not fully understood. Third, the effort of exposing the weak spots in Robert Grassmann's ideas led Hölder to formulate the main problems confronting formal axiomatics: independence of the axioms, consistency, completeness, and the issue of the relationship between pure mathematics and its applications.\nWhen Hölder was appointed to the chair in Leipzig in\n1899\n, he delivered the inaugural lecture 'Anschauung und Denken in der Geometrie' which was published in\n1900\n. This work presents a proof that the Archimedean axiom can be derived from\nDedekind\n's notion of continuity. The review\n[\n14\n]\nstates:-\nA thorough study of the methods of ratiocination employed in mathematics, mechanics, and the exact natural sciences has led Professor Hölder to the conviction that the deductive method there employed is made up of series of concatenated conclusions of quite characteristic form, and that consequently these sciences have a peculiar method and logic of their own. Not that the reasoning in these sciences is absolutely different from the reasoning in other departments of thought and life ; the peculiarity in question resides entirely in the nature of the subject-matter and in the style of the combinations of the intellectual acts concerned. A correct philosophy of mathematical procedure is to be reached, in Professor Holder's opinion, only by the cooperation of mathematicians and philosophers, and not, as has been heretofore the case, by isolated and one-sided labours in this do main. The review which he himself gives of the modes of thought concerned is a very good one, and taken together with the exhaustive notes which he has suffixed to his discussion, will be found to be of assistance to students.\nThis inaugural lecture was the starting point for Hölder's axiomatic theory of quantity which he published as\nDie Axiome der Quantität und die Lehre vom Mass\nⓉ\n(\nThe axioms of quantity and the doctrine of mass\n)\nin\n1901\n. Joel Michell writes\n[\n12\n]\n:-\nHis paper is a watershed in measurement theory, dividing the classical\n(\nstretching from\nEuclid\n)\nand the modern\n(\nstretching to Luce et al .,\n1990)\neras. His concerns belonged, in part, to the classical era. He axiomatised the classical concept of quantity\n(\nusing\nDedekind\n's concept of continuity\n)\nin such a way that ratios of magnitudes\n(\nas understood in Book V of\nEuclid\n's 'Elements'\n)\ncould be expressed as positive real numbers\n(\nas intimated by\nNewton\n)\n. Importantly, he achieved this result with a clarity that was not attained by others also working within the classical framework\n(\ne.g.,\nHelmholtz\n,\n1878\n;\nFrege\n,\n1903\n; and\nWhitehead\nand\nRussell\n,\n1913)\n. However, other of his concerns were more modern. In Part II of his paper, he showed that axioms for an apparently nonadditive structure, stretches of a straight line, entail that linear distances satisfy the axioms for quantity given in Part I. His concern to relate nonadditive structures to quantitative ones anticipates a distinctly modern interest ...\nThe highlight of his philosophical writings is the book\nDie Mathematische Methode\nⓉ\n(\nMathematical method\n)\n(1924)\n. H R Smart writes\n[\n21\n]\n:-\nThe first prerequisites to the writing of such a book as this are a vast amount of courage, resolution and patience. The author has undertaken a task which requires, furthermore, for its even tolerably successful accomplishment, the possession, at his very finger-tips, of an equally vast store of learning. Finally, and above all, there is required an unusual ability in order to realize the goal which Dr Hölder has set before himself, namely to bring to self-conscious expression the logic of mathematical inference. For it is probably just as true of scientists as of poets that they are usually quite unable to give a coherent account of the 'method in their madness.' As Professor Holder himself points out, the great mathematicians have seldom been able to tell how, in the first instance, they really attained their epoch-making results. ... Dr Hölder\n(\nwho is professor of mathematics at Leipzig\n)\ndesires his work to be regarded as primarily a contribution to the logic of mathematics, and modestly leaves to other logicians the problem of incorporating his findings in more comprehensive treatises.\nH Wieleitner\n[\n23\n]\nwrites that the book:-\n... is an extensive, well organized, clearly written work, and is a very valuable reference book for all mathematical and philosophical questions, particularly in regard to the applications..\nLet us end this biography by quoting from\nvan der Waerden\n's obituary of Hölder\n[\n22\n]\n:-\nA truly great scientist has left us, one of those men who, at the turn of the century, pointed the way for modern mathematics: from the formal to the critical, from computation to concept. His efforts were directed incessantly toward logical accuracy in thinking and expression."
}