{
  "nome_completo": "Otto Yulyevich Schmidt",
  "nome_curto": "Otto Yulyevich Schmidt",
  "ano_nascimento": "1891",
  "ano_morte": "1956",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmidt_Otto/",
  "lugar_nascimento": "Mogilev, Russian Empire, now Belarus",
  "lugar_morte": "Zvenigorod, near Moscow, Russia",
  "biografia": "Otto Yulyevich Schmidt\n's name is often transliterated as Shmidt. Of course, Schmidt sounds like a German name and this is precisely where Otto Schmidt's ancestors on his father's side came from. They had moved to Courland, a region on the Baltic coast which had become part of the Russian Empire at the very end of the\n18\nth\ncentury. The region became part of Latvia in\n1918\n. Otto's father, Julius Fridrihovich Schmidt, tried to make a living trading goods. Otto's mother, Anna Fridrihovna Ergli, was from a farming family in Courland; in fact she met Julius since she was a near neighbour. One might wonder, given this background, what language was spoken in the home. Amazingly three languages were spoken, Russian, Latvian and German. It was a large family with Otto being one of five children.\nThe family moved around as Otto was growing up, trying to improve their fortunes and find a better life, but Otto was given a good educations at schools in Mogilev, Odessa and Kiev. The fact that the boy \"showed uncommon curiosity and a desire for knowledge\" had encouraged his family to give him a good academic education rather than have him learn a trade. Given the poor financial position of the family, this entailed a considerable sacrifice. It was in\n1900\nthat he began his education in Mogilev, going straight into the second grade of the\nGymnasium\n, but the family soon moved to Odessa where he continued his schooling at the Gymnasium in\n1901\n. His passion for learning is illustrated by the fact that he approached the headmaster of the school in Odessa wanting to learn ancient Greek\n(\nhe was already fluent in Latin\n)\n. Although nobody else in the school was interested in studying Greek, the headmaster found a teacher to teach Schmidt in a class of one.  Another move saw the family go to Kiev in\n1907\nand Schmidt, as he had done throughout his school years, continued with self-study outside the classroom, in particular reading classic books, studying foreign languages, and higher mathematics. He graduated from Classical Gymnasium No\n2\nin Kiev in\n1909\nwith the Gold Medal and, in the same year, entered the Physics and Mathematics Faculty of Kiev University.\nAt university, Schmidt continued to work long hours as he had during his school years, often spending the whole night studying. He was taught by some outstanding mathematicians such as\nD A Grave\n,\nB Ya Bukreev\n,\nG Y Pfeiffer\n, G K Suslov and V P Voronets. His progress was outstanding and, in his second year of study,\nDmitry Aleksandrovich Grave\nbegan to encourage him to undertake research.\nGrave\nhad founded the Kiev school of algebra and, at the time Schmidt studied there, Kiev was the leading centre for algebra. Schmidt's progress was so marked that, while still an undergraduate, he published three excellent papers on group theory in\n1912\n-\n13\nincluding\nÜber die Zerlegung endlicher Gruppen in direkte unzerlegbare Faktoren\nⓉ\n(\nOn the decomposition of finite groups into direct irreducible factors\n)\n(1912)\nand\nSur les produits directs\nⓉ\n(\nOn direct products\n)\n(1913)\n. The first of these papers earned him a gold medal. They contain what today is called the\nKrull\n-Schmidt theorem\n(\nor sometimes the\nRemak\n-\nKrull\n-Schmidt theorem\n)\n. This is around fourteen years before\nKrull\n's version of the theorem but Schmidt's version was published in January\n1912\n, only months after\nRemak\n's version which is contained in his\n1911\ndoctoral thesis. The\n1913\npaper whose title is given above contains a new shorter proof.\nHe married Vera Yanitskaia and graduated from Kiev University in\n1913\n. Following\nGrave\n's recommendation, he continued to study at Kiev for his Master's degree which he was awarded in\n1916\n. In the same year, he published the monograph\nThe abstract theory of groups\nwhich was the first group theory book to include results on both finite and infinite groups. There are many original results in the book, particularly in the area of what Schmidt called special groups\n(\nspecial groups are groups\nG\nG\nG\nsuch that every proper subgroup\nH\nH\nH\nof\nG\nG\nG\nhas a normaliser different from\nH\nH\nH\n)\n. For this remarkable publication, Schmidt was awarded the Rakhmaninov Gold Medal. A second edition of the book was published in Russian in\n1933\nand an English translation of this second edition was published in\n1966\n. Following the award of his Master's degree, he was appointed as a\nprivatdocent\nat the University of Kiev and began his teaching career. The events of the Russian revolution of\n1917\n, however, completely changed the direction of his career.\nThe events of World War I had already had severe consequences for Ukraine and Kiev in particular. Russia had won victories against Austro-Hungary in late\n1914\nbut in the spring of\n1915\nAustro-Hungary had recaptured parts of Ukraine leading to an evacuation of Kiev University to Saratov. Schmidt had, like other members of the university, lived in Saratov during\n1915\n-\n16\nand it was only after the university returned to Kiev that he began his career as a university teacher. However, even at this early stage in his career he was undertaking leading administrative roles both in education and in running the city. He had been elected to chair the Society for Higher Education Teachers of Kiev and by early\n1917\nwas also helping organise food distribution for the city of Kiev. In June\n1917\nhe went to Petrograd\n(\nas St Petersburg was called at that time\n)\nto attend the All-Russian Congress on Higher Education. There had already been riots in Petrograd in March\n1917\nbecause of severe food shortages and, as a result, the Tsar was forced to abdicate and a Provisional Government set up. On\n14\nJuly Schmidt was appointed as a clerk in the Ministry of Food but remained on the staff of Kiev University.\nIn October\n1917\nthe Bolsheviks staged a coup. The Ministry of Food was disbanded and the People's Commissariat for Food was set up. Schmidt was appointed as head of one of the divisions. In March of the following year operations were moved from Petrograd to Moscow and Schmidt relocated to Moscow where his first son Vladimir Ottovich was born in March\n1920\n. In the early\n1920\ns, he took on further roles such as in the People's Commissariat for Education. He produced several reports on the restructuring of education, including:\nThe importance of vocational education\n;\nProblems of professional education\n;\nOn higher education\n; and\nThe reform of the school system\n. His article\nMathematical laws of currency issue\n(1923)\naddressed the question of the money supply, an important problem for the Soviet government at the time. However, in addition to these roles, Schmidt began to teach in secondary schools in\n1920\nand, in the same year, he was appointed as a lecturer at the Forestry Institute. In\n1923\nhe became a Professor of Mathematics at Moscow State University where he became Head of the Department of Algebra and set up an active school of group theory.\nIn\n1921\nSchmidt was appointed as director of the State Publishing House and under his leadership publishing of scientific journals and research monographs restarted. It was in this capacity that he planned to undertake a huge task of producing a major Russian reference work. In April\n1924\nhe was appointed as editor-in-chief of the Great Soviet Encyclopaedia. This was a very large undertaking and, as well as enlisting numerous scientists and experts in the arts to write articles, Schmidt himself authored many articles over a period of many years.\nAs a child Schmidt had suffered from tuberculosis and, although he had made a good recovery, the illness recurred periodically. In\n1924\nhe went to the Austrian Tyrol where he received treatment part of which involved climbing mountains. This experience led him to became a keen mountaineer and, in\n1928\n, he headed a joint Soviet-German expedition which explored the glaciers of the Pamirs, the highland region of Central Asia. The expedition explored the region of the Fedchenko Glacier, making possible the first accurate topographical maps of the north-western Pamirs. Despite his numerous tasks and his health problems he was still able to produce mathematical papers of considerable importance. In\n1924\nhe published\nGroups all of whose proper subgroups are special\n. We have already noted that Schmidt used the term 'special group' and given a definition above. In this paper he classified finite non-nilpotent groups all of whose proper subgroups are nilpotent. In the summer of\n1927\nhe went to Germany on a research visit and delivered an important paper on infinite groups with chain conditions to the\nGöttingen Mathematical Society\n. This was published in\nMathematische Zeitschrift\nas\nÜber unendliche Gruppen mit endlicher Kette\nⓉ\n(\nOn infinite groups with a finite chain\n)\n(1929)\n.\nIt is rather remarkable that we still have not reached the events of Schmidt's life for which he is best known today, namely his work as a scientist and explorer of the Russian and Siberian Arctic. In\n1928\nhe was put in charge of the icebreaker\nSedov\non a scientific expedition to Franz Josef Land, an archipelago of\n191\nislands in the northeastern Barents Sea. Many of the islands had been discovered by an Austro-Hungarian expedition in\n1873\n(\nand named after the Austrian emperor\n)\nbut annexed by the Soviet Union in\n1926\n. Clearly the Soviet Union was keen to establish a permanent presence in their newly annexed land but there was a reason why Schmidt was a good choice as far as the Soviet leadership was concerned. He had shown himself a strong supporter of the Russian revolution of\n1917\nand had joined the Bolsheviks in the following year. However, he was unhappy with the direction that Stalin took the Soviet Union after the death of Lenin in\n1924\n. In\n1928\nStalin brought in economic policies which fitted his political philosophy but caused widespread famine. In many ways it is remarkable that Schmidt, who opposed Stalin's approach, survived at all - most of Stalin's opponents were eliminated. Perhaps Stalin did not expect him to return from Franz Josef Land, but anyway he was out of the way as far as the leadership was concerned.\nThe\n1928\nexpedition established the Polar Geophysical Observatory in Franz Josef Land and returned safely. Two years later Schmidt headed a second expedition to the same destination, again on the icebreaker\nSedov\n, going beyond Franz Josef Land towards the Severnaya Zemlya. An island they discovered on this expedition was named Ostrov Shmidta, after their leader Schmidt. In\n1932\nhe was appointed as head of the Central Administration of the Northern Sea Route which had been set up to develop the northeastern passage, a sea route along the north coast linking European Russia with Siberia.\nIn command of an expedition, Schmidt sailed on the ice-breaker\nSibiryakov\n(\noriginally the Newfoundland sealing steamer\nBellaventure\n)\nsetting out from Murmansk in\n1932\nin an attempt to navigate the northeastern passage from west to east. The Sibiryakov rounded the northern tip of Severnaya Zemlya, called at Tiksi and the mouth of the Kolyma, but lost its propeller in the ice it encountered before reaching the Bering Strait. It continued under sail through the Strait and reached Vladivostok. The following year Schmidt commanded a second expedition on the ice-breaker\nChelyuskin\nintending to make the voyage from west to east and then return along the same route. They sailed on\n12\nJuly\n1933\nwith over one hundred people, including women and children, on board. Having almost reached the Bering Strait from the west, it became stuck in ice which eventually crushed the vessel which then sank in the Chukchi Sea. Most of the members of the expedition had managed to abandon the ship and set up a camp on the ice. They constructed a landing strip and were eventually rescued by a number of airplanes. Schmidt became a national hero. Many newspaper articles described his exploits, radio programs featured him as did the newsreels:-\nGirls hung portraits of him cut from magazines in their rooms.\nIn May\n1937\nSchmidt set off on another expedition, this time by aircraft from one of the Franz Josef Land islands. The airplane landed on the ice within\n13\nmiles of the North Pole where he set up a research station \"North Pole\n1\n\". Other airplanes flew out further men and supplies after which Schmidt returned to Franz Josef Land and then to Moscow. On\n27\nJune\n1937\n, at Tushino airfield\n15\nkm west of Moscow where his plane landed, he was met by Stalin and members of the Politburo who honoured him with the title Hero of the Soviet Union and the Order of Lenin. He was then further honoured by being taken to a banquet in the Kremlin and later, a special medal \"Gold Star\" was established to award him a further distinction. However, later in\n1937\nthe ice on which the research station North Pole\n1\nwas set up drifted towards Greenland and, in February\n1938\n, Schmidt mounted a successful rescue mission on an ice-breaker to bring back the scientists. Schmidt had been elected a corresponding member of the\nUSSR Academy of Sciences\non\n1\nFebruary\n1933\nand a full member on\n1\nJune\n1935\n. He urged the Academy to found an Institute of Theoretical Geophysics which happened in\n1938\n. Schmidt became director of the Institute on its foundation, a role he held for the following ten years. On\n28\nFebruary\n1939\nhe was elected vice-president of the\nUSSR Academy of Sciences\n, a position he held until\n24\nMarch\n1942\n. In this capacity he was responsible for the evacuation and reestablishment of academic institutions forced on the Soviet Union because of the German invasion during World War II. He was, however, removed from his role in the\nUSSR Academy of Sciences\nby Joseph Stalin and shortly afterwards he was removed from the editorship of the Great Soviet Encyclopaedia.\nIn\n1944\nSchmidt proposed his hypotheses of the origin of the solar system. This theory he published in his\n1949\nbook\nFour lectures on the theory of the origin of the Earth\n. His theory was that at some point the sun passed through a cloud of dust and gas which was captured by its gravitational attraction. The cloud was rotating and it contracted under gravity becoming more dense. Dust particles coalesced to form larger bodies whose gravitational attraction caused further material to be swept up forming larger bodies. One of the main differences of this theory from those which had been proposed earlier was that the planets formed as cold solid bodies rather than in a hot molten state. The warming of the Earth, he suggested, was due to radioactive decay of elements in its core which, as a consequence, released large amounts of gas and water vapour which condensed to form the oceans. He also published papers on astronomical problems such as\nThe theory of capture and statistical laws of the distribution of the orbits of double stars\n(\nRussian\n)\n(1948)\nand\nThe problem of capture in the three body problem\n(\nRussian\n)\n(1948)\n.\nWe must not give the impression that Schmidt gave up group theory for nothing could be further from the truth. For example,\nA G Kurosh\nhad been influenced to become a group theorist through reading Schmidt's papers and attending a group theory course he gave at Moscow State University in\n1930\n. Examples of group theory papers that Schmidt wrote towards the end of his career include:\nÜber die Frobenius-Gruppen\nⓉ\n(\nOn the Frobenius groups\n)\n(1940)\n,\nGroups with two classes of non-invariant subgroups\n(\nRussian\n)\n(1940)\n,\nOn infinite special groups\n(\nRussian\n)\n(1940)\n, and\nInfinite soluble groups\n(\nRussian\n)\n(1945)\n. While mentioning his work in group theory, we should mention the \"Schmidt problem\" - see for example\n[\n8\n]\n. This asks which infinite groups have no infinite proper subgroups. Szélpál showed in\n1949\nthat\nPrüfer\n's quasi-cyclic groups are the only abelian groups with this property. Many other results were obtained over the following years showing that the quasi-cyclic groups are the only examples when weaker conditions than abelian are imposed.\nKostrikin\n[\n20\n]\ndiscusses subsequent work including the examples by A Yu Ol'shanskii published in\n1982\n:-\nFor every sufficiently large prime p there exists an infinite group G such that every proper subgroup of G has order p.\nBy the time that Schmidt proposed his theory of the origin of the solar system his health had begun to seriously deteriorate. The tuberculosis which had periodically affected him from childhood had spread to his throat as well as his lungs. He found speaking increasingly difficult and spent much time in a sanatorium near Moscow, and one in Yalta. At times the condition eased and he was able to lecture in Moscow and Leningrad. He continued to work, even when confined to bed, and in\n1951\nhe founded the Geophysical Department at Moscow State University and was appointed its head. In\n1953\nhe was still able to lecture at the opening of a new building at Moscow State University but he had to spend increasing amounts of time in bed in Zvenigorod, near Moscow. During the last three months of his life he knew that he had little time left. He said:-\nI am thankful for the life I was given. There were many good and many interesting things! I'm not afraid to die.\nWe have mentioned above many of the honours awarded to Schmidt. He was awarded three Orders of Lenin, two Orders of Red Banner, an Order of Red Star and several medals. However, we should indicate just how great his hero status became by listing further ways in which his memory has been preserved. Various geographical features have been named after him: an Island in the Kara Sea, the peninsula in the northern part of Novaya Zemlya, a cape on the coast of the Chukchi Sea, one of the peaks and a pass in the Pamir Mountains. Also named for him is the Institute of Earth Physics of the USSR, the Museum of Arctic Exploration, and a Gymnasium. There are streets in Archangel, Kiev, and Lipetsk named for him as well as an urban avenue in Mogilev. The first Soviet scientific icebreaker was launched in\n1979\nand named\nOtto Schmidt\n. In\n1995\nthe Schmidt Medal was established for outstanding scientific work in research and development of the Arctic. A minor planet\n(\nNo\n2108)\nhas been named after him, as has a crater on the moon."
}