{
  "nome_completo": "Otto Neugebauer",
  "nome_curto": "Otto Neugebauer",
  "ano_nascimento": "1899",
  "ano_morte": "1990",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neugebauer/",
  "lugar_nascimento": "Innsbruck, Austria",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Otto Neugebauer\n's father, Rudolf Neugebauer, was a railway engineer. His mother's name is unknown. Both parents died when Otto was a young child and he was brought up by an uncle. He became interested in mathematics while at the\nGymnasium\nin Graz but, in\n1917\n, he joined the Austrian army as an artillery lieutenant to avoid having to take his final school examinations. In\n1918\nthe war ended and he became a prisoner of the Italians. He was held in a prison camp in Italy along with another Austrian who went on to achieve world-wide fame, namely\nLudwig Wittgenstein\n.\nAfter he was released from the prison camp, Neugebauer moved around. First he studied electrical engineering and physics at the University of Graz from\n1919\nto\n1921\n, then he studied mathematics and physics at the University of Munich with\nSommerfeld\n. He settled in Göttingen in\n1922\nwhere he began a serious study of mathematics having become friends with\nCourant\n,\nHarald Bohr\n, and\nAleksandrov\n. His friendship with\nBohr\ndeveloped into a mathematical collaboration and they wrote a joint paper on almost periodic functions. It was to be Neugebauer's first and last paper on mathematics as such for his work at this point took a definite turn.\nNeugebauer was an expert in languages and he had studied Egyptian. It was natural, therefore, for\nBohr\nto ask his friend to review a publication on the Rhind papyrus. Once he had begun to study the work, Neugebauer realised that the subject which he wanted to work in was the history of mathematics. He approached\nCourant\nand\nHilbert\nto see if he could work for his doctorate on the history of Egyptian unit fractions. They agreed to supervise such a project and Neugebauer received his doctorate for a dissertation on this topic in\n1926\n.\nIn\n1927\nNeugebauer was appointed to the staff at Göttingen and he began to lecture on the history of ancient mathematics. One student who attended this first lecture course was\nBartel van der Waerden\nand, as a result, he also developed an interest in ancient mathematics and was to publish works of major importance throughout his life.\nHowever, in\n1927\nNeugebauer decided that he wanted to research into Babylonian mathematics and, to enable him to do so, he learnt Akkadian which is the language in which the Babylonians wrote their tablets. The Babylonians wrote on tablets of unbaked clay, using cuneiform writing. The symbols were pressed into soft clay tablets with the slanted edge of a stylus and so had a wedge-shaped appearance\n(\nand hence the name cuneiform\n)\n. Many tablets, the earliest dating from around\n1700\nBC, had survived and Neugebauer knew that they were held by various museums but at that time little work had been undertaken to study them and to evaluate the Babylonian contribution. Gray writes in\n[\n4\n]\n:-\nNeugebauer was to publish his\n3\n-volume collection on mathematical tablets in the mid-\n1930\ns. They established the great richness of Babylonian mathematics, far exceeding anything one could have guessed from Greek or Egyptian sources.\nAnother project which Neugebauer became involved in was the building of a new Mathematical Institute at Göttingen. This was completed in\n1929\n, with support from the Rockefeller Foundation, and\nCourant\nand Neugebauer jointly directed the Institute until\n1932\n. However, Neugebauer had before this started the first of two projects which would be among the most important contributions anyone has made to mathematics. He persuaded Springer-Verlag to publish a journal reviewing all mathematical publications, which would complement their reviewing journals in other topics. In\n1931\nthe first issue of\nZentralblatt für Matematik\nappeared, edited by Neugebauer.\nZentralblatt für Matematik\nrapidly became an indispensable tool for all mathematicians. However, the political situation in Germany as the Nazis came to power was to bring about changes which completely changed the course of Neugebauer's career. As\nBoas\nwrites in\n[\n2\n]\n:-\nHe opposed the National Socialists in Germany from the beginning and was forced out of his academic position as a consequence.\nDavis\n[\n3\n]\nrecalls Neugebauer saying:-\nIf you never heard the sound of Nazi boots below you in the street, you cannot understand the history of the period.\nI'm sure that Neugebauer is right, yet his very quote may aid us a little in our understanding of the situation. Fortunately Neugebauer had a good friend in\nHarald Bohr\n, and he invited Neugebauer to move to the University of Copenhagen in January\n1934\n. Neugebauer took the editorial office of\nZentralblatt für Matematik\nto Copenhagen with him and from\n1934\nuntil\n1938\nZentralblatt\ncontinued to flourish from its headquarters there. The struggle to produce the reviewing journal became more difficult throughout this period, however, for the Nazis tried more and more to influence the editorial policy of the journal. Sadly some fine mathematicians were seduced by the Nazi ideas and mathematicians such as\nBlaschke\nattacked the journal.\nMatters came to a head in\n1938\nwhen\n[\n9\n]\nWilhelm Süss\ninsisted that Springer-Verlag should produce\nZentralblatt für Matematik\nin accordance with Nazi principles.\nLevi-Civita\n, who was on the editorial board, was dismissed and Neugebauer, together with almost the whole of the editorial board, resigned. Neugebauer destroyed all the records of the journal except for the cumulative index.\nNeugebauer was a highly respected historian of mathematics, and the world of mathematics could not afford to lose the reviewing journal that it had come to depend on in only a few years.\nVeblen\narranged for Brown University to offer Neugebauer a chair and the\nAmerican Mathematical Society\nsaw the chance to support Neugebauer in founding a new reviewing journal. Neugebauer sailed to the United States and\n[\n2\n]\n:-\n... the index to the Zentralblatt came with Neugebauer, although the U.S. customs almost confiscated it as potentially subversive, and it survives to this day.\nIn a remarkably short time Neugebauer had\nMathematical Reviews\nup and running. The journal started reviewing articles which appeared from July\n1939\nand the first issue appeared in January\n1940\n. Neugebauer continued as editor of\nMathematical Reviews\nuntil\n1945\nwhen a full-time executive editor was appointed. Neugebauer policy regarding reviews was an interesting one. He\n[\n1\n]\n:-\n... always insisted that the length of the review was not intended to be directly proportional to the importance of the paper; indeed, a bad paper needed to have a review sufficiently detailed so that nobody needed to look at the paper itself, whereas a really important paper needed only to be called to the world's attention.\nIn\n1947\nNeugebauer was appointed Professor of the History of Mathematics at Brown University. His contributions to the history of ancient mathematics and astronomy continued to astound. Gray writes in\n[\n4\n]\nthat:-\n... his greatest pleasure was in entirely reshaping and extending our knowledge of the history of science. Indeed, the message that Babylonians knew more\n(\nand, he impishly insisted, the Egyptians knew less\n)\nthan most people believe still needs amplification today. The high levels of scholarship that now prevails in the subject gives every prospect that received opinion will change, and that high level is largely due to the standards he set himself, his organisational skills, and the support he was able to attract.\nAmong his classic texts we should mention\nThe Exact Sciences in Antiquity\n(1951)\nand the three volume\nHistory of Ancient Mathematical Astronomy\n(1975)\n. Pyenson writes\n[\n7\n]\n:-\nNeugebauer belongs to a tradition of intensive scholarly publishing more at home in Europe than in America. His writings are technically demanding, assuming the reader is familiar with ancient and modern languages as well as the secondary literature. Neugebauer, an independent thinker who in his youth was a partisan of left-wing politics, flew no ideological flag in his scholarly work. He strove mightily to avoid the signal affliction of scholarship - tedium. His work sparkles with original insight and energetic prose.\nNeugebauer received many awards, prizes, and honorary degrees. He was elected to membership of the leading academies around the world including the\nRoyal Danish Academy of Sciences\n, the\nRoyal Belgium Academy of Science\n, the\nAustrian Academy of Sciences\n, the British Academy, the\nIrish Academy\nand\nNational Academy of Sciences\n(\nUnited States\n)\n. The American Philosophical Society awarded him their Franklin Medal. He received the Balzan Prize in\n1986\n.\nBoas\nwrites in\n[\n1\n]\nthat his greatest pleasure was in the award he received in\n1979\nfrom the\nMathematical Association of America\nwhen they gave him their Award for Distinguished service to Mathematics. The article\n[\n2\n]\ngives Neugebauer's main contributions which led to the award and, although his distinguished work on the history of science is praised, the main reason for the honour was his contribution to reviewing journals. It:-\n... is that he founded, and for many years edited, first the \"Zentralblatt für Matematik\" ..., and later, \"Mathematical Reviews\", and so gave mathematics the essential tool of a working abstracting service.\nFrom the\n1940\ns onwards, although still on the faculty at Brown University, Neugebauer spent considerable time at the Institute for Advanced Study at Princeton. After he retired from Brown University in\n1969\nhe spent more time at Princeton where he was made a permanent member of the Institute for Advanced Study in\n1980\n."
}