{
  "nome_completo": "Pandrosion of Alexandria",
  "nome_curto": "Pandrosion",
  "ano_nascimento": "300",
  "ano_morte": "360",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pandrosion/",
  "lugar_nascimento": "possibly Alexandria, Egypt",
  "lugar_morte": "possibly Alexandria, Egypt",
  "biografia": "The dates given for\nPandrosion\nand the place of her birth and of her death are pure guesses. We only know that Pandrosion was a female mathematician who flourished in the first half of the\n4\nth century. The only reason that we have any information at all about Pandrosion is that she is mentioned in works by\nPappus\n.\nPappus\nplays down her mathematical abilities but this, it is believed, is not because she was a poor mathematician, rather it was because\nPappus\nconsidered her a rival as a teacher in Alexandria. Our guesses for her dates of birth and death are, therefore, based on the fact that she must have been a contemporary of\nPappus\nand clearly was teaching in Alexandria which is the only reason we guess that she was born and died there. The dates, of course, are significant in that this makes Pandrosion an earlier woman mathematician than\nHypatia\nwho is described in our own biography as:-\n... the first woman to make a substantial contribution to the development of mathematics.\nNow the first question that it is necessary to tackle is whether Pandrosion was a man or a woman. This may seem rather a surprising question to have to answer but it has to be considered since early translations of\nPappus\n's works have presented her as a man. Later work, however, has convincingly shown that this was an error and it now appears to be widely accepted by historians that Pandrosion was a woman. We present here a short extract from\n[\n2\n]\nwhere the problem is clearly shown and its resolution is well argued; see\nTHIS LINK\n.\nSince nothing seems to be known of Pandrosion other than the references by\nPappus\n, we present a short extract from\n[\n1\n]\nwhere essentially all that is known about Pandrosion is stated. The reasons why it is believed that\nPappus\ntried to show Pandrosion as an incompetent mathematical teacher are also clearly argued; see\nTHIS LINK\n.\nThere still remains the question of whether Pandrosion made\n\"a substantial contribution to the development of mathematics.\"\nAs no writings by Pandrosion are extant, or are even referred by later Greek writers, this is in many ways an impossible question to answer. That no writings by Pandrosion come down to us today is, perhaps, not surprising since none of\nHypatia\n's writings are known in the original. It is suggested that Pandrosion may have suffered from the unfair attack that\nPappus\nmade on her competence and this could well explain why later authors chose not to refer to her work. Certainly this all presents fascinating question for pondering although it would seem that no definitive answers will ever be reached."
}