{
  "nome_completo": "Pappus of Alexandria",
  "nome_curto": "Pappus",
  "ano_nascimento": "290",
  "ano_morte": "350",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pappus/",
  "lugar_nascimento": "Alexandria, Egypt",
  "lugar_morte": null,
  "biografia": "Pappus of Alexandria\nis the last of the great Greek geometers and one of his theorems is cited as the basis of modern\nprojective geometry\n.\nOur knowledge of Pappus's life is almost nil. There appear in the literature one or two references to dates for Pappus's life which must be wrong. There is a reference in the\nSuda Lexicon\n(\na work of a\n10\nth\ncentury Greek lexicographer\n)\nwhich states that Pappus was a contemporary of\nTheon\nof Alexandria\n(\nsee for example\n[\n1\n]\n)\n:-\nPappus, of Alexandria, philosopher, lived about the time of the Emperor Theodosius the Elder\n[379\nAD -\n395\nAD\n]\n, when\nTheon\nthe Philosopher, who wrote the Canon of\nPtolemy\n, also flourished.\nThis would seem convincing but there is a chronological table by\nTheon\nof Alexandria which, when being copied, has had inserted next to the name of Diocletian\n(\nwho ruled\n284\nAD -\n305\nAD\n)\n\"at that time wrote Pappus\". Similar insertions give the dates for\nPtolemy\n,\nHipparchus\nand other mathematical astronomers.\nClearly both of these cannot be correct, and the known inaccuracy of the\nSuda\nled historians to favour dates for Pappus which would have him writing in the period\n284\nAD -\n305\nAD, as suggested by the insertion into\nTheon\n's chronological table.\nHeath\nin\n[\n4\n]\nis completely convinced saying that\n[\n4\n]\n:-\nPappus lived at the end of the third century AD.\nHowever, we now know that both the above sources are wrong, for Rome\n(\nsee\n[\n6\n]\n)\nshowed that it can be deduced from Pappus's commentary on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nthat he observed the eclipse of the sun in Alexandria which took place on the\n18\nth\nOctober\n320\n. This fixes clearly the date of\n320\nfor Pappus's commentary on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n.\nOther than this accurate date we know little else about Pappus. He was born and appears to have lived in Alexandria all his life. We know that he dedicated works to Hermodorus,\nPandrosion\nand Megethion but other than knowing that Hermodorus was Pappus's son, we have no further knowledge of these men. Again Pappus refers to a friend who was also a philosopher, named Hierius, but other than knowing that he encouraged Pappus to study certain mathematical problems, we know nothing else about him either. Finally a reference to Pappus in\nProclus\n's writings says that he headed a school in Alexandria.\nPappus's major work in geometry is\nSynagoge\nor the\nMathematical Collection\nwhich is a collection of mathematical writings in eight books thought to have been written in around\n340\n(\nalthough some historians believe that Pappus had completed the work by\n325\nAD\n)\n.\nHeath\nin\n[\n4\n]\ndescribes the\nMathematical Collection\nas follows:-\nObviously written with the object of reviving the classical Greek geometry, it covers practically the whole field. It is, however, a handbook or guide to Greek geometry rather than an encyclopaedia; it was intended, that is, to be read with the original works\n(\nwhere still extant\n)\nrather than to enable them to be dispensed with.\nIt seems likely that this work was not originally written as a single treatise but rather was written as a series of books dealing with different topics. Each book has its own introduction and often a valuable historical account of the topic, particularly in the case where such an account is not readily available from other sources.\nBook I covered arithmetic\n(\nand is lost\n)\nwhile Book II is partly lost but the remaining part deals with Apollonius's method for dealing with large numbers. The method expresses numbers as powers of a myriad, that is as powers of\n10000\n.\nBook III is divided by Pappus into four parts. The first part looks at the problem of finding two mean proportionals between two given straight lines. The second part gives a construction of the arithmetic, geometric and harmonic means. The third part describes a collection of geometrical paradoxes which Pappus says are taken from a work by Erycinus. Other than what is included in this part, we know nothing of Erycinus or his work. The final part shows how each of the five regular polyhedra can be\ninscribed\nin a sphere. The authors of\n[\n9\n]\ndiscuss the muddle Pappus made in Book III of the problem of displaying the arithmetic, geometric and harmonic means of two segments in one circle.\nBook IV contains properties of curves including the spiral of\nArchimedes\nand the quadratrix of\nHippias\nand includes his\ntrisection\nmethods. Pappus introduces the various types of curves that he will consider:-\nThere are, we say, three types of problem in geometry, the so-called 'plane', 'solid', and 'linear' problems. Those that can be solved with straight line and circle are properly called 'plane' problems, for the lines by which such problems are solved have their origin in a plane. Those problems that are solved by the use of one or more sections of the cone are called 'solid' problems. For it is necessary in the construction to use surfaces of solid figures, that is to say, cones. There remain the third type, the so-called 'linear' problem. For the construction in these cases curves other than those already mentioned are required, curves having a more varied and forced origin and arising from more irregular surfaces and from complex motions. Of this character are the curves discovered in the so-called 'surface loci' and numerous others even more involved ... . These curves have many wonderful properties. More recent writers have indeed considered some of them worthy of more extended treatment, and one of the curves is called 'the paradoxical curve' by Menelaus. Other curves of the same type are spirals, quadratrices, cochloids, and cissoids.\nPappus introduces some of the ideas of Book V by describing how bees construct honeycombs. He concludes his discussion of honeycombs and introduces the aims of his work as follows\n(\nsee for example\n[\n3\n]\nor\n[\n4\n]\n)\n:-\nBees, then, know just this fact which is useful to them, that the hexagon is greater than the square and the triangle and will hold more honey for the same expenditure of material in constructing each. But we, claiming a greater share in wisdom than the bees, will investigate a somewhat wider problem, namely that, of all equilateral and equiangular plane figures having an equal perimeter, that which has the greater number of angles is always the greater, and the greatest of then all is the circle having its perimeter equal to them.\nAlso in Book V Pappus discusses the thirteen semiregular solids discovered by\nArchimedes\n. He compares the areas of figures with equal perimeters and volumes of solids with equal surface areas, proving a result due to\nZenodorus\nthat the sphere has greater volume than any regular solid with equal surface area. He also proves the related result that, for two regular solids with equal surface area, the one with the greater number of faces has the greater volume.\nBooks VI and VII consider books of other authors\n(\nTheodosius\n,\nAutolycus\n,\nAristarchus\n,\nEuclid\n,\nApollonius\n,\nAristaeus\nand\nEratosthenes\n)\n. Book VI deals with the books on astronomy which were collected into the\nLittle Astronomy\nso-called in contrast to\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nor\nGreater Astronomy\n. As well as reviewing these works, Pappus points out errors which have somehow entered the texts.\nIn Book VII Pappus writes about the\nTreasury of Analysis\n(\nsee for example\n[\n3\n]\n)\n:-\nThe so-called \"Treasury of Analysis\", my dear Hermodorus, is, in short, a special body of doctrine furnished for the use of those who, after going through the usual elements, wish to obtain power to solve problems set to then involving curves, and for this purpose only is it useful. It is the work of three men,\nEuclid\nthe writer of the \"Elements\",\nApollonius\nof Perga and\nAristaeus\nthe elder, and proceeds by the method of analysis and synthesis.\nPappus then goes on to explain the different approaches of analysis and synthesis\n[\n3\n]\n:-\n... in analysis we suppose that which is sought to be already done, and inquire what it is from which this comes about, and again what is the antecedent cause of the latter, and so on until, by retracing our steps, we light upon something already known or ranking as a first principle... But in synthesis, proceeding in the opposite way, we suppose to be already done that which was last reached in analysis, and arranging in their natural order as consequents what were formerly antecedents and linking them one with another, we finally arrive at the construction of what was sought...\nThe article\n[\n13\n]\nis a wide ranging discussion of analysis and synthesis, taking this work by Pappus as a starting point.\nIt is in Book VII that the Pappus problem appears. See\nTHIS LINK\n. This problem had a major impact on the development of geometry. It was discussed by\nDescartes\nand\nNewton\nand what is now known as\nGuldin\n's theorem is was proved by Pappus in Book VII of the\nMathematical Collection\n. See\n[\n7\n]\nfor a discussion of whether\nGuldin\nknew of Pappus's result when he published his work in\n1640\n.\nIn Book VIII Pappus deals with mechanics. We quote Pappus's own description of the subject\n(\nsee for example\n[\n3\n]\n)\n:-\nThe science of mechanics, my dear Hermodorus, has many important uses in practical life, and is held by philosophers to be worthy of the highest esteem, and is zealously studied by mathematicians, because it takes almost first place in dealing with the nature of the material elements of the universe. for it deals generally with the stability and movement of bodies about their centres of gravity, and their motions in space, inquiring not only into the causes of those that move in virtue of their nature, but forcibly transferring others from their own places in a motion contrary to their nature; and it contrives to do this by using theorems appropriate to the subject matter.\nThe whole work does not show a great deal of originality but it does show that Pappus has a deep understanding of a whole range of mathematical topics and that he had mastered all the major available mathematical techniques. He writes well, shows great clarity of thought and the\nMathematical Collection\nis a work of very great historical importance in the study of Greek geometry.\nOf Pappus's commentary on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nonly the part on Books\n5\nand\n6\nhas survived. We cannot be certain that Pappus wrote a commentary which extended to the whole\n13\nbooks, but it seems highly probable that he did. Certainly there is evidence that his commentary covered Books\n1\n,\n3\nand\n4\nsince traces exist or are quoted by other commentators on the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. This commentary seems to be of much poorer quality to Pappus's geometrical work.\nNeugebauer\n[\n5\n]\nwrites:-\n.. the dullness and pomposity of these school treatises is only too evident. When\nPtolemy\nin the chapter on the apparent diameter of the sun, moon and shadow simply remarks that the tangential cones in question contact the spheres within a negligible error in\ngreat circles\n, then Pappus refers to\nEuclid\n's \"Optics\" to show that the circle of contact has a smaller diameter than the sphere, only to add a lengthy argument to demonstrate that the error committed in\nPtolemy\n's construction is nevertheless negligible. Or, when\nPtolemy\nsays that some phenomenon cannot take place, neither for the same clima nor for different geographical latitudes, Pappus feels obliged to explain \"same clima\" by \"either in clima\n3\n, or in\n4\n, or in any other clima\", and to illustrate \"different\" by referring to \"Rome or Alexandria\".\nNeugebauer\nalso points out that, in addition to these pointless comments, there are also comments by Pappus which are simply incorrect. In case it might be thought that the quality of the\nMathematical Collection\nand the commentary on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nas of such different quality that Pappus may not have written both, then this is ruled out by his references which he makes in the\nMathematical Collection\n(\nsee for example\n[\n1\n]\n)\n:-\n... as\nArchimedes\nshowed, and as is proved by us in the commentary on the first book of the\n[\n\"Almagest\"\n]\nby a theorem of our own.\nOf course Pappus did not write \"Almagest\" but the Greek title of the work.\nOther commentaries which Pappus wrote include one on\nEuclid\n's\nElements\n.\nProclus\n, in his own commentary on the\nElements\nrefers three times to Pappus's commentary and\nEutocius\nalso refers to Pappus's commentary. Part of Pappus's commentary may exist in an Arabic translation, namely that on Book X of the\nElements\n. However, the commentary is very different in style to that of the\nMathematical Collection\nand if indeed Pappus is the author it is a commentary which fails to show the depth of understanding that he shows in other parts of his work.\nMarinus\nclaims that Pappus also wrote a commentary on\nEuclid\n's\nData\nof which nothing has survived. That Pappus wrote on\nGeography\nis stated in the\nSuda\nand a work which claims to be written by Moses of Khoren in the fifth century seems to be largely based on Pappus's\nGeography\n. Moses writes\n(\nsee for example\n[\n1\n]\n)\n:-\nWe shall begin therefore after the Geography of Pappus of Alexandria, who followed the circle or special map of Claudius\nPtolemy\n.\nAnother reference to Pappus in this work states:-\nHaving spoken of geography in general, we shall now begin to explain each of the countries according to Pappus of Alexandria.\nOther works which could have been written by Pappus include one on music and one on hydrostatics. Certainly an instrument to measure liquids is attributed to him."
}