{
  "nome_completo": "Patrick d'Arcy",
  "nome_curto": "Patrick d'Arcy",
  "ano_nascimento": "1725",
  "ano_morte": "1779",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/DArcy/",
  "lugar_nascimento": "Kiltullagh near Athenry, County Galway, Ireland",
  "lugar_morte": "Paris, France",
  "biografia": "Patrick d'Arcy\n's first name is sometimes given as Patrice while his family name is sometimes written as Darcy. His parents were John d'Arcy\n(1687\n-\n1743)\n, the son of Hyacinth d'Arcy\n(1665\n-\n1743)\nand Catherine d'Arcy, and Jane Lynch\n(\nborn\n1690)\n, daughter of Sir Robert Blosse Lynch,\n4\nth\nBaronet, and Katharine Blake. John and Jane D'Arcy were married in\n1718\nin Galway. Patrick was the third of his parents' three sons, having older brothers Hyacinth d'Arcy and John d'Arcy. Let us note at this stage that d'Arcy's date of birth seems to be disputed. Although\n18\nth\ncentury sources give\n27\nSeptember, a couple of\n20\nth\ncentury sources give\n17\nFebruary. All agree on the year\n1725\n. The d'Arcy family were descended from James d'Arcy who was Mayor of Galway in\n1602\n-\n03\n. One of his sons, Patrick d'Arcy\n(1598\n-\n1668)\n, trained as a lawyer and entered Parliament. He was the first of the d'Arcy's to live at Kiltullagh as did his son and grandson, John d'Arcy, the father of the subject of this biography. The family were Roman Catholics and Jacobites, that is supporters of the exiled Stuart King James II of Britain. Irish Catholics were natural Jacobite supporters on religious grounds. James II had been overthrown in\n1688\n, exiled to France and the Protestant William and Mary had been installed on the English throne. Penal Laws had been passed which penalised and discriminated against Irish Roman Catholics and, with English rule over Ireland, Roman Catholic families there suffered badly. In particular the d'Arcy family suffered and several of them had moved to France in order to make a better life. When Patrick, the subject of this biography, reached the age of fourteen, his parents arranged for him to join members of the d'Arcy family living in France so that he might benefit from education in France and might have a life free of the discrimination.\nOne of John d'Arcy's brothers was James d'Arcy\n(\nborn about\n1698)\nwho lived in Nantes where he ran a successful winery with his wife Jane Martin. Patrick was smuggled aboard one of his uncle James's ships which sailed from Galway to Bordeaux. When the ship docked in Bordeaux, d'Arcy went to live with his uncle. This arrangement did not last too long for soon it was decided that he would do better in Paris where he could live with another of his uncles, Martin d'Arcy. When James II had been exiled to France in\n1688\nMartin d'Arcy had followed him and become a successful and wealthy property owner in Paris. D'Arcy was given lodgings in Paris in the home of Jean-Baptiste Clairaut. Jean-Baptiste Clairaut\n(1680\n-\n1766)\n, the father of\nAlexis Clairaut\n, taught mathematics in Paris. He had taught his son Alexis mathematics to such a high standard that Alexis read his first paper to the Paris\nAcademy of Sciences\nat the age of\n13\n. By the time d'Arcy arrived in Jean-Baptiste Clairaut's apartment,\nAlexis Clairaut\nwas\n26\nyears old and had been a member of the\nAcademy of Sciences\nfor eight years. Jean-Baptiste Clairaut now began to tutor the young d'Arcy in mathematics using similar high powered techniques to those he had used with his own son.\nD'Arcy's progress in mathematics was almost as remarkable as that of\nAlexis Clairaut\n. In\n1742\n, when he was only seventeen years old, d'Arcy had a paper published by the\nParis Academy of Sciences\n. This paper was\nObservation sur la courbe d'égale pression dans un milieu résistant\nⓉ\n(\nObservation on the equal pressure curve in a resistant medium\n)\n. To mark this remarkable achievement, the\nAcademy of Sciences\narranged for the renowned artist Hubert Drouais\n(1699\n-\n1767)\nto paint his portrait. This portrait is displayed with this biography. In the following year he published\nSolution synthétique d'un Problême de Dynamique proposé par M Daniel Bernoulli\nⓉ\n(\nSynthetic solution of a problem of dynamics proposed by Daniel Bernoulli\n)\n. In this paper he solved the problem of determining the curve followed by a body moving under its own weight along a moveable plane which itself has a horizontal motion produced by the moving body.\nThis was a period with various wars involving many of the countries of Europe. We will not go into the causes of these wars in this article, these are too numerous and too complicated. The War of Austrian Succession began in\n1740\nand this was only one of several wars involving France through this decade. D'Arcy decided on a military career and joined the Condé Infanterie. He became a captain in this regiment and served under Maurice de Saxe\n(1696\n-\n1750)\nwho led the French armies during the War of the Austrian Succession. D'Arcy was in the Condé regiment of the French army which captured the village of Augenheim on\n23\nAugust\n1744\nand also when they concluded the campaign, in November\n1744\n, with the taking of Freiburg, under the walls of which alone they lost twelve thousand men. He fought with the Condé regiment in a second campaign when he was aide-de-camp to Marshal Maurice de Saxe at the battle of Fontenoy which was fought on\n11\nMay\n1745\n. This battle took place southeast of Tournai, which is in modern Belgium, when\n52\n,\n000\nFrench troops fought against\n50\n,\n000\ntroops consisting of English, Hanoverian, Dutch, and Austrians commanded by William Augustus, Duke of Cumberland of England. The French army contained Irish units which took on the English units in the battle.\nAfter these campaigns, d'Arcy took part in an expedition which attempted to go to Scotland to support Prince Charles Edward Stuart, known as \"Bonnie Prince Charlie\" or the \"Young Pretender\". Prince Charles Edward was the grandson of James II, the Roman Catholic king of England who had been deposed in\n1688\n. Prince Charles Edward claimed the British throne and landed in Scotland in July\n1745\n. After military successes he marched south with an army but lack of support persuaded him to return to Scotland. William Augustus, duke of Cumberland, marched north with an army to confront Prince Charles Edward. D'Arcy set out with Count Fitzjames and several hundred men on the ships Bourbon and Charité attempting to sail to Scotland to give support to Prince Charles Edward. The February\n1746\nLondon Gazette\nreported:-\nThe Bourbon and Charité, two French transports, from Ostend for Scotland, taken\n21\nFebruary off Ostend by Commander Knowles. They had on board the Bourbon, the Count de Fitzjames\n[\nand\n]\nM D'Arcy, Captain of Condé's regiment of horse, Aid de camp to Count Fitzjames ... a total of\n199\nmen. On board the Charité ... about\n160\nmen. There was on board likewise all their saddles, arms and horse-furniture, some ammunition, and the military chest containing about\n5000\nl.\nThe report may be inaccurate as it seems more likely the ships sailed from Dunkirk but were taken off Ostend. D'Arcy was taken prisoner and held for a while in the Tower of London. He was released and was able to return to France in\n1747\nwhen the French and English arranged a prisoner exchange. He continued his mathematical studies and published\nProblème de Dynamique\nⓉ\n(\nA dynamical problem\n)\nin\n1747\nand four memoirs in\n1749\nnamely\n(\ni\n)\nPrincipe général de Dynamique\nⓉ\n(\nGeneral principle of dynamics\n)\n,\n(\nii\n)\nRéflexions sur le principe de moindre action de M de Maupertuis\nⓉ\n(\nReflections on Maupertuis' principle of least action\n)\n,\n(\niii\n)\nRéflexions sur la théorie de la lune, donnée par Clairaut,\nⓉ\n(\nReflections on the lunar theory of Clairaut,\n)\nand\n(\niv\n)\nMémoire sur l'électricité contenant la description d'un électromètre, ou d'un instrument servant à mesurer la force électrique\nⓉ\n(\nMemoir on electricity containing the description of an electrometer, or instrument for measuring electric force\n)\n. The memoirs on dynamics studied the 'conservation of momentum of rotatory motion' and the 'principle of conservation of action'. We discuss briefly the memoir on electricity below. He also published\nSuite d'un Mémoire de Dynamique\nⓉ\n(\nSupplementary memoir on dynamics\n)\n(1750)\nand\nDe la courbe d'égale pression lorsque le milieu résiste comme le quarré des vitesses\nⓉ\n(\nOn the curve of equal pressure when the medium resists as the square of the speed\n)\n(1750)\n. He was elected to the Paris\nAcademy of Sciences\nin\n1749\n.\nSoon d'Arcy was back in the military. He was made a colonel in Count Fitzjames' Regiment in\n1752\n. However, he continued to publish scientific papers several of which were related to military applications of mathematics. For example he published\nMémoire sur la théorie de l'artillerie, ou sur les effets de la poudre, & sur les conséquences qui en résultent par rapport aux armes à feu\nⓉ\n(\nMemoir on the theory of artillery, or the effects of the powder, and the resulting consequences with respect to firearms\n)\n(1751)\n,\nObservations et expériences sur la théorie et la pratique de l'artillerie, auxquelles on a joint réponses qu'a faites M de Saint-Auban\nⓉ\n(\nObservations and experiments on the theory and practice of the artillery, to which was attached responses to those made by St. Auban\n)\n(1751)\n,\nRéplique à un mémoire de M de Maupertuis, sur le principe de la moindre action, inséré dans les mémoires de l'Académie royale des Sciences de Berlin, de l'année\n1752\nⓉ\n(\nReply to a memoir of  Maupertuis on the principle of least action, published in the memories of the Royal Academy of Sciences in Berlin, in\n1752\n)\n(1752)\n,\nNouvelle construction de canons légers\nⓉ\n(\nNew construction of light guns\n)\n(1753)\n, and\nRéflexions sur les machines hydrauliques\nⓉ\n(\nReflections on hydraulic machines\n)\n(1754)\n.\nIn\n1756\nthe Seven Years War began which was effectively a war between Britain and France but it involved most of the nations of Europe as well as several outside Europe. In\n1757\nd'Arcy was with the French troops as they took on the Prussians under Frederick the Great near the town of Rosburg. The French with their Austrian allies outnumbered the Prussians two to one, but clever tactics by Frederick the Great saw the Prussians victorious. Many in Fitzjames' Regiment were killed and the remainder, including d'Arcy, returned to France. D'Arcy now worked for Antoine Ricouart d'Herouville\n(1713\n-\n1782)\nwho was planning a French attack on England. D'Arcy had considerable expertise concerning the waters round Ireland and he joined with d'Herouville in the project and carried out some surveys. The plan came to nothing for it was never carried through but for the enthusiastic way that d'Arcy had undertaken the work he was promoted to brigadier.\nLet us return to d'Arcy's mathematical and other scientific studies which he carried out after the military campaigns we described above. He published\nThéorèmes de dynamique\nⓉ\n(\nTheorems in dynamics\n)\n(1758)\n,\nMémoire sur les degrés de l'ellipticité des sphéroïdes par rapport à l'intensité de l'attraction\nⓉ\n(\nMemoir on the degrees of  ellipticity of a spheroid relative to the intensity of attraction\n)\n(1758)\n,\nManière de décrire les ovales de Descartes par un mouvement continu\nⓉ\n(\nA way to describe the ovals of Descartes by a continuous movement\n)\n(1758)\n,\nMémoire sur la précession des équinoxes\nⓉ\n(\nMemoir on the precession of the equinoxes\n)\n(1759)\n, and\nEssai d'une théorie d'artillerie\nⓉ\n(\nTest of an artillery theory\n)\n(1760)\n. The last of these memoirs was published by the Paris\nAcademy of Sciences\nand had a note regarding the refereeing process attached to it:-\nMessieurs\nClairaut\nand de Montigny, who had been appointed to examine a work by M Chevalier d'Arcy, entitled \"Essai d'une Théorie d'Artillerie\"\nⓉ\n(\nTest of an artillery theory\n)\n, having made their report, the Academy has deemed this work worthy of printing, in witness whereof I have signed this certificate. Grandjean de Fouchy. Paris,\n1\nDecember\n1760\n.\nWe note that 'Clairaut' is\nAlexis Clairaut\n, 'de Montigny' is Jean Charles Philibert Trudaine de Montigny\n(1733\n-\n1777)\n, a chemist and member of the Academy of Sciences, and 'Grandjean de Fouchy' is Jean-Paul Grandjean de Fouchy\n(1707\n-\n1788)\n, an astronomer and the Perpetual Secretary of the\nAcademy of Sciences\n.\nD'Arcy also published\nPrécis de l'essai sur la théorie de l'artillerie\nⓉ\n(\nSummary of an essay on the theory of artillery\n)\n(1760)\n,\nMémoire sur la durée de la sensation de la vue\nⓉ\n(\nMemorandum on the duration of the sensation of vision\n)\n(1765)\n, and\nRecueil de pièces sur un nouveau fusil\nⓉ\n(\nDigest of remrks on a new rifle\n)\n(1767)\n.\nHis\n1765\npaper on the persistence of vision describes an experiment that he had carried out. It is described in\n[\n2\n]\n:-\nThe setting for d'Arcy's investigation was a darkened building in which he constructed a revolving cross, the speed of which he could measure. To one arm of the cross he attached a burning coal and set it spinning. As it gathered speed he noted the point at which the coal appeared to draw a continuous line in the dark. He spun it back and forth, sometimes noting the critical minimum speed for the illusion to take effect as the cross lost momentum. He changed the position of the coal on the cross; viewed it through a telescope, squinted at it through a pinhole; and changed the distance from which he viewed the spinning coal. The results all seemed to be the same, which suggested that the retention of an image lasts\n130\nmilliseconds.\nIn\n1767\nd'Arcy made a visit to Kiltullagh in Ireland, the place of his birth. One of his uncles offered him a substantial sum of money if he would agree to remain in Ireland but the Penal Laws, which severely discriminated against Roman Catholics, meant that he felt he could not live under such conditions. He returned to France via London where he was well treated by members of the\nRoyal Society\nwho were impressed by his scientific publications and would have liked to have made him a fellow of the Society but his political stance made this impossible. When Martin d'Arcy, the uncle who had looked after d'Arcy when he arrived in Paris as a young man, died he left d'Arcy a considerable fortune. He then married his niece, Jane d'Arcy, in\n1777\n. She had previously moved to Paris to receive an education there and d'Arcy had become very fond of her. He had to obtain permission to marry his niece but this was granted. The marriage took place in the church of Saint Philippe du Roule in the\n8\nth\narrondissement, which at that time was near the outskirts of Paris where d'Arcy owned property. The church, designed by Jean-François-Thérèse Chalgrin\n(1739\n-\n1811)\n, was built only a few years before d'Arcy was married there, building having only started in\n1774\n. D'Arcy carried on with his scientific work, collaborating with Jean Baptiste Le Roy\n(1720\n-\n1800)\non electricity, and their work was of interest to\nBenjamin Franklin\nwho was a close friend of Le Roy. Le Roy and d'Arcy had jointly worked on measuring electricity in\n1748\nand had invented a floating repulsion electrometer to measure electrostatic repulsion. We know that d'Arcy was in London in\n1770\nsince he delivered a letter, a book and pump machine from Le Roy to\nFranklin\n's London home. However, the two missed each other and did not meet at that time as\nFranklin\nexplained in a letter to Le Roy written from London on\n2\nOctober\n1770\n.\nOnly two years after his marriage, d'Arcy died having contracted cholera. He was buried in the church of Saint Philippe du Roule that he had married in. Countess d'Arcy\n[\n9\n]\n:-\n... was an extremely charming woman and she became lady-in-waiting to Marie Antoinette.\nShe returned to Ireland a few years before the French revolution and so avoided the problems that someone of her status would have had in Paris. She remarried in\n1783\nand died in\n1826\n.\nWe quote from\n[\n7\n]\nregarding d'Arcy's appearance and character:-\nThe count d'Arcy was of middle stature, and was distinguished by his fine commanding figure. His temper was ardent, his mind penetrating and active, and his soul ambitiously devoted to the pursuit of science. The gaiety of his life, however, the professional interruptions which he experienced, and his limited fortune, prevented him from executing the various experiments which he had conceived. His experiments are all marked by fertility of invention, and his writings are distinguished by profound and ingenious views. His name will be associated with those of\nEuler\n, Bernouilli,\nD'Alembert\n, and\nClairaut\n, and will long adorn the history of science.\nSadly, although the names of\nEuler\n, Bernouilli,\nD'Alembert\n, and\nClairaut\nstill \"adorn the history of science\", the name of Patrick d'Arcy has been almost totally forgotten. Let us hope that this biography goes just a little way towards remembering d'Arcy in the\n21\nst\ncentury."
}