{
  "nome_completo": "Paul Gustav Heinrich Bachmann",
  "nome_curto": "Paul Bachmann",
  "ano_nascimento": "1837",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bachmann/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Weimar, Germany",
  "biografia": "Paul Bachmann\n's father was Johann Friedrich Bachmann\n(1799\n-\n1876)\n, a Lutheran minister, and his mother was Julie Lieder\n(1806\n-\n1885)\n. Johann Bachmann had been born in Drossen, Prussia, the son of the Lutheran minister Christian Friedrich Bachmann. He had studied theology in Halle and was ordained before moving to Lisbon, Portugal, in\n1825\nas a preacher and teacher of religion. He returned to Berlin in the spring of\n1828\nto marry his fiancée Julie Lieder but was unable to go back to Portugal because of a civil war there. He became a preacher in the Luisenstadt district of Berlin. Johann and Julie's first two children, a son and a daughter, died as infants. They had another three sons and one daughter: Johann\n(1832\n-\n1888)\n; Julie\n(1833\n-\n1900)\n; Paul\n(1837\n-\n1920)\n; and Gustav\n(1842\n-\n1890)\n. Paul is the subject of this biography, but the other two sons also had notable careers, Johann as a professor of theology at Rostock and Gustav as an engineer, officer and teacher at the military academy in Kassel. Paul's father Johann became a pastor at the St Jacobi Kirche in the Luisenstadt district of Berlin soon after it was built in\n1844\n-\n45\n.\nPaul was brought up in a strict home where his modest nature was encouraged, and where he became an enthusiastic and highly talented musician. He began attending school at the age of seven. Later, he attended the Friedrich-Wilhelm-Gymnasium in Berlin at which he appears to have had some difficulty with mathematics. His mathematical talents, however, came to the fore under the excellent mathematics teacher Karl Heinrich Schellbach\n(1805\n-\n1892)\nwho encouraged him to study mathematics at university. Schellbach, in addition to being professor of mathematics at the Friedrich-Wilhelm-Gymnasium from\n1841\n, was also a professor at the Kriegsakademie in Berlin from\n1843\n. An excellent research mathematician, Schellbach was particularly interested in 'the difficult art of teaching'. It was undoubtedly his skills which turned Bachmann into a top class mathematician. Bachmann graduated from the\nGymnasium\nin March\n1855\nbut his health at this stage was not good so, in order to recover from tuberculosis, he was advised to spend the summer in Switzerland which he did before beginning his university education.\nBachmann entered the University of Berlin\n(\nthe Friedrich-Wilhelms-Universität\n)\nin the autumn of\n1855\nand studied mathematics there in the Faculty of Philosophy. In\n1856\nhe went to the University of Göttingen so that he could continue to study courses by\nLejeune Dirichlet\nwho had just left Berlin to succeed to\nGauss\n's chair in Göttingen. In Göttingen, Bachmann became close friends with\nDedekind\nwho had only a few years earlier been awarded his doctorate under\nGauss\n's supervision. At the University of Göttingen Bachmann attended courses by\nWilhelm Weber\n, Friedrich Woehler, Hermann Lotze,\nBernhard Riemann\nand\nRichard Dedekind\n. Bachmann returned to Berlin where he received a doctorate in\n1862\nfor a thesis on\ngroup theory\nunder\nEduard Kummer\n's supervision. He mentions, in a vita in the thesis, attending lectures by\nKummer\n,\nEncke\n, Magnus, Dove, Rose, Trendelenburg,\nWeierstrass\n, Poggendorf,\nBorchardt\nand Arndt. His dissertation\nDe substitutionum theoria meditationes quaedam\nⓉ\n(\nOn substitution theory of any the kind\n)\nwas examined by E Fischer, F Bachmann and J Teichert on\n24\nMarch\n1862\n.\nFrom Berlin, Bachmann went to Breslau to study for his\nhabilitation\n. There he worked on\nnumber theory\nand he was awarded his habilitation in\n1864\nfor a thesis\nDe unitatum complexarum theoria\nⓉ\n(\nA theory of complex units\n)\non complex units which had been a topic that he had been inspired to work on though the lectures by\nDirichlet\nwhich he had attended. He taught at Breslau after the award of the habilitation, becoming an extraordinary professor there in\n1867\nafter submitting\nTheorie der komplexen Zahlen\nⓉ\n(\nTheory of complex numbers\n)\n. He published\nVorlesungen über die Lehre von der Kreisteilung\nⓉ\n(\nLectures on the theory of cyclotomic polynomials\n)\nin\n1872\nand, in the following year, was appointed as an ordinary professor.\nIn\n1875\n, he was appointed as a full professor at the University of Münster. He taught for many years at Münster frequently lecturing on topics from his favourite area of number theory. It gave him special satisfaction to see how number theory continued to grow with new friends and other researchers entering the area. However Bachamnn divorced his wife in\n1890\nand resigned his chair in Münster. Then, as\nØystein Ore\nwrites in\n[\n1\n]\n:-\nWith his second wife he settled in Weimar, where he combined his mathematical writing with composing, playing the piano, and serving as a music critic for several newspapers.\nFreed from administrative tasks, Bachmann was able to carry out his plans for major publications that he had been thinking about for a long time. His most important work is a complete survey of number theory giving both the results and an evaluation of the methods of proof.\nZahlentheorie. Versuch einer Gesammtdarstellung dieser Wissenschaft in ihren Hauptteilen\nⓉ\n(\nNumber Theory. Attempt at an overall presentation of this science in its main parts\n)\n, which he worked on after resigning his chair in Münster, was published in five volumes between\n1892\nand\n1923\n. The first volume, subtitled\nDie Elemente der Zahlentheorie\nⓉ\n(\nElements of Number Theory\n)\n, was published in\n1892\n. Jacob William Albert Young\n(1865\n-\n1948)\n, associate professor of the pedagogy of mathematics at the University of Chicago, writes\n[\n8\n]\n:-\nThis work is the beginning of a homogeneous presentation of the subject in its present status, the object being rather to make a synopsis or an outline of this branch of mathematics than a compendium containing all that has ever been written on it. ... The work is a pleasing and welcome addition to the literature of the theory of numbers, on account of its contents and their manner of presentation, but still more as the forerunner of other volumes written in the same style and with the same aims, and dealing with the less elementary portions of the subject. ... It is to be hoped that\n[\nthe author\n]\nwill be able speedily to bring this difficult task to a satisfactory conclusion.\nBachmann followed this by: Volume\n2\n,\nDie analytische Zahlentheorie\nⓉ\n(\nAnalytic number theory\n)\n(1894)\n; Volume\n3\n,\nDie Lehre von der Kreisteilung und ihr Beziehungen zur Zahlentheorie\nⓉ\n(\nThe theory of cyclotomic polynomials and their relations with the number theory\n)\n(1872)\n; Volume\n4\n,\nDie Arithmetik der quadratischen Formen\nⓉ\n(\nThe arithmetic of quadratic forms\n)\n(\nPart\n1\n,\n1898\n, Part\n2\n,\n1923)\n; and Volume\n5\n,\nAllgemeine Arithmetik der Zahlkörper\nⓉ\n(\nGeneral arithmetic of number fields\n)\n(1905)\n. His other major works include\nNiedere Zahlentheorie\nⓉ\n(\nElementary Number Theory\n)\n, published in two volumes in\n1902\nand\n1910\n,\nDas Fermat-Problem in seiner bisherigen Entwicklung\nⓉ\n(\nThe Fermat problem and its recent development\n)\npublished in\n1919\n, and\nGrundlehren der neueren Zahlentheorie\nⓉ\n(\nBasic teachings of modern number theory\n)\n(1907\n, Second Edition\n1921\n, Third Edition edited by Robert Haussner\n1931)\n. Let us now look briefly at some of the comments made by reviewers of these works.\nJacob Young gives a very full review of\nDie Elemente der Zahlentheorie\nⓉ\n(\nElements of Number Theory\n)\n(1892)\nin\n[\n8\n]\n. Let us quote a short passage from the review which he gives before a detailed description of the work:-\nThe volume before us treats of the elements  of the subject - congruences, quadratic residues, and forms, the last being restricted to binary  forms. ... Regarding the work as a whole, the following points deserve especial remark:\nClearness of Presentation. - This is characteristic not only of the discussions, but also and especially of the formulations of the problems and the analyses of methods. This, together with the well-balanced mean preserved between excessive conciseness and too great diffuseness, makes the book unusually readable. It must be said, however, that the simpler presentation is not always preferred, but rather that which fits more consistently into the general plan of treatment. ...\nIntroduction of Recent Results. - Since the time of\nGauss\nnot much has been accomplished, relatively speaking, by elementary methods in the elementary field as outlined above, but still the author finds sufficient opportunity for presenting recent results to warrant the statement that he has given us, as proposed, not simply a sketch of the subject as\nGauss\nleft it, but of the elementary theory of numbers in its principal outlines as it stands to-day. ... Throughout the book well-chosen references direct the reader to original sources.\nHistorical Remarks. - Concise sketches of the salient features of the historical development of the subjects considered are made as occasion arises and add materially to the interest and also to the clearness of the treatment. The author is usually scrupulous in crediting even simple and commonly current results to their original publisher.\nLeonard Dickson\nreviews\nNiedere Zahlentheorie\n(1902)\nin\n[\n3\n]\nand explains how Bachmann decided that a second introductory volume on number theory would be a useful addition to the literature:-\nIn view of the ambitious series of volumes by Bachmann; giving a comprehensive exposition of number theory, a series not yet completed, the appearance of a new volume on the elements of the subject, quite independent of the series mentioned, will doubtless cause some surprise. When the invitation came to the author to contribute to Teubner's 'Sammlung' a text upon the subject on which he is so eminent an authority, he hesitated long, fearing that a text on the elements of number theory ran the risk of conflicting with his 'Elementen'. The author has attempted to avoid this conflict in two directions: first by the addition of much important material; second, by employing a method of construction different at least in essential points. The author believes that the present book, both in contents and in foundation, may well be considered as a supplementary volume to his former series. ... The author has certainly succeeded admirably in the task he has undertaken. It will appeal especially to the student who wishes a complete account of the results and methods of the elementary parts of the theory of numbers.\nReviewing the second volume, published\n8\nyears later,\nDickson\nwrites\n[\n4\n]\n:-\nThe first volume of this work appeared in\n1902\n... The present second volume has the subtitle 'Additive Zahlentheorie', a term suggested by\nKronecker\nfor the properties of numbers relating to their additive combinations. ... Bachmann has fully maintained his reputation as to clearness, thoroughness, and exhaustiveness.\nBachmann surveyed the attempts that had been made over nearly\n300\nyears attempting to give a positive or a negative solution to\nFermat\n's Last Theorem in\nDas Fermatproblem in Seiner Bisherigen Entwicklung\n(1919)\n.\nDerrick N Lehmer\n, reviewing the book, writes:-\nThis little book, written in the terrible days of\n1918\n, is in honour of the fiftieth anniversary of the doctorate of\nFelix Klein\n. It is avowedly a glorification of German scientific effort in the theory of numbers, but the author is too great a scientist to allow any unworthy motive to colour the presentation of the subject. He treats the work of German and non-German with scholarly impartiality and thoroughness. The book gives in very convenient form the chief results of\n284\nyears of struggle with the problem of proving the possibility or impossibility in integers of the equation\nx\nn\n+\ny\nn\n=\nz\nn\nx^{n} + y^{n} = z^{n}\nx\nn\n+\ny\nn\n=\nz\nn\nfor values of\nn\nn\nn\ngreater than\n2\n.\nE T Bell\n, reviewing the third edition of\nGrundlehren der neueren Zahlentheorie\nⓉ\n(\nBasic teachings of modern number theory\n)\nwhich was edited by Robert Haussner and published in\n1931\n(11\nyears after Bachmann's death\n)\nwrites:-\nThe book can be warmly recommended to beginners with a good reading knowledge of German. The exposition is unusually detailed, and Bachmann spares no pains to make clear his reasons for attacking various arithmetical problems in the way he does.\nLet us end this biography with the following assessment of Bachmann's contribution given by Robert Haussner in\n[\n5\n]\n:-\nCommon to all Bachman works is the full loving care and the great skill with which he knew how to extract from countless difficult individual works, an overview and a generous summary which he could achieve due to his mastery of this abstract domain and, even in his old age, admirable unparalleled knowledge of the literature. His constant endeavour was to achieve an artistically completed rounding of his works. His mathematical works show he had the mind of an artist, as he also showed as a musician. Many mathematicians have a love of music, and some of them they shall exercise in this or that instrument; and some of them they shall practice in this or that instrument; but it is rarely granted to them to be creative in music, as Bachmann's friends know that he was."
}