{
  "nome_completo": "Paul Turán",
  "nome_curto": "Paul Turán",
  "ano_nascimento": "1910",
  "ano_morte": "1976",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Turan/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Paul Turán\n's parents were Aranha Beck and Béla Turán. Paul Turán\n(\nor Turán Pál in Hungarian\n)\nwas the eldest son having two brothers and one sister. The family were Jewish and so had to survive through exceedingly difficult times, suffering discrimination and then violent anti-Semitism. Paul was a brilliant pupil at secondary school in Budapest, showing at this stage his remarkable mathematical abilities.\nTurán entered Pázmány Péter University of Budapest already showing his potential for research.\nErdős\nwrites\n[\n7\n]\n:-\nWe first met at the University of Budapest in September\n1930\nand immediately discovered our common interest in\nnumber theory\n.\nIn\n1933\nTurán was awarded his diploma which qualified him to teach mathematics and science, and he continued working for his doctorate. His first paper was published in\n1933\nand his next two papers, both published in\n1934\n, were very significant. One was\nA problem in the elementary theory of numbers\nwhich appeared in the\nAmerican Mathematical Monthly\n. It was significant in being Turán's first joint work with\nErdős\n. The second was\nOn a theorem of Hardy and Ramanujan\nwhich was published in the\nJournal of the London Mathematical Society\n. It was not the result which Turán proved here that was significant, for he proved a result which had been known since\n1917\n, namely that almost all integers\nn\nn\nn\nhave asymptotically log log\nn\nn\nn\nprime factors. Rather it was the method of proof which, although it does not use probabilistic terminology, in fact became one of the foundations of probabilistic number theory.\nHis Ph.D. was supervised by\nFejér\n, and Turán was awarded the degree in\n1935\n. His thesis\nOn the number of prime divisors of integers\n, written in Hungarian, had been published in\n1934\nand contained his new proof of the theorem of\nHardy\nand\nRamanujan\nreferred to above. Even at this early stage he had built up an impressive international reputation and had seven papers in print by the end of\n1935\n, three of which had appeared in the\nJournal of the London Mathematical Society\n. One might have expected that this brilliant young mathematician would have easily found a university position. However, this was far from the case since the severe discrimination against him because of his Jewish origins meant that he could not even obtain a post as a school teacher. In order to support himself financially, and give himself the chance to continue his mathematical researches, he had to make a living as a private mathematics tutor. By the end of\n1938\n, five years after his first paper appeared, he had sixteen papers in print in internationally important journals world-wide. At last he managed to get a position as a school teacher when, in\n1938\n, he was appointed as an assistant teacher of mathematics at the Hungarian Rabbinical Training School in Budapest.\nNot only was\n1938\nsignificant in that Turán now at least had employment, but it was also the year in which he had his most fruitful mathematical idea.\nErdős\nwrites in\n[\n7\n]\n:-\nProbably the most important, most enduring and most original of Turán's results are in his power sum method and its applications. I was there when it originated in\n1938\n. Turán mentioned these problems and told me that they were not only interesting in themselves but their positive solution would have many applications. Their importance first of all is that they lead to interesting deep problems of a completely new type; they have quite unexpectedly surprising consequences in many branches of mathematics - differential equations, numerical algebra, and various branches of function theory.\nIn fact Turán invented the power sum method while investigating the\nzeta function\nand he first used the method to prove results about the zeros of the zeta function. Later Turán and S Knapowski\n[\n3\n]\n:-\n... investigated the distribution of primes in the reduced residue classes mod k. ... The power sum method proved to be the unique procedure for investigating this problem up to now. Their results in this field were published in nearly\n20\npapers and were called comparative number theory by the authors.\nIf times had been extremely hard for Turán up to\n1938\n, then any appearance that they were about to get better was short lived for soon they became far worse. Turán had grown up during the years of World War I which had proved a time of great hardship. After the war ended, the Treaty of Trianon of\n1921\nsaw Hungary's territory reduced to about one third of its previous size. As events moved towards World War II, Hungarian foreign policy looked towards Germany and Italy as allies who could help them to restore their lost territory. After the German invasion of Poland which began World War II, Hungary was not involved at first but was still greatly influenced by Nazi policies. In\n1940\nTurán was sent to a labour camp, and he was in and out of various forced labour camps throughout the war. This proved an horrific experience but, as we remark below, perhaps in the end his life was saved because of it. Alpár writes\n[\n3\n]\n:-\nBut not even\n[\nthe labour camp\n]\ncould stop his mathematical activity. In every situation, making use of the smallest opportunity, he carried on his research without books and journals, missing the company of colleagues, jotting down his ideas and results on scraps of paper. Several of his new ideas, problems and now famous theorems, originate from that period. As G Alexits has written about him: \"When the fascist barbarism forced him to pull electric wires on poles he defended himself against the malevolent oppression be dealing with his mathematical ideas. Once he told me: \"I got my best ideas while pulling wires, because then I could be alone and nobody noticed that I was thinking.\"\nErdős\n, who had begun corresponding regularly with Turán from\n1934\n, initially was able to get some contact with him in the labour camps.\nErdős\nwrote to his father, Lajos Erdős, in Budapest, who then wrote to Turán, copying out the relevant parts of his son's letters. Remarkably, even some of these letters have survived and they are reproduced in English translation in\n[\n20\n]\n, but there is no record of any correspondence between June\n1941\nand Spring\n1945\n. We note that Vera T Sós, the author of\n[\n20\n]\n, was Turán's wife and he wrote a number of joint papers with her. Another remarkable fact is that extremal graph theory, an area which Turán founded, was one of the \"best ideas\" that he had while in the labour camps.\nIn\n1941\nGermany attacked Russia and Hungary supported them. After the Russian resistance was far greater than expected, Hungary mobilised all its forces to support the German offensive on Russia. The Hungarian forces suffered a crushing defeat at Voronezh in western Russia in January\n1943\n. In March\n1944\nHungary fully cooperated with Nazi aims and Jews were forced to wear a yellow star, robbed of their property, and forced into ghettos as in other Nazi-occupied areas. Except for the Jews in the forced-labour camps, like Turán, others were sent to the gas chambers of German concentration camps. Turán's two brothers and his sister all died during the war. It is estimated that\n550\n,\n000\nof Hungary's\n750\n,\n000\nJews were killed during the war. Turán was liberated from the labour camp in\n1944\nand was able to resume teaching at the Hungarian Rabbinical Training School in Budapest.\nAfter World War II ended Turán was appointed as a\nPrivatdozent\nat the Eötvös Loránd University of Budapest\n(\nit had formerly been called the Pázmány Péter University of Budapest\n)\n. Hungary signed a new peace treaty in Paris on\n10\nFebruary\n1947\n, which restored the Trianon frontiers. Before this, however, Turán was able to make international contacts which let him visit Denmark for six months, then the Institute for Advanced Study at Princeton for six months, in\n1947\n. On his return to Hungary he was elected to the\nHungarian Academy of Sciences\nin\n1948\n, and received the Kossuth Prize from the Hungarian government in the same year. In\n1949\nhe was appointed to the Chair of Algebra and Number Theory at\nEötvös Loránd\nUniversity of Budapest, a position he held until his death. From\n1955\nhe was Head of the Complex Function Theory Department in the Mathematical Institute of the\nHungarian Academy of Sciences\n.\nErdős\nin\n[\n7\n]\ndescribes events just before his death:-\n... in July\n1976\n, at the meeting on combinatorics at Orsay in Paris, V T Sós\n(\nMrs Turán\n)\ngave me the terrible news\n(\nwhich she had known for six years\n)\nthat Paul had leukaemia. She told me that I should visit him as soon as possible and that I should be careful in talking to him because he did not know the true nature of his illness. My first reaction was to say that perhaps he should have been told ... She said that Paul loved life too much and with a death sentence hanging over him would not be able to live and work very well. ... I am now fairly sure that her decision was right, since he clearly never tried to find out the true nature of his illness. in fact a few days before his death\n[\nhis wife\n]\nand their son George\n(\nalso a mathematician\n)\ntried to persuade him to dictate some parts of his book to Halász or Pintz. he refused saying \"I will write it when I feel better and stronger\". Unfortunately he never had the chance. Fortunately his book was finished by his students G Halász and J Pintz ...\nThe book mentioned here is\nOn a new method of analysis and its applications\nwhich was published in\n1984\n. Bob Odoni wrote a review:-\nIn\n1953\nthe author published a book, A new method of analysis and its applications ... giving a systematic account of his methods for estimating \"power sums\", which he had developed\n(1941\n-\n53)\ninto a versatile and powerful technique with numerous applications to Diophantine approximations, zero-free regions for the Riemann zeta function and the error term in the\nprime number theorem\n, and to problems in other parts of classical analysis. As regards the latter, Turán found new approaches to such topics as quasi-analytic classes, Fabry's gap theorem and the theory of lacunary series, amongst others. The book was revised\n(\nwith improved estimates\n)\nin a second edition, but this had a limited mathematical audience since it was only available in Chinese. In\n1959\nTurán embarked on the preparation of a new, greatly expanded version of the book. Constant rewriting became necessary in the light of the new improvements and applications, and, at the time of his death in\n1976\n, the project had still not been completed to Turán's total satisfaction. The book under review represents the culmination of all this work ...\nOdoni ends his review with this tribute to Turán's mathematics:-\nIn the opinion of the reviewer this book renders a great service to mathematicians working in a wide area of classical analysis, particularly\nanalytic number theorists\n; Turán's methods are still of great relevance in current research, and it is particularly gratifying to have all this material within the confines of a single volume. The book is a fitting tribute to Turán's remarkable achievements in analysis, and the editors of the manuscript deserve high praise for their efforts in bringing it to publication.\nWe have mentioned some of Turán's mathematics above. However, it is impossible to do justice to the huge amount of work which he did, publishing around\n150\npapers. We mention, however, his work on statistical\ngroup theory\n, much of which was undertaken jointly with\nErdős\n. Of course conjugacy classes of the symmetric group\nS\nn\nS_{n}\nS\nn\n​\non\nn\nn\nn\nletters are characterized by partitions of\nn\nn\nn\n, so the connection with number theory is clear. Most questions discussed by Turán and\nErdős\non this topic concern the distribution of the order of random elements of the symmetric group\nS\nn\nS_{n}\nS\nn\n​\n. In some of the problems they considered, all permutations are taken to be equally probable, some others are about the set of conjugacy classes, all equally probable. Turán and\nErdős\nalso proved that in a group of order\nn\nn\nn\n, at least\nn\nlog\n⁡\nlog\n⁡\nn\nn \\log \\log n\nn\nlo\ng\nlo\ng\nn\nof the\nn\n2\nn^{2}\nn\n2\npairs of elements commute.\nA mathematician who served under Turán in Budapest described him as:-\n... outstanding in analytic number theory but not a good manager of a department.\nHowever he did outstanding work for both the\nHungarian Academy of Sciences\n, serving on numerous committees. He also served the\nJános Bolyai Mathematical Society\nin many ways including a time as president. Another major contribution made by Turán was his editing of the papers of\nRényi\nand\nFejér\nwhich is the main point made by\nAskey\nin the article\n[\n4\n]\n.\nAskey\nwrites:-\nI have used the\nFejér\npapers often. Turán's editing was remarkable. He commented on many of the papers, setting them in context and telling what happened to the ideas\nFejér\nintroduced.\nBut this is only a part of the editorial work Turán undertook, being on the editorial boards of Acta Arithmetica, Archiv für Mathematik, Analysis Mathematica, Compositio Mathematica, Journal of Number Theory, and essentially all Hungarian mathematical journals.\nTurán received many honours in addition to the honours which we mentioned above. He received the Kossuth Prize from the Hungarian government for a second time in\n1952\n. He also received the Szele Prize from the\nJános Bolyai Mathematical Society\nin\n1975\nfor creating scientific schools. He was also elected a member of the\nAmerican Mathematical Society\n, the\nAustrian Mathematical Society\n, and the\nPolish Mathematical Society\n.\nA special issue of\nActa Mathematica\ndevoted to Paul Turán was published in\n1980\n."
}