{
  "nome_completo": "Paul Koebe",
  "nome_curto": "Paul Koebe",
  "ano_nascimento": "1882",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Koebe/",
  "lugar_nascimento": "Luckenwalde, Germany",
  "lugar_morte": "Leipzig, Germany",
  "biografia": "Paul Koebe\n's father was Otto Hermann Koebe\n(24\nJune\n1852\n-\n4\nNovember\n1932)\n, known as Hermann, and his mother was Karoline Emma Krämer, known as Emma. Hermann Koebe set up a metal foundry with a copper smithy for pump manufacture in Poststrasse, Luckenwalde in\n1878\n. After building a new factory in the industrial area, he produced the first suction and pressure pumps, later also steam and electric motor pumps. He received his first patent for the \"Triumph\" pump, which could be operated by only one man. Hermann Koebe products have been used worldwide. A\n1902\nadvertisement reads:-\nHermann Koebe Factory for fire extinguishers, Luckenwalde. Koebe's pump \"Triumph\" can be blown out and blasted on in a few seconds by one man without any physical exertion. Business founded in\n1878\n.\nPaul Koebe was born in Luckenwalde, as was his father. This town is in Brandenburg, on the river Nuthe, about\n50\nkm south of Berlin.\nThe fire extinguisher business was highly successful and Hermann Koebe was well-off and able to give his son a good education. Koebe received his elementary school education in Luckenwalde and then attended the Joachimsthalsches\nGymnasium\nin Berlin. This school, for gifted boys, was founded in\n1607\nbut in\n1880\nit moved into a new building in the Kaiserallee district\n(\nnamed the Bundesallee district since\n1950)\n. There were several buildings in Italian High Renaissance style with accommodation for teachers and pupils, sports facilities etc. He entered this school in\n1891\nand there he studied religion, Latin and modern languages, history and geography, mathematics and science. The course, which was based more on practical applications than that of the more academic gymnasium, still qualified Koebe to enter university. Koebe was awarded his secondary school certificate in\n1900\n.\nHe first studied mathematics and physics at Kiel University which he entered in\n1900\n. There he attended lectures by the physicists Ludwig Claisen\n(1851\n-\n1930)\nand Philipp Eduard Anton von Lenard\n(1862\n-\n1947)\n, and the mathematicians Goetz Martius\n(1853\n-\n1927)\n, and\nPaul Stäckel\n. After one semester he moved to Berlin University where he was to study for five years. At Berlin his thesis was directed by\nHermann Schwarz\n. On\n28\nJuly\n1904\nhe took his written Ph.D. examinations and a year later he submitted his thesis\nÜber diejenigen Funktionen eines Arguments, welche ein algebraisches Additionstheorem besitzen\nⓉ\n(\nOn those functions of an argument which have an algebraic addition theorem\n)\n. The additional examiner for the oral on his thesis was\nFriedrich Schottky\nwho had been appointed to Berlin in\n1902\nwhile Koebe was in the middle of his studies. Koebe was awarded his doctorate from the Friedrich-Wilhelms-Universität of Berlin on\n24\nJune\n1905\n. His thesis was dedicated to \"My dear parents.\" He wrote in the Introduction to the thesis:-\nIn his lectures at the University of Berlin on the theory of elliptic functions,\nWeierstrass\ntook on the task: To determine all analytical functions of an argument that have an algebraic addition theorem.\nWeierstrass\ncarried out the complete solution of this task in his lectures. To determine the multiform functions with algebraic addition theorem, he used different methods at different times. It is essential to show that the number of branches of such a function is finite.\nThis thesis contains, among other thing, the communication of what I believe is a simple and natural process by which it can be shown that every multiform function with an algebraic addition theorem is an algebraic function of a unique function. It is undoubtedly the case that\nWeierstrass\nmust have come extremely close to this method of proof; for the tools which are used in this method of proof closely follow the methods which he himself worked out for the purpose mentioned, the knowledge of which I owe to a lecture given by\nH A Schwarz\n.\nIn the seventh volume of the 'Acta Mathematica',\nEdvard Phragmén\npublished a method he found for solving the\nWeierstrass\nproblem mentioned above. Although the proof I have found is unmistakably related to\nPhragmén\n's, there seem to be remarkable differences between the two methods.\nKoebe also studied for three semesters at the Charlottenburg Technische Hochschule. He writes in his thesis:-\nIn Berlin or in Charlottenburg I heard lectures by professors and lecturers: F E Blaise, Benedict Friedländer,\nGeorg Frobenius\n,\nLazarus Fuchs\n, Stanislaus Jolles, Guido Hauck,\nKurt Hensel\n, Georg Hettner, Johannes Knoblauch,\nEdmund Landau\n, R Lehmann,\nMax Planck\n, Gustav Röthe,\nFriedrich Schottky\n,\nH A Schwarz\n,\nIssai Schur\n, Carl Stumpf, Emil Warburg, and Ulrich von Wilamowitz-Möllendorff.\nKoebe undertook research at Göttingen for his\nhabilitation\npresenting his thesis in\n1907\n. He remained at Göttingen as a\ndocent\nuntil\n1910\nhaving been promoted to extraordinary professor.\nHermann Weyl\nwrites\n[\n7\n]\n:-\nBetween\n1907\nand\n1910\nKoebe was a dominant figure in Göttingen. The uniformization theorem in all its various forms, which he and\nPoincaré\nfirst proved at that time, occupies a central position in the theory of analytic functions. Koebe never tired of composing new variations on this theme. In a limited field he had great powers of intuition; he was a constructive geometer of the first water.\nKlein\nand\nPoincaré\n, more than twenty years before, had tried to prove the theorem for the special case of algebraic functions by the so-called continuity method. Later the\nRiemann\nproblem had been attacked by the same procedure, with equally unsatisfactory results. Abandoning this unwieldy instrument, Koebe and\nPoincaré\nnow reached their goal by combining\nH A Schwarz\n's idea of the universal covering surface with simple estimates of the\nHarnack\ntype for harmonic functions.\nIt was in\n1907\nthat Koebe achieved this most famous result on the uniformization of\nRiemann\nsurfaces, it being a major contribution to\nHilbert\n's Twenty Second Problem. This problem was about uniformization, asking whether every algebraic or analytic curve can be expressed in terms of single-valued functions. Koebe resolved the problem in the one-dimensional case. Shortly after\n1900\nKoebe had established the general principle of uniformization which had been originally conceived by\nKlein\nand\nPoincaré\n. Koebe's proof of the uniformization theorem in the papers\nÜber die Uniformisierung reeller algebraischer Kurven\nⓉ\n(\nOn the uniformization of Real algebraic curves\n)\n(1907)\nand\nÜber die Uniformisierung beliebiger analytischer Kurven\nⓉ\n(\nOn the uniformization of arbitrary analytical curves\n)\n(1907)\nhas been described as:-\n... arguably one of the great theorems of the century.\nFor a list of Koebe's papers, see\nTHIS LINK\n.\nLudwig Bieberbach\nwas nearly five years younger than Koebe who was a docent at Göttingen during the time that\nBieberbach\nwas undertaking research for his doctorate advised by\nFelix Klein\n. Koebe proved to be a major influence on the direction of\nBieberbach\n's research. Both\nBieberbach\nand Koebe were keen to emphasise their own importance and to somewhat exaggerate the importance of their results, as happened in an incident described in\n[\n4\n]\n:-\nOne of\nBieberbach\n's theorems had to do with bounds on the amount a certain class of complex-analytic maps rotates geometric figures. Paul Koebe had proved an earlier theorem about bounds on the distortions caused by such maps, and\nBieberbach\n's introduction to his paper in volume\n4\nof the 'Mathematische Zeischrift'\n(1919)\nexplicitly said that Koebe's \"distortion theorem\" contributed nothing to his \"rotation theorem.\" There are two questions here: the existence of bounds of a certain type\n(\nthe qualitative question\n)\n, and obtaining explicit, perhaps best possible, bounds\n(\nthe quantitative question\n)\n. In\n1920\n, in volume\n6\nof the same journal, Koebe ... said that, on the contrary, the qualitative rotation theorem was an immediate corollary of his distortion theorem, though the quantitative one was not. In\n1921\n(\nsame journal, volume\n9)\nBieberbach\npublicly replied, sort of admitting Koebe was right, but saying that quantitative results were his aim, and anyway, both Koebe's theorem and his rotation theorem flowed directly from another theorem of his: \"My conjecture that my 'surface theorem' is the true root of all results known up until now about the behaviour of univalent mappings has thus found complete confirmation.\" In\n1922\nEdmund Landau\ntook up the matter in his advanced seminar and wrote Koebe and\nBieberbach\na joint letter.\nEdmund Landau\nsaid that, as a consequence of this further study, he had come to the conclusion that Koebe was more correct than\nBieberbach\nin their public exchange, but not correct enough!\nIt would appear that\nBieberbach\nwas more angry with\nEdmund Landau\nafter this incident than he was with Koebe.\nAlthough clearly an outstanding mathematician, nevertheless, Koebe had a reputation for stealing the ideas of others, particularly younger colleagues. Constance Reid writes\n[\n3\n]\n:-\n... Koebe was considered a conceited and disagreeable man with a reputation for picking up the ideas of younger people and, because he was so quick, being able to finalise and publish them first. He was, nevertheless, an outstanding mathematician ...\nFor example,\nRichard Courant\nobtained his doctorate from Göttingen in\n1910\nunder\nHilbert\n's supervision. His thesis was entitled\nÜber die Anwendung des Dirichletschen Prinzipes auf die Probleme der konformen Abbildung\nⓉ\n(\nOn the application of Dirichlet's principle to the problems of conformal mapping\n)\n. In\n[\n8\n]\nBen Yandell summarises quotations from\nCourant\nin\n[\n3\n]\n:-\nReid quotes\nCourant\nto the effect that Koebe stole the idea of his thesis, not yet published, of which the two had spoken. Koebe rushed off a paper on the same subject and thus claimed independent credit for the result. Then Koebe showed up at a seminar where\nCourant\nwas scheduled to speak on his thesis and by virtue of seniority took the position of speaking first. This was not well received by\nCourant\n's friends, according to Reid. They rigged up an elaborate apparatus and hid it in a chamber pot under the lectern of a class Koebe was teaching. An alarm sounded at erratic intervals as Koebe lectured. When he finally pulled the mechanism out of the chamber pot, it was greeted with much laughter. One of the mischief makers, Kurt Hahn, saw to it that an article describing the incident appeared in the local paper.\nAnother famous mathematician whom Koebe seems to have stolen ideas from was\nL E J Brouwer\n. In\n[\n5\n]\nthis episode is related in detail with several of\nBrouwer\n's letters being quoted. We give only a brief summary below and we point the reader to\n[\n5\n]\nfor the full story. First we note Koebe himself wrote a report of a session of the\nDeutschen Mathematiker-Vereinigung\n, introducing the report as follows:-\nFor its annual meeting in September\n1911\n, the\nGerman Mathematical Society\ndecided to make the latest development in the theory of automorphic functions the subject of a special session. This session filled the morning of September\n27\nth. The introductory lecture by\nKlein\n, which gave a general orientation, was followed by the lectures and presentations by\nBrouwer\n, Koebe,\nBieberbach\nand\nHilb\n.\nAfter the session, a discussion took place which Koebe did not accurately describe in his report, rather turning it to his advantage. On\n24\nFebruary\n1912\nBrouwer\nwrote to\nHilbert\n, beginning his letter as follows\n(\nsee\n[\n5\n]\n)\n:-\nI am asking you for help and protection in a very unpleasant matter.\nAfter explaining the background to the problem, he writes:-\nOnly after longer private discussions, in which also\nBieberbach\n,\nFelix Bernstein\nand Rosenthal participated, Koebe learned after the talks, from\n27\ntill\n29\nSeptember, from me which partial result\n(\nby the way, formulated by\nKlein\nin the 'Mathematische Annalen'\n21\n, and at that time called the\nWeierstrass\ntheorem\n)\ncan be obtained via his 'Verzerrungssatz'\nⓉ\n(\nDistortion theorem\n)\nand which part, to be settled by my contribution, still remains necessary. And, as the above mentioned gentlemen know precisely, in these discussions I have mentioned all the details of my present note.\nHowever, already at that time several warning voices said to me: 'All that, you have explained now to Koebe, you will only with the greatest effort be able to claim as your property, as soon as he has understood you', and indeed Koebe displayed some symptoms that seemed to bear out those voices. So when I was at home again I wanted to refrain from any publication on that particular topic, which is anyway rather far from my interest and with which I only casually concerned myself at the request of\nKlein\n, in order to avoid an unpleasant fight with Koebe.\nOnly after\nBlumenthal\nprodded me, and after I had, moreover, heard that\nKlein\nwould like to see a publication from my hand, the note of the thirteenth of January came forth.\nOn\n9\nMarch, Koebe wrote again to\nHilbert\n:-\nAfter sending you my latest letter, I got the enclosed card from Koebe. It neither brings the retraction of his false claims, demanded by me, nor the promised proofs of his note that he owes me. I now must give up hope of his return to common sense, and I therefore ask you to have my note for the 'Gottinger Nachrichten' printed. All the same, it is important to me to answer here, for your information, Koebe's objections against my note . ... Here Koebe is moving around in a circulus vitiosus: for on the one hand he demands me to praise his as yet unpublished work extensively, on the other hand he tries to prevent me from learning its contents.\nThere is a strange story about this note of\nBrouwer\n's. After it was published\nBrouwer\nrealised that there had been changes to one of his footnotes, the changed footnote giving Koebe much greater credit than his original did. People at the time believed that Koebe himself had made the change in\nBrouwer\n's note. Dalen gives the following quote from the writings of\nHans Freudenthal\n[\n5\n]\n:-\nOral tradition tells a cloak-and-dagger story about this footnote: On some dark afternoon in March an unidentified person wearing a large hat, a turned up collar, and blue glasses called at Dieterick'sche Univ.-Buchdruckerei W. Fr. Kaestner in Göttingen, the printing office of 'Göttinger Nachrichten', and asked for the printer's proof of the next issue. He got it, and after a while he gave it back and left. The identity of this person has never been determined, nor is it known whether he made any change in\nBrouwer\n's reading proof, which of course disappeared after printing. I do not know how much of this story is true. To a trustworthy friend of mine who years later asked him about this incident, Koebe explained it as a trick somebody played on him. Though the revised edition of the footnote gives information which at that time was not publicly available, the hypothesis that it was a practical joke cannot at all be excluded in the Göttingen ambiance. Koebe was a picturesque character whose honesty and frankness forbade him to disguise his greatness as a mathematician; in order to escape embarrassing admiration he travelled incognito, and he often said that in his birthplace Luckenwalde the street boys called after him \"There goes the famous function theorist!\"\nWe should note that\nBrouwer\ndoes not come out of this exchange much better than Koebe for\nBrouwer\nalso chooses in his letters to modify things said in the discussion on\n27\nSeptember\n1911\nto be more favourable to him.\nThe above quotes give a very negative impression of Koebe as a person, and this does appear to be the general view of his colleagues at the time. There is, however, a more positive view expressed by Huber Cremer\n(1897\n-\n1983)\nwho was Koebe's assistant from\n1927\nto\n1931\n.\nYou can read an English version of Cremer's article\n[\n10\n]\nat\nTHIS LINK\n.\nKoebe was appointed to Leipzig University in\n1910\nas an extraordinary professor of mathematics. He became an ordinary professor in\n1914\nwhen he accepted a position at Jena University. He returned to Leipzig, this time as an ordinary professor, in\n1926\n. He was dean of the Faculty of Mathematics and Natural Sciences at Leipzig from\n1933\nto\n1935\n.\nThe article\n[\n9\n]\ndescribes his contributions in some detail and gives a list of\n68\npublications by Koebe\n[\nwe list\n70\npublications at\nTHIS LINK\n]\n. These are not, however, a collection of great works on a par with his proof of the uniformization theorem. Koebe's style was pompous and chaotic and, as we have shown above, Koebe anecdotes were famous in Germany between the two wars. He did make other important contributions, however, and his circle domain conjecture is still being attacked. A special case was proved in\n1993\nby Z-X He and O Schramm.\nFreudenthal\nwrites in\n[\n1\n]\n:-\nHe tended to deal broadly with special cases of a general theory by a variety of methods ...\nFreudenthal\n, who like Koebe was born in Luckenwalde, also tells us that Koebe's life-style was, as his mathematics, chaotic. It is unclear from what\nFreudenthal\nwrites whether he is implying that Koebe required a wife to help organise his life but certainly he had no wife, remaining a bachelor all his life. His high quality as a mathematician was recognised with several major honours: he was elected: Corresponding member of the\nRoyal Society of Sciences in Göttingen\n1915\n-\n1919\n; Corresponding member of the\nAcademy of Sciences in Göttingen\n1919\n-\n1945\n; Corresponding member of the\nBerlin Academy of Sciences\nin Berlin\n1925\n-\n1945\n; Full member of the Mathematics and Natural Sciences class of the Saxon Academy of Sciences in Leipzig\n1927\n-\n1945\n; and Corresponding member of the\nHeidelberg Academy of Sciences\n1942\n-\n1945\n. He also received an honorary award from the\nBerlin Academy of Sciences\n(1914)\n, the mathematical prize of the King of Sweden\n(1927)\nand the Ackermann-Teubner Prize\n(1922)\nfrom the University of Leipzig for his three memoirs\nÜber die Uniformisierung der algebraischen Kurven\nⓉ\n(\nOn the uniformization of algebraic curves\n)\n, published in volumes\n67\n,\n69\n, and\n72\nof the\nMathematische Annalen\n.\nHe died from gastric cancer and was buried in the family tomb in the Evangelical Cemetery in Luckenwalde."
}