{
  "nome_completo": "Peter Ramsay",
  "nome_curto": "Peter Ramsay",
  "ano_nascimento": "1879",
  "ano_morte": "1926",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramsay/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Peter Ramsay\n's father was  James Ramsay\n(\nborn in Monifeith, Perthshire about\n1851)\nwho was a tea merchant and grocer. His mother was  Helen F Ramsay\n(\nborn in Campsie, Stirlingshire about\n1854)\n. Peter Ramsay had an older sister Helen\n(\nborn about\n1879)\n. After the death of James Ramsay Helen F Ramsay married the widower Robert McLintock\n(\nborn Kilbarchan, Renfrewshire about\n1842)\n. He was a secretary to a calico printer with three children Mary, Christina and George from his earlier marriage.\nPeter Ramsay was educated at Whitehill Public School, Glasgow. On\n11\nDecember\n1895\nit was announced in\nThe Scotsman:-\nDougald McQuistan\nand Peter Ramsay, two students of the secondary department of Whitehill Public School, Glasgow, have been awarded by the Science and Art Department \"Queen's Prizes\" to mathematics.\nRamsay studied at Glasgow University. He graduated with an M.A. with First Class Honours in Mathematics and Natural Philosophy in\n1900\n. After graduating, he was appointed Master at Allan Glen's School, Glasgow, but also continued to work at the University for a B.Sc. which was awarded in\n1904\nwith special distinction in Mathematics and Natural Philosophy.\nIn\n1908\nhe was appointed Second Mathematics Master at George Watson's College, Edinburgh. He was promoted to Head of Mathematics at Watson's in\n1914\n.\nThe Scotsman\non\n15\nth\nDecember\n1913\nannounced this:-\nAppointment to George Watson's College, Edinburgh.\nMr Peter Ramsay, M.A., B.Sc., has been appointed Dr\nPinkerton\n's successor as head of the Mathematics Department in George Watson' s College, Edinburgh. Mr Ramsay is an honours graduate of Glasgow University, and a week or two ago was selected for a similar post in Daniel Stewart's College, which he now vacates.\nRamsay held this position until his death in\n1926\n[\n1\n]\n:-\nRamsay's skill as a teacher was of an unusually high order, and he combined with it a natural bent for organisation, which made his service in the general administration of the school very valuable. At the time of his death he was acting as Deputy Headmaster of\n[\nGeorge Watson's Boys' College\n]\n.\nRamsay became a member of the\nEdinburgh Mathematical Society\nin March\n1905\n. He was Treasurer of the Society during\n1916\n-\n1921\n, then President for session\n1922\n-\n23\n. He was the editor of the\nMathematical Notes\nfor the part No\n22\nMay\n1924\nand the succeeding part. He was elected a fellow of the\nRoyal Society of Edinburgh\non\n25\nMay\n1914\n. He was proposed for the fellowship by\nJohn Alison\n,\nGeorge A Gibson\n,\nSir Edmund T Whittaker\n,\nJames Gordon Gray\n.\nRamsay's death was announced in\nThe Scotsman\nof Saturday,\n3\nrd\nJuly\n1926\n:-\nDEATH OF EDINBURGH TEACHER\nTHE LATE MR PETER RAMSAY\nThe death occurred suddenly yesterday morning of Mr Peter Ramsay, M.A., B.Sc., F.R.S.E., who was deputy headmaster and head Mathematical master, of George Watson's College, Edinburgh. Mr Ramsay was travelling in a tramcar when he became ill. With him at the time, were several masters of Watson's College, who helped to assist Mr Ramsay to a taxi cab. He had, however, had a seizure, and died before the cab could reach his home.\nA native of Glasgow, Mr Ramsay had a distinguished career at Glasgow University, and taught at Allan Glen's school in his native city from\n1900\nto\n1908\n. On coming to Watson's College eighteen years ago, he became assistant mathematical master there. He succeeded Dr P\nPinkerton\nas the head of the mathematical department in\n1914\n. He was particularly popular with the boys of the school, and was an enthusiastic follower of their sports. Mr Ramsay's wife predeceased him over a year ago."
}