{
  "nome_completo": "Peter Comrie",
  "nome_curto": "Peter Comrie",
  "ano_nascimento": "1868",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Comrie/",
  "lugar_nascimento": "Muthill, near Crieff, Perthshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Peter Comrie\nwas born in Muthill, a small village just south of Crieff. His mother was Elizabeth Ritchie and his father was Peter Comrie, a master blacksmith in the village. Comrie received his school education at Muthil School and then at Morrison's Academy, Crieff, Perthshire. He first matriculated at the University of St Andrews in\n1888\nand in his first session he studied Greek\n2\n, Latin\n2\n, and Mathematics\n2\n. In his second year he studied Natural Philosophy, Logic, English Literature, and Latin\n2\n. Then in\n1890\n-\n91\nhe took the courses Moral Philosophy and Political Economy, English Literature, Mathematics\n3\n, and Chemistry. In session\n1891\n-\n92\nhe studied the courses Natural Philosophy, Mathematics\n3\n, Physiology, and Botany, then took Honours Natural Philosophy the following session. Comrie was awarded the Carstairs Prize\n(\nawarded to the best mathematics student in each of the three years\n)\nin\n1892\n, the Gray Prize\n(\nawarded for an essay on a prescribed subject\n)\nin\n1891\n, and the Arnott Prize\n(\nawarded on examination in Natural Philosophy at the end of the session\n)\nin\n1892\n.\nHe was awarded an M.A. with Second Class Honours by the University of St Andrews on\n3\nMarch\n1894\nand a B.Sc., also by St Andrews, on\n29\nMarch in the following year. He taught mathematics as an Assistant Master in Greenock Academy, Glasgow, from\n1895\nto\n1899\n, then he was appointed Head Mathematics Master at Hutcheson's Girls Grammar School, Glasgow. He held the post in Glasgow for two years from\n1899\nto\n1901\n, then was appointed to Gordon's College in Aberdeen. After three years in Aberdeen he became Head of Mathematics in Boroughmuir School, Edinburgh, in\n1904\n. In\n1917\nhe was appointed Headmaster of Castle Hill School, Edinburgh, and at this time he lived at\n19\nCraighouse Terrace, Edinburgh. Then in\n1922\nhe was appointed Rector of Leith Academy but continued to live in Craighouse Terrace. He held this post until he retired in\n1933\n.\nComrie was elected a Fellow of the\nRoyal Society of Edinburgh\non\n15\nMarch\n1909\nhaving been proposed by Sir James Donaldson,\nP R Scott Lang\n, James Gordon MacGregor, and\nGeorge A Gibson\n. He was awarded an honorary LL.D. from the University of St Andrews on\n26\nDecember\n1928\n. He was also President of the Educational Institute of Scotland.\nComrie was a member of the\nEdinburgh Mathematical Society\n, joining the Society in March\n1905\n. He served on the Committee from\n1907\n, then was honorary secretary from\n1911\nto\n1916\n. This meant that he played a major role in organising the\n1913\nEdinburgh Mathematical Colloquium:-\nAt the close of the Colloquium in the afternoon\n[\nof Friday\n8\nAugust\n1913]\nthe President,\nMr Burgess\n, paid a tribute to the enthusiasm and energy with which the secretary, Mr Comrie, had thrown himself into the work of organising the meeting.\nHe was honoured by serving as President for two sessions,\n1916\n-\n17\nand\n1917\n-\n18\n.\nHis obituary in the\nEdinburgh Mathematical Notes\nis at\nTHIS LINK\n.\nHis obituary in\nThe Scotsman\nis at\nTHIS LINK\n.\nJohn Mackie writes in\n[\n1\n]\n:-\nDr Comrie was married to Miss Charlotte Aikman, a St Andrews lady, who survives him.\nBoth in private and in public life he was one of the kindliest of men. He grudged neither time nor energy to further the welfare of others, and in all his work created about him an atmosphere of friendly and human companionship in carrying out a common task."
}