{
  "nome_completo": "Petrus Apianus",
  "nome_curto": "Petrus Apianus",
  "ano_nascimento": "1495",
  "ano_morte": "1552",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Apianus/",
  "lugar_nascimento": "Leisnig, Saxony (now Germany)",
  "lugar_morte": "Ingolstadt, Bavaria, Germany",
  "biografia": "Petrus Apianus\n, also known as Peter Apian, Peter Bennewitz, and Peter Bienewitz, was one of four sons of Martin and Gertrud Bienewitz. He entered the University of Leipzig where he studied mathematics, astronomy and cosmography.\nPerhaps we should indicate what the study of cosmography entailed. It was a broad science which set out to provide a mathematical basis for the position of everything in the universe. As such it required someone who specialised in the topic to be an expert in astronomy, geography, mapmaking, navigation, surveying, architecture, mathematical instruments, and sundials. In many ways these can be thought of as the applied mathematical disciplines of Apian's day, and we can certainly consider Apian as a leading applied mathematician. Apian excelled at mathematics and its\n16\nth\ncentury applications, and after his studies at Leipzig he moved to Vienna where he continued to study the same broad collection of applied mathematical topics.\nIt is also worth noting that the early\n16\nth\ncentury was an exciting time to be mapping the world. Vasco da Gama had sailed from Portugal round Africa to India in\n1498\n. Christopher Columbus had landed in the Americas in\n1492\nand in\n1522\nFerdinand Magellan had returned to Spain after a round the world voyage. This was close to the time when Apian began to publish. His first work was a world map\nTypus orbis universalis\nwhich he based on earlier\n1520\nwork by Martin Waldsemüller. Apian's second work followed the year after and this was the\nIsagoge\nⓉ\n(\nIntroduction\n)\n, a geographical commentary on the\nTypus orbis universalis\n.\nIn\n1524\nApain published his first work of major importance. This was\nCosmographia seu descriptio totius orbis\nand was a work based largely on\nPtolemy\n.\nCosmographia\nprovided an introduction to astronomy, geography, cartography, surveying, navigation, weather and climate, the shape of the earth, map projections, and mathematical instruments. The lavishly illustrated book was far more than an atlas but it did provide sketches of the continents and some of the earliest maps of America.\nThe\n1524\npublication of\nCosmographia\nwas a modest success but not really a best seller. However, taken with his earlier works, it showed Apian's great talents and these publications were the main reason that he was appointed Professor of Mathematics at the University of Ingolstadt in\n1527\n. From this point his career really took off although the arithmetic book which he published in that year was not a major factor. One aspect of this little work on arithmetic which, like all of Apian's contributions, is highly practical in its aims, was that the title page contained\nPascal's triangle\n. This was the first time that this famous piece of mathematics appeared in print in Europe.\nAt this time Charles V, the Holy Roman emperor, ruled over large parts of Europe as King of Spain and Archduke of Austria with a Spanish and Habsburg empire covering Europe from Spain and the Netherlands to Austria and Italy. It seems likely that Charles himself had studied cosmography, a useful subject for a ruler of so large an empire, under Apian around\n1530\n. The evidence for this, however, is not conclusive. We know for certain that by the early\n1530\ns Apian had special privileges granted by Charles and in\n1540\nApian dedicated his next major work\nAstronomicon Caesareum\nto Charles.\nAstronomicon Caesareum\nwas an even more lavish work than\nCosmographia\n. It presented much of the same material but in a considerably more elegant and polished way. It contains some important new scientific ideas; for example Apian advocates the use of solar eclipses to determine longitude. The book also contains descriptions of five comets, in particular\nHalley\n's comet, and in\nAstronomicon Caesareum\nApian is the first to make the important observation that a comet's tail always points away from the Sun.\nAstronomicon Caesareum\ndelighted Charles V who, on the strength of the work, appointed Apian court mathematician and he knighted Apian and his three brothers.\nBetween the publication of\nCosmographia\nin\n1524\nand\nAstronomicon Caesareum\nin\n1540\n, there had been further important publishing events. One was in\n1533\nwhen\nGemma Frisius\npublished a new edition of\nCosmographia\n.\nFrisius\nhad spent considerable effort on editing and enlarging Apian's book and it really paid off since this second edition became very much more popular than the first and was a best seller throughout Europe, being translated into all major European languages. Of course\nFrisius\nhad ample reason to promote and improve the potential of the\nCosmographia\nfor he was a maker of instruments and\nCosmographia\nwas a work in which Apian had described and illustrated a wide range of mathematical instruments which were available from\nFrisius\n's workshop. The book illustrated and described wooden, brass and ivory instruments but there were even working paper instruments included in the text, called volvelles, which let readers experiment with the ideas described. With the volvelles that were supplied readers could solve calendar problems and find the positions of the sun, moon and the planets.\nAnother publication between\n1524\nand\n1540\nwas Apian's most important contribution to mathematics itself, rather than its applications. This was his book\nInstrumentum sinuum sive primi\npublished in\n1534\nwhich contained the first sine tables calculated for every minute of arc. Like all other works by Apian this book contained a host of applications of mathematics, and the sine tables are applied to problems of astronomy, navigation and architecture. In\n1534\nApian published the first large scale map of Europe but sadly this work is no longer extant.\nFollowing\n1540\nApian became famous and wealthy. Charles V granted him more privileges such as the power to make illegitimate children legally legitimate, and also the power to grant higher degrees.\nApian had a son, Phillip, who was born in\n1531\nand  followed his father by studying mathematics. After Apian's death in\n1552\n, Philip was appointed to fill the vacant post of Professor of Mathematics at the University of Ingolstadt.\nKish, in\n[\n1\n]\n, sums up Apian's contribution:-\nApian was a pioneer in astronomical and geographical instrumentation, and one of the most successful popularisers of these subjects during the sixteenth century."
}