{
  "nome_completo": "Johan Philip van Lansberge",
  "nome_curto": "Philip van Lansberge",
  "ano_nascimento": "1561",
  "ano_morte": "1632",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lansberge/",
  "lugar_nascimento": "Ghent, Spanish Netherlands (now Belgium)",
  "lugar_morte": "Middelburg, Netherlands",
  "biografia": "Philip van Lansberge\n's name is given in many different spellings. He is known by the name Philip, often written as Philippe. A common form is Philips Lansbergen but his family name can be written as Lambergius, Lanbergius, Lansberg, Lansbergus, Lansbergen, Lansberghe, Landsberghe, Lancenbergius or Lancenberghe. Faced with this array of possibilities we will consistently use the form 'Lansberge'. He was born in Ghent in the Netherlands to parents Daniel van Lansberge, Lord of Meulebeke, and Pauline van den Honigh. Philip had a brother, François, probably also born in Ghent, who went on the become a Protestant minister. The family were Calvinists and, given the politics of the day, this had a major impact on where the young boy grew up. At the time Philip was born, the Low Countries were part of the Spanish Empire, a Roman Catholic country that used the Inquisition to prevent any deviation from the beliefs laid down by the Church. In the Low Countries, however, there were many Protestants, particularly followers of Martin Luther and followers of John Calvin. In\n1566\nthe Calvinists began to attack images in Catholic Churches and, in the following year, the government sent an army which defeated the Calvinists.  These troubles led to the Lansberge family leaving Ghent, going first to France to ensure their safety. However, the position of Calvinists in France was little better, so the family moved to England. It was there that Philip was educated, studying mathematics and theology. No details of his upbringing in England are known.\nIn November\n1576\nthe Pacification of Ghent saw the Low Countries unite in a revolt against Spanish rule. It provided a basis for peace between the Catholic and Protestant areas but this soon ran into considerable difficulties. In January\n1579\nthe Union of Utrecht saw the formation of 'The Netherlands' which gave the Calvinists the monopoly on religion in Holland and Zeeland. Lansberge could now return to his homeland and, in March\n1579\nhe left London and returned to Ghent. He was still a young man, only\n17\nyears of age when he arrived back in Ghent, but over the following months he preached in a number of different Calvinist churches in the area. In\n1580\n, despite his youth, he was appointed as a Calvinist minister in Antwerp. He was also charged by the Board of the Reformed Church of Ghent, to preach the new doctrine in the small towns of Exaerde and Saffelaere. However, in Saffelaere he had trouble with the bailiff, Gilles van Bastelaer, who wanted to prevent him from performing the duties of his ministry. He received a call to Mechelen, just north of Brussels, but preferred to remain in Antwerp. However, warfare returned to the country as Alessandro Farnese, regent of the Netherlands for Philip II of Spain, made a military move to regain control of the south of the Netherlands. He began the action in the middle of\n1583\nand in the first half of the following year, he had captured territory so that Antwerp was cut off from the sea. Ypres and Bruges surrendered and Farnese laid siege to Antwerp. The city held out for over a year, but in August\n1585\nthey surrendered. The Catholic south now accepted Spanish rule while the north remained largely Calvinist and opposed to Spanish rule. Farnese allowed the Calvinists in Antwerp to leave peacefully after the siege and move to the north and this is what Lansberge did, moving to Leiden.\nIn Leiden, Lansberge matriculated at the university and continued his studies of theology. After a year in Leiden, during which time he was influenced by the humanist thinkers there, he was appointed on\n1\nOctober\n1586\nto be a minister in Goes, in the province of Zealand. He had chosen to go to Goes after being given a choice between being a minister in that city or in Amersfort. Although he was now a minister with all the duties that entailed, nevertheless he spent much of his efforts working on mathematics and astronomy. He had clearly read\nThomas Fincke\n's\nGeometriae rotundi\n(1583)\nfor when he published his first book in\n1591\n,\nTriangulorum geometriae libri IV\n, the influence of\nFincke\n's important work is evident. Before we describe the contents of Lansberge's treatise, we note that his interest in astronomy, probably stimulated during his short stay in Leiden, led him to be dissatisfied with both\nPtolemy\nand\nCopernicus\n. He believed that only through accurate astronomical observations could one build a satisfactory theory of the universe, and consequently by\n1588\nhe was already making his own astronomical observations. We return later to describe his important contributions to the heliocentric theory, but first let us say a little about the mathematics treatise\nTriangulorum geometriae libri IV\n. As the title indicates, this consisted of four books. In the first book he gave definitions of the various trigonometric functions. The second book consists of a\n[\n1\n]\n:-\n... method of constructing the tables of sines, tangents, and secants, largely derived from those of\nViète\nand\nFincke\n, and the tables themselves, which were used by\nKepler\nin his calculations.\nThe third book is devoted to the study of plane triangles while the fourth, and final, book begins with a study of spherical geometry before giving a thorough look at spherical trigonometry. The book is not particularly original but has some things which lift it above similar texts from that time\n[\n1\n]\n:-\nIn the solution of spherical triangles Van Lansberge employs a device similar to that of Maurice Bressieu in his 'Metrices astronomicae'\n(\nParis,\n1581)\n, the marking of the given parts of a triangle by two strokes. Van Lansberge's new proof for the cosine theorem for sides\n(\nin Book IV\n)\nmarks the first time that the theorem appeared in print for angles as well as sides. But although Van Lansberge may lay claim to the discovery of the theorem for angles, sufficient evidence indicates that this theorem was known to\nViète\nand to\nTycho Brahe\n. On the whole Van Lansberge shows little originality in the content of his trigonometry, but his arrangement of definitions and propositions is less complicated and more systematic than that of\nViète\nand\nClavius\n.\nBy the time this work was published, Lansberge had been married to Sara Lievaerts for a number of years and their first few children had been born. In total they had six sons and four daughters but not all their children reached adulthood. Their eldest son named Philippus, became a preacher in Kloetinge and died there in\n1647\n. Pieter\n(\nborn\n1587)\nfollowed his father into the ministry, becoming a minister in Goes where he assisted his father. Jacob\n(\nborn about\n1590)\nmade a career in medicine, becoming a medical doctor in Goes. He was also a fine mathematician and, following his father's death, defended the heliocentric views of his father against vigorous attacks.\nIn\n1594\nLansberge published the well-respected religious work\nCatechesis religionis Christianae, quae in Belgii et Palatinatiis ecclesiis docetur, sermonibus LII explicata\n. This collection of\n52\nsermons on the Calvinist catechism, dedicated to the States of Zeeland, was written in Latin. It was published in Middelburg in\n1594\nand Neustadt in\n1595\n, then reprinted in Hanau in\n1620\nand Frankfurt in\n1621\n. A Dutch translation by S Ghys was published in\n1645\n. In\n1597\nthere was an attempt to call Lansberge to be a minister in Amsterdam. However, there arose a dispute between the town authorities and the church authorities over his appointment. The Leiden theologian Johannes Kuchlinus wrote to the burgomaster of Amsterdam warning him that Lansberge was more dedicated to astronomy than to his ministry:-\nYou have Plancius as a geometer, perhaps you will receive an astronomer: think it over whether such a ministry will be useful for your church. For the nature of astronomy is such that it induces the whole man to love it and indulge in deep speculation. He who takes care of many things, can give less attention to each separate thing.\nIn the end, despite the attempts of the church to call Lansberge to Amsterdam, the town authorities refused to sanction the appointment and Lansberge remained in Goes. This certainly did not displease him for he was happy to be in that town. However by\n1609\nthe political situation had changed making his position in Goes less secure. Goes was\n[\n5\n]\n:-\n... quite close to the frontier with the Spanish. It was a position which called for a militant attitude, and Lansberge certainly did not compromise. His implacability brought him into conflict with the local magistrate, who, especially since the Spanish menace had diminished since the truce of\n1609\n, saw less need for such an attitude. Lansberge thought himself entitled to tell the magistrate how to act. A vigorous attack on the leniency of the town government of Goes, which allowed people suspected of Catholic sympathies to stand for the magistracy, eventually led to Lansberge's downfall.\nIn fact, by\n1610\nboth Lansberge and his son Pieter were ministers in Goes and both were dismissed in\n1613\n.  Lansberge accepted that his time in Goes was over and moved to Middelburg where he spent the rest of his life. However, his son Pieter did not accept the decision to dismiss him and, with the support of many from his church, appealed against it to the synod in\n1618\n. He argued strongly that the action taken against both him and his father was unfair, but he failed to get the judgment reversed. In Middelburg, Lansberge used his skill in medicine as well as publishing books on astronomy and continuing to make astronomical observations.\nIn\n1616\nLansberge wrote on π calculating it to\n28\nplaces using a new method. He presented his results in\nCyclometria nova\n[\n1\n]\n:-\nHe carried the value of  to\n28\ndecimal places by means of a method in which he seems to have joined the quadratrix of the ancients to trigonometric considerations. He thought that he had found a better approximation than that of\nLudolf van Ceulen\n, who had used the Archimedean method of inscribed and circumscribed polygons and had carried the value of π to thirty-five decimal places in\n1615\n.\nLansberge's work on astronomy followed\nCopernicus\n's heliocentric theory although he did not seem satisfied with what\nCopernicus\nhad presented. He wrote works supporting his own version of the heliocentric theory in both\n1619\nand\n1629\n. The first of these,\nProgymnasmatum astronomiae restitutae de motu solis\n, was written to explain his attempt to present theories based on observations of both the ancients and his own. At first he had been unable to get the data to fit any theory but eventually he felt that he had succeeded. He wrote\n(\nsee, for example\n[\n5\n]\n)\n:-\nI obtained the theory of the motions of sun and moon, as of the fixed stars, restored to their original state, so that they accord with the heavens, not only for this, but also for former centuries, up to\n2000\nyears back.\nThe\n1619\nbook was the first of three intended volumes. It gave Lansberge's theory of the sun, presented with many tables to allow calculation of the sun's position at any time and in any place on earth. The promised second and third volumes, on the theory of the moon and on the precession of the equinoxes respectively, never appeared in print. Perhaps the fact that there was little reaction to this first volume dampened his enthusiasm to complete the project. However, when he was joined by an enthusiastic young astronomer Maarten van der Hove\n(\nwho is better known by the Latin version of his name, Martinus Hortensius\n)\nin\n1628\n, he quickly started publishing again. He wrote about Hortensius saying that he was fortunate:-\n... that, by divine providence, in my old age, pressed by sickness, such a strong helper came to my aid, as formerly the learned\nRheticus\nto the great\nCopernicus\n.\nHelped by his young assistant, Lansberge published in\n1628\na second edition of his\n1619\nwork, a manual on the use of the astrolabe and the quadrant, then, in the following year, he published a popular account of his heliocentric theories in Dutch under the title\nBedenckingen op den dagelyckshen, ende jaerlyckschen loop van den aerdt-kloot.\nHortensius translated this text into Latin and published it under the title\nCommentationes in motum terrae diurnum, et annuum\n(1630)\n. The Dutch edition, written for those without mathematical skills, made quite an impact in Holland while the Latin translation was widely read and this soon led to Lansberge being strongly attacked by those opposed to the heliocentric theory. Of course, as a devout Christian, Lansberge had to explain why he was putting forward a theory which, apparently, contradicted the Bible. He wrote that St Paul, in his second letter to Timothy, says that Holy Scripture:-\n... is profitable for doctrine, for reproof, for correction, for instruction in righteousness.\nHowever, Lansberge writes:-\n... it is not intended for instruction in geometry and astronomy.\nThe\nBedenckingen\ncontains many arguments intended to show that the heliocentric theory was correct. Many were not, one would have to say, very convincing and several scientists who believed in Copernicus's theories, for example\nIsmael Boulliau\n, did not accept Lansberge's arguments 'proving' that the heliocentric theory was correct. Among those who attacked Lansberge's work, one of the most vigorous of the anti-Copernicans was\nJean-Baptiste Morin\n. It was left to Lansberge's son Jacob to reply to\nMorin\nand others in\nApologia pro commentationibus Philippi Lansbergii in motum Terra\n, in which Jacob defended his late father's views.\nOften when considering scientists from the seventeenth century, we look at their achievements and tend to ignore the world of magic and alchemy they inherited. Perhaps it would be fitting to look at the highly non-scientific world-view that Lansberge puts forward in the\nBedenckingen\nclearly attempting to integrate the religious views of his day into his Copernican system. As was current at the time, he believed in \"three heavens\", but he adapted it to his heliocentric view\n[\n5\n]\n:-\n... the first heaven is that of the planets; it stretches from the sun in the centre up to the orb of Saturn. The second heaven is that of the fixed stars; it stretches from the orb of Saturn up to the eighth sphere, that of the fixed stars. The third heaven is the empyreal heaven, the throne of God and the place reserved for the Elect. This heaven is invisible to us, but we know about it from spiritual revelation. ... The immense space of the second heaven is not empty. It is full of 'a host of invisible creatures'. Angels descend from the third to the first heaven, or return in the inverse direction. Good and evil spirits engage in combat. Moreover, the two inner heavens can only function because of the force\n[\nfrom the Spirit of God\n]\nthey receive from the third heaven.\nNow although Lansberge believed in a heliocentric system, he did not accept\nKepler\n's\nellipse\ntheories and he published astronomical tables, based on circular orbits with epicycles, which he hoped would support\nCopernicus\nover\nKepler\n. In\n1632\n, the year of his death, Lansberge published\nTabula motuum caelestium perpetuae\n, the astronomical tables that he had been working on for\n45\nyears. There were three different parts to this work. One part was entitled \"Perpetual tables of the heavenly motions, made up from, and in accordance with, the observations of all times\". The second part gave the theory which he had developed to calculate his tables in the first part and was entitled \"New and genuine theories of the heavenly motions\". The third part, \"A treasure of astronomical observations\", collected a large amount of data on eclipses and similar events which had been recorded over the years. The quality of Lansberge's tables, published five years after\nKepler\n's\nRudolphine Tables\n, were not immediately obvious at first. Many accepted that the later tables by Lansberge would necessarily be more accurate than\nKepler\n's and for around ten years this belief continued. However, defects began to show up and soon even his most enthusiastic supporter had turned against the tables.\nDespite the weaknesses in Lansberge's work, he still deserves much credit for bringing the ideas of\nCopernicus\nto a wide range of people who did not possess the mathematical background to read advanced texts. The discussions and controversies that his work provoked were beneficial to the progress of science."
}