{
  "nome_completo": "Phillip Augustus Griffiths",
  "nome_curto": "Phillip Griffiths",
  "ano_nascimento": "1938",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Griffiths/",
  "lugar_nascimento": "Raleigh, North Carolina, USA",
  "lugar_morte": null,
  "biografia": "Phillip Griffiths\n's parents were Philip Griffiths and Jeanette Field. Phillip was an undergraduate at Wake Forest College in Winston-Salem, North Carolina. Originally established in Wake Forest in\n1834\nby the Baptist State Convention, the College moved to Winston-Salem in\n1956\n, but it only became a university in\n1967\n. Griffiths married Ann Lane Crittenden in\n1958\nwhile he was still an undergraduate; they had two children Jan Kirsten and David. He graduated with a B.S. in\n1959\nhaving been one of the first students at the Winston-Salem campus. After graduating from Wake Forest he went to Princeton University to undertake research.\nIn\n[\n6\n]\nGriffiths describes his time as a research student in Princeton:-\nI entered Princeton University as a graduate student in\n1959\n, when the Department of Mathematics was housed in the old Fine Hall. This legendary facility was marvellous in stimulating interaction among the graduate students and between the graduate students and the faculty. The faculty offered few formal courses, and essentially none of them were at the beginning graduate level. Instead the students were expected to learn the necessary background material by reading books and papers and by organising seminars among themselves. It was a stimulating environment but not an easy one for a student like me, who had come with only a spotty background. Fortunately I had an excellent group of classmates, and in retrospect I think the \"Princeton method\" of that period was quite effective.\nDonald Spencer\nbecame Griffiths' advisor partway through his first year of study.\nSpencer\n:-\n... was wonderfully supportive and enthusiastic and his guidance made an enormous impact on my mathematical career. I remember well that a couple of mornings a week I would go to his office to present material to him. In those sessions I learned, among other things,\nLie\ngroups, sheaf cohomology, complex manifolds and differential geometry\n(\nthe equivalence of the then-existing seven definitions of a connection\n)\n.\nGriffiths was advised to read certain texts and papers which were to have a huge impact on the direction his mathematical research would take. Perhaps most important of all was\nWeyl\n's\nDie Idee der Riemannschen Fläche\nbut also highly significant were the papers of\nÉlie Cartan\n,\nHirzebruch\n's book\nNeue topologische Methoden in der algebraischen Geometrie\n, notes on complex manifolds by\nS-S Chern\n, and\nAndré Weil\n's\nIntroduction à l'étude des variétés Kählériennes\n. Griffiths submitted his thesis\nOn Certain Homogeneous Complex Manifolds\nto Princeton University in\n1962\nand was awarded his Ph.D.\nBefore completing his thesis, Griffiths had spent the summer of\n1961\nin Berkeley working with\nChern\n:-\nThis turned out to be the beginning of a personal and professional relationship that has lasted for more than forty years.\nAfter the award of his doctorate, Griffiths returned to Berkeley where he was Miller fellow at the University of California during the two years\n1962\n-\n64\n. In\n1964\nhe became a faculty member at Berkeley and he held this position until\n1967\n. In this year his marriage to Ann ended. After spending the year\n1967\n-\n68\nas a visiting professor at Princeton University, he was appointed professor at Princeton in\n1968\n. In\n1968\nhe married Marian Folsom Jones; they had two children Sarah and Rebecca. In\n1972\nhe left Princeton when he was appointed professor at Harvard University. He held this post until\n1983\nhaving spent the year\n1975\n-\n76\nat the University of California at Berkeley. He was named Dwight Parker Robinson Professor of Mathematics at Harvard University in\n1983\nbut in that year was named Provost and James B Duke Professor of Mathematics at Duke University. After nine years holding this chair, Griffiths was appointed as Director of the Institute for Advanced Study at Princeton. He stepped down from this prestigious position at the end of the\n2002\n-\n03\nacademic year becoming professor of Mathematics at the Institute for Advanced Study.\nThe four volumes\n[\n1\n]\non analytic geometry,\n[\n2\n]\non\nalgebraic geometry\n,\n[\n3\n]\non variations of\nHodge\nstructures, and\n[\n4\n]\non differential systems total\n2600\npages yet present only a selection of Griffiths' work\n(\nmany of his papers and all eleven of his books are omitted\n)\n. A reviewer of these volumes gives a good overview:-\nThough the papers selected cover a broad range of topics in complex analysis, algebraic geometry and differential equations ... there are a couple of fundamental threads running through things, over and above the stylistic and methodological outlook. Many of the papers return to the idea of examining geometric behaviour infinitesimally, in families of one sort or another, and trying to integrate the local results out to obtain global results, with varying degrees of success, of course. Some of the author's most enduring results come from simple such calculations which show how different higher-dimensional variations of cycles or\nHodge\nstructures are, often referred to as Griffiths transversality. This implies in various guises that, e.g., numerical equivalence and algebraic equivalence of cycles on projective varieties are different, that not every\nHodge\nstructure can be realized geometrically, and in a way, his proof with Clemens of the irrationality of the quartic threefold is at bottom a phenomenon of this sort. This sort of observation leads directly into the use of the exterior differential systems of\nÉlie Cartan\nto try to find the \"geometric core\", e.g., of the moduli space of\nHodge\nstructures, which led to a great deal of the author's work in the early\n1980\ns, and which spun off into the examination of PDE invariants via the exterior differential systems in the\n1990\ns.\nWe mentioned above that Griffiths has written many books. Here is a list of most of them:\n(\nwith Joseph Harris, a doctoral student of Griffiths who was awarded his Ph.D. in\n1978)\nTopics in algebraic and analytic geometry\n(1974)\n;\nEntire holomorphic mappings in one and several complex variables\n(1976)\n;\nPrinciples of algebraic geometry\n(1978)\n;\nAn introduction to the theory of special divisors on algebraic curves\n(1980)\n;\n(\nwith John W Morgan\n)\nRational homotopy theory and differential forms\n(1981)\n;\nExterior differential systems and the calculus of variations\n(1983)\n;\n(\nwith Gary R Jensen\n)\nDifferential systems and isometric embeddings\n(1987)\n;\nIntroduction to algebraic curves\n(1989)\n; and\n(\nwith Mark Green, a doctoral student of Griffiths' who was awarded his Ph.D. in\n1972)\nOn the tangent space to the space of algebraic cycles on a smooth algebraic variety\n(2005)\n.\nHere are some comments by a reviewer which illustrate well Griffiths' style and approach to mathematics:-\nCertainly to a greater degree than other mathematicians of his standing, he has often opted for writing in a way that was expository, sometimes for his audience, but sometimes even for himself .... He writes ... of his conviction that one could learn as much or more from a clear proof or calculation in an insightful example or a meaningful case, as from a proof of the most general case one is capable of proving. ... At times\n[\nGriffiths\n]\nrefers to the style of a paper as an \"essay\", allowing for a more discursive treatment of his subject. He even refers to the\n1976\npaper \"Variations on a theme of Abel\" as \"the mathematical analogue of a historical novel\"!\nSimilar comments are made about books. For example H Jacobowitz, reviewing\nDifferential systems and isometric embeddings\nwrites:-\nThis book is a model of serious expository writing. ... Results are sometimes stated under mildly restrictive hypotheses in order to have clean statements, and technical details are often omitted. This makes for a crisp, attractive presentation.\nThere are other important aspects of Griffiths' career which we must say a little more about. One is his twelve years as Director of the Institute for Advanced Study. James D Wolfensohn, Chairman of the Board of Trustees of the Institute for Advanced Study, said when announcing that Griffiths would step down:-\nPhillip has been an exceptionally effective Director of the Institute since\n1991\n, and he will be greatly missed. We all have enormous respect for him personally and for his accomplishments. His tenure has been marked both by his ability to guide this institution in productive and exciting new directions, and his ability to further strengthen the unique opportunities the Institute offers to scholars from all over the world. ... Griffiths served as a key figure in the creation in\n1998\nof the Millennium Science Initiative\n[\nwhich\n]\nworks to strengthen the science and technology capacity of developing nations through integrated projects of research and training planned and driven by local scientists. Currently, initiatives in Chile, Brazil, and Mexico are underway, and initiatives are being planned in sub-Saharan Africa and Vietnam.\nGriffiths has served, or still serves, as an editor for seven major journals: Advances in Function Theory; Annals of Math. Studies; Annals of Mathematics; Selecta Mathematica; Duke Mathematical Journal; Compositio Mathematica; and the Journal of Differential Geometry.\nHe has received a host of honours including election to the\nNational Academy of Sciences\n(1979)\n, the National Science Board\n(1991)\n, the\nAmerican Academy of Arts and Sciences\n(1995)\n, the American Philosophical Society\n(1996)\n, the Third World Academy of Sciences\n(2001)\n, and the\nAccademia Nazionale dei Lincei\n(2001)\n. He was awarded the LeRoy P Steele Prize from the\nAmerican Mathematical Society\n(1971)\n, the Dannie Heineman Prize from the\nGöttingen Academy of Sciences\n(1979)\n, and the Brazilian Order of Scientific Merit\n(\nGrand-Cruz\n)\nin\n2002\n. He has received honorary degrees from Wake Forest University\n(1973)\n, Angers University in France\n(1979)\n, University of Peking\n(1983)\n, and the University of Oslo\n(2002)\n. Griffiths has received many more honours which we will have to omit through lack of space, but we should mention his role as Secretary of the\nInternational Mathematical Union\nfrom\n1999\nto\n2006\n."
}