{
  "nome_completo": "Pierre Alphonse Laurent",
  "nome_curto": "Pierre Laurent",
  "ano_nascimento": "1813",
  "ano_morte": "1854",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Laurent_Pierre/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Pierre Laurent\n's parents were Pierre Michel Laurent\n(1769\n-\n1841)\nand Eleanor Cheshire\n(1778\n-\n1840)\n. Pierre Michel Laurent was born on\n22\nMarch\n1769\nin Nancy, France, to Albert Laurent, a Professor of Mathematics at Nancy, and his wife Elisabeth Mültzer. He left Nancy at age\n18\nand served in the Navy as an apprentice on a ship to Haiti. He served on many different Navy ships until he landed in Southampton, England, in\n1794\n. The French Revolution meant that France was in turmoil so he decided to remain in Southampton. There he became a teacher of the French language and, on\n15\nDecember\n1800\n, he married Eleanor Cheshire in St Michael's. Eleanor, a daughter of William Cheshire and Mary North, had been born on\n17\nApril\n1778\nin Minstead, a small village in Hampshire. Pierre Michel and Eleanor Laurent had four children Pierre Edmond Laurent, Camille Claire Laurent, Suzanne Zéli Laurent and Adèle Laurent while living in England. Then either near the end of\n1812\nor early\n1813\nthe family moved to France arriving at Morlaix from where they journeyed on to make contact with Pierre Michel's sisters living at La Fère in Aisne, Picardy. The family then moved to Paris and Eleanor, who had been brought up as a Protestant, was baptised as a Roman Catholic in Saint Sulpice church. Pierre Alphonse, the subject of this biography, was born in Paris in\n1813\n. By the end of March\n1814\n, France had suffered military defeat, Paris was occupied by Austrian and Prussian troops so, in April\n1814\n, Pierre Michel and Eleanor Laurent and their five children returned to England. After a short stay in Southampton, they settled in Cheltenham, Gloucestershire. Three more children, including Pierre Michel Albert Laurent and Juste Pierre Laurent, were added to the family. These three were all born in Cheltenham, the last child being Juste Pierre, born in\n1821\n, who went on to become a famous locomotive designer.\nAfter about ten years in Cheltenham, England, the family returned to France. Pierre Alphonse entered the École Polytechnique in Paris in\n1830\n, in the year of the July Revolution which forced King Charles X from the throne and led to the rule of Louis-Philippe. Laurent graduated from the École Polytechnique in\n1832\n, being one of the best students in his year, and entered the engineering corps as second lieutenant. He then attended the École d'Application at Metz until he was sent to Algeria.\nUp until\n1830\nAlgeria was an autonomous province of the Ottoman Empire. France had in the couple of years up to\n1830\ntried to control the country using various political moves and a naval blockade. However they decided early in\n1830\nto invade and French troops landed in Algeria on\n5\nJuly\n1830\n. They won quick victories since the Algerian people detested their rulers and there was no united forces to oppose the French invasion. However the July Revolution in France led to a period when desire for foreign conquests vanished but they retained the foothold in Algeria that they had established. Two leaders, Ahmad Bey and Abdelkader, established themselves rallying support against the French invaders. The French decided to send forces against these resistance leaders and Laurent took part in two of these expeditions. One was to Tlemcen, in northwestern Algeria near the Moroccan border, the other was the Tafna expedition against Abdelkader which led to the French signing the Treaty of Tafna in\n1837\n.\nOn\n11\nFebruary\n1840\n, Laurent's mother, who had been living at\n14\nrue du Regard, Paris, died. Her name appears in the French version of Eléonore-Françoise Chesser on her death certificate. Laurent's father outlived his wife by about a year and Pierre Michel Laurent died in Paris on\n25\nFebruary\n1841\n. Laurent had returned to France from Algeria around\n1840\nand spent six years directing operations for the enlargement of the port of Le Havre on the English Channel coast. Rouen had been the main French port up to the nineteenth century but the hydraulic construction projects on which Laurent worked in Le Havre turned it into France's main seaport. It is clear that Laurent was a good engineer, putting his deep theoretical knowledge to good practical use. Jean Itard writes\n[\n1\n]\n:-\nHis superiors considered him a promising officer; they admired his sure judgement and his extensive practical training.\nIn Hautmont, in north west France near the Belgium border, on\n18\nOctober\n1841\n, Laurent married Palmyre Angélique Bernardine Depreux\n(\nborn\n1821)\n, the daughter of Jean Baptiste Depreux and Adrienne Leroy. Jean Baptiste Depreux was a farmer and the owner of hotels in Hautmont and Briastre, about\n45\nkm west of Hautmont. Laurent and his wife had three sons: Pierre Georges Laurent\n(1843\n-\n1914)\n, Charles Pierre Laurent\n(1845\n-\n1901)\n, and Émile Laurent. Pierre Georges, born in the Military District of Le Havre, was educated in the schools in Avesnes and Douai, studied in Paris at the École Polytechnique from\n1861\nto\n1863\nand became a military engineer.\nIt was while Laurent was working on the construction project at Le Havre that he began to write his first mathematical papers. He submitted a memoir for the Grand Prix of the\nAcademy of Sciences\nof\n1842\n, unfortunately after the final date for submission in\n1843\n. The topic proposed was\n(\nsee for example\n[\n1\n]\n)\n:-\nFind the limiting equations that must be joined to the indefinite equations in order to determine completely the maxima and minima of multiple integrals.\nCauchy\nreported on Laurent's entry\nMémoire sur le calcul des variations\nⓉ\n(\nMemoir on the calculus of variations\n)\n, which contains the Laurent series for a complex function, on\n20\nMay\n1843\n. Laurent's theorem for a complex function generalises\nTaylor\n's theorem\n[\n6\n]\n:-\nIn modern terminology the theorem defined in an annulus\n(\na ring bounded by two concentric circles\n)\nand on its boundary can be developed in a general, power series in increasing and decreasing powers of the variable. There exist functions, such as certain\nBessel functions\n, which cannot be expanded into\nTaylor series\n, and Laurent's theorem would be applicable to these functions.\nBeing late, the memoir was never seriously considered for the Grand Prix, which was won by Pierre Frédéric Sarrus\n(1798\n-\n1861)\n, a mathematician working at Strasbourg, with\nCharles Delaunay\n's entry receiving an honourable mention, but\nCauchy\nand\nLiouville\nwere asked to review Laurent's paper and consider it for publication. They proposed that Laurent's memoir should be approved and published in the\nRecueil des savants étrangers\nⓉ\n(\nReports of foreign scientists\n)\n. The\nAcademy of Sciences\npublished the entries of Sarrus and\nDelaunay\nbut they ignored\nCauchy\nand\nLiouville\n's recommendation concerning Laurent and his memoir was not published.\nCauchy\n, however, in rather typical fashion, had put the\nAcademy of Sciences\nin a difficult position by claiming that he had priority over Laurent\n[\n2\n]\n:-\n... at the next meeting of the\nAcademy\nCauchy\nclaimed that his papers\n[\nwritten in\n1837]\ngave him priority over Laurent in this matter. Only on\n30\nOctober did he present his\n(\nand\nLiouville\n's\n)\nreport on Laurent's memoir to the\nAcademy\n.\nCauchy\nthen went on to argue that the main theorem in Laurent's paper could be deduced from a theorem he\n(\nCauchy\n)\nhad stated in\n1840\n. To support his claims\nCauchy\nadded to the report a note of his own to show that \"the easiest way\" to obtain Laurent's theorem was by reformulating the results in his\n1840\npaper. ... Sadly,\nCauchy\n's less than generous response, coupled with his extraordinary rapidity of thought, was to prove typical of the way\nCauchy\nwould take the work of others as an opportunity to promote his own.\nGiven\nCauchy\n's attempt to claim the result of Laurent's paper it is not surprising the\nAcademy of Sciences\nchose not to publish it but, despite this, the theorem and series are named for Laurent. However, even if we ignore\nCauchy\n's attempt to claim the theorem, Laurent was not the first to prove the result we today call Laurent's theorem. In fact in\n1841\n, while at Münster,\nKarl Weierstrass\nproved this theorem in the paper\nDarstellung einer analytischen Functionen einer complexen Veränderlichen, deren absoluter Betrag zwischen zwei gegeben Grenzen leigt\nⓉ\n(\nDepicting an analytic function of a complex variable whose absolute magnitude lies between two given limits\n)\n. However, he did not try to publish the paper at this time and it only appeared as a published paper in\nWeierstrass\n's collected works of\n1894\n.\nA second paper by Laurent,\nExtension du théorème de M Cauchy relatif à la convergence du développement d'une fonction suivant les puissances ascendantes de la variable\nⓉ\n(\nExtension of Cauchy's theorem on the convergence of the expansion of a function according to the ascending powers of the variable\n)\n, submitted to the\nAcademy of Sciences\naround the same time was also considered by\nCauchy\n. This paper presented an extension of one of\nCauchy\n's theorems and again\nCauchy\nproposed that Laurent's memoir should be approved and published in the\nRecueil des savants étrangers\nⓉ\n(\nReports of foreign scientists\n)\n.\nCauchy\n's report quotes first his own theorem that Laurent had extended:-\nLet x designate a real or imaginary variable; a real or imaginary function of x will be developable in a convergent series ordered according to the ascending powers of this variable, while the modulus of the variable will preserve a value less than the smallest of the values for which the function or its derivative ceases to be finite or continuous.\nCauchy\nthen quoted Laurent's extension:-\nLet x designate a real or imaginary variable; a real or imaginary function of x can be represented by the sum of two convergent series, one ordered according to the integral and ascending powers of x, and the other according to the integral and descending powers of x; and the modulus of x will take on a value in an interval within which the function or its derivative does not cease to be finite and continuous.\nAgain the\nAcademy of Sciences\ndecided not to publish the work and it has been lost and is now only known through\nCauchy\n's report from which we quoted above.\nAfter this Laurent, disappointed that his papers had not been accepted for publication, decided that he had better change the topic of his research. He began to study the theory of light waves, in particular examining the theory of polarisation. He published a number of papers on the topic, for example a number of notes entitled\nNote sur la théorie mathématique de la lumière\nⓉ\n(\nNote on the mathematical theory of light\n)\nand papers such as\nObservations sur les ondes liquides, et remarques relative aux assimilations que l'on a faites de ces ondes aux ondulations lumineuses\nⓉ\n(\nObservations on the waves in liquid, and remarks concerning assimilation which was made of these waves to light waves\n)\n. He was critical of some of\nCauchy\n's methods of attacking these problems which, as one might expect, produced a strong response from\nCauchy\n. He also published on sound waves in papers such as\nSur la propagation des ondes sonores\nⓉ\n(\nOn the propagation of sound waves.\n)\n.\nFor a list of papers by Laurent, see\nTHIS LINK\n.\nCauchy proposed him for a vacant position in the\nAcademy of Sciences\nin\n1846\n. The position of corresponding member had become vacant since\nCarl Jacobi\n, who had held that position, was promoted to foreign associate member. However he was not elected and soon after this he was promoted to major and sent to Paris to become a member of a committee set up to look at the problems of fortification. He continued to undertake research into applied mathematical topics.\nLaurent died at the young age of\n41\nprobably as a consequence of overwork over many years when he was carrying out a demanding job yet producing a large number of mathematical papers at the same time. After his death his widow arranged for two more of his memoirs to be presented to the\nAcademy of Sciences\n.\nExamen de la théorie de la lumière dans le système des ondes\nⓉ\n(\nReview of the theory of light in the wave system\n)\nwas considered by\nCauchy\nwho proposed that Laurent's memoir should be approved and published in the\nRecueil des savants étrangers\nⓉ\n(\nReports of foreign scientists\n)\nbut again it was never published. The second,\nMémoire sur la théorie des imaginaires, sur l'équilibre des températures et sur l'équilibre d'élasticité\nⓉ\n(\nMemoir on the theory of imaginaries, the temperature balance and the balance of elasticity,\n)\n, was published in\nJournal de l'École Polytechnique\nbut it did not appear until\n1863\n."
}