{
  "nome_completo": "Pierre de Fermat",
  "nome_curto": "Pierre Fermat",
  "ano_nascimento": "1601",
  "ano_morte": "1665",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fermat/",
  "lugar_nascimento": "Beaumont-de-Lomagne, France",
  "lugar_morte": "Castres, France",
  "biografia": "Pierre Fermat\n's father was a wealthy leather merchant and second consul of Beaumont- de- Lomagne. There is some dispute\n[\n14\n]\nabout the date of Pierre's birth as given above, since it is possible that he had an elder brother\n(\nwho had also been given the name Pierre\n)\nbut who died young. Pierre had a brother and two sisters and was almost certainly brought up in the town of his birth. Although there is little evidence concerning his school education it must have been at the local Franciscan monastery.\nHe attended the University of Toulouse before moving to Bordeaux in the second half of the\n1620\ns. In Bordeaux he began his first serious mathematical researches and in\n1629\nhe gave a copy of his restoration of\nApollonius\n's\nPlane loci\nto one of the mathematicians there. Certainly in Bordeaux he was in contact with\nBeaugrand\nand during this time he produced important work on maxima and minima which he gave to Étienne d'Espagnet who clearly shared mathematical interests with Fermat.\nFrom Bordeaux Fermat went to Orléans where he studied law at the University. He received a degree in civil law and he purchased the offices of councillor at the parliament in Toulouse. So by\n1631\nFermat was a lawyer and government official in Toulouse and because of the office he now held he became entitled to change his name from Pierre Fermat to\nPierre de Fermat.\nFor the remainder of his life he lived in Toulouse but as well as working there he also worked in his home town of Beaumont-de-Lomagne and a nearby town of Castres. From his appointment on\n14\nMay\n1631\nFermat worked in the lower chamber of the parliament but on\n16\nJanuary\n1638\nhe was appointed to a higher chamber, then in\n1652\nhe was promoted to the highest level at the criminal court. Still further promotions seem to indicate a fairly meteoric rise through the profession but promotion was done mostly on seniority and the plague struck the region in the early\n1650\ns meaning that many of the older men died. Fermat himself was struck down by the plague and in\n1653\nhis death was wrongly reported, then corrected:-\nI informed you earlier of the death of Fermat. He is alive, and we no longer fear for his health, even though we had counted him among the dead a short time ago.\nThe following report, made to Colbert the leading figure in France at the time, has a ring of truth:-\nFermat, a man of great erudition, has contact with men of learning everywhere. But he is rather preoccupied, he does not report cases well and is confused.\nOf course Fermat was preoccupied with mathematics. He kept his mathematical friendship with\nBeaugrand\nafter he moved to Toulouse but there he gained a new mathematical friend in\nCarcavi\n. Fermat met\nCarcavi\nin a professional capacity since both were councillors in Toulouse but they both shared a love of mathematics and Fermat told\nCarcavi\nabout his mathematical discoveries.\nIn\n1636\nCarcavi\nwent to Paris as royal librarian and made contact with\nMersenne\nand his group.\nMersenne\n's interest was aroused by\nCarcavi\n's descriptions of Fermat's discoveries on falling bodies, and he wrote to Fermat. Fermat replied on\n26\nApril\n1636\nand, in addition to telling\nMersenne\nabout errors which he believed that\nGalileo\nhad made in his description of free fall, he also told\nMersenne\nabout his work on spirals and his restoration of\nApollonius\n's\nPlane loci\n. His work on spirals had been motivated by considering the path of free falling bodies and he had used methods generalised from\nArchimedes\n' work\nOn spirals\nto compute areas under the spirals. In addition Fermat wrote:-\nI have also found many sorts of analyses for diverse problems, numerical as well as geometrical, for the solution of which\nViète\n's analysis could not have sufficed. I will share all of this with you whenever you wish and do so without any ambition, from which I am more exempt and more distant than any man in the world.\nIt is somewhat ironical that this initial contact with Fermat and the scientific community came through his study of free fall since Fermat had little interest in physical applications of mathematics. Even with his results on free fall he was much more interested in proving geometrical theorems than in their relation to the real world. This first letter did however contain two problems on maxima which Fermat asked\nMersenne\nto pass on to the Paris mathematicians and this was to be the typical style of Fermat's letters, he would challenge others to find results which he had already obtained.\nRoberval\nand\nMersenne\nfound that Fermat's problems in this first, and subsequent, letters were extremely difficult and usually not soluble using current techniques. They asked him to divulge his methods and Fermat sent\nMethod for determining Maxima and Minima and\nTangents\nto Curved Lines\n, his restored text of\nApollonius\n's\nPlane loci\nand his algebraic approach to geometry\nIntroduction to Plane and Solid Loci\nto the Paris mathematicians.\nHis reputation as one of the leading mathematicians in the world came quickly but attempts to get his work published failed mainly because Fermat never really wanted to put his work into a polished form. However some of his methods were published, for example\nHérigone\nadded a supplement containing Fermat's methods of maxima and minima to his major work\nCursus mathematicus\nⓉ\n(\nA course of mathematics\n)\n. The widening correspondence between Fermat and other mathematicians did not find universal praise.\nFrenicle de Bessy\nbecame annoyed at Fermat's problems which to him were impossible. He wrote angrily to Fermat but although Fermat gave more details in his reply,\nFrenicle de Bessy\nfelt that Fermat was almost teasing him.\nHowever Fermat soon became engaged in a controversy with a more major mathematician than\nFrenicle de Bessy\n. Having been sent a copy of\nDescartes\n'\nLa Dioptrique\nⓉ\n(\nDioptrics\n)\nby\nBeaugrand\n, Fermat paid it little attention since he was in the middle of a correspondence with\nRoberval\nand\nÉtienne Pascal\nover methods of integration and using them to find centres of gravity.\nMersenne\nasked him to give an opinion on\nLa Dioptrique\nⓉ\n(\nDioptrics\n)\nwhich Fermat did, describing it as\ngroping about in the shadows.\nHe claimed that\nDescartes\nhad not correctly deduced his law of\nrefraction\nsince it was inherent in his assumptions. To say that\nDescartes\nwas not pleased is an understatement.\nDescartes\nsoon found reason to feel even more angry since he viewed Fermat's work on maxima, minima and tangents as reducing the importance of his own work\nLa Géométrie\nwhich\nDescartes\nwas most proud of and which he sought to show that his\nDiscours de la méthode\nⓉ\n(\nDiscourse on Method\n)\nalone could give.\nDescartes\nattacked Fermat's method of maxima, minima and tangents.\nRoberval\nand\nÉtienne Pascal\nbecame involved in the argument and eventually so did\nDesargues\nwho\nDescartes\nasked to act as a referee. Fermat proved correct and eventually\nDescartes\nadmitted this writing:-\n... seeing the last method that you use for finding tangents to curved lines, I can reply to it in no other way than to say that it is very good and that, if you had explained it in this manner at the outset, I would have not contradicted it at all.\nDid this end the matter and increase Fermat's standing? Not at all since\nDescartes\ntried to damage Fermat's reputation. For example, although he wrote to Fermat praising his work on determining the tangent to a cycloid\n(\nwhich is indeed correct\n)\n,\nDescartes\nwrote to\nMersenne\nclaiming that it was incorrect and saying that Fermat was inadequate as a mathematician and a thinker.\nDescartes\nwas important and respected and thus was able to severely damage Fermat's reputation.\nThe period from\n1643\nto\n1654\nwas one when Fermat was out of touch with his scientific colleagues in Paris. There are a number of reasons for this. Firstly pressure of work kept him from devoting so much time to mathematics. Secondly the Fronde, a civil war in France, took place and from\n1648\nToulouse was greatly affected. Finally there was the plague of\n1651\nwhich must have had great consequences both on life in Toulouse and of course its near fatal consequences on Fermat himself. However it was during this time that Fermat worked on\nnumber theory\n.\nFermat is best remembered for this work in number theory, in particular for\nFermat's Last Theorem\n. This theorem states that\nx\nn\n+\ny\nn\n=\nz\nn\nx^{n} + y^{n} = z^{n}\nx\nn\n+\ny\nn\n=\nz\nn\nhas no non-zero integer solutions for\nx\n,\ny\nx, y\nx\n,\ny\nand\nz\nz\nz\nwhen\nn\n>\n2\nn > 2\nn\n>\n2\n. Fermat wrote, in the margin of\nBachet\n's translation of\nDiophantus\n's\nArithmetica\nI have discovered a truly remarkable proof which this margin is too small to contain.\nThese marginal notes only became known after Fermat's son Samuel published an edition of\nBachet\n's translation of\nDiophantus\n's\nArithmetica\nwith his father's notes in\n1670\n.\nIt is now believed that Fermat's 'proof' was wrong although it is impossible to be completely certain. The truth of Fermat's assertion was proved in June\n1993\nby the British mathematician\nAndrew Wiles\n, but\nWiles\nwithdrew the claim to have a proof when problems emerged later in\n1993\n. In November\n1994\nWiles\nagain claimed to have a correct proof which has now been accepted.\nUnsuccessful attempts to prove the theorem over a\n300\nyear period led to the discovery of commutative ring theory and a wealth of other mathematical discoveries.\nFermat's correspondence with the Paris mathematicians restarted in\n1654\nwhen\nBlaise Pascal\n,\nÉtienne Pascal\n's son, wrote to him to ask for confirmation about his ideas on\nprobability\n.\nBlaise Pascal\nknew of Fermat through his father, who had died three years before, and was well aware of Fermat's outstanding mathematical abilities. Their short correspondence set up the theory of probability and from this they are now regarded as joint founders of the subject. Fermat however, feeling his isolation and still wanting to adopt his old style of challenging mathematicians, tried to change the topic from probability to number theory.\nPascal\nwas not interested but Fermat, not realising this, wrote to\nCarcavi\nsaying:-\nI am delighted to have had opinions conforming to those of M\nPascal\n, for I have infinite esteem for his genius... the two of you may undertake that publication, of which I consent to your being the masters, you may clarify or supplement whatever seems too concise and relieve me of a burden that my duties prevent me from taking on.\nHowever\nPascal\nwas certainly not going to edit Fermat's work and after this flash of desire to have his work published Fermat again gave up the idea. He went further than ever with his challenge problems however:-\nTwo mathematical problems posed as insoluble to French, English, Dutch and all mathematicians of Europe by Monsieur de Fermat, Councillor of the King in the Parliament of Toulouse.\nHis problems did not prompt too much interest as most mathematicians seemed to think that number theory was not an important topic. The second of the two problems, namely to find all solutions of\nN\nx\n2\n+\n1\n=\ny\n2\nNx^{2} + 1 = y^{2}\nN\nx\n2\n+\n1\n=\ny\n2\nfor\nN\nN\nN\nnot a square, was however solved by\nWallis\nand\nBrouncker\nand they developed\ncontinued fractions\nin their solution.\nBrouncker\nproduced\nrational\nsolutions which led to arguments.\nFrenicle de Bessy\nwas perhaps the only mathematician at that time who was really interested in number theory but he did not have sufficient mathematical talents to allow him to make a significant contribution.\nFermat posed further problems, namely that the sum of two cubes cannot be a cube\n(\na special case of Fermat's Last Theorem which may indicate that by this time Fermat realised that his proof of the general result was incorrect\n)\n, that there are exactly two integer solutions of\nx\n2\n+\n4\n=\ny\n3\nx^{2} + 4 = y^{3}\nx\n2\n+\n4\n=\ny\n3\nand that the equation\nx\n2\n+\n2\n=\ny\n3\nx^{2} + 2 = y^{3}\nx\n2\n+\n2\n=\ny\n3\nhas only one integer solution. He posed problems directly to the English. Everyone failed to see that Fermat had been hoping his specific problems would lead them to discover, as he had done, deeper theoretical results.\nAround this time one of\nDescartes\n' students was collecting his correspondence for publication and he turned to Fermat for help with the Fermat -\nDescartes\ncorrespondence. This led Fermat to look again at the arguments he had used\n20\nyears before and he looked again at his objections to\nDescartes\n' optics. In particular he had been unhappy with\nDescartes\n' description of refraction of light and he now settled on a principle which did in fact yield the sine law of refraction that\nSnell\nand\nDescartes\nhad proposed. However Fermat had now deduced it from a fundamental property that he proposed, namely that light always follows the shortest possible path. Fermat's principle, now one of the most basic properties of optics, did not find favour with mathematicians at the time.\nIn\n1656\nFermat had started a correspondence with\nHuygens\n. This grew out of\nHuygens\ninterest in probability and the correspondence was soon manipulated by Fermat onto topics of number theory. This topic did not interest\nHuygens\nbut Fermat tried hard and in\nNew Account of Discoveries in the Science of Numbers\nsent to\nHuygens\nvia\nCarcavi\nin\n1659\n, he revealed more of his methods than he had done to others.\nFermat described his method of infinite descent and gave an example on how it could be used to prove that every\nprime\nof the form\n4\nk\n+\n1\n4k + 1\n4\nk\n+\n1\ncould be written as the sum of two squares. For suppose some number of the form\n4\nk\n+\n1\n4k + 1\n4\nk\n+\n1\ncould not be written as the sum of two squares. Then there is a smaller number of the form\n4\nk\n+\n1\n4k + 1\n4\nk\n+\n1\nwhich cannot be written as the sum of two squares. Continuing the argument will lead to a contradiction. What Fermat failed to explain in this letter is how the smaller number is constructed from the larger. One assumes that Fermat did know how to make this step but again his failure to disclose the method made mathematicians lose interest. It was not until\nEuler\ntook up these problems that the missing steps were filled in.\nFermat is described in\n[\n9\n]\nas\nSecretive and taciturn, he did not like to talk about himself and was loath to reveal too much about his thinking. ... His thought, however original or novel, operated within a range of possibilities limited by that\n[1600\n-\n1650]\ntime and that\n[\nFrance\n]\nplace.\nCarl B Boyer, writing in\n[\n2\n]\n, says:-\nRecognition of the significance of Fermat's work in analysis was tardy, in part because he adhered to the system of mathematical symbols devised by\nFrançois Viète\n, notations that\nDescartes\n' \"Géométrie\" had rendered largely obsolete. The handicap imposed by the awkward notations operated less severely in Fermat's favourite field of study, the theory of numbers, but here, unfortunately, he found no correspondent to share his enthusiasm."
}