{
  "nome_completo": "Pierre de Carcavi",
  "nome_curto": "Pierre de Carcavi",
  "ano_nascimento": "1600",
  "ano_morte": "1684",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Carcavi/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Paris, France",
  "biografia": "The year of\nPierre de Carcavi\n's birth is uncertain, the two most favoured dates being\n1600\nand\n1603\n. The\nAcadémie des Sciences\ngives his date of birth as\n1603\nbut there seems to be a slight preference among historians for the\n1600\ndate. His parents were Jean de Carcavi, a banker from Cahors, and Françoise Sablé. Jean de Carcavi was an important man, being Receiver General of the districts of Languedoc, Guyenne and Lyonnais. Although no record exists proving that Pierre received a university education, one can deduce from the career he embarked on that he must have studied law.\nJean de Carcavi set his son up as a counsellor to the parliament of Toulouse in\n1632\nand he remained there until\n1636\n. In fact he first met\nPierre de Fermat\nin\n1632\nwhen they were both members of the Parliament in Toulouse and they remained close friends. Carcavi clearly was fascinated by mathematics before meeting\nFermat\n, but contact with such an inspirational mathematician fired Carcavi's interest even further.\nFermat\nhad already built up a correspondence with the leading mathematicians in France and Carcavi was encouraged by him to correspond with\nDescartes\n,\nRoberval\nand\nTorricelli\n. In\n1636\nCarcavi, with the financial help of his father, bought an office of counsellor in the Grand Conseil in Paris. Clearly he had aspirations to improve his position which his friend\nFermat\ndid not possess. The friendship remained and\nFermat\n, clearly having considerable respect for Carcavi as a mathematician, sent details of his mathematical discoveries to him in Paris. For example, in the autumn of\n1637\nFermat\nsent Carcavi\nIsagoge ad locos planos et solidos\nⓉ\n(\nIntoduction to plane loci and solids\n)\n, an introduction to analytic geometry that he had written in the previous year before the publication of\nDescartes\n'\nGéométrie\n. In Paris, Carcavi was able to have personal contact with\nRoberval\n, with whom he had already corresponded, and with\nMersenne\nand the young\nBlaise Pascal\n. He also corresponded with\nGalileo\n(\nfor example they discussed falling bodies in a letter of\n5\nJune\n1637)\n,\nTorricelli\nand\nDescartes\n, and he played an important role in transferring information from one to the other. He made many suggestions during this correspondence which were later developed and incorporated in the papers of the other mathematicians.\nCarcavi had met Louise de Chaponay in Lyon, and they wished to marry but Louise's parents, Humbert de Chaponay and Eléanore de Villares, did not approve. This did not stop the young couple, however, and in February\n1638\nthey eloped and married. On\n10\nMarch, Humbert de Chaponay and his wife disinherited their daughter Louise. Humbert de Chaponay was an influential man, holding important positions including Intendant of Justice, Police and Finances in Lyon as well as being a landowner of considerable wealth. It appears that Carcavi persuaded Humbert de Chaponay to recognise the marriage, for he did so on\n26\nAugust\n1638\n. This document states that Carcavi's father had paid off the outstanding debt on his son's purchase of the office of counsellor in Paris, and made his son an annual allowance. Louise's parents made her a small annual allowance; despite the reconciliation, her parents had still only made her a nominal allowance. There is confusion in the literature over Carcavi's marriage, and this is perfectly understandable, since Carcavi himself gave false information saying he had married beneath himself to a penniless girl, presumably to hide the embarrassment of the actual situation.\nOnce over the difficulties of his marriage, Carcavi settled down to a few good years in Paris during which he fully participated in the discussions between leading mathematicians gathered round\nMarin Mersenne\n[\n2\n]\n:-\nHe was especially close to\nRoberval\n, whose well-known scepticism towards\nDescartes\n' work meant that\nDescartes\n, who knew and corresponded with Carcavi, regarded Carcavi with a somewhat cautious eye.\nFor example, in\n1649\nCarcavi wrote to\nDescartes\ntelling him of the publication of\nPascal\n's barometer experiments. He also explained to\nDescartes\nthe objections\nRoberval\nhad to his\nGeometrie\n.\nIn\n1648\n, however, hard times struck and he was forced to sell his office to pay for the debts of his father who had been declared bankrupt. Carcavi's situation was extremely difficult, being left without a career, little capital to fall back on, and all this at a time when there was considerable political and social unrest in France. In fact there was basically a civil war in France beginning in\n1648\nand lasting for around seven years. To make life even more difficult for Carcavi,\nMersenne\ndied in September\n1648\nand by this time Carcavi was buying and selling books in an attempt to earn some money to bring in much needed cash. It was never a long-term prospect and he was delighted to obtain a post with Roger du Plessis, the Duke of Liancourt. Carcavi was employed as an administrator making use of his legal experience. However, it was not simply Carcavi's legal experience which got him the job, for the Duke of Liancourt was gathering round him a number of scientists and academics. He worked for the Duke for fifteen years, until\n1663\n, but the most important contact he made in that time was with Jean-Baptiste Colbert.\nBefore looking at his contacts with Colbert, we note that during the years working for the Duke of Liancourt he continued his connections with the leading academics of France. He was an important member of the Adadémie de Montmor which began meeting at the Paris home of Henri-Louis Habert de Montmor in\n1654\n(\nbut was not formally founded until December\n1657)\n. Carcavi also continued to correspond with other leading mathematicians and, to a certain extent, took over\nMersenne\n's role. He corresponded with\nHuygens\nand acted as a go-between with him and\nFermat\n. As an example of the esteem he was held in we note his interaction with\nFermat\nand\nPascal\nduring his time working for the Duke of Liancourt.\nFermat\nsent many of his works to Carcavi after he moved to Paris in\n1636\n. In\n1650\nhe sent Carcavi a treatise entitled\nNovus secundarum et ulterioris radicum in analyticis usus\nⓉ\n(\nNew methods of finding roots for use in analysis\n)\n. This work contained the first known method of elimination and\nFermat\nwanted it published. Both\nPascal\nand Carcavi were asked to find a publisher for the work,\nFermat\nwriting to Carcavi on\n9\nAugust\n1654\n:-\nI was overjoyed to have had the same thoughts as those of M\nPascal\n, for I greatly admire his genius and I believe him capable of solving any problem he attempts. The friendship he offers is so dear to me and so precious that I shall not scruple to take advantage of it in publishing an edition of my Treatises. If it does not shock you, you could both help in bringing out this edition, and I suggest that you should be the editors; you could clarify or augment what seems too brief and thus relieve me of a care which my work prevents me from taking. I would like this volume to appear without my name even, leaving to you the choice of designation which would indicate the author, whom you could qualify simply as a friend.\nCarcavi approached\nHuygens\n, trying to publish the papers which\nFermat\nhad sent him. Unfortunately neither Carcavi nor\nPascal\nsucceeded and\nFermat\n's papers were never published. The most important of the letters that\nFermat\nsent Carcavi was dated\n14\nAugust\n1659\n. In it\nFermat\nclaimed to be able to prove the following five theorems by the method of infinite descent\n(\nsee\n[\n4\n]\n)\n:\n(1)\nThe area of a right-angled triangle whose sides are integers cannot be a square number.\n(2)\nThe equation\nx\n3\n+\ny\n3\n=\nz\n3\nx^{3} + y^{3} = z^{3}\nx\n3\n+\ny\n3\n=\nz\n3\nhas no solutions in integers.\n(3)\nThe equation\ny\n2\n+\n2\n=\nx\n3\ny^{2} + 2 = x^{3}\ny\n2\n+\n2\n=\nx\n3\nadmits no solutions in integers except\nx\n=\n3\n,\ny\n=\n5\nx = 3, y = 5\nx\n=\n3\n,\ny\n=\n5\n.\n(4)\nThe equation\ny\n2\n+\n4\n=\nx\n3\ny^{2} + 4 = x^{3}\ny\n2\n+\n4\n=\nx\n3\nadmits no solutions in integers except\nx\n=\n2\n,\ny\n=\n2\nx = 2, y = 2\nx\n=\n2\n,\ny\n=\n2\nand\nx\n=\n5\n,\ny\n=\n11\nx = 5, y = 11\nx\n=\n5\n,\ny\n=\n1\n1\n.\n(5)\nEach prime number of the form\np\n=\n4\nn\n+\n1\np = 4n + 1\np\n=\n4\nn\n+\n1\nis uniquely expressible as the sum of two squares.\nHe ends his letter to Carcavi as follows:-\nHere you have a summary account of my dreams on the subject of numbers. I have only written it because I fear I will lack the leisure to fully express myself and to lay out the entirety of my demonstrations and methods; in any case, this outline will serve the savants to be able to prove for themselves that which I have not filled out, especially if MM de Carcavi and\nFrenicle\ngive them some demonstrations by descent that I have sent them on the subject of some negative propositions. And perhaps posterity will be thankful for my having let them know that which the Ancients did not ...\nCarcavi's friendship with\nPascal\n, like his friendship with\nFermat\n, lasted over many years. In\n1658\nPascal\nsolved the problem of the area of any segment of the cycloid and the centre of gravity of any segment. He also solved the problems of the volume and surface area of the solid of revolution formed by rotating the cycloid about the x-axis.\nPascal\npublished a challenge under the name of Dettonville offering two prizes for solutions to these problems, and he lodged the prizes together with his own solutions with Carcavi. He asked Carcavi and\nRoberval\nto judge the solutions submitted showing his respect for Carcavi's mathematical abilities.\nPascal\nalso gave his calculating machine, the Pascaline, to Carcavi.\nThe contact with Colbert came through the Abbé Amable de Bourzéis, like Carcavi an intellectual working for the Duke of Liancourt, who was a close friend of Colbert. Colbert had been Cardinal Mazarin's personal assistant and before he died in\n1661\nMazarin recommended Colbert to Louis XIV to take over his influential role. Colbert wanted to employ someone to catalogue Cardinal Mazarin's library and Amable de Bourzéis recommended Carcavi who took on the role with exceptional enthusiasm. Colbert was very impressed and took Carcavi into his employment in\n1663\n. In that year Carcavi was appointed Custodian of the Royal Library, a post he held for\n20\nyears until shortly before his death. In this role Carcavi enjoyed a reputation for harshness and bitterness, and he was nicknamed the \"watchdog of the Royal Library\". With Colbert's approval, Carcavi bought en bloc several major collections in Paris rapidly increasing the size of the library. He did not restrict his collecting to the capital but extended his reach to the Provinces, then to North and South Europe, and soon to the Middle East. Manuscripts, prints, medals and engraved gems were amassed in the Royal Library. Carcavi's aim was to make the King's collection the best in the world, not just in restricted areas but across the whole spectrum of learning.\nCollecting all this learning into the library was certainly not just for its own sake. Colbert, taking advice from Carcavi whose views he greatly respected, wanted to improve the financial state of France and the scientific basis of the country, as well as the whole intellectual and artistic life of the country. The library would support all these aims. In particular Carcavi strongly supported Colbert's ideas to create the\nAcadémie des Sciences\ncovering as wide a range of topics as possible. Carcavi was elected to the\nAcadémie des Sciences\nin\n1666\n; his expertise as a mathematician qualified him for entry but he was also invaluable for the range of contacts he had. It was Carcavi who announced to the first meeting on\n22\nDecember\n1666\nthat the King would protect the new institution. In fact the Academy met at first in the Royal Library and Henry Oldenburg, secretary of the\nRoyal Society\nin London, mistakenly believed that Carcavi was president of the new Academy due to the contacts he made on its behalf. In fact he later asked Oldenburg to obtain \"every important book\" published in England for inclusion in the Royal Library. In\n1668\nCarcavi was appointed to a committee, along with\nHuygens\n,\nRoberval\n,\nAuzout\n,\nJean Picard\nand Gallois, to test whether the method of determining longitude, which had been submitted to the\nAcadémie des Sciences\nby a German, was practical.\nHere is an another example of Carcavi's influence. The Académie de Physique received a grant from Colbert in\n1670\n, having previously received several grants. Colbert was worried that the money was not being properly spent and asked Carcavi to investigate. Carcavi concluded that government money was indeed being wasted and, as a consequence of his report, the Académie de Physique was disbanded in\n1672\n. Hearing reports of\nLeibniz\n's invention of a calculating machine, he wrote to him in\n1671\nasking him to send the machine to him so that he might show it to Colbert. At this stage the machine had not been built but\nLeibniz\nmet with Carcavi when he visited Paris in\n1672\nand indeed his calculating machine was demonstrated to the\nAcadémie des Sciences\nin\n1675\n.\nColbert died in\n1683\nand François-Michel Le Tellier, marquis de Louvois, took over many of Colbert's duties, such as his role as Superintendent of Buildings. A rather strange episode followed with Louvois accusing Carcavi of stealing medals from the King's collection. There appears to have been no evidence against Carcavi who was dismissed with the official reason that \"extreme old age rendered him unable to perform his duties\". Carcavi was in his eighties and this official reason was almost certainly accurate; the charges brought by Louvois seem unbelievable. He died shortly after being dismissed.\nFinally, let us record Busard's comments on Carcavi's personality\n[\n1\n]\n:-\nCarcavi rendered great services to science. His polite and engaging manner brought him many friends ..."
}