{
  "nome_completo": "Pierre-Louis Lions",
  "nome_curto": "Pierre-Louis Lions",
  "ano_nascimento": "1956",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lions/",
  "lugar_nascimento": "Grasse, Alpes-Maritimes, France",
  "lugar_morte": null,
  "biografia": "Pierre-Louis Lions is the son of the famous mathematician\nJacques-Louis Lions\nand Andrée Olivier. He was born in Grasse, Alpes-Maritimes in the Provence- Alpes- Côte- d'Azur region of France, northwest of Cannes. It was the birthplace of his father and the town the family considered home, although at the time of his birth his father was a professor at the University of Nancy. Let us note that Grasse is not very far from Draguignan where Alain Connes, who won a\nFields Medal\n12\nyears before Lions won his Fields Medal, was born.\nWhen Pierre-Louis was six years old his father became a professor in Paris and the family lived there. He attended the Lycée Pasteur and then the Lycée Louis-le-Grand before entering the École Normale Supérieure in\n1975\n. Lions studied at the École Normale Supérieure from\n1975\nto\n1979\n. His thesis, supervised by H Brézis, was presented to the University of Pierre and Marie Curie\n(\nformally Paris VI when the University of Paris was split into thirteen separate universities in\n1970)\nand in\n1979\nhe received his Doctorat d'Etat es sciences. On\n1\nDecember\n1979\n, after he received his doctorate, Lions married Lila Laurenti. They have one child Dorian.\nFrom\n1979\nto\n1981\nLions held a research post at the Centre National de la Recherche Scientifique in Paris. Then, in\n1981\n, he was appointed professor at the University of Paris-Dauphine. While still holding this post he was attached to the Centre National de la Recherche Scientifique as Director of Research in\n1995\n. He has also held the position of Professor of Applied Mathematics at the École Polytechnique from\n1992\n.\nLions has made some of the most important contributions to the theory of nonlinear\npartial differential equations\nthrough the\n1980\ns and\n1990\ns. Evans, in\n[\n2\n]\n, writes:-\nHe has made truly fundamental discoveries cutting across many disciplines, pure and applied, and his publications are so numerous and varied as to defy easy classification. Keep in mind that there is in truth no central core theory of nonlinear\npartial differential equations\n, nor can there be. The sources of partial differential equations are so many - physical, probalistic, geometric etc. - that the subject is a confederation of diverse subareas, each studying different phenomena for different nonlinear partial differential equation by utterly different methods. Pierre-Louis Lions is unique in his unbelievable ability to transcend these boundaries and to solve pressing problems throughout the field.\nThe references quoted\n[\n2\n]\n,\n[\n3\n]\nand\n[\n4\n]\ndecribe some important aspects of Lions work which led to the award of a Fields Medal at the International Congress of Mathematicians in Zürich in\n1994\n. The first area of Lions work that is highlighted by both\n[\n1\n]\nand\n[\n3\n]\nis his work on \"viscosity solutions\" for nonlinear partial differential equations. The method was first introduced by Lions in joint work with M G Crandall in\n1983\nin which they studied\nHamilton\n-\nJacobi\nequations. Lions and others have since applied the method to a wide class of partial differential equations, the so-called \"fully nonlinear second order degenerate elliptic partial differential equations.\" The problem that arises is decribed in\n[\n2\n]\n:-\n... such nonlinear partial differential equation simply do not have smooth or even\nC\n1\nC^{1}\nC\n1\nsolutions existing after short times. ... The only option is therefore to search for some kind of \"weak\" solution. This undertaking is in effect to figure out how to allow for certain kinds of \"physically correct\" singularities and how to forbid others. ... Lions and Crandall at last broke open the problem by focusing attention on viscosity solutions, which are defined in terms of certain inequalities holding wherever the graph of the solution is touched on one side or the other by a smooth test function.\nAnother equally innovative piece of work by Lions was his work on the\nBoltzmann\nequation and other kinetic equations. The\nBoltzmann\nequation keeps track of interactions between colliding particles, not individually but in terms of a density. In\n1989\nLions, in joint work with DiPerma, was the first to give a rigorous solution with arbitrary initial data.\nAnother major contribution by Lions, in a long series of important papers, is to variational problems.\nVaradhan\n, speaking at the Congress of Mathematicians in Zürich in\n1994\nabout Lions' work\n[\n4\n]\n, said:-\nThere are many nonlinear PDEs that are\nEuler\nequations for variational problems. The first step in solving such equations by the variational method is to show that the extremum is attained. This requires some coercivity or compactness. If the quantity to be minimised has an \"energy\"-like term involving derivatives, then one has control on local regularity along a minimising sequence.\nLions's clever idea was to introduce \"concentration compactness\" techniques which look at energy concentrations and so avoid problems which occur when examining the minimising sequences without compactness. He introduced certain measures to handle the concentrations.\nLions has received many awards for his outstanding contributions to mathematics. He is a member of the French\nAcademy of Sciences\nand he was awarded prizes by the Academy, the Doistau-Blutet Foundation Prize in\n1986\nand the Ampère Prize in\n1992\n. He also received the IBM Prize in\n1987\nand the Philip Morris Prize in\n1991\n.\nIn addition to the\nParis Academy\n, Lions has been elected a member of the Naples Academy and the European Academy. He is also Chevalier of the Légion d'Honneur. He has been awarded an honorary doctorate from Heriot-Watt University in Edinburgh, Scotland. He is on the editorial board of around\n25\njournals world-wide.\nFinally let us note that Lions was awarded the Prix Thomson\n(2004)\nand, on behalf of his team, the Prix Institut de Finance Europlace\n(2003)\n.\nLions lists his hobbies as cinema and reading, and his favourite sports as rugby and swimming."
}