{
  "nome_completo": "Pietro Giannini",
  "nome_curto": "Pietro Giannini",
  "ano_nascimento": "1740",
  "ano_morte": "1810",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Giannini/",
  "lugar_nascimento": "Pescia, Pistoia (now Italy)",
  "lugar_morte": "Spain",
  "biografia": "We note that the biography we give below is based on the article by Nikolaj Zachary\n[\n14\n]\nwho used several Spanish articles and books.\nPietro Giannini\nwas born in Italy, in the municipality of Pescia, which today is in Pistoia but at the time of his birth was under the Gran Duchy of Tuscany. Little is known of his life in Italy, though many references to him in journals of the time called him 'abate', and so it can be assumed that he must have studied in a seminary. According to the usage of the word in the eighteenth century, it appears most likely that, in the case of Giannini, 'abate' indicates a person with an extensive religious education who had not been ordained. In Spain he was sometimes called 'abate', but in all of his books, in all the innumerable occasions in which his name is cited in the\nActas de Colegio\nⓉ\n(\nCollege minutes\n)\n(\nthe records of the institution at which he worked\n)\n, or on those few occasions that he appeared in Spanish journals of the time, he received the title of \"Don\"\n(\napproximately Esq\n)\nand not that of \"Padre\"\n(\nfather\n)\n, which was usually used for priests.\nRegarding his mathematical studies, we can be certain that he was a student of\nVincenzo Riccati\nat the College of San Francesco Saverio in Bologna. Giannini later cited\nVincenzo Riccati\nvarious times in his\nCurso Matemático\nⓉ\n(\nMathematical course\n)\nand continued to develop ideas introduced by\nVincenzo Riccati\n. It is likely that Giannini then studied with him in Bologna, where he resided until the dissolution of the Society of Jesus in\n1773\n. As well as being a disciple of\nVincenzo Riccati\n, it is known that Giannini corresponded with\nGiordano Riccati\n, since an oration at\nGiordano Riccati\n's funeral mentions Giannini as one of his correspondents. Between\n1773\nand\n1779\nhe worked as a teacher at the Academy of the Institute of Bologna, but his exact position at the Institute is unknown.\nWhen Giannini was born, the Grand Duchy of Tuscany was a dependency of Austria. Giannini dedicated the first book he published,\nOpuscula Mathematica\nⓉ\n(\nMathematical brochures\n)\n(1773)\n, to Grand Duke Leopold II, second child of Maria, who governed Tuscany from\n1765\nto\n1790\n.\nOpuscula Mathematica\nⓉ\n(\nMathematical brochures\n)\nwas published in\n1774\n, see\n[\n12\n]\n. It is composed of three distinct works. The first,\nDe Hydraulica\nⓉ\n(\nOn hydraulics\n)\n, is on hydraulics, and where he studies the movement of a fluid moving through an orifice using differential equations. In the second,\nDe cycloide contracta ac protracta\nⓉ\n(\nThe curtate and prolate cycloids\n)\n, he demonstrates the principle characteristics of curtate and prolate cycloids, using both methods of classical geometry and the calculus. In the third part,\nDe sectione determinata\nⓉ\n(\nOn determinate sections\n)\n, Giannini tries to recreate\nApollonius of Perga\n's\nDe Sectione Determinata\nⓉ\n(\nOn determinate sections\n)\n, starting from the commentaries of\nPappus of Alexandria\nin his\nCollection\nand exclusively using geometric methods known to the Ancient Greeks. Giannini demonstrated that he had a broad education in mathematics. This work was well received by the mathematical community in Italy. In\nNovelle letterarie pubblicate\nⓉ\n(\nLiterary short stories publications\n)\nin Firenze\n(1774)\n, the book is reviewed and a summary given of each of its three works. The article finishes by praising the author, saying, \"In these three works our author clearly demonstrates a mastery of the mathematical sciences.\"\nPietro Giannini moved from Italy to Segovia thanks, almost entirely, to Count Felice Gazzola, an Italian living in Spain who was working to build up the College of Segovia, and the Marquis Luigi Viviani Della Robbia, representative of the King of Naples in Florence. Gazzola wrote to Viviani during the summer of\n1774\nexplaining the problems he had in starting up the College of Segovia. In a letter dated the\n19\nJuly\n1774\n, Gazzola explained to him:-\nMy task is to find a candidate capable of ensuring that when the students leave and become officials, they apply themselves greatly to the sciences for the Ministry of the Artillery ... and do not behave as they have up to now, with a sad performance that has resulted in some terrible consequences. The theoretical base that the Artillery needs is in Physics, supported by experience with explosives, metals, woods, etc.; for the study of which there will be no lack of books in the library, nor of money for purchasing them to the taste of the professors.\nViviani informed him of the existence of Giannini, under the instruction of Countess Corsi. Gazzola wanted to know much more about Giannini and his work and so asked Viviani to send him all of Giannini's publications. Viviani then send him\nOpuscula Mathematica\nⓉ\n(\nMathematical brochures\n)\nand Gazzola studied it thoroughly, writing:-\nThe Duke of Losada has sent me the manuscript of his book and I certainly believe him\n[\nGiannini\n]\nto be well versed in the physical and mathematical sciences that would fit into the system of the Royal Artillery College; I recognise his ability.\nGazzola knew that Giannini would have much trouble being accepted at the College in Segovia because he was a foreigner. He also said to Viviani that integration would not be easy:-\nHe will need, however, to have patience and not expect to hit the ground running, because I will need much caution and work in order to give him a chance to give lectures in my College, given that all here are united in favour of ostracising foreigners, and pretend to praise the talent of the nationalists ... As a consequence, let him come as a friend to save me from the tedium of living always as though I were alone in a room, and speak no more of other aims.\nGazzola, convinced of Giannini's abilities, decided to pay for his journey from Florence to Segovia; he treated it as a personal initiative. Gazzola offered to let him sleep in his house and eat with him, unless he was unwell or had a social engagements. He guaranteed him an appropriate salary and that he would have no financial problems. He even committed to providing adequate funding to the College of Artillery so that Giannini would be able to do his work.\nSince he feared that the climate or the lack of social relations might scare Giannini off, Gazzola assured him that:-\n... if you dislike the climate or the country, or should my unhappy person become odious, you need do nothing more than say so ...\nClearly he was making every effort he could to attract Giannini to Spain. Referring to the problems that could come up for Giannini in Segovia, Gazzola's letters to Viviani also give us some information about Giannini's character:-\nYou said to me that he is reserved and misanthropic, and that he loves nothing other than his studies, and this is convenient, because coming from the earthly paradise that is Florence, he will not easily settle in Segovia. I, after all these years, have not yet grown accustomed to it. And that he is not a womaniser is also very good, because the women here are not like those of Florence, jolly, vivacious, full of verve and passion; they are dominant women and are very dangerous for a young man.\nWith Viviani's help, the Spanish consulate in Livorno, Silva, organised Giannini's travel to Spain. He went first by boat from Livorno or Genoa to Barcelona and then on to Madrid. Gazzola did pay, and did so by transferring money to the ambassador in Malta.\nThe journey was most likely made at the end of November or beginning of December of\n1774\n, because as soon as Giannini arrived, he wrote to Viviani saying how contented he was with the welcome he had received. From December\n1774\nto April\n1776\n, when Giannini was appointed as a professor in the Royal College, he must have stayed in Gazzola's house in Madrid, as there is no news of his activity in Spain. Then, on\n20\nApril\n1776\n, the\nGazetta Universale\nannounced:-\nTomorrow Mr Pietro Giannini, of Pescia in Tuscany, leaves for Segovia, to take up the professorship of Mathematics.\nGiannini used his time in Madrid to learn Spanish for when he arrived in Spain he could not speak any; yet, when he started his work in the College of Segovia in\n1776\n, he clearly demonstrated a great proficiency for Spanish; the language presented no difficulties. During his time in Madrid, he also wrote an article at the suggestion of Pedro Rodríguez, Count of Campomanes, about the best books from which to learn mathematics. It was published in the prologue of the Spanish edition of the French work by Alexandre Savérien,\nHistory of the Progress of Human Understanding\n(1775)\n. The prologue was written by the translator, Manuel Rubín de Celis, who produced a range of books looking at the progress of the mathematical sciences in Spain. In a footnote to this part of the prologue, Rubín de Celis notes that:-\nThe illustrious Sr D Pedro Rodriguez Campomanes recommended the following article by Mr Pedro Giannini, whose advice in this matter is very trustworthy because of his solid learning in Mathematics.\nThe article is relatively long, but the Giannini takes pains to make various recommendations, such as the requirement for special teachers in geometry, analysis, mechanics, astronomy, optics; saying also that:-\n... it would be sensible, effectively, for the State to have it its disposal men who are experts in these fields.\nHe then goes on to recommend various books to help the professors teach these subjects, including:\nEuclid\n's\nElements\n, advising\nIsaac Barrow\n's or\nRobert Simson\n's edition;\nCompendio delle sezioni coniche d'Apollonio\nⓉ\n(\nCompendium of the conic sections of Apollonius\n)\n, by\nGuido Grandi\n; Cartesian analysis by\nAlexis Claude Clairaut\nor\nMaria Gaetana Agnesi\n, particularly the latter as she also explains differential and integral calculus; mechanics from Jorge Juan's\nExamen Marítimo\nⓉ\n(\nMaritime examination\n)\n;\nLeçons élémentaires d'astronomie, géométrie et physique\nⓉ\n(\nElementary lessons in astronomy, geometry, and physics\n)\nby\nNicolas-Louis de Lacaille\n; and\nA Complete System of Optics\nby Robert Smith. Giannini must have written this essay shortly after arriving in Spain as it was entirely written in Latin, and his later works were always written in Spanish, as was typical of Spanish intellectuals of the time. It was probably Gazzola who put Giannini in contact with Rubín and Campomanes, as it appears very unlikely that Giannini would have been acquainted with the existing Spanish intellectual élite, and he demonstrated a particular lack of ability to form social relationships.\nAside from this article, there is virtually no evidence of Giannini's presence in Spain until, on\n6\nMarch\n1776\n, the Spanish king awarded, \"the appointing of Don Pedro Giannini in the College of Segovia as proposed by Gazzola, under the orders of the first professor of mathematics, with a salary of\n350\nReals per month.\" Giannini was also contracted on\n6\nMarch\n1776\nto give lectures in the College of Cadets. The\nGazzeta Universale\n, in its edition of\n30\nMarch, reported his appointment and, on\n20\nApril, it informed its readers he had left Madrid to take up his post in Segovia.\nWhen Giannini joined, he was given a salary and bonuses that were fairly sizeable for the time, but he was still paid significantly less than the previous first professor had been, and even less than the second professor of mathematics; this was likely due solely to the nationalism common at the time, though it is possible that there were other factors at play, for example, despite his primary income being from the College of Artillery, Giannini was by no means a soldier, and this made him stand out even among professors of the institution, who often had military careers before joining. Cipriano de Vimercati, Giannini's predecessor, was listed by the Academy of Marines as \"Captain of the Infantry, Lieutenant of the Artillery, and first professor of the Academy of the Artillery at Segovia.\". It is also unclear exactly to which position Giannini was named initially, as he is simply hired as a teacher, and even in the announcement that Vimercati was departing for the College of Marines, no new \"first professor\" is named, though Giannini is named as being \"interim head professor\" and the duties of the \"first professor\" seem to have been divided between Giannini and the \"second professor\" Baltasar Ferrer, though Ferrer performed more of the administrative duties, as Giannini was, first and foremost, a teacher.\nGiannini was eventually named as \"el Primer Profesor Dn Pedro Giannini\" at the general meeting of\n30\nOctober\n1777\n, and from this moment he attended all administrative meetings\n(\nas was required of his position, save those for which he was unwell, or had books to prepare\n)\n. In this position he was completely in charge of setting timetables, examination dates, and the vacation period. He was also completely responsible for the organisation and good development of classes at all levels of the College, as well as the attainment levels of the students and their wellbeing. Furthermore, as first professor, he was also in charge of hiring\n(\nand dismissing\n)\nnew staff for teaching, which he immediately did with much enthusiasm, as he had no tolerance for inefficiency. According to the\nOrdenanzas\nⓉ\n(\nRules\n)\n, the principal task of the first professor was to create the curriculum for all classes, and ensure it was well taught. This he did for mathematics, though he did not care to do the same for the artillery or fortification classes.\nGiannini was also in charge of the library of the College and maintained a record of all books kept there. He clearly had a great passion for this as it is the one task he consistently performed throughout his time at Segovia, with each record bearing his name and that of one other professor\n(\nwho varied throughout the time\n)\n. He also petitioned the assembly of the college various times in relation to the library and its books, usually asking them to buy more. Giannini was also likely responsible for the lack of books by Spaniards in the Artillery's library. The vast majority of acquisitions were of foreign extraction, and it seems that of the books written in Spanish of the time, he only had ordered\nEl Tratado de Navegación\nⓉ\n(\nTreatise on navigation\n)\n(1787)\nby José de Mendoza y Ríos.\nIt is clear that Giannini improved the quality of teaching and the stability of classes at the College of Artillery, but he did not make many changes to the syllabus. He did, however, regulate it. He published the first volume of a book entitled\nCurso Matemático\nⓉ\n(\nMathematical course\n)\nin\n1779\n(\nsee\n[\n7\n]\n)\n, though he started writing it shortly after being named as first professor. It was intended as a sort of handbook for the course at the College, with Volume I discussing the third year of the course, including elementary geometry, trigonometry, and conic sections. The first part is a version of\nEuclid\n's\nElements\n, including books\n1\nto\n6\n,\n11\n, and\n12\n. The trigonometry part begins by giving definitions of line segments, their fundamental properties, and their use in work with triangles. The final part on conic sections covers ellipses, hyperbolas, and parabolas, all studied in a purely geometric fashion.\nThis book received some acclaim abroad, with the French\nJournal des Savants\n(\nFebruary\n1780)\nstating that it waited excitedly for more volumes and that it was a demonstration of the love for both letters and the sciences that had appeared in Spain. It was also reported in the Italian\nOpuscoli Scelti Sulle Scienze e Sulle Arti\n(\nMilan,\n1780)\nand\nGazzetta Universale\n(\nFlorence,\n1779)\n, as well as the German\nEinleitung in die oekonomische und physikalische Bücherkunde\nⓉ\n(\nIntroduction to economical and physical book studies\n)\n(1784)\n. In Spain however, it was not mentioned until\n1804\nin\nVariedades de Ciencias, Literatura y Artes\nⓉ\n(\nVarieties of science, literature and arts\n)\n(\nMadrid,\n1804)\n.\nGiannini also demonstrated his lack of social skills in the production of this book as, though\n750\ncopies of the first volume were printed in\n1779\nin Madrid, it was not seen and distributed in Segovia until late\n1780\n, since Giannini deposited all the books with Gazzola, who died in May of that year. He even had trouble with the other professors in\n1781\n, as they would not use the course Giannini had provided, until they were forced to by Gazzola's replacement, Count Lacy. After this the cadets were also forced to buy the book, and it was through Lacy that funding for the later volumes was acquired.\nIn\n1780\nin using the publishing house of Antonio Espinosa, Giannini published a\n45\n-page research work titled\nOpúsculos matemáticos\nⓉ\n(\nMathematical pamphlets\n)\nin Spanish. This contained three separate works, the first of which is on the principal properties of Cissoid curves, the second is on the analytical solution of a problem in mechanics, while the third part \"On a new type of trajectory\" refers to the problem of finding a set of curves that are perpendicular to a line and maintain their perpendicularity if they are rotated around a given point.\nIt does not appear that this book was well received in Spain. Many of the best European journals, however, reviewed and endorsed it. In England, it was reviewed by\nThe Critical Review, or, Annals of Literature\n(\nLondon,\n1781)\n, which mentioned Giannini as professor at Segovia, and as having published a good work in Parma in\n1773\n. The\nJournal des Savants\nonce again praised him in their edition of June\n1781\n, saying the same as the English journal, and giving extra praise to the first part of the work which related to Apollonius of Perga's\nDe Sectione Determinata\nⓉ\n(\nOn determinate sections\n)\n. In Italy\nEfemeridi litterarie di Roma\nⓉ\n(\nEphemerides of Rome\n)\n(1781)\nalso reviewed it, adding that in a time when Spaniards were boasting about their prowess within Italy, it was good to see an Italian showing his ability in Spain, urging that \"Mr Giannini continue honouring the name of Italy, as he is doing, in foreign lands.\" In Spain, it was simply noted in the\nGazeta de Madrid\n(23\nJanuary\n1781)\nthat Giannini's works were being sold in Madrid in the Bookshop of Martínez in Carretas street.\nDuring the first years of his time at the College, Giannini counted on the support of Count Gazzola, but with his death on\n4\nMay\n1780\n, Giannini lost his great defender. He did not have much in common with Spanish society and he was not at all sociable, being focused entirely on his studies. Gazzola's successor was Count Francisco Antonio de Lacy\n(1731\n-\n1792)\n, a man born in Barcelona to an Irish official serving there. Lacy had studied with the Jesuits before joining the Spanish military and serving in Italy and Portugal, then as a plenipotentiary diplomat in St Petersburg, before being made a General on his return to Spain. He was a much decorated veteran and as a result his word was followed without question. Thankfully for Giannini, Lacy decided to follow Gazzola's line on most issues, including having faith in the first professor, and this quietened some of his detractors, who had progressed from simply disliking him as a foreigner, to also disliking him as a mathematician whom they claimed had no place in a military institution.\nIn\n1781\nthings changed significantly in the College, as an order from the King considerably increased the number of students, so timetables had to be changed and many new staff were hired. The institution also became more of a military college, albeit with mathematicians having a privileged position. In\n1782\n, however, students achieved significantly lower results than in previous years and so, at a general meeting of the College, solutions were discussed, with various arguments being made. In the end, all but Giannini agreed that the solution\n(\nwhich they sent to Count Lacy\n)\nwas to lessen their focus on mathematics. They gave multiple reasons, including that, in their opinion, the study of mathematics was \"arid and abstract, requiring much thought and continual application as a result of the fact that from\n10\nyears old it becomes something that perhaps only one person per class will truly pursue.\" As a result they decided on\n7\nJanuary\n1782\nto suspend mathematics classes until Lacy decided what to do. Lacy responded by letter by the\n10\nth, and by the\n12\nth he had arrived in Segovia. He accepted some changes in timetable, mandating that the cadets had at least\n7\nhours in bed, but also decided that the College would continue with its current programme. That is to say, he agreed with Giannini. He only asked that they incorporate fully practical geometry within the mathematics course, and that they do this before moving on to more abstract ideas such as calculus. In all other matters he declared that they would continue with Giannini's system. As a result, mathematics classes were taking place again by\n14\nJanuary. The content of the classes was not discussed again for many years, with the changes continuing at least until Giannini left the College.\nThe College was also fairly underfunded and understaffed as a result of the war between Spain and England that lasted from\n1779\nto\n1783\n, with Giannini's various requests to take on more staff to match with the greater number of cadets being rejected by Count Lacy \"at least until the war is over\". The function of the college was roughly back to normal after the Treaty of Paris, and Lacy was even at liberty to attend the general meetings of August and September of\n1783\n. Lacy also declared a need for more staff in order that the cadets feel that they have sufficient knowledge of theoretical and practical elements of the courses, and also because \"most abandon their studies after leaving the College; they lack the teaching to carry out the commission of the institution.\" This also brought out a new dispute between Giannini and the other professors, showing that the argument about course content was not over. Everyone agreed that a fourth year of study should be added, but many of the professors thought that calculus should be the last thing taught in that year and that artillery and fortification should be taught after algebra or geometry, whereas Giannini was of the opinion that artillery and fortification should be the last things taught, after all the mathematics was done. Count Lacy essentially agreed with Giannini and said that differential calculus would be taught first with those parts of mechanics that are easiest, with artillery and fortification coming later.\nIn\n1782\nGiannini published the second volume of his\nCurso Matemático\nⓉ\n(\nMathematical course\n)\n, which also had three parts\n(\nsee\n[\n8\n]\n)\n. The first concerned algebra although it begins with arithmetical examples, and also looks at logarithms. The second part concerns solving equations, specifically algebraic solutions for second, third, and fourth degree equations, then various curves represented by these equations, and finally series and finding a general solution to various equations. The third part of the volume is devoted entirely to the solving of various problems. Giannini personally took out the money for the printing and binding of this third volume from the College's funds, and also took some more to cover the costs of the third volume, though this was not published until\n1795\n. Despite this, the head of accounts for the College declared that sales of the second volume had covered the cost of its printing by\n24\nJuly\n1783\n, and for this reason, more money was given to Giannini for his third volume.\nThe second volume was well received, at least in Italy, as the\nGiornale de'Letterati\n(1783)\nexplained its content, and listed various names such as\nBarrow\n,\nNewton\n,\nClairaut\n,\nMaclaurin\n,\nSaunderson\n, Wolff,\nSimson\n,\nBezout\n, and\nEuler\nwho had clearly been influences on the work, though whose concepts Giannini had reduced to more general principles. It went on to praise how he had \"spared no effort in bringing together the most famous methods and most useful theorems of the ancient and modern mathematicians, as well as having enriched his work with a multitude of examples, for a better understanding and illustration of the given theorems.\" Once again no citations are found in Spanish journals of the time.\nGiannini also published, in\n1784\n,\nPrácticas de Geometría y Trigonometría\nⓉ\n(\nGeometry and Trigonometry Practices\n)\n(1784)\n, see\n[\n11\n]\n. Lacy was particularly pleased with this book, and it also appeared in Italy, with the\nGiornale de'Letterati\n(1784)\nmistakenly calling it the third volume of Giannini's\nCurso\nⓉ\n(\nMathematical course\n)\n, saying \"this work, interesting in many places, will always be read with both utility and pleasure in mind by all those with an interest in mathematics, while also giving us a clear understanding of the quality of the author, who has a obvious place in this most sublime of the sciences.\" It was also reviewed in\nOpuscoli scelti sulle scienze e sulle arti: tratti dagli atti delle academie\nⓉ\n(\nSelected booklets on the sciences and the arts: taken from the proceedings of the Academies\n)\n(1785)\n, and in Rome in\nEfemeridi litterarie di Roma\nⓉ\n(\nEphemerides of Rome\n)\n(1785)\n. Once again, there was no reference to it in Spanish publications.\nPracticas de Geometria y Trigonometria\nⓉ\n(\nPractices of geometry and trigonometry\n)\nbuilt on Giannini's two previous works and facilitated their practical use. It had five parts. Firstly, Giannini explains instruments for measuring angles, in the second part, methods for finding distances, in the third, raising planes, and measuring surfaces, in the fourth a way of measuring volumes, and in the fifth levelling. It also contained some logarithmic tables and tables for sines and tangents, as well as lists for the conversion of weights and measures between the principal cities of Europe.\nLittle else is known of this period, except that Giannini missed some teaching in\n1784\nto finish\nPracticas de Geometria y Trigonometria\nⓉ\n(\nPractices of geometry and trigonometry\n)\n, and that when the many distinguished guests\n(\nof which Giannini was one\n)\nstepped outside a house after a banquet, the house collapsed, though thankfully nobody was injured. Generally the only information in the notes of the College during this period is on topics in which Giannini had no interest, with the exception of a few disciplinary issues. Giannini also rarely intervened in admissions, with only one or two cases where he judged whether or not some students were capable of joining the institution. Giannini was also on a short break on\n28\nJune\n1785\n, given as unwell, the note explaining that he was indisposed as he had been \"hit by a horse.\" He was also missing in the rolls of the\n8\nth,\n9\nth,\n11\nth, and\n14\nth of July of\n1785\n, but had returned by the\n28\nth.\nAs mentioned earlier, Giannini's salary was less than that of his predecessors, and this was discussed from\n1786\ninto the early part of\n1787\n. This discussion was ended by a letter from Lacy stating that \"an order from the King has mandated that Don Pedro Giannini Primer Professor ... receive an annual salary of\n12000\nreals, as a result of His Majesty having had his attention brought to Giannini's merit and great performance in his role.\" This\n12000\n(\nincluding bonuses\n)\nwas a great increase on Giannini's income, which had started at\n8000\n, and then risen to\n9600\nin the years between his hiring and this even greater augmentation.\nTen years after his initial appointment it is evident that Giannini found himself isolated. The relationships that he had with his colleagues were not terrible, but they could hardly be described as friendly. His contacts with society in Segovia were limited. It seems there was no one to whom he was actually a friend. His relationship was the same with the cultural institutions there. The Royal Economic Society of the Friends of the Land of the Province of Segovia was founded in\n1780\n, and many professors of the College of Artillery immediately took up membership, including a mathematics professor, Manuel Munarriz. Giannini, however, had no interest in anything but work. He did assist with a couple of projects for a man called Alcalá Galiano, a member of the Society of Economics, one of which included curing a retiree called Manuel González who was paralysed, \"using an electric bath, and applying sparks using an\n[\nexciter\n]\n.\" He also helped to produce an Art School and, with Galiano, had intended to create a coordinated centre of observational meteorologists on a national level, introducing Spain to the European network that had been promoted by the Palatine Meteorological Society of Mannheim. It does appear, though, that Giannini's relations with Galiano were no less cold than with his other colleagues.\nGiannini appeared also as a sort of intermediary between the College, its professors, and the scientists of other countries of Europe, but he had no relationships with any in Spain. In\n1790\n, he appeared as a \"correspondent of many\" in the\nRoyal Academy of Sciences of Lisbon\n, from which came scientists such as Bernoulli,\nLagrange\n, Jussieu, and\nCondorcet\n. Giannini appeared in\nEphemerides Nauticas ou Diario Astronomico para o ano de\n1792\ncalculado para o meridiano de Lisboa e publicado por ordem da Academia Real das Sciencias por Custodio Gomes De Villas-Boas\nⓉ\n(\nNautical ephemerides  or  Astronomical diary for the year\n1792\ncalculated for the Lisbon meridian and published by order of the Royal Academy of Sciences by Custodio Gomes De Villas-Boas\n)\nas \"Pedro Giannini of the Institute of Bologna, and first professor of the Royal Military College of the Marines of Segovia.\"\nThe lack of written information makes it difficult to know for sure what Giannini did during his last years at the College, though what data we can glean from other archives and military records of the time indicate that his tasks did not change, though his relationship with the directors of the college worsened. He asked to become, and was made, a \"Comisario de Guerra\"\n(\nessentially equivalent to a quartermaster\n)\nin\n1794\n, though he did not belong to the Artillery branch. He also does not appear in a list of members of the College produced in August\n1794\n. Lacy had died in\n1792\nand sadly Giannini had much less support from his successors, of whom there were five before the turn of the century. It is probable that this lack of support is what lead Giannini to make his request to receive an army commission on\n22\nJuly\n1794\n, with a letter of his announcing his request and informing us of the great qualities he had gained in teaching high level calculus and mechanics to\n270\nalumni of the College of Artillery, and in the direction of the other areas of mathematics, over a period of\n18\nyears, as well as printing his\nCurso\nⓉ\n(\nMathematical course\n)\nand speaking of other works that had merited the praise of the intelligentsia. That Count Gazzola had lured him from Italy with a promise of success and yet he had achieved a salary of only\n12000\nreals when the great professors of the other Academies had had at least\n18000\n, and, in light of the fact that other mathematics professors had been given the role, he believes he deserves it. On\n15\nSeptember the response came that he was to be given the position, but with no increase in salary, and he was to remain in his current post as well. This effectively meant Giannini simply now had more work to do for the same salary. He was, though, also assured he would be able to petition for other things, and that he now had a position within the army.\nHe asked again in September\n1796\nfor the increase in salary that he had not been given on his appointment before, explaining that he had now printed the volume of differential calculus and \"that the other four books that he had published had not only merited the praise of the intelligentsia of Europe, but also that they were used for teaching in foreign lands, and that more than\n300\ncadets had learned from him the most difficult areas of science, such as high level calculus and mathematics.\" He confirmed that he made\n12000\nreals and that other professors all made between\n18000\nand\n30000\nand asked for the \"full salary of his rank.\"  In a communication of\n4\nAugust\n1796\n\"His majesty gives Giannini the full salary of Comisario de Guerra, completely in charge of the mathematics course.\" Giannini also asked for\n450\nmore reals per month in\n1799\n, and the King gave him\n350\n, on\n20\nAugust of that year.\nIt is hard to say if it was because of his salary or the lack of understanding between him and the other officials, but Giannini was not enjoying his time in Segovia. He explained this in a request of\n4\nSeptember\n1797\nasking to be transferred as a commissary to Pamplona. The king responded on\n9\nOctober, saying that he would not transfer Giannini until he had finished his book. The third volume, on differential calculus, was finished in\n1795\n, but he was still lacking the volume on mechanics which would complete the\nCurso\nⓉ\n(\nMathematical course\n)\n.\nThis third volume\n(1795)\n(\nsee\n[\n9\n]\n)\n, is split into four parts. In the first it studies the fundamentals of differential calculus and the calculation of elementary differentials and integrals. It introduces derivatives of curves and the basics of area, and applies this to finding the longitude of certain arcs and the area of various shapes. The second part is shorter and studies integration of differential equations with only a single variable. The third is about the integration of equations with two or more variables and their first order differentials. In the fourth part Giannini explains properties of second order differentials, and some of even higher order. No reviews exist of this volume either in Spain or Italy. Giannini must have lost many of his contacts in Europe after the publication of\nPrácticas\nin\n1784\n. Sadly we also have no information about the sales of either the third or fourth volume.\nThere is no information about Giannini's activities between\n1800\nand\n1803\n. Even in the records of the College of meetings during this time that we have, Giannini does not appear among the staff. In most matters it seems that they turned to the second and third professors of mathematics. Perhaps his greatest problem as far as the College was concerned rested on his failure to apply his mathematical knowledge to the improvement of ballistics or armaments. Giannini was simply a good mathematician who aided the military education of nobles of Spain with great success.\nIn\n1803\nGiannini published the fourth volume of his\nCurso Matemático\nⓉ\n(\nMathematical course\n)\n(\nsee\n[\n10\n]\n)\n, which is dedicated to mechanics and has three parts: statics, hydrostatics, and dynamics. In statics, he studies centre of mass, the composition and decomposition of forces and elementary machines. In hydrostatics, he defines specific gravity and pressure. He studies the equilibrium of fluids, and the force exerted by liquids on objects or bodies inserted into them. The final part is dedicated to the study of the air. It is about dynamics and is the most extensive and complicated. In it he analyses, mathematically, uniform movement, uniform acceleration, non uniform motion and movement of bodies of a known mass. It also studies collisions and tackles motion against resisting forces. In this part all study is performed mathematically, and no numerical examples or comparisons with experimental results are given.\nAt the beginning of\n1804\nnew ordinances were published for the college. In this\nReglamento\nⓉ\n(\nRegulations\n)\nit is said in point\n6\nthat:-\nThe staff of the Academy will be composed of one First Professor and six others, making up seven for the teaching of the sciences, divided in their respective specialisms, where they will teach the topics of pure and applied mathematics, and design.\nThe professors had to be in the military, and the first professor at least a captain, but Giannini had no military training whatsoever. It is clear that Giannini was no longer the first professor by the time of this new constitution although at the time that volume IV of the\nCurso\nⓉ\n(\nMathematical course\n)\nwas published in\n1803\nhe appeared on the title page as \"first professor.\"\nAfter many years of only being available to students at the College, Giannini's\nCurso\nwas only made available publicly in Spain in\n1804\nafter he left the College. The journal\nVariedades de Ciencias, Literatura, y Artes\nⓉ\n(\nVarieties of science, literature, and arts\n)\n(1804)\ngave a review of the content of the\nCurso\nand announced its sale at the price of\n90\nreals at the Royal Press.\nDuring his final years, Giannini worked revising the records of the army. From the year\n1795\nPedro Giannini appeared in the\nEstado Militar de España\nⓉ\n(\nMilitary establishment of Spain\n)\nas a 'Comisario de Guerra', and then was elevated to the rank of 'Comisario Ordenador'\n(\nessentially equivalent to a quartermaster but of a higher rank\n)\n, according the\nGazeta de Madrid\non\n13\nMay\n1803\n. He also appears in this article as 'first professor' and so it can be assumed that he left the role of professor shortly after attaining this rank. We note that on the title page of volume IV of the\nCurso\nⓉ\n(\nMathematical course\n)\n(\npublished\n1803)\nhe appears as 'Comisario de Guerra de los Reals Exércitos'.\nThe last news we have of Giannini's life is related to his role in the army. According to Agustín Alcaide Ibieca, Giannini was among the troops stationed in Aragón against the French, but after this nothing is known about his life. He is not found in either the list of officials who died or were taken prisoners after the success of the French at Zaragoza\n(1808\n-\n1809)\n, nor is he listed as continuing to fight against them at Teruel\n(\nMay\n1809)\nor Albarracín, or indeed in the list of those who joined the army of Joseph Bonaparte\n(\nbrother of Napoléon who became the King of Spain\n)\n. In no case is there evidence of him being in any way active after this point. He is not featured in the records of the military of\n1811\nor\n1812\n. Nor is he listed in the\n1815\nedition, which features a more extensive list of officials of his rank than do the others. It is likely he fell in battle."
}