{
  "nome_completo": "Prasanta Chandra Mahalanobis",
  "nome_curto": "Prasanta Chandra Mahalanobis",
  "ano_nascimento": "1893",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mahalanobis/",
  "lugar_nascimento": "Calcutta (now Kolkata), India",
  "lugar_morte": "Calcutta (now Kolkata), India",
  "biografia": "Prasanta Chandra Mahalanobis\n's parents were Probodh Chandra and Nirodbashini. Probodh Chandra\n(1869\n-\n1942)\nworked for a while in his father's\n(\nGurucharan\n(1833\n-\n1916))\nchemist's shop before starting up his own business as a dealer in sports goods. He married Nirodbashini, the daughter of Nandalal Sarkar, in\n1891\n. The family were of the Brahmo Samaj religion, relatively wealthy and influential in Bengali life. Probodh Chandra and Nirodbashini had two sons and four daughters, the eldest child being Prasanta Chandra the subject of this biography. The poet Rabindranath Tagore was a significant influence on Mahalanobis when he was a young boy. Rabindranath Tagore's father, Devendranath Tagore, had been a friend of Mahalanobis's grandfather Gurucharan and had played a major role in reviving the Brahmo Samaj religion\n[\n26\n]\n:-\n[\nMahalanobis's\n]\nanalytical turn of mind manifested itself at a very early age and he was given to arguing things out with his friends and even with his superiors. Even at a very early age he came under the influence of Rabindranath Tagore who took a liking to young Mahalanobis, being particularly impressed by the combination in him of a love of literature with a flair for logical analysis.\nMahalanobis attended the Brahmo Boys School in Calcutta, passing the matriculation examination in\n1908\n, his final year at the school. Entering Presidency College, Calcutta in\n1908\n, where his uncle Subodh Chandra Mahalanobis was professor of physiology, Mahalanobis passed the Intermediate Examination in science two years later and graduated with a B.Sc. with honours in physics in\n1912\n.\nIn the summer of\n1913\nMahalanobis went to England where his intention was to study for a B.Sc. at the University of London. While in London, waiting for courses to start, he made a trip to Cambridge where he was stunned by the chapel of King's College. By chance he missed the train back to London and stayed the night with a friend. In the friend's house he met a student who was studying at King's College and, hearing that Mahalanobis found the chapel so attractive, suggested he apply to study there. Remarkably, he was interviewed the next day and offered a place. He matriculated at King's College in October\n1913\nand passed Part I of the mathematical tripos in\n1914\n. He then transferred to the natural sciences tripos, obtained a first class pass in Part II in\n1915\n, and was awarded a Senior Scholarship by King's College. During his time in Cambridge, he became friendly with\nSrinivasa Ramanujan\n.\nIn the natural sciences tripos, Mahalanobis had specialised in physics and he set up a research project at the Cavendish Laboratory. He returned to India in July\n1915\nto take a short holiday before beginning his research project. However, once back in India his uncle, Subodh Chandra Mahalanobis the professor of physiology at Presidency College Calcutta, introduced him to the Principal of the College who was trying to fill a temporary vacancy in the physics department. By this time World War I was in progress and a senior physicist at Presidency College was on war service. Asked if he would take on a temporary teaching role in physics at the College to help out, Mahalanobis agreed but he was still intent on returning to Cambridge to undertake his research project once the temporary position ended. However, he soon became so involved with his work in Presidency College that he gave up the idea of returning to Cambridge.\nNow Mahalanobis's involvement in statistics came about, as many aspects of his life did, through a chance happening. Like the way he ended up in Cambridge by missing a train, this time it was having to wait in Cambridge for the boat journey to India. The boat was delayed due to World War I, and Mahalanobis put off time in the library of King's College. There he looked at some volumes of\nBiometrika\nand, being fascinated by what he read, bought a complete set of volumes and took them back to India with him\n[\n16\n]\n:-\nHe started reading the volumes on the boat during the journey, and continued to study and work out exercises on his own during spare time after arrival in Calcutta. He saw that statistics was a new science connected with measurements and their analysis, and as such capable of wide application. He tried to look for problems where he could apply the new knowledge he was acquiring. Fortunately, he found some extremely interesting problems in meteorology and anthropology, and started working on them. This was the turning point in his scientific career.\nThis interest in statistics did not change the career path of Mahalanobis who was appointed as Professor of Physics at Presidency College in\n1922\n. He continued to teach physics at the College for the next thirty years but during this time he brought about profound changes which influenced the future development of statistics in India. However, before we give some details of the setting up of the Indian Statistical Institute by Mahalanobis, let us note that he married Nirmalkumari, the daughter of the Principal of City College, Calcutta, and, like Mahalanobis, an important member of the Brahmo Samaj religion. This sounds like the ideal backgrounds for a marriage but this was not quite the case since there were serious arguments within the Brahmo Samaj community. We will not go into details\n(\nsee\n[\n1\n]\nor\n[\n16\n]\nor\n[\n26\n]\nfor more information\n)\nbut suffice it to say that Mahalanobis's views were representative of the younger members of the Brahmo Samaj and he was prominent in attacking the views of the establishment, of which Nirmalkumari's father was a part. The wedding took place on\n27\nFebruary\n1923\nalthough Nirmalkumari's father showed his disapproval but refusing to take his proper role in the ceremony.\nIn the quote above 'extremely interesting problems in meteorology and anthropology' are mentioned and we should now look at these more closely. In\n1920\nhe attended the Indian Science Congress in Nagpur and was approached by the Director of the Zoological Survey of India asking if he would be interested in looking at data he had collected concerning mixed race people in Calcutta. Mahalanobis was indeed interested, and his analysis of the data led to his first scientific paper\nAnthropological observations on the Anglo-Indians of Calcutta I Analysis of male stature\n(1922)\n. This is a remarkable piece of work and for this, and many other similar investigations he carried out later, he introduced the\nD\n2\nD^{2}\nD\n2\nstatistic, known today as the 'Mahalanobis distance'. MathSciNet lists\n144\npapers in which the Mahalanobis distance plays a significant role and is mentioned in the title or review of the paper. As a result of seeing this paper, the Director General of Observatories asked Mahalanobis if he would be interested in examining some meteorology problems. The result was three papers:\nOn the seat of activity in the upper air\n(1923)\n;\nOn errors of observation and upper air relationships\n(1923)\n; and\nCorrelation of upper air variables\n(1923)\n. He also published\nStatistical note on the significant character of local variation in proportion of dextral and sinistral shells in samples of the snail\nin\n1923\n. These were the first of over\n200\npapers which Mahalanobis published covering a vast range of topics from agriculture to drinking tea among middle class Indian families in Calcutta.\nPerhaps the two most important contributions by Mahalanobis, other than his scientific papers, were setting up the Indian Statistical Institute and the founding of the journal\nSankhya\n. We now look briefly at these. The Indian Statistical Institute began life in around\n1920\nas an unofficial group working on statistical problems in Presidency College. It soon acquired the name of the Statistical Laboratory and was located in Mahalanobis's room in the Physics Department. The official setting up of the Indian Statistical Institute was on\n17\nDecember\n1931\nwhen Mahalanobis, together with the Professor of Economics and the Professor of Applied Mathematics at Presidency College met under the chairmanship of the industrialist Sir Rajendranath Mukherjee and passed a resolution formally setting up the Indian Statistical Institute. It was formally \"registered on\n28\nApril\n1932\nas a non-profit distributing learned society under the Societies Registration Act XXI of\n1860\n\". Basically through the\n1920\ns and up to\n1931\nalmost all statistical work done in India was by Mahalanobis. However, after setting up the Indian Statistical Institute, as Director and Secretary he could build up the Institute with new appointments. For example, in December\n1932\nMahalanobis offered\nR C Bose\na part-time post at the Indian Statistical Institute. Part-time meant working on Saturdays throughout the year and full-time during the summer and Pujah vacations. Mahalanobis gave him a list of papers to read and he soon became a world-class statistician. From\n1935\nBose\nhad a full-time position at the Indian Statistical Institute as did Samarendra Nath Roy who had been appointed to a part-time post a few months after\nBose\n. Training courses in statistics were set up, for example\nC R Rao\nbegan the one-year training course in statistics in\n1940\n.\nRao\nwas soon undertaking research, went on the take a statistics degree at Calcutta University, and was appointed as a Technical Apprentice at the Indian Statistical Institute beginning in November\n1943\n. He became one of world leaders in statistics.\nIn\n1948\nthe Institute received a major grant from the Indian government allowing them to set up a Research and Training School and appoint professors, assistant professors and other academic grades. Under Mahalanobis's leadership the Institute flourished. In\n1950\nthey purchased about\n4\nacres of land at\n203\n, B T Road, Calcutta. Immediately building began on the site and the Main Building was inaugurated by\nR A Fisher\nin\n1951\n. The Research and Training School was subsequently moved to this building.  In\n1959\n, the Indian government passed the India Statistical Institute Act\n(\nthe\n57\nth\nAct of\n1959)\n- here is a short extract:-\nAn Act to declare the institution known as the Indian Statistical Institute having at present its registered office in Calcutta to be an institution of national importance and to provide for certain matters connected therewith. ... the Institute may hold such examinations and grant such degrees and diplomas in statistics, mathematics, quantitative economics, computer science and such other subject related to statistics as may be determined by the Institute from time to time.\nThe other major achievement of Mahalanobis was the founding of the statistics journal\nSankhya\nin\n1933\nas a publication of the Indian Statistical Institute. We quote from Mahalanobis's editorial in the first part of the first volume:-\nThose of us who are actively engaged in starting this journal are doing so because of our interest in statistics and our belief that a journal devoted to statistics will be useful in India. ... The spirit and outlook of 'Sankhya'  will be universal, but its form and content must necessarily be, to some extent, regional. We shall keep the special needs of India in view without, however, restricting the scope of the journal in any way. We shall naturally devote closer attention to the collection and analysis of data relating to India, but we shall try to study all Indian questions in relation to world problems. A research journal serves that narrow borderland which separates the known from the unknown, and it is not always possible to see clearly the lines of future developments. We shall, therefore, invite papers of all kinds appraising them only on the basis of observational accuracy and logical reasoning. We shall publish carefully collected statistical materials irrespective of the subject even if they have not received any analytic treatment. We shall pay special attention to developments of the mathematical theory of statistics, and include abstracts and expositions of important papers published elsewhere. We shall try to help statistical researches on co-operative lines by bringing workers in different parts of India in contact, and by providing a medium for exchange of ideas. Bibliographies of Indian statistical publications, numerical tables tending to reduce the labour of computation, book reviews, and notes and comments on current topics are some of the ways in which we shall try to make 'Sankhya' useful to statistical workers in India. Knowing that our resources are small we shall seek guidance and help from other countries, and we shall welcome and thankfully receive papers from abroad. The study of modern statistical methods in its infancy in our country, and we do not expect to be able to achieve immediate results. We shall be satisfied if we can help by our humble efforts to lay the foundations for future work.\nMahalanobis received many honours for his remarkable contributions to the development of statistics and to life in India. For example he was awarded the\nWeldon\nMedal and prize from Oxford University\n(1944)\n, the Sir Deviprasad Sarvadhikari Gold Medal\n(1957)\n, the Gold Medal from the\nCzech Academy of Sciences\n(1964)\n, and the Durgaprasad Khaitan Gold Medal from the Asiatic Society\n(1968)\n. He was President of the Indian Science Congress in\n1950\nand President of the International Statistical Institute in\n1957\n. He was elected a fellow of many societies and academies such as: the\nRoyal Society\nof London\n(1945)\n, the Econometric Society, United States\n(1951)\n, the Pakistan Statistical Association\n(1952)\n, the\nRoyal Statistical Society\n, U.K.\n(1954)\n, the\nUSSR Academy of Sciences\n(1958)\n, and the\nAmerican Statistical Association\n(1961)\n. He received honorary degrees from the University of Calcutta\n(1957)\n, Sofia University\n(1961)\nand the University of Delhi\n(1964)\n. In\n1959\nhe was elected an Honorary Fellow of King's College, Cambridge. In\n1968\nthe Government of India awarded him the Padma Vibhushan:-\n... for his contribution to science and services to the country.\nTo end this biography of Mahalanobis, we quote the first paragraph of\nC R Rao\n's article\n[\n23\n]\n:-\nThe Professor, as Prasanta Chandra Mahalanobis was known in India, passed away on\n28\nJune\n1972\n, three weeks after an abdominal operation in Calcutta. The death occurred one day before his\n79\nth\nbirthday, when he was still active doing his research work, looking after the Indian Statistical Institute as Honorary Secretary and Director and helping the Government as Honorary Statistical Adviser. The 'Mahalanobis Era' in statistics which started in the early twenties has ended. Indeed it will be remembered for all time to come as the golden period of statistics in India, marked by intensive development of a new technology and its applications for the welfare of mankind."
}