{
  "nome_completo": "Claudius Ptolemy",
  "nome_curto": "Ptolemy",
  "ano_nascimento": "85",
  "ano_morte": "165",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ptolemy/",
  "lugar_nascimento": null,
  "lugar_morte": "Alexandria, Egypt",
  "biografia": "One of the most influential Greek astronomers and geographers of his time,\nPtolemy\npropounded the geocentric theory in a form that prevailed for\n1400\nyears. However, of all the ancient Greek mathematicians, it is fair to say that his work has generated more discussion and argument than any other. We shall discuss the arguments below for, depending on which are correct, they portray Ptolemy in very different lights. The arguments of some historians show that Ptolemy was a mathematician of the very top rank, arguments of others show that he was no more than a superb expositor, but far worse, some even claim that he committed a crime against his fellow scientists by betraying the\nethics\nand integrity of his profession.\nWe know very little of Ptolemy's life. He made astronomical observations from Alexandria in Egypt during the years AD\n127\n-\n41\n. In fact the first observation which we can date exactly was made by Ptolemy on\n26\nMarch\n127\nwhile the last was made on\n2\nFebruary\n141\n. It was claimed by Theodore Meliteniotes in around\n1360\nthat Ptolemy was born in Hermiou\n(\nwhich is in Upper Egypt rather than Lower Egypt where Alexandria is situated\n)\nbut since this claim first appears more than one thousand years after Ptolemy lived, it must be treated as relatively unlikely to be true. In fact there is no evidence that Ptolemy was ever anywhere other than Alexandria.\nHis name, Claudius Ptolemy, is of course a mixture of the Greek Egyptian 'Ptolemy' and the Roman 'Claudius'. This would indicate that he was descended from a Greek family living in Egypt and that he was a citizen of Rome, which would be as a result of a Roman emperor giving that 'reward' to one of Ptolemy's ancestors.\nWe do know that Ptolemy used observations made by 'Theon the mathematician', and this was almost certainly\nTheon of Smyrna\nwho almost certainly was his teacher. Certainly this would make sense since\nTheon\nwas both an observer and a mathematician who had written on astronomical topics such as\nconjunctions\n, eclipses,\noccultations\nand\ntransits\n. Most of Ptolemy's early works are dedicated to Syrus who may have also been one of his teachers in Alexandria, but nothing is known of Syrus.\nIf these facts about Ptolemy's teachers are correct then certainly in\nTheon\nhe did not have a great scholar, for\nTheon\nseems not to have understood in any depth the astronomical work he describes. On the other hand Alexandria had a tradition for scholarship which would mean that even if Ptolemy did not have access to the best teachers, he would have access to the libraries where he would have found the valuable reference material of which he made good use.\nPtolemy's major works have survived and we shall discuss them in this article. The most important, however, is the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nwhich is a treatise in thirteen books. We should say straight away that, although the work is now almost always known as the\nAlmagest\nthat was not its original name. Its original Greek title translates as\nThe Mathematical Compilation\nbut this title was soon replaced by another Greek title which means\nThe Greatest Compilation\n. This was translated into Arabic as \"al-majisti\" and from this the title\nAlmagest\nwas given to the work when it was translated from Arabic to Latin.\nThe\nAlmagest\nis the earliest of Ptolemy's works and gives in detail the mathematical theory of the motions of the Sun, Moon, and planets. Ptolemy made his most original contribution by presenting details for the motions of each of the planets. The\nAlmagest\nwas not superseded until a century after\nCopernicus\npresented his\nheliocentric theory\nin the\nDe revolutionibus\nof\n1543\n. Grasshoff writes in\n[\n8\n]\n:-\nPtolemy's \"Almagest\" shares with\nEuclid\n's \"Elements\" the glory of being the scientific text longest in use. From its conception in the second century up to the late Renaissance, this work determined astronomy as a science. During this time the \"Almagest\" was not only a work on astronomy; the subject was defined as what is described in the \"Almagest\".\nPtolemy describes himself very clearly what he is attempting to do in writing the work\n(\nsee for example\n[\n15\n]\n)\n:-\nWe shall try to note down everything which we think we have discovered up to the present time; we shall do this as concisely as possible and in a manner which can be followed by those who have already made some progress in the field. For the sake of completeness in our treatment we shall set out everything useful for the theory of the heavens in the proper order, but to avoid undue length we shall merely recount what has been adequately established by the ancients. However, those topics which have not been dealt with by our predecessors at all, or not as usefully as they might have been, will be discussed at length to the best of our ability.\nPtolemy first of all justifies his description of the universe based on the earth-centred system described by\nAristotle\n. It is a view of the world based on a fixed earth around which the sphere of the fixed stars rotates every day, this carrying with it the spheres of the sun, moon, and planets. Ptolemy used geometric models to predict the positions of the sun, moon, and planets, using combinations of circular motion known as\nepicycles\n. Having set up this model, Ptolemy then goes on to describe the mathematics which he needs in the rest of the work. In particular he introduces trigonometrical methods based on the chord function Crd\n(\nwhich is related to the sine function by\nsin\n⁡\na\n=\n1\n120\n\\sin a = \\large\\frac{1}{120}\\normalsize\nsin\na\n=\n1\n2\n0\n1\n​\n(\nCrd\n2\na\na\na\n)\n.\nPtolemy devised new geometrical proofs and theorems. He obtained, using chords of a circle and an\ninscribed\n360\n-gon, the approximation\nπ\n=\n3\n17\n120\n=\n3.14166\n\\pi = 3\\large\\frac{17}{120}\\normalsize  = 3.14166\nπ\n=\n3\n1\n2\n0\n1\n7\n​\n=\n3\n.\n1\n4\n1\n6\n6\nand, using √\n3\n= chord\n60\n°,\n√\n3\n=\n1.73205.\n√3 = 1.73205.\n√\n3\n=\n1\n.\n7\n3\n2\n0\n5\n.\nHe used formulae for the Crd function which are analogous to our formulae for\nsin\n⁡\n(\na\n+\nb\n)\n\\sin(a + b)\nsin\n(\na\n+\nb\n)\nand\nsin\n⁡\n(\na\n−\nb\n)\n\\sin(a - b)\nsin\n(\na\n−\nb\n)\nto create a table of the Crd function at intervals of\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\na degree.\nHe is known in particular for the theorem at\nTHIS LINK\nwhich he used to deduce the above addition formulae.\nThis occupies the first two of the\n13\nbooks of the\nAlmagest\nand then, quoting again from the introduction, we give Ptolemy's own description of how he intended to develop the rest of the mathematical astronomy in the work\n(\nsee for example\n[\n15\n]\n)\n:-\n[\nAfter introducing the mathematical concepts\n]\nwe have to go through the motions of the sun and of the moon, and the phenomena accompanying these motions; for it would be impossible to examine the theory of the stars thoroughly without first having a grasp of these matters. Our final task in this way of approach is the theory of the stars. Here too it would be appropriate to deal first with the sphere of the so-called 'fixed stars', and follow that by treating the five 'planets', as they are called.\nIn examining the theory of the sun, Ptolemy compares his own observations of\nequinoxes\nwith those of\nHipparchus\nand the earlier observations Meton in\n432\nBC. He confirmed the length of the\ntropical year\nas\n1\n300\n\\large\\frac{1}{300}\\normalsize\n3\n0\n0\n1\n​\nof a day less than\n365\n1\n4\n365\\large\\frac{1}{4}\\normalsize\n3\n6\n5\n4\n1\n​\ndays, the precise value obtained by\nHipparchus\n. Since, as Ptolemy himself knew, the accuracy of the rest of his data depended heavily on this value, the fact that the true value is\n1\n128\n\\large\\frac{1}{128}\\normalsize\n1\n2\n8\n1\n​\nof a day less than\n365\n1\n4\n365\\large\\frac{1}{4}\\normalsize\n3\n6\n5\n4\n1\n​\ndays did produce errors in the rest of the work. We shall discuss below in more detail the accusations which have been made against Ptolemy, but this illustrates clearly the grounds for these accusations since Ptolemy had to have an error of\n28\nhours in his observation of the equinox to produce this error, and even given the accuracy that could be expected with ancient instruments and methods, it is essentially unbelievable that he could have made an error of this magnitude. A good discussion of this strange error is contained in the excellent article\n[\n19\n]\n.\nBased on his observations of\nsolstices\nand equinoxes, Ptolemy found the lengths of the seasons and, based on these, he proposed a simple model for the sun which was a circular motion of uniform angular velocity, but the earth was not at the centre of the circle but at a distance called the eccentricity from this centre. This theory of the sun forms the subject of Book\n3\nof the\nAlmagest\n.\nIn Books\n4\nand\n5\nPtolemy gives his theory of the moon. Here he follows\nHipparchus\nwho had studied three different periods which one could associate with the motion of the moon. There is the time taken for the moon to return to the same longitude, the time taken for it to return to the same velocity\n(\nthe anomaly\n)\nand the time taken for it to return to the same latitude. Ptolemy also discusses, as\nHipparchus\nhad done, the\nsynodic month\n, that is the time between successive\noppositions\nof the sun and moon. In Book\n4\nPtolemy gives\nHipparchus\n's epicycle model for the motion of the moon but he notes, as in fact\nHipparchus\nhad done himself, that there are small discrepancies between the model and the observed parameters. Although noting the discrepancies,\nHipparchus\nseems not to have worked out a better model, but Ptolemy does this in Book\n5\nwhere the model he gives improves markedly on the one proposed by\nHipparchus\n. An interesting discussion of Ptolemy's theory of the moon is given in\n[\n24\n]\n.\nHaving given a theory for the motion of the sun and of the moon, Ptolemy was in a position to apply these to obtain a theory of eclipses which he does in Book\n6\n. The next two books deal with the fixed stars and in Book\n7\nPtolemy uses his own observations together with those of\nHipparchus\nto justify his belief that the fixed stars always maintain the same positions relative to each other. He wrote\n(\nsee for example\n[\n15\n]\n)\n:-\nIf one were to match the above alignments against the diagrams forming the constellations on\nHipparchus\n's celestial globe, he would find that the positions of the relevant stars on the globe resulting from the observations made at the time of\nHipparchus\n, according to what he recorded, are very nearly the same as at present.\nIn these two book Ptolemy also discusses precession, the discovery of which he attributes to\nHipparchus\n, but his figure is somewhat in error mainly because of the error in the length of the tropical year which he used. Much of Books\n7\nand\n8\nare taken up with Ptolemy's star catalogue containing over one thousand stars.\nThe final five books of the\nAlmagest\ndiscuss planetary theory. This must be Ptolemy's greatest achievement in terms of an original contribution, since there does not appear to have been any satisfactory theoretical model to explain the rather complicated motions of the five planets before the\nAlmagest\n. Ptolemy combined the epicycle and\neccentric methods\nto give his model for the motions of the planets. The path of a planet\nP\nP\nP\ntherefore consisted of circular motion on an epicycle, the centre\nC\nC\nC\nof the epicycle moving round a circle whose centre was offset from the earth. Ptolemy's really clever innovation here was to make the motion of\nC\nC\nC\nuniform not about the centre of the circle around which it moves, but around a point called the equant which is symmetrically placed on the opposite side of the centre from the earth.\nThe planetary theory which Ptolemy developed here is a masterpiece. He created a sophisticated mathematical model to fit observational data which before Ptolemy's time was scarce, and the model he produced, although complicated, represents the motions of the planets fairly well.\nToomer sums up the\nAlmagest\nin\n[\n1\n]\nas follows:-\nAs a didactic work the \"Almagest\" is a masterpiece of clarity and method, superior to any ancient scientific textbook and with few peers from any period. But it is much more than that. Far from being a mere 'systemisation' of earlier Greek astronomy, as it is sometimes described, it is in many respects an original work.\nWe will return to discuss some of the accusations made against Ptolemy after commenting briefly on his other works. He published the tables which are scattered throughout the\nAlmagest\nseparately under the title\nHandy Tables\n. These were not merely lifted from the\nAlmagest\nhowever but Ptolemy made numerous improvements in their presentation, ease of use and he even made improvements in the basic parameters to give greater accuracy. We only know details of the\nHandy Tables\nthrough the commentary by\nTheon of Alexandria\nbut in\n[\n76\n]\nthe author shows that care is required since\nTheon\nwas not fully aware of Ptolemy's procedures.\nPtolemy also did what many writers of deep scientific works have done, and still do, in writing a popular account of his results under the title\nPlanetary Hypothesis\n. This work, in two books, again follows the familiar route of reducing the mathematical skills needed by a reader. Ptolemy does this rather cleverly by replacing the abstract geometrical theories by mechanical ones. Ptolemy also wrote a work on astrology. It may seem strange to the modern reader that someone who wrote such excellent scientific books should write on astrology. However, Ptolemy sees it rather differently for he claims that the\nAlmagest\nallows one to find the positions of the heavenly bodies, while his astrology book he sees as a companion work describing the effects of the heavenly bodies on people's lives.\nIn a book entitled\nAnalemma\nhe discussed methods of finding the angles need to construct a sundial which involves the projection of points on the\ncelestial sphere\n. In\nPlanisphaerium\nhe is concerned with\nstereographic projection\nof the celestial sphere onto a plane. This is discussed in\n[\n48\n]\nwhere it is stated:-\nIn the stereographic projection treated by Ptolemy in the \"Planisphaerium\" the celestial sphere is mapped onto the plane of the equator by projection from the south pole. Ptolemy does not prove the important property that circles on the sphere become circles on the plane.\nPtolemy's major work\nGeography\n, in eight books, attempts to map the known world giving coordinates of the major places in terms of latitude and longitude. It is not surprising that the maps given by Ptolemy were quite inaccurate in many places for he could not be expected to do more than use the available data and this was of very poor quality for anything outside the Roman Empire, and even parts of the Roman Empire are severely distorted. In\n[\n19\n]\nPtolemy is described as:-\n... a man working\n[\non map-construction\n]\nwithout the support of a developed theory but within a mathematical tradition and guided by his sense of what is appropriate to the problem.\nAnother work on\nOptics\nis in five books and in it Ptolemy studies colour, reflection,\nrefraction\n, and mirrors of various shapes. Toomer comments in\n[\n1\n]\n:-\nThe establishment of theory by experiment, frequently by constructing special apparatus, is the most striking feature of Ptolemy's \"Optics\". Whether the subject matter is largely derived or original, \"The Optics\" is an impressive example of the development of a mathematical science with due regard to physical data, and is worthy of the author of the \"Almagest\".\nAn English translation, attempting to remove the inaccuracies introduced in the poor Arabic translation which is our only source of the\nOptics\nis given in\n[\n14\n]\n.\nThe first to make accusations against Ptolemy was\nTycho Brahe\n. He discovered that there was a systematic error of one degree in the longitudes of the stars in the star catalogue, and he claimed that, despite Ptolemy saying that it represented his own observations, it was merely a conversion of a catalogue due to\nHipparchus\ncorrected for precession to Ptolemy's date. There is of course definite problems comparing two star catalogues, one of which we have a copy of while the other is lost.\nAfter comments by\nLaplace\nand\nLalande\n, the next to attack Ptolemy vigorously was\nDelambre\n. He suggested that perhaps the errors came from\nHipparchus\nand that Ptolemy might have done nothing more serious than to have failed to correct\nHipparchus\n's data for the time between the equinoxes and solstices. However\nDelambre\nthen goes on to say\n(\nsee\n[\n8\n]\n)\n:-\nOne could explain everything in a less favourable but all the simpler manner by denying Ptolemy the observation of the stars and equinoxes, and by claiming that he assimilated everything from\nHipparchus\n, using the minimal value of the latter for the precession motion.\nHowever, Ptolemy was not without his supporters by any means and further analysis led to a belief that the accusations made against Ptolemy by\nDelambre\nwere false. Boll writing in\n1894\nsays\n[\n4\n]\n:-\nTo all appearances, one will have to credit Ptolemy with giving an essentially richer picture of the Greek firmament after his eminent predecessors.\nVogt showed clearly in his important paper\n[\n77\n]\nthat by considering\nHipparchus\n's\nCommentary on Aratus and Eudoxus\nand making the reasonable assumption that the data given there agreed with\nHipparchus\n's star catalogue, then Ptolemy's star catalogue cannot have been produced from the positions of the stars as given by\nHipparchus\n, except for a small number of stars where Ptolemy does appear to have taken the data from\nHipparchus\n. Vogt writes:-\nThis allows us to consider the fixed star catalogue as of his own making, just as Ptolemy himself vigorously states.\nThe most recent accusations of forgery made against Ptolemy came from Newton in\n[\n12\n]\n. He begins this book by stating clearly his views:-\nThis is the story of a scientific crime. ... I mean a crime committed by a scientist against fellow scientists and scholars, a betrayal of the ethics and integrity of his profession that has forever deprived mankind of fundamental information about an important area of astronomy and history.\nTowards the end Newton, having claimed to prove every observation claimed by Ptolemy in the\nAlmagest\nwas fabricated, writes\n[\n12\n]\n:-\n[\nPtolemy\n]\ndeveloped certain astronomical theories and discovered that they were not consistent with observation. Instead of abandoning the theories, he deliberately fabricated observations from the theories so that he could claim that the observations prove the validity of his theories. In every scientific or scholarly setting known, this practice is called fraud, and it is a crime against science and scholarship.\nAlthough the evidence produced by\nBrahe\n,\nDelambre\n, Newton and others certainly do show that Ptolemy's errors are not random, this last quote from\n[\n12\n]\nis, I\n[\nEFR\n]\nbelieve, a crime against Ptolemy\n(\nto use Newton's own words\n)\n. The book\n[\n8\n]\nis written to study validity of these accusations and it is a work which I strongly believe gives the correct interpretation. Grasshoff writes:-\n... one has to assume that a substantial proportion of the Ptolemaic star catalogue is grounded on those Hipparchan observations which\nHipparchus\nalready used for the compilation of the second part of his \"Commentary on Aratus\". Although it cannot be ruled out that coordinates resulting from genuine Ptolemaic observations are included in the catalogue, they could not amount to more than half the catalogue.\n... the assimilation of Hipparchan observations can no longer be discussed under the aspect of plagiarism. Ptolemy, whose intention was to develop a comprehensive theory of celestial phenomena, had no access to the methods of data evaluation using arithmetical means with which modern astronomers can derive from a set of varying measurement results, the one representative value needed to test a hypothesis. For methodological reason, then, Ptolemy was forced to choose from a set of measurements the one value corresponding best to what he had to consider as the most reliable data. When an intuitive selection among the data was no longer possible ... Ptolemy had to consider those values as 'observed' which could be confirmed by theoretical predictions.\nAs a final comment we quote the epigram which is accepted by many scholars to have been written by Ptolemy himself, and it appears in Book\n1\nof the\nAlmagest\n, following the list of contents\n(\nsee for example\n[\n11\n]\n)\n:-\nWell do I know that I am mortal, a creature of one day.\nBut if my mind follows the winding paths of the stars\nThen my feet no longer rest on earth, but standing by\nZeus himself I take my fill of ambrosia, the divine dish."
}