{
  "nome_completo": "Ronald Aylmer Fisher",
  "nome_curto": "R A Fisher",
  "ano_nascimento": "1890",
  "ano_morte": "1962",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fisher/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Adelaide, Australia",
  "biografia": "R A Fisher\n's parents were Katie Heath, the daughter of a solicitor, and George Fisher, of Robinson and Fisher a firm of auctioneers in King Street, St James, London. Katie and George had seven children, four boys and three girls. After the birth of Geoffrey in\n1876\nand Evelyn in\n1877\n, they named their third child, who was born the following year, Alan. He died at a very young age and Katie, being superstitious, decided that all their children from that time on would have a \"y\" in their name. Ronald Aylmer Fisher was the second of twins, but the older twin was still-born.\nIn\n1904\nRonald entered Harrow, but this was a difficult time for the fourteen year old boy, for his mother died in that year of acute peritonitis. Despite this, he excelled at Harrow winning the Neeld Medal in\n1906\nin a mathematical essay competition open to the whole school. Fisher was awarded a £\n80\nscholarship from Caius and Gonville College, Cambridge, which was necessary to finance his studies since his father had lost his fortune. In October\n1909\nhe matriculated at Cambridge.\nAlthough he studied mathematics and astronomy at Cambridge, he was also interested in biology. In his second year as an undergraduate he began consulting senior members of the university about the possibility of forming a Cambridge University Eugenics Society. He graduated with distinction in the mathematical tripos of\n1912\n. His tutor, however, believed he could have done better, writing\n[\n3\n]\n:-\n... if he had stuck to the ropes he would have made a first class mathematician, but he would not.\nAwarded a Wollaston studentship, he continued his studies at Cambridge under Stratton on the theory of errors reading\nAiry\n's manual the\nTheory of Errors\n. It was Fisher's interest in the theory of errors that eventually led him to investigate statistical problems.\nAfter leaving Cambridge, Fisher had no means of financial support and worked for a few months on a farm in Canada. He returned to London, taking up a post as a statistician in the Mercantile and General Investment Company. When war broke out in\n1914\nhe enthusiastically tried to enlist in the army, having already trained in the Officers' Training Corps while at Cambridge. His medical test showed him A\n1\non all aspects except his eyesight, which was rated C\n5\n, so he was rejected. He became a teacher of mathematics and physics, teaching at Rugby and other similar schools between\n1915\nand\n1919\n.\nThe interest in eugenics, and his experiences working on the Canadian farm, made Fisher interested in starting a farm of his own. In these plans he was encouraged by Gudruna, the wife of a college friend, and this led to him meeting Ruth Eileen Gratton Guinness, Gudruna's younger sister. Ruth Eileen and Gudruna's father, Dr Henry Gratton Guinness, had died when they were young and Ruth Eileen, only sixteen years of age, knew that her mother would not approve of her marrying so young. As a result Fisher married Ruth Eileen at a secret wedding ceremony without her mother's knowledge, on\n26\nApril\n1917\n, only days after Ruth Eileen's\n17\nth\nbirthday. They had two sons and seven daughters, one of whom died in infancy.\nFisher gave up being a mathematics teacher in\n1919\nwhen he was offered two posts simultaneously.\nKarl Pearson\noffered him the post of chief statistician at the\nGalton\nlaboratories and he was also offered the post of statistician at the Rothamsted Agricultural Experiment Station. This was the oldest agricultural research institute in the United Kingdom, established in\n1837\nto study the effects of nutrition and soil types on plant fertility, and it appealed to Fisher's interest in farming. He accepted the post at Rothamsted where he made many contributions both to statistics, in particular the design and analysis of experiments, and to genetics.\nThere he studied the design of experiments by introducing the concept of randomisation and the analysis of variance, procedures now used throughout the world. Fisher's idea was to arrange an experiment as a set of partitioned sub-experiments that differ from each other in having one or several factors or treatments applied to them. The sub-experiments were designed in such a way as to permit differences in their outcome to be attributed to the different factors or combinations of factors by means of statistical analysis. This was a notable advance over the existing approach of varying only one factor at a time in an experiment, which was a relatively inefficient procedure.\nIn\n1921\nhe introduced the concept of likelihood. The likelihood of a parameter is proportional to the probability of the data and it gives a function which usually has a single maximum value, which he called the maximum likelihood. In\n1922\nhe gave a new definition of statistics. Its purpose was, he claimed, the reduction of data, and he identified three fundamental problems. These are:\nspecification of the kind of population that the data came from;\nestimation; and\ndistribution.\nFisher published a number of important texts; in particular\nStatistical Methods for Research Workers\n(1925)\nran to many editions which he extended throughout his life. It was a handbook for the methods for the design and analysis of experiments which he had developed at Rothamsted. The contributions Fisher made included the development of methods suitable for small samples, like those of\nGosset\n, and the discovery of the precise distributions of many sample statistics. Fisher published\nThe design of experiments\n(1935)\nand\nStatistical tables\n(1947)\n. His books\n[\n3\n]\n:-\n... revolutionized agricultural research; for they described the methods, now used the world over, for evaluating the results of small sample experiments and for so laying our experimental trials as to minimise the disturbances due to heterogeneity of soils and the unavoidable irregularity of biological material.\nWhile at the Agricultural Experiment Station he had conducted breeding experiments with mice, snails and poultry, and the results he obtained led to theories about gene dominance and fitness which he published in\nThe Genetical Theory of Natural Selection\n(1930)\n.\nThis work on natural selection led Fisher to question the way that in civilised societies weak and relatively infertile people obtained advantages over strong healthy individuals. He felt that the natural survival of the fittest method of improving the human race was being artificially changed by factors that specifically benefited the less well adapted. A strong advocate of measures to counter this trend, he proposed that family allowances should be proportional to income to support the well-adapted healthy members of society. As one might expect, this policy was very unpopular and he found few supporters.\nIn\n1933\nKarl Pearson\nretired as\nGalton\nProfessor of eugenics at University College and Fisher was appointed to the chair as his successor. In fact the post was split in two, with\nKarl Pearson\n's son\nEgon Pearson\nalso being appointed to a chair. Fisher held this post for ten years, being appointed as Arthur Balfour professor of genetics at the University of Cambridge in\n1943\n. Before this, however, he had moved away from London when war broke out in\n1939\n, finding temporary accommodation at Harpenden. He retired from his Cambridge chair in\n1957\nbut continued to carry out his duties there for another two years until his successor could be appointed. He then moved to the University of Adelaide where he continued his research for the final three years of his life.\nThere was a certain irony in the fact that Fisher succeeded\nPearson\nin\n1933\nfor the two had a long running dispute. The dispute began in\n1917\nwhen\nPearson\npublished a paper claiming that Fisher had failed to distinguish likelihood from inverse probability in a paper he wrote in\n1915\n. Although at this stage Fisher was only starting out on his career, he felt angry that\nPearson\nhad published an article which was critical of his results without telling him that he was about to do so. Moreover, he did not accept\nPearson\n's criticism, feeling that he was correct.\nIn fact the reasons for the feud were not nearly as simple as those usually given. The standard explanation is that Fisher became bitter because he suffered serious injustice having his papers rejected by mathematicians who did not understand biology and biologists who did not understand mathematics. Let us take an example to show that in fact this is an over-simplification. In\n1918\nFisher submitted his very important paper\nOn the correlation between relatives on the supposition of Mendelian inheritance\nto the\nRoyal Society\n. Two referees, R C Punnett and\nPearson\n, were appointed and reported on the paper. Neither referee rejected the paper, however, they both merely expressed reservations and stated clearly that there were aspects of the paper that they were not competent to judge. In the event Fisher withdrew the paper and submitted it to the\nTransactions of the Royal Society of Edinburgh\nwhere it was accepted. It is not surprising that Fisher's novel ideas took time to become accepted.\nThe feud became bitter, however, when\nPearson\nused his position as editor of\nBiometrika\nto attack Fisher's use of the chi-squared test in a\n1922\npaper.\nPearson\nwent much further, however, and claimed that Fisher had done a disservice to statistics by widely publishing erroneous results. The\nRoyal Statistical Society\nthen refused to publish Fisher's papers and he resigned from the Society in protest. Of course Fisher also took every opportunity to attack\nPearson\n, and it would be fair to say that each showed hatred towards the other. Even after\nPearson\ndied in\n1936\n, Fisher continued his attack on him, which made the atmosphere in University College a very difficult one with\nPearson\n's son\nEgon Pearson\nalso holding a chair there.\nFisher was elected a Fellow of the\nRoyal Society\nin\n1929\n, was awarded the Royal Medal of the Society in\n1938\n, and was awarded the Darwin Medal of the Society in\n1948\n:-\n... in recognition of his distinguished contributions to the theory of natural selection, the concept of its gene complex and the evolution of dominance.\nThen, in\n1955\n, he was awarded the Copley Medal of the\nRoyal Society\n:-\n... in recognition of his numerous and distinguished contributions to developing the theory and application of statistics for making quantitative a vast field of biology.\nHe was elected to the\nAmerican Academy of Arts and Sciences\nin\n1934\n, the American Philosophical Society in\n1941\n, the International Society of Haematology in\n1948\n, the\nNational Academy of Sciences of the United States\nin\n1948\n, and the\nDeutsche Akademie der Naturforscher Leopoldina\nin\n1960\n. Various institutions awarded him an honorary degree including Harvard University\n(1936)\n, University of Calcutta\n(1938)\n, University of London\n(1946)\n, University of Glasgow\n(1947)\n, University of Adelaide\n(1959)\n, University of Leeds\n(1961)\n, and the Indian Statistical Institute\n(1962)\n. He was knighted in\n1952\n.\nFisher's character is described in\n[\n3\n]\nas follows:-\nHe was capable of tremendous charm, and warmth in friendship. But he also was the victim, as he himself recognised, of an uncontrollable temper; and his devotion to scientific truth as he saw it being literally passionate, he was an implacable enemy of those whom he judged guilty of propagating error.\nHe had other strengths and weaknesses too\n[\n3\n]\n:-\nAs a penetrating thinker Fisher was outstanding; but his writings are difficult for many readers. Indeed, some of his teachings have been most effectively conveyed by the books of others who have been able to simplify their expression. As a lecturer also, Fisher was too difficult for the average student; his classes would rapidly fall away until only two or three students who could stand the pace remained as fascinated disciples. Nor was he particularly successful as an administrator; he perhaps failed to appreciate the limitations of the ordinary man. But with his wide interests and penetrating mind he was a most stimulating and sympathetic conversationalist.\nFisher's reputation suffered in the changing attitudes to Eugenics. At Gonville and Caius College, his window was removed in\n2020\n. A laboratory at University College, London that had been named for Fisher was renamed."
}