{
  "nome_completo": "Richard Buckminster Fuller",
  "nome_curto": "R Buckminster Fuller",
  "ano_nascimento": "1895",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fuller/",
  "lugar_nascimento": "Milton, Massachusetts, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Known as\nR Buckminster Fuller\n(\nor Buckie Fuller\n)\n, he was famed as an engineer, mathematician and architect. Fuller's family were from New England and he grew up with a boyhood fascination for ship-building and fishing which were part of life on the coast of Maine. He\n[\n2\n]\n:-\n... inherited that blend of romantic idealism and Yankee practicality which made him the spiritual heir to\nBenjamin Franklin\nand Emerson.\nHe married Anne Hewlett, daughter of a well-known architect, in\n1917\n, and he served in the US Navy from\n1917\nto\n1919\n. Twice expelled from Harvard University, business disasters with the construction company in which he was a minority stockholder, and the death of his four year old daughter, brought him close to suicide. Around\n1927\n[\n1\n]\n:-\nHe found himself stranded in Chicago, without income, alienated, dismayed, confused.\nHowever, he decided to devote himself to proving that:-\n... technology could save the World from itself, providing it is properly used .\nIn\n1927\nhe designed the Dynaxion House which was intended to house the technology needed for people to live. With its wire construction it was in no way intended to be aesthetic but aimed to be a totally practical machine to live in. For many years Fuller worked on ideas for buildings, eventually arriving at the structure for which he is most famous.\nHe examined a vectorial system of geometry, Energetic- Synergetic geometry, based on the tetrahedron which provides maximum strength with minimum structure. This led to his patent of a geodesic dome in\n1947\n, a building the strength of which need only increase as the log of its size\n[\n2\n]\n:-\nThese spherical structures, of light metal and plastic, based on great circle mathematics\n(\nwhose practical application was questioned as much by some architects as their structure was by many mathematicians\n)\n, were in theory without limitation of size and Fuller saw in them a universal and cheap form of shelter to cover everything from houses to cities.\nOver\n200\n,\n000\nof such domes have been built, the most famous example being the United States pavilion at the\n1967\ninternational exhibition at Montreal.\nAnother of Fuller's projects, which he began in\n1928\n, involved the design of a highly unconventional car. It was called the Dymaxion car, a three wheeled machine capable of carrying\n12\npassengers, of crossing fields as well as having a top speed of nearly\n200\nkm per hour. With a manoeuvrability which allowed it to turn within its own length this was a remarkable conception and development continued until\n1943\n. However, it was never launched as a commercial venture.\nFuller was the author of many books, including\nNine chains to the Moon\n(1938)\nwhich was his first book. Later came\nNo more second-hand God\n(1962)\n,\nUtopia or oblivion\n(1969)\n, and\nEducation automation\n. Most famous of all is his\n1969\nclassic\nOperating manual for spaceship Earth\nbut he also published\nEarth, Inc\n.\n(1973)\n, and\nCritical Path\n(1981)\n. A collection of his writings was published in\n1970\nas\nThe Buckminster Fuller reader\n.\nFuller was research professor at Carbondale, Southern Illinois University, from\n1959\nto\n1968\n. He was appointed as Charles Eliot Norton Professor of Poetry at Harvard University in\n1962\n. In\n1968\nhe became a university professor at Southern Illinois University and retained this post until he retired in\n1975\n.\nFuller was awarded many honours, including a fellowship of the Royal Institute of British Architects. This Institute awarded him their Royal Gold Medal in\n1968\n. He also received the Gold Medal Award of the National Institute of Arts and Letters in\n1968\n.\nIn\n[\n2\n]\nhe is described as follows:-\nOne of the most controversial architectural figures of our time he produced designs for unprecedented types of structure which reflected his belief and optimism in the benefits of modern technology.\nHis greatest contribution, in the view of\n[\n2\n]\n, may come as a surprise:-\n... it may be thought, however, that Fuller's greatest contribution lay in the field of education. He was a compulsive talker and he canalized this trait into magical extempore lectures of extraordinary duration - often of up to a day or more with breaks for meals. Through these he transmitted an enthusiasm for his ideas to generation after generation of students across the world.\nThe assessment of Fuller given in\n[\n1\n]\nbegins:-\nFuller - architect, engineer, inventor, philosopher, author, cartographer, geometrician, futurist, teacher, and poet - established a reputation as one of the most original thinkers of the second half of the\n20\nth\ncentury. He conceived of man as a passenger in a cosmic spaceship - a passenger whose only wealth consists in energy and information."
}