{
  "nome_completo": "R H Bing",
  "nome_curto": "R H Bing",
  "ano_nascimento": "1914",
  "ano_morte": "1986",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bing/",
  "lugar_nascimento": "Oakwood, Texas, USA",
  "lugar_morte": "Austin, Texas, USA",
  "biografia": "R H Bing\nreally was named \"R. H.\" by his parents; he had no other names. His father, Rupert Henry Bing, was a teacher who became Superintendent of the Oakwood School District in Texas. It was in this letter role that he met Bing's mother, Lula May Thompson, who was a primary school teacher in Oakwood. After they married, Bing's father decided to leave teaching and became a farmer. He became the manager of several farms and owned a store. However he died when Bing was only five years old so the family had to live very frugally. His mother had two children to bring up for by this time Bing had a younger sister.\nBing's mother was a large influence on his education. He wrote\n[\n7\n]\n:-\nMy mother felt that it was an excellent idea for mothers to train their children at an early age. Long before starting school, I was able to read and do arithmetic and regarded these things as great fun. I think I owe a great deal to my mother's early training for my interest and success at school.\nBing missed a year out at school going into the third year at his primary school after finishing his first. He found this quite hard, particularly since the other boys, being older, were bigger than he was and better at athletics. His mother needed to return to teaching to bring in enough money to give her children an good education. However, she continued to play an important role in his education, particularly in mathematics\n[\n7\n]\n:-\nI credit my mother with much of my success in mathematics. Before starting school, I learned that mathematics was fun. In the seventh grade, I entered the county number sense contest. My mother was coach of the team and she taught shortcuts enabling one to do computations quickly. We learned to approximate answers to harder problems. I later learned that my partner and I made the highest grade in the state in the number sense contest that year - more than likely due to my mother's coaching.\nThe money that Bing's mother made as a teacher was hardly sufficient to allow for her to support her son through college. Bing took a job in the college cafeteria when he went to the Southwest Texas State Teacher's College to help pay the tuition fees. Realising that his mother, even with the addition of the money he was making, could never support both him and his sister at college at the same time so he worked hard so that he managed to complete the course in only two and a half years. He was awarded his B.S. in\n1935\n. Once he had completed the course his sister trained at the same college.\nNow a trained school teacher, Bing did just that and taught mathematics for four and a half years at three different high schools in Texas, the first being at the Palestine High School in Palestine, Texas. As well as teaching mathematics he coached the football and track teams, and taught other classes, one of which was typing. During this time he did more than just teach, however, taking mathematics courses at the University of Texas over the summer. The reason for this was that the Texas Legislature had devised a policy where a teacher with a Master's degree would receive a higher salary than a teacher with a Bachelor's degree. Bing was awarded an M.Ed. from the University of Texas in\n1938\n, the same year in which he married Mary Blanche Hobbs on\n26\nAugust. They met in one of the classes they both took at the University of Texas and went on to have one son and three daughters. At the University of Texas Bing met\nR L Moore\nwho, after initially believing that Bing could not be any good at mathematics since he had spent years as a school teacher, soon realised that he had great potential.\nBing worked for his doctorate under\nR L Moore\n's supervision, undertaking research on simple plane webs. He wrote a paper on the work of his thesis which was published in the\nTransactions of the American Mathematical Society\nbut although it was a fine piece of mathematics it was not of much interest to mathematicians at the time. Not long before his death Bing commented that:-\n... the Transactions sent me fifty reprints at the time and if anyone is interested they could have some because I still had forty-nine or so left.\nWriting about\nR L Moore\n, Bing says\n[\n7\n]\n:-\nI will always appreciate the good instruction I received under\nR L Moore\n. It was to my liking because I enjoyed working out mathematics for myself and this is what he encouraged. However, I did not like the close supervision he gave my thesis. When he had me write things, he wanted it in his own way rather than in mine. I felt very glad when my thesis was finished, for I now felt I had the author's prerogative of saying things the way I wanted to say them..\nMoore\nfelt that if it was said correctly, it didn't really matter whether or not it was easily understood because it was the reader's responsibility to dig it out. My feelings were that we should say things, often repeatedly, in an effort to make it more understandable.\nIn\n1943\nBing was appointed as an Instructor at the university of Texas. He completed work on his doctoral thesis and was awarded a Ph.D. in\n1945\n. He continued to work as an Instructor at the University of Texas until he was offered the position of Assistant Professor at the University of Wisconsin. In fact he had been invited by Lefschetz to join the Faculty at Princeton but only on the condition that he gave up topology which Lefschetz at this time seemed to consider as having little future. Bing declined preferring the offer from Wisconsin. He took leave of absence in\n1949\n-\n50\nand spent the year visiting the University of Virginia.\nAt Wisconsin Bing was promoted to Associate Professor and then full Professor. He spent the year\n1957\n-\n58\nvisiting the Institute for Advanced Study at Princeton, returning to Wisconsin to spend two years as Chairman of the Mathematics Department there. He made further visits to the Institute for Advanced Study at Princeton in\n1962\n-\n63\nand in\n1967\n. At Wisconsin, he was appointed Rudolph E Langer professor in\n1968\nthen, in\n1973\n, he returned to the University of Texas, being Chairman of the Department of Mathematics there from\n1975\nto\n1977\n. He held a chair at the University of Texas until he retired in\n1985\n.\nBing's work on topology ranged across many different areas of the subject. He wrote papers on\ngeneral topology\n, particularly on metrization; planar sets where he examined in particular planar webs, cuttings and planar embeddings. He worked on topological classification of the\n2\n-sphere, the\n3\n-sphere, pseudo arcs, simple closed curves and\nHilbert space\n. He studied partitions and decompositions of locally connected continua. He considered several different aspects of\n3\n-manifolds including decompositions, maps, approximating surfaces, recognizing tameness, triangulation and the\nPoincaré\nconjecture.\nBing published\nThe geometric topology of\n3\n-manifolds\nin\n1983\n. J E Keesling, reviewing the book, wrote:-\nThis book is a classic in the study of the geometric topology of\n3\n-manifolds. Virtually everything that is known about\n3\n-manifolds from the standpoint of geometric topology is included here. One has wild surfaces, the\nSchönflies\ntheorem, triangulation,\nDehn\n's lemma, the shrinking criterion, linking, the loop theorem, covering spaces, as well as the important side approximation theorem. Many of these results are applications of the side approximation theorem.\nThe exposition is excellent and the student\n(\nnot to say the teacher\n)\nwould find the book understandable and stimulating\n.\nWe should say a little about the man himself:-\nFriends have remarked on Bing's unfailing sense of humour, his loyalty, and a Texas accent that seemed to be more pronounced the further from Texas he was.\nBing served the\nAmerican Mathematical Society\nin a number of ways. He served on the Council in\n1952\n-\n54\n, he was Colloquium Lecturer in\n1970\n, and served as President in\n1977\n-\n78\n. He also served as President of the\nMathematical Association of America\nin\n1963\n-\n64\nand as Chairman of the Division of Mathematics of the National Research Council in\n1967\n-\n69\n.\nAmong many honours he received was election to the\nNational Academy of Sciences\nin\n1965\nand the Distinguished Service to Mathematics Award from the\nMathematical Association of America\nin\n1974\n.\nA Memorial Resolution by the University of Texas at Austin sums up Bing's contribution:-\nBing accomplished much during his life and left us with many ideas, personal and mathematical, to consider and enjoy. He left topologists a treasure-trove of theorems and techniques and left the University of Texas Mathematics Department with a goal and thirteen years of good progress toward it. He was a man of strong character and integrity who liked to understand things for himself. For example, he never claimed to understand a theorem unless he personally knew a proof of it. He made decisions based on his own experience - relying on his independent judgment of a person or a cause whenever possible, rather than averaging the opinions of others. He was a kind man and respected people for their own merits rather than measuring them on a single scale.\n... He suffered from cancer and heart troubles during his last years; but he never complained about his health problems nor did he allow discomfort to dampen his enthusiasm and good spirits. He was an exemplary person. His friends, his family, and his students have been enriched beyond bound by his character, his wisdom, and his unfailing good cheer and continue to be enriched by his memory."
}