{
  "nome_completo": "Rafael Laguardia",
  "nome_curto": "Rafael Laguardia",
  "ano_nascimento": "1906",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Laguardia/",
  "lugar_nascimento": "Montevideo, Uruguay",
  "lugar_morte": "Montevideo, Uruguay",
  "biografia": "Rafael Laguardia\nwas the eldest son of Emilio Laguardia and Amalia Carle. From a very young age, Laguardia was strongly attracted to mathematics and applied himself to study it with great determination. He began primary studies at the Seminary in\n1912\n, continuing at the Crandon Institute. He began his secondary education at the Secondary Education Section of the Universidad de la República in\n1918\n. After excelling in all subjects, but particularly in mathematics, he graduated in August\n1924\nqualifying as a Secondary Education mathematics teacher. At this stage he began teaching mathematics in high school but also entered the Faculty of Mathematics and Associated Sciences in Montevideo in\n1925\n. This faculty had been founded in\n1887\nand was particularly important in increasing the level of mathematical studies in Uruguay. He was able to travel to France in\n1926\nto undertake studies in Paris and, on\n10\nNovember\n1928\n, he obtained the \"Certificat d'Études Supérieures\" from the University of Paris. This time in France was particularly important since it allowed him to gain knowledge not only about mathematics but also about methods of teaching advanced mathematics. Another advantage was that he made important links with leading French mathematicians with whom he was able to correspond and consult after he returned to Uruguay.\nReturning to Montevideo, Laguardia resumed his role as a Secondary Education teacher and, on\n8\nApril\n1929\n, he was appointed as an Assistant in Analytic Geometry in the Faculty of Engineering in Montevideo. On\n27\nMay the Council of the Faculty unanimously approved him to teach his course \"Analytic functions and their applications.\" He had firm beliefs about the importance of increasing mathematical knowledge and his experience in France had given him ideas about how that might be achieved. Along with other professors from secondary schools, he was involved in the foundation of the Institute of Higher Studies of Montevideo which aimed at encouraging original research and participation in the pure sciences. He proposed setting up a Section of Mathematical and Physical Sciences and presented a plan to achieve it. He became a founding member and served on its Board of Directors from\n1930\nuntil his resignation in\n1936\n. By this time Gabriel Terra had become a dictator in Uruguay, had dissolved the parliament and was harshly suppressing any opposition. University staff and others had to express allegiance to Terra and this led to Laguardia's resignation.\nOn\n14\nJanuary\n1933\nLaguardia married Áurea Romero. Áurea had been born on\n9\nNovember\n1911\nin Coruña, Galicia, Spain. Áurea and Rafael had two daughters, Amalia\n(\nborn\n6\nJanuary\n1937)\nand Silvia\n(\nborn\n14\nMay\n1946)\n. Further on in this biography we give a quote which describes how Áurea helped Laguardia.\nOn\n18\nNovember\n1934\nRafael Laguardia wrote to the Dean of Secondary Education, Eugenio P Baroffio, giving his views on teaching mathematics at secondary level. We give a version of an English translation of this letter at\nTHIS LINK\n.\nFrom the beginning of the thirties, Laguardia's house was the meeting place for a small group who met there to discuss mathematical problems and consult his library, which for many years was the best in the city.\nJosé Luis Massera\ndescribes joining and participating in Laguardia's group in\n[\n3\n]\n:-\nIn\n1935\n... one day I visited Laguardia, without any sort of recommendation, in his very modest home, which was some three blocks from my own. I did not know Laguardia, but I knew who he was because a schoolmate had pointed him out to me in the quadrangle of the old Institute Vázquez Acevedo\n(\nMontevideo's leading college preparatory school\n)\n. This visit started a very close friendship that lasted until his much lamented death a few years ago. ... Laguardia introduced me to the small group of mathematical 'aficionados': Antonio Petracca, Fernando Fortezza, Carlos A Infantozzi, Luis Castagnetto, and\nMischa Cotlar\n. ... I want to say a few more words to describe the ambience in the small mathematical circle at Montevideo at the time of our encounter. For a rather long while, every weekend \"Don\"\nJulio Rey Pastor\ncame to visit us from Buenos Aires and taught us about some of the new developments in mathematics - of which we knew nothing. Our mathematical relation with\nRey Pastor\nwas very fruitful, since we were able to discuss our mathematical problems freely on a one-to-one basis. In this way, our horizons were open to the then new mathematics: general topology, algebra, modern analysis. Don Julio had a very complex personality, and occasionally he was very difficult to deal with; but the overall balance of our relationship with him was, undoubtedly, enormously positive for the development of mathematics in Uruguay. On the other hand, our small group established a close and relatively assiduous contact with the much larger and more mature group of the Argentine mathematicians. We participated in the main scientific meetings of the\nUnión Matemática Argentina\n, and published most of our first papers in its journal, the 'Revista de la Unión Matemática Argentina'.\nIn December\n1941\nLaguardia received the degree of Industrial Engineer with the highest distinction. His main interest was mathematics rather than engineering but to become a tenured professor in the Faculty of Engineering it was essential to have the degree of Engineer. He was appointed Associate Professor of Mathematical Analysis II on\n5\nMarch\n1942\nand in the same year he published\nConformal mapping of a domain onto a circle\n(\nSpanish\n)\n. Malcolm Robertson writes in a review:-\nThis is an expository paper designed particularly for engineering students who make use of certain results of the theory of conformal mapping without having made an overall study of the existence theorems connected with this topic. The ideas pertaining to these existence theorems have been collected here to fill this gap. In the first chapter the general notions of metric spaces, convergence, normal families, compact families and the like are drawn up in general abstract form for greater clarity of the connection of the ideas. In the second chapter the proofs of the fundamental existence theorems are given, using the modern methods of analytic functions.\nOn\n2\nMay\n1942\nLaguardia presented to the Faculty Council a proposal to found the Institute of Mathematics and Statistics which was accepted, the Institute officially opening on\n16\nJuly of that year. The initial location was in the old Faculty building and it operated in very poor material surroundings. The Institute of Mathematics and Statistics had a classroom which was divided by wooden partitions and little else. Some time later, when new buildings for the Faculty of Engineering were constructed, Laguardia had the opportunity to influence the architectural design of the mezzanine where it was to be located. It was constructed so that the six main rooms\n(\ntwo offices, the library and three more offices, all next to each other with doors to a corridor on the ground floor\n)\nwere linked by a kind of transparent tube. That tube consisted of a succession of large transparent glass windows, which were on the sides of the offices and allowed one to see right through the Institute from the first office, where the secretaries worked, right to the last office, which was Laguardia's.\nYears later Laguardia wrote about the creation of the Institute in which he referred to himself in the third person, see\nTHIS LINK\n.\nA Rockefeller Foundation scholarship enabled Laguardia to spend from March to December\n1943\nat the University of Rosario de Santa Fe in Argentina where he worked closely with\nBeppo Levi\n. At Rosario he established contacts with several Argentine mathematicians and attended meetings of the\nArgentina Mathematical Union\n. He later published many papers in the\nBulletin\nof the\nArgentina Mathematical Union\n. One result of his visit was the joint paper he published with\nBeppo Levi\nentitled\nOn the representation by integrals of some functions defined by Taylor expansions and its application to the solution of partial differential equation\ns\n(\nSpanish\n)\n. A second Rockefeller Foundation scholarship enabled him to spend\n1944\n-\n45\nin the United States. The scholarship was entitled \"Research Fellow in Mathematics of Harvard University\" but the Faculty of Engineering in Montevideo instructed him that during his visit to Harvard, as well as undertaking research, he study the training of mathematics teachers and the organization of mathematical studies in the United States. Laguardia's Rockefeller Foundation scholarship was extended to cover\n1945\n-\n46\nwhen, at the invitation of\nSolomon Lefschetz\n, he was a \"Visiting Fellow by Courtesy of Princeton University\" and also gave a summer course at Brown University.\nG D Birkhoff\ninvited him to speak at a Mathematical Colloquium at Harvard University on work on the inversion of transforms with\nStieltjes\nkernels that he had been undertaking with the applied mathematician Jaime Lifshitz. Born on\n7\nApril\n1914\nin Kiev, Jaime Lifshitz was awarded an M.Sc. by the National University of Mexico in\n1941\nand appointed as a Professor of Mathematics in the Institute of Physics of the National University of Mexico in the same year. He was awarded a Guggenheim Foundation Scholarship in\n1942\nbecoming a Latin American Exchange Fellow with a project to study the general theory of orbits. During the time he spent in the United States, Laguardia attended seminars, colloquia and congresses of the American Mathematical Society and the Institute of Mathematical Statistics. He also visited the Universities of Mexico, Lima, San Pablo and Rio de Janeiro. This enabled him to establish links with the mathematicians who worked in those universities.\nLaguardia returned to Montevideo where he continued teaching courses on mathematical analysis. In\n1949\nhe was appointed as Director of the Institute of Mathematics and Statistics which he had created. Up until that time he had acted as Honorary Director of the Institute. He was back in the United States in\n1950\nwhen he attended the International Congress of Mathematicians held in Cambridge, USA, from\n30\nAugust to\n6\nSeptember\n1950\n.\nEnrique Mario Cabaña Pérez\n(\nborn\n2\nDecember\n1937\nin Florida, Uruguay\n)\nworked at the Institute of Mathematics and Statistics in Montevideo in the second half of the\n1950\ns. He writes about Laguardia and his wife in\n[\n2\n]\n:-\nSome Saturdays in the morning, if I went to the Institute, I used to meet Laguardia with his wife, Aurea Romero, doing housekeeping. Aurea helped him to sort and to discard papers that overflowed from his desk and filled his libraries and filing cabinets. So I met Laguardia's wife, a woman as tall as Laguardia, very elegant. Some time later my wife and I got to know her better, and now I can say, moreover, that she was lovely. Without doubt she had a lot of influence on the progress and on the character of Laguardia. We also met their daughters, especially Amalia, who for her university work\n(\nshe was a biologist\n)\nhad more opportunities to be present rather than Silvia. Aurea's voice and manner of speech were unmistakable. Telephone calls to the Institute came to the secretary, the telephone in Laguardia's office was a \"derivative\" of that in the secretary's office. I often had to answer calls, and often tell Laguardia that his wife was on the phone.\nLaguardia resigned as Director of the Institute of Mathematics and Statistics in\n1973\nand Cabaña, the author of the above quote, took over as Director. The year\n1973\nmarked the beginning of political events in Uruguay which, over the following few years, destroyed much of the mathematical structure of the country that Laguardia had built.\nFrom late\n1971\na new government took office in Uruguay but the armed forces began to have an increasing role in political affairs. From February\n1973\nthe situation became critical with the army putting tanks on the streets and the commanders of the forces made a list of major political demands. On\n27\nJune\n1973\nthere was a military coup d'état which marked the beginning of a twelve year dictatorship. The Institute of Mathematical Statistics was devastated by the dictatorship. Some members of the Institute suffered long periods of imprisonment, others had to leave the country at different times and under different conditions. Those imprisoned included Roberto Markarian,\nJosé Luis Massera\nand Elvio Accinelli.\nMassera\nwas imprisoned in October\n1975\nand held for\n9\n.\n5\nyears. Markarian and Accinelli, who were imprisoned with\nMassera\nfor over three years, wrote the following\n[\n1\n]\n:-\nWritten in secret, with tiny handwriting, manuscripts were carried from cell to cell by the prison inmate who delivered bread or tools, who risked with this audacity being punished and sent to the  solitary. Those little papers circulated in open defiance and\nMassera\nwrote about dialectic, logic and mathematics, making real our affirmation that science and culture cannot be destroyed. At that time and place, to think was entirely prohibited. To demonstrate by some means what was thought, was an act of defiance and bravery, beyond the intrinsic value that the written or demonstrated material might have.\nMassera\nwrote in\n[\n3\n]\n:-\n[\nMeeting Laguardia in\n1935]\nstarted a very close friendship that lasted until his much lamented death a few years ago. I was in jail at the time and could not be with him then. A short time before dying, Laguardia presented me with an 'Enciclopedia Larousse' which somehow passed through the jail censors, and which was, and still is, a source of remembrance of him. It was, for me and for many other prisoners, an open window to the world which all of us appreciated greatly.\nAlmost nothing that Laguardia had built up over\n30\nyears was left standing by the dictatorship. Enrique Cabaña visited Laguardia in\n1980\nwhen he was already seriously ill, and told him what he knew about the activities of his collaborators in different parts of the world. Laguardia was glad to have news and said with visible satisfaction \"Then the Institute has not died!\"\nLaguardia died in August\n1980\nso did not live to see mathematics begin to be re-established in Uruguay starting in\n1984\n. Gradually a group of former members of the Institute of Mathematical Statistics began to return to Uruguay, who by then had made careers as mathematicians in other countries, and they joined their colleagues who had been freed from prison to re-establish the development interrupted by the dictatorship. In\n1987\n, the Institute of Mathematical Statistics was named \"Prof. Ing. Rafael Laguardia\", thus becoming the IMERL."
}