{
  "nome_completo": "Ralph Philip Boas Jr",
  "nome_curto": "Ralph Boas",
  "ano_nascimento": "1912",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boas/",
  "lugar_nascimento": "Walla Walla, Washington, USA",
  "lugar_morte": "Seattle, Washington, USA",
  "biografia": "Ralph Boas\n's father was Ralph Philip Boas\n(1887\n-\n1945)\n, a professor of English and the author of many scholarly articles. He was teaching at Whitman College in Walla Walla when his son was born but later taught at Central High School, Springfield, Massachusetts, then at Reed college and later at Mount Holyoke. To indicate his interests we list some of his publications:\nThe Introduction to English Literature\n(1913)\n;\nSocial Backgrounds of English Literature\n(1923)\n;\nAn Introduction to the Study of Literature\n(1925)\n;\nShort Stories for Class Reading\n(1925)\n;\nSocial Backgrounds of American Literature\n(1933)\n;\nAn Instructive and Inspirational Book for Teachers of English\n(1934)\n; and\nEnjoyment of Literature\n(1934)\n. The mother of Ralph Boas Jr was Louise Schutz\n(1888\n-\n1969)\n. Ralph and Louise Boas had both graduated from Brown University with Master's Degrees and were married in\n1911\nin Providence RI. Louise later became a professor of English and the author of several books including\nWoman's Education Begins: The rise of the Women's Colleges\n(1935)\n. When in Springfield, Massachusetts, Ralph's sister Marie Boas was born on\n18\nOctober\n1919\n. Marie, who is better known by her married name of Marie Boas Hall, became a famous historian of science and married the historian of science Alfred Rupert Hall\n(1920\n-\n2009)\n. Marie died in\n2009\nabout two weeks after her husband. We note that in this archive we reference her work in the biographies of\nNewton\n,\nBoyle\nand\nSluze\n.\nBoas was educated at home up to the age of eight when his parents decided that he should begin his schooling. After testing by the teacher, he was put into grade six meaning that he was two years younger than others in the same class. This did present him with difficulties, particularly since physically he was small for his age. Although both his parents were excellent writers and teachers, Boas claims that neither of them taught him \"to write effectively.\" Since good teaching is often the encouragement and assistance to learn, this may explain how he became an excellent writer without feeling he was being taught. He did, of course, have access to his parents' extensive library of literature and books on teaching students English.\nAt Junior High School he learnt Latin and, in mathematics, became skilled at algebraic manipulation. His mother gave him her college algebra textbook and he learnt to solve problems without understanding why the methods worked. Later in his school career his father gave him a set of logarithm tables and again he learnt to use them without understanding. When he became a teacher himself he still believed that first learning techniques and later being taught the theory behind the techniques was a good way to teach. In\n1924\n, when Boas was twelve years old, his father became professor of English composition at Mount Holyoke College. This was a women's college in South Hadley, Massachusetts. In South Hadley the Boas family lived close to the College campus. Boas attended High School in South Hadley where the headmaster was an enthusiast for mathematics. He put on a special course in solid geometry after school hours for Boas and one other student. However, mathematics was not the subject in which Boas was most interested at this time. He was very much following his parents love of arts subjects and expected that he would study French, German, Latin and Greek which his parents knew, then later go on to study more \"exotic\" languages. Certainly he found learning languages an easy thing to do.\nFinding high school rather easy, he did a number of other activities to keep himself busy. He helped a retired biologist look after chickens, and worked at the South Hadley Library where he was taught to catalogue and mend books as well as how to use reference materials. He came into contact with college students at his home. He said\n[\n2\n]\n:-\nStudents were always dropping in on my parents to discuss their work or their personal problems. The students were, of course, all women and they tended to treat me like a younger brother or nephew until I was in college myself.\nHe graduated from the South Hadley High School in\n1928\nand, still only being sixteen years old, his parents decided that he should take a year out before entering university. He spent the year informally attending courses in Greek, German and Calculus at Mount Holyoke College. In\n1929\nhe entered Harvard University. In the same year his mother, who had not worked previously, was appointed as an associate professor of English at Wheaton College in Norton, Massachusetts. In the following year his father left Mount Holyoke College and became head of the English Department at Wheaton College.\nBoas had such a wide range of interests that he had deliberately chosen Harvard as giving him the largest number of options. He entered with the intention of majoring in chemistry and then taking a medical degree. However, he soon discovered that he did not have the necessary dexterity to handle laboratory work so he became a mathematics major. He took courses by\nEdward Huntington\n,\nWilliam Osgood\nand\nOliver Kellogg\n, and, for his final two years, he had\nDavid Vernon Widder\nas a tutor.\nWidder\nhad been a student of\nGeorge David Birkhoff\nand had been awarded his Ph.D. by Harvard in\n1924\nfor his thesis\nTheorems of Mean Value and Trigonometric Interpolation\n.\nWidder\nset Boas the task of gathering different proofs of the fundamental theorem of algebra and he eventually collected over thirty. One of his first publications was\nA Proof of the Fundamental Theorem of Algebra\nwhich appeared in the 'Questions, Discussions, and Notes' section of the\nAmerican Mathematical Monthly\nin\n1938\n. He graduated in\n1933\nand was awarded a Sheldon Fellowship which funded travel. He spent\n1933\n-\n34\ntravelling round Europe before returning in the autumn of\n1934\nto begin graduate studies at Harvard.\nA first semester course by\nSaunders Mac Lane\nmade him consider undertaking research in algebra but a second semester course on algebra from a different lecturer made him change his mind. In fact he undertook research advised by\nWidder\nand was awarded his Ph.D. in\n1937\nfor his thesis\nThe Iterated Stieltjes Transform.\nAs part of the Ph.D. requirement he had to write, in at most three weeks, a minor thesis on a topic he was given. Research on the topic was not allowed. He was given \"dimension theory\" as his minor thesis topic and he said it was the most intense three weeks work he had ever put in, but fantastic training for his career as a lecturer. While still working on his Ph.D. thesis he had a number of papers published:\nNecessary and sufficient conditions in the moment problem for a finite interval\n(1935)\n,\nSome theorems on Fourier transforms and conjugate trigonometric integrals\n(1936)\n,\nAsymptotic relations for derivatives\n(1937)\n, and\nThe Derivative of a Trigonometric Integral\n(1937)\n.\nAfter the award of his Ph.D., Boas spent a year in Princeton financed by a National Research Fellowship. There he worked with\nSalomon Bochner\nand they published the joint paper\nClosure theorems for translations\n(1938)\n.\nFrank Smithies\nwas also at Princeton spending two years at the Institute for Advanced Study. They had first met in May\n1937\nwhen\nSmithies\nhad visited Harvard to give a seminar.\nSmithies\ndescribes Boas' time at Princeton\n[\n29\n]\n:-\nRalph was living in the Graduate College and I was having meals there ... When Ralph arrived, he soon joined in the usual occupations of our crowd: talking about mathematics, current affairs, or anything else; walking in the countryside, going to the movies, listening to music\n(\nand to the radio news at times of crisis\n)\n, playing \"ping-pong\"\n(\nour game could hardly be dignified as \"table tennis\"\n)\n, taking part in play-readings.\nBoas and\nSmithies\nundertook joint research and together published the paper\nOn the Characterization of a Distribution Function by Its Fourier Transform\n(1938)\n. There were two further important outcomes of Boas' friendship with\nSmithies\n. The first of these resulted in the classic\nA Contribution to the Mathematical Theory of Big Game Hunting\n(1938)\nwhich appeared in the\nAmerican Mathematical Monthly\n. See\nTHIS LINK\n.\nBoas explains how it came about in\n[\n2\n]\n:-\nIn Princeton I usually had dinner with a group of\n(\nmostly\n)\nmathematicians. One of the things we talked about was mathematical methods for catching lions. There were many jokes in this vein at Princeton at that time.\nBoas and\nSmithies\ndecided to write these down in a paper and added some more of their own. They chose the name E S Pondiczery for the author. This they invented from the disputed Indian territory Pondicherry, giving it a Slavic spelling. The initials E S were chosen to make ESP\n(\nExtra-Sensory Perception\n)\n. They established his name by writing some reviews under the name Pondiczery and an article by him in the\nMonthly\n. Boas and\nSmithies\nsent the 'Big Game Hunting' paper to the\nMonthly\nunder the name E S Pondiczery but asked that it be published under the name H Pétard. This name was taken from the famous Shakespeare quote in\nHamlet\n, \"hoist by his own petard.\"\n[\nIf you had asked Boas you would have been told that the initials E S stood for Ersatz Stanislas, while H Pétard is Hector Pétard.\n]\nWe said above that the friendship between Boas and\nSmithies\nhad another important outcome and this was that\nSmithies\nasked Boas to spend the second of the two years of his Fellowship at Cambridge in England. It required some negotiation before it was agreed that he could spend a year of the National Research Fellowship in England, but, after he offered to pay the travel expenses himself, it was allowed. The year\n1938\n-\n39\nin Cambridge was enjoyable and useful giving him the opportunity to attend lectures by\nG H Hardy\n,\nJ E Littlewood\nand\nA S Besicovitch\n. He participated in the\nHardy\n-\nLittlewood\nseminar, held in\nLittlewood\n's rooms but without\nLittlewood\never being present.\nSmithies\nwrites\n[\n29\n]\n:-\nRalph's family\n(\nhis parents and his sister Marie ...\n)\nspent some time in London in the spring of\n1939\n, and we all met there on several occasions. In the Easter vacation Ralph visited my native city of Edinburgh for a few days, and I was able to show him some of the local sights.\nOne piece of fun that\nSmithies\nand Boas had in\n1939\nwas announcing the marriage of Betti Bourbaki\n(\nwhom they claimed was\nNicolas Bourbaki\n's daughter\n)\nto Hector Pétard.\nReturning to the United States, in the autumn of\n1939\nBoas took up an Instructorship in Mathematics at Duke University in Durham, North Carolina. When he arrived he found an invitation to be a reviewer for\nMathematical Reviews\nand he became an enthusiastic reviewer, even learning Russian to be able to review Russian papers. In spring\n1940\nhe met another young mathematics Instructor, Mary Elizabeth Layne\n(1917\n-\n2010)\n. Mary had been awarded a Master's Degree from the University of Washington in\n1940\nand was teaching at Duke. They became engaged in the spring of\n1941\nand, having made certain that Mary could keep her job if they married, they married on\n12\nJune\n1941\nin Orleans, Massachusetts.\nPaul Erdős\nsent them the following message for their wedding\n(\nsee\n[\n29\n]\n)\n:\nHere's to Boas, Ralph and Mary,\nWho no longer solitary\nConstitute a form binary.\nThis occasion celebratory\nBrings this wire felicitary\nFrom the house of Pondiczery.\nRalph and Mary Boas had three children: Ralph Layne Boas\n(\nborn\n1948)\n, Anne Louise Boas and Harold Philip Boas\n(\nborn\n1954\n, he became a professor of mathematics at Texas A&M University\n)\n.\nIn\n1942\n, the United States having entered World War II, Boas applied to work at the Navy Pre-Flight School at Chapel Hill. After a few months the Navy decided they did not want non-military teachers at the Pre-Flight School and Boas was recruited to teach in the military training program at Harvard. Once there he taught courses in the military training program and also some regular Harvard courses. At this time Mary taught at Tufts University. While working for the military, Boas was not allowed to publish papers. However, he had already invented E S Pondiczery, so in\n1944\nhe published the paper\nPower problems in abstract spaces\nin the\nDuke Mathematical Journal\nunder the name E S Pondiczery. This paper contains what today is known as the\nHewitt\n-\nMarczewski\n-Pondiczery theorem concerning the product of topological spaces. We note that\nEdwin Hewitt\n's proof appeared in\n1946\nand\nEdward Marczewski\n's proof in\n1947\n.\nIn\n1945\nBoas became the editor of\nMathematical Reviews\nwhile his wife Mary was working for a Ph.D. in physics at MIT. In\n1949\nhe was offered a full professorship at Northwestern University so did what few people have done, namely going directly from being an instructor to full professor. He chaired the Department of Mathematics from\n1957\nto\n1972\nand worked there until he retired in\n1980\n.\nSoon after arriving at Northwestern he became an enthusiastic worker for the\nMathematical Association of America\n. Over the years he served on around\n25\ndifferent committees of the Association, served as its chairmen of publications for two terms, and was president of the Association in\n1973\n-\n74\n. He served the mathematical community in other ways too such as Vice-President of the\nAmerican Mathematical Society\n, Trustee of the\nAmerican Mathematical Society\n, President of a Chapter of the American Association of University Professors, Chairman of Section A\n(\nMathematics\n)\nof the American Association for the Advancement of Science, and Chairman of the Mathematics Committee for the Advanced Graduate Record Examinations.\nFor many mathematicians, Boas is best known as a writer of outstanding books. We list these, together with short extracts from some reviews, as\nTHIS LINK\n.\nHis physical appearance is described by Philip Davis in\n[\n29\n]\n:-\n... dapper - always bow-tied, with his glasses and moustache he reminded me fondly of Groucho Marx. He was slight and agile; he jumped up on desks with balletic flair; and in the days when he was a member of the Otto Neugebauer group at Brown University he was nicknamed \"The Squirrel.\" Many remember Ralph walking down Garden Street, green bookbag over his shoulder, on the way to Harvard Square, South Station, and Providence through sun, rain and snow.\nAmong the awards that Boas received we mention the\n1970\nLester R Ford\nAward from the\nMathematical Association of America\nfor his paper\nInequalities for the derivatives of polynomials\n(1969)\nand the\n1978\nLester R Ford\nAward for his paper\nPartial sums of infinite series, and how they grow\n(1977)\n. He was also awarded the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service from the\nMathematical Association of America\nin\n1981\n.\nSaunders Mac Lane\n, giving the address when Boas received this award, sums up his achievements as follows\n[\n20\n]\n:-\n... all told, his career has carried out his original enthusiasm for mathematics in all its aspects: research, monographs, books, teaching, editing, testing, managing, and organizing. It is the quality of his accomplishments and the breadth of his activities that render him today the appropriate candidate for the Distinguished Service Award of the Association.\nBoas was editor of the\nAmerican Mathematical Monthly\nfrom\n1976\nto\n1981\nand, in\n1993\nhe was invited to San Antonio for the Centenary Celebrations of the\nMonthly\n. Sadly, by this time his health was too poor to allow him to participate. He replied to the invitation\n[\n29\n]\n:-\nI would love to participate in the celebration of the hundredth anniversary of the 'Monthly', but it's a physical impossibility. ... I can still do useful mental work, but I have to get around the house with an electric cart.\nCreighton Buck, Boas' co-author on the book\nPolynomial expansions of analytic functions\nand his friend for over\n50\nyears, wrote the following tribute\n[\n10\n]\n:-\nOthers may share my feeling that it is impossible to paint an appropriate picture of Ralph's role in the world of mathematics. It would have to be a giant mosaic, created by many hands, each bringing a different picture of his contributions to our community. He has left his imprint on every one of the organizations that make up the world of mathematics - from the elaborate communications structure that is 'Mathematical Reviews' - to the procedures\n(\nnow routine\n)\nthat have simplified regional meetings of the mathematical societies. How often I remember his voice, offering a wry comment and cool common sense, to solve an administrative headache, or divert a catastrophe. ... There is such a thing as a mathematical midwife\n(\nor whatever the mr form is\n)\nRalph has done his share. I have heard him described as the perfect referee -- helping the author to write a good paper, without making it easy. He was a great editor because he trained his referees. He will be missed!"
}