{
  "nome_completo": "Ramchundra",
  "nome_curto": "Ramchundra",
  "ano_nascimento": "1821",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramchundra/",
  "lugar_nascimento": "Panipat, India",
  "lugar_morte": "Delhi, India",
  "biografia": "Ramchundra\n's father, Rai Sunder Lal Mathur, was employed in the Indian revenue department and, at the time of Ramchundra's birth, he had been posted to Panipat which is a city in north west of India about\n70\nkm from Delhi. In fact the family came from Delhi and they were of the Kayastha caste, that is a Hindu caste of scribes who worked in the Indian bureaucracy. Ramchundra's early education was at home, a standard for India at that time, but he also attended school in Panipat from the age of six. The family moved back to Delhi but Ramchundra's father Sunder Lal died in\n1831\nleaving the family in a very difficult financial position. Ramchundra's mother had to care for six young boys.\nRamchundra married a deaf and dumb girl in\n1832\nwhen he was eleven years old. This is a very early age for, at this time most Indian girls married around the age of fourteen, but for boys the age for marriage was around eighteen. This was an arranged wedding\n(\nthe girl was the daughter of a wealthy businessman and came with a sizeable dowry\n)\nand Ramchundra only learnt after the wedding that his wife was deaf and dumb. That he married at this young age is almost certainly so that the family could benefit from the dowry.\nIn\n1833\nRamchundra entered the English Government School in Delhi. He spent six years at this school but he learnt little mathematics there. In fact it was towards the end of these six years that he became interested in the topic and studied mathematics books at home. However, he did well at school and was awarded minor scholarships which helped out financially. Of course having to care for and support an invalid wife made things even harder and he found it difficult to purchase the mathematics texts he was so keen to read. He left the English Government School in\n1839\nand for two years he was employed as a writer. This not only meant he earned money to support his wife, but it also allowed him to help support the education of his five brothers.\nDelhi College was set up by the East India Company in\n1824\nbased on a college for literature, science and art that had been founded by the citizens of Delhi in\n1792\non the site of an old Madrasa outside the Ajmeri gate. The College incorporated the English Government School which Ramchundra attended. Delhi College, originally intended to promote Oriental learning, soon added the teaching of astronomy and mathematics based on European methods. In\n1841\nRamchundra competed for a scholarship and was awarded a senior scholarship of thirty rupees per month. He held this scholarship for three years, enabling him to complete his education, and then, in\n1844\n, he was he was appointed as a teacher of European science in the Oriental department of Delhi College. We note that Delhi College today is known as Zakir Husain Delhi College and has been part of the University of Delhi since\n1925\n.\nRamchundra began a programme of translating and compiling works into Urdu. He produced\nSari-ul-Fahm\n, aimed at teaching algebra, trigonometry and other mathematical topics up to the differential and integral calculus. Ramchundra writes\n[\n3\n]\n:-\nThese translations were introduced into the Oriental department as class books; so that in two or three years many students in the Arabic and Persian departments were, to a certain extent, acquainted with English science: and the doctrines of the ancient philosophy, taught through the medium of Arabic, were cast into the shade before the more reasonable and experimental theories of modern science.\nThis quote is from Ramchundra's autobiographical notes which we give in full at\nTHIS LINK\n.\nRamchundra, along with the advanced students in the English and Oriental departments of the Delhi College, founded a Society of the Diffusion of Knowledge in\n1847\n. They published a monthly paper which was designed to follow the same style as the\nSpectator\n[\n3\n]\n:-\n... in which not only were the dogmas of the Mohamedan and Hindu philosophy exposed, but also many of the Hindu superstitions and idolatries were openly attacked.\nAs one might expect, this led to attacks from Hindus and even his friends. You can read further details of the reactions to this publication in Ramchundra's autobiographical notes at\nTHIS LINK\n.\nIn another monthly publication, founded in September\n1847\nand published by Delhi College, Ramchundra contributed articles on a wide variety of topics including: A Description of the Diving Bell, by which Sunken Materials may be retrieved from the Sea; A Discussion of the Mistakes that Hindu Learned Men have made in Various Sciences in the Shastras; On Astronomy; On the work of Sir\nIsaac Newton\n; A discussion of the Relationship of the Human Mind and Body; On Demosthenes; On Confucius; and A biography of the Safavid Shah Abbas. He also discussed the latest scientific developments in agriculture and gave summaries of new books on popular science.\nIn\n1850\nRamchundra published at Calcutta, at his own expense, the book\nA treatise on problems of maxima and minima solved by algebra\n. He writes:-\nFor the last four or five years I was desirous of solving almost all problems of Maxima and Minima by the principles of Algebra, and not by those of the Differential Calculus. ... I flatter myself with the hope that my labours will be of some use to those Mathematical students who are not advanced in their study of the Differential Calculus, and that the lovers of science, both in India and Europe, will give support to my undertaking.\nYou can read his complete Preface to the\n1850\nwork at\nTHIS LINK\n.\nThe book received a poor review in\nThe Calcutta Review\n[\n14\n]\n:-\nIt is with sincere regret that we are compelled to speak with very limited approval of the merits of this work, both as regards its object and its execution. The very nature of the problems of Maxima and Minima involves the idea, which is the fundamental one of the Differential Calculus; and, however it may be disguised, that idea must pervade all investigations of the problems. What then is the use of a cumbrous, and often inelegant, process of doing that without the Calculus, which, in reality, it is the proper duty of the Calculus to do, and which it does so much more simply and elegantly? We can see no advantage, in an educational point of view, in teaching this cumbrous method of dispensing with the acquisition of that, which is at once so easy of acquisition and so worthy of it, as\nTaylor\n's Theorem. In any other point of view, the thing is equally useless. ... While we are thus compelled to express our doubts, as to the utility of the object of the book, we cannot be much more complimentary as to the mode of its execution, which is, in general, clumsy and school-boy-like.\nYou can read the full review at\nTHIS LINK\n.\nRamchundra read this review which he was\n[\n15\n]\n:-\n... pleased to style \"very unfavourable,\" and like many others with even less grounds of complaint, he rushed to his own defence through the columns of the 'Englishman'. We are not aware that newspaper complaints and defences, so notoriously common in certain of the Calcutta Newspapers and so disgraceful to the press, ever bring any amends to the writers of them, or that the Editors find that in so satisfying a depraved appetite for gossip they increase the sale of their papers in certain quarters ...\nHowever, when\nAugustus De Morgan\nreceived a copy of the book in\n1850\n, he had a very different opinion of it. He reprinted the work in London in\n1859\nand wrote an Editor's Preface to the book which begins\n[\n3\n]\n:-\nIn the year\n1850\nmy friend the late J E Drinkwater-Bethune forwarded to England a number of copies of a work on Maxima and Minima, by Ramchundra, teacher of science, Delhi College, with directions to present copies to various persons, and among others to myself. On examining this work I saw in it, not merely merit worthy of encouragement, but merit of a peculiar kind, the encouragement of which, as it appeared to me, was likely to promote native effort towards the restoration of the native mind in India.\nYou can read the complete Preface by\nDe Morgan\nto the\n1859\nedition of Ramchundra's book at\nTHIS LINK\n.\nA review of this\n1859\nreprint containing\nDe Morgan\n's Editor's Preface also appeared in\nThe Calcutta Review.\nThis long review contains much material which is taken from\nDe Morgan\n's Editor's Preface but we give the full review at\nTHIS LINK\n.\nIn\n1852\nRamchundra converted to Christianity. You can read details of this in his own words at\nTHIS LINK\n.\nThe review\n[\n10\n]\nin\nThe Colonial Church Chronicle and Missionary Journal\nis, naturally, interested in Ramchundra's conversion. The author of this review writes:-\nWe have spoken of Ramchundra simply as a Hindu mathematician; he appears upon his own title page as \"late Teacher of Science, Delhi College;\" but probably many of our readers may be aware that he is also a baptised Christian, and that as such he very nearly lost his life in the late Indian troubles.\nThe 'Indian troubles' mentioned here are the Indian mutiny of\n1857\n-\n58\n. This rebellion against British rule in India was initiated by Indian troops in the service of the British East India Company. The rebellion began in Meerut and then spread to Delhi which the rebellious troops took over in May\n1857\n. Ramchundra gives a vivid account of how, as a Christian convert, he was in danger of his life\n[\n3\n]\n:-\nThe mutineers also inquired after me; but my younger brothers, who are as yet Hindus, concealed me in the female apartments of my family's house, in a lane, and my neighbours and acquaintances were kind enough not to betray me. On the evening of the third day, that is, on\n13\nth\nMay,\n1857\n, when it was dark, I escaped out of the city, accompanied by two faithful servants, who took me to the village of Mátola, about ten miles distant from Delhi. I remained in this village about a month, in great danger of being betrayed by those who were opposed to the zemindar who had very kindly lodged me in his house. Here I daily used to persuade the zemindars that it was wrong that the English were gone for ever, by telling them the vast resources, the power, and the knowledge of the English nation. On\n10\nth\nJune,\n1857\n, a body of mutineers passed by this village, and some one told them that a Christian was living in it; but my old servant was warned of this a few minutes before: he awakened me and told me of my danger. At first I hid myself in the zemindar's cottage, expecting to be found out and killed; but a very prudent Brahmin zemindar advised me and my servant to fly to the jungles before the mutineers could arrive. We did so; but before we could run three quarters of a mile, we heard a great noise in the village, bullets were whistling about us, and horsemen appeared to be in our pursuit, for the noise of galloping was distinctly heard. I then rushed into a thorny little bush, not minding the thorns that went into my flesh. By God's merciful providence the mutineers, after plundering and giving a good beating to the zemindars, &c. with whom I lived in the village, did not penetrate into the jungle, but went their way towards Delhi. When there was quiet towards the village, I and my old Jaut servant traversed the whole jungle, and with great difficulty reached the English camp on the\n12\nth\nJune,\n1857\n.\nAfter working as a translator in the English camp for a few months, he was appointed as headmaster of the Thomason Civil Engineering College at Roorkee in January\n1858\n. He held this position for eight months before becoming the headmaster of a newly founded Delhi District School towards the end of\n1858\n. We note that by this time the rebellion was defeated and Delhi was again under the control of the British. Ramchundra's health was not good at this stage and he retired from his position as headmaster on grounds of ill health in\n1866\nwhen\n45\nyears of age. However, he continued working in the service of the Maharaja of Patiala, a state in the Punjab in north west India. In\n1870\nhe became director of education in Patiala. His health deteriorated rapidly, however, and he devoted much of his time in his last years to Christian missionary work.\nWe noted above that the review\n[\n10\n]\nis concerned as much with Ramchundra's conversion to Christianity as with his mathematics. The author ends his review with the following comment:-\nWhen we have added that it has come to our knowledge, from another source, that Ramchundra was on one occasion beaten in the public road, by a person in British uniform, because he had neglected to make his salaam as he passed, we think we shall have said enough to stir up some earnest thoughts concerning the impediments to the propagation of the Gospel in India.\nC Musès ends the excellent article\n[\n6\n]\nwriting:-\nRamchundra ends his book on page\n185\nby saying he had more to say, \"but being afraid of enlarging the work too much, I conclude these sheets.\" We may well wish the author had not so politely \"feared\" here, for he placed a jewel in our hands. Several years after finding Ramchundra, I came across Ivan Niven's well written-book 'Maxima and Minima Without Calculus'\n(\nMathematical Association of America,\n1981)\n. Though Niven addresses the same ideas and even some of the same problems as Ramchundra addressed over a century earlier, he has completely overlooked his Indian predecessor. Despite the illustrious\nDe Morgan\n's efforts to make this remarkable Hindu algebraist known, Ramchundra does not appear in Niven's text, index, or bibliography."
}