{
  "nome_completo": "Renfrey Burnard Potts",
  "nome_curto": "Renfrey Potts",
  "ano_nascimento": "1925",
  "ano_morte": "2005",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Potts/",
  "lugar_nascimento": "Adelaide, Australia",
  "lugar_morte": "Adelaide, Australia",
  "biografia": "Renfrey Potts\n, known as Ren, was the son of G M Potts. He attended Rose Park Primary School and completed his secondary school education at Prince Alfred College in Adelaide.  In\n1943\nhe began an accelerated engineering course at the University of Adelaide but because of the end of war and the greater delights of mathematics, he switched his field of study and obtained a First Class Honours in Mathematics from Adelaide in\n1947\n.  After a brief stint as a junior lecturer at Adelaide, he went to Oxford as a Rhodes Scholar in\n1948\n.  His interests turned to mathematical physics and he received his Ph.D. from Oxford in\n1951\nwith a dissertation on Ising models under the supervision of Cyril Domb.  The 'Potts model', which he developed in his thesis, is a generalization of the Ising model for interacting spins on a crystalline lattice.  His paper on this\nSome Generalized Order-Disorder Transformations\n, in the\nProceedings of the Cambridge Philosophical Society\n(1952)\nis his most cited paper.\nHe carried out post-doctoral work on cosmic rays with Harry Messel at the University of Sydney and also had a post-doctoral position at the University of Maryland\n1955\n-\n56\n.  He was again in Australia at the University of Adelaide in\n1957\n. As an Associate Professor at the University of Toronto\n1958\n-\n59\nhe became interested in operations research, the beginning of a life-long interest in the applications of mathematics to real-world problems. While there, he acted as a consultant to General Motors in Detroit and worked on 'car-following' models, studying the interactions between pairs of vehicles on a busy highway.  This was then used for macroscopic traffic engineering concepts.  Successful prediction of optimum speeds for dense traffic through New York's Holland tunnel was based on experiments done with just two cars on General Motors's testing track in Detroit.\nPotts was appointed to a newly created chair in applied mathematics at the University of Adelaide in\n1959\nwhere he remained until his retirement in\n1990\n.  Potts served as head of the department and was a leader both in his department and in Australian mathematics in general, especially in applied mathematics.  Along with Eric Barnes he oversaw the formation at Adelaide of a Faculty of Mathematical Sciences including Pure Mathematics, Applied Mathematics, Statistics, Mathematical Physics, and Computer Science.  He supervised\n20\nPh.D. students and\n4\nM.Sc. students.  He was a member of the\nAustralian Mathematical Society\nand served on its Council.  He was one of the founders of the Division of Applied Mathematics of the Society which eventually became ANZIAM and was an editor of what is now called the ANZIAM Journal.\nIn addition to research on Ising-type models in mathematical physics and on road traffic analysis, Potts contributed to three other areas of research: operations research, especially networks; difference equations; and robotics.  Along with Robert Oliver, he authored the book\nFlows in Transportation Networks\n.  W-K Chen writes:-\nThis book provides an introductory treatment of the transportation models and is aimed primarily at first-year graduate students in operations research. It will also be useful for those who are interested in the applications of graph theory in general and traffic problems in particular.\nThe book begins with an introductory chapter describing a variety of transportation networks, followed by a chapter on the basic definitions of terms on graph theory and the flow concepts used in transportation problems. It then introduces in Chapter\n3\nthe extremal principles, the equilibrium flow patterns, and their applications to treebuilding algorithms and traffic assignment procedures. The last chapter is devoted to an analysis of several trip distribution models\n(\nHitchcock model, entropy models, and Stouffer's opportunity models\n)\n.\nHe was interested in computing from the early days of the computing revolution and oversaw the first computer purchases at the University of Adelaide.\nPotts was an outstanding lecturer who drew large audiences to his talks.  In addition to mathematics, he was interested in sports and music.  His sporting activities included long distance and marathon running, hockey, tennis, squash, badminton, bushwalking, and swimming.  He played both the piano and the clarinet and was a volunteer disc jockey at a local radio station.  He married his wife Barbara Kidman\n(\na computer scientist\n)\nin Oxford on\n1\nJuly\n1950\n.  They had two daughters, Linda and Rebecca.\nAmong the honours which were given to Potts for his outstanding contributions we mention election to the\nAustralian Academy of Science\nin\n1975\n, elecion to the Australian Academy of Technological Sciences and Engineering in\n1983\n. He became an Officer of the Order of Australia in\n1991\nand was awarded the ANZIAM Medal in\n1995\n."
}