{
  "nome_completo": "Richard von Mises",
  "nome_curto": "Richard von Mises",
  "ano_nascimento": "1883",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mises/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Boston, Massachusetts, USA",
  "biografia": "Richard von Mises\nwas born in Lviv when it was under Austrian control and known as Lemberg. His father, Arthur Edler von Mises, worked for the Austrian State Railways as a technical expert and his mother was Adele von Landau. Richard was the second son of the family, the elder son being Ludwig von Mises who went on to become as famous as Richard. Ludwig, who was about eighteen months older than Richard, went on to become an economist who contributed to liberalism in economic theory and made his belief in consumer power an important part of that theory. Richard also had a younger brother, who died as an infant.\nIt was on the technical course that von Mises embarked, studying mathematics, physics and engineering at the Technische Hochschule in Vienna. After graduating he was appointed as\nGeorg Hamel\n's assistant in Brünn. The city of Brünn is today called Brno in the south-eastern Czech Republic. Up to World War II the inhabitants were predominantly German, although today they are now mainly Czech. Von Mises was awarded a doctorate from Vienna in\n1907\nand the following year he was awarded his\nhabilitation\nfrom Brünn, becoming qualified to lecture on engineering and machine construction.\nHe was professor of applied mathematics at Strasbourg\n(\nthen called Strassburg\n)\nfrom\n1909\nuntil\n1918\n, although this was a period which was interrupted by World War I. Even before the outbreak of the war von Mises had qualified as a pilot and he gave the first university course on powered flight in\n1913\n. When war broke out von Mises joined the Austro-Hungarian army and piloted aircraft. He had lectured on the design of aircraft before the war and he now put this into practice leading a team which constructed a\n600\n-horsepower plane for the Austrian army in\n1915\n.\nAfter the end of the war von Mises was appointed to a new chair of hydrodynamics and aerodynamics at the Technische Hochschule in Dresden. Appointed in\n1919\nhe soon moved again, this time to the University of Berlin to become the director of the new Institute of Applied Mathematics which had been set up there.\nSchmidt\nhad argued for the setting up of the Institute in\n1918\n:-\nThe pervasion of practical life by mathematical methods, as a result of the development of technology before the war and, above all, the unexpected need for ... mathematicians during the war make it an undeniable necessity to install applied mathematics at the largest Prussian university... Among university students, however, one frequently finds the opinion that applied mathematics is a subject of inferior importance, which does not require one's full attention. to create a new tradition, it needs an important personality of approved name. Such a personality can only be attracted by a full professorship.\nThese words by\nSchmidt\nshow great wisdom, and the authorities did indeed create the full professorship and made an inspired choice for the first holder in von Mises.\nOstrowski\nwrote in a\n1965\nlecture\n(\nsee for example\n[\n16\n]\n)\n:-\nOnly with the appointment of Richard von Mises to the University of Berlin did the first serious German school of applied mathematics with a broad sphere of influence come into existence. Von Mises was an incredibly dynamic person and at the same time amazingly versatile like\nRunge\n. He was especially well versed in the realm of technology.\nThe Institute of Applied Mathematics flourished under his control. In\n1921\nhe founded the journal\nZeitschrift für Angewandte Mathematik und Mechanik\nand he became the editor of the journal. In the first edition he wrote an introduction stressing the wide range of applied mathematics and also the fact that the line between pure and applied mathematics is not a fixed one, but one which changes over time as different areas of \"pure mathematics\" find applications in practical situations.\nHe set up a new curriculum for applied mathematics at the university which spread over six semesters and included applications of mathematics to astronomy, geodesy and technology. It was not a \"soft option\" and von Mises went out of his way to stress that applied mathematics was every bit as rigorous as pure mathematics requiring\n[\n13\n]\n:-\n... a mathematical model of the widest possible generality, where the argument could be made with clarity, elegance, and rigour.\nHis Institute rapidly became a centre for research into areas such as\nprobability\n, statistics, numerical solutions of\ndifferential equations\n, elasticity and aerodynamics. Von Mises was also an excellent lecturer. Collatz, one of his students, wrote:-\nI was enrolled in Berlin in\n1930\n. ... Professor Dr Richard von Mises\n[\ngave\n]\nexcellent, very clear and stimulating lectures on applied analysis ....\nThe paper\n[\n8\n]\n, written by Collatz, discusses von Mises' work on numerical mathematics, discusses his founding of the journal\nZeitschrift für Angewandte Mathematik und Mechanik\nand looks at the difficulties faced by von Mises in bringing up the status of applied mathematics during the\n1920\ns and early\n1930\ns.\nOn\n30\nJanuary\n1933\n, however, Hitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Von Mises in one sense was not Jewish for he was a Roman Catholic by religion. He still fell under the non-Aryan definition of the act but there was an exemption clause which exempted non-Aryans who had fought in World War I. Von Mises certainly qualified under this clause and it would have allowed him to keep his chair in Berlin in\n1933\n. He realised, quite correctly, that the exemption clause would not save him for long. On the\n10\nJune\n1933\nhe wrote to von\nKármán\nabout a young German, Walter Tollmien, who was looking for a position:-\nI have to advise you that the irrevocable prerequisite for any kind of employment or scholarship or suchlike is to make a statement on his word of honour that his four grandparents are Aryan and in particular are of non-Jewish descent. ... I believe that in a favourable case the prospects are not quite so bad as indeed a large part of all the previous candidates can be omitted under the present law.\nVon\nKármán\nforwarded the letter to Tollmien, writing \"Indeed a document of our time\" on the back!\nVon Mises saw an offer of a chair in Turkey as a way out of his predicament in Germany but he tried to ensure that his pension rights were preserved. On\n12\nOctober\n1933\nhe wrote to the ministry explaining that it would benefit Germany if he accepted a post in Turkey and that he should be allowed to retain his pension rights for his\n24\nyears of service. He received the reply that he would have to relinquish all rights of a salary, a pension or support for his dependants. He protested in a further letter to the Ministry that he was legally entitled to rights that he was not prepared to relinquish. The Nazi Theodor Vahlen wanted to take over as director of the Institute despite poor academic qualities. He promised von Mises that if he would support him to succeed as Director of the Institute then he would ensure that von Mises would not lose his pension rights.\nIn October\n1933\nvon Mises wrote his letter to support Vahlen as his successor. Collatz, von Mises' student, wrote:-\nI took my\nStaatsexamen\nin November\n1933\n, and Professor von Mises examined me on the day before his departure. The same day, he talked to me for about one hour, giving advice for my further research ...\nVahlen was appointed Director of the Institute in December\n1933\n. Having taken up the new chair in Istanbul, von Mises received a letter in January\n1934\ndenying him any rights at all. It was something that von Mises continued to feel extremely aggrieved about, writing to the Ministry in\n1953\n, shortly before his death, still trying to restore his rights.\nThe mathematician\nHilda Geiringer\nfollowed him to Istanbul in\n1934\n. There she was appointed as professor of mathematics.\nIn\n1938\nKemal Atatürk died and those in Turkey who had fled from the Nazis feared that their safe haven would become unsafe. In\n1939\nvon Mises left Turkey for the United States. He became professor at Harvard University and in\n1944\nhe was appointed Gordon-McKay Professor of Aerodynamics and Applied Mathematics there.\nGeiringer\nfollowed him to the USA and they were married in\n1943\n.\nVon Mises worked on fluid mechanics, aerodynamics, aeronautics, statistics and probability theory. He classified his own work, not long before his death, into eight areas: practical analysis, integral and differential equations, mechanics, hydrodynamics and aerodynamics, constructive geometry, probability calculus, statistics and philosophy. He introduced a stress\ntensor\nwhich was used in the study of the strength of materials. His studies of wing theory for aircraft led him to investigate turbulence. Much of his work involved numerical methods and this led him to develop new techniques in numerical analysis. His most famous, and at the same time most controversial, work was in probability theory.\nHe made considerable progress in the area of frequency analysis which was started by\nVenn\n. He combined the idea of a\nVenn\nlimit and a random sequence of events.\nOstrowski\nin the same lecture which we quoted from above wrote\n(\nsee for example\n[\n16\n]\n)\n:-\nBecause of his dynamic personality his occasional major blunders were somehow tolerated. One has even forgiven him his theory of probability.\nThis judgement by\nOstrowski\nis rather harsh, however, and many consider von Mises' theories to be important in the development of the subject. After the\nmeasure theory\napproach by\nKolmogorov\nhad become favoured by almost all statisticians over von Mises' limiting frequency theory approach, there was a return to von Mises ideas and there was an attempt to incorporate them into the measure theoretic approach of\nKolmogorov\nwho wrote himself in\n1963\n:-\n... that the basis for the applicability of the results of the mathematical theory of probability to real 'random phenomena' must depend on some form of the frequency concept of probability, the unavoidable nature of which has been established by von Mises in a spirited manner.\nIn paper\n[\n18\n]\ndiscusses:-\n... von Mises' notion of a random sequence in the context of his approach to probability theory.\n[\nThe author claims\n]\nthat the acceptance of\nKolmogorov\n's rival axiomatisation was due to a different intuition about probability getting the upper hand, as illustrated by the notion of a\nmartingale\n.\nPhillip\nFrank\n, writing in\n[\n4\n]\nsays:-\n... in looking over the work of von Mises ... we cannot fail to recognise a whole spectrum of research, extending from the philosophical meaning of science to practical methods of numerical computation. ... von Mises has always been a truly broad-minded man ... notwithstanding the wide range of his topics, his work shows a great intrinsic unity: starting from a definite center, it branches out in systematic investigations of a great diversity of problems. ... von Mises chose the topics according to a very definite view-point, determined by his ideas about the essence and method of every thoroughly scientific research.\nIn von Mises' book\nPositivism: A Study in Human Understanding\n(1951)\nhe expressed his views on science and life. He subscribes to a doctrine of positivism in the book saying:-\nPositivism does not claim that all questions can be answered rationally, just as medicine is not based on the premise that all diseases are curable, or physics does not start out with the postulate that all phenomena are explicable. But the mere possibility that there may be no answers to some questions is no sufficient reason for not looking for answers, or for not using those which are attainable.\nThis interest in philosophy was only one of von Mises' interests outside the realm of mathematics. Another was the fact that he was an international authority on the Austrian poet Rainer Maria Rilke\n(1875\n-\n1926)\n.\nIn\n1950\nvon Mises was offered honorary membership of the East German Academy of Science. This was difficult for von Mises, particularly in McCarthy era America where any link with communism would have been viewed as a serious offence. He sadly declined in a letter written on\n15\nSeptember\n1950\n:-\nI would very gladly accept the nomination in remembrance of my teaching activities in Berlin and thus re-establish the bond which connected me for a long time to the German scientific life. Unfortunately the present circumstances in Germany as well as those in this country are such that the acceptance of such a distinction could be interpreted as a political demonstration on my part. ... I only relinquish acceptance of this nomination under the pressure of outward circumstances, a nomination which I regard as a great honour in every respect."
}