{
  "nome_completo": "Richard  Phillips Feynman",
  "nome_curto": "Richard Feynman",
  "ano_nascimento": "1918",
  "ano_morte": "1988",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Feynman/",
  "lugar_nascimento": "Far Rockaway, New York, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Richard Feynman\n's parents were Melville Feynman and Lucille Phillips. Melville was born into a Jewish family in Minsk, Belarus, and emigrated with his parents to the United States when he was five years old. He was a business man who tried, not too successfully, many different types of business. It is clear that his talents were not in business but rather in science which was the subject that fascinated him but he never had the opportunity to make a career from it. Lucille Phillips was born in the United States into a Jewish family. Lucille's father had emigrated from Poland and her mother also came from a family of Polish immigrants. She trained as a primary school teacher but married Melville in\n1917\nbefore taking up a profession.\nAfter their marriage Lucille and Melville Feynman moved into a Manhattan apartment and, in the following year, their first child Richard was born. Melville wanted his first child to be a son and he also wanted him to become a scientist so, overjoyed when he got the son he wanted, he did all he could to interest Richard in science throughout his childhood. Gleick writes\n[\n6\n]\n:-\nMelville's gift to the family was knowledge and seriousness. Humour and storytelling came from Lucille.\nTragedy struck the family when Richard was five years old for Lucille and Melville had a second son who died when four weeks old. It meant that a sadness fell over the household which must have greatly affected the young Richard. After this, he remained an only child until his sister Joan was born when he was nine years old. The family moved several times during these years but when Richard was ten they settled in Far Rockaway.\nRichard, or Ritty as his friends called him, learnt a great deal of science from Encyclopaedia Britannica and taught himself elementary mathematics before he encountered it at school. He also set up a laboratory in his room at home where he experimented with electricity. In particular he wired circuits with light bulbs, he invented a burglar alarm, and he took radios apart to repair damaged circuits. When he entered Far Rockaway High School his interests were almost entirely mathematics and science. He found little liking for arts type subjects at this time\n[\n4\n]\n:-\nI always worried about being a sissy; I didn't want to be too delicate. To me, no real man ever paid any attention to poetry and such things.\nAt school Feynman approached mathematics in a highly unconventional way. Basically he enjoyed recreational mathematics from which he derived a large amount of pleasure. He studied a lot of mathematics in his own time including trigonometry, differential and integral calculus, and complex numbers long before he met these topics in his formal education. Realising the importance of mathematical notation, he invented his own notation for sin, cos, tan,\nf\n(\nx\n)\nf (x)\nf\n(\nx\n)\netc. which he thought was much better than the standard notation. However, when a friend asked him to explain a piece of mathematics, he suddenly realised that notation could not be a personal matter since one needed it to communicate. He really enjoyed mathematics competitions and was a real star in his school. In his final year at Far Rockaway High School he won the New York University Math Championship.\nAfter leaving school he applied to several universities to study there. One would have expected every university to which he applied would enthusiastically offer him a place but it was not that easy. Although his grades in mathematics and science were outstanding, he had performed much less well in other subjects. There was also the \"problem\" that he was a Jew, which really was a problem in the United States at this time with universities having quotas on the number of Jews they admitted. He sat an entrance examination for Columbia University and they turned him down. He never quite forgave them for charging him\n15\ndollars and then rejecting him. He was accepted, however, by the Massachusetts Institute of Technology.\nHe entered MIT in\n1935\nand, after four years study, obtained his B.Sc. in\n1939\n. He went there to study mathematics but, although he found the courses easy, he became increasingly worried by the abstraction and lack of applications which characterised the course at this time. He read\nEddington\n's\nMathematical Theory of Relativity\nwhile in his first year of studies and felt that this was what he wanted from mathematics. His mathematics lecturers presented him with the view that one did mathematics for its own sake so Feynman changed courses, taking electrical engineering. Very quickly he changed again, this time moving into physics. It is interesting to think that had Feynman taken the mathematics course at Cambridge which\nHoyle\ntook around the same time, he would have found it exactly what he wanted.\nThe physics course that Feynman took at MIT was not the standard one. He took Introduction to Theoretical Physics, a class intended for graduate students, in his second year. There was no course on\nquantum mechanics\n, a topic that Feynman was very keen to study, so together with a fellow undergraduate, T A Welton, he began to read the available texts in the spring of\n1936\n. Returning to their respective homes in the summer of\n1936\nthe two exchanged a series of remarkable letters as they tried to develop a version of space-time where\n(\nquoted from one of the letters - see\n[\n6\n]\n)\n:-\n... electrical phenomena\n[\nare\n]\na result of the metric of a space in the same way that gravitational phenomena are.\nBy\n1937\nFeynman was reading\nDirac\n's\nThe principles of quantum mechanics\nand seeing how his highly original ideas fitted into\nDirac\n's approach. In fact\nDirac\nbecame the scientist who Feynman most respected throughout his life.\nWe mentioned above that Feynman went home for his vacations. In fact he applied for summer jobs at the Bell Telephone Laboratories every summer but was always refused a position there despite the highest recommendations. Although it can never be proved, there seems no other reason that he would be turned down other than that he was Jewish.\nAs he approached the end of his remarkable four undergraduate years at MIT he began to think about studying for his doctorate. Since he had been so happy at MIT and also believing it to be the leading institution, he approached the head of physics, John Slater, requesting that he stay on to take a Ph.D. course. Slater told him that for his own good he had to move and he suggested Princeton.\nDespite the personal recommendation that Harry Smyth at Princeton received from Slater, it was not obvious that Feynman would be accepted. He had the best grades in physics and mathematics that anyone had seen, but on the other hand he was close to the bottom in history, literature and fine arts. He had one other thing going against him - namely that he was Jewish. Smyth wrote:-\nIs Feynman Jewish? We have no definite rule against Jews but have to keep their proportion in our department reasonably small because of the difficulty of placing them.\nAfter further letters from Slater, Feynman was accepted by Princeton. His doctoral work at Princeton was supervised by John Wheeler, and after finding the first problem that Wheeler gave him rather intractable, he went back to ideas he had thought about while at MIT. The first seminar that he gave at Princeton was to an audience which included\nEinstein\n,\nPauli\nand\nvon Neumann\n.\nPauli\nsaid at the end\n[\n4\n]\n:-\nI do not think this theory can be right ...\nIn retrospect, Feynman thought that\nPauli\nmust have seen difficulties at once, for after Feynman had spent a long time working on it, he too thought that it was not satisfactory. However, he then went on to develop a new approach to quantum mechanics using the principle of least action. He replaced the wave model of electromagnetics of\nMaxwell\nwith a model based on particle interactions mapped into space-time. Gleick writes\n[\n6\n]\n:-\nThis was Richard Feynman nearing the crest of his powers. At twenty-three ... there was no physicist on earth who could match his exuberant command over the native materials of theoretical science. It was not just a facility at mathematics\n(\nthough it had become clear ... that the mathematical machinery emerging from the Wheeler-Feynman collaboration was beyond Wheeler's own ability\n)\n. Feynman seemed to possess a frightening ease with the substance behind the equations, like\nEinstein\nat the same age, like the Soviet physicist\nLev Landau\n- but few others.\nHe received his doctorate from Princeton in\n1942\nbut before this time the United States had entered World War II.\nFeynman worked on the atomic bomb project at Princeton University\n(1941\n-\n42)\nand then at Los Alamos\n(1943\n-\n45)\n. When he was approached during his final year of research to take part in the project his first reaction had been a very definite no since he was entering the final stages of work for his thesis at the time\n[\n4\n]\n:-\n... I went back to my thesis - for about three minutes. Then I began to pace the floor and think about the thing. The Germans had Hitler and the possibility of developing an atomic bomb was obvious, and the possibility that they would develop it before we did was very much of a fright.\nFeynman began work on the Manhattan project at Princeton developing a theory of how to separate Uranium\n235\nfrom Uranium\n238\n, while his thesis supervisor Wheeler went to Chicago to work with\nFermi\non the first nuclear reactor.\nWigner\n, in Wheeler's absence, advised Feynman to write up his thesis and after Wheeler and\nWigner\nexamined the work he received his doctorate in June\n1942\n.\nFeynman had a difficult personal problem at this time. His girlfriend of many years, Arlene Greenbaum, had been diagnosed as having tuberculosis and his family opposed their marriage. Shortly after he was awarded his doctorate Feynman married Arlene with no family members present. Shortly after his marriage Feynman went to the newly constructed Los Alamos site to work on the atomic bomb project. His remarkable abilities soon led to him being appointed as head of the theoretical division. Arlene died in\n1945\njust before the first test of the bomb. Feynman would marry twice more and have two children with his third wife.\nAfter World War II, in the autumn of\n1945\n, Feynman was appointed as a professor of theoretical physics at Cornell University. At first he devoted himself to teaching and put his research aside. The pressure of the work at Los Alamos, together with the personal stress of watching his wife's health decline, had taken its toll. He wrote\n[\n4\n]\n:-\nIf you're teaching a class, you can think about the elementary things that you know very well. These things are kind of fun and delightful. It doesn't do any harm to think them over again. Is there a better way to present them? The elementary things are easy to think about; if you can't think of a new thought, no harm done; what you thought about it before is good enough for the class. If you do think of something new, you're rather pleased that you have a new way of looking at it.\nHe received offers of posts at other universities but felt that as a non-researcher he could not even consider them. Suddenly the desire to undertake research hit him again and he returned to the quantum theory of electrodynamics that he was working on before World War II.\nIn\n1950\nFeynman accepted a position as professor of theoretical physics at the California Institute of Technology. Since he had already planned a sabbatical leave before receiving the offer, he was able to arrange to spend the first ten months of his new appointment in Brazil. He remained at Cal tech for the rest of his career, being appointed Richard Chace Tolman Professor of Theoretical Physics there in\n1959\n.\nFeynman's main contribution was to quantum mechanics, following on from the work of his doctoral thesis. He introduced diagrams\n(\nnow called Feynman diagrams\n)\nthat are graphic analogues of the mathematical expressions needed to describe the behaviour of systems of interacting particles. He was awarded the Nobel Prize in\n1965\n, jointly with\nSchwinger\nand Tomonoga:-\n... for fundamental work in quantum electrodynamics, with deep-ploughing consequences for the physics of elementary particles.\nOther work on particle spin and the theory of 'partons' which led to the current theory of quarks were fundamental in pushing forward an understanding of particle physics.\nIn early\n1979\nFeyman's health had deteriorated and he had surgery for stomach cancer. This was very successful and his doctors believed that he would not suffer a recurrence. After his recovery he enjoyed the limelight as a famous public figure, a role which was enhanced when the book\n[\n4\n]\nbecame a surprise best seller. His final major task was as a member of a committee set up to investigate the cause of the explosion on the space shuttle Challenger on Tuesday\n28\nJanuary\n1986\n. The fascinating story of the science and politics of this investigation is told in Feyman's own words in\n[\n5\n]\n. It was a very difficult time for Feyman since throughout the investigation his health was deteriorating. Near the end of\n1987\ncancer was found again in his abdomen. After his death, Chandler wrote on\n17\nFebruary\n1988\nin\n[\n17\n]\n:-\nFeynman, who died at the University of California at Los Angeles Medical Center after an eight-year battle with abdominal cancer, was a popular and energetic lecturer who, despite his illness, continued to teach at the California Institute of Technology until two weeks ago.\nFeynman's books include many outstanding ones which evolved out of lecture courses. For example\nQuantum Electrodynamics\n(1961)\nand\nThe Theory of Fundamental Processes\n(1961)\n,\nThe Feynman Lectures on Physics\n(1963\n-\n65)\n(3\nvolumes\n)\n,\nThe Character of Physical Law\n(1965)\nand\nQED: The Strange Theory of Light and Matter\n(1985)\n.\nIn\n[\n6\n]\nGleick described Feynman's approach to science:-\nSo many of his witnesses observed the utter freedom of his flights of thought, yet when Feynman talked about his own methods not freedom but constraint ... For Feynman the essence of scientific imagination was a powerful and almost painful rule. What scientists create must match reality. It must match what is already known. Scientific creativity, he said, is imagination in a straitjacket ... The rules of harmonic progression made for Mozart a cage as unyielding as the sonnet did for Shakespeare. As unyielding and as liberating - for later critics found the creator's genius in the counterpoint of structure and freedom, rigour and inventiveness.\nFeynman received many honours for his work. He was elected to the American Physical Society, the American Association for the Advancement of Science, the\nNational Academy of Science\n, and the\nRoyal Society of London\n. Among the awards he received were the\nAlbert Einstein\nAward\n(1954)\nand the Lawrence Award\n(1962)\n.\nAs to Feynman's character, he was described in\n[\n17\n]\nas follows:-\nHe was widely known for his insatiable curiosity, gentle wit, brilliant mind and playful temperament.\nGleick\n[\n6\n]\ndescribes him as:-\n... mystifyingly brilliant at calculating, strangely ignorant of the literature, passionate."
}