{
  "nome_completo": "Richard Alfred Tapia",
  "nome_curto": "Richard Tapia",
  "ano_nascimento": "1939",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tapia/",
  "lugar_nascimento": "Santa Monica, California, USA",
  "lugar_morte": null,
  "biografia": "Richard Tapia\n's parents were Amado and Magda Tapia. He was born into an Hispanic American family with his father Amado Tapia emigrating to the United States from Nayarit in Central Mexico, while his mother Magda emigrated from Chihuahua in Northern Mexico. Richard and his twin brother were the eldest children in the family of five, having two younger brothers and one sister. Amado and Magda never completed their school education since both of them had to leave school to help support their families. However they provided encouragement to their children:-\nI learned from my mother and father many important things - good work habits, belief in yourself, pride in who you are, respect for others, and sensitivity to their needs. My mother taught me that you can do anything that you want; you just have to stay determined and not give up. There was nothing that was going to prevent my mother from achieving her goal once she set her mind to it.\nRichard developed a liking for mathematics while at school:-\n... from the first grade on, my brother and I did very well in mathematics. ... We were both considered mathematics stars by our teachers. I think my love for mathematics may have come from the Mayas, one of the first civilizations to deeply understand mathematics and astronomy.\nRichard and his brother developed another interest while at school which had nothing to do with their academic work. They became interested in racing cars, in particular drag racing, from the time they were fifteen years old. It was an interest which Richard continued to enjoy and he went on to hold a drag racing world record in\n1968\n. He is most certainly the only mathematician in this archive to hold a drag racing world record! He has even written an article on the mathematics of car racing.\nThe High School did not encourage Tapia to be as ambitious as he should have been, and in many ways one can see that he has devoted an enormous effort throughout his professional career to ensure that minorities and women today receive the encouragement which he himself did not:-\nI had not been advised in high school that I could attend a four-year college such as the University of California, even though my grades were good enough.\nInstead of going to the University of California, Tapia studied at Harbor Junior College in Wilmington, California. He was awarded an Associates of Arts degree from Harbor Junior College after two years of study but at this College the staff did realise his mathematical potential and encouraged Tapia to be more ambitious about his educational aims:-\n... at junior college, my mathematical talents were noticed, and I was encouraged to apply to the University of California, Los Angeles.\nHe entered the University of California and while he was studying there for his bachelor of arts degree he married Jean Rodriguez on\n25\nJuly\n1959\n. The University of California at Los Angeles awarded Tapia an B.A. in\n1961\n. Tapia did not proceed immediately to graduate studies but first he was employed as a mathematician working on ship design at Todd Shipyards, San Pedro, California.\nHe began his graduate studies at the University of California, Los Angeles in\n1963\nbut he had little money with which to support his family which by this time included a child Circee:-\nWhile I was in graduate school, my wife and I did not have a lot of money, but that was okay. This was a wonderful point in my life. At one time we did not even have a phone. For the first years of graduate school, I supported myself. Eventually, because I was doing well, I did receive support from the department of mathematics and the Office of Naval Research.\nFrom\n1963\nto\n1966\nas well as his graduate studies, he worked part-time as a scientific programmer for IBM in Los Angeles. He received his M.A. in\n1966\nand then, in the following year submitted his thesis\nA Generalization of\nNewton\n's Method with an Application to the\nEuler\n-\nLagrange\nEquation\nwhich led to the award of a Ph.D. By this time he had been persuaded to follow an academic career:-\nI had planned to work for industry after completing my doctorate, but many of my professors felt that I would make a good researcher and teacher; so I decided to pursue a university career.\nAfter working in the Department of Mathematics at UCLA in\n1967\n-\n68\n, during which time his second child Richard was born, he then spent the next two years on an applied mathematics postdoctoral fellowship at the University of Wisconsin. During this time he began to publish articles, the first one\nAn application of a Newton-like method to the Euler-Lagrange equation\nin\n1969\nbased on the work of his doctoral thesis. In it Tapia considered the solution of the equation\nP\n(\nx\n)\n=\n0\nP(x) = 0\nP\n(\nx\n)\n=\n0\n, where\nP\nP\nP\nis a nonlinear mapping between Banach spaces. He used\nNewton\n-like iterations to solve the generalized Euler-Lagrange equation of the calculus of variations.\nAlso in\n1969\nhe published\nThe weak Newton method and boundary value problems\n. Tapia explains in the introduction to this paper what he is setting out to do:-\nIn this paper we show that the\nKantorovich\ntheorem gives useful results when stated in terms of a\nNewton\n-like method called the weak\nNewton\nmethod. It is also shown that this procedure can be applied to a class of two point boundary value problems containing the\nEuler\n-\nLagrange\nequation for simple variational problems and most second order ordinary differential equations.\nIn\n1970\nHamel versus Schauder dimension\nwas published by Tapia in the\nAmerican Mathematical Monthly\n. Also in this year he lectured to the Advanced Seminar at the Mathematics Research Center at the University of Wisconsin, Madison on\nThe differentiation and integration of nonlinear operators\n. L B Rall, describing the resulting publication, writes:-\nThe exposition of these concepts is elegant, and the proofs are crisp.\nIt was in this year of\n1970\nthat Tapia moved to Rice University in Houston, Texas, where he was promoted to associate professor two years later, and then to full professor in\n1976\n. He chaired the Department of Mathematical Sciences, Rice University from\n1978\nto\n1983\n. He was honoured by Rice when he was named Noah Harding Professor of Computational and Applied Mathematics in\n1991\n.\nTapia has seen two different, but closely related, strands to his career. On the one hand he has produced many excellent mathematics papers while on the other hand he has devoted great energies to improving the lot of minorities in mathematics and science:-\nWhen I made my career choice, I knew I wanted to reach out to under-represented groups, especially Hispanics. I wanted to show minority students that if they really want to do something, they can. I believe I can improve minorities' participation in science and mathematics. However, in order to do this, I have to serve as a role model by first being an excellent scientist.\nTapia has received many awards for his outstanding contributions. He was named as one of twenty most influential leaders in minority mathematics education by National Research Council in\n1990\n. In\n1992\nhe was elected to the National Academy of Engineering, and in\n1994\nhe received the A Nico Habermann Award. Fred W Weingarten presenting Tapia with this award said:-\nRichard Tapia has worked tirelessly and successfully to encourage and assist minority students in following careers in the computing field. He embodies the values and spirit recognized by the A Nico Habermann Award, and he is a most appropriate first recipient.\nFurther honours came his way. In\n1996\nhe was appointed to serve on the National Science Board by President Clinton, was named Hispanic Engineer of the Year, and he received the Presidential Award for Excellence in Mathematics, Science, and Engineering Mentoring. Two years later, in\n1998\n, the American Association for the Advancement of Science presented him with their Mentor-Lifetime Achievement Award. Among many other awards let us mention the Giants in Science Award from the Quality Education for Minorities Mathematics, Science, and Engineering Network presented to him in\n1999\n. In the same year he was honoured with the inauguration of the Blackwell-Tapia Lecture Series by Cornell University, Ithaca. He was awarded the Reginald H Jones Distinguished Service Award from National Action Council for Minorities in Engineering in\n2001\nand in the following year he was inducted into the Texas Science Hall of Fame. In\n2003\nhe was awarded an Honorary Doctorate in Engineering by the Colorado School of Mines, and in the following year an Honorary Doctorate of Science and Technology from Carnegie Mellon University, Pittsburgh. On\n8\nJanuary\n2004\nhe received the\n2004\nAward for Distinguished Public Service from the American Mathematical Society at the Joint Mathematics Meetings in Phoenix, Arizona, then on\n14\nJuly\n2004\nhe received the SIAM Prize for Distinguished Service to the Profession. In\n2005\n, as well as receiving the Gary D Keller Award from Arizona State University, he was named University Professor by Rice University, Houston. He became only the sixth person and the first mathematician to be named University Professor in the\n94\n-year history of Rice University.\nLet us end this biography with the message that Tapia has for minority students:-\nI want to tell minority students that they must not close their eyes to the possibility of a career in science or mathematics."
}