{
  "nome_completo": "Richard Ernest Bellman",
  "nome_curto": "Richard Bellman",
  "ano_nascimento": "1920",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Bellman/",
  "lugar_nascimento": "Brooklyn, New York City, USA",
  "lugar_morte": "Los Angeles, California, USA",
  "biografia": "Richard Bellman\n's father was John James Bellman and his mother was Pearl Saffian. Both sides of the family came from Jewish descent, with both John Bellman's father having emigrated from Russia and Pearl Saffian's father having emigrated from Poland. Despite the Jewish descent, the family that Richard was born into were agnostics.\nThe Great Depression began in\n1929\n, when Richard was nine years old, and by\n1932\none quarter of the workers in the United States were unemployed. The Depression of the\n1930\ns saw low wages and there was much anti-Semitism. John Bellman was ruined by the Depression but, despite great hardship, managed to see Richard obtain a good education. Richard first met mathematics at the age of eleven when he studied Schultze's\nElementary and advanced algebra\n. He was not only thrilled with this early encounter with mathematics but as a boy he enjoyed other pursuits such as reading avidly, going round the museums of New York, and spending happy hours in the\n42\nnd\nStreet Public Library.\nRichard attended Abraham Lincoln High School in Brooklyn where he represented his school on the mathematics team and in his final year was rewarded with achieving the top rank among all New York school pupils. After High School Bellman entered the City College of New York in January\n1937\n. At this stage he had made up his mind to become a theoretical physicist and he took courses at the College with this in mind. In\n1938\nhe moved from City College to Brooklyn College where he now decided to make mathematics his main area of study. He represented Brooklyn College in the three man team in the Lowell Putman mathematics competition in his final two years at Brooklyn College. He graduated with a B.A. in mathematics in\n1941\nand in September of that year he entered Johns Hopkins University in Baltimore to undertake postgraduate studies.\nThe United States entered World War II after the Japanese attacked the American fleet at Pearl Harbour on\n7\nDecember\n1941\n. By\n11\nDecember the United States was at war with Germany. Bellman left Johns Hopkins University early in\n1942\nto take up a position as Instructor in Military Electronics at the University of Wisconsin. While teaching electronics as part of the war effort, he undertook his own studies in mathematics and was awarded a Master's Degree from Wisconsin in\n1943\n. Continuing to undertake war work with his teaching, Bellman next went to Princeton University where he taught in the Army Specialized Training Program. He was able to continue the undertake graduate work in mathematics but in December\n1944\nhe was drafted into the army and assigned o the Manhattan Project in Los Alamos. There he worked on problems in theoretical physics until his discharge in\n1946\n.\nBellman returned immediately to Princeton where he completed his doctoral studies under\nLefschetz\n's supervision. His doctoral dissertation on the stability of differential equations was concerned with the behaviour of the solutions of real differential equations as the independent variable t tends to infinity. It was submitted to Princeton later that year and he was awarded his Ph.D. Results from his dissertation appeared in the book\nStability theory of differential equations\nwhich he published in\n1953\n. A reviewer praised its:-\n... lucid and attractive manner of presentation.\nHe remained at Princeton as Assistant Professor of Mathematics after the award of his doctorate but in\n1948\nhe left to take up the position of Associate Professor of Mathematics at Stanford University. During the following summer he first worked at the RAND Corporation. He wrote\n[\n1\n]\n:-\nI was very eager to go to RAND in the summer of\n1949\n... I became friendly with Ed Paxson and asked him what RAND was interested in. He suggested that I work on multistage decision processes. I started following that suggestion.\nAfter a second period of time at RAND, Bellman spent a year on leave from Stanford, working at Princeton on H-bomb research. While there he began to ponder whether he should remain at Stanford where he was working on the topic he loved most, namely\nanalytic number theory\n, or whether he should take up a position at RAND in Los Angeles. He wrote\n[\n1\n]\n:-\nI was intrigued by dynamic programming. It was clear to me that there was a good deal of good analysis there. Furthermore, I could see many applications. It was a clear choice. I could either be a traditional intellectual, or a modern intellectual using the results of my research for the problems of contemporary society. This was a dangerous path. Either I could do too much research and too little application, or too little research and too much application. I had confidence that I could do this delicate activity, pie a la mode.\nThe decision made, Bellman left Stanford in\n1952\nand took up the position of Research Mathematician at RAND. As Dreyfus writes in\n[\n6\n]\n:-\nAssured of a successful conventional academic career, Bellman ... cast his lot instead with the kind of applied mathematics later to be known as operations research. In those days applied practitioners were regarded as distinctly second-class citizens of the mathematical fraternity. Always one to enjoy controversy, when invited to speak at various university mathematics department seminars, Bellman delighted in justifying his choice of applied over pure mathematics as being motivated by the real world's greater challenges and mathematical demands.\nBellman's first publication on dynamic programming appeared in\n1952\nand his first book on the topic\nAn introduction to the theory of dynamic programming\nwas published by the RAND Corporation in\n1953\n. To get an idea of what the topic was about we quote a typical problem studied in the book. Bellman writes:-\nWe are informed that a particle is in either state\n0\nor\n1\n, and we are given initially the probability x that it is in state\n1\n. Use of the operation A will reduce this probability to ax, where a is some positive constant less than\n1\n, whereas operation L, which consists in observing the particle, will tell us definitely which state it is in. If it is desired to transform the particle into state\n0\nin a minimum time, what is the optimal procedure?\nBellman's diverse applications of these tools continued to solve a whole range of problems. As he wrote\n[\n1\n]\n:-\n... as of\n1954\nor so I had stumbled into some important types of problems and had been pushed, willy-nilly, into answering some significant kinds of questions. I could handle deterministic control processes to some extent and stochastic decision process in economics and operations research as well.\nAt this point he made some very definite decisions on the direction his research should take, going back at looking at the original assumptions underlying his mathematical model and trying to introduce more realistic assumptions. He went on to introduce Markovian decision problems in\n1957\nand in\n1958\nhe published his first paper on stochastic control processes where he introduced what is today called the Bellman equation.\nThe number of papers and books which Bellman wrote is quite amazing. For example the paper\n[\n3\n]\nlist\n621\npapers,\n41\nbooks and\n21\ntranslations of books authored\n(\nor co-authored\n)\nby Bellman. Although it is impossible to give more than a flavour in an article such as this we give an indication of their scope by listing the titles of a few of his books. These include, in addition to those already mentioned:\nA Survey of the Theory of the Boundedness, Stability, and Asymptotic Behavior of Solutions of Linear and Nonlinear Differential and Difference Equations\n(1949)\n;\nA survey of the mathematical theory of time-lag, retarded control, and hereditary processes\n(1954)\n;\nDynamic programming of continuous processes\n(1954)\n;\nDynamic programming\n(1957)\n;\nSome aspects of the mathematical theory of control processes\n(1958)\n;\nIntroduction to matrix analysis\n(1960)\n;\nA brief introduction to theta functions\n(1961)\n;\nAn introduction to inequalities\n(1961)\n;\nAdaptive control processes: A guided tour\n(1961)\n;\nInequalities\n(1961)\n;\nApplied dynamic programming\n(1962)\n;\nDifferential-difference equations\n(1963)\n;\nPerturbation techniques in mathematics, physics, and engineering\n(1964)\n; and\nDynamic programming and modern control theory\n(1965)\n.\nYou can see more about these books as well as some later ones at\nTHIS LINK\n.\nWe have stopped at\n1965\nin giving a list of Bellman's books since it was at this time that he left RAND and accepted an appointment as Professor of Mathematics, Electrical Engineering, and Medicine at the University of Southern California. He continued his remarkable research and publication record. His approach was summed up in a course of lectures he gave at the University of Kentucky in\n1966\nin which he aimed:-\n... to describe some of the ways that the problems of the modern world provide interesting mathematical questions and open up entirely new domains of mathematics. ...\n[\nI believe that\n]\nthe growth of vital mathematics depends crucially on continuing interaction with the real world.\nHis interests turned towards computers as a tool in mathematical research and he wrote such books as\nAlgorithms, graphs and computers\n(1970)\n. In\n1973\ntragedy struck when he was diagnosed with a brain tumour. An operation to remove the tumour was successful but following the operation complications set in which left him an almost total cripple. Remarkably, however, he remained extremely active in his mathematical research despite his physical problems and in the remaining\n10\nyears of his life he wrote around\n100\npapers. Among the books he published during these years we should mention the particularly important\nAn introduction to invariant imbedding\n(1975)\nwritten jointly with G M Wing. However he also wrote\nAnalytic number theory\n(1980)\n,\nMathematical methods in medicine\n(1983)\n, and\nThe Laplace transform\n(1984)\n.\nAfter his death in\n1984\nhis books continued to be published such as\nPartial differential equations\n(1985)\n,\nSelective computation\n(1985)\n,\nMethods in approximation\n(1986)\n, and\nWave propagation: An invariant imbedding approach\n(1986)\n.\nBellman received a great many honours for his outstanding contributions to the applications of mathematics. In\n1970\nhe was awarded the first\nNorbert Wiener\nPrize in Applied Mathematics, this being a joint prize of the\nAmerican Mathematical Society\nand the\nSociety for Industrial and Applied Mathematics\n. Also in\n1970\nCarnegie-Mellon University awarded Bellman the first\nDickson\nPrize and three years later he was appointed to the ALZA Distinguished Lectureship by the Biomedical Engineering Society.\nHe was elected to Fellowship in the\nAmerican Academy of Arts and Sciences\nin\n1975\nand, in the following years, he received the\nJohn von Neumann\nTheory Award, another joint award this time by the Institute of Management Sciences and the Operations Research Society of America. In\n1977\nbe was elected to the National Academy of Engineering. He was awarded the IEEE Gold Medal of Honor in\n1979\n:-\nFor contributions to decision processes and control system theory, particularly the creation and application of dynamic programming.\nBellman was elected a Fellow of the Society for Mathematical Biology in\n1980\nand in\n1983\nhe was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\n. In\n1983\nhe received the Heritage Medal from the American Council for Control.\nThe\n1979\nIEEE Awards Reception Brochure states:-\nRichard Bellman is a towering figure among the contributors to modern control theory and systems analysis. His invention of dynamic programming marked the beginning of a new era in the analysis and optimization of large-scale systems and opened a way for the application of sophisticated computer-oriented techniques in a wide variety of problem-areas ranging from the design of guidance systems for space vehicles to pest control and network optimization.\nAfter listing his many honours, as we have above, the brochure then pays him this personal tribute:-\nBut what matters most is that Richard Bellman won more than fame - he won the admiration and affection of all who know him for his outstanding courage and greatness as a human being."
}