{
  "nome_completo": "Richard Peter Stanley",
  "nome_curto": "Richard Stanley",
  "ano_nascimento": "1944",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stanley/",
  "lugar_nascimento": "Manhattan, New York City, New York, USA",
  "lugar_morte": null,
  "biografia": "Richard P Stanley\nwas the son of Alan Emmet Stanley\n(1921\n-\n2003)\nand Shirley Silver\n(1922\n-\n2001)\n. Alan Stanley, born\n17\nMay\n1921\nin Manhattan, New York, was the son of Bernard Isaacson and Carrie Oestriecher. He appears in the\n1940\ncensus as Alan Isaacson but must have changed his name shortly after this, graduating from Virginia Polytechnic Institute, Blacksburg, in the class of\n1942\nas a metallurgist. He worked with the United Aircraft Corporation and became engaged to Shirley Silver in July\n1942\n(\nsee\n[\n48\n]\n)\n. On\n21\nAugust\n1942\nhe enlisted at Fort Jay Governors Island, New York and became an Aviation Cadet. Later that year he married Shirley in Baltimore, Maryland, on\n24\nDecember\n1942\n. Shirley, the daughter of Frederick and Anna Silver of\n48\nEllsworth Road, Larchmont, New York\n[\n50\n]\n:-\n... graduated from Mamaroneck High School and from Allegheny College Meadville Pennsylvania. She was elected to Phi Beta Kappa Delta Sigma Rho and Alpha Xi Delta.\nAlan and Shirley Stanley had three children, Richard Stanley born\n23\nJune\n1944\n, the subject of this biography being the first. When Richard was born, his father was serving overseas and his mother was living with her parents in Larchmont, New York. Richard had two younger siblings, Juliet Susan Stanley\n(\nborn\n9\nJuly\n1946\n, died\n13\nAugust\n1973)\nand Lawrence A Stanley\n(\nborn\n1\nDecember\n1947)\n.\nRichard explained that when World War II ended and Alan Stanley was demobbed\n[\n47\n]\n:-\n... we moved to New York City, where my father worked for my mother's father trying to set up a wire business. Around a year later my father got a job with National Lead Company in Tahawus.\nAt Tahawus the National Lead Company was mining titanium dioxide and Alan Stanley began working there in\n1946\n. Tahawus is in Newcomb, Essex County, New York and in\n1950\n, when Richard Stanley was five years old, the family were living at\n9\nStanford Drive, Newcomb, Essex, New York. In\n1953\nthe Stanley family left Tahawus when Richard's father was transferred to a plant in Arlington, Massachusetts but were only about a year there before moving to Lynchburg, Virginia. Richard wrote\n[\n47\n]\n:-\nI became interested in astronomy and for several years wanted to be an astronomer. From the ages of nine to thirteen I lived in Lynchburg, Virginia. One of my friends knew a woman named Mrs Cochran\n(\nwhom I thought of as an elderly person\n)\n. Mrs Cochran saw that I liked mathematics\n(\nthough at that time I had no special interest in the subject\n)\n, so she taught me the standard synthetic algorithm for finding the square root of a positive real number. This rule seemed like complete magic to me. I understood why the analogous synthetic algorithm for division\n(\n\"long division\"\n)\nworked, but I had not the slightest understanding of the square root algorithm. ... I asked Mrs Cochran about this, but she only replied that I would understand it when I was older. ... I did spend lots of time computing square roots and trying to impress my parents that I could determine whether a positive integer was a perfect square.\nIn\n1958\nthe family moved again when Richard's father was transferred to a plant in Savannah, Georgia. Richard attended Wilder Junior High School where he sat next to Irvin Asher in the mathematics classes.\n(\nAsher later went on to obtain a B.S. and Ph.D. in physics from M.I.T., moved to Israel, and died in\n2010\n.\n)\nAsher told Richard Stanley that the complicated calculation which he was doing was working out how to calculate\nn\nn\nn\nth roots of a number and he'd already worked it out for\nn\n=\n4\n,\n5\n,\n6\n,\n7\n,\n8\nn = 4, 5, 6, 7, 8\nn\n=\n4\n,\n5\n,\n6\n,\n7\n,\n8\n. Stanley, who had always been the best student in his mathematics class, suddenly thought he had met a mathematical genius in Asher. He wrote\n[\n47\n]\n:-\nI became determined to learn as much mathematics as I possibly could. It was on this fateful day that I was bitten by the mathematical bug and became incurably infected.\nStanley purchased G E Moore's\nOutline of College Algebra\nin the Barnes and Noble College Outline Series which he read carefully. He then began to study all the mathematics texts he could find in the Savannah Public Library and the Savannah High School library. In particular he found\nMartin Gardner\n's articles in\nScientific American\nand was enthralled by hexaflexagons,\nMöbius\nstrips and the mathematical problems he posed. Also at this time he joined the\nMathematical Association of America\nand began reading the\nAmerican Mathematical Monthly\nbut found almost all the articles incomprehensible.\nSavannah High School announced its honours role for the\n1961\n-\n62\nsession\n(\nsee\n[\n43\n]\n)\n. The Twelfth Grade Honor Role listed\n19\nstudents including Richard Stanley and, of course, his classmate Irvin Asher whom we mentioned above. Both also appeared on the list of Twelfth Grade Six-week Honor Students. We note that Richard's sister Juliet Stanley is on the list of Tenth Grade Six-week Honor Students for the\n1961\n-\n62\nsession. In fact session\n1961\n-\n62\nmarks Stanley's first attempts at research when he produced results connected to linear recurrences with constant coefficients. Richard Stanley graduated from Savannah High School at a ceremony in the Grayson Stadium on\n4\nJune\n1962\n.\nIt was at the California Institute of Technology\n(\nCaltech\n)\nthat Stanley began his university studies in\n1962\n. Although by this time he was fairly certain that he wanted to major in mathematics, he kept his options open for possibly majoring in physics. He found the first two of the trimesters hard since they involved a lot of analysis. The final trimester, however, contained more algebra and Stanley found the linear algebra and matrix theory much more to his liking. His thoughts that he was more cut out to be an algebraist rather than an analyst were confirmed by receiving an A+ in the examinations on the algebraic approach. Stanley took a course on analytic number theory given by\nTom Apostol\nwhich he found fascinating. He took a year long course on quantum mechanics in his third year.\nMichael Aschbacher\nwas a fellow student, entering Caltech in the same year as Stanley, and took a similar route moving from physics to algebra. Interest in algebra made Stanley turn to\nMarshall Hall\n.\nHall\nwas a leading expert on group theory and also had a strong influence in combinatorics. It is interesting that, influenced by\nMarshall Hall\n,\nAschbacher\nbecame interested in combinatorics but later changed to become a world leader in group theory while Stanley, also influenced by\nMarshall Hall\n, became interested in group theory but later became a leading expert in combinatorics. Stanley was so sure at this stage that combinatorics was not for him that he did not even take\nMarshall Hall\n's combinatorics course at Caltech.\nIndirectly\nMarshall Hall\ndid influence Stanley towards combinatorics since he suggested that he apply for a summer job as a Research Scientist at the at the Jet Propulsion Laboratory at Pasadena. He was interviewed by Edward Posner\n(1933\n-\n1993)\n, head of the coding theory group, who had a Ph.D. in ring theory with\nIrving Kaplansky\nas his advisor. Stanley expected the interview to be difficult but after Posner's first question, \"What are the\nSylow\ntheorems?,\" everything went well. He worked for five summers,\n1965\n-\n1969\n, in the coding theory group which was designing the error correcting codes that the Mariner and Voyager spacecrafts were using. The work was highly mathematical and a problem he worked on led to him reading the paper\nOn the foundations of combinatorial theory I. Theory of Möbius functions\n(1964)\nby\nGian-Carlo Rota\n. In fact\nRota\neventually became Stanley's Ph.D. thesis advisor but, at this time, Stanley never thought of combinatorics as a research topic.\nAt Caltech Stanley also took a course by\nDonald Knuth\nwho encouraged him to take an interest in computer science problems. At this stage in his career, however, Stanley was certain that algebra was the topic for him. Caltech had established the\nEric Temple Bell\nUndergraduate Mathematics Research Prize in\n1963\nand Stanley decided to submit a research paper to compete for the prize. He wrote his paper\nZero Square Rings\nunder the guidance of Richard A Dean, one of his professors. Richard Albert Dean\n(1924\n-\n2022)\nhad been awarded a B.S. from Caltech in\n1945\nand a PhD from Ohio State University in\n1953\n. He had been appointed to Caltech in\n1954\nand, at the time he was advising Stanley, was completing writing his book\nElements of Abstract Algebra\n(1966)\n.\nAschbacher\nalso submitted an outstanding research paper for the\nEric Temple Bell\nPrize and both were awarded the\n1965\nPrize. You can read details of the\nEric Temple Bell\nPrize and of Stanley's winning paper at\nTHIS LINK\n.\nStanley graduated from Caltech with a B.S. in\n1966\nas one of the three best students of his year. The other two were\nMichael Aschbacher\nand Vern Sheridan Poythress who went to Harvard and, with\nGarrett Birkhoff\nas his advisor, was awarded a Ph.D. for his thesis\nPartial Algebras\n. He then went on to have a career as a leading philosopher, theologian and New Testament scholar. Stanley also went to Harvard University to undertake graduate studies. When he entered Harvard he hoped to be able to undertake research in group theory advised by\nRichard Brauer\n. Once at Harvard he began to understand how the project to classify finite simple groups was taking shape. It was clear that very many cases would have to be studied and already several hundreds of pages had been published. This caused group theory to lose its appeal for Stanley. He then decided to switch to number theory and changed advisors from\nBrauer\nto\nJohn Tate\n. He began learning algebraic number theory but his summer job at the Jet Propulsion Laboratory suddenly played a part in his career.\nAlthough he never thought of the combinatorics problems he had studied at the Jet Propulsion Laboratory as potential research problems, he found them interesting and asked mathematicians at Harvard about them. He was told that these were the type of problems that interested\nGian-Carlo Rota\nwho was at the Massachusetts Institute of Technology\n(\nM.I.T.\n)\n. He said in the interview\n[\n6\n]\n:-\nRota\nwas very enthusiastic, suggesting all kinds of combinatorics that I should learn and convinced me that I should work with him in combinatorics. But I actually ended up doing most of the work on my own, just talking to him about other topics, not directly related to my research.\nAt Harvard, Stanley had taken a first level graduate complex variable course taught by\nDavid Mumford\n. He also took a course on algebraic topology taught by Albrecht Dold\n(1928\n-\n2011)\n, who was visiting from Heidelberg University for the academic year. By the time he took this course he had become interested in combinatorics, so as the algebraic topology course was examined by a paper of his choice, he wrote on the homology of finite topological spaces. He attended\nOscar Zariski\n's course on algebraic curves which proved a lucky choice\n[\n58\n]\n:-\nWhen a graduate student felt ready to write a Minor Thesis, he or she was given a topic based on the courses taken so far. The topic was supposed to be unrelated to the courses, so the student had to learn something entirely new. The Minor Thesis had to be handed in three weeks after it was assigned. Since I had only audited\nZariski\n's course\n(\nrather than taking it for credit\n)\n, it did not appear on my record. Therefore I was given the topic \"the\nRiemann\n-\nRoch\ntheorem for curves.\" This turned out to be a central result in\nZariski\n's course, so I didn't have to do much more than transcribe my notes.\nStanley was appointed as a Teaching Assistant at Harvard University during\n1968\n-\n1970\n, and then as C L E Moore Instructor of Mathematics at M.I.T. He began publishing papers, the first being\nZero Square Rings\n, the paper he had submitted for the\nEric Temple Bell\nPrize at Caltech. The next was\nStructure of incidence algebras and their automorphism groups\nwhich research announcement submitted to the\nBulletin\nof the\nAmerican Mathematical Society\n. It was communicated by\nGian-Carlo Rota\non\n9\nJune\n1970\nand gave Stanley's address as the Massachusetts Institute of Technology.\nStanley attended the Second Chapel Hill Conference on Combinatorial Mathematics and its Applications was held at the University of North Carolina, Chapel Hill on\n8\n-\n13\nMay\n1970\nand presented the paper\nA chromatic-like polynomial for ordered sets\nwhich was published in the conference proceedings.\nBill Tutte\nwrote in a review:-\nThe chromatic polynomial of a graph G can be interpreted as the number of\n(\nappropriately defined\n)\nmappings of G into a complete n-graph. This paper discusses analogous polynomials concerned with mappings of a partially ordered set P into a totally ordered set of n elements.\nIn fact Stanley had published nine papers before submitting his Ph.D. thesis\nOrdered structures and partitions\nto Harvard University in\n1971\n. His official Harvard University advisor had remained\nJohn Tate\n(\nwho remained his advisor on condition he did not have to read Stanley's thesis\n)\nbut his actual advisor had been\nGian-Carlo Rota\n. The thesis was published as a book in\n1972\nand you can read more about it at\nTHIS LINK\n.\nStanley spoke about his activities at Harvard other than mathematics in the interview\n[\n58\n]\n:-\nI spent a lot of time in the Common Room involved in such activities as blitz chess, bridge, table shuffleboard, and foosball. My time at Harvard took place during the Vietnam War. Many of the graduate students in the Mathematics Department were extremely politically active. I got converted from a conservative into a liberal who opposed the war. I was involved in some political activity such as the famous march on Washington in November,\n1969\n, and on another occasion I spent a couple of hours in jail\n(\nwith a lot of other people\n)\nfor disturbing a public assembly, before bail was raised. Eventually I was fined $\n10\n.\nIn fact Stanley completed all the requirements for the degree of Ph.D. in\n1970\nbut chose not to apply for graduation until\n1971\n, thinking that it would stop him being drafted because of the Vietnam War. In fact deferment of the draft for more than four years was usually not allowed and indeed his request for an extension was turned down. He became eligible for the draft, was called for a medical which he passed, but was not drafted.\nIn\n1971\nStanley married Doris Sandra Skulsky\n(\nborn\n1945)\nin Queens, New York City. Doris had attended George W Wingate High School in Brooklyn, New York. She then studied at Barnard College in Manhattan, New York and, after majoring in French with German as a minor, she graduated with a B.A. in\n1966\n. She then studied for a Master of Arts in Teaching at Yale University and was awarded the degree in\n1967\n. Richard and Doris Stanley have two children who both went on to obtain doctorates, Kenneth Owen Stanley\n(\nborn in Boston on\n16\nMay\n1975)\n, who became a computer scientist, and Sharon Adele Stanley\n(\nborn\n11\nSeptember\n1977)\n, who became a professor of Political Science.\nIn\n1971\n, Stanley was appointed as Miller Research Fellow, University of California, Berkeley holding that position until\n1973\n. While a Miller Research Fellow, he had the paper\nSupersolvable lattices\npublished in\nAlgebra Universalis\n. The paper had been communicated to the journal by\nRobert Palmer Dilworth\n, an expert on lattice theory who was a professor at Caltech. In\n1973\nStanley was appointed as an Assistant Professor of Mathematics at the Massachusetts Institute of Technology where he worked until he retired in\n2018\n. At M.I.T., he was promoted to Associate Professor of Mathematics in\n1975\n, then to Professor of Applied Mathematics in\n1979\n. He was named\nNorman Levinson\nProfessor of Applied Mathematics at M.I.T. in\n2000\n, holding this position until\n2010\n.\nIn addition to his first book, which was essentially his Ph.D. thesis, Stanley has written several other important books:\nCombinatorics and commutative algebra\n(1983)\n;\nEnumerative combinatorics\n. Vol. I\n(1986)\n;\nEnumerative combinatorics\n. Vol.\n2\n(1999)\n;\nA combinatorial miscellany\n(2010)\n;\nAlgebraic combinatorics: Walks, trees, tableaux, and more\n(2013)\n;\nCatalan numbers\n(2015)\n; and\nConversational problem solving\n(2020)\n. Let us give an indication of the exceptional quality of these books by quoting from Darren Glass's review of the Second Edition of\nEnumerative combinatorics\n. Vol. I\n[\n16\n]\n:-\nSome books seem like they shouldn't need reviews: The Bible, Moby Dick, Great Expectations,\nEuclid\n's Elements. Their names are so ingrained in our minds as the pinnacle of what a great book should be that it almost doesn't occur to us that a review is a good idea. Who is going to decide whether to read Shakespeare based on what folks on Amazon think of it? Now, Richard Stanley's Enumerative Combinatorics, Volume I is probably not quite at the level of the above-named classics, but it is about as close as a graduate-level text in mathematics can be. Don't believe me? Look at what others said about the first edition:\nIn a little over\n300\npages of careful exposition, the author has packed a tremendous amount of information into this book.\" - MathSciNet\n\"This is a masterful work of scholarship which is, at the same time, eminently readable and teachable. It will be the standard work in the field for years to come.\" - Citation for\n2001\nLeroy Steele Prize For Mathematical Exposition, which Stanley won for the two volumes of his book.\n\"Historically then this is a book of major importance. It provides a widely accessible introduction to many topics in combinatorics ... Furthermore, it is sure to become a standard as an introductory graduate text in combinatorics.\" -\nGeorge Andrews\n, writing in the Bulletin of the\nAmerican Mathematical Society\n.\n\"Best of all, Stanley has succeeded in dramatising the subject, in a book that will engage from start to finish the attention of any mathematician who will open it at page one.\" -\nGian-Carlo Rota\n, in the preface to the first edition.\nFor more information about all these books, see\nTHIS LINK\n.\nIn addition to the\nEric Temple Bell\nUndergraduate Prize mentioned above, Stanley has won four major awards: the SIAM\nGeorge Pólya\nPrize in Applied Combinatorics\n(1975)\n; the Leroy P Steele Prize for Mathematical Exposition\n(2001)\n; the Rolf Schock Prize in Mathematics\n(2003)\n; and the Leroy P Steele Prize for Lifetime Achievement\n(2022)\n. The Leroy P Steele Prize for Mathematical Exposition was awarded for the two volumes of the book\nEnumerative combinatorics\n.\nFor more information about all these awards, see\nTHIS LINK\n.\nStanley has received a number of honours in addition to these prizes. For example he was awarded a Guggenheim Fellowship\n(1983\n-\n84)\n, elected a fellow of the\nAmerican Academy of Arts and Sciences\n(1988)\n, elected a member of the\nNational Academy of Sciences\n(1995)\n, made an Honorary Doctor of Mathematics by the University of Waterloo\n(2007)\n, made an Honorary Professor of Nankai University\n(2007)\n, and elected a fellow of the\nAmerican Mathematical Society\n(2013)\n.\nHe has been an invited speaker at many conferences; let us just mention two. He was an invited speaker in the Algebra Section of the International Congress of Mathematicians, Warsaw,\n1983\n, and gave the talk\nCombinatorial applications of the hard Lefschetz theorem\n. He was a plenary speaker at the International Congress of Mathematicians in Madrid,\n2006\n, giving the talk\nIncreasing and decreasing subsequences and their variants\n. He gave the following Abstract:-\nWe survey the theory of increasing and decreasing subsequences of permutations. Enumeration problems in this area are closely related to the RSK algorithm. The asymptotic behaviour of the expected value of the length is\n(\nw\n)\nof the longest increasing subsequence of a permutation w of\n1\n,\n2\n, ... , n was obtained by Vershik-Kerov and\n(\nalmost\n)\nby Logan-Shepp. The entire limiting distribution of is\n(\nw\n)\nwas then determined by Baik, Deift, and Johansson. These techniques can be applied to other classes of permutations, such as involutions, and are related to the distribution of eigenvalues of elements of the classical groups. A number of generalisations and variations of increasing/decreasing subsequences are discussed, including the theory of pattern avoidance, unimodal and alternating subsequences, and crossings and nestings of matchings and set partitions.\nAsked in the interview\n[\n58\n]\nwhich of his results he considered most influential, he replied:-\nMy most influential results are all influential for basically the same reasons: the concepts and techniques turn out to be useful in other contexts, and they suggest extensions and generalisations for which much further progress can be made. These results are:\n(1)\nthe theory of P-partitions,\n(2)\ncombinatorial reciprocity,\n(3)\napplications of commutative algebra\n(\nespecially face rings\n)\nand algebraic geometry\n(\nmainly, the hard Lefschetz theorem\n)\nto combinatorics,\n(4)\nstable\nSchubert\npolynomials\n(\nalso called \"Stanley symmetric functions\"\n)\nand their connection with reduced decompositions of permutations, and\n(5)\nchromatic symmetric functions. There is some other work that has had some influence, such as supersolvable lattices, order and chain polytopes, D-finite power series, a combinatorial interpretation of\nSchubert\npolynomials\n(\nwith Sara Billey and William Jockusch\n)\n, and a conjectured formula\n(\nproved by Valentin Feray\n)\nfor the normalized character values of the symmetric group.\nIn\n2014\nStanley was appointed Arts and Sciences Distinguished Scholar at the University of Miami. He retired from M.I.T. in\n2018\nand was appointed Emeritus Professor of Applied Mathematics.\nAsked about is hobbies in the interview\n[\n23\n]\nby Hyun Soo Kim, he replied:-\nI like juggling, although I'm not very active now. Bridge is something I enjoy. I like chess problems. I don't really like chess, but I like chess problems. It's a serious area that is very small and extremely well‐developed into an art form."
}