{
  "nome_completo": "Robert Stawell Ball",
  "nome_curto": "Robert Ball",
  "ano_nascimento": "1840",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ball_Robert/",
  "lugar_nascimento": "Dublin, Ireland",
  "lugar_morte": "Cambridge, England",
  "biografia": "Robert Ball\n's mother was Amelia Gresley Hellicar and his father, a civil servant and a naturalist, was also named Robert Ball. Robert\n(\njunior\n)\nwas the second of his parents' seven children, his brothers and sisters being Valentine, Charles, Kate, Mary, Amelia and Annie. He was educated at Dr John Lardner Burke's School in Dublin, then later at Dr Brindley's school in Tarvin which is about\n7\nkm east of Chester in England. The school moved because of various problems, first to a nearby site and then to Leamington Spa. His father died in March\n1857\nand Ball returned from Leamington Spa to Ireland where the family were now in some financial difficulties. Shortly after this, on\n13\nOctober, Ball entered Trinity College, Dublin, to study the subjects which he had excelled in at Dr Brindley's school namely mathematics and science. It was only with great difficulty that his mother was able to pay his university fees.\nBall was an outstanding student at Trinity College, Dublin, winning gold medals and prizes, and his financial position was eased when he won a scholarship in\n1860\n. However, he did not quite make it to a fellowship which was not at all surprising since at this time these were few and far between and people would spend several years after graduating waiting for the opportunity to compete for a fellowship. William Parsons, the third earl of Rosse, had constructed the largest reflecting telescope in the world at Birr Castle. The\n72\n-inch telescope became operational in\n1845\nand was used mainly to observe spiral galaxies which Rosse had classified at \"nebulae\". In around\n1864\nRosse sought a tutor for his three sons, and Ball was recommended to him for the post. Ball accepted on condition that he could use of the\n72\n-inch telescope, which Rosse was happy to agree to, and he took up the position in\n1865\n. He certainly made good use of the telescope and he wrote\n[\n2\n]\n:-\nI sometimes followed Herschel's example and remained observing from dusk to dawn.\nWith this telescope he discovered six previously unknown nebulae which were listed in the\nNew General Catalogue\n. Also while he was at Birr he observed the Leonid meteor shower on night of\n13\n-\n14\nNovember\n1866\n.\nBall also seems to have been very successful in educating Rosse's children, which he did with lessons given in the mornings and early afternoons, for one of them Charles Parsons, who Ball tutored from age\n11\nto age\n13\n, went on to become an engineer whose invention of a multi-stage steam turbine revolutionised marine propulsion. After two years working for Rosse, Ball was offered the chair of applied mathematics and mechanics in the Royal College of Science in Dublin which had recently been founded. There Ball\n[\n1\n]\n:-\n... developed vivid physical demonstrations and laid the foundation of a successful style of lecturing that was to earn him fame in later years.\nHe also gave\n[\n2\n]\n:-\n... a special course of evening lectures at a nominal rate. These lectures were addressed to working men.\nIn\n1868\nhe married Frances Elizabeth Steele from Dublin, whose father was registrar of the Royal Dublin Society and had been a friend of Ball's father. They had four sons and two daughters.\nThe main mathematical topic on which Ball did research was dynamics, in particular the theory of screws. His first paper on the topic was written in\n1869\nand was published in the\nQuarterly Journal of Mathematics\nin\n1870\n. He was invited to address the\nBritish Association\nmeeting in\n1870\nwhen he spoke on the theory of screws. Another major mathematical publication around this time was\nExperimental Mechanics\n(1871)\n. His work was highly regarded and he was elected a Fellow of the\nRoyal Society\nin\n1873\n. He was further honoured for his mathematics when\nThe Theory of Screws: A Study in the Dynamics of a Rigid Body\n, which was published in\n1876\n, was awarded Cunningham medal of the\nRoyal Irish Academy\nin\n1879\n.\nIn\n1874\nthe positions of Royal Astronomer of Ireland and Professor of Astronomy in Trinity College Dublin became vacant. The Royal Astronomer was based at Dunsink Observatory,\n8\nkm north of Dublin, where Ball had met\nHamilton\nwhen he\n(\nBall\n)\nwas a young man. Ball was appointed Royal Astronomer of Ireland and to the Andrews Chair of Astronomy of Trinity College Dublin after successfully submitting a seven-page printed application for these positions. He held them for\n18\nyears. His main fame, however, was as a popular lecturer rather than for research in astronomy. His son William Valentine Ball, who wrote\n[\n2\n]\n, records that between\n1874\nand\n1884\nBall gave over\n700\npublic lectures in Ireland and England. Ball charged a high price for his lectures, but he always addressed packed halls. To give an idea of his style as a lecturer here is the beginning of one of his lectures\n[\n2\n]\n:-\nI try in these lectures to give some account of an exceptionally great subject; a subject, I ought rather to say, of sublime significance. It may, I believe, be affirmed without exaggeration that the theme which is to occupy our attention, represents the most daring height to which the human intellect has ever ventured to soar in its efforts to understand the great operations of nature. The earth's beginning relates to phenomena of such magnitude and importance that the temporary concerns, which engage our thoughts, must be forgotten in its presence. Our personal affairs, the affairs of the nation, and of the empire indeed of all nations and all empires, nay, even all human affairs, past, present, and to come, shrink into utter insignificance when we come to consider the majestic subject of the evolution of the solar system, of which our earth forms a part. We shall obtain a glimpse of what that evolution has been, in the mighty chapter of the book of Nature on which we are now to enter.\nHe wrote a number of popular books on astronomy including\nA Story of the Heavens\n(1886)\nand\nThe Story of the Sun\n(1893)\n. In\n1884\nBall sailed to Canada to lecture at the\nBritish Association\nMeeting in Montreal. He later made further highly successful lecture tours of the United States in\n1887\nand\n1901\n-\n2\n.\nIn\n1892\nJohn Couch Adams\n, the Lowndean Professor of Astronomy and Geometry at Cambridge and the director of the Cambridge Observatory, died. Ball applied for the vacant position and was appointed as Lowndean Professor of Astronomy and Geometry but disputes with the university meant that he had to wait a year before he was appointed director of the Cambridge Observatory. However Ball was delighted with his appointment as Lowndean Professor, writing to his mother\n[\n3\n]\n:-\n[\nI\n]\nt is the highest scientific chair in England, if not in Europe, the Solar System, no! The Milky Way, indeed the highest in the whole Universe.\nA letter back to his sister as he was about to settle into his Cambridge home paints an interesting picture of life at that time:-\nTomorrow night we expect to sleep in our new home. A beautiful one it is in many respects. Indeed as every day passes. I am more and more thankful for the change we have made. You can have no idea how charming is the prospect of life here. It seems to me that there are scores of hospitable houses open, and genial and pleasant welcomes everywhere. ... we are to have a telephone. Vehicles of any kind at the door in a quarter of an hour, shopping and all the rest done by telephone! It is connected with the Post Office, so that telegrams can be sent all over the country and the world from our own hall. There is pleasant society in Kings College. Indeed, I feel quite at home everywhere now. Small incidents of the change loom into importance. When I arrived, the two things I appreciated most were two pipes, not for tobacco, not pipes of port, but just a gas pipe and a water pipe, conveying the gas and the liquid of which we were so destitute at Dunsink!\nIn Cambridge Ball continued to give popular lectures on astronomy, and continued to work on his mathematics.\nWhittaker\n, who attended lectures by Ball at Cambridge, wrote that he was\n[\n2\n]\n:-\n... one of the two or three greatest British mathematicians of his generation.\nAs well as the honours which we referred to above, we should mention that Ball was knighted in\n1886\n. He was also honoured with election as President of the Mathematics Section of the\nBritish Association for the Advancement of Science\nfrom\n1886\nto\n1887\n, of the Zoological Society of Ireland from\n1890\nto\n1892\n, of the\nRoyal Astronomical Society\nfrom\n1897\nto\n1899\n, and of the\nMathematical Association\nof London from\n1899\nto\n1900\n."
}