{
  "nome_completo": "Robert Erich Remak",
  "nome_curto": "Robert Remak",
  "ano_nascimento": "1888",
  "ano_morte": "1942",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Remak/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Auschwitz, Poland",
  "biografia": "Robert Remak\nwas the grandson of the first Jew in Prussia to be given an\nhabilitation\nwithout giving up the Jewish faith. Also called Robert Remak, and now known as Robert Remak Sr.\n(1815\n-\n1865)\n, he was awarded his habilitation from the University of Berlin in\n1847\nand, with support from Alexander von Humboldt, he went on to be appointed as a\ndocent\nin the medical faculty. As he was a Jew, this required a special order from King Friedrich Wilhelm IV. In the same year that he became a docent, he married Feodore Meyer\n(1828\n-\n1863)\n, the daughter of a Berlin banker. They had two sons, one of whom was Ernst Julius Remak\n(1849\n-\n1911)\nwho became a physician and, in\n1902\n, became an extraordinary professor of neurology at the University of Berlin. Ernst Remak married Martha Hahn, the daughter of the industrialist Albert Hahn\n(1824\n-\n98)\n. Ernst and Martha's son Robert Remak Jr is the subject of this biography and was given his grandfather's name in the tradition of the Ashkenazic Jews.\nRemak, the subject of this biography, studied mathematics and physics in Berlin, Marburg, Göttingen and Freiburg. He undertook research at the University of Berlin where he was supervised by\nGeorg Frobenius\nfor his doctoral work. His doctoral dissertation\nÜber die Zerlegung der endlichen Gruppen in indirekte unzerlegbare Faktoren\nⓉ\n(\nOn the decomposition of a finite group into indirect indecomposable factors\n)\nwas submitted in\n1911\nand\nHermann Schwarz\nserved as the other member of the examining committee. This important work considered the decomposition of finite\ngroups\ninto a direct product of irreducible factors, a result that his name is often now attached to along with those of\nJoseph Wedderburn\n,\nErhard Schmidt\nand\nWolfgang Krull\n.\nAlthough his doctorate was awarded in\n1911\n, it was a long and difficult road for Remak to be awarded his habilitation. Of course, World War I began in\n1914\nbefore Remak had attempted to habilitate and he served as a soldier during the conflict. After the war ended, he submitted a thesis for his habilitation several times, and each time it was rejected. However he persevered: as Schappacher writes in\n[\n8\n]\n:-\nThe Remak family had something of a tradition in slowly overcoming administrative hurdles at the University of Berlin.\nHowever, as Segal writes in\n[\n9\n]\n, Remak had a reputation as a difficult person and this was a factor in his habilitation being refused:-\nRobert Remak was a brilliant algebraist and number-theorist, though an apparently more than somewhat difficult colleague. He had the reputation of being a \"communist\", and there were also rumours in the\n1920\ns that he was \"not completely Aryan\", but this seems to have been mostly a result of his sarcastic personality, eccentricities, and unkempt habits, rather than stemming from any real knowledge about him or any political activity on his part. In fact, he was Jewish. He was twice denied habilitation and the right to join the teaching faculty in Berlin, in\n1919\nand\n1923\n, again largely because of his demeanour and habits. However, finally, on\n11\nJanuary\n1929\n, Remak\n(\nwho had received his doctorate in\n1911)\nwas accepted on his third attempt.\nLet us look at Remak's problems in a little more detail. In Berlin he had annoyed\nMax Planck\nso much that\nPlanck\nstrongly objected to Remak habilitating and this was the main reason that his habilitation thesis was rejected in\n1919\nand\n1923\n. After this Remak went to Göttingen and his behaviour there is described in detail by\nHeinrich Behnke\nin\n[\n1\n]\n:-\nSurely Remak was a peculiar fellow.\n[\nIn Göttingen\n]\nhe regularly attended the courses of the young lecturers. He always arrived too late, but took his place on one of the front benches and appeared to immediately fall asleep. However, as soon as the lecturer made a miscalculation or expressed himself in an imprecise way, he woke up and corrected the speaker. ...\nCourant\nwaited for the opportunity to be able to say: \"Mr Remak, I have explained that already while you were still sleeping.\" ... Everybody was afraid to be seen together with Remak in the streets.\nHilbert\ndiscussed with a small circle of his colleagues the question whether he could prevent Remak attending all his lectures and seminars. ... But the esteem for Remak among experts continued. ... Remak was known throughout the city. More and more the label 'the communist' was attached to him. It was totally beside the point but the label carried much more weight in those days than it does today. He was treated with suspicion everywhere. One of the reasons was also his foolish clothing. ... Today he would not be conspicuous because of his behaviour. He would only be a pain in the neck of the radical students of the left since he would relentlessly expose all their absurdities and contradictions, and since he would disconcert them in public meetings as he did with the conservatives at that time\nRemak was involved in a quarrel with one of the janitors at the University of Göttingen and, after this was reported to the rector, Remak was informed that he would be expelled from the university if he caused any more trouble. But he did create more trouble as\nBehnke\nexplains\n[\n1\n]\n:-\nAt that time Remak wanted to understand politics as profoundly as mathematics. He therefore seriously attended lectures in economics. However, the students felt uneasy because of the arrival of 'the communist' in their lectures and they began to scrape their feet when he entered. He made a polite little speech requesting them to stop their disapproval of him because there was no reason. However, when he entered the next lecture the students scraped their feet more than ever whereupon he boxed the \"next culprit's\" ears. A great commotion arose just as the professor was entering the lecture-hall and he reported Remak as being the cause of the disturbance. The Rector expelled Remak from the University of Göttingen.\nRemak returned to Berlin and eventually, in\n1928\n, his habilitation thesis\nOn minimal invariant subgroups in the theory of finite groups\nwas accepted by the examining committee consisting of\nIssai Schur\nand\nErhard Schmidt\n. On\n11\nJanuary\n1929\n, he was given the right to teach at the university by\nRichard von Mises\nwho insisted that Remak was only permitted to teach pure mathematics. Despite having the right to teach, there was no post for him. He did lecture on groups at the University of Berlin during the summer semester\n1929\nand these lectures were attended by\nBernhard Neumann\n. The same year\n1929\nwas one in which Remak published an essay on applications of mathematics to economics. He had broad interests, working on mathematical economics as well as group theory and the geometry of numbers.\nIn his\n1929\nessay\nKann die Volkswirtschaftslehre eine exakte Wissenschaft werden\nⓉ\n(\nCan economics become an exact science?\n)\nRemak writes\n(\nsee\n[\n5\n]\n)\n:-\nThe task of an exact economics ought to be to construct a budget plan of an, in some respects, generic economy.\n[\nIn order to answer questions about\n]\n(\ni\n)\nidentification of an economic optimum,\n(\nii\n)\nidentification of an approximate economic solution, ... we shall try below to formulate these questions in a more exact way by mathematical considerations. First of all, we shall try to make sure, that the range of possible economies from which the optimal one would have to be chosen, is mathematically well defined. ... On the question of which economy is to be considered as optimal and which distribution of goods as justifiable, different opinions will be possible.\nHowever, he tried to ensure that his essay was not seen as being political\n(\nsee for example\n[\n3\n]\n)\n:-\nI emphasise ... that I have not made any politico-economic statements, but only stated problems and indicated some calculational schemes, ... that it is still open as to if the outcome of the computation favours capitalism, socialism, or communism. ... these equations are very awkward to handle mathematically. There is, however, work in progress concerning the numerical solution of linear equations with several unknowns using electrical circuits.\nIn this work Remak is far sighted in seeing the applications that computers would have in the subject, but these were areas into which is was unwise for someone like Remak to be venturing in Germany at this time.\nRemak made important contributions to\nalgebraic number theory\n. In a publication in\n1932\nhe gave a lower bound for the regulator of the units of an\nalgebraic number field\nwhich depends only on the number of real conjugates and the number of pairs of complex conjugates. He went on to produce further extensions of this work which continued to be published in the ten years after his death. Further papers by Remak on finite algebraic number fields with unit defect appeared in\nCompositio Mathematica\nin\n1952\nand\n1954\n.\nOn\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course removing those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Under this law, Remak lost the right to teach at the university in September\n1933\n.\nRemak did not leave Berlin at this time, however, and he continued to live in the city and continued with his mathematical research. He was particularly interested in the exciting new mathematical developments which were written up in van der Waerden's two volume\nAlgebra\npublished in\n1930\nwhich contained the new developments in ring theory by\nEmmy Noether\n,\nDavid Hilbert\n,\nRichard Dedekind\nand\nEmil Artin\n.\nRemak was married to a German woman, Hertha Meyer, who did satisfy the Aryan condition, and this certainly made him wish to continue living in Germany. He might also have expected that it would also give him a certain protection against the Nazi policies. On\n10\nJuly\n1936\nIssai Schur\nwrote a report on Remak\n(\nsee for example\n[\n3\n]\n)\n:-\nI consider Dr Robert Remak to be an outstanding researcher, who is distinguished by his versatility, originality, strength and brilliance. ... He may, without doubt, be called a leading scholar in the splendid and important field of geometry of numbers.\nOn the Kristallnacht\n(\nso called because of the broken glass in the streets on the following morning\n)\n, the\n9\n-\n10\nNovember\n1938\n, Remak was arrested. On that night\n91\nJews were murdered, hundreds were seriously injured, and thousands were subjected to horrifying experiences. Thousands of Jewish businesses were burnt down together with over\n150\nsynagogues. The Gestapo arrested\n30\n,\n000\nwell-off Jews and a condition of their release was that they emigrate. Remak was put into the Sachsenhausen concentration camp near Berlin and his wife made strenuous attempts to obtain an affidavit which would allow them to emigrate to the United States. She sent many letter and telegrams to\nHermann Weyl\nrequesting affidavits.\nWeyl\nwrote to\nHeinz Hopf\n, who was in Zürich, on\n29\nNovember\n1938\ntelling him about Remak's suffering in Sachsenhausen\n(\nsee\n[\n10\n]\n)\n:-\nAbout Remak, I heard that comrades of his, who have in the meantime been released, are saying that he is suffering more than others. One can imagine what this means, also because it is clear that due to his character, Remak is incapable of adapting in any way. It is generally known that prisoners are released if they have complete emigration papers, ship tickets. etc. The poor\n(\nand very clumsy\n)\nMrs Remak desperately tries to achieve something to this effect.\nOn\n11\nDecember\n1938\n, Remak had not contacted his wife for four weeks and she wrote again to\nWeyl\n(\nsee\n[\n10\n]\n)\n:-\nApart from his follies which I do not want to deny, you will agree that my husband is a deeply honest and decent character and an able mathematician. I am an Aryan, so you cannot interpret my letter as a Jewish impertinence.\nDespite having failed to obtain permission to emigrate to the United States, Remak was released after over eight weeks in the concentration camp after his wife organised that he go to Amsterdam. Hertha Remak wrote to\nWeyl\non\n20\nJanuary\n1939\ntelling him that Remak had returned from the Sachsenhausen concentration camp and was back in Berlin with a temporary permit for the Netherlands. Remak went to the Netherlands in April\n1939\nbut his wife did not go to Amsterdam with him. Instead she started divorce proceedings, almost certainly in an attempt to save her own life.\nHans Freudenthal\nwrote to\nHeinz Hopf\non\n7\nMarch\n1940\ndescribing the problems that Remak was causing in Amsterdam:-\nMy main problem is Remak, who is not satisfied with visiting my lectures but who also gives us no end of trouble. It mostly concerns conflicts with his landlords, who then immediately run to the alien registration office. ... also Remak's expression \"then I'd rather go to a concentration camp\" has infuriated enough people already. The matter is extremely serious; it is doubtful how long we can still prevent him from being expelled to Germany. ... It is understandable that his wife didn't want to come here, but demonstrates a lack of loyalty to him.\nThe fact Remak's wife divorced him almost certainly made his position impossible\n(\nbut had Hertha not done so and had she gone to the Netherlands with Remak, it is doubtful whether this would have saved his life\n)\n. He was arrested by the German occupying forces in Admiraal de Ruyterweg\n8\n, his Amsterdam address, in early October\n1942\nand taken to the transit camp at Westerbork. The Nazis transferred about\n100\n,\n000\nJews from Westerbork to the Auschwitz concentration camp beginning in July\n1942\n. Trains left the Westerbork camp every Tuesday, and the inhabitants panicked on Monday evenings knowing what was about to happen. On Tuesday\n10\nNovember\n1942\nRemak was put into a wagon on a train bound for Auschwitz. He was murdered there three days later. Merzbach writes in\n[\n7\n]\nthat Remak's:-\n... refusal - in mathematics and everyday affairs - to compromise, or to be 'realistic', swept him out of the mainstream of mathematics and cost him his life."
}