{
  "nome_completo": "Ronald Vernon Book",
  "nome_curto": "Ron Book",
  "ano_nascimento": "1937",
  "ano_morte": "1997",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Book/",
  "lugar_nascimento": "Los Angeles, California, USA",
  "lugar_morte": "Santa Barbara, California, USA",
  "biografia": "Ron Book\nwas born and grew up in a farming community. He attended Grinnell College, a private institution of higher education in Grinnell, Iowa, and was awarded a B.A. by the College in\n1958\n. He then studied at the Wesleyan University, a private, institution of higher education in Middletown, Connecticut, and was awarded an M.A. in Teaching in\n1960\nand a second M.A. in\n1964\n. He undertook research at Harvard University under the supervision of Sheila A Greibach and was awarded a Ph.D. in\n1969\nfor his thesis\nGrammars with Time Functions\n. In\n1970\nBook and Greibach published\nQuasi-realtime languages\nand they described the contents of the paper as follows:-\nThe quasi-realtime languages are seen to be the languages accepted by nondeterministic multitape\nTuring\nmachines in real time. The family of quasi-realtime languages forms an abstract family of languages closed under intersection, linear erasing, and reversal. It is identical with the family of languages accepted by non-deterministic multitape\nTuring\nmachines in linear time. Every quasi-realtime language can be accepted in real time by a nondeterministic one stack, one pushdown store machine, and can be expressed as the length-preserving homomorphic image of the intersection of three context-free languages.\nAnother early work by Book on languages was the paper\nOn languages accepted in polynomial time\nwhich he published in\n1972\n. It shows that several different languages are distinct. These are the family of languages accepted by non-deterministic\nTuring\nmachines in polynomial time, the corresponding family for deterministic\nTuring\nmachines, the family of context-sensitive languages, the family of languages accepted by deterministic linear bounded automata, and the set of languages accepted by deterministic\nTuring\nmachines in exponential time. A survey of where the theory of formal languages stood in\n1972\nwas presented by Book in\nTopics in formal language theory\n. His own description of the contents of this survey are as follows:-\nIn Section\n2\n, examples are given to explain the notion of finite specification of languages and the Chomsky hierarchy is defined. In Sections\n3\nthrough\n5\n, several sets of questions are discussed with answers phrased in terms of the Chomsky hierarchy. Some of the results on context-free languages are stated in Section\n6\n, and extensions of context-free languages are sketched in\n7\n. In Section\n8\n, some questions on context-sensitive grammars are discussed, and in Section\n9\n, complexity classes of formal languages are studied. Section\n10\ncontains a description of the metatheory and Section\n11\nhighlights work still to be done.\nBook was appointed to Harvard and later he moved to Yale. Maurice Nivat writes in\n[\n8\n]\nabout his first meeting with Book:-\nWe met in\n1971\nin the University of Western Ontario, in London, Ontario, at the occasion of some sort of summer school on Language Theory. I spent six weeks there with my wife and three children who were at that time\n11\n,\n8\nand\n4\n. In one day this friendship was established not only between Ron and me but also between Ron and my wife, between Ron and each of my three children. We did some work together ... mainly during a summer Ron spent in France, mostly in a small village of\n300\ninhabitants where I bought an old farm house in\n1973\n. Twenty-five years later some people from this village are still remembering this smiling American who did not speak French but who succeeded with his hands and with his smiles, smiles in his eyes, smiles on his mouth, smiles all over his face, to communicate with them, to share with them his energy, his joy of life. Ron indeed liked this place ... he liked talking to the farmers there. ...\n[\nHe\n]\ndid not like large towns, he did not like the sophistication of the traditional elite, he liked simple people working day after day to grow crops.\nIn\n1977\nBook was appointed Professor of Mathematics at the University of California at Santa Barbara. His research turned more towards string-rewriting systems, and monoid presentations. For example in\n1981\nhe published\nThue congruences and the\nChurch\n-Rosser property\nwhich studied the relationship between finite\nThue\nsystems and the semigroups which they present. In the following year Book published\nWhen is a monoid a group? The\nChurch\n-Rosser case is tractable\nwhich shows that there is a polynomial-time algorithm for deciding whether a finite monadic\nChurch\n-Rosser\nThue\nsystem defines a group.\nMcNaughton writes in\n[\n7\n]\n:-\nDuring most of the\n1980\ns Book was intensively interested in\n[\nstring-rewriting systems\n]\n. He is to be lauded for carrying out his research on a broad front, maintaining an interest in several different research questions, developing his own thoughts and paying careful attention to the results of others. He had many research collaborators, including several doctoral students and people who spent some fruitful post-doctoral years at Santa Barbara. He was, in effect, the leader of a group that included all or most of these. Part of our appreciation of the impact that he had on the field of rewriting systems was what these students and post-docs went on to do after they left Santa Barbara. I would like to interject a personal remark at this point and mention how much I have gained from this group. I have profited not only from the clear research orientation that Book has provided, but also from the contact I have had with him and with those who have acquired this orientation from him.\nThe main results which Book proved on rewriting systems are contained in his important book\nString-rewriting systems\n(1993)\non which he collaborated with Fred Otto.\nHowever Book worked on other topics at the same time as he studied rewriting systems. D-Z Du and K-I Ko write in\n[\n3\n]\n:-\nIn complexity theory, Book made central contributions to a wide variety of subareas. He initiated research on restrictive relativizations in the early\n1980\ns and investigated intensively the effect of different types of oracles on the computational power of oracle machines. This work has strongly influenced the direction of research in relativization. He was among the first to recognise the importance of tally sets, sparse sets, and other sets of succinct descriptions. He originated studies of lowness of sparse sets, of characterizations of sparse sets by\nKolmogorov\ncomplexity, and of reducibility and equivalence to sparse sets.\nIn all Book published over\n150\narticles on algebra and theoretical computer science. However he contributed in many other ways in addition to his research. In\n1970\n-\n71\nhe was a member of the Executive Committee of SIGACT\n(\nAssociation for Computing Machinery Special Interest Group on Algorithms and Computation Theory\n)\n, he was Chairman of the Institute of Electrical and Electronics Engineers Technological Committee on Mathematical Foundations of Computer Science from\n1977\nto\n1981\n, and served on the Council of EATCS\n(\nEuropean Association for Theoretical Computer Science\n)\nfrom\n1977\nto\n1985\n. He was editor of three monograph series, in particular being editor-in-chief of the series Progress in Theoretical Computer Science. He served as a member and as the chair of the program committees of numerous professional conferences including STOC\n(\nAnnual ACM Symposium on Theory of Computing\n)\n, FOCS\n(\nAnnual IEEE Symposium on Foundations of Computer Science\n)\n, ICALP\n(\nInternational Colloquium on Automata, Languages and Programming sponsored by the European Association of Theoretical Computer Science\n)\nand MFCS\n(\nInternational Symposium on Mathematical Foundations of Computer Science\n)\n.\nBook suffered from multiple sclerosis and his death at the age of sixty was a result of complications arising from that disease. He was survived by his wife Celia Wrathall. The book\n[\n1\n]\nis Festschrift for Book resulting from a colloquium at the University of Minnesota at Minneapolis on\n12\nApril\n1997\n. His death occurred about six weeks after this colloquium. Nivat ends his appreciation in\n[\n8\n]\nwith these words:-\n... it is certainly difficult to forget Ron's smile, Ron's gentleness from which he never departed whoever he was talking to and which hid an iron will to understand and to grow, theorem after theorem, nice scientific crops."
}