{
  "nome_completo": "Samuel Vince",
  "nome_curto": "Samuel Vince",
  "ano_nascimento": "1749",
  "ano_morte": "1821",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vince/",
  "lugar_nascimento": "Fressingfield, Suffolk, England",
  "lugar_morte": "Ramsgate, Kent, England",
  "biografia": "Samuel Vince\nwas the son of John Vince\n(1710\n-\n1780)\nand Ann Bullard\n(1706\n-\n1789)\n. John Vince was a plasterer and bricklayer who married Ann Bullard on\n12\nFebruary\n1735\n/\n1736\n. The reason for the two years is that in England the year began on\n25\nMarch in\n1736\nand the start of the year was only changed to\n1\nJanuary in\n1752\n. So by the present calendar, when John and Ann Vince married it was\n1736\nalthough, by the calendar in force at the time it was\n1735\n. John and Ann Vince had two sons, John Vince\n(1739\n-\n1805)\n, born in Weybridge, Suffolk, and Samuel Vince\n(1749\n-\n1821)\n, the subject of this biography. Samuel\n[\n3\n]\n:-\n... worked in early life with his father, who was a bricklayer. When about twelve years of age, being one day employed by the Rev Warnes, he was observed sitting on one of the staves of the ladder reading a book, instead of carrying his hod of mortar. Mr Warnes asked the boy if he was fond of reading; and on the child's answering in the affirmative, he fetched him a book, and told him, when he had read it, he would lend him another. Mr Warnes found the boy so anxious to learn, that he took him from his father's business, and put him to school, at Mr Tilney's, of Harleston, where, after a few years, he became an usher.\nHenry Tilney was the \"master of the Mathematical Academy\" at Harleston who sent solutions to mathematical questions to various magazines. It is clear that Vince obtained a fine mathematical education at that school. We should also note that the reference to Vince becoming an usher, means that he would teach other pupils at the school\n[\n7\n]\n:-\nIn\n1768\nVince's early competence in mathematics allowed him to propose one, and answer ten, of the serious mathematical problems regularly set in theÂ 'Ladies' Diary'.Â With financial help from Dr Samuel Cooper of Great Yarmouth, he briefly attended St Paul's School, London ...\nThe Revd Samuel Cooper\n(1739\n-\n1800)\nwas rector of Great Yarmouth and the author of many books, for example\nThe Necessity and Truth of the Three Principal Revelations Demonstrated From the Gradations of Science\n(1777)\nand\nThe Necessity and Duty of the Early Instruction of Children, in the Christian Religion, Evinced, and Enforced\n(1790)\n.\nVince was supported financially to study at the University of Cambridge by the Rev Gervas Holmes\n(1741\n-\n1796)\nof Gawdy Hall, in Redenhall, Norfolk. Let us note that most biographies of Vince\n(\nfor example\n[\n7\n]\n)\nsay he was supported by John Holmes of Gawdy Hall but this must be an error probably originating from\n1820\ns material such as\n[\n3\n]\n. John Holmes of Gawdy Hall, the son of Gervas Holmes, was only born in\n1774\n. Gervas Holmes, who had been born in Fressingfield, Suffolk, not only provided Vince with financial support but encouraged Vince to visit him during the university vacations. Vince was admitted as a\nsizar\nto Gonville and Caius College Cambridge on\n9\nFebruary\n1771\nand matriculated in the Michaelmas Term of\n1772\n. We note that, because of his upbringing and route into education, he was around four years older that his fellow students. He was Senior\nWrangler\nin the Mathematical Tripos of\n1775\n, the second Wrangler being Henry William Coulthurst\n(1753\n-\n1819)\n. He was also first Smith's prizeman in\n1775\nand became a member of the Hyson Club. This Club had been set up in\n1757\nby the Wranglers of that year, including\nEdward Waring\n. A Club designed for Wranglers, its only function was meeting at tea time for tea and conversation.\nIn\n1777\nVince moved from Gonville and Caius College to Sidney Sussex College where he was appointed Samuel Taylor Lecturer. His first publication seems to be\nA Tour Through Part of England and North Wales in the Summer of\n1777\n(1777)\n. He had visited Stratford-upon-Avon and in the article he describes the birthplaceÂ of Shakespeare. He was ordained deacon in Norwich Cathedral on\n12\nSeptember\n1779\nand ordained a priest five days later. On\n3\nJuly\n1780\n, Vince married Mary Paris at Willingham By St Ives, Cambridge. Mary was the daughter of Thomas Paris. Samuel and Mary Vince had one son, Samuel Berney Vince\n(2\nFebruary\n1781\n-\n14\nJune\n1845)\n, who was educated at Eton and admitted to King's College, Cambridge on\n15\nDecember\n1799\n. He was ordained a priest in\n1808\nand later became vicar of Ringwood, Hampshire.\nSamuel Vince began publishing the results of his mathematical researches, mostly in the\nPhilosophical Transactions\nof the\nRoyal Society\n. Between\n1780\nand\n1786\nhe published:\nAn investigation of the principles of progressive and rotatory motions\n(1780)\n;\nThe element of conic sections, as preparatory to the reading of Sir I Newton's Principia\n(1781)\n;\nA new method of investigating the sums of infinite series\n(1782)\n;\nOn the motion of bodies affected by friction\n(1785)\n;\nA supplement to the third part of the paper on the summation of infinite series, in the Philosophical Transactions for the year\n1782\n(1785)\n; and\nA new method of finding fluents by continuation\n(1786)\n.\nThe\n1780\npaper has the following Abstract:-\nThe communication of motion from impact is well known to constitute a considerable part of that branch of natural philosophy called mechanics; and as all our enquiries therein are directed, either to assist us in those operations which add to the conveniences of life, or to explain, for the satisfaction of the mind, those changes which we daily see arise from the effects of bodies on each other, it might naturally have been expected that the attention of philosophers would have been engaged, first in the investigation of such cases as most frequently occur from the accidental action of one body on another, before they had proceeded to others less obvious. A little consideration will convince any one how seldom it happens, in the collision of two bodies, that their centres of gravity and point of contact lie in the line of direction of the striking body, yet few writers on mechanics have extended their enquiries any further than this simple case. It must however be acknowledged, that the action of bodies on each other, in directions not passing through their centre of gravity, affords a subject at least curious in speculation; for my own part, I have little doubt but that it might be rendered extremely useful to the practical mechanic.\nFor this work, read at the\nRoyal Society\non\n15\nJune\n1780\n, Vince was awarded the Copley Medal by the\nRoyal Society\nin\n1780\n. This is the highest award the Society gives and in the following year it was presented to\nWilliam Herschel\nfor his discovery of Uranus.\nVince's\n1786\npaper has the following Abstract:-\nThe utility of finding fluents by continuation was manifest to Sir\nIsaac Newton\n, who first proposed it; and since his time some of the most eminent mathematicians have employed much of their attention upon it. The method which I have investigated and exemplified in this Paper, I offer as being entirely new; and at the same time it not only exhibits, at once, the general law up to the required fluent, but also appears, from some of the instances here given, to be more extensive and convenient in its application than any method hitherto offered. The general resolution of the given fluxion into a series of fluxions of the same kind, where the index of the unknown quantity without the vinculum keeps decreasing or increasing either by the index under or by half the index, has not, that I know of, before been given; which furnishes us at once not only with a very easy method of continuing fluents, but also points out a very simple method of investigating the fluent of the given fluxion without continuation.\nAs a consequence of his research achievements, he was elected a fellow of the\nRoyal Society\non\n22\nJune\n1786\n. These mathematical achievements were, however, in parallel with his career in the church\n[\n7\n]\n:-\n... Vince was presented in\n1784\nto the rectory of Kirby Bedon, Norfolk, which he occupied for two years before handing over to a curate and moving to the vicarage of South Creak, Norfolk, in\n1786\n. He was presented to the prebend of Melton Ross with Scamblesby, Lincolnshire, in\n1803\n, and in\n1809\nto the archdeaconry of Bedford.\nHis church positions were not honorary roles as we learn from\n[\n12\n]\n:-\nSamuel Vince, of Caius College, B.A.\n1775\n, of Sidney, M.A.\n1778\n, became sequestrator of the vicarage of Milton in\n1789\n. He did not reside in the parish, but walked over from Cambridge every Sunday morning, to perform his weekly duty. ... His native county was Norfolk, and he was remarkable, as well for his very simple manners, as for his strong provincial dialect.\nHe delivered the\nRoyal Society\n's Bakerian lecture, presumably in his 'strong provincial dialect', in the years\n1794\n-\n1799\nand\n1804\n. His titles included:\nObservations on the Theory of the Motion and Resistance of Fluids; with a Description of the Construction of Experiments, in order to obtain some fundamental Principles\n(1794)\n;\nExperiments upon the Resistance of Bodies moving in Fluids\n(1797)\n;\nObservations upon an unusual Horizontal Refraction of the Air; with Remarks on the Variations to which the lower Parts of the Atmosphere are sometimes subject\n(1798)\n; and\nObservations on the Hypotheses which have been assumed to account for the cause of Gravitation from Mechanical Principles\n(1804)\n.\nGilbert Wakefield, born in\n1756\n, writes in\n1792\n[\n8\n]\n:-\nMr Vince, originally of Caius-College but then, if I rightly recollect, of Sydney. He still lives in Cambridge; and it must be a strained panegyric indeed that exceeds his deserts, either as an accomplished mathematician, or an amiable man. This gentleman, I believe, has been rewarded with no preferment adequate to his reasonable pretensions.\nAnthony Shepherd\n(1721\n-\n1796)\n, born in Kendal, had been admitted to St John's College, Cambridge on\n27\nJune\n1740\nwhere he studied mathematics and graduated B.A. in\n1743\n. After being ordained he held a succession of church positions but was also a fellow of St John's College, Cambridge and was elected Plumian professor of astronomy at Cambridge in\n1760\n. Three years later, he was elected a fellow of the\nRoyal Society\nin\n1763\n. Following Shepherd's death in\n1796\n, Vince was elected Plumian professor of astronomy and experimental philosophy at Cambridge. He held this chair for\n25\nyears until his death in\n1821\n.\nVince's books on mathematics, physics and astronomy include:\nA treatise on practical astronomy\n(1790)\n;\nA plan of a course of lectures on natural philosophy\n(1793)\n; T\nhe principles of fluxions\n(2\nvolumes\n)\n(1795)\n(5\nth edition\n1818)\n;\nThe principles of hydrostatics\n(1796)\n(4\nth edition\n1812)\n;\nA complete system of astronomy\n(1797)\n(3\nrd edition\n1823)\n;\nA Treatise on Plane and Spherical Trigonometry with an Introduction, Explaining the Nature and Use of Logarithms. Adapted to the Use of Students in Philosophy\n(1800)\n; and\nObservations on the Hypotheses which Have Been Assumed to Account for the Cause of Gravitation from Mechanical Principles\n(1806)\n. He also wrote religious books including:\nThe Credibility of Christianity Vindicated In Answer to Mr Hume's Objections; in Two Discourses\n(1798)\n;\nA confutation of atheism, from the laws and constitution of the heavenly bodies\n(1807)\n;\nThe credibility of scripture miracles vindicated\n(1809)\n; and\nOn the division among Christians\n(1811)\n.\nVince's son, Samuel Berney Vince, wrote a number of works, including\nThe Propagation of Christianity was Not Indebted to Any Secondary Causes\n(1807)\n,\nTwo Discourses Before and After a Confirmation, Explanatory of the Church Catechism and the Nature and Design of the Lord's Supper\n(1813)\n, and\nRemarks On The Liturgy Of The United Churches Of England And Ireland\n(1835)\n. Twenty-four years after the death of his father, he edited a short work in\n1845\nentitledÂ\nObservations on Deism\nÂ consisting of a series of notes containing various criticisms of deism which Vince had himself planned on eventually publishing.\nYou can see a picture of Vince in his\nHelluones librorum,\nthe \"Bookworm's library\", at\nTHIS LINK\n.\nIn\n[\n1\n]\nwe have the following description of the picture:-\n\"Helluones\" means \"bookworms\" in Latin. Vince is studying a mathematical section of a book with running title similar to 'Principia naturalia'. Other academic publications scattered about the study include 'Meditationes algebraicae', 'Vince on the infinite series', and 'Problemata'. On the back wall are a diagram of \"\nHalley\n's scheme: transit of Venus\" and a chart of \"An analysis of Mr Locke's politics\n[\n?\n]\nideas\". A pendulum clock gives the time as\n9\n.\n15\n(\npresumably pm, as it is dark\n)\n. On the floor, his emaciated cat attempts to solve mathematical conundrums in the 'Ladies' Diary'.\nLet us end with giving the description of Vince by one of his pupils given in\n[\n2\n]\n. Although not strictly accurate in the details about Vince's life, nevertheless it is worth quoting to see how Vince was seen by his pupils:-\nHe discovered, when a very boy, such an aptitude for figures, such acuteness and skill in the combination of numbers, that he was soon recommended to the notice of the clergyman, who, fortunately for my friend, was a man of learning himself, and a zealous encourager of it in others. He assisted in the education of the youth, liberally and effectually, and in due time procured his admission at college. His progress was uniform and auspicious. He distinguished himself far above his fellows, by his mathematical attainments and philosophical pursuits, and received in due time the reward of his diligence and his merits. He enjoyed the highest honours in the power of the university to bestow; he assisted the studies of many of the most eminent men who have adorned, first the seat of Alma Mater, and afterwards, their country; he has enriched the branch of learning which he so successfully cultivated, with some of the most valuable publications of modern times; and he yet lives, and long may he live, with professional dignity and honourable ease. A word ought to be said of his patron, for I also, in some degree, experienced his kindness."
}