{
  "nome_completo": "Johann Samuel König",
  "nome_curto": "Samuel König",
  "ano_nascimento": "1712",
  "ano_morte": "1757",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Konig_Samuel/",
  "lugar_nascimento": "Büdingen, Germany",
  "lugar_morte": "Zuilenstein (near Amerongen), Netherlands",
  "biografia": "Samuel König\n's father was a mathematician and theologian who spent the last\n20\nyears of his life as professor of Oriental Studies at the University of Bern. König's early education was at home where he studied with his father's instruction. His father was a great enthusiast and he passed this on to his son with exciting lessons in science and mathematics.\nAfter studying at Bern, then in\n1729\nat Lausanne, König went to Basel in\n1730\nto study under\nJohann Bernoulli\n. After three years of study with\nJohann Bernoulli\nhe also began to be taught by\nDaniel Bernoulli\n. Along with\nClairaut\nand\nMaupertuis\nhe studied\nNewton\n's publications, in particular he did thorough and detailed work on the\nPrincipia\n. In\n1731\nHermann\nleft the chair of mathematics at St Petersburg to return to Basel where he was appointed to the chair of\nethics\nand natural law. König studied under\nHermann\nfrom\n1731\n, in particular he learn of\nLeibniz\n's philosophy. In\n1735\nKönig went to Marburg to continue his study of\nLeibniz\n's philosophy under Christian von Wolff's supervision.\nIn\n1737\nKönig returned to Bern, having begun to publish mathematical articles two years earlier. In Bern he wrote on dynamics, and two articles on this topic appeared in\n1738\n, but he practised law\n(\nwhich earned him more money than mathematics\n)\n. Near the end of\n1738\nKönig went to Paris where he met\nMaupertuis\n. Through\nMaupertuis\n, König was introduced to Voltaire and to the Marquise du\nChâtelet\n. He began to give the Marquise du\nChâtelet\nlessons in mathematics and on the philosophy of\nLeibniz\n.\nTogether with Voltaire and\ndu Châtelet\n, König visited René-Antoine Ferchault de Réaumur, the leading entomologist of the day who was conducting research in widely varied fields. Through his discussions with Réaumur, König was led to publish a work on the structure of honeycombs. This work was so highly thought of that König was elected to the\nParis Academy of Sciences\n.\nSoon after this König fell out with the\nMarquess du Châtelet\nand, although the reason is not certain, it has been suggested that they argued over payments for the lessons that König was giving to the Marquess. Certainly König did not leave Paris after his disagreement but continued to live there for about\n18\nmonths. After returning to Bern, he continued to earn his living from his law practice but also continued to study mathematics, in particular studying the works of\nClairaut\nand\nMaupertuis\n. König wrote a work on the shape of the Earth, which was published in\n1747\n, based on what he had learnt from studying\nClairaut\n's\nThéorie de la figure de la Terre\nⓉ\n(\nTheory of the shape of the Earth\n)\nand other works on this topic.\nIn\n1744\nKönig was exiled from Bern for\n10\nyears because he signed a liberal petition. König obtained a chair of philosophy and mathematics at Franeker in the Netherlands. Then, in\n1749\n, he went to The Hague where he was librarian to Prince William IV of Orange.\nMaupertuis\nproposed König for the\nBerlin Academy\nand he was honoured by election to the Academy in\n1749\n. However, he was to cause a split in the Academy through an essay, written before\n1749\nbut published in\n1751\n, on the principle of least action. This work attacked\nMaupertuis\naccusing him of having plagiarized\nLeibniz\n's work on this principle. König had touched on a sore point with the\nBerlin Academy\nfor a number of reasons. Firstly the Academy had just been involved in a dispute on the prize question for\n1746\n, which\nEuler\nhad made it clear required the entrants to criticise the philosophy of\nLeibniz\nand Wolff.\nEuler\nwas a strong opponent of the Leibniz and Wolff philosophy. Also for König, as a newly elected member of the Academy, to be seen to be attacking its President was not going to be well received.\nKönig had studied the philosophy of\nLeibniz\nunder Wolff so he was a strong follower of their philosophy. He claimed in his\n1751\narticle that\nLeibniz\nhad stated the Principle of Least Action in a letter of\n1707\nto\nJakob Hermann\n. A heated dispute followed the publication of König's article and he was asked to produce the letter. However König failed to do so and, after an investigation,\nEuler\ngave a report on the affair accusing König of fraud.\nAs a result of the dispute\nMaupertuis\nwas greatly upset and soon left the\nBerlin Academy\n. König's article was to have other repercussions as Voltaire,\nd'Alembert\nand\nEuler\nall ended at the centre of the dispute. König lived for six years after his article causing\n[\n1\n]\n:-\n... the ugliest of all scientific disputes.\nThese last six years of his life were completely dominated by the dispute.\nAn important kinetic law of energy, published in a work of\n1751\n(\nthe same year as his controversal article appeared\n)\n, is named after König and this law is a major contribution which he made to mathematics. König's character and role in science is summed up in\n[\n1\n]\nas follows:-\nA candid and amiable man, he was distinguished by erudition of unususl breadth even for his time. ... The opinion is occasonally voiced that were it not for the controversy over the principle of least action, König would be completely forgotten in the history of science. His formulation of the law\n(\nnamed after him\n)\nof the kinetic energy of the motion of a mass point system relative to its centre of gravity is sufficient in itself to refute this view."
}