{
  "nome_completo": "Samuel Loyd",
  "nome_curto": "Samuel Loyd",
  "ano_nascimento": "1841",
  "ano_morte": "1911",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Loyd/",
  "lugar_nascimento": "Philadelphia, Pennsylvania , USA",
  "lugar_morte": "New York, USA",
  "biografia": "Always known as Sam,\nSamuel Loyd\nwas the creator of famous mathematical puzzles and recreations. He was born in Philadelphia where his father was an estate agent, but he did not live there for very long since when he was only three years old his family moved to New York. Sam's father had a good income from being an estate agent and the family were well off. It was a large family with Sam being the youngest of nine children. He attended school in New York, completing his secondary education in\n1858\n. Already by this time he had become fascinated by the game of chess which he took up when he was\n14\nyears old when he began to attend a chess club with his brothers Thomas and Isaac. While still at school, Loyd won prizes for his chess problems.\nLoyd's first chess problem was published in the\nNew York Saturday Courier\non\n14\nApril\n1855\n. The following problem won him first prize in a competition run by the\nNew York Clipper\nand it was published in the paper on\n11\nOctober\n1856\n.\nClick\nTHIS LINK\nfor one of Loyd's first chess problems and\nTHIS LINK\nfor another early chess problem by Loyd.\nHe began submitting problems to\nChess Monthly\nand he became the problem editor of the magazine in\n1857\nafter winning first prize for the following problem you can see at\nTHIS LINK\n.\nClick\nTHIS LINK\nfor the solution.\nAfter leaving school Loyd began to study engineering, intending to become a steam and mechanical engineer, but he found he could make his living from his puzzles and chess problems. He began to develop more unusual puzzles such as the following retrograde analysis problem which he submitted to\nMusical World\nin\n1859\n.\n(\nIt is a retrograde analysis problem since you can deduce from the fact that there is a mate in\n2\nthat Black cannot castle - the mate is then easy.\n)\nClick\nTHIS LINK\nfor this first retrograde analysis problem.\nLoyd's interests were by now rather diverse for as well as earning money as a plumbing contractor he had purchased a chain of music stores. In fact he had other skills such as that of wood engraver, which he taught himself, and he was also a skilled cartoonist. He continued to compose chess problems, write newspaper columns, and edit papers such as\nSam Loyd's Puzzle Magazine\nand even a mechanics journal. He also played in chess tournaments although he was not a top class chess player which shows vividly that chess involves so much more than problem solving. For example he visited Europe in\n1867\nand played in a tournament in Paris but performed poorly. He did meet many who were interested in composing chess problems, however, while in Germany.\nBy\n1870\nLoyd had become more interested in composing mathematical puzzles than chess problems. He had composed a famous problem consisting of three cards, two with the picture of a horse and the third with a picture of two jockeys. The puzzle was to rearrange the pieces so that the jockeys were riding the horses. He sold it to the showman P T Barnum and it became famous as\nP T Barnum's Trick Donkey\n.\nIn\n1878\n, he published a book of\n500\nproblems,\nChess Strategy\nwhich consisted in the main in problems which he had composed for columns of\nScientific American\nover the previous two years. In\n[\n2\n]\nhis skill as a composer of chess problems is described as follows:-\nLoyd, whose genius for inventing fresh and surprising themes and expressing them in a subtle and cryptic form has never been equalled, was content to work out his own ideas in his own way, caring little for considerations of economy and the avoidance of duals and other rather artificial canons of elegance accepted by English and German composers; and there can be no doubt that he was right to follow his peculiar bent, seeing that no other composer's problems so often give the solver impressions of wit and dry humour.\nAs well as chess problems of the type \"White to play and mate in three\", Loyd also produced mathematical problems involving chess boards. For example in\nLe Sphinx\nin April\n1867\nhe asked:-\nPlace the Queen on a chessboard and pass her over the entire sixty-four squares and back again to the point of beginning in fourteen moves.\nTry it - you will not find it easy! Here is a small clue. It is impossible to pass the Queen over every square in\n14\nmoves starting from its own square. Loyd discussed this in the April\n1908\nedition of\nSam Loyd's Puzzle Magazine\n.\nLoyd contributed the following problems to the first part of the\nAmerican Chess Journal\n. He wrote:-\nIt will not be amiss to have a little impromptu exhibition, bearing upon conditional positions produced from the position of the forces as arranged for actual play.\nHe then gave five problems involving the chess board as set up at the start of a game. Here are the problems\n(\nwe have changed the wording slightly to make them slightly less technical\n)\n:-\nIf both players make the same moves, how can White mate in four moves?\nIf both players make the same moves\n(\nwhen possible\n)\n, how can White force Black to mate White in eight moves?\nHow can discovered checkmate happen in four moves?\nFind how a stalemate could happen in ten moves\n.\nFind a game where perpetual check can be forced from the third move\n.\nThese show Loyd's genius very clearly - particularly d\n)\nwhich is an incredible achievement.\nLoyd's most famous puzzle was the\n15\nPuzzle which he produced in\n1878\n. Loyd wrote about the puzzle in\nSam Loyd's Cyclopaedia of\n5000\nPuzzles, Tricks and Conundrums\nwhich was published in\n1914\nafter his death by his son\n(\nalso called Sam Loyd\n)\n:-\nOlder inhabitants of Puzzleland will remember how in the seventies I drove the entire world crazy with a little box of movable blocks which became known as the \"\n14\n-\n15\nPuzzle\". The fifteen blocks were arranged in the square box in rectangular order, but with the\n14\nand\n15\nreversed as shown.\nSee\nTHIS LINK\nfor the illustration.\nThe puzzle consisted of moving the blocks about, one at a time, to bring them back to the present position in every respect except that the error in the\n14\nand\n15\nwas corrected.\nA prize of $\n1000\n, offered for the first correct solution to the problem, has never been claimed, although there are thousands of persons who say they have performed the required feat.\nPeople became infatuated with the puzzle and ludicrous tales are told of shopkeepers who neglected to open their stores; of a distinguished clergyman who stood under a street lamp all through a wintry night trying to recall the way he had performed the feat. The mysterious feature of the puzzle is that none seem able to remember the sequence of moves whereby they feel sure they have succeeded in solving the puzzle. Pilots are said to have wrecked their ships, and engineers rush their trains past stations. A famous Baltimore editor tells how he went for his noon lunch and was discovered by frantic staff long past midnight pushing little pieces of pie around on a plate! Farmers are known to have deserted their ploughs ...\nOf course, Loyd knew his $\n1000\nwas safe for the puzzle cannot be solved. The craze swept America where employers put up notices prohibiting playing the puzzle during office hours. In Germany it was played by Deputies in the Reichstag while in France it was described as a greater scourge than alcohol or tobacco.\nAnother of Loyd's famous puzzles was called \"Get off the Earth\" and was produced many years after the\n15\nPuzzle. Here is Loyd's own description of the puzzle taken from the January\n1908\npart of the\nStrand\nmagazine:-\nIt consisted of two concentric pieces of cardboard, fastened together so that the smaller inner one, which was circular, moved slightly backwards and forward, on a pivot, producing the mystery. As you looked at them, there were thirteen Chinamen plainly pictured. Move the inner card around a little and only twelve Chinamen remained. You couldn't tell what had become of the other Chinaman, try as you would. Scientists tried it without success, and indeed no single absolutely correct analysis was ever submitted.\nSee\nTHIS LINK\n.\nWe have talked about mathematical puzzles invented by Loyd. This includes the cryptarithm,  a type of puzzle which he invented.\nSee\nTHIS LINK\nAs always he gave a colourful description\n(\nand a cartoon which we have not reproduced\n)\nto go with the puzzle:-\nThe archaeologist is examining a completed problem in long division, engraved on a sandstone boulder. due to weathering of the rock, most of the figures are no longer legible. Fortunately the eight legible digits provide enough information to enable you to supply the missing figures.\nAt first sight one would not expect there to be a unique solution to this problem, but Loyd was well aware that a logical argument would find the one and only one solution.\nNot only did Loyd produce puzzles, he also gave performances of tricks. He was a skilled ventriloquist and later in his life performed on stage with his son who appeared able to read his mind, but actually mimed while Loyd used his ventriloquist skills to make his son appear to give correct answers.\nLoyd produced over\n10\n000\npuzzles in his lifetime many involving sophisticated mathematical ideas. The author of\n[\n2\n]\nwrites:-\nLoyd had a real gift - such as that shown in the 'Curiosa Mathematica' of the Rev\nC L Dodgson\n... - for the fantastic in mathematical science, and had he devoted himself to making use of it, might have earned fame as an investigator in the vast and poetic region of pure mathematics, a worthy follower of\nCayley\nand\nSylvester\n.\nAlain C White wrote\nSam Loyd and his Chess Problems\n(1913)\nand in it he writes:-\nIdeas came to\n[\nLoyd\n]\nwith great fecundity, often too rapidly for him to analyse them completely. Yet his powers for rapid analysis were almost unrivalled. He could see an idea from many sides at once; first always from the point of view of a puzzle, then from the humorous standpoint, finally from the artistic aspect."
}