{
  "nome_completo": "Samuel Dickstein",
  "nome_curto": "Samuel Dickstein",
  "ano_nascimento": "1851",
  "ano_morte": "1939",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dickstein/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Samuel Dickstein\nwas brought up during difficult years for Poles, most of whom aspired to see the country of Poland re-established. Poland did not formally exist at the time of Dickstein's birth and much of the pattern of his life was dominated by the aim of Poles to restore their country.\nPoland had been partitioned in\n1772\nwith the south was called Galicia and under Austrian control while Russia and Prussia controlled the rest of the country. In\n1846\n, three years before Dickstein was born, there was an attempted revolution by Polish nationalists. The Prussian police had discovered their plans to start an uprising and they put a stop to it in their area. However the uprising spread to Galicia but there it was soon defeated by Austrian troops. During the following years when Dickstein was a young child Poles sought independence but were kept down by armed force.\nThe Crimean War which ended in\n1856\nhad a great influence within the Russian Empire. Some reforms were put in place in the Russian areas of Poland\n(\nwhich included Warsaw where Dickstein lived\n)\nbut these only seemed to invoke anger among young patriotic Poles. There were political demonstrations and, towards the end of\n1862\n, riots broke out in Warsaw. On\n22\nJanuary\n1863\nthere was a move to force young Poles into the Russian army and a widespread rebellion took place. For a year Dickstein, a youth aged\n12\n, saw the Polish uprising being crushed. The victorious Russian occupiers then carried out executions, confiscations, and deportations, and one can only imagine how a young man like Dickstein might have felt knowing that Poles could not hope to rule their own country again in the foreseeable future.\nIn a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in the Russian language. There was no Polish university for Dickstein to attend so, in\n1866\n, he entered one of the only higher education establishments in Warsaw, the teacher's college. He studied there until\n1869\n, the year in which it was converted into the Russian University of Warsaw . From\n1870\nto\n1876\nDickstein attended this Russian university in Warsaw specialising in mathematics. He graduated with a Master's degree in\n1876\nbut all the time he spent at university he held positions in secondary schools teaching mathematics to provide the means to support his studies.\nWith the education system controlled by the Russian rulers, Dickstein decided to do what he could to promote a Polish education and he directed his own private school for ten years beginning in\n1878\n. However during this period he began other ventures to promote Polish science.\nDickstein was one of the main instigators of publishing mathematical journals in Poland. In\n1884\nhe was one of the two founders of a series of mathematics and physics textbooks which were written in Polish. A few years later he was one of three scientists who set up the journal\nMathematical and Physical Papers\nediting the journal from\n1888\n. From\n1897\nhe edited\nMathematical News\nanother publication which he was involved in setting up. He also continued publication of\nCircle of Polish Mathematicians\nwhich had begun publishing in St Petersburg in\n1880\n.\nKuratowski\n, thinking about the development of Polish mathematics, notes in\n[\n2\n]\nthe importance of the publications:-\nThe establishment of \"Mathematical and Physical Papers\" and \"Mathematical News\" made possible for Polish mathematicians to publish the results of their research in Poland, and thus it favoured the increase of mathematical activity in our country ...\nIt was not only with his role in publishing that Dickstein made a major contribution to Polish mathematics. In\n1903\nDickstein was a founder of the\nWarsaw Scientific Society\nand he was important in the development of the\nPolish Mathematical Society\n. These played a vital role in the development of Polish mathematics and we have described above the political situation out of which the\nWarsaw Scientific Society\nwas born.\nThe first meeting of a group trying to set up a Polish institution in Warsaw took place on\n21\nDecember\n1903\n. Dickstein was one of two mathematicians in this founding group of fourteen, and was elected as secretary of the group. The work of the\nWarsaw Scientific Society\nstarted properly in November\n1907\n. A Mathematical Study was set up with Dickstein donating a fine library of mathematical texts.\nWorld War I brought major changes in Poland. In August\n1915\nthe Russian forces which had held Poland for many years withdrew from Warsaw. Germany and Austria-Hungary took control of most of the country and a German governor general was installed in Warsaw. One of the first moves after the Russian withdrawal was the refounding of the University of Warsaw and it began operating as a Polish university in November\n1915\n. Dickstein taught in the newly established university, giving the first year lectures on algebra. He became a professor of mathematics at the University of Warsaw in\n1919\nwhen the university became properly constituted after the end of the war.\nDickstein's work was mostly in algebra and the history of mathematics. In particular he had written an important monograph on\nWronski\nin\n1896\n.\nKuratowski\nwrites in\n[\n2\n]\nthat Dickstein:-\n... was not a scholar of outstanding creative achievements, and certainly his lectures presented a somewhat outdated algebra; they were, however, excellently shaped lectures by an enthusiast for mathematics, who infected young adepts in mathematics with his own ardour; this was by no means unimportant for the new staff of renascent Polish Science.\nUlam\n, at age\n23\n, met Dickstein, who was then in his eighties, at the International Mathematical Congress in Zürich in\n1932\n. He writes that Dickstein was:-\n... wandering around looking for his contemporaries. Dickstein's teacher had been a student of\nCauchy\nin the early nineteenth century, and he still considered\nPoincaré\n, who died in\n1912\n, a bright young man. To me this was like going into the prehistory of mathematics and it filled me with a kind of philosophical awe.\nDickstein died in the Nazi bombing of Warsaw in\n1939\nand all his family died during the German occupation of Poland."
}