{
  "nome_completo": "Samuel Roberts",
  "nome_curto": "Samuel Roberts",
  "ano_nascimento": "1827",
  "ano_morte": "1913",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Roberts/",
  "lugar_nascimento": "Horncastle, Lincolnshire, England",
  "lugar_morte": "London, England",
  "biografia": "Samuel Roberts\n's father was Griffith Roberts\n(\nborn about\n1786)\nand his mother was Anna Roberts\n(\nborn about\n1786)\n.\nSamuel Roberts was educated at Queen Elizabeth's Grammar School in the town of his birth. In\n1844\nhe entered Manchester New College and, the following year, he began his studies at the University of London. He graduated in mathematics with a BA in\n1847\n, then two years later he was placed first in the examinations for his MA in mathematics and physics.\nAfter this he studied law, becoming a solicitor in\n1853\nin Lincoln. However his love of mathematics made him give up law after a few years, and he returned to London to take up his mathematical studies for a second time. In fact he had published mathematical papers from\n1848\nbut, after the\nLondon Mathematical Society\nwas founded in early\n1865\n, Roberts could join in discussions with other mathematicians for he had no mathematical post. As\nGlaisher\nwrite in\n[\n1\n]\n:-\nHe was simply a private gentleman who pursued researches from pure love of investigation and desire to extend the boundaries of subjects that were attractive to him. And he never sought any recognition of his work; for him it was entirely its own reward.\nRobert's interests in mathematics were wide ranging.\nGlaisher\n, writing in\n[\n1\n]\n, describes Roberts' contributions to mathematics as:-\n... numerous and valuable, and they covered a somewhat wide range. Among the subjects to which his principal papers related were plane and solid geometry, theory of numbers, and link motion. He also wrote on the calculus of operations, interpolation etc. His writings on geometry included several important papers on parallel curves and surfaces. In theory of numbers he was interested in the Pellian equation and similar problems.\nGlaisher\nalso records in\n[\n1\n]\nan interesting comment which\nCayley\nmade to him concerning Roberts.\nCayley\nsaid that he regretted that joint papers were so rare in mathematics since he would have liked to have collaborated with Roberts, particularly on ideas which arose from Roberts' paper\nOn the motion of a plane under given conditions\n.\nRoberts served on the Council of the\nLondon Mathematical Society\nfrom\n1866\nto\n1892\n. He was Treasurer of the Society for\n8\nyears from\n1872\nto\n1880\nand President from\n1880\nto\n1882\n. He was awarded the\nDe Morgan\nMedal by the Society in\n1896\n.\nThe greatest honour given to Roberts was his election as a Fellow of the\nRoyal Society\nin\n1878\n."
}