{
  "nome_completo": "William Waldron Schieffelin Claytor",
  "nome_curto": "Schieffelin Claytor",
  "ano_nascimento": "1908",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Claytor/",
  "lugar_nascimento": "Norfolk, Virginia, USA",
  "lugar_morte": "Washington, D.C., USA",
  "biografia": "Schieffelin Claytor\n's parents were William Oat Claytor\n(1880\n-\n1956)\nand Simsie Thorne. William Oat Claytor was the fourth child of thirteen children of William Armstead Claytor and Judith Ann Reynolds. Most the thirteen children went on to become farmers, teachers or medical doctors. William Oat Claytor married Simsie E Thorne of Washington, D.C. She had attended the Hampton Normal and Agricultural Institute, at Hampton, Virginia, graduating around\n1900\n. When Schieffelin Claytor, the subject of this biography, was born his father was a vocational arts teacher at the Southern Norfolk Colored Graded School. The unusual name Schieffelin may have been chosen because of William Jay Schieffelin\n(1866\n-\n1955)\nwho was a Republican of the school of Lincoln and strongly advocated the rights and advancement of African-American citizens. William Oat Claytor was awarded a D.D.S. in dentistry from Howard University in\n1916\n. The family lived at\n1350\nU Street, Washington, D.C. while he studied at Howard University, a street which became famed as the heart of black culture in America. After graduating William Oat Claytor worked for the U.S. Bureau of Engraving and Printing but, by\n1920\n, was working from his home at\n1419\nQ Street, Northwest in Washington, D.C. In\n1928\nthe family moved to\n1710\nP Street, Northwest.\nThe family lived in Washington, D.C. throughout the early years of Schieffelin Claytor upbringing, and naturally he attended schools near his home. Later he studied at the Hampton Normal and Agricultural Institute, Virginia, where his mother had studied. He entered Howard University in September\n1925\nand graduated with a B.S. in mathematics in\n1929\n. There he was taught by\nDudley Weldon Woodard\nwho had been awarded a Master's degree in mathematics from the University of Chicago and then taught at College level for over ten years before being appointed to Howard University in\n1920\n.\nWoodard\ntook the year\n1927\n-\n28\naway from Howard during which time he studied at the University of Pennsylvania for a Ph.D. advised by John Robert Kline\n(1891\n-\n1955)\n.\nWoodard\n, the second African-American to be awarded a doctorate in mathematics, returned to Howard University and set up a graduate programme in mathematics. Claytor joined that programme in\n1929\n, the first year it ran, and took the courses offered on group theory, topology, number theory, real analysis and complex analysis. While taking this graduate course, advised by\nWoodard\n, he published the solution to a problem on limits in\nThe American Mathematical Monthly\nin December of\n1929\n. The problem had been posed in the previous year by James Singer, a student of\nJames Waddell Alexander\n, of the Graduate College at Princeton. Claytor graduated from Howard University with an M.S. in\n1930\n.\nWoodard\nhad studied for his doctorate under John Robert Kline, who had been a student of\nRobert L Moore\n, at the University of Pennsylvania. He advised Claytor to follow the same route and he wrote to the University of Pennsylvania with a strong recommendation that they accept Claytor onto their graduate programme. He was accepted and, in\n1930\n, began to study for his doctorate at the University of Pennsylvania advised by John Robert Kline. Advised to read the latest topology papers, Claytor wrote to\nRaymond Wilder\nin April\n1931\n(\nsee for example\n[\n9\n]\n)\n:-\nMay I kindly ask for those of your papers of which you still have reprints. Some of your publications will aid me considerably in my thesis work here at Pennsylvania.\nClaytor's work progressed well and he was awarded a Harrison Scholarship which he held during his second year as a graduate student and he also won a Harrison Fellowship holding these for his final two years of graduate study. Claytor was awarded a Ph.D. on Wednesday,\n21\nJune\n1933\nfor his thesis\nTopological Immersion of Peanian Continua in a Spherical Surface\n. It was published in the\nAnnals of Mathematics\n. With this Claytor became the third African-American to be awarded a Ph.D. in mathematics and the first to have a research paper published. Kline wrote to\nRobert L Moore\nin October\n1933\nand praised Claytor's thesis highly\n(\nsee for example\n[\n9\n]\n)\n:-\nClaytor wrote a very fine thesis. In many ways I think that it is perhaps the best that I have ever had done under my direction.\nThis quality of Claytor's thesis has been fully attested by the number of papers which have continued to reference it and the resulting papers. For example in\n2011\nBruce Richter, Brendan Rooney and Carsten Thomassen proved a generalisation of Claytor's results in their paper\nOn planarity of compact, locally connected, metric spaces\n.\nOne would have expected that someone with such an outstanding thesis would be able to find a university post where his talents could be fully realised. The best he could achieve was a position in West Virginia State College where he taught a bright student Katherine Coleman\n(\nbetter known today by her married name\nKatherine Johnson\n)\n. She wrote\n[\n3\n]\n:-\nMany professors tell you that you'd be good at this or that, but they don't always help you with that career path. Professor Claytor made sure I was prepared to be a research mathematician. ... Claytor was a young professor himself, and he would walk into the room, put his hand in his pocket, and take some chalk out, and continue yesterday's lesson. But sometimes I could see that others in the class did not understand what he was teaching. So I would ask questions to help them. He'd tell me that I should know the answer, and I finally had to tell him that I did know the answer, but the other students did not. I could tell.\nBut Claytor did far more that simply encourage Katherine, he made sure she took all the right courses and when he realised that she would need a background in analytic geometry that the College did not offer, he simply put on a course just for Katherine. However, a heavy teaching load and taking on extra work to help his students meant he had no time for research. He wrote in\n1936\n(\nsee for example\n[\n9\n]\n)\n:-\n... in West Virginia my duties, together with the unfortunate local environment, have made it virtually impossible for me to do any effective mathematical work; so much so even, that I have not succeeded in completing a single problem since doing my thesis.\nMany mathematicians were aware of his predicament and, a year before he wrote the above, Claytor had applied for a National Research Council fellowship to enable him to work with\nOswald Veblen\nat the Institute for Advanced Study and with other topologists such as Solomon Lefschetz at Princeton University. Others working at Princeton in this area were\nJames Alexander\n,\nDeane Montgomery\n, and\nLeo Zippin\nso it would have been an excellent place where Claytor would have flourished. However, Princeton University would not accept a \"coloured person\", the University administration claiming that the students would object.\nLeo Zippin\n, who was at Princeton, wrote to\nRaymond Wilder\nat the University of Michigan at Ann Arbor trying to have Claytor accepted there:-\nI had a letter from Kline asking me to write for Claytor ... which I did with great willingness ... and I spoke to\nLefschetz\nand then to\nVeblen\n... .\nVeblen\n... seemed well impressed with Claytor ... He's heard about him for a full year or two. ... Princeton being out ... Claytor will find other places. I don't know of any better one he could find than Michigan ...\nClaytor did not get a National Research Council fellowship,\nGilbert Bliss\nhaving voted against an award being made to him. However, he felt he had to leave West Virginia State College and he wrote himself to Wilder seeking a position at the University of Michigan. After due discussions, Michigan decided to offer Claytor a position for a year but without a stipend. They would not charge him lecture or library fees - a small concession. Having some savings, Claytor thought he could survive, with difficulty, for a year without a stipend so accepted Michigan's offer and arranged to have\n1936\n-\n37\nas leave of absence from West Virginia State College.\nThe difficulties for African-Americans at this time is illustrated by discussions which went on about holding a topology conference in\n1936\n-\n37\nat North Carolina.\nWilder\n, when asked by\nWhyburn\nabout the organisation of this conference, replied:-\nThere are at least two \"offcolor\" topologists in existence\n(\nWoodard\nand Claytor\n)\nwho would undoubtedly like to attend, and I wonder if they would feel very comfortable about attending a meeting in North Carolina. I know that not very long ago there was considerable discomfort caused some negro scholars who attended a meeting of some one of the learned societies in the south. I would probably never think of this objection if it hadn't been for the incident just mentioned, and for the fact that Claytor is apparently going to be here next year\n[1936\n-\n1937]\nto do some post-doctoral work.\nKline, when asked his opinion, wrote to\nWhyburn\n:-\nI do not believe either of these men\n(\nWoodard\nand Claytor\n)\nwill by any means think of going to Durham. ... I think they will not under the circumstances wish to run the risk of any unpleasant feeling by appearing at a meeting in the south.\nIt is unclear whether Claytor did attend this topology meeting\n(\nno list of participants exists\n)\nbut he did attend the\nAmerican Mathematical Society\nmeeting in December\n1936\nin Durham and Chapel Hill immediately afterwards. He was not allowed to stay in the conference accommodation and he was given a room in a private hotel. He did present a paper\nPeanian continua not imbeddable in a spherical surface\nto the\nAmerican Mathematical Society\nmeeting which contained new results he had obtained during the summer of\n1936\nand completed while at the University of Michigan. He published this paper in the\nAnnals of Mathematics\n, appearing in\n1937\n.\nClaytor was successful in an application to the Rosenwald Fund and he was informed in April\n1937\nthat he would receive a fellowship of $\n1500\n. One of the conditions was that the fellowship could not be taken abroad and he was advised to take it at the Institute for Advanced Study. However, again Princeton University stated that they would not permit any coloured person to go to the Institute for Advanced Study. Claytor decided to remain at the University of Michigan and, another application to the Rosenwald Fund provided a fellowship for a further year so he was able to remain at Ann Arbor until the end of the\n1938\n-\n39\nacademic year. Sadly, worries about his uncertain future meant that Claytor found it difficult to concentrate on his research.\nRaymond Wilder\nand his colleagues at the University of Michigan, realising the stress that Caytor was under, tried to get him a permanent position there but the university authorities refused.\nWilder\ndid manage to get a non-academic position for Claytor at Michigan which enabled him to remain there until\n1941\n, but he was not able to attend research seminars. When the Institute for Advanced Study opened its own building in\n1939\nthey were able to make their own decisions independently of Princeton University and\nVeblen\noffered to accept Claytor at the Institute. However, Claytor turned down the offer saying that he did not want to be a guinea pig.\nAlthough in April\n1941\nthe United States was not yet involved in World War I, nevertheless Claytor enlisted in the US Army. He spent the war years teaching in Anti-Aircraft Artillery Schools in Virginia and Georgia. After the war ended, he spent the year\n1945\n-\n46\nat the Southern University in Baton Rouge, Louisiana, and the following year at the Hampton Institute. In\n1947\nhe accepted a position at Howard University and, in the following year married Mae Belle Pullins; they had one daughter Melody Rachel Claytor. In the year they married, Mae was awarded a doctorate in psychology from the School of Education at New York University. Claytor continued teaching at Howard University where he regularly taught around\n20\nhours a week leaving him no time for research. He was only\n59\nyears old and still in post at Howard University when he died in\n1967\n.\nThe\nNational Association of Mathematicians\nwas founded in\n1969\nwith the aim of:-\n...  the promotion of excellence in the mathematical sciences and the promotion and mathematical development of under-represented minority mathematicians and mathematics students.\nIn\n1980\nthe Association instituted the Claytor Lecture in honour of William Schieffelin Claytor.\nLet us end this biography by quoting a letter written by Mae Claytor after Claytor's death\n(\nsee\n[\n2\n]\n)\n:-\nI am sorry about being late with this but it is just difficult for me to write about Bill. I am still at the point where I do not like to go back and think. In order to get much of this material, I had to go to what I call our memory books and looking at pictures and sort of reliving Bill; it just hurts a bit too much. I hope this is O.K. There is so much I just cannot put on paper. Even writing about Bill and his presentation at the Math Society, I thought about the days Bill used to tell me how owing to the Black-White mess, he had to stay at a private home when the others were at the hotel where the Association met. Over the years when the colour-line became less, he never would attend any more meetings. J R Kline used to come to see us periodically and try to get Bill to go with him but I guess the hurt went too deeply with him. After he left, I found old papers and letters he had when Kline was trying to get him in Princeton as a Fellow and whew, again it was the colour mess. At Princeton, the administration said the students might object to a \"culud\" person which was a laugh, they would never have known it. I do hope what I have written is O.K."
}