{
  "nome_completo": "Simion Stoilow",
  "nome_curto": "Simion Stoilow",
  "ano_nascimento": "1887",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stoilow/",
  "lugar_nascimento": "Bucharest, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Although\nSimion Stoilow\nwas born in Bucharest, he grew up in Craiova, about\n290\nkm west of Bucharest. At this time Craiova was a city with\n40\n,\n000\ninhabitants containing many small factories. Stoilow attended both primary and secondary school in Craiova, and showed great potential in mathematics. He went to Paris where he studied at the Faculty of Sciences and was awarded his Licence des Sciences Mathématique in\n1910\n. He remained in Paris to undertake research for his doctorate.\nIn Paris Stoilow was able to benefit from being in a major centre for mathematical research. He was able to attend lectures by\nPicard\n,\nPoincaré\n,\nGoursat\n,\nHadamard\n,\nBorel\nand\nLebesgue\n. Later in his career he wrote articles on some of these outstanding French mathematicians\n(\nfor example\nMathematical work of Henri Lebesgue\n(\nRomanian\n)\n(1942)\nand\nÉmile Borel and modern mathematical analysis\n(\nRomanian\n)\n(1956))\n. Stoilow's thesis advisor was\nÉmile Picard\n, and in\n1914\nhe submitted his doctoral thesis\nSur une classe de fonctions de deux variables definies par les equations lineaires aux derivees partielles\nⓉ\n(\nOn a class of functions of two variables defined by linear equations with partial derivatives\n)\n. The thesis was a remarkable piece of work which studies the\nCauchy\nproblem for initial data containing singularities. However, at this time World War I broke out and it was not possible for Stoilow to defend his thesis until\n1916\n. He did, however, publish his first paper in\n1914\n, namely\nSur les intégrales des équations linéaires aux dérivées partielles à deux variables indépendantes\nⓉ\n(\nOn the integrals of linear partial differential equations in two independent variables\n)\n. He published two further papers, namely\nSur les fonctions quadruplement périodiques\nⓉ\n(\nOn fourfold periodic functions\n)\n(1915)\nand\nSur l'intégration des équations linéaires aux dérivées partielles et la méthode des approximations successives\nⓉ\n(\nOn the integration of linear partial differential equations and the method of successive approximations\n)\n(1916)\n, before publishing his doctoral thesis in\n1916\n. He was occupied with war service during World War I so was not in a position to begin his career until after the war ended.\nIn\n1919\nStoilow was appointed as a lecturer in the Department of Mathematical Analysis at the University of Iasi. He did not spend long in this department before moving in January\n1920\nto the Department of Higher Algebra. He published three further papers in\n1919\nincluding\nSur les singularités mobiles des intégrales des équations linéaires aux dérivées partielles et sur leur intégrale générale\nⓉ\n(\nOn mobile singularities of the integrals of linear partial differential equations and their general integral\n)\n, and two further papers in\n1920\n. He left Iasi in\n1921\nwhen he was appointed as a lecturer in the Department of Analysis at Bucharest University. After two years in Bucharest, he was named Professor of Function Theory and Higher Algebra at Cernauti University. Cernauti is the Romanian name for the city which at that time was in Romania but following World War II became part of Ukraine and is now called Chernivtsi. Stoilow was Dean of Cernauti University for two periods during the sixteen years he spent there, namely in\n1925\n-\n26\nand again in\n1932\n-\n39\n.\nStoilow returned to Bucharest in\n1939\nwhen he was appointed Head of the Department of the Theory of Functions at the Polytechnic Institute, succeeding Dimitrie\nPompeiu\n. He served as rector of Bucharest University during\n1944\n-\n45\nand he was Dean of the Faculty of Physics and Mathematics from\n1948\nto\n1951\n.\nThe articles\n[\n8\n]\nand\n[\n10\n]\nboth give a slant on Stoilow's political views, and both also give an excellent survey of his mathematical contributions. Andreian Cazacu writes\n[\n8\n]\n:-\nAfter the\n24\nth\nAugust\n1944\n[\nStoilow\n]\nwholeheartedly joined the ranks of those working for the democratisation and reconstruction of the country under the leadership of the Romanian Communist Party.\nHowever Constantinescu strongly criticises occupation of Romania immediately after the war by the Soviet army\n[\n10\n]\n:-\n... which executed orders of Moscow ... in the direction of the 'russification' of the country\n(\ne.g. the citation of a Romanian author instead of a Russian one was sometimes dangerous, since it represented the crime of 'cosmopolitanism'\n)\n.\nConstantinescu writes:-\nI prepared my master's thesis with Stoilow. Finding out my political situation, Stoilow fought with might and main in order to help me.\nHe recounts episodes of Stoilow's political activities in\n[\n10\n]\nwhere he also gives an excellent account of his mathematical work:-\nStoilow was known as a Romanian mathematician with influential work in the field of complex analysis. ... His scientific production was influential in the development of the modern theory of analytic functions, and spanned the period from\n1914\nthrough\n1972\n, with\n77\ntitles listed in the paper.\nThe philosophy behind Stoilow's approach to mathematics was summed up by his own statement that his aim was:-\n... to deepen what is most essential and characteristic for the phenomenon of analyticity given to us, it may be said, by Nature within which we live.\nBefore he took up his first university appointment in\n1919\n, Stoilow concentrated on the theory of partial differential equations in the complex domain. After this he changed somewhat the direction of his work and began to undertake research on the theory of functions of a real variable and on topology. An example of one of his papers from this period is\nSur l'inversion des fonctions continues\nⓉ\n(\nOn the inversion of continuous functions\n)\n(1925)\n. From around\n1927\nhe began to work on the topological theory of analytic functions. Three theorems of Stoilow, published in\n1928\n,\n1932\nand\n1935\n, constitute his main contribution to the topological theory of analytic functions, a field of which he must be considered one of the founders. The fundamental paper he published on this topic was\nSur les transformations continues et la topologie des fonctions analytiques\nⓉ\n(\nOn the continuous transformations and topology of analytic functions\n)\n(1928)\nin which he solved a problem proposed by\nBrouwer\nto give a topological characterisation of analytic functions. His work was having a major international impact and he was invited to Paris where he gave a series of lectures on his work in February\n1931\n.\nIn\n1936\nStoilow addressed the International Congress of Mathematicians in Oslo. In his lecture he introduced covering surfaces of abstract\nRiemann\nsurfaces. His paper was deemed of great importance by\nAhlfors\nwho included a reference to it in his report on the highlights of the conference. His book\nLeçons sur les principes topologiques de la théorie des fonctions analytiques\nⓉ\n(\nLessons on topological principles of the theory of analytic functions\n)\n, published in the prestigious Collection Borel\n(\nParis,\n1937)\n, became a classical reference in the\n1940\ns. In this important work he introduced covering surfaces with the Iversen property and the concept of boundary element. The original edition of this work was republished in\n1956\n. Andreian Cazacu writes\n[\n4\n]\n:-\nThose who study this deeply original book, epoch-making for topology as well as for function theory, are struck by the exceptional variety and richness of the results and the mastery with which the author passes from the concrete intuition of geometrical facts to the most abstract generalisations.\nStoilow gave a series of six lectures on\nRiemann\nsurfaces at the Istituto di Alta Matematica in Rome in April,\n1957\n. These lecturers were published as\nSur quelques points de la théorie moderne des surfaces de Riemann\nⓉ\n(\nOn some points of the modern theory of Riemann surfaces\n)\n(1957)\nand provide an excellent account of Stoilow's contributions and how they fit around other progress in the same areas over the years.\nIn the two volumes of\nTheory of functions of a complex variable\n(\nRomanian\n)\n(1954\n,\n1958)\n, we see lecture courses which Stoilow gave at the University of Bucharest. After a fairly standard introduction to the general theory, beginning with power series, he goes on, in volume\n1\n, to look at topics such as entire and\nmeromorphic function\n, doubly periodic functions, conformal mapping on the boundary of a\nJordan\nregion, multiple-valued functions, and applications of modular functions to the\nPicard\ncircle of ideas. The second volume has the following chapter headings: The\nDirichlet\nproblem; Local properties of harmonic functions; The\nDirichlet\nproblem for multiply-connected domains; The\nDirichlet\nintegral and the minimum principle;\nGreen\n's function,\nLindelöf\n's principle, the principle of harmonic measure; Harmonic measure;\nRiemann\nsurfaces; Analytic functions on closed\nRiemann\nsurfaces; Analytic functions on open\nRiemann\nsurfaces; Regularly and normally exhaustible\nRiemann\nsurfaces.\nIn\n1936\nStoilow was elected a corresponding member of the\nRomanian Academy of Sciences\nand he became a full member in\n1945\n. He became president of the Physics and Mathematics section of the Academy as well as director of the Mathematical Institute of the Academy. He received many honours in State Prizes for his outstanding mathematical contributions and his tireless work in raising the level of scientific research in Romania."
}