{
  "nome_completo": "Simon Stevin",
  "nome_curto": "Simon Stevin",
  "ano_nascimento": "1548",
  "ano_morte": "1620",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Stevin/",
  "lugar_nascimento": "Bruges, Burgundian Netherlands (now Belgium)",
  "lugar_morte": "The Hague, Dutch Republic (now Netherlands)",
  "biografia": "Simon Stevin\n's father was Anthuenis\n(\nAnton\n)\nStevin who, it is believed, was a cadet son of a mayor of Veurne. His mother was Cathelijne\n(\nor Catelyne\n)\nvan der Poort who was the daughter of a burgher family of Ypres. Anthuenis and Cathelijne were not married but Simon's mother Cathelijne later married a man who was involved in selling carpets and in the silk trade. By marriage Cathelijne joined a family who were Calvinists. Nothing is known of Simon's early years or of his education although one assumes he was brought up in the Calvinist tradition.\nStevin became a bookkeeper and cashier with a firm in Antwerp. It is known that he spent some time between the years\n1571\nto\n1577\ntravelling in Poland, Prussia and Norway. Then in\n1577\nhe took a job as a clerk in the tax office at Brugge. After this he moved to Leiden in\n1581\nwhere he first attended the Latin school, then he entered the University of Leiden in\n1583\n(\nat the age of\n35)\n. Various theories have been put forward as to why he moved to Leiden. To understand these we need to look briefly at the history of the period.\nThe Union of Utrecht on\n23\nJanuary\n1579\nwas designed to form a block\n(\nknown as the States-General\n)\nwithin the larger union of the Low Countries which would resist Spanish rule. It produced a union in the north Netherlands, still officially under the rule of the King of Spain, but distinct from the south. The strong reaction against the Spanish followed the start of a reign of terror by the Spanish occupation in the south beginning around\n1567\n. The north was predominantly Calvinist and effectively ruled by William, Prince of Orange. In\n1581\nthe States-General declared independence from Spain and a complex situation followed as foreign help was enlisted.\nStevin's move to the north Netherlands certainly coincided with their move to independence from the King of Spain. There were other possible reasons for Stevin to move, however, for we have already mentioned that Stevin was brought up in a Calvinist family after his mother remarried. Certainly Stevin was not alone in fleeing from the south Netherlands around this time, with many going to the north, but others fleeing to England or Germany. While Stevin was at the University of Leiden he met Maurits\n(\nMaurice\n)\n, the Count Of Nassau, who was William of Orange's second son. The two became close friends and Stevin became mathematics tutor to the Prince as well as a close advisor. William of Orange was assassinated on\n10\nJuly\n1584\nat Delft by a Roman Catholic who believed that by assassinating William he would prevent the rebellion against Catholic Spain. William's eldest son Philip William was loyal to Spain so it was Maurits who was appointed stadholder of Holland and Zeeland, or the United Provinces of the Netherlands, in\n1584\n.\nWith Prince Maurits now head of the army of the republic, and with Stevin as an advisor in his service, a series of military triumphs over the Spanish forces followed. Maurits understood the importance of military strategy, tactics, and engineering in military success. In\n1600\nhe asked Stevin to set up an engineering school within the University of Leiden. It was a good political move to insist that the courses were taught there in the Dutch language. Certainly Prince Maurits saw his friend Stevin as having major importance in his success and the recent discovery of a journal in the Public Record Office of The Hague recording Stevin's salary as\n600\nDutch guilders in\n1604\nconfirms his high position.\nIt is believed that from\n1604\nStevin was quartermaster-general of the army of the States-General. He invented a way of flooding the lowlands in the path of an invading army by opening selected sluices in dikes. He was an outstanding engineer who advised on building windmills, locks and ports. He advised Prince Maurits on building fortifications for the war against Spain and wrote detailed descriptions of the military innovations adopted by the army. These innovations would be copied by many other countries.\nThe army of the States-General reclaimed from Spanish rule essentially the territory which is today The Netherlands, and the States-General became officially recognized by England and France as an independent state. Prince Maurits wished to continue the war against Spain but, when Spain effectively recognised the United Provinces as independent and sovereign, there was little enthusiasm to continue the fight. The Twelve Years' Truce began in\n1609\n.\nStevin bought a house at the Raamstraat in The Hague in\n1612\nfor\n3800\nDutch guilders\n(\nanother sign of his high status and wealth\n)\n. He married at a date given as\n1610\nby some sources and as\n1614\nby other sources. His wife was Catherine Krai, and they had four children named Frederic, Hendrik, Susanna and Levina. Hendrik, their second child, went on to attend the University of Leiden and, becoming a famous scientist in his own right, was the editor of his father's collected works.\nThe author of\n11\nbooks, Simon Stevin made significant contributions to trigonometry, mechanics, architecture, musical theory, geography, fortification, and navigation. His first book was\nTafelen van Interest\nⓉ\n(\nTables of interest\n)\nwhich he published in\n1582\n. Prior to this, unpublished manuscript interest tables were in common use with bankers throughout Europe but had been treated as secret information not to be divulged. Before presenting the numerical tables, Stevin gave rules for simple and compound interest and also gave many examples of their use.\nIn\nProblemata geometrica\nⓉ\n(\nGemetrical problems\n)\n(1583)\nStevin presented geometry based largely on\nEuclid\nand\nArchimedes\nbut the problems which he studied show that he was also influenced by\nDürer\n. Stevin gave an interesting account in this work of constructions related to polygons and polyhedra, using the concept of similarity, and a study of regular and semi-regular polyhedra. It was written in Latin, and is the only one of his books to be first published in that language. He became a strong advocate of writing his scientific works in Dutch and he gives clear reasons for this choice in a text written in\n1586\n.\nIn\n1585\nhe published\nLa Thiende\nⓉ\n(\nThe tenth\n)\n, a twenty-nine page booklet in which he presented an elementary and thorough account of decimal fractions. He wrote this small book for the benefit of:-\n... stargazers, surveyors, carpet-makers, wine-gaugers, mint-masters and all kind of merchants.\nAlthough he did not invent decimals\n(\nthey had been used by the Arabs and the Chinese long before Stevin's time\n)\nhe did introduce their use in mathematics in Europe. Stevin states that the universal introduction of decimal coinage, measures and weights would only be a matter of time\n(\nbut he probably would be amazed to know that in the\n21\nst\ncentury some countries still resist adopting decimal systems\n)\n. Robert Norton published an English translation of\nLa Thie\nnde\nⓉ\n(\nThe tenth\n)\nin London in\n1608\n. It was titled\nDisme, The Arts of Tenths or Decimal Arithmetike\nand it was this translation which inspired Thomas Jefferson to propose a decimal currency for the United States\n(\nnote that one tenth of a dollar is still called a dime\n)\n. Stevin's notation was to be taken up by\nClavius\nand\nNapier\nand it developed into that used today.\nIn the same year\n(1585)\nhe published\nLa pratique d'arithmétique\nⓉ\n(\nThe practice of arithmetic\n)\nand\nL'arithmétique\nⓉ\n(\nArithmetic\n)\nwhich were the only texts he wrote first in French. In the latter Stevin presented a unified treatment for solving quadratic equations and a method for finding approximate solutions to algebraic equations of all degrees. He also made a strong plea that all numbers such as square roots,\nirrational\nnumbers, surds, negative numbers etc should all be treated as numbers and not distinguished as being different in nature. Stevin's notion of a real number was accepted by essentially all later scientists. Particularly important was Stevin's acceptance of negative numbers but he did not accept the 'new' imaginary numbers and this was to hold back their development.\nInspired by\nArchimedes\n, Stevin wrote important works on mechanics. Mainly dealing with statics, his treatment appears in his book\nDe Beghinselen der Weeghconst\nⓉ\n(\nThe Principles of the Art of Weighing\n)\npublished in\n1586\n. It is famous for containing the theorem of the triangle of forces which gave impetus to statics. In the same year his treatise\nDe Beghinselen des Waterwichts\nⓉ\n(\nThe Principles of hydrostatics\n)\non hydrostatics contained notable improvements to the work of\nArchimedes\non this topic. Many consider that he founded the science of hydrostatics with this work by showing that the pressure exerted by a liquid upon a given surface depends on the height of the liquid and the area of the surface.\nAlso in\n1586\n(3\nyears before\nGalileo\n)\nhe reported that different weights fell a given distance in the same time. His experiments were conducted using two lead balls, one being ten times the weight of the other, which he dropped thirty feet from the church tower in Delft.\nIn\nDe Hemelloop\nⓉ\n(\nThe Sky Walk\n)\n, published in\n1608\n, he wrote on astronomy and strongly defended the sun centred system of\nCopernicus\n. Although he undertook his mathematical work earlier in his life, Stevin collected together some of his mathematical writings which he edited and published during the years\n1605\nto\n1608\nin\nWiskonstighe Ghedachtenissen\nⓉ\n(\nMathematical Memoirs\n)\n(\nMathematical Memoirs\n)\n. The collection included\nDe Driehouckhandel\nⓉ\n(\nTrigonometry\n)\n,\nDe Meetdaet\nⓉ\n(\nPractice of measuring\n)\n, and\nDe Deursichtighe\nⓉ\n(\nPerspective\n)\n. The work on perspective looks at a number of innovations such as the case of calculating the perspective for making a drawing on a canvas which is not perpendicular to the ground, and the case of inverse perspective. This calculates where the eye of the observer should be placed if an object and a perspective drawing of that object are given. Stevin, in his book\nStelreghel\nⓉ\n(\nAlgebra\n)\nused the notation +, - and √.\nHis other works included\nVita Politica. Het Burgherlick leven\nⓉ\n(\nCivil life\n)\npublished in\n1590\n,\nDe Sterktenbouwing\nⓉ\n(\nThe construction of fortifications\n)\npublished in\n1594\n,\nDe Havenvinding\nⓉ\n(\nPosition finding\n)\npublished in\n1599\n, and the double work\nCastrametatio, dat is legermeting\nⓉ\n(\nMilitary measurement\n)\nand\nNieuwe Maniere van Stercktebou door Spilsluysen\nⓉ\n(\nNew ways of building sluices\n)\npublished in\n1617\n.\nIn\nHet Burgherlick leven\nⓉ\n(\nThe life of a citizen\n)\nStevin discusses how a citizen of a state should comply with the rules of the authorities\n(\neven when they appear unjust\n)\nand, in particular, he advises citizens how to behave in times of civil unrest. In\nDe Sterktenbouwing\nⓉ\n(\nThe Strength Bouwing\n)\nStevin takes an Italian method of fortification and modifies it for Dutch use. The ideas that he put forward in this treatise were clever but too expensive to implement. The work\nDe Havenvinding\nⓉ\n(\nFinding harbours\n)\nliterally means 'finding the harbour' and presents a method of finding the position of a ship by determining its longitude using the magnetic variation of the compass needle. Although theoretically sound, the method is impractical. In the first of the final double work that we mentioned above, Stevin describes the establishment, layout and setting up of a military camp. Particularly fascinating is his description of Prince Maurits camp which he set up prior to the Battle of Juliers in\n1610\n. The second of the two works deals with sluices Stevin had designed to put into fortifications to keep a moat at the correct depth.\nHis contributions to music are contained in\nDe Spiegheling der Singconst\nⓉ\n(\nTheory of the art of singing\n)\nwhich survived in manuscript until\n1884\nwhen it was published. This is usually seen as the first correct theory of the division of the octave into twelve equal intervals, see for example\n[\n1\n]\n. Cohen in\n[\n13\n]\nexplains the importance of the problem to scientists of the period:-\nMany pioneers of the Scientific Revolution, such as\nGalileo\n,\nKepler\n, Stevin,\nDescartes\n,\nMersenne\n, and others, wrote extensively about music theory. This was not a chance interest of a few individual scientists. Rather, it reflects a continuing concern of scientists from Pythagorean times onwards to solve certain quantifiable problems in music theory. One of the issues involved was technically known as 'the division of the octave', the problem, that is, with which notes to make music.\nCohen argues that this was not, as is commonly believed\n(\nsee\n[\n1\n]\n)\n, the purpose of Stevin's treatise:-\nA careful analysis of the problem situation in the science of music around\n1600\n, reveals that Stevin's treatise highlights a particular stage in the history of what has always been the core issue of the science of music, namely, the problem of consonance. This is the search for an explanation, on scientific principles, of Pythagoras's law: Why is it that those few musical intervals which affect our ear in a sweet and pleasing manner, correspond to the ratios of the first few integers?."
}