{
  "nome_completo": "Sof'ja Aleksandrovna Janovskaja",
  "nome_curto": "Sof'ja Aleksandrovna Janovskaja",
  "ano_nascimento": "1896",
  "ano_morte": "1966",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Janovskaja/",
  "lugar_nascimento": "Pruzhany, Russian Empire (now Belarus)",
  "lugar_morte": "Moscow, USSR",
  "biografia": "Let us first note that\nSof'ja Aleksandrovna Janovskaja\n's name appears in several different forms. Both Sof'ya and Sof'ja are common forms of her first name while Yanovskaya and Janovskaja are both common forms of her married name. Her maiden name was Neimark.\nSof'ja Aleksandrovna Neimark's father was Alexander Neimark who was an accountant. She was born into a Jewish family living in Pruzhany, a village near Kobrin, which at that time was in the Russian Empire, but is now in Belarus. The census of\n1897\n, taken shortly after her birth, shows Pruzhany with a population of\n7\n,\n634\n, of whom about\n60\nper cent were Jewish. However, Sof'ja was not brought up in Pruzhany since, when she was still young, her family moved to Odessa, a major Black Sea port. In\n1905\nOdessa was the site of a workers' uprising, and the murder of hundreds of citizens must have had a large influence on the nine year old Sof'ja. She was educated in classics and mathematics at the\nGymnasium\nin Odessa where she was fortunate enough to be taught by Ivan Jure'vich Timchenko, a major figure in the study of the history of mathematics especially that of the theory of analytic functions.\nSof'ja Neimark entered the Higher School for Women in Odessa in\n1915\n; this was part of the Novorossiisk University of Odessa. There she studied mathematics under Timchenko, who we mentioned above, and also\nSamuil Osipovich Shatunovsky\nwho was interested in a wide variety of mathematical topics including group theory, the theory of numbers, and geometry. He used the axiomatic method to lay the logical foundations of geometry, algebraic fields,\nGalois theory\nand analysis and his areas of interest had a large influence on his student Neimark.\nWhen the Russian Revolution arrived in\n1917\n, Neimark became politically active. She had already joined the underground Red Cross, which assisted political prisoners, while she was studying at the Gymnasium. She joined the Bolshevik wing of the Russian Communist Party in November\n1918\neven though at this time it was an illegal organisation in Odessa. In\n1919\nshe served the Red Army as a political commissar and became an editor for the\nKommunist\nnewspaper in Odessa. From\n1920\nto\n1923\nshe worked for the Odessa Regional Party and throughout this period she had essentially given up her academic studies - in particular mathematics had been pushed into the background. However the Bolsheviks understood that the country needed economists, scientists, technicians, managers, lawyers, university professors, school teachers, and writers, yet most of their supporters were uneducated. Realising this need, in\n1923\nJanovskaja felt it her duty to return to her studies, and she began attending seminars at Moscow State University. In the following year she entered the Institute of Red Professors, which had been established to educate people from the lower classes. The Institute of Red Professors had been set up in\n1921\nand has been described as:-\n... a milieu combining aspects of a university, a political salon, and a monastery.\nBy\n1925\nJanovskaja was leading a seminar on mathematical methodology at Moscow State University, becoming a member of the faculty in the following year. By\n1931\nshe was a professor there, and, four years later, she received her doctorate.\nAlthough her political views are obvious from the above description of events in Janovskaja's life, we should now indicate how these related to mathematics. To understand how she felt at the time we quote from her writings in\nThe Immediate Tasks of the Mathematicians-Marxists\nwhich appeared in\nUnder the Banner of Marxism\n(1930)\n(\nsee\n[\n8\n]\n)\n:-\nIf there is a low percentage of natural scientists sharing Marxist views, then among mathematicians this percentage is even lower... the Old Professorship from the so called \"Moscow school\", whose authority among the mathematical milieu was unshakable, made every effort to save mathematics from the malicious influence of materialistic philosophy, which did not hide its Party orientation and its class, proletarian character. Even the word \"Comrade\" was neither accepted at the Institute of mathematics and mechanics, nor at the Mathematical Society... in contrast, among the members of this Society, the percentage of white émigrés is rather high.\nHowever, Janovskaja could report:-\n... the revolution at last reached the Institute of mathematics and mechanics. The management of the Institute radically changed.\nHowever:-\nThe current purge of the Leningrad Mathematical Society, where the idea of establishing a popular mathematical society was met with an organized rebuff by almost all mathematicians, demonstrates the complexity of the task at hand and shows that the goal of stratifying mathematicians and defining the truly Soviet components is a difficult and urgent problem. A problem that demands maximal vigilance ...\nAn interesting episode took place in\n1935\nand is described in\n[\n9\n]\n.\nLudwig Wittgenstein\nvisited Janovskaja and told her that he was intending to relocate to the USSR. However, he was persuaded to give up the idea by Janovskaja.\nThe war between Germany and the Soviet Union began on\n22\nJune\n1941\n, when German forces invaded the Soviet-occupied portion of Poland. The German forces delayed their advance on Moscow\n(\nat Hitler's command\n)\nbut by October they were advancing again and by December Moscow was besieged. Janovskaja was evacuated, along with other Moscow University faculty and students, to Perm\n(\nwhich had been renamed Molotov in\n1940)\nand there she taught courses in the Department of General Algebra. She returned to Moscow in\n1943\nand was appointed Director of the Mathematical Logic Seminar at Moscow State University.\nJanovskaja worked on the philosophy of mathematics and logic. She argued against the writings of\nFrege\non philosophy. Her work in mathematical logic became very important in the development of the subject in Soviet Union. Annellis writes in\n[\n3\n]\n:-\nIn her writings on philosophy of mathematics and philosophy of logic, she took the offensive against the idealist philosophy of the bourgeois West, represented in her mind by\nGottlob Frege\n, and against the so-called Machism, that is, conventionalism, represented by Rudolf Carnap and his Principle of Tolerance, according to which in logic one is free to choose one's rules.\nIn\n1931\nJanovskaja wrote:-\nThe modern crisis of capitalism robs mathematics of materialistic tools and methods\n(\nintuitionism\n)\n, widens the gap between theory and practice, and aggravates its spontaneous and unplanned character.\nThe history of mathematics was another topic which attracted Janovskaja and she published work on Egyptian mathematics\nOn the theory of Egyptian fractions\n(1947)\n,\nZeno of Elea\n's paradoxes,\nRolle\n's criticisms of the calculus in\nMichel Rolle as a critic of the infinitesimal analysis\n(1947)\n,\nDescartes\n' geometry\n(\nsee below\n)\n, and\nLobachevsky\n's work on\nnon-euclidean geometry\nin papers such as\nThe leading ideas of N I Lobachevsky - a combat weapon against idealism in mathematics\n(1950)\n,\nOn the philosophy of N I Lobachevsky\n(1950)\n, and\nOn the Weltanschauung of N I Lobachevsky\n(1951)\n. Janovskaja published two major studies of the history of mathematical logic in the USSR between\n1917\nand\n1957\n. The first part appeared in\n1948\nwith the second part being published in\n1959\n.\nAn important aspect of Janovskaja's work was in translating into Russian and editing works of high international repute in mathematical logic. For example in\n1947\nshe translated into Russian and published\nHilbert\nand\nAckermann\n's\nGrundzüge der theoretischen Logik\nⓉ\n(\nOutlines of theoretical logic\n)\n, and, in\n1948\n,\nTarski\n's\nIntroduction to logic and to the methodology of deductive sciences\n. Later she produced Russian versions of\nPolya\n's\nMathematics and plausible reasoning\n, Carnap's\nMeaning and Necessity\n, and\nTuring\n's highly significant paper\nCan machines think?\n. She also organised translations of works by\nGoodstein\n,\nChurch\n, and\nKleene\n. For all these works she wrote important interpretative introductions.\nBazhanov writes in\n[\n8\n]\n:-\nShe zealously reinforced mathematical logic as a self-sufficient and respectable science having nothing to do with either idealism or fideism in mathematics or philosophy of mathematics.\nFinally let us look at a couple of examples of Janovskaja's work.\nOn the history of the axiomatic method\nwas published in\n1958\n. The first half of the article is largely a discussion of the axioms in\nEuclid\n's\nElements\nand the works of\nAristotle\n, particularly his\nPosterior analytics\n. There then follows general comments concerning the theory of algorithms, and the mathematical concepts of proof, construction and solution. In\n1966\nshe published\nOn the role of mathematical rigour in the creative development of mathematics and especially on Descartes' 'Geometry'\n. Despite its title, this paper is written from a mathematical rather than an historical point of view. One example of the need for mathematical rigour, Janovskaja claims, is the fact that the three classical Greek problems were not solved until they had been framed more rigorously. L Guggenbuhl writes in a review:-\nThe article contains an extended general discussion of the mathematical method, and of such concepts of mathematical logic as the theory of plurality, the theory of algorithms, the law of full mathematical induction, recursive functions and\nTuring\nmachines. The author also discusses work of\nChurch\n,\nGödel\n, and\nKleene\n.\nConstruction tools of Euclidean geometry are described as the ruler and the compass. The author then traces the widening of the reserves of the means of construction to include the methods of cartesian geometry. An analysis is given for the problem of finding geometric solutions for algebraic equations of degree higher than two by locating points of intersection of conic sections with other curves. The article contains an appraisal of the work of\nDescartes\nin the light of contemporary standards of logic and rigour.\nAmong the honours which were given to Janovskaja was the Order of Lenin in\n1951\n. In\n1959\nshe became the first Head of the new Department of Mathematical Logic at Moscow State University. Writing of her final years in this role, Bazhanov writes in\n[\n8\n]\n:-\nShe did much to establish this position and eventually her efforts succeeded due to her high authority\n(\nboth as an Party veteran and a logician\n)\n. Despite the tragic life and fate of her mentally ill son, Janovskaja paid much attention to her numerous pupils and fostered logical investigations in the USSR -- apparently absolutely forgetting what she had intensively written and proclaimed only\n15\nyears before. Most of the Soviet logicians who started their careers in the\n1950\n's were indebted to her for support, education, and the opportunity to access knowledge about the achievements of Western colleagues concealed behind the dense iron curtain."
}