{
  "nome_completo": "Sotero Prieto Rodríguez",
  "nome_curto": "Sotero Prieto",
  "ano_nascimento": "1884",
  "ano_morte": "1935",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Prieto/",
  "lugar_nascimento": "Guadalajara, Jalisco, Mexico",
  "lugar_morte": "Mexico City, Mexico",
  "biografia": "Sotero Prieto\nwas the son of Raúl Prieto González Bango\n(1856\n-\n1917)\n, a professor of mathematics, and Teresa Rodríguez de Prieto\n(1860\n-\n1955)\n. The Prieto family line came originally from Spain, arriving in central America by the beginning of the\n19\nth century. Raúl Prieto qualified as a surveyor and hydrographer in the Instituto de Ciencias del Estado in\n1879\nand he became Professor of Analytical Geometry and Higher Algebra in the School of Engineers. His interests, however, moved towards chemistry and mining later in his career. He married Teresa in Guadalajara on\n23\nOctober\n1883\nand Sotero Prieto Rodríguez was the oldest of their six children. Sotero had three younger brothers, José Carlos Raúl Prieto Rodríguez\n(1886\n-\n1915)\n, Raúl Prieto Rodríguez\n(1887\n-\n1962)\nand Julio Prieto Rodríguez\n(1890\n-\n1962)\n. His two sisters were the youngest of the six children, María Isabel Prieto Rodríguez\n(1892\n-\n1962)\nand María Teresa Prieto Rodríguez\n(1894\n-\n1986)\n. It is worth noting that Sotero was the nephew of Isabel Ángela Prieto González Bango\n(\nalso known as Isabel Prieto de Landázuri\n)\n(1833\n-\n1876)\n, a famous poet and dramatist.\nSotero Prieto began his elementary school studies in his home town of Guadalajara, going later to Real del Monte, Hidalgo, where his father was in charge of a mine. He moved to Mexico City in\n1897\nwhere he began his high school studies at the Colon Institute of Toribio Soto. He completed his high school studies at the National Preparatory School, graduating in\n1901\n. In\n1902\nhe entered the National School of Engineers, in the old Mining Palace, where he studied civil engineering. He was there until\n1906\nwhen he left without being awarded a civil engineering degree, since what interested him was not engineering, but mathematics. He studied higher mathematics while earning enough to support himself by teaching mathematics. In\n1912\nPrieto wrote the paper\nSobre una propiedad de las epicicloides\nⓉ\n(\nOn a property of epicycloids\n)\n, published by the Scientific Society \"Antonio Alzate\", which studied rolling curves on epicycloids.\nBy\n1912\nhe had been appointed to teach the first course on higher mathematics,\nTheory of analytic functions\n, at the School of Higher Studies. This School had been created in\n1910\nwithin the framework of the opening of the National University of Mexico. It was set up to provide a platform for scientific research and for the training of secondary and higher education teachers. Because of the clarity of his teaching, the courses given by Prieto at the National Preparatory School and the National School of Engineers, which later became part of the new National University of Mexico, had a great influence on the development and teaching of mathematics in Mexico. Joaquín Gallo joined the National School of Engineers in\n1912\nand Prieto joined in the following year. He worked closely with Gallo, with the engineer Manuel Torres Torrija and the engineer Juan Mateos. In\n1916\nMateos left and was replaced by Basiliso Romo. Prieto's contributions played a large role in producing a new generation of engineers in Mexico.\nA political crisis in Mexico beginning in\n1910\nescalated over the next few years with forced resignations and assassinations until a civil war broke out in\n1914\n. During the years of the Revolution, Prieto was head of the cartography section of the Astronomical Observatory at Tacubaya in the west part of Mexico City. This Observatory had been founded in Chapultepec Castle in Mexico City in\n1878\nand moved to the site in Tacubaya in\n1909\n. Prieto collaborated with his friend and colleague Joaquín Gallo\n(\nborn\n24\nNovember\n1882)\n, who, as well as working at the National School of Engineers, worked at the Observatory at Tacubaya from\n1903\nwhen he became an assistant there, rising through the ranks until be became director of the observatory in\n1916\n.\nOn\n11\nFebruary\n1918\nPrieto married Isabel Río de la Loza Salazar\n(\nc\n1897\n-\n1981)\n, the daughter of Juan Río de la Loza Valderrama and María de la Concepción Salazar, in Sagrario, Mexico City. Their son Raúl Prieto Río de la Loza was born on\n21\nNovember\n1918\n. He became a journalist and author, better known under the pseudonym \"Nikito Nipongo,\" with a fine sense of humour who laughed at intellectuals and pointed out their mistakes, and continually quarrelled with editors. He died on\n20\nSeptember\n2003\n. He often quoted from his father, the subject of this biography, with sayings such as \"There should be more street-sweepers and fewer politicians\", and \"Informing the people generally means cheating.\" A second son of Sotero Prieto and his wife Isabel was Juan Prieto Rio de la Loza\n(\nborn\n1920)\nwho became a chemical engineer. A third son was Agustín Prieto Río de la Loza\n(12\nMarch\n1923\n-\n4\nJuly\n2003)\nwho studied astronomy and specialised in astrophysics. A fourth son Sotero became an engineer.\nIn\n1922\nPrieto attended the first meeting of the International Astronomical Union in Rome as a representative of Mexico along with his colleague Joaquín Gallo. They both participated in the relativity section. In fact Prieto published articles on relativity,\nLa teoría de la relatividad I\nⓉ\n(\nThe Theory of Relativity I\n)\nand\nLa teoría de la relatividad II\nⓉ\n(\nThe Theory of Relativity II\n)\nin\n1921\nand\n1923\nrespectively. Both articles appeared in\nRevista El Maestro\nⓉ\n(\nEl Maestro Magazine\n)\nwhich at that time was a very new journal which had been announced in March\n1921\n. The announcement certainly made ambitious claims for the new journal:-\n... whose function would be to complete the work of the university and school establishments, expand the horizons of workers and peasants, stimulate the study of professionals and schoolchildren, and animate with practical suggestions industrialists and exploiters of the land.\nWe mentioned above that Prieto published a paper in the Scientific Society \"Antonio Alzate\" in\n1912\n. At that time there was no Mathematics Section in the Society but such a Section was founded by Prieto around\n1932\n. This Society began publishing\nMemorias de la Sociedad Científica \"Antonio Alzate\"\nⓉ\n(\nMemoirs of the Scientific Society 'Antonio Alzate'\n)\nin\n1887\nand from\n1890\nto\n1931\npublished\nMemorias y revista de la Sociedad Científica \"Antonio Alzate.\"\nⓉ\n(\nMemoirs and journal of the Scientific Society 'Antonio Alzate.'\n)\nFrom\n1932\nonwards, there was a mathematics section founded by Prieto. It was this group that led to the founding of the\nMexican Mathematical Society\n. They met, during Prieto's lifetime, every Friday at\n7\no'clock in the evening to listen to lectures on higher mathematics.\nAround\n1932\n, Prieto taught a course on the history of mathematics. He used two famous texts for this. One of them was the\nHistoire des Mathématiques\nⓉ\n(\nHistory of Mathematics\n)\nby\nJean-Étienne Montucla\n, published in the eighteenth century, the other was the famous\nHistory of Mathematical Notations\n, by\nFlorian Cajori\nwhich was published in\n1928\n-\n29\n, only a couple of years earlier. Prieto owned an edition of\nMontucla\n's book published in the seventh year of the French Revolution, which was around\n1798\n, which he had inherited from his grandfather, Sotero Prieto Olasagarre and had probably belonged to Prieto's great-grandfather, José Vicente Prieto Ramos. This work, in two volumes, is still in the hands of the Prieto family. Amazingly this book by\nJean-Étienne Montucla\nis still in print with a paperback version being published in\n2011\n.\nCajori\n's book became part of the Sotero Prieto Collection, housed in the library that bears his name in the Mathematics Institute. Unfortunately, this work, full of annotations in the margins by Prieto himself, was stolen from the library and has never been recovered. The handwritten notes that Prieto produced for his course were published in facsimile form in\n1991\nby the Mexican Institute of Culture with the title\nHistoria de las Matemáticas\nⓉ\n(\nHistory of Mathematics\n)\n.\nCarlos Prieto de Castro writes in\n[\n2\n]\n:-\nAccording to testimonies of those who were his students, both in the National Preparatory School and in the National School of Engineers, Sotero Prieto Rodríguez left a mark on the methods of teaching of the exact sciences. With him began a new era in the teaching of mathematics, in which his followers sought greater clarity in their teaching, following the style of Sotero. Sotero Prieto always advocated the professionalization of the practice of mathematics. He realized that Mexico required a lot more than a few mathematics enthusiasts who studied the subject in books and then taught it. That is why he encouraged Alfonso Nápoles Gándara to go to the Massachusetts Institute of Technology to do postgraduate studies. In\n1930\n, Nápoles obtained the Guggenheim scholarship for a two-year stay, during which, in addition to undertaking research, he strenuously devoted himself to learn as much as possible, particularly on differential geometry, so that he could return to Mexico to teach it.\nWe note that Alfonso Nápoles Gándara was born on\n14\nOctober\n1897\n, in Morelos, Mexico. He was educated at the\nNational Preparatory School\n(1911\n-\n15)\n, and the College of Engineering, National University of Mexico\n(1916\n-\n20)\nwhere he was taught by Prieto. He was a Professor of Mathematics in secondary schools in Mexico City\n(1920\n-\n29)\n, then appointed Professor of Mathematics at the College of Engineering, National University of Mexico. He studied differential geometry and harmonic analysis at the Massachusetts Institute of Technology for eighteen months beginning on\n1\nSeptember\n1930\n.\nCarlos Prieto de Castro writes in\n[\n2\n]\n:-\nThose of us who had the fortune to be students of Alfonso Nápoles, appreciate the clarity, order and elegance with which he taught us, following in some way the model of Sotero Prieto.\nIn\n[\n3\n]\nPrieto is described as a:-\n... professor with an energetic temperament, of large body stature, affable yet sometimes with sharp expression, having a soft voice that signified a deep dignity; with a long and stern face, adorned with a rebellious moustache and a little tousled, of modest dress that was not very sober, with a deep, lively and warm look, half hidden behind glasses with thin frames and thick lenses which showed he had already developed myopia.\nHis death at the age of fifty was tragic. It is described in\n[\n3\n]\nas follows:-\nAccording to some of his closest friends, it was said that Sotero Prieto had declared that if he had not yet managed to make any great discoveries in his specialty when he was over fifty years of age, he would then commit suicide, something that no one would take seriously. However, at noon on Wednesday,\n22\nMay\n1935\n, at house number\n2\non Genoa Street, when he was alone, he tragically fulfilled the promise that had been made.\nWe note that his relatives disputed the reasons for his suicide, believing that it was not related to the statements he had made to friends.\nThe work that was being carried out by Prieto was carried forward by several of his colleagues, particularly by Alfonso Nápoles whom we mentioned above. He was part of Sotero Prieto's group of enthusiasts for higher mathematics and, after Sotero Prieto's death in\n1935\n, he was the main figure to keep alive the idea of forming a group of mathematicians to promote the subject. This led to the founding of the\nMexican Mathematical Society\n(\nSociedad Matemática Mexicana\n)\nseven years after Prieto's death.\nThe importance of Prieto in the development of mathematics in Mexico has been recognised in a number of ways. The street M Sotero Prieto, off Circuito Cientificos, in Ciudad Satélite is named for him as is the street Sotero Prieto in Guadalupe Insurgentes, Mexico City. Also named for him in Mexico City are the public library Biblioteca Sotero Prieto, the Sotero Prieto Auditorium and the Sotero Prieto School. Other places which are named for him are the library in the Mathematics Institute and a classroom in the Mining Palace."
}