{
  "nome_completo": "Spiru Haret",
  "nome_curto": "Spiru Haret",
  "ano_nascimento": "1851",
  "ano_morte": "1912",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Haret/",
  "lugar_nascimento": "Iasi, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Spiru Haret\nwas one of the first generation of Romanian mathematicians. The country sought independence from the Ottoman Empire and Russia, and the first major steps occurred at around the time Haret was born. Russian domination was removed after they were defeated by the western allies in the Crimean War and, although it would be some considerable time before formal independence came about, Romania was essentially set on the path of independence. A western style constitution was put in place in\n1866\n.\nAlready while he was a high school student, Spiru Haret published two mathematics texts, one on algebra and one on trigonometry. He entered the University of Bucharest in\n1869\n, taking courses on mathematics and physics. After one year of study he left the university to take up a teaching post at the Nifon Seminary in Bucharest but, after teaching for one year, he returned to the University of Bucharest to complete his degree. He graduated in\n1874\nwith a mathematics and physics degree. At this time Romania had no leading mathematical experts so anyone wishing to take the subject further had to train abroad. The young country badly needed the train leading scientists, however, and Titu Maiorescu, the leading Romanian literary critic of the second half of the\n19\nth\ncentury, organised a scholarship competition to provide funds for outstanding young scholars to study abroad. Haret won the competition which provided funds for him to study in Paris.\nHaret studied mathematics and physics at the Sorbonne. He was awarded a mathematics diploma in\n1875\nand a physics diploma in the following year. After this he undertook research and defended his thesis\nSur l'invariabilite des grandes axes des orbites planetaires\nⓉ\n(\nOn the invariance of the major axes of planetary orbits\n)\non\n18\nJanuary\n1878\n. The authors of\n[\n5\n]\nwrite:-\nOne of the most outstanding performances of\nHenri Poincaré\nin the realm of mathematics is subtly and closely related to Spiru Haret. Both got resounding results in maybe the most celebrated problem of dynamics: the\nn\nn\nn\n-body problem, initially aimed at modelling the planetary motions in our Solar System. Even if not decisive, Haret's results helped and determined\nPoincaré\nto search for, to find, and to offer new fundamental methods, primarily intended to tackle this problem, but revolutionary and useful for most domains of science. Haret's and\nPoincaré\n's achievements marked, respectively, the end of a old era and the beginning of a new era in celestial mechanics and, in general, in mathematics.\nWhich is the link between Haret's and\nPoincaré\n's achievements from the narrow standpoint of the concrete problem they studied? Haret proved instability of the model of the\nn\nn\nn\n-body problem, but considering frequencies\n(\nmean motions\n)\nto be incommensurable. Taking also into account commensurabilities, and using generalized\nFourier\nseries\n(\nwhich generate quasiperiodic solutions\n)\n,\nPoincaré\nproved the divergence of these series, which means instability, confirming in this way Haret's result. Haret's and\nPoincaré\n's results show that the question of the Solar system's stability remains still unsolved. Haret's work marked the beginning of the end of an era, that of exclusively quantitative endeavours in mathematics.\nArpad Pal writes in\n[\n4\n]\nabout the results of Haret's doctoral thesis. Here is part of the abstract of that paper:-\nThe present paper, dedicated to the\n140\nth\nanniversary of the birthday of the Romanian mathematician, mechanicist, and astronomer Spiru Haret\n(1851\n-\n1912)\n, is an attempt to state as a theorem his famous result concerning the well-known problem on the invariability of the major axes of planetary orbits, related to the stability of the solar-planetary system. \"Spiru Haret's theorem\" is to be naturally added to the logical succession of theorems with respect to this problem known as \"\nLaplace\n-\nLagrange\ntheorem\" and \"\nPoisson\n's theorem\". Using his own method to explain mathematically the phenomenon of secular acceleration of Moon's \"mean motion\", Spiru Haret gives a criterion for separating the higher order gravitational perturbations from every non-gravitational perturbation in the motion of natural or artificial celestial bodies ...\nAfter defending his thesis in\n1878\n, Haret returned to Romania. He was appointed Professor of Rational Mechanics at the Science Faculty of the University of Bucharest later in the same year. Although Haret continued to have a major impact on teaching at the university, he gave up research on mathematics and instead became involved in politics. He was Minister of Public Education on three different occasions,\n1897\n-\n99\n,\n1901\n-\n04\nand\n1907\n-\n10\n. His contribution to education in Romania was extraordinary and during these periods of office he built a modern educational system. These were effective reforms, for, between\n1897\nand\n1910\n, the literacy rate in Romania increased from\n22\n% to\n39\n%.\nDespite his political involvement, Haret retained his professorship at the University of Bucharest and, in addition, he also retained his professorship of analytical geometry at the Bridges and Roads' School in Bucharest to which he had been appointed in\n1882\n. He retired from his professorships in\n1910\n, the year he left office as Minister of Public Education, and in the following year he published his only other major scientific work. This was the book\nMécanique social\nⓉ\n(\nSocial engineering\n)\nwhich is described by Malita in\n[\n2\n]\n. The book:-\n... was a pioneering effort in the mathematization of the social sciences, one of the first in which mathematical modelling was applied to the study of social problems. The book was ahead of its time and only now is its full significance being realized. Haret attempted to set up a system of mechanics that would describe the forces that govern social and economic phenomena.\nWe mentioned that this was his only other major work so we should, for completeness, note that he did produce two other papers. The first, published in\n1880\n, studied the secular acceleration of the Moon and the second, published in\n1912\n, was on Jupiter's Great Red Spot."
}