{
  "nome_completo": "Srinivasa Aiyangar Ramanujan",
  "nome_curto": "Srinivasa Ramanujan",
  "ano_nascimento": "1887",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ramanujan/",
  "lugar_nascimento": "Erode, Tamil Nadu state, India",
  "lugar_morte": "Kumbakonam, Tamil Nadu state, India",
  "biografia": "Srinivasa Ramanujan\nwas one of India's greatest mathematical geniuses. He made substantial contributions to the analytical theory of numbers and worked on\nelliptic functions\n,\ncontinued fractions\n, and infinite series.\nRamanujan was born in his grandmother's house in Erode, a small village about\n400\nkm southwest of Madras\n(\nnow Chennai\n)\n. When Ramanujan was a year old his mother took him to the town of Kumbakonam, about\n160\nkm nearer Madras. His father worked in Kumbakonam as a clerk in a cloth merchant's shop. In December\n1889\nhe contracted smallpox.\nWhen he was nearly five years old, Ramanujan entered the primary school in Kumbakonam although he would attend several different primary schools before entering the Town High School in Kumbakonam in January\n1898\n. At the Town High School, Ramanujan was to do well in all his school subjects and showed himself an able all round scholar. In\n1900\nhe began to work on his own on mathematics summing geometric and arithmetic series.\nRamanujan was shown how to solve\ncubic equations\nin\n1902\nand he went on to find his own method to solve the\nquartic\n. The following year, not knowing that the\nquintic\ncould not be solved by\nradicals\n, he tried\n(\nand of course failed\n)\nto solve the quintic.\nIt was in the Town High School that Ramanujan came across a mathematics book by G S Carr called\nSynopsis of elementary results in pure mathematics\n. This book, with its very concise style, allowed Ramanujan to teach himself mathematics, but the style of the book was to have a rather unfortunate effect on the way Ramanujan was later to write down mathematics since it provided the only model that he had of written mathematical arguments. The book contained theorems, formulae and short proofs. It also contained an index to papers on pure mathematics which had been published in the European Journals of Learned Societies during the first half of the\n19\nth\ncentury. The book, published in\n1886\n, was of course well out of date by the time Ramanujan used it.\nBy\n1904\nRamanujan had begun to undertake deep research. He investigated the series\n∑\n(\n1\nn\n)\n\\sum (\\Large\\frac{1}{n}\\normalsize )\n∑\n(\nn\n1\n​\n)\nand calculated\nEuler\n's constant to\n15\ndecimal places. He began to study the\nBernoulli numbers\n, although this was entirely his own independent discovery.\nRamanujan, on the strength of his good school work, was given a scholarship to the Government College in Kumbakonam which he entered in\n1904\n. However the following year his scholarship was not renewed because Ramanujan devoted more and more of his time to mathematics and neglected his other subjects. Without money he was soon in difficulties and, without telling his parents, he ran away to the town of Vizagapatnam about\n650\nkm north of Madras. He continued his mathematical work, however, and at this time he worked on\nhypergeometric series\nand investigated relations between integrals and series. He was to discover later that he had been studying elliptic functions.\nIn\n1906\nRamanujan went to Madras where he entered Pachaiyappa's College. His aim was to pass the First Arts examination which would allow him to be admitted to the University of Madras. He attended lectures at Pachaiyappa's College but became ill after three months study. He took the First Arts examination after having left the course. He passed in mathematics but failed all his other subjects and therefore failed the examination. This meant that he could not enter the University of Madras. In the following years he worked on mathematics developing his own ideas without any help and without any real idea of the then current research topics other than that provided by Carr's book.\nContinuing his mathematical work Ramanujan studied continued fractions and divergent series in\n1908\n. At this stage he became seriously ill again and underwent an operation in April\n1909\nafter which he took him some considerable time to recover. He married on\n14\nJuly\n1909\nwhen his mother arranged for him to marry a ten year old girl S Janaki Ammal. Ramanujan did not live with his wife, however, until she was twelve years old.\nRamanujan continued to develop his mathematical ideas and began to pose problems and solve problems in the\nJournal of the Indian Mathematical Society\n. He devoloped relations between elliptic modular equations in\n1910\n. After publication of a brilliant research paper on Bernoulli numbers in\n1911\nin the\nJournal of the Indian Mathematical Society\nhe gained recognition for his work. Despite his lack of a university education, he was becoming well known in the Madras area as a mathematical genius.\nIn\n1911\nRamanujan approached the founder of the\nIndian Mathematical Society\nfor advice on a job. After this he was appointed to his first job, a temporary post in the Accountant General's Office in Madras. It was then suggested that he approach Ramachandra Rao who was a Collector at Nellore. Ramachandra Rao was a founder member of the\nIndian Mathematical Society\nwho had helped start the mathematics library. He writes in\n[\n30\n]\n:-\nA short uncouth figure, stout, unshaven, not over clean, with one conspicuous feature-shining eyes- walked in with a frayed notebook under his arm. He was miserably poor. ... He opened his book and began to explain some of his discoveries. I saw quite at once that there was something out of the way; but my knowledge did not permit me to judge whether he talked sense or nonsense. ... I asked him what he wanted. He said he wanted a pittance to live on so that he might pursue his researches.\nRamachandra Rao told him to return to Madras and he tried, unsuccessfully, to arrange a scholarship for Ramanujan. In\n1912\nRamanujan applied for the post of clerk in the accounts section of the Madras Port Trust. In his letter of application he wrote\n[\n3\n]\n:-\nI have passed the Matriculation Examination and studied up to the First Arts but was prevented from pursuing my studies further owing to several untoward circumstances. I have, however, been devoting all my time to Mathematics and developing the subject.\nDespite the fact that he had no university education, Ramanujan was clearly well known to the university mathematicians in Madras for, with his letter of application, Ramanujan included a reference from E W Middlemast who was the Professor of Mathematics at The Presidency College in Madras. Middlemast, a graduate of St John's College, Cambridge, wrote\n[\n3\n]\n:-\nI can strongly recommend the applicant. He is a young man of quite exceptional capacity in mathematics and especially in work relating to numbers. He has a natural aptitude for computation and is very quick at figure work.\nOn the strength of the recommendation Ramanujan was appointed to the post of clerk and began his duties on\n1\nMarch\n1912\n. Ramanujan was quite lucky to have a number of people working round him with a training in mathematics. In fact the Chief Accountant for the Madras Port Trust, S N Aiyar, was trained as a mathematician and published a paper\nOn the distribution of primes\nin\n1913\non Ramanujan's work. The professor of civil engineering at the Madras Engineering College C L T Griffith was also interested in Ramanujan's abilities and, having been educated at University College London, knew the professor of mathematics there, namely M J M Hill. He wrote to Hill on\n12\nNovember\n1912\nsending some of Ramanujan's work and a copy of his\n1911\npaper on Bernoulli numbers.\nHill replied in a fairly encouraging way but showed that he had failed to understand Ramanujan's results on divergent series. The recommendation to Ramanujan that he read\nBromwich\n's\nTheory of infinite series\ndid not please Ramanujan much. Ramanujan wrote to E W\nHobson\nand H F\nBaker\ntrying to interest them in his results but neither replied. In January\n1913\nRamanujan wrote to\nG H Hardy\nhaving seen a copy of his\n1910\nbook\nOrders of infinity\n. In Ramanujan's letter to\nHardy\nhe introduced himself and his work\n[\n10\n]\n:-\nI have had no university education but I have undergone the ordinary school course. After leaving school I have been employing the spare time at my disposal to work at mathematics. I have not trodden through the conventional regular course which is followed in a university course, but I am striking out a new path for myself. I have made a special investigation of divergent series in general and the results I get are termed by the local mathematicians as 'startling'.\nHardy\n, together with\nLittlewood\n, studied the long list of unproved theorems which Ramanujan enclosed with his letter. On\n8\nFebruary he replied to Ramanujan\n[\n3\n]\n, the letter beginning:-\nI was exceedingly interested by your letter and by the theorems which you state. You will however understand that, before I can judge properly of the value of what you have done, it is essential that I should see proofs of some of your assertions. Your results seem to me to fall into roughly three classes:\n(1)\n  there are a number of results that are already known, or easily deducible from known theorems;\n(2)\n  there are results which, so far as I know, are new and interesting, but interesting rather from their curiosity and apparent difficulty than their importance;\n(3)\n  there are results which appear to be new and important...\nRamanujan was delighted with\nHardy\n's reply and when he wrote again he said\n[\n8\n]\n:-\nI have found a friend in you who views my labours sympathetically. ... I am already a half starving man. To preserve my brains I want food and this is my first consideration. Any sympathetic letter from you will be helpful to me here to get a scholarship either from the university of from the government.\nIndeed the University of Madras did give Ramanujan a scholarship in May\n1913\nfor two years and, in\n1914\n,\nHardy\nbrought Ramanujan to Trinity College, Cambridge, to begin an extraordinary collaboration. Setting this up was not an easy matter. Ramanujan was an orthodox Brahmin and so was a strict vegetarian. His religion should have prevented him from travelling but this difficulty was overcome, partly by the work of\nE H Neville\nwho was a colleague of\nHardy\n's at Trinity College and who met with Ramanujan while lecturing in India.\nRamanujan sailed from India on\n17\nMarch\n1914\n. It was a calm voyage except for three days on which Ramanujan was seasick. He arrived in London on\n14\nApril\n1914\nand was met by\nNeville\n. After four days in London they went to Cambridge and Ramanujan spent a couple of weeks in\nNeville\n's home before moving into rooms in Trinity College on\n30\nth\nApril. Right from the beginning, however, he had problems with his diet. The outbreak of World War I made obtaining special items of food harder and it was not long before Ramanujan had health problems.\nRight from the start Ramanujan's collaboration with\nHardy\nled to important results.\nHardy\nwas, however, unsure how to approach the problem of Ramanujan's lack of formal education. He wrote\n[\n1\n]\n:-\nWhat was to be done in the way of teaching him modern mathematics? The limitations of his knowledge were as startling as its profundity.\nLittlewood\nwas asked to help teach Ramanujan rigorous mathematical methods. However he said\n(\n[\n31\n]\n)\n:-\n... that it was extremely difficult because every time some matter, which it was thought that Ramanujan needed to know, was mentioned, Ramanujan's response was an avalanche of original ideas which made it almost impossible for\nLittlewood\nto persist in his original intention.\nThe war soon took\nLittlewood\naway on war duty but\nHardy\nremained in Cambridge to work with Ramanujan. Even in his first winter in England, Ramanujan was ill and he wrote in March\n1915\nthat he had been ill due to the winter weather and had not been able to publish anything for five months. What he did publish was the work he did in England, the decision having been made that the results he had obtained while in India, many of which he had communicated to\nHardy\nin his letters, would not be published until the war had ended.\nOn\n16\nMarch\n1916\nRamanujan graduated from Cambridge with a Bachelor of Arts by Research\n(\nthe degree was called a Ph.D. from\n1920)\n. He had been allowed to enrol in June\n1914\ndespite not having the proper qualifications. Ramanujan's dissertation was on\nHighly composite numbers\nand consisted of seven of his papers published in England.\nRamanujan fell seriously ill in\n1917\nand his doctors feared that he would die. He did improve a little by September but spent most of his time in various nursing homes. In February\n1918\nHardy\nwrote\n(\nsee\n[\n3\n]\n)\n:-\nBatty Shaw found out, what other doctors did not know, that he had undergone an operation about four years ago. His worst theory was that this had really been for the removal of a malignant growth, wrongly diagnosed. In view of the fact that Ramanujan is no worse than six months ago, he has now abandoned this theory - the other doctors never gave it any support. Tubercle has been the provisionally accepted theory, apart from this, since the original idea of gastric ulcer was given up. ... Like all Indians he is fatalistic, and it is terribly hard to get him to take care of himself.\nOn\n18\nFebruary\n1918\nRamanujan was elected a fellow of the Cambridge Philosophical Society and then three days later, the greatest honour that he would receive, his name appeared on the list for election as a fellow of the\nRoyal Society of London\n. He had been proposed by an impressive list of mathematicians, namely\nHardy\n,\nMacMahon\n, Grace,\nLarmor\n,\nBromwich\n,\nHobson\n,\nBaker\n,\nLittlewood\n, Nicholson,\nYoung\n,\nWhittaker\n,\nForsyth\nand\nWhitehead\n. His election as a fellow of the\nRoyal Society\nwas confirmed on\n2\nMay\n1918\n, then on\n10\nOctober\n1918\nhe was elected a Fellow of Trinity College Cambridge, the fellowship to run for six years.\nThe honours which were bestowed on Ramanujan seemed to help his health improve a little and he renewed his effors at producing mathematics. By the end of November\n1918\nRamanujan's health had greatly improved.\nHardy\nwrote in a letter\n[\n3\n]\n:-\nI think we may now hope that he has turned to corner, and is on the road to a real recovery. His temperature has ceased to be irregular, and he has gained nearly a stone in weight. ... There has never been any sign of any diminuation in his extraordinary mathematical talents. He has produced less, naturally, during his illness but the quality has been the same. ....\nHe will return to India with a scientific standing and reputation such as no Indian has enjoyed before, and I am confident that India will regard him as the treasure he is. His natural simplicity and modesty has never been affected in the least by success - indeed all that is wanted is to get him to realise that he really is a success.\nRamanujan sailed to India on\n27\nFebruary\n1919\narriving on\n13\nMarch. However his health was very poor and, despite medical treatment, he died there the following year.\nThe letters Ramanujan wrote to\nHardy\nin\n1913\nhad contained many fascinating results. Ramanujan worked out the\nRiemann\nseries, the elliptic integrals, hypergeometric series and functional equations of the\nzeta function\n. On the other hand he had only a vague idea of what constitutes a mathematical proof. Despite many brilliant results, some of his theorems on\nprime numbers\nwere completely wrong.\nRamanujan independently discovered results of\nGauss\n,\nKummer\nand others on hypergeometric series. Ramanujan's own work on partial sums and products of hypergeometric series have led to major development in the topic. Perhaps his most famous work was on the number p\n(\nn\n)\nof partitions of an integer\nn\nn\nn\ninto summands.\nMacMahon\nhad produced tables of the value of\np\n(\nn\n)\np(n)\np\n(\nn\n)\nfor small numbers\nn\nn\nn\n, and Ramanujan used this numerical data to conjecture some remarkable properties some of which he proved using elliptic functions. Other were only proved after Ramanujan's death.\nIn a joint paper with\nHardy\n, Ramanujan gave an asymptotic formula for\np\n(\nn\n)\np(n)\np\n(\nn\n)\n. It had the remarkable property that it appeared to give the correct value of\np\n(\nn\n)\np(n)\np\n(\nn\n)\n, and this was later proved by\nRademacher\n.\nRamanujan left a number of unpublished notebooks filled with theorems that mathematicians have continued to study.\nG N Watson\n, Mason Professor of Pure Mathematics at Birmingham from\n1918\nto\n1951\npublished\n14\npapers under the general title\nTheorems stated by Ramanujan\nand in all he published nearly\n30\npapers which were inspired by Ramanujan's work.\nHardy\npassed on to\nWatson\nthe large number of manuscripts of Ramanujan that he had, both written before\n1914\nand some written in Ramanujan's last year in India before his death.\nThe picture above is taken from a stamp issued by the Indian Post Office to celebrate the\n75\nth\nanniversary of his birth."
}