{
  "nome_completo": "Sripati",
  "nome_curto": "Sripati",
  "ano_nascimento": "1019",
  "ano_morte": "1066",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sripati/",
  "lugar_nascimento": "(probably) Rohinikhanda, Maharashtra, India",
  "lugar_morte": "India",
  "biografia": "Sripati\n's father was Nagadeva\n(\nsometimes written as Namadeva\n)\nand Nagadeva's father, Sripati's paternal grandfather, was Kesava. Sripati was a follower of the teaching of\nLalla\nwriting on astrology, astronomy and mathematics. His mathematical work was undertaken with applications to astronomy in mind, for example a study of spheres. His work on astronomy was undertaken to provide a basis for his astrology. Sripati was the most prominent Indian mathematicians of the\n11\nth\nCentury.\nAmong Sripati's works are:\nDhikotidakarana\nwritten in\n1039\n, a work of twenty verses on solar and lunar eclipses;\nDhruvamanasa\nwritten in\n1056\n, a work of\n105\nverses on calculating planetary longitudes, eclipses and planetary\ntransits\n;\nSiddhantasekhara\na major work on astronomy in\n19\nchapters; and\nGanitatilaka\nan incomplete arithmetical treatise in\n125\nverses based on a work by\nSridhara\n.\nThe titles of Chapters\n13\n,\n14\n, and\n15\nof the\nSiddhantasekhara\nare Arithmetic, Algebra and On the Sphere. Chapter\n13\nconsists of\n55\nverses on arithmetic, mensuration, and shadow reckoning. It is probable that the lost portion of the arithmetic treatise\nGanitatilaka\nconsisted essentially of verses\n19\n-\n55\nof this chapter. The\n37\nverses of Chapter\n14\non algebra state various rules of algebra without proof. These are given in verbal form without algebraic symbols. In verses\n3\n,\n4\nand\n5\nof this chapter Sripati gave the rules of signs for addition, subtraction, multiplication, division, square, square root, cube and cube root of positive and negative quantities. His work on equations in this chapter contains the rule for solving a quadratic equation and, more impressively, he gives the identity:\nx\n+\ny\n=\n1\n2\n(\nx\n+\nx\n2\n−\ny\n)\n+\n1\n2\n(\nx\n−\nx\n2\n−\ny\n)\n\\sqrt{x + \\sqrt y} = \\sqrt{\\large\\frac{1}{2}\\normalsize \\left( x + \\sqrt{x^{2} - y}\\right)} + \\sqrt{\\large\\frac{1}{2}\\normalsize \\left( x - \\sqrt{x^{2} - y}\\right)}\nx\n+\ny\n​\n​\n=\n2\n1\n​\n(\nx\n+\nx\n2\n−\ny\n​\n)\n​\n+\n2\n1\n​\n(\nx\n−\nx\n2\n−\ny\n​\n)\n​\nOther mathematics included in Sripati's work includes, in particular, rules for the solution of simultaneous indeterminate equations of the first degree that are similar to those given by\nBrahmagupta\nSripati obtained more fame in astrology than in other areas and it is fair to say that he considered this to be his most important contributions. He wrote the\nJyotisaratnamala\nwhich was an astrology text in twenty chapters based on the\nJyotisaratnakosa\nof\nLalla\n. Sripati wrote a commentary on this work in Marathi and it is one of the oldest works to have survived that is written in that language. Marathi is the oldest of the regional languages in Indo-Aryan, dating from about\n1000\n.\nAnother work on astrology written by Sripati is the\nJatakapaddhati\nor\nSripatipaddhati\nwhich is in eight chapters and is\n[\n1\n]\n:-\n... one of the fundamental textbooks for later Indian genethlialogy, contributing an impressive elaboration to the computation of the strengths of the planets and astrological places. It was enormously popular, as the large number of manuscripts, commentaries, and imitations attests.\nGenethlialogy was the science of casting nativities and it was the earliest branch of astrology which claimed to be able to predict the course of a person's life based on the positions of the planets and of the signs of the zodiac at the moment the person was born or conceived.\nThere is one other work on astrology the\nDaivajnavallabha\nwhich some historians claim was written by Sripati while other claim that it is the work of\nVarahamihira\n. As yet nobody has come up with a definite case to show which of these two is the author, or even whether the author is another astrologer."
}