{
  "nome_completo": "Stanisław Meiczyslaw Mazur",
  "nome_curto": "Stanisław Mazur",
  "ano_nascimento": "1905",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mazur/",
  "lugar_nascimento": "Lemberg, Galicia, Austrian Empire (later Lwów, Poland, now Lviv, Ukraine)",
  "lugar_morte": "Warsaw, Poland",
  "biografia": "Stanisław Mazur\nattended the\nGymnasium\nin Lwów, graduating in\n1923\n.  From\n1923\nto\n1926\nhe studied at the Jan Kazimierz University, Lwów and in Paris. In\n[\n1\n]\nan incident from this time is recalled by\nAndrzej Turowicz\n. Mazur wrote his first paper while still an undergraduate and he submitted it to\nSteinhaus\n. The paper was to be read by Mazur at a meeting of the Lwów Scientific Society but only hours before the meeting\nSteinhaus\nsummoned Mazur to tell him that he had handed him four blank sheets of paper. Students could only afford cheap quality yellow paper and Mazur had diluted his ink with water to make it last longer.\nSteinhaus\nsaid to Mazur:-\nWell, Mr Mazur, perhaps there is something written here after all. But if you intend to devote your life to scientific pursuits, why don't you first supply yourself with white paper and black ink.\nThere is no record of whether Mazur took\nSteinhaus\n's advice, but he certainly devoted himself to mathematical pursuits. In the years\n1926\n-\n1935\nhe was an assistant to the chair of mathematical analysis at the Jan Kazimierz University. He became a student of\nBanach\n's who taught there.\nHis doctorate, under\nBanach\n's supervision, was awarded in\n1935\n. Mazur was a close collaborator with\nBanach\nat Lwów and became a member of the Lwów School of Mathematics, a group of about a dozen mathematicians working in\nfunctional analysis\n, real functions and\nprobability theory\n. He wrote several papers in collaboration with\nBanach\nduring the\n1930\ns and, having a better knowledge than\nBanach\nof German, he polished the language used in the joint papers which they wrote in German.\nThe collaboration between Mazur and\nBanach\nin Lwów was important for both men. There is no doubt that of all\nBanach\n's colleagues in Lwów, Mazur was the one closest to him. The way that the mathematicians worked in Lwów has become famous. They spent many hours thinking about mathematical problems in the Scottish Café. These sessions are described in\n[\n1\n]\n:-\nUsually they began arriving between\n5\nand\n7\npm - always occupying the same tables - and for the next several hours they worked with total concentration, covering the marble table tops with mathematical farmulas. But saying that they worked with total concentration is not completely accurate, as there was no meeting without jokes, heated discourse, shouting and drinking.\nYou can see a picture of the Scottish Café at\nTHIS LINK\n.\nUlam\n, in\n[\n2\n]\n, describes the particular way that the collaboration between Mazur and\nBanach\nin the Scottish Café worked:-\nWe discussed problems proposed right there, often with no solution evident even after several hours of thinking. The next day\nBanach\nwas likely to appear with several small sheets of paper containing outlines of proofs he had completed. If they were not polished or even not quite correct, Mazur would frequently put them into a more satisfactory form.\nIt was in the Scottish Café that the famous\nScottish Book\nconsisting of open questions posed by the mathematicians working there came into being. Mazur contributed\n24\nproblems to the book with himself as the sole author, and a further\n19\nproblems jointly contributed with others such as\nBanach\n.\nIt was not only\nBanach\nwith who Mazur collaborated but others including\nUlam\n. In\n[\n2\n]\nUlam\ndescribes their collaborations on function spaces:-\nWe found a solution to a problem involving infinite dimensional vector spaces. The theorem we proved - that a transformation preserving distances is linear - is now part of the standard treatment of the geometry of function spaces. We wrote a paper which was published in Comptes Rendus ... It was Mazur ... who introduced me to certain large phases of mathematical thinking and approaches. From him I learned much about the attitudes and psychology of research.\nDuring the\n1930\ns Mazur was an active member of the Polish Communist Party. This would stand him in good stead when the Communists came to power after the war. Mazur's\nhabilitation\nthesis was submitted in\n1936\n. After the award of his habilitation, Mazur taught at Lwów until\n1946\n.\nIn\n[\n2\n]\nUlam\nrecalls a conversation he had with Mazur in the summer of\n1939\nabout whether he thought there would be a war:-\nPeople in general expected another crisis in the style of Munich and were not prepared for the coming World War. Mazur said \"The possibility of a World War is real. What are we going to do with the Scottish Book and our joint unpublished papers? You are going to the United States, and most surely you are going to be safe. In case the city is bombed, I will pack the manuscripts and the Book in a chest and bury it\". We even decided on an exact place - next to the goal post at the soccer pitch on the city outskirts. I do not know if that's what happened.\nAlthough it is not known for certain how the\nScottish Book\nsurvived the war, we do know that it was brought to Wrocław by\nBanach\n's wife and it ended up in the possession of his son.\nThere is a charming story about one of the most famous of the problems in the\nScottish Book\nwhich was posed by Mazur. This was problem number\n153\n, which Mazur inserted into the\nBook\non\n6\nNovember\n1936\n. The problem asked\n(\nalthough not in these words\n)\nabout the existence of\nSchauder\nbases in separable Banach spaces. As with many of the problems in the\nScottish Book\nthe proposer would offer a prize for their solution. Prizes offered included wine, spirits, or a meal in Cambridge but Mazur offered a live goose as the prize for this particular problem. Per Enflo showed in\n1972\nthat the problem had a negative solution and, while in Warsaw lecturing on his solution, Mazur presented him with his prize, the live goose!\nFrom\n1948\nMazur worked at the University of Warsaw. Then, given his earlier involvement with the Polish Communist Party, Mazur became a high official in the science establishment.\nMazur made important contributions to geometrical methods in linear and non-linear functional analysis and to the study of Banach algebras. The mean ergodic theorem in Banach spaces was announced by Mazur in\n1932\nbut a proof does not appear in print until\n1938\nwhen Yosida and by\nKakutani\npublished the result.\nHe was also interested in summability theory, infinite games and recursive functions.\nUlam\nrecounts in\n[\n2\n]\nhow Mazur gave the first examples of infinite games in the Scottish Café in Lwów.\nThe author of\n[\n4\n]\npoints out how many of Mazur's original contributions are not explicitly identified as such but appear in print only as remarks in\nBanach\n's\nThéorie des operations lineaires\n. For example, the weak-basis theorem, due to Mazur, is given by\nBanach\nin his book but no proof appears.\nIn\n1978\nMazur was honoured by receiving honorary life membership in the\nPolish Mathematical Society\n. The article\n[\n6\n]\npresents the depth of Mazur's functional-analytic contribution which led to this honour. In\n1980\nthe University of Warsaw awarded Mazur an honorary doctorate. The award was made in recognition that he was a leading Polish mathematician and a cofounder with\nBanach\nof the Polish School of Functional Analysis. In the article\n[\n3\n]\nMazur's reply at the awarding ceremony is given. In his speach Mazur concentrated on his activities at the University of Lwów during World War II."
}