{
  "nome_completo": "Stefan Mazurkiewicz",
  "nome_curto": "Stefan Mazurkiewicz",
  "ano_nascimento": "1888",
  "ano_morte": "1945",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Mazurkiewicz/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Grodzisk, Mazowiecki (near Warsaw), Poland",
  "biografia": "Stefan Mazurkiewicz\n's father was a barrister in Warsaw. Stefan attended secondary school in Warsaw, graduating in\n1907\n. Mazurkiewicz decided not to remain in Warsaw for his university education, taking what was a typical route for Poles at this time. We shall give some background to the political situation in Poland to explain why this was so.\nThe first thing to note is that when Mazurkiewicz graduated from secondary school in\n1907\n, Poland did not formally exist. Poland had been partitioned in\n1772\nand the south was called Galicia and under Austrian control. Russia controlled much of the rest of the country and in the years prior to Mazurkiewicz's birth there had been strong moves by Russia to make \"Vistula Land\", as it was called, be dominated by Russian culture. In a policy implemented between\n1869\nand\n1874\n, all secondary schooling was in the Russian language. Warsaw only had a Russian language university after the University of Warsaw was closed by the Russian administration in\n1869\n. Galicia, although under Austrian control, retained Polish culture and was often where Poles from \"Vistula Land\" went for their education. Indeed Mazurkiewicz first went to Kraków, in Galicia but, again following the pattern of students of the time to spend sessions at a number of different universities, he went next to Munich, then to the renowned mathematical research centre at Göttingen.\nMazurkiewicz returned to Galicia for his doctorate, which was supervised by\nSierpiński\non space filling curves at the University of Lemberg\n(\nin what is now Lviv in Ukraine\n)\n. His doctorate was awarded in\n1913\n, but World War I began the following year and it was to bring major changes in Poland and to Mazurkiewicz's life. In August\n1915\nthe Russian forces which had held Poland for many years withdrew from Warsaw. Germany and Austria-Hungary took control of most of the country and a German governor general was installed in Warsaw. One of the first moves after the Russian withdrawal was the refounding of the University of Warsaw and it began operating as a Polish university in November\n1915\n. At this point Mazurkiewicz became a professor at this reborn University of Warsaw and he would remain on the staff of the university for the rest of his life.\nKuratowski\nattended seminars given by Mazurkiewicz in Warsaw before the end of the war. He writes in\n[\n2\n]\n:-\nAs early as\n1917\n[\nJaniszewski\nand Mazurkiewicz\n]\nwere conducting a\ntopology\nseminar, presumably the first in that new, exuberantly developing field. The meeting of that seminar, taken up to a large extent with sometimes quite vehement discussions between\nJaniszewski\nand Mazurkiewicz, were a real intellectual treat for the participants.\nMazurkiewicz, along with\nSierpiński\n, was recruited by the cipher bureau of the Polish Army to give lessons on cryptography.\n[\n7\n]\nTheir efforts proved invaluable in the cracking of Soviet codes during the Polish-Bolshevik War\n(1919\n-\n1921)\n, in particular in the defeat of the Russians in the Battle of Warsaw in\n1920\n.\nThe role that Mazurkiewicz played in the creation of the Polish School of Mathematics was an important one.\nKuratowski\nwrites in\n[\n2\n]\n:-\n... Stefan Mazurkiewicz was the central figure among professors of mathematics, especially in the early years of the university's existence. A brilliant lecturer, a very active research worker, he had a great influence on young people and encouraged them to do research of their own in modern fields of mathematics ...\nHis main work was in topology and the\ntheory of probability\n. His notion of dimension of a compact set preceded that of\nMenger\nand\nUrysohn\nby seven years. Mazurkiewicz applied topological methods to the theory of functions, obtaining powerful results. His theory gave particularly strong results when applied to the Euclidean plane, giving deep knowledge of its topological structure.\nMany of the ideas introduced by Mazurkiewicz were studied independently by\nHahn\n. They independently proved that\n[\n1\n]\n:-\n... every continuous function that transforms a compact linear set into a plane set with interior points takes the same value in at least three points.\nOther results by Mazurkiewicz gave information about the topological structure of curves. He proved strong results on continuous functions containing\nSierpiński\n's curve and wrote several papers on functional spaces.\nThe style employed by Mazurkiewicz, both in research and teaching, is described by\nKuratowski\nin\n[\n2\n]\n:-\nMazurkiewicz's passion was solving problems and raising new and often very profound ones. This unusually creative scholar's almost sportsmanlike attitude towards mathematics was in some sense manifested in the way he lectured and prepared his results for publication: Mazurkiewicz used no notes while lecturing, and his lectures were not always completely elaborated but they were greatly admired by his audience for their ingenuity and deep intelligence. Very often, however, his publications were not sufficiently polished and presented only a draft of an argument and therefore were not easily understandable; but as a rule they contained new ideas and fascinated the reader by their author's inventive powers and the wealth of his methods.\nMazurkiewicz held many important positions in the University of Warsaw as it flourished between the two wars. He was elected vice-rector of the University and he was Dean of the Faculty of Mathematical and Natural Sciences for nine years. He was also president of the\nPolish Mathematical Society\nin\n1933\n-\n35\nand he continued the tradition established in Lwów\n(\nLviv\n)\nof meetings in coffee houses.\nAfter\nJaniszewski\ndied in\n1920\n, Mazurkiewicz and\nSierpiński\ntook over the editorship of the journal\nFundamenta Mathematicae\nwhich\nJaniszewski\nhad set up. In\n[\n6\n]\nTamarkin\nwrote:-\nUnder masterful guidance of its editors, S Mazurkiewicz and\nW Sierpinski\n, Fundamenta Mathematicae immediately developed into a unique periodical which attracted international recognition and cooperation, and whose history became the history of development of the modern theory of functions and point sets.\nThroughout his career Mazurkiewicz was interested in the theory of probability. He proved the strong law of large numbers in\n1922\n, a result which was proved independently by\nCantelli\n. He also considered axiom systems for probability theory, publishing different versions in the years\n1933\nand\n1934\n.\nAfter the German invasion of Poland in\n1939\nlife there became extremely difficult. There was a strategy by the Nazi invaders to put an end to the intellectual life of Poland and to achieve this they sent many academics to concentration camps and murdered others. It was during this period of occupation that Mazurkiewicz wrote a treatise on probability including his own results on the topic.\nNear the end of the war, Warsaw became the centre for Polish resistance. In\n1944\nthe people, knowing that Soviet forces were nearing the city, rose up against the German garrison which by this time was severely depleted. However, German reinforcements were sent and the Polish resistance was defeated. Hitler ordered the destruction of the city in retaliation for the uprising. The Germans systematically destroyed the buildings using explosives on some and setting fire to others. Around\n175\n,\n000\nof the population of Warsaw died as a result of the uprising. Mazurkiewicz escaped with his life, but the manuscript of his treatise on probability was destroyed as the buildings burned.\nAt this time Mazurkiewicz was greatly weakened as a result of the difficult life he had led in Warsaw and also through an illness from which he now suffered. However, he attempted to rewrite his treatise on probability which had been burnt in the destruction. Although he only managed to recreate part of the work it was completed eleven years after his death and published as number\n32\nin the\nMathematical Monographs\nseries.\nDespite being gravely ill, Mazurkiewicz thought only of the recreation of Polish mathematics as the war drew to a close, being filled with the same enthusiasm which he had displayed at the end of World War I. On\n25\nFebruary\n1945\nhe submitted a report to the Ministry of Education on the recovery route that mathematics should take. He argued strongly for the creation of a Mathematical Institute along the lines of\nKuratowski\n's report made before the start of the war.\nAlready moves were under way to re-establish the University of Warsaw and the Technical University. Mazurkiewicz took part in these meetings despite his failing health. Desperately ill he was taken to a hospital at Grodzisk Mazowiecki on the outskirts of Warsaw where he died during an operation for a gastric ulcer."
}