{
  "nome_completo": "Stefan E Warschawski",
  "nome_curto": "Stefan Warschawski",
  "ano_nascimento": "1904",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Warschawski/",
  "lugar_nascimento": "Lida, Russia Empire (now Belarus)",
  "lugar_morte": "San Diego, California, USA",
  "biografia": "Stefan Warschawski\nwas born in Lida, a city which alternated between being in Poland or Russia. At the time that Warschawski was born, Lida was part of Russia but reverted to Poland in\n1919\n. Despite the fact that the city was controlled by either Russia or Poland, the Warschawski household were German speaking. However, when the German armies attacked Lida in\n1915\nduring World War I, his family left the city and went to live in Königsberg where mother's parents lived. It was in Königsberg that he attended the\ngymnasium\n, graduating in\n1924\n.\nAfter completing his studies at the gymnasium, Warschawski entered the University of Königsberg. There he was taught by\nKnopp\nand\nRogosinski\n. After two years of study he moved to Göttingen to study for his doctorate. Although the university was staffed by leading mathematicians like\nLandau\n,\nCourant\n, and Herglotz, whose courses he took, it was Alexander\nOstrowski\n, at that time a\nprivatdozent\n, who supervised Warschawski's research.\nOstrowski\nhad taken up the position in Göttingen in\n1923\nbut when Warschawski began his studies in\n1926\nhe had just returned from a year of study in Britain at the universities of Oxford, Cambridge and Edinburgh. He had not been supervising Warschawski for long when he was offered the chair of mathematics at the University of Basel. Warschawski moved to Basel with his supervisor and there completed working on his thesis on the boundary behaviour of conformal mappings.\nAfter the award of his doctorate Warschawski was offered a position back at Göttingen and he returned there to start teaching courses in session\n1930\n-\n31\n. On\n30\nJanuary\n1933\nHitler came to power and on\n1\nApril there was the so-called \"boycott day\" when Jewish shops were boycotted and Jewish lecturers were not allowed to enter their university. On\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Warschawski realised that he could not make a career in Germany and he was helped by Julius Wolff to obtain a one year post at the University of Utrecht in Holland. At the end of that time, again with Wolff's help, he obtained a one year position at Columbia University in New York. Warschawski was immensely grateful to Wolff for helping him to escape from the Nazis, but Wolff himself suffered the fate he helped others avoid for he died during the Nazi occupation of the Netherlands.\nIn the United States at this time it was not easy to obtain permanent posts. Many top class mathematicians had fled to the united States from the Nazi threat in Europe and there were not enough positions available. Warschawski published a major\n30\npage paper\nOn the higher derivatives at the boundary in conformal mapping\nin the\nTransactions of the American Mathematical Society\nin\n1935\nbut had to move from one short term post to the next until he was offered a permanent position in\n1939\nat Washington University in St Louis. A colleague interested him in the method of computing mappings by successive approximation and he soon was able to prove the necessary convergence theorems to put the method on a firm theoretical basis. He published\nThe convergence of expansions resulting from a self-adjoint boundary problem\nin the\nDuke Mathematical Journal\nin\n1940\n, jointly with A S Galbraith, which studied a problem of the\nRiesz\n-\nFischer\ntype concerning the expansion of a function with\nn\nn\nn\nderivatives in terms of the characteristic solutions of a self-adjoint boundary value problem of the second order.\nCarl H FitzGerald, Burton Rodin, and Helmut Rohrl have written an obituary of Warschawski in which they say how he helped with the war effort:-\nIn connection with the war effort, he taught extra courses; during one semester, he lectured\n36\nhours a week.\n(\nSteve objected to the mention of that load in an earlier biography. He was concerned that it might be thought that he had complained about the load. As he saw it, other people had it worse; he did not complain.\n)\nBefore World War II ended he joined the Applied Mathematics Group at Brown University.\nLoewner\nalso joined the group in\n1944\nto study problems with military applications.\nBergman\n, also forced to leave Nazi Germany, was on the faculty at Brown when Warschawski joined, as was\nBers\nwho was also undertaking research relevant to the war effort. After a year at Brown, Warschawski moved to the University of Minnesota and in March\n1947\nhe married Ilse Kayser. He continued to undertake research on conformal mapping publishing\nOn conformal mapping of regions bounded by smooth curves\nin\n1951\n. In\n1955\nhe published two papers in\nExperiments in the computation of conformal maps\npublished in the National Bureau of Standards Applied Mathematics Series. The first was a single author paper On the solution of the\nLichtenstein\n-\nGershgorin\nintegral equation\nin conformal mapping. I. Theory while the second, On the solution of the Lichtenstein-Gershgorin integral equation in conformal mapping. II. Computational experiments, was written jointly with\nJack Todd\n. The computational results of iterating obtained in the second paper were in good agreement with the theoretical results given in the first.\nWarschawski was appointed chairman of the Mathematics Department in the Institute of Technology at the University of Minnesota in\n1952\nand was highly successful in building the Department over the following eleven years. In\n1963\nhe moved to the La Jolla campus of the University of California San Diego. He was chairman of the Department of Mathematics from\n1963\nuntil\n1967\nwhen ill health forced him to give up the Chairmanship. He retired in\n1971\nbut continued to teach courses at the University of California San Diego as well as at San Diego State University where he was a Distinguished Visiting Professor in\n1972\n-\n73\n.\nCarl H FitzGerald, Burton Rodin, and Helmut Rohrl summed up Warschawski's achievements as follows:-\nSteve Warschawski lived among the top mathematicians of two continents. With careful scholarship, he made lasting contributions to the theory of complex analysis, particularly to the theory of conformal mappings. With keen judgment, he guided two mathematics departments to eminence. With modest gratitude, he cemented many friendships along the way."
}