{
  "nome_completo": "Stefan Emmanuilovich Cohn-Vossen",
  "nome_curto": "Stefan Cohn-Vossen",
  "ano_nascimento": "1902",
  "ano_morte": "1936",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cohn-Vossen/",
  "lugar_nascimento": "Breslau, Germany, now Wrocław, Poland",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Stefan\n(\nor\nStephan\n)\nCohn-Vossen\nwas born into a Jewish family - his father was Emmanuel Cohn-Vossen. Stefan was brought up and educated in Breslau. The city of around\n500\n,\n000\ninhabitants was, by the time that Cohn-Vossen was growing up there, largely German due chancellor Otto von Bismarck's efforts to Germanize the area. Cohn-Vossen attended Breslau University and his thesis advisor there was\nAdolf Kneser\n. He submitted his thesis\nSinguläre Punkte reeller, schlichter Kurvenscharen, deren Differentialgleichung gegeben ist\nⓉ\n(\nSingular points of real, simple curves whose equation is given\n)\nand graduated with his doctorate in\n1924\n. He moved to the University of Göttingen and published papers such as\nSingularitäten konvexer Flächen\nⓉ\n(\nsingularities of convex surfaces\n)\n(1927)\n,\nZwei Sätze über die Starrheit der Eiflachen\nⓉ\n(\nTwo theorems on the rigidity of the ellipsoid\n)\n(1928)\n, and\nUnstarre geschlossene Flächen\nⓉ\n(\nNon-rigid closed surfaces\n)\n(1929)\n. He\nhabilitated\nat the University of Göttingen in\n1929\n.\nIn\n1930\nCohn-Vossen was appointed as a\nprivatdocent\nat the University of Cologne. This was a difficult time in Germany\n(\nand in many other countries\n)\nas a consequence of the world-wide depression in\n1929\n. This was certainly one of the factors leading to the breakdown of the democratic system in Germany. The Social Democratic government collapsed in\n1930\nand fears of poverty led many to support the Nazi party. An anti-Semitic campaign led to increased support for the Nazis but Jews like Cohn-Vossen had increasing cause to fear the direction in which the country was moving. On\n30\nJanuary\n1933\nHitler was named chancellor but massive intimidation failed to gain the party an absolute majority in elections on\n5\nMarch\n1933\n. This did not prevent the Nazi government taking full control and, on\n7\nApril\n1933\n, the Civil Service Law was passed which provided the means of removing Jewish teachers from the universities, and of course also to remove those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Cohn-Vossen was dismissed from his teaching position at the University of Cologne.\nDuring the three years that Cohn-Vossen had spent in Cologne he had become well-known with the publication in\n1932\nof the book\nAnschauliche Geometrie\nⓉ\n(\nDescriptive geometry\n)\nwhich was a joint work with\nDavid Hilbert\n. The book was based on lectures that\nHilbert\nhad given at Göttingen in\n1921\nbut making this course into a book had been Cohn-Vossen's task.\nHerbert Turnbull\nwrites in\n[\n5\n]\n:-\nThis remarkable book ... comes as a grateful gesture from\nHilbert\n, who is one of the most eminent of mathematicians, and from his collaborator who has borne the brunt of editing the subject-matter right worthily.\nTurnbull\nends his review with these words:-\nThe book will make a very wide appeal, not only to experts in all branches of pure mathematics, providing as it does a genial connecting link between almost all the maze-like ramifications of the subject; but also to many others who at school or later have felt something of the fascination that geometry ever exercises over the human mind.\nThe book was of great importance but this presented problems to the Nazis who had dismissed Cohn-Vossen from his post because of his race. The way that they overcame the difficult conflict between mathematical quality and anti-Semitism was to reduce the role of Cohn-Vossen to that of an amanuensis. In fact\nLudwig Bieberbach\n, who allowed Nazi ideology to completely override his mathematical judgement, took care to emphasise that his only citations to\nAnschauliche Geometrie\nwere those that were ascribable solely to\nHilbert\nand definitely not Cohn-Vossen.\nWe note that the German edition of this book was reprinted in\n1973\n, and there were also translations into many languages including Russian, English\n(\npublished\n1952)\n, Polish\n(\npublished\n1956)\nand Italian\n(\npublished\n1960)\n. We should comment that the title of the English translation was\nGeometry and the Imagination\nwhich is not really a translation of the German title. A more accurate translation of\nAnschauliche Geometrie\nwould be 'Intuitive Geometry'.\nDonald Coxeter\n, reviewing this English translation, writes\n[\n3\n]\n:-\n'Auschauliche Geometrie' has been a classic for twenty years. Its breadth of outlook is reminiscent of Klein's 'Elementary Mathematics from an Advanced Standpoint'. Although it deals with elementary topics, it reaches the fringe of our knowledge in many directions.\n[\nIt contains\n]\nan extraordinarily high concentration of interesting ideas and information.\nThe author of\n[\n2\n]\nwrites of the:-\n... brilliant intuitive and concrete approach to geometry provided by\nHilbert\nand his collaborator Cohn-Vossen ...\nAfter Cohn-Vossen was dismissed from his position at the University of Cologne in\n1933\nhe left Germany and went to Switzerland. First he went to Locarno, but by\n1934\nhe was teaching at a school in Zürich. Later, still in\n1934\n, he emigrated to Russia and under his influence a school of \"geometry in the large\" was set up in Moscow and Leningrad. This was to have a major impact on research in Russia as\nAleksandr Danilovic Aleksandrov\ncarried on research in this area. Cohn-Vossen had been appointed as a professor at Leningrad University in\n1935\n, working at the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\n. The\nSteklov\nMathematical Institute moved to Moscow in the following year and Cohn-Vossen moved with the Institute - again he was appointed as a professor at the University in Moscow.\nHe published a number of influential papers during this short period of his life which was brought to a sad end in\n1936\nwhen he died of pneumonia. Among these papers, we mention:\nKürzeste Wege und Totalkrümmung auf Flächen\nⓉ\n(\nShortest paths and total curvature on surfaces\n)\n(1935)\n,\nDer approximative Sinussatz für kleine Dreiecke auf krummen Flächen\nⓉ\n(\nThe approximate sine rule for small triangles on curved surfaces\n)\n(1936)\n,\nExistenz kürzester Wege\nⓉ\n(\nThe existence of shortest paths\n)\n(1936)\n, and\nTotalkrümmung und geodätische Linien auf einfachzusammenhängenden offenen vollständigen Flächenstücken\nⓉ\n(\nTotal curvature and geodesics on simply connected open patches\n)\n(1936)\n. After his death the paper\nDie Kollineationen des n-dimensionalen Raumes\nⓉ\n(\nCollineations of n-dimensional space\n)\n(1938)\nwas published. The importance of this work to the Russian school is seen from the fact that in\n1959\na\n303\n-page Russian book\nSome problems of differential geometry in the large\n(\nRussian\n)\nwas published containing Russian translation of seven of Cohn-Vossen's papers. The book contained a survey by\nNikolai Vladimirovich Efimov\nputting Cohn-Vossen's papers into their historical context.\nCohn-Vossen's investigated whether general convex surfaces are uniquely determined by their metric. He proved the rigidity of a closed surface of the class of regularity\nC\n3\nC^{3}\nC\n3\nwith positive Gaussian curvature. His work was a deep development of studies made on the rigidity of a convex polyhedron by\nCauchy\n. After his death it was continued by\nA D Aleksandrov\nand then by his student\nAleksei Vasilevich Pogorelov\n."
}