{
  "nome_completo": "Stefano degli Angeli",
  "nome_curto": "Stephano degli Angeli",
  "ano_nascimento": "1623",
  "ano_morte": "1697",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Angeli/",
  "lugar_nascimento": "Venice, Venetian States (now Italy)",
  "lugar_morte": "Venice, Venetian States (now Italy)",
  "biografia": "Stephano degli Angeli\nwas in fact named Francesco degli Angeli as a child but later changed his name when entering a religious order. He entered the Order of the Jesuati\n(\nor Jesuate or Gesuati\n)\nwhich had been founded by Giovanni Colombini from Siena in\n1365\nat Città di Castello. Since the Order had a major influence on Angeli's life and mathematics, we should say a little about it. The name of the Order comes from the fact that members said \"Praise be to Jesus Christ\" at all times but their special devotion to Saint Jerome explained the longer name \"Apostolic Clerics of St Jerome\". The Order received the approval of the Roman Catholic Church from Pope Urban V in\n1367\n. They were devoted to charity work and caring for the sick, while every day they would beat themselves to inflict pain. The Order, whose rules were originally based on those of St Benedict, flourished spreading rapidly throughout Italy. Later the Rule of St Augustine was adopted and in\n1606\npriests were allowed into the Order.\nWhat would Angeli have worn as a Jesuati? Certainly he wore a white habit with a dark leather belt and sandals on his feet. He would have had little in the way of worldly possessions. After being educated within the Order he then taught literature, philosophy and theology in the Faculty of the Gesuati Order at Ferrara from\n1644\n. His health, however, was poor and he was given medical advice to transfer to Bologna, which is about\n50\nkm south west, in\n1645\n. It might seem strange medical advice to move to another town only\n50\nkm away, but in fact Ferrara is situated on marshland whereas Bologna is situated at a height of\n55\nmetres above sea level at the foot of the Apennine mountains. It was a good move in terms of Angeli's health, and also a good move for mathematics since in Bologna he came under the  influence of\nCavalieri\n.\nCavalieri\nwas also in the Order of the Jesuati so the two naturally came in contact.\nCavalieri\nwas teaching at the University of Bologna, one of the oldest and most famous universities in Europe, dating from the\n11\nth\ncentury. At the time that Angeli was there the university was situated in the Archiginnasio Palace which had been built by Pius IV in\n1562\n[\n1\n]\n:-\nCavalieri was soon able to appreciate Angeli's ability, and encouraged him in his studies and mathematical researches.\nAfter leaving Bologna, Angeli continued his contacts with\nCavalieri\nby correspondence, and was entrusted to publish\nCavalieri\n's final work,\nExercitationes geometricae sex\nⓉ\n(\nSix geometric exercises\n)\n, since by\n1647\nCavalieri\n's health had deteriorated to such an extent that he was unable to carry out the work himself. Angeli also corresponded with a number of other mathematicians including\nTorricelli\nand\nViviani\n. After\nCavalieri\n's death, later in\n1647\n, Angeli was offered his chair of mathematics at the University of Bologna but he was still too modest about his own mathematical achievements to accept the position. He moved to Rome where he devoted himself to both mathematics and religious studies.\nAngeli was Rector of a Jesuati Order religious establishment in Rome from\n1647\nto\n1652\n. Then he moved to a Jesuati monastery in Venice but, shortly after going to Venice, he was appointed as provincial definer for the Jesuati Order. In addition to this religious role he continued to be heavily involved in teaching and research in mathematics and he was appointed professor of mathematics at University of Padua on\n2\nJanuary\n1662\n.\nJames Gregory\nstudied with Angeli in Padua from\n1664\nto\n1668\nand learnt from him about series expansions of functions. In fact the Jesuati Order was suppressed in\n1668\nby Pope Clement IX who believed that abuses had crept in over the years, but Angeli continued in the priesthood while holding the chair of mathematics at Padua. He remained in this chair until his death in\n1697\n.\nAngeli's many mathematical works were on\ninfinitesimals\nand he used them to study spirals,\nparabolas\nand\nhyperbolas\n. While in Venice he published\nDe infinitorum parabolis\nⓉ\n(\nOn infinite parabolas\n)\n(1654)\n,\nDe infinitorum spiralium spatiorum mensura\nⓉ\n(\nMeasuring an infinite spiral\n)\n(1660)\nwhich contains a generalisation of\nArchimedes\n' spiral, and\nDe infinitorum cochlearum mensuris ac centris gravitatis\nⓉ\n(\nMeasurement of an infinite cochlea and its center of gravity\n)\n(1661)\nwhich carries out\nTorricelli\n's intention of finding the centre of gravity of a solid body called a cochlea. The approach followed by Angeli in all these works is that of his teacher\nCavalieri\nand of\nTorricelli\n, so when\nGuldin\nand\nTacquet\nattacked these methods and defended the approach of the ancient Greeks, Angeli disputed with them over indivisibles. One has to see both sides in this argument for although Angeli's methods were much more powerful, they were less rigorous than the method of exhaustion adopted by\nArchimedes\n. The gist of the argument is contained in the introduction to\nDe infinitorum parabolis\nⓉ\n(\nOn infinite parabolas\n)\n[\n1\n]\n:-\nTo those who opposed\nCavalieri\n's method by asserting that the continuous is not composed of indivisibles, Angeli replied, in agreement with his master, that the method in question does not depend on the composition of the continuous.\nAngeli examined fluid statics based on\nArchimedes\n' principle and\nTorricelli\n's experiments. He published\nDella gravita dell aria e fluidi\nin\n1671\nwhile holding the chair at Padua. He also considered the motion bodies falling towards a rotating Earth. Of course Angeli held the chair at Padua which had been held earlier by\nGalileo\nand his work shows strong influences from his predecessor. For example Angeli often refers to\nGalileo\nin his writings on physics, showing clearly how he has been influenced, particularly in terms of ways of approaching problems via the experimental method. Also clearly influenced by\nGalileo\nis Angeli's writings on the two systems of\nPtolemy\nand\nCopernicus\nwhich he writes in\nGalileo\n's dialogue style."
}