{
  "nome_completo": "Steven Vajda",
  "nome_curto": "Steven Vajda",
  "ano_nascimento": "1901",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vajda/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Brighton, Sussex, England",
  "biografia": "Steven Vajda\ndoes not sound Hungarian and, indeed, he was given the name\nIstván\nbut used the name Steven after he moved to England. His parents, who were both born in Vienna, were Josef Vajda and Aurelia Wollak. Josef was a travelling salesman selling handkerchiefs and the family were not well-off. He had an older sister who died in infancy and a younger sister, Ilonka. In\n1903\n, when he was sixteen months old, his family moved from Budapest to Vienna and he was brought up in the Austrian capital. He was known at this time as\nStefan Vajda\nand some friends continued to use this version of his name. He attended primary school in that city and his outstanding performance earned him a place to study at the prestigious Akademisches\nGymnasium\n. In the Gymnasium he excelled at all his subjects but showed a special aptitude for mathematics, languages and European history. As recreation, he loved playing soccer and also was a keen boy scout.\nAfter graduating from the Akademisches Gymnasium, Vajda enrolled an engineering course in the Vienna Technical University. In fact he had not intended to go to university, believing that this was beyond his family's financial means. However, Austria had undergone hyperinflation following World War I and, as consequence of this, the cost of higher education had become more affordable. However, he soon discovered that engineering did not excite him and he quickly changed to a two-year actuarial course. However, this was a period when Austria was suffering from financial and economic instability, with the country being supported with international aid and loans. Employment was very hard to find and, indeed, Vajda was unable to find a job after completing the actuarial course so he decided to continue his education and enrolled to study for a mathematics degree at the University of Vienna. There were excellent mathematicians at Vienna at this time with\nWilhelm Wirtinger\nholding a chair,\nHans Hahn\nbeing appointed to a chair in\n1921\n, and\nEduard Helly\nbeing appointed as a lecturer in the same year. Having completed a\n3\n-year degree, Vajda remained at the University of Vienna undertaking research for his doctorate. This was awarded in\n1925\n.\nAfter the award of his doctorate, Vajda spend one semester at Göttingen attending lectures by\nDavid Hilbert\n,\nRichard Courant\n,\nEmmy Noether\n,\nBartel van der Waerden\nand others. Returning to Vienna, Vajda was still unable to obtain a job but\nvan der Waerden\nwas able to direct him towards an actuarial position in Braila, Romania. He worked there for\n18\nmonths before returning to Vienna to a position with the Phönix Insurance Company. In\n1929\nhe married Eva Paulina Fanta\n(1906\n-\n1983)\n, the daughter of a bank manager; they had two children, a daughter Hedy\n(\nborn\n1930)\nand a son Robert\n(\nborn\n1933)\n. These years in Vienna were ones in which Vajda joined in the high level of intellectual activity which was taking place in that city. Largely this was centred on the Vienna Circle where the philosophy of science was the main topic of interest. Meetings of those interested in philosophy in Vienna began around\n1910\nwith the main participants being\nHans Hahn\n,\nPhilipp Frank\nand the economist Otto Neurath. After\n1922\nmeetings became more regular when Moritz Schlick, the professor of philosophy at the University of Vienna, became leader of the group.\nKurt Gödel\njoined the meetings after becoming a student at the University of Vienna in\n1924\n. As well as being influenced by members of this group, Vajda also became friendly with Karl Popper who was studying philosophy and psychology in Vienna.\nOn\n12\nMarch\n1938\nGerman troops marched into Austria and, on the following day, Austria was declared part of Germany. Largely the Germans were rapturously welcomed in Vienna by the Austrians but Vajda and his family saw that they had to leave as rapidly as possible. Hedy, now aged\n8\n, and Robert, now aged\n5\n, were sent to Sweden while Vajda and his wife tried to make arrangements to leave. First Eva left for Sweden where she joined her children and the three of them then went to England where Eva took a job in domestic service in Epsom. Vajda was keen to join his family in England but was unable to obtain a visa. Karl Popper had left Vienna in\n1937\nwhen he obtained a professorship in philosophy in Christchurch, New Zealand. Vajda contacted him and Popper was able to arrange for Vajda to be offered a position in New Zealand. He accepted the position which meant that he could now obtain a temporary visa to enter England. He arrived in England and joined his wife and children there around the beginning of June\n1939\n. The family planned to sail to New Zealand and Vajda began to make the necessary arrangements. However, on\n1\nSeptember\n1939\n, German troops entered Poland and on the following day Britain declared war on Germany. Vajda coming from Vienna was now an enemy alien so he could not continue with his plans to go to New Zealand but was sent to an internment camp on the Isle of Man. His family, however, were not considered a threat and were allowed to remain in Epsom.\nAfter six months in the internment camp, during which time he taught mathematics in a makeshift university that the refugees had set up, the authorities realised that Vajda was not a danger to the British and he was released. He was offered a job at the Gresham Insurance Company, located near Epsom, which he gladly accepted. In fact this was a lucky break for he should have had a stamp on his passport forbidding him from working in England but the officials in Vienna had forgotten to put the stamp on before he had left the country. His exceptional actuarial skills were plain for all to see from over a dozen publications that had already appeared such as\nFundamentalsätze aus der mathematischen Theorie der Bausparkassen\nⓉ\n(\nFundaments of the mathematical theory of building societies\n)\n(1932)\n,\nBausparvertrag und Levensversicherung\nⓉ\n(\nBuilding societies and life insurance\n)\n(1932)\n,\nDer derzeitige Stand der Bausparmathematik\nⓉ\n(\nThe present state of the building society mathematics\n)\n(1933)\n,\nDie Fachberatungen des Bausparkassenkongress\nⓉ\n(\nTechnical discussions of Building Society Congress\n)\n(1935)\nand\nDie Beurteilung der Sterblichket in der Lebensversicherun\nⓉ\n(\nAssessing mortality in life insurance\n)\n(1936)\n. In\n1944\n, when the Admiralty was setting up a new department of statistics to work on methods of maximising their use of resources in the war in the Pacific, Vajda was an obvious person to invite to join them. He worked for the Admiralty, first as a statistician, then as assistant head of physical research. As soon as the war was over he was granted British citizenship and a British passport.\nVajda had left his parents in Vienna and his younger sister Ilonka living in Prague, married to a Czechoslovakian, when he fled in\n1939\n. He had been unable to contact them during the war but, after the war ended, he made strenuous efforts to trace them. Sadly he learnt that both his parents had died during the war; his father Josef had died of pneumonia in a concentration camp while his mother Aurelia was murdered in a gas chamber. He never managed to trace his sister Ilonka. In\n1949\nVajda became assistant director of\noperational research\nfor the Admiralty, becoming head of the Mathematics Group at the Admiralty Research Laboratory at Teddington in\n1952\n. He continued to publish actuarial papers such as\nThe analysis of variance of mortality rates\n(1946)\n, and\nAnalytical studies in stop-loss reinsurance\n(1951)\n. In\n1965\n, at the age of sixty-four, Vajda retired from the Admiralty but he was appointed as Professor of Operational Research at the University of Birmingham. At an age when most people are about to retire, Vajda was beginning his academic career. He gave his inaugural address at the University of Birmingham entitled\nA mathematician looks at Operational Research\n.\nHis appointment to Birmingham was, in many ways, recognition for the contributions he had made there over many years. In\n1955\nhe had established a regular one-week residential course on linear programming on the University's Southfield campus. He advised the University on their Master's courses and to recognise these contributions, in\n1958\n, he had been made an honorary lecturer. Although formally Vajda was about to begin a university career in\n1965\n, he had already published a number of books on the topics for which he has become famous, namely the Theory of Games and Linear Programming. In fact one of his important contributions was his realisation that these two topics were closely connected and together led to a wide variety of applications. The books which had already brought him international recognition in these areas were\nTheory of Games and Linear Programming\n(1956)\n,\nReadings in Linear Programming\n(1958)\n,\nIntroduction to Linear Programming and the Theory of Games\n(1960)\nand\nMathematical Programming\n(1961)\n.\nFor reviews of these books by Vajda see:\nTHIS LINK\nAt the University of Birmingham Vajda set up a group in the Engineering Production Department and spent three years as Professor of Operational Research before he retired in\n1968\n. At this time Birmingham made him a senior research fellow and he remained at Birmingham in that role for the next five years. However, in\n1973\n, he was invited by Pat Rivett to the University of Sussex where he became a visiting professor. Although he was\n72\nyears old when he went to Sussex, remarkably he continued to teach and undertake research there for over\n20\nyears. John Bather writes in\n[\n5\n]\nthat, at Sussex, Vajda:-\n... worked enthusiastically as a teacher and supervisor of research projects in both Operational Research and Statistics groups. His penetrating questions were a regular feature of our seminars.\nAt Sussex, Vajda became a colleague of\nWalter Ledermann\nwho, although ten years younger, had suffered similar wartime experiences.\nLedermann\nand Vajda jointly edited most of the core volumes in the\nHandbook of Applicable Mathematics\nseries.\nLedermann\ntold us:-\nSteven Vajda and I published a paper on a statistical question of interest to him. When the paper appeared in print, Steven was ninety years old and I had passed my eightieth birthday. Perhaps it is not surprising that henceforth our productivity was declining ...\nThis paper was\nOn a problem in population structure\n(1992)\n. Petr Kurka wrote in a review:-\nThe authors consider a linear age-structure model, which yields nonnegative square matrices with the following properties: each column sum is equal to unity, the first row is strictly positive, the first subdiagonal is strictly positive, and all other entries are zero. The authors investigate the speed of convergence of the powers of matrices of this type.\nVajda received many honours for his contributions. He was awarded honorary degrees from Brunel University\n(1971)\nand the University of Budapest\n(1975)\n. The British Operational Research Society made him an honorary member in\n1986\n, and issued a special part of the\nJournal of the Operational Research Society\nin his honour in\n1992\n(\nsee Brian Conolly's Editorial\n[\n17\n]\n)\n. On\n10\nFebruary\n1995\nhe was given the award of Companion of Operational Research by the Operational Research Society.\nThe citation is at\nTHIS LINK\n.\nHe was also made an honorary member of the Institute of Actuaries.\nHe remained active both mentally and physically, even into his\n90\ns. Jakob Krarup writes\n[\n43\n]\n:-\nWith an amazing mobility, Steven remained a frequent traveller to conferences and symposia. Insight and an implacable curiosity marked his active contributions as a lecturer or discussant. Likewise, no effort was spared outside the conference halls. Not even the extremely hot weather in Israel in July\n1995\ndiscouraged Steven from taking part in the physically demanding\n2\n-days' excursion to Galilee organized in conjunction with EURO XIV conference. Not a single detail was missed, let alone the celebrations of EURO's\n20\nth\nAnniversary. The organizers of the conference were honoured to have him as the oldest participant ever at a EURO event. It is a gift of grace to shuffle off this mortal coil after having enjoyed a long life without suffering the physical horrors of old age and even more so to preserve both a warm heart and a brilliant mind to the end. Those gifts were granted to Steven Vajda, still teaching and writing in his\n94\nth\nyear before he passed away after a short illness ... As the panegyric at his funeral noted, he had the capacity to make everyone he met believe that they were his friend.\nLet us end with the following summary of Vajda's mathematical contributions by H P Williams\n[\n79\n]\n:-\nA major achievement of Steven Vajda was to explain the implications of duality in a wide variety of seemingly unrelated contexts, e.g. combinatorics and graph theory, flows in networks, game theory, and economics. . . . Perhaps most surprising is its applications to certain problems in combinatorics, e.g.\nMenger\n's theorem and the König-Egerváry theorem since these problems belong to the realm of discrete mathematics and superficially appear to have nothing to do with the continuous mathematics of Linear Programming. Of course, when these problems are cast in a Linear Programming form, the optimal solutions are integral, which results in the relevance of Linear Programming."
}