{
  "nome_completo": "Sylvia de Neymet",
  "nome_curto": "Sylvia de Neymet",
  "ano_nascimento": "1938",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Neymet/",
  "lugar_nascimento": "Mexico City, Mexico",
  "lugar_morte": "Mexico City, Mexico",
  "biografia": "Sylvia de Neymet\nwas known as\nSylvia de Neymet Urbina\nuntil she married in\n1962\nbeing known as\nSilvia de Neymet de Christ\nfrom that time onwards. She was the daughter of Agustín de Neymet Leger\n(1902\n-\n1980)\nand Inés Urbina del Raso. Agustín de Neymet was born on\n16\nAugust\n1902\nin Mexico City, the son of Agustin de Neymet\n(1867\n-\n1954)\nand Ernestina Leger\n(1865\n-\n1947)\nwho was a well-known teacher at the Colegio de las Vizcaínas in Mexico City. Agustín de Neymet, Sylvia's father, became a civil engineer and, for his first job, he had to travel by train from Mexico City every day. On the same train was Inés Urbina who had lost her father at a young age in the Mexican Revolution of\n1910\n. Inés had been encouraged by her mother to attend normal school and then took a teaching job in Santiaguito travelling by train every day from the centre of Mexico City. She also studied at the La Esmeralda art school in Mexico City and became a sculptor. Agustín and Inés married and lived in San José Insurgentes, a district of Mexico City, in a house full of art, plants and interesting conversations. Sylvia and her siblings, who included Rosa Maria De Neymet Urbina\n(\nborn\n31\nMay\n1936)\n, were brought up in that house at\n58\nRodrico Cifuentes.\nAgustín de Neymet, Sylvia's father, had an impressive career. He was a member of the National Irrigation Commission and Head of Construction of the Valley of Mexico Works of the Hydraulic Resources Secretariat. He twice served as President of the Association of Engineers and Architects of Mexico and for almost\n40\nyears he served as Director of the\nHydraulic Resources Journal\n. He founded several companies including the concrete additives company Duro Rock in\n1941\n.\nSylvia's parents strongly supported her education and she attended both elementary school and the Women's University of Mexico in Mexico City. Her experiences at elementary school were not too positive because she was not taught to think about problems, only to solve them using memorised procedures which were not justified. Her mother, however, helped her to understand and to think. At the Women's University her experiences were much better. The Women's University, also a high school, had been founded by Adela Formoso de Obregón Santacilia, wife of the architect Carlos Obregón Santacilia, in\n1943\n. As well as founding the Women's University, Adela Formoso was its first director. It\n[\n9\n]\n:-\n... became a centre of very profound intellectual development. The cultural evenings on Fridays included characters such as Juan José Arreola, Nabor Carrillo, etc. Art, science and culture on the lips of their creators, was disseminated among these young people giving them the most current ideas of the time. At this high school, Sylvia had one of her dearest friends, Alejandra Jaidar ...\nAt the Women's University, Sylvia was taught trigonometry by\nManuela Garín\nwho showed her that mathematics was fun and reasoning was a pleasure. Later in her studies she was taught mathematics by the excellent teacher Teresa Sánchez de Padilla and by this time Sylvia knew that she wanted to make a career in the topic.\nAt the age of seventeen, in\n1955\n, Neymet entered the Faculty of Sciences of the Universidad Nacional Autónoma de México\n(\nUNAM\n)\n. The Faculty of Sciences had been created at the UNAM at the end of\n1938\nand began to function in\n1939\nwith the structure: Department of Mathematics, Department of Physics and Department of Biology. The UNAM had been founded on a site in the centre of Mexico City and from the start of the\n1930\ns it became clear that if the university was to continue to expand it required a much larger campus which would have to be on the outskirts of the city. In\n1945\nthe University acquired land in the Coyoacán district in the southern part of Mexico City. There were various delays but the new university site began operating two years before Neymet began her studies.\nHer first-year lecturers were\nAlberto Barajas Celis\n, Guillermo Torres,\nAlfonso Nápoles Gándara\n,\nCarlos Graef Fernández\nand\nRoberto Vázquez\n. She studied Selected Topics in Physics with Juan de Oyarzábal. She also had physical practical sessions organised by Juan Manuel Lozano in the physics laboratory. In\n1958\n, when she was in her fourth year and still only nineteen years old,\nNápoles Gándara\n, who was the director of the Faculty of Sciences, asked her if she would like to teach evening classes at Escuela Nacional Preparatoria\n3\n, a High School attached to the NUAM. Neymet thought this was a great opportunity and an honour, and accepted immediately. Students attending evening classes were mostly mature students older that the young Neymet. The class she was assigned to teach had also gained quite a reputation as being challenging\n[\n9\n]\n:-\nWhen she arrived, the first thing she knew was that her future students had just had her predecessor fired by going on strike. And the same afternoon that she talked to the director about teaching a class like that, without further ado, they sent her to give her first lesson. The first thing she received from the students was a complaint for having exchanged, on the way to class, the room on the ground floor they had been assigned for another on the first floor which had belonged to a teacher with walking problems. It must be said that almost all of her students were older than Sylvia. So every afternoon she would put on the most serious outfit she could find and come to teach her class. At her home her family laughed at her 'serious teacher disguise'.\nThat year,\n1958\n, there were many major strikes in Mexico. In particular, there was a student strike against the rise in the price of transportation. The students from Escuela Nacional Preparatoria\n3\norganised groups, made propaganda and called for a demonstration in the Zócalo\n(\nthe main square of Mexico City\n)\n. Of course, they invited their beloved teacher: \"we're going for you and we'll take care of you all the way, teacher.\"\nNearing the end of the course, the students asked Sylvia to teach them Calculus the following year. But she was about to go to Paris and she couldn't do it. The day of the last examination all the students arrived in suits, very handsome. In the end they told Sylvia that they invited her to have a taquito. They, the most forward, the ones with a reputation for being rude and vandals, had reserved a table for their teacher and had hired a mariachi band to say goodbye to her.\nDuring the year she was teaching evening classes at the Escuela Nacional Preparatoria\n3\n, she was writing an undergraduate thesis on differential equations advised by\nSolomon Lefschetz\n. He had been coming to Mexico since\n1944\nand, after he retired from Princeton in\n1954\n, he spent long periods at the Institute of Mathematics in Mexico City. With help from\nLefschetz\n, Neymet had been awarded a two-year scholarship by the French government to study in Paris and left after completing her undergraduate studies but before she graduated. On\n13\nNovember\n1958\nshe flew from Mexico City to New York on her way to Paris. For her first year in Paris she lived in the Alliance Française close to the Jardin du Luxembourg. This was founded in\n1883\nand welcomed students from around the world to offer French courses and make French culture better known. In her second year she lived at the Casa de México, part of the Cité Internationale Universitaire de Paris. It was a student residence for postgraduate students enrolled in a higher education institution in Paris. In Paris, Neymet studied at the Institut\nHenri Poincaré\n, the centre for teaching and scientific research on mathematical and theoretical physics in the Faculty of Sciences of the University of Paris. There she took courses by\nCharles Ehresmann\non Differential Topology, Algebraic Topology and Category Theory. She also participated in the Séminaire\nHenri Cartan\n, mostly led by\nHenri Cartan\nand his student Adrien Douady.\nAfter her two years of study in Paris, she returned to Mexico, flying via New York where she arrived on\n10\nOctober\n1960\nand stayed at the Taft Hotel. While in the United States, she visited Princeton where she met\nRalph Hartzler Fox\n,\nJohn Willard Milnor\nand Christos Dimitriou Papakyriakopoulos\n(1914\n-\n1976)\n.\nRalph Fox\nand J\nohn Milnor\nhad strong connections with Mexico.\nFox\nhad given a series of lectures at the Mathematics Institute in Mexico City in\n1951\nand, along with\nMilnor\n, had attended the International Symposium on Algebraic Topology organised by\nJosé Adem\n,\nAlberto Barajas\n,\nSolomon Lefschetz\n, Emilio Lluis,\nAlfonso Nápoles Gandara\n,\nFélix Recillas\n, Guillermo Torres and\nRoberto Vázquez\nat the Universidad Nacional Autónoma de México in August\n1956\n. It should be noted that Neymet visiting Princeton was a bold move given that it was exclusively male at that time and this shows something of her personality.\nNeymet, having completed her undergraduate studies before going to Paris, graduated in\n1961\nand taught in the Faculty of Sciences. While she had been in Paris she had become friends with Michel C C Christ, an anesthesiologist. He had been born on\n8\nApril\n1932\nin Metz, France. He followed her to Mexico, passing through New York on\n23\nDecember\n1961\n. They married in April\n1962\n[\n9\n]\n:-\nTogether they shared adventures of all kinds: fishing, diving, radio amateurs and the most demanding of all adventures, having children.\nThey had three children; Simone Sylvie Christ de Neymet\n(\nborn\n1963)\n, Martine Lorraine Christ de Neymet\n(\nborn about\n1964)\nand Pierre Michel Christ de Neymet\n(\nborn\n1966)\n.\nOn\n19\nApril\n1961\n, Cinvestav, the Centre for Research and Advanced Studies of the National Polytechnic Institute, was founded as a postgraduate department of the National Polytechnic Institute. The professors in the Department of Mathematics when it was founded were\nJosé Ádem\n(\nHead of Department\n)\n,\nSamuel Gitler\n(\nAdjunct Professor\n)\n, Carlos Ímaz\n(\nAdjunct Professor\n)\nand\nFrançois Bruhat\n(\nVisiting Professor\n)\nwhile Neymet was appointed as an Instructor, She undertook postgraduate studies at Cinvestav advised by\nJosé Adem\nand\nSamuel Gitler\n, and also taught advanced courses such as Homological Algebra and Mathematical Analysis in the School of Physics-Mathematics of the National Polytechnic Institute. On\n22\nJanuary\n1964\nshe graduated with a Master's Degree from the Department of Mathematics Cinvestav. Two years later she was awarded a doctorate for her thesis;\nSamuel Gitler\nhad been her official advisor but she had also been helped by\nJosé Adem\n. With the award of this degree, Neymet became the first Mexican woman to be awarded a Ph.D. in mathematics.\nAfter graduating with her doctorate, in\n1966\nNeymet was appointed as one of only three professors in the Department of Mathematics of the Universidad Nacional Autónoma de México; the other two were\nVíctor Neumann-Lara\nand Arturo Fregoso Urbina who had been awarded a Ph.D. from Indiana University for his thesis\nLocal Categories\nin\n1963\n. For some years Neymet concentrated on teaching and did little in the way of research. Having three young children to look after and teaching full-time meant she had no time for research. Later in her career, however, she became an active researcher, publishing papers and presenting talks at national and international conferences. Here is a list of her papers: Sylvia de Neymet de Christ,\nSome relations in Whitehead torsion\n(\nSpanish\n)\n(1967)\n; Sylvia de Neymet de Christ and\nFrancisco Javier González-Acuña\n,\nA generalisation of Fox's notion of spread\n(\nSpanish\n)\n(1981)\n; Sylvia de Neymet de Christ and\nFrancisco Javier González-Acuña\n,\nA generalisation of Fox's spread completion\n(1982)\n(\nLecture given at the Symposium on Algebraic Topology in honour of\nJosé Adem\nin Oaxtepec,\n1981)\n; Sylvia de Neymet,\nClifford algebras and geometries\n(\nSpanish\n)\n(1991)\n(\nLecture given at the XXIIIrd National Congress of the\nMexican Mathematical Society\nin Guanajuato,\n1990)\n; Sylvia de Neymet and Rolando Jiménez,\nG-overlays\n(1995)\n(\nLecture given at Topology with applications in Szekszárd,\n1993)\n; Sylvia de Neymet Urbina,\nCovering actions\n(\nSpanish\n)\n(1995)\n(\nLecture given at the XXVII National Congress of the\nMexican Mathematical Society\nin Queretaro,\n1994)\n; Rolando Jiménez and Sylvia de Neymet,\nUnion of equivariant extensors and equivariant covering spaces\n(2000)\n; Sergey A Antonyan, Rolando Jiménez and Sylvia de Neymet,\nFiberwise retraction and shape properties of the orbit space\n(2000)\n; and Sergey A Antonyan and Sylvia de Neymet, I\nnvariant pseudometrics on Palais proper G-spaces\n(2003)\n.\nNeymet was due to retire after reaching the age of\n65\nin February\n2003\nbut, sadly, she died one month before that date while she was preparing for retirement\n[\n8\n]\n:-\n... she has taught in more than fifty courses at the Faculty, has directed bachelor's and master's theses, has been an examiner\n(\nin professional, master's and doctoral examinations\n)\n, has given lectures at national and international congresses, has participated in commissions of the Department of Mathematics of the Consejo Nacional de Ciencia y Tecnología, has been a member of the Board of Directors of the Mexican Mathematical Society, has taught courses at provincial universities, has published research articles and, recently, has devoted her efforts to writing of a book on group actions that will soon be published by the\nMexican Mathematical Society\n.\nThe book referred to in this quote is\nIntroducción a los grupos topológicos de transformaciones\nⓉ\n(\nIntroduction to topological groups of transformations\n)\nand it was published in\n2005\n, two years after Neymet died. The Publisher writes\n[\n6\n]\n:-\nSymmetries in topological spaces are an additional structure that enriches their study and allows us to refine the statements made about such spaces. These symmetries are formulated in the language of group actions. In general, groups that act on a topological space are also considered to have a topological structure that transforms them into topological groups. Spaces with symmetries, or topological transformation groups, arise in a natural way in theoretical physics and in many branches of mathematics. This book presents the topology of G-spaces in a systematic and orderly way and is a noteworthy contribution to the bibliography of advanced mathematics in Spanish.\nWe end with six comments about Sylvia de Neymet.\nComment by\nManuela Garín\n[\n5\n]\n:-\n... the good thing is that I got Sylvia de Neymet as a student. Very pretty and a very good student, because the rest were \"waiting to get married\" girls who were at the university because their mothers sent them and Sylvia was definitely not. She was also a very pleasant person to deal with, she talked a lot with me when I left classes, and her participation in them made clear the depth of her thought, her questions were precise and interesting.\nComment by Isabel Puga\n[\n2\n]\n:-\nI once travelled with her to Hungary, in\n1993\n, to a congress and as a roommate she was ideal, she was very respectful, very prudent. You felt comfortable with her, she was easy to deal with, very fine and rarely got angry. It was to her great merit that being a woman and being in the mathematical environment that was there in its beginning, to do her doctorate and have an academic career. She is the first doctor in Mathematics and is the first woman to do an academic career in Mathematics, and stay to work at a university, to do research in Mathematics.\nComment by Angel Tamariz Mascarúa\n[\n2\n]\n:-\nWe were partners in many congresses, academic commissions and seminars. She was one of the first full-time professors in this Mathematics department. We had a great relationship, because we worked on the same thing and we established a relationship of friendship forever. I never heard any gossip or negative comments about anyone from her, she was a person who was highly esteemed herself and therefore esteemed others as well.\nComment by María de la Paz Álvarez Scherer\n[\n2\n]\n:-\nThe crucial moment of our friendship was the congress in Guanajuato in\n1990\n. Pilar Martínez, Mariana Saiz and I travelled in Sylvia's car; there any ice was broken and we discovered that behind the serious and formal, Sylvia hid a funny woman, joyful and talkative. Sylvia and I shared a room and whole nights of the most delicious conversation. It was two in the morning and we said to each other 'well, now - tomorrow we will continue talking', we turned off the light, and it was enough for one of us to say 'but ... ' so that the light would come on and the talk would go on hour after hour.\nComment by María de la Paz Álvarez Scherer\n[\n9\n]\n:-\nWe worked together and it was wonderful to be her friend. We paid her a tribute shortly before she retired and, precisely while she was carrying out the retirement procedures, she passed away.\nComment by María de la Paz Álvarez Scherer\n[\n9\n]\n:-\nIn one way or another, although Sylvia was not my teacher during my undergraduate degree, she was always present: Sylvia, when she greets you, is not being \"kind\" in the formal sense of the word: she is greeting you. When she asks you how you are, how things are going, your subjects, how your new assistantship is going, how your pregnancy is going, how your babies are, she is telling you that she shares it, that even though you have never talked to her, she is with you.\nIt was later, in my master's degree, that we really met and I have enjoyed knowing Sylvia ever since. She is the most enthusiastic and passionate person about geometry, topology, and beautiful examples. The hyperbolic geometry seminar in which we participated excited her enormously. There I discovered another part of her personality; her secret identity: Sylvia is \"the fastest chalk in the West\" ... no proof stands up to her ... an hour is more than enough to unravel the most terrible secrets of any theorem ... it is very difficult to discern what goes faster: chalk, her words, the ideas or the relentless draft ... it is impressive and exhausting. Leaving the seminar it was only possible to share a peaceful coffee."
}