{
  "nome_completo": "Niccolò Tartaglia",
  "nome_curto": "Tartaglia",
  "ano_nascimento": "1500",
  "ano_morte": "1557",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tartaglia/",
  "lugar_nascimento": "Brescia, Republic of Venice (now Italy)",
  "lugar_morte": "Venice, Republic of Venice (now Italy)",
  "biografia": "Niccolò Fontana\n, known as\nTartaglia,\nwas born in Brescia in\n1499\nor\n1500\n, the son of an honest mail rider Michele Fontana who was known as 'Micheletto the Rider'. Micheletto would ride his horse between Brescia and other towns in the district making deliveries. Although he was poor, Micheletto did his best for his wife, daughter and two sons, and Niccolò attended school from the age of about four years. Life might have been very different for Niccolò had tragedy not come when he was six years old, for at that time his father was murdered while out making deliveries. From being a child in a poor family, he was suddenly plunged into total poverty.\nNiccolò was nearly killed as a teenager when, in\n1512\n, the French captured his home town and put it to the sword. The French army was commanded by Gaston de Foix and they had suffered humiliation at the hands of some determined Brescia militia. They decided to teach the local inhabitants a lesson and retook Brescia during seven days of fighting in which time\n46\n,\n000\nresidents of the city were killed in an act of revenge. Amidst the general slaughter, the twelve year old Niccolò took refuge in the cathedral with his mother and younger sister, but was dealt horrific facial sabre wounds by a French soldier that cut his jaw and palate. He was left for dead and even when his mother discovered that he was still alive she could not afford to pay for any medical help. However, his mother's tender care ensured that the youngster did survive, but in later life Niccolò always wore a beard to camouflage his disfiguring scars and he could only speak with difficulty, hence his nickname Tartaglia, or stammerer.\nTartaglia was self taught in mathematics but, having an extraordinary ability, his mother was able to find him a patron. Ludovico Balbisonio took him to Padua to study there, but when he returned with his patron to Brescia he made himself unpopular by having an inflated opinion of himself. He left Brescia to earn his living teaching mathematics at Verona which he did between\n1516\nand\n1518\n. Later, still in Verona, he taught at a school in the Palazzo Mizzanti but it is recorded that at that time he was married with a family, yet was very poor. He moved to Venice in\n1534\n. As a lowly mathematics teacher in Venice, Tartaglia gradually acquired a reputation as a promising mathematician by participating successfully in a large number of debates.\nThe first person known to have solved\ncubic equations\nalgebraically was\ndel Ferro\nbut he told nobody of his achievement. On his deathbed, however,\ndel Ferro\npassed on the secret to his\n(\nrather poor\n)\nstudent Fior. For mathematicians of this time there was more than one type of cubic equation and Fior had only been shown by\ndel Ferro\nhow to solve one type, namely 'unknowns and cubes equal to numbers' or\n(\nin modern notation\n)\nx\n3\n+\na\nx\n=\nb\nx^{3} + ax = b\nx\n3\n+\na\nx\n=\nb\n. As negative numbers were not used this led to a number of other cases, even for equations without a square term. Fior began to boast that he was able to solve cubics and a challenge between him and Tartaglia was arranged in\n1535\n. In fact Tartaglia had also discovered how to solve one type of cubic equation since his friend Zuanne da Coi had set two problems which had led Tartaglia to a general solution of a different type from that which Fior could solve, namely 'squares and cubes equal to numbers' or\n(\nin modern notation\n)\nx\n3\n+\na\nx\n2\n=\nb\nx^{3} + ax^{2} = b\nx\n3\n+\na\nx\n2\n=\nb\n. For the contest between Tartaglia and Fior, each man was to submit thirty questions for the other to solve. Fior was supremely confident that his ability to solve cubics would be enough to defeat Tartaglia but Tartaglia submitted a variety of different questions, exposing Fior as an, at best, mediocre mathematician. Fior, on the other hand, offered Tartaglia thirty opportunities to solve the 'unknowns and cubes' problem since he believed that he would be unable to solve this type, as in fact had been the case when the contest was set up. However, in the early hours of\n13\nFebruary\n1535\n, inspiration came to Tartaglia and he discovered the method to solve 'squares and cubes equal to numbers'. Tartaglia was then able to solve all thirty of Fior's problems in less than two hours. As Fior had made little headway with Tartaglia's questions, it was obvious to all who was the winner. Tartaglia did not take his prize for winning from Fior, however, the honour of winning was enough.\nAt this point\nCardan\nenters the story. As public lecturer of mathematics at the Piatti Foundation in Milan, he was aware of the problem of solving cubic equations, but, until the contest, he had taken\nPacioli\nat his word and assumed that, as\nPacioli\nstated in the\nSumma\nⓉ\n(\nSummary of arithmetic, geometry, proportion and proportionality\n)\npublished in\n1494\n, solutions were impossible.\nCardan\nwas greatly intrigued when Zuanne da Coi told him about the contest and he immediately set to work trying to discover Tartaglia's method for himself, but was unsuccessful. A few years later, in\n1539\n, he contacted Tartaglia, through an intermediary, requesting that the method could be included in a book he was publishing that year. Tartaglia declined this opportunity, stating his intention to publish his formula in a book of his own that he was going to write at a later date.\nCardan\n, accepting this, then asked to be shown the method, promising to keep it secret. Tartaglia, however, refused.\nAn incensed\nCardan\nnow wrote to Tartaglia directly, expressing his bitterness, challenging him to a debate but, at the same time, hinting that he had been discussing Tartaglia's brilliance with the governor of Milan, Alfonso d'Avalos, the Marchese del Vasto, who was one of\nCardan\n's powerful patrons. On receipt of this letter, Tartaglia radically revised his attitude, realising that acquaintance with the influential Milanese governor could be very rewarding and could provide a way out of the modest teacher's job he then held, and into a lucrative job at the Milanese court. He wrote back to\nCardan\nin friendly terms, angling for an introduction to the Signor Marchese.\nCardan\nwas delighted at Tartaglia's new approach, and, inviting him to his house, assured Tartaglia that he would arrange a meeting with d'Avalos.\nSo, in March\n1539\n, Tartaglia left Venice and travelled to Milan. To Tartaglia's dismay, the governor was temporarily absent from Milan but\nCardan\nattended to his guest's every need and soon the conversation turned to the problem of cubic equations.  Tartaglia, after much persuasion, agreed to tell\nCardan\nhis method, if\nCardan\nwould swear never to reveal it and furthermore, to only ever write it down in code so that on his death, nobody would discover the secret from his papers. This\nCardan\nreadily agreed to, and Tartaglia divulged his formula in the form of a poem, to help protect the secret, should the paper fall into the wrong hands. Anxious now to leave\nCardan\n's house, he obtained from his host, a letter of introduction to the Marchese and left to seek him out. Instead though, he turned back for Venice, wondering if his decision to part with his formula had been a mistake.\nBy the time he had reached Venice, Tartaglia was sure he had made a mistake in trusting\nCardan\nand began to feel very angry that he had been induced to reveal his secret formula.\nCardan\npublished two mathematical books later that year and, as soon as he could get copies, Tartaglia checked to make sure his formula was not included. Though he felt a little happier to find that the formula was not included in the texts, when\nCardan\nwrote to him in a friendly manner Tartaglia rebuffed his offer of continued friendship and mercilessly ridiculed his books on the merest trivialities.\nBased on Tartaglia's formula,\nCardan\nand\nFerrari\n, his assistant, made remarkable progress finding proofs of all cases of the cubic and, even more impressively, solving the\nquartic equation\n. Tartaglia made no move to publish his formula despite the fact that, by now, it had become well known that such a method existed. Tartaglia probably wished to keep his formula in reserve for any upcoming debates.\nCardan\nand\nFerrari\ntravelled to Bologna in\n1543\nand learnt from della Nave that it had been\ndel Ferro\n, not Tartaglia, who had been the first to solve the cubic equation.\nCardan\nfelt that although he had sworn not to reveal Tartaglia's method surely nothing prevented him from publishing\ndel Ferro\n's formula. In\n1545\nCardan\npublished\nArtis magnae sive de regulis algebraicis liber unus\nⓉ\n(\nThe great art of algebraic rules in one book\n)\n, or\nArs magna\nⓉ\n(\nThe great art\n)\nas it is more commonly known, which contained solutions to both the cubic and\nquartic equations\nand all of the additional work he had completed on Tartaglia's formula.\nDel Ferro\nand Tartaglia are credited with their discoveries, as is\nFerrari\n, and the story written down in the text.\nTartaglia was furious when he discovered that\nCardan\nhad disregarded his oath and his intense dislike of\nCardan\nturned into a pathological hatred. The following year Tartaglia published a book,\nNew Problems and Inventions\nwhich clearly stated his side of the story and his belief that\nCardan\nhad acted in extreme bad faith. For good measure, he added a few malicious personal insults directed against\nCardan\n.\nArs Magna\nⓉ\n(\nThe great art\n)\nhad clearly established\nCardan\nas the world's leading mathematician and he was not much damaged by Tartaglia's venomous attacks.\nFerrari\n, however, wrote to Tartaglia, berating him mercilessly and challenged him to a public debate. Tartaglia was extremely reluctant to dispute with\nFerrari\n, still a relatively unknown mathematician, against whom even a victory would do little material good. A debate with\nCardan\n, on the other hand, held great appeal for Tartaglia. Not only did he hate him but\nCardan\nwas a leading figure in the mathematical, medical and literary worlds, and even to enter a debate with him would greatly enhance Tartaglia's standing. For all the brilliance of his discovery of the solution to the cubic equation problem, Tartaglia was still a relatively poor mathematics teacher in Venice.\nSo Tartaglia replied to\nFerrari\n, trying to bring\nCardan\ninto the debate.\nCardan\n, however, had no intention of debating with Tartaglia.\nFerrari\nand Tartaglia wrote fruitlessly to each other for about a year, trading the most offensive personal insults but achieving little in the way of resolving the dispute. Suddenly in\n1548\n, Tartaglia received an impressive offer of a lectureship in his home town, Brescia. To clearly establish his credentials for the post, Tartaglia was asked to journey to Milan and take part in the contest with\nFerrari\n.\nOn\n10\nAugust\n1548\nthe contest took place in the Church in the Garden of the Frati Zoccolanti. Tartaglia was vastly experienced in such debates and he expected to win. However, by the end of the first day, it was clear that things were not going his way.\nFerrari\nclearly understood the cubic and quartic equations more thoroughly, and Tartaglia decided that he would leave Milan that night and thus leave the contest unresolved. With Tartaglia departing ignominiously, victory was left to\nFerrari\n.\nTartaglia suffered as a result of the contest. After giving his lectures for a year in Brescia, he was informed that his stipend was not going to be honoured. Even after numerous lawsuits, Tartaglia could not get any payment and returned, seriously out of pocket, to his previous job in Venice, nursing a huge resentment of\nCardan\n. The defeat in Milan would appear to be responsible for Tartaglia's non-payment.\nTartaglia is now remember in that the name of the formula for solving the cubic has been named the\nCardan\n-Tartaglia formula. However, Tartaglia did contribute to mathematics in a number of other ways. Fairly early in his career, before he became involved in the arguments about the cubic equation, he wrote\nNova Scientia\n(1537)\non the application of mathematics to artillery fire. In the work he described new ballistic methods and instruments, including the first firing tables. He also wrote a popular arithmetic text and was the first Italian translator and publisher of\nEuclid\n's\nElements\nin\n1543\n. In\n1546\nhe published\nQuesiti et Inventioni diverse de Nicolo Tartalea\nreferred to above.\nWe give many quotes from this work by Tartaglia in the article\nTartaglia v Cardan\nwhere the events described above are recounted in the mathematicians own words.\nTartaglia also published Latin editions of\nArchimedes\n' works. He died in poverty in his house in the Calle del Sturion near the Rialto Bridge\n(\nnot the present one which was constructed about\n30\nyears later\n)\nin Venice."
}