{
  "nome_completo": "Théodore Olivier",
  "nome_curto": "Théodore Olivier",
  "ano_nascimento": "1793",
  "ano_morte": "1853",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Olivier/",
  "lugar_nascimento": "Lyon, France",
  "lugar_morte": "Lyon, France",
  "biografia": "Théodore Olivier\nwas a student at the École Polytechnique where he was strongly influenced by\nMonge\n. After graduating from the École Polytechnique, he spent the years from\n1821\nto\n1825\nin Sweden. He became one of the founders of École Centrale des Arts et Manufactures in\n1829\n.\nThe scientific discoveries around that time were having a major impact on French industry which was making good practical use of these discoveries. However, to fully benefit it was realised that a new type of engineer had to be trained with a broad knowledge of industry, science and mathematics. Alphonse Lavallée, who was a businessman from Nantes, put most of his capital into the foundation of the École Centrale des Arts et Manufactures. He obtained the help of three top scientists, one being Théodore Olivier, the other two being Baptiste Dumas and Eugène Péclet. They set up the school with the stated aim of training:-\n... the doctors of factories and mills.\nOlivier became a professor at the École Centrale des Arts et Manufactures when it opened in the Hôtel de Juigné in the Marais district of Paris in\n1829\n. The two other scientists, Dumas and Péclet, who had joined with Lavallée also became professors. In his role as professor Olivier lectured on descriptive geometry and mechanics. He also lectured on these topics at the Conservatoire National des Arts et Métiers in Paris.\nFrom the\n1840\n's Olivier wrote textbooks. His greatest fame, however, is as a result of the mathematical models which he created to assist in his teaching of geometry. Some of the models were of ruled surfaces, with moving parts to illustrate to students how the ruled surfaces were generated. Others were designed to illustrate the curves of intersection of certain surfaces. In fact Olivier earned quite a good income from selling these models, particularly in the United States.\nThe United States Military Academy at West Point north of New York opened on\n4\nJuly\n1802\n. Initially the style of the academy was modelled on the Royal Military Academy at Woolwich but later it was modelled in the French style with descriptive geometry becoming a major topic. The Academy had\n23\nmathematical models made for them by Olivier to use as teaching aids:-\nThese models are built on wooden boxes as bases, have metal supports, and consist of strings suspended from movable arms and arranged to form a variety of geometrical figures. The strings are held in place by lead weights that are concealed by the bases. The models illustrate such things as the intersection of two half cones, the intersection of a plane, hyperbolic paraboloid and a hyperboloid of one sheet, and the intersection of two half cylinders.\nOther institutions in the United States such as the Columbia School of Mines also purchased models from Olivier while Princeton had copies of Olivier's models made for them. In\n1849\nOlivier presented a full set of the range of models he had created to the Conservatoire National des Arts et Métiers. The models had been manufactured by the firm of Pixii, Père et Fils, and later by the firm of Fabre de Lagrange which took over their manufacture. In\n1857\n, four years after Olivier died, Harvard University purchased\n24\nof Olivier's models from Fabre de Lagrange and after the university received the order\nBenjamin Peirce\ngave a series of lectures on the mathematics which they illustrated. These models are still in Harvard's collection of scientific instruments.\nEven after giving a complete set of his models to the Conservatoire National des Arts et Métiers, forty models were still in Olivier's possession at the time of his death. These were sold in\n1869\nto William Gillispie from Union College in Schenectady, east-central New York, United States. Gillispie exhibited the models at Union College which was appropriate since, twenty years earlier, Union College had became one of the first liberal arts colleges in the United States to give engineering courses. When Gillispie died Olivier's models were sold to the college."
}