{
  "nome_completo": "Al-Sabi Thabit ibn Qurra al-Harrani",
  "nome_curto": "Thabit",
  "ano_nascimento": "836",
  "ano_morte": "901",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Thabit/",
  "lugar_nascimento": "Harran, Mesopotamia (now Turkey)",
  "lugar_morte": "Baghdad, (now in Iraq)",
  "biografia": "Thabit ibn Qurra\nwas a native of Harran and a member of the Sabian sect. The Sabian religious sect were star worshippers from Harran often confused with the Mandaeans\n(\nas they are in\n[\n1\n]\n)\n. Of course being worshipers of the stars meant that there was strong motivation for the study of astronomy and the sect produced many quality astronomers and mathematicians. The sect, with strong Greek connections, had in earlier times adopted Greek culture, and it was common for members to speak Greek although after the conquest of the Sabians by Islam, they became Arabic speakers. There was another language spoken in southeastern Turkey, namely Syriac, which was based on the East Aramaic dialect of Edessa. This language was Thabit ibn Qurra's native language, but he was fluent in both Greek and Arabic.\nSome accounts say that Thabit was a money changer as a young man. This is quite possible but some historians do not agree. Certainly he inherited a large family fortune and must have come from a family of high standing in the community.\nMuhammad ibn Musa ibn Shakir\n, who visited Harran, was impressed at Thabit's knowledge of languages and, realising the young man's potential, persuaded him to go to Baghdad and take lessons in mathematics from him and his brothers\n(\nthe\nBanu Musa\n)\n.\nIn Baghdad Thabit received mathematical training and also training in medicine, which was common for scholars of that time. He returned to Harran but his liberal philosophies led to a religious court appearance when he had to recant his 'heresies'. To escape further persecution he left Harran and was appointed court astronomer in Baghdad. There Thabit's patron was the Caliph, al-Mu'tadid, one of the greatest of the 'Abbasid caliphs.\nAt this time there were many patrons who employed talented scientists to translate Greek text into Arabic and Thabit, with his great skills in languages as well as great mathematical skills, translated and revised many of the important Greek works. The two earliest translations of\nEuclid\n's\nElements\nwere made by al-Hajjaj. These are lost except for some fragments. There are, however, numerous manuscript versions of the third translation into Arabic which was made by\nHunayn\nibn Ishaq and revised by Thabit. Knowledge today of the complex story of the Arabic translations of\nEuclid\n's\nElements\nindicates that all later Arabic versions develop from this revision by Thabit.\nIn fact many Greek texts survive today only because of this industry in bringing Greek learning to the Arab world. However we must not think that the mathematicians such as Thabit were mere preservers of Greek knowledge. Far from it, Thabit was a brilliant scholar who made many important mathematical discoveries.\nAlthough Thabit contributed to a number of areas the most important of his work was in mathematics where he\n[\n1\n]\n:-\n... played an important role in preparing the way for such important mathematical discoveries as the extension of the concept of number to\n(\npositive\n)\nreal numbers, integral calculus, theorems in spherical trigonometry, analytic geometry, and\nnon-euclidean geometry\n. In astronomy Thabit was one of the first reformers of the Ptolemaic system, and in mechanics he was a founder of statics.\nWe shall examine in more detail Thabit's work in these areas, in particular his work in\nnumber theory\non\namicable numbers\n. Suppose that, in modern notation,\nS\n(\nn\n)\nS(n)\nS\n(\nn\n)\ndenotes the sum of the aliquot parts of\nn\nn\nn\n, that is the sum of its proper quotients.\nPerfect numbers\nare those numbers\nn\nn\nn\nwith\nS\n(\nn\n)\n=\nn\nS(n) = n\nS\n(\nn\n)\n=\nn\nwhile\nm\nm\nm\nand\nn\nn\nn\nare amicable if\nS\n(\nn\n)\n=\nm\nS(n) = m\nS\n(\nn\n)\n=\nm\n, and\nS\n(\nm\n)\n=\nn\nS(m) = n\nS\n(\nm\n)\n=\nn\n. In\nBook on the determination of amicable numbers\nThabit claims that\nPythagoras\nbegan the study of perfect and amicable numbers. This claim, probably first made by\nIamblichus\nin his biography of\nPythagoras\nwritten in the third century AD where he gave the amicable numbers\n220\nand\n284\n, is almost certainly false. However Thabit then states quite correctly that although\nEuclid\nand\nNicomachus\nstudied perfect numbers, and\nEuclid\ngave a rule for determining them\n(\n[\n6\n]\nor\n[\n7\n]\n)\n:-\n... neither of these authors either mentioned or showed interest in\n[\namicable numbers\n]\n.\nThabit continues\n(\n[\n6\n]\nor\n[\n7\n]\n)\n:-\nSince the matter of\n[\namicable numbers\n]\nhas occurred to my mind, and since I have derived a proof for them, I did not wish to write the rule without proving it perfectly because they have been neglected by\n[\nEuclid\nand\nNicomachus\n]\n. I shall therefore prove it after introducing the necessary lemmas.\nAfter giving nine lemmas Thabit states and proves his theorem: for\nn\n>\n1\nn > 1\nn\n>\n1\n, let\np\nn\n=\n3.\n2\nn\n−\n1\np_{n} = 3.2^{n} -1\np\nn\n​\n=\n3\n.\n2\nn\n−\n1\nand\nq\nn\n=\n9.\n2\n2\nn\n−\n1\n−\n1\nq_{n} = 9.2^{2^{n-1}} -1\nq\nn\n​\n=\n9\n.\n2\n2\nn\n−\n1\n−\n1\n. If\np\nn\n−\n1\n,\np\nn\np_{n-1}, p_{n}\np\nn\n−\n1\n​\n,\np\nn\n​\n, and\nq\nn\nq_{n}\nq\nn\n​\nare\nprime numbers\n, then\na\n=\n2\nn\np\nn\n−\n1\np\nn\na = 2^{n}p_{n-1}p_{n}\na\n=\n2\nn\np\nn\n−\n1\n​\np\nn\n​\nand\nb\n=\n2\nn\nq\nn\nb = 2^{n}q_{n}\nb\n=\n2\nn\nq\nn\n​\nare amicable numbers while\na\na\na\nis\nabundant\nand\nb\nb\nb\nis\ndeficient\n. Note that an abundant number\nn\nn\nn\nsatisfies\nS\n(\nn\n)\n>\nn\nS(n) > n\nS\n(\nn\n)\n>\nn\n, and a deficient number\nn\nn\nn\nsatisfies\nS\n(\nn\n)\n<\nn\nS(n) < n\nS\n(\nn\n)\n<\nn\n. More details are given in\n[\n9\n]\nwhere the authors conjecture how Thabit might have discovered the rule. In\n[\n13\n]\nHogendijk shows that Thabit was probably the first to discover the pair of amicable numbers\n17296\n,\n18416\n.\nAnother important aspect of Thabit's work was his book on the composition of ratios. In this Thabit deals with arithmetical operations applied to ratios of geometrical quantities. The Greeks had dealt with geometric quantities but had not thought of them in the same way as numbers to which the usual rules of arithmetic could be applied. The authors of\n[\n22\n]\nand\n[\n23\n]\nstress that by introducing arithmetical operations on quantities previously regarded as geometric and non-numerical, Thabit started a trend which led eventually to the generalisation of the number concept.\nThabit generalised\nPythagoras\n's theorem to an arbitrary triangle\n(\nas did\nPappus\n)\n. He also discussed\nparabolas\n,\nangle trisection\nand\nmagic squares\n. Thabit's work on parabolas and paraboliods is of particular importance since it is one of the steps taken towards the discovery of the integral calculus. An important consideration here is whether Thabit was familiar with the methods of\nArchimedes\n. Most authors\n(\nsee for example\n[\n29\n]\n)\nbelieve that although Thabit was familiar with\nArchimedes\n' results on the\nquadrature\nof the parabola, he did not have either of\nArchimedes\n' two treatises on the topic. In fact Thabit effectively computed the integral of\n√\nx\n√x\n√\nx\nand\n[\n1\n]\n:-\nThe computation is based essentially on the application of upper and lower integral sums, and the proof is done by the\nmethod of exhaustion\n: there, for the first time, the segment of integration is divided into unequal parts.\nThabit also wrote on astronomy, writing\nConcerning the Motion of the Eighth Sphere\n. He believed\n(\nwrongly\n)\nthat the motion of the\nequinoxes\noscillates. He also published observations of the Sun. In fact eight complete treatises by Thabit on astronomy have survived and the article\n[\n20\n]\ndescribes these. The author of\n[\n20\n]\nwrites:-\nWhen we consider this body of work in the context of the beginnings of the scientific movement in ninth-century Baghdad, we see that Thabit played a very important role in the establishment of astronomy as an exact science\n(\nmethod, topics and program\n)\n, which developed along three lines: the theorisation of the relation between observation and theory, the 'mathematisation' of astronomy, and the focus on the conflicting relationship between 'mathematical' astronomy and 'physical' astronomy.\nAn important work\nKitab fi'l-qarastun\n(\nThe book on the beam balance\n)\nby Thabit is on mechanics. It was translated into Latin by\nGherard\nof Cremona and became a popular work on mechanics. In this work Thabit proves the principle of equilibrium of levers. He demonstrates that two equal loads, balancing a third, can be replaced by their sum placed at a point halfway between the two without destroying the equilibrium. After giving a generalisation Thabit then considers the case of equally distributed continuous loads and finds the conditions for the equilibrium of a heavy beam. Of course\nArchimedes\nconsidered a theory of centres of gravity, but in\n[\n14\n]\nthe author argues that Thabit's work is not based on\nArchimedes\n' theory.\nFinally we should comment on Thabit's work on philosophy and other topics. Thabit had a student Abu Musa Isa ibn Usayyid who was a Christian from Iraq. Ibn Usayyid asked various questions of his teacher Thabit and a manuscript exists of the answers given by Thabit, this manuscript being discussed in\n[\n21\n]\n. Thabit's concept of number follows that of\nPlato\nand he argues that numbers exist, whether someone knows them or not, and they are separate from numerable things. In other respects Thabit is critical of the ideas of\nPlato\nand\nAristotle\n, particularly regarding motion. It would seem that here his ideas are based on an acceptance of using arguments concerning motion in his geometrical arguments.\nThabit also wrote on\n[\n1\n]\n:-\n... logic, psychology,\nethics\n, the classification of sciences, the grammar of the Syriac language, politics, the symbolism of\nPlato\n's Republic ... religion and the customs of the Sabians.\nThis archive contains information on other members of Thabit's family. His son,\nSinan ibn Thabit\n, and his grandson\nIbrahim ibn Sinan ibn Thabit\n, both were eminent scholars who contributed to the development of mathematics. Neither, however, reached the mathematical heights of Thabit."
}