{
  "nome_completo": "Theodorus of Cyrene",
  "nome_curto": "Theodorus",
  "ano_nascimento": "465 BC",
  "ano_morte": "398 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Theodorus/",
  "lugar_nascimento": "Cyrene (now Shahhat, Libya)",
  "lugar_morte": "Cyrene (now Shahhat, Libya)",
  "biografia": "Theodorus of Cyrene\nwas a pupil of\nProtagoras\nand himself the tutor of\nPlato\n, teaching him mathematics, and also the tutor of\nTheaetetus\n.\nPlato\ntravelled to and from Egypt and on such occasions he spent time with Theodorus in Cyrene. Theodorus, however, did not spend his whole life in Cyrene for he was certainly in Athens at a time when\nSocrates\nwas alive.\nTheodorus, in addition to his work in mathematics, was\n[\n5\n]\n:-\n... distinguished ... in astronomy, arithmetic, music and all educational subjects.\nA member of the society of\nPythagoras\n, Theodorus was one of the main philosophers in the Cyrenaic school of moral philosophy. He believed that pleasures and pains are neither good nor bad. Cheerfulness and wisdom, he believed, were sufficient for happiness.\nOur knowledge of Theodorus comes through\nPlato\nwho wrote about him in his work\nTheaetetus\n. Theodorus is remembered by mathematicians for his contribution to the development of\nirrational\nnumbers and it is this aspect of his work which\nPlato\ndescribes\n(\nsee for example\n[\n5\n]\n)\n:-\n[\nTheodorus\n]\nwas proving to us a certain thing about square roots, I mean the side\n(\ni.e. root\n)\nof a square of three square units and of five square units, that these roots are not\ncommensurable\nin length with the unit length, and he went on in this way, taking all the separate cases up to the root of seventeen square units, at which point, for some reason, he stopped.\nOur whole knowledge of Theodorus's mathematical achievements are given by this passage from\nPlato\n. Yet there are points of interest which immediately arise. The first point is that\nPlato\ndoes not credit Theodorus with a proof that the square root of two was irrational. This must be because √\n2\nwas proved irrational before Theodorus worked on the problem, some claim this was proved by\nPythagoras\nhimself.\nThere is no doubt that Theodorus would have constructed lines of length √\n3\n, √\n5\netc. using\nPythagoras\n's theorem. It is also clear that Theodorus had no general result here, for\nPlato\ngoes on to describe how Theodorus's results inspired\nTheaetetus\nand Socrates to look at generalisations:-\nThe idea occurred to the two of us\n(\nTheaetetus\nand Socrates\n)\n, seeing that these square roots appeared to be unlimited in multitude, to try to arrive at one collective term by which we could designate all these roots....\nSo the question which naturally comes next is how did Theodorus prove that √\n3\n, √\n5\n, ..., √\n17\nwere irrational without giving a proof which would clearly prove that any non-square number was irrational. The usual proof that √\n2\nis irrational, namely the one which supposes that\n√\n2\n=\np\nq\n√2 = \\large\\frac{p}{q}\\normalsize\n√\n2\n=\nq\np\n​\nwhere\np\nq\n\\large\\frac{p}{q}\\normalsize\nq\np\n​\nis a\nrational\nin its lowest terms and derives a contradiction by showing that\np\np\np\nand\nq\nq\nq\nare both even, would have been known to Theodorus. This proof generalises easily\n(\nfor a modern mathematicians thinking in terms of numbers rather than lengths\n)\nto show √n is irrational for any non-square\nn\nn\nn\n. It is almost impossible to conceive that Theodorus would have used this proof on each of √\n3\n, √\n5\n, ..., √\n17\nwithout obtaining a general theorem long before he got to\n17\n.\nAn interesting proposal was made by\nZeuthen\nin\n1915\n. He suggested that Theodorus may have used the result which would later appear in\nEuclid\n's\nElements\nnamely:-\nIf, when the lesser of two unequal magnitudes is continually subtracted in turn from the greater, that which is left never measures the one before it, the magnitudes will be incommensurable.\nHeath\n[\n5\n]\nillustrates the use of this result to show that √\n5\nis irrational. Start with\n1\nand √\n5\n.\n√\n5\n1\n=\n2\n+\n(\n√\n5\n−\n2\n)\n\\Large\\frac{√5}{1}\\normalsize  = 2 +(√5-2)\n1\n√\n5\n​\n=\n2\n+\n(\n√\n5\n−\n2\n)\n1\n√\n5\n−\n2\n=\n4\n+\n(\n√\n5\n−\n2\n)\n2\n\\Large\\frac{1}{√5-2}\\normalsize  = 4 + (√5-2)^{2}\n√\n5\n−\n2\n1\n​\n=\n4\n+\n(\n√\n5\n−\n2\n)\n2\n√\n5\n−\n2\n(\n√\n5\n−\n2\n)\n2\n=\n1\n√\n5\n−\n2\n=\n4\n+\n(\n√\n5\n−\n2\n)\n2\n\\Large\\frac{√5-2}{(√5-2)^{2}\\normalsize}  = \\Large\\frac{1}{√5-2}\\normalsize  = 4 + (√5-2)^{2}\n(\n√\n5\n−\n2\n)\n2\n√\n5\n−\n2\n​\n=\n√\n5\n−\n2\n1\n​\n=\n4\n+\n(\n√\n5\n−\n2\n)\n2\n.......\nThe process now clearly fails to terminate since the ratio\n1\n:\n(\n√\n5\n−\n2\n)\n1 : (√5-2)\n1\n:\n(\n√\n5\n−\n2\n)\nis the same as\n(\n√\n5\n−\n2\n)\n:\n(\n√\n5\n−\n2\n)\n2\n(√5-2) : (√5-2)^{2}\n(\n√\n5\n−\n2\n)\n:\n(\n√\n5\n−\n2\n)\n2\n.\nHeath\n[\n5\n]\ngives a geometric version of this, starting with a right-angled triangle with sides\n1\n,\n2\nand √\n5\nwhich may be close to the method that Theodorus used. However there is little chance to do more than guess at Theodorus's method."
}