{
  "nome_completo": "Thomas Arnold Brown",
  "nome_curto": "Thomas Arnold Brown",
  "ano_nascimento": "1893",
  "ano_morte": "1965",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Brown_Thomas/",
  "lugar_nascimento": "Edinburgh, Scotland",
  "lugar_morte": "Exeter, England",
  "biografia": "Thomas Arnold Brown\n's father was John Brown, and the family lived at\n39\nSpottiswoode Road, Edinburgh. Thomas's secondary school education was at George Watson's College, Edinburgh, between October\n1898\nand July\n1911\n. He passed the Scottish Leaving Certificate examinations in English, Latin, French, and Mathematics in\n1910\n. He was dux of George Watson's in\n1911\n, entering the University of Edinburgh in that year to study mathematics and physics, having passed Preliminary Examination in October\n1911\n.\nAt University he took the Ordinary courses in Mathematics and Natural Philosophy in session\n1911\n-\n12\n, then the Ordinary courses in Chemistry and French in session\n1912\n-\n13\n. For the two sessions\n1913\n-\n14\nand\n1914\n-\n15\nhe studied the Honours courses in Mathematics and Natural Philosophy. In June\n1915\nhe was awarded First Class Honours in Mathematics and Natural Philosophy and also received a B.Sc.\n(\nPure\n)\nin the same year. He was awarded the\nNapier\nmedal for the top performance in Mathematics. In addition he was awarded the Welsh Mathematical Bursary in October\n1911\n, the Kelland Prize in September\n1912\n, and the Drummond Mathematical Scholarship in June\n1915\nto finance a further period of study.\nWhen Brown graduated from the University of Edinburgh, World War I was taking place and he had to undertake war service. At first he began research at Edinburgh under\nWhittaker\nas well as undergoing military training. He was commissioned in\n1916\n, serving both at home and overseas, and had to put his research career on hold. After the war ended, he was awarded a Carnegie Fellowship to enable him to undertake research at Trinity College, Cambridge, under\nE W Hobson\n.\nIn\n1921\nBrown was appointed as a Lecturer in Pure Mathematics in University College, London. Let us note that on a return trip to Edinburgh he was caught speeding in his car. In September\n1922\nhe was fined £\n2\nfor exceeding the twenty-mile limit in Comiston Road. At University College he was quickly promoted to Senior Lecturer but after two years he left when appointed to the Chair of Mathematics at University College, Exeter. On\n2\nMay\n1923\nhis engagement was announced:-\nThe engagement is announced between Thomas Arnold Brown, elder son of Mr and Mrs John Brown,\n141\nCraiglea Drive, Edinburgh, and Mary Cecil\n(\nMollie\n)\n, elder daughter of the late E A Gibson, B.A., LL.B., M.B., Ch.B., City Coroner for Manchester and Mrs Gibson, Blomfield Court, London W.\n9\n.\nBrown continued to hold the Chair at Exeter until he retired in\n1958\n.\nIn December\n1915\nThomas Brown joined the\nEdinburgh Mathematical Society\n. Brown was elected to the\nRoyal Society of Edinburgh\non\n3\nMarch\n1924\n, his proposers being\nSir Edmund T Whittaker\n, A Crichton Mitchell, Sir Ernest Maclagan Wedderburn, Ralph A Sampson.\nAn obituary, written by\nD Rees\n, appears in the\nRoyal Society of Edinburgh\nYear Book\n1966\n, pages\n11\n-\n12\n.\nWe give a version of this obituary at\nTHIS LINK\n."
}