{
  "nome_completo": "Thomas Fincke",
  "nome_curto": "Thomas Fincke",
  "ano_nascimento": "1561",
  "ano_morte": "1656",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fincke/",
  "lugar_nascimento": "Flensburg, Schleswig (now Germany)",
  "lugar_morte": "Copenhagen, Denmark",
  "biografia": "Thomas Fincke\n's name appears with a variety of different spellings, the commonest is the one we have adopted but Finke, Finck, or Fink are sometimes used in addition to the Latin versions of Finchius and Finckius. His parents, Raadmand Jacob Fincke and Anna thor Smede\n(\nor Thorsmede\n)\n, came from the most respected families in Flensburg. Anna was from a rich middle-class Danish family but, sadly, she died six days after her son Thomas was born. Thomas's father was described as a \"learned merchant\" who had been a student of Martin Luther and Philipp Melanchthon, the Professor of Greek in Wittenberg and one of Luther's first supporters. Thomas, the subject of this biography, had been named after his grandfather, also named Thomas Fincke, who had been mayor of Flensburg. When Thomas, the subject of this biography, was only nine years old, his father died and from that time he lived with his uncle Reinhold thor Smede\n(1532\n-\n1584)\n, a wealthy well-educated local councillor.\nThomas attended a newly founded Lutheran Latin school in Flensburg from\n1570\nto\n1577\nwhen he was\n16\nyears old. He received a good broad education at this school, being taught Luther's religious ideas, mainly from textbooks written by Philipp Melanchthon, and taught the ancient languages of Greek, Latin and Hebrew. He learnt little of mathematics, however, and when he left the school he would have had no knowledge of the subject beyond basic arithmetical skills. Flensburg was in Schleswig and, although administered from Denmark, it had a large German speaking population and had strong links with nearby German cities. Friedrich II was king of Denmark from\n1559\nto\n1588\nand, after the Seven Years' War, had signed a peace treaty with Sweden in\n1570\nensuring that Sweden remained independent. Friedrich II, building up his country after the war, in\n1571\ngranted inhabitants of Schleswig equal rights with all other inhabitants of Denmark so that when Fincke left school, he had could have gone to the University of Copenhagen to study at this top class establishment. If he had chosen to attend a university in one of the German cities one would have expected him to study at the relatively nearby Rostock. However, probably influenced by his uncle who had studied at Strasbourg and Wittenberg, he decided to go very much further south and, in\n1577\n, he matriculated at Strasbourg Academy. With the humanist education that he had at school in Flensburg one would not expect him to study mathematics at the Academy since he had hardly any background in the subject. However, Melanchthon firmly believed that those intending to study theology, law or medicine at university, should first become familiar with the precise way of thinking that was characteristic of mathematics. As a consequence, mathematics was one of the major subjects that Fincke studied.\nHe spent five years studying mathematics and astrology, philosophy and\nrhetoric\nat Strasbourg. His mathematics professor at Strasbourg Academy was Conrad Dasypodius\n(1532\n-\n1600)\n, famed for his work on Strasbourg Cathedral's Astronomical Clock between\n1571\nand\n1574\n. Dasypodius was a fine mathematician and had produced editions of\nEuclid\n's\nElements\nand texts such as\nAnalyseis geometricae sex librorum Euclidis\nⓉ\n(\nAnalysis of the six books of Euclid's geometry,\n)\n(1566)\n, and\nMathematicorum disciplinarum principia\nⓉ\n(\nMathematicians principles\n)\n(1573)\n. Finke would almost certainly have studied these works while studying under Dasypodius at the Strasbourg Academy. After leaving the Academy, Fincke enrolled at the University of Heidelberg in February\n1582\nand then, after a semester there, he enrolled for a semester at the University of Leipzig in the summer of\n1582\n. He spent some time at the universities of Jena and Wittenberg before returning to Flensburg in the spring of\n1583\non the instructions of his guardian Reinhold thor Smede. The reason for this visit was to sort out his financial affairs after receiving a substantial legacy from his father's will. However, an outbreak of the plague meant that he remained much longer at Flensburg than he had intended and only after six months, in the autumn of\n1583\n, did he leave his hometown and go to Basel. It was there that he published\nGeometriae rotundi libri XIIII\n(1583)\n, a work he had undertaken at Strasbourg, which has guaranteed his fame as a mathematician. We discuss this work below but before doing so we will continue to describe his career.\nHaving published such an important mathematical work, one might assume that Fincke would go on to still greater mathematical achievements. However, his aim was still to follow a career in medicine and his preliminary study of mathematics had largely been undertaken to follow the teaching of Melanchthon. He now began his study of medicine in Basel, continuing it Padua in November\n1583\n. He spent four years in Padua, interspersed with short visits to other universities, namely Siena in\n1585\nand Pisa in\n1586\n. Fincke made a big impression in Padua and, although he was only twenty-six years old when he left, his achievements in founding a medical library were so highly appreciated that a marble pillar with inscribed commemorative plaque was put in the local church 'Santa Sofia' in his honour. He returned to Basel where he submitted his thesis for a medical doctorate and was successful in obtaining the degree on\n24\nAugust\n1587\n. His medical teachers had been Felix Plater\n(1536\n-\n1614)\nand Theodor Zwinger\n(1533\n-\n1588)\nat Basel, and Hieronymus Fabricius\n(1537\n-\n1619)\nand Giulo Casserio\n(1545\n-\n1605)\nat Padua. He did not entirely leave behind his interest in mathematics and astronomy, however, for he was friendly with\nGiovanni Antonio Magini\nwhile at Padua and, after he returned to his home town of Flensburg after the award of his doctorate, he continued to correspond with\nMagini\n.\nCertainly Fincke did not return directly to Flensburg from Basel but rather made further study trips through Austria, Hungary and Bohemia before settling into a medical practise in his home town of Flensburg. Being a well-travelled versatile scientist with great expertise in mathematics, astrology, astronomy and medicine, he was very well-respected and came to the attention of the leading men such as Duke Philipp von Holstein-Gottorf who appointed him as the personal physician to his court in\n1590\n. On\n30\nAugust\n1590\n, Fincke married Söst Ivers\n(1574\n-\n1614)\nat the Ducal Palace in Tonder. Fincke was twenty-nine years old when he married Söst the day after her sixteenth birthday. Jürgen Schönbeck writes in\n[\n6\n]\n:-\nUndoubtedly at this time Fincke was, both professionally and privately, at the high point of his successful life.\nAround the time of his marriage, Fincke received an offer of the Chair of Mathematics at the University of Copenhagen from Chancellor Niels Kaas, one of Fincke's patrons. The death of Duke Philipp in November\n1590\nmade the decision somewhat easier for him and, in July of the following year, he took up the post succeeding Anders Krag. He became professor of rhetoric at Copenhagen in February\n1602\n, filling the chair which became vacant on the death of Hans Guldsmed on\n27\nJanuary. On the\n28\nJuly\n1602\n, Peder Sørensen, the professor of medicine at Copenhagen died and in April of the following year Fincke was appointed to fill this chair. In addition to these academic posts, he held a number of important roles at the University of Copenhagen. He was Dean of the Faculty of Philosophy in\n1593\nand\n1599\n, he was Dean of the Medical School for\n53\nyears from\n1603\nuntil his death in\n1656\nand five times he was Rector of the University\n(1598\n-\n99\n,\n1606\n-\n07\n,\n1615\n-\n16\n,\n1624\n-\n25\nand\n1633\n-\n34)\n. He continued to lecture at the University until he was eighty-one years of age, but even after this he still retained his official position together with his income. This meant he was a very wealthy man and was able to offer scholarships and lend money to noble families.\nHis most famous book\nGeometriae rotundi\nⓉ\n(\nGeometric rotation\n)\n(1583)\n, was intended as a textbook and the reader is referred to\nRegiomontanus\nfor more details. It was based on works by\nPeter Ramus\nfrom whom he took the word 'rotundi' of the title, meaning circle and sphere, and the word 'radius'. The book introduces the terms 'tangents' and 'secants' and Fincke devised new formulae such as the law of tangents. The work, written in Latin, is divided into\n14\nBooks but it would be more appropriate to think of them as chapters. The elementary theory of the circle is presented in Books\n1\nto\n4\n, plane trigonometry is studied in Books\n5\nto\n11\n, and the final three Books treat spherical trigonometry. Most of the\n14\nBooks have subtitles:\nLiber Primus.\nDe circuli rectis secantibus\nⓉ\n(\ncutting the circle to the right\n)\n.\nLiber Secundus.\nDe lineis circuli tangentibus sigillatim & coniunctim cum secantibus, atque obliquis\nⓉ\n(\nDe, sealed and close union with the tangents drawn to the circle are drawn, and oblique\n)\n.\nLiber Tertius.\nLiber Quartus.\nDe cruribus anguli in semicirculo\nⓉ\n(\nof the corner of his legs in a semicircle,\n)\n.\nLiber Quintus.\nDe semicirculi sinibus, tangentibus, secantibus\nⓉ\n(\nof the semi-circle in the sines, tangents, secants\n)\n.\nLiber Sextus.\nDe adscriptione circuli & trianguli\nⓉ\n(\nmembership in the Circle and the Triangle of\n)\n.\nLiber Septimus.\nDe adscriptione triangulati\nⓉ\n(\nthe membership triangulati\n)\n.\nLiber Octavus.\nDe tetragonismo circuli\nⓉ\n(\nthe squaring of the circle\n)\n.\nLiber Nonus.\nDe canone triangulorum\nⓉ\n(\nThe Canon triangutorum\n)\n.\nLiber Decimus.\nDe calculo triangulorum\nⓉ\n(\nOn the calculation of  triangles\n)\n.\nLiber Undecimus.\nDe Geodaesia rectarum\nⓉ\n(\nOn geodesic lines\n)\n.\nLiber Duodecimus.\nLiber Decimustertius.\nDe triangulis sphaericis\nⓉ\n(\nOn spherical triangles\n)\n.\nLiber Decimusquartus.\nDe calculo triangulorum sphaericorum\nⓉ\n(\nOn the calculation of spherical triangles\n)\n.\nThe work consists of just over\n400\npages, but almost a third of these pages are taken up with trigonometric tables which are printed between Books\n9\nand\n10\n. The abbreviations Fincke used for the standard trigonometric functions mark the beginning of the notation which is current today. For 'sine' he wrote 'sin.', for 'cosine' he wrote ' sin. com.', for 'tangent' he wrote 'tan.', for secant he wrote 'sec.', for 'cosecant' he wrote 'sec.com.', and for 'cotangent' he wrote 'tan.com.'. Fincke's book was recommended by\nClavius\n,\nNapier\nand\nPitiscus\nall of whom adopted much from it. His other works on astronomy and astrology are of much less interest despite the fact that he was in touch with\nBrahe\nand\nKepler\n. These include:\nHoroscopographia, continens fabricam cardinum coelestium ad quodvis datum tempus: et viam deductionis Ptolemaicam\nⓉ\n(\nHoroscopographia, container building shook heavenly bodies at any given time, and the deduction of the Ptolemaic\n)\n(1585)\n, and\nHoroscopographia sive de inveniendo stellarum astrologia situ\nⓉ\n(\nor of finding stars, astronomy situation Horoscopographia\n)\n(1591)\n.\nFinally let us look briefly at the Thomas and Söst Finckes' large family and the influence they had on the academic families of Denmark for many generations. Their eldest son, Jacob Fincke\n(1592\n-\n1663)\n, went on to become Professor of Mathematics and Physics at the University of Copenhagen. Anna\n(1594\n-\n1677)\n, the eldest of the Finckes daughters, married Caspar Bartholin, a physician and theologian, and the famous mathematician\nErasmus Bartholin\nwas the second of their six sons. The Finckes' daughters Margaret\n(1595\n-\n1665)\n, Dorothea\n(1596\n-\n1628)\nand Drude\n(1604\n-\n1671)\nall married university professors. When Thomas Fincke died he left seventy-nine descendants: children, grandchildren, great-grandchildren and great-great-grandchildren. These descendants dominated the academic professors at the University of Copenhagen during the\n17\nth\ncentury.\nLet us end this biography but quoting the summary given by Jürgen Schönbeck\n[\n6\n]\n:-\nThomas Fincke ... was one of the very most important and significant scientists in Denmark during the seventeenth century, a mathematician and astrologer and physician in the beginning of modern science, a representative of humanism and an influential academic organizer."
}