{
  "nome_completo": "Thomas Lancaster Wren",
  "nome_curto": "Thomas Lancaster Wren",
  "ano_nascimento": "1889",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wren_Thomas/",
  "lugar_nascimento": "Islington, London, England",
  "lugar_morte": "Kensington, London, England",
  "biografia": "Thomas Lancaster Wren\nwas the son of the schoolmaster, Thomas Wren\n(\nborn\n1852\nin Oxford\n)\n, and his wife Amy Elizabeth Lancaster\n(\nborn\n1857\nin London\n)\n. Thomas and Amy Elizabeth were married on\n5\nAugust\n1884\nin Hammersmith, Middlesex, England. Thomas, the subject of this biography, entered Latymer Upper School in\n1896\n. This independent school in Hammersmith, London, was an ancient one founded in\n1624\n. It moved into new buildings in\n1890\n, the year after Wren was born, and these buildings are still part of the school today. When Wren studied there it was a boys' school and, after an excellent education, he graduated in\n1908\n. Later that year, he entered St John's College, Cambridge, to study the Mathematical Tripos. At first he was a pensioner and later he became a foundation scholar. His undergraduate career was outstanding and he was a\nWrangler\n(\nFirst Class student\n)\nin Part II of the Tripos in\n1911\nand a Rayleigh prizemen in\n1913\n. It is reported in\n[\n4\n]\nthat:-\nMr Thomas Lancaster Wren, who took a first class in the mathematical tripos in\n1909\nand\n1911\n[\nhas\n]\nbeen elected to a fellowship in St John's College, Cambridge.\nWren held this fellowship from\n1913\nto\n1919\nand, in addition, he was an Assistant in Mathematics at Bedford College, London, during the academic year\n1913\n-\n14\n. He was appointed as a College lecturer at the University of Cambridge in October\n1914\n. His research had been on geometry and he submitted a major paper to the\nLondon Mathematical Society\nin November\n1915\n. The paper was published in\n1917\nand you can read Wren's introduction at\nTHIS LINK\n.\nNow, by the time Wren was appointed as a College lecturer at Cambridge, Britain was already at war having declared war on Germany after that country invaded Belgium on\n4\nAugust\n1914\n. Wren had been in the Officers Training Corps while an undergraduate at Cambridge and, after teaching at Cambridge for the academic year\n1914\n-\n15\n, he joined the Army.\nThe development of air defences was part of the duties of the Ministry of Munitions during World War I. One of its functions was \"to investigate and experiment upon means for dealing with aircraft attack.\" In early\n1916\nthey set up the Anti-Aircraft Experimental Section to take up this new area of research. Looking for bright young men to staff the Section,\nG H Hardy\n's advice was sought. He recommended two of his students,\nArthur Milne\nand\nRalph Fowler\n[\n2\n]\n:-\nAs the war progressed other mathematicians and electrical engineers of all ages were recruited or volunteered - the main requirement being an ability to calculate trajectories and fuze curves. Cambridge supplied several members of the group, including Thomas Lancaster Wren, a geometer \"addicted to the purest of pure geometry\" ...\nOther mathematicians serving in the Anti-Aircraft Experimental Section included\nWilliam Edward Hodgson Berwick\nwho was one year older than Wren and had taken the same Cambridge Mathematical Tripos examinations one year earlier. Also working in this Section, in addition to\nArthur Milne\nand\nRalph Fowler\nwho we mentioned above, was\nHerbert William Richmond\n.\nRichmond\nwas much older than Wren and had graduated from Cambridge before Wren was even born. The interplay between these mathematicians working in the Anti-Aircraft Experimental Section was very effective and Wren always said what stimulating contacts he had made at that time.\nThe war ended in November\n1918\n, and in February\n1919\nWren returned to his position as a fellow and College lecturer at Cambridge. However, he only taught at Cambridge until June\n1919\nfor he was appointed as a Reader in Geometry at University College London, taking up the post in the autumn of\n1919\n. He continued to teach at University College London until he retired in\n1954\n. We quote from\n[\n1\n]\nregarding his contributions:-\nAlthough geometry was not to everyone's taste, Wren's enthusiastic exposition of projective geometry attracted a number of good students. His detailed knowledge of the subject almost invariably gave rise to examination questions which concluded exhaustingly with \"Show, further, that\". Although he wrote voluminous lecture notes, none of these found their way into a book of his own\n(\nperhaps he felt that\nH F Baker\nwas saying everything in 'Principles of geometry'\n)\n. However, it should be recorded that\nL N G Filon\ndedicated the second edition of his 'Introduction to projective geometry' to Wren, acknowledging that without Wren's friendly and unselfish help he could never have accomplished his task.\nIn fact the French-born mathematician\nLouis Napoleon George Filon\n, who held the Goldsmid Chair of Applied Mathematics and Mechanics at University College, London, wrote:-\nMy dear Wren\nYou once said to me, in conversation, that you had been \"brought up\" on the original edition of this book. Without your friendly and unselfish help I could never have accomplished the task of warming up your infant food, however imperfectly. I hope you will not be entirely displeased with this result of our cooperation, and in that hope I venture to dedicate to you the following pages.\nYours most gratefully\nL N G Filon\nJune\n1935\nIn the Preface to the Fourth Edition,\nFilon\nwrote:-\nI owe a specially heavy debt of gratitude to my friend and colleague, Mr T L Wren, Reader in Geometry in the University of London, University College, for his invaluable help and suggestions throughout. Mr Wren very kindly undertook the laborious task of looking over the whole manuscript of the revised work and has actually checked practically every example, and suggested many new ones. It is not too much to say that, but for his devoted help, it would have been impossible to complete the revision of the book in the very limited time at my disposal. Many of the changes in nomenclature are based on his suggestions.\nWe continue with the quote from\n[\n1\n]\nconcerning Wren's geometry contributions:-\nWren contributed largely to the establishment of projective geometry as a principal subject of undergraduate study in college and university, thus preparing the way for others to widen the scope of geometry and to take account of the related rapid advances in algebra. A joint seminar, established by\nJ G Semple\nand Wren and held alternately at King's and University Colleges, promoted the exchange of such ideas.\nGeometry was not Wren's only contribution. He lectured on the history of mathematics as part of a\n1919\n-\n20\ncourse given in the Department of History and Philosophy of Science of University College London on the history of science. Another of his contributions is mentioned by\nThomas Arthur Alan Broadbent\nin\n[\n3\n]\n(\nwe have slightly modified the quotation\n)\n:-\nG H Hardy\n, in his 'Divergent Series', asserts that Francis William Newman\n(1805\n-\n1897)\n[\nbrother of John Henry Newman\n(1801\n-\n1890)]\nwas for a time Professor of Mathematics at University College, London; this seems to be a mistake. Mr T L Wren very kindly looked into this matter, and told me that while Newman was Professor of Latin from\n1846\nto\n1863\n, there is no evidence that he held the chair of mathematics, though of course it is possible that he had occasionally given lectures on mathematics\n[\nas indeed he did\n]\n.\nAlthough Wren only published four papers, he did also write some excellent review articles such as his review of\nThe Theory of Ruled Surfaces\n(1931)\n, by\nW L Edge\n.\nW J Archibald describes Wren's character in\n[\n1\n]\n:-\nTo his colleagues and students, Wren was kind, unassuming, and helpful. In the Common Room, we discovered his skill with 'The Times' crossword puzzles and his detailed knowledge of railway and other communications; matches and an overfilled pipe always seemed to complete the scene. Those of us who knew him more closely were aware of his love of the countryside and of his devoted family life with his two sisters, one of whom survives him. After a long period when he ceased to be able to move about easily but remained otherwise as alert as ever, Wren died on\n14\nth\nJuly,\n1972\n. By his will, the College received a handsome legacy."
}