{
  "nome_completo": "Thomas Scott Fiske",
  "nome_curto": "Thomas Scott Fiske",
  "ano_nascimento": "1865",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Fiske/",
  "lugar_nascimento": "New York, USA",
  "lugar_morte": "Poughkeepsie, New York, USA",
  "biografia": "Thomas Scott Fiske\n's parents were Thomas Scott Fiske Sr. and Clara Pittman. The book\n[\n1\n]\n, published in\n1867\n, clearly cannot mention the subject of this biography. However, it mentions his father, Thomas Scott Fiske Sr., who was the first son of David Fiske\n(\nborn\n1792)\nand his first wife Abigail Nourse. David and Abigail Fiske married in January\n1823\n. David Fiske was a farmer and deacon in the Congregational Church of Amherst. Thomas Scott Fiske Sr.\n(\nborn\n22\nNovember\n1823)\nwas David and Abigail Fiske's first child. He\n[\n1\n]\n:-\n... emigrated to St Louis about\n1848\n.\n[\nHe\n]\nremoved thence, at an early day, to New Orleans, and subsequently to California, where he engaged in the banking business, amassed some property, and returned East ...\nBoth Thomas Scott Fiske Sr. and Clara Pittman were descended from English families. Thomas Scott Fiske Jr, the subject of this biography, had a younger brother James Porter Fiske who was born in New York City on\n22\nNovember\n1866\n. James Porter Fiske became a surgeon and we shall say a little more about him later in this biography. Thomas Scott Fiske Jr attended the Old Trinity Church School in New York City, then the Pingry School in Elizabeth, New Jersey. Fiske entered Columbia College in\n1882\n, thirty years before it became Columbia University, receiving his A.B. in\n1885\nand his A.M. in\n1886\n. From\n1886\nto\n1888\nhe was both an assistant at Columbia College and undertaking research for his doctorate.\nIn\n1887\n, in Fiske's second year of graduate studies,\nHoward Van Amringe\nsuggested that he should spend at least six months in England at the University of Cambridge. He arrived with letters of introduction written by G L Rives, a trustee of Columbia College who had been a fifth\nwrangler\nin the mathematical tripos at Cambridge in\n1872\n. With letters addressed to\nArthur Cayley\n,\nJames Glaisher\n,\nAndrew Forsyth\nand\nGeorge Darwin\n, Fiske was well placed to take advantage of his time at Cambridge. He writes in\n[\n8\n]\n:-\n... on my arrival at Cambridge I was treated as a guest and was invited to attend any mathematical lectures whatsoever in which I might be interested. Scientifically I benefited most from the instruction and advice of Forsyth and from my reading with Dr\nH W Richmond\n, who consented to give me private lessons. However, from Dr\nJ W L Glaisher\n, who made me an intimate friend, who spent many an evening with me in heart to heart talks, who took me to meetings of the\nLondon Mathematical Society\nand the\nRoyal Astronomical Society\n, and entertained me with gossip about scores of contemporary and earlier mathematicians, I gained more in a general way than from anyone else. As for\nCayley\n, I had attended only a few of his lectures on the 'Calculus of the Extraordinaires' when one day he slipped on the icy pavement and suffered a fracture of the leg which brought the lectures to an end. Before the end of my stay, however, I had the pleasure of dining with Mr and Mrs\nCayley\nin their home.\nBack in the United States, Fiske completed his research being awarded his doctorate in\n1888\nafter submitting his thesis\nThe Theory of Concomitants of Algebraic Form\n. He was appointed as a tutor in mathematics at Columbia University in\n1888\nand was successively promoted to instructor in\n1891\n, adjunct professor in\n1894\n, and full professor in\n1897\n. He held the post of professor at Columbia from then until he retired in\n1936\n. We will give more details below of the roles he played both nationally and at Columbia University. However, let us record here that from\n1889\nto\n1895\nhe was in charge of instruction in mathematics at Barnard College and acted as Dean of Barnard College in\n1899\n.\nFiske is of little importance as a research mathematician. He published a few papers on elliptic integrals and surface integrals during his career, as well as a number of papers on mathematical education. Later in his career he wrote some encyclopaedia articles on elliptic functions, functions of real and complex variables and a couple of others. He was the author of 'Theory of Functions of a Complex Variable' which was contained in Merriam and Woodward's\nCourse of Higher Mathematics\n. Fiske's monograph\nTheory of Functions of a Complex Variable\nwas published by John Wiley & Sons in\n1906\n.\nHis real importance, however, is that he was the founder of the\nAmerican Mathematical Society\nin\n1888\n. He writes in\n[\n8\n]\n:-\nOn my return to New York I was filled with the thought that there should be a stronger feeling of comradeship among Americans who were interested in mathematics, and I proposed to two fellow students, Jacoby and Stabler, that we should try to organise a local mathematical society.\nHe announced the first meeting of the new society with the following message:-\nIt is proposed by some recent students of the graduate school of Columbia College to establish a mathematical society for the purpose of preserving, supplementing, and utilizing the results of their mathematical studies.\nHe described the reaction in\n[\n8\n]\n:-\nOn November\n24\n,\n1888\n, we three, together with Professors\nVan Amringe\nand Rees and a graduate student, Maclay, met for the purpose of organising a\nNew York Mathematical Society\n. We agreed upon the desirability of joining to our group all mathematicians resident in New York and the neighbourhood. However, at the end of the first year our society had only eleven members. In December,\n1889\n, five new members were admitted including\nMcClintock\nand Pupin. Five members were admitted during\n1890\n; one in January,\n1891\n; and one in February,\n1891\n.\nIn early\n1891\nthey began to prepare to publish a\nBulletin\n. Fiske designed the size and colour of the cover to be the same as\nJames Glaisher\n's\nMessenger of Mathematics\nwhere he had published papers written using the material from his thesis. The style of the\nBulletin\nwas, however, more modelled on the French\nBulletin des Sciences Mathématiques\nand the German\nZeitschrift für Mathematik und Physik\n. Soon, the members of the\nNew York Mathematical Society\nrealised that, for a number of reasons, it was being considered as a national society and they changed its name to the\nAmerican Mathematical Society\nin\n1894\n. Fiske served the new Society in a variety of ways, for example as secretary from\n1888\nto\n1895\n, as treasurer from\n1890\nto\n1891\n, as editor-in-chief of the\nBulletin\nof the\nAmerican Mathematical Society\nfrom\n1891\nto\n1899\n, as vice-president of the Society from\n1898\nto\n1901\n, as editor of the\nTransactions\nof the\nAmerican Mathematical Society\nfrom\n1899\nto\n1905\nand as president of the Society from\n1903\nto\n1904\n. On\n29\nDecember\n1904\nFiske delivered his Presidential Address to the Eleventh Annual Meeting of the\nAmerican Mathematical Society\n. He chose as his topic\nMathematical Progress in America\n. Fiske said\n[\n10\n]\n:-\nIn tracing the development of pure mathematics in America it seems convenient to recognize three periods. The first period extends from colonial days up to the establishment of the Johns Hopkins University in\n1876\n; the second period extends from the establishment of the Johns Hopkins University up to\n1891\n, when the\nNew York Mathematical Society\ntook on a national character and began the publication of its 'Bulletin'; the third period extends from\n1891\nup to the present time.\nFor a fuller version of Fiske's address in which he gives many details of the early days of the\nAmerican Mathematical Society\n, see\nTHIS LINK\n.\nR C Archibald\n[\n3\n]\ntalks of:-\n... the enormous debt which the Society owes to its able Founder, whose enthusiastic activities on her behalf during the first fifteen years of her existence, were so unremitting and so wise.\nOn\n1\nFebruary\n1913\n, Fiske married Natalie Page of New York City. We promised above to give more details of Fiske's roles both within Columbia University and also broader roles. He was appointed as secretary of the College Entrance Examination Board in\n1902\nand he was appointed chairman of the Committee on Instruction, Columbia University Faculty of Pure Science in\n1910\n. He was a fellow of the American Association for the Advancement of Science, and a member of the Association of Teachers of Mathematics of Middle States and Maryland, being president of that Association in\n1905\n-\n1906\n. He was the first chairman of Council of American Federation of Teachers of Mathematics and the Natural Sciences in\n1906\n-\n1907\n, chairman of the Committee on Mathematical Examinations in America, International Commission on Teaching of Mathematics,\n1911\n, and examiner in Mathematics, New York State Education Department,\n1909\n-\n1911\n.\nFiske was on the staff at Columbia University for\n48\nyears and, of course, he taught many courses and had many different colleagues through these years\n[\n11\n]\n:-\nHe was an enthusiastic lecturer, equally interested in undergraduate and graduate work, inspiring many students. His main courses were in the theory of functions and differential equations.\nWe choose to take an example of one year, namely\n1920\n-\n21\n, and look at the Mathematics Department at Columbia and see which courses were being taught in that year. Fiske was teaching two courses: 'Fundamental concepts in mathematics'; and 'Theory of functions'. W\n(\nilliam\n)\nBenjamin Fite\n(1869\n-\n1932)\nwas teaching 'Advanced calculus', and 'Differential equations'; Frank Nelson Cole was teaching 'Algebra'; George Adams Pfeiffer\n(1889\n-\n1943)\nwas teaching 'Analysis situs';\nJoseph Fels Ritt\nwas teaching 'Topics in theory of functions';\nEdward Kasner\nwas running the 'Seminar in differential geometry';\nDavid Eugene Smith\nwas teaching 'History of mathematics', and 'Practicum in the history of mathematics'; while Cassius Jackson Keyser\n(1862\n-\n1947)\nwas teaching 'Philosophy of mathematics'. Keyser had enrolled as a graduate student at Columbia University, earning the MA in\n1896\nand the Ph.D. in\n1901\n. He spent the rest of his career at Columbia, becoming the\nAdrain\nProfessor of Mathematics\n(1904\n-\n27)\nand Head of the department\n(1910\n-\n16)\n. He retired in\n1927\n.\nAt about the time we have chosen to look at the mathematics courses at Columbia University, a young student\nCarolyn Eisele\nwas beginning her undergraduate studies there.\nEisele\nwent on to become a world leading expert on\nC S Peirce\nand was appointed as a professor of mathematics at Hunter College. She is the author of\n[\n6\n]\nand she ends that paper by explaining that what she has written:-\n... is in part not only a tribute to the mathematical and logical ingenuity of one\nC S Peirce\nbut to that most enthusiastic promoter of the cause of mathematics, Thomas S Fiske. Since the last quarter century has been devoted to adding mathematical and scientific brushstrokes to the\nPeirce\nportrait, the writer now recalls with great satisfaction the impact of the Fiske lectures in a graduate course at Columbia University in the mid-twenties. In those days Columbia University was not granting doctorates in mathematics to women. In the course of sympathizing with my friend Helen and myself and advising us on a future course of action, Professor Fiske walked us merrily down Broadway to\n42\nnd\nStreet one evening after class, all the while plying us with fruit from the stands along the line in those different times. How much one might have learned from him about the\nC S Peirce\nwho was to absorb so much of the writer's attention so many years later!\nWe promised near the beginning of this biography to say a little about Fiske's brother, James Porter Fiske. James also studied at Columbia University but he became a medic, qualifying with an M.D. from the College of Physicians and Surgeons in\n1891\n. He practised in New York City, specialising in surgery and correction of deformities in children. In\n1941\n, when James Fiske was\n74\nyears old, he was killed in a three car collision while returning from Los Angeles to New York. The article\n[\n5\n]\nstates:-\nDue to the illness of Professor Fiske, he has not been told of his brother's death."
}