{
  "nome_completo": "Thomas Bond Sprague",
  "nome_curto": "Thomas Bond Sprague",
  "ano_nascimento": "1830",
  "ano_morte": "1920",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sprague/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Thomas Bond Sprague\n's father was Thomas Sprague\n(\nborn about\n1801)\nwho was a stationer. His mother was Ellen Sprague\n(\nborn about\n1801)\n. Thomas Bond Sprague had six younger siblings: Mary\n(\nborn about\n1831)\n, William\n(\nborn about\n1833)\n, Robert\n(\nborn about\n1834)\n, John\n(\nborn about\n1835)\n, Frances\n(\nborn about\n1837)\nand Caroline\n(\nborn about\n1839)\n. Thomas Bond Sprague married Margaret Vaughan Steains, daughter of James Steains, at St Mary, Edge Hill, Lancashire on\n13\nApril\n1859\n. They had six children\n(\nMary, Margaret, James, Charles, William and Alfred\n)\nThomas Sprague was the dominant actuary of the second half of the\n19\nth\ncentury, his supremacy unrivalled.\nDr Sprague was the main person behind the\nInternational Actuarial Notation\nwhich was adopted unanimously at the\n2\nnd\nInternational Congress of Actuaries in\n1898\n[\n1\n]\n. This established an\ninternational actuarial notation\n.\nDr Sprague was the main person behind a mortality study covering the experience of twenty U. K. life offices. This study resulted in the\nInstitute of Actuaries Life Tables\n(\nthe so-called\nTwenty Offices Table\n)\nwhich was published in\n1869\n[\n2\n]\n. From this study, he produced, in\n1879\n, the first\nSelect Tables of Mortality\n[\n3\n]\nwhich were the first two-dimensional mortality tables ever published\n(\nthe two dimensions being\n'insured duration'\ni.e.  the\n'select period'\nand\n'age attained'\n)\n. The\n'select period'\nwas five years.\nDr Sprague pioneered the important\n1870\nLife Insurance Companies Act\n[\n4\n]\nwhich was introduced following the notorious insolvencies of both the Albert and the European life assurance companies. The\n1870\nAct required:-\n... an investigation into the financial condition of a life insurance company to be made regularly by an actuary,\nrequired a separate\n\"long-term fund\"\nand required the:-\n... preparation of a revenue account and balance sheet every year in prescribed form to be filed with the Board of Trade,\nthe latter being a public document. Dr Sprague was one of the foremost advocates of the principle of\n'Freedom with Publicity'\n(\ni.e. documents available to the public\n)\nand was opposed to there being any Government regulation prescribing the manner of valuation of policy liabilities. He wrote the major\n19\nth\ncentury work on the preparation of life office accounts in conformity with the\n1870\nAct\n[\n5\n]\n.\nDr Sprague published some eighty papers in the Journal of the Institute of Actuaries and, including articles, Presidential Addresses, translations, comments and reviews for this and other actuarial journals\n(\nTransactions of the Faculty of Actuaries, Transactions of the Actuarial Society of Edinburgh\n)\n, his published contributions to actuarial science must number over one hundred. In addition, he published eight pure mathematical papers:\n[\n16\n]\nand\n[\n17\n]\nin the Transactions of the Royal Society of Edinburgh and six papers in the Proceedings of the Edinburgh Mathematical Society:\n[\n18\n]\n,\n[\n19\n]\n,\n[\n20\n]\n,\n[\n21\n]\n,\n[\n22\n]\nand\n[\n23\n]\n.\nA particularly memorable translation, from Danish, is Sprague's translation of Dr\nT N Thiele\n's\n1871\npaper on mortality\n[\n6\n]\n.\nThiele\nwas from\n1872\nto\n1910\n, among other appointments, the chief actuary of the Danish insurance company Hafnia.  Thiele stated, for the first time, a mathematical formula expressing the force of mortality throughout the whole of life. The\nThiele\n1871\nmathematical formula was not bettered until the\n1980\ns\n[\n7\n]\n.\nThiele\n's law, where\nx\nx\nx\nis the age and\nμ\nx\n\\mu_{x}\nμ\nx\n​\nis the force of mortality, is:-\nμ\nx\n=\nA\ne\n−\nB\nx\n+\nC\ne\n−\nD\n(\nx\n−\nE\n)\n2\n+\nF\nG\nx\n\\mu_{x} = Ae^{-Bx} + Ce^{-D(x-E)^{2}}  + FG^{x}\nμ\nx\n​\n=\nA\ne\n−\nB\nx\n+\nC\ne\n−\nD\n(\nx\n−\nE\n)\n2\n+\nF\nG\nx\nSprague was elected a Fellow of St John's College following his attainment, in\n1853\n, of the position of Senior\nWrangler\nand First Smith's Prizeman at Cambridge University\n(\nfirst place among those attaining first class honours in mathematics\n)\n[\n8\n]\n. The year before Sprague, in\n1852\n, the Senior Wrangler and First Smith's Prizeman had been\nP G Tait\n(\nas well as the Professor of Natural Philosophy at Edinburgh University and the founder of the mathematical theory of knots,\nTait\nwas a director of the Scottish Provident Institution, a life insurance company in Edinburgh\n)\nand the year after, in\n1854\n, the world-famous physicist,\nClerk Maxwell\nhad been second Wrangler\n(\nRouth\nbeing the Senior\n)\n, the two Smith's Prizes of\n1854\nbeing shared equally between these two eminent men. Dr Sprague qualified as a barrister prior to becoming an actuary and knew both\nTait\nand\nMaxwell\n.\nDr Sprague was the only person to have been President of both the Institute of Actuaries\n(1882\n-\n86)\nin London and the Faculty of Actuaries\n(1894\n-\n96)\nin Edinburgh. He was also President of the Actuarial Society of Edinburgh on three occasions\n(1874\n,\n1882\nand\n1891)\nand did much to mould the futures of all these bodies.\nHe was elected a Fellow of the\nRoyal Society of Edinburgh\n(\nFRSE\n)\nin\n1874\n[\n9\n]\nand of the\nEdinburgh Mathematical Society\n(\nEMS\n)\n. The University of Aberdeen made him an LL.D. in\n1893\n.\nDr Sprague was the actuary to the Equity and Law life insurance company from\n1861\n-\n1873\nwhen he was appointed to be Chief Executive\n(1873\n-\n1900)\nof the Scottish Equitable Life Assurance Society in Edinburgh\n(\nnot to be confused with the Equitable Life Assurance Society in London\n)\nretiring from business life at age\n70\n. When President of the Institute of Actuaries, from\n1882\n-\n86\n, he was resident in Edinburgh but travelled to London regularly to fulfil his role as President of the Institute.  He was on the Council of the Institute of Actuaries for thirty-eight years\n(1863\n-\n1900)\nand editor of the Journal of the Institute of Actuaries for\n16\nyears\n(1867\n-\n83)\n[\n10\n]\n.\nDr Sprague was invited by\nClerk Maxwell\n(\nthe latter being scientific editor, along with T H Huxley, of the\n9\nth\nEdition of the\nEncyclopaedia Britannica\n)\nto write the article on\n'Annuities'\n[\n11\n]\n. This article was a most thorough analysis of the contributions, including those of\nde Witt\n,\nHalley\n, and\nde Moivre\n, to the advancement of actuarial science.\nAt the\n1874\nmeeting of the\nBritish Association\nin Belfast\n(\nat which occasion\nClerk Maxwell\nwrote his poems entitled\n'Notes of the President's Address'\nand\n'Molecular Evolution'\n[\n12\n]\n)\n, Sprague gave a paper on the solvency of life offices\n[\n13\n]\nwhich the\n1870\nLife Insurance Companies Act\n(\nsee above\n)\ndid much to ensure.\nDr Sprague's one peculiarity was his advocacy of spelling reform which caused some difficulties with the Editorial Board of the Journal of the Institute of Actuaries as to whether his special brand of phonetic spelling should be permitted in the papers which he submitted e.g.\n'treatis', 'anser', 'articl', 'coud', 'giv', 'conclusiv', 'hav', 'ov'\n(\ne.g. the wording in reference\n[\n5\n]\nis not a mis-spelling\n)\n. However, such was the eminence of Dr Sprague that the Journal had no alternative but to permit it!\nIn Maclaurin House\n(\nthe home of the Faculty of Actuaries, named after\nMaclaurin\n, who, in\n1744\n, acted as consultant to the first pension fund in the world established on sound actuarial principles, namely the pension fund for the widows and children of the\n'Ministers of the Church of Scotland and the Professors at the Scottish Universities'\n)\nhis bust\n[\n14\n]\nstands alongside that of William T Thomson\n(\none of the founders of the Institute of Actuaries in\n1848\nand the Faculty of Actuaries in\n1856)\n. A bust\n[\n15\n]\nof him also stands in the main hall of Staple Inn, the home of the Institute of Actuaries.\nA prize for the best performance in  actuarial science, finance, insurance,\noperational research\n, probability and statistics in Part III of the Cambridge Mathematical Tripos is awarded each year in honour of Dr. Sprague.\nHis son, Alfred Ernest Sprague, MA, DSc, FFA, FIA was also President of the Faculty of Actuaries from\n1919\n-\n21\n."
}