{
  "nome_completo": "Tibor Gallai",
  "nome_curto": "Tibor Gallai",
  "ano_nascimento": "1912",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gallai/",
  "lugar_nascimento": "Budapest, Hungary",
  "lugar_morte": "Budapest, Hungary",
  "biografia": "Tibor Gallai\nwas brought up in Budapest but it was a difficult time with Jewish parents who were not well off. We should explain why being Jewish added to the family's difficulties. In\n1919\nthere was a Communist take-over of Hungary. A right wing government took over in\n1920\nand there was a rise of anti-Semitism with Jews attacked in the streets. In fact the anti-Semitism was written into law in\n1920\nwith universities only allowed to have\n5\n% of their students being Jewish. In fact Tibor was not born with the name \"Gallai\" but was actually named Tibor Grünwald. Many Hungarians with German sounding names changed them, for patriotic reasons, into names sounding Hungarian. Quite why the name Gallai was chosen is unclear other than it preserves his initials. We shall call him Gallai throughout this biography but in fact he was known as Tibor Grünwald up to the beginning of World War II. The last paper he published under the name Tibor Grünwald appeared in\n1939\n.\nBefore we go any further we need to clear up a potential difficulty. There were two mathematicians in Budapest in the\n1930\ns who were both named Grünwald, namely Tibor Grünwald\n(\nthe Tibor Gallai of this biography\n)\nand\nGéza Grünwald\n, but they were not related. Both published papers in the\n1930\ns, both even have joint papers with\nPaul Erdős\n, and they were both members of the same group of young Jewish mathematicians meeting together in Budapest.\nGéza Grünwald\n, born\n18\nOctober\n1910\nin Budapest, was\n20\nmonths older than Tibor.\nGéza\nattended the same high school as\nPaul Erdős\nand the two became good friends.\nGéza\nstudied at the University of Szeged, being awarded a Ph.D. in\n1935\nfor his thesis\nDivergence phenomena of Lagrange interpolating polynomials\n. He was advised by\nFrigyes Riesz\n.\nGéza\n, like many of his Jewish colleagues, served in a labour camp during World War II and was murdered along with other members of the camp in\n1942\n.\nLet us return to Tibor and quote from\nPaul Erdős\n(\nsee\n[\n1\n]\n)\n:-\nI met Tibor Gallai in\n1929\n[\nwhen he was known as Tibor Grünwald\n]\nwhen we were both in high school. We knew of each other's existence since we both worked at the 'Kozépiskolai Matematikai Lapok', a journal for high school students which appeared every month and published problems and their solutions by students. This periodical had an immense influence on Hungarian mathematics; many children before the age of\n15\nrealised that they wanted to be mathematicians, and many of the well-known mathematicians as young people worked in this journal.\nWe mentioned the\n1920\nlaw limiting the number of Jewish students at a university to\n5\n% of the total number of students. The winner of the high school mathematics competition automatically gained university entry and Gallai\n(\nas we will call him\n)\nwas extremely talented and expected to easily win the June\n1930\ncompetition held in his final year at high school. His teachers at the high school, however, prevented him from taking part, probably due to the anti-Semitic feelings in Hungary at this time. He might have been able to get into the Technical University to study engineering and he certainly seriously considered this, but his friends tried to persuade him not to take this route since they could see what an extraordinary talent he had for mathematics.\nThe\nEötvös\nCompetition was organised by the Mathematical and Physical Society and was founded in\n1894\n. This competition is for students up to the first year of university and consists of\n3\nproblems. Gallai sat the\n34\nth\nEötvös\nCompetition in the early autumn of\n1930\n. The three problems in that year were:\nHow many five-digit multiples of\n3\nend with the digit\n6\n?\nA straight line is drawn across an\n8\n◊\n8\nchessboard. It is said to pierce a square if it passes through an interior point of the square. At most how many of the\n64\nsquares can this line pierce?\nInside an acute triangle\nA\nB\nC\nABC\nA\nB\nC\nis a point\nP\nP\nP\nthat is not the circumcentre. Prove that among the segments\nA\nP\n,\nB\nP\nAP, BP\nA\nP\n,\nB\nP\nand\nC\nP\nCP\nC\nP\n, at least one is longer and at least one is shorter than the circumradius of\nA\nB\nC\nABC\nA\nB\nC\n.\nGallai won the\n1930\nEötvös\nCompetition and, as a result, began his university career in Budapest in the autumn of\n1930\nentering the Pázmány Péter University.\nPaul Erdős\nentered university at the same time and they both attended lectures by\nDénes König\non graph theory at the Technical University of Budapest. Gallai wrote the article\n[\n8\n]\nabout his teacher\nDénes König\n, writing in that article:-\nHe was a cheerful, sparkling man. He loved company; he enjoyed telling anecdotes. With his sarcastic humour he could entertain his company superbly. He liked his colleagues and was an indispensable participant in the coffee-house meetings of mathematicians.\nGallai began helping\nDénes König\nwith his graph theory book,\nTheorie der endlichen und unendlichen Graphen\nⓉ\n(\nTheory of Finite and infinite graphs\n)\nwhich was published in\n1936\n. In the book\nDénes König\nmentions results proved by Gallai and also makes use of some of Gallai's ideas.\nAlexander Soifer writes in\n[\n4\n]\n:-\nIn the early\n1930\ns Budapest, a group of young Jewish students regularly met in a park or took excursions to the countryside to discuss mathematics. ... the regular members of this remarkable group\n[\nwere\n]\n:\nPaul\n(\nPal\n)\nErdős\n, Tibor Grünwald\n(\nlater Gallai\n)\n,\nGergőr\n(\nGeza\n)\nGrünwald\n, Ester Klein,\nGyörgy\n(\nGeorge\n)\nSzekeres\n, Lily Székely\n(\nlater Sag\n)\n,\nPaul\n(\nPal\n)\nTurán\n, Endre Vázsonyi, and Marta Wachsberger\n(\nlater Sved\n)\n.\nThis group met at the Anonymous Statue and called themselves the 'Anonymous Circle'. When Gallai was in his first year of studies he proved the following result:\nIf the graph\nG\nG\nG\nhas vertices the lattice points in\n3\n-space, and two points are joined by an edge if they differ in only one coordinate by\n1\n, then\nG\nG\nG\nis both Hamiltonian and Eulerian.\nThis result led to Gallai's first published paper, a joint work with\nPaul Erdős\nand Endre Weiszfeld, with title\nOn Eulerian lines in infinite graphs\n(\nHungarian\n)\n(1936)\n. We note that Endre Weiszfeld is also known as Endre Vázsonyi\n(1916\n-\n2003)\n, changing his name in\n1937\nbecause of discrimination against Jews. Later he used the name Andrew Vázsonyi. In this paper the authors gave necessary and sufficient conditions for a denumerably infinite graph\nG\nG\nG\nto contain an\nEuler\nline extending infinitely in both directions and containing each edge of\nG\nG\nG\nexactly once. The original paper was published in Hungarian and, in\n1938\n, the same three authors published a German version of their paper,\nÜber Euler-Linien unendlicher Graphen\nⓉ\n(\nOn Euler lines of infinite graphs\n)\n, the third author using the name Endre Vázsonyi at this time.\nPaul Erdős\nexplains in\n[\n7\n]\nhow the result which today is known as the\nSylvester\n-Gallai theorem, came about. In\n1893\nSylvester\npublished the following problem in the\nEducational Times\n:\nProve that it is not possible to arrange any finite number of real points so that a straight line through every two of them shall pass through a third, unless they all lie in the same straight line.\nPaul Erdős\nwas unaware of the problem by\nSylvester\nbut, after reading the book\nAnschauliche Geometrie\nⓉ\n(\nDescriptive geometry\n)\nby\nHilbert\nand\nCohn-Vossen\nin\n1933\n, he conjectured the following:\nLet\nx\n1\n,\nx\n2\n,\n.\n.\n.\n,\nx\nn\nx_{1}, x_{2}, ..., x_{n}\nx\n1\n​\n,\nx\n2\n​\n,\n.\n.\n.\n,\nx\nn\n​\nbe a finite set of points in the plane not all on a line. Then there is always a line which goes through exactly two of the points.\nPaul Erdős\nwrites\n[\n7\n]\n:-\nI expected this to be easy but to my great surprise and disappointment I could not find a proof. I told this problem to Gallai who very soon found an ingenious proof. L M Kelley noticed about\n10\nyears later that the conjecture was not new. It was first stated by\nSylvester\nin the 'Educational Times' in\n1893\n. The first proof though is due to Gallai.\nAnother important result by Gallai is looked at in\n[\n3\n]\n. Alexander Soifer writes:-\nPaul Erdős\ntold me that Tibor Gallai discovered the theorem of our prime interest in the late\n1930\ns. He did not publish it either. It first appeared in a paper by\nRichard Rado\n(\nwith credit to \"Dr G Grünwald\", which was Gallai's last name then; the initial \"G\" should have been \"T\" and must be a typo\n)\n.\nRado\nsubmitted this paper on\n16\nSeptember\n1939\n; it is listed in bibliographies as a\n1943\npublication, but in fact came out only in\n1945\n; World War II affected all facets of life, and made no exception for the great Gallai result.\nWe doubt the \"T\" being a typo. More likely\nRado\nwas confused between Tibor Grünwald and\nGéza Grünwald\n, but of course, it should have been \"Dr T Grünwald\".\nAfter the award of his diploma from the Pázmány Péter University, Gallai  worked in insurance and in industry until\n1939\n. He was, however, much involved in mathematics research as the above shows, and he was working towards his Ph.D. His doctoral thesis is\nOn polynomials with real roots\n(\nHungarian\n)\n(1939)\n. The results in this thesis led to further advances in discussions with\nErdős\nand led to their joint paper\n(\nwritten in English\n)\nOn polynomials with only real roots\n(1939)\n.\nWorld War II broke out in\n1939\nwith Hungary allied to Germany and anti-Semitic laws were passed similar to those of Nazi Germany. Many Hungarian Jews were called up to serve in labour camps and we assume that this happened to Gallai but we have no details of his wartime experiences. The name  Tibor Gallai appears on a\n1945\n\"List of all allied Nationals and all other foreigners, German Jews and stateless etc who were temporarily or permanently stationed in the community, but are no longer in residence.\" This was registering foreigners and German persecutees in the American zone in Bavaria, Germany. Certainly when the war ended, Gallai returned to Budapest where he began teaching mathematics in the Jewish High School on Abonyi Street in Budapest. In the\n1930\ns there had been around\n1200\npupils in two schools on Abonyi Street, one for boys and one for girls, but during World War II the buildings were taken over by the military and the pupils taught in temporary accommodation. The schools closed completely in March\n1944\nwhen the Germans occupied Budapest but, after the end of the war, reopened on Abonyi Street. At this school, he taught\nVera Sós\nfor four years.\nPaul Erdős\nwrites in\n[\n8\n]\nthat Gallai:-\n... is not only a first rate mathematician but also an excellent teacher. From\n1945\nto\n1949\nhe taught in the Jewish high school for girls in Budapest. In one year he had\n22\nstudents. Six of them became mathematicians and one of them,\nVera T Sós\n, became one of the leading mathematicians in Hungary.\nSós\nsaid in the interview\n[\n10\n]\nin the year\n2000\n:-\n[\nGallai\n]\ntaught me for four years from the age of fourteen. ... He gave some of us special tasks. He handed us the High School Mathematical Magazines, which only came as stencilled copies after the war. He sent us to competitions. Thanks to him, I was able to get to know\nAlfred Rényi\n,\nRózsa Péter\n, and\nPaul Erdős\nwhen I was a high school student. But perhaps more importantly, it was Gallai who introduced me to the joy of understanding, of discovering, of the attractiveness of mathematics.\nGallai became a university professor in\n1949\nwhen he was appointed to the Budapest Technical University.\nPaul Erdős\nwrites in\n[\n7\n]\nthat Gallai:-\n... was one of the most popular and successful teachers. In spite of the fact that he was fairly severe at the examination he was greatly beloved by his students. He and\nRózsa Péter\nwrote a very interesting and excellent textbook of mathematics for high school students. He was always ready to help his colleagues and students when ever they needed advice or help in mathematical or personal matters.\nIn fact Gallai, with\nRózsa Péter\n, published a series of mathematics textbooks beginning in\n1949\n. These books were based on modern mathematical ideas and, in some sense, were the predecessors of the 'New Mathematics' way of teaching, popular in Britain and the United States, and to a lesser extent other European countries, in the\n1960\ns and\n1970\ns.\nWe get another view of Gallai as a lecturer at Budapest Technical University from Steven L Kaczeus, and we also see a little of student life at this time, in\n[\n2\n]\n. Kaczeus, together with his friend Peter Hollanda, moved into their dormitory on Bartok Bela Street in August\n1952\nand completed their university registration on the same day. Kaczeus writes\n[\n2\n]\n:-\nThe courses we have taken were Marxism-Leninism, this was a political course, the Mathematics, Geometry, Machine Sciences, Engineering drawing, Chemical Sciences, Russian Language and National Defence. The last one was a military course with the intent to prepare us to finish this course and become an officer of the Hungarian army. I personally enjoyed very much the technical courses especially mathematics with our professor Mr Tibor Gallai. The professors in a large room gave lectures with about two hundred students from various faculties. The individual tables and chairs were on a declining floor, so the visibility to the lecturer and the blackboard was excellent. Before the professor entered the room we were all standing as a respect for the professors. Later the details of the presentation and practice of the subjects was provided in a small room with about twenty students with the supervision of teachers. These were our classmates.\nGallai remained at the Budapest Technical University until\n1958\nwhen he resigned and became a research worker at the Research Institute of Mathematics of the\nHungarian Academy of Sciences\n. He worked there for ten years.\nWe have already mentioned the fact that Gallai taught\nVera Sós\nat the Jewish High School on Abonyi Street in Budapest. In the interview\n[\n10\n]\nshe was asked to describe Gallai in a few sentences:-\nYou may be surprised that I do not start with him as a mathematician, but rather about his human qualities. Gallai was an infinitely pure man. He stood for the highest of moral standards, morality, human integrity, of which there are very few examples. Even now, years after his death, he is often referred to at conferences: Gallai was the first to prove this point, but he never published it. There are several such items that have since been named after others. He raised his values high, published only his best achievements, his international influence is very significant. Here is a typical story: in\n1956\n, the year of the Great Flood, he received the Kossuth Prize, but the money which came with the prize he gave, as it was, to the victims of the flood. Needless to say, Gallai was never a rich man. As usual, 'Matematikai Lapok' published an article about his award-winning work. Then\nPál Turán\n, one of his best friends, was the editor-in-chief of the journal. Gallai wrote him an official letter in which he complained that the\nJános Bolyai Mathematical Society\njournal had given such a commendable article about his work that he had, therefore, left the Society in protest.\nHere is another image of the man. Gallai moved to the University of Technology in\n1948\n-\n49\n, where he became head of the Department of Mathematics. He then resigned and headed to the Mathematical Research Institute. At the age of fifty-five, he left the Institute. He had saved little money, and the mathematician had nothing much to do at that time. For five years, he lived very poorly, in an ascetic manner, without pension or benefits. In fact, no one, not even his closest friends, have ever explained why he had left the Institute. Unfortunately, his wife soon became very ill. For more than ten years, Gallai had been with her from morning to night, doing everything required for such a disease. He had to stop doing mathematics. The exceptions were the short periods when\nErdős\nwas at home. He always went to Gallai and encouraged him to think about mathematics. When his wife died, Gallai was already seventy years old. He picked up the topics he once stopped and wrote some very serious articles. There remained a keen interest and passion for mathematics, even though he had overshadowed it for many years.\nWe have already seen that Gallai was reluctant to publish his results. Alexander Soifer writes in\n[\n3\n]\n:-\nGallai discovered a number of fabulous results, some of which were named after other mathematicians: he preferred not to publish even his greatest results. Why? On\n20\nJuly\n1993\nin Kesztely, Hungary, during a dinner my wife Maya, our baby Isabelle, and I shared with\nGeorge Szekeres\nand Esther Klein, the legendary couple from the legendary circle of young Jewish mathematicians in early\n1930\ns Budapest, I was able to ask them about the friend of their youth.\n\"Gallai was so terribly modest,\" explained\nGeorge Szekeres\n. \"He did not want to publish because it would show the world that he was clever, and he would be restless because of it..\" \"But he was very clever indeed,\" added Esther Klein-Szekeres. Esther continued: \"Once I came to him and found him in bed. He said that he could not decide which foot to put down first.\" \"Gallai was\nPaul Erdős\n's best, closest friend,\" continued George. \"I was very close with\nTurán\n. It was later that\nPaul Erdős\nand I became friends.\"\nFinally, let us end this biography with words from Gyula O H Katona, a Hungarian mathematician who works in conbinatorial set theory and was the secretary-general of the\nJános Bolyai Mathematical Society\nat the time of Gallai's death:-\nGallai believed in \"communism\" in spite of his reservations in the actual realisation. When I started to work for the Mathematical Institute\n(\nnow the\nRenyi\nInstitute\n)\nhe was the party secretary there. Around\n1967\nor\n1968\nhis wife became seriously ill. He decided to stay at home to be able to take care of her. But he was\n2\nor\n3\nyears short of the retirement age. Therefore he had no income for these years. We said to him \"you come to the Institute each week for an hour and work at home.\" He said \"No, if I am an employee, I have to do some organisation work for the Institute and this needs more time to be there.\""
}