{
  "nome_completo": "Tom Mike Apostol",
  "nome_curto": "Tom Apostol",
  "ano_nascimento": "1923",
  "ano_morte": "2016",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Apostol/",
  "lugar_nascimento": "Helper, Carbon County, Utah, USA",
  "lugar_morte": "Pasadena, California, USA",
  "biografia": "Tom Apostol\n's parents were Emmanouil Apostolopoulos\n(\nborn about\n1894)\nand Efrosini Pappathanasopoulos\n(\nborn about\n1900)\n. Emmanouil Apostolopoulos was a Greek whose two brothers had emigrated to the United States to work in the mines in Montana. They paid for Emmanouil to travel from Greece to the United States in\n1916\nand, thinking the mines of Utah paid more than those in Montana, he went there but discovered that he suffered from claustrophobia so, having been an apprentice shoemaker in Greece, set up a shop repairing shoes in Helper. His business went well and after sending money back home to Greece to pay for dowries for his sisters he thought about marriage himself. By this time he had decided that his Greek name was not right in America, so he called himself Mike Apostol. Mike had little education so could hardly write but he got a Greek friend to write to someone who had been one of his friends back in Greece asking if any his sisters, whom he did not know, would marry him. Efrosini was the youngest sister and, after her older sisters said they did not want to go to the United States, she agreed to go and become Mike's wife.\nMike\n(\nwho was\n28\nyears old at this time\n)\ntravelled to New York and met Efrosini\n(\nwho was\n22\nyears old\n)\nwhen her ship arrived there. They married immediately and then travelled back to Helper by train. Efrosini, who had lived in Greece with spectacular views over the Bay of Corinth, was upset when she arrived in Helper, which was a desolate isolated place. Their home was on Main Street, close to the railway station, a house which Emmanouil had bought. Tom, the subject of this biography, was the eldest of their four children who were all born in this house in Helper. His younger siblings were sisters Kay and Betsie, and brother John. Apostol explained in\n[\n2\n]\nhow his early education was from his mother:-\nMy mother was very sharp. She finished the fifth or sixth grade in school - about as far as Greek girls could go in those days - so she could read and write much better than my father. She loved poetry and had memorized many poems, some of them quite lengthy. She also composed long poems of her own, most of them with a touch of humour. She taught me to memorize them, and she also taught me to read Greek. By the age of three I could read the Greek newspaper.\nApostol's parents spoke Greek at home, essential at first since his father spoke little English. His first language was, therefore, Greek with English being a second language. He learnt English from neighbours and their children before he entered Helper Central School, a two storey building where children were taught up to the sixth grade. Teaching was surprisingly good with considerable emphasis on arithmetical skills.\nThe years of the Depression were hard times and, to help out the family finances, Apostol's mother took in laundry. Apostol and his three siblings all had to help out picking up and delivering the laundry. Some of this work was not done for money but, for example, she did laundry in exchange for piano lessons for Apostol and his eldest sister. In addition to running the shoe shop, his father also made wine with grapes he ordered from California. All the children helped tread the grapes.\nHelper was growing larger and, just as Apostol finished sixth grade, they opened a new Junior High School. Grade\n7\nmathematics was arithmetic with business applications which Apostol did not enjoy, learning nothing new. However, he was taught algebra in Grade\n8\nby Mr Pisa who also taught him Euclidean geometry in Grade\n9\n. This he found exciting and, for the first time, mathematics made sense to him. After these three years at the Junior High School, he went for the next year, Grade\n10\n, to Carbon Senior High School in Price, a town slightly larger than Helper with a population of about\n4000\nabout\n10\nkm south of Helper.\nApostol's mother wanted him to have the opportunity to study at university and, having made the occasional visit to Salt Lake City to visit relatives, she suggested that the family move there which would let Apostol attend the University of Utah while living at home. Apostol's father was reluctant to leave Helper but they made a visit to Salt Lake City and found a shop for sale which was both a shoe repair business and a dry cleaning business. Apostol's mother said she would run the dry cleaning business and, after much persuasion, Apostol's father agreed. They moved there and Apostol spent one year at the South High School in Salt Lake City, helping out in the family business after school, before entering the University of Utah. Mathematics teaching at the High School had been mixed, with poor algebra teaching in the first semester but much better teaching of trigonometry and solid geometry in the second semester from Mr Bird. At this stage Apostol's favourite subject was chemistry, but he had broad interests.\nIn\n1940\nhe entered the University of Utah with the aim of majoring in chemistry but also took mathematics courses. He was particularly enthused by one of his mathematics teachers\nAnna Stafford Henriques\n. He said in the interview\n[\n2\n]\n:-\nMy best mathematics teacher was\nAnna Henriques\n, who taught me college algebra and analytic geometry. She's in her nineties now and lives in a retirement complex in Virginia. I telephoned her recently, and she remembers me very well.\nAt this stage Apostol had an excellent chemistry teacher who had just graduated from the University of Washington, Seattle, so he decided that he would like to transfer there. This was not easy because he needed to support himself which he did with a number of jobs. He entered the University of Washington in\n1942\nand majored in chemical engineering but took many mathematics courses. Taking an advanced calculus course given by Herbert Samuel Zuckerman he was impressed\n[\n2\n]\n:-\nHe explained things well, made it interesting, and made everything look so easy.\nApostol also took Zuckerman's number theory course, Clyde Myron Cramlet's differential equations course, Thomas McFarlane's complex variable course, and Roy Martin Winger's projective geometry course. His final year,\n1943\n-\n44\n, was very busy since, in addition to attending courses during the day, he worked nights at Boeing Aircraft inspecting wings for Flying Fortresses. He graduated with a B.S. in Chemical Engineering in May\n1944\n. He worked at Kaiser Shipyards in Portland, Oregon, during the summer, then returned to the University of Washington to take up postgraduate studies in mathematics.\nFor his Master's Degree in mathematics, Apostol was advised by Zuckerman. He studied\nKonrad Knopp\n's book\nTheory and Applications of Infinite Series\nalong with one other student and they took turns to lecture each day on what they had learnt, with Zuckerman continually questioning their understanding. Apostol wrote a Master's thesis on magic squares extending work by\nDerrick Norman Lehmer\n. He was awarded an M.S. in Mathematics from the University of Washington in\n1946\n. Although Apostol would have liked to remain at the University of Washington and study for a Ph.D. with Zuckerman, he was advised to go to the University of California, Berkeley, and study with\nDerrick Henry Lehmer\n,\nDerrick Norman Lehmer\n's son.\nJane Clark Thornton, the daughter of Maurice Thornton and Ella Virginia Strasbaugh was born in Crisfield, Maryland on\n14\nMarch\n1922\n. She grew up in Baltimore and graduated from Goucher College in\n1941\nwith a degree in English. During the war she worked on deciphering German messages that had been encrypted by Enigma machines. She married Frank Eber Goddard Jr\n(1915\n-\n2007)\nand they lived in Altadena, California. They had one son, Stephen H Goddard. In\n1946\nApostol met Jane when the two were both working for the Adlai Stevenson presidential campaign. Jane and her husband divorced and she married Apostol in\n1949\n.\nFor his first year at Berkeley,\n1946\n-\n47\n, Apostol was supported by a special scholarship for students from Utah while in his second year of research he was employed as a teaching assistant. He attended courses by\nAlfred Tarski\non algebra,\nLamberto Cesari\non classical analysis, and\nRaphael Robinson\non symbolic logic. To be able to read German texts he learnt German and then translated parts of various classic texts. He was awarded a Ph.D. in\n1948\nfor his thesis\nA Study of Dedekind Sums and their Generalizations.\nHe remained at Berkeley for the academic year\n1948\n-\n49\nlecturing at the University of California before going to the Massachusetts Institute of Technology in Cambridge, Massachusetts, in\n1949\nwhere he was appointed to a C L E Moore Instructorship.\nAlthough MIT was a good place, Apostol was quite keen to get back to California. He spent one year at MIT, teaching courses on advanced calculus and on analytic number theory. He sat in on a course on differential equations given by\nNorman Levinson\n, which was excellent, but gave up on a course on\nFourier\nanalysis by\nNorbert Wiener\nwhom he said was a terrible lecturer. Although he could have spent another year at MIT, when he was offered an assistant professorship at Caltech he quickly accepted. He took up this position in\n1950\n. He was promoted to associate professor in\n1956\n, and to full professor in\n1962\n.\nApostol began publishing papers in\n1950\n. The papers he published in\n1950\n-\n51\nare:\nGeneralized Dedekind sums and transformation formulae of certain Lambert series\n(1950)\n;\nAsymptotic series related to the partition function\n(1951)\n;\nIdentities involving the coefficients of certain Dirichlet series\n(1951)\n;\nRemark on the Hurwitz zeta function\n(1951)\n; and\nOn the Lerch zeta function\n(1951)\n. To many mathematicians, Apostol is best known as a writer of high quality textbooks. He explained in\n[\n2\n]\nhow he became a textbook writer:-\nI was asked to teach the advanced calculus course, which had been using volume two of\nCourant\n's 'Differential and Integral Calculus' from the\n1920\ns. It was a very good book, but too low-level for that kind of course. There was no book in English that was intermediate between elementary calculus and real variable theory, sort of an introduction to both real and complex analysis. When Morgan Ward and I were assigned to teach the course for\n1953\nand\n1954\n, we couldn't find an appropriate text ... We made a tentative plan to write up a few chapters over the summer, and then get together in September to see what we had come up with. I spent the summer in Oregon working like crazy, and when I came back I found that Morgan had forgotten all about it. So I offered to write up a set of lecture notes by myself, which I did. ... Warren Blaisdell, who was then vice-president of Addison-Wesley, heard about those notes and asked if he could have them refereed, with the idea of publishing them as a book. ... he got some very enthusiastic responses from the reviewers and sent me their critiques. So I spent another summer working like crazy to transform them into a publishable manuscript.\nTo read extracts of some reviews of Apostol's book\nMathematical analysis: a modern approach to advanced calculus\n(1957)\nsee\nTHIS LINK\n.\nHis next venture into writing textbooks was his famous two volume\nCalculus\nbook. The first volume\nIntroduction with vectors and analytic geometry\nappeared in\n1961\nwith the second volume\nCalculus of several variables with applications to probability and vector analysis\nbeing published in the following year. As with his\nMathematical Analysis\nbook, it was the need of a textbook to cover these topics which drove the project. However, it began as a collaborative effort among mathematics staff at Caltech who, with input from physicists, spent a year deciding on the topics that needed to be covered. Only after the year did the question of who would write the book arise and, since Apostol had the experience and was keen to do it, he became the obvious choice. The book began as a series of notes that Apostol produced, following the ideas they had already discussed, for delivering the first year course, and then the second year course. These notes became the famous two volume\nCalculus\nbook known locally as \"Tommy\n1\n\" and \"Tommy\n2\n.\"\nTo read extracts of some reviews of Apostol's book\nCalculus I\n(1961)\nand\nCalculus II\n(1962)\nsee\nTHIS LINK\n.\nApostol's other famous two-volume work is on analytic number theory. The two volumes\nIntroduction to analytic number theory\nand\nModular functions and Dirichlet series in number theory\nwere both published in\n1976\n. For extracts from some reviews see\nTHIS LINK\n.\nAround the time that Apostol was working on his analytic number theory volumes, his wife was beginning a career as a highly successful author of articles and books on local history. In\n1974\nJane Apostol began publishing research articles, mostly on South Pasadena local history. Her first book was\nSouth Pasadena: A Centennial History\n1888\n-\n1988\n, published in\n1987\n. This was the first of fifteen books that she wrote. All her research articles were republished in the\n2012\nbook\nJane Apostol: Collected Works\n, edited by Tom Apostol. Jane died less than three months after her husband.\nThere is one other project that Apostol undertook which we must mention. This is\nProject MATHEMATICS!\nand it is important that we look at this project since Apostol writes\n[\n2\n]\n:-\nOf all the things I've done in my\n50\nyears as a mathematician, the most satisfying has been producing and directing the videos for 'Project MATHEMATICS!'.\nWe give some information about this project at\nTHIS LINK\n.\nApostol received many awards for his outstanding contributions, especially for his mathematical exposition. He received the Associated Students of the California Institute of Technology's award for teaching excellence in\n1982\n. He received the Trevor Evans Award from the\nMathematical Association of America\nin\n1998\nand the same Association awarded him their\nLester R Ford\nAward in\n2005\n,\n2008\nand\n2010\n. Also in\n2010\nthe\nMathematical Association of America\ninducted both Tom and Jane Apostol into their Icosahedron Society, which recognises those who have shown extraordinary generosity to the Association. In\n2001\nhe was elected to the Academy of Athens. When the\nAmerican Mathematical Society\ninstituted the class of \"Fellows of the\nAmerican Mathematical Society\n\" in\n2012\n, Apostol was one of the inaugural class.\nApostol retired in\n1992\nbut continued to live in Pasadena with his wife. Neither stopped working at this time, however, and both published important books in the final\n24\nyears of their lives until both died in\n2016\n.\nIn the obituary\n[\n9\n]\nLori Dajose quotes from three of Apostol's colleagues at Caltech:-\nTom was a great scholar and a beloved teacher and mentor. Generations of Caltech students benefited from his passion and dedication.\nTom Apostol was a great human being and mathematician, and an inspiration to many. He was very famous the world over for his immense talent for mathematical exposition.\nHis books set a high standard but remained accessible to many, as decades of Caltech undergraduates would testify, while his videos have stimulated high school students to pursue the beauty of mathematics."
}