{
  "nome_completo": "Tommaso Boggio",
  "nome_curto": "Tommaso Boggio",
  "ano_nascimento": "1877",
  "ano_morte": "1963",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Boggio/",
  "lugar_nascimento": "Valperga Canavese, Italy",
  "lugar_morte": "Turin, Italy",
  "biografia": "Tommaso Boggio\nwas born in Valperga Canavese which is about\n40\nkm north of Turin. His parents, Francesco Boggio and Anna Fassino, were a family of modest means whose ancestors had lived in the region since\n1500\n. The family moved from Valperga Canavese to Turin when Tommaso was a child and it was in Turin that he was educated. Even in elementary school, he showed that he was extremely intelligent. He then studied in the Physics and Mathematics section of the Sommeiller Technical Institute in Turin. He entered a competition for a scholarship at the Collegio delle Provincie in October\n1895\n. There was only one award available but, after being examined by\nGiuseppe Peano\n, he came top from the thirteen who competed for the place. This was important since once into the Collegio delle Provincie he was guaranteed a place at the University of Turin. There he was taught by\nPeano\nwho was a major influence on his career. He also won scholarships in the years\n1896\n-\n97\nand\n1898\n-\n99\n. These three scholarships were absolutely necessary to fund his undergraduate studies but they were only just sufficient and he still had considerable financial difficulties. He graduated on\n8\nJuly\n1899\nfrom Turin with 'high honours' in pure mathematics and was appointed in November as an assistant in projective and descriptive geometry to\nMario Pieri\nat the University of Turin.\nPieri\nleft Turin in\n1900\nand Boggio continued to teach projective and descriptive geometry. While he tutored geometry at the university in his assistant position, Boggio was undertaking research in applied mathematics. He published four papers in\n1900\n, for example\nSull'equilibrio delle membrane elastiche piane\nⓉ\n(\nOn the equilibrium of plane elastic membranes\n)\nand\nUn teorema di reciprocità sulle funzioni di Green d'ordine qualunque\nⓉ\n(\nA reciprocity theorem on  Green's functions of any order\n)\n. In the first of these, Boggio obtained a solution for the problem of an elastic membrane, displaced in its own plane with known displacements on the boundary. In\n1901\nhe published seven papers including\nSopra alcune funzioni armoniche o bi-armoniche in un campo ellittico od ellissoidico\nⓉ\n(\nOn some harmonic  or bi-harmonic functions  in an elliptical or ellipsoidal field\n)\nand\nSull'equilibrio delle piastre elastiche incastrate\nⓉ\n(\nOn the equilibrium of embedded elastic plates\n)\n. In\n1903\nhe was appointed to teach mathematical physics at the University of Pavia and as an assistant to\nGiuseppe Peano\nto teach calculus at the University of Turin. Boggio remained at Turin and Pavia, teaching a variety of different courses, until\n1905\nwhen, after a competition, he was appointed Professor of Mathematics of Finance at the Royal Higher School of Commerce of Genoa, later part of the Faculty of Economics and Commerce of the University of Genoa. In\n1906\nthe Paris\nAcademy of Sciences\nproposed 'The theory of the equilibrium of supported elastic plates' as the topic for their competition for the Vaillant Prize. Twelve mathematicians, from different countries, submitted entries for the prize which was judged by\nHenri Poincaré\n. Four entries were deemed worthy of a share of the\n4000\nfranc prize, namely those by Boggio,\nJacques Hadamard\n, Arthur Korn\n(1870\n-\n1945)\nand  Giuseppe Lauricella\n(1867\n-\n1913)\n.\nIn\n1908\nBoggio moved again, this time to the position of Professor of Rational Mechanics at Messina in northeast Sicily. However disaster struck Messina on\n28\nDecember\n1908\nwhen an earthquake almost totally destroyed the city. Boggio was extremely fortunate to escape with his life as\n78000\npeople were killed by the earthquake. Messina was no longer a viable place for Boggio to work and, following a unanimous vote by the Faculty of Rational Mechanics and Mathematical Physics at the University of Florence, he was appointed to teach there. This only lasted a short time for, following the death of\nGiacinto Morera\nin\n1907\n, a competition was announced to fill his chair in Turin. Boggio  was successful and, in November\n1909\n, he was appointed Professor of Higher Mechanics at the University of Turin. In addition to teaching at the University, he also taught courses on Higher Mechanics and on Mathematical Analysis at the Military Academy in Turin. He also gave courses in various disciplines at the University of Modena.\nIn\n1918\nEnrico D'Ovidio\nretired from his chair in Turin and Boggio took over teaching algebraic analysis and analytic geometry. A text which Boggio wrote on the differential calculus with geometrical applications, published in\n1921\n, was reviewed by his colleague\nPeano\nwho says the books use of vector methods:-\n... constitutes that royal road sought in vain since the time of\nEuclid\n.\nMathematics was reorganised at Turin in\n1922\n. Boggio was director of the School of Algebra and Analytic Geometry in\n1921\n-\n22\n. In\n1923\n, as required by the Ministry of Public Instruction, the Chair of Complementary Mathematics was established. Topics in this were taught by Boggio in session\n1924\n-\n25\nbefore a new professor,\nFrancesco Tricomi\n, was appointed in\n1925\n. One of Boggio's most unfortunate publications was the book\nEspaces courbes. Critique de la Relativité\nⓉ\n(\nCurved spaces. Critique of relativity\n)\nwritten in collaboration with\nCesare Burali-Forti\nand published in\n1924\n. G Y Rainich writes in the review\n[\n8\n]\n:-\nThis book by two known Italian mathematicians makes one feel sad. It is an example of how intolerance can mislead even powerful minds in a field where we would least expect it. ... The authors of the book under review make it their purpose to get rid of all extraneous features in the theory of curved spaces and this purpose is very commendable but it must be said at once that in spite of some good ideas\n(\nthey recognize, for instance, the importance for the theory of what they call homographies, i.e. linear and multilinear vector functions\n)\ntheir attempt results in a failure. The situation may be best characterized by stating that the authors have not succeeded in introducing the most fundamental concept in the theory of curved space - the curvature, or the Riemann, tensor-in an intrinsic or absolute way, i.e. without the use of extraneous or arbitrary things. In their attempt to eliminate extraneous things they stopped half way: they got rid of coordinates but instead of studying curved space directly they use a representation of it on a Euclidean space, a representation which, as the authors themselves recognize, involves a certain degree of arbitrariness. But the really strange thing is that because in their treatment this tensor is introduced with the aid of notions which have no intrinsic significance the authors conclude that the tensor itself is of no or little importance. On this point\n(\nwhich is the central point in their criticism of the application of geometry of curved space to physics\n)\nBurali-Forti\nand Boggio are behind those geometers who while using coordinates succeed in discriminating as to which expressions have a meaning independent of them. And it must be remarked that, of course, it is possible to introduce the\nRiemann\ntensor intrinsically and that, in fact, the authors themselves were not so very far from it when they introduced the\nRiemann\ncurvature. ... Outside of this main line of attack on the relativity theory the authors bring forth against this theory all possible arguments without finding anything to say in its favour. Most of these arguments cannot be taken seriously ...\nWe must not allow this rather unfortunate publication in any way dim our view of the quality of Boggio's other contributions which were very substantial. Examples of his work which has proved important is\nSulle funzioni di Green d'ordine m\nⓉ\n(\nOn Green's functions of order m\n)\n(1905)\n, which contains what is known today as 'Boggio's Principle', and\nSull'equazione del moto vibratorio delle membrane elastiche\nⓉ\n(\nOn the equation of the vibratory motion of an elastic membrane\n)\nwhich contains his lower-bound lemma of certain elliptic operators. Several papers have been written during the last five years which generalise these and other results by Boggio. Also his various generalizations and applications of the\nLebesgue\nintegral are still of interest today. The famous Boggio-\nHadamard\nconjecture about the sign-definiteness of the\nGreen\nfunction of the clamped plate in smooth and convex domains was disproved by Duffin in\n1948\n. The conjecture essentially claimed that the biharmonic\nGreen\nfunctions with clamped boundary condition are always positive or, in physical terms, a clamped thin elastic plate is always bent to the direction of a point load placed at any position on the plate.\nBoggio taught Higher Geometry from\n1938\nto\n1940\n, then both Higher geometry, and Analytic and Projective geometry in\n1940\n-\n41\n. The years of World War II were extremely difficult ones for Boggio. Kennedy writes in\n[\n1\n]\n:-\nIn addition to his professorship, he also taught many courses at the Military Academy and he gave private lessons, even to his own university students, a fact which lowered him in the estimation of many. Boggio suffered many family difficulties. His wife is said to have been of little support to him, a daughter died during World War II and his second son died at the age of\n46\n(\nthe first son emigrated to Argentina\n)\n, leaving him to care for his daughter-in-law and two grandchildren.\nHis first son, Mario, was an engineer and emigrated with his family to Argentina. The second son, who died at the age of\n46\n, had graduated in philosophy. His daughter died in a sanatorium. These tragedies shook Boggio greatly but he bore the pain with great resignation.\nAfter the war ended he taught Higher Geometry from\n1945\nto\n1947\n, then Numerical Mathematics and Graph Theory in\n1947\n-\n48\n. In session\n1949\n-\n50\nhe taught Infinitesimal Calculus but by this time he was officially retired and taught as an assistant to the chair. He continued to publish after he retired, publishing\nSur un théorème de Darboux\nⓉ\n(\nOn a theorem of Darboux\n)\nin\n1960\nand\nSopra alcune questioni di meccanica razionale\nⓉ\n(\nOn some issues in rational mechanics\n)\nin the following year. Following his death, he was buried in the small cemetery at Axams, near Innsbruck, next to the grave of his second son.\nCataldo Agostinelli gives an indication of his character in\n[\n3\n]\n:-\nHe was a modest man, with simple ways and needs, yet he was strong and decent, friendly towards his colleagues and kind to his students. Generous and open-hearted, he worked willingly for his colleagues and friends, and was always generous to students with help and advice. He scrupulously fulfilled his academic duties. He was not free from flaws and shortcomings, like any human being, frequently causing opposition, so he did not receive the awards for his academic contributions that he deserved.\nHe did, however, receive many honours. He was elected to the Academy of Sciences of Turin in\n1924\nand was a member of the National Committee for Mathematics Research. In January\n1926\nbecame a knight of the Order of the Crown of Italy, in\n1931\nhe was appointed Grand Officer and, in\n1953\n, Commander of the Order of Merit of the Italian Republic. When he retired he was awarded the gold medal for merit from the Academy of Culture and Art. Shortly before his death he became the president of the Academy of Sciences of Modena. He had been made an honorary member of that academy in recognition of his work at the University of Modena carried out in extremely difficult circumstances during and shortly after World War II."
}