{
  "nome_completo": "Tommaso Ceva",
  "nome_curto": "Tommaso Ceva",
  "ano_nascimento": "1648",
  "ano_morte": "1737",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ceva_Tommaso/",
  "lugar_nascimento": "Milan, Hapsburg Empire (now Italy)",
  "lugar_morte": "Milan, Hapsburg Empire (now Italy)",
  "biografia": "Tommaso Ceva\nwas the brother of\nGiovanni Ceva\n. Their father, Carlo Francesco Ceva\n(1610\n-\n1690)\n, was a man who undertook many different activities such as buying and selling houses and land. He also worked for the duke of Milan in an official capacity, collecting excise duty. This meant that he was a wealthy man, able to provide a high quality lifestyle for his family. He married Paola Columbo, the daughter of Cristoforo Columbo and Elisabetta Caballina, on\n20\nSeptember\n1639\n. They had several children: Laura Maria Francesca Elisabetta Ceva\n(\nborn\n1640)\n, Clara Giustina Bonaventura Ceva\n(\nborn\n1642)\n, Iginio Nicolò Ceva\n(\nborn\n1644)\n, Francesco Ceva\n(\nborn\n1645)\n,\nGiovanni Benedetto Ceva\n(\nwho also has a biography in this archive, born\n1647)\n, Tomasso Ceva\n(\nthe subject of this biography, born\n1648)\n, Teresa Francesca Ceva\n(\nborn\n1650)\n, and Cristoforo Vittore Ceva\n(\nborn\n1652)\n. Laura, Iginio, Francesco, Tomasso, Teresa and Cristoforo all had ecclesiastical careers, with Francesco, Tomasso, Teresa and Cristoforo becoming Jesuits, joining the Society of Jesus.\nTomasso Ceva's cousin, also named Carlo Francesco Ceva, was the Bishop of Tortona.\nAfter studying in Milan at the Academy Braidense, on\n24\nMarch\n1663\n, while not yet fifteen years of age, he entered the Society of Jesus. After completing his religious education in Genoa and Nice, in\n1675\nhe returned to Milan, where in\n1682\nhe made his solemn vows. His education was entirely within the Jesuit Order and he obtained a degree in theology.\nTommaso Ceva became professor of mathematics and\nrhetoric\nat the Jesuit College of Brera in Milan and taught rhetoric, moral theology and mathematics there for more than forty years. During most of this time the city was under Spanish rule and Ceva made sure of their support by writing pieces to celebrate civic events and dedicating works to Guzman, the Spanish governor of Milan. Ceva published\nDe natura gravium\nin\n1669\n, a work which dealt with physics, particularly gravity, but this work is not mathematical but rather he took a philosophical, even thelogical, approach\n[\n1\n]\n:-\nCeva wrote the treatise in two months of steady work; in his \"Conclusion,\" he asks his readers for emendations.\nAt this stage he seems to accept at least some of\nIsaac Newton\n's ideas although later he rejected them, almost certainly because of the attitude of the Church. His most famous student at this College of Brera in Milan was\nGiovanni Saccheri\nwho began his studies there in\n1690\n. Many would suggest that Ceva's success in persuading\nSaccheri\nto undertake research in mathematics was his greatest contribution to the subject.\nHis mathematical work, almost entirely concentrated in the five years between\n1695\nand the end of the century, is summed up in\nOpuscula Mathematica\n(1699)\nwhich examines arithmetic, geometric-harmonic means, the cyloid, division of angles, higher order conic sections and curves, and gravity. He also designed an instrument to divide a right angle into a given number of equal parts. Although his\n1669\nwork appears to be accepting at least some of the new revolutionary ideas of the \"new physics\", in a book\nPhilosophia novo-antiqua\nof\n1704\nhe most certainly rejects the ideas of Copernicus and Descartes. During his career, Ceva corresponded with several other mathematicians including\nVicenzo Viviani\n,\nGuido Grandi\nand, of course, his brother\nGiovanni Ceva\nwho was living in Mantua\n[\n1\n]\n:-\nHigher-order curves are ... the primary subject of an extensive correspondence between Ceva and\nGuido Grandi\n. Ceva proposed the problem;\nGrandi\nreported that such curves had well-defined properties.\nGrandi\nreplied to Ceva's questions not only in letters, but also in a work on the logarithmic curve published in\n1701\nwith an appended letter by Ceva.\nCeva was a close friend of the mathematician Pietro Paolo Caravaggio\n(1617\n-\n1688)\n. Caravaggio, who was born in Milan, was professor of mathematics at a college in Milan where he taught both mathematics and Greek literature. Like Ceva, he published both mathematics\n(\nhis most famous work is\nIn Geometria Male Retaurata\n(1650))\nand poetry. Ceva also formed a close friendship with Caravaggio's son, also named Pietro Paolo Caravaggio\n(1658\n-\n1723)\n, who was an assistant to his father at the Milan College, becoming professor of mathematics there in\n1688\nfollowing his father's death.\nHowever, in many ways Tommaso Ceva was more of a Jesuit humanist than a mathematician, spending more time producing Latin prose than he did mathematics. He was a noted poet, his Latin poem\nJesus Puer\n, dedicated to the Holy Roman emperor Joseph I, being translated into many languages including German and Italian. It return, Joseph named Ceva 'Caesarian Theologian'. Milan had been under Spanish rule since the first half of the\n16\nth\ncentury but this weakened in\n1701\nwith the outbreak of the War of the Spanish Succession. In\n1706\nPrince Eugene of Savoy entered Milan. He became its first Austrian governor and the city was, from that time, under Austrian rule. Ceva immediately recognised the new rulers and transferred his allegiance to them.\nWe have mentioned some of Ceva's friends above, but there is another friend who we should mention since she played an important role in Ceva's career. This is Clelia Grillo\n(1684\n-\n1777)\n, the daughter of Marcantonio, the Marquess of Clarafuentes and the Patrizio of Genoa. She married Giovanni Benedetto Borromeo, the Count of Arona and Marquess of Angera, on\n7\nJuly\n1707\n- she is better known under her married name Clelia Borromeo. Cathy Kessel writes\n[\n4\n]\n:-\nShe read Latin, Italian, Spanish, French, English, German, and Arabic, and was so learned that a medal with the inscription \"Gloria Genuensium\"\n(\n\"Glory of the Genoese\"\n)\nwas struck in her honour. She corresponded with people in many European countries, and her home was frequented by cultivated citizens of Milan and illustrious travellers.\nClelia Borromeo was a competent mathematician and is described by Mozans\n(\nin\nWoman in Science\n)\n:-\nIn addition to a special talent for languages, she possessed so great a capacity for mathematics and mechanics that no problem in these sciences seemed beyond her comprehension.\nClelia Borromeo founded the Academy for Natural Science in Milan\n(\nthe Accademia dei Vigilanti\n)\nand both Tommaso Ceva and his student\nGiovanni Saccheri\nwere members of this Academy. Ceva gained much from his frequent visits to the Academy and it was through his friendship with Clelia Borromeo that he made contact with both\nVicenzo Viviani\nand\nGuido Grandi\n, corresponding with them on mathematical matters.\nIn addition to this scientific academy, Tommaso Ceva was also a fellow of the literary Academy of Arcadia from\n1718\n. This academy was founded in Rome in\n1690\nto promote a more natural, simple poetic style. In particular the academy promoted poetry written in the classical Greek or Roman style, so Ceva's poetic style fitted extremely well and his poetry was rated very highly by the Academy."
}