{
  "nome_completo": "Tonny Albert Springer",
  "nome_curto": "Tonny Springer",
  "ano_nascimento": "1926",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Springer/",
  "lugar_nascimento": "The Hague, The Netherlands",
  "lugar_morte": "Zeist, The Netherlands",
  "biografia": "Tonny Springer\nentered the University of Leiden in the Netherlands to study mathematics in\n1945\n. This was the year that World War II ended and the Netherlands began the slow process of recovery. After completing his initial studies, he continued to undertake research for his doctorate with\nHendrik Kloosterman\nas his advisor. He was awarded his doctorate in\n1951\nfor his thesis\nOver Symplectische Transformaties\nⓉ\n(\nOn Symplectic Transformations\n)\n.\nOlga Taussky-Todd\nwrites in a review:-\nSymplectic transformations in\nn\nn\nn\nvariables with a commutative coefficient field whose characteristic differs from\n2\nare investigated and invariants are established for the classes of conjugate elements. As in the case of the group of all non-singular linear transformations these invariants consist of irreducible polynomials and systems of non-negative integral numbers, but apart from these also equivalence classes of hermitian forms and of quadratic forms have to be included.\nSpringer had begun publishing mathematical papers well before undertaking the work for his doctoral thesis, having published papers with\nNicolaas de Bruijn\nsuch as\nOn the zeros of a polynomial and of its derivative\n(1947)\nand\nOn the zeros of composition-polynomials\n(1947)\n. He had also published the paper\nOn induced group characters\nin\n1948\nwhich was reviewed by\nRichard Brauer\nwho wrote:-\nIt was proved by the reviewer that every character of a group G of finite order is a linear combination with integral rational coefficients of characters of G induced by linear characters of subgroups. The author gives some simplifications of the proof.\nAfter the award of his doctorate, Springer went to France, spending the academic year\n1951\n-\n52\nat the University of Nancy. While there he proved a conjecture of\nErnst Witt\nmade in\n1937\n, namely:\nLet\nf\nf\nf\nbe a quadratic form over an arbitrary field\nK\nK\nK\nwith characteristic not equal to\n2\n. If\nf\nf\nf\nhas no zeros in\nK\nK\nK\n, then it has no zeros in any algebraic extension\nL\nL\nL\nof\nK\nK\nK\nof odd degree.\nSpringer published a proof of the conjecture in\nSur les formes quadratiques d'indice zéro\nⓉ\n(\nOn  quadratic forms of zero index\n)\nwhich appeared in\nComtes Rendus\nof the\nAcademy of Sciences\nin\n1952\n. After spending a year in France, Springer returned to the University of Leiden where he was appointed to a position which he held until\n1955\nwhen he accepted a lectureship at the University of Utrecht. In\n1959\nhe was named Professor of Mathematics at Utrecht, remaining in this chair until he retired in\n1991\nbecoming professor emeritus.\nAs research interests, Springer gives algebra and the theory of linear algebraic groups. He also list more recent research interests as: symmetric varieties and their compactifications,\nHecke\nalgebras, complex reflection groups. We mention the four important books which Springer has written. The first was\nJordan algebras and algebraic groups\n(1973)\n. Kevin McCrimmon begins a long review of this book as follows:-\nIn his review of the book \"Jordan-Algebren\" by H Braun and M Koecher\n(1966)\n, the present author took those authors to task for not sufficiently emphasizing the structure group as a linear algebraic group. The present book is designed to remedy that flaw. Throughout it is influenced by the work of Braun and Koecher, and many of the novel ideas in this book emphasize or make explicit results implicit in Koecher's work. It goes over much the same ground, but in the opposite direction: instead of starting with an algebra and seeing how its inverse encodes the algebraic information, the author starts simply from an inversion map satisfying the Hua identity and shows how to decode an algebraic structure from it.\nNear the end of his review McCrimmon writes:-\nFor the associatively-inclined this book expunges the dread word \"nonassociative\" from\nJordan\ntheory, since there is nothing nonassociative about inversion; most importantly, it makes\nJordan\nstructure theory accessible to the growing audience of persons familiar with root systems. By placing the classification of\nJordan\nalgebras in the perspective of classification of certain root systems, the book demonstrates that the structure theories of associative,\nLie\n, and\nJordan\nalgebras are not separate creations, but rather instances of the one all-encompassing miracle of root systems.\nSpringer's next book was\nInvariant theory\n(1977)\n. V L Popov writes:-\nThese notes had their origin in a course in invariant theory, given at the University of Utrecht in the autumn of\n1975\n. The purpose of the course was to give an introduction to invariant theory on an elementary level, illustrated by some examples from\n19\nth\ncentury\ninvariant theory\n.\nRobert B Gardner writes in a review:-\nThe notes are an enjoyable, readable account of the invariant theory of reductive algebraic groups, concentrating on delicate finiteness theorems. The general theory is illustrated by a detailed analysis of SL\n(2\n, K\n)\nand finite groups. In particular, the above mentioned theorems of\nMolin\nand\nChevalley\n-\nSerre\nare clearly presented and lead to interesting explicit calculations for classical reflection groups. I especially recommend these notes to any mathematician who wonders why finiteness theorems are important and how concepts like the integrality of extensions and\nNoether\nnormalization arose historically. The author has included many references and notes at the end of each chapter, indicating where various results first occurred and why they're significant.\nIn\n1981\nSpringer published\nLinear algebraic groups\nwhich was an expanded version of lectures on linear algebraic groups which he gave at the University of Notre Dame in the autumn of\n1978\n. He writes in the Introduction:-\nThese notes contain an introduction to the theory of linear algebraic groups over an algebraically closed ground field. They lead in a straightforward manner to the basic results about reductive groups. ... The main difference from the existing introductory texts on this subject ... lies in the treatment of the prerequisites from algebraic geometry and commutative algebra. These texts assume a number of such prerequisites, whereas we have tried to give proofs of everything. We have also tried to limit as much as possible the commutative algebra.\nThe fourth of Springer's books,\nOctonions, Jordan algebras and exceptional groups\n(2000)\n, was also based on lectures given by Springer, but these were given in\n1963\nin German at the University of Göttingen. It was written in collaboration with Ferdinand Veldkamp.\nAs we have seen from the descriptions of the above books, some have been the result of lecture courses given by Springer at different institutions. Over the years he has made many research visits and we give a list of the main ones:\nInstitute for Advanced Study, Princeton\n(1961\n-\n1962\n,\n1969\n,\n1983)\n;\nUniversity of Göttingen\n(1963)\n;\nInstitut des Hautes Études Scientifiques, Bures-sur-Yvette\n(1964\n,\n1973\n,\n1975\n,\n1983)\n;\nUniversity of California, Los Angeles\n(1965\n-\n1966)\n;\nTata Institute of Fundamental Research, Bombay\n(1968\n,\n1980)\n;\nUniversity of Paris VII\n(1971)\n;\nUniversity of Warwick\n(1973)\n;\nUniversity of Notre Dame\n(1978)\n;\nAustralian National University, Canberra\n(1981\n,\n1989\n,\n1991\n,\n1997)\n;\nUniversity of Paris VI\n(1984\n,\n1987)\n;\nUniversity of Rome II\n(\nTor Vergata\n)\n(1986)\n;\nUniversity of Basel\n(1993)\n;\nUniversity of Sydney, Australia\n(1995\n,\n1998\n,\n2001)\n;\nErwin-Schrödinger-Institute for Theoretical Physics, Vienna\n(2000)\n.\nWe end this biography by quoting from\n[\n2\n]\nregarding another of Springer's major contributions:-\nIn\n1976\n, Tonny Springer discovered the remarkable fact that the permutation group acts naturally on\n(\nthe cohomology of\n)\na collection of algebraic varieties, now called Springer fibers. Indeed, all of the irreducible representations - the building blocks of an arbitrary representation - can be constructed by examining the permutation action on a handful of these Springer fibers. Springer's original construction was completely algebraic but was followed by intense activity on the part of many people to give more intrinsically geometric explanations for these representations."
}