{
  "nome_completo": "Ulugh Beg",
  "nome_curto": "Ulugh Beg",
  "ano_nascimento": "1393",
  "ano_morte": "1449",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ulugh_Beg/",
  "lugar_nascimento": "Soltaniyeh, Timurid, Persia (now Iran)",
  "lugar_morte": "Samarkand, Timurid empire",
  "biografia": "Ulugh Beg\nwas the grandson of the conqueror Timur, who is often known as Tamerlane\n(\nfrom Timur-I-Leng meaning Timur the Lame, a title of contempt used by his Persian enemies\n)\n. Although in this archive we are primarily interested in Ulugh Beg's achievements in mathematics and astronomy, we need to examine the history of the area since it had such a major impact on Ulugh Beg's life.\nTimur, Ulugh Beg's grandfather, came from the Turkic Barlas tribe which was a Mongol tribe that was living in Transoxania, today essentially Uzbekistan. He united several Turko-Mongol tribes under his leadership and set out on a conquest, with his armies of mounted archers, of the area now occupied by Iran, Iraq, and eastern Turkey.\nShortly after his grandson Ulugh Beg was born, Timur invaded India and by\n1399\nhe had taken control of Delhi. Timur continued his conquests by extending his empire to the west from\n1399\nto\n1402\n, winning victories over the Egyptian Mamluks in Syria and the Ottomans in a battle near Ankara. Timur died in\n1405\nleading his armies into China.\nAfter Timur's death his empire was disputed among his sons. Ulugh Beg's father Shah Rukh was the fourth son of Timur and, by\n1407\n, he had gained overall control of most of the empire, including Iran and Turkistan regaining control of Samarkand. Samarkand had been the capital of Timur's empire but, although his grandson Ulugh Beg had been brought up at Timur's court, he was seldom in that city. When Timur was not on one of his military campaigns he moved with his army from place to place and his court, including his grandson Ulugh Beg, travelled with him.\nIn\n1409\nShah Rukh decided to make Herat in Khorasan\n(\ntoday in western Afghanistan\n)\nhis new capital. Shah Rukh ruled there making it a trading and cultural centre. He founded a library there and became a patron of the arts. However Shah Rukh did not give up Samarkand, rather he decided to give it to his son Ulugh Beg who was more interested in making the city a cultural centre than he was in politics or military conquest. Although Ulugh Beg was only sixteen years old when his father put him in control of Samarkand, he became his father's deputy and he became ruler of the Mawaraunnahr region.\nUlugh Beg was primarily a scientist, in particular a mathematician and an astronomer. However, he certainly did not neglect the arts, writing poetry and history and studying the Qur'an. In\n1417\n, to push forward the study of astronomy, Ulugh Beg began building a madrasah which is a centre for higher education. The madrasah, fronting the Rigestan Square in Samarkand, was completed in\n1420\nand Ulugh Beg then began to appoint the best scientists he could find to positions there as lecturers.\nUlugh Beg invited\nal-Kashi\nto join his madrasah in Samarkand, as well as around sixty other scientists including\nQadi Zada\n. There is little doubt that, other than Ulugh Beg himself,\nal-Kashi\nwas the leading astronomer and mathematician at Samarkand. Letters which al-Kashi wrote to his father have survived. These were written from Samarkand and give a wonderful description of the scientific life there. The contents of one of these letters has only recently been published, see\n[\n5\n]\n.\nIn the letters\nal-Kashi\npraises the mathematical abilities of Ulugh Beg but of the other scientists in Samarkand, only\nQadi Zada\nearned his respect. Ulugh Beg led scientific meetings where problems in astronomy were freely discussed. Usually these problems were too difficult for all except\nal-Kashi\nand the letters confirm that\nal-Kashi\nwas the closest collaborator of Ulugh Beg at his madrasah in Samarkand.\nIn addition to the madrasah, Ulugh Beg built an observatory at Samarkand, the construction of this beginning in\n1428\n. The Observatory, which was circular in shape, had three levels. It was over\n50\nmetres in diameter and\n35\nmetres high. The director of the Observatory was Ali-Kudschi, a Muslim astronomer.\nAl-Kashi\nand other mathematicians and astronomers appointed to the madrasah also worked at Ulugh Beg's Observatory.\nAmong the instruments specially constructed for the Observatory was a quadrant so large that part of the ground had to be removed to allow it to fit in the Observatory. There was also a marble sextant, a triquetram and an armillary sphere. The achievements of the scientists at the Observatory, working there under Ulugh Beg's direction and in collaboration with him, are discussed in detail in\n[\n4\n]\n. This excellent book records the main achievements which include the following: methods for giving accurate approximate solutions of\ncubic equations\n; work with the\nbinomial theorem\n; Ulugh Beg's accurate tables of sines and tangents correct to eight decimal places; formulae of spherical trigonometry; and of particular importance, Ulugh Beg's\nCatalogue of the stars\n, the first comprehensive stellar catalogue since that of\nPtolemy\n.\nThis star catalogue, the\nZij-i Sultani\n, set the standard for such works up to the seventeenth century. Published in\n1437\n, it gives the positions of\n992\nstars. The catalogue was the results of a combined effort by a number of people working at the Observatory including Ulugh Beg,\nal-Kashi\n, and\nQadi Zada\n. As well as tables of observations made at the Observatory, the work contained calendar calculations and results in trigonometry.\nThe trogonometric results include tables of sines and tangents given at\n1\n° intervals. These tables display a high degree of accuracy, being correct to at least\n8\ndecimal places. The calculation is built on an accurate determination of sin\n1\n° which Ulugh Beg solved by showing it to be the solution of a cubic equation which he then solved by numerical methods. He obtained\nsin\n1\n° =\n0\n.\n017452406437283571\nThe correct approximation is\nsin\n1\n° =\n0\n.\n017452406437283512820\nwhich shows the remarkable accuracy which Ulugh Beg achieved.\nObservations made at the Observatory brought to light a number of errors in the computations of\nPtolemy\nwhich had been accepted without question up to that time. Data from his Observatory allowed Ulugh Beg to calculate the length of the year as\n365\ndays\n5\nhours\n49\nminutes\n15\nseconds, a fairly accurate value. He produced data relating to the Sun, the Moon and the planets. His data for the movements of the planets over a year is, like so much of his work, very accurate\n[\n1\n]\n:-\n... the difference between Ulugh Beg's data and that of modern times relationg to\n[\nSaturn, Jupiter, Mars, Venus\n]\nfalls within the limits of two to five seconds.\nUlugh Beg's politics were not up to his science and, after his father's death in\n1447\n, he was unable to retain power despite being an only son. He was eventually put to death at Samarkand at the instigation of his own son 'Abd al-Latif. His tomb was discovered in\n1941\nin the mausoleum built by Timur in Samarkand. It was discovered that Ulugh Beg had been buired in his clothes which is known to indicate that he was considered a martyr. The injuries inflicted on him were evident when his body was examined\n[\n1\n]\n:-\n... the third cervical vertebra was severed by a sharp instrument in such a way that the main portion of the body and an arc of that vertebra were cut cleanly; the blow, struck from the left, also cut through the right corner of the lower jaw and its lower edge."
}