{
  "nome_completo": "Varahamihira",
  "nome_curto": "Varahamihira",
  "ano_nascimento": "505",
  "ano_morte": "587",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Varahamihira/",
  "lugar_nascimento": "Kapitthaka, India",
  "lugar_morte": "India",
  "biografia": "Our knowledge of\nVarahamihira\nis very limited indeed. According to one of his works, he was educated in Kapitthaka. However, far from settling the question this only gives rise to discussions of possible interpretations of where this place was. Dhavale in\n[\n3\n]\ndiscusses this problem. We do not know whether he was born in Kapitthaka, wherever that may be, although we have given this as the most likely guess. We do know, however, that he worked at Ujjain which had been an important centre for mathematics since around\n400\nAD. The school of mathematics at Ujjain was increased in importance due to Varahamihira working there and it continued for a long period to be one of the two leading mathematical centres in India, in particular having\nBrahmagupta\nas its next major figure.\nThe most famous work by Varahamihira is the\nPancasiddhantika\n(\nThe Five Astronomical Canons\n)\ndated\n575\nAD. This work is important in itself and also in giving us information about older Indian texts which are now lost. The work is a treatise on mathematical astronomy and it summarises five earlier astronomical treatises, namely the\nSurya, Romaka, Paulisa, Vasistha\nand\nPaitamaha\nsiddhantas. Shukla states in\n[\n11\n]\n:-\nThe Pancasiddhantika of Varahamihira is one of the most important sources for the history of Hindu astronomy before the time of\nAryabhata I\nI.\nOne treatise which Varahamihira summarises was the\nRomaka-Siddhanta\nwhich itself was based on the epicycle theory of the motions of the Sun and the Moon given by the Greeks in the\n1\nst\ncentury AD. The\nRomaka-Siddhanta\nwas based on the tropical year of\nHipparchus\nand on the Metonic cycle of\n19\nyears. Other works which Varahamihira summarises are also based on the Greek epicycle theory of the motions of the heavenly bodies. He revised the calendar by updating these earlier works to take into account precession since they were written. The\nPancasiddhantika\nalso contains many examples of the use of a place-value number system.\nThere is, however, quite a debate about interpreting data from Varahamihira's astronomical texts and from other similar works. Some believe that the astronomical theories are Babylonian in origin, while others argue that the Indians refined the Babylonian models by making observations of their own. Much needs to be done in this area to clarify some of these interesting theories.\nIn\n[\n1\n]\nIfrah notes that Varahamihira was one of the most famous astrologers in Indian history. His work\nBrihatsamhita\n(\nThe Great Compilation\n)\ndiscusses topics such as\n[\n1\n]\n:-\n... descriptions of heavenly bodies, their movements and conjunctions, meteorological phenomena, indications of the omens these movements, conjunctions and phenomena represent, what action to take and operations to accomplish, sign to look for in humans, animals, precious stones, etc.\nVarahamihira made some important mathematical discoveries. Among these are certain trigonometric formulae which translated into our present day notation correspond to\nsin\n⁡\nx\n=\ncos\n⁡\n(\nπ\n2\n−\nx\n)\n\\sin x = \\cos(\\large\\frac{\\pi}{2}\\normalsize  - x)\nsin\nx\n=\ncos\n(\n2\nπ\n​\n−\nx\n)\n,\nsin\n⁡\n2\nx\n+\ncos\n⁡\n2\nx\n=\n1\n\\sin^{2}x + \\cos^{2}x = 1\nsin\n2\nx\n+\ncos\n2\nx\n=\n1\n, and\n1\n2\n(\n1\n−\ncos\n⁡\n2\nx\n)\n=\nsin\n⁡\n2\nx\n\\large\\frac{1}{2}\\normalsize (1 - \\cos 2x) = \\sin^{2}x\n2\n1\n​\n(\n1\n−\ncos\n2\nx\n)\n=\nsin\n2\nx\n.\nAnother important contribution to trigonometry was his sine tables where he improved those of\nAryabhata I\ngiving more accurate values. It should be emphasised that accuracy was very important for these Indian mathematicians since they were computing sine tables for applications to astronomy and astrology. This motivated much of the improved accuracy they achieved by developing new interpolation methods.\nThe Jaina school of mathematics investigated rules for computing the number of ways in which\nr\nr\nr\nobjects can be selected from\nn\nn\nn\nobjects over the course of many hundreds of years. They gave rules to compute the binomial coefficients\nn\nC\nr\n_{n}C_{r}\nn\n​\nC\nr\n​\nwhich amount to\nn\nC\nr\n=\n1\nr\n!\nn\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\n.\n.\n.\n(\nn\n−\nr\n+\n1\n)\n_{n}C_{r} = \\large\\frac{1}{r!}\\normalsize n(n-1)(n-2)...(n-r+1)\nn\n​\nC\nr\n​\n=\nr\n!\n1\n​\nn\n(\nn\n−\n1\n)\n(\nn\n−\n2\n)\n.\n.\n.\n(\nn\n−\nr\n+\n1\n)\nHowever, Varahamihira attacked the problem of computing\nn\nC\nr\n_{n}C_{r}\nn\n​\nC\nr\n​\nin a rather different way. He wrote the numbers\nn\nn\nn\nin a column with\nn\n=\n1\nn = 1\nn\n=\n1\nat the bottom. He then put the numbers\nr\nr\nr\nin rows with\nr\n=\n1\nr = 1\nr\n=\n1\nat the left-hand side. Starting at the bottom left side of the array which corresponds to the values\nn\n=\n1\n,\nr\n=\n1\nn = 1, r = 1\nn\n=\n1\n,\nr\n=\n1\n, the values of\nn\nC\nr\n_{n}C_{r}\nn\n​\nC\nr\n​\nare found by summing two entries, namely the one directly below the\n(\nn\n,\nr\n)\n(n, r)\n(\nn\n,\nr\n)\nposition and the one immediately to the left of it. Of course this table is none other than\nPascal's triangle\nfor finding the binomial coefficients despite being viewed from a different angle from the way we build it up today. Full details of this work by Varahamihira is given in\n[\n5\n]\n.\nHayashi, in\n[\n6\n]\n, examines Varahamihira's work on\nmagic square\ns. In particular he examines a pandiagonal magic square of order four which occurs in Varahamihira's work."
}