{
  "nome_completo": "Vasilii Sergeevich Vladimirov",
  "nome_curto": "Vasilii Sergeevich Vladimirov",
  "ano_nascimento": "1923",
  "ano_morte": "2012",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vladimirov/",
  "lugar_nascimento": "Dyaglevo, Volkhovsk, near Petrograd, Russia",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Vasilii Sergeevich Vladimirov\nwas one of his peasant parents' five children. We should explain the reference to Petrograd in his place of birth. St Petersburg had been renamed Petrograd in\n1914\nand it still had this name when Vladimirov was born, although it was renamed Leningrad in\n1924\nwhen he was one year old. Stalin introduced collectivisation of agriculture, a policy which was intended to increase production, in\n1929\n. However, the policy, together with poor harvests in\n1932\n-\n33\n, led to a massive fall in production and widespread famine. Vladimirov began his schooling in\n1930\nat a time when food shortages were beginning to have an impact. The young boy suffered badly in this period, having to walk long distances to school with bare feet on many occasions. In\n1934\nhe entered a\n7\n-year school but, in\n1937\nhe enrolled in the Leningrad Technical School of Hydrology and Meteorology where he studied for two years. In\n1939\n, at the age of sixteen, he began studying at a night preparatory school for workers at the Ministry of Ferrous Metallurgy. This enabled him to successfully take his high school examinations and, later that year, he enrolled in the faculty of Physics at Leningrad University.\nOf course, the year that Vladimirov began his university education was the year in which World War II began. The Molotov-Ribbentrop non-aggression pact between Germany and the Soviet Union meant that the initial years of the war had little effect on life in Leningrad and Vladimirov was able to study at the University. However, things changed dramatically on\n22\nJune\n1941\nwhen Germany broke the non-aggression pact and invaded the Soviet Union. A German army under Wilhelm Josef Franz Ritter von Leeb began advancing towards Leningrad and, on\n27\nJune, the citizens of Leningrad were called on to help defend the city from the advancing German forces. Vladimirov took part in this defence. At first an effort was made to stop the advancing Germans at Kingisepp, a town about\n130\nkm south west of Leningrad. Vladimirov worked on building defences there but, in August\n1941\n, as the defences were collapsing under the German attack, he went to Tosno, a town\n50\nkm southeast of the centre of Leningrad where again defences were being built in an attempt to protect Leningrad. Again the German armies attacked and, at the end of August, Vladimirov left the defences at Tosno when he was drafted into the Red Army. The German troops took control of Tosno in September\n1941\nand Leningrad became a besieged city at this time. Vladimirov was sent to an Air Force training academy on the Leningrad front where he learnt to drive tractors. His training was complete by November and he spent the years of the Leningrad siege at a number of different air bases on the Leningrad front. In addition to his work as a tractor driver, Vladimirov worked for the Air Force as a meteorologist. The Soviets reorganised their Air Force into a number of aviation corps each of several divisions composed of a single type of aircraft. Vladimirov served in a number of different units and was attached for a while to the\n13\nth\nAir Force Corps.\nThe siege of Leningrad lasted for\n872\ndays and was finally lifted on\n27\nJanuary\n1944\n. It had been a desperate time with one and a half million soldiers and civilians dying from cold, hunger or bombardment. Military personnel did somewhat better than the civilians in terms of food but all suffered extreme unimaginable horrors. The lifting of the siege did not mean the end of the war, however, and from December\n1944\nto October\n1945\nVladimirov served with an anti-aircraft unit in Leningrad which was part of the air defence system for the city. In May\n1945\nall German troops surrendered to the Allies but Vladimirov continued to serve in Leningrad until October when he was discharged, given the rank of sergeant major in the reserves, and permitted to return to his university studies at Leningrad University. For his work during the war he was awarded the Medal \"For the Defence of Leningrad\", and the Medal \"For the Victory over Germany in the Great Patriotic War\n1941\n-\n1945\n\".\nBefore the German invasion, he had studied in the Physics Faculty, but now he entered the third year courses in the Mathematics and Mechanics Faculty. He was particularly interested in number theory and began to undertake research advised by Boris Alekseevich Venkov\n(1900\n-\n1962)\n. Venkov had studied at Leningrad University and had been appointed as a professor there in\n1935\n. He was an expert on quadratic forms and it was in this area that he suggested that Vladimirov undertake research. He worked on his Master's degree, writing his first thesis in\n1947\nin which gave an example of a non-extreme perfect quadratic form in six variables, verifying\nGeorgy Fedoseevich Voronoy\n's conjecture made in\nSur quelques propriétés des formes quadratiques positives parfaites\nⓉ\n(\nOn some properties of positive perfect quadratic forms\n)\n(1907)\nthat such forms existed.\nHermann Minkowski\nhad initiated a study of the geometry of numbers in\n1890\nand, over the next twenty years, he studied many problems including packing problems for convex bodies. For his second thesis, Vladimirov looked at packing problems, in particular giving necessary conditions on a lattice for a maximally dense packing of convex bodies in\n3\n-dimensions. He graduated from the Department of Number Theory of Leningrad University in\n1948\n.\nIn the year that he graduated, Vladimirov was appointed as a junior researcher in the Leningrad Branch of the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\n. Under different circumstances it seems likely that Vladimirov would have had a career as a top researcher in number theory. However, world events again changed the course of his career. The Americans had developed the atomic bomb, two of which they had dropped on Japan at the end of World War II. The Soviets wished to develop their own atomic bomb and a large amount of their scientific research effort was put into this project. Vladimirov was assigned to assist\nLeonid Vitalevich Kantorovich\ncalculating critical parameters of certain simple nuclear systems.\nThe Soviet atomic bomb programme began running in\n1943\nand, in\n1945\n, Stalin declared that they had to produce a thermonuclear bomb within five years. Cost was not a consideration, Stalin told them that they would get whatever they needed. Much of the theoretical work was conducted by the Physics Institute of the USSR Academy of Sciences. However, it was a project which involved top scientists and industrialists, all working on a piece of this major project. The construction of the bomb was at an Installation known as Arzamas-\n16\n,\n60\nkm from the town of Sarov, in a high security zone. Vladimirov was one of the many scientists brought in to assist with the development of the bomb. He was sent to Arzamas-\n16\nin November\n1950\nand there he was assigned to work under the direction of\nNikolai Nikolaevich Bogolyubov\n. This was highly significant for Vladimirov's career since he continued to collaborate with\nBogolyubov\nand they were still writing joint papers in the\n1970\ns. The physicists working at Arzamas-\n16\nincluded Igor Yevgenyevich Tamm\n(1895\n-\n1971)\n(\nwho was awarded the Nobel Prize in Physics in\n1958)\n, Andrei Dmitrievich Sakharov\n(1921\n-\n1989)\n(\nwho was awarded the Nobel Peace Prize in\n1975)\n, Yakov Borisovich Zel'dovich\n(1914\n-\n1987)\nand Yulii Borisovich Khariton\n(1904\n-\n1996)\n(\nthe main designer of the Soviet atomic bomb\n)\n. The physicists passed mathematical assignments to the team in which Vladimirov was working and, prompted by these problems, he developed a new technique for the numerical solution of boundary value problems specifically designed for the type of problems which were encountered. The numerical methods for solving the kinetic equation of neutron transfer in nuclear reactors which he presented in\n1952\nis now known as the 'Vladimirov method'.\nThe mathematics that Vladimirov was doing as part of the atomic bomb project was the basis for his candidate's thesis which he defended on\n23\nJune\n1953\n. In this thesis he presented his theoretical investigation of the numerical solution, using the method of characteristics, of the single-velocity transport equation for a multilayered sphere. The examining committee consisted of\nSergi Lvovich Sobolev\nand Konstantin A Semendyaev. The first Soviet thermonuclear bomb was successfully tested on\n12\nAugust\n1953\nand, shortly after, Vladimirov was awarded the Stalin Prize for his contribution to the successful project. Development did not stop, of course, and he continued working on the mathematics of the atomic bomb. The Central Artillery Design Bureau had been created in\n1942\nand in\n1945\nit had become the Central Scientific Research Institute for Artillery Armaments. Vladimirov was appointed as a Senior Researcher at this Institute in January\n1955\n. One year later, the Institute was renamed the Central Scientific Research Institute\n58\n. There he worked under\nMikhail Alekseevich Lavrent'ev\nand he published the important paper\nOn the application of the Monte Carlo methods for obtaining the lowest characteristic number and the corresponding eigenfunction for a linear integral equation\nin\n1956\n. The authors of\n[\n11\n]\nwrite:-\nA characteristic feature of Vladimirov's scientific creativity was brightly manifested in the work on the nuclear project: a harmonic composition of theoretical and applied aspects of the considered problem. Thus, he first proved the theorem on the uniqueness, existence, and smoothness of the solution of the single-velocity transport equation, established properties of the eigenvalues and eigenfunctions, and gave a new variational principle\n(\nthe Vladimirov principle\n)\n. Applying this principle to the spherical harmonics method, he found the optimal boundary conditions for this method, and they coincided exactly with the known Marshak conditions in the one-dimensional case\n(\nthe Marshak-Vladimirov conditions\n)\n.\nVladimirov began working in Moscow at the\nSteklov\nMathematical Institute in\n1956\n. The authors of\n[\n11\n]\nwrite:-\nBy this time, it was clear that the apparatus of classical mathematical physics was insufficient for solving principal problems in quantum field theory, such as the problems of divergences and of strong interactions, and that the involvement of new branches of mathematics was needed: multidimensional complex analysis, generalized function theory,\nLie\ngroups, and unbounded operators. Following his teacher\nBogolyubov\n, Vladimirov was one of the first to be actively involved in developing these new directions.\nIn\n1958\nVladimirov defended his doctoral thesis\n(\nequivalent to a D.Sc.\n)\nat the\nSteklov\nMathematical Institute,\nUSSR Academy of Sciences\n. This was published as the monograph\nMathematical Problems of Single-Velocity Particle Transport Theory\n(1961\n, English translation\n1963)\n. His thesis contained what is today known as the 'Vladimirov variational principle' which he applied to the one-velocity transport equation and derived the best boundary conditions in the method of spherical harmonics for convex regions. His publication record is amazing having a list containing nearly\n400\nworks. He published many high quality books in Russian many of which were translated into English and French. For example, he published\nMethods in the theory of functions of several complex variables\n(\nRussian\n)\nin\n1964\n, with an English translation appearing two years after the Russian work and a French translation in\n1967\n. Vladimirov writes in the Introduction that the book is intended to cover those aspects of several complex variables which are of use in quantum field theory. J G Taylor writes\n[\n19\n]\n:-\nIn all a very useful book for those wishing to learn about the theory of functions of several complex variables and how it may be applied in a particular branch of science.\nIn\n1967\nVladimirov published the book\nThe equations of mathematical physics\n(\nRussian\n)\nwhich was written at advanced undergraduate or beginning graduate level. Again an English translation was published and an expanded Russian second edition was produced\n(\nboth appearing in\n1971)\n. Vidar Thomée writes in a review\n[\n20\n]\nthat the book:-\n... contains a comprehensive treatment of the standard boundary value problems for second order partial differential equations. Its most distinguishing feature is its consistent use of distribution theory. The presentation is elegant, thorough and yet easily accessible. The author has succeeded in integrating the distribution theory into the analysis of the boundary value problems of mathematical physics in a natural and coherent way.\nRuben Hersh writes\n[\n14\n]\n:-\nThe strong point of the book is its high level of precision and rigour. It is clear and well organised and contains much important material that is not presented in other introductory texts on partial differential equations.\nAnother important work was\nGeneralized functions in mathematical physics\n(\nRussian\n)\n(1976)\n. The first part of the book is on generalized functions and their properties and looks at test functions and distributions. The second part looks at integral transforms of generalized functions. The transforms examined include the\nFourier\ntransform, the\nLaplace transform\n, the\nCauchy\n-\nBochner\ntransform, the\nHilbert\ntransform and the\nPoisson\ntransform. The third part of the book studies applications in mathematical physics.\nIn\n1986\n, in collaboration with Yurii Nikolaevich Drozhzhinov and Boris Ivanovich Zavyalov, he published\nMultidimensional Tauberian theorems for generalized functions\n(\nRussian\n)\n. Hans-Jürgen Glaeske writes in a review:-\nThis is the first book on asymptotics of generalized functions. Based on the definition of quasi-asymptotic behaviour of generalized functions, created by the authors in the\n1970\ns, and on many publications of V S Vladimirov and his pupils, we have here a collection of many definitions and results in a very strong and unified form. The reviewer notes that the investigations arose originally from problems in mathematical physics, especially in quantum field theory. The authors primarily consider the multidimensional theory, but special chapters deal with the one-dimensional case. .. This is a very interesting book for mathematicians, as well as for theoretical physicists.\nThroughout his career, Vladimirov continued his interest in number theory, the topic with which he began his research career. He combined this interest with his main research topic, the mathematics motivated by nuclear reactors, in papers he wrote later in his career. For example he co-authored the book\np-adic analysis and mathematical physics\n(1994)\nwhich contained many of the results he had obtained in this area between number theory and mathematical physics. His co-authors were Igor Vasilievich Volovich and Evgenii Igorevich Zelenov and both Russian and English versions of the text appeared in the same year.\nAn interest in teaching at all levels, particularly being involved in assisting the most talented school children, led to him undertake a number of projects\n(\n[\n26\n]\nand\n[\n27\n]\n)\n:-\nHe was a chairman\n(1975\n-\n1983)\nof the All-Russia Olympiads for schoolchildren in mathematics, physics, and chemistry\n(\nand later also in biology\n)\nand of the Mathematics Section of the Commission on Lenin Komsomol Prizes\n(1972\n-\n1975)\nand of the Commission on Lenin Komsomol Prizes of the Moscow region\n(1982\n-\n1985)\n. He was a member of the Commission on School Mathematics Education of the Department of Mathematics of the Academy of Sciences\n(1979\n-\n1983)\nand an active participant in discussions on problems of school mathematics education of that time.\nVladimirov received many awards for his contributions, and we have already mentioned some of these honours. We should also mention the Medal of Zhukov, the Medal \"In Commemoration of the\n250\nth\nAnniversary of Leningrad\", the Medal \"Veteran of Labour\", the Medal \"In Commemoration of the\n850\nth\nAnniversary of Moscow\" and the Medal \"In Commemoration of the\n300\nth\nAnniversary of Saint Petersburg\". He was awarded the State Prize of the USSR, Hero of Socialist Labour, and two Orders of Lenin."
}