{
  "nome_completo": "Vera Nikolaevna Faddeeva",
  "nome_curto": "Vera Nikolaevna Faddeeva",
  "ano_nascimento": "1906",
  "ano_morte": "1983",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Faddeeva/",
  "lugar_nascimento": "Tambov, Russia",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Vera Nikolaevna Faddeeva\n's father was Nikolai Zamyatin\n(\nFaddeeva is her married name following her marriage to\nDmitrii Konstantinovich Faddeev\n)\n. She was born in Tambov, a town about\n470\nkm south east of Moscow and\n470\nkm north east of Kharkiv. In\n1927\nshe entered the Faculty of Physics and Mathematics at Leningrad State Pedagogical Institute but transferred in the following year to Leningrad State University. Advised by Nikolai Maksimovich Gyunter\n(1871\n-\n1941)\n, an expert on the\nStieltjes\nintegral and its applications to mathematical physics, she graduated in\n1930\nand, in the same year, married the mathematician\nDmitrii Konstantinovich Faddeev\n. They had three children, one of whom was\nLudwig Dmitrievich Faddeev\nwho was educated in the Faculty of Physics at Leningrad State University and went on to become an outstanding mathematician and theoretical physicist producing ideas and results which are at the forefront of today's research.\nThe years during which Vera Nikolaevna was an undergraduate at Leningrad State University were ones of great difficulty for the academics at the university. During this period independent thinkers were persecuted and N M Gyunter, at that time President of the\nLeningrad Mathematical Society\nand a man with a reputation for courage and independent thought, was in great danger. In fact the\nLeningrad Mathematical Society\nwas disbanded in\n1930\nfollowing a proposal by the vice-president\nVladimir Ivanovich Smirnov\n, in a successful attempt to save Gyunter's life and the lives of other mathematicians. Following her graduation, Faddeeva worked at the Leningrad Board of Weights and Measures\n(\nas her husband had done in the previous couple of years\n)\n. She was employed as an assistant at the Leningrad Hydraulic Engineering Institute from\n1930\nto\n1934\nand, in\n1933\n-\n34\n, also as a junior researcher at the Seismology Institute of the USSR Academy of Sciences. For three years, beginning in\n1935\n, she worked as a researcher at the Leningrad Institute of Constructions being part of a team led by\nBoris Grigorievich Galerkin\n[\n3\n]\n:-\nDuring those years, she gained much experience in applied mathematics and sophisticated computational techniques.\nFaddeeva undertook graduate study at the Leningrad Pedagogical Institute for three years, beginning in\n1938\n. In September\n1939\n, Russia, allied with Germany, invaded Poland from the east. This had little effect on life in Leningrad. However, in June\n1941\nthe course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow. As the German armies rapidly advanced towards Leningrad, many people were evacuated from the city including Faddeeva and her family. For the duration of the siege of Leningrad, Faddeeva lived in Kazan, about\n800\nkm due east of Moscow and considered safe from the German invasion. For a long time there was no opportunity to return to Leningrad which was only liberated from the siege in January\n1944\n. Even after the siege was lifted, access to the devastated city was for a considerable time only possible with a special permit. Faddeeva, together with her husband and other academics, obtained such permits and again Leningrad State University began to operate.\nShe had been appointed as a junior researcher at the Leningrad Division of the\nSteklov\nInstitute of Mathematics of the\nUSSR Academy of Sciences\nin\n1942\nand continued to work for the Institute for the rest of her career. After submitting her candidate's thesis\nOn One Problem\nin Mathematical Physics to Leningrad State University in\n1946\nshe was awarded the degree\n(\nequivalent to a Ph.D.\n)\n. In\n1949\nshe published the papers\nThe method of lines applied to some boundary problems\nand\nOn fundamental functions of the operator X\n^{IV} . In the following year she published two books; one of these was a table of\nBessel functions\nwhich she wrote in collaboration with Mark Konstantinovich Gavurin\n(1911\n-\n1992)\n, and the other her famous treatise\nComputational methods of linear algebra\n. Gavurin was a colleague of Faddeeva and, together with\nLeonid Vitalyevich Kantorovich\n, he had set up a computational mathematics unit within the mathematical analysis department at Leningrad State University in\n1948\n. This unit became the basis for the Department of Computational Mathematics set up in\n1951\n. Faddeeva was closely associated with the computational developments by\nKantorovich\n, especially at the\nSteklov\nInstitute of Mathematics where she became head of the Laboratory of Numerical Computations.\nAs the head of Laboratory, Vera Nikolaevna guided investigations in various scientific fields related to numerical mathematics. Jointly with\nS G Mikhlin\n, she headed the scientific seminar of the Leningrad Division of the Steklov Institute of Mathematics of the\nUSSR Academy of Sciences\non numerical methods. The seminar's activity exceeded the limits of the Laboratory. Not only researchers from the\nSteklov\nInstitute but also many Soviet and foreign scientists working on numerical mathematics took part in the seminar. The Laboratory received many visitors, among whom were such known scientists as\nJames Hardy Wilkinson\n(\nGreat Britain\n)\n,\nGeorge Elmer Forsythe\n(\nUSA\n)\n,\nRichard Steven Varga\n(\nUSA\n)\n,\nGene Howard Golub\n(\nUSA\n)\n,\nRózsa Péter\n(\nHungary\n)\n,\nMiroslav Fiedler\n(\nCzechoslovakia\n)\n, Axel Ruhe\n(\nSweeden\n)\n, B D Vulichevich\n(\nYugoslavia\n)\n, and others.\nReviewing Faddeeva's classic\n1950\nbook\nComputational methods of linear algebra\n,\nG E Forsythe\nwrites:-\nThis is a textbook on numerical methods for solving finite systems of linear equations, inverting matrices, and calculating the eigenvalues of finite matrices, all with desk calculators. Although the book is far from exhaustive, the mathematical elegance, the breadth of material, and the number of error-free numerical examples make this by far the finest book to appear in the field.\nThe first chapter of this book was translated into English for the National Bureau of Standards in the United States in\n1952\nand, in\n1959\n, an English translation of the whole book was published.\n[\n12\n]\n:-\nThe first chapter of this book forms a clear and well-written introduction to the elementary parts of linear algebra. The second chapter deals with numerical methods for the solution of systems of linear equations and the inversion of matrices, and the third with methods for computing characteristic roots and vectors of a matrix. Most of the important material in these domains is to be found here, and many numerical examples which illustrate the algorithms and point out their merits and deficiencies are given. The discussion is directed principally to the hand computer, and machine computation in the modern sense is hardly present, but the book must be regarded as a valuable guide for the worker in the general area of linear computation.\nOlga Taussky-Todd\n, after giving a similar guide to the contents, writes that the book will serve\n[\n13\n]\n:-\n... a very useful purpose for researchers, as well as for teachers and students of numerical analysis, because of the clear presentation of the basic facts.\nMathSciNet lists around\n40\npapers by Faddeeva including\n20\njoint papers with her husband on numerical analysis including their most famous work, the book\nComputational methods of linear algebra\nwhich appeared in Russian in\n1960\n. This monograph was awarded a State Prize. It was translated into English and published in\n1963\n, the same year in which an enlarged and revised Russian version was published. Note that in\n1975\nthe two authors produced another major work summarizing progress made on numerical linear algebra during the years\n1962\n-\n1974\n. Unfortunately the English translation of the\n1960\nmonograph left much to be desired and most reviewers concentrate their comments more on the deficiencies of the translation than on the contents. However, J C P Miller\n[\n11\n]\ndoes note that the Russian book is an exceptional work:-\nThe original edition of this book in Russian is undoubtedly a very stimulating and valuable book, and translation into English is a very worthwhile task. The content of the book is comprehensive, with much material that does not appear to have been collected together previously.\nAlston Householder\n[\n1\n]\nwrites:-\nEach edition was, at the time of its appearance, by far the most complete and up-to-date treatment of the subject in print.\nWe mentioned above the\n20\njoint papers by Faddeeva and her husband, noting that some of the last few of these were:\nNatural norms in algebraic processes\n(1970)\n,\nOn the question of the solution of linear algebraic systems\n(1974)\n,\nParallel calculations in linear algebra\n(\nPart\n1\nin\n1977\n, Part\n2\nin\n1982)\n, and\nA view of the development of numerical methods of linear algebra\n(1977)\n. Faddeeva's final paper was the single authored\nNumerical methods of linear algebra in computer formulation\n(1984)\nwhich is the text of a lecture she gave at the 'Computational mathematics' Conference in Warsaw in\n1980\n.\nFinally let us record something of Faddeeva's character\n[\n3\n]\n:-\nFaddeeva was not only a remarkable researcher and a notable organizer and manager but also a bright versatile personality. A lively and determined woman, she was sincerely interested in everything that pertained to her institution and cared about her colleagues. Faddeeva loved life and enjoyed it. She was keen on classical music, backpacking trips, and other types of travel. She loved her family and children and took much care of them and her husband. Everyone who knew Faddeeva in person or through her perfect writings will never forget this wonderful researcher and woman.\nVera Kublanovskaya\n, who worked with Faddeeva for many years, paints a similar picture\n[\n9\n]\n:-\nIn the memory of everyone who knew Vera Nikolaevna, she has remained not only a remarkable scientist and excellent organizer but also a brilliant and many-sided personality. She inhered ebullient vitality, firmness of purpose and keen concern about all matters related to the\nSteklov\nInstitute of Mathematics, her second home, and to her colleagues. Vera Nikolaevna also took trouble about people with whom she was not personally acquainted. She had a talent for enjoying life. Theatre, classical music, travels, and tours were only some of the many passions of this richly endowed person."
}