{
  "nome_completo": "Viktor Vladimirovich Vagner",
  "nome_curto": "Viktor Vladimirovich Vagner",
  "ano_nascimento": "1908",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Vagner/",
  "lugar_nascimento": "Saratov, Russia",
  "lugar_morte": "Brest, Belarus, USSR",
  "biografia": "Viktor Vladimirovich Vagner\n's name is also written\nWagner\n. He was born in Saratov in western Russia and attended pedagogical school in Balashov, a sizable city in Saratov province not far from Saratov city, the administrative centre. After graduating from the school in\n1927\nthere was no possibility of his continuing his education at a university since his family were from the classes who had no access to higher education at this time. Vagner took a job teaching in high schools but these were not schools with high educational aspirations, with one of the schools he taught at being a school for juvenile delinquents. Russia had introduced a new system of universal compulsory education in\n1919\nand, in the\n1920\ns and\n1930\ns millions of illiterate people were enrolled into special schools. It is amazing that, given his background and the environment in which he worked, Vagner was able to pursue the study of mathematics and physics in his own time. Even more amazing is that the self-taught young man was allowed to sit the final examinations in mathematics and physics at Moscow University in\n1930\nand he received a university diploma.\nVagner's interests were, at this time, mainly in theoretical physics. He was particularly attracted by the theory of relativity and he now asked Igor Tamm, a professor in Moscow, if he would supervise his doctoral studies in that topic. Certainly Tamm was a good person to talk to - he was educated at the University of Edinburgh, then moved to the Moscow University, graduating in\n1918\n. In\n1928\nTamm spent a few months with\nPaul Ehrenfest\nat the University of Leiden. As a mark of his quality we note that Tamm was Nobel Laureate in Physics for the year\n1958\n. Although Tamm was very interested in the theory of relativity, he was not allowed to have students in this field. Of course, this was a political decision by the Soviet government who had decided that relativity was not a proper science. Tamm had to supervise students on the physics of metals but after having discussions with Vagner he clearly saw how the young student had his heart set on studying relativity. Tamm told Vagner\n(\nsee\n[\n4\n]\n)\n:-\nI hope this craziness will pass over. I can wait but you are young and you can't wait, these are your best years. Go and study\ndifferential geometry\nunder\nProfessor Kagan\n. The very spirit of modern geometry is close to that of relativity. They\n[\nthe Government\n]\nthink they understand physics and tell us physicists what to do. However, even they don't dare to tell mathematicians what to do. The atmosphere is better in mathematics.\nSo Vagner tool Tamm's advice and approached\nBenjamin Fedorovich Kagan\n. In\n1922\nKagan\nhad moved from Odessa to Moscow when the Department of Differential Geometry was founded at Moscow State University.\nKagan\nwas the first Head of Department and he founded an important School of Differential Geometry there. Vagner became his student in\n1932\nand wrote a thesis on the differential geometry of non-holonomic manifolds for his Candidate's Degree\n(\nequivalent to a Ph.D.\n)\n. In an unprecedented move, the Scientific Council of the Physics and Mathematics Faculty of Moscow University decided that the quality of his thesis was so high, so far beyond that required for the Candidate's Degree, that in\n1935\nhe was awarded the degree of Doctor of Science\n(\nequivalent to the German\nhabilitation\n)\n. Vagner's first paper\nSur la géométrie différentielle des multiplicités anholonomes\nⓉ\n(\nOn the differential geometry of anholonomic multiplicities\n)\nwas published in\n1935\nfollowed, remarkably, by eight papers in\n1938\nincluding\nA generalization of non-holonomic manifolds in Finslerian space\n.\nVagner was appointed to the Chair of Geometry at Saratov University after the award of the degree of Doctor of Science and he continued to work there until he retired in\n1978\n. Boris Schein writes about his research in\n[\n4\n]\n:-\nVagner started his research activity at the time when differential geometry was rapidly developing and providing a part of mathematical apparatus for general relativity. At that time quite a few people believed that the importance of new geometric theories, having a general scientific character, transcended mathematics. All Vagner's research is connected with differential geometry and algebraization of its foundations. Algebraic systems considered by Vagner were usually related to differential geometric structures. His research activities were connected with the Seminar on Vector and Tensor Analysis at Moscow University.\nAmong Vagner's early papers we mention\nDifferential geometry of non-linear non-holonomic manifolds in the three-dimensional Euclidean space\n(1940)\n,\nThe geometry of an\n(\nn-\n1)\n-dimensional non-holonomic manifold in an n-dimensional space\n(\nRussian\n)\n(1941)\n,\nGeometric interpretation of the motion of non-holonomic dynamical systems\n(\nRussian\n)\n(1941)\n,\nOn the problem of determining the invariant characteristics of Liouville surfaces\n(\nRussian\n)\n(1941)\n, and\nOn the Cartan group of holonomicity for surfaces\n(1942)\n. He published a major\n70\npage paper\nGeneral affine and central projective geometry of a hypersurface in a central affine space and its application to the geometrical theory of Carathéodory's transformations in the calculus of variations\n(\nRussian\n)\nin\n1952\n. This is described by\nStruik\nas follows:-\nThe first sections deal with the contact of arbitrary order of m-dimensional surfaces in a central-affine\nE\nn\nE_{n}\nE\nn\n​\nand its osculating hypersurfaces of given order and class. Then the influence of projective transformations in the\nE\nn\nE_{n}\nE\nn\n​\nis studied. The fourth section is a discussion of the hyperquadrics of\nDarboux\n. The next sections deal with the affine and central-projective normals of a hypersurface and the general theory of hypersurfaces in a central affine\nE\nn\nE_{n}\nE\nn\n​\nunder transformations of the affine and central-projective group. The theory is applied to affine hyperspheres\n(\nall normals through one point\n)\nand hyperquadrics\n(\nDarboux\ntensor vanishes\n)\n. The paper ends with the general theory of curves under the same groups.\nVagner published the book\nGeometria del calcolo delle variazioni\nⓉ\n(\nGeometry of the calculus of variations\n)\nin Italian in\n1965\nin which he gave a systematic treatment of his own approach to the geometry of the calculus of variations, which he developed during the years\n1942\n-\n1952\n.\nThe quote by Schein above indicates how geometry led Vagner to study algebraic systems. Let us quote Vagner's own words from the paper\nThe foundations of differential geometry and modern algebra\n(\nRussian\n)\n(1963)\n:-\nFor contemporary differential geometry the concept of group is quite insufficient for the examination, from an algebraic point of view, of the basic concepts of the corresponding geometrical theories. Moreover, algebraic problems arising in investigations concerning the foundations of contemporary differential geometry require the study of special algebraic systems which at present are not very seriously discussed.\nThis led Vagner to investigate inverse semigroups which he was the first to introduce\n(\nalthough he did not use that name\n)\nin the paper\nGeneralised groups\n(\nRussian\n)\npaper in\n1952\n. He also published\nOn the theory of partial transformations\n(\nRussian\n)\nin\n1952\nand then the major\n90\npage paper\nThe theory of generalized heaps and generalized groups\n(\nRussian\n)\nin the following year. Schein writes:-\nIn my opinion, even now, almost\n30\nyears after its first publication, this paper is grossly under-estimated\n(\nprobably because a good many of researchers in inverse semigroups cannot read this paper in the original Russian\n)\n. This paper contains a wealth of results, some\n(\nbut only some!\n)\nof which have been rediscovered later\n(\nimportance of the natural order relation, the smallest group congruence, the greatest idempotent-separating congruence, etc.\n)\n. Now the theory of inverse semigroups is one of the most vital and important parts of semigroup theory.\nSchein gives a very valuable description of Vagner as a person in\n[\n4\n]\n:-\nPersonally, Vagner was a very agreeable man. What always surprised his interlocutors was his vast erudition. He could read in practically all European languages and even managed somehow to get books in foreign languages. Even specialists sought Vagner's advice in various questions of philosophy, history, linguistics, literature.\nI remember how, when I was a sophomore\n(\nand later\n)\n, I was always accompanying Vagner, who used to walk home after his classes, and I visited his bachelor's apartment almost weekly. The amount of topics we discussed was innumerable. It was from him that I heard first about Freudian psychology\n(\na taboo topic; S Freud's books were on the index and could not be borrowed in the libraries\n)\n,\nK Menger\n's dimension theory\n(\nluckily,\nMenger\n's works might be read and I did that\n)\n, the Vienna Circle of philosophers, R M Rilke's poetry, German expressionist fiction, Schopenhauer's philosophy, comparative studies of Indo-European languages, and many many other things. I often wondered how it was in the pre-Gutenberg era, before printing presses were invented. I imagine that then such conversations as ours were the principal way of transfer of the knowledge from teachers to their disciples.\nAnd also Vagner was a very decent man. To some people this statement may sound shallow, trivial, almost ridiculous. Blessed are the people who have never lived in circumstances when common human decency almost amounts to a heroic deed."
}