{
  "nome_completo": "Vladimir Aleksandrovich Voevodsky",
  "nome_curto": "Vladimir Voevodsky",
  "ano_nascimento": "1966",
  "ano_morte": "2017",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Voevodsky/",
  "lugar_nascimento": "Moscow, USSR (now Russia)",
  "lugar_morte": "Princceton, New Jersey, USA",
  "biografia": "Vladimir Voevodsky\nused his full name of Vladimir Aleksandrovich Voevodskii while living in Russia but published under the name Vladimir Voevodsky after moving to the United States. He attended Moscow State University and was awarded a B.S. in Mathematics in June\n1989\n. His first publication\nEquilateral triangulations of Riemann surfaces, and curves over algebraic number fields\nwas joint work with G B Shabat and was published in\n1989\n. In the same year he published his paper\nGalois group\nG\na\nl\n(\nQ\n‾\nQ\n)\nGal \\Large(\\frac{\\overline\\mathbb{Q}}{\\mathbb{Q}})\nG\na\nl\n(\nQ\nQ\n​\n​\n)\nand Teichmüller modular groups\n, which he had presented at the conference on Constructive Methods and\nAlgebraic Number Theory\nheld in Minsk. At a Conference of Young Scientists he presented a paper\nTriangulations of oriented manifolds and ramified coverings of sphere\nand also a joint paper\nMultidimensional categories\nwritten with Mikhail M Kapranov. These were published in\n1990\n, as were three further papers written with Kapranov:\ninfinity-groupoids as a model for a homotopy category\n;\nCombinatorial-geometric aspects of polycategory theory: pasting schemes and higher Bruhat orders\n; and\ninfinity-groupoids and homotopy types\n. Also in\n1990\nVoevodsky published\nÉtale topologies of schemes over fields of finite type over\nQ\n\\mathbb{Q}\nQ\n(\nRussian\n)\n, and\n(\nwith G B Shabat\n)\nDrawing curves over number fields\nin the\nGrothendieck\nFestschrift.\nIn fact much of this work related to important questions posed by\nGrothendieck\n. For example, Voevodsky's paper with Mikhail Kapranov on infinity-groupoids realised\nGrothendieck\n's idea, presented in his unpublished but widely circulated \"letter to\nQuillen\n\"\n(\nPursuing stacks\n)\n, of generalising the way that certain CW-complexes can, taking the viewpoint of homotopy, be described by groupoids. Voevodsky's paper on étale topologies again arose from a question that\nGrothendieck\nposed, this time in his 'Esquisse d'un programme'. He continued to work on ideas coming from\nGrothendieck\nand in\n1991\npublished\nGalois representations connected with hyperbolic curves\n(\nRussian\n)\nwhich gave partial solutions to conjectures of\nGrothendieck\n, made on nonabelian\nalgebraic geometry\n, contained in his\n1983\nletter to\nFaltings\nand also in his unpublished 'Esquisse d'un programme' mentioned above. In addition in\n1991\n, in\nGalois groups of function fields over fields of finite type over\nQ\n\\mathbb{Q}\nQ\n(\nRussian\n)\n, Voevodsky gave a partial proof of another conjecture made by\nGrothendieck\nin his\n1983\nletter to\nFaltings\n.\nVoevodsky moved to Harvard University in the United States where he completed his doctorate supervised by David Kazhdan. His thesis, entitled\nHomology of Schemes and Covariant Motives\n, was submitted in\n1992\nand he was awarded his Ph.D. for this outstanding work. In fact, this thesis saw him begin working towards the ideas for which he was awarded a\nFields\nmedal in\n2002\n. The authors of\n[\n4\n]\nwrite:-\nBeginning with his Harvard Ph.D. thesis, Voevodsky has had the goal of creating a homotopy theory for algebraic varieties amenable to calculations as in\nalgebraic topology\n.\nAfter the award of his doctorate, Voevodsky was a Member of the Institute for Advanced Study at Princeton from September\n1992\nto May\n1993\n. Then he became a Junior Fellow of the Harvard Society of Fellows at Harvard University from July\n1993\nto July\n1996\n. Following this, he was appointed Associate Professor at Northwestern University, holding this position from September\n1996\nto June\n1999\n. During this period, in\n1996\n-\n97\n, he was a Visiting Scholar at Harvard University and at the\nMax-Planck\nInstitute in Germany. He was supported with a Sloan Fellowship during\n1996\n-\n98\nand the NSF Grant \"Motivic Homology with Finite Coefficients\" during\n1995\n-\n98\n. In\n1999\nhe was awarded a Clay Prize Fellowship.\nIn\n1996\nVoevodsky, in collaboration with Andrei Suslin, published\nSingular homology of abstract algebraic varieties\n. Eric Friedlander puts this important paper into context:-\nIn one of his most influential papers,\nA Weil\n(1949)\n, proved the \"\nRiemann\nhypothesis for curves over functions fields\", an analogue in positive characteristic algebraic geometry of the classical\nRiemann\nhypothesis. In contemplating the generalization of this theorem to higher-dimensional varieties\n(\nsubsequently proved by\nP Deligne\n(1974)\nfollowing foundational work of\nA Grothendieck\n)\n,\nWeil\nrecognized the importance of constructing a cohomology theory with good properties. One of these properties is functoriality with respect to morphisms of varieties.\nJ-P Serre\nshowed with simple examples that no such functorial theory exists for abstract algebraic varieties which reflects the usual\n(\nsingular\n)\nintegral\ncohomology\nof spaces. Nevertheless,\nGrothendieck\ntogether with\nM Artin\n(1972\n,\n1973)\ndeveloped étale cohomology which succeeds in providing a suitable Weil cohomology theory provided one considers cohomology with finite coefficients\n(\nrelatively prime to residue characteristics\n)\n. This theory, presented in J Milne's book 'Étale cohomology'\n(1980)\n, relies on a new formulation of topology and sophisticated developments in sheaf theory. In the present paper, the authors offer a very different solution to the problem of providing an algebraic formulation of singular cohomology with finite coefficients. Indeed, their construction is the algebraic analogue of the topological construction of singular cohomology, thereby being much more conceptual. Their algebraic singular cohomology with\n(\nconstant\n)\nfinite coefficients equals étale cohomology for varieties over an algebraically closed field. The proof of this remarkable fact involves new topologies, new techniques, and new computations reminiscent of the earlier work of\nArtin\nand\nGrothendieck\n.\nAlso in\n1996\n, Voevodsky published\nHomology of schemes\nwhich Claudio Pedrini describes as \"an important step toward the construction of a category of the so-called mixed motives.\" In\n1998\nVoevodsky lectured at the International Congress of Mathematicians in Berlin on\nA'-homotopy theory\n. Mark Hovey writes the following review of this important lecture:-\nTo this outside observer, one of the most significant strands in the recent history of algebraic geometry has been the search for good cohomology theories of schemes. Each new cohomology theory has led to significant advances, the most famous being étale cohomology and the proof of the Weil conjectures. In a beautiful tour de force, Voevodsky has constructed all reasonable cohomology theories on schemes simultaneously by constructing a stable homotopy category of schemes. This is a triangulated category analogous to the stable homotopy category of spaces studied in algebraic topology; in particular, the Brown representability theorem holds, so that every cohomology theory on schemes is an object of the Voevodsky category. This work is, of course, the foundation of Voevodsky's proof of the\nMilnor\nconjecture. The paper at hand is an almost elementary introduction to these ideas, mostly presenting the formal structure without getting into any proofs that require deep algebraic geometry. It is a beautiful paper, and the reviewer recommends it in the strongest terms. The exposition makes Voevodsky's ideas seem obvious; after the fact, of course. One of the most powerful advantages of the Voevodsky category is that one can construct cohomology theories by constructing their representing objects, rather than by describing the groups themselves. The author constructs singular homology\n(\nfollowing the ideas of A Suslin and Voevodsky\n(1996)\n, algebraic K-theory, and algebraic cobordism in this way. Throughout the paper, there are very clear indications of where Voevodsky thinks the theory needs further work, and the paper concludes with a discussion of possible future directions.\nAs this review indicated, Voevodsky had proved the\nMilnor\nConjecture. This work was one strand in his remarkable achievements which led to him receiving a\nFields Medal\non\n20\nAugust\n2002\nat the opening ceremonies of the International Congress of Mathematicians in Beijing, China. Allyn Jackson writes\n[\n6\n]\n:-\nVladimir Voevodsky made one of the most outstanding advances in algebraic geometry in the past few decades by developing new cohomology theories for algebraic varieties. ... For about forty years mathematicians worked hard to develop good cohomology theories for algebraic varieties; the best understood of these was the algebraic version of K-theory. A major advance came when Voevodsky, building on a little-understood idea proposed by Andrei Suslin, created a theory of \"motivic cohomology\". In analogy with the topological setting, there is a relationship between motivic cohomology and algebraic K-theory. In addition, Voevodsky provided a framework for describing many new cohomology theories for algebraic varieties. One consequence of Voevodsky's work, and one of his most celebrated achievements, is the solution of the\nMilnor\nConjecture, which for three decades was the main outstanding problem in algebraic K-theory. This result has striking consequences in several areas, including\nGalois\ncohomology, quadratic forms, and the cohomology of complex algebraic varieties.\nEric Friedlander and Andrei Suslin write in\n[\n4\n]\n:-\nVoevodsky's achievements are remarkable. First, he has developed a general homotopy theory for algebraic varieties. Second, as part of this general theory, he has formulated what appears to be the \"correct\" motivic cohomology theory and verified many of its remarkable properties. Third, as an application of this general approach, he has proved a long-standing conjecture of\nJohn Milnor\nrelating the\nMilnor\nK-theory of a field to its étale cohomology\n(\nand to quadratic forms over the field\n)\n.\nVoevodsky himself gave the following non-technical overview after the award of the\nFields\nMedal:-\nWe start with geometry, the category of topological spaces. We invent something about this geometrical world using our basically visual intuition. The notion of pieces comes exclusively from visual intuition. We somehow abstract it and re-write it in terms of category theory which provides this connecting language. And then we apply in a new situation, in this case in the situation of algebraic equations which is purely algebraic. So what we get is some fantastic way to translate geometric intuition into results about algebraic objects. And that is from my point of view the main fun of doing mathematics.\nFrom September\n1998\n, Voevodsky was a Member of the Institute for Advanced Study at Princeton. He became a professor there in January\n2002\n, a position he continued to hold until his death. He was awarded the three-year NSF Grant \"A\n1\n-homotopy theory\" in\n1999\nand another three-year NSF Grant on the same topic in\n2005\n. As well as the Clay Prize Fellowship he was awarded in\n1999\n, which we mentioned above, he received a Clay Prize Fellowship in\n2000\nand again in\n2001\n.\nRecent work by Voevodsky has shown that he has become interested in mathematical biology. To get a flavour of this work we give his abstract of a series of lectures which he gave at the University of Miami in January\n2005\nentitled\nCategories, Population Genetics and a Little of Quantum Physics\n:-\nIn these lectures I will tell about my work on two related but separate subjects. The first one is mathematical population genetics. I will describe a simple model which is useful for the study of the relationship between the history of a population and its genetic properties. While the positive results obtained in the framework of this model may have little use because of the model's simplicity the negative results are likely to remain valid for more complex real world populations. The second subject can be described as a categorical study of\nprobability theory\nwhere \"categorical\" is understood in the sense of category theory. Originally, I developed this approach to probability to get a better understanding of the constructions which I had to deal with in population genetics. Later it evolved into something which seems to be also interesting from a purely mathematical point of view. On the elementary level it gives a category which is useful for the work with probabilistic constructions involving complicated combinations of stochastic processes of different types. On a more advanced level, applying in this context the old idea of a functor as a generalized object one gets a better view of the relationship between probability and the theory of\n(\npre-\n)\nordered topological vector spaces. This leads to the third topic mentioned in the title. But I am only beginning to understand this connection.\nOne of his latest achievements was proving the Bloch-Kato Conjectures, which he announced in January\n2009\n.\nFinally we mention some books which Voevodsky has written. There is the important\nCycles, transfers, and motivic homology theories\n(2000)\nwritten jointly with Eric Friedlander and Andrei Suslin. A reviewer describes various results in this book as \"both deep and surprising\", \"a beautiful new idea\", \"an extraordinary application of these ideas\", and \"this extraordinary result\". More recently,\nMotivic homotopy theory\n(2007)\nis a book by several authors based on lectures they gave at the Summer School held in Nordfjordeid  in August\n2002\nand contains Voevodsky's lectures on\nMotivic homotopy theory\n. Finally we mention\nLecture notes on motivic cohomology\n(2006)\nwhich is written by several authors based on lectures given by Voevodsky."
}