{
  "nome_completo": "Vladimir Abramovich Rokhlin",
  "nome_curto": "Vladimir Abramovich Rokhlin",
  "ano_nascimento": "1919",
  "ano_morte": "1984",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rokhlin/",
  "lugar_nascimento": "Baku, Russian Empire (now Azerbaijan)",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia)",
  "biografia": "Vladimir Abramovich Rokhlin\n's parents, Abram Beniaminovich Rokhlin and Henrietta Emmanuilovna Levenson, both came from Jewish families. Abram Beniaminovich, originally from Belorussia, was a well-educated administrator whose work, although based in Baku, took him to Ukraine, Central Asia, and Moscow. He was active in politics, being a social democrat who opposed the communists. Henrietta Emmanuilovna, originally from Ukraine, was a medical doctor in Baku and the daughter of Klara Levenson who was one of the first women doctors in Russia. The Levenson family had moved to Baku during the Russian revolution and Henrietta Emmanuilovna continued to practise medicine after the birth of her son Vladimir Abramovich. Sadly, however, she died in\n1923\nwhen her son was only four years old. There were riots in Baku after infected drinking water caused an epidemic and it is thought that Henrietta Emmanuilovna was murdered at this time.\nAbram Beniaminovich's political convictions made him a political exile and the family ended up in a village close to Alma-Ata\n(\nCentral Asia\n)\n, a centre for such families. In terms of Vladimir Abramovich's education, this proved a positive advantage since the secondary school at Alma-Ata had some excellent teachers whose political views had forced them to live there. In particular, his mathematics teacher M Ustimenko was outstanding and quickly saw Rokhlin's potential. When Rokhlin graduated at age fifteen, having taken a year less than normal due to his abilities, Ustimenko wrote\n(\nsee for example\n[\n11\n]\n)\n:-\nRokhlin possesses great mathematical abilities. He grasps the presented material extraordinarily quickly and easily, thinking it out critically and independently verifying a whole chain of logical conclusions ... Rokhlin's interest in mathematics is so strong that he independently studied the beginnings of calculus, analytical geometry and higher algebra. He also shows great interest in the history of mathematics. On the strength of what I have set forth, I am persuaded that Rokhlin will be a serious researcher in the field of mathematics, ... , that the path of investigation, and of research is appropriate for him.\nShortly before his sixteenth birthday, in August\n1935\n, Rokhlin entered the Faculty of Mechanics and Mathematics at Moscow University having received the special permission necessary to begin university studies at such a young age. There he was taught by a collection of outstanding mathematicians including\nIvan Georgievich Petrovsky\n,\nPavel Sergeevich Aleksandrov\n,\nDmitrii Evgenevich Menshov\n,\nAleksandr Gennadievich Kurosh\n,\nNina Karlovna Bari\n,\nAndrey Nikolaevich Kolmogorov\n, Petr Konstantinovich Rashevskii,\nLev Semenovich Pontryagin\n, and\nAbraham Ezechiel Plessner\n. Few can have had more impressive lecturers and Rokhlin thrived in the atmosphere of research.\nPlessner\nwrote\n(\nsee for example\n[\n2\n]\n)\n:-\nPossessing scientific initiative, Rokhlin, even at the very beginning of his undergraduate years, took part in research work, which was initially in topology and later in the spectral theory of\ndynamical systems\n.\nTragedy struck, however, for in\n1939\nRokhlin's father was, in that year, first exiled and then arrested in Stalin's campaign of political terror directed against military leaders, industrial managers, and government officials as well as leading figures in the arts, the academic world, the legal and the diplomatic professions. Rokhlin's family were sent to Siberia, but as a student in Moscow, Rokhlin himself was able to continue his studies with nothing worse than the loss of his 'Stalin scholarship'. Abram Beniaminovich was sentenced to death on\n31\nJuly\n1941\nand shot soon after. By this time Rokhlin was undertaking research supervised by\nPlessner\n. He was studying measure theory and dynamical systems and had done a lot of work bringing a major set of lectures by\nPlessner\non the spectral theory of operators to publishable form. He had written a prize-winning paper\nOn the fundamental ideas of measure theory\ninfluenced by\nKolmogorov\n. However, World War II put a stop to his impressive work towards his candidate's degree\n(\nequivalent to a Ph.D.\n)\n.\nIn September\n1939\n, Russia, allied with Germany, had invaded Poland from the east. This had little effect on the life of students in Moscow. However, in June\n1941\nthe course of the war changed dramatically for those living in Russia since Germany invaded their country. By the following month Hitler had plans to take both Leningrad and Moscow and Rokhlin volunteered to fight on the front with the Moscow People's Volunteer Corps. He became a private in the\n995\nth\nArtillery Regiment and by the beginning of October\n1941\nhe was with a unit in Vyazma, defending Moscow\n[\n1\n]\n:-\n... he was wounded in both legs and was left in the countryside in civilian clothes in the care of local residents. Several times he attempted to cross the front and return to the army, but without success. At the end of\n1941\n, his wound reopened and he was put in a civilian hospital in the territory under German occupation and remained there until July\n1942\nwhen as a result of a denunciation and after a German trial he was sent to a prisoner-of-war camp.\nAs we noted at the beginning of this biography, Rokhlin was Jewish so in much greater danger from the violent anti-Semitism of the Nazis. However, he was able to hide his Jewish origins but had to endure illness due to typhoid while he was moved from camp to camp in Poland and Belorussia. His attempts to escape were unsuccessful but he did manage to get a message sent to Moscow informing them where he was being held. After recovering from typhoid he spent his time working on mathematics recording his ideas on measure theory in a notebook. By\n1943\nthe Russians were pushing the Germans back and in January\n1945\nthe camp where Rokhlin was being held was liberated. He joined the\n5\nth\nArmy of the Belorussian front as a translator. His freedom, however, was only brief for, after he tried to prevent a drunk Russian officer from shooting a German prisoner, he was sent to a Soviet 'verification camp' for former prisoners of war in May. In January\n1946\nhe was transferred to another camp where the activities of the former prisoners was examined to see if they were \"enemies of the Soviets\". Rokhlin was cleared in June, despite having to justify how he had hidden the fact that he was a Jew without committing treason. However, he was not allowed to leave the camp but forced to remain there as a guard. He had been able to contact his mathematics professors in Moscow in February and\nKolmogorov\nand\nPontryagin\nhad written supporting his release. They wrote\n(\nsee for example\n[\n2\n]\nor\n[\n11\n]\n)\n:-\nWe beg your attention to the fate of Vladimir Abramovich Rokhlin, who returned from a German prison camp ... Some first-class completed scientific studies are already due to him ... Judging by the beginning of his scientific career he promises to become an outstanding scholar; his return to scientific work would undoubtedly lead within the next few years to his obtaining significant new scientific results, ... therefore we consider that in the interests of the development of Soviet mathematics it would be extremely desirable to permit V A Rokhlin to return in as short a time as possible to his graduate studies in order to continue his scientific work under our supervision.\nWheels moved slowly and it was almost a year after this letter was written, in December\n1946\n, that Rokhlin was allowed to return to Moscow where he was employed as\nPontryagin\n's secretary. He quickly picked up his research where he had left off and was awarded his candidate's degree\n(\nequivalent to a Ph.D.\n)\nin June\n1947\nfor his thesis\nLebesgue spaces and their automorphisms\nwhich was examined by\nKolmogorov\n. He was then appointed as a research assistant in\nPontryagin\n's department at the\nSteklov\nMathematical Institute of the\nUSSR Academy of Sciences\n. He defended his doctoral thesis\nOn the most important metric classes of dynamical systems\nin\n1951\n- the examiners were\nBogolyubov\n,\nGelfand\nand\nKolmogorov\n. One might imagine that this success, praised by the examiners in the highest possible terms, would have led to promotion within the\nSteklov\nMathematical Institute or to a good position at a leading educational establishment. This, however, was not to be and, although of course it would not be admitted, nevertheless his failure to achieve a position in keeping with his achievements must have be due to the anti-Semitic policies being pursued at that time. There was quite a difference between Stalin's anti-Semitism and that of Hitler. In Germany the Nazis made it government policy while in Russia anti-Semitism was officially a crime yet was vigorously encouraged by Stalin under a policy against \"rootless cosmopolitans\". One good thing did happen to Rokhlin, however, for he married Anna Aleksandrovna Gurevich, a student of\nPontryagin\n's. She gave Rokhlin great support in his battle against the authorities, collaborated with him on a mathematics paper, and together they had two children, a son Vladimir\n(\nborn\n1952)\nand a daughter Liza\n(\nborn\n1955)\n.\nUnable to obtain a position in keeping with his qualifications, yet having a family to support, Rokhlin accepted a professorship in the Institute of Forestry at Arkhangelsk. He taught there until September\n1955\nwhen he was appointed as a professor of analysis at the Pedagogical Institute in Ivanovo. In\n1957\nhe moved to the Pedagogical Institute in Kolomna, a small town close enough to Moscow to allow him to interact with the mathematicians at Moscow University. He began running a seminar on ergodic theory at Moscow University and influenced several of the younger mathematicians such as\nVladimir Igorevich Arnold\nand\nSergei Petrovich Novikov\n.\nAleksandr Danilovic Aleksandrov\nwas professor of geometry at Leningrad University from\n1944\nand, in\n1952\n, he became the rector of the University. He wanted to build up all the scientific departments and, in\n1961\n, he invited Rokhlin to the chair of geometry at Leningrad. Rokhlin accepted the offer and, for the first time in his career, was in a position appropriate to his talents. He quickly made a major impression, organising a seminar on\nergodic theory\nwhich ran throughout the\n1960\ns. He began lecturing on topology giving courses on combinatorial topology,\nalgebraic topology\nand differential topology at the postgraduate level. From the middle of the\n1960\ns he introduced an undergraduate topology course, the first in Russia, covering general topology, the fundamental group and coverings, and manifolds. His students explained the nature of this course:-\nThis was a one-semester course, three hours a week in the first semester of the second year. At most two two-hour lessons during the whole semester were devoted to solving problems. It was not Rokhlin, but his graduate students who conducted these lessons. For instance, in\n1966\n-\n68\nthey were conducted by\nMisha Gromov\n... Rokhlin regarded the course as a theoretical one and did not wish to spend the lecture time to solving problems.\nBy the end of the\n1960\ns he was running his famous topological seminar at Leningrad. His vigorous activity was somewhat slowed in\n1974\nwhen he suffered a heart attack but he recovered well enough to continue a high rate of activity, even if slightly less than before his illness. He had other problems during the second half of the\n1970\ns, resulting from the political demands being made on science and scientists. Although he took no part in any political activity, his background led the authorities to treat him with suspicion. The university authorities required him to resign his position in\n1980\nbut the efforts of his colleagues to overturn this did allow him to continue for one more year.\nAnatoly Vershik sums up Rokhlin's mathematical contributions in\n[\n11\n]\n:-\nRokhlin's scientific legacy is comparatively small in volume and can be approximately divided into four parts: topology\n(\nbasically four-dimensional topology and the algebraic apparatus of topology\n)\n; real\nalgebraic geometry\n(\nin his last years\n)\n; ergodic theory\n(\nbasically the spectral theory, entropy theory and algebraic aspects\n)\n; and, lastly, works on history, teaching and the methodology of mathematics. The last group unfortunately did not find sufficient expression in publications, but it continually occupied Rokhlin and his ideas, which he often presented in talks and public lectures, are sufficiently well known and exerted an influence on those around him.\nThere can be little doubt that Rokhlin's health problems were consequences of the years of extreme hardship he had suffered when a young man.\nIgor Shafarevich\nwrites\n[\n9\n]\n:-\nWould his fate be different, he, certainly, would live longer and would do much more in mathematics.\nIt also seems particularly sad that after so many years of battling against the system, his career should end in the way it did after his great achievements in Leningrad. As one might expect, forced retirement did not mean an end to mathematical activities\n[\n2\n]\n:-\nIn the last years of his life after his retirement Rokhlin continued to work mainly in real algebraic geometry and four-dimensional topology. He planned a series of papers and books on popular and general scientific subjects, discussed problems of education, methodology, publication of literature, etc. Throughout these years, he fought with fortitude against illness; nobody heard a complaint from him, and, perhaps because of this, his death was unexpected and shocked all, who were associated with him; several days before it he was discussing current mathematical problems animatedly with students and colleagues.\nWe should record some of Rokhlin's interests outside mathematics\n[\n4\n]\n:-\nRokhlin's varied interests included literature, the natural sciences, history, languages - conversations with him on these subjects were fascinating.\nRokhlin died following a heart attack in\n1984\n. His widow survived nine years longer, dying in November\n1993\n. Their daughter, Liza, only outlived her mother by three weeks having failed to reach forty years of age when she died. Their son Vladimir, who became a leading mathematician and computer scientist, emigrated to the United States where he became a professor at Yale and was elected to the\nNational Academy of Sciences\n."
}