{
  "nome_completo": "Władysław Zygmunt Ślebodziński",
  "nome_curto": "Władysław Ślebodziński",
  "ano_nascimento": "1884",
  "ano_morte": "1972",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Slebodzinski/",
  "lugar_nascimento": "Pysznica, Galicia, Austrian Empire (now Poland)",
  "lugar_morte": "Wrocław, Poland",
  "biografia": "Władysław Ślebodziński\nwas the son of Ignacy Ślebodziński\n(1847\n-\n1921)\nand Anna Gorylska\n(\n?-\n1939)\n. Ignacy was\n18\nyears old and studying at a secondary school in Rzeszów in Galicia when the January Uprising broke out in\n1863\n. Poland had been partitioned in\n1772\nbut a part continued to exist as an independent country until\n1795\nwhen, after the Third Partition, there was no longer any independent Poland. The borders of the partitions were redrawn at the Congress of Vienna in\n1815\nwhen Galicia was made part of the Austrian partition. Over the following years there were many attempts to re-establish an independent Poland, some through political means others through armed uprisings. The January Uprising was one of the largest armed uprisings which began in January\n1863\nand continued until all the insurgents were captured in\n1864\n. Ignacy Ślebodziński volunteered for the Rzeszów unit that came to the aid of the January Uprising. He went to Kraków to study law but there was arrested in one of a series of roundups of people suspected of activities against the government. He was accused of belonging to an independence conspiracy, and imprisoned in Kraków. After his release he continued to study law in Kraków. He was appointed as an adjunct, a lawyer added to judicial resources, in Rozwadów in\n1879\n; he served in that capacity until\n1884\n. During this time, in\n1882\n, he married Anna Gorylska.\nWładysław Ślebodziński was the eldest of his parents five children, having three younger sisters, one of whom died at the age of fifteen, and one younger brother. He was born in Pysznica, Galicia on\n6\nFebruary\n1884\nand baptised on\n14\nApril of the same year. His father Ignacy was appointed as a judge in Rozwadów in\n1890\nand, let us note at this point, he published the book\nUnfinished historical drama\n(\nPolish\n)\nabout the January Uprising in\n1909\n. Władysław completed his schooling in Kraków at the Imperial and Royal St Anne's Gymnasium. This boys' school had been established by the Jagiellonian University in\n1586\n, had become known as the Collegium Nowodworskiego after it was endowed by Bartłomiej Nowodworski, was renamed St Anne's Lyceum in\n1818\n, and then given the name Imperial and Royal St Anne's Gymnasium in\n1850\n. Władysław sat his matura examination on\n2\nJune\n1903\nand passed with distinction. Later that year he began his studies at the Jagiellonian University in Kraków.\nAt the Jagiellonian University, Ślebodziński studied mathematics, physics and chemistry. He was taught mathematics by\nKazimierz Żorawski\nand Stanisław Zaremba. Żorawski had been named an extraordinary professor at the Jagiellonian University on\n1\nMay\n1895\n, being promoted to ordinary professor of mathematics in\n1898\n.\nZaremba\nhad been appointed as an ordinary professor of mathematics in\n1900\n; his teaching style was described by\nStanisław Gołąb\n[\n5\n]\n:-\n[\nZaremba\n's\n]\nteaching was characterised by absolute rigour and an insistence on an exposition of a subject's subtleties. His lecturing style employed long and convoluted sentences, whose logical progression became clear only after closer scrutiny. He enjoyed working on and solving difficult problems that bogged down other researchers. Always taking a philosophical view of a problem,\nZaremba\ncombined physical intuition with enormous erudition, a method that enabled him to connect seemingly unrelated problems.\nŚlebodziński was taught physics by August Wiktor Witkowski\n(1854\n-\n1913)\n, who was chairman of the Department of Physics, and by Władysław Natanson\n(1864\n-\n1937)\nwho was head of the Department of Theoretical Physics. He was also taught chemistry by Karol Olszewski\n(1846\n-\n1915)\nwho worked on X-rays. As an undergraduate Ślebodziński joined Ruch, an organisation of university students associated not only with the Polish Social Democratic Party of Galicia but also to other parties such as the nationalist Polish Socialist Party. He also joined the campaign for Ignacy Daszyński, elected to the Austrian Parliament, who advocated the independence and reunification of all Polish territories. On\n16\nJune\n1908\n, Ślebodziński passed the university examinations to qualify him to teach mathematics and physics at secondary schools.\nOn\n31\nOctober\n1908\n, Ślebodziński married Anna Gisella Zarnecka\n(1879\n-\n1970)\nin the church of St Nicholas in Kraków. Władysław and Anna had two children, a son Lesław Ślebodziński\n(1909\n-\n1989)\n, who became a chemistry teacher, and a daughter Zofia Krystyna Ślebodzińska\n(1912\n-\n2002)\n, married name Maciejewska, who became a mathematics teacher. Zofia graduated from secondary school in Poznań in\n1930\nthen studied mathematics at Poznań University graduating in\n1935\n. She taught mathematics, teaching classes in secret during World War II. In September\n1945\nshe moved to Wrocław, where she taught at the\n1\nst State Gymnasium and High School, and from\n1950\nshe gave lectures at the Evening Engineering School. In\n1955\nthis school was incorporated into the Wrocław University of Technology, where she worked until her retirement in\n1972\n. Let us return to Władysław Ślebodziński's biography.\nOn\n21\nAugust\n1908\nŚlebodziński was appointed as a deputy teacher at the Gymnasium in Sanok, where he began teaching mathematics on\n1\nSeptember of that year. On\n13\nOctober\n1909\n, he was appointed a full-time teacher at the Imperial-Royal Real School in Tarnobrzeg. At this school, as well as mathematics, he taught German and Polish, natural history, geography, and geometric drawing. He was also the manager of the Teachers' Library, the Youth Library and the natural history office. In addition, he looked after the school's botanical garden. In\n1910\nhe was elected secretary of the Board of the Tarnobrzeg Circle of the Society of the People's School. Not only was he highly involved in teaching and other duties in Tarnobrzeg but it was in that city that he began to undertake research in mathematics. Although he eventually became a specialist in differential geometry, at the start of his research career he was interested in\nGalois\ntheory.\nOn\n24\nAugust\n1912\n, he was transferred from Tarnobrzeg to the Imperial-Royal Real School in Kraków where he taught mathematics and physics. On\n19\nJuly\n1913\n, having been awarded a scholarship from the Władysław Kretkowski Foundation, he was given a one-year leave from the Imperial-Royal Real School to conduct scientific work outside Kraków. He went to Germany to study at the University of Göttingen, one of the world-leading centres for mathematics. There he attended lectures by\nConstantin Carathéodory\n,\nEdmund Landau\nand\nDavid Hilbert\n.\nŚlebodziński was in Göttingen when Austria declared war on Serbia on\n28\nJuly\n1914\n. Russia began to mobilise in support of Serbia on\n30\nJuly and on the following day Germany demanded Russia \"cease all war measures against Germany and Austria-Hungary\" within\n12\nhours. When this did not happen, Germany declared war on Russia on\n1\nAugust and, on the same day, Ślebodziński was forced to return to Kraków. He remained in Kraków for a while, then was evacuated to Vienna and was conscripted into the Imperial-Royal army on\n15\nAugust\n1915\n. After only six weeks in the army, on\n30\nSeptember, he was declared by the Austrian authorities as indispensable in education, and sent back to Kraków. He taught at the First Imperial-Royal Real School from\n1916\n. In Kraków at this time he met many leading mathematicians including\nHugo Steinhaus\n,\nStefan Banach\n, Włodzimierz Stożek\n(1883\n-\n1941)\nand Władysław Nikliborc\n(1889\n-\n1948)\n. Ślebodziński discussed forming a mathematical society with the other mathematicians and the Mathematical Society in Kraków was established on\n2\nApril\n1919\n; one year later it became the\nPolish Mathematical Society\n.\nIn\n1919\nŚlebodziński was appointed to the Gymnasium in Gniezno, a city about\n50\nkm east of Poznań but in the following year he moved to Poznań where he worked at the Teachers' Seminary. He was appointed as a lecturer in mathematics at the State Higher School of Machine Design and Electrical Engineering in Poznań in\n1921\nand continued to work there until\n1939\n. From\n1923\n, he also gave lectures at the University of Poznań. In the same year he founded the Poznań branch of the\nPolish Mathematical Society\n. After settling in Poznań, Ślebodziński began to publish papers:\nSeveral theorems on the rolling of surfaces\n(\nPolish\n)\n(1923)\n;\nContribution à la théorie des courbes et des congruences d'un espace riemannien à trois dimensions\nⓉ\n(\nContribution to the theory of curves and congruences in a three-dimensional Riemannian space\n)\n(1925)\n;\nRecherches géométriques sur le champ statique de gravitation\nⓉ\n(\nGeometric research on the static gravitational field\n)\n(1926)\n;\nOn the metrics of space in the vicinity of a stationary material point\n(\nPolish\n)\n(1926)\n; and\nSur les quadriques de l'espace riemannien\nⓉ\n(\nOn quadrics in Riemannian space\n)\n(1927)\n.\nIn September\n1927\nthe First Polish Mathematics Congress was held in Lwów. Ślebodziński was a chairman of the Geometry Section and presented three papers in Polish:\nDevelopment of differential geometry in the last decade\n;\nOn supersurfaces of four-dimensional Euclidean space\n; and\nSeveral properties of the gravitational static field\n. He was now producing mathematics of the highest quality, but he did not have a doctorate. His colleagues pressed him to submit a doctoral thesis and Wacław Sierpiński, who strongly encouraged him, managed to arrange financial support. He registered for a doctorate at the University of Warsaw and he was assigned\nKazimierz Żorawski\nas his thesis advisor. He was awarded his doctorate on\n20\nJune\n1928\nfor his thesis\nOn a Certain Class of Riemann Space\n. Perhaps his most important result, however, was in\n1931\nin his paper\nSur les équations canoniques de Hamilton\nⓉ\n(\nOn the canonical equations of Hamilton\n)\nin which introduced the\nLie\nderivative. Its importance can be seen by the fact that an English translation of his\n1931\npaper was published in\n2010\n, see\n[\n18\n]\n. Witold Roter explains its importance in\n[\n14\n]\n:-\nOne of his greatest achievements was the introduction\n(\nin the paper 'Sur les équations canoniques de Hamilton'\nⓉ\n(\nOn the canonical equations of Hamilton\n)\n)\nof a new differential operator which can be applied to scalars, tensors and affine connections. Later\n(1932)\nthe operator was called the\nLie\nderivative by\nvan Dantzig\n.\nThe outstanding Japanese geometer\nKentaro Yano\ndevoted to the notion a monograph\n[\n'The Theory of Lie Derivatives and its Applications'\n(1955)]\n, where one can find the definition of the\nLie\nderivative\n(\nof general geometric objects\n)\n, its basic properties and many applications. Apparently\nYano\n's book contains all the results published on the subject up to\n1955\n. He studied there groups of motions, groups of affine motions, groups of projective and conformal motions. Moreover, he considered also the\nLie\nderivatives in general affine spaces of geodesics, in compact orientable Riemannian manifolds, and almost complex manifolds.\nThus, the\nLie\nderivative contributed to the quick development of many areas of differential geometry. It is an important and powerful instrument in the study of groups of automorphisms and has extensive and important application in geometry. It belongs to very useful and important notions in differential geometry.\nIt seems that\nDavid van Dantzig\nwas the first who applied the notion of the\nLie\nderivative to physics. More precisely, he applied the\nLie\nderivative to the thermo-hydrodynamics of ideal fluids\n[\n'On the thermo-hydrodynamics of perfectly perfect fluids'\n(1940)]\n. The\nLie\nderivatives now play an important role in mathematical physics in connection with conservation laws and the study of symmetries of solutions of field equations such as\nEinstein\n's equations of general relativity.\nŚlebodziński continued to work on gaining the qualifications he still lacked, in particular the\nhabilitation\ndegree. He registered for this degree at the University of Warsaw and again his advisor was\nKazimierz Żorawski\n. He was awarded his habilitation on\n15\nMay\n1934\nand following this he was appointed as a\ndocent\nat the University of Warsaw in addition to his positions in Poznań.\nOn\n1\nSeptember\n1939\nGermany invaded Poland and Poznań quickly fell to the advancing troops. He was forced to leave the city where all his property\n(\nincluding unpublished papers\n)\nand the library were destroyed and he settled in the village of Lisice Wielkie near Konin in central Poland. In the winter of\n1939\n-\n1940\n, he was displaced again and settled in Bochnia in the south of Poland where he began taking part in secret teaching. The occupying German forces had closed all universities in Poland and even secondary education for Poles was not allowed by the authorities. Many teachers and lecturers took huge risks by continued teaching Polish students in private houses, and sometimes in religious establishments. From Bochnia he moved again, this time to Raba Wyżna about\n75\nkm south west of Bochnia. Again he took part in secret teaching.\nOne of the places where secret teaching took place was Głowiński Palace in Raba Wyżna. This Palace had been built for Jan Zduń in the years\n1900\n-\n1902\nand Ślebodziński taught there in secret. He was arrested on Friday,\n13\nNovember\n1942\nas a result of denunciation for conducting secret teaching in the Głowiński Palace and imprisoned in Raba Wyżna. From Raba Wyżna he was taken to the Gestapo headquarters located in the Hotel Palace in Zakopane. The Gestapo had turned the basement of the Hotel Palace into prison cells where many Poles were held and most were tortured. From Zakopane, Ślebodziński was taken to the Montelupich Prison in Kraków which had been taken over by the Gestapo in March\n1941\nand today is widely known as having been \"one of the most terrible Nazi prisons in occupied Poland.\" Prisoners there were interrogated using \"medieval torture\" methods. The\n183\nPolish professors from the Jagiellonian University who had been arrested in November\n1939\nhad been taken first to Montelupich Prison before being moved to concentration camps and in fact most of the prisoners there were Polish political prisoners. Some prisoners were executed in Montelupich while others sent to concentration camps, including Ravensbrück and Auschwitz.\nŚlebodziński was sent to Auschwitz on\n1\nDecember\n1942\nwhere his entire body was shaved, his personal details were recorded and he was assigned the number\n79053\n. He was then issued with striped uniform and bathed in the camp bathhouse. Assigned to Block No\n6\n, he was on a starvation diet and made to dig ditches. Later he was sent to Block No\n19\nfor convalescence where he was allowed to write a letter to his wife dated\n9\nMay\n1943\n. The Waffen-SS and Police Hygiene Institute at Auschwitz carried out lab work for the SS and police units. Prisoners did the lab work and those with scientific skills were used. After convalescing, Ślebodziński worked there in conditions, although bad, were better than the horrific conditions in other parts of Auschwitz. He was able to teach mathematics to Józef Hulanicki who was also a prisoner. Both survived Auschwitz and years later Hulanicki was awarded a doctorate and invited Ślebodziński to the party afterwards. Jan Pytel, who was at the party, said\n[\n23\n]\n:-\nThey were imprisoned in Auschwitz in the first period of the camp's operation, so they had enough time to get to know each other well. The professor, raising a toast in honour of Józek, said that he owed him a debt of gratitude, because it was he who saved his life. Hulanicki protested that he did not recall such a situation. To which the professor replied: \"But Mr Józef, I would never have survived Auschwitz if I had not had someone to teach mathematics there.\"\nBy the middle of January\n1945\nSoviet troops were approaching Auschwitz and SS units began an evacuation of prisoners. At this time there were around\n60000\nprisoners who were either made to march north west from the camp to Gliwice or due west to Wodzisław on\n17\nJanuary. Ślebodziński was on what became known as the \"Death March\" to Wodzisław. Anyone who fell behind on the march or could not continue was shot. He marched through the following villages: Brzeszcze, Jawiszowice, Miedźma, Ćwiklice Pszczyna, Studzionka, Poręba, Pawłowice, Jastrzębie Zdrój, Mszana, Wilchy, reaching Wodzisław Śląski. At the train station in Wodzisław Śląski Ślebodziński was one of the prisoners who were loaded onto open coal cars and sent to a camp inside Germany. He was sent to the Nordhausen-Dora concentration camp near Nordhausen in Thuringia, Germany. Two months later, as US troops approached Nordhausen-Dora in April\n1945\nmany prisoners were again sent on a Death March. Ślebodziński, however, remained in the camp and was freed on\n11\nApril by US troops. He had been saved\n880\ndays after his arrest.\nAfter the liberation of the camp, Ślebodziński organised a school for two Poles and a Czech. One of the students was Stanisław Potoczek\n(1923\n-\n2013)\nwho went on to obtain the degree of doctor of medical sciences in\n1961\n, then habilitated in\n1963\n, became an associate professor in\n1971\n, and a full professor in\n1979\n. The first organised transport back to Poland was on\n18\nJuly\n1945\nand Ślebodziński returned to Poland and was reunited with his family. Back in Poland, he was offered positions in either Poznań or Wrocław and he chose the latter where he taught at both the University and the Polytechnic.\nEdward Marczewski\nwrites\n[\n24\n]\n:-\nWładysław Ślebodziński came to Wrocław for a few days. He had lectured in Poznań before the war and now wanted to fulfil the intention he had made in Auschwitz and announced to his camp companions that after the war he would be a professor in Wrocław, at a Polish university.\nIn Wrocław in\n1945\nhe was appointed as an associate professor and head of the Department of Geometry at the Faculty of Mathematics which was a joint department of both the University of Wrocław and of the Wrocław University of Science and Technology. He worked with\nBronisław Knaster\n,\nEdward Marczewski\nand\nHugo Steinhaus\nto develop the Wrocław school of mathematics\n[\n25\n]\n:-\nThey were united by their pioneering zeal and certainty that Wrocław is and will remain Polish, as well as their will to remain there permanently. As mathematicians, they had a serious and world-famous body of work, so they had a great and natural scientific authority, they knew their worth, and they valued each other. All four of them lived in Biskupin, which had survived the siege ..., which was conducive to maintaining close and friendly relations.\nŚlebodziński,\nKnaster\n,\nMarczewski\nand\nSteinhaus\nfounded the journal\nColloquium Mathematicum\nin\n1950\n. In September\n1951\n, the Faculty of Mathematics was divided between the two Wrocław universities and from that time on each had its own Faculty of Mathematics. Ślebodziński became the head of the Department of Mathematics of the Wrocław University of Science and Technology and was given the title of full professor. He also worked at the Institute of Mathematics of the\nPolish Academy of Sciences\n. He led two seminars in Wrocław, one being on differential geometry and the other on Riemann spaces with recursive curvature. He retired in\n1960\nat the age of\n76\nbut continued to be a thesis advisor to doctoral students. He advised a total of eleven such students while in Wrocław, eight of whom were awarded the degree after he retired. In fact his last doctoral student Hanna Matuszczyk was awarded her doctorate on\n10\nNovember\n1971\nonly about\n6\nweeks before Ślebodziński's death.\nSee\nTHIS LINK\n.\nŚlebodziński received many honours for his outstanding contributions made in the most difficult of circumstances. He was awarded the Golden Cross of Merit in\n1954\n, the Commander's Cross of the Order of Polonia Restituta in\n1958\n, and the Medal for Outstanding Merits for the Development of the Wrocław University of Science and Technology in\n1970\n. He was awarded an honorary doctorate by the Wrocław University of Technology in\n1965\n, an honorary doctorate by Poznań University of Technology in\n1967\n, and also an honorary doctorate by Wrocław University in\n1970\n. He was elected President of the\nPolish Mathematical Society\n, serving in this role during\n1961\n-\n1963\n; following this he was made an honorary member of the Society.\nHe died in Wrocław on\n3\nJanuary\n1972\nand was buried in the Holy Family Cemetery in that city. On his tombstone, in accordance with his wishes, in addition to his name and the dates of his birth and his death, the following inscription was placed: \"God is Love, Mathematician, Prisoner of Oświęcim No.\n79053\n.\"\nAn auditorium at the Institute of Mathematics of the University of Wrocław and a street in Wrocław were named after him. The journal\nColloquium Mathematicum\n, of which he was a founder, published \"A collection of articles commemorating Władysław Ślebodziński\" in\n1972\n, see\n[\n22\n]\n."
}