{
  "nome_completo": "Walter Rudin",
  "nome_curto": "Walter Rudin",
  "ano_nascimento": "1921",
  "ano_morte": "2010",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rudin_Walter/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": "Madison, Wisconsin, USA",
  "biografia": "Walter Rudin\n's great grandfather was Aron Pollak who made his money manufacturing matches. He was knighted in\n1869\nand chose the title von Rudin. Aron Pollak von Rudin's son, Alfred, took over the match business. He married Sara Lise Levi and the third of their children, Robert\n(\nborn\n7\nJanuary\n1891)\nwas Walter's father. Robert was an engineer and inventor, interested principally in sound recording and radio technology. He received a doctorate in engineering from the Technical University of Vienna in June\n1914\n, just before the outbreak of World War I. Robert Pollak von Rudin served in the war then, on\n1\nJuly\n1920\n, he married Natalie Adlersberg\n(\nknown as Natasza\n)\n. She was the daughter of Felix Adlersberg and Charlotte Aszkenasy. Walter was born in Vienna, the eldest of his parents' two children, having a younger sister Vera born\n31\nMay\n1925\n. The family was Jewish, but they were not religious people.\nWalter did not attend kindergarten but, at age six, entered the Volksschule in Vienna. He spent four years at the Volksschule and then entered the same Realschule in Vienna that his father and grandfather had attended. The school\n[\n1\n]\n:-\n... was within easy walking distance from our apartment. I had to take an entrance exam, which was no problem. We had\n5\nclasses every day, from\n8\nto\n1\n, with a\n20\nminute recess in the middle of the morning, when we could run around the gravel yard or play some games there. School met\n6\ndays a week. All students and teachers were male. I think that the only females who ever entered the building were mothers on go-to -school nights. There were about\n20\nor\n25\nboys in my class, and we stayed together from one year to the next. We stayed in one room, and the teachers took turns coming in. Many of them had Ph.D's; all were called professor. The curriculum was set. There was no choice, except that electives could be added to what was required.\nThe\n1930\ns were difficult times for those of Jewish descent in Vienna with anti-Semitic attacks becoming more frequent. The policies of the Nazis in Germany after Hitler came to power in\n1933\nwere a cause of grave concern since there were many Nazi sympathisers in Vienna. These worries, however, reached a quite different level when German troops marched into Austria and annexed the country on\n12\nMarch\n1938\n. By the following day Jews were being harassed in Vienna, their homes and shops being attacked.  Immediately, Walter's parents sent Walter and his sister Vera to Switzerland to continue their schooling. They arrived in Zürich and from there Vera went to Chexbres where she attended a girls' boarding school while Walter went to the Institut auf dem Rosenberg for boys in St Gallen\n[\n1\n]\n:-\nAt the Institute I was enrolled in a special small program which prepared its students for an exam administered by Oxford University and was given in many places all over the world.\nAfter about six months, Walter's parents managed to get out of Austria and reach Switzerland. They had to leave without taking any possessions other than the clothes they wore. On reaching Switzerland they hoped that this would become their permanent home but it was not long before they realised that this was not going to be possible. Walter's father had a friend in Paris, an engineer named M Givelet, and he helped arrange work for Robert as well as visas for the whole family. They moved to France where Robert began working for the Signal Corps but they had to frequently go to the Police to renew their permission to stay. They lived in Paris and in Paramé, Saint-Malo, but with the outbreak of World War II in\n1939\n, the French were unhappy to have Germans in their country and Walter and his father Robert were sent to the Meslay-du-Maine internment camp. After being moved camps, Walter was given call-up papers for the French Army and sent to Pontivy. However, by this time the Germans had invaded France and soon fighting stopped. The French told Walter that he should run off which he did and managed to reach Saint Jean-de-Luz in the south west of France. From there he got a boat to England where he joined the Pioneer Corps of the British Army on\n20\nNovember\n1940\n. This was the only part of the British Army that was open to foreigners. Rudin spent the war years in England. Towards the end of the war the Royal Navy announced that it needed interpreters, preferably native German speakers. After applying, he underwent tests in London and, on\n4\nFebruary\n1944\njoined the Royal Navy.\nIn January\n1945\nhe was given permission to travel to Avignon were his parents and sister were living. He returned to England, but the rest of his family were able to emigrate to the United States after the war ended. His sister Vera moved to Durham, North Carolina, where she undertook work on chemistry at Duke University. Walter Rubin was able to join the rest of his family in the United States towards the end of\n1945\nafter the war ended. He joined his sister in Durham, North Carolina\n[\n2\n]\n:-\n... and while he was there he talked to the people in the mathematics department. He had never gone to college, but he persuaded them that maybe he could be a junior.\nRudin was awarded a B.A. by Duke University in\n1947\nand undertook research for his doctorate advised by John Jay Gergen, who had been a student of\nGriffith Conrad Evans\nand\nSzolem Mandelbrojt\n. Rudin was awarded his doctorate in\n1949\nfor his thesis\nUniqueness Theory for Laplace Series.\nRudin attached the following note:-\nSubmitted in partial fulfilment of the requirements for the degree of Doctor of Philosophy in the Graduate School of Arts and Sciences of Duke University. The author wishes to acknowledge his indebtedness to Professor J J Gergen, under whose direction the thesis was written.\nRudin published two papers directly based on his thesis. The first part of the thesis was published as\nIntegral representation of continuous functions\n(1950)\n. Here is Rudin's own summary of the results:-\nIt was shown by\nF Riesz\nin 'Sur les fonctions subharmoniques et leur rapport à la théorie du potentiel'\nⓉ\n(\nOn subharmonic functions and their relation to potential theory\n)\n(1930)\nthat every subharmonic function u can be represented as the sum of the potential of its mass distribution plus a harmonic function; the potential appears in the form of a\nStieltjes\nintegral. We prove that the\nStieltjes\nintegral may be replaced by a\nLebesgue\nintegral if u is continuous, and if the lower generalized Laplacian of u is less than +∞, except possibly on a set of capacity zero. In other words, the above assumptions imply the absolute continuity of the mass distribution associated with u.\nOther results from the thesis appeared in a paper with the same title as his thesis.\nGergen offered him an Instructorship for\n1949\n-\n50\nat Duke University teaching\n12\nhours per week which he accepted. During this year at Duke University, Rudin met\nMary Ellen Estill\nwho had received a Ph.D. from the University of Texas in\n1949\nand was then appointed as an Instructor in Mathematics at Duke University.\nMary Ellen\nwrote\n[\n2\n]\n:-\nSo we were both fresh young Ph.D.'s. We went together ... I think there were times during that year when I was interested in marrying Walter and there were times when he was interested in marrying me, but it was never at the same time. We were both just starting out in life.\nRudin attended the International Congress of Mathematicians held in Cambridge, Massachusetts\n30\nAugust to\n6\nSeptember\n1950\n. He presented the paper\nUniqueness theory for Hermite series\nto the Congress on\n1\nSeptember. He left Duke University in\n1950\nwhen he was appointed to a C.L.E. Moore Instructorship at the Massachusetts Institute of Technology. While at M.I.T. he completed the manuscript of his first book\nPrinciples of Mathematical Analysis\nin the spring of\n1952\n. The book was published in\n1953\nand reviewed by U S Haslam-Jones who wrote:-\nThe author deals with the classical elements of real variable theory:\nDedekind\nreal numbers, elementary set-theory, convergence, continuity, differentiation, the\nRiemann\n-\nStieltjes\nintegral, uniform convergence, functions of several variables,\nLebesgue\nmeasure and integrals. The presentation is intended for the undergraduate\n(\nor immediately post-graduate\n)\nreader, and is clear and concise: the necessity for restrictive hypotheses in theorems is emphasised by illustrative counter-examples. In general, the spaces considered are Euclidean, but the reader is introduced to more abstract ideas: for example, general metric spaces and measure spaces.\nKenneth May, reviewing the same book, writes\n[\n10\n]\n:-\nThis well-written book is an up-to-date, concise treatment of the foundations of classical real analysis\n(\nreal numbers, set theory, limit processes, etc.\n)\nand two \"modern\" topics, the\nStone\n-\nWeierstrass\ntheorem and\nLebesgue\nintegration. At the advanced undergraduate or graduate level for which it is intended, it is self-contained. It will serve as a good text for courses at this level and, for those prepared to \"dig,\" it would be a good choice for independent study of the fundamental ideas underlying calculus.\nRudin was applying for positions in the spring of\n1952\nwhich was not easy since academic jobs were scarce. However, he was interviewed by the University of Maryland and the University of Rochester and appointed as an assistant professor at Rochester taking up the appointment in\n1952\n. Rudin had met\nMary Ellen Estill\non various occasions after leaving Duke University and they decided to get married, which they did in August\n1953\nin Houston\n(\nwhere\nMary Ellen\nwas living\n)\n[\n1\n]\n:-\nVera was the bridesmaid and Joe, Ellen's brother, was best man. We spent a\n4\nor\n5\nday honeymoon in Galveston, then came back to Houston, squeezed all our  wedding presents into my car, and started on the long trek to Rochester.\nMary Ellen\nand Walter Rudin had four children: Catherine, Eleanor, Robert and Charles.\nIn\n1958\na Sloan Fellowship enabled him to spend time at Yale University. While there he was contacted by\nR H Bing\nfrom the University of Wisconsin-Madison who offered him a summer teaching position. Rudin was not interested in the summer position but writes\n[\n1\n]\n:-\nI was taken by surprise, said something like \"I don't really want to teach summer school, I have a Sloan Fellowship, I don't need the money, ... \" and then my brain slipped out of gear but my tongue kept on talking and I heard it say 'but how about a real job?'. My subconscious obviously didn't want to go back to Rochester. A couple of weeks later I was in Madison, being interviewed by Dean Mark Ingraham, a mathematician, and by President Conrad A Elvehjem.\nRudin was appointed as a professor at the University of Wisconsin-Madison in\n1959\n. He was later honoured by being appointed to a Vilas Professorship, the University's most prestigious professorship for scholarly achievement and the advancement of learning. He remained there until he retired in\n1991\nbeing made Vilas Professor Emeritus at that time.\nAs we have seen, Rudin's early work was on trigonometric series and\nholomorphic\nfunctions of one complex variable. However, by the late\n1950\ns he was working on harmonic analysis on locally compact Abelian groups. In\n1962\nhe published\nFourier Analysis on Groups\n. Stephen E Puckette writes in a review\n[\n14\n]\n:-\nAll in all, the author has assembled a first-rate treatise. It is one of the finest examples of classical analysis in the sense that abstract methods have been used effectively for an intense investigation of important concrete algebras.\nJean-Pierre Kahane\nwrites\n[\n6\n]\n:-\nThe author is known to be an excellent expositor, and he proves it once more by providing a considerable amount of information in less than three hundred pages without giving anywhere the impression of hurrying or pressing the reader.\nEdwin Hewitt\nexplains that the book:-\n... contains a huge amount of elegant analysis, presented in a brief compass. Possibly it is not a book for the beginner, but it is required reading for every harmonic analyst.\nLet us look briefly at the other books which Rudin published. There was the graduate text\nReal and complex analysis\n(1966)\nwhich was reviewed by Robert Edmund Edwards:-\nThe more generally significant of the two aims of this book for first year graduate students is \"to do away with the outmoded and misleading idea that analysis consists of two distinct halves, 'real variables' and 'complex variables'\". While the author is not alone in adopting this aim, he here pursues it more vigorously and in greater detail than the reviewer has found elsewhere. In the reviewer's view, he goes a very long way toward fulfilment in a way which will carry many readers along with him.\nWriting about the same book, Victor Shapiro noted\n[\n16\n]\n:-\nThis book excels primarily in two important respects. The first is that the choice of topics serves as a superior introduction into much of what is current in analysis, in particular to the branches of harmonic analysis, partial differential equations, several complex variables, and\nBanach\nalgebras. The second is that it blends both the concrete and abstract viewpoints and tends to do away with the notion that prevailed in the past separating analysis into \"soft\" analysis versus \"hard\" analysis.\nIn the late\n1960\ns, Rudin's interests turned towards questions in the theory of several complex variables. This was reflected in his next book\nFunction theory in polydiscs\n(1969)\nwhich, like all Rudin's books, received a very positive review:-\nThe theory of holomorphic functions on the unit disk has been studied extensively and has produced a wealth of famous theorems. Only recently, after a long period of neglect, the analogous questions for holomorphic functions on the unit polydisk have found interest. This book gives an excellent, up-to-date and easily readable account of these results in several variables, many of which are due to the author. The book is concerned with boundary values, factorization, distribution of zeros, invariant subspaces, interpolations and embeddings. ... The book provides an easy access to the subject matter and is indispensable for the investigator in this field.\nAt the NSF regional conference from\n1\n-\n5\nJune\n1970\n, held at the University of Missouri, St Louis, Rudin gave a series of lecture which were published as\nLectures on the edge-of-the-wedge theorem\n(1971)\n. His next book\nFunctional analysis\n(1973)\nagain showed his skills as an expositor.\nFrank Smithies\nwrites:-\nThis book is directed primarily towards the analytic rather than the algebraic or topological aspects of\nfunctional analysis\n. It is in some respects a sequel to the author's earlier book\n[\nReal and complex analysis\n]\n, with whose more advanced parts there is some overlap. It is written in a very readable and not over-formal style; the author has avoided the temptation to organize his material so logically that it becomes thoroughly boring. Its contents form an excellent basis for more advanced work in topics on the analytic side of functional analysis.\nReviewing the same book,\nRichard Kadison\nwrites\n[\n6\n]\n:-\nThe book is excellent. Written by an expert - contributor to as well as expositor of subjects in analysis - it develops important topics and uses them for splendid applications.\nRudin's final two books were\nFunction theory in the unit ball of\nC\nn\n\\mathbb{C}^{n}\nC\nn\n(1980)\n, and\nNew constructions of functions holomorphic in the unit ball of\nC\nn\n\\mathbb{C}^{n}\nC\nn\n(1986)\n. His skill as a writer led to him receiving the Leroy P Steele Prize for Mathematical Exposition from the\nAmerican Mathematical Society\nin\n1993\n. He was also honoured by the country of his birth with the award of an honorary degree from the University of Vienna in\n2006\n."
}