{
  "nome_completo": "Wilhelm Karl Joseph Killing",
  "nome_curto": "Wilhelm Killing",
  "ano_nascimento": "1847",
  "ano_morte": "1923",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Killing/",
  "lugar_nascimento": "Burbach (near Siegen), Westphalia, Germany",
  "lugar_morte": "Münster, Germany",
  "biografia": "Wilhelm Killing\n's mother was Anna Catharina Kortenbach and his father was Josef Killing. Josef was trained as a legal clerk and his first job was in Burbach about\n15\nkm south of Siegen. There he married Catharina Kortenbach, the daughter of the pharmacist Wilhelm Kortenbach. Wilhelm Killing, the subject of this biography, was one of their three children, the other two being Hedwig and Karl. When Wilhelm was three years old the family moved to Medebach which is about\n70\nkm north east of Siegen. As a child Wilhelm's health was not good and he was described as:-\n... quite weakly and besides very awkward ..., always excited, but a completely unpractical bookworm.\nWilhelm was brought up as a Roman Catholic and his parents gave him a conservative outlook, with a great love of his country. After ten years in Medebach the family moved again, this time to Winterberg which is less than\n15\nkm west of Medebach. Josef Killing was mayor of Medebach, then of Winterberg and, in\n1862\nhe became mayor of Rüthen which is about\n30\nkm north of Winterberg.\nKilling attended elementary school and was also given private tutoring by local clergymen to prepare him to enter the\nGymnasium\nin Brilon. The first subjects to attract Killing at the Gymnasium were the classical languages of Greek, Latin and Hebrew. It was his teacher Harnischmacher who first gave Killing his love of mathematics; later he expressed his admiration for Harnischmacher when he dedicated his thesis to him. In particularly the study of geometry at the Gymnasium convinced Killing that he should become a mathematician. He graduated from the Gymnasium in\n1865\nand in the autumn of the same year began his university studies at Münster. The Westphalian Wilhelm University of Münster was founded\n1780\n, but only became a full university in\n1902\n. When Killing studied there it was a Royal Academy. The lecturer in mathematics and astronomy at the Academy was Eduard Heis but he did not teach mathematics to a high level and Killing learnt his mathematics from studying books on his own: in particular he read\nPlücker\n's works on geometry and tried to extend the results which\nPlücker\nproved. He also read works by\nHesse\nand he read\nGauss\n's\nDisquisitiones Arithmeticae\n.\nAt Münster Killing was having to educate himself, and although he greatly appreciated the genius of the authors whose works he read, he felt that without expert teaching he was not getting as much out of his studies as he should. After four terms he moved to Berlin, matriculating there for the winter semester\n1867\n-\n68\n. At Berlin, unlike Münster, he found the highest quality of teaching and he was particularly influenced by\nKummer\n,\nWeierstrass\nand\nHelmholtz\n. He interrupted his studies in\n1870\n-\n71\nwhen his father asked him to return to help at the school in Rüthen. He returned to his studies at the University of Berlin in\n1871\nand soon began work towards his doctorate supervised by\nWeierstrass\n. His doctoral thesis, which applied\nWeierstrass\n's theory of elementary divisors of a\nmatrix\nto surfaces, was presented in March\n1872\n. It was entitled\nDer Flächenbüschel zweiter Ordnung\nⓉ\n(\nSecond order surface bundles\n)\n.\nAfter completing his doctorate Killing trained to become a Gymnasium teacher of mathematics and physics, also qualifying to teach Greek and Latin at a lower level. He qualified in\n1873\nand spent a year as a probationary teacher. Until\n1878\nhe taught at schools in Berlin; the Frdr Werder Gymnasium and St Hedwig's Catholic school. In\n1875\nhe married Anna Commer, daughter of a lecturer in music. They had four sons, the first two of whom died as infants, and two daughters Maria and Anka. In\n1878\nKilling returned to the Gymnasium in Brilon and taught at the school where he himself had been a pupil. He had a heavy teaching load and during much of this time he would spend around\n36\nhours each week either teaching in the classroom or tutoring pupils. Despite this he published his first paper\nÜber zwei Raumformen mit konstanter positiver Krümmung\nⓉ\n(\nOn two-dimensional shapes with constant positive curvature\n)\nin\n1879\nin\nCrelle's Journal\nand two further papers, also in\nCrelle's Journal\n, on\nnon-euclidean geometry\nin\nn\nn\nn\n-dimensions:\nDie Rechnung in den Nicht-Euklidischen Raumformen\nⓉ\n(\nThe statement in the non-Euclidean space forms\n)\n(1880)\nand\nDie Mechanik in den Nicht-Euklidischen Raumformeni\nⓉ\n(\nThe mechanics in the non-Euclidean Raumformeni\n)\n(1885)\n. He published the book\nDie nichteuklidischen Raumformen in analytischer Behandlung\nⓉ\n(\nNon-Euclidean space forms in analytical treatment\n)\non non-euclidean geometry in Leipzig in\n1885\n.\nOn\nWeierstrass\n's recommendation Killing was appointed to a chair of mathematics at the Lyceum Hosianum in Braunsberg in\n1882\n. Killing spent ten years in Braunsberg, isolated mathematically, but during this period he produced some of the most original mathematics ever produced.\nLie algebras\nwere introduced by\nLie\nin about\n1870\nin his work on\ndifferential equations\n. Killing introduced them independently with quite a different purpose since his interest was in non-euclidean geometry. The classification of the semisimple Lie algebras by Killing was one of the finest achievements in the whole of mathematical research. The main tools in the classification of the semisimple Lie algebras are\nCartan\nsubalgebras and the\nCartan\nmatrix both first introduced by Killing. He also introduced the idea of a root system which appears throughout much of the algebra of today. Let us now examine in more detail how Killing's ideas on the classification developed.\nKilling introduced Lie algebras in\nProgrammschrift\nⓉ\n(\nManifesto\n)\n(1884)\npublished by the Lyceum Hosianum in Braunsberg. His aim was to systematically study all space forms, that is geometries with specific properties relating to infinitesimal motions. In his\nProgrammschrift\nhe translated this geometrical aim into the problem of classifying all finite dimensional real Lie algebras. At this stage Killing was not aware of\nLie\n's work and therefore his definition of a\nLie\nalgebra was made quite independently of\nLie\n. Although the classification theorems were presented by Killing in his paper\nDie Zusammensetzung der stetigen/endlichen Transformationsgruppen\nⓉ\n(\nThe composition of the continuous / finite transformation groups\n)\n, which was published in four parts in\nMathematische Annalen\nbetween\n1888\nand\n1890\n, it is clear that when he published\nProgrammschrift\nhe already had the main ideas in place of how the classification would proceed. We should make it clear that although he was examining conditions on a Lie algebra which essentially made it semisimple\n(\nthat is having no soluble ideals\n)\nin\nProgrammschrift\n, he was not aiming at such a classification at this stage. Rather he was examining conditions on the Lie algebra which he studied for their geometrical significance and only later did he try to relate the conditions to semisimple algebras. Hawkins writes that Killing's\n[\n3\n]\n:-\n... discoveries were made under a number of ad hoc hypotheses to which Killing at that time could not have attached any great importance. Furthermore, he had permitted complex numbers into the calculations to facilitate the analysis, but eventually, for his classification of space forms, he must deal with the \"real\" case. It is no wonder that Killing did not publish these investigations. They were far too inconclusive for public exposure, even in the form of a Programmschrift. It would have been more reasonable for him to have abandoned his attempt to classify space forms since he had at least pursued the problem far enough to realise just how formidable it was.\nKilling sent\nKlein\na copy of\nProgrammschrift\nin July\n1884\nand\nKlein\nreplied by telling him that what he was looking at was closely related to structures that\nSophus Lie\nwas interested in, and that\nLie\nhad published a number of papers on these algebras over the preceding ten years. Killing responded by sending a copy of\nProgrammschrift\nto\nLie\nin August\n1884\n. On receiving no reply he wrote again to\nKlein\nwho told him that\nEngel\nwas working in Christiania on his\nhabilitation\non transformation groups under\nLie\n. In October\n1885\nKilling wrote again to\nLie\n, this time requesting copies of\nLie\n's papers and assuring him that his interest in Lie algebras was limited to geometrical considerations.\nLie\nsent copies of his papers to Killing who considered that he only had them on loan and had to return them, which he did in around March\n1886\n. He had not had time to fully appreciate all that they contained. However Killing had also written to\nEngel\nin November\n1885\nand they started a long scientific correspondence which was helpful to them both.\nIt is fair to say that without the encouragement and interest shown by\nEngel\n, Killing might not have pushed forward with his work on Lie algebras. They discussed the simple Lie algebras which they knew about and Killing conjectured\n(\nwrongly\n)\non\n12\nApril\n1886\nthat the only simple algebras were those related to the special linear group and orthogonal groups. In the same letter he conjectured other theorems about Lie algebras. Hawkins writes\n[\n3\n]\n:-\nIt is not difficult to imagine the amazement with which\nEngel\nread Killing's letter with its bold conjectures. here was an obscure professor at a Lyceum dedicated to the training of clergymen in the far-away reaches of east Prussia, discoursing with authority and conjecturing profound theorems on\nLie\n's theory of transformation groups, a theory which had seemed an area of mathematics known to relatively few mathematicians and mastered by even fewer.\nKilling visited\nEngel\nand\nLie\nin Leipzig in the summer of\n1886\non his way to Heidelberg. At this time Killing was rector of the Lyceum Hosianum in Braunsberg and in this capacity he was visiting its sister institution in Heidelberg. He arrived in Leipzig, where\nLie\nwas the professor and\nEngel\nwas a\ndozent\n, on\n31\nJuly. It was not a particularly fruitful visit for, although the three men should have had a wealth of mathematical ideas to discuss, there seems to have been a personality clash between Killing and\nLie\n. While in Leipzig, Killing also met\nSchur\nand\nStudy\n. Moving on to spend August in Heidelberg, Killing did little further mathematics that year since he became concerned for the health of one of his daughters after his return to Braunsberg.\nWhen Killing wrote to\nEngel\non\n27\nApril\n1887\nhe had come up with the definition of a semisimple Lie algebra\n(\nhis definition that such an algebra had no abelian ideals is equivalent to the definition that such an algebra has no soluble ideals\n)\n. By the time he wrote to\nEngel\non\n23\nMay Killing had discovered that his conjecture about simple algebras was wrong, for he had discovered\nG\nG\nG\n, and by\n18\nOctober he had discovered the complete list of simple algebras. However, he did not have concrete representations of these algebras. Publication of the results came in the third and fourth parts of Killing's paper\nDie Zusammensetzung der stetigen/endlichen Transformationsgruppen\nⓉ\n(\nThe composition of the continuous / finite transformation groups\n)\nreferred to above. The most remarkable part of this work is his discovery of the exceptional simple Lie algebras.\nHelgason\nwrites\n[\n5\n]\n:-\nThe exceptional simple Lie algebras are the subject of the final Section\n18\nof Killing's paper. This is certainly his most remarkable discovery, although these algebras appeared to him at first as a kind of nuisance, which he tried hard to eliminate. .. they have subsequently played important roles in Lie theory ...\nFinally, before we leave our discussion of Killing's work, it is worth noting that he introduced the term 'characteristic equation' of a matrix.\nIt was\nCartan\n, in his doctoral thesis submitted in\n1894\n, who found concrete representations of all the exceptional simple Lie algebras\n(\nalthough he did not work out all the details in his thesis\n)\n. He also reworked Killing's proofs to make them more easily understood. In many ways\nCartan\nwas so successful in presenting Killing's classification of the semisimple Lie algebras in rigorous and complete single work, that Killing has not received as much acclaim for his remarkable achievements as one might have expected.\nWe return to a description of the final stage of Killing's career. In\n1892\nhe returned to Münster as professor of mathematics and he spent the rest of his life there submerged in teaching, administration and charitable work. He was rector of the University of Münster in\n1897\n-\n98\n. He always upheld tradition and disliked change. One example of this was his desire that philosophy be retained as compulsory for all graduate students. He fought vigorously to retain the philosophy examination although, as\nEngel\nstated:-\nKilling could not see that for most candidates the test in philosophy was completely worthless.\nKilling was honoured with the award of the\nLobachevsky\nPrize by the\nKazan Physico-mathematical Society\nin\n1900\n. This was the second award made of the Prize, the first in\n1897\ngoing to\nLie\n.\nThe collapse of social cohesion in Germany after\n1918\ncaused Killing much pain in his last years as he was a great patriot. He had already suffered the loss of two infant sons, but even more devastating was the loss of his remaining two sons, one of whom died in\n1910\nwhile working for his\nhabilitation\non a topic on the history of music, the other became ill in an army camp and died shortly before end of World War I in\n1918\n.\nColeman writes in\n[\n1\n]\n:-\nThroughout his life Killing evinced a high sense of duty and a deep concern for anyone in physical or spiritual need. He was steeped in what the mathematician\nEngel\ncharacterised as \"the rigorous Westphalian Catholicism of the\n1850\ns and\n1860\ns\". St Francis of Assisi was his model, so at the age of\n39\nhe, together with his wife, entered the Third Order of the Franciscans. His students loved and admired Killing because he gave himself unsparingly of time and energy to them, never being satisfied for them to become narrow specialists, so he spread his lectures over many topics beyond geometry and groups.\nThis makes Killing look almost a mathematical saint, but this probably goes too far. He certainly lacked a sense of humour and he\n[\n3\n]\n:-\n... was extremely sensitive to criticism."
}