{
  "nome_completo": "Wilhelm Ernst Martin Georg Ahrens",
  "nome_curto": "Wilhelm Ahrens",
  "ano_nascimento": "1872",
  "ano_morte": "1927",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ahrens/",
  "lugar_nascimento": "Lübz an der Elde, Mecklenburg, Germany",
  "lugar_morte": "Rostock, Germany",
  "biografia": "Wilhelm Ahrens\n's father was a businessman working in Rostock. Wilhelm was born in Lübz on the river Elde in northeast Germany, about halfway between Hamburg and Berlin. Between\n1890\nand\n1897\nhe studied at the universities of Rostock, Berlin and Freiburg. Ahrens passed his Master of Advanced Studies in Secondary and Higher Education in the\n1895\nand, in addition, he was awarded his Ph.D., summa cum laude\n(\nwith the highest distinction\n)\n, from the University of Rostock in the same year under the supervision of Otto Staude\n(1857\n-\n1928)\n. Otto Staude was a geometer who had\nhabilitated\nat the University of Breslau in\n1883\nand then taught at the University of Dorpat before moving to Rostock. Ahrens'\n36\n-page thesis was entitled\nÜber eine Gattung n-fach periodischer Functionen von n reellen Veränderlichen\n.\nⓉ\n(\nOn a generic n-fold periodic functions of n real variables.\n)\nEven before the publication of his thesis, he had published two papers, one concerning a new theorem about the determinant of a matrix and the other on a number theoretical theorem of\nHermann Schubert\n. You can see a list of papers and books by Ahrens at\nTHIS LINK\n.\nAhrens then spent a year teaching at the German School in Antwerp, before returning to university for a further year. It was this brief spell at the University of Leipzig, under\nSophus Lie\n, which inspired his later work in group theory such as\nZur Theorie der adjungirten Gruppe\nⓉ\n(\nOn the theory of group adjuncts\n)\n(1897)\nand\nÜber eine besondere Klasse von Substitutionsgruppen\nⓉ\n(\nOn a special class of substitution groups\n)\n(1897)\n. It also led to him writing about\nLie\nas a teacher in\n'Sophus Lie' als Pädagog\n(1900)\n. After these university studies, Ahrens was employed at the School of Architecture for four years and later at the School of Mechanical Engineering in Magdeburg for three years. He left, upon fearing that he might be relocated to a smaller town, when the School was municipalized in\n1904\n.\nGiving up his career as a teacher, Ahrens relocated to Rostock as an independent scholar, in order to pursue his literary work. His skill in chess gave him a strong interest in mathematical games and entertainment, as evinced by his\n23\n-chapter,\n2\n-volume book\nMathematische Unterhaltungen und Spiele\nⓉ\n(\nMathematical Recreations and Games\n)\n, published in\n1910\n. This book showed that Ahrens had an exceptionally thorough knowledge of the surrounding literature. One interesting aspect of this book is the historical notes associated with the games and another interesting aspect is that he explains the relationship of the games to topics in pure mathematics, in particular to number theory, group theory, combinatorics and topology. You can read Ahrens' Preface to this book at\nTHIS LINK\n.\nThis two volume work was, in fact, a second edition of the\n454\n-page single volume work\nMathematische Unterhaltungen und Spiele\nⓉ\n(\nMathematical Recreations and Games\n)\n(1901)\n. He had written this book to make available a German language work similar to the French book by\nÉdouard Lucas\n,\nRécréations mathématiques\nⓉ\n(\nMathematical Recreations\n)\n, and the English book by\nWalter Rouse Ball\n,\nMathematical Recreations\n. One of the features of Ahrens' book, which distinguishes it from other similar books of the time, is that it is written for those who have some mathematical background and, consequently, he only looks at games which are mathematically interesting. In\n1907\nAhrens published\nMathematische Spiele\nⓉ\n(\nMathematical Games\n)\nwhich was a shorter\n(\nonly\n118\npages\n)\nand much more elementary text on games which was intended to be instructive and entertaining reading for everyone. If number of editions is a good guide to popularity then, not surprisingly, it was this elementary text which sold the most copies. It ran to five editions, the fifth being published in\n1927\n. Ahrens did make changes to the book over these twenty years expanding the chapters on\nmagic squares\nand on mathematical fallacies. However, he made sure that the book did not grow bigger by shortening other chapters. The two volume\nMathematische Unterhaltungen und Spiele\nⓉ\n(\nMathematical Recreations and Games\n)\nran to two editions, the second expanded and improved edition was published in\n1918\n.\nDue to his expansive knowledge of the background literature, gained through investigating very old sources and picking out the fundamental mathematics from these works, Ahrens was also asked to write an article about mathematical games for\nFelix Klein\n's encyclopaedia\nEnzyklopädie der Mathematischen Wissenschaften\nⓉ\n(\nEncyclopedia of Mathematical Sciences\n)\n; he contributed the\n14\n-page article\nMathematische Spiele\nwhich was published in\n1902\n. Another interesting work by Ahrens is a valuable collection of quotes about mathematics and mathematicians\nScherz und Ernst in der Mathematik, geflügelte und ungeflügelte Worte\nⓉ\n(\nFun and seriousness in mathematics, well-known and less well-known words\n)\n, published in\n1904\n. Here are some examples from the book\n[\n1\n]\n:-\n\"Geometry is the only science which has produced no sects\"\n(\nFrederick the Great\n)\n.\n\"\nD'Alembert\n, that great genius, seems to be far too ready to pull down everything he has not himself built up\"\n(\nEuler\nto\nLagrange\n)\n.\n\"I am delighted at the contrast between your modesty and the good opinion that other geometers have of themselves, although they have certainly nothing like the same claim. You are a living instance of what you said to me some time ago, that pretensions are ever in an inverse ratio to merit\"\n(\nd'Alembert\nto\nLagrange\n)\n.\n\"\nLeibniz\nnever married. At the age of\n50\nhe began to think about it, but the lady asked for time to reflect. This gave\nLeibniz\ntime to reflect - and he did not marry\".\n(\nFontenelle\n)\n.\n\"My dear and illustrious friend - they write to me from Berlin that you are about to take what we philosophers call 'le saut perilleux,' and that you have married one of your relations. ... Accept my compliments, for a mathematician ought to have pre-eminent advantages in the calculations of his own happiness, and any calculations of yours are sure to lead to a solution - the solution in your case being marriage\"\n(\nd'Alembert\nto\nLagrange\n)\n.\nYou can read some further examples of quotes given in this text at\nTHIS LINK\n.\nF Müller writes in a review of\nScherz und Ernst in der Mathematik\n:-\nThe author has gathered, with great diligence, interesting expressions of mathematicians and about mathematics and mathematicians, and these well-known and less well-known words are classified according to their content, though not strictly systematically. The sources from which the author has drawn are very carefully specified. Ahrens has understood, just to select those utterances of an author, which are characteristic of his position, his mindset, and his individuality. And so, supported by a carefully crafted index of names, we learn to know better the personality of many mathematicians whose works we have studied. That many trivial and even tasteless sayings are found among many witty ones in this work, is self-evident. ... Unfortunately, you will be reminded in several quotes that anyone can be a great mathematician and yet be a very uneducated person. The book still offers an abundance of Interesting and enjoyable amusements.\nOf particular interest to the history of mathematics is the book\nBriefwechsel zwischen C G J Jacobi und M H Jacobi\n, which published the correspondence between the Jacobi brothers. This correspondence was between the mathematician\nCarl Jacobi\nand his brother Moritz Hermann Jacobi\n(1801\n-\n1874)\nwho was an electrical engineer. Although Moritz Jacobi was born in Potsdam, he spent most of his life in Russia where he was known as Boris Semyonovich von Jacobi. Ahrens heavily annotated the work, published in\n1907\n, in order to make the correspondence accessible for readers of his day.\nIn\n1908\n, Ahrens, in collaboration with\nPaul Stäckel\n, published\nBriefwechsel zwischen C G J Jacobi und P H von Fuss\nüber die Herausgabe der Werke Leonhard Eulers\nⓉ\n(\nCorrespondence between C G J Jacobi and P H von Fuss on the publication of the works Leonhard Euler\n)\n, making available letters between\nCarl Jacobi\nand\nNicolaus Fuss\nconcerning the publication of\nLeonard Euler\n's complete works.\nEuler\nwas born in\n1707\nand the work by Ahrens and Stäckel was associated with the bicentennial of his birth.\nFollowing critical investigation of old sources, Ahrens wrote\nMathematiker-Anekdoten\nⓉ\n(\nMathematicians' Anecdotes\n)\n(1916)\nwhich is of particular interest for the study of mathematical history. In it he looked at the mathematicians\nAdam Ries\n,\nPierre Fermat\n,\nLeonard Euler\n,\nCarl Friedrich Gauss\n,\nJoseph-Louis Lagrange\n,\nAugustin-Louis Cauchy\n,\nBernhard Riemann\n, K H Schellbach and\nHermann Grassmann\n. He states that his aim in writing the work is to provide students in the upper classes of middle schools stimulating and instructive reading material that illuminates the development of mathematics and the lives of its researchers. Emil Lampe\n(1840\n-\n1918)\nwrites in a review that Ahrens, as the author of\nScherz und Ernst in der Mathematik\n, is able to select well chosen material from the wealth of its treasures about a number of mathematicians. You can read a review by of\nMathematiker-Anekdoten\nby\nR D Carmichael\nat\nTHIS LINK\n.\nIn addition to these books, let us give some indication of papers that Ahrens wrote. In\n1901\nand\n1902\nhe published mathematical chess puzzles; for the\n100\nth\nanniversary of\nCarl Jacobi\n's birth in\n1904\nhe wrote a biography; in\n1905\nhe published a paper on\nPeter Gustav Lejeune Dirichlet\n; in\n1906\nhe published letters between\nCarl Jacobi\nand his brother Moritz Jacobi concerning\nCarl Jacobi\n's unsuccessful attempt in\n1848\nto become a member of the National Assembly; also in\n1906\nhe published a paper on\nJacobi\nand\nSteiner\n; in\n1908\nhe published sketches from the life of\nWeierstrass\n; he also wrote several papers discussing whether\nEuler\n's works should be published in German or Latin; in\n1914\nhe wrote a couple of papers on one of his favourite topics, namely magic squares, and in the following year on the magic square in\nAlbrecht Dürer\n's painting\nMelancholia\n.\nThough he had many other literary ideas, his death prevented their implementation. By all accounts Ahrens had an amiable nature and was a loyal friend. The author of\n[\n6\n]\nwrites:-\nHis colleges in Rostock will not only remember him as an inspiring companion in all scientific questions, but also as a loyal and constantly happy to help friend."
}