{
  "nome_completo": "William Ernest Johnson",
  "nome_curto": "William Johnson",
  "ano_nascimento": "1858",
  "ano_morte": "1931",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Johnson/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": "Northampton, England",
  "biografia": "William Johnson\n's mother was Harriet Brimley from Cambridge, while his father, William Henry Farthing Johnson, owned and ran Llandaff House School in Cambridge. It was a large family with William having one older brother and three older sisters. Two of William's brothers, George William Johnson and Reginald Brimley Johnson, went on to become authors. William, the subject of this biography, was a pupil at the school in Cambridge where his father was the headmaster. He went on to study at Perse School in Cambridge, and at the Liverpool Royal Institution School. In\n1879\nhe entered King's College Cambridge becoming\n11\nth\nwrangler\nin the mathematical tripos of\n1882\n. Johnson held various temporary positions around Cambridge for the next\n19\nyears\n[\n2\n]\n:-\nFor some years he gained his living as a mathematical coach in Cambridge, until openings were found for him in teaching for the moral sciences tripos and as a lecturer in psychology and in the theory of education to the Cambridge Women's Training College and for the university teachers' training syndicate.\nHe married Barbara Keymer Heaton in\n1895\nwho was the daughter of a lecturer in chemistry at Charing Cross Hospital, London. During these nineteen years of holding temporary positions he published three papers on\nBoolean logic\nand one on\nprobability\n. In\n1902\nhe obtained a Fellowship at King's College and taught there as Sidgwick lecturer in moral sciences. He was a shy, sickly man but a popular and respected teacher. However his personality meant that he spent most of his time on his own in his rooms in King's College and life became harder for him after his wife died in\n1904\n. However he taught logic and mathematical economics, publishing important works in both areas. In the area of logic he published papers such as\nThe logical calculus\n(1892)\nand\nAnalysis of thinking\n(1918)\n, both of which appeared in\nMind\n. Perhaps his most famous work on mathematical economics was\nThe pure theory of utility curves\nwhich appeared in the\nEconomic Journal\nin\n1913\n.\nHe is most famed, however, for\nLogic\n(1921\n,\n1922\n,\n1924)\n, a work that one of his students persuaded him to publish.\nLogic\nis in three volumes, the fourth on probability was never finished, but the parts which were written were published in\nMind\nafter his death.\nLogic\nwon him considerable fame leading to his election as a fellow of the British Academy\n(1923)\nand to the award of honorary degrees from universities such as Manchester\n(1922)\nand Aberdeen\n(1926)\n.\nJohnson viewed probability as expressing logical relations between evidence propositions and hypothesis propositions. He was opposed to the frequency interpretation of probability. His views on the foundations of probability theory influenced\nKeynes\nand others.\nIn\n[\n5\n]\nsome aspects of his work is discussed:-\nHow do Bayesians justify using conjugate priors on grounds other than mathematical convenience? In the\n1920\ns the Cambridge philosopher William Ernest Johnson in effect characterized symmetric\nDirichlet\npriors for multinomial sampling in terms of a natural and easily assessed subjective condition. Johnson's proof can be generalized to include asymmetric\nDirichlet\npriors and those finitely exchangeable sequences with linear posterior expectation of success. Some interesting open problems that Johnson's result raises, and its historical and philosophical background, are also discussed.\nWe noted above that he was a shy man with some health problems yet, as we mentioned above, he was an excellent teacher\n[\n2\n]\n:-\nHe would sit by a fire at Llandaff House, wrapped in the red shawl which became so characteristic of him, conversing with undergraduates. His pupils\n(\nwho numbered a large proportion of those reading moral sciences in the university\n)\nand people who attended his lectures, which were delivered conversationally and with frequent digressions, were aware of a lovable personality and were infected with his exacting subordination of originality to clarity and truth.\nDespite his shyness,\nKeynes\nremarked that Johnson was an excellent conversationalist. His quiet life in College did not mean that he had no outside interests for he loved playing the piano, which he did well entertaining guests in his rooms with his playing, and took an interest in football and mountaineering. He continued lecturing through the early part of\n1930\n, but was then taken ill and died in St Andrew's Hospital, Northampton."
}