{
  "nome_completo": "William Oughter Lonie",
  "nome_curto": "William Oughter Lonie",
  "ano_nascimento": "1822",
  "ano_morte": "1894",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lonie/",
  "lugar_nascimento": "Kinghorn, Fife, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "William Oughter Lonie\n's name is sometimes given as William Ochter Lonie, William Oughterlonie or William O'Lonie. His father, also named William Oughter Lonie, was an engineer and his mother was Agnes Morrison. He attended school in his home town of Kinghorn, taught there by the Rev John Davidson. Lonie said, many years later\n[\n5\n]\n:-\nDrinking at such a fountain, I would have been a very dull boy indeed if I had not drawn some little inspiration.\nOn the same occasion, in\n1881\n, he recalled the first school prize he won at the school in Kinghorn\n[\n5\n]\n:-\nI had a desire for sympathy - it upset me. Still as the first excitement went away and I began to enjoy my holidays amid tree and bud and leaf and flower, I thought of the joy in my mother's face and the intense pleasure in my father's. By gaining this prize I had brought into the home I held so dear a new atmosphere, an atmosphere of happiness and goodwill, and I resolved to preserve it by working more earnestly in the future than I had done in the past.\nHe attended the University of St Andrews, matriculating in\n1836\nwhen he was barely fourteen years old. In\n1837\nhe was a Kinghorn bursar. The courses he took were the following:\n1836\n-\n37\nJunior Latin, Junior Greek\n1837\n-\n38\nGreek Provectior, Mathematics\n1\n, Logic\n1838\n-\n39\nGreek Provectior, Latin Provectior, Ethics, Mathematics\n2\n1839\n-\n40\nLatin Provectior, Greek Provectior, Mathematics\n3\n, Physics, Philosophy of the Senses\n1843\n-\n44\nChemistry\nHe graduated M.A. on\n27\nApril\n1844\n. This record of the courses took looks strange - particularly the gap from\n1840\nto\n1843\nand the fact that he seemed to have essentially completed his degree four years before graduating. However, this is explained by the fact that Lonie was training to be a teacher and began working in schools in\n1838\nin parallel with his university studies. This was standard practice at the time. Notice that when he started as an assistant at the Burgh School in\n1838\nhe was only sixteen years old. Following this he was an usher\n(\nan old term for an assistant schoolmaster\n)\nat an English boarding school. He was, for three months, an interim teacher at a burgh school. Following his graduation he was an assistant to Thomas Duncan, the Regius Professor of Mathematics at the University of St Andrews, for a year. He then spent a year as a resident private tutor before being appointed Head Master of Mathematics at Madras College in\n1846\n. He lived at\n5\nNorth Bell Street, St Andrews, close to the school.\nIn August\n1846\n, when the annual examinations took place at Madras College, Lonie came in for considerable praise despite the short time he had been in post\n[\n6\n]\n:-\nAt the close of the mathematical examination, Professor Kelland\n[\nProfessor of Mathematics at the University of Edinburgh\n]\ncongratulated Mr Lonie on the appearance which his classes had made; and expressed a confident expectation that the evident talent and energy of the new master will speedily enable him to make the appearances of his classes all that is either possible or desirable in such a school. Mr Lees expressed his cordial concurrence in Professor Kelland's remarks. ... At the close of the examination in the English department on Friday, which completed the inspection, Professor Pillans rose and addressed the trustees and the audience, which crowded the large West Room. ... He declared the satisfaction it had given him to observe the activity and promise of Mr Lonie.\nSee\nTHIS LINK\nfor a full report on these examinations.\nSimilar praise was given to Lonie following the examinations held in August\n1847\n[\n7\n]\n:-\nThe Mathematical and Arithmetical classes were examined on Thursday. Mr Lonie's mathematical classes occupied the earlier hours of the forenoon. Their programme exhibited an extensive course of teaching in geometry, practical mathematics, algebra, and geography; and in all these branches they sustained an active examination. Dr Haldane addressed Mr Lonie with unqualified commendation.\nLonie married Eliza Craig in Kinghorn on\n12\nDecember\n1849\n. On\n22\nNovember\n1850\ntheir twin sons were born: Alexander Charles Oughterlonie and William Robert Oughterlonie. Tragedy struck the family soon after this and within a couple of years Eliza had died and William Robert had died in infancy. Alexander Charles Oughterlonie had a poetic temperament inherited from his mother and finished his college course with distinction. However, he suffered from heart disease and struggled for years spending his days painting, writing poetry and contemplating questions of existence. Tragically, he died in\n1877\naged\n26\n.\nAlthough devoting himself to teaching at Madras College, where he was seen as an educational reformer, Lonie also undertook research. He conducted experiments on the optic nerve, judging depth and distance in monocular vision, and the role of the retina. He corresponded with Professor Macdonald at the University of Glasgow about his experiments and the University holds one such letter from Lonie dated\n29\nJanuary\n1853\n. A related area of interest would lead to Lonie gaining an international reputation. The Stereoscope Company,\n313\nOxford Street, London, offered a prize of\n20\nguineas for the best short popular treatise on the stereoscope. We note that a stereoscope is an instrument capable of recording three-dimensional visual information. Lonie's 'Prize Essay on the Stereoscope' won the prize of\n20\nguineas which was presented to him by Sir David Brewster.\nSir David Brewster was a famous physicist and mathematician. In\n1838\n, Sir David Brewster was appointed principal of the United Colleges of St Salvator and St Leonard. He held this position for\n10\nyears. He published a book \"The Stereoscope: Its history, theory and construction with its application to the fine and useful arts and to education\" in\n1856\n. In it Brewster refers to Lonie's Prize Essay on the Stereoscope. In the same year of\n1856\nLonie's Prize essay was published as the book\nPractical Stereoscopic Photography\n. A review of Lonie's book states:-\nSir David Brewster's testimony to its merits renders further praise unnecessary, if not impertinent.\nWe mentioned that this work led to international recognition and this is clear from reports in Australian newspapers\n(\nthe Hobart Courier and others\n)\nand in the publications of the American Philosophical Society.\nWe have quite a lot of information concerning the content of Lonie's teaching since the\nFair Book of James Walker\nwritten in\n1853\nwhile he was taking Lonie's classes, has survived.\nSee\nTHIS LINK\nfor Walker's Fair Book.\nAn advertisement appearing in\n1859\nlists the topics taught in the Mathematics Department of Madras College: Theoretical mathematics - Geometry and algebra; Practical mathematics - Trigonometry, surveying, navigation, etc.; Natural philosophy; Private Class geography. Topics taught in Lonie's Mathematics Department in\n1879\nare: Mathematics - Euclid, Elementary Modern Geometry and Conic Sections, Plane and Spherical Trigonometry, with practice, Elementary Algebra with Higher Equations, Mensuration, and Mechanics; Physics - after Balfour Stewart and Modern Views of Natural Forces including Energy, Sound, Heat, Light; Geography - Modern Geography.\nAs to Lonie's ideas about teaching, we have details of his interview by the Assistant-Commissioners on the State of Education in the Burgh and Middle-Class Schools in Scotland,\n1867\n-\n68\n. Asked about whether the burgh school system meets the needs of the whole community, Lonie answers\n[\n4\n]\n:-\nThe Madras College meets the wants of our whole burgh community and more; but the theory of a burgh school should, in my opinion, embrace ... the idea of a distinct demarcation between the department for reading, writing, and arithmetic, as the instruments of a further education, and such further training by classics and mathematics as the most fitting known means to prepare pupils for universities, service examinations, and all middle-class occupations.\nAsked about which subjects should be compulsory and which optional, he replies\n[\n4\n]\n:-\nMy experience in the Madras College and otherwise has impressed me with a very decided conviction that in the stage above the three R's it were best that the burgh, or rather the middle-class department of the burgh schools, had an imperative curriculum of two branches, viz., classics and mathematics, and all other optional. One advantage in the present free choice should not be overlooked, that children, who are, perhaps more frequently than parents, the choosers, are gratified with less irksome work; while this, I believe, is mainly due to our modes of teaching classics and mathematics being, so to speak, too didactic and authoritative; the master being too forgetful of the necessity of inductive teaching towards rules of language and propositions of mathematics, and likewise too forgetful of the constant necessity of deductive applications to matters of universal interest and prospective advantage.\nHe also believes that parents do not necessarily have correct ideas about the best subjects for their children to study\n[\n4\n]\n:-\nParents are too much inclined, in matters of education, to prefer the more immediate results of knowledge in the shape of such so-called practical subjects as practical mathematics, book-keeping, etc., and accomplishments such as drawing, painting, music, etc. Few appear to believe in training at all, or believe that all knowledge, however disjoined, is, in the acquisition, good training.\nSee\nTHIS LINK\nfor more of the interview on Lonie's ideas on education..\nLonie received two notable honours: the University of St Andrews honoured Lonie when they awarded him an LL.D. on\n12\nFebruary\n1870\n; and a dinner was held in his honour in\n1881\n. Following the dinner, held on Friday\n22\nApril\n1881\nin the Royal Hotel, St Andrews, he was presented with a silver salver and casket containing a cheque for\n500\nguineas\n(\n£\n525)\n. A subscription list had been set up in\n1878\nand quickly reached £\n400\n[\n5\n]\n:-\nAfter this there came a lull, caused mainly by the commercial depression both at home and abroad, during which little progress was made.\nA revival set in and again subscribers registered until £\n581\nwas reached. John Birrell, the Professor of Hebrew and Oriental languages, presided at the dinner and Peter Scott Lang, the regius Professor of Mathematics and dean of the Faculty of Arts, was also present. About\n40\nother subscribers attended\n[\n5\n]\n:-\nMany of them were the Doctor's older pupils, a few his former assistants, and all cordial friends, warmly appreciative of his wonderful power to awaken youthful enthusiasm in what is too often regarded as a \"dry as dust\" study. Dr Lonie may be regarded as a pioneer reformer in his own walk of life. He has no faith in the \"tawse\" as an educator, and, notwithstanding the lack of order and authority many would suppose this would entail, no one could take even a cursory glance through Dr Lonie's classroom without being struck with its joyous air of freedom, its remarkable absence of what he himself terms \"boy-repression\" and the manifold indications of vigorous hard work. Accepted notions of teaching by dint of rigid military discipline are unceremoniously discarded, and the Doctor fearlessly works out his own propositions that a boy should be as much at liberty to walk up and down in his classroom as the tradesman is in his workshop. Herein lies largely the secret of this teacher's success, and the explanation of the fact that his name is still fondly cherished by many old pupils scattered all over the globe.\nProfessor Birrell read many tributes to Lonie from former pupils not able to be present. For example, the Rev James Robertson, Whittingham, Northumberland, wrote\n[\n5\n]\n:-\nHe was and remains to my mind an example of an ideal teacher, one of the rare few by whom their pupils are both inspired with enthusiasm at the time, and of whose eminence in teaching they have an undiminished sense when they look back on it with the experience of years.\nJohn Tulloch, the Principal of the University, wrote\n[\n5\n]\n:-\nI do not know any teacher more deserving of honour than Dr Lonie. His long career of unselfish devotion to duty has excited respect of all who know anything of him or his work.\nLonie spoke of his hopes for the future\n[\n5\n]\n:-\nI would have you bear in mind that it is a hard thing for these little boys to sit\n6\nor\n7\nhours a day on a bench, and begin again to a task of\n2\nor\n3\nhours at night, while the great sun is calling on them all the while to enjoy themselves, and the birds are singing and all nature alive and inviting them to her great temple rather than to the small confined temple of the classroom. I hope that the day is not distant when every scholar will have free scope for his young powers, and the liberty to stand up and put questions inviting discussion.\nLet us also record at this point two further comments about Lonie as a teacher\n[\n3\n]\n:-\nWhen work in mathematics was slow moving Mr Lonie used to stop the class, sing 'Cheer, boys, cheer' loudly and carry on with the lesson.\nIt is also recorded in\n[\n3\n]\nthat Lonie altered the timetable moving his Geometry class from\n12\nnoon to\n6\nam.\nThe\n1881\ndinner marks the high point of Lonie's exceptional teaching career. It ended, however, in sadness as reported by the Scotsman\n[\n8\n]\n:-\nOwing to a new-fangled reconstruction of the teaching machinery of the Madras College, Dr Oughterlonie was obliged to retire from his position of the mathematical master in the autumn of\n1888\n.\nThe trustees gave him no retiring allowance and he seems to have been rather badly treated after all the years of loyal service he had given to the school\n[\n8\n]\n:-\nPractically the expulsion of Dr Oughterlonie from his old familiar classroom was a sentence of death upon him. He loved his work and lived for it. Enforced idleness cut him off from his chief interest if life. When he left St Andrews, Dr Oughterlonie, after a few months residence in Trinity Crescent, bought Oakleigh Villa, Wardie, near Granton, hoping then to give his later years to science and books. But three years ago he was struck with a paralytic affliction, from which he did not completely recover. Under a second seizure he had been sinking for some time past, and the end came early yesterday morning at his residence at Wardie.\nThis obituary\n[\n8\n]\npaid tribute to his outstanding abilities as a teacher:-\nHe was energetic, zealous, capable and not unkind. ... He was really a capital teacher for boys, gifted with a faculty of lucid explanation, the still rarer faculty of making geometry and algebra nearly as interesting as a game of chance, and, rarest of all, the faculty of being able to secure attention and maintain complete order in large classes without the tawse, birch, twigs, or any other instrument of physical force. ...\n[\nHe was\n]\nthe best teacher of elementary mathematics in Scotland. ... Many of his friends and pupils were of the opinion that he ought to have had his academic success rewarded by promotion to a professor's chair."
}