{
  "nome_completo": "William Sanders",
  "nome_curto": "William Sanders",
  "ano_nascimento": "1640",
  "ano_morte": "1705",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sanders/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "probably Perth, Scotland",
  "biografia": "William Sanders\nwas born about\n1640\nand died in\n1705\n[\n36\n]\n.   According to baptismal records, he was probably born in\n1634\nin Glasgow, Lanarkshire, Scotland and his parents are listed as James Sanderis and Issobell Straquhen\n(\nor Straquhene\n)\nfor the\n17\nNovember\n1635\nbaptism.   He was educated at Marischal College at Aberdeen and graduated in\n1659\n.   This date of graduation provides additional evidence that Sanders was born around\n1640\n.  University students\n(\nall male\n)\nbegan their studies around the age of\n14\nand studies lasted\n4\nyears, making Sanders the age of\n18\nor\n19\nin\n1659\n, which would have been the standard age for completing university studies.  If he was baptized in\n1634\n, this would have made him a university student more advanced in age than most students who began their university studies as teenagers.  If born in\n1634\n, he would have been\n25\nyears old in\n1659\nwhen he graduated from Marischal College.\nAfter graduating from Marischal, Sanders became \"Under Master\" in the Grammar School of Aberdeen\n[\n36\n]\n.   Moving from Aberdeen to St Andrews, Sanders began as a regent\n(\ni.e. instructor\n)\nat St Andrews in\n1671\n.  He was appointed to the Chair of Philosophy in\n1672\n, and beginning in\n1674\n, he was appointed the second Regius Chair in Mathematics, succeeding the prominent mathematician and astronomer,\nJames Gregory\n, when he left St Andrews for the University of Edinburgh.\nAfter Sanders became a regent at St Andrews in\n1671\n, he married Anna Concordia Strachan\n(1661\n-\n1735)\nand they had nine children.   Anna Concordia Strachan was the daughter of Alexander Straquhan and Jeane Barrone.  Alexander Straquhan was Minister of Birse parish and graduated from King's College in Aberdeen in\n1651\n[\n37\n]\n.   Other spellings of Strachan are Straqne, Straquhan, Straquhan, Straquhane, Straquhane, Straquhine, and Straquhine.  It was common for various spellings of the same surname to be used in seventeenth century Scotland.  These various spellings look quite close to the spelling of the surname of Issobell Straquhen, William's mother.  It is quite possible that William Sanders and Anna Concordia Strachan were relatives.  Alexander Straquhan married Jeane Barrone in\n1658\nin Aberdeen and Issobell Straquhene married James Sanders in\n1613\nin Aberdeen.\nWilliam and Anna Concordia's first child was born in\n1678\n, several years into his position as Regius Chair.  Perhaps this position had given him a more desirable income and he was able to support a family.  William and Anna Concordia Strachan had four sons and five daughters born between\n1678\nand\n1695\n: James Sanders born in\n1678\nin St Andrews; Johne Sanders born in\n1679\nin St Andrews; Amilia Sanders born in\n1681\nin St Andrews; Isobell Sanders born in\n1683\nin St Andrews; Anna Sanders born in\n1686\nin St Andrews; Barbra Sanders born in\n1687\nin St Andrews; Wm. Sanders born in\n1689\nin Dundee; Bessie Sanders born in\n1692\nin Perth; and Robert Sanders born in\n1695\nin Perth.\nTwo years after the publication of\nElementa Geometriae\n, in\n1688\n, Sanders resigned as Regius Chair and became a schoolmaster in Dundee.   In\n1690\nSanders moved on to become Headmaster at Perth Grammar School, where he remained until he retired in\n1704\n[\n1\n]\n.\nSanders was exposed to mathematical and scientific topics while at Marischal, as is known from the theses the students produced in\n1659\n.  At the time that Sanders was at Marischal College, graduation was by public defence of a thesis.  The theses were usually prepared by the regent.  However, the\n1659\ngraduation theses of George Meldrum, a regent at Marischal, were written by the students, though Meldrum stated in the introduction that the theses accurately represented his own views.  Whether on account of what was taught at Marischal by Meldrum and others, or on account of the students' role in the production of the theses\n[\n30\n]\n:-\n... the theses shewed no great originality: the heavens\n[\nwere\n]\nincorruptible;\nCopernicus\n[\nwas\n]\nrejected; the question of solid spheres\n[\nwas\n]\nleft open but a fluid heaven\n[\nwas\n]\nregarded as more probable.\nThese were not scientifically advanced concepts, but nonetheless the theses provide evidence of astronomy, natural philosophy, and mathematics as topics of Sanders' studies at Marischal.\nSome of what is known about Sanders is because of his association with\nJames Gregory\n, who had been the Regius Chair of Mathematics for three years when Sanders arrived in\n1671\n.  The Regius Chair position had been created for\nJames Gregory\n, who took up the post in\n1668\n.  Robert Moray, a graduate of St Andrews and member of the\nRoyal Society\n, along with Archbishop Sharp of St Andrews persuaded King Charles II to found the professorship\n[\n29\n]\n.   When Sanders was Chair of Philosophy, he collaborated with\nJames Gregory\non\nThe Great and New Art of Weighing Vanity\n, which was published in Glasgow in\n1672\nby Robert Sanders, who was William's brother and a printer in Glasgow\n[\n16\n]\n[\n8\n]\n.   The book was a satire mocking the hydrostatical works of George Sinclair, another Scottish scientist, affiliated at different points in time with Glasgow and Edinburgh\n[\n9\n]\n.   Sanders and\nGregory\npublished\nThe Great and New Art of Weighing Vanity\nwith the pseudonym M. Patrick Mathers.  The Scottish term for this sort of satirical literary work is\nflyte\n[\n13\n]\n.\nJames Gregory\nalso attended Marischal College and graduated in\n1657\n, and the two men may have met as students, though this is not known for certain.  Even before arriving in St Andrews, Sanders had a copy of\nGregory\n's\nOptica Promota\n, which indicates an interest in optics or a familiarity with\nGregory\n[\n33\n]\n.   A signature of William Sanders dated\n1664\n, on the verso of the title page of a copy of\nOptica Promota\nwhich is now in St Andrews Special Collections, is evidence of Sanders' acquisition of a copy of\nGregory\n's book prior to\n1671\n.\nIn addition to collaborating on\nThe Great and New Art of Weighing Vanity\n, Sanders was involved in\nGregory\n's efforts to build an observatory.  Sanders himself served as clerk and wrote the university commission for the founding of the observatory in St Andrews and the purchase of instruments to equip the observatory.  The commission was dated the\n10\nth of June\n1673\nand the final sentence of the commission reads as follows\n[\n26\n]\n:-\nAs Witness these presents, written by William sanders, one of our number, Clerk for the time, and subscrived with our hands in the University hall, on the Tenth day of June sixteen hundred and seventy-three years.\nThe commission was signed by the Rector, the Provost of St Mary's College, the Provost of the Old College, the Principal of St Leonard's College, and eight others.\nIn\n1674\n, the year in which Sanders became Regius Chair, his\nTheses Philosophicae\nwas published in Glasgow by his brother\n(\nall three of Sanders' publications were printed by his brother Robert in Glasgow\n)\n[\n32\n]\n[\n8\n]\n.\nTheses Philosophicae\nwere the graduation theses he wrote as regent for his students to argue and defend publicly prior to their graduation\n[\n35\n]\n. Sanders'\nTheses Philosophicae\nwere presented for twenty candidates of St Leonard's College at the University of St Andrews in\n1674\n.   The theses contained topics that\nGregory\nand Sanders were teaching at the time, including many astronomical topics, which, according to\n[\n30\n]\n:-\n... must have derived from\nGregory\nsince they reveal a familiarity with contemporary astronomy and an accuracy of exposition which are quite outstanding.\nThe heliocentric system was accepted, and Sanders was the first to include\nKepler\n's laws of planetary motion;\nKepler\n's planetary harmonies were discussed,\nCassini\n's determinations of the periods of axial rotation of Jupiter and Mars were quoted, and\nCassini\n's data for the three known satellites of Saturn were quoted.  This is a complete change from his education under Meldrum at Marischal, which reinforces the likelihood that\nGregory\nexerted a great deal of influence on Sanders and his theses.  Theories of light and color, as espoused by\nNewton\n, had appeared in\n1672\nand were included in the theses.  As described in\n[\n30\n]\n:-\nSanders was whole-heartedly Cartesian, with an evident contempt for the older scholastic methods of argument and exposition.\nThe theses quoted from\nThe Philosophical Transactions\n; the mathematician,\nJohn Wallis\n, of Oxford was referenced several times; and\nDescartes\n'\nDiscours de la méthode\n(1637)\nwas quoted in full\n[\n33\n]\n.\nHaving served as a regent, Chair of Philosophy, and Regius Chair of Mathematics, Sanders was well established at the University of St Andrews.  He had published three books, participated in\nGregory\n's efforts to build an observatory, and acquired books and\nThe Philosophical Transactions\nfor the library.  But there may have been tensions with the university and Sanders resigned as Regius Chair in\n1688\n.\nIt is possible Sanders' relationship with the university deteriorated in the same way that\nGregory\n's had.  Antoni Malet\n[\n18\n]\nsays that \"the exact reasons for\n[\nGregory\n's\n]\ndeparture from St Andrews are not known.\"  However a letter from Sanders states that\nGregory\nand Sanders were criticised by the university for an incident involving professors, students, principals of the university, and the town council.  Malet cited a\n1697\nletter from Sanders\n(\nthen at Perth\n)\nto the Provost of St Salvator College at St Andrews:-\nAs for the injure\n[\nsic\n]\ndone by the Baxters to the deceist\n[\nsic\n]\nMr\nGregory\nand me, when the late Earl of Roxburgh was my pupil\n[\nsic\n]\nand scholar, I gave a full account of it to Mr Scrimizeour, and Dr Skeen knows it as well as I, and better than I  how it ended\n[\n;\n]\nfor\n24\nor\n48\nhoures\n[\nsic\n]\nafter Mr\nGregory\nand I instrumented P. Lentron, in the university's name for satisfaction to us injured, we turned it over upon Dr Comry then Rector, with whom and other Mrs in the university the town compounded for an insufficient satisfaction, far below that which we told the university we would demand and they approved.\nSanders and\nGregory\nconsidered the university rector's decision to be \" 'mock satisfaction' and did not abide by it\", and the two men received a penalty\n[\n18\n]\n.\nGregory\n's salary was kept from him, and instead of acquiescing, he moved to become the Mathematics Chair at Edinburgh.\nIt is possible that Sanders, like\nGregory\n, became disenchanted with St Andrews on account of salary.  There is evidence for a debt owed to William Sanders for his time at St Andrews in a court filing by his widow, Anna Concordia Strachan, dated\n2\nJune\n1735\n[\n38\n]\n.   There had also been a suspension of Sanders in\n1675\nfor conduct at a Rectorial election, which provides evidence that there were ongoing strains between Sanders and the university\n[\n42\n]\n.\nAn additional factor contributing to Sanders'\n1688\ndeparture may have been the political and religious changes occurring at the time.\n1688\nwas a time of religious and political turmoil in Scotland, immediately prior to the \"Glorious Revolution\",  the overthrow of James II and VII by Mary\n(\ndaughter of James II\n)\nand her husband William of Orange\n[\n40\n]\n.\nIn seventeenth century Scotland, university appointments were influenced by politics and religion.  Universities operated under the inspection of government commissioners whose visitations could affect who taught and what was taught at the universities.    At times the Presbyterians were not in favour at universities and at times the Episcopalians were not in favour.  The Glorious Revolution also saw a division in loyalty to Mary and William and to James II and VII.  In\n1690\n, a \"general witch hunt\" at the universities occurred.   The Parliamentary Commissioners\n(\ni.e., visitation commissioners\n)\nwere \"to search ... dictates for evidence of insufficiency and to ensure their loyalty to the present government.\"  At St Andrews, \"of the eight regents belonging to the two colleges only one retained his position after the visitation\n[\n35\n]\n.\" Sanders may have anticipated the visitation and ensuing changes and thus departed.\nAs stated in\n[\n28\n]\n:-\nIt is unclear why Sanders left St Andrews and it is equally unclear why James Fenton should have been appointed to the Chair in\n1689\n.  Fenton is thought to have been a graduate of St Andrews but failed to bring distinction since he appears to have been sacked in\n1690\nand expelled from the University one year after being appointed.  Whether there were then legal problems in filling the Regius Chair is unknown, but it remained unfilled until\n1707\nafter Fenton's death."
}