{
  "nome_completo": "William Spottiswoode",
  "nome_curto": "William Spottiswoode",
  "ano_nascimento": "1825",
  "ano_morte": "1883",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Spottiswoode/",
  "lugar_nascimento": "London, England",
  "lugar_morte": "London, England",
  "biografia": "William Spottiswoode\n's father was Andrew Spottiswoode, a member of the printing firm of Eyre and Spottiswoode, the Queen's printers, and he was related to John Spottiswoode who was archbishop of St Andrews. A year after William was born Andrew Spottiswoode became member of parliament for Saltash and four years later member of parliament for Colchester. William's mother, Mary Longman, was the daughter of the publisher Thomas Longman. William attended school in Laleham, then went to Eton College, one of the most prestigious schools in England situated on the Thames near London. However\n[\n1\n]\n:-\n... he was expelled for letting off fireworks in the town, thus offending against a decree by the headmaster.\nFrom Eton he went to Harrow School, another prestigious school in Greater London. Certainly this episode proved an advantage to Spottiswoode, who received better teaching in his favourite subject of mathematics in Harrow. From Harrow, Spottiswoode was awarded a Lyon Scholarship to attend Balliol College, Oxford, which he entered in\n1842\n. Three years later he graduated with a First Class degree in mathematics. He later wrote:-\n[\nM\n]\ny interest in mathematics began at Oxford, and was due mainly to the energy and encouragement of my tutor Dr Temple\n(\nBishop of Exeter\n)\n.\nWhile at Oxford he rowed for the university in the annual Oxford-Cambridge boat race in both\n1845\nand\n1846\n. In\n1846\nand\n1847\nhe was awarded mathematics scholarships at Balliol College where he became a lecturer in mathematics.\nIn\n1846\nhis father had financial problems and Spottiswoode took over the firm of Eyre and Spottiswoode so becoming Queen's Printer. The firm prospered under his leadership and he created a model company with the interests of his employees at heart. In the following year his first mathematical publication appeared;\nMeditationes Analyticae\n. Herbert Rix, writing in\n[\n4\n]\n, describes Spottiswoode's mathematical contributions:-\nHis mathematical work was described as 'the incarnation of symmetry'. Besides supplying new proofs by elegant methods of known theorems, he did abundance of important original work. His series of memoirs on the contact of curves and surfaces, contributed to the 'Philosophical Transactions' of\n1862\nand subsequent years, mainly gave him his high rank as a mathematician. He was also the author in\n1851\nof the first elementary treatise on\ndeterminants\n, and to his treatise much of the rapid development of that subject is attributable.\nThe importance of his textbook\nElementary Theorems Relating to Determinants\n(1851)\n, referred to in this quote, can be seen from the fact that he was asked by\nCrelle's Journal\nto submit a paper to the journal developing his approach to determinants further; this he did in\n1856\n. On\n2\nJune\n1853\nSpottiswoode was elected a fellow of the\nRoyal Society\n. He was appointed president of the mathematical section of the\nBritish Association\nin\n1865\nand was treasurer of the Association from\n1861\nto\n1874\n. He also served on the council of the Royal geographical Society from\n1962\nto\n1864\n.\nSpottiswoode married Eliza Taylor Arbuthnot on\n27\nApril\n1861\n. Eliza was the eldest daughter of William Urquhart Arbuthnot, a member of the Council for India, and she had been born in Madras, India\n[\n1\n]\n:-\nTheir at-homes in Grosvenor Place, held at the height of the London season, attracted the cream of Victorian science and cabinet ministers alike. During these events the latest news in science would invariably be demonstrated in the laboratory which occupied part of the house.\nTheir son, William Spottiswoode, was born in\n1864\n. He became a partner, and later a director, of his father's publishing firm of Eyre and Spottiswoode.\nCertainly Spottiswoode was always a keen traveller and he visited a number of countries which were certainly somewhat unusual for the period. In\n1856\nhe visited eastern Russia and took the opportunity to use his literary skills by publishing in\n1857\na fascinating account in\nA Tarantasse Journey through Eastern Russia in the Autumn of\n1856\n. In\n1860\nhe visited Croatia and Hungary. In\n1861\n, the year of his marriage, Spottiswoode published\nOn typical mountain ranges: an application of the calculus of probabilities to physical geography\n, which attempted to use statistical methods to determine whether the mountain ranges of Asia had been formed by one or several causes.\nFrancis Galton\nsaid that this paper had been his inspiration to apply statistics to the social sciences.\nAround\n1870\nthere were major changes to the direction of Spottiswoode's research. This was a time when he received high office in a number of societies, being president of the\nLondon Mathematical Society\nfrom\n1870\nto\n1872\nand, from\n1871\nto\n1878\n, being treasurer of the\nRoyal Society\n. He was also treasurer of the Royal Institution from\n1865\nto\n1873\n. In\n1878\nSpottiswoode was elected president of the\nRoyal Society\nand remained president until his death in\n1883\n. Also in the year\n1878\nhe was president of the\nBritish Association\nfor its Dublin meeting. At the Dublin meeting he gave his presidential address on the growth of mechanised invention applied to mathematics.\nWe mentioned the change in direction of Spottiswoode's research which turned to physical topics. From\n1871\nhe studied the polarisation of light and later he studied electrical discharge in rarefied gases. Spottiswoode published over\n100\npapers and several books including, in addition to the one on determinants mentioned above:\nThe Polarisation of Light\n(1874)\n,\nPolarised Light\n(1879)\n, and\nA Lecture on the Electrical Discharge, its Form and Functions\n(1881)\n. The papers\n[\n2\n]\n:-\n... were published principally in the Philosophical Transactions, Proceedings of the Royal Society, Quarterly Journal of Mathematics, Proceedings of the London Mathematical Society and\nCrelle\n, and one or two in the Comptes rendus of the Paris Academy; a list of them, arranged according to the several journals in which they originally appeared, with short notes upon the less familiar memoirs, is given in\n[\n4\n]\n.\nHis interests however were not confined to mathematics and physics since he was also a leading expert on European languages and on oriental languages. He combined these different skills by undertaking research on the history of mathematics and astronomy in India. He was able to read the original Indian sources and his important contributions were published by the Royal Asiatic Society. His article in\nJournal of the Royal Asiatic Society of Great Britain and Ireland\n(1860)\ndiscussed the fact that that most of the principles of the differential calculus were known in ancient Indian mathematics before the period of\nBhaskara II\nin the\n12\nth\ncentury.\nKempe\n, in\n[\n2\n]\n, summarises his mathematical contributions:-\nThe interesting series of communications on the contact of curves and surfaces which are contained in the Philosophical Transactions of\n1862\nand subsequent years would alone account for the high rank he obtained as a mathematician. ... The mastery which he had obtained over the mathematical symbols was so complete that he never shrank from the use of expressions, however complicated nay, the more complicated they were the more he seemed to revel in them provided they did not sin against the ruling spirit of all his work symmetry. To a mind imbued with the love of mathematical symmetry the study of determinants had naturally every attraction.\nIt is remarkable that Spottiswoode was able to undertake the amount of work that he did, both scientific and administrative. However it took its toll on his health and, at least indirectly, contributed to his death\n[\n3\n]\n:-\nHe went to Italy on a short holiday to recuperate from overwork and the after-effects of a tricycle accident but after returning home contracted typhoid, and three weeks later died, on\n27\nJune\n1883\n, at his home,\n41\nGrosvenor Place. He was fifty-eight years old and his death was regarded as a national loss. In recognition of his position as president of the Royal Society and his contribution to science he was buried on\n5\nJuly in Westminster Abbey in the presence of civic dignitaries and the whole scientific establishment.\nWe have mentioned above many honours which Spottiswoode received in election to learned societies and particularly to high office in these societies. We should also mention his election to the\nAcademy of Sciences\nin Paris and the award of honorary degrees by the universities of Cambridge, Dublin, Edinburgh, and Oxford."
}