{
  "nome_completo": "William Edward Hodgson Berwick",
  "nome_curto": "William Berwick",
  "ano_nascimento": "1888",
  "ano_morte": "1944",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Berwick/",
  "lugar_nascimento": "Dudley Hill (near Bradford), England",
  "lugar_morte": "Bangor, Wales",
  "biografia": "William Berwick\n's father, William Edward Berwick\n(\nborn in Shipley, Yorkshire about\n1843)\n, was a wool merchant in Bradford. His mother was Mary Hodgson who was born in Wrose Windhill, Yorkshire and the pair were married on\n31\nst\nMay\n1881\n. William had had an older sister Mary\n(\nborn about\n1884)\n.\nWilliam Berwick was educated at a small private school before entering Bradford Grammar School where he soon showed his mathematical potential. He completed his schooling in\n1906\nand was awarded a Brown Scholarship from the Grammar School to assist in supporting him during his university studies. He was also awarded an entrance scholarship by Clare College, Cambridge, and he studied there for the Mathematical Tripos.\nIn\n1909\nhe took Part I of the Tripos and was placed as joint fourth\nWrangler\n. This means that he was placed fourth in the ranked list of those who were awarded a first Class degree. It is interesting to look at Berwick's fellow students, particularly those who were ranked above him in the Tripos. In first place was\nP J Daniell\n, who had been coached by R A Herman, while\nE H Neville\n, who was also coached by Herman, was placed second.\nNeville\nwent on to become a colleague of\nHardy\n's at Trinity College and it was\nNeville\nwho met with\nRamanujan\nwhile lecturing in India and made his visit to England possible.\nDaniell\nwent on to become professor of mathematics at the University of Sheffield, but the most famous of Berwick's fellow students was\nL J Mordell\n. It was during his undergraduate years at Cambridge that Berwick became interested in number theory, and in this he was particularly influenced by\nG B Mathews\nwho lectured at Cambridge. Berwick sat Part II of the Mathematical Tripos in\n1910\n, then submitted an essay entitled\nAn illustration of the theory of relative corpora\nfor the Smith's Prize in the following year. He was awarded the second Smith's Prize and, also in\n1911\n, his first paper was published. This paper,\nOn the reduction of arithmetical binary cubics which have a negative determinant\n, was written jointly with\nMathews\nand it was in fact the only paper Berwick jointly authored throughout his career.\nBy the time that Berwick's first paper was published he had left Cambridge to take up an assistant lectureship at the University of Bristol. He held this post until\n1913\nwhen he moved to a lectureship at University College Bangor. World War I broke out in\n1914\nand lasted four years. For two of these four years Berwick undertook valuable war service on the Technical Staff of the Anti-Aircraft Experimental Section of the Munitions Inventions Department at Portsmouth. During session\n1919\n-\n20\nthe head of the mathematics department at Bangor was absent and Berwick was acting Head of Department. Following this he moved to the University of Leeds as a lecturer but, in\n1921\n, he was promoted to Reader in Mathematical Analysis there. In the same year he was elected to a fellowship at Clare College, Cambridge.\nWhile Berwick was in Leeds he married Daisy May Thomas in\n1923\n. She was from Sheffield and the daughter of Dr W R Thomas. Two years later Berwick received another recognition of his mathematical distinction when he was awarded a Sc.D. by the University of Cambridge in\n1925\n. The Chair of Mathematics at Bangor fell vacant and in\n1926\nBerwick was appointed to the post. Berwick wrote only\n13\nresearch papers, a monograph, and a number of other articles on mathematical recreations and puzzles. Ill health prevented him from undertaking more extensive work and in fact he only published five papers after his appointment to Bangor.\nDavenport\nwrites in\n[\n2\n]\n:-\nThe years immediately preceding and following\n[\nhis appointment to Bangor\n]\nconstitute his most productive period. It was not long, however, before his health began to deteriorate, and at the height of his powers he fell victim to a long and progressive illness, which he bore with great fortitude and patience. He continued to carry out his lecturing and administrative duties as long as possible, and it was with much difficulty that he could be persuaded to delegate any part of them. By\n1940\nit became impossible for him to carry on any longer, and he resigned his chair.\nBerwick was an algebraist who worked on the problem of computing an integral basis for the\nalgebraic integers\nin a simple algebraic extension of the\nrationals\n. He also studied ideals in rings of algebraic integers. His book\nIntegral Bases\npublished in\n1927\nis a significant contribution described by\nDavenport\nas:-\n... quite an ambitious undertaking.\nThe existence of such a basis can be easily proved but practical methods to compute such a basis are much harder. The heavy numerical computations involved in Berwick's work kept it outside the mainstream of algebraic number theory. As\nDavenport\nwrites:-\n... a great deal of courage and patience must have been needed for such a complex and laborious analysis.\nIn fact the work gained an importance which saw it republished in the\n1960\ns.\nBerwick also gave, in\n1915\n, necessary and sufficient conditions for a\nquintic equation\nto be\nsoluble by radicals\n. This, like nine of his thirteen papers, was published in the\nProceedings of the London Mathematical Society\n.\nIn fact Berwick was a staunch supporter of the\nLondon Mathematical Society\nand served on the Council from\n1925\nto\n1929\n, being Vice-President of the Society in\n1929\n. His wishes were that a sum of money being given to the Society on his death to establish two prizes. His widow Daisy May Berwick presented the Society with the money and the Council decided to name the two prizes the Senior Berwick Prize and the Junior Berwick Prize. These prestigious prizes continue to be awarded by the\nLondon Mathematical Society\n.\nSee\nTHIS LINK\n.\nWe have a fine picture of Berwick through\nDavenport\n's words in\n[\n2\n]\n:-\nIn physical appearance Berwick was tall and impressive, and he had a clear and distinctive voice. He had many highly individual traits of character, and his conversation, even on the most commonplace subjects, had a pungent forthrightness which often startled his hearers. The workings of his mind continually took the most unexpected and original turns, which were a source of stimulation and delight to his friends. All those who appreciated the valuable qualities which lay behind his somewhat abrupt and reserved manner held him in high esteem.\nHis interest in teaching can be seen in the articles he published on mathematical recreations and also in the addresses he gave to several meetings of the\nBritish Association\n. His main hobby was chess and he enjoyed playing in the chess clubs of the various universities in which he worked.\nDavenport\nsums up Berwick's mathematical papers as follows:-\nBerwick's work does not make easy reading, though his exposition is clear and logical. He presumes in the reader a considerable background of knowledge - usually more than is suggested by the introductory paragraphs of his papers - and he was himself of course a master of all the classical theory of algebraic numbers."
}