{
  "nome_completo": "William McFadden Orr",
  "nome_curto": "William McFadden Orr",
  "ano_nascimento": "1866",
  "ano_morte": "1934",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Orr/",
  "lugar_nascimento": "Ballystockhart, Comber, County Down, Ireland",
  "lugar_morte": "Douglas, Isle of Man",
  "biografia": "William McFadden Orr\nwas the eldest son of Fletcher Blakeley Orr and Elizabeth Lowry. Fletcher Orr was a farmer in Ballystockhart who also owned corn and flax mills. Elizabeth Lowry was the daughter of David Lowry who was also a farmer with a farm at Ballymachashan, Killinchy, County Down. William attended the local school, Ballystockhart National, where he was taught by Mr R Dickson, before spending two years at Newtownards Intermediate where he was taught by Mr J Boyd. At this time the family were living at Plevna Villas, situated between Cyprus Avenue, Beersbridge Road and Upper Newtownards Road, Belfast. He then entered the Methodist College, Belfast, where he was taught mathematics by James Adams McNeill. The College, which had opened in\n1868\n, was intended to educate the children of Methodist Ministers but it also prepared some students for the scholarship examinations of the Royal University of Ireland. James Adams McNeill\n(1853\n-\n1907)\nhad studied at Queen's College, Belfast before being appointed as a Senior Mathematical Master at the Methodist College, Belfast in\n1878\n. In\n1890\nhe moved to Campbell College, becoming joint headmaster.\nOrr thrived under the excellent tuition given by McNeill and he was taught geometry from the textbooks of Richard Townsend\n(\nChapters on the modern geometry of the point, line, and circle\n)\n, and\nJohn Casey\n. In\n1883\nhe was awarded a scholarship from the Royal University of Ireland. Queen's College, Belfast, was one of the colleges of the Royal University of Ireland and it was there that Orr studied. He was taught by\nJohn Purser\n. With\nPurser\n's teaching, Orr\n[\n2\n]\n:-\n... became famous for the brilliance of his answering at the examinations of the Royal University of Ireland ...\nHe graduated from Queen's College, Belfast, in\n1885\nand, on\n27\nApril of the same year, he was admitted as a pensioner at St John's College, Cambridge. He matriculated at St John's College in the Michaelmas Term\n(\nthe first term\n)\nof\n1885\nas a scholar, meaning that he had won a scholarship. At St John's College he was taught by\nJoseph Larmor\nand the two became life-long friends with Orr obtaining much advice from his teacher. He graduated with a B.A. in\n1888\nbeing Senior\nWrangler\nin the mathematical tripos, obtained first place in Part II in\n1889\n, followed by the award of a fellowship in St John's College in\n1891\n. The work which won him the fellowship was on extending\nFeuerbach\n's theorem about systems of circles. In the same year as he was awarded the fellowship, he was appointed professor of applied mathematics at the Royal College of Science for Ireland, in Dublin. This College had been created in\n1867\n, growing out of the Museum of Irish Industry. It was based at\n51\nSt Stephen's Green and it offered a range of science subjects linking classroom and laboratory teaching. Orr became one of several eminent professors who struggled to keep up their research because of heavy teaching loads.\nIn\n1892\nOrr married Elizabeth Campbell, known as Lizzie, a daughter of Samuel Watson Campbell, of Melbourne, Australia. The Campbell family were originally Irish, coming from County Down. William and Elizabeth Orr had three children, all girls: Elizabeth Lowry Orr was born on\n18\nMay\n1894\nand baptised on\n14\nOctober\n1894\n; Annie Gwendoline Holmes Orr was born on\n19\nJune\n1896\nand baptised on\n12\nJanuary\n1897\n; and Edith Kathleen Orr was born on\n7\nJune\n1900\nand baptised on\n14\nDecember\n1900\n. All the baptisms took place at Eustace Street Presbyterian Church in Dublin, Dublin County, Ireland.\nWe learn something of Orr's problems in his new job from a letter he wrote from Rathgar, Dublin, to\nJoseph Larmor\non\n8\nOctober\n1895\n. In this letter Orr asks Larmor for information regarding Captain Abney's knowledge of mathematics. Captain William de Wiveleslie Abney\n(1843\n-\n1920)\nwas a scientific photographer particularly interested in applications of photography to astronomy. He worked at the Department of Science and Art, South Kensington, London, and he served as president of the\nRoyal Astronomical Society\nin\n1893\n-\n95\n. One might wonder what Abney had to do with the Royal College of Science for Ireland, Dublin, but the reason was that this Irish institution was under the direct supervision of the Department of Science and Art at South Kensington, London. Orr tells\nLarmor\nthat he has a meeting with Abney shortly regarding the syllabus he has to teach at the Royal College of Science, Dublin. Orr writes that he considers the subjects he has been asked to teach as being too much, both for himself and for his students. He wishes to make a case to Abney but is unsure how much Abney will understand regarding a mathematics syllabus. In the letter, he also complains vigorously about the hours he has to spend at the University and the amount of work he has to do. He tells\nLarmor\nthat he is most aggrieved at the situation.\nOrr's first publications were on hypergeometric series,\nFourier\ndouble integrals involving\nBessel functions\nwhich he followed up with a similar paper involving\nLegendre\nfunctions. In\n1898\nOrr published\nOn the forced precession and nutations of a rotating ellipsoidal shell containing liquid\nin the\nPhilosophical Magazine\n. His paper begins:-\nThe object of the following analysis is mainly to determine the difference between the precession and nutation of a spinning body like the earth subject to external couples such as those which act on the earth on the hypothesis that it is perfectly rigid and that it is a shell filled with liquid. The liquid is supposed to be homogeneous, incompressible, and frictionless, the shell to be rigid, and the inner and outer surfaces to be surfaces of revolution about a common axis. Owing to these suppositions the bearing of the results obtained on the question of the internal liquidity or solidity of the earth is probably remote. Results for the problem to be discussed here have been stated long ago by\nLord Kelvin\n, but without any indication of the analysis by which he obtained them. It will appear that while the results here obtained for the precession and the nineteen-yearly nutation agree closely with\nLord Kelvin\n's, those for the half-yearly and the fortnightly nutations differ.\nOrr was not the only one to find errors in\nLord Kelvin\n's paper, for some years later\nHenri Poincaré\nalso found the errors.\nLord Kelvin\nwrote to\nPoincaré\non\n2\nMarch\n1901\nfrom\n15\nEaton Place, London:-\nI am sorry to say it is too true that there are, as you tell me in your letter which I have received this morning, several mistakes in respect to magnitude and to sign in my statements regarding the nutation which would exist if the earth consisted of a rigid ellipsoidal shell filled with frictionless liquid. Ever since\n1876\nwhen that statement of results was published, I have been looking for time to go through the mathematical work again and publish it. If I had succeeded in finding the time, no doubt I would have corrected the errors myself; but in this I was anticipated by an Irish professor\n(\nW McF Orr, of the Royal College of Science, Dublin\n)\n, in a paper published in the 'Philosophical Magazine' for December\n1898\n. The corrections which you will find in this paper agree, I believe, with those you now give me. The subject is most interesting, and I hope yet to return to it, but meantime I hope you will publish your own work with your corrections of my errors. In my mathematical work I suppose for simplicity the ideal interior liquid to be frictionless. No assumption of viscosity in the liquid would be, to my mind, very interesting. It certainly could not show any way of escaping my main conclusion that the earth is on the whole an elastic solid of high rigidity; though probably or possibly not so high as to cause practically perfect resistance against change of shape by the tide-generating influences of the sun and moon. I thank you warmly for your kindness in writing to me and telling me of the errors you have found.\nIn\n1904\nOrr published\nOn Clausius' theorem for irreversible cycles, and on the increase of entropy\n, published in the\nPhilosophical Magazine\n.\nAlbert Einstein\nwrote a review\n[\n4\n]\nin which he wrote:-\nThe author shows that in the 'Treatise on Thermodynamics'\nPlanck\napplies the concepts \"reversible\" and \"irreversible\" in a sense somewhat different from that which he defines them. Then he advances a series of objections that may be raised against various ways of representing the foundations of thermodynamics; especially noteworthy among these objections is that of\nBertrand\n, i.e., that the pressure, temperature, and entropy are defined only for the case that at least sufficiently small parts of a system can be regarded as being in equilibrium; a similar objection is raised with respect to the heat supplied.\nIn\n1906\n, Orr submitted to the\nRoyal Irish Academy\nthe first of his two papers entitled\nThe Stability or Instability of the Steady Motions of a Perfect Liquid and of a Viscous Liquid\n, this first part being subtitled\nA Perfect Liquid\n. The second part, submitted in\n1907\n, was subtitled\nA Viscous Liquid\n. We present some brief extracts from the Introduction and Summary of Contents of both parts of Orr's paper at\nTHIS LINK\n.\nOrr is best remembered today by applied mathematicians through the Orr-\nSommerfeld\nequation that is an eigenvalue problem which models\n2\n-dimensional modes of disturbance in a parallel shear flow. Michael Eckert writes in\n[\n3\n]\n:-\n[\nIn\n1909]\nArnold Sommerfeld\n, professor of theoretical physics in Munich, introduced what became known as the Orr-\nSommerfeld\nmethod to account for the instabilty of flows at the Fourth International Congress of Mathematicians in\n1908\nin Rome. He was not aware of William McFadden Orr's more extensive work. Other mathematicians and physicists also did not take note of Orr's work. Even in Great Britain Orr's contribution seems to have been ignored for some years.\nHorace Lamb\n, the author of the well-known textbook on hydrodynamics, still did not mention Orr's publication in\n1910\nwhen\nSommerfeld\nasked him about new publications on turbulence. In the fourth edition\n[\npublished in\n1916]\nof 'Hydrodynamics', however,\nLamb\nacknowledged that the stability equation for plane Couette flow was given by Orr, and afterwards independently by\nSommerfeld\n. This seems to be the first time when both Orr and\nSommerfeld\nappeared together.\nOrr was elected a fellow of the\nRoyal Society of London\nin\n1909\n. Two years later, in October\n1911\n, the Royal College of Science for Ireland moved to new premises in Merrion Street. At this time the College had\n141\nstudents. It had been aiming to expand from its modest size but the outbreak of World War I in\n1914\nwas a blow. On\n11\nMay\n1916\n, Orr wrote to\nLarmor\nabout the Easter Uprising in Dublin and its aftermath. Orr suggested that the government treated the rebels too leniently and says that most of the Protestants he has spoken to agree with him. After the World War I ended in\n1918\nthe political troubles in Ireland added to the problems that the College was facing and in September\n1922\nthe closure of the College was announced. However, University College Dublin offered the Royal College of Science accommodation and for two years Orr was one of the professors teaching in the University buildings on St Stephen's Green. Attempts were made to return to Merrion Street but, on\n4\nMay\n1926\n, University College Dublin offered to appoint most of the staff from the Royal College of Science. Orr accepted this offer and became a Professor of Pure and Applied Mathematics at University College Dublin. He continued to hold this position until he retired in\n1933\n.\nJames Richard Timoney attended Orr's lectures at University College Dublin in\n1928\n. Timoney, known as Dick, worked with\nEdmund Whittaker\nin Edinburgh before returning to University College Dublin in\n1932\nwhere he became a colleague of Orr. In the\n1970\ns Timoney was Head of Mathematics at University College Dublin. He writes:-\nWe were taught mathematical physics in first year honours by William McFadden Orr. ... He was a great gentlemen but very stern in every sense. He would sit with his pocket watch out waiting for\n9\no'clock to start the lecture on the dot. If you came in after\n9\na.m. you got a 'late' on the role. ... He was heard to say that research in the College of Science consisted of solving a quadratic equation which had not been solved before. We learned little form him for most of the time was spent criticising the bad treatment of\nNewton\n's laws. We did not know very well what the laws were but we knew that Ernst Mach was the man to be respected.\nAnother student, J S Strettan, relates an anecdote relating to Orr giving students a 'late' on the role\n[\n1\n]\n:-\nOne morning he taxed me with being late. ... I pleaded that the College clock was five minutes fast by the Ballast Office clock. He got my estimate of the time, went off on his bicycle to the Ballast Office and checked it. The following morning he apologized and his apology was rendered all the more handsome by being made in the presence of his class.\nIn the early\n1920\ns Orr had a lengthy period of inactivity in research. In a letter to\nLarmor\non\n28\nMarch\n1925\nhe says he has started research again but is worried about his health, both physical and mental, and says he is not sleeping. He lived for less than a year after resigning his chair in\n1933\n. He died at Nobles Hospital, Douglas, Isle of Man but was buried in Mount Jerome Cemetery in Dublin. Shortly after his death, F Gowland Hopkins, President of the\nRoyal Society of London\n, gave an address at the anniversary meeting on\n30\nNovember\n1934\n. He said\n[\n6\n]\n:-\nIt would be an interesting subject for a psychologist to study as to how the creative faculty and the critical faculty can exist simultaneously in the one individual. Certainly the late William McFadden Orr possessed both in the highest degree. ... he led a life of unremitting labour in various branches of Mathematics. His original contributions to\nBessel\nFunctions,\nFourier Analysis\n, Stability of certain Liquid Motions, etc., all contained results which seem destined to be of permanent value. As the years went on, his critical faculties became more pronounced and he was able to elucidate many difficulties and rectify many conceptions, even in the writings of distinguished mathematicians. These qualities made him of the highest value as a referee for learned bodies. ... much of his life work was unseen by the general mathematical reading public ...\nLet us end this biography by quoting from\nArthur Conway\n[\n1\n]\n:-\nAnything connected with bicycles was of interest to Orr, who was up to the end a great cyclist. In his Tripos year at Cambridge he had carried off with great ease all the events at the Cambridge University meeting of that year. We in Dublin will long miss his lean, bearded figure going though the streets on a racing bicycle without an overcoat even in the coldest weather."
}