{
  "nome_completo": "William Arthur",
  "nome_curto": "William Arthur",
  "ano_nascimento": "1894",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Arthur/",
  "lugar_nascimento": "Fergushill School House, Kilwinning, Ayrshire, Scotland",
  "lugar_morte": "Glasgow, Scotland",
  "biografia": "William Arthur\n's parents were James Fulton Arthur, who was a teacher, and Elizabeth Fulton. He attended Queen's Park Higher School in Glasgow, then entered the University of Glasgow to study mathematics and natural philosophy. He graduated with an M.A. from Glasgow with First Class Honours in\n1915\n. Of course at this time Britain was at war with Germany and Arthur undertook war service, serving in the Welsh Guards from\n1915\nto\n1919\n. For his bravery he was awarded the Military Cross.\nOn completion of his war service in\n1919\n, Arthur was appointed as an Assistant Lecturer in Mathematics at the University of Glasgow. He was promoted to Lecturer in\n1925\n, then later promoted to Senior Lecturer. After Arthur retired in\n1959\nhe moved to the United States to spend\n30\nmonths as a Teacher of Mathematics at Bethany College, West Virginia from\n1960\nto\n1962\n.\nArthur was a member of the\nEdinburgh Mathematical Society\n, joining in January\n1920\n. He was honoured by being elected President for session\n1928\n-\n29\n. He was editor of the\nMathematical Notes\nproduced by the Society in January\n1930\nand October\n1930\n.\nThe Mitchell Lectureship on Methods of Statistics was founded in\n1925\nand endowed by the businessman and president of the Glasgow Chamber of Commerce Sir George Arthur Mitchell. Arthur was twice Mitchell Lecturer, first in\n1926\n, then again in\n1932\n.\nWilliam Arthur was elected to the\nRoyal Society of Edinburgh\non\n7\nMarch\n1921\n, his proposers being\nGeorge Alexander Gibson\n,\nAndrew Gray\n,\nJames Gordon Gray\n, Robert Alexander Houstoun.\nAn obituary, written by D Martin, appears in the\nRoyal Society of Edinburgh\nYear Book\n1980\n, pages\n32\n-\n33\n.\nWe give a version of this obituary at\nTHIS LINK"
}