{
  "nome_completo": "William George Horner",
  "nome_curto": "William Horner",
  "ano_nascimento": "1786",
  "ano_morte": "1837",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Horner/",
  "lugar_nascimento": "Bristol, England",
  "lugar_morte": "Bath, England",
  "biografia": "William Horner\n's father, also named William Horner, was from Ireland where from\n1770\nhe travelled round preaching. John Wesley, a founder of Methodism, encouraged William Horner senior to come to England and join the Methodist Society as a minister. At this time Methodists were members of the Church of England, the break coming later in\n1795\n.\nWilliam junior, the subject of this biography, was educated at Kingswood School Bristol. At the almost unbelievable age of\n14\nhe became an assistant master at Kingswood school in\n1800\nand headmaster four years later. He left Bristol and founded his own school in\n1809\n; The Seminary at\n27\nGrosvenor Place in Bath.\nHorner is largely remembered only for the method, Horner's method, of solving algebraic equations ascribed to him by\nAugustus De Morgan\nand others. He published on the subject in the\nPhilosophical Transactions of the Royal Society of London\nin\n1819\n, submitting his article on\n1\nJuly. But Fuller\n[\n7\n]\nhas pointed out that, contrary to\nDe Morgan\n's assertion, this article does not contain the method, although one published by Horner in\n1830\ndoes. Fuller has found that Theophilus Holdred, a London watchmaker, did publish the method in\n1820\nand comments:-\nAt first sight, Horner's plagiarism seems like direct theft. However, he was apparently of an eccentric and obsessive nature ... Such a man could easily first persuade himself that a rival method was not greatly different from his own, and then, by degrees, come to believe that he himself had invented it.\nThis discussion is somewhat moot because the method was anticipated in\n19\nth\ncentury Europe by\nPaolo Ruffini\n(\nit won him the gold medal offered by the Italian Mathematical Society for Science who sought improved methods for numerical solutions to equations\n)\n, but had, in any case, been considered by\nZhu Shijie\nin China in the thirteenth century. In the\n19\nth\nand early\n20\nth\ncenturies, Horner's method had a prominent place in English and American textbooks on algebra. It is not unreasonable to ask why that should be. The answer lies simply with\nDe Morgan\nwho gave Horner's name and method wide coverage in many articles which he wrote.\nHorner made other mathematical contributions, however, publishing a series of papers on transforming and solving algebraic equations, and he also applied similar techniques to functional equations. It is also worth noting that he gave a solution to what has come to be known as the \"butterfly problem\" which appeared in\nThe Gentleman's Diary\nfor\n1815\n[\n4\n]\n. The problem is the following:-\nLet\nM\nM\nM\nbe the midpoint of a chord\nP\nQ\nPQ\nP\nQ\nof a circle, through which two other chords\nA\nB\nAB\nA\nB\nand\nC\nD\nCD\nC\nD\nare drawn. Suppose\nA\nD\nAD\nA\nD\ncuts\nP\nQ\nPQ\nP\nQ\nat\nX\nX\nX\nand\nB\nC\nBC\nB\nC\ncuts\nP\nQ\nPQ\nP\nQ\nat\nY\nY\nY\n. Prove that\nM\nM\nM\nis also the midpoint of\nX\nY\nXY\nX\nY\n.\nThe butterfly problem, whose name becomes clear on looking at the figure, has led to a wide range of interesting solutions. We mention that Horner published\nNatural magic, a familiar exposition of a forgotten fact in optics\n(1832)\nand the modern invention of the\nzoetrope\n, under the name\nDaedaleum\nin\n1834\n, has been attributed to him. The zoetrope is a device which gives the impression of a moving picture by displaying a sequence of drawings or photographs.\nNeither the date of Horner's marriage nor the name of the woman he married are known, but it is recorded that they had several children. After Horner died in his home in Grosvenor Place, Bath, of a stroke in\n1837\n, one of his sons, also called William, carried on running the school The Seminary in Bath."
}