{
  "nome_completo": "William Thomas Tutte",
  "nome_curto": "William Tutte",
  "ano_nascimento": "1917",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Tutte/",
  "lugar_nascimento": "Newmarket, Suffolk, England",
  "lugar_morte": "Waterloo, Canada",
  "biografia": "William Tutte\n's father was William John Tutte who was an estate gardener, and his mother Annie Newell was a cook and housekeeper. Bill, as he was known to his friends and colleagues, was born in Newmarket, Suffolk, England, at a time when his parents were working in Fitzroy House, the Newmarket horse racing stable. In his early years, however, Bill lived in several different towns depending on where his father was working. The longest period that the family spent in a single place was near Whitby in Yorkshire, but when Bill was five years old his father got a job at The Rutland Arms Hotel in Newmarket. Bill and his parents returned to live in the village of Cheveley about three miles to the east of the town where their cottage was beside the Cheveley village church. Shortly after this Bill started his education attending the primary school in the village.\nWhen he was eleven years old Bill was awarded a scholarship to the Cambridge and County Day School. At this school he excelled in his studies but it was not mathematics which first inspired him for at this time his favourite subject was chemistry. Finding a copy of\nRouse Ball\n's book\nMathematical Recreations and Essays\nin the library while he was at this school he began to acquire a fascination with the graph theory problems he read about in this book but it was not enough to change his mind about studying chemistry at university.\nIn\n1935\nTutte went up to Trinity College, Cambridge, to study the Natural Sciences Tripos taking chemistry as his major subject. Soon after arriving at Cambridge his interest in mathematics was sufficient to have him join the Trinity Mathematical Society and he soon made friends with several of the mathematicians. He graduated with a degree in chemistry and began research, quickly producing his first two publications which were papers on chemistry published in\n1939\n.\nIt was, however, with his mathematical friends R Leonard Brooks, Cedric A B Smith and Arthur H Stone that Tutte wrote his next paper. They had found a problem in\nH E Dudeney\n's book\nThe Canterbury puzzles and other curious problems\n(1931)\nabout decomposing a rectangle\nR\nR\nR\ninto squares. A squaring of order\nn\nn\nn\nof\nR\nR\nR\nis a decomposition of the rectangle into\nn\nn\nn\nnon-overlapping squares. If the squares are all unequal, the squaring is called perfect, and in this case\nR\nR\nR\nis called a perfect rectangle.\nDehn\nhad studied the squaring problem in\n1903\nand proved that a rectangle can be squared if and only if its sides are commensurable and that if it can be squared then there are infinitely many perfect squarings. In the paper which Tutte and his three friends published in the\nDuke Mathematical Journal\nin\n1940\nthey associated a graph with a squaring and by looking at the flow of an electrical current through the graph reproved\nDehn\n's theorems and proved many new ones.\nAt this stage World War II had started and Tutte was engaged in research in chemistry at Cambridge. His tutor realised that his mathematical skills would make him a valuable person to undertake work on deciphering codes at Bletchley Park and, in January\n1941\n, he started work there. His achievements at Bletchley Park were described in the citation when he was inducted as Officer of the Order of Canada in October\n2001\n:-\nAs a young mathematician and codebreaker, he deciphered a series of German military encryption codes known as FISH. This has been described as one of the greatest intellectual feats of World War II.\nAlthough this work was for many years covered by the Official Secrets Act, Tutte felt able to talk about it at his\n80\nth\nbirthday celebrations in\n1997\n. In the following year he gave the lecture \"FISH and I\", which is reproduced in\n[\n8\n]\n, giving a fascinating account. We should perhaps give some more details of this important work.\nThe first FISH messages available to those in Bletchley Park for deciphering had been transmitted by the German Army in\n1941\nin Athens intended to be picked up in Vienna. On\n30\nAugust\n1941\nan error was made by a German radio operator who transmitted two long coded messages twice. Both were encoded using the same initial\n12\nletter code indicator, but the second message corrected punctuation in the first. Using these two messages Tutte was able to deduce the structure of the machine sending the message after four months of intense work.\nBy examining patterns in the characters, Tutte deduced that the machine sending the message had one wheel with\n41\nsprockets, and a second wheel with\n31\nsprockets. Working with others he finally discovered that the machine had\n12\nwheels and they determined how they were connected. Having worked out the structure of the encoding machine purely from the messages, a seemingly impossibly difficult task, Tutte set about writing algorithms decode FISH messages. In\n1943\nthe sophistication of the coding was increased and hand decoding using Tutte's algorithms became too hard. A computer called Colossus was built to run Tutte's decoding algorithms and their success played a vital role towards the end of the war. Rather strangely, although many such as\nTuring\nwere honoured for their contributions at Bletchley Park, Tutte never received similar honours.\nAt the end of World War II Tutte returned to Cambridge, but not now to complete a doctorate in chemistry but rather to study for his doctorate in mathematics. Despite having no formal qualifications at this stage, Trinity College elected Tutte to a Research Fellowship in Mathematics. He worked on algebra and graph theory, combining the two to produce his first outstanding contribution to matroid theory. It had been\nWhitney\nwho had introduced the idea of a matroid in a paper in the\nAmerican Journal of Mathematics\nin\n1935\n. Tutte was soon publishing papers on many different aspects of graph theory.\nIn\n1946\nhe published\nOn Hamiltonian circuits\n, and in the following year the two papers\nA family of cubical graphs\nand\nA ring in graph theory\n. Tutte's paper\nThe dissection of equilateral triangles into equilateral triangles\n(1948)\nfollows a similar theme to his first mathematics paper on squaring rectangles. In the same year he published a paper on perhaps the most famous of all graph theory problems\nOn the four-colour conjecture\n. Donald\nCoxeter\nat the University of Toronto had reviewed some of these papers and was certainly fully aware of Tutte's remarkable potential. After the award of his doctorate in\n1948\nCoxeter\ninvited Tutte to take up a post at the University of Toronto. In the following year Tutte married Dorothea Mitchell; they had no children.\nTutte remained at Toronto until\n1962\nwhen he joined the faculty at the University of Waterloo. The university was only five years old when he was appointed and he soon stamped his personality on mathematics with the university creating the Department of Combinatorics and Optimisation. Bill and Dorothea moved to a home in West Montrose, along the Grand River, where Tutte continued to live after his retirement in\n1984\nuntil the death of his wife\n1994\n. Bill Cunningham and Daniel Younger, in nominating Tutte for a major award in\n2001\n, wrote of his time at Waterloo:-\nHe has contributed greatly to creating its character and establishing its reputation in combinatorial mathematics. He was an important ingredient in the recipe that produced the Faculty of Mathematics in\n1967\n. He was named Honorary Director of the Centre for Cryptographic Research in\n1998\n.\nTutte wrote many outstanding papers\n(\nMathematical Reviews lists\n168\npapers by Tutte\n)\nand books. Among his books are:\nConnectivity in graphs\npublished in\n1966\n;\nIntroduction to the theory of matroids\n(1971)\n, based on a series of lectures given by Tutte at the Rand Corporation in\n1965\n;\nGraph Theory\n(1984)\n; and\nGraph Theory as I Have Known It\n(1998)\nwhich gives a fascinating account of how he discovered his many fundamental results.\nThe pace at which graph theory developed was quite remarkable so that when Tutte wrote\nConnectivity in graphs\nin\n1966\nhe stated in the preface:-\nGraph theory is now too extensive a subject for adequate presentation in a book of this size. Faced with the alternatives of writing a shallow survey of the greater part of graph theory or of giving a reasonably deep account of a small part, I have chosen the latter.\nIn fact he chose to cover results from the general theory of undirected graphs such as Euler paths, the symmetry of graphs, the girth, and results on non-separability and triple connection.\nIn\n1984\nTutte published\nGraph Theory\nwhich contains a foreword written by\nC St J A Nash-Williams\n:-\nIt is both fitting and fortunate that the volume on graph theory in the Encyclopedia of Mathematics and its Applications has an author whose contributions to graph theory are - in the opinion of many - unequalled. Indeed, the style and content of the book betray throughout the influence of Professor Tutte's own work and the distinctive flavour of his personal approach to the subject. ...\n[\nT\n]\nhis is by no means 'just another book on graph theory', since the treatment of\n[\nmany of the central themes of graph theory\n]\nis unified into a coherent whole by Professor Tutte's highly individual approach. Moreover, the more customary topics are leavened with some 'pleasant surprises', such as the author's attractive theory of decomposition of graphs into\n3\n-connected '\n3\n-blocks', an interesting and remarkable approach to electrical networks, and - perhaps particularly - the classification theorem for closed surfaces.\nTutte has received many high honours for his work. We mentioned above that he received the Order of Canada and prior to that he was elected a Fellow of the\nRoyal Society of Canada\n, and a Fellow of the\nRoyal Society of London\n. In\n2001\nTutte received the $\n5\n,\n000\nprize from the Centre de recherches mathématiques in Montreal and the\nFields\nInstitute for Research in Mathematical Sciences in Toronto. The citation described him as:-\n... the leading world figure in graph and matroid theories. In graph theory he established fundamental results for matching, connectivity, symmetry in graphs, reconstruction, colouring, Hamiltonian circuits, graphs on higher surfaces, graph enumeration and graph polynomials. In matroid theory, he is the single most important pioneer. One deep result is his characterization of regular matroids in terms of excluded minors. Another is his characterization of graphic matroids. These have provided the foundation for substantial structural work in this area.\nAs to Tutte's character Norman Biggs writes in\n[\n3\n]\nthat he was:-\n... a very shy man\n[\nwith a\n]\nplacid temperament...\nHe also tells us that:-\nHis wife would bemoan the fact that weekends had to be spent on research, because Bill feared that mathematical inspiration would dry up before he was\n40\n(\nat least, that's what he told her\n)\n.\nIn his quiet way he enjoyed the recognition that accompanied the growth in popularity and status of graph theory, the subject he had built. Outstanding mathematicians were attracted to work in this field, many of them inspired by Tutte's earlier results. It was proper that his\n80\nth\nbirthday should be marked by a celebration in Waterloo, where he was able to talk about his work to an audience that fully appreciated what he had achieved.\nIn\n1996\n, he moved back to his home town of Newmarket, Suffolk, England, but returned to Waterloo, Canada, in\n2000\n."
}