{
  "nome_completo": "William Stirling Hamilton",
  "nome_curto": "William Hamilton",
  "ano_nascimento": "1788",
  "ano_morte": "1856",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hamilton_William/",
  "lugar_nascimento": "Glasgow, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "William Hamilton\n's mother was Elizabeth Stirling and his father, the professor of anatomy in the University of Glasgow, was named William Hamilton. William, the subject of this biography, was one year older than his brother Thomas, and in\n1790\nWilliam Hamilton senior died and Elizabeth had to bring up the two young boys on her own. She\n[\n2\n]\n:-\n... was entirely equal to the task; there is no evidence that the family ever felt either financial anxiety or the absence of a father's hand.\nWilliam was educated at a variety of Scottish and English schools before entering the University of Glasgow when he was\n12\nyears old to study Greek and Latin. At this time the Scottish Universities competed with the schools for the most able pupils so it is not surprising that he entered university at such a young age. He continued to study logic and moral philosophy at Glasgow before entering the University of Edinburgh in\n1806\nto study medicine.\nIn\n1807\n, having been award a Snell exhibition, Hamilton matriculated in Balliol College, Oxford. Veitch reports that in\n1810\nhis\n[\n6\n]\n:-\n... examiners were so astonished at his erudition that they kept a list of what they had examined him on.\nHe was awarded a B.A. in\n1811\nbut he did not receive a fellowship, and returned to Edinburgh. Others who appeared much less able received fellowships and his friends blamed his lack of success on the unpopularity of Scots at Oxford. Ryan, however, suggests that in fact it may not have been racial discrimination but rather\n[\n2\n]\n:-\n... on the personal side, Hamilton was aggressive and opinionated in discussion, and in a university that took the literary qualities of the classics more seriously than their philosophical qualities, his erudition may have seemed more awkward than attractive.\nBack in Edinburgh Hamilton joined the legal profession becoming an advocate. It was not a profession which allowed him to use his talents, and in other respects he lacked the talents which would have brought him success as an advocate since he was a poor public speaker. He became the\n9\nth\nBaronet of Preston and Fingalton after a law suit in\n1816\n. From this time on he dropped his middle name of Stirling and called himself Sir William Hamilton of Preston and Fingalton, baronet.\nIn\n1821\nHamilton was appointed professor of civil history at Edinburgh University but from\n1829\nhe began to become known as a philosopher when he published an article in the\nEdinburgh Review\nwhich discussed Kant's ideas. Further philosophical articles in the\nEdinburgh Review\non topics such as the philosophy of the conditioned, perception, and logic enhanced his reputation. In\n1836\nHamilton became professor of logic and\nmetaphysics\nat the University of Edinburgh, giving his inaugural lecture on\n21\nNovember. Hamilton was one of the first in a series of British logicians to create the algebra of logic and introduced the 'quantification of the predicate'.\nBoole\n,\nDe Morgan\nand\nVenn\nfollowed him, but Hamilton helped begin this development and his work, although not of great depth, influenced\nBoole\nto produce a much more sophisticated system. Sadly, however, Hamilton claimed that\nDe Morgan\nwas guilty of plagiarism which was a ridiculous suggestion.\nOne important aspect is that Hamilton stimulated an interest in metaphysics and introduced Kant and other German philosophers to the British public. His failings as a public speaker meant that his lecturing style was not particularly good. This is discussed in\n[\n2\n]\n:-\nHis lecturing habits were not calculated to improve his temper or sustain good health. He deferred the preparation of his text until the night before the lecture, and would frequently go to bed at dawn, leaving his wife to get the text ready for delivery. His strikingly handsome appearance, and an air of dignity and earnestness, made him an impressive lecturer, but reports on his lectures suggest that students were more puzzled than enlightened by them.\nAfter moving to Edinburgh, Hamilton's mother came from Glasgow to live with him in\n1815\n. A couple of years later Hamilton's cousin Janet Marshall joined him and his mother. This arrangement continued until January\n1827\nwhen Hamilton's mother died. The two were very close and Hamilton was deeply troubled by his mother's death. In March\n1828\nhe married his cousin Janet Marshall who acted both as a housekeeper and secretary. They had three sons and a daughter, Elizabeth Hamilton, who through her contribution to\nEncyclopaedia Britannica\nis the best known of the children. Hamilton had a stroke in\n1844\nwhich left him partially paralysed. His mind was as clear as ever but he had difficulty in walking and his speech and eyesight were affected. He continued working, however, although he now depended on his wife's help. After a bad fall in the autumn of\n1853\nhe became seriously ill but survived for another couple of years in a very weak condition."
}