{
  "nome_completo": "William Ferrel",
  "nome_curto": "William Ferrel",
  "ano_nascimento": "1817",
  "ano_morte": "1891",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Ferrel/",
  "lugar_nascimento": "Bedford (now Fulton) County, Pennsylvania, USA",
  "lugar_morte": "Martinsburg, West Virginia, USA",
  "biografia": "William Ferrel\n's father was Benjamin Ferrel who was a farmer and operated a sawmill, while his mother, whose maiden name was Miller but whose first name seems unknown, was the daughter of a farmer. William was the eldest of his parent's eight children, six boys and two girls. He was born on his parent's farm in a remote rural area of the Allegheny Mountains in Bedford county, which is in southern Pennsylvania in the United States. To the south of Bedford County was Maryland and in\n1829\nthe Ferrel family crossed this state into what today is West Virginia, but it was not in those times since West Virginia was only admitted to the Union in\n1863\nwhen it became the\n35\nth\nstate. There they farmed the land in Berkeley County.\nWilliam was a shy boy who kept to himself and did not mix with friends but worked hard on the family farm. His education was typical for the time in the rural community in which he lived. There was a schoolhouse with a single room in which all ages of children were educated, and William only received this primitive education during two winters. However he was keen on education and he made a number of difficult journeys to Martinsburg and Hagerstown in north-central Maryland where he bought science books which he read with enthusiasm. He educated himself sufficiently to become a school teacher.\nAn event which heightened Ferrel's scientific interests and encouraged him to pursue his education further was the partial eclipse of the sun which he witnessed in\n1832\n. His fascination with the event led him to discover for himself when eclipses might occur using only an almanac and a book on geography. He had achieved this by the time he was eighteen but at this stage he did not know even that the moon and planets described elliptical orbits. He wrote in his autobiography\n[\n7\n]\nthat only at the age of twenty did he learn of:-\n... the law of gravitation, and that the moon and planets move in elliptical orbits.\nIn\n1837\nFerrel was twenty-two years old and by that time he had saved enough money from his wages as a school teacher to allow him to finance his studies at college. He entered Marshall College in\n1839\n, founded four years earlier and named after the United States Supreme Court Chief Justice John Marshall, in Mercersburg, Pennsylvania.\n(\nIn\n1853\nthe College merged to become the present day Franklin and Marshall College.\n)\nFerrel studied at Marshall College for two years but by that time his savings were exhausted and he had to return to school teaching to make enough money to allow him to complete his studies. He taught for two years back at his home in West Virginia and again saved all he could to finance his further studies. He entered Bethany College in\n1842\n; it had been founded two years earlier in the Greater Wheeling area of West Virginia, so it had not been open when Ferrel began his studies for the first time. He graduated from Bethany College in\n1844\nat the first graduation ceremony held by the new College.\nAfter graduation Ferrel returned to school teaching but not to his home, rather he taught in Liberty in western Missouri from\n1844\nto\n1850\nand then in Allensville in Todd County, Kentucky, from\n1850\nto\n1854\n. It was while he was in Liberty around\n1850\nthat Ferrel came across the a copy of\nNewton\n's\nPrincipia\nwhich had been ordered by a resident of Liberty but then never collected. The particular edition had been published with additional papers on tides which had been presented to the French\nAcademy of Sciences\nin\n1740\nby\nDaniel Bernoulli\n,\nEuler\nand\nMaclaurin\n. Ferrel studied this work and began to form his own theories about tides. He sent to Philadelphia for a copy of\nBowditch\n's translation of\nLaplace\n's\nMécanique Céleste\nwhich he also studied. From these studies Ferrel concluded\n[\n7\n]\n:-\n... that the action of the moon and sun upon the tides must have a tendency to retard the earth's rotation on its axis.\nThis conclusion contradicted that which\nLaplace\nhad come to and Ferrel decided that\nLaplace\nhad made an error in neglecting second order terms. The theories that Ferrel put forward became his first scientific paper which was written at the age of\n36\nin\n1853\n.\nThe year after this first paper appeared in Benjamin Gould's\nAstronomical Journal\n, Ferrel moved to Nashville Tennessee where he set up his own school. Burstyn notes in\n[\n1\n]\nthat Nashville was:-\n... the first city in which he had ever lived.\nHe now had the opportunity to visit book shops and to have discussions with other scientists, something which had not been possible earlier. One particular friend was William Bowling who was a physician.\nIn\n1856\nFerrel published\nAn essay on the winds and currents of the ocean\nin the\nNashville Journal\n. With this paper he became the chief founder of the subject of geophysical fluid dynamics. In this work he proposed a model for the Earth's wind circulation in middle latitudes. His theory involved what is now known as a Ferrel cell in which air flows towards the pole and eastward near the earth's surface and towards the equator and westward at higher altitudes. The paper marked a major step forward in understanding atmospheric circulation even though in this work there was no mathematical justification. In fact despite being an important step forward, Ferrel's theory does not match up with precisely what happens in practice although it was the first theory to explain the westerly winds in the middle latitudes of both the northern and southern hemispheres.\nIn\n1857\nFerrel was offered a position on the staff of\nThe American Ephemeris and Nautical Almanac\n. It was not a post which he had applied for, indeed Ferrel never applied for any of the scientific positions which he held, but it was offered to him through Benjamin Gould who knew of Ferrel's abilities because of several papers which he had published by this time in the\nAstronomical Journal\n. Ferrel visited the staff of\nThe American Ephemeris and Nautical Almanac\nin Cambridge, Massachusetts in the spring of\n1857\n, was given certain work to undertake, then returned to his school in Nashville where he worked for another year. In the spring of\n1858\nhis school was taken over by his partner and Ferrel moved to take up his new post.\nIn\n1858\nhe published another important paper in the\nAstronomical Journal\nentitled\nThe influence of the Earth's rotation upon the relative motion of bodies near its surface\n. The law Ferrel proposed in this paper was, to quote from the paper itself:-\n... that if a body is moving in any direction, there is a force, arising from the earth's rotation, which always deflects it to the right in the northern hemisphere, and to the left in the southern hemisphere.\nThis law is now sometimes called Buys Ballot's law after the Dutch meteorologist Christoph H D Buys Ballot who gave the law independently of Ferrel but later acknowledged Ferrel's priority.\nFrom\n1858\nuntil\n1867\nFerrel was a resident of Cambridge, Massachusetts while he worked for\nThe American Ephemeris and Nautical Almanac\n. It was not a demanding job with the tasks he had to undertake being of a routine nature. However he was now close to Harvard University and he made use of its library and discussed his ideas with the mathematicians there such as\nBenjamin Peirce\n,\nSimon Newcomb\n, Asaph Hall, and J D Runkle who was the editor of the\nAmerican Mathematical Monthly\nin which Ferrel published a number of important articles.\nBenjamin Peirce\nlater joined the United States Coast and Geodetic Survey and he persuaded Ferrel to join him. Ferrel went to Washington to take up this new post on\n1\nJuly\n1867\n. In\n1874\nhe published his treatise\nTidal researches\nas an appendix to the Coast Survey Report for that year.\nWe have seen above how Ferrel's early work on tides sought to correct some problems which were in\nLaplace\n's treatment. When\nLaplace\nstudied the tides he had ignored fluid friction because no good mathematical treatment existed at that time. However\nNavier\n,\nStokes\n,\nPoisson\nand\nSaint-Venant\nhad developed a mathematical theory of fluid friction in the\n1840\ns.\nAiry\nhad assumed that the friction was proportional to the velocity and had developed results based on that assumption in\n1845\n. However this assumption is not realistic, but the realistic assumption that the friction is proportional to the square of the velocity produced non-linear equations which were much more difficult to treat. Ferrel became the first to treat the non-linear case successfully.\nAs well as research on tides Ferrel studied currents and storms, used tidal data to determine the mass of the moon, and he invented a machine to predict tidal maxima and minima. He presented his idea for such a machine to the Superintendent of the Coast and Geodetic Survey in early\n1880\n, giving both the theoretical basis for the working of the machine and details of how it could be constructed. A decision was taken quickly to construct the tide predicting machine according to Ferrel's specification but it required a high quality machinist to undertake the work and it was eighteen months later before such a person could be found. Before that, in August\n1880\n, he had lectured at the meeting of the American Association for the Advancement of Science in Boston on his tide predicting machine. With the construction still underway, Ferrel approached the Superintendent of the Coastal Survey on\n9\nAugust\n1882\nto offer his resignation so that he could take up a post with the United States Army Signal Service.\nThe Superintendent asked Ferrel if he would continue to supervise the work of construction of his tide predicting machine after leaving the employment of the Coast and Geodetic Survey and of course he agreed. The machine came into service in\n1883\nand was used to predict the tides published in the Coast and Geodetic Survey Tide Tables for\n1885\n. It remained in use for over\n25\nyears and, in response to a query in\n1891\n, it was stated that the machine was capable of performing the work of forty people carrying out hand calculations.\nOne might ask why he was moving to the United States Army Signal Service, but this is much more obvious when we realise that at the time it ran the national weather service, and that it became the U.S. Weather Bureau under civilian control in\n1891\n. After working for four years Ferrel retired at the age of seventy. Among his works published during the last ten years of his life were\nPopular Essays on the Movements of the Atmosphere\n(1882)\n,\nTemperature of the Atmosphere and the Earth's Surface\n(1884)\n,\nRecent Advances in Meteorology\n(1886)\n, and\nA Popular Treatise on the Winds\n(1889)\n.\nAfter retiring Ferrel, who had never married, moved to join his brother Jacob in Kansas City. He did not find this an enjoyable place to be for he did not find either the libraries or scientific friends that he longed for. It is also fair to say that despite his remarkable pioneering work in mathematical meteorology, by this time new theories had entered the subject and he found it hard to keep abreast. In\n1889\nhe returned to Martinsburg in West Virginia where he had enjoyed the thrill of finding science books when he was a young boy. He died there in the following year."
}