{
  "nome_completo": "William Kingdon Clifford",
  "nome_curto": "William Clifford",
  "ano_nascimento": "1845",
  "ano_morte": "1879",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clifford/",
  "lugar_nascimento": "Exeter, Devon, England",
  "lugar_morte": "Madeira Islands, Portugal",
  "biografia": "William Clifford\n's parents were William Clifford\n(1821\n-\n1878)\nand Fanny\n(\nFrances\n)\nKingdon\n(1821\n-\n1854)\n. William Clifford Sn., born in Bishops Stortford, Hertfordshire, was a book seller, mainly of religious material, but also a prominent citizen of Exeter being an Alderman and a Justice of the Peace. Fanny Kingdon was the daughter of Francis Wilmott Kingdon and Mary-Anne Bodley who was related to Sir Thomas Bodley\n(1545\n-\n1613)\n. Sir Thomas had been a lecturer in natural philosophy at Magdalen College, Oxford and a founder of the Bodleian Library. It is thought that William Clifford, the subject of this biography, inherited much of his genius from his mother. However, there was a down-side here for he also appears to have inherited poor physical health from his mother who died in\n1854\nat the age of\n35\n. Her son William was only nine years old at the time. His father remarried and had four more children with his second wife. William Sn. died quite young too, at the age of\n58\nin\n1878\n. William was brought up in Exeter where first he lived at\n9\nPark Place, in the house in which his mother had been born. He was certainly living there in\n1851\nbut later they moved to\n23\nHigh Street, Exeter.\nWilliam showed great promise at school where he won prizes in many different subjects. He studied at Exeter Grammar School for a few months before moving in\n1856\nto the Mansion House School in Exeter. This school was run by a Mr Templeton and in both\n1858\nand in the following year, Clifford sat the Cambridge University Local Examinations in a wide range of subjects, performing excellently in most of them. At age\n15\nhe won a Mathematical and Classical Scholarship to the Department of General Literature and Science at King's College, London, which he entered in\n1860\n. There he excelled in mathematics and also in classics, English literature and\n(\nperhaps unexpectedly\n)\nin gymnastics. In each of the three years he spent at King's College he won the Mathematical Scholarship and the Classical Scholarship. He also won the Divinity Prize in his first year and in subsequent years he won the Inglis Scholarship for English Language and the English Essay Prize. Clifford's first mathematics paper, written while he was at King's College, was\nThe Analogues of Pascal's Theorem\nand it was published in\nThe Quarterly Journal of Pure and Applied Mathematics\nin\n1863\n.\nA few days before he went up to Cambridge, in September\n1863\n, Clifford wrote the following letter which tells us much about him at age eighteen\n[\n26\n]\n:-\nI have been on a walking tour in the North of Devon, or I should have written long before. By to-morrow I hope to send you something, and will do what I can to follow out your kind suggestions; but I am a very junior reader myself. I have had in my mind almost from the time I began to fly kites\n(\nI have not yet left off\n)\nthe problem of finding the form of a kite-string under the action of the wind. On a rough trial the other day, the intrinsic equation seemed not very difficult to obtain; if I get at any result, I will send it you to-morrow. I have been trying to construct a second interpretation of mechanical equations, similar to that of tangential coordinates, but have failed hitherto. Being a firm believer in the duality of symbols, I should look upon complete failure as a proof that our symbolical system is wrong. You will be amused by my visionary attempt at obtaining a method of inventing problems by the dozen.\nWhen he was\n18\nyears old, in October\n1863\n, William entered Trinity College, Cambridge, having won a Foundation Scholarship to study mathematics and natural philosophy\n(\nphysics\n)\n. He won not only prizes for mathematics but also a prize for a speech he delivered on Sir Walter Raleigh. In\n1867\nhe was awarded a BA in Mathematics and Natural Philosophy after being Second\nWrangler\nand Smith's Prizemen in his final examinations\n(\nin common with many other famous mathematicians who were second at Cambridge like\nThomson\nand\nMaxwell\n)\n. These outstanding achievements must be set against a crisis in his Christian faith which he experienced while at Cambridge. Monty Chisholm writes\n[\n12\n]\n:-\nClifford's early High Church religious convictions and belief in Catholic theology were a natural result of his family background and teaching but, as discussions raged over the ideas propounded by Darwin in 'The Origin of Species', Clifford found his early formal Christian faith becoming eroded. Moreover, in his early years at Cambridge, he was influenced by the writings of the early proponent of evolutionary theory, Herbert Spencer, and he began his friendships with Thomas Huxley and John Tyndall. Very soon, he was acquiring a reputation as a vociferous and eloquent opponent of all priesthoods and dogmatic religions.\nAt that time all Cambridge students had to sign the Thirty-nine Articles of Protestant Faith each year affirming their allegiance to the Church of England. Clifford signed in\n1863\nand\n1864\n, but by the time he was required to sign in\n1865\nhe seriously doubted whether he could do so in good faith but, after worrying about the act, nevertheless did sign. However, when he was required to sign in\n1866\n, he refused. This should have brought his Cambridge career to an end but, surprisingly, things continued as normal and he was elected to a Fellowship at Trinity in\n1868\n. His successes had led to him being asked to give the speech at the Commemoration of Benefactors Ceremony in\n1867\n. The opening words of his address were:-\nThought is powerless except it makes something outside of itself: the thought which conquers the world is not contemplative but active. And it is this that I am asking you to worship today.\nThe ideas that he presented in this address he developed further and this became the lecture\nOn Some of the Conditions of Mental Development\ngiven to the Royal Institution in\n1868\nwhen he was only\n23\nyears old. In the lecture he tried to explain how scientific discovery comes about:-\nThere is no scientific discoverer, no poet, no painter, no musician, who will not tell you that he found ready made his discovery or poem or picture - that it came to him from outside, and that he did not consciously create it from within.\nFrederick Pollock, one of his undergraduate friends, gives further details of Clifford's time as an undergraduate in his Introduction to Clifford's\nLectures and Essays\n. See\nTHIS LINK\n.\nIn\n1870\nClifford was part of the English Eclipse Expedition which sailed to Italy to obtain scientific data from an eclipse. He had the unfortunate experience of being shipwrecked near Sicily, but he was fortunate to survive. For a detailed description of this Expedition, and particularly Clifford's contributions, see\nTHIS LINK\n.\nIn\n1871\nClifford was appointed to the chair of Mathematics and Mechanics at University College, London. We note that, given the fact that he had turned against Christianity, University College was the ideal place for him since, unlike Cambridge, University College did not require any religious commitment. In\n1874\nhe was elected a Fellow of the\nRoyal Society\n. He was also an enthusiastic member of the\nLondon Mathematical Society\nwhich held its meetings at University College. The year\n1874\nwas the one in which he met Sophia Lucy Jane Lane\n(2\nAugust\n1846\n-\n21\nApril\n1929)\n, the daughter of John Lane. They were married on\n7\nApril\n1875\nand lived in a modest home on Colville Road, London. The philosopher Edward Clodd wrote in his book\nMemories\n:-\nAt the Clifford's you were sure to meet someone worth the knowing. There was no Smart Set to fill their empty time and waste yours in inane gossip; no prigs to irritate you with their affectation; no pedants to bore you with their academic vagueness, but just a company of men and women who wanted to meet one another and have a full and free talk.\nWilliam and Lucy Clifford had two daughters, Ellen Clifford and Alice Margaret Clifford. After Clifford's death, Lucy went on to write ten novels, seven collections of short stories and many plays and articles. The novels were controversial but most sold well. Her first novel\nMrs Keith's Crime\nwas voted book of the year in\n1885\n.\nLet us now look briefly at Clifford's mathematical contributions. Despite his short life - he died aged\n33\n- he wrote around\n50\npapers. Influenced by the work of\nRiemann\nand\nLobachevsky\n, Clifford studied non-euclidean geometry. In\n1870\nhe wrote\nOn the space theory of matter\nin which he argued that energy and matter are simply different types of curvature of space. In this work he presents ideas which were to form a fundamental role in\nEinstein\n's general theory of relativity. However, he only pointed out that such an approach was possible but he did not carry the project as far as working out details. Also in unpublished notes he described the importance of connecting apparently unrelated phenomena\n(\nsee\n[\n10\n]\n)\n:-\nImportance of establishing connections between different branches of scientific enquiry; such steps are of the nature of revolutions in science. Example in gravitation which connected together very various phenomena. Appearances indicate that present state of science is on the eve of such a revolution, which will connect together physical properties of gases, liquids and solids, laws of chemical combination, electromagnetic phenomena, and the theory of light. ... What is pointed to is therefore a connection between kinetic theory and undulatory theory.\nThere is so little detail in these random thoughts that it is possible to see them as predicting several important scientific advances of the\n20\nth\ncentury. Given Clifford's brilliant and unconventional thinking, this is not impossible. Clifford generalised the\nquaternions\n(\nintroduced by\nHamilton\ntwo years before Clifford's birth\n)\nto what he called the biquaternions in his paper\nPreliminary Sketch of Biquaternions\n(1873)\nand he used them to study motion in non-euclidean spaces and on certain surfaces. These are now known as 'Clifford-\nKlein\nspaces'. He showed that spaces of constant curvature could have several different topological structures. Clifford also proved that a\nRiemann\nsurface is topologically equivalent to a box with holes in it. He introduced Clifford algebras in his paper\nApplications of Grassmann's extensive algebra\n(1878)\n. Note that here we have examples of Clifford unifying ideas in mathematics.\nAs a teacher Clifford's reputation was outstanding. A student, having problems with\nIvory\n's theorem on the attraction of an ellipsoid, describes Clifford's response to his questions:-\nWithout any diagram or symbolic aid he described the geometrical conditions on which the solution depended, and they seemed to stand out visibly in space. There were no longer consequences to be deduced, but real and evident facts which only required to be seen.\nNot only was Clifford a highly original teacher and researcher, he was also a philosopher of science. He coined the phrase 'mind-stuff' for the elements from which conscience is composed in his article\nOn the Nature of Things-in-Themselves\n(1878)\n. We quote from this article\n[\n15\n]\n:-\nThat element of which, as we have seen, even the simplest feeling is a complex, I shall call Mind-stuff. A moving molecule of inorganic matter does not possess mind or consciousness; but it possesses a small piece of mind-stuff. When molecules are so combined together as to form the film on the under side of a jelly-fish, the elements of mind-stuff which go along with them are so combined as to form the faint beginnings of Sentience. When the molecules are so combined as to form the brain and nervous system of a vertebrate, the corresponding elements of mind-stuff are so combined as to form some kind of consciousness; that is to say, changes in the complex which take place at the same time get so linked together that the repetition of one implies the repetition of the other. When matter takes the complex form of a living human brain, the corresponding mind-stuff takes the form of a human consciousness, having intelligence and volition.\nClifford delivered the lecture\nRight and wrong: the scientific ground of their distinction\nwhen he addressed the 'Sunday Lecture Society' on the afternoon of Sunday\n7\nNovember\n1876\n. He advertised the lecture with a description that began as follows\n[\n4\n]\n:-\nWe feel that it is wrong to steal or tell lies, and right to take care of our families; and that we are responsible for our actions. The aggregate of such feelings we call Conscience, or the Moral Sense. In this lecture it is proposed to consider what account can be given of these facts by the scientific method. This is a method of getting knowledge by inference; first of phenomena from phenomena on the assumption of uniformity of nature, and secondly of mental facts simultaneous with and underlying these phenomena, on the assumption that other men have feelings like mine. Each of these assumptions rests on a moral basis; it is our duty to guide our beliefs in this way.\nWe have already seen that Clifford was a remarkable man in many ways. Let us look a little more at his character.\nMacfarlane\n[\n18\n]\ntells us that:-\n... he was eccentric in appearance, habits and opinions.\nMonty Chisholm writes\n[\n12\n]\n:-\nClifford was a most attractive companion. He loved company and parties and dancing. He wrote fairy tales and told jokes.\nA description of him by a fellow undergraduate is interesting:-\nHis neatness and dexterity were unusually great, but the most remarkable thing was his great strength as compared with his weight, as shown in some exercises. At one time he would pull up on the bar with either hand, which is well known to be one of the greatest feats of strength.\nHe shared with\nCharles Dodgson\nthe pleasure of entertaining children. Although he never rivalled\nDodgson\n's Lewis Carroll books in success, Clifford wrote\nThe Little People\n, a collection of fairy stories written to amuse children. He greatly enjoyed going to children's parties and thinking up some new idea to amuse the children.\nIn\n1876\nClifford suffered a physical collapse. This was certainly made worse by overwork if not completely caused by it. He would spend the day with teaching and administrative duties, then spend all night at his research. Six months spent in Algeria and Spain allowed him to recover sufficiently to resume his duties for\n18\nmonths but, perhaps inevitably, he again collapsed. A period spent in Mediterranean countries did little for his health and after a couple of months back in England in late\n1878\nhe left for Madeira. The hoped-for recovery never materialised and he died a few months later.\nThe title page of his collected works contains the quote first made by\nNewton\nspeaking of\nCotes\n:-\nIf he had lived we might have known something.\nMost of his work was in fact published after his death. Volume\n1\nof the two volume work\nElements of dynamics\nwas published in\n1878\n, the second volume appearing after his death.\nLectures and essays\nand\nSeeing and thinking\nwere published in\n1879\n.\nCommon sense of the exact sciences\nwas completed by\nKarl Pearson\nand published in\n1885\n. Extracts from reviews of\nLectures and essays\nand\nCommon sense of the exact sciences\nare given at\nTHIS LINK\n.\nAn extract from\nKarl Pearson\n's Introduction to Clifford's\nCommon sense of the exact sciences\nis given at\nTHIS LINK\n.\nLet us leave the final words about Clifford to his wife Lucy. When approached in\n1913\nabout an entry for Clifford in the\nDictionary of National Biograph\ny, Lucy Clifford replied:-\nIf you can say a few more words about my husband I would love it - how brilliant he was, how witty and what an adorable nature he had: he was so gay and simple and light-hearted, and had an indescribable charm. ... At the time of his death he was said to be the third mathematician in Europe,\nCayley\nand\nSylvester\nbeing the two first. He was the most brilliant Fellow of Trinity of his day; the youngest fellow of the\nRoyal Society\n. There was nothing that he couldn't have done or wouldn't have done if he had lived, for there was no side of life that did not appeal to him. I love what you say about my house being one of the Meccas of Literature. But you should have come here in his time, people of every rank and of every shade of thought came, and no matter how little they agreed with him, they were always hypnotised for the hour: for one thing he had such wonderful dark-lashed blue eyes and a wonderful soul seemed to be looking out of them.\nSeveral events have been organised to honour Clifford's memory. One was organised in\n1995\nto celebrate the\n150\nth\nanniversary of Clifford's birth:-\nOn the occasion of the\n150\nth\nanniversary of William Clifford's birth, the William and Lucy Clifford Research Group is hosting a one day meeting on Saturday\n6\nMay\n1995\n, at Rutherford College, University of Kent, in honour of the Cliffords. A biographical commentary on William and Lucy will be interspersed with specialist contributions from eminent academics on topical mathematical, scientific, philosophical and literary subjects including the relationship between geometry and physics, the Darwinian controversy over science and religion, and mathematical and scientific education."
}