{
  "nome_completo": "William Andrew Coppel",
  "nome_curto": "William Coppel",
  "ano_nascimento": "1930",
  "ano_morte": "2023",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Coppel/",
  "lugar_nascimento": "Melbourne, Australia",
  "lugar_morte": "Melbourne, Australia",
  "biografia": "Andrew Coppel\nwas the second of three sons to Dr Elias Godfrey \"Bill\" Coppel\n[\n1\n]\nand Marjorie Coppel\n(\nnée Service\n)\n[\n2\n]\n.\nDetails of his early life are available from his autobiography at\nTHIS LINK\n.\nIn September\n1954\nCoppel married Maria Antonietta Gerard\n(1923\n-\n2009)\n, an Italian from Verona whom he had met at Cambridge.  She was learning English and he knew little Italian, although his prowess in Latin\n(\nwhere he had matriculated as top of the state of Victoria\n)\ncertainly helped him soon to learn: German was initially their\nlingua franca\n.  They married in her family church at villa San Leonardo in Verona. Coppel was an avowed agnostic and she a devout Roman Catholic: mutually respectful positions they retained throughout their married life.  In\n1955\nthe first of their four sons\n(\nStephen\n)\nwas born in Luton, where Coppel was doing his National Service with the English Electric Company.  After he moved to Birkbeck, two further sons were born in London\n(\nNicholas in\n1958\nand Philip in\n1960)\n.  In\n1963\n, after moving to the Australian National University in Canberra, his fourth son\n(\nJonathan\n)\nwas born.\nCoppel's position at the ANU enjoyed a generous sabbatical allowance.  His family accompanied him in his extended periods in Madison, Toronto, Warwick and Minneapolis.  All four sons graduated from the Australian National University: none showed any inclination towards mathematics.  Stephen studied history and worked as a print curator at the National Gallery of Australia, and later for over\n30\nyears at the British Museum as Assistant Keeper in the Department of Prints and Drawings where he became responsible for the modern collection.  Nicholas studied economics, entered the diplomatic service and held posts in Washington DC, Manila, Port Moresby, Honiara and finally as Australian Ambassador to Myanmar.  Philip studied law, worked as a lawyer in Canberra before moving to London where he qualified as a barrister and became a King's Counsel.  Jonathan studied economics, worked as an economist at the Australian Treasury, the Reserve Bank of Australia, the Organisation for Economic Cooperation and Development in Paris, and as a Commissioner at the Australian Productivity Commission.\nA list of Coppel's publications is available at\nTHIS LINK\nand information about his books is available at\nTHIS LINK\n.\nFollowing the death of Antonietta in\n2009\n, Coppel purchased a cookbook.  Dutifully following the contents of a few of its pages, culinary genius was replaced with something simpler.  In\n2012\n, after\n50\nyears in the same house in Canberra, Coppel sold up and returned to his city of birth, Melbourne. There he found an apartment within a short distance of his surviving brother\n(\nCharles\n)\nand the Italian quarter\n(\nCarlton\n)\n.  Around the same time, upon his being appointed Commissioner, Jonathan moved nearby.  Upon his retirement from the diplomatic service, Nicholas moved to within walking distance. Surrounded by the things he loved, Coppel contented himself with his life-long interests of foreign films, walking, word puzzles and reading, particularly autobiographies and personal travel accounts. His appetite for mathematical works remained undiminished.  Deteriorating hearing frustrated his other great love  listening to music, particularly that of Mozart.\nA man of few words, those that did emerge were chosen with care.  Self-contained and uninterested in accolade, Coppel did not suffer pretentiousness or take much notice of title. The nameplate on his university door was simply 'Mr' not 'Professor'.  His taciturnity could be confused with aloofness.  It concealed sincerity and made unexpected his idiosyncratic generosity.  In his last two years and following a fall, his mobility was reduced.  He withdrew into himself, confining his company to his immediate family and passing the time absorbed in MacTutor's accounts of the lives of other mathematicians."
}