{
  "nome_completo": "Wolfgang M Schmidt",
  "nome_curto": "Wolfgang Schmidt",
  "ano_nascimento": "1933",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schmidt_Wolfgang/",
  "lugar_nascimento": "Vienna, Austria",
  "lugar_morte": null,
  "biografia": "Wolfgang Schmidt\n's parents were both secondary school teachers, his father teaching mathematics and physics, and his mother teaching German and French. Wolfgang has a sister Dietlinde who married the mathematician Wilfried Nöbauer\n(1928\n-\n1988)\non\n9\nDecember\n1958\n. Wolfgang attended schools in Vienna and by the time he was in the\n3\nrd grade of \"Middle School\" his favourite subjects were mathematics and physics. He graduated from school in\n1951\nand later in that year began his studies at the University of Vienna.\nAt the University of Vienna, Schmidt specialised in mathematics and physics. He was taught analysis and number theory by\nEdmund Hlawka\n, functional analysis and measure theory by\nJohann Radon\n, and algebra by Nikolaus Hofreiter\n(1904\n-\n1990)\n. He also attended lectures on probability theory by Leopold Schmetterer and on the distribution of prime numbers by Karl Pracher\n(1924\n-\n1994)\n. Given this impressive collection of lecturers, it is not surprising that Schmidt should become interested in number theory.\nLet us say a little about his lecturers.\nEdmund Hlawka\nwas a number theorist who had been taught at the University of Vienna by Nikolaus Hofreiter and, in fact, Hofreiter had been his thesis advisor. Hofreiter had himself studied at the University of Vienna where his thesis advisor had been\nPhilipp Furtwängler\n. While Schmidt was a student,\nJohann Radon\n, in addition to lecturing, served as dean during\n1951\n-\n52\nand rector in\n1954\n. Karl Prachar was also a number theorist who had studied for his doctorate at the University of Vienna advised by\nHlawka\n, and he is famed for his comprehensive treatise covering most aspects of the theory of the distribution of primes, namely\nPrimzahlverteilung\nⓉ\n(\nThe distribution of prime numbers\n)\n(1957)\n.\nSchmidt undertook research at the University of Vienna and was awarded a doctorate in\n1955\nfor his thesis on the geometry of numbers\nÜber höhere kritische Determinanten von Sternkörpern\nⓉ\n(\nOn higher critical determinants of stellar bodies\n)\n. In his thesis he made considerable progress towards verifying a conjecture made by\nAmbrose Rogers\nin his paper\nThe number of lattice points in a star body\n(1951)\n. His thesis was exceptional and\nJ W S Cassels\ndevoted a whole chapter in his classic monograph \"An Introduction to the Geometry of Numbers\"\n(1959)\nto explain the results Schmidt had obtained. Schmidt published his thesis in a paper with the same title as the thesis, in which he wrote:-\nThe present work owes its development and support to my revered teacher, Prof Dr\nE Hlawka\n.\nSchmidt's next paper was\nEine neue Abschätzung der kritischen Determinante von Sternkörpern\nⓉ\n(\nA new estimate of the critical determinant of stellar bodies\n)\n(1956)\n. In this paper Schmidt improved a bound given by the\nMinkowski\n-\nHlawka\ntheorem\n(\nsee\nE Hlawka\n,\nZur Geometrie der Zahlen\nⓉ\n(\nThe geometry of the numbers\n)\n(1943))\n. These two papers by Schmidt are the first of\n202\npublications listed in MathSciNet\n(\nwhen consulted in December\n2019)\n.\nAfter graduating, Schmidt continued to undertake research at the University of Vienna first as a research assistant and then as a librarian at the Mathematical Institute. He began making research visits to the University of Montana at Missoula in the United States and, for example, his paper\nMittelwerte über Gitter\nⓉ\n(\nAverages over grids\n)\nsubmitted on\n13\nFebruary\n1957\nhas a Missoula, Montana, address while his paper\nOn the convergence of mean values over lattices\nsubmitted on\n29\nJanuary\n1957\nhas a Montana State University address. By\n23\nDecember\n1957\n, when he submitted\nMittelwerte über Gitter II\nⓉ\n(\nAverages over grids II\n)\n, he gave a Vienna address. By June\n1959\n, when he submitted\nOn normal numbers\n, he was back at Montana State University. Schmidt\nhabilitated\nat the University of Vienna in\n1960\n, submitting his habilitation thesis\nMaßtheorie in der Geometrie der Zahlen\nⓉ\n(\nMeasure theory in the geometry of numbers\n)\n.\nWhen in Missoula, Montana, Schmidt met Patricia C Meyer, the daughter of Urban Joseph Meyer\n(1899\n-\n1945)\nand Caroline Weinzierl\n(1903\n-\n1932)\n. Patricia\n(\nknown as Pat\n)\nhad been born in St Marys, Elk, Pennsylvania on\n2\nDecember\n1929\nbut, following the death of her mother from polio when she was two years old, she and her sisters Helen and Martha had been brought up by relatives. After graduating from St Marys Catholic High School, Pat had moved to Alaska where she had worked as a medical secretary at Mt Edgecumbe Hospital in Sitka. She then moved to Missoula, Montana, where she met Wolfgang Schmidt. Wolfgang and Pat were married on\n2\nJuly\n1960\nin Vienna, Austria.\nFrom\n1960\nto\n1965\nSchmidt spent time at the University of Vienna, at the University of Colorado in Boulder, USA and Columbia University, New York, USA. For example his paper\nBounds for certain sums; a remark on a conjecture of Mahler\n, submitted in January\n1961\nhad the University of Colorado address while the address on his paper\nÜber die Normalität von Zahlen zu verschiedenen Basen\nⓉ\n(\nAbout the normality of numbers on different bases,\n)\n,  submitted in November\n1961\n, is Columbia University in New York, USA. After moving back to Vienna, Wolfgang and Pat's two sons Michael and Johannes were born. In\n1965\nSchmidt became a professor at the University of Colorado in Boulder, a position he held until he retired in\n2001\n.\nSchmidt was a visiting member of the Institute for Advanced Study at Princeton on two occasions. The first was from September\n1970\nto June\n1971\nwhile the second was from September\n1985\nto April\n1986\n.\nIn\n1972\nSchmidt was awarded the\nCole\nPrize in Number Theory by the\nAmerican Mathematical Society\n:-\n... for the following papers: \"On simultaneous approximation of two algebraic numbers by rationals\n(1967)\n\", \"T-numbers do exist\n(1970)\n\", \"Simultaneous approximation to algebraic numbers by rationals\n(1970)\n\" and \"On Mahler's T-numbers\n(1971)\n\".\nHans Peter Schlickewei writes\n[\n6\n]\n:-\nIn view of his origins from\nEdmund Hlawka\n's Vienna school of mathematics it seems to be quite natural that a topic of recurrent interest in Schmidt's scientific activities have been problems from the theory of uniform distribution.\nThis topic forms the main part of Schmidt's book\nLectures on irregularities of distribution\n(1977)\nbased on lectures he gave at the Tata Institute of Fundamental Research, Bombay, in the autumn of\n1972\n.\nFor extracts from reviews and prefaces of eight of Schmidt's books, see\nTHIS LINK\n.\nTo obtain an overview of the topics that Schmidt worked on, a look at the information about his books is informative. In addition we list here the\n14\nsections in\n[\n6\n]\n: Geometry of numbers; Uniform distribution; Approximation of real numbers; Heights; Approximation of algebraic numbers by rationals; Norm form equations; Transcendental numbers;\nRiemann\nhypothesis for curves; Nonlinear approximation of real numbers; Zeros and small values of forms; Quadratic geometry of numbers; Approximation of algebraic numbers - quantitative results; Norm form equations - quantitative results; and Linear recurrence sequences.\nSchmidt is among only four number theorists who have been invited to address the International Congress of Mathematicians three times. At the\n1974\nCongress in Vancouver he gave a plenary address entitled\nApplications of Time's Method in Various Branches of Number Theory\n; at the\n1970\nCongress in Nice he gave the invited lecture\nSome recent progress in Diophantine approximations\n; and at the\n1983\nCongress in Warsaw he gave the invited lecture\nAnalytic methods for congruences, Diophantine equations and approximations\n.\nIn the\n1970\nlecture he ended his introduction with the words:-\nLast winter I was able to extend\nRoth\n's famous theorem on rational approximation to an algebraic irrational to simultaneous approximations. I hope you will forgive me if I devote the rest of this lecture to this subject; I had not anticipated this result when I gave the title of my talk in the fall of\n1969\n.\nHe began his\n1983\nlecture with the words:-\nOur present methods for estimating the number of solutions of congruences, equations and inequalities have a number of common features. In particular, these methods involve exponential sums.\nOn Wednesday\n15\nJuly\n2015\n, Schmidt was awarded an honorary degree by the University of York. The Presentation address by Professor Sanju Velani is given in\n[\n5\n]\n:-\nVice-Chancellor,\nIt is a great honour, as well as a great pleasure, to present to you Wolfgang Schmidt, Distinguished Professor Emeritus of Mathematics at the University of Colorado in Boulder. One of the most gifted, creative and influential mathematicians today, he has made profound and far-reaching contributions to number theory.\nProfessor Schmidt was born in Vienna where he also received his early education. He studied Mathematics and Physics as an undergraduate and in\n1955\nobtained his PhD from the University of Vienna. His doctoral work was so revolutionary that a chapter was dedicated to its exposition in\nJ W S Cassels\n', now classic, monograph \"An Introduction to the Geometry of Numbers\" published in\n1959\n. He took up his Chair at the University of Colorado, Boulder in\n1960\n, just five years after completing his PhD. He has remained there for his entire career not least because of an abiding passion for hiking and skiing. The mountains and snow conditions in Colorado are unrivalled! He has climbed all of the peaks in Colorado of\n14\n,\n000\nfeet or more.\nSince his PhD, exactly six decades ago, he has published over\n200\nresearch articles, many of them containing spectacular results and breakthroughs in various branches of number theory: Diophantine approximation, geometry of numbers, uniform distribution and normality. Most mathematicians would be happy with fifty in a lifetime! Even more outstanding is the fact that in this century alone, when he was past the age at which most of us would consider retiring, he has published\n33\narticles, some solving a longstanding open problem on recurrence sequences and some developing the new theory of \"parametric' geometry of numbers. In short, Professor Schmidt continues to introduce novel ideas and techniques and produce work at the very highest level. He had told me that he is no longer quite the skier he once was, however.\nThree examples of his fantastic creativity and vision that are still influencing current research, in particular at York, are the celebrated Schmidt Subspace Theorem; the axiomatic formulation of Schmidt Games, and the unifying aspect of Regular Systems. Apart from solving important, long-standing problems, Professor Schmidt has been widely influential in formulating new and exciting programmes of research. His conjectures have attracted the attention of many world experts, including some located here. This makes it especially appropriate that the University of York recognises his enormous, enriching and beautiful contributions to mathematics by the award of an honorary doctorate. Some of you graduating here today will have come directly into contact with Professor Schmidt's work - two of his books are recommended texts for our fourth year number theory course. He is a strikingly clear thinker and writer.\nProfessor Schmidt has received many honours including the\nAmerican Mathematical Society\nCole Prize, the Humboldt Prize and a Guggenheim Fellowship. He is the only mathematician to date to have been awarded the Austrian Decoration for Science and Art and is one of only four mathematicians invited to address the International Congress of Mathematicians three times. In addition, he is a fellow of the\nNational Academy of Sciences\n, the\nPolish Academy of Sciences\nand the\nAmerican Mathematical Society\n.\nIn addition to the honours mentioned above, he received honorary degrees from the University of Ulm\n(1981)\n, the Sorbonne\n(1994)\n, the University of Waterloo and the University of Marburg\n(1999)\n. He was elected to the\nAmerican Academy of Arts and Sciences\nin\n1994\n.\nSchmidt's wife Pat died on\n26\nNovember\n2016\n. The following tribute is paid to her in\n[\n4\n]\n:-\nShe could laugh about almost any situation. She understood people and how to care for them. She made people happy, whether visiting scholars from all over the world or her beloved neighbours on Ithaca Drive. She volunteered for the homeless and causes for underprivileged populations. She was universally loved.\nLet us end this biography with the following quote from Martin Neuwirther who for a time was Schmidt's assistant\n[\n3\n]\n:-\nAlthough he restricted his studies primarily to the subject of number theory, his works have stimulated the evolution of several other branches of mathematics. For example, Schmidt developed the so-called theory of heights of polynomials. In the late\n1980\ns algebraic geometer\nBombieri\napplied Schmidt's results in order to prove effective assertions concerning the number of rational points of elliptic curves. This happened only a short time after\nGerd Faltings\nhad been awarded the\nFields\nMedal, which is the highest award for mathematicians, for his very complicated proof of the finiteness of the number of such points. With the help of Schmidt's theory.\nBombieri\ngot more - and in an even easier way. As his assistant, I got to know Wolfgang toward the end of my studies in Vienna, when I was working in a very different - nearly opposite - branch of mathematics. Therefore I was quite amazed when I realized that the Wolfgang Schmidt, whom I had encountered in the bibliography of many publications, turned out to be the famous 'geometer of numbers.' His way of giving lectures is very factual, which corresponds well with the subject he is talking about, yet the most elegant wit of a very great thinker often gratifies the audience. Even in his dissertation, after reading several pages of tricky, hard-to-imagine assessment of the derivation of a new result, one comes across his dry comment, \"After more precise consideration ... is capable of considerable improvement.\""
}