{
  "nome_completo": "Wolfgang Hahn",
  "nome_curto": "Wolfgang Hahn",
  "ano_nascimento": "1911",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hahn_Wolfgang/",
  "lugar_nascimento": "Potsdam, Germany",
  "lugar_morte": "Kassel, Germany",
  "biografia": "Wolfgang Hahn\n's father was a secondary school teacher. Wolfgang was only a young boy during the years of World War I,\n1914\n-\n1918\n, but he witnessed the major changes to German society in his school days following the end of the war. In his class were a number of Hohenzollern princes who, unlike Wolfgang, were not too bright. There is a nice story about one of these princes who, despite the best efforts of the mathematics teacher, could not understand a proof despite the teachers best efforts. Eventually the teacher said, \"But Imperial Highness, I give you my word of honour that the evidence is true.\" The prince replied, \"If only you had explained that in the first place.\"\nIn\n1928\nHahn graduated from the\nGymnasium\nat Potsdam and began his university studies of mathematics at the Friedrich-Wilhelm University in Berlin. There he was taught by some outstanding mathematicians including\nErhard Schmidt\n,\nIssai Schur\n,\nLudwig Bieberbach\n, and\nRobert Remak\n. Hahn attended\nSchur\n's seminar and\nRemak\nalso attended. However, Hahn said that\nRemak\nalways seemed to be asleep in the seminar but, despite this, he would suddenly appear to wake up and ask a highly relevant question or explain a difficult point with which others were struggling. Hahn also saw\nRemak\ngoing rowing on the river when he would shout to passers-by, \"Mathematicians are all crazy, we are all a little crazy.\"\nLike most German students at this time, Hahn did not spend all of his university career at one university. He spent two semesters at the University of Göttingen where he attended lectures by\nRichard Courant\n,\nEdmund Landau\nand\nGustav Herglotz\n. While at Göttingen, he met\nEmmy Noether\n,\nBartel van der Waerden\n,\nEmil Artin\nand\nErnst Witt\n. Hahn said that he had attended a lecture by\nCarl Ludwig Siegel\nbut had not understood it at all. He got to know\nEdmund Landau\nwell at this time and was often invited to his home. Hahn said that\nEdmund Landau\nalways talked to his dog in Hebrew. Landau often organised quiz evenings to which Hahn was invited.\nAfter his year in Göttingen, Hahn returned to Berlin where he continued to undertake research advised by\nSchur\n. In January\n1933\nhe passed the State examinations which entitled him to become a gymnasium teacher. On\n30\nJanuary\n1933\nHitler came to power and on\n7\nApril\n1933\nthe Civil Service Law provided the means of removing Jewish teachers from the universities, and of course removing those of Jewish descent from other roles. All civil servants who were not of Aryan descent\n(\nhaving one grandparent of the Jewish religion made someone non-Aryan\n)\nwere to be retired. Since he was not Jewish, Hahn was not directly affected by this law but, nevertheless, it did have consequences for him. He submitted his doctoral thesis\nDie Nullstellen der Laguerreschen und Hermiteschen Polynome\nⓉ\n(\nThe zeros of Laguerre and Hermite polynomials\n)\nand was examined by\nSchur\nand other examiners in July\n1933\n. His doctoral studies had been made with advice from\nSchur\nand\nRemak\n. His friendship\nEdmund Landau\nat Göttingen also was a black mark against him in the eyes of those now in authority in Germany since all three of his influential teachers were Jews dismissed under the Civil Service Law.\nHahn spent the years from\n1933\nto\n1940\nas a school teacher. Most of these seven years were spent in Berlin but he did spend one year teaching in the town of Züllichau in Brandenburg. This was particularly significant since one of the pupils he taught during this year was Irmgard Pollack. They later married and had one son Gerold Hahn who went on the become a secondary school teacher of mathematics in Kassel. During these years as a school teacher Hahn published some research articles:\nBericht über die Nullstellen der Laguerreschen und Hermiteschen Polynome\nⓉ\n(\nReport on the zeros of Laguerre and Hermite polynomials\n)\n(1935)\n;\nÜber die Jacobischen Polynome und zwei verwandte Polynomklassen\nⓉ\n(\nOn the Jacobi polynomials and two related polynomial classes\n)\n(1935)\n;\nÜber höhere Ableitungen von Orthogonalpolynomen\nⓉ\n(\nOn higher derivatives of orthogonal polynomials\n)\n(1935)\n; and\nÜber Orthogonalpolynome mit drei Parametern\nⓉ\n(\nOn orthogonal polynomials with three parameters\n)\n(1939)\n.\nIn\n1940\nHahn was drafted into the Wehrmacht. He was sent with the invading German forces to Norway where\n300\n,\n000\nGerman troops remained stationed for the duration of the war. No wartime experience is pleasant and, particularly towards the end of the war when the Norwegian resistance became stronger, this was far from a holiday. Still it may have been one of the luckier postings for German troops. Perhaps it is also worth noting that the Allies were happy to see this large cohort of German troops kept away from the areas of active fighting. Hahn remained in Germany until the war ended in\n1945\nand, following the victory by the Allies, he was prevented from returning to Germany until\n1946\n. Back in Berlin in\n1946\nhe was not able to continuing in the teaching profession and for the following few years he had to do jobs involving hard physical labour in industrial plants. Although in many ways this was hard, yet it did allow him to continue his mathematical research working towards\nhabilitation\n.\nHahn published three papers in\n1949\n, namely:\nÜber Orthogonalpolygnome, die q-Differenzengleichungen genügen\nⓉ\n(\nOn orthogonal polygnomials satisfying q-difference equations\n)\n;\nÜber Orthogonalpolynome, die gleichzeitig zwei verschiedenen Orthogonalsystemen angehören\nⓉ\n(\nOn orthogonal polynomials, simultaneously belonging to two different orthogonal systems\n)\n; and\nBeiträge zur Theorie der Heineschen Reihen\nⓉ\n(\nContributions to the theory of Heine ranks\n)\n. Then, in\n1950\n, he submitted his habilitation thesis\nÜber höheren Heineschen Reihen und eine einheitliche\nTheorie der sogenannten speziellen Funktionen\nⓉ\n(\nOn Heine higher ranks and a unified theory of the so-called special functions\n)\nto the Humboldt University, the new name which had been given to the Friedrich-Wilhelm University of Berlin in\n1945\n. Ulrich Dieter writes\n[\n2\n]\n:-\nHis work on orthogonal polynomials, particularly his habilitation thesis, which was published in the 'Math. Nachrichten'\n2\n(1949)\n,\n3\n-\n34\n, was of considerable interest to many mathematicians. Mention should  be made of J Aczél, N A Al-Salam,\nG E Andrews\n,\nR Askey\n,\nF V Atkinson\n,\nL Carlitz\n, T S Chihara, Ch F Dunkl,\nW N Everitt\n, O Frink, G Gasper, M E H Ismail, S Karlin, T H Koorwinder, A M Krall, L L Littlejohn, A P Magnus, P Maroni, J L McGregor, I M Sheffer, S D Shore, A van der Sluis, M Wayne Wilson and J Wilson. In his habilitation thesis Hahn examined polynomials which today bear the name \"Hahn polynomials\", which already appears in the title of many works today. In addition, these polynomials also play an important role in combinatorics.\nIn\n1952\nHahn was appointed as a\nDiätendozentur\n, a position that was newly created as a first step of an academic career, in the Department of Mathematics headed by Rudolf Iglisch\n(1903\n-\n1987)\nat the Technische Hochschule of Braunschweig. He remained on the staff at Braunschweig until\n1963\nalthough he spent the years\n1959\n-\n61\nin India as we shall describe below. Siegfried Horst Lehnigk was a student at Braunschweig in the\n1950\ns. He writes\n[\n2\n]\n:-\nWhen, as student of mathematics at the Technical University of Braunschweig, I met Professor Wolfgang Hahn during the early\n1950\ns, memories of the dark days of the immediate post-war years had receded, and an atmosphere of individualism and liberty had emerged superseding the traumatic experiences of the war and its consequences, even though the perturbing revelations of the crimes committed upon millions of innocent victims weighed heavily on the minds of many. It was time to move on, to build a professional future. Professor Hahn liberally provided encouragement and offered assistance and advice to do just that. Although he had worked on Special Functions, orthogonal polynomials in particular, and lectured extensively on those subjects he became affectionately known as 'Stability Hahn' when his interest and his work in the field of stability of motions became apparent.\nHis years in the Mathematics Department at Braunschweig saw him publish a number of important books. Perhaps the most significant was\nTheorie und Anwendung der direkten Methode von Ljapunov\nⓉ\n(\nTheory and application of the direct method of Lyapunov\n)\n(1959)\nwhich was translated into English and published as\nTheory and application of Liapunov's direct method\n(1963)\n. Henry A Antosiewicz writes in a review:-\nThe direct method or, as\nLyapunov\ncalled it in his memoir 'Problème général de la stabilité du mouvement'\nⓉ\n(\nThe general problem of the stability of movement\n)\n(1947)\n, the second method, embodies all those criteria for the stability and instability of a solution of an equation x' = f\n(\nt, x\n)\nthat have one feature in common: they are based solely upon properties of scalar functions V\n(\nt, x\n)\nand their total derivative\n∂\nV\n/\n∂\nt\n+\ng\nr\na\nd\nV\n.\nf\n\\partial V/\\partial t + grad V . f\n∂\nV\n/\n∂\nt\n+\ng\nr\na\nd\nV\n.\nf\nand do not depend upon considerations of variational equations and the like.\nLyapunov\n's original three basic theorems\n(\none on stability, two on instability\n)\nand one remark\n(\non asymptotic stability\n)\n, formulated in terms of such functions, are the foundation of essentially all later work, much of it done in the USSR. The present book gives a summary account of the development in this area of stability theory up to\n1958\n. It should aid greatly in making the second method more widely available.\nDiscussing the same book, Siegfried Lehnigk writes\n[\n2\n]\n:-\nHahn collected the available results, augmented by his own, and organized them in clearly structured chapters which deal with the basic definitions and theorems of\nLyapunov\n's direct method and their converses and with applications, with the fact in mind that there are no general rules for the construction of a\nLyapunov\nfunction for a given problem. There are also remarks on the practically important topic of finite time stability, extensions of the method to metric spaces and differential-difference and difference equations.\nWe noted above that Hahn spent\n1959\n-\n61\nin Madras\n(\nnow Chennai\n)\nin India. His son, Gerold Hahn, wrote about his experiences\n(\nquoted in\n[\n2\n]\n)\n:-\nThe alien land of India, the culture of Hinduism, the life in the tropics impressed my father very much. The construction of an entirely new institution with a team of Germans and Indians required great administrative activity and a lot of patience. In India, there were universities, but theoretical training linked to practice there was a novelty. There were annoying recurring difficulties with Indian authorities: in the humid monsoon season approved machines from Germany rusted in the port. The buildings were not completed as planned. My father found excellent Indian colleagues who could, on his return to Germany, take on the management of the mathematical department. Through guest lectures at the University of Madras, he intensified contacts with Indian mathematicians and was a lifelong member of the\nIndian Mathematical Society\n.\nIn\n1962\nHahn left Braunschweig and went to the United States where he was well-known because of his book and he was invited to give lectures at many different universities. In\n1963\nhe was appointed as a researcher at the Institute of Applied Mathematics at the University of Bonn. However, he returned to the United States for a visit to the Mathematics Research Center, United States Army, University of Wisconsin, Madison, from May to July\n1964\n. He also lectured at the United States Army Missile Command Research Institute in Huntsville, Alabama, and also at the Mathematics Department of the University of Alabama in Huntsville. It was during this time in the United States that he wrote much of his book\nStability of motion\nwhich was published in\n1967\n. Siegfried Lehnigk writes\n[\n2\n]\n:-\nThe material of the\n1959\nbook was considerably expanded and the basic concepts were introduced in a leading chapter on the stability problem for linear equations and the early stability criteria, algebraic and geometric, an approach which resulted in a methodologically and didactically well-balanced textbook.\nOn\n1\nOctober\n1964\nhe took up an appointment as head of Lehrstuhl II for Mathematics at the Technische Hochschule of Graz. The professorship had become vacant due to the retirement of Bernhard Baule\n(1891\n-\n1976)\n. Hahn worked with the professor who headed Lehrstuhl I for Mathematics at Graz, namely Erwin Kreyszig\n(1922\n-\n2008)\n, and together they managed to get approval for the first Chair of Applied Mathematics; Helmut Florian\n(1924\n-\n2005)\nwas appointed. When Kreyszig left Graz in\n1967\nto take up a chair at the University of Düsseldorf, Hahn argued strongly for the appointment of Karl Wilhelm Bauer\n(\nborn\n1924)\nwhom he had known from his time at Bonn. Hahn and his colleagues continued to argue for mathematics to expand in Graz and Lehrstuhl III for Mathematics was founded with the appointment of Rudolf Domiaty\n(1938\n-\n1996)\n. The expansion of mathematics at Graz continued with the appointment of Ulrich Dieter to a Chair of Statistics.\nAt Graz, Hahn built up a major research group in\nq\nq\nq\n-analysis. Thomas Ernst writes in\n[\n1\n]\n(\nwe have made some additions to try to identify the mathematicians mentioned\n)\n:-\nThe Austrian School\n[\nof q-analysis\n]\nis named in honour of one of its main figures, the Berliner Wolfgang Hahn, who held a professorship in Graz, Austria, from\n1964\n. Hahn was strongly influenced by\nEduard Heine\n. The Austrian School is a continuation of the\nHeine\nq-umbral calculus from the mid nineteenth century, which at the time however met with little attention except for\nLeonard James Rogers\n, who introduced the first q-\nHermite\npolynomials and proved the\nRogers\n-\nRamanujan\nidentities.\n[\nThe School recognises\n]\nthe early legacies of\nGauss\nand\nEuler\n. The Austrian School represents and incorporates the entire historical background which includes the pre-q mathematics, namely the\nBernoulli\nand\nEuler\nnumbers, the theta functions and the\nelliptic functions\n. ... The Austrian School takes the development of q all the way from\nJacob Bernoulli\n,\nCarl Gauss\nand\nLeonhard Euler\nin the\n17\nth\nand\n18\nth\ncentury, through the central European mathematicians of the nineteenth century:\nEduard Heine\n,\nJohannes Thomae\n,\nCarl Jacobi\n, and from the twentieth century:\nAlfred Pringsheim\n,\nFerdinand von Lindemann\n, Wolfgang Hahn, Peter Lesky\n(1926\n-\n2008)\nand Johann Cigler\n(1937\n-\n)\n, the Englishman Frederick H Jackson, the Austrians Peter Paule, Josef Hofbauer, Alex Riese and the Frenchman\nPaul Appell\n.\nAt the Technische Hochschule of Graz, Hahn was Dean of the faculty of Technology and Natural Sciences during\n1967\n-\n69\n, Rector of the University during\n1969\n-\n70\n, and Vice-Rector during\n1970\n-\n72\n. In April\n1981\nHahn reached\n70\nyears of age and retired from his chair. The years immediately after he retired were sad ones for Hahn with his wife's health deteriorating rapidly. She died in\n1983\nand from that time Hahn lived alone in Graz. He attended many opera and theatre performances in Graz and other cities. He also undertook art history trips to Italy and Germany. On his\n80\nth\nbirthday, he became an honorary member of\nAustrian Mathematical Society\n. By the summer of\n1997\nhe was finding it difficult to cope on his own. His son came from Kassel to Graz and stayed with him during the summer vacation. Realising that he could no longer manage on his own, his son arranged for him to move to a house in Kassel next to his own. A farewell dinner was arranged for him in Graz which all the professors attended, then he left for Kassel in October\n1997\n. After two weeks in Kassel he was diagnosed to have a tumour and hospitalised. However, he was able to spend Christmas with his children, grandchildren and great grandchildren in Kassel. He was operated on in January\n1998\nand did not survive the operation."
}