{
  "nome_completo": "Xiahou Yang",
  "nome_curto": "Xiahou Yang",
  "ano_nascimento": "400",
  "ano_morte": "470",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Xiahou_Yang/",
  "lugar_nascimento": null,
  "lugar_morte": "China",
  "biografia": "Xiahou Yang\nis also known as\nHsiahou Yang.\nNothing is known of Xiahou Yang except as the supposed author of the\nXiahou Yang suanjing\n(\nXiahou Yang's Mathematical Manual\n)\n. However, according to\n[\n3\n]\n, there is no doubt that the\nXiahou Yang suanjing\nwas not written by Xiahou Yang. What then do the dates we give for his life mean? What we have done is to use the best available evidence for the dates when the\nXiahou Yang suanjing\nwas written and deduce approximate dates for Xiahou Yang from that. If that seems somewhat perverse, given that it seems almost certain that Xiahou Yang did not write the work, then we can only plead weakly that we have no other option!\nThe dating of the work is fairly well pinned down. We have comments by\nZhang Qiujian\nwhich criticise the accuracy of one of the solutions given in the\nXiahou Yang suanjing\n(\nXiahou Yang's Mathematical Manual\n)\n. This gives\n468\nas the latest possible date for the work to be written. On the other hand a change of volume standard which took place in\n425\nin mentioned in the text so it must have been written after that date. The dates we give cannot therefore be more than\n40\nyears in error for the author of the work.\nThe treatise contains three chapters in the usual style of problems and solutions. Chapter\n1\ncontains\n19\nproblems, chapter\n2\ncontains\n29\nproblems and the final chapter contains\n44\nproblems. One significant idea which appears in the text concerns representation of numbers in the decimal notation. Xiahou Yang notes that to multiply a number by\n10\n,\n100\n,\n1000\n, or\n10000\nall that needs to be done is that the rods on the counting board are moved forwards by\n1\n,\n2\n,\n3\n, or\n4\ndecimal places. Similarly to divide by\n10\n,\n100\n,\n1000\n, or\n10000\nthe rods are moved backwards by\n1\n,\n2\n,\n3\n, or\n4\ndecimal places. What is significant here is that Xiahou Yang seems to understand not only positive powers of\n10\nbut also decimal fractions as negative powers of\n10\n.\nAlthough Xiahou Yang has no symbol for\n0\nin an empty place, there is good evidence from his description of moving numbers to the right and left that he at least has a virtual zero in mind despite the lack of a symbol.\nCertainly when\nLi Chunfeng\ncame to edit this text to make it a suitable text for the Imperial examinations, which it became in\n656\n, he had to correct some of the problems. In particular some of the problems dealing with areas in the\nXiahou Yang suanjing\n(\nXiahou Yang's Mathematical Manual\n)\nuse incorrect formulae."
}