{
  "nome_completo": "Yaroslav Borisovich Lopatynsky",
  "nome_curto": "Yaroslav Borisovich Lopatynsky",
  "ano_nascimento": "1906",
  "ano_morte": "1981",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Lopatynsky/",
  "lugar_nascimento": "Tiflis, Russian Empire (now Tbilisi, Georgia)",
  "lugar_morte": "Donetsk, USSR",
  "biografia": "Yaroslav Borisovich Lopatynsky\n(\nor\nLopatinskii\n)\nattended Baku State University in Baku, the capital of Azerbaijan, graduating in\n1926\n. He continued to study at the graduate school of the university but in\n1930\nhigher education was reorganised in Azerbaijan and Baku State University became the Supreme Pedagogical Institute. However, in\n1934\nthe university was reestablished. Also as part of the reorganisation, Azerbaijan State Economic University was founded in Baku in\n1930\n. Lopatynsky worked at both the Azerbaidzhan University and the Baku Polytechnic Institute. The Polytechnic Institute had been called the Baku Polytechnicum from its founding in\n1887\nuntil the Red Army took control of Baku in\n1920\nwhen the Baku Polytechnicum became the Baku Polytechnic Institute.\nLopatynsky's first papers were on analysis:\nOn uniform convergence\n(1929)\n;\nEmbedding of a Riemannian space in a Euclidean space\n(1934)\n;\n(\nwith L P Fridolina\n)\nThe justification of mathematics, a critical situation\n(1934)\n; and\nLimiting values of an analytic function on a set of singular points of measure greater than zero on a rectified curve\n(1935)\n. He was awarded a Master's degree by Kharkov University in\n1938\nwithout having to write a thesis. His research interests then moved towards\ndifferential equations\nwith his first paper on this topic\nSolution of the equation\ny\n′\n=\nf\n(\nx\n,\ny\n)\ny ' = f (x, y)\ny\n′\n=\nf\n(\nx\n,\ny\n)\npublished in\n1939\n, proving a general existence theorem.\nDuring World War II, Lopatynsky continued to teach at the Azerbaidzhan University and the Baku Polytechnic Institute. He continued to undertake research on differential equations, but his interests now included differential operators. In\n1945\nhe published\nLinear differential operators\n.\nOscar Zariski\nbegins a review of the paper by writing:-\nThe author studies linear\n(\npartial\n)\ndifferential equations from a formal algebraic point of view. His treatment of this special case of the algebraic theory of algebraic differential equations yields a well-rounded ideal theory of linear differential operators; in many respects it differs essentially from the treatment due to\nRitt\n(\nfor instance, ideals and sums of integral manifolds are defined differently\n)\n.\nIn\n1945\nLopatynsky moved to Lvov where he was appointed to the chair of differential equations at Lviv University. In addition, he worked at the Institute of Mathematics in Lvov which was part of the\nUkrainian Academy of Sciences\nof the SSR. He submitted his doctoral dissertation, dealing with an algebraic theory of rings of differential operators, to Moscow University, and he defended his thesis in\n1946\n. His seminar on differential equations at Lvov University attracted many mathematicians, both young men beginning their research activity and established researchers who found inspiration in the seminar. Lopatynsky's research continued to impress as he continued to prove major results in the theory of systems of linear differential equations of the elliptic type. In\n1963\nhe left Lvov and moved to Moscow's Industrial Institute. In\n1966\nhe became head of the\npartial differential equations\nSection of the Institute of Applied Mathematics and Mechanics of the\nUkrainian Academy of Sciences\nin Donetsk. He was also appointed as Chairman of the Department of Differential Equations at Donetsk University.\nLopatynsky's contributions to the theory of differential equations are particularly important, with important contributions to the theory of linear and nonlinear partial differential equations. He worked on the general theory of\nboundary value problems\nfor linear systems of partial differential equations of elliptic type, finding general methods of solving boundary value problems. In Donetsk\n[\n8\n]\n:-\n... he continued his studies of general boundary problems in differential equations using topological methods. His work opened up broad possibilities for applying\nMorse\ntheory to variational elliptic problems. Recently he has obtained important results on solvability of the\nCauchy\nproblem for operator equations in\nBanach space\nand also on \"almost everywhere\" solvability of general linear and nonlinear boundary problems.\nVolodymyr Petryshyn\nwrites in\n[\n5\n]\n:-\nLopatynsky was the first person to formulate a condition on the relation between the coefficients of the system and the coefficients of the boundary operators which is necessary and sufficient for the normal solvability of boundary value problems. This is now known as the Lopatynsky Condition. He also obtained some basic results in the solvability of the\nCauchy\nproblem for operator equations in\nBanach\nspaces.\nIn\n1980\nLopatynsky published an important book\nIntroduction to the Contemporary Theory of Partial Differential Equations\n. He writes in the Introduction:-\nThis book makes the reader familiar with the basic notions and facts of algebra, topology, and\nfunctional analysis\n, and gives a general idea how to apply these notions to the theory of differential equations. Only a minor part of the proofs is sketched. More detailed presentations can be found in many monographs on topology and functional analysis which will be cited systematically in this text.\nThe book contains eight chapters: Sets; Basic algebraic notions; Algebraic equations; Topology; Differentiation and integration; Special linear spaces which are related to Euclidean spaces; Manifolds; and Elements of\nalgebraic topology\n.\nHis next book, published in\n1984\nthree years after his death, was entitled\nOrdinary differential equations\n. He writes in the Introduction:-\nWe consider the basic methods of solving differential equations and methods of qualitative investigation of these solutions. We emphasize the relation of the theory of differential equations to other areas of mathematics. We illustrate the theoretical material with an analysis of the solution of many examples. The text is for university students in mathematical specialties.\nAs to his character the authors of\n[\n1\n]\nwrite:-\nLopatinskii is a highly cultured human being, a great connoisseur of both Russian classical and foreign literature and a fine judge of art, of painting in particular. His modesty and the high standards that he sets for himself, his attentiveness and straightforwardness in dealing with others, and his constant readiness to be of assistance when needed make any association with him an enlightening and delightful experience. Yaroslav Borisovich has won the deep admiration and respect of his many students, as well as those closely associated with him professionally and socially.\nLopatynsky received many honours for his achievements. He was elected a corresponding member of the\nUkrainian Academy of Sciences\nof the SSR in\n1951\n, being elected a full member in\n1965\n. He received the Ukraine State Prize in science and engineering in\n1978\n. He was also awarded the Order of Lenin, the Order of the October Revolution, and various medals. In addition a book Theory of general boundary value problems was published in\n1984\ncontaining a selection of\n35\nof his papers from the total of\n59\n. Finally let us mention that the Second International Conference for young mathematicians on Differential Equations and Applications held in November\n2008\nat the Donetsk National University was dedicated to Ya B Lopatinskii. The organisers write that their aims are:-\nBringing together young and some venerable researchers in above areas in order to get acquainted, to communicate and to understand what directions are actual and perspective. The word \"young\" in the title means a general direction of the conference but doesn't mean any age limitations for the participants. The conference is named after an outstanding mathematician, talented pedagogue and organiser, Academician of National Academy of Sciences of Ukraine Yaroslav Borisovich Lopatinskii who was a founder of both the Department of Differential Equations in Donetsk National University and the Department of Partial Differential Equations in the Institute of Applied Mathematics and Mechanics of National Academy of Sciences of Ukraine. The conference is the continuation of the Conference on Differential Equations and Applications dedicated to the centenarian jubilee of Ya B Lopatinskii held in December\n2006\n."
}