{
  "nome_completo": "Yurii Dmitrievich Sokolov",
  "nome_curto": "Yurii Sokolov",
  "ano_nascimento": "1896",
  "ano_morte": "1971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sokolov/",
  "lugar_nascimento": "Labinskaya Stanitsa (now Labinsk), Russia",
  "lugar_morte": "Kiev, Ukranian SSR (now Kyiv, Ukraine)",
  "biografia": "Yurii Sokolov\nwas born in Labinskaya Stanitsa, a name of the town whose name means Cossack village. He graduated from Kiev Institute of Peoples Education in\n1921\nand then he taught in the Applied Mathematics Division of the Academy. NHis education was in the period of changing trends in Ukraine. An effect of the Revolution of\n1917\nwas that mathematics in Ukraine was required to be more practical.\nDmitry Grave\n, who had studied\nJacobi\n's methods for the\nthree body problem\nfor his own Master's thesis, had become a leading researcher in algebra and number theory, but pressure to undertake more practical research led him to change to study mechanics and applied mathematics. He supervised Sokolov's research in the area of mechanics of particles and this was the topic of his doctorate which in many ways followed on from\nGrave\n's Master's thesis. Sokolov's first publication appeared in\n1923\n.\nFrom\n1934\nSokolov taught at the Institute of Mathematics at the\nAcademy of Sciences of Ukraine\n. He also taught at several other higher educational institutions in Kiev.\nSokolov's main work was on the\nn\nn\nn\n-body problem, which he worked on for nearly\n50\nyears and he summarised his contributions in the book\nSingular trajectories of a system of free material points\n(\nRussian\n)\nwhich was published in\n1951\n. He also worked on functional equations and on such practical problems as the filtration of groundwater. Examples of papers where he makes practical applications to water flow are\nOn the flow of ground water into a drainage ditch of trapezoidal section\n(\nRussian\n)\n(1951)\n,\nFiltration without backwater from an unlined canal of trapezoidal section in homogeneous ground\n(\nRussian\n)\n(1952)\n,\nOn a problem of the theory of unsteady motion of ground water\n(\nRussian\n)\n(1953)\n,\nOn the theory of plane unsteady filtration of ground water\n(\nRussian\n)\n(1954)\n,\nOn an axially symmetric problem of the theory of unsteady motion of ground water\n(\nRussian\n)\n(1955)\n. Other applications include\nOn the determination of dynamic pull in shaft-lifting cables\n(\nUkrainian\n)\n(1955)\nand\nOn approximate solution of the basic equation of the dynamics of a hoisting cable\n(\nUkrainian\n)\n(1955)\n. Sokolov also published on celestial mechanics and hydromechanics.\nOne of the topics which will always be associated with Sokolov's name is his method for finding approximate solutions to differential and\nintegral equations\n. The method which he introduced is now sometimes called 'the averaging method with functional corrections' or sometimes called 'the Sokolov method'. His methods were highly practical and useful in many applications to mathematical physics, but they were also studied with the highest degree of mathematical rigour. Examples of his papers on this topic are\nOn a method of approximate solution of linear integral and differential equations\n(\nUkrainian\n)\n(1955)\n,\nSur la méthode du moyennage des corrections fonctionnelles\nⓉ\n(\nOn the averaging method of functional corrections\n)\n(\nRussian\n)\n(1957)\n,\nSur l'application de la méthode des corrections fonctionnelles moyennes aux équations intégrales non linéaires\nⓉ\n(\non the application of the method of average functional corrections to non-linear integral equations\n)\n(\nRussian\n)\n(1957)\n,\nOn a method of approximate solution of systems of linear integral equations\n(\nRussian\n)\n(1961)\n,\nOn a method of approximate solution of systems of nonlinear integral equations with constant limits\n(\nRussian\n)\n(1963)\n, and\nOn sufficient tests for the convergence of the method of averaging of functional corrections\n(\nRussian\n)\n(1965)\n.\nHis many papers in this area were brought together in the important book\nThe method of averaging of functional corrections\n(1967)\nwhich he wrote at an elementary level. E L Albasiny, reviewing Sokolov's textbook, first formally describes the approximations from averaging of functional corrections. He then writes:-\nThe approximations may converge although\nPicard\niteration diverges. This basic approach is developed by the author and applied to the approximate solution of\nFredholm\nand\nVolterra\n-type integral equations of the second kind, to their nonlinear counterparts, to integral equations of mixed type, to linear and nonlinear one-dimensional boundary value problems, to initial-value problems in ordinary differential equations and to certain elliptic, hyperbolic and parabolic equations.\nThe first part of Sokolov's book discusses applications of his method to problems which can be modelled by linear integral equations with constant limits. He gives a number of different sufficient conditions for the approximations to converge and presents error estimates. The next three parts look first at problems which can be modelled by nonlinear integral equations with constant limits and then extend the analysis to the situation where the upper limit is variable. In the final part Sokolov examines applications of his method to integral equations of mixed type, then in a number of appendices he presents some generalisations of the method.\nSokolov died only a few months before his\n75\nth\nbirthday and only a few months short of completing\n50\nyears of scientific work in the\nUkrainian Academy of Sciences\n."
}