{
  "nome_completo": "Johann Martin Zacharias Dase",
  "nome_curto": "Zacharias Dase",
  "ano_nascimento": "1824",
  "ano_morte": "1861",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dase/",
  "lugar_nascimento": "Hamburg, Germany",
  "lugar_morte": "Hamburg, Germany",
  "biografia": "Zacharias Dase\nhad incredible calculating skills but little mathematical ability. He attended school in Hamburg from the age of\n2\n1\n2\n2\\large\\frac{1}{2}\\normalsize\n2\n2\n1\n​\nyears but, in his own opinion, his early instruction had little influence on him. He did show remarkable abilities in arithmetic at a very young age and he read all the books he could find on arithmetical skills. He was obsessed\n(\nhis own account suggests this is not too strong a word\n)\nwith dominoes when a child and when he later tried to explain how he came to have the skills which he did, he suggested that dominoes had played a role in developing his calculating abilities. He suffered from epilepsy from early childhood, and this health problem remained with him throughout his life.\nAt the age of fifteen, he began to give exhibitions of his calculating skills. He gave exhibitions in Germany, Austria and England, giving performances in the major cities. The way that he carried out these exhibitions was to ask a member of the audience to give him a problem. He would then write the numbers involved on a blackboard, and after carrying out mental calculations, write down a provisional answer on the board. He would then check his answer and tell the audience it was confirmed. A feature of his calculating was that it was unaffected by noise and he could even carry out a conversation with a member of the audience while doing mental arithmetic. Scripture writes\n[\n4\n]\n:-\nHe multiplied and divided large numbers in his head, but when the numbers were very large he required considerable time. Schumacher once gave him the numbers\n79532853\nand\n93758479\nto be multiplied. From the moment in which they were given to the moment when he had written down the answer, which he had reckoned out in his head, there elapsed\n54\nseconds. He multiplied mentally two numbers each of\n20\nfigures in\n6\nminutes;\n40\nfigures in\n40\nminutes; and\n100\nfigures in\n8\n3\n4\n8\\large\\frac{3}{4}\\normalsize\n8\n4\n3\n​\nhours, which last calculation must have made his exhibitions somewhat tiresome to the onlookers. He extracted mentally the square roots of a number of\n100\nfigures in\n52\nminutes.\nSchumacher, who is referred to in the above quotation, is the mathematician and astronomer whose full name is Heinrich Christian Schumacher. The final statement about extracting the square root is claimed by some to be an incorrect report of one of Dase's exhibitions, where in fact the extracted the\n52\nnd\nroot from a\n97\n-digit number.\n[\nIf so, the answer must have been\n71\n,\n72\nor\n73\nfor these are the only integers with\n97\n-digit\n52\nnd\npowers.\n]\nIt is amazing that he could calculate for nearly nine hours but he always said that he never became tired while calculating. Richard Preston writes\n[\n3\n]\n:-\nDase could do this kind of thing for weeks on end, running as an unattended supercomputer. He would break off a calculation at bedtime, store everything in his memory for the night, and resume calculation in the morning.\nDase was in Vienna in\n1840\ngiving an exhibition. He attended the lectures of\nL K Schulz von Strassnitsky\non the elements of mathematics in\n1844\n. At this time\nStrassnitsky\nurged him to use his powers for scientific purposes and suggested that he use his abilities to calculate digits of π. Dase used his calculating ability to calculate  to\n200\nplaces, taking about two months for this task. He used the formula\nπ\n4\n=\narctan\n⁡\n(\n1\n2\n)\n+\narctan\n⁡\n(\n1\n5\n)\n+\narctan\n⁡\n(\n1\n8\n)\n\\Large\\frac{\\pi}{4}\\normalsize   = \\arctan(\\large\\frac{1}{2}\\normalsize ) + \\arctan(\\large\\frac{1}{5}\\normalsize ) + \\arctan(\\large\\frac{1}{8}\\normalsize )\n4\nπ\n​\n=\narctan\n(\n2\n1\n​\n)\n+\narctan\n(\n5\n1\n​\n)\n+\narctan\n(\n8\n1\n​\n)\nfor his calculations. His result was published in\nCrelle's Journal\nfor\n1844\nand it is correct. At this time it was the most digits of π which had been calculated.\nDase did seek some employment in addition to making money from his exhibitions\n[\n4\n]\n:-\nIn\n1844\n, he had a position in the Railway Department in Vienna; in\n1845\nhe appears in Mannheim; in\n1846\nhe seems to have had a position in Berlin.\nHe undertook other tasks which were suggested to him as being useful for science. He constructed\n7\nfigure tables of natural logarithms of the numbers from\n1\nto\n1\n,\n005\n,\n000\nin\n1847\n(\nthis task was completed over a period of three years\n)\n. He also assisted in reducing the data which had been collected for the Prussian triangulations and completed this task in the same year of\n1847\n[\n4\n]\n:-\nIn\n1850\nthe largest hyperbolic table, as regards range, was published by him under the title 'Tafel der natürlichen Logarithmen der Zahlen'\nⓉ\n(\nTable of natural logarithms of the integers\n)\n; the same was reprinted in the annals of the Vienna observatory.\nIn\n1849\nDase proposed to the Academy of Sciences in Hamburg that he would compute the factors of all the numbers from\n7\nmillion to\n10\nmillion. He requested a grant to allow him to undertake this work and\nGauss\nwas asked by the Academy if this was a worthwhile task.\nGauss\nreplied\n(\nsee for example\n[\n4\n]\n)\n:-\nWith small numbers, everybody that possesses any readiness in reckoning, sees the answer to such a question\n[\nthe divisibility of a number\n]\nat once directly, for greater numbers with more or less trouble; this trouble grows in an increasing relation as the numbers grow, till even a practised reckoner requires hours, yes days, for a single number; for still greater numbers, the solution by special calculation is entirely impractical. ... You possess many of the requisite qualities\n[\nfor establishing tables of factors\n]\nin a special degree, a remarkable agility and quickness in handling arithmetical operations, ... and an invaluable persistence and perseverance.\nThe Hamburg Academy of Sciences awarded Dase the financial support he requested and he began to undertake the huge task. When he died in\n1861\n, he had completed computing factors of all the numbers between\n7\nmillion and\n8\nmillion, and also, with the exception of a small portion, of the next million numbers.\nScripture writes\n[\n4\n]\n:-\nIn\n1850\nDase went to England to earn money by exhibitions of his talents. Much the same is related of his great powers as in Germany; his general obtuseness also occasioned remark. He could not have made the least idea of a proposition in\nEuclid\n. Of any language but his own he could never master a word.\nIn fact it was the mathematician\nJulius Petersen\nwho spent six weeks trying to teach Dase some of\nEuclid\n's propositions but discovered that this was completely beyond Dase. He did however have one other remarkable ability\n[\n4\n]\n:-\nHe had one ability not present to such a degree in other ready reckoners. He could distinguish some thirty objects of a similar nature in a single moment as easily as other people can recognise three or four. The rapidity with which he would name the number of sheep in a herd, of books in a book-case, of window-panes in a large house, was even more remarkable than the accuracy of his mental calculations.\nNow there were weaknesses even in Dase's calculating powers\n[\n4\n]\n:-\nIt is curious that although Dase generally reckoned with astonishing accuracy, yet on at least two occasions his powers failed him. While he was in Hamburg, in\n1840\n, he gave striking proofs of his talents, but at times made great mistakes, which luckily for him happen seldomer than his correct answers. In\n1845\n, Schumacher writes \"at a test which he was to undergo before me, he reckoned wrongly every time.\" This was explained as coming from a headache.\nA modern medical expert assessing Dase using the descriptions of his personality and other factors, would suggest that he suffered from Asperger's syndrome.\nFinally, we mention that\nRaymond Archibald\nnoted that\n[\n1\n]\nis a volume of material about himself which Dase extracted from his scrapbook.\nArchibald\ntells us it contains:-\n...\n69\nstanzas or poems in a variety of different forms by as many different authors. As far as I am aware this is the largest number of so-called poems on any single mathematician."
}