{
  "nome_completo": "Abraham Sharp",
  "nome_curto": "Abraham Sharp",
  "ano_nascimento": "1653",
  "ano_morte": "1742",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Sharp/",
  "lugar_nascimento": "Little Horton, near Bradford, Yorkshire, England",
  "lugar_morte": "Little Horton, near Bradford, Yorkshire, England",
  "biografia": "Abraham Sharp\nwas born in Horton Hall in Little Horton near Bradford in England. Although we do not know the date of his birth we do know that he was baptised on\n1\nJune\n1653\nin Bradford. There is some confusion as to the date of his birth since an inscription in Bradford states that he died in his ninety-first year. However, there is good reason from Sharp's own writing to believe that this inscription is wrong and the he was indeed born shortly before he was baptised. His parents were John Sharp of Little Horton, and his wife, Mary Clarkson of Bradford. John Sharp was quite well off. He had made money as a farmer and a merchant before serving as financial secretary to General Sir Thomas Fairfax during the English civil war. He therefore took the side of Parliament and later became a Commonwealth tax collector. Abraham was his parents sixth son and ninth child so he was brought up in a very large family. Being fairly wealthy, his parents were able to give Abraham, and all their other sons, a good education.\nThe first formal education which Abraham received was in the village school in Little Horton, then he attended Bradford grammar school. After his schooling he started out as a merchant's apprentice in May\n1669\n, working in the cloth business. His father died in\n1672\nand Sharp received a small legacy. This gave him the opportunity to give up his apprenticeship in favour of teaching writing and commercial arithmetic, which he did in Liverpool. We know nothing further of Sharp until\n1684\nby which time he was living in London and using the Hen and Chickens coffee house in the Strand as a mailing address. He first worked at the Royal Observatory Greenwich for some months during\n1684\n-\n5\nas assistant and instrument maker to\nJohn Flamsteed\n, the first Astronomer Royal. He remained in contact with\nFlamsteed\nfrom\n1685\nto\n1688\nduring which time he continued to live in London. He returned to work for\nFlamsteed\nfrom\n1688\nuntil November\n1690\n. During his time in London he was friendly with the mathematicians frequenting the London coffee houses.\nSee the article\nLondon Coffee houses and mathematics\nAt the Royal Observatory, Sharp produced eclipse data, tables of the motions of Jupiter's satellites and assisted\nFlamsteed\nin the construction of instruments. In particular he engraved the scale on a great mural arc,\n6\nfeet\n9\ninches in radius, and did other work on the instrument which served\nFlamsteed\nfor\n30\nyears and was one of the finest astronomical instruments in Europe.\nFlamsteed\ngreatly appreciated Sharp's mathematical skills as well as his skill as an instrument maker, but complained that when it came to carrying out the day to day duties of an astronomer he was\n(\nsee for example\n[\n1\n]\n)\n:-\n... as useless to me as any that can but write well could be, or rather less.\nFrom November\n1690\nSharp taught mathematics as the resident mathematician of William Court at the Mariner and Anchor on Little Tower Hill in London. He only did this for a few months for, in February\n1691\n, he accepted the offer of the position of clerk at the King's shipyard at Portsmouth. During the time he worked in Portsmouth he also taught mathematics and continued to use his skills as an instrument maker. In\n1693\nhis eldest brother died and he received a request from his widow to return to Horton Hall which he did in\n1694\n. There he became known as a generous patron of the first Presbyterian chapel in Bradford. Sharp remained unmarried and he led a fairly unstructured life often forgetting to take his meals. As he grew older he kept more and more to himself, becoming somewhat of a recluse.\nAfter\n1702\nSharp corresponded with\nFlamsteed\nand almost all of the correspondence has survived. Subjects discussed by Sharp in his letters include mathematical and astronomical books, astronomical calculations, the aurora borealis, other observations, instruments, and the printing of\nFlamsteed\n's works. He was still interested in optical instruments, but his eyesight was deteriorating as is evident from a letter he wrote to\nFlamsteed\non\n19\nMay\n1702\n:-\nHaving occasion for telescope sights for a small instrument or two, request the further favour that your servant may procure for me of Mr Yarwell, or whom else you see fit, two objective glasses, one to draw about\n18\ninches or\n20\ninches, the other about\n24\ninches or\n25\ninches, and about\n11\nor\n11\n1\n4\n11\\large\\frac{1}{}\\normalsize 4\n1\n1\n1\n​\n4\ninch in diameter, and two convex oculars, drawing about\n11\n1\n2\n11\\large\\frac{1}{2}\\normalsize\n1\n1\n2\n1\n​\ninches or less, and\n31\n1\n4\n31\\large\\frac{1}{4}\\normalsize\n3\n1\n4\n1\n​\ninches diameter, such as I had formerly from Mr Yarwell. Likewise a small object glass drawing about\n9\ninches, and a concave ocular suited to it, but no case since I can make that myself. This being for a pocket perspective to assist my eyes, which I find now sensibly decaying, having formerly presumed too much upon them, and excessively, nay, sometimes unnecessarily, strained them. I know those whom you employ can best manage the glass grinders, who are ready enough to impose upon such as have not judgement both in price and goodness. Therefore assure myself all due care will be taken that they be good, and every one tried.\nSharp was not easily pleased when it came to optical instruments as is clear from a letter written by Mr Yarwell to Sharp in April\n1705\n:-\nI have your letter of January\n26\n. ... You may be sure I should be glad to please both you and all men, but I must confess I have had more complaint from you than from all the rest of mankind, with the least profit, for the last you had, which I worked hard upon for the very journeyman wages, cost me thirty shillings. ... yet if your friend had not persuaded me much to give you this letter I believe I should have been silent, so much I prefer the pleasing my friends before my own interest ... I hope you will excuse this long letter, which I take no great pleasure in writing nor you in reading, but as you are my friend I would set the matter in a right light, and leave the rest to your better judgment.\nH Sherwin published\nMathematical Tables\nin\n1710\nand in the Preface he acknowledged the contributions of:-\n... the ingenious and unwearied Mr Abraham Sharp, with his Table of Logarithms to above fifty figures ... the Construction of the Sines, Tangents and Secants; with the whole process of the quadrature of the circle to\n72\nfigures: which quadrature was invented ... by Mr\nHalley\n.\nIn fact Sharp used\nGregory\n's series with\nx\n=\n√\n3\nx = √3\nx\n=\n√\n3\nto calculate π to\n72\nplaces, a task he had carried out in\n1699\n. He had written a paper on the subject and he had submitted it to the\nRoyal Society\nbut they had not published it. Sharp claimed that his paper had been read by\nHalley\nwho then used his methods and claimed them as his own.\nIn\n1717\nSharp published\nGeometry Improved\n. This was an interesting book containing tables and a treatise on polyhedra. He clearly had a love for constructing polyhedra and in the book he gives precise instructions in how to form such polyhedra starting from a cube of wood. All the dimensions are given with great accuracy, far more than makes any sense from a practical point of view since he gives figures to between\n15\nand\n20\ndecimal place accuracy. He gave these accurate dimensions purely out of interest\n(\nas in his calculation of π\n)\n, and the whole work shows his love of these geometric objects for their aesthetic value.\nSharp's papers were lost in a fire so unfortunately further details of his mathematical work will never be known. Sharp would have liked to have trained someone to use the collection of instruments which he had built up. However it was not easy to find someone as he explained to\nFlamsteed\nin a letter written on\n19\nOctober\n1715\n:-\nI have been often thinking of what you suggested, viz., instructing some person in the use of my instruments and engines, but I find these matters so little understood or felt in this country that I know not where to find anyone either of fit capacity for it or inclination that way, though my instruments could not but be of considerable value, having within the space of the last ten or twelve years laid out upon Mr Yarwell, while he followed that employment, £\n10\nor more in glasses for telescopes and telescopic sights for different instruments. Yet should I bestow them all gratis, besides my labour in constructing, I could not engage any person I know, either for want of judgement, inclination, or convenience, to employ them to any good purpose .... Therefore must be obliged to wait till some better encouragement be offered.\nIn Bradford Cathedral there is a tablet commemorating Sharp. An English translation of the Latin inscription reads:-\nHe was rightly counted among the most accomplished mathematicians of his day. He enjoyed constant friendship with the very famous men of the same repute, notably\nFlamsteed\nand the illustrious\nNewton\n. He drew up the description of the heavens made by the former of these\n(\nFlamsteed\n)\nin\n(\nastronomical\n)\ntables of the greatest accuracy; he also published anonymously various writings and descriptions of instruments perfected by himself... .",
  "math_areas": [
    "Analysis",
    "Geometry"
  ]
}