{
  "nome_completo": "Adolph Andrei Pavlovich Yushkevich",
  "nome_curto": "Adolph Pavlovich Yushkevich",
  "ano_nascimento": "1906",
  "ano_morte": "1993",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Yushkevich/",
  "lugar_nascimento": "Odessa, Ukraine",
  "lugar_morte": "Moscow, Russia",
  "biografia": "Adolph Pavlovich Yushkevich\nwas called Adolph Pavlovich throughout his life. Born into a Jewish family containing scholars in philosophy and literature, he attended the high school in St Petersburg, then continued his education in Odessa.\nEntering the Physics and Mathematics Faculty of the University of Moscow, Adolph Pavlovich was an undergraduate with Gelfond who became his friend for life. They were taught mathematics by\nEgorov\n,\nLuzin\nand other outstanding mathematicians. Adolph Pavlovich graduated in\n1929\nand then, from\n1930\n, taught at the Moscow Higher Technical School. He was promoted to professor in\n1940\nand became Head of Mathematics there in\n1941\n.\nIn addition to his professorship of mathematics at the Moscow Higher Technical School, Adolph Pavlovich was appointed to the Institute of History of Natural Sciences and Technology in\n1945\n.\nThe cultural policy Zhdanovism of the Soviet Union was initiated by a\n1946\nresolution of the Central Committee of the Communist Party. There was an attempt to eliminate all traces of Westernism, or cosmopolitanism, from Soviet life. The policy continued until Stalin's death in\n1953\n, becoming more anti-Semitic in its later stages. Yushkevich suffered under this policy being forced to leave his post at the Moscow Higher Technical School. He was able, however, to keep his post at the Institute of History of Natural Sciences and Technology.\nYushkevich was one of the leading historians of mathematics in the world. His doctorate was on Russian mathematics during the\n18\nth\ncentury and he began publishing in\n1929\nthe first of over\n300\nworks on the history of mathematics. He contributed\n21\narticles to the\nDictionary of Scientific Biography\nwhich are referenced in this Archive. This Archive also references over\n50\narticles by Yushkevich about a wide range of mathematicians from the earliest to modern times.\nYushkevich was arguably the leading world authority on\nEuler\nand he was one of the leading authorities on medieval mathematics.\nIn\n[\n1\n]\nthe quality of his work is described in these terms:-\nYushkevich's work was characterised by an exceptional skill in analysing historical sources, irreproachable logic, carefully considered assessments and historical judgements, and a striking ability to illuminate specific problems by placing them in general historical setting.\nHis interests outside the history of mathematics are described in\n[\n1\n]\nin these terms:-\nYushkevich was a man of considerable culture, a true representative of the Russian intelligentsia. He spoke many languages, including Latin, and was well acquainted with literature, particularly the works of Russian writers. He took pleasure in rereading Turgenev and Leskov, enjoyed poetry\n(\nhis favourite poets were Goethe and Puskin\n)\n, and even composed verses himself. He was keenly interested in painting, and held the French impressionists and Chagall in especially high esteem. He liked Ukrainian songs and Russian love songs of the\n19\nth\ncentury, and enjoyed singing them at parties. And he also adored France, especially Paris, which he visited nearly every year during the last three decades of his life.\nYushkevich received many honours for his scholarship in the history of mathematics. He was elected to academies in Germany, Spain, Czechoslovakia and other countries. He was awarded the Koyré Medal by the Académie internationale d'histoire des sciences in\n1971\n, the Sarton Medal of the History of Science Society of the USA in\n1978\nand the May Prize of the International Commission on the History of Mathematics in\n1989\n, the Prize of the Akademie der Wissenschaft der DDR in\n1978\nand again in\n1983\n, and the Prize of the\nAcadémie des Sciences de France\nin\n1982\n.",
  "math_areas": []
}