{
  "nome_completo": "Adolf Kneser",
  "nome_curto": "Adolf Kneser",
  "ano_nascimento": "1862",
  "ano_morte": "1930",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Kneser/",
  "lugar_nascimento": "Grüssow, Mecklenburg, Germany",
  "lugar_morte": "Breslau, Germany (now Wrocław, Poland)",
  "biografia": "Adolf Kneser\n's father was a minister in the Protestant Church but, sadly, Adolf never knew his father who died when he was about one year old. One of his godparents was the physicist, and well-known scientific historian, Johann Christian Poggendorff. Adolf was one of his parents four sons and his mother, after the death of her husband, moved from Grüssow to Rostock where the boys could be educated. Adolf's secondary schooling took place in Rostock, and after this was complete he entered the University there. His remarkable talents are easily illustrated for even at this very early stage in his education, Kneser published his first paper which was on the refraction of sound waves. In order to get the best mathematical education available, he then moved to Berlin to study in the world leasing school of mathematics there.\nHe was taught at the University of Berlin by\nKronecker\nand also influenced by\nWeierstrass\n. As was common among students at German universities at this time, he chose to study at different universities and as well as Rostock and Berlin, he also studied at Heidelberg.\nKronecker\nand\nKummer\nsupervised his doctoral studies which ended in\n1884\nwith the award of the degree from Berlin for his thesis\nIrreduktibilität und Monodromiegruppe algebraischer Gleichungen\nⓉ\n(\nIrreducibility and monodromy algebraic equations\n)\n. After writing this thesis on algebraic functions and equations, he then worked on space curves. We should remark, however, that Kneser's interests were surprisingly broad and during his university studies he attended lectures on history, literature and philosophy. In fact as part of his doctorate he wrote a minor thesis on a philosophical problem, namely the relationship between the general laws of nature and the actual realities of nature.\nKneser submitted his\nhabilitation\nthesis to the University of Marburg where he taught for a while, then he moved to Breslau\n(\nnow Wrocław in Poland\n)\nwhere he also lectured. In\n1889\nwas appointed as an  associate professor in Dorpat, Russia\n(\nnow Tartu, Estonia\n)\nbeing appointed to the chair of Applied Mathematics there in the following year. It was while he held this chair that Kneser married Laura Booth in\n1894\n. The couple had four sons;\nHellmuth Kneser\nwas born while they lived in Dorpat. A grandson of Adolf, and son of Hellmuth, was Martin Kneser who became a professor of mathematics holding a chair at Göttingen. In\n1900\nAdolf Kneser was appointed to the chair of mathematics at the Bergakademie\n(\nAcademy of Mining\n)\nin Berlin. After five years in Berlin, he returned to Breslau where he spent the rest of his career.\nAdolf Kneser's early work was on algebraic functions and equations. For example he published\nZur Theorie der algebraischen Functionen\nⓉ\n(\nOn the theory of algebraic functions\n)\n(1887)\n. From around\n1888\nhe began his analytic investigations with the paper\nElementarer Beweis für die Darstellbarkeit der elliptischen Functionen als Quotienten beständig convergenter Potenzreihen\nⓉ\n(\nElementary proof of the visualization of the elliptic functions as quotients of stable convergent power series\n)\n. He also studied space curves during the years\n1888\n-\n1894\n, publishing papers such as\nAllgemeine Sätze über die scheinbaren Singularitäten beliebiger Raumcurven\nⓉ\n(\nGeneral theorems concerning the apparent singularities of any space curves\n)\n(1889)\n. He is remembered, however, for work mainly in two areas. One of these areas is that of linear\ndifferential equations\n; in particular he worked on the\nSturm\n-\nLiouville\nproblem and\nintegral equations\nin general. He wrote an important text on integral equations. The second main area of his work was the\ncalculus of variations\n. He published\nLehrbruch der Variationsrechnung\nⓉ\n(\nLessons on the calculus of variations\n)\n(1900)\nand he gave the topic many of the terms in common use today including 'extremal' for a resolution curve, 'field' for a family of extremals, 'transversal' and 'strong' and 'weak' extremals\n[\n1\n]\n:-\nHis engagement in this classical topic was not the direct result of his studies with the field's great master,\nWeierstrass\n, but, rather, of his teaching experience at Dorpat. Kneser brought the theory of the so-called second variation to a certain conclusion. Especially, he favoured one of its geometric aspects, the theory of families of resolution curves and their envelopes, closely connected with the Jacobian theory of conjugate points. But above all, the decisive advances towards the solution of the so-called Mayer Problem, recently introduced to the calculus of variations, are due to Kneser.\nIn\n1911\nKneser published his famous text,\nDie Integralgleichungen und ihre Anwendungen in der mathematischen Physik: Vorlesungen an der Universität zu Breslau\nⓉ\n(\nThe integral equations and their applications in mathematical physics: lectures given at the University of Wroclaw\n)\n.\nWielandt\n, writing in his obituary of\nHellmuth Kneser\n, describes Adolf Kneser as:-\n... the first to introduce\nHilbert\n's new methods into analysis in his textbook on integral equations. He devoted himself to the task of putting general results into concrete form by applying them to the functions of mathematical physics. In a sense, he made the boundary between the old and new mathematics his field of work.\nKneser's work, however, was surprisingly broad and he continued to show an interest in philosophy and knowledge theory which he had from his student days. Another two texts he published were\nHobbes Und Die Staatsphilosophie\nⓉ\n(\nHobbes and political philosophy\n)\n(1924)\n, and\nDas Prinzip der kleinsten Wirkung von Leibniz bis zur Gegenwart\nⓉ\n(\nThe principle of least action from Leibniz to the present\n)\n(1928)\n.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic"
  ]
}