{
  "nome_completo": "Agnes Mary Clerke",
  "nome_curto": "Agnes Mary Clerke",
  "ano_nascimento": "1842",
  "ano_morte": "1907",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Clerke/",
  "lugar_nascimento": "Skibbereen, Co. Cork, Ireland",
  "lugar_morte": "London, England",
  "biografia": "Agnes Mary Clerke\nwas the second child of John William Clerke, who was manager of the Provincial Bank\n(\nlater renamed the Allied Irish bank\n)\nin Skibbereen, and Catherine Mary Deasy. John William Clerke\n(\nborn\n1814)\nwas a graduate of Trinity College, Dublin, where he had studied classics but had also taken courses in mathematics and astronomy. He remained interested in sciences throughout his life. At Trinity College John had been a fellow student and close friend of Rickard Deasy. Through this friendship he met Rickard's sister Catherine; they were married on\n9\nJuly\n1839\n. Agnes' mother Catherine, educated at the Ursuline Convent, Cork, was an intellectual lady with considerable musical talents playing piano and harp. The Clerke family were Protestants while the Deasy family were Roman Catholics.\nTogether with her older sister Ellen\n(\nborn\n1840)\n, Agnes was educated at home by her parents. It was certainly an unusual educational level for girls at this time, perhaps in part due to the emphasis that the Ursuline nuns had placed on educating women, in part due to John's interest in learning. Even at an early stage she showed great interest in the history of astronomy and mathematics and by the age of eleven she had read Herschel's\nOutlines of Astronomy\n. When she was fifteen years old she began to write her own history of astronomy. Agnes's father owned a\n4\n-inch telescope and she grew up regularly observing Saturn's rings and Jupiter's moons.\nThe family moved to Dublin when Clerke was aged\n19\nfor her father changed profession at that stage and became a registrar at the court of his brother-in-law Rickard Deasy who by this time was a High Court Judge. At this time Agnes made university level studies of advanced mathematics, physics and astronomy being tutored by her brother Aubrey who was studying mathematics and physics at Dublin University. At age\n25\nshe went, with her sister Ellen, to Italy where they spent ten years mainly living in Florence where they studied science, acquired literary skills, and became excellent linguists. In\n1877\nthe sisters went to London where the family were reunited. Clerke began publishing in that year when her articles\nBrigandage in Sicily\nand\nCopernicus in Italy\n(\nboth written during her time in Italy\n)\nappeared in the\nEdinburgh Review\n. The first discussed the rise of the Mafia while the second discussed pre-Copernican ideas in Italy. These were the first of\n55\narticles that she published in the\nEdinburgh Review\n.\nThe publishers of the\nEdinburgh Review\nwere Adam and Charles Black of Edinburgh and at this time they were publishing the ninth edition of\nEncyclopaedia Britannica\n. The volumes before G had already been completed so when they invited Clerke to contribute it was to write biographies of famous mathematicians and astronomers whose names began with a letter between G and L. She wrote famous biographies of\nGalileo\n,\nHuygens\n,\nKepler\n,\nLagrange\n,\nLaplace\n, and other scientists for the ninth edition of\nEncyclopaedia Britannica\n. The article on\nLaplace\nis particularly interesting since it discusses his mathematics in considerable depth.\nClerke wrote articles for other encyclopaedias such as the article\nAstronomy\nfor the\nCatholic Encyclopaedia\n. However she is perhaps best known for\nA Popular History of Astronomy during the Nineteenth Century\n(1885)\n. This text was revised three times for four different editions in Clerke's lifetime\n(\nthe last in\n1902)\n. In the Preface she explains that since the publication of a history of astronomy in\n1852\nby Robert Grant:-\n... a so-called \"new astronomy\" has grown up by the side of the old. One aspect of its advent has been to render the science of the heavenly bodies more popular ... than formerly ... . It has thus become practicable to describe in simple language the most essential parts of recent astronomical discoveries.\nIt is an extremely careful, accurate work yet, at the same time, it is easy to read. William Fox writes in\n[\n7\n]\n:-\nHer work is remarkable in a literary as well as in a scientific way. She compiled facts with untiring diligence, sifted them carefully, discussed them with judgment, and suggested problems and lines of future research. All this is expressed in polished, eloquent, and beautiful language.\nWeitzenhoffer writes\n[\n13\n]\n:-\nHer 'Astronomy' was fluently written, had biographies and lively anecdotes, and was as valuable to professional astronomers as to the public.\nRobert Ball\nwrote in a review:-\nWe have read this book with very great interest and no little pleasure. The authoress\n(\nfor this learned volume is indeed the product of a lady's pen\n)\nhas modestly described her 'History of Astronomy' as a 'popular' work. We certainly hope that the book will be as popular as it deserves, and that it will be widely and extensively read. We think, however, that few men of science who use this book will think that it ought to be classed as a popular work in the ordinary acceptance. It might be more correctly described as a masterly exposition of the results of modern astronomy in those departments now usually characterised as physical.\nAlthough Clerke was not a practical astronomer, nor an author of original research articles, she did spend three months at the Royal Observatory at the Cape of Good Hope where she was the guest of the director, Sir David Gill, and his wife. Gill wrote in a letter to Ellen Clerke\n[\n18\n]\n:-\nYour sister sits opposite me in the study with a pile of books on either hand, which is gradually growing till she seems to be coming through a gate with rather badly built pillars on either side. At night she is to be found in the dome of the equatoreal - weather permitting, engaged in flirting with the spectra of variable stars.\nGill's 'weather permitting' comment is put in perspective by Clerke in a letter she wrote at this time:-\nI used an astronomical telescope, but my practice with it was deplorably impeded by cloudy weather, the miseries of which torment I at least learned fully to appreciate.\nAt the Royal Observatory at the Cape of Good Hope she certainly gained sufficient experience of current research to be able to write with authority on the latest developments. However, some research scientists criticised her work believing that only someone who was actively engaged in observational astronomy was entitled to explain the topic to others.\nA Popular History of Astronomy during the Nineteenth Century\nwas only one of many books that Clerke wrote. Among the others we mention\nThe System of the Stars\n(1890)\nwhich made use of the up-to-date techniques she had learnt about at the Royal Observatory at the Cape of Good. She wrote in the Preface that the work was:-\n... an attempt to combine, in a general survey, some definite particulars of knowledge regarding our sidereal surroundings.\nIn fact while Clerke was writing this book she was informally offered an appointment at the Royal Observatory in Greenwich. The position would have given her exclusive use of one of the major telescopes at Greenwich. She expressed great interest but said she would have to complete her writing commitments first. Later she received a formal offer to work at Greenwich but not as an observational astronomer, rather as an assistant to a computer at Greenwich. She was still tempted to accept but realised that there would be\n(\nsee\n[\n4\n]\n)\n:-\n... almost insurmountable difficulties from the fact that Greenwich Park is said to be unsafe for ladies at night ... Nevertheless I feel somewhat sore and sorry at having refused, and so shut out finally a prospect that was not without its attractions for me.\nJust after this, without her knowledge, she was put forward for the position of professor of astronomy at Vassar College in the United States. She was never offered the chair but would almost certainly have refused since her father was in extremely poor health and she \"could not inflict the sorrow upon my parents of separating finally from them.\"\nFurther books followed such as\nThe Herschels and Modern Astronomy\n(1895)\n,\nThe Concise Knowledge Astronomy\n(\nwritten jointly with J E Gore and A Fowler\n)\n(1898)\n,\nProblems in Astrophysics\n(1903)\n, and\nModern Cosmogonies\n(1906)\n. Not all Clerke's writings were on science for she wrote, among several literary contributions, essays on Don Sebastian\n(1882)\n, the letters of Edward Fitzgerald\n(1894)\n, and\nFamiliar Studies in Homer\n(1892)\n.\nClerke wrote\n159\nbiographies for the\nDictionary of National Biography\n. We quote from many of them in this archive, for example those of\nCaroline Herschel\n,\nJohn Herschel\n,\nJohn Landen\n,\nJohn Machin\n,\nRoger Cotes\n,\nAlexander Wilson\n,\nAbraham de Moivre\n,\nWilhelm Bessel\n, and\nGeorge Airy\n.\nFor her exceptional contributions, Clerke was awarded many honours\n[\n7\n]\n:-\nIn\n1892\nthe Royal Institution awarded to her the Actonian Prize of one hundred guineas. As a member of the British Astronomical Association she attended its meetings regularly, as well as those of the\nRoyal Astronomical Society\n. In\n1903\n, with Lady Huggins, she was elected an honorary member of the\nRoyal Astronomical Society\n, a rank previously held only by two other women,\nCaroline Herschel\nand\nMary Somerville\n.\nIn fact\nProblems in Astrophysics\nwas largely responsible for her election to the\nRoyal Astronomical Society\n. The President of the Society,\nJames W L Glaisher\n, announcing Clerke's election said:-\nThe work of Miss Agnes Clerke is similar to that of\nMrs Somerville\n, lying in the domain of scientific writing, and, I may say, with reference to her last work, it is not merely an astronomical history, but a work of actual constructive thinking in our science.\nThe famous eleventh edition of\nEncyclopaedia Britannica\nwas published in\n1910\nand Clerke had been asked to contribute articles on both astronomy and its history. She wrote the main article on the history of astronomy and many biographies of astronomers which appeared in the eleventh edition. However she died of pneumonia following a short illness before being able to complete this task. She died at her home\n68\nRedcliffe Square, London and, three days later, was buried  in Brompton cemetery. Huggins writes in\n[\n12\n]\n:-\nIn all her writings, truth was ever her goal. Astronomy to the last was her chief intellectual interest.",
  "math_areas": [
    "Algebra"
  ]
}