{
  "nome_completo": "Åke Vilhelm Carl Pleijel",
  "nome_curto": "Åke Pleijel",
  "ano_nascimento": "1913",
  "ano_morte": "1989",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Pleijel/",
  "lugar_nascimento": "Johannes parish, Stockholm, Sweden",
  "lugar_morte": "Västerled parish, Stockholm, Sweden",
  "biografia": "Åke Pleijel\nwas the son of Henning Bernhard Mathias\nPleijel\n(1873\n-\n1962)\nand Eva Hilda Katarina Bergenström\n(1877\n-\n1957)\n, daughter of Carl Theodor Bergenström, a utility manager, and Caroline Margareta Brandtberg. Henning Mathias was a physicist and electrical engineer who, at the time his son was born, was a professor at the Telegraph Board, and in the following year was made a professor in theoretical electrical engineering at the School of Electronics at the Royal Institute of Technology in Stockholm\n[\n3\n]\n:-\nIn his scientific activities, Henning Pleijel studied technical problems, and primarily he dealt with theoretical electrotechnical issues with telegraph and telephone lines as a specialty. His area of interest meant that his research sometimes led to technical improvements, many of which resulted in financial gains.\nHenning married Eva on\n6\nAugust\n1907\nin Klara, Stockholm. They had two children, Märta Laura Carolina Pleijel\n(1911\n-\n2004)\nand Åke Vilhelm Carl Pleijel, the subject of this biography.\nPleijel graduated from the high school in Östermalm, Stockholm on\n11\nMay\n1932\nand enrolled at Stockholm University on\n23\nMay\n32\n. He was awarded the FK degree\n(\nthe Filosofie kandidat degree is essentially equivalent to the B.Sc.\n)\non\n30\nMay\n1933\n. He then held various teaching positions at different educational institutions in Stockholm while continuing his studies at Stockholm University. He was awarded the FM degree\n(\nthe Filosofie magister degree is essentially equivalent to the M.Sc.\n)\non\n6\nMarch\n1937\n, and an FL degree\n(\nFilosofie licentiat is a Licentiate degree, more advanced than a Master but below a Ph.D.\n)\non\n5\nNovember\n1938\n.\nAfter graduating with his first degree, Pleijel began undertaking research advised by\nTorsten Carleman\n. He was soon publishing papers in both French and German:\nSur la théorie des corps centrobares\nⓉ\n(\nOn the theory of the centrobaric bodies\n)\n(1934)\n,\nÜber asymptotische Reihenentwicklungen in der Operatorenrechnung\nⓉ\n(\nOn asymptotic series developments in operator calculus\n)\n(1935)\n,\nEine hydrodynamische Randwertaufgabe\nⓉ\n(\nA hydrodynamic boundary value task\n)\n(1936)\n,\nEine hydrodynamische Randwertaufgabe\nⓉ\n(\nA hydrodynamic boundary value task\n)\n(1937)\n,\nSur les propriétés asymptotiques des fonctions propres des plaques vibrantes\nⓉ\n(\nOn the asymptotic properties of the eigenfunctions of the vibrating plates\n)\n(1939)\n,\nPropriétés asymptotiques des fonctions fondamentales du problème des vibrations dans un corps élastique\nⓉ\n(\nAsymptotic properties of the fundamental functions of the problem of vibrations in an elastic body\n)\n(1939)\nand\nSur les propriétés asymptotiques des fonctions et valeurs propres des plaques vibrantes\nⓉ\n(\nOn the asymptotic properties of the functions and eigenvalues of the vibrating plates\n)\n(1939)\n. He was awarded a Ph.D. on\n30\nMay\n1940\nfor his\n101\n-page thesis\nPropriétes asymptotiques des fonctions et valeur propres de certain problèmes de vibrations\nⓉ\n(\nAsymptotic properties of the functions and eigenvalues of certain vibration problems\n)\n.\nHis main mathematical interest was in the treatment of problems that originated in physics. Tord Ganelius writes in\n[\n2\n]\nthat in his doctoral thesis:-\n... Pleijel extended his investigations on the asymptotic behaviour of eigenvalues and eigenfunctions for certain oscillation problems to a number of other areas, including strained plates. During the first decades of the\n20\nth century,\nHermann Weyl\nand\nRichard Courant\nhad studied how self-frequencies depend on the geometry of the swinging body.\nCarleman\nintroduced a new method that reversed the problem on a so-called Tauberian theorem, a type of theorem that was studied throughout the\n20\nth century but which was renewed in relevance through the work of\nNorbert Wiener\naround\n1930\n.\nPleijel had married while he was teaching mathematics and studying for his doctorate. He married the author Sonja Anna Stina Berg on\n27\nNovember\n1937\n. Sonja had been born on\n23\nSeptember\n1909\nin Surabaya, Java, Indonesia to Allan Erik Berg and Caroline Christine van der Velde. Åke and Sonja Pleijel had three children, all daughters, Agneta Christina Pleijel\n(\nborn\n26\nFebruary\n1940)\n, Sonja Carolina Pleijel\n(\nborn\n3\nAugust\n1942)\n, and Eva Maria Pleijel\n(\nborn\n31\nMarch\n1945)\n. Let us record at this point that Agneta Christina Pleijel became an author, poet, playwright, journalist and literary critic; Sonja Carolina Pleijel studied at Lund University and became a TV producer, director and screenwriter.\nOn\n14\nSeptember\n1940\nPleijel was appointed as a\ndocent\nin mathematics and an assistant in the mathematics library at the University of Stockholm, a position he held until he was appointed as a docent at Lund University on\n25\nApril\n1941\n. After seven years in Lund, he was back in Stockholm when he was appointed as professor of mathematics on\n22\nOctober\n1948\n. It is not quite correct to say that he was in Lund for seven years for, although he held the position in Lund for that time, he spent the last of these years at the Institute for Advanced Study in Princeton, USA. Pleijel, his wife and three daughters sailed on the Drottningholm from Gothenburg, Sweden to New York, USA arriving on\n15\nSeptember\n1947\n.\nWhile at Princeton, Pleijel worked with\nSubbaramiah Minakshisundaram\n(1913\n-\n1968)\n, an Indian mathematician with an expertise in parabolic partial differential equations. They collaborated on writing the paper\nSome properties of the eigenfunctions of the Laplace-operator on Riemannian manifolds\n(1949)\n.\nSalomon Bochner\nwrites in a review:-\nThis paper offers an extension of a method of\nCarleman\n's from a Euclidean to a curvilinear setup, and the results of\nCarleman\nhave been both generalized and added to; an important tool of investigation is\nHilbert\n's parametrix.\nIn fact, the paper contains the famous zeta function, now called the\nMinakshisundaram\n-Pleijel zeta function, which is a zeta function encoding the eigenvalues of the Laplacian of a compact Riemannian manifold.\nAfter his year at the Institute for Advanced Study, the family returned to Sweden, sailing from New York to Gothenburg, Sweden departing on\n4\nDecember\n1948\n.\nBack in Sweden, Pleijel took up his appointment as professor of mathematics at the Royal Institute of Technology in Stockholm on\n1\nJanuary\n1949\n, where he succeeded Johannes Malmquist, who had retired in\n1948\n. Pleijel had actually been appointed to this position on\n22\nOctober\n1948\nwhile he was at Princeton.\nWe quote from\n[\n2\n]\nregarding the situation in mathematics in Sweden when Pleijel  was appointed to the chair in Lund:-\nWhen Pleijel became professor in\n1949\n, there were only eight professorships in Sweden in the unrestricted subject of mathematics .... However, the investment in science and technology after\n1945\nled to a rapid increase in the number of students and the number of professors in mathematics. In addition, courses were added in special parts of the subject, such as applied mathematics, mathematical statistics and numerical analysis. For the mathematics subjects at the technical colleges, the changes resulted, in among other things, increased demand for courses in mathematics as a subject in the so-called licentiate degree. Pleijel  took great interest in the creation of courses suitable for this purpose, but he left the Royal Institute of Technology in Stockholm as early as\n1952\nto succeed his future father-in-law, Professor\nMarcel Riesz\n, upon his retirement from Lund University.\nAppointed professor of mathematics at Lund University on\n4\nAugust\n1952\n, he took up the appointment on\n1\nDecember that year. He served as dean of the Faculty of Mathematical and Natural Sciences from\n1\nJuly\n1957\nto\n30\nNovember\n1961\nand served again in the academic year\n1964\n-\n1965\n. The\n1959\nInternational Handbook of Universities\nlists Lund University with Åke Pleijel as Dean of the Faculty of Mathematics and Natural Sciences with a staff of\n102\n. It gives the following details about Lund University:-\nFounded\n1666\nas a State university. Closed\n1676\nduring the war with Denmark, reopened\n1682\n. The university is operated under the supervision of the Chancellor of Swedish Universities. Governing bodies : det Storre Akademiska Konsistoriet\n(\nConsistorium Academicum Majus\n)\nand det Mindre Akademiska Konsistoriet\n(\nConsistorium Academicum Minus\n)\n. The Rector and Vice-Rector hold office for a period of three years and are elected by the assembly of academic teachers.\nHe became the second President of the\nSwedish Mathematical Society\n, holding this position from\n1952\nto\n1957\n, and served as an editor for\nMathematica Scandinavica\nfrom\n1953\nto\n1965\n. He was chair of the Swedish National Committee for Mathematics in\n1954\n. During his time in Lund he was also an inspector for the Småland region. He served on the\nFields\nMedal Committee\n1954\nwhich was chaired by\nHerman Weyl\nand made awards of\nFields\nMedals to\nK Kodaira\nand\nJ P Serre\n.\nAt a session on\n28\nOctober\n1958\nthe Swedish National Committee for Mathematics decided to accept the invitation, conveyed by the\nInternational Mathematical Union\n, to organise the next International Congress of Mathematicians in Stockholm in\n1962\n. This decision was endorsed by the\nSwedish Mathematical Society\non\n30\nNovember\n1958\nand a joint invitation was issued to the mathematicians of the world, signed by the chairmen of the National Committee and the Society, A Pleijel and\nG Borg\n. O Frostman and A Pleijel were entrusted with the initial preparations for the congress together with\nH Cramer\n, at that time Chancellor of the Universities of Sweden, and Lars Gårding, all of whom later constituted the Organising Committee.\nFrom\n1965\nto\n1967\nPleijel went to Ethiopia as a representative of UNESCO. During this time he made a considerable contribution to the development of higher education in mathematics in Ethiopia. He also returned to Addis Ababa for two years after his retirement from Uppsala from\n1980\nto\n1982\n. Pleijel authored several textbooks for Ethiopians and, perhaps most importantly, he managed to interest some young Ethiopians in mathematical research.\nOn\n30\nJune\n1967\n, Pleijel was appointed as Professor of Mathematics at the University of Uppsala. In fact\n1967\nwas a major year in his personal life since in that year he was divorced from his first wife Sonja and, on\n12\nDecember of that year, he married Margit Ingrid Riesz at Västerled, Stockholm. Margit, a Director of Information, had been born on\n27\nJuly\n1917\nto\nMarcel Riesz\nand Sofia\n(\nSophie\n)\nJustina Albertina Eriksson. It was also Margit's second marriage, having married Stig Hilding Hammar on\n13\nAugust\n1944\n.\nAt the University of Uppsala, Pleijel was dean of the Faculty of Mathematical and Natural Sciences from the autumn term of\n1971\nto the spring term of\n1973\n. He retired from his professorship in\n1979\nand was made professor emeritus. On\n3\nMarch\n1975\nhe was elected as an Honorary Member of the\nRoyal Society of Edinburgh\n. Tord Ganelius writes in\n[\n2\n]\n:-\nSome of Pleijel's work on ordinary differential equations in recent years deals with\nWeyl\n's theory of boundary point and boundary circle. In this area, a collaboration developed with the University of Edinburgh, in which several of Pleijel's co-workers in Uppsala participated. One sign of great appreciation from the Scottish partner was the election of Pleijel as member of the\nRoyal Society of Edinburgh\n.\nPleijel published around\n50\npapers on topics such as: Differential equations, operational calculus; Ordinary differential equations; Partial differential equations, and Potential theory. Several of the mathematical concepts that Pleijel introduced are now known by his name and have been the subject of many papers. These include, in addition to the\nMinakshisundaram\n-Pleijel zeta function we mentioned above, the \"Pleijel's nodal domain theorem\", the \"Pleijel's constant\", \"Pleijel's estimate\", the \"Pleijel inequality\", and the \"Pleijel identity\". He has published obituaries of\nAnders Wiman\n, Johannes Malmquist, Nils Erik Fremberg and\nIvar Fredholm\n.\nFollowing his death in\n1989\nhe was buried in the Northern Cemetery in Lund.",
  "math_areas": [
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}