{
  "nome_completo": "Abu Abdallah Mohammad ibn Jabir Al-Battani",
  "nome_curto": "Al-Battani",
  "ano_nascimento": "868",
  "ano_morte": "929",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Battani/",
  "lugar_nascimento": "Harran (near Urfa), Mesopotamia (now Turkey)",
  "lugar_morte": "Qasr al-Jiss, Iraq",
  "biografia": "Al-Battani\nis sometimes known by a latinised version of his name, variants being\nAlbategnius, Albategni\nor\nAlbatenius.\nHis full name was Abu Abdallah Mohammad ibn Jabir ibn Sinan al-Raqqi al-Harrani al-Sabi al-Battani.\nAl-Battani was born in Harran, called Carrhae in earlier times by the Romans, which lies on the Balikh River,\n38\nkm southeast of Urfa. His family had been members of the Sabian sect, a religious sect of star worshippers from Harran. Being worshipers of the stars meant that the Sabians had a strong motivation for the study of astronomy and they produced many outstanding astronomers and mathematicians such as\nThabit ibn Qurra\n. In fact\nThabit\nwas also born in Harran and would have still have been living there at the time that al-Battani was born. Al-Battani, unlike\nThabit\n, was not a believer in the Sabian religion, however, for \"Abu Abdallah Mohammad\" indicates that he was certainly a Muslim.\nAlthough the identification is not absolutely certain, it is probable that al-Battani's father was Jabir ibn Sinan al-Harrani who had a high reputation as an instrument maker in Harran. The name certainly makes the identification fairly certain and the fact that al-Battani himself was skilled in making astronomical instruments is a good indication that he learnt these skills from his father.\nAl-Battani made his remarkably accurate astronomical observations at Antioch and ar-Raqqah in Syria. The town of ar-Raqqah, where most of al-Battani's observations were made, became prosperous when Harun al-Rashid, who became the fifth Caliph of the Abbasid dynasty on\n14\nSeptember\n786\n, built several palaces there. The town had been renamed al-Rashid at that time but, by the time al-Battani began observing there, it had reverted to the name of ar-Raqqah. The town was on the Euphrates River just west of where it joins the Balikh River\n(\non which Harran stands\n)\n.\nThe\nFihrist\n(\nIndex\n)\nwas a work compiled by the bookseller Ibn an-Nadim in\n988\n. It gives a full account of the Arabic literature which was available in the\n10\nth\ncentury and it describes briefly some of the authors of this literature. The\nFihrist\ndescribes al-Battani as\n(\nsee for example\n[\n1\n]\n)\n:-\n... one of the famous observers and a leader in geometry, theoretical and practical astronomy, and astrology. He composed a work on astronomy, with tables, containing his own observations of the sun and moon and a more accurate description of their motions than that given in\nPtolemy\n's \"Almagest\"\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. In it moreover, he gives the motions of the five planets, with the improved observations he succeeded in making, as well as other necessary astronomical calculations. Some of his observations mentioned in his book of tables were made in the year\n880\nand later on in the year\n900\n. Nobody is known in Islam who reached similar perfection in observing the stars and scrutinising their motions. Apart from this, he took great interest in astrology, which led him to write on this subject too: of his compositions in this field I mention his commentary on\nPtolemy\n's Tetrabiblos.\nOther information about al-Battani contained in the\nFihrist\nis that he observed between the years\n877\nand\n918\nand that his star catalogue is based on the year\n880\n. It also describes the end of his life which seems to have occurred during a journey he made to Baghdad to protest on behalf of a group of people from ar-Raqqah because they had been unfairly taxed. Al-Battani reached Baghdad and put his arguments but died on the return journey to ar-Raqqah.\nThe\nFihrist\nalso quotes a number of works by al-Battani. There is his\nKitab al-Zij\nwhich is his major work on astronomy with tables, referred to above. We shall examine this in more detail in a moment. There is also the commentary on\nPtolemy\n's\nTetrabiblos\nreferred to above and two other titles:\nOn\nascensions\nof the signs of the\nzodiac\nand\nOn the quantities of the astrological applications\n. One of the chapters of the\nKitab al-Zij\nhas the title \"On ascensions of the signs of the zodiac\" and so the\nFihrist\nmay be wrong in thinking this is a separate work. This point still appears unclear.\nAl-Battani's\nKitab al-Zij\nis by far his most important work and we should examine briefly the topics which it covered. The work contained\n57\nchapters. It begins with a description of the division of the\ncelestial sphere\ninto the signs of the zodiac and into degrees. The necessary background mathematical tools are then introduced such as the arithmetical operations on\nsexagesimal\nfractions and the trigonometric functions. Chapter\n4\ncontains data from al-Battani's own observations. Chapters\n5\nto\n26\ndiscuss a large number of different astronomical problems following to some extent material from the\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\n. The motions of the sun, moon and five planets are discussed in chapters\n27\nto\n31\n, where the theory given is that of\nPtolemy\nbut for al-Battani the theory appears less important than the practical aspects.\nAfter giving results to allow data given for one era to be converted to another era, al-Battani then gives\n16\nchapters which explain how his tables are to be read. Chapters\n49\nto\n55\ncover problems in astrology, while chapter\n56\ndiscusses the construction of a sundial and the final chapter discusses the construction of a number of astronomical instruments.\nWhat are the main achievements of al-Battani's Zij? He catalogued\n489\nstars. He refined the existing values for the length of the year, which he gave as\n365\ndays\n5\nhours\n46\nminutes\n24\nseconds, and of the seasons. He calculated\n54\n.\n5\n\" per year for the\nprecession of the equinoxes\nand obtained the value of\n23\n°\n35\n' for the\ninclination of the ecliptic\n.\nRather than using geometrical methods, as\nPtolemy\nhad done, al-Battani used trigonometrical methods which were an important advance. For example he gives important trigonometric formulae for right angled triangles such as\nb\nsin\n⁡\n(\nA\n)\n=\na\nsin\n⁡\n(\n90\n°\n−\nA\n)\nb \\sin(A) = a \\sin(90° - A)\nb\nsin\n(\nA\n)\n=\na\nsin\n(\n9\n0\n°\n−\nA\n)\n.\nAl-Battani showed that the farthest distance of the Sun from the Earth varies and, as a result,\nannular eclipses\nof the Sun are possible as well as total eclipses. However, as Swerdlow points out in\n[\n8\n]\n, the influence of\nPtolemy\nwas remarkably strong on all medieval authors, and even a brilliant scientist like al-Battani probably did not dare to claim a different value of the distance from the Earth to the Sun from that given by\nPtolemy\n. This was despite the fact that al-Battani could deduce a value for the distance from his own observations that differed greatly from\nPtolemy\n's.\nIn\n[\n1\n]\nHartner gives a somewhat different opinion of the way that al-Battani is influenced by\nPtolemy\n. He writes:-\nWhile al-Battani takes no critical attitude towards the Ptolemaic kinematics in general, he evidences ... a very sound scepticism in regard to\nPtolemy\n's practical results. Thus, relying on his own observations, he corrects - be it tacitly, be it in open words -\nPtolemy\n's errors. This concerns the main parameters of planetary motion no less than erroneous conclusions drawn from insufficient or faulty observations, such as the invariability of the\nobliquity of the ecliptic\nor of the solar\napogee\n.\nAl-Battani is important in the development of science for a number of reasons, but one of these must be the large influence his work had on scientists such as\nTycho Brahe\n,\nKepler\n,\nGalileo\nand\nCopernicus\n. In\n[\n5\n]\nthere is a discussion on how al-Battani managed to produce more accurate measurements of the motion of the sun than did\nCopernicus\n. The author suggests that al-Battani obtained much more accurate results simply because his observations were made from a more southerly latitude. For al-Battani\nrefraction\nhad little effect on his meridian observations at the winter\nsolstice\nbecause, at his more southerly site of ar-Raqqah, the sun was higher in the sky.\nAl-Battani's\nKitab al-Zij\nwas translated into Latin as\nDe motu stellarum\nⓉ\n(\nOn the motion of the stars\n)\nby Plato of Tivoli. This appeared in\n1116\nwhile a printed edition of Plato of Tivoi's translation appeared in\n1537\nand then again in\n1645\n. A Spanish translation was made in the\n13\nth\ncentury and both it and Plato of Tivoli's Latin translation have survived.",
  "math_areas": []
}