{
  "nome_completo": "Abu Abd Allah Muhammad ibn Muadh Al-Jayyani",
  "nome_curto": "al-Jayyani",
  "ano_nascimento": "989",
  "ano_morte": "1079",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Jayyani/",
  "lugar_nascimento": "Cordoba, Andalusia (now Spain)",
  "lugar_morte": "possibly Jaén, Andalusia (now Spain)",
  "biografia": "Little is known of\nal-Jayyani\n's life. Even the identification of al-Jayyani the mathematician with al-Jayyani the Spanish scholar who was born in Cordoba in\n989\nis not absolutely certain. Everything points to this identification being correct except one\n(\npossible\n)\nproblem.\nThe Spanish scholar who was born in Cordoba has exactly the same name as the mathematician, and the Spanish scholar is described as an expert in the Qur'an, also being knowledgeable in Arabic philology, inheritance laws and arithmetic. Al-Jayyani, the mathematician, is described as a judge and a jurist in one of his treatises. The only possible problem to the identification is that al-Jayyani wrote a treatise on the total solar eclipse which occurred in Jaén on\n1\nJuly\n1079\n. The identification means that he was over ninety years old when he wrote this treatise which, although certainly not impossible, casts a slight doubt.\nThe only other facts known about al-Jayyani's life are that he lived in Cairo from\n1012\nto\n1017\nand that he must have undertaken most of his work in Jaén, the city at the centre of the Moorish principality of Jayyan. This cannot only be deduced from his name \"al-Jayyani\" which means \"from Jaén\", but also from the fact that the astronomical tables that he produced were for the longitude of Jaén. Certainly he observed the solar eclipse in Jaén in\n1079\n.\nAl-Jayyani's work\nOn ratio\nis almost certainly his most interesting mathematical work. An English translation of this remarkable treatise is given in\n[\n2\n]\n. In this work al-Jayyani sets out to defend\nEuclid\n's\nElements\nBook V. In\n[\n7\n]\nVahabzadeh writes:-\nEuclid\n's definition, in Book V of his \"Elements\", of the proportionality of four magnitudes gave rise to numerous commentaries. Of these we have selected two\n[\none being al-Jayyani's\n]\nwhose goal was not to criticise\nEuclid\n's point of view but rather to justify it by trying to make explicit the assumptions underlying\nEuclid\n's argument.\nAl-Jayyani states that he is writing the treatise\nOn ratio\n(\nsee for example\n[\n1\n]\n)\n:-\n... to explain what may not be clear in the fifth book of\nEuclid\n's writing to such as are not satisfied with it.\nThere are five magnitudes that, according to al-Jayyani, are used in geometry; number, line, surface, angle, and solid. Neither\nEuclid\nnor any other Greek mathematician would have considered \"number\" as a geometrical magnitude, but al-Jayyani needs the notion for his definition of ratio which follows the Arabic idea of number. After assuming that every intelligent person has a basic understanding of ratio, al-Jayyani deduces further properties based on this \"commonly understood definition\". To justify his approach he writes:-\nThere is no method to make clear what is already clear in itself.\nHe then connects this idea of ratio with that given by\nEuclid\n. The authors of\n[\n1\n]\nwrite:-\nAl-Jayyani shows here an understanding comparable with that of\nIsaac Barrow\n, who is customarily regarded as the first to have really understood\nEuclid\n's Book V.\nAnother work of great importance is al-Jayyani's\nThe book of unknown arcs of a sphere\n, the first treatise on spherical trigonometry. The work, which is published together with a Spanish translation and a commentary in\n[\n3\n]\n, contains formulae for right-handed triangles, the general law of sines, and the solution of a spherical triangle by means of the polar triangle. Proofs are sometimes only given as sketches. Debarnot, in his review of\n[\n3\n]\n, argues however that Villuendas:-\n... in his commentary ... fails to take the originality of the Determination of the magnitudes sufficiently into account.\nAl-Jayyani was to have a strong influence on European mathematics. In addition to translations of his works from the Arabic, his work influenced certain European mathematicians. The article\n[\n4\n]\nargues that one of\nRegiomontanus\nsources was\nThe book of unknown arcs of a sphere\n. Among the similarities between al-Jayyani's treatise and that of\nRegiomontanus\nare the definition of ratios as numbers, the lack of a tangent function, and a similar method of solving a spherical triangle when all sides are unknown.\nHowever, the author of\n[\n4\n]\nremarks that there are some marked differences in approach between al-Jayyani and\nRegiomontanus\n, such as the proof of the spherical sign law. Although it is certain that\nRegiomontanus\nbased his treatise on Arabic works on spherical trigonometry it may well be that al-Jayyani's work was only one of many such sources.\nThe article\n[\n6\n]\ndescribes the treatise\nKitab al-asrar fi nata'ij al-Afkar\n(\nThe book of secrets about the results of thoughts\n)\n, attributed to al-Jayyani on the basis of internal evidence together with its date. The work studies hydraulics and water clocks.\nWork by al-Jayyani on astronomy was also important. He wrote on the morning and evening twilight, computing the fairly accurate value of\n18\n° for the angle of the sun below the horizon at the start on morning twilight and at the end of the evening twilight.\nIn the\nTabulae Jahen\nal-Jayyani gave data to enable the calculation of the time of day, the calendar, the new moon, eclipses and information required for the timing and direction for prayers. As was common at this time, not only was there astronomical information in the work but also astrological information on horoscopes. Al-Jayyani seems to have considerable respect for\nal-Khwarizmi\n's astronomical data, which he freely used, but he rejects the ideas of\nal-Khwarizmi\non astrology. Much of al-Jayyani's astrology is based on Hindu sources.",
  "math_areas": [
    "Logic"
  ]
}