{
  "nome_completo": "Abu Jafar Muhammad ibn al-Hasan Al-Khazin",
  "nome_curto": "al-Khazin",
  "ano_nascimento": "900",
  "ano_morte": "971",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Khazin/",
  "lugar_nascimento": "Khurasan (eastern Iran)",
  "lugar_morte": "possibly Rayy",
  "biografia": "Abu Jafar al-Khazin\nmay have worked on both astronomy and\nnumber theory\nor there may have been two mathematicians both working around the same period, one working on astronomy and one on number theory. As far as this article is concerned we will assume that al-Khazin worked on both topics. There seems no way of being certain which position is correct.\nAl-Khazin's family were from Saba, a kingdom in southwestern Arabia, perhaps better known as Sheba from the biblical story of King Solomon and the Queen of Sheba. In the\nFihrist\n, a tenth century survey of Islamic culture, he is described Al-Khurasani which means that he came from Khurasan in eastern Iran.\nThe Buyid dynasty, ruling in western Iran and Iraq, reach its peak around the time that al-Khazin lived. It undertook public schemes such as building hospitals and dams, as well as patronising the arts and sciences. Rayy, situated southeast of present day Tehran, was one of the major cultural centres of the Buyid dynasty. Islamic writers described Rayy as:-\n... a city of extraordinary beauty, built largely of fired brick and brilliantly ornamented with blue faience\n(\nglazed earthenware\n)\n.\nAl-Khazin was one of the scientists brought to the court in Rayy by the ruler of the Buyid dynasty, Adud ad-Dawlah, who ruled from\n949\nto\n983\n. We know that in\n959\n/\n960\nal-Khazin was required by the vizier of Rayy, who was appointed by Adud ad-Dawlah, to measure the\nobliquity of the ecliptic\n(\nthe angle which the plane in which the sun appears to move makes with the equator of the earth\n)\n. He is said to have made the measurement:-\n... using a ring of about\n4\nmeters.\nOne of al-Khazin's works\nZij al-Safa'ih\n(\nTables of the disks of the\nastrolabe\n)\nwas described by his successors as the best work in the field and they make many reference to it. The work describes some astronomical instruments, in particular it describes an astrolabe fitted with plates inscribed with tables and a commentary on the use of these. A copy of this instrument was made but vanished in Germany at the time of World War II. A photograph of this copy was taken and the article\n[\n5\n]\nexamines this.\nAl-Khazin wrote a commentary on\nPtolemy\n's\nAlmagest\nⓉ\n(\nThe major thesis: from the Arabic 'al-majisti' -- the Arabic translation of the Greek 'Mathematike Syntaxis' later translated into Latin as 'Magna Syntaxis'\n)\nwhich was criticised by\nal-Biruni\nfor being too verbose. Only one fragment of this commentary has survived and a translation of it is given in\n[\n6\n]\n. The fragment which has survived contains a discussion by al-Khazin of\nPtolemy\n's argument that the universe is spherical.\nPtolemy\nwrote\n[\n6\n]\n:-\n.. of different figures of equal perimeter, the one with more angles is greater in capacity, and therefore it is necessary that a circle is the greatest of surfaces\n(\ni.e. of all plane figures with a constant perimeter\n)\nand the sphere the greatest of solids.\nAl-Khazin gives\n19\npropositions relating to this statement by\nPtolemy\n. The most interesting results show, with a very ingenious proof, that an equilateral triangle has a greater area than any isosceles or scalene triangle with the same perimeter. When he tries to generalise this result to polygons, however, al-Khazin gives incorrect proofs. Other results among the\n19\nare based on propositions given by\nArchimedes\nin\nOn the sphere and cylinder\n. The author of\n[\n6\n]\nargues that the ingenious results on triangles are unlikely to be due to al-Khazin but are probably taken by him from some unknown source.\nThe suggestion in\n[\n6\n]\nthat al-Khazin is a third rate mathematician is somewhat doubtful given his work on number theory but as we stated at the beginning of this article, it is possible that there were two mathematicians of the same name. The papers\n[\n4\n]\n,\n[\n9\n]\nand\n[\n7\n]\nall look at this number theory work by al-Khazin\n(\nsee also\n[\n2\n]\nand\n[\n3\n]\n)\n. The work of al-Khazin which is described seems to have been motivated by work of a mathematician by the name of\nal-Khujandi\n.\nAl-Khujandi\nclaimed to have proved that\nx\n3\n+\ny\n3\n=\nz\n3\nx^{3} + y^{3} = z^{3}\nx\n3\n+\ny\n3\n=\nz\n3\nis impossible for whole numbers\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nwhich of course is the\nn\n=\n3\nn = 3\nn\n=\n3\ncase of\nFermat's Last Theorem\n. In a letter al-Khazin wrote:-\nI demonstrate earlier ... that what Abu Muhammad\nal-Khujandi\nadvanced - may God have mercy on him - in his demonstration that the sum of two cubic numbers is not a cube is defective and incorrect.\nThis seems to have motivated further correspondence on number theory between al-Khazin and other Arabic mathematicians. Results by al-Khazin here are interesting indeed. His main result is to:-\n... show how, if we are given a number, to find a\nsquare number\nso that if the given number were added to it or subtracted from it the result would be square.\nIn modern notation the problem is given a natural number\na\na\na\n, find natural numbers\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nso that\nx\n2\n+\na\n=\ny\n2\nx^{2} + a = y^{2}\nx\n2\n+\na\n=\ny\n2\nand\nx\n2\n−\na\n=\nz\n2\nx^{2} - a = z^{2}\nx\n2\n−\na\n=\nz\n2\n. Al-Khazin proves that the existence of\nx\n,\ny\n,\nz\nx, y, z\nx\n,\ny\n,\nz\nwith these properties is equivalent to the existence of natural numbers\nu\n,\nv\nu, v\nu\n,\nv\nwith\na\n=\n2\nu\nv\na = 2uv\na\n=\n2\nu\nv\n, and\nu\n2\n+\nv\n2\nu^{2} + v^{2}\nu\n2\n+\nv\n2\nis a square\n(\nin fact\nu\n2\n+\nv\n2\n=\nx\n2\nu^{2} + v^{2} = x^{2}\nu\n2\n+\nv\n2\n=\nx\n2\n)\n. The smallest example of a satisfying these conditions is\n24\nwhich al-Khazin gives\n5\n2\n+\n24\n=\n7\n2\n,\n5\n2\n−\n24\n=\n1\n2\n.\n5^{2} + 24 = 7^{2}, 5^{2} - 24 = 1^{2}.\n5\n2\n+\n2\n4\n=\n7\n2\n,\n5\n2\n−\n2\n4\n=\n1\n2\n.\nHe also gives\na\n=\n96\na = 96\na\n=\n9\n6\nwith\n1\n0\n2\n+\n96\n=\n1\n4\n2\n,\n1\n0\n2\n−\n96\n=\n2\n2\n10^{2} + 96 = 14^{2}, 10^{2} - 96 = 2^{2}\n1\n0\n2\n+\n9\n6\n=\n1\n4\n2\n,\n1\n0\n2\n−\n9\n6\n=\n2\n2\nalthough, rather strangely, he seems to discount this case by another of his statements. Rashed suggests this may be because\n96\n=\n2\n×\n48\n=\n2\n×\n6\n×\n8\na\nn\nd\n6\n2\n+\n8\n2\n=\n1\n0\n2\n96 = 2 \\times  48 = 2 \\times  6 \\times  8 and 6^{2} + 8^{2} = 10^{2}\n9\n6\n=\n2\n×\n4\n8\n=\n2\n×\n6\n×\n8\na\nn\nd\n6\n2\n+\n8\n2\n=\n1\n0\n2\nis not a primitive Pythagorean triple.\nThere is a mystery which Rashed notes in\n[\n7\n]\n(\nalso in\n[\n2\n]\nand\n[\n3\n]\n)\n. This relates to the quote above by al-Khazin regarding the false proof by\nal-Khujandi\nof the impossibility of proving\nx\n3\n+\ny\n3\n=\nz\n3\nx^{3} + y^{3} = z^{3}\nx\n3\n+\ny\n3\n=\nz\n3\n. Rashed has discovered a manuscript which appears to be by al-Khazin, yet contains exactly what he had attributed to\nal-Khujandi\n. Although al-Khazin could have realised the error in\nal-Khujandi\n's proof and attempted a similar proof himself which he believed correct, there is no really satisfactory explanation of these facts.\nFinally we should mention that al-Khazin proposed a different solar model from that of\nPtolemy\n.\nPtolemy\nhad the sun moving in uniform circular motion about a centre which was not the earth. Al-Khazin was unhappy with this model since he claimed that if this were the case then the apparent diameter of the sun would vary throughout the year and observation showed that this were not the case. Of course the apparent diameter of the sun does vary but by too small an amount to be observed by al-Khazin. To get round this problem, al-Khazin proposed a model in which the sun moved in a circle which was centred on the earth, but its motion was not uniform about the centre, rather it was uniform about another point\n(\ncalled the excentre\n)\n.",
  "math_areas": [
    "Algebra",
    "Logic",
    "Number Theory"
  ]
}