{
  "nome_completo": "Abu'l Hasan ibn Ali al Qalasadi",
  "nome_curto": "Al-Qalasadi",
  "ano_nascimento": "1412",
  "ano_morte": "1486",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Qalasadi/",
  "lugar_nascimento": "Bastah (now Baza, Spain)",
  "lugar_morte": "Béja, Tunisia",
  "biografia": "Al-Qalasadi\n(\nor\nal-Kalasadi,\nas it is sometimes written\n)\nwas born in Bastah, a Moorish city in Andalusia, now a part of Spain. Andalusia was derived from the Arabic name al-Andalus which was originally applied by the Muslims to the whole of present day Spain and Portugal, an area which they occupied from the\n8\nth\nCentury. In the\n11\nth\nCentury Christians began to retake the area, slowly moving down from the north and east. Andalusia was then the name applied to the region remaining under Muslim rule.\nThe Christian reconquest took four hundred years. Andalusia had prospered during the\n13\nth\ncentury and the Alhambra, a wonderful palace and fortress of the rulers of Granada, was largely completed by\n1360\n. The Christian kingdom of Castile to the north had suffered civil strife through the\n14\nth\nCentury, so Andalusia had prospered but, in\n1407\n, five years before al-Qalasadi was born, Castile began a major push to conquer the whole of Spain and Portugal.\nAl-Qalasadi was a Muslim who was brought up in Bastah which is north-east of Granada city. It must have been a difficult period in which to live in Bastah, with a steady, yet intermittent, encroachment of Castile towards the city. Al-Qalasadi began his education in Bastah, studying law, the Qur'an and the science of fixed shares in an estate. He moved south, away from the war zone, to Granada where he continued his studies, in particular philosophy, science and Muslim law.\nAl-Qalasadi chose to remain in the Islamic world and he left Granada and travelled widely throughout Islamic territory. In particular he spent much time in the North Africa, living in Islamic countries which had supported Andalusia, both with political and with military aid in its resistance to the Christian attacks. He spent some time in Tlemcen\n(\nnow in northwestern Algeria, near the Moroccan border\n)\nwhere he studied under teachers who taught him arithmetic and its applications. Form there al-Qalasadi went to Egypt where again he studied with some of the leading scholars. Eventually al-Qalasadi reached Mecca, the purpose of his pilgrimage, and returned to Granada.\nThings were in a bad way when al-Qalasadi returned to Granada. The last remaining parts of the Muslim state were under severe attack from the Christians of Aragon and Castile. However, al-Qalasadi taught and wrote some of his major works during this period but eventually the advancing Christian armies made life impossible for him. Al-Qalasadi\n[\n5\n]\n:-\nCourageously ... exerted himself in trying to organise resistance, but he was soon forced to join the Andalusian hordes of refugees that were spreading over the Maghrib.\nThe defeat of the whole Muslim state in Granada finally took place until\n1492\n, six years after al-Qalasadi's death in North Africa, when the city of Granada fell to Christian Castile.\nIn\n[\n2\n]\nal-Qalasadi is described as a specialist in the apportioning of inheritances who took the first steps toward the introduction of algebraic symbolism. His contributions to algebraic symbolism were in using short Arabic words, or just their initial letters, as mathematical symbols. In particular he used\nwa meaning \"and\" for +\nilla meaning \"less\" for -\nfi meaning \"times\" for ×\nala meaning \"over\" for ÷\nj from jadah meaning \"root\"\nsh from shay meaning \"thing\"\n(\nx\nx\nx\n, the unknown\n)\nm from mal for\nx\n2\nx^{2}\nx\n2\nk form kab for\nx\n3\nx^{3}\nx\n3\nl from yadilu for =\nAl-Qalasadi wrote several books on arithmetic and one on algebra. Some of these are commentaries such as his commentary on the\nTalkhis amal al-hisab\n(\nSummary of arithmetical operations\n)\nby\nibn al-Banna\n.\nIbn al-Banna\nwas a Moroccan who had died over\n100\nyears before al-Qalasadi wrote his commentary but, perhaps surprisingly,\nibn al-Banna\nhimself had written a commentary on his own work.\nCertainly al-Qalasadi wrote original works. His major treatise was\nal-Tabsira fi'lm al-hisab\n(\nClarification of the science of arithmetic\n)\n. This was a difficult text and, perhaps to some extent following the example of\nibn al-Banna\n, al-Qalasadi followed it up by writing a simpler version which he called\nUnveiling the science of arithmetic\n. Even this he must have considered to be too difficult to be used as a teaching book, for he wrote yet a third version\nUnfolding the secrets of the use of dust letters\n.\nThe title of this work needs some explanation. The early methods of calculating with Hindu numerals involved the use of a dust board. A dust board was used because the methods required the moving of numbers around in the calculation and rubbing some out as the calculation proceeded. The dust board allowed this in the same sort of way that one can use a blackboard, chalk and a blackboard eraser. However,\nal-Uqlidisi\nin the tenth century had showed how to modify arithmetical techniques so that pen and paper could be used instead of the dust board. In his arithmetic texts al-Qalasadi computed\n∑\nn\n2\n,\n∑\nn\n3\n\\sum n^{2}, \\sum n^{3}\n∑\nn\n2\n,\n∑\nn\n3\nand used the method of successive approximation to determine square roots.\nBoth of the simpler versions of al-Qalasadi's arithmetic treatise proved popular in teaching arithmetic in North Africa and the works were in use for over\n100\nyears. It is now certain that, despite being popular teaching books, there was little original in al-Qalasadi's work. For example, the sequences\n∑\nn\n2\n\\sum  n^{2}\n∑\nn\n2\nand\n∑\nn\n3\n\\sum  n^{3}\n∑\nn\n3\nhad been studied by\nal-Samawal\nand\nal-Baghdadi\n, and methods for computing square roots were known to the Babylonians.\nHowever, this was poorly understood by the historians of the\n19\nth\ncentury who first tried to understand the contributions to mathematics by the Muslims. The difficulty was that al-Qalasadi, being one of the last of the mathematicians associated with the major mathematical contributions by the Muslims and Arabs, was better known than many of the earlier contributors. Ignorance of the earlier contributions led historians to give too much credit to al-Qalasadi whom in many ways displayed the same characteristics as the later ancient Greek mathematicians.\nOnce established, however, ideas are harder to overturn than one might imagine. J Samso-Moya, reviewing\n[\n6\n]\n. writes:-\nThe author analyses the work of the mathematicians of the Maghrib as if they were entirely independent of their predecessors in Eastern Islam. This leads him to stress the importance of the algebraic symbolism used by al-Qalasadi\n(1412\n-\n1486)\nwithout taking into consideration similar previous attempts both in Eastern and in Western Islam, a fact which was already known - in the second half of the\n19\nth\ncentury - by F Woepcke.\nThe book\n[\n2\n]\nis a reprint of Woepcke's\n19\nth\ncentury treatise refered to by Samso-Moya. Again reviewing\n[\n3\n]\nJ Samso-Moya writes:-\nThe author seems to believe that algebraic symbolism was first developed in Islam by the Spanish-Arabic mathematicians\nIbn al-Banna\n(\nd.\n1321\n, a Moroccan\n)\nand al-Qalasadi\n(\nd.\n1486)\n: the extreme rarity of algebraical symbolism in the parts dedicated to algebra in medieval Italian books on the\nabacus\nand arithmetic is possibly due to the fact that\nLeonardo Fibonacci\n(\nd. after\n1240)\n, whose \"Liber abaci\" was extremely influential in medieval Italy, was not aware of the work of Andalusian mathematicians.\nCertainly symbols were not the invention of al-Qalasadi. Perhaps even more telling is that the particular symbols he used were not even his own invention since the same ones had been used by other Muslim mathematicians in North Africa\n100\nyears earlier. Symbols had been used in the east of the Muslim empire even earlier than that. We should not, however, let any of this argument detract from al-Qalasadi's contribution. We must stress that he does not clam originality - this was the incorrect invention of historians\n400\nyears later.",
  "math_areas": [
    "Algebra",
    "Number Theory"
  ]
}