{
  "nome_completo": "Abu Said Ahmad ibn Muhammad Al-Sijzi",
  "nome_curto": "Al-Sijzi",
  "ano_nascimento": "945",
  "ano_morte": "1020",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Al-Sijzi/",
  "lugar_nascimento": "Sijistan, Persia (now Iran)",
  "lugar_morte": null,
  "biografia": "Al-Sijzi\n's full name is Abu Said Ahmad ibn Muhammad ibn Abd al-Jalil al-Sijzi. Very little is known about his life but we can give fairly accurate dates for his life since we know that he corresponded with\nal-Biruni\nand quoted results by him in his own work.\nHe dedicated works to a prince of Balkh, then the capital of Khorasan. Another work he dedicated to 'Adud ad-Dawlah who ruled over all southern Iran and most of what is now Iraq from\n949\nto\n983\n. It is quite possible that 'Adud ad-Dawlah was al-Sijzi's patron since he was a leader well known for patronising the arts and science.\nWe also know that al-Sijzi worked in Shiraz making astronomical observations during\n969\n-\n970\n. It was certainly at Shiraz at this time that he wrote some of his mathematical works. As well as writing original works he copied other mathematical works and they were dated\n969\nat Shiraz. In particular he copied, and dated the copy\n969\n,\nThabit ibn Qurra\n's treatise on complete quadrilaterals.\nWe mentioned above that al-Sijzi corresponded with\nal-Biruni\n. The paper\n[\n3\n]\ncontains a letter that\nal-Biruni\nwrote to Abu Said, who is almost certainly al-Sijzi. The letter contains proofs of both the plane and spherical versions of the sine theorem, which\nal-Biruni\nsays were due to his teacher\nAbu Nasr Mansur ibn Ali ibn Iraq\n. An English translation of the letter appears in\n[\n10\n]\n.\nIn\n[\n1\n]\nY Dold-Samplonius writes:-\nAl-Sijzi's main scientific activity was in astrology, and he had a vast knowledge of the older literature. He usually compiled and tabulated, adding his own critical commentary. ... Al-Sijzi's mathematical papers are less numerous but more significant than his astrological ones, and he is therefore better known as a geometer.\nThe book\n[\n2\n]\ncontains an English translation\n(\nas well as the Arabic text\n)\nof al-Sijzi's treatise on geometrical problem solving. Among the problems al-Sijzi discusses are the following. Given a circle, find a point outside the circle where the\ntangent\nto the circle and diameter produced, have a given ratio. Given a triangle and three given numbers, find a point inside the triangle where the lines to the three vertices divide the triangle into three triangles having areas proportional to the three given numbers.\nA treatise on spheres by al-Sijzi\nBook of the measurement of spheres by spheres\nis of considerable interest. The treatise, dated by al-Sijzi\n969\n, contains twelve theorems investigating a large sphere containing between one and three smaller spheres. The small spheres are mutually tangent and tangent to the big sphere. Al-Sijzi finds the volume inside the large sphere which is outside the small ones inside it. He expresses this volume as that of a sphere of a particular radius which he computes in terms of the radii of the spheres in the given system. The authors of\n[\n9\n]\nclaim that the main interest of the work lies in the last two propositions in which al-Sijzi considered four-dimensional spheres. In\n[\n5\n]\nthe author again suggests that in these propositions al-Sijzi is dealing with spheres in a space of four dimensions. However J P Hogendijk reviewing\n[\n9\n]\nwrites:-\nOne could also assume that the crucial identity ... is due to an oversight made by Al-Sijzi, who does not use four-dimensional spheres anywhere else in his treatise. We note that the treatise was written around\n969\nAD, at a time when al-Sijzi was a very young and perhaps inexperienced geometer.\nAnother short work by al-Sijzi is the\nTreatise on how to imagine the two lines which approach but do not meet when they are produced indefinitely, which the excellent\nApollonius\nmentioned in the second Book of the\nConics\n. In this treatise al-Sijzi classifies geometrical theorems into five types, one of which is\n[\n7\n]\n:-\n... propositions which are difficult to imagine even though the proof of them is correct.\nIn work on geometrical algebra al-Sijzi proves geometrically that\n(\na\n+\nb\n)\n3\n=\na\n3\n+\n3\na\nb\n(\na\n+\nb\n)\n+\nb\n3\n(a + b)^{3} = a^{3} + 3ab(a + b) + b^{3}\n(\na\n+\nb\n)\n3\n=\na\n3\n+\n3\na\nb\n(\na\n+\nb\n)\n+\nb\n3\n.\nHe does this by decomposing a cube of side\na\n+\nb\na + b\na\n+\nb\ninto the sum of two cubes of sides\na\na\na\nand\nb\nb\nb\nand a number of parallelepipeds of total volume\n3\na\nb\n(\na\n+\nb\n)\n3ab(a + b)\n3\na\nb\n(\na\n+\nb\n)\n. This is considered by most historians to be a three-dimensional extension by al-Sijzi of the geometrical algebra propositions in Book\n2\nof\nEuclid\n's Elements.",
  "math_areas": [
    "Algebra",
    "Logic"
  ]
}