{
  "nome_completo": "Saint Albertus Magnus",
  "nome_curto": "Albertus",
  "ano_nascimento": "1200",
  "ano_morte": "1280",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Albertus/",
  "lugar_nascimento": "Lauingen an der Donau, Swabia (now Germany)",
  "lugar_morte": "Cologne, Prussia (now Germany)",
  "biografia": "Albert\n(\nor\nAlbertus\n)\nwas born into the wealthy Bavarian family of the Count of Bollstädt, being the eldest son in the family. He was later given the name \"Magnus\"\n(\nThe Great\n)\nand also \"Doctor Universalis\" to indicate the esteem that he was held in by his contemporaries. He spent his early years in Lauingen and must have been educated at home or at a school close to his home. His uncle lived in Padua so, since the university there was famous for liberal arts, it was a natural place for his studies. After studying liberal arts at the University of Padua he joined the Dominican Order at Padua in\n1223\nbeing attracted by the teachings of Jordan of Saxony who was the head of the Order. This meant that he was not tied to a parish or a monastery, so could study and teach over a wide area.\nAfter joining the Dominican Order, he studied and taught at Padua, Bologna, Cologne and other German convents in Hildesheim, Freiburg, Ratisbon, Strasbourg, and Cologne. He was sent to the Dominican convent of Saint-Jacques at the University of Paris in about\n1241\nwhere he read the new translations, with commentaries, of the Arabic and Greek texts of\nAristotle\n. This was a period when the writings of Arabic scholars, and through them the texts of ancient Greek philosophers, was becoming known throughout Christian Europe and it was having to come to terms with this new knowledge. Albertus would play a major role in accepting this new learning into Europe with his wide ranging scholarship over essentially the whole of knowledge.\nHe taught for four years at Saint-Jacques, giving courses on the Bible and on the theological textbook\nThe Book of the Sentences\nwhich had been written by Peter Lombard. In\n1245\nhe received the degree of Master of Theology from the University of Paris and, after receiving this degree, one of the first students he taught was Thomas Aquinas. While in Paris Albertus began the task of presenting the entire body of knowledge, natural science, logic, rhetoric, mathematics, astronomy,\nethics\n, economics, politics and\nmetaphysics\n. He wrote commentaries on the Bible, Peter Lombard's\nBook of the Sentences\n, and all of\nAristotle\n's works. These commentaries contained his own observations and experiments. By 'experiment' Albertus meant 'observing, describing and classifying'. For example, in\nDe Mineralibus\nⓉ\n(\nOn minerals\n)\nAlbertus wrote:-\nThe aim of natural science is not simply to accept the statements of others, but to investigate the causes that are at work in nature.\nWe should not underestimate the importance of such ideas, for most scholars at that time believed that knowledge could only be obtained from a study of the scriptures. In the\n13\nth\ncentury few were prepared to even consider the possibility of scientific research, and most considered that knowledge all came from God through ancient divinely inspired writings. Not only did Albertus advocate what we would call today the scientific approach to studying the real world, but he did so in such a way that his ideas were accepted by the Church. Again in a work on plants Albertus wrote:-\nIn studying nature we have not to inquire how God the Creator may, as He freely wills, use His creatures to work miracles and thereby show forth His power: we have rather to inquire what Nature with its immanent causes can naturally bring to pass.\nThese quotes show that, although he did an immense amount of valuable work in collecting and propagating the ideas of earlier scientists in his numerous and wide ranging writings, he also saw the value of new research by experiment. Not everyone held Albertus in high esteem, however.\nBacon\n, who was a contemporary, and in many ways a rival of Albertus, was highly critical\n(\nalthough one can sense that he is attacking someone whom he considers to have undeservedly achieved more than he has\n)\n.\nBacon\nwrites that Albertus:-\n... is a man of infinite patience and has amassed great information, but his works have four faults. The first is boundless, puerile vanity; the second in ineffable falsity; the third is superfluity of bulk; and the fourth is his ignorance of the most useful and the most beautiful parts of philosophy.\nOne has to understand that\nBacon\nwas himself an even stronger advocate of experimental science than was Albertus but, although himself a devote Christian, unlike Albertus he overstepped what the Church might accept.\nBacon\nwas also correct to see errors in Albertus's writings for\nBacon\nhad a deeper understanding of science than had Albertus.\nIn\n1248\nAlbertus left Paris to set up the new\nStudium Generale\nwhich was essentially a Dominican university in Cologne. He was Regent of the\nStudium Generale\nfrom the time that he set it up until\n1254\nand during this time he lectured, wrote important works, and worked closely with his student Thomas Aquinas who was appointed Master of Students\n(\nat least until\n1252\nwhen Aquinas returned to Paris\n)\n. In\n1254\nAlbertus became superior of the Dominican province of Teutonia\n(\nGermany\n)\n. He now had a heavy administrative load but still found time to continue his scientific work. However, wishing to spend still more time on scientific work, he resigned from his role of Provincial in\n1257\nand returned to Cologne.\nIn\n1260\nhe was appointed Bishop of Ratisbon despite the efforts of Humbert de Romanis, the Head of the Dominican Order, to keep Magnus within the Order. After two years he resigned as bishop and returned to his position as professor at the\nStudium Generale\nin Cologne. In\n1274\nPope Gregory X required Albertus to attend the Second Council of Lyon. At this Roman Catholic Council Albertus took a full part in discussing questions of doctrine, administration, discipline, and other matters. Thomas Aquinas died in\n1274\n(\nactually on his way to the Council in Lyon\n)\nand three years later certain factions within the Church tried to condemn his teachings on the grounds that he was too favourably disposed to non-Christian philosophers, both Arabic and Greek. By this time Albertus was an old man, but he travelled to Paris to argue in favour of Thomas Aquinas, whose ideas of course, although not identical to his own, were similar in their support for the teachings of\nAristotle\n.\nWe should note, however, that Albertus did not treat\nAristotle\n's writings as absolutely and necessarily correct. He stated:-\nWhoever believes that\nAristotle\nwas a god, must also believe that he never erred. But if one believes that\nAristotle\nwas a man, then doubtless he was liable to error just as we are.\nIn\nSumma theologiae\nhe argues for reconciling the teachings of\nAristotle\nwith Christian thinking, but nevertheless, devotes a chapter to what he calls \"the errors of Aristotle\".\nWhat of Albertus's contributions to mathematics? In\n[\n6\n]\nAnthony Lo Bello gives:-\n... an English translation, with mathematical and philosophical notes, of three sections of the commentary by Albertus Magnus on\nEuclid\n's Elements :\n(1)\nthe prologue,\n(2)\nthe question \"Is an angle a quantity?\" and\n(3)\nBook I, Proposition\n11\n.\nIn\n[\n7\n]\nJ E Hofmann examines a manuscript in the Dominikaner-Bibliothek Vienna which contains a treatment of the books I to IV of\nEuclid\n's\nElements\nin Latin by Albertus. The text shows that Albertus was familiar with the Latin translations from Arabic of\nEuclid\n's\nElements\nby\nBoethius\nand\nAdelard\nof Bath. Since Albertus has clearly not read the translation by\nCampanus\nthen, given the range of Albertus's scholarship, one can reasonably assume that Albertus wrote his commentary on\nEuclid\nbefore that of\nCampanus\n.\nIn\nSuper Dionysii epistulas\nⓉ\n(\nOn letters of Dionysus\n)\nAlbertus considers the motion of the \"Sphere of Stars\" with the aim of determining whether the eclipse at the crucifixion of Jesus of Nazareth was natural or miraculous. His methods of tracing back the positions of the sun and moon is interesting. The methods used by Albertus are examined in detail in\n[\n9\n]\n.\nAmong his other works is\nDe natura locorum\n(\non the nature of places\n)\nwhich is a work on geography in which Albertus presents data on locations and features and emphasises the importance of geography in understanding the world.\nAlthough Albertus was able to argue convincingly for Thomas Aquinas in\n1277\n, by the following year his memory was beginning to fail him. Over the next three years he rapidly declined both mentally and physically\nAlbertus was made a Saint and declared a Holy Doctor of the Church on\n16\nDecember\n1931\nand his feast day is\n15\nNovember in each year. In\n1941\nAlbertus was made patron of natural scientists by Pope Pius XII.",
  "math_areas": []
}