{
  "nome_completo": "Alberto Pedro Calderón",
  "nome_curto": "Alberto Calderón",
  "ano_nascimento": "1920",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Calderon/",
  "lugar_nascimento": "Mendoza, Argentina",
  "lugar_morte": "Chicago, USA",
  "biografia": "Alberto Calderón\nwas the son of Pedro Juan Calderón and Haydée Cores. Pedro Calderón, from an old colonial family, was a surgeon who had trained in Buenos Aires and later in Paris under Georges Marion, the famous French surgeon and urologist. Pedro, who of course was Spanish speaking, was also fluent in French and Italian. He practiced as a surgeon in Mendoza. He married Haydée Cores and they had a daughter Margarita Isabel Calderón born\n26\nDecember\n1918\n(\nknown as Nenacha\n)\nand a son Alberto Pedro Calderón born\n1920\n, the subject of this biography\n[\n11\n]\n:-\nDr Pedro Calderón had a natural affinity for mathematics and music. He would have undoubtedly subscribed to\nLeibniz\n's famous saying that: \"Music is the secret arithmetic of the soul, unaware of its act of counting.\" The fact is that he tried to instil in his sons, at an early age, a keen interest in mathematics and music. \"At the dinner table he would challenge Alberto, a boy of six or seven, to make rapid mental calculations; or he would play classical music for Alberto an his older sister Nenacha.\"\nHaydée Calderón died at a young age in\n1932\nand Pedro Calderón later married Matilde García Gallo who was much younger. Matilde was the daughter of Edibert Garcia Gallo who had been born in the Basque region of France in\n1881\n.\nAlberto Calderón began his education at the Colegio Marista San Josee de Mendoza. This religious school was founded in\n1917\n. He had part of his early secondary education in Switzerland at the Institut Montana Zugerberg, an international boys' boarding school founded in\n1926\nnear Zug, going there after the death of his mother when he was twelve years old. This school was chosen by Alberto's father because he wanted his son to study engineering and the Eidgenössische Technische Hochschule in Zurich had, Pedro believed, the best engineering school in the world. Alberto's father believed that educating Alberto in Switzerland would be the best possible preparation\n[\n13\n]\n:-\nIt is here that Alberto met his destiny in the person of Doctor Save Bercovici, the mathematics professor. Their relationship began when Alberto committed a mischievous act in the presence of the professor. The traditional punishment was to send the culprit to his room for three days, during the hours when the boys used to go skiing. But the professor had a different idea. He saw this as a unique opportunity to attract Alberto to mathematics: he gave the boy a problem in Geometry, promising him that if he could solve it, he would be pardoned. The problem was to construct with ruler and compass only, an isosceles triangle, given the height and the sum of the length of the base and one of the sides. With youthful ambition and energy, Alberto set to work and found a construction that solved the problem. Alberto was pardoned, Prof Bercovici became Alberto's mentor and mathematics moved permanently to the centre of Alberto's mental life.\nCalderón recognised the importance of this incident and later said\n(\nsee\n[\n27\n]\n)\n:-\nThe problem seduced me, and awoke in me an eagerness to solve more and similar problems. This incident clearly showed me what my vocation was, and had a decisive influence in my life.\nEducation at the Institut Montana Zugerberg was expensive and Pedro Calderón could not afford to keep Alberto at the school so after two years he returned to Argentina to complete his secondary schooling at the Agustín Álvarez National College in Mendoza, Argentina. He continued developing his interest in mathematics by studying the\nBoletín Matemático Argentino\nwhich he found in the school library. Although he would have loved to study mathematics at university, he followed his father's wishes and he studied civil engineering at the University of Buenos Aires. There he met Bernardo Baidaff, the editor of the\nBoletín Matemático Argentino\n, who helped Calderón continue his mathematical interests. While still an engineering undergraduate, he attended calculus lectures by\nJulio Rey Pastor\n, and got to know his assistant\nAlberto González Domínguez\n. Calderón attended the mathematics seminar where he got to know Luis Santaló and Manuel Balanzat. He graduated in\n1947\nwith a degree in civil engineering.\nAfter graduating he began working in the geophysical division of the Yacimentos Petrolíferos Fiscales, a state-owned oil company. He enjoyed the work in the laboratory which involved solving applied mathematics problems\n[\n12\n]\n:-\nAlberto's independence of spirit and exceptional performance, however, annoyed the laboratory director, who became enraged when he discovered that, in his spare time, Alberto was passionately reading\nKuratowski\n's 'Topologie'.\nCalderón resigned but he did so reluctantly since he had enjoyed the work. He was able to get a job in the Institute of Mathematics at the University of Buenos Aires and began research in mathematics under the supervision of\nAlberto González Domínguez\n.\nIn\n1948\nAntoni Zygmund\nvisited the University of Buenos Aires and began to discuss various problems with Calderón. Tony Carbery writes in\n[\n15\n]\n:-\n...\nZygmund\nposed Calderón a question and the puzzled Calderón replied that the answer was contained in\nZygmund\n's own book 'Trigonometric Series'.\nZygmund\ndisagreed: what transpired was that Calderón only ever read the statements of the results, preferring to give his own reasoning and proofs... . One of these proofs gave a highly original answer to\nZygmund\n's question. This originality was to be the hallmark of Calderón's work in the years to follow.\nA fuller and slightly different version of this is given in the introduction to\n[\n17\n]\n(\nsee also\n[\n18\n]\n)\n:-\nIn the years immediately after World War II the U.S. Department of State had a very active visitors program that sent prominent scientists to Latin America. Thus,\nAdrian Albert\n,\nMarshall Stone\n, and\nGeorge Birkhoff\nvisited Buenos Aires. and\nGonzález Domínguez\narranged through them the visit of\nZygmund\n, whose work on\nFourier\nSeries he much admired. At the Institute of Mathematics,\nZygmund\ngave a two-month seminar on topics in analysis, based on his book. This seminar was attended by\nGonzález Domínguez\n, Calderón,\nMischa Cotlar\n, and three other young Argentine mathematicians. Each of the participants had to discuss a portion of the text. Calderón's assignment was to present the\nMarcel Riesz\ntheorem on the continuity of the\nHilbert\ntransform in\nL\np\nL^{p}\nL\np\n. According to\nCotlar\n's vivid recollection of the event, Calderón's exposition was entirely acceptable to the junior audience, but not to\nZygmund\n, who appeared agitated and grimaced all the time. Finally, he interrupted Calderón abruptly to ask where had read the material he was presenting, and a bewildered Calderón answered that be had read it in\nZygmund\n's book.\nZygmund\nvehemently informed the audience that this was not the proof in his book, and after the lecture took Calderón aside and quizzed him about the new short and elegant proof. Calderón confessed that he had first tried to prove the theorem by himself, and then thinking he could not do it, had read the beginning of the proof in the book; but after the first couple of lines, instead of turning the page, had figured out how the proof would finish. In fact, he had found himself an elegant new proof of the\nRiesz\nTheorem!\nZygmund\nimmediately recognised Calderon's power and then and there decided to invite him to Chicago to study with him.\nCalderón was awarded a Rockefeller Scholarship to enable him to undertake research at the University of Chicago and this he did working with\nZygmund\n. In\n1950\nhe published two papers written jointly with\nZygmund\n:\nNote on the boundary values of functions of several complex variables\n; and\nOn the theorem of Hausdorff-Young and its extensions\n. He had also published three single author papers:\nOn theorems of M Riesz and Zygmund\n;\nOn a theorem of Marcinkiewicz and Zygmund\n; and\nOn the behaviour of harmonic functions at the boundary\n. It was never Calderón's intention to write a Ph.D. dissertation since he wanted to do research and not spend time putting together a thesis. One day\nMarshall Stone\n, chair of the mathematics department at the University of Chicago, asked Calderón to come to his office bringing his published papers. Stone picked up Calderón's three single author papers, stapled them together, and said \"This is your thesis!\" It was an outstanding thesis for which Calderón was awarded his Ph.D. in\n1950\n.\nWhen he was a student at the University of Buenos Aires he had met Mabel Ernestina Molinelli Wells who was studying mathematics there. Mario Bunge, who taught Mabel, described her as \"a pretty, lively, popular chatterbox ... who was the centre of attention wherever she went.\" She had been born on\n8\nDecember\n1918\nin Buenos Aires. Alberto and Mabel were married on\n18\nNovember\n1950\nin Manhattan, New York. They had two children, María Josefina Calderón, who holds a doctorate in French literature from the University of Chicago, and Pablo Alberto Calderón, who studied mathematics in Buenos Aires and New York. Pablo Calderón was awarded a Ph.D. from New York University in\n1990\nfor his thesis\nOn the macroscopic behaviour of a large stochastic system\n. His thesis advisor was\nS R S Varadhan\n. Pablo works at the National University of La Plata in Argentina.\nFrom\n1950\nto\n1953\nAlberto Calderón was an associate professor at Ohio State University, then he spent\n1954\n-\n55\nat the Institute for Advanced Study at Princeton. After spending the years\n1955\n-\n59\nat Massachusetts Institute of Technology, he returned to Chicago in\n1959\nwhen he was appointed professor of mathematics there.\nAfter serving as Louis Block Professor of Mathematics from\n1968\nto\n1972\nand chairman of the Mathematics Department at Chicago from\n1970\nto\n1972\n, he left for a position of professor of mathematics at Massachusetts Institute of Technology. However, he only spent three years at MIT before returning to the University of Chicago in\n1975\n. His wife became ill and Calderón took early retirement from Chicago, returning to Buenos Aires. Mabel Calderón died in Buenos Aires in August\n1985\n. In\n1989\nCalderón returned to the University of Chicago and worked there on a post-retirement appointment until\n1992\n.\nThe year\n1989\nwas significant for Calderón in another way. The death of his wife Mabel in\n1985\nwas, naturally, a terrible blow to Calderón who, as a consequence, struggled to concentrate on his work. Life became good again after a while when he again met Alexandra. Alexandra Bagdasar had been born in Bucharest, Romania, on\n30\nAugust\n1935\n, the daughter of medical doctors Dumitru Bagdasar and Florica Ciumetti. She graduated with a mathematics degree from the University of Bucharest having married the mathematician Cassius Ionescu-Tulcea in Bucharest in\n1956\n. The couple went to the United States in\n1957\nand, two years later, Alexandra was awarded a Ph.D. by Yale University for her thesis\nErgodic Theory of Random Series\n. Alexandra, after several university appointments, became Professor of Mathematics at Northwestern University in Evanston, Illinois in\n1967\n. Her marriage ended in divorce in\n1969\nand, five years later she married the author Saul Bellow who was awarded the Nobel Prize for Literature in\n1976\n. In\n1985\nher second marriage ended in divorce and in\n1989\nshe married Calderón. She is the author of the references\n[\n10\n]\n,\n[\n11\n]\n,\n12]\n, and\n[\n13\n]\n. In fact they first met many years earlier\n[\n9\n]\n:-\nAccording to the brochure for the\nAssociation for Women in Mathematics\nNoether\nLecture, Bellow and Calderón first met in\n1974\nwhen they shared an office at the Massachusetts Institute of Technology. Bellow explains that she arrived at the Massachusetts Institute of Technology as a visiting professor. Calderón, then a professor at the Massachusetts Institute of Technology, \"had a magnificently large office, in keeping with his mathematical stature. There was a shortage of office space in the Mathematics Department and the Chairman asked Alberto if he would mind sharing his office with a visitor. Alberto, always a gentleman, agreed.\"\nAs a lecturer Calderón had a somewhat unusual style. Michael Christ attended Calderón's graduate lectures and wrote about these in\n[\n19\n]\n:-\nTheorems and full details of proofs were given, with only occasional motivation and no editorialising. While Calderón was both architect and bricklayer, his lectures emphasised the bricks. The pace was decidedly slow; the thoughts of a young student wandered. Rarely had he visible lecture notes. During one memorable long stretch the notes consisted solely of his four-page paper on the Cauchy integral, carried in an inside coat pocket and seldom consulted. The lectures were clear yet unpolished, with occasional retreats and emendations. Once in a great while the argument would founder. An irked but calm Calderón, along with the audience, would seek to bridge the gap. When one such breakdown led to a spirited discussion among Calderón, W Beckner, and P W Jones, I finally understood: the lectures were planned in barest outline. Calderón was rethinking the theorems on the blackboard before us; we were expected to think along with him. Much later he confirmed this, explaining that meticulous preparation early in his career had produced lectures too rapid for his audience; he had resolved to be understood.\nCora Sadosky\nwas one of Calderón's Ph.D. students at Chicago. She wrote\n[\n19\n]\n:-\nThe extraordinary opportunity of discussing ideas in the making with such a profoundly original mathematician was a unique gift. At the time I did not understand, and therefore failed to appreciate fully, how unusual Calderón's openness was, and I marvel now in retrospect. I think this was one of his most remarkable traits of character: he would talk mathematics openly, sharing freely all of his thoughts, ideas, and insights.\nThe Calderón-\nZygmund\ntheory changed the direction of mathematical analysis, each bringing a distinctive flavour to the theory\n[\n16\n]\n:-\nZygmund\n, a classical analyst, became interested in analogues of the conjugate function operator\n(\nthat which takes the real part of an analytic function to its imaginary part\n)\nin higher dimensions, purely for reasons of intellectual interest. Calderón, on the other hand, with his background as an engineer, saw that such operators held an important key to understanding the theory of partial differential equations.\nOut of these differing points of view was born one of the predominant intellectual movements in\n20\nth century mathematics: the Calderón-\nZygmund\ntheory of singular integral operators and the Calderón-\nZygmund\nschool devoted to their study. In particular Calderón wanted to describe a calculus for elliptic differential operators and, from this beginning in the\n1950\ns, the theory of pseudodifferential operators grew in the\n1960\ns.\nIn\n1958\nCalderón published one of his most important results on uniqueness in the\nCauchy\nproblem for partial differential equations. In\n1989\nhe was awarded the Steele Prize by the\nAmerican Mathematical Society\n(\nfundamental research work category\n)\nfor this outstanding contribution. In\n1991\nhe was awarded the National Medal of Science and again it was for his work on uniqueness in the\nCauchy\nproblem which was cited. He was awarded the National Medal of Science\n[\n2\n]\n:-\n... for his ground-breaking work on singular integral operators leading to their application to important problems in partial differential equations, including his proof of uniqueness in the\nCauchy\nproblem, the\nAtiyah\n-\nSinger\nindex theorem, and the propagation of singularities in nonlinear equations...\nThese honours were but two from a long list. The\nAmerican Mathematical Society\nalso awarded Calderón their\nBôcher\nPrize in\n1979\nand he had previously been\nAmerican Mathematical Society\nColloquium Lecturer in\n1965\nwhen he spoke in Ithaca on Singular Integrals.\nArgentina gave many honours to Calderón. These included the Provincia de Sante Fe Prize\n(1969)\n, the Konex Prize\n(1983)\n, the Union Carbide Prize\n(1984)\nand the Consagración Nacional Prize\n(1989)\n. This was partly because Calderón made many visits to Argentina to give lectures and to help with advising Ph.D. students. In\n[\n19\n]\nthere is a list of\n27\nof Calderón's Ph.D. students, five with Ph.D.s from MIT, sixteen from Chicago and six from Buenos Aires. He also made arrangements for some Argentinian students to go to the United States to finish their studies and several of those with degrees from Chicago are Argentinian.\nCalderón was elected to the\nAmerican Academy of Arts and Sciences\n(1957)\n, the National Academy of Exact, Physical and Natural Sciences of Argentina\n(1959)\n, the\nNational Academy of Sciences of the United States\n(1968)\n, the\nSpanish Royal Academy of Sciences\n(1970)\n, The Latin American Academy of Sciences of Venezuela\n(1983)\n, the\nFrench Academy of Sciences\n(1984)\nand the Third World Academy of Sciences\n(1984)\n.\nIn\n[\n2\n]\nthe influence of his work is described:-\nCalderón's influence on analysis and related areas is due in large part to the many methods that he invented and perfected. In modern\nFourier\nanalysis, theorems are usually less important than the techniques developed to prove them. Calderón's techniques have been absorbed as standard tools of harmonic analysis and are now propagating into nonlinear analysis, partial differential equations, complex analysis, and even signal processing and numerical analysis.\nAlthough this influence will continue to be felt, despite writing around\n80\nmathematical papers, Calderón never wrote a monograph on his highly original ideas. This lack of a definitive source has meant that the treatises which cover his fundamental work have been written by others. Recent directions which arise from Calderón's theories are described in\n[\n15\n]\n.\nTony Carbery\n[\n16\n]\ndescribes Calderón's character:-\nAlberto Calderón was a shy, courteous and modest man who, once comfortable, would open up and entertain his companions with ease. ... I will not forget the kind, considerate and elegant gentleman, cigarette in hand, often seen walking quietly down the corridors of Eckhard Hall, in the University of Chicago.\nCora Sadosky\nsums up his contribution as follows\n[\n19\n]\n:-\nAlberto Calderón was a very unassuming man of natural charm, a person of great elegance and restraint, and wonderful company. Mathematically Calderón was exceptional not only for the strength of his talent but for his peculiar way of grasping mathematics. He redid whole theories by himself, got to the core of what he wanted to know by himself, found always his own way. His ideas and the methods he developed were always extremely original and powerful. Although he was an individualist to the core, he influenced profoundly the work of others, who developed what is known as the \"Calderón program\". He shared his knowledge freely with his students, yet did not closely follow their careers. Calderón was modest, sure of himself, and quite indifferent to competition. He was always happy to have been an engineer and conserved a real interest in applications. In one of our last conversations he told me how intrigued he was that his work was perceived to be in the foundation of wavelet theory. I think this pleased Calderón very much.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory",
    "Statistics",
    "Topology"
  ]
}