{
  "nome_completo": "Alberto Dou i Mas de Xexas",
  "nome_curto": "Alberto Dou",
  "ano_nascimento": "1915",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dou/",
  "lugar_nascimento": "Olot, Spain",
  "lugar_morte": "Sant Cugat del Vallés, Barcelona, Spain",
  "biografia": "Alberto Dou\ncame from a high ranking family in Catalonia, the marquises of Olèrdola, a recently created Barcelonese nobility. His schooling was in Olot, his native city, where he obtained his baccalaureate in\n1930\n. He then went to Madrid where he entered the School of Civil Engineering, the Escuela de Ingenieros de Caminos, Canales y Puertos, in the Polytechnic University of Madrid. While Dou was studying civil engineering in Madrid the Spanish Civil War broke out in\n1936\n. To understand Dou's reaction to this conflict we need to give a few brief comments about this war.\nThe war began with an uprising in July\n1936\nwhich was essentially a military plot. The uprising failed but then it developed a more religious aspect with the Nationalists taking the role of the church against secularists. But it also had aspects of a class war of industrialists and bankers against urban workers and of centralists against liberal regionalists. Where did Alberto Dou stand in all this? He was a deeply religious man and his Church was certainly encouraging its followers to join the Nationalist cause led by the Fascist Francisco Franco. However, Dou was from Catalonia which was the centre of the Republican cause. At the outbreak of the Civil War, Dou joined the Nationalist army and was sent to the front, first as a Private and later promoted to Alférez Provisional\nⓉ\n(\nTemporary second lieutentant\n)\n. He played a part in the Nationalist campaign that attacked the Republican forces at Aragon in March\n1938\n. The Nationalists fairly quickly defeated the Republicans and took control of parts of Catalonia. It appears that following this, Dou was involved in a dispute with some fellow soldiers in his unit on whether Catalan is or is not a true language. When the captain heard that his men had been carrying out this argument, he lined up the men and challenged anyone who defended Catalan to take a step forward. Dou took that step forward and as a consequence he spent the rest of the war in a disciplinary battalion.\nAfter the Civil War ended in\n1939\n, Dou returned to Madrid and continued his studies in civil engineering at the Polytechnic University of Madrid. However, he also began taking mathematics classes but every morning before classes began he would attend mass at the convent of the Trinitarian Fathers. He was awarded a degree in Civil Engineering in\n1943\nand, for his outstanding work, he was awarded the Manuel Becerra Extraordinary Prize. In the same year he entered the Jesuits, the Society of Jesus. Already he was studying mathematics and he worked towards a philosophy degree from the Faculty of the Society of Jesus in Sarriá  and a mathematics degree from the University of Barcelona. For his philosophy degree he wrote a dissertation,\nProbability, Statistics and Truth\n, supervised by Ramón Puigrefagut, based on the work of Richard von Mises. He was awarded a philosophy degree in\n1949\nand a bachelor's degree in mathematics in the following year. He was awarded the Extraordinary Prize for his work in mathematics.\nAt the University of Barcelona, Dou attended a course delivered by\nWilhelm Blaschke\nwho was visiting the university. As a result of this, immediately following the award of his bachelor's degree in mathematics, Dou went to Germany and spent a year at the University of Hamburg undertaking research supervised by\nBlaschke\n. This research involved investigating the application of differential geometry to differential equations. Returning to Spain, he defended his thesis\nCuatritejidos planos\nⓉ\n(\nFlat four-webs\n)\nat the Universidad Complutense of Madrid in\n1952\nand published his work as\nQuatritejidos planos\nⓉ\n(\nFlat four-webs\n)\nin the\nMemorias de la Academia de Ciencias de Barcelona\nin\n1953\n. Remarkably, in parallel with these studies in mathematics, he began studying for a doctorate in theology at the University of Innsbruck in\n1951\n-\n52\n, and completed his research at San Cugat del Vallés in\n1955\n. Before this, in\n1954\n, he had been ordained a priest in the Society of Jesus. In\n1955\nhe was appointed to the Chair of Mathematics at the School of Engineering in Madrid, and in\n1957\nhe won the Chair of Mathematical Analysis III\n(\nDifferential Equations\n)\nat the Universidad Complutense of Madrid. He found that the duties he had made it difficult to undertake research so he decided to adopt a strategy. He said\n(\nsee\n[\n2\n]\n)\n:-\nThe preparation of classes, the attention to students, the administrative tasks, absorbed so much of my time that it was virtually impossible to do any research. It occurred to me that the solution to finding some quiet time during which to study was to request periodically, every four or five years, a one-year leave of absence and to spend it in university centres abroad.\nHe established contacts with many of the leading mathematicians such as\nFritz John\n,\nAlberto Calderón\nand\nJacques-Louis Lions\n. In\n1959\n-\n60\nhe made a research visit to the\nCourant\nInstitute of the University of New York and, in the same year, took the opportunity to visit the University of Chicago where he established a close relation with\nAntoni Zygmund\nand\nAlberto Calderón\n. He spent the academic year\n1963\n-\n64\nat the Mathematics Research Center of the University of Wisconsin in Madison where he worked with Rudolf Langer\n(1894\n-\n1968)\n. In\n1969\n-\n70\nhe visited the University of Notre Dame in Indiana, while in\n1974\nhe returned to the\nCourant\nInstitute to spend a semester there.\nDou's main areas of research were Differential Geometry, the Theory of Elasticity, and the Variational Theory of Partial Differential Equations. For example, early in his career he published\nRang der ebenen\n4\n-Gewebe\nⓉ\n(\nRank of the flat\n4\n-web\n)\nin the\nJournal of the Mathematical Seminar of the University of Hamburg\n(1955)\n,\nLa representación simétrica de los cuatritejidos hexagonales\nⓉ\n(\nThe symmetric representation of the hexagonal quadrings\n)\n(1957)\n,\nEl principio de Saint-Venant en las vigas\nⓉ\n(\nThe principle of Saint-Venant applied to beams\n)\n(1961)\n,\nBeam with a ring for cross-section, excited by longitudinal and body forces\nin the Proceedings of the International Conference 'Partial Differential Equations and Continuum Mechanics' held at the University of Wisconsin in Madison\n(1961)\n,\nEl teorema de unicidad en elasticidad plana\nⓉ\n(\nThe unicity theorem in flat elasticity\n)\n(1962)\n, and\nSistemas diferenciales ordinarios lineales con coeficientes constantes\nⓉ\n(\nOrdinary linear differential systems with constant coefficients\n)\n(1962)\n. Also in\n1962\nhe published obituaries of\nWilhelm Blaschke\nand of\nJulio Rey Pastor\n.\nWe should look briefly at some of the books which Dou wrote. In\n1964\nhe published\nEcuaciones diferenciales ordinarias. Problema de Cauchy\nⓉ\n(\nOrdinary differential equations. Cauchy problem\n)\n. It was reviewed by\nDonald Greenspan\n:-\nIn order to achieve a degree of unity, to be relatively comprehensive, and to have a reasonable length, this new text directs attention only to the\nCauchy\nproblem for a single equation and for systems of equations. The content is divided into four main divisions which deal with methods of solution; existence, uniqueness and continuation of solutions; systems of linear equations; and numerical methods. ... the author's material is vital and well-organized; his presentation is beautifully balanced with informality and rigour; and his style is fluid and fluent. Within the reasonable scope that he has set, the author has written an excellent text.\nEcuaciones en derivadas parciales\nⓉ\n(\nPartial differential equations\n)\nwas published in\n1968\nand, two years later, in\n1970\nDou published\nFundamentos de la matemática\nⓉ\n(\nFoundations of mathematics\n)\n. This introductory book, written at an elementary level, has the following chapters:-\nIntroduction. Part I: The historical development of the mathematical method. Chapter\n1\n, The Greek period; Chapter\n2\n, From\nJ Saccheri\nto\nB Riemann\n; Chapter\n3\n, The arithmetization of analysis. Part II: Analysis of the mathematical method. Chapter\n1\n, Logicism; Chapter\n2\n, Formalism; Chapter\n3\n, Formal theory of numbers; Chapter\n4\n, Intuitionism.\nHis next book was\nEcuaciones en derivadas parciales de primer orden e introducción a las de segundo orden\nⓉ\n(\nFirst order partial differential equations and introduction to second order equations\n)\n(1970)\nwhich had the following contents:-\nChapter I: First order partial differential equations.\n(\nA\n)\nSemilinear equations:\n(1)\nIntroduction,\n(2)\nIntegral surfaces and first integrals,\n(3)\nThe\nCauchy\nproblem;\n(\nB\n)\nThe general equation with two independent variables:\n(4)\nMonge\ncurves,\n(5)\nThe\nCauchy\nproblem,\n(6)\nThe method of the complete integral,\n(7)\nThe example\np\n2\n+\nq\n2\n+\nf\n(\nx\n,\ny\n)\n=\n0\np^{2} + q^{2} + f(x, y) = 0\np\n2\n+\nq\n2\n+\nf\n(\nx\n,\ny\n)\n=\n0\n;\n(\nC\n)\nThe equation with more than two independent variables:\n(8)\nThe\nCauchy\nmethod,\n(9)\nThe\nHamilton\n-\nJacobi\nmethod. Chapter II: Introduction to second order equations. Typical examples from applied mathematics:\n(1)\nThe membrane equation,\n(2)\nThe heat equation,\n(3)\nEquations of elliptic type.\nIn\n1972\nhe published a text in English, namely\nLectures on partial differential equations of first order\n. Wolfgang Haack writes:-\nThis book is the result of lectures which the author gave at the Universities of Madrid and Notre Dame\n(\nIndiana\n)\n, and represents the first part of a planned \"Introduction to the theory of partial differential equations''. Thus, the part under review is completely introductory in nature.\nIn collaboration with Alfredo Mendizabal he wrote\nEcuaciones en derivadas parciales y su resolucion numerica\nⓉ\n(\nPartial derivative equations and their numerical resolution\n)\nwhich was published in\n1973\n.\nLet us now describe briefly how Dou's career developed. He held the Chair of Mathematical Analysis III\n(\nDifferential Equations\n)\nat the Universidad Complutense of Madrid\n(\nUCM\n)\nfrom\n1957\nand, in\n1967\nhe was appointed director UCM's new Department of Functional Equations in the Mathematics Section of the Faculty of Sciences. In\n1975\nhe was elected as Dean of the new Faculty of Mathematics at UCM. However, he was to hold this post for only a short time since he accepted the position of rector of the University of Deusto in San Sebastián. This university, the oldest private university in Spain, was run by the Society of Jesus and so was a natural for Dou to accept this position. He related an interesting event that happened when he presided over the opening ceremony of the\n1976\n-\n77\nsession\n[\n9\n]\n:-\nFor me the most enriching experience that occurred came when I was the Rector of the University of Deusto and presiding over the opening ceremony of the\n1976\n-\n77\nsession. When the Secretary finished reading the Report for the academic year\n1975\n-\n76\n, a group of law students came to the presidential dais on their own initiative and tried to read the written counter-memorial they carried with them. A noisy commotion immediately broke out. I stood up, asked for silence, and authorised them to read their counter-memorial. When the reading was over, it seemed that they were going to leave, but I indicated to them that they should remain and listen to us since we had listened to them; and they stayed.\nHowever, Dou only remained at the University of Deusto for two years before, in\n1977\n, he returned to Madrid when he accepted the position as rector of the Catholic Institute of Arts and Industries and of the Catholic Institute of Business Administration. These institutes were run by the Society of Jesus and had merged in\n1960\n. In\n1978\n, one year after Dou took up this position, these institutes merged with the Comillas Pontifical University which was also run by the Society of Jesus. When he had come back to Madrid from San Sebastián in\n1977\nDou also returned to his Chair of Mathematical Analysis III\n(\nDifferential Equations\n)\nat the UCM.\nIn addition to his research in Differential Geometry, Differential Equations, and the Theory of Elasticity, Dou wrote articles on the foundations of mathematics. For example\nEl infinito en matemáticas\nⓉ\n(\nThe infinite in mathematics\n)\n(1968)\n,\nEl teorema de incomplitud de Gödel\nⓉ\n(\nGödel's incompleteness theorem\n)\n(1969)\n, and\nFundamentos de la Matemática\nⓉ\n(\nFoundations of mathematics\n)\n(1970)\n. He wrote about artificial intelligence in articles such as\nImplicaciones de la inteligencia artificial para el conocimiento humano\nⓉ\n(\nImplications of artificial intelligence for human knowledge\n)\n(1972)\nand about the history of mathematics in articles such as\nLogical and historical remarks on Saccheri's gometry\n(1970)\n,\nLas matemáticas de Galileo. Estudio histórico sobre\nⓉ\n(\nThe mathematics of Galileo. An historical study\n)\n(1986)\n, and\nEuclides\n(1986)\n. He also wrote about the meaning and impact of science and technology on society in articles such as\nAspectos Moral y Social de la investigación\nⓉ\n(\nMoral and Social Aspects of Research\n)\n(1965)\n,\nHumanismo en el año\n2000\nⓉ\n(\nHumanism in the year\n2000\n)\n(1973)\n,\nUn sacerdote en la Universidad\nⓉ\n(\nA priest at the university\n)\n(1974)\n, and\nEl sentido de la técnica\nⓉ\n(\nThe sense of technique\n)\n(1984)\n.\nHis interest in the history of mathematics is clearly seen from the fact that after he retired from his positions in Madrid in\n1983\nhe went to the University of Barcelona where he was given the position of Professor Emeritus, teaching the History and Philosophy of Mathematics. He published many articles on the history of science while in that position. For example,\nOrígenes del cálculo de Variaciones\nⓉ\n(\nOrigins of the calculation of variations\n)\n(1988)\n,\nMathematics in Spain in the\n17\nth century\n(1989)\n,\nOrígenes de la geometría no Euclidiana: Saccheri, Lambert y Taurinus\nⓉ\n(\nOrigins of non-Euclidean geometry: Saccheri, Lambert and Taurinus\n)\n(1992)\n,\nThe emergence of the consciousness of the possibility of a new non-Euclidean geometry\n(1993)\n,\nMatemáticos españoles jesuitas de los siglos\n16\ny\n17\nⓉ\n(\nSpanish Jesuit mathematicians of the\n16\nth and\n17\nth centuries\n)\n(1997)\n,\nLas Teorías del movimiento de los proyectiles y de las paralelas de Aristóteles a Einstein\nⓉ\n(\nTheories of the movement of projectiles and of parallels from Aristotle to Einstein\n)\n(1999)\n,\nInfluencias negativas de la cultura y en particular de la filosofía en la emergencia de la primera geometría no Euclídea\nⓉ\n(\nNegative influences of culture and in particular of philosophy in the emergence of the first non-Euclidean geometry\n)\n(2000)\n. He also wrote many articles on science and theology, for example\nEl científico cristiano, la humanidad y la Iglesia\nⓉ\n(\nThe Christian scientist, humanity and the Church\n)\n(1988)\n,\nA propos de la théologie du sens: Le langage sur Dieu\nⓉ\n(\nAbout theology of meaning: The language of God\n)\n(1992)\n,\nEls científics i la fe cristiana\nⓉ\n(\nScientists and the Christian faith\n)\n(1993)\n, and\nScientists and the Reformulation of Gospel Message\n(1996)\n.\nDou received many awards and honours for his outstanding contributions. In\n1960\nhe was elected President of the\nRoyal Spanish Mathematical Society\nsucceeding\nJulio Rey Pastor\n. On\n12\nJune\n1963\n, Dou delivered his inauguration address as a member of the\nRoyal Spanish Academy of Exact, Physical and Natural Sciences\noccupying the place left vacant on the death of\nRey Pastor\n. In\n1974\nhe received the Civil Order of Alfonso X the Wise for his qualities as a teacher. In\n1989\nhe received the Gold Medal of the College of Civil Engineers, and finally Honorary Doctorates from the Universidad Pontificia de Comillas in\n1984\nand from the University of Málaga in\n2002\n.\nDou said the following about his own career\n[\n1\n]\n:-\nThe teacher who passionately gives a university course, whether or not he is aware of it, also imparts a vision of the cosmos and of life, and students, whether they want it or not, whether they know it or not, are critically impacted by the course, either towards an acceptance or to a rejection of human values or pseudo-values, independently of the mathematical contents or of the discipline that is taught. Personally, for me, after living for a while in a kind of schizophrenia between religious values and mathematical values, I soon came to the conclusion that they converged on a single humanism. I have sometimes summed it up in one sentence: From the pulpit to the dais there is no continuous solution.\nLet us end with some quote from his friends and colleagues\n(\n[\n10\n]\nand\n[\n1\n]\n)\n:-\nHe never concealed his prevailing Jesuit status, he lived in the way of the Jesuits without ostentation, but without complexes, without dramatic tears or false steps. He was able to be faithful to his time and his destiny with a simplicity that was always exemplary.\nSeldom have I seen so much human simplicity in a scientific personality with such deep values.\nHe gave his life passionately to the University and always made his knowledge a genuinely university service.\nWith his death, Spanish science and culture suffer the loss of a privileged and wonderfully open mind that, impregnating a ubiquitous footprint in many fields, will always endure in the memory of all those who were offered his teaching, collaboration and friendship. Rest in peace.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}