{
  "nome_completo": "Albin Herzog",
  "nome_curto": "Albin Herzog",
  "ano_nascimento": "1852",
  "ano_morte": "1909",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Herzog/",
  "lugar_nascimento": "Homburg, Thurgau canton, Switzerland",
  "lugar_morte": "Mammern, Switzerland",
  "biografia": "Albin Herzog\n's father Johann was a teacher. Albin first attended primary school in his native village, then secondary school in Steckborn, and then the Kantonsschule in Frauenfeld, Thurgau's capital. In some obituaries\n[\n4\n]\nit is commented that he always walked to school, an hour each way, regardless of the weather. His mathematics teachers in Frauenfeld were Wilhelm Schoch and his future colleague\nRebstein\n.\nHerzog was a very good student and matriculated at the Polytechnic in Zürich in\n1870\n. He studied mathematics at the Department for Mathematics and Physics Teachers until\n1874\n. The lecturers who influenced him most were\nSchwarz\n, Karl Culmann and\nWeber\n, as well as\nGeiser\n. After his graduation Herzog received a prize for solving a problem posed at his department, and in\n1875\nhe received a doctorate from the University of Zürich for his thesis\nBestimmung einiger specieller Minimalflächen\n(\nDetermining Some Special Minimal Surfaces\n)\n.\nIn the same year he became assistant to Ludwig Kargl\n(1846\n-\n1875)\nand\nhabilitated\nas\nPrivatdozent\nat the Polytechnic. Herzog took on Kargl's lectures during the professor's illness and after his death. In\n1877\nHerzog was appointed to a full professorship in applied mechanics, which was quite unusual for the time given his young age. He held this post until his death in\n1909\n.\nHerzog was head of the Mechanical-Technical Department for some years, but stepped down from this post when he succeeded his good friend Geiser as Director of the Polytechnic\n(1895\n-\n1899)\n. Geiser acted as Herzog's deputy. Together they founded the Polytechnic's Civil Fund for Widows and Orphans, but Herzog seems to have been the driving force behind the project. During his term in office he also actively supported his younger colleagues in creating an engineering laboratory. As a result, the Polytechnic was one of the first technical universities that could offer its students the opportunity to do practical work.\nThe 'exceptionally gifted'\n[\n3\n]\nteacher Herzog was renowned for his inspiring lectures. He was one of the first to bridge the gap between the mathematical basis of mechanics and practical applications of the subject. At the time there were two schools of thought in mechanics: one that advocated classical mechanics based on Lagrange's work, and one that that tried to explain mechanics in popular terms. Deeming the first as too analytical and missing rigour in the second, Herzog based his lectures on\nJacob Bernoulli\n's work and a synthetic approach. He was very successful with this method; his talent for combining theory and applications 'are already apparent in his thesis\n[\n...\n]\n, according to his competent friend\n[\n...\n]\nGeiser\n'\n[\n6\n]\n. In special, highly popular seminars he introduced his students to more advanced work by\nMaxwell\nand\nMinkowski\n, amongst others. The School Board named him a \"life-long teacher\"\n[\n5\n]\n.\nEngineering companies often asked him to help them solve practical problems, and in particular to recommend young engineers to them. Herzog was committed to further talented students; he also knew the name and background of every student at the Polytechnic\n[\n6\n]\n. When the young\nEinstein\nfailed the Polytechnic's entry exam in\n1895\n, Herzog recommended him to the Kantonsschule in Aarau, where\nEinstein\nindeed obtained the Matura. Having been a keen singer in his student years, Herzog supported the student choir throughout his life.\nBeside his teaching and administrative duties, Herzog still found time to do research. He was 'always busy with some new problem'\n[\n6\n]\n, but subjected his work to a very strict self-censorship. His published research papers concern problems in applied mechanics, such as\nBeitrag zur Theorie des Fachwerkes\nⓉ\n(\nContribution to the theory of trusses\n)\n,\n(1890\nand\n1891)\nand\nÜber den Beschleunigungszustand eines Kurbelviereckes\nⓉ\n(\nOn the accelerating state of a four-bar crank\n)\n(1901)\n.\nIn\n1877\n, Herzog married Elise Bucher from Regensberg\n(\ncanton Zürich\n)\n, the daughter of Nationalrat Bucher. They had three sons, two of whom became jurists and one became a chemist, and one daughter. The family lived in Hottingen, and Herzog was president of the municipality's school authority\n(1889\n-\n1893)\n. He resumed his position when Hottingen was incorporated into Zürich in\n1893\n. Furthermore, he was a member of the Great City Council of Zürich from\n1895\n-\n1898\n.\nOn the occasion of the Polytechnic's\n50\nth\nanniversary in\n1905\n, Herzog was one of its professors who were awarded honorary citizenship of the town Zürich. The other mathematicians honoured in this way were\nFranel\n,\nGraf\nand\nLacombe\n. Herzog was a member of the Polytechnic's alumni association, the\nGesellschaft Ehemaliger Polytechniker\n(\nGEP\n)\nand the\nSchweizerische Naturforschende Gesellschaft\n. The street \"Herzogstrasse\" in the District\n7\nin Zürich was named after him in\n1910\n[\n7\n]\n.\nThe original committee invited Herzog to join the organising committee of the first International Congress of Mathematicians in his capacity as Director of the Polytechnic in November\n1896\n. He was tied up with business on\n12\nNovember\n1896\n, but attended all the other committee meetings. He chaired the amusement committee, which organised the congress outings and dinners together with the reception committee. Herzog, Rudio and Hurwitz were the most active committee members with regards to organising the social side of the congress.\nHerzog's position and connections proved useful for securing the necessary subventions from the authorities. While\nGeiser\nused his contacts in the Bundesrat and the Kantonsrat Zürich, Herzog discussed the town Zürich's financial contribution with councillor Grob\n[\n2\n]\n.\nAt the congress itself, Herzog chaired section IV: Mechanics and Mathematical Physics\nHaving suffered from diabetes and frequent headaches, Albin Herzog died on\n13\nJune\n1909\nfrom a stroke.",
  "math_areas": [
    "Applied Mathematics"
  ]
}