{
  "nome_completo": "Aleksandr Yakovlevich Povzner",
  "nome_curto": "Aleksandr Yakovlevich Povzner",
  "ano_nascimento": "1915",
  "ano_morte": "2008",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Povzner/",
  "lugar_nascimento": "Poltava, Ukraine",
  "lugar_morte": "Washington, D.C., USA",
  "biografia": "Aleksandr Yakovlevich Povzner\nwas born into a Jewish family in Poltava, in central Ukraine. At this time Poltava had a large Jewish community of which the Povzner family were a part. Aleksandr was brought up in Poltava where he attended a seven-year school and then a school for metal workers. He then entered Kharkov State University, graduating in\n1936\n. He remained at Kharkov State University where he undertook research, but he was most strongly influenced by\nNikolai Grigorievich Chebotaryov\nwho was a professor at Kazan State University. Povzner spent much time with\nChebotaryov\nin Kazan while undertaking research in algebra. He published\nThe representation of smallest degree isomorphic to a given Abelian group\n(1937)\n, written to give his partial solution to a problem stated by\nOtto Yulevich Schmidt\nin his book\nThe abstract theory of groups\n, namely given an abstract group, find a permutation representation of least degree. Povzner solved this in the case of abelian groups in his first published paper.\nChebotaryov\ngave Povzner and interest in\nLie\ngroups and he published\nOn binomial Lie groups\n(1938)\nwhich gave a system of axioms defining a binomial\nLie\ngroup. This topic provided the material for his Master's thesis\n(\nequivalent to a Ph.D.\n)\nwhich was awarded in\n1938\n.\nFollowing the award of his Master's degree, Povzner was appointed as a lecturer in the Department of Algebra of the University of Kharkov in\n1938\n. Two further papers on algebra were published following his appointment, namely\nOn nilpotent Lie groups\n(1940)\nand\nÜber positive Funktionen auf einer Abelschen Gruppe\nⓉ\n(\nOn positive functions on an Abelian group\n)\n(1940)\n. In the first of these he introduced bases with particular properties and, using these, indicated a proof of\nGarrett Birkhoff\n's theorem that a nilpotent\nLie\ngroup can be represented by nilpotent matrices. At this stage in his career, however, his interests changed from algebra to analysis and his first publication in his new area of research was\nSur les équations du type de Sturm-Liouville et les fonctions \"positives\"\nⓉ\n(\nOn the equations of Sturm-Liouville type and the ''positive'' functions\n)\n(1944)\n. However, these years were also the time of World War II and Povzner was conscripted into the Soviet Army in July\n1941\nserving until\n1946\n. This did not prevent him continuing to undertake research and he published\nOn equations of the Sturm-Liouville type on a semi-axis\n(1946)\nand a joint paper with Boris Moiseevich Levitan in the same year entitled\nDifferential equations of the Sturm-Liouville type on the semi-axis and Plancherel's theorem\n. Levitan, who was one year older than Povzner, had been both an undergraduate and a graduate student at the University of Kharkov before being appointed as a professor in\n1941\n. Both Levitan and Povzner were serving in the army when they collaborated on their joint paper.\nAfter being demobilised from the army, Povzner returned to take up his teaching position at the University of Kharkov and submitted his doctoral dissertation\n(\nequivalent to the German\nhabilitation\n)\nto Moscow State University. The authors of\n[\n5\n]\nwrite:-\nPovzner's thesis had far-reaching implications. It was one of the first works in which\nGelfand\n's theory of normed rings and\nDelsarte\nand Levitan's theory of generalized displacement operators found a very fruitful application in the spectral analysis of specific operators.\nAfter his appointment to the University of Kharkov in\n1946\n, Povzner continued to teach there until\n1960\nwhen he took up a position in the Institute of Chemical Physics of the\nUSSR Academy of Sciences\n. The years during which he worked at Kharkov were ones during which the mathematical school there blossomed due not only to Povzner but also to\nNaum Il'ich Akhiezer\nand\nVladimir Aleksandrovich Marchenko\n. Although he continued to work at the\nUSSR Academy of Sciences\n, in the\n1970\ns he moved to its Institute of Physics of the Earth. He continued to work there when he was over ninety years old.\nIn addition to the work we have already mentioned, we note that Povzner was the first to apply the technique of transformation operators of\nVolterra\ntype to spectral theory in\n1948\n. His work on the spectral theory of multidimensional differential operators produced important results on scattering theory for multidimensional\nSchrödinger\noperators. He also worked on partial differential equations which describe non-stationary processes. He used computers in an innovative way in solving certain applied mathematics problems and made contributions to statistical physics.\nLet us look now at an important book which Povzner wrote in collaboration with V N Bogaevskii, namely\nAlgebraic methods in nonlinear perturbation theory\n. The book appeared in Russian in\n1987\nand an English translation was published three years later. The book has five chapters:\n1\n. Matrix theory of perturbations.\n2\n. Systems of ordinary differential equations.\n3\n. Examples.\n4\n. Reconstruction.\n5\n. Partial differential equations. The author's have ambitious aims as explained by James Murdock at the beginning of his review of the English version:-\nThis promises to be a very important book, although the material presented is not\n(\nand is not claimed to be\n)\nin definitive form. For a long time, workers in perturbation theory have hoped for a consolidation of all the diverse perturbation methods into a single scheme. There has been a great deal of piecemeal work linking various theories: averaging with normal forms, averaging with multiple scales, matching with multiple scales. One consolidation has been quite successful:\nLie\ntheory has largely replaced all other ways of handling near-identity transformations, in both Hamiltonian and non-Hamiltonian settings, for both averaging and normal forms. But nothing has as yet fully bridged the gap between \"oscillatory\" theories\n(\nsuch as averaging, normal forms, and certain kinds of multiple scales methods\n)\nand \"transition layer\" theories\n(\nsuch as matching and other kinds of multiple scales\n)\n. It is this which is attempted in the present book. Roughly, the claim seems to be that a generalization of the normal form method, together with a generalized idea of rescaling\n(\nwhich the authors call \"reconstruction\"\n)\n, is applicable to all perturbation problems. Matching arises when two\n(\nor more\n)\nreconstructions are possible. In this case the general process of reconstructing-and-normalizing will already have put the problem in the simplest form so that the correct way of matching becomes clear.\nAs to Povzner's character, the authors of\n[\n7\n]\nwrite:-\nPovzner was a wonderful lecturer. His lectures and seminars at Kharkov University were always extremely popular and attracted many young people. Undergraduate and graduate students and colleagues remember well the attractiveness of his personality, which exerted a tremendous influence on all those around him. Especially appealing were his unconventional thinking and opinions, not only in questions of science but also in various aspects of culture and modern life.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}