{
  "nome_completo": "Aleksandr Aleksandrovich Friedmann",
  "nome_curto": "Alexander Friedmann",
  "ano_nascimento": "1888",
  "ano_morte": "1925",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Friedmann/",
  "lugar_nascimento": "St Petersburg, Russia",
  "lugar_morte": "Leningrad, USSR (now St Petersburg, Russia again)",
  "biografia": "Alexander Friedmann\n's date of birth is often given as\n29\nJune. However this is an error which came about in converting the \"Old Style\" Russian date to the \"New Style\" date, which requires an addition of\n12\ndays. Rather strangely Friedmann wrongly converted his own date of birth to\n17\nJune\n(\nit should have been\n4\n+\n12\n=\n16)\n. Then, not realising that the date he gave had already been converted, it was converted again\n(17\n+\n12\n=\n29)\n.\nFriedmann's father was a ballet dancer and his mother was a pianist. However the parents divorced when Alexander was nine years old. Records show that the church sided with the father and Alexander stayed with his father who soon remarried. Alexander entered the Second St Petersburg\nGymnasium\nin August\n1897\nand his record shows a quite ordinary school performance at first. Soon however Friedmann became one of the top two pupils in his class. The other outstanding pupil was\nYakov Tamarkin\n, also an extraordinary mathematician, and the two boys were close friends, almost always together during their years at school and university.\nIn\n1905\nFriedmann and\nTamarkin\nwrote a paper on\nBernoulli numbers\nand submitted the paper to\nHilbert\nfor publication in\nMathematische Annalen\n. The paper was accepted and appeared in print in\n1906\n. The year\n1905\nwas not only one of great scientific importance for Friedmann, it was also one where he was extremely active politically. Friedmann and\nTamarkin\nwere student leaders of strikes at the school in protest at the government's repressive measures against schools.\nFriedmann graduated from school in\n1906\nand entered the University of St Petersburg in August of that year. There he was strongly influenced by\nSteklov\nwho had taken up an appointment at St Petersburg in the year Friedmann entered and shared Friedmann's political views. Friedmann was also influenced by\nEhrenfest\nwho moved to St Petersburg in\n1906\n. By\n1907\nEhrenfest\nhad set up a modern physics seminar which was attended by a number of young physicists and by the two young mathematicians Friedmann and\nTamarkin\n. This group discussed\nquantum theory\n, relativity and\nstatistical mechanics\n.\nWhile Friedmann was an undergraduate at St Petersburg his father died. After he completed his studies in\n1910\nhis scientific advisor,\nSteklov\n, wrote a reference for Friedmann to continue his studies. The death of Friedmann's father clearly had financial implications as the reference indicated, see\n[\n3\n]\n:-\nMr Friedmann is without means and when at the University made his living by private tutoring, proof-reading and earning a small salary.\nSteklov\nalso wrote of Friedmann's mathematical work in his final year as an undergraduate:-\nIn his last year at the University he was working on an essay on the subject I assigned: 'Find all orthogonal substitutions such that the\nLaplace equation\n, transformed for the new variables, admits particular solutions in the form of a product of two functions, one of which depends only on one, and the other on the other two variables'. I touched on this problem in my doctoral thesis, but did not treat it in detail.. I suggested that Mr Friedmann should try to solve this problem, in view of his outstanding working capacity and knowledge compared with other persons of his age. In January of this year, Mr Friedmann submitted to me an extensive study of about\n130\npages, in which he gave a quite satisfactory solution of the problem. ...\nFriedmann began to study for his Master's Degree and, in\n1911\n, became involved with a circle formed to study mathematical analysis and mechanics. In addition to Friedmann, other members of the circle included\nTamarkin\n,\nSmirnov\n, Petelin, Shokhat and, a little later,\nBesicovitch\njoined the circle. Friedmann lectured on\nClebsch\n's work on elasticity and other topics including\nGoursat\n's books. While studying for his Master's Degree Friedmann lectured at the Mining Institute, cooperating there with\nNikolai Krylov\n, and he also taught at the Railway Engineering Institute. Through this work Friedmann became interested in aeronautics and in\n1911\nhe published an article surveying the area describing, in particular, the contributions of\nZhukovsky\nand\nChaplygin\n.\nBy\n1913\nFriedmann had completed the necessary examinations for the Master's Degree having been examined by\nMarkov\n,\nSteklov\nand others. In February\n1913\nhe was appointed to a position in the Aerological Observatory in Pavlovsk, a suburb of St Petersburg, where he was to study meteorology. In\n1914\nFriedmann went to Leipzig to study with\nVilhelm Bjerknes\n, the leading theoretical meteorologist of the time. Friedmann left Leipzig in the summer of\n1914\nand took part in several flights in airships to make observations.\nWhen Austria gave Serbia an ultimatum after the June\n1914\nassassination of Archduke Francis Ferdinand, Russia supported Serbia, so Germany came to the support of Austria. World War I broke out on\n1\nAugust\n1914\nand Friedmann soon sought permission from the Head of the Observatory to join the volunteer aviation detachment. He began flying aircraft and was soon involved in bombing raids. He continued to study mathematics, writing and exchanging mathematical ideas with\nSteklov\nby letter. In a letter to\nSteklov\nwritten on\n5\nFebruary\n1915\nFriedmann writes, see\n[\n3\n]\n:-\nMy life is fairly even, except such accidents as a shrapnel explosion twenty feet away, the explosion of an Austrian bomb within half a foot, which turned out almost happily, and falling down on my face and head, which resulted in a ruptured upper lip and headaches. But one gets used to all this, of course, particularly seeing things all around which are a thousand times more awful.\nAlso in this letter he asked\nSteklov\n's advice on integrating equations he had obtained from theoretically modelling bombs dropping. At this time the Russians were blockading the town of Przemysl, which was defended by Austrian troops, and Friedmann flew bombing missions over the town. He had used his mathematical skills, together with a suggestion from\nSteklov\n, to compute the trajectory that the bomb would take. In a letter of\n28\nFebruary\n1915\nhe wrote:-\nI have recently had a chance to verify my ideas during a flight over Przemysl; the bombs turned out to be falling almost the way the theory predicts. To have conclusive proof of the theory I'm going to fly again in a few days.\nFriedmann was awarded the George Cross for bravery with his flights over Przemysl. In the summer of\n1915\nthe Russian army retreated on its south west front. Friedmann was sent to Kiev and there he gave lectures on aeronautics for pilots. In March\n1916\nhe was appointed Head of the Central Aeronautical Station in Kiev. In Kiev, Friedmann joined the Mathematical Society which had among its members Ch T Bialobzeski, P V Voronets,\nB N Delone\n,\nD A Grave\n,\nA P Kotelnikov\n, V P Linnik\n(\nI V Linnik\n's father\n)\nand\nO Yu Schmidt\n. In April\n1917\nthe Central Aeronautical Station moved to Moscow, and Friedmann moved there.\nThe Revolution of October\n1917\nbecame inevitable when Alexander Kerensky, the prime minister, sent troops to close down two Bolshevik newspapers. Lenin, who had been in hiding, made a public appearance telling the Bolsheviks to overthrow the Government. On the morning of October\n26\n, after hardly any bloodshed, Lenin proclaimed that the Soviets were in power. After this, the work of the Central Aeronautical Station was stopped and Friedmann began to look for another post, but he was unsure of the direction he should take, particularly since his health had suffered as a result of the war. He wrote to\nSteklov\nsaying:-\nI'm very depressed; I often bitterly regret taking part in the war; it seems I achieved what I set out to do, but what's the use of it all now?.\nOn\n13\nApril\n1918\nFriedmann was elected an extraordinary professor in the Department of Mathematics and Physics at the University of Perm. Among the young colleagues he had there were A S\nBesicovitch\n, I M\nVinogradov\n, N M Gunter and R O Kuzmin. At Perm Friedmann set up an Institute of Mechanics and became a member of the editorial board of the Journal of the newly founded Physico-Mathematical Society of Perm University.\nThe Russian nation was plunged into civil war. The Red Army had been formed in February\n1918\nwith Trotsky as its leader. The Reds opposed the White Army formed of anticommunists led by former imperial officers. In fact Friedmann had commented on the Red Army in Perm on\n27\nApril\n1918\nwhen he wrote:-\nPerm is surprisingly calm, and everything is done in the city in family fashion, in a good way, even the training of the Red army, which is\n30\n-\n40\nstrong.\nHowever, on\n20\nDecember\n1918\n, he wrote:-\nPerm has come under an unlucky star. There is a rapid, overall and fairly chaotic evacuation. The University is in the second line of evacuation, but no transport or packing materials have been supplied so far, and the evacuation is at a standstill. ... I personally am not inclined to leave the city ...\nA week later the White Army occupied Perm. They controlled the town until August\n1919\nwhen the Red Army took control again. As the Red Army had approached Friedmann and all the staff, except\nBesicovitch\n, had left the University. Friedmann wrote:-\nThe only person who kept his head and saved the remaining property was\nBesicovitch\n, who is apparently A A\nMarkov\n's disciple not only in mathematics but also with regard to resolute, precise definite actions.\nIn the spring of\n1920\n, with the Civil war still raging, Friedmann returned to St Petersburg\n(\nnow named Petrograd\n)\nto take up a post at the Main Geophysical Observatory. Friedmann was never one to take life easy and he took up an impressive number of appointments in\n1920\nin Petrograd. He began teaching mathematics and mechanics at Petrograd University, became a professor in the Physics and Mathematics Faculty of the Petrograd Polytechnic Institute, worked in the Department of Applied Aeronautics at Petrograd Institute of Railway Engineering, worked at the Naval Academy and undertook research at the Atomic Commission at the Optical Institute.\nIn\n1922\n, nine years after completing the examinations for this Master's Degree, Friedmann submitted his Master's dissertation. The dissertation was entitled\nThe Hydromechanics of a Compressible Fluid\nand was in two parts, the first on the kinematics of vortices and the second on the dynamics of a compressible fluid. It was this work which stimulated the later work on hydrodynamics by\nKochina\n.\nFriedmann had taken up a new interest soon after returning to Petrograd.\nEinstein\n's general theory of relativity, although published in\n1915\n, was not known in Russia due to World War I and the Civil War. By late\n1920\n, Friedmann wrote in a letter to\nEhrenfest\n:-\nI have been working on the axiomatics of the relativity principle, proceeding from two underlying propositions:\n(1)\nuniform motion remains uniform for the uniformly moving world and\n(2)\nthe velocity of light is constant\n(\nidentical in the moving and stationary world\n)\n, and have obtained formulae for a world with one space dimension which are more general than\nLorentz\n's transformations ...\nFriedmann sent the article\nOn the curvature of Space\nto\nZeitschrift für Physik\nand it was received by the journal on\n29\nJune\n1922\n. In the paper Friedmann showed that the radius of curvature of the universe can be either an increasing or a periodic function of time. Friedmann, writing about the results of the paper in a book a little later, describes the results as follows:-\nThe stationary type of Universe comprises only two cases which were considered by\nEinstein\nand de\nSitter\n. The variable type of Universe represents a great variety of cases; there can be cases of this type when the world's radius of curvature ... is constantly increasing in time; cases are also possible when the radius of curvature changes periodically ...\nEinstein\nquickly responded to Friedmann's article. His reply was received by\nZeitschrift für Physik\non\n18\nSeptember\n1922\n:-\nThe results concerning the non-stationary world, contained in\n[\nFriedmann's\n]\nwork, appear to me suspicious. In reality it turns out that the solution given in it does not satisfy the field equations.\nOn\n6\nDecember Friedmann wrote to\nEinstein\n:-\nConsidering that the possible existence of a non-stationary world has a certain interest, I will allow myself to present to you here the calculations I have made ... for verification and critical assessment.\n[\nThe calculations are given\n]\n... Should you find the calculations presented in my letter correct, please be so kind as to inform the editors of the Zeitschrift für Physik about it; perhaps in this case you will publish a correction to your statement or provide an opportunity for a portion of this letter to be published.\nHowever by the time the letter reached Berlin,\nEinstein\nhad already left on a trip to Japan. He did not return to Berlin until March but he still did not seem to have read Friedmann's letter. Only Krutkov, when a colleague of Friedmann's from Petrograd, met Einstein at\nEhrenfest\n's house in Leiden in May\n1923\nand told him of the details contained in Friedmann's letter did\nEinstein\nadmit his error. He wrote immediately to\nZeitschrift für Physik\n:-\nIn my previous note I criticised\n[\nFriedmann's work On the curvature of Space\n]\n. However, my criticism, as I became convinced by Friedmann's letter communicated to me by Mr Krutkov, was based on an error in my calculations. I consider that Mr Friedmann's results are correct and shed new light.\nIn July\n1923\nFriedmann left Petrograd to visit Germany and Norway. In Germany he visited Berlin, Hamburg, Potsdam and Göttingen. In Norway he visited Christiania\n(\nOslo\n)\n. He discussed meteorology, aeronautics and mechanics. In Göttingen he talked to Prandtl and\nHilbert\n, talking to\nHilbert\nabout his work in relativity. The following year,\n1924\n, Friedmann was travelling again, this time to the First International Congress for Applied Mathematics held at Delft. He wrote about the congress:-\nEverything went well at the congress, the attitude towards the Russians was wonderful; in particular, I was included among the members of the committee for convening the next conference. ...\nCourant\nfrom Göttingen got interested in\nTamarkin\n's work.\nBlumenthal\n,\nKármán\nand\nLevi-Civita\ngot interested in my and my colleagues work.\nIn July\n1925\nFriedmann made a record-breaking ascent in a balloon to\n7400\nmetres to make meteorological and medical observations. He returned to Leningrad\n(\nPetrograd had been renamed Leningrad in\n1924)\n. Near the end of August\n1925\nFriedmann began to feel unwell. He was diagnosed as having typhoid and taken to hospital where he died two weeks later.\nIn\n[\n3\n]\nFriedmann's contributions are summed up as follows:-\n... Friedmann is seen as a profound, independent-minded, and daring thinker who destroys scientific prejudices, myths and dogmas; his intellect sees what others do not see, and will not see what others believe to be obvious but for which there are no grounds in reality. He rejects the centuries-old tradition which chose, prior to any experience, to consider the Universe eternal and eternally immutable. He accomplishes a genuine revolution in science. As\nCopernicus\nmade the Earth go round the Sun, so Friedmann made the Universe expand.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}