{
  "nome_completo": "Alexander Grothendieck",
  "nome_curto": "Alexander Grothendieck",
  "ano_nascimento": "1928",
  "ano_morte": "2014",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Grothendieck/",
  "lugar_nascimento": "Berlin, Germany",
  "lugar_morte": "Saint-Girons, France",
  "biografia": "Alexander Grothendieck\n's first name is often written as Alexandre, the form he adopted when living in France. His parents were Alexander Schapiro\n(1890\n-\n1942)\nand Johanna Grothendieck\n(1900\n-\n1957)\n. His father was known by the standard Russian name of Sascha\n(\nfor Alexander\n)\nwhile his mother was called Hanka. In order to get some understanding of Grothendieck's upbringing and personality, it is necessary to give some details about his parents, and in particular explain why he has his mother's name of Grothendieck. Alexander Schapiro was a Russian Jew, born in Novozybkov, a town near the point where Russia, White Russia\n(\nnow Belarus\n)\n, and Ukraine met. At the age of fifteen he fought for the revolutionaries against the Russian tsars in the war beginning in\n1905\n. In\n1907\nhe and his comrades were captured and sentenced to death. His comrades were all shot by firing squad but Schapiro, although led to be executed for\n20\nconsecutive days, was eventually given life imprisonment because of his youth. He was ten years in prison before escaping during the Revolution of\n1917\n. He continued to fight for the anarchists and was captured and escaped several times, on one occasion losing his left arm. He married a Jewish woman Rachil and they had a son named Dodek. Eventually, in\n1921\n, he escaped to live for a while in Berlin and then in Paris under the name Alexander Tanaroff. He made a living as a street photographer. Grothendieck's mother, Hanka Grothendieck, was born in Hamburg, in Germany, and joined several left-wing groups. She married Alfred Raddatz\n(\nknown as Johannes\n)\nand they had a daughter named Frode, known as Maidi, born in\n1924\n. On a visit to Berlin, Alexander Schapiro met Hanka and they had a son, Alexander\n(\nknown as Schurik\n)\n, who is the subject of this biography. His birth was recorded under the name Alexander Raddatz since, at the time of his birth, his mother was marred to Alf Raddatz. Alf and Hanka were divorced in\n1929\n. Alexander Schapiro\n(\nwho still called himself Alexander Tanaroff\n)\nand Hanka lived with their son Schurik and his mother's daughter Maidi in Berlin from\n1928\nto\n1933\n. There they had a photographic studio which provided the family income.\nAdolf Hitler became Chancellor of the German Reich on\n30\nJanuary\n1933\n. On\n1\nApril\n1933\nthere was the so-called \"boycott day\" when Jewish shops and businesses were boycotted. On\n7\nApril\n1933\nthe Nazis passed a law which, under clause three, ordered the retirement of civil servants who were not of Aryan descent. Although Alexander Schapiro was hiding his Jewish origins by using the name Tanaroff, he still considered that Berlin was too dangerous a place for a Jew and he returned to Paris in May\n1933\n. Hanka and her son Alexander remained in Berlin until December\n1933\nwhen she arranged for five year old Alexander to be fostered by the pastor Wilhelm Heydorn and his wife Dagmar who lived in Hamburg. She put her daughter Maidi into an institution in Berlin. Schurik, together with other foster children, lived with the Heydorns from the beginning of\n1934\nuntil April\n1939\n. He attended elementary school and then began his studies at the\nGymnasium\n. Meanwhile Hanka had joined Alexander's father in Paris and, after the outbreak of the Spanish Civil War\n(1936\n-\n39)\n, they both went to Spain where they supported the Republicans. After the defeat of the Republicans in early\n1939\n, Alexander and Hanka returned to France where Hanka began working in Nîmes. By the end of April\n1939\nthe Heydorns, who were now in serious danger as part of the resistance against Hitler, considered that their home was too dangerous a place for young Schurik so, having located his parents in France, put him on a train to join his father. He spent the summer of\n1939\nwith his mother in Nîmes.\nThe outbreak of World War II meant that Schurik and his parents were now in considerable danger in France. The law concerning 'undesirables' had been passed on\n12\nNovember\n1938\nwhich required all Germans living in France to be sent to special internment camps. Hanka and Schurik were interned in the Rieucros Camp near Mende. However, Schurik was allowed to continue his education at the village school about\n5\nkm from the Camp. He also was given some private tutoring. Schurik's father, Alexander, was interned at the Camp du Vernet. In\n1942\nthe Rieucros Camp was closed so Schurik and his mother were sent to the Gurs concentration camp near Pau. Schurik somehow managed to get to Le Chambon sur Lignon where he attended the famous Collège Cévénol. He would hide in the woods every time the authorities came round looking for Jews. He obtained his baccalauréat at the College in\n1945\n. Meanwhile, in August\n1942\nhis father had been handed over by the French Vichy government to the Nazis who took him from the Camp du Vernet to the Auschwitz extermination camp where he perished. Let us note at this point that Maidi survived the war and eventually emigrated to the United States.\nIn\n1945\nSchurik, who we will now start to call Grothendieck, and his mother moved to the village of Maisargues near Montpellier where Grothendieck worked in the vineyards and also, with the aid of a small scholarship, studied mathematics at the University of Montpellier. While at school he had felt dissatisfied with some of the mathematics that had been presented to him\n(\nsee, for example\n[\n16\n]\n)\n:-\nWhat was least satisfying to me in our high school mathematics books was the absence of any serious definition of the notion of length of a curve, of area of a surface, of volume of a solid. I promised myself I would fill this gap when I had the chance.\nHe didn't find his professors at Montpellier much help in filling these gaps so he had to work on his own\n[\n8\n]\n:-\nIt was in Montpellier, during his undergraduate days, that he underwent his first real mathematical experience. He was very dissatisfied with the teaching he was receiving. He had been told how to compute the volume of a sphere or a pyramid, but no one had explained the definition of volume. It is an unmistakable sign of a mathematical spirit to want to replace the \"how\" with a \"why\". A professor of Grothendieck's assured him that a certain\nLebesgue\nhad resolved the last outstanding problems in mathematics, but that his work would be too difficult to teach. Alone, with almost no hints, Grothendieck rediscovered a very general version of the\nLebesgue\nintegral. The genesis of this first mathematical piece of work\n[\nwas\n]\naccomplished in total isolation ...\nLet us note that the professor at Montpellier who believed that\nLebesgue\nhad solved all outstanding mathematics problems was a certain M Soula. He had been taught by\nÉlie Cartan\nand he advised Grothendieck to go to Paris and work with\nCartan\n. Grothendieck followed that advice and, after graduating from Montpellier with his licence, he spent the year\n1948\n-\n49\nat the École Normale Supérieure in Paris. There he attended\nHenri Cartan\n's seminar which was on\nalgebraic topology\nand sheaf theory. Grothendieck was now rubbing shoulders with the leading mathematicians of the day who were also attending\nHenri Cartan\n's seminar including\nClaude Chevalley\n,\nJean Delsarte\n,\nJean Dieudonné\n,\nRoger Godement\n,\nLaurent Schwartz\n, and\nAndré Weil\n. One of Grothendieck's fellow students was\nJean-Pierre Serre\n. Since Grothendieck was at this time more interested in topological vector spaces than he was in algebraic topology,\nAndré Weil\nand\nHenri Cartan\nboth advised him to go to Nancy where there was a strong team including\nJean Dieudonné\n,\nJean Delsarte\n,\nRoger Godement\nand\nLaurent Schwartz\n.\nIn\n1949\nGrothendieck moved to the University of Nancy where he lived with his mother who was occasionally bedridden due to tuberculosis contracted in the internment camps. At this time Grothendieck had a son named Serge with the lady from whom they rented rooms. Serge was brought up largely by his mother. Grothendieck worked on functional analysis with\nDieudonné\n[\n16\n]\n:-\nGrothendieck had very few books; rather than learning things by reading, he would try to reconstruct them on his own. And he worked very hard.\nAt Nancy there was an active seminar every Saturday in which all the professors and some of the students participated, which studied a variety of different topics. It provided a wonderful environment for the young Grothendieck.\nDieudonné\nwrites\n[\n9\n]\n:-\nA general theory of duality for locally convex spaces had to be worked out:\nSchwartz\nand I had started its study for\nFréchet\nspaces and their direct limits, but we had met a series of problems we could not solve. We therefore proposed them to Grothendieck, and the result turned out to exceed our most sanguine expectations. In less than a year, he had solved all our problems by very ingenious new constructions; then, with the techniques he had developed, he started to work on many other questions in\nfunctional analysis\n.\nHe presented his doctoral thesis\nProduits tensoriels topologiques et espaces nucléaires\nⓉ\n(\nTopological tensor products and nuclear spaces\n)\nin\n1953\nand one of those present at his thesis defence on\n28\nFebruary\n1953\nwas\nBernard Malgrange\nwho\n[\n16\n]\n:-\n... recalled that after Grothendieck wrote his thesis he asserted that he was no longer interested in topological vector spaces. \"He told me, 'There is nothing more to do, the subject is dead',\"\nMalgrange\nrecalled. At that time, students were required to prepare a \"second thesis\", which did not contain original work but which was intended to demonstrate depth of understanding of another area of mathematics far removed from the thesis topic. Grothendieck's second thesis was on sheaf theory, and this work may have planted the seeds for his interest in\nalgebraic geometry\n, where he was to do his greatest work. After Grothendieck's thesis defense, which took place in Paris, Malgrange recalled that he, Grothendieck, and\nHenri Cartan\npiled into a taxicab to go to lunch at the home of\nLaurent Schwartz\n. They took a cab because\nMalgrange\nhad broken his leg skiing. \"In the taxi\nCartan\nexplained to Grothendieck some wrong things Grothendieck had said about sheaf theory,\"\nMalgrange\nrecalled.\nGrothendieck spent the years\n1953\n-\n55\nat the University of São Paulo and then he spent the following year at the University of Kansas. However it was during this period that his research interests changed and they moved towards topology and geometry. In fact during this period Grothendieck had been supported by the Centre National de la Recherche Scientifique, the support beginning in\n1950\n. After leaving Kansas in\n1956\nhe therefore returned to the Centre National de la Recherche Scientifique. Around this time, he became one of the\nBourbaki\ngroup of mathematicians which included\nAndré Weil\n,\nHenri Cartan\nand\nJean Dieudonné\n. However in\n1959\nhe was offered a research position in the newly formed Institut des Hautes Études Scientifiques which he accepted. In\n[\n2\n]\nthe next period in Grothendieck's career is described as follows:-\nIt is no exaggeration to speak of Grothendieck's years\n1959\n-\n70\nat the IHES as a 'Golden Age', during which a whole new school of mathematics flourished under Grothendieck's charismatic leadership. Grothendieck's Séminaire de Géométrie Algébrique\nⓉ\n(\nAlgebraic geometry seminar\n)\nestablished the IHES as a world centre of algebraic geometry, and him as its driving force.\nDuring this period Grothendieck's work provided unifying themes in geometry, number theory, topology and complex analysis. He introduced the theory of schemes in the\n1960\ns which allowed certain of\nWeil\n's number theory conjectures to be solved. He worked on the theory of topoi which are highly relevant to mathematical logic. He gave an algebraic proof of the\nRiemann\n-\nRoch\ntheorem. He provided an algebraic definition of the fundamental group of a curve.\nAgain quoting from\n[\n2\n]\n:-\nThe mere enumeration of Grothendieck's best known contributions is overwhelming: topological tensor products and nuclear spaces, sheaf cohomology as derived functors, schemes, K-theory and Grothendieck-\nRiemann\n-\nRoch\n, the emphasis on working relative to a base, defining and constructing geometric objects via the functors they are to represent, fibred categories and descent, stacks, Grothendieck topologies\n(\nsites\n)\nand topoi, derived categories, formalisms of local and global duality\n(\nthe 'six operations'\n)\n, étale cohomology and the cohomological interpretation of L-functions, crystalline cohomology, 'standard conjectures', motives and the 'yoga of weights', tensor categories and motivic\nGalois\ngroups. It is difficult to imagine that they all sprang from a single mind.\nIn the late\n1950\ns, Grothendieck lived with Mireille, with whom he had three children: Johanna, Mathieu, and Alexandre. He married Mireille a few years later. Luc Illusie began attending Grothendieck's seminar at the Institut des Hautes Études Scientifiques in\n1964\n. He writes\n[\n13\n]\n:-\nHe spoke with great energy at the board but taking care to recall all the necessary material. He was very precise. The presentation was so neat that even I, who knew nothing of the topic, could understand the formal structure. It was going fast but so clearly that I could take notes.\nIllusie goes on to describe visiting Grothendieck to discuss his work\n[\n13\n]\n:-\nAt the time he lived at Bures-sur-Yvette, rue de Moulon, in a little white pavilion, with a ground floor and one storey. His office there was austere, and cold in the winter. He had a portrait of his father in pencil, and also on the table there was the mortuary mask of his mother. Behind his desk he had  filing cabinets. When he wanted some document, he would just turn back, and  find it in no time. He was well organized.\nValentin Poénaru also knew Grothendieck during these years. He writes\n[\n21\n]\n:-\nThe Grothendieck I knew at this time was a very impressive person, and when I say this I am not thinking only of mathematics. Shourik, as I called him, was one of the strongest and most charismatic people I have ever met. I think of him as a character straight out of Dostoyevsky. He was also a person of great kindness and generosity. He seemed always to be in good spirits, with great mental equilibrium and also, in his own way, a certain joie de vivre. At the time, he had the capacity to be able to sleep when he wanted to, and for the number of hours he wanted to, in order to take up his work all the better afterward. In fact, his capacity for work was to me something miraculous.\nThe authors of\n[\n2\n]\nwrite:-\nHe received the\nFields\nMedal in\n1966\n. In looking back at this period, one marvels at the generosity with which Grothendieck shared his ideas with colleagues and students, the energy he and his collaborators devoted to meticulous redaction, the excitement with which they set out to explore a new land.\nThe citation for the\nFields Medal\nreads:-\nGrothendieck built on work of\nWeil\nand\nZariski\nand effected fundamental advances in algebraic topology. He introduced the idea of K-theory\n(\nthe Grothendieck groups and rings\n)\n. He revolutionised homological algebra in his celebrated \"Tohoko paper\".\nThe \"Tohoko paper\" referred to in this citation is about abelian categories, sheaves of modules, resolutions, derived functors, and the Grothendieck spectral sequence. However, there were certain difficulties in making the presentation of the\nFields\nMedal since the\n1966\nInternational Congress of Mathematicians at which the presentation was to be made was held in Moscow in August\n1966\n. Now Grothendieck was always strongly pacifist in his views and he had campaigned against the military built-up of the\n1960\ns. As a political protest, he refused to travel to Moscow to receive the\nFields\nmedal. At the Congress, Léon Motchane, director of IHES, received the Fields Medal on Grothendieck's behalf. Grothendieck made no public statement about the reasons for not going to Moscow but he declared himself a citizen of the world and requested United Nations citizenship. In November and December of\n1967\nhe visited North Vietnam which, at that time, was being bombed by the Americans\n[\n18\n]\n:-\nGrothendieck's first lectures - which he describes as \"general orientation talks\" - were given in Hanoi. But because of intensified bombing of the capital, a high-level decision was made to move everyone to the secret location of the Faculty of Mathematics of Hanoi University. Grothendieck writes: \"I then spent a week and a half at Hanoi University in evacuation outside the city\n(\nabout\n100\nkm from the capital\n)\n; this time was largely devoted to a more specialized seminar on categories and homological algebra, with thirty to forty listeners, most of whom had followed me from Hanoi after attending the general orientation lectures.\" It was a remarkable event in the history of mathematics: one of the giants of\n20\nth\ncentury mathematics delivering a short course on homological algebra in a remote forest hideout in a desperately poor country that was being \"bombed back into the stone age\"\n(\nU.S. Air Force General Curtis Le May's phrase\n)\nby the most powerful military force the world had ever known.\nHe left the IHES in\n1970\nafter he discovered that some of their funding came from military sources. He discovered this in\n1969\nand, along with the other professors at the IHES, he persuaded the director, Léon Motchane, to take no further funding from the French military. However, when a few months later the IHES budget was very tight, the director went back on his word. Grothendieck tried to persuade all the professors to resign in protest but the others refused to follow his example. Grothendieck's letter of resignation was dated\n25\nMay\n1970\n. However, Grothendieck had other problems for he wrote that at this time he was suffering a \"spiritual stagnation\". He abandoned mathematics as the main focus of his energies and turned to political protest, particularly against nuclear proliferation. However, in contrast to the amazing impact of his mathematical work, his political campaigns were rather ineffective. In\n1970\n-\n72\nhe held an appointment as visiting professor at the Collège de France, then a similar appointment at Orsay for\n1972\n-\n73\n. In\n1973\nhe accepted an appointment as professor at the University of Montpellier. He lectured and has some graduate students in Montpellier. He lived in Villecun near Lodeve from\n1973\nto\n1980\n, then he moved to live in Mormoiron near Carpentras. He took leave during\n1984\n-\n88\nto direct research at the Centre National de la Recherche Scientifique. He retired at age\n60\nin\n1988\nand the publication\n[\n2\n]\nwas produced to honour that\n60\nth\nbirthday. In contrast to his acceptance of the\n1966\nFields\nMedal, Grothendieck declined the Crafoord Prize in\n1988\n.\nBetween\n1980\nand\n1990\n, Grothendieck wrote literally thousands of pages some containing his mathematical thoughts and others containing non-mathematical meditations. His mathematical manuscripts are\nLa longue marche à travers la théorie de Galois\nⓉ\n(\nThe long march through Galois theory\n)\n(1981)\n,\nA la poursuite des champs\nⓉ\n(\nIn pursuit of  fields\n)\n(1983)\n,\nEsquisse d'un programme\nⓉ\n(\nAn outline programme\n)\n(1983)\n, and\nLes dérivateurs\nⓉ\n(\nDerivations\n)\n(1987)\n, while his non-mathematical works are the\nEloge\nⓉ\n(\nPraise\n)\n(1981\n, but apparently subsequently lost\n)\n,\nRécoltes et Semailles\nⓉ\n(\nCrops and seeds\n)\n(1983\n-\n85)\n, and\nLa clef des songes\nⓉ\n(\nKey of dreams\n)\n(1986)\n. In August\n1991\nhe left home suddenly, without informing anyone, for an unknown location. There he spent his time writing an extremely large work on physics as well as philosophical meditations on themes such as free choice, determinism and the existence of evil. He refused practically every human contact.\nMore about his life during this period is at\nTHIS LINK\n.\nLet us end with some quotations from Grothendieck's correspondence with Ronnie Brown at Bangor. Ronnie writes:-\nHe could be totally absorbed in mathematical ideas. One letter remarks that he is thinking of a new theory of form, and has to remind himself to eat and to sleep. He had a strong interest in detail and small things. He was against 'le snobisme', and so was delighted with a comment of\nHenry Whitehead\n: 'It is the snobbishness of the young to suppose that a theorem is trivial because the proof is trivial.' He wrote that mathematics is not only about doing difficult things, but also providing the framework to make difficult things easy\n(\nthus giving new opportunities for difficult tasks!\n)\n.\nGrothendieck writes\n(\nin\n1982)\n:-\nThe introduction of the cipher\n0\nor the group concept was general nonsense too, and mathematics was more or less stagnating for thousands of years because nobody was around to take such childish steps ...\nFor Grothendieck's ideas on speculation in mathematics see\nTHIS LINK\n.\nHere are two further quotes by Grothendieck from this correspondence\n(\nin\n1983)\n:-\nThe question you raise  \"how can such a formulation lead to computations\" doesn't bother me in the least! Throughout my whole life as a mathematician, the possibility of making explicit, elegant computations has always come out by itself, as a byproduct of a thorough conceptual understanding of what was going on. Thus I never bothered about whether what would come out would be suitable for this or that, but just tried to understand - and it always turned out that understanding was all that mattered.\n[\nOften the route to solving problems is\n]\nto bring new concepts out of the dark.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}