{
  "nome_completo": "Alexander Weinstein",
  "nome_curto": "Alexander Weinstein",
  "ano_nascimento": "1897",
  "ano_morte": "1979",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weinstein/",
  "lugar_nascimento": "Saratov, Russia",
  "lugar_morte": "Washington DC, USA",
  "biografia": "Alexander Weinstein\n's parents were Judel Lejb Weinstein, born October\n1859\nin Grodno, Hrodna, Belarus, and Praskovya Levkovich, born\n12\nFebruary\n1867\nin Saratov, Russia. The family were Jewish and when Alexander was born Judel Weinstein was a well-off doctor. The family moved to Astrakhan, near the Caspian Sea, and it was there that Alexander completed middle school winning the gold medal; at this stage he was planning to study astronomy. The family decided to leave Russia and emigrate to Germany. It was there that Alexander completed his schooling, studying first in Würzburg, and then at the University of Göttingen during\n1913\n/\n14\n. Judel and Praskovya Weinstein must have returned to Russia since Hermann Weyl wrote about Alexander Weinstein in\n1940\n[\n6\n]\n:-\n... both his parents were killed or starved to death during the Bolshevik revolution.\nLeaving Göttingen, Weinstein moved to Zürich and he continued his interest in astronomy carrying out observations the Federal Observatory. He soon realised, however, that his true vocation was directed towards mathematics rather than astronomy and dedicated himself to this. He undertook research under\nHermann Weyl\nand\nRudolf Fueter\nand was awarded a doctorate in\n1921\nfor his thesis on the tensor calculus and linear groups of matrices,\nFundamentalsatz der Tensorrechnung\nⓉ\n(\nFundamental theorem of tensor calculus\n)\n. It was published in\nMathematische Zeitschrift\nin December\n1923\nhaving been submitted in February\n1922\n. He had a second publication in\n1923\n, namely\nSur l'unicité des mouvements glissants\nⓉ\n(\nOn the uniqueness of sliding movements\n)\n, written in French and published in\nComptes Rendus\nof the\nAcadémie des Sciences\n, which investigates the movements of an ideal liquid. He introduces the paper as follows:-\nI propose to study the problem of the uniqueness of the discontinuous plane motion of the permanent flow of a jet of ideal fluid through the orifice of a vessel with given fixed walls, considering only the movements analysed by M Cisotti where the fluid follows the walls to leave them only at the orifice. An answer to this question, interesting in itself, could be important for the study by the method of continuity of the problem of existence of a movement with given walls. The difficulty of obtaining a result on uniqueness comes from the fact that it is not a question here of the conformal representation of one given domain or another.\nWeyl\nrealised that his student Weinstein was extraordinarily talented and tried to put him in contact with leading mathematicians so that he could gain further experience. One suggestion was working with Paul Sophus Epstein\n(1883\n-\n1966)\n, the Jewish mathematical physicist born in Warsaw and, from\n1921\n, working at the California Institute of Technology in the United States, who was interested in\nquantum theory\n. Epstein wrote to\nGeorge Pólya\nin\n1922\n(\nsee\n[\n6\n]\n)\n:-\nIt is strange that many persons want to have positions in America, but are reluctant to give me information which is needed to provide the positions. For instance, I don't know, whether Weinstein speaks English.\nWeinstein ended up working as an assistant of\nLeon Lichtenstein\nat the University of Leipzig in\n1922\n. He returned to Zurich and continued research in hydrodynamics publishing\nEin hydrodynamischer Unitätssatz\nⓉ\n(\nA hydrodynamic unity theorem\n)\n(1924)\n, and\nDer Kontinuitätsbeweis des Abbildungssatzes für Polygone\nⓉ\n(\nThe proof of continuity of the mapping theorem for polygons\n)\n(1924)\n, both in\nMathematische Zeitschrift\n. The introduction to the first of these shows where Weinstein was concentrating his research efforts in hydrodynamics:-\nSince the beginning of the fundamental work of\nLevi-Civita\n, numerous examples of two-dimensional, discontinuous, vortex-free currents have been discussed. However, up to now there is no general answer to a fundamentally important question, such as the existence or uniqueness of the solution under given conditions.\nThe introduction to the second of these papers shows the breadth of his research:-\nThe possibility of mapping any simply connected polygon on the unit circle by means of the\nSchwarz\n-\nChristoffel\nformulas has already been demonstrated by\nSchwarz\nhimself with reference to the general\nRiemann\nmapping theorem.\nSchläfli\n,\nPhragmén\n, and later\nBieberbach\ndealt with the same question about the continuity method. Their proofs, which avoid the detour via\nRiemann\n's theorem, do not have the character of being elementary and having the clarity that belongs to the\nSchwarz\n-\nChristoffel\nformulas. The\nSchläfli\n-\nPhragmén\nproof is computationally very extensive and unclear, moreover the conclusions of the last part added by\nPhragmén\ndo not seem to me to be compelling in all cases.\nBieberbach\n's proof is based on deep-seated theorems of Analysis situs and, moreover, uses functional-theoretical aids that can no longer be counted as elementary. In the following paper a thoroughly elementary proof of continuity of the proposition in question is developed for all simple polygons. The proof, which is also not computationally extensive, becomes particularly easy for the special case of convex polygons.\nWeyl\nwrote to the International Education Board supporting Weinstein in\n1925\nmaking clear there was xenophobia directed against foreigners and that Weinstein was suffering\n(\nsee\n[\n6\n]\n)\n:-\nThe difficulties which every foreigner has to face today in European countries prevented him - as a Russian - from finding a scientific position adequate to his abilities in Switzerland.\nThis was despite Weinstein becoming a Swiss citizen.\nWeyl\nrecommended Weinstein for a Rockefeller Fellowship and, after this was awarded, Weinstein spent\n1926\nand\n1927\nin Rome working with\nTulio Levi-Civita\n. That it was natural for him to want to work with\nLevi-Civita\ncan be seen from the introduction to\nEin hydrodynamischer Unitätssatz\nⓉ\n(\nA hydrodynamic unity theorem\n)\nand, as\nWeyl\nexpected, it was particularly important in Weinstein's development as a leading researcher in hydrodynamics. In\n1926\n, Weinstein published\nSur la vitesse de propagation de l'onde solitaire\nⓉ\n(\nOn the speed of propagation of the solitary wave\n)\n,\nSur les jets liquides à parois données\nⓉ\n(\nOn liquid jets with given walls\n)\n, and\nSur la représentation analytique de certains mouvements apériodiques\nⓉ\n(\nOn the analytical representation of certain aperiodic movements\n)\n, all in the\nRendiconti\nAccademia Nazionale dei Lincei\n.\nHe returned to Zürich as a\nprivatdocent\nin\nWeyl\n's chair\n(\nperhaps surprisingly he was the only privatdocent that\nWeyl\nhad in his career\n)\n, then in\n1928\nhe was appointed to the Hamburg Technical University. At this time he joined the\nGerman Mathematical Society\n. On\n13\nMarch\n1928\nhe married Marianne Olga Louise Ganz\n(1898\n-\n1985)\nin Hamburg. Marianne, the daughter of Albert Ganz\n(1864\n-\n1936)\nand Elsbeth Rosalie Klemperer\n(1874\n-?\n)\n, had been born in Hamburg on\n10\nJuly\n1898\ninto a Jewish family. Alexander and Marianne Weinstein did not have any children.\nLater in\n1928\nWeinstein moved from Hamburg to Breslau and, by\n1933\n, he was being sought by\nAlbert Einstein\nas a collaborator in Berlin with the two under active discussion. However\n1933\nwas the year that the Nazis came to power and Weinstein, being of Jewish background, could not remain in Germany. He therefore had to give up the chance of working with\nEinstein\nand instead he went to the Sorbonne and the Collège de France in Paris where he worked with\nJacques Hadamard\n. He was awarded the degree of Docteur ès Sciences Mathématiques by Paris in\n1937\n. One might wonder why when Weinstein already had a doctorate, he should choose to present himself for a second one. The answer, of course, is that at this time he was hoping to find a permanent position in France and realised that he would improve his chances if he had a Doctorate in Mathematical Sciences from the Sorbonne. He then spent a few semesters in England, some at the University of Cambridge and some at the University of London, before returning to Paris.\nIn May\n1940\n, World War II caught up with Weinstein, living in Paris, when Germany invaded France. He fully realised the danger he and his wife were in, particularly as Jews, so they escaped to Portugal hoping to be able to travel on to the United States\n[\n6\n]\n:-\nWhen\nWeyl\nhad proposed to Alexander Weinstein, his former student in Zurich, that he immigrated on the Russian quota since this was not fully used, Weinstein's sister-in-law commented on that in the following letter to\nWeyl\nin August\n1940\n: \"Among the American consuls the opinion seems to prevail that a human being born in Russia\n(\neven in the tsarist one\n)\nis inevitably a communist and that one has accordingly to put additional obstacles in his way.\"\nWeyl\nhastened to discard this idea, writing in September that same year to the American consul in Lisbon about Weinstein: \"I am sure that he has no Communist leanings at all. His father was a well-to-do doctor, and both his parents were killed or starved to death during the Bolshevik revolution. Dr Weinstein never considered going back to Russia, even though he went through some years of extreme hardship as an exile. ... In the years gone by he has done some remarkable and outstanding work in mathematics, especially in applied mathematics. I believe that there will be an increasing demand in this country for this type of mathematics, in which Europe has specialised, because the European nations have for a long time been forced to squeeze the last five per cent of efficiency from their natural resources.\nWeinstein and his wife sailed from Lisbon for the United States on the\nS S Exochorda\narriving in New York on\n26\nOctober\n1940\n. They lived at\n22\nWest\n75\nth Street, New York, New York. On\n9\nMay\n1941\n, still in New York, he made a Declaration of Intent for US citizenship giving the following details: Medium complexion, grey green eyes, light brown hair, height\n5\nft\n9\nin, weight\n175\nlbs, mole on right cheek, race Hebrew, present nationality Switzerland, born on\n10\nJuly\n1898\n. Married to Marianne in Hamburg, Germany on\n13\nMarch\n1928\n. She was born on\n10\nJuly\n1898\nin Hamburg, Germany. She entered the United States at New York on\n26\nOctober\n1940\n. Now resides at\n22\nWest\n75\nth Street, New York, New York. No children. Last place of residence Paris, emigrated from Lisbon on the\nS S Exochorda\n.\nFinding a permanent position in the United States was not easy since there was a large number of highly qualified mathematicians and scientists entering the United States after being forced to seek refuge from the Nazi racial laws. For nearly eight years he taught at a number of different places such as the Free French University in New York, did war work in the research group of Harvard University chaired by\nGarrett Birkhoff\n, worked at the Carnegie Institute of Technology of Pittsburgh and the Naval Ordnance Laboratory in Maryland. He also worked in Canada at the University of Toronto for a while. When he completed his WWII draft card in\n1942\nhe gave a University of Toronto address. Five years after his Declaration of Intent for US citizenship he was able to complete the process of Naturalisation which he did on\n18\nJuly\n1946\n. At this time his address was\n230\nW\n54\nth Street, New York, New York.\nFinally, in\n1948\n, he obtained a permanent position at the University of Maryland. There he joined Monroe H Martin\n(1907\n-\n2007)\nwho had received his PhD from Johns Hopkins University in\n1932\nhaving been advised by\nAurel Wintner\n. An expert on classical analysis and fluid dynamics, he had been appointed to the University of Maryland in\n1936\n, becoming a professor in\n1942\nand Head of Department in the following year. Weinstein and Martin founded the Institute of Fluid Dynamics and Applied Mathematics at Maryland in\n1949\n. We note that it has been renamed the Institute of Physical Science and Technology.\nWeinstein's research covered a wide range of topics. He is famed for solving a variety of boundary value problems. For example he solved\nHelmholtz\n's problem for jets, giving the first uniqueness and existence theorems for free jets in a series of papers from\n1923\nto\n1929\n. He examined boundary problems in an infinite strip, giving hydrodynamic and electromagnetic applications.\nWeinstein's method was developed to give accurate bounds for\neigenvalues\nof plates and membranes. In examining singular\npartial differential equations\nhe introduced a new branch of\npotential theory\nand applied the results to many different situations including flow about a wedge, flow around lenses and flow around spindles.\nMore information about his mathematical contributions is contained in\nGaetano Fichera\n's commemorative speech\n[\n3\n]\n; see out English translation at\nTHIS LINK\n.\nIn\n1972\nWeinstein, together with William Stenger, published the book\nMethods of intermediate problems for eigenvalues\n. Michael Eastman reviewed the book and wrote:-\nThe book gives a detailed account of the theory and application of methods for calculating upper and lower bounds for eigenvalues of a self-adjoint operator A in a\nHilbert\nspace. ... The standard of exposition is very high. The theory is presented clearly and concisely and the book reads well. A feature is the care with which the individual results, even the older ones, are discussed. Various misunderstandings about the theory have crept into the literature and the authors take pains to correct these. Many examples of practical importance, involving differential equations, are given throughout the text and in an appendix. The book is a valuable, comprehensive, and authoritative work.\nIn\n1978\nWeinstein was eighty years old and Joe D Diaz edited \"Selecta\", a volume of Weinstein's writings. Robert D Brown reviewed the volume and we give a shortened version of his review:-\nThis collection reproduces fifty-eight selected papers of Weinstein covering the period from\n1923\nto\n1978\n. Included are papers making fundamental contributions to several areas of mathematics: representations of linear groups of matrices,\nHelmholtz\n's problem for jets, boundary value problems in infinite strips, singular partial differential equations\n(\nincluding generalised axially symmetric potential theory and the\nEuler\n-\nPoisson\n-\nDarboux\nequations\n)\n, and, of course, eigenvalue approximations. Also included are joint papers with\nLeray\n, Aronszajn, Roch, Diaz, and Payne. The papers on eigenvalue problems cover the early development of the famous Weinstein method, the joint work with N Aronszajn developing the general theory of intermediate problems, and the Weinstein maximum-minimum theorem. The last paper in the collection\n(\nwritten for a jubilee volume for\nI N Vekua\n)\nis entitled \"On intermediate problems, maximum-minimum theory and\nKolmogorov\n-Karlovitz n-widths\". Besides the collection of papers, there are biographical notes on Weinstein by the editor, J B Diaz, including a brief discussion of Weinstein's major contributions, and there is a complete list of Weinstein's one hundred two published articles.\nAmong the honours given to Weinstein we note that, in addition to the\nSelecta\n, two other books were dedicated to him, namely\nProceeding of the Conference on Differential Equations\n(\nUniversity of Maryland,\n1965)\n, edited by J B Diaz and L E Payne, and the book by S Gould,\nVariational Methods for Eigenvalue Problems: An Introduction to the Weinstein Method of Intermediate Problems\n(1957)\n. Let us quote from the Preface of Gould's book:-\nThe book was begun in collaboration with Professor Weinstein, who was soon compelled by the pressure of other duties to relinquish his share of the work. I wish to express my profound gratitude to him, not only for his actual help with parts of the first three chapters, but even more for having introduced me originally to an important and interesting subject which his own active and illuminating researches have done so much to advance.\nHere is the beginning of the Introduction to Gould's book:-\nWe shall be concerned chiefly with the method of Weinstein for the approximate calculation of eigenvalues. The concept of an eigenvalue is of great importance in both pure and applied mathematics. A physical system, such as a pendulum, a vibrating string, or a rotating shaft, has connected with it certain numbers characteristic of the system, namely the period of the pendulum, the frequencies of the various overtones of the string, the critical angular velocities at which the shaft will buckle, and so forth. The German word 'eigen' means \"characteristic\" and the hybrid word eigenvalue is used for characteristic numbers in order to avoid confusion with the many other uses in English of the word characteristic.\nHe was elected to the National Academy of Sciences of Peru and the\nAccademia dei Lincei\n. The obituary\n[\n3\n]\nappears in the\nRendiconti\nof the\nAccademia dei Lincei\nand we give an English version of it at\nTHIS LINK\n.\nAfter retiring in\n1967\n, Weinstein continued research at the American University in Washington D.C., then, from\n1968\nto\n1972\nhe worked at Georgetown University, also in Washington D.C. Weinstein died on\n6\nNovember\n1979\n, following a surgical operation a few days earlier in a Washington D.C. hospital. His wife Marianne died on\n11\nMarch\n1985\nat Henderson, North Carolina and was buried in Green Hills Cemetery, Asheville, Buncombe County, North Carolina.\nLet us end this biography by quoting from\nGaetano Fichera\n's commemorative speech\n[\n3\n]\n:-\nWeinstein ... travelled extensively during his life, residing, even for long periods, in different countries and coming into contact and working with many of the greatest mathematicians of his time. This helped to make the field of his scientific interests and his mathematical culture particularly broad. Weinstein, as a mathematician, was certainly \"a citizen of the world.\" But even outside of mathematics his knowledge, especially artistic and literary, was very extensive. He was fluent in five languages: Russian, English, German, French, and Italian, and was, when in a good mood, a brilliant conversationalist with a remarkable sense of humour.\nHe loved Italy very much, where, as long as he could travel, he spent the summer holidays with his wife. As a true connoisseur, he greatly appreciated the artistic beauties of our country, often unknown to ordinary tourists and to many of the Italians themselves. Rome, a city he knew very well, always remained one of his favourite destinations.\nBut his traveling a lot, learning to speak many languages, approaching mathematicians from all over the world were not always due to his free choices. From the events of his life it emerges, in a dramatic way, that several times, since his adolescence, he had to earn the right to freedom and to survival itself, with escape and exile. And it is for this reason that, in evaluating, in addition to the scientific work, the human figure, one must have a particular sense of understanding. In fact, the very difficult conditions in which his youth and the first years of his maturity took place, had engraved indelible marks on his personality. He had been constantly forced to move from one country to another, always looking for a position that corresponded to his undoubted merits as a scientist; he had been obliged, countless times, to start all over again, in ever new and very different environments, striving to regain credibility and success; he had had to submit to the judgment of others at an age when a scientist of his calibre had the full right to independence and economic security. All this had ended up disposing his soul to a profound pessimism and creating a complex of insecurity from which he was no longer able to free himself, even when, by now internationally affirmed, he had reached, at the University of Maryland, a safe and considerable prestige. It is only by thinking of all this that one can understand the intimate human nature of this man, tormented and complex, and explain the difficulty that he generally had in human relationships and that made him end his life in almost complete isolation, only with his seriously ill wife, whom he, already advanced in years and of no longer healthy health, lovingly assisted. But the human qualities of a scholar, the sad or happy events of his life, his strengths and limitations as a living creature, are all aspects destined to fade and be forgotten over the years. What really matters and remains is the contribution made to science: and I have no doubts in affirming that the scientific work of Alexander Weinstein has all the characteristics of those destined to last over time.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Topology"
  ]
}