{
  "nome_completo": "Alice Turner Schafer",
  "nome_curto": "Alice T Schafer",
  "ano_nascimento": "1915",
  "ano_morte": "2009",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Schafer/",
  "lugar_nascimento": "Richmond, Virginia, USA",
  "lugar_morte": "Lexington, Massachusetts, USA",
  "biografia": "Alice T Schafer\n's name before she married was Alice Turner. Alice's mother died in childbirth and Alice was brought up by in Scottsburg, Virginia by an aunt, Pearl Dickerson. Her father too died when Alice was young and Pearl Dickerson acted as a mother in every way; in particular supporting her educational aims as she grew up. A second aunt helped to support Alice financially.\nAlice attended primary school in Scottsburg, Virginia and her first interest was in writing rather than in mathematics. Long division seems to have provided the first mathematical topic to interest Alice. Well, it is hard to believe that anyone could find long division inspiring, but it really was not the long division itself that intrigued her, as much as the fact that her teacher said she would never master such a difficult concept. Even as a primary school pupil Alice showed the determination that would characterise her life. She always rose to a challenge.\nAt High School Alice continued to develop an interest in mathematics and her two aunts supported her desire to carry on to university to study that topic. However, the headmaster of the High School that Alice attended was much less supportive. When Alice asked him to write a letter to support her application for a place at the University of Richmond to study mathematics, he replied that mathematics was not a subject for girls and that he would only support her application to university if she applied to study history.\nOn the one hand, the University of Richmond was better disposed towards women than Alice's High School headmaster had been, for they accepted her to study mathematics and gave her a scholarship, but on the other hand there was severe discrimination against the women who were studying there. For example, women were not allowed in the library and they had to make a request for a book which they then had to study in the \"women's reading room\". Although there were some women mathematicians on the staff, they were only allowed to teach the more elementary material. One of the men who taught the more advanced material, like analysis, openly declared that he would like to fail all women who took his course.\nIt is hard today to believe that universities were like this but I\n[\nEFR\n]\nknow when I was an undergraduate in the\n1960\ns the professor of English would grade the students essays and hand back each man's essay to him individually, dumping all the women's essays on the bench at the front. Most students of English were women and one day he came into the class, saw that there were only women students there, and said \"I see nobody has turned up today\" and left! Let us return to Alice and her undergraduate years.\nShe received her B.A. degree from the University of Richmond in\n1936\n. She had performed exceptionally well and in her third year had won the Crump prize for real analysis. However, although she would have liked to continue to graduate study, it was difficult for her family to provide the necessary financial support and Alice decided to teach to earn money. She taught at a high school in Glenn Allen, Virginia for three years.\nIn\n1939\nAlice Turner was awarded a fellowship to enable her to undertake postgraduate study at the University of Chicago. Another postgraduate student at the University of Chicago whom she met there was Richard Schafer. The two were married in\n1942\nafter both had completed their doctorates. Alice Schafer, as she was to become, had been awarded an M.S. by Chicago and continued to study there for her doctorate under E P Lane. Under Lane she studied projective differential geometry and submitted her dissertation on\nSingularities of Space Curves\n. In fact she later published two papers based on the work of her dissertation:\nTwo singularities of space curves\nappeared in the\nDuke Mathematical Journal\nin\n1944\n, and\nThe neighborhood of an undulation point on a space curve\nappeared in the\nAmerican Journal of Mathematics\nin\n1948\n. The first of these studies singular points which:-\n... are inflection points and planar points. The curve is assumed to be analytic and thus can be represented in the neighbourhood of the point in question by power series. Choice of the proper projective coordinate system permits the reduction of these power series to simple canonical forms. With the aid of these canonical power series,\n[\nSchafer\n]\nderives numerous theorems concerning surfaces which osculate the given curve at the singular point, concerning the sections of the tangent developable in the neighbourhood of the singular point and concerning the projections of the given curve.\nAfter her marriage and the award of her doctorate Schafer taught at a large number of Colleges and Universities. Her first appointment was at Connecticut College, following which she spent a year at The Johns Hopkins Applied Physics Laboratory undertaking work to contribute towards the war effort. After this she held appointments at: the University of Michigan; Douglass College; Swarthmore College in Swarthmore, Pennsylvania; Drexel Institute of Technology in Philadelphia, Pennsylvania\n(\ncalled Drexel University after\n1969)\n; and the University of Connecticut. After this she returned to Connecticut College, where she became a full professor.\nBy\n1962\nher husband Richard was working at the Massachusetts Institute of Technology and Schafer was appointed to Wellesley College, a private women's college in Wellesley, Massachusetts. Not long after being appointed there she became Head of Mathematics. In\n1980\nshe was honoured by being named Helen Day Gould Professor of Mathematics at Wellesley College. One of Schafer's many educational innovations at Wellesley was an educational experiment in\n1976\naimed at preventing students becoming frightened of mathematics. She retired in\n1980\nbut remained at Wellesley for two further years during which she was chairman of Wellesley's Affirmative Action Program.\nBy this time Schafer was\n67\nyears old, but she missed teaching, so after this she taught at Simmons College and was involved in the management program in the Radcliffe College Seminars. Richard Schafer, Alice's husband, retired from the Massachusetts Institute of Technology in\n1988\nand they moved to Arlington in Virginia. Schafer, now\n73\nyears old, still wanted to teach and she became professor of mathematics at Marymount University. She retired, probably for the last time, in\n1996\nat the age of\n81\n.\nSchafer was one of the founding members of the\nAssociation for Women in Mathematics\nin\n1971\nand she was elected as the second President serving from\n1973\n-\n75\n. In\n1990\nthe\nAssociation for Women in Mathematics\nestablished the Alice T Schafer Mathematics Prize in her honour.\nIn\n1964\nSchafer received an honorary degree from the University of Richmond. Then Westhampton College at that university awarded her their Distinguished Alumna Award in\n1977\n. In\n1985\nAlice Schafer was elected a fellow of the American Association for the Advancement of Science.\nIn January\n1998\n, the\nMathematical Association of America\nawarded the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service to Mathematics to Alice Schafer. First presented in\n1990\n, this is the\nMathematical Association of America\n's most prestigious award, given in recognition of distinguished service to the mathematical community.\nThe citation reads in part:-\nThe curriculum vitae of Alice T Schafer lists two specialisations: abstract algebra\n(\ngroup theory\n)\nand women in mathematics. Her career as a mathematics educator evolved into her becoming champion for the cause of full participation of women in mathematics. ...\nAs a mathematics educator, she championed the full participation of women in mathematics. She has been a strong role model for many women and has worked to establish support groups for women in mathematics, to eliminate barriers women face in their study of mathematics and participation in the mathematics community, and to provide opportunity and encouragement for women in mathematics. ...\nProfessor Schafer is known for her love of people, her boundless energy, and her fierce determination for a just cause. Her lifetime achievements and her pioneering efforts to secure opportunities for all mathematicians make her a most worthy recipient of the Yueh-Gin Gung and Dr Charles Y Hu Award for Distinguished Service to Mathematics.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Logic"
  ]
}