{
  "nome_completo": "Alice Bache Gould",
  "nome_curto": "Alice Bache Gould",
  "ano_nascimento": "1868",
  "ano_morte": "1953",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Gould/",
  "lugar_nascimento": "Cambridge, Massachusetts, USA",
  "lugar_morte": "Simancas, Spain",
  "biografia": "Alice Bache Gould\n's parents were Benjamin Apthorp Gould\n(1824\n-\n1896)\nand Mary Apthorp Quincy\n(1834\n-\n1883)\n. Benjamin Gould had been born in Boston and had studied mathematics and astronomy at Harvard, taught by\nBenjamin Peirce\n. After graduating Benjamin Gould had studied in Germany with\nGauss\n,\nBessel\n,\nEncke\nand others. John Hodge writes\n[\n4\n]\n:-\nIn\n1861\nGould had married Mary Apthorp Quincy, the daughter of Josiah Quincy\n(1802\n-\n1882)\n. Her high intelligence, sympathy, cooperation and courage transformed Gould's life and steeled him for every endeavour. Her private fortune provided him financial assistance which enabled him to continue his astronomical work at times when he would otherwise have had to forego them. She bore him five children and shared every privation and sacrifice which his long exile entailed.\nBenjamin Gould was keen to observe the southern sky and approached the government of Argentina in\n1865\nwith his plan to set up an observatory in Córdoba. A site was found for the observatory but in\n1866\nGould was unable to raise sufficient funding. However, in\n1869\nhe was invited by President Sarmiento of Argentina to set up a national observatory of Argentina in Córdoba. In May\n1870\n, together with his wife and children, Gould sailed to England and then from there they sailed to Argentina. Alice, who was only two years old when she arrived in Córdoba, lived for a while with her family there and learnt to speak both English and Spanish. She was sent back to Quincy, Massachusetts in late\n1871\n, after the observatory in Córdoba had been officially opened, and she lived in the home of her mother's family. Her childhood was spent partly in Massachusetts. partly in Córdoba, since she made many visits to Argentina as she grew up.\nThe family suffered tragedy when Alice's two elder sisters, Susan Morton Quincy Gould and Lucretia Goddard Gould, drowned in a swimming accident in Argentina. Alice was now the eldest remaining child with two younger siblings Benjamin Apthorp Gould Jr and Mary Quincy Gould. Alice's elementary schooling was partly in Córdoba where she was taught Hispanic history, culture and the Spanish language, and partly in the United States. However, her secondary schooling was partly in the United States and partly in England. Her mother Mary died in\n1883\nwhile the family were on a visit to Boston where Benjamin Gould was arranging to have measurements made of the photographic plates he had taken in Córdoba. Benjamin returned to Córdoba leaving Alice and the other two children at a boarding school in Boston. In the school holidays they lived with relatives. In\n1885\nBenjamin Gould returned to Boston and, shortly after this Alice entered the Society for the Collegiate Instruction of Women\n(\nwhich later was named Radcliffe College\n)\nset up to provide education for women who were not allowed to study at Harvard University. She spent one year studying mathematics there before moving to Bryn Mawr College. This College, founded by the Quaker Joseph Taylor in\n1885\n, was the first higher education establishment in the United States to offer graduate instruction to women. Gould graduated with a B.A. in mathematics and physics in\n1889\n.\nDuring the years\n1890\n-\n93\n, Gould studied mathematics in England at Newnham College, Cambridge and at the Massachusetts Institute of Technology. Her activities, and those of her family, were noted in the Cambridge Tribune\n(\nMassachusetts\n)\nin September\n1892\n[\n9\n]\n:-\nDr Benjamin S Gould, with his daughter Miss Mary Gould, of Kirkland street, are spending all of the summer months in foreign travel. Miss Alice Gould, Dr Gould's eldest daughter, has finished her second year at Newnham College, England.\nNewnham College was the second Cambridge college to admit women. They could attend lectures but, although there were moves to have women take degrees while Gould was studying there, it was not possible for women to graduate. Gould taught mathematics at Carleton College in Northfield, Minnesota in the academic year\n1893\n-\n94\nbut, being awarded a fellowship to undertake graduate work in mathematics at the University of Chicago, she began her studies there in\n1894\n, advised by\nEliakim Moore\n. In\n1881\nHenri Brocard\nhad published\nÉtudes d'un nouveau cercle du plan du triangle\nin which he introduced Brocardian geometry. This was the topic that Gould worked on for her Ph.D. but her progress was hampered by ill health. In\n1896\nher father died and Gould began to put a considerable effort into establishing the Benjamin Apthorp Gould fellowship at the\nNational Academy of Sciences\n.\nGoluld's fellowship at Chicago ended in\n1897\nbut she continued working on her thesis at Chicago, still suffering from spells of poor health. After a while she returned to Cambridge, Massachusetts, with her thesis not yet completed but she did succeed in setting up the Benjamin Apthorp Gould Fund in\n1897\n. She donated $\n20\n,\n000\nto establish this Fund and\n[\n4\n]\n:-\n... stipulated among the six major requirements for recipients of awards that preference be given to \"the astronomy of precision\" rather than astrophysics because of her father's \"strong feelings on the subject.\"\nShe, like her father, was a friend of\nSimon Newcomb\nand she corresponded with him during her efforts to set up the fund to honour her father. Gould lectured on mathematics at times over the following few years, and worked on completing her thesis. However, she also undertook a new project in\n1900\n, writing a biography of the American naturalist Louis Agassiz. The\n150\n-page book was published in Boston in The Beacon Biographies of Eminent Americans series in\n1901\n. William Hall writes in a review\n[\n2\n]\n:-\n... the author of this little volume has given a charming account of his life, his personality, and just enough of his work and teaching to inspire the student of nature with the desire to know more of him. In this the 'bien être' of the biography has been achieved. ... The author is to be congratulated in presenting such a stimulating, pleasant, and acceptable essay to the public.\nThe reviewer J.A.A. expresses similar sentiments\n[\n3\n]\n:-\nIn this little volume of\n150\nsmall pages we have an admirably condensed account of his life, - brief, authentic and fascinating. ... The general public, and especially all lovers of nature, should feel indebted to Miss Gould for her excellent epitome of the life of the great teacher.\nIn\n1903\n, after a severe bout of flu, Gould decided to travel to Puerto Rico and spend time there recuperating. In fact she spent seven years in Puerto Rico where she became fascinated by the history of colonisation of the island. Undertaking scholarly research for an article on the history of colonisation was not the only task she undertook during these years but she also worked hard to improve the educational system and she set up \"Porto Rico Teachers' Fund\" that raised money for a nursing school. Returning to the Boston area, she set off on another trip abroad in\n1911\nwhen she set off with a friend on a trip to Rome. However, her friend took ill so when the ship docked in Gibraltar on its way to Rome, they remained there. Gould saw the chance to continue her research into the colonisation of the West Indies and visited the Archive of the Indies in Seville. She began to undertake research into the route taken by Christopher Columbus on his journeys and also on the men who accompanied him. Gould's friend, after recovering, decided not to continue to Rome and returned to Boston. Gould remained in Spain undertaking the research which now fascinated her.\nWhen World War I broke out in August\n1914\n, Gould was still in Spain studying at the Archivo de Simancas. She continued to study there until the United States entered the war in April\n1917\n, when she went to United States Embassy in Madrid and offered her help with the war effort\n[\n6\n]\n:-\nHer excellent language skills, brimming patriotism, and conscientious work habits made her especially valuable there.\nHowever, her family were very concerned for her safety so in March\n1918\nshe returned to Boston. Immediately she joined the campaign to persuade Americans to donate binoculars and other optical instruments for the use by the navy. In June\n1918\nshe contacted Columbia University offering her mathematical expertise to support the war effort. However, as Deborah Kent writes\n[\n6\n]\n:-\nAlliances between American mathematics and the military were not well defined when the United States entered World War I in April of\n1917\n. Although academic mathematicians - like other American faculty members and students - were among the strongest supporters of the cause, it took time to identify how and where to utilize their technical training in the war effort.\nShe received a reply from Columbia University giving her little encouragement that she could use her skills there for the war effort. She then wrote to her former Ph.D. advisor\nEliakim Moore\nat Chicago. Two possibilities were eventually offered to her. She could be a computer working on range tables at the Army Ordnance office, or she could take a position at the University of Chicago teaching mathematics as part of a navigation course for navy personnel.\nMoore\nexplained that working on range tables was probably more important work, but it was very monotonous. Teaching appealed more to Gould than being a computer, so she worked at Chicago teaching the summer courses. After these were finished, she was employed by the University of Chicago teaching the mathematics of navigation until January\n1919\n. She found this work highly rewarding and began writing a text on navigation which she never completed.\nShe prepared to return to Spain but delayed in the United States for longer than she had intended. Although she had decided to undertake mathematics research, she soon returned to the topic of Columbus's voyages and began writing articles in Spanish which were published in the\nBulletin of the Real Academia de la Historia\n. The first article appeared in\n1924\n. She returned to Spain in\n1925\nand there continued her researches into the travels of Columbus. However, in\n1936\nGeneral Franco initiated a right-wing revolt against the left-wing Peoples' Front government beginning a three-year civil war. Gould returned to Boston for the duration of the civil war but returned to Spain to live in Simancas. She did much in the way of good works in that city, including the founding of the first pre-school in Simancas.\nGould intended to write a book on Columbus but when she died of a cerebral haemorrhage in\n1953\nthe work was unpublished. However,\nNueva lista documenta da de los tripulantes de Colon en\n1492\nwas published in Madrid in Spanish in\n1984\n. Kathleen LeMieux writes\n(\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nAs Gould studied in minute detail the long neglected Spanish records, she made notes on Columbus's crew and on whatever other information that the files revealed. In her Nueva lista, for example, Gould confirms the Jewish presence on the voyages of discovery. She devotes twelve pages to Luis de Torres, Columbus's converso interpreter. Not only does Gould tell what she has found about de Torres in archives across Spain, but she also summarizes what has been written previously by historians. She sorts out much of the confusion on who sailed with Columbus and when. Those of Jewish blood whom Gould assigns to the first voyage are de Torres and Rodrigo Sánchez de Segovia, while she notes that Maese Bernal\n(\na doctor\n)\n, Marco\n(\na surgeon\n)\nand Alfonso de la Calle were on board during the fourth voyage. Gould advises that, although direct evidence may be scarce, there must have been other Jewish and converso\n[\nJews who had converted to Christianity\n]\ncrew members. She challenges her readers to continue the search.\nGould was honoured with the Cross of Alfonso the Wise\n(1924)\n, election to the Spanish Royal Academy of History\n(1942)\n, and the Order of Isabella the Catholic\n(1952)\n. She died of a cerebral haemorrhage on the bridge to the Simancas castle. A commemorative plaque marks the site of her death\n(\n[\n7\n]\nor\n[\n8\n]\n)\n:-\nAccording to numerous newspaper accounts at the time, Gould's funeral in Madrid was attended with ceremony and tributes by Spain's historians, intellectuals and dignitaries.\nAlso in Simancas, a square has been named after her.",
  "math_areas": [
    "Analysis"
  ]
}