{
  "nome_completo": "Alonzo Church",
  "nome_curto": "Alonzo Church",
  "ano_nascimento": "1903",
  "ano_morte": "1995",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Church/",
  "lugar_nascimento": "Washington, D.C., USA",
  "lugar_morte": "Hudson, Ohio, USA",
  "biografia": "Alonzo Church\n's parents were Mildred Hannah Letterman Parker and Samuel Robbins Church. His father was a judge. He was a student at Princeton receiving his first degree, an A.B., in\n1924\n, then his doctorate three years later. His doctoral work was supervised by\nVeblen\n, and he was awarded his doctorate in\n1927\nfor his dissertation entitled\nAlternatives to Zermelo's Assumption\n. While he was still working for his doctorate he married Mary Julia Kuczinski at Princeton in\n1926\n. They had three children, Alonzo Jr, Mary Ann and Mildred.\nChurch spent two years as a National Research Fellow, one year at Harvard University then a year at Göttingen and Amsterdam. He returned to the United States becoming Assistant Professor of Mathematics at Princeton in\n1929\n. Enderton writes in\n[\n4\n]\n:-\nPrinceton in the\n1930\n's was an exciting place for logic. There was Church together with his students Rosser and\nKleene\n. There was\nJohn von Neumann\n.\nAlan Turing\n, who had been thinking about the notion of effective calculability, came as a visiting graduate student in\n1936\nand stayed to complete his Ph.D. under Church. And\nKurt Gödel\nvisited the Institute for Advanced Study in\n1933\nand\n1935\n, before moving there permanently.\nHe was promoted to Associate Professor in\n1939\nand to Professor in\n1947\n, a post he held until\n1961\nwhen he became Professor of Mathematics and Philosophy. In\n1967\nhe retired from Princeton and went to the University of California at Los Angeles as Kent Professor of Philosophy and Professor of Mathematics. He continued teaching and undertaking research at Los Angeles until\n1990\nwhen he retired again, twenty-three years after he first retired! In\n1992\nhe moved from Los Angeles to Hudson, Ohio, where he lived out his final three years.\nHis work is of major importance in mathematical logic, recursion theory, and in theoretical computer science. Early contributions included the papers\nOn irredundant sets of postulates\n(1925)\n,\nOn the form of differential equations of a system of paths\n(1926)\n, and\nAlternatives to Zermelo's assumption\n(1927)\n. He created the λ-calculus in the\n1930\n's which today is an invaluable tool for computer scientists. The article\n[\n10\n]\nis in three parts and in the last of these Manzano:-\n... attempt\n[\ns\n]\nto show that Church's great discovery was lambda calculus and that his remaining contributions were mainly inspired afterthoughts in the sense that most of his contributions, as well as some of his pupils', derive from that initial achievement.\nIn\n1941\nhe published the\n77\npage book\nThe Calculi of Lambda-Conversion\nas a volume of the Princeton University Press Annals of Mathematics Studies. It is effectively a rewritten and polished version of lectures Church gave in Princeton in\n1936\non the λ-calculus.\nChurch is probably best remembered for 'Church's Theorem' and 'Church's Thesis' both of which first appeared in print in\n1936\n. Church's Theorem, showing the undecidability of first order logic, appeared in\nA note on the Entscheidungsproblem\npublished in the first issue of the\nJournal of Symbolic Logic\n. This, of course, is in contrast with the propositional calculus which has a decision procedure based on truth tables. Church's Theorem extends the incompleteness proof given of\nGödel\nin\n1931\n.\nChurch's Thesis appears in\nAn unsolvable problem in elementary\nnumber theory\npublished in the\nAmerican Journal of Mathematics\n58\n(1936)\n,\n345\n-\n363\n. In the paper he defines the notion of effective calculability and identifies it with the notion of a recursive function. He used these notions in\nOn the concept of a random sequence\n(1940)\nwhere he attempted to give a logically satisfactory definition of \"random sequence\". Folina\n[\n6\n]\nargues for the usually accepted view that Church's Thesis is probably true but not capable of rigorous proof. The background to Church's work on computability and undecidability, based on his correspondence with\nBernays\nduring the years\n1934\n-\n1937\n, is examined by Sieg in\n[\n11\n]\n.\nChurch was a founder of the\nJournal of Symbolic Logic\nin\n1936\nand was an editor of the reviews section from its beginning until\n1979\n. In fact he published a paper\nA bibliography of symbolic logic\nin volume\n4\nof the Journal and he saw the reviews section as a continuation and expansion of this work. Its aim, he wrote, was to provide:-\n...to provide a complete, suitably indexed, listing of all publications ... in symbolic logic, wherever and in whatever language published ...\n[\ngiving\n]\ncritical, analytical commentary.\nThe article\n[\n5\n]\nhighlights Church's guiding role in defining the boundaries of the discipline of symbolic logic through this editorial work and testifies to his unflagging industry and conscientiousness and his high editorial standards. The aim of comprehensive coverage, which in\n1936\nhad seemed quite practical, became less so as the years went by and by\n1975\nthe rapid expansion in symbolic logic publications forced Church to give up this aspect and begin to provide only selective coverage. We mentioned above that Church retired from Princeton in\n1967\nand went to the University of California at Los Angeles. Perhaps this is the place where we should mention why he left Princeton after\n38\nyears of service there. Enderton writes:-\nUpon his retirement, Princeton was unwilling to continue accommodating the small staff working on the reviews for the Journal of Symbolic Logic.\nChurch wrote the classic book\nIntroduction to Mathematical Logic\nin\n1956\n. This was a revised and very much enlarged edition of\nIntroduction to mathematical logic\nwhich Church published twelve years earlier in\n1944\n. This first edition was, as he states in the Introduction:-\n... the first half of an introductory course in mathematical logic given to graduate students in mathematics\n[\nat Princeton in\n1943]\n.\nHaskell Curry\nin a review of the\n1944\nwork writes:-\nIt is written with the meticulous precision which characterizes the author's work generally. ... The subject matter is more or less classical, namely, the propositional algebra and the functional calculus of first order, to which is added a chapter summarizing without proofs certain features of functional calculi of higher order. For the expert the chief interest in the tract is that it makes readily accessible careful detailed formulation and proofs of certain standard theorems, for example, the deduction theorem, the reduction to truth tables, the substitution rule for the functional calculus,\nGödel\n's completeness theorem, etc.\nManzano writes in\n[\n10\n]\nthat the\n1956\nedition of the book:-\n... defined the subject matter of mathematical logic, the approach to be taken and the basic topics addressed.\nThe book begins with an Introduction which discusses names, variables, constants and functions, and leads on to the logistic method, syntax and semantics. Chapters I and II are concerned with the propositional calculus, discussing tautologies and the decision problem, duality, consistency and completeness, and independence of the axioms and rules of inference. The first order functional calculus is studied in Chapters III and IV, while Chapter V deals mainly with second order functional calculi.\nAnother area of interest to Church was axiomatic set theory. He published\nA formulation of the simple theory of types\nin\n1940\nin which he attempted to give a system related to that of\nWhitehead\nand\nRussell\n's\nPrincipia Mathematica\nwhich was designed to avoid the paradoxes of naive set theory. Church bases his form of the theory of types on his λ-calculus. Other work by Church in this area includes\nSet theory with a universal set\npublished in\n1971\nwhich examines a variant of ZF-type axiomatic set theory and\nComparison of Russell's resolution of the semantical antinomies with that of Tarski\npublished in\n1976\n. Another of Church's research interests was intensional semantics which is considered in detail in\n[\n3\n]\n. The idea developed here was similar to that of\nFrege\n, distinguishing between the extension of a term and the intension, or sense, of a term. Church considered this topic for about\n40\nyears during the latter part of his career, beginning with his paper\nA formulation of the logic of sense and denotation\nin\n1951\n.\nAlthough most of Church's contributions are directed towards mathematical logic, he did write a few mathematical papers of other topics. For example he published\nRemarks on the elementary theory of differential equations as area of research\nin\n1965\nand\nA generalization of Laplace's transformation\nin\n1966\n. The first examines ideas and results in the elementary theory of ordinary and partial differential equations which Church feels may encourage further investigation of the topic. The paper includes a discussion of a generalization the\nLaplace transform\nwhich he extends to non-linear partial differential equations. This generalization of the\nLaplace\ntransform is the topic of study of the second paper, again using the method to obtain solutions of second-order partial differential equations.\nChurch had\n31\ndoctoral students including\nFoster\n,\nTuring\n,\nKleene\n,\nKemeny\n,\nBoone\n, and\nSmullyan\n. He received many honours for his contributions including election to the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1978\n. He was also elected to the British Academy, and the\nAmerican Academy of Arts and Sciences\n. Case Western Reserve\n(1969)\n, Princeton\n(1985)\nand the State University of New York at Buffalo\n(1990)\nawarded him honorary degrees.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}