{
  "nome_completo": "Marie-Jeanne Amélie Harlay",
  "nome_curto": "Amélie Harlay",
  "ano_nascimento": "1768",
  "ano_morte": "1832",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Harlay/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "It has been \"known\" since the\n1860\ns that\nAmélie Harlay\nwas the illegitimate daughter of the astronomer\nJoseph-Jérôme Lefrançais de Lalande\n. This must have arisen from the fact that on certain occasions, Lalande affectionately called her \"my daughter.\" Recent research\n(\nsee, for example,\n[\n10\n]\n)\n, however, has shown that this is not true. She was the daughter of Jean François Harlay\n(\nborn\n1730)\nand Anne Elisabeth Cany\n(\nborn\n1744)\nwho were both teachers in Paris. We know nothing of her childhood and education, and this lack of information may have contributed to the belief that she was\nLalande\n's illegitimate daughter. On\n27\nSeptember\n1788\nshe married Michel Jean Jérôme Lefrançais de Lalande\n(1766\n-\n1839)\n, the son of the Jean Lefrançois, who was the younger cousin of\nJérôme Lalande\n, and his wife Jeanne Jourdan.\nJérôme Lalande\nreferred to Michel and Amélie as his nephew and niece.\nJérôme Lalande\nbrought Michel to Paris after the summer vacation of\n1780\nand taught him astronomy, particularly the techniques of telescopic observation. In\n1782\nMichel had his first astronomy paper published, describing his observation of a total lunar eclipse. Before she married Michel, Amélie Harlay was also being taught astronomy techniques by\nLalande\n, who quickly realised that Amélie was talented in learning mathematical techniques. Amélie and Michel were collaborating before their marriage; Michel was an expert observer and Amélie undertook large amounts of computational work which she was able to do with great accuracy and speed.\nLalande\nwrote the following description of Amélie in his work\nBibliographie Astronomique\nⓉ\n(\nAstronomical Bibliography\n)\n(\nParis,\n1803)\n:-\nMy niece aids her husband in his observations and draws conclusions from them by calculation. She has reduced the observations of ten thousand stars, and prepared a work of three hundred pages of horary tables - an immense work for her age and sex. They are incorporated in my 'Abrégé de Navigation.' She is one of the rare women who have written scientific books. She has published tables for finding the time at sea by altitude of the sun and stars. These tables were printed in\n1791\nby the order of the National Assembly. ... In\n1799\nshe published a catalogue of ten thousand stars, reduced and calculated.\nIn\n1789\n, the year after Amélie married Michel Lefrançois, he became the director of the observatory of the École Militaire, succeeding\nJérôme Lalande\nin that role. He began a long series of observations. In his first three months he observed\n2\n,\n500\nstars and the following year more than\n8\n,\n000\n. Amélie reduced the observations that her husband was making and the work she put into that task was quite outstanding, for example in one year she reduced\n12000\nobservations, each single reduction requiring around\n36\ncomputations.\nDespite the remarkable amount of work contributed by Amélie, she was not listed as an author on any of the publications to which she contributed, even those which consisted mostly of tables she had calculated.\nLalande\n, however, was a great supporter of women astronomers so we know quite a lot about her contributions through Prefaces which he wrote. It also meant that she was well-known as an astronomer in her own day. Many women astronomers were not so lucky, and only in recent times have their contributions become known. For example, in\n1806\nGauss\ndeclared \"I only know one French woman who works in the scientific field, Madame Le François de Lalande.\" In fact he did know another for he had corresponded with\nSophie Germain\nfor several years without knowing she was a woman, but only shortly after he made this statement about Amélie did he learn that\nGermain\nwas a woman.\nAmélie and Michel Lefrançais de Lalande had four children. On\n1\nJanuary\n1789\n, she gave birth to their first child which they named Isaac Lefrançais de Lalande in honour of\nIsaac Newton\n. On\n20\nJanuary\n1790\n, their first daughter was born. On the same day, the comet discovered by\nCaroline Herschel\nbecame visible for the first time in Paris, so they called their daughter Carolina Lefrançais de Lalande.\nLalande\nwrote\n[\n4\n]\n:-\nThis daughter of astronomy was born on January\n20\n,\n1790\n, a day where we saw in Paris for the first time the comet discovered by Miss\nCaroline Herschel\n; the child was then given the name of Carolina; her godfather was\nDelambre\n.\nSadly she died while still an infant. Their second daughter was born on\n27\nJuly\n1793\nand was named Charlotte Uranie Lefrançais de Lalande, having as godfather the astronomer\nJean-Baptiste Delambre\n, and as godmother Charlotte of Saxe-Meiningen, Duchess of Gotha. Their fourth and last child was born on\n26\nMarch\n1802\nand was named Charles Auguste Frédéric Jérôme Lefrançais de Lalande.\nIn\n1791\nFrance was in the midst of the Revolution.\nDominique Cassini\nwas strongly opposed to the revolution and was in difficulties as Director of the Paris Observatory. He had fallen out with his assistants, who had very different political views, and his wife had died leaving him to bring up their five children. Amélie helped by teaching astronomical techniques to\nDominique Cassini\n's son and helped him to make his first observations at the Collège de France.\nWe should note that on\n8\nMay\n1795\n, while working at the observatory of the École Militaire, Michel Lefrançais observed what he thought to be a star and, noted its position; this was his standard practice. On the following night he observed again and measured the position of the \"star\" again to confirm his record; again his standard practice. He saw that his two readings did not agree, and thought he must have been careless and measured it incorrectly on the previous night. Since his two recorded positions did not agree he should have made a third observation, but he did not. If he had made the third observation he would have discovered the planet Neptune fifty years before the mathematical calculations of\nAdams\nand\nLe Verrier\nled to its discovery.\nAs\nLalande\nexplains in the above quote, Amélie Lefrançais de Lalande's tables were appended to his famous work\nAbrégé de navigation historique, théorétique, et practique, avec des tables horaires\nⓉ\n(\nAbstract of historical, theoretical, and practical navigation with timetables\n)\nwhich was published in\n1793\n[\n7\n]\n:-\nFour fifths of this book is comprised of horary tables, which sailors could use to calculate the time of day while at sea. Significantly, the tables are the work of Marie Jeanne Amélie Harlay Lefrançois de Lalande ... The tables were originally meant to be completed by a male colleague, Nicolas Maurice Chompré, but his work proved too slow on account of other obligations, and so Amélie created the horary tables. Despite her creation of the majority of this book, Amélie is not named on the title page. However, she does receive credit in the preface, where\n[\nLalande\n]\nstates he is her uncle .... When Jérôme received an award for the book, he dedicated it to Amélie, hoping to provide her with a modicum of credit.\nThe award referred to in this quote was a medal for distinguished work from the Lycée des Arts.\nAmélie Lefrançais de Lalande's work was also incorporated into\nConnaissance des temps\nⓉ\n(\nKnowledge of the times\n)\nwhich\nLalande\nedited from\n1794\nuntil his death in\n1807\n. She also collaborated with\nLalande\nin the preparation of his\nHistoire céleste française\nⓉ\n(\nFrench celestial history\n)\n(1801)\nwhich consists of the locations and apparent magnitudes of\n47390\nstars, up to magnitude\n9\n[\n4\n]\n:-\nThe amount of work implied by this publication can be understood by the fact that, just considering the computational part, at least\n36\noperations were needed for each star.\nLalande\nwrites in the Preface to\nHistoire céleste française\nⓉ\n(\nFrench celestial history\n)\n:-\nOf our fifty thousand stars there are already twelve thousand reduced, which have appeared in various volumes of the 'Connaissance des temps'; and Madame Lefrançais Lalande works to reduce them all, while her husband, with Burckhardt, goes over the zodiacal zones.\nWe explained above that Amélie was fortunate since\nLalande\nwas a supporter of women astronomers. We quote from an English translation of the\nHistorical Preface\nto\nLalande\n's\nAstronomie des dames\nⓉ\n(\nAstronomy for ladies\n)\n(1785)\nwhere in some ways he puts Amélie's contributions into the context of women astronomers\n[\n8\n]\n:-\nWe have, already, many instances of females, who have evinced a laudable spirit of inquiry, and great perseverance in the pursuit of this science. The beautiful\nHypatia\n, who was assassinated by the clergy at Alexandria, in the year\n415\n, taught astronomy there, and composed several works.\nMaria Cunitz\n, the daughter of a physician of Silesia, published some astronomical tables in\n1650\n; and Maria Claire Eimart Muller, the wife and daughter of two well-known astronomers, was also well versed in this science. In\n1680\n, Joanna Dumée gave lectures on the Copernican system; and the wife of\nHevelius\n[\nElisabetha Hevelius\n]\nmade observations with him.\nManfredi\n's sister calculated the Ephemeris of Boulogne; as did Kirch's three sisters, for a length of time, that of Berlin: his wife, also, published, in\n1712\n, a work on astronomy. The\nMarchioness du Châtelet\ntranslated and published the works of\nNewton\n; and the Countess of Purinina, to whom the passage in Scripture, \"Una mulier fuit confusionem genti,\" was justly applied, founded an observatory in Poland. Madame\nLepaute\n, who died in\n1788\n, calculated the ephemeris of the Academy for more than ten years; and the widow of Mr Edwards is now employed in England, in the composition of the Nautical Almanack. Madame du Piery, the first lady who taught astronomy at Paris, made several calculations of eclipses, to ascertain the Moon's motion; and Miss\nCaroline Herschel\n, whose proficiency in the science is so well known, has discovered five comets. Madame la Duchesse de Gotha does not wish to be quoted, but she has, likewise, made several calculations; and my niece, Françoise de Lalande, assists her husband in his observations, whence she draws her conclusions by calculations. She has reduced ten thousand stars, and has published three hundred pages of 'Horary Tables for the Navy'; an immense work for one of her age and sex, which may be found in my 'Abridgment of Navigation'.\nWe have here given sufficient instances of females who have distinguished themselves, even under every disadvantage of education and prejudice, to convince us that their abilities are not inferior, even to those of our sex who have attained the highest celebrity in the sciences.\nIn\n[\n2\n]\nAlic writes that Amélie Lefrançais de Lalande:-\n... lectured on astronomy in Paris, and worked independently as well as in collaboration with her husband.\nWe have not yet discovered any details regarding her work as a lecturer. When we wrote our first biography of Amélie Harlay in\n2008\n, we hoped to be able to find more information and improve our biography at a future date. We have now\n(2021)\nrewritten our biography, corrected it in line with the latest research, added many more references, and given further details of Amélie Harlay's life and work. Sadly, we still know less about her than we would like. Unless some researcher finds previously unknown sources, we fear that, because she was a woman, far fewer details of her life have been recorded than would have been the case for an equally expert male scholar of her time.\nFinally we note that Amélie's husband Michel Lefrançais was elected to the Bureau des Longitudes in\n1795\n, to the Astronomy Section of the\nAcademy of Sciences\nin\n1801\n, and was made an officer of the Légion d'Honneur. As a woman, Amélie Lefrançais could not receive any such honours.",
  "math_areas": [
    "Analysis"
  ]
}