{
  "nome_completo": "Amie Wilkinson",
  "nome_curto": "Amie Wilkinson",
  "ano_nascimento": "1968",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wilkinson_Amie/",
  "lugar_nascimento": "Boston, Massachusetts, USA",
  "lugar_morte": null,
  "biografia": "Amie Wilkinson\nwas given the names\nAnne Marie Wilkinson\nbut is usually known as Amie. She is the daughter of Ruth Elaine VanDemark\n(1944\n-\n2012)\nand her husband Leland Wilkinson\n(1944\n-\n2021)\n. Ruth VanDemark was born in Sioux Falls, South Dakota, graduated from Vassar College in\n1966\nand began to study at the Harvard Divinity School. There she met Leland Wilkinson who had been born\n5\nNovember\n1944\nin New York, had graduated from Harvard University in\n1966\nand also began studying at Harvard Divinity School. Ruth and Leland were married on\n23\nJune\n1967\nin Sioux Falls; they had two children, Anne Marie Wilkinson known as Amie, the subject of this biography, and Caroline Wilkinson who was two years younger than her sister.\nTo understand Amie's upbringing we should look briefly at the careers of her parents. Leland Wilkinson graduated from Harvard Divinity School in\n1969\n, studied psychology at Yale where he was awarded a Ph.D. in\n1975\n, then was an assistant professor of psychology at the University of Illinois at Chicago from\n1976\nto\n1980\nwhen he was promoted to associate professor. In\n1991\nhe became an adjunct professor of statistics at Northwestern University in Evanston, Illinois and in\n2007\nhe became an adjunct professor of computer science at the University of Illinois at Chicago. Ruth VanDemark returned to academic studies after the births of her two daughters and graduated from the University of Connecticut Law School in\n1976\n. She moved to Evanston with her husband and children and became a partner and head of the appellate department at Wildman, Harold, Allen & Dixon. In the\n1990\ns she studied at the Lutheran School of Theology at Chicago and became a Lutheran minister at Wicker Park Lutheran Church in Chicago. Amie Wilkinson writes about her parents in\n[\n30\n]\n:-\nMy mother had a conspiratorial nature and a wild imagination. She was an early feminist who was caught by surprise by two children within three years of getting married. After spending a few very frustrating years as a stay-at-home mom, she decided to take back her maiden name when I was\n4\nand my sister\n2\nand applied to law school. She joined the National Organization for Women and worked toward passage of the Equal Rights Amendment. She also taught me feminism with a distinctly misandrist bent. ... I admired my mother and emulated her and was proud that she had a different last name. She gave me the notion that I could do anything I wanted and that I would probably have to fight like hell to do it.\nMy father was a scientist, with a keen eye for the playful. While my mother was in law school, he was a Ph.D. student who assumed a lot of childcare responsibilities. For my sister and me, this meant hanging around with a slightly overgrown child who was most engaged with us when he himself was engaged in a project. ... Like my mom, my dad resisted conventional constraints. A high school maths whiz, he chose to major in English in college. He next went to divinity school where he met my mom, and then decided to become a social worker. Halfway through a PhD programme in psychology, he became fascinated with computers and the statistical side of the discipline, a field called psychometrics. He dedicated his dissertation to his great loves: his wife, his children, and the computer. He switched careers several times in his life, taught himself both Hebrew and Russian, commuted on roller skates, and was an accomplished amateur pianist.\nAmie Wilkinson attended a Montessori school for preschool and then kindergarten. Her love of mathematics began when she was five years old at the Montessori school where she played with toys which were designed as fun objects which taught one to count in different number bases. Her parents were highly involved in the political events of the early\n1970\ns and they involved Amie from a young age. They opposed the Vietnam War and took Amie with them when they were campaigning for George McGovern in his\n1972\nbid for the presidency which Richard Nixon won. Amie's parents then became involved in the Watergate investigations and again Amie had an early introduction to American and world politics. Although she received this early introduction to political activities through her parents, in fact she was often left alone as a child and given a freedom which she now thinks helped develop her scientific thinking. Although she never felt academically pressurised by her parents, they did arrange for her to skip the fourth grade of primary school.\nAt the age of thirteen, in\n1981\n, Wilkinson entered Evanston Township High School. Already knowing that mathematics was the subject for her, she was further encouraged through excellent teaching by John Benson. Benson had studied mathematics at Luther College and Vanderbilt University graduating with a Master's Degree in\n1969\n. He taught mathematics for\n42\nyears at Evanston Township High School beginning in\n1968\n. He received the Presidential Awards for Excellence in Mathematics and Science Teaching in\n1987\n. We learn something of Wilkinson's achievements at Evanston Township High School from the Yearbooks\n[\n1\n]\n,\n[\n2\n]\nand\n[\n3\n]\n. In\n1982\nshe was a member of the Debate Team and in the North Suburban Math League. In\n1984\nshe was in Atlantic Pacific\n[\n2\n]\n:-\n... one of four maths contests that are held monthly at Evanston Township High School. Atlantic Pacific and Illinois Math League are both half hour tests. Usually about twenty students attend each test. These tests are fairly advanced, and they help students learn maths quickly and efficiently.\nShe was also in the Mathletes Team, the Speech Team, and Croo\n[\n2\n]\n:-\nCroo is a group of about fifteen students who take care of everything that isn't done by the actors themselves. Croo builds all the sets\n(\nincluding most props\n)\nand takes care of lighting and sound. After the actors have left they remain to clan up. Needless to say, Croo works after school every day and often on Saturdays. Croo is an elite club. One must have worked more than three shows to be a member.\nWilkinson was taught physics by Robert Horton, an outstanding teacher who gave up college teaching after a year and began teaching at Evanston Township High School in the\n1970\ns. He was enthusiastic about putting students forward for a Westinghouse Award\n[\n26\n]\n:-\nAs Evanston's mentor for physics students interested in the contest, which honours original research, Horton serves as teacher, adviser, counsellor and coach. Competing for the Westinghouse Awards requires more than a year of work by students, who must sacrifice afternoons, evenings and a considerable part of the summer before their senior years. ... Horton's students do all of their work for the contest at school and home. \"The amazing thing about him is that he's not a big research scientist, yet somehow he's able to produce these Westinghouse finalists,\" said Amie Wilkinson, an assistant maths professor at Northwestern University who was a\n1985\nhonouree while attending Evanston. At a time when the school had only five Apple computers, Horton and Wilkinson met early every day, carried a computer up the school elevator to the physics laboratory, conducted experiments and returned the computer before classes started.\nIn\n1985\nWilkinson graduated from Evanston Township High School, winning the two senior mathematics prizes, one for the best girl and one for the best overall student. She then began studying mathematics at Harvard University, writing in her application\n[\n30\n]\n:-\nI am certain that I will enter a scientific profession, and I am fairly sure that I will become a mathematician ... I want to make thinking my profession.\nHer first year at Harvard went well but in her second year she began to find difficulties. These began in the abstract algebra course taught by\nAndrew Gleason\n, where she found difficulties with group theory. She wanted to have a geometric model for mathematical concepts and, although group theory can be taught in this way, it was not presented as such in\nGleason\n's course. She lost a little of her enthusiasm for mathematics and explored other interests such as art. She continued to study mathematics, however, and was one of four students who took part in the\n1987\nDuluth Summer Research Program, a ten-week undergraduate research programme in mathematics supervised by Joseph A Gallian, a professor at the University of Minnesota Duluth. During this Research Experiences for Undergraduates Programme, she proved her first theorems which she published in the paper\nCircuits in Cayley digraphs of finite Abelian groups\nin the\nJournal of Graph Theory\nin\n1990\n. Gallian wrote that \"Wilkinson found an elementary, elegant, proof of some\" known results.\nAlso in the summer of\n1987\nWilkinson attended a talk on ergodic theory which she loved. Harvard did not teach courses on ergodic theory but Boston University did, and she attended an ergodic theory graduate course there but was \"mostly lost.\" Despite this\n[\n30\n]\n:-\nI decided to write a senior thesis on ergodic theory ... I felt a bit like I was exploring the wilderness, with little official supervision by the faculty at Harvard, but I liked it. It gave room to do my own thing, as I didn't seem to be particularly great at doing what the faculty themselves did.\nAt the beginning of her final undergraduate year at Harvard she went to\nAndrew Gleason\n, who was her Director of Undergraduate Studies, and asked for his advice on whether she should apply to graduate schools. He said\n[\n30\n]\n:-\nIf you do choose to pursue mathematics further, you should know that in the end there is a great pyramid of mathematicians. A small number are at the very top, but the vast majority are at the bottom of this pyramid. As long as you're comfortable with the possibility of being at the bottom, I see no reason not to continue.\nAlthough greatly angered by this comment, Wilkinson was not discouraged and was instead motivated by her anger. She graduated from Harvard with a Bachelor of Arts in mathematics degree in June\n1989\n. Asked about her future plans by a TV News Crew as she left the graduation ceremony, she said, \"I have no idea!\" She applied for several jobs and was offered an actuarial consulting position in Chicago. She accepted, found an apartment in downtown Chicago and was very happy with the job. She missed mathematics, however\n[\n18\n]\n:-\nI came back home to Chicago, and I got a job as an actuary. I enjoyed my work, but I started to feel like there was a hole in my existence. There was something missing. I realised that suddenly my universe had become finite. Anything I had to learn for this job, I could learn eventually. I could easily see the limits of this job, and I realised that with mathematics there were so many things I could imagine that I would never know. That's why I wanted to go back and do mathematics. I love that feeling of this infinite horizon.\nWilkinson applied for several postgraduate programmes and received several offers of a place. She was also awarded a National Science Foundation Graduate Research Fellowship\n(1990\n-\n1993)\n. Her grades had not been outstanding at Harvard but the Duluth Summer Research Program and resulting paper pointed to her potential as a researcher. She accepted the offer from the University of California, Berkeley where she was assigned Charles C Pugh as her doctoral supervisor. Charles Chapman Pugh\n(\nborn\n16\nJune\n1940)\nhad been awarded a Ph.D. by Johns Hopkins University in\n1965\nand was an expert in dynamical systems. She described him as\n[\n15\n]\n:-\n... one of the most gentle, open, enthusiastic mentors.\nOthers who helped Wilkinson in the early stages of her research career include Lisa Goldberg, Michael Shub and Keith Burns. Lisa Goldberg was awarded a PhD in mathematics from Brandeis and then became a Professor of Mathematics at CUNY. She was visiting Berkeley when Wilkinson was a undertaking research there and connected her with mathematicians with similar interests. Michael Shub, works on dynamical systems, had obtained his Ph.D. degree at the University of California, Berkeley in\n1967\n, and was from\n1985\nworking for IBM's Thomas J Watson Research Center in Yorktown, New York. Keith Burns received his PhD from the University of Warwick in\n1983\n, then held a postdoctoral position at the Mathematical Sciences Research Institute in Berkeley. He works in dynamical systems and ergodic theory, was on the faculty of Northwestern from\n1987\nand was named an Alfred P Sloan Fellow in\n1989\n.\nDuring the years she was undertaking research for her Ph.D., in the summer of\n1992\nshe was a Graduate Research Assistant at the Center for Nonlinear Studies, Los Alamos National Laboratories and in the winter of\n1992\nshe was a visitor at IBM's Thomas J Watson Research Center in Yorktown. In the summer of\n1993\nshe was a Member of the Institut des Hautes Études Scientifiques in France and in the winter of\n1994\nshe was again at IBM's Thomas J Watson Research Center. She was awarded an IBM Graduate Research Fellowship for\n1994\n-\n95\n.\nWilkinson was awarded a PhD from the University of California in May\n1995\nfor her thesis\nStable Ergodicity of the Time-One Map of a Geodesic Flow\n. The paper\n[\n29\n]\n, which is the published version of her thesis, contains the following Acknowledgements:-\nThe contents of this paper originally comprised a Ph.D. dissertation at the University of California, Berkeley. The author thanks her advisor, Charles Pugh, for inspiration, guidance and support. Thanks also to Michael Shub, Keith Burns and the referee for useful suggestions.\nIn fact up to\n2024\nWilkinson published five papers with Pugh as a co-author, eight with Shub as a co-author and eleven with Burns as a co-author. There is one paper,\nRecent results about stable ergodicity\n(2001)\n, with all four as co-authors.\nFrom\n1995\nto\n1996\n, she was a\nBenjamin Peirce\nInstructor at Harvard University. She then moved to Northwestern University in Evanston, Illinois, where she became\nBoas\nAssistant Professor of Mathematics; a\n3\n-year non-tenure-track position.\nOn\n28\nDecember\n1996\n, Wilkinson married Benson Stanley Farb\n(\nborn\n25\nOctober\n1967)\n. Farb had graduated from Cornell University in\n1989\n, obtained a PhD at Princeton University in\n1994\nunder the direction of\nBill Thurston\n, and then was a postdoctoral fellow at the University of Chicago. The\nNew York Times\nreported their marriage\n[\n11\n]\n:-\nAnne Marie Wilkinson, a daughter of Ruth E VanDemark and Leland Wilkinson of Evanston, Illinois, was married last evening to Benson Stanley Farb, the son of Mignon K Farb and Dr Stanley N Farb of Jeffersonville, Pennsylvania. The Rev Dr Frank C Senn, a Lutheran pastor, officiated with Rabbi Michael P Sternfield at the University Club in Chicago.\nThe bride, who is known as Amie, and the bridegroom are assistant professors of mathematics, she at Northwestern University in Evanston and he at the University of Chicago, where he is a National Science Foundation postdoctoral fellow.\nThe bride,\n28\n, is keeping her name. She graduated cum laude from Harvard University and received a Ph.D. in mathematics from the University of California at Berkeley. Her father is a senior vice president of SPSS, a software company, and her mother is a lawyer, both in Chicago.\nThe bridegroom,\n29\n, graduated summa cum laude from Cornell University, where he was elected to Phi Beta Kappa. He received a Ph.D. in mathematics from Princeton University. His mother retired as a special-education teacher in Montgomery County, Pennsylvania. His father is an otolaryngologist in Norristown, Pennsylvania.\nAmie Wilkinson and Benson Farb have two children: Beatrice Farb and Felix Farb.\nAfter her\n3\n-year position at Northwestern University as Boas Assistant Professor of Mathematics, Wilkinson was appointed as an Assistant Professor of Mathematics at Northwestern in\n1999\n. In\n2002\nshe was promoted to Associate Professor of Mathematics and from\n2005\nto\n2011\nshe served as a Professor of Mathematics at Northwestern. During these years she had many visiting positions. She was at IBM's Thomas J Watson Research Center in Yorktown in the summers of\n1997\n,\n1998\n,\n2000\nand\n2001\n. She was in France during the summers of\n1996\nand\n1998\nat Institut des Hautes Études Scientifiques, and at the Université de Bourgogne in May\n2002\nand September\n2003\n. She was invited to deliver prestigious lectures, for example in the Mechanics and Dynamical Systems session of the International Congress in Mathematical Physics held in Prague in August\n2009\nand in the Dynamical systems and ordinary differential equations session of the International Congress of Mathematicians held in Hyderabad in August\n2010\n. At this Congress she gave the lecture\nConservative Partially Hyperbolic Dynamics\nwith the following Abstract:-\nWe discuss recent progress in understanding the dynamical properties of partially hyperbolic diffeomorphisms that preserve volume. The main topics addressed are density of stable ergodicity and stable accessibility, centre Lyapunov exponents, pathological foliations, rigidity, and the surprising interrelationships between these notions.\nShe began the talk as follows:-\nHere is a story, told at least in part through the exploits of one of its main characters. This character, like many a Hollywood\n(\nor Bollywood\n)\nstar, has played a leading role in quite a few compelling tales; this one ultimately concerns the dynamics of partially hyperbolic diffeomorphisms.\nIn\n2011\nshe received her first major award, namely the Ruth Lyttle Satter Prize. You can read the citation and other details about this award at\n.\nWilkinson left Northwestern University in\n2012\nand became a Professor of Mathematics at the University of Chicago. Let us quote from\n[\n15\n]\nher own description of her research:-\nMy research is in the area of dynamical systems, which is the study of the long term evolution of a space subject to a set of deterministic rules. Such  rules  are given, for example,  by a system of ordinary differential equations.  I study smooth systems in particular.  I'm very interested in considering what happens to a smooth manifold when it is acted upon by a group, the simplest example being the group generated by a single diffeomorphism of the manifold.\nIn this case you can picture the action of the dynamical system over time to be given by composing this diffeomorphism with itself, and one is interested in the long term behaviour of this iterated system.  For example, what happens to a point in the manifold when one watches it evolve over time? What structures on this manifold are preserved under the action of this group?   What measures on the space of probability measures on the manifold are preserved? What fractal-type structures are preserved?\nThere are three different types of questions that really interest me. The first is:  you take an interesting type of dynamical behaviour such as mixing and you ask what mechanisms in the dynamical system will produce mixing, and by mechanisms I mean some rough property of the system that  gives you only partial information about the system but will imply properties like ergodicity. And mechanisms typically produce robust behaviours,  robust mixing is an example. I look for mechanisms that produce chaotic behaviour robustly. Part of my research has been focused on this type of question.\nShe continues to receive awards, honours, and invitations to deliver lectures. For a full list of these see\n[\n31\n]\n, but let us mention just a few examples. In\n2013\nshe became a fellow of the\nAmerican Mathematical Society\n[\n4\n]\n:-\nFor contributions to dynamical systems.\nShe gave the Distinguished Lecture Series at the University of California Los Angeles\n21\n-\n25\nMay\n2018\n. Her three lectures were titled\nThe Ergodic Hypothesis and Beyond\nand can be watched at\n[\n33\n]\n. She gave the Opening Public Lecture of the\n2018\nFields\nMedal Symposium on\n5\nNovember\n2018\nwhich was held to honour\nMaryam Mirzakhani\n. Wilkinson's lecture\nIllumination and the Work of Maryam Mirzakhan\nhad the following Abstract:-\nTurn on a light in the middle of a room: is every spot illuminated? If the room is a complicated labyrinth, then probably not, but what if the walls of the room are mirrors? We will explore the hidden corners of a mirrored room using the mathematical tools developed by\nMirzakhani\nand her collaborators. The journey will take us through billiard tables and special kinds of surfaces resembling faceted donuts with many holes.\nIn\n2019\nshe was elected a Foreign Member, Academia Europaea and in\n2020\nshe was awarded the prestigious Levi L Conant prize by the\nAmerican Mathematical Society\nfor the article \"What are Lyapunov exponents, and why are they interesting?\", published in the\nBulletin\nof the\nAmerican Mathematical Society\nin\n2017\n. In\n2021\nshe was named to\nAmerican Academy of Arts and Sciences\n.\nIn\n2018\nshe said\n[\n8\n]\n:-\nWith age has come freedom to speak my mind, to act stupid, and to take risks. While research is as interesting as ever, my focus recently has also been on advising and mentoring, on helping to build the dynamics group at the University of Chicago, and on communicating mathematics to the world outside.\nShe continues to make outstanding contributions in all these aspects of her professorship.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Combinatorics",
    "Geometry",
    "Logic",
    "Statistics",
    "Topology"
  ]
}