{
  "nome_completo": "Amy Rayson",
  "nome_curto": "Amy Rayson",
  "ano_nascimento": "1861",
  "ano_morte": "1946",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Rayson/",
  "lugar_nascimento": "Wellingborough, Northampton, England",
  "lugar_morte": "Westcliff-on-Sea, Essex, England",
  "biografia": "Amy Rayson\nwas the daughter of the schoolmaster Thomas Rayson\n(1838\n-\n1927)\nand his wife Emily Phillips\n(1840\n-\n1918)\n. Amy was baptised on\n30\nJune\n1861\nin the Church of England in Wellingborough. Thomas Rayson, born in Great Billing, Northamptonshire, England in\n1838\n, had a B.A. from Oxford University. He married Emily Phillips, born in Flore, Northamptonshire, England in\n1840\n, on\n5\nApril\n1860\nin Flore. Thomas and Emily Rayson had seven children, including: Amy Rayson\n(\nborn\n1861\n, the subject of this biography\n)\n; Mary Evangeline Rayson\n(\nborn\n1865)\n; Annie Rayson\n(\nborn\n1867)\n; Catherine Elizabeth Rayson\n(\nborn\n1870)\n; and Russell John Rayson\n(\nborn\n1879\n, died\n1881)\n. The family later moved to\n33\nHarcombe Road, St Mary Stoke Newington.\nAmy Rayson was educated at home and did not attend a school; this was possible with a schoolmaster as a father and she received an excellent education. She matriculated at Girton College, University of Cambridge in\n1886\nhaving been awarded a Clothworkers' Exhibition for proficiency in Physical Science, tenable for three years. She studied Part I of the Mathematical Tripos and was awarded a B.A.\n(\nClass II\n)\n, graduating in\n1889\n. After graduating she taught at Miss Sharland's West London Collegiate School for the year\n1889\n-\n90\n. Her younger sister Mary Evangeline Rayson was also educated at home, then became a student teacher at Bristol Clergy Daughters' School. She studied at Bedford College, London, and Girton College, University of Cambridge\n1889\n-\n1890\n.\nIn\n1890\n, Amy Rayson, her sisters Catherine Elizabeth Rayson, Mary Evangeline Rayson, Annie Rayson and their mother Emily Rayson all emigrated to the United States and settled in New York. Amy Rayson taught mathematics and physics at Brearley School in New York from\n1891\nto\n1898\n. She was appointed as an Instructor in Mathematics and was living at\n34\nGramercy Park, New York City. This was a school for women with high academic standards\n[\n6\n]\n:-\nBrearley's founding Head, Samuel A Brearley, Jr., graduated from Harvard in\n1871\nand worked as a private tutor until\n1880\n, when he went to study at Balliol College, Oxford. He came to New York in\n1884\n, when it was commonly thought that intellectual activity \"took the bloom from ladies,\" and opened a school to provide young women with an education comparable to that available to their brothers. An early graduate of the School later wrote that this \"first intellectual experience had a novelty and excitement that it is almost impossible for a person born in the twentieth century to understand.\" When Mr Brearley died of typhoid in\n1886\n, the School consisted of one hundred twenty pupils and a faculty of twenty. James G Croswell, a Greek professor from Harvard, served as the next Head of School until his death in\n1915\n.\nIn December\n1891\n, Amy became a member of the\nNew York Mathematical Society\n. The\nNew York Mathematical Society\nhad been founded on\n24\nNovember\n1888\nat a meeting attended by only six people and a year later it was still very small with only eleven members. All these eleven were men but\nCharlotte Angas Scott\nbegan attending meetings of the Society soon after it was founded but could not join as membership was only open to those from New York. She was the first of seven women to join the Society, all seven becoming members in\n1891\n. It was in\n1891\nthat membership became open to those living outside New York. The other six women were\nCharlotte Angas Scott\n,\nAchsah Ely\n,\nSusan Jane Cunningham\n,\nMary Emma Byrd\n,\nMary Watson Whitney\nand\nEllen Amanda Hayes\n. By the end of\n1891\nthe Society had\n210\nmembers,\n37\nof whom lived in New York, and seven were women.\nIn July\n1894\nthe\nNew York Mathematical Society\nbecame the\nAmerican Mathematical Society\n. Amy Rayson regularly attended meetings of the Society which were held in New York. She was present at the annual meeting of the\nAmerican Mathematical Society\nwhich was held in New York City on the afternoon of Friday\n27\nDecember\n1895\nwith President\nG W Hill\nin the chair. She attended the meeting of the Society which was held in New York City on Saturday,\n28\nOctober\n1899\n. The two sessions of this meeting were attended by thirty members. She attended the one hundred and twentieth regular meeting of the Society which was held in New York City on Saturday,\n29\nOctober\n1904\n, being one of twenty-four members at the usual morning and afternoon sessions. She attended the Eleventh Annual Meeting of the Society which was held in New York City on Thursday and Friday,\n29\n-\n30\nDecember\n1904\n; forty-nine members of the Society attended the meeting. She attended the thirteenth annual meeting of the Society which was held in New York City on Friday and Saturday,\n28\n-\n29\nDecember\n1906\n. This was the first time that the December meeting was held jointly with the American Association for the Advancement of Science.\nThe one hundred and thirty-third meeting of the Society which was held in New York City on Saturday,\n27\nApril\n1907\nwas of special interest to Amy Rayson. The presidential address by\nWilliam Fogg Osgood\non \"The calculus in our colleges and technical schools\" was particularly relevant to Rayson but must have also been for others since the attendance exceeded all previous records for the April meetings, with an audience of about seventy including sixty-one members of the Society. Later that year, Rayson attended the fourteenth annual meeting of the Society which was held in New York City on Friday and Saturday,\n27\n-\n28\nDecember\n1907\n. Two sessions were held on Friday and one on Saturday morning. Fifty-three members attended the three sessions.\nIn the year\n1899\n, Amy Rayson became the joint principal of the Misses Rayson's Boarding and Day School for Girls at\n164\n-\n168\nWest\n75\nth Street, Manhattan, New York City. In fact the school was a joint venture run by Amy Rayson and her sisters Catherine Elizabeth Rayson, Mary Evangeline Rayson and Annie Rayson. Their mother Emily Rayson also worked at the school which was in houses rented by the Raysons.\nIn the June\n1905\nNew York Census, the family were living in their school at West\n75\nth Street, New York City. Amy Rayson is recorded as head of the family with occupation \"principal private school\" while her sister Annie Rayson also has the occupation \"principal private school.\" Amy's mother, Emily Rayson, and her sister Catherine Elizabeth Rayson are both living at the school with occupation \"housework.\" They have two servants, Rose Sweeney and Mary Burke, both immigrants.\nThe five years from\n1905\nto\n1910\ncertainly sees the school growing in size and importance. In the April\n1910\nUS Census the family is recorded as living in their school at West\n75\nth Street, New York City. In the three houses that made up the school,\n164\n-\n168\n, Amy Rayson is recorded as head of the family with occupation \"teacher private school.\" Her mother Emily Rayson is living at the school as are Amy's two sisters Mary Evangeline Rayson and Annie Rayson. Amy's mother and two sisters are all recorded as \"teacher private school.\" All four Raysons are listed as having immigrated to the United States in\n1890\n. Mary H Smithett, born in Massachusetts, is employed by the Raysons as a teacher at the school. Elizabeth J Hancock\n(\nnurse\n)\n, Bessie L Hume\n(\nhousework\n)\n, Jane Cantor\n(\ncooking instructor\n)\n, Minnie Sinsicwitz\n(\nlaundress\n)\n, Mary Hadden\n(\nhouse worker\n)\n, Elizabeth Fredricksen\n(\njanitress\n)\nand John Fredricksen\n(\njanitor\n)\nare all listed as \"servants.\" Six of these servants are immigrants, the only one born in America is Mary Hadden from Pennsylvania. Two pupils were boarding at the school, Juliette Shaw and Dora M S Larass both aged sixteen.\nAmy Rayson, her two sisters Mary Evangeline Rayson and Annie Rayson, and her mother Emily Rayson, all returned to England, sailing from New York to Liverpool arriving on\n14\nAugust\n1914\n. They sailed on the Cunard Steamship Company ship the\nCarmania\n. Amy lived at the family home at\n18\nSatanita Road, Westcliff-on-Sea, Essex. She died on\n27\nDecember\n1946\nand left £\n8964\n. Her sister Mary Evangeline Rayson lived at Ashford House, Little Hadham, Hertfordshire and died in the Hospital Bishops Stortford, Hertfordshire on\n21\nAugust\n1943\n. She left £\n300\n. Catherine Elizabeth Rayson took up writing fiction at the age of\n92\nand, a year later, sold her first story to the\nLondon Mystery Magazine\n. She died in London in\n1967\n.",
  "math_areas": [
    "Calculus"
  ]
}