{
  "nome_completo": "Anatolii Volodymyrovych Skorokhod",
  "nome_curto": "Anatolii Volodymyrovych Skorokhod",
  "ano_nascimento": "1930",
  "ano_morte": "2011",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Skorokhod/",
  "lugar_nascimento": "Nikopol, Dnipropetrovsk region, Ukraine",
  "lugar_morte": "Lansing, Michigan, USA",
  "biografia": "Anatolii Volodymyrovych Skorokhod\n's parents were Volodymyr Oleksiyovych and Nadiya Andriivna Skorokhod; they were both school teachers. Volodymyr Oleksiyovych taught mathematics, physics and astronomy, while Nadiya Andriivna taught mathematics, history, literature, and music.\nAnatolii Volodymyrovych were the eldest of his parents two children having a younger brother Valerii Volodymyrovych. Having two teachers for parents, both boys were brought up in an atmosphere where learning was encouraged and both boys developed a love for reading books and studying nature. Volodymyr Oleksiyovych and his family moved frequently since he was teaching in different villages in the region. When Anatolii Volodymyrovych was five years old his parents settled in Marganets, a town close to Nikopol where he had been born; both were mining towns in the Donets Basin on the Dnieper river.\nIn\n1937\nAnatolii Volodymyrovych began his schooling in Marganets but the invasion by German troops in\n1941\nsaw the school close and Anatolii had to continue his education with his parents in his own home. The war saw terrible destruction in Ukraine; large numbers of people died, industry was almost wiped out and agricultural machinery was almost completely destroyed. A drought in\n1946\nexacerbated the situation and a famine saw a million people starve to death. Anatolii's parents quickly saw the danger and, in\n1946\n, moved their family to Kovelin in the Volyn region in the north west of Ukraine. Anatolii had romantic ideas at this time, dreaming that he might become a sea captain, but his poor eyesight soon made him realise that such ambitions were impossible. He completed his secondary schooling in Kovelin, graduating in\n1948\nwith a golden medal. In the same year he entered the Mechanics and Mathematics Faculty of Kiev University.\nWhile an undergraduate in the Department of Mathematical Analysis, Skorokhod learnt about the latest research developments in the area of limit theorems in\nprobability theory\nthanks to his teachers\nBoris Vladimirovich Gnedenko\nand Iosif Il'ich Gikhman. These two had a decisive influence on the direction that Skorokhod's research interests took throughout his future career, but Gikhman\n(\nborn\n26\nMay\n1918\nin Uman, Ukraine\n)\nalso became his colleague and close friend. Skorokhod graduated from Kiev University in\n1953\nand went to Moscow State University to undertake research advised by\nEugene Borisovich Dynkin\n. He submitted his candidate's thesis\n(\nequivalent to a Ph.D.\n)\nLimit theorems for random processes\nin\n1956\n. Remarkably, he had already published six papers:\nOn a theorem of N K Bari\n(1953)\n,\nAsymptotic formulas for the stable distribution laws\n(1954)\n,\nOn a theorem concerning stable distributions\n(1954)\n,\nAsymptotic properties of stable distribution laws\n(1955)\n,\nMarkov processes in normal spaces\n(1955)\n, and\nOn limit transition from a sequence of sums of independent random variables to a homogeneous stochastic process with independent increments\n(1955)\n.\nAfter the award of his candidate's degree, Skorokhod returned to Kiev University where he began lecturing, but he also worked on his doctoral dissertation\n(\nequivalent to the German\nhabilitation\n)\n. He was awarded his doctorate in\n1962\nfor his thesis\nStochastic differential equations and limit theorems for random processes\n. Two years later, although continuing with his role at Kiev University, he became Head of the Department of the Theory of Random Processes at the Institute of Mathematics of the Ukrainian Academy of Sciences. He rapidly built an important school at Kiev\n[\n3\n]\n:-\nFrom the very beginning of his work at the Kiev University, Skorokhod distinguished himself by a unique manner of delivering lectures; proving numerous statements impromptu, he made his students the participants of creative scientific work. When Skorokhod returned to Kiev, the work of the scientific seminar on probability theory at the Kiev University became much more active. His discussions with speakers and capability to understand the core of a problem, generalize it, find possible weak points in the proof, and reveal the hidden relation of the problem considered to other problems turned the seminar sessions into a real creative laboratory, and all interested scholars tried to deliver a talk at the seminar in the presence of Skorokhod. Thus, the Kiev school in probability theory was largely formed as a result of Skorokhod's activities.\nA summary of Skorokhod's research contributions are given in\n[60]\n:-\nSkorokhod's researches have been concerned with the theory of probability, the theory of stochastic processes, and mathematical statistics. They have ranged over almost all the fundamental areas of these theories, and Skorokhod's contribution to the development of subjects such as limit theorems for random processes, stochastic differential equations, and probability distributions in infinite dimensional spaces can scarcely be exaggerated.\nSkorokhod has a remarkable publication record of around\n350\nbooks and papers\n(\nand many more if one counts translations, further editions, etc.\n)\n. His first monograph\nStudies in the Theory of Random Processes\nwas published in\n1961\nand since then numerous monographs have flowed from his pen. The difficulty of the material in this first monograph was noted by reviewers of the English translation which was published four years after the Russian original. For example, Loynes wrote\n[\n13\n]\n:-\nThe manipulation required is ingenious and impressive, and the general character of the results interesting. The treatment is probably as readable as the subject allows, and the collection of results into a book will be useful for anyone whose interests lie in that direction, but the formidable nature of the calculations involved will not, I am afraid, encourage anyone to browse.\nOdeh\n[\n16\n]\nalso emphasises the advanced nature of the material:-\nIt is highly specialized and is written for the person with a background in advanced probability. The book is primarily devoted to the development of certain probabilistic methods in the field of stochastic differential equations and limit theorems for Markov processes.\nGetoor\n[\n6\n]\ncomplains about the price of the book\n(\nas do other reviewers\n)\nbut is full of praise for the text:-\nThis is an excellent little book dealing, with several areas in the theory of\nMarkov\nprocesses ... ... this is a very useful work that ... can be recommended to all serious students of stochastic processes.\nIn\n[\n11\n]\nKorolyuk and Portenko survey Skorokhod's work on limit theorems for random processes, stochastic differential equations and the theory of Markov processes. Their article begins:-\nStarting from the middle fifties up to the present time, A V Skorokhod's works play a decisive role in the development of the theory of stochastic processes. Moreover, these works determine, to a large extent, basic directions in the development of this theory. ... Limit theorems for random processes and stochastic differential equations are the areas of probability theory in which, over\n35\nyears ago, Skorokhod started his scientific career and contributed much to their far-reaching advances. these areas combine the methodology used in his works - the so-called direct probabilistic methods. Among these, the method of a single probability space, the method of representing sums of independent random variables by values of a\nWiener\nprocess at random times, were introduced by Skorokhod\n(\nbearing his name\n)\nand are widely utilised in the world of probability theory.\nWe remarked above that Skorokhod and his former teacher I I Gikhman collaborated, and indeed they co-authored several important monographs:\nIntroduction to the theory of random processes\n(1965)\n;\nTheory of random processes\n. Vol. I\n(1971)\n;\nTheory of random processes\n. Vol. II\n(1973)\n;\nTheory of random processes\n. Vol. III\n(1975)\n,\nControlled random processes\n(1977)\n; and\nStochastic differential equations and their applications\n(1982)\n. Sadly, the collaboration with Gikhman ended since he died in Donetsk in\n1985\n. These books, however, represent only a part of many books that Skorokhod has written, both single-authored works and multiple-authored ones. Let us give just one further example of a book by Skorokhod, a relatively recent single-authored work. This is\nBasic principles and applications of probability theory\nwhich appeared in Russian in\n1989\nand in an English translation in\n2005\n. Ireneusz Szyszkowski gives the\n2005\ntranslation high praise in a review:-\nIn this\n282\npage book the author discusses an unbelievably wide range of topics on probability theory. All of the most important fundamental concepts and principles are briefly and expertly presented with uncompromising measure-theoretic rigour. The text is an excellent introduction to modern probability and its applications and is especially recommended to senior mathematics students and researchers looking for an uncluttered, concise and mathematically complete coverage of the subject. ... The original Russian edition of this book was published in\n1989\n, but its content is undoubtedly of timeless value and importance.\nIn\n1993\nSkorokhod moved to the United States, taking up a position at Michigan State University at Lansing, Michigan. The research he has undertaken at Michigan State has been particularly directed towards studying the asymptotic behavior of\ndynamical systems\nunder random perturbations.\nSkorokhod has, over his long and highly successful career, received many distinctions and awards for his outstanding contributions. These include: Corresponding Member of the\nUkrainian Academy of Sciences\n(1967)\n; Academician of the\nUkrainian Academy of Sciences\n(1985)\n; and Member of the\nAmerican Academy of Arts and Sciences\n(2000)\n. He received the Ukrainian State Prize in Science and Technology in\n1982\nand again in\n2003\n.\nFinally let us make sure we have not given the impression that Skorokhod's contributions are entirely related to his research activities.  He has also an outstanding record for making mathematics understandable to the general public as well as working hard to show school children the joys that mathematics has to offer. He has achieved these \"understanding of science\" activities in several different ways: writing many popular-science books, explaining mathematics to a television audience and  lecturing to school children throughout Ukraine. Let us also record that he has stood up for what he believed in despite suffering the consequences when this did not fit the political aims of those running the country. For fifteen years the totalitarian regime in Ukraine applied sanctions on Skorokhod, excluding him from serving on the editorial boards of certain journals, and preventing him from attending international meetings\n[\n3\n]\n:-\nHis absence at international scientific conferences gave birth to the opinion among foreign scientists that \"Skorokhod\" was the collective name of a group of Soviet scientists, just as the group of French mathematicians united under the name \"\nBourbaki\n\".",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Statistics"
  ]
}