{
  "nome_completo": "Anatoly Ivanovich Malcev",
  "nome_curto": "Anatoly Malcev",
  "ano_nascimento": "1909",
  "ano_morte": "1967",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Malcev/",
  "lugar_nascimento": "Misheronsky (near Moscow), Russia",
  "lugar_morte": "Novosibirsk, USSR",
  "biografia": "[\nLike most Russian mathematicians there are different ways to transliterate Malcev's name into the Roman alphabet. The most common way, other than Malcev, is to write it as Maltsev.\n]\nAnatoly Ivanovich Malcev\n's father was a glass-blower so his background was certainly from that of a poor family. It did not take long for his mathematical abilities to shine, however, and his teachers at secondary school quickly became convinced that he was destined to become an outstanding mathematician.\nMalcev graduated from school in\n1927\nand, in the same year, he went to Moscow State University to study mathematics. He graduated in\n1931\nbut before that he had already begun to teach in a secondary school in Moscow in\n1930\n. After graduating he continued with his teaching career then, in\n1932\n, he was appointed as an assistant at the Ivanovo Pedagogical Institute which was in Ivanovo to the north-east of Moscow. The town, on both banks of the Uvod River, had been known as Ivanovo-Voznesensk but was renamed Ivanovo in\n1932\n, the year Malcev started to work there.\nWhen Malcev began teaching in Ivanovo he had only a first degree but Ivanovo had a good rail link with Moscow and he was able to make frequent trips there to discuss his research with\nKolmogorov\n. Malcev's first publications were on logic and\nmodel theory\nand resulted from work he had begun entirely on his own. Ideas from these papers were later to reappear in\nRobinson\n's work on\nnon-standard analysis\n.\nKolmogorov\ninvited Malcev to join his graduate programme at Moscow University, and he held a studentship there for a year although he continued his teaching post at the Ivanovo Pedagogical Institute during the year. Malcev always considered himself to have been\nKolmogorov\n's student and certainly during the year he held the studentship at Moscow University, Malcev was directed by\nKolmogorov\nto certain algebra problems.\nIn\n1937\nMalcev published a paper on the embeddability of a ring in a field, answering a question posed by\nKolmogorov\n. The question had been posed originally by\nvan der Waerden\nas to whether there existed rings without zero-divisors which could not be embedded in a field. Malcev answered this question by constructing a ring whose multiplicative\nsemigroup\nwas not embeddable in a\ngroup\n. He was led to investigate the existence of rings whose multiplicative semigroup was embeddable in a group yet the ring still was not embeddable in a field. This led, two years later, to another fundamental paper of Malcev where he gave necessary and sufficient conditions for a semigroup to be embeddable in a group.\nIn\n1937\nMalcev wrote a dissertation on\nTorsion free\nabelian groups\nof finite rank\nthen, between\n1939\nand\n1941\n, he studied for his doctorate\n(\nwhich in Russia is similar to the\nhabilitation\n)\nat the\nSteklov\nInstitute of the\nUSSR Academy of Sciences\n. During this period in which he undertook doctoral research Malcev continued as a lecturer at the Ivanovo Pedagogical Institute. In\n1941\nhe received the degree of Doctor of Science for a dissertation\nStructure of isomorphic representable infinite algebras and groups\n.\nMalcev became a professor at Ivanovo Pedagogical Institute in\n1944\n. His work in group theory continued and he proved important results on\nlinear groups\nand, in particular, on linear\nsoluble groups\n. In\n[\n2\n]\nand\n[\n3\n]\nhis work on\nrepresentations\nof infinite groups by\nmatrices\nis commented on:-\nAmong these results we mention the local theorem for the class of groups representable by matrices of a given order, and also the theorem on residual finiteness of finitely generated linear groups. This last theorem implies, in particular, the proposition that\nfree groups\nare residually finite.\nMalcev also studied\nLie groups\nand\ntopological\nalgebras, producing a synthesis of algebra and mathematical logic. For example he wrote on semisimple\nsubgroups\nof Lie groups in\n1944\nand\nFree topological algebras\nin\n1957\n. In\n1946\nhe was awarded a State Prize for his work on Lie groups. Malcev also created a synthesis of the theory of algebras and of algorithms called constructive algebras.\nIn\n1960\n, Malcev was appointed to a chair in mathematics at the Mathematics Institute at Novosibirsk and to be chairman of the Algebra and Logic Department at Novosibirsk State University. At Novosibirsk\n(\n[\n2\n]\nand\n[\n3\n]\n)\n:-\nMalcev founded the Siberian section of the Mathematics Institute of the\nAcademy of Sciences\n, a logic-algebraic school with many members, and directed the world famous seminar Algebra i Logika. In\n1962\nMalcev founded the specialised journal Algebra i Logika and from that time he was editor of this journal. He was also the founder of the Siberian Mathematical Society and its first president, chief editor and active leader of Sibirsk. Mat. Zh.; and a member of one of the oldest journals in our country, Mat. Sbornik.\nDuring the early\n1960\ns Malcev worked on problems of decidability of elementary theories of various algebraic structures. He showed the undecidability of the elementary theory of finite groups, of free\nnilpotent groups\n, of free soluble groups and many others. He investigated the undecidability of the elementary theory of classical linear groups and proved that the class of locally free algebras had a decidable theory.\nIn\n1948\nMalcev wrote the undergraduate text\nFoundation of linear algebra\nwhich appeared in English translation in\n1962\n. If I\n[\nEFR\n]\nmay add a personal note, when I began to teach linear algebra in around\n1970\n, I discovered that the publisher Freeman gave away free copies of texts that lecturers might consider adopting for use by a class. I received Malcev's book\nFoundation of linear algebra\nfrom them and I was astonished to find this remarkable approach to linear algebra in a book superbly written to give an understanding of the subject rather than the approach adopted by a large number of linear algebra books which seem on the whole written to provide good examination questions.\nAt the regrettably early age of\n57\nMalcev died while taking part in the Novosibirsk Topology Conference which he had helped to organise\n(\n[\n2\n]\nand\n[\n3\n]\n)\n:-\nIt is impossible to forget the sorrow and deep concern that Malcev's death caused to all the mathematicians, those who lived in Novosibirsk as well as the guests. All felt they were saying farewell to a great scientist, to whom many were indebted...\nJust before his death Malcev had delivered his final lecture at this Novosibirsk Topology Conference. It was on algebras, now called Malcev algebras, which are natural generalisations of\nLie algebras\n. Malcev had introduced these algebras in\n1955\nand in this lecture he gave a survey of his work on this topic over the twelve preceding years.\nMalcev received many honours, and world-wide recognition for his innovative work. He was elected a member of the\nUSSR Academy of Sciences\nin\n1958\n. We mentioned some of the prizes he received above, such as the State Prize in\n1946\n, but another important honour which he received in\n1964\nwas a Lenin Prize for his series of papers on the applications of mathematical logic to algebra.\nIn\n[\n2\n]\nand\n[\n3\n]\nMalcev's contribution is summed up by pointing out that his:-\n... mathematical work is distinguished by the abundance of new ideas and the creation of new mathematical trends on the one hand, and the solution of a number of classical problems on the other hand.\nHe is described as:-\n... a person of great charm, an interesting companion and a wise counsellor on scientific and worldly affairs.\nIn\n[\n4\n]\nsome of Malcev's interests are described:-\nMalcev liked very long walks and long distance swimming. He played the violin from a very early age until he was\n30\n, when he switched to the piano ... He liked history, and there are a number of volumes on this subject in his library, including the history of mathematics.\nOther interests that he had included poetry and his particular tastes in music included Bach and Russian folk songs.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Topology"
  ]
}