{
  "nome_completo": "Anaxagoras of Clazomenae",
  "nome_curto": "Anaxagoras",
  "ano_nascimento": "499 BC",
  "ano_morte": "428 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anaxagoras/",
  "lugar_nascimento": "Clazomenae (30 km west of Izmir), Lydia (now Turkey)",
  "lugar_morte": "Lampsacus, Mysia (now Turkey)",
  "biografia": "Anaxagoras of Clazomenae\nwas described by\nProclus\n, the last major Greek philosopher, who lived around\n450\nAD as\n(\nsee for example\n[\n4\n]\n)\n:-\nAfter\n[\nPythagoras\n]\nAnaxagoras of Clazomenae dealt with many questions in geometry...\nAnaxagoras was an Ionian, born in the neighbourhood of Smyrna in what today is Turkey. We know few details of his early life, but certainly he lived the first part of his life in Ionia where he learnt about the new studies that were taking place there in philosophy and the new found enthusiasm for a scientific study of the world. He came from a rich family but he gave up his wealth. As\nHeath\nwrites in\n[\n4\n]\n:-\nHe neglected his possessions, which were considerable, in order to devote himself to science.\nAlthough Ionia had produced philosophers such as\nPythagoras\n, up to the time of Anaxagoras this new study of knowledge had not spread to Athens. Anaxagoras is famed as the first to introduce philosophy to the Athenians when he moved there in about\n480\nBC. During Anaxagoras's stay in Athens,\nPericles\nrose to power. Pericles, who was about five years younger than Anaxagoras, was a military and political leader who was successful in both developing democracy and building an empire which made Athens the political and cultural centre of Greece. Anaxagoras and Pericles became friends but this friendship had its drawbacks since Pericles' political opponents also set themselves against Anaxagoras.\nIn about\n450\nBC Anaxagoras was imprisoned for claiming that the Sun was not a god and that the Moon reflected the Sun's light. This seems to have been instigated by opponents of Pericles.\nRussell\nin\n[\n6\n]\nwrites:-\nThe citizens of Athens ... passed a law permitting impeachment of those who did not practise religion and taught theories about 'the things on high'. Under this law they persecuted Anaxagoras, who was accused of teaching that the sun was a red-hot stone and the moon was earth.\nWe should examine this teaching of Anaxagoras about the sun more closely for, although it was used as a reason to put him in prison, it is a most remarkable teaching. It was based on his doctrine of \"nous\" which is translated as \"mind\" or \"reason\". Initially \"all things were together\" and matter was some homogeneous mixture. The nous set up a vortex in this mixture. The rotation\n[\n4\n]\n:-\n... began in the centre and then gradually spread, taking in wider and wider circles. The first effect was to separate two great masses, one consisting of the rare, hot, dry, called the \"aether\", the other of the opposite categories and called \"air\". The aether took the outer, the air the inner place. From the air were next separated clouds, water, earth and stones. The dense, the moist, the dark and cold, and all the heaviest things, collected in the centre as a result of the circular motion, and it was from these elements when consolidated that the earth was formed; but after this, in consequence of the violence of the whirling motion, the surrounding fiery aether tore stones away from the earth and kindled them into stars.\nThere are remarkable insights in this description. The idea of differentiation of matter which plays a large role in modern theories of creation of the\nsolar system\nis present. Anaxagoras also shows an understanding of centrifugal force which again shows the major scientific insights that he possessed.\nAnaxagoras proposed that the moon shines by reflected light from the \"red-hot stone\" which was the sun, the first such recorded claim. Showing great genius he was also then able to take the next step and become the first to explain correctly the reason for eclipses of the sun and moon. His explanation of eclipses of the sun is completely correct but he did spoil his explanation of eclipses of the moon by proposing that in addition to being caused by the shadow of the earth, there were other dark bodies between the earth and the moon which also caused eclipses of the moon. It is a little unclear why he felt it necessary to postulate the existence of these bodies but it does not detract from this major breakthrough in mathematical astronomy. There is also other evidence to suggest that Anaxagoras had applied geometry to the study of astronomy.\nAs to the structure of matter, Anaxagoras postulated an infinite number of elements, or basic building blocks. He claimed:-\n... there is a portion of every thing, i.e. of every elemental stuff, in every thing...\n[\nbut\n]\neach is and was most manifestly those things of which there is most in it.\nHowever, it was the power of nous, or mind, that not only created the world but also was the driving force in its day to day processes. For example\n[\n2\n]\n:-\nThe growth of living things, according to Anaxagoras, depends on the power of mind within the organisms that enables them to extract nourishment from surrounding substances.\nAristotle\nboth found much to praise in Anaxagoras's theory of nous. Both\nPlato\nand\nAristotle\n, however, were critical of the fact that the driving force of the nous as proposed by Anaxagoras was not ethical. They wanted nous to always act in the best interests of the world. In fact the nous of Anaxagoras does provide a mechanical explanation of the world after the non-mechanical start when the vortex is produced. It is worth noting that\nNewton\n's mechanical universe would have more in common with Anaxagoras's views than the continuing ethical intelligence proposed by\nPlato\nand\nAristotle\n.\nWe can obtain some clues to the mathematics that Anaxagoras studied but, unfortunately, very little remains in the records to allow us to know of definite results which he may have proved. While in prison he tried to solve the problem of\nsquaring the circle\n, that is constructing with\nruler and compasses\na square with area equal to that of a given circle. This is the first record of this problem being studied and this problem, and other similar problems, were to play a major role in the development of Greek mathematics.\nOne other intriguing piece of information comes from the writing of\nVitruvius\n, a Roman architect, engineer, and author who lived in the first century BC. He records information about the painting of stage scenes for the plays which were performed in Athens and says that Anaxagoras wrote a treatise on how to paint scenes so that some objects appeared to be in the foreground while other appeared in the background. This fascinating comment must mean that Anaxagoras wrote a treatise on perspective, but sadly no such work survives.\nAnaxagoras was saved from prison by Pericles but had to leave Athens. He returned to Ionia where he founded a school at Lampsacus. This Greek city on the Asiatic shore of the Hellespont was the place for the worship of Priapus, a god of procreation and fertility. Anaxagoras died there and the anniversary of his death became a holiday for schoolchildren.\nThe best that we can hope to learn of Anaxagoras's personality is from the story that when once asked what as the point of being born he replied\n[\n4\n]\n:-\nThe investigation of sun. moon, and heaven.\nEven if this story is fictitious, it is likely to be based on the way that Anaxagoras lived his life and so tells us something of the personality of this remarkable scientist who gave a description of the creation of the solar system that took\n2000\nyears to improve upon.",
  "math_areas": [
    "Geometry"
  ]
}