{
  "nome_completo": "Andrew White Young",
  "nome_curto": "Andrew Young",
  "ano_nascimento": "1891",
  "ano_morte": "1968",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Young_Andrew/",
  "lugar_nascimento": "Lanton, Jedburgh, Roxburghshire, Scotland",
  "lugar_morte": "Edinburgh, Scotland",
  "biografia": "Andrew Young\n's father was Thomas Young, a schoolmaster at Lanton, Roxburghshire. Andrew was educated at Townshead Public School, Montrose, where he spent trhree months, Broughton Public School, Edinburgh, where he spent two and a half years, then at George Watson's College, Edinburgh where he spent seven years. He showed his outstanding abilities at George Watson's. He passed the Leaving Certificate examinations at Higher level in English, Latin, Greek, and Mathematics in\n1907\n.\nAfter having passed the Preliminary Examination, he first matriculated at the University of Edinburgh in October\n1909\n. There he continued his top quality performance receiving many awards. His main subjects were Mathematics and Natural Philosophy, but he also took courses in Chemistry and Political Economy at Ordinary level while studying Intermediate Honours Mathematics and Natural Philosophy. He graduated M.A. with First Class Honours in Mathematics and Natural Philosophy in July\n1913\n, and B.Sc.\n(\nPure\n)\nwith special distinction in Mathematics and in Natural Philosophy in\n1914\n. He was awarded the Donald Fraser Scholarship in Experimental Physics and the Vans Dunlop Scholarship in Mathematics in June\n1913\n.\nYoung was appointed a Lecturer at the University of St Andrews in\n1914\nand then he moved to the University of London, again as a lecturer. In\n1919\n, Young left the academic world and became the representative in Bremen, Germany, of Messrs S M Bulley & Son, Cotton Merchants of Liverpool. This major change in career was not the only one which Young made for, in\n1926\n, he decided to change again, this time taking up law. He returned to the University of Edinburgh, now\n35\nyears of age, and studied law. He graduated LL.B. in March\n1929\nand became a Writer to the Signet later the same year serving as an apprentice to E M Wedderburn and R F Shepherd. He then accepted a partnership in the firm of Messrs J & R A Robertson, Writers to the Signet.\nIn December\n1913\nYoung joined the\nEdinburgh Mathematical Society\n. At that time he was about to embark on an academic career as a mathematician. He read the paper\nOn the quasi-periodic solutions of Mathieu's differential equation\nto the Society at its meeting on Friday\n13\nFebruary\n1914\n. In January\n1915\nhe was appointed joint editor of\nProceedings\nin place of\nD M Y Sommerville\n, who had been appointed Professor of Mathematics in Victoria University College, Wellington, New Zealand. However, he remained a member through the various stages in his career, while he worked in Bremen, Germany, and after he returned to Edinburgh.\nYoung was elected to the\nRoyal Society of Edinburgh\non\n1\nMarch\n1937\n, his proposers being Charles H O'Donoghue,\nAlexander Craig Aitken\n, Sir Ernest M Wedderburn,\nSir Edmund T Whittaker\n. He served the Society in various capacities; as a Councillor from\n1942\nto\n1945\n, as Treasurer from\n1947\nto\n1957\n, and as Vice-President from\n1958\nto\n1960\n.\nAn obituary, written anonymously, appears in the\nRoyal Society of Edinburgh\nYear Book\n1970\n, pages\n53\n-\n54\n.\nWe give a version of this obituary at\nTHIS LINK\n.\nAndrew Young married Margaret Macgregor in\n1920\n.",
  "math_areas": []
}