{
  "nome_completo": "André Abraham Weil",
  "nome_curto": "André Weil",
  "ano_nascimento": "1906",
  "ano_morte": "1998",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Weil/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "André Weil\nwas born in Paris, the son of Jewish parents. His mother, Salomea Reinherz\n(1879\n-\n1965)\nknown as Selma, came from a family of Russian Jews who had emigrated to Austria, while his father, Bernard Bernhard Weil\n(1872\n-\n1955)\n, was a medical doctor whose family had lived in Strasbourg, Alsace.\nMore details of Bernard and Selma Weil are given at\nTHIS LINK\n.\nwhere details are also given of André's sister Simone Adolphine Weil\n(1909\n-\n1943)\n. We should mention that the Weil family originally used the spelling Weill, for example André's grandfather was Abraham Weill. The Weil family being from Alsace had the right to opt for French nationality and they had done this and moved to Paris. Bernard and Selma Weil were married in Paris in\n1905\n. When André was born in the following year, in addition to his parents, his paternal grandmother and several uncles were living in Paris but his paternal grandfather Abraham Weill had died in Strasbourg. André's maternal grandmother Hermine Reinherz, who was an excellent pianist, lived in his family home with the Weil family which, until\n1912\n, was on the Boulevard de Strasbourg.\nAndré's mother supervised his education for the first few years of his life and he had learned to read between the ages of\n4\nand\n5\n. When he was six years old in\n1912\n[\n6\n]\n:-\n... my mother chose an exceptional elementary teacher, Mademoiselle Chaintreuil, who taught the tenth form\n[\nthe second class\n]\nat the Lycée Montaigne. After several months of tutoring, she deemed me capable, even though I was a little too young, of joining her class at the lycée.\nAfter this first year at the lycée, the family went to Ballaigues in Switzerland for their summer holidays. The family moved from the Boulevard de Strasbourg to the Boulevard Saint-Michel before André began his second year at the lycée. Having done so well in this first year, he missed out a form and was put into the top section taught by M Monbeig\n[\n6\n]\n:-\nHe was an exceptional teacher, full of unconventional ideas.\nDuring the summer vacation of\n1914\nWorld War I broke out. André's father became an army doctor tending the wounded soldiers. He worked in a variety of military hospitals and André, his mother and sister\n(\nand usually his grandmother\n)\n, always moved to be with Bernard Weil. André fell in love with mathematics at an early age, and he writes that by the age of ten he was passionately addicted to it\n[\n6\n]\n:-\nOnce when I took a painful fall, my sister Simone could think of nothing for it but to run and fetch my algebra book, to comfort me.\nWhen Bernard was sent to Algeria the family didn't go with him but went to Chartes where André attended the lycée. By October\n1917\nwhen his father had returned to France, the family moved to Laval. In the following year he was tutored privately before the family returned to their home in Paris. Again he received private tutoring before entering M Collin's class at the Lycée Saint-Louis. It was in this school that studied the parts of mathematics that he had missed out in the studies he had made on his own. There were other things of importance in his life as well as mathematics, however, for he loved to travel. By the age of sixteen he had read the 'Bhagavad Gita' in the original Sanskrit. He had taught himself classical Greek, read Homer and Plato in Greek, and had also taught himself Latin. At meal times the family often conversed in German and English. He also loved European literature, art and music. In\n1921\n, his final year at the Lycée Saint-Louis, he met\nJacques Hadamard\nwho gave him good advice from that time on. Every year Weil won the mathematics prize and chose himself\n(\nwith\nHadamard\n's advice\n)\nbooks for his prize. He chose the three volumes of\nCamille Jordan\n's\nCours d'Analyse\nas well as\nWilliam Thomson\nand\nPeter Guthrie Tait\n's two-volume\nTreatise of Natural Philosophy\n. At this time relativity was an exciting new topic and he read\nArthur Eddington\n's description of \"\nEinstein\n's theory\". He graduated from the Lycée Saint-Louis in\n1922\nand, later that year, Weil entered the École Normale Supérieure in Paris. Weil writes\n[\n6\n]\n:-\nAt the \"École\", as we used to call it, the students were divided into groups sharing quarters. My first concern, even before school started, was to find companionable study mates. There were five of us ...\nThe four others were\nYves Rocard\n,\nJean Delsarte\n, Paul Labérenne\n(1902\n-\n1985)\n, and Jean Barbotte. Right from the time he entered the École Normale Supérieure, Weil attended\nHadamard\n's seminar at the Collège de France. He gave a talk to this seminar on domains of convergence of power series in several complex variables. Among the mathematics courses he attended were those of\nHenri-Léon Lebesgue\nand\nCharles-Émile Picard\n. However, he continued to have interests outside mathematics and took a course in Sanskrit at the Sorbonne. He graduated in\n1925\nbeing ranked first in the class despite returning a blank paper for rational mechanics which he did not consider to be part of mathematics.\nAfter graduating he spent the summer vacation walking in the French Alps, always taking a notebook with him in which he made his mathematical calculations. At this time he was particularly fascinated by solving Diophantine equations. After the summer vacation he went to Rome where he spent six months supported by a scholarship from the Sorbonne. He attended lectures by\nVito Volterra\nand\nFrancesco Severi\n, and gave a lecture on the\nMordell\nconjecture. However, he certainly didn't devote all his time to mathematics for he took the opportunity to study Italian painting. A Rockefeller Foundation fellowship funded a visit to Göttingen where he spent most of\n1927\nand produced his first substantial piece of mathematical research on the theory of algebraic curves. In Göttingen he met\nRichard Courant\n,\nEmmy Noether\nand others, profiting from discussions with them.\nHe then undertook research for his doctorate in the University of Paris, supervised by\nJacques Hadamard\n. He developed for his thesis the ideas on the theory of algebraic curves which he had begun to study at Göttingen. However,\nHadamard\nwanted his brilliant student to aim higher and try to prove the\nMordell\nConjecture. Weil chose not to follow his supervisor's advice. He wrote later:-\nMy decision was a wise one: it was to take more than half a century to prove\nMordell\n's Conjecture.\nHe received his doctorate from Paris in\n1928\nfor his thesis\nArithmétique des courbes algébriques\nⓉ\n(\nArithmetic of algebraic curves\n)\n. At this time military service was compulsory in France, so Weil undertook these duties in the year\n1928\n-\n29\n, leaving with the rank of lieutenant. He then taught at different universities, for example the Aligarh Muslim University in India from\n1930\nto\n1932\n. He had first discussed with Syed Masood, the Minister of Education for Hyderabad, obtaining an appointment to a chair in French Civilization at Aligarh University but, despite the promise, he received a telegram from Syed Masood:-\nImpossible to create chair of French civilisation. Mathematics chair open.\nHe took every opportunity to make the most of these years\n[\n11\n]\n:-\nHe used to the hilt the opportunity to immerse himself in all aspects of India: culture, religion, literature, people, history, scenery, archaeology, and so on, travelling all over, often under primitive conditions.\nReturning to France after the two years in India, he worked at the University of Strasbourg from\n1933\nuntil the outbreak of World War II.\nHenri Cartan\nwas on the staff at Strasbourg at this time and the two often discussed teaching. It was here that he became involved with the famous group of mathematicians writing under the name\nNicolas Bourbaki\n.\nHenri Cartan\ndescribed how the idea came about\n[\n4\n]\n:-\nAndré Weil and I were both at the University of Strasbourg in\n1934\n. I often talked with him about the course on differential and integral calculus that I was teaching. ... I often wondered about the best way to teach this course because the existing textbooks were not satisfactory ... I discussed my concerns several times with André Weil. One beautiful day he told me, \"I've had it, we need to fix this for good. We need to write a good textbook an analysis. Then you'll stop complaining!\"\nWe give more details of the\nBourbaki\ncollaboration below.\nOne of the founders of\nBourbaki\nwas\nRené de Possel\n. René was married to Eveline and Weil met her when\nBourbaki\nwas being set up. René and Eveline were divorced and, after waiting a considerable time for the divorce to come through, Weil married Eveline de Possel on\n30\nOctober\n1937\n. They had two daughters, Sylvie\n(\nborn\n12\nSeptember\n1942)\nand Nicolette\n(\nborn\n6\nDecember\n1946)\n.\nThe war was a disaster for Weil who had decided before hostilities broke out that he would avoid military service by going to the United States. However, he was in Finland, visiting\nRolf Nevanlinna\nand\nLars Ahlfors\n, when war was declared. He didn't want to return to France to avoid being forced into the army, but it was not a simple matter to escape from the war in Europe at this time. Weil was arrested in Finland in November\n1939\nand when letters in Russian were found in his room\n(\nthey were actually from\nPontryagin\ndescribing mathematical research\n)\nthings looked pretty black. Weil himself wrote:-\nThe manuscripts they found appeared suspicious - like those of\nSophus Lie\n, arrested on charges of spying in Paris, in\n1870\n. They also found several rolls of stenotypewritten paper at the bottom of a closet. When I said these were the text of a Balzac novel, the explanation must have seemed far-fetched. There was also a letter in Russian, from\nPontryagin\n, I believe, in response to a letter I had written at the beginning of the summer regarding a possible visit to Leningrad; and a packet of calling cards belonging to\nNicolas Bourbaki\n, member of the Royal Academy of Poldavia ...\nOne day\nNevanlinna\nwas told that they were about to execute Weil as a spy, and he was able to persuade the authorities to deport Weil instead. He was released from prison on\n12\nDecember\n1939\nand he was sent first to Sweden, then to England before finally being sent back to France where he was put in prison.\nBorel\nwrites\n[\n12\n]\n:-\nHis conditions in prison, at first somewhat hard, gradually improved: he could communicate with, and occasionally see, his family, had a lively correspondence with his sister, and could receive some books and work. At that time, he proved one of his most famous results, the \"\nRiemann\nhypothesis for curves over finite fields.\"\nA letter that Weil wrote while in prison at Rouen is at\nTHIS LINK\n.\nWeil was certainly in great danger at this time, partly because he was Jewish, partly because he had a sister Simone Weil who was a mystic philosopher and a leading figure in the French Resistance. The dangers of his predicament made Weil decide that being in the army was a better bet and he was able to argue successfully for his release on the condition that indeed he did join the army. On\n3\nMay\n1940\nhe was tried in Rouen.\nÉlie Cartan\nwent to Rouen to testify in his favour at his trial. He was released from prison and became an army private. Having used the army as a reason to get out of prison, Weil had no intention of serving any longer than he possibly could. As soon as the chance to escape to the United States came, he took it at once travelling there with his wife and parents in January\n1941\n. In the United States, supported by the Rockefeller Foundation, he went to Pennsylvania where he taught from\n1941\nat Haverford College and then at Lehigh University. In\n1945\nhe accepted a position in São Paulo University, Brazil, where he remained until\n1947\n. In\n1947\nWeil returned to the United States and he was appointed to the faculty of the University of Chicago, a position he continued to hold until\n1958\n.\nShiing-Shen Chern\nwrites\n[\n14\n]\n:-\nWe became colleagues at the University of Chicago during the\nStone\nperiod. Under\nStone\n's leadership Chicago became an active mathematical centre with excellent students. We had constant contact and took long walks along the south coast of Lake Michigan when it was still safe.\nFrom\n1958\nhe worked at the Institute for Advanced Study at Princeton University. He retired in\n1976\n, becoming Professor Emeritus at that time.\nWeil's research was in number theory,\nalgebraic geometry\nand group theory. His work is summarised in\n[\n55\n]\n:-\nBeginning in the\n1940\ns, Weil started the rapid advance of algebraic geometry and number theory by laying the foundations for abstract algebraic geometry and the modern theory of abelian varieties. His work on algebraic curves has influenced a wide variety of areas, including some outside mathematics, such as elementary particle physics and string theory.\nIn fact Weil's work in this area was basic to work by mathematicians such as\nShing-Tung Yau\nwho was awarded a\nFields\nMedal in\n1982\nfor work in three dimensional algebraic geometry which has major applications to quantum field theory.\nYau\nis not the only mathematician who received a\nFields Medal\nfor work which continued that begun by Weil. In\n1978\nPierre Deligne\nwas awarded a\nFields\nMedal for solving the Weil Conjectures. Again we quote\n[\n55\n]\nfor a description of Weil's fundamental contribution:-\nOne of Weil's major achievements was his proof of the\nRiemann\nhypothesis for the congruence zeta functions of algebraic function fields. In\n1949\nhe raised certain conjectures about the congruence\nzeta function\nof algebraic varieties over finite fields. These Weil conjectures, as they came to be called, grew out of his deep insight into the topology of algebraic varieties and provided guiding principles for subsequent developments in the field.\nWeil's work on bringing together number theory and algebraic geometry was highly fruitful. The foundations of many topics studied in depth today were laid by Weil in this work, such as the foundations of the theory of modular forms, automorphic functions and automorphic representations. However, Weil's work was of major importance in a number of other new mathematical topics. He contributed substantially to topology,\ndifferential geometry\nand complex analytic geometry. It was not just to these areas that he contributed but, even more importantly, his work brought out fundamental relationships between the areas when he studied harmonic analysis on topological groups and characteristic classes. Also bringing these areas together was his work on the geometric theory of the theta function and\nKähler\ngeometry.\nTogether with\nDieudonné\nand others, Weil wrote under the name\nNicolas Bourbaki\n, a project they began in the\n1930\ns, in which they attempted to give a unified description of mathematics. The purpose was to reverse a trend which they disliked, namely that of a lack of rigour in mathematics. The influence of\nBourbaki\nhas been great over many years but it is now less important since it has basically succeeded in its aim of promoting rigour and abstraction.\nWeil made a major contribution through his books that include\nArithmétique et géométrie sur les variétés algébriques\nⓉ\n(\nArithmetic and geometry of algebraic varieties\n)\n(1935)\n,\nSur les espaces à structure uniforme et sur la topologie générale\nⓉ\n(\nOn spaces of uniform structure and general topology\n)\n(1937)\n,\nL'intégration dans les groupes topologiques et ses applications\nⓉ\n(\nIntegration in topological groups and their applications\n)\n(1940)\n,\nFoundations of Algebraic Geometry\n(1946)\n,\nSur les courbes algébriques et les variétés qui s'en déduisent\nⓉ\n(\nOn algebraic curves and varieties which are deduced from them\n)\n(1948)\n,\nVariétés abéliennes et courbes algébriques\nⓉ\n(\nAbelian varieties and algebraic curves\n)\n(1948)\n,\nIntroduction à l'étude des variétés kählériennes\nⓉ\n(\nIntroduction to the study of Kähler varieties\n)\n(1958)\n,\nDiscontinuous subgroups of classical groups\n(1958)\n,\nAdeles and algebraic groups\n(1961)\n,\nBasic number theory\n(1967)\n,\nDirichlet Series and Automorphic Forms\n(1971)\n,\nEssais historiques sur la théorie des nombres\nⓉ\n(\nHistorical essays on the theory of numbers\n)\n(1975)\n,\nElliptic Functions According to Eisenstein and Kronecker\n(1976)\n,\n(\nwith Maxwell Rosenlicht\n)\nNumber Theory for Beginners\n(1979)\n,\nAdeles and Algebraic Groups\n(1982)\n,\nNumber Theory: An Approach Through History From Hammurapi to Legendre\n(1984)\n, and\nCorrespondance entre Henri Cartan et André Weil\nⓉ\n(\nCorrespondance between Henri Cartan and André Weil\n)\n(1928\n-\n1991)\n(2011)\n.\nYou can see the preface to Weil's\nAlgebraic Geometry\nat\nTHIS LINK\n.\nFor extracts from reviews of some of these books see\nTHIS LINK\n.\nFor some extracts from two of Weil's books on the history of mathematics see\nTHIS LINK\n.\nFor some extracts from Weil's thoughts on the teaching of mathematics and the future of mathematics see\nTHIS LINK\n.\nWeil received many honours for his outstanding mathematics. Among these has been honorary membership of the\nLondon Mathematical Society\nin\n1959\nand election to a Fellowship of the\nRoyal Society of London\nin\n1966\n. In addition he has been elected to the\nAcademy of Sciences\nin Paris and to the\nNational Academy of Sciences\nin the United States. He refused to accept honorary doctorates which explains why there are none for us to list.\nWeil was an invited speaker at the International Congress of Mathematicians in\n1950\nat Harvard when he gave an address on\nNumber Theory and Algebraic Geometry\nand again at the following International Congress in\n1954\nin Amsterdam when he gave the lecture\nAbstract versus Classical Algebraic Geometry\n. In\n1979\nWeil was awarded the Wolf Prize and, in the following year, the\nAmerican Mathematical Society\nawarded him their Steele Prize. In\n1994\nhe received the Kyoto Prize from the Inamori Foundation of Japan:-\n... for outstanding achievement and creativity.\nThe citation for the Kyoto Prize reads:-\nThe results achieved and problems raised by André Weil through his deep understanding of and sharp insight into mathematical sciences in general will continue to have immeasurable influence on the development of mathematical sciences, and to contribute greatly to the development of science, as well as the deepening and uplifting of the human spirit.\nHe is described by\nGoro Shimura\nas follows in\n[\n49\n]\n:-\nIn my mind, however, he will remain chiefly as the figure with two mutually related characteristics: First, he was flexible and receptive to new ideas of others and new directions, quite unlike many of the younger people these days who can work only within a well-established framework. Second, more importantly and in a similar vein, he had a deep and penetrating understanding of mathematics, or, rather, he strived tirelessly to understand the real meaning of every basic mathematical phenomenon and to present it in a clearer form and in a better perspective. He did so by endowing each subject with new concepts and setting up new frameworks, always in a fresh and fundamental way. In other words, he was not a mere problem solver.\nKomaravolu Chandrasekharan writes in\n[\n14\n]\n:-\nHe was known for his short temper and for his sudden, provocative interventions, which sometimes resulted in abrasive confrontations. That was the less endearing side of his personality. It is in his writings that his personality really shows through - as a master of style, with deep reserves of reading, reflection, and self-scrutiny, with a hotline to the creative imagination.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Number Theory",
    "Topology"
  ]
}