{
  "nome_completo": "Andrew John Wiles",
  "nome_curto": "Andrew Wiles",
  "ano_nascimento": "1953",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Wiles/",
  "lugar_nascimento": "Cambridge, England",
  "lugar_morte": null,
  "biografia": "Andrew Wiles\n' father, Maurice Frank Wiles\n(1923\n-\n2005)\n, studied moral sciences and theology at the University of Cambridge, then trained for ordination at Ridley Hall, Cambridge. After two years as a curate in Stockport, he became the chaplain at Ridley Hall, Cambridge, from\n1950\nto\n1955\n. Andrew's mother was Patricia Margaret Mowll\n(1927\n-\n2005\n, known as Paddy\n)\n. She married Maurice Wiles in\n1950\n, at Cuckfield, Sussex, England. Maurice and Patricia Wiles had three children: Patrick David Wiles\n(\nborn\n2\nMay\n1951)\n; Andrew John Wiles, the subject of this biography; and Alison Ruth Wiles\n(\nborn\n3\nAugust\n1955)\n.\nIn\n1955\n, when Andrew was two years old, his father was appointed as a lecturer in New Testament Studies at Ibadan, Nigeria. It was in Nigeria that Andrew began his schooling but, like many children, he was at first reluctant to attend school. In\n1959\nMaurice Wiles returned to Cambridge, to become dean of Clare College. The family sailed from Lagos to London, on the\nWinneba\n, arriving in England on\n3\nJuly\n1959\n. At the start of the\n1959\n-\n60\nschool year, Andrew began his studies at King's College School, Cambridge, a preparatory school founded by King Henry VI in\n1441\n. At this school he was taught mathematics by Mary Briggs, the wife of the headmaster David Briggs.\nWiles' interest in\nFermat's Last Theorem\nbegan while he was studying at King's College School. He said\n[\n53\n]\n:-\nI happened to be looking in my local public library, and I found a book on maths and it told a bit about the history of this problem, that someone had resolved this problem\n300\nyears ago, but no one had ever seen the proof. No one knew if there was a proof. And people ever since had looked for the proof. And here was a problem that I, a ten-year-old, could understand, that none of the great mathematicians in the past had been able to resolve. And from that moment, of course, I just tried to solve it myself. It was such a challenge, such a beautiful problem. This problem was\nFermat\n's last theorem.\nThe book that Wiles was looking at was\nThe Last Problem\nby\nEric Temple Bell\n. This book, about\nFermat\n's Last Theorem, was published in\n1961\nin the year following\nBell\n's death. After finding this book, Andrew looked for other books on number theory and began to study other topics which had interested\nFermat\nlike solving congruences.\nIn\n1966\n, when he was twelve years old, Andrew began his studies at The Leys School in Cambridge. This private school, originally founded as a Methodist school in\n1875\n, had many sons of University of Cambridge staff as pupils. Andrew was a member of North A House, located on the upper quad, opposite the chapel. At this school he was taught mathematics by a teacher with a Ph.D. in number theory who gave him a copy of\nHardy\nand\nWright\n's\nAn Introduction to the Theory of Numbers\n. He also found\nDavenport\n's\nThe Higher Arithmetic\nand these two books inspired him to study number theory.\nIn\n1971\n, Wiles entered Merton College, Oxford, and, although he was happy to take courses on geometry, logic and applied mathematics, he felt these were distracting him from the things he really wanted to study in depth, namely algebra and number theory. Although his teachers allowed him to take additional number theory courses, he would have liked to have been able to learn more on that topic than Oxford could offer. His attempts to read\nFermat\nin the original Latin were not really successful since\nFermat\nwrote with hardly any symbols and he found it hard to understand. He graduated from the University of Oxford with a B.A. in\n1974\nand then entered Clare College, Cambridge to study for his doctorate. He had a preliminary year before starting research\n[\n61\n]\n:-\nI had a year, a preliminary year, in which I just studied a range of subjects and then I could do a special paper.\nJohn Coates\nwas not yet at Cambridge, but I think he helped me, maybe over the summer. Anyway, that summer I met him and started working with him right away, and that was just wonderful. The transition from undergraduate work, where you were just reading and studying, to research - that was the real break for me. It was just wonderful.\nHis Ph.D. supervisor,\nJohn Coates\n, had arrived in Cambridge in the summer of\n1975\nand began to supervise Wiles' research.\nCoates\nsaid\n[\n52\n]\n:-\nI have been very fortunate to have had Andrew as a student. Even as a research student he was a wonderful person to work with, he had very deep ideas then and it was always clear he was a mathematician who would do great things.\nWiles did not work on\nFermat\n's Last Theorem for his doctorate. He said:-\n... the problem with working on\nFermat\nis that you could spend years getting nothing so when I went to Cambridge my advisor\nJohn Coates\nwas working on\nIwasawa\ntheory of elliptic curves and I started working with him ...\nFrom\n1977\nuntil\n1980\nWiles was a Junior Research fellow at Clare College, Cambridge and also a\nBenjamin Peirce\nAssistant Professor at Harvard University in Cambridge, Massachusetts, USA. At Harvard he worked with\nBarry Mazur\non modular forms. Their collaboration led to the jointly authored paper\nClass fields of abelian extensions of\nQ\n\\mathbb{Q}\nQ\n(1984)\nin which they proved the Main Conjecture of\nIwasawa\ntheory for real abelian extensions of\nQ\n\\mathbb{Q}\nQ\nand odd primes\np\np\np\n. In\n1980\nWiles was awarded his doctorate for his thesis\nReciprocity laws and the conjecture of Birch and Swinnerton-Dyer\nin which he proved certain special cases of the Birch and Swinnerton-Dyer conjecture.\nHe then spent a while as a Visiting Professor at the Sonderforschungsbereich Theoretische Mathematik in Bonn, taking up the appointment in the spring of\n1981\n. He returned to the United States in the autumn of\n1981\nto take up a position at the Institute for Advanced Study in Princeton. He was appointed a professor at Princeton the following year and, also during\n1982\n, he spent the spring as a visiting professor in the University of Paris, Orsay, France.\nWiles was awarded a Guggenheim Fellowship which enabled him to visit the Institut des Hautes Études Scientifiques in Paris and also the École Normale Supérieure in Paris during\n1985\n-\n86\n. In\n[\n24\n]\nthe important events which changed the direction of Wiles's research after this period are described:-\n... about ten years ago, G Frey suggested and K Ribet proved\n(\nbuilding on ideas of\nB Mazur\nand\nJ-P Serre\n)\nthat\nFermat\n's Last Theorem follows from the\nShimura\n-\nTaniyama\nconjecture that every elliptic curve defined over the rational numbers is modular. Precisely, if\na\nn\n+\nb\nn\n=\nc\nn\na^{n} + b^{n} = c^{n}\na\nn\n+\nb\nn\n=\nc\nn\nis a counterexample to Fermat's Last Theorem, then the elliptic curve\ny\n2\n=\nx\n(\nx\n−\na\nn\n)\n(\nx\n+\nb\nn\n)\ny^{2} = x(x - a^{n})(x + b^{n})\ny\n2\n=\nx\n(\nx\n−\na\nn\n)\n(\nx\n+\nb\nn\n)\ncannot be modular, thus violating the\nShimura\n-\nTaniyama\nconjecture. This result set the stage for Wiles's work.\nWiles said\n[\n52\n]\n:-\nI was at a friend's house sipping iced tea early in the evening, and he just mentioned casually in the middle of a conversation, \"By the way, did you hear that Ken Ribet has proved the epsilon conjecture?\" And I was just electrified. I knew that moment the course of my life was changing, because this meant that to prove\nFermat\n's Last Theorem, I just had to prove the\nTaniyama\n-\nShimura\nconjecture. From that moment, that was what I was working on. I just knew I would go home and work on the\nTaniyama\n-\nShimura\nconjecture.\nIn fact Wiles abandoned all his other research when he heard what had been proved and, for seven years, he concentrated solely on attempting to prove the\nShimura\n-\nTaniyama\nconjecture, knowing that a proof of\nFermat\n's Last Theorem then followed. Wiles said:-\n... after a few years I realised that talking to people casually about\nFermat\nwas impossible because it generated too much interest and you cannot focus yourself for years unless you have this kind of undivided concentration which too many spectators would destroy ...\nAndrew Wiles married Nada Canaan in\n1988\n. She was a student at Princeton University, obtaining her first degree in\n1983\nand, in the summer of\n1988\n, she was awarded a Ph.D. in molecular biology from Princeton. Andrew and Nada Wiles have there daughters: Clare, born in August\n1990\n; Kate, born in November\n1991\n; and Olivia, born May\n1994\n.\nIn fact married life was a rather restricted affair for Wiles who said:-\n... my wife has only known me while I have been working on\nFermat\n. I told her a few days after I got married. I decided that I really only had time for my problem and my family and while I was concentrating very hard then I found with young children that it was the best possible way to relax. When you're talking to young children they're simply not interested in\nFermat\n...\nIn\n1988\nWiles went to Oxford University where he spent two years as a\nRoyal Society\nResearch Professor. While in Oxford he was elected, in\n1989\n, a Fellow of the\nRoyal Society\n. In\n[\n24\n]\nthe course of his research is described:-\nUsing\nMazur\n's deformation theory of\nGalois\nrepresentations, recent results on\nSerre\n's conjecture on the modularity of\nGalois\nrepresentations, and deep arithmetical properties of\nHecke\nalgebras, Wiles\n(\nwith one key step due jointly to Wiles and Richard Taylor\n)\nsucceeded in proving that all semistable elliptic curves defined over the rational numbers are modular. Although less than the full\nShimura\n-\nTaniyama\nconjecture, this result does imply that the elliptic curve given above is modular, thereby proving\nFermat\n's Last Theorem.\nIn fact the path to the proof was not as smooth as suggested by this description. In\n1993\nWiles told two other mathematicians that he was close to a proof of\nFermat\n's Last Theorem. He filled what he thought were the remaining few gaps and gave a series of lectures at the\nIsaac Newton\nInstitute in Cambridge ending on\n23\nJune\n1993\n. At the end of the final lecture he announced he had a proof of\nFermat\n's Last Theorem. When the results were written up for publication, however, a subtle error was discovered. Wiles said:-\n... the first seven years I had worked on this problem I loved every minute of it however hard it had been. There had been setbacks, things which had seemed insurmountable but it was a kind of private and very personal battle I was engaged in and then after there was a problem with it, doing mathematics in that kind of rather overexposed way is certainly not my style, I certainly have no wish to repeat it ...\nWiles worked hard for about a year, helped in particular by Richard Taylor whom we referred to above, and by\n19\nSeptember\n1994\n, having almost given up, he decided to have one last try:-\n... suddenly, totally unexpectedly, I had this incredible revelation. It was the most important moment of my working life. Nothing I ever do again ... it was so indescribably beautiful, it was so simple and so elegant, and I just stared in disbelief for twenty minutes, then during the day I walked round the department. I'd keep coming back to my desk to see it was still there - it was still there.\nIn\n1994\nWiles was appointed Eugene Higgins Professor of Mathematics at Princeton. His paper which proves\nFermat\n's Last Theorem is\nModular elliptic curves and Fermat's Last Theorem\nwhich appeared in the\nAnnals of Mathematics\nin\n1995\n. From\n1995\nWiles began to receive many honours for this outstanding piece of work. He was awarded the Schock Prize in Mathematics from the\nRoyal Swedish Academy of Sciences\nand the Prix\nFermat\nfrom the Université Paul Sabatier. In\n1996\nhe received further awards including the Wolf Prize which he shared with\nRobert Langlands\n. The citation for his award states it is given to Wiles\n[\n89\n]\n:-\n... for spectacular contributions to number theory and related fields, major advances on fundamental conjectures, and for settling\nFermat\n's last theorem.\nAlso in\n1996\n, he was elected as a foreign member to the\nNational Academy of Sciences of the United States\n, receiving its mathematics prize.\nWiles spoke about how much\nFermat\n's Last Theorem meant to him:-\n... there's no other problem that will mean the same to me. I had this very rare privilege of being able to pursue in my adult life what had been my childhood dream. I know its a rare privilege but I know if one can do this it's more rewarding than anything one can imagine.\nIn\n[\n24\n]\nhis worked is summed up:-\nWiles's work is highly original, a technical tour de force, and a monument to individual perseverance.\nIn addition to the prizes and awards mentioned above, Wiles has continued to receive many honours for his outstanding work. In\n1998\n, not being eligible for the award of a\nFields\nmedal on the grounds that he was over forty years of age, the\nInternational Mathematical Union\npresented him with a silver plaque at the International Congress of Mathematicians held that year in Berlin. He gave an evening lecture at the Congress which attracted an audience of over\n2300\n. In the same year of\n1998\nhe was awarded the King Faisal Prize. He\n[\n44\n]\n:-\n... received the prize at a special ceremony in Riyadh, Saudi Arabia, on January\n6\n,\n1998\n. The prize consists of a $\n200\n,\n000\ncash award and a commemorative gold medal. The prize citation noted that Wiles's contribution not only was a major addition to mathematical knowledge but also has had a positive influence on public perceptions of mathematics.\nIn the following year, he received the Clay Research Award from the Clay Mathematics Institute on\n10\nMay\n1999\nin Cambridge, Massachusetts\n[\n17\n]\n:-\n......  for his role in the development of number theory.\nIn the same year he was honoured by having \"asteroid\n9999\nWiles\" named after him.\nIn\n2000\n, Andrew Wiles became \"Sir Andrew Wiles\" when he was made a Knight Commander of the Order of the British Empire by the Queen. He received the\nPythagoras\nAward in Crotone, Italy, in\n2004\nand, in the following year, Wiles received the Shaw Prize. Sir Run Run Shaw, a leader of the Hong Kong media industry, established this Prize in\n2002\n. The first award was made in\n2004\nto:-\n... individuals, regardless of race, nationality and religious belief, who have achieved significant breakthrough in academic and scientific research or application, and whose work has resulted in a positive and profound impact on mankind.\nThe\n2005\nShaw Prize for Mathematical Sciences was made to Wiles:-\n... for his proof of\nFermat\n's last theorem.\nWiles was at Princeton University between\n1982\nand\n2010\n, except for short periods of leave. In\n2010\nhe returned to England when appointed as a\nRoyal Society\nResearch Professor in Oxford. The University of Oxford formally opened the new Andrew Wiles Building on\n3\nOctober\n2013\n[\n88\n]\n:-\nThe building brought together the department's members from three buildings and, as importantly, is a venue where we can welcome our collaborators, our friends and the researchers of the future to share the beauty and power of mathematics.\nYou can read the history behind this building at\n[\n87\n]\n.\nThe\nAbel\nPrize is recognised as the highest possible award to a mathematician. It was presented to Andrew Wiles in\n2016\n[\n10\n]\n:-\n... for his stunning proof of\nFermat\n's Last Theorem by way of the modularity conjecture for semistable elliptic curves, opening a new era in number theory.\nThe full citation ended by emphasising how the ideas introduced by Wiles in solving\nFermat\n's Last Theorem have led to further advances\n[\n10\n]\n:-\nThe new ideas introduced by Wiles were crucial to many subsequent developments, including the proof in\n2001\nof the general case of the modularity conjecture by Christophe Breuil, Brian Conrad, Fred Diamond, and Richard Taylor. As recently as\n2015\n, Nuno Freitas, Bao V Le Hung, and Samir Siksek proved the analogous modularity statement over real quadratic number fields. Few results have as rich a mathematical history and as dramatic a proof as\nFermat\n's Last Theorem.\nIn\n2017\nWiles was awarded the\nRoyal Society\n's Copley Medal, the world's oldest scientific prize. Previous winners of this award include\nCarl Friedrich Gauss\n, Charles Darwin, Humphrey Davy and\nAlbert Einstein\n. Venki Ramakrishnan, President of the\nRoyal Society\n, presented the award saying\n[\n55\n]\n:-\nSir Andrew is a well-deserved recipient of the Copley Medal, the\nRoyal Society\n's most prestigious prize. In proving\nFermat\n's Last Theorem - a problem that had remained unsolved for hundreds of years - he not only made a major mathematical breakthrough, but also captured the imagination of the public. This is an inspirational story of a highly creative intellectual pursuit and the satisfaction of solving a deep fundamental problem in mathematics. He is a hero to an entire generation of mathematicians. The\nRoyal Society\nis delighted to recognise this achievement.\nIn May\n2018\nWiles was appointed by Her Majesty the Queen to be Oxford's first Regius Professor of Mathematics. Martin Bridson, Head of Oxford's Mathematical Institute, said\n[\n69\n]\n:-\nIt is entirely fitting that the first holder of this Professorship should be Sir Andrew Wiles. Nobody exemplifies the relentless pursuit of mathematical understanding in the service of mankind better than him. His dedication to solving problems that have defied mankind for centuries, and the stunning beauty of his solutions to these problems, provide a beacon to inspire and sustain everyone who wrestles with the fundamental challenges of mathematics and the world around us. We are immensely proud to have Andrew as a colleague at the Mathematical Institute in Oxford.\nOn Friday\n13\nJuly\n2018\n, Wiles was awarded the degree of Doctor of Science honoris causa by the University of Bristol. Jon Keating, presenting him for the honorary degree, said\n[\n45\n]\n:-\nAndrew's story exemplifies the academic values we all aspire to: intellectual courage and ambition, passion, intense hard work, relentless determination, and a focus on the most profound ideas and problems. His quest truly deserves to be called heroic, it is a testament to the human spirit. In honouring him today, we celebrate his achievements and those values.\nIn\n2019\nWiles was awarded the\nLondon Mathematical Society\n's\nDe Morgan\nMedal. The citation reads\n[\n85\n]\n:-\nA\nDe Morgan\nMedal is awarded to Professor Sir Andrew Wiles FRS of the University of Oxford for his seminal contributions to number theory and for his resolution of '\nFermat\n's Last Theorem' in particular, as well as for his numerous activities promoting mathematics in general.\nWiles did his PhD with\nJohn Coates\nand immediately attracted attention through their joint work on the conjecture of Birch and Swinnerton-Dyer. This was followed by a proof of the 'Main Conjecture' of\nIwasawa\nTheory for cyclotomic fields, in collaboration with\nMazur\n.\nHowever it is his work on the\nShimura\n-\nTaniyama\n-\nWeil\nconjecture, with its consequences for\nFermat\n's Theorem, for which he will be forever known. The\nShimura\n-\nTaniyama\n-\nWeil\nconjecture is a first step in the\nLanglands\nProgram, a grand vision which seeks to unify and explain a vast panorama of individual arithmetic phenomena, of which only the smallest individual cases are currently understood. In Wiles' work a technique was developed to resolve the semistable case of the\nShimura\n-\nTaniyama\n-\nWeil\nconjecture. This case was enough to handle\nFermat\n's Last Theorem, but within mathematics the opening into the\nShimura\n-\nTaniyama\n-\nWeil\nconjecture was even more important. Later workers developed Wiles' methods to establish the conjecture in full, but investigations into further extensions of these ideas within the\nLanglands\nprogramme are still a major industry within the subject.\nThe publicity associated with his resolution of\nFermat\n's Last Theorem has put Wiles in a unique position to communicate the excitement of mathematics to students of all ages, and to society in general. He has given a large number of public talks, which are invariably 'sold out', and has reached an enormous audience across the globe.\nOn\n23\nJune\n2023\nthe\nIsaac Newton\nInstitute for Mathematical Sciences in Cambridge, England, celebrated\n30\nyears since Andrew Wiles announced his first proof of\nFermat\n's Last Theorem. They produced a video interview, a podcast documentary and a written article\n[\n86\n]\n:-\n... all aimed at delving deeper into why this proof of a more than\n350\n-year-old problem had, and continues to have, such a profound effect upon not just the field of number theory, but also on mathematics as a subject, and even on the public perception of the science.\nYou can see the video and article by following the link to\n[\n86\n]\n. The text ends as follows:-\nThat moment\n30\nyears ago was clearly a turning point in Wiles' career. He is one of the few mathematicians who is well-known outside of mathematics, and was recognised with a knighthood in\n2000\n. Within mathematics he has received a wealth of honours and awards, including the prestigious\nAbel\nPrize in\n2016\n. It's been such a pleasure to revisit this moment with all of these mathematicians, to hear the human story, as well as the mathematical one. Wiles told us, back in\n2016\n, about some of the personal qualities a mathematician has to have - they have to be creative, and they have to be able to enjoy being stuck. And perseverance again appeared as a key thread in the story when we spoke to him for this article. Our final question was whether he would have kept on working on\nFermat\n's Last Theorem  even if he hadn't found a solution back in the early\n90\ns. His answer was characteristic of his approach to mathematics: \"I am not a person who gives up on a problem.\"",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Logic",
    "Number Theory"
  ]
}