{
  "nome_completo": "Angelo Genocchi",
  "nome_curto": "Angelo Genocchi",
  "ano_nascimento": "1817",
  "ano_morte": "1889",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Genocchi/",
  "lugar_nascimento": "Piacenza, Habsburg Empire (now Italy)",
  "lugar_morte": "Turin, Italy",
  "biografia": "Angelo Genocchi\nattended school in Piacenza and then studied law at the University of Piacenza. Despite his course being law he always had mathematics as his favourite subject and he became very knowledgeable in mathematics despite taking a law course.\nAfter graduating he practised law for a number of years. However, as Kennedy explains in\n[\n1\n]\n, he was not ideally suited to the practice of law:-\nHe was not a good debater. He quickly lost patience, would shake and become bitingly bitter - but he quickly grew calm again.\nWhen he was offered the chair of law at Piacenza University, a post he had not applied for, he accepted. However, he was not entirely successful as a teacher either\n[\n1\n]\n:-\n...some of his students ... found him too cold and severe.\nGenocchi was, however, very active politically. Before the revolution of\n1848\n, he was already part of a group of liberals in Piacenza who wanted to remove its Austrian rulers. At signs of unrest in the region the Austrian government reinforced its garrisons in Lombardy, arrested opposition leaders in Milan and suppressed student demonstrations. By\n22\nMarch\n1848\nthe people had deposed their Austrian rulers from Piacenza. Within a few days the Austrian army lost nearly all of Lombardy. On\n23\nMarch Charles Albert of Sardinia-Piedmont declared war on Austria.\nAnnexing Parma and Modena, whose Austrian rulers had been driven out, the Piedmontese won a number of victories before suffering reverses. Genocchi and his liberal friends had formed a provisional government in Piacenza but before they could make political progress the Austrians attacked the region. The Piedmontese army was unable to withstand the Austrian counteroffensive. After a series of defeats, Charles Albert's army withdrew from Milan. On\n6\nAugust\n1848\nthey crossed the Ticino River, leaving the city and its local controllers to the mercy of the returning Austrians. Before the Austrians arrived in Piacenza Genocchi, greatly disappointed at the turn of events, and other liberals, left the city.\nGenocchi went to live in Turin, refusing requests from his friends to return to Piacenza saying he would not return until freedom returned. In Turin he began to take mathematics seriously attending lectures by\nPlana\nand others. After a while he began teaching but he had to be tricked into entering the competition for the Chair of Algebra and Complementary Geometry at Turin.\nFrom\n1859\nGenocchi held the Chair of Algebra and Complementary Geometry at Turin, then the following year he moved to the Chair of Higher Analysis. In\n1862\nhe moved chairs again, but remaining in Turin, to the Introduction to the Calculus and the following year to\nInfinitesimal\nCalculus. During the year\n1881\n-\n82\nPeano\nserved as his assistant.\nThe main research topics which Genocchi worked on were\nnumber theory\n, series and the integral calculus. He published\n176\narticles between\n1851\nand\n1886\n. Kennedy writes in\n[\n1\n]\n:-\nHe did not adopt the methods of\nRiemann\nand\nWeierstrass\n, but rather worked in the tradition of\nEuler\n,\nLagrange\n,\nGauss\nand\nCauchy\n. His major work was in number theory, of which he was the principal investigator in Italy.\nGenocchi's style as a teacher is also described in\n[\n1\n]\n:-\nThe qualities that stood out most in Genocchi as a teacher were learning and precision. ... He was scrupulously punctual and justly demanding of his students. ... His explanations were calm, with no repetitions, and he aimed at rigorously presenting the fundamental concepts and studying them so as to arrive at simple procedures and clear exposition.\nHowever, given his failing when he taught and practised law, one would not expect him to be the perfect teacher, indeed:-\nHis austere character, along with his thin and monotonous voice, did not warm the classroom or allow the students to feel at ease with him.\nIn\n1882\nGenocchi broke his kneecap and\nPeano\ntook over his teaching. The kneecap was broken while Genocchi was on his holidays in September\n1882\n. By this time his sight was poor and he fell over a post marking the edge of the road.\nIn\n1884\nDifferential Calculus and Fundamentals of Integral Calculus\nwas published under Genocchi's name. This book was based on Genocchi's lectures but was largely the work of\nPeano\n. In\n[\n2\n]\nPeano\nexplained how the publication arose:-\nHe was many times urged to publish his calculus course, but he never did. ... It was only in '\n83\nthat he agreed to let the firm of Fratelli Bocca publish his Leçons with my help, and this appeared in part the following year. He was ill at the time and wished to remain completely apart from the work. I used notes made by his students at his lessons, comparing them point by point with all the principal calculus texts, as well as with original memoirs... The result is that my publication does not exactly represent the professor's lessons.\nThe book was important and widely aclaimed despite some unease over whether\nPeano\nhad Genocchi's full agreement to publish the text with the additions he made.\nDespite making a partial recovery, during which time he resumed his teaching duties, soon Genocchi's health failed again and he slowly gave up all his activities.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}