{
  "nome_completo": "Anthemius of Tralles",
  "nome_curto": "Anthemius",
  "ano_nascimento": "474",
  "ano_morte": "534",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Anthemius/",
  "lugar_nascimento": "(possibly) Tralles (near Aydin in southwest Turkey)",
  "lugar_morte": null,
  "biografia": "Anthemius of Tralles\n's father was a doctor by the name of Stephanus. Anthemius came from a well educated family with two brothers who were doctors, one brother who was a lawyer and another who was described as a man of learning.\nAnthemius is known both as a mathematician and an architect. As an architect he is best known for replacing the old church of Hagia Sophia at Constantinople in\n532\n. His skills seem also to have extended to engineering for he is said to have been employed to repair flood defences at Daras.\nYou can see an article about Hagia Sophia at\nTHIS LINK\n.\nHe described the construction of an\nellipse\nwith a string fixed at the two foci. His famous book\nOn Burning Mirrors\nalso describes the focal properties of a\nparabola\n.\nHeath\n[\n2\n]\ngives one of his problems which leads to the ellipse construction:-\nTo contrive that a ray of the sun\n(\nadmitted through a small hole or window\n)\nshall fall in a given spot, without moving away at any hour and season.\nHeath\n[\n2\n]\ngives Anthemius's solution:-\nThis is contrived by constructing an elliptical mirror one\nfocus\nof which is at the point where the ray of the sun is admitted while the other is at the point to which the ray is required to be reflected at all times.\nAnthemius studied the focal properties of the parabola and proves that\n[\n2\n]\n:-\n... parallel rays can be reflected to one single point from a parabolic mirror of which the point is the focus. The directrix is used in the construction, which follows, mutatis mutandis, the same course as the above construction in the case of the ellipse.\nHe compiled a survey of remarkable mirror configurations in his work\nOn remarkable mechanical devices\nwhich was known to certain of the Arab mathematicians such as\nal-Haytham\n.\nThere are a number of stories told of Anthemius which may be totally fictitious but, as is often the case with such stories, they may give an indication of his character. Huxley writes\n[\n1\n]\n(\nsee also\n[\n3\n]\n)\n:-\nAnthemius persecuted a neighbour and rival Zenon by reflecting sunlight into his house. He also produced the impression of an earthquake in Zenon's house by the use of steam led under pressure through pipes connected to a boiler.",
  "math_areas": []
}