{
  "nome_completo": "Antoni Szczepan Zygmund",
  "nome_curto": "Antoni Zygmund",
  "ano_nascimento": "1900",
  "ano_morte": "1992",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Zygmund/",
  "lugar_nascimento": "Warsaw, Russian Empire (now Poland)",
  "lugar_morte": "Chicago, Illinois, USA",
  "biografia": "Antoni Zygmund\n's father was Wincenty Zygmund and his mother was Antonina Perowska; both were of peasant origin. He was born into a partitioned Poland, the third of the three partitions took place in\n1795\nand split Poland between Russia, Prussia and Austria. Antoni was the eldest of his parents' four children with three younger sisters Jadwiga, Felicja and Maria. He attended elementary school in Warsaw, completing this stage of his education in\n1912\n. He then entered the high school Seventh\nGymnasium\nat\n53\nZlota Street, Warsaw. After two years of secondary education World War I broke out in\n1914\nand Antoni, together with the rest of the Zygmund family, were evacuated to Poltava in  Ukraine. Antoni continued his education in Poltava then, in\n1918\n, he returned to Poland which had become an independent country for the first time in well over\n100\nyears. He attended the Kazimierz Kulwiee's Gymnasium for a year; it was a school specially set up to educate re-immigrants from Russia. In\n1919\nwas awarded his school certificate and entered University of Warsaw:-\nSince his boyhood Antoni Zygmund had been interested in astronomy and had a considerable knowledge in this field; at that time, however, such studies were not offered in Warsaw. He therefore decided to study mathematics.\nAt the University of Warsaw Zygmund was taught by, and very much influenced by,\nJaniszewski\n,\nMazurkiewicz\nand\nSierpiński\n. He attended lectures by\nSierpiński\non set theory,\nMazurkiewicz\non analytic functions,\nSamuel Dickstein\non algebra and history of mathematics, and Stefan Kwietniewski on projective geometry. Zygmund, however, was most influenced by Aleksander Rajchman and by\nStanisław Saks\nwho had been his school friend, although three years older than he was. Aleksander Rajchman was interested in the theory of trigonometric series. He held lectures and a seminar on the topic for a few selected students. This gave Zygmund a life-long interest in the trigonometric series.\nThere was a forced break in Zygmund's studies in\n1920\nwhen he was called up for the army. He did not see active service in Polish-Russian war, however, and was able to return to his studies. In\n1922\nhe was appointed\n(\nas was his friend\nSaks\n)\nto be an instructor in the Department of Mathematics at Warsaw Polytechnic School. Zygmund obtained his Ph.D. from the University of Warsaw in\n1923\nfor a dissertation on the Riemannian theory of trigonometric series written under Aleksander Rajchman's supervision. His formal supervisor, however, was\nMazurkiewicz\nsince Rajchman was too junior to officially undertake the supervision role.\nFrom\n1922\nto\n1929\nhe taught at the Polytechnic School of Warsaw, being promoted from junior to senior instructor after obtaining his doctorate. On\n12\nFebruary\n1925\nZygmund married Irena Parnowska. They met when she was a mathematics student and, after taking her degree, she became a mathematics teacher. In\n1926\nZygmund submitted his\nhabilitation\ndissertation to the University of Warsaw and began teaching there. He continued to hold his position at the Polytechnic School as well.\nHe spent the year\n1929\n-\n30\nin England supported by a Rockefeller fellowship. The first half of this year he spent at Oxford with\nHardy\n, then in the second half he studied at Cambridge with\nLittlewood\n. He became friend and collaborator with\nPaley\nat this time. In\n1930\nhe was appointed to the chair of mathematics at the University of Stefan Batory in Vilnius, Poland\n(\nlater Lithuania as we describe below\n)\n. There he met\nJozef Marcinkiewicz\nwho was a first year student. Despite the difference in status between the two, they collaborated until the outbreak of World War II. Irena Zygmund worked in Vilnius as a school teacher until the birth of their first son Jerzy in\n1935\n.\nIn going to Vilnius, Zygmund was going into a disputed city. The dispute centred on whether the city of Vilnius was part of Poland or of Lithuania. After a period under Polish control in\n1919\n-\n20\nthe Red Army took the city in\n1920\nand handed control to Lithuania. In\n1922\n, however, international agreement saw Vilnius become part of Poland, although Lithuania did not accept this decision and refused to arrange normal diplomatic relations with Poland. This was the situation when Zygmund was appointed to the chair of mathematics there. In\n1939\nZygmund was drafted into the Polish army as a reserve officer at the start of the Second World War. Poland was quickly defeated and all resistance by the Poles had ceased by\n6\nOctober\n1939\n. Zygmund returned to Vilnius but then, on\n10\nOctober\n1939\n, Vilnius was returned to Lithuania.\nIn\n1940\nZygmund escaped with his wife and son from German controlled territory to the United States. After a short time at the Massachusetts Institute of Technology he was appointed to Mount Holyoke College in\n1940\n. He later spoke of the peacefulness and security that Mount Holyoke had brought to his family after the distress of their war-time experiences. He remained on the staff there until\n1945\nalthough he spent the year\n1942\n-\n43\nat the University of Michigan. In\n1945\nhe was appointed to the University of Pennsylvania, then, at the invitation of\nStone\n, to the University of Chicago in\n1947\nwhere he remained until he retired in\n1980\n. In\n1948\nhe visited South America where he met\nCalderón\n. Zygmund brought\nCalderón\nback to Chicago, where he obtained his doctorate under Zygmund's supervision not too long after his arrival. Not only did Zygmund have the role of\nCalderón\n's teacher and advisor, but was also his mentor and became his main collaborator. We discuss briefly below the most important topic of their collaboration.\nZygmund worked in analysis, in particular in harmonic analysis. The main topics he studied are listed in\n[\n2\n]\n:-\nAntoni Zygmund was one of the greatest and most influential analysts of this century. Among other topics, he worked on summability of numerical series, summability of general orthogonal series, trigonometric integrals, sets of uniqueness, summability of\nFourier series\n, differentiability of functions, smooth functions, approximation theory, absolutely convergent\nFourier\nseries, multipliers and translation invariant operators, conjugate series and\nTaylor\nseries, lacunary trigonometric series, series of independent random variables, random trigonometric series, the\nLittlewood\n-\nPaley\n,\nLuzin\nand\nMarcinkiewicz\nfunctions, boundary values of analytic and harmonic functions, singular integrals,\npartial differential equations\nand interpolation operators.\nZygmund's early work, as one might expect, continued to develop ideas from his doctoral studies with Aleksander Rajchman. He studied topics such as\nRiemann\nsummability, differentiability properties of trigonometric series and sets of uniqueness. For example in\n1926\nhe published six papers in\nMathematische Zeitschrift\nin French:\nContribution à l'unicité du développement trigonométrique\nⓉ\n(\nContribution to the uniqueness of trigonometric development\n)\n;\nSur la théorie riemannienne des séries trigonométriques\nⓉ\n(\nOn the Riemann theory of trigonometric series\n)\n;\nSur la possibilité d'appliquer la méthode de Riemann aux séries trigonométriques sommables par le procédé de Poisson\nⓉ\n(\nOn the possibility of applying the method of Riemann to trigonometric series summable by the Poisson process\n)\n;\nSur les séries trigonométriques sommables par le procédé de Poisson\nⓉ\n(\nOn trigonometric series summable by the Poisson process\n)\n;\nSur un théorème de la théorie de la sommabilité\nⓉ\n(\nOn a theorem of the theory of summability\n)\nand\nUne remarque sur un théorème de M Kaczmarz\nⓉ\n(\nA note on a theorem M Kaczmarz\n)\n.\nAfter meeting\nPaley\nat Cambridge in\n1930\n-\n31\n, Zygmund wrote five joint papers with him, and both of them together with\nNorbert Wiener\nwrote\nNotes on random functions\n(1933)\n. But for the tragic death of\nPaley\nin\n1933\nit is certain that this collaboration would have led to numerous further papers of major importance. The joint Zygmund-\nPaley\nwork played an important role in Zygmund's book\nTrigonometric Series\n(1935)\n. It is a classic that, together with later editions, is still the definitive work on the subject. A reviewer of the first edition of the book wrote:-\nEach volume of the series\n[\nMonografie Mat.\n]\npublished so far represents an important event in the development of mathematical research, and the present volume in this respect is second to none of its predecessors. If one looks through the long list of books on\nFourier\nseries one cannot help feeling that even the bulkiest of them are far from giving an adequate picture of the present status of the field. The non-existence of a monograph giving such a picture was very badly felt not only by beginners but also by specialists, and the failure of so many attempts to write a real book on\nFourier\nseries created an impression that the task was almost hopeless. The author of the present monograph completely succeeded in dispelling this \"inferiority complex\" and produced a book which not only introduces the reader into the immense field the theory of\nFourier\nseries but at the same time almost imperceptibly brings him to the latest achievements, many of them being due author himself. The style of the book is rigorous and vigorous and the exposition elegant and clear to smallest details.\nA second edition appeared in\n1959\npublished by\nCambridge University Press\n. A reviewer wrote:-\nIn his course at the University of Cambridge,\nProfessor Littlewood\nused to call the first edition of Zygmund's book \"the Bible\". This second edition, coming almost twenty-five years after the first one, will undoubtedly deserve this name even more, not only because it takes into account the work done in the field during this period, but also because the author, profiting from new experience and constant reflection on his past work, has introduced many topics which had been aside in the first edition\nRemarkably a third edition appeared in\n2002\n. This edition contains a foreword by Robert A Fefferman in which he writes:-\nSurely, Antoni Zygmund's \"Trigonometric series\" has been, and continues to be, one of the most influential books in the history of mathematical analysis. Therefore, the current printing, which ensures the future availability of this work to the mathematical public is an event of major importance. Its tremendous longevity is a testimony to its depth and clarity. Generations of mathematicians from\nHardy\nand\nLittlewood\nto recent classes of graduate students specializing in analysis have viewed \"Trigonometric series\" with enormous admiration and have profited greatly from reading it. In light of the importance of Antoni Zygmund as a mathematician and of the impact of \"Trigonometric series\", it is only fitting that a brief discussion of his life and mathematics accompany the present volume, and this is what I have attempted to give here. I can only hope that it provides at least a small glimpse into the story of this masterpiece and of the man who produced it.\nAnother major work, this time written with his long standing friend\nSaks\n, was\nAnalytic functions\npublished in\n1938\n. An English edition appeared in\n1952\n.\nBoas\nwrote:-\nThe authors have drawn on both the \"geometric\" and \"arithmetic\" approaches to the subject, and cover considerably more material than is usual in an introductory text. One of the novel features is the early introduction of\nRunge\n's theorem and its application to facilitate the proof of\nCauchy\n's theorem and other results. Conformal mapping is discussed relatively late. The general part of the book is followed by three chapters, one on entire and\nmeromorphic functions\n, one on elliptic functions, and one on\nG\n(\ns\n)\n,\nZ\n(\ns\n)\nG(s), Z(s)\nG\n(\ns\n)\n,\nZ\n(\ns\n)\nand\nDirichlet\nseries.\nIn\n1950\n, not long after beginning his long association with the University of Chicago, Zygmund published\nTrigonometric Interpolation\n. He described these as follows:-\nThe purpose of these notes is to present those aspects of trigonometric interpolation which resemble the theory of\nFourier\nseries.\nZygmund created one of the strongest analysis schools of the\n20\nth\ncentury, making Chicago into a major analysis research centre\n(\nsee\n[\n6\n]\nfor details\n)\n. In\n1986\nhe received the National Medal for Science for building this research school. He supervised\nNathan Fine\nat the University of Pennsylvania an over\n40\ndoctoral students in his years at Chicago, including\nAlberto Calderón\nand\nPaul Cohen\nwho have biographies in this archive.\nWe mentioned earlier in this article Zygmund's collaboration with\nCalderón\n. The main topic of their collaboration was the theory of singular integrals. Their joint work began with\nCalderón\n's doctoral thesis which answered some questions related to boundary behaviour of harmonic functions which had been posed by Zygmund earlier. Their famous joint papers over the next few years on singular integrals and partial differential equations, the most significant of which appeared in\n1952\n, have had a major impact on modern analysis.\nTogether with Richard L Wheeden, Zygmund wrote\nMeasure and integral\n(1977)\n. A reviewer writes:-\nThis textbook has been conceived with the explicit intention of providing an easy and quick access to the most useful techniques of measure and integration in the modern analysis of real variables. This goal has been achieved with very remarkable success.\nZygmund received many honours for his outstanding achievements. He received honorary doctorates from Mount Holyoke College, Washington University, the University of Toruń, the University of Paris, and the University of Uppsala. He was elected to the\nPolish Academy of Sciences\n(\nPolska Akademia Nauk\n)\nin\n1959\n, seven years after the Academy was founded. In\n1961\nhe was elected to the\nNational Academy of Sciences\n(\nUnited States\n)\n, then in\n1964\nto the Argentina Academy of Sciences. Further academies elected him such as the\nSpanish Royal Academy of Sciences\n(\nthe Royal Academy of Exact, Physical and Natural Sciences of Madrid\n)\nand the\nAcademy of Palermo\nin\n1967\n. In the same year he was elected to the\nAmerican Academy of Arts and Sciences\nand\nLondon Mathematical Society\n. In\n1972\nhe was elected to the\nPolish Mathematical Society\n. He also received prizes and awards such as the Steele Prize by the\nAmerican Mathematical Society\n, the award of Alfred Jurzykowski Foundation in\n1972\n, and the National Medal of Science in\n1986\n. This Medal was presented to him by President Reagan at a White House Ceremony on\n12\nMarch\n1986\n:-\nFor outstanding contributions to\nFourier\nanalysis and its applications to partial differential equations and other branches of analysis, and for his creation and leadership of the strongest school of analytical research in the contemporary mathematical world.\nZygmund suffered many sad losses during his life. His doctoral student at Vilnius, Ela-Chaim Cunzer, was a victim of the Holocaust. His student and collaborator\nMarcinkiewicz\ndied in\n1940\n. Rajchman, Zygmund's doctoral supervisor, was executed by the Nazis.\nSaks\n, his friend from childhood and later his collaborator, was killed by the Gestapo. His young collaborator\nPaley\ntragically died in a mountaineering accident. Irena, his wife, died on\n6\nAugust\n1966\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Calculus",
    "Logic"
  ]
}