{
  "nome_completo": "Anton Kazimirovich Suschkevich",
  "nome_curto": "Anton Kazimirovich Suschkevich",
  "ano_nascimento": "1889",
  "ano_morte": "1961",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Suschkevich/",
  "lugar_nascimento": "Borisoglebsk, Russia",
  "lugar_morte": "Kharkov, Ukraine",
  "biografia": "First let us note that\nAnton Kazimirovich Suschkevich\n's family name is transliterated in several different ways. These include\nSushkevich\n,\nSuskevic\n, and\nSuschkewitsch\n, in addition to the form\nSuschkevich\nthat we shall use throughout this biography. His father, Kazimir Suschkevich, was a railway engineer. This seems to have been of sufficiently high status that the family were quite well-off and certainly able to afford a top quality education for their son. As he was growing up, Suschkevich had two passions, one being mathematics and the other being music. Of course, this was not unusual for many top mathematicians struggled to choose between mathematics and music in their youth. Those like Suschkevich who chose mathematics almost all continued their interest in music throughout their lives. At age seventeen, when he had completed his schooling in Russia, Suschkevich still wanted to keep both his interest in mathematics and his interest in music open. He went to Berlin in\n1906\nand there he studied mathematics at the University of Berlin while, at the same time, he studied the cello at the Stern Conservatory in that city. This famous music school had been founded by Julius Stern\n(1820\n-\n1883)\nin\n1850\nand when Suschkevich studied there it was located in the Berlin Philharmonic concert hall on Bernburger Strasse in Berlin-Kreuzberg. In fact he was highly proficient in two instruments, both the cello and the piano.\nAt the University of Berlin, Suschkevich had many talented teachers. He attended lectures by\nGeorg Frobenius\n,\nIssai Schur\nand\nHermann Schwarz\n. For example, he attended the two courses\nDifferential calculus\nand\nIntegral calculus\nby\nHermann Schwarz\n,\nNumber theory\nby\nFrobenius\n, and\nAlgebra\nby\nSchur\n. After two years studying at both the University and at the Stern Conservatory, he made the decision that he would concentrate on mathematics. He finished his studies at the Conservatory in\n1908\nbut continued studying at the University until\n1911\n. Examples of courses he attended at this stage in his career are:\nDeterminants\n, by\nFrobenius\nin the summer of\n1908\n;\nAlgebra I\nand\nAlgebra II\nby\nFrobenius\nin\n1908\n-\n09\n;\nOrdinary differential equations\n, by\nSchur\nin the summer of\n1909\n;\nChebyshev's Theorem\n, by\nFrobenius\nin November\n1909\n;\nBernoulli numbers\nby\nFrobenius\nin the summer of\n1910\n, and\nMatrices\n, by\nFrobenius\nin the winter of\n1910\n-\n11\n. He also studied applied mathematics courses by\nMax Planck\n:\nGeneral mechanics\n, in the winter\n1909\n-\n1910\n,\nMechanics of deformable bodies\n, in the summer of\n1910\n,\nTheory of electricity and magnetism\n, in the winter of\n1910\n-\n1911\n, and\nTheory of optics\n, in the summer of\n1911\n. We should note two things of particular importance to Suschkevich's future mathematical studies from this time in Berlin. One was the lectures by\nFrobenius\nwhose approach, putting groups in an abstract setting yet not seeing abstraction as an end in itself, had a large influence on Suschkevich.\nFrobenius\ntook this approach because he felt that it led to greater clarity and precision. The second thing to note from Suschkevich's time in Berlin is his meeting with\nEmmy Noether\n. After Suschkevich returned to Russia, he continued to correspond with\nEmmy Noether\nfor many years.\nAfter graduating from the University of Berlin in\n1911\n, Suschkevich returned to Russia. Of course he had experienced a top quality education in Berlin but at this time foreign qualifications were not recognised in Russia so Suschkevich had to take a Russian degree. He studied at St Petersburg University, graduating in\n1913\n. He had planned to return to Germany to study further but, in the summer of\n1914\n, international tensions grew considerably following the assassination of the Austrian Archduke Ferdinand by a Bosnian Serb. By the end of July Russia was mobilising its forces and by August\n1914\nRussia and Germany were at war, ending Suschkevich's hopes of returning to Germany. Instead he went to Kharkov\n(\nnow Kharkiv\n)\nin Ukraine where he began teaching in secondary schools. However, he had not given up on his aim of becoming a university professor and so, in parallel with his work as a mathematics teacher, he studied for his Master's Degree\n(\nequivalent to a Ph.D.\n)\n. He submitted his dissertation to Kharkov University in\n1917\nand was awarded the degree. However, the Russian Revolution made the following years extremely difficult. Ukraine declared itself an independent state in January\n1918\nbut an agreement between the Bolshevik government and Germany saw German troops occupy Ukraine. The Bolsheviks established Kharkov as the capital of the Ukrainian Socialist Soviet Republic in\n1919\nwhile Kiev was the capital for those trying to establish an independent Ukraine.  Suschkevich began teaching at Kharkov University in\n1918\nand, at the same time, he began working towards his doctorate\n(\ncomparable in level with the D.Sc. or\nhabilitation\n)\n. He writes in that dissertation\n[\n3\n]\n:-\nMy research in this subject started in\n1918\nand, consequently, took place in very difficult times, often interrupted for longer or shorter periods of time for reasons beyond my control.\nIn\n1921\nSuschkevich went to Voronezh, in western Russia, where he began teaching at the university. This city was the main town of the district in which his hometown of Borisoglebsk was situated\n(\nabout\n200\nkm away\n)\n. Voronezh University had been founded three years earlier by staff and students from the University of Tartu who had left following the German occupation of Estonia. Suschkevich submitted his\n80\n-page dissertation\nTheory of operations as the general theory of groups\n(\nRussian\n)\nto Voronezh University in\n1922\n. It was not examined until\n1926\nwhen it was approved by\nSergei Bernstein\nand\nOtto Yulyevich Schmidt\n. The dissertation contained a remarkable study of semigroups and other generalisations of groups which is described in detail in\n[\n3\n]\n. The Introduction reviews the axiomatic approach to group theory and generalisations up to\n1914\n. The outbreak of World War I in that year prevented him having access to any books and papers written after that date. He discusses the work of\nWilliam Burnside\n,\nLeonard E Dickson\n,\nWalther von Dyck\n,\nGeorg Frobenius\n,\nOtto Hölder\n,\nEdward Huntington\n,\nLeopold Kronecker\n,\nGeorge A Miller\n,\nEliakim H Moore\n,\nEugen Netto\n,\nJames Pierpont\n, J-A de Séguier\n(1862\n-\n1937)\n,\nHeinrich Weber\nand\nAlfred Young\n. The dissertation contains a wealth of results in the theory of semigroups and quasigroups. We refer the reader to\n[\n3\n]\nfor a detailed discussion of the contents but we give one example of the remarkable nature of these contributions. This is in Chapter\n6\nentitled 'Non-uniquely invertible groups' which is devoted to the study of semigroups. In this Chapter there is an excellent contribution to the major structure theorem for algebraic semigroup theory which today is known as the\nRees Theorem\n(\nnamed after\nDavid Rees\n)\nwhich classifies completely\n0\n-simple semigroups. The authors of\n[\n3\n]\nexplain that:-\n... the content of this dissertation\n[\nis\n]\nsurprisingly rich both in results and ideas. It is not an exaggeration to say that it was ahead of its time by\n30\n-\n40\nyears. It contains ideas and results in the theory of semigroups, the theory of quasigroups and the theory of groupoids which have been fully appreciated and developed only in the post war years. Many of these results were rediscovered and only rarely the authors of such results noticed that they had a predecessor - A K Suschkevich. Of course, the reason for it is that it rarely occurred to anyone that in the twenties and thirties, results so near to the spirit of the modern theory of semigroups could be published.\nWhile at Voronezh University, Suschkevich began publishing in a number of areas. For example he published\nOn a theorem of Weierstrass\n(\nRussian\n)\n(1923)\non analysis,\nOn methods of teaching mathematics in secondary school\n(\nRussian\n)\n(1926)\non mathematical education,\nÜber die Darstellung der eindeutig nicht umkehrbaren Gruppen mittelst der verallgemeinerten Substitutionen\n(1926)\nand\nSur quelques cas des groupes finis sans la loi de l'inversion univoque\n(1927)\non groups, and he produced the set of lithographed lecture notes\nTheory of definite integrals\n(\nRussian\n)\n(1929)\n. In\n1928\nhe published the\n20\n-page paper\nÜber die endlichen Gruppen ohne das Gesetz der eindeutigen Umkehrbarkeit\nin\nMathematische Annalen\n. Christopher Hollings writes\n[\n4\n]\n:-\nEarly on in their study, semigroups tended to be approached from one of two different directions: either by the dropping of selected axioms from a group, or by dropping an entire operation\n(\nnamely, addition\n)\nfrom a ring. Judging by the introduction to his\n1928\npaper, Suschkevich's approach seems to have been the latter: he states his goal as being the development of an abstract theory for certain types of finite semigroups which was analogous to that given by\nWedderburn\n(1907)\nfor linear algebras. However, his set-up was very much 'group-axiomatic' in spirit; he drew upon the notation of his erstwhile lecturer\nFrobenius\n(1895)\n. Suschkevich defined his objects of study to be finite 'groups' in which the elements do not necessarily have unique inverses: the 'endliche Gruppen ohne das Gesetz der eindeutigen Umkehrbarkeit' of his title. Suschkevich's own rendering into English of 'das Gesetz der eindeutigen Umkehrbarkeit' was 'the rule of uniform reversibility'. In modern terminology, this rule is simply cancellativity: if either ac = bc or ca = cb, then a = b.\nIn\n1929\nSuschkevich returned to Kharkov where he taught at the University as well as being appointed to the recently founded Ukrainian Mathematics and Mechanics Research Institute. In the same year he was appointed as a professor in the Kharkov Geodetic Institute. In\n1933\nhe was appointed to the chair of algebra and number theory at Kharkov University. Despite the brilliance of his contributions and the remarkable development of an area many years before others realised its importance, still Suschkevich made an unfortunate error. This was in a paper he published in\n1935\nwith the title\nOn the extension of a semigroup to a whole group\n(\nRussian\n)\n. In this paper he claimed to have proved that every cancellative semigroup can be embedded in a group.\nAleksandr Gennadievich Kurosh\nwrote a review of the paper in which he pointed out several gaps in the proof that Suschkevich presented. In a response, Suschkevich claimed that the gaps could be easily filled and included the \"theorem\" in his wonderful monograph\nTheory of generalised groups\n(\nRussian\n)\n(1937)\n.\nAnatoly Ivanovich Malcev\nseemed to have proved beyond doubt that Suschkevich's result was wrong when he produced an example of a cancellative semigroup which could not be embedded in a group. At first Suschkevich seemed reluctant to accept his mistake but eventually did so and removed any reference to his\n1935\npaper from his publication list.\nWe must not let this episode in any way diminish the credit that is due to Suschkevich. Other factors meant that\nTheory of generalised groups\n(\nRussian\n)\nfailed to have the impact on the development of semigroup theory that it might otherwise have done\n[\n4\n]\n:-\n... this book is not readily available today, as there are very few copies remaining; the majority of copies were held in Kharkov, a city which changed hands several times during the Second World War, and which suffered greatly as a consequence. The unavailability of his book certainly has not helped the dissemination of Suschkevich's work.\nSuschkevich's contributions to mathematics extend to many other significant works in a variety of different areas. His textbook\nFoundations of higher algebra\nwas published first in Russian in\n1923\n, then in Ukrainian in\n1931\n. Several later editions of the work in both Russian and Ukrainian appeared. Another textbook which ran to several editions in both Russian and Ukrainian was\nNumber theory\nfirst published in\n1932\n. He wrote several important works on the history of mathematics and also lectured on the topic. For example he produced copies of his lectures on the history of mathematics as\nShort Course of the History of Mathematics\n(\nRussian\n)\n(1939)\nand published the\n214\n-page paper\nMaterials for the history of algebra in Russia in the\n19\nth\ncentury and early\n20\nth\ncentury\n(\nRussian\n)\n(1951)\n. He was honoured for his contributions to the history of mathematics by the Soviet Association of Science Historians who awarded him their\nEuler\nMedal in\n1957\n. Let us mention a few of his later papers\n(\nall in Russian\n)\n:\nInvestigations on infinite substitutions\n(1940)\n;\nOn the construction of some types of groups of infinite matrices\n(1948)\n;\nOn a type of algebras of infinite matrices\n(1949)\n;\nOn an infinite algebra of triangular matrices\n(1950)\n; and\nAn algebra defined as an infinite direct sum of rings\n(1952)\n.\nThe authors of\n[\n2\n]\nnote that:-\nAnton Kazimirovich Suschkevich was an excellent lecturer who attracted many young people to this work in the field of algebra. His students work in many universities.\nIn the obituary\n[\n1\n]\nit is noted that:-\nDespite suffering a serious illness, Anton Kazimirovich did not stop his usual duties in the last months of his life, having students come to his house. Aware that he did not have long to live, he hurried to complete the new edition of his book on number theory to which he attached great importance. Anton Kazimirovich failed to finish the task, but his intentions were known to the disciples of the deceased and the work will be completed by them. The\nKharkov Mathematical Society\nmourns the death of leading member who has always been a sensitive friend, a great teacher and a great educator of youth.\nFinally, we note that Suschkevich was honoured at the '\n7\nth\nInternational Algebraic Conference in Ukraine' held in August\n2009\nin Kharkov which was \"dedicated to the\n120\nth\nanniversary of Professor Anton Kazimirovich Suschkevich\".",
  "math_areas": [
    "Algebra",
    "Applied Mathematics",
    "Calculus",
    "Logic",
    "Number Theory"
  ]
}