{
  "nome_completo": "Apollonius of Perga",
  "nome_curto": "Apollonius",
  "ano_nascimento": "262 BC",
  "ano_morte": "190 BC",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Apollonius/",
  "lugar_nascimento": "Perga, Pamphylia, Greek Ionia (now Murtina, Antalya, Turkey)",
  "lugar_morte": "Alexandria, Egypt",
  "biografia": "Apollonius of Perga\nwas known as 'The Great Geometer'. Little is known of his life but his works have had a very great influence on the development of mathematics, in particular his famous book\nConics\nintroduced terms which are familiar to us today such as\nparabola\n,\nellipse\nand\nhyperbola\n.\nApollonius of Perga should not be confused with other Greek scholars called Apollonius, for it was a common name. In\n[\n1\n]\ndetails of others with the name of Apollonius are given: Apollonius of Rhodes, born about\n295\nBC, a Greek poet and grammarian, a pupil of Callimachus who was a teacher of\nEratosthenes\n; Apollonius of Tralles,\n2\nnd\ncentury BC, a Greek sculptor; Apollonius the Athenian,\n1\nst\ncentury BC, a sculptor; Apollonius of Tyana,\n1\nst\ncentury AD, a member of the society founded by Pythagoras; Apollonius Dyscolus,\n2\nnd\ncentury AD, a Greek grammarian who was reputedly the founder of the systematic study of grammar; and Apollonius of Tyre who is a literary character.\nThe mathematician Apollonius was born in Perga, Pamphylia which today is known as Murtina, or Murtana and is now in Antalya, Turkey. Perga was a centre of culture at this time and it was the place of worship of Queen Artemis, a nature goddess. When he was a young man Apollonius went to Alexandria where he studied under the followers of\nEuclid\nand later he taught there. Apollonius visited Pergamum where a university and library similar to Alexandria had been built. Pergamum, today the town of Bergama in the province of Izmir in Turkey, was an ancient Greek city in Mysia. It was situated\n25\nkm from the Aegean Sea on a hill on the northern side of the wide valley of the Caicus River\n(\ncalled the Bakir river today\n)\n.\nWhile Apollonius was at Pergamum he met Eudemus of Pergamum\n(\nnot to be confused with\nEudemus\nof Rhodes who wrote the\nHistory of Geometry\n)\nand also Attalus, who many think must be King Attalus I of Pergamum. In the preface to the second edition of\nConics\nApollonius addressed Eudemus\n(\nsee\n[\n4\n]\nor\n[\n7\n]\n)\n:-\nIf you are in good health and things are in other respects as you wish, it is well; with me too things are moderately well. During the time I spent with you at Pergamum I observed your eagerness to become aquatinted with my work in conics.\nThe only other pieces of information about Apollonius's life is to be found in the prefaces of various books of\nConics\n. We learn that he had a son, also called Apollonius, and in fact his son took the second edition of book two of\nConics\nfrom Alexandria to Eudemus in Pergamum. We also learn from the preface to this book that Apollonius introduced the geometer Philonides to Eudemus while they were at Ephesus.\nWe are in a somewhat better state of knowledge concerning the books which Apollonius wrote.\nConics\nwas written in eight books but only the first four have survived in Greek. In Arabic, however, the first seven of the eight books of\nConics\nsurvive.\nFirst we should note that conic sections to Apollonius are by definition the curves formed when a plane intersects the surface of a cone. Apollonius explains in his preface how he came to write his famous work\nConics\n(\nsee\n[\n4\n]\nor\n[\n7\n]\n)\n:-\n... I undertook the investigation of this subject at the request of Naucrates the geometer, at the time when he came to Alexandria and stayed with me, and, when I had worked it out in eight books, I gave them to him at once, too hurriedly, because he was on the point of sailing; they had therefore not been thoroughly revised, indeed I had put down everything just as it occurred to me, postponing revision until the end.\nBooks\n1\nand\n2\nof the\nConics\nbegan to circulate in the form of their first draft, in fact there is some evidence that certain translations which have come down to us have come from these first drafts. Apollonius writes\n(\nsee\n[\n4\n]\nor\n[\n7\n]\n)\n:-\n... it happened that some persons also, among those who I have met, have got the first and second books before they were corrected....\nConics\nconsisted of\n8\nbooks. Books one to four form an elementary introduction to the basic properties of conics. Most of the results in these books were known to\nEuclid\n,\nAristaeus\nand others but some are, in Apollonius's own words:-\n... worked out more fully and generally than in the writings of others.\nIn book one the relations satisfied by the diameters and\ntangents\nof conics are studied while in book two Apollonius investigates how hyperbolas are related to their\nasymptotes\n, and he also studies how to draw tangents to given conics. There are, however, new results in these books in particular in book three. Apollonius writes of book three\n(\nsee\n[\n4\n]\nor\n[\n7\n]\n)\n:-\n... the most and prettiest of these theorems are new, and it was their discovery which made me aware that\nEuclid\ndid not work out the syntheses of the\nlocus\nwith respect to three and four lines, but only a chance portion of it, and that not successfully; for it was not possible for the said synthesis to be completed without the aid of the additional theorems discovered by me.\nBooks five to seven are highly original. In these Apollonius discusses\nnormals\nto conics and shows how many can be drawn from a point. He gives propositions determining the centre of curvature which lead immediately to the Cartesian equation of the\nevolute\n.\nHeath\nwrites that book five\n[\n7\n]\n:-\n... is the most remarkable of the extant Books. It deals with normals to conics regarded as maximum and minimum straight lines drawn from particular points to the curve. Included in it are a series of propositions which, though worked out by the purest geometrical methods, actually lead immediately to the determination of the evolute of each of the three conics; that is to say, the Cartesian equations of the evolutes can be easily deduced from the results obtained by Apollonius. There can be no doubt that the Book is almost wholly original, and it is a veritable geometrical tour de force.\nThe beauty of Apollonius's\nConics\ncan readily be seen by reading the propositions as given by\nHeath\n, see\n[\n4\n]\nor\n[\n7\n]\n. However,\nHeath\nexplains in\n[\n7\n]\nhow difficult the original text is to read:-\n... the treatise is a great classic which deserves to be more known than it is. What militates against its being read in its original form is the great extent of the exposition\n(\nit contains\n387\nseparate propositions\n)\n, due partly to the Greek habit of proving particular cases of a general proposition separately from the proposition itself, but more to the cumbersomeness of the enunciations of complicated propositions in general terms\n(\nwithout the help of letters to denote particular points\n)\nand to the elaborateness of the Euclidean form, to which Apollonius adheres throughout.\nPappus\ngives some indications of the contents of six other works by Apollonius. These are\nCutting of a ratio\n(\nin two books\n)\n,\nCutting an area\n(\nin two books\n)\n,\nOn determinate section\n(\nin two books\n)\n,\nTangencies\n(\nin two books\n)\n,\nPlane loci\n(\nin two books\n)\n, and\nOn verging constructions\n(\nin two books\n)\n.\nCutting of a ratio\nsurvives in Arabic and we are told by the\n10\nth\ncentury bibliographer Ibn al-Nadim that three other works were translated into Arabic but none of these survives.\nTo illustrate how far Apollonius had taken geometric constructions beyond that of\nEuclid\n's\nElements\nwe consider results which are known to have been contained in\nTangencies\n. In the\nElements\nBook III\nEuclid\nshows how to draw a circle through three given points. He also shows how to draw a tangent to three given lines. In\nTangencies\nApollonius shows how to construct the circle which is tangent to three given circles. More generally he shows how to construct the circle which is tangent to any three objects, where the objects are points or lines or circles.\nIn\n[\n14\n]\nHogendijk reports that two works of Apollonius, not previously thought to have been translated into Arabic, were in fact known to Muslim geometers of the\n10\nth\ncentury. These are the works\nPlane loci\nand\nOn verging constructions\n. In\n[\n14\n]\nsome results from these works which were not previously known to have been proved by Apollonius are described.\nFrom other sources there are references to still further books by Apollonius, none of which have survived.\nHypsicles\nrefers to a work by Apollonius comparing a\ndodecahedron\nand an\nicosahedron\ninscribed\nin the same sphere, which like\nConics\nappeared in two editions.\nMarinus\n, writing a commentary on\nEuclid\n's\nData\n, refers to a general work by Apollonius in which the foundations of mathematics such as the meaning of axioms and definitions are discussed. Apollonius also wrote a work on the cylindrical helix and another on\nirrational\nnumbers which is mentioned by\nProclus\n.\nEutocius\nrefers to a book\nQuick delivery\nby Apollonius in which he obtained an approximation for π better than the\n223\n71\n<\nπ\n<\n22\n7\n\\large\\frac{223}{71}\\normalsize  < \\pi < \\large\\frac{22}{7}\\normalsize\n7\n1\n2\n2\n3\n​\n<\nπ\n<\n7\n2\n2\n​\nknown to\nArchimedes\n. In\nOn the Burning Mirror\nApollonius showed that parallel rays of light are not brought to a focus by a spherical mirror\n(\nas had been previously thought\n)\nand discussed the focal properties of a parabolic mirror.\nApollonius was also an important founder of Greek mathematical astronomy, which used geometrical models to explain planetary theory.\nPtolemy\nin his book\nSyntaxis\nsays Apollonius introduced systems of\neccentric\nand\nepicyclic\nmotion to explain the apparent motion of the planets across the sky. This is not strictly true since the theory of epicycles certainly predates Apollonius. Nevertheless, Apollonius did make substantial contributions particularly using his great geometric skills. In particular, he made a study of the points where a planet appears stationary, namely the points where the forward motion changes to a retrograde motion or the converse.\nThere were also applications made by Apollonius, using his knowledge of conics, to practical problems. He developed the hemicyclium, a sundial which has the hour lines drawn on the surface of a conic section giving greater accuracy.",
  "math_areas": [
    "Analysis",
    "Geometry",
    "Logic"
  ]
}