{
  "nome_completo": "Arend Heyting",
  "nome_curto": "Arend Heyting",
  "ano_nascimento": "1898",
  "ano_morte": "1980",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Heyting/",
  "lugar_nascimento": "Amsterdam, Netherlands",
  "lugar_morte": "Lugano, Switzerland",
  "biografia": "Arend Heyting\n's father was Johannes Heyting and his mother was Clarissa Kok. Both Arend's parents were school teachers and Johannes Heyting was particularly successful in his profession being appointed as head of a secondary school. Arend spent his school years with the intention that he would make a career in engineering. Only near the end of his schooling did his love and ability in mathematics mean that the course of his career changed and he went to university to study mathematics.\nAlthough Heyting's father was a successful school teacher, the family were still in financial problems when Heyting began his studies in\n1916\nat the University of Amsterdam. Both Heyting and his father earned the extra money necessary to pay for his studies by taking on private tutoring work. At the University of Amsterdam Heyting was taught by\nBrouwer\nwho had a large influence on his future work. In\n1922\nHeyting graduated with a degree of master's standard.\nAt this point in his career Heyting began to follow the same road as his parents by beginning a career as a secondary school teacher. He taught in two schools in the town of Enschede. In the Overijssel province in eastern Netherlands, standing on the Twente Canal near the German border, this industrial town with its cotton-textile industry was not an ideal place for an academic to be living. Heyting was not well placed to make contact with colleagues in the universities, yet he spent all his free time working on his research.\nHe received his doctorate in\n1925\nfor a thesis written under\nBrouwer\n's supervision. His dissertation\nIntuitionistische axiomatieks der projektieve meetkunde\nⓉ\n(\nIntuitionistic axiomatics of projective geometry\n)\nwas the first study of axiomatisation in constructive mathematics. When the Dutch Mathematical Association announced a prize question in\n1927\nthey gave Heyting an ideal topic on which to compete. They asked for a formalisation of\nBrouwer\n's intuitionist theories and Heyting's outstanding essay was awarded the prize in\n1928\n. This essay was then polished and expanded by Heyting and published in\n1930\n. It made Heyting's name well known among those interested in the philosophy of mathematics.\nThis work had another beneficial effect as far as Heyting was concerned for it brought him to the attention of\nHeinrich Scholz\nwho held the chair of mathematical logic in Münster.\nScholz\nmade his extensive library available to Heyting, fortunate since Münster was relatively close to Enschede, and a lifelong friendship arose between the two. Heyting's academic isolation in Enschede no longer seemed the problem that it might have been.\nBy this time Heyting had married Johanne Friederieke Nijenhuis. The couple were married in\n1929\nand had eleven children. After\n31\nyears of marriage they divorced in\n1960\n.\nHeyting attended the Erkenntnis Symposium at Königsberg in September\n1930\n. There he represented\nintuitionism\nwhile Carnap and\nvon Neumann\nrepresented logicism and formalism respectively. Each argued their own case and against that of the other two. Although Heyting's version of intuitionist logic differed somewhat from that of\nBrouwer\n, it is clear that one of his main aims was to make\nBrouwer\n's ideas more accessible and better known.\nBrouwer\nhad presented his ideas in a deliberately non-formal, and very personal, way.\nThere were others interested in intuitionist logic working on similar problems of formalisation at the same time as Heyting. One was\nKolmogorov\nwho corresponded with Heyting. The article\n[\n7\n]\n(\n[\n8\n]\nis the English translation\n)\nreproduces three letters which\nKolmogorov\nsent to Heyting, the first in\n1931\nquestions the distinction between a proposition P and the statement \"P is provable\".\nIn\n1934\nHeyting published\nIntuitionism and Proof Theory\n[\n1\n]\n:-\n... a concise and well-written survey in which the viewpoints of intuitionism and formalism are clearly described and contrasted.\nHeyting was appointed as a\nPrivatdozent\nat the University of Amsterdam in\n1936\nand in the following year he was appointed as a lecturer. He spent the rest of his career at the University of Amsterdam, being promoted to professor in\n1948\n. He held this position for twenty years until he retired in\n1968\n.\nHeyting published a paper on intuitionistic algebra in\n1941\nand intuitionistic\nHilbert spaces\nin the\n1950\n's. These were ground-breaking works. Another major treatise which has presented intuitionism to both mathematicians and logicians was\nIntuitionism: an Introduction\n(1956\n, second edition\n1966)\n. Gilmore begins his excellent review of this book as follows:-\nThis is an introduction to intuitionistic mathematics for mature mathematicians. The reader is taken rapidly to the heart of several different branches of intuitionistic mathematics. The speed of development is achieved by condensing the proofs and by presuming familiarity with the classical counterparts to the theories discussed.\nThe book is written as a dialogue between Class\n(\na classical mathematician\n)\n, Form\n(\na formalist\n)\n, Int\n(\nan intuitionistic mathematician\n)\n, Letter\n(\na finitistic nominalist\n)\n, Prag\n(\na pragmatist\n)\n, and Sign\n(\na significist\n)\n. In the first chapter Int defends intuitionistic mathematics against the criticism of the others, asking them finally to judge for themselves. In the remaining chapters Int presents mathematics for them to judge. In these chapters Class, except for Int, is the most loquacious; he frequently compares classical results with corresponding intuitionistic results and his questions lead Int to a more detailed discussion of some points. The device of dialogue allows abbreviation of statements without loss of clarity.\nThe article\n[\n4\n]\nshows the major influence that Heyting has had on the study of the foundations of mathematics and in so doing shows the importance of Heyting's contributions. Franchella argues that Heyting has been the cause of two major changes of direction. Firstly, at least partly because of him, the topic has moved away from trying to answer the big problems such as \"what is mathematics?\". Heyting moved away from these big problems, concentrating on trying to identify formal, intuitive, and logical concepts in the study of mathematics. The second change which Franchella argues that Heyting brought about was a realisation that there exist degrees of evidence in mathematics. This is a particularly important aspect of mathematics today when computer programs are being used to verify mathematical proofs:-\nWhat was specific to intuitionism, however, was the thesis that mathematics is an activity, a process of becoming, the exhaustive description of which is impossible, just as it is impossible to define once and for all its elementary concepts.\nWe should end this biography by giving an indication of Heyting's personality. Troelstra writes in\n[\n1\n]\n:-\nHeyting was retiring and modest, lacking all ostentation. His interests were very wide-ranging and varied: music, literature, linguistics, philosophy, astronomy, and botany; he also was fond of walking. As a teacher and lecturer he impressed his students and his international audiences at congresses with his exceptionally clear presentations.\nIn\n[\n2\n]\nhe is described as follows:-\nA handsome, dignified man, he is well remembered by scholars around the world for his quiet yet persistent advocacy of his philosophical ideals and for his unfailing politeness and kindness.",
  "math_areas": [
    "Algebra",
    "Geometry",
    "Logic"
  ]
}