{
  "nome_completo": "Armand Borel",
  "nome_curto": "Armand Borel",
  "ano_nascimento": "1923",
  "ano_morte": "2003",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Borel_Armand/",
  "lugar_nascimento": "La Chaux-de-Fonds, Switzerland",
  "lugar_morte": "Princeton, New Jersey, USA",
  "biografia": "Armand Borel\nattended secondary school in Geneva but was also educated at a number of private schools. In\n1942\n, at the age of nineteen, he entered the École Polytechnique Fédérale in Zürich where he studied mathematics and physics. After completing military service, which was compulsory in Switzerland, he graduated with a diploma in mathematics in\n1947\nhaving undertaken his master's studies under Eduard Stiefel. As well as Stiefel, Borel had attended lectures at the École Polytechnique Fédérale by\nHopf\nwho played an important role in influencing Borel's mathematical tastes.\nFollowing his graduation, Borel was appointed as a teaching assistant at the École Polytechnique Fédérale in Zürich. His aim was to undertake research for his thesis on\nLie groups\nand during his two years as a teaching assistant he published two papers on the topic. However, receiving an exchange grant from the French Centre National de la Recherche Scientifique he was able to spend the year\n1949\n-\n50\nin Paris. This was extremely important for him for he was able to get to know, and to learn from,\nHenri Cartan\n,\nJean Dieudonné\n, and\nLaurent Schwartz\n. He made friends with younger mathematicians,\nRoger Godement\n,\nPierre Samuel\n,\nJacques Dixmier\n, and especially with\nJean-Pierre Serre\n.\nJean Leray\nbecame Borel's thesis supervisor and he attended courses which he gave at the Collège de France. Borel wrote\n[\n6\n]\n:-\nAll these people -- the elder ones, of course, but also the younger ones -- were very broad in their outlook. They knew so much and knew it so well. They shared an efficient way to digest mathematics, to go to the essential points, and reformulate the mathematics in a more comprehensive and conceptual way. Even when discussing a topic more familiar to me than to them, their sharp questions often gave me the impression I had not really thought it through. That methodology was also apparent in some of the lectures at the Bourbaki seminar, such as Weil's on theta functions or\nSchwartz\n's on\nKodaira\n's big Annals paper on harmonic integrals.\nAfter his year in Paris, Borel went to Geneva where he substituted for the professor of algebra from\n1950\nto\n1952\n. However, during this time he made frequent visits to both Zürich and to Paris. In the summer of\n1951\nhe gave a series of lectures in Zürich on the\nLeray\n's ideas on the theory of homological invariants of locally compact spaces and of continuous mappings which was published as a\n95\npage book of mimeographed notes with the title\nCohomologie des espaces localement compacts, d'après J Leray\nⓉ\n(\nCohomology of locally compact spaces, according J Leray\n)\n. During the whole period when he was based in Geneva he was working on his thesis on the cohomology with integer coefficients of\nLie\ngroups which he defended at the Sorbonne in Paris in the early part of\n1952\n.\nIn\n1952\nBorel married Gabrielle Aline Pittet; they had two daughters Dominique Odette Susan and Anne Christine. In the autumn of\n1952\nBorel, and his new wife Gaby\n(\nas she was always known\n)\nset off for the United States. Borel had been invited to spend a year at the Institute for Advanced Study at Princeton and this was extended to a second year. Haefliger writes\n[\n8\n]\n:-\nThis two year stint in Princeton would prove crucial to the broadening of his mathematical interests ...\n[\nin a paper\n]\nhe describes with enthusiasm the exhilarating mathematical ambiance of the time.\nLeaving Princeton in\n1954\n, he spent the academic year at Chicago where\nAndré Weil\nwas teaching. This was an opportunity for Borel to learn a great deal about\nalgebraic geometry\nand number theory from\nWeil\n. He returned to the country of his birth in\n1955\nwhen he was appointed professor of mathematics at the École Polytechnique Fédérale in Zürich. Happy to be back in his native land, he had to make a difficult decision when he was offered a permanent professorship at the Institute for Advanced Study at Princeton in the following year. After taking some time to reach the difficult decision on whether to accept this highly prestigious offer, he made his decision and took up his duties in the United States in the spring of\n1957\n.\nWe should note at this point the major contribution that Borel made to\nBourbaki\n. He describes his experiences in\n[\n6\n]\nbut to a certain extent plays down the major role he had in writing the nine\nBourbaki\nchapters on Lie groups and Lie algebras which are considered now to be perhaps the most valuable long-lasting contribution of\nBourbaki\n. Borel writes in\n[\n6\n]\n:-\nIt started with a draft of about\n70\npages on root systems.\n[\nI\n]\nwas almost apologetic in presenting to Bourbaki such a technical and special topic, but asserted this would be justified later by many applications. When the next draft, of some\n130\npages, was submitted, one member remarked that it was all right, but really Bourbaki was spending too much time on such a minor topic, and others acquiesced. Well, the final outcome is well known:\n288\npages, one of the most successful books by Bourbaki. It is a truly collective work, involving very actively about seven of us, none of whom could have written it by himself.\nPierre Cartier\nwrites\n[\n12\n]\n:-\nIf you look at the volumes on Lie groups, you will see that the later ones have chapters that you don't expect in Bourbaki. It became more and more explicit; there are tables and drawings. I think this was basically the influence of one person, Armand Borel. He was fond of quoting Shaw, \"It's the Swiss national character, my dear lady,\" and very often during a discussion he would say, \"I'm the Swiss peasant.\"\nHaefliger sums up his contributions in\n[\n8\n]\n:-\nHis body of mathematical work is considerable and shows remarkable coherence. Borel's work, apart from a dozen books, lecture notes ...encompasses more than\n150\narticles. Beyond\n50\nof them are written in collaboration with more than\n30\ncoauthors\n(\nnotably ten joint works with\nJ-P Serre\nand five with\nJ Tits\n)\n. They focus on Lie groups, and their actions, as well as on algebraic and arithmetic groups, and broach core questions regarding many different areas: algebraic topology,\ndifferential geometry\n, analytic geometry, analytic and algebraic geometry, number theory etc. These articles were fundamental to the development of mathematics in the second half of the\n20\nth\ncentury.\nAmong his books are\nTopics in the homology theory of fibre bundles\n(1967)\n, which is based on lectures Borel gave at the University of Chicago in\n1954\nin which he described the state of the topic at that time adopting the same methods and points of view as in his thesis. In\n1969\nhe published\nIntroduction aux groupes arithmétiques\nwhich was also based on a lecture course, this time at the Institut Henri-Poincaré in\n1967\n. Also in\n1969\nLinear algebraic groups\nwas published based on a graduate course given by Borel at Columbia University in the spring of\n1968\n. One book which does not seem to be based on a lecture course is\nAutomorphic forms on\nS\nL\n(\nR\n)\nSL(R)\nS\nL\n(\nR\n)\nwhich Borel himself says would have been better titled \"Introduction to some aspects of the analytic theory of automorphic forms on\nS\nL\n(\nR\n)\nSL(R)\nS\nL\n(\nR\n)\nand the upper half-plane\nX\nX\nX\n.\"\nBorel received many honours for his outstanding contributions to mathematics. He was awarded an honorary degree from the University of Geneva in\n1972\n, received the\nBrouwer\nMedal by the\nDutch Mathematical Society\nin\n1978\n, was elected to the\nAmerican Academy of Arts and Sciences\nin\n1976\n, the\nNational Academy of Sciences\n(\nUnited States\n)\nin\n1987\n, and the\nAcademy of Sciences\n(\nParis\n)\nin\n1987\n. He was also elected to the\nFinnish Academy of Sciences and Letters\nand the American Philosophical Society. He received the\nAmerican Mathematical Society\n's Steele Prize for lifelong contributions to mathematics in\n1991\n. The citation states that Borel's results:-\n... provided the empirical base for a great swath of modern mathematics, and his observations pointed out the structures and mechanisms that became central concerns of mathematical activity. In the course of amassing these astounding achievements he placed the facilities of the Institute for Advanced Study at the service of mathematics and mathematicians, using them to foster talent, share his ideas, and facilitate access to recent developments through seminars and lectures. It is just simply not possible to cite a career more accomplished or fruitful or one more meaningful to the contemporary mathematical community.\nBorel also received the Balzan prize in\n1992\n:-\nFor his fundamental contributions to the theory of Lie groups, algebraic groups and arithmetic groups, and for his indefatigable action in favour of high quality in mathematical research and of the propagation of new ideas.\nIn fact we learn much of Borel's view of mathematics in the reply he made on receiving the Balzan prize:-\nMathematics is a gigantic intellectual construction, very difficult, if not impossible, to view in its entirety. Sometimes I like to compare it to an iceberg because it has a small visible part and a large invisible part. By visible part I mean the mathematics useful in the external world, in technology, physics, natural sciences, astronomy, computers and so on, whose usefulness and social justification cannot be doubted. Indeed, it is certain that practical problems in acnient times were at the very origin of mathematics. However, with the development of mathematics the subject acquired a life of its own and mathematics became more and more interested in purely mathematical problems, not necessarily paying attention to applications outside mathematics itself. This forms the invisible part of the iceberg; I mean invisible or at least very difficult to grasp for the non-mathematician ...\nMathematics has been for me a profession but also my hobby. The course my investigations have taken, the choice of arguments to study, have been influenced by both points of view., which are often not quite distinct. Again and again I have been by a sense of the architecture of this building to which we continue to add new wings and new floors, while renovating the parts already built ... This is the professional view, but happily these problems were those that attracted me the most. In other instances I was not guided by such motives, being attracted only by curiosity, by the need to know the answer to an enigma ...\nOn another occasion he said:-\n... mathematics is an extremely complex creation, which exhibits so many common traits from art and from both the experimental and theoretical sciences. It reflects simultaneously all three of them and therefore must be distinguished from all three of them.\nAmong his interests we mention music in particular\n[\n5\n]\n:-\nHis love of jazz kindled in him an interest in Carnatic music, with its syncopated rhythms and melodic improvisations, which grew into a passion.\nAlso, as\nBombieri\nwrites in\n[\n5\n]\n:-\nHe loved nature, and quite often I walked with him in the Institute woods ...\nWe now look at some comments on his personality. Chandrasekharan writes\n[\n5\n]\n:-\nHis brilliance is in his refusal to distinguish between fun and learning.\nChandrasekharan also writes:-\nHis personality might have seemed dour to those who did not know him well; they could not sense the soft core underneath, nourished and sustained by his devoted wife, Gabrielle. He had a social conscience and human sympathy for the predicament of the poor and disadvantaged.\nPrasad writes in the same article:-\nBorel was an astute observer: he had an uncanny eye for artistic detail and would reflect on the influence of literature and culture on human outlook.\nBorel loved to travel and made visits to many countries including India, Mexico and China. He accepted a professorship at ETH in Zürich which he held from\n1983\nto\n1986\n. His life fell into a regular pattern during his last few years when he would spend the winters in his home at Princeton, spend the spring in the Far East, then go to his home\nLa Conversion\noverlooking Lac Léman in Switzerland. His final illness was brief and he died after the rapid progression of cancer.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Geometry",
    "Number Theory"
  ]
}