{
  "nome_completo": "Arnljot Høyland",
  "nome_curto": "Arnljot Høyland",
  "ano_nascimento": "1924",
  "ano_morte": "2002",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Hoyland/",
  "lugar_nascimento": "Baerum, Norway",
  "lugar_morte": "Trondheim, Norway",
  "biografia": "Arnljot Høyland\nwas a mathematical statistician. His parents were Torleiv Høyland\n(1893\n-\n1989)\n, a teacher, and Sigyn Tønnesdtr Husebø\n(1899\n-\n1994)\n, a clerk. Arnljot was one of his parents' three children. Torleiv Høyland was the author of the book\nLaerernes Kirkenesferd\nⓉ\n(\nThe teachers' journey to Kirkenes\n)\n(1946)\n.  This book was about something that happened in\n1942\n, when many school teachers were sent to a labour camp in Kirkenes, a small city in the North of Norway, next to Russia, for refusing to introduce Nazi ideology into schools. Torleiv Høyland was prisoner no\n1850\nthere.\nArnljot Høyland is internationally renowned for his work in mathematical statistics. He has been a very active participant in the development of statistics in Norway, including as a textbook author. He is also known for having composed, in\n1944\n, the melody of Alf Prøysen's \"Julekveldsvise,\" a very famous Norwegian Christmas song. Høyland met Alf Prøysen, a famous Norwegian writer and musician, during the last years of the war. They cooperated among other things on shows, and it was in this context that Høyland composed the melody Prøysen later used in his \"Julekveldsvise\". Because if this Høyland was interviewed several times on Norwegian television in the\n1990\ns.\nHøyland completed his high school studies and took his matriculation examination in\n1943\n. In April\n1940\nGerman troops invaded Norway and on\n1\nMay the Norwegians surrendered. At this time Høyland was a sixteen year old schoolboy. The following years were difficult with the German occupation of Norway. However, Høyland completed his high school studies and took his matriculation examination in\n1943\n. He intended to begin his university studies at the University of Oslo in the autumn of\n1943\nbut this proved impossible at that time. The Germans had attempted to convert the university to the Nazi philosophy but, when this was unsuccessful, they closed down the University of Oslo on\n30\nNovember\n1943\n. He had to put off time for two years until the war had ended.\nAt the end of the war, in autumn\n1945\n, Høyland began to study at the University of Oslo. He planned to study mathematics, mechanics, chemistry and physics, with physics as his major subject. However, after starting his course, he was told that those born in\n1924\nwere required to do three months military service. He went to the War Commission in Oslo and asked if he could do his military service over the summer of\n1946\nso that he could continue his university studies in the autumn of that year. He was told that they needed two recruits in the Armed Forces High Command and he was told to speak to them. When he arrived at the indicated place, he discovered it was the Intelligence Service of the Norwegian Defence. He was interviewed by the head of the service, Erling Sverdrup\n(1917\n-\n1994)\n, a statistician who had been involved in the fighting in Norway during World War II. Høyland was given some tests and then told he could start work. The second person appointed was Harald Bastiansen who later became director of the Municipal Land Fund. They were given the task of solving\n26\nequations in\n26\nunknowns. They spent much of the summer of\n1946\nworking on this problem. The number\n26\ncame from the fact that there were\n26\nletters in the alphabet.\nTowards the end of his three months, he was asked if he would stay on until the end of the year and be made a second lieutenant. Høyland needed the money, so he accepted. He left the Intelligence Service on\n1\nJanuary\n1947\nand returned to his studies at the University of Oslo. However, in the autumn of\n1947\nhe was asked if he would apply for the position of captain in the army, attached to the Intelligence Service. He submitted an application and he became a captain in\n1948\n. He received a little military training at the Huseby military camp, being shown how to fire a gun. Beginning in March\n1948\n, he was given the task of building up an analysis department of the Norwegian Defence consisting of mathematicians and linguists, where he quickly became aware of the necessity of learning statistics. This led to his mathematics studies at university, which Høyland completed while holding his position in the Intelligence Service, having a high component of mathematical statistics. He took courses on mathematics, mechanics and chemistry during\n1947\n,\n1948\nand\n1949\n. Although he knew he needed to learn statistics, the subject was not taught as part of the Mathematics and Natural Sciences degree at the University of Oslo at this time. Together with a fellow student, he talked to the university professors,\nThoralf Skolem\n, Ingebrigt Johansson\n(1904\n-\n1987)\nand Ralph Tambs-Lyche\n(1890\n-\n1991)\nand asked them what they should do.\nThe results of these discussions were that Johansson agreed that they could drop geometry, and\nSkolem\nagreed that they could also drop algebra and number theory. They were to take function theory, based on\nKonrad Knopp\n's book\nElemente der Funktionentheorie\nⓉ\n(\nElements of complex analysis\n)\n, and analysis based on\nEdouard Goursat\n's book\nCours d'analyse mathématique\nⓉ\n(\nCourse of mathematical analysis\n)\n. To cover the statistics that they wanted, they were to read the statistics book\nIntroduction to the theory of statistics\nby Alexander McFarlane Mood\n(1913\n-\n2009)\n, and\nHarald Cramér\n's book\nMathematical Methods of Statistics\n. In addition Olav Reiersøl\n(1908\n-\n2001)\nwould give some special lectures on statistics and give them a topic for a thesis. Reiersøl suggested a topic on probability densities of specific differential equations. They had a difficulty with Reiersøl, however, since he was interested in the international language Esperanto and he was one of the founders of the International Association of Esperantist Mathematicians. He had written the works in Esperanto which Høyland had to read. Describing his thesis, Høyland said\n[\n3\n]\n:-\n... there was very little use of statistics. The differential equation took a whole page and so was utterly awful. But I got there. I was not so deeply concerned about what it could be used for, other than a thesis. It is a good job that nobody other than Reiersøl went thoroughly through the work.\nHe was awarded his cand.real. degree\n(\nequivalent to a Ph.D.\n)\nafter defending his thesis in the autumn of\n1952\n. He then returned to his position in the Intelligence Service.\nOn\n20\nOctober\n1951\n, he had married had the statistician Liv Sirum, who was the daughter of chief engineer Esten Sirum\n(1889\n-\n1958)\nand Helga Amundsen\n(1901\n-\n1996)\n.\nAs to his work with the Intelligence Service, Høyland says that\n1948\nwas an exciting year. International moves were being made to establish NATO while the Norwegian Intelligence Service tracked Russian ships going in and out of international waters between the Kola Peninsula and the Baltic Sea\n[\n3\n]\n:-\nThey were plotted and followed throughout. For all we knew, they could suddenly turn around and go straight for us, as the Germans had done in\n1940\n.\nAlthough he was working as a statistician, he still had military duties\n[\n3\n]\n:-\nWe had offices under Akershus Fortress, just below the royal burial chapel. The building was secured with an alarm, and if someone broke in, the alarm went off. If that happened, you had to notify the duty officer. Then he would come out with a gun. When the alarm went off, most often middle of the night, we had to go on duty throughout the building to find out what it was. If we discovered someone who was about to break in, we would first shout, then shoot them in the legs. For a civilian like me this was fairly brutal. Fortunately I never discovered any intruders. In winter it was sometimes very cold, and I think that some of the alarms were triggered by temperature fluctuations.\nHøyland retired from the Norwegian Defence in\n1954\n, having attained the rank of a major. He then became a research assistant for Professor Erling Sverdrup at the University of Oslo and played an important part in establishing the new statistics subject. Sverdrup had been appointed as professor of mathematical statistics at the University of Oslo in\n1953\n. However, Høyland's move was a costly one financially\n[\n3\n]\n:-\nAs a Major I had reached salary grade\n17\n, which at that time was pretty good. As a research assistant, I went down to salary grade\n10\n. It had certainly never happened before in the State that someone had gone down so much, if they had not been dismissed. But I said yes and began as a research assistant in the autumn of\n1954\n. Now when I tell someone that I was in the military while studying most people seem to think that the military only funded me, and that I could study full time, but this was not so. I had to work fully for the reward I got.\nAt first he taught statistics within the mathematics department but, after about a year, statistics was accepted by the Faculty as a discipline in its own right. This was only achieved with difficulty since some, as for example the theoretical physicist Egil Hylleraas\n(1898\n-\n1965)\n, argued that if anyone needed to use statistics they could learn all they need to know in an afternoon.\nIn the autumn of\n1957\n, funded by a scholarship from the Norwegian Technological Research Council, he went to the University of California, Berkeley, to begin studying at the prestigious statistics institute there.\nDavid Blackwell\nwas head of statistics at that time and he advised Høyland to register as a Ph.D. student. He took a course on probability given by Michel Loève\n(1907\n-\n1979)\nand a course on hypothesis testing given by Erich Leo Lehmann\n(1917\n-\n2009)\n. Lehmann was using the lectures he was giving as the basis for his famous book\nTesting Statistical Hypotheses\n(1959)\nand Høyland received a \"thanks\" in the Preface to the book for having worked through all the problems. He had only partially completed work on his Ph.D. thesis when he returned to Oslo in\n1959\n.\nBack in Oslo he began teaching and struggled to complete the work for his Ph.D. thesis. He applied to the Norwegian Technological Research Council for a second scholarship to allow him to return to California to complete the work for his Ph.D. He was successful and he returned to California in the autumn of\n1962\n. He was told that the topic he had been working on three years earlier was now not suitable for a thesis since publications had appeared making the work obsolete. Writing a new thesis in a short time was difficult for he was supposed to return to Oslo to teach in the autumn semester of\n1963\n. However, he managed to obtain extended leave and submitted his thesis\nSome Problems in Robust Estimation\nin August\n1963\n. He received his PhD degree in late\n1963\nand returned to Oslo to begin teaching on\n1\nJanuary\n1964\n. Later, he became a key contact for other young Norwegians who wanted to do their PhD studies in the United States.\nBack in Norway, Høyland had difficulties because he was arguing for non-parametric statistics. He said\n[\n4\n]\n:-\nIn parametric theory often assumptions in the models are introduced exclusively to make it mathematically convenient.\nHe had many battles with Scandinavian colleagues over this issue\n[\n4\n]\n:-\nSverdrup has always been very sympathetic to me, even though we were not always in complete agreement. ... Most Danish statisticians, except Anders Hald, protested against the philosophy of the non-parametric models.\nAnders Hald\n(1913\n-\n2007)\nwas professor at the University of Copenhagen from\n1960\n.\nAfter working as a lecturer at the University of Oslo from\n1959\nto\n1965\n, Høyland was hired by the Norwegian Institute of Technology\n(\nNTH\n)\nin Trondheim as a senior lecturer in\n1965\nand later became a professor of mathematical statistics. At NTH he again had battles over his view of statistics\n[\n4\n]\n:-\nWhen I arrived there in January\n1965\n, there was no particular interest there for the non-parametric view. The engineers were making all sorts of measurements, and they thought that they really knew what kind of size measurements represent.\nHøyland was the first person who specialised in statistics that NTH hired. He had difficulties persuading others about the need for a specialised statistics course. He gave an example in\n[\n4\n]\n:-\nWhen I came to Trondheim, I would visit the various departments, and I walked around with the mathematics professor John Olav Stubban\n(1909\n-\n1994)\nwho introduced me. We came to the Chemistry Department. There I was very enthusiastic about how useful a statistics course would be in industrial chemistry. I did not know so much about the uses, but I took a chance. Among the chemistry staff sat an elderly gentleman who smoked a cigar. I had no idea who he was. When I had finished my mission lecture, he stood up and said that he understood that this could be interesting, especially in industrial chemistry. But within his own area, which was organic chemistry, one would never need to use something like that, because they never had so many observations that could apply statistics. Although I was young and enthusiastic, I should perhaps have been a little more careful. The man with the cigar was in fact a very significant person in the NTH environment, Professor Nils Andreas Sørensen. I jumped up and said it was the stupidest thing I had ever heard. It was precisely when one had little data that one needed to use statistical methods. If one had very many observations, even an idiot could draw the right conclusions, I suggested. He blushed, but said nothing more then.\nAfter strenuous efforts, he received approval for a separate course in statistics within all NTH engineering departments. During this time, his wife Liv, who became a lecturer in statistics at NTH in\n1968\n, was a great help. Høylands\n2\n-volume textbook\nSannsynlighetsregning og statistisk metodelaere\nⓉ\n(\nProbability and statistical methods\n)\n, published in\n1972\n-\n73\n, was compulsory reading for the students at NTH for over\n20\nyears. He remained there as a professor until\n1990\nand then as a senior researcher until\n1994\n.\nThrough his contact with the statistics community in Berkeley, Høyland became familiar with the field of system reliability theory during the mid-\n1970\ns\n[\n8\n]\n:-\nIn\n1975\n-\n76\n, Professor Arnljot Høyland, Department of Mathematical Statistics, had a sabbatical year at University of California, Berkeley, USA. Here he met Professor Richard E Barlow who had just published the seminal book \"Statistical Theory of Reliability and Life Testing\"\n(1975)\n. When professor Høyland returned to NTNU\n(\nNTH at that time\n)\n, he was very enthusiastic and wanted to start a course in reliability analysis at NTNU, using the book by Barlow and Proschan. He therefore asked Dr Bent Natvig to prepare a weekly seminar on this topic during the spring semester of\n1977\n. Bent Natvig stayed only a short time and left NTNU during the summer of\n1977\n- so when the first ordinary course in reliability analysis was to be lectured, professor Høyland had to be the lecturer - with assistance from Marvin Rausand who took over Bent Natvig's position as an assistant professor.\nHøyland and Rausand were co-authors of an international textbook\nSystem Reliability Theory: Models and Statistics Methods\n(1994)\n. You can read extracts from the Preface and from some reviews of the book at\nTHIS LINK\n.\nYou can read Høyland and Rausand's\nBrief History of Reliability\nat\nTHIS LINK\n.\nHøyland was known for his cheerful spirit and his musicality. He has always been perceived as a community builder, a characteristic that has undoubtedly had an impact on his achievements. Over the years, he set up an extensive network among academics worldwide.\nArnljot Høyland was appointed Knight of First Class of the Order of St Olav in\n1995\n. He has been a member of the Norwegian Academy of Technological Sciences since\n1972\n, the\nRoyal Norwegian Academy of Sciences and Letters\nsince\n1975\nand the International Statistical Institute since\n1966\n.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Statistics"
  ]
}