{
  "nome_completo": "Artūras Dubickas",
  "nome_curto": "Artūras Dubickas",
  "ano_nascimento": "1964",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Dubickas/",
  "lugar_nascimento": "Tauragė, Lithuania",
  "lugar_morte": null,
  "biografia": "Artūras Dubickas\nis a Chief Research Fellow at the Department of Probability Theory and Number Theory of Vilnius University's Faculty of Mathematics and Informatics. His main area of interest is Number Theory.\nArtūras Dubickas was born in\n1964\nin Tauragė, a city in western Lithuania, not far from the Baltic Sea. His father Kazys Dubickas was an electrical engineer and his mother Elena was working as an economist. Arturas and his younger sister Asta were the only two children in the family. Arturas was a student at Taurage's\n1\nst Secondary School from September\n1971\nto June\n1982\n. He was quite good at all subjects, hence from fifth grade he decided to start participating in his school\n(\nand later, town\n)\nmathematical competitions. However, as his teachers have later admitted, at that time Arturas was not capable of writing the solutions to the problems in a way teachers could understand them, so his first success at the Olympiad was only in Year\n9\n. Then not only did he get into his school team, but also took first place in the regional Olympiad in Siauliai University. This was the moment when he became more interested in mathematics. Arturas' mathematics teacher Rene Barsciauskas saw his curiosity and gave him a collection of old 'Kvant' journals\n(\na science magazine in physics and mathematics for high school students in the Soviet Union\n)\n. At home and during mathematics lessons Arturas used to solve problems from the magazines and various mathematical books he bought himself, since the usual school course was already known to him. By reading those books he independently prepared for the Mathematical Olympiads; his highest achievements were two first places in the Lithuanian Mathematical Olympiad\n(\nYear\n10\nand Year\n11)\nand second place in the Soviet Union Mathematical Olympiad\n(\nYear\n11)\n.\nIn\n1982\nDubickas graduated from Secondary School with a Gold Medal and in September of that year matriculated at Vilnius University Mathematics Department. At that time, the two best students from the course would get the opportunity to continue their studies in the best Soviet Union universities with the condition that they would come back to become lecturers at Vilnius University. So, in September\n1983\n, Arturas took this opportunity and started his second year of studies at the M Lomonosov Moscow State University. He took up extracurricular courses in several subjects including number theory and decided to continue his research in this area. In his third year he chose to study in the Department of Number Theory. His scientific advisor was professor\nNaum Iljich Feldman\n, who at that time was teaching a course on approximation of algebraic numbers. Aruras attended that course, and after a year wrote his first scientific paper\nApproximations of the Logarithms of Some Numbers\n(\nin Russian, published in\n1986)\n. His second paper\nApproximation of\nπ\n√\n3\n\\large\\frac{\\pi}{√3}\\normalsize\n√\n3\nπ\n​\nby rational fractions\nwas published in\n1987\nin the\nMoscow University Mathematical Bulletin\n. In June of the same year he graduated from the university with honours and in November started his Candidates degree studies\n(\nequivalent to a Ph.D.\n)\nin the Department of Number Theory, Faculty of Mechanics and Mathematics of Moscow State University.\nIn two years Dubickas attended his first mathematical conference in Minsk, Belarus:\nConstructive Methods and Algorithms in Number Theory\n. In\n1990\nhe defended his PhD dissertation\nApproximation of some Algebraic Numbers and Logarithms of Algebraic Numbers\n. The best result of the thesis was an effective upper bound on the distance between the integer powers of\n3\n2\n\\large\\frac{3}{2}\\normalsize\n2\n3\n​\nand the nearest integer, a problem related to so-called\nWaring\nproblem in additive number theory. At that time, the Soviet Union had started to collapse. Job positions that were created and funded by the government\n(\nincluding work at the university\n)\nwere much less paid than the ones in the private sector. Mathematicians were highly desired in private industry. Hence most of Dubickas's fellow classmates started working in various businesses and banks, due to higher salary\n(\nthey could earn\n10\n-\n20\ntimes more than doing scientific research\n)\n. However, Arturas strongly wanted to be a scientist. Therefore, at the end of\n1990\nhe came back to Vilnius University and started an academic career.\nDubickas's first appointment was as an Assistant Professor in the Department of Probability Theory and Number Theory, a position he took up in December\n1990\n. He had a lot of teaching hours at that time, so after applying to several universities he was offered a postdoctoral position at the University of Witwatersrand in Johannesburg, South Africa, which he took up in February\n1992\n. There he worked on several papers:\nOn improving the approximation of\nπ\n√\n3\n\\large\\frac{\\pi}{√3}\\normalsize\n√\n3\nπ\n​\nby rational fractions\n(1993)\n, which was a continuation of the work he had presented in his Ph.D. thesis, and\nOn a conjecture of A. Schinzel and H. Zassenhass\n(1993)\nwhere he obtained a new bound on a well-known problem of Andrzej Schinzel and\nHans Zassenhaus\nrelated to\nLehmer\n's problem which had been open since\n1933\n. Two years later Arturas came back to his career in Vilnius University. From February\n1994\nto August\n1998\nhe was a Research Fellow at the Department of Probability Theory and Number Theory and, in December\n1998\n, he became a\ndocent\n. Then for a year he worked as Senior Research Fellow, in the meantime he also defended his\nhabilitation\n:\nDistribution of algebraic numbers\n(\nFebruary\n1999)\n. In August of the same year he was promoted to Chief Research Fellow at Vilnius University and at the Institute of Mathematics and Informatics\n(\npart time job\n)\n; in December\n2001\n, he also became a Professor and he continues these duties to this day. In September\n2016\n, he became the Chair of the Department of Probability Theory and Number Theory.\nIn total Dubickas has published about\n200\npapers, and he is still publishing papers regularly. His works are published in more than\n100\nmathematical journals such as\nAdvances in Mathematics\n,\nProceedings of the American Mathematical Society\n,\nMathematical Proceedings of the Cambridge Philosophical Society\n,\nBulletin of the London Mathematical Society\n,\nMathematische Zeitschrift\n,\nIsrael Journal of Mathematics\nand many others. Most of his papers are written as single author works, however some of them have coauthors from all over the world: USA, Canada, UK, France, Israel, China, Russia, Portugal, etc. Throughout his career he has participated in more than\n60\nmathematical conferences and seminars, including scientific visits to some famous universities, such as Cambridge University\n(\nCambridge, UK,\n1999)\nand Max Planck Institut für Mathematik\n(\nBonn, Germany,\n2002)\n.\nThe papers published by Dubickas cover a broad area, however three most common topics are Diophantine approximation, heights of algebraic numbers and distribution modulo one. He focused on the first topic mostly whilst studying in Moscow and related works were published between\n1986\n-\n1991\n. Later, he started looking into heights of algebraic numbers, and the majority of his works between\n1992\nand\n2005\nwere dedicated to this topic. Since\n2006\nhe spends most time on distribution modulo one of various sequences. One of his papers on this topic, called\nOn the powers of\n3\n2\n\\large\\frac{3}{2}\\normalsize\n2\n3\n​\nand other rational numbers\n(2008)\n, published in\nMathematische Nachrichten\nwas reviewed by Yann Bugeaud:-\nIn the paper under review, the author establishes several very interesting new results on the distribution modulo one of the integral powers of a given rational number. ... We stress that the total length of this union of intervals exceeds\n1\n2\n\\large\\frac{1}{2}\\normalsize\n2\n1\n​\n: in this respect, the above result can be viewed as an answer to a weak form of\nMahler\n's problem ... This improves a previous result of Pollington, obtained by means of an interval construction. Here, the author uses a rather different approach. ...\nOutstanding mathematical achievements of Dubickas were noticed by the scientific community, and as a result he was awarded the Rector's Prize for Outstanding Scientific Achievements three times\n(\nin\n2002\n,\n2006\nand\n2013)\n. He was also given the National Science Award of Lithuania in\n2006\nfor the cycle of papers\n'Distribution of Algebraic Numbers'\n(1986\n-\n2005)\n. It is important to mention that a few Dubickas's papers are included and quoted in the databases of scientific web pages, such as Wolfram Research MathWorld -\n(3\npapers\n)\n(\nsee\n[\n5\n]\n)\n, The ABC Conjecture -\n(1\npaper\n)\n(\nsee\n[\n4\n]\n)\n, and Page dedicated to\nLehmer\n's Problem -\n(25\npapers\n)\n(\nsee\n[\n3\n]\n)\n.\nBesides being an active scientist, Dubickas is involved in organizing Olympiads for young mathematicians. Being the head of the evaluation committee for the National Lithuanian Mathematical Olympiad, his responsibilities include selecting the problems for students and making sure that they are fairly evaluated. Then the best students are given a chance to take part in the International Mathematical Olympiad\n(\nIMO\n)\n. Every year since\n2007\nArturas has been a Lithuanian team leader at the  IMO, where he defends students' solutions to the problems. Since then, from\n2007\nuntil\n2016\n, Lithuania has won\n30\nmedals including the only gold medal for Lithuania in\n2007\n(\nwon by Kestutis Cesnavicius, who later did his PhD at the Massachusetts Institute of Technology and now has a post doctoral position at University of California, Berkeley\n)\n. In addition to this, Dubickas is also a team leader of Vilnius University at the\nVojtech Jarnik\nMathematical Competition for students. Since\n2013\nevery year he brought the Lithuanian team to Ostrava, Czech Republic, where the competition is held. Dubickas strongly believes that it is important to encourage young mathematicians to test and apply their problem solving skills, strive for the best education and, later on, maybe contribute to the mathematical community.\nIn total Dubickas has been a scientific advisor for seven students\n(\nbetween\n2008\nand\n2013)\n, all of whom defended their PhD theses. Five of his students are now working in Vilnius University, one\n(\nJonas Jankauskas\n)\nobtained a post doctorial position at University of Waterloo\n(\nCanada\n)\nand now has an academic position in Austria. Three dissertations written by Dubickas's students were selected as the best dissertations of the year in a competition organized by Lithuanian Society of Young Researchers\n(\nPaulius Drungilas,\nHeights of Algebraic Numbers\n, in\n2008\n, Jonas Jankauskas,\nHeights of Polynomials\n, in\n2012\nand A Novikas,\nComposite Numbers in the Sequences of Integers\n, in\n2012)\n. Jankauskas' dissertation was also nominated for the International\nBanach\nPrize, and it ended up among the top five best dissertations.\nOverall, Dubickas is actively involved in the mathematical community and does not only partake in scientific, but also editorial and organizational work. Arturas was a committee member of numerous international conferences, for example, he organized the\n27\nth Journées Arithmétiques in Vilnius in\n2011\n, and he does editorial work for various mathematical journals, such as the\nEuropean Journal of Mathematics\n,\nThe Central European Journal of Mathematics\n(\nuntil\n2014)\n,\nUniform Distribution Theory\n,\nThe Lithuanian Mathematical Journal\nand the\nSiauliai Mathematical Seminar\n.\nHe has won several awards for his outstanding contributions including the Rector's Prize for Outstanding Scientific Achievements in\n2002\n,\n2006\nand\n2013\n, and the National Science Award of Lithuania for\n2006\nawarded for the cycle of papers\nDistribution of Algebraic Numbers\n(1986\n-\n2005)\n.\nDubickas's daughter, Leticija Dubickaite, is currently\n(2017)\nan undergraduate mathematics student at the University of St Andrews, Scotland.",
  "math_areas": [
    "Applied Mathematics",
    "Calculus",
    "Number Theory",
    "Statistics"
  ]
}