{
  "nome_completo": "Arthur Jules Morin",
  "nome_curto": "Arthur Jules Morin",
  "ano_nascimento": "1795",
  "ano_morte": "1880",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Morin/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Arthur Jules Morin\ngrew up at a turbulent time in French history although Paris was peaceful during much of his youth. He was only four years old when Napoleon Bonaparte became first consul and by\n1802\npeace reigned in Europe. However soon hostilities broke out again and, despite the naval defeat at Trafalgar in\n1805\n, the French armies won decisive victories against Austrian and Russian armies. Morin was fifteen in\n1810\nwhen Napoleon was at the height of his power and Paris thrived. The disastrous Russian campaign of\n1812\nsaw Napoleon return to Paris to strengthen his power and his army. By this time Morin was studying at the École Polytechnique and the next two years saw the French position deteriorate and the French army suffered a humiliating defeat at the Battle of Leipzig in October\n1813\n. As the armies of the allies moved towards Paris in\n1814\n, Morin had to terminate his studies at the École Polytechnique and join in the efforts to defend Paris. As Napoleon led the remnants of the French army east to attack the rear of the enemy troops approaching Paris, Talleyrand, as head of the government in Paris, ordered the city to capitulate.\nFollowing the Treaty of Fontainebleau which ended hostilities, Morin's defence duties ended and he entered the École d'Application de Metz where he undertook practical studies in engineering. There he met\nJean-Victor Poncelet\nwho was a military engineer. Morin remained at Metz for four years, and then entered the army as a lieutenant in the pontoon unit which had been created in the\n1790\ns. It was certainly an appropriate unit for an engineer with Morin's interests and the pontoon unit had been an important feature of Napoleon's army carrying pontoons of wood, copper, or other material\n[\n2\n]\n:-\nHis military career was marked by a rapid and regular promotion through the different grades, terminating in his appointment as an Artillery General of Division in\n1855\n.\nIt was on\n7\nApril\n1855\nthat Morin reached the rank of General of Division, having been made général de brigade on\n26\nMarch\n1852\n. However, he had much more to his life than a military career. In the\n1830\ns he taught mechanics at Metz, He was appointed to the newly created chair of mechanics at the Conservatoire National des Arts et Métiers in\n1839\n. This National Conservatory of Arts and Crafts had been opened in\n1802\nand ordered to:-\n... improve the nation's industry, cultivate engineering methods, teach widely and illuminate ignorance.\nThe teaching of mechanics at the Conservatoire National des Arts et Métiers had begun in\n1819\nand other theoretical subjects had been introduced in the\n1820\ns. As professor of mechanics Morin, who never renounced his army commission, drew heavily on the theoretical and practical work of his friend and teacher\nPoncelet\nand of other military officers. He also used the Conservatoire National des Arts et Métiers to promote a two-way flow of theory and practice between the military and private industry. Morin was Professor of Mechanics for ten years, and then in\n1849\nhe became Director of the Conservatoire. He served in this leading role for\n30\nyears and greatly improved the efficiency and influence of the Conservatoire. One of his greatest achievements was opening the first teaching laboratory of engineering in\n1852\n.\nOne might wonder how a military man became Professor of Mechanics. Well he had spent much time undertaking research into problems of mechanics and between\n1833\nand\n1835\nhe had submitted a number of important memoirs to the\nAcademy of Sciences\n. These memoirs presented the results of a series of carefully executed experiments on friction which he began planning in\n1829\n. Due to the complicated experimental apparatus used, built under the supervision of\nPoncelet\n, the experiments only began in May\n1831\n. They then continued without interruption until September of that year, when funds given for the research were used up. The results confirmed and extended\nCoulomb\n's work on friction, verifying its three general laws: friction is proportional to the normal force exerted; friction depends upon the nature of the surfaces in contact but is independent of the area of contact; and, within large limits, friction is independent of velocity. He also devised an apparatus to study the laws of falling bodies. It consisted of a cylinder rotating beside the falling body, set up in such a way that a marker on the falling body describes a curve on the cylinder. He was able to give an accurate experimental proof of\nGalileo\n's result that distances travelled by a falling body increase as the square of the times. In\n1849\nMorin, working with\nPoncelet\n, invented the dynamometer of rotation, which together with later refinements, became the basic investigative tool in the study of work. He had already published work on dynamometers in\nNotice sur divers appareils dynamometriques\nⓉ\n(\nNotice on various dynamometric devices\n)\n(\nParis,\n1841)\n, a work which describes the recording mechanism onto paper, as well as describing a mechanical integrator used so that results of longer experiments could be read off directly. His results on mechanics were all published in the five volume work\nLeçons de mécanique pratique à l'usage des auditeurs des cours du Conservatoire des arts et métiers\nⓉ\n(\nLessons on practical mechanics: A  course for members of the Conservatory of Arts and Crafts\n)\n(1846\n-\n1853)\n. Joseph Bennett made an English translation under the title\nFundamental ideas of mechanics and experimental data\nwhich was published in\n1860\n.\nDuring\n1853\n-\n56\nMorin undertook a series of experiments on the resistance of building materials which he published in a series of papers. This work was important in having practical applications to architecture. He published the results in a book form in\n1863\nwhen the two volume work\nRésistance des matériaux\nⓉ\n(\nResistance of materials\n)\nappeared. Let us mention a selection of his other works:\nNouvelles expériences sur le frottement, faites à Metz en\n1831\nⓉ\n(\nNew experiments on friction, made in Metz in\n1831\n)\n(1832)\n,\nExpériences sur les roues hydrauliques à axe vertical appelées turbines\nⓉ\n(\nExperiments on water wheels with vertical axis called turbines\n)\n(1838)\n,\nExpériences sur le tirage des voitures, faites en\n1837\net\n1838\nⓉ\n(\nExperiments on pulling vehicles, made in\n1837\nand\n1838\n)\n(1839)\n,\nNotice sur divers appareils dynamométriques\nⓉ\n(\nNotice on various dynamic devices\n)\n(1841)\n,\nConservatoire des Arts et Métiers. Catalogue des collections\nⓉ\n(\nCard Catalogue of the Conservatory of Arts and Crafts.\n)\n(1851)\n,\nNotions géometriques sur les mouvement et leurs transformations, où élémens de cinématique\nⓉ\n(\nGeometric notions on movement and their transformations, where there are cinematic elements\n)\n(1857)\n,\nRapport de la commission sur le chauffage et la ventilation du Palais de Justice\nⓉ\n(\nReport of the commission on heating and ventilation of the Palace of Justice\n)\n(1860)\n,\nÉtudes sur la Ventilation\nⓉ\n(\nStudies on Ventilation\n)\n(1863)\n,\nDes machines et appareils: destines a l'elevation des eaux\nⓉ\n(\nMachines and devices used for raising water\n)\n(1863)\n,\nNotes sur les appareils de chauffage\nⓉ\n(\nNotes on heaters\n)\n(1866)\n, and\nSalubrité des habitations. Manuel pratique du chauffage et de la ventilation\nⓉ\n(\nSafety in dwellings: a practical handbook of heating and ventilation\n)\n(1868)\n. His work on ventilation made him a leading world expert on the topic, and he used this knowledge in undertaking research into carbon monoxide in rooms heated by iron stoves in\n1869\nand research into the preservation of flour in\n1870\n.\nAnother important role that Morin filled was as President of the Commission for the first Universal Exhibition which opened in Paris in May\n1855\n. The Commission had spent more than two years in elaborate preparation for the Exhibition, which was designed to symbolise peace and culture. The aim was to impress those who visited the enormous halls with France's achievements in commerce and industry\n[\n4\n]\n:-\nThe exhibition buildings were designed to exploit the use of metal and glass as structural materials. The exhibits they contained were similarly dominated by a common fascination with novelty and a closely related faith in the material promise of technological progress. ... in the effort to be more truly universal, its organisers included with its industrial display a vast retrospective exhibition of paintings, sculpture, prints and architecture to recall man's accomplishments in the arts, as well as in science, technology, and business.\nNot only was Morin the President of the Commission, he also exhibited some of his apparatus. For example, he exhibited\n[\n3\n]\n:-\n... a totalizing anemometer, one of a series which was to be set into chimneys in the new buildings of the Palais de Justice in order to monitor ventilation. ...\n[\nit\n]\nwas a substantial piece, consisting of six aluminium vanes arranged in a helix ... and set upon a steel axis. The revolutions were counted through a series of gear wheels, so as to indicate the volume of air passing through the shaft in a period of time. Despite the long gear train and its considerable size, the anemometer was extremely sensitive.\nMorin received many honours for his contributions. He was elected to the mechanics section of the\nAcademy of Sciences\nin\n1843\nto succeed\nGaspard-Gustave de Coriolis\nwho died in September of that year. He was decorated with the Légion d'Honneur in\n1858\nand then in\n1862\nhe was elected to the French Society of Civil Engineers and later served as their president.\nIn the issue of\nNature\nwhich appeared on\n5\nFebruary\n1880\nthe following report appears:-\nWe regret to state that General Morin, the well-known director of the Conservatoire des Arts et Métiers, is lying in a very precarious state in consequence of a severe cold. Great anxiety is felt for him at the Institute, of which he is one of the most respected and popular members. The General is aged\n85\nyears.\nIn the following issue of\nNature\n[\n2\n]\n, his death in Paris on\n7\nFebruary was reported.",
  "math_areas": [
    "Analysis",
    "Applied Mathematics",
    "Logic"
  ]
}