{
  "nome_completo": "Artur Ávila Cordeiro de Melo",
  "nome_curto": "Artur Ávila",
  "ano_nascimento": "1979",
  "ano_morte": "",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Avila/",
  "lugar_nascimento": "Rio de Janeiro, Brazil",
  "lugar_morte": null,
  "biografia": "Artur Ávila\nis the son of Raimundo Nonato Cordeiro De Melo and Lenir Letiere de Ávila. In\n[\n28\n]\nhis parents are described as follows:-\nRaimundo was from the state of Amazonas and grew up tending a riverside plot of yuca. At age\n15\n, he went to Manaus, where he got a job as a waiter at the governor's mansion. Balancing work and school, he graduated from high school. Raimundo decided to try his luck in Rio de Janeiro, was accepted for a civil service post and entered the Reinsurance Institute of Brazil\n(\nIRB\n)\n, which helped to pay for his college - \"I think he studied accounting,\" his son says. At IRB, he met Lenir. They had one son\n[\nArtur Ávila, the subject of this biography\n]\n, who was still small when they separated\n[\nhe was eight\n]\n. He was raised by his mother.\nIn fact it was Raimundo who taught Artur to read and write when he was three years old and, as part of this, first introduced him to mathematics. By the time he was five, before he had any formal schooling, he was reading mathematics books. When he was six years old Artur began his schooling at Colégio de São Bento in Rio de Janeiro, a Benedictine school for boys. This school, founded in\n1858\n, was considered by many to be the best school in Brazil. Artur was rather bored by the lessons and looked to learn more by reading advanced books on his own. He recalled\n[\n26\n]\n:-\nAt school, I always wanted to read things that weren't being taught yet, texts from future years. My parents didn't have much of a way of guiding me to more specific texts, but I would read pretty much anything, ask them to buy books, etc. and, based on these books, I was learning.\nWhen he was thirteen years old, although still very fond of mathematics, he also loved history and science. He thought that a career in journalism might be right for him. It was his mathematics teacher at São Bento, Luiz Fabiano Pinheiro, who gave Artur his firm commitment to mathematics when he told him about the local junior Mathematical Olympiad competition and suggested he take part.\nÁvila did well in the local Olympiad competition in\n1992\nbut, he said\n[\n24\n]\n:-\nFor the first time, I felt I couldn't do anything.\nRather than discourage him, this had exactly the opposite reaction, for he was excited to be challenged by difficult problems. He was keen for more Olympiad experience in the Brazilian National Mathematical Olympiad competition later in\n1992\nbut before this happened he hit a problem at his school.\nIt was the religious education classes that caused Ávila problems. The class were presented with St Thomas Aquinas's \"five proofs\" of the existence of God. Ávila said that whether one believed in the existence of God or not, these could only be treated as philosophical arguments, not as logical proofs. He told he had to accept these arguments or leave the school and it was an easy decision; he was relieved to leave the Benedictine school. His teacher Pinheiro helped him to move to the Colégio Santo Agostinho, another high quality school in Rio de Janeiro. He was awarded a bronze medal in the Brazilian National Mathematical Olympiad competition, then gold medals in the following three years.\nThe Colégio Santo Agostinho was an Augustinian school founded in\n1946\n. It provided good teaching but Ávila found the mathematics classes far too easy and began missing lessons. He was critical of the whole teaching system and explained\n[\n28\n]\n:-\nPeople didn't study for the sake of knowledge, but to pass the test. In the schedule, after physics there came a Portuguese class, and then geography. In a system like that, what could I learn? I preferred mathematics; I chose to learn one thing well, for life.\nIn\n1995\nhe was a member of the team of six representing Brazil in the\n36\nth International Mathematical Olympiad held in Toronto, Canada. Most countries invest a lot in training their teams for the International Mathematical Olympiad but at this time Brazil gave essentially none at all. Despite this Ávila was awarded a gold medal. Back in Rio de Janeiro, he was offered a scholarship to study for a Master's Degree at the Instituto de Matemática Pura e Aplicada\n(\nIMPA\n)\n. He explained\n(\nsee, for example,\n[\n31\n]\n)\n:-\nIMPA sometimes accepts younger students who are still in high school. They do this if they perceive that the student is able to do the work. I knew about this and this aroused my interest in doing the same thing. This wish was granted when I returned from the\n1995\nInternational Mathematical Olympiad, at which I won the gold medal. IMPA suggested that I take one of the level\n1\ncourses shortly before starting the Master's degree. If everything went well, I would enrol. In fact, that is what I did while still in the last year of high school.\nÁvila attended the class 'Introduction to Real Analysis' given by Nicolau Corção Saldanha. This gave Ávila a totally new view of what mathematics was. Up till then, he had thought in terms of problem solving in competitions. Now he was learning complex ideas about which he had to think deeply; he loved it! In the test at the end of the course students were allowed books and notes to help them solve the problems but Ávila only took a pen to write his solutions. He scored\n12\nout of\n12\n, with a passing grade of\n3\nand the second best student achieving\n7\nout of\n12\n. Only then did Nicolau realise he had a brilliant student in his class. Up till that time Ávila came to lectures but said nothing and was never noticed by the lecturer. After this, Ávila was not interested in any more Mathematical Olympiad competitions and, despite lots of pressure to be part of the\n1996\nBrazilian team, he refused. All he wanted was to lean more mathematics. For the Master's degree Ávila was advised by\nElon Lages Lima\nbut soon came into contact with\nWelington de Melo\n. He said\n(\nin\n2017)\n[\n6\n]\n:-\n[\nWelington de Melo\n]\nwas an extremely rigorous mathematician, committed to the highest quality of the work carried out at IMPA. He wanted the work to be at the highest possible level, but, because of this rigour, his reputation scared students a little. I found it a bit risky to enrol, I think in\n1997\n, in a course taught by\nWelington\nat IMPA. With great caution, I did not enrol in the course, but went to attend classes. He turned out to be, unlike his reputation, very nice to me. At the end of the course, he said that I had done well.\nÁvila asked\nde Melo\nif he would be his Ph.D. advisor and he began his studies in\n1998\n. A conference on dynamical systems was held at IMPA from Monday\n11\nMay to Friday\n15\nMay\n1998\n.\nde Melo\ninvited Mikhail Lyubich, a Ukrainian mathematician who was co-director of the Institute for Mathematical Sciences at Stony Brook University, New York, to the conference. At this conference it was arranged that early in\n1999\nde Melo\nand Ávila would travel to Stony Brook and discuss a Ph.D. topic for Ávila with Lyubich. Ávila and\nde Melo\ntravelled on United Airlines to JFK Airport in February\n1999\n, then they went on to Long Island\n[\n29\n]\n:-\nJust before welcoming the Brazilians to Stony Brook, Lyubich had written a series of articles in which he proved his most important results. \"Very few people really understood what it was about\", he commented, \"and Welington was a notable exception. It was his proposal that Artur explore this line of research.\" ... The three spent a month tossing ideas back and forth, in a style of doing mathematics that only requires a blackboard, chalk, and space to walk back and forth. The daily conversations took place in the Institute's rooms, at Lyubich's house, in restaurants or during walks through the woods around the university. ... \"Occasionally, amazed, I realised that Lyubich and I were a little behind Artur,\" recalled\nde Melo\n, \"he was so young. .. I would forget about it but then be scared.\" ... After a month of intense discussions, the trio had a clear strategy for resolving the problem that consumed them, but the proof was still out of reach. There was an obstacle that refused to budge. Lyubich and\nde Melo\ndecided to leave it in the boy's hands. \"That was in March\", remembers Artur. \"I kept the problem in my head and a few months later, in September or October, I had a weird idea.\"\nÁvila was awarded his Ph.D. by IMPA in\n2001\nfor his thesis\nBifurcations of unimodal maps: the topologic and metric picture\n.\nThe joint work of Ávila,\nde Melo\nand Lyubich, completed by Ávila's \"weird idea\", was published in an impressive\n100\n-page paper\nRegular or stochastic dynamics in real analytic families of unimodal maps\nin which they proved a result that had been attacked unsuccessfully by many mathematicians. They write in their Abstract:-\nWe prove that in any non-trivial real-analytic family of quasi-quadratic maps, almost any map is either regular, that is, hyperbolic\n(\ni.e., it has an attracting cycle\n)\n, or stochastic\n(\ni.e., it has a probability absolutely continuous invariant measure\n)\n. To this end we show that the space of analytic maps is foliated by codimension-one analytic submanifolds, 'hybrid classes'. This allows us to transfer the regular or stochastic property of the quadratic family to any nontrivial real analytic family.\nThis was only one of several outstanding papers produced by Ávila around this time. By\n2004\nhe had eleven papers in print, a remarkable achievement for the young man only\n25\nyears old by that time. After completing his Ph.D. in\n2001\n, he had moved to France where he undertook post-doctoral work with\nJean-Christophe Yoccoz\n. He spoke about his move to Paris in the interview\n[\n31\n]\n:-\nI completed my PhD in Brazil and went to France in\n2001\n. My first jobs were in France and I spent five years there before returning to Brazil. After that, I spent three years in Brazil, and then started spending half of my time here and half there. The time I spent in France complemented my training as a mathematician and I extended my areas of research. I finished my PhD with the ability to do research at a high level. My results were recognised as important, but I had a restricted view of the area and its position within the whole of mathematics. In Paris, I had contact with the largest community of mathematicians in the world and unparalleled activity. This forced me beyond my area of expertise at the time, one-dimensional dynamics, and to look for other things, in order to be able to interact with these people who were not necessarily interested in the same things that I was. In this search with such good professionals, with so many possible co-authors, I started working in other areas and my work was lauded due to what I did in these areas. The mathematician that I am today is a result of my time in France and my training in Brazil.\nÁvila gave the Cours Peccot at the Collège de France in\n2004\n-\n05\n, delivering the course\nDynamique des cocycles quasi périodiques et spectres de l'opérateur presque-Mathieu\nⓉ\n(\nDynamics of quasiperiodic cocycles and spectra of the almost-Mathieu operator\n)\n. He was an invited lecturer at the International Congress on Mathematical Physics held in Rio de Janeiro in August\n2006\n, giving the talk\nThe Spectrum of the Almost Mathieu Operator in the Subcritical Regime\nto the Dynamical Systems section. Also in\n2006\n, the French National Centre for Scientific Research awarded him their Bronze medal and he was awarded the\nSalem\nPrize by the Institute for Advanced Study at Princeton. In February\n2008\nhe delivered the Wolff Memorial Lectures at the California Institute of Technology giving five lectures on\nRenormalization and quasiperiodicity in some low-dimensional dynamical systems\n. In July of the same year he gave an invited address at the\n5\nth European Congress of Mathematics in Amsterdam and was awarded the\nEuropean Mathematical Society\nPrize\n2008\n. He was awarded the Grand Prix\nJacques Herbrand\nfrom the\nFrench Academy of Sciences\nin\n2009\nand in February of the following year he delivered the Porter Lectures at Rice University and was a plenary lecturer at the International Congress of Mathematicians in Hyderabad, India, giving the lecture\nDynamics of Renormalization Operators\n. In March\n2011\nhe gave the\n16\nth Blyth Lecture Series at the University of Toronto on\nLyapunov exponents, KAM, and the spectral dichotomy for one-frequency Schrödinger operators\n. Also in\n2011\nhe was awarded the Michael Brin Prize in Dynamical Systems for his work on\nTeichmüller\ndynamics and interval-exchange transformations.\nÁvila continued to receive awards and honours: the International Association of Mathematical Physics Early Career Award\n(2012)\n; the Prize of the\nBrazilian Mathematical Society\n(2013)\n; and the Bellow Lectures by the Northwestern University\n(2014)\n. In\n2014\nhe was awarded a\nFields\nMedal; the citation states\n[\n18\n]\n:-\nÁvila leads and shapes the field of dynamical systems. With his collaborators, he has made essential progress in many areas, including real and complex one-dimensional dynamics, spectral theory of the one-frequency\nSchrödinger\noperator, flat billiards and partially hyperbolic dynamics. Ávila's work on real one-dimensional dynamics brought completion to the subject, with full understanding of the probabilistic point of view, accompanied by a complete renormalization theory. His work in complex dynamics led to a thorough understanding of the fractal geometry of\nFeigenbaum\nJulia\nsets. In the spectral theory of one-frequency difference\nSchrödinger\noperators, Ávila came up with a global description of the phase transitions between discrete and absolutely continuous spectra, establishing surprising stratified analyticity of the\nLyapunov\nexponent. In the theory of flat billiards, Ávila proved several long-standing conjectures on the ergodic behaviour of interval-exchange maps. He made deep advances in our understanding of the stable ergodicity of typical partially hyperbolic systems. Ávila's collaborative approach is an inspiration for a new generation of mathematicians.\nÉtienne Ghys gives the following abstract to his discussion of Ávila's work\n[\n18\n]\n:-\nArtur Ávila is awarded a\nFields\nMedal for his profound contributions to dynamical systems theory, which have changed the face of the field, using the powerful idea of renormalization as a unifying principle.\nÁvila  was awarded the\nTWAS\n-Lenovo Science Prize in\n2015\n. The President of\nThe World Academy of Sciences\nsaid\n[\n39\n]\n:-\nArtur Ávila is clearly an exceptional talent in the world of mathematics. But he also is a symbol of the remarkable creativity that we can find among young researchers in the developing world. At\nTWAS\n, we are proud of our links to this scholar, and we are confident that he has many more years of important work ahead of him.\nIn\n2017\nÁvila gave the Lojasiewicz Lecture at the Jagiellonian University. His title was\nOne-frequency Schrödinger operators and the almost reducibility conjecture\n. He was elected to the\nUS National Academy of Sciences\nin\n2019\nand in the same year the\nFields\nMedal Symposium in Toronto honoured Ávila and explored the current and potential impact of his work. At this Symposium he gave the Public Lecture\nDealing with Chaos\n. Here is his Abstract:-\nGiven a system that evolves in time, what can be said about its behaviour over long time scales? Dynamicists have been occupied by this question since\nNewton\n, but since then our understanding of what we should aim at has changed a lot. This happened in large measure due to the discovery of chaos, and how it can arise even in some of the simplest situations. In this public lecture, Ávila will reflect on how his field has changed over time, and examine current questions at the forefront of dynamical systems theory.\nÁvila was appointed as a full professor at the University of Zurich in\n2018\n. He is married to Susan Schommer. She has a Master's degree in economics from the Federal University of Rio Grande do Sul.\nLet us now give some quotes by Ávila taken from various interviews. Asked whether he was a great problem-solver, he replied\n[\n31\n]\n:-\nMany times in my career I sought out known difficult problems and worked hard to solve them. Since I did this several times, it is certainly true that I solved many problems. But, to a lesser extent, I also worked on building and developing these theories, which sometimes involve not just solving, but also formulating the problem. In the beginning, I resolved a problem related to\nSchrödinger\noperators, but later I also constructed a theory and solved problems related to it. But, certainly, the most visible aspect of my work is my many solutions to dynamic systems problems in different contexts\nAsked about research in both Brazil and France, he replied\n[\n20\n]\n:-\nBeing both Brazilian and French, it is important to me that conditions are favourable for mathematical research in both countries.  It is important not to let the researchers' careers deteriorate, not to put off talents. Some of these brilliant minds could indeed be discouraged by increased competition, difficult financial conditions and a lack of social recognition for researchers. As a consequence, they may turn away from this path. We must ensure that this does not happen.  For me it is different. I started my career very early and I am unable to do anything but maths. But we must also think of a more egalitarian research system, not only conducive to internationally recognised researchers. Ideas are universal and research is based on the work of many people, including also those who will unfortunately never be distinguished.\nAsked about the future of mathematics, he replied\n[\n33\n]\n:-\nThings tend to become more and more technical and thus people get further apart as they don't speak the same language. It has become clear that for an analyst it is more difficult to understand what they are now doing in algebra. My view on this is that people should just do what they want. If someone wants to think about prime numbers he should do that, if he wants to think about fractals then that is fine as well. Some researchers will make progress working on isolated topics and others might want to bridge together areas and examine the connections between discoveries. Not everyone has to do that. Some people might just want to play on their own. You cannot anticipate what is going to work out. It is also not necessary to decide which fields of mathematics have to be stimulated, since we don't know whether the next discovery in geometry will depend on a discovery in algebra and so on. This is also my point of view regarding focusing on pure or applied mathematics. What might be crucial in the solution of some very specific problem\n(\nwith industrial applications or whatever\n)\noften happens to be just some beautiful object that someone studied for its own sake. The motivation of the latter\n(\noften similar to the motivation a child has for playing a game\n)\nis irrelevant to the fact that what has been discovered turns out to be useful to the former. And of course it works both ways: much of my work deals with theories that first arose in connection to physics, but for me what matters is that these theories are rich mathematically, and I study them from this perspective. So \"pure\" mathematicians have to recognise that many of the nice objects they have at their disposal with rich mathematical theorems that one works on just because they are beautiful, without caring about the motivation or the application, might have not been discovered if it was not for some physical model that someone was examining because they cared about the physics of it. Thus, by admitting this and letting people work on what they want, the whole community benefits from the eventual\n(\nunpredictable\n)\ninteractions.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}