{
  "nome_completo": "Étienne Louis Malus",
  "nome_curto": "Étienne Louis Malus",
  "ano_nascimento": "1775",
  "ano_morte": "1812",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Malus/",
  "lugar_nascimento": "Paris, France",
  "lugar_morte": "Paris, France",
  "biografia": "Étienne Louis Malus\n's father was Louis Malus de Mitry and was Treasurer of France. Étienne Louis was first educated at home where he was instructed in literature and mathematics. He then attended the engineering school, École Royale de Genie, at Mézières. There he was taught by\nMonge\nwho realised Malus had special mathematical talents. In\n1793\nMalus left the school, having been dismissed for political reasons.\nOn leaving Mézières, Malus joined the army and was posted to Dunkerque. There his abilities were noticed and he was sent to the École Polytechnique as a pupil. Here he was taught by\nFourier\n, and he was perhaps the most able of all of\nFourier\n's pupils. He was to remain associated with École Polytechnique as an examiner all his life.\nWhile studying at the École Polytechnique Malus began to undertake original research, writing papers on the path of light through materials of differing refractive indices.\nAfter graduating from the École Polytechnique Malus rejoined the army, this time taking part in campaigns on the Rhine in\n1797\n. As an army engineer Malus was ordered to accompany Napoleon's invasion of Egypt in\n1798\n. This did not greatly please him since at the time that he received the order he was stationed in the town of Giessen, as part of the occupying force, and he was about to marry the daughter of the Chancellor of the University of Giessen.\nWhile in Cairo, Napoleon's fleet was destroyed in Aboukir Bay and Malus wrote, see\n[\n3\n]\n,\nFrom then on we realised that all our communications with Europe were broken. We began to lose hope of ever seeing our native land again.\nAt Napoleon's instigation, while they were in Cairo, the Cairo Institute was set up having\n12\nmathematical members. As well as Malus these included\nMonge\n,\nFourier\nand Napoleon Bonaparte himself. After returning in\n1801\nMalus held posts in Antwerp, Strasbourg, and Paris.\nHis mathematical work was almost entirely concerned with the study of light. This involved him in studying geometrical systems called ray systems, closely connected to\nPlücker\n's line complexes. He conducted experiments to verify\nHuygens\n' theories of light and rewrote the theory in analytical form. His discovery of the polarisation of light by reflection was published in\n1809\nand his theory of double\nrefraction\nof light in crystals in\n1810\n.\nIn\n1811\nMalus served, along with\nLagrange\n,\nLegendre\n,\nLaplace\nand Haüy, on the committee to decide on who to award the prize to for the best work on the propagation of heat in solid bodies. They awarded the prize to\nFourier\n.\nMalus received many honours for his work, in particular he was awarded a prize from the\nAcadémie des Sciences\nin\n1810\nfor his memoir on double refraction. In the same year he was elected to the\nAcadémie des Sciences\nand the following year, despite the war between England and France, Malus was awarded the Rumford medal of the\nRoyal Society of London\n.",
  "math_areas": []
}