{
  "nome_completo": "Antoine Augustin Cournot",
  "nome_curto": "Augustin Cournot",
  "ano_nascimento": "1801",
  "ano_morte": "1877",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Cournot/",
  "lugar_nascimento": "Gray, Haute-Saône, Franche-Comté, France",
  "lugar_morte": "Paris, France",
  "biografia": "Augustin Cournot\nwas the son of Claude Agapite Cournot\n(1760\n-\n1842)\nand Claire Eratif. He had siblings Joseph Antoine Cournot, who was born in\n1803\nbut died in the following year, Judith Xavière Cournot\n(1805\n-\n1876)\nand Eugène Cournot\n(1810\n-\n1880)\n. His parents seem to have had little influence on the young child who lived with a paternal uncle, two maiden aunts and Augustin's grandmother Marguerite Josèphe Cournot. This uncle was a major influence on the young boy. Henry Ludwell Moore\n(1869\n-\n1958)\nwrites\n[\n30\n]\n:-\nThis uncle was educated by Jesuits, and remained loyal to them throughout the terrible days of the Revolution and the anxious period that followed. He had a varied reading, a great capacity for work, a still greater capacity for self-sacrifice. In order to help his father bear the burdens of a large family, he remained unmarried, obtained an appointment to a notary's office, - work which he heartily disliked, - and devoted the income to the family support, so that at the age of forty he had not a sou to call his own.\nAs a young boy he was presented with many differing political and religious views from his family. For example one of the aunts he lived with had views completely opposed to those of his favourite uncle and he also received opposing views from his maternal grandfather\n[\n30\n]\n:-\n... a physician, with literary tastes and some knowledge of the world,\n[\nwho\n]\nsuggested, on one of the visits of the little Augustin, that he should read, later on, a new book of the day, Chateaubriand's 'Le Genie du Christianisme'\nⓉ\n(\nThe Genie of Christianity\n)\n. The suggestion scandalised the severe principles of the beloved uncle, who set no store by the romantic Christianity of the time. Instead of the dangerous heresy, the uncle selected for his charge the 'Itinéraire de Jerusalem'\nⓉ\n(\nGuide to Jerusalem\n)\n.\nAugustin attended the secondary Collège de Gray between the years\n1809\nand\n1816\n. He showed an interest in politics at a young age and in a France deeply divided between royalists and republicans, he sided with the royalist cause in his youth. This was despite the fact that his teacher at the Collège de Gray was an extremely enthusiastic supporter of Napoleon and took every opportunity to promote Napoleon to his pupils. He read widely while at the Collège, in particular he read:\nBernard de Fontenelle\n's\nEntretiens sur la pluralité des mondes\nⓉ\n(\nInterviews on the plurality of worlds\n)\n(1762)\n, a popular science book explaining the heliocentric model presented by\nCopernicus\n;\nBernard de Fontenelle\n's\nÉloges des académiciens de l'Académie royale des sciences morts depuis l'an\n1699\nⓉ\n(\nObituaries of academicians of the Royal Academy of Sciences who died since the year\n1699\n)\n(1766)\n;\nLaplace\n's\nExposition du système du monde\nⓉ\n(\nExplanation of the system of the world\n)\n(1796)\n, often regarded as the most important book on mechanics after\nNewton\n's\nPrincipia Mathematica\n; and\nPort-Royal Logic\nby\nAntoine Arnauld\ninspired by\nBlaise Pascal\n's writings. Cournot wrote in\n[\n4\n]\n:-\n... these were the books which had a decisive influence on all my subsequent ideas and studies.\nAfter leaving school he spent four years in a lawyer's office but after he had read the correspondence between\nGottfried Leibniz\nand\nSamuel Clarke\nhe decided to enter university\n[\n26\n]\n:-\nIn\n[\nCournot's\n]\nnineteenth year,\nPoinsot\nand Andrezel, general inspectors of the University, came, in the course of their tour, to Besançon. Cournot had heard vague reports of the École Normale at Paris, and had determined to take this opportunity to find out from the inspectors the conditions of admission to the scientific department of the famous school. He hurried off to Besançon, but upon his arrival he was ashamed to approach the inspectors, to whom he was an entire stranger, and, instead of addressing them, he obtained the necessary information from friends in the town. He found that in order to enter the desired department at the École Normale it was necessary to complete a special course of higher mathematics, whereas he had not had so much as an adequate elementary course.\nA preliminary course in mathematics at Collège Royal in Besançon in session\n1820\n-\n21\nprepared him for entry to École Normale Supérieur in Paris. He was taught mathematics at the Collège Royal by Armand Berroyer\n(1775\n-\n1872)\n, an outstanding teacher at the Collège for many years, who went on to become rector of the Academy of Grenoble in\n1825\n. In\n1821\nCournot began his studies at the École Normale Supérieur in Paris. However his time there was disrupted when the École Normale Supérieur was closed down on\n6\nSeptember\n1822\nby the Abbé Frayssinous, the newly appointed grand master of the University of France. A J Nichol writes\n[\n31\n]\n:-\nThe school was abruptly disbanded at the end of his first year. Half the students were immediately appointed to positions in the school system; the others were allowed a very small temporary pension. Cournot found himself in the latter group, being considered lacking in piety. The suspicion was most unjust for Cournot was always a loyal, though unostentatious, son of the Church. Nevertheless, this turn in affairs ultimately proved to be a very favourable one. If he had been sent out into the rural districts at this time to explain \"the square on the hypotenuse,\" he probably would have spent the rest of his life in utter obscurity. As it was, he remained in Paris, and, when his pension expired, found employment as secretary to one of the generals of Napoleon, the Marshal Gouvion Saint-Cyr. Thus he was enabled to continue his studies at the University ...\nCournot, along with his fellow student and friend\nLejeune Dirichlet\n, was taught mathematics at the Sorbonne by\nSylvestre Lacroix\nand\nJean Hachette\n. He said this was the happiest time of his life\n[\n4\n]\n:-\nI had nothing to read, nothing to compose, nothing find, nothing to aim at; I had only to listen and to think: this time has been the happiest of my life.\nThe two friends Cournot and\nDirichlet\nwould attend meetings of the\nAcademy of Sciences\nand were particularly interested in observing\nLaplace\n, the leading mathematical scientist. Cournot wrote in\n[\n4\n]\n:-\n[\nLaplace\n]\nhad a very legitimate pride and, moreover, vanity. He valued his honours, and his noble titles. ... I remember a meeting at the\nAcademy\nwhere a discussion took place between him and\nAmpère\nabout a memoir presented by the latter. \"But, Monsieur le Marquis,\" Monsieur\nAmpère\nwas saying every moment, and the great man seemed to find the repetition of this ceremonial formula quite natural. One day he had invited\nLagrange\nto dinner: \"Shall I put on my senator's robe?\" asked\nLagrange\nin a sly tone in which everyone felt the malice except the senator who was the host.\nIn\n1823\nCournot had became a secretary to Marshal Gouvion Saint-Cyr, who wanted assistance in writing his military memoirs, and also a tutor to his son. This was not the easiest of occupations for Cournot who was finding difficulties with his vision both in his secretarial work and in his university studies. It was an arrangement that lasted for ten years, however, and it allowed him to continue his work in mathematics receiving his doctorate in\n1829\nfor a thesis\nLe mouvement d'un corps rigide soutenu par un plan fixe\nⓉ\n(\nThe motion of a rigid body supported by a fixed plane\n)\n.\nPoisson\nwas impressed with Cournot and, in\n1833\n, he obtained a position for him with the\nAcademy\nin Paris. During this time he translated\nJohn Herschel\n's\nTreatise on astronomy\ninto French; it was published in\n1834\n. Again with\nPoisson\n's recommendation, Cournot was appointed to a newly created chair in analysis at Lyon in\n1834\n. In\n[\n4\n]\nhe writes of\nPoisson\n's opinion of his first papers in mechanics:-\nPoisson\ndiscovered in them a philosophical depth - and, I must honestly say, he was not altogether wrong. Furthermore, from then he predicted that I would go far in the field of pure mathematical speculation but\n(\nas I have always thought and have never hesitated to say\n)\nin this he was wrong.\nIn fact Cournot had begun publishing papers on mechanics before he submitted his thesis. For example\nSur le calcul des conditions d'inégalité, annoncé par M. Fourier\nⓉ\n(\nOn the calculation of the conditions of inequality, announced by M. Fourier\n)\n(1826)\n,\nExtension du principe des vitesses virtuelles au cas ou les conditions de liaison du systeme sont exprimées par des inégalités\nⓉ\n(\nExtension of the principle of virtual speeds to the case where the connection conditions of the system are expressed by inequalities\n)\n(1827)\n, and\nSur les percussions entre deux corps durs, qui se choquent en plusieurs points\nⓉ\n(\nOn the collisions between two hard bodies, which meet at several points\n)\n(1827)\n. This last mentioned memoir studied the impact between two rigid bodies which strike each other with more than six points of contact.\nOn\n24\nOctober\n1835\nCournot became professor of mathematics at Grenoble and rector there. He replaced Louis Antoine Stanislas Ferriot\n(1779\n-\n1859)\nwho had himself replaced Armand Berroyer, who had taught Cournot mathematics at Besançon. Three years later Cournot became inspector general of public education and, on\n10\nSeptember\n1838\n, he married Colombe Antoinette Petitguyot in Gray, Franche-Comté; they had one son, Pierre Cournot\n(1839\n-\n1894)\n. In this same year\n(1838)\nhe published\nRecherches sur les principes mathématiques de la théorie des richesses\nⓉ\n(\nResearch on the mathematical principles of the theory of wealth\n)\nin which he discussed mathematical economics, in particular supply-and-demand functions.\nYou can read an English translation of Cournot's Preface at\nTHIS LINK\n.\nHe also considered conditions for equilibrium with monopoly, duopoly and perfect competition. He considered the effect of taxes, treated as changes in production costs, and discussed problems of international trade. He gives a definition of a market which is the basis for that still used in economics:-\nEconomists understand by the term Market, not any particular market place in which things are bought and sold, but the whole of any region in which buyers and sellers are in such free intercourse with one another that the prices of the same goods tend to equality easily and quickly.\nThis work makes Cournot a pioneer of mathematical economics,\n25\nyears before\nStanley Jevons\n.\nJevons\nhad not seen Cournot's work when he wrote\nThe Theory of Political Economy\nin\n1871\nbut by the time of\nJevons\n' second edition in\n1879\nhe had read Cournot's\n1838\nbook.\nJevons\nwrites in the Preface to this second edition:-\nCournot ...\n[\ntook\n]\nthe palpable facts known concerning the relations of price, production and consumption of commodities, he investigated these relations analytically and diagraphically with a power and felicity which leaves little to be desired. This work must occupy a remarkable position in the history of the subject. It is strange that it should have remained for me among Englishmen to discover its value.\nPoisson\n, a good friend of Courant, died in\n1840\n. In the following year Cournot published\nTraité élémentaire de la théorie des fonctions et du calcul infinitésimal\nⓉ\n(\nElementary treatise on the theory of functions and infinitesimal calculus\n)\nwhich included the following dedication:-\nIn memory of M\nPoisson\n, peer of France, member of the\nAcademy of Sciences\nand of the Royal Council of Public Instruction: Testimony of gratitude and pious attachment.\nThis book contained the lectures he had given when professor in Lyons in\n1834\n. Cournot also worked on\nprobability\nand, although his investigations into a logical foundation for it were unsuccessful, his work did lead the way to future important developments. He published\nExposition de la théorie des chances\nⓉ\n(\nExplanation of the theory of chances\n)\nin\n1843\n, although again he had essentially completed it seven years earlier. He, as\nPoisson\nand\nCondorcet\ndid, applied probability to legal statistics.\nWe mentioned above Cournot's eyesight problems and over the years these became steadily worse. In\n1844\nhe took a year's leave of absence and visited Italy in an effort to recover. Spending some time in Rome, he had an audience with the Pope, Gregory XVI, who surprised Cournot with his joviality and jokes. When he took up his positions again after the year in Italy he seemed able to carry out his duties but was forced to give up mathematical research\n[\n31\n]\n:-\nIt became impossible for him to engage in any long-continued close work with his eyes. He did not give up his companionship with books. Secretaries read aloud to him regularly for hours at a time. He never found any one, however, who could read mathematics to him. Symbols, the meaning and possibilities of which he had once grasped so masterfully through the eye, he was never able to comprehend by ear.\nHe did, however, publish the book\nDe l'origine et des limites de la correspondance entre l'algèbre et la géométrie\nⓉ\n(\nOn the origin and limits of the correspondence between algebra and geometry\n)\nin\n1847\n. Here is a quotation from that work to give an idea of its contents:-\nBut once the facts have been conceived and logically assembled, however this might have occurred, it is then necessary for the perfection of the philosophical order - or for that of the idea that one has to have of the system of science and of the subordination of its parts, - to go immediately to the most general facts, which contain the reason of the particular facts and of their several connections. There is no one who does not feel that the demonstrations of\nPythagoras\n' and\nThales\n' theorems by means of the comparison of areas - such as those given by\nEuclid\nand\nLagrange\nin their 'Elements' - distort the philosophical order, although they are logically irreproachable. On the one hand, they put\nPythagoras\n' theorem before\nThales\n', whereas the latter contains the reason for the former; on the other hand, they subordinate the proof of the arithmetical relations among lengths to the theory of the measurement of areas, while the former relations should depend neither on the consideration of areas, nor on that of their measures.\nIn\n1854\nhe was offered the position of rector of the Academy at Toulouse, which he refused, but said he would go to Dijon. He was then offered the position of rector of the Academy of Dijon which he accepted. He retired in\n1862\nand went to Paris where he spent the rest of his life.\nPerhaps eyesight was not the only reason for Cournot to give up mathematics for he was clearly saddened by the fact that his mathematical approach to economics was not being taken up. He therefore published the book\nPrincipes de la Théorie des Richesse\nⓉ\n(\nPrinciples of the theory of wealth\n)\n(1863)\nin which he presented a non-mathematical approach to economics. In\n1864\nAnne-Paul-Gabriel-Roger de Fontenay\n(1809\n-\n1891)\nreviewed all of Cournot's work on economics concentrating on his\n1838\nbook. The review was partly positive and partly critical and, in many ways, influenced by Cournot's non-mathematics book of\n1863\nwhich, Roger de Fontenay felt, showed him to be an amateur economist when it came to social economy. Cournot reacted badly to the review, concentrating on the negative aspects and ignoring the positive ones. He wrote in\n1877\n(\nsee, for example,\n[\n17\n]\n)\n:-\nConsider my rotten luck! However much my\n1838\nwork might have gained belated acceptance without my interference, I ruined its prospects in\n1863\n. However much my algebra could be defended in retrospect, according to the publisher, my prose\n(\nI am ashamed to say\n)\nwas less successful. The 'Journal des Economistes'\n(\nAugust\n1864)\n[\nRoger de Fontenay's review\n]\ncriticised me for \"not having advanced beyond Ricardo,\" and for ignoring the discoveries of many capable economists of the last twenty-five years: thus the wretched author that none of the orthodox French economists wanted to cite was reproached for not having cited enough other authors.\nNow although he did not publish any further mathematical works, Cournot did publish several books such as\nDes institutions d'instruction publique en France\nⓉ\n(\nPublic education institutions in France\n)\n(1864)\n,\nConsidérations sur la marche des idées et des événements dans les temps modernes\nⓉ\n(\nConsiderations on the march of ideas and events in modern times\n)\n(1872)\n,\nMatérialisme, vitalisme, rationalisme: études sur l'emploi des données de la science en philosophie\nⓉ\n(\nMaterialism, Vitalism, Rationalism: Studies on the use of data from science in philosophy\n)\n(1875)\nand\nRevue sommaire des doctrines économiques\nⓉ\n(\nSummary of economic doctrines\n)\n(1877)\n.\nCournot is also well known for his views on scientific knowledge. He wrote in\nEssai sur les fondements de nos connaissances philosophiques et sur les caractères de la critique philosophique\nⓉ\n(\nEssay on the foundations of our philosophical knowledge and on the characteristics of philosophical criticism\n)\n(1851)\n:-\n... scientific knowledge is the sign of great achievement and alone is truly capable of cumulative and indefinitely pursued progress.\nFor further information about this work, including extracts from the\nEssai\nand extracts from reviews, see\nTHIS LINK\n.\nAfter Cournot died at the age of\n75\n, he was buried in Cimetière de Montparnasse in Paris.\nWe know a considerable amount about Cournot's life because of the autobiographical notes he wrote and were published as\n[\n4\n]\n. The story of how these survived and came to be published is interesting. Cournot wrote his autobiography on scraps of paper, in tiny, barely legible writing. In\n1859\nhe asked Langeron, his private secretary from\n1856\nto\n1861\n, to make a fair copy of his notes; he read the copy and then destroyed the original notes. This manuscript was then hidden by Cournot, who did not want it to be published during his lifetime. After his death, his son, Pierre Cournot, did not consider it necessary to publish it either. He contented himself with having three copies made in\n1880\nof which only one survived, given to Eugène Cournot, Augustin Cournot's younger brother. Finally, in\n1913\n, Cournot's memoirs were published by the Abbé E Paul Bottinelli from this copy which was by then in the hands of Antoinette Donnaud, grandniece and goddaughter of Augustin Cournot. On\n10\nJune\n1942\nMme Bouvier Banguillon née Antoinette Donnaud added a handwritten note to one of Bottinelli\n1913\npublished versions, confirming again the above details.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Logic",
    "Statistics"
  ]
}