{
  "nome_completo": "Aurel Angelescu",
  "nome_curto": "Aurel Angelescu",
  "ano_nascimento": "1886",
  "ano_morte": "1938",
  "link": "https://mathshistory.st-andrews.ac.uk/Biographies/Angelescu/",
  "lugar_nascimento": "Ploiești, Prahova County, Romania",
  "lugar_morte": "Bucharest, Romania",
  "biografia": "Aurel Angelescu\nwas born at Ploiești on April\n15\n,\n1886\n. Ploiești, the county town of Prahova County, is situated about\n55\nkm north of Bucharest. Angelescu attended both primary and secondary school in Ploiești. The high school he attended was named 'Sfintii Petru si Pavel'\n(\nSt Peter and St Paul\n)\n. The school was given this name in\n1866\nbut the buildings that Angelescu studied in on Independence Boulevard were only completed about the time he began to study there. The older buildings are now the Museum of History and Archaeology of Prahova County while the school continues to operate but is now named the National College \"Ion Luca Caragiale\". Angelescu loved mathematics and his interest in the subject was heightened throughout his time at this high school by the journal\nGazeta Matematica\n(\nThe Mathematical Gazette\n)\nand he began to make numerous contributions to this publication. In his final year at the St Peter and St Paul high school in Ploiești he was taught by the outstanding mathematician\nNicolae Abramescu\n.\nAbramescu\nhad graduated from the University of Bucharest in\n1904\nand, later that year, he was appointed as a substitute teacher in the secondary school of St Peter and St Paul in Ploiești. Angelescu was in the eighth grade at this high school when he attended\nAbramescu\n's course on Analytical Geometry which later was published as the book\nLectures in Analytical Geometry for Eighth Grade Students\n(1907)\n. Later in life,\nAbramescu\nwas proud of the fact that one of the first students he taught, namely Aurel Angelescu, went on to surpass his teacher as a mathematician.\nAurel Angelescu went to Paris for his university studies and graduated with a bachelor degree from the Sorbonne. On\n7\nApril\n1916\nhe was awarded\n(\nalso from the Sorbonne\n)\nthe degree of Ph.D. in Mathematics, after writing a thesis under the guidance of\nPaul Appell\n. The title of his thesis was\nSur les polynômes généralisant les polynômes de Legendre et d'Hermite et sur le calcul approché des integrals multiples\nⓉ\n(\nOn polynomials generalising the Legendre and Hermite polynomials and the approximate calculation of multiple integrals\n)\n. In his book\nFonctions hypergéométrique et hyperspheriques. Polynômes d'Hermite\n, published in\n1926\n,\nAppell\nwrites about the results in Angelescu's thesis.\nAppell\nalso mentioned Angelescu's results on\nHermite\npolynomials in his\n1925\nmemoir\nSur les fonctions hypergéométrique de plusiers variables, les polynômes d'Hermite et autres fonctions sphérique dans l'hyperespace\nⓉ\n(\nOn the hypergeometric functions of several variables, Hermite polynomials  and other spherical functions in hyperspace\n)\n.\nAfter his return to Romania, following the recommendation of\nGheorghe Țițeica\n, Aurel Angelescu was appointed, on\n1\nNovember\n1919\n, as a professor at the Function Theory Chair of the University of Cluj. Now Cluj had, with the rest of Transylvania, been incorporated into Romania with the Treaty of Trianon in\n1919\n. The University in Cluj, which had been named the Franz Joseph University since\n1881\n, became a Romanian institution and was officially opened as such by King Ferdinand on\n1\nFebruary\n1920\n. Angelescu was fully dedicated to the intense work of organizing mathematical education at the University. Here, together with\nNicolae Abramescu\n,\nPetre Sergescu\nand Gheorghe Bratu, he formed a strong and valuable kernel around\nDimitrie Pompeiu\n, the Director of the Mathematical Seminar. Angelescu's position at Cluj was tenured in\n1922\n. He became director of the Geometry and Mechanics Seminar and, for one year, between\n1927\nand\n1928\n, he was appointed as Dean of the Faculty of Sciences at the University of Cluj. He was also one of the founders of the new journal\nMathematica\n(\nCluj\n)\nwhich began publishing in\n1929\n. Beginning on\n1\nJanuary\n1930\n, Angelescu became full professor of Algebra and Number Theory at the University of Bucharest. There he succeeded Traian Lalescu. He held this position until his death in\n1938\n.\nAurel Angelescu's main fields of interest were generating functions for polynomials, linear differential equations, functional analysis, trigonometric series and the general theory of algebraic equations. He was particularly interested in generating functions for\nLegendre\n,\nLaguerre\nand\nHermite\npolynomials and one of his main research efforts was put into generalising these polynomials. He published more than\n60\nresearch works in the field of Algebra and Function Theory. Examples of his contributions are:\nExtrait sur les polynomes\nⓉ\n(\nA note on polynomials\n)\n(1915)\n;\nSur le quardatures méchanique\nⓉ\n(\nOn mechanical quadratures\n)\n(1920)\n;\nOn the linear homogeneous recurrence relations with constant coefficients\n(\nRomanian\n)\n(1925)\n;\nThe definition of the functions of complex variable\n(\nRomanian\n)\n(1925)\n;\nSur certains développements des fonctions holomorphes en série de fractions rationnelles\nⓉ\n(\nOn some expansions of holomorphic functions in series of rational fractions\n)\n(1925)\n;\nSur une formule de M Pompeiu\nⓉ\n(\nOn a formula of  Pompeiu\n)\n(1929)\n;\nOn some means\n(\nRomanian\n)\n(1932)\n;\nSur le principe de Legendre\nⓉ\n(\nOn the principle of Legendre\n)\n(1933)\n;\nSur une certaine extension des séries entières\nⓉ\n(\nOn a certain extension of power series\n)\n(1937)\n; and\nSur certains polynômes généralisant les polynômes de Laguerre\nⓉ\n(\nOn some polynomials generalizing Laguerre polynomials\n)\n(1938)\n. The polynomials, generalising the\nLaguerre\npolynomials, which Angelescu defined in this\n1938\npaper are today known as the 'Angelescu polynomials'.\nAngelescu played a large role in producing new lecture courses at the University of Cluj and he published many of these, some as single authored works and others along with his colleagues. His most important book was\nLectures on Differential Calculus\n(\nRomanian\n)\n(1927)\n. He also partly wrote and was the editor of\nLectures on Mathematical Analysis: sets, limits, series, derivatives and differentials, extreme points, change of variables\n(\nRomanian\n)\n(1927)\n. He published some of his lectures notes as\nCourse of higher algebra\n(\nRomanian\n)\n(1931)\n. He wrote many other books in Romanian, in collaboration with\nDimitrie Pompeiu\n, Dumitru V Ionescu, Gheorghe Bratu and\nO Onicescu\n, such as\nElementary Algebra\n,\nArithmetic\n, and\nGeometry\n. These ran to many editions.\nAngelescu was elected to the\nRomanian Academy of Sciences\non\n21\nDecember\n1935\n.\nAt the young age of almost\n52\nyears, Professor Aurel Angelescu tragically died in April\n1938\n. It appears that he took his own life but he did not leave anything to explain why he did this.",
  "math_areas": [
    "Algebra",
    "Analysis",
    "Applied Mathematics",
    "Calculus",
    "Geometry",
    "Number Theory"
  ]
}